{"id":111277,"no":30,"title":"Page 30","content":"\u003cp\u003eThough Damon wanted to die alone, I had unfinished business to attend to. I made my way from the quarry and began to walk back to the estate. The woods smelled like smoke, and the leaves were starting to turn. They crunched under the worn boots I had on my feet, and I remembered all the times Damon and I had played hide-and-seek as children. I wondered if he had any regrets, or if he felt as empty as I did. I wondered if we\u0027d see each other in Heaven, being as we were. I walked toward the house. The carriage house was charred and burned, its beams exposed like a skeleton. Several of the statues around the labyrinth were broken, and torches and debris littered the once-lush lawn. But the porch light at the main house was on, and a buggy stood at attention beneath the portico.\u003c/p\u003e\n\u003cp\u003eI walked around the back and heard voices coming from the porch. Immediately, I dove under the hedges. Hidden by the leaves, I crawled on my hands and knees against the wall until I came to the bay window that looked into the porch. Peering in, I made out the shadow of my father. A single candle cast weak beams of light around the room, and I noticed that Alfred wasn\u0027t in his normal spot sitting at the door, ready to instantly greet guests. I wondered if any of the servants had been killed.\u003c/p\u003e\n\u003cp\u003e\"More brandy, Jonathan? Laced with vervain. Not that we need to worry anymore,\" Father said, his words floating out the door.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Giuseppe. And thank you for having me here. I realize you have much on your mind,\" answered Jonathan somberly, as he accepted the tumbler. I saw the concern etched on Jonathan\u0027s face, and my heart went out to him for the terrible truth he\u0027d had to learn about Pearl.\u003c/p\u003e\n\u003cp\u003e\"Y Thank you,\" Father said, waving off the\u003c/p\u003e\n\u003cp\u003ees. thought. \"But it\u0027s important that we end this sad chapter of our town\u0027s history. It is the one thing I want to do for my sons. After all, I do not want the Salvatore legacy to be that of demon sympathizers.\" Father cleared his throat. \"So the battle of Willow Creek happened when a group of Union insurgents mounted an attack on the Confederate camp,\" he began in his sonorous baritone voice, as if telling a story.\u003c/p\u003e\n\u003cp\u003e\"And Stefan and Damon hid out in the woods to see if they could find any rogue soldiers, and at that point ...,\" Jonathan continued.\u003c/p\u003e\n\u003cp\u003e\"At that point they were tragically killed, just like the twenty-three other civilians who died for their country and their beliefs. It was a Confederate victory, but it came at the cost of innocent lives,\" Father said, raising his voice as if to make himself believe the story he was weaving.\u003c/p\u003e\n\u003cp\u003e\"Y And I\u0027ll speak with the Hagertys about\u003c/p\u003e\n\u003cp\u003ees. creating a monument. Something to acknowledge this terrible period in our town\u0027s history,\" Jonathan murmured.\u003c/p\u003e\n\u003cp\u003eI raised myself up on my knees, peeking through a spot at the corner of the window. I saw Father nodding in satisfaction, and cold seeped through my veins. So this was the legacy of my death--that I was killed by a band of degenerate soldiers. Now I knew I needed to speak to Father more than ever. He needed to hear the whole truth, to know that Damon and I weren\u0027t sympathizers, to know that the problem could have been cured without so much bloodshed and violence.\u003c/p\u003e\n\u003cp\u003e\"But Giuseppe ... ?\" Jonathan asked, taking a long drink from his tumbler.\u003c/p\u003e\n\u003cp\u003e\"Y Jonathan?\"\u003c/p\u003e\n\u003cp\u003ees,\u003c/p\u003e\n\u003cp\u003e\"It is a triumphant moment in our town\u0027s history. The vampires are destroyed, and their bodies will turn to dust. We rid the town of the scourge, and thanks to the burning of the church, it will never come back. There were hard choices and heroism, but we won. That is your legacy,\" Jonathan said as he slammed his ledger closed with a definitive thump.\u003c/p\u003e\n\u003cp\u003eFather nodded and drained his own tumbler, then stood up. \"Thank you,\" he said, holding out his hand. I watched as the two men shook hands, then watched as Jonathan disappeared into the shadows of the house. A moment later, I heard his carriage being hitched and the horses riding away. I crawled to the edge of the hedgerow. I stood up, my knees creaking, and walked through the door and into the house that was once mine.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/stefan-s-diaries-origins-the-vampire-diaries-1/page-30.html","bookId":2068,"creation":"Oct 6, 2019 12:20:40 AM","modification":"Oct 6, 2019 12:20:40 AM"}
