{"id":34324,"no":11,"title":"CHAPTER X THE YOUNG SAILOR","content":"\u0026nbsp;The crew of the Nantucket consisted of twelve sailors and a boy, not counting the officers. This boy was about Harry’s age, but an inch or two shorter, and with great breadth of shoulders. He had a good-natured face, and was a general favorite on board, as is apt to be the case with a boy, if he possesses any attractive qualities. He came from New Hampshire and he was known as Jack. \n\u003cdiv\u003e\n It was natural that Harry, as the only other boy on board, though a passenger, should be attracted to Jack. He took an opportunity when Jack was off duty to have a chat with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long have you been a sailor, Jack?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Three years; I first went to sea when I was thirteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you happen to go in the first place?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may say to begin with, that I always liked the water. I was born in a little village bordering Lake Winnipiseogee, and was out on the lake whenever I could get the chance, either in a rowboat or sailboat. I felt as much at home on the water as on the land. Still, I never should have gone to sea had it not been for my stepfather.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you have a stepfather?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. My father died when I was ten, leaving my mother a little farm and a comfortable house. I was a young boy, and it is hard for a woman to carry on a farm. A man came into town, and started in some small business. He pretended that he had money, but I guess he had precious little. At any rate, he didn’t object to more. Pretty soon he fixed his eyes on our farm, and, finding that mother owned it clear, he got to coming round pretty often. I never liked him, though he pretended to be fond of me, and used to pat me on the head, and bring me candy. I wondered what made him come so often, but I didn’t mistrust anything till one day mother called me and said she had something important to say to me.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Jack,’ she said, ‘what do you think of Mr. Bannock?’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘I don’t think much of him,’ I answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘He is to be your father, Jack. I have promised to marry him.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘You may marry him,’ I answered hotly, ‘but he will be no father of mine. My father lies in the churchyard. I wish he were alive again.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘So do I, Jack’ said mother, wiping her eyes, ‘but we know that can’t be.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did he treat you, Jack?” asked Harry, interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He never liked me, and I didn’t like him at all He tried to impose upon me, and order me round, but he didn’t make out much. Still, he was always annoying me in mean little ways, and finally I got all I could stand, and the long and short of it is that I ran away to Portsmouth, and went on a coasting voyage. After I got back I shipped from Boston for Liverpool, and ever since I’ve kept sailing in one direction or another. This will be my longest voyage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t you been to see your mother since you left home three years ago?” Harry inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I have,” said Jack, promptly. “I always go to see her as soon as I get home from a voyage. Poor mother! She was looking pale and thin when I saw her three weeks ago. I am sure she has repented marrying, but she won’t own up. When I’m a man——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Jack; when you’re a man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll see that she has a better time, and if old Bannock don’t like it he can clear out. I think he will anyway.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Clear out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he will have spent all the property by that time, and when that is done, he won’t make much objection to going away. Then I will take care of mother, and see that she does not suffer for anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right, Jack. I sympathize with you. I hope you’ll succeed. I only wish I had a mother to look out for,” and Harry’s fine face wore an expression of sadness. “But there’s one thing I can’t help saying, though I don’t want to discourage you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that, Harry?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t see how you are going to lay up much money in going before the mast. Your pay must be small.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is. I only earn ten dollars a month,” replied Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And out of that you must buy your clothes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that’s true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then how do you expect to better yourself?” asked Harry, looking perplexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you, if you won’t say anything about it,” answered Jack, in a lower tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go ahead.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are going to Australia, you know. I’ve heard there are good chances of making money there, in mining or herding cattle, and I mean to leave the ship at Melbourne. Of course, I don’t want anything said about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think the captain would try to prevent you, Jack?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he would. He don’t like me, at any rate.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is more than I can tell, but I can see that he has a prejudice against me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys were so absorbed in their talk that they did not notice the approach of the captain till his harsh voice was heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you two boys chattering about?” he demanded, with a frown.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack turned round startled, but Harry faced the captain calmly, and did not speak.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you answer me?” he repeated, raising his voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was talking about home and my mother,” said Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mighty interesting, upon my word! And what were you talking about?” continued Captain Hill, turning to Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That can be of no interest to you, Captain Hill,” said Harry, coldly. “You appear to forget that I am a passenger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he walked away, the captain regarded him with an ominous scowl. He wished that for fifteen minutes Harry had been one of the crew. It was fortunate for Jack that his temper was diverted, for, apparently forgetting the young sailor, he strode on, and Jack managed to slip down to the forecastle.\n\u003c/div\u003e \n\u003cdiv\u003e\n This was not by any means the last conversation Harry had with Jack Pendleton—for this he found to be the young sailor’s name—and they soon became excellent friends.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jack,” said Harry, one day, “I never should take you to be a sailor if I met you on land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because you talk like a well-educated boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I am. I was always fond of my books, and stood high in school. But for my stepfather I might be there yet. As it is, my education stopped at the age of thirteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not necessarily. You have learned a good deal since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but not of books. I hope sometime to be able to continue my studies. At present it is my business to learn seamanship.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry had the more time on his hands, as his traveling companion, the professor, took sick, and was confined for three or four weeks to his cabin. There was no danger, but still the ship’s surgeon advised him to stay below.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What makes you keep company with that boy, Mr. Vane?” asked Montgomery Clinton, who would have liked more of Harry’s society himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he is a common sailor, don’t you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he is rather an uncommon sailor. He is very well educated.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes; I suppose he can read and write; but, of course, he can never be admitted into society, don’t you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t, Mr. Clinton. He may be a captain some day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he isn’t now. I give you my word, I noticed this morning, when you were speaking with him, that his fingers were all soiled with tar. That’s horrid, don’t you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you think he’s a good-looking boy, Mr. Clinton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, yes; I suppose, for one of the lower order, Mr. Vane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You forget we don’t have any distinction of classes in America.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t we though? By Jove! Mr. Vane, you don’t put yourself on a level with those creatures that dig ditches and climb masts, and such things?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your sentiments are very undemocratic, Mr. Clinton. You ought to have been born in England.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had been. I like their institutions a good deal better than ours, don’t you know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I first spoke with you, Mr. Clinton, I thought you might be an Englishman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you, really?” inquired Clinton, with evident pleasure. “I’m often taken for an Englishman, on my honor. I don’t know why it is, but positively, I’m often asked when I came from the other side.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you rather be taken for an Englishman than an American?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you see, there are some Americans that are so vulgar, don’t you know—talk through their noses, and all that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where were you born, Mr. Clinton?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In Massachusetts, not far from Boston.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way, Mr. Vane, are you descended from Sir Henry Vane, one of the royal governors of Massachusetts? I have been meaning to ask you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t tell you, Mr. Clinton; but my name happens to be the same—Harry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, that is very interesting. I should think you would look up the matter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I will when I return home!” said Harry, who cared very little about the matter. From this time, however, Clinton regarded him with increased respect, and manifested an increased liking for his society, from his supposed aristocratic lineage. Our hero treated him with good-natured toleration, but much preferred the company of Jack Pendleton, sailor as he was, though his fingers were not infrequently smeared with tar. Harry did not mind this; but was attracted by the frank, good-humored face of young Jack, and was always glad to have a chat with him. He had a chance, though at considerable personal risk, to do him a signal service before long.\n\u003c/div\u003e \n\u003cdiv\u003e\n The captain’s habits, it must be said, did not improve. His stock of liquor was ample, and he continued to indulge himself. Generally he kept within safe bounds, but at times he allowed his appetite to get the better of him. Whenever that happened, it was fortunate if he drank himself into a state of stupefaction, and remained in his cabin, leaving the management of the ship to the mate, Mr. Holdfast, who was thoroughly temperate. Unfortunately, he was not always content to remain in the cabin. He would stagger upstairs and give orders which might or might not, be judicious.\n\u003c/div\u003e \n\u003cdiv\u003e\n One day—it was about a month after they left port—Captain Hill came up on deck in one of his worst fits of intoxication. All the passengers were on deck, it being a fair day. They regarded the captain with alarm, for in his hand he held a pistol, which he carried in such careless style that it might be discharged at any time.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack Pendleton had been sent up to the masthead on some duty by the mate. The captain’s roving eyes fell upon him, and the dislike he felt for the boy found vent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing up there, you young lubber?” he shouted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Holdfast sent me,” answered Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You lie!” roared the captain. “I’ll teach you to lie to me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll come down, sir,” said Jack, “if you say so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll bring you down!” shouted the captain, furiously, as he deliberately pointed the pistol at the cabin boy, and prepared to pull the trigger.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a cry of horror on the part of the passengers as they saw the insane act of the captain, and realized the peril of poor Jack. But, in spite of all, the boy would probably have fallen a victim to the drunken fury of Captain Hill. Jack himself fully understood his danger, and his ruddy face turned pale. His life hung in the balance, and was saved only by the courage of his boy friend, Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all the passengers, Harry stood nearest to the captain. When he saw the pistol pointed at Jack, he did not stop to think, but made a bound, and dashed the weapon from the captain’s hand. It was discharged but the bullet sped over the rail and dropped into the ocean. Nor did Harry stop here. He seized the fallen pistol, and hurled it over the side of the vessel.\n\u003c/div\u003e \n\u003cdiv\u003e\n The captain was for the moment stupefied by the suddenness of the act. Then, in a voice of fury, he exclaimed, pointing to Harry: “Put that boy in irons!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2964/81594.html","bookId":385,"creation":"Aug 5, 2019 5:34:06 AM","modification":"Aug 5, 2019 5:34:06 AM"}
