{"id":34320,"no":7,"title":"CHAPTER VI AN EXCITING CHASE","content":"\u0026nbsp;When John Fox went to the village he usually stopped first at the tavern, and invested ten cents in a glass of whisky. Here he met two or three of his cronies. \n\u003cdiv\u003e\n “Folks say you’ve got a new boarder, Fox,” said Bill Latimer, as he laid down his glass on the counter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Fox, complacently. “I’m his guardeen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Folks say he got a pile of money for saving the train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He got a pretty stiff sum,” answered Fox cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you keep his money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he easy to manage?” asked John Blake.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, some folks might find trouble with him,” said Fox, complacently. “The fact is, gentlemen, I don’t mind telling you that he’s been trying to buck agin’ his guardeen a’ready. Where do you think I left him?” continued Fox, chuckling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Up in the attic, locked up in his chamber. I’m goin’ to feed him on bread and water a while, just to show him what sort of a man John Fox is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A grin overspread the face of Eben Bond, who had just looked out of the front window.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you left him in the attic, hey?” he said, waggishly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I did. Do you mean to say I didn’t?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m willin’ to bet he isn’t there now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You just tell me what you mean, Eben Bond!” said John Fox, provoked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that I saw that boy of yours go by the tavern only two minutes since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did he go? In what direction?” demanded Fox, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Down toward the river.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s running away,” Fox said to himself, in dismay. “How in the the world did he get out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He ran up the road, gazing anxiously on this side and on that, hoping to come upon the runaway. One thing was favorable; it was a straight road, with no roads opening out of it at least a mile beyond the tavern. It led by the river at a point half a mile on.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll catch him yet. He can’t escape me!” Fox reflected.\n\u003c/div\u003e \n\u003cdiv\u003e\n John Fox pushed on breathless, and a minute later came in sight of the fugitive.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry had sobered down to a walk, thinking himself no longer in danger. If Mr. Fox had been wise enough to keep silent till he had come within a few rods he might have caught him easily, but excitement and anger were too much for prudence, and he called out, angrily: “Just wait till I get hold of you, you young villain! I’ll give you a lesson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry turned quickly and saw his enemy close upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n That was enough. He set out on what the boys call a dead run, though he hardly knew in what direction to look for refuge. But through the trees at the west side of the road he caught sight of something that put new hope into his heart. It was a boat, floating within three feet of shore. In it sat a boy of about Harry’s own age. It was Willie Foster.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no time for ceremony, Harry sprang into the boat, and, seizing an idle oar, pushed out into the river.\n\u003c/div\u003e \n\u003cdiv\u003e\n The owner of the boat, who had been thoughtfully gazing into the water, looked up in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, that’s cool!” he ejaculated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I beg your pardon,” said Harry, still plying the oar; “I couldn’t help it; Mr. Fox is after me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John Fox, by this time, stood on the river bank shaking his fist, with a discomfited expression, at his intended victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come back here!” he shouted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, I would rather not,” answered Harry, still increasing the distance between himself and his guardian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You Willie Foster, row the boat back!” bawled John Fox,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is your name Willie Foster?” asked Harry, turning to his companion, who was looking, with a puzzled expression, from one to the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, Willie, if you will help me row over to the other side of the river and set me off there, I’ll give you a dollar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it,” said Willie, seizing the other oar, “but you needn’t give me any money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To his intense disgust, Fox saw the boat, propelled by the two boys, leaping forward energetically, while he stood helplessly on the bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n The other bank was half a mile away, and could not be reached except by a bridge a considerable distance away. The two boys said little until the trip was accomplished.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you won’t get into any serious trouble with Mr. Fox,” said Harry, as they drew near the bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care for old Fox, and father doesn’t like him, either.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he got out of the boat he pressed a dollar into Willie’s reluctant hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, which way had I better go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take that footpath. It will lead to Medfield. There you can take the cars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by, Willie; and thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Willie didn’t row back immediately. John Fox was lying in wait on the other side, and he didn’t care to meet him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry pushed on till he reached a highway. He felt in doubt as to where it might lead him, but followed it at a venture. He wondered whether John Fox would pursue him, and from time to time looked back to make sure that his guardian was not on his trail. In about three hours he found himself eight miles away. Then, for the first time, he felt that it might be safe to stop and rest. In a village a little way back he had entered a bakeshop and purchased some rolls and a glass of milk, which he ate with a good relish.\n\u003c/div\u003e \n\u003cdiv\u003e\n He resumed his walk, but had not gone a quarter of a mile when he heard the noise of wheels, which on coming up with him, came to a halt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I give you a lift?” said the driver of the team.\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking up, he saw that it was a covered wagon with four wheels, such as is often to be met in New England towns. The man who held the reins was of large frame and portly, with dark hair and whiskers. He might be about forty-five years of age.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir, said Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you bound, if you don’t mind my being inquisitive?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” answered Harry, doubtfully. “I’m seeking my fortune, as they say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well you ought to find it,” returned the other, after a deliberate survey of his young companion. “You’re well-built, and look healthy and strong. Have you got any money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little. My father died lately and left me three hundred dollars. He recommended to me as guardian a man named John Fox, living eight miles back. Well, I have tried Mr. Fox, and I prefer to be my own guardian.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve heard of John Fox. He’s fox by name and fox by nature. So you and he didn’t hitch horses. When did you leave him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This morning. I don’t know but I may say that I am running away from him, as I left without his knowledge or permission, but as he is not yet my legal guardian, I don’t consider that he has any right to interfere with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven’t told me your name yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My name is Harry Vane.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am the Magician of Madagascar. You may have heard of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I have,” said Harry, puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been before the public many years,” he said. “I give magical entertainments, and, in the course of the last twenty years, have traveled all over the continent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see,” explained Harry, apologetically, “I have always lived in a small country town, where there were few amusements, and so I know very little of such things. I never saw a magical entertainment in my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t you, indeed? Then you shall see me perform to-night. I am to give a magical soiree in Conway, the town we are coming to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like it very much, Mr. ——” and Harry paused in doubt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am called Professor Hemenway—Hiram Hemenway,” said the magician.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you like your business?” asked Harry, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I? I have a chance to travel. The people appreciate my efforts and reward me generously.”\n\u003c/div\u003e \n\u003cdiv\u003e\n By a fortunate accident Harry happened to turn in his seat and look through a small window in the back part of the wagon. What he saw startled him. In a buggy, ten rods back, he recognized his late guardian and Joel. They were making good speed, and were doubtless in pursuit of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry quickly imparted his discovery to his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t let them capture me!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to see him do it,” responded the professor. “Get into the back part of the wagon, and crouch down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry did as directed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the professor slackened his speed, and allowed the pursuers to overtake him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, stranger,” said Fox, as he drew up alongside. “A boy ran away from me this morning. Perhaps you have seen him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw a boy about a mile back,” said the magician, reflectively, “a stout, good-looking lad, dark-brown hair, and a pleasant expression; didn’t look at all like you. I chatted with him a while. He said he was leaving a man who claimed to be his guardian, but wasn’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The young liar!” ejaculated Fox, wrathfully. “Where is he now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he in your wagon?” put in Joel, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he were you’d see him, wouldn’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In behind you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, are you kidnapping him?” demanded Fox, fiercely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is a boy in the back part of my wagon,” said the magician, coolly. “If you ain’t afraid of smallpox, you may see him. Which shall it be, you or the boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n A pallid hue overspread the face of John Fox, which was increased by an agonizing moan, which appeared to proceed from behind the magician.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Turn the horse, Joel,” was all he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n He whipped up his horse without a word, and did not pull up for half a mile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can come out now, Harry,” said the professor, with a queer smile. “I am a ventriloquist, and that moan did the business.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2964/81590.html","bookId":385,"creation":"Aug 5, 2019 5:34:06 AM","modification":"Aug 5, 2019 5:34:06 AM"}
