{"id":74913,"no":13,"title":"Page 13","content":"\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eLana\u003c/p\u003e\n\u003cp\u003e“No, Daddy. It isn’t that I don’t want to be there. I do. It’s just that I’ve never been in New York City and I’ve never met Shandra. I’d feel more comfortable if I could bring someone with me.”\u003c/p\u003e\n\u003cp\u003e“You can bring anyone but your mother. I don’t want to have to deal with her. I do want you to make time to spend with Shandra. She really wants to get to know you. We’ve got some special news for you.”\u003c/p\u003e\n\u003cp\u003e“Special news?”\u003c/p\u003e\n\u003cp\u003eDad cleared his throat and, covered the receiver on his phone, and spoke in a muffled voice to someone else. What other news could he have? He’d already dropped the marriage bomb on me. Surely, they weren’t moving to Alpharetta. That would be disastrous. My mother would not be able to leave the house without thinking everyone was talking about her or pitying her.\u003c/p\u003e\n\u003cp\u003e“Shandra wants me to go ahead and tell you. That way you can be prepared when you get here.”\u003c/p\u003e\n\u003cp\u003e“Okay—” I replied waiting with a sick knot in my stomach.\u003c/p\u003e\n\u003cp\u003e“You’re going to be a big sister,” he replied. His excitement was unmistakable.\u003c/p\u003e\n\u003cp\u003e“What? How? Does Shandra have a kid?” Nothing else made sense. Why would he think I’d be excited over a step-sibling I’d never get a chance to know?\u003c/p\u003e\n\u003cp\u003e“No, Shandra doesn’t have a kid, yet. You know how. You’re eighteen years old, Lana. You know how babies are made... don’t you? I assumed your mother explained that—”\u003c/p\u003e\n\u003cp\u003e“I KNOW how babies are made Daddy. What I don’t understand is... wait... she’s pregnant?” I asked in horror. My dad had gotten someone pregnant? He was almost fifty! Could old men do that? Ugh! Yuck. He was going to be like the kid’s grandfather.\u003c/p\u003e\n\u003cp\u003eDad chuckled into the phone, “Yes, Shandra is pregnant. We’d planned on getting married this Christmas. She loves Christmas in New York but well, the baby will be here by Christmas so instead of waiting we decided to go ahead and have a summer wedding.”\u003c/p\u003e\n\u003cp\u003eI was speechless. How did one respond to this kind of news? I sank down on the backdoor steps of Ashton’s house and rested my forehead on my knees.\u003c/p\u003e\n\u003cp\u003eMy dad continued to chatter on about the wedding and baby plans. They would be moving out of Manhattan and to New Jersey so that they could afford a house. I wouldn’t have a room but I could share the baby’s room when I came to visit. He told me I was welcome anytime.\u003c/p\u003e\n\u003cp\u003e“Lana?” Sawyer’s voice was a welcome distraction.\u003c/p\u003e\n\u003cp\u003eLifting my head, I stared up at Sawyer who was standing in front of me with a worried frown. I wondered how much he’d heard.\u003c/p\u003e\n\u003cp\u003e“Daddy, I need to go. My, uh, friend just got here and we have plans. I’ll call you back later when I’ve decided what to do.”\u003c/p\u003e\n\u003cp\u003e“You are coming though—”\u003c/p\u003e\n\u003cp\u003e“I’m not sure Daddy, I need to go now. I’ll call when I know.” I clicked end before he could say anymore. I couldn’t yet stand up to leave; I needed a moment.\u003c/p\u003e\n\u003cp\u003e“You okay?” Sawyer asked, lowering himself to sit down beside me when it was obvious I wasn’t about to get up.\u003c/p\u003e\n\u003cp\u003eI started to nod my head and ended up shaking it “no” instead.\u003c/p\u003e\n\u003cp\u003eHis arm wrapped around my shoulders and he pulled me up against his side. That small offer of comfort caused my eyes to fill with tears. I buried my head into the curve of his arm, and tried to muffle the sob I couldn’t control.\u003c/p\u003e\n\u003cp\u003eSawyer didn’t try to offer me any encouragement or pointless words. Instead, he held me tighter and dropped small little kisses on my hair, temple and forehead as I cried in his arms. I’d never really cried on anyone before. Opening myself up to sharing my emotions was new for me. The part of me that was shocked by this behavior was pushed aside as I soaked in all the comfort I could get. This would be fleeting but while I had it, I would take it.\u003c/p\u003e\n\u003cp\u003eAfter several minutes, I managed to control my tears. Reaching up, I wiped at my face. Thankfully, Dad had called me before I had a chance to put on makeup. I’d have been humiliated if I’d smeared mascara all over Sawyer’s white polo shirt.\u003c/p\u003e\n\u003cp\u003e“You want to talk about it?”\u003c/p\u003e\n\u003cp\u003eSharing with Sawyer how my dad had a pregnant twenty-three year old fiancée wasn’t something I’d ever do. It was too much for me to take in. I didn’t want to see pity in his eyes when he looked at me. I preferred the lust or attraction. If he pitied me, I wouldn’t be able to deal with it.\u003c/p\u003e\n\u003cp\u003e“No,” I replied, sitting back up and checking to see how wet I’d gotten his shirt.\u003c/p\u003e\n\u003cp\u003e“I’ll dry,” he assured me with a smile. I could still see the concern in his eyes as he searched my face. Part of me wanted him to know everything about me. Except a bigger part knew he’d never look at me the same if he knew how pathetic my life really was.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eSawyer leaned forward and placed a soft kiss on each corner of my mouth before covering my mouth with his. He didn’t try to get me to open up for him. Instead, he kept it gentle and sweet. “Mmmmm—I’ve been thinking about those sweet lips all morning,” he whispered against my mouth.\u003c/p\u003e\n\u003cp\u003eMelting into him was easy and unavoidable. I couldn’t seem to get enough of Sawyer. He pulled back, way before I wanted him to and ran his hand through my hair before wrapping several curls around his fingers. “Why don’t you go finish getting ready? I’m anxious to get you all to myself for the day.”\u003c/p\u003e\n\u003cp\u003eMy legs suddenly were in complete working order again. I stood up and smiled down at him, “Give me ten minutes.”\u003c/p\u003e\n\u003cp\u003eSawyer stood up and started to follow me inside when he stopped. “Um, yeah, uh, I think I’ll just wait in the truck if that’s okay.”\u003c/p\u003e\n\u003cp\u003eAshton wasn’t inside. She’d left with Beau an hour ago but I knew that wasn’t why he didn’t want to come inside. There had to be a lot of memories in this house he wasn’t ready to revisit right now.\u003c/p\u003e\n\u003cp\u003e“Okay, I won’t be long,” I assured him.\u003c/p\u003e\n\u003cp\u003eSawyer\u003c/p\u003e\n\u003cp\u003ePulling onto the dirt road that led out to the field seemed like a bad idea. I’d just spent the day with Lana, all alone. We’d bought her a sleeping bag, backpack and a few other supplies for our camping trip. Then instead of a movie she’d talked me into playing eighteen holes of putt-putt golf. It had sounded like a stupid idea but listening to Lana’s laughter and seeing her strut around when she’d gotten a hole-in-one had been more entertaining than any movie.\u003c/p\u003e\n\u003cp\u003e“I haven’t been to one of these since...” she trailed off biting her bottom lip.\u003c/p\u003e\n\u003cp\u003eThe last field party Lana had been at, she’d covered for Beau and Ashton. When the realization that Lana had known Beau and Ash were messing around behind my back and not told me, I’d been upset. I’d always thought she was on my team. It wasn’t her fault. I had moved on enough now to see that clearly. Reaching across the seat, I grabbed her hand.\u003c/p\u003e\n\u003cp\u003e“The last time was when Beau and Ash were messing around behind my back. Although you covered for them that night it wasn’t your fault. No worries, okay.”\u003c/p\u003e\n\u003cp\u003eShe let her bottom lip pop free of her teeth and it appeared red and swollen. Well damn, that was just too tempting. I let go of her hand, slid my hand between her thighs, and pulled her over to me.\u003c/p\u003e\n\u003cp\u003e“That’s better. You were too far away,” I whispered before I bent my head so that I could pull her bottom lip into my mouth and gently suck on it. The surprised little noise she made had me pulling her closer. I let my hand slip further between her bare legs and squeeze the soft skin of her thigh in my hand.\u003c/p\u003e\n\u003cp\u003eLana pressed her chest against mine and made a pleading noise in her throat. Picking her leg up, I draped it over my knee and slid my hand up a little higher inside her thigh. Her breathing hitched and I realized my heart was racing the closer I got to the edge of her panties.\u003c/p\u003e\n\u003cp\u003e“No, don’t,” Lana said breathlessly as she gave me a gentle push breaking the kiss. She quickly slid her leg off my knee and closed her legs. I’d been really close to doing something I hadn’t done but once in my life; I’d been in seventh grade and a little confused as to why Nicole wanted me to touch her panties.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I said, sitting back in my seat and focusing on the trees in front of me instead of checking to see if she was mad at me or worse, terrified. I needed to get a hold on my pounding heart first. I’d been so close and she’d been so warm.\u003c/p\u003e\n\u003cp\u003e“Don’t be sorry. I just... I’ve never done anything like that before and I got a little nervous. I’m not sure I’m ready for that.”\u003c/p\u003e\n\u003cp\u003eHer small hand covered mine and my tight fist eased under her touch.\u003c/p\u003e\n\u003cp\u003e“Me either,” I replied, finally turning to meet her eyes.\u003c/p\u003e\n\u003cp\u003eHer eyes widened in surprise, “You either—what?”\u003c/p\u003e\n\u003cp\u003eI let out a chuckle and flipped my hand over so that our palms were touching. Then I threaded my fingers through hers. “I’ve never done anything like that before. Unless you count seventh grade when Nicole locked us in Kayla’s closet during a game of spin the bottle and forced me to touch her panties or she’d tell the whole school I was too scared to kiss her.”\u003c/p\u003e\n\u003cp\u003eA small bubble of laughter escaped Lana’s mouth and she slapped her free hand over it to keep from laughing out loud. I smiled and squeezed her hand. It was a funny story.\u003c/p\u003e\n\u003cp\u003e“Let me tell you, what we almost did blew that very strange and disturbing memory out of the water.”\u003c/p\u003e\n\u003cp\u003eThis time the laughter was too loud to cover up with her hand and I reached over and pulled her hand from her mouth. “Don’t. I like to hear you laugh. And that is one helluva funny story. So laughing is expected.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe Nicole threatened you,” she said, still laughing softly.\u003c/p\u003e\n\u003cp\u003e“Really? Have you met Nicole? She was determined to lose her virginity before high school if at all possible. I think Beau may have helped her reach that goal our eighth grade year.”\u003c/p\u003e\n\u003cp\u003e“Oh, my.”\u003c/p\u003e\n\u003cp\u003eHer laughter faded away and a serious thoughtful expression replaced it.\u003c/p\u003e\n\u003cp\u003e“What’s going through that head of yours now?”\u003c/p\u003e\n\u003cp\u003eA forced smile immediately appeared on her lips, “Nothing, sorry.” She glanced out at the bonfire in the distance between the pecan trees. “You ready to get out?”\u003c/p\u003e\n\u003cp\u003eShe was very closed off about a lot of things. The more she didn’t want to tell me the more I wanted to know about her.\u003c/p\u003e\n\u003cp\u003eHer phone began singing some sappy love song I’d heard before on the radio and she reached into her purse and pulled it out. Instead of answering it, she quickly turned it off and slipped it back inside the pocket of her purse.\u003c/p\u003e\n\u003cp\u003e“No one important?” I asked, wanting her to share something, anything with me.\u003c/p\u003e\n\u003cp\u003eShe shook her head and reached for the door handle, “Nope. No one I can’t call back later.”\u003c/p\u003e\n\u003cp\u003eI watched as she jumped down out of my truck before I got out on my side. Lana McDaniel held everything close. I wondered if I’d ever really know what she was thinking.\u003c/p\u003e\n\u003cp\u003eSitting on the tailgate of Jake’s truck with Lana tucked between my legs, I was satisfied. Ash curled up in Beau’s lap wasn’t even on my radar. I’d managed to talk to everyone, Beau included. We discussed football, college, and our camping trip without any problems. It was nice. Lana was nice. No, Lana was more than nice. Having her in my arms made everything bearable.\u003c/p\u003e\n\u003cp\u003e“Heads up, Kyle and Nic just showed up,” Ethan said, before taking another swig of his beer. Nicole hadn’t been around much since Beau and Ash had hooked up. She’d made a go for me a few times. Once, I’d even been tempted to take her out to my truck one night and just screw her. Get it over with. But I couldn’t do it. I didn’t want my first time to be with Nicole in the back of my truck at a field party. I’d waited this long, I could wait longer. Ash was going to be my one and only. But that plan was now over. I figured one day the right girl would come along and when that happened the place wouldn’t be important. Just so it was with the one person I couldn’t live without.\u003c/p\u003e\n\u003cp\u003e“She’s coming this way,” Kayla said smugly. The girl loved drama. With Nicole around drama was bound to follow.\u003c/p\u003e\n\u003cp\u003e“You wanna go, baby?” Beau asked Ashton, starting to shift so he could stand her up.\u003c/p\u003e\n\u003cp\u003e“No. I’m not scared of Nicole, Beau. What’s she going to do to me? Hmmm?” Beau chuckled and leaned in and gave Ashton a kiss on the nose. My chest ached only slightly at the sight of them. Nothing like the times in the past when I’d been unable to take a deep breath when he kissed her.\u003c/p\u003e\n\u003cp\u003e“Well, look at the Vincent boys. Getting along. Both of you all snuggled up to a girls. No one trying to beat up the other one. Looks like Sawyer has moved on, Ash,” Nicole drawled out as she winked at me and sauntered over to stop in front of Lana who stood in her way.\u003c/p\u003e\n\u003cp\u003e“Since you’ve gotten over your Ashton depression, why don’t you and I go out one night and have some fun?”\u003c/p\u003e\n\u003cp\u003eLana tensed in my arms. A protective streak coursed through me and I pulled her up against me tightly, placing my hands on her hips. “I’ll have to pass, Nic. I’ve already found someone to spend time with this summer.”\u003c/p\u003e\n\u003cp\u003eNicole smirked as she let her gaze travel up and down Lana as if she wasn’t impressed. “You can do much better.”\u003c/p\u003e\n\u003cp\u003e“I disagree.”\u003c/p\u003e\n\u003cp\u003e“You need someone with experience after wasting all those years with the preacher’s daughter.”\u003c/p\u003e\n\u003cp\u003eI heard Ashton ordering Beau to calm down and ignore her.\u003c/p\u003e\n\u003cp\u003e“I’m not into overused merchandise. I’ve got standards, you know.”\u003c/p\u003e\n\u003cp\u003eThe surprised laugh from Lana had me smiling like an idiot. I loved making her laugh. She’d relaxed and leaned into me when I’d tightened my hold on her. Knowing I made her feel safe and unthreatened was a heady feeling.\u003c/p\u003e\n\u003cp\u003e“Once the Vincent boys were the hottest thing around. You’ve not lived up to your potential. You’re both boring. One day you’ll crave that excitement you missed out on,” Nicole snarled at me before flipping her dark brown hair over her shoulder and walking over to Kyle, who had stood silently while watching her make a play for me.\u003c/p\u003e\n\u003cp\u003e“Come on Kyle, I’ve had enough of this place.” She stalked past him and Kyle threw me an apologetic look before following her.\u003c/p\u003e\n\u003cp\u003e“Why does he put up with her?” Ashton asked as they walked away.\u003c/p\u003e\n\u003cp\u003e“Because she’s an easy lay,” Jake replied. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2/page-13.html","bookId":1997,"creation":"Oct 5, 2019 10:33:24 AM","modification":"Oct 5, 2019 10:33:24 AM"}
