{"id":74908,"no":8,"title":"Page 8","content":"\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eSawyer\u003c/p\u003e\n\u003cp\u003eLana opened the front door the moment I pulled into Ash’s driveway. I needed to fix the mess I’d made last night so instead of enjoying the view of her long creamy legs, showcased in those tiny little red shorts, I jumped out of the truck and walked around the front of the cab so I could open the door and help her get in.\u003c/p\u003e\n\u003cp\u003eA shy smile played on her full lips as I met her on the other side of my truck. Yep, I had hope. Even after the stunt I’d pulled last night, she was affected by me. Guilt settled in my stomach when I stared into her trusting eyes.\u003c/p\u003e\n\u003cp\u003e“Hey,” her Georgia drawl wasn’t bad either. I’d never realized Lana had a sexy voice.\u003c/p\u003e\n\u003cp\u003e“I’m glad you’ve forgiven me enough to come with me today.”\u003c/p\u003e\n\u003cp\u003eShe shrugged one of her dainty little shoulders. A few freckles graced the smooth skin she was exposing with the sleeveless top. I hadn’t noticed those last night and the urge to kiss each one shocked me.\u003c/p\u003e\n\u003cp\u003e“Not much to forgive. You acted like an ass but you were drunk. I should’ve been paying closer attention.”\u003c/p\u003e\n\u003cp\u003eI couldn’t keep from laughing. Lana McDaniel had just called me an ass.\u003c/p\u003e\n\u003cp\u003e“That’s awfully considerate of you,” I replied.\u003c/p\u003e\n\u003cp\u003e“Hmmm... maybe so.”\u003c/p\u003e\n\u003cp\u003eI opened the truck door and reached out to take her hand as she stepped up into the cab. The shorts rode even further up her legs and, in my appreciative gaze, I noticed one lone freckle incredibly close to the curve of her heart-shaped bottom. My heart sped up and I forced myself to stop ogling her backside.\u003c/p\u003e\n\u003cp\u003eUnsure about whether or not my voice was going to betray me, I didn’t say anything as I closed the door and went back around to the driver’s side.\u003c/p\u003e\n\u003cp\u003eOnce we headed toward the boat launch, I glanced over at Lana. “You still know how to wakeboard, don’t you?” I’d spent hours teaching her how to board one summer when we were in middle school while Ash and Beau heckled her from the boat.\u003c/p\u003e\n\u003cp\u003eA small smile tugged on her lips and I wondered if she was remembering that day too. It had been us against Ash and Beau. For once, I’d felt like I had a team. It was always me trying to rein in those two but that day, I’d had a partner. Granted, I’d wanted Ash as my partner. That was the summer before everything changed. The summer before I became quarterback and I got Ash.\u003c/p\u003e\n\u003cp\u003e“Yes, I think. Isn’t it like a bicycle... ya know, once you learn you never forget?”\u003c/p\u003e\n\u003cp\u003eThe guys were going to enjoy this a little too much. If I hadn’t needed a spotter and a back-up driver we would be doing this alone today. But skiing and boarding, with only two people, wasn’t safe. Someone needed to be watching the rider and then if I wanted to wakeboard, and I did—especially with Lana, then I needed another driver.\u003c/p\u003e\n\u003cp\u003e“Hmmm... maybe a little. It might take you a few tries if you’re rusty,” I finally replied.\u003c/p\u003e\n\u003cp\u003eLana let out a small groan and I bit back a laugh. She’d had the hardest time learning to get up on skis and then the wakeboard had almost done her in. I always admired her determination though. She hadn’t given up.\u003c/p\u003e\n\u003cp\u003e“If we are skiing and wakeboarding, others will be there right?”\u003c/p\u003e\n\u003cp\u003eI nodded, noticing the small disappointment in her voice. She wanted me alone. I liked that—a lot.\u003c/p\u003e\n\u003cp\u003e“Will Ethan be there?”\u003c/p\u003e\n\u003cp\u003eMy small moment of pleasure evaporated.\u003c/p\u003e\n\u003cp\u003e“Ethan? Uh, probably.” Well shit. I had forgotten about their little bonding episode at Wings. Ethan hadn’t been at the party last night. He didn’t know about our little public display of affection. No, wait... he probably did. That was gossip worthy. Someone was bound to have told him by now.\u003c/p\u003e\n\u003cp\u003e“Oh, good. I’ll at least have one other friend there.”\u003c/p\u003e\n\u003cp\u003eHell, no. I’d have to pull Ethan aside without her noticing and make sure he understood Lana was hands off.\u003c/p\u003e\n\u003cp\u003eAgain, the guilt started tugging at me and I pushed it away. Sure, Ethan might be more sincere about his interest in Lana but she was only here for the summer. Then we were all headed off to college. If anyone was going to have a summer fling with her, it was going to be me. End of story. No reason for guilt. This was a means to an end. Besides, I took a quick peek over at Lana, it wasn’t like I didn’t enjoy her company. She was gorgeous, smart and funny. Plus, my being with her was going to drive Ashton mad. Maybe even send her running right back to my arms.... there was that damn guilt again. I needed a beer. That always helped wash away my conscience.\u003c/p\u003e\n\u003cp\u003eLana\u003c/p\u003e\n\u003cp\u003eMy cell phone rang and I quickly pulled it out of my pocket. It was Ashton. I’d texted her that I was going boating with Sawyer today. She must have thought that warranted a phone call instead of a text reply.\u003c/p\u003e\n\u003cp\u003e“Hey,” I said, trying hard not to look at Sawyer. He was driving but I could feel his eyes on me.\u003c/p\u003e\n\u003cp\u003e“Are you two going alone? Because if you are, that isn’t safe. Beau and I can come too.”\u003c/p\u003e\n\u003cp\u003eNo way did I want Ashton anywhere near Sawyer today. I needed to get his attention and when Ashton was around, he was single minded. “No, we’re going skiing. Others are coming too. It’ll be safe.”\u003c/p\u003e\n\u003cp\u003e“If that’s Ash tell her that she and Beau are welcome to join us,” Sawyer piped up. Dangit.\u003c/p\u003e\n\u003cp\u003e“Tell him thanks but if y’all have other people going it’ll probably be more fun without Beau and Sawyer and me all together...” she trailed off.\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll tell him.”\u003c/p\u003e\n\u003cp\u003e“Tonight Beau and I are going to go to the beach to eat some crab claws then go hear Little Big Town play at the Wharf. Ethan also has two tickets and was wondering if you’d like to come, ya know... with him.”\u003c/p\u003e\n\u003cp\u003eEthan? I turned my head so I could peek at Sawyer. He was watching the road but I could tell his attention was completely focused on my conversation with Ashton. Annoyed with the reasons behind his interest, I decided two could play this game.\u003c/p\u003e\n\u003cp\u003e“Sure, I’d love to go tonight. I’m about to see Ethan so I’ll tell him myself.”\u003c/p\u003e\n\u003cp\u003eSawyer’s head whipped around to stare at me and I flashed him an innocent smile and said my goodbyes to Ashton before hanging up.\u003c/p\u003e\n\u003cp\u003e“Ashton and Beau have other plans for the day. She said to tell you thanks though.” If he wanted to know about Ethan he was going to have to ask.\u003c/p\u003e\n\u003cp\u003e“What did she want you to tell Ethan?”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to respond almost automatically but snapped it shut quickly. That wasn’t his business. Just because he asked me didn’t mean I had to tell him. The old Lana would have blurted out whatever he wanted to know. This Lana didn’t do that. This Lana wasn’t a love struck puppy... okay, maybe I was but he didn’t have to know that.\u003c/p\u003e\n\u003cp\u003e“If I’d have wanted you to know the details of my conversation, I’d have put Ashton on speaker phone,” I finally replied.\u003c/p\u003e\n\u003cp\u003e“Ouch. I was just asking.”\u003c/p\u003e\n\u003cp\u003eMaybe I’d gone a little overboard with my snarkiness. I did want Sawyer to like me and he had invited me to go out skiing with him.\u003c/p\u003e\n\u003cp\u003e“Sorry. It was nothing of your concern. I didn’t mean to sound so snappy.”\u003c/p\u003e\n\u003cp\u003eSawyer didn’t respond and silence engulfed the truck.\u003c/p\u003e\n\u003cp\u003eOnce Sawyer pulled into the parking lot at the boat launch, I’d had enough time to decide how to handle his silence. Spending the day on a boat with an annoyed Sawyer didn’t sound like fun.\u003c/p\u003e\n\u003cp\u003e“I really am sorry I was so rude. It was nothing, really.”\u003c/p\u003e\n\u003cp\u003eSawyer turned the engine off and turned to meet my gaze. He studied me a moment then finally nodded. “Okay. I shouldn’t have stuck my nose in your business. I just thought we were friends. I didn’t really think about it when I asked.”\u003c/p\u003e\n\u003cp\u003eGreat. Now, I felt as low as the dirt on the bottom of my shoes.\u003c/p\u003e\n\u003cp\u003e“We are friends. I don’t know why I snapped at you like that. I guess I was embarrassed about the topic.” Which was partially true.\u003c/p\u003e\n\u003cp\u003eA frown puckered his brow, which was ridiculously hot. “Why would Ash ask you to tell Ethan something embarrassing?”\u003c/p\u003e\n\u003cp\u003ePerfect. I’d backed myself into a wall. I couldn’t exactly shut him out again. I didn’t like having him go all surly and quiet on me. The best course of action would be to lie.\u003c/p\u003e\n\u003cp\u003e“I’ve never been on a date before. Ethan asked me to go with him to a concert tonight. Or he asked Ashton to ask me if I’d go with him.” OR I could just blurt out the whole truth and look like an idiot. Dangit! I needed to work on my lying skills. I had none. I’d opened my mouth to lie and out came the truth instead. I forced myself not to grimace and reached for the door handle. The complete surprise in Sawyer’s eyes was humiliating. I was eighteen years old and I had never been on a date. It was sad. And now Sawyer knew just how pathetic I was.\u003c/p\u003e\n\u003cp\u003e“Wait,” Sawyer’s hand shot out and grabbed my arm to stop me before I jumped down out of the truck.\u003c/p\u003e\n\u003cp\u003eSighing, I turned back around to look into his sympathetic eyes but found that they weren’t exactly full of sympathy or astonishment. Instead, he looked... frustrated. Well, that’s interesting.\u003c/p\u003e\n\u003cp\u003e“Do you like Ethan?”\u003c/p\u003e\n\u003cp\u003eYes, I liked Ethan. He was nice, thoughtful, funny, sweet, and he was attracted to me. There was no ex-girlfriend he was hung up on standing in my way. But he wasn’t Sawyer.\u003c/p\u003e\n\u003cp\u003eNodding, I didn’t say anymore. Instead, I waited.\u003c/p\u003e\n\u003cp\u003eSawyer opened his mouth to say something then shut it and closed his eyes tightly before shaking his head and letting go of my arm. “Never mind. Come on, let’s go.”\u003c/p\u003e\n\u003cp\u003eHe opened his door and stepped out. I’d give anything to get him to say what it was he stopped himself from saying just now. But the conversation was over. His curiosity had been cured and I had an entire day to dwell on the fact that I may have just killed any chance I had with him. Ethan was his friend and after the mess with Beau, I doubted Sawyer would ever make a move on a girl that had dated his friend first. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2/page-8.html","bookId":1997,"creation":"Oct 5, 2019 10:33:24 AM","modification":"Oct 5, 2019 10:33:24 AM"}
