{"id":93904,"no":13,"title":"Page 13","content":"\u003cp\u003eHe looked at each of the others in the room and spoke with genteel emphasis. \"I want you all to witness this, because I want you to understand what happens when you break faith with me. Does anyone have any questions?\"\u003c/p\u003e\n\u003cp\u003eThe lab was silent. Dust motes hung in the slanting afternoon light. No one had a question.\u003c/p\u003e\n\u003cp\u003e\"All right. John and Paul, take her in. Joyce will handle the equipment.\"\u003c/p\u003e\n\u003cp\u003eFight, Kaitlyn thought. That was different than screaming. As Mac and Renny reached for her, she ducked sideways and tried to run, throwing a mule kick as she went.\u003c/p\u003e\n\u003cp\u003eBut they were ready for her. Mac wasn\u0027t going to be faked out again. He simply tackled her as if she\u0027d been a two-hundred-pound quarterback, knocking her to the floor. Kaitlyn saw stars and had a horrible sense of not enough air. She\u0027d had the breath knocked out of her.\u003c/p\u003e\n\u003cp\u003eThere was a confused time, and then she realized she was sitting up being whacked on the back. She whooped in air. Then, before she could really get her bearings, she was being hauled to her feet.\u003c/p\u003e\n\u003cp\u003eFighting was no good. She was helpless.\u003c/p\u003e\n\u003cp\u003eThen she heard a voice, thin, high, and frightened. To her astonishment, she realized it was Lydia.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t do it. Please don\u0027t-Father.\"\u003c/p\u003e\n\u003cp\u003eLydia was standing in front of Mr. Z. Her pale hands were clenched together at waist level, not as if she were praying, but as if she were trying to hold her guts in.\u003c/p\u003e\n\u003cp\u003e\"She can\u0027t fight you anymore, and you know it. You could just send her away. She\u0027d never tell anyone about us; she\u0027d just go away and be quiet and live. Wouldn\u0027t you, Kaitlyn?\" Lydia turned huge green eyes on Kait. Her lips were white, but there was a fierceness in those eyes that Kaitlyn admired.\u003c/p\u003e\n\u003cp\u003eGood for you, Lydia, she thought. You finally stood up to him. You spoke out, even when nobody else would.\u003c/p\u003e\n\u003cp\u003eBut someone else was speaking.\u003c/p\u003e\n\u003cp\u003e\"Lydia has a point, Emmanuel,\" Joyce said in a low, carefully controlled voice. \"I really don\u0027t know if we have to go this far. I\u0027m not entirely comfortable with this.\"\u003c/p\u003e\n\u003cp\u003eKaitlyn stared at her. Joyce\u0027s hair was sleek as seal fur, her tanned face was smooth. Yet Kaitlyn caught a sense of inner agitation almost as great as Lydia\u0027s.\u003c/p\u003e\n\u003cp\u003eThank you, Joyce. I knew it couldn\u0027t all be an act. There\u0027s something good in you, deep down.\u003c/p\u003e\n\u003cp\u003eKaitlyn glanced at the others.\u003c/p\u003e\n\u003cp\u003eBri was shifting from foot to foot, scratching her blue-streaked head. Her face was flushed; she looked as if there were something she wanted to say. Renny was scowling, seeming angry but uncertain.\u003c/p\u003e\n\u003cp\u003eOnly Jackal Mac and Frost still looked eager and enthusiastic. Frost\u0027s eyes were shining with an almost romantic fervor, and Jackal Mac was licking his lips with his pierced tongue.\u003c/p\u003e\n\u003cp\u003e\"Anyone else?\" Mr. Z asked in a voice of terrible quiet. Then he turned on Joyce. \"It\u0027s lucky for you that I know you aren\u0027t serious. You\u0027ve managed to overcome your discomfort in much more squeamish situations than this. And you will now, of course- because you wouldn\u0027t want to join her in that tank. Or visit the room downstairs overnight.\"\u003c/p\u003e\n\u003cp\u003eA sort of shudder passed over Joyce\u0027s face. Her aquamarine eyes seemed to unfocus.\u003c/p\u003e\n\u003cp\u003e\"And the same goes for the rest of you,\" Mr. Zetes said. \"Including you.\" He was looking at Lydia. He hadn\u0027t raised a fist; he hadn\u0027t even raised his voice. But Lydia flinched, and everyone else went still. His very presence cowed them all.\u003c/p\u003e\n\u003cp\u003e\"Every one of you would go to jail for years if the police found out what you\u0027ve been doing these last weeks,\" Mr. Zetes said, his face composed and satanic. \"But the police will never have to deal with you.\u003c/p\u003e\n\u003cp\u003eBecause I will, if you cross me. Your old classmates downstairs will help. There is nowhere you can go to get away from us, nowhere you can hide that we can\u0027t find you. The power of the crystal can reach out across the globe and swat you like a fly.\"\u003c/p\u003e\n\u003cp\u003eSilence and stillness. The psychics watched the floor. Not even Frost was smirking now.\u003c/p\u003e\n\u003cp\u003e\"Now,\" Mr. Z said in a grating whisper, \"does anyone still have any objections?\"\u003c/p\u003e\n\u003cp\u003eSome people shook their heads. Lydia, her shoulders hunched miserably, was one of them. Others just stayed still and quiet, as if hoping Mr. Z wouldn\u0027t look at them.\u003c/p\u003e\n\u003cp\u003e\"Gabriel?\" Mr. Zetes said.\u003c/p\u003e\n\u003cp\u003eKaitlyn looked up in surprise. She hadn\u0027t realized Gabriel had arrived; she\u0027d barely noticed his absence before.\u003c/p\u003e\n\u003cp\u003eHe was frowning, looking like somebody who\u0027s arrived at a party to find it had started an hour earlier without him. \"What\u0027s going on?\" he said. He repeated it to Kaitlyn silently, his narrowed eyes on the black-and-white bathing suit. What\u0027s going on? What did you do?\u003c/p\u003e\n\u003cp\u003e\"A disciplinary matter,\" Mr. Zetes said. \"I hope there won\u0027t be any more like it in the future.\"\u003c/p\u003e\n\u003cp\u003eKaitlyn didn\u0027t wait for him to finish, but spoke to Gabriel over his words. None of your business. I despise you. She threw the full weight of her contempt at him like someone throwing beer cans and rocks and bricks. And then, because Rob had taught her how to hurt him, she added, Jailbird. You\u0027d better do everything he says or he\u0027ll send for the police.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t realized how much she hated him before this moment. All the loathing that she somehow hadn\u0027t felt toward Renny or even Jackal Mac and Frost, she felt for him. All the anger and betrayal. If she\u0027d been closer, she would have tried to spit on him.\u003c/p\u003e\n\u003cp\u003eGabriel\u0027s face hardened. She felt him pull away, felt the ice of his shields. He didn\u0027t say another word.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Mr. Z said. \"You boys take her in; then we\u0027ll all go into the city for dinner. I think this calls for another celebration.\"\u003c/p\u003e\n\u003cp\u003eThere was no point in fighting any longer. Mac and Renny dragged Kaitlyn into the back lab. She stood motionless in their grip while Joyce forced a mouthpiece into her mouth. It was connected to an air hose like a scuba diver\u0027s.\u003c/p\u003e\n\u003cp\u003eNow Joyce was pulling gloves over her hands and forcing her into a canvas jacket like the ones the creatures downstairs were wearing. Kaitlyn\u0027s arms were crossed, useless. Weights were being attached to a belt around her waist, and to her ankles.\u003c/p\u003e\n\u003cp\u003eShe heard a voice behind her: Mr. Zetes. \"Goodbye, my dear. Pleasant dreams.\"\u003c/p\u003e\n\u003cp\u003eAnd then Joyce was sticking something in her ears. Some kind of earplugs. Suddenly Kaitlyn was deaf.\u003c/p\u003e\n\u003cp\u003eThey were pushing her forward.\u003c/p\u003e\n\u003cp\u003eThe isolation tank still looked like a Dumpster. A lopsided Dumpster with a hurricane door. The door was open and they were forcing her inside.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t help it; she was going into this thing. This thing that they were going to close on her, that they were going to bury her in alive.\u003c/p\u003e\n\u003cp\u003eAs the dark metal walls rose around her and the water came up to meet her, Kaitlyn\u0027s nerve broke. She did scream. Or at least, she tried. But the thing in her mouth muffled it like a gag and the earplugs dulled the rest of the sound. There was only silence as water enveloped her. And darkness.\u003c/p\u003e\n\u003cp\u003eShe twisted, trying to get on her back, to see the door. To see the light for one last instant. . .\u003c/p\u003e\n\u003cp\u003eBut all she saw was a rapidly diminishing rectangle of white. Then the metal door clanged shut. It was the last sound she was to hear.\u003c/p\u003e\n\u003cp\u003eRight from the beginning, it was very bad.\u003c/p\u003e\n\u003cp\u003eRemembering Bri\u0027s words (\"Sure, it\u0027s cool. Cosmic, man!\"), she had hoped that the tank might be pleasant at first. Or at least bearable. But it wasn\u0027t. It was a death trap, and from the first instant Kaitlyn felt a screaming inside her that wouldn\u0027t stop.\u003c/p\u003e\n\u003cp\u003eMaybe the difference was that she knew she was in here for good. They weren\u0027t going to let her out in an hour or a few hours or a day. They were going to keep\u003c/p\u003e\n\u003cp\u003eher in here for as long as it took, until she was a thing, a drooling, vacant-eyed lump of flesh with no mind.\u003c/p\u003e\n\u003cp\u003eHer first thought was to try and beat the system. She would make her own noise; she would make herself feel. But even the loudest humming was dim and soon her throat grew sore. After a while she wasn\u0027t sure whether she was humming or not.\u003c/p\u003e\n\u003cp\u003eIt was very difficult to kick with the weights on her legs, and when she did manage, she found the tank was lined with something like rubber inside. Between the drag of weights and water and the give of the rubber padding, she couldn\u0027t feel much of anything.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t pinch with her fingers, either, the gloves prevented that and dulled all sensation. Her arms were immobilized. She couldn\u0027t even chew her lips-the mouthpiece prevented it..\u003c/p\u003e\n\u003cp\u003eMore, all these exertions tired her out. After trying everything she could think of, she was exhausted, unable to do anything but float inertly. The weights were gauged to keep her floating right in the middle of the water, away from the top and bottom of the tank, and the water temperature was gauged so that she had no sensation of hot or cold.\u003c/p\u003e\n\u003cp\u003eIt was then that she began to realize the true horror of her situation.\u003c/p\u003e\n\u003cp\u003eIt was dark. She couldn\u0027t see. She couldn\u0027t see anything.\u003c/p\u003e\n\u003cp\u003eAnd she couldn\u0027t hear. The silence was so deep, so profound, that she began to wonder if she really remembered what sound was.\u003c/p\u003e\n\u003cp\u003eIn the endless dark silence, her body began to dissolve.\u003c/p\u003e\n\u003cp\u003eOnce, when she\u0027d just turned thirteen, she\u0027d had a nightmare of a disembodied arm in her bed. She had half-woken one night to find that she\u0027d been lying with\u003c/p\u003e\n\u003cp\u003eher arms pressed together under her body, and that one of them had gone to sleep. She could feel it with her other hand: a cool, unnaturally limp arm. In her not-awake state, it seemed as if someone had put a severed dead arm in her bed. Her own arm was foreign to her.\u003c/p\u003e\n\u003cp\u003eAfter that, all her nightmares were of the cool blue arm snuggling up to her chin and then dragging her under the bed.\u003c/p\u003e\n\u003cp\u003eNow Kaitlyn felt as if all her limbs had gone to sleep. At first it seemed that her body had gone dead, and then she realized she didn\u0027t have a body anymore. At least, there was no way to prove she did.\u003c/p\u003e\n\u003cp\u003eIf there were arms and legs in the tank, they weren\u0027t hers. They were dead, unholy, other peoples\u0027 limbs, floating around her, ready to kill her.\u003c/p\u003e\n\u003cp\u003eAfter a while, even the sense that there were other peoples\u0027 limbs around her faded. There was nothing around her.\u003c/p\u003e\n\u003cp\u003eShe had no sense of being trapped inside the little Dumpster tank. She had no sense of being anywhere.\u003c/p\u003e\n\u003cp\u003eShe was alone in pure space, and around her was nowhere, nothingness, absence, emptiness.\u003c/p\u003e\n\u003cp\u003eThe world had disappeared because she couldn\u0027t sense it. She\u0027d never realized it before, but the world was her senses. She had never known anything but her internal map of it, made up from what she saw and heard. And now there was no sight, no sound, no map, no world. She couldn\u0027t keep hold of the conviction that there was a world outside-or that there was an outside.\u003c/p\u003e\n\u003cp\u003eDid the word outside have meaning? Could something be outside the universe?\u003c/p\u003e\n\u003cp\u003eMaybe there had never really been anything except her.\u003c/p\u003e\n\u003cp\u003eCould she really remember what the color \"yellow\" was? Or the feeling of \"silk\"?\u003c/p\u003e\n\u003cp\u003eNo. It had all been a joke or a dream. Neither of those things existed. These ideas of \"touch\" or \"taste\"\u003c/p\u003e\n\u003cp\u003eor \"hearing\"-she\u0027d made them up to get away from the emptiness.\u003c/p\u003e\n\u003cp\u003eShe had always been alone in the emptiness. Just her, just K-Who was she? For an instant there, she\u0027d almost had a name, but now it was gone. She was nameless.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t exist either.\u003c/p\u003e\n\u003cp\u003eThere was no person thinking this. No \"I\" to make words about it.\u003c/p\u003e\n\u003cp\u003eThere was no ... no ... no ...\u003c/p\u003e\n\u003cp\u003eA silent scream ripped outward. Then:\u003c/p\u003e\n\u003cp\u003eKaitlyn!\u003c/p\u003e\n\u003cp\u003eGabriel was frightened.\u003c/p\u003e\n\u003cp\u003eFrost sat beside him during dinner-Mr. Z\u0027s orders, he was certain. She touched him every other minute, stoking his wrist, patting his shoulder. Again, he felt certain, on Mr. Z\u0027s orders.\u003c/p\u003e\n\u003cp\u003eThey wanted to know if he would try and reach Kaitlyn with his mind.\u003c/p\u003e\n\u003cp\u003eBut the restaurant in San Francisco was too far from the Institute. Kaitlyn was long out of range, as Joyce must have told Mr. Z. Gabriel didn\u0027t even try to stretch out his mind; instead he worked on convincing everyone that he didn\u0027t want to. That he hated Kaitlyn as much as Jackal Mac did.\u003c/p\u003e\n\u003cp\u003eHe must have done a good job, because Lydia was looking at him with burning green hatred in her eyes-when her father\u0027s head was turned, of course.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t the only one who looked unhappy. Bri had eaten almost none of her dinner. Renny kept swallowing as if he felt sick. And Joyce was holding\u003c/p\u003e\n\u003cp\u003eherself rigid and expressionless, her aquamarine eyes fixed on the candle in the center of the table.\u003c/p\u003e\n\u003cp\u003eThe club they went to next was also far away from San Carlos-but not quite as far. Frost left his side to dance with Mac. As soon as she was gone, Gabriel slipped the piece of crystal he had palmed out of his pocket.\u003c/p\u003e\n\u003cp\u003eIt should increase his range-but enough? He wasn\u0027t sure. The only time he\u0027d managed a telepathic link over such a long distance was when he\u0027d been in agonizing pain.\u003c/p\u003e\n\u003cp\u003eHe had to try.\u003c/p\u003e\n\u003cp\u003eWith Mr. Z smoking a cigar and smiling benevolently at the dancers on the floor, Gabriel clutched the tiny chip of crystal and sent out his mind.\u003c/p\u003e\n\u003cp\u003eBut the frightening thing was that even when he felt he\u0027d stretched out far enough, he couldn\u0027t feel Kaitlyn.\u003c/p\u003e\n\u003cp\u003eHer place in the web was filled with nothingness. Not even a wall, only blankness. Nobody nowhere.\u003c/p\u003e\n\u003cp\u003eDesperate, he kept calling her name.\u003c/p\u003e\n\u003cp\u003eThere was a vision in her mind.\u003c/p\u003e\n\u003cp\u003eWhose mind? It didn\u0027t matter. Maybe there wasn\u0027t a mind at all, but only the vision.\u003c/p\u003e\n\u003cp\u003eA rose, full and blooming, with lush petals. The petals were a warm color that she had forgotten. At first it was a nice image, all those petals on one stem, separate but connected. It reminded her of something.\u003c/p\u003e\n\u003cp\u003eBut then the vision went bad. The petals turned black, the color of the emptiness. The rose began to drip blood. It was hurt, mortally wounded. The petals began to fall. . . and on each there was a face, and the face was screaming.\u003c/p\u003e\n\u003cp\u003eKaitlyn! Kaitlyn, can you hear me?\u003c/p\u003e\n\u003cp\u003ePetals falling, dripping. Like tears.\u003c/p\u003e\n\u003cp\u003eKaitlyn! Oh God, please answer me. Please, Kaitlyn. Kaitlyn!\u003c/p\u003e\n\u003cp\u003eThere was desperation in the voice. Whose voice? And who was it talking to?\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t \u0027t contact you before. He had Frost sitting by me, touching me. She would have known. But now I have them convinced I don\u0027t want to talk to you-oh, please, Kaitlyn; answer. It\u0027s Gabriel.\u003c/p\u003e\n\u003cp\u003eSuddenly there was another vision. A hand dripping blood. Onto a floor. Gabriel\u0027s hand, cut by the crystal shard, dripping onto Marisol\u0027s floor.\u003c/p\u003e\n\u003cp\u003eAnd she had seen it, she, Kaitlyn. She was Kaitlyn.\u003c/p\u003e\n\u003cp\u003eShe had a self again.\u003c/p\u003e\n\u003cp\u003eGabriel?\u003c/p\u003e\n\u003cp\u003eHis voice came back, at a volume that hurt her. Yes. Kaitlyn, talk to me.\u003c/p\u003e\n\u003cp\u003eGabriel, is it really you? I thought. . . you\u0027d be mad. After I said. . .\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t sure what she\u0027d said. Or even what \"saying\" was.\u003c/p\u003e\n\u003cp\u003eKaitlyn, don\u0027t be-don\u0027t even think about that. Are you all right?\u003c/p\u003e\n\u003cp\u003eIt was a stupid question. Kaitlyn had no way to answer it in words, so she sent along the thin, quivering strand of the web that connected them a vision of what the emptiness was like. Nothingness, void, absence. ..\u003c/p\u003e\n\u003cp\u003eStop. Please stop now. Oh God, Kait, what can I do?\u003c/p\u003e\n\u003cp\u003eKaitlyn could feel the black well trying to suck her back into it; all she had to hold on to was the slender connection with Gabriel, like a tiny shaft of light in a dungeon. It was keeping her sane at the moment, but it wasn\u0027t enough. She needed more, she needed\u003c/p\u003e\n\u003cp\u003eYou need to see and hear, Gabriel said.\u003c/p\u003e\n\u003cp\u003eI don\u0027t even remember what those things are like, Kaitlyn told him. She could feel hysteria bubbling in her, stealing her rationality.\u003c/p\u003e\n\u003cp\u003eGabriel said simply, I\u0027ll show you.\u003c/p\u003e\n\u003cp\u003eAnd then he began to give her things, with his mind. Things he had seen and heard, things from his memory. He gave her everything.\u003c/p\u003e\n\u003cp\u003e\"Remember what the sun\u0027s like? It\u0027s hot and yellow and so bright you can\u0027t look at it. Like this. See?\" In her sense-starved condition his voice seemed like a real voice not like telepathy. He was giving her the sound of talking. And sending her a picture. As soon as Kaitlyn saw it she remembered. The sun.\u003c/p\u003e\n\u003cp\u003eThat\u0027s good, she said. It feels good.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what it looks like in summer. I grew up in New York, and sometimes in the summer my mom would take me to this place by the ocean-remember the ocean?\"\u003c/p\u003e\n\u003cp\u003eBlue-green coolness. Hot sand between the toes, gritty sand in the bathing trunks. Water foaming and hissing, children shrieking. The smell and taste of salt.\u003c/p\u003e\n\u003cp\u003eKaitlyn drank it all in greedily, hungry for every nuance of sight or sound. More, please. More.\u003c/p\u003e\n\u003cp\u003e\"We\u0027d go up to the boardwalk, just her and me. She\u0027d always buy me a hot dog and an ice cream. She didn\u0027t have much money, because the old man drank it all, but sometimes she\u0027d make him give her a dollar to fix something he really liked for dinner. Then she\u0027d get me the ice cream-remember ice cream?\"\u003c/p\u003e\n\u003cp\u003eCreamy, blobby coldness. Stickiness on her chin. Rich, dark taste of chocolate.\u003c/p\u003e\n\u003cp\u003eI remember. Thank you, Gabriel.\u003c/p\u003e\n\u003cp\u003eHe gave her more. All his best memories, everything he could think of that was good. Every golden afternoon, every skateboard ride, every moment with his mother when he was seven years old and sick with the fever that gave him his power.\u003c/p\u003e\n\u003cp\u003eEverything he was, he gave to her.\u003c/p\u003e\n\u003cp\u003eKaitlyn devoured the sensations, filling herself with the reality of the world outside. She was drenched in sunshine and cool wind and the smell of burning leaves and the taste of Halloween candy. And music; she hadn\u0027t realized how Gabriel loved music. At fourteen, he\u0027d wanted to play in a garage band. He was jamming with the drummer one night, trying to get more in sync-and then the drummer was lying on the floor, clutching his head. Pierced by Gabriel\u0027s mind. When Gabriel tried to help him up, he ran screaming.\u003c/p\u003e\n\u003cp\u003eA week later, Gabriel was on his way to the psychic research center in Durham, where his principal and his mother and the social worker hoped someone could teach him control. His father\u0027s last word to him had been: \"Freak.\"\u003c/p\u003e\n\u003cp\u003e\"Never mind about that,\" Gabriel said. He was giving her only good things, nothing depressing. She could feel that he didn\u0027t want her to see his father\u0027s stubbly face with the bleary red eyes. Or feel the burning hot shock of his father\u0027s belt.\u003c/p\u003e\n\u003cp\u003eIt\u0027s all right, Kaitlyn said. I mean, I won\u0027t look at anything you don\u0027t want me to, but you don\u0027t have to worry about me . . . and I won\u0027t ever tell anyone, and I\u0027m so sorry. Oh, Gabriel, I\u0027m so sorry. And. ..\u003c/p\u003e\n\u003cp\u003eShe wanted to tell him that she understood him now, in a way she\u0027d never understood anyone before.\u003c/p\u003e\n\u003cp\u003eBecause she was with him. It wasn\u0027t even like being in the web; it was much closer than that, much deeper. He\u0027d torn down all the barriers and put his soul into her hands.\u003c/p\u003e\n\u003cp\u003eI love you, she told him.\u003c/p\u003e\n\u003cp\u003e\"I love you, Kaitlyn. From the very beginning.\"\u003c/p\u003e\n\u003cp\u003eShe got a sense then, of how he saw her. Bits and pieces from his memories of her. Her eyes, smoky blue, with the strange dark rings in them, framed by heavy black lashes. Her skin tasting like peaches.\u003c/p\u003e\n\u003cp\u003eHer hair crackling when she brushed it, flame-colored, silky but full of electricity.\u003c/p\u003e\n\u003cp\u003eShe could sense, too, scraps of what he\u0027d thought about her over the weeks. Lines from their lives together. That kind of girl might be too interesting, might tempt you to get involved. . . A girl who challenged him, who could be his equal. . . Her mind was a place of blue pools and blazing meteors.. .\u003c/p\u003e\n\u003cp\u003eShe stood slim and proud as some medieval witch princess against the dawn.\u003c/p\u003e\n\u003cp\u003e\"And then I thought you\u0027d betrayed me,\" he said. \"But you really came to protect me, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eWith that, Kaitlyn realized that he\u0027d seen as deeply into her mind as she\u0027d seen into his. She had thought he was the one giving, while she had only received . . . but of course, he\u0027d had to join with her completely in order to share his life with her.\u003c/p\u003e\n\u003cp\u003eHe knew everything, now.\u003c/p\u003e\n\u003cp\u003eAnd then he came on something that sent shock waves through Kaitlyn.\u003c/p\u003e\n\u003cp\u003e\"Jackal Mac said-what?\"\u003c/p\u003e\n\u003cp\u003eKaitlyn could feel the memory he was looking at. He said you told him to check me out.\u003c/p\u003e\n\u003cp\u003eGabriel\u0027s cold anger filled the universe.\u003c/p\u003e\n\u003cp\u003e\"I never said that. I never talked to him about you at all.\"\u003c/p\u003e\n\u003cp\u003eI know, Gabriel. She did know, she was certain.\u003c/p\u003e\n\u003cp\u003e\"But Lydia knew how you gave me energy on the trip to Canada She must have told him-\"\u003c/p\u003e\n\u003cp\u003eGabriel, forget about it. His fury was hurting her, filling her with images of death, of Jackal Mac spitting up bone splinters. Please think me something nice.\u003c/p\u003e\n\u003cp\u003eSo he did. All that night, he thought her beautiful music and hillsides of wild mustard flowers and the smell of fresh pencil shavings and the taste of banana marshmallow candies. And the touch of his hands, the way he would do it if she ever got back in the world again.\u003c/p\u003e\n\u003cp\u003eRob stared at the edges of the afghan that served Tony\u0027s friend for a window curtain. He didn\u0027t move, because he didn\u0027t want to disturb the others; Anna and Lewis and Tamsin on the floor. Even the black kitten Tony had given Anna was lying curled and still. But Rob couldn\u0027t sleep.\u003c/p\u003e\n\u003cp\u003eLight was showing around the blanket edges. Morning. And Kaitlyn hadn\u0027t called last night.\u003c/p\u003e\n\u003cp\u003eHe had a very bad feeling.\u003c/p\u003e\n\u003cp\u003eThere was no good reason for it. Kaitlyn had told them she might have to wait and watch her chance.\u003c/p\u003e\n\u003cp\u003eThat was probably what she was doing.\u003c/p\u003e\n\u003cp\u003eBut Rob was empty and sick with fear.\u003c/p\u003e\n\u003cp\u003eRob?\u003c/p\u003e\n\u003cp\u003eHe turned to see Anna looking up at him. There was no sign of drowsiness in her face or her dark eyes.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t \u0027t sleep, either. She put a hand on his arm and he put his hand over it. Just the feel of her warmth gave him some comfort.\u003c/p\u003e\n\u003cp\u003eYou want to go and look for her now, don\u0027t you?\u003c/p\u003e\n\u003cp\u003eRob turned from the window again. Her steady gaze, her calm face, and her gentle presence in the web all strengthened him.\u003c/p\u003e\n\u003cp\u003e\"Yes\" he whispered.\u003c/p\u003e\n\u003cp\u003eThen we\u0027ll go. I think we should, too. Let\u0027s wake up Lewis and Tamsin.\u003c/p\u003e\n\u003cp\u003eKaitlyn knew it was morning because Gabriel said so.\u003c/p\u003e\n\u003cp\u003e\"I think they\u0027re going to take you out soon. Mr. Zetes drove up a little while ago, and now Joyce is knocking on all the doors upstairs.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-visions-the-passion-dark-visions-3/page-13.html","bookId":2126,"creation":"Oct 5, 2019 6:05:28 PM","modification":"Oct 5, 2019 6:05:28 PM"}
