{"id":93907,"no":16,"title":"Page 16","content":"\u003cp\u003eKaitlyn remembered the things he\u0027d given her, the sun-flooded afternoons, and the cool healing ocean waves, and the music he\u0027d written. He\u0027d given her everything that was best in him, everything he was.\u003c/p\u003e\n\u003cp\u003eShe wanted to give him the same back again.\u003c/p\u003e\n\u003cp\u003eI don\u0027t know how you can love me. The words came softly, as if he were thinking them to himself.\u003c/p\u003e\n\u003cp\u003eYou\u0027ve seen what I am.\u003c/p\u003e\n\u003cp\u003eThat\u0027s why I do love you, Kaitlyn told him. I hope you\u0027ll still love me when you see what I am.\u003c/p\u003e\n\u003cp\u003e\"I know what you are, Kait. Everything beautiful and brave and gallant and . . .\" He stopped as if his throat had closed. \"Everything that makes me want to be better for you. That makes me sorry I\u0027m such a stupid mess. ...\"\u003c/p\u003e\n\u003cp\u003eYou looked like a knight with the shard, Kaitlyn said,\u003c/p\u003e\n\u003cp\u003emoving toward him.\u003c/p\u003e\n\u003cp\u003e\"Really?\" He laughed shakily.\u003c/p\u003e\n\u003cp\u003eMy knight. And I never said thank you.\u003c/p\u003e\n\u003cp\u003eShe was almost touching him, now. Looking up into his eyes. What she could feel in him was something she\u0027d only felt before when she gave him her life energy. Childlike, marveling joy. Trust and vulnerability.\u003c/p\u003e\n\u003cp\u003eAnd such love . . .\u003c/p\u003e\n\u003cp\u003eThen she was in his arms and they weren\u0027t separate beings any longer. Their minds were together, sharing thoughts, sharing a happiness beyond thought. Sharing everything.\u003c/p\u003e\n\u003cp\u003eShe never even knew whether he kissed her.\u003c/p\u003e\n\u003cp\u003eIt seemed a very long time later, but the sunbeams falling across the dining room had hardly moved.\u003c/p\u003e\n\u003cp\u003eKaitlyn had her head on Gabriel\u0027s shoulder. She was so full of peace-peace and light and hope for everything. Even the nagging hole in the universe where LeShan had been was filled with light. She hoped that, somehow, he knew what had happened today and was satisfied.\u003c/p\u003e\n\u003cp\u003e\"God make me worthy of you. Fast,\" Gabriel said. It was something like a command.\u003c/p\u003e\n\u003cp\u003eKaitlyn smiled. His arms were tight around her, a feeling she never wanted to lose. But they were no longer outside time, and she could hear banging and shouting laughter from upstairs.\u003c/p\u003e\n\u003cp\u003e\"I guess we\u0027d better see what\u0027s going on,\" she said.\u003c/p\u003e\n\u003cp\u003eVery slowly, most reluctantly, he let her go, only keeping her hand in his. They walked around the corner to the stairs.\u003c/p\u003e\n\u003cp\u003eLydia, though, was just coming down. Bri and Renny were behind her. They\u0027d obviously been going through closets; each had a full cardboard box and at\u003c/p\u003e\n\u003cp\u003eleast one bag or suitcase.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t know exactly what we\u0027ll need there,\" Lydia told Kaitlyn. Her green eyes looked out almost shyly from behind her heavy shock of dark hair.\u003c/p\u003e\n\u003cp\u003e\"Go where?\" Kaitlyn asked.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t hear? Oh, I guess not.\" Lydia headed for the front lab, with Bri and Renny following. Kaitlyn and Gabriel followed them.\u003c/p\u003e\n\u003cp\u003e\"Joyce is going with Tamsin back to the Fellowship,\" Lydia said, dumping her box on a desk. \"Ouch.\u003c/p\u003e\n\u003cp\u003eThat was heavy.\"\u003c/p\u003e\n\u003cp\u003e\"Going back with Tamsin?\"\u003c/p\u003e\n\u003cp\u003e\"Yup,\" Bri said. \"And we\u0027re going with her.\"\u003c/p\u003e\n\u003cp\u003eKaitlyn stared. Renny was nodding, pushing up his glasses with an index finger.\u003c/p\u003e\n\u003cp\u003e\"Tamsin says it\u0027ll help Joyce heal from the influence of the crystal,\" Lydia said. \"And Bri and Renny, too.\u003c/p\u003e\n\u003cp\u003eOh, here they are.\"\u003c/p\u003e\n\u003cp\u003eJoyce and Tamsin came in from the kitchen. Joyce\u0027s hair was smoothed again, and her lips had stopped trembling. She seemed to be hanging on Tamsin\u0027s every word.\u003c/p\u003e\n\u003cp\u003e\"We\u0027d be glad to have you,\" Tamsin was saying. \"And we can help the children develop and control their powers. Even Lydia . . .\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have any powers,\" Lydia said.\u003c/p\u003e\n\u003cp\u003eTamsin smiled at her. \"You\u0027re of the old race. We\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eKaitlyn noticed the sunlight change and realized that Rob was in the kitchen doorway. Lewis and Anna were right behind him, but Anna was closer.\u003c/p\u003e\n\u003cp\u003eRob smiled at her, and it was a real smile, with his own gladness and optimism behind it. \"Tamsin\u0027s been telling us about their place on the new island,\" he said. \"They\u0027ve got it pretty rough, but they\u0027re working on it. It\u0027s been hard with Mereniang gone, and now\u003c/p\u003e\n\u003cp\u003ethat LeShan is dead . . .\" He shook his head, but his eyes were gleaming as if he saw a challenge.\u003c/p\u003e\n\u003cp\u003e\"Rob! Are you telling me-do you want to go, too?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I was thinking about it. They\u0027re going to need help.\"\u003c/p\u003e\n\u003cp\u003e\"And leadership,\" Tamsin said, quietly, without sounding ashamed. \"Innovation, new ideas-they don\u0027t come easily to us.\"\u003c/p\u003e\n\u003cp\u003eRob nodded. \"You help us and we help you. A fair exchange.\"\u003c/p\u003e\n\u003cp\u003eAnd the great task Rob\u0027s been looking for, Kaitlyn thought, somewhat giddy with the suddenness of it.\u003c/p\u003e\n\u003cp\u003eNot saving the world, maybe, but fixing a little part of it.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know what to say. She was remembering Canada, the lush beauty of the rain forest, the open vastness of the sky. The wild blue ocean.\u003c/p\u003e\n\u003cp\u003e\"Of course, the rest of you children can stay here,\" Joyce was saying. \"Not at the Institute-that will be closed for good. But I think I could arrange for you to have your scholarships after all. Mr. Zetes had the money put aside in a special account; he had to, for the lawyers.\"\u003c/p\u003e\n\u003cp\u003eYes, that was the sensible thing to do. School and then college. Her father would want that. And Gabriel was a city boy. Kaitlyn\u0027s fingers tightened on his- and then she felt his thought.\u003c/p\u003e\n\u003cp\u003eWell, we could just take a vacation, couldn\u0027t we? he asked. His gray eyes were sparkling.\u003c/p\u003e\n\u003cp\u003eHappiness flooded Kaitlyn to her fingertips.\u003c/p\u003e\n\u003cp\u003eWe could-yes, we could, she told Rob and Anna and Lewis. We could make up the time at school next year. And meanwhile, it would be very educational. . . .\u003c/p\u003e\n\u003cp\u003eAnd we wouldn\u0027t break the web, Rob said, and she remembered, and a smile was trembling on her full lips.\u003c/p\u003e\n\u003cp\u003e\"I came to see the guy who healed me,\" she said. \"And all of you.\"\u003c/p\u003e\n\u003cp\u003e\"All of them were in it,\" Tony said proudly. He had a shirt on today, Kaitlyn noticed, and he looked as if someone had just willed him a million dollars.\u003c/p\u003e\n\u003cp\u003eKaitlyn hugged Marisol, and then she had to stand back so Rob could do it. And then Lydia was coming forward, and Bri, looking as if they thought Marisol might hate them. But she smiled at them instead, and there were more hugs. Those who couldn\u0027t hug Marisol hugged one another.\u003c/p\u003e\n\u003cp\u003eAnd Joyce, with her aquamarine eyes on Marisol\u0027s face, looked as if healing had already begun.\u003c/p\u003e\n\u003cp\u003e\"We brought you your kitten, too,\" Tony said to Anna.\u003c/p\u003e\n\u003cp\u003e\"So now everybody\u0027s here,\" Anna said, pressing the kitten to her cheek, then to Rob\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Hey, yeah-everybody\u0027s here! Wait a minute!\" Lewis was running. He was back in a moment.\u003c/p\u003e\n\u003cp\u003e\"Everybody, scrunch together by the door. Some of you get down. The rest lean in! Get closer!\"\u003c/p\u003e\n\u003cp\u003eI think we\u0027re already about as close as we can get, Gabriel said, and Kaitlyn was surrounded by silent laughter.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it! Hold that smile!\" Lewis shouted, and snapped their picture.\u003c/p\u003e\n\u003cp\u003ecould feel his joy, too. He and Gabriel were smiling at each other.\u003c/p\u003e\n\u003cp\u003eOf course, we\u0027ll have to break it someday, Lewis said quickly. I mean, we can\u0027t go around this way forever.\u003c/p\u003e\n\u003cp\u003eOf course not, Anna agreed solemnly, her owl eyes crinkling at the edges.\u003c/p\u003e\n\u003cp\u003eBut just for now . . . Lewis said.\u003c/p\u003e\n\u003cp\u003eJust for now, they all agreed, together.\u003c/p\u003e\n\u003cp\u003eTalk was going on around them. Joyce was moving toward the front door, saying, \"What\u0027s that?\" Lydia was rummaging through her box.\u003c/p\u003e\n\u003cp\u003e\"I forgot to show you. Look what I found!\" she said to Lewis. She was holding two things: an alarm clock shaped like a cow-and his camera.\u003c/p\u003e\n\u003cp\u003e\"Hey, where did you get that? That\u0027s precious!\" Lewis said, taking the cow.\u003c/p\u003e\n\u003cp\u003e\"I know. I want you to show me what it does.\" Lydia smiled at him, her new shy smile, and Lewis beamed back. He reached out and squeezed her arm, just once.\u003c/p\u003e\n\u003cp\u003e\"As soon as we get alone,\" he said wickedly, \"I will.\"\u003c/p\u003e\n\u003cp\u003e\"Kaitlyn! Rob!\" Joyce was calling from the front door in a voice wavering between laughter and tears.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s someone here to see you, and I don\u0027t think you should keep her waiting!\"\u003c/p\u003e\n\u003cp\u003eThey all went, Kaitlyn and Gabriel and Rob and Anna, with Lewis and Lydia following, and Tamsin bringing up the rear with Bri and Renny. When Kaitlyn got to the porch she stopped in astonishment.\u003c/p\u003e\n\u003cp\u003e\"Oh . . . \"was all she could say. Then she said, \"Oh, Marisol.\"\u003c/p\u003e\n\u003cp\u003eIt was Marisol, thin and rather wobbly on her legs, supported on Tony\u0027s arm. She was pale, but her tumbled mahogany hair was the same as Kaitlyn. \u003c/p\u003e","sourceLink":"https://allnovel.net/dark-visions-the-passion-dark-visions-3/page-16.html","bookId":2126,"creation":"Oct 5, 2019 6:05:28 PM","modification":"Oct 5, 2019 6:05:28 PM"}
