{"id":100818,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI took another awful step. Asher was still crushing me. “They told me it’s only until you have our baby. If you want to keep it. It’s up to you.”\u003c/p\u003e\n\u003cp\u003e“Then what?” Hope—any hope—I needed it.\u003c/p\u003e\n\u003cp\u003e“Then I change you all the way, and take you back as mine,” Anna said, loud enough that the entire room could hear.\u003c/p\u003e\n\u003cp\u003e“Change me now.” I looked over at Raven and the follower he’d brought with him. I didn’t want to go with them, and I didn’t want to be commanded to do things that I couldn’t disobey. Being a vampire with Anna was better than that. “Just change me now.”\u003c/p\u003e\n\u003cp\u003eAnna’s voice was rich with sorrow when she spoke again. “If I change you now, the child dies. Children don’t survive the changing process. Ever.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I swallowed. This was Asher’s and my only chance. Our child’s only chance. Whatever it was, whatever he would become—this was the only way.\u003c/p\u003e\n\u003cp\u003e“I heard stories from the others that were saved. If she could let anything die, we wouldn’t be here,” Raven said drolly.\u003c/p\u003e\n\u003cp\u003e“Just nine months?” I asked Anna. “Eight, if you count time served?”\u003c/p\u003e\n\u003cp\u003e“Until you have the baby,” she said, and then looked to Raven. “I expect you to give her back to me alive.”\u003c/p\u003e\n\u003cp\u003e“Technically, enough of her will be,” Raven said.\u003c/p\u003e\n\u003cp\u003eAsher pressed his forehead to mine. “I’ll watch over you somehow. I’ll make sure you’re all right.”\u003c/p\u003e\n\u003cp\u003e“There’s no prohibition about me killing this man, is there?” Raven asked the air as though it might answer him back.\u003c/p\u003e\n\u003cp\u003eIt was just eight months. Eight months and then I’d be free. I could survive anything for eight months, couldn’t I? Couldn’t … we?\u003c/p\u003e\n\u003cp\u003eI kissed Asher fiercely, surprising him with my strength. And he knew my kiss for what it was, a promise and a good-bye. We’d had kisses like this before. We’d lost each other—and we’d found each other again. Things had been perfect for a time. If we were both alive, we could get that back.\u003c/p\u003e\n\u003cp\u003eI twisted my head as if to drink him in, grinding my lips and teeth against his until blood ran between us and found I didn’t mind.\u003c/p\u003e\n\u003cp\u003e“Now,” Raven said, and the sound of his voice was like a snapping leash pulling an unseen collar I wore.\u003c/p\u003e\n\u003cp\u003e“Just eight months,” I whispered, stepping back from Asher. He nodded, his intent turning steel. He could wait eight months—but after that, hell wouldn’t stop Asher from coming to save me and our boy.\u003c/p\u003e\n\u003cp\u003eAnna placed herself in my path and stopped me. “I wish I could tell you that it would be easy, or that Raven would be kind. But it would behoove him to do as I say, or risk my wrath. I am the first of my line, and I already have many followers. I can endlessly make more, and would do so, for the sake of you.”\u003c/p\u003e\n\u003cp\u003eI nodded at her. That was all Raven’s invisible leash would let me do. Pulled by something I couldn’t explain, I was forced to walk to his side.\u003c/p\u003e\n\u003cp\u003e“At last,” he said, and then bowed to the room. “Anna, lovely to be threatened by you, as always. Wolf, get the car.”\u003c/p\u003e\n\u003cp\u003eRaven pulled me outside into the rain. It seemed not to hit him, but I definitely felt myself getting wet. Tears I’d been hiding for Asher’s sake leaked from my eyes.\u003c/p\u003e\n\u003cp\u003eA black car—of course—pulled up, and Raven opened up the back door for me. “Get inside.”\u003c/p\u003e\n\u003cp\u003eI did as I was told, and sat down. I buckled my seat belt, which made Raven laugh. When he was done, Wolf, beside me in the back, pulled out a black velvet hood.\u003c/p\u003e\n\u003cp\u003e“Can’t have you seeing the way to our lair,” he said, sliding it over my head. My hands weren’t trapped at my sides, but there was no point in fighting him—if I did, they would be.\u003c/p\u003e\n\u003cp\u003eA blackness darker than the night or the ocean depths came down.\u003c/p\u003e\n\u003cp\u003eI’d survived, and my child lived, but we weren’t going home. \u003c/p\u003e","sourceLink":"https://allnovel.net/deadshifted-edie-spence-4/page-43.html","bookId":2621,"creation":"Oct 5, 2019 6:56:23 PM","modification":"Oct 5, 2019 6:56:23 PM"}
