{"id":74210,"no":16,"title":"Page 16","content":"\u003cp\u003e“Show me,” Mom ordered, and Bex laid the package on the coffee table in front of the sofa—the very place where I’d eaten supper almost every Sunday night since I’d started at the Gallagher Academy in the seventh grade. It was a table normally reserved for spaghetti and bad burritos, but that day we all sat staring down at the only real clue we had about my past.\u003c/p\u003e\n\u003cp\u003e“You found it…” Mom started.\u003c/p\u003e\n\u003cp\u003e“At the cabin,” Liz said, answering the unfinished question. “It was with the rest of Mr. Solomon’s mail. I guess Cam must have mailed it to him or something.”\u003c/p\u003e\n\u003cp\u003eI felt the couch shift as my aunt sank to take the seat beside me. “That was good, Cam. Smart.”\u003c/p\u003e\n\u003cp\u003eThe CoveOps teacher looked proud; the aunt sounded prouder. I know I should have said thank you, but it felt like cheating to accept a compliment I didn’t remember earning—like taking credit for somebody else’s hard work.\u003c/p\u003e\n\u003cp\u003e“Cammie,” Zach said, “are you sure it’s your handwriting?”\u003c/p\u003e\n\u003cp\u003eFor a second, the question seemed strange. Zach had been my sorta-boyfriend for a long time, and yet he didn’t know what my handwriting looked like. I guess we weren’t exactly love-notes-in-the-locker people. We were too busy being terrorists-want-to-kidnap-us people. It’s easy to see how one would get in the way of the other.\u003c/p\u003e\n\u003cp\u003e“Oh,” Bex said with a laugh, “it’s hers. I’d know that crazy-person scrawl anywhere.”\u003c/p\u003e\n\u003cp\u003eI ran a finger along the words I had absolutely no memory of writing. The postmark was so foreign, so strange. The stamps seemed like works of art.\u003c/p\u003e\n\u003cp\u003e“It’s a package I sent from Rome,” I said, then laughed softly to myself. “I’ve always wanted to go to Rome.”\u003c/p\u003e\n\u003cp\u003eHow many covert conversations had my roommates and I had in the past three years? How many hours had we spent staring down at some mysterious clue? I couldn’t even begin to count. It felt somehow like they’d all been leading up to that moment—that place. We seemed a long, long way from my first boyfriend’s garbage.\u003c/p\u003e\n\u003cp\u003e“I guess we should start by X-raying it,” Liz said slowly. “We’ll need to scan it for biohazards, of course, and—”\u003c/p\u003e\n\u003cp\u003eAbby lunged forward, cutting Liz off. She didn’t hesitate as she grabbed the package and ripped. Scraps of paper and packing material flew everywhere, but no one said a thing as Abby turned the envelope upside down and dumped the contents onto the table.\u003c/p\u003e\n\u003cp\u003e“Or we could do that,” Liz finished.\u003c/p\u003e\n\u003cp\u003eI don’t know what I’d been expecting, but it seemed a little anticlimactic, to tell you the truth. There were no bombs, no treasure maps where X marked the spot—just a small pile of bracelets, each with thin wires twisted into the words Bex, Liz, and Macey. I reach for each and handed them to my best friends, who gazed down at the delicate wires that spelled their names.\u003c/p\u003e\n\u003cp\u003eThere were two small brown paper packets, the names Mom and Abby written across them in my familiar scrawl, and I handed them to their new owners, watched them pull out beautiful pendants hung on delicate chains.\u003c/p\u003e\n\u003cp\u003eThe last package was simply labeled Me.\u003c/p\u003e\n\u003cp\u003eI could barely breathe as I tipped the tiny envelope upside down and immediately felt something cool and metal land on my palm. On the end of a very fine chain, I found a small pewter crest almost like the one from the Gallagher Academy, but different. And still it was close enough that I could see why it would catch my eye and make me choose it for myself.\u003c/p\u003e\n\u003cp\u003e“Well, Cam, I guess you were wrong that day when you came back,” Bex said slowly. She held the bracelet up. “You got us something after all.”\u003c/p\u003e\n\u003cp\u003eBut I barely heard my best friend’s words. I was pushing through the scraps of paper and packing material, searching, but there was nothing else in the pile.\u003c/p\u003e\n\u003cp\u003e“It’s not here,” I said.\u003c/p\u003e\n\u003cp\u003e“What’s that, kiddo?” Mom asked me.\u003c/p\u003e\n\u003cp\u003e“Dad’s journal. I hoped maybe I’d sent it back, but it’s not here. It’s just…jewelry,” I said. Suddenly, I wanted to hurl the necklace across the room, throw it out the window, do anything but sit there holding proof that I’d been to Rome and had nothing to show for it but some trinkets. For the first time since waking up in Austria, I actually wanted to cry. “It’s just stupid souvenirs. It doesn’t tell us anything!”\u003c/p\u003e\n\u003cp\u003eI tried to get up, but Bex was already taking the seat on the arm of the couch beside me, the bracelet around her wrist.\u003c/p\u003e\n\u003cp\u003e“You didn’t just send us souvenirs, Cam,” she said, smiling.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Liz agreed. “You sent us souvenirs…from Rome.”\u003c/p\u003e\n\u003cp\u003eI think every Gallagher Girl in history has fantasized about the places her job will take her. In my dreams, Bex was beside me, Liz was somewhere running comms. There was usually a prince, a count, and a rogue arms dealer of some sort. And my dream, believe it or not, had always taken place in Rome.\u003c/p\u003e\n\u003cp\u003eI was in Rome, I had to think. I racked my brain, looking for memories of the Colosseum. I swallowed hard, searching for the taste of truly authentic pizza. It was the kind of thing I shouldn’t have been able to forget. The irony was almost too much.\u003c/p\u003e\n\u003cp\u003eMacey slapped her hands together and turned to my mother. “So when do we leave? I can call Dad’s secretary and get a jet here by the end of the day.”\u003c/p\u003e\n\u003cp\u003eI watched Bex and Liz begin to mentally pack and plan as Macey talked about the advantages of private jet travel. Zach and I were the only ones who saw the look that crossed Aunt Abby’s face.\u003c/p\u003e\n\u003cp\u003eI’d only seen that look twice before. Once in my mother’s office during Abby’s first few days as Macey’s guard. Another time on a moving train outside of Philadelphia, barreling through the night. It had been almost a year since I’d seen my aunt wear that expression, and I knew it wasn’t anger. There was no rage. It was simply a mixture of guilt and regret so deep that neither word could do it justice.\u003c/p\u003e\n\u003cp\u003eThe only word that came to mind was heartbreak.\u003c/p\u003e\n\u003cp\u003e“What is it, Abby?” I asked. “What aren’t you telling me?”\u003c/p\u003e\n\u003cp\u003e“Rome…” Abby said, just as my mother said, “Abby, no—”\u003c/p\u003e\n\u003cp\u003e“She has the right to know, Rachel,” Abby snapped, but then lowered both her voice and her gaze. “Cam deserves to know that it’s all my fault.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong,” Mom said, but Abby shook her head.\u003c/p\u003e\n\u003cp\u003e“Am I?”\u003c/p\u003e\n\u003cp\u003e“What does Rome mean?” Zach asked.\u003c/p\u003e\n\u003cp\u003e“Someone tell me,” I demanded.\u003c/p\u003e\n\u003cp\u003e“About a month before your father disappeared, he called me,” Abby said. “He was excited about something—more excited than I’d heard him in years. He didn’t want to tell Joe or even your mother, but he was close to something that could bring the Circle down. Those were his words: ‘Bring the Circle down.’ And he wanted me to come meet him—to help him. But I was late…” She turned to look out the window. “He was calling me from Rome. That’s what Rome means.”\u003c/p\u003e\n\u003cp\u003e“Matthew didn’t disappear for another four weeks, Abby. My husband did not disappear in Rome. It is not your fault.”\u003c/p\u003e\n\u003cp\u003e“He wanted me there, Rachel. Whatever it was, he needed me there.”\u003c/p\u003e\n\u003cp\u003e“So when do we leave?” Macey said again, fresh emphasis on every word.\u003c/p\u003e\n\u003cp\u003e“That’s the thing, Macey.” Zach stood and walked to the bookshelves. “We don’t.”\u003c/p\u003e\n\u003cp\u003eLiz looked at him as if he were crazy. “But it’s a clue. It’s a piece of the puzzle, a—”\u003c/p\u003e\n\u003cp\u003e“Risk,” I finished for her. “It’s a big risk.” I looked down at the envelope with its frayed edges. “I’m a big risk.”\u003c/p\u003e\n\u003cp\u003e“But…” Liz sounded utterly confused. “We went to the cabin and we found this. It has to matter. It has to mean something.”\u003c/p\u003e\n\u003cp\u003e“We went to the cabin, and the Circle found me.” I took a deep breath. “And then I killed someone.”\u003c/p\u003e\n\u003cp\u003e“But…” Liz started, and then realized that even she didn’t know how that sentence was supposed to end.\u003c/p\u003e\n\u003cp\u003e“They sent someone to kill her, Liz,” Zach said. “And they’ll keep sending people until they succeed.”\u003c/p\u003e\n\u003cp\u003eI watched Bex, saw her weighing the risks and rewards in her mind, but my mother was the only one who spoke.\u003c/p\u003e\n\u003cp\u003e“We’re going to have to think about this.” She stood, gently cradling in her hands the small packet I’d given her.\u003c/p\u003e\n\u003cp\u003e“But—” Liz started.\u003c/p\u003e\n\u003cp\u003e“But they don’t need me alive anymore.” I started for the door. “Everything is different now that they don’t need me alive.”\u003c/p\u003e\n\u003cp\u003eNo one told me I was wrong.\u003c/p\u003e\n\u003cp\u003e“Go to class,” Abby said. “We’ve got a lot to think about.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003eWe left the package in my mother’s office, but the memory of it followed us everywhere we went for the rest of the day.\u003c/p\u003e\n\u003cp\u003eI doodled the postmark all over the back of a pop quiz from Madame Dabney. In Advanced Languages, I kept writing and rewriting the address (but that worked out okay because I was writing it in Swahili).\u003c/p\u003e\n\u003cp\u003eBy the time the day was almost over, there was one thing that I couldn’t shake from my mind.\u003c/p\u003e\n\u003cp\u003e“Who is Zeke Rozell?” I asked, remembering the words on the label.\u003c/p\u003e\n\u003cp\u003eThe classroom was totally empty—just my friends and Zach and me.\u003c/p\u003e\n\u003cp\u003e“It’s one of Joe’s aliases,” Zach said with a shrug of his shoulders. “Technically, the cabin belongs to Mr. Rozell. He pays taxes and has a valid local driver’s license and makes an annual donation to the volunteer fire department, but he works in offshore drilling, so he doesn’t get into town very much.”\u003c/p\u003e\n\u003cp\u003eBex smiled slowly. “Mr. Solomon is awesome.”\u003c/p\u003e\n\u003cp\u003e“Mr. Solomon is in a coma,” I said numbly, sliding into my seat in the almost empty room.\u003c/p\u003e\n\u003cp\u003e“We know,” Macey said, as if the last thing any of us needed was a reminder.\u003c/p\u003e\n\u003cp\u003e“No. I mean Mr. Solomon is in a coma—and I knew that. I would have known he wasn’t there. Why would I send something to an empty cabin?”\u003c/p\u003e\n\u003cp\u003e“Because you’d planned on being there to get it.” When Bex spoke, it was as though the girl who had shouted at me in the forest was a million miles away, shattered by a sniper’s bullet, washed away like the black of my hair down the drain. “You were coming back,” she said again, emphasizing every word.\u003c/p\u003e\n\u003cp\u003e“I was coming back,” I repeated as, one by one, the rest of the senior class filtered through the door and took their places all around me.\u003c/p\u003e\n\u003cp\u003eI barely noticed a thing, though, until I heard Professor Buckingham say, “Good afternoon, ladies. Mr. Goode.”\u003c/p\u003e\n\u003cp\u003eShe didn’t look like a woman who’d had a clandestine, predawn rendezvous. But then again, I think clandestine rendezvous are probably what Professor Buckingham does best.\u003c/p\u003e\n\u003cp\u003e“Today our friends at the FBI have asked for a baseline assessment of your proficiency in the following technical maneuvers.” She handed a stack of folders to the first girl in every row, and slowly they passed the rest back. “So if you will follow me outside, we will begin…Yes, Cameron?” Buckingham said when I raised my hand.\u003c/p\u003e\n\u003cp\u003e“I don’t have one,” I said, looking down at the stack in my hands. Our names were written at the top in bold, black letters, but my name was nowhere to be seen. \u003c/p\u003e","sourceLink":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5/page-16.html","bookId":2402,"creation":"Oct 5, 2019 10:30:37 AM","modification":"Oct 5, 2019 10:30:37 AM"}
