{"id":74215,"no":21,"title":"Page 21","content":"\u003cp\u003eZach was the first to react. In a flash, he was turning to me, yelling, “Run!”\u003c/p\u003e\n\u003cp\u003eHe didn’t know that the man in the alley was Agent Townsend. He didn’t care that Agent Townsend was heading straight for him.\u003c/p\u003e\n\u003cp\u003e“Zach, no!” I yelled, then jumped in between the two of them. “Stop!” I cried, but Zach was already grabbing me around the waist and setting me in what he thought was a safer position.\u003c/p\u003e\n\u003cp\u003e“Ms. Morgan,” Townsend snapped. “Go!”\u003c/p\u003e\n\u003cp\u003e“You’re both telling me to run!” I screamed while Preston peeked out from behind the door to watch two highly trained fighters in their prime behave like a couple of idiots.\u003c/p\u003e\n\u003cp\u003eI don’t want to think about how long it might have lasted if it hadn’t been for the whistle. High and loud, it pierced the air and reverberated in the narrow space for what felt like forever.\u003c/p\u003e\n\u003cp\u003eEveryone turned and looked through the early morning haze at Bex, who said, “If you boys want to beat each other’s guts out, I’m willing to let you, but I’d rather get Cam someplace safe and find out what she’s doing walking the streets at five in the bloody morning.” She started back down the alley, then stopped and added, “Oh, and Zach, if you’re going to run away from school, leave a note. Even Cam did that.”\u003c/p\u003e\n\u003cp\u003eAbby was there, too, Macey by her side. I felt Townsend’s hand on my waist, pushing me down the alley and back to the safe house. Nobody seemed to notice or care about the other boy—the one in the corner, away from the chaos, until Macey stopped.\u003c/p\u003e\n\u003cp\u003eShe didn’t sound like herself when she said, “Preston?”\u003c/p\u003e\n\u003cp\u003eI don’t know if it was because she was seeing him, or seeing him hot and sweaty (both in the literal and figurative senses), but I could tell she was thrown in a way no Gallagher Girl is ever supposed to be. “Preston, is that you?”\u003c/p\u003e\n\u003cp\u003eThen Abby was beside me. She looked from Preston to the buildings that surrounded us, as if trying to place something in her mental map.\u003c/p\u003e\n\u003cp\u003e“Is this…” she started, looking at the boy, who nodded slowly.\u003c/p\u003e\n\u003cp\u003eSomehow, Preston didn’t seem nearly as freaked out as he should have been when he told us, “I think we need to go inside.”\u003c/p\u003e\n\u003cp\u003eHe didn’t ask for introductions. No one had to present clearance levels or ID. It was as if Preston knew that being in that alley at that moment meant that you were okay to invite home. Even when home was technically the United States embassy for the ambassador stationed in Rome.\u003c/p\u003e\n\u003cp\u003eSo Preston didn’t hesitate. He just led our crazy band through the secret door, and then to another that cordoned off the hallway inside. He stopped to punch out the code my subconscious had remembered.\u003c/p\u003e\n\u003cp\u003e“You really ought to change that more often,” I said as the door popped open.\u003c/p\u003e\n\u003cp\u003eHe smiled. “Will do.”\u003c/p\u003e\n\u003cp\u003eWhen we reached another door, Preston looked up at a surveillance camera that hung overhead. He gave his loopy grin and a small wave, and a second later, the door buzzed and a uniformed marine pushed it open.\u003c/p\u003e\n\u003cp\u003e“Welcome back, sir,” the marine said. If he was surprised to see Preston appear with three girls, a boy, and two grown-ups, he didn’t show it.\u003c/p\u003e\n\u003cp\u003ePreston pointed to the elevator. “Clear us through to the residence, okay?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” the guard said, and a moment later we were all inside an elevator with a marble floor and mirrored walls. A chandelier of Murano glass hung overhead.\u003c/p\u003e\n\u003cp\u003e“Cool place,” Bex told Preston under her breath.\u003c/p\u003e\n\u003cp\u003e“That’s the thing about having a dad who runs for president.” Preston gave an awkward smile. “Even losing has its privileges.” He took us all in, but really, he had eyes only for Macey. “It’s good to see you, Mace.”\u003c/p\u003e\n\u003cp\u003eBex and I looked at each other. He calls her Mace?\u003c/p\u003e\n\u003cp\u003e“Hi,” Macey said. “So…Rome?” She looked around the ornate car. “It’s nice,” she told him, and he nodded.\u003c/p\u003e\n\u003cp\u003e“Yeah, it was this or the embassy in Tokyo—I told you that, right?”\u003c/p\u003e\n\u003cp\u003eMacey nodded. “Yeah. But I haven’t talked to you since the move.”\u003c/p\u003e\n\u003cp\u003eWhen the doors opened, I could tell we were on the top floor because the light was different. There was a tall window with a view of the city. Lush, thick carpet was beneath our feet.\u003c/p\u003e\n\u003cp\u003e“I’ll just be a second,” Preston whispered, pointing to the opposite end of the hall. “You guys can wait in the dining room. No one uses it in the morning. Cammie knows the way.”\u003c/p\u003e\n\u003cp\u003eI started to say that, no, I didn’t, but before I could utter a word, there was a man at the end of the hall, raising an arm and saying, “Cammie! You’re here!”\u003c/p\u003e\n\u003cp\u003eThe first time I ever saw Sam Winters, he was the governor of Vermont and a front-runner for the presidency of the United States. The last time I saw him…Well, judging by the way he threw open his arms and pulled me into a massive hug, it was pretty obvious I didn’t remember the last time I’d seen him.\u003c/p\u003e\n\u003cp\u003e“How are you, Cammie? It’s so good to see you and Preston back together again.” Ambassador Winters lingered on the words, and from the corner of my eye, I saw Preston blush. “So, my dear, what brings you to Rome?”\u003c/p\u003e\n\u003cp\u003e“Fall break,” I said, pleased with how natural the lie sounded. “And I knew I couldn’t come to Italy without stopping by, because of…”\u003c/p\u003e\n\u003cp\u003e“Me,” Macey said. “I insisted we come by even though it’s early. We only have a few hours before we catch a connecting flight and leave town.”\u003c/p\u003e\n\u003cp\u003e“Oh, Macey, dear. I didn’t see you there.” It was probably the first—and last—time that a man had missed seeing Macey McHenry, but no one said so. The ambassador was too busy giving Macey a hug and asking me, “And who are your friends?”\u003c/p\u003e\n\u003cp\u003e“Ambassador Winters, allow me to introduce my aunt Abby and her…boyfriend.” Townsend tensed. Abby glared. And Rebecca Baxter looked like she was going to choke on her own chewing gum.\u003c/p\u003e\n\u003cp\u003e“And this is our roommate, Bex,” Macey said.\u003c/p\u003e\n\u003cp\u003eBex took the ambassador’s hand and said hello in a way that would have made Madame Dabney extremely proud.\u003c/p\u003e\n\u003cp\u003e“And this is Zach,” I said, rounding out the group; but Zach just stood stoically with his arms across his chest. (I guess the Culture and Assimilation curriculum at Blackthorne leaves a lot to be desired.)\u003c/p\u003e\n\u003cp\u003e“Welcome, welcome.” Ambassador Winters gave a nod to the group, then turned back to me. “Now, I’m afraid I was just about to run out for a breakfast meeting at the Vatican, but I’m so glad you stopped by. Preston, take good care of these fine people.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” Preston said.\u003c/p\u003e\n\u003cp\u003eHis father slapped his hands together in the universal signal for My work here is done. But before he turned away, he reached for me, gave me one last hug. “Cammie, dear, it was good to see you again.” He gave us one final smile. “You all come back any time.”\u003c/p\u003e\n\u003cp\u003eAnd then he was gone, down the plush hallway as if he’d never been there at all.\u003c/p\u003e\n\u003cp\u003eTwo minutes later, Preston was ushering us through a door and saying, “Can you wait in here a second?”\u003c/p\u003e\n\u003cp\u003e“This is fine, thanks,” Abby told him, and then he was gone.\u003c/p\u003e\n\u003cp\u003eI looked around the room. There was a long table surrounded by a dozen high-backed chairs, all upholstered in the best Italian leather. Rich red curtains framed tall windows that overlooked the city. It was the kind of view that I’m pretty sure normal tourists would have remembered. But then again, I hadn’t been normal in a very long time.\u003c/p\u003e\n\u003cp\u003e“So you’re Zach.” Townsend didn’t even try to hide the judgment in his voice as he looked Zach up and down in some sort of silent but dangerous examination.\u003c/p\u003e\n\u003cp\u003eZach huffed but smiled. “So you’re Townsend.”\u003c/p\u003e\n\u003cp\u003eThe two of them stared for a long time, wordless. It felt a little like I was watching a documentary on the Nature Channel, something about alpha males in the wild. I didn’t have a clue how it was going to end until Townsend nodded and took a deep breath.\u003c/p\u003e\n\u003cp\u003e“I suppose you should hear it from me that I have met your mother.” He smiled a little sadly. “Well…when I say met, I mean one time I tried to kill her.”\u003c/p\u003e\n\u003cp\u003eThere was a charge in the air. Maybe it was the plush carpet beneath our feet, but I could have sworn I felt a spark.\u003c/p\u003e\n\u003cp\u003e“Do me a favor.” Zach’s voice was low and dark and dangerous. “Next time, don’t just try.”\u003c/p\u003e\n\u003cp\u003eTownsend smiled, and for a moment the two of them looked like long-lost friends.\u003c/p\u003e\n\u003cp\u003e“Boys,” Bex said, dropping into the chair at the head of the table.\u003c/p\u003e\n\u003cp\u003eAbby rolled her eyes. “Exactly.”\u003c/p\u003e\n\u003cp\u003e“Excuse me, Abigail, but whose shift did she get away during?” Townsend asked with a glare.\u003c/p\u003e\n\u003cp\u003e“Excuse me, Townsend, but who was supposed to booby-trap the doors?”\u003c/p\u003e\n\u003cp\u003e“I’m an agent of Her Majesty’s Secret Service,” Townsend said, indignant. “I do not do booby traps.”\u003c/p\u003e\n\u003cp\u003e“Well, maybe you should start,” Bex warned. “If you haven’t heard, Cammie is pretty good at running away.”\u003c/p\u003e\n\u003cp\u003e“I didn’t run away,” I snapped. Everyone stared. “I didn’t. This time I sleepwalked away. And I came here.”\u003c/p\u003e\n\u003cp\u003e“Why?” Abby asked me.\u003c/p\u003e\n\u003cp\u003eIt was an excellent question—and lucky for me, that’s when the one person in the world who might have been able to answer it opened the door at the rear of the room.\u003c/p\u003e\n\u003cp\u003e“So what brings you back to Rome, Cammie?” Preston said. He closed the door, and the smile slid from his face. “Why are you really here?”\u003c/p\u003e\n\u003cp\u003eIf there was any way to lie, I could have done it. I had the training. The skills. But there comes a time—even for a Gallagher Girl—when the best weapon in your arsenal is the truth.\u003c/p\u003e\n\u003cp\u003e“Well, it’s about last summer,” I said slowly, and Preston turned to Macey.\u003c/p\u003e\n\u003cp\u003e“Do you know what this is about?” he asked, and Macey looked at Abby, who nodded Go ahead.\u003c/p\u003e\n\u003cp\u003eMacey opened her mouth, started to speak, but there’s a feeling that comes when two halves of a girl’s world collide. I could see it happening to Macey. The politician’s son was meant to know her as the senator’s daughter. He was never supposed to meet the Gallagher Girl.\u003c/p\u003e\n\u003cp\u003eIt must have been harder than it sounds for Macey to look at him and say, “You know how I go to that boarding school? Well, it’s—”\u003c/p\u003e\n\u003cp\u003e“A training academy for spies,” Preston said as if it were the most obvious thing in the world. “I know,” he said. “Cammie told me.”\u003c/p\u003e\n\u003cp\u003eThen it was my turn to get the crazy glares.\u003c/p\u003e\n\u003cp\u003e“Indeed,” Townsend said. He sounded like a man who had always suspected we Gallagher Girls must be easy to break.\u003c/p\u003e\n\u003cp\u003e“I had my reasons,” I said. “I don’t remember my reasons, but I’m sure I must have had them.”\u003c/p\u003e\n\u003cp\u003e“When?” Abby asked, stepping toward Preston, hand on hip.\u003c/p\u003e\n\u003cp\u003e“Hey, I know you. You’re the Secret Service agent who—”\u003c/p\u003e\n\u003cp\u003e“Got shot,” Bex finished for him. “She got shot for Macey. She almost died for Macey. And now she’s willing to die…for her.” Bex pointed at me. “We’re all willing to die for her. So answer the woman’s question!” \u003c/p\u003e","sourceLink":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5/page-21.html","bookId":2402,"creation":"Oct 5, 2019 10:30:37 AM","modification":"Oct 5, 2019 10:30:37 AM"}
