{"id":7940,"no":33,"title":"CHAPTER XXXIII. ANOTHER PLOT.","content":"\u0026nbsp;\"So he mastered Bucephalus,\" said James Grey, when alone with his son. \"He must be a splendid rider.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had no idea he was so used to horses,\" said Jasper. \"He sat like a rock, and did not seem in the least frightened.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I begin to think he is more dangerous than I at first supposed. Did he appear to suspect anything when the horse began to behave badly?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he did.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He may be surprised that we should give him that horse when we don\u0027t ride it ourselves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He doesn\u0027t know that. He asked me if I ever rode Bucephalus, and I told him yes, but not often, as I preferred my own horse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do, if John doesn\u0027t undeceive him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"John is a meddlesome fellow,\" said Jasper, in a tone of vexation. \"He tried to persuade him not to ride Bucephalus.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"John makes a fool of himself. I am afraid he will arouse Gilbert\u0027s suspicions. If he does, we must do what we can to allay them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall you do now, father?\" inquired Jasper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have not decided. When I have, I may not tell you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\" asked Jasper, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not from any feeling of distrust, for we are both in the same boat, and equally interested in frustrating your cousin\u0027s designs. But it may be necessary to resort to strong—perhaps forcible measures—and it may be well that you should be kept in entire ignorance of them. It is a serious peril for both of us, this claim of Gilbert\u0027s, but more so to you. I have already enjoyed the estate for a long time. In the course of nature I have thirty-five years less of life to look forward to than you. Therefore your interest is greater than mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, father. Whatever you think best I am ready to agree to; but if you need any help that I can give, just let me know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That shall be understood. Now, you had better go out and look for your cousin. It is not best that John and he should be left to themselves too long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasper went out into the stable-yards, but found that Gilbert had already gone into the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a mighty foine lad, that Gilbert,\" said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he\u0027s a clever fellow,\" responded Jasper, not very enthusiastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s as smart as a steel-trap,\" said John, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t know steel-traps were very smart,\" said Jasper, sarcastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt instinctively that John considered Gilbert smarter than himself, and his self-conceit was so great that this troubled him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait till you get into one,\" said John, laughing. \"If you\u0027d get your little finger into one of them things, you\u0027d find it was too smart for ye.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did Gilbert have to say to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But John was too smart to be pumped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing much,\" he answered. \"He says the ugly brute won\u0027t give no more trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think so yourself?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He won\u0027t trouble Mr. Gilbert.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will he trouble anybody else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe not. He\u0027s had a good lesson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder whether Gilbert told him what I said,\" thought Jasper. He didn\u0027t like to ask, for, in so doing, he would betray himself. After a little pause he walked back to the house; but he did not see Gilbert for some time, for the latter was still in his chamber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they met at supper, Mr. Grey said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ought to apologize to you, Gilbert, for trusting you to such a horse; but he has never cut up such pranks before, and I did not realize the danger to which I was exposing you. From what Jasper says, you must have been in peril.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose I should have been, sir, if I had not been so accustomed to horses; but I have ridden a great deal, though I don\u0027t think I ever had such a sharp contest before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You had better ride Sidney to-morrow—I don\u0027t want you to run any more risk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir; but I am not afraid. Bucephalus has had a lesson, and won\u0027t try to master me again. With your permission, I will try him again, and hope to have him wholly subdued before I go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad to have him subjugated, I confess, as it will greatly enhance his value; but I don\u0027t want you to run any further risk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The danger is quite over, Mr. Grey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This conversation, and the regret frankly expressed by his uncle, did considerable to put to rest the suspicion that had been excited in Gilbert\u0027s mind. It did look strange, to be sure, that Jasper should have made a false claim to have ridden Bucephalus, when he hadn\u0027t done so; but possibly this was because he did not like to have it supposed that he was inferior in courage or in horsemanship. At any rate, though not quite satisfied, he felt that there might be an explanation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning the boys went out to ride once more. Bucephalus justified Gilbert\u0027s prediction, and behaved as well as could be expected. Once he made a start, but a sudden twitch of the reins recalled to his mind the defeat of the day before, and he quickly relapsed into obedience.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Mr. Grey paced the floor of his library, and thought deeply. To what means should he resort to avert the danger that menaced his estate? He knew enough now of Gilbert to understand that he was resolute and determined. He might be conciliated, but could not be intimidated while he felt that he was battling for his inherited rights. Would it be worth while to conciliate him? Mr. Grey feared that he would require the surrender of the major portion of the estate, and to this he was not willing to accede. While he was thus perplexed, Pompey made his appearance, and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s a man wants to see you, Mr. Grey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A man, or a gentleman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A man. It\u0027s Hugh Trimble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bring him up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Some idea must have been started in Mr. Grey\u0027s mind, for his eyes lighted up with a gleam of exultation, and he muttered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The very thing. Why didn\u0027t I think of it before?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hugh Trimble shuffled into the room—a tall, shambling figure of a man, with a generally disreputable look. He was roughly dressed, and appeared like a social outlaw. He was a tenant of Mr. Grey\u0027s, living on a clearing just on the edge of a forest. He had a wife, but no children. She led a hard life, being subjected to ill usage from her husband when, as was frequently the case, he was under the influence of liquor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Such was the man who entered the library, and evidently ill at ease on finding himself in a room so unfitted to his habits, made a clumsy salutation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Trimble,\" said Mr. Grey, with unusual cordiality, \"how are you getting on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bad enough,\" returned Trimble, \"I haven\u0027t got no money for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you been unlucky?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m always unlucky,\" growled Trimble, frowning. \"I was born to bad luck, I was.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps your bad luck will leave you, after a time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see no signs of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sit down,\" said Mr. Grey, with continued cordiality. \"There\u0027s a chair next to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hugh Trimble seated himself cautiously on the edge of a chair, a little surprised at the unexpected attention he was receiving.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to speak to you on an important subject.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir,\" responded the backwoodsman, not without curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You say you have been always unlucky?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you don\u0027t expect your luck to change, I think you said?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not unless it becomes worse,\" grumbled Trimble.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you consider it good luck if some one should pay you over a thousand dollars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would I? I\u0027d think myself a rich man.\" exclaimed Trimble. \"But who\u0027s a goin\u0027 to do it?\" he added, in a more subdued voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will, on certain conditions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will give me a thousand dollars?\" exclaimed the backwoodsman, opening wide his eyes in astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On conditions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Name \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"First, you must promise that what I tell you shall be kept secret.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hugh Trimble made the promise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Grey now rose and closed the door, which was partially open, and, drawing his chair near that of his visitor, conferred with him, in a low voice, for some twenty minutes. At the end of that time he dismissed him with a parting injunction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Remember what I have told you, and, above all things, be secret.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the visitor had departed, he stood with his back to the fire, and smiled unpleasantly, as he repeated:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it\u0027ll work—I think it\u0027ll work.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3019/83499.html","bookId":262,"creation":"Aug 1, 2019 8:06:54 AM","modification":"Aug 1, 2019 8:06:54 AM"}
