{"id":82880,"no":40,"title":"Page 40","content":"\u003cp\u003e“Four goats, a flock of chickens, and a pig,” Rudd said.\u003c/p\u003e\n\u003cp\u003e“That’s quite a few,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“My wife and children keep ‘em.”\u003c/p\u003e\n\u003cp\u003e“How enterprising of them,” Gemma said, only half listening. She could hear a bell ringing. But it wasn’t just any bell, it was a chime that she knew. It belonged to—\u003c/p\u003e\n\u003cp\u003e“Jo-Jo, stop this deer-prancing nonsense and walk like a respectable creature.”\u003c/p\u003e\n\u003cp\u003e“Grandmother Guri!” Gemma shouted, her jaw dropping with shock.\u003c/p\u003e\n\u003cp\u003e“Hello, my girl,” Grandmother Guri called as she picked her way among the rocks with a knobby cane. She dragged her white goat along behind her with a rope tied to the animal’s pretty, sky-blue collar and brass bell.\u003c/p\u003e\n\u003cp\u003eGemma ran to greet her, throwing her arms around the short, old woman. Gemma was attacked by the desire to cry—and a tear or two might have gotten away from her—as she was enveloped by Grandmother Guri’s warm arms and scent of hay and cinnamon.\u003c/p\u003e\n\u003cp\u003e“Now, now. Everything is just fine,” Grandmother Guri said, patting Gemma on the back as she held her. “You’ve done well.”\u003c/p\u003e\n\u003cp\u003eFoss and Rudd stood a few feet away, looking like they wished they were a million miles away. They swapped expressions before each guard strolled in the opposite direction, giving Gemma and Grandmother Guri enough space to speak softly.\u003c/p\u003e\n\u003cp\u003e“What are you doing out here?” Gemma asked, impatiently flicking a tear from her eye when they finished hugging.\u003c/p\u003e\n\u003cp\u003e“I’m collecting herbs. I need some chives, and the only bunch in the area still alive is here by the lake. Jo-Jo is along to carry my things for me,” Grandmother Guri said, affectionately smacking the goat—who had saddle bags slung over her sides—on the rump.\u003c/p\u003e\n\u003cp\u003eJo-Jo baaed and nibbled on Grandmother Guri’s bright red mittens before the old lady pulled her hands out of the goat’s range.\u003c/p\u003e\n\u003cp\u003e“So you’re still alive, eh?” Grandmother Guri asked as she squinted up at Gemma.\u003c/p\u003e\n\u003cp\u003e“How much have you heard?” Gemma asked.\u003c/p\u003e\n\u003cp\u003e“Bits and pieces. Gossip does run from the palace like gravy. People bring me the news they hear since they know you’re my girl. They said the King’s got it in his silly, cracked knob that you can spin straw into gold.”\u003c/p\u003e\n\u003cp\u003e“Flax fibers,” Gemma said.\u003c/p\u003e\n\u003cp\u003eGrandmother Guri swiped a hand through the air, brushing off the correction, and continued. “They also say you’ve been doing it.”\u003c/p\u003e\n\u003cp\u003e“They’ve been…misled,” Gemma said, glancing at Foss and Rudd, who were doing their best imitations of lakeside boulders.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“Why don’t we sit down?” Gemma asked. “The story is…long.”\u003c/p\u003e\n\u003cp\u003e“Might as well, then. Won’t do my old bones a bit of good to stand that long. Get the packs from Jo-Jo; I’ve got a cushion in there,” Grandmother Guri said as she adjusted the red headscarf wrapped around her white hair.\u003c/p\u003e\n\u003cp\u003eAfter some maneuvering, Gemma and Grandmother Guri sat side by side on the saddlebags, a small blanket thrown over their laps. Jo-Jo grazed a few feet away but occasionally drew closer to nibble on Grandmother Guri’s thick, black skirt.\u003c/p\u003e\n\u003cp\u003e“Now. Start from the top—when King Torgen called you to the palace,” Grandmother Guri said.\u003c/p\u003e\n\u003cp\u003eGemma’s tale spilled from her lips like snow in a snowstorm. It was a relief to tell someone about the threats, Gemma’s fright, and the long, dark hours. Grandmother Guri didn’t react when Gemma talked about Stil and everything he did for her. She snorted when Gemma described her escape and less than triumphant return, but for the most part the old woman was silent and thoughtful.\u003c/p\u003e\n\u003cp\u003e“That’s quite a story,” she said when Gemma finished.\u003c/p\u003e\n\u003cp\u003e“You believe me?”\u003c/p\u003e\n\u003cp\u003e“Course I do. You’re not a fanciful girl. If you said there was a mage, there was a mage. There must have been, or King Torgen woulda killed you at the first sunrise,” Grandmother Guri said.\u003c/p\u003e\n\u003cp\u003e“I tried to tell Lady Linnea. She thinks I’m covering for a lover,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“She may be half right,” Grandmother Guri said.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Gemma frowned.\u003c/p\u003e\n\u003cp\u003eGrandmother Guri patted Gemma’s cheek. “It’s best to not worry about it yet, my girl. Though it is a shame you don’t know what this mage looks like. You should ask him to remove his hood.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“So you can inspect the goods!”\u003c/p\u003e\n\u003cp\u003eGemma almost choked on shock. “He’s a magic user. The man must be fifty if he’s a day!” she declared.\u003c/p\u003e\n\u003cp\u003e“Ah, but he is a mage, not an enchanter. Mages are done with their schooling sooner and don’t live as long. There’s a chance he’s young and handsome!” Grandmother Guri cackled.\u003c/p\u003e\n\u003cp\u003e“Grandmother.”\u003c/p\u003e\n\u003cp\u003e“It’s best to keep your options open.”\u003c/p\u003e\n\u003cp\u003e“Mages fancy mages. They leave us normal folk out of it—thank the heavens. Such courtships must be utterly bizarre.” \u003c/p\u003e","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-40.html","bookId":1805,"creation":"Oct 5, 2019 4:47:58 PM","modification":"Oct 5, 2019 4:47:58 PM"}
