{"id":82888,"no":48,"title":"Page 48","content":"\u003cp\u003eStil shrugged. “The rider is strongest at night. It wouldn’t be untrue to say light is his weakness—he won’t move in it, anyway, and he and his animals fear it. He can’t get into Verglas, but somehow he’s still tracking me. I have tried moving from one end of Verglas to the other, and he waits for me on the border. I know it may sound like traveling with me will be more dangerous than if you were to move alone, but as long as we are in Verglas, it will be fine.”\u003c/p\u003e\n\u003cp\u003e“Sir Mage,” Gemma said, her voice tight with pain. “The point is I will have to leave Verglas.”\u003c/p\u003e\n\u003cp\u003e“I can get you to a border and hide you better and in more comfort. One of my companions should arrive soon to aid us. I’ve received word that she has recently resurfaced in the southern kingdoms.”\u003c/p\u003e\n\u003cp\u003eShe? Gemma raised her eyebrows at the pronoun and the soft smile Stil wore. The last thing I need is to get involved in a mage’s love affair.\u003c/p\u003e\n\u003cp\u003e“So, we will flee together,” Stil concluded.\u003c/p\u003e\n\u003cp\u003e“Who is this rider who chases you?” Gemma asked.\u003c/p\u003e\n\u003cp\u003e“I don’t think ‘who’ is the right word. He’s not human. The rider is…” the mage was quiet for a moment, his expression tight. “The rider is darkness wrapped around death. He hasn’t a soul—he’s too evil for that. There is nothing human-like about him except for the shape of his body. He’s the worst nightmare you can imagine, and his darkness is the kind that tempts people to do evil things. He is hatred, and he hungers for bloodshed and the agony of others.”\u003c/p\u003e\n\u003cp\u003eGemma’s throat closed at the description.\u003c/p\u003e\n\u003cp\u003eStil wasn’t being chased by a lightweight, evil sorcerer. He had a creature of darkness on his trail.\u003c/p\u003e\n\u003cp\u003eA few minutes passed before Gemma was able to summon a safer subject to discuss.\u003c/p\u003e\n\u003cp\u003e“Do you intend to go hooded the whole time? We’ll be in trouble if you take it off—I’ll never be able to find you again,” she dryly said.\u003c/p\u003e\n\u003cp\u003eStil tilted his head.\u003c/p\u003e\n\u003cp\u003e“Being that I have no idea what you look like,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“Oh,” Stil said. “I apologize; I had forgotten. I’ve been going hooded to avoid King Torgen’s attention.”\u003c/p\u003e\n\u003cp\u003e“Are you famous?” Gemma asked.\u003c/p\u003e\n\u003cp\u003eStil hesitated. “Yes, I suppose,” he said, before flipping off his hood.\u003c/p\u003e\n\u003cp\u003eGemma worked hard to keep her mask of indifference in place. Stil was a handsome as stories told round the campfire made royal princes out to be. His nose—matching his fine lips and chin—was long and slender, setting off his high cheekbones and flawless skin. His eyes were a dynamic spattering of blue—the same color as the sky with circles of royal blue slicing through to the center.\u003c/p\u003e\n\u003cp\u003eHis hair was blue-black—like a night sky. The front was feathered but the back was long and silky, pulled into a low ponytail that disappeared into his cloak.\u003c/p\u003e\n\u003cp\u003eTo be frank, Stil was the most handsome man Gemma had seen—and she had caught a glimpse of the famed Arcainian princes! She knew magic users were supposed to better looking than the general population, but this was ridiculous!\u003c/p\u003e\n\u003cp\u003e“Hm,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“Hm? That is all you have to say,” Stil frowned.\u003c/p\u003e\n\u003cp\u003e“Were you expecting a scream of horror?”\u003c/p\u003e\n\u003cp\u003e“No,” Stil said. “It’s only—well, I know I’m nothing compared to an enchanter, but most find me attractive.”\u003c/p\u003e\n\u003cp\u003e“Tsk,” Gemma said, turning her back to the craftmage. “When do we leave?”\u003c/p\u003e\n\u003cp\u003eStil sighed and muttered under his breath.\u003c/p\u003e\n\u003cp\u003e“You do not want to travel in the dead of night, but the closer we get to dawn, the easier it will be for King Torgen to find us,” Gemma said, peering out of a glass window.\u003c/p\u003e\n\u003cp\u003e“We need to wait until after midnight. Even if King Torgen does not have guards posted, I imagine he will personally watch the tower for some time,” Stil said.\u003c/p\u003e\n\u003cp\u003e“You think he will have missed your arrival?” Gemma asked.\u003c/p\u003e\n\u003cp\u003eStil smiled, and Gemma could see that his eyes gleamed and crinkled with the gesture. “After the way I arrived the first time you had to complete this impossible task, do you really think I can’t move without being seen?”\u003c/p\u003e\n\u003cp\u003e“True,” Gemma shrugged. She looked past Stil to eye the spinning machine. “But if we are going to run, why do you spin?”\u003c/p\u003e\n\u003cp\u003e“Distraction. When King Torgen sees how much gold is present, he will forget about you for a while—I imagine,” Stil said, adding more fibers to the distaff.\u003c/p\u003e\n\u003cp\u003e“You cannot possibly spin it all.”\u003c/p\u003e\n\u003cp\u003e“No, and I won’t. But I can get enough done to be a proper distraction,” Stil said. “Although I will still need a payment.”\u003c/p\u003e\n\u003cp\u003eGemma glanced at the wool cape she had worked on since the second night Stil saved her. It wasn’t finished yet. She couldn’t give it to him. “I don’t have any gold. I have a few dull weapons—hand axes and the like.”\u003c/p\u003e\n\u003cp\u003e“Hmm,” Stil said, rubbing his chin as he thought.\u003c/p\u003e\n\u003cp\u003eHis scrutiny was a little more uncomfortable to bear now that Gemma could see his uncommonly handsome face fixed on her.\u003c/p\u003e\n\u003cp\u003e“Perhaps…” Stil said, strolling to her side.\u003c/p\u003e\n\u003cp\u003e“Yes?” Gemma said, turning away from the window.\u003c/p\u003e\n\u003cp\u003eStil smiled widely. “How about your firstborn child?” he said, speaking slowly, like a cat rubbing against furniture.\u003c/p\u003e\n\u003cp\u003eGemma stopped thinking altogether. ‘What?” she asked, slumping against the tower wall.\u003c/p\u003e\n\u003cp\u003eStil planted a hand on either side of her head, boxing her in. “Your firstborn child will be mine,” Stil said, the words coming more confidently this time.\u003c/p\u003e\n\u003cp\u003eGemma raised an eyebrow. “That is quite a hefty raise in price.” \u003c/p\u003e","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-48.html","bookId":1805,"creation":"Oct 5, 2019 4:47:58 PM","modification":"Oct 5, 2019 4:47:58 PM"}
