{"id":82897,"no":57,"title":"Page 57","content":"\u003cp\u003e“No. I sew for other people, not myself. That is the way it has always been,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“I wonder if it has to do with that blasted sense of sacrifice you have. You sew for other people—hah!” Stil said, shaking his head. “I will have to introduce you to my fellow craftmages. They will love you, and you will never have to worry again about money. You practically can spin straw into gold—that is, you can make an item normally useless into a priceless treasure,” Stil snorted.\u003c/p\u003e\n\u003cp\u003eGemma shrugged, not quite believing his praise.\u003c/p\u003e\n\u003cp\u003e“Thank you, Gemma. You have given me something so valuable it cannot be fathomed,” Stil said, dragging his eyes from the cloak.\u003c/p\u003e\n\u003cp\u003e“Thank you for all your help…and for using your magic on my behalf,” Gemma said.\u003c/p\u003e\n\u003cp\u003eStil’s eyes glowed as a soft, tender smile stole across his lips. He crossed the room to stand in front of her. He slid an arm around her, scooping her against her chest, and he lowered his face—his lips, more correctly—towards her.\u003c/p\u003e\n\u003cp\u003eGemma came to a realization. Stil quite possibly found her attractive.\u003c/p\u003e\n\u003cp\u003eThe incoming kiss told Gemma he might actually find her more than attractive; he perhaps even liked her, or fancied her.\u003c/p\u003e\n\u003cp\u003eShe immediately rejected the idea.\u003c/p\u003e\n\u003cp\u003eIt was preposterous. Magic users never fell in love with civilians. There was the occasional heart-breaking love story, where a mage or enchanter fell in love with a princess or some such nonsense, but they were rare.\u003c/p\u003e\n\u003cp\u003eNo. Magic users loved other magic users. It was the rule.\u003c/p\u003e\n\u003cp\u003eGemma, paralyzed where she stood, waited for Stil to back off to declare it all a joke.\u003c/p\u003e\n\u003cp\u003eWhen he was so close, she could feel his breath on her lips, Gemma exploded backwards.\u003c/p\u003e\n\u003cp\u003e“No,” she said, shaking a finger at Stil as if he were a miscreant dog.\u003c/p\u003e\n\u003cp\u003e“What?” Stil asked, tilting his head.\u003c/p\u003e\n\u003cp\u003e“Whatever you’re doing, NO.”\u003c/p\u003e\n\u003cp\u003eStil tilted his head in the other direction. “What do you think I’m doing?” he asked, taking a step towards Gemma.\u003c/p\u003e\n\u003cp\u003eGemma rushed to put the settee in between them. “You,” she said, “are…I don’t know.”\u003c/p\u003e\n\u003cp\u003e“I think you do know.”\u003c/p\u003e\n\u003cp\u003e“No, I don’t,” Gemma said, shaken by the ordeal. Mages didn’t go around almost kissing people. It just wasn’t done. Wars could be started that way!\u003c/p\u003e\n\u003cp\u003e“You are a smart girl. Try to figure it out. I think you will find there is one easy conclusion.”\u003c/p\u003e\n\u003cp\u003e“Except that conclusion is impossible,” Gemma squeaked, scared out of her usual indifference when Stil stepped around the settee. Gemma circled it to keep it between herself and the mage.\u003c/p\u003e\n\u003cp\u003e“Why is it so impossible that I should love you—,”\u003c/p\u003e\n\u003cp\u003e“NO!” Gemma shouted.\u003c/p\u003e\n\u003cp\u003e“Oh, come now. You can’t really think I am doing this because I’m a flirt,” Stil chuckled before he lunged around the settee.\u003c/p\u003e\n\u003cp\u003eFrightened by the throaty noise, Gemma fled to the far side of the room, scampering behind the second settee. “Mages don’t fall in love with normal people!”\u003c/p\u003e\n\u003cp\u003e“In your defense, you are not normal,” Stil said, strolling across the parlor.\u003c/p\u003e\n\u003cp\u003e“You…are,” Gemma struggled for a moment. “Blinded by your, ah, inaccessibility to other mages. What you’re feeling isn’t real.”\u003c/p\u003e\n\u003cp\u003e“Gemma.”\u003c/p\u003e\n\u003cp\u003eGemma was starting to get a better hold on herself and was able to bring down the octave of her voice. “I thought you were acting oddly. The fine clothes and the bedroom, accompanying me to the border instead of sending me on my way like any proper storybook magician. Clearly, you are under some sort of mental strain,” Gemma said, faking out Stil to make him circle around the settee again, leaving her to flee in the opposite direction.\u003c/p\u003e\n\u003cp\u003eWhen she was safe on the other side of the settee, she smoothed her dress and lifted her chin. “Love affairs between mages and seamstresses just aren’t done,” she finished primly before leaping out of the way when Stil tried to pounce on her.\u003c/p\u003e\n\u003cp\u003e“Gemma.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Why else do you think I demanded your firstborn child as a payment for spinning?” Stil said, carefully enunciating the words.\u003c/p\u003e\n\u003cp\u003eGemma blinked. “I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“If I didn’t love you, why would I want your firstborn?”\u003c/p\u003e\n\u003cp\u003e“To be a house-servant? I don’t know! Magic folk are all eccentric. We did establish that I don’t want children, so it hardly matters,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“It matters because my required payment means if you ever change your mind, I will be your child’s father.”\u003c/p\u003e\n\u003cp\u003eGemma screwed up her face. “You are the most ridiculous mage—,” her words died on her lips as she recalled Stil’s odd wording. She hadn’t paid much attention—mostly because she didn’t particularly want children, and the idea of getting married was so far off and unlikely after all she went through it wasn’t like it mattered.\u003c/p\u003e\n\u003cp\u003eBut the wording. He had said, “Your firstborn child will be mine.”\u003c/p\u003e\n\u003cp\u003eGemma narrowed her eyes. “You,” she growled.\u003c/p\u003e\n\u003cp\u003eStil’s eyebrows popped up. “So, now you’re mad?” \u003c/p\u003e","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-57.html","bookId":1805,"creation":"Oct 5, 2019 4:47:58 PM","modification":"Oct 5, 2019 4:47:58 PM"}
