{"id":82923,"no":83,"title":"Page 83","content":"\u003cp\u003eStil was standing just in reach of the torchlight, the silver embroidery on his cape gleaming. His hood was pushed down, and his unusual eyes were ringed by dark circles, but he was whole, and healthy, and he was here.\u003c/p\u003e\n\u003cp\u003eGemma couldn’t say a word. She scrambled to her feet and threw herself at the craftmage, clinging to him as the tears fell. Stil chuckled and slid his arms around Gemma. “I know I’m early, but I believe the deal was you would not leave until you saw Linnea happy?” he said teasingly, resting his head on Gemma’s.\u003c/p\u003e\n\u003cp\u003e“You’re here,” Gemma whispered, her heart singing with joy.\u003c/p\u003e\n\u003cp\u003e“Of course,” Stil said.\u003c/p\u003e\n\u003cp\u003eWhen Gemma finally looked up at him, Stil slid a hand under her jaw and kissed her long and passionately. After a minute, he pulled back and rested his forehead against hers. “Although I must admit, a season was too long to be away from you. Let’s not do this again.”\u003c/p\u003e\n\u003cp\u003e“Agreed,” Gemma said, sagging in Stil’s arms. It was like coming home.\u003c/p\u003e\n\u003cp\u003eHe smelled of metal and forges, but also of pine trees and the outdoors. He really was here!\u003c/p\u003e\n\u003cp\u003e“I have come to take you away,” Stil whispered in Gemma’s ear. “This time…will you come?”\u003c/p\u003e\n\u003cp\u003eGemma smiled—not a small one or soft one, but a rare smile. A wide smile that lit up her face and threatened to steal all of her good sense. “Yes,” she said.\u003c/p\u003e\n\u003cp\u003e“Finally,” Stil said, kissing her again.\u003c/p\u003e\n\u003cp\u003eThe couple staggered when Hvit playfully bit on and pulled Stil’s cloak. The craftmage released Gemma long enough to pet the mischievous lupine before picking Gemma up and twirling her around for the fun of it.\u003c/p\u003e\n\u003cp\u003e“Marry me,” Stil demanded, holding Gemma propped up.\u003c/p\u003e\n\u003cp\u003e“Yes. Will you marry me?” Gemma asked.\u003c/p\u003e\n\u003cp\u003e“Yes. We’re going to have a charmed life,” Stil decreed, setting Gemma down.\u003c/p\u003e\n\u003cp\u003e“You’re fair pleased with yourself for marrying a seamstress, aren’t you?” Gemma wryly asked.\u003c/p\u003e\n\u003cp\u003e“Only because you’re a genius,” Stil said. “One genius deserves another.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure about that.”\u003c/p\u003e\n\u003cp\u003e“You’ll see. We can play the question game whenever we travel—and wherever we travel.”\u003c/p\u003e\n\u003cp\u003e“Oh, joy,” Gemma said, her voice dead.\u003c/p\u003e\n\u003cp\u003e“I will have a house built for you wherever you want.”\u003c/p\u003e\n\u003cp\u003e“Verglas?”\u003c/p\u003e\n\u003cp\u003e“Depend upon it.”\u003c/p\u003e\n\u003cp\u003e“Then I will make so many cloaks and capes, you may have a different one for each occasion,” Gemma said.\u003c/p\u003e\n\u003cp\u003e“What I would really like is a rug,” Stil said.\u003c/p\u003e\n\u003cp\u003e“It may take me time to learn how to weave.”\u003c/p\u003e\n\u003cp\u003e“I can wait. In the meantime, I will have to hide you away. I told some of the other craftmages at Prince Severin’s summit about you, and now they all want to get their paws on you,” Stil said.\u003c/p\u003e\n\u003cp\u003eGemma smiled at Stil, and Stil smiled at Gemma. They embraced and kissed again, breaking apart and laughing when Hvit circled them, snapping at Stil’s cloak.\u003c/p\u003e\n\u003cp\u003eOn an upper balcony, Queen Linnea seethed as she watched the spectacle below. “I knew that rat wouldn’t take long to show up and spirit her away.”\u003c/p\u003e\n\u003cp\u003e“Darling?” King Toril tried.\u003c/p\u003e\n\u003cp\u003e“He’s even craftier than I am. What a snake,” Queen Linnea said.\u003c/p\u003e\n\u003cp\u003e“Linnea,” King Toril said, placing a hand on Queen Linnea’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Hm?”\u003c/p\u003e\n\u003cp\u003e“She’s happy. Leave her. She has sacrificed plenty; it is her turn now,” the young king said.\u003c/p\u003e\n\u003cp\u003eQueen Linnea studied her new husband. “Your understanding of love is rapidly improving,” she said.\u003c/p\u003e\n\u003cp\u003eKing Toril allowed himself a smile. “A wise lady once said to me that it takes work to build a lasting relationship. You both have done the work. Your relationship will be a lasting one. She will not forget you, Linnea, anymore than you could forget her.”\u003c/p\u003e\n\u003cp\u003eLinnea’s anger withdrew, and she smiled. “You are right. I love Gemma—no matter where she wanders in this land. I love you, and I am so happy…and so blessed.”\u003c/p\u003e\n\u003cp\u003eKing Toril offered his arm. Queen Linnea took it, and the royal couple left the balcony and returned to the celebration while the Craftmage and Seamstress remained in the courtyard, talking, laughing, and loving.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003ePeder the miller was known to be a generally useless man. Even after his daughter became the savior of Verglas, was the best friend to the queen, married a craftmage, and was renown across the continent for her skill with a needle and her ability to make clothes that could take and hold spells and enchantments for ages, Peder still had a reputation as the town drunkard. The only thing that changed was he now occasionally had useful bits of information on the much-esteemed Gemma.\u003c/p\u003e\n\u003cp\u003eOn any given night, one could still find him in the Sno Hauk tavern, in his usual seat at the dilapidated bar. Tonight was no different.\u003c/p\u003e\n\u003cp\u003ePeder marched into the Sno Hauk, bearing a pocket of money and, unusually so, a framed portrait that he carried with rare care.\u003c/p\u003e\n\u003cp\u003e“Alf Skeie, you lying sunk,” Peder declared, setting the portrait on the counter.\u003c/p\u003e\n\u003cp\u003e“What,” Alf said, his weasel face scrunching up with displeasure.\u003c/p\u003e\n\u003cp\u003e“You’ve been spreading rumors about my Gemma and her mage,” Peder said. As he hadn’t yet drunken anything, he could shake a finger at Alf without falling over. \u003c/p\u003e","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-83.html","bookId":1805,"creation":"Oct 5, 2019 4:47:58 PM","modification":"Oct 5, 2019 4:47:58 PM"}
