{"id":82924,"no":84,"title":"Page 84","content":"\u003cp\u003e“Have not,” Alf said.\u003c/p\u003e\n\u003cp\u003e“Best not lie, Alf Skeie,” Otto the barkeep said. “Not two nights ago, I heard you telling an out-of-town guest that craftmage Stil was not quite three feet tall and as ugly as a warped cabbage.”\u003c/p\u003e\n\u003cp\u003e“See? That!” Peder said.\u003c/p\u003e\n\u003cp\u003e“I said nothin’ like that,” Alf squirmed.\u003c/p\u003e\n\u003cp\u003e“The missus said you were telling tales at Sissel’s wedding. You said craftmage Stil lost a bet to the deceased King Torgen—God rest his soul,” Big Tim said, chewing on the stem of his pipe.\u003c/p\u003e\n\u003cp\u003e“No, I didn’t,” Alf said. “All I said is people look up to Gemma and her ‘mage’ husband too much. That’s all. People still sing and chirp praises for them more than our own dear king and queen. It’s a crime,” Alf protested.\u003c/p\u003e\n\u003cp\u003e“I also heard you called Gemma a stupid twit for not telling King Torgen she couldn’t spin flax to gold before the whole thing escalated,” Small Tim said.\u003c/p\u003e\n\u003cp\u003eAt the back of the room, chairs scraped as four palace guards stood. Two of the guards twirled spears, and one unsheathed a sword. The only one that didn’t immediately reach for a weapon strolled up to Alf.\u003c/p\u003e\n\u003cp\u003e“What did you say about Gemma Kielland?” the guard asked, looming above Alf.\u003c/p\u003e\n\u003cp\u003e“N-nothing. I didn’t say nothing,” Alf squeaked.\u003c/p\u003e\n\u003cp\u003e“Alf Skeie,” the guard said, making Alf shrink. “I will remember your weasel face. If I hear you talking badly of our Gemma Kielland again, there will be a reckoning,” he said.\u003c/p\u003e\n\u003cp\u003eAlf swallowed sharply.\u003c/p\u003e\n\u003cp\u003e“You want some help, Foss?” the sword-wielding guard asked.\u003c/p\u003e\n\u003cp\u003e“Nah, this one isn’t worth it,” the unarmed guard said, scowling darkly at Alf before returning to his table.\u003c/p\u003e\n\u003cp\u003e“Well, how do you like that?” Peder happily said, plopping down on his stool and popping a coin onto the counter. “Otto, a pint, if you will!”\u003c/p\u003e\n\u003cp\u003eOtto poured a drink for Peder as Big Tim and Small Tim joined the miller.\u003c/p\u003e\n\u003cp\u003e“Whatcha got there?” Small Tim asked, squinting at the painted portrait.\u003c/p\u003e\n\u003cp\u003e“My son-in-law sent it to me. It’s him and Gemma,” Peder proudly said after taking a swig of his beer. “Isn’t she beautiful?”\u003c/p\u003e\n\u003cp\u003eSmall Tim studied the painting with eagerness—planning to carry the details of it in his mind to relay to his wife.\u003c/p\u003e\n\u003cp\u003eThe portrait was of Gemma and her husband—the famous craftmage Stil—or Rumpelstiltskin. Stil was reclining on mound of pillows, his blue eyes lit with adoration and affection as he looked across the painting at Gemma.\u003c/p\u003e\n\u003cp\u003eGemma was seated on a cushioned settee, a soft smile on her lips, and her hand raised as she appeared to pull a needle through an exquisitely embroidered piece of fabric. She wore a Loire-style dress, which was soft blue in color, didn’t cover either of her shoulders, and had wide sleeves and a tight bodice.\u003c/p\u003e\n\u003cp\u003eGemma’s hair was elaborately braided, although wavy strands had come loose and framed her face. She had gold bracelets and necklaces, and gold barrettes secured her hair.\u003c/p\u003e\n\u003cp\u003eCurled up at her feet was a giant, white, wolf-ish creature. It had a woven collar that was the same color as Gemma’s dress, although it looked out of the portrait with blazing blue eyes.\u003c/p\u003e\n\u003cp\u003eLong ago, before King Torgen died, Small Tim would have been hard-pressed to call Gemma beautiful. But seeing the portrait—the way happiness softened her face and made her glow, and seeing her relaxed, almost liquid posture—Small Tim couldn’t think of a prettier girl in Ostfold.\u003c/p\u003e\n\u003cp\u003e“She is,” Small Tim finally said.\u003c/p\u003e\n\u003cp\u003e“That Gemma Kielland,” Big Tim said, peering over Small Tim’s shoulder. “She’s done well.”\u003c/p\u003e\n\u003cp\u003e“Gemma Kielland has done more than well,” one of the guards said. “She has done great things, and she continues to do so as she aids other countries in their battle against dark magic.”\u003c/p\u003e\n\u003cp\u003e“Aye,” said several other Sno Hauk patrons.\u003c/p\u003e\n\u003cp\u003eOtto raised his own mug. “To Gemma Kielland,” he said.\u003c/p\u003e\n\u003cp\u003e“To Gemma Kielland!”\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-84.html","bookId":1805,"creation":"Oct 5, 2019 4:47:58 PM","modification":"Oct 5, 2019 4:47:58 PM"}
