{"id":98210,"no":52,"title":"Page 52","content":"\u003cp\u003eElbryan and Pony were coming down the northwestern face of the mountainous barrier when dawn broke over the Barbacan. Only then was the size of the dactyl\u0027s gathered army revealed, a swarming black mass that filled the whole valley between the long arms of a lone, smoking mountain, some ten miles or so to the north.\u003c/p\u003e\n\u003cp\u003e\"How many?\" Pony breathed.\u003c/p\u003e\n\u003cp\u003e\"Too many,\" the ranger said helplessly, having no better answer.\u003c/p\u003e\n\u003cp\u003e\"And how are we to get to the mountain?\" Pony asked. \"How many thousands must we defeat even to reach its black rocky base?\"\u003c/p\u003e\n\u003cp\u003eElbryan shook his head determinedly, somehow sure his companion\u0027s assessment was not correct. \"A few sentries perhaps,\" he replied. \"Nothing more.\"\u003c/p\u003e\n\u003cp\u003ePony eyed him skeptically.\u003c/p\u003e\n\u003cp\u003e\"The demon is confident,\" Elbryan explained, \"inviting us in. The dactyl fears no mortal man and no monster, and it has no reason to believe that we would ever dare to move against it in such small numbers, small enough to enter the Barbacan unnoticed.\"\u003c/p\u003e\n\u003cp\u003e\"That has been our hope since the beginning,\" Pony agreed.\u003c/p\u003e\n\u003cp\u003e\"And that is our only hope now,\" Elbryan said, \"a hope to which we must hold fast. If the demon sets its army to block us, then so we shall be blocked, and not my sword, nor Avelyn\u0027s magic, not Bradwarden\u0027s strength, nor your own assortment of weapons, will possibly get us through so many swarming monsters.\u003c/p\u003e\n\u003cp\u003e\"But it will not come to that,\" the ranger went on. \"Even if the demon dactyl thinks that some enemies have come to its home, as the armored giants and that terrible spear might indicate, it remains supremely confident that none in all the world can stand against it.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know this?\"\u003c/p\u003e\n\u003cp\u003eThe simple question seemed to catch Elbryan off his guard. Indeed, how did he know so much about this enemy that he had never seen and had never battled before? In the end, the ranger realized that he did not know, that he was guessing, and hoping. He answered Pony only with a shrug, and that seemed enough. They had come too far to worry about things they couldn\u0027t control, and so they started along once more, quickly picking a path down the side of the mountain. They were both weary after the long night of running, but neither entertained any, thoughts of stopping to rest, not with so many monsters before them -- and perhaps more than a few chasing them.\u003c/p\u003e\n\u003cp\u003eAn hour later, moving across an open expanse of bare rock -- the two friends feeling very exposed indeed! -- Elbryan stopped suddenly and dropped to a crouch. Thinking danger at hand, Pony crouched as well,; and reached her hand into a pocket, fingering her few stones.\u003c/p\u003e\n\u003cp\u003e\"There!\" the ranger said excitedly, pointing down across the valley to his left, toward the western arm of Aida. Beyond that black line of stone, a black dot, a solitary figure, moved steadily across the green\u0027 carpet, making fast for a thick copse of trees.\u003c/p\u003e\n\u003cp\u003eNo, Pony realized, not one figure, but two, a man atop a horse . . . a man atop a centaur!\u003c/p\u003e\n\u003cp\u003e\"Avelyn and Bradwarden!\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"Running hard for Aida,\" Elbryan agreed. He looked back at Pony, his smile wide. \"And with none chasing them, and none standing before them.\"\u003c/p\u003e\n\u003cp\u003ePony nodded grimly. Perhaps her love was right, perhaps the dactyl was indeed inviting them in. She had to wonder, though she said nothing aloud, was that a good thing?\u003c/p\u003e\n\u003cp\u003eThe pair, were off the mountain within the hour, making their way along its base, weaving in and out of boulders and patches of trees. They easily avoided the few bored goblin sentries that were about, and every so often came upon tracks that told them they were following the exact route Avelyn and Bradwarden had taken.\u003c/p\u003e\n\u003cp\u003eFinally they crossed over the mountain\u0027s long arm and were surprised to find the ground very warm under their feet. Only then did the pair realize that this line of stone was not a solid ridge, but rather, like a living thing, was growing and changing. Most of the ridge was hard, but every so often, the pair caught a sudden glimpse of fiery orange, the lava flow bubbling up to the surface, then meandering across the hardened black stone like a crawling orange slug. Within a few minutes, each of these movements would cease, the lava gradually rolling over itself or gathering in a depression, and then quickly cooling, its glow fading to blackness.\u003c/p\u003e\n\u003cp\u003e\"Like a living thing,\" Pony remarked, taking more care where she subsequently stepped.\u003c/p\u003e\n\u003cp\u003e\"Like the dactyl,\" Elbryan replied. \"Flowing out from Aida, encompassing all the world under its blackness.\"\u003c/p\u003e\n\u003cp\u003eIt was not a pleasant thought.\u003c/p\u003e\n\u003cp\u003eThey were several hours behind their friends, Elbryan and Pony realized when they at last came upon the same expanse they had seen their friends traversing. There was no apparent resistance; behind this arm of Aida, this blocking ridge of black stone some twenty to thirty feet high, no monsters moved about and no sentries were visible.\u003c/p\u003e\n\u003cp\u003eThey went into a copse of trees, such a stark contrast of teeming life next to the black wall of stone, and found again the centaur\u0027s tracks. Soon a second set -- the tracks of a heavy human, of Brother Avelyn -- were visible beside those of Bradwarden, and it was not hard for the pair to surmise that the centaur might be getting tired.\u003c/p\u003e\n\u003cp\u003eBut Bradwarden continued on; and so did Avelyn; and so did Pony and Elbryan, increasing their pace in the hope that they might patch up to their friends before they entered the caverns of the mountain. Perhaps, Elbryan pondered, if Avelyn and Bradwarden were scrambling about, looking for some way into the mountain . . .\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t happen that way. The ranger and Pony exited the copse of trees, then crossed through a second and then a third, climbing to the lower reaches of Aida. As soon as they cleared that last copse, they saw an entrance, a great gaping hole, defying the slanting rays of the westering sun. If the appearance proved, true, if this was indeed a way into the heart of Aida, then Avelyn and Bradwarden had long ago gone into the mountain and might even now be standing before the demon dactyl as Elbryan and Pony stood staring at the entrance. The anxious couple went back into the last copse and cut sticks, wrapping them with cloth to make torches.\u003c/p\u003e\n\u003cp\u003eThen, fearful that they would be too late, the pair split, left and right, and moved quickly and stealthily right up to the edge of the cavern entrance. Elbryan peeked around the stone and into the gloom; Pony did likewise from across the way; and they were somewhat relieved to find that this was indeed a deep cavern and that it was apparently empty.\u003c/p\u003e\n\u003cp\u003eJust inside, Elbryan noted the hooflike depression of the centaur\u0027s track.\u003c/p\u003e\n\u003cp\u003eKeeping near the side wall, not daring to light a torch, the pair moved in tentatively, allowing their eyes to adjust to the rapidly diminishing light. All too soon, they were faced with a dilemma: light the torch or walk on in near- complete darkness.\u003c/p\u003e\n\u003cp\u003eElbryan winced as the fire flared to life, as if expecting all the minions of the dactyl to descend upon him. After a few tense but uneventful moments, he motioned to Pony, and the pair crept along, coming to a place where the tunnel forked: one branch going right and level, the other left and down. Looking down the right-hand side, Pony noted that the tunnel forked again just a short way in, and the tunnel continuing to the right beyond that second fork showed yet another side passage.\u003c/p\u003e\n\u003cp\u003e\"A veritable maze,\" Elbryan moaned. He fell to his knees and moved the torch low, searching for some sign of his friends\u0027 passing, but the ground was bare, unmarked stone.\u003c/p\u003e\n\u003cp\u003e\"Straight ahead,\" Pony declared a moment later, seeing her companion\u0027s frustration. \"Deeper -- into the mountain, and then down and to the left at the next fork.\"\u003c/p\u003e\n\u003cp\u003eShe spoke with determination, though it was only a guess -- a guess that seemed as good to Elbryan as any he might make. They moved in deeper, then began a descent along a smooth and angled passageway. Elbryan gave up any thoughts of continuing his scan for tracks, knowing that to do so would only slow their progress. Avelyn and Bradwarden were wandering in here, probably as lost as were Elbryan and Pony. Sooner or later, one of the pairs, or perhaps both, would stumble upon the dactyl or some of its deadly minions.\u003c/p\u003e\n\u003cp\u003eIt was a desperate situation, and both Elbryan and Pony had to remind themselves often that they had known it would be like this from the moment they had set out from Dundalis.\u003c/p\u003e\n\u003cp\u003eBestesbulzibar was outraged, and yet the demon was somewhat amused as well as it stood with Quintall and a pair of very nervous giants, looking down the ruined slope of a mountain. How powerful indeed was the demon-forged spike! To cause such devastation as this, simply because it left the hand of its dying wielder and fell across the stone!\u003c/p\u003e\n\u003cp\u003eOne of the giants continued to stammer on about bad luck and other such nonsense, trying hard to concoct some excuse that might keep its skin attached to its body. Bestesbulzibar wasn\u0027t listening.\u003c/p\u003e\n\u003cp\u003e\"Have they made the mountain?\" the dactyl asked Quintall, indicating Aida.\u003c/p\u003e\n\u003cp\u003eThe rockman scrutinized the terrain ahead and considered the distance. He put a hand to his chin, an oddly human gesture. And indeed, Quintall now seemed physically human. The rough edges of his rocky body had smoothed and rounded, shaping more and more to, the exact human form the spirit had left behind. The rockman was recognizable again as Quintall; the features, the size, and the body dimensions were all the same, as if the man\u0027s spirit were somehow determining the shape of this new stone coil. Of course, his \"skin\" was now obsidian in consistency as well as hue, and red lines of molten stone still striped his joints; his eyes, too, were red pits of liquid stone. But he looked like Quintall, and the rockman could hardly wait until the moment that Brother Avelyn saw his new and superior body.\u003c/p\u003e\n\u003cp\u003e\"Have they?\" Bestesbulzibar prompted.\u003c/p\u003e\n\u003cp\u003eQuintall nodded. \"If they ran on through the night,\" he answered, \"and if no others rose up against them.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps they will be seated upon my throne when I return to it.\" The dactyl sneered, eyeing the pair of giants wickedly.\u003c/p\u003e\n\u003cp\u003e\"B-bad luck,\" one of the behemoths stammered.\u003c/p\u003e\n\u003cp\u003e\"We will --\"the other began to promise, but the dactyl cut it short.\u003c/p\u003e\n\u003cp\u003e\"You will go and take your places with the army,\" Bestesbulzibar instructed. The demon badly wanted to rip the hide from these two, and from any others of the hunting party who had survived their encounter with the intruders and who were now hiding nearby, fearing the demon\u0027s wrath. Or perhaps Bestesbulzibar could take them back to Aida and throw them in the path of the deadly Nightbird. Or, the demon mused, perhaps it would give the job of punishment to Quintall, that Bestesbulzibar might witness the power of its newest weapon. But the dactyl was not a stupid creature and could control its impulses, even those bent upon destruction, which the demon loved above all else. Bestesbulzibar had lost too many of its elite giant guardsmen already, considering the effort he had taken to outfit the giants with armor, but, in truth, the demon figured that it had lost little by the failure of the giants. So Brother Avelyn and the one called Nightbird may have entered Aida; that only meant that Bestesbulzibar might enjoy a bit of the fun of killing them.\u003c/p\u003e\n\u003cp\u003e\"Come along,\" the dactyl instructed Quintall. The rockman moved closer and Bestesbulzibar lifted from the ground, hooking its powerful legs about Quintall, and then speeding the instrument of its wrath across the valley, above the heads of the cowering minions, and back to Aida.\u003c/p\u003e\n\u003cp\u003eQuintall, possessed of heightened senses, whose glowing eyes could light the way along dark tunnels, was sent to find the trail.\u003c/p\u003e\n\u003cp\u003e\"We are too low,\" Avelyn complained, leaning against a wall of the stuffy, tight cavern. He kept the light of his enchanted diamond low, hoping that it would be less conspicuous and not attract any more guards like the two powries Avelyn and Bradwarden had just overwhelmed. That thought in mind, Avelyn kicked aside the bloody leg of one of the dwarves and shifted himself so that he was looking back the way they had come.\u003c/p\u003e\n\u003cp\u003e\"Now wouldn\u0027t the demon thing be at the heart?\" Bradwarden asked casually, tearing at the second powrie as he spoke. \"And wouldn\u0027t a mountain\u0027s heart be below?\"\u003c/p\u003e\n\u003cp\u003eAvelyn shook his head immediately; he just didn\u0027t feel right about the path. They had gone down and to the left at the first fork, too soon perhaps, to be heading into the lower chambers of this tunnel-crossed mountain. \"Our enemy might be higher,\" he said, \"near the smoking cone, where the winged demon might quickly fly out among its minions.\"\u003c/p\u003e\n\u003cp\u003eHe looked back at Bradwarden as he finished his argument, and he was song that he did.\u003c/p\u003e\n\u003cp\u003e\"Bah, \u0027tis a guess and nothing more,\" the centaur replied, taking a huge bite out of a powrie leg.\u003c/p\u003e\n\u003cp\u003eAvelyn closed his eyes.\u003c/p\u003e\n\u003cp\u003e\"We go along, I say,\" the centaur continued, talking through its full mouth, \"choosing trails as we find them. It\u0027s all a guess, yer knowing as well as I\u0027m knowing.\"\u003c/p\u003e\n\u003cp\u003eThe monk sighed and didn\u0027t disagree. Whatever course they chose, Avelyn would second-guess. Too much was, at stake here; the monk was too much on the edge of his nerves.\u003c/p\u003e\n\u003cp\u003e\"Now why\u0027re ye here?\" Bradwarden asked simply. \"Ye\u0027ve come to face yer destiny, so ye said, and so ye shall. We\u0027ll get there, me friend, and if that\u0027s what\u0027s scaring ye, then I\u0027m not for blaming ye. But turning back won\u0027t put us any closer to anything, and every lost step gives more of our enemies the chance to stumble upon us.\" He spat at that last thought and tossed the tough powrie leg to the ground. \"And the damned things aren\u0027t even good eating!\"\u003c/p\u003e\n\u003cp\u003eAvelyn managed a smile and walked by the centaur, taking great care to avoid stepping on the discarded meal. They started off again, side by side, their bulky forms filling the narrow passageway.\u003c/p\u003e\n\u003cp\u003e\"I am not pleased by the sight,\" Elbryan whispered, looking down the long, narrow descent, a ledge bordered on the left by an uneven wall and on the right by a long drop of more than two hundred feet from where the ledge began and only gradually diminishing as the trail moved lower. Height hardly seemed to matter when considering the danger, though, for the drop ended in a pool of red fire, a swirling lake of molten stone. Even from this great height, Elbryan and Pony could feel the intense heat, and the sulfuric stench was nearly overwhelming.\u003c/p\u003e\n\u003cp\u003e\"And I am not pleased at the prospect of backtracking all the way,\" Pony replied. \"Down we decided to go, and down this goes!\"\u003c/p\u003e\n\u003cp\u003e\"The fumes . . .\" the ranger protested, and his fears were not lost on the woman. Pony fumbled in her pack and took out a strip of cloth, an intended bandage. She tore it in half and wetted both strips thoroughly from her waterskin, then tied one about her face after she handed the other to Elbryan.\u003c/p\u003e\n\u003cp\u003eThe ranger, though, had a better idea. He took the green armband from his right arm, the one the elves said would defeat any poison, and tore it in two, handing one strip to Pony. With a trusting nod, the woman donned the mask, as did Elbryan, the ranger eyeing Pony all the while, admiring her gumption. The brave woman was not easily deterred.\u003c/p\u003e\n\u003cp\u003eThey needed no torch in this place, because of the glow of the lava, and so their hands were free as they started down, at first hugging the wall tightly -- the ledge was not narrow, but the prospects of slipping over were far too grim. Gradually, they eased out from the wall, their pace increasing, and soon they had put a couple hundred feet behind them, nearing the halfway point of the descent.\u003c/p\u003e\n\u003cp\u003ePony, holding the lead, grew hopeful when she spotted a dark shadow along the wall far below, a side passage, running into the mountain and away from this place: So intent was she that she never noticed the crack running right across the ledge in front of her.\u003c/p\u003e\n\u003cp\u003eShe stepped over it, and as she brought her weight down, the stone beneath her foot gave way.\u003c/p\u003e\n\u003cp\u003ePony screamed; Elbryan grabbed her and pulled her back to safety, the pair falling to the ledge in a jumble. The ranger scrambled to the very lip and watched the eight-foot stone slab falling. It bounced off a jag in the wall, then spun over and out, tumbling into the magma, where it was swallowed, disappearing with hardly a splash.\u003c/p\u003e\n\u003cp\u003ePony, horrified and breathing deeply, had to slow herself down consciously. She managed it, but the deep breaths had taken their toll, the sulfuric fumes overwhelming her, for in the fall, she had dislodged the elven mask. She rolled to the lip of the ledge, pulled her mask further down, and vomited.\u003c/p\u003e\n\u003cp\u003e\"We must go back,\" Elbryan said, putting a hand on the woman\u0027s shoulder, trying to comfort her.\u003c/p\u003e\n\u003cp\u003e\"Shorter down than up,\" Pony said stubbornly, and she retched again. Then she sat up quickly, determinedly, pulled out her waterskin and washed her face briskly, replacing the mask and standing firm.\u003c/p\u003e\n\u003cp\u003e\"A long jump,\" Elbryan remarked, eyeing the break in the trail.\u003c/p\u003e\n\u003cp\u003e\"An easy leap,\" Pony corrected, and to prove her point, the woman took a single running stride and sprang across the gap, landing easily and skidding down defensively, on the lower level.\u003c/p\u003e\n\u003cp\u003eElbryan stared at her long and hard, admiring again that stubborn determination but honestly wondering if she wasn\u0027t being foolhardy just to prove a point. They had no idea if that passage down below led anywhere, after all, and the eight-foot leap would be decidedly more difficult coming up the angled walkway.\u003c/p\u003e\n\u003cp\u003e\"Easy leap,\" Pony said again. The ranger managed a smile; they were going to face a demon, after all, so how could he berate the woman for what he considered recklessness?\u003c/p\u003e\n\u003cp\u003ePony\u0027s eyes widened, and Elbryan realized that she was about to scream.\u003c/p\u003e\n\u003cp\u003eThe ranger spun, drawing Tempest as he went, but the danger was not behind him, but to the side, coming out of the solid wall. Stones burst outward; Elbryan skipped back up the slope a few scrambling steps and dove to the ground. He turned about, confused, and when he saw the source, he was even more confused.\u003c/p\u003e\n\u003cp\u003eQuintall walked out onto the ledge.\u003c/p\u003e\n\u003cp\u003eElbryan was up in a defensive crouch, Tempest defensively before Up, though he knew not what to make of this moving rockman, this obsidian image of Brother Justice.\u003c/p\u003e\n\u003cp\u003eQuintall\u0027s intentions were easy enough to discern. The rockman looked at Pony, then turned back fully upon Elbryan, red-striped fingers clenching the air menacingly. \"Do you think you can win this time, Nightbird?\" the demon\u0027s lackey asked, his voice grating like stone rubbing stone.\u003c/p\u003e\n\u003cp\u003e\"What are you?\" Elbryan asked breathlessly. \"What manner of being, what tormented soul?\"\u003c/p\u003e\n\u003cp\u003e\"Tormented?\" Quintall scoffed. \"I am free, mortal fool, and shall live forever, while your life is forfeit!\" On came the rockman, stalking straight in.\u003c/p\u003e\n\u003cp\u003eElbryan slashed his sword across, scoring a scraping hit that didn\u0027t even slow Quintall. The ranger jumped back a step, then lunged forward, Tempest squealing as it deflected off Quintall\u0027s face. This hit was more substantial, Elbryan was glad to realize, for the fine elven-forged sword cracked through the rockman\u0027s hard skin, drawing a slight orange line.\u003c/p\u003e\n\u003cp\u003eBut the line cooled to black almost immediately, and if Quintall was hurt, he did not show it. He came on furiously then, and launched a roundhouse left hook.\u003c/p\u003e\n\u003cp\u003eElbryan ducked the blow, just barely, and scampered back as Quintall\u0027s hand thundered against the wall. The ranger glanced at that impact spot and his respect for this enemy heightened, for where Quintall\u0027s hand had struck, the stone was cracked and smoking.\u003c/p\u003e\n\u003cp\u003e\"Will you run away, then, and leave the woman to me?\" the rockman taunted. \"I can get to her, do not doubt.\"\u003c/p\u003e\n\u003cp\u003eThe words made Elbryan glance down at Pony, and he saw, to his horror, that she was readying for a jump back across the gap. \"Stay down!\" the ranger yelled to her. \"I will come to you!\"\u003c/p\u003e\n\u003cp\u003e\"You will never get past me,\" Quintall remarked, accentuating his point by slamming the stone wall again, even harder.\u003c/p\u003e\n\u003cp\u003eThat movement left an opening that the ranger could not resist. He came forward in a rush, Tempest driving in hard and straight, striking hard; cracking through the black shell and diving into the monster\u0027s magma interior.\u003c/p\u003e\n\u003cp\u003eQuintall howled and launched a series of blows, but Elbryan was the quicker, already retracting his glowing sword -- and the ranger was glad to know that the fine weapon had survived the immersion in the obviously hot interior of this wicked foe -- and snapping Tempest up left, up right, up left, in three quick parries, then straight ahead to poke the rockman in the face once again.\u003c/p\u003e\n\u003cp\u003eBut even the great wound in the monster\u0027s belly fast closed, while Quintall\u0027s movements became more cautious, more dangerous.\u003c/p\u003e\n\u003cp\u003eFrom down below, Pony was shouting out, but Elbryan hardly took the time. to consider her words. He had to find some way to hurt this thing, and though his sword might inflict some sting, it seemed that the wound could only be so deep.\u003c/p\u003e\n\u003cp\u003eThe answer seemed obvious, and so the ranger spent no time considering the problems with such a course, plotting out the appropriate attack. He darted ahead again, stabbing hard, then turned as if to run by the monster on its left, on the outside of the ledge.\u003c/p\u003e\n\u003cp\u003ePure instinct dropped Elbryan to one knee, Quintall\u0027s heavy arm swishing above his head -- a blow that would have launched the ranger over the edge! Then Elbryan came up in a reverse spin, turning in front of the rockman, going hard against the wall, and angling to get in between Quintall and the stone.\u003c/p\u003e\n\u003cp\u003eThe monster\u0027s other arm shot out hard, slamming the wall in front of Elbryan, preventing him from running past. He had no intention of such a course, anyway, for he stopped short of the barrier, braced himself against the wall, and shoved back with all his great strength.\u003c/p\u003e\n\u003cp\u003eHe hardly moved; Quintall, so solid, so strong, laughed at him.\u003c/p\u003e\n\u003cp\u003eThen Elbryan felt the press and the heat, intense and burning from those points on the rockman that were not hardened stone. Elbryan punched and twisted, but the press grew ever tighter. He heard Pony scream out, but her voice seemed to come from far away.\u003c/p\u003e\n\u003cp\u003eThen came a sudden rush of air above the slumping ranger, and the rockman cried out, and the grip was lessened.\u003c/p\u003e\n\u003cp\u003eElbryan stumbled back up the slope, wriggling away, and turned to see Quintall clutching at his molten eyes, drops of hot magma glowing on his cheek. A second puzzle faced the ranger when he noticed a cord, thin but strong, strung to his left, along the wall, going past him and past Quintall. A quick tug showed Elbryan that it was tied off a short distance up the ledge.\u003c/p\u003e\n\u003cp\u003eThe ranger had no time to stop and figure it out, for Quintall\u0027s eyes, like his other wounds, quickly healed. On came the Nightbird, having no answers but to attack fiercely and hope his sword would find a weakness. He slashed left, back right, straight ahead, back to the right again, the sword ringing loudly and throwing sparks with each impact upon the rockman.\u003c/p\u003e\n\u003cp\u003eDespite the fact that Tempest offered no real threat, Quintall instinctively reacted, using his solid arms to parry, using the same martial routines he had learned long ago at St.-Mere-Abelle.\u003c/p\u003e\n\u003cp\u003eElbryan pressed on, Tempest hitting so often that the ringing song never paused. He drew crack after crack in the rock man, and entertained the fleeting dope that Quintall would simply split apart.\u003c/p\u003e\n\u003cp\u003e\"Tie it off, there!\" Tuntun instructed, tossing the strong elvish cord to a stunned Pony and pointing to a large, loose boulder, a dozen feet further down the slope. \"And be quick!\" the elf demanded.\u003c/p\u003e\n\u003cp\u003ePony was already running, not really knowing what Tuntun had in mind, but not daring to waste the moment in questioning. Any plan, however desperate, was better than nothing, and nothing was exactly what Pony could figure to do. As the woman began looping the rope, she felt the tension from the other end and, considering that it was on the inside of the rockman, she began to figure things out.\u003c/p\u003e\n\u003cp\u003eTuntun flew away, back up toward the combatants, her slender daggers in hand, both dripping magma from Quintall\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eElbryan was still on the offensive when the elf buzzed in, the ranger\u0027s heavy blows whacking repeatedly against the rockman\u0027s blocking arms or every so often slipping through to smack the monster about the torso or even across the head. He didn\u0027t know how long he could keep it up, though, and understood that if he did no real damage soon, his momentum would be lost, and then it would be Quintall\u0027s turn.\u003c/p\u003e\n\u003cp\u003eBut then, suddenly, the rockman howled again, as Tuntun\u0027s arms came about his head, tiny daggers finding their, way to glowing eyes. Quintall threw his arms up mightily, connecting a glancing blow that sent the elf fluttering way up high, one dagger flying free, spinning down to disappear in the magma.\u003c/p\u003e\n\u003cp\u003eElbryan grabbed up Tempest in both hands and surged ahead, swinging an. over-the-shoulder chop with every ounce of strength he could muster. Quintall\u0027s arm got down to block, and Tempest blasted right through it, severing the limb halfway between wrist and elbow.\u003c/p\u003e\n\u003cp\u003eThe rockman howled again, hot magma pouring from the wound, though it, too, like all the others, hardened fast and cooled to black, leaving a stump below the monster\u0027s red-striped elbow joint.\u003c/p\u003e\n\u003cp\u003eQuintall continued to roar, coming on with sheer outrage. Up above, Tuntun was screaming at the top of her melodic voice, \"Now! Now!\"\u003c/p\u003e\n\u003cp\u003eElbryan had no idea of what the elf could mean, but Pony did. The woman put her back to the roped boulder, squeezed in between it and the wall and braced her feet, then pushed out with all her strength. The strong muscles in Pony\u0027s legs corded taut; she groaned with the great effort, and the boulder slid only a fraction of an inch.\u003c/p\u003e\n\u003cp\u003ePony heard the renewed fighting, the ringing blade, the roaring monster. Strength alone would not dislodge this heavy stone; she had to be smart. She turned her shoulders, shifting the angle a bit upward, and pushed out again. She felt the closest edge of the stone lift from the ledge, knew that she only had to go a bit more to get over that back edge.\u003c/p\u003e\n\u003cp\u003eTuntun dove for the combatants, but veered at the last second as Quintall spun, not surprised this time. The turn cost the rockman another sting as Elbryan seized the moment and thrust ahead, Tempest cutting hard.\u003c/p\u003e\n\u003cp\u003e\"Over the cord!\" Tuntun yelled to the ranger. \"Over the cord.\"\u003c/p\u003e\n\u003cp\u003eThe meaning came clear to Elbryan even as Pony overturned the boulder, the heavy rock rolling off the ledge. The ranger started to leap over the suddenly taut, suddenly moving, cord, but only made it halfway. He dropped Tempest to the ledge and grabbed on for all his life as the boulder plummeted, its fall pulling the elven cord from the wall, swinging it, and Quintall and Elbryan, over the ledge.\u003c/p\u003e\n\u003cp\u003eDown they went, screaming. They came to a sudden, jarring stop as the rope played out to its length, the boulder jolting free of Pony\u0027s knot and spinning down, down, to plop into the magma, where it was swallowed.\u003c/p\u003e\n\u003cp\u003eElbryan held on, and some five feet below him, so did Quintall, the rockman clenching his one impossibly strong hand about the rope so powerfully that his hold was more solid than that of the two-handed man above him.\u003c/p\u003e\n\u003cp\u003e\"Climb!\" Pony cried to her love, and so Elbryan did, driving on with all speed and all strength.\u003c/p\u003e\n\u003cp\u003eFaster still was Quintall, the rockman, heaving mightily, launching himself up a foot or more, then grabbing tight again. Heaving and grabbing, he was closing fast on Elbryan, who had at least twenty feet of scrambling still ahead of him.\u003c/p\u003e\n\u003cp\u003ePony continued to call out encouragement. She ran up and leaped the eight- foot gap, slamming her shin hard against the higher lip, but driving on, running to her love.\u003c/p\u003e\n\u003cp\u003eHand over hand went the ranger; Pony thought he might make it. He threw one arm and shoulder over the ledge and the woman dove to him, tugging hard. But then, Quintall gave a great heave and caught the rope again, barely inches below Elbryan\u0027s feet. One more leap and the ranger would be caught.\u003c/p\u003e\n\u003cp\u003eIn swooped Tuntun. Elbryan saw the desperate move and cried out for the elf to go back. He let go with one hand, trusting in Pony to brace him, and even tried to catch the elf as she swept below him.\u003c/p\u003e\n\u003cp\u003eElven cord was fine and strong, but Tuntun\u0027s dagger, too, was of elvish make, and a quick flick of her wrist snapped the stretched rope right below Elbryan\u0027s feet.\u003c/p\u003e\n\u003cp\u003eElbryan caught the elf\u0027s forearm; Quintall caught her by the foot.\u003c/p\u003e\n\u003cp\u003eThen they hung, twisting and turning, Pony looping the rope about her as a firmer brace and tugging Elbryan\u0027s tunic desperately. The ranger\u0027s hand tightened on poor Tuntun\u0027s forearm, his muscles bulging from the strain, but down below, heavy Quintall\u0027s grip was even stronger.\u003c/p\u003e\n\u003cp\u003e\"Pull!\" Elbryan begged Pony, for though they were working with all their might, the ranger was slipping back over the lip.\u003c/p\u003e\n\u003cp\u003eTuntun, stretched, fearing that she would simply be ripped in half, recognized the dilemma, understanding that her friends could not hoist her and the heavy rockman. Her free hand, holding the dagger, moved upward, and she looked into Elbryan\u0027s shining eyes.\u003c/p\u003e\n\u003cp\u003e\"No,\" the man pleaded, his voice barely a whisper for the lump in his throat. He shook his head.\u003c/p\u003e\n\u003cp\u003eTuntun stabbed him hard in the wrist, and then she and Quintall, were falling fast. The stubborn rockman did not let go, would not let the elf, this wretched creature who had doomed him, use those wings to save herself! Tuntun tried to turn, tried to use her dagger...\u003c/p\u003e\n\u003cp\u003eElbryan and Pony looked away, could not watch the final drop into the molten pool, could not witness the end of Tuntun.\u003c/p\u003e\n\u003cp\u003eThey lay in a heap on the ledge for a long while, until the continuing fumes began to overwhelm them.\u003c/p\u003e\n\u003cp\u003e\"We have to press on,\" the ranger said.\u003c/p\u003e\n\u003cp\u003e\"For Tuntun,\" Pony agreed.\u003c/p\u003e\n\u003cp\u003eThey leaped the gap and hurried along, relieved indeed to find that the side passage at the bottom was no dead end, but long and fairly straight.\u003c/p\u003e\n\u003cp\u003eThey relit the torch and rushed ahead, glad to put the sickening fumes and the terrible sight behind them. Soon after, however, they came to a quick stop, spotting a distant glow far ahead in the tunnel. Elbryan looked helplessly to the torch in his hand; if he could see the glow . . .\u003c/p\u003e\n\u003cp\u003eSuddenly, the light far ahead intensified, and then narrowed, shooting down the corridor, falling over Elbryan and Pony, who had to throw up their arms to shield their eyes.\u003c/p\u003e\n\u003cp\u003eImages of demonic monsters filled their thoughts, images fast shattered by a cry of \"Ho, ho, what!\" from the other end of the beacon. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1/page-52.html","bookId":2167,"creation":"Oct 5, 2019 6:32:39 PM","modification":"Oct 5, 2019 6:32:39 PM"}
