{"id":81984,"no":45,"title":"Page 45","content":"\u003cp\u003e\"Fine,\" Stephen agreed with annoying satisfaction. \"She\u0027ll stay with you.\"\u003c/p\u003e\n\u003cp\u003eHugh Whitticomb removed his wire-rimmed spectacles and began to polish the lenses with his handkerchief. \"I\u0027m afraid that plan isn\u0027t fine with me.\"\u003c/p\u003e\n\u003cp\u003eStephen made a Herculean effort to keep his impatience with the balky physician under control. \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"I mean I cannot allow her to be removed into unfamiliar surroundings among people she does not know.\" When Stephen\u0027s brows snapped together and he opened his mouth to argue, Hugh Whitticomb looked around at the gathering, his tone dire with warning. \"Miss Lancaster believes she is betrothed to Stephen and that he cares deeply for her. He is the one who stayed by her bedside when she was hovering near death, and he is the one she relies upon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll explain to her about the social stigma she risks by remaining here,\" Stephen said briskly. \"She will understand that it simply isn\u0027t appropriate.\"\u003c/p\u003e\n\u003cp\u003e\"She does not have the slightest concept of the importance of appropriate behavior, Stephen,\" Whitticomb contradicted smoothly. \"If she had, she wouldn\u0027t have been standing down here in a lavender peignoir the night I came by to visit her.\"\u003c/p\u003e\n\u003cp\u003e\"Stephen!\" his mother exclaimed.\u003c/p\u003e\n\u003cp\u003e\"She was fully covered,\" he said with a dismissive shrug. \"And it was all she had to wear.\"\u003c/p\u003e\n\u003cp\u003eNicki DuVille joined the debate. \"She cannot stay here unchaperoned. I won\u0027t permit it.\"\u003c/p\u003e\n\u003cp\u003e\"You have nothing to say about it,\" Stephen countered.\u003c/p\u003e\n\u003cp\u003e\"I think I do. I will not have the character of my future wife besmirched. I, too, have a family who must accept her.\"\u003c/p\u003e\n\u003cp\u003eLeaning back in his chair, Stephen steepled his hands and regarded him with unconcealed dislike for several moments before he remarked in a voice as cold as his gaze, \"I do not recall hearing you actually offer for her, DuVille.\"\u003c/p\u003e\n\u003cp\u003eNicki lifted a challenging brow. \"Would you like to hear me do so now?\"\u003c/p\u003e\n\u003cp\u003e\"I told you that I want her to have a choice of suitors,\" he said in an ominous voice. Stephen wondered how his brother could countenance such an arrogant bastard within a mile of his wife. \"At this time, you are nothing but a possible contender for her hand. If you wish to retain that status for another sixty seconds, I suggest—\"\u003c/p\u003e\n\u003cp\u003e\"I could stay here with Miss Lancaster,\" the dowager interjected desperately.\u003c/p\u003e\n\u003cp\u003eThe two men reluctantly ended their visual duel and looked to Hugh Whitticomb for a decision. Instead of immediately replying, Hugh began polishing his other lens while he considered the dampening effect the dowager\u0027s presence was likely to have on a budding romance. A regal, imposing woman even late in her fifth decade, she was much too keen to permit the sort of cozy atmosphere Hugh wanted to see preserved between Stephen and Sherry Lancaster. Moreover, she would be bound to intimidate Sherry, no matter how she tried to do the opposite. Rapidly considering the most persuasive argument against her solution, he said, \"In the interest of your own health, Your Grace, I do not think you ought to tax yourself with the responsibilities of a constant chaperone. I would not want to see a recurrence of last year\u0027s problem.\"\u003c/p\u003e\n\u003cp\u003e\"But you said it wasn\u0027t serious, Hugh,\" she protested.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to keep it that way.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right, Mother.\" Feeling that he\u0027d already overburdened his family with his own problems, Stephen seconded the motion and added, \"We need to find someone who can stay with her at all times, a chaperone of unimpeachable character and reputation who could also serve as a ladies\u0027 companion.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s Lucinda Throckmorton-Jones,\" the dowager duchess said after a moment\u0027s thought. \"No one would dare to question the acceptability and character of any young lady in her charge.\"\u003c/p\u003e\n\u003cp\u003e\"Good God, no!\" Hugh exclaimed, so forcefully that everyone gaped at him. \"That hatchet-faced dragon may be the duenna of choice among some of our best families, but she\u0027d drive Miss Lancaster back to her sickbed! The woman actually refused to budge from my elbow when I put salve on a burned thumb belonging to one of her charges. Acted like she suspected I might want to seduce the silly chit.\"\u003c/p\u003e\n\u003cp\u003e\"Well, then who do you suggest?\" Stephen snapped, losing all patience with the balky, unhelpful physician.\u003c/p\u003e\n\u003cp\u003e\"Leave that matter to me,\" Hugh amazed him by saying. \"I may know just the lady, if her health is adequate to the task. She\u0027s quite lonely, and feeling rather useless these days.\"\u003c/p\u003e\n\u003cp\u003eThe dowager duchess regarded him with interest. \"Whom do you mean?\"\u003c/p\u003e\n\u003cp\u003eRather than risk having the astute lady immediately veto his choice, Hugh decided to take matters into his own hands and then present them with a fait accompli. \"Let me give it further thought, before I narrow the choice down to one. I may bring her by tomorrow. Another night under Stephen\u0027s roof cannot do Sherry any more harm than has already been done.\"\u003c/p\u003e\n\u003cp\u003eThey broke off as Colfax knocked on the door and said that Miss Lancaster was just returning in the carriage.\u003c/p\u003e\n\u003cp\u003e\"I think that covers everything.\" Stephen stood up, concluding the meeting.\u003c/p\u003e\n\u003cp\u003e\"Everything, but two small details,\" Clayton pointed out. \"How do you intend to gain your fiancé\u0027s cooperation in your scheme to find her another husband without crushing her or humiliating her? And what do you intend to do when she tells someone she is betrothed to you? They\u0027ll laugh her out of London.\"\u003c/p\u003e\n\u003cp\u003eStephen opened his mouth to point out yet again that he was not her fiancé, and then gave up. \"I\u0027ll handle that tonight or tomorrow,\" he said instead.\u003c/p\u003e\n\u003cp\u003e\"Be tactful,\" Hugh warned. \"Do not upset her.\"\u003c/p\u003e\n\u003cp\u003eWhitney stood up, pulling on her gloves. \"I think I\u0027d better pay a personal call on Madame LaSalle at once. Persuading her to drop everything and go to work on a complete wardrobe now, when the Season is about to go into full swing, will require a miracle.\"\u003c/p\u003e\n\u003cp\u003e\"It will require a great deal of Stephen\u0027s gold, not a miracle,\" her husband said with a chuckle. \"I\u0027ll drop you at LaSalle\u0027s shop on my way to White\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"White\u0027s is in the opposite direction, Claymore,\" Nicki pointed out. \"If you would allow me to escort your wife to the modiste, perhaps along the way she could suggest the best way for me to gain Miss Lancaster\u0027s confidence.\"\u003c/p\u003e\n\u003cp\u003eWith no feasible reason to object, Clayton nodded curtly, and DuVille offered his arm to Whitney, who paused to press a kiss on Clayton\u0027s cheek. As the foursome departed, both brothers watched DuVille\u0027s retreating back with matching scowls.\u003c/p\u003e\n\u003cp\u003e\"How often,\" Stephen asked cynically, \"have you wanted to knock DuVille\u0027s teeth down his throat?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-45.html","bookId":1803,"creation":"Oct 5, 2019 4:39:38 PM","modification":"Oct 5, 2019 4:39:38 PM"}
