{"id":82025,"no":87,"title":"Page 87","content":"\u003cp\u003e\"I see,\" Sheridan said gravely, and she did see. She empathized as well. She was thinking of something to say when Lady Skeffington threw open the door, looking wild-eyed.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t think what we have that is suitable to wear in such illustrious company. Miss Bromleigh, you came recommended by a duke\u0027s sister, could you possibly advise us? We shall have to go to Bond Street straightaway. Julianna, straighten your shoulders. Gentlemen do not like a female who slouches. What shall we do, Miss Bromleigh? There are coaches to hire, and we shall have to go with a full retinue of servants, including you, of course.\"\u003c/p\u003e\n\u003cp\u003eSherry let that summation of her status pass without flinching. It was the truth, especially in this household. That was what she was, and she was fortunate to have the position. \"I am not an expert on how the Quality dresses,\" she said carefully, \"but I shall be happy to lend you an opinion, ma\u0027am. Where is the party taking place?\"\u003c/p\u003e\n\u003cp\u003eLady Skeffington straightened her shoulders and puffed out her ample chest, reminding Sheridan of a herald announcing the arrival of the king and queen: \"At the country seat of the Duke and Duchess of Claymore!\"\u003c/p\u003e\n\u003cp\u003eSherry felt the room tip, then right itself. Her ears were deceiving her, of course.\u003c/p\u003e\n\u003cp\u003e\"The Duke and Duchess of Claymore have invited all of us to an intimate gathering at their home!\"\u003c/p\u003e\n\u003cp\u003eSherry groped behind her for the bedpost, gripping it and staring at the other woman. Based on what she\u0027d seen firsthand of the ton\u0027s social ladder, the Westmorelands occupied the very pinnacle of it, while the Skeffingtons were on the bottom rung, completely beneath the Westmoreland family\u0027s notice. Even if it weren\u0027t for the ludicrous differences in wealth and prestige between the two families, there was the matter of good breeding. The Westmorelands had it and so did everyone they knew. Sir John and Lady Glenda Skeffington had none. This was impossible, Sherry thought. She was dreaming one of her daydreams, and it had turned into a nightmare.\u003c/p\u003e\n\u003cp\u003e\"Miss Bromleigh, you are losing your color, and I must caution you that there simply isn\u0027t time for you to have vapors over this. If I haven\u0027t time for a nice swoon,\" she added with a robust smile, \"then neither do you, my good girl.\"\u003c/p\u003e\n\u003cp\u003eSherry swallowed and swallowed again, trying to find her voice. \"Are you—\" she rasped, \"are you acquainted with them, with the duke and duchess, I mean?\"\u003c/p\u003e\n\u003cp\u003eLady Skeffington issued a warning before she confided the truth: \"I trust you would not betray a confidence, and risk losing your position with us?\"\u003c/p\u003e\n\u003cp\u003eSherry swallowed again and shook her head, which Lady Skeffington correctly interpreted was Sherry\u0027s promise of confidentiality. \"Sir John and I have never met them in our lives.\"\u003c/p\u003e\n\u003cp\u003e\"Then how, that is, why—?\"\u003c/p\u003e\n\u003cp\u003e\"I have very good reason to believe,\" Lady Skeffington confided, proudly, \"that Julianna has caught the eye of the most eligible bachelor in all England! This party is merely a ploy, in my opinion—a clever method devised by the Earl of Langford—to bring Julianna into his own circle so that he may look her over at his leisure.\"\u003c/p\u003e\n\u003cp\u003eSheridan was beginning to see bright flashes of vivid color at the edges of her eyes.\u003c/p\u003e\n\u003cp\u003e\"Miss Bromleigh?\"\u003c/p\u003e\n\u003cp\u003eSheridan blinked, warily surveying the woman who had obviously devised this entire Banbury tale as some form of diabolical torture designed to break down Sheridan\u0027s carefully constructed foundation for sanity.\u003c/p\u003e\n\u003cp\u003e\"Miss Bromleigh, THIS WILL NOT DO!\"\u003c/p\u003e\n\u003cp\u003e\"Mama, give me your smelling salts quickly,\" Julianna said, her voice coming from farther and farther away, as if Sheridan were hurtling down a tunnel.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m quite all right,\" Sheridan managed, turning her head away from the odious salts that Lady Skeffington was determined to wave under her nose. \"I was just a little… dizzy.\"\u003c/p\u003e\n\u003cp\u003e\"Thank heavens! We are all depending upon you to provide us with any information on how the inner circles of the ton go about.\"\u003c/p\u003e\n\u003cp\u003eSheridan gave a laugh that was part hilarity and part hysteria. \"How would I know?\"\u003c/p\u003e\n\u003cp\u003e\"Because Miss Charity Thornton wrote your reference letter and said very specifically that you were a woman of rare gentility who would set an example of the highest social standards for any child entrusted to your care. She did write that letter, did she not? The one you showed to us?\"\u003c/p\u003e\n\u003cp\u003eSherry had her own suspicion that Nicholas DuVille had dictated it and somehow gotten Miss Charity to sign it without reading it, since the recommendation of a bachelor, who also happened to be a notorious rake, was hardly the thing to gain a young woman respectable employment. Either that or he\u0027d not only written it but signed both their names to it. \"Have I given you any reason to doubt the truth of those words, ma\u0027am?\" Sherry evaded.\u003c/p\u003e\n\u003cp\u003e\"Certainly not. You\u0027re a good sort of girl, despite the wild color of your hair, Miss Bromleigh, and I hope you will not let us down.\"\u003c/p\u003e\n\u003cp\u003e\"I will try not to,\" Sheridan said, amazed that she was able to speak at all.\u003c/p\u003e\n\u003cp\u003e\"Then I give you leave to lie down and rest for a few minutes. It is rather stuffy up here.\"\u003c/p\u003e\n\u003cp\u003eSherry plopped down on the bed like a limp, obedient child, her heart beginning to thud in fast, furious beats. An instant after she\u0027d closed the door, Lady Skeffington poked her head back into the room. \"I shall want the boys to show up to their very best advantage too while we are there. Even when my daughter becomes Julianna, Countess of Langford, we will still have their futures to consider, you know. Do practice them with their singing. It is very appealing the way you have taught the children to accompany you on that tired old instrument you suggested we purchase, that—\"\u003c/p\u003e\n\u003cp\u003e\"Guitar,\" Sherry provided lamely.\u003c/p\u003e\n\u003cp\u003eWhen she left, Sherry looked at her lap. Not for one minute did she believe that nonsensical notion of Lady Skeffington\u0027s that Stephen Westmoreland had glimpsed Julianna in the park and gone to all this trouble to bring her to him. Julianna was undeniably appealing to look at, but her special qualities only became apparent in conversation, which Stephen had not had with her yet. Furthermore, according to the gossip she\u0027d heard the one time she\u0027d visited Almack\u0027s, he had women at his beck and call wherever he turned, ready to make complete cakes of themselves over him. He did not need to bother with an elaborate ploy like a house party.\u003c/p\u003e\n\u003cp\u003eNo, that wasn\u0027t why the Skeffington family—and their governess—was being summoned to Claymore for a command appearance. The invitation had nothing to do with them at all, Sheridan thought as a hysterical laugh that was part dread and part helplessness welled up in her. The truth was that the Westmorelands—and probably a large group of their friends who\u0027d also be at Claymore—had devised the most exquisite vengeance in the world to punish Sheridan Bromleigh for what they thought was her deceitful misuse of them: they were going to force her to return to their society, only not as an equal this time, but as the glorified servant she really was. \u003c/p\u003e","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-87.html","bookId":1803,"creation":"Oct 5, 2019 4:39:38 PM","modification":"Oct 5, 2019 4:39:38 PM"}
