{"id":74686,"no":27,"title":"Page 27","content":"\u003cp\u003eRUSH\u003c/p\u003e\n\u003cp\u003eWe stayed for five more days and let Blaire get to know her brother. Captain was a lot easier to tolerate once I realized he wasn’t checking Blaire out in a sexual way. He was just curious about his sister. I understood that. But I was also glad to pack up and go home. It was only three weeks until Christmas and I wanted to spend that in Rosemary with Blaire. In our home. I also wanted to pin my last name on her and beat on my chest like a fucking crazy man.\u003c/p\u003e\n\u003cp\u003eBlaire had gone straight to bed when we got back to Rosemary. She smiled happily when we walked inside then looked at me and told me unless I just wanted to snuggle to leave her alone while she went to take a nap.\u003c/p\u003e\n\u003cp\u003eI was pretty sure I wouldn’t be able to just snuggle so I stayed downstairs and enjoyed being home. I got a soda from the fridge and headed out to sit on the deck and enjoy the gulf. I’d missed it. I hadn’t even gotten comfortable when I heard the door behind me open.\u003c/p\u003e\n\u003cp\u003eGrant walked out and nodded at me before taking the seat beside me. We hadn’t spoken since the day before Thanksgiving when I’d called him about Nan. I had been busy and I was sure he was dodging me. Apparently, the Rosemary radar was working because we hadn’t been back for thirty minutes and he was already at my house. I hadn’t even realized Grant was in town. Normally he spent his winters skiing. Last I’d heard he was headed to Vail.\u003c/p\u003e\n\u003cp\u003e“How is she?” were the first words out of his mouth.\u003c/p\u003e\n\u003cp\u003eHe wasn’t asking about Blaire. I knew from the sad tone in his voice that this was about Nan. “Fucked the hell up. You know that.”\u003c/p\u003e\n\u003cp\u003eGrant let out a sigh and crossed his legs at the ankles. “Yeah, I know. But I called her last night because I was drunk and weak and being stupid as shit. Your mother answered. She said Nan was getting help.”\u003c/p\u003e\n\u003cp\u003e“She tried to overdose. I found her and got her to the hospital in time. She was okay physically but mentally she has snapped. Kiro is a shit for a dad and Harlow knows that but Nan will never accept it the way Harlow has.”\u003c/p\u003e\n\u003cp\u003e“Who’s Harlow?” Grant asked and I realized that there were parts of my life that even Grant didn’t know. I had kept my life in Rosemary separate from my life with my dad.\u003c/p\u003e\n\u003cp\u003e“Kiro’s other daughter. The one he did take care of. Well, he at least left her with a grandmother who loved her far away from his fucked up world. Harlow was his shiny toy he went and got every once in awhile and then sent back to her grandmother when being a Dad got in his way. It worked for him because Harlow is quiet, polite, and stays out of the way. Nan is none of those things. So, he has no use for her.”\u003c/p\u003e\n\u003cp\u003eGrant let out a deep sigh. “Damn.”\u003c/p\u003e\n\u003cp\u003eDamn wasn’t even scratching the surface.\u003c/p\u003e\n\u003cp\u003eWe sat in silence for awhile and stared out at the water. I wasn’t sure how deep he was in with Nan but I hoped he could walk away. She wasn’t stable. She never would be. Not enough to make Grant happy.\u003c/p\u003e\n\u003cp\u003e“You gonna get married anytime soon?” Grant finally asked.\u003c/p\u003e\n\u003cp\u003eSmiling, I thought about Blaire curled up in my bed upstairs... our bed. “Yeah. When she wakes up from her nap I’m letting her know that she has a week to plan it. I can’t wait any longer. I’ve waited long enough.”\u003c/p\u003e\n\u003cp\u003eGrant chuckled. “I’m the best man, right?”\u003c/p\u003e\n\u003cp\u003e“Of course. I’m afraid you’ll be stuck with Bethy as a partner though so get ready for Jace to be breathing down your neck like a crazy motherfucker. I have no doubt that Bethy will be her maid of honor. The other option will be Jimmy and I doubt you want him groping your ass.”\u003c/p\u003e\n\u003cp\u003e“I can deal with Bethy and Jace,” Grant replied in an amused tone. “But is Jimmy really going to be a bridesmaid?”\u003c/p\u003e\n\u003cp\u003eI grinned and nodded. “Yep. She asked him when we first started planning this wedding.”\u003c/p\u003e\n\u003cp\u003eI had left plane tickets with both Abe and Captain before we left. Blaire wanted her father here and after watching her and Captain get to know each other I knew she’d want her brother too. They had both agreed to come up for it in a week. Blaire didn’t know about it yet though. I hadn’t been in the mood to argue with her in case she had a reason to put it off.\u003c/p\u003e\n\u003cp\u003e“Nan coming to the wedding?” Grant asked.\u003c/p\u003e\n\u003cp\u003eI’d never imagined I’d get married without my mom and sister being in attendance. However, I wanted nothing to spoil our wedding memories for Blaire and I knew that they would somehow manage to do just that. I wouldn’t allow it.\u003c/p\u003e\n\u003cp\u003e“No. I can’t have her here. She still hates Blaire,” I replied.\u003c/p\u003e\n\u003cp\u003eGrant nodded and his shoulders relaxed. He hadn’t wanted to see her. That much was obvious. I couldn’t blame him.\u003c/p\u003e\n\u003cp\u003e“You know dumbass Woods is gonna marry that chick from New York his parents want him to. He isn’t engaged yet but he will be soon. He admitted to me over tequila the other night that if he wanted the club then he had to marry her. His dad’s forcing his hand. He’s gonna be miserable with that uptight woman.”\u003c/p\u003e\n\u003cp\u003eI hated that for Woods. I knew what it felt like to anticipate your wedding and the rest of your life with the woman you loved. Everyone should know that feeling. Going into it with regret and bitterness wasn’t the way to get married.\u003c/p\u003e\n\u003cp\u003e“His choice, I guess. He could always say no.”\u003c/p\u003e\n\u003cp\u003e“And run off like Tripp? That ain’t a great plan either,” Grant replied.\u003c/p\u003e\n\u003cp\u003eTripp had been a few years older than us. He was Jace’s cousin and we’d all looked up to him. Then his parents pressured him to lead the life they wanted and he bolted. Left his millions behind and fucking ran. He became immortalized in our eyes as teenagers because he had the balls to say fuck off and leave. Now we were older we understood more about the sacrifice he’d made. I just hoped he was happy.\u003c/p\u003e\n\u003cp\u003e“Better choice than marrying a spoiled bitch,” I said.\u003c/p\u003e\n\u003cp\u003e“True,” he paused and reached for my soda to take a drink. The dickhead knew I wouldn’t drink after him now. “How’s your dad?”\u003c/p\u003e\n\u003cp\u003e“Same. Drinks and smokes too much. Has sex with random women my age. You know the drill.”\u003c/p\u003e\n\u003cp\u003eGrant smiled. “Yeah. But what a life.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t a life at all but I knew Grant wouldn’t agree with me so I let it go. He hadn’t found someone like Blaire so he didn’t have a clue just how shallow my dad’s life really was. He had to be lonely.\u003c/p\u003e\n\u003cp\u003e“Everyone knows y’all are back in town. You up for company tonight?”\u003c/p\u003e\n\u003cp\u003eNo. I wanted Blaire all to myself. We’d been sharing a boat with her dad for five days too long. “Not tonight. Blaire needs her rest.”\u003c/p\u003e\n\u003cp\u003e“Or you just need Blaire. Be honest, bro.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I need Blaire,” I replied with a smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/forever-too-far-too-far-3/page-27.html","bookId":1995,"creation":"Oct 5, 2019 10:32:37 AM","modification":"Oct 5, 2019 10:32:37 AM"}
