{"id":85855,"no":3,"title":"Page 3","content":"\u003cp\u003eCould Nimrod know Avi? That would be so cool and easy if the first guy I meet on the base knows where Avi is. \"Is his name Avi Gefen? Because I know he\u0027s stationed on this base for a few weeks this summer--\"\u003c/p\u003e\n\u003cp\u003eNimrod stops and his eyes bug out. \"You\u0027re Gefen\u0027s girlfriend?\"\u003c/p\u003e\n\u003cp\u003eI smile wide. I can\u0027t help it. \"Yep.\"\u003c/p\u003e\n\u003cp\u003eI think I notice the corners of his mouth twitch, but I\u0027m not sure. \"Does Gefen know you\u0027re here?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I say sheepishly. \"It\u0027s kind of a surprise.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, he will definitely be surprised.\" We all follow Nimrod to what I assume is the barracks (aka bittern). I spot them now. The barracks are off-white cement buildings (similar to every building on base), but they\u0027re one story and have only two small windows on each side.\u003c/p\u003e\n\u003cp\u003e\"Amy! Jessica! Miranda!\"\u003c/p\u003e\n\u003cp\u003eI wince at the sound of Ronit\u0027s voice. The four of us reach our very annoyed leader. She\u0027s standing next to a guy who resembles a Russian boxer I once saw in an old Rocky movie... or a WWE wrestler. He\u0027s over six feet tall with blond hair and blue eyes. And his arms are crossed on his chest, making his huge muscles bunch up. Avis muscles are huge, but this guy must weightlifter small cars to get his arms that bulky.\u003c/p\u003e\n\u003cp\u003eI point to the luggage in Nimrod\u0027s hand. \"Sorry we lagged behind. One of my suitcases broke.\"\u003c/p\u003e\n\u003cp\u003eNimrod sets my luggage down and salutes to the big, blond wrestler.\u003c/p\u003e\n\u003cp\u003e\"Girls, this is Sergeant Ben-Shimon,\" Ronit says, introducing us to the big dude. \"He\u0027ll be your unit commander.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, cool,\" I say. \"Can we just call you Sergeant Ben?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he says in a stern voice. \"The rest of your unit is already having lunch.\"\u003c/p\u003e\n\u003cp\u003eGreat, they all left without us. \"Well, I guess if you point us in the direction of the mess hall or whatever you call the place where we eat, that\u0027ll be great.\"\u003c/p\u003e\n\u003cp\u003eRonit points to the open doorway. \"Put your suitcases in the bittan, then follow me to the cheder ochel, where soldiers eat. There isn\u0027t much time left before your next activity.\"\u003c/p\u003e\n\u003cp\u003eThe inside of the place we\u0027ll be sleeping for the next three weeks isn\u0027t pretty. Bunk beds are lined up in neat rows (just in case you were wondering, the bunks are made out of metal, not wood) and the mattresses don\u0027t resemble anything like featherbeds. The place is not air conditioned, and the windows are open. Unfortunately, the door to the room is open to the outside, too, so a few bees are flying around.\u003c/p\u003e\n\u003cp\u003eDo the Sababa tour people know that sleeping with bees is so not sababa?\u003c/p\u003e\n\u003cp\u003eJessica and I eye each other. We don\u0027t even have to talk, because we\u0027ve been best friends long enough to know what the other is thinking.\u003c/p\u003e\n\u003cp\u003eMiranda says, \"This isn\u0027t so bad.\"\u003c/p\u003e\n\u003cp\u003eJessica and I don\u0027t answer.\u003c/p\u003e\n\u003cp\u003eWe all set our suitcases inside the barracks, then follow Ronit.\u003c/p\u003e\n\u003cp\u003e\"Where are the bathrooms?\" I ask. \"I had an entire Diet Coke on the bus and I\u0027ve got to pee.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too,\" Jessica says.\u003c/p\u003e\n\u003cp\u003eMiranda admits she\u0027s been holding it for the past two hours, so Ronit leads us to a small structure. It\u0027s bigger than a port-a-potty but smaller than the girls\u0027 bathroom at Chicago Academy, where I go to school.\u003c/p\u003e\n\u003cp\u003e\"Here. But you better hurry, girls.\"\u003c/p\u003e\n\u003cp\u003eWe file inside the bathroom. The stench of pee/poo/ bacterial disinfectant creeps up my nostrils immediately.\u003c/p\u003e\n\u003cp\u003eJess takes her designer sunglasses off her nose slowly. \"This place stinks so bad my eyes are starting to water.\"\u003c/p\u003e\n\u003cp\u003eI plug my nose. \"Seriously, Mutt\u0027s farts aren\u0027t this bad.\" (Mutt is my crazy dog, and yes, he is a mutt.)\u003c/p\u003e\n\u003cp\u003eI hurry to pull back a curtain, which I assume is the equivalent to a bathroom stall back home. When I peek at what\u0027s behind the curtain, I can\u0027t believe my eyes.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a hole. In the ground.\u003c/p\u003e\n\u003cp\u003eOkay, so that\u0027s not entirely the right way to describe it.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a hole in the ground with two rubber non-skid mats in the shape of feet on either side of it... I guess for dumb people who have no clue where to place their feet.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t pee in that,\" I say, but saying the word \u0027pee\u0027 makes my urge to do it that much stronger.\u003c/p\u003e\n\u003cp\u003eJess whines. \"Do you think I can hold it in for two weeks?\"\u003c/p\u003e\n\u003cp\u003eI look back at Ronit. \"Do you have any bathrooms with toilets?\"\u003c/p\u003e\n\u003cp\u003e\"This is a bathroom. And that\u0027s a toilet.\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s a hole.\"\u003c/p\u003e\n\u003cp\u003eRonit was previously cheery, but I think we\u0027ve cracked her and now she\u0027s bordering on annoyed. She steps forward. \"This isn\u0027t a hotel or spa, ladies. It\u0027s the IDF. Now either pee or not, I don\u0027t care. But you have three minutes to do your business and head to the cheder ochel to eat, or you\u0027ll be finding yourselves assigned to bathroom cleaning duties.\"\u003c/p\u003e\n\u003cp\u003eWith that, Ronit leaves the three of us alone.\u003c/p\u003e\n\u003cp\u003e\"I hate her,\" Jess says.\u003c/p\u003e\n\u003cp\u003eMiranda\u0027s mouth starts to quiver. I\u0027m not sure if it\u0027s because she\u0027s late for lunch or because she doesn\u0027t know how to pee in a hole.\u003c/p\u003e\n\u003cp\u003e\"My bladder is about to burst,\" I say, pushing past Jessica and closing the curtain shut.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go in the one next to you,\" Jess says.\u003c/p\u003e\n\u003cp\u003eI notice the graffiti on the side wall. In pen, someone etched words in English. It says: Beware of the Loof!\u003c/p\u003e\n\u003cp\u003eWhat or who is the Loof ?\u003c/p\u003e\n\u003cp\u003eI don\u0027t have time to think about the Loof too hard. I put my feet on the rubber pads and pull down my shorts. But when I try and squat, they\u0027re in the way.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t squat for this long,\" Jess says. \"My thigh muscles are starting to quiver.\"\u003c/p\u003e\n\u003cp\u003e\"I think I just peed on my leg,\" Miranda informs us. Eww!\u003c/p\u003e\n\u003cp\u003e\"When I\u0027m finally in position, I can\u0027t relax because I\u0027m listening to my two friends complain. \"Shut up, guys. My pee is getting stage fright from listening to you both yapping.\"\u003c/p\u003e\n\u003cp\u003e\"Thirty seconds!\" Ronit yells from outside.\u003c/p\u003e\n\u003cp\u003eYeah, as if pressure is going to help me relax.\u003c/p\u003e\n\u003cp\u003eI hear Miranda wash her hands and head outside. Then I hear Jess washing her hands by the sink. \"Hurry up, Amy,\" she whispers loudly. \"I don\u0027t want to do doo-doo duty.\"\u003c/p\u003e\n\u003cp\u003eI look down at the hole, to see if I am aiming in the right spot. \"Oh, shit!\" I yell. \"My sunglasses fell in the hole!\" I forgot they were on top of my head!\u003c/p\u003e\n\u003cp\u003e\"If you stick your hand down there to get them, I cannot be best friends with you anymore. Just leave them!\" Jess calls out. \"And hurry up!\"\u003c/p\u003e\n\u003cp\u003e\"Those cost me $235.\"\u003c/p\u003e\n\u003cp\u003e\"Now they\u0027re worth nothing. Come on!\"\u003c/p\u003e\n\u003cp\u003eFor a nanosecond I contemplate fishing them out of the crap (literally) below, but... I just can\u0027t. I think if I did I\u0027d require more therapy than I already need.\u003c/p\u003e\n\u003cp\u003eWiping myself (with brown toilet paper resembling brown paper towels they have in the art room at school-- which I now know is very scratchy and irritating on sensitive body parts) and putting my undies and shorts back on, I pray that I see Avi soon. Because this army experience is not me, and while I knew that the experience would be challenging, I also knew that seeing Avi for even a little bit would be worth it.\u003c/p\u003e\n\u003cp\u003eNow if I could just find my boyfriend...\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eThere are some things God never intended girls to do -- squatting when peeing is definitely high up on that list.\u003c/p\u003e\n\u003cp\u003eLunch was in a hot and sweaty coed building. \"Well, to be specific, I was hot and sweaty... the room was just hot. I caught a glimpse of Nathan, who seemed to be entertaining his table because everyone was focused on him. The meal consisted of overcooked chicken (considering I only eat white meat and came to lunch late, I was stuck eating legs and thighs), yellow rice, and a pea/mushroom concoction. Drinks were a choice of room-temperature tap water or room-temperature tap water (you guessed it, there wasn\u0027t a choice at all). And I\u0027m not sure Israelis know what ice is, because every time I asked for it they got a confused look on their face.\u003c/p\u003e\n\u003cp\u003eOh, yeah. They had hot coffee and hot tea as drink alternatives, but I don\u0027t drink those and anyway who in their right mind would want a hot beverage when it feels like it\u0027s a hundred degrees outside? There wasn\u0027t even a Coke machine.\u003c/p\u003e\n\u003cp\u003eAt the end of our hurried meal, we all place our garbage in cans and the plates/silverware in plastic bins, and are instructed to line up outside in neat rows.\u003c/p\u003e\n\u003cp\u003eSomeone taps me on the shoulder. I turn around, hoping against all hope that it\u0027s Avi, but it\u0027s not. \"Oh, it\u0027s you.\u003c/p\u003e\n\u003cp\u003eNathan puts his arm around me. \"Oh, come on. Admit that you missed me.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve only been apart for a little more than an hour, Nathan. Give me time to miss you.\" I shrug his arm off me. \"I see you\u0027ve made friends already.\"\u003c/p\u003e\n\u003cp\u003e\"The guys in my unit are cool, but I\u0027d rather bunk with you girls,\" he says as we line up with the others like good little soldiers. For over twenty minutes we\u0027re taught how to get in formation. Five rows of eight people each, an arm\u0027s length apart. \"At ease\" is hands behind your back with your legs spread shoulder width apart. \"Attention\" is saluting with your feet together.\u003c/p\u003e\n\u003cp\u003eRonit is standing in front of the entire group, with Sergeant \"Don\u0027t-Call-Me-Ben\"-Shimon next to her.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just say I\u0027m glad you\u0027re on the other side of the base,\" I whisper to Nathan as the sergeant starts talking.\u003c/p\u003e\n\u003cp\u003e\"I can always sneak out with the guys and peek in on you girls while you\u0027re changing,\" he whispers back.\u003c/p\u003e\n\u003cp\u003eI wish I could talk louder but everyone is quiet, listening to the sergeant. I\u0027ll have to get briefed later on what he\u0027s saying, because I\u0027m not listening. Instead, I whisper, \"Nathan, you\u0027re a perv.\"\u003c/p\u003e\n\u003cp\u003e\"We can call it Operation Boobie Watch,\" he whispers back, but emphasizes the word \"boobie,\" which he knows I hate. Boobage, boobie, jugs, hammocks, etc... I hate all the nicknames for boobs.\u003c/p\u003e\n\u003cp\u003eOperation Boobie Watch? Eww! I know Nathan doesn\u0027t mean it. He\u0027s just trying to get a rise out of me because it entertains him. He knows how to push my buttons... especially when it comes to boobs.\u003c/p\u003e\n\u003cp\u003eGod gave me this body, but I really wish he\u0027d have given me less of it in the boob department.\u003c/p\u003e\n\u003cp\u003eIn response to Nathan\u0027s comment, I shove him away from me. Which isn\u0027t the best idea in the world, because now Sergeant \"Don\u0027t-Call-Me-Ben\"-Shimon stops talking and focuses his ice-blue eyes on us.\u003c/p\u003e\n\u003cp\u003e\"Tell me your names?\"\u003c/p\u003e\n\u003cp\u003eEveryone is staring at us. We\u0027re in big trouble. Oh, crap. \"Amy,\" I squeak out. Guess he didn\u0027t remember we already were introduced by the barracks.\u003c/p\u003e\n\u003cp\u003e\"Nathan, sir!\" I hear from my best guy friend/enemy/ annoyance beside me. He says it loud and clear, like he\u0027s been in the military his entire life instead of just one and a half hours.\u003c/p\u003e\n\u003cp\u003e\"Amy, what was I just explaining?\" the sergeant asks me.\u003c/p\u003e\n\u003cp\u003eDouble oh-crap. I dare not tell the guy I was expecting to get the shortened version by asking my friends. Deciding there\u0027s no other way around it, I tell him the truth.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know... SIR!\" I figure adding the \u0027sir\u0027 might earn me some brownie points--it seemed to work for Nathan. But from the sergeant\u0027s eyebrow-furrowing expression, I realize my \u0027sir didn\u0027t work.\u003c/p\u003e\n\u003cp\u003eHe stands in front of Nathan and asks the same question. Nathan\u0027s response is the same as mine.\u003c/p\u003e\n\u003cp\u003e\"You and you,\" the sergeant says, pointing to each of us. \"Follow me.\"\u003c/p\u003e\n\u003cp\u003eWe follow the guy to the front of the entire American trainee unit. Looking ahead, I see Jessica with a worried expression. She knows I\u0027m not into the whole military thing.\u003c/p\u003e\n\u003cp\u003e\"Give me twenty,\" the sergeant commands, with his hands on his hips. \u003c/p\u003e","sourceLink":"https://allnovel.net/how-to-ruin-your-boyfriend-s-reputation-how-to-ruin-3/page-3.html","bookId":2766,"creation":"Oct 5, 2019 5:10:08 PM","modification":"Oct 5, 2019 5:10:08 PM"}
