{"id":96862,"no":10,"title":"Page 10","content":"\u003cp\u003e\"Sit down,\" she said. \"You insulted me so.\"\u003c/p\u003e\n\u003cp\u003eSlowly, he sank back into the chair.\u003c/p\u003e\n\u003cp\u003eAnd Jessica, reading the signs of this face that she knew so well, allowed herself a deep breath. It isn\u0027t Hawat .\u003c/p\u003e\n\u003cp\u003e\"Now I know you remain loyal to my Duke,\" she said. \"I\u0027m prepared, therefore, to forgive your affront to me.\"\u003c/p\u003e\n\u003cp\u003e\"Is there something to forgive?\"\u003c/p\u003e\n\u003cp\u003eJessica scowled, wondering: Shall I play my trump? Shall I tell him of the Duke\u0027s daughter I\u0027ve carried within me these few weeks? No . . . Leto himself doesn\u0027t know. This would only complicate his life, divert him in a time when he must concentrate on our survival. There is yet time to use this .\u003c/p\u003e\n\u003cp\u003e\"A Truthsayer would solve this,\" she said, \"but we have no Truthsayer qualified by the High Board.\"\u003c/p\u003e\n\u003cp\u003e\"As you say. We\u0027ve no Truthsayer.\"\u003c/p\u003e\n\u003cp\u003e\"Is there a traitor among us?\" she asked. \"I\u0027ve studied our people with great care. Who could it be? Not Gurney. Certainly not Duncan . Their lieutenants are not strategically enough placed to consider. It\u0027s not you, Thufir. It cannot be Paul. I know it\u0027s not me. Dr. Yueh, then? Shall I call him in and put him to the test?\"\u003c/p\u003e\n\u003cp\u003e\"You know that\u0027s an empty gesture,\" Hawat said. \"He\u0027s conditioned by the High College . That I know for certain.\"\u003c/p\u003e\n\u003cp\u003e\"Not to mention that his wife was a Bene Gesserit slain by the Harkonnens,\" Jessica said.\u003c/p\u003e\n\u003cp\u003e\"So that\u0027s what happened to her,\" Hawat said.\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you heard the hate in his voice when he speaks the Harkonnen name?\"\u003c/p\u003e\n\u003cp\u003e\"You know I don\u0027t have the ear,\" Hawat said.\u003c/p\u003e\n\u003cp\u003e\"What brought this base suspicion on me?\" she asked.\u003c/p\u003e\n\u003cp\u003eHawat frowned. \"My Lady puts her servant in an impossible position. My first loyalty is to the Duke.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m prepared to forgive much because of that loyalty,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And again I must ask: Is there something to forgive?\"\u003c/p\u003e\n\u003cp\u003e\"Stalemate?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e\"Let us discuss something else for a minute, then,\" she said. \"Duncan Idaho, the admirable fighting man whose abilities at guarding and surveillance are so esteemed. Tonight, he overindulged in something called spice beer. I hear reports that others among our people have been stupefied by this concoction. Is that true?\"\u003c/p\u003e\n\u003cp\u003e\"You have your reports, my Lady.\"\u003c/p\u003e\n\u003cp\u003e\"So I do. Don\u0027t you see this drinking as a symptom, Thufir?\"\u003c/p\u003e\n\u003cp\u003e\"My Lady speaks riddles.\"\u003c/p\u003e\n\u003cp\u003e\"Apply your Mentat abilities to it!\" she snapped. \"What\u0027s the problem with Duncan and the others? I can tell you in four words - they have no home.\"\u003c/p\u003e\n\u003cp\u003eHe jabbed a finger at the floor. \"Arrakis, that\u0027s their home.\"\u003c/p\u003e\n\u003cp\u003e\"Arrakis is an unknown! Caladan was their home, but we\u0027ve uprooted them. They have no home. And they fear the Duke\u0027s failing them.\"\u003c/p\u003e\n\u003cp\u003eHe stiffened. \"Such talk from one of the men would be cause for - \"\u003c/p\u003e\n\u003cp\u003e\"Oh, stop that, Thufir. Is it defeatist or treacherous for a doctor to diagnose a disease correctly? My only intention is to cure the disease.\"\u003c/p\u003e\n\u003cp\u003e\"The Duke gives me charge over such matters.\"\u003c/p\u003e\n\u003cp\u003e\"But you understand I have a certain natural concern over the progress of this disease,\" she said. \"And perhaps you\u0027ll grant I have certain abilities along these lines.\"\u003c/p\u003e\n\u003cp\u003eWill I have to shock him severely? she wondered. He needs shaking up - something to break him from routine .\u003c/p\u003e\n\u003cp\u003e\"There could be many interpretations for your concern,\" Hawat said. He shrugged.\u003c/p\u003e\n\u003cp\u003e\"Then you\u0027ve already convicted me?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not, my Lady. But I cannot afford to take any chances, the situation being what it is.\"\u003c/p\u003e\n\u003cp\u003e\"A threat to my son got past you right here in this house,\" she said. \"Who took that chance?\"\u003c/p\u003e\n\u003cp\u003eHis face darkened. \"I offered my resignation to the Duke.\"\u003c/p\u003e\n\u003cp\u003e\"Did you offer your resignation to me . . . or to Paul?\"\u003c/p\u003e\n\u003cp\u003eNow he was openly angry, betraying it in quickness of breathing, in dilation of nostrils, a steady stare. She saw a pulse beating at his temple.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the Duke\u0027s man,\" he said, biting off the words.\u003c/p\u003e\n\u003cp\u003e\"There is no traitor,\" she said. \"The threat\u0027s something else. Perhaps it has to do with the lasguns. Perhaps they\u0027ll risk secreting a few lasguns with timing mechanisms aimed at house shields. Perhaps they\u0027ll . . . \"\u003c/p\u003e\n\u003cp\u003e\"And who could tell after the blast if the explosion wasn\u0027t atomic?\" he asked. \"No, my Lady. They\u0027ll not risk anything that illegal. Radiation lingers. The evidence is hard to erase. No. They\u0027ll observe most of the forms. It has to be a traitor.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the Duke\u0027s man,\" she sneered. \"Would you destroy him in the effort to save him?\"\u003c/p\u003e\n\u003cp\u003eHe took a deep breath, then: \"If you\u0027re innocent, you\u0027ll have my most abject apologies.\"\u003c/p\u003e\n\u003cp\u003e\"Look at you now, Thufir,\" she said. \"Humans live best when each has his own place, when each knows where he belongs in the scheme of things. Destroy the place and destroy the person. You and I, Thufir, of all those who love the Duke, are most ideally situated to destroy the other\u0027s place. Could I not whisper suspicions about you into the Duke\u0027s ear at night? When would he be most susceptible to such whispering, Thufir? Must I draw it for you more clearly?\"\u003c/p\u003e\n\u003cp\u003e\"You threaten me?\" he growled.\u003c/p\u003e\n\u003cp\u003e\"Indeed not. I merely point out to you that someone is attacking us through the basic arrangement of our lives. It\u0027s clever, diabolical. I propose to negate this attack by so ordering our lives that there\u0027ll be no chinks for such barbs to enter.\"\u003c/p\u003e\n\u003cp\u003e\"You accuse me of whispering baseless suspicions?\"\u003c/p\u003e\n\u003cp\u003e\"Baseless, yes.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d meet this with your own whispers?\"\u003c/p\u003e\n\u003cp\u003e\"Your life is compounded of whispers, not mine, Thufir.\"\u003c/p\u003e\n\u003cp\u003e\"Then you question my abilities?\"\u003c/p\u003e\n\u003cp\u003eShe sighed. \"Thufir, I want you to examine your own emotional involvement in this. The natural human\u0027s an animal without logic. Your projections of logic onto all affairs is un natural, but suffered to continue for its usefulness. You\u0027re the embodiment of logic - a Mentat. Yet, your problem solutions are concepts that, in a very real sense, are projected outside yourself, there to be studied and rolled around, examined from all sides.\"\u003c/p\u003e\n\u003cp\u003e\"You think now to teach me my trade?\" he asked, and he did not try to hide the disdain in his voice.\u003c/p\u003e\n\u003cp\u003e\"Anything outside yourself, this you can see and apply your logic to it,\" she said. \"But it\u0027s a human trait that when we encounter personal problems, those things most deeply personal are the most difficult to bring out for our logic to scan. We tend to flounder around, blaming everything but the actual, deep-seated thing that\u0027s really chewing on us.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re deliberately attempting to undermine my faith in my abilities as a Mentat,\" he rasped. \"Were I to find one of our people attempting thus to sabotage any other weapon in our arsenal, I should not hesitate to denounce and destroy him.\"\u003c/p\u003e\n\u003cp\u003e\"The finest Mentats have a healthy respect for the error factor in their computations,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never said otherwise!\"\u003c/p\u003e\n\u003cp\u003e\"Then apply yourself to these symptoms we\u0027ve both seen: drunkenness among the men, quarrels - they gossip and exchange wild rumors about Arrakis; they ignore the most simple - \"\u003c/p\u003e\n\u003cp\u003e\"Idleness, no more,\" he said. \"Don\u0027t try to divert my attention by trying to make a simple matter appear mysterious.\"\u003c/p\u003e\n\u003cp\u003eShe stared at him, thinking of the Duke\u0027s men rubbing their woes together in the barracks until you could almost smell the charge there, like burnt insulation. They\u0027re becoming like the men of the pre-Guild legend , she thought: Like the men of the lost star-searcher, Ampoliros - sick at their guns - forever seeking, forever prepared and forever unready .\u003c/p\u003e\n\u003cp\u003e\"Why have you never made full use of my abilities in your service to the Duke?\" she asked. \"Do you fear a rival for your position?\"\u003c/p\u003e\n\u003cp\u003eHe glared at her, the old eyes blazing. \"I know some of the training they give you Bene Gesserit . . . \" He broke off, scowling.\u003c/p\u003e\n\u003cp\u003e\"Go ahead, say it,\" she said. \"Bene Gesserit witches .\"\u003c/p\u003e\n\u003cp\u003e\"I know something of the real training they give you,\" he said. \"I\u0027ve seen it come out in Paul. I\u0027m not fooled by what your schools tell the public: you exist only to serve.\"\u003c/p\u003e\n\u003cp\u003eThe shock must be severe and he\u0027s almost ready for it , she thought.\u003c/p\u003e\n\u003cp\u003e\"You listen respectfully to me in Council,\" she said, \"yet you seldom heed my advice. Why?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t trust your Bene Gesserit motives,\" he said. \"You may think you can look through a man; you may think you can make a man do exactly what you - \"\u003c/p\u003e\n\u003cp\u003e\"You poor fool , Thufir!\" she raged.\u003c/p\u003e\n\u003cp\u003eHe scowled, pushing himself back in the chair.\u003c/p\u003e\n\u003cp\u003e\"Whatever rumors you\u0027ve heard about our schools,\" she said, \"the truth is far greater. If I wished to destroy the Duke . . . or you, or any other person within my reach, you could not stop me.\"\u003c/p\u003e\n\u003cp\u003eAnd she thought: Why do I let pride drive such words out of me? This is not the way I was trained. This is not how I must shock him .\u003c/p\u003e\n\u003cp\u003eHawat slipped a hand beneath his tunic where he kept a tiny projector of poison darts. She wears no shield , he thought. Is this just a brag she makes? I could slay her now . . . but, ah-h-h-h, the consequences if I\u0027m wrong .\u003c/p\u003e\n\u003cp\u003eJessica saw the gesture toward his pocket, said: \"Let us pray violence shall never be necessary between us.\"\u003c/p\u003e\n\u003cp\u003e\"A worthy prayer,\" he agreed.\u003c/p\u003e\n\u003cp\u003e\"Meanwhile, the sickness spreads among us,\" she said. \"I must ask you again: Isn\u0027t it more reasonable to suppose the Harkonnens have planted this suspicion to pit the two of us against each other?\"\u003c/p\u003e\n\u003cp\u003e\"We appear to\u0027ve returned to stalemate,\" he said.\u003c/p\u003e\n\u003cp\u003eShe sighed, thinking: He\u0027s almost ready for it .\u003c/p\u003e\n\u003cp\u003e\"The Duke and I are father and mother surrogates to our people,\" she said. \"The position - \"\u003c/p\u003e\n\u003cp\u003e\"He hasn\u0027t married you,\" Hawat said.\u003c/p\u003e\n\u003cp\u003eShe forced herself to calmness, thinking: A good riposte, that .\u003c/p\u003e\n\u003cp\u003e\"But he\u0027ll not marry anyone else,\" she said. \"Not as long as I live. And we are surrogates, as I\u0027ve said. To break up this natural order in our affairs, to disturb, disrupt, and confuse us - which target offers itself most enticingly to the Harkonnens?\"\u003c/p\u003e\n\u003cp\u003eHe sensed the direction she was taking, and his brows drew down in a lowering scowl.\u003c/p\u003e\n\u003cp\u003e\"The Duke?\" she asked. \"Attractive target, yes, but no one with the possible exception of Paul is better guarded. Me? I tempt them, surely, but they must know the Bene Gesserit make difficult targets. And there\u0027s a better target, one whose duties create, necessarily, a monstrous blind spot. One to whom suspicion is as natural as breathing. One who builds his entire life on innuendo and mystery.\" She darted her right hand toward him. \"You!\"\u003c/p\u003e\n\u003cp\u003eHawat started to leap from his chair.\u003c/p\u003e\n\u003cp\u003e\"I have not dismissed you, Thufir!\" she flared.\u003c/p\u003e\n\u003cp\u003eThe old Mentat almost fell back into the chair, so quickly did his muscles betray him.\u003c/p\u003e\n\u003cp\u003eShe smiled without mirth.\u003c/p\u003e\n\u003cp\u003e\"Now you know something of the real training they give us,\" she said.\u003c/p\u003e\n\u003cp\u003eHawat tried to swallow in a dry throat. Her command had been regal, preemptory - uttered in a tone and manner he had found completely irresistible. His body had obeyed her before he could think about it. Nothing could have prevented his response - not logic, not passionate anger . . . nothing. To do what she had done spoke of a sensitive, intimate knowledge of the person thus commanded, a depth of control he had not dreamed possible.\u003c/p\u003e\n\u003cp\u003e\"I have said to you before that we should understand each other,\" she said. \"I meant you should understand me . I already understand you. And I tell you now that your loyalty to the Duke is all that guarantees your safety with me.\"\u003c/p\u003e\n\u003cp\u003eHe stared at her, wet his lips with his tongue.\u003c/p\u003e\n\u003cp\u003e\"If I desired a puppet, the Duke would marry me,\" she said. \"He might even think he did it of his own free will.\"\u003c/p\u003e\n\u003cp\u003eHawat lowered his head, looked upward through his sparse lashes. Only the most rigid control kept him from calling the guard. Control . . . and the suspicion now that woman might not permit it. His skin crawled with the memory of how she had controlled him. In the moment of hesitation, she could have drawn a weapon and killed him!\u003c/p\u003e\n\u003cp\u003eDoes every human have this blind spot? he wondered. Can any of us be ordered into action before he can resist? The idea staggered him. Who could stop a person with such power?\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve glimpsed the fist within the Bene Gesserit glove,\" she said. \"Few glimpse it and live. And what I did was a relatively simple thing for us. You\u0027ve not seen my entire arsenal. Think on that,\"\u003c/p\u003e\n\u003cp\u003e\"Why aren\u0027t you out destroying the Duke\u0027s enemies?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"What would you have me destroy?\" she asked. \"Would you have me make a weakling of our Duke, have him forever leaning on me?\"\u003c/p\u003e\n\u003cp\u003e\"But, with such power . . . \"\u003c/p\u003e\n\u003cp\u003e\"Power\u0027s a two-edged sword, Thufir,\" she said; \"You think: \u0027How easy for her to shape a human tool to thrust into an enemy\u0027s vitals.\u0027 True, Thufir; even into your vitals. Yet, what would I accomplish? If enough of us Bene Gesserit did this, wouldn\u0027t it make all Bene Gesserit suspect? We don\u0027t want that, Thufir. We do not wish to destroy ourselves.\" She nodded. \"We truly exist only to serve.\"\u003c/p\u003e\n\u003cp\u003e\"I cannot answer you,\" he said. \"You know I cannot answer.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll say nothing about what has happened here to anyone,\" she said. \"I know you, Thufir.\"\u003c/p\u003e\n\u003cp\u003e\"My Lady . . . \" Again the old man tried to swallow in a dry throat.\u003c/p\u003e\n\u003cp\u003eAnd he thought: She has great powers, yes. But would these not make her an even more formidable tool for the Harkonnens?\u003c/p\u003e\n\u003cp\u003e\"The Duke could be destroyed as quickly by his friends as by his enemies,\" she said. \"I trust now you\u0027ll get to the bottom of this suspicion and remove it.\"\u003c/p\u003e\n\u003cp\u003e\"If it proves baseless,\" he said.\u003c/p\u003e\n\u003cp\u003e\"If, \" she sneered.\u003c/p\u003e\n\u003cp\u003e\"If,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You are tenacious,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Cautious,\" he said, \"and aware of the error factor.\"\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll pose another question for you: What does it mean to you that you stand before another human, that you are bound and helpless and the other human holds a knife at your throat - yet this other human refrains from killing you, frees you from your bonds and gives you the knife to use as you will?\"\u003c/p\u003e\n\u003cp\u003eShe lifted herself out of the chair, turned her back on him. \"You may go now, Thufir.\"\u003c/p\u003e\n\u003cp\u003eThe old Mentat arose, hesitated, hand creeping toward the deadly weapon beneath his tunic. He was reminded of the bull ring and of the Duke\u0027s father (who\u0027d been brave, no matter what his other failings) and one day of the corrida long ago: The fierce black beast had stood there, head bowed, immobilized and confused. The Old Duke had turned his back on the horns, cape thrown flamboyantly over one arm, while cheers rained down from the stands.\u003c/p\u003e\n\u003cp\u003eI am the bull and she the matador , Hawat thought. He withdrew his hand from the weapon, glanced at the sweat glistening in his empty palm.\u003c/p\u003e\n\u003cp\u003eAnd he knew that whatever the facts proved to be in the end, he would never forget this moment nor lose this sense of supreme admiration for the Lady Jessica.\u003c/p\u003e\n\u003cp\u003eQuietly, he turned and left the room.\u003c/p\u003e\n\u003cp\u003eJessica lowered her gaze from the reflection in the windows, turned, and stared at the closed door.\u003c/p\u003e\n\u003cp\u003e\"Now we\u0027ll see some proper action,\" she whispered.\u003c/p\u003e\n\u003cp\u003eDo you wrestle with dreams?\u003c/p\u003e\n\u003cp\u003eDo you contend with shadows?\u003c/p\u003e\n\u003cp\u003eDo you move in a kind of sleep?\u003c/p\u003e\n\u003cp\u003eTime has slipped away.\u003c/p\u003e\n\u003cp\u003eYour life is stolen.\u003c/p\u003e\n\u003cp\u003eYou tarried with trifles,\u003c/p\u003e\n\u003cp\u003eVictim of your folly.\u003c/p\u003e\n\u003cp\u003e- Dirge for Jamis on the Funeral Plain,\u003c/p\u003e\n\u003cp\u003efrom \"Songs of Muad\u0027Dib\" by the Princess Irulan\u003c/p\u003e\n\u003cp\u003eLeto stood in the foyer of his house, studying a note by the light of a single suspensor lamp. Dawn was yet a few hours away, and he felt his tiredness. A Fremen messenger had brought the note to the outer guard just now as the Duke arrived from his command post.\u003c/p\u003e\n\u003cp\u003eThe note read: \"A column of smoke by day, a pillar of fire by night.\"\u003c/p\u003e\n\u003cp\u003eThere was no signature.\u003c/p\u003e\n\u003cp\u003eWhat does it mean? he wondered.\u003c/p\u003e\n\u003cp\u003eThe messenger had gone without waiting for an answer and before he could be questioned. He had slipped into the night like some smoky shadow.\u003c/p\u003e\n\u003cp\u003eLeto pushed the paper into a tunic pocket, thinking to show it to Hawat later. He brushed a lock of hair from his forehead, took a sighing breath. The anti-fatigue pills were beginning to wear thin. It had been a long two days since the dinner party and longer than that since he had slept.\u003c/p\u003e\n\u003cp\u003eOn top of all the military problems, there\u0027d been the disquieting session with Hawat, the report on his meeting with Jessica.\u003c/p\u003e\n\u003cp\u003eShould I waken Jessica? he wondered. There\u0027s no reason to play the secrecy game with her any longer. Or is there?\u003c/p\u003e\n\u003cp\u003eBlast and damn that Duncan Idaho!\u003c/p\u003e\n\u003cp\u003eHe shook his head. No, not Duncan. I was wrong not to take Jessica into my confidence from the first. I must do it now, before more damage is done .\u003c/p\u003e\n\u003cp\u003eThe decision made him feel better, and he hurried from the foyer through the Great Hall and down the passages toward the family wing.\u003c/p\u003e\n\u003cp\u003eAt the turn where the passages split to the service area, he paused. A strange mewling came from somewhere down the service passage. Leto put his left hand to the switch on his shield belt, slipped his kindjal into his right hand. The knife conveyed a sense of reassurance. That strange sound had sent a chill through him.\u003c/p\u003e\n\u003cp\u003eSoftly, the Duke moved down the service passage, cursing the inadequate illumination. The smallest of suspensors had been spaced about eight meters apart along here and tuned to their dimmest level. The dark stone walls swallowed the light.\u003c/p\u003e\n\u003cp\u003eA dull blob stretching across the floor appeared out of the gloom ahead.\u003c/p\u003e\n\u003cp\u003eLeto hesitated, almost activated his shield, but refrained because that would limit his movements, his hearing . . . and because the captured shipment of lasguns had left him filled with doubts.\u003c/p\u003e\n\u003cp\u003eSilently, he moved toward the grey blob, saw that it was a human figure, a man face down on the stone. Leto turned him over with a foot, knife poised, bent close in the dim light to see the face. It was the smuggler, Tuek, a wet stain down his chest. The dead eyes stared with empty darkness. Leto touched the stain - warm.\u003c/p\u003e\n\u003cp\u003eHow could this man be dead here? Leto asked himself. Who killed him?\u003c/p\u003e\n\u003cp\u003eThe mewling sound was louder here. It came from ahead and down the side passage to the central room where they had installed the main shield generator for the house.\u003c/p\u003e\n\u003cp\u003eHand on belt switch, kindjal poised, the Duke skirted the body, slipped down the passage and peered around the corner toward the shield generator room.\u003c/p\u003e\n\u003cp\u003eAnother grey blob lay stretched on the floor a few paces away, and he saw at once this was the source of the noise. The shape crawled toward him with painful slowness, gasping, mumbling.\u003c/p\u003e\n\u003cp\u003eLeto stilled his sudden constriction of fear, darted down the passage, crouched beside the crawling figure. It was Mapes, the Fremen housekeeper, her hair tumbled around her face, clothing disarrayed. A dull shininess of dark stain spread from her back along her side. He touched her shoulder and she lifted herself on her elbows, head tipped up to peer at him, the eyes black-shadowed emptiness.\u003c/p\u003e\n\u003cp\u003e\"S\u0027you,\" she gasped. \"Killed . . . guard . . . sent . . . get . . . Tuek . . . escape . . . m\u0027Lady . . . you . . . you . . . here . . . no . . . \" She flopped forward, her head thumping against the stone.\u003c/p\u003e\n\u003cp\u003eLeto felt for pulse at the temples. There was none. He looked at the stain: she\u0027d been stabbed in the back. Who? His mind raced. Did she mean someone had killed a guard? And Tuek - had Jessica sent for him? Why?\u003c/p\u003e\n\u003cp\u003eHe started to stand up. A sixth sense warned him. He flashed a hand toward the shield switch - too late. A numbing shock slammed his arm aside. He felt pain there, saw a dart protruding from the sleeve, sensed paralysis spreading from it up his arm. It took an agonizing effort to lift his head and look down the passage.\u003c/p\u003e\n\u003cp\u003eYueh stood in the open door of the generator room. His face reflected yellow from the light of a single, brighter suspensor above the door. There was stillness from the room behind him - no sound of generators.\u003c/p\u003e\n\u003cp\u003eYueh! Leto thought. He\u0027s sabotaged the house generators! We \u0027re wide open!\u003c/p\u003e\n\u003cp\u003eYueh began walking toward him, pocketing a dartgun.\u003c/p\u003e\n\u003cp\u003eLeto found he could still speak, gasped: \"Yueh! How?\" Then the paralysis reached his legs and he slid to the floor with his back propped against the stone wall.\u003c/p\u003e\n\u003cp\u003eYueh\u0027s face carried a look of sadness as he bent over, touched Leto\u0027s forehead. The Duke found he could feel the touch, but it was remote . . . dull.\u003c/p\u003e\n\u003cp\u003e\"The drug on the dart is selective,\" Yueh said \"You can speak, but I\u0027d advise against it.\" He glanced down the hall, and again bent over Leto, pulled out the dart, tossed it aside. The sound of the dart clattering on the stones was faint and distant to the Duke\u0027s ears.\u003c/p\u003e\n\u003cp\u003eIt can\u0027t be Yueh , Leto thought. He\u0027s conditioned.\u003c/p\u003e\n\u003cp\u003e\"How?\" Leto whispered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, my dear Duke, but there are things which will make greater demands than this.\" He touched the diamond tattoo on his forehead. \"I find it very strange, myself - an override on my pyretic conscience - but I wish to kill a man. Yes, I actually wish it. I will stop at nothing to do it.\"\u003c/p\u003e\n\u003cp\u003eHe looked down at the Duke. \"Oh, not you, my dear Duke. The Baron Harkonnen. I wish to kill the Baron.\"\u003c/p\u003e\n\u003cp\u003e\"Bar . . . on Har . . . \"\u003c/p\u003e\n\u003cp\u003e\"Be quiet, please, my poor Duke. You haven\u0027t much time. That peg tooth I put in your mouth after the tumble at Narcal - that tooth must be replaced, in a moment, I\u0027ll render you unconscious and replace that tooth.\" He opened his hand, stared at something in it. \"An exact duplicate, its core shaped most exquisitely like a nerve. It\u0027ll escape the usual detectors, even a fast scanning. But if you bite down hard on it, the cover crushes. Then, when you expel your breath sharply, you fill the air around you with a poison gas - most deadly.\"\u003c/p\u003e\n\u003cp\u003eLeto stared up at Yueh, seeing madness in the man\u0027s eyes, the perspiration along brown and chin.\u003c/p\u003e\n\u003cp\u003e\"You were dead anyway, my poor Duke,\" Yueh said. \"But you will get close to the Baron before you die. He\u0027ll believe you\u0027re stupefied by drugs beyond any dying effort to attack him. And you will be drugged - and tied. But attack can take strange forms. And you will remember the tooth. The tooth , Duke Leto Atreides. You will remember the tooth.\"\u003c/p\u003e\n\u003cp\u003eThe old doctor leaned closer and closer until his face and drooping mustache dominated Leto\u0027s narrowing vision.\u003c/p\u003e\n\u003cp\u003e\"The tooth,\" Yueh muttered.\u003c/p\u003e\n\u003cp\u003e\"Why?\" Leto whispered.\u003c/p\u003e\n\u003cp\u003eYueh lowered himself to one knee beside the Duke. \"I made a shaitan\u0027s bargain with the Baron. And I must be certain he has fulfilled his half of it. When I see him, I\u0027ll know. When I look at the Baron, then I will know. But I\u0027ll never enter his presence without the price. You\u0027re the price, my poor Duke. And I\u0027ll know when I see him. My poor Wanna taught me many things, and one is to see certainty of truth when the stress is great. I cannot do it always, but when I see the Baron - then, I will know.\"\u003c/p\u003e\n\u003cp\u003eLeto tried to look down at the tooth in Yueh\u0027s hand. He felt this was happening in a nightmare - it could not be.\u003c/p\u003e\n\u003cp\u003eYueh\u0027s purple lips turned up in a grimace. \"I\u0027ll not get close enough to the Baron, or I\u0027d do this myself. No. I\u0027ll be detained at a safe distance. But you . . . ah, now! You, my lovely weapon! He\u0027ll want you close to him - to gloat over you, to boast a little.\"\u003c/p\u003e\n\u003cp\u003eLeto found himself almost hypnotized by a muscle on the left side of Yueh\u0027s jaw. The muscle twisted when the man spoke.\u003c/p\u003e\n\u003cp\u003eYueh leaned closer. \"And you, my good Duke, my precious Duke, you must remember this tooth.\" He held it up between thumb and forefinger. \"It will be all that remains to you.\"\u003c/p\u003e\n\u003cp\u003eLeto\u0027s mouth moved without sound, then: \"Refuse.\"\u003c/p\u003e\n\u003cp\u003e\"Ah-h, no! You mustn\u0027t refuse. Because, in return for this small service, I\u0027m doing a thing for you. I will save your son and your woman. No other can do it. They can be removed to a place where no Harkonnen can reach them.\"\u003c/p\u003e\n\u003cp\u003e\"How . . . save . . . them?\" Leto whispered.\u003c/p\u003e\n\u003cp\u003e\"By making it appear they\u0027re dead, by secreting them among people who draw knife at hearing the Harkonnen name, who hate the Harkonnens so much they\u0027ll burn a chair in which a Harkonnen has sat, salt the ground over which a Harkonnen has walked.\" He touched Leto\u0027s jaw. \"Can you feel anything in your jaw?\"\u003c/p\u003e\n\u003cp\u003eThe Duke found that he could not answer. He sensed distant tugging, saw Yueh\u0027s hand come up with the ducal signet ring.\u003c/p\u003e\n\u003cp\u003e\"For Paul,\" Yueh said. \"You\u0027ll be unconscious presently. Good-by, my poor Duke. When next we meet we\u0027ll have no time for conversation.\"\u003c/p\u003e\n\u003cp\u003eCool remoteness spread upward from Leto\u0027s jaw, across his cheeks. The shadowy, hall narrowed to a pinpoint with Yueh\u0027s purple lips centered in it.\u003c/p\u003e\n\u003cp\u003e\"Remember the tooth!\" Yueh hissed. \"The tooth!\"\u003c/p\u003e\n\u003cp\u003eThere should be a science of discontent. People need hard times and oppression to develop psychic muscles.\u003c/p\u003e\n\u003cp\u003e- from \"Collected Sayings of Muad\u0027Dib\" by the Princess Irulan\u003c/p\u003e\n\u003cp\u003eJessica awoke in the dark, feeling premonition in the stillness around her. She could not understand why her mind and body felt so sluggish. Skin raspings of fear ran along her nerves. She thought of sitting up and turning on a light, but something stayed the decision. Her mouth felt . . . strange.\u003c/p\u003e\n\u003cp\u003eLump-lump-lump-lump!\u003c/p\u003e\n\u003cp\u003eIt was a dull sound, directionless in the dark. Somewhere.\u003c/p\u003e\n\u003cp\u003eThe waiting moment was packed with time, with rustling needle-stick movements.\u003c/p\u003e\n\u003cp\u003eShe began to feel her body, grew aware of bindings on wrists and ankles, a gag in her mouth. She was on her side, hands tied behind her. She tested the bindings, realized they were krimskell fiber, would only claw tighter as she pulled.\u003c/p\u003e\n\u003cp\u003eAnd now, she remembered.\u003c/p\u003e\n\u003cp\u003eThere had been movement in the darkness of her bedroom, something wet and pungent slapped against her face, filling her mouth, hands grasping for her. She had gasped - one indrawn breath - sensing the narcotic in the wetness. Consciousness had receded, sinking her into a black bin of terror.\u003c/p\u003e\n\u003cp\u003eIt has come , she thought. How simple it was to subdue the Bene Gesserit. All it took was treachery. Hawat was right.\u003c/p\u003e\n\u003cp\u003eShe forced herself not to pull on her bindings.\u003c/p\u003e\n\u003cp\u003eThis is not my bedroom , she thought. They\u0027ve taken me someplace else .\u003c/p\u003e\n\u003cp\u003eSlowly, she marshaled the inner calmness.\u003c/p\u003e\n\u003cp\u003eShe grew aware of the smell of her own stale sweat with its chemical infusion of fear.\u003c/p\u003e\n\u003cp\u003eWhere is Paul? she asked herself. My son - what have they done to him?\u003c/p\u003e\n\u003cp\u003eCalmness .\u003c/p\u003e\n\u003cp\u003eShe forced herself to it, using the ancient routines.\u003c/p\u003e\n\u003cp\u003eBut terror remained so near.\u003c/p\u003e\n\u003cp\u003eLeto? Where are you, Leto?\u003c/p\u003e\n\u003cp\u003eShe sensed a diminishing in the dark. It began with shadows. Dimensions separated, became new thorns of awareness. White. A line under a door.\u003c/p\u003e\n\u003cp\u003eI\u0027m on the floor .\u003c/p\u003e\n\u003cp\u003ePeople walking. She sensed it through the floor.\u003c/p\u003e\n\u003cp\u003eJessica squeezed back the memory of terror. I must remain calm, alert, and prepared. I may get only one chance . Again, she forced the inner calmness.\u003c/p\u003e\n\u003cp\u003eThe ungainly thumping of her heartbeats evened, shaping out time. She counted back. I was unconscious about an hour . She closed her eyes, focused her awareness onto the approaching footsteps.\u003c/p\u003e\n\u003cp\u003eFour people .\u003c/p\u003e\n\u003cp\u003eShe counted the differences in their steps.\u003c/p\u003e\n\u003cp\u003eI must pretend I\u0027m still unconscious . She relaxed against the cold floor, testing her body\u0027s readiness, heard a door open, sensed increased light through her eyelids.\u003c/p\u003e\n\u003cp\u003eFeet approached: someone standing over her.\u003c/p\u003e\n\u003cp\u003e\"You are awake,\" rumbled a basso voice. \"Do not pretend.\"\u003c/p\u003e\n\u003cp\u003eShe opened her eyes.\u003c/p\u003e\n\u003cp\u003eThe Baron Vladimir Harkonnen stood over her. Around them, she recognized the cellar room where Paul had slept, saw his cot at one side - empty. Suspensor lamps were brought in by guards, distributed near the open door. There was a glare of light in the hallway beyond that hurt her eyes.\u003c/p\u003e\n\u003cp\u003eShe looked up at the Baron. He wore a yellow cape that bulged over his portable suspensors. The fat cheeks were two cherubic mounds beneath spider-black eyes.\u003c/p\u003e\n\u003cp\u003e\"The drug was timed,\" he rumbled. \"We knew to the minute when you\u0027d be coming out of it.\"\u003c/p\u003e\n\u003cp\u003eHow could that be? she wondered. They\u0027d have to know my exact weight, my metabolism, my . . . Yueh!\u003c/p\u003e\n\u003cp\u003e\"Such a pity you must remain gagged,\" the Baron said. \"We could have such an interesting conversation.\"\u003c/p\u003e\n\u003cp\u003eYueh\u0027s the only one it could be , she thought. How?\u003c/p\u003e\n\u003cp\u003eThe Baron glanced behind him at the door. \"Come in, Piter.\"\u003c/p\u003e\n\u003cp\u003eShe had never before seen the man who entered to stand beside the Baron, but the face was known - and the man: Piter de Vries, the Mentat-Assassin . She studied him - hawk features, blue-ink eyes that suggested he was a native of Arrakis, but subtleties of movement and stance told her he was not. And his flesh was too well firmed with water. He was tall, though slender, and something about him suggested effeminacy.\u003c/p\u003e\n\u003cp\u003e\"Such a pity we cannot have our conversation, my dear Lady Jessica.\" the Baron said. \"However, I\u0027m aware of your abilities.\" He glanced at the Mentat. \"Isn\u0027t that true, Piter?\"\u003c/p\u003e\n\u003cp\u003e\"As you say, Baron,\" the man said.\u003c/p\u003e\n\u003cp\u003eThe voice was tenor. It touched her spine with a wash of coldness. She had never heard such a chill voice. To one with the Bene Gesserit training, the voice screamed: Killer!\u003c/p\u003e\n\u003cp\u003e\"I have a surprise for Piter,\" the Baron said. \"He thinks he has come here to collect his reward - you, Lady Jessica. But I wish to demonstrate a thing: that he does not really want you.\"\u003c/p\u003e\n\u003cp\u003e\"You play with me, Baron?\" Piter asked, and he smiled.\u003c/p\u003e\n\u003cp\u003eSeeing that smile, Jessica wondered that the Baron did not leap to defend himself from this Piter. Then she corrected herself. The Baron could not read that smile. He did not have the Training.\u003c/p\u003e\n\u003cp\u003e\"In many ways, Piter is quite naive,\" the Baron said. \"He doesn\u0027t admit to himself what a deadly creature you are, Lady Jessica. I\u0027d show him, but it\u0027d be a foolish risk.\" The Baron smiled at Piter, whose face had become a waiting mask. \"I know what Piter really wants. Piter wants power.\"\u003c/p\u003e\n\u003cp\u003e\"You promised I could have her ,\" Piter said. The tenor voice had lost some of its cold reserve.\u003c/p\u003e\n\u003cp\u003eJessica heard the clue-tones in the man\u0027s voice, allowed herself an inward shudder. How could the Baron have made such an animal out of a Mentat?\u003c/p\u003e\n\u003cp\u003e\"I give you a choice, Piter,\" the Baron said.\u003c/p\u003e\n\u003cp\u003e\"What choice?\"\u003c/p\u003e\n\u003cp\u003eThe Baron snapped fat fingers. \"This woman and exile from the Imperium, or the Duchy of Atreides on Arrakis to rule as you see fit in my name.\"\u003c/p\u003e\n\u003cp\u003eJessica watched the Baron\u0027s spider eyes study Piter.\u003c/p\u003e\n\u003cp\u003e\"You could be Duke here in all but name,\" the Baron said.\u003c/p\u003e\n\u003cp\u003eIs my Leto dead, then? Jessica asked herself. She felt a silent wail begin somewhere in her mind.\u003c/p\u003e\n\u003cp\u003eThe Baron kept his attention on the Mentat. \"Understand yourself, Piter. You want her because she was a Duke\u0027s woman, a symbol of his power - beautiful, useful, exquisitely trained for her role. But an entire duchy, Piter! That\u0027s more than a symbol; that\u0027s the reality. With it you could have many women . . . and more.\"\u003c/p\u003e\n\u003cp\u003e\"You do not joke with Piter?\"\u003c/p\u003e\n\u003cp\u003eThe Baron turned with that dancing lightness the suspensors gave him. \"Joke? I? Remember - I am giving up the boy. You heard what the traitor said about the lad\u0027s training. They are alike, this mother and son - deadly.\" The Baron smiled. \"I must go now. I will send in the guard I\u0027ve reserved for this moment. He\u0027s stone deaf. His orders will be to convey you on the first leg of your journey into exile. He will subdue this woman if he sees her gain control of you. He\u0027ll not permit you to untie her gag until you\u0027re off Arrakis. If you choose not to leave . . . he has other orders.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to leave,\" Piter said. \"I\u0027ve chosen.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, hah!\" the Baron chortled. \"Such quick decision can mean only one thing.\"\u003c/p\u003e\n\u003cp\u003e\"I will take the duchy,\" Piter said.\u003c/p\u003e\n\u003cp\u003eAnd Jessica thought: Doesn\u0027t Piter know the Baron\u0027s lying to him? But - how could he know? He\u0027s a twisted Mentat .\u003c/p\u003e\n\u003cp\u003eThe Baron glanced down at Jessica. \"Is it not wonderful that I know Piter so well? I wagered with my Master at Arms that this would be Piter\u0027s choice. Hah! Well, I leave now. This is much better. Ah-h, much better. You understand, Lady Jessica? I hold no rancor toward you. It\u0027s a necessity. Much better this way. Yes. And I\u0027ve not actually ordered you destroyed. When it\u0027s asked of me what happened to you, I can shrug it off in all truth.\"\u003c/p\u003e\n\u003cp\u003e\"You leave it to me then?\" Piter asked.\u003c/p\u003e\n\u003cp\u003e\"The guard I send you will take your orders,\" the Baron said. \"Whatever\u0027s done I leave to you.\" He stared at Piter. \"Yes. There will be no blood on my hands here. It\u0027s your decision. Yes. I know nothing of it. You will wait until I\u0027ve gone before doing whatever you must do. Yes. Well . . . ah, yes. Yes. Good.\"\u003c/p\u003e\n\u003cp\u003eHe fears the questioning of a Truthsayer , Jessica thought. Who? Ah-h-h, the Reverend Mother Gaius Helen, of course! If he knows he must face her questions, then the Emperor is in on this for sure. Ah-h-h-h, my poor Leto .\u003c/p\u003e\n\u003cp\u003eWith one last glance at Jessica, the Baron turned, went out the door. She followed him with her eyes, thinking: It\u0027s as the Reverend Mother warned - too potent an adversary .\u003c/p\u003e\n\u003cp\u003eTwo Harkonnen troopers entered. Another, his face a scarred mask, followed and stood in the doorway with drawn lasgun.\u003c/p\u003e\n\u003cp\u003eThe deaf one , Jessica thought, studying the scarred face. The Baron knows I could use the Voice on any other man .\u003c/p\u003e\n\u003cp\u003eScarface looked at Piter. \"We\u0027ve the boy on a litter outside. What are your orders?\"\u003c/p\u003e\n\u003cp\u003ePiter spoke to Jessica. \"I\u0027d thought of binding you by a threat held over your son, but I begin to see that would not have worked, I let emotion cloud reason. Bad policy for a Mentat.\" He looked at the first pair of troopers, turning so the deaf one could read his lips: \"Take them into the desert as the traitor suggested for the boy. His plan is a good one. The worms will destroy all evidence. Their bodies must never be found.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t wish to dispatch them yourself?\" Scarface asked.\u003c/p\u003e\n\u003cp\u003eHe reads lips , Jessica thought.\u003c/p\u003e\n\u003cp\u003e\"I follow my Baron\u0027s example,\" Piter said. \"Take them where the traitor said.\"\u003c/p\u003e\n\u003cp\u003eJessica heard the harsh Mentat control in Piter\u0027s voice, thought: He, too, fears the Truthsayer .\u003c/p\u003e\n\u003cp\u003ePiter shrugged, turned, and went through the doorway. He hesitated there, and Jessica thought he might turn back for a last look at her, but he went out without turning.\u003c/p\u003e\n\u003cp\u003e\"Me, I wouldn\u0027t like the thought of facing that Truthsayer after this night\u0027s work,\" Scarface said.\u003c/p\u003e\n\u003cp\u003e\"You ain\u0027t likely ever to run into that old witch,\" one of the other troopers said. He went around to Jessica\u0027s head, bent over her. \"It ain\u0027t getting our work done standing around here chattering. Take her feet and - \"\u003c/p\u003e\n\u003cp\u003e\"Why\u0027n\u0027t we kill \u0027em here?\" Scarface asked.\u003c/p\u003e\n\u003cp\u003e\"Too messy,\" the first one said. \"Unless you wants to strangle\u0027em. Me, I likes a nice straightforward job. Drop \u0027em on the desert like that traitor said, cut \u0027em once or twice, leave \u0027the evidence for the worms. Nothing to clean up afterwards.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah . . . well, I guess you\u0027re right,\" Scarface said.\u003c/p\u003e\n\u003cp\u003eJessica listened to them, watching, registering. But the gag blocked her Voice, and there was the deaf one to consider.\u003c/p\u003e\n\u003cp\u003eScarface holstered his lasgun, took her feet. They lifted her like a sack of grain, maneuvered her through the door and dumped her onto a suspensor-buoyed litter with another bound figure. As they turned her, fitting her to the litter, she saw her companion\u0027s face - Paul! He was bound, but not gagged. His face was no more than ten centimeters from hers, eyes closed, his breathing even.\u003c/p\u003e\n\u003cp\u003eIs he drugged? she wondered. \u003c/p\u003e","sourceLink":"https://allnovel.net/dune-dune-chronicles-1/page-10.html","bookId":2153,"creation":"Oct 5, 2019 6:23:41 PM","modification":"Oct 5, 2019 6:23:41 PM"}
