{"id":68335,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe looked up to see a group of Sluts approaching her. They were led by Lips, who was finally fully clothed in black jeans and a black half shirt.\u003c/p\u003e\n\u003cp\u003e“Girls who sleep in don’t get eggs,” Lips said.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to sleep in,” Lucy said. “I guess I was more tired than I thought.”\u003c/p\u003e\n\u003cp\u003e“Oh, you guess?”\u003c/p\u003e\n\u003cp\u003eThe girls laughed. Lucy didn’t know what was so funny.\u003c/p\u003e\n\u003cp\u003e“You need to shower,” Lips said.\u003c/p\u003e\n\u003cp\u003e“You’re dirty,” another Slut said.\u003c/p\u003e\n\u003cp\u003e“Okay …,” Lucy said. “I didn’t know you had showers.”\u003c/p\u003e\n\u003cp\u003e“The Sluts are a clean gang. Don’t you know nothing?” another girl said.\u003c/p\u003e\n\u003cp\u003e“You’re behind schedule. Move it,” Lips said to Lucy.\u003c/p\u003e\n\u003cp\u003eLips pulled Lucy back to the kitchen. The others stayed behind. All the kitchen chores were apparently done, everything was put away neatly and there was no one else in there. Lips brought her in front of a sink with one of those highpower dishwashing hoses hanging above it. She tossed Lucy a cardboard box of powdered dishwashing detergent.\u003c/p\u003e\n\u003cp\u003e“Strip down and soap up.”\u003c/p\u003e\n\u003cp\u003e“What, right here?”\u003c/p\u003e\n\u003cp\u003e“Stop being a little girl.”\u003c/p\u003e\n\u003cp\u003eLucy pointed at the sink. “This is the shower? There isn’t a bathroom or something?”\u003c/p\u003e\n\u003cp\u003e“You want to put us more behind schedule? Come on!”\u003c/p\u003e\n\u003cp\u003eLips creeped Lucy out. How did she get trapped with this chick? Was this some kind of twisted come-on?\u003c/p\u003e\n\u003cp\u003e“Where’s Violent?” Lucy asked.\u003c/p\u003e\n\u003cp\u003e“She’s busy. Get on with it already.”\u003c/p\u003e\n\u003cp\u003eLips squeezed the handle on the hose’s nozzle and a jet of water fired out of it. The water hammered down on the metal of the sink, sounding like a drumroll on a trash can. Lucy sighed. She unzipped her dress. It was the second replacement zipper she’d salvaged from another dress and sewn in. Her fingers quivered. This didn’t feel right. Maybe Lips was playing a trick on her.\u003c/p\u003e\n\u003cp\u003e“I can do this myself. I don’t need you working the hose,” Lucy said.\u003c/p\u003e\n\u003cp\u003eLips smiled, but her eyes stayed mean. Lucy didn’t like it.\u003c/p\u003e\n\u003cp\u003e“Fine. Be quick about it,” Lips said.\u003c/p\u003e\n\u003cp\u003eLips walked out of the kitchen. Lucy still wasn’t sure she wasn’t being made a fool of, but she wanted to make a good impression. And the truth was she couldn’t remember the last good rinse she’d had. She was already the new girl and the slacker girl. She didn’t want to be the dirty one too.\u003c/p\u003e\n\u003cp\u003eLucy wriggled out of her dress quickly. Then her underwear. She laid them over the counter, then poured the white powdered detergent into her hand. The detergent had little blue flecks in it that were kind of pretty. She made a mud out of it with water from the hose, and smeared it on to the important parts: pits, feet, and undercarriage. She didn’t intend to linger in this “shower.”\u003c/p\u003e\n\u003cp\u003eWhen she was sufficiently lathered up, Lucy sprayed herself with the hose to rinse off. The jet of water sprayed soap into her eyes.\u003c/p\u003e\n\u003cp\u003e“Damn it—”\u003c/p\u003e\n\u003cp\u003eShe dropped the hose and rubbed her eyes. She fumbled around like a blind girl, trying to smack her hand into the hanging hose and get it again. Eventually she found it and was able to splash some water in her eyes. She could see again. She glanced down at the counter.\u003c/p\u003e\n\u003cp\u003eHer clothes were gone.\u003c/p\u003e\n\u003cp\u003eSluts grabbed her from behind. They held her arms and pushed her toward the cafeteria. She tried to stop them but her soapy feet slid across the floor.\u003c/p\u003e\n\u003cp\u003e“Stop! What are you doing?”\u003c/p\u003e\n\u003cp\u003eThey shoved her out of the kitchen and she fell on the floor, scraping her stomach and breasts. All the Sluts in the cafeteria were gathered around Lucy in a semicircle. They stared at her. Lips was in front.\u003c/p\u003e\n\u003cp\u003e“Stand up,” Lips said.\u003c/p\u003e\n\u003cp\u003eLucy stood awkwardly, trying to cover her breasts with one forearm and her privates with her other hand. She felt like a complete and total dipshit, naked in front of a smirking crowd of fully clothed bitches. She’d never felt more embarrassed in her life.\u003c/p\u003e\n\u003cp\u003e“Where is Violent?” Lucy said in a tiny voice.\u003c/p\u003e\n\u003cp\u003e“She can’t save you,” Lips said.\u003c/p\u003e\n\u003cp\u003e“Why are you doing this?”\u003c/p\u003e\n\u003cp\u003e“It’s day one,” Lips said. “You know what that makes you?”\u003c/p\u003e\n\u003cp\u003eLucy shook her head. She tried to breathe slow; it wasn’t working.\u003c/p\u003e\n\u003cp\u003e“Who is she?” Lips said to the room.\u003c/p\u003e\n\u003cp\u003e“A GOOD LITTLE GIRL,” the Sluts hollered in unison.\u003c/p\u003e\n\u003cp\u003e“And how does a good girl become a Slut?”\u003c/p\u003e\n\u003cp\u003e“SHE’S GOTTA GET NAKED!”\u003c/p\u003e\n\u003cp\u003e“What’s that called?” Lips said, hyping them up.\u003c/p\u003e\n\u003cp\u003e“NAKED WEEK!”\u003c/p\u003e\n\u003cp\u003e“Say it again?”\u003c/p\u003e\n\u003cp\u003e“NAKED WEEK!”\u003c/p\u003e\n\u003cp\u003e“One more time!”\u003c/p\u003e\n\u003cp\u003e“NAKED WEEK!”\u003c/p\u003e\n\u003cp\u003eThe girls whooped and cheered.\u003c/p\u003e\n\u003cp\u003eLips stepped in and got an inch from Lucy’s nose.\u003c/p\u003e\n\u003cp\u003e“From here on out, you have no name. You’re nothing,” Lips said.\u003c/p\u003e\n\u003cp\u003eLucy was angry. She felt duped, but she didn’t know what to do. Lips reached out and pinched a strand of Lucy’s long white hair between her fingers.\u003c/p\u003e\n\u003cp\u003e“Until this hair is red, any Slut can tell you what to do. You’re our slave, and you do whatever we tell you to. Got it?”\u003c/p\u003e\n\u003cp\u003eLucy was watching Lips’s thin lips wrinkle as she talked. She wanted to split them.\u003c/p\u003e\n\u003cp\u003e“GOT IT?”\u003c/p\u003e\n\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003e“Not ‘you guess.’ Do you got it?”\u003c/p\u003e\n\u003cp\u003eLucy took a deep breath.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You don’t talk back, you don’t resist, and you do not put your hands on anyone. You obey without question. Got it?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Lucy was quick to say.\u003c/p\u003e\n\u003cp\u003e“Good,” Lips said. She snapped her fingers. Someone threw a scrub brush at Lucy. It bounced off her chest and fell to the ground. “Pick it up.”\u003c/p\u003e\n\u003cp\u003eLucy lowered herself slowly, and picked up the scrub brush.\u003c/p\u003e\n\u003cp\u003e“That’s how you earn your keep around here, slave. You never let go of it.”\u003c/p\u003e\n\u003cp\u003eLucy stared back at Lips. She was thinking how she should demand her clothes and walk out right now, just cut her losses. Coward. Will’s voice was in her head again.\u003c/p\u003e\n\u003cp\u003e“What are you looking at me for, white hair? Don’t look at me. Don’t look at any Slut unless you are instructed to,” Lips said.\u003c/p\u003e\n\u003cp\u003eLucy looked down. She could do this. If they had all done it, then she could do it too. They need me to prove myself, she thought. She had to try her best. She would work hard. She’d show them that they couldn’t break her.\u003c/p\u003e\n\u003cp\u003e“Give me your scrub brush,” a girl said, stepping out from the circle.\u003c/p\u003e\n\u003cp\u003eLucy extended her brush to the girl.\u003c/p\u003e\n\u003cp\u003e“What the hell are you doing?” Lips shouted.\u003c/p\u003e\n\u003cp\u003e“I—She said to …”\u003c/p\u003e\n\u003cp\u003e“And I said never let go of your brush! Are you thick?”\u003c/p\u003e\n\u003cp\u003e“And I said give me your brush!” the other girl said. “You gotta do what I say.”\u003c/p\u003e\n\u003cp\u003eLucy pulled the brush back. The Sluts ooh’d and shook their heads like Lucy had just spat in her face.\u003c/p\u003e\n\u003cp\u003e“You’re gonna pay for that,” the girl said.\u003c/p\u003e\n\u003cp\u003e“Damn,” another Slut said. “Making enemies on your first day.”\u003c/p\u003e\n\u003cp\u003e“What do you think of our new slave, ladies?” Lips clamped her hand down on the back of Lucy’s neck, and the pain made her wince. “I don’t think she’s gonna make it.”\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eHILARY SAT ON THE BLEACHERS IN THE GYM, in the same spot she’d always sat when Sam still ran Varsity. But now Terry, the new leader of Varsity, sat by her side. She looked out at the gym, and it looked different. The mountain of food that had always cascaded down the bleachers on the other side of the room was now a neat stack of supplies that needed to be moderately rationed. With Terry in charge, the combat training areas of the gym floor had been scaled back and replaced with a lounge, and a small library of books on loan from the Nerds. The Varsity boys still played their games, there was a lively game of half court basketball across the gym from Hilary, and their sneakers squeaked like a family of chipmunks.\u003c/p\u003e\n\u003cp\u003e“Hilary, I know how much the Pretty Ones mean to my guys,” Terry said. “We’re all on the same team. I don’t want to change anything about that.”\u003c/p\u003e\n\u003cp\u003e“How come I don’t believe you?” she said.\u003c/p\u003e\n\u003cp\u003eTerry shrugged. Hilary’s tongue flicked over the back of her right cuspid. The superglue that held it in place was bitter. She had to stop messing with it or she risked popping it out of place. It had become a bad habit when she got anxious.\u003c/p\u003e\n\u003cp\u003e“This morning, Anthony told me that I wasn’t allowed to take my regular morning swim anymore,” Hilary said. “He said I needed to talk to you. And just now, I was told by three of your guys that I needed to pack up my things because my room is now a ‘date’ room, whatever that is.”\u003c/p\u003e\n\u003cp\u003e“We have so many couples, it always seemed unfair to me that none of them got a chance to spend any time alone together,” Terry said. “Now there’ll be a schedule posted and anybody will be able to sign up and have it as a place to do dinner and a movie or something.”\u003c/p\u003e\n\u003cp\u003e“Yes, but it’s my room,” Hilary said. “It’s always been my room.”\u003c/p\u003e\n\u003cp\u003e“It’s been your room since Sam was in charge,” he said, his voice staying cool. “Now that he’s not in play, there’s no reason why you should have anything more than any other Pretty One. There’s plenty of cots open in the girls’ locker room.”\u003c/p\u003e\n\u003cp\u003eHilary flicked her tongue across her tooth.\u003c/p\u003e\n\u003cp\u003e“Cots,” she said.\u003c/p\u003e\n\u003cp\u003e“I’m going to need you to be a team player, all right?”\u003c/p\u003e\n\u003cp\u003eHilary’s mind was racing for an angle, but she had nothing.\u003c/p\u003e\n\u003cp\u003e“I really hate that you’re gay,” she finally said.\u003c/p\u003e\n\u003cp\u003eTerry chuckled. “I know you do.”\u003c/p\u003e\n\u003cp\u003eTerry slapped her on the knee and walked down the bleachers.\u003c/p\u003e\n\u003cp\u003eWhen she’d told Terry that the Pretty Ones would back his move to take over, her plan had been to seduce him. She had no idea he would come out of the closet days later, and even less of a clue that Varsity wouldn’t care one bit. It was more than they didn’t care. They seemed to like him more. It was as if they wanted the polar opposite of Sam, and Terry fit that perfectly. He wanted to transform Varsity’s image, to undo all the damage he said Sam had done. He said they didn’t need to be hated and feared anymore. That was all Sam. Everything bad about Varsity was Sam’s fault, not theirs. Now was their chance for a fresh start, to make friends with other gangs instead of enemies. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-12.html","bookId":1723,"creation":"Oct 5, 2019 10:09:06 AM","modification":"Oct 5, 2019 10:09:06 AM"}
