{"id":68355,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe oily girls began to caress his shirtless body. One kissed circles on the skin of his neck, while the other whispered filthy promises in his ear. More objects rained down and struck the beach, kicking up more sand. The sand spray kicked up into the air, but it didn’t fall back down, it hung in the air all around him. He reached out above his head, and swept his hand through the suspended sand, feeling it fall away at his touch.\u003c/p\u003e\n\u003cp\u003e“Where were you right then?” one of the girls said.\u003c/p\u003e\n\u003cp\u003eGates turned to her. They weren’t on the beach anymore, and they weren’t lying down.\u003c/p\u003e\n\u003cp\u003e“What?” Gates said.\u003c/p\u003e\n\u003cp\u003eIt was no longer daytime; it was night, the sky was black, and he was in Pruitt’s backyard, where tangled Christmas lights had been draped all through the branches of a barren winter tree in the center of the yard. The girls from the beach stared at him, annoyed, and fully dressed, and holding plastic champagne flutes.\u003c/p\u003e\n\u003cp\u003e“Where were you right then?” one of them said again.\u003c/p\u003e\n\u003cp\u003e“On a beach,” Gates said.\u003c/p\u003e\n\u003cp\u003e“Why are you acting so weird?”\u003c/p\u003e\n\u003cp\u003eWhen he looked back at them, their heads looked like fleshy marshmallows with black dots for eyes and no noses or mouths.\u003c/p\u003e\n\u003cp\u003e“Damn, girls. What happened to your faces?” he said.\u003c/p\u003e\n\u003cp\u003e“You like it?” one of them said. The area near her mouth seemed to pulse as she spoke, but he heard her quite clearly.\u003c/p\u003e\n\u003cp\u003eHe wasn’t sure if he liked it. Their heads were structureless blobs, but on the other hand, their skin was beautiful. It was luscious and healthy. He could see the hint of bluish veins under the veil of their delicate skin, and it made him want to touch their soft, puffy heads.\u003c/p\u003e\n\u003cp\u003e“What do you kiss with?” he said.\u003c/p\u003e\n\u003cp\u003e“We don’t kiss. Straight to business,” the other one said.\u003c/p\u003e\n\u003cp\u003eHe nodded. “You girls are cool.”\u003c/p\u003e\n\u003cp\u003e“Gates! You hear about the new hat?” Fowler said.\u003c/p\u003e\n\u003cp\u003eFowler was walking across the yard toward him, holding a plain cardboard box in his hands.\u003c/p\u003e\n\u003cp\u003e“What new hat?” Gates said. The blobby-headed girls were gone, but he’d already forgotten them.\u003c/p\u003e\n\u003cp\u003e“A French fashion designer came up with the perfect hat,” Fowler said.\u003c/p\u003e\n\u003cp\u003e“What do you mean perfect?”\u003c/p\u003e\n\u003cp\u003e“The design of it is so perfect that it makes anyone who wears it look the best they could possibly ever look. It doesn’t even matter what other clothes you’re wearing, you put it on and poof, immediately you’re better-looking than you’ve ever been.”\u003c/p\u003e\n\u003cp\u003e“It’s a magic hat?”\u003c/p\u003e\n\u003cp\u003e“No bro, it’s scientific,” Fowler said. “Just looking at the hat releases all this stuff in your brain.”\u003c/p\u003e\n\u003cp\u003e“But how?”\u003c/p\u003e\n\u003cp\u003e“There’s PDFs on their website; you can read all the research.”\u003c/p\u003e\n\u003cp\u003e“That rules so hard,” Gates said. “How much is the hat?”\u003c/p\u003e\n\u003cp\u003e“Free.”\u003c/p\u003e\n\u003cp\u003e“You have it in the box?” Gates said, pointing to the box in Fowler’s hand.\u003c/p\u003e\n\u003cp\u003eFowler grinned. “You’re never going to be the same, bro.”\u003c/p\u003e\n\u003cp\u003eHe pulled the top off the box, and inside was a green felt hat, with a pinched ridge running down the top, a baseball cap bill in the back, and three drops of white paint spilled on its front.\u003c/p\u003e\n\u003cp\u003e“Are you sure that’s perfect?” Gates said.\u003c/p\u003e\n\u003cp\u003e“Just put it on, dude.”\u003c/p\u003e\n\u003cp\u003eGates took it out of the box and pulled it onto his head.\u003c/p\u003e\n\u003cp\u003eInstantly, he jolted with pleasure. It felt like his whole body was a tongue, the world was made of ice cream. He began to grow taller than everyone else. Girls came running out of the bushes, tearing their shirts off at the sight of him.\u003c/p\u003e\n\u003cp\u003e“Oh my God, Gates. There’s no one better,” he heard Lark say.\u003c/p\u003e\n\u003cp\u003ePeople were literally breaking out in tears when they saw how good he looked. He said his own name, “Gates.” The crowd of girls encircling him simultaneously achieved orgasm. He said it again. “Gates.” They fell to their knees, bodies quivering.\u003c/p\u003e\n\u003cp\u003eHis fists grew to the size of boulders. He raised them up into the air and the girls all ran back to the bushes. He smashed his hulking fists into the ground, and made hot-tub-sized dents in the earth.\u003c/p\u003e\n\u003cp\u003e“Gates!” he screamed, and he launched into the air. Gates soared over all of Denton, spinning and twirling his way between buildings and over the trees, trying to swat all the birds out of the sky. He willed himself to go up, and he soared higher and higher, until the air got cold and thin. It pressed on his chest. He felt one with the wind, in complete control, but as soon as he thought that, he began to drift down toward the ground.\u003c/p\u003e\n\u003cp\u003eHe tried to will himself higher again, but his powers of flight had abandoned him. He looked down at Denton, and saw that his slow descent was lowering him down to Capitol Boulevard, where most of the car dealerships were. His feet touched the ground in a cracked and overgrown parking lot, behind the local mini golf course. There were no cars, but five townie kids stood smoking weed by the light post. Their clothes were dirty, and two of them were shivering. They listened to a baseball game on a portable radio.\u003c/p\u003e\n\u003cp\u003eThe weed smelled good. He wanted some.\u003c/p\u003e\n\u003cp\u003e“Hey, can I get a puff of that?” Gates asked.\u003c/p\u003e\n\u003cp\u003eOne of the kids, who had droopy eyes and a dusting of facial hair over his plump face, passed the roach to Gates. He took a long drag, and it tasted like an orange Creamsicle.\u003c/p\u003e\n\u003cp\u003e“Where’d you get that hat?” one of the shivering kids asked him.\u003c/p\u003e\n\u003cp\u003eThey were all eyeing it. The vibe had changed in an instant. He knew with absolute certainty that these townies all wanted his hat.\u003c/p\u003e\n\u003cp\u003e“You can’t have it!” Gates yelled.\u003c/p\u003e\n\u003cp\u003e“Get that hat!” the droopy-eyed one yelled.\u003c/p\u003e\n\u003cp\u003eGates ran. He tried to fly but he couldn’t. He sprinted across the cracked asphalt, and over the tufts of grass and weeds that sprouted out from the cracks.\u003c/p\u003e\n\u003cp\u003eHe looked back and saw that all the townies had vanished and only one person pursued him—his little brother Colton, with a bullet hole through his forehead.\u003c/p\u003e\n\u003cp\u003eGates fell from the shock, and Colton was on him in a flash. Colton grabbed him and rolled him onto his back. Colton was never that strong before. Broken chunks of asphalt prodded Gates in his back. His brother straddled Gates’s chest and pushed all the air out of him. His lungs were stuck empty. Colton wore his black sunglasses, and Gates couldn’t see his eyes, but his face was scrunched up in contempt. The wet rim of the bullet hole in his forehead glinted in the moonlight. Colton opened his dead, gray mouth and cold saliva came pouring out of it, like lemonade from a glass pitcher. It splashed over Gates’s face and made him cough. The saliva began to shoot out of Colton’s mouth like a fire hose, pounding down into Gates’s head. Through the spraying saliva he could see how furious, how anguished Colton was. The saliva fire hose became a saliva water cannon as it began to blast down into his face so hard that he felt his upper lip and his eyelids begin to tear away.\u003c/p\u003e\n\u003cp\u003eGates woke up on the floor of the bus. It was only a dream.\u003c/p\u003e\n\u003cp\u003e“Oh fuck, oh fuck, oh fuck,” he said, touching his face to make sure it was still there.\u003c/p\u003e\n\u003cp\u003eThe back of the bus was dark. The light of the main room shined through the shattered windshield, but couldn’t make it all the way to the back of the bus. He pulled himself to his feet and kicked his way through food wrappers and empty soda bottles, and dirty underwear on the floor. He didn’t bother changing into fresh clothes for the day or gathering his toiletries for the shower. He wanted to get out of the bus and away from that nightmare immediately.\u003c/p\u003e\n\u003cp\u003eHe left the bus for the brightly lit front room of the processing facility. He had to squint at first to handle the light. Most Saints weren’t up yet; it was 6:17 a.m. There were a few shuffling through the room, trying to yawn the sleep away.\u003c/p\u003e\n\u003cp\u003eIn one corner of the room there were two gaming chairs, the kind that rock back and forth, positioned in front of a flat-screen TV, and Will sat in one of them, playing a racing game.\u003c/p\u003e\n\u003cp\u003eNice, Will was already up. Gates felt the tension of his nightmare washing away. He and Will always had fun together.\u003c/p\u003e\n\u003cp\u003eGates ambled over, and plopped himself down in the free chair. He and Will high-fived, without either of them having to take their eyes off the screen to do it. They’d gamed so much together in the last few nights since the party that they might as well have slept in those chairs. He looked Will up and down. He wasn’t sure but he thought Will was wearing the same clothes as the night before.\u003c/p\u003e\n\u003cp\u003e“Have you been up all night?” Gates said.\u003c/p\u003e\n\u003cp\u003e“Yup,” Will said, his eyes locked on the screen.\u003c/p\u003e\n\u003cp\u003e“Is there a video game championship coming up that I don’t know about?”\u003c/p\u003e\n\u003cp\u003e“Ha. No. I just kept playing.”\u003c/p\u003e\n\u003cp\u003e“Wait. Should we have a video game championship?”\u003c/p\u003e\n\u003cp\u003e“We could,” Will said.\u003c/p\u003e\n\u003cp\u003e“I actually can’t believe we haven’t done it already. Fuck, it could be so awesome. We could go all night. What games do you think?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“One fighting game, one-shooter for death matches, and something that has split-screen multiplayer. Right? That’s not bad. That covers a lot of bases.”\u003c/p\u003e\n\u003cp\u003e“Sure,” Will said.\u003c/p\u003e\n\u003cp\u003e“You’re not excited about it? Look at you, you’re mister gamer.”\u003c/p\u003e\n\u003cp\u003e“No, I am, it sounds like a good time.”\u003c/p\u003e\n\u003cp\u003e“You all right?” Gates said.\u003c/p\u003e\n\u003cp\u003eWill didn’t answer, but Gates knew.\u003c/p\u003e\n\u003cp\u003e“It’s about that Slut girl from the party?”\u003c/p\u003e\n\u003cp\u003eWill shrugged.\u003c/p\u003e\n\u003cp\u003e“Oh, come on. She’s one girl. Who cares?”\u003c/p\u003e\n\u003cp\u003e“I like her.”\u003c/p\u003e\n\u003cp\u003eThere was something about the way Will said those words that made Gates pause. It wasn’t their usual good time bullshitting kind of talk, Will meant what he said, and Gates could feel how deep his emotion ran when he said it.\u003c/p\u003e\n\u003cp\u003eHe wanted to cheer Will up, Will had been his partner in crime, a fellow fun-hunter, and he didn’t like seeing him so torn up like this. He knew Will thought this girl was really important, and in truth she probably wasn’t. As far as Will had told him, this girl had done nothing but turn him down and lead him on, and Will kept going back for more like a loyal puppy dog. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-32.html","bookId":1723,"creation":"Oct 5, 2019 10:09:06 AM","modification":"Oct 5, 2019 10:09:06 AM"}
