{"id":68369,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“We don’t know anything until you scan your thumb. It could be anything. Maybe you got hit,” Lucy said.\u003c/p\u003e\n\u003cp\u003e“I told you I didn’t get hit.”\u003c/p\u003e\n\u003cp\u003e“I don’t know, Will. Maybe the air’s too dry.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t buying it. And he knew she wasn’t either, but she kept trying to keep him calm.\u003c/p\u003e\n\u003cp\u003e“It can’t be the virus,” she said. “That just doesn’t make sense.”\u003c/p\u003e\n\u003cp\u003eUnless Will’s body was just done with puberty. He guessed it was a possibility. He hadn’t grown any taller in months. No matter what the answer was, he still might have to leave school. He should have been thrilled to finally get to leave. To have this all end. But, not now. Not when he’d just gotten Lucy back.\u003c/p\u003e\n\u003cp\u003eThe two of them slowed. There was a corpse on the floor ahead of them, a boy. His legs were splayed, with one shoe off and one shoe on. The white floor around him was a mess of smeared blood. It wasn’t until they were closer that they saw where all that blood had come from. The whole front of the boy’s neck was gone. The flesh had been torn away, and Will could see the front of his spine nestled into the red mulch of shredded neck meat. Above the ragged wound was a face they knew all too well.\u003c/p\u003e\n\u003cp\u003eSam’s mouth was open. His eyes were too. They had gone gray. His face was twisted in agony. It was a painful death. Horrible. But Will guessed it was inevitable.\u003c/p\u003e\n\u003cp\u003e“Oh my god,” Lucy said, staring down at Sam. “Who would do that?”\u003c/p\u003e\n\u003cp\u003eWill searched inside himself for the satisfaction at seeing Sam destroyed and he couldn’t find it.\u003c/p\u003e\n\u003cp\u003e“We should keep moving,” Lucy said, and pulled Will forward.\u003c/p\u003e\n\u003cp\u003e“Wait,” Will said, staying put. He took off his oversized sweatshirt and flung it out like a bed sheet. He let it fall across Sam from his chest to the top of his head. He turned to Lucy and gave her a nod. “Okay.”\u003c/p\u003e\n\u003cp\u003eThey ran for the open door to the quad. Outside, it was raining hard. The air smelled clean. Will and Lucy rushed into the quad. It was one giant square of mud. Will scanned the razor wire perimeter, three floors up, and spotted an adult standing on top of the east wall.\u003c/p\u003e\n\u003cp\u003e“Thumb check!” Lucy yelled as loud as she could.\u003c/p\u003e\n\u003cp\u003eThe adult lowered the boxy machinery of the disembodied thumb scanner. It dangled from a long pole extended over the razor wire. As they ran for the wall, the figure above became clearer. Rain splashed off his black motorcycle helmet. It was Sam’s father. The thumb scanner spun as Sam’s dad lowered it. When it was ten feet above them, Will could see that the scanner was sealed up in a ziplock freezer bag.\u003c/p\u003e\n\u003cp\u003eWill unzipped the blue-green seal, wiped his hand on his jeans, and stuck his hand into the bag. He planted his thumb on the scanner.\u003c/p\u003e\n\u003cp\u003eThe rain poured.\u003c/p\u003e\n\u003cp\u003e“You’re transitioning,” the man shouted down without the benefit of his amp.\u003c/p\u003e\n\u003cp\u003eWill shook his head.\u003c/p\u003e\n\u003cp\u003e“No,” he said, his voice barely a rasp. “It can’t be right. This doesn’t make sense.”\u003c/p\u003e\n\u003cp\u003eIf there was pain in Lucy’s face, it was only for a second. A storm gust blew it away. Her hair whipped in her face, and she looked up to the sky.\u003c/p\u003e\n\u003cp\u003e“He has to be lifted out!” Lucy yelled.\u003c/p\u003e\n\u003cp\u003e“No,” Sam’s father said. He reeled the scanner back up.\u003c/p\u003e\n\u003cp\u003e“What do you mean?” she shouted. “He has to graduate! You have to let him out.”\u003c/p\u003e\n\u003cp\u003eSam’s father pointed a gloved hand at Will.\u003c/p\u003e\n\u003cp\u003e“I know who you are, kid,” the man said. “You want out? You bring me Sam, alive. That’s the only way you’re getting out.”\u003c/p\u003e\n\u003cp\u003e“Will’s going to die if he doesn’t—”\u003c/p\u003e\n\u003cp\u003eWill put his hand out to stop Lucy short.\u003c/p\u003e\n\u003cp\u003e“No problem!” Will said.\u003c/p\u003e\n\u003cp\u003eLucy looked at Will like he’d gone crazy.\u003c/p\u003e\n\u003cp\u003e“Just be here waiting when we show,” Will shouted up. The man turned away from the quad. The conversation was over. For now.\u003c/p\u003e\n\u003cp\u003e“Will, what are you doing?” Lucy said under her breath.\u003c/p\u003e\n\u003cp\u003eWill shrugged.\u003c/p\u003e\n\u003cp\u003e“Worth a try.”\u003c/p\u003e\n\u003cp\u003eLucy and Will stared at Sam’s body. They had propped his blueing body up to sitting, against the lockers. They’d stripped him of his blood-soaked shirt and dressed him in the oversized sweatshirt Will had worn. They’d stuffed their own socks into the gaping wound in his neck so that the blood wouldn’t seep into the sweatshirt fabric. It was the best they could manage in the time they had, but he still didn’t look close to alive.\u003c/p\u003e\n\u003cp\u003e“This isn’t going to work,” Lucy said. “They’ll see he’s dead.”\u003c/p\u003e\n\u003cp\u003e“No, they won’t.”\u003c/p\u003e\n\u003cp\u003e“You can clearly see he has no neck! Oh god, and they aren’t going to let you out,” Lucy said, going nearly as pale as Sam.\u003c/p\u003e\n\u003cp\u003e“Hold on,” Will said and he knelt down beside Sam. Will took up both ends of the hood’s drawstring and cinched it tight. The hood closed around Sam’s face in a perfect oval, like an Eskimo. “There. What about that?”\u003c/p\u003e\n\u003cp\u003eLucy tilted her head slightly and studied Sam. “Actually,” she said, the tension in her face easing slightly. “That’s not bad.”\u003c/p\u003e\n\u003cp\u003eWill stood and overcompensated with a big smile. “See? I told you, it’s going to work. I’m gonna get to leave.”\u003c/p\u003e\n\u003cp\u003eWill’s stomach dropped out of him when he said those words.\u003c/p\u003e\n\u003cp\u003e“Okay,” Lucy said. He didn’t want her to say “okay.” He wanted her to say, “Don’t go! Never leave me!”\u003c/p\u003e\n\u003cp\u003e“I don’t want to leave you,” he said.\u003c/p\u003e\n\u003cp\u003e“You have to.”\u003c/p\u003e\n\u003cp\u003e“It’s too soon.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“I just got you back,” he said.\u003c/p\u003e\n\u003cp\u003e“I know. But we don’t have a choice.”\u003c/p\u003e\n\u003cp\u003e“How are you so calm about this all the sudden?” Will said.\u003c/p\u003e\n\u003cp\u003eLucy’s face was unaffected, flat, still.\u003c/p\u003e\n\u003cp\u003e“I’m just trying to keep my shit together,” she said. “The second you leave, I’m going to lose it.”\u003c/p\u003e\n\u003cp\u003eWill forced himself to slow his breathing. He nodded. She was right. There was no point in crying about it now. Will went in for a kiss, and he made sure to make it count. It would have to tide him over for a year if this ridiculous plan worked. And if they failed, this would be the last time he would kiss her without a death sentence hanging over his head. He kissed her slowly; he wanted to feel every moment of it. Her lips pushed back with a feather’s weight. Lucy pulled away.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Will said.\u003c/p\u003e\n\u003cp\u003eLucy looked away. “We shouldn’t waste any more time.”\u003c/p\u003e\n\u003cp\u003eHe knew what she really meant. The more they lingered, clutching each other, touching and kissing, the harder they were making it to say good-bye. Lucy moved to Sam’s body. Will sighed and followed. He bent down and slung one of Sam’s limp arms over his shoulders. Lucy did the same, and they lifted his scarecrow corpse up. They looked like Sam’s best friends, each with one of his arms over their shoulders, as they hurried him down the hall. Sam’s dead feet dragged on the floor. They threw open the doors to the quad, to the wall of rain beyond.\u003c/p\u003e\n\u003cp\u003eThey charged onto the quad. Sam’s toes dragged through the mud. They carried Sam along as fast as they could. The rain was pounding now, making a haze of gray that was difficult to see through. Sam’s head bobbled.\u003c/p\u003e\n\u003cp\u003e“He’s unconscious!” Will screamed, twisting Sam’s head up toward the roof ledge to reveal Sam’s face. “He needs medical attention right away!”\u003c/p\u003e\n\u003cp\u003eThey stood in the middle of the quad where the crane would meet them. They stared up and shielded their eyes from the falling raindrops.\u003c/p\u003e\n\u003cp\u003e“Come on, man!” Will shouted to Sam’s father, who now held a pair of binoculars to his eyes, under his flipped visor. Will prayed that he was satisfied with what he saw. The man took his time with his decision.\u003c/p\u003e\n\u003cp\u003e“You promised, now do it!” Lucy shouted up to the sky.\u003c/p\u003e\n\u003cp\u003eSam’s father raised his arm to someone above they couldn’t see. The graduation harness lowered into view, attached to the crane arm high above. The harness twisted on the crane cable.\u003c/p\u003e\n\u003cp\u003e“Just strap Sam in,” his father said. “We’ll do you after.”\u003c/p\u003e\n\u003cp\u003e“It’s both of us or nothing! That’s the only way it happens!” Will shouted.\u003c/p\u003e\n\u003cp\u003eThe harness finally dangled low enough for them to grab it. Will bear-hugged Sam’s corpse, so Lucy was free to strap Will in, one limb at a time.\u003c/p\u003e\n\u003cp\u003e“You’re ready,” Lucy said.\u003c/p\u003e\n\u003cp\u003eWill wasn’t sure if it was tears or rain on her face.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Will said because he thought he should. “I’m not going to abandon you, okay? I’ll find a way to help from out there. I promise. You know that, right? I swear to—”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Will,” she said.\u003c/p\u003e\n\u003cp\u003e“You’re sorry? Why are you sorry?”\u003c/p\u003e\n\u003cp\u003e“I should’ve gone with you,” she said, her voice more frantic by the second. “I should’ve gone with you to live in the elevator. We could’ve made it work. We would’ve had more time. You never would have teamed up with Gates.… I never would’ve—”\u003c/p\u003e\n\u003cp\u003e“Ssh,” Will said. “Don’t. It’s okay …”\u003c/p\u003e\n\u003cp\u003e“We could’ve had more time,” she said, her mouth down-turned in sadness. “Oh, Will.”\u003c/p\u003e\n\u003cp\u003eLucy went in for the kiss. Her lips got within an inch of his before he was tugged up into the air. The harness bit into his flesh. Sam’s body was ridiculously heavy, and Will had to squeeze with all his might.\u003c/p\u003e\n\u003cp\u003e“Good-bye!” Lucy shouted up.\u003c/p\u003e\n\u003cp\u003eWill heard a guttural rumble from the hall. The revving of an engine. He knew who was coming.\u003c/p\u003e\n\u003cp\u003e“You have to go!” he shouted at her.\u003c/p\u003e\n\u003cp\u003e“What?” she called up.\u003c/p\u003e\n\u003cp\u003eGates came roaring onto the quad on the motorcycle. Lucy broke into a run.\u003c/p\u003e\n\u003cp\u003e“Colton!” Gates screamed when he saw Will in the air. He poured on the throttle. Gates stood on the pedals, and reached up for Will as his bike zoomed by underneath. His fingers barely grazed Will’s right foot. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-46.html","bookId":1723,"creation":"Oct 5, 2019 10:09:06 AM","modification":"Oct 5, 2019 10:09:06 AM"}
