{"id":68331,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You got something to say, Sharpe?” Sam said. “’Cause I hope it’s not bitching. I pray to God, it’s not bitching. I’m praying that all of you didn’t just come down here to piss and moan …” He got louder now to scare them. “… when I’m in the middle of working up a game plan for the drop!”\u003c/p\u003e\n\u003cp\u003eNobody moved. They didn’t shuffle. They didn’t flinch. They were solid. It made Sam feel crazy.\u003c/p\u003e\n\u003cp\u003e“You’re all done, man,” Terry said. “Nobody wants to hear you barking anymore, and we damn sure don’t need your game plans. I’ll be giving the orders from here on out—”\u003c/p\u003e\n\u003cp\u003eSam had heard enough. He pointed at Terry and screamed his words.\u003c/p\u003e\n\u003cp\u003e“What do you think this asshole’s going to do for you?” he said to the rest of Varsity. “All I’ve ever seen him do is sit on his ass and take. He hasn’t run shit since he ran the basketball team into the ground against Fairview. And lemme tell you something, leading Varsity isn’t about running a gang …,” Sam said, pointing his chin up toward the ceiling. “It’s about running a school. And that’s something you know nothing about. None of you could survive without me.”\u003c/p\u003e\n\u003cp\u003e“We’ll take our chances,” Terry said and looked to the others. “We got nothin’ to lose. Thanks to you. Isn’t that right?”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Anthony said. He was backed by more that’s rights and yeahs around the circle.\u003c/p\u003e\n\u003cp\u003e“Is this about the gun incident?” Sam said. “You’re gonna give up on me just ’cause of that? You can’t be that stupid. Think of how it’ll look to everybody. Without me, they’ll know you’re weak. You’ll never get respect back—”\u003c/p\u003e\n\u003cp\u003e“It’s not about the gun thing.” Terry laughed. Others laughed too. “This has been a long time coming.”\u003c/p\u003e\n\u003cp\u003e“Oh, is that right?”\u003c/p\u003e\n\u003cp\u003eTerry nodded. “Yeah, that’s right. Doubt you noticed, but no other gang leader in school talks to their people the way you do. I’d even say those leaders like the people in their gang. Do you like us, Sam?”\u003c/p\u003e\n\u003cp\u003eSam could feel his top lip tightening, pulling back to reveal his teeth in a sickened scowl. He wasn’t going to honor that question with a response. It was irrelevant, exactly the kind of Sesame Street crap that was going make Terry fail as a leader.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought,” Terry said. “And maybe that would’ve been okay, if you could’ve kept things going, but you lost all our food because you were too obsessed with David.”\u003c/p\u003e\n\u003cp\u003e“That’s not what happened,” Sam said.\u003c/p\u003e\n\u003cp\u003e“It is what happened, bro. It’s exactly what happened. And then you disappeared for two weeks when we needed you most. I don’t know what the hell you were doing. Collecting guns with no bullets, I guess.”\u003c/p\u003e\n\u003cp\u003eLaughter bounced off every wall. It went on way too long, especially when what Terry said wasn’t funny.\u003c/p\u003e\n\u003cp\u003e“Then, you show up again and expect us to do what you say? You think you can swim in our pool?” Terry said. “Think again.”\u003c/p\u003e\n\u003cp\u003eSam scowled. He’d listened. Now it was his turn. He had one last weapon.\u003c/p\u003e\n\u003cp\u003e“So, you’re really gonna take your chances without the Pretty Ones? ’Cause I’ll tell Hilary to walk. And every one of your girls will go with her. I’ll see if maybe some other gang is looking for a little pussy infusion.” Sam turned away from Terry to face the rest of the gang. “Is that the kind of chance you boys are ready to take now? Losing your women just ’cause this guy’s got big ideas about what he thinks should happen?”\u003c/p\u003e\n\u003cp\u003eTerry, the dumbshit, didn’t have an answer for that. And Varsity was waiting. Sam had hit them where it hurt. He smiled. They still belonged to him.\u003c/p\u003e\n\u003cp\u003e“The Pretty Ones aren’t going anywhere.”\u003c/p\u003e\n\u003cp\u003eThe Varsity line parted for Hilary. She stood beside Terry. Close enough to touch. Too close.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” Sam said. He should’ve kept his mouth shut and stayed strong, but he couldn’t help himself. Hilary had said horrible, stupid things about how much she hated him before. But he didn’t think she’d ever pull this shit on him. Didn’t she know what he’d do to her? Did they all forget?\u003c/p\u003e\n\u003cp\u003e“Nobody’s scared of you. Not anymore,” Hilary said. “So, just give it a rest.”\u003c/p\u003e\n\u003cp\u003eTerry nodded at Hilary. How long had they been screwing? Sam wondered. Did Terry know that Sam had knocked her tooth out? Terry thought he had a prize, but all he had was a toothless whore. Fuck him. Fuck ’em both. He’d save that little nugget of info for the right time later, when he could make the most of it.\u003c/p\u003e\n\u003cp\u003e“You got two choices,” Terry said. “You can fall in line, behind me, or you can leave. Finish up your swim, think about it. We’ll be upstairs, getting ready for the drop.”\u003c/p\u003e\n\u003cp\u003eSam was so hot with rage he thought the water around him might start to boil. He stayed perfectly still, never breaking his stare from Hilary. Her eyes had drifted down. Terry waved for the gang to leave, and they all stepped away from the pool, heading for the exit.\u003c/p\u003e\n\u003cp\u003e“Oh, and don’t think about stirring up shit behind my back,” Terry said. “It’ll just go in one ear and then into mine. Everybody’s on board with this, Sam. And none of us like you.”\u003c/p\u003e\n\u003cp\u003eTerry followed Varsity out. The door swung shut and clicked. Sam stood in four feet of water, alone, with nothing. He chewed on his lip, hard enough to draw blood.\u003c/p\u003e\n\u003cp\u003eHe could fix this. The slight sway of water clapped against the pool walls. Something could put everything back to normal. In McKinley, you lived and died by your reputation. If Sam was going to set things right, and take control of the school again, he had to make people forget they ever saw him fall. Only one thing worked with these animals. Danny Liner proved it. Alan Woodward backed it up. It was what Terry didn’t have in him, and today Varsity would get a reminder. The whole school would see.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eWILL AND NINE OTHER LONERS PEERED AT the quad through the bent metal blinds of a first-floor classroom window. The gangs were starting to gather. They flowed in from every direction, and each gang was huge. No wonder they’d lost three Loners on the walk from the Stairs.\u003c/p\u003e\n\u003cp\u003e“Most people don’t even think there’s a Loner left in the school,” Mort said.\u003c/p\u003e\n\u003cp\u003e“That’s not true,” Will said.\u003c/p\u003e\n\u003cp\u003e“I heard the Freaks have eighty-seven.”\u003c/p\u003e\n\u003cp\u003e“Varsity’s still got a hundred guys, easy,” Ritchie said. “And they’re the biggest dudes in school.”\u003c/p\u003e\n\u003cp\u003e“Did you see Varsity at the last drop?” Will said. “They were totally disorganized.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, they’re not gonna make that mistake again,” Ritchie said. “Everybody’s gonna be on their A-game.”\u003c/p\u003e\n\u003cp\u003eBelinda poked her finger through the blinds and tapped on the glass softly. “Look at the Geeks, they’ve got a ton. So do the Skaters. Even the Saints are four times our size.”\u003c/p\u003e\n\u003cp\u003eAll eyes traveled to the Saints in the quad outside. They filled the wall where the Loners used to stand. They even had the white hair. This was their first food drop, and they looked uncomfortable. It reminded Will of the early days of the Loners, when they were first learning to work together as a gang.\u003c/p\u003e\n\u003cp\u003e“I’m just saying,” Mort said, “maybe we’re just better off being Scraps again. I mean, was it really that bad?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Will said. “It was that bad!”\u003c/p\u003e\n\u003cp\u003eThey were all looking at him now. It was time to do his speech. He’d been practicing it in his head during the whole walk to the quad. He wasn’t going to let what David built fall apart. The Loners were all that was left of David in Will’s life, and if he lost that, he’d have nothing.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat and rubbed his hands together. His mouth was dry.\u003c/p\u003e\n\u003cp\u003e“The other gangs are bigger, and the odds are against us,” Will said. “And now there’s only ten of us left. But ten is all we need. We don’t need the quitters. This is the core group, the originals. We did this once already. Nine Loners stood against a hundred Varsity and we won. We can do the impossible again.”\u003c/p\u003e\n\u003cp\u003eThe Loners seemed unmoved.\u003c/p\u003e\n\u003cp\u003e“There’s no army of Scraps to help us this time,” Mort said.\u003c/p\u003e\n\u003cp\u003e“And we don’t have David,” Ritchie said.\u003c/p\u003e\n\u003cp\u003e“We could just skip this one,” Belinda said.\u003c/p\u003e\n\u003cp\u003e“Guys,” Lucy said, “let Will finish.”\u003c/p\u003e\n\u003cp\u003eThe group hushed again. Will appreciated Lucy standing up for him, but he had nothing else planned. That was the full extent of his inspiring speech. His heart thumped in his chest. The Loners still waited for him to speak. This was far harder than David had made it look.\u003c/p\u003e\n\u003cp\u003e“Listen … I’m not stupid, I know you want to join other gangs,” Will said.\u003c/p\u003e\n\u003cp\u003eThey all looked away.\u003c/p\u003e\n\u003cp\u003e“I know we’ve had a lot of bad luck, and you all think we can’t make it without David. But it isn’t true. The Loners can go on, we can be big again. Just give me this one chance to prove to you that I can be your leader. One chance, that’s all I’m asking for. If we don’t get enough food to survive today, than you can all do whatever you want, go off and join another gang. If we fail today, then you’ll have every reason to. I wouldn’t even be mad. But that’s not what’s going to happen. We’re going to go out there, and fight like beasts, and take our share back to the Stairs.”\u003c/p\u003e\n\u003cp\u003eThey were all looking at him again.\u003c/p\u003e\n\u003cp\u003e“Please. One chance. What do you say?”\u003c/p\u003e\n\u003cp\u003eThe forty foot block of supplies hung from the orange crane, three stories above them. They’d lower it any moment now.\u003c/p\u003e\n\u003cp\u003eWill was filled with excitement and terror. All nine Loners stood behind him. They’d agreed. They’d put their trust in him. He couldn’t let them down.\u003c/p\u003e\n\u003cp\u003eWill’s hand went to his belt and clasped the T-shirt-wrapped handle of a plastic shiv he’d made by sharpening a toothbrush. He held it just for comfort. Just to know it was there. The plan was they were going to run in pairs, one to grab, one to defend, and they’d focus on the little stuff, the stuff other gangs dropped or couldn’t bother with. They’d run everything to Mort, who was stationed in a first-floor classroom with a window open. He’d stockpile everything, away from the danger of the quad. Will figured all the little grabs would add up. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-8.html","bookId":1723,"creation":"Oct 5, 2019 10:09:06 AM","modification":"Oct 5, 2019 10:09:06 AM"}
