{"id":7555,"no":39,"title":"Chapter 39","content":"39:1 [hgb]\u0026nbsp; 比 撒 列 用 蓝 色 ， 紫 色 ， 朱 红 色 线 作 精 致 的 衣 服 ， 在 圣 所 用 以 供 职 ， 又 为 亚 伦 作 圣 衣 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And of the blue, and purple, and scarlet, they made cloths of service, to do service in the holy place, and made the holy garments for Aaron; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from the needlework of blue and purple and red they made the robes used for the work of the holy place, and the holy robes for Aaron, as the Lord had given orders to Moses. \n\u003cbr\u003e39:2 [hgb]\u0026nbsp; 他 用 金 线 和 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 并 捻 的 细 麻 作 以 弗 得 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he made the ephod of gold, blue, and purple, and scarlet, and fine twined linen. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The ephod he made of gold and blue and purple and red and the best linen; \n\u003cbr\u003e39:3 [hgb]\u0026nbsp; 把 金 子 锤 成 薄 片 ， 剪 出 线 来 ， 与 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 用 巧 匠 的 手 工 一 同 绣 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they did beat the gold into thin plates, and cut it into wires, to work it in the blue, and in the purple, and in the scarlet, and in the fine linen, with cunning work. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Hammering the gold into thin plates and cutting it into wires to be worked into the blue and the purple and the red and the linen by the designer. \n\u003cbr\u003e39:4 [hgb]\u0026nbsp; 又 为 以 弗 得 作 两 条 相 连 的 肩 带 ， 接 连 在 以 弗 得 的 两 头 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; They made shoulderpieces for it, to couple it together: by the two edges was it coupled together. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they made two bands for joining its edges together at the top of the arms. \n\u003cbr\u003e39:5 [hgb]\u0026nbsp; 其 上 巧 工 织 的 带 子 和 以 弗 得 一 样 的 作 法 ， 用 以 束 上 ， 与 以 弗 得 接 连 一 块 ， 是 用 金 线 和 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 并 捻 的 细 麻 作 的 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the curious girdle of his ephod, that was upon it, was of the same, according to the work thereof; of gold, blue, and purple, and scarlet, and fine twined linen; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the beautifully worked band which went on it was of the same design and the same material, worked in gold and blue and purple and red and twisted linen-work, as the Lord gave orders to Moses. \n\u003cbr\u003e39:6 [hgb]\u0026nbsp; 又 琢 出 两 块 红 玛 瑙 ， 镶 在 金 槽 上 ， 仿 佛 刻 图 书 ， 按 着 以 色 列 儿 子 的 名 字 雕 刻 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they wrought onyx stones inclosed in ouches of gold, graven, as signets are graven, with the names of the children of Israel. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then they made the beryl stones, fixed in twisted frames of gold and cut like the cutting of a stamp, with the names of the children of Israel. \n\u003cbr\u003e39:7 [hgb]\u0026nbsp; 将 这 两 块 宝 石 安 在 以 弗 得 的 两 条 肩 带 上 ， 为 以 色 列 人 作 纪 念 石 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he put them on the shoulders of the ephod, that they should be stones for a memorial to the children of Israel; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; These he put on the ephod, over the arm-holes, to be stones of memory for the children of Israel, as the Lord had said to Moses. \n\u003cbr\u003e39:8 [hgb]\u0026nbsp; 他 用 巧 匠 的 手 工 作 胸 牌 ， 和 以 弗 得 一 样 的 作 法 ， 用 金 线 与 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 并 捻 的 细 麻 作 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he made the breastplate of cunning work, like the work of the ephod; of gold, blue, and purple, and scarlet, and fine twined linen. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The priest\u0027s bag was designed like the ephod, of the best linen worked with gold and blue and purple and red. \n\u003cbr\u003e39:9 [hgb]\u0026nbsp; 胸 牌 是 四 方 的 ， 叠 为 两 层 ， 这 两 层 长 一 虎 口 ， 宽 一 虎 口 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; It was foursquare; they made the breastplate double: a span was the length thereof, and a span the breadth thereof, being doubled. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; It was square and folded in two, as long and as wide as the stretch of a man\u0027s hand; \n\u003cbr\u003e39:10 [hgb]\u0026nbsp; 上 面 镶 着 宝 石 四 行 ， 第 一 行 是 红 宝 石 ， 红 璧 玺 ， 红 玉 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they set in it four rows of stones: the first row was a sardius, a topaz, and a carbuncle: this was the first row. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And on it they put four lines of stones: in the first line was a carnelian, a chrysolite, and an emerald; \n\u003cbr\u003e39:11 [hgb]\u0026nbsp; 第 二 行 是 绿 宝 石 ， 蓝 宝 石 ， 金 钢 石 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the second row, an emerald, a sapphire, and a diamond. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In the second, a ruby, a sapphire, and an onyx; \n\u003cbr\u003e39:12 [hgb]\u0026nbsp; 第 三 行 是 紫 玛 瑙 ， 白 玛 瑙 ， 紫 晶 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the third row, a ligure, an agate, and an amethyst. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In the third, a jacinth, an agate, and an amethyst; \n\u003cbr\u003e39:13 [hgb]\u0026nbsp; 第 四 行 是 水 苍 玉 ， 红 玛 瑙 ， 碧 玉 。 这 都 镶 在 金 槽 中 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the fourth row, a beryl, an onyx, and a jasper: they were inclosed in ouches of gold in their inclosings. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In the fourth, a topaz, a beryl, and a jasper; they were fixed in twisted frames of gold. \n\u003cbr\u003e39:14 [hgb]\u0026nbsp; 这 些 宝 石 都 是 按 着 以 色 列 十 二 个 儿 子 的 名 字 ， 仿 佛 刻 图 书 ， 刻 十 二 个 支 派 的 名 字 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the stones were according to the names of the children of Israel, twelve, according to their names, like the engravings of a signet, every one with his name, according to the twelve tribes. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; There were twelve stones for the twelve tribes of Israel; on every one the name of one of the tribes of Israel was cut, like the cutting of a stamp. \n\u003cbr\u003e39:15 [hgb]\u0026nbsp; 在 胸 牌 上 ， 用 精 金 拧 成 如 绳 子 的 链 子 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made upon the breastplate chains at the ends, of wreathen work of pure gold. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And on the bag they put gold chains, twisted like cords. \n\u003cbr\u003e39:16 [hgb]\u0026nbsp; 又 作 两 个 金 槽 和 两 个 金 环 ， 安 在 胸 牌 的 两 头 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made two ouches of gold, and two gold rings; and put the two rings in the two ends of the breastplate. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they made two gold frames and two gold rings, the rings being fixed to the ends of the priest\u0027s bag; \n\u003cbr\u003e39:17 [hgb]\u0026nbsp; 把 那 两 条 拧 成 的 金 链 子 穿 过 胸 牌 两 头 的 环 子 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they put the two wreathen chains of gold in the two rings on the ends of the breastplate. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they put the two twisted chains on the two rings at the ends of the priest\u0027s bag; \n\u003cbr\u003e39:18 [hgb]\u0026nbsp; 又 把 链 子 的 那 两 头 接 在 两 槽 上 ， 安 在 以 弗 得 前 面 肩 带 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the two ends of the two wreathen chains they fastened in the two ouches, and put them on the shoulderpieces of the ephod, before it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the other two ends of the chains were joined to the two frames and fixed to the front of the ephod over the arm-holes. \n\u003cbr\u003e39:19 [hgb]\u0026nbsp; 作 两 个 金 环 ， 安 在 胸 牌 的 两 头 ， 在 以 弗 得 里 面 的 边 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made two rings of gold, and put them on the two ends of the breastplate, upon the border of it, which was on the side of the ephod inward. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they made two rings of gold and put them on the two lower ends of the bag, on the inner side nearest to the ephod. \n\u003cbr\u003e39:20 [hgb]\u0026nbsp; 又 作 两 个 金 环 ， 安 在 以 弗 得 前 面 两 条 肩 带 的 下 边 ， 挨 近 相 接 之 处 ， 在 以 弗 得 巧 工 织 的 带 子 以 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made two other golden rings, and put them on the two sides of the ephod underneath, toward the forepart of it, over against the other coupling thereof, above the curious girdle of the ephod. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And two other gold rings were put on the front of the ephod, over the arm-holes, at the join, and over the worked band. \n\u003cbr\u003e39:21 [hgb]\u0026nbsp; 用 一 条 蓝 细 带 子 把 胸 牌 的 环 子 和 以 弗 得 的 环 子 系 住 ， 使 胸 牌 贴 在 以 弗 得 巧 工 织 的 带 子 上 ， 不 可 与 以 弗 得 离 缝 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they did bind the breastplate by his rings unto the rings of the ephod with a lace of blue, that it might be above the curious girdle of the ephod, and that the breastplate might not be loosed from the ephod; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the rings on the bag were fixed to the rings of the ephod by a blue cord, keeping it in place over the band, so that the bag might not get loose, as the Lord gave orders to Moses. \n\u003cbr\u003e39:22 [hgb]\u0026nbsp; 他 用 织 工 作 以 弗 得 的 外 袍 ， 颜 色 全 是 蓝 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he made the robe of the ephod of woven work, all of blue. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The robe which went with the ephod was made all of blue; \n\u003cbr\u003e39:23 [hgb]\u0026nbsp; 袍 上 留 一 领 口 ， 口 的 周 围 织 出 领 边 来 ， 仿 佛 铠 甲 的 领 口 ， 免 得 破 裂 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And there was an hole in the midst of the robe, as the hole of an habergeon, with a band round about the hole, that it should not rend. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; With a hole at the top in the middle, like the hole in the coat of a fighting-man, edged with a band to make it strong. \n\u003cbr\u003e39:24 [hgb]\u0026nbsp; 在 袍 子 底 边 上 ， 用 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 并 捻 的 细 麻 作 石 榴 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made upon the hems of the robe pomegranates of blue, and purple, and scarlet, and twined linen. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The skirts of the robe were worked all round with fruits in blue and purple and red made of twisted linen. \n\u003cbr\u003e39:25 [hgb]\u0026nbsp; 又 用 精 金 作 铃 铛 ， 把 铃 铛 钉 在 袍 子 周 围 底 边 上 的 石 榴 中 间 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made bells of pure gold, and put the bells between the pomegranates upon the hem of the robe, round about between the pomegranates; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And between the fruits all round the skirt they put gold bells, as the Lord gave orders to Moses. \n\u003cbr\u003e39:26 [hgb]\u0026nbsp; 一 个 铃 铛 ， 一 个 石 榴 ， 一 个 铃 铛 ， 一 个 石 榴 ， 在 袍 子 周 围 底 边 上 用 以 供 职 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A bell and a pomegranate, a bell and a pomegranate, round about the hem of the robe to minister in; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All round the skirt of the robe were bells and fruits in turn. \n\u003cbr\u003e39:27 [hgb]\u0026nbsp; 他 用 织 成 的 细 麻 布 为 亚 伦 和 他 的 儿 子 作 内 袍 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made coats of fine linen of woven work for Aaron, and for his sons, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The coats for Aaron and his sons they made of the best linen; \n\u003cbr\u003e39:28 [hgb]\u0026nbsp; 并 用 细 麻 布 作 冠 冕 和 华 美 的 裹 头 巾 ， 用 捻 的 细 麻 布 作 裤 子 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And a mitre of fine linen, and goodly bonnets of fine linen, and linen breeches of fine twined linen, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the twisted head-dress for Aaron, and beautiful head-dresses of linen, and linen trousers, \n\u003cbr\u003e39:29 [hgb]\u0026nbsp; 又 用 蓝 色 ， 紫 色 ， 朱 红 色 线 ， 并 捻 的 细 麻 ， 以 绣 花 的 手 工 作 腰 带 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And a girdle of fine twined linen, and blue, and purple, and scarlet, of needlework; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And a linen band worked with a design of blue and purple and red, as the Lord had said to Moses. \n\u003cbr\u003e39:30 [hgb]\u0026nbsp; 他 用 精 金 作 圣 冠 上 的 牌 ， 在 上 面 按 刻 图 书 之 法 ， 刻 着 ‘ 归 耶 和 华 为 圣 ’ 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they made the plate of the holy crown of pure gold, and wrote upon it a writing, like to the engravings of a signet, HOLINESS TO THE LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The plate for the holy crown was made of the best gold, and on it were cut these words, HOLY TO THE LORD. \n\u003cbr\u003e39:31 [hgb]\u0026nbsp; 又 用 一 条 蓝 细 带 子 将 牌 系 在 冠 冕 上 ， 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they tied unto it a lace of blue, to fasten it on high upon the mitre; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; It was fixed to the head-dress by a blue cord, as the Lord had given orders to Moses. \n\u003cbr\u003e39:32 [hgb]\u0026nbsp; 帐 幕 ， 就 是 会 幕 ， 一 切 的 工 就 这 样 作 完 了 。 凡 耶 和 华 所 吩 咐 摩 西 的 ， 以 色 列 人 都 照 样 作 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thus was all the work of the tabernacle of the tent of the congregation finished: and the children of Israel did according to all that the LORD commanded Moses, so did they. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So all the work on the House of the Tent of meeting was done; as the Lord had given orders to Moses, so the children of Israel did it. \n\u003cbr\u003e39:33 [hgb]\u0026nbsp; 他 们 送 到 摩 西 那 里 ， 帐 幕 和 帐 幕 的 一 切 器 具 ， 就 是 钩 子 ， 板 ， 闩 ， 柱 子 ， 带 卯 的 座 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they brought the tabernacle unto Moses, the tent, and all his furniture, his taches, his boards, his bars, and his pillars, and his sockets, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then they took the House to Moses, the tent with all the things for it; its hooks, its boards, its rods, its pillars, and its bases; \n\u003cbr\u003e39:34 [hgb]\u0026nbsp; 染 红 公 羊 皮 的 盖 ， 海 狗 皮 的 顶 盖 ， 和 遮 掩 柜 的 幔 子 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the covering of rams\u0027 skins dyed red, and the covering of badgers\u0027 skins, and the vail of the covering, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The outer cover of sheepskins coloured red, and the cover of leather, and the veil for the doorway; \n\u003cbr\u003e39:35 [hgb]\u0026nbsp; 法 柜 和 柜 的 杠 并 施 恩 座 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The ark of the testimony, and the staves thereof, and the mercy seat, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The ark of the law, with its rods and its cover; \n\u003cbr\u003e39:36 [hgb]\u0026nbsp; 桌 子 和 桌 子 的 一 切 器 具 并 陈 设 饼 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The table, and all the vessels thereof, and the shewbread, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The table, with all its vessels and the holy bread; \n\u003cbr\u003e39:37 [hgb]\u0026nbsp; 精 金 的 灯 台 和 摆 列 的 灯 盏 ， 与 灯 台 的 一 切 器 具 ， 并 点 灯 的 油 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The pure candlestick, with the lamps thereof, even with the lamps to be set in order, and all the vessels thereof, and the oil for light, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The support for the lights, with the vessels for the lights to be put in their places on it, and all its vessels, and the oil for the lights; \n\u003cbr\u003e39:38 [hgb]\u0026nbsp; 金 坛 ， 膏 油 ， 馨 香 的 香 料 ， 会 幕 的 门 帘 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the golden altar, and the anointing oil, and the sweet incense, and the hanging for the tabernacle door, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the gold altar, and the holy oil, and the sweet perfume for burning, and the curtain for the doorway of the tent; \n\u003cbr\u003e39:39 [hgb]\u0026nbsp; 铜 坛 和 坛 上 的 铜 网 ， 坛 的 杠 并 坛 的 一 切 器 具 ， 洗 濯 盆 和 盆 座 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The brasen altar, and his grate of brass, his staves, and all his vessels, the laver and his foot, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the brass altar, with its network of brass, and its rods and all its vessels, and the washing-vessel and its base; \n\u003cbr\u003e39:40 [hgb]\u0026nbsp; 院 子 的 帷 子 和 柱 子 ， 并 带 卯 的 座 ， 院 子 的 门 帘 ， 绳 子 ， 橛 子 ， 并 帐 幕 和 会 幕 中 一 切 使 用 的 器 具 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The hangings of the court, his pillars, and his sockets, and the hanging for the court gate, his cords, and his pins, and all the vessels of the service of the tabernacle, for the tent of the congregation, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The hangings for the open space, with the pillars and their bases, and the curtain for the doorway, and the cords and nails, and all the instruments necessary for the work of the House of the Tent of meeting; \n\u003cbr\u003e39:41 [hgb]\u0026nbsp; 精 工 作 的 礼 服 ， 和 祭 司 亚 伦 并 他 儿 子 在 圣 所 用 以 供 祭 司 职 分 的 圣 衣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The cloths of service to do service in the holy place, and the holy garments for Aaron the priest, and his sons\u0027 garments, to minister in the priest\u0027s office. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The robes for use in the holy place, and the holy robes for Aaron and his sons when acting as priests. \n\u003cbr\u003e39:42 [hgb]\u0026nbsp; 这 一 切 工 作 都 是 以 色 列 人 照 耶 和 华 所 吩 咐 摩 西 作 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; According to all that the LORD commanded Moses, so the children of Israel made all the work. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The children of Israel did everything as the Lord had given orders to Moses. \n\u003cbr\u003e39:43 [hgb]\u0026nbsp; 耶 和 华 怎 样 吩 咐 的 ， 他 们 就 怎 样 作 了 。 摩 西 看 见 一 切 的 工 都 作 成 了 ， 就 给 他 们 祝 福 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses did look upon all the work, and, behold, they had done it as the LORD had commanded, even so had they done it: and Moses blessed them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then Moses, when he saw all their work and saw that they had done everything as the Lord had said, gave them his blessing.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/7/433.html","bookId":246,"creation":"Aug 1, 2019 7:49:08 AM","modification":"Aug 1, 2019 7:49:08 AM"}
