{"id":64048,"no":28,"title":"Page 28","content":"\u003cp\u003eThey play in the Meadow. The dancing girl with the dark hair and blue eyes. The boy with blond curls and gray eyes, struggling to keep up with her on his chubby toddler legs. It took five, ten, fifteen years for me to agree. But Peeta wanted them so badly. When I first felt her stirring inside of me, I was consumed with a terror that felt as old as life itself. Only the joy of holding her in my arms could tame it. Carrying him was a little easier, but not much.\u003c/p\u003e\n\u003cp\u003eThe questions are just beginning. The arenas have been completely destroyed, the memorials built, there are no more Hunger Games. But they teach about them at school, and the girl knows we played a role in them. The boy will know in a few years. How can I tell them about that world without frightening them to death? My children, who take the words of the song for granted:\u003c/p\u003e\n\u003cp\u003eDeep in the meadow, under the willow\u003c/p\u003e\n\u003cp\u003eA bed of grass, a soft green pillow\u003c/p\u003e\n\u003cp\u003eLay down your head, and close your sleepy eyes\u003c/p\u003e\n\u003cp\u003eAnd when again they open, the sun will rise.\u003c/p\u003e\n\u003cp\u003eHere it\u0027s safe, here it\u0027s warm\u003c/p\u003e\n\u003cp\u003eHere the daisies guard you from every harm\u003c/p\u003e\n\u003cp\u003eHere your dreams are sweet and tomorrow brings them true\u003c/p\u003e\n\u003cp\u003eHere is the place where I love you.\u003c/p\u003e\n\u003cp\u003eMy children, who don\u0027t know they play on a graveyard.\u003c/p\u003e\n\u003cp\u003ePeeta says it will be okay. We have each other. And the book. We can make them understand in a way that will make them braver. But one day I\u0027ll have to explain about my nightmares. Why they came. Why they won\u0027t ever really go away.\u003c/p\u003e\n\u003cp\u003eI\u0027ll tell them how I survive it. I\u0027ll tell them that on bad mornings, it feels impossible to take pleasure in anything because I\u0027m afraid it could be taken away. That\u0027s when I make a list in my head of every act of goodness I\u0027ve seen someone do. It\u0027s like a game. Repetitive. Even a little tedious after more than twenty years.\u003c/p\u003e\n\u003cp\u003eBut there are much worse games to play.\u003c/p\u003e\n\u003cp\u003eTHE END\u003c/p\u003e","sourceLink":"https://allnovel.net/mockingjay-the-hunger-games-3/page-28.html","bookId":1687,"creation":"Oct 5, 2019 9:53:15 AM","modification":"Oct 5, 2019 9:53:15 AM"}
