{"id":110788,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Ready.”\u003c/p\u003e\n\u003cp\u003eAnd he flicked a switch on his control. Immediately, the plane started to thrum in my fingers, resuscitated and alive, a winged bat struggling to wriggle free. “You should see your face,” he said, scratching his wrist with two free fingers.\u003c/p\u003e\n\u003cp\u003e“Do I let it go?”\u003c/p\u003e\n\u003cp\u003e“No, hold on to it. When I say now, give it as mighty a heave as you can. Diagonal, up into the sky, hard as you can, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eCalmly, he waited, until the vibrating thrum soon began to fatigue my arms. Just as I was about to put my arms down, he said, “Get ready!”\u003c/p\u003e\n\u003cp\u003eAnd I felt the wind pick up from behind, lifting the bangs of my hair, then filling my shirt like a balloon. My father waited. Then the wind gusted, flapping my clothes, threatening to rip the plane out of my hands.\u003c/p\u003e\n\u003cp\u003e“Now!” my father shouted, and I threw the plane up into the skies. The plane flew out, wobbly, the wings madly keening. I thought it would fumble and fall for sure. But instead it steadied and sailed.\u003c/p\u003e\n\u003cp\u003e“Whoa! Daddy, it’s flying!”\u003c/p\u003e\n\u003cp\u003eHe nodded back at me, his fingers making minute adjustments on the knobs. His lips quivered faintly, unconsciously. I stared at him. It was the closest I ever saw him smile.\u003c/p\u003e\n\u003cp\u003eThe plane rose high in the sky, oscillating wider and wider. My father placed the control in my hands. I almost dropped it, not with surprise but fear. He wrapped his hands around mine.\u003c/p\u003e\n\u003cp\u003e“Push this button,” my father said.\u003c/p\u003e\n\u003cp\u003e“What does it do?”\u003c/p\u003e\n\u003cp\u003e“Puts the plane on autopilot.”\u003c/p\u003e\n\u003cp\u003eWe watched as the plane grew smaller and smaller in the distance, twinkling like a star in the sunlit sky.\u003c/p\u003e\n\u003cp\u003e“Where is it going, Daddy?”\u003c/p\u003e\n\u003cp\u003eHe pointed. “There.”\u003c/p\u003e\n\u003cp\u003e“The eastern mountains?”\u003c/p\u003e\n\u003cp\u003eHe nodded. And then he spoke words that frightened me. “Don’t forget this moment.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said.\u003c/p\u003e\n\u003cp\u003eBut he wasn’t satisfied. “Don’t ever forget where the plane is going. I want you to remember this, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.” I looked up at him. “Where is it going?”\u003c/p\u003e\n\u003cp\u003eThere was a silence so protracted I thought he hadn’t heard me. But then he whispered a word so softly I don’t think I was meant to hear. “Home.”\u003c/p\u003e\n\u003cp\u003eFor a moment, it appeared he was going to say something more. Not just another word or sentence, but a whole torrent of thoughts uncontrollably spilling out. A fear clutched my heart. Because for all my curiosity, I found myself not wanting to know, not wanting to hear the stench of confessions too long unspoken, of secrets too carefully guarded. I don’t want this, I thought to myself, I don’t want this at all.\u003c/p\u003e\n\u003cp\u003eBut my father closed his eyes, and when he opened them, eyelids flying upward, resolve had settled in them.\u003c/p\u003e\n\u003cp\u003e“Remember where this plane is going, okay?” he said.\u003c/p\u003e\n\u003cp\u003eIt did not seem remarkable to me that day, the direction of the plane. As if my father had only willy-nilly chosen that heading, or allowed the random wind to determine the plane’s course. But later, years later, I realized it must have been deliberate. Any other heading, and the plane would have eventually crashed in the endless desert. But only eastward would the plane have found a different end: into the green of mountain meadows, the blue of glacial lakes, the white of that mountain’s snow suffused with the red glow of dawn’s light.\u003c/p\u003e\n\u003cp\u003e17\u003c/p\u003e\n\u003cp\u003e… DIM VOICES, THEN silence. A coarse blanket placed gently over my shivering, freezing body, which I grab with burning hands. I fade out …\u003c/p\u003e\n\u003cp\u003e… I surface out of a gray heat, a sheen of sweat soaking into my clothes. Even in my feverish state, I sense the passage of time: the heft of nights and days gone by, the rise and fall of moons and suns. On my burning forehead, a cold compress is daubed once, twice, sizzling on contact. Soft voices murmur out of the darkness before subsiding into silence. A cool hand slides into mine, refreshing and lovely, like smooth marble. I grip it tightly as I descend back into the fevered pit of heat and cold …\u003c/p\u003e\n\u003cp\u003eHours—days?—later, I’m able to open my eyes. The room—flattened into a two-dimensional canvas—ripples like a wind-gusted flag. A face looms toward me. It is Ashley June, her skin sick and pale. But the color of her hair is off. Then the face morphs into the contours of Sissy’s face. Her brown eyes peer with concern into mine. The room tilts and I clamp my eyelids down. From next to me comes the soft sound of water gently splashing. A wet towel is pressed against my burning forehead. The world careens into black …\u003c/p\u003e\n\u003cp\u003e… My eyes crack open, crusty with residue. A day, a night has passed since they last opened. And almost immediately, I start to collapse into the dark chamber again. But not before I see Sissy, staring out the window unaware of my awakening, her face awash in moonlight and taut with tension. And fear. Something is wrong. I slip away …\u003c/p\u003e\n\u003cp\u003eI awaken. It feels like a rebirth: for the first time in days my mind is lucid, my body reclaimed though weak. I touch my forehead. It is cool and dry. The fever has broken. I breathe in, feel the rattle of phlegm lodged in my windpipes.\u003c/p\u003e\n\u003cp\u003eSunlight sprinkles through the sheer curtains. I’m in a small room, wood paneled and made more spacious by a large alcove. Sitting in a leather armchair, fast asleep, is Sissy. Her mouth is parted, the blanket rising and falling ever so slightly.\u003c/p\u003e\n\u003cp\u003eI struggle to sit up, my strength whittled away.\u003c/p\u003e\n\u003cp\u003e“Easy does it, nice and slow,” Sissy says at my side in a blink, her hand under my head as she lowers me back down.\u003c/p\u003e\n\u003cp\u003e“How long?” I caw. My voice, rough and raspy, does not sound like my own.\u003c/p\u003e\n\u003cp\u003e“You’ve been out three days. You were touch and go for the first two days, burning up. Honestly, we didn’t think you’d pull through. Here, drink some.” She holds a bowl to my lips. “The fever broke last night.”\u003c/p\u003e\n\u003cp\u003e“I got it.” But the bowl weighs a ton, and I almost spill it. Sissy cups my hands with her own, steadies the bowl. I take a few gulps, then lean back into the pillow. A wave of warmth courses through my body.\u003c/p\u003e\n\u003cp\u003eSissy looks exhausted, her hair a frazzled mess, a few strands pressed into her cheek as if stenciled in. Large bags under her eyes, with tension roped taut across her face. There’s something wrong.\u003c/p\u003e\n\u003cp\u003e“Is it morning or afternoon?” I ask.\u003c/p\u003e\n\u003cp\u003eThe question catches her. “I dunno. I’ve lost track,” she says, and peers out the window. “Looks like afternoon.” She studies the windows on the other side of the room. “Yeah, that side’s west, so it’s afternoon.”\u003c/p\u003e\n\u003cp\u003e“Where is everyone? The boys?”\u003c/p\u003e\n\u003cp\u003e“Out and about.”\u003c/p\u003e\n\u003cp\u003e“Are they okay?”\u003c/p\u003e\n\u003cp\u003eShe nods. “And then some. They’ve really taken to this place.” She attempts a smile, but her lips are lined with tension. “They’re loving it here. They couldn’t be happier.”\u003c/p\u003e\n\u003cp\u003e“So this really is it, then? The Land of Milk and Honey?”\u003c/p\u003e\n\u003cp\u003eShe nods, falls quiet.\u003c/p\u003e\n\u003cp\u003e“Sissy, what’s wrong?”\u003c/p\u003e\n\u003cp\u003e“No, nothing. It’s great. Fruit and sunshine. The Promised Land.” But she is no longer looking me in the eye.\u003c/p\u003e\n\u003cp\u003e“Just tell me,” I urge her gently.\u003c/p\u003e\n\u003cp\u003eShe bites her lower lip, shifts in her chair. In a hushed voice, she says, “There’s something off about this place.”\u003c/p\u003e\n\u003cp\u003eI sit up. “What do you mean?” Phlegm gets caught in my chest, and I start hacking away. She slides next to me and lightly pounds my back. “Sissy, tell me.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “You need to rest.”\u003c/p\u003e\n\u003cp\u003eI grip her hand. “Just tell me.”\u003c/p\u003e\n\u003cp\u003eShe hesitates. “It’s hard to put my finger on it. Nothing really big, just a bunch of small things.”\u003c/p\u003e\n\u003cp\u003e“The boys have noticed it, too? Epap?”\u003c/p\u003e\n\u003cp\u003eA stab of frustration lights her eyes. “There’s too much food, too many fun distractions here. I brought it up with Epap yesterday and he didn’t have the faintest. Told me to knock it off, to stop being paranoid. To relax and enjoy this place. But I can’t. Something’s off-kilter.”\u003c/p\u003e\n\u003cp\u003eJust then, the sound of footsteps approach from outside the door. The door bangs open. A tall man, slightly hunched as if embarrassed by his height, stumbles in. Sissy stiffens.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” he snaps at her. “This is not good. This is not good!”\u003c/p\u003e\n\u003cp\u003e“What’s the matter?” I say.\u003c/p\u003e\n\u003cp\u003eThe man’s eyes swing toward me. “You’re awake!” he says, swaying.\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003eHe blinks long and hard. “I’m Elder Northrumpton. I’ve been taking care of you.” His voice is slurred, his eyes bloodshot. Even from the bed, I can smell fumes of alcohol pouring out of his mouth. He stumbles over to the windows, fumbles with the latch. Leaning out, he belts out a yodel, his hands cupped to the sides of his mouth. Even his yodel is slurred. Then he turns back around.\u003c/p\u003e\n\u003cp\u003e“Please get ready,” he says to me. “Supper is in a few minutes. A group of girls will escort you over to the banquet hall shortly.” He points to a cupboard. “A set of warm clothes, fitted for you. I’ll give you some privacy to change. But hurry.”\u003c/p\u003e\n\u003cp\u003e“He should stay in bed,” Sissy says. “He’s weak. Surely we can bring food to him.”\u003c/p\u003e\n\u003cp\u003eThe elder’s eyebrows knot together with irritation. “He is to dine with the rest of us in the banquet hall,” he answers. “Grand Elder Krugman will be most pleased to see Gene up and about. Most pleased at the quality of care I’ve given him.” His licks his lips. His attention shifts to Sissy. “And what are you doing in this room? You’re not supposed to be here.”\u003c/p\u003e\n\u003cp\u003eSissy tenses but doesn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Let’s go. Now.” He walks out of the room, leaving the door open. No sound of footsteps accompany his exit. He’s stopped right outside the door, waiting in the hallway for Sissy to follow.\u003c/p\u003e\n\u003cp\u003eSissy leans over to me, her eyes sharp. “Listen, you have to know something,” she whispers quickly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“It’s about your fa—” She gazes at the door. “—about the Scientist.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prey-the-hunt-2/page-15.html","bookId":1580,"creation":"Oct 6, 2019 12:07:59 AM","modification":"Oct 6, 2019 12:07:59 AM"}
