{"id":110797,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eA protracted pause. Thoughts churning, options weighed, indiscretions considered.\u003c/p\u003e\n\u003cp\u003e“Sometimes,” the henchman whispers, “you can’t be too sure about these things.”\u003c/p\u003e\n\u003cp\u003e“Maybe we should find out,” the other says, catching on. His close-set eyes creep down Sissy’s body. “There are ways of”—his mouth droops, an upside-down smile—“ascertaining fact. Of uncovering the truth.”\u003c/p\u003e\n\u003cp\u003eThey start to move toward her.\u003c/p\u003e\n\u003cp\u003eI fly in, without elegance. But with the strength of conviction. I shove the men backward, and their ample backsides slap hard against the door. They bounce off, their fury bringing crimson to their cheeks. One of them is swinging his arm back, readying to piston it out at me, but Sissy leaps at him, driving her elbow into his sternum. He doubles over, spittle and curses flying out.\u003c/p\u003e\n\u003cp\u003eI don’t know what would have happened next if Krugman didn’t start to laugh. Not just any kind of laughter. This is an uproarious upheaval of his guts, a bellowing that rattles our rib cages. He collapses into his office chair, his laughter soon falling into aftershock mode, a low rumbling from the pit of his stomach.\u003c/p\u003e\n\u003cp\u003e“You guys,” he says between laughs. “I said tit for tat, not tête-à-tête.” He laughs at his improvised humor. “No more private conversations, okay!” Krugman’s face beams. “Teatime is over!”\u003c/p\u003e\n\u003cp\u003eThe back of Sissy’s hand touches mine. Then we are sliding skin over skin, until we’re holding hands, our cold palms fitting perfectly.\u003c/p\u003e\n\u003cp\u003eKrugman is smiling, his beard rising and bunching up at the cheeks as if a pair of mice have burrowed themselves in there. “Come,” he finally says, his thumbs crooked behind his belt. “This is not what the Mission is about. We’re about sunshine and smiles and happy faces. Not fracture and violence.”\u003c/p\u003e\n\u003cp\u003e“Could have fooled me,” Sissy says, her voice low.\u003c/p\u003e\n\u003cp\u003e“You shrill little harpy,” one of the elders shouts. “You disobedient wench, we ought to feed you to the—”\u003c/p\u003e\n\u003cp\u003e“Enough,” Krugman says. His voice is soft. His eyes still dance with humor, but the wetness seems acidic now. “I’m afraid this is all my fault. I’ve forgotten how tired you must be, and how on edge, too, after all you’ve been through. Please, pardon my lapse.” He widens the smile on his face. “Shall we let bygones be bygones? Water under the bridge? Let all things past, pass? That sort of thing?”\u003c/p\u003e\n\u003cp\u003eI nod. Warily. “We’d like to leave now.”\u003c/p\u003e\n\u003cp\u003e“As you wish,” Krugman says. He motions the other elders to step aside. As we brush between the henchmen, through a parted sea of lard, Krugman mumbles something.\u003c/p\u003e\n\u003cp\u003e“What’s that?” Sissy says.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he murmurs.\u003c/p\u003e\n\u003cp\u003eOn the cobblestone path, we walk past smiling groups of girls, their teeth perfectly white, standing off to the side. Black clouds have drifted across the skies, brusque and meaning business. Within minutes, cold, driving rain drums down in slantwise bands. Sissy and I walk quickly, side by side; our hands have never let go, and they form a small cove of warmth against the soaking cold. I don’t tell her what Krugman mumbled as we left. Mostly because I don’t quite know what to make of it, if it really is the veiled threat I suspect it is. All good things, he’d whispered as we left, come to those who wait.\u003c/p\u003e\n\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003eBY THE TIME we reach my cottage, we’re soaked through. Sissy grabs my satchel bag off the sofa and upheaves its contents onto the bed. Scraps of food, Epap’s sketchbook, the Scientist’s journal, and small trinkets fall onto the duvet.\u003c/p\u003e\n\u003cp\u003e“See anything that might be the Origin?” she asks.\u003c/p\u003e\n\u003cp\u003e“I’m sure they’ve been through the bag already,” I say. “And besides, aren’t they under the notion that the Origin is something engraved on our skin? That it has to do with lettering or something?”\u003c/p\u003e\n\u003cp\u003eShe picks up the Scientist’s journal, leafs through it, then tosses it onto the bed in frustration. She’s beginning to shiver. We’re both freezing. I walk over to the fireplace; my trembling fingers try to get a fire going.\u003c/p\u003e\n\u003cp\u003e“L-l-look,” Sissy says, chattering. She’s pointing at the coffee table. A tray of food has been laid atop it and, judging from the steam still rising from the earthenware bowls of soup, it was delivered very recently. “You get your own room with a fireplace and hot shower, and room service as well?”\u003c/p\u003e\n\u003cp\u003eI touch the loaf of bread on the tray. Still warm. “Look, why don’t you have some? It might take a while to get this fire going. The soup will help warm you up.”\u003c/p\u003e\n\u003cp\u003eShe agrees, sitting on the sofa and slurping the soup down. Her nose pinches up.\u003c/p\u003e\n\u003cp\u003e“Something the matter?” I ask.\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “Just really salty. But good. And hot.”\u003c/p\u003e\n\u003cp\u003eI busy myself at the hearth, picking out a few branches stacked on the side. But the kindling is slightly damp and I’m having a hard go at it. Sissy slurps down the last of the soup but she’s still shivering.\u003c/p\u003e\n\u003cp\u003e“Sissy, go take a hot shower. It’ll help warm you up.”\u003c/p\u003e\n\u003cp\u003eShe’s too cold to disagree. She gets up and I give her a set of clothes from the dresser. “They’re too big for you, but better dry and big than wet and cold.”\u003c/p\u003e\n\u003cp\u003eShe closes the bathroom door. I take the opportunity to change into dry clothes myself, casting off my cold sodden clothes. A few minutes later, I have a hearty fire blazing away. I sit back on the sofa, easing my cold bones into the soft give of the cushions. The flames lick and dance their light across the room, transforming the walls into a firestorm of red and orange. From the bathroom, I hear the far-off sound of water splashing.\u003c/p\u003e\n\u003cp\u003eDespite the fire and set of dry clothes, I’m still cold. I gather the duvet from the bed, place it over my legs. I stare into the fire. The meandering flames are like my own disoriented, shifting thoughts. I have some soup, but it’s lukewarm now, and too salty. I set it down after finishing half of it and stare out the window.\u003c/p\u003e\n\u003cp\u003eA darkness has ripened in the village, dissolving the trails of smoke rising from the chimneys, swallowing whole the thatched roofs. A few minutes later and night has absorbed the winding paths outside our front door. An occasional whistle of wind peals into the village, muffled by thickening clouds that float hidden in the dark skies. Raindrops speckle the window like small gashes.\u003c/p\u003e\n\u003cp\u003eMy thoughts are preoccupied with what Krugman just told us. A different kind of cold—more unsettling, disturbing—seeps into my bones.\u003c/p\u003e\n\u003cp\u003eSissy walks in, her face cleansed, her hair damp.\u003c/p\u003e\n\u003cp\u003eShe stands directly in front of the fireplace for a few minutes, running her fingers through her damp hair. Light from the fire gilds the loose strands, setting them ablaze.\u003c/p\u003e\n\u003cp\u003e“That shower really helped,” she says. “Thanks.” The firelight dances across her freshly scrubbed skin. “But it’s made me really sleepy. I was almost nodding off in there.” She sits next to me. For a few minutes, as the warmth of the fire spreads over us, we sit in silence. She cradles her legs under her hips, pulls the duvet over her lap.\u003c/p\u003e\n\u003cp\u003e“Pretty crazy past two days,” I say.\u003c/p\u003e\n\u003cp\u003e“Pretty crazy last hour.” She eases back into the cushioning, cracks her knuckles. “I was just getting used to this village, all these other humans around. And now I learn there’s a whole world of us. My mind’s trying to wrap itself around all this … but it’s like grabbing for purchase in quicksand.”\u003c/p\u003e\n\u003cp\u003eI nod. “It’s a lot to get used to.”\u003c/p\u003e\n\u003cp\u003eThe fire snaps, kicking up a plume of sparks.\u003c/p\u003e\n\u003cp\u003e“What is it?” she says. “You’re hiding something from me.”\u003c/p\u003e\n\u003cp\u003eI shift my body sideways so I’m facing her. “Krugman might be lying, Sissy.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t say anything, but her eyes swim over my face.\u003c/p\u003e\n\u003cp\u003e“Krugman says the train goes to the Civilization. And maybe it does. But…”\u003c/p\u003e\n\u003cp\u003e“We don’t know anything about the Civilization,” she finishes.\u003c/p\u003e\n\u003cp\u003e“Other than what he tells us. He says it’s a paradise, that it’s an incredible place. But what if it’s not? What if there’s…”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eI take her hands into mine. I feel the warmth of skin, the beat of her pulse on my fingertips. I suddenly don’t want to say what I know I have to; I simply want to stretch this quiet moment into an hour, a day, a year, a decade, to be alone with her without the interference of the world. But she lifts her eyes expectantly to mine, and I speak.\u003c/p\u003e\n\u003cp\u003e“What if the train leads straight to the duskers?”\u003c/p\u003e\n\u003cp\u003eHer face barely shifts, but her hand in mine tightens.\u003c/p\u003e\n\u003cp\u003e“When I was at the Heper Institute, the Director let slip something about the Ruler’s Palace. He said it was a place where hundreds of hepers were secretly housed. Kept in underground pens, like cattle. To be consumed at the Ruler’s behest.” I stare into the fire, then back at Sissy’s whitening face. “What if those train tracks lead to the Ruler’s Palace?”\u003c/p\u003e\n\u003cp\u003e“We’re the cattle?” She glances at the emptied bowl of soup, the half-eaten loaf. “And that’s why they’re fattening us up?”\u003c/p\u003e\n\u003cp\u003eI grit my teeth. “I don’t know. Maybe I’m being paranoid. Maybe the Civilization is everything they’ve said it is. A paradise. The final destination to which my father’s been leading us all along.” I exhale with frustration. “This place is strange, no doubt about it. But what do I know about weird? Or about normal, for that matter? I mean, I’ve lived my whole life masquerading as a dusker in a dusker world. What do I know of the human world?”\u003c/p\u003e\n\u003cp\u003eI stare out the window. The sky is smeared over with black clouds. Rain falls, bringing more darkness down with it. The outside world begins to dissolve into a black husk, enclosing us in this small room of flickering firelight. “I’ve lived my whole life caught in a crack between two worlds. And I don’t belong to or know either one.”\u003c/p\u003e\n\u003cp\u003e“Don’t look to me for help, Gene.” She’s trying to be light about it, but a heaviness sits upon her words. “I’m just like you,” she says. “I’ve lived in a glass dome my whole life. I don’t know anything about either world, human or dusker.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prey-the-hunt-2/page-27.html","bookId":1580,"creation":"Oct 6, 2019 12:07:59 AM","modification":"Oct 6, 2019 12:07:59 AM"}
