{"id":110803,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAnd yet still it whispers, still it murmurs.\u003c/p\u003e\n\u003cp\u003eSissy moves in, kneeling next to me. The dusker continues to melt away, yellow effluvium pooling around us. A raw pungent smell of flesh burning fills the air.\u003c/p\u003e\n\u003cp\u003e“Watch its fangs!” Sissy warns.\u003c/p\u003e\n\u003cp\u003e“It’s okay, it’s okay, it’s done in.”\u003c/p\u003e\n\u003cp\u003eThe dusker’s mouth suddenly opens wide as if yawning, exposing a row of sharp incisors. Its jaw shudders, vibrates, as if shivering. A faint sounds scratches out.\u003c/p\u003e\n\u003cp\u003e“S-S-Saw…” it whispers, mouthing a word.\u003c/p\u003e\n\u003cp\u003eSissy and I share a confused, horrified look.\u003c/p\u003e\n\u003cp\u003e“Saw-saw…” it murmurs, barely audible.\u003c/p\u003e\n\u003cp\u003eI lower my ear to its mouth.\u003c/p\u003e\n\u003cp\u003e“No, Gene. It’s a ruse…”\u003c/p\u003e\n\u003cp\u003eI push her hand away. “It’s okay,” I whisper, but not to Sissy. To the dusker. “It’s okay. It’s over now.” And I lean forward until my ear is down to its lips.\u003c/p\u003e\n\u003cp\u003eIt sucks in one last breath, eyes gaping wide like a pair of gasping mouths. And that’s when I notice its arm, what’s left of it, anyway. Five branding marks, disintegrating in the sunlight.\u003c/p\u003e\n\u003cp\u003eAnd finally it utters its last word. I lean in closer.\u003c/p\u003e\n\u003cp\u003e“Sorry,” it says.\u003c/p\u003e\n\u003cp\u003eAnd then it closes its eyes.\u003c/p\u003e\n\u003cp\u003eWe don’t say anything. I put my hand in the dusker’s black hair and, with hesitation at first, gently stroke the silky lengths. My fingers comb through the still-damp hair, over and over, until the dusker is silent, until the dusker is gone, until nothing is left of her but hair.\u003c/p\u003e\n\u003cp\u003e38\u003c/p\u003e\n\u003cp\u003eWE SPRINT THROUGH the village. Morning has swung into full momentum and village girls are now pouring out into the streets. Sissy and I drop all hopes of remaining undetected and make a beeline right down the main road. Girls turn to look at us, their heads swiveling around as we pass.\u003c/p\u003e\n\u003cp\u003eWe enter my cottage quietly and take in the silence of the interior, the emptiness of the dining room. Avoiding the creaky steps, we ascend the staircase. The bedroom door is slightly ajar, and I carefully peek inside. All the boys are on the bed, their wrists tied to separate bedposts. Only David sees me; his eyes widen. I raise a finger to my lips. Blinking hard, he points with his chin toward an unseen corner of the room.\u003c/p\u003e\n\u003cp\u003eThey’ve posted one sentry.\u003c/p\u003e\n\u003cp\u003eA large one, but, more importantly, a sleeping one. A finished bottle of wine lies on its side, pressed up against a chair leg. The elder’s mouth is wide open, a snore gurgling in his throat but not quite making it out of his mouth. They obviously weren’t expecting any resistance or rescue.\u003c/p\u003e\n\u003cp\u003eSissy slides into the room behind me, dagger in hand, and starts cutting the ropes. The boys, all wide-eyed now, know better than to say a word. I stand facing the elder, the wine bottle now in my hand. At the first sign of waking up, I will smash the bottle into his face.\u003c/p\u003e\n\u003cp\u003eWithin a minute, the boys are all cut loose. The bags we’d packed earlier are still stacked by the door, and we grab them as we tiptoe out of the room, closing the door behind us, leaving the drunk elder none the wiser.\u003c/p\u003e\n\u003cp\u003eOutside, we fly down the path. We have the advantage now. Out in the open, we can easily evade their potbellies and lotus feet. Our escape is all but assured. We run past groups of girls who gape and stare. We sprint off the cobblestone street, onto a dirt path. Girls are washing laundry on the deck by the river, and they stop to observe us as we run past. I see one of them stand, take a few urgent paces toward us. It’s the girl with freckles and she raises an outstretched arm, beckoning us to stop. But there is no time, and we blow past her, cross the river, sprint into the woods. There might as well be a hundred miles between us and them, there’s no way they can catch us now.\u003c/p\u003e\n\u003cp\u003eWe don’t stop running for a full fifteen minutes. A bubbling stream gives us the excuse to stop; we fill our canteens, glad for the chance to catch our breath. Sissy checks on Ben’s head where he’d been earlier struck by an elder. There’s a small bump but he seems none the worse for wear. Epap has a few bruises and scrapes on his face and arms. He says he delivered a few good punches before they’d overpowered him.\u003c/p\u003e\n\u003cp\u003eHe clutches his jacket suddenly, then stumbles behind a tree. We hear him retching, then dry coughing. He comes back, his breath sour, his face pale. He kneels beside the river, splashes water on his face.\u003c/p\u003e\n\u003cp\u003e“Better now?” Sissy asks.\u003c/p\u003e\n\u003cp\u003e“Still a little groggy. From that soup they made me drink. They forced me to drink it on threat to the other boys. Said they’d bring you back if I finished it.” He grimaces, shakes his head. “The only thing it brought was a fainting spell. But the cold water’s helped. So has running, breaking into a sweat.” He stands up. “Whoa, too fast. Still dizzy. Give me a few.”\u003c/p\u003e\n\u003cp\u003eWe do. I use that time recounting to them everything I learned from Clair: the Mission, my father, the need to travel east. They nod somberly as I speak, their eyes casting warily in the direction of the Mission.\u003c/p\u003e\n\u003cp\u003eOnly Jacob is conflicted. He picks up his bag slowly, drops it back down to the ground. “So we’re really on our own now.”\u003c/p\u003e\n\u003cp\u003eSissy turns to him. “We can make it, Jacob. We stay together, we’ll survive.”\u003c/p\u003e\n\u003cp\u003eHe kicks a small rock into the stream. “So we just follow the river.”\u003c/p\u003e\n\u003cp\u003e“Until we get to the Land of Milk and Honey.”\u003c/p\u003e\n\u003cp\u003e“And how long is the journey? A few days? Weeks? Months? A year?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, Jacob.”\u003c/p\u003e\n\u003cp\u003eHis face wobbles with emotion.\u003c/p\u003e\n\u003cp\u003e“What is it, Jacob?” Epap asks.\u003c/p\u003e\n\u003cp\u003e“Why don’t we head west?” He looks at all of us. “Where the Civilization is. We follow the train tracks. At least we know there’s a destination. Even if it takes us weeks, at least we know there’s light at the end of the tunnel. A place where we know has cows and chicken and food and supplies. And people. Civilization.”\u003c/p\u003e\n\u003cp\u003e“But it’s not where we should go,” I say. “It’s not the Land of Milk and Honey, Fruit and Sunshine.”\u003c/p\u003e\n\u003cp\u003e“Says who?” Jacob says. “That weird girl? Maybe she’s wrong. Maybe she’s lying. Why believe her?”\u003c/p\u003e\n\u003cp\u003e“And you want to instead believe the elders? Excuse me, but aren’t these the very elders who just tried to kill Sissy and me? Who just tied you up and were going to force you onto the train?”\u003c/p\u003e\n\u003cp\u003eJacob’s cheeks burn red, but with embarrassment and not anger. I feel a stab of remorse for yelling at him. “I just want to make it to the Promised Land,” he says, staring down glumly at his feet. “Where the Scientist promised he’d lead us. That’s all.”\u003c/p\u003e\n\u003cp\u003eI speak, softer now. “And it lies east, Jacob. I’ll get you there. I promise.”\u003c/p\u003e\n\u003cp\u003eHe looks up at me with wet eyes. He nods, a quick motion; but in that movement I sense he is handing something valuable and fragile over to me, entrusting me with it.\u003c/p\u003e\n\u003cp\u003e“Okay,” Sissy says. “Let’s keep moving. I want to make it to the log cabin before nightfall.” And then we’re running through the woods again, toward the rising sun, east.\u003c/p\u003e\n\u003cp\u003eIt’s hard going. Within minutes, we slow our pace to a brisk walk, mindful of Ben’s short stride and tender age. He’s trying his best, his hair sweaty beneath his winter hat, his cheeks rosy with exertion. Gradually, the floor of the woods, cushioned with pine needles, gives way to barren land, until the last of the trees are behind us and our boots are smacking on the hard compact surface of mountain rock. The sun reflects off the unbroken miles of gently undulating granite, its glare as blinding as it is intense.\u003c/p\u003e\n\u003cp\u003eWe take another break perched on the edge of a steep drop. The same cabled ladder we’d used to ascend days ago hangs down the face. It’s a heart-stopping, strength-debilitating descent, and Sissy wants to make sure we’re fully rested before climbing down. We sit on the hard surface, our legs splayed in front of us, leaning back on our bags. A brutal wind gusts across the domes, whistling between ravines.\u003c/p\u003e\n\u003cp\u003eSissy digs into her backpack, takes out a pair of binoculars. From where we are, we have a near-panoramic view. She surveys the land sprawled beneath us, rumpled like a blanket. On our left, the thin silver thread of the Nede River glistens under the bright sun. Sissy points the binoculars east. If she’s hoping to see something on the horizon, anything that might hint of the Promised Land, she’s not saying.\u003c/p\u003e\n\u003cp\u003e“Can I get a look?” Epap asks.\u003c/p\u003e\n\u003cp\u003eSissy ignores him, scans to her left.\u003c/p\u003e\n\u003cp\u003e“How much farther?” Ben asks.\u003c/p\u003e\n\u003cp\u003eEpap answers. “I’d say we’re halfway. So another four hours or so to reach the cabin. Hey Sissy, give me a go on those binoculars will you?”\u003c/p\u003e\n\u003cp\u003eBut it’s as if she doesn’t hear him. She’s completely engrossed: her index finger maneuvers the focus wheel, rotating it back and forth in smaller and smaller gradations. Arched over the binoculars, frown lines deepen across her forehead. Her back suddenly stiffens.\u003c/p\u003e\n\u003cp\u003e“Is everything okay?” I say.\u003c/p\u003e\n\u003cp\u003eHer mouth falls open, wide as the two circular binocular lenses. She pulls the binoculars away, gazes out with naked eyes. There’s alarm, bewilderment in them.\u003c/p\u003e\n\u003cp\u003eShe stands up. We all stand with her. I think perhaps she’s seen a group of elders coming down the mountain. But the binoculars were pointing away from the mountain, at the land far below us.\u003c/p\u003e\n\u003cp\u003e“No way,” she utters. The wind whips away her voice, shredding it into a frightened whisper.\u003c/p\u003e\n\u003cp\u003eEpap takes the binoculars from her hands. He doesn’t see anything at first. But then his eyebrows fling up his forehead like kites gusted into the sky. He jolts backward, almost dropping the binoculars.\u003c/p\u003e\n\u003cp\u003e“What is it?” David says. He’s gazing out in the same direction.\u003c/p\u003e\n\u003cp\u003eEpap shakes his head as if to clear it. “I don’t know … it can’t be.”\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“It’s just my mind playing tricks, it’s—”\u003c/p\u003e\n\u003cp\u003e“Boats,” Sissy says. “Floating down the river.”\u003c/p\u003e\n\u003cp\u003eI snatch the binoculars out of Epap’s hands. It takes a few seconds to locate the river, and even then all I see is the glisten of water. The river is a thin curling strip filled with bright, sun-reflected orbs, very disorienting, and I begin to think that perhaps Epap and Sissy are imagining things not there. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-prey-the-hunt-2/page-41.html","bookId":1580,"creation":"Oct 6, 2019 12:07:59 AM","modification":"Oct 6, 2019 12:07:59 AM"}
