{"id":106357,"no":10,"title":"Page 10","content":"\u003cp\u003eSweet Swinging Billy Tillman, the fastest man alive, aka Tilly, aka Tilly the Swift, aka Wild Bill, had become an attorney—a fact that astonished all who knew him, including Tilly’s mother, because no one ever misspent his youth more recklessly. I remember dodging a bowling ball that he once rolled down the stairs at me when I visited his second-story duplex—I felt like Indiana Jones in Raiders of the Lost Ark. On one memorable occasion, Tilly and his cabal of miscreants laid siege to a hamburger joint on Marshall Avenue with bottle rockets because the establishment refused to buy union lettuce. For three consecutive years he water-skied down the Mississippi River in nothing but swimming shorts, in February, evading ice floes for the benefit of a local TV station; I remembered because I drove the boat. Often he would travel to Wisconsin, where the drinking age was nineteen, purchase assorted alcoholic beverages, smuggle them across the border, then sell them out of the trunk of a car at grossly inflated prices to college kids in Minnesota, where the drinking age was twenty-one; I remember because I drove the car. Then there was his annual Pub Crawl. Tilly would rent a school bus, load it with thirty of his closest personal friends and a keg of beer, and direct it from one Twin Cities drinking emporium to the next until the occupants collapsed out of pure exhaustion and overindulgence. I most certainly did not drive on any of those occasions.\u003c/p\u003e\n\u003cp\u003eMr. Mosley allowed that these weren’t necessarily the qualifications that he sought in an attorney.\u003c/p\u003e\n\u003cp\u003e“If you’re going to hire a lawyer,” I told him, “hire one who’s prepared to do almost anything.”\u003c/p\u003e\n\u003cp\u003eA secretary ushered us into Tilly’s office. Introductions were made and greetings exchanged. I asked about Susan. Tilly showed me the picture he kept on his desk.\u003c/p\u003e\n\u003cp\u003eTilly had never been particularly handsome. In fact, the less generous among us might call him downright homely. His wife, on the other hand, made Catherine Zeta-Jones look tired, and I wondered not for the first time how he had managed to woo her. I’ve been told that most women are attracted to power and money, that they’re interested in a man’s personality, his education, his occupation, his ability to make them laugh—but that physical appearance is way down on the list of requirements, somewhere around seventh or eighth. I decided it must be true. How else could Tilly get such an attractive woman to marry him? Why else would I be able to get dates?\u003c/p\u003e\n\u003cp\u003e“Have you seen this?” Tilly handed me a second photo. It was of a young girl with auburn hair and flashing green eyes.\u003c/p\u003e\n\u003cp\u003e“Sheila?”\u003c/p\u003e\n\u003cp\u003eTilly nodded.\u003c/p\u003e\n\u003cp\u003e“My Lord, how old is she now?”\u003c/p\u003e\n\u003cp\u003e“Twelve.”\u003c/p\u003e\n\u003cp\u003eTalk about feeling ancient. “The last time I saw her, she wasn’t even in preschool.”\u003c/p\u003e\n\u003cp\u003e“You should visit more often.”\u003c/p\u003e\n\u003cp\u003eI handed back the photograph. “She’s a very lucky girl. She looks like her mother instead of you.”\u003c/p\u003e\n\u003cp\u003e“Tell me about it.”\u003c/p\u003e\n\u003cp\u003eMr. Mosley said, “Can we get to it? I have to meet my man working the hives near South Dakota.”\u003c/p\u003e\n\u003cp\u003eI don’t think Mr. Mosley meant to be rude. It was just that lawyers made him nervous.\u003c/p\u003e\n\u003cp\u003eTilly sat behind his desk. We sat in front of it.\u003c/p\u003e\n\u003cp\u003e“So, gentlemen. What can I do for you?”\u003c/p\u003e\n\u003cp\u003e“We’re looking for a little payback,” I told him.\u003c/p\u003e\n\u003cp\u003e“Talk to me.”\u003c/p\u003e\n\u003cp\u003eWe told our story. Tilly didn’t hesitate before giving us his recommendation.\u003c/p\u003e\n\u003cp\u003e“We can call the Carver County attorney—whom I play golf with, I might add—and have Crosetti charged with three counts of assault. Certainly there’s a reasonable fear that he was going to cause bodily harm to both of you and Ms. Flynn. The fact he used a racial slur might also give us access to the hate crime statutes. There was no posting of trespass signs that you could see, correct?”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“That’s enough for criminal charges. It’s also enough to start civil proceedings for emotional distress. It’s weak, but you could probably do it.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to arrest him. I don’t want to sue,” Mr. Mosley said.\u003c/p\u003e\n\u003cp\u003e“Well, sir. What do you want?”\u003c/p\u003e\n\u003cp\u003e“I want him to know that he can’t push me around.”\u003c/p\u003e\n\u003cp\u003e“That’s easy.”\u003c/p\u003e\n\u003cp\u003e“How is that easy?” I asked.\u003c/p\u003e\n\u003cp\u003e“We’ll send him a letter printed on my stationery in which we threaten to have him arrested and drag him into civil court unless he—unless he what? Unless he allows you to go anywhere on his property, at your convenience, and take soil samples without interference. What do you say, Mr. Mosley? Do you like the idea of Crosetti cussing you out from behind his window shades while you roam about his land doing exactly as you please?”\u003c/p\u003e\n\u003cp\u003e“I like that very much.”\u003c/p\u003e\n\u003cp\u003e“We’ll send the letter by messenger this afternoon.”\u003c/p\u003e\n\u003cp\u003eTilly smiled broadly, leaned back in his chair, and clasped his fingers behind his head.\u003c/p\u003e\n\u003cp\u003e“I love the law,” he said. “It lets you get away with so much mischief.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-10.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
