{"id":106361,"no":14,"title":"Page 14","content":"\u003cp\u003eNina didn’t say if she would or wouldn’t. As it turned out, the instruction proved unnecessary. After a few moments, the SUV resumed moving forward, driving toward Minneapolis.\u003c/p\u003e\n\u003cp\u003e“Was he shooting at us?” Nina asked. It was the first she had spoken since we entered the freeway, the first sound she had made at all.\u003c/p\u003e\n\u003cp\u003e“You handled the car very well,” I told her.\u003c/p\u003e\n\u003cp\u003e“Was he shooting at us?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why was he shooting at us?”\u003c/p\u003e\n\u003cp\u003e“Because he could, I guess.”\u003c/p\u003e\n\u003cp\u003eShe didn’t like my answer.\u003c/p\u003e\n\u003cp\u003eNina drove the Lexus at the posted speed limit until she reached the Lexington Avenue exit, left the freeway, and pulled into the gas station at the top of the ramp.\u003c/p\u003e\n\u003cp\u003eI checked the front of the car for bullet holes and found none while she examined the damage in back.\u003c/p\u003e\n\u003cp\u003e“Look what they did to my new car.”\u003c/p\u003e\n\u003cp\u003eThe taillight on the right was intact. The rest of the rear had been smashed in, including the trunk lid, and half of the bumper was missing.\u003c/p\u003e\n\u003cp\u003e“My car,” Nina moaned.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” I told her.\u003c/p\u003e\n\u003cp\u003e“What have you gotten me into?”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Yes, you. You’re always pissing off somebody. Who was it this time?”\u003c/p\u003e\n\u003cp\u003eI assured her that what had taken place had nothing to do with me or Mr. Mosley’s bees—why would it? It was only another example of road rage. It had been happening to a lot of people on Twin Cities freeways lately. It was just our turn.\u003c/p\u003e\n\u003cp\u003eAfter she calmed down, Nina accepted my explanation. Unfortunately, so did I.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eNina usually went to work late in the morning, and because Erica wasn’t there, she had no reason to get up early. And since I seldom had a reason to get up early, we slept in. When I finally arrived home at about 10:30 A.M., the blinking red light on my phone informed me that I had a message on my voice mail. It was from Billy Tillman. He had called at 8:36 A.M. from the Fairview Southdale Hospital in Edina. He wanted to see me right now.\u003c/p\u003e\n\u003cp\u003eThe first thing Tilly did was punch me.\u003c/p\u003e\n\u003cp\u003eHe was standing outside a closed door in the middle of a dazzling white hospital corridor and vehemently arguing in hushed tones with a man and a woman, both in their late twenties. Even from fifty feet away I knew they were plainclothes cops. As I approached, Tillman broke away from the detectives. There was something in his eyes, only I didn’t see it until it was too late.\u003c/p\u003e\n\u003cp\u003eI said, “Tilly—”\u003c/p\u003e\n\u003cp\u003eAnd he punched me.\u003c/p\u003e\n\u003cp\u003eHe hit me square in the jaw, snapping my head back.\u003c/p\u003e\n\u003cp\u003eHe hit me so hard that I left my feet and sailed backward down the hospital corridor.\u003c/p\u003e\n\u003cp\u003eMy first instinct was to return the favor. Only I was flat on my back and looking up at him, so it didn’t seem like much of an option.\u003c/p\u003e\n\u003cp\u003e“Get up,” he howled at me.\u003c/p\u003e\n\u003cp\u003eThe two detectives clutched Tillman by the arms and shoulders, and he struggled to free himself.\u003c/p\u003e\n\u003cp\u003e“Get up,” he shouted again.\u003c/p\u003e\n\u003cp\u003eI rose slowly to my feet, never taking my eyes from him even as I cautiously probed my jaw with my fingers. It wasn’t broken, but it felt as if it were.\u003c/p\u003e\n\u003cp\u003e“What’s going on, Tilly?”\u003c/p\u003e\n\u003cp\u003eHe struggled with the cops some more. A moment later, he abruptly stopped struggling. “I’m all right. I’m all right now.”\u003c/p\u003e\n\u003cp\u003eHe didn’t look or sound all right.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” I asked.\u003c/p\u003e\n\u003cp\u003eThe cops relaxed their grip. He pushed them away. I brought my hands up in self-defense, but Tilly didn’t come for me. Instead he strode toward the small waiting room at the far end of the corridor.\u003c/p\u003e\n\u003cp\u003e“Come here,” he shouted.\u003c/p\u003e\n\u003cp\u003eThe female cop said, “He won’t talk to us. Neither will Mrs. Tillman. You must convince them to talk to us.”\u003c/p\u003e\n\u003cp\u003e“About what?”\u003c/p\u003e\n\u003cp\u003e“Come here,” Tilly shouted again.\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003eThey didn’t say. I moved toward Tilly. The two cops didn’t follow, which made me nervous.\u003c/p\u003e\n\u003cp\u003e“Tilly?”\u003c/p\u003e\n\u003cp\u003eHe grabbed my arm, spun me toward the entrance to the waiting room, and shoved me inside. He slammed the door behind us.\u003c/p\u003e\n\u003cp\u003e“You sonuvabitch.”\u003c/p\u003e\n\u003cp\u003eHis face was only inches from mine.\u003c/p\u003e\n\u003cp\u003e“You goddamn sonuvabitch.”\u003c/p\u003e\n\u003cp\u003eI moved backward, putting distance between us.\u003c/p\u003e\n\u003cp\u003e“What did I do?”\u003c/p\u003e\n\u003cp\u003e“They raped her.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“My Susan, they raped her.”\u003c/p\u003e\n\u003cp\u003eOh no, oh no, oh no, oh no, oh no …\u003c/p\u003e\n\u003cp\u003e“There were two of them. Susan was at the end of the driveway with Sheila, waiting for the 7:10 school bus. I had already left for a breakfast meeting. They waited until the bus came and went, and when Susan returned to the house they were on her. Two of them. They beat her and they raped her and then—and then when they finished they told her to tell me to forget about Crosetti. Forget all about Frank Crosetti, they said, or next time it’ll be your daughter. Susan won’t talk to the police, she won’t let me … That’s why … Our daughter, McKenzie. Sheila.”\u003c/p\u003e\n\u003cp\u003eI heard Tilly’s words, understood their meaning, yet my mind wouldn’t accept them. You’re kidding, right? This is one of your outrageous gags. Right? \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-14.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
