{"id":106350,"no":2,"title":"Page 2","content":"\u003cp\u003e“What’s killing them?” I asked. “Pollution?\u003c/p\u003e\n\u003cp\u003e“Somethin’. You watch ’em and sometimes the bees go insane like, jerkin’ all around and bouncin’ into each other and then they lie down and die. It’s ugly.”\u003c/p\u003e\n\u003cp\u003eI looked over Mr. Mosley’s shoulder and through the back door screen. I could see three hives arranged on a wooden pallet. Each hive contained a queen and approximately sixty to seventy thousand worker bees that produced 120 pounds of honey a year—sometimes more, sometimes less. Mr. Mosley sold the honey for $6.50 a pound. There were forty-seven hives scattered over his property. That amounted to well over three million “harmless” honeybees and for the first time since sixteen of them had chastised me for thumping one of the hives with a football, I actually felt sorry for the little buggers.\u003c/p\u003e\n\u003cp\u003e“Something from around here is killing them, you think?”\u003c/p\u003e\n\u003cp\u003e“It’s gotta be ‘round here cuz this is the only colony that’s hurtin’,” Mr. Mosley said. “My other colonies—I keep hives in five locations now, I don’t know if you know that.”\u003c/p\u003e\n\u003cp\u003eLast I heard it was four.\u003c/p\u003e\n\u003cp\u003e“All but this one are located on the western side of Minnesota, near South Dakota, cuz there ain’t much people or insecticide spraying over there. And those colonies, they fine.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“I talked to my man out there just this morning. Lorenzo says there’re no problems. Nothin’s changed since I was out there last week. Lorenzo, though, he isn’t the sharpest knife in the drawer. I might have t’—I haven’t fired anyone before. You ever fire anyone?”\u003c/p\u003e\n\u003cp\u003e“I’ve never been in a management position.”\u003c/p\u003e\n\u003cp\u003e“It’s not somethin’ to look forward to.” Mr. Mosley gave his head a frustrated shake. “You watch your bees, man, and they’ll let you know if somethin’ gone wrong with the environment. Like them birds they use t’ bring down in them mind shafts—if ’n there a problem, boom, they the first to die. Now, look at my bees—yeah, we got a problem.”\u003c/p\u003e\n\u003cp\u003eMr. Mosley shook his head some more.\u003c/p\u003e\n\u003cp\u003e“When I moved to Young America back in ’61—that was way before the city merged with Norwood and became Norwood Young America—there weren’t nothing out here and I didn’t have to worry about DDT and such. DDT was used a lot back then. I was thirty-five miles from downtown Minneapolis. Now with the people and traffic and pollution, I might as well be in downtown Minneapolis.”\u003c/p\u003e\n\u003cp\u003e“Urban sprawl,” I told him.\u003c/p\u003e\n\u003cp\u003e“Whatever they call it, it ain’t healthy.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to do?”\u003c/p\u003e\n\u003cp\u003e“I want you to earn all those free jars of honey I’ve been giving you and your girl all these years.”\u003c/p\u003e\n\u003cp\u003e“She’s not my girl.”\u003c/p\u003e\n\u003cp\u003e“I ‘member the first time you brought her ’round, way back when you was in college. She wasn’t afraid of a couple a’ well-mannered honeybees, didn’t mind ’em at all. Last summer she visited with her little girls, they were still babies almost—they weren’t afraid of the bees, neither. Unlike some people I could name.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah.”\u003c/p\u003e\n\u003cp\u003e“That Shelby, she’s a looker.”\u003c/p\u003e\n\u003cp\u003e“You do know I’ve been seeing someone else.”\u003c/p\u003e\n\u003cp\u003e“The jazz girl?”\u003c/p\u003e\n\u003cp\u003e“She owns a jazz club.”\u003c/p\u003e\n\u003cp\u003e“I notice you ain’t never brought her around,” he said. Mr. Mosley didn’t ask “Why not?” but the question hung between us just the same. I didn’t have an answer for him.\u003c/p\u003e\n\u003cp\u003eMr. Mosley said, “You shoulda married her. Shelby, I mean.”\u003c/p\u003e\n\u003cp\u003e“She married my best friend.”\u003c/p\u003e\n\u003cp\u003e“You shoulda married her.”\u003c/p\u003e\n\u003cp\u003eI didn’t have anything to say to that, either.\u003c/p\u003e\n\u003cp\u003e“Agatha thought so, too.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“So why didn’t you?”\u003c/p\u003e\n\u003cp\u003e“She married my best friend,” I repeated.\u003c/p\u003e\n\u003cp\u003e“That Dunston fella …”\u003c/p\u003e\n\u003cp\u003e“Bobby Dunston.”\u003c/p\u003e\n\u003cp\u003e“Was a cop, like you.”\u003c/p\u003e\n\u003cp\u003e“Still a cop. A homicide detective in St. Paul.”\u003c/p\u003e\n\u003cp\u003e“He’s okay. Agatha liked him—but not as much as she liked you.”\u003c/p\u003e\n\u003cp\u003eAgatha was Mrs. Mosley. It was she who treated my bee stings all those years ago, telling me it was all right to cry, telling me to ignore the disapproving glares of my father and Mr. Mosley, who figured I got what I deserved for playing where I didn’t belong. “They’re just jarheads,” she told me. That was six months after my mother had died of a cancerous brain tumor. Twenty years later, the Big C also claimed Agatha.\u003c/p\u003e\n\u003cp\u003e“She was a good woman,” I said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Mr. Mosley agreed.\u003c/p\u003e\n\u003cp\u003e“My mother was a good woman, too. You were the only one who would tell me that she was dying. Not even my father had courage enough for that.”\u003c/p\u003e\n\u003cp\u003eMr. Mosley refused to linger over the memory. My father had been the same way. I learned from them.\u003c/p\u003e\n\u003cp\u003e“What about my bees?”\u003c/p\u003e\n\u003cp\u003e“I know a guy …”\u003c/p\u003e\n\u003cp\u003eMr. Mosley smiled. “I knew you would.”\u003c/p\u003e\n\u003cp\u003e“At the University of Minnesota. A professor of entomology. What we’ll do, we’ll ask him if he can determine what actually killed the bees. Then we’ll have to decide what to do about it. Might have to sue someone.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-2.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
