{"id":106370,"no":24,"title":"Page 24","content":"\u003cp\u003e“Don’t fuck with me. I’ll put a hole in you the size of a basketball.” He could, too. The nine was more than enough to do the job. Yet even a small-caliber gun would have earned my respect. Except the hammer was down.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?” I asked. I was still clutching my keys in my right hand. I manipulated them so that the blades stuck out between the fingers when I closed my fist.\u003c/p\u003e\n\u003cp\u003e“We hear you’ve been lookin’ for my man.”\u003c/p\u003e\n\u003cp\u003e“Does your man call himself Frank Crosetti?”\u003c/p\u003e\n\u003cp\u003e“Tha’s right, and he ain’t happy you lookin’ for him.”\u003c/p\u003e\n\u003cp\u003e“How antisocial.”\u003c/p\u003e\n\u003cp\u003e“You think you’re funny?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Well, you ain’t.”\u003c/p\u003e\n\u003cp\u003e“Sure I am.”\u003c/p\u003e\n\u003cp\u003e“You ain’t.”\u003c/p\u003e\n\u003cp\u003e“What are you arguing for? You’re the one with the gun.”\u003c/p\u003e\n\u003cp\u003e“Tha’s, tha’s right.”\u003c/p\u003e\n\u003cp\u003e“Frank ever tell you his real name?”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Frank’s real name—did he ever tell you?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Did he tell you he’s from New York?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know that.”\u003c/p\u003e\n\u003cp\u003e“What’s your name.”\u003c/p\u003e\n\u003cp\u003e“Danny—now wait a minute.”\u003c/p\u003e\n\u003cp\u003e“Where is Frank, Danny?”\u003c/p\u003e\n\u003cp\u003eThe question seemed to confuse him. After a couple of starts and stops, he finally said, “We’re supposed to take you to him.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. But if you tell me where I can find him—”\u003c/p\u003e\n\u003cp\u003e“Whaddya mean? You’re comin’ with me.”\u003c/p\u003e\n\u003cp\u003eHe pushed the muzzle into my ribs again. Enough, I decided. I pivoted swiftly to my right and covered his gun hand with my left, gripping tightly. The Browning was now pointed at the interior of my Cherokee, yet Danny didn’t seem to mind. He kept trying to pull the trigger just the same.\u003c/p\u003e\n\u003cp\u003e“The safety’s on, you moron.”\u003c/p\u003e\n\u003cp\u003eI punched him just below the ear. My keys gouged his flesh.\u003c/p\u003e\n\u003cp\u003e“Where’s Frank?”\u003c/p\u003e\n\u003cp\u003eDanny tried to twist away. I hit him again. The pain caused by the key blades tearing his skin caught up with him and he screamed.\u003c/p\u003e\n\u003cp\u003e“Where’s Frank, Danny?”\u003c/p\u003e\n\u003cp\u003eHe brought his left arm up and tried to hide his head behind it, but it did him no good. I pounded his face twice more.\u003c/p\u003e\n\u003cp\u003e“Where is he, Danny? Where’s Frank?”\u003c/p\u003e\n\u003cp\u003eHe dropped the nine. It caromed off the Cherokee’s rocker panel and clattered on the asphalt but didn’t discharge—with Browning, it was safety first. I slid my grip from Danny’s right hand up to his wrist. He tried to escape, but I jerked him back toward me. This time I hit him below his left eye. The force of the blow bounced him off the SUV. I released his hand and he fell. His face was bleeding profusely. I dropped my keys into my pocket and gripped Danny beneath both armpits. I lifted him up—he weighed about as much as a large box of laundry detergent—and leaned him against the Cherokee.\u003c/p\u003e\n\u003cp\u003eHe spat the word “motherfucker” in my face. Somewhere inside me a switch clicked off. Suddenly there was nothing but darkness.\u003c/p\u003e\n\u003cp\u003eI backhanded him with a closed fist.\u003c/p\u003e\n\u003cp\u003e“Was it you, Danny? Did you rape Susan Tillman? You and Frank?” I hit him. “Did you threaten her daughter?” And hit him again. “Was it you?”\u003c/p\u003e\n\u003cp\u003eI drove my knee into his groin just as hard as I could. He cried out. He would have folded like an accordion, except I wouldn’t let him.\u003c/p\u003e\n\u003cp\u003e“Was it you and Frank who shot my friend?”\u003c/p\u003e\n\u003cp\u003eI was like a dog when the leash breaks. I pounded my fist into his solar plexus. Once. Twice. Three times. Four times.\u003c/p\u003e\n\u003cp\u003eHis body convulsed. He retched and gagged, and I pushed him away just as the vomit spewed from his mouth. He crumbled to the asphalt and rolled into a ball. I aimed the toe of my shoe at his stomach but paused while Danny threw up on himself.\u003c/p\u003e\n\u003cp\u003e“Hey, Danny.” I was surprised by how relaxed my voice sounded. “Where’s Frank, Danny?”\u003c/p\u003e\n\u003cp\u003eHe coughed and sputtered, and I thought he might answer me. But a Chevy Blazer drove up fast and skidded to a stop next to his writhing body. There was a man behind the steering wheel. I couldn’t tell how tall or wide he was, but he had brown hair, and his black eyes—I’ve skated on ice that was warmer.\u003c/p\u003e\n\u003cp\u003eAnd I remembered. Danny had said, “We’re.” Plural. How could I have missed that?\u003c/p\u003e\n\u003cp\u003eAnd something else. The guys who shot at Nina and me were driving a Chevy Blazer.\u003c/p\u003e\n\u003cp\u003e“Sonuvabitch,” I yelled.\u003c/p\u003e\n\u003cp\u003eThe driver reached across his body with his right hand. There was a gun in his hand. He pointed it out the window. I was already moving. I dove backward and rolled and crawled behind the Cherokee. I heard a single shot. Crouching low, I ran along the rim of the parking lot, keeping the other vehicles between me and the driver. I had a permit—it had been issued by a friend of mine, the Itasca County sheriff—but I wasn’t carrying. Don’t ask me why. Fortunately, the driver wasn’t chasing me. I paused long enough to peer cautiously around a bumper. The driver was helping Danny into the SUV. He was as Janel had described him. Big. Solid. He saw me watching and pointed his gun in my direction. Only he didn’t fire. Instead, he scrambled into the SUV and accelerated toward the exit from the parking lot. I caught only part of his license plate as he turned onto Highway 212. A moment later, he was gone. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-24.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
