{"id":106388,"no":42,"title":"Page 42","content":"\u003cp\u003eThe Easy Cash pawnshop was located in a Minneapolis neighborhood of dopers, prostitutes, gangbangers, immigrants, working poor, and other unreliable credit risks that so far had remained untouched by attempts at gentrification and social tinkering. Yet there was nothing desperate about the shop itself. It was light and airy and clean and at first glance resembled any department store you’ve ever been in. If there was a difference, it was in the astonishing array of merchandise—over twelve thousand square feet of VCRs and DVDs, computers, electric guitars, jewelry, tools, bicycles, lawn mowers, even motorcycles and snowmobiles. If a product had financial value, Easy Cash traded in it. The only exception was guns. There was a large sign next to the front entrance that read EASY CASH DOES NOT BUY OR SELL GUNS OF ANY KIND. YOU ARE PROHIBITED FROM CARRYING A GUN ON THESE PREMISES.\u003c/p\u003e\n\u003cp\u003eI was met at the door by a young man who wore a blue tie; all employees of Easy Cash were required to wear ties and dress shirts. I asked for the owner, and he pointed at Marshall Lantry. Lantry, who was wearing a tan sports jacket to go with his shirt and tie, was standing behind a counter in the center of the store. The counter was on a foot-high platform. I had convinced Lantry to build the platform in order to discourage miscreants from attempting to come over the top of the counter for either the cash register or him and his employees. Above and behind his shoulder were mounted posters of Anna Kournikova, Taye Diggs, and Jennifer Lopez. Hanging right above the posters were security cameras. The way I had explained it to Lantry, the posters would encourage customers—male and female alike—to look up, which in turn would help the security cameras to get a good shot of their faces.\u003c/p\u003e\n\u003cp\u003eThe corners of Lantry’s mouth were curled upward into a smile. Since his mouth always curled that way, giving Lantry a pleasant grin that never disappeared, I didn’t know if he was happy to see me or not.\u003c/p\u003e\n\u003cp\u003e“Damn, McKenzie,” he said. “I was just talking about you with Chopper. You remember Chopper.”\u003c/p\u003e\n\u003cp\u003eChopper was a borderline sociopath who took a bullet in the spine and now conducts his many illicit enterprises from a wheelchair that he maneuvers with motorcycle-like speed and recklessness.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know Chopper.”\u003c/p\u003e\n\u003cp\u003e“He was just saying that everyone he knows is either a mean sonuvabitch or an asshole ’cept you.”\u003c/p\u003e\n\u003cp\u003e“High praise indeed.”\u003c/p\u003e\n\u003cp\u003e“He was sayin’ how you saved his life.”\u003c/p\u003e\n\u003cp\u003e“All I did was call EMS after finding his bullet-riddled butt on the sidewalk.”\u003c/p\u003e\n\u003cp\u003e“That’s not the way he says it.”\u003c/p\u003e\n\u003cp\u003e“Chopper has always been prone to exaggeration.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, I agree with him. You ain’t a sonuvabitch or an asshole.”\u003c/p\u003e\n\u003cp\u003e“Stop it, Marsh. You’re giving me a swelled head.”\u003c/p\u003e\n\u003cp\u003e“As compared to other things that inflate.”\u003c/p\u003e\n\u003cp\u003eI glanced up at Anna, and Lantry chuckled.\u003c/p\u003e\n\u003cp\u003e“So, you buyin’ or sellin’?”\u003c/p\u003e\n\u003cp\u003e“Buying.”\u003c/p\u003e\n\u003cp\u003e“I just got in a couple of great speakers if you’re lookin’ to expand that sound system of yours.”\u003c/p\u003e\n\u003cp\u003e“Actually, I have something a little more high-tech in mind.”\u003c/p\u003e\n\u003cp\u003e“High-tech as in … oh.” Lantry leaned over the counter. The sparkle in his eyes added to his permanent smile. “You want to talk serious business?”\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eA few moments later, Lantry led me to a tiny room in his basement. I thought of Phu. So many of today’s entrepreneurs conduct business out of their cellars.\u003c/p\u003e\n\u003cp\u003eMetal shelves were pushed against each of the four walls. Electronic surveillance gear, both new and used, was stacked on the shelves: bugs made to resemble electrical outlets and phone jacks, audio recorders, video cameras in every shape and size including a fountain pen, microwave and satellite dishes, and a lot of stuff I couldn’t identify. Seven years ago, city officials had shut Lantry down for running illegal poker tournaments. That’s how I met him, playing Texas Hold ’Em. If they knew about this setup, they’d probably send him to prison.\u003c/p\u003e\n\u003cp\u003eLantry said, “You realize that it’s illegal to intercept and record conversations without the consent of the folks involved, right?”\u003c/p\u003e\n\u003cp\u003e“It’s also illegal to sell bugs for the purpose of intercepting conversations.”\u003c/p\u003e\n\u003cp\u003e“And it’s illegal for you, the customer, to buy bugs for the purpose of intercepting conversations. I have a copy of the statute around here somewhere.”\u003c/p\u003e\n\u003cp\u003e“You’re telling me this why?”\u003c/p\u003e\n\u003cp\u003e“I just want to make sure you know what you’re doin’.”\u003c/p\u003e\n\u003cp\u003e“That’s a different question altogether.”\u003c/p\u003e\n\u003cp\u003e“So it is.” Lantry rested his hand on an office calculator. “I just got this in. It not only transmits conversations and video images for over two hundred meters, it actually calculates. Cool, huh?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003e“So what do you want to surveil? House? Apartment?”\u003c/p\u003e\n\u003cp\u003e“Trailer.”\u003c/p\u003e\n\u003cp\u003e“Trailer?”\u003c/p\u003e\n\u003cp\u003e“A mobile home.”\u003c/p\u003e\n\u003cp\u003e“A mobile … where?”\u003c/p\u003e\n\u003cp\u003e“City of Hilltop.”\u003c/p\u003e\n\u003cp\u003e“Where the hell is that?”\u003c/p\u003e\n\u003cp\u003eI explained.\u003c/p\u003e\n\u003cp\u003e“Hell, I musta driven by that place a thousand times and didn’t know it was there.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-42.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
