{"id":106392,"no":46,"title":"Page 46","content":"\u003cp\u003e“What kind of music do you write?”\u003c/p\u003e\n\u003cp\u003e“Ballads mostly. We haven’t sold a lot in the past couple of years. Mostly we’ve sold to artists like Bonnie Raitt who wanted something a little different to help fill out an album. No one has ever released one of our songs as a single. But Tommy thinks—Tommy’s my partner. Tommy Heyward. Glass and Heyward. I write music and he writes lyrics. Tommy thinks we’re in exactly the right place at exactly the right time because good old-fashioned crooning is coming back into vogue. Think about it. Rod Stewart goes platinum with an album of standards. Boz Scaggs, B. B. King, Diana Krall, k. d. lang and Tony Bennett, Harry Connick, of course, Lizz Wright, Michael Buble, Brian Evans, Peter Cincotti—they’re all expanding the audience for the kind of music we like to write. And then Norah Jones comes along. I absolutely, unequivocally adore Norah Jones. Seven million copies of Come Away With Me and counting. A young woman introducing that sexy, smoky, jazzy balladry to a generation that didn’t have anyone its own age performing grown-up music. So much is geared toward the teen market these days, Britney and Christina and Justin, puhleez, and rap, which is—ugghh!—that there’s been a backlash from people in their twenties, people who feel abandoned by the record industry, and crooners are a part of it. It’s a good backlash. Audiences are suddenly reaching out for a cooler, more sophisticated, more artfully arranged kind of music, which is what I write. Now, all of a sudden artists and producers and record companies who wouldn’t answer our phone calls are calling us. Amazing. I’m going to stop talking now and take a deep breath. I hope you don’t mind.”\u003c/p\u003e\n\u003cp\u003eNow I was laughing.\u003c/p\u003e\n\u003cp\u003eA white van was parked in the Hilltop Motel lot just below my second-floor room. The colorful name and logo that was on its side earlier had been removed.\u003c/p\u003e\n\u003cp\u003eI entered my room without knocking. The drapes had been closed, and there was little light. Marshall Lantry was lying on my bed watching Oprah. He said, “Attractive woman. I don’t blame you for taking your time.”\u003c/p\u003e\n\u003cp\u003e“Did everything go all right?”\u003c/p\u003e\n\u003cp\u003e“Hey. It’s me.”\u003c/p\u003e\n\u003cp\u003eI cut the power to the TV with the remote. “I know it’s you. Did everything go all right?”\u003c/p\u003e\n\u003cp\u003e“Yes. Fine. Perfect. Six minutes in and out. You know, the lady doesn’t even bother to lock her door.”\u003c/p\u003e\n\u003cp\u003e“I like that about her.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but c’mon. How foolish is that?”\u003c/p\u003e\n\u003cp\u003eI didn’t have an answer.\u003c/p\u003e\n\u003cp\u003eLantry rolled off the bed and moved to the desk. He switched on the lamp to reveal a receiver and a tape recorder. The receiver was pocket-sized, assuming your pockets were slightly larger than mine. The tape recorder was a standard-sized portable with a few extra dials and gauges that required explanation. They were united by two coaxial cables. The entire thing could easily fit inside a small desk drawer, so that’s where I put it. There were no electrical cords. Lantry said the unit was operated by a battery with a thirty-day charge.\u003c/p\u003e\n\u003cp\u003eLantry gave me a crash course, demonstrating how to use the voice-activated recording function and adjust the volume. The bug was already transmitting. I could hear Pen washing dishes and humming a tune that I couldn’t identify. I guessed it was one of hers.\u003c/p\u003e\n\u003cp\u003e“Nice job,” I told Lantry.\u003c/p\u003e\n\u003cp\u003e“Now for the bad news,” he said.\u003c/p\u003e\n\u003cp\u003e“Bad news?”\u003c/p\u003e\n\u003cp\u003e“Someone else is also listening.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“There are at least two other bugs—one in her living room, one in her bedroom—and the phones are tapped.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Someone is conducting an audio surveillance of your girl. Someone close. The equipment is very short range. Kinda shoddy, too, if you ask me. Nearly obsolete.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“How should I know who? The bugs don’t have labels on them, you know.”\u003c/p\u003e\n\u003cp\u003e“Jeezus.”\u003c/p\u003e\n\u003cp\u003eThe news forced me backward until the backs of my knees hit the edge of the bed and I sat down.\u003c/p\u003e\n\u003cp\u003e“You know, it’s always something,” said Lantry.\u003c/p\u003e\n\u003cp\u003e“Isn’t it, though. You left the bugs in? Didn’t tamper with them?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I mean no. I mean I didn’t touch the bugs.”\u003c/p\u003e\n\u003cp\u003e“Did they hear you?”\u003c/p\u003e\n\u003cp\u003e“They heard someone, but I doubt they knew what I was doing.” Lantry showed me his perpetual smile. “Nothing personal,” he said, “but stay away from me for awhile.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-46.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
