{"id":106401,"no":57,"title":"Page 57","content":"\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eThe sun was shining and the birds were singing, but I spent most of Saturday inside my motel room. Time passed slowly. I don’t know what Pen was doing alone in her trailer, but she did it quietly. Sykora had left at a little after 9:00 A.M. “I’m sure you understand,” he told her. Pen didn’t say if she did or didn’t. Since then I’d heard very little over the receiver, just enough rustling sounds to convince me Pen was still there.\u003c/p\u003e\n\u003cp\u003eThe morning stretched into afternoon. I watched the Baseball Game of the Week on Fox with the sound off and was astonished when they started doing the wave at Busch Stadium. Rogers Hornsby must’ve rolled over in his grave. I don’t like the wave. Or playing loud music between innings and before every at bat. Or scoreboards that tell the crowd when to cheer. Or guys who wear suits and ties to the ballpark. Or the designated hitter, for that matter. But mostly I don’t like the wave.\u003c/p\u003e\n\u003cp\u003eEarly in the third inning, Pen’s telephone rang. I hit the record button and listened.\u003c/p\u003e\n\u003cp\u003e“Hello,” she said.\u003c/p\u003e\n\u003cp\u003e“Is your husband home?” The voice was definitely Frank’s.\u003c/p\u003e\n\u003cp\u003e“Who’s calling, please?”\u003c/p\u003e\n\u003cp\u003e“Never mind that. Is Sykora home?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. He’s not in at the moment. May I take a message?”\u003c/p\u003e\n\u003cp\u003e“Shit,” Frank said and hung up.\u003c/p\u003e\n\u003cp\u003ePen did the same.\u003c/p\u003e\n\u003cp\u003eIn the bottom of the eighth, the phone rang again. This time it was Sykora.\u003c/p\u003e\n\u003cp\u003eHe said, “You have to stop being angry at me.”\u003c/p\u003e\n\u003cp\u003e“I’m not angry.”\u003c/p\u003e\n\u003cp\u003e“Yes, you are. And whenever you get angry at me I get this terrible, hollow feeling in my stomach that makes me think that something awful is going to happen.”\u003c/p\u003e\n\u003cp\u003e“I’m not angry,” Pen repeated.\u003c/p\u003e\n\u003cp\u003e“I’m trying, Pen. Honest to God, I am.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Let’s go out for dinner tonight.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“You pick the restaurant.”\u003c/p\u003e\n\u003cp\u003e“Ruth Schramm—you know Ruth—she told me about a northern Italian restaurant called Lido’s in Roseville that’s supposed to have a simply divine terrace. It’s such a beautiful day—we could eat outside.”\u003c/p\u003e\n\u003cp\u003e“Make a reservation.”\u003c/p\u003e\n\u003cp\u003e“I will. Oh,” added Pen. “Someone called asking for you. He didn’t leave a name or message, only an obscenity.”\u003c/p\u003e\n\u003cp\u003eSykora paused a moment, then said, “I’ll see you in a little bit.”\u003c/p\u003e\n\u003cp\u003eAfter Sykora hung up the phone, there was plenty to listen to on the receiver. Pen making a reservation for two at Lido’s. Pen humming. Pen taking a shower. Pen getting dressed. Pen humming some more.\u003c/p\u003e\n\u003cp\u003eThe phone rang again.\u003c/p\u003e\n\u003cp\u003ePen stopped humming.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Sykora told her.\u003c/p\u003e\n\u003cp\u003e“You said—”\u003c/p\u003e\n\u003cp\u003e“I know what I said.”\u003c/p\u003e\n\u003cp\u003e“This is ridiculous.”\u003c/p\u003e\n\u003cp\u003e“It’s the job.”\u003c/p\u003e\n\u003cp\u003e“You work your damn job. I’m going to dinner.”\u003c/p\u003e\n\u003cp\u003ePen hung up the phone. I heard the opening and closing of a drawer followed by the rustling of pages—I guessed a telephone book. Pen picked up the phone again. She booked a cab.\u003c/p\u003e\n\u003cp\u003eThe cabbie was knocking on her trailer door at about the time I finished dressing.\u003c/p\u003e\n\u003cp\u003ePen was standing with her back to the door when I entered Lido’s. She was having a heated discussion with the ma?tre d’. Something about her reservation.\u003c/p\u003e\n\u003cp\u003eShe looked carefully put together—hair swept back, light makeup expertly applied, wearing a rose-colored ruffled silk dress that conjured images of village greens and ice cream socials and soft summer nights. I found myself watching her like you might watch a slowly flowing river or clouds in the sky.\u003c/p\u003e\n\u003cp\u003eAfter a few moments I came up behind her.\u003c/p\u003e\n\u003cp\u003e“We have to stop meeting like this.”\u003c/p\u003e\n\u003cp\u003eThe scowl on her face for the ma?tre d’ was quickly transformed into a brilliant smile just for me.\u003c/p\u003e\n\u003cp\u003e“Jake. What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I thought I’d treat myself to something a few notches above fast food. Ruth Schramm put me onto this place.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“Where’s the main squeeze?”\u003c/p\u003e\n\u003cp\u003e“Steve.” She said the name like she didn’t like the sound of it. “He’s too busy to have dinner with his wife.”\u003c/p\u003e\n\u003cp\u003e“He’s a moron.”\u003c/p\u003e\n\u003cp\u003ePen didn’t say if she agreed or not.\u003c/p\u003e\n\u003cp\u003e“I’m so happy you’re here,” she said. “This young man”—she gestured at the ma?tre d’—“insists they will only seat parties of two or more on the terrace, regardless of my reservation.”\u003c/p\u003e\n\u003cp\u003e“If the lady and gentleman would care to dine together,” said the kid.\u003c/p\u003e\n\u003cp\u003e“Just what I was thinking,” Pen said.\u003c/p\u003e\n\u003cp\u003e“I don’t want to intrude.”\u003c/p\u003e\n\u003cp\u003e“Don’t be silly. I’m glad for your company.”\u003c/p\u003e\n\u003cp\u003eA few moments later a waiter sat us at a table beneath a huge oak tree whose branches spread out over the terrace. There were two dozen other tables, all filled except for three, and they stayed empty only for a few minutes. I didn’t blame the restaurant for its restrictive seating policy. In Minnesota when the weather is good, an outdoor restaurant table is prime real estate.\u003c/p\u003e\n\u003cp\u003e“I looked you up on the Internet,” I told Pen after we were seated. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-57.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
