{"id":106422,"no":79,"title":"Page 79","content":"\u003cp\u003eIt wasn’t a question, so I didn’t reply. Instead, I asked, “Do you have your cell phone?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Sykora reached into his pocket.\u003c/p\u003e\n\u003cp\u003eI set my flashlight on the ground next to the binoculars and took Sykora’s phone. I held it with one hand, punching the numbers on the keypad with my thumb by the light of Sykora’s flash, while holding Danny’s wallet with the other. When Bobby Dunston didn’t answer by the fourth ring, I knew he wasn’t going to. Still, I waited, and in the middle of the sixth ring I was rewarded by a voice that said, “St. Paul Police Department, Detective Shipman.”\u003c/p\u003e\n\u003cp\u003e“Jeannie?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“This is McKenzie.”\u003c/p\u003e\n\u003cp\u003e“They haven’t arrested you yet?”\u003c/p\u003e\n\u003cp\u003eI was looking at Sykora when I said, “No, they haven’t arrested me yet.” Sykora frowned. “Is Bobby around?”\u003c/p\u003e\n\u003cp\u003e“Checked out for the evening.”\u003c/p\u003e\n\u003cp\u003e“Maybe you can help me.”\u003c/p\u003e\n\u003cp\u003e“Help you what?”\u003c/p\u003e\n\u003cp\u003e“I need a favor.”\u003c/p\u003e\n\u003cp\u003e“What do you have in mind?”\u003c/p\u003e\n\u003cp\u003e“Can you pull up a guy for me on C-JIS, named Fuches, F-U-C-H-E-S, first names Daniel James?”\u003c/p\u003e\n\u003cp\u003e“You know, McKenzie, the St. Paul Police Department frowns on accessing the state’s Criminal Justice Information Systems computer for personal use.”\u003c/p\u003e\n\u003cp\u003e“Help me out, Jean.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause while Jeannie considered my request. She said, “You know what I like about you, McKenzie? You’re a quid pro quo kinda guy.”\u003c/p\u003e\n\u003cp\u003e“I am?”\u003c/p\u003e\n\u003cp\u003e“Someone does you a favor and you’re always sure to return it.”\u003c/p\u003e\n\u003cp\u003e“I don’t suppose you’re familiar with the maxim ‘A good deed is its own reward’?”\u003c/p\u003e\n\u003cp\u003e“I must’ve missed that one.”\u003c/p\u003e\n\u003cp\u003eI gave it a few moments’ thought, then said, “If I’m not mistaken, you’re a Sheryl Crow fan.”\u003c/p\u003e\n\u003cp\u003e“Yes, I am.”\u003c/p\u003e\n\u003cp\u003e“I hear she’s coming to the Xcel Center in St. Paul next month.”\u003c/p\u003e\n\u003cp\u003e“She is. Concert’s already sold out.”\u003c/p\u003e\n\u003cp\u003e“I can get you tickets.”\u003c/p\u003e\n\u003cp\u003e“You can?”\u003c/p\u003e\n\u003cp\u003e“Main floor center.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“I know a guy.”\u003c/p\u003e\n\u003cp\u003e“Of course you do. Two tickets?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003e“And perhaps you’ll join me?”\u003c/p\u003e\n\u003cp\u003eI hesitated. “Perhaps I will.”\u003c/p\u003e\n\u003cp\u003e“Hang on. I need to switch to a different phone.”\u003c/p\u003e\n\u003cp\u003eJeannie put me on hold. Nearly two minutes passed in silence while I waited. I was thinking, it wouldn’t kill me if I took out Bobby’s “young, beautiful, smart-as-hell” partner, but Nina might. Best to not tell her. I wasn’t sure exactly what our relationship was, but I was going back to my life, and lately she had been one of the better parts of it. Best to keep it from Bobby, too. A moment later, Jeannie was back on the line.\u003c/p\u003e\n\u003cp\u003e“Let’s see—Daniel James Fuches. Bunch of DWIs, a few dis cons, questioned for two burglaries and one armed robbery but nothing came of it, charges filed on a first-degree sexual assault, then dropped when the victim refused to testify—what do you need? Anything specific?”\u003c/p\u003e\n\u003cp\u003e“I’m looking for any kind of reference to a guy named Bruce or Brucie.”\u003c/p\u003e\n\u003cp\u003e“Bruce or Brucie … Bruce David Fuches, arrested and charged along with Daniel on the sexual assault.”\u003c/p\u003e\n\u003cp\u003e“They’re brothers?” Even as I said it, I didn’t believe it. Danny and Brucie looked so unlike each other.\u003c/p\u003e\n\u003cp\u003e“Brothers, cousins, uncles, I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Let’s take a look at him.”\u003c/p\u003e\n\u003cp\u003eJeannie sighed like she had plans and I was keeping her from them. Thirty seconds later she said, “Looking, looking … Here we go. Bruce David Fuches. A couple of burglaries, both dismissed, armed robbery dismissed, first-degree sexual assault, same deal as Daniel … one, two … five A\u0026amp;B’s, four dismissed, but finally with the fifth he took a six-month jolt, year probation. These guys, both of ’em, a couple of low-level habituals.”\u003c/p\u003e\n\u003cp\u003e“Gangster wannabes.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Never mind. Do you have an address?”\u003c/p\u003e\n\u003cp\u003e“Same as Daniel’s.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Jean.”\u003c/p\u003e\n\u003cp\u003e“I’ll be looking forward to the concert.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003eI deactivated the cell phone and handed it back to Sykora.\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003eI said, “Shut up.”\u003c/p\u003e\n\u003cp\u003eThe address was in Norwood Young America. It was only about five miles from where Mr. Mosley had lived, but I didn’t know that part of the area, and it took me a while to find it. Sykora didn’t mention Danny during the drive. I thought that was good of him.\u003c/p\u003e\n\u003cp\u003eBruce Fuches lived in a small clapboard house with worn shingles and white paint peeling from the clapboard. Even in the dark I could tell that the yard needed work. Sykora and I walked up the front walk. His Glock was out and resting on his thigh. My gun was still parked between my belt and the small of my back, but my sports coat hung open. When we reached the door, Sykora slid to the side, out of sight. I knocked. A light went on and the door opened.\u003c/p\u003e\n\u003cp\u003e“Yeah,” a woman said.\u003c/p\u003e\n\u003cp\u003eShe swung her head, and long black hair swept from one shoulder to the other. She was wearing blue jeans and a white T-shirt cut off just above the navel. There wasn’t much muscle tone under the shirt. I was guessing the beer can she held in her hand had something to do with it. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-79.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
