{"id":106425,"no":82,"title":"Page 82","content":"\u003cp\u003eShe was a slightly overweight woman of about thirty with large brown eyes and reddish-brown hair with bangs, wearing jeans and a Minnesota Vikings sweatshirt. Her smile was infectious, and she reminded me of the kids working the booths on the first day of the Minnesota State Fair, all excited and enthusiastic. I wondered how she’d feel at the end of the season.\u003c/p\u003e\n\u003cp\u003eI mentioned, as I maneuvered around tables to the stick, that we seemed to be her only customers.\u003c/p\u003e\n\u003cp\u003e“It’s a late Monday evening in May,” she told me. “Weekends have been terrific since the fishing opener, and business will get even better next weekend when they open the bass season. But we don’t do much in the middle of the week until after the schools let out and people start taking vacations.”\u003c/p\u003e\n\u003cp\u003eMade sense to me. I took a long pull of the beer.\u003c/p\u003e\n\u003cp\u003e“Ask her,” Sykora called from the map.\u003c/p\u003e\n\u003cp\u003e“Ask what?” said the bartender.\u003c/p\u003e\n\u003cp\u003e“We’re looking for the cabin of a couple of guys we know on Whitefish.” I attempted to sound more casual about it than Sykora did. “Only the directions they gave us aren’t the best. We’re wondering if you can help us out.”\u003c/p\u003e\n\u003cp\u003e“Sure. Who are you talking about?”\u003c/p\u003e\n\u003cp\u003e“Danny and Bruce Fuches.”\u003c/p\u003e\n\u003cp\u003e“Oh, them.” The smile flickered on her face like a lightbulb that wasn’t sure if it was going to burn out.\u003c/p\u003e\n\u003cp\u003e“Have you seen them around?” I asked.\u003c/p\u003e\n\u003cp\u003e“They were in earlier, Bruce and some fat guy thinks he’s clever, kept insulting my resort.”\u003c/p\u003e\n\u003cp\u003e“What does he have against this place?” I asked. “This place is great.”\u003c/p\u003e\n\u003cp\u003eThe bartender’s smile returned to full wattage.\u003c/p\u003e\n\u003cp\u003e“Not just here. Minnesota in general.”\u003c/p\u003e\n\u003cp\u003e“Jerk,” I said and drank more beer.\u003c/p\u003e\n\u003cp\u003e“He wanted to use the phone, then got all bent outta shape because he thought I was listening to his conversation. I mean, who cares?”\u003c/p\u003e\n\u003cp\u003e“Some people’s children,” I said.\u003c/p\u003e\n\u003cp\u003eSykora stood next to the wall map. He looked amped as if he wanted to run across the room, leap over the bar, and shake the woman by her shoulders. Instead, he asked in a calm voice, “Do you know where we can find them?”\u003c/p\u003e\n\u003cp\u003e“Well, here,” the bartender said. She rounded the bar and walked to where Sykora was standing. She stood in front of the map, biting her lower lip while she studied it, then raised a long, delicate finger and pointed at a red square.\u003c/p\u003e\n\u003cp\u003e“That’s us,” she said. “Here.” She moved the finger about two inches to the left. “This is the Fuches cabin, at the very end of Little Whitefish Lake Road. Used to belong to old man Sevier. Now, he was a sweetheart.”\u003c/p\u003e\n\u003cp\u003e“How do we get there?” Sykora asked.\u003c/p\u003e\n\u003cp\u003e“All this between us and them, where Fuches is, all this is steep hills and rocks. So what you need to do, you need to swing way around here”—using her finger as a pointer, the bartender traced a convoluted series of roads—“to here and then drive across to here. This is Little Whitefish Lake Road, where the cabin is. But you want to be careful you don’t take Whitefish Lake Road by mistake, because that’ll take you to way the heck over here.”\u003c/p\u003e\n\u003cp\u003eSykora looked like he was already lost.\u003c/p\u003e\n\u003cp\u003e“What’s this?” I traced a thin line that extended directly from the resort to a spot on Little Whitefish Lake Road just short of the Fuches cabin.\u003c/p\u003e\n\u003cp\u003e“That’s a footpath, a trail.”\u003c/p\u003e\n\u003cp\u003e“Will the path take us to the Fuches cabin?” I asked.\u003c/p\u003e\n\u003cp\u003e“Uh-huh. If you don’t mind the walk. See, what a lot of people do, instead of driving out of their way to get here, to get to my place—I have a very nice dinner menu—what they’ll do, they’ll take this trail through the steep hills and rocks and some swamp, too. It’s a nice walk. Couple times a year, we go over, cut down the growth, keep it nice.”\u003c/p\u003e\n\u003cp\u003e“We can walk there from here?” Sykora said.\u003c/p\u003e\n\u003cp\u003e“Sure. It’s about, I don’t know, a little over a half mile. It’s dark out, but just stay on the trail and you’ll be all right.”\u003c/p\u003e\n\u003cp\u003e“Mind if we leave our car in your lot?” I asked.\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003eWe walked single file down the narrow path. We had flashlights but didn’t dare use them, instead relying on the modest amount of moonlight that managed to penetrate the overcast sky. It didn’t show us much, but it was enough to keep us from straying off into the thick brush that hugged both sides of the trail. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-82.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
