{"id":106427,"no":84,"title":"Page 84","content":"\u003cp\u003eFrank glanced my way just as I fired onetwothreefourfivesix rounds at him through the cabin wall. I saw his head spin, and then he dropped from sight.\u003c/p\u003e\n\u003cp\u003eI dashed to the front steps, up the steps, and through the door, my Beretta leading the way. The living room was cramped with ancient furniture, and fishing gear hung from nails hammered into the cheap wood paneling. Frank was lying on his side in the middle of it, clutching his belly with one hand and reaching for a sawed-off shotgun with the other. Sykora was kneeling on the floor in the far corner in front of Pen. He had set his Glock on a sofa and was hugging his wife. She was naked, her wrists and ankles bound to a wooden chair with duct tape.\u003c/p\u003e\n\u003cp\u003eFrank heaved himself forward a half inch and tried again for the sawed-off. I fell to my knees next to him, grabbed the barrel of the gun, and slid it across the floor to the screen door. It hit the door and wedged it open half a foot. I pivoted on my knees, the Beretta in front of me, searching for Brucie. He wasn’t there.\u003c/p\u003e\n\u003cp\u003eFrank looked at me like he was trying to remember my name.\u003c/p\u003e\n\u003cp\u003e“Fuckin’ McKenzie,” he said.\u003c/p\u003e\n\u003cp\u003eIn the corner Sykora pressed his forehead against Pen’s and chanted her name. Her eyes were red. There was a slight bruise behind her left eye, and the skin around the tape was red and raw. The severe light from the poorly shaded lamp on the table next to her caught her face, and for a moment I could see what she would look like when she was much older—still beautiful, with the kind of aristocratic grace that you gain only from conquering extreme adversity.\u003c/p\u003e\n\u003cp\u003ePen said, “I’m okay, I’m okay. He didn’t hurt me—yet.”\u003c/p\u003e\n\u003cp\u003eThe “yet” hung in the air like a threat.\u003c/p\u003e\n\u003cp\u003eI pointed the Beretta at Frank’s face.\u003c/p\u003e\n\u003cp\u003eFrank said, “I never touched her. Never laid a finger on her.”\u003c/p\u003e\n\u003cp\u003e“Where are her clothes?” I asked.\u003c/p\u003e\n\u003cp\u003e“Hey, now. There’s no harm in lookin’, is there?” He grinned like he couldn’t help himself.\u003c/p\u003e\n\u003cp\u003eI studied his face. There was an intelligence there, yet at the same time, he seemed a couple of steps removed from what you’d call normal.\u003c/p\u003e\n\u003cp\u003eI took up the slack on the trigger.\u003c/p\u003e\n\u003cp\u003eFrank’s eyes were wide, as if he were suddenly afraid to close them. His expression was unidentifiable. He said, “Don’t, now. Don’t. Don’t shoot me. You ain’t got any reason to shoot me. Girl’s okay. You can see. She’s right there.”\u003c/p\u003e\n\u003cp\u003eI glanced toward Pen. Sykora had freed one hand and was working on the other.\u003c/p\u003e\n\u003cp\u003e“Mr. Mosley,” I said.\u003c/p\u003e\n\u003cp\u003e“You mean the nigger? That’s what all this is about, ain’t it, McKenzie? That’s why you’re fuckin’ up my life. The nigger. Only I had nothin’ to do with him. I keep sayin’ so, but no one fuckin’ believes me.” I remembered that he had said that to Sykora over the phone when he wasn’t arguing for his life. “The lawyer’s wife? That wasn’t me, either. That was—you can’t get no fucking good help in Minnesota, I’m tellin’ ya. I told ’em just muss her up. But the boys, it was Danny and Brucie gettin’ outta hand.”\u003c/p\u003e\n\u003cp\u003eBrucie.\u003c/p\u003e\n\u003cp\u003eAgain I pivoted on my knees.\u003c/p\u003e\n\u003cp\u003e“Where is Bruce?”\u003c/p\u003e\n\u003cp\u003e“You can’t shoot me,” Frank said.\u003c/p\u003e\n\u003cp\u003eSure I can, I thought but didn’t say. First things first. I looked down at him.\u003c/p\u003e\n\u003cp\u003e“Where’s Bruce?”\u003c/p\u003e\n\u003cp\u003eHe shrugged as if he had never heard the name before.\u003c/p\u003e\n\u003cp\u003e“Don’t make me ask again,” I told him.\u003c/p\u003e\n\u003cp\u003eFrank smiled. Smiled the same way Danny had smiled at the motel in Chanhassen. One of those smart-ass grins you see when a loudmouth poker player fills a straight flush with the last draw. And I knew. Knew even before I felt the barrel of the sawed-off brush the back of my neck.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Bruce said, making my name sound like an obscenity.\u003c/p\u003e\n\u003cp\u003eSonuvabitch!\u003c/p\u003e\n\u003cp\u003e“Gotcha,” said Frank.\u003c/p\u003e\n\u003cp\u003eIn the corner, Sykora lunged for his Glock.\u003c/p\u003e\n\u003cp\u003e“Don’t!” Frank shouted. He added, “Don’t do anything stupid,” in a lower voice when Sykora held himself up. “Don’t want the little lady hurt now, do we, Fed?”\u003c/p\u003e\n\u003cp\u003eSykora looked at the Glock, his wife, back at the Glock. He raised his hands. Pen dropped her one free hand over her lap.\u003c/p\u003e\n\u003cp\u003eI glared at Sykora. This is your fault, my mind screamed. The first two times were my fault, but this one is yours. Dammit. You just couldn’t wait, could you?\u003c/p\u003e\n\u003cp\u003eFrank worked himself into a sitting position.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said.\u003c/p\u003e\n\u003cp\u003eHe made a gimme motion with his hand. I handed him the Beretta. He glanced at it, handed it off to Bruce. Bruce slipped the gun into his pocket.\u003c/p\u003e\n\u003cp\u003e“You,” he said, looking at Sykora. “On your knees. Put the Glock on the floor. Slide it under the couch.” Sykora did what he was told, then positioned himself so that he was kneeling directly between Pen and Brucie, shielding her naked body. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-84.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
