{"id":106428,"no":85,"title":"Page 85","content":"\u003cp\u003e“You,” Frank said to me. “You just stay there on your knees.”\u003c/p\u003e\n\u003cp\u003eFrank pushed his great bulk up and off the floor with terrific effort. I suspected it would have been hard going even if he didn’t have a hole in his side. He crossed the room and sat in an overstuffed chair. I turned on my knees to face him. Sykora and Pen were now on my right. They would have had to run over me to get to the door located on my left and slightly behind me. Only it didn’t make much difference. Brucie moved to Frank’s side. He now had a clear line of fire at all of us, and with the sawed-off, accuracy wasn’t an issue. No one was going anywhere.\u003c/p\u003e\n\u003cp\u003eFrank picked at his wound.\u003c/p\u003e\n\u003cp\u003e“That hurts,” he said.\u003c/p\u003e\n\u003cp\u003eThe cabin wall and his multiple layers of fat had reduced the impact of the 9mm slug. Instead of killing him, it had merely given him a bellyache. I couldn’t believe I had only hit him once out of six tries. I needed practice.\u003c/p\u003e\n\u003cp\u003e“I should have aimed higher,” I told him.\u003c/p\u003e\n\u003cp\u003eBrucie said, “He thinks he’s funny.”\u003c/p\u003e\n\u003cp\u003e“I noticed that,” said Frank.\u003c/p\u003e\n\u003cp\u003e“Let me kill him, Mr. Russo.”\u003c/p\u003e\n\u003cp\u003e“In a minute.”\u003c/p\u003e\n\u003cp\u003eBruce changed his grip on the sawed-off. He pointed it at my head with one hand. The other hand he filled with the seven-inch stainless steel combat knife he had threatened me with before.\u003c/p\u003e\n\u003cp\u003e“I wanna cut ‘im. Make ’im cry like a little girl for what he did to Danny.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah. In a minute,” Frank insisted.\u003c/p\u003e\n\u003cp\u003eBrucie smiled.\u003c/p\u003e\n\u003cp\u003eI adjusted my position.\u003c/p\u003e\n\u003cp\u003e“Stop,” he said. “Put your hands behind your back.”\u003c/p\u003e\n\u003cp\u003eI did. Then I sank backward, sitting on my heels. Because of the angle, my body now blocked Brucie’s view. He couldn’t see my hands slowly working my pant leg up, reaching for the .25 Iver Johnson that was taped to my ankle.\u003c/p\u003e\n\u003cp\u003eFrank poked his wound some more. There was surprisingly little blood. What there was he licked off his fingers with his tongue.\u003c/p\u003e\n\u003cp\u003e“Whaddaya think, Penny? You want some?”\u003c/p\u003e\n\u003cp\u003ePen gave him no sign of anything but her anger.\u003c/p\u003e\n\u003cp\u003eHe winked at her.\u003c/p\u003e\n\u003cp\u003e“You know what? This is really going to work out nice. Much better than I thought. Right, Bruce?”\u003c/p\u003e\n\u003cp\u003e“Sure, Mr. Russo.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” He pointed at Sykora. “I knew you’d be coming. A pretty wife like yours, you didn’t think I knew you’d be coming? True, I didn’t think you’d be bringing McKenzie. But c’mon. Who woulda thunk that?”\u003c/p\u003e\n\u003cp\u003e“Let Pen go,” Sykora said.\u003c/p\u003e\n\u003cp\u003e“I will, I will,” said Frank. “I said I would. How come no one ever believes me when I tell them shit?” Frank pointed again at Sykora. “I don’t suppose you brought my money with ya? No? I didn’t think so. But that’s okay. Doesn’t matter. Nothin’s changed. The deal’s the same. Tomorrow you’re gonna go get it for me. Just like I said before. Do that. Get the money, bring it back here, and you and the missus get away alive. Whaddaya say?”\u003c/p\u003e\n\u003cp\u003e“Just like that,” Sykora said. “I give you the money and Pen and I walk away?”\u003c/p\u003e\n\u003cp\u003e“Sure. Why not? I don’t hold a grudge.”\u003c/p\u003e\n\u003cp\u003e“What about McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Fuck do you care as long as you get what you want?”\u003c/p\u003e\n\u003cp\u003eEveryone was looking at me now.\u003c/p\u003e\n\u003cp\u003eFrank grinned.\u003c/p\u003e\n\u003cp\u003ePen said, “Jake?”\u003c/p\u003e\n\u003cp\u003e“Jake?” said Frank. “He tell you his name was Jake?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Pen.\u003c/p\u003e\n\u003cp\u003e“Then he’s a liar. Cuz he ain’t Jake. This here is McKenzie. McKenzie who shot me. McKenzie who’s been causing me nothin’ but trouble since I got to this lousy neck of the woods. Me, who ain’t never done nothin’ to him. Nothin’ at all. If I had, I’d say so.”\u003c/p\u003e\n\u003cp\u003e“Let me cut ’im,” Bruce said.\u003c/p\u003e\n\u003cp\u003e“Why not?” said Frank.\u003c/p\u003e\n\u003cp\u003eMy father was a hunter. He tried to instill in me a hunter’s patience. It was a life lesson, he said, learning not to rush, learning how to wait for your shot. It was a lesson I had learned well. But it was now or never. I threw a look at Sykora. A second’s diversion. It was all I asked.\u003c/p\u003e\n\u003cp\u003eBruce stepped forward. He raised his combat knife high in the air, prepared to slash down on me.\u003c/p\u003e\n\u003cp\u003e“Brucie,” Sykora shouted and dove under the sofa for the Glock.\u003c/p\u003e\n\u003cp\u003eBruce glanced at Sykora, calculated how long it would take for Sykora to fish the gun out, quickly turned to face me.\u003c/p\u003e\n\u003cp\u003eI rolled onto my shoulder and grabbed the butt of the .25.\u003c/p\u003e\n\u003cp\u003eIf he had fired the shotgun at that moment, I would have been killed. Instead, he brought the knife down in a long arc, slicing nothing but air. Brucie didn’t seem to mind that he missed. He was smiling the same damn smile he gave me in the parking lot of the motel in Chanhassen.\u003c/p\u003e\n\u003cp\u003eI yanked the gun free. Brought it up.\u003c/p\u003e\n\u003cp\u003eA half dozen shots—they sounded like howitzers in the small room. Only they weren’t my shots, I never fired.\u003c/p\u003e\n\u003cp\u003eA half dozen bullets slammed into Brucie, stitching him from his hip all the way to his head. Blood and bone and brain sprayed Frank and the back wall. Bruce fell against Frank’s chair as if someone had shoved him there, spun off, hit the wall behind the chair, and sunk to the floor.\u003c/p\u003e\n\u003cp\u003eFrank screamed and wiped at the blood and bone and brain. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-85.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
