{"id":106431,"no":89,"title":"Page 89","content":"\u003cp\u003eI took a sip of the coffee. It wasn’t bad. Not as good as Mr. Mosley’s, but better than mine.\u003c/p\u003e\n\u003cp\u003eI said, “Doesn’t it hurt, Lorenzo? Keeping it all inside?”\u003c/p\u003e\n\u003cp\u003eHe lowered his head and sighed. Something went out of him then.\u003c/p\u003e\n\u003cp\u003e“I loved ’im. Mr. Mosley.”\u003c/p\u003e\n\u003cp\u003e“Why did you kill him?”\u003c/p\u003e\n\u003cp\u003e“I didn’ mean to.” Hernandez turned away from the door and walked back into the kitchen, settling near the towel. He had moved slowly, yet I tightened my grip on the Beretta just the same. “Somet’ing ’appen to me. Inside of me. I try to get rid of it, but it don’ go ‘way. I thought, Mr. Mosley, ’e make it go ’way. But ’e don’t.”\u003c/p\u003e\n\u003cp\u003e“You were afraid.”\u003c/p\u003e\n\u003cp\u003e“I cannot go back to Guatemala.”\u003c/p\u003e\n\u003cp\u003e“So you killed him.”\u003c/p\u003e\n\u003cp\u003e“Sí.”\u003c/p\u003e\n\u003cp\u003eI don’t know exactly what I felt for Hernandez at that moment, but I didn’t hate him. There was no hate left in me, no rage. I had used it all up on Danny and Brucie and Frank. I felt my grip on the Beretta relax.\u003c/p\u003e\n\u003cp\u003e“Why don’t you lock up, Lorenzo.”\u003c/p\u003e\n\u003cp\u003e“Wha’ for?”\u003c/p\u003e\n\u003cp\u003e“I want you to come with me.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“I want you to go to Chaska with me and talk to a cop named Dyke.”\u003c/p\u003e\n\u003cp\u003e“Ju wan’ me to confess?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You’ll feel better.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“You said you loved Mr. Mosley, you said you didn’t mean to kill him …”\u003c/p\u003e\n\u003cp\u003eHe moved closer to the towel.\u003c/p\u003e\n\u003cp\u003e“We’ll tell them that. They’ll believe you.”\u003c/p\u003e\n\u003cp\u003eHe looked at me. His expression was childlike. “Wha’ will ’appen to me?”\u003c/p\u003e\n\u003cp\u003e“You’ll be all right.”\u003c/p\u003e\n\u003cp\u003e“I cannot go to prison.”\u003c/p\u003e\n\u003cp\u003e“It’s better than the alternative.”\u003c/p\u003e\n\u003cp\u003eHe studied me hard. He saw that my hand was under the table. He had to know that it wasn’t empty.\u003c/p\u003e\n\u003cp\u003e“Please,” I said again. “Come with me. We’ll talk to the county attorney. I’ll help you get the best deal possible. It’ll be so much better.”\u003c/p\u003e\n\u003cp\u003e“Better?”\u003c/p\u003e\n\u003cp\u003e“Better than reaching for the .22.”\u003c/p\u003e\n\u003cp\u003eHe didn’t believe me.\u003c/p\u003e\n\u003cp\u003eThe assistant county attorney for Carver County sat next to me at Mr. Mosley’s kitchen table. He had run out of questions to ask and had packed up his tape recorder and notebook. Lieutenant Dyke was leaning against the kitchen counter, his arms folded across his chest. The three of us were watching the wagon boys zip Hernandez into a black vinyl body bag. Dyke sighed deeply and sidled up next to the table. He rubbed the tips of his fingers over the four ugly holes I had drilled through the wood with the nine.\u003c/p\u003e\n\u003cp\u003e“Well,” he said.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I told him.\u003c/p\u003e\n\u003cp\u003eHe worked a pinkie into one of the bullet holes.\u003c/p\u003e\n\u003cp\u003e“He never had a chance, did he?”\u003c/p\u003e\n\u003cp\u003e“No,” I agreed. “But I gave him a choice.”\u003c/p\u003e\n\u003cp\u003e“Looks like he chose poorly.”\u003c/p\u003e\n\u003cp\u003eALSO BY DAVID HOUSEWRIGHT\u003c/p\u003e\n\u003cp\u003eFeaturing Rushmore McKenzie\u003c/p\u003e\n\u003cp\u003eA Hard Ticket Home\u003c/p\u003e\n\u003cp\u003eFeaturing Holland Taylor\u003c/p\u003e\n\u003cp\u003ePenance\u003c/p\u003e\n\u003cp\u003ePractice to Deceive\u003c/p\u003e\n\u003cp\u003eDearly Departed\u003c/p\u003e\n\u003cp\u003eJust So You Know\u003c/p\u003e\n\u003cp\u003eReverend Winfield spoke over the grave of Lorenzo Hernandez although no one else had come to hear him. He told me that even a killer deserved a decent burial. He said when the time came he’d be happy to preside at my funeral, too. I wasn’t quite sure how to take the remark, and let it go.\u003c/p\u003e\n\u003cp\u003eSykora resigned from the FBI and returned to New York with Pen. But he went out a hero, hailed for killing a suspected terrorist—that would be Brucie—who had targeted him and his wife after his heroic efforts helped shut down a cigarette-smuggling operation that was using profits to finance Islamic organizations with links to al-Qaeda. As evidence, the FBI singled out three Twin Cities convenience store owners—one Pakistani and two Saudis—who were prosecuted for donating money to a Moslem charity that the Justice Department claimed was funneling cash to the PLO.\u003c/p\u003e\n\u003cp\u003eFrank Russo’s moldering body was discovered in the locked trunk of an abandoned automobile with Minnesota plates. The car was found in Hunts Point in New York City, only a few blocks from where Russo had been born. It was labeled a “gangland hit,” and despite the description of Nick Horvath that Sykora and I had supplied, and the physical evidence obtained from his trailer, no arrests were made.\u003c/p\u003e\n\u003cp\u003eRoseanne Esjay’s story was never printed in the Times, or anywhere else for that matter. She didn’t explain what had happened, and I didn’t ask.\u003c/p\u003e\n\u003cp\u003eThe Seeking Information Alert issued on me was obviated, and the AIC of the Minneapolis field office made it clear that for the good of the bureau my name was never again to be uttered in the hallowed halls of the FBI—at least that’s what Harry told me. I had invited him and his wife for dinner, seating them next to Chopper, who seemed to delight his wife but made Harry nervous. He kept checking to see if his wallet was missing. \u003c/p\u003e","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-89.html","bookId":2224,"creation":"Oct 5, 2019 10:57:25 PM","modification":"Oct 5, 2019 10:57:25 PM"}
