{"id":71469,"no":13,"title":"Page 13","content":"\u003cp\u003eMelissa waved her hand dismissively, as if she didn’t feel like getting into it again. “In any case, I do think Wilden’s right about those notes. It’s not Ian. He wouldn’t be stupid enough to threaten you. Ian might be upset, but he’s not an idiot.”\u003c/p\u003e\n\u003cp\u003eSpencer turned away from her sister, frustrated, and peered out over the cold, empty front yard just as her mother’s car pulled into the driveway. Moments later, the door from the garage to the kitchen slammed, and Mrs. Hastings’s high heels clacked across the kitchen floor. Melissa sighed and padded down the hall. Spencer heard them murmuring, then the crackle of grocery bags.\u003c/p\u003e\n\u003cp\u003eSpencer’s heart began to pound. She had the urge to run upstairs, hide in her room, and try not to think about Ian or anything else, but this was her first opportunity to confront her mother about Nana’s will.\u003c/p\u003e\n\u003cp\u003eRolling back her shoulders, Spencer took a deep breath and walked down the long hallway into the kitchen. Her mother was leaning over the counter, pulling a fresh-baked rosemary bread loaf out of a Fresh Fields grocery bag. Melissa scuttled in from the garage, a case of Moët champagne in her arms.\u003c/p\u003e\n\u003cp\u003e“What’s all that champagne for?” Spencer asked, wrinkling her nose.\u003c/p\u003e\n\u003cp\u003e“The fund-raiser, of course.” Melissa shot her a duh look.\u003c/p\u003e\n\u003cp\u003eSpencer frowned. “What fund-raiser?”\u003c/p\u003e\n\u003cp\u003eMelissa lowered her chin, surprised. She glanced at their mother, but Mrs. Hastings continued unpacking organic vegetables and whole-wheat pasta, her lips pressed tightly together. “We’re having a Rosewood Day fund-raiser here this weekend,” Melissa explained.\u003c/p\u003e\n\u003cp\u003eA little squeak escaped from Spencer’s throat. A fund-raiser? Event planning was something she and her mom always did together. Spencer organized the invitations, helped plan the menu, took RSVP calls, and even arranged the classical music playlist. It was one of the few things Spencer did better than Melissa—few people were OCD enough to create dossiers on each invitee, complete with information as to who didn’t eat veal and who didn’t mind sitting next to the vile Pembrokes at dinner.\u003c/p\u003e\n\u003cp\u003eSpencer turned to face her mother, her heart pounding. “Mom?”\u003c/p\u003e\n\u003cp\u003eSpencer’s mother whirled around. She touched her diamond tennis bracelet protectively, as if she thought Spencer might try to steal it.\u003c/p\u003e\n\u003cp\u003e“Do you…need help with the fund-raiser?” Spencer’s voice broke.\u003c/p\u003e\n\u003cp\u003eMrs. Hastings tightly gripped the sides of a jar of organic blackberry preserves. “I’ve got it covered, thank you.”\u003c/p\u003e\n\u003cp\u003eThere was a cold hard knot at the pit of Spencer’s stomach. She took a deep breath. “I also wanted to ask you about Nana’s will. Why was I left out? Is it even legal to give some grandchildren money and not others?”\u003c/p\u003e\n\u003cp\u003eHer mother placed the preserves on a pantry shelf and let out a chilling snicker. “Of course it’s legal, Spencer. Nana can do whatever she wants with her money.” She pulled her black cashmere cape around her shoulders and strode past Spencer to the garage.\u003c/p\u003e\n\u003cp\u003e“But…,” Spencer cried. Her mother didn’t turn around. She slammed the door on her way out. The sleigh bells hanging from the doorknob jangled loudly, startling the two dogs from sleep.\u003c/p\u003e\n\u003cp\u003eSpencer’s body went slack. So that was it. She was really, truly disowned. Maybe her parents had told Nana about the Golden Orchid debacle a few months ago. Maybe they’d even encouraged Nana to alter her will, deliberately leaving Spencer out because she’d disgraced the family. Spencer squeezed her eyes shut, wondering what her life would be like right now if she’d just kept quiet and accepted the Golden Orchid award. Could she have gone on Good Morning America, as the other Golden Orchid winners had done, and accepted everyone’s congratulations? Could she seriously have attended a college that had given her early admission based on an essay she hadn’t written—and didn’t even really understand? If she’d just kept quiet, would there still be this chatter that Ian was going to be acquitted due to lack of reliable evidence?\u003c/p\u003e\n\u003cp\u003eShe leaned against the granite-topped island and let out a small, pathetic whimper. Melissa dropped a folded grocery bag to the table and walked over to her. “I’m so sorry, Spence,” she said quietly. She hesitated a moment and then wrapped her thin arms around Spencer’s shoulders. Spencer was too numb to resist. “They’re being so awful to you.”\u003c/p\u003e\n\u003cp\u003eSpencer plopped into a seat at the kitchen table, reached for a napkin from the holder, and dabbed at her teary eyes.\u003c/p\u003e\n\u003cp\u003eMelissa sat down next to her. “I just don’t understand it. I’ve been going over and over it, and I don’t know why Nana would leave you out of her will.”\u003c/p\u003e\n\u003cp\u003e“She hated me,” Spencer said flatly, her nose getting that peppery, about-to-sneeze feeling it always did whenever she was about to start bawling. “I stole your paper. Then I admitted I stole it. I’m a huge disgrace.”\u003c/p\u003e\n\u003cp\u003e“I don’t think it has anything to do with that.” Melissa leaned closer. Spencer could smell Neutrogena sunscreen—Melissa was so anal, she put on sunscreen even when she was going to be spending the entire day indoors. “Something about it was really suspect.”\u003c/p\u003e\n\u003cp\u003eSpencer lowered the napkin from her eyes. “Suspect…how?”\u003c/p\u003e\n\u003cp\u003eMelissa scraped the chair closer. “Nana left money to each of her natural-born grandchildren.” She tapped the kitchen table three times to emphasize the last three words, and then stared at Spencer searchingly, as if Spencer was supposed to deduce something from this. Then Melissa glanced out the window, where their mother was still unloading groceries from the car. “I think there are a lot of secrets in this family,” she whispered. “Things you and I aren’t allowed to know. Everything has to look all perfect on the outside, but…” She trailed off.\u003c/p\u003e\n\u003cp\u003eSpencer squinted. Even though she had no idea what Melissa was talking about, a sick, swooping feeling began to wash over her. “Will you just spit out what you’re trying to say?”\u003c/p\u003e\n\u003cp\u003eMelissa sat back. “Natural-born grandchildren,” she repeated. “Spence…maybe you were adopted.”\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eIF YOU CAN’T BEAT HER, JOIN FORCES WITH HER\u003c/p\u003e\n\u003cp\u003eWednesday morning, Hanna burrowed under her down comforter, trying to drown out the sound of Kate singing scales in the shower. “She’s so sure she’s going to get the lead in the play,” Hanna grumbled into her BlackBerry. “I wish I could see her face when the director tells her it’s Shakespeare, not a musical.”\u003c/p\u003e\n\u003cp\u003eLucas chuckled. “Did she seriously threaten to tell on you when you weren’t going to give her a tour of the school?”\u003c/p\u003e\n\u003cp\u003e“Basically,” Hanna growled. “Can I move in with you until we graduate?”\u003c/p\u003e\n\u003cp\u003e“I wish,” Lucas murmured. “Although we’d have to share a bedroom.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t mind,” Hanna purred.\u003c/p\u003e\n\u003cp\u003e“Me neither.” Hanna could tell he was smiling.\u003c/p\u003e\n\u003cp\u003eThere was a knock at the door, and Isabel poked her head in. Before she’d gotten engaged to Hanna’s father, she’d been an ER nurse, and she still wore hospital-issue scrubs to bed. Yecch. “Hanna?” Isabel’s eyes were even droopier than usual. “No talking on the phone if you haven’t made your bed, remember?”\u003c/p\u003e\n\u003cp\u003eHanna scowled. “Fine,” she said under her breath. Seconds after Isabel had hauled in her Tumi luggage and replaced the custom-made plantation shutters with purple, crushed-velvet drapes, she’d laid down all these rules: No Internet after 9 P.M. No talking on cell phones if chores weren’t finished. Absolutely no boys in the house when Isabel and Hanna’s father weren’t home. Hanna was basically living in a police state.\u003c/p\u003e\n\u003cp\u003e“I’m being forced to get off the phone,” Hanna said into her BlackBerry, loud enough for Isabel to hear.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” Lucas said. “I need to get moving. Photography club meets this morning.”\u003c/p\u003e\n\u003cp\u003eHe made a kissing sound and hung up. Hanna wiggled her toes, all of her irritations and worries melting away. Lucas was a way better boyfriend than Sean Ackard, and he almost made up for the fact that Hanna was essentially girlfriendless. He understood how hard she was taking what Mona had done to her, and he always snickered at her evil Kate stories. Plus, with a new salon haircut and a Jack Spade messenger bag to replace his ratty JanSport backpack, Lucas wasn’t half as dorky as he’d been when they first became friends.\u003c/p\u003e\n\u003cp\u003eOnce Hanna was certain Isabel had retreated down the hall to the bedroom she and Hanna’s father shared—double ughh—she crawled out of bed, haphazardly pulling up the covers so it looked like she’d made it. She then sat down at her makeup table and snapped on her LCD TV. The Action News Morning Report song blared out of the speakers. ROSEWOOD REACTS TO IAN THOMAS’S TEMPORARY RELEASE flashed in big black block letters at the bottom of the screen. Hanna paused. As much as she didn’t want to watch the report, she couldn’t tear her eyes away.\u003c/p\u003e\n\u003cp\u003eA petite, redheaded news reporter was at the local SEPTA train station, canvassing commuters for their thoughts about the trial. “It’s despicable,” said a thin, stately older woman in a high-necked cashmere coat. “They shouldn’t let that boy out for even a minute after what he did to that poor girl.”\u003c/p\u003e\n\u003cp\u003eThe camera moved to a dark-haired girl in her twenties. Her name, Alexandra Pratt, appeared below her face. Hanna recognized her. She’d once been Rosewood Day’s star field hockey player, but had graduated when Hanna was in sixth grade, a year ahead of Ian, Melissa Hastings, and Ali’s brother, Jason. “He’s definitely guilty,” Alexandra said, not bothering to take off her enormous Valentino sunglasses. “Alison occasionally played field hockey with a group of us on the weekends. Ian sometimes talked to Ali after the games. I never knew Ali that well, but I think he made her uncomfortable. I mean, she was so young.”\u003c/p\u003e\n\u003cp\u003eHanna uncapped her Mederma scar cream. That wasn’t how she remembered it. Ali’s cheeks flushed and her eyes lit up any time Ian was around. At one of their sleepovers, when they were practicing kissing on the monkey pillow Ali had sewn in sixth-grade home ec, Spencer had made each of them confess which boy they wanted to kiss in real life. “Ian Thomas,” Ali had blurted out, and then quickly covered her mouth.\u003c/p\u003e\n\u003cp\u003eIan’s senior picture was now on the screen, his smile so white, wide…and fake. Hanna looked away. Yesterday, after another awkward dinner with her new family, Hanna had dug out Officer Wilden’s business card from the bottom of her bag. She wanted to ask him how strict Ian’s house arrest was going to be. Would he be chained to his bed? Would he have on one of those ankle bracelet thingies that Martha Stewart had to wear? She wanted to believe Wilden was right about yesterday’s A note—that it was just a copycat—but every bit of reassurance would help. Plus, she thought Wilden might give her a little extra info. He’d always tried to be buddy-buddy with her back when he and her mom were dating.\u003c/p\u003e\n\u003cp\u003eOnly useless Wilden had said, “Sorry, Hanna, but I’m really not allowed to discuss the case.” Then, as Hanna was about to hang up, Wilden had cleared his throat. “Look, I want him to fry as much as you do. Ian deserves to be locked up for a long, long time for what he did.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-pretty-little-liars-5/page-13.html","bookId":2382,"creation":"Oct 5, 2019 10:20:38 AM","modification":"Oct 5, 2019 10:20:38 AM"}
