{"id":71480,"no":24,"title":"Page 24","content":"\u003cp\u003e“You should make your head bigger,” Aria grumbled.\u003c/p\u003e\n\u003cp\u003e“Want to see the Mii Noel Kahn made of you?” Mike clicked back to the main screen, tossing Aria a someone still likes you look. Noel had had a thing for Aria back in the fall. “He made one of himself, too. You guys could get it on in Wii-land.”\u003c/p\u003e\n\u003cp\u003eAria just slumped down in the couch, reached into the big plastic bowl that sat in the middle of the couch for another cheese curl, and said nothing.\u003c/p\u003e\n\u003cp\u003e“Here’s the Mii Xavier made.” Mike clicked over to a large-headed character with short hair and big brown eyes. “That dude kills at bowling. But I kicked his ass at tennis.”\u003c/p\u003e\n\u003cp\u003eAria scratched the back of her neck, an ambivalent heaviness in her chest. “So you…like Xavier?”\u003c/p\u003e\n\u003cp\u003e“Yeah, he’s pretty cool.” Mike clicked back to the Wii’s main menu. “Why, don’t you?”\u003c/p\u003e\n\u003cp\u003e“He’s…okay.” Aria licked her lips. She wanted to point out that Mike suddenly seemed to be taking their parents’ divorce in stride, considering that after they’d split up, he’d obsessively played lacrosse in the rain. But if she said something like that, Mike would roll his eyes and ignore her for a week.\u003c/p\u003e\n\u003cp\u003eMike glared at her, turning off the Wii and switching the television back to the news. “You’re acting like you’re on drugs or something. Are you nervous about the trial tomorrow? You’re going to rock on that witness stand. Just do some Jäger shots before you go up there. It’ll be all good.”\u003c/p\u003e\n\u003cp\u003eAria sniffed and stared at her lap. “Tomorrow’s just opening statements. I won’t be testifying until late next week at least.”\u003c/p\u003e\n\u003cp\u003e“So? Do a shot of Jäger tomorrow anyway.”\u003c/p\u003e\n\u003cp\u003eAria shot him a weary look. If only a Jäger shot could cure all her problems.\u003c/p\u003e\n\u003cp\u003eThe six o’clock news was on. The screen showed yet another shot of the Rosewood courthouse. A reporter was getting more civilians’ thoughts about the start of tomorrow’s big murder trial. Aria buried her head into the pillow, not wanting to watch.\u003c/p\u003e\n\u003cp\u003e“Hey, don’t you know that chick?” Mike asked, pointing at the TV.\u003c/p\u003e\n\u003cp\u003e“What chick?” Aria asked, her voice muffled by the pillow.\u003c/p\u003e\n\u003cp\u003e“That blind chick.”\u003c/p\u003e\n\u003cp\u003eAria whipped her head up. Sure enough, Jenna Cavanaugh was on television, a microphone thrust under her chin. She was wearing her fabulous, oversize Gucci sunglasses and a bright red wool coat. Her seeing-eye golden retriever was standing obediently by her side.\u003c/p\u003e\n\u003cp\u003e“I hope this trial is over quickly,” Jenna said to the reporter. “I think it’s bringing a lot of bad press to Rosewood.”\u003c/p\u003e\n\u003cp\u003e“You know, she’s pretty sexy for a blind chick,” Mike remarked. “I’d do her.”\u003c/p\u003e\n\u003cp\u003eAria groaned and smacked her brother with a pillow. Then, Mike’s iPhone bleated, and he jumped up and rushed out of the room. As he clomped up the stairs, Aria turned her attention back to the television. Ian’s mug shot popped up. His hair was a mess and he wasn’t smiling. After that, a camera panned over the snowy hole in the DiLaurentises’ backyard where Ali’s body had been found. The wind made the police tape flap and dance. A blurry shadow shimmered between two enormous pine trees. Aria leaned forward, her pulse suddenly racing. Was that…a person? The picture changed again, back to another shot of the reporter in front of the courthouse. “The case is proceeding as planned,” the reporter said, “but many are still saying the evidence is too thin.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t put yourself through this torture.”\u003c/p\u003e\n\u003cp\u003eAria whirled around. Xavier leaned against the doorway. He was wearing an untucked striped button-down, baggy jeans, and Adidas sneakers. A chunky watch dangled from his left wrist. His eyes flicked from the TV screen to Aria’s face.\u003c/p\u003e\n\u003cp\u003e“I, um, think Ella is still at the gallery,” Aria said. “She had to work a private show.”\u003c/p\u003e\n\u003cp\u003eXavier took a step into the room. “I know. We had coffee before she had to go back. There’s no electricity at my place, though—I guess ice knocked down some power lines. She said I could hang out here until we’re sure it’s back on.” He grinned. “Is that okay? I could make dinner.”\u003c/p\u003e\n\u003cp\u003eAria ran her hands through her hair. “Sure,” she said, trying to act natural. Things were fine between them, after all. She scooted to the corner of the couch and put the bowl of cheese curls on the coffee table. “You want to sit?”\u003c/p\u003e\n\u003cp\u003eXavier plopped down two cushions away. The news was walking through their projection of the night of Ali’s murder, complete with reenactments. “Ten thirty P.M., Alison and Spencer Hastings get into an argument. Alison leaves the barn,” a voice-over said. The girl who played Spencer looked pinched and sour. The petite blond girl who played Ali wasn’t nearly as pretty as the real Ali was. “Ten forty P.M., Melissa Hastings wakes up from a nap and notices that Ian Thomas is missing.” The girl who played Spencer’s sister looked like she was about thirty-five.\u003c/p\u003e\n\u003cp\u003eXavier looked at her hesitantly. “Your mom said you were with Alison that night.”\u003c/p\u003e\n\u003cp\u003eAria winced and nodded. “Ten fifty P.M., Ian Thomas and Alison are near the hole in the DiLaurentises’ backyard,” continued the voice-over. A shadowy Ian fought with Ali. “It’s alleged that there was a struggle, Thomas pushed DiLaurentis in and was back inside the house by eleven-oh-five.”\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” Xavier said softly. “I can’t even imagine what this must be like.”\u003c/p\u003e\n\u003cp\u003eAria bit her lip, hugging one of the couch’s chenille throw pillows to her chest.\u003c/p\u003e\n\u003cp\u003eXavier scratched his head. “I gotta say, I was really surprised when they announced Ian Thomas was their suspect. It seems like that kid had it all.”\u003c/p\u003e\n\u003cp\u003eAria bristled. So what if Ian was a groomed, well-mannered rich kid? It didn’t make him a saint.\u003c/p\u003e\n\u003cp\u003e“Well, he did,” Aria snapped. “End of story.”\u003c/p\u003e\n\u003cp\u003eXavier nodded sheepishly. “I didn’t mean for it to come out like that. Goes to show that you don’t really know anything about anyone, huh?”\u003c/p\u003e\n\u003cp\u003e“You can say that again,” Aria groaned.\u003c/p\u003e\n\u003cp\u003eXavier took a long sip from his water bottle. “Is there anything I can do to help?”\u003c/p\u003e\n\u003cp\u003eAria stared blankly across the room. Her mother still hadn’t taken down any of the family photos with Byron in them, including Aria’s favorite, one of all four of them standing on the edge of the Gullfoss waterfall in Iceland. They’d walked all the way out to the slippery edge of the cliff above the waterfall.\u003c/p\u003e\n\u003cp\u003e“You could beam me back to Iceland,” Aria said wistfully. “Because, unlike you and my brother, I loved it there. Puny horses and all.”\u003c/p\u003e\n\u003cp\u003eXavier smirked. His eyes twinkled. “Actually, I have a secret for you. I really like Iceland too. I said that stuff to get on Mike’s good side.”\u003c/p\u003e\n\u003cp\u003eAria’s eyes widened. “I can’t believe it!” She smacked him with her pillow. “You’re such a kiss-ass!”\u003c/p\u003e\n\u003cp\u003eXavier grabbed the pillow on his side of the couch and held it menacingly over his head. “A kiss-ass, huh? You’d better take that back!”\u003c/p\u003e\n\u003cp\u003e“Okay, okay.” Aria giggled, raising a finger. “Truce.”\u003c/p\u003e\n\u003cp\u003e“It’s too late for that,” Xavier cackled.\u003c/p\u003e\n\u003cp\u003eHe lowered down to his knees, his face close. Too close. And all of a sudden, his lips were pressed to hers.\u003c/p\u003e\n\u003cp\u003eIt took Aria a few stunned seconds to realize what was going on. Her eyes bulged. Xavier held her shoulders, his hands digging into her skin. Aria let out a small squeak and wrenched her head away. “What the hell?” she gasped.\u003c/p\u003e\n\u003cp\u003eXavier shot back. For a moment, Aria was too baffled to move. Then she shot up as fast as she could.\u003c/p\u003e\n\u003cp\u003e“Aria…” Xavier’s face crumpled. “Wait. I’m…”\u003c/p\u003e\n\u003cp\u003eShe couldn’t answer. Her knees buckled out from under her, and she nearly twisted her ankle as she climbed off the couch. “Aria!” Xavier called again.\u003c/p\u003e\n\u003cp\u003eBut Aria kept going. As she reached the top of the stairs, her Treo, which was sitting on the desk in her bedroom, started to chime. One new text message, the screen taunted.\u003c/p\u003e\n\u003cp\u003eGasping, she pounced on it and opened it up. The text was one simple word: Gotcha!\u003c/p\u003e\n\u003cp\u003eAnd, as usual, it was punctuated with a crisp, concise letter A.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eSPENCER HOLDS HER BREATH\u003c/p\u003e\n\u003cp\u003eThe flyer was pinned above the bike rack for everyone to see. Time Capsule Starts Tomorrow, it said in big black letters. Get ready!\u003c/p\u003e\n\u003cp\u003eThe final bell of the day rang. Spencer noticed Aria sitting on the stone wall, scribbling. Hanna stood next to Scott Chin, her cheeks round and puffy. Emily was whispering to some other swimmers, Mona Vanderwaal was unlocking her scooter, and Toby Cavanaugh was crouched under a distant tree, shoving a stick into a small pile of dirt.\u003c/p\u003e\n\u003cp\u003eAli pushed through the crowd and snatched down the flyer. “Jason’s hiding one of the pieces. And he’s going to tell me where it is.”\u003c/p\u003e\n\u003cp\u003eEveryone cheered. Ali pranced through the throng of kids and gave Spencer a high five. Which was startling—Ali had never paid attention to Spencer before, even though they lived next to each other.\u003c/p\u003e\n\u003cp\u003eBut today, it appeared they were friends. Ali bumped Spencer’s hip. “Aren’t you excited for me?”\u003c/p\u003e\n\u003cp\u003e“Uh, sure,” Spencer stammered.\u003c/p\u003e\n\u003cp\u003eAli narrowed her eyes. “You’re not going to try and steal it, are you?”\u003c/p\u003e\n\u003cp\u003eSpencer shook her head. “No! Absolutely not!”\u003c/p\u003e\n\u003cp\u003e“Yeah, she is,” said a voice behind them. A second, older Ali stood on the sidewalk. She was a little taller and her face was a little thinner. A blue string bracelet was tied around her wrist—the very bracelet Ali had made for them after The Jenna Thing—and she wore a pale blue American Apparel T-shirt and a rolled-up-at-the-waist hockey kilt. It was the same outfit Ali had worn to the end-of-seventh-grade sleepover in Spencer’s barn.\u003c/p\u003e\n\u003cp\u003e“She’s totally going to try and steal it from you,” the second Ali confirmed, giving Younger Ali a sidelong glance. “But she doesn’t. Someone else does.”\u003c/p\u003e\n\u003cp\u003eYounger Ali narrowed her eyes. “Right. Someone’s going to have to kill me to get my flag.”\u003c/p\u003e\n\u003cp\u003eThe crowd of Rosewood Day students parted, and Ian slipped through. He opened his mouth, an evil look on his face. If that’s what it takes, he was about to tell Ali. But when he breathed in to speak, he made a fire engine sound instead, shrill and piercingly loud.\u003c/p\u003e\n\u003cp\u003eBoth Alis covered their ears. Younger Ali took a step back.\u003c/p\u003e\n\u003cp\u003eOlder Ali put her hands on her hips, kicking Younger Ali with the side of her foot. “What’s wrong with you? Go flirt with him. He’s gorgeous.”\u003c/p\u003e\n\u003cp\u003e“No,” Younger Ali said.\u003c/p\u003e\n\u003cp\u003e“Yes,” Older Ali insisted. They were fighting as bitterly as Spencer and Melissa did.\u003c/p\u003e\n\u003cp\u003eOlder Ali rolled her eyes and faced Spencer. “You shouldn’t have thrown it away, Spencer. Everything you needed was there. All the answers.”\u003c/p\u003e\n\u003cp\u003e“Thrown…what away?” Spencer asked, confused.\u003c/p\u003e\n\u003cp\u003eYounger Ali and Older Ali exchanged a glance. A frightened look washed over Younger Ali’s face, like she suddenly understood what Older Ali was talking about. “It,” Younger Ali said. “That was a huge mistake, Spencer. And it’s almost too late.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-pretty-little-liars-5/page-24.html","bookId":2382,"creation":"Oct 5, 2019 10:20:38 AM","modification":"Oct 5, 2019 10:20:38 AM"}
