{"id":85587,"no":15,"title":"Page 15","content":"\u003cp\u003e\"Come back here.\" Stubbs grabbed Lancaster\u0027s arm at the elbow, dug into a pressure point with his thumb.\u003c/p\u003e\n\u003cp\u003eLancaster winced, tried to twist away. Stubbs held him one-handed.\u003c/p\u003e\n\u003cp\u003eThe detective finished the beer, tossed the bottle onto the floor. It rolled up against a stack of books. \"This way.\" Stubbs pulled Lancaster into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Hey.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up.\"\u003c/p\u003e\n\u003cp\u003eStubbs shoved the kid up against the kitchen cabinets. \"Stay put.\"\u003c/p\u003e\n\u003cp\u003eLancaster obeyed.\u003c/p\u003e\n\u003cp\u003eThe kitchen was dim and yellow, paint chipping on the cabinets. The linoleum needed a good scrub.\u003c/p\u003e\n\u003cp\u003eStubbs opened the refrigerator, took out another Grolsch, opened it. He smacked his lips, stood examining Lancaster\u0027s open refrigerator. \"Holy shit, kid. How do you live?\" There were two more beers, a jar of pickle brine, a soy sauce packet, and a defeated length of sagging celery.\u003c/p\u003e\n\u003cp\u003eHe closed the refrigerator again, gulped the beer as he opened random kitchen cabinets.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you need a warrant or something?\" Lancaster asked.\u003c/p\u003e\n\u003cp\u003eStubbs tapped his chest with a fat finger. Hard. \"You a lawyer, kid?\"\u003c/p\u003e\n\u003cp\u003e\"What department did you say you were with?\"\u003c/p\u003e\n\u003cp\u003e\"Drug Enforcement Agency, so don\u0027t yank me off, okay?\"\u003c/p\u003e\n\u003cp\u003eLancaster said, \"When you first came in you said you were with the Drug Enforcement Administration. Not Agency.\"\u003c/p\u003e\n\u003cp\u003eStubbs froze. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027d better go,\" Lancaster said. He was wary, but the tables were slowly turning. \"Or maybe I should call the local authorities, and we could all discuss this together.\" Lancaster was testing the waters. He had a piece of something and was pushing it now.\u003c/p\u003e\n\u003cp\u003e\"Now hold on, kid. Wait a minute.\" Stubbs was losing control of the situation, scrambling to get the upper hand again was making it worse. \"Dammit, I\u0027m with the Drug Enforcement- The DEA goddammit!\"\u003c/p\u003e\n\u003cp\u003eLancaster lifted the phone off the hook. It was an old rotary dial model on the kitchen wall. \"Let\u0027s get a few deputies over here.\"\u003c/p\u003e\n\u003cp\u003e\"Kid, don\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure impersonating an officer of the law is some kind of serious offense,\" Lancaster said. He had a full smug going. He didn\u0027t believe in Stubbs anymore.\u003c/p\u003e\n\u003cp\u003e\"Kid, I swear, you\u0027re making a mistake.\"\u003c/p\u003e\n\u003cp\u003eLancaster dialed.\u003c/p\u003e\n\u003cp\u003eStubbs grabbed the phone with two meaty hands and ripped it off the wall. Dropped it on the floor and kicked it. Lancaster was already running. He pushed past Stubbs, through the living room, making for the front door.\u003c/p\u003e\n\u003cp\u003eStubbs ran after him, dove at the kid\u0027s legs, and tangled him up. Both on the floor. Lancaster tried to kick Stubbs away, the heel of his shoe digging sharply into the top of Stubbs\u0027s head. Stubbs yanked his legs, climbed on top of them so he couldn\u0027t kick, punched Lancaster hard once in the gut.\u003c/p\u003e\n\u003cp\u003eLancaster whuffed air. His eyes bulged.\u003c/p\u003e\n\u003cp\u003eStubbs shifted up, sat on Lancaster\u0027s chest. Stubbs was huffing hard at the sudden exertion. Slick beer sweat under his arms and on his forehead. He felt the distant tug of nausea.\u003c/p\u003e\n\u003cp\u003e\"Drugs,\" Stubbs barked.\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t me. I-It was Ellis.\" Lancaster gulped air. Tears streaming from the sides of his eyes.\u003c/p\u003e\n\u003cp\u003eStubbs slapped him loud across the face. \"Who the fuck\u0027s Ellis?\"\u003c/p\u003e\n\u003cp\u003e\"Sherman Ellis. A student in my class with Professor Morgan. He had a whole bag of cocaine. I only even looked at it once.\"\u003c/p\u003e\n\u003cp\u003eA whole bag of coke? How much? Stubbs wondered.\u003c/p\u003e\n\u003cp\u003e\"Please, I can\u0027t breathe.\" Lancaster writhed beneath Stubbs\u0027s mass.\u003c/p\u003e\n\u003cp\u003eStubbs took Lancaster\u0027s throat in his hands. \"You\u0027ll get worse than that. How much coke? Did the Ellis kid say?\"\u003c/p\u003e\n\u003cp\u003e\"Like a hundred thousand bucks\u0027 worth. Maybe more. I don\u0027t know. He was going to dump it off for twenty and give me and Wayne a thousand just to go with him.\"\u003c/p\u003e\n\u003cp\u003e\"Wayne?\"\u003c/p\u003e\n\u003cp\u003e\"Another student.\"\u003c/p\u003e\n\u003cp\u003eA hundred thousand in coke. Stubbs knew some contacts in OK City. He could maybe unload the stuff for fifty or sixty easy. He felt his hands close on Lancaster\u0027s throat. Stubbs\u0027s own breath came hot with beer stink. His heart hammered in his head.\u003c/p\u003e\n\u003cp\u003eLancaster gagged, pulled at Stubbs\u0027s thick fingers.\u003c/p\u003e\n\u003cp\u003eStubbs could make a lot more on the coke than he could tracking down Annie for the Walshes. This was just the kind of opportunity he always kept an eye peeled for. His hands tightened again on Lancaster.\u003c/p\u003e\n\u003cp\u003eBut this kid. This damn-smart-ass, know-it-all kid. He couldn\u0027t let him call the cops. They\u0027d pull his license and slap a charge on him for sure. He couldn\u0027t let the kid talk. No way.\u003c/p\u003e\n\u003cp\u003eLancaster bucked, scratched at Stubbs\u0027s hands, turned blue, mouth working noiselessly.\u003c/p\u003e\n\u003cp\u003eAlways some smart-ass college punk making life hard for Stubbs.\u003c/p\u003e\n\u003cp\u003eBut who had the drugs? This Ellis kid? Annie\u0027s journal had mentioned something about a drug connection. He\u0027d ask Lancaster. He\u0027d make the kid talk. He needed more information.\u003c/p\u003e\n\u003cp\u003e\"Kid?\"\u003c/p\u003e\n\u003cp\u003eBut Timothy Lancaster lay stone-still, eyes open to the dull, cracked ceiling.\u003c/p\u003e\n\u003cp\u003eStubbs drove fast, hands shaking and knuckle white on the steering wheel. Lancaster\u0027s last bottle of Grolsch nestled cold between his legs. He paged through Annie Walsh\u0027s journal on the seat next to him. He flipped to the last entry, read it.\u003c/p\u003e\n\u003cp\u003eTonight I see Professor Morgan.\u003c/p\u003e\n\u003cp\u003eNot much help, but it was the last entry. This Morgan guy might\u0027ve been the last person to see her. He flipped back through the journal. A car honked loud. Stubbs had slipped over into the other lane. He jerked the wheel back, kept thumbing in the journal.\u003c/p\u003e\n\u003cp\u003eHe was breathing heavy, still seeing Lancaster\u0027s face. Damn, snotty, know-it-all kid. He gulped beer. Wiped his forehead with his sleeve. The window was down, cold air blowing, but Stubbs felt hot. Around his neck. His ears. Sweat.\u003c/p\u003e\n\u003cp\u003eJay Morgan.\u003c/p\u003e\n\u003cp\u003eOkay, Professor Egghead. Let\u0027s see what you have for old Deke.\u003c/p\u003e\n\u003cp\u003etwenty-six\u003c/p\u003e\n\u003cp\u003eMorgan tried to get Ellis on the phone, but the kid was nowhere, hadn\u0027t shown for class. The dean would probably go ape-shit. Whittaker wanted Ellis.\u003c/p\u003e\n\u003cp\u003eOkay, screw it. He\u0027d try calling again later, perhaps call some of Ellis\u0027s other professors. Maybe they knew where he was keeping himself. In the meantime, Morgan could get some work done.\u003c/p\u003e\n\u003cp\u003eHe spread a blank sheet of lined paper on his desk, stared at it. Today he would write one good poem. Only one. He looked at the paper. It was still blank. He\u0027d cleared his day, no tutoring, no grading. Nothing. Only the poem.\u003c/p\u003e\n\u003cp\u003eHe got up, went into the kitchen, and put on a pot of coffee. He watched it brew. He looked over his shoulder at the relentlessly blank sheet of paper on his desk.\u003c/p\u003e\n\u003cp\u003ePoetry was hard.\u003c/p\u003e\n\u003cp\u003eHe watched the pot fill, then poured a mug, walked slowly back to his desk, sipping. He eased back into the chair. Morgan had not one idea in his empty head, not even the seed of an idea rattling in his hollow, freshly swept cranium.\u003c/p\u003e\n\u003cp\u003eHe thought fleetingly about smoking the cigar for the old man. The idea danced just over the horizon of his imagination.\u003c/p\u003e\n\u003cp\u003eHe picked up his pen. He made the point of his pen touch the paper. It left a black dot. Soon he\u0027d make the pen move. It would be the start of a word. He felt it coming, the word forming. Potential energy built in his thumb and forefinger. Here came the first word. The poem was beginning.\u003c/p\u003e\n\u003cp\u003eThe phone rang.\u003c/p\u003e\n\u003cp\u003e\"Cocksuckers!\"\u003c/p\u003e\n\u003cp\u003eMorgan threw down the pen, grabbed the phone. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Hey now, Morgan. Get up on the wrong side of the bed?\"\u003c/p\u003e\n\u003cp\u003e\"I was working, Reams.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, how about you come over this afternoon and help me with a project? I\u0027m building a gazebo. Just got back from Sears with quite an impressive assortment of tools. The lumber\u0027s piled high as an elephant\u0027s eye.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"How hard can it be?\" Reams said. \"Hammer nails, saw wood, nothing to it.\"\u003c/p\u003e\n\u003cp\u003e\"I told you I was working.\"\u003c/p\u003e\n\u003cp\u003e\"So you did. What on?\"\u003c/p\u003e\n\u003cp\u003e\"Trying to write a poem.\"\u003c/p\u003e\n\u003cp\u003e\"Is that all? Dash it out quick, then head over to my place. The sun\u0027s out and the beer is in the cooler. Be a good change of pace. Work with your hands for a change.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll love it,\" Reams said. \"We\u0027ll let our pants sag low until our butt cracks are showing. Sweat and everything like real handymen.\"\u003c/p\u003e\n\u003cp\u003eMorgan sighed. \"I appreciate the call, Reams, but really I need to get in some writing.\"\u003c/p\u003e\n\u003cp\u003e\"Well, okay then.\" A pout in Reams\u0027s voice. \"Maybe next time.\" He hung up.\u003c/p\u003e\n\u003cp\u003eMorgan looked at his piece of paper. There was a jagged ink mark where his hand had jerked at the sound of the telephone. He crumpled the paper and tossed it over his shoulder. He spread a fresh sheet. This time he got a word out. The. He looked at it, shook his head, crossed it out, and replaced it with A. He crossed that out and wrote The again.\u003c/p\u003e\n\u003cp\u003eGood. This was progress. He began writing in earnest. Sweat broke out across his forehead. It came properly now, a line or two at a time. He crossed out a line, replaced it, switched lines around.\u003c/p\u003e\n\u003cp\u003eFinally Morgan had four good lines. The first stanza. He felt exhausted. He looked at the clock. Eighty-two minutes. Not bad. His coffee had cooled. He took his mug into the kitchen, dumped it into the sink, and poured a fresh cup.\u003c/p\u003e\n\u003cp\u003eBack at his desk.\u003c/p\u003e\n\u003cp\u003eThe next stanza was crucial. He needed a good transition. He wanted the poem to make a turn in thought, but it needed to be subtle. His pen stalled again. He should never have gotten up for coffee. His rhythm had broken and he\u0027d lost momentum. He frowned at the paper, tried to conjure the mood again.\u003c/p\u003e\n\u003cp\u003eA knock at the door.\u003c/p\u003e\n\u003cp\u003e\"Goddammit!\"\u003c/p\u003e\n\u003cp\u003eHe looked out the front door\u0027s peephole. Ginny Conrad stood on his porch. She\u0027d done something with her hair. It was pulled back, highlighted with garish burgundy streaks. She wore only a light jacket. Reams was right. It was a nice day, sun brilliant in the wide sky. Perhaps winter was fading at last.\u003c/p\u003e\n\u003cp\u003eShe knocked again, and he opened the door.\u003c/p\u003e\n\u003cp\u003e\"I was writing,\" Morgan told her. He wanted to preempt any ideas she might have about shucking her clothes and crawling into his bed.\u003c/p\u003e\n\u003cp\u003eShe seemed not to hear, pushing her way in. \"I thought we could have lunch.\"\u003c/p\u003e\n\u003cp\u003e\"Lunch.\" Morgan tasted the word, rolled it around on his tongue. His concentration had broken anyway, and a bite would be good.\u003c/p\u003e\n\u003cp\u003eThey ate at the same pizza joint Morgan had gone to with Annette Grayson. This time the meal was more relaxed. He wasn\u0027t on the make. No pressure. They talked of unimportant things and laughed.\u003c/p\u003e\n\u003cp\u003eOnce, a silence between them stretched, and Ginny leaned slightly across the table and asked, \"Do you wonder what it might be like if I were a little older and you were a little younger?\"\u003c/p\u003e\n\u003cp\u003e\"No, not really,\" Morgan said.\u003c/p\u003e\n\u003cp\u003eA grin tickled the corners of Ginny\u0027s mouth. \"Neither do I.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Better this way.\"\u003c/p\u003e\n\u003cp\u003e\"Better what way?\" Ginny asked.\u003c/p\u003e\n\u003cp\u003e\"Like this,\" Morgan said, but he really didn\u0027t know what he meant.\u003c/p\u003e\n\u003cp\u003e\"I guess,\" Ginny said. \"I don\u0027t know what I want.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know either.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Ginny asked. \"You mean you don\u0027t know what I want or you don\u0027t know what you want?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eAnd that about summed it up.\u003c/p\u003e\n\u003cp\u003eBack at the house, Ginny already had her blouse off before Morgan could decide to protest or not. He didn\u0027t want her. He felt guilty about not writing, and he was full of pizza.\u003c/p\u003e\n\u003cp\u003eHe was, however, beginning to develop some sort of friendly feeling toward her, like for a distant niece or a cat. But he didn\u0027t want to sleep with her again, not now. It just wasn\u0027t in him. Even when she stripped completely, running her stiff fingers down between her furry folds, he couldn\u0027t quite imagine taking her in broad daylight after a heavy meal. It had been different during the driving rainstorm. Or maybe it was different now. Maybe everything was changing. Maybe he\u0027d changed.\u003c/p\u003e\n\u003cp\u003eThe phone rang.\u003c/p\u003e\n\u003cp\u003eShe\u0027d already slipped into his bed. \"Let it ring.\"\u003c/p\u003e\n\u003cp\u003e\"It might be important.\" He grabbed the phone. \"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Is this Jay Morgan?\" A woman\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"This is Nurse Benneton at County General Hospital. We have a Louis Reams here. He\u0027s been injured, and he listed you as a contact name. Can you possibly come down and pick him up?\"\u003c/p\u003e\n\u003cp\u003e\"He listed me?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. Can you come down in the next twenty minutes or so?\"\u003c/p\u003e\n\u003cp\u003e\"But why would he list me?\"\u003c/p\u003e\n\u003cp\u003eA pause. \"Sir?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to pick him up.\"\u003c/p\u003e\n\u003cp\u003eAnother pause. \"He really shouldn\u0027t drive himself.\"\u003c/p\u003e\n\u003cp\u003e\"How bad is he? What happened?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I can\u0027t release patient-\"\u003c/p\u003e\n\u003cp\u003e\"But you called me to pick him up, right? Doesn\u0027t that entitle me to know what happened?\"\u003c/p\u003e\n\u003cp\u003eGinny came to the bedroom doorway, holding a sheet over her but failing to cover up any of the important parts. She mouthed the words \"what\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003eMorgan waved her quiet. To the nurse he said, \"Never mind. I\u0027ll be down as soon as I can.\" He hung up.\u003c/p\u003e\n\u003cp\u003eGinny asked, \"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"I have to pick up a friend from the hospital,\" Morgan said. \"Sorry, but I have to go.\"\u003c/p\u003e\n\u003cp\u003e\"Is he hurt bad?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure he\u0027s okay,\" Morgan said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll wait here for you,\" Ginny said.\u003c/p\u003e\n\u003cp\u003eMorgan sighed. \"Sure.\" He closed the door behind him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-pistol-poets/page-15.html","bookId":2247,"creation":"Oct 5, 2019 5:08:02 PM","modification":"Oct 5, 2019 5:08:02 PM"}
