{"id":85589,"no":17,"title":"Page 17","content":"\u003cp\u003e\"Did he... did he make you...\" The words eluded him. No will to speak them.\u003c/p\u003e\n\u003cp\u003e\"He tried to,\" she said. \"He couldn\u0027t get hard. He already had his belt in his hand, so he used it to whip me. When he bent down I kicked him in the... down there.\"\u003c/p\u003e\n\u003cp\u003eMorgan felt a ghost pang in his balls, winced.\u003c/p\u003e\n\u003cp\u003e\"I got away and locked myself in the bathroom,\" she said. \"He tried to get in, but I kept screaming. He must\u0027ve worried about the noise and the neighbors and went away.\"\u003c/p\u003e\n\u003cp\u003eMorgan couldn\u0027t look at her, couldn\u0027t stand it. He wished he\u0027d never come to Oklahoma, wished he hadn\u0027t been a teacher, that he didn\u0027t have to see this young girl have the love of life beat out of her. He taught poetry. What the hell was that? What the fuck good did poetry do anybody?\u003c/p\u003e\n\u003cp\u003eHe said, \"I\u0027ll take you home. You can stay with me for a while.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHe opened his mouth to object, shut it again.\u003c/p\u003e\n\u003cp\u003e\"I had the nurse call my parents,\" Ginny said. \"They\u0027ll be here soon. Don\u0027t worry. I won\u0027t tell them anything.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I didn\u0027t think- Okay.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to be careful.\"\u003c/p\u003e\n\u003cp\u003eHe blinked. Did she mean about her parents?\u003c/p\u003e\n\u003cp\u003eShe said, \"It\u0027s not me he\u0027s after, Professor. He wants you. I just happened to be there.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, bit his lower lip. Of course. He hadn\u0027t thought beyond what to do with Ginny. The guy had something to do with Annie and drugs. It was all too much. Morgan didn\u0027t want to go back to his house. Didn\u0027t want to wait there for the guy to return.\u003c/p\u003e\n\u003cp\u003e\"Professor, I think I need to sleep now.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want me to wait until-\"\u003c/p\u003e\n\u003cp\u003e\"My parents will be here soon.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Morgan swallowed a lump in his throat. \"I\u0027m sorry, Ginny. This shouldn\u0027t have happened.\"\u003c/p\u003e\n\u003cp\u003eBut she was already asleep.\u003c/p\u003e\n\u003cp\u003etwenty-eight\u003c/p\u003e\n\u003cp\u003eMorgan left the hospital numb and scared. He drove his car, automatically heading back to his little house. Halfway there he thought, I can\u0027t stay at home. That guy\u0027ll come back.\u003c/p\u003e\n\u003cp\u003eHe turned the car around, headed for the Best Western at the edge of town. Halfway to the motel he turned around again. He hadn\u0027t any luggage, not even a toothbrush. He\u0027d have to risk his house for twenty minutes, long enough to grab some clothes and his toilet kit.\u003c/p\u003e\n\u003cp\u003eHis thoughts tumbled, wouldn\u0027t line up straight. He couldn\u0027t hide out at the Best Western the rest of the semester. Another thought. If the guy knew where he lived, he\u0027d probably be able to track Morgan to his campus office. A night at a motel wouldn\u0027t solve anything.\u003c/p\u003e\n\u003cp\u003eFuck it.\u003c/p\u003e\n\u003cp\u003eOne night at a time. That was all he could manage.\u003c/p\u003e\n\u003cp\u003eHe parked in front of his house and ran up to the porch. The front door still stood open. He looked in, crept around the house, searching for intruders. Empty.\u003c/p\u003e\n\u003cp\u003eHe ran to the bedroom, yanked a gym bag out of the closet. Two shirts, three pairs of boxer shorts, a fistful of socks. Into the bathroom next. He couldn\u0027t find his leather toilet bag, so he swept his toothbrush and razor off the sink and into the gym bag. He already wore his coat. What else? He always forgot something.\u003c/p\u003e\n\u003cp\u003e\"Professor Morgan?\"\u003c/p\u003e\n\u003cp\u003eMorgan froze. The voice was male and deep, came from the front porch.\u003c/p\u003e\n\u003cp\u003e\"Hello? Professor Morgan?\"\u003c/p\u003e\n\u003cp\u003eMorgan made himself calm down. A killer wouldn\u0027t call out. He\u0027d just barge in. Still...\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Sergeant Hightower from the police, Professor Morgan.\"\u003c/p\u003e\n\u003cp\u003eMorgan realized he was holding his breath. He let it out. He walked slowly into the living room, clutching the gym bag to his chest. \"Yes?\"\u003c/p\u003e\n\u003cp\u003eSergeant Hightower wore his straw hat back on his head. Big country-boy smile. Heavy brown jacket over a khaki uniform. Gun slung low. \"Morgan, right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eHightower still stood on the porch, leaned into the living room without actually stepping over the threshold. \"I just came from the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003eHightower pulled a pen and notepad from his jacket pocket. He flipped open the notepad. \"I just need to ask a few questions.\" He gestured into the house. \"Uh... you mind?\"\u003c/p\u003e\n\u003cp\u003e\"Please come in.\" Go away.\u003c/p\u003e\n\u003cp\u003eHightower eased into the living room. He looked infuriatingly comfortable with himself. He looked the place over, took off his hat, and dropped it on the sofa. His pen hovered over the notepad. \"How do you know Miss Conrad, sir?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a student.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"So you have her in a class then.\"\u003c/p\u003e\n\u003cp\u003e\"No. She is a student in the department, but not actually in one of my classes.\"\u003c/p\u003e\n\u003cp\u003eHightower raised an eyebrow. \"Oh.\" He wrote in his little notebook.\u003c/p\u003e\n\u003cp\u003eWhat are you writing? Stop that.\u003c/p\u003e\n\u003cp\u003e\"Were you tutoring her?\" asked Hightower.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHightower smiled again, wide and self-satisfied. \"This isn\u0027t like Twenty Questions, Professor Morgan. You\u0027re allowed to volunteer anything that might speed this along.\"\u003c/p\u003e\n\u003cp\u003e\"We were friends. She was interested in writing.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh.\" He scribbled in the notebook again.\u003c/p\u003e\n\u003cp\u003eSon of a bitch.\u003c/p\u003e\n\u003cp\u003eHightower scratched his chin with his thumb, squinted at Morgan. \"Taking a trip, Professor?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He looked down at the gym bag. \"I mean yes. But not until tomorrow. I was just packing.\"\u003c/p\u003e\n\u003cp\u003e\"Where you going?\"\u003c/p\u003e\n\u003cp\u003eGood question. \"I\u0027m going to Houston. There\u0027s a conference. I\u0027m attending with another professor.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" The information went into Hightower\u0027s notebook. \"Do you know anyone who might want to hurt Miss Conrad?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not.\"\u003c/p\u003e\n\u003cp\u003e\"Anyone gunning for you?\" Hightower asked.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be ridiculous.\"\u003c/p\u003e\n\u003cp\u003eHightower shrugged. \"Something don\u0027t jibe. Nothing stolen, not a burglary. If it\u0027s a rapist, he didn\u0027t rape.\"\u003c/p\u003e\n\u003cp\u003e\"I talked to Ginny,\" Morgan said. \"She told me she kicked him in the balls and locked herself in the bathroom.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. But she don\u0027t live here. You do.\"\u003c/p\u003e\n\u003cp\u003e\"So the rapist happened to see her come in. Then he saw me leave and figured... hell, I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, sure.\" Hightower nodded. \"I wouldn\u0027t worry about it, Professor.\" That goddamn smug grin again. \"Us country cops are slow, but once we get our teeth into something we don\u0027t let go. This don\u0027t seem like a normal rape attempt, but we\u0027ll figure it.\"\u003c/p\u003e\n\u003cp\u003e\"And what is it exactly you figure?\"\u003c/p\u003e\n\u003cp\u003eA shrug. Morgan couldn\u0027t quite understand the cop. It was almost like he was lazily working the Sunday crossword puzzle rather than trying to solve a violent crime. \"Can\u0027t quite put my finger on it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you\u0027d better talk to Ginny,\" Morgan said. Anything to get the cop on his way. Morgan couldn\u0027t stand talking to him much longer.\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, I talked to her already.\" He shook his head, tsked. \"Her story\u0027s about like yours. Too many gaps. But I figure she\u0027s maybe still in shock. I\u0027ll talk to her again when she comes around.\"\u003c/p\u003e\n\u003cp\u003eMorgan cleared his throat. \"Is there anything else?\"\u003c/p\u003e\n\u003cp\u003eHightower shook his head. \"Nope.\" He flipped his notebook closed, shoved it back into his jacket. \"When you coming back from Houston?\"\u003c/p\u003e\n\u003cp\u003e\"Monday.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" He put his hat back on and gave Morgan a two-fingered salute. \"We\u0027ll be in touch.\"\u003c/p\u003e\n\u003cp\u003eFive seconds after Hightower left, Morgan collapsed onto his sofa. His sweaty shirt clung to him. His hands shook, knees like water. Had the cop seen how nervous he was? God, I need a drink.\u003c/p\u003e\n\u003cp\u003eNot yet.\u003c/p\u003e\n\u003cp\u003eHe locked up, got in his car, and drove to Professor Reams\u0027s house.\u003c/p\u003e\n\u003cp\u003eMorgan woke up late the next morning on Reams\u0027s couch. He felt sore, unhappy, desperate. His life was out of control, and the only solution he could come up with was to run away and hide in Houston for the weekend. At least it would give him time to think.\u003c/p\u003e\n\u003cp\u003eReams had been childishly overjoyed that Morgan had decided to make the conference. All Morgan had wanted to do was escape into sleep, but in his dreams, he saw Ginny\u0027s battered face. It became Annie\u0027s, all the guilt and bad decisions mixed up together. He\u0027d woken in the middle of the night, his pillow damp with sweat, a feeling of deep anxiety over him like a heavy blanket. He\u0027d finally drifted off again about 4 A.M.\u003c/p\u003e\n\u003cp\u003eMorgan heaved himself off the sofa, rubbed his back. He called out to Reams but didn\u0027t get an answer. He found a note near the coffeepot. Reams had gone out to gas up the car.\u003c/p\u003e\n\u003cp\u003eMorgan showered, dressed.\u003c/p\u003e\n\u003cp\u003eHe drank coffee and stared a long time at the phone. He wanted to call Ginny. But not to check on her, and that made him feel guilty. He wanted to get his story straight with her, didn\u0027t want Hightower to find little details to pick at. Morgan was already a wreck. He couldn\u0027t take another go around with the hick cop.\u003c/p\u003e\n\u003cp\u003eOkay, forget it. He drank coffee. Ginny was smart. She wouldn\u0027t get him or herself into trouble. All Morgan needed to do was lie low for a day or two while he figured things out. And he\u0027d been laying off the booze, trying to get healthy. The first thing Morgan wanted to do in Houston was hop off the wagon long enough for a stiff drink.\u003c/p\u003e\n\u003cp\u003eA car horn blared outside. Five seconds later, Reams stuck his head in the door. \"Let\u0027s go, buddy. Train\u0027s leaving the station.\" His finger was still wrapped, but he wasn\u0027t sickly anymore. Reams had the energy of a kid on his way to summer camp.\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Morgan dumped his coffee in the sink, grabbed his gym bag.\u003c/p\u003e\n\u003cp\u003eOn the way out to the car, Reams said, \"I had to put the Volvo in the shop. Transmission trouble. But I got us this for the drive.\"\u003c/p\u003e\n\u003cp\u003eMorgan stopped on the passenger side of the brand-new Mercedes. It looked nice, long and black, tinted windows. Expensive.\u003c/p\u003e\n\u003cp\u003eHe opened the back door, and the sharp stench of bourbon slapped him in the face. Dirk Jakes stuck his head out. \"Hey there, Morgo-man. Ready for a road trip?\"\u003c/p\u003e\n\u003cp\u003eMorgan\u0027s jaw dropped. \"What the hell\u0027s he doing here?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s his car,\" Reams said.\u003c/p\u003e\n\u003cp\u003eJakes held up a hip flask, swirled it around. \"How about a little eye-opener, Morgan?\"\u003c/p\u003e\n\u003cp\u003eIt was actually tempting. \"No thanks.\" He tossed his gym bag into the backseat next to Jakes. Jakes opened his yap to say something, but Morgan shut the door on him. To Reams he said, \"You didn\u0027t tell me he was coming.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, take it easy.\"\u003c/p\u003e\n\u003cp\u003eMorgan shook his head. Reams\u0027s steadfast enthusiasm for the trip was not contagious. Morgan second-guessed his own decision to hide out in Houston at the academic conference.\u003c/p\u003e\n\u003cp\u003eMorgan climbed into the front passenger seat and Reams got behind the wheel. Reams went through a complex series of checks: headlights, windshield wipers, turn signals. He turned on the heat and set the thermostat. He was especially concerned with getting the volume exactly right on the radio.\u003c/p\u003e\n\u003cp\u003e\"For Christ\u0027s sake,\" Jakes yelled from the backseat. \"It ain\u0027t the goddamn space shuttle. Just start driving.\"\u003c/p\u003e\n\u003cp\u003eMorgan fastened his seat belt.\u003c/p\u003e\n\u003cp\u003e\"Wagons ho, gentlemen.\" Reams put the Mercedes into gear and headed for the highway.\u003c/p\u003e\n\u003cp\u003eJakes leaned forward between Morgan and Reams. \"Remember, guys. What happens on the road stays on the road.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly,\" Reams said. \"Just a trio of stout lads out for a good time.\"\u003c/p\u003e\n\u003cp\u003e\"What actually do you think you\u0027re going to do?\" asked Morgan.\u003c/p\u003e\n\u003cp\u003eJakes said, \"First thing is we brace ourselves with a few drinky-poos, then we round up some tail.\"\u003c/p\u003e\n\u003cp\u003eReams didn\u0027t look so gung ho anymore. \"Uh... maybe that\u0027s not the best idea, Dirk.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, put a sock in it, you sissy.\" Jakes grabbed the crotch of his pants. \"Damn, I got to take a piss. Pull into that Chevron, will you?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve only been on the road three minutes,\" Reams said.\u003c/p\u003e\n\u003cp\u003e\"Dammit, Reams, I\u0027m not going to let you fuck up a perfectly good road trip with your bullshit rules and schedules. Now pull into that gas station so I can tap a kidney.\"\u003c/p\u003e\n\u003cp\u003eMorgan sank low in his seat. It was going to be a long drive.\u003c/p\u003e\n\u003cp\u003eDeke Stubbs let the Mercedes get a head start, then followed. An expensive car. Maybe it was the drug dealer making the buy. Maybe this Morgan character had the cocaine after all. Maybe they had some kind of racket going. The kid had said a hundred thousand dollars\u0027 worth. Hell, maybe more.\u003c/p\u003e\n\u003cp\u003eStubbs was red-eyed, queasy, tired. He\u0027d had a very, very bad couple of days, but it would all pay off when he found the drugs and the money. He could turn things around pretty quick then.\u003c/p\u003e\n\u003cp\u003eWhat he really needed was sleep. But not now. Not yet. He had to see where Morgan was going in that big black Mercedes. He leaned over, popped open the glove box, and found the half-empty bottle of caffeine pills. They came in handy when Stubbs was on all-night stakeouts.\u003c/p\u003e\n\u003cp\u003eHe rubbed his balls. They still ached. That bitch had kicked him good, but he\u0027d fixed her.\u003c/p\u003e\n\u003cp\u003eHe popped two of the caffeine pills, washed them down with his last beer. Okay, Professor Morgan, you lead. Deke Stubbs is on your ass like shit on a shoe.\u003c/p\u003e\n\u003cp\u003etwenty-nine\u003c/p\u003e\n\u003cp\u003eOn a hard-packed dirt road under a gray sky just north of Fumbee, Red Zach cursed an underling on his tiny cell phone. Zach wanted answers and he wanted them yesterday.\u003c/p\u003e\n\u003cp\u003e\"I asked you who was in charge of this one-horse shithole,\" Zach yelled. \"I got to know who to deal with.\"\u003c/p\u003e\n\u003cp\u003eRed Zach had been around long enough to know the score. You don\u0027t go deep-sixing motherfuckers on somebody else\u0027s turf without permission, and you don\u0027t go poking your nose into the local drug economy without paying respects to the chief. It was like a franchise thing. He could kill Jenks. That was okay. Jenks was one of his boys run amok. But shit was getting out of hand, and he needed to speak to the local boss, whoever the fuck that was.\u003c/p\u003e\n\u003cp\u003e\"I told you,\" Zach yelled into the cell phone. \"If Jenks is going to unload my merchandise around here, I got to know where he\u0027s going.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, boss,\" said the voice on the other end. \"But Fumbee, Oklahoma, ain\u0027t even on the damn map. It\u0027s in some kinda fucking no-man\u0027s-land between Tulsa and Fayetteville. I don\u0027t think it\u0027s anybody\u0027s turf.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to hear that shit,\" Zach said. \"You call back with a name.\" He slapped the phone shut and looked at his boys down from St. Louis.\u003c/p\u003e\n\u003cp\u003eWhen Red Zach had called for reinforcements, he\u0027d asked for a dozen of the meanest, bad-ass motherfuckers available. It had been a long time since he\u0027d gathered this much muscle together in one place, but he was dog-determined to finish this shit quick.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t been this pissed in a long damn time, and it was all because of Harold Jenks. He\u0027d looked out for the boy, brought him along, gave him all the breaks. Zach had plans to make something out of him. But Jenks stabbed him in the back. Nobody but nobody fucked with Red Zach. The fact it was somebody he trusted made it double-worse.\u003c/p\u003e\n\u003cp\u003eZach looked at the razor-thin man directly across from him. Maurice Arnold. He was a light-skinned black man, shaved head, bright, straight teeth, alert brown eyes. He wore a simple gray suit and a muted red tie. He looked like somebody\u0027s tax attorney, but Zach knew Maurice was the baddest, cruelest motherfucker this side of the Mississippi. He\u0027d led the pack of reinforcements down from St. Louis. He was the guy Zach called whenever he wanted to turn a problem into a violent, screaming, smoking mess. Maurice didn\u0027t just make problems go away. He made them sorry they\u0027d ever decided to be problems.\u003c/p\u003e\n\u003cp\u003e\"Maurice, I want Jenks and any motherfuckers with him to pay the price. You catch my drift?\"\u003c/p\u003e\n\u003cp\u003eMaurice sat with his hands folded in his lap. He nodded politely. \"I understand, sir. Leave them to me.\"\u003c/p\u003e\n\u003cp\u003e\"I got a man watching that redneck\u0027s trailer, but they ain\u0027t been back,\" Zach said.\u003c/p\u003e\n\u003cp\u003eZach\u0027s cell phone rang, and he flipped it open. \"Talk.\"\u003c/p\u003e\n\u003cp\u003e\"I got a name for you, boss.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s hear it.\"\u003c/p\u003e\n\u003cp\u003e\"Moses Duncan.\"\u003c/p\u003e\n\u003cp\u003e\"Affiliated?\"\u003c/p\u003e\n\u003cp\u003e\"Nope. Freelance. Buys out of Tulsa for resale around Fumbee, especially the campus, but he don\u0027t answer to nobody.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see about that,\" Zach said. \"Where is he?\"\u003c/p\u003e\n\u003cp\u003eThe voice on the other end gave him directions. \"A farm outside town.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Anything else?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a white guy.\"\u003c/p\u003e\n\u003cp\u003e\"You think I give a shit?\" Zach said. \"What, you think I\u0027m a racist?\"\u003c/p\u003e\n\u003cp\u003e\"No, boss.\"\u003c/p\u003e\n\u003cp\u003e\"Damn straight. I\u0027ll own his shit if he\u0027s black, white, green, or polka-dot. I\u0027m an equal opportunity motherfucker.\"\u003c/p\u003e\n\u003cp\u003eThe fifth floor of Albatross Hall was pissing off Harold Jenks.\u003c/p\u003e\n\u003cp\u003eHe\u0027d been going stir-crazy stuck up there with DelPrego and the whacked-out old professor, so he\u0027d risked sneaking across campus to the student union for a milk shake and a newspaper.\u003c/p\u003e\n\u003cp\u003eJenks had gone through the local section and the police blotter, but apparently nobody had found the dead body at DelPrego\u0027s trailer. Jenks didn\u0027t know if that was good news or not.\u003c/p\u003e\n\u003cp\u003eAt least the milk shake had been good.\u003c/p\u003e\n\u003cp\u003eBut upon climbing back up to the fifth floor of Albatross Hall, he\u0027d found himself completely turned around. He\u0027d listened for the music like DelPrego had instructed, but all was quiet. Jenks had concluded some crack-head architect son of a bitch was having a big laugh somewhere. Jenks was all turned around.\u003c/p\u003e\n\u003cp\u003eHe stood, scratched his head, cursed again.\u003c/p\u003e\n\u003cp\u003eThen he heard it.\u003c/p\u003e\n\u003cp\u003eSlow footsteps and metal dragging. A peculiar rhythm. Step, step, drag. Step, step, drag. Jenks froze. What the hell was that? He strained to listen, tried to determine from which direction it was coming. That shit\u0027s creeping me out. It reminded him of this Frankenstein movie he\u0027d seen as a kid. It had scared the shit out of him. No matter where the people ran, the Frankenstein kept coming. And he dragged one foot behind him, made that scraping noise.\u003c/p\u003e\n\u003cp\u003eExcept this dragging was harsh and metallic.\u003c/p\u003e\n\u003cp\u003eSo Jenks stood there, waited for the metal robot Frankenstein of Albatross Hall to come eat his lunch.\u003c/p\u003e\n\u003cp\u003eIt was the custodian.\u003c/p\u003e\n\u003cp\u003eJenks exhaled relief. What was that janitor dude\u0027s name again? Valentine had introduced them. Brad Eubanks. Valentine seemed to have some kind of arrangement with the man. Jenks didn\u0027t pretend to understand completely, but he thought the relationship between the old professor and the custodian might somehow be symbiotic.\u003c/p\u003e\n\u003cp\u003eSymbiotic. Where the hell had he picked up that word? Jenks\u0027s face twisted with a wry smile. Maybe college was rubbing off.\u003c/p\u003e\n\u003cp\u003eEubanks saw him from the other end of the hall, waved him over. \"Hey, now.\" A deep country accent, voice harsh with the twang. \"Come gimmee a hand with this, young feller.\" Eubanks was dragging a long, thick metal pipe. Gleaming brass.\u003c/p\u003e\n\u003cp\u003e\"What is that?\" Jenks called.\u003c/p\u003e\n\u003cp\u003e\"Fireman\u0027s pole. Come help.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-pistol-poets/page-17.html","bookId":2247,"creation":"Oct 5, 2019 5:08:02 PM","modification":"Oct 5, 2019 5:08:02 PM"}
