{"id":7779,"no":18,"title":"CHAPTER XVII. A SCENE IN THE SUMMERHOUSE.","content":"In years gone by Marion and Harry Powell, as little girl and boy, had thought a good deal of each other.\n\u003cbr\u003e \n\u003cbr\u003e Now, as the pair faced once more, much of the old feelings came back, and pretty Marion found herself blushing deeply, she could not tell exactly why.\n\u003cbr\u003e \n\u003cbr\u003e She despised Harry\u0027s uniform, yet she felt that he looked remarkably handsome in it, and not such an awful bear of a Yankee, after all. The manliness of the young surgeon\u0027s superior had likewise made a deep impression upon her.\n\u003cbr\u003e \n\u003cbr\u003e Before going into the house Mrs. Ruthven had invited the young man to remain to dinner, and he had readily accepted the invitation. But he was by no means anxious to go into the house with the others.\n\u003cbr\u003e \n\u003cbr\u003e \"It is so nice and cool in the garden, Marion,\" he said. \"Let us remain out here for a while, if you have no objections.\"\n\u003cbr\u003e \n\u003cbr\u003e \"As you will, Harry. But we need not stand. Let us go down to the old summerhouse. Of course you remember that place.\"\n\u003cbr\u003e \n\u003cbr\u003e \"To be sure, Marion—I remember it only too well. How you used to bring in the flowers and make bouquets and wreaths, and open a flower store and bid me buy——\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you wouldn\u0027t buy, more than half the time,\" she laughed. \"You always were somewhat contrary, Harry. Is that what made you turn Yankee?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hardly think so. I want to see all the slaves set free.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is that all?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Isn\u0027t that enough?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Most Yankees want to see the South broken up and ruined.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No! no! That is a mistake.\"\n\u003cbr\u003e \n\u003cbr\u003e The summerhouse was soon gained, and she sat down, and without ceremony he took a seat on the bench at her side.\n\u003cbr\u003e \n\u003cbr\u003e \"This takes me back ten or fifteen years,\" he declared, as he looked around at the familiar surroundings. \"There are the same old magnolias, with the swing, and the same old rose bush, or new ones just like the old. Marion, you ought to be happy here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I was—until the war broke out, and poor papa was killed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, that was a shock, and I felt it too, when the news reached me. He was a noble man, Marion.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So they all say, Harry, but that does not give him back to us. And now another danger threatens us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Another danger? You mean the presence of our troops here? Marion, no harm shall come to you, if I can prevent it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But I do not mean that. It is concerning Jack.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What of your brother?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Harry, he is just like a brother to me, and mamma thinks of him as her son! Now a stranger has appeared on the scene, and he wants to take Jack away from us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A stranger. Who?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A Confederate surgeon named Dr. Mackey. He claims that he is Jack\u0027s father.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But is he?\"\n\u003cbr\u003e \n\u003cbr\u003e \"We do not believe that he is. But he says he can prove it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This is news certainly, Marion. Will you give me the particulars?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will,\" and she did so, to which Harry Powell listened with keen interest.\n\u003cbr\u003e \n\u003cbr\u003e \"Humph! And Jack does not like the man?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, he despises him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That will make it awkward, if this doctor\u0027s story is true.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He will have to bring strong proofs to make me believe the story, I can tell you that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I do not blame you, Marion.\" The young surgeon mused for a moment. \"It runs in my mind that I have heard of this Dr. Mackey before.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I cannot remember now. But I believe it was while I was practicing in Philadelphia.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Was he a doctor there?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It runs in my mind that he was connected with some bogus medical institute which defrauded people through the mails. But I am not certain.\"\n\u003cbr\u003e \n\u003cbr\u003e \"If there is truth in this, I wish you would look the matter up, Harry. Mamma will want to know all she can of Dr. Mackey before she gives up Jack to him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will do my best for you, Marion. I love Jack, too—although he was very young when I went away, if you will remember.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have been away a long time, Harry,\" she replied, and drew a long breath.\n\u003cbr\u003e \n\u003cbr\u003e \"That is true, and I realize it now, although I did not before.\" He gazed steadily into her face and suddenly caught her hand. \"Dear cousin, cannot you forgive me for going over to the enemy?\" he pleaded.\n\u003cbr\u003e \n\u003cbr\u003e She flushed up. \"I ought not to, Harry, but—but——\"\n\u003cbr\u003e \n\u003cbr\u003e \"You will, nevertheless?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I—I will think of it,\" she faltered.\n\u003cbr\u003e \n\u003cbr\u003e \"We were very intimate when I went away. I would not wish that intimacy broken off.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Were we intimate?\" she murmured shyly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, indeed. Don\u0027t you remember it? You used to sit in my lap.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How shocking!\" she cried. \"Are you sure?\"\n\u003cbr\u003e \n\u003cbr\u003e \"As if I could forget it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You seem to have an awfully good memory for some things,\" she said slowly.\n\u003cbr\u003e \n\u003cbr\u003e \"I remember something more, Marion. We were like brother and sister in those days, and you used to put your arms around my neck and kiss me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t believe I ever did anything so dreadful, Harry!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I remember it perfectly well.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you think we had better go into the house now?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t get angry, Marion. But—but—I always did think a lot of you, and always shall—even if I have turned Yankee.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yankee or not, Harry, you will always be very dear to me as my cousin,\" she returned hastily.\n\u003cbr\u003e \n\u003cbr\u003e \"Speaking of cousins, does St. John come here often?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, quite often.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose he comes to see you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He comes to see mamma and me. He and Jack are not very good friends.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What, doesn\u0027t Jack like him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He considers St. John overbearing, and St. John thinks Jack an intruder, and possibly of low parentage.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is St. John married yet?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And he comes here quite often, you say?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps he is going—that is, he would like to marry you, Marion,\" blurted out Harry Powell.\n\u003cbr\u003e \n\u003cbr\u003e At this the girl flushed crimson.\n\u003cbr\u003e \n\u003cbr\u003e \"Well—he has spoken something of it,\" she replied, in a low voice.\n\u003cbr\u003e \n\u003cbr\u003e \"The dickens he has!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Cousin Harry!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I beg your pardon, Marion, but—but—this is not pleasant news.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You mustn\u0027t get rough, Harry. St. John says there are no true gentlemen among the Yankees. But I think differently—now I have met Colonel Stanton.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, confound St. John! There are truer gentlemen among my fellow officers than he will ever be.\" Harry Powell took a turn around the summerhouse. \"But I forgot. I ought not to have spoken so of your future husband.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who said he was my intended husband?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why, you intimated as much.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am sure I did not.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is the same thing. You said he had spoken of marriage to you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is a very different matter.\"\n\u003cbr\u003e \n\u003cbr\u003e Harry Powell took another turn around the summerhouse. \"I suppose you love him, though I don\u0027t understand how any girl could love such an insufferable bore.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Harry, aren\u0027t you prejudiced against St. John?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps I am. But seriously, Marion, what can you find to admire in St. John?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is a Ruthven.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is true.\"\n\u003cbr\u003e \n\u003cbr\u003e \"If I married him I would still remain a Ruthven.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then why not remain an old maid and likewise a Ruthven? It would be far better, take my word on it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you don\u0027t advise me to marry?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t advise you to marry St. John.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you engaged to him?\" he asked, coming closer.\n\u003cbr\u003e \n\u003cbr\u003e \"I am not.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad to hear it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you married, Cousin Harry?\" she asked suddenly.\n\u003cbr\u003e \n\u003cbr\u003e \"Me? No, Marion—not yet.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose you\u0027ll marry some Yankee girl one of these days.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think so, unless——\"\n\u003cbr\u003e \n\u003cbr\u003e \"Unless what?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Unless the girl I always did love goes back on me, Marion. Do you think she will go back on me?\" and he caught both of her hands in his own.\n\u003cbr\u003e \n\u003cbr\u003e \"Harry, you are a—a—Yankee.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But that doesn\u0027t affect my feelings for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A true Yankee ought not to care for a Southern girl.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And why not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I don\u0027t know exactly. But it doesn\u0027t seem right.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you mean to say that a Southern girl ought not to care for the man who is fighting as his conscience dictates?\" he demanded, turning a trifle pale.\n\u003cbr\u003e \n\u003cbr\u003e \"No, no, Harry! I honor you for sticking to your principles. But we had better say no more at present on this subject.\" She glanced down the garden path. \"See, St. John is coming. Let go my hands.\"\n\u003cbr\u003e \n\u003cbr\u003e He dropped her hands and took a seat on the other side of the summerhouse, and a moment later St. John Ruthven presented himself at the doorway.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3023/83635.html","bookId":258,"creation":"Aug 1, 2019 7:59:27 AM","modification":"Aug 1, 2019 7:59:27 AM"}
