{"id":110860,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eRosa jerked her hand to her chest, meeting his gaze with smoky, dark eyes. “You don’t?”\u003c/p\u003e\n\u003cp\u003eHe shook his head and crossed to the tray on his desk, heart still thundering in his ears. The world was gray, but somehow Mrs. Marberry seemed like a shining light within it, the sound of her own rapid heartbeat drawing his attention like the predator he was.\u003c/p\u003e\n\u003cp\u003eSomeone—Doyle, no doubt—had seen fit to provide him with blud-wein. He poured a shot of it and threw it back, so aware of her that he could almost feel her gaze on the back of his neck.\u003c/p\u003e\n\u003cp\u003e“I’m a rogue, Mrs. Marberry. I buy my blood from the draining factories—or what’s left of them.” Blood that was taken in the blood taxes the Echelon had forced upon the populace for years. He slowly stoppered the decanter. “I don’t have the kind of living to support a thrall.”\u003c/p\u003e\n\u003cp\u003e“But surely—”\u003c/p\u003e\n\u003cp\u003e“No,” he replied firmly. “I’ve never taken from the vein.”\u003c/p\u003e\n\u003cp\u003eSilence settled heavily over the room. Lynch gathered himself and turned to face her. Rosa still clutched her arm, staring at him with that burning curiosity he often saw in her gaze.\u003c/p\u003e\n\u003cp\u003e“You want to know why,” he said, and the gray washed out of his vision suddenly.\u003c/p\u003e\n\u003cp\u003eColor flooded into her cheeks. “Of course not.”\u003c/p\u003e\n\u003cp\u003e“Surprising,” he noted, almost to himself. “You’ve shown little restraint in the past, unless it happens to involve yourself or unless you’re referring to me directly as a blue blood.” He saw the little flinch she couldn’t hide and refused to give in to guilt. “You don’t like to think of me as a blue blood.” No shock this time, but he knew he’d hit a nerve. “You make me very curious about your history, Rosa. And your humanist tendencies.”\u003c/p\u003e\n\u003cp\u003eThe blood drained out of her face. “My what?”\u003c/p\u003e\n\u003cp\u003eInteresting. He picked up the glass he’d used and grabbed the decanter. Taking a seat on the settee, he cocked his boots on the table and poured himself another. Rosa still hadn’t moved, but tension radiated through her frame, as though she were prepared to flee at any moment. Her bare hand clutched the glove as if it were a lifeline.\u003c/p\u003e\n\u003cp\u003e“You read the pamphlets,” he said, taking pity on her. “You know enough to make me think you sympathize with the humanist cause if nothing else. Very few humans have an understanding of hemlock and its applications. I would also suspect an incident in your past involving a blue blood.”\u003c/p\u003e\n\u003cp\u003eSome color had returned to her cheeks. “And why would you suspect that?”\u003c/p\u003e\n\u003cp\u003e“The pistol,” he replied bluntly. “Your fear of me and my men, the way you don’t like to be touched or locked in a small space with me. The only time you weren’t frightened to be in the carriage together was when I was wounded and therefore, in your mind, vulnerable.”\u003c/p\u003e\n\u003cp\u003eShe stared at him like a cornered animal. “I’m not afraid of you.”\u003c/p\u003e\n\u003cp\u003eLynch cocked a brow.\u003c/p\u003e\n\u003cp\u003e“I’m not,” she snapped, her fists clenching.\u003c/p\u003e\n\u003cp\u003e“Then you are wary. And that makes me suspect you have run afoul of a blue blood.”\u003c/p\u003e\n\u003cp\u003eShe dragged her glove back on as if it were armor. “My father was a blue blood,” she told him. “My mother had been his thrall but she fled when…when my younger brother was born. Unfortunately, she passed away; the streets were not kind to her and we had to learn to make do, which should explain the pistol. Old habits die hard.” Dark lashes closed over her eyes. “My father found us when I was ten, so I have…a healthy respect for blue bloods and what they can do. That is all.”\u003c/p\u003e\n\u003cp\u003eThe truth perhaps, but far from the whole of it. If her father was a blue blood, that meant she had genteel origins. Who? He forced the thought away; time for that later. He could be patient, and everything he knew about her said he would need to be.\u003c/p\u003e\n\u003cp\u003eLynch sipped at his blud-wein, knowing that the sight of it disturbed her. “Your father hurt you—?”\u003c/p\u003e\n\u003cp\u003e“My lord,” she replied icily, “I believe this is completely outside conventional conversation. You have no right—”\u003c/p\u003e\n\u003cp\u003e“To poke and pry? Perhaps I share your curiosity, but instead of breaking into locked rooms—the means of which interests me, by the way—I am asking you.”\u003c/p\u003e\n\u003cp\u003eThe look she shot him was by no means friendly. “I didn’t break in; the door wasn’t locked.”\u003c/p\u003e\n\u003cp\u003eLynch sat forward, putting his glass down. “Now that,” he said, “is a lie. Though you do it so well I almost cannot tell.” Another sobering silence. He gestured to the seat opposite him. “Sit. Why do we not dispense with this dancing around?”\u003c/p\u003e\n\u003cp\u003e“I have work to do.”\u003c/p\u003e\n\u003cp\u003e“I’ll very generously grant you a lunch hour.”\u003c/p\u003e\n\u003cp\u003eStill she hesitated.\u003c/p\u003e\n\u003cp\u003e“And I shall offer you a truth in exchange for one,” he said, knowing that curiosity was her downfall. He reached out and lifted the lid off the tray in front of him, revealing a spread of small cucumber sandwiches, a plate of spiced cake, and a platter of biscuits. A pot of tea steamed beside it. “Besides, I didn’t request this food for myself, obviously. I have been remiss in feeding you since you started.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind.”\u003c/p\u003e\n\u003cp\u003e“You mean,” he said, looking up over the tray, “that you do not wish to tell me your truths.” He watched the mutinous flare in her eyes. “I have four hundred and fifty Nighthawks, Mrs. Marberry. Don’t make me too curious. And I’ll warn you that you are most certainly stirring my interest, though I doubt that was your intention.”\u003c/p\u003e\n\u003cp\u003eShe sat, though the stiff way she perched across from him indicated her mood. Lynch leaned back in the chair, his long legs stretched out in front of him. He had dozens of questions and not nearly enough answers about her, and every evasive response only gave him more questions.\u003c/p\u003e\n\u003cp\u003e“Eat.”\u003c/p\u003e\n\u003cp\u003e“I’m not hungry.”\u003c/p\u003e\n\u003cp\u003eHe observed her. “Yes, you are.”\u003c/p\u003e\n\u003cp\u003e“Are you always so accurate, my lord?”\u003c/p\u003e\n\u003cp\u003e“I have had a lot of years to learn when someone is lying to me.” He leaned forward and poured her tea. “Lemon,” he murmured. “And one sugar, I believe?”\u003c/p\u003e\n\u003cp\u003eMrs. Marberry stared at him. “You know how I take my tea.”\u003c/p\u003e\n\u003cp\u003e“I observe everything, Rosa.” The use of her name was entirely deliberate. This wasn’t an interrogation—not yet—but there were certain questions about her that he needed to know the answer to. Certain…doubts. And while he had the time—enforced rest, so to speak—he might as well satisfy his curiosity.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she murmured, accepting the cup and saucer. She sat it on her lap, as if it were a barrier between them.\u003c/p\u003e\n\u003cp\u003eGood. He wanted her uncomfortable. He wanted her to spill her secrets.\u003c/p\u003e\n\u003cp\u003eRosa’s hands curled around the teacup as if seeking its warmth. “May I go first then? Since I have given you many truths already.”\u003c/p\u003e\n\u003cp\u003eHe spread his arms over the back of the chair and inclined his head. “I believe only some of them were truths, but as a gentleman I’ll allow my lady to go first.”\u003c/p\u003e\n\u003cp\u003e“Too kind.” She sipped her tea, consideration warming her eyes. “You loved Annabelle. Have you ever loved another woman?”\u003c/p\u003e\n\u003cp\u003eA direct volley. She was seeking to put him on the back foot. Lynch smiled lazily. “No. I learned my lesson once, Rosa. I am not so eager to repeat the experience.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed. “But its—”\u003c/p\u003e\n\u003cp\u003e“My turn,” he cut her off. “You never denied my suggestion that you have humanist tendencies. I find that very curious.”\u003c/p\u003e\n\u003cp\u003e“Hmm.” She took refuge in her tea. “I don’t believe that’s a question.”\u003c/p\u003e\n\u003cp\u003e“Do you have humanist sympathies?”\u003c/p\u003e\n\u003cp\u003ePorcelain chimed as she put her cup down and examined the tray of sandwiches. “I’m human, sir. Of course I have humanist tendencies.” Her eyes met his, flashing with an emotion he couldn’t quite name. “You wouldn’t understand. You have rights. I don’t. Every man and woman in the city secretly wonders if it might be better if the humanists succeeded.”\u003c/p\u003e\n\u003cp\u003e“I have rights, do I?” Lynch mused, half to himself. “I might have to explain that to the prince consort the next time we meet.”\u003c/p\u003e\n\u003cp\u003eRosa selected a sandwich for her plate, her black satin glove hovering over them. “I don’t forget that you’re a rogue. But you’re certainly in no fear of being molested in the street for your blood.” Her fingers dipped and swooped, filling her plate. “I’m not strong enough to fight a blue blood off. They could leave me to bleed to death in a gutter and no one would dare say a thing. So yes, I do have humanist sympathies.”\u003c/p\u003e\n\u003cp\u003eNibbling at her sandwich, she looked completely at ease. But she’d put her glove back on. Sitting down to eat was considered the only respectable time a woman could show her wrists to a blue blood and she hadn’t.\u003c/p\u003e\n\u003cp\u003eHe filed that thought away, wondering why she thought she was safe with her gloves on. Did she not consider her bare throat, with the edging of black lace that taunted him?\u003c/p\u003e\n\u003cp\u003e“I wish you wouldn’t watch me eat,” she murmured, wiping her lips with a napkin.\u003c/p\u003e\n\u003cp\u003eI wasn’t. He dropped his gaze. There was a chessboard seated on the lamp table beside him. He gestured to it. “Do you play?”\u003c/p\u003e\n\u003cp\u003e“A little.”\u003c/p\u003e\n\u003cp\u003eShe was toying with him. Lynch dragged it across to the table between them and cleared a space. “It will give you some sense of privacy.” And himself further insight into the mystery of her character. He swiftly set it up, placing the pieces on the smooth lacquered board.\u003c/p\u003e\n\u003cp\u003e“Not black, sir?”\u003c/p\u003e\n\u003cp\u003eHe glanced down at the white pieces in front of him. “White moves first.” A flashing of his teeth, perhaps a smile. “I’m a man. I attack.”\u003c/p\u003e\n\u003cp\u003e“Far too blatant a proposition,” she shot back, watching as he placed his first piece. “That is an aggressive move—but there are others that are more aggressive. I think you’re trying to screen me from your true purpose. And that”—she eyed him with a dangerous little smile—“is far more like your nature than such a bland assessment.”\u003c/p\u003e\n\u003cp\u003eLynch actually smiled. “Touché.”\u003c/p\u003e\n\u003cp\u003e“So I must presume you have another strategy in mind,” she replied, examining the board with interest. Her dainty little hand hovered over her knight, then back to a pawn. She placed it directly in front of his. A challenge to see if he would take the bait.\u003c/p\u003e\n\u003cp\u003eHe moved his knight to a threatening location, giving her a bland look. She’d wanted to attack first but had restrained herself. Interesting. “I always have another strategy.”\u003c/p\u003e\n\u003cp\u003e“Mmm.” She dragged her chair closer, leaning over the board with her chin cupped in her hand. “My turn: What did you mean when you told the Duke of Bleight you’d see him in the atrium if he moved against you and yours again?”\u003c/p\u003e\n\u003cp\u003e“He’s always feared my ambition,” Lynch replied, watching her fingers hawkishly. Knight to the center. “And he’s getting older, with no direct heir except for a tangle of distant cousins. The thought that I might challenge him for the duchy is the only thing that can keep him in check.”\u003c/p\u003e\n\u003cp\u003e“Would you ever consider challenging him?”\u003c/p\u003e\n\u003cp\u003e“I’m a rogue, Rosa.” He ignored the fact that this was a second question and moved his knight to counteract her. “I can’t hold titles or any position in society. He should realize that, but he’s too blinded by his fear of me.”\u003c/p\u003e\n\u003cp\u003eShe slipped a pawn across the board as if the move were inconsequential. “And if he does break the pact, will you challenge him?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said firmly, capturing her pawn. She was playing almost recklessly. He frowned. Recklessly or trying to lull him? “I told him I would; therefore, I will. I can’t afford to go back on my word, though. It would gain me nothing.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t break your word, even if you could, would you?” she asked, looking up. The sight of her eyes arrested him for a moment; they glittered with an intense emotion he couldn’t name. “I admire that, my lord. You’re not the man I expected to find.”\u003c/p\u003e\n\u003cp\u003e“Lynch,” he corrected, holding her gaze. “I am no lord.”\u003c/p\u003e\n\u003cp\u003e“But you could have been.” Her gaze softened. “You must hate them for what they took from you.”\u003c/p\u003e\n\u003cp\u003eA tight little smile crossed his lips. “Took from me? Whatever makes you think the choice wasn’t mine?”\u003c/p\u003e\n\u003cp\u003eShe knocked over her own rook in surprise. “I—I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“No? You haven’t heard the story? You must be one of the few who haven’t.” He reached forward and picked up her rook, his fingers brushing her glove. Rosa flinched but she allowed the touch. “Allow me,” he murmured.\u003c/p\u003e\n\u003cp\u003eSome devil took hold of him. He set the rook upright and slid his little finger around hers, linking them. The satin was delicious and warm, so smooth against his skin. His lids lowered, thinking of that small hand on other parts of his body, stroking, soothing. Her gloves still on but nothing else as she knelt before him. All of that gorgeous red hair tumbling down her naked spine, caressing the tops of her thighs. His mouth went dry at the thought. \u003c/p\u003e","sourceLink":"https://allnovel.net/my-lady-quicksilver-london-steampunk-3/page-21.html","bookId":1582,"creation":"Oct 6, 2019 12:13:17 AM","modification":"Oct 6, 2019 12:13:17 AM"}
