{"id":110875,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“My thanks,” another blue blood said sincerely, his pale blue eyes wide and frightened.\u003c/p\u003e\n\u003cp\u003eI didn’t do it for you. But then she stopped, watching as he helped a frightened young woman through the narrow gap. She of all people should know that sometimes the monsters were just as human as the rest of the world.\u003c/p\u003e\n\u003cp\u003eRosalind didn’t bother to watch as the first of the crowd slipped through the gap. She had to find Lynch or, barring that, Garrett or Perry.\u003c/p\u003e\n\u003cp\u003eSomething caught her eye as she glanced around the darkened theatre. A tall man flashed through the green-tinted lens of the opera glasses, his rough-hewn face watching something in the chairs intently as he stalked forward.\u003c/p\u003e\n\u003cp\u003eMordecai.\u003c/p\u003e\n\u003cp\u003eHer blood went cold when she realized who he was staring at.\u003c/p\u003e\n\u003cp\u003eLynch ground his teeth together and wrenched the blue blood’s head sharply to the right. A faint crack. Then all of the fight drained out of the man and the body slumped to the floor beneath him.\u003c/p\u003e\n\u003cp\u003eA thrall in buttercup yellow lay on the carpet between the seats, staring up at him in shock and horror. Blood splashed her skirts and there was a bite mark on her shoulder that would leave a scar. Her lips parted as the blue blood collapsed, then she scrambled to her hands and knees at his side.\u003c/p\u003e\n\u003cp\u003e“Epson?” she whispered. Her hands began to shake and she looked up at Lynch with wide blue eyes. “You’ve killed him.”\u003c/p\u003e\n\u003cp\u003e“It was either yourself or him,” he replied, struggling to assuage the bloodlust that roared through his veins. The mask helped. Each breath tasted like sugared buns, but though it stirred his heartbeat, he could control himself.\u003c/p\u003e\n\u003cp\u003e“Look out!” a woman screamed.\u003c/p\u003e\n\u003cp\u003eLynch spun low, ducking between the seats as a man behind him lifted a pistol. The shot went over his head, an enormous chunk of plaster exploding on the wall.\u003c/p\u003e\n\u003cp\u003eThe pistol lowered and Lynch stared down the barrel. The man’s face was rough with stubble, his eyes cold and merciless as he thumbed the hammer back. “Fare thee well, Sir Nighthawk.”\u003c/p\u003e\n\u003cp\u003eA blur of cream silk came out of nowhere just as the pistol retorted. The pair of them tumbled out of view, but he knew who that had been as surely as he knew his own name.\u003c/p\u003e\n\u003cp\u003eRosa.\u003c/p\u003e\n\u003cp\u003eWhat the hell was she doing here? And where the hell did that bullet go? There was no sign of struggling, no sign of movement… The anger that had consumed him at her treachery lost its fire, a cold hard knot twisting in his chest.\u003c/p\u003e\n\u003cp\u003eLeaping over the row of chairs, Lynch skidded to a halt in the aisle. The stranger reached for the pistol on the ground with grim determination—an enormous brute in a workman’s shirt that strained over his enormous shoulders. Scrambling to her knees, Rosa launched herself past the stranger and kicked the pistol under the chairs.\u003c/p\u003e\n\u003cp\u003e“Curse you,” the stranger snarled, rolling to his feet. “Who’s damned side are you on?”\u003c/p\u003e\n\u003cp\u003eRosa straightened, her cool glance shifting past him to settle on Lynch. Just a moment, one that burned him right through. “You want to know what I am? Who I am? Then stay out of this.”\u003c/p\u003e\n\u003cp\u003eThe stranger shot him an uneasy look.\u003c/p\u003e\n\u003cp\u003e“Where’s my brother, Mordecai?” she asked.\u003c/p\u003e\n\u003cp\u003eSo she had been telling the truth.\u003c/p\u003e\n\u003cp\u003eIf she thought he could stay out of this, she was mistaken. She’d betrayed him, lied to him, made him think there was more between them than there was… But to watch her get hurt was beyond him.\u003c/p\u003e\n\u003cp\u003e“Ain’t seen ’im,” Mordecai retorted, turning so that he could keep them both in view. “Probably the same place as mine.”\u003c/p\u003e\n\u003cp\u003eRosa’s lips thinned. Her expression was tight and focused, so far removed from Mrs. Marberry’s saucy cheer that Lynch suddenly realized he was seeing the reality of who she was. Not Mrs. Marberry. Perhaps not even Mercury. She stood with a self-assurance and determination that were but echoes of the other two women.\u003c/p\u003e\n\u003cp\u003eHerself.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about that,” she admitted. “But Mendici went for his gun. I was faster.”\u003c/p\u003e\n\u003cp\u003e“Aye.” Darkness shadowed Mordecai’s eyes. “But are you faster ’an me?”\u003c/p\u003e\n\u003cp\u003eHe lashed out with a meaty fist. Lynch leaped forward, then stopped as Rosa ducked beneath the blow as if she’d expected it, her elbow locking Mordecai’s arm in place as her metal hand chopped down in a brutal blow against the fellow’s neck. Mordecai roared in pain and drove her into the seats with his shoulder in her midriff.\u003c/p\u003e\n\u003cp\u003eRosa drove a knee up, bringing her elbow down between his shoulder blades. Each movement was sparse and economical, lacking the flamboyancy of someone who did this to prove his skill. She could have drawn this out, but instead she aimed for blows that would cripple and maim—the swifter to finish this.\u003c/p\u003e\n\u003cp\u003eSo quick. Mordecai staggered to his feet and Rosa hopped up lightly on the chair to get height, then kicked him in the face. Her skirt tore at the extension of her leg, high and graceful. Mordecai stumbled backward, blood dripping from his nose, but he didn’t go down.\u003c/p\u003e\n\u003cp\u003eLynch’s vision dripped between color and black and white. The Doeppler Orbs had dissipated, but he didn’t dare take off the mask. He wanted to step in, to end this, despite the fact that Rosa had matters well in hand. The darkness in him was a gathering storm. For a moment his vision dulled, fury riding through him. This was his woman. His. And he wanted to kill anyone who threatened her.\u003c/p\u003e\n\u003cp\u003eTheir eyes met.\u003c/p\u003e\n\u003cp\u003eJust long enough for Mordecai to lash out.\u003c/p\u003e\n\u003cp\u003eRosa staggered back several steps in the aisle, grinding her teeth against the blow. Lynch dug his fingernails into his palms, fighting every instinct he owned.\u003c/p\u003e\n\u003cp\u003eMordecai swung the enormous metal fist of his right arm. Rosa blocked it with her own bio-mech hand, but the force staggered her back into the seats. Light from the stage backlit them as Lynch took a step closer then stopped.\u003c/p\u003e\n\u003cp\u003eMordecai flexed his metal fingers. “You hit like a girl.”\u003c/p\u003e\n\u003cp\u003eRosa looked up, her eyes black as night. Kicking out, she drove her heel into his kneecap and Mordecai screamed as it shifted.\u003c/p\u003e\n\u003cp\u003eIt should have been the end. But even Lynch was surprised when the huge mech lunged forward in an awkward lurch and drove his enormous body directly into Rosa.\u003c/p\u003e\n\u003cp\u003eFor a moment they hovered on the edge of the orchestra pit, Rosa’s wide, startled eyes meeting Lynch’s and then they were gone. An enormous cacophony of noise drifted up.\u003c/p\u003e\n\u003cp\u003e“Rosa?” Lynch scrambled to the edge of the pit.\u003c/p\u003e\n\u003cp\u003eShe lay on her back amongst the strings section, wincing as she lifted her hip. Her groping hand found the edge of a brass cymbal and she clenched it in her mech fingers, the edge a dangerous weapon.\u003c/p\u003e\n\u003cp\u003eMordecai groaned, flat on his face beside her. Rosa scrambled over him, driving a stockinged knee into his back as she jerked his head back by his hair and pressed the cymbal to his throat. It wasn’t sharp but with enough force…\u003c/p\u003e\n\u003cp\u003eLynch leaped down beside her, catching her wrist. “Enough.”\u003c/p\u003e\n\u003cp\u003eShe looked up, black eyes gleaming. In that moment, he saw the coldness in her. She’d have done it. Not because she wanted to, but because it was what she should do—The next step to this.\u003c/p\u003e\n\u003cp\u003eA trained killer.\u003c/p\u003e\n\u003cp\u003eHe recognized it, even as the coldness faded from her expression, replaced by breathless misery. Because of him. His hand slid from hers, unable to reconcile the woman he saw in front of him with the woman he’d known.\u003c/p\u003e\n\u003cp\u003e“I need him alive,” he said.\u003c/p\u003e\n\u003cp\u003eRosa let go of the cymbal, as if seeming to see it for the first time. Color flooded into her cheeks, emotion heating her expression. He couldn’t read what she was thinking, but at least she was no longer the ruthless assassin he’d caught a glimpse of.\u003c/p\u003e\n\u003cp\u003eShe knew it too. Her dark eyes flickered to his, saw everything he couldn’t hide and looked away. “Of course.”\u003c/p\u003e\n\u003cp\u003eRipping out the strings on several violins, he knotted them together and then bound Mordecai’s hands behind his back. The man groaned but didn’t fight it. From the angle of his knee, he wouldn’t be fighting anything soon. Then Lynch sat down and scraped his hand over his face.\u003c/p\u003e\n\u003cp\u003eWhat was he going to do?\u003c/p\u003e\n\u003cp\u003eFury had died. He felt numb. Numb and so very, very old all of a sudden. The brightness he’d felt whenever he’d been around her had seemed to leech out of him, as if she’d sucked the very soul from him.\u003c/p\u003e\n\u003cp\u003eI loved you. He looked at her, waiting patiently on her knees, with her hands pressed so tightly together, he felt as if he’d somehow struck her a mortal blow. Dark lashes fluttered against her cheeks, but she couldn’t—or wouldn’t—look at him.\u003c/p\u003e\n\u003cp\u003e“Why?” he asked hoarsely. “Your brother? Only your brother?” Was there ever anything for me?\u003c/p\u003e\n\u003cp\u003eShe toyed with the fingertips of her gloves, a move so reminiscent of Mrs. Marberry that his lungs arrested. Then he shook it off. He couldn’t keep looking for things that weren’t there.\u003c/p\u003e\n\u003cp\u003e“I swear,” she whispered. “I only ever wanted to find my brother.”\u003c/p\u003e\n\u003cp\u003eThe dull truth of that made the fluttering hope in his chest die. He couldn’t stay here anymore. Shoving to his feet, he buried everything deep inside. This was worse than that moment when he’d realized that Annabelle had played him false. Perhaps it was the healing balm of all those years dulling the memory, or perhaps because he’d finally dared to let himself feel something for someone, only to have it happen again.\u003c/p\u003e\n\u003cp\u003eLesson learned.\u003c/p\u003e\n\u003cp\u003eFace expressionless, he yanked the groaning mech to his feet. At least he had something to show for this night’s efforts, though he knew it wouldn’t appease the prince consort. No, the Council wanted blood. Wanted the woman at his side.\u003c/p\u003e\n\u003cp\u003eHe shoved the mech out of the pit. Jumping up, he caught the lip of it and hauled himself out, ignoring the way she watched him, as if waiting for him to speak.\u003c/p\u003e\n\u003cp\u003eHe had no more words. Only one more night. And he couldn’t see any way out of it for himself. No matter how much she had hurt him, he could never hand her over. His feelings, at least, had been true.\u003c/p\u003e\n\u003cp\u003e“Lynch,” she whispered, looking up at him. “I’m sorry. I know…I know nothing I say could ever—”\u003c/p\u003e\n\u003cp\u003eBut he wasn’t listening to her. A figure stepped slowly out of the darkness, coalescing into a tall man in the aisle, leaning on an ivory handled cane. Strands of white dulled his coppery hair until it was a faded strawberry blonde, and lines fanned out from the corners of his small, black eyes. He wore the crisp black of a long-tailed coat, the stark white of his shirt gleaming in the shadows. A typical uniform for any man attending the opera, he was so unremarkable that the eye begged to skip directly over him.\u003c/p\u003e\n\u003cp\u003eAs he no doubt intended. Nobody looking at him would know that this man was one of the mighty powers behind the throne, second only to the prince consort in manipulating the events of the realm. Lips thinning, Lynch reached down and offered Rosa his hand.\u003c/p\u003e\n\u003cp\u003eHe yanked her to her feet beside him, ignoring the man in the aisle. The prince consort could damn well wait. He’d had enough of being played with for one night.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she murmured, blinking against the sudden glare of the spotlight.\u003c/p\u003e\n\u003cp\u003eLynch ignored her, stepping down out of the light and meeting Balfour’s gaze. “What do you want?”\u003c/p\u003e\n\u003cp\u003eBalfour wasn’t looking at him.\u003c/p\u003e\n\u003cp\u003eA sudden coldness seemed to trickle down his spine. Lynch had seen that expression before—the faint smile, the piercing blackness of Balfour’s narrow eyes as he’d watched an enemy humbled before him.\u003c/p\u003e\n\u003cp\u003eLynch might as well not even have been there. He followed Balfour’s gaze, his hand reaching for the knife that was no longer at his hip.\u003c/p\u003e\n\u003cp\u003eRosa hovered just out of the spotlight, so still, trembling, like a deer caught in the sight of the hunter’s gun. Her dark eyes—so similar, now he saw them together—narrowed. A thousand emotions crossed her face. Hate, fear, and finally…rage. The cold tremor down Lynch’s spine grew. If I see my father, I know I won’t come to any harm… I cannot say the same for him.\u003c/p\u003e\n\u003cp\u003eLynch moved before the muscles tensing in her legs could even shift her. He caught her around the waist, swinging her in tight against his own body. Rosa snarled, shoving at his chest. She didn’t even look at him, fixated solely on Balfour.\u003c/p\u003e\n\u003cp\u003e“Let me go!”\u003c/p\u003e\n\u003cp\u003eLynch caught her back against his chest, his arms locking around her. “No.”\u003c/p\u003e\n\u003cp\u003eHe knew what she didn’t. There was a shadow behind Balfour. One of his falcons no doubt, disguised as a bodyguard. The man wore black and hovered with seeming indifference in the darkness. Rosa would never get close enough, even if Balfour wasn’t half as dangerous as he truly was.\u003c/p\u003e\n\u003cp\u003eFor the first time, those dark eyes lifted from Rosa’s face and Lynch met them. He tilted his chin up, extending a silent challenge. Rosa belongs to me… The thought took him unaware, but he didn’t fight it. Not now. His own fractured pride was nothing compared to the dread that filled him.\u003c/p\u003e\n\u003cp\u003e“You have something of mine,” Balfour murmured, his accent so haughtily elite that it spoke of years of breeding. A faint smile played over his lips. “I thought you dead, Cerise. All these years I thought I had lost you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/my-lady-quicksilver-london-steampunk-3/page-40.html","bookId":1582,"creation":"Oct 6, 2019 12:13:17 AM","modification":"Oct 6, 2019 12:13:17 AM"}
