{"id":110883,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe words bubbled up in her throat, tickled against the roof of her mouth. Clutching at his ruined shirt, she pressed her face against the bare skin of his throat. But she couldn’t say it, as if a part of her still felt unworthy. Pushing against his chest, she looked up. “I lied to you.”\u003c/p\u003e\n\u003cp\u003e“With your lips, yes.” His eyelids lowered, almost hiding those luminous eyes, but his hand kept on stroking her cheek. “I should have paid more attention to my instincts, to what my dark half was telling me.” His thumb paused in the middle of her lip and he looked up, capturing her gaze. “It knew who you were no matter what guise you wore. It claimed you long before I did.” He took a deep, shuddering breath. “And did you ever lie to me…here?” Tentative fingertips pressed between her breasts, directly over the thumping beat of her heart.\u003c/p\u003e\n\u003cp\u003eRosalind shook her head, swallowing hard. “You know I didn’t,” she whispered, cupping his hand and holding it firmly against her chest. She could feel the heady pulse of her heartbeat through his touch. “It belonged to you long before I knew it.” Another heady swallow. She had to say it. He deserved it and she wanted him to know. “I love you.”\u003c/p\u003e\n\u003cp\u003e“I know.” He said the one thing she needed to hear the most. This time he believed her. Slowly his lips curled up, and she thought she might die for the joy the sight elicited in her. His smile—so rare—was a thing of wonders. “I knew the instant you walked through the doors of the atrium.” The smile began to fade.\u003c/p\u003e\n\u003cp\u003eRosalind quickly pressed her fingertips to it, as if to capture it. “Don’t think about it.”\u003c/p\u003e\n\u003cp\u003eLynch kissed her fingertips and took a shuddery breath. “I won’t. That is done. However, there is one last thing we must discuss.”\u003c/p\u003e\n\u003cp\u003e“What now.” It wasn’t a question.\u003c/p\u003e\n\u003cp\u003eHis fingers laced between her iron fingers and held them up. “I have had Fitz design something special for me.” Reaching into the pocket of his waistcoat, he drew out a small red velvet box. “Considering that no normal ring would fit—”\u003c/p\u003e\n\u003cp\u003eRosalind sat up and nearly hit her head. All she could see was that box, her heart pounding so swiftly she almost swayed with dizziness. “What are you saying?”\u003c/p\u003e\n\u003cp\u003e“I asked your brother if I had permission to make you my consort.” He flicked the box open. “I want you to share the world with me. Forever, Rosa. No more secrets between us. Nothing but you and me, till death do us part.”\u003c/p\u003e\n\u003cp\u003eNestled within was a gleaming steel ring, burnished so brightly that it shone. An enormous square diamond was set into the top, with a lattice of tiny, filigreed silver holding it in place. No lady of the Echelon would wear it, but it suited her, so perfectly he had obviously designed it himself. And the fact that he had asked Jack—who had given his blessing—meant so much more to her than any diamond.\u003c/p\u003e\n\u003cp\u003e“Yes,” she whispered, her hand trembling as she held it up.\u003c/p\u003e\n\u003cp\u003eLynch slid the ring from the box. “You can never take this off, Rosa. I intend to have Fitz solder it to your finger.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to take it off.” She bounced impatiently. “Hurry up and put it on.”\u003c/p\u003e\n\u003cp\u003eHe slid it down over the iron knuckle and settled it in place. “Well, duchess… How do you feel?”\u003c/p\u003e\n\u003cp\u003e“I feel as if you have given me the world.” Her throat was dry and tight again as she looked at him. How could one have so much feeling inside and not drown in it? She would have to learn to cope with this. “I wish I could give you half as much.”\u003c/p\u003e\n\u003cp\u003e“You have.” He kissed her iron fingertips. “You have given me a future and joy in it too. Before I met you, I was only existing. I wasn’t living life. The last few weeks…as tumultuous as they’ve been, at least I’ve lived them.” Leaning down, he kissed her lips lightly.\u003c/p\u003e\n\u003cp\u003e“Besides,” he whispered against her lips, “we have so much to do together, you and I. A whole world to change.” The words caught her breath. “You are the only one I trust to watch my back.”\u003c/p\u003e\n\u003cp\u003e“Well, it is almost my favorite part to look at,” she whispered.\u003c/p\u003e\n\u003cp\u003eLynch smiled. “And there is my wicked Mrs. Marberry. I do believe I have one last request though… Something I would like to ask of you in exchange for the ring.”\u003c/p\u003e\n\u003cp\u003e“Anything,” she promised, smiling at this amazing man: her future, her hope, her heart…\u003c/p\u003e\n\u003cp\u003e“Keep the mask,” he breathed, and leaned down to kiss her again.\u003c/p\u003e","sourceLink":"https://allnovel.net/my-lady-quicksilver-london-steampunk-3/page-48.html","bookId":1582,"creation":"Oct 6, 2019 12:13:17 AM","modification":"Oct 6, 2019 12:13:17 AM"}
