{"id":63162,"no":26,"title":"Page 26","content":"\u003cp\u003eShe tasted of booze when I kissed her, and she had a small scotch while we decided where to go. We both wanted meat, so I suggested the Slate, a steak house on Tenth Avenue that always drew a lot of cops from Midtown North and John Jay College.\u003c/p\u003e\n\u003cp\u003eWe walked over there and got a table in front near the bar. I didn\u0027t see anyone I recognized, but several faces were vaguely familiar and almost every man in the room looked to be on the job. If anyone had been fool enough to hold the place up, he\u0027d have been surrounded by men with drawn revolvers, a fair percentage of them half in the bag.\u003c/p\u003e\n\u003cp\u003eI mentioned this to Willa, and she tried to calculate our chances of being gunned down in crossfire. \"A few years ago,\" she said, \"I wouldn\u0027t have been able to sit still in a place like this.\"\u003c/p\u003e\n\u003cp\u003e\"For fear of being caught in a crossfire?\"\u003c/p\u003e\n\u003cp\u003e\"For fear they\u0027d be shooting at me on purpose. It\u0027s still hard for me to believe I\u0027m dating a guy who used to be a cop.\"\u003c/p\u003e\n\u003cp\u003e\"Did you have a lot of trouble with cops?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I lost two teeth,\" she said, and fingered the two upper incisors that replaced the ones knocked out in Chicago. \"And we were always getting hassled. We were presumably undercover, but we always figured the FBI had somebody in the organization reporting to them, and I can\u0027t tell you the number of times the Feebies showed up to question me. Or to have long sessions with the neighbors.\"\u003c/p\u003e\n\u003cp\u003e\"That must have been a hell of a way to live.\"\u003c/p\u003e\n\u003cp\u003e\"It was crazy. But it almost killed me to leave.\"\u003c/p\u003e\n\u003cp\u003e\"They wouldn\u0027t let you go?\"\u003c/p\u003e\n\u003cp\u003e\"No, it wasn\u0027t like that. But the PCP gave my life all the meaning it had for a whole lot of years, and when I left it was like admitting all those years were a waste. And on top of that I would find myself doubting my actions. I would think that the PCP was right, and that I was just copping out, and missing my chance to make a difference in the world. That was what kept you sucked in, you know. The chance it gave you to see yourself as being one of the ones who mattered, out there on the cutting edge of history.\"\u003c/p\u003e\n\u003cp\u003eWe took our time over dinner. She had a sirloin and a baked potato. I ordered the mixed grill, and we split a Caesar salad. She started off with a scotch, then drank red wine with her dinner. I got a cup of coffee right away and let them keep filling it up for me. She wanted a pony of Armagnac with her coffee. The waitress came back and said the bartender didn\u0027t have any, so she settled for a cognac. It couldn\u0027t have been too bad, because she drank it and ordered a second one.\u003c/p\u003e\n\u003cp\u003eThe check came to a fairly impressive sum. She wanted to split it and I didn\u0027t work too hard trying to talk her out of it. \"Actually,\" she said, checking the waitress\u0027s arithmetic, \"I should be paying about two-thirds of this. More than that. I had a million drinks and you had a cup of coffee.\"\u003c/p\u003e\n\u003cp\u003e\"Cut it out.\"\u003c/p\u003e\n\u003cp\u003e\"And my entrйe was more than yours.\"\u003c/p\u003e\n\u003cp\u003eI told her to stop it, and we halved the check and the tip. Outside, she wanted to walk a little to clear her head. It was a little late for panhandlers, but some of them were still hard at it. I passed out a few dollars. The wild-eyed woman in the shawl got one of them. She had her baby in her arms, but I didn\u0027t see her other child, and I tried not to wonder where it had gone to.\u003c/p\u003e\n\u003cp\u003eWe walked downtown a few blocks and I asked Willa if she\u0027d mind stopping at Paris Green. She looked at me, amused. \"For a guy who doesn\u0027t drink,\" she said, \"you sure do a lot of barhopping.\"\u003c/p\u003e\n\u003cp\u003e\"Somebody I want to talk to.\"\u003c/p\u003e\n\u003cp\u003eWe cut across to Ninth, walked down to Paris Green and took seats at the bar. My friend with the bird\u0027s-nest beard wasn\u0027t working, and the fellow on duty was no one I\u0027d seen before. He was very young, with a lot of curly hair and a sort of vague and unfocused look about him. He didn\u0027t know how I could get hold of the other bartender. I went over and talked to the manager, describing the bartender I was looking for.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Gary,\" he said. \"He\u0027s not working tonight. Come around tomorrow, I think he\u0027s working tomorrow.\"\u003c/p\u003e\n\u003cp\u003eI asked if he had a number for him. He said he couldn\u0027t give that out. I asked if he\u0027d call Gary for me and see if he\u0027d be willing to take the call.\u003c/p\u003e\n\u003cp\u003e\"I really don\u0027t have time for that,\" he said. \"I\u0027m trying to run a restaurant here.\"\u003c/p\u003e\n\u003cp\u003eIf I still carried a badge he\u0027d have given me the number with no argument. If I\u0027d been Mickey Ballou I\u0027d have come back with a couple of friends and let him watch while we threw all his chairs and tables out into the street. There was another way, I could give him five or ten dollars for his time, but somehow that went against the grain.\u003c/p\u003e\n\u003cp\u003eI said, \"Make the phone call.\"\u003c/p\u003e\n\u003cp\u003e\"I just told you-\"\u003c/p\u003e\n\u003cp\u003e\"I know what you told me. Either make the phone call for me or give me the fucking number.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t know what the hell I could have done if he\u0027d refused, but something in my voice or face must have gotten through to him. He said, \"Just a moment,\" and disappeared into the back. I went and stood next to Willa, who was working on a brandy. She wanted to know if everything was all right. I told her everything was fine.\u003c/p\u003e\n\u003cp\u003eWhen the manager reappeared I walked over to meet him. \"There\u0027s no answer,\" he said. \"Here\u0027s the number, if you don\u0027t believe me you can try it yourself.\"\u003c/p\u003e\n\u003cp\u003eI took the slip of paper he handed me. I said, \"Why shouldn\u0027t I believe you? Of course I believe you.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me, his eyes wary.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" I said. \"I was out of line there, and I apologize. It\u0027s been a rough couple of days.\"\u003c/p\u003e\n\u003cp\u003eHe wavered, then went with the flow. \"Hey, that\u0027s cool,\" he said. \"Don\u0027t worry about it.\"\u003c/p\u003e\n\u003cp\u003e\"This city,\" I said, as if that explained everything, and he nodded, as if indeed it did.\u003c/p\u003e\n\u003cp\u003eHe wound up buying us a drink. We had survived a tense moment together, and that seemed to carry more weight than the fact that we had created the tension ourselves. I didn\u0027t really want another Perrier, but Willa managed to find room for another brandy.\u003c/p\u003e\n\u003cp\u003eWhen we stepped outside, the fresh air sucker-punched her and almost knocked her down. She grabbed my arm, caught her balance. \"I can feel that last brandy,\" she announced.\u003c/p\u003e\n\u003cp\u003e\"No kidding.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that supposed to mean?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003eShe drew away from me, her nostrils flaring, her face dark. \"I\u0027m quite all right,\" she said. \"I can get home under my own power.\"\u003c/p\u003e\n\u003cp\u003e\"Take it easy, Willa.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t tell me to take it easy. Mr. Holier-than-thou. Mr. Soberer-than-thou.\"\u003c/p\u003e\n\u003cp\u003eShe stalked off down the street. I walked alongside her and didn\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Forget it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not mad?\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t say much the rest of the way home. When we got into her apartment she swept up the faded flowers from the kitchen table and started dancing around the floor with them. She was humming something but I couldn\u0027t recognize the tune. After a few turns she stopped and began to cry. I took the flowers from her and put them on the table. I held her and she sobbed. When the tears stopped I let go of her and she stepped back. She began undressing, dropping her clothes on the floor as she removed them. She took off everything and walked straight back to the bedroom and got into the bed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she said. \"I\u0027m sorry, I\u0027m sorry, I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right.\"\u003c/p\u003e\n\u003cp\u003e\"Stay with me.\"\u003c/p\u003e\n\u003cp\u003eI stayed until I was sure she was sleeping soundly. Then I let myself out and went home.\u003c/p\u003e\n\u003cp\u003eI tried Gary\u0027s number in the morning. I let it ring and no one answered, neither man nor machine. I tried him again after breakfast with the same result. I took a long walk and tried the number a third time when I got back to the hotel. I put the television on, but all I could find were economists talking about the deficit and evangelists talking about the Day of Judgment. I turned them all off and the phone rang.\u003c/p\u003e\n\u003cp\u003eIt was Willa. \"I would have called you a little earlier,\" she said, \"but I wanted to make sure I was going to live.\"\u003c/p\u003e\n\u003cp\u003e\"Rough morning?\"\u003c/p\u003e\n\u003cp\u003e\"God. Was I impossible last night?\"\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t so bad.\"\u003c/p\u003e\n\u003cp\u003e\"You could say anything and I couldn\u0027t prove you wrong. I don\u0027t remember the end of the evening.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you were a little fuzzy there toward the end.\"\u003c/p\u003e\n\u003cp\u003e\"I remember having a second brandy at Paris Green. I remember telling myself that I didn\u0027t have to drink it just because it was free. He bought us a round, didn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"He did indeed.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he put arsenic in it. I almost wish he had. I don\u0027t remember anything after that. How did I get home?\"\u003c/p\u003e\n\u003cp\u003e\"We walked.\"\u003c/p\u003e\n\u003cp\u003e\"Did I turn nasty?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about it,\" I said. \"You were drunk and you were in a blackout. You didn\u0027t throw up, turn violent, or say anything indiscreet.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure of that?\"\u003c/p\u003e\n\u003cp\u003e\"Positive.\"\u003c/p\u003e\n\u003cp\u003e\"I hate not remembering. I hate losing control.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eThere\u0027s a Sunday afternoon meeting in SoHo that I\u0027ve always liked. I hadn\u0027t been there in months. I usually would spend Saturdays with Jan. We\u0027d make the rounds of the galleries and go out for dinner, and I\u0027d stay over, and in the morning she\u0027d fix a big brunch. We\u0027d walk around and look in shops and, when the time came, go to the meeting.\u003c/p\u003e\n\u003cp\u003eWhen we stopped seeing each other, I stopped going.\u003c/p\u003e\n\u003cp\u003eI took a subway downtown and walked in and out of a lot of shops on Spring Street and West Broadway. Most of the SoHo art galleries close on Sunday, but a few stay open, and there was one show I liked, realistic landscapes, all of them of Central Park. Most of them showed only grass and trees and benches, with no buildings looming in the background, but it was nonetheless clear that you were looking at a distinctly urban environment no matter how peaceful and green it appeared. Somehow the artist had managed to instill the city\u0027s hard-edged energy in the canvases, and I couldn\u0027t figure out how he\u0027d done it.\u003c/p\u003e\n\u003cp\u003eI went to the meeting, and Jan was there. I managed to focus on the qualification, and then during the break I went over and sat next to her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s funny,\" she said. \"I was thinking of you just this morning.\"\u003c/p\u003e\n\u003cp\u003e\"I almost called you yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"To see if you wanted to go out to Shea.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s really funny. I watched that game.\"\u003c/p\u003e\n\u003cp\u003e\"You were out there?\"\u003c/p\u003e\n\u003cp\u003e\"On television. You really almost called?\"\u003c/p\u003e\n\u003cp\u003e\"I did call.\"\u003c/p\u003e\n\u003cp\u003e\"When? I was home all day.\"\u003c/p\u003e\n\u003cp\u003e\"I let it ring twice and hung up.\"\u003c/p\u003e\n\u003cp\u003e\"I remember the call. I wondered who that was. As a matter of fact-\"\u003c/p\u003e\n\u003cp\u003e\"You wondered if it was me?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. The thought crossed my mind.\" She had her hands in her lap and she was looking at them. \"I don\u0027t think I\u0027d have gone.\"\u003c/p\u003e\n\u003cp\u003e\"To the game?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"But it\u0027s hard to say, isn\u0027t it? How I might have reacted. What you\u0027d have said, what I\u0027d have said.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want to have coffee after the meeting?\"\u003c/p\u003e\n\u003cp\u003eShe looked at me, then looked away. \"Oh, I don\u0027t know, Matthew,\" she said. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eI started to say something, but the chairperson was rapping on the table with a glass ashtray to indicate that it was time to resume the meeting. I went back to where I\u0027d been sitting. Toward the end I started raising my hand, and when I got called on I said, \"My name is Matt and I\u0027m an alcoholic. Over the past couple of weeks I\u0027ve been spending a lot of time around people who are drinking. Some of it\u0027s professional and some is social, and it\u0027s not always easy to tell which is which. I spent an hour or two in a ginmill the other night having one of those rambling conversations, and it was just like old times except I was drinking Coke.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/out-on-the-cutting-edge-matthew-scudder-7/page-26.html","bookId":2325,"creation":"Oct 5, 2019 9:50:22 AM","modification":"Oct 5, 2019 9:50:22 AM"}
