{"id":95972,"no":106,"title":"Page 106","content":"\u003cp\u003eI slammed the bathroom door shut, and Robby locked it. I was still holding Sarah and the light saber. We were waiting while staring at the door.\u003c/p\u003e\n\u003cp\u003eCalmly, I asked: “Where’s your cell phone, Robby?”\u003c/p\u003e\n\u003cp\u003e“It’s in my room.” He gestured over his shoulder.\u003c/p\u003e\n\u003cp\u003eI was contemplating something. I would unlock the door that led into Robby’s room and find the phone and run back into the bathroom and call 911. This was the idea that formed inside my mind.\u003c/p\u003e\n\u003cp\u003eVictor continued his freakout in the backyard.\u003c/p\u003e\n\u003cp\u003eThen something slammed into the door to Sarah’s room with such force that it bulged inward.\u003c/p\u003e\n\u003cp\u003eRobby and Sarah screamed.\u003c/p\u003e\n\u003cp\u003e“It’s gonna be okay. Robby, unlock your door. We’re gonna get out through your room.”\u003c/p\u003e\n\u003cp\u003e“Daddy, I can’t.” He was weeping.\u003c/p\u003e\n\u003cp\u003e“It’s gonna be okay.”\u003c/p\u003e\n\u003cp\u003eThe thing slammed into the door again.\u003c/p\u003e\n\u003cp\u003eThe door cracked down the middle. When the thing hit it again, the door was falling off its hinges.\u003c/p\u003e\n\u003cp\u003eThis moved Robby to immediately unlock his door and run out of the bathroom.\u003c/p\u003e\n\u003cp\u003eI followed, still holding Sarah and the light saber.\u003c/p\u003e\n\u003cp\u003eWe ran through Robby’s room and Robby unlocked the door and without hesitating we started moving down the staircase. The moon was streaming through the window and now we could see more clearly.\u003c/p\u003e\n\u003cp\u003eHalfway down the staircase I could see the thing rushing across the landing above us.\u003c/p\u003e\n\u003cp\u003eIt began to chase us down the stairs. I could hear its mouth opening and closing, making wet snapping sounds.\u003c/p\u003e\n\u003cp\u003eSarah turned her head and shrieked when she saw it lurching toward us.\u003c/p\u003e\n\u003cp\u003eMy office seemed closest. The door was open. The front door was not.\u003c/p\u003e\n\u003cp\u003eMy office had the gun in the safe.\u003c/p\u003e\n\u003cp\u003eIn my office we closed and locked the door. I put Sarah down on the couch. Both of the kids were crying. I uselessly told them it would be “okay.”\u003c/p\u003e\n\u003cp\u003eHolding the light saber toward the dial, I unlocked the safe and pulled out the gun.\u003c/p\u003e\n\u003cp\u003eI scanned my desk with the saber until I located my cell phone.\u003c/p\u003e\n\u003cp\u003eI asked Robby to hold the light saber while I dialed 911.\u003c/p\u003e\n\u003cp\u003eRobby was just staring at the gun I was holding. This caused him to close his eyes tightly and cover both ears with his hands.\u003c/p\u003e\n\u003cp\u003eThe thing began slamming itself into the door.\u003c/p\u003e\n\u003cp\u003e“Jesus Christ,” I shouted out.\u003c/p\u003e\n\u003cp\u003eThe slamming was becoming more frequent. The door was bulging forward in its frame. I looked frantically around the room. I rushed to the window and opened it.\u003c/p\u003e\n\u003cp\u003e(Note: The paint was peeling off the house so rapidly that it looked as if snow flurries had drifted onto Elsinore Lane.)\u003c/p\u003e\n\u003cp\u003eBut then the door cracked and fell to the side, hanging off the top hinge.\u003c/p\u003e\n\u003cp\u003eThe thing stood in the doorway.\u003c/p\u003e\n\u003cp\u003eEven with the faint glow of the saber I was swinging at it, I could see the froth wreathing its mouth.\u003c/p\u003e\n\u003cp\u003e“Shoot it! Shoot it!” Robby was screaming.\u003c/p\u003e\n\u003cp\u003eI pointed the gun at the thing as it began shambling toward us.\u003c/p\u003e\n\u003cp\u003eI pulled the trigger.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eThe gun was not loaded.\u003c/p\u003e\n\u003cp\u003e(Note: Jayne had removed all the bullets from the gun after the night she thought I “imagined” an intruder had broken into the house.)\u003c/p\u003e\n\u003cp\u003eWe could barely see the thing as it advanced toward us. It was making sucking sounds.\u003c/p\u003e\n\u003cp\u003eThe electricity came on so quickly that we were blinded by the lights. The smoke alarm was beeping incessantly. Everything that had been turned off before bed was now on. Every light in the house was burning. The television was blasting. From the stereo blared a Muzak version of “The Way We Were.” My computer flashed on.\u003c/p\u003e\n\u003cp\u003eThe house was sunstruck with light.\u003c/p\u003e\n\u003cp\u003eThe light kept us from witnessing the thing’s disappearance.\u003c/p\u003e\n\u003cp\u003e“Daddy, you’re bleeding.” This from Sarah.\u003c/p\u003e\n\u003cp\u003eI touched my lips. My fingers came back red.\u003c/p\u003e\n\u003cp\u003eAs I stood there I noticed the time on the battery-powered clock on my desk.\u003c/p\u003e\n\u003cp\u003eThe electricity had come on at exactly 2:40 a.m.\u003c/p\u003e\n\u003cp\u003e25. the thing in the hall\u003c/p\u003e\n\u003cp\u003eFour minutes after a 911 call was made, the flashing blue lights of a patrol car pulled up to 307 Elsinore Lane.\u003c/p\u003e\n\u003cp\u003eI had told the 911 operator that there had been a break-in but no one had been injured and the “perpetrator” had escaped.\u003c/p\u003e\n\u003cp\u003eI was asked if I would like to stay on the line until the officers arrived.\u003c/p\u003e\n\u003cp\u003eI declined because I had to think things through.\u003c/p\u003e\n\u003cp\u003eI had to make a few key decisions.\u003c/p\u003e\n\u003cp\u003eWould the threat I was about to relate entail something that had found its way into our house? Or would I try to push the lie (the more plausible scenario) that it was—what?—your basic home invasion? Would I refrain from using the word “creature” as I gestured toward the woods? Would I make an attempt to describe the thing in the hallway? Would I act “concerned” while downplaying the true extent of my fears since there was nothing anyone could do to help us? \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-106.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
