{"id":95976,"no":110,"title":"Page 110","content":"\u003cp\u003e(This was all for show, I realized. This was me playing the concerned parent. This was acting for the kids and for Marta, who would relay my performance as the concerned parent to Jayne. The cops were not to blame. Considering what was actually happening there was nothing they could do. I should have never called 911. It had been a tactical error. I should have bundled the kids up and just driven to a hotel myself.)\u003c/p\u003e\n\u003cp\u003eBut you needed an alibi to get out of the house, the writer was reminding me. How else were you going to explain your “escape” from 307 Elsinore Lane? The thing in the hall gave you a very convenient reason.\u003c/p\u003e\n\u003cp\u003e“We think it was probably your dog, Mr. Ellis.”\u003c/p\u003e\n\u003cp\u003e“We’re checking into a hotel,” I said curtly. I turned to Marta. “Right?”\u003c/p\u003e\n\u003cp\u003eShe nodded her head, staring at me wide-eyed.\u003c/p\u003e\n\u003cp\u003eSo this was their theory: Drunk out of my mind on a combination of vodka and Klonopin, I had woken up my children because I believed we were being attacked by our pet. That was so lame-ass I could not even dignify it with a response.\u003c/p\u003e\n\u003cp\u003eBut even the writer thought this was plausible.\u003c/p\u003e\n\u003cp\u003eThe writer told me that the policemen thought I was taking advantage of them.\u003c/p\u003e\n\u003cp\u003eThe writer told me that one of the officers had laughed when they came upon the green light saber on the floor of my office.\u003c/p\u003e\n\u003cp\u003eThe writer told me that two of the officers had masturbated to sex scenes in American Psycho.\u003c/p\u003e\n\u003cp\u003eBoyle stayed with Robby and Sarah as O’Nan escorted Marta and me into the house. Marta would go to the kids’ rooms to gather their things (uniforms, backpacks, schoolbooks) while I grabbed whatever I needed.\u003c/p\u003e\n\u003cp\u003eBut first I followed Marta into Sarah’s room and stood by the bathroom door.\u003c/p\u003e\n\u003cp\u003eMarta glanced at the door and paused.\u003c/p\u003e\n\u003cp\u003eO’Nan noted the pause and made a gesture—just a shrug, just a sympathetic glance—that indicated we would wait and see.\u003c/p\u003e\n\u003cp\u003eI wanted to shout, “Wait and see for what?”\u003c/p\u003e\n\u003cp\u003eThe door had burst off its hinges, and slime glistened horridly from its doorknob.\u003c/p\u003e\n\u003cp\u003eThe worst thing: the door had been gouged because the thing had splintered it with its mouth.\u003c/p\u003e\n\u003cp\u003eThere were clumps of fur dotting the hallway—hair the thing had shed.\u003c/p\u003e\n\u003cp\u003eFrom the window in the master bedroom I watched as two of the officers scanned the field behind the house, looking for nonexistent clues. They were not going to find any trails. Nothing led up to any of the “unbroken windows” and “locked doors” of the house. They were gossiping about Jayne Dennis and her crazy husband. O’Nan made a sound that suggested I start packing my things. I blindly filled a large duffel bag with a suit, my wallet, my laptop. I packed toiletries and medication. I glimpsed myself in the mirror as I changed into a pair of sweats, a T-shirt and a leather jacket. The side of my face was a crescent of burgeoning purple. My lower lip was split in the middle by a thin black line. My eyes were fluttering.\u003c/p\u003e\n\u003cp\u003eAfter leaving the bathroom, I looked one last time at the bed the Terby had crawled under.\u003c/p\u003e\n\u003cp\u003eThe writer was with me in the room.\u003c/p\u003e\n\u003cp\u003eTell them you have information about the horse mutilation in Pearce.\u003c/p\u003e\n\u003cp\u003eTell them about Patrick Bateman calling you earlier tonight, the writer suggested.\u003c/p\u003e\n\u003cp\u003eTell them about the girl in Room 101 of the Orsic Motel.\u003c/p\u003e\n\u003cp\u003eGo ahead. Make the leap. Maybe you’ll save yourself.\u003c/p\u003e\n\u003cp\u003eI piled the kids into the Range Rover, along with Victor, who would be staying in a kennel located in the basement of the Four Seasons. Marta left her car in the driveway and drove. This decision was made after the officers threatened to give me a Breathalyzer test. They also insisted on escorting us to the hotel, where the night manager would be waiting for us.\u003c/p\u003e\n\u003cp\u003eThe Range Rover and the two patrol cars pulled away from the darkened house.\u003c/p\u003e\n\u003cp\u003eLook, it’s still peeling. Did you look in the living room again? I think you’d—\u003c/p\u003e\n\u003cp\u003eAs we drove through the barren town I leaned my head against the passenger window. The coolness of the glass felt soothing against the bruised cheek.\u003c/p\u003e\n\u003cp\u003eSo, the writer said. The thing in the hall.\u003c/p\u003e\n\u003cp\u003eWhat about it?\u003c/p\u003e\n\u003cp\u003eIt’s memory lane time, isn’t it, Bret?\u003c/p\u003e\n\u003cp\u003eI know what I saw.\u003c/p\u003e\n\u003cp\u003eWhat did you see? Or, more precisely, when did you first see it?\u003c/p\u003e\n\u003cp\u003eI actually saw it on Halloween night. It had been in the woods. I saw it scrambling in and out of the woods. Like a spider.\u003c/p\u003e\n\u003cp\u003eHow old were you when you wrote the story?\u003c/p\u003e\n\u003cp\u003eI was twelve. Just about Robby’s age. It was written in the hand of a child.\u003c/p\u003e\n\u003cp\u003eWhat was the story called?\u003c/p\u003e\n\u003cp\u003eIt didn’t have a title.\u003c/p\u003e\n\u003cp\u003eActually, that’s not true.\u003c/p\u003e\n\u003cp\u003eYou’re right. It was called “The Tomb.”\u003c/p\u003e\n\u003cp\u003eWhat was the story about, Bret? \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-110.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
