{"id":95977,"no":111,"title":"Page 111","content":"\u003cp\u003eIt was about a thing. This monster. It lived in the woods. It was afraid of light.\u003c/p\u003e\n\u003cp\u003eWhy did you write this story?\u003c/p\u003e\n\u003cp\u003eBecause I was so scared all the time.\u003c/p\u003e\n\u003cp\u003eWhat were you so scared of?\u003c/p\u003e\n\u003cp\u003eMy father.\u003c/p\u003e\n\u003cp\u003eWhat did the monster in the story look like, Bret?\u003c/p\u003e\n\u003cp\u003eIt looked like what was in our house tonight. It was identical to what I had imagined at twelve. I had written the story and illustrated it. And the thing in the hallway was what I had drawn.\u003c/p\u003e\n\u003cp\u003eHad you ever seen it before?\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eWhat did this monster you created do?\u003c/p\u003e\n\u003cp\u003eIt broke into the homes of families. In the middle of the night.\u003c/p\u003e\n\u003cp\u003eWhy did it do this?\u003c/p\u003e\n\u003cp\u003eI don’t want to answer that.\u003c/p\u003e\n\u003cp\u003eBut I want an answer.\u003c/p\u003e\n\u003cp\u003eWhy don’t you tell me?\u003c/p\u003e\n\u003cp\u003eIt broke into the homes of families because it wanted to eat the children.\u003c/p\u003e\n\u003cp\u003eThe empty streets were sliding by, and no one in the car said a word. Robby was regarding the moon and it was whispering to him while Sarah hummed softly to herself, almost as if in consolation. At the corner of Fort and Sycamore I noticed that a massive eucalyptus tree had burst up out of the sidewalk.\u003c/p\u003e\n\u003cp\u003eI asked the writer: Why is it appearing—manifesting itself—on Elsinore Lane?\u003c/p\u003e\n\u003cp\u003eI’ll answer that question with another question: Why is Patrick Bateman roaming Midland County?\u003c/p\u003e\n\u003cp\u003eWhat else is out there? How can a fictional thing become real?\u003c/p\u003e\n\u003cp\u003eWere you remorseful when you created the monster in the hall?\u003c/p\u003e\n\u003cp\u003eNo. I was frightened. I was trying to find my way in the world.\u003c/p\u003e\n\u003cp\u003eA brief period of consciousness: checking into the hotel in the grand, deserted lobby.\u003c/p\u003e\n\u003cp\u003eThe respite: the dullness of the exchange—all monotone and trance—between Marta and the night manager. My voice was too hoarse for me to talk to anyone.\u003c/p\u003e\n\u003cp\u003eA bellboy showed us to a two-bedroom suite. The kids would occupy one room with two queen-sized beds. A spacious, ornately decorated sitting room separated them from where I would be sleeping.\u003c/p\u003e\n\u003cp\u003eAs Marta helped the kids to bed I remembered discussing “The Tomb” once with a psychologist my parents had sent me to when I was a teenager (I had parodied him in Less Than Zero), and he had been amused by the Freudian elements—the sexual imagery—present in the story that I couldn’t have grasped at twelve. What was the mound of hair? Why did the orifice have teeth? Why was a light saber nearing the mound of hair? Why was the little boy screaming Shoot it!?\u003c/p\u003e\n\u003cp\u003eBut something knocked me out of my memories of a story I had nearly forgotten and that played itself out in the early morning of November sixth.\u003c/p\u003e\n\u003cp\u003eAnd this was: the kids seemed okay.\u003c/p\u003e\n\u003cp\u003eI stood in the doorway and watched as they settled into their respective beds, Marta tucking them in.\u003c/p\u003e\n\u003cp\u003eI had imagined that the fear they had experienced during those roughly ten minutes of horror would be permanently sewn into their future. But this did not seem to be the case. It appeared that life was going to move on in its usual fashion. The bounce-back time amazed me. Their recovery would be complete by the time they woke up the next morning. What had been a frightening experience was now going to become a game, an emblem of pride, a story that would impress and enthrall friends. The nightmare was now an adventure. They were shook up but they were also tough and resilient. (This was the only relief I felt about anything that night.) Sarah and Robby had been bored and tired in the ride over to the hotel, and they kept yawning in the elevator, and soon they would be sleeping and then they would wake up and they would order room service for breakfast before being driven to school by Marta (though it would be up to the kids if they wanted to go) and Robby might even take a math test in the afternoon and then they would return to the Four Seasons and they would do their homework in front of the television and we would keep waiting for Mommy to come home.\u003c/p\u003e\n\u003cp\u003eThe kids fell asleep almost immediately.\u003c/p\u003e\n\u003cp\u003eMarta said she would give me a call around eight, just to check in.\u003c/p\u003e\n\u003cp\u003eIt was now 3:40. From the moment the lights blinded us until now, everything had happened within the space of an hour.\u003c/p\u003e\n\u003cp\u003eI walked Marta to the foyer of the suite and feebly whispered, “Thank you” as I let her out.\u003c/p\u003e\n\u003cp\u003eLeaning against the door I had just closed, I was hit by the thought: Writing will cost you a son and a wife, and this is why Lunar Park will be your last novel.\u003c/p\u003e\n\u003cp\u003eI immediately opened the minibar and drank a bottle of red wine.\u003c/p\u003e\n\u003cp\u003eDuring the next four hours something happened that I don’t remember.\u003c/p\u003e\n\u003cp\u003eThe writer filled in the blanks.\u003c/p\u003e\n\u003cp\u003eI plugged in my laptop and logged on to the Internet.\u003c/p\u003e\n\u003cp\u003eThis is where I typed in the following words: “ghost,” “haunting,” “exorcist.”\u003c/p\u003e\n\u003cp\u003eSurprise and dread: there were thousands of Web sites related to these matters. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-111.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
