{"id":95979,"no":113,"title":"Page 113","content":"\u003cp\u003eA beige van swung into the deserted lot and parked next to the Range Rover. Robert Miller appeared, belly first, dressed in faded jeans and a matching jacket and a turquoise shirt: a large man in his midfifties with a mustache and long graying hair tied back in a ponytail. Tired and drawn, he glanced at his watch, which moved me instinctively to clutch my wrist (it was numb). He walked into the diner holding a notepad, and at first I had no idea who this was. The man seemed to recognize me, though, as he hitched his pants up and hauled his way over to the booth I sat shivering in. When I looked up I saw a grizzled, wounded face that had experienced a lot.\u003c/p\u003e\n\u003cp\u003e“Are you Mr. Ellis?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’m Robert Miller.”\u003c/p\u003e\n\u003cp\u003eI just stared at him.\u003c/p\u003e\n\u003cp\u003eHe wasn’t sure that his introduction had received the desired response.\u003c/p\u003e\n\u003cp\u003e“You contacted me early this morning? We spoke on the phone?”\u003c/p\u003e\n\u003cp\u003e“Yes, of course.” I stood shakily and offered my hand.\u003c/p\u003e\n\u003cp\u003eHe took it in a businesslike fashion—he had a hard, callused grip, unlike the damp, soft, smooth hand of a writer—and after letting go of it he slid into the booth across from me. He calmly motioned to the lone waitress and ordered a cup of coffee and a glass of water and then he placed the notepad on the table. There was information about me on the notepad: the date of my birth, the titles of my books, the address of the house on Elsinore Lane.\u003c/p\u003e\n\u003cp\u003eI took a moment to arrange my thoughts. I had somewhat prepared myself in the fifteen minutes it took to drive to Pearce, and I thought the writer and I had constructed a fairly coherent story that would move Miller to help me. But now that I was actually here in front of him, I was embarrassed and I started stammering as soon as I opened my mouth. I began explaining what was happening in the house in a calm and linear fashion, but soon I was grabbing at everything I had witnessed and then the entire week rushed back to me all at once and I just kept haphazardly piling on the details—the Terby, the gravestone, the black hole in the field, the flickering lights, the intruder, the furniture that rearranged itself, the footprints stamped in ash, the dead animals, the video attachment, the wind, my father, how the house on Elsinore Lane was shifting into the house on Valley Vista—and, with my face straining, offered a muddled story that only I could make sense of. But Miller seemed to be taking me seriously. He kept jotting notes when a particular detail alerted him to, and he didn’t appear to be bothered by even the most outlandish claim. His expression wasn’t readable—he could have been drugged. He was taking the jagged, nonsensical plotline in stride. Where was the amazement? Where was the surprise? But then it hit me that, considering what Miller was here for, this was a common morning for him. I understood that his stance was routine, as was the gibbering of the frightened client. It did not relieve me to recount these events to someone.\u003c/p\u003e\n\u003cp\u003eI did not mention the missing boys or Aimee Light and the Orsic Motel, but I did tell him about the phone call from Patrick Bateman. At that point Miller interrupted me, looking up from the notepad.\u003c/p\u003e\n\u003cp\u003e“Who’s that?” Miller asked.\u003c/p\u003e\n\u003cp\u003e“Patrick Bateman? He’s a, um, fictional character . . . of mine.”\u003c/p\u003e\n\u003cp\u003e“Oh yes, that’s right. Yes, I remember.”\u003c/p\u003e\n\u003cp\u003e“I mean, he doesn’t actually exist. I made him up. I think someone is just, y’know, just impersonating him.”\u003c/p\u003e\n\u003cp\u003e“You think someone is impersonating him?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yeah.” I tried to keep my voice steady. “Yeah, I mean, y’know, what other explanation is there? I don’t know what other explanation there is.”\u003c/p\u003e\n\u003cp\u003eMiller offered a thoughtful nod but then asked me, “Do you think someone was impersonating that thing you saw in the hallway last night?”\u003c/p\u003e\n\u003cp\u003eI started walking off the path.\u003c/p\u003e\n\u003cp\u003e“Um . . . no . . . no . . . that was something I had created . . . also.”\u003c/p\u003e\n\u003cp\u003eI realized that lurking somewhere in Miller’s question there was a theory being built and in an oddly soothing way I also realized that I was finally sitting with someone who was a believer.\u003c/p\u003e\n\u003cp\u003eMiller kept studying me. I had not taken off my sunglasses.\u003c/p\u003e\n\u003cp\u003e“I’m not sure . . .” I started haltingly. “I’m . . . how the house and these physical manifestations of these . . . um . . . fictional creations . . . are tied together but . . . I think that maybe they are . . .” I said this with a whispered desperation that physically pained me. Saying this out loud into the empty air of the diner, I grasped at whatever dignity remained. I sat up.\u003c/p\u003e\n\u003cp\u003eThe silence lengthened while Miller took me in. He had removed his mirrored sunglasses—his eyes were a plain and milky blue—in a gesture that implied I ought to do the same, but I couldn’t; my eyes had sunk too deeply into their sockets. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-113.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
