{"id":95986,"no":120,"title":"Page 120","content":"\u003cp\u003eAll the curtains and blinds in the house were drawn shut—I did not ask why—and the interior of the house darkened considerably, but with enough light still scratching through from outside.\u003c/p\u003e\n\u003cp\u003eOnce Sam and Dale were in position upstairs, Miller asked me to turn off the fuse box.\u003c/p\u003e\n\u003cp\u003eIt was located in the hallway that led to the garage.\u003c/p\u003e\n\u003cp\u003eI opened it.\u003c/p\u003e\n\u003cp\u003eI breathed in as I shut off the power.\u003c/p\u003e\n\u003cp\u003eWalking quickly back to Miller’s side, I realized that this was the quietest the house had ever been.\u003c/p\u003e\n\u003cp\u003eDuring this thought all three EMF meters started beeping—instantly, in unison.\u003c/p\u003e\n\u003cp\u003eAccording to the flashing red digital numbers I saw a reading jump from 0 to 100 in what seemed like less than a second.\u003c/p\u003e\n\u003cp\u003eImmediately the cameras sensed something and started whirring, moving in a continuous circular motion atop the tripods.\u003c/p\u003e\n\u003cp\u003e“We have liftoff,” I heard one of the guys whoop from upstairs.\u003c/p\u003e\n\u003cp\u003eThe beeping suddenly became more insistent.\u003c/p\u003e\n\u003cp\u003eThe cameras kept flashing as they turned.\u003c/p\u003e\n\u003cp\u003eThe locks on the French windows in the living room made a cracking sound.\u003c/p\u003e\n\u003cp\u003eAnother cracking sound and the windows swung outward, causing the green curtains to start billowing even though it was a cold, still November afternoon.\u003c/p\u003e\n\u003cp\u003eBut then they stopped billowing.\u003c/p\u003e\n\u003cp\u003eThe curtains weren’t there last night, the writer said. Don’t you recognize them? the writer asked. Think back.\u003c/p\u003e\n\u003cp\u003eAir gusted over us, and the faint sound of something being pounded echoed throughout the house.\u003c/p\u003e\n\u003cp\u003eThe pounding continued.\u003c/p\u003e\n\u003cp\u003eIt was moving through the walls and then into the ceiling above us.\u003c/p\u003e\n\u003cp\u003eThe pounding was competing with the sounds from the EMFs but the pounding soon overtook it.\u003c/p\u003e\n\u003cp\u003eI shut my eyes, but the writer told me that the pounding culminated when a huge puncture appeared in the wall above the couch in the living room.\u003c/p\u003e\n\u003cp\u003e(Later, the writer told me that I had screamed while standing perfectly still.)\u003c/p\u003e\n\u003cp\u003eAnd then: silence.\u003c/p\u003e\n\u003cp\u003eThe EMF monitors stopped beeping.\u003c/p\u003e\n\u003cp\u003e“Hoo-ah!” This from one of the guys upstairs.\u003c/p\u003e\n\u003cp\u003eThe other whooped gleefully again.\u003c/p\u003e\n\u003cp\u003eThey had been on this ride before.\u003c/p\u003e\n\u003cp\u003eMiller and I were breathing hard.\u003c/p\u003e\n\u003cp\u003eI didn’t care if I appeared afraid.\u003c/p\u003e\n\u003cp\u003e“I’m sensing a male presence,” I heard Miller murmur, scanning the room.\u003c/p\u003e\n\u003cp\u003e“The lights are flickering, Bob,” Sam called down from the upstairs hallway.\u003c/p\u003e\n\u003cp\u003eFrom where Miller and I stood we looked up and could see the flickering lights of the sconces reflected in the massive window near the top of the stairs.\u003c/p\u003e\n\u003cp\u003eIt seemed as if something knew we had noticed this and the flickering stopped abruptly.\u003c/p\u003e\n\u003cp\u003eMiller was now standing in front of the freshly punctured wall.\u003c/p\u003e\n\u003cp\u003eHe stared at it, humbly.\u003c/p\u003e\n\u003cp\u003e“An angry man . . . someone very lost and angry . . .”\u003c/p\u003e\n\u003cp\u003eI was so afraid I could not feel myself. I was just a voice asking: “What does that mean? What’s going on? What does it want? Why is it stopping?”\u003c/p\u003e\n\u003cp\u003eMiller scanned the ceiling with his EMF.\u003c/p\u003e\n\u003cp\u003e“Why did it stop?” I kept asking.\u003c/p\u003e\n\u003cp\u003eMiller answered quietly.\u003c/p\u003e\n\u003cp\u003e“Because it knows we’re here.”\u003c/p\u003e\n\u003cp\u003eThis was part of his performance. He was trying to project self-assurance, confidence, a sense of command, but there was one lucid fraction within me peering through the fear that knew whatever resided in the house was going to defeat us all in the end.\u003c/p\u003e\n\u003cp\u003e(I flashed on: You resided in this house, Bret.)\u003c/p\u003e\n\u003cp\u003e“Because it knows we’re here,” Miller murmured again.\u003c/p\u003e\n\u003cp\u003eMiller turned to me.\u003c/p\u003e\n\u003cp\u003e“Because it’s curious.”\u003c/p\u003e\n\u003cp\u003eWe waited for what felt like eternity.\u003c/p\u003e\n\u003cp\u003eThe house seemed to grow darker as time passed.\u003c/p\u003e\n\u003cp\u003eFinally, Miller called up. “Dale—anything?”\u003c/p\u003e\n\u003cp\u003e“It’s quiet now,” Dale called back down.\u003c/p\u003e\n\u003cp\u003e“Sam—anything?”\u003c/p\u003e\n\u003cp\u003eSam’s answer was interrupted when the EMFs resumed beeping again.\u003c/p\u003e\n\u003cp\u003eThis was followed by the cameras whirring.\u003c/p\u003e\n\u003cp\u003eAnd then a sound announced itself that unnerved me more than the pounding or the noise emanating from the meters.\u003c/p\u003e\n\u003cp\u003eA voice was singing.\u003c/p\u003e\n\u003cp\u003eMusic began playing throughout the house.\u003c/p\u003e\n\u003cp\u003eA song from the past, flowing from an eight track on the long drive up the California coastline to a place called Pajaro Dunes.\u003c/p\u003e\n\u003cp\u003e. . . memories light the corners of my mind . . .\u003c/p\u003e\n\u003cp\u003e“Did we unplug the stereo?” I asked, wheeling around in the semidarkness.\u003c/p\u003e\n\u003cp\u003e. . . misty water color memories . . .\u003c/p\u003e\n\u003cp\u003e“Yes, we did, Mr. Ellis.” This was Miller, holding his EMF as if it was guiding him toward something.\u003c/p\u003e\n\u003cp\u003e. . . of the way we were . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-120.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
