{"id":95993,"no":127,"title":"Page 127","content":"\u003cp\u003e“Yeah, I’m actually here at the house. I drove in from the airport to check it out.” I paused as I moved into the kitchen.\u003c/p\u003e\n\u003cp\u003e“Well, everything’s been pretty good—”\u003c/p\u003e\n\u003cp\u003e“What’s Victor doing here? I thought I told you not to—”\u003c/p\u003e\n\u003cp\u003e“Oh yeah,” Marta said. “We just brought him back this morning.”\u003c/p\u003e\n\u003cp\u003e“Why did you bring him back?”\u003c/p\u003e\n\u003cp\u003e“He was freaking out in the kennels, and the hotel told me we had to get him out of there. And since you told me the house would be finished by Sunday, we dropped him off a couple hours ago. Is he okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah . . . he’s okay . . .”\u003c/p\u003e\n\u003cp\u003eAt this point I had moved out of the kitchen and into the foyer.\u003c/p\u003e\n\u003cp\u003eI was standing at the bottom of the stairs, and then, with no hesitation, I started climbing them.\u003c/p\u003e\n\u003cp\u003e“Well, he was completely unhinged over here,” Marta said. “The cages were small, and he just wasn’t happy and of course Robby and Sarah started getting upset. But once we dropped him off at the house he seemed fine. He totally relaxed and—”\u003c/p\u003e\n\u003cp\u003e“How are the kids?” I asked, cutting her off, realizing how unimportant Victor seemed to me.\u003c/p\u003e\n\u003cp\u003e“Well, Sarah’s right here with me—”\u003c/p\u003e\n\u003cp\u003e“What about Robby?”\u003c/p\u003e\n\u003cp\u003e(Marta Kauffman later testified that I asked this with an “unnatural urgency.”)\u003c/p\u003e\n\u003cp\u003e“Robby went to the mall with some friends to see a movie.”\u003c/p\u003e\n\u003cp\u003e(“Who came back to the house when you dropped Victor off?” I do not recall asking this but according to Marta Kauffman’s deposition on November eighteenth, I had.)\u003c/p\u003e\n\u003cp\u003e“We all did.” Marta paused. “Robby needed to pick up some stuff.”\u003c/p\u003e\n\u003cp\u003eI do remember, however, that at this point I was heading toward Robby’s door.\u003c/p\u003e\n\u003cp\u003e“Pick up some stuff for what?” I asked.\u003c/p\u003e\n\u003cp\u003e“He said he was going to spend the night at a friend’s.”\u003c/p\u003e\n\u003cp\u003e“What friend?”\u003c/p\u003e\n\u003cp\u003e“Ashton, I think.” She paused. “Yeah, I’m pretty sure he said Ashton.”\u003c/p\u003e\n\u003cp\u003e(Before walking into the room I murmured something that neither I nor Marta Kauffman could recall on November eighteenth but was, according to the writer: “Why would Robby have to pick up stuff if Ashton lives next door?”)\u003c/p\u003e\n\u003cp\u003e“Bret, it’s no big deal. It was just some clothes. He was in his room for ten minutes. Nadine Allen’s picking them up from the mall, and he should be back at their place by four—”\u003c/p\u003e\n\u003cp\u003e“Can you give me his cell number?”\u003c/p\u003e\n\u003cp\u003eMarta sighed—which pissed me off, I recall that flicker of rage—and gave it to me.\u003c/p\u003e\n\u003cp\u003e“I’m coming right back to the hotel,” I said. “I’ll see you guys in about twenty minutes.”\u003c/p\u003e\n\u003cp\u003e“Do you want to talk to Sarah—”\u003c/p\u003e\n\u003cp\u003eAfter hanging up on Marta, I dialed Robby’s number.\u003c/p\u003e\n\u003cp\u003eI waited by his door. There was no answer.\u003c/p\u003e\n\u003cp\u003eBut I wasn’t worried and I didn’t leave a message.\u003c/p\u003e\n\u003cp\u003eWhy would I?\u003c/p\u003e\n\u003cp\u003eHe was at the Fortinbras Mall with friends and they were watching a movie and he had diligently turned off the phone once it began (a scenario impossibly distant from what actually happened that day) and then I would see him back at the hotel, and even though we were not checking out of the Four Seasons and returning to the house (that was never going to be an option), Robby could still spend the night at the Allens’ (even though at that moment I had a shivery premonition about this being a school night) and Jayne would come back on Wednesday and our lives would move on as they were supposed to ever since I had accepted Jayne’s offer and moved to Midland County in July. I thought expectantly about the upcoming holidays even while I stared at the gnawed, cracked door in front of me.\u003c/p\u003e\n\u003cp\u003e(I don’t remember actually opening the door to Robby’s room but—for some reason—I do remember the first thing that came to my mind when I walked in. It was something Robby had told me when he was pointing out things in the night sky at that picnic in Horatio Park over the summer: the stars you see in the night sky actually do not exist.)\u003c/p\u003e\n\u003cp\u003eThe room was still in the same state it was left in on Wednesday night when we fled the house. An unmade bed, the dead computer, an opened closet.\u003c/p\u003e\n\u003cp\u003eI moved slowly to the window and looked out onto Elsinore Lane.\u003c/p\u003e\n\u003cp\u003eAnother quiet Sunday, and everything felt okay with the world.\u003c/p\u003e\n\u003cp\u003e(Is that a sentence you ever thought you would actually write?)\u003c/p\u003e\n\u003cp\u003eI stood in the room for a long time, taking inventory.\u003c/p\u003e\n\u003cp\u003eWhat I had not done: I had not turned around.\u003c/p\u003e\n\u003cp\u003eI had walked straight into the room. I had stood there. I had contemplated my son and his motives. I did not see what was behind me. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-127.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
