{"id":95884,"no":18,"title":"Page 18","content":"\u003cp\u003eShe laughed and broke away. “Look, this isn’t gonna happen here,” and then, studying my head, “Did you do something to your hair?”\u003c/p\u003e\n\u003cp\u003eI kissed her on the mouth again. And she responded even more urgently this time. We were suddenly interrupted by my ringing cell phone. I ignored it. We kept kissing but I already felt the pangs of disappointment—there was no chance anything more was going to happen in this bathroom tonight—and the phone kept vibrating in my back pocket until I had to answer it.\u003c/p\u003e\n\u003cp\u003eAimee finally pushed me away. “Okay—that’s enough.”\u003c/p\u003e\n\u003cp\u003e“For now,” I said in my sexiest voice, though it came out sounding merely ominous. My arm still around her, I held the phone to my ear with my free hand.\u003c/p\u003e\n\u003cp\u003e“Yo?” I said, checking the incoming number.\u003c/p\u003e\n\u003cp\u003e“It’s me.” It was Jay but I could barely hear him.\u003c/p\u003e\n\u003cp\u003e“Where are you?” I whined. “Jesus, Jay, you are one lost bastard.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, where am I?” he asked.\u003c/p\u003e\n\u003cp\u003e“You sound like you’re at some kind of party.” I paused. “Don’t tell me that many people showed up at your goddamn reading.”\u003c/p\u003e\n\u003cp\u003e“Well, open the door and you’ll see where I am” was his reply.\u003c/p\u003e\n\u003cp\u003e“Open which door?”\u003c/p\u003e\n\u003cp\u003e“The one you’re behind, moron.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I turned to Aimee. “It’s the Jayster.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you just let me out first,” Aimee suggested, hurrying toward the mirror to make sure everything was in place.\u003c/p\u003e\n\u003cp\u003eBut I opened the door, high and not caring, and Jay stood there, his hair fashionably tousled, wearing black slacks and an orange Helmut Lang button-down.\u003c/p\u003e\n\u003cp\u003e“Ah, I thought I’d find you in a bathroom.” And then Jay turned his gaze on Aimee and said, after looking her over appreciatively, “It’s where he can usually be located.”\u003c/p\u003e\n\u003cp\u003e“I have a weak bladder.” I shrugged and bent down to retrieve my sombrero.\u003c/p\u003e\n\u003cp\u003e“And you also have”—Jay reached over and touched my nose as I stood up—“what I am and am not hoping is baby powder above your upper lip.”\u003c/p\u003e\n\u003cp\u003eI leaned toward the bathroom mirror and wiped off the residue of coke, then placed the straw hat back onto my head at what I thought was a raffish angle.\u003c/p\u003e\n\u003cp\u003e“So creative yet so destructive, I know, I know,” Jay said, causing Aimee to crack up.\u003c/p\u003e\n\u003cp\u003e“Jay McInerney, Aimee Light.” I leaned closer to the mirror and checked my nose again.\u003c/p\u003e\n\u003cp\u003e“I’m a big fan—” Aimee started.\u003c/p\u003e\n\u003cp\u003e“Hey, watch it.” I scowled. “Aimee’s a student at the college and she’s doing her thesis on me.”\u003c/p\u003e\n\u003cp\u003e“So that explains . . . this?” Jay said, gesturing at the scene in the bathroom.\u003c/p\u003e\n\u003cp\u003eAimee looked away nervously and said, “Nice to meet you, but I’ve gotta go.”\u003c/p\u003e\n\u003cp\u003e“Want a bump?” I asked Jay, blocking Aimee’s exit.\u003c/p\u003e\n\u003cp\u003e“Look, I’ve really gotta go,” Aimee said more insistently and squeezed past me, and then I took one last look in the mirror and followed, closing the bathroom door behind us. The three of us, outside in the hall, were suddenly approached by a very tall and sexy cat holding a tray of nachos. I slung the guitar back across my chest, almost hitting her with the neck but she ducked in time. Stevie Wonder’s “Superstition” was now pumping through the house.\u003c/p\u003e\n\u003cp\u003e“Meow,” Jay said, and took a chip dripping with cheese.\u003c/p\u003e\n\u003cp\u003e“I’ll see you tomorrow,” Aimee muttered.\u003c/p\u003e\n\u003cp\u003eI nodded, watching as she moved back to where her friend was still chatting up the werewolf. “Hey,” I called out. “Enjoy the rest of your evening.” And I continued to stare until it became apparent she was not going to look back.\u003c/p\u003e\n\u003cp\u003eKnocking me out of my reverie, Jay gestured at the cat with the nachos. “I take it the thought of food is the furthest thing from your mind?”\u003c/p\u003e\n\u003cp\u003e“Want a bump?” I whispered into his ear involuntarily.\u003c/p\u003e\n\u003cp\u003e“Even though you’re sounding like a parrot, there is really no other reason to be here.” He looked around the darkened living room as a man dressed as Anna Nicole Smith pushed past us to use the bathroom. “But is there someplace more private?”\u003c/p\u003e\n\u003cp\u003e“Follow me,” I said, and when I noticed him taking another nacho I snapped, “And stop flirting with the help.”\u003c/p\u003e\n\u003cp\u003eBut we were trapped. Jay and I were huddled on the periphery of the party, and I was strategizing how to get to my office without Jayne seeing us; back inside, she was introducing David Duchovny to the Allens, our neighbors and truly tiresome bores, and my plans had become increasingly urgent since I desperately needed another line—the garage, I suddenly realized, the garage—when I felt someone tugging at my guitar. I looked down: it was Sarah. “Daddy?” she said, her face a frown of concern. She was wearing a little T-shirt with the word BABE on it. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-18.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
