{"id":95914,"no":48,"title":"Page 48","content":"\u003cp\u003e“Okay,” I said. “New beginnings.”\u003c/p\u003e\n\u003cp\u003eI placed my hands on her shoulders, which caused her to smile ruefully at me.\u003c/p\u003e\n\u003cp\u003e“Hey—what’s going on today?” I asked. “Where are the kids?”\u003c/p\u003e\n\u003cp\u003e“Sarah’s upstairs doing homework and Robby’s at soccer practice and when he returns you shall be taking them to the movies at the mall,” she said in her “theatrical” voice.\u003c/p\u003e\n\u003cp\u003e“And of course you’ll be accompanying us.”\u003c/p\u003e\n\u003cp\u003e“Unfortunately, I will be with my trainer for most of the day at his small and lovely gymnasium downtown rehearsing for the reshoots. So, alas, you’re on your own.” She paused. “Think you can handle it?”\u003c/p\u003e\n\u003cp\u003e“Ah yes,” I said. “You need to learn how to be flung around the top of a skyscraper at midnight. I forgot.”\u003c/p\u003e\n\u003cp\u003eI swallowed hard. There was a slight tremor and then I accepted the reality of my Saturday. I involuntarily glanced at the side of the house Omar was pacing beneath and the paint was the color of salmon and it was touching something in me, taking me back somewhere. Jayne spoke again.\u003c/p\u003e\n\u003cp\u003e“Yeah, sure, the mall . . .” I murmured reassuringly.\u003c/p\u003e\n\u003cp\u003e“I’m going to ask you something and don’t get mad.” The smile was no longer there.\u003c/p\u003e\n\u003cp\u003e“Honey, I’m always furious so you can’t make me mad.”\u003c/p\u003e\n\u003cp\u003e“Have you had anything to drink today?”\u003c/p\u003e\n\u003cp\u003eAn intake of breath on my part. This lack of trust was a horrible realization. It was such a pure and concerned question that I could not possibly be offended by it.\u003c/p\u003e\n\u003cp\u003e“No,” I said in a small voice. “I just got up.”\u003c/p\u003e\n\u003cp\u003e“You promise?” she asked.\u003c/p\u003e\n\u003cp\u003eMy eyes started tearing. I felt awful. I hugged her. She let me and then gently broke away.\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“Because you’re driving the kids to the mall and, well . . .” The implication was strong enough that she didn’t need to finish the sentence. She saw my reaction and tried to ask in a playful way, “Can I make sure?”\u003c/p\u003e\n\u003cp\u003eI decided to be playful too. “This is a very easy test to pass.” I exhaled and then kissed her. Against me she felt soft and small.\u003c/p\u003e\n\u003cp\u003eThe smile returned as I pulled back, yet she still seemed worried (would that ever leave?) when she asked, “And nothing else?”\u003c/p\u003e\n\u003cp\u003e“Honey, look, I wouldn’t put myself behind the wheel of a car under the influence, let alone our kids, okay?”\u003c/p\u003e\n\u003cp\u003eHer face softened and for the first time this morning she smiled genuinely, without forcing it, without any affectation. It was spontaneous and unrehearsed.\u003c/p\u003e\n\u003cp\u003eThis moved me to ask, “What? What is it?”\u003c/p\u003e\n\u003cp\u003e“You said something.”\u003c/p\u003e\n\u003cp\u003e“What did I say?”\u003c/p\u003e\n\u003cp\u003e“You said ‘our.’ ”\u003c/p\u003e\n\u003cp\u003e10. the mall\u003c/p\u003e\n\u003cp\u003eI had scanned the papers to see what was playing at the Fortinbras Mall sixteen-plex and chose something that wouldn’t confuse Sarah or annoy Robby (a movie about a handsome teenage alien’s disregard for authority and his subsequent reformation), and since I suspected there was no way Robby would have agreed to this excursion unless he’d been cajoled into it by Jayne (I didn’t even want to imagine that scene—her pleading versus his furtive begging) I anticipated that he wouldn’t come without a fight, so I was surprised by how calm and placid Robby was (after a shower and a change of clothes) as he shuffled out the front door and walked with his head bowed down to the Range Rover, where Sarah sat in the front seat, trying to open a Backstreet Boys CD (which I eventually helped her with and slipped into the disc player), and where I was staring out the windshield thinking about my novel. When Robby climbed into the back seat I asked how soccer practice had gone, but he was too busy untangling the headphones to the Discman in his lap. So I asked again and all I got back from him was “It’s soccer practice, Bret. What do you mean, how did it go?” This was not the way I wanted to spend my Saturday—Teenage Pussy was waiting for me—but I owed Jayne this outing (and besides, Saturdays weren’t mine anymore). The guilt that had been building since I moved into the house in July was announcing itself more clearly and it was coming down to: I was the one responsible for Robby’s misery, yet Jayne was the one trying to cut the distance between me and him. She was the one on her knees pleading, and this reminded me again of why I was with her.\u003c/p\u003e\n\u003cp\u003e“Seat belts on?” I asked cheerfully as I pulled out of the driveway.\u003c/p\u003e\n\u003cp\u003e“Mommy doesn’t let me sit in the front seat,” Sarah said. She was wearing a Liberty-print shirt with a Peter Pan collar and cotton velvet bootcut pants and a pure angora poncho. (“Are all six-year-olds dressing like Cher?” I asked Marta when she delivered Sarah to my office. Marta just shrugged and said, “I think she looks cute.”) Sarah was holding a tiny Hello Kitty purse that was filled with Halloween candy. She took a small canister and started popping Skittles into her mouth and throwing her head back as if they were prescription pills while kicking her legs up and down to the beat of the boy band. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-48.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
