{"id":95927,"no":61,"title":"Page 61","content":"\u003cp\u003eI aimed for the right note of detachment, and snickered. “Well, she read too many magazine articles about how children raised in fatherless homes are more likely to become adolescent delinquents. And voilà. Here I am.” I sighed and had another toke. An enormous cloud was billowing across the moon. There were no stars.\u003c/p\u003e\n\u003cp\u003eA chorus of grim chuckles were followed by even more snickering. And then it was back to the children.\u003c/p\u003e\n\u003cp\u003e“So he’s taking methylphenidate”—Adam pronounced it effortlessly—“even though it really hasn’t been approved for kids under six,” and then he went on about Hanson’s and Kane’s attention-deficit/hyperactivity disorder, which naturally led the conversation to the 7.5 milligrams of Ritalin administered three times a day, and the pediatrician who discouraged having a television set in the kid’s bedroom, and Monsters, Inc.—so old school—and Mark Huntington had hired an essay writer for his son, who’d pleaded with him that he didn’t need one. And then the talk turned to the missing boys, a lunatic, a recent bombing in New Orleans, another pile of corpses, a group of tourists machine-gunned outside the Bellagio in Vegas. The marijuana—which was pretty strong—had turned our speech into thick parodies of drug talk.\u003c/p\u003e\n\u003cp\u003e“Have you ever tried the deaf-daddy routine?”\u003c/p\u003e\n\u003cp\u003eI wasn’t asked this, but I sat up, intrigued, and said, “No, what is it?”\u003c/p\u003e\n\u003cp\u003e“When he starts whining just pretend you don’t understand what he’s saying.” This was Mitchell.\u003c/p\u003e\n\u003cp\u003e“What happens?”\u003c/p\u003e\n\u003cp\u003e“He gets so annoyed he simply gives up.”\u003c/p\u003e\n\u003cp\u003e“How many hours did you spend on Google to get that info, Mitch?”\u003c/p\u003e\n\u003cp\u003e“It sounds excruciating,” Adam sighed. “Why not just give him what he wants?”\u003c/p\u003e\n\u003cp\u003e“I’ve tried that. It does not work, my friend.”\u003c/p\u003e\n\u003cp\u003e“Why not?” someone asked, even though we all knew the answer.\u003c/p\u003e\n\u003cp\u003e“Because they always want more” was Mark Huntington’s response.\u003c/p\u003e\n\u003cp\u003e“Hell,” Mitchell said with a shrug, inhaling, “they’re my kids.”\u003c/p\u003e\n\u003cp\u003e“We play hide-and-get-lost,” Adam Gardner said after a long silence. He was also sprawled on a chaise, his arms crossed, staring up at the starless sky.\u003c/p\u003e\n\u003cp\u003e“How do you play that?”\u003c/p\u003e\n\u003cp\u003e“Kane is ‘it’ and has to count to a hundred and seventy.”\u003c/p\u003e\n\u003cp\u003e“And then?”\u003c/p\u003e\n\u003cp\u003e“I drive over to the Loew’s Multiplex and catch a matinee.”\u003c/p\u003e\n\u003cp\u003e“Does he care?” Adam was asked. “I mean—that he can’t find you?”\u003c/p\u003e\n\u003cp\u003eGardner shrugged. “Probably not. Just goes and sits in front of the computer. Stares into that damn thing all day long.” Gardner pondered something. “Eventually he finds me.”\u003c/p\u003e\n\u003cp\u003e“It’s a whole different world,” Huntington murmured. “They’ve developed an entirely new set of skills that sets us way apart.”\u003c/p\u003e\n\u003cp\u003e“They know how to handle visual information.” Gardner shrugged. “Big f**king deal. I, for one, am not impressed.”\u003c/p\u003e\n\u003cp\u003e“They have no idea how to put things in context,” Huntington again murmured, spacing out as he took another hit off a fresh joint. We still had two going now and everyone was toasted.\u003c/p\u003e\n\u003cp\u003e“They’re fragment junkies.”\u003c/p\u003e\n\u003cp\u003e“But they’re more technologically advanced than us.” Mitchell said this, but I couldn’t tell from his flat and detached tone if he was arguing with Mark.\u003c/p\u003e\n\u003cp\u003e“It’s called disruptive technology.”\u003c/p\u003e\n\u003cp\u003eI could suddenly hear Victor barking from our yard.\u003c/p\u003e\n\u003cp\u003e“Mimi doesn’t want Hanson playing Doom anymore.”\u003c/p\u003e\n\u003cp\u003e“Why not?” someone asked.\u003c/p\u003e\n\u003cp\u003e“She says it’s a game the U.S. military uses to train soldiers.” A deep sigh.\u003c/p\u003e\n\u003cp\u003eThe only thing separating our property from the Allens’ was a low row of hedges, yet the houses were spaced so widely apart that any complaints about a lack of privacy were irrelevant. I could still see the children in the media room but my gaze traveled upward, and the lights in the master bedroom were now on. I double-checked, but Wendy was still sitting in the chair, holding Sarah.\u003c/p\u003e\n\u003cp\u003eAgain I thought, How . . . strange . . . but this time the thought was laced with a low-level panic.\u003c/p\u003e\n\u003cp\u003eI was sure the lights in the master bedroom hadn’t been on before. Or had I just noticed this? I couldn’t remember.\u003c/p\u003e\n\u003cp\u003eI refocused on the house, glancing first at the media room, but then a shadow behind the window in the master bedroom caught my attention.\u003c/p\u003e\n\u003cp\u003eJust as suddenly, it was gone.\u003c/p\u003e\n\u003cp\u003e“Look, I’m not exactly a strict disciplinarian,” one of the fathers intoned, “but I make sure he takes responsibility for his mistakes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-61.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
