{"id":95938,"no":72,"title":"Page 72","content":"\u003cp\u003e“Hi,” Robby said. “How was it?”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. I was now my father. Robby was now me. I saw my own features mirrored in his—my world was mirrored there: the brownish auburn hair, the high and frowning forehead, the thick lips pursed together always in thought and anticipation, the hazel eyes swirling with barely contained bewilderment. Why hadn’t I noticed him until he was lost to me? I lowered my head. It took a moment to process what he was referring to. I just shrugged and said, “It was . . . fine.” Another pause during which I realized I was still staring at the computer he was now blocking. Robby looked over his shoulder, a pointed gesture that was a reminder for me to end this interruption and leave.\u003c/p\u003e\n\u003cp\u003eI shrugged again. “Um, I just wanted to check if you guys had, y’know, brushed your teeth yet.” This inquiry was so lame, so unlike me, that I blushed at the inappropriateness of it.\u003c/p\u003e\n\u003cp\u003eRobby nodded, standing in front of the computer, and said, “Bret, I was watching something about the war tonight, and I need to know something.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” I wanted him to be genuinely interested in whatever he “needed” to know, but I knew he wasn’t. There was something off about his curiosity, something vengeful. Yet I wanted to make contact so badly that I let myself believe he wasn’t distracting me from something he didn’t want me to know. “What is it, Rob?” I tried to sound concerned but my voice was flat.\u003c/p\u003e\n\u003cp\u003e“Will I be drafted?” he asked, cocking his head, as if he sincerely wanted an answer from me.\u003c/p\u003e\n\u003cp\u003e“Um, I really don’t think so, Robby,” I said, moving in slow motion to the bed Sarah was lying on. “I’m not even sure if the draft exists anymore.”\u003c/p\u003e\n\u003cp\u003e“But they’re talking about bringing it back,” he said. “And what if the war’s still going on when I turn eighteen?”\u003c/p\u003e\n\u003cp\u003eMy mind fumbled around until it reached: “The war won’t last that long.”\u003c/p\u003e\n\u003cp\u003e“But what if it does?”\u003c/p\u003e\n\u003cp\u003eHe was now the teacher, and I was the student being manipulated, so I had to sit down on the edge of the bed in order to concentrate more fully on how this scene was playing out. This was the first time since I moved in that Robby was engaging me in a conversation of any kind, and when I tried to find a reason my stomach dropped: What if Ashton Allen had gotten in touch with him? What if Ashton had warned him about Nadine finding the alleged e-mails? My eyes were darting around the room looking for clues. I saw the two boxes half-filled with clothes marked SALVATION ARMY and swallowed hard, fighting off the small and rising panic I was becoming used to. I realized that this had been a scene so rehearsed that I could predict the last lines. I looked back at Robby and couldn’t help feeling that behind the indifference was disgust, and beyond the disgust, rage.\u003c/p\u003e\n\u003cp\u003eHe seemed to notice my suspicions when I found myself staring at the boxes, and he asked, more urgently, “But what if it does, Dad?”\u003c/p\u003e\n\u003cp\u003eMy gaze jumped back at him. The “Dad” did not sound right. He was playing a game, and my instinct was to play along, since that was the only way I was going to find any answers. I wanted to crush the phony specifics and get at some larger truth—whatever it was. I didn’t want to accept anything from him under a false pretense; I wanted him to be genuine with me. But even if he was just going through the motions, he had still initiated a conversation and I wanted to keep it moving.\u003c/p\u003e\n\u003cp\u003e“Well, you don’t want to . . . die for your country,” I said slowly, thoughtfully.\u003c/p\u003e\n\u003cp\u003eAt the word “die” Sarah stopped playing with the doll and looked over at me worriedly.\u003c/p\u003e\n\u003cp\u003e“Well, then what should I do?” he asked casually, unconcerned. “If I’m drafted into the army?”\u003c/p\u003e\n\u003cp\u003eA long pause while I formulated my answer. I tried to come up with simple, practical advice, but when I glanced back at the Salvation Army boxes I suddenly hardened and decided not to play the game anymore. I cleared my throat and, staring straight at him, I said, “I’d run away.”\u003c/p\u003e\n\u003cp\u003eAt the moment I said this whatever false light was animating Robby went out in an instant, and before I could reframe my answer he had already shut down.\u003c/p\u003e\n\u003cp\u003eHe knew I was daring him. He kept standing in front of the computer and I wanted to tell him he could step away, that the face of the missing boy was gone and he didn’t need to block what wasn’t there anymore. Helplessly, I looked at Sarah—who was whispering to the doll—and then back at Robby.\u003c/p\u003e\n\u003cp\u003e“Why is your sister in here?” I asked quietly.\u003c/p\u003e\n\u003cp\u003eRobby shrugged. He had already lapsed into his usual silence, and his eyes had become speculative and cold. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-72.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
