{"id":95942,"no":76,"title":"Page 76","content":"\u003cp\u003eThey were coming from outside the bay window of the media room.\u003c/p\u003e\n\u003cp\u003eI immediately turned the TV off and sat there, listening.\u003c/p\u003e\n\u003cp\u003eAnd then the scratching noises stopped. After a moment they resumed.\u003c/p\u003e\n\u003cp\u003eI stood up and started toward the kitchen, the ceiling lights in the living room dimming and flaring on again as I walked beneath them (trying—successfully—to ignore the green carpeting and the realigned furniture). This happened again in the hallway leading to the kitchen, which was dark until the moment I stepped inside, when the lights flickered on. When I stepped back out, the lights dimmed.\u003c/p\u003e\n\u003cp\u003eWhen I moved back into the kitchen—they flickered on.\u003c/p\u003e\n\u003cp\u003eI did this twice, with the same result—an experiment that woke me up slightly.\u003c/p\u003e\n\u003cp\u003eIt was as if my presence was activating the lights.\u003c/p\u003e\n\u003cp\u003e(Or maybe something is following you—a second thought I did not want to consider at that point.)\u003c/p\u003e\n\u003cp\u003eFrom the sliding glass door in the kitchen I stared outside. It was drizzling, but Victor was sleeping on the deck, shivering, lost in a dream, baring his teeth at some unknown enemy, and he didn’t wake up when I unlocked the sliding glass door and walked silently toward the side of the house where the scratching sounds were coming from. But I stopped suddenly when the pool lights flickered on, radiating the water a bright aqua blue, and then just as quickly dimmed, easing the water into blackness. I heard the faint hum of jets coming from the Jacuzzi, and when I looked over it was bubbling, and as if I knew they were going to be there, my eyes scanned to a railing where a pair of the same bathing trunks I had found on Halloween—the ones patterned with large red flowers, the ones from Hawaii that my father had owned—were draped. Steam was rising off them into the cool, damp air as if someone had just taken them off after a dip. I was about to retrieve them (to wring them out, to carry them with me back into the house, to touch them and make sure they were real) when the scratching noises shifted in another direction, farther away but amplified. I ignored the trunks and the wet footprints fading on the concrete surrounding the pool and moved with greater purpose toward the side of the house.\u003c/p\u003e\n\u003cp\u003eI just stared up helplessly at the great mirage of the peeling wall. The entire wall, from the ground to the roof, was now the color of pink stucco, dwarfing me. The scratching sounds weren’t coming from that wall anymore. That wall had completed itself, I realized, and the peeling was now occurring elsewhere, around front. When I moved past the corner of the house and stood on the lawn, the scratching noises stopped, but only for a moment. They resumed the second I located the patch of paint above my office window that was starting to peel off. In the glare of the street lamps I could see the house actually scarring on its own accord. Nothing was helping it. The paint was simply peeling off in a fine white shower, revealing more of the pink stucco underneath. It was doing this without any assistance. I became entranced by the flecks of paint sifting down onto the lawn and I moved closer to the house, in awe of the widening patch of salmon-hued paint that was revealing itself. There was another house beneath this one. And my memory flashed to a summer day from 1975: I was in the pool, and I was looking up at our house in Sherman Oaks while lying on a raft, and the flash got stronger as I reached my hand to the corner above my office window, stretching my arm as high as it would go, and when I touched the wall of the house on Elsinore Lane I finally made the connection, and it was so simple. Why hadn’t I realized this before?\u003c/p\u003e\n\u003cp\u003eThe paint that was revealing itself to me was the same color as the house I grew up in.\u003c/p\u003e\n\u003cp\u003eIt was the same color as the house on Valley Vista in Sherman Oaks.\u003c/p\u003e\n\u003cp\u003eThis realization left me blind for a moment, and then the belief returned.\u003c/p\u003e\n\u003cp\u003eI moved quickly back inside, where I walked to the living room.\u003c/p\u003e\n\u003cp\u003eThe lights didn’t flicker this time. They remained steady and glowing.\u003c/p\u003e\n\u003cp\u003eI now realized what had been bothering me about the furniture and the carpet: the chairs and tables and sofas and lamps were arranged just as they had been in the living room of the house on Valley Vista.\u003c/p\u003e\n\u003cp\u003eAnd the carpet was now the same forest green shag.\u003c/p\u003e\n\u003cp\u003eI also knew that footprints had embedded ash into the carpet, but it was now so dark that they were no longer visible.\u003c/p\u003e\n\u003cp\u003eI stared up at the ceiling and realized that the entire layout of the house was exactly the same.\u003c/p\u003e\n\u003cp\u003eThis was why the house had felt so sharply familiar to me.\u003c/p\u003e\n\u003cp\u003eI had lived in it before.\u003c/p\u003e\n\u003cp\u003eAnd then this was interrupted by another flash.\u003c/p\u003e\n\u003cp\u003eI walked back into the media room and turned on the plasma TV.\u003c/p\u003e\n\u003cp\u003e1941 was still on Channel 64 with the sound off.\u003c/p\u003e\n\u003cp\u003eI had seen this movie with my father in December of 1979 at the Cinerama Dome in Hollywood. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-76.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
