{"id":95948,"no":82,"title":"Page 82","content":"\u003cp\u003eYears had passed since that night. Almost a decade had passed.\u003c/p\u003e\n\u003cp\u003eBut Clayton’s face wasn’t any younger than the face I had looked into in my office at the college on Halloween, when he held out a book for me to sign.\u003c/p\u003e\n\u003cp\u003eClayton couldn’t have been older than nine or ten in 1992.\u003c/p\u003e\n\u003cp\u003eThe face reflected in the windowpane was that of an adult.\u003c/p\u003e\n\u003cp\u003eI checked the other attachments, and after viewing the next two—October 4 and October 5—I realized it was pointless. They were all the same, except that Clayton’s image became clearer in each one.\u003c/p\u003e\n\u003cp\u003eWithout realizing it I had already reached for my cell phone and was dialing Donald Kimball’s office. He didn’t pick up. I left a message.\u003c/p\u003e\n\u003cp\u003eAn hour passed.\u003c/p\u003e\n\u003cp\u003eI decided to leave the house and drive to the college and find a boy.\u003c/p\u003e\n\u003cp\u003e16. the wind\u003c/p\u003e\n\u003cp\u003e“Clayton who?” the secretary asked. “Is that the last name or the first?”\u003c/p\u003e\n\u003cp\u003eIt was almost three, and after driving aimlessly through town replaying the video in my head, I called Kimball again and left another message asking him to meet me in my office at the college, where I would be “hanging out” for the rest of the afternoon. My plan wasn’t to tell him the specifics of what I had seen—I just wanted to place Clayton in his mind, as someone to watch, the possible suspect, the fictional character, the boy who was rewriting my book. And I kept my tone even and natural, reiterating “hanging out” twice so he wouldn’t think I was losing it. Then I called Alvin Mendolsohn’s extension and was surprised when he answered. He spoke coldly to me as we uselessly defined our territory in a very brief discussion that confirmed Aimee Light had not shown up for either of her two scheduled tutorials and also had failed to notify him of her “absentia,” to which he added, “She’s a very impractical young woman,” and then I countered with, “Why—because she’s not doing her thesis on Chaucer?” to which he replied, “Don’t take yourself so seriously,” and then I said, “That’s not an answer, Mendolsohn,” before we both hung up on each other. Needing to be bolder than I felt, I summoned up the nerve to stand in the admissions office, in front of the desk of a blandly good-humored young secretary perched next to a computer, and asked her to look up a student’s name and any contact information regarding how I could reach him since, I admitted regretfully, I had to cancel an appointment. But even in my distracted state I realized, once I’d croaked the word\u003c/p\u003e\n\u003cp\u003e(if there isn’t a person, how can there be a name?)\u003c/p\u003e\n\u003cp\u003e“Clayton,” that I didn’t have anything else. He had not supplied a last name. But the campus was small, and I assumed that “Clayton” might be rare enough that he would be easy to track down regardless. The secretary thought it was odd that I didn’t know the last name of one of my students, so I blithely waved a hand around when she inquired about this lapse, the gesture explaining away my absentmindedness, my busy and special life, how unreliable the famous writer was. For some reason, we shared a wooden laugh that momentarily relaxed me. She seemed used to this—the faculty of the college apparently made up of other frantic misfits who forgot the names of their own students. I dazed out, and realized that I was nearing a period in my life when I was seeking assistance from people half my age. I watched the secretary swing toward the computer, her hands sweeping over the keypad.\u003c/p\u003e\n\u003cp\u003e“Well, I’ll enter the name and we’ll do a search.”\u003c/p\u003e\n\u003cp\u003e(“I’m a big fan, Mr. Ellis.”)\u003c/p\u003e\n\u003cp\u003eI spelled the name, correcting her (for some reason, she thought it began with a K, and who knew if it didn’t?), and she typed it in and then tapped a key and sat back.\u003c/p\u003e\n\u003cp\u003eI could tell from the expression on her face that the screen might as well have been blank.\u003c/p\u003e\n\u003cp\u003eI was about to lean over and scan the screen with her when she tapped a few more keys.\u003c/p\u003e\n\u003cp\u003eI realized things were becoming complicated when I noticed her sighing repeatedly.\u003c/p\u003e\n\u003cp\u003e(You should have never come to Midland County. You should have stayed in New York. Forever.)\u003c/p\u003e\n\u003cp\u003e“I’m not finding anything with ‘Clayton’ in it,” she said, scrunching her face up.\u003c/p\u003e\n\u003cp\u003e(“I’m a freshman here.”)\u003c/p\u003e\n\u003cp\u003e“He said he was a freshman,” I added unhelpfully. “Could you check again?”\u003c/p\u003e\n\u003cp\u003e“I mean, look, even if you had a last name, Mr. Ellis, nothing would come up in the student directory because there’s no Clayton listed anywhere.”\u003c/p\u003e\n\u003cp\u003e“This is extremely important.”\u003c/p\u003e\n\u003cp\u003e“I understand that but there’s no Clayton listed anywhere,” she repeated. \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-82.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
