{"id":95961,"no":95,"title":"Page 95","content":"\u003cp\u003eStop it, the writer interrupted. There is an empire of questions and you will never be able to answer them—there are too many, and they are all cancerous.\u003c/p\u003e\n\u003cp\u003eInstead, the writer was urging me to head up to the college. The writer wanted me to pick up the copy of “Minus Numbers”—the manuscript Clayton had left in my office. This would provide an answer, the writer assured me. But the answer would only lead ultimately to more questions and those were the questions I did not want answered.\u003c/p\u003e\n\u003cp\u003eIt was too early to get ahold of Pete, but I dialed his cell and left a message.\u003c/p\u003e\n\u003cp\u003eAt some point I simply pulled the Porsche over next to a field on a deserted stretch of the interstate.\u003c/p\u003e\n\u003cp\u003eOutside the sky was divided in half: part of it was an intense arctic blue slowly being erased by a sheet of black clouds. Trees were becoming leafless now. The field was glazed with dew.\u003c/p\u003e\n\u003cp\u003eI opened the trunk.\u003c/p\u003e\n\u003cp\u003eThe writer told me to take note of the sweater I had wrapped the doll in.\u003c/p\u003e\n\u003cp\u003eThe red Polo sweater had been torn apart during the twenty-minute drive from Elsinore Lane to the field off the interstate.\u003c/p\u003e\n\u003cp\u003eAs I lifted the Terby out of the trunk by a wing, I averted my eyes as the doll began urinating a thin stream of yellow that arced from its black body and splashed onto the highway’s pavement.\u003c/p\u003e\n\u003cp\u003eThe writer urged me to notice the crows lining the telephone wires above me as I hurled the doll into the field where it landed, immobile.\u003c/p\u003e\n\u003cp\u003eLeaves began lifting themselves off the field.\u003c/p\u003e\n\u003cp\u003eI could hear the sound of a river, or was it waves crashing against the coastline?\u003c/p\u003e\n\u003cp\u003eThe Terby was almost immediately enveloped in a cloud of flies.\u003c/p\u003e\n\u003cp\u003eIn the distance a horse was grazing—maybe a hundred feet from where I stood—and the moment the flies converged upon the doll, the horse jerked its head up and galloped even farther into the field as if offended by the presence of the thing.\u003c/p\u003e\n\u003cp\u003eKill it, the writer whispered. Kill the thing now.\u003c/p\u003e\n\u003cp\u003eYou no longer need to convince me, I told the writer.\u003c/p\u003e\n\u003cp\u003eThe writer disliked me because I was trying to follow a chart.\u003c/p\u003e\n\u003cp\u003eI was following an outline. I was calculating the weather. I was predicting events. I wanted answers. I needed clarity. I had to control the world.\u003c/p\u003e\n\u003cp\u003eThe writer yearned for chaos, mystery, death. These were his inspirations. This was the impulse he leaned toward. The writer wanted bombs exploding. The writer wanted the Olympian defeat. The writer craved myth and legend and coincidence and flames. The writer wanted Patrick Bateman back in our lives. The writer was hoping the horror of it all would galvanize me.\u003c/p\u003e\n\u003cp\u003eI was at a point where all of what the writer wanted filled me with simple remorse.\u003c/p\u003e\n\u003cp\u003e(I innocently believed in metaphor, which at this point the writer actively discouraged.)\u003c/p\u003e\n\u003cp\u003eThere were now two opposing strategies for dealing with the current situation.\u003c/p\u003e\n\u003cp\u003eBut the writer was winning, because as I ducked back into the Porsche I could smell a sea wind drifting toward me.\u003c/p\u003e\n\u003cp\u003e20. kentucky pete\u003c/p\u003e\n\u003cp\u003eI kept my gaze fixed on the horizon. The sky was turning black, and the clouds roiling in it kept changing shapes. They resembled waves, crests, the foaming surf of a thousand beaches. My eyes kept checking the rearview mirror to see if anything was following us. I did not give a shit how Sarah would react once she noticed her doll was gone. She was going to have to deal with it, rock ’n’ roll. The writer noticed we were not heading toward the college, and he brought up “Minus Numbers” again. I patiently told the writer that we were not going to the college. I told the writer we were heading back to 307 Elsinore Lane. I told the writer that we needed to get back to Robby’s room. There was information on Robby’s computer. We needed to see what that information consisted of. The information would clarify things. This was why we were heading toward the house and not the college.\u003c/p\u003e\n\u003cp\u003eWhat is in the computer is simply a warning, the writer argued.\u003c/p\u003e\n\u003cp\u003eThe answer is in that manuscript and not in those files, the writer argued.\u003c/p\u003e\n\u003cp\u003eI was drifting off, thinking of my own manuscript. I was thinking of how I knew at that point in time that I was never going to finish it. I dealt with this fact stoically.\u003c/p\u003e\n\u003cp\u003eWhen the writer started laughing at me I felt transparent.\u003c/p\u003e\n\u003cp\u003eThe writer laughed: Pull over.\u003c/p\u003e\n\u003cp\u003eThe writer laughed: Drop me off.\u003c/p\u003e\n\u003cp\u003eThe cell phone rang. I grabbed it from the dashboard. It was Pete.\u003c/p\u003e\n\u003cp\u003e“Where did you get that doll?” I asked the moment I clicked on.\u003c/p\u003e\n\u003cp\u003e“Hey, Bret Ellis,” Pete drawled, hacking up something. “It’s a little early in the day—we have ourselves an all-nighter?”\u003c/p\u003e\n\u003cp\u003e“No, no,” I said, flinching. “It’s not that. I just wanted to ask you about that doll—” \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-95.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
