{"id":95965,"no":99,"title":"Page 99","content":"\u003cp\u003e“What’s happening with the missing boys? Do you know something we should all know? Do you or your friends know anything that would help people—”\u003c/p\u003e\n\u003cp\u003e“Dad, it’s not what you think.” He rolled his eyes. “Is this what you’re all upset about?”\u003c/p\u003e\n\u003cp\u003e“What do you mean it’s not what I think, Robby?”\u003c/p\u003e\n\u003cp\u003eRobby turned to me again and, with a grin tilting his lips, he said, “It’s just a game, Dad. It’s just a stupid game.”\u003c/p\u003e\n\u003cp\u003eIt took me a long time to judge if this was the truth or the black lie returning.\u003c/p\u003e\n\u003cp\u003e“What’s a game?” I asked.\u003c/p\u003e\n\u003cp\u003e“The missing guys.” He shook his head. He seemed both relieved and slightly embarrassed. Was this an intriguing combination—one I wasn’t sure I trusted—or simply an attitude he rented?\u003c/p\u003e\n\u003cp\u003e“What do you mean—a game?”\u003c/p\u003e\n\u003cp\u003e“We kind of keep track of them.” He paused. “We have these bets.”\u003c/p\u003e\n\u003cp\u003e“What?” I asked. “You have bets on what?”\u003c/p\u003e\n\u003cp\u003eNow it was Robby’s turn to breathe in. “On who’s going to be found first.”\u003c/p\u003e\n\u003cp\u003eI said nothing.\u003c/p\u003e\n\u003cp\u003e“Sometimes we send each other e-mails pretending to be the guys and it’s really stupid, but we’re just trying to freak each other out.” He smiled to himself again. “That’s what Ashton’s mom saw . . .”\u003c/p\u003e\n\u003cp\u003eI kept staring at him.\u003c/p\u003e\n\u003cp\u003eRobby realized he had to climb onto my level.\u003c/p\u003e\n\u003cp\u003e“Dad, do you think those guys . . . are, like, dead?”\u003c/p\u003e\n\u003cp\u003eThe writer emerged and pointed out that the question had no fear in it.\u003c/p\u003e\n\u003cp\u003eThe question wanted a response from me that Robby could gauge. He was going to learn something about me from that response. He would then act on what he gleaned.\u003c/p\u003e\n\u003cp\u003eThings were slowing down.\u003c/p\u003e\n\u003cp\u003e“I don’t know what to believe, Robby. I don’t know if you’re telling me the truth.”\u003c/p\u003e\n\u003cp\u003e“Dad,” he said softly in an attempt to calm me down, “I’ll show you when I get home.”\u003c/p\u003e\n\u003cp\u003e(This, the writer told me, will never happen.\u003c/p\u003e\n\u003cp\u003eWhy not? I asked.\u003c/p\u003e\n\u003cp\u003eBecause the computer died this afternoon.\u003c/p\u003e\n\u003cp\u003eHow?\u003c/p\u003e\n\u003cp\u003eA virus was sent to infect the computer.\u003c/p\u003e\n\u003cp\u003eBut what about the files?\u003c/p\u003e\n\u003cp\u003eRobby won’t need the computer from now on.\u003c/p\u003e\n\u003cp\u003eWhat are you telling me?\u003c/p\u003e\n\u003cp\u003eYou’ll find out tonight.)\u003c/p\u003e\n\u003cp\u003eI grabbed Robby’s hand and pulled him toward me.\u003c/p\u003e\n\u003cp\u003eIt all came out in a rush. “Robby, I want you to tell me the truth. I’m here now. You can tell me whatever you want. I know that’s something maybe you don’t wanna do, but I’m here now and you have to believe me. I’ll do whatever you want. What do you want me to do? I’ll do it. Just don’t pretend anymore. Just stop lying.”\u003c/p\u003e\n\u003cp\u003eI was hoping this admission of vulnerability would make Robby feel stronger, but its nakedness actually made him so uncomfortable that he struggled away from me.\u003c/p\u003e\n\u003cp\u003e“Dad, stop it. I don’t want you to do anything—”\u003c/p\u003e\n\u003cp\u003e“Robby, if you know anything about the boys please tell me.” I grabbed his hand again.\u003c/p\u003e\n\u003cp\u003e“Dad . . .” He sighed. A new tactic was emerging.\u003c/p\u003e\n\u003cp\u003eI was so filled with hope I believed it. “Yeah?”\u003c/p\u003e\n\u003cp\u003eRobby’s lower lip started trembling, and he bit it to make it stop.\u003c/p\u003e\n\u003cp\u003e“It’s just that . . . I’m so scared sometimes and I just think maybe . . . we play this game to . . . make a joke out of what’s happening . . . because if we really thought about it . . . we’d be too scared . . . I mean maybe one of us is next . . . Maybe it’s just a way to deal with it . . .”\u003c/p\u003e\n\u003cp\u003eHe glanced at me fearfully, again gauging my reaction.\u003c/p\u003e\n\u003cp\u003eI was studying the performance, and I couldn’t tell if an actor was sitting in the passenger seat or if it was my son.\u003c/p\u003e\n\u003cp\u003eBut there was no other way to respond to his admission: I had to believe him.\u003c/p\u003e\n\u003cp\u003e“Nothing’s going to happen to you, Robby.”\u003c/p\u003e\n\u003cp\u003e“How do you know?” he asked, his voice moving up an octave.\u003c/p\u003e\n\u003cp\u003e“I just do . . .”\u003c/p\u003e\n\u003cp\u003e“But how do you really know?”\u003c/p\u003e\n\u003cp\u003e“Because I’m not gonna let anything happen to you.”\u003c/p\u003e\n\u003cp\u003e“But aren’t you scared too?” His voice cracked.\u003c/p\u003e\n\u003cp\u003eI stared at him. “I am. Everybody is scared. But if we stick together—if we all try to be there for each other—we won’t be scared anymore.”\u003c/p\u003e\n\u003cp\u003eHe didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to go anywhere, Robby.”\u003c/p\u003e\n\u003cp\u003eHe was breathing raggedly and staring at the dashboard.\u003c/p\u003e\n\u003cp\u003e“Don’t you want us to be a family?” I asked in a whisper. “Don’t you want that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/lunar-park/page-99.html","bookId":2592,"creation":"Oct 5, 2019 6:18:08 PM","modification":"Oct 5, 2019 6:18:08 PM"}
