{"id":19749,"no":8,"title":"CHAPTER VII.","content":"\u0026nbsp;Curiosities of the Gesta—Byrkes’ Epitaph—The Lay of the Little Bird—Of the Burdens of this Life—Ancient Fairs—Winchester—Modern Continental Fairs—Russia—Nischnei-Novgorod. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We confess ourselves conquered,” said Herbert, when the next evening was come; “your old monk’s learning is too recondite for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “First, then, comes ‘I have expended’: what?—my life—in judgment, in advice, in authority. ‘I have given’—equipments to my servants and warriors, charity to the needy. ‘I have kept’—exact justice. ‘I have possessed’—a generous and true heart. ‘I do possess’—a hand to bestow, to protect, to punish. ‘I have lost’—my folly, the friendship of my foes, the desires of the flesh. ‘I am punished’—for my sins.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So far, so good; but the most abstruse remains unexplained,” said Thompson; “on the front of the sarcophagus was written: ‘What I have expended, I have; what I gave away, I have.’ How do you read these sayings?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I cannot help you,” rejoined Lathom; “the story seems to be defective at this point, and we must fall back on the suggestions of the translator, of whom I have spoken before. Mr. Swan refers the words ‘What I have expended, I have’ to a judicious outlay of property, by which various benefits are reaped by the expender in the persons of his descendants; whilst 105the other words, ‘What I have given away, I have,’ he explains of the thanks of the poor and the blessings of heaven consequent on charitable gifts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your story reminds me of the old epitaph in Doncaster Church,” said Herbert, “which Gough gives in these words:\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Howe, howe, who is heare?\n\u003c/div\u003e \n\u003cdiv\u003e\n I, Robert of Doncaster, and Margaret my feare (wife),\n\u003c/div\u003e \n\u003cdiv\u003e\n That I spent, that I had;\n\u003c/div\u003e \n\u003cdiv\u003e\n That I gave, that I have;\n\u003c/div\u003e \n\u003cdiv\u003e\n That I left, that I lost:\n\u003c/div\u003e \n\u003cdiv\u003e\n A.D. 1579.\n\u003c/div\u003e \n\u003cdiv\u003e\n Quoth Robertus Byrkes,\n\u003c/div\u003e \n\u003cdiv\u003e\n Who in this worlde\n\u003c/div\u003e \n\u003cdiv\u003e\n Did reygne three\n\u003c/div\u003e \n\u003cdiv\u003e\n Score yeares and seven\n\u003c/div\u003e \n\u003cdiv\u003e\n And yet lived not one?’”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The three centre lines of his epitaph, indeed, bear a curious likeness to some of the inscriptions on the sarcophagus; perhaps the wise man who composed the epitaph may have seen your old monk’s book, or heard its moralities in many an old pulpit exhortation in his early days,” said Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Coincidences are oftentimes just as remarkable as plagiarisms,” said Herbert. “But come, Sir Tale-teller, What entertainment have you for us this evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little poetry, not of my own, but so closely resembling the old tale of the Gesta, that I prefer this poetic version, of The Lay of the Little Bird, to my own stiff prose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n THE LAY OF THE LITTLE BIRD.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In days of yore, at least a century since,\n\u003c/div\u003e \n\u003cdiv\u003e\n There liv’d a carle as wealthy as a prince:\n\u003c/div\u003e \n\u003cdiv\u003e\n His name I wot not, but his wide domain\n\u003c/div\u003e \n\u003cdiv\u003e\n Was rich with stream and forest, mead and plain;\n\u003c/div\u003e \n\u003cdiv\u003e\n 106To crown the whole, one manor he possess’d\n\u003c/div\u003e \n\u003cdiv\u003e\n In choice delight so passing all the rest,\n\u003c/div\u003e \n\u003cdiv\u003e\n No castle, burgh, or city might compare\n\u003c/div\u003e \n\u003cdiv\u003e\n With the quaint beauties of that mansion rare.\n\u003c/div\u003e \n\u003cdiv\u003e\n The sooth to say, I fear my words may seem\n\u003c/div\u003e \n\u003cdiv\u003e\n Like some strange fabling, or fantastic dream,\n\u003c/div\u003e \n\u003cdiv\u003e\n If, unadvis’d, the portraiture I trace,\n\u003c/div\u003e \n\u003cdiv\u003e\n And each brave pleasure of that peerless place.\n\u003c/div\u003e \n\u003cdiv\u003e\n Foreknow ye, then, by necromantic might\n\u003c/div\u003e \n\u003cdiv\u003e\n Was rais’d this paradise of all delight:\n\u003c/div\u003e \n\u003cdiv\u003e\n A good knight own’d it first; he, bow’d with age,\n\u003c/div\u003e \n\u003cdiv\u003e\n Died, and his son possess’d the heritage:\n\u003c/div\u003e \n\u003cdiv\u003e\n But the lewd stripling, all to riot bent\n\u003c/div\u003e \n\u003cdiv\u003e\n (His chattles quickly wasted and forespent),\n\u003c/div\u003e \n\u003cdiv\u003e\n Was driven to see this patrimony sold\n\u003c/div\u003e \n\u003cdiv\u003e\n To the base carle of whom I lately told.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ye wot right well there only need be sought\n\u003c/div\u003e \n\u003cdiv\u003e\n One spendthrift heir, to bring great wealth to nought.\n\u003c/div\u003e \n\u003cdiv\u003e\n A lofty tower and strong, the building stood\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Midst a vast plain surrounded by a flood;\n\u003c/div\u003e \n\u003cdiv\u003e\n And hence one pebble-paved channel stray’d,\n\u003c/div\u003e \n\u003cdiv\u003e\n That compass’d in a clustering orchard’s shade;\n\u003c/div\u003e \n\u003cdiv\u003e\n ’Twas a choice, charming plat; abundant round;\n\u003c/div\u003e \n\u003cdiv\u003e\n Flowers, roses, odorous spices cloth’d the ground;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unnumber’d kinds, and all profusely shower’d\n\u003c/div\u003e \n\u003cdiv\u003e\n Such aromatic balsam as they flower’d,\n\u003c/div\u003e \n\u003cdiv\u003e\n 107Their fragrance might have stay’d man’s parting breath,\n\u003c/div\u003e \n\u003cdiv\u003e\n And chased the hovering agony of death.\n\u003c/div\u003e \n\u003cdiv\u003e\n The sward one level held, and close above,\n\u003c/div\u003e \n\u003cdiv\u003e\n Tall shapely trees their leafy mantles wove,\n\u003c/div\u003e \n\u003cdiv\u003e\n All equal growth, and low their branches came,\n\u003c/div\u003e \n\u003cdiv\u003e\n Thick set with goodliest fruits of every name.\n\u003c/div\u003e \n\u003cdiv\u003e\n In midst, to cheer the ravish’d gazer’s view,\n\u003c/div\u003e \n\u003cdiv\u003e\n A gushing fount its waters upward threw,\n\u003c/div\u003e \n\u003cdiv\u003e\n Thence slowly on with crystal current pass’d,\n\u003c/div\u003e \n\u003cdiv\u003e\n And crept into the distant flood at last:\n\u003c/div\u003e \n\u003cdiv\u003e\n But nigh its source a pine’s umbrageous head\n\u003c/div\u003e \n\u003cdiv\u003e\n Stretch’d far and wide in deathless verdure spread,\n\u003c/div\u003e \n\u003cdiv\u003e\n Met with broad shade the summer’s sultry gleam,\n\u003c/div\u003e \n\u003cdiv\u003e\n And through the livelong year shut out the beam.\n\u003c/div\u003e \n\u003cdiv\u003e\n Such was the scene: yet still the place was bless’d\n\u003c/div\u003e \n\u003cdiv\u003e\n With one rare pleasure passing all the rest:\n\u003c/div\u003e \n\u003cdiv\u003e\n A wondrous bird of energies divine\n\u003c/div\u003e \n\u003cdiv\u003e\n Had fix’d his dwelling in the tufted pine;\n\u003c/div\u003e \n\u003cdiv\u003e\n There still he sat, and there with amorous lay\n\u003c/div\u003e \n\u003cdiv\u003e\n Waked the dim morn, and closed the parting day:\n\u003c/div\u003e \n\u003cdiv\u003e\n Match’d with these strains of linked sweetness wrought,\n\u003c/div\u003e \n\u003cdiv\u003e\n The violin and full-toned harp were nought;\n\u003c/div\u003e \n\u003cdiv\u003e\n 108Of power they were with new-born joy to move\n\u003c/div\u003e \n\u003cdiv\u003e\n The cheerless heart of long-desponding love;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of power so strange, that should they cease to sound,\n\u003c/div\u003e \n\u003cdiv\u003e\n And the blithe songster flee the mystic ground,\n\u003c/div\u003e \n\u003cdiv\u003e\n That goodly orchard’s scene, the pine-tree’s shade,\n\u003c/div\u003e \n\u003cdiv\u003e\n Trees, flowers, and fount, would all like vapor fade.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Listen, listen to my lay!’\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus the merry notes did chime,\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All who mighty love obey,\n\u003c/div\u003e \n\u003cdiv\u003e\n Sadly wasting in your prime,\n\u003c/div\u003e \n\u003cdiv\u003e\n Clerk and laic, grave and gay!\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet do ye, before the rest,\n\u003c/div\u003e \n\u003cdiv\u003e\n Gentle maidens, mark me tell!\n\u003c/div\u003e \n\u003cdiv\u003e\n Store my lesson in your breast,\n\u003c/div\u003e \n\u003cdiv\u003e\n Trust me it shall profit well:\n\u003c/div\u003e \n\u003cdiv\u003e\n Hear, and heed me, and be bless’d!’\n\u003c/div\u003e \n\u003cdiv\u003e\n So sang the bird of old; but when he spied\n\u003c/div\u003e \n\u003cdiv\u003e\n The carle draw near, with alter’d tone he cried—\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Back, river, to thy source! and thee, tall tower,\n\u003c/div\u003e \n\u003cdiv\u003e\n Thee, castle strong, may gaping earth devour!\n\u003c/div\u003e \n\u003cdiv\u003e\n Bend down your heads, ye gaudy flowers, and fade!\n\u003c/div\u003e \n\u003cdiv\u003e\n And wither’d be each fruit-tree’s mantling shade!\n\u003c/div\u003e \n\u003cdiv\u003e\n Beneath these beauteous branches once were seen,\n\u003c/div\u003e \n\u003cdiv\u003e\n 109Brave gentle knights disporting on the green,\n\u003c/div\u003e \n\u003cdiv\u003e\n And lovely dames; and oft, these flowers among,\n\u003c/div\u003e \n\u003cdiv\u003e\n Stray’d the blithe bands, and joyed to hear my song:\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor would they hence retire, nor quit the grove,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till many a vow were pass’d of mutual love;\n\u003c/div\u003e \n\u003cdiv\u003e\n These more would cherish, those would more deserve;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cost, courtesy, and arms, and nothing swerve.\n\u003c/div\u003e \n\u003cdiv\u003e\n O bitter change! for master now we see\n\u003c/div\u003e \n\u003cdiv\u003e\n A faitour villain carle of low degree;\n\u003c/div\u003e \n\u003cdiv\u003e\n Foul gluttony employs his livelong day,\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor heeds, nor hears he my melodious lay.’\n\u003c/div\u003e \n\u003cdiv\u003e\n So spake the bird; and, as he ceas’d to sing,\n\u003c/div\u003e \n\u003cdiv\u003e\n Indignantly he clapp’d his downy wing,\n\u003c/div\u003e \n\u003cdiv\u003e\n And straight was gone; but no abasement stirr’d\n\u003c/div\u003e \n\u003cdiv\u003e\n In the clown’s breast at his reproachful word:\n\u003c/div\u003e \n\u003cdiv\u003e\n Bent was his wit alone by quaint device\n\u003c/div\u003e \n\u003cdiv\u003e\n To snare, and sell him for a passing price.\n\u003c/div\u003e \n\u003cdiv\u003e\n So well he wrought, so craftily he spread\n\u003c/div\u003e \n\u003cdiv\u003e\n In the thick foliage green his slender thread,\n\u003c/div\u003e \n\u003cdiv\u003e\n That when at eve the little songster sought\n\u003c/div\u003e \n\u003cdiv\u003e\n His wonted spray, his little foot was caught.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How have I harm’d you?’ straight he ’gan to cry,\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And wherefore would you doom me thus to die?’\n\u003c/div\u003e \n\u003cdiv\u003e\n 110‘Nay, fear not,’ quoth the clown, ‘for death or wrong;\n\u003c/div\u003e \n\u003cdiv\u003e\n I only seek to profit by thy song:\n\u003c/div\u003e \n\u003cdiv\u003e\n I’ll get thee a fine cage, nor shalt thou lack\n\u003c/div\u003e \n\u003cdiv\u003e\n Good store of kernels and of seeds to crack;\n\u003c/div\u003e \n\u003cdiv\u003e\n But sing thou shalt; for if thou play’st the mute,\n\u003c/div\u003e \n\u003cdiv\u003e\n I’ll spit thee, bird, and pick thy bones to boot.’\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, woe is me!’ the little thrall replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Who thinks of song, in prison doomed to bide?\n\u003c/div\u003e \n\u003cdiv\u003e\n And, were I cook’d, my bulk might scarce afford\n\u003c/div\u003e \n\u003cdiv\u003e\n One scanty mouthful to my hungry lord.’\n\u003c/div\u003e \n\u003cdiv\u003e\n What may I more relate?—the captive wight\n\u003c/div\u003e \n\u003cdiv\u003e\n Assay’d to melt the villain all he might;\n\u003c/div\u003e \n\u003cdiv\u003e\n And fairly promis’d, were he once set free,\n\u003c/div\u003e \n\u003cdiv\u003e\n In gratitude to teach him secrets three;\n\u003c/div\u003e \n\u003cdiv\u003e\n Three secrets, all so marvellous and rare,\n\u003c/div\u003e \n\u003cdiv\u003e\n His race knew nought that might with these compare.\n\u003c/div\u003e \n\u003cdiv\u003e\n The carle prick’d up his ears amain; he loos’d\n\u003c/div\u003e \n\u003cdiv\u003e\n The songster thrall, by love of gain seduc’d;\n\u003c/div\u003e \n\u003cdiv\u003e\n Up to the summit of the pine-tree’s shade\n\u003c/div\u003e \n\u003cdiv\u003e\n Sped the blithe bird, and there at ease he stay’d,\n\u003c/div\u003e \n\u003cdiv\u003e\n And trick’d his plumes full leisurely, I trow,\n\u003c/div\u003e \n\u003cdiv\u003e\n Till the carle claim’d his promise from below:\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Right gladly,’ quoth the bird; ‘now grow thee wise:\n\u003c/div\u003e \n\u003cdiv\u003e\n All human prudence few brief lines comprise:\n\u003c/div\u003e \n\u003cdiv\u003e\n 111First then, lest haply in the event it fail,\n\u003c/div\u003e \n\u003cdiv\u003e\n Yield not a ready faith to every tale.’\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Is this thy secret?’ quoth the moody elf.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Keep then thy silly lesson for thyself;\n\u003c/div\u003e \n\u003cdiv\u003e\n I need it not.’—‘How be ’tis not amiss\n\u003c/div\u003e \n\u003cdiv\u003e\n To prick thy memory with advice like this,\n\u003c/div\u003e \n\u003cdiv\u003e\n But late, meseems, thou hadst forgot the lore;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark next my second rule, and sadly know,\n\u003c/div\u003e \n\u003cdiv\u003e\n What’s lost, ’tis wise with patience to forego.’\n\u003c/div\u003e \n\u003cdiv\u003e\n The carle, though rude of wit, now chafed amain;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt the mockery of the songster’s strain.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Peace,’ quoth the bird; ‘my third is far the best;\n\u003c/div\u003e \n\u003cdiv\u003e\n Store thou the precious treasure in thy breast:\n\u003c/div\u003e \n\u003cdiv\u003e\n What good thou hast, ne’er lightly from thee cast.’\n\u003c/div\u003e \n\u003cdiv\u003e\n —He spoke, and twittering fled away full fast.\n\u003c/div\u003e \n\u003cdiv\u003e\n Straight sunk in earth, the gushing fountain dries,\n\u003c/div\u003e \n\u003cdiv\u003e\n Down fall the fruits, the wither’d pine-tree dies,\n\u003c/div\u003e \n\u003cdiv\u003e\n Fades all the beauteous plat, so cool, so green,\n\u003c/div\u003e \n\u003cdiv\u003e\n Into thin air, and never more is seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Such was the meed of avarice:—bitter cost!\n\u003c/div\u003e \n\u003cdiv\u003e\n The carle who all would gather, all has lost.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is something very Eastern about this tale,” remarked Herbert at its conclusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is found in the old Greek monk’s legend of Barlaam and Josaphat,” replied Lathom, “to whom it is more 112probable that it came from the East than from any other source.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Such a story, I should suppose, has been freely used by later writers,” said Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It appears in the Disciplina Clericalis of Alphonsus, in The Golden Legend of Caxton, and in Lydgate under the title of ‘The Chorle and the Bird’; but besides these and Mr. Way, whose version I have just read you, I cannot discover any other writers who have made use of this fiction.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The moral of this fiction explains itself,” said Herbert. “I presume the author is content with the plain meaning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, for this once,” rejoined Lathom; “but be content, the next story will satisfy the greatest lover of allegories; for curious, indeed, is it as an instance, even among curiosities, of the once common practice of converting every thing into allegory.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is it entitled?” asked Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Of the Burdens of this Life’; in form it is a dialogue between a scholar and his master, who might well be supposed to change places with each other. You must be content with Mr. Swan’s version.”\n\u003c/div\u003e \n\u003cdiv\u003e\n OF THE BURDENS OF THIS LIFE.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A certain king once went to a fair, and took with him a preceptor and his scholar. Standing in the market-place they perceived eight packages for sale. The scholar questioned his teacher respecting the first of them. “Pray,” said he, “what is the price of poverty? that is, of tribulation for the love of God?”\n\u003c/div\u003e \n\u003cdiv\u003e\n 113Preceptor. The kingdom of heaven.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. It is a great price indeed. Open the second package and let us see what it contains.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It contains meekness: Blessed are the meek.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. Meekness indeed is a very illustrious thing, and worthy of divine majesty. What is its price?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. Neither gold nor silver will be taken; they are too contemptible. I demand earth for it; and nothing but earth will I receive.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. There is a spacious tract of uninhabited country between India and Great Britain. Take as much of it as you please.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. No; this land is the land of the dying; the land which devours its inhabitants. Men die there. I demand the land of the living.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. I muse at what you say. All die, and would you alone be exempt? Would you live for ever? Behold, blessed are the meek, for they shall inherit the earth. What is there in the third package?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. Hunger and thirst.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. For how much may these be purchased?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. For righteousness. Blessed are they who hunger and thirst after righteousness, for they shall be filled.\n\u003c/div\u003e \n\u003cdiv\u003e\n 114Scholar. Therefore you shall possess righteousness, provided there be no neglect. What does the fourth contain?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. Tears, wailings, and woe;\n\u003c/div\u003e \n\u003cdiv\u003e\n Moisture above, and moisture below.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. It is not customary to buy tears and wailings, yet I will buy it; because the saints desire it at this price. Blessed are they who mourn, for they shall be comforted. What is the fifth package?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It is a divided parcel, and contains mercy, which I will weigh to please you. At a word, I will take mercy for mercy; eternity for time.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. You were a bad umpire to ask this, unless mercy should plead for you. Nevertheless, she shall become your surety. And blessed are the merciful, for they shall obtain mercy. In this life we abound in poverty and wretchedness and hardship. Undo the sixth package, perhaps it may contain something better.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It is clearly full, but it loves not, like a purple robe, to be exposed before the common eye; you shall see it in private, and then we will agree about the price.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. Very well; what is next?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. Purity; which is extremely valuable. That gold and silver vase contains piety, goodness, charity, and spiritual joy. Now then 115let us open these precious garments. Here are lectures, meditations, prayers, and contemplations. The judgments of the Lord are justified in themselves, and more to be desired than gold and precious stones.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. There is a great reward in the possession. Ask, therefore, what you will.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. To see God.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. Therefore, Blessed are the pure in heart, for they shall see God. Open the seventh package.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It contains peace.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. What! are you going to sell me your peace?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It does not accord with my poverty, nor would it with your justice and great wealth, to take any thing of me for nothing. But your liberality will make me rich. What then? I am a mean country fellow, and made of clay; formed of the very dust of the earth. My want of nobility oppresses me, and I would no longer bear the reproach which says: “You are earth, and to earth you shall go.” I would rather have it said to me: “You are heaven, and to heaven you shall go.” I eagerly desire to fulfil the destiny of the sons of God; I would become a son of God.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. I have done; I confess the truth, and distrust you no longer. Blessed are the peacemakers, 116for they shall be called the sons of God. If, therefore, you preserve the love of a son, you shall receive the paternal inheritance. Now what is contained in the last package? Explain it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. It contains only tribulation and persecution for the sake of righteousness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. What do you want for it?\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. The kingdom of heaven.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. I gave you that as the price of poverty!\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceptor. True; but month after month, week after week, man wanders in his wishes. Before the present week or month expires, what will remain of it?\n\u003c/div\u003e \n\u003cdiv\u003e\n Scholar. I marvel at your sagacity in making a bargain. Now hear, good and faithful servant! because thou hast been faithful over a few things, I will appoint thee lord over many.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The allusion to the king’s visit to the fair,” said Herbert, “reminds me of what Wharton says of the royal booth at the fair of St. Botolph, at Boston, in Lincolnshire, from which stall or booth the king drew revenue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Before roads were general and passable, and the communication between town and town was frequent, the concourse of people at the various fairs must have been very great,” said Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “As great as even now in many parts of the East, where the fairs are still regarded as the great emporia of 117merchandise, the universal mart of extensive districts, dependent on such meetings for their chief supplies.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wharton,” said Herbert, “gives a curious account of St. Giles’ fair at Winchester, which dated back to the Conquest, was held for three days, and, by later grants, extended to sixteen; and was given by William the Conqueror to the bishops of Winchester as a source of revenue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doubtless no mean revenue was derived from it,” said Lathom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “For those days, very great: the jurisdiction of the fair extended for seven miles round, including the port of Southampton; and every merchant who sold wares within that circuit, except at the fair, or refused to pay the bishop’s toll, had his goods forfeited to the bishop. In the middle of St. Giles’ Down stood the bishop’s pavilion, where sat his court, supreme, so long as the fair lasted, within the seven miles’ jurisdiction.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What, over other existing jurisdictions, the lords of the neighborhood, or the corporation of Winchester?” asked Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, supreme for the time. Even the city was for the time under the bishop’s rule; on St. Giles’ eve the keys were delivered to him, and during the fair toll was exacted in his name on all goods that went through the city gate. No baron within the circuit could hold his manor-court without a license from the bishop’s pavilion. The bishop appointed a mayor, bailiff, and coroner of his own during the fair.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Being so near the coast, foreigners must have often resorted to the great Winchester fair, I presume?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” rejoined Herbert. “So numerous and powerful that they had their separate street in the fair, as the drapers, and spice-dealers, and potters had theirs; and the toll to the bishop from the foreign merchants formed no mean portion of the revenue he derived from the fair.”\n\u003c/div\u003e \n\u003cdiv\u003e\n 118“It was an old custom for merchants to meet from all countries at the different fairs,” said Lathom. “I remember to have read that in 1314, Philip of France remonstrated with our second Edward on the great loss his subjects had received from the merchants of England desisting from frequenting the fairs in France.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” remarked Frederick Thompson; “in the days of the Edwards and Henrys a fair was as great a panacea for evils, as public meetings in this century. If a village was sacked or destroyed by fire or flood, the grant of a fair was an established means of restoring it to its pristine vigor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We must look abroad for the old fairs, such as they were in the middle ages,” said Herbert. “Frankfort and Leipzig still remind us of such fairs as that at Winchester; thirty to forty thousand buyers and sellers are not uncommonly seen at Leipzig, the last great fair of Central Europe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet,” said Lathom, “both of these are but children to the great fair of Nischnei-Novgorod, where merchants from the banks of the Baltic and the Caspian interchange goods with Khivans, Chinese, the mountaineers of Central Asia, and the merchants of Western Europe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is, indeed, almost difficult to believe Kohl’s account of the meeting at Nischnei-Novgorod,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wonderful, but of admitted truth. How curious must be the scenes: a town of vast emporia, mingled with nearly three thousand shops, almost without an inhabitant, save a few government officials, until the flag is raised on the 29th of June; then the town is alive like an ant-hill. Every magazine and booth is filled with merchandise, the produce of the most diverse countries; thousands of boats are landing goods, or taking them to other vessels; piles of merchandise stand on all sides, even in the open country; and amidst all 119this treasury of wealth, three hundred thousand of nearly all nations under heaven are trafficking.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The value of goods exposed at such fairs must be startling, if capable of being calculated,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The system of fair-tolls makes this an easy matter. In 1839, the value of goods exposed at twenty-two of the fairs of Russia, reached fifteen millions and a half, of which Novgorod contributed nearly one half.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Roubles,” suggested Thompson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sterling pounds.” With this digressive conversation, the evening closed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2793/77298.html","bookId":1290,"creation":"Aug 2, 2019 11:12:00 AM","modification":"Aug 2, 2019 11:12:00 AM"}
