{"id":68655,"no":13,"title":"Page 13","content":"\u003cp\u003eThe huge mothership floated noiselessly through dark space, seemingly motionless, travelling at 22,000 miles an hour, in exact synchronization with the orbit of the earth. The six aliens aboard were studying the three-dimensional field-of-view optical screen that covered one wall of the spaceship. On the monitor, as the planet Earth rotated, they watched holographic pictures of what lay below, while an electronic spectrograph analysed the chemical components of the images that appeared. The atmosphere surrounding the land masses they passed over was heavily polluted. Huge factories befouled the air with thick, black, poisonous gases, while unbiodegradable refuse was dumped into landfills and into the seas.\u003c/p\u003e\n\u003cp\u003eThe aliens looked down at the oceans, once pristine and blue, now black with oil and brown with scum. The coral of the Great Barrier Reef was turning bleach-white and fish were dying by the billions. The Amazon rain forest was a huge, barren crater, where the trees had been stripped. The instruments on the spaceship indicated that the earth\u0027s temperature had risen since their last exploration three years earlier. They could see wars being waged on the planet below, spewing new poisons into the atmosphere.\u003c/p\u003e\n\u003cp\u003eThe aliens communicated by mental telepathy.\u003c/p\u003e\n\u003cp\u003eNothing has changed with the Earthlings.\u003c/p\u003e\n\u003cp\u003eIt is a pity. They have learned nothing.\u003c/p\u003e\n\u003cp\u003eWe will teach them.\u003c/p\u003e\n\u003cp\u003eHave you tried to reach the others?\u003c/p\u003e\n\u003cp\u003eYes. Something is wrong. There is no reply.\u003c/p\u003e\n\u003cp\u003eYou must keep trying. We must find the ship.\u003c/p\u003e\n\u003cp\u003eOn earth, thousands of feet below the spaceship\u0027s orbit, Robert placed a call from a secure phone to General Hilliard. He came on the line almost immediately.\u003c/p\u003e\n\u003cp\u003e\"Good afternoon, Commander. Do you have anything to report?\"\u003c/p\u003e\n\u003cp\u003eYes. I would like to report that you are a lying sonofabitch. \"About that weather balloon, General ... it seems to have turned out to be a UFO.\" He waited.\u003c/p\u003e\n\u003cp\u003e\"Yes, I know. There were important security reasons why I couldn\u0027t tell you everything earlier.\"\u003c/p\u003e\n\u003cp\u003eBureaucratic double-talk. There was a small silence.\u003c/p\u003e\n\u003cp\u003eGeneral Hilliard said, \"I\u0027m going to tell you something in the strictest confidence, Commander. Our government had an encounter with extraterrestrials three years ago. They landed at one of our NATO air bases. We were able to communicate with them.\"\u003c/p\u003e\n\u003cp\u003eRobert felt his heart begin to beat faster. \"What ... what did they say?\"\u003c/p\u003e\n\u003cp\u003e\"That they intend to destroy us.\"\u003c/p\u003e\n\u003cp\u003eHe felt a shock go through him. \"Destroy us?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. They said they were coming back to take over this planet and make slaves of us, and that there is nothing we can do to prevent them. Not yet. But we\u0027re working on ways to stop them. That\u0027s why it\u0027s imperative that we avoid a public panic so we can buy time. I think you can understand now why it\u0027s so important that the witnesses are warned not to discuss what they saw. If word of the idents, as we refer to them, leaked out, it would be a worldwide disaster.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think it would be better to prepare people and ...?\"\u003c/p\u003e\n\u003cp\u003e\"Commander, in 1938, a young actor named Orson Welles staged a radio broadcast called War of the Worlds, about aliens invading the earth. Within minutes, there was panic in cities all over America. An hysterical population tried to flee from the imaginary invaders. The telephone lines were jammed, the highways were clogged. People were killed. There was total chaos. No, we have to be prepared for the aliens before we go public with this. We want you to find those witnesses for their own protection, so we can keep this under control.\"\u003c/p\u003e\n\u003cp\u003eRobert found that he was perspiring. \"Yes. I ... I understand.\"\u003c/p\u003e\n\u003cp\u003e\"Good. I gather you\u0027ve talked to one of the witnesses?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve found two of them.\"\u003c/p\u003e\n\u003cp\u003e\"Their names?\"\u003c/p\u003e\n\u003cp\u003e\"Hans Beckerman - he was the driver of the tour bus. He lives in Kappel ...\"\u003c/p\u003e\n\u003cp\u003e\"And the second?\"\u003c/p\u003e\n\u003cp\u003e\"Fritz Mandel. He owns his own garage in Bern. He was the mechanic who towed the car of a third witness.\"\u003c/p\u003e\n\u003cp\u003e\"The name of that witness?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have it yet. I\u0027m working on it. Would you like me to speak with them about not discussing this UFO business with anyone?\"\u003c/p\u003e\n\u003cp\u003e\"Negative. Your assignment is simply to locate the witnesses. After that, we\u0027ll let their respective governments deal with them. Have you learned how many witnesses there are?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Seven passengers plus the driver, the mechanic and a passing motorist.\"\u003c/p\u003e\n\u003cp\u003e\"You must locate them all. Each and every one of the ten witnesses who saw the crash. Understood?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, General.\"\u003c/p\u003e\n\u003cp\u003eRobert replaced the receiver, his mind in a whirl. UFOs were real. The aliens were enemies. It was a horrifying thought.\u003c/p\u003e\n\u003cp\u003eSuddenly the uneasy feeling Robert had had earlier returned in full force. General Hilliard had given him this assignment, but they had not told him everything. What else were they holding back?\u003c/p\u003e\n\u003cp\u003eThe Avis rental car company is located at 44 Rue de Lausanne, in the heart of Geneva. Robert stormed into the office and approached a woman behind the desk.\u003c/p\u003e\n\u003cp\u003e\"May I help you?\"\u003c/p\u003e\n\u003cp\u003eRobert slammed down the piece of paper with the licence number of the Renault written on it. \"You rented this car out last week. I want the name of the person who rented it.\" His voice was angry.\u003c/p\u003e\n\u003cp\u003eThe clerk drew back. \"I\u0027m sorry, we are not permitted to give out that information.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s just too bad,\" Robert retorted, \"because in that case, I\u0027m going to have to sue your company for a great deal of money.\"\u003c/p\u003e\n\u003cp\u003e\"I do not understand. What is the problem?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you what the problem is, lady. Last Sunday, this car ran into mine on the highway and did a hell of a lot of damage. I managed to get his licence number but the man drove away before I could stop him.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" The clerk studied Robert a moment. \"Excuse me, please.\" She disappeared into a back room. In a few minutes when she returned, she was carrying a file. \"According to our records, there was a problem with the engine of the car, but there was no report of any accident.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m reporting it now. And I\u0027m holding your company responsible for this. You\u0027re going to have to pay to have my car repaired. It\u0027s a brand new Porsche, and it\u0027s going to cost you a fortune ...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m very sorry, sir, but since the accident was not reported, we cannot take any responsibility for it.\"\u003c/p\u003e\n\u003cp\u003e\"Look,\" Robert said in a more reasonable tone of voice, \"I want to be fair. I don\u0027t want to hold your company responsible. AH I want to do is have that man pay for the damage he did to my car. It was a hit and run. I may even have to bring the police into this. If you give me the man\u0027s name and address, I can talk directly to him, and we can settle it between us and leave your company out of it. Is that fair enough?\"\u003c/p\u003e\n\u003cp\u003eThe clerk stood there, making up her mind. \"Yes. We would much prefer that.\" She looked down at the file in her hand. \"The name of the person who rented the car is Leslie Mothershed.\"\u003c/p\u003e\n\u003cp\u003e\"And his address?\"\u003c/p\u003e\n\u003cp\u003e\"213A Grove Road, Whitechapel, London, East 3.\" She looked up. \"You are certain our company will not be involved in any litigation?\"\u003c/p\u003e\n\u003cp\u003e\"You have my word on it,\" Robert assured her. \"This is a private matter between Leslie Mothershed and me.\"\u003c/p\u003e\n\u003cp\u003eCommander Robert Bellamy was on the next Swissair flight to London.\u003c/p\u003e\n\u003cp\u003eHe sat in the dark alone, concentrating, meticulously going over every phase of the plan, making certain that there were no loopholes, that nothing could go wrong. His thoughts were interrupted by the soft buzz of the telephone.\u003c/p\u003e\n\u003cp\u003e\"Janus here.\"\u003c/p\u003e\n\u003cp\u003e\"Janus. General Hilliard.\"\u003c/p\u003e\n\u003cp\u003e\"Proceed.\"\u003c/p\u003e\n\u003cp\u003e\"Commander Bellamy has located the first two witnesses.\"\u003c/p\u003e\n\u003cp\u003e\"Very good. Have it attended to immediately.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Where is the Commander now?\"\u003c/p\u003e\n\u003cp\u003e\"On his way to London. He should have number three confirmed shortly.\"\u003c/p\u003e\n\u003cp\u003e\"I will alert the committee as to his progress. Continue to keep me informed. The condition of this operation must remain Nova Red.\"\u003c/p\u003e\n\u003cp\u003e\"Understood, sir. I would suggest ...\"\u003c/p\u003e\n\u003cp\u003eThe line was dead. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-13.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
