{"id":68644,"no":2,"title":"Page 2","content":"\u003cp\u003eDay One\u003c/p\u003e\n\u003cp\u003eMonday, October 15th\u003c/p\u003e\n\u003cp\u003eHe was back in the crowded hospital ward at Cu Chi Base in Vietnam, and Susan was leaning over his bed, lovely in her crisp, white nurse\u0027s uniform, whispering, \"Wake up, sailor. You don\u0027t want to die.\"\u003c/p\u003e\n\u003cp\u003eAnd when he heard the magic of her voice, he could almost forget his pain. She was murmuring something else in his ear, but a loud bell was ringing and he could not hear her clearly. He reached up to pull her closer and his hands clutched empty air.\u003c/p\u003e\n\u003cp\u003eIt was the sound of the telephone that brought Robert Bellamy fully awake. He opened his eyes reluctantly, not wanting to let go of the dream. The telephone at his bedside was insistent. He looked at the clock. Four a.m. He snatched up the telephone, angry at having his dream interrupted. \"Do you know what the hell time it is?\"\u003c/p\u003e\n\u003cp\u003e\"Commander Bellamy?\" A deep, male voice.\u003c/p\u003e\n\u003cp\u003e\"Yes ...\"\u003c/p\u003e\n\u003cp\u003e\"I have a message for you, Commander. You are ordered to report to General Hilliard at National Security Agency Headquarters at Fort Meade at 0600 this morning. Is the message understood, Commander?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" And no. Mostly no.\u003c/p\u003e\n\u003cp\u003eCommander Robert Bellamy slowly replaced the receiver, puzzled. What the devil could NSA want with him? He was assigned to ONI, Office of Naval Intelligence. And what could be urgent enough to call for a meeting at six o\u0027clock in the morning? He lay down again and closed his eyes, trying to recapture the dream. It had been so real. He knew, of course, what had triggered it. Susan had telephoned the evening before.\u003c/p\u003e\n\u003cp\u003e\"Robert ...\"\u003c/p\u003e\n\u003cp\u003eThe sound of her voice did to him what it always did. He took a shaky breath. \"Hello, Susan.\"\u003c/p\u003e\n\u003cp\u003e\"Are you all right, Robert?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Fantastic. How\u0027s Moneybags?\"\u003c/p\u003e\n\u003cp\u003e\"Please, don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"All right. How\u0027s Monte Banks?\"\u003c/p\u003e\n\u003cp\u003eHe could not bring himself to say \"your husband\". He was her husband.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine. I just wanted to tell you that we\u0027re going to be away for a little while. I didn\u0027t want you to worry.\"\u003c/p\u003e\n\u003cp\u003eThat was so like her, so Susan. He fought to keep his voice steady. \"Where are you going this time?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re flying to Brazil.\"\u003c/p\u003e\n\u003cp\u003eOn Moneybags\u0027 private 727.\u003c/p\u003e\n\u003cp\u003e\"Monte has some business interests there.\"\u003c/p\u003e\n\u003cp\u003e\"Really? I thought he owned the country.\"\u003c/p\u003e\n\u003cp\u003e\"Stop it, Robert. Please.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. \"I wish you sounded better.\"\u003c/p\u003e\n\u003cp\u003e\"If you were here, I would.\"\u003c/p\u003e\n\u003cp\u003e\"I want you to find someone wonderful and be happy.\"\u003c/p\u003e\n\u003cp\u003e\"I did find someone wonderful, Susan.\" The damned lump in his throat made it difficult for him to speak. \"And do you know what happened? I lost her.\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re going to do this, I won\u0027t call you again.\"\u003c/p\u003e\n\u003cp\u003eHe was filled with sudden panic. \"Don\u0027t say that. Please.\" She was his lifeline. He could not bear the thought of never speaking to her again. He tried to sound cheerful. \"I\u0027m going to go out and find some luscious blonde and screw us both to death.\"\u003c/p\u003e\n\u003cp\u003e\"I want you to find someone.\"\u003c/p\u003e\n\u003cp\u003e\"I promise.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m concerned about you, darling.\"\u003c/p\u003e\n\u003cp\u003e\"No need. I\u0027m really fine.\" He almost gagged on his lie. If she only knew the truth. But it was nothing he could bring himself to discuss with anyone. Especially Susan. He could not bear the thought of her pity.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll telephone you from Brazil,\" Susan said.\u003c/p\u003e\n\u003cp\u003eThere was a long silence. They could not let go of each other, because there was too much to say, too many things that were better left unsaid, that had to be left unsaid.\u003c/p\u003e\n\u003cp\u003e\"I have to go now, Robert.\"\u003c/p\u003e\n\u003cp\u003e\"Susan?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I love you, baby. I always will.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I love you too, Robert.\"\u003c/p\u003e\n\u003cp\u003eAnd that was the bittersweet irony of it. They still loved each other so much.\u003c/p\u003e\n\u003cp\u003eYou two have the perfect marriage, all their friends used to say. What had gone wrong?\u003c/p\u003e\n\u003cp\u003eCommander Robert Bellamy got out of bed, and walked through the silent living room in his bare feet. The room screamed out Susan\u0027s absence. There were dozens of photographs of Susan and himself scattered around, frozen moments in time. The two of them fishing in the Highlands of Scotland, standing in front of a Buddha near a Thai klong, riding a carriage in the rain through the Borghese gardens in Rome. And in each picture they were smiling and hugging, two people wildly in love.\u003c/p\u003e\n\u003cp\u003eHe went into the kitchen and put on a pot of coffee. The kitchen clock read 4:15. He hesitated a moment, then dialled a number. There were six rings, and finally he heard Admiral Whittaker\u0027s voice at the other end of the line. \"Hello.\"\u003c/p\u003e\n\u003cp\u003e\"Admiral ...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Robert. I\u0027m terribly sorry to wake you, sir. I just had a rather strange phone call from the National Security Agency.\"\u003c/p\u003e\n\u003cp\u003e\"NSA? What did they want?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I\u0027ve been ordered to report to General Hilliard at 0600.\"\u003c/p\u003e\n\u003cp\u003eThere was a thoughtful silence. \"Perhaps you\u0027re being transferred there.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t be. It doesn\u0027t make sense. Why would they ...?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s obviously something urgent, Robert. Why don\u0027t you give me a call after the meeting?\"\u003c/p\u003e\n\u003cp\u003e\"I will. Thank you.\"\u003c/p\u003e\n\u003cp\u003eThe connection was broken. I shouldn\u0027t have bothered the old man, Robert thought. The Admiral had retired as head of Naval Intelligence two years earlier. Forced to retire, was more like it. The rumour was that, as a sop, the Navy had given him a little office somewhere and put him to work counting barnacles on the mothball fleet, or some such shit. The Admiral would have no idea about current intelligence activities. But he was Robert\u0027s mentor. He was closer to Robert than anyone in the world, except, of course, Susan. And Robert had needed to talk to someone. With Susan gone, he felt as though he were living in a time warp. He fantasized that somewhere, in another dimension of time and space, he and Susan were still happily married, laughing and carefree and loving. Or maybe not, Robert thought, wearily. Maybe I just don\u0027t know when to let go.\u003c/p\u003e\n\u003cp\u003eThe coffee was ready. It tasted bitter. He wondered whether the beans came from Brazil.\u003c/p\u003e\n\u003cp\u003eHe carried the coffee cup into the bathroom and studied his image in the mirror. He was looking at a man in his early forties, tall and lean and physically fit, with a craggy face, a strong chin, black hair and intelligent, probing dark eyes. There was a long, deep scar on his chest, a souvenir from the plane crash. But that was yesterday. That was Susan. This was today. Without Susan. He shaved and showered and walked over to his clothes closet. What do I wear, he wondered, Navy uniform or civilian clothes? And, on the other hand, who gives a damn? He put on a charcoal-grey suit, a white shirt and a grey silk tie. He knew very little about the National Security Agency, only that the \"puzzle palace\", as it was nicknamed, superseded all other American intelligence agencies and was the most secretive of them all. What do they want with me? I\u0027ll soon find out. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-2.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
