{"id":68662,"no":20,"title":"Page 20","content":"\u003cp\u003eRobert took a taxi to Whitechapel. They drove through the City, the business section of London, heading east until they reached the Whitechapel Road, the area made infamous a century earlier by Jack the Ripper. Along the Whitechapel Road were dozens of outside stalls selling everything from clothing to fresh vegetables, to carpets.\u003c/p\u003e\n\u003cp\u003eAs the taxi neared Mothershed\u0027s address, the neighbourhood became more and more dilapidated. Graffiti was scrawled all over the peeling, brownstone buildings. They passed the Weaver\u0027s Arms pub. That would be Mothershed\u0027s local, Robert thought. Another sign read: \"Walker Bookmaker\" ... Mothershed probably places his bets on horses there.\u003c/p\u003e\n\u003cp\u003eThey finally reached 213A Grove Road. Robert dismissed the taxi and studied the building in front of him. It was an ugly two-storey building that had been converted into small flats. Inside was the man who had a complete list of the witnesses Robert had been sent to find.\u003c/p\u003e\n\u003cp\u003eLeslie Mothershed was in the living room, poring over his windfall, when the doorbell rang. He looked up, startled, filled with a sudden inexplicable fear. The ring was repeated. Mothershed scooped up his precious photographs and hurried into the converted darkroom. He slipped the pictures into a pile of old prints, then walked back into the living room and opened the front door. He stared at the stranger who stood there.\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Leslie Mothershed?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"May I come in?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. What is this about?\"\u003c/p\u003e\n\u003cp\u003eRobert pulled out a Defence Ministry identification card and flashed it. \"I\u0027m here on official business, Mr Mothershed. We can either talk here or at the Ministry.\" It was a bluff. But he could see the sudden fear on the photographer\u0027s face.\u003c/p\u003e\n\u003cp\u003eLeslie Mothershed swallowed. \"I don\u0027t know what you\u0027re talking about, but ... come in.\"\u003c/p\u003e\n\u003cp\u003eRobert entered the drab room. It was shabby-genteel, dreary, not a place where anyone would live by choice.\u003c/p\u003e\n\u003cp\u003e\"Would you kindly explain what you\u0027re doing here?\" Mothershed put the proper note of innocent exasperation in his voice.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here to question you about some photographs you took.\"\u003c/p\u003e\n\u003cp\u003eHe knew it! He had known it from the moment he heard the bell. The bastards are going to try to take my fortune away from me. Well, I\u0027m not going to let them do it. \"What photographs are you talking about?\"\u003c/p\u003e\n\u003cp\u003eRobert said patiently, \"The ones you took at the site of the UFO crash.\"\u003c/p\u003e\n\u003cp\u003eMothershed stared at Robert for a moment as though caught by surprise, and then forced a laugh. \"Oh, those! I wish I had them to give to you.\"\u003c/p\u003e\n\u003cp\u003e\"You did take those pictures?\"\u003c/p\u003e\n\u003cp\u003e\"I tried.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean ... you tried?\"\u003c/p\u003e\n\u003cp\u003e\"The bloody things never came out.\" Mothershed gave a nervous cough. \"My camera fogged. That\u0027s the second time that\u0027s happened to me.\" He was babbling now. \"I even threw out the negatives. They were no good. It was a complete waste of film. And you know how expensive film is these days.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027s a bad liar, Robert thought. He\u0027s on the edge of panic. Robert said sympathetically, \"Too bad. Those photographs would have been very helpful.\" He said nothing about the list of passengers. If Mothershed lied about the photographs, he would lie about the list. Robert glanced around. The photographs and the list had to be hidden here somewhere. They shouldn\u0027t be difficult to find. The flat consisted of the small living room, a bedroom, a bathroom and what looked like a door to a utility closet. There was no way he could force the man to hand over the material. He had no real authority. But he wanted those photographs and the list of witnesses before the SIS came and took them away. He needed that list for himself.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Mothershed sighed. \"Those pictures would have been worth a fortune.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me about the spaceship,\" Robert said.\u003c/p\u003e\n\u003cp\u003eMothershed gave an involuntary shudder. The eerie scene was fixed in his mind forever. \"I\u0027ll never forget it,\" he said. \"The ship seemed to ... to pulsate, like it was alive. There was something evil about it. And then there were these two dead aliens inside.\"\u003c/p\u003e\n\u003cp\u003e\"Can you tell me anything about the passengers on the bus?\"\u003c/p\u003e\n\u003cp\u003eSure I can, Mothershed gloated to himself. I have all their names and addresses. \"No, I\u0027m afraid I can\u0027t.\" Mothershed went on, talking to conceal his nervousness. \"The reason I can\u0027t help you about the passengers is that I wasn\u0027t on that bus. They were all strangers.\"\u003c/p\u003e\n\u003cp\u003e\"I see. Well, thank you for your cooperation, Mr Mothershed. I appreciate it. Sorry about your pictures.\"\u003c/p\u003e\n\u003cp\u003e\"So am I,\" Mothershed said. He watched the door close behind the stranger and thought, happily, I\u0027ve done it! I\u0027ve outsmarted the sonsofbitches.\u003c/p\u003e\n\u003cp\u003eOutside in the hall, Robert was examining the lock on the door. A Chubb. And an old model. It would take him seconds to open it. He would start surveillance in the middle of the night and wait for the photographer to leave the flat in the morning. Once I have the list of passengers in my possession, the rest of the assignment will be simple.\u003c/p\u003e\n\u003cp\u003eRobert checked into a small hotel near Mothershed\u0027s flat, and telephoned General Hilliard.\u003c/p\u003e\n\u003cp\u003e\"I have the name of the English witness, General.\"\u003c/p\u003e\n\u003cp\u003e\"Just a moment. All right. Go ahead, Commander.\"\u003c/p\u003e\n\u003cp\u003e\"Leslie Mothershed. He lives in Whitechapel. 213A Grove Road.\"\u003c/p\u003e\n\u003cp\u003e\"Excellent. I\u0027ll arrange for the British authorities to speak to him.\"\u003c/p\u003e\n\u003cp\u003eRobert did not mention the passenger list or the photographs.\u003c/p\u003e\n\u003cp\u003eThose were his aces in the hole.\u003c/p\u003e\n\u003cp\u003eReggie\u0027s Fish and Chip Shop was located in a little cul de sac off the Brompton Road. It was a small establishment with a clientele made up mainly of clerks and secretaries who worked in the neighbourhood. Its walls were covered with football posters and the parts that were exposed had not seen fresh paint since the Suez conflict.\u003c/p\u003e\n\u003cp\u003eThe phone behind the counter rang twice before it was answered by a large man dressed in a greasy wool sweater. The man looked like a typical East Ender except for a gold-rimmed monocle fixed tightly in his left eye. The reason for the monocle was apparent to anyone who looked closely at the man - his other eye was made of glass and of a colour blue that was generally seen on travel posters.\u003c/p\u003e\n\u003cp\u003e\"Reggie here.\"\u003c/p\u003e\n\u003cp\u003e\"This is the Bishop.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir,\" said Reggie, his voice dropping to a whisper.\u003c/p\u003e\n\u003cp\u003e\"Our client\u0027s name is Mothershed. Christian tag Leslie. Resides at 213A Grove Road, E3. We need this order filled quickly. Understood?\"\u003c/p\u003e\n\u003cp\u003e\"Consider it done, sir.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-20.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
