{"id":68669,"no":27,"title":"Page 27","content":"\u003cp\u003eFrank Johnson was recruited because he had been a Green Beret in Vietnam and was known among his comrades as \"the killing machine\". He loved to kill. He was motivated, and highly intelligent.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s perfect for us,\" Janus said. \"Approach him carefully. I don\u0027t want to lose him.\"\u003c/p\u003e\n\u003cp\u003eThe first meeting took place in an Army barracks. A Captain was talking to Frank Johnson.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you worry about our government?\" the Captain asked. \"It\u0027s being run by a bunch of bleeding hearts who are giving the store away. This country needs nuclear power, but the damned politicians are stopping us from building new plants. We depend on the damn Arabs for oil, but will the government let us do our own off-shore drilling? Oh, no. They\u0027re more worried about the fish than they are about us. Does that make sense to you?\"\u003c/p\u003e\n\u003cp\u003e\"I see your point,\" Frank Johnson said.\u003c/p\u003e\n\u003cp\u003e\"I knew you would, because you\u0027re intelligent.\" He was watching Johnson\u0027s face as he spoke. \"If Congress won\u0027t do anything to save our country, then it\u0027s up to some of us to do something.\"\u003c/p\u003e\n\u003cp\u003eFrank Johnson looked puzzled. \"Some of us?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Enough for now, the Captain thought. \"We\u0027ll talk about it later.\"\u003c/p\u003e\n\u003cp\u003eThe next conversation was more specific. \"There\u0027s a group of patriots, Frank, who are interested in protecting our world. They\u0027re pretty high-powered gentlemen. They\u0027ve formed a committee. The committee may have to bend a few laws to get its work done, but in the end, it will be worth it. Are you interested?\"\u003c/p\u003e\n\u003cp\u003eFrank Johnson grinned. \"I\u0027m very interested.\"\u003c/p\u003e\n\u003cp\u003eThat was the beginning. The next meeting took place in Ottawa, Canada, and Frank Johnson met some of the members of the committee. They represented powerful interests from a dozen countries.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re well organized,\" a member explained to Frank Johnson. \"We have a strict chain of command. There\u0027s a Propaganda Division, Recruiting, Tactics, Liaison ... and a Death Squad.\" He went on: \"Almost every intelligence organization in the world is part of this.\"\u003c/p\u003e\n\u003cp\u003e\"You mean the heads of ...?\"\u003c/p\u003e\n\u003cp\u003e\"No, not the heads. The deputies. The hands-on people who know what\u0027s going on, who know what danger our countries are in.\"\u003c/p\u003e\n\u003cp\u003eThe meetings took place all over the world - Switzerland, Morocco, China - and Johnson attended all of them.\u003c/p\u003e\n\u003cp\u003eIt was six months before Colonel Johnson met Janus. Janus had sent for him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been given excellent reports about you, Colonel.\"\u003c/p\u003e\n\u003cp\u003eFrank Johnson grinned. \"I enjoy my work.\"\u003c/p\u003e\n\u003cp\u003e\"So I\u0027ve heard. You\u0027re in an advantageous position to help us.\"\u003c/p\u003e\n\u003cp\u003eFrank Johnson sat up straighter. \"I\u0027ll do anything I can.\"\u003c/p\u003e\n\u003cp\u003e\"Good. At the Farm, you\u0027re in charge of supervising the training of secret agents in the various services.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"And you get to know them and their capabilities.\"\u003c/p\u003e\n\u003cp\u003e\"Intimately.\"\u003c/p\u003e\n\u003cp\u003e\"What I would like you to do,\" Janus said, \"is to recruit those who you feel would be most helpful to our organization. We\u0027re interested only in the best.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s easy,\" Colonel Johnson said. \"No problem.\" He hesitated a moment. \"I wonder ...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I can do that with my left hand. I\u0027d really like to do something more, something bigger.\" He leaned forward. \"I\u0027ve heard about Operation Doomsday. Doomsday is right up my alley. I\u0027d like to be a part of that, sir.\"\u003c/p\u003e\n\u003cp\u003eJanus sat there, studying him a moment. Then he nodded. \"Very well, you\u0027re in.\"\u003c/p\u003e\n\u003cp\u003eJohnson smiled. \"Thank you. You won\u0027t be sorry.\" Colonel Frank Johnson left the meeting a very happy man. Now he would have a chance to show them what he could do. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-27.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
