{"id":68645,"no":3,"title":"Page 3","content":"\u003cp\u003eThe National Security Agency is hidden discreetly away on eighty-two rambling acres at Fort Meade, Maryland, in two buildings that together are twice the size of the CIA complex in Langley, Virginia. The Agency, created to give technical support to protect United States communications and acquire worldwide intelligence data, employs thousands of people, and so much information is generated by its operations that it shreds more than forty tons of documents every day.\u003c/p\u003e\n\u003cp\u003eIt was still dark when Commander Robert Bellamy arrived at the first gate. He drove up to an eight-foot-high cyclone fence with a topping of barbed wire. There was a sentry booth there, manned by two armed guards. One of them stayed in the booth, watching, as the other approached the car. \"Can I help you?\"\u003c/p\u003e\n\u003cp\u003e\"Commander Bellamy to see General Hilliard.\"\u003c/p\u003e\n\u003cp\u003e\"May I see your identification, Commander?\"\u003c/p\u003e\n\u003cp\u003eRobert Bellamy pulled out his wallet and removed his 17th District Naval Intelligence ID card. The guard studied it carefully and returned it. \"Thank you, Commander.\"\u003c/p\u003e\n\u003cp\u003eHe nodded to the guard in the booth and the gate swung open. The guard inside picked up a telephone. \"Commander Bellamy is on his way.\"\u003c/p\u003e\n\u003cp\u003eA minute later Robert Bellamy drove up to a closed, electrified gate.\u003c/p\u003e\n\u003cp\u003eAn armed guard approached the car. \"Commander Bellamy?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"May I see your identification, please?\"\u003c/p\u003e\n\u003cp\u003eHe started to protest and then he thought, What the hell? It\u0027s their zoo. He took out his wallet again and showed his identification to the guard.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Commander.\" The guard gave some invisible sign and the gate opened.\u003c/p\u003e\n\u003cp\u003eAs Robert Bellamy drove ahead, he saw a third cyclone fence ahead of him. My God, he thought, I\u0027m in the Land of Oz.\u003c/p\u003e\n\u003cp\u003eAnother uniformed guard walked up to the car. As Robert Bellamy reached for his wallet the guard looked at the licence plate and said, \"Please drive straight ahead to the administration building, Commander. There will be someone there to meet you.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eThe gate swung open and Robert followed the driveway up to an enormous white building. A man in civilian clothes was standing outside, waiting, shivering in the chill October air. \"You can leave your car right there, Commander,\" he called out. \"We\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003eRobert Bellamy left the keys in his car and stepped out. The man greeting him appeared to be in his thirties, tall, thin and sallow. He looked as though he had not seen the sun in years.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Harrison Keller. I\u0027ll escort you to General Hilliard\u0027s office.\"\u003c/p\u003e\n\u003cp\u003eThey walked into a large high-ceilinged entrance hall. A man in civilian clothes was seated behind a desk. \"Commander Bellamy ...\"\u003c/p\u003e\n\u003cp\u003eRobert Bellamy swung around. He heard the click of a camera.\u003c/p\u003e\n\u003cp\u003e\"Thank you, sir.\"\u003c/p\u003e\n\u003cp\u003eRobert Bellamy turned to Keller. \"What ...?\"\u003c/p\u003e\n\u003cp\u003e\"This will take only a minute,\" Harrison Keller assured him.\u003c/p\u003e\n\u003cp\u003eSixty seconds later, Robert Bellamy was handed a blue and white identification badge with his photograph on it.\u003c/p\u003e\n\u003cp\u003e\"Please wear this at all times while you\u0027re in the building, Commander.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eThey started walking down a long, white corridor. Robert Bellamy noticed security cameras mounted at twenty-foot intervals on both sides of the hall.\u003c/p\u003e\n\u003cp\u003e\"How big is this building?\"\u003c/p\u003e\n\u003cp\u003e\"Just over two million square feet, Commander.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. This corridor is the longest corridor in the world, nine hundred and eighty feet. We\u0027re completely self-contained here. We have a shopping centre, cafeteria, post exchange, eight snack bars, a hospital complete with operating room, a dentist\u0027s office, a branch of the State Bank of Laurel, a dry-cleaning shop, a shoe shop, a barber shop, and a few other odds and ends.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s a home away from home, Robert thought. He found it oddly depressing.\u003c/p\u003e\n\u003cp\u003eThey passed an enormous open area filled with a vast sea of computers. Robert stopped in amazement.\u003c/p\u003e\n\u003cp\u003e\"Impressive, isn\u0027t it? That\u0027s just one of our computer rooms. The complex contains three billion dollars\u0027 worth of decoding machines and computers.\"\u003c/p\u003e\n\u003cp\u003e\"How many people work in this place?\"\u003c/p\u003e\n\u003cp\u003e\"About sixteen thousand.\"\u003c/p\u003e\n\u003cp\u003eSo what the hell do they need me for? Robert Bellamy wondered.\u003c/p\u003e\n\u003cp\u003eHe was led into a private elevator that Keller operated with a key. They went up one floor and started on another trek down a long corridor until they reached a suite of offices at the end of the hall.\u003c/p\u003e\n\u003cp\u003e\"Right in here, Commander.\" They entered a large reception office with four secretaries\u0027 desks. Two of the secretaries had already arrived for work. Harrison Keller nodded to one of them. She pressed a button and a door to the inner office clicked open.\u003c/p\u003e\n\u003cp\u003e\"Go right in, please, gentlemen. The General is expecting you.\"\u003c/p\u003e\n\u003cp\u003eHarrison Keller said, \"This way.\"\u003c/p\u003e\n\u003cp\u003eRobert Bellamy followed him into the inner sanctum. He found himself in a spacious office, the ceilings and walls heavily soundproofed. The room was comfortably furnished, filled with photographs and personal artifacts. It was obvious that the man behind the desk spent a lot of time there.\u003c/p\u003e\n\u003cp\u003eGeneral Mark Hilliard, Deputy Director of NSA, appeared to be in his middle fifties, very tall, with a face carved in flint, icy, steely eyes, and a ramrod-straight posture. The General was dressed in a grey suit, white shirt and grey tie. I guessed right, Robert thought.\u003c/p\u003e\n\u003cp\u003eHarrison Keller said, \"General Hilliard, this is Commander Bellamy.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for dropping by, Commander.\"\u003c/p\u003e\n\u003cp\u003eAs though it had been an invitation to some tea party.\u003c/p\u003e\n\u003cp\u003eThe two men shook hands.\u003c/p\u003e\n\u003cp\u003e\"Sit down. I\u0027ll bet you could do with a cup of coffee.\"\u003c/p\u003e\n\u003cp\u003eThe man was a mind-reader. \"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Harrison?\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you.\" He took a chair in the corner.\u003c/p\u003e\n\u003cp\u003eA buzzer was pressed, the door opened and an oriental in a mess jacket entered with a tray of coffee and Danish pastry. Robert noted that he was not wearing an identification badge. Shame. The coffee was poured. It smelled wonderful.\u003c/p\u003e\n\u003cp\u003e\"How do you take yours?\" General Milliard asked.\u003c/p\u003e\n\u003cp\u003e\"Black, please.\" The coffee tasted great.\u003c/p\u003e\n\u003cp\u003eThe two men were seated in soft leather chairs facing each other.\u003c/p\u003e\n\u003cp\u003e\"The Director asked that I meet with you.\"\u003c/p\u003e\n\u003cp\u003eThe Director. Edward Sanderson. A legend in espionage circles. A brilliant, ruthless puppet-master, credited with masterminding dozens of daring coups all over the world. A man seldom seen in public and whispered about in private.\u003c/p\u003e\n\u003cp\u003e\"How long have you been with the 17th District Naval Intelligence Group, Commander?\" General Milliard asked.\u003c/p\u003e\n\u003cp\u003eRobert played it straight. \"Fifteen years.\" He would have bet a month\u0027s pay that the General could have told him the time of day when he had joined ONI.\u003c/p\u003e\n\u003cp\u003e\"Before that, I believe you commanded a naval air squadron in Vietnam.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"You were shot down. They didn\u0027t expect you to pull through.\"\u003c/p\u003e\n\u003cp\u003eThe doctor was saying, \"Forget about him. He won\u0027t make it.\" He had wanted to die. The pain was unbearable. And then Susan was leaning over him. Open your eyes, sailor, you don\u0027t want to die. He had forced his eyes open and through the haze of pain was staring at the most beautiful woman he had ever seen. She had a soft oval face and thick black hair, sparkling brown eyes and a smile like a blessing. He had tried to speak, but it was too much of an effort.\u003c/p\u003e\n\u003cp\u003eGeneral Hilliard was saying something.\u003c/p\u003e\n\u003cp\u003eRobert Bellamy brought his mind back to the present. \"I beg your pardon, General?\"\u003c/p\u003e\n\u003cp\u003e\"We have a problem, Commander. We need your help.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir?\"\u003c/p\u003e\n\u003cp\u003eThe General stood up and began to pace. \"What I\u0027m about to tell you is extremely sensitive. It\u0027s above Top Secret.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Yesterday, in the Swiss Alps, a NATO weather balloon crashed. There were some experimental military objects aboard the balloon that are highly secret.\"\u003c/p\u003e\n\u003cp\u003eRobert found himself wondering where all this was leading.\u003c/p\u003e\n\u003cp\u003e\"The Swiss government has removed those objects from the balloon, but, unfortunately, it seems that there were some witnesses to the crash. It is of vital importance that none of them talk to anyone about what they saw. It could provide valuable information to certain other countries. Do you follow me?\"\u003c/p\u003e\n\u003cp\u003e\"I think so, sir. You want me to speak to the witnesses and warn them not to discuss what they saw.\"\u003c/p\u003e\n\u003cp\u003e\"Not exactly, Commander.\"\u003c/p\u003e\n\u003cp\u003eThen I don\u0027t under\u003c/p\u003e\n\u003cp\u003e\"What I want you to do is simply track down those witnesses. Others will talk to them about the necessity for silence.\"\u003c/p\u003e\n\u003cp\u003e\"I see. Are the witnesses all in Switzerland?\"\u003c/p\u003e\n\u003cp\u003eGeneral Milliard stopped in front of Robert. \"That\u0027s our problem, Commander. You see, we have no idea where they are. Or who they are.\"\u003c/p\u003e\n\u003cp\u003eRobert thought he had missed something. \"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003e\"The only information we have is that the witnesses were on a tour bus. They happened to be passing the scene when the weather balloon crashed near a little village called ...\" He turned to Harrison Keller.\u003c/p\u003e\n\u003cp\u003e\"Uetendorf.\"\u003c/p\u003e\n\u003cp\u003eThe General turned back to Robert. \"The passengers got off the bus for a few minutes to look at the crash and then continued on. When the tour ended, the passengers dispersed.\"\u003c/p\u003e\n\u003cp\u003eRobert said slowly, \"General Hilliard, are you saying that there is no record of who these people are or where they went?\"\u003c/p\u003e\n\u003cp\u003e\"That is correct.\"\u003c/p\u003e\n\u003cp\u003e\"And you want me to go over and find them?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. You\u0027ve been very highly recommended. I\u0027m told that you speak half a dozen languages fluently and you have an excellent field record. The Director arranged to have you temporarily transferred to NSA.\"\u003c/p\u003e\n\u003cp\u003eTerrific. \"I assume I\u0027ll be working with the Swiss government on this?\"\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027ll be working alone.\"\u003c/p\u003e\n\u003cp\u003e\"Alone? But ...\"\u003c/p\u003e\n\u003cp\u003e\"We must not involve anyone else in this mission. I can\u0027t stress enough the importance of what was in that balloon, Commander. Time is of the essence. I want you to report your progress to me every day.\"\u003c/p\u003e\n\u003cp\u003eThe General wrote a number on a card and handed it to Robert. \"I can be reached through this number day or night. There\u0027s a plane waiting to fly you to Zurich. You\u0027ll be escorted to your apartment, so you can pack what you need, and then you\u0027ll be taken to the airport.\"\u003c/p\u003e\n\u003cp\u003eSo much for \"Thank you for dropping by\". Robert was tempted to say, \"Will someone feed my goldfish while I\u0027m gone?\" but he had a feeling the answer would be, \"You have no goldfish.\"\u003c/p\u003e\n\u003cp\u003e\"In your work with ONI, Commander, I assume you\u0027ve acquired intelligence contacts abroad?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. I have quite a few friends who could be use ...\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not to get in touch with any of them. You are not authorized to make any contacts at all. The witnesses you\u0027re looking for are undoubtedly nationals of various countries.\" The General turned to Keller. \"Harrison ...\"\u003c/p\u003e\n\u003cp\u003eKeller walked over to a filing cabinet in the corner and unlocked it. He removed a large manila envelope and passed it to Robert.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s fifty thousand dollars in here in different European currencies, and another twenty thousand in US dollars. You will also find several sets of false identifications that may come in handy.\"\u003c/p\u003e\n\u003cp\u003eGeneral Hilliard held out a thick, shiny black plastic card with a white stripe on it. \"Here\u0027s a credit card that ...\"\u003c/p\u003e\n\u003cp\u003e\"I doubt if I\u0027ll need that, General. The cash will be enough, and I have an ONI credit card.\"\u003c/p\u003e\n\u003cp\u003e\"Take it.\"\u003c/p\u003e\n\u003cp\u003e\"Very well.\" Robert examined the card. It was drawn on a bank he had never heard of. At the bottom of the card was a telephone number. \"There\u0027s no name on the card,\" Robert said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the equivalent of a blank cheque. It requires no identification. Just have them call the telephone number on the card. It\u0027s very important that you keep it with you at all times.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"And Commander?\"\u003c/p\u003e\n\u003cp\u003e\"Sir?\"\u003c/p\u003e\n\u003cp\u003e\"You must find those witnesses. Every one of them. I\u0027ll inform the Director that you have started the assignment.\"\u003c/p\u003e\n\u003cp\u003eThe meeting was over.\u003c/p\u003e\n\u003cp\u003eHarrison Keller walked Robert to the outer office. A uniformed marine was seated there. He rose as the two men came in.\u003c/p\u003e\n\u003cp\u003e\"This is Captain Dougherty. He\u0027ll take you to the airport. Good luck.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eThe two men shook hands. Keller turned and walked back into General Hilliard\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Are you ready, Commander?\" Captain Dougherty asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" But ready for what? He had handled difficult intelligence assignments in the past, but never anything as crazy as this. He was expected to track down an unknown number of unknown witnesses from unknown countries. What are the odds against that? Robert wondered. I feel like the White Queen in Through the Looking-glass. \"Why sometimes I\u0027ve believed as many as six impossible things before breakfast.\" Well, this was all six of them.\u003c/p\u003e\n\u003cp\u003e\"I have orders to take you directly to your apartment and then to Andrews Air Force Base,\" Captain Dougherty said. \"There\u0027s a plane waiting to ...\"\u003c/p\u003e\n\u003cp\u003eRobert shook his head. \"I have to make a stop at my office first.\"\u003c/p\u003e\n\u003cp\u003eDougherty hesitated. \"Very well. I\u0027ll go there with you and wait for you.\"\u003c/p\u003e\n\u003cp\u003eIt was as though they didn\u0027t trust him out of their sight. Because he knew that a weather balloon had crashed? It made no sense. He surrendered his badge at the reception desk, and walked outside, into the chill breaking dawn. His car was gone. In its place was a stretch limousine.\u003c/p\u003e\n\u003cp\u003e\"Your car will be taken care of, Commander,\" Captain Dougherty informed him. \"We\u0027ll ride in this.\"\u003c/p\u003e\n\u003cp\u003eThere was a high-handedness about all this that Robert found vaguely disturbing.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he said.\u003c/p\u003e\n\u003cp\u003eAnd they were on their way to the offices of Naval Intelligence. The pale morning sun was disappearing behind rain clouds. It was going to be a miserable day. In more ways than one, Robert thought. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-3.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
