{"id":68674,"no":32,"title":"Page 32","content":"\u003cp\u003eKiev, The Soviet Union\u003c/p\u003e\n\u003cp\u003eLike most of her countrywomen, Olga Romanchanko had become disenchanted with perestroika. In the beginning, all the promised changes that were going to happen in Mother Russia sounded so exciting. The winds of freedom were blowing through the streets, and the air was filled with hope. There were promises of fresh meat and vegetables in the shops, pretty dresses and real leather shoes and a hundred other wonderful things. But now, six years after it had all begun, bitter disillusion had set in. Goods were scarcer than ever. It was impossible to survive without the black market. There was a shortage of virtually everything, and prices had soared. The main streets were still filled with rytvina - huge potholes. There were protest marches in the streets, and crime was on the increase. Restrictions were more severe than ever. Perestroika and glasnost had begun to seem as empty as the promises of the politicians who promoted them.\u003c/p\u003e\n\u003cp\u003eOlga had worked at the library in Lenkomsomol Square, in the centre of Kiev, for seven years. She was thirty-two years old, and had never been outside the Soviet Union. Olga was reasonably attractive, a bit overweight, but in Russia that was not considered a disadvantage. She had been engaged twice to men who had moved away and deserted her; Dmitri, who had left for Leningrad, and Ivan, who had moved to Moscow. Olga had tried to move to Moscow to be with Ivan, but without a propiska, a Moscow residence permit, it was not possible.\u003c/p\u003e\n\u003cp\u003eAs her thirty-third birthday approached, Olga was determined that she was going to see something of the world before the Iron Curtain closed around her once again. She went to the head librarian, who happened to be her aunt.\u003c/p\u003e\n\u003cp\u003e\"I would like to take my vacation, now,\" Olga said.\u003c/p\u003e\n\u003cp\u003e\"When do you want to leave?\"\u003c/p\u003e\n\u003cp\u003e\"Next week.\"\u003c/p\u003e\n\u003cp\u003e\"Enjoy yourself.\"\u003c/p\u003e\n\u003cp\u003eIt was as simple as that. In the days before perestroika, taking a vacation would have meant going to the Black Sea or Samarkand or Tbilisi, or any one of a dozen other places inside the Soviet Union. But now, if she were quick about it, the whole world was open to her. Olga took an atlas from the library shelf and pored over it. There was such a big world out there! There was Africa and Asia, and North and South America ... she was afraid to venture that far. Olga turned to the map of Europe. Switzerland, she thought. That\u0027s where I\u0027ll go.\u003c/p\u003e\n\u003cp\u003eShe would never have admitted it to anyone in the world, but the main reason Switzerland appealed to her was because she had once tasted Swiss chocolate, and she had never forgotten it. She loved sweets. The candy in Russia - when one could get it - was sugarless and tasted terrible.\u003c/p\u003e\n\u003cp\u003eHer taste for chocolate was to cost Olga her life.\u003c/p\u003e\n\u003cp\u003eThe journey on Aeroflot to Zurich was an exciting beginning. She had never flown before. She landed at the international airport in Zurich, filled with anticipation. There was something in the air that was different. Maybe it is the smell of real freedom, Olga thought. Her finances were strictly limited, and she had made reservations at a small, inexpensive hotel, the Leonhare, at Limmatquai 136.\u003c/p\u003e\n\u003cp\u003eOlga checked in at the reception desk. \"This is my first time in Switzerland,\" she confided to the clerk, in halting English. \"Could you suggest some things for me to do?\"\u003c/p\u003e\n\u003cp\u003e\"Certainly. There is much to do here,\" he told her. \"Perhaps you should start with a tour of the city - I will arrange it.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eOlga found Zurich extraordinary. She was awed by the sights and sounds of the city. The people on the street were dressed in such fine clothes, and drove such expensive automobiles. It seemed to Olga that everyone in Zurich must be a millionaire. And the stores! She window-shopped along Bahnhofstrasse, the main shopping street of Zurich, and she marvelled at the incredible cornucopia of goods in the windows: there were dresses and coats and shoes and lingerie and jewellery and dishes and furniture and automobiles and books and television sets and radios and toys and pianos. There seemed to be no end to the goods for sale. And then Olga stumbled across Spriingli\u0027s, famous for their confections and chocolates. And what chocolates! Four large store-front windows were filled with a dazzling array of them. There were huge boxes of mixed chocolates, chocolate bunnies, chocolate loaves, chocolate-covered nuts. There were chocolate-covered bananas and chocolate beans filled with liqueurs. It was a feast just to look at the display in the windows. Olga wanted to buy everything, but when she learned the prices, she settled for a small box of assorted chocolates and a large candy bar.\u003c/p\u003e\n\u003cp\u003eOver the next week, Olga visited the Zurichhorn Park and the Rietberg Museum and the Gross Miinster, the church erected in the eleventh century, and a dozen other wonderful tourist attractions. Finally, her time was running out.\u003c/p\u003e\n\u003cp\u003eThe hotel clerk at the Leonhare said to her, \"The Sunshine Tours Bus Company has a fine tour of the Alps. I think you might enjoy that before you leave.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" Olga said. \"I will try it.\"\u003c/p\u003e\n\u003cp\u003eWhen Olga left the hotel, her first stop was to visit Spriingli\u0027s again, and the next stop was at the office of the Sunshine Tours Bus Company, where she arranged to go on a tour. It had proved to be most exciting. The scenery was breathtaking, and in the middle of the tour they had seen the explosion of what she thought was a flying saucer, but the Canadian banker she was seated next to explained that it was merely a spectacle arranged by the Swiss government for tourists, that there were no such things as flying saucers. Olga was not completely convinced. When she returned home to Kiev she discussed it with her aunt.\u003c/p\u003e\n\u003cp\u003e\"Of course there are flying saucers,\" her aunt said. \"They fly over Russia all the time. You should sell your story to a newspaper.\"\u003c/p\u003e\n\u003cp\u003eOlga had considered doing it, but she was afraid that she would be laughed at. The Party did not like its members to get publicity, especially the kind that might subject them to ridicule. All in all, Olga decided that, Dmitri and Ivan aside, her vacation had been the highlight of her life. It was going to be difficult to settle down to work again.\u003c/p\u003e\n\u003cp\u003eThe ride from the airport into the centre of Kiev took the Intourist bus one hour, driving along the newly built highway. It was Robert\u0027s first time in Kiev, and he was impressed by the ubiquitous construction along the highway, and the large apartment buildings that seemed to be springing up everywhere. The bus pulled up in front of the Dnieper Hotel and disgorged its two dozen passengers. Robert looked at his watch. Eight p.m. The library would be closed. His business would have to wait until morning. He checked into the huge hotel, where a reservation had been made for him, had a drink at the bar and went into the austere whitewashed dining room for a dinner of caviar, cucumbers and tomatoes, followed by a potato casserole flavoured with tiny bits of meat and covered with heavy dough, all accompanied by vodka and mineral water.\u003c/p\u003e\n\u003cp\u003eHis visa had been waiting for him at the hotel in Stockholm, as General Hilliard had promised. That was a quick bit of international cooperation, Robert thought. But no cooperation for me. \"Naked\" is the operational word.\u003c/p\u003e\n\u003cp\u003eAfter dinner, Robert made a few inquiries at the desk, and meandered over to Lenkomsomol Square. Kiev was a surprise to him. One of the oldest cities in Russia, it was an attractive, European-looking city, situated on the Dnieper River, with green parks and tree-lined streets. Churches were everywhere and they were spectacular examples of religious architecture: there were the Churches of St Vladimir\u0027s and St Andrew\u0027s and St Sophia\u0027s, the last completed in 1037, pure white with its soaring blue bell tower, and the Pechersk Monastery, the tallest structure in the city. Susan would have loved all this, Robert thought. She had never been to Russia. He wondered if she had returned from Brazil yet. On an impulse, when he returned to his hotel room, he telephoned her, and to his surprise the call was put through almost immediately.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" That throaty, sexy voice.\u003c/p\u003e\n\u003cp\u003e\"Hi. How was Brazil?\"\u003c/p\u003e\n\u003cp\u003e\"Robert! I tried to telephone you several times. There was no answer.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not home.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" She had been trained too well to ask where he was. \"Are you feeling well?\"\u003c/p\u003e\n\u003cp\u003eFor a eunuch, I\u0027m in wonderful shape. \"Sure. Great. How\u0027s Money ... Monte?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine. Robert, we\u0027re leaving for Gibraltar tomorrow.\" On Moneybags\u0027 fucking yacht, of course. What was the name of it? Ah, yes. The Halcyon. \"The yacht?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You can call me on it. Do you remember the call letters?\"\u003c/p\u003e\n\u003cp\u003eHe remembered. WS337. What did the WS stand for? Wonderful Susan ... Why separate ... Wife stealer?\u003c/p\u003e\n\u003cp\u003e\"Robert?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I remember. Whiskey Sugar 337.\"\u003c/p\u003e\n\u003cp\u003e\"Will you call? Just to let me know you\u0027re all right.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. I miss you, baby.\"\u003c/p\u003e\n\u003cp\u003eA long, painful silence. He waited. What did he expect her to say? Come rescue me from this charming man who looks like Paul Newman and forces me to go on his 250-foot yacht and live in our squalid little palaces in Monte Carlo, and Morocco, and Paris, and London, and God alone knew where else. Like an idiot, he found himself half hoping she would say it.\u003c/p\u003e\n\u003cp\u003e\"I miss you, too, Robert. Take care of yourself.\" And the connection was broken. He was in Russia, alone.\u003c/p\u003e\n\u003cp\u003eDay Twelve\u003c/p\u003e\n\u003cp\u003eEarly the following morning, ten minutes after the library opened, Robert walked into the huge, gloomy building and approached the reception desk.\u003c/p\u003e\n\u003cp\u003e\"Good morning,\" Robert said.\u003c/p\u003e\n\u003cp\u003eThe woman behind the desk looked up. \"Good morning. Can I help you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027m looking for a woman who I believe works here, Olga ...\"\u003c/p\u003e\n\u003cp\u003e\"Olga? Yes, yes.\" She pointed to another room. \"She will be in there.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eIt had been as easy as that. Robert walked into the other room, past groups of students solemnly studying at long tables, preparing for what kind of future? Robert wondered. He reached a smaller reading room and walked inside. A woman was busily stacking books.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" Robert said.\u003c/p\u003e\n\u003cp\u003eShe turned. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Olga?\"\u003c/p\u003e\n\u003cp\u003e\"I am Olga. What do you wish with me?\"\u003c/p\u003e\n\u003cp\u003eRobert smiled disarmingly. \"I\u0027m writing a newspaper article on perestroika and how it affects the average Russian. Has it made much difference in your life?\"\u003c/p\u003e\n\u003cp\u003eThe woman shrugged. \"Before Gorbachev, we were afraid to open our mouths. Now we can open our mouths, but we have nothing to put in them.\"\u003c/p\u003e\n\u003cp\u003eRobert tried another tactic. \"Surely, there are some changes for the better. For instance, you are able to travel now.\"\u003c/p\u003e\n\u003cp\u003e\"You must be joking. With a husband and six children, who can afford to travel?\"\u003c/p\u003e\n\u003cp\u003eRobert ploughed on. \"Still, you went to Switzerland, and ...\"\u003c/p\u003e\n\u003cp\u003e\"Switzerland? I have never been to Switzerland in my life.\"\u003c/p\u003e\n\u003cp\u003eRobert said slowly, \"You\u0027ve never been to Switzerland?\"\u003c/p\u003e\n\u003cp\u003e\"I just told you.\" She nodded toward a dark-haired woman who was collecting books from the table. \"She\u0027s the lucky one who got to go to Switzerland.\"\u003c/p\u003e\n\u003cp\u003eRobert took a quick look. \"What\u0027s her name?\"\u003c/p\u003e\n\u003cp\u003e\"Olga. The same as mine.\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eA minute later, Robert was in conversation with the second Olga.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" Robert said. \"I\u0027m writing a newspaper article on perestroika and the effect that it\u0027s had on Russian lives.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him warily. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Olga. Olga Romanchanko.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me, Olga, has perestroika made any difference to you?\"\u003c/p\u003e\n\u003cp\u003eSix years earlier, Olga Romanchanko would have been afraid to speak to a foreigner, but now it was allowed. \"Not really,\" she said carefully. \"Everything is much the same.\"\u003c/p\u003e\n\u003cp\u003eThe stranger was persistent. \"Nothing at all has changed in your life?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"No.\" And then added patriotically, \"Of course we can travel outside the country now.\"\u003c/p\u003e\n\u003cp\u003eHe seemed interested. \"And have you travelled outside the country?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" she said proudly. \"I have just returned from Switzerland. Is a very beautiful country.\"\u003c/p\u003e\n\u003cp\u003e\"I agree,\" he said. \"Did you get a chance to meet anyone on the trip?\"\u003c/p\u003e\n\u003cp\u003e\"I met many people. I took a bus and we went through high mountains. The Alps.\" Suddenly Olga realized she shouldn\u0027t have said that because the stranger might ask her about the spaceship, and she did not want to talk about that. It could only get her into trouble.\u003c/p\u003e\n\u003cp\u003e\"Really?\" asked Robert. \"Tell me about the people on the bus.\"\u003c/p\u003e\n\u003cp\u003eRelieved, Olga responded. \"Very friendly. They were dressed so ...\" She gestured. \"Very rich. I even met man from your capital city, Washington, DC.\"\u003c/p\u003e\n\u003cp\u003e\"You did?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Very nice. He gave me card.\"\u003c/p\u003e\n\u003cp\u003eRobert\u0027s heart skipped a beat. \"Do you still have it?\"\u003c/p\u003e\n\u003cp\u003e\"No. I threw it away.\" She looked around. \"Is better not keep things like that.\"\u003c/p\u003e\n\u003cp\u003eDamn!\u003c/p\u003e\n\u003cp\u003eAnd then she added, \"I remember his name. Parker, like your American pen. Kevin Parker. Very important in politics. He tells senators how vote.\"\u003c/p\u003e\n\u003cp\u003eRobert was taken aback. \"Is that what he told you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He takes them on trips and gives gifts, and then they vote for things his clients need. That is the way democracy works in America.\"\u003c/p\u003e\n\u003cp\u003eA lobbyist. Robert let Olga talk for the next fifteen minutes, but he got no further useful information about the other passengers.\u003c/p\u003e\n\u003cp\u003eRobert telephoned General Milliard from his hotel room.\u003c/p\u003e\n\u003cp\u003e\"I found the Russian witness. Her name is Olga Romanchanko. She works in the main library in Kiev.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have a Russian official speak to her.\"\u003c/p\u003e\n\u003cp\u003eFLASH MESSAGE\u003c/p\u003e\n\u003cp\u003eTOP SECRET ULTRA\u003c/p\u003e\n\u003cp\u003eNSA TO DEPUTY DIRECTOR GRU\u003c/p\u003e\n\u003cp\u003eEYES ONLY\u003c/p\u003e\n\u003cp\u003eCOPY ONE OF (ONE) COPIES\u003c/p\u003e\n\u003cp\u003eSUBJECT: OPERATION DOOMSDAY\u003c/p\u003e\n\u003cp\u003e8. OLGA ROMANCHANKO - KIEV\u003c/p\u003e\n\u003cp\u003eEND OF MESSAGE\u003c/p\u003e\n\u003cp\u003eThat afternoon Robert was on an Aeroflot Tupolev Tu - 154 jet to Paris. When he arrived three hours and twenty-five minutes later, he transferred to an Air France flight to Washington, DC.\u003c/p\u003e\n\u003cp\u003eAt two a.m. Olga Romanchanko heard the squeal of brakes as a car pulled up in front of the apartment building where she lived, on Vertryk Street. The walls of the apartment were so thin that she could hear voices outside on the street. She got out of bed and looked out of the window. Two men in civilian clothes were getting out of a black Chaika, the model used by government officials. They were approaching the entrance to her apartment building. The sight of them sent a shiver through her. Over the years, some of her neighbours had disappeared, never to be seen again. Some of them had been sent to the Gulag in Siberia. Olga wondered who the secret police were after this time, and even as she was thinking it, there was a knock on her door, startling her. What do they want with me? she wondered. It must be some mistake.\u003c/p\u003e\n\u003cp\u003eWhen she opened the door, the two men were standing there.\u003c/p\u003e\n\u003cp\u003e\"Comrade Olga Romanchanko?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Glavnoye Razvedyvatelnoye Upravleniye.\"\u003c/p\u003e\n\u003cp\u003eThe dreaded GRU.\u003c/p\u003e\n\u003cp\u003eThey pushed their way past her into the room.\u003c/p\u003e\n\u003cp\u003e\"What ... what is it you want?\"\u003c/p\u003e\n\u003cp\u003e\"We will ask the questions. I am Sergeant Yuri Gromkov. This is Sergeant Vladimir Zemsky.\"\u003c/p\u003e\n\u003cp\u003eShe felt a sudden sense of terror. \"What\u0027s ... what\u0027s wrong? What have I done?\"\u003c/p\u003e\n\u003cp\u003eZemsky pounced on it. \"Oh, so you know you have done something wrong!\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not,\" Olga said, flustered. \"I do not know why you are here.\"\u003c/p\u003e\n\u003cp\u003e\"Sit down,\" Gromkov shouted. Olga sat.\u003c/p\u003e\n\u003cp\u003e\"You have just returned from a trip to Switzerland, nyet?\"\u003c/p\u003e\n\u003cp\u003e\"Y ... yes,\" she stuttered, \"but it ... it was ... I got permission from ...\"\u003c/p\u003e\n\u003cp\u003e\"Espionage is not legal, Olga Romanchanko.\"\u003c/p\u003e\n\u003cp\u003e\"Espionage?\" She was horrified. \"I don\u0027t know what you are talking about.\"\u003c/p\u003e\n\u003cp\u003eThe larger man was staring at her body, and Olga suddenly realized she was wearing only a thin nightgown.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go. You are coming with us.\"\u003c/p\u003e\n\u003cp\u003e\"But there is some terrible mistake. I\u0027m a librarian. Ask anybody here who ...\"\u003c/p\u003e\n\u003cp\u003eHe pulled her to her feet. \"Come.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you taking me?\"\u003c/p\u003e\n\u003cp\u003e\"To headquarters. They want to question you.\"\u003c/p\u003e\n\u003cp\u003eThey allowed her to put on a coat over her nightgown. She was shoved down the stairs and into the Chaika. Olga thought of all the people who had ridden in cars like this before and had never returned, and she was numb with fear.\u003c/p\u003e\n\u003cp\u003eThe larger man, Gromkov, was driving. Olga was seated in the back with Zemsky. He somehow seemed less frightening to her, but she was petrified by who they were and what was going to happen to her.\u003c/p\u003e\n\u003cp\u003e\"Please believe me,\" Olga said earnestly. \"I would never betray my ...\"\u003c/p\u003e\n\u003cp\u003e\"Shut up,\" Gromkov barked.\u003c/p\u003e\n\u003cp\u003eVladimir Zemsky said, \"Look, there\u0027s no reason to be rough with her. As a matter of fact, I believe her.\"\u003c/p\u003e\n\u003cp\u003eOlga felt her heart leap with hope.\u003c/p\u003e\n\u003cp\u003e\"Times have changed,\" Comrade Zemsky went on. \"Comrade Gorbachev doesn\u0027t like us to go around bothering innocent people. Those days are past.\"\u003c/p\u003e\n\u003cp\u003e\"Who said she\u0027s innocent?\" Gromkov growled. \"Maybe she is, maybe she isn\u0027t. They\u0027ll find out soon enough at headquarters.\"\u003c/p\u003e\n\u003cp\u003eOlga sat there listening to the two men discussing her as though she were not there.\u003c/p\u003e\n\u003cp\u003eZemsky said, \"Come now, Yuri, you know that at headquarters she will confess, whether she\u0027s guilty or not. I don\u0027t like this.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s too bad. There\u0027s nothing we can do about it.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, there is.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eThe man next to Olga was silent for a moment. \"Listen,\" he said. \"Why don\u0027t we just let her go? We could tell them she was not at home. We\u0027ll put them off for a day or two, and they will forget all about her because they have so many people to question.\"\u003c/p\u003e\n\u003cp\u003eOlga tried to say something, but her throat was too dry. She desperately wanted the man beside her to win the argument.\u003c/p\u003e\n\u003cp\u003eGromkov grumbled. \"Why should we risk our necks for her? What do we get out of it? What is she going to do for us?\"\u003c/p\u003e\n\u003cp\u003eZemsky turned to look at Olga questioningly. Olga found her voice. \"I have no money,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Who needs your money? We have plenty of money.\"\u003c/p\u003e\n\u003cp\u003eGromkov said, \"She has something else.\"\u003c/p\u003e\n\u003cp\u003eBefore Olga could reply, Zemsky said, \"Wait a minute, Yuri Ivanovich, you can\u0027t expect her to do that.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s up to her. She can either be nice to us or go down to headquarters and get beaten up for a week or two. Maybe they\u0027ll keep her in a nice shizo.\"\u003c/p\u003e\n\u003cp\u003eOlga had heard about shizos. Unheated four-by-eight-foot cells with wooden plank beds and no blankets. Be nice to us. What did that mean?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s up to her.\"\u003c/p\u003e\n\u003cp\u003eZemsky turned to Olga, \"What do you want to do?\"\u003c/p\u003e\n\u003cp\u003e\"I ... I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"What my partner is saying is that if you\u0027re nice to us we could just drop this whole thing. In a little while they\u0027ll probably forget about you.\"\u003c/p\u003e\n\u003cp\u003e\"What ... what would I have to do?\"\u003c/p\u003e\n\u003cp\u003eGromkov grinned at her in the rear-view mirror. \"Just give us a few minutes of your time.\" He remembered something he had once read, Just lie there and think of the Czar. He giggled.\u003c/p\u003e\n\u003cp\u003eOlga suddenly understood what they were getting at. She shook her head. \"No, I could not do that.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" Gromkov started speeding up. \"They\u0027ll have a good time with you at headquarters.\"\u003c/p\u003e\n\u003cp\u003e\"Wait!\" She was in a panic, not knowing what to do. She had heard horror stories of what had happened to people who had been arrested and become zeks. She had thought that that was all finished, but now she could see that it was not. Perestroika was still just a fantasy. They would not allow her to have an attorney, or talk to anyone. In the past, friends of hers had been raped and murdered by the GRU. She was trapped. If she went to jail they could keep her for weeks, beating her and raping her, maybe worse. With these two men, at least it would be over in a few minutes and then they would let her go. Olga made her decision.\u003c/p\u003e\n\u003cp\u003e\"All right,\" she said miserably. \"Do you wish to go back to my apartment?\"\u003c/p\u003e\n\u003cp\u003eGromkov said, \"I know a better place.\" He turned the car around.\u003c/p\u003e\n\u003cp\u003eZemsky whispered, \"I\u0027m sorry about this, but he\u0027s in charge. I can\u0027t stop him.\"\u003c/p\u003e\n\u003cp\u003eOlga said nothing.\u003c/p\u003e\n\u003cp\u003eThey drove past the bright red Shevchenko Opera House, and headed for a large park bordered by trees. It was completely deserted at this hour. Gromkov drove the car under the trees and turned off the lights and engine.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get out,\" he said.\u003c/p\u003e\n\u003cp\u003eThe three of them got out of the car.\u003c/p\u003e\n\u003cp\u003eGromkov looked at Olga. \"You\u0027re lucky. We\u0027re letting you off easy. I hope you appreciate it.\"\u003c/p\u003e\n\u003cp\u003eOlga nodded, too frightened to speak.\u003c/p\u003e\n\u003cp\u003eGromkov led them to a small cleared area. \"Get undressed.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s cold,\" Olga said, \"couldn\u0027t we ...?\"\u003c/p\u003e\n\u003cp\u003eGromkov slapped her hard across the face. \"Do as you\u0027re told before I change my mind.\"\u003c/p\u003e\n\u003cp\u003eOlga hesitated an instant, and as his arm drew back to hit her again, she started unbuttoning her coat.\u003c/p\u003e\n\u003cp\u003e\"Take it off.\"\u003c/p\u003e\n\u003cp\u003eShe let it drop to the ground.\u003c/p\u003e\n\u003cp\u003e\"Now the nightgown.\"\u003c/p\u003e\n\u003cp\u003eSlowly, Olga lifted the nightgown over her head and pulled it off, shivering in the cold night air, standing naked in the moonlight.\u003c/p\u003e\n\u003cp\u003e\"Nice body,\" Gromkov said. He squeezed her nipples.\u003c/p\u003e\n\u003cp\u003e\"Please ...\"\u003c/p\u003e\n\u003cp\u003e\"You make one sound, and we take you to headquarters.\" He pushed her to the ground.\u003c/p\u003e\n\u003cp\u003eI won\u0027t think about this. I\u0027ll pretend I\u0027m in Switzerland on the bus tour, looking at all the beautiful scenery.\u003c/p\u003e\n\u003cp\u003eGromkov had dropped his pants and was spreading Olga\u0027s legs apart.\u003c/p\u003e\n\u003cp\u003eI can see the Alps covered with snow. There is a sleigh going by with a young boy and girl in it.\u003c/p\u003e\n\u003cp\u003eShe felt him place his hands under her hips, and he shoved his maleness into her, hurting her.\u003c/p\u003e\n\u003cp\u003eThere are beautiful cars along the highway. More cars than I have ever seen in my life. In Switzerland everybody has a car.\u003c/p\u003e\n\u003cp\u003eHe was plunging into her harder now, pinching her, making wild, animal noises.\u003c/p\u003e\n\u003cp\u003eI will have a little home in the mountains. What do the Swiss call them? Chalets. And I will have chocolates every day. Boxes of them.\u003c/p\u003e\n\u003cp\u003eGromkov was withdrawing now, breathing heavily. He stood up and turned to Zemsky. \"Your turn.\"\u003c/p\u003e\n\u003cp\u003eI will get married and have children, and we will all go skiing in the Alps in winter.\u003c/p\u003e\n\u003cp\u003eZemsky had zipped open his pants and was climbing on top of her.\u003c/p\u003e\n\u003cp\u003eIt will be such a wonderful life. I will never return to Russia. Never. Never. Never.\u003c/p\u003e\n\u003cp\u003eHe was inside her now, hurting her more than the other man had, squeezing her buttocks, and pushing her body into the cold ground until the pain was almost unbearable.\u003c/p\u003e\n\u003cp\u003eWe will live on a farm, where it\u0027s quiet and peaceful all the time, and we will have a garden with beautiful flowers.\u003c/p\u003e\n\u003cp\u003eZemsky finished with her and looked up at his companion. \"I bet she enjoyed it,\" he grinned.\u003c/p\u003e\n\u003cp\u003eHe reached down for Olga\u0027s neck and broke it.\u003c/p\u003e\n\u003cp\u003eThe following day there was an item in the local paper about a librarian who had been raped and strangled in the park. There was a stern warning from the authorities that it was dangerous for young women to go to the park alone at night. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-32.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
