{"id":68675,"no":33,"title":"Page 33","content":"\u003cp\u003eWillard Stone and Monte Banks were natural enemies. They were both ruthless predators, and the jungle they prowled was the stone canyons of Wall Street, with its high-powered takeovers, leveraged buy-outs and stock deals.\u003c/p\u003e\n\u003cp\u003eThe first time the two men clashed was during the attempted takeover of a huge utility company. Willard Stone made the first bid, and anticipated no problem. He was so powerful, and his reputation so fearsome, that very few people dared challenge him. It was a great surprise then when he learned that a young upstart named Monte Banks was contesting his bid. Stone was forced to raise his own bid, and the ante kept going up. Willard Stone finally acquired control of the company, but at a much higher price than he had anticipated paying.\u003c/p\u003e\n\u003cp\u003eSix months later, in a takeover bid for a large electronics firm, Stone was confronted again by Monte Banks. The bidding kept escalating, and this time, Banks won.\u003c/p\u003e\n\u003cp\u003eWhen Willard Stone learned that Monte Banks intended to compete with him for control of a computer company, he decided it was time to meet with his competitor. The two men met on neutral ground in Paradise Island, in the Bahamas. Willard Stone had had a thorough investigation made of his competitor and had learned that Monte Banks came from a wealthy oil family, and had brilliantly managed to parlay his inheritance into an international conglomerate.\u003c/p\u003e\n\u003cp\u003eThe two men sat down to lunch. Willard Stone, old and wise, Monte Banks, young and eager.\u003c/p\u003e\n\u003cp\u003eWillard Stone opened the conversation. \"You\u0027re becoming a pain in the ass.\"\u003c/p\u003e\n\u003cp\u003eMonte Banks grinned. \"Coming from you, that\u0027s a big compliment.\"\u003c/p\u003e\n\u003cp\u003e\"What is it you want?\" Stone asked.\u003c/p\u003e\n\u003cp\u003e\"The same as you. I want to own the world.\"\u003c/p\u003e\n\u003cp\u003eWillard Stone said thoughtfully, \"Well, it\u0027s a big enough world.\"\u003c/p\u003e\n\u003cp\u003e\"Meaning?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s room enough for both of us.\"\u003c/p\u003e\n\u003cp\u003eThat was the day they became partners. Each ran his own business separately but when it came to new projects - timber and oil and real estate - they went into deals together, instead of competing with each other. Several times the Anti-Trust Division of the Justice Department tried to stop their deals, but Willard Stone\u0027s connections always prevailed. Monte Banks owned chemical companies responsible for massive pollution of lakes and rivers, but when he was indicted, the indictment was mysteriously dropped.\u003c/p\u003e\n\u003cp\u003eThe two men had a perfect symbiotic relationship.\u003c/p\u003e\n\u003cp\u003eOperation Doomsday was a natural for them, and they were heavily involved in it. They were on the verge of closing a deal to purchase ten million acres of lush, tree-rich land in the Amazon. It was going to be one of the most profitable deals they had ever gone into.\u003c/p\u003e\n\u003cp\u003eThey could not afford to let anything stand in their way. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-33.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
