{"id":68683,"no":41,"title":"Page 41","content":"\u003cp\u003eShe wandered down the broad boulevard, barely conscious of where she was going. How many days had it been since the terrible crash? She had lost count. She was so tired that it was difficult for her to concentrate. She desperately needed water; not the polluted water that the Earthlings drank, but fresh, clear rain water. She needed the pure fluid to revive her life essence, to gain the strength to find the crystal. She was dying.\u003c/p\u003e\n\u003cp\u003eShe staggered and bumped into a man.\u003c/p\u003e\n\u003cp\u003e\"Hey! Watch where ...\" The American salesman took a closer look at her and smiled. \"Hi, there. Imagine bumping into you like this!\" What a doll.\u003c/p\u003e\n\u003cp\u003e\"Yes, I can imagine that.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you from, honey?\"\u003c/p\u003e\n\u003cp\u003e\"The seventh sun of the Pleiades.\"\u003c/p\u003e\n\u003cp\u003eHe laughed. \"I like a gal with a sense of humour. Where you headed?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I do not know. I am a stranger here.\"\u003c/p\u003e\n\u003cp\u003eJesus, I think I\u0027m on to something. \"Have you had dinner?\"\u003c/p\u003e\n\u003cp\u003e\"No. I cannot eat your food.\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve got a real weirdo here. But a beauty. \"Where are you staying?\"\u003c/p\u003e\n\u003cp\u003e\"I am not staying anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have a hotel?\"\u003c/p\u003e\n\u003cp\u003e\"A hotel?\" She remembered. Boxes for travelling strangers. \"No. I must find a place to sleep. I am very tired.\"\u003c/p\u003e\n\u003cp\u003eHis smile broadened. \"Well, Papa can take care of that. Why don\u0027t we go up to my hotel room? I\u0027ve got a nice, big comfortable bed there. Would you like that?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, very much.\"\u003c/p\u003e\n\u003cp\u003eHe could not believe his good luck. \"Wonderful!\" I\u0027ll bet she\u0027s great in the hay.\u003c/p\u003e\n\u003cp\u003eShe looked at him, puzzled. \"Your bed is made of hay?\"\u003c/p\u003e\n\u003cp\u003eHe was staring at her. \"What? No, no. You like your little jokes, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eShe could barely keep her eyes open. \"Could we go to bed now?\"\u003c/p\u003e\n\u003cp\u003eHe rubbed his hands together. \"You bet! My hotel is just around the corner.\"\u003c/p\u003e\n\u003cp\u003eHe picked up his key at the desk and they took the elevator to his floor. When they got to his room, the man asked, \"Would you like a little drink?\" Let\u0027s loosen you up.\u003c/p\u003e\n\u003cp\u003eShe wanted one desperately, but not the liquids the Earthlings had to offer. \"No,\" she said. \"Where is the bed?\"\u003c/p\u003e\n\u003cp\u003eMy God, she\u0027s a hot little thing. \"In here, honey.\" He led her into the bedroom. \"You\u0027re sure you wouldn\u0027t like a drink?\"\u003c/p\u003e\n\u003cp\u003e\"I am sure.\"\u003c/p\u003e\n\u003cp\u003eHe licked his lips. \"Then why don\u0027t you - er - get undressed?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. It was an Earthling custom. She removed the dress she was wearing. She was wearing nothing underneath. Her body was exquisite.\u003c/p\u003e\n\u003cp\u003eThe man stared at her and said, happily, \"This is my lucky night, honey. Yours, too.\" I\u0027m going to fuck you like you\u0027ve never been fucked before. He tore off his clothes as fast as he could and jumped into bed beside her. \"Now!\" he said. \"I\u0027m going to show you some real action.\" He glanced up. \"Damn! I left the light on.\" He started to get up.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" she said sleepily. \"I will turn it off.\"\u003c/p\u003e\n\u003cp\u003eAnd as he watched, her arm reached out, out, across the wide room, and her fingers became leafy green tendrils as they brushed against the light switch.\u003c/p\u003e\n\u003cp\u003eHe was alone in the dark with her. He screamed. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-41.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
