{"id":68685,"no":43,"title":"Page 43","content":"\u003cp\u003eFrom the moment Pier had seen the news broadcast about Robert Bellamy, she had known she was going to be rich. If Interpol, the international criminal police force, was looking for Robert, there had to be a huge reward out for him. And she was the only one who knew where he was! The reward would be all hers. Persuading him to go to Naples, where she could keep an eye on him, had been a stroke of genius.\u003c/p\u003e\n\u003cp\u003eA man\u0027s voice on the telephone said, \"Interpol. May I help you?\"\u003c/p\u003e\n\u003cp\u003ePier\u0027s heart was pounding. She glanced out of the window to make sure Robert was still at the gas pump. \"Yes. You are looking for a man named Commander Robert Bellamy, yes?\"\u003c/p\u003e\n\u003cp\u003eThere was a moment of silence. \"Who is calling, please?\"\u003c/p\u003e\n\u003cp\u003e\"Never mind. Are you after him or not?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to transfer you to someone else. Will you hold the line, please?\" He turned to his assistant. \"Put a trace on this. Pronto!\"\u003c/p\u003e\n\u003cp\u003eThirty seconds later, Pier was speaking with a senior official. \"Yes, signora. Can I help you?\"\u003c/p\u003e\n\u003cp\u003eNo, you fool. I\u0027m trying to help you. \"I have Commander Robert Bellamy. Do you want him, or don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"But, yes, signora, we want him very much. And you say you have him?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. He\u0027s with me now. How much is he worth to you?\"\u003c/p\u003e\n\u003cp\u003e\"Are you speaking of a reward?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I\u0027m speaking of a reward.\" She glanced out of the window again. What kind of idiots are these?\u003c/p\u003e\n\u003cp\u003eThe official signalled to his assistant to move faster.\u003c/p\u003e\n\u003cp\u003e\"We have not yet set a price on him, signora, so ...\"\u003c/p\u003e\n\u003cp\u003e\"Well, set one now. I\u0027m in a hurry.\"\u003c/p\u003e\n\u003cp\u003e\"How much of a reward are you expecting?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" Pier thought for a moment. \"Would fifty thousand dollars be all right?\"\u003c/p\u003e\n\u003cp\u003e\"Fifty thousand dollars is a lot of money. If you tell me where you are, we could come to you and negotiate a deal that ...\"\u003c/p\u003e\n\u003cp\u003eHe must think I\u0027m pazza. \"No. You either agree to pay me what I want now or ...\" Pier looked up and saw Robert approaching the office. \"Hurry! Yes or no?\"\u003c/p\u003e\n\u003cp\u003e\"Very well, signora. Yes. We will agree to pay you ...\"\u003c/p\u003e\n\u003cp\u003eRobert came through the door, moving toward her.\u003c/p\u003e\n\u003cp\u003ePier said into the telephone, \"We should be there in time for dinner, Mama. You will like him. He is very nice. Good. We will see you later. Ciao.\"\u003c/p\u003e\n\u003cp\u003ePier replaced the receiver and turned to Robert. \"Mother is dying to meet you.\"\u003c/p\u003e\n\u003cp\u003eAt Interpol headquarters, the senior official said, \"Did you trace the call?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. It came from a filling station on the Autostrada del Sole. It looks like they\u0027re on their way to Naples.\"\u003c/p\u003e\n\u003cp\u003eColonel Francesco Cesar and Colonel Frank Johnson were studying a map on the wall of Cesar\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Naples is a big city,\" Colonel Cesar was saying. \"There are a thousand places for him to hide there.\"\u003c/p\u003e\n\u003cp\u003e\"What about the woman?\"\u003c/p\u003e\n\u003cp\u003e\"We have no idea who she is.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we find out?\" Johnson asked.\u003c/p\u003e\n\u003cp\u003eCesar looked at him, puzzled. \"How?\"\u003c/p\u003e\n\u003cp\u003e\"If Bellamy needed a woman companion in a hurry, as a cover, what would he do?\"\u003c/p\u003e\n\u003cp\u003e\"He would probably pick up a whore.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Where do we start?\"\u003c/p\u003e\n\u003cp\u003e\"Tor di Ounto.\"\u003c/p\u003e\n\u003cp\u003eThey drove down the Passeggiata Archeologica and watched the streetwalkers peddling their wares. In the car with Colonel Cesar and Colonel Johnson was Captain Bellini, the police supervisor of the district.\u003c/p\u003e\n\u003cp\u003e\"This is not going to be easy,\" Bellini said. \"They\u0027re all in competition with one another, but when it comes to the police, they\u0027re like blood sisters. They won\u0027t talk.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see,\" Colonel Johnson said.\u003c/p\u003e\n\u003cp\u003eBellini ordered the driver to pull over to the kerb and the three men got out of the car. The prostitutes were eyeing them warily. Bellini walked up to one of the women. \"Good afternoon, Maria. How\u0027s business?\"\u003c/p\u003e\n\u003cp\u003e\"It will be better when you leave.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not planning to stay. I just want to ask you a question. We\u0027re looking for an American who picked up one of the girls last night. We think they are travelling together. We want to know who she is. Can you help us?\" He showed her a photograph of Robert.\u003c/p\u003e\n\u003cp\u003eSeveral other prostitutes had gathered around to listen to the conversation.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help you,\" Maria said, \"but I know someone who can.\"\u003c/p\u003e\n\u003cp\u003eBellini nodded approvingly. \"Good. Who?\"\u003c/p\u003e\n\u003cp\u003eMaria pointed to a store-front across the street. A sign in the window read: \"Fortune Teller - Palm Reader\". \"Madam Lucia might help you.\"\u003c/p\u003e\n\u003cp\u003eThe girls laughed appreciatively.\u003c/p\u003e\n\u003cp\u003eCaptain Bellini looked at them, and said, \"So you like jokes, do you? Well, we\u0027re going to play a little joke I think you\u0027re going to love. These two gentlemen are very anxious to have the name of the girl who went off with the American. If you don\u0027t know who she is, I suggest you talk to your friends, find someone who does know, and when you have the answer, give me a call.\"\u003c/p\u003e\n\u003cp\u003e\"Why should we?\" one of them asked defiantly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll find out.\"\u003c/p\u003e\n\u003cp\u003eOne hour later the prostitutes of Rome found themselves under siege. Patrol wagons swept the city, picking up all the women working the streets, and their pimps. There were screaming protests.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t do this ... I pay police protection.\"\u003c/p\u003e\n\u003cp\u003e\"This has been my beat for five years ...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been giving it to you and your friends for free. Where\u0027s your gratitude ...?\"\u003c/p\u003e\n\u003cp\u003e\"What do I pay you protection for ...?\"\u003c/p\u003e\n\u003cp\u003eBy the following day, the streets were virtually empty of prostitutes, and the jails were full.\u003c/p\u003e\n\u003cp\u003eCesar and Colonel Johnson were sitting in Captain Bellini\u0027s office. \"It\u0027s going to be difficult to keep them in jail,\" Captain Bellini warned. \"I might also add that this is very bad for tourism.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry,\" Colonel Johnson said, \"someone will talk. Just keep the pressure on.\"\u003c/p\u003e\n\u003cp\u003eTheir break came late in the afternoon. Captain Bellini\u0027s secretary said, \"There\u0027s a Mr Lorenzo to see you.\"\u003c/p\u003e\n\u003cp\u003e\"Send him in.\"\u003c/p\u003e\n\u003cp\u003eMr Lorenzo was dressed in a very expensive suit, and wore diamond rings on three fingers. Mr Lorenzo was a pimp.\u003c/p\u003e\n\u003cp\u003e\"What can I do for you?\" Bellini asked.\u003c/p\u003e\n\u003cp\u003eLorenzo smiled. \"It\u0027s what I can do for you gentlemen. Some of my associates inform me that you are looking for a particular working girl who left town with an American, and since we are always eager to cooperate with the authorities, I thought I would give you her name.\"\u003c/p\u003e\n\u003cp\u003eColonel Johnson said, \"Who is she?\"\u003c/p\u003e\n\u003cp\u003eLorenzo ignored the question. \"Naturally, I\u0027m sure you would want to express your appreciation by releasing my associates and their friends.\"\u003c/p\u003e\n\u003cp\u003eColonel Cesar said, \"We are not interested in any of your whores. All we want is the name of the girl.\"\u003c/p\u003e\n\u003cp\u003e\"That is very gratifying news, sir. It\u0027s always a pleasure to deal with reasonable men. I know that ...\"\u003c/p\u003e\n\u003cp\u003e\"Her name, Lorenzo.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course. Her name is Pier. Pier Valli. The American spent the night with her at the L\u0027Incrocio Hotel, and the next morning they took off. She is not one of my girls. If I may say so ...\"\u003c/p\u003e\n\u003cp\u003eBellini was already on the telephone. \"Bring up the records on a Pier Valli. Subito!\"\u003c/p\u003e\n\u003cp\u003e\"I hope you gentlemen are going to show your gratitude by ...\"\u003c/p\u003e\n\u003cp\u003eBellini looked up, and then said into the phone, \"And cancel Operation Puttana.\"\u003c/p\u003e\n\u003cp\u003eLorenzo beamed. \"Grazie.\"\u003c/p\u003e\n\u003cp\u003ePier Valli\u0027s records were on Bellini\u0027s desk five minutes later. \"She started streetwalking when she was fifteen. She has been arrested a dozen times since then. She ...\"\u003c/p\u003e\n\u003cp\u003e\"Where does she come from?\" Colonel Johnson interrupted.\u003c/p\u003e\n\u003cp\u003e\"Naples.\" The two men looked at each other. \"She has a mother and brother living there.\"\u003c/p\u003e\n\u003cp\u003e\"Can you find out where?\"\u003c/p\u003e\n\u003cp\u003e\"I can check it out.\"\u003c/p\u003e\n\u003cp\u003e\"Do that. Now.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-43.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
