{"id":68687,"no":45,"title":"Page 45","content":"\u003cp\u003eThe danger in the air was almost palpable and Robert felt he could reach out and touch it. The waterfront was a beehive of activity, with cargo ships busily loading and unloading. But another element had been added: there were police cars cruising up and down the quay, and uniformed policemen and obvious-looking detectives questioning dock workers and sailors. The concentrated manhunt took Robert by complete surprise. It was almost as though they had known he was in Naples, for it would have been impossible for them to be conducting this intense a search for him in every major city in Italy. He did not even bother to get out of the car. He turned around and headed away from the docks. What he had thought would be an easy plan - to board a cargo ship bound for France - had now become too dangerous. Somehow, they had managed to track him here. He went over his options again. Travelling any distance by car was too risky. There would be roadblocks around the city by now. The docks were guarded. That meant the railroad station and airport would be covered, as well. He was in a vice, and it was closing in on him.\u003c/p\u003e\n\u003cp\u003eRobert thought about Susan\u0027s offer. We\u0027re just off the coast of Gibraltar. We can pick you up at any place you say. It\u0027s probably your only chance of escape. He was reluctant to involve Susan in his danger, and yet he could think of no other alternative. It was the only way out of the trap he was in. They would not be looking for him on a private yacht. If I can find a way to get to the Halcyon, he thought, they could drop me off near the coast near Marseilles, and I can get ashore by myself. That way, they won\u0027t be in danger.\u003c/p\u003e\n\u003cp\u003eHe parked the car in front of a small trattoria on a side street, and went inside to make the call. In five minutes, he was connected with the Halcyon.\u003c/p\u003e\n\u003cp\u003e\"Mrs Banks, please.\"\u003c/p\u003e\n\u003cp\u003e\"Who shall I say is calling?\"\u003c/p\u003e\n\u003cp\u003eMonte has a fucking butler to answer his phone on the yacht. \"Just tell her an old friend.\"\u003c/p\u003e\n\u003cp\u003eA minute later he heard Susan\u0027s voice. \"Robert ... is that you?\"\u003c/p\u003e\n\u003cp\u003e\"The bad penny.\"\u003c/p\u003e\n\u003cp\u003e\"They ... they haven\u0027t arrested you, have they?\"\u003c/p\u003e\n\u003cp\u003e\"No. Susan.\" It was difficult for him to ask the question. \"Is your offer still open?\"\u003c/p\u003e\n\u003cp\u003e\"Of course it is. When ...?\"\u003c/p\u003e\n\u003cp\u003e\"Can you reach Naples by tonight?\"\u003c/p\u003e\n\u003cp\u003eSusan hesitated. \"I don\u0027t know. Hold on a moment.\" Robert heard talking in the background. Susan came on the line again. \"Monte says we have an engine problem, but we can reach Naples in two days.\"\u003c/p\u003e\n\u003cp\u003eDamn. Every day here increased the chances of his getting caught. \"All right. That will be fine.\"\u003c/p\u003e\n\u003cp\u003e\"How will we find you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll contact you.\"\u003c/p\u003e\n\u003cp\u003e\"Robert, please take care of yourself.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying. I really am.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t let anything happen to you?\"\u003c/p\u003e\n\u003cp\u003e\"No, I won\u0027t let anything happen to me.\" Or to you.\u003c/p\u003e\n\u003cp\u003eWhen Susan replaced the receiver, she turned to her husband and smiled. \"He\u0027s coming aboard.\"\u003c/p\u003e\n\u003cp\u003eOne hour later, in Rome, Francesco Cesar handed a cablegram to Colonel Frank Johnson. It was from the Halcyon. It read: \"Bellamy coming aboard Halcyon. Will keep you informed.\" It was unsigned. \"I\u0027ve made arrangements to monitor all communication to and from the Halcyon,\" Cesar said. \"As soon as Bellamy steps aboard, we\u0027ve got him.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-45.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
