{"id":68690,"no":48,"title":"Page 48","content":"\u003cp\u003eThe call had been routed to Colonel Cesar. \"Yes,\" he said to Giuseppe, \"that sounds very much like our man. Listen carefully. He is dangerous, so I want you to do exactly as I tell you. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you now?\"\u003c/p\u003e\n\u003cp\u003e\"At the AGIP truck stop on the highway to Civitavecchia.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s in the back of your truck now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" The conversation was making him nervous. Maybe I should have minded my own business.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t do anything to make him suspicious. Get back in your truck and keep driving toward Civitavecchia. Give me your licence number and a description of your truck.\"\u003c/p\u003e\n\u003cp\u003eGiuseppe gave it to him.\u003c/p\u003e\n\u003cp\u003e\"Fine. We will take care of everything. Now get moving.\"\u003c/p\u003e\n\u003cp\u003eColonel Cesar turned to Colonel Johnson and nodded. \"We have him. I\u0027ll have a roadblock set up. We can be there by helicopter in thirty minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eWhen Giuseppe replaced the receiver, he wiped his sweaty palms on his shirt, and headed for the truck. I hope there won\u0027t be a shoot-out. Maria would kill me. On the other hand, if the reward is large enough ... He climbed into the cab of the truck and headed for Civitavecchia.\u003c/p\u003e\n\u003cp\u003eThirty-five minutes later, Giuseppe heard the sound of a helicopter overhead. He looked up. It had the markings of the State Police. Ahead of him on the highway, he saw two police cars lined up next to each other, forming a roadblock. Behind the cars were policemen with automatic weapons. The helicopter landed at the side of the road, and Cesar and Colonel Frank Johnson stepped out.\u003c/p\u003e\n\u003cp\u003eAs he neared the roadblock, Giuseppe slowed the truck down. He shut off the ignition and jumped out, running toward the officers. \"He\u0027s in the back!\" he shouted.\u003c/p\u003e\n\u003cp\u003eThe truck rolled to a stop. Cesar shouted, \"Close in.\"\u003c/p\u003e\n\u003cp\u003eThe policemen converged on the truck, weapons ready.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t shoot,\" Colonel Johnson yelled. \"I\u0027ll take him.\" He moved toward the back of the truck. \"Come on out, Robert,\" Colonel Johnson called, \"it\u0027s over.\"\u003c/p\u003e\n\u003cp\u003eThere was no response.\u003c/p\u003e\n\u003cp\u003e\"Robert, you have five seconds.\"\u003c/p\u003e\n\u003cp\u003eSilence. They waited.\u003c/p\u003e\n\u003cp\u003eCesar turned to his men and nodded.\u003c/p\u003e\n\u003cp\u003e\"No!\" Colonel Johnson yelled. But it was too late.\u003c/p\u003e\n\u003cp\u003eThe police began firing into the back of the truck. The noise of the automatic fire was deafening. Splinters of crates began flying into the air. After ten seconds, the firing ceased. Colonel Frank Johnson jumped into the back of the truck and moved the crates and boxes out of his way.\u003c/p\u003e\n\u003cp\u003eHe turned to Cesar. \"He\u0027s not here.\"\u003c/p\u003e\n\u003cp\u003eDay Nineteen\u003c/p\u003e\n\u003cp\u003eCivitavecchia, Italy\u003c/p\u003e\n\u003cp\u003eCivitavecchia is the ancient seaport for Rome, guarded by a massive fort completed by Michelangelo in 1537. The port is one of the busiest in Europe, servicing all sea-going traffic to and from Rome and Sardinia. It was early in the morning, but the port was already alive with noisy activity. Robert made his way past the railroad yards and stepped into a small trattoria filled with pungent cooking odours and ordered breakfast.\u003c/p\u003e\n\u003cp\u003eThe Halcyon would be waiting for him at the appointed place, Elba. He was grateful that Susan had remembered it. On their honeymoon, they had stayed in their room there for three days and nights, making love. Susan had said, \"Would you like to go for a swim, darling?\"\u003c/p\u003e\n\u003cp\u003eRobert had shaken his head. \"No. I can\u0027t move. \u0027Able was I, ere I saw Elba.\u0027\" And Susan had laughed and they had made love again. And bless her, she had remembered the palindrome.\u003c/p\u003e\n\u003cp\u003eNow all he had to do was to find a boat to take him to Elba. He walked down the streets leading to the harbour. It was bustling with maritime activity, crowded with freighters, small motor boats and private yachts. There was a landing for a ferry boat. Robert\u0027s eyes lit up when he saw it. That would be the safest way to get over to Elba. He would be able to lose himself in the crowds.\u003c/p\u003e\n\u003cp\u003eAs Robert started toward the ferry landing, he noticed a dark, unmarked sedan parked half a block away, and he stopped. It had official licence plates. There were two men seated inside the car watching the docks. Robert turned and walked in the other direction.\u003c/p\u003e\n\u003cp\u003eScattered among the dockworkers and tourists, he spotted plain-clothes detectives trying to look unobtrusive. They stood out like beacons. Robert\u0027s heart began to pound. How could they possibly have tracked him here? And then he realized what had happened. My God, I told the truck driver where I was going! Stupid! I must be very tired.\u003c/p\u003e\n\u003cp\u003eHe had fallen asleep in the truck, and the absence of movement had awakened him. He had got up to look out, and had seen Giuseppe go into the gas station and make a phone call. Robert had slipped out of the truck and climbed into the back of another truck headed north toward Civitavecchia.\u003c/p\u003e\n\u003cp\u003eHe had trapped himself. They were looking for him here. A few hundred yards away were dozens of boats that could have afforded him an escape. Not any longer.\u003c/p\u003e\n\u003cp\u003eRobert turned away from the harbour and walked toward town. He passed a building with a huge colourful poster on the wall. It read: \"Come to the Fairgrounds. Fun for All! Food! Games! Rides! See the Big Race!\" He stopped and stared.\u003c/p\u003e\n\u003cp\u003eHe had found his escape. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-48.html","bookId":2363,"creation":"Oct 5, 2019 10:10:21 AM","modification":"Oct 5, 2019 10:10:21 AM"}
