{"id":109429,"no":1,"title":"Page 1","content":"\u003cp\u003eIn order to cause the enemy to come of their own volition, extend some [apparent] profit. In order to prevent the enemy from coming forth, show them [the potential] harm.\u003c/p\u003e\n\u003cp\u003e- Sun Tzu, The Art of War\u003c/p\u003e\n\u003cp\u003eSe wo were fi na wo sankofa yenki.\u003c/p\u003e\n\u003cp\u003e(It is not a taboo to go back and retrieve what you forgot.)\u003c/p\u003e\n\u003cp\u003e- Sankofa proverb\u003c/p\u003e\n\u003cp\u003ePROLOGUE\u003c/p\u003e\n\u003cp\u003eTop Next\u003c/p\u003e\n\u003cp\u003eStanding in the Middle of Hell...\u003c/p\u003e\n\u003cp\u003eCarlos assessed his situation fast. Payback for all that he\u0027d done in life was a true bitch. There was no way out. He was dead. Or, more like half dead - undead - a vampire. Topside, he had a woman who he\u0027d give his life for. Perhaps, to some extent, he already had... only to find out that the sister he was protecting was a vampire huntress. Not to mention the fact that the woman he wanted more than his next breath was surrounded by a gang of weapons-toting brothers and an off-the-hook momma who could fight. Crazy.\u003c/p\u003e\n\u003cp\u003eThe old vampires had called Damali a Neteru, and then thinking him ignorant and stupid, and being themselves arrogant, had attempted to simplify the concept for him by describing her as a slayer. Carlos smiled. The tension in their faces was a dead giveaway that, for all their power, they couldn\u0027t hide. Yeah, they had reason to worry.\u003c/p\u003e\n\u003cp\u003eBut didn\u0027t they realize what he\u0027d known all his life? Now dead, there was no loss of that knowledge about what she was - special. Always had been, to him. There was no simplifying Damali. Neteru fit her. To call her anything else would be a clumsy summation of what she was.\u003c/p\u003e\n\u003cp\u003eHis awareness from just a quick hit of Nuit\u0027s throne had given him a glimpse of all who had hunted vampires in the past. For centuries humans had cast spells, or those with mild forms of extrasensory awareness had come for what was now, unfortunately, his kind. Shamans had performed rituals and secret societies had made their own legends. But this one, this huntress... a Neteru was divinely created and specially anointed. Damali was something that he could not put into words.\u003c/p\u003e\n\u003cp\u003eCarlos drew a hard breath just thinking about her. This woman could shift the balance of world power, realign the energies in the universe. She had every gift to go along with her force of nature - not all of them realized, but definitely there, waiting - and a team of seasoned hunters at her side to give guidance, then ultimately follow her lead. From her womb great empires could be birthed, on the side of light or dark, and she held the key: her choice in the matter - the ultimate power of free will. The sister had divine authority. Even the old boys were awed, nervous, and craved what she had come by as a birthright.\u003c/p\u003e\n\u003cp\u003eAnd she is mine...\u003c/p\u003e\n\u003cp\u003eBut he couldn\u0027t worry about all that right now.\u003c/p\u003e\n\u003cp\u003eAbove ground, he had the Asian, Russian, Dominican, and Jamaican drug mobs, plus the federal authorities and another master vampire, looking for his head on a silver platter. Beneath the earth\u0027s surface, he had the entire Vampire Council on his ass. And now he was about to receive a tour of Hell itself.\u003c/p\u003e\n\u003cp\u003eThis was beyond fucked up. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-awakening-vampire-huntress-legend-2/page-1.html","bookId":2526,"creation":"Oct 5, 2019 11:37:15 PM","modification":"Oct 5, 2019 11:37:15 PM"}
