{"id":107629,"no":3,"title":"Page 3","content":"\u003cp\u003eSince there were two homicides on the table this Tuesday morning - an unusual circumstance, even for the Eight-Seven\u0026nbsp;\u0026nbsp;- Lieutenant Byrnes told the detectives assembled in his office that he\u0027d be skipping over all the usual shit and getting directly to the murders, if nobody had any objections. Andy Parker didn\u0027t think the murder of a two-bit stool pigeon should take priority over a drug bust he\u0027d been trying to set up for the past two weeks, but he knew better than to challenge the lieutenant when he was wearing what Parker referred to privately as his \"Irish Look.\"\u003c/p\u003e\n\u003cp\u003eHal Willis wasn\u0027t too tickled to be passed over, either. He\u0027d caught a burglary yesterday where the perp had left chocolate-covered donuts on his victim\u0027s pillow. This looked a lot like what the Cookie Boy used to do, but he\u0027d jumped bail in August and was now only God knew where. So this guy was obviously a copycat, which similarity might have made for a little early morning amusement if the lieutenant hadn\u0027t pulled the chain. Like teenagers invited to a party and then requested not to dance, please, the two detectives slouched sourly against the wall, arms folded across their chests in unmistakable body language. They didn\u0027t even sniff at the bagels and coffee on the lieutenant\u0027s desk, a treat - or more accurately a bribe to encourage punctuality - paid for by the squadroom slush fund every Tuesday.\u003c/p\u003e\n\u003cp\u003eThis was eight o\u0027clock in the morning. A harsh, bright sunlight streamed through Byrnes\u0027s corner windows. All told, and including the lieutenant, there were eight detectives in the office. Artie Brown and Bert Kling had responded to the pizzeria shoot-out and were looking for anything they could get on the two shooters. Carella and Meyer wanted to explore the Hale case. The two detectives sulking against the wall didn\u0027t care to offer their thoughts on anything. They\u0027 d been shut out, and they were miffed, although Byrnes seemed blithely unaware of their annoyance. Cotton Hawes was neutral. His plate was clean at the moment. In fact, he\u0027d been in court testifying all last week. Sitting in a leather easy chair opposite the lieutenant\u0027s desk, feeling curiously uninvolved, like a cop visiting from another city, he listened as the lieutenant summarized the two homicide cases, and then asked, \"You think they\u0027re linked?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Meyer?\" Byrnes asked.\u003c/p\u003e\n\u003cp\u003e\"Only if they were trying to shut Danny up.\"\u003c/p\u003e\n\u003cp\u003e\"You sure they weren\u0027t after Steve?\"\u003c/p\u003e\n\u003cp\u003e\"No, it was Danny,\" Kling said.\u003c/p\u003e\n\u003cp\u003e\"Neither of them even fired a shot at me.\"\u003c/p\u003e\n\u003cp\u003e\"Ten, twelve people saw them go straight for Danny,\" Brown said.\u003c/p\u003e\n\u003cp\u003e\"They\u0027d seen a lot of movies.\"\u003c/p\u003e\n\u003cp\u003e\"Kept describing it as a gangland execution.\"\u003c/p\u003e\n\u003cp\u003e\"In broad daylight?\" Hawes asked, and shook his head skeptically. He was sitting in sunlight. It caught his red hair, setting it on fire. The single white streak over his left temple looked like a patch of melting snow.\u003c/p\u003e\n\u003cp\u003e\"Nobody says your goons are brain surgeons.\"\u003c/p\u003e\n\u003cp\u003e\"Black and white, huh?\"\u003c/p\u003e\n\u003cp\u003e\"And red all over.\"\u003c/p\u003e\n\u003cp\u003e\"Could\u0027ve been an old beef,\" Hawes suggested. \"Finally caught up with him.\"\u003c/p\u003e\n\u003cp\u003e\"Be a coincidence, the day he\u0027s meeting with Steve. But I buy coincidence,\" Byrnes said. \"I\u0027ve been a cop long enough.\"\u003c/p\u003e\n\u003cp\u003e\"Coulda been they wanted him before he told Steve whatever it was he had to tell him,\" Brown said. He was straddling a wooden chair near the bookcases, a huge man with skin the color of a giant grizzly\u0027s coat. His shirt collar was open, and he was wearing over it a green sweater. His arms were resting on the chair\u0027s top rail.\u003c/p\u003e\n\u003cp\u003e\"Did he tell you anything?\" Kling asked. \"Before they got him?\"\u003c/p\u003e\n\u003cp\u003e\"Not really. He wanted to get paid first.\"\u003c/p\u003e\n\u003cp\u003e\"Gee, there\u0027s a surprise.\"\u003c/p\u003e\n\u003cp\u003e\"How much was he looking for?\" Hawes asked.\u003c/p\u003e\n\u003cp\u003e\"Five grand.\"\u003c/p\u003e\n\u003cp\u003eHawes whistled.\u003c/p\u003e\n\u003cp\u003e\"What\u0027d he promise?\" Willis asked, giving in at last to his curiosity. He was the shortest man on the squad, wiry and intense, dark eyes reflecting the day\u0027s cold light. Parker turned to him with a sharp look, as if his best friend in the entire world had suddenly moved to Anniston, Alabama, to wallow in pig shit.\u003c/p\u003e\n\u003cp\u003e\"He said he knew the name and address of the guy who did Hale,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d he get thatT Willis asked, totally involved now. Parker stepped a little bit away from him.\u003c/p\u003e\n\u003cp\u003e\"Pal of his was in a poker game with the hitter.\"\u003c/p\u003e\n\u003cp\u003e\"Let me get this straight,\" Hawes said. \"Danny was in a poker game with the hitter?\"\u003c/p\u003e\n\u003cp\u003e\"No, no,\" Meyer said. \"A. friend of Danny\u0027s was in the game.\"\u003c/p\u003e\n\u003cp\u003e\"With the guy who hung Hale from the bathroom door?\"\u003c/p\u003e\n\u003cp\u003e\"Hanged him, yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, him?\"\u003c/p\u003e\n\u003cp\u003e\"The very.\"\u003c/p\u003e\n\u003cp\u003e\"What is this, a movie?\" Willis asked.\u003c/p\u003e\n\u003cp\u003e\"I wish,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Fda paid him on the spot,\" Parker said suddenly, and then realized with a start that he\u0027d broken his own sullen silence. Everyone turned to him, surprised by the vehemence in his voice, surprised, too, that he\u0027d bothered to shave this morning. \"That kind of information,\" he said, plunging ahead, \"Fda asked him to wait while I went to rob a bank.\"\u003c/p\u003e\n\u003cp\u003e\"I should\u0027ve,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s this pal of his?\" Kling asked. He was wearing this morning a brown leather jacket that looked like it had come from Oklahoma or Wyoming, but which he\u0027d bought off a pushcart at a street fair this summer. Blond and hazel-eyed, with a complexion and lashes most women would kill for, he projected a country bumpkin air that worked well in Good Cop/Bad Cop scenarios. He was particularly well-paired with Brown, whose perpetual scowl could sometimes be intimidating. \"Did Danny give you a clue?\"\u003c/p\u003e\n\u003cp\u003e\"Somebody named Harpo.\"\u003c/p\u003e\n\u003cp\u003e\"It is a movie,\" Willis said.\u003c/p\u003e\n\u003cp\u003e\"Harpo what?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t say.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s gay,\" Meyer offered.\u003c/p\u003e\n\u003cp\u003e\"White, black?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t say.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d the card game take place?\"\u003c/p\u003e\n\u003cp\u003e\"Lewiston Av.\"\u003c/p\u003e\n\u003cp\u003e\"The Eight-Eight.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Probably black,\" Parker said. \"The Eight-Eight.\"\u003c/p\u003e\n\u003cp\u003eBrown looked at him.\u003c/p\u003e\n\u003cp\u003e\"What?\" Parker said. \"Did I say something bothered you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you said.\"\u003c/p\u003e\n\u003cp\u003e\"I said a card game in the Eight-Eight, you automatically figure black players,\" Parker said, and shrugged. \"Anyway, fuck you, you\u0027re so sensitive.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d I do, look at you?\" Brown asked.\u003c/p\u003e\n\u003cp\u003e\"You looked at me cockeyed.\"\u003c/p\u003e\n\u003cp\u003e\"Break it up, okay?\" Byrnes said.\u003c/p\u003e\n\u003cp\u003e\"Just don\u0027t be so fuckin sensitive,\" Parker said. \"Everybody in the world ain\u0027t out to shoot you a hundred and twelve times.\"\u003c/p\u003e\n\u003cp\u003e\"Hey!\" Byrnes said. \"Did you hear me, or what?\"\u003c/p\u003e\n\u003cp\u003e\"I heard you. He\u0027s too fuckin sensitive.\"\u003c/p\u003e\n\u003cp\u003e\"One more time, Andy,\" Brown said.\u003c/p\u003e\n\u003cp\u003e\"Hey!\" Byrnes shouted.\u003c/p\u003e\n\u003cp\u003e\"All I\u0027m sayin,\" Parker said, \"is if this was a black card game, then Danny\u0027s friend Harpo, and the guy who hanged Hale, could both be black, is all I\u0027m sayin.\"\u003c/p\u003e\n\u003cp\u003e\"Point taken,\" Brown said.\u003c/p\u003e\n\u003cp\u003e\"Boy,\" Parker said, and rolled his eyes.\u003c/p\u003e\n\u003cp\u003e\"We finished here?\" Byrnes asked.\u003c/p\u003e\n\u003cp\u003e\"If we\u0027re finished,\" Parker said, \"I\u0027d like to talk about settin up a bust on a . . .\"\u003c/p\u003e\n\u003cp\u003e\"I meant are you two finished with this bullshit here?\"\u003c/p\u003e\n\u003cp\u003e\"What bullshit?\" Parker asked.\u003c/p\u003e\n\u003cp\u003e\"Let it go, Pete,\" Brown said.\u003c/p\u003e\n\u003cp\u003eByrnes glared at both of them. The room was silent for several moments. Hawes cleared his throat.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s possible, you know,\" he said, \"that one of the two shooters in the pizzeria was the guy who also did Hale.\"\u003c/p\u003e\n\u003cp\u003e\"How do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"He finds out Harpo told Danny about him, figures he\u0027ll take Danny off the board before he spreads the word. That\u0027s possible, too, you know.\"\u003c/p\u003e\n\u003cp\u003e\"A hangman suddenly becomes a shooter?\" Parker said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s possible.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a twenty-five grand policy, huh?\" Willis said.\u003c/p\u003e\n\u003cp\u003e\"Daughter and son-in-law the sole beneficiaries,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"They know about it?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re alibied to the hilt,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re figuring a contract job.\"\u003c/p\u003e\n\u003cp\u003e\"Is what Danny said it was. He said the killer got five grand to do the old man.\"\u003c/p\u003e\n\u003cp\u003e\"Were those his exact words?\" Byrnes asked.\u003c/p\u003e\n\u003cp\u003e\"No, he said the old man had something somebody else wanted real bad and he wouldn\u0027t part with it. Something worth a lot of money.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d he say about having him killed?\"\u003c/p\u003e\n\u003cp\u003e\"He said somebody was willing to pay five grand to kill the old man and make it look like an accident.\"\u003c/p\u003e\n\u003cp\u003e\"But why?\" Willis asked.\u003c/p\u003e\n\u003cp\u003e\"What do you mean why?\"\u003c/p\u003e\n\u003cp\u003e\"You said the old man had something somebody else wanted . . .\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"So how\u0027s this somebody gonna get it if he has the old man killed?\"\u003c/p\u003e\n\u003cp\u003eThe detectives fell silent, thinking this over.\u003c/p\u003e\n\u003cp\u003e\"Had to be the insurance money,\" Hawes said at last.\u003c/p\u003e\n\u003cp\u003e\"Only thing anyone could get by having him killed.\"\u003c/p\u003e\n\u003cp\u003e\"Which leads right back to the daughter and son-in-law.\"\u003c/p\u003e\n\u003cp\u003e\"Unless there\u0027s something else,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003e\"Was the guy tortured?\" Hawes asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Cause maybe the killer was trying to get whatever it was, and when he couldn\u0027t. . .\"\u003c/p\u003e\n\u003cp\u003e\"No, he wasn\u0027t tortured,\" Meyer said. \"The killer doped him and hanged him. Period.\"\u003c/p\u003e\n\u003cp\u003e\"Smoked some pot with him, dropped roofers in his drink . . .\"\u003c/p\u003e\n\u003cp\u003e\"Which is what the guy in the card game offered Harpo.\"\u003c/p\u003e\n\u003cp\u003e\"Did these two guys know each other?\" Parker asked.\u003c/p\u003e\n\u003cp\u003e\"They met in the card game.\"\u003c/p\u003e\n\u003cp\u003e\"Not them two. I\u0027m talking about the old man and the guy who killed him.\"\u003c/p\u003e\n\u003cp\u003eAgain, the room went silent. They were all looking at Parker now. Sometimes a great notion.\u003c/p\u003e\n\u003cp\u003e\"I mean, were they buddies or something? Cause otherwise, how\u0027d he get in the apartment? And how come they were smoking pot together and drinking together? They had to know each other, am I right?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see how,\" Carella said. \"Danny told me the killer was a hit man from Houston. Going back there tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Told you everything but what you wanted to know, right?\"\u003c/p\u003e\n\u003cp\u003e\"Did the old man ever go to Houston?\" Byrnes asked.\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"What do you know about him?\"\u003c/p\u003e\n\u003cp\u003e\"Not much. Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Find out. And soon.\"\u003c/p\u003e\n\u003cp\u003e\"Did he leave a will?\" Hawes asked.\u003c/p\u003e\n\u003cp\u003e\"Left everything he had to the kids.\"\u003c/p\u003e\n\u003cp\u003e\"Which was what?\"\u003c/p\u003e\n\u003cp\u003e\"Bupkes,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Parker asked.\u003c/p\u003e\n\u003cp\u003e\"Rabbit shit.\"\u003c/p\u003e\n\u003cp\u003e\"So then what\u0027s this something somebody wanted bad enough to kill for?\"\u003c/p\u003e\n\u003cp\u003e\"The MacGuffin,\" Hawes said.\u003c/p\u003e\n\u003cp\u003e\"I told you,\" Willis said. \"It\u0027s a fuckin movie.\"\u003c/p\u003e\n\u003cp\u003e\"Movie, my ass,\" Byrnes said. \"Get some composites made from the witnesses in that pizza joint. Let\u0027s at least find two guys who came in blazing in broad daylight, can we? And find out where that poker game took place. There has to be . . .\"\u003c/p\u003e\n\u003cp\u003e\"On Lewiston,\" Carella said. \"Up in the . . .\"\u003c/p\u003e\n\u003cp\u003e\"Where on Lewiston? Our man\u0027s leaving town tomorrow.\"\u003c/p\u003e\n\u003cp\u003eThe room went silent.\u003c/p\u003e\n\u003cp\u003e\"I want you to treat this like a single case with Danny as the connecting link,\" Byrnes said. \"One of the guys in that poker game knew Danny, and another one may have killed Hale. Let\u0027s find out who was in the damn game. And find out who that old man really was. He didn\u0027t exist in a vacuum. Nobody does. If he had something somebody wanted, find out what the hell it was. If it was just the insurance policy, then stay with the Keatings till you nail them. I want the four of you who caught the squeals to work this as a team. Split the legwork however you like. But bring me something.\"\u003c/p\u003e\n\u003cp\u003eCarella nodded.\u003c/p\u003e\n\u003cp\u003e\"Meyer?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Artie? Bert?\"\u003c/p\u003e\n\u003cp\u003e\"We hear you.\"\u003c/p\u003e\n\u003cp\u003e\"Then do it,\" Byrnes said.\u003c/p\u003e\n\u003cp\u003e\"What about my dope bust?\" Parker asked.\u003c/p\u003e\n\u003cp\u003e\"Stay,\" Byrnes said, as if he were talking to a pit bull.\u003c/p\u003e\n\u003cp\u003eThere were several training exercises at the academy, each designed to illustrate the unreliability of eye witnesses. Each of them involved a variation on the same theme. During a class lecture, someone would come into the room, interrupting the class, and then go out again. The cops-in-training would later be asked to describe the person who\u0027d entered and departed. In one exercise, the intruder was merely someone who went to one of the windows, opened it, and walked out again. In another, it was a woman who came in with a mop and a pail, quickly mopped a small patch of floor, and went out again just as quickly. In a more vivid exercise, a man came in firing a pistol, and then rushed out at once. In none of these exercises was the intruder accurately described afterward.\u003c/p\u003e\n\u003cp\u003eBrown, Kling, and the police artist interviewed fourteen people that Tuesday morning. Only one of them -\u0026nbsp;\u0026nbsp;Steve Carella - was a trained observer, but even he had difficulty describing the two shooters who\u0027d marched into the pizzeria at ten minutes past nine the day before. Of all the witnesses who\u0027d been there at the time, only two blacks and four whites remembered anything at all about the men. The white witnesses found it hard to say what the black shooter had looked like. If they\u0027d been asked to tell the difference between Morgan Freeman, Denzel Washington, Eddie Murphy, and Mike Tyson, there\u0027d have been no problem. Maybe. But when the police artist asked them to choose from representative eyes, noses, mouths, cheeks, chins, and foreheads, all at once all black men looked alike. Then again, they might have had similar difficulty describing an Asian suspect.\u003c/p\u003e\n\u003cp\u003eIn the long run - like many other decisions in America - the result was premised on race. The blacks had better luck describing the black suspect, and the whites had better luck with the white one. The detectives were less than satisfied with what the artist finally delivered. They felt the composite sketches were well . . . sketchy at best.\u003c/p\u003e\n\u003cp\u003eWhen Carella and Meyer walked in late that Tuesday morning, Fat Ollie Weeks was sitting alone in a booth at the rear of the diner, totally absorbed in his breakfast. Acknowledging their presence with a brief nod, Ollie stabbed a sausage with his fork and hoisted it immediately to his mouth. A ribbon of egg yolk dribbled from the sausage onto Ollie\u0027s tie, where it joined a medley of other crusted and hardened remnants of breakfasts, lunches, and dinners devoured in haste. Ollie always ate as if expecting an imminent famine. He picked up his cup, swallowed a huge gulp of coffee, and then smiled in satisfaction and at last looked across the table at the two visiting cops. He did not offer his hand; cops rarely shook hands with each other, even during social encounters.\u003c/p\u003e\n\u003cp\u003e\"So what brings you up here?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"The murder yesterday,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"What murder?\" Ollie asked. Here in Zimbabwe West, as he often referred to his beloved Eighty-eighth Precinct, there were murders every day of the week, every minute of the day.\u003c/p\u003e\n\u003cp\u003e\"An informer named Danny Gimp,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"I know him,\" Ollie said.\u003c/p\u003e\n\u003cp\u003e\"Two shooters marched into Guide\u0027s Pizzeria while we were having a conversation,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Maybe they were after you,\" Ollie suggested.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m universally well-liked,\" Carella said. \"They were after Danny, and they got him.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Guide\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"Culver and Sixth.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s your turf, man.\"\u003c/p\u003e\n\u003cp\u003e\"Lewiston isn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, I\u0027ll bite.\"\u003c/p\u003e\n\u003cp\u003e\"A pal of Danny\u0027s was in a poker game a week ago Saturday,\" Meyer said. \"On Lewiston Avenue.\"\u003c/p\u003e\n\u003cp\u003e\"Met a hitter from Houston who later treated him to a little booze, a little pot, some casual sex, and a strip of roofers.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh,\" Ollie said, and signaled to the waitress. \"So what\u0027s that got to do with me?\"\u003c/p\u003e\n\u003cp\u003e\"Lewiston is up here in the Eight-Eight.\"\u003c/p\u003e\n\u003cp\u003e\"So? I\u0027m supposed to know every shitty little card game in the precinct?\" Ollie said. \"Give me another toasted onion bagel with cream cheese,\" he told the waitress. \"You guys want anything?\"\u003c/p\u003e\n\u003cp\u003e\"Just coffee,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"The same,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"You got that?\" Ollie asked the waitress, who nodded and walked off toward the counter. \"You think this card game\u0027s gonna lead you to the shooters?\"\u003c/p\u003e\n\u003cp\u003e\"No, we think it\u0027s gonna lead us to the hitter from Houston.\"\u003c/p\u003e\n\u003cp\u003e\"World\u0027s just full of hitters these days, ain\u0027t it?\" Ollie said philosophically. \"You think your Houston hitter and the two pizzeria shooters are connected?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then what are you . . . ?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you work in the Eight-Three?\" the waitress asked, and put down Ollie\u0027s bagel and the two coffees.\u003c/p\u003e\n\u003cp\u003e\"I used to work in the Eight-Three,\" Ollie said. \"I got transferred.\"\u003c/p\u003e\n\u003cp\u003e\"You want more coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Ah, yes, m\u0027dear,\" Ollie said, doing his world-famous W. C. Fields imitation. \"If it\u0027s not too much trouble, ah, yes.\"\u003c/p\u003e\n\u003cp\u003e\"You like it here better than the Eight-Three?\" the waitress asked, pouring.\u003c/p\u003e\n\u003cp\u003e\"I like it better wherever you are, m\u0027little chickadee.\"\u003c/p\u003e\n\u003cp\u003e\"Sweet talker,\" she said, and smiled and walked off, shaking her considerable booty.\u003c/p\u003e\n\u003cp\u003e\"People ask me that all the time,\" Ollie said. \"Don\u0027t you work in the Eight-Three? As if I don\u0027t know where the fuck I work. As if I\u0027m making a fuckin mistake about where I work. The world\u0027s full of people playin Gotchal They got nothin to do with their time but look for mistakes. Ain\u0027t your middle name Lloyd? Hell, no, it\u0027s Wendell. Oliver Wendell Weeks, I don\u0027t know my own fuckin middle name? If I told you once it was Lloyd or Frank or Ralph, I was lying, it was all part of my fuckin cover.\"\u003c/p\u003e\n\u003cp\u003eA faint effluvial odor seemed to rise from Ollie whenever he became agitated, as he was now. Ignoring his own bodily emanations, he picked up the bagel and bit into it, his gnashing teeth unleashing a gush of cream cheese that spilled onto the right lapel of his jacket.\u003c/p\u003e\n\u003cp\u003e\"Has this guy got a name?\" he asked. \"The fag was in the card game with your hitter?\"\u003c/p\u003e\n\u003cp\u003e\"Harpo,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Works at the First Bap?\" Ollie said.\u003c/p\u003e\n\u003cp\u003eBoth detectives looked at him.\u003c/p\u003e\n\u003cp\u003e\"Only Harpo I know up here,\" Ollie said. \"I\u0027m surprised he was in a card game, though. If it\u0027s the same guy.\"\u003c/p\u003e\n\u003cp\u003e\"Harpo what?\" Meyer asked.\u003c/p\u003e\n\u003cp\u003e\"His square handle is Walter Hopwell, don\u0027t ask me how it got to be Harpo. I never knew he was queer till you guys mentioned it just now. Goes to show, don\u0027t it? Ain\u0027t you hungry?\" he asked, and signaled to the waitress again. \"Bring my friends here some more coffee,\" he said, \"they\u0027re famous sleuths from a neighboring precinct. And I\u0027ll have one of them croissants there.\" He pronounced the word as if he were fluent in French, but it was only his stomach talking. \"Thing I\u0027m askin myself,\" he said, \"is how come a white stoolie is pals with a Negro fag?\"\u003c/p\u003e\n\u003cp\u003eOllie liked using the word \"Negro\" every now and then because he believed it showed how tolerant he was, even though he realized it pissed off persons of color who preferred being called either blacks or African-Americans. But it had taken him long enough to learn how to say \"Negro,\" so if they wanted to keep changing it on him all the time, they could go fuck themselves.\u003c/p\u003e\n\u003cp\u003e\"Would he be at the church now?\" Carella asked.\u003c/p\u003e\n\u003cp\u003e\"Should be. They got a regular office setup on the top floor.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"You wanna start a race riot?\" Ollie asked, and grinned as if he relished the prospect. \"The First Bap\u0027s listed as a sensitive location. I was you, I\u0027d look up Mr Hopwell in the phone book, go see him when he gets home from work.\"\u003c/p\u003e\n\u003cp\u003e\"Our man\u0027s leaving town tomorrow,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"In that case, darlings, let me finish my breakfast,\" Ollie said. \"Then we can all go to church.\"\u003c/p\u003e\n\u003cp\u003eBrown\u0027s mother used to call her \"The Barber\u0027s Wife.\" This was another name for the neighborhood gossip. The theory was that a guy went to get a haircut or a shave, he was captive in the barber\u0027s chair for an hour or so, he told the barber everything on his mind. The barber went home that night, and over supper told his wife everything he\u0027d heard from all his customers all day long. The Barber\u0027s Wife knew more about what was happening in any neighborhood than any cop on the beat. What Brown and Kling wanted to do now was find The Barber\u0027s Wife in Andrew Bale\u0027s building.\u003c/p\u003e\n\u003cp\u003eThere were six stories in the building, three tenants to each floor. When they got there that morning at a little past ten, most of the tenants were off to work. They knocked on six doors before they got an answer, and then another two before they found the woman they were looking for. Her apartment was on the same floor as Andrew Hale\u0027s. She lived at the far end of the hall, in apartment 3C. When she asked them to come in, please, they hesitated on the door sill because she was cooking something that smelled unspeakably vile.\u003c/p\u003e\n\u003cp\u003eThe stench was coming from a big aluminum pot on the kitchen stove. When she lifted the lid to stir whatever was inside the pot, noxious clouds filled the air, and Kling caught sight of a bubbling liquid that appeared viscous and black. He wondered whether there was eye of newt in the pot. He wanted to go outside in the hall again, to throw up. But the woman invited them into a small living room where, mercifully, there was an open window that rendered the stink less offensive. They sat on a sofa with lace doilies on the arms and back. The woman had false teeth, but she smiled a lot nonetheless. Smiling, she told them her name was Katherine Kipp, and that she had been a neighbor of Mr Hale\u0027s for the past seven years. They guessed she was in her sixties, but they didn\u0027t ask because they were both gentlemen, sure. She told them her husband had worked in the railroad yards up in Riverhead till he had an accident one day that killed him. She did not elaborate on what the accident might have been, and they did not ask. Kling wondered if the late Mr Kipp had possibly sampled some of the black brew boiling on the kitchen stove.\u003c/p\u003e\n\u003cp\u003eThey asked her first about the night of October twenty-eighth, because this was the night someone had been in Hale\u0027s apartment boozing it up and smoking dope and everything, and incidentally hanging Hale from a hook on the bathroom door. Had Mrs Kipp seen anything? Heard anything?\u003c/p\u003e\n\u003cp\u003e\"No,\" she said.\u003c/p\u003e\n\u003cp\u003e\"How about anytime before that night?\" Brown asked. \"See anybody going in or out of his apartment?\"\u003c/p\u003e\n\u003cp\u003e\"How do you mean?\" Mrs Kipp asked.\u003c/p\u003e\n\u003cp\u003e\"Anyone who might\u0027ve visited Mr Hale. A friend, an acquaintance ... a relative?\"\u003c/p\u003e\n\u003cp\u003e\"Well, his daughter used to stop by every now and then. Cynthia. She visited him every so often.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t see her on the night of the twenty-eighth, did you?\" Kling asked.\u003c/p\u003e\n\u003cp\u003e\"No, I did not.\"\u003c/p\u003e\n\u003cp\u003e\"How about anyone else?\"\u003c/p\u003e\n\u003cp\u003e\"That night, do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"That night, or any other time. Someone he might have felt comfortable enough to sit with, talk to, have a drink or two, like that.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t have many visitors,\" Mrs Kipp said.\u003c/p\u003e\n\u003cp\u003e\"Never saw anyone going in or out, hm?\" Brown said.\u003c/p\u003e\n\u003cp\u003e\"Well, yes. But not on a regular basis.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure I understand you, Mrs Kipp.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you said a friend or an acquaintance . . .\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, but . . .\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m assuming you meant someone who came to see Mr Hale on a regular basis. A friend. You know. An acquaintance.\"\u003c/p\u003e\n\u003cp\u003e\"We meant anyone\" Kling said. \"Anyone who came here to see Mr Hale. However many times.\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes,\" Mrs Kipp said. \"There was someone who came to see him.\"\u003c/p\u003e\n\u003cp\u003e\"How often?\" Brown asked.\u003c/p\u003e\n\u003cp\u003e\"Three times.\"\u003c/p\u003e\n\u003cp\u003e\"When?\"\u003c/p\u003e\n\u003cp\u003e\"In September.\"\u003c/p\u003e\n\u003cp\u003eIt began raining again just as Carella swung the sedan into the curb in front of the First Baptist Church. They waited for five or six minutes, hoping the rain might lei up. When it appeared hopeless, they piled out of the car, and ran for the front doors of the church. Ollie pushed a doorbell button to the right of the jamb.\u003c/p\u003e\n\u003cp\u003eThe church was housed in a white clapboard structure wedged between a pair of six-story tenements whose red-brick facades had been recently sandblasted. There were sections of Diamondback that long ago had been sucked into the quagmire of hopeless poverty, where any thoughts of gentrification were mere pipe dreams. But St Sebastian Avenue, here in the Double-Eight between Seventeenth and Twenty-first, was the hub of a thriving mini-community not unlike a self-contained small town. Along this stretch of avenue, you could find good restaurants, markets brimming with prime cuts of meat and fresh produce, clothing stores selling designer labels, repair shops for shoes, bicycles, or umbrellas, a new movie complex with six screens, even a fitness center.\u003c/p\u003e\n\u003cp\u003eOllie rang the doorbell again. Lightning flashed behind the low buildings across the avenue. Thunder boomed. The middle of the three doors opened. The man standing there, peering out at the detectives and the rain, was some six feet, two or three inches tall, Carella guessed, with the wide shoulders and broad chest of a heavyweight boxer, which in fact the Reverend Gabriel Foster once had been. His eyebrows were still ridged with scars, the result of too much stubborn resistance against superior opponents when he was club-fighting all over the country. At forty-eight, he still looked mean and dangerous. Wearing a moss-green corduroy suit over a black turtleneck sweater, black loafers and black socks, a massive gold ring on the pinky of his left hand, he stood just inside the arched middle door to his church while the detectives stood in the rain outside.\u003c/p\u003e\n\u003cp\u003e\"You brought the rain,\" he said.\u003c/p\u003e\n\u003cp\u003eAccording to police files, Foster\u0027s birth name was Gabriel Foster Jones, but he\u0027d changed it to Rhino Jones when he started boxing, and then to Gabriel Foster when he began preaching. Foster considered himself a civil rights activist. The police considered him a rabble-rouser, an opportunistic self-promoter, and a race racketeer. Which was why his church was listed in the files as a sensitive location. \"Sensitive location\" was departmental code for anyplace where the uninvited presence of the police might cause a race riot. In Carella\u0027s experience, most of these locations were churches.\u003c/p\u003e\n\u003cp\u003eThe detectives kept standing in the teeming rain on the wide front steps of the church, waiting for the preacher to invite them in. He showed no sign of offering any such hospitality.\u003c/p\u003e\n\u003cp\u003e\"Detective Carella,\" Carella said, \"Eighty-seventh Squad. We\u0027re looking for a man named Walter Hopwell, we understand he works here.\"\u003c/p\u003e\n\u003cp\u003e\"He does indeed,\" Foster said.\u003c/p\u003e\n\u003cp\u003eThe rain kept battering them.\u003c/p\u003e\n\u003cp\u003e\"Apparently he knew a man named Daniel Nelson, who was killed yesterday morning,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I saw the news.\"\u003c/p\u003e\n\u003cp\u003e\"Is Mr Hopwell here now?\" Carella asked.\u003c/p\u003e\n\u003cp\u003e\"Why do you want to see him?\"\u003c/p\u003e\n\u003cp\u003e\"We think he may have information pertaining to a case we\u0027re investigating.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the man who shot and killed Sonny Cole, aren\u0027t you?\" Foster said.\u003c/p\u003e\n\u003cp\u003eCarella looked at him.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that got to do with the price of fish?\" Ollie asked.\u003c/p\u003e\n\u003cp\u003e\"Everything,\" Foster said. \"The officer here shot and killed a brother in cold blood.\"\u003c/p\u003e\n\u003cp\u003eA brother, Ollie thought.\u003c/p\u003e\n\u003cp\u003e\"The officer here shot the individual who killed his father,\" Ollie said. \"Which has nothing to do with Walter Hopwell.\"\u003c/p\u003e\n\u003cp\u003eRain was running down his cheekbones and over his jaw. He stood sopping wet in the rain, looking in at the dry comfort of the preacher inside, hating the son of a bitch for being dry and being black and looking so fucking smug.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not welcome here,\" Foster said.\u003c/p\u003e\n\u003cp\u003e\"Well, gee, then here\u0027s what we\u0027ll have to do,\" Ollie said.\u003c/p\u003e\n\u003cp\u003e\"Let it go, Ollie,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Oh no way,\" Ollie said, and turned back to Foster again. \"We\u0027ll ask the D.A. to subpoena Hopwell as a witness in a murder investigation. We\u0027ll come back with a grand-jury subpoena for Walter Hopwell, alias Harpo Hopwell, and we\u0027ll stand in the rain here outside your pretty little church here and ask anyone who comes out, \u0027Are you Walter Hopwell, sir?\u0027 If the answer is yes, or if the answer is no answer at all, we\u0027ll hand him the subpoena to appear before the grand jury at nine-thirty tomorrow morning. Now if he goes before a grand jury, it might take them all day to ask him the same questions we could ask in half an hour if you let us in out of the rain. What do you say, Rhino? It\u0027s your call.\"\u003c/p\u003e\n\u003cp\u003eFoster looked at Ollie as if deciding whether to punch him in the gut or drop him instead with an uppercut to the jaw. Ollie didn\u0027t give blacks too much credit for profound thinking, but if he was Foster, he\u0027d be figuring Carella here had indeed slain a no-good murderer who merely happened to be of the same color as the reverend himself - but was this a good enough reason to take a substantial position at this juncture in time? This past August was already ancient history. Was the slain brother, who\u0027d incidentally been stalking Carella with a nine-millimeter pistol, reason enough to precipitate a major confrontation at this late date? Ollie was no mind reader, but he guessed maybe Rhino here was thinking along those lines.\u003c/p\u003e\n\u003cp\u003eThe Last Dance \"Come in,\" Foster said at last.\u003c/p\u003e\n\u003cp\u003eShe had heard them arguing.\u003c/p\u003e\n\u003cp\u003e\"The walls are paper thin in this building,\" she said. \"You can hear everything. Well, just listen,\" she said. \"Let\u0027s not talk for a minute or so, you\u0027ll understand what I mean. Let\u0027s just be still, shall we?\"\u003c/p\u003e\n\u003cp\u003eThe detectives did not wish to be still, not when Mrs Kipp had just told them that the normally reclusive Andrew Hale had been visited by someone three times during the month of September. But they fell silent nonetheless, listening intently. Someone flushed a toilet. A telephone rang. They could hear, faintly, what sounded like voices on a television soap opera.\u003c/p\u003e\n\u003cp\u003e\"Do you see what I mean?\" she asked.\u003c/p\u003e\n\u003cp\u003eHear what you mean, Kling thought, but did not say.\u003c/p\u003e\n\u003cp\u003e\"Was this a man or a woman?\" Brown asked. \"This person who visited Mr Hale.\"\u003c/p\u003e\n\u003cp\u003e\"A man.\"\u003c/p\u003e\n\u003cp\u003e\"Did you see him?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes. But only once. The first time he was here. I knocked on Mr Hale\u0027s door to ask if he needed anything at the grocery store. I was going down to the grocery store, you see . . .\"\u003c/p\u003e\n\u003cp\u003eThe way Katherine Kipp remembers it, she first hears the visitor shouting as she comes out into the hallway and is locking her door. The voice is a trained voice, an actor\u0027s voice, an opera singer\u0027s voice, a radio announcer\u0027s voice, something of that sort, thundering through the closed door to Mr Hale\u0027s apartment and roaring down the hallway.\u003c/p\u003e\n\u003cp\u003eShe can make out words as she approaches the door to 3A. Mr Hale\u0027s visitor is shouting something about the chance of a lifetime. He is telling Mr Hale that only a fool would pass up this opportunity, this is something that is coming his way by sheer coincidence, he should thank his lucky stars. You can make millions, the man shouts. You\u0027re being a goddamn jackass!\u003c/p\u003e\n\u003cp\u003eShe is standing just outside Mr Male\u0027s door now.\u003c/p\u003e\n\u003cp\u003eShe is almost afraid of knocking, the man sounds so violent. At the same time, she is afraid not to knock. Suppose he does something to Mr Hale? He sounds apoplectic. Suppose he hurts Mr Hale?\u003c/p\u003e\n\u003cp\u003eThe voice stops abruptly the moment she knocks on the door.\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Mr Hale? It\u0027s me. Katherine Kipp.\"\u003c/p\u003e\n\u003cp\u003e\"Just a second, Mrs Kipp.\"\u003c/p\u003e\n\u003cp\u003eThe door opens. Mr Hale is wearing a cardigan sweater over an open-throat shirt and corduroy trousers. The man sitting at the kitchen table is drinking a cup of coffee.\u003c/p\u003e\n\u003cp\u003e\"Do you know Mr Hale\u0027s son-in-law?\" Kling asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, I do.\"\u003c/p\u003e\n\u003cp\u003e\"Was that who the man was?\"\u003c/p\u003e\n\u003cp\u003e\"Oh no.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know who the man was?\"\u003c/p\u003e\n\u003cp\u003e\"No. Well, I\u0027d recognize him if I saw him again. But no, I don\u0027t know him.\"\u003c/p\u003e\n\u003cp\u003e\"Mr Hale didn\u0027t introduce him or anything?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d he look like?\" Kling asked.\u003c/p\u003e\n\u003cp\u003eWalter Hopwell worked with at least a dozen other people on the top floor of the church. These people had nothing to do with church hierarchy. Up here, there were no deacons, no trustees, no pastor\u0027s aides, no church secretaries or announcement clerks. Instead, these men and women were all employees hired by Foster to generate the personal publicity, promotion, and propaganda that had kept him in the public eye and the political arena for the past ten years. Except for three young white men and a white woman, all of them were black.\u003c/p\u003e\n\u003cp\u003eHere in Hopwell\u0027s small private office, a room hung with photographs of Malcolm X, Martin Luther King, and Nelson Mandela, its windows dripping rainsnakes, Carella and Meyer talked to Hopwell while Fat Ollie stood by with a somewhat supercilious smirk on his face, as if certain that the man they were questioning was an ax murderer at best or a serial killer at worst. Hopwell looked like neither. A slender man with finely sculpted features and a head shaved as bald as Meyer\u0027s, he wore black jeans, a black turtleneck sweater, and a fringed suede vest. A small gold earring pierced his left ear lobe. Ollie figured this was some kind of signal to other faggots. Or was that the right ear?\u003c/p\u003e\n\u003cp\u003e\"Danny Nelson was killed yesterday morning, did you know that?\" Carella asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, I saw it on television,\" Hopwell said.\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you happen to know him?\" Meyer asked.\u003c/p\u003e\n\u003cp\u003e\"He did some work for me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"What kind of work?\" Carella asked.\u003c/p\u003e\n\u003cp\u003e\"Research,\" Hopwell said.\u003c/p\u003e\n\u003cp\u003eOllie rolled his eyes.\u003c/p\u003e\n\u003cp\u003e\"What sort of research?\" Meyer asked.\u003c/p\u003e\n\u003cp\u003e\"Information on people who\u0027ve been critical of Reverend Foster.\"\u003c/p\u003e\n\u003cp\u003eA fuckin snitch researcher, Ollie thought.\u003c/p\u003e\n\u003cp\u003e\"How long was he doing this for you?\"\u003c/p\u003e\n\u003cp\u003e\"Six months or so.\"\u003c/p\u003e\n\u003cp\u003e\"You knew him for six months?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Came here to the church, did he?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. With his reports.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d you do with these reports?\"\u003c/p\u003e\n\u003cp\u003e\"I used them to combat false rumors and specious innuendoes.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003e\"In our printed material. And in the reverend\u0027s radio addresses.\"\u003c/p\u003e\n\u003cp\u003e\"When I met with Danny yesterday morning,\" Carella said, \"he mentioned a card game you\u0027d been in . . .\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\". . . with a man from Houston.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who won a lot of money.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, he did.\"\u003c/p\u003e\n\u003cp\u003e\"Did you have a conversation with this man afterward?\"\u003c/p\u003e\n\u003cp\u003e\"We had a drink together, yes. And shared some conversation.\"\u003c/p\u003e\n\u003cp\u003e\"Did he mention having killed someone?\"\u003c/p\u003e\n\u003cp\u003eGee, that\u0027s subtle, Ollie thought.\u003c/p\u003e\n\u003cp\u003e\"No, he didn\u0027t say he\u0027d killed anyone.\"\u003c/p\u003e\n\u003cp\u003e\"What did he say?\"\u003c/p\u003e\n\u003cp\u003e\"Am I getting involved in something here?\" Hopwell asked.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re trying to locate this man,\" Meyer said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see how I can help you do that.\"\u003c/p\u003e\n\u003cp\u003e\"We understand you know where he is.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Danny said you know this man\u0027s name . . .\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I do.\"\u003c/p\u003e\n\u003cp\u003e\". . . and where he\u0027s staying.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I know where he was on Saturday night. I don\u0027t know if he\u0027s there now. I haven\u0027t seen him since last Saturday night.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s his name?\" Carella asked.\u003c/p\u003e\n\u003cp\u003e\"John Bridges was what he told me.\"\u003c/p\u003e\n\u003cp\u003e\"Where was he staying? Where\u0027d you go that night?\"\u003c/p\u003e\n\u003cp\u003e\"The President Hotel. Downtown. On Jefferson.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d he look like? Describe him.\"\u003c/p\u003e\n\u003cp\u003e\"A tall man, six two or three, with curly black hair and pale, blue-green eyes. Wide shoulders, narrow waist, a lovely grin,\" Hopwell said, and grinned a lovely grin himself.\u003c/p\u003e\n\u003cp\u003e\"White or black?\"\u003c/p\u003e\n\u003cp\u003e\"A very light-skinned Jamaican,\" Hopwell said. \"With that charming lilt they have, you know? In their speech?\"\u003c/p\u003e\n\u003cp\u003e\"He was white,\" Mrs Kipp said. \"About forty-five, I would say, with dark hair and blue eyes. Big. A big man.\"\u003c/p\u003e\n\u003cp\u003e\"How big?\" Brown asked.\u003c/p\u003e\n\u003cp\u003e\"Very big. About your size,\" she said, appraising him.\u003c/p\u003e\n\u003cp\u003eBrown was six feet two inches tall and weighed in at a buck ninety-five. Some people thought he looked like a cargo ship. For sure, he was not a ballet dancer.\u003c/p\u003e\n\u003cp\u003e\"Any scars, tattoos, other identifying marks?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"None that I noticed.\"\u003c/p\u003e\n\u003cp\u003e\"You said you only saw him the first time he was here. How do you know it was the same man the next two times?\"\u003c/p\u003e\n\u003cp\u003e\"His voice. I recognized his voice. He had a very distinctive voice. Whenever he got agitated, the voice just boomed out of him.\"\u003c/p\u003e\n\u003cp\u003e\"Was he agitated the next two times as well?\"\u003c/p\u003e\n\u003cp\u003e\"Oh dear yes.\"\u003c/p\u003e\n\u003cp\u003e\"Shouting again?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\"\u003c/p\u003e\n\u003cp\u003e\"Well, the same thing again, it seemed to me. He kept yelling that Mr Hale was a goddamn fool, or words to that effect. Told him he was offering real money here, and there\u0027d be more to come down the line . . .\"\u003c/p\u003e\n\u003cp\u003e\"More money to come?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Down the line.\"\u003c/p\u003e\n\u003cp\u003e\"More money later on?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Year after year, he said.\"\u003c/p\u003e\n\u003cp\u003e\"What was it he wanted?\" Brown asked.\u003c/p\u003e\n\u003cp\u003e\"I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"But you got the impression . . .\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\". . . that Mr Hale had something this man wanted.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes. Very definitely.\"\u003c/p\u003e\n\u003cp\u003e\"That this man had come to see Mr Hale three times in a row . . .\"\u003c/p\u003e\n\u003cp\u003e\"Well, not in a row. He came once at the beginning of September, again around the fifteenth, and the third time about a week later.\"\u003c/p\u003e\n\u003cp\u003e\"To make an offer for whatever it was Mr Hale had.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Three times.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Was my impression from what I heard.\"\u003c/p\u003e\n\u003cp\u003e\"And Mr Hale kept refusing to give him whatever this was.\"\u003c/p\u003e\n\u003cp\u003e\"Told the man to stop bothering him.\"\u003c/p\u003e\n\u003cp\u003e\"How did the man react to this?\"\u003c/p\u003e\n\u003cp\u003e\"He threatened Mr Hale.\"\u003c/p\u003e\n\u003cp\u003e\"When was this?\"\u003c/p\u003e\n\u003cp\u003e\"The last time he was here.\"\u003c/p\u003e\n\u003cp\u003e\"Which was when? Can you give us some idea of the date?\"\u003c/p\u003e\n\u003cp\u003e\"I know it was a holiday.\"\u003c/p\u003e\n\u003cp\u003eBrown was already looking at his calendar.\u003c/p\u003e\n\u003cp\u003e\"Not Labor Day,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No, no, much later.\"\u003c/p\u003e\n\u003cp\u003e\"Only other holiday in September was Yom Kippur.\"\u003c/p\u003e\n\u003cp\u003e\"Then that\u0027s when it was,\" Mrs Kipp said.\u003c/p\u003e\n\u003cp\u003e\"September twentieth.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the last time he came here.\"\u003c/p\u003e\n\u003cp\u003eThe room went silent. Again, as Mrs Kipp had promised, they could hear all the noises of the building, unseen, secret, almost furtive. In the silence, they became aware again of the baneful stink from the pot boiling on the kitchen stove.\u003c/p\u003e\n\u003cp\u003e\"And you say he threatened Mr Hale?\" Brown asked.\u003c/p\u003e\n\u003cp\u003e\"Told him he\u0027d be sorry, yes. Said they\u0027d get what they wanted one way or another.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027They\u0027? Was that the word he used? \u0027They\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Pardon?\"\u003c/p\u003e\n\u003cp\u003e\"\u0027They\u0027d\u0027 get what they wanted?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I\u0027m pretty sure he said \u0027they.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"What was it he wanted?\" Brown said again.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m sure I don\u0027t know,\" Mrs Kipp said, and got up to go stir her pot again.\u003c/p\u003e\n\u003cp\u003e\"Danny told me this man was boasting about having received five grand,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"Oh, I think he was making all that up,\" Hopwell said.\u003c/p\u003e\n\u003cp\u003e\"Making what up?\"\u003c/p\u003e\n\u003cp\u003e\"The five thousand dollars.\"\u003c/p\u003e\n\u003cp\u003e\"Why would he do that?\"\u003c/p\u003e\n\u003cp\u003e\"To impress me.\"\u003c/p\u003e\n\u003cp\u003e\"Told you somebody had given him five thousand dollars . . .\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes, but he was making it up.\"\u003c/p\u003e\n\u003cp\u003e\"Five thousand dollars to kill somebody.\"\u003c/p\u003e\n\u003cp\u003e\"No, he didn\u0027t say that.\"\u003c/p\u003e\n\u003cp\u003e\"What did he say?\"\u003c/p\u003e\n\u003cp\u003e\"I hardly remember. We were drinking a lot.\"\u003c/p\u003e\n\u003cp\u003e\"Did he tell you there was an old man . . .\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who had something somebody else wanted . . .\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes, but that was all make-believe.\"\u003c/p\u003e\n\u003cp\u003e\"The old man was make-believe?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I think so.\"\u003c/p\u003e\n\u003cp\u003e\"Someone wanting him dead was make-believe?\"\u003c/p\u003e\n\u003cp\u003e\"John had an active imagination.\"\u003c/p\u003e\n\u003cp\u003e\"Someone willing to pay five thousand dollars to kill this old man and make it look like an accident . . .\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t believe a word of it.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s what he told you, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, to impress me.\"\u003c/p\u003e\n\u003cp\u003e\"I see. To impress you. Did he give you a strip of roofers when you left the hotel?\"\u003c/p\u003e\n\u003cp\u003e\"As a matter of fact, he did. But roofers aren\u0027t a controlled substance.\"\u003c/p\u003e\n\u003cp\u003e\"Mr Hopwell, if I told you that an old man was drugged with Rohypnol and later hanged to make it look like a suicide, would you still believe John Bridges was trying to impress you when he told you he\u0027d been paid five thousand . . .\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t say exactly that. You\u0027re putting words in my mouth.\"\u003c/p\u003e\n\u003cp\u003eWhat\u0027d he put in your mouth? Ollie wondered.\u003c/p\u003e\n\u003cp\u003e\"What did he say, exactly?\" Meyer asked.\u003c/p\u003e\n\u003cp\u003e\"He was telling a story. He was saying suppose a person had been offered a certain amount of money . . .\"\u003c/p\u003e\n\u003cp\u003e\"Five thousand dollars.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, he mentioned that sum. But it was all supposition. He was making up a story.\"\u003c/p\u003e\n\u003cp\u003e\"A story about someone who was offered five grand to kill someone . . .\"\u003c/p\u003e\n\u003cp\u003e\"He never used that word. He never said the word \u0027kill.\u0027 I\u0027d have been out of there in a minute. He was just bragging. To impress me.\"\u003c/p\u003e\n\u003cp\u003e\"What word did he use?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but it wasn\u0027t the word \u0027kill,\u0027 he never said anything about killing anyone. Listen, who remembers what he said? We were drinking a lot.\"\u003c/p\u003e\n\u003cp\u003e\"And smoking a lot of pot, too, is that right?\"\u003c/p\u003e\n\u003cp\u003e\"Well, a little.\"\u003c/p\u003e\n\u003cp\u003e\"Which is a controlled substance.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you ever smoked pot, Detective?\"\u003c/p\u003e\n\u003cp\u003e\"Did he mention any names?\" Meyer asked.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t say which old man he\u0027d been hired to . . .\"\u003c/p\u003e\n\u003cp\u003e\"It was just a story.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t say who had hired him to kill this old man?\"\u003c/p\u003e\n\u003cp\u003e\"A good story, that was all.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t say who had given him the five grand he later used as his stake in the poker game . . .\"\u003c/p\u003e\n\u003cp\u003e\"He was just a terrific storyteller,\" Hopwell said.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t think you should call the police after you heard this terrific story, huh?\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"No, I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you read the papers, Mr Hopwell?\"\u003c/p\u003e\n\u003cp\u003e\"Only for items about the reverend.\"\u003c/p\u003e\n\u003cp\u003e\"How about television? Don\u0027t you watch television?\"\u003c/p\u003e\n\u003cp\u003e\"Again, only to . . .\"\u003c/p\u003e\n\u003cp\u003e\"So when John Bridges told you he\u0027d been paid five thousand dollars to kill an old man and make it look like . . .\"\u003c/p\u003e\n\u003cp\u003e\"He never used the word \u0027kill.\u0027 I told you that.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever word or words he used, you never made a connection between what he was saying and a man named Andrew Hale, who\u0027d been all over television that week?\"\u003c/p\u003e\n\u003cp\u003e\"Never. I still don\u0027t make any connection. I don\u0027t know anything about this old man you say was killed. Look, I told you John\u0027s name, I told you where he was staying. If he did something wrong, you\u0027ll have to take that up with him.\"\u003c/p\u003e\n\u003cp\u003e\"What else can you tell us about him?\"\u003c/p\u003e\n\u003cp\u003e\"He had a scar down the left-hand side of his face.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of scar?\"\u003c/p\u003e\n\u003cp\u003e\"It looked like a knife scar.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re just remembering a knife scar?\" Ollie said. \"Guy has a fuckin knife scar on his face, and it\u0027s the last thing you mention about him?\"\u003c/p\u003e\n\u003cp\u003e\"I try not to notice deformities or infirmities,\" Hopwell said.\u003c/p\u003e\n\u003cp\u003e\"Do you remember any other deformities or infirmities?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"How about identifying marks or tattoos? Like a mole, for example, or a birth . . .\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes, a tattoo,\" Hopwell said, and hesitated. \"A blue star on the head of his penis.\"\u003c/p\u003e\n\u003cp\u003eThere was no one named John Bridges registered at the President Hotel. Nor had there been anyone registered under that name on the night of November sixth. When they gave the manager the description Hopwell had given them, he said he couldn\u0027t recall anyone who\u0027d looked or sounded Jamaican, but this was a big hotel with thousands of guests weekly, and it was possible there\u0027d been any number of Jamaicans registered on the night in question.\u003c/p\u003e\n\u003cp\u003eThey checked the register for anyone from Houston, Texas. There\u0027d been a guest from Fort Worth who\u0027d checked in on the fourth and out the next night, and another from Austin, who was here with his wife and two kids; they did not bother him. Their computer showed no outstanding warrants for anyone named John Bridges. Neither was anyone listed under that name in the Houston telephone directory.\u003c/p\u003e\n\u003cp\u003eCarella called Houston Central and talked to a man who identified himself as Detective Jack Walman. He told Carella he\u0027d been a cop for almost twelve years now and knew most of the people doing mischief ir this town, but he\u0027d never run across one had a knife scar down the left-hand side of his face and a blue stai tattooed on his pecker.\u003c/p\u003e\n\u003cp\u003e\"That does beat all,\" he said. \"What\u0027s the star stand for? The lone star state?\"\u003c/p\u003e\n\u003cp\u003e\"Could be,\" Carella said.\u003c/p\u003e\n\u003cp\u003e\"What I\u0027ll do,\" he said, \"I\u0027ll run it through the computer. But that\u0027s an unusual combination, ain\u0027t it. and I\u0027d sure remember something peculiar like that il I\u0027d ever seen it. Unless, what coulda happened, he mighta got the knife scar before he got the tattoo. Lots of these guys get jailhouse tattoos, you know. In which case, there wouldn\u0027t be both of them on the computer, you follow? We get plenty knife scars down here. Is your man Chicano?\"\u003c/p\u003e\n\u003cp\u003e\"No. A Jamaican named John Bridges.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we got something like two thousand Jamaicans here, too, so who knows? What\u0027d he do, this dude?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe killed two people.\"\u003c/p\u003e\n\u003cp\u003e\"Bad, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Bad, yes.\"\u003c/p\u003e\n\u003cp\u003e\"Musta hurt, don\u0027t you think?\" Walman said. \"Gettin tattooed that way?\"\u003c/p\u003e\n\u003cp\u003eHe called back an hour later to say he\u0027d searched the system - city and state - for any felon named John Bridges and had come up blank. As he\u0027d mentioned earlier, there were plenty facial scars in the state of Texas, and if Carella wanted him to fax printouts on each and every felon who had one, he\u0027d be happy to oblige. But none of the facial scars came joined to tattooed dongs. One of the old-timers here at the station, though, remembered a guy one time had a little American flag tattooed on his wiener, if that was any help, it waved in the breeze whenever he got an erection. But he thought the guy was doing time at Angola, over Louisiana way. Aside from that, Walman was sorry he couldn\u0027t be of greater assistance. Carella asked him to please fax the facial-scar printouts, and thanked him for his time.\u003c/p\u003e\n\u003cp\u003eThey were right back where they\u0027d been on the morning of October twenty-ninth, when they\u0027d first caught the squeal. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-dance/page-3.html","bookId":2231,"creation":"Oct 5, 2019 11:11:05 PM","modification":"Oct 5, 2019 11:11:05 PM"}
