{"id":99307,"no":4,"title":"Page 4","content":"\u003cp\u003eDervish drives like a madman, a hundred miles an hour. Howling wind. Blurred countryside. No chance to talk or study the scenery. I spend the journey with my face pressed between my uncle\u0027s shoulder blades, clinging on for dear life.\u003c/p\u003e\n\u003cp\u003eFinally, coming to a small village, he slows. I peek and catch the name on a sign as we exit -\u0026nbsp;\u0026nbsp;Carcery Vale.\u003c/p\u003e\n\u003cp\u003e\"Carkerry Vale,\" I murmur.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s pronounced Car-sherry,\" Dervish grunts.\u003c/p\u003e\n\u003cp\u003e\"This is where you live,\" I note, recalling the address from cards I wrote and sent with Mum and Gret. (Mum didn\u0027t like Uncle Dervish but she always sent him a Christmas and birthday card.)\u003c/p\u003e\n\u003cp\u003e\"Actually, I live about two miles beyond,\" Dervish says, carefully overtaking a tractor and waving to the driver. \"It\u0027s pretty lonely out where I am, but there are lots of kids in the village. You can walk in any time you like.\"\u003c/p\u003e\n\u003cp\u003e\"Do they know about me?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Only that you\u0027re an orphan and you\u0027re coming to live with me.\"\u003c/p\u003e\n\u003cp\u003eA winding road. Lots of potholes which Dervish swerves expertly to avoid. The sides of the road are lined with trees. They grow close together, blocking out all but the thinnest slivers of sunlight. Dark and cold. I press closer to Dervish, hugging warmth from him.\u003c/p\u003e\n\u003cp\u003e\"The trees don\u0027t stretch back very far,\" he says. \"You can skirt around them when you\u0027re going to the village.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not afraid,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"Of course you are,\" he chuckles, then looks back quickly. \"But you have my word - you\u0027ve no need to be.\"\u003c/p\u003e\n\u003cp\u003eChez Dervish. A huge house. Three storeys. Built from rough white blocks, almost as big as those I\u0027ve seen in photos of the pyramids. Shaped like an L. The bit sticking out at the end is made from ordinary red bricks and doesn\u0027t look like the rest of the house. Lots of timber decorations around the top and down the sides. A slate roof with three enormous chimneys. The roof on the brick section is flat and the chimney\u0027s tiny in comparison with the others. The windows on the lower floor run from the ground to the ceiling. The windows on the upper floors are smaller, round, and feature stained glass designs. On the brick section they\u0027re very ordinary.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not much,\" Dervish says wryly, \"but it\u0027s home.\"\u003c/p\u003e\n\u003cp\u003e\"This place must have cost a fortune!\" I gasp, standing close to the motorbike, staring at the house, almost afraid to venture any nearer.\u003c/p\u003e\n\u003cp\u003e\"Not really,\" Dervish says. \"It was a wreck when I bought it. No roof or windows, the interior destroyed by exposure to the elements. The lower floor was used by a local farmer to house pigs. I lived in the brick extension for years while I restored the main building. I keep meaning to tear the extension down - I don\u0027t use it any more, and it takes away from the main structure - but I never seem to get round to it.\"\u003c/p\u003e\n\u003cp\u003eDervish removes his helmet, helps me out of mine, then walks me around the outside of the house. He explains about the original architect and how much work he had to do to make the house habitable again, but I don\u0027t listen very closely. I\u0027m too busy assessing the mansion and the surrounding terrain - lots of open fields, sheep and cattle in some of them, a small forest to the west which runs all the way to Carcery Vale, no neighbouring houses that I can see.\u003c/p\u003e\n\u003cp\u003e\"Do you live here alone?\" I ask as we return to the front of the house.\u003c/p\u003e\n\u003cp\u003e\"Pretty much,\" Dervish says. \"One farmer owns most of this land, and he\u0027s opposed to overdevelopment. He\u0027s old. I guess his children will sell plots off when he dies. But for the last twenty years I\u0027ve had all the peace and seclusion a man could wish for.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t it get lonely?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"No,\" Dervish says. \"I\u0027m fairly solitary by nature. When I\u0027m in need of company, it\u0027s only a short stroll to the village. And I travel a lot - I\u0027ve many friends around the globe.\"\u003c/p\u003e\n\u003cp\u003eWe stop at the giant front doors, a pair of them, like the entrance to a castle. No doorbell - just two chunky gargoyle-shaped knockers, which I eye apprehensively.\u003c/p\u003e\n\u003cp\u003eDervish doesn\u0027t open the doors. He\u0027s studying me quietly.\u003c/p\u003e\n\u003cp\u003e\"Have you lost the key?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have to enter,\" he says. \"I think you\u0027ll grow to love this place after a while, but it\u0027s a lot to take in at the start. If you\u0027d prefer, you could stay in the brick extension - it\u0027s an eyesore, but cosy inside. Or we can drive to the Vale and you can spend a few nights in a B\u0026amp;B until you get your bearings.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s tempting. If the house is even half as spooky on the inside as it looks from out here, it\u0027s going to be hard to adapt to. But if I don\u0027t move in now, I\u0027m sure the house will grow far creepier in my imagination than it can ever be in real life.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" I grin weakly, lifting one of the gargoyle knockers and rapping loudly. \"We look like a pair of idiots, standing out here. Let\u0027s go in.\"\u003c/p\u003e\n\u003cp\u003eCold inside but brightly lit. No carpets - all tiles or stone floors - but many rugs and mats. No wallpaper - some of the walls are painted, others just natural stone. Chandeliers in the main hall and dining room. Wall-set lamps in the other rooms.\u003c/p\u003e\n\u003cp\u003eBookcases everywhere, most of them filled. Chess boards too, in every room - Dervish must be as keen on chess as Mum and Dad. Ancient weapons hang from many of the walls - swords, axes, maces.\u003c/p\u003e\n\u003cp\u003e\"For when the tax collector calls,\" Dervish says solemnly, lifting down one of the larger swords. He swings it over his head and laughs.\u003c/p\u003e\n\u003cp\u003e\"Can I try it?\" I ask. He hands it to me. \"Bloody hell!\" It\u0027s H-E-A-V-Y. I can lift it to thigh level but no higher. A quick reappraisal of Uncle Dervish - he looks wiry as a rat, but he must have hidden muscles under all the denim.\u003c/p\u003e\n\u003cp\u003eWe meander through the downstairs rooms, Dervish explaining what each was used for in the past, pointing out items of special interest, such as a stuffed bear\u0027s head which is more than two hundred years old, a cage where a live vulture was kept, rusty nails which were used by the Romans to crucify people.\u003c/p\u003e\n\u003cp\u003eThere\u0027s a large, empty fish tank in one of the main living rooms, set against a wall. Dervish pauses at it and taps the frame with his fingernails. \"The last owner of this place - before it fell into ruin - was a tyrant called Lord Sheftree. He kept live piranhas in this tank. One day, a woman turned up with a baby - she claimed it was his, and she wanted money to pay for its upkeep.\"\u003c/p\u003e\n\u003cp\u003eDervish crouches down and stares into the abandoned aquarium, as though it\u0027s still full of circling, multicoloured fish.\u003c/p\u003e\n\u003cp\u003e\"Lord Sheftree invited her to stay for the night,\" he says calmly. \"While she was sleeping, he crept into her room and removed her baby. Brought it down here and fed it to the piranhas. Took the bones away and buried them. The woman raised almighty hell, but search parties couldn\u0027t find a corpse, and nobody had seen her arrive with a child - so there was no proof she ever had one. She ranted and raved and was eventually locked away in a mental asylum. She hanged herself there.\u003c/p\u003e\n\u003cp\u003e\"Years later, when Lord Sheftree was an old man and his mind was wandering, he boasted about the murder to one of his servants, and told her where the bones were buried. She dug them up and informed the police. They came to arrest him, but the local villagers got here first. He was discovered chopped up into tiny pieces - all of which had been dropped into the piranha tank.\"\u003c/p\u003e\n\u003cp\u003eDervish stops and I gaze at him in silent awe.\u003c/p\u003e\n\u003cp\u003eHe stands and faces me. \"I\u0027m not saying this to scare you,\" he smiles, \"but this house has a long and bloody history. There are dozens of horror stories, none quite as gruesome as that one, but all of them pretty gut-churning. I think it\u0027s best you hear about its past now, from me.\"\u003c/p\u003e\n\u003cp\u003e\"Is... is the house haunted?\" I wheeze.\u003c/p\u003e\n\u003cp\u003e\"No,\" he answers seriously. \"It\u0027s safe. I wouldn\u0027t have brought you here if it wasn\u0027t. If the nightmares of the past prove too oppressive, you\u0027re free to leave. But you\u0027ve nothing to fear in the present.\"\u003c/p\u003e\n\u003cp\u003eI nod slowly, thinking about Lord Sheftree and his piranha, wondering if I have the courage to spend the night in a house like this.\u003c/p\u003e\n\u003cp\u003e\"Are you OK?\" Dervish asks. \"Would you like to step outside for fresh air?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" I mutter, turning my back on the fish tank, acting like I hear this sort of stuff all the time. \"What\u0027s upstairs?\"\u003c/p\u003e\n\u003cp\u003eMostly bedrooms on the first floor. All are fully fitted, the beds freshly made, though Dervish says only four or five of the rooms have been used since he renovated the mansion.\u003c/p\u003e\n\u003cp\u003e\"Why bother with all the beds then?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"If something\u0027s worth doing, it\u0027s worth doing right,\" he laughs.\u003c/p\u003e\n\u003cp\u003eSome of the beds are four-posters, imported from foreign countries, with histories as old and macabre as the house. It\u0027s only when Dervish is telling me about one particular bed, in which a French aristocrat hid for four months during the Revolution, that I think about how much they must have cost.\u003c/p\u003e\n\u003cp\u003e\"What do you do?\" I ask my uncle. It sounds ridiculous, but I don\u0027t recall Mum or Dad ever mentioning Dervish\u0027s line of work.\u003c/p\u003e\n\u003cp\u003e\"I dabble in antiques,\" he says. \"Rare books are my speciality - particularly books regarding the occult.\"\u003c/p\u003e\n\u003cp\u003eDervish looks at me questioningly - we haven\u0027t mentioned demons since he picked me up at the institute. He\u0027s offering me the chance to quiz him about them now. But I\u0027m not ready to discuss Lord Loss or his minions yet.\u003c/p\u003e\n\u003cp\u003e\"You must be good at it, to afford a place like this,\" I say, sliding away from the larger questions and issues.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a hobby,\" he demurs, leading me down a long corridor full of framed portraits and photographs. \"The money\u0027s good, but I don\u0027t worry too much about it.\"\u003c/p\u003e\n\u003cp\u003e\"Then how do you pay for all this?\" I ask nosily.\u003c/p\u003e\n\u003cp\u003eDervish quickens his pace. I think he\u0027s avoiding the question, but then he stops at one of the older portraits and points at it. \"Recognise him?\"\u003c/p\u003e\n\u003cp\u003eI study the face of an old man - lined, quite a large nose, but otherwise unspectacular. \"Is he famous?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Only to us,\" Dervish says. \"He was your great-great-great-grandfather. Bartholomew Garadex. That\u0027s our original family name, on our paternal side - it got shortened to Grady around your greatgrandfather\u0027s time.\" He points to a nearby portrait. \"That\u0027s him.\" Waving a hand at the hall in general, he adds, \"They\u0027re all part of our family. Garadexes, Gradys, Bells, Moores - if one of our relations has been photographed or painted, you\u0027ll most probably find them here.\"\u003c/p\u003e\n\u003cp\u003eReturning to the portrait of my great-great-great-grandfather, he says, \"Bartholomew was a sublimely clever man. He started with nothing but had amassed a fortune by the time of his death. We\u0027re still living off of it - at least, I am. Cal preferred to make his own way in the world, and only dipped into the family coffers in emergencies.\"\u003c/p\u003e\n\u003cp\u003e\"How much is left?\" I enquire.\u003c/p\u003e\n\u003cp\u003e\"Quite a lot,\" Dervish says vaguely. \"Your great-great-grandfather - one of old Bart\u0027s boys -\u0026nbsp;\u0026nbsp;wasted most of it. Then his son - the one who changed the family name - restored it. It\u0027s been fairly constant since, much of it tied up in bonds and properties which yield steady profits.\"\u003c/p\u003e\n\u003cp\u003e\"Who does it go to when...\" I stop and blush. \"I mean, who\u0027s your heir?\"\u003c/p\u003e\n\u003cp\u003eDervish doesn\u0027t answer immediately. He gazes at the face in the portrait, as though seeing it for the first time. Then he looks away and says quietly, \"I have no children. I\u0027ve willed portions of the estate to various friends and causes. I always meant for the majority of my assets to go to Cal and his kids. Since you\u0027re the only survivor...\"\u003c/p\u003e\n\u003cp\u003eMy stomach tightens - Dervish sounds as if he\u0027s accusing me of caring more about money than my family. \"I\u0027d swap any amount of a fortune if I could bring Mum and Dad and Gret back,\" I snarl.\u003c/p\u003e\n\u003cp\u003e\"Of course you would.\" Dervish frowns, glancing at me oddly, and I realise I was only imagining the accusation.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" Dervish says. \"There\u0027s another floor to explore - and a cellar.\"\u003c/p\u003e\n\u003cp\u003e\"A cellar?\" I ask nervously.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he says. \"That\u0027s where I bury the bodies.\"\u003c/p\u003e\n\u003cp\u003eI freeze, and he has to stop and wink broadly before I catch the joke.\u003c/p\u003e\n\u003cp\u003eLots of storage space on the second floor - rooms packed with crates, statues and boxes of books. There are a couple of small bedrooms, including Dervish\u0027s, and the centrepiece - his study.\u003c/p\u003e\n\u003cp\u003eUnlike every other room in the mansion, Dervish\u0027s study is carpeted and the walls are covered with leather panels. It\u0027s a colossal room, the size of seven or eight of the bedrooms, with two desks larger than most of the beds I\u0027ve seen. There are bookcases, on which small numbers of books are carefully arranged. He has a PC, a laptop, a typewriter, several writing pads and a multitude of pens. There are five chess sets in the room, each different; one made entirely of crystal, another with solid gold pieces. A sword and axe hangs from each wall, their handles encrusted with precious jewels, their blades gleaming brightly.\u003c/p\u003e\n\u003cp\u003e\"This is wild,\" I grin, circling the study, checking out some of the book titles - all to do with ghosts, werewolves, magic and other occult-related items.\u003c/p\u003e\n\u003cp\u003e\"Some of my rarer finds,\" Dervish says, picking up a book and smiling as he flicks through it. \"The great thing about having loads of money is not having to sell to survive.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you afraid of burglars?\" I ask. \"Wouldn\u0027t this stuff be safer in a museum?\"\u003c/p\u003e\n\u003cp\u003e\"The contents of this room are protected,\" he says. \"Anyone breaking in is free to plunder the rest of the house as they please - but they won\u0027t take anything from here.\"\u003c/p\u003e\n\u003cp\u003e\"What sort of security system do you use?\" I ask. \"Lasers? Heat sensors?\"\u003c/p\u003e\n\u003cp\u003e\"Magic.\"\u003c/p\u003e\n\u003cp\u003eI start to smirk, thinking this is another of his jokes, but his grim expression unnerves me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve cast some of my strongest spells on this room,\" he says. \"Anybody who enters without my permission will run into serious obstacles. And I don\u0027t use that phrase lightly.\"\u003c/p\u003e\n\u003cp\u003eDervish sits in the large leather chair behind one of the desks and rocks lightly to the left and right as he addresses me. \"I know there\u0027s nothing as tempting as forbidden fruit, Grubitsch, but I\u0027ve got to ask you not to come into this room when I\u0027m not here. There are spells I can cast to protect you - and spells I can teach you when you\u0027re ready to learn - but it\u0027s safest not to tempt fate.\"\u003c/p\u003e\n\u003cp\u003e\"Are you...\" I have to wet my lips to continue. \"Are you a magician?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he chuckles. \"But I know many of the ways of magic. Bartholomew Garadex was a magician - among other things - but there hasn\u0027t been one in the family since. Real magicians are rare. You can\u0027t become one - you have to be born to it. Ordinary people like you and me can study magic and make it work to an extent, but true magicians have the natural power to change the shape of the world with a click of their fingers. It wouldn\u0027t do to have too many people with that kind of power walking around. Nature limits us to one or two per century.\"\u003c/p\u003e\n\u003cp\u003e\"Is...\" I hate to say his name out loud, but I must. \"Is Lord Loss a magician?\"\u003c/p\u003e\n\u003cp\u003eDervish\u0027s eyes are dark. \"No. He\u0027s a demon master. He\u0027s as far advanced of magicians as magicians are of the rest of us.\"\u003c/p\u003e\n\u003cp\u003e\"When I... was escaping... I used magic.\"\u003c/p\u003e\n\u003cp\u003e\"To fit through the dog flap.\" He nods. \"Many of us have magical potential. It usually lies dormant, but the presence of the demons enabled you to tap into yours. The magic within you reacted to theirs. Without it, you would have died, along with the others.\"\u003c/p\u003e\n\u003cp\u003eI stare wordlessly at Uncle Dervish. He speaks so honestly, so matter of factly, that he could be explaining a math problem. There\u0027s so much I want to ask, so many questions. But this isn\u0027t the time. I\u0027m not ready.\u003c/p\u003e\n\u003cp\u003eI scratch my head and pluck a long ginger hair from behind my left ear. I rub it between my fingers until it falls, then face Dervish and grin shakily. \"I\u0027ll agree to stay out of your study if you\u0027ll do something for me in return.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" he asks, and I can tell he\u0027s expecting an overbearing request.\u003c/p\u003e\n\u003cp\u003e\"Will you call me \u0027Grubbs\u0027? I can\u0027t stand \u0027Grubitsch\u0027.\"\u003c/p\u003e\n\u003cp\u003eThe cellar\u0027s full of wine racks and dusty bottles.\u003c/p\u003e\n\u003cp\u003e\"My other great love, apart from books,\" Dervish purrs, wiping clean the label of a large green bottle. He advances, lights flicking on ahead of him as he walks. I wonder if it\u0027s magic, until I spot motion-detection sensors overhead.\u003c/p\u003e\n\u003cp\u003e\"Do you drink wine?\" he asks, leading me down one of the many rack-lined aisles of the cellar.\u003c/p\u003e\n\u003cp\u003e\"Mum and Dad let us have a glass with dinner sometimes, but I don\u0027t really like it,\" I answer.\u003c/p\u003e\n\u003cp\u003e\"Shocking!\" he tuts. \"I\u0027ll have to educate your palate. Wine is as varied and unpredictable as people. There are some vintages you just won\u0027t get on with, no matter how famous or popular they are, but you\u0027ll always find something you like - if you search hard enough.\"\u003c/p\u003e\n\u003cp\u003eHe stops, picks out another bottle, appraises and replaces it. \"I roam around for hours down here some days,\" he sighs. \"Half the pleasure of having such a fine collection is forgetting what\u0027s here and rediscovering it by accident years later. The choosing of a bottle can be almost as much fun as the drinking of it.\" He snorts. \"Almost!\"\u003c/p\u003e\n\u003cp\u003eWe return to the steps leading up to the kitchen and he pauses. \"I have to ask you not to come down here either,\" he says. \"But this has nothing to do with spells or magic. The temperature and humidity have to be maintained just so.\" He pinches his left thumb and index finger together. \"I\u0027m fairly easy-going when it comes to material possessions, but where my wine\u0027s concerned I\u0027m unbelievably cranky. If you caused an accident...\" He shook his head glumly. \"I wouldn\u0027t say much, but I\u0027d silently despise you forever.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll steer clear,\" I laugh. \"The off-licence will do for me if I want to go boozing.\"\u003c/p\u003e\n\u003cp\u003eDervish smiles and leads the way up. The lights switch off automatically behind us, plunging the cellar into cool, precision gloom.\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s it.\"\u003c/p\u003e\n\u003cp\u003eBack where we started, the main hall, beneath the giant chandelier. Dervish checks his watch. \"I usually have dinner anywhere between five and seven. You can eat with me - I\u0027m a nifty little chef, if I do say so myself - or do your own cooking and feed whenever you like. The freezer\u0027s stocked with pizzas and microwave dinners.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll eat with you,\" I tell him.\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll shout when it\u0027s ready. In the meantime, feel free to explore, either inside or out. And remember - you can\u0027t come to any harm here.\"\u003c/p\u003e\n\u003cp\u003eHe heads for the wide set of marble stairs leading to the first and second floors.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" I stop him. \"You never showed me my room.\"\u003c/p\u003e\n\u003cp\u003eDervish slaps his forehead playfully. \"You\u0027ll get used to that,\" he chuckles. \"I\u0027m forever overlooking the obvious. Well, there are fourteen bedrooms to choose from - any except mine is yours for the taking.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have a room set aside for me?\" I ask, surprised.\u003c/p\u003e\n\u003cp\u003e\"I thought about it,\" he replies, \"but I decided to let you choose for yourself. You can test out as many as you like. If you want to stay on the upper floor, close to me, you can - though the rooms there are quite modest compared to those on the first floor.\"\u003c/p\u003e\n\u003cp\u003eHe tips an imaginary hat to me, then trots up the stairs to his study.\u003c/p\u003e\n\u003cp\u003eStanding alone in the vast hall. The house creaks around me. I shiver, then recall Uncle Dervish\u0027s promise - I can\u0027t come to any harm here. I shake off the creeps before they have a chance to take hold.\u003c/p\u003e\n\u003cp\u003ePicking up my bag, which I dropped by the front doors when we came in, I climb the ornate stairs and go searching among the beautifully kept, expansive array of rooms for one that I can dump my gear in and call my own. \u003c/p\u003e","sourceLink":"https://allnovel.net/lord-loss-the-demonata-1/page-4.html","bookId":2175,"creation":"Oct 5, 2019 6:41:32 PM","modification":"Oct 5, 2019 6:41:32 PM"}
