{"id":74606,"no":25,"title":"Page 25","content":"\u003cp\u003eBlaire\u003c/p\u003e\n\u003cp\u003eI didn\u0027t require more than a full size bed. However, Rush refused to get anything less than a king size bed, two bedside tables and a matching dresser with a gorgeous mirror. I made the mistake of looking too long at a pretty lavender quilt and matching shams. Before I knew what was happening he was buying the entire bed set complete with sheets and new pillows. I argued with him the entire time but he acted like I wasn\u0027t talking. He just winked at me and kept placing his orders and giving the salesman directions.\u003c/p\u003e\n\u003cp\u003eBy the time we got back from eating dinner, which he also was determined to feed me, the furniture was already being delivered. Bethy was standing at the door smiling when we drove up. She was loving this.\u003c/p\u003e\n\u003cp\u003e\"Thank you for letting me do that today. I needed it. You may not understand but I needed to do that,\" Rush said before I opened the car door.\u003c/p\u003e\n\u003cp\u003eI glanced back at him. \"You needed to buy me an entire bedroom suite and expensive bedding?\" I asked, confused.\u003c/p\u003e\n\u003cp\u003e\"Yeah, I did.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t understand but I nodded. If he needed to do it then I was going to appreciate it. I still couldn\u0027t believe it was all mine. I was going to feel like a princess in my room. \"Well, thank you for all of it. I wasn\u0027t expecting anything more than a mattress. I wasn\u0027t prepared to be spoiled.\"\u003c/p\u003e\n\u003cp\u003eRush leaned forward and pressed a kiss beside my ear. \"That\u0027s not even close to spoiling you. But I intend to show you exactly what spoiling is.\"\u003c/p\u003e\n\u003cp\u003eI shivered and squeezed the door handle. I wasn\u0027t going to let him buy me anything else. I had to stop this but the kisses around my ear made it hard to focus.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go see how it looks,\" he said as he leaned back.\u003c/p\u003e\n\u003cp\u003eSpace. Had to get some space. I was ready to jump on him right now. Not a good thing. Control. The pregnancy hormones wanted to take over.\u003c/p\u003e\n\u003cp\u003eRush was running around the front of the Rover when I opened my door and started to get out. He was in front of me taking my hands and helping me down like I was helpless before I could make a move to get down on my own.\u003c/p\u003e\n\u003cp\u003e\"I can get out myself you know,\" I told him.\u003c/p\u003e\n\u003cp\u003eHe smirked. \"Yeah but what\u0027s the fun in that?\"\u003c/p\u003e\n\u003cp\u003eLaughing, I pushed past him and made my way toward Bethy who was watching us like we were one of her favorite television dramas.\u003c/p\u003e\n\u003cp\u003e\"Looks like the Pottery Barn decided to unload their latest shipment in your bedroom,\" Bethy said, grinning like a kid in a candy store. \"Can I sleep with you in that big ass bed tonight? The mattress is unbelievable!\"\u003c/p\u003e\n\u003cp\u003e\"No. She needs her rest. No bed buddies,\" Rush said, walking up behind me and wrapping a protective arm around my waist.\u003c/p\u003e\n\u003cp\u003eBethy\u0027s eyes dropped to my waist and then back up at Rush. \"You know,\" she said, looking very pleased.\u003c/p\u003e\n\u003cp\u003e\"Yes I do,\" he replied. He tensed up behind me.\u003c/p\u003e\n\u003cp\u003eI felt horrible. One more person that I had told about my pregnancy before I told him. He had every right to be hurt. I was a liar. Would he figure this out and leave me now?\u003c/p\u003e\n\u003cp\u003e\"Good,\" Bethy said and stepped out of the way so we could walk inside.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you go make sure they\u0027re putting everything where you want it,\" Rush said to me when we got inside.\u003c/p\u003e\n\u003cp\u003e\"Good idea.\" I left him there to go check on the furniture. If he was mad at me he would have time to cool off.\u003c/p\u003e\n\u003cp\u003eThe delivery guys were doing a good job with placement so I didn\u0027t bother them. I was happy with where they were putting things. Walking back to the living room I heard Bethy whispering and I stopped.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s better. She\u0027s been sick a good bit but the past two mornings she\u0027s hasn\u0027t thrown up.\"\u003c/p\u003e\n\u003cp\u003e\"You call me the second she even looks like she might get sick.\" Rush even managed to make his whisper sound like a demand.\u003c/p\u003e\n\u003cp\u003e\"Yeah, I\u0027ll call you. I wasn\u0027t for the whole \u0027don\u0027t tell Rush\u0027 idea. You did this to her. You need to be there for her.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going anywhere,\" he replied.\u003c/p\u003e\n\u003cp\u003e\"You better not.\"\u003c/p\u003e\n\u003cp\u003eRush chuckled, \"If she won\u0027t live with me then at least she has you protecting her.\"\u003c/p\u003e\n\u003cp\u003e\"Damn straight. Don\u0027t think I won\u0027t help her disappear if you fuck this up again. You hurt her and she\u0027ll leave.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll never hurt her again.\"\u003c/p\u003e\n\u003cp\u003eMy chest ached. I wanted to believe him. I wanted to trust him. This was our baby. There was so much that was hard to forgive but I needed to learn how. I did love him. I was sure I always would.\u003c/p\u003e\n\u003cp\u003eI walked into the room and smiled. \"They\u0027re putting things right where I want them.\"\u003c/p\u003e\n\u003cp\u003eRush reached over and pulled me into his arms. He was doing that a lot lately. He didn\u0027t say anything. He just held me. Bethy left the room and I wrapped my arms around him and we stood there like that for a long time. It was the first time I didn\u0027t feel alone in a very long time.\u003c/p\u003e\n\u003cp\u003eRush hadn\u0027t asked to stay the night. I was kind of surprised. He hadn\u0027t even done anything other than kiss me before he left. That hadn\u0027t done much to cool off my dreams. I woke up once again right before an orgasm, very frustrated. I threw back my covers and sat up. I had lunch shift again today.\u003c/p\u003e\n\u003cp\u003eI\u0027d called Woods last night and apologized about running out on him but he understood and asked me if things were okay. Rush had stood there listening to everything I said so I\u0027d been in a hurry to get off the phone. I would get Woods alone today and talk to him. He was being very understanding.\u003c/p\u003e\n\u003cp\u003eHe did have me in the dining room the rest of the week. The only day he had me on the course was Saturday because of the tournament. Everyone would be expected to work outside.\u003c/p\u003e\n\u003cp\u003eWhen I finally made my way to the kitchen I was greeted with a box of donuts. A small note was attached to the top. Smiling, I picked it up and read.\u003c/p\u003e\n\u003cp\u003eMissed you last night. I couldn\u0027t eat these alone. Hope things are better. Love, Jimmy.\u003c/p\u003e\n\u003cp\u003eCrap! I\u0027d forgotten about the donut date. Another person I needed to apologize to. But first, I wanted some milk and donuts. \u003c/p\u003e","sourceLink":"https://allnovel.net/never-too-far-too-far-2/page-25.html","bookId":1994,"creation":"Oct 5, 2019 10:31:58 AM","modification":"Oct 5, 2019 10:31:58 AM"}
