{"id":77419,"no":16,"title":"Page 16","content":"\u003cp\u003eLetting go of his hand, Beatrix turned her attention back to the conversation, which had progressed to the subject of Rohan\u0027s latest investment.\u003c/p\u003e\n\u003cp\u003eIt had become something of a game to Rohan to find an investment opportunity that wouldn\u0027t succeed. The last time he had tried it, he had bought a London rubber manufactory that was failing badly. As soon as Cam purchased it, however, the company had acquired patent rights for vulcanization and had invented something called the rubber band. And now people were buying millions of the things.\u003c/p\u003e\n\u003cp\u003e\"… this one is sure to be a disaster,\" Cam was saying. \"There is a pair of brothers, both of them blacksmiths, who have come up with a design for a man-powered vehicle. They call it a volocycle. Two wheels set on a tubular steel frame, propelled by pedals you push with your feet.\"\u003c/p\u003e\n\u003cp\u003e\"Only two wheels?\" Poppy asked, perplexed. \"How could one ride it without falling over?\"\u003c/p\u003e\n\u003cp\u003e\"The driver would have to balance his center of mass over the wheels.\"\u003c/p\u003e\n\u003cp\u003e\"How would one turn the vehicle?\"\u003c/p\u003e\n\u003cp\u003e\"More importantly,\" Amelia said in a dry tone, \"how would one stop it?\"\u003c/p\u003e\n\u003cp\u003e\"By the application of one\u0027s body to the ground?\" Poppy suggested.\u003c/p\u003e\n\u003cp\u003eCam laughed. \"Probably. We\u0027ll put it into production, of course. Westcliff says he\u0027s never seen a more disastrous investment. The volocycle looks uncomfortable as the devil, and requires balance far beyond the abilities of the average man. It won\u0027t be affordable, or practical. After all, no sane man would choose to pedal along the street on a two-wheeled contraption in lieu of riding a horse.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds quite fun, though,\" Beatrix said wistfully.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not an invention a girl could try,\" Poppy pointed out.\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Our skirts would get in the way.\"\u003c/p\u003e\n\u003cp\u003e\"Why must we wear skirts?\" Beatrix asked. \"I think trousers would be ever so much more comfortable.\"\u003c/p\u003e\n\u003cp\u003eAmelia looked appalled and amused. \"These are observations best kept in the family, dear.\" Picking up a glass of water, she raised it in Rohan\u0027s direction. \"Well, then. Here\u0027s to your first failure.\" She raised an eyebrow. \"I hope you\u0027re not risking the entire family fortune before we reach the dressmaker\u0027s?\"\u003c/p\u003e\n\u003cp\u003eHe grinned at her. \"Not the entire fortune. Shop with confidence, monisha.\"\u003c/p\u003e\n\u003cp\u003eWhen breakfast was concluded, the women left the dining table, while Rohan and Kev stood politely.\u003c/p\u003e\n\u003cp\u003eLowering himself back into the chair, Rohan watched as Kev began to leave. \"Where are you going?\" Rohan asked lazily. \"Meeting with your tailor? Going to discuss the latest political events at the local coffeehouse?\"\u003c/p\u003e\n\u003cp\u003e\"If your goal is to annoy me,\" Kev informed him, \"there\u0027s no need to make an effort. You annoy me just by breathing.\"\u003c/p\u003e\n\u003cp\u003e\"Forgive me. I would try to refrain from the habit, but I\u0027ve become rather fond of it.\" Rohan gestured to a chair. \"Join me, Merripen. We need to discuss a few things.\"\u003c/p\u003e\n\u003cp\u003eKev complied with a glower.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a man of few words, aren\u0027t you?\" Rohan observed.\u003c/p\u003e\n\u003cp\u003e\"Better than to fill the air with empty chatter.\"\u003c/p\u003e\n\u003cp\u003e\"I agree. I\u0027ll go straight to the point, then. While Leo… Lord Ramsay… is in Europe, his entire estate, his financial affairs, and three of his sisters have been placed in the care of a pair of Roma. It\u0027s not what I\u0027d call an ideal situation. If Leo were in any condition to stay, I would have kept him here and sent Poppy to France with Win.\"\u003c/p\u003e\n\u003cp\u003eBut Leo was not in good condition, as they both knew. He had been a broken man, a wastrel, ever since the death of Laura Dillard. And although he was finally coming to terms with his grief, his path to healing, in both body and spirit, would not be short.\u003c/p\u003e\n\u003cp\u003e\"Do you actually believe,\" Kev asked, his voice riddled with contempt, \"that Leo will check himself in as a patient at a health clinic?\"\u003c/p\u003e\n\u003cp\u003e\"No. But he\u0027ll stay close by to keep an eye on Win. And it\u0027s a remote setting where opportunities for trouble are limited. He did well in France before, when he was studying architecture. Perhaps living there again will help to recall him to himself.\"\u003c/p\u003e\n\u003cp\u003e\"Or,\" Kev said darkly, \"he\u0027ll disappear to Paris and drown himself in drink and prostitutes.\"\u003c/p\u003e\n\u003cp\u003eRohan shrugged. \"Leo\u0027s future is in his own hands. I\u0027m more concerned about what we\u0027re facing here. Amelia is determined that Poppy should have a season in London, and that Beatrix should go to finishing school. At the same time, the rebuilding of the manor in Hampshire has to continue. The ruins need to be cleared and the grounds-\"\u003c/p\u003e\n\u003cp\u003e\"I know what has to be done.\"\u003c/p\u003e\n\u003cp\u003e\"Then you will manage the project? You\u0027ll work with the architect, the builders, the masons and carpenters, and so forth?\"\u003c/p\u003e\n\u003cp\u003eKev glared at him with rank antagonism. \"I won\u0027t be gotten rid of. And I\u0027ll be damned if I work for you, or answer to you-\"\u003c/p\u003e\n\u003cp\u003e\"Wait.\" Rohan\u0027s hands lifted in a staying gesture, a scattering of gold rings gleaming richly on his dark fingers. \"Wait. For God\u0027s sake, I\u0027m not trying to get rid of you. I\u0027m proposing a partnership. Frankly, I\u0027m no more thrilled by the prospect than you are. But there is much to be accomplished. And we have more to gain by working together than being at cross-purposes.\"\u003c/p\u003e\n\u003cp\u003eIdly picking up a table knife, Kev ran his fingers along the blunt edge and the intricate gilded handle. \"You want me to go to Hampshire and oversee the work crews while you stay in London with the women?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-16.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
