{"id":77420,"no":17,"title":"Page 17","content":"\u003cp\u003e\"Come and go as you please. I\u0027ll be traveling back and forth to Hampshire every now and again to look over things.\" Rohan gave him an astute glance. \"You have nothing keeping you in London, do you?\"\u003c/p\u003e\n\u003cp\u003eKev shook his head.\u003c/p\u003e\n\u003cp\u003e\"Then it\u0027s settled?\" Rohan pressed.\u003c/p\u003e\n\u003cp\u003eAlthough Kev hated to admit it, the plan was not without appeal. He hated London, the grime and clamor and crowded buildings, the smog and noise. He longed to return to the country. And the thought of rebuilding the manor, exhausting himself with hard work… It would do him some good. Besides, he knew what the Ramsay estate needed better than anyone. Rohan might know every street, square, and rookery in London, but he wasn\u0027t at all familiar with country life. It only made sense for Kev to take charge of the Ramsay estate.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll want to make improvements to the land as well,\" Kev said, setting down the knife. \"There are field gates and fences that need repair. Ditches and drainage channels to be dug. And the tenant farmers are still using flails and reap-hooks because there is no threshing machine. The estate should have its own bakehouse to save the tenants from having to go to the village for their bread. Also-\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you decide,\" Rohan said hastily, having the typical Londoner\u0027s complete lack of interest in farming. \"Attracting more tenants will benefit the estate, of course.\"\u003c/p\u003e\n\u003cp\u003e\"I know you\u0027ve already commissioned an architect and builder. But from now on, I\u0027ll be the one they come to with questions. I\u0027ll need access to the Ramsay accounts. And I\u0027m going to pick the land crews and manage them without interference.\"\u003c/p\u003e\n\u003cp\u003eRohan\u0027s brows lifted at Kev\u0027s authoritative manner. \"Well. This is a side of you I haven\u0027t seen before, chair\u003c/p\u003e\n\u003cp\u003e\"Do you agree to my terms?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Rohan extended his hand. \"Shall we shake on it?\"\u003c/p\u003e\n\u003cp\u003eKev stood, ignoring the overture. \"Not necessary.\"\u003c/p\u003e\n\u003cp\u003eRohan\u0027s white teeth flashed in a grin. \"Merripen, would it be so terrible to attempt a friendship with me?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll never be friends. At best, we\u0027re enemies with a common purpose.\"\u003c/p\u003e\n\u003cp\u003eRohan continued to smile. \"I suppose the end result is the same.\" He waited until Kev had reached the door before saying casually, \"By the way, I\u0027m going to pursue the matter of the tattoos. If there is a connection between the two of us, I want to find out what it is.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll do so without my cooperation,\" Kev said stonily.\u003c/p\u003e\n\u003cp\u003e\"Why not? Aren\u0027t you curious?\" \"Not in the least.\"\u003c/p\u003e\n\u003cp\u003eRohan\u0027s hazel eyes were filled with speculation. \"You have no ties to the past or the Rom, and no knowledge of why a unique design was inked into your arm in early childhood. What are you afraid of finding out?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve had the same tattoo for just as long,\" Kev shot back. \"You have no more idea about what it\u0027s for than I do. Why take such an interest in it now?\"\u003c/p\u003e\n\u003cp\u003e\"I…\" Absently Rohan rubbed his arm over his shirtsleeve, where the tattoo was located. \"I always assumed it was done at some whim of my grandmother\u0027s. She would never explain why I had the mark, or what it meant.\"\u003c/p\u003e\n\u003cp\u003e\"Did she know?\"\u003c/p\u003e\n\u003cp\u003e\"I believe so.\" Rohan\u0027s mouth quirked. \"She seemed to know everything. She was a powerful herbalist, and a believer in the Biti Foki.\"\u003c/p\u003e\n\u003cp\u003e\"Fairy people?\" Kev asked with a disdainful curl of his lips.\u003c/p\u003e\n\u003cp\u003eRohan smiled. \"Oh yes. She assured me she was on personal terms with many of them.\" The trace of amusement faded. \"When I was about ten years old, my grandmother sent me away from the tribe. She said I was in danger. My cousin Noah brought me to London and helped me to find work at the gambling club as a list-maker\u0027s runner. I\u0027ve never seen any of my tribe since then.\" Rohan paused, his face becoming shadowed. \"I was banished from the Rom without ever knowing why. And I had no reason to assume the tattoo had anything to do with it. Until I met you. We have two things in common, phral: we\u0027re outcasts, and we bear the mark of an Irish nightmare horse. And I think that finding out where it came from may help us both.\"\u003c/p\u003e\n\u003cp\u003eIn the following months Kev prepared the Ramsay estate for reconstruction. A mild and halfhearted winter had fallen over the village of Stony Cross and its environs, where the Ramsay estate was located. Beige grasses were crisped with frost, and stones rested hard-frozen by the banks of the Avon and Itchen rivers. Catkins emerged on willows, soft and tender as a lamb\u0027s tail, while dogwood sent up red winter stems to splinter the pale gray landscape.\u003c/p\u003e\n\u003cp\u003eThe crews employed by John Dashiell, the contractor who would rebuild the Ramsay manor, were hardworking and efficient. The first two months were spent clearing the remains of the house, carting off charred wood and broken rock and rubble. A small gatehouse on the approach road was repaired and refurbished for the Hathaways\u0027 convenience.\u003c/p\u003e\n\u003cp\u003eOnce the ground began to soften in March, the rebuilding of the manor would start in earnest. Kev was certain the crews had been warned in advance that the project was being supervised by a Rom, for they offered no objection to his presence or his authority. Dashiell, being a self-made and pragmatic man, didn\u0027t seem to care if his clients were English, Romany, or any other nationality, so long as his payment schedule was met.\u003c/p\u003e\n\u003cp\u003eNear the end of February, Kev made the twelve-hour journey from Stony Cross to London. He had received word from Amelia that Beatrix had quit finishing school. Even though Amelia had added that all was well, Kev wanted to make certain for himself. The two months\u0027 separation was the longest he had ever spent away from the Hathaway sisters, and he was surprised by how intensely he had missed them. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-17.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
