{"id":77425,"no":23,"title":"Page 23","content":"\u003cp\u003e\"Lack of interest?\" Amelia repeated, and gave a strange little laugh. \"No, Win, I wouldn\u0027t say that at all. Any mention of you earns his closest attention.\"\u003c/p\u003e\n\u003cp\u003e\"One may judge a man\u0027s feelings by his actions.\" Win sighed and rubbed her weary eyes. \"At first I was hurt by the way he ignored my letters. Then I was angry. Now I merely feel foolish.\"\u003c/p\u003e\n\u003cp\u003e\"Why, dear?\" Amelia asked, her blue eyes filled with concern.\u003c/p\u003e\n\u003cp\u003eFor loving, and having that love tossed back in her face. For wasting an ocean\u0027s worth of tears on a big, hard-hearted brute.\u003c/p\u003e\n\u003cp\u003eAnd for still wanting to see him despite all that.\u003c/p\u003e\n\u003cp\u003eWin shook her head. The talk of Merripen had made her agitated and melancholy. \"I\u0027m weary after the long journey, Amelia,\" she said with a half smile. \"Would you mind if I-\"\u003c/p\u003e\n\u003cp\u003e\"No, no, go at once,\" her sister said, drawing Win up from the settee and putting a protective arm around her. \"Leo, do take Win to her room. You\u0027re both exhausted. We\u0027ll have time for talking tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, that lovely tone of command,\" Leo reminisced. \"I\u0027d hoped that by now you would have rid her of the habit of barking out orders like a drill sergeant, Rohan.\"\u003c/p\u003e\n\u003cp\u003e\"I enjoy all her habits,\" Rohan replied, smiling at his wife.\u003c/p\u003e\n\u003cp\u003e\"What room is Merripen in?\" Win whispered to Amelia.\u003c/p\u003e\n\u003cp\u003e\"Third floor, number twenty-one,\" Amelia whispered back. \"But you mustn\u0027t go tonight, dear.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Win smiled at her. \"The only thing I intend to do tonight is go to bed without delay.\"\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eThird floor, number twenty-one. Win pulled the hood of her cloak farther over her head, concealing her face as she walked along the quiet hallway.\u003c/p\u003e\n\u003cp\u003eShe had to find Merripen, of course. She had come too far. She had crossed miles of earth, an ocean, and come to think of it, she had climbed the equivalent of a thousand ladders in the clinic gymnasium, all to reach him. Now that they were in the same building, she was hardly going to end her journey prematurely.\u003c/p\u003e\n\u003cp\u003eThe hotel hallways were bracketed at each end with colonnaded light wells to admit the sun in the daytime hours. Win could hear strains of music from deep within the hotel. There must be a private party in the ballroom, or an event in the famous dining room. Harry Rutledge was called the hotelier to royalty, welcoming the famous, the powerful, and the fashionable to his establishment.\u003c/p\u003e\n\u003cp\u003eGlancing at the gilded numbers on each door, Win finally found 21. Her stomach plunged, and every muscle clenched with anxiety. She felt a light sweat break out on her forehead. Fumbling a little with her gloves, she managed to pull them off and tuck them into the pockets of her cloak.\u003c/p\u003e\n\u003cp\u003eA tremulous knock at the door with her knuckles. And she waited in frozen stillness, head downbent, hardly able to breathe for nerves. She gripped her arms around herself beneath the concealing cloak.\u003c/p\u003e\n\u003cp\u003eShe was not certain how much time passed, only that it seemed an eternity before the door was unlocked and opened.\u003c/p\u003e\n\u003cp\u003eBefore she could bring herself to look up, she heard Merripen\u0027s voice. She had forgotten how deep and dark it was, how it seemed to reach down to the center of her.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t send for a woman tonight.\"\u003c/p\u003e\n\u003cp\u003eThat last word forestalled Win\u0027s reply.\u003c/p\u003e\n\u003cp\u003e\"Tonight\" implied that there had been other nights when he had indeed sent for a woman. And although Win was unworldly, she certainly understood what happened when a woman was sent for and received by a man at a hotel.\u003c/p\u003e\n\u003cp\u003eHer brain swarmed with thoughts. She had no right to object if Merripen wanted a woman to service him. She did not own him. They had made no promises or agreements. He did not owe her fidelity.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t help wondering… How many women? How many nights?\u003c/p\u003e\n\u003cp\u003e\"No matter,\" he said brusquely. \"I can use you. Come in.\" A large hand reached out and gripped Win\u0027s shoulder, hauling her past the threshold without giving her the opportunity to object.\u003c/p\u003e\n\u003cp\u003eI can use you?\u003c/p\u003e\n\u003cp\u003eAnger and consternation tumbled through her. She had no idea what to do or say. Somehow it didn\u0027t seem appropriate simply to throw back her hood and cry, Surprise!\u003c/p\u003e\n\u003cp\u003eMerripen had mistaken her for a prostitute, and now the reunion she had dreamed of for so long was turning into a farce.\u003c/p\u003e\n\u003cp\u003e\"I assume you were told that I\u0027m a Rom,\" he said.\u003c/p\u003e\n\u003cp\u003eHer face still concealed by the hood, Win nodded.\u003c/p\u003e\n\u003cp\u003e\"And that doesn\u0027t matter to you?\"\u003c/p\u003e\n\u003cp\u003eWin managed a single shake of her head.\u003c/p\u003e\n\u003cp\u003eThere was a soft, humorless laugh that didn\u0027t sound at all like Merripen. \"Of course not. As long as the money is good.\"\u003c/p\u003e\n\u003cp\u003eHe left her momentarily, striding to the window to close the heavy velvet curtains against the smoke-hazed lights of London. A single lamp strained to illuminate the dimness of the room.\u003c/p\u003e\n\u003cp\u003eWin glanced at him quickly. It was Merripen… but as Amelia had said, he was altered. He had lost weight, perhaps a stone. He was huge, lean, almost rawboned. The neck of his shirt hung open, revealing the brown, hairless chest, the gleaming curve of powerful muscle. She thought at first it was a trick of the light, the immense bulwark of his shoulders and upper arms. Good Lord, how strong he\u0027d become.\u003c/p\u003e\n\u003cp\u003eBut none of that intrigued or startled her as much as his face. He was still as handsome as the devil, with those black eyes and that wicked mouth, the austere angles of nose and jaw, the high planes of his cheekbones. There were new lines, however, deep, bitter grooves that ran from nose to mouth, and the trace of a permanent frown between his thick brows. And most disturbing of all, a hint of cruelty in his expression. He looked capable of things that her Merripen never could have done. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-23.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
