{"id":77439,"no":37,"title":"Page 37","content":"\u003cp\u003e\"Hmmm. That is neither Irish nor Romany. Perhaps there\u0027s another part of you we haven\u0027t yet identified.\"\u003c/p\u003e\n\u003cp\u003e\"My God. I hope not.\" But he was smiling, and Win felt a warm ripple of delight spread through all her limbs.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the first real smile I\u0027ve seen from you since I came back,\" she said. \"You should smile more, Kev.\" \"Should I?\" he asked softly.\u003c/p\u003e\n\u003cp\u003e\"Oh yes. It\u0027s beneficial for your health. Dr. Harrow says his cheerful patients tend to recover far more quickly than the sour ones.\"\u003c/p\u003e\n\u003cp\u003eThe mention of Dr. Harrow caused Merripen\u0027s elusive smile to vanish. \"Ramsay says you\u0027ve become close with him.\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Harrow is a friend,\" she allowed.\u003c/p\u003e\n\u003cp\u003e\"Only a friend?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, so far. Would you object if he wished to court me?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Merripen muttered. \"What right would I have to object?\"\u003c/p\u003e\n\u003cp\u003e\"None at all. Unless you had staked some prior claim, which you certainly have not.\"\u003c/p\u003e\n\u003cp\u003eShe sensed Merripen\u0027s inner struggle to let the matter drop. A struggle he lost, for he said abruptly, \"Far be it from me to deny you a diet of pabulum, if that\u0027s what your appetite demands.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re likening Dr. Harrow to pabulum?\" Win fought to hold back a satisfied grin. The small display of jealousy was a balm to her spirits. \"I assure you, he is not at all bland. He is a man of substance and character.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a watery-eyed, pale-faced gadjo\"\u003c/p\u003e\n\u003cp\u003e\"He is very attractive. And his eyes are not at all watery.\"\u003c/p\u003e\n\u003cp\u003e\"Have you let him kiss you?\"\u003c/p\u003e\n\u003cp\u003e\"Kev, we\u0027re on a public thoroughfare-\"\u003c/p\u003e\n\u003cp\u003e\"Have you?\"\u003c/p\u003e\n\u003cp\u003e\"Once,\" she admitted, and waited as he digested the information. He scowled ferociously at the pavement before them. When it became apparent he wasn\u0027t going to say anything, Win volunteered, \"It was a gesture of affection.\"\u003c/p\u003e\n\u003cp\u003eStill no response.\u003c/p\u003e\n\u003cp\u003eStubborn ox, she thought in annoyance. \"It wasn\u0027t like your kisses. And we\u0027ve never…\" She felt a blush rising. \"We\u0027ve never done anything similar to what you and I… the other night…\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not going to discuss that.\"\u003c/p\u003e\n\u003cp\u003e\"Why can we discuss Dr. Harrow\u0027s kisses but not yours?\"\u003c/p\u003e\n\u003cp\u003e\"Because my kisses aren\u0027t going to lead to courtship.\"\u003c/p\u003e\n\u003cp\u003eThat hurt. It also puzzled and frustrated her. Before all was said and done, Win intended to make Merripen admit just why he wouldn\u0027t pursue her. But not here, and not now.\u003c/p\u003e\n\u003cp\u003e\"Well, I do have a chance of courtship with Dr. Harrow,\" she said, attempting a pragmatic tone. \"And at my age, I must consider any marriage prospect quite seriously.\"\u003c/p\u003e\n\u003cp\u003e\"Your age?\" he scoffed. \"You\u0027re only twenty-five.\"\u003c/p\u003e\n\u003cp\u003e\"Twenty-six. And even at twenty-five, I would be considered long in the tooth. I lost several years-my best ones perhaps-because of my illness.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re more beautiful now than you ever were. Any man would be mad or blind not to want you.\" The compliment was not given smoothly, but with a masculine sincerity that heightened her blush.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Kev.\"\u003c/p\u003e\n\u003cp\u003eHe slid her a guarded look. \"You want to marry?\"\u003c/p\u003e\n\u003cp\u003eWin\u0027s willful, treacherous heart gave a few painfully excited thuds, because at first she thought he\u0027d asked, \"You want to marry me?\" But no, he was merely asking her opinion of marriage as… well, as her scholarly father would have said, as a \"conceptual structure with a potential for realization.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course,\" she said. \"I want children to love. I want a husband to grow old with. I want a family of my own.\"\u003c/p\u003e\n\u003cp\u003e\"And Harrow says all of that is possible now?\"\u003c/p\u003e\n\u003cp\u003eWin hesitated a bit too long. \"Yes, completely possible.\"\u003c/p\u003e\n\u003cp\u003eBut Merripen knew her too well. \"What are you not telling me?\"\u003c/p\u003e\n\u003cp\u003e\"I am well enough to do anything I choose now,\" she said firmly.\u003c/p\u003e\n\u003cp\u003e\"What does he-\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t wish to discuss it. You have your forbidden topics; I have mine.\"\u003c/p\u003e\n\u003cp\u003e\"You know I\u0027ll find out,\" he said quietly.\u003c/p\u003e\n\u003cp\u003eWin ignored that, casting her gaze to the park before them. Her eyes widened as she saw something that had not been there when she had left for France… a huge, magnificent structure of glass and iron. \"Is that the Crystal Palace? Oh, it must be. It\u0027s so beautiful-much more so than the engravings I\u0027ve seen.\"\u003c/p\u003e\n\u003cp\u003eThe building, which covered an area of more than nine acres, housed an international show of art and science called the Great Exhibition. Win had read about it in the French newspapers, which had aptly termed the exhibition one of the great wonders of the world.\u003c/p\u003e\n\u003cp\u003e\"How long since it was completed?\" she asked, her step quickening as they headed toward the glittering building.\u003c/p\u003e\n\u003cp\u003e\"Not quite a month.\"\u003c/p\u003e\n\u003cp\u003e\"Have you been inside? Have you seen the exhibits?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve visited once,\" Merripen said, smiling at her eagerness. \"And I saw a few of the exhibits, but not all. It would take three days or more to look at everything.\"\u003c/p\u003e\n\u003cp\u003e\"Which part did you go to?\"\u003c/p\u003e\n\u003cp\u003e\"The machinery court, mostly.\"\u003c/p\u003e\n\u003cp\u003e\"I do wish I could see even a small part of it,\" she said wistfully, watching the throngs of visitors exiting and entering the remarkable building. \"Won\u0027t you take me?\"\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t have time to see anything. It\u0027s already afternoon. I\u0027ll bring you tomorrow.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-37.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
