{"id":77458,"no":56,"title":"Page 56","content":"\u003cp\u003e\"Thank you,\" Win murmured, following her into the entrance hall.\u003c/p\u003e\n\u003cp\u003eWin\u0027s eyes widened at the interior of the place, so light and sparkling, the two-story-high hall lined with paneling painted a creamy white. A gray stone staircase was set in the back of the hall, its iron balustrades gleaming black and spotless. Everywhere, it smelled of soap and fresh wax.\u003c/p\u003e\n\u003cp\u003e\"Remarkable,\" Win breathed. \"It\u0027s not the same place at all.\"\u003c/p\u003e\n\u003cp\u003eLeo came up beside her. For once he had no glib remark to make, nor did he bother to hide his admiration. \"It\u0027s a bloody miracle,\" he said. \"I\u0027m astonished.\" He turned to the housekeeper. \"Where is Merripen, Mrs. Barnstable?\"\u003c/p\u003e\n\u003cp\u003e\"Out at the estate timber yard, my lord. He is helping to unload a wagon. The logs are quite heavy, and the workers sometimes need Mr. Merripen\u0027s help with a difficult load.\"\u003c/p\u003e\n\u003cp\u003e\"We have a timber yard?\" Leo asked.\u003c/p\u003e\n\u003cp\u003eMiss Marks replied, \"Mr. Merripen is planning to construct houses for the new tenant farmers.\"\u003c/p\u003e\n\u003cp\u003e\"This is the first I\u0027ve heard of it. Why are we providing houses for them?\" Leo\u0027s tone was not at all censuring, merely interested. But Miss Marks\u0027s lips thinned, as if she had interpreted his question as a complaint.\u003c/p\u003e\n\u003cp\u003e\"The most recent tenants to join the estate were lured by the promise of new houses. They are already successful farmers, educated and forward-looking, and Mr. Merripen believes their presence will add to the estate\u0027s prosperity. Other local estates, such as Stony Cross Park, are also building homes for their tenants and laborers-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" Leo interrupted. \"No need to be defensive, Marks. God knows I wouldn\u0027t think of interfering with Merripen\u0027s plans after seeing all he\u0027s done so far.\" He glanced at the housekeeper. \"If you\u0027ll point the way, Mrs. Barnstable, I\u0027ll go out and find Merripen. Perhaps I might help to unload the timber wagon.\"\u003c/p\u003e\n\u003cp\u003e\"A footman will show you the way,\" the housekeeper said at once. \"But the work is occasionally hazardous, my lord, and not fitting for a man of your station.\"\u003c/p\u003e\n\u003cp\u003eMiss Marks added in a light but caustic tone, \"Besides, it is doubtful you could be of any help.\"\u003c/p\u003e\n\u003cp\u003eThe housekeeper\u0027s mouth fell open.\u003c/p\u003e\n\u003cp\u003eWin had to bite back a grin. Miss Marks had spoken as if Leo were a small weed of a man instead of a strapping six-footer.\u003c/p\u003e\n\u003cp\u003eLeo gave the governess a sardonic smile. \"I\u0027m more physically capable than you suspect, Marks. You have no idea what lurks beneath this coat.\"\u003c/p\u003e\n\u003cp\u003e\"I am profoundly grateful for that.\"\u003c/p\u003e\n\u003cp\u003e\"Miss Hathaway,\" the housekeeper broke in hurriedly, trying to smooth over the conflict, \"may I show you to your room?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, thank you.\" Hearing her sisters\u0027 voices, Win turned to see them entering the hall along with Mr. Rohan.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Amelia asked with a grin, spreading her hands to indicate their surroundings.\u003c/p\u003e\n\u003cp\u003e\"Lovely beyond words,\" Win replied.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s freshen ourselves and brush off the travel dust, and then I\u0027ll take you around.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll only be a few minutes.\"\u003c/p\u003e\n\u003cp\u003eWin went to the staircase with the housekeeper. \"How long have you been employed here, Mrs. Barnstable?\" she asked as they ascended to the second floor.\u003c/p\u003e\n\u003cp\u003e\"A year, more or less. Ever since the house became habitable. I had previously been employed in London, but the old master passed on to his reward, and the new master dismissed most of the staff and replaced them with his own. I was in desperate need of a position.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to hear that. But very pleased for the Hathaways\u0027 sake.\"\u003c/p\u003e\n\u003cp\u003e\"It has been a challenging undertaking,\" the housekeeper said, \"putting together a staff and training them all. I will confess I had a few trepidations, given the unusual circumstances of this position. But Mr. Merripen was very persuasive.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Win said absently, \"it is difficult to say no to him.\"\u003c/p\u003e\n\u003cp\u003e\"He has a strong and steady presence, that Mr. Merripen. I\u0027ve often marveled to see him in the center of a dozen simultaneous undertakings-the carpenters, the painters, the blacksmith, the head groomsman, all clamoring for his attention. And he always keeps a cool head. We can scarcely do without him. He is the fixed point of the estate.\"\u003c/p\u003e\n\u003cp\u003eWin nodded morosely, glancing into the rooms they passed. More cream paneling, and light cherry furniture, and upholsteries of soft-colored velvets rather than the gloomy dark shades that were currently fashionable. She thought it a pity that she would never be able to enjoy this house except for occasional visits.\u003c/p\u003e\n\u003cp\u003eMrs. Barnstable took her to a beautiful room with windows overlooking the gardens. \"This is yours,\" the housekeeper said. \"No one has occupied it before.\" The bed was made of light blue upholstered panels, the bedclothes of white linen. There was a graceful lady\u0027s writing desk in the corner, and a satin maple wardrobe with a looking glass set in the door.\u003c/p\u003e\n\u003cp\u003e\"Mr. Merripen personally selected the wallpaper,\" Mrs. Barnstable said. \"He nearly drove the interior architect mad with his insistence on seeing hundreds of samples until he found this pattern.\"\u003c/p\u003e\n\u003cp\u003eThe wallpaper was white, with a delicate pattern of flowering branches. And at sparse intervals, there was the motif of a little robin perched on one of the twigs.\u003c/p\u003e\n\u003cp\u003eSlowly Win went to one of the walls and touched one of the birds with her fingertips. Her vision blurred.\u003c/p\u003e\n\u003cp\u003eDuring her long recuperation from the scarlet fever, when she had grown tired of holding a book in her hands and no one had been available to read to her, she had stared out the window at a robin\u0027s nest in a nearby maple tree. She had watched the fledglings hatch from their blue eggs, their bodies pink and veined and fuzzy. She had watched their feathers grow in, and she had watched the mother robin working to fill their ravenous beaks. And Win had watched as, one by one, they had flown from the nest while she remained in bed. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-56.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
