{"id":77410,"no":7,"title":"Page 7","content":"\u003cp\u003eWhy wasn\u0027t she frightened of him? He was actually frightened for her, because he knew what he was capable of.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t been aware of pulling her closer. All he knew was that now part of her weight was resting on him as he lay on the bed, and his fingertips had curled into the pliant flesh of her upper arms.\u003c/p\u003e\n\u003cp\u003e\"Let go,\" she told him gently.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t want to. Ever. He wanted to keep her against him, and pull her braided hair down and comb his fingers through the pale silk. He wanted to carry her off to the ends of the earth.\u003c/p\u003e\n\u003cp\u003e\"If I do,\" he said gruffly, \"will you stay?\"\u003c/p\u003e\n\u003cp\u003eThe delicate lips curved. Sweet, delicious smile. \"Silly boy. Of course I\u0027ll stay. I\u0027ve come to visit you.\"\u003c/p\u003e\n\u003cp\u003eSlowly his fingers loosened. He thought she would run away, but she remained. \"Lie back,\" she told him.\u003c/p\u003e\n\u003cp\u003e\"Why are you dressed so early?\" Her eyes widened. \"Oh. You mustn\u0027t leave. Not until you\u0027re well.\"\u003c/p\u003e\n\u003cp\u003eShe needn\u0027t have worried. Kev\u0027s plans to escape had disappeared the second he had seen her. He eased back against the pillows, watching intently as she sat on the chair. She was wearing a pink dress. The edges of it, at the neck and wrists, were trimmed with little ruffles.\u003c/p\u003e\n\u003cp\u003e\"What is your name?\" she asked.\u003c/p\u003e\n\u003cp\u003eKev hated talking. Hated making conversation with anyone. But he was willing to do anything to keep her with him. \"Merripen.\"\u003c/p\u003e\n\u003cp\u003e\"Is that your first name?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eWinnifred tilted her head to the side. \"Won\u0027t you tell it to me?\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t. A Rom could only share his true name with others in the Rom.\u003c/p\u003e\n\u003cp\u003e\"At least give me the first letter,\" she coaxed.\u003c/p\u003e\n\u003cp\u003eKev stared at her, perplexed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know many Gypsy names,\" she said. \"Is it Luca? Marko? Stefan?\"\u003c/p\u003e\n\u003cp\u003eIt occurred to Kev that she was trying to play a game with him. Teasing him. He didn\u0027t know how to respond. Usually if someone tried to tease him, he responded by sinking his fist into the offender\u0027s face.\u003c/p\u003e\n\u003cp\u003e\"Someday you will tell me,\" she said with a little grin. She made a move as if to rise from the chair, and Kev\u0027s hand shot out to grip her arm. Surprise flickered across her face.\u003c/p\u003e\n\u003cp\u003e\"You said you would stay,\" he said roughly. Her free hand came to the one clamped around her wrist. \"I will. Be at ease, Merripen. I\u0027m only going to fetch some bread and tea for us. Let me go. I\u0027ll come right back.\" Her palm was light and warm as it rubbed over his hand. \"I\u0027ll stay in here all day, if you wish.\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t let you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes, they will.\" She coaxed his hand to loosen, gently prying at his fingers. \"Don\u0027t be so anxious. My goodness. I thought Gypsies were supposed to be merry.\"\u003c/p\u003e\n\u003cp\u003eShe almost made him smile.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve had a bad week,\" he told her gravely.\u003c/p\u003e\n\u003cp\u003eShe was still busy trying to detach his fingers from her arm. \"Yes, I can see that. How did you come to be hurt?\"\u003c/p\u003e\n\u003cp\u003e\"Gadjos attacked my tribe. They may come for me here.\" He stared at her hungrily but forced himself to let go of her. \"I\u0027m not safe. I should go.\"\u003c/p\u003e\n\u003cp\u003e\"No one would dare take you away from us. My father is a very respected man in the village. A scholar.\" Seeing Merripen\u0027s doubtful expression, she added, \"The pen is mightier than the sword, you know.\"\u003c/p\u003e\n\u003cp\u003eThat sounded like something a gadjo would say. It made no sense at all. \"The men who attacked my vitsa last week were not armed with pens.\"\u003c/p\u003e\n\u003cp\u003e\"You poor thing,\" she said compassionately. \"I\u0027m sorry. Your wounds must hurt after all this moving about. I\u0027ll get you some tonic.\"\u003c/p\u003e\n\u003cp\u003eKev had never been the object of sympathy before. He didn\u0027t like it. His pride bristled. \"I won\u0027t take it. Gadjo medicine doesn\u0027t work. If you bring it, I\u0027ll only throw it on the-\"\u003c/p\u003e\n\u003cp\u003e\"All right. Don\u0027t excite yourself. I\u0027m sure it\u0027s not good for you.\" She went to the door, and a thrill of desperation shook Kev\u0027s frame. He was certain she would not come back. And he wanted her near him so badly. Had he the strength, he would have leaped from the bed and seized her again. But that wasn\u0027t possible.\u003c/p\u003e\n\u003cp\u003eSo he fixed her with a sullen stare and muttered, \"Go, then. Devil take you.\"\u003c/p\u003e\n\u003cp\u003eWinnifred paused at the doorway and glanced over her shoulder with a quizzical grin. \"How contrary and cross you are. I will come back with bread and tea and a book, and I will stay as long as it takes to get a smile from you.\"\u003c/p\u003e\n\u003cp\u003e\"I never smile,\" he told her.\u003c/p\u003e\n\u003cp\u003eMuch to his surprise, Win did return. She spent the better part of a day reading to him, some dull and wordy story that made him drowsy with contentment. No music, no rustling of trees in the forest, no bird-songs had ever pleased him as much as her soft voice. Occasionally another family member came to the doorway, but Kev couldn\u0027t bring himself to snap at any of them. He was full of ease for the first time he could ever remember. He couldn\u0027t seem to hate anyone when he was so close to happiness.\u003c/p\u003e\n\u003cp\u003eThe next day the Hathaways brought him to the main room in the cottage, a parlor filled with worn furniture. Every available surface was covered with sketches, needlework, and piles of books. One couldn\u0027t move without knocking something over.\u003c/p\u003e\n\u003cp\u003eWhile Kev half-reclined on the sofa, the smaller girls played on the carpet nearby, trying to teach tricks to Beatrix\u0027s pet squirrel. Leo and his father played chess in the corner. Amelia and her mother cooked in the kitchen. And Win sat close to Kev and worked on his hair.\u003c/p\u003e\n\u003cp\u003e\"You have the mane of a wild beast,\" she told him, using her fingers to pull apart snarls, then combing the tangled black strands with great care. \"Hold still. I\u0027m trying to make you look more civi-oh, do stop flinching. Your head can\u0027t possibly be that sensitive.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-7.html","bookId":1786,"creation":"Oct 5, 2019 3:37:59 PM","modification":"Oct 5, 2019 3:37:59 PM"}
