{"id":77478,"no":77,"title":"Page 77","content":"\u003cp\u003e\"Then don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not going to hurt you to hear an outside perspective.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t give a damn about your perspective.\"\u003c/p\u003e\n\u003cp\u003e\"If you weren\u0027t so bloody self-absorbed,\" Cam said acidly, \"it might occur to you that you\u0027re not the only one who\u0027s got something to worry about. Do you think I haven\u0027t given a thought to what might happen to Amelia now that she\u0027s conceived?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing will happen to Amelia,\" Merripen said dismissively.\u003c/p\u003e\n\u003cp\u003eCam scowled. \"Everyone in this family chooses to think of Amelia as indestructible. Amelia herself thinks it. But she\u0027s subject to all the usual problems and frailties of any other woman in her condition. The truth is that it\u0027s always a risk.\"\u003c/p\u003e\n\u003cp\u003eMerripen\u0027s dark eyes simmered with hostility. \"More so for Win.\"\u003c/p\u003e\n\u003cp\u003e\"Probably. But if she wants to assume that risk, it\u0027s her decision.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s where we differ, Rohan. Because I-\"\u003c/p\u003e\n\u003cp\u003e\"Because you don\u0027t take risks on anyone, do you? It\u0027s too bad you\u0027ve fallen in love with a woman who won\u0027t be kept on a shelf, phral.\"\u003c/p\u003e\n\u003cp\u003e\"If you call me that again,\" Merripen growled, \"I\u0027ll take your bloody head off.\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead and try.\"\u003c/p\u003e\n\u003cp\u003eMerripen would probably have launched at Cam then, if not for the glass doors opening and another figure stepping out on the terrace. Glancing in the direction of the intruder, Cam groaned inwardly.\u003c/p\u003e\n\u003cp\u003eIt was Harrow, looking controlled and capable. He approached Cam and ignored Merripen. \"Good morning, Rohan. I\u0027ve just come to tell you that I will be leaving Hampshire later in the day. If I can\u0027t persuade Miss Hathaway to come to her senses, that is.\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Cam said, schooling his expression into pleasant blankness. \"Please let me know if there is anything we can do to facilitate your departure.\"\u003c/p\u003e\n\u003cp\u003e\"I only want what is best for her,\" the doctor murmured, still not looking at Merripen. \"I will continue to believe that going to France with me is the wisest choice for all concerned. But it is Miss Hathaway\u0027s decision.\" He paused, his gray eyes somber. \"I hope you will exert any influence you have to make certain all parties concerned understand what is at stake.\"\u003c/p\u003e\n\u003cp\u003e\"I think we all have a reasonably good grasp of the situation,\" Cam said with a gentleness that masked the sting of sarcasm.\u003c/p\u003e\n\u003cp\u003eHarrow stared at him suspiciously and gave a short nod. \"I\u0027ll leave the two of you to your discussion, then.\" He placed a subtle, skeptical emphasis on the word \"discussion,\" as if he was aware that they\u0027d been on the verge of an outright brawl. He left the terrace, closing the glass door behind him.\u003c/p\u003e\n\u003cp\u003e\"I hate that bastard,\" Merripen said beneath his breath.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not my favorite, either,\" Cam admitted. Wearily he gripped the back of his own neck, trying to ease the stiffness of the pinching muscles. \"I\u0027m going down to the Romany campsite. And if you don\u0027t mind, I\u0027ll take a cup of that evil brew you drink. I despise the stuff, but I need something to help me stay awake.\"\u003c/p\u003e\n\u003cp\u003e\"Have whatever\u0027s left in the pot,\" Merripen muttered. \"I\u0027m more awake than I care to be.\"\u003c/p\u003e\n\u003cp\u003eCam nodded and went to the French doors. But he paused at the threshold, and smoothed the hair at the back of his neck, and spoke quietly. \"The worst part about loving someone, Merripen, is that there will always be things you can\u0027t protect her from. Things beyond your control. You finally realize there is something worse than dying… and that is having something happen to her. You have to live with that fear always. But you have to take the bad part, if you want the good part.\"\u003c/p\u003e\n\u003cp\u003eKev looked at him bleakly. \"What\u0027s the good part?\"\u003c/p\u003e\n\u003cp\u003eA smile touched Cam \u0027s lips. \"All the rest of it is the good part,\" he said, and went inside.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been warned on pain of death not to say anything,\" was Leo\u0027s first comment as he joined Merripen in one of the east wing rooms. There were two plasterers in the corner, measuring and marking on the walls, and another was repairing scaffolding that would support a man close to the ceiling.\u003c/p\u003e\n\u003cp\u003e\"Good advice,\" Kev said. \"You should take it.\"\u003c/p\u003e\n\u003cp\u003e\"I never take advice, good or bad. That would only encourage more of it.\"\u003c/p\u003e\n\u003cp\u003eDespite Kev\u0027s brooding thoughts, he felt an unwilling smile tug at his lips. He gestured to a nearby bucket filled with light gray ooze. \"Why don\u0027t you pick up a stick and stir the lumps out of that?\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"A lime plaster and hairy clay mix.\"\u003c/p\u003e\n\u003cp\u003e\"Hairy clay. Lovely.\" But Leo obediently picked up a discarded stick and began to poke around in the bucket of plaster. \"The women are gone for the morning,\" he remarked. \"They went to Stony Cross Manor to visit Lady Westcliff. Beatrix warned me to be on the lookout for her ferret, which seems to be missing. And Miss Marks stayed here.\" A reflective pause. \"An odd little creature, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003e\"The ferret or Miss Marks?\" Kev carefully positioned a strip of wood on the wall and nailed it in place.\u003c/p\u003e\n\u003cp\u003e\"Marks. I\u0027ve been wondering… Is she a misandrist, or does she hate everyone in general?\"\u003c/p\u003e\n\u003cp\u003e\"What is a misandrist?\"\u003c/p\u003e\n\u003cp\u003e\"A man-hater.\"\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t hate men. She\u0027s always been pleasant to me and Rohan.\"\u003c/p\u003e\n\u003cp\u003eLeo looked genuinely puzzled. \"Then… she merely hates me?\"\u003c/p\u003e\n\u003cp\u003e\"It would seem so.\"\u003c/p\u003e\n\u003cp\u003e\"But she has no reason!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-77.html","bookId":1786,"creation":"Oct 5, 2019 3:38:00 PM","modification":"Oct 5, 2019 3:38:00 PM"}
