{"id":77488,"no":87,"title":"Page 87","content":"\u003cp\u003eCam lifted his head and looked down at his wife. \"I drank some coffee this morning,\" he told her. \"It didn\u0027t sit well.\"\u003c/p\u003e\n\u003cp\u003e\"So I heard,\" Amelia said, smoothing her hand across his chest. She threw a worried glance at Kev. \"His gaze isn\u0027t focused.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s higher than a jackdaw,\" Kev said. \"We gave him raw opium to calm his heart before Win brought the antidote.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s take him upstairs,\" Amelia said, using the edge of her sleeve to scrub her wet eyes. Raising her voice, she spoke to the elderly bearded man who stood outside the group. \"Dr. Martin, please accompany us upstairs and you will be able to evaluate my husband\u0027s condition in private.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need a doctor,\" Cam protested.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t complain, if I were you,\" Amelia told him. \"I\u0027m tempted to send for at least a half-dozen doctors, not to mention specialists from London.\" She paused long enough to glance at Noah. \"Are you the gentleman who helped Mr. Rohan? We are indebted to you, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Anything for my cousin,\" Noah replied.\u003c/p\u003e\n\u003cp\u003e\"Cousin?\" Amelia repeated, her eyes widening.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll explain upstairs,\" Cam said, lurching forward. Immediately Noah took one side and Merripen the other, and they half-dragged, half-carried Cam up the grand staircase. The family followed, exclaiming and talking excitedly.\u003c/p\u003e\n\u003cp\u003e\"These are the noisiest gadje I\u0027ve ever met,\" Noah remarked.\u003c/p\u003e\n\u003cp\u003e\"This is nothing,\" Cam said, panting with effort as they ascended. \"They\u0027re usually much worse.\"\u003c/p\u003e\n\u003cp\u003e\"Moshto!\" Noah exclaimed, shaking his head.\u003c/p\u003e\n\u003cp\u003eCam \u0027s privacy was marginal at best as he was deposited on the bed and Dr. Martin began to examine him. Amelia made a few attempts to shoo family and relatives from the room, but they kept pushing back in to see what was happening. After Martin tested Cam \u0027s pulse, pupil size, lung sounds, skin moisture and color, and reflexes, he pronounced that in his opinion, the patient would make a full recovery. If there were any troublesome symptoms during the night, such as heart palpitations, they could be soothed by imbibing a drop of laudanum in a glass of water.\u003c/p\u003e\n\u003cp\u003eThe doctor also said that Cam should be given clear liquids and bland foods and he should rest for the next two or three days. He would probably experience a loss of appetite, and almost certainly some headaches, but when he was fully rid of the last traces of digitalis, everything would be back to normal.\u003c/p\u003e\n\u003cp\u003eSatisfied that his brother was in good condition, Kev went to Leo in the corner of the room and asked softly, \"Where is Harrow?\"\u003c/p\u003e\n\u003cp\u003e\"Out of your reach,\" Leo said. \"They took him off to the gaol just before you returned. And don\u0027t bother trying to get to him. I\u0027ve already told the constable not to let you within a hundred yards of the pinfold.\"\u003c/p\u003e\n\u003cp\u003e\"I should think you\u0027d like to reach him first,\" Merripen said. \"You despise him as much as I do.\"\u003c/p\u003e\n\u003cp\u003e\"True. But I believe in letting due process take its course. And I don\u0027t want Beatrix to be disappointed. She\u0027s hoping for a trial.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"She wants to present Dodger as a witness.\"\u003c/p\u003e\n\u003cp\u003eLifting his gaze heavenward, Kev went to the corner of the room and leaned his back against the wall. He listened as the Hathaways exchanged their versions of the day\u0027s events and the constable asked questions and even Noah became involved, which then led to the revelation of Kev\u0027s and Cam \u0027s pasts, and so forth. Information flew in animated volleys. It was never going to end.\u003c/p\u003e\n\u003cp\u003eCam, in the meantime, seemed more than content to lie on the bed while Amelia fussed over him. She smoothed his hair, gave him water, straightened the covers, and caressed him repeatedly. He yawned and struggled to keep his eyes open, and turned his cheek into the pillow.\u003c/p\u003e\n\u003cp\u003eKev turned his attention to Win, who was sitting in a chair near the bed, her back straight as always. She looked serene and proper, except for the loose strands of hair that had slipped from their pins. One would never guess that she was capable of setting a wardrobe on fire. With Dr. Harrow in it. As Leo had put it, the deed may not have reflected well on her intelligence, but one had to give her points for ruthlessness. And it had gotten the job done.\u003c/p\u003e\n\u003cp\u003eKev had been rather sorry to hear that Leo had pulled Harrow out, smoky but unharmed.\u003c/p\u003e\n\u003cp\u003eEventually Amelia announced that the visit must soon come to an end, as Cam needed to rest. The constable departed, as did Noah and the servants, until the only ones left were immediate family.\u003c/p\u003e\n\u003cp\u003e\"I think Dodger\u0027s under the bed.\" Beatrix dropped to the floor and peered under it.\u003c/p\u003e\n\u003cp\u003e\"I want my garter back,\" Miss Marks said darkly, lowering to the carpet beside Beatrix. Leo regarded Miss Marks with covert interest.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Kev wondered what to do about Win.\u003c/p\u003e\n\u003cp\u003eIt seemed that love was working through him inexorably, more exotic and sweet and disorienting than raw opium. More pervasive than oxygen from air. He was so damn tired of trying to resist it.\u003c/p\u003e\n\u003cp\u003eCam had been right. You could never predict what would happen. All you could do was love her.\u003c/p\u003e\n\u003cp\u003eVery well.\u003c/p\u003e\n\u003cp\u003eHe would give in to it, to her, without trying to qualify or control anything. He would surrender. He would come out of the shadows for good. He took a long, slow breath and let it out.\u003c/p\u003e\n\u003cp\u003eI love you, he thought, looking at Win. I love every part of you, every thought and word… the entire complex, fascinating bundle of all the things you are. I want you with ten different kinds of need at once. I love all the seasons of you, the way you are now, the thought of how much more beautiful you\u0027ll be in the decades to come. I love you for being the answer to every question my heart could ask. \u003c/p\u003e","sourceLink":"https://allnovel.net/seduce-me-at-sunrise-the-hathaways-2/page-87.html","bookId":1786,"creation":"Oct 5, 2019 3:38:00 PM","modification":"Oct 5, 2019 3:38:00 PM"}
