{"id":100592,"no":24,"title":"Page 24","content":"\u003cp\u003eCinder’s black eyes darted up, but he kept attacking his food. Perry took a few arrows from his quiver. Checked the fletching as he waited. He’d been wondering why Roar had helped Cinder. But now he understood, seeing the boy this way. Would the Tides end up like this without the second shipment from Sable?\u003c/p\u003e\n\u003cp\u003e“Why is that girl with you?”\u003c/p\u003e\n\u003cp\u003ePerry looked up, surprised. Cinder was still chewing, but the stick was clean. Not a scrap of meat left. His eyebrows were drawn together in a dark scowl.\u003c/p\u003e\n\u003cp\u003ePerry lifted his shoulders, allowing himself a smug smile. “Isn’t it obvious?” The boy’s black eyes went wide. “I’m kidding, Cinder. It’s nothing like that. We’re helping each other out of some trouble.”\u003c/p\u003e\n\u003cp\u003eCinder swiped a grubby sleeve over his face. “But she is pretty.”\u003c/p\u003e\n\u003cp\u003ePerry grinned. “Really? I hadn’t noticed.”\u003c/p\u003e\n\u003cp\u003e“Sure you haven’t.” Cinder smiled like they’d agreed on something important. He pushed his hair away from his face, but it fell back into his eyes. It was a mess of knots. Like his own hair, Perry realized.\u003c/p\u003e\n\u003cp\u003e“What kind of trouble?” Cinder asked.\u003c/p\u003e\n\u003cp\u003ePerry let out a long breath. He didn’t have the time or energy to tell their story again. But he could skip to the part that mattered now. He sat forward, propping his arms over his knees. “You’ve heard of the Croven?”\u003c/p\u003e\n\u003cp\u003e“The flesh eaters? Yeah, I’ve heard of them.”\u003c/p\u003e\n\u003cp\u003e“A couple of nights ago, I got in a mix with them. I’d left Aria to hunt. When I came back, they’d found her. Three of them. They had her cornered.” Perry slid his hand down to the arrowhead. Pressed his finger against the sharp point. This story wasn’t easy to tell either. But he noticed the way Cinder’s expression had opened. The mask of scorn was gone. He was just a boy now, drawn in by a thrilling story. So Perry kept on.\u003c/p\u003e\n\u003cp\u003e“They were blood hungry. I could almost taste their hunger for her. Maybe because she’s a Dweller . . . different . . . I don’t know. But they weren’t going to walk away. I took two down with my bow. The third with my knife.”\u003c/p\u003e\n\u003cp\u003eCinder licked his lips, his black eyes rapt. “So now they’re after you? You were just helping her.”\u003c/p\u003e\n\u003cp\u003e“That’s not how the Croven will see it.”\u003c/p\u003e\n\u003cp\u003e“But you had to kill them.” He shook his head. “People don’t ever understand.”\u003c/p\u003e\n\u003cp\u003ePerry knew he looked stunned. There was something in the way he’d said it. Like it was a burden he knew. “Cinder . . . do you understand?”\u003c/p\u003e\n\u003cp\u003eWariness crept into the boy’s gaze. “Can you really tell when I’m lying?”\u003c/p\u003e\n\u003cp\u003ePerry shifted his shoulders, his heart beating hard. “I can.”\u003c/p\u003e\n\u003cp\u003e“Then my answer is maybe.”\u003c/p\u003e\n\u003cp\u003ePerry couldn’t believe it. This kid . . . this pathetic boy had killed someone? “What happened to you? Where are your parents?”\u003c/p\u003e\n\u003cp\u003eCinder’s mouth twisted into a snide smile, his temper a cool, sudden drift. “They died in an Aether storm. It happened about two years ago. Poof, and they were gone. It was sad.”\u003c/p\u003e\n\u003cp\u003ePerry didn’t need his Sense to know he was lying. “Were you forced out here?” Blood Lords exiled murderers and thieves into the borderlands.\u003c/p\u003e\n\u003cp\u003eCinder laughed, a sound that belonged to someone much older. “I like it out here.” His smile faded. “This is my home.”\u003c/p\u003e\n\u003cp\u003ePerry shook his head. He slipped the arrows back into his quiver, grabbed his bow, and stood. He had to get moving. “You can’t keep tailing us, Cinder. You’re not strong enough and it’s too dangerous. Head off while there’s still time.”\u003c/p\u003e\n\u003cp\u003e“You can’t tell me what to do.”\u003c/p\u003e\n\u003cp\u003e“You have any idea what the Croven do to kids?”\u003c/p\u003e\n\u003cp\u003e“I don’t care.”\u003c/p\u003e\n\u003cp\u003e“You should. Head south. There’s a settlement two days from here. Climb a tree if you need to sleep.”\u003c/p\u003e\n\u003cp\u003e“I’m not afraid of the Croven, Scire. They can’t hurt me. No one can.”\u003c/p\u003e\n\u003cp\u003ePerry almost laughed at him. It was an impossible claim. But Cinder’s temper was cool and sharp and clear. Perry inhaled again, waiting for it to sour with his lie.\u003c/p\u003e\n\u003cp\u003eIt never did.\u003c/p\u003e\n\u003cp\u003ePerry’s mind was racing as he caught up to Aria and Roar. He hung back a ways, needing some space of his own, too absorbed by what Cinder had said. They can’t hurt me. No one can. He’d been sure when he had said those words. But how could Cinder believe something like that?\u003c/p\u003e\n\u003cp\u003ePerry wondered if he’d read the boy’s temper wrong. Was it the pine or Cinder’s strange Aether scent throwing off his nose? Or was Cinder mentally wounded? Had he convinced himself he was untouchable in order to survive alone? The afternoon hours passed, silent and swift, and Perry still struggled to understand.\u003c/p\u003e\n\u003cp\u003eAt dusk they emerged from a dense grove of pines to a rugged basin. A range of sharp peaks framed the northern horizon. Roar left Aria’s side, dropping back to get a better sense of the distance between them and the Croven.\u003c/p\u003e\n\u003cp\u003ePerry fell in step with her. He counted twenty paces before he spoke. “Do you want to rest?” He wondered how she was managing. His own feet ached, and they weren’t cut and blistered.\u003c/p\u003e\n\u003cp\u003eHer gray eyes turned to him. “Why do you even bother asking?”\u003c/p\u003e\n\u003cp\u003eHe stopped. “Aria, that’s not how my Sense works. I can’t tell if you’re—”\u003c/p\u003e\n\u003cp\u003e“I thought we weren’t supposed to talk out here,” she said without breaking her stride.\u003c/p\u003e\n\u003cp\u003ePerry frowned as he watched her go. How had it happened that now he wanted to talk but she didn’t?\u003c/p\u003e\n\u003cp\u003eRoar came back a short while later. “It’s not good news. The Croven have broken into smaller groups. They’re coming right around us. We’re losing our lead, too.”\u003c/p\u003e\n\u003cp\u003ePerry shifted the bow and quiver on his back, eyeing his best friend. “You don’t need to do this. Aria and I have to get to Marron’s, but you don’t.”\u003c/p\u003e\n\u003cp\u003e“Sure, Per. I’ll just go then.”\u003c/p\u003e\n\u003cp\u003eHe’d expected the answer. Perry would never leave Roar in trouble either. But Cinder was another matter. “Did the kid leave?”\u003c/p\u003e\n\u003cp\u003e“Still on our tail,” Roar said. “I told you he’s a burr. Your little talk with him earlier didn’t help. He’ll probably never leave now.”\u003c/p\u003e\n\u003cp\u003e“You heard us?”\u003c/p\u003e\n\u003cp\u003e“Every word.”\u003c/p\u003e\n\u003cp\u003ePerry shook his head. He’d forgotten the strength of his friend’s ears. “You ever get tired of eavesdropping?”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003e“What do you think he’s done, Roar?”\u003c/p\u003e\n\u003cp\u003e“I don’t care and neither should you. Come on. Let’s catch up to Aria. She’s that way.”\u003c/p\u003e\n\u003cp\u003e“I know which way she went.”\u003c/p\u003e\n\u003cp\u003eRoar thumped him on the shoulder. “Just making sure you noticed.”\u003c/p\u003e\n\u003cp\u003eLate into the night, with the miles blurring together, Perry’s thoughts took on the vividness of dreams. He imagined Cinder on the beach, being dragged into a Hover by Dwellers. Then Talon, surrounded by black-caped men with crow masks. By daybreak, the Croven were closing on them like a net, and Perry had decided to do whatever it took. He would not hold Cinder’s life in his hands.\u003c/p\u003e\n\u003cp\u003e“I’ll be back,” he said. He turned downhill, letting Roar and Aria pull ahead. Cinder wasn’t in eyeshot, but Perry knew he wasn’t far. He let the stinging sensation in his nose lead him to the boy.\u003c/p\u003e\n\u003cp\u003eWhen he found Cinder, Perry kept back for a moment and watched him through the woods. He had a lost, sorrowful look about him when he didn’t think he was being watched. It was harder to see him this way than when he sneered.\u003c/p\u003e\n\u003cp\u003e“Last chance to leave,” Perry said.\u003c/p\u003e\n\u003cp\u003eCinder jumped back, swearing. “You shouldn’t sneak up on me, Scire.”\u003c/p\u003e\n\u003cp\u003e“I said it’s time for you to go.” The terrain ahead opened into a broad plateau. Cinder wouldn’t have the cover of the woods to help him make a break on his own. He would be trapped with them if he didn’t leave now.\u003c/p\u003e\n\u003cp\u003e“This isn’t your territory,” he said, spreading his bony arms wide. “And I’m not pledged to you.”\u003c/p\u003e\n\u003cp\u003e“Get out of here, Cinder.”\u003c/p\u003e\n\u003cp\u003e“I told you before. I go where I want.”\u003c/p\u003e\n\u003cp\u003ePerry slid off his bow, nocked an arrow, and aimed at Cinder’s throat. He didn’t know what he planned to do, only that he couldn’t watch this scrawny boy die because of him. “Be gone before it’s too late.”\u003c/p\u003e\n\u003cp\u003e“No!” Cinder shouted. “You need me!”\u003c/p\u003e\n\u003cp\u003e“Leave now.” Perry brought the bowstring back to full draw.\u003c/p\u003e\n\u003cp\u003eCinder made a low, growling sound. Perry sucked in a breath as the prickling sensation behind his nose sharpened, turned to stabbing.\u003c/p\u003e\n\u003cp\u003eA blue flame lit in Cinder’s dark eyes. For an instant, Perry thought it was the Aether reflecting in his black eyes, but it grew brighter and brighter. Glowing blue lines crept up from Cinder’s sagging collar, winding up his neck. Snaking over his bony jaw and face. Perry couldn’t believe what he saw. Cinder’s veins lit like they ran with Aether.\u003c/p\u003e\n\u003cp\u003eSplinters of pain flushed across Perry’s arms and face. “Stop what you’re doing!”\u003c/p\u003e\n\u003cp\u003eRoar and Aria ran up to them. Roar had his knife in his hand. They froze when they saw Cinder. Perry’s heart drummed wildly. Cinder’s glowing eyes stared through him, vacant and bright.\u003c/p\u003e\n\u003cp\u003ePerry gritted his teeth as his muscles began to twitch painfully. “Cinder, stop!”\u003c/p\u003e\n\u003cp\u003eThe boy put his palms up, showing hands webbed with Aether. The charge in the air surged, sending another stabbing wave over Perry’s skin.\u003c/p\u003e\n\u003cp\u003eWhat was he?\u003c/p\u003e\n\u003cp\u003eHeat flared across the knuckles of Perry’s forward hand, gripping the bow. The steel arrowhead inches away began to glow orange. Reflex took over. He made a quick adjustment off his mark and loosed the arrow.\u003c/p\u003e\n\u003cp\u003eAn explosion of light blinded Perry, keeping him from seeing what he’d struck. He didn’t feel himself drop onto the dirt or ball up around his arm. He lost time. Knew only that something terrible had happened. The scent of his own cooked flesh brought him back to a world where pain was everything. Terrible animal groans filled his ears. They came from him.\u003c/p\u003e\n\u003cp\u003e“Stay back!” Cinder yelled. Through squinted eyes, Perry saw Roar and Aria uphill, both motionless and stunned. Scorched smells flooded Perry’s nose. Burnt hair and wool and skin.\u003c/p\u003e\n\u003cp\u003eCinder dropped to his knees at his side. “What happened?” he asked. “What did you make me do?” The blue of Cinder’s eyes was fading. His veins melted back into his skin.\u003c/p\u003e\n\u003cp\u003ePerry couldn’t answer. He didn’t know if he still had a hand. He couldn’t bring himself to look.\u003c/p\u003e\n\u003cp\u003eCinder trembled. His entire body was quaking. “What did I do? You fired. . . . You were going to shoot me.”\u003c/p\u003e\n\u003cp\u003ePerry managed to shake his head. “Just needed you to go.”\u003c/p\u003e\n\u003cp\u003eCinder looked stricken. He climbed to his feet, his balance weaving wildly. “I don’t have anywhere to go,” he said, his words choked. Stooping, bent over his stomach like he’d been punched, he staggered into the woods.\u003c/p\u003e\n\u003cp\u003eRoar and Aria thundered up. Roar took one look at Perry’s hand and went white.\u003c/p\u003e\n\u003cp\u003ePerry met his eyes. “Help him. Bring him back.”\u003c/p\u003e\n\u003cp\u003e“Help him? I’m going to slit his throat.” \u003c/p\u003e","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-24.html","bookId":1657,"creation":"Oct 5, 2019 6:54:20 PM","modification":"Oct 5, 2019 6:54:20 PM"}
