{"id":100593,"no":25,"title":"Page 25","content":"\u003cp\u003e“Just get him back here, Roar!”\u003c/p\u003e\n\u003cp\u003eWhen he was gone, Perry lay back and stared through the trees. The Aether swirled above. He closed his eyes. Concentrated on breathing.\u003c/p\u003e\n\u003cp\u003e“Perry, can I see?”\u003c/p\u003e\n\u003cp\u003eAria knelt at his side. “Let me see,” she said softly, reaching for his hand.\u003c/p\u003e\n\u003cp\u003eHe sat up, a groan tearing through his throat. Then he looked at his left hand for the first time. It had swollen to twice its normal size. The skin over his knuckles looked like blackened meat. Big, red blisters crowded the flat of his hand, making a trail down his wrist. Perry’s stomach twisted. Stars burst before his eyes. He swallowed back the sour rush in his mouth. He was going to vomit or pass out. Maybe both.\u003c/p\u003e\n\u003cp\u003e“Put your head down and breathe. I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eShe handed him the bottle of Luster when she returned. Perry drank. Didn’t stop until he’d drained what was left. He dropped the bottle to the side. Aria had taken his burnt hand into her lap and pushed his sleeve up. She held a long strip of gauze. Her belt once, he realized. She poured water over it.\u003c/p\u003e\n\u003cp\u003e“I should wrap it, Perry. So it doesn’t get infected.”\u003c/p\u003e\n\u003cp\u003eCold sweat broke out over his back. Perry met her eyes for only a second, afraid she’d see his fear. He nodded and let his head fall forward again.\u003c/p\u003e\n\u003cp\u003eHer first touch over his knuckles was feather soft, but chills came over him, shaking his shoulders. Aria’s hands went still.\u003c/p\u003e\n\u003cp\u003e“Keep going,” he said, before he could change his mind and rip his arm off. It might have hurt less. He kept his head down. Watched the dark spots his tears made as they fell on his leather pants. He wanted to ask her to sing. He remembered her voice, how it had carried him away. He couldn’t form the words. But then the Luster kicked in, saving him by dulling some of the pain. Perry pushed the wetness off his cheeks and straightened, swaying unsteadily.\u003c/p\u003e\n\u003cp\u003eAria wrapped the long strip of gauze around his wrist, and then wove it up, looping it through each of his fingers. She was calm now. Focused. He watched her as he sank deeper and deeper into the mind-numbing fog of Luster.\u003c/p\u003e\n\u003cp\u003eShe was touching him. He wondered if she realized it too.\u003c/p\u003e\n\u003cp\u003e“Have you ever seen someone like him before?” she asked.\u003c/p\u003e\n\u003cp\u003eCinder. A boy with Aether in his blood. “No. Never seen that,” he slurred. Perry wondered how it was possible, but he couldn’t deny what he’d seen. Not with proof moving through him in agonizing waves. How many times had he looked up and felt connected to the sky himself? Like it wasn’t just some faraway force? Like his own mood ebbed and flowed with the Aether? He should’ve trusted his Sense. Cinder set off the same stinging sensation in his nose. And he’d known the boy was hiding something.\u003c/p\u003e\n\u003cp\u003e“I was trying to help. . . . The more I try to catch up, the farther I fall behind.” The words slipped out, clumsy but true.\u003c/p\u003e\n\u003cp\u003eAria looked up from his hand. “What did you say?”\u003c/p\u003e\n\u003cp\u003eHer face blurred left and right. Finally his focus pinned on her.\u003c/p\u003e\n\u003cp\u003e“Nothing. Nothing. Just stupid things.”\u003c/p\u003e\n\u003cp\u003eRoar came back carrying Cinder across his neck in a hunter’s hold, legs to one side, arms to the other.\u003c/p\u003e\n\u003cp\u003e“Is he dead?” The question came out of Perry in one sound, all of the words sliding together.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, no,” Roar said, out of breath.\u003c/p\u003e\n\u003cp\u003eCinder balled up as soon as Roar set him down. He was shaking worse than before. He turned his face into the earth. Perry saw wide patches of bare scalp. They hadn’t been there before. His clothes were blackened. Almost falling off completely.\u003c/p\u003e\n\u003cp\u003e“We have to leave him, Perry. He’s too weak.”\u003c/p\u003e\n\u003cp\u003e“We can’t.”\u003c/p\u003e\n\u003cp\u003e“Look at him, Peregrine. He can barely hold his head up.”\u003c/p\u003e\n\u003cp\u003e“The Croven will come through here.” Perry gritted his teeth as stars bloomed before his eyes. Fewer words, he told himself. Less movement. Just breathing.\u003c/p\u003e\n\u003cp\u003eAria draped a blanket over Cinder. She bent close. “Is it the Aether?”\u003c/p\u003e\n\u003cp\u003ePerry peered up. The Aether had a soft, washed-out look. It had waned back to the wisps of earlier that day. He was in so much pain, he hadn’t noticed. Then he realized the sting in his nose was faint. Hardly there. Cinder had to be linked to the Aether tides.\u003c/p\u003e\n\u003cp\u003e“Just leave,” Cinder rasped.\u003c/p\u003e\n\u003cp\u003e“Listen to him, Perry. It’s a haul to Marron’s, and we’ve got twenty Croven on our heels. Are you really going to risk our lives for this fiend?”\u003c/p\u003e\n\u003cp\u003ePerry didn’t have the strength to argue. He climbed to his feet, concentrating on hiding his unsteadiness. “I’ll carry him.”\u003c/p\u003e\n\u003cp\u003e“You will?” Roar shook his head, his laugh dry. “He’s not Talon, Perry!”\u003c/p\u003e\n\u003cp\u003ePerry wanted to punch him. He tried to get himself over to Roar, but his legs took him sideways. Aria jumped up, darting toward him, but he found his balance. For a moment, he was staring down into her eyes. Seeing her worry. She turned to Roar.\u003c/p\u003e\n\u003cp\u003e“He’s right, Roar. We can’t leave him like this. And we’re only wasting time arguing.”\u003c/p\u003e\n\u003cp\u003eRoar looked from Aria to him. “I can’t believe I’m doing this.” He went to Cinder and hoisted the boy roughly onto his shoulders, cursing viciously as he turned up the mountain and set off.\u003c/p\u003e\n\u003cp\u003eThey traveled in a close pack now. Aria walked to Perry’s right, the blisters and cuts on her feet hidden by boots. Roar trudged to his left, breathing hard, making the climb to Marron’s with a hundred extra pounds on his shoulders. Perry tucked his arm close to his chest, but it didn’t help. He felt his heartbeat thumping in his hand with every step. Thirst gripped him. He emptied every one of their skins within the first hour but found no relief.\u003c/p\u003e\n\u003cp\u003eWhen the Luster wore off, he battled waves of pain that threatened to drop him. But he noticed something else, too. The pine shroud had lifted. Scents came with familiar clarity, isolated and sharp. His nose had finally adjusted.\u003c/p\u003e\n\u003cp\u003eThe Croven’s fetid scents carried to him on the wind. He counted more than two dozen individual scents. Stronger, closer, were Aria’s and Roar’s tempers.\u003c/p\u003e\n\u003cp\u003eFrom them he scented only fear.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eAria stared into the woods with burning eyes, searching for crow masks and black capes. They were moving too slow and stopping too often for Roar to catch his breath. When they did rest, she didn’t miss the look of relief on Perry’s ashen face. Somehow, despite the state of her feet, she’d become the fastest one among them.\u003c/p\u003e\n\u003cp\u003eHer gaze fell to Perry’s bandaged hand. The white gauze, bright in the fading daylight, was spotted with blood. She’d never seen a wound like that. She couldn’t imagine the pain he was in. She couldn’t believe what had happened.\u003c/p\u003e\n\u003cp\u003eWho was Cinder? How could a human have that kind of power? Aria knew about animals that used bioelectricity. Rays and eels. But a boy? It was like something from a Realm. But then hadn’t she just learned about Scires and Auds and Seers? Couldn’t Cinder’s ability be just another mutation? Harnessing the Aether seemed like a massive genetic break. But it was possible.\u003c/p\u003e\n\u003cp\u003eShe lost herself in the rhythm of picking her feet up and setting them down until Roar stopped suddenly and dropped Cinder on the dirt, making no effort at gentleness.\u003c/p\u003e\n\u003cp\u003e“I can’t carry him anymore.”\u003c/p\u003e\n\u003cp\u003eNight had fallen but a full moon shone, bold and bright in the sky. The Aether had weakened, fading to a wash of pale light. They’d reached a stretch of flat land. The mountain climbed up ahead, growing thickly wooded again.\u003c/p\u003e\n\u003cp\u003eCinder lay in a heap, his eyes closed. He wasn’t shivering anymore. Perry swayed beside her.\u003c/p\u003e\n\u003cp\u003e“We’re almost there,” he said, tipping his head toward the wooded slope. “It’s just there.”\u003c/p\u003e\n\u003cp\u003eRoar shook his head. “My legs.”\u003c/p\u003e\n\u003cp\u003ePerry nodded. “I’ll take him.”\u003c/p\u003e\n\u003cp\u003eCinder’s eyes opened to slits, searching for Perry. “No.” His voice was small, a whimper. He rolled to the side, turning his back to them.\u003c/p\u003e\n\u003cp\u003ePerry stared at him for a moment. Then he took Cinder’s wrist, pulling the boy’s arm across his shoulder. Perry’s wounded arm wrapped around Cinder’s waist as he hauled Cinder up. They began to walk together, Perry bending forward to bring himself closer to Cinder’s height.\u003c/p\u003e\n\u003cp\u003eCinder glanced up as they passed her, his black eyes sparkling with the sheen of tears. With shame, Aria realized. He’d torched the hand that now held him upright.\u003c/p\u003e\n\u003cp\u003eAria whirled around. “What is that?” The night had a new noise. A faraway hum.\u003c/p\u003e\n\u003cp\u003e“Bells,” Roar said, glaring at the woods.\u003c/p\u003e\n\u003cp\u003eShe remembered Harris’s words. “To drive away dark spirits,” she said.\u003c/p\u003e\n\u003cp\u003e“To drive me mad.” Roar took something from his bag. A black hat that he pulled over his head. Heavy flaps came down to cover his ears. “They disorient me.”\u003c/p\u003e\n\u003cp\u003ePerry turned. He lifted his head slightly, his eyes scanning as he drew a breath through his nose in a natural, wild gesture. This was him. The Scire. The Seer. He met Roar’s gaze, a silent message passing between them.\u003c/p\u003e\n\u003cp\u003e“We have to run,” Roar said.\u003c/p\u003e\n\u003cp\u003eTerror shot through her. She looked at Cinder, hanging at Perry’s side. “How are you going to run with him?”\u003c/p\u003e\n\u003cp\u003eHe was moving before she’d finished asking the question. Aria reached into her pockets and scooped out the rocks she’d collected. She let them scatter on the ground.\u003c/p\u003e\n\u003cp\u003eMinutes after they started running, her muscles cramped. Nausea rose up in her, which she didn’t understand, as she hadn’t eaten in a day. She pushed on. Her boots caught on every small stone. Every step stabbed the bottoms of her feet. Trees loomed up ahead, shadowed shapes on the hillside. The trees would hide them. She ran and ran and still they seemed no closer.\u003c/p\u003e\n\u003cp\u003e“They’re running too,” Perry said after another stretch. An hour? A minute? All the color had drained from his face. She could see that even in the dark.\u003c/p\u003e\n\u003cp\u003eShe didn’t notice when dawn came, gray and misty. Or when they’d made it to the incline where the trees began. She appeared beneath the pines suddenly, like she’d fractioned into a Realm.\u003c/p\u003e\n\u003cp\u003e“Move, Cinder. Run,” Perry told him.\u003c/p\u003e\n\u003cp\u003eCinder’s feet dragged. He was barely supporting his own weight anymore.\u003c/p\u003e\n\u003cp\u003eAria bit her lip, searching desperately into the woods for the Croven. The bells were loud now, disorienting like Roar said. “Let me take him, Perry.”\u003c/p\u003e\n\u003cp\u003ePerry slowed. His hair was slick and darkened with sweat. His soaked shirt sucked to his frame. He nodded, letting her take Cinder. Cinder was freezing to the touch. His eyes had rolled to the back of his head. Roar appeared at his other side. Together, they dug in, pushing, carrying Cinder between them as the slope grew steeper and the bells rang louder.\u003c/p\u003e\n\u003cp\u003eRoar stopped. “Straight uphill. Can you manage without me?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She turned and her heart seized. “Where’s Perry?”\u003c/p\u003e\n\u003cp\u003e“Slowing the Croven down.”\u003c/p\u003e\n\u003cp\u003eHe’d left? He’d gone back?\u003c/p\u003e\n\u003cp\u003eRoar drew his knife. “Keep moving. Get to Marron’s. Get us help.”\u003c/p\u003e\n\u003cp\u003eHe tore down the slope, his black clothes fading into the shadows. Aria firmed her grip around Cinder’s bony ribs and pressed on, her every step weighted by terror. She couldn’t push back the thought . . . What if she never saw them again? What if that was the last time she’d see Perry? She wouldn’t let it be. \u003c/p\u003e","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-25.html","bookId":1657,"creation":"Oct 5, 2019 6:54:20 PM","modification":"Oct 5, 2019 6:54:20 PM"}
