{"id":100610,"no":42,"title":"Page 42","content":"\u003cp\u003eHe let the arrow go.\u003c/p\u003e\n\u003cp\u003eChapter 41\u003c/p\u003e\n\u003cp\u003eARIA\u003c/p\u003e\n\u003cp\u003eThe spotlight exploded with a deafening pop that burst through the speakers of Aria’s helmet. The two Guardians by the rescue center ramp startled at the sudden darkness. In seconds, a dozen men flooded down the ramp to see what had happened. Aria slipped from the shadows into the commotion and then darted toward the rescue center, her shoulders brushing against Guardians who were hurrying outside.\u003c/p\u003e\n\u003cp\u003eShe put one foot in front of the other through a long metal corridor, passing a pair of Guardians. They barely glanced at her. She wore their clothes. She had a helmet and a Smarteye. She was one of them.\u003c/p\u003e\n\u003cp\u003eAria strode with purpose, though she didn’t know where she was going. Her eyes searched frantically as she passed opened doors along the hall. She glimpsed cots and medical equipment. This part of the rescue center nearest the entrance held triage chambers, which didn’t surprise her, but the stillness in the rooms did. Where were the survivors?\u003c/p\u003e\n\u003cp\u003eWere there any?\u003c/p\u003e\n\u003cp\u003eHow was she going to find her mother?\u003c/p\u003e\n\u003cp\u003eShe slowed as she approached the next chamber, listening first and then peering inside. Aria stepped into the room, her gaze sweeping, making sure she was alone.\u003c/p\u003e\n\u003cp\u003eShe wasn’t.\u003c/p\u003e\n\u003cp\u003ePeople lay in stacked bunks along the walls. Not wearing helmets. Unmoving. Aria walked farther into the room, taking in their open wounds and the dark bloodstains that seeped into their grays. They were dead. Every one.\u003c/p\u003e\n\u003cp\u003eSuddenly she couldn’t escape the stench that clung to her hair, of the bodies she’d had to crawl through outside. Every breath she took, she smelled the odor of death. Desperate now, she searched for Lumina’s face, moving from one row of cots to the other. From one lifeless body to the next. The marks of brutality were everywhere. Mottled yellow bruising. Scratches and ripped flesh. Bite marks.\u003c/p\u003e\n\u003cp\u003eShe couldn’t help imagining what had happened. So many people, turning on each other like rabid animals. Like Soren in Ag 6. Her mother had been trapped in this.\u003c/p\u003e\n\u003cp\u003eWhere was she?\u003c/p\u003e\n\u003cp\u003eAria heard a faint voice and spun. Someone approached. She tensed, ready to hide, but then she recognized the voice and froze. Was that Doctor Ward? Lumina’s colleague? He entered the room, glancing through his visor in her direction, and then stopped. Hope surged through her. He would know how to find her mother.\u003c/p\u003e\n\u003cp\u003e“Doctor Ward?” she said.\u003c/p\u003e\n\u003cp\u003e“Aria?” For a moment they stared at each other. “What are you doing here?” he asked, and then answered his own question. “You’ve come for your mother.”\u003c/p\u003e\n\u003cp\u003e“You have to help me, Doctor Ward. I need to find her.”\u003c/p\u003e\n\u003cp\u003eHe came toward her, leveling his intense gaze on her. “She’s here,” he said. They were the words she’d wanted to hear, but the tone was all wrong. “Come with me.”\u003c/p\u003e\n\u003cp\u003eAria followed him through the metal halls. She knew what was happening. She knew what he was going to tell her. Lumina was dead. She had heard it in his voice.\u003c/p\u003e\n\u003cp\u003eShe followed him, her head spinning with dizziness, her legs heavy and slow. This wasn’t real. It couldn’t be. She couldn’t lose Lumina, too.\u003c/p\u003e\n\u003cp\u003eHe took her into a small, bare room with a heavy airlock door that hissed as it closed behind her.\u003c/p\u003e\n\u003cp\u003e“The storms kept us away,” Ward said. A muscle by his Smarteye twitched. “We were too late.”\u003c/p\u003e\n\u003cp\u003e“Can—can I see her? I need to see her.”\u003c/p\u003e\n\u003cp\u003eWard hesitated. “Yes. Wait here.”\u003c/p\u003e\n\u003cp\u003eWhen he left, Aria staggered back. Her helmet clacked against the wall. She slid to the floor. Every muscle shook. Tears ached behind her eyes. She tried to press her palms into them, but her hands smacked into the visor. She panted, her breath loud to her own ears.\u003c/p\u003e\n\u003cp\u003eThe airlock door slid open. Ward pushed a gurney into the small chamber. A long black bag made of thick plastic lay on top. “I’ll be outside,” he said, and left.\u003c/p\u003e\n\u003cp\u003eAria stood. Cold emanated from the bag, rising like wisps of smoke. She opened the seal around her gloves and pulled them off. She unfastened the helmet, letting it clatter to the floor. She had to do this. She had to know. Her fingers trembled as she fumbled for the zipper. She braced herself for an opened gash. Bruises. Something terrible, like what she’d seen outside. Then she drew the zipper down, exposing her mother’s face.\u003c/p\u003e\n\u003cp\u003eShe saw no horrible wound, but the pallor of Lumina’s skin was worse, nearly white, but deeply shadowed with purple around her eyes. Her hair fell in messy strands across her closed eyes. Aria brushed it away—Lumina would never have tolerated hair like that—and sucked in a breath at the coldness of her mother’s skin.\u003c/p\u003e\n\u003cp\u003e“Oh, Mom.”\u003c/p\u003e\n\u003cp\u003eTears pushed from the edges of her Smarteye and ran down her cheeks.\u003c/p\u003e\n\u003cp\u003eShe rested her hand on Lumina’s forehead until her skin burned with cold. She had so many questions. Why had Lumina lied about Aria’s father? Who was he? How could she have left Aria and gone to Bliss when she’d known the danger of DLS? But she needed one answer most.\u003c/p\u003e\n\u003cp\u003e“Where am I supposed to go, Mom?” she whispered. “I don’t know where to go.”\u003c/p\u003e\n\u003cp\u003eShe knew what Lumina would say. That’s a question for you to answer, Songbird.\u003c/p\u003e\n\u003cp\u003eAria closed her eyes.\u003c/p\u003e\n\u003cp\u003eShe knew she could answer it. She knew how to put one foot in front of the other even when every step hurt. And she knew there was pain in the journey, but there was also great beauty. She’d seen it standing on rooftops and in green eyes and in the smallest, ugliest rock. She would find the answer.\u003c/p\u003e\n\u003cp\u003eShe bent close to her mother’s face. Quietly she sang the Tosca aria, her voice warbling and breaking, but she knew it didn’t matter. She’d promised Lumina this aria—their aria—so she sang.\u003c/p\u003e\n\u003cp\u003eThe door slid open as she finished. Three Guardians strode into the chamber.\u003c/p\u003e\n\u003cp\u003e“Wait,” she said. She wasn’t ready to say good-bye. Would she ever be?\u003c/p\u003e\n\u003cp\u003eOne man zipped the bag closed with a quick tug and then wheeled the gurney out. The other two Guardians stayed behind.\u003c/p\u003e\n\u003cp\u003e“Give me your Smarteye,” said the one closest to her.\u003c/p\u003e\n\u003cp\u003eBehind him, the other Guardian held a white baton that made a fizzing electrical sound.\u003c/p\u003e\n\u003cp\u003eAria lunged for the door on instinct.\u003c/p\u003e\n\u003cp\u003eThe Guardian with the baton blocked her.\u003c/p\u003e\n\u003cp\u003eLight flashed before her eyes and then everything went black.\u003c/p\u003e\n\u003cp\u003eChapter 42\u003c/p\u003e\n\u003cp\u003ePEREGRINE\u003c/p\u003e\n\u003cp\u003ePerry couldn’t leave. He stayed on the overlook, waiting for her to come back. What was happening? Had she found Lumina? Was she all right? He watched as the Guardians fixed the light below. He watched as they made their way back into the rescue center and as the night grew still again.\u003c/p\u003e\n\u003cp\u003eShe didn’t come back out, and he realized she never would.\u003c/p\u003e\n\u003cp\u003eHe spun and ran, tearing into the darkness. He should’ve headed west, toward home. But his legs followed the trail of smoke carrying on the wind. Soon he saw the glow of firelight flickering through a stand of trees. Heard the soft pluck of a guitar and men’s voices. He approached, counting six men gathered around the fire.\u003c/p\u003e\n\u003cp\u003eThe guitar went silent as they spotted him. Perry slipped Talon’s knife from his belt. He held it out, bringing a few men to their feet. “A trade. For drink.” He nodded toward the bottles by the fire.\u003c/p\u003e\n\u003cp\u003e“It’s a fine blade,” said one man. He turned to another man who’d stayed where he sat across the fire. He had braided hair and a long scar from the bottom of his nose to his ear. He watched Perry for a long moment.\u003c/p\u003e\n\u003cp\u003e“Make the trade,” he said.\u003c/p\u003e\n\u003cp\u003ePerry handed the knife off, wanting to be rid of it and all its memories. He was given two bottles of Luster. One more than anyone should drink in one night. He took them and moved away from the fire. The guitar picked up its song again. Perry set the bottles down beside him. He’d take his father’s cue tonight.\u003c/p\u003e\n\u003cp\u003eAn hour later, the first bottle stood on end beside him. It wove back and forth on the dirt, riding some invisible tide. Perry started on the other bottle. He should have known it wouldn’t be enough. His body was numb, but not the ache deep inside him. Aria was gone, and no amount of Luster would change that.\u003c/p\u003e\n\u003cp\u003eThe braid-haired man kept looking across the fire at him. Come on, Perry pleaded silently, his hands curling into fists. Get up. Let’s get it over with. It took Braids a few more minutes to come over. He squatted a few feet away, sitting on his heels.\u003c/p\u003e\n\u003cp\u003e“I heard of you,” he said. He looked sturdy, thick, but Perry sensed he could be quick as a trap. The scar cut a deep line across his cheek.\u003c/p\u003e\n\u003cp\u003e“Good for you,” Perry slurred. “I got no idea who you are. Nice hair, though. My sister does hers like that.”\u003c/p\u003e\n\u003cp\u003eBraids looked right at Perry’s burnt hand. “Dispersed life not suiting you, Tider? No elder brother to look after you? To keep you out of trouble?” Braids set a hand down on the dirt and leaned forward. “You reek of misery.”\u003c/p\u003e\n\u003cp\u003eHe was a Scire. Braids would know Perry’s temper right now. How he hurt. How just breathing felt like work. It should have worried him, fighting someone who had the same advantages he did. But Perry heard himself laugh.\u003c/p\u003e\n\u003cp\u003e“You reek too, man,” Perry said. “Like you’ve been chewing on cud.”\u003c/p\u003e\n\u003cp\u003eBraids stood. He kicked the full bottle of Luster, sending it spinning into the darkness. The other men rushed over, their excitement like sparks in Perry’s nose. He’d figured he would end up brawling tonight. He knew how people reacted at the sight of him. What man wouldn’t stand taller after beating the spit out of someone like him?\u003c/p\u003e\n\u003cp\u003ePerry grabbed his knife and stood. “Let’s get to it. See what you can do.”\u003c/p\u003e\n\u003cp\u003eBraids squared off, flashing a wicked piece of steel with serrated teeth. More a saw than a knife. He looked steady and moved smoothly, but his temper was streaked through with fear.\u003c/p\u003e\n\u003cp\u003ePerry grinned. “You changing your mind?”\u003c/p\u003e\n\u003cp\u003eBraids came at him like a shot. Perry felt the bite of the knife on his arm, but not the pain of the wound it opened. A solid wound. The blood that poured from it was dark in the Aether light. For a second, all he could do was watch his blood leak out of him. Run down his arm.\u003c/p\u003e\n\u003cp\u003eMaybe this wasn’t a good idea. Perry had never fought anyone drunk. He moved too slowly. His legs were too heavy. Maybe it had worked for his father because Perry had been a boy. How hard could it be to hit a kid who’d stood there, wanting it? Looking for anything he could to make things right?\u003c/p\u003e\n\u003cp\u003eHe choked back a sudden rise of bile, realizing the choice he’d have to make if Braids managed to get a knife against his throat. Pledge fealty or die. An easy decision.\u003c/p\u003e\n\u003cp\u003e“You’re nothing like I’d heard,” Braids said. “Peregrine of the Tides. Twice Marked.” He laughed. “You’re not worth the air you breathe.”\u003c/p\u003e\n\u003cp\u003eNow was the time to shut him up. Perry spun the blade in his hand, almost dropping it. He made a move. A thrust that wasn’t nearly as fast as it should’ve been. He almost laughed. Knives had never been his weapon. The movement brought another wave of nausea, this one powerful enough to double him up.\u003c/p\u003e\n\u003cp\u003eBraids rushed him as he choked back the urge to vomit. He drove his knee into Perry’s face. Perry managed to turn his head. Took the brunt of the blow on the temple. He’d spared his nose, but he hit the ground hard. Saw the creep of darkness threatening to take him away.\u003c/p\u003e\n\u003cp\u003eThe kicks kept coming, landing on his back and arms and head. They came from everywhere. Perry felt them dimly, shadows of pain. He didn’t stop Braids. This was the easy way. Staying down. Perry’s head rocked forward as a kick came from behind. The blackness came again, softening the edges of his vision. He willed it to come. Maybe it would make more sense if he felt on the surface as he did inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/under-the-never-sky-under-the-never-sky-1/page-42.html","bookId":1657,"creation":"Oct 5, 2019 6:54:20 PM","modification":"Oct 5, 2019 6:54:20 PM"}
