{"id":24869,"no":14,"title":"CHAPTER XIII. THE OFFER OF THE SHAWNEE CHIEF.","content":"\u0026nbsp;Boone and the chief of the Shawnees were alone together in the Indian wigwam. \n\u003cdiv\u003e\n The white man wondered why the Indian had dismissed his warriors. He guessed that the chief had probably something to say to him privately, and which he did not wish the others to hear; but of the nature of that communication he could not form the least idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ke-ne-ha-ha surveyed the prisoner for a moment in silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n The dim light of the fire illuminated the interior of the wigwam, so that each could plainly distinguish the face of the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length the chief spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The pale-face is a great warrior in his nation—many red chiefs have fallen by his hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but it was in fair fight, man to man,” replied the scout.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The squaws of the slain braves mourn their loss—they call upon the chief of the Shawnees to give them the blood of the white-skin who has stained his hand red with the blood of the Shawnee. The tears of the widowed wives fall thick upon the ground. The heart of Ke-ne-ha-ha is sad when he thinks of the brave warriors that the pale-face has sent to the happy hunting-grounds. Why should not the Long Rifle die by the hand of the red-man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What on yearth is the use of askin’ any such foolish questions?” cried Boone, impatiently. “You know very well that you’re going to put an end to me, if you can. As for the blood that I’ve shed of your nation, I’ve always struck in self-defense. If any of your warriors feel aggrieved, I’m ready to meet ’em—even two to one—and give ’em all the satisfaction that they want.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ke-ne-ha-ha looked at the white keenly as he uttered the bold defiance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ugh! When the hunters catch the bear they do not let him go free again, nor do they let the Long Rifle go free now that they have caught him. The red chiefs will punish the warrior who has killed their brothers, without risking their lives against him. The fire is burning now before the council-lodge of the Shawnee. When it burns to-morrow the white hunter will be in its center, and the angry flames shall lap up his blood. The ashes of the Long Rifle alone shall remain to tell of the vengeance of the red chiefs.” The Indian still looked with searching eyes into the face of the prisoner as he told of the manner of his death. But if the Shawnee chief expected to see there the signs of fear, he was disappointed, for the iron-like muscles of Boone’s face never moved.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why in thunder do you want to tell a fellow that he’s a-goin’ to be roasted?” asked Boone, coolly. “Won’t it be time enough for me to find out when you tie me to the stake, and I see the smoke a-rising around me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian was evidently annoyed that his words had not made more impression upon the scout.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The white skin does not fear death, then?” the chief asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I do,” answered Boone; “I fear it like thunder. Just you let me loose once, and see how I’ll run from it. Lightning will be a fool to my heels.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The joking manner of the scout puzzled the red warrior. He knitted his brows for a moment, as if in deep thought. Then again he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The white chief is a great warrior. What would he give to escape the fire-death of the Shawnees?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone couldn’t exactly understand the meaning of the chief’s words, though the question that he asked seemed plain enough.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, chief,” Boone said, after pausing for a moment, as if deliberating upon his answer, “life is sweet; a man would give almost anything for life. But the question with me now is, what can I give?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yourself,” said the chief, laconically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eh?” Boone could not understand\n\u003c/div\u003e \n\u003cdiv\u003e\n “The white chief is a great brave; he has put to death many great chiefs. If he will become a son of the Shawnee nation, the warriors will forget what he has done, and will look forward to what he will do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone was considerably astonished at the words of the chief, although this was not the first time in the course of[14] his eventful life that the Indians had endeavored to get him to join with them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Become a Shawnee, eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered the chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then the Shawnees will not burn me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But if I refuse?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow’s sun will rise upon your death.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I become one of your tribe, what am I expected to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take the war-path with the Shawnee braves against the white-skins,” answered the chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is, betray the men who speak my tongue—who are my brothers—into the hands of your people?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied the chief; “my brother speaks with a straight tongue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll see you hanged first,” muttered Boone, indignantly, to himself, but he was careful not to let the speech reach the ears of the Indian. He fully understood the dangerous position that fate had placed him in, and the thought flashed through his mind that if he could deceive the savages by pretending to accept their offer, he might delay his execution—gain time, and possibly, through some lucky chance, contrive to effect his escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone had been fully as near to death before, and yet escaped to tell of it. He did not despair even now, though a prisoner in the midst of the great Shawnee tribe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long will you give me to think over this proposal that you make me?” Boone asked. “You know a man can’t change his country and his color as easily as to pull off a coat and put on a hunting-shirt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian thought for a moment over the question of the scout. Bound securely as he was; surrounded, too, by the Shawnee warriors, escape was impossible. There was little danger in delaying the sentence of the white-skin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will until to-morrow suit my brother?” asked the chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow?” said Boone; then to his mind came the thought that, before that morrow came, something might transpire to aid him to escape. “Well, until to-morrow will do, though it’s mighty short time for a man to make up his mind on such a ticklish question as this is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow then my brother will say whether he will become a Shawnee or be burnt at the stake to appease the unquiet souls of the brave warriors that his hand has sent to the happy hunting-grounds?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Boone, “to-morrow you shall have my answer.” But, even as he spoke, in his heart he prayed that some lucky accident might aid him ere the night was over.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is good,” replied the chief, gravely. “Let my brother open his ears. The chief of the Shawnees would talk more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go ahead, chief,” said Boone, who wondered what was coming next.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother is a great warrior; he has fought the Shawnees many times—fought also the Mingoes, the Delawares and the Wyandots. Many a red chief has leveled his rifle full at the heart of the white brave, but the bullet was turned aside by the ‘medicine’ of my brother. Is the chief a medicine-man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone understood the superstition of the Indians. He saw, too, that possibly he might use the belief of being invulnerable against rifle-ball to aid him in his desperate strait.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The chief will be silent if I speak?” Boone asked, mysteriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The heart of Ke-ne-ha-ha is like the pools of the Scioto—cast a stone into them, it sinks to the bottom and remains there. So shall the words of my brother sink into my heart.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am a medicine-man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And bullet can not harm my brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Boone, impressively; “not if I keep out of its way,” he added, to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian looked at Boone for a moment in silence; a slight expression of awe was in his face. Then the chief came nearer to the old scout, and in a solemn tone, spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has the white-skin ever heard of the Wolf Demon of the Shawnees?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered the scout, somewhat surprised at the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Wolf Demon is the scourge of the Shawnee tribe. Many brave warriors have fallen by the tomahawk of the monster, and on their breasts he leaves his totem—a Red Arrow. Ke-ne-ha-ha is the great chief of the Shawnee nation; scalps hang thick in the smoke of his wigwam; he is not afraid of man or demon. But the scourge of the Shawnees fears to meet a warrior unless he is alone in the forest. Ke-ne-ha-ha has sought for the Wolf Demon, but he can not find him. The red chief would kill the monster that uses the totem of the Red Arrow. If my brother is a medicine-man, can he not tell me where I may find the Wolf Demon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can not,” answered Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief looked disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The red-man is sorry. He will see his brother in the morning.” Then the chief stalked, moodily, from the lodge.\n\u003c/div\u003e \n\u003cdiv\u003e\n For an hour or more Boone remained in silence. The fire in the center of the lodge burnt out and darkness surrounded the scout.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then to the keen ear of the woodman came the sound of a knife cutting through the skins that formed the walls of the wigwam.\n\u003c/div\u003e \n\u003cdiv\u003e\n A few minutes more and Boone, despite the gloom of the wigwam, could see that a dark form stood by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n The scout knew in an instant that it was a friend. He thought it either Lark or Kenton that had so aptly come to his assistance.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2939/80721.html","bookId":1090,"creation":"Aug 3, 2019 3:46:37 PM","modification":"Aug 3, 2019 3:46:37 PM"}
