{"id":24889,"no":34,"title":"CHAPTER XXXIII. A STRANGE ATTACK.","content":"\u0026nbsp;For a few minutes in silence the three proceeded on through the forest. Boone was in the advance, Kenton followed, and Lark brought up the rear. \n\u003cdiv\u003e\n Suddenly, Lark spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hold on a minute, kurnel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Astonished, both Boone and Kenton halted.\n\u003c/div\u003e \n\u003cdiv\u003e\n The party were just crossing a little glade, whereon the moonbeams brightly fell.\n\u003c/div\u003e \n\u003cdiv\u003e\n As the two turned to Lark, they noticed that his face was deadly pale—even whiter and more corpse-like than when he was stretched senseless upon the sward. His lips were moving convulsively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter, Abe?” asked Boone, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” said Lark, in guttural tones, and speaking with evident difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone and Kenton exchanged glances of astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you feel well?” Boone asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I—I am deathly sick,” and, as the words came from his lips, Lark sunk heavily to the earth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Alarmed, his two companions knelt by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerusalem! You’re tuck bad,” said Boone, bending over the fallen man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My strength is all leaving me,” murmured Lark, in anguish.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And hain’t you been hurt at all?” asked Kenton, who could not understand this strange sickness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” murmured Lark, speaking with great difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you ever had one of these spells before?” said Boone, fully as much puzzled as his brother scout to account for Lark’s strange illness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Lark, feebly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you have?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, what shall we do for you?” Boone felt a little relieved in his mind by Lark’s words.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take me and bind me to the trunk of the largest tree that there is near here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” cried Boone, in astonishment at the strange request.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bind you to a tree!” exclaimed Kenton, in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Lark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerusalem! That’s odd treatment for a sick man,” said Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the only way to treat my sickness,” replied Lark, in a husky voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ar’n’t in earnest?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Boone could hardly believe his hearing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tie you to a tree?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and it must be a stout one,” murmured Lark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A stout one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [34]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, one that I can not pull up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pull up!” exclaimed both Boone and Kenton, in a breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Lark, his breath coming thick and hard, like the breath of a hunted animal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pull up a tree! Why, you ain’t got strength enough now to pull up a blackberry bush,” said Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true,” murmured Lark, hoarsely; “but in a few minutes I shall have the strength of a giant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again Boone and Kenton looked at each other in wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a riddle!” cried Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do not waste time in trying to guess it,” gasped Lark, hoarsely, “but, if you are friends of mine, do as I wish before it is too late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Too late!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, a few minutes more and it will be too late. I have had these attacks before, but never until this one did I guess what the result of the attack would be. But, now, Heaven has permitted me to have a knowledge of the truth.” Lark spoke with great difficulty, and white froth began to gather at the corners of his mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two scouts looked upon the pain-distorted face of their companion in horror.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What on yearth is the matter with you?” exclaimed Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t you guess? Don’t you see it in my face?” Lark gasped, in torture. “I am going mad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mad!” cried both the scouts, and they recoiled a step or two in horror.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes mad,” moaned Lark, in agony. “I can feel the madness creeping over me; tie me to a tree, else I may injure you or myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it!” cried Boone, impulsively. “Come, Kenton, give me a hand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the two carried the helpless man to the foot of a stout oak that grew by the side of the clearing.\n\u003c/div\u003e \n\u003cdiv\u003e\n With thongs cut from Lark’s hunting-shirt they bound him securely to the tree. They placed him in an upright position against the trunk of the oak.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, can we do any thing else for you?” asked Boone, after the tying had been completed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, except to remain near at hand and watch me. The attack will not last long,” Lark replied. It was with great difficulty that he spoke at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n The scouts withdrew a short distance, and sitting down in the bushes, watched their friend that they had bound so securely.\n\u003c/div\u003e \n\u003cdiv\u003e\n The moonbeams came down full on the head of the bound man—upon the massive head that drooped so listlessly upon the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n For fully ten minutes Boone and Kenton watched, and Lark gave no sign of life.\n\u003c/div\u003e \n\u003cdiv\u003e\n Face and figure seemed alike a part of the tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, kurnel,” said Kenton, in a cautious whisper, “what do you think of it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don’t know,” replied Boone, slowly; “it’s a most wonderful affair. That a critter should be able to tell aforehand that he was going to have a mad spell and want himself tied up. Why, I never heerd of any thing like it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He ain’t moved yet,” said Kenton, still watching Lark, intently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “P’haps he ain’t going mad after all?” suggested Boone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or, it may be that he ain’t quite right in his mind now, and the idea of his going mad is only one of the strange fancies that sick people have sometimes?” queried Kenton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s sound sense,” rejoined Boone, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a slight movement of Lark’s head put a stop to the conversation of the two scouts, and eagerly they watched the man bound so tightly to the tree-trunk.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lark raised his head slowly. By the light of the moonbeams the two watchers could plainly see that it was deathly pale. But they also noted a change in the face. The eyes, which before had been lusterless and half-closed, were now opened wide, and, seemingly, strained to their fullest extent. They glared like eyes of fire—shone more like the eyes of a wild beast than the orbs of a human.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look at his eyes!” said Boone, in a cautious whisper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They look as if they would pierce through a fellow!” observed Kenton, in a tone of awe.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carefully and searchingly Lark glared around him as if to discover whether he was watched or not.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he essayed to move from the tree, but the bonds that bound his hands and feet to the tree-trunk restrained him.\n\u003c/div\u003e \n\u003cdiv\u003e\n In amazement Lark looked down upon the fetters that impeded his action.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His memory’s clean gone,” said Boone, in Kenton’s ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do believe he is mad now,” observed Kenton, in a tone of conviction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but look at him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Lark was carefully surveying the bonds that bound him to the tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n A moment or two his eyes glared upon the leathern fetters, and then, with a desperate effort, he essayed to break them.\n\u003c/div\u003e \n\u003cdiv\u003e\n The veins on his forehead knotted and swelled as he tugged with almost superhuman strength, but the effort was useless. He could not free himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerusalem! ain’t that strength thar!” muttered Boone, as he watched the tension of the thongs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’re going to hold him, though,” replied Kenton, eagerly watching the strange scene.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again Lark glared around him, and again he tried to burst the bonds that bound him.\n\u003c/div\u003e \n\u003cdiv\u003e\n The thongs cut into the flesh of the wrists, but he seemed not to heed the pain. Every muscle in his huge frame was brought into play.\n\u003c/div\u003e \n\u003cdiv\u003e\n Another mighty effort and the leathern thong burst as if it had only been a band of straw!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Talk about a giant—did you see that thong go?” exclaimed Boone, in a guarded tone to Kenton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He snapped it like a pipe-stem.”\n\u003c/div\u003e \n\u003cdiv\u003e\n No look of triumph appeared upon Lark’s face as he felt that his hands were free—only the look of fierce, settled determination.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again he glanced around the little opening as if in search of watchers; then he proceeded to untie the lashings that bound his feet to the tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n In a few minutes the thongs dropped to the ground, and Lark was at liberty.\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped from the side of the oak and drew himself up proudly to the moonbeams, as if rejoicing that he was free. All traces of his former feebleness had disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two scouts watched his movements with anxiety.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lark, pausing in the center of the little opening, fumbled for a moment at his girdle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s looking for a we’pon,” said Boone, in a whisper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it looks like it,” replied Kenton.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then from his girdle Lark drew a keen-edged scalping-knife. He tried the edge of the blade and the point, carefully, upon his finger; then, with a grim smile of satisfaction, he replaced the knife in his girdle.\n\u003c/div\u003e \n\u003cdiv\u003e\n Slowly, with cautious steps, Lark stole across the glade, but on the borders of the wood he halted—paused for a moment, irresolute, and then his strength seemed to fail him. A deep groan of anguish came from his lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n He tottered for a moment, as though striving by the mere force of his will to keep his feet; then, with another groan, deeper and more agonizing than the first, he fell heavily to the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n Quickly Boone and Kenton left their covert in the thicket, and hastened to his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again he lay in a swoon, senseless, as before; the swollen veins marked the white forehead, and the waxy drops of perspiration formed a strange contrast.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2939/80741.html","bookId":1090,"creation":"Aug 3, 2019 3:46:37 PM","modification":"Aug 3, 2019 3:46:37 PM"}
