{"id":24892,"no":37,"title":"CHAPTER XXXVI. DEATH OR FREEDOM.","content":"\u0026nbsp;While the great Shawnee chieftain was stating to the anxious lover the condition that covered the gift of his daughter’s hand, another strange life drama was being enacted in the Indian village. \n\u003cdiv\u003e\n Kendrick—the renegade—and his daughter—the Kanawha Queen—stood together by the wigwam that held in its confines the helpless prisoner, Virginia Treveling.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the door of the lodge sat a brawny Shawnee brave, placed there by Girty to watch the prisoner.\n\u003c/div\u003e \n\u003cdiv\u003e\n The dark-browed renegade had taken ample measures to hold his victim, securely, in his power.\n\u003c/div\u003e \n\u003cdiv\u003e\n First, Kate guarded the prisoner; second, the Indian warrior kept ward and watch.\n\u003c/div\u003e \n\u003cdiv\u003e\n No thought of the prisoner’s escape ever crossed the mind of Girty. He, too, like the Shawnee chieftain, Ke-ne-ha-ha, chafed at the delay of the expedition against the whites.\n\u003c/div\u003e \n\u003cdiv\u003e\n The renegade was fully as eager as his red brother for the banquet of blood. He longed to see the smoke of the burning dwellings cloud the face of the sky, and to wet his knife in the warm life-blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kendrick had just explained to his daughter the reasons that led to the delay of the expedition.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate listened attentively, her brain busy in thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when will the expedition move?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s duberous, gal,” he answered. “It all depends upon[37] the Wyandots and the Mingoes. When they send their warriors, then we kin go ahead, but not till then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And my plan, father, to remove this girl from my path?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better carry it out right away,” said the renegade, after thinking for a moment. “Thar’ll be no better chance than at the present. I owe Girty a little balance, which I reckon this affair will settle. Instead of staying with his own tribe, the Wyandots, he’s been sneakin’ round hyer with the Shawnee. If it goes on, he’ll have more influence hyer than I have, and I ain’t a-goin’ to stand that, nohow. So, gal, if you want any help to snake the gal out of his clutches, I’m the critter for to give it to you, and no mistake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may need your aid, father,” said the girl, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, you kin have it. I’d do most any thing to spite him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think that it will be better to carry the girl off to-night. He may place her in some safer place to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jest so; thar’s no tellin’; he’s as suspicious as a crow. It will worry him some to lose the gal,” said Kendrick, with a grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the Indian sentry before the door of the wigwam?” and, with her eyes, Kate indicated the brawny warrior, who, seated before the lodge-door, was smoking a rude pipe, fashioned from a corn-stalk, with great satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I kin fix him easy ’nough,” replied Kendrick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will make the attempt at once,” said Kate, decidedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll fix the Injun. You go into the lodge. I’ll talk to the chief and get him to leave his post for a moment. When he’s gone, I’ll cough; then, you slip out of the lodge with the gal and take to the timber. It ain’t likely that they will be apt to discover that the gal is gone till morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And by that time it will make very little difference whether it is discovered or not,” said Kate, meaningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to kill the gal?” asked Kendrick, speaking as coolly and as unconcerned as though it was the killing of some worthless beast that he referred to.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why should I let her live?” asked Kate, fiercely. “Is she not loved by the man whom I love better than I do any one else in this world?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But if you leave her hyer with Girty—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “May she not escape from him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true; but dead—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She can not return.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true; ag’in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Once in the forest, dead, a prey to the wolves, she never more will rival me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wal, I don’t know but what I like it better that way myself. It’ll worry Girty, and that will jest suit me,” said Kendrick, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll enter the wigwam at once and prepare the girl.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And arter you go in I’ll tackle the Injun. I’ve got an idea for to git shet of him. When I cough, you’ll know that he’s out of the way, and that you kin fetch the little gal out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So without further words, Kate left her father and entered the lodge. Kendrick waited until she was fairly inside, and then he walked, leisurely, to the Indian on guard and sat down by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n The brawny chief acknowledged the approach of the renegade with a nod of recognition.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ain’t this kinder dull work for my brother?” asked the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ugh!” and the Indian gave vent to a grunt of dissatisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’d rather be on the war-path ag’in’ the white-skins along the Ohio than to be hyer, a-keepin’ watch over a squaw?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother speaks straight,” said the Indian, in a surly tone, taking the pipe from his lips for a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pity we can’t go on the war-trail, hey?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Big pity,” replied the chief, sententiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother thinks much of his Wyandot brother, Girty?” said Kendrick, in a tone of question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His Wyandot brother is a great warrior,” replied the chief, evidently not willing to commit himself by a decided answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wal, I judged that you thought a heap of him by being willing to do his watching, hyer,” said Kendrick, suggestively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Girty is a great Wyandot chief, but the Shawnee brave is not his watch dog for love. The chief does a service, but the chief will be paid for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oho!” muttered Kendrick, to himself, “I reckon I know how the chief is a-going to be paid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother knows now that the Shawnee chief is to be paid for his service,” said the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No more than right,” said Kendrick, heartily. “I heerd the other day that Girty got some corn-juice from a flat-boat that he captivated on the Ohio.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wah! it is good. The Shawnee brave is to have corn-juice in payment for his service.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wal, corn-juice ain’t bad to take when it’s good,” said Kendrick, reflectively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is good!” replied the warrior, decidedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish my wigwam wasn’t so far off,” said Kendrick, with a sly look into the Indian’s bronzed features as he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why does my brother wish that?” asked the chief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wal I feel thirsty, and I’ve got some of the best corn-juice that you ever see’d in my wigwam, and I’m too ’tarnal lazy to go after it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is bad,” said the warrior, slowly, looking askance at the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If my brother did not have to watch the wigwam he could go for the corn-juice and we would drink it together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother speaks straight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sorry the chief can not go—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why can not the chief go?” asked the Indian, within whose breast there had sprung up a desire to taste the precious fire-water of the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he not watching the wigwam for his Wyandot brother Girty?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can not the Shawnee chief go for the fire-water, and leave his Shawnee brother to watch the lodge?” asked the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course this was exactly what the shrewd renegade wished.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother is as wise as the fox.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian bowed at the compliment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will my Shawnee brother go for the fire-water and leave me to watch the lodge?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother speaks good. The chief will go,” and the Indian rose to his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The chief will find the corn-juice under a blanket near the door of the lodge.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian bowed gravely, and departed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’d smell it out, anyway,” muttered Kendrick; “leave a red-skin alone for finding whisky, if thar’s any around. They go for it quick es a coon does for a tall tree when the dogs are arter him. Now I’ll jest warn Kate, so that she will know that the coast is clear. I reckon Girty will swear some when he finds that the gal has broke for tall timber,” and the renegade chuckled in glee.\n\u003c/div\u003e \n\u003cdiv\u003e\n His fit of laughter over, he looked about him carefully. No one was in sight; so he cautiously gave the signal agreed upon between Kate and himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n A few moments after the sound of the cough died away on the night air, Kate came cautiously from the wigwam, followed by Virginia.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, gal,” said the renegade, quickly. “The Injun’s out of the way, but don’t let grass grow under your feet between hyer and the Ohio. They may diskiver that you’ve cut your stick any moment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do not worry, father; I know every foot of the ground between here and the river,” replied the girl, a strange nervousness patent in her voice. “Come, lady; do not fear; before this night is over, you shall be free from danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thar ain’t much danger in the grave,” muttered the renegade between his teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Kate led the way into the wood, and Virginia followed without a word.\n\u003c/div\u003e \n\u003cdiv\u003e\n The renegade watched them until the dark shadows of the forest closed around them and they were hid from his view.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon my little gal will fix her,” muttered the renegade, in a tone of satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a thought flushed suddenly across his mind. With a sudden spring he leaped to his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By all the imps below, I never thought of that before!” he cried, excitedly. “Shall I foller and stop ’em?” and he took a few steps toward the wood, as if to execute the purpose. “But no, why should I?” and he halted. “One don’t know it, and the other don’t either. It can’t be a crime if she don’t know what she’s doing in killing this gal.” And then another thought came into his mind. The dull-witted renegade was getting strangely bright.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The gal has fooled me! I remember now that she once told me that Miss Treveling was the only woman in the world that had ever spoken a kind word to her, and that she would willingly lay down her life for her sake. The truth on’t is, that she has sneaked the gal out of our hands to save her. The lover story was all moonshine. Wal, let the gal do it, if she kin. She little knows what she is doing when she saves this she-critter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the renegade resumed his place by the lodge.\n\u003c/div\u003e \n\u003cdiv\u003e\n In a short time the Shawnee returned with the gourd bottle of whisky.\n\u003c/div\u003e \n\u003cdiv\u003e\n It only took a few minutes for the renegade and the chief to empty the gourd.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hardly had they finished the whisky when from the darkness came Girty.\n\u003c/div\u003e \n\u003cdiv\u003e\n Girty said but a few words to the two and then entered the lodge.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’ll be a hurricane ’fore long,” muttered Kendrick.\n\u003c/div\u003e \n\u003cdiv\u003e\n The renegade was right, for Girty rushed from the wigwam, furious as the panther cheated of its prey.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Curses on you, the gal is gone!” he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian looked the astonishment he felt, while on Kendrick’s face was a look of amazement, of course assumed for the occasion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have left your post,” Girty cried to the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n The chief did not attempt to deny it, but strove to excuse himself by stating that Kendrick had watched in his place.\n\u003c/div\u003e \n\u003cdiv\u003e\n Girty guessed the scheme at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You eternal villain!” he cried, addressing Kendrick; “it was all contrived between you and your daughter to rescue the girl from my hands, you lying hound!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Enraged, Kendrick rose to his feet, drew his knife and made a dash at Girty, but his opponent was quicker far than he, for, as Kendrick advanced, Girty dealt him a terrific blow with his tomahawk that felled him like a log to the earth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lie there and rot!” cried Girty, contemptuously. “And now summon the warriors; we must follow our birds at once. As for this affair, you can bear witness, chief, that I struck him in self-defense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Within five minutes, a dozen painted warriors, headed by Girty, were on the trail of the fugitives.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2939/80744.html","bookId":1090,"creation":"Aug 3, 2019 3:46:37 PM","modification":"Aug 3, 2019 3:46:37 PM"}
