{"id":24894,"no":39,"title":"CHAPTER XXXVIII. A JOYOUS MEETING.","content":"\u0026nbsp;Virginia followed Kate without fear. \n\u003cdiv\u003e\n Once within the wood, Kate enjoined caution upon her companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a long and weary way from here to Point Pleasant,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have traversed it once already, then a prisoner. It will not seem so long now, for I know that each step is taking me nearer to my dear home and those I love,” Virginia replied, cheerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate looked at the fair girl, a mournful smile upon her olive-tinged features.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you trust yourself fearlessly in my hands?” Kate asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, why should I fear?” Virginia said, in a tone of wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Am I not the daughter of a renegade?” Kate asked, a world of bitterness in her tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not answerable for the faults of others,” Virginia said, gently. “I freely trust my life in your hands and I have no fear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They were proceeding rapidly through the wood as they spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate did not reply aloud to Virginia’s speech, but to herself she murmured:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would this girl trust me if she knew how deeply I loved the man that possesses her heart?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate led the way at a swift pace—not that she feared pursuit, for she did not dream that Virginia’s escape, and her own treachery toward the renegade Girty, would be discovered until the morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n Virginia, both in her face and dress, showed visible traces of the peril that she had passed through.\n\u003c/div\u003e \n\u003cdiv\u003e\n Well was it for her that her gown was of stout homespun stuff, for many a thorn-bush laid hold of it in her quick passage through the wilderness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where will you go first, to the station of Point Pleasant or to my cabin, where Harvey Winthrop is?” Kate asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is not your cabin some miles beyond the station?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but from the route I am obliged to take, my cabin is but a short distance further than the station.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us go there first, then,” said Virginia, eagerly. “Oh! the anguish I have suffered, thinking him dead,” and a cloud came over the fair face of the girl as she spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Every word that Virginia spoke in reference to Winthrop, touched Kate to the quick, for she saw how deeply and truthfully she loved him. Then she realized, too, how hopeless was the passion that burned so fiercely in her own bosom. But, neither by word or sign, did she betray that love to Virginia.\n\u003c/div\u003e \n\u003cdiv\u003e\n Steadily Kate pursued her course, heading direct for the Ohio; and, without a murmur at the toilsome way, cheered by the thought that a few hours would give her to the arms of both lover and father, Virginia followed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving the two girls, so strangely unlike in station and in nature, to pursue their tedious journey through the wilderness, they little thinking that the fierce renegade, Girty, had discovered their escape, and with a chosen band of Shawnees was following hard upon their track, we will return to the man whom Girty had stricken to the earth, Dave Kendrick, the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indians bore the wounded man to his lodge, and examined his wound.\n\u003c/div\u003e \n\u003cdiv\u003e\n The blow had been a fearful one, and Kendrick’s time on earth was short.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the renegade recovered from his faint, it did not take him long to discover that he had not many minutes to live.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The skunk has finished me,” he muttered, with a deep groan of pain. “I haven’t got many minutes more of life, but I’d give ’em all to have a single chance at him,” and then the stricken man ground his teeth together fiercely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother is hurt much?” said one of the warriors, bending over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The happy hunting-grounds for me, chief, afore I’m an hour older,” replied Kendrick, with a gasp of pain. “The cursed skunk—to use his tomahawk ag’in’ my knife,” he muttered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can Noc-a-tah do any thing for his brother?” said one of the Indians, a tall chief who was one of the principal men among the Shawnees.\n\u003c/div\u003e \n\u003cdiv\u003e\n For a few moments Kendrick was silent, apparently overcome by pain; then, with a great effort, he rallied his scattered senses.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, chief, you kin do something for me. I want to make a ‘totem.’ Bring me two pieces of bark and a pointed twig.”\n\u003c/div\u003e \n\u003cdiv\u003e\n One of the Indians departed and speedily returned with two pieces of white birch-bark and a pointed twig.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’ll do,” muttered Kendrick, faintly. “I reckon I’ll get even with the skunk now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, the renegade dipped the pointed twig in the blood that was flowing freely from the terrible wound in his head, and with great difficulty—for Dave Kendrick had little of the scholar about him—he traced some half a dozen lines on the smooth surface of the two pieces of birch-bark. On both pieces he wrote the same words, and then sunk back, exhausted.\n\u003c/div\u003e \n\u003cdiv\u003e\n The breath of the renegade came thick and hard. The icy fingers of Death already were closing upon and chilling their victim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Chief,” he muttered with a gasp, “one of these totems to the man who wounded me, Girty; the other to the white-haired chief, General Treveling, at Point Pleasant—you know him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The savage bowed assent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him the totem is true—a dying man swears to it—how cursed dark it is; I—” and then, with a stifled groan, Dave Kendrick, the renegade, sunk back, dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n Noc-a-tah, the Shawnee chieftain, carefully rolled up the two pieces of bark that bore on their smooth surface the “totems,” thrust them into his pouch, and then departed to fulfill the mission of the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n We will now return to the fugitives.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate and Virginia paused not, either for food or sleep, but through the darkness of the night steadily pursued their way.\n\u003c/div\u003e \n\u003cdiv\u003e\n To Kate, the forest—although to strange eyes a trackless wilderness—was as familiar as her own little garden. She knew the way as well in the darkness as in the light. She was, in very truth, a child of the wilderness, and from infancy she had traversed freely the brown paths of the wild woods.\n\u003c/div\u003e \n\u003cdiv\u003e\n The first light of the morn was lining the eastern skies with leaden and white purple rays when Kate and her companion came within sight of the little cabin that was the home of the Kanawha Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n A weary march it had been through the live-long night, and Virginia, her garments wet with dew, and torn in many places by the rough grasp of the brambles, that had sought to stay her progress through the thicket, presented but a sorry sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n Her hair, too, escaped from the simple knot that usually held it in its place, streamed down over her shoulders in wild confusion. Her face was pale, save where a hectic spot burned in either cheek. Her eyes, though, shone with a determined light, for Virginia, weak woman as she was, held within her veins the stern soldier blood of her father. That blood had nerved her to face the peril that she had encountered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, lady, is refuge at last,” said Kate, pointing to the humble cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A palace could not be more welcome than your cabin,” said Virginia, gratefully, and a joyous light sparkled in her eyes as she spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two advanced to the house. The door sprung open as if by magic, and on the threshold stood Harvey Winthrop.\n\u003c/div\u003e \n\u003cdiv\u003e\n With a cry of joy, Virginia rushed into his arms and sunk almost fainting upon his breast. She was in the arms of the man she loved; she thought only of that and of naught else.\n\u003c/div\u003e \n\u003cdiv\u003e\n Winthrop folded the slender form of the girl to his heart, and tenderly brushed the damp dew from her shining locks.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate turned her head aside. She could not bear to look upon the meeting of the lovers. Their joy tore her heart and made the life-blood in her veins run chill with agony.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Heaven! give thy poor handmaiden strength to bear her cross,” she murmured, in despair. And as she spoke, a sudden faintness came over her; all things swam before her eyes, and but for the support of the rude fence by which she stood, she would have fallen.\n\u003c/div\u003e \n\u003cdiv\u003e\n The lovers wrapped up in the joy of each other’s presence, did not notice her agitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Again I hold you in my arms,” the young man said, softly, as he strained the loved form of the maiden to his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I thought you dead,” Virginia said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To Kate I owe my life!” And as he spoke, both he and Virginia turned their eyes toward the Kanawha Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Kate had recovered her composure, except that her cheek was paler than it was wont to be.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To Heaven your thanks, not to me, its humble instrument,” replied Kate, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the three entered the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n A cheerful fire blazed in the broad fire-place. By the fire, the three sat.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kate, clad in buck-skin, Indian fashion, showed few traces of the terrible night-journey, but Virginia, although clad in stout homespun garments, had many a mark of bramble and brier; yet, to the eyes of Winthrop, she looked prettier than ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And your wound?” asked Virginia, suddenly remembering her lover’s hurt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I scarcely feel it now,” Winthrop replied; “a few hours has worked wonders. The thought of your danger troubled me more than the pain of my wound.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And from that danger, Kate has saved me, although at the risk of her own life,” and Virginia cast a glance full of love and thankfulness toward the daughter of the renegade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did what was but my duty to do. I promised to save you if I could. I kept that promise—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the risk of your own life,” Virginia said, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The life of the outcast is worth but little,” Kate replied, sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The life of my sister is as precious as my own!” Virginia exclaimed, earnestly, and rising, she knelt by Kate’s side and folded her arms around her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your sister!” said Kate, in wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; for henceforth you shall be my sister. Kate, you must forsake this wild life and make your home with me. Will you not do so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Virginia looked, pleadingly, in the face of Kate, and wondered to see her brown cheek pale and her great eyes fill with tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you do not know what you ask!” cried Kate, in agony, “and I can not tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [40]\n\u003c/div\u003e \n\u003cdiv\u003e\n Virginia heard the strange words in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you not be my sister?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no, it is impossible,” Kate murmured, sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Impossible, why?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because—”\n\u003c/div\u003e \n\u003cdiv\u003e\n The wild war-whoop of the Shawnees, pealing forth on the still morning air, and ringing in the ears of the three like a signal of doom, cut short Kate’s words.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the door yielded to a heavy blow, and a score of dark forms rushed into the room.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2939/80746.html","bookId":1090,"creation":"Aug 3, 2019 3:46:37 PM","modification":"Aug 3, 2019 3:46:37 PM"}
