{"id":9523,"no":20,"title":"XVII. A NEGATIVE RAILROAD.","content":"\u0026nbsp;I have already remarked that when the observer has unfortunately taken his point of view from the position of producer, he cannot fail in his conclusions to clash with the general interest, because the producer, as such, must desire the existence of efforts, wants, and obstacles. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I find a singular exemplification of this remark in a journal of Bordeaux.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Simiot puts this question:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ought the railroad from Paris into Spain to present a break or terminus at Bordeaux?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question he answers affirmatively. I will only consider one among the numerous reasons which he adduces in support of his opinion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The railroad from Paris to Bayonne ought (he says) to present a break or terminus at Bordeaux, in order that goods and travelers stopping in this city should thus be forced to contribute to the profits of the boatmen, porters, commission merchants, hotel-keepers, etc.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is very evident that we have here again the interest of the agents of labor put before that of the consumer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But if Bordeaux would profit by a break in the road, and if such profit be conformable to the public interest, then Angoulème, Poictiers, Tours, Orleans, and still more all the intermediate points, as Ruffec, Chatellerault, etc., etc., would also petition for breaks; and this too would be for the general good and for the interest of national labor. For it is certain, that in proportion to the number of these breaks or termini, will be the increase in consignments, commissions, lading, unlading, etc. This system furnishes us the idea of a railroad made up of successive breaks; a negative railroad.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Whether or not the Protectionists will allow it, most certain it is, that the restrictive principle is identical with that which would maintain this system of breaks: it is the sacrifice of the consumer to the producer, of the end to the means.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2883/79766.html","bookId":1145,"creation":"Aug 2, 2019 2:20:25 AM","modification":"Aug 2, 2019 2:20:25 AM"}
