{"id":44947,"no":2,"title":"CHAPTER II","content":"\u0026nbsp;There had driven into the stableyard of the Hotel Button a queer box-car wagon on rickety yellow wheels, unwillingly pulled by tired nags. The wagon had a hope-to-die roof and a smokestack. On the driver’s seat was a ragged man and an impetuous young person in faded blue gingham. The impetuous young person was driving and singing “God Be With Us Till We Meet Again”—unconscious of the beauty of her voice. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her father nodded approval, as the song ended and the wagon halted before the stable door. As the story goes, young Dan Birge and Lorraine McDowell, the minister’s only child, were playing hop-scotch in imminent danger of the horses’ feet. They paused to stare at the newcomers. The young person had begun in businesslike fashion:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to speak to the pro-pry-e-tor. My name is Thurley, Thurley Precore, and this is my dad. He’s awful sick. We come all the way from Boulder, out in Colorado—I guess you don’t know where that is, but it’s miles ’n’ miles from here. My ma is sick, too,—she’s lyin’ down inside, and she’ll have to see a doctor right off. Where is the pro-pry-e-tor? Ain’t you listening to me? We sell tinware—why, say, our pots and pans can’t be beat—nor matched. Even the gypsies said so when we camped with ’em at Lisbon, Ohio. Isn’t it so, pa?” turning her flushed, lovely face to the man beside her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess if you says it is—it is,” he chuckled. “Ladies and gentlemen,” he added to the astonishment[11] of the boy and girl, “what Thurley says goes—she’s been runnin’ this family for enough years to prove that she kin,” the chuckle ended in a hollow cough.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, the wretched lace-curtained window was pushed open, and a woman’s faded face appeared, a vapid, senseless face with dyed blond hair and china-doll blue eyes; a wisp of pink ribbon showed about her drawn throat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dear me, Cornelius, don’t stand here all day,” she began fretfully. “Thurley, come right inside and git on some decent duds. I guess folks think, because we’re travellin’ in a wagon, that we ain’t no better than gypsies—well, every one has their high days and their low ones. If my father could see me now!” Her thin hands loaded with cheap rings lifted into view and twelve-year-old Daniel Birge, counted as the gallows’ brightest prospect, nudged Lorraine McDowell, the only girl he ever played with—because his father made him—until they both laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of all the bringin’ up!” floated out in thin, melancholy tones. “Cornelius, are you goin’ to set there like a bump on a log and have me laffed at?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Thurley had jumped down and with clenched fists approached Daniel and Lorraine. She paused, womanlike, to give vent to her opinion before she should strike. Just then Prince Hawkins and his wife and Betsey Pilrig and her lame grandchild, Philena, gathered as spectators.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They said afterwards that all the devils in the world seemed flashing from the strange child’s blue eyes. She was barefoot and ragged; her dress far too short for her long-legged, awkward self, and her mop of brown hair in a disorderly braid. But she had a fine, strong body, despite the ragged dress, and, although she possessed not a single regular feature, there was a prophecy of true greatness in her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel and Lorraine stared at the brown, clenched fists. They were the ordinary, well-dressed, well-nourished children to be seen in such a backwoods town as Birge’s Corners.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now you laff again,” Thurley commanded. “Laff—go on—let me hear you. I want to tell you I got a sick pa and ma, and we certainly have played hard luck all the way from Boulder, Colorado. I guess, if you had any manners, you’d not laff at us. Not if we do peddle tinware and tell fortunes by tea leaves. We ain’t always done it, and we ain’t always goin’ to. But we’re in hard luck—don’t you understand? And don’t you dare to laff when my ma talks or call us gypsies. We’re white folks, but we’re just a little bit discouraged,” her angry voice betrayed a quiver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The others had gathered nearer to hear what was being said, looking up at the driver’s seat to where the wreck of a man sat smoking his corn-cob pipe, secure in the defense established by his small virago.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I tell you right now,” Thurley’s mother supplemented, “that, when I had my health and was on the stage, I could have bought and sold the whole town. My father was a real Kentucky colonel, and I was brought up to never lift a finger—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At which Thurley’s father took his pipe from his mouth long enough to say, “Shut up, Jen; let the kid give it to ’em—she knows how.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley took up the burden of defense. “We want the pro-pry-e-tor. We want to camp here to-night, and get some vittles and we’ll give him the loveliest new tins—as bright as silver. Where is the pro-pry-e-tor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Prince Hawkins and his wife, taking pity on the child, came to her rescue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, pshaw, I don’t believe we want none of them[13] tins!” Mrs. Hawkins said. “We got more now than we ever use.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tears gathered in Thurley’s eyes. She turned her head so they would remain a secret.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you’d like your fortunes told?” suggested Mrs. Precore from the window ledge. “Honest, I certainly have told some remarkable things—why, a Chicago finan-seer wanted me to settle in Chicago so he could get my advice as to the stock exchange—” Here she gave way to coughing and vanished completely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My ma and pa is too sick to work,” Thurley added, determined to gain her point. “I got to get a doctor for them to-morrow. We was headin’ for a city, but we sort of run out of supplies—” She bit her underlip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you’d like a stewpan?” she coaxed of Betsey Pilrig.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take it, granny,” Philena whispered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lemme see it,” Betsey answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley tore inside the wagon to re-appear with a motley collection of flimsy tins, bent and battered from their long journey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A titter ran around the crowd. With the courage born of despair Thurley threw back her head and cried out, “Well, then, if nobody wants to buy anything—I kin sing for our supper!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, you poor lamb,” Mrs. Prince Hawkins answered, “sing for us, and we’ll see that you get a good hot supper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley’s father took his pipe out of his mouth again to say, “She kin sing, ma’am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So Thurley, mounting a step of the wagon, began “Believe Me, If All Those Endearing Young Charms,” the sun shining on her dark head, lighting up unexpected glints of Titian red. A passing teamster paused to listen,[14] and applauded when she had finished, and the circle of critics were awed and quiet. For the ragged child seemed to vanish; she was merely the instrument for the glorious voice unhampered by artificial notions. Thurley sang as she had always done, winning for the inefficient parents—“life’s sinking ships,” some one had called them—their food and keep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sing us another, and you can stay another day,” Prince Hawkins called out as the applause ceased.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley responded graciously with:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was an old man and he had a wooden leg,\n\u003c/div\u003e \n\u003cdiv\u003e\n He had no tobacco, nor tobacco could he beg.\n\u003c/div\u003e \n\u003cdiv\u003e\n Another old man had a wooden box,\n\u003c/div\u003e \n\u003cdiv\u003e\n And he always kept tobacco in the old tobacco box.\n\u003c/div\u003e \n\u003cdiv\u003e\n Said the first old man, “Gimme a chew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Said the second old man, “Durned if I do.\n\u003c/div\u003e \n\u003cdiv\u003e\n Take my advice and save up your rocks\n\u003c/div\u003e \n\u003cdiv\u003e\n And you’ll always have tobacco in the old tobacco box!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know dozens,” she announced happily, as she hopped down on to the ground, “but, if you don’t mind, I’d rather have supper now and sing some more to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Drive into that shed,” Prince Hawkins told her. “You come around to the kitchen—I guess your pa can unhitch, can’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley laughed. “Dear, no—makes him cough—he’s got a pain in his side, too. I sang four songs in the last town for painkiller, but it didn’t do him any good—over there, pa, dear—I’ll be with you in a minnit.” She watched the rickety wagon creak towards the shed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Betsey Pilrig and Philena crowded about Thurley. “Is your mother awful sick, too?” Betsey asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley nodded. “Always been sick—guess she always[15] will be. Pa has been sick, too—ever since I remember anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are their folks?” Mrs. Hawkins demanded. “Somebody ought to look after them!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Guess they haven’t any,” Thurley answered easily. “Guess they’re all dead—or something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked reproachfully at Daniel and Lorraine, who had retreated several feet away. “Guess you won’t laff again,” she said imperiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She passed them with an absurd swagger, and a moment later they saw her unhitching the tired nags with the dexterity of a groom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I swan,” Mrs. Hawkins said to Betsey Pilrig, “that mite carin’ for those worthless beggars—gettin’ her to sell their old pans—did you ever see such blue eyes and did you ever, ever hear any one sing like that? She’ll be famous, if she don’t starve to death takin’ care of them first!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Granny,” said Philena Pilrig,—being lame Philena never played with other children—“I love that little girl; ask her to come see me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She don’t have time for visiting, I guess,” her grandmother answered. “We’ll send her something nice to eat; she’d rather have that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Behind the woodpile Daniel and Lorraine were talking it over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sorry I laughed,” Lorraine said penitently. “You made me—my father don’t let me laugh at poor folks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he’s a minister—I laughed because it was funny,” Dan retorted, his dark eyes flashing, “and I bet now that—what’s her name?—Thurley would have laughed too, if she could have looked in a glass and seen herself. I like her. I bet she wouldn’t cry, if she got[16] lost in the woods.” This with a reproachful expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lorraine moved nearer him. “Dan, I didn’t really cry; I was just nervous. Maybe I can do things this girl can’t; anyhow, I don’t go around in a ragged dress and my hair all rumpled,” and she smoothed the pattern of her pink frock proudly. She was fair-haired with dove-colored eyes and tiny, dainty features.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan did not answer. Lorraine touched his arm. “Are you mad?” she whispered earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not mad, but you know, Lorraine, I only play with you because my father makes me—because your father’s the minister and pa thinks it looks well.” Daniel possessed the aggressive frankness of the Birge family, but he had not acquired their customary diplomacy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lorraine’s underlip quivered. “Wouldn’t you play with me, unless I was?” she asked wistfully. “I always liked you best of every one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel stared at her in contempt. “I like you—but you’re a girl, and I like the gang better—I bet though that now—what was it?—Thurley—I bet Thurley would be one of the gang, as if she were a fellow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you like that ragged girl?” Lorraine asked in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan nodded. “When she sang, my heart beat loud, and she looked at me more’n she did the rest. I’m going to tell her I’m sorry I laughed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lorraine turned to leave him. “My father won’t want me playing with you, Dan, even if your great-great-great-grandfather did discover the lake and your father has money. Everybody knows your father has a gambling room and sells beer on Sunday—now! And if you play with a tin peddler’s girl, my father won’t let me play with you—tra-la-la—” She began singing shrilly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [17]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I was you, I wouldn’t try to sing after what we’ve just heard,” Dan flung back defiantly, “and, when your father wants a new roof on his old church or another carpet, he’ll be glad enough to take my father’s saloon money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With which they parted, Lorraine repairing to the parsonage with her budget of woes, and Dan striding across to the box-car wagon, to knock at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley’s mother appeared. “What is it, boy?” she demanded fretfully. “Dear me, I was napping and you woke me up with such a start my head aches. Thurley, here’s that boy that laffed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan took the opportunity to peer inside the wagon. To his mind such an existence would be unquestionably jolly, traveling, traveling, traveling, with no school, no rules or regulations whatsoever. He had a good mind to bind himself out to the Precore family then and there, despite the fact of being Daniel Birge’s only child and the wealthiest boy in the place, as his father often told him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Inside the wagon was a rude partition. Thurley was busied with something in the front. The stock in trade of tins lined the walls, jangling discordantly on the slightest provocation. Faded stage photographs in plush frames punctuated the row of cakepans from the stewing kettles, and between the stewing kettles and the frying pans were some of Thurley’s contraptions—hand-colored “ladies,” which she had cut from fashion books or magazines and pasted on the wall. There was a rickety lounge with a red velvet “throw,” and an attempt at an easy chair, a tiny oil stove and a wretched cupboard which resembled Mother Hubbard’s concerning contents. Scraps of carpet were on the floor, a packing trunk held the Precore wardrobe. An alarm clock minus one hand, but ticking[18] bravely, a copy of “Dreams and Premonitions,” a palm leaf fan, an old accordion, some greasy playing cards, whiskey bottles, kerosene lamps, a green penholder without any point and a few yellow-backed novels were the ornaments. The other side of the partition was evidently sleeping quarters.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley appeared to demand indignantly, “Well—going to laff again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come outside,” Dan ordered, looking darkly at Thurley’s mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley followed, her mother flopping down on the lounge and calling to Cornelius to bring her some tea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Outside the wagon Daniel halted, coming up close to Thurley and adopting a confidential tone of voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m Daniel Birge,” he said. “My great-great-great-grandfather discovered this lake, and I guess you’ll hear all about our family if you stay here long enough. My father owns that brick building down there. It’s a saloon and a blacksmith shop and a real estate office all in one. Ain’t that awful?” This with a boy grimace. “When I’m a man, it’s going to be a big department store. All the good folks in this town expect to see me go to hell.” Being the only boy officially allowed to swear, Dan waited for her to be shocked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Thurley settled herself on the steps of the wagon, hugging her long legs up under her. “I suppose there’ll be some nice people in hell,” she commented by way of comfort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Daniel drew out a sheet of paper. “I’m going to have Ali Baba print this in big letters on a card and stick it up over the barn, but maybe it would show better if I put it on your wagon—’cause everybody will come to see that, and so they’d see my card.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley read the offered paper:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [19]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Big Show to-morrow in D. Birge’s barn\n\u003c/div\u003e \n\u003cdiv\u003e\n D. Birge manager\n\u003c/div\u003e \n\u003cdiv\u003e\n Peple our age—ten pins. Children—five pins\n\u003c/div\u003e \n\u003cdiv\u003e\n See the great swinging man\n\u003c/div\u003e \n\u003cdiv\u003e\n and\n\u003c/div\u003e \n\u003cdiv\u003e\n Mising link.\n\u003c/div\u003e \n\u003cdiv\u003e\n Come early—but one performance so why mis it?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you twelve years old?” was all Thurley commented, handing it back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan nodded. “Can’t I put it on your wagon, Thurley?” He spoke her name softly, as if uncertain of his right.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven’t spelled people nor missing as it is in books,” she corrected, a small finger pointing out his errors.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What difference does that make? Folks know what you mean. As long as you make folks know what you mean, you don’t have to waste time learning how to spell and that truck—my father don’t make me go to school, no siree, not if I don’t want to go; he never went much nor his father nor his father nor his father!” he asserted. “We just about own the Corners, too. There ain’t anybody for miles around that dares sass my father. We started the rich folks coming to this lake, and we got a lot of their trade, and my father can buy any man in this town and then tell him where to get off—even the minister—so there! What’s the good of spelling words right?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the first time in his life, however, Dan seemed anxious to meet with approval. When he told the gang his opinions, they listened respectfully, for did not Dan Birge have hip-boots and a bicycle with a coaster brake, to say nothing of unlimited spending money and permission—cruel, unjust world!—to skip school and go swimming[20] whenever he liked! True, there were things Dan Birge did not have—he had no mother, no one to take care of him when he was sick, no home—but boys did not analyze these things. They only knew that Dan Birge and his father lived at the Hotel Button like real travelling-men, and young Dan wore better clothes and swore more profusely and had his own way more than any one else in the Corners. His father, rough, shaggy-haired, black-eyed pirate that he was, feared by all, treated this only child as something to be revered and indulged to the point of absurdity. He was the only human being Dan Birge had ever loved, for he had not loved the frail little woman who had taken his name—and his tempers—borne his son and died with a faint sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Some claimed there was Indian blood in Dan Birge. The ancestor discovering the lake had been a trapper and hunter, and many said this ancestor’s wife was no less than a Mohawk squaw. Certain it was that Dan’s graceful self, with dark eyes and olive skin and the mop of blue-black hair which would not “stay put,” could have been called proof of the rumor, also his loyal, generous actions towards the few he liked, and the cold-blooded revenge he executed towards an enemy. As for the Birge temper, surely it suggested tomahawks, scalping and being burnt at the stake, with its relentless whirlwind of expression once roused. Dan Birge’s father had the sense to know he was a madman when he was in a rage and he would lock himself in a room, because he was not responsible for his actions, and wait until the spasm had been expended.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His son Dan, having had little to rouse his temper, had not yet been forced to such a procedure. Something in the boy’s dignified manner, a deviation from his father’s[21] blustering self, would indicate that young Dan’s temper could remain at white heat, influencing his actions almost to madness long after his father’s more dramatic rage had died away and humiliating remorse set in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was, as well, a superstition about the fate of a woman who would marry a Birge, for all the Birges’ wives, excepting the rumored squaw, had been adoring, meek individuals who lived until they bore a son and then died, leaving some one else to bring him up!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan had been raised by Submit Curler, Oyster Jim, Ali Baba, Betsey Pilrig, Hopeful Whittier—and himself. He began domineering over his father, as a new tyrant always wins easily over an old one, before he was a year old. At three the Corners looked aghast at his antics, and shivered at his vocabulary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” Thurley Precore answered with spirit equal to Dan’s, “you think you’re smart, because your pa has money, but there’s lots of people smarter than your pa, and I think, if a man has to choose between knowing how to spell and everything and having a little money, he better choose learning. Because he’ll be smart enough to think up a way to take money from the man that don’t know anything. Wait and see. You better go to school while you got the chance and learn—you’ll need it some day. My goodness, I wisht we’d ever stop in one place long enough to let me go to school. I have to just grab for all I know. The longest we stay anywheres is winters—out in Iowa—and an old hoss thief, Aggie Tim, traveled with us for awhile and he taught me my tables and lightnin’ calculating. I bet you don’t know any—I bet I know more’n you do—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I bet you don’t,” Dan retorted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Name the presidents of the United States,” pointing an accusing finger at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [22]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “McKinley—but he’s shot and we got Roosevelt,” Daniel bragged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean from the start of this country—Washington—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, sure, everybody knows about him, he never told a lie—like fun he didn’t—we don’t have school on his birthday. But I never have to go to school, if I don’t want to. I can stay in bed until nine o’clock and have pork sausage and griddle cakes and coffee sent up to my room. I can make Mrs. Hawkins send ’em up, even if she puts it on the bill—my father lets me and he gives me a dollar at a time and lets me spend it as I like. Sometimes he gives me beer to drink, and he takes me to cities on convention trips—he belongs to lodges and he gets himself made delegate—you ought to see the hotels we stay at with music playing for all the meals. I get a new suit and a whole lot of stuff to play with and so much candy that I have to stay in bed and just holler with the stomach-ache—there!” He paused with a characteristic Birge tilt of the head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley’s eyes were serious as she answered, “I’m sorry for you. When you’re a man and have a little boy, I hope you’ll bring him up better than you have been brought up. You’ll go to jail, if you keep on acting so wicked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jail? Why, my pa knows the sheriff an’ everybody. I guess he knows the president.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he knows so many people and is so smart, why don’t he live some place besides this funny town?” Thurley demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This stumped Dan for a moment, then he answered, “His property is here and he can do what he’s a mind to. If he moved to a city, he’d have to get acquainted with all the police and everything—see?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [23]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t like that. I guess you better not introduce me to your father; I wouldn’t approve of him. I won’t live in a little town. I want to be famous and have every one know me, when I drive through the streets, and have people throw flowers at me, when I sing. I want to do something wonderful—and good!” she ended emphatically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What could you do?” sneered Dan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stung by the inference, she took hold of his shoulders and gave him a sound shaking. “I told you—sing—sing—sing, you silly boy that can’t spell and eats too much candy. I can sing, and nobody can take that away from me or make me stop.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She released him unexpectedly, and he fell backwards over the step. He picked himself up in amazement, collecting his thoughts and saying slowly, “If you were a boy, I’d lick you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dare you—go on—pretend I am a boy.” She thrust her bare foot across the imaginary, forbidden line drawn by opponents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan laughed. “Honest, I like you too much. You ain’t a coward like Lorraine McDowell; she cries if a little bit of a toad hops her way. She likes me more’n I like her and I hate that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was that Lorraine with the pretty dress?” Thurley’s red lips twitched impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, she’s got lots of dresses—she’s always having parties and speaking in school, but she’s a cry-baby. Just because she’s the minister’s daughter she thinks she’s got to be in everything.... Thurley, what words was spelled wrong in that circus poster?” Dan’s dark eyes looked humbly at the new tyrant. “I’m taller’n you,” he could not refrain from adding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “People—p-e-o-p-l-e—and two ss’s in missing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [24]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll change ’em, if you’ll come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I can find the pins.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, you come and sing, and I’ll write on here, ‘Hear the wonderful singer from way out west; she has travelled miles to get here.’ It’ll be the next best thing to the swinging man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right.” Thurley clapped her hands. “Who is the swinging man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, me,” he answered, in innocent surprise at her question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Lorraine going to be in it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not much! She’s got to get pins and come and watch us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll sing, because I don’t think I like ministers’ children.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was another bond between them. But Dan’s way of showing it was to ask, “Where do you go to winters?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mostly the winter quarters of O’Brien’s circus. Ma used to pose in living pictures with one of the O’Brien girls and that’s why we got invited. The quarters are out in Iowa, and it’s just like having a real house and home. Sometimes acrobats that got hurt during the season rest up, or clowns, and one winter we had the india-rubber man and his wife, the bearded woman; and he taught me a lot of songs and she showed me two fancy steps in dancing. Of course, the nicest part is having the animals.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Animals?” demanded Dan incredulously. “You mean—circus animals?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure, that’s what the quarters are for—tigers and bears and monkeys and an elephant or two and a lion, and, for the last two winters, I was big enough to help rub in the tonic.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [25]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan’s eyes were aflame with curiosity. “Tonic?” he whispered. “What are you trying to hand me?” New worlds were rapidly opening for the young czar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Skin tonic—to get their coats in shape for the opening on Decoration Day. Sometimes they’re as glossy as silk by spring. Pa and Ma used to do it when I was too little, but their coughs got awful bad, so I took the job.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean—you swear to goodness,” Dan’s voice sunk to an excited whisper, “you rubbed tonic on—on a tiger?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley nodded carelessly; she saw no cause for agitation. “Yes, they need a lot—almost as much as the giraffe—his neck’s so long. After we used pails of it on the giraffe, he died—wasn’t that tough beans? The men holds ’em and we keep pouring it on and rubbing it on—they get real used to it after awhile—most of ’em haven’t any teeth anyhow. I wouldn’t be scared of any circus animal, if I had a pail of our tonic with me—they all know it for an old friend. It comes in a big, red pail labelled ‘Ma Thorpe’s Sheep Dip—Cures Man and Beast Alike.’ Why, one clown was the baldest thing you ever saw and he nearly beat the Sutherland Sisters at their own game when spring came, and the bearded lady never sat down for a moment that she wasn’t dipping her hand in a little saucer of it and rubbing it on her chin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I declare,” sighed Dan, fairly writhing with envy. “What else do you do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Paint the props over, and the clown practises his shines, and Ma and the bearded lady went over all the property tights and costumes and darned and washed ’em and sewed on new spangles. It was like a real family. You know,” she edged up confidentially, “I always played that it was a family—with the india-rubber man and his wife for the father and mother, and the clowns and acrobats[26] for uncles and aunts, and all the animals—except the snakes—were my brothers and sisters. I played the snakes were out-of-town relations.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what were your own father and mother?” Dan managed to inquire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Merely neighbors,” Thurley said with chilly politeness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently Dan sighed, “I wisht you’d stay in this town. Don’t your father or mother ever work or anything?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’re sick. I guess I ought to have been their father and mother. All the way here I sung for food and sold tins. Ma didn’t tell but two fortunes all the time. She got a summer squash for one and some lake trout for the other.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you’re dead poor,” the boy was thinking out loud.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but when I’m big and can sing in a hall and get a dollar a night—then we won’t be poor. We can travel in steam cars and Pa can have all the painkiller he likes, and Ma can just lay on a sofa and read novels and cry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan put his hand in his pocket and drew out some money. “Thurley, I want to honest buy some pans—can I—how much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re giving me money for something you don’t want!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By George, listen to her!” he informed the tired horses nibbling at posts. “I do, too—I want to put ’em away for Mrs. Hawkins’ Christmas present.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She said she didn’t need any. Didn’t you hear?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But presents ain’t what you need, but what you get.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t—you’re just being nice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I tell you—I’m manager of the show and I can pay you to sing, can’t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [27]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thurley’s eyes brightened. Dreams do come true, if one is patient.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’d take money for singing,” she admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A cent a song to begin with—if I take well, you can make it two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dan emptied the money into her ragged lap. “It’s about a dollar—and you can sing a hundred songs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At one performance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, we’re going to South Wales and Pike and give our show.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thurley, come in quick, your ma’s took bad,” called a weak voice from within. “I guess she’ll have to be rubbed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have to go—thanks, Dan.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by, Thurley; I hope she’s not awful sick—to-morrow—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow,” she waved one hand, the other holding the tattered dress skirt with its burden of coins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Half an hour later Mrs. Hawkins, coming to the box wagon to find out why the travellers had not appeared for their supper, found Thurley and her father kneeling beside the lounge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She must have died just as I come in,” Mrs. Hawkins told the neighbors. “Poor little lamb, blessed if she didn’t start right in to comfort that miserable dad of hers! Well, I guess them hosses will stay unhitched for some time to come!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2848/78550.html","bookId":1218,"creation":"Aug 11, 2019 8:06:43 AM","modification":"Aug 11, 2019 8:06:43 AM"}
