{"id":98116,"no":17,"title":"Page 17","content":"\u003cp\u003eBLUNT INSTRUMENTS\u003c/p\u003e\n\u003cp\u003eFRED VAN LENTE\u003c/p\u003e\n\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eFireteam Spartan: Black‘s objective was not difficult to locate. All one had to do was look for the enormous pinkish-purple plume of energy spearing out of the horizon on the colony world Verge.\u003c/p\u003e\n\u003cp\u003eThey bled silently through ten square kilometers of heavily fortified enemy anti-aircraft positions toward the perpetually shining beam until at last they reached the remains of Ciudad de Arias.\u003c/p\u003e\n\u003cp\u003eThis city had been among the hardest hit in the initial Covenant assault a few months prior. The buildings leaned and listed in their foundations like beaten boxers right before a climactic keel to the mat. It took Black-Four a few minutes to identify an apartment tower that looked stable enough for them to scale without it collapsing beneath their feet.\u003c/p\u003e\n\u003cp\u003eOnce they reached the penthouse, they passed stencils of pandas and koalas still visible on the charred walls as they entered what they assumed had been a child‘s room. They lay down on their bellies and looked out through the vacant holes where windows once were.\u003c/p\u003e\n\u003cp\u003eTheir massive target drifted about five blocks away, casually knocking over fire-gutted husks into clouds of rubble. Thanks to their untranslatable and unpronounceable Covenant name, FLEETCOM\u003c/p\u003e\n\u003cp\u003esimply dubbed the enormous machines ―Beacons.\" Nearly fifty stories tall and five city blocks wide, the Beacon looked to the Spartans‘ eyes like a perfectly symmetrical beehive floating atop four antigravity stilts. Out of its gaping lower orifice swarmed a buzzing cloud of Yanme‘e, the glittering, winged insectoids humans called Drones. Clicking and screeching and hissing and squealing in a teeth-gritting cacophony, the swarm tore deep below Verge‘s surface with handheld antigravity grapplers that yanked up great chunks of regolith. The Drones flew back up and\u003c/p\u003e\n\u003cp\u003edeposited the rocks inside the Beacon‘s hollow, irradiant heart, where the helium-3 inside them would be extracted and converted into pure fusion power. The energy was then projected skyward, focused in the form of a massive purple beam erupting from the Beacon‘s summit. A weblike\u003c/p\u003e\n\u003cp\u003econstellation of Covenant satellites orbiting Verge transmitted the power to the fleet blockading the colonies on Tribute, in the Epsilon Eridani system.\u003c/p\u003e\n\u003cp\u003eLike every other colony world‘s, Verge‘s helium-3 deposits had been trapped in the second mantle laid down over her original, natural exosphere during the spallation-heavy terraforming process. The Beacon would drift from continent to continent, gathering and extracting all the He-3 it could, until Verge was picked clean, a few weeks from now. Then the machine and its crew would be drawn up into a battle cruiser so the Covenant could glass the planet from space.\u003c/p\u003e\n\u003cp\u003eUnless, of course, Spartan: Black blew the godforsaken thing to kingdom come first, cutting off the primary fuel source to the fleet blockading Tribute and giving the colonists there a fighting chance.\u003c/p\u003e\n\u003cp\u003eWhich was exactly what they planned to do.\u003c/p\u003e\n\u003cp\u003e―What do we see, people?\" Black-One asked. Befitting their highly classified status as an\u003c/p\u003e\n\u003cp\u003eunconventional warfare (UW) unit, Spartan: Black‘s ebony armor had been created as skunkwork prototypes in a top secret parallel development lab in Seongnam, United Korea; as such, MJOLNIR: Black boasted a few variant design elements and enhancements completely different from the\u003c/p\u003e\n\u003cp\u003estandard-issue combat exoskeleton. Its HUD magnification, for example, was much greater than the standard Mark V or VI, with a field of view of nearly five thousand meters. From this distance, Spartan: Black could zoom in on the support troops milling beneath the antigrav ―feet\" of the Beacon and see them as clearly as if they had been standing across the street.\u003c/p\u003e\n\u003cp\u003e―Two Hunters per pylon,\" Black-Two said, noting the stooped, spiny-armored behemoths. Each\u003c/p\u003e\n\u003cp\u003ecreature‘s right arm terminated in a gun barrel studded with luminescent green power rods. ―Armed with standard assault cannon.\"\u003c/p\u003e\n\u003cp\u003e―Complemented by two—no, three—Jackals at each corner,\" Black-Three added.\u003c/p\u003e\n\u003cp\u003eThe spiky-crowned, beaked aliens carried, in addition to plasma pistols holstered at their sides, some kind of long pole made of a translucent purple-pink crystalline material. Occasionally, a Drone would flit away from the larger swarm in a confused, almost drunken fashion, and a couple of Jackals would descend on it with a shriek, stabbing the stray in the neck, where it wore a translucent reddish-orange collar. The bugger quaked spasmodically with pain, clutching the collar with its front claws; it could take only a thrust or two from the Jackals and the resulting seizures before it fell dutifully back with the swarm and resumed whatever task it had abandoned.\u003c/p\u003e\n\u003cp\u003e―Jackals aren‘t just security,\" Four said. ―They‘re also management.\"\u003c/p\u003e\n\u003cp\u003e―Very nice to meet you,\" Two said. ―I look forward to killing you.\"\u003c/p\u003e\n\u003cp\u003eNo one said anything for almost five minutes. They just watched the enemy work.\u003c/p\u003e\n\u003cp\u003eFinally, Three said, ―Hunters and Jackals—they‘re just another day at the office. I mean, I can kill Tree-Turkeys in my sleep. And Can-o‘-Worms are something you can sink your teeth into. But the buggers—how many are there?\"\u003c/p\u003e\n\u003cp\u003e―I‘ve got a hundred, a hundred fifty so far,\" Four said. ―But I‘m not sure . . . some I may have counted twice. They‘re moving pretty fast down there.\"\u003c/p\u003e\n\u003cp\u003e―One-fifty . . . Jesus,\" Three said. ―How are the buggers going to react when we bring the hammer down? Can they use those grappler things as weapons? What kind of intel do we have on their tactics and behavior?\"\u003c/p\u003e\n\u003cp\u003e―We have jack,\" said Two, the fireteam‘s intelligence officer. ―Covenant‘s rarely deployed them as combatants.\"\u003c/p\u003e\n\u003cp\u003e―Jesus,\" Three muttered again, shaking his head. ―I hate surprises.\"\u003c/p\u003e\n\u003cp\u003e―If it was easy, they wouldn‘t call us heroes,\" One drawled.\u003c/p\u003e\n\u003cp\u003e―I‘d prefer a pat on the back,\" Three said. ―But I gotta be alive for that.\"\u003c/p\u003e\n\u003cp\u003e―Two,\" One said, ―find us a room in the interior where we can mull this over and catch some Z‘s without being seen from the street.\"\u003c/p\u003e\n\u003cp\u003e―Copy that, Chief.\" Black-Two backed out on her stomach until she reached the nursery‘s doorway, then got up into a crouch and made her way quickly but cautiously through the rest of the penthouse.\u003c/p\u003e\n\u003cp\u003eShe determined that what was left of the kitchen had no good sightlines to the perimeter and prepared to return and tell One but was stopped by a fluttering, flapping sound from a doorway on the north side of the room.\u003c/p\u003e\n\u003cp\u003eShe pressed her back against the wall and peered around the doorway. She was looking into a ruined family room, a flatscreen lying facedown and shattered on a carpet littered with tempered glass that once filled floor-to-ceiling windows. On the ground beside a sofa blackened and bloated by fire and the elements, a solitary Yanme‘e Drone twitched his wings spasmodically.\u003c/p\u003e\n\u003cp\u003eTwo put both hands on the assault rifle hanging from her shoulder and silently lined up a shot at the crown of the bugger‘s walnut-shaped head. Something seemed off about the creature, though. She didn‘t pull the trigger.\u003c/p\u003e\n\u003cp\u003eTwo realized the Drone was on his back, pulsing the hinged armored plates that covered his wings over and over again in a futile attempt to flip himself over onto his belly. Two could now see that all four of his lower legs had been cut off and cauterized at the stumps. His two remaining arms didn‘t have joints that allowed him to reach behind and push himself upright.\u003c/p\u003e\n\u003cp\u003eTwo watched him struggle for twenty seconds more. Then she emerged from behind the doorway\u003c/p\u003e\n\u003cp\u003eand took several slow strides over to where the Drone lay. His orange, half-egg eyes were fixed at the ceiling and didn‘t register her approach.\u003c/p\u003e\n\u003cp\u003eStill covering the insectoid with the rifle, Two tucked one foot under the creature‘s body and kicked him up and over. He began frantically beating his wings to stay upright while hopping up and down on the end of his abdomen. The bugger was human sized, and they were now practically eye to eye. Two took a step back and made sure the Drone was staring down the barrel of the AR.\u003c/p\u003e\n\u003cp\u003eHolding the gun steady with one hand, she flexed her other elbow in such a way that a\u003c/p\u003e\n\u003cp\u003ecompartment sprang open along the left foreaem of the skunkware MJOLNIR. A wand computer\u003c/p\u003e\n\u003cp\u003ewith a microphone, speakers, a digital ink keyboard, and every scrap of linguistics data United Nations Space Command had gathered on the languages of Covenant races popped out of the\u003c/p\u003e\n\u003cp\u003ecompartment and slid into her palm.\u003c/p\u003e\n\u003cp\u003e―Identify yourself and your purpose,\" Two said sternly, and waited for the Interrogator, as ONI had christened the device, to translate and broadcast the question in Yanme‘e.\u003c/p\u003e\n\u003cp\u003eThe icon of a rotating circle appeared on the Interrogator‘s display, indication it was working. After only a few seconds, the device emitted a faint series of clicks and screeches in a pitiful attempt to mimic Yanme‘e speech. Two had little faith in it succeeding. Sure enough, a moment later, its display flashed: ―Untranslatable.\" Two cursed under her breath. Not enough was known about the damn buggers to make even that simple demand intelligible.\u003c/p\u003e\n\u003cp\u003eWith his head cocked quizzically, the Drone watched as Black-Two tried to rephrase the question a couple of different ways so that the Interrogator might translate, but no avail.\u003c/p\u003e\n\u003cp\u003eThen the creature made an unmistakable gesture, extending one claw in her direction, then curling his digits rapidly toward himself: Give.\u003c/p\u003e\n\u003cp\u003eBlack-Two frowned. What little intel ONI had on the Drones suggested they had an instinctive faculty for technology. Cautiously, she handed the Interrogator over. There seemed little harm in it.\u003c/p\u003e\n\u003cp\u003eA cord attached the device to her forearm to supply it with power and data, as well as ensure that the other half of a conversation couldn‘t just walk away with it.\u003c/p\u003e\n\u003cp\u003eThe second the Yanme‘e wrapped his claws around the device he popped open the access panel on its underside. He rearranged the circuits and microfilament wires in the Interrogator‘s guts with such speed and precision that one would have thought he had spent every waking moment for the past twenty years working with them.\u003c/p\u003e\n\u003cp\u003eTwo opened her mouth to protest, but found herself just watching, transfixed by the rapidity of the thing‘s movements, which had a certain kind of flitting grace, like a dragonfly making its evasive way across the surface of a pond. Something in the device clicked.\u003c/p\u003e\n\u003cp\u003eAnd the creature started talking.\u003c/p\u003e\n\u003cp\u003eIN THEnursery lookout, Black-One was just starting to wonder what was taking Black-Two so\u003c/p\u003e\n\u003cp\u003elong when her subordinate‘s voice rang out from inside the apartment: ―Chief! Better come here!\u003c/p\u003e\n\u003cp\u003eBring the boys, too!\"\u003c/p\u003e\n\u003cp\u003eThe rest of Spartan: Black walked into the living room to find Two tethered to the Drone by the Interrogator‘s power cord. At first glance it looked like the Yanme‘e was holding the Spartan on a leash.\u003c/p\u003e\n\u003cp\u003e― Whoa! Whoa! Whoa! \" Instantly, the three other Spartans fell into an attack phalanx, Three and Four both dropping to one knee and raising their ARs while One remained standing, training her own weapon on the Drone‘s head. ―Spartan Black-Two!\" she barked. ―Step away from the hostile!\"\u003c/p\u003e\n\u003cp\u003eTwo held up both hands and made calming gestures. ―It‘s okay,\" she said. ―It‘s okay. He‘s not all that hostile. I named him Hopalong. Hopalong, meet the guys. Guys, meet Hopalong.\"\u003c/p\u003e\n\u003cp\u003eHopalong‘s claws flickered across the translator‘s digital ink keypad. ― Hello, guys. \" Normally, the Interrogator spoke in the inflectionless nonaccent of the midwestern United States. But whatever the Drone did to the machine‘s insides had distorted the computer voice so that now it sounded more like a recording of intelligible speech played backward that just happened to also sound like intelligible speech.\u003c/p\u003e\n\u003cp\u003e―The hell, Two?\" Three snapped. ―Making friends?\"\u003c/p\u003e\n\u003cp\u003e―He knows an alternate route to the Beacon, an underground one,\" Two said calmly, but with\u003c/p\u003e\n\u003cp\u003eurgency. ―Tunnels that have been completely cleaned out of helium-3 so the buggers don‘t go in them anymore. We can slip in under the antigrav pylons and take them out before the Covenant knows what hit them.\"\u003c/p\u003e\n\u003cp\u003e―How did he know we were after the Beacon in the first place?\" Three demanded. ―You tell him?\"\u003c/p\u003e\n\u003cp\u003e―Have you looked outside?\" Two snapped defensively. ―Like there‘s anything else on this dirtball worth blowing up.\"\u003c/p\u003e\n\u003cp\u003e―I can‘t think of a single reported instance in which Covenant provided aid to human troops against their own kind,\" One said, pointing her weapon at Hopalong. ―We trust this bug . . . why?\"\u003c/p\u003e\n\u003cp\u003e―See that?\" Two pointed to the stumps where Hopalong‘s missing limbs had once been. ―The\u003c/p\u003e\n\u003cp\u003eJackals did that. They work the buggers to death on that thing.\"\u003c/p\u003e\n\u003cp\u003eHopalong‘s claw flickered across the translator in short, staccato bursts. ― Kig-Yar do this,\" the machine said, using the Jackals‘ own name for themselves. ― I drop cache twice. Kig-Yar cut legs off.\u003c/p\u003e\n\u003cp\u003eSay I worthless. Let me crawl from Hive. Think I die, but no. Then I see you come. Through city. I follow. I come here. Climb walls. See you. Know you help. You kill Kig-Yar. All Drones help. Hive help.\u003c/p\u003e\n\u003cp\u003e― Covenant conquered us. Jiralhanae and Sangheili. Overthrew our own Hive-Gods. Make Hive worship Prophets instead. Rule through fear and pain. Now they come for you. Together we stop them. Earth Hive and Yanme’e. Just give us freedom. Freedom. Freedom. Freedom. \"\u003c/p\u003e\n\u003cp\u003eHe reached up and touched the red-orange collar around his neck with both claws. He flicked at it, as if wishing to rip it off, but didn‘t have the power.\u003c/p\u003e\n\u003cp\u003e― Freedom. Freedom. Freedom. \"\u003c/p\u003e\n\u003cp\u003eHopalong kept repeating the same click-and-whistle combination that presumably meant freedom in the Yanme‘e language. Two yanked the translator out of the Drone‘s hand and turned it off.\u003c/p\u003e\n\u003cp\u003eShe pointed at herself, then at the rest of Fireteam Black, then made a ―talking\" symbol by slapping her thumb and fingers together. ―We will get back to you,\" she said loudly.\u003c/p\u003e\n\u003cp\u003eFireteam Black went into the kitchen where they could still see the Drone but he couldn‘t hear them, Interrogator or not.\u003c/p\u003e\n\u003cp\u003eThe others waited for One to weigh in first. She didn‘t say anything for a minute, then said, ―I can‘t shake the feeling there‘s something not quite on the up-and-up about this. But maybe that‘s because I don‘t like a roach as big as I am coming up with my battle plans.\" They couldn‘t see her face beneath the reflective gray visor of her helmet, of course, but it was obvious to all of them she was wrestling with the idea. ―Besides, inserting ourselves into local intra-Covenant disputes is a little above our pay grade, Two. We‘re more the blunt-instrument type.\"\u003c/p\u003e\n\u003cp\u003eTwo glanced back at Hopalong. He lay propped up on the floor on the middle joints of his\u003c/p\u003e\n\u003cp\u003eremaining arms—the elbows, she supposed—and rubbed his claws together in front of his\u003c/p\u003e\n\u003cp\u003emandibles, back and forth, back and forth, like a housefly, in some kind of hygienic ritual.\u003c/p\u003e\n\u003cp\u003e―Normally I‘d agree, Chief, but the plan he‘s proposing seems the best way to take the enemy by complete surprise and circumvent the Drone threat.\"\u003c/p\u003e\n\u003cp\u003e―You can be sure he‘s not leading us smack-dab into a trap?\" The doubt in Three‘s voice was unmistakable.\u003c/p\u003e\n\u003cp\u003e―If he wanted us dead all he had to do was whistle for his buddies the minute he laid eyes on us,\"\u003c/p\u003e\n\u003cp\u003eFour pointed out. ―Why contrive some elaborate ambush?\"\u003c/p\u003e\n\u003cp\u003eBlack-One said, ―I‘ve got to say, the opportunity to hit the ground hot, inside the enemy‘s defenses, and take out the objective before they even have a chance to mount any kind of a resistance . . .\" She stayed silent for a second or two then announced, ―Yeah, that‘s just too good to pass up. Okay, Two.\u003c/p\u003e\n\u003cp\u003eTell the bugger he‘s got a deal.\"\u003c/p\u003e\n\u003cp\u003eTwo went over to Hopalong to connect him to the translator again and give him the good news.\u003c/p\u003e\n\u003cp\u003eOnce she was out of earshot, Four asked One, ―And if it is a trap?\"\u003c/p\u003e\n\u003cp\u003eBlack-One looked straight at him. ―Then we kill them all.\"\u003c/p\u003e\n\u003cp\u003e―Now you‘re talking,\" Three said.\u003c/p\u003e\n\u003cp\u003eTWO\u003c/p\u003e\n\u003cp\u003eFireteam Black waited until an hour before dawn, which was scheduled to arrive around 0600\u003c/p\u003e\n\u003cp\u003ehours or so. In the interim they downed some high-protein MREs, then helped Three remove eight medium-sized backpacks from a case he had humped all the way from the drop point by himself.\u003c/p\u003e\n\u003cp\u003eEach Spartan slipped a C-12 ―blow pack\" over each shoulder. A single pack could punch a hole in the hull of a Covenant Cruiser, as Fireteam Black had had the pleasure of witnessing firsthand. They had little clue what kind of material the Beacon‘s antigrav pylons were made out of, but the general consensus was that one pack per pylon should do the trick. And they probably only needed to knock out one or two pylons to send the whole thing crashing to the ground.\u003c/p\u003e\n\u003cp\u003e―And if not?\" Four asked.\u003c/p\u003e\n\u003cp\u003e―Then we try harsh language,\" One said.\u003c/p\u003e\n\u003cp\u003eEveryone chuckled. Pre-op gallows humor. Situation: normal.\u003c/p\u003e\n\u003cp\u003eHopalong watched them the whole time, hop-hovering in place, glittering head bobbing from one side to the other; whether that was from fascination or boredom no Spartan could say.\u003c/p\u003e\n\u003cp\u003eThey fell in to callsign order and snaked down the stairs and out of the apartment building in single file.\u003c/p\u003e\n\u003cp\u003eHopalong chose to crawl face-first down the edifice‘s side.\u003c/p\u003e\n\u003cp\u003eOn the ground, One insisted that Hopalong point in the direction that he wished them to go; One then sent Four, with his battle rifle, to scope out the area. It never failed to amaze One, even after all these missions and engagements, how effortlessly Four simply melted into the shadows in his jet-black MJOLNIR, carrying his rifle by its barrel at his hip like it was a lunchbox. She and the others hunkered down behind piles of rubble and waited until the little yellow dot representing Black-Four on the circular motion tracker in the lower-left corner of their helmet displays briefly flashed green. Without giving any verbal commands, One rose to a crouch and sprinted in Four‘s direction; Three leapt up quickly and followed; Two, a little bit more slowly, so the crippled Hopalong could keep up behind.\u003c/p\u003e\n\u003cp\u003eThey zigzagged through the ruins of Cuidad de Arias like this for twenty minutes, until Four swept, at Hopalong‘s indication, the basement of another crippled apartment tower via a side stairwell. An entire cellar wall had collapsed, burying a line of washing machines and exposing a rough-hewn tunnel carved in the unnaturally raised mantle of the terraformed planet.\u003c/p\u003e\n\u003cp\u003eBlack-One switched the order of their close alignment at that point, acquiescing to Hopalong taking the lead, Four following, then Two, then Three. She took rear guard. Their sleek train formation was belied by their stumbling progress through the rough tunnel, which had been carved out by\u003c/p\u003e\n\u003cp\u003einsectoids expecting only to fly through it. So the ―floor,\" such as it was, was just as covered in fissures and protrusions and jagged edges as the ―walls\" or ―ceiling.\" It was more like an esophagus than a tunnel, snaking in cylindrical fashion down, down, down ever deeper into the earth. Hopalong now had the advantage, hastily flitting forward on his translucent wings, disappearing from view until the column of Spartans rounded a bend to find him hovering in place, impatiently beckoning them forward with a claw. Visibility was awful, provided solely by light enhancement in their helmet visors, bathing their environs in a lime-green gloom. The whole experience would have been extremely claustrophobic, had spending days at a time entombed within head-to-toe exoskeletons not cured every Spartan of any possible inclination toward claustrophobia a long, long time ago.\u003c/p\u003e\n\u003cp\u003eThey clambered and crawled through the tunnel until, very faintly, they could hear the\u003c/p\u003e\n\u003cp\u003eunmistakable hum of the Drone swarm at work far in the distance, and the warren walls began to tremble with the looming overhead presence of the Beacon. They were drawing near.\u003c/p\u003e\n\u003cp\u003eThree stopped abruptly in front of One, and she almost walked right into him.\u003c/p\u003e\n\u003cp\u003eHe turned around, raised his hand before her, and raised an index finger—the UNSC silent signal for Heads up.\u003c/p\u003e\n\u003cp\u003eShe peered around Three‘s shoulder to the front of the line. Four had stopped as well and was turning to pass signs back to Two, who passed them to Three, who passed them to her.\u003c/p\u003e\n\u003cp\u003eA raised fist: Hold position.\u003c/p\u003e\n\u003cp\u003eFour disappeared into the darkness of the tunnel.\u003c/p\u003e\n\u003cp\u003eOn her motion sensor One could see his yellow dot move eight, ten, fifteen meters away from their position—then he was out of sensor range.\u003c/p\u003e\n\u003cp\u003eNothing happened for what seemed like a very long while.\u003c/p\u003e\n\u003cp\u003eThen the yellow dot reappeared on her sensor and rejoined the others. Four materialized out of the gloom.\u003c/p\u003e\n\u003cp\u003eHe raised his forearm, clenched his fist, and pumped it up and down, rapid-fire: Hurry!\u003c/p\u003e\n\u003cp\u003eHe disappeared back down the tunnel, and the others followed. In a few paces they entered a mammoth, ovular cavern, the top of which was covered with what appeared to be metallic scales, some kind of mineral deposit that caused the ceiling to gleam even in the subterranean nonlight.\u003c/p\u003e\n\u003cp\u003eThen One‘s breath caught in her throat.\u003c/p\u003e\n\u003cp\u003eSpartans were not, as a group, especially well acquainted with fear, but when she spotted one of the\u003c/p\u003e\n\u003cp\u003e―scales\" overhead shudder, as if shaking off a dream, One knew exactly what she was looking at.\u003c/p\u003e\n\u003cp\u003eSleeping Drones. Hundreds of them, dangling from the ceiling of the cavern, completely carpeting the rock above.\u003c/p\u003e\n\u003cp\u003eShe had only the one chance to glance above before she returned her attention to Three‘s back. He was in a crouch, weaving a nonlinear path through the cavern. One immediately intuited why: Four had gone out before them to scout the best route through the innumerable loose rocks and\u003c/p\u003e\n\u003cp\u003eankle-busting crevices in the cave floor so they could make their way through without noise. No need to wake the Yanme‘e, no matter how friendly they were supposed to be. She knew for certain now that whatever Hopalong‘s plan was, it wasn‘t an ambush. If it were, they‘d already be dead.\u003c/p\u003e\n\u003cp\u003eA distant noise kicked One right in the stomach: She could still hear a different swarm of Drones slaving away in the distance.\u003c/p\u003e\n\u003cp\u003eThere were twice as many Drones here as they had previously counted. The day swarm worked\u003c/p\u003e\n\u003cp\u003ewhile the night swarm slept, and vice versa.\u003c/p\u003e\n\u003cp\u003eThat meant there had to be three to four hundred Drones all told in the area.\u003c/p\u003e\n\u003cp\u003eBlack-One hoped they all shared Hopalong‘s democratic sympathies.\u003c/p\u003e\n\u003cp\u003eAfter a few twists and turns beyond the large cavern, Hopa-long signaled for a stop and the Spartans circled him. They were so close to the work site that the grinding, growling of the excavations drowned out all other sounds, and the tunnel walls shook so violently they were periodically showered by dust and stones from above. A possible cave-in wasn‘t far from their thoughts.\u003c/p\u003e\n\u003cp\u003eHopalong produced a thin broadcast data wafer.\u003c/p\u003e\n\u003cp\u003e―Hell is that?\" Three shouted. In any other circumstances a whisper would have been preferable, but the harsh roar of digging practically prevented them from hearing themselves.\u003c/p\u003e\n\u003cp\u003e―Hopalong salvaged the broadcast wafer out of the video screen in the penthouse,\" Two yelled back. ―He rejiggered it to show abandoned tunnels that lead toward one of the Beacon‘s pylons, and avoids ones being used for excavation now.\"\u003c/p\u003e\n\u003cp\u003e―I‘m not sticking that thing in my head!\" Three exploded. ―Who knows what kind of enemy worms or viruses Bug Boy stuck on it!\"\u003c/p\u003e\n\u003cp\u003e―I saw him make it myself, while you guys slept.\"\u003c/p\u003e\n\u003cp\u003e―Nothing personal, Two, but that doesn‘t exactly fill me with confidence.\"\u003c/p\u003e\n\u003cp\u003e―What‘s that supposed to mean?\"\u003c/p\u003e\n\u003cp\u003e―You‘ve got some serious Stockholm syndrome going on here with your six-legged boyfriend,\u003c/p\u003e\n\u003cp\u003ethat‘s all I‘m saying. Your judgment may be seriously effed up.\"\u003c/p\u003e\n\u003cp\u003e―Sorry, I didn‘t quite catch that.\" Two got her back up. ―You mind saying that again?\"\u003c/p\u003e\n\u003cp\u003eWith an explosive sigh that could be heard even over the grinding din surrounding them, Four reached between Two and Three and yanked the data wafer out of Hopalong‘s claw. He stuffed it into the receiving slot on the side of his helmet.\u003c/p\u003e\n\u003cp\u003eThree stared at Four. ―You‘re a lot of help. I‘m trying to hold an intervention for our sister here.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-17.html","bookId":1641,"creation":"Oct 5, 2019 6:32:09 PM","modification":"Oct 5, 2019 6:32:09 PM"}
