{"id":101060,"no":22,"title":"Page 22","content":"\u003cp\u003eA pause from Lopez. ―I did mention the Covenant. Acting strangely. On this civilian ship. In an unknown and highly classified location. Right?\"\u003c/p\u003e\n\u003cp\u003eBurgundy bit back a chuckle. She wasn‘t fond of Rebecca either.\u003c/p\u003e\n\u003cp\u003e―We heard you, Sergeant,\" Rebecca said, about as icy as an AI could get.\u003c/p\u003e\n\u003cp\u003e―Request reinforcements to aid with the mission.\"\u003c/p\u003e\n\u003cp\u003e―Request denied.\"\u003c/p\u003e\n\u003cp\u003e―I want to talk to the commander.\"\u003c/p\u003e\n\u003cp\u003eA false smile entered Rebecca‘s voice, like the sun rising over an ice field. ―The commander and I are of the same mind, Sergeant.\"\u003c/p\u003e\n\u003cp\u003e―Requesting—\"\u003c/p\u003e\n\u003cp\u003e―Negative.\" This time it was Foucault, patched in over Rebecca‘s feed. Burgundy‘s stomach\u003c/p\u003e\n\u003cp\u003echurned. ―Sorry, Sergeant, but we can‘t send anyone without alerting the Covenant capitol ship to our presence, and you know we‘re outmanned and outgunned. I‘m invoking the Cole Protocol. The secrecy of Earth‘s location is paramount, and the Mona Lisa does appear to be compromised by Covenant. Stand by for your orders.\"\u003c/p\u003e\n\u003cp\u003e―Sir.\"\u003c/p\u003e\n\u003cp\u003e―Ascertain if the Covenant have accessed the nav system. If not, destroy it before they do. If so\u003c/p\u003e\n\u003cp\u003e. . .\" he stopped, then continued, after what sounded like consultation with Rebecca, ―. . . we will inform you when it is safe for you to return.\"\u003c/p\u003e\n\u003cp\u003e―Sir.\" Burgundy could hear Lopez striving and failing to keep frustration out of her voice. ―Sir, I‘m down five already, as far as I know. We can keep going, shut down the nav and flush out every Covie on this stinking boat, but begging your pardon, it‘s a big-ass boat. We need some ODST\u003c/p\u003e\n\u003cp\u003emotion sensors happening. Get a Pelican out here on, I don‘t know, thrusters alone, something!\"\u003c/p\u003e\n\u003cp\u003eBurgundy was thinking it. Lopez was thinking it. She bet even the commander was thinking it.\u003c/p\u003e\n\u003cp\u003eOrders from officers who weren‘t on the ground weren‘t worth shit.\u003c/p\u003e\n\u003cp\u003e―Negative, Sergeant. You have your orders, and I trust you‘ll see them through in your usual . . .\u003c/p\u003e\n\u003cp\u003espectacular . . . fashion,\" he said with a trace of amusement.\u003c/p\u003e\n\u003cp\u003e―Yes, sir.\" Said without grace. ―Sir, permission to speak freely?\"\u003c/p\u003e\n\u003cp\u003e―Denied.\"\u003c/p\u003e\n\u003cp\u003e―You‘re fading now. You‘re breaking up,\" Rebecca said. ― You have your orders.\" Said remotely, with finality, her attention already elsewhere.\u003c/p\u003e\n\u003cp\u003eA beat. And then, ―They gone, Burgundy?\"\u003c/p\u003e\n\u003cp\u003e―Yes, Sarge.\"\u003c/p\u003e\n\u003cp\u003eLopez said something really obscene.\u003c/p\u003e\n\u003cp\u003e―You got that right,\" Burgundy muttered.\u003c/p\u003e\n\u003cp\u003e―You cozy?\"\u003c/p\u003e\n\u003cp\u003e―Yeah.\"\u003c/p\u003e\n\u003cp\u003e―Alone?\"\u003c/p\u003e\n\u003cp\u003eNothing had moved on the feed for some time now, the last flashlight flickering on the ground. ―I can‘t see anything.\"\u003c/p\u003e\n\u003cp\u003e―Okay. Sit tight. Keep monitoring, let me know when the Red Horse is talking again. We‘ll come back and mess up your bird and you‘ll hate us for it.\"\u003c/p\u003e\n\u003cp\u003e―And then there‘ll be ice cream.\"\u003c/p\u003e\n\u003cp\u003e―Damn straight. Over and out.\"\u003c/p\u003e\n\u003cp\u003eOutside, the last flashlight went dark.\u003c/p\u003e\n\u003cp\u003e\u0026gt;Lopez 1402 hours\u003c/p\u003e\n\u003cp\u003eTwelve rosary beads now. Lopez had a burning anger in her guts that had nothing to do with the Covenant. Already blood in the dark. She had her orders. Her lousy orders. She had twelve Marines left, a big-ass ship to clean out, and no support of any kind.\u003c/p\u003e\n\u003cp\u003eI’ll give you “spectacular.”\u003c/p\u003e\n\u003cp\u003eThey stood around her, around Rabbit‘s remains, around the dead Covenant, silent and waiting.\u003c/p\u003e\n\u003cp\u003e―You heard,\" she said, looking into each of their faces in turn. Shadowed, murky faces in the flashlight beams, but still those of her Marines. ―Change of plan, boys and girls. We got Covies on board, so the good commander has invoked the Cole Protocol. We need to kill the nav system and the backup nav system, that‘s our primary goal. Ascertaining what the hell is going on here is now a secondary objective. Orlav, you got that rough schematic? See the engine room?\"\u003c/p\u003e\n\u003cp\u003e―Yeah.\" She didn‘t sound too enthusiastic.\u003c/p\u003e\n\u003cp\u003e―All right, Benti, you take Clarence, Orlav, Gersten, and Tsardikos. You‘re going after the backup down in the engine room. You take care of it, then you get your asses back here. You see any Covies along the way, you kill Covies. I don‘t care if they‘re happy to see you or not. None of them get off this ship, got it?\" Thought Benti, with Clarence, would be more effective heading things up on that team than Orlav. Orlav did good recon, but she couldn‘t improvise.\u003c/p\u003e\n\u003cp\u003e―Yes, sir!\" Benti said, already out the door and slinking down the corridor, the others following her.\u003c/p\u003e\n\u003cp\u003e―I mean it, Private!\" she called out after them, not looking at the thing hidden in Rabbit‘s body.\u003c/p\u003e\n\u003cp\u003e―You shoot anything you see. Don‘t let anything get close. Nothing, you hear me?\"\u003c/p\u003e\n\u003cp\u003e―Saaaarge, you know me,\" Benti said. ―I don‘t let anybody get close.\" Her voice didn‘t say that at all.\u003c/p\u003e\n\u003cp\u003e―No gear,\" Percy said, nudging the Covenant Elite with his boot, ripples spreading in the bloodied water. ―Not a one of these bastards has any gear at all.\"\u003c/p\u003e\n\u003cp\u003e―All the better for us.\"\u003c/p\u003e\n\u003cp\u003e―How‘d Covenant get on board this ship, Sarge?\" McCraw asked. ―How? Just landed here with no weapons and no gear?\"\u003c/p\u003e\n\u003cp\u003e―Maybe they‘re prisoners,\" Rakesh said.\u003c/p\u003e\n\u003cp\u003eLopez snorted. ―Right. Because we take so many Covenant prisoners.\" Then she stopped, a bead catching in her mind. ―Where the hell is Ayad?\" she asked.\u003c/p\u003e\n\u003cp\u003eThey had no good answer.\u003c/p\u003e\n\u003cp\u003e\u0026gt;Benti 1431 hours\u003c/p\u003e\n\u003cp\u003eThings went wrong almost from the start for Benti and her team. It sure looked easy at first, though, which had Benti humming an old pop song under her breath. They had cut across the ship, passing through processing cells and checkpoints and security stations toward what Orlav assured Benti was a shortcut—a series of access tunnels would lead to B deck. Benti was all about the shortcuts.\u003c/p\u003e\n\u003cp\u003eBut now Clarence was bracing himself, back to the wall and foot on the door they needed to pass through. He grunted, his boot squeaking with the effort, but the door didn‘t budge. A makeshift barricade on the other side was the culprit. It wasn‘t the first they‘d seen. They‘d seen too many, in fact.\u003c/p\u003e\n\u003cp\u003eThe corridor was too straight and dark for her tastes, like being devoured by a throat. Even the continued sight of swatches of blood—across walls, across ceilings—had begun to get to her. Blood still didn‘t bother her, but she‘d never seen so damn much before, over such a long period. She‘d run out of jokes about it. Even the dull smell of it was getting to her. She didn‘t like that she couldn‘t raise Burgundy, either.\u003c/p\u003e\n\u003cp\u003eGersten muscled in beside Clarence, but gave up after a moment.\u003c/p\u003e\n\u003cp\u003e―No good, not gonna move.\" Gersten, a great hulk of a man, spoke almost as rarely as Clarence, and with as much authority.\u003c/p\u003e\n\u003cp\u003eClarence shook his head in agreement, even as he gave the door another kick.\u003c/p\u003e\n\u003cp\u003eA high-pitched shriek tore through the corridor, dissolved into a cackle, cut off.\u003c/p\u003e\n\u003cp\u003e―What the hell was that?\" Tsardikos asked.\u003c/p\u003e\n\u003cp\u003e―Just the ship, probably,\" Benti said, lying.\u003c/p\u003e\n\u003cp\u003e―Yeah,\" he replied, barely heard her. ―Right.\"\u003c/p\u003e\n\u003cp\u003e―Hang on,\" Orlav said as she scrolled through the schematic a lot quicker than she had been. ―I‘ll find us another route.\"\u003c/p\u003e\n\u003cp\u003eThe tension was thick between them, the muted light shifting imperceptibly across Orlav‘s face as she traced out paths and access points. Benti could hear the others trying to breathe quietly, trying not to breathe at all.\u003c/p\u003e\n\u003cp\u003eBenti had a good imagination. She remembered that Elite, unarmed and naked and shushing her so it could listen, and she listened, too. She knew that ships were never silent. They had their own language. Humming ventilation, the drone of the engines, the electronic pitch of a million circuits, the groan of vast plates resisting the vacuum of space. That shriek hadn‘t been a ship noise, not even close.\u003c/p\u003e\n\u003cp\u003eAs Orlav continued to scroll, a new sound brushed up the corridor and overhead—like an enormous feather sliding across tin foil that then resolved into something soft and sickening and chittering. A sound you‘d tell yourself you‘d imagined, because you couldn‘t imagine what would have made it.\u003c/p\u003e\n\u003cp\u003eIt didn‘t repeat. Benti never wanted to hear it again.\u003c/p\u003e\n\u003cp\u003eBenti held her flashlight steady, deliberately steady, staring into the darkness at nothing, gathering herself. Then she cast a quick eye around the walls. ―Ducts?\"\u003c/p\u003e\n\u003cp\u003e―You can get into the damn ducts,\" Tsardikos said. ―I‘m not.\"\u003c/p\u003e\n\u003cp\u003e―Not enough space for anyone anyway,\" Gersten said, looking as spooked as Benti felt.\u003c/p\u003e\n\u003cp\u003e―Okay.\" Orlav‘s voice made Benti start. ―We need to backtrack. Should be access to the lower level two junctions over from the last intersection. This will take us through the recycling plant.\" Orlav sounded triumphant, which bothered Benti a bit. Don’t applaud work-arounds until they actually work around.\u003c/p\u003e\n\u003cp\u003e―Yum,\" she said, with an enthusiasm she didn‘t feel.\u003c/p\u003e\n\u003cp\u003eShe cast a last look over the blocked door. None of them had said it, but the barricade that had stopped them hadn‘t held. The wreckage—an unholy flotsam and jetsam of chairs, couches,\u003c/p\u003e\n\u003cp\u003esmashed up boxes, machine parts, and even a potted plant or two—had been pushed back and\u003c/p\u003e\n\u003cp\u003ejammed the door after it had been broken. Just like so many other barricades and blockades they‘d passed on their way, as if a frantic siege had rolled its way through the ship. Prison riot , she thought, trying it on for size. It didn‘t fit. Not really.\u003c/p\u003e\n\u003cp\u003eThere had been a glimpse, in the narrow sliver of passage still open, of the corridor beyond. It was painted purple with Covenant blood. At the edge of the torch light she thought she‘d seen a shape on the floor, something with dimensions that didn‘t sit well with her.\u003c/p\u003e\n\u003cp\u003eThey should have found someone by now. Nobody said that either.\u003c/p\u003e\n\u003cp\u003e\u0026gt;Lopez 1440 hours\u003c/p\u003e\n\u003cp\u003eLopez popped the cap from a bottle of antiseptic and splashed it liberally on the open gash on MacCraw‘s arm. Second time he‘d gotten wounded, this time from tripping over a barricade. He really needed to do a better job of looking where he was going.\u003c/p\u003e\n\u003cp\u003e―Quit yelping,\" she ordered, tasting caustic medicine in her nose and throat. ―You a man or a mouse?\"\u003c/p\u003e\n\u003cp\u003e―It burns!\"\u003c/p\u003e\n\u003cp\u003e―Poor mouse,\" she said, entirely without sympathy. They hadn‘t found Ayad, might never find Ayad. Lopez would take a gash against being lost in that darkness any day.\u003c/p\u003e\n\u003cp\u003eWhen MacCraw kept complaining, she poured the last of the antiseptic in a rush all over the wound. ―Be glad Mama Lopez knows what‘s good for you.\"\u003c/p\u003e\n\u003cp\u003eNever expected they‘d stop in the infirmary on the way to the bridge, MacCraw‘s boo-boo\u003c/p\u003e\n\u003cp\u003enotwithstanding, but there were no direct routes left in the Mona Lisa . Hatches jammed, barricades erected, some of them still holding, some not. Too many obstacles in unknown terrain, and she‘d drastically revised their ETA to the bridge, to the point that she didn‘t have one any more. Could only hope they could gain access when they got there.\u003c/p\u003e\n\u003cp\u003eThe infirmary itself had remained immune to all of the destruction around it. Did their first aid work on Covenant? Probably not. No reason for the buggers to ransack the joint.\u003c/p\u003e\n\u003cp\u003eThey‘d pushed over a pathetic blockade at the entrance with ease. For the first time, Lopez saw graffiti, scrawled in blood across a turned-over chair, and running across the wall: ―Tell Ma I didn‘t do it. I didn‘t. Not any of it. God bless.—George Crispin.\" Smaller scritchings across the floor were obscene or devolved into nonsense words.\u003c/p\u003e\n\u003cp\u003eThe place was also surprisingly small, given the size of the ship and the number of cell blocks they‘d come across. Maybe the staff hadn‘t been big on treating prisoners. Just figured they were tough, could take their chances.\u003c/p\u003e\n\u003cp\u003eMacCraw grunted when she slapped a pad of gauze over the gash. It needed stitches, but that would do for now.\u003c/p\u003e\n\u003cp\u003eAs she put away her medic kit, Lopez noticed a detail that suddenly had her full attention.\u003c/p\u003e\n\u003cp\u003e―Singh,\" she said, tilting her head toward the far wall. ―What do you make of that?\" A sealed chamber, without windows or cameras, the seal around the door so subtle she‘d almost missed it. No handle, either.\u003c/p\u003e\n\u003cp\u003eThe technician shouldered his rifle and ran a hand around the seam. ―I‘ve seen these before. The opposite of cells. Safe rooms. You can only open them from the inside.\"\u003c/p\u003e\n\u003cp\u003e―In case the prisoners get out . . .\"\u003c/p\u003e\n\u003cp\u003e―Exactly.\"\u003c/p\u003e\n\u003cp\u003eMacCraw crossed the room—fleeing Mama Lopez‘s tender ministrations—and put an ear against\u003c/p\u003e\n\u003cp\u003ethe surface, like it was a safe he wanted to crack. Now he rapped a knuckle on the door.\u003c/p\u003e\n\u003cp\u003eDa-dada-da-da, da, da.\u003c/p\u003e\n\u003cp\u003e―MacCraw . . .\" A tone she‘d used a thousand times before.\u003c/p\u003e\n\u003cp\u003eBut Singh said, ―No, let him do that again.\"\u003c/p\u003e\n\u003cp\u003eMacCraw obliged.\u003c/p\u003e\n\u003cp\u003eA concealed speaker clicked on, a muffled hiss speckling the silence. Sounding a lot cleaner and more immediate than the static over their radios.\u003c/p\u003e\n\u003cp\u003eLopez grinned at both of them. Good boys. ―Anyone home? This is Sergeant Lopez of the\u003c/p\u003e\n\u003cp\u003eUNSC Red Horse .\" Remembering John Doe, still the only living person from the Mona Lisa she‘d met.\u003c/p\u003e\n\u003cp\u003eOf course, it might be Covie in there.\u003c/p\u003e\n\u003cp\u003eA pause, and then a voice: ―UNSC?\" Male. Nervous. Dry.\u003c/p\u003e\n\u003cp\u003e―The one and only.\" All five of us. At your service. Or not. Depending.\u003c/p\u003e\n\u003cp\u003eShe took a step back and leveled her rifle at the door. Motioned for the others to do the same.\u003c/p\u003e\n\u003cp\u003e―How do I know you‘re really UNSC?\"\u003c/p\u003e\n\u003cp\u003e―You can either take my word for it, or I can prove it to you. One of these is the fun option, but not for you.\"\u003c/p\u003e\n\u003cp\u003eMahmoud and Percy joined the ring, Rakesh keeping an eye on the corridor. Four rifles on the door, just waiting for it to open.\u003c/p\u003e\n\u003cp\u003eSomething like confidence entered the voice: ―I‘d hate to take away your fun . . .\"\u003c/p\u003e\n\u003cp\u003eLopez frowned. She didn‘t find that clever. She‘d been counting her eleven rosary beads nonstop since Ayad, and she wasn‘t taking any chances with the rest of them. Didn‘t care if a party of gung-ho Spartans was behind that door. Well, okay, that’s not true.\u003c/p\u003e\n\u003cp\u003e―You‘ve got ten seconds,\" she called out, ―and then I‘ll huff and I‘ll puff and I‘ll—\"\u003c/p\u003e\n\u003cp\u003eThe door depressed with a sigh, and slid open. In the room beyond, cramped living quarters, one pallet and sink with medical supplies lining cabinets that reached to the ceiling. Across the ceiling lay a schematic of the Mona Lisa , but half of it was dark, the rest flickering.\u003c/p\u003e\n\u003cp\u003eIn the middle of the room, behind the pallet, stood one sweating, thin, sallow man, about five ten, in whites that weren‘t white any more. Brilliant blue eyes. Looked a bit rodent-ish, like he‘d happily gnaw on something, anything, until he‘d chewed it all up. But entirely unharmed. Wearing a stink she recognized as fear, mixed with the usual too-long-without-a-shower reek.\u003c/p\u003e\n\u003cp\u003eHe held a small pistol. Aimed at them. Despite the man‘s poor physical condition, his hands didn‘t shake. His stance reflected military training: two-handed grip, bent slightly at the knees. Unfazed by the firing squad two feet from him.\u003c/p\u003e\n\u003cp\u003e―Drop the weapon.\" Lopez tightened her finger on the trigger.\u003c/p\u003e\n\u003cp\u003eThe man‘s bright gaze darted from Marine to Marine, assessing them, before he reached some\u003c/p\u003e\n\u003cp\u003edecision. He licked his lips like a gecko. Lowered the pistol, transferred it to his left hand, and set it on the floor while raising his right arm as if in a parody of surrender. Stood there, waiting.\u003c/p\u003e\n\u003cp\u003e―Identify yourself,\" Lopez ordered flatly.\u003c/p\u003e\n\u003cp\u003eA relieved smile, although Lopez thought she‘d detected an underlying, undeserved confidence.\u003c/p\u003e\n\u003cp\u003eAlready had a growing sense he was putting on a performance for them.\u003c/p\u003e\n\u003cp\u003e―Doctor John Smith, Chief Medical Officer of the transport ship Mona Lisa .\" When they didn‘t move, he added, hesitantly, ―Er, you can lower your weapons.\"\u003c/p\u003e\n\u003cp\u003eLopez smiled, hoping it came out as grim as Benti claimed. ―John Smith\" her ass. ―You didn‘t offer us ice cream. You didn‘t even say ‗please‘. What‘s in it for us?\"\u003c/p\u003e\n\u003cp\u003e―Ice cream?\" he said, incredulous.\u003c/p\u003e\n\u003cp\u003eSome guffaws from behind her, but Smith looked at them like he‘d entered a room full of crazy people. She could see he wasn‘t someone who liked playing the fool. Resented her already, even if he came off as polite.\u003c/p\u003e\n\u003cp\u003e―Yeah, ice cream.\" Had five dead and wasn‘t above taking it out on a stranger. ―We want ice cream.\"\u003c/p\u003e\n\u003cp\u003eSmith backed away a little, said, unsmiling, ―I‘m not the enemy . . . please?\"\u003c/p\u003e\n\u003cp\u003eLopez lowered her rifle. The others followed her lead. Smith let out that breath he‘d been holding.\u003c/p\u003e\n\u003cp\u003eOkay, fun was over. Time for business.\u003c/p\u003e\n\u003cp\u003e―What happened here?\" she asked. ―How‘d you wind up in that room?\"\u003c/p\u003e\n\u003cp\u003eSmith shrugged, gave a helpless little laugh that still seemed like acting to Lopez. He picked at some dead skin on his left palm with his right hand. Worried at it. ―What do you think happened?\u003c/p\u003e\n\u003cp\u003eShip like this, only one thing ever happens. Prisoners got a chance, rioted, overwhelmed the guards, and took over the ship. I was lucky to be in here when it happened.\"\u003c/p\u003e\n\u003cp\u003e―Lucky,\" she echoed, rolling the word between her teeth. Her own scars were itching. Again. ―\u003c/p\u003e\n\u003cp\u003e‗Prison ship.‘ That‘s the story, huh?\"\u003c/p\u003e\n\u003cp\u003eHe frowned. ―It‘s not a story. The prisoners escaped, took over the ship.\"\u003c/p\u003e\n\u003cp\u003eIt wasn‘t a lie, but it wasn‘t the truth either. This guy was slick. Lopez liked slick as much as she liked mysteries.\u003c/p\u003e\n\u003cp\u003e―You know, you‘re the first person we‘ve found. You might be the only human survivor on this ship.\" Put all the emphasis on human .\u003c/p\u003e\n\u003cp\u003eSmith bared his teeth, neither smile nor grimace. ―The only human—\"\u003c/p\u003e\n\u003cp\u003e―Uh-huh,\" Lopez said, and gave a nod to her Marines. ―Go to it, boys.\"\u003c/p\u003e\n\u003cp\u003eMacCraw and Percy pushed past him to investigate the room, MacCraw giving Smith a good knock with his shoulder. They could smell the bullshit too. Good. Mahmoud collected Smith‘s gun and patted him down roughly, coming up empty.\u003c/p\u003e\n\u003cp\u003e―Policy on the taking of Covenant prisoners change, Smith?\" Lopez asked, prodding. ―I don‘t think we got that memo.\"\u003c/p\u003e\n\u003cp\u003eSmith‘s eyes were slits. ―It wasn‘t a widely circulated memo.\"\u003c/p\u003e\n\u003cp\u003e―No fucking kidding,\" giving herself props for getting him to admit something. More than she‘d gotten out of Rebecca or Foucault.\u003c/p\u003e\n\u003cp\u003eSomething made him change tactics; she didn‘t know what. Saw it in a sudden shift in posture, even.\u003c/p\u003e\n\u003cp\u003e―Look,\" he said. ―I‘m just the medical officer. I don‘t—didn‘t—set policy. I just stitched and bandaged, that‘s all.\"\u003c/p\u003e\n\u003cp\u003ePoor pitiful you.\u003c/p\u003e\n\u003cp\u003e―In this . . . expansive . . . medical bay of yours.\"\u003c/p\u003e\n\u003cp\u003eSmith‘s mouth formed a line like a flat EKG. ―I‘m not here to help any Covenant bastards. Just us.\u003c/p\u003e\n\u003cp\u003eJust us humans.\" Had he rehearsed that, too? Sitting in his sealed room, listening to the screams of people dying? \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-22.html","bookId":1641,"creation":"Oct 5, 2019 9:56:35 PM","modification":"Oct 5, 2019 9:56:35 PM"}
