{"id":98134,"no":36,"title":"Page 36","content":"\u003cp\u003eEXTERNAL CAMERA 6-K, UNSC DESTROYER JERICHO / 0317.235\u003c/p\u003e\n\u003cp\u003eHOURS MARCH 2, 2494 (MILITARY CALENDAR)\u003c/p\u003e\n\u003cp\u003eEighteen Ares missiles streaked silent through space, leaving feathered plumes of gray smoke behind. For twenty seconds they remained on course tracking the Callisto . The enemy vessel moved on a vector directly aligned with an asteroid the size of Manhattan.\u003c/p\u003e\n\u003cp\u003eThe Callisto then rolled, her engine cones flaring white hot, as she executed a slingshot orbit to the far side of the cratered rock.\u003c/p\u003e\n\u003cp\u003eThe missiles split their unified trajectories, each one independently optimizing the best targeting solution, and left eighteen smoky trails that looked like giant fingers reaching out into the dark . . .\u003c/p\u003e\n\u003cp\u003eas if clutching the asteroid.\u003c/p\u003e\n\u003cp\u003eThey never hit.\u003c/p\u003e\n\u003cp\u003eFor the blink of an eye a new sun appeared in the 26 Draconis system.\u003c/p\u003e\n\u003cp\u003eA wash of white filled the screen . . . which coalesced to a boiling center of ultraviolet.\u003c/p\u003e\n\u003cp\u003eA nuclear device had been buried in the asteroid, facing outward. It blasted the rock apart, vaporized and shattered iron and ice, and spewed forth a shower of molten metal and plasma—a tide of destruction that rushed into the UNSC battle group.\u003c/p\u003e\n\u003cp\u003eIt hit the Buenos Aires , which had been leading the charge. Her antennae and MAC trajectory sensors boiled away . . . as the cloud enveloped her in seething energies . . . from which she did not emerge.\u003c/p\u003e\n\u003cp\u003eA chuck of spinning rock hit the Las Vegas —a glancing blow, but enough to crumple her side and bend the ship‘s hull twenty degrees—she careened backward, venting atmosphere from a dozen\u003c/p\u003e\n\u003cp\u003eruptured decks.\u003c/p\u003e\n\u003cp\u003eA cloud of tiny molten fragments hit the Jericho —eventually killing all forward momentum, until she spun slowly backward in space, lights winking on and off.\u003c/p\u003e\n\u003cp\u003eCamera 6-K spun as well—but in the distance still tracked the prow of the Callisto —unscathed as it angled out of the plane of the asteroid field, and turned toward them.\u003c/p\u003e\n\u003cp\u003eA chunk of iron-silicate rock appeared for a split second in the field of view—moving directly into camera 6-K.\u003c/p\u003e\n\u003cp\u003eStatic.\u003c/p\u003e\n\u003cp\u003eEXTERNAL CAMERA 6-K FEED TERMINATED\u003c/p\u003e\n\u003cp\u003e0329 HOURS MARCH 2, 2494 (MILITARY CALENDAR) \\ UNSC\u003c/p\u003e\n\u003cp\u003eDESTROYER LAS VEGAS PATROLLING 26 DRACONIS SYSTEM\u003c/p\u003e\n\u003cp\u003eBRIDGE LOG (PRIMARY, VIDEO, SPATIAL ENHANCEMENTS\u003dTRUE)\u003c/p\u003e\n\u003cp\u003eShards of shatterproof plastic tumbled through the air on the bridge. Captain Lewis, tethered to his chair, hung, arms limp. One emergency light burned and tinged everything bloodred. Commander Rinkishale‘s body twisted at unnatural angles, floating, and in the strange light looked like an insect trapped in amber during its death throes.\u003c/p\u003e\n\u003cp\u003eThe only stations active were nav, comm, and one winking panel on the otherwise static-filled weapons station.\u003c/p\u003e\n\u003cp\u003eSecond Lieutenant Cole remained at his station, belted in to his seat, his legs wrapped around the pedestal for good measure. His hands flew over the nav controls, checking and rechecking.\u003c/p\u003e\n\u003cp\u003e― Buenos Aires destroyed, sir,\" Cole reported, his voice cracking. ―I‘m reading a debris field along her last reported vector. There‘s too much radiation . . . but I think the Jericho has come about to engage the Callisto . Reading multiple missile locks. I‘m not sure from whom.\"\u003c/p\u003e\n\u003cp\u003eSecond Lieutenant Cole waited for his orders.\u003c/p\u003e\n\u003cp\u003eAnd he waited.\u003c/p\u003e\n\u003cp\u003eHe then turned and looked . . . and saw his dead captain and commander . . . and the rest of the motionless bridge crew.\u003c/p\u003e\n\u003cp\u003eHe unbuckled himself and moved to each checking for vitals—finding only Lieutenant Jorgenson still breathing, and quickly tying a tourniquet above her bleeding calf.\u003c/p\u003e\n\u003cp\u003eHe tapped the comm station, cleared his voice, and said, ―Any medical personnel, any fire teams on decks four, five, or six—report to the bridge.\" He looked about once more, taking the carnage in, and then added, ― Any crewmen who can get up here, do so immediately.\"\u003c/p\u003e\n\u003cp\u003eFrom the flickering weapons station a shrill alarm sounded, confirming missile lock on the Las Vegas .\u003c/p\u003e\n\u003cp\u003eCole yelled into the comm, ―All hands brace for impact! All crew brace—\"\u003c/p\u003e\n\u003cp\u003eThe bridge shuddered.\u003c/p\u003e\n\u003cp\u003eFor a split second the air condensed into fog, then explosive decompression blasted out the atmosphere.\u003c/p\u003e\n\u003cp\u003eBRIDGE LOG OF THE UNSC LAS VEGAS (PRIMARY, VIDEO,\u003c/p\u003e\n\u003cp\u003eSPATIAL ENHANCEMENTS \u003d TRUE) / TERMINATED\u003c/p\u003e\n\u003cp\u003e0332.091\u003c/p\u003e\n\u003cp\u003e0348 HOURS MARCH 2, 2494 (MILITARY CALENDAR) \\ UNSC\u003c/p\u003e\n\u003cp\u003eDESTROYER LAS VEGAS PATROLLING 26 DRACONIS SYSTEM\u003c/p\u003e\n\u003cp\u003eCAPTAIN‘S LOG (AUDIO)\u003c/p\u003e\n\u003cp\u003e{TRANSFER CONTROL CODES ENABLED PER MIL JAG\u003cbr\u003e \u003cbr\u003eORDER TR-19428-P}\u003c/p\u003e\n\u003cp\u003eCaptain Lewis and Commander Rinkishale are dead. The rest of the bridge crew are either\u003c/p\u003e\n\u003cp\u003eincapacitated or dead.\u003c/p\u003e\n\u003cp\u003eI, Second Lieutenant Cole, Preston J. (UNSC Service Number: 00814-13094-BQ), do hereby\u003c/p\u003e\n\u003cp\u003eassume command of the UNSC destroyer Las Vegas and responsibility for the actions detailed henceforth .\u003c/p\u003e\n\u003cp\u003eEmergency bulkheads are in place on the bridge and the additional breaches on decks one through eight and eleven through fourteen have been contained. Decks sixteen and seventeen remain\u003c/p\u003e\n\u003cp\u003eevacuated and cannot be repaired.\u003c/p\u003e\n\u003cp\u003eThe Shaw-Fujikawa drive is offline. Primary and secondary reactors are offline. There was a major spike in the primary system. Radiation containment protocols are in effect.\u003c/p\u003e\n\u003cp\u003eWe are dead in space.\u003c/p\u003e\n\u003cp\u003eI have been trained to follow the rules and regulations and enforce our laws.\u003c/p\u003e\n\u003cp\u003eAnd even when I broke those rules—it has been to uphold a higher honor.\u003c/p\u003e\n\u003cp\u003eNow I am faced with a choice: Break those rules, discard honor, or lose. No—this has nothing to do with winning or losing. I must break the rules and my honor or die. Or all the crew will die.\u003c/p\u003e\n\u003cp\u003eWith so many lives at stake, I have no choice.\u003c/p\u003e\n\u003cp\u003eI have ordered our missile silos‘ doors shut.\u003c/p\u003e\n\u003cp\u003eI have signaled our unconditional surrender to the insurgent-controlled ship Callisto and requested immediate aid for our wounded.\u003c/p\u003e\n\u003cp\u003eThey won‘t be able to resist the prize of a UNSC destroyer. They won‘t fire. They‘ll answer the distress signal.\u003c/p\u003e\n\u003cp\u003eEND ENTRY CAPTAIN‘S LOG \\ UNSC LAS VEGAS\u003c/p\u003e\n\u003cp\u003eEXTERNAL CAMERA A-4, UNSC DESTROYER LAS VEGAS \\\u003c/p\u003e\n\u003cp\u003e0406.335 HOURS MARCH 2, 2494 (MILITARY CALENDAR)\u003c/p\u003e\n\u003cp\u003eCallisto’s prow approached the port side of Las Vegas and slowed to a full stop five kilometers away—with her missile silo doors open.\u003c/p\u003e\n\u003cp\u003eAfter three full minutes Callisto moved closer and turned so that the two ships were abeam: Cargo Bay 5 on the port side of the Las Vegas aligned with Cargo Bay 3 on the starboard side of Callisto .\u003c/p\u003e\n\u003cp\u003eRobotic tethers reached from Callisto , groping over the crumpled armor of the Las Vegas , until they found purchase.\u003c/p\u003e\n\u003cp\u003eThe arms pulled the Las Vegas within a few meters. A hard docking collar extended from the Callisto —large enough for three trucks side by side to roll across—and fitted to the side of the Las Vegas .\u003c/p\u003e\n\u003cp\u003eOrange safety lights strobed along the passage as the seal was established, the interior pressure equalized, and the links locked and checked.\u003c/p\u003e\n\u003cp\u003eIncoming comm on alpha channel from Callisto : Las Vegas, prepare to be boarded. Offer no resistance and we will evacuate your injured to Lawrence Space Station. Any tricks and we open fire.\u003c/p\u003e\n\u003cp\u003eComm (alpha channel): This is Las Vegas. Understood. None of my crew will fire.\u003c/p\u003e\n\u003cp\u003eA moment passed and then more strobe lights flickered along the Callisto ‘s flank, indicating her cargo bay doors opening.\u003c/p\u003e\n\u003cp\u003eA second shudder traveled the length of the docking passage—from the Las Vegas into Callisto .\u003c/p\u003e\n\u003cp\u003eOn the port side of Callisto explosions blossomed outward from inside , obliterating her midsection from decks fourteen to three. Armor plates and bodies tumbled into vacuum . . . along with plumes of gray-green reactor coolant.\u003c/p\u003e\n\u003cp\u003eBoth ships spun out of control.\u003c/p\u003e\n\u003cp\u003eThe docking passage between the destroyers strained and twisted—and the connection snapped.\u003c/p\u003e\n\u003cp\u003eAtmosphere continued to pump out of Las Vegas ‘s bay, propelling her farther from the now crippled Callisto .\u003c/p\u003e\n\u003cp\u003eThe armor on the aft quarter of Callisto glowed dull red as her fusion reactor and secondary fission reactor ran rampant and melted.\u003c/p\u003e\n\u003cp\u003eThrusters on the Las Vegas puffed so she matched the pitch and roll of the enemy vessel . . . but turned so her prow faced the enemy‘s obliterated midsection.\u003c/p\u003e\n\u003cp\u003eMissile silo doors on Las Vegas opened.\u003c/p\u003e\n\u003cp\u003eTransmission (alpha channel): This is Las Vegas. You are ordered to immediately seal missile doors and open Security Port 347 and allow our computer to take control of your vessel. Comply—or I will blast your ship in two.\u003c/p\u003e\n\u003cp\u003eANALYSIS\u003c/p\u003e\n\u003cp\u003eThe UNSC was not prepared for brutal ship-to-ship combat in the early years of the insurgency.\u003c/p\u003e\n\u003cp\u003eThe light destroyer class, for example, had none of the armament one recognizes as standard today.\u003c/p\u003e\n\u003cp\u003eThe titanium-A armor and magnetic accelerator cannons, however, would soon be developed as\u003c/p\u003e\n\u003cp\u003eindustrial priorities shifted from building . . . to killing.\u003c/p\u003e\n\u003cp\u003eMore problematic, however, was the application of those new technologies to three-dimensional battles in the vacuum of space.\u003c/p\u003e\n\u003cp\u003eThe use of nuclear weapons in the battle with Callisto was not expected. It was believed that fissile detonations in space were nearly useless. Such detonations are extremely low-yield and produced reduced electromagnetic pulse effect in a vacuum environment (very little bang for the buck, as they say).\u003c/p\u003e\n\u003cp\u003eBut the fact that the insurgency knew this and had planted a nuclear device ahead of time in an asteroid that provided the reactive mass to outright destroy one UNSC ship and cripple two more was an astonishingly forward piece of military thinking.\u003c/p\u003e\n\u003cp\u003eMore amazing, however, was Cole‘s tactical leap of insight. UNSC officers and merchant men of the era had a near-religious reverence for Common Space Law—most especially pertaining to\u003c/p\u003e\n\u003cp\u003erendering aid to vessels in distress. The fact that Cole faked a distress signal to lure his opponent closer was both a stroke of genius and a breach of protocol so severe that UNSC CENTCOM\u003c/p\u003e\n\u003cp\u003edithered over whether to award him the Legion of Honor or have him court-martialed (ultimately, they did neither, to avoid difficult precedent). Cole‘s moral strategy was drawn from centuries of ambiguity in dealing with the idea of ―enemy combatants\" and inhabits a gray legal and ethical area, even in retrospect.\u003c/p\u003e\n\u003cp\u003eEmblematic of Cole‘s later tactical thinking, we see flexibility with regard to his ship‘s functional design. He had crewmen remove Las Vegas ‘s last Ares missile from its silo and transport it to Cargo Bay 5—where it could be fired directly into the enemy vessel at point-blank range, bypassing her external armor, and destroying her FTL drive and reactor coolant systems.\u003c/p\u003e\n\u003cp\u003eCole noted later in his personal log that he would never again be able to send a distress signal in enemy territory. ―No one would believe it,\" he stated. ―Surrender, quite literally, is no longer an option for me.\"\u003c/p\u003e\n\u003cp\u003eThe UNSC, the insurgency—all humanity had been awakened from complacency; we were\u003c/p\u003e\n\u003cp\u003eevolving and learning how to fight again.\u003c/p\u003e\n\u003cp\u003eCole was evolving as well, jettisoning antiquated ethical qualms—and learning to do whatever it took to win. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-36.html","bookId":1641,"creation":"Oct 5, 2019 6:32:09 PM","modification":"Oct 5, 2019 6:32:09 PM"}
