{"id":98135,"no":37,"title":"Page 37","content":"\u003cp\u003eSECTION FIVE: THE OUTER COLONY INSURGENCY: THE\u003c/p\u003e\n\u003cp\u003eGORGON V. THE BELLICOSE (2495–2504)\u003c/p\u003e\n\u003cp\u003eCole was quickly promoted (although not without some protest) to first lieutenant and then commander and given a small corvette to patrol the Outer Colonies. After a dozen successful engagements in five years against insurgent forces and privateer fleets he was promoted to captain and received the honor of commanding the first heavy-destroyer-class vessel armed with a magnetic accelerator cannon (MAC), the UNSC Gorgon.\u003c/p\u003e\n\u003cp\u003eIn Cole’s personal logs he attributes his success more to luck than skill in battle, and he wonders if his rapid promotion was warranted. He also notes that insurgent atrocities may have greased the public relations aspect of his promotions.\u003c/p\u003e\n\u003cp\u003eCole might have sensed part of the truth. The Navy had latched onto him as a figurehead to quell an unease percolating through the Inner Colonies. Many of the Inner Colonies were beginning to wonder if it was just to hold on so tightly to their Outer Colony cousins.\u003c/p\u003e\n\u003cp\u003eEarth needed a hero to distract its populace from an inconvenient moral confusion.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the insurgency had learned how to hide, strategize, and terrorize as well. They had organized (by theft, customization of industrial vehicles, or by wholesale construction of their own ships) a sizable fleet.\u003c/p\u003e\n\u003cp\u003eCole’s record was not without its blemishes. In particular, the UNSC Bellerophon (a frigate captured by the insurgency and renamed the Bellicose ), engaged Cole thrice: escaping twice, and once, fighting him to a draw.\u003c/p\u003e\n\u003cp\u003ePreston Cole’s otherwise impressive military record did not come without a high personal cost.\u003c/p\u003e\n\u003cp\u003ePersonal communique from Cole, Preston J. (UNSC Service\u003c/p\u003e\n\u003cp\u003eNumber: 00814-13094-BQ) to Volkov, Inna (Civilian ID#: 9081-\u003c/p\u003e\n\u003cp\u003e613-7122-P) \\ Routing Trace: UNITY 557 \\ March 9, 2500\u003c/p\u003e\n\u003cp\u003e(Military Calendar)\u003c/p\u003e\n\u003cp\u003eInna,\u003c/p\u003e\n\u003cp\u003eYour last letter caught me by surprise.\u003c/p\u003e\n\u003cp\u003eIs this how you truly feel? After all these years? A divorce?\u003c/p\u003e\n\u003cp\u003eI know your father would never pressure you into leaving me, so I have to assume this is how you feel, or that there is another person involved . . . or that it is somehow my fault.\u003c/p\u003e\n\u003cp\u003eYes. That is it. It is my fault.\u003c/p\u003e\n\u003cp\u003eYou never wanted a long-distance military marriage—and neither one of us expected to endure three extensions of my tour of duty. I cannot imagine how you must feel, so far away, with me in danger, not knowing if your husband will ever come back, and always having to wear a brave face for the military social elite that orbit your family.\u003c/p\u003e\n\u003cp\u003eI wish I could give this up and come home, be a husband for you, and a father for our children who are growing up not even knowing me, apart from the official broadcasts that are sent to Earth.\u003c/p\u003e\n\u003cp\u003eBut the Navy needs me, too. Just by being here, I am saving lives . . . saving us all by stopping these border conflicts from flaring into full civil war.\u003c/p\u003e\n\u003cp\u003eMaybe you don‘t want to understand that, or can‘t. But I do. I have to stay.\u003c/p\u003e\n\u003cp\u003eI will always love you. I will always love the kids.\u003c/p\u003e\n\u003cp\u003ePlease reconsider your decision.\u003c/p\u003e\n\u003cp\u003eI await your final word but I stand by my duty.\u003c/p\u003e\n\u003cp\u003eEver yours,\u003c/p\u003e\n\u003cp\u003ePreston\u003c/p\u003e\n\u003cp\u003e0700 HOURS JUNE 2, 2501 (MILITARY CALENDAR) \\ UNSC\u003c/p\u003e\n\u003cp\u003eDESTROYER GORGON \\ THETA URSAE MAJORIS SYSTEM\u003c/p\u003e\n\u003cp\u003eBRIDGE LOG (PRIMARY, VIDEO, SPATIAL ENHANCEMENTS\u003dTRUE)\u003c/p\u003e\n\u003cp\u003eCaptain Cole did not sit in his padded chair on the raised center of the Gorgon ‘s bridge. Instead, he paced, stopped to glance over the shoulders of his officers at their stations, but otherwise kept moving like a shark.\u003c/p\u003e\n\u003cp\u003eCole‘s temples were tinged gray. Where there had once been laugh lines, crisscrosses of\u003c/p\u003e\n\u003cp\u003econcentration now crinkled his eyes. Other than these telltale signs of strain, however, he was the model of calm and thoughtfulness; confidence emanated from him like a magnetic field.\u003c/p\u003e\n\u003cp\u003eThe UNSC Gorgon had engaged in two battles in the last seventy-two hours—so when it crossed paths with the insurgent-captured Bellerophon , the Gorgon had severely depleted munitions and a weary crew.\u003c/p\u003e\n\u003cp\u003eThey battled the Bellerophon for the previous 34.7 minutes, peppering one another with Archer missiles, and then the Gorgon slung around a planetoid to come around at the proper angle for a killing shot.\u003c/p\u003e\n\u003cp\u003eIt was a ―kill\" shot. There was no other possible outcome.\u003c/p\u003e\n\u003cp\u003eNo ship had yet evaded the new magnetic accelerator cannon, which could accelerate a\u003c/p\u003e\n\u003cp\u003etungsten-alloy slug to a fraction of the speed of light.\u003c/p\u003e\n\u003cp\u003eA shudder ran through the Gorgon and a flash filled the main view screen, a blurred afterimage of glowing metal that faded into the infrared.\u003c/p\u003e\n\u003cp\u003eThe Gorgon ‘s AI, Watchmaker, flickered upon his pedestal, a wizened old man holding a huge pocket timepiece with a dozen arms and dials.\u003c/p\u003e\n\u003cp\u003e―Time on target?\" Cole demanded.\u003c/p\u003e\n\u003cp\u003eWatchmaker‘s eyes riveted upon his clock. ―Six seconds to impact.\"\u003c/p\u003e\n\u003cp\u003eOn the screen the fired MAC slug was visually enhanced so it glowed soft blue—its trajectory a flat line speeding toward the enemy.\u003c/p\u003e\n\u003cp\u003e―She‘s coming about—new course 030 by 090,\" Lieutenant Maliki, at Navigation, said. ―Her\u003c/p\u003e\n\u003cp\u003ereactors are past the red line.\"\u003c/p\u003e\n\u003cp\u003eThe Bellerophon ‘s desperate acceleration to avoid destruction was useless, because for all practical purposes, compared to the MAC round, the ship stood still.\u003c/p\u003e\n\u003cp\u003e―Missile fire detected!\" Lieutenant Betters, at weapons, announced.\u003c/p\u003e\n\u003cp\u003e―Won‘t do them any good,\" Maliki murmured. ―At this extreme range we can pick off their\u003c/p\u003e\n\u003cp\u003emissiles with the Helix system.\"\u003c/p\u003e\n\u003cp\u003eBut the Archer missiles fired from the Bellerophon prematurely detonated—puffs of fire in the vacuum that made a dotted line in space . . . drawn straight from the Bellerophon to the Gorgon .\u003c/p\u003e\n\u003cp\u003eOne distant explosion smeared across the black of space, however, and ever-so-slightly nudged the line representing the multiton ballistic projectile.\u003c/p\u003e\n\u003cp\u003eThe blue line then closed on the silhouette of the Bellerophon . . . overlapped . . . and continued past the frigate.\u003c/p\u003e\n\u003cp\u003e―That‘s not possible!\" Lieutenant Betters said, standing.\u003c/p\u003e\n\u003cp\u003e―It is possible,\" Cole said, ―just not very likely.\"\u003c/p\u003e\n\u003cp\u003e―Ballistic tracking confirms,\" Watchmaker said. ―We missed.\"\u003c/p\u003e\n\u003cp\u003eLieutenant Maliki turned to face the captain. ―They anticipated our firing the MAC, sir? How?\"\u003c/p\u003e\n\u003cp\u003e―A guess,\" Cole replied staring at the view screen. ―An educated guess, though, because we had the right angle on them. Still . . . incredibly lucky.\" Cole frowned. ―And a brilliant defensive use of the last of their missiles.\"\u003c/p\u003e\n\u003cp\u003e―Not at all,\" Watchmaker quipped. ―Those detonations were on a vector traced from the Gorgon to the Bellerophon . A reasonable estimation of the MAC trajectory and a precise gauge of distance.\"\u003c/p\u003e\n\u003cp\u003eHe snapped his watch shut.\u003c/p\u003e\n\u003cp\u003e―They can explain how they know so much about our MAC after we capture them,\" Betters\u003c/p\u003e\n\u003cp\u003eremarked.\u003c/p\u003e\n\u003cp\u003e―And how do you propose we do that?\" Cole asked. ―Status, Lieutenant Maliki?\"\u003c/p\u003e\n\u003cp\u003e―Archer missiles spent, sir,\" Maliki replied. ―Except silo eight, per your standing order. No remaining MAC rounds. We have seven Pelicans on standby. The AAA Helix guns are spun up and hot.\"\u003c/p\u003e\n\u003cp\u003eCole stared at the Bellerophon as the frigate slowly turned away.\u003c/p\u003e\n\u003cp\u003e―Incoming message,\" Watchmaker announced, ―. . . from the ‗ Bellicose.‘ Text only.\"\u003c/p\u003e\n\u003cp\u003e―To my station, Watchmaker.\" Cole settled into the captain‘s chair and turned the view screen so only he could see.\u003c/p\u003e\n\u003cp\u003eBELLICOSE: I HEARD YOU‘VE ALREADY USED YOUR NEW PEASHOOTER\u003c/p\u003e\n\u003cp\u003eTWICE TODAY . S O THAT WAS YOUR THIRD AND LAST ROUND—\u003c/p\u003e\n\u003cp\u003eUNLESS YOU‘RE GOING TO LOAD UP ONE OF YOUR PELICANS IN\u003c/p\u003e\n\u003cp\u003eTHAT CANNON AND FIRE THAT AT ME?\u003c/p\u003e\n\u003cp\u003eCole stabbed his finders into the keyboard, typing back:\u003c/p\u003e\n\u003cp\u003eGORGON: YOU‘RE OUT OF SHOTS, TOO. YOUR MISSILE SILOS ARE\u003c/p\u003e\n\u003cp\u003eEMPTY.\u003c/p\u003e\n\u003cp\u003eBELLICOSE: I INVITE YOU TO TAKE A CLOSER LOOK .\u003c/p\u003e\n\u003cp\u003eCaptain Cole considered a moment and then tapped in ambiguously:\u003c/p\u003e\n\u003cp\u003eGORGON: NOT LIKELY.\u003c/p\u003e\n\u003cp\u003eBELLICOSE: W ELL PLAYED , P RESTON . W E‘RE A GOOD MATCH . I F\u003c/p\u003e\n\u003cp\u003eYOU EVER RETIRE FROM THE UNSC, YOU MIGHT CONSIDER\u003c/p\u003e\n\u003cp\u003eWORKING FOR THE GOOD GUYS .\u003c/p\u003e\n\u003cp\u003eGORGON: PERHAPS YOU‘D LIKE TO COME OVER HERE AND PERSUADE ME?\u003c/p\u003e\n\u003cp\u003eA full fifteen seconds passed without reply, then:\u003c/p\u003e\n\u003cp\u003eBELLICOSE: T EMPTING . B UT ANOTHER TIME , I THINK .\u003c/p\u003e\n\u003cp\u003eGORGON: ILOOK FORWARD TO IT.\u003c/p\u003e\n\u003cp\u003eCole slammed his fist on the arm rest, and yet there was a slight smile on his face.\u003c/p\u003e\n\u003cp\u003eThe Bellerophon continued to turn and her engines flared to life as she moved off.\u003c/p\u003e\n\u003cp\u003e―Sir, we‘re letting them go?\" Lieutenant Betters whispered. ―That‘s the third time that ship has escaped.\"\u003c/p\u003e\n\u003cp\u003e―Three times,\" Cole echoed. ―Yes. But we‘ll cross paths with the Bellerophon —the Bellicose\u003c/p\u003e\n\u003cp\u003e—soon enough. Next time we‘ll be ready for her.\"\u003c/p\u003e\n\u003cp\u003ePersonal letter from Captain Preston Cole to his brother,\u003c/p\u003e\n\u003cp\u003eMichael James Cole, September 4, 2501 (Military Calendar)\u003c/p\u003e\n\u003cp\u003eMichael,\u003c/p\u003e\n\u003cp\u003eWe searched for the Bellicose in five systems, laid ambushes, but have yet to find the vessel. In the meantime, there have been more engagements, with two insurgent corvettes, and one merchant\u003c/p\u003e\n\u003cp\u003eprivateer that ONI no doubt will play up back home as ―significant strategic victories.\"\u003c/p\u003e\n\u003cp\u003eNot a word of that to anyone else, or these letters will end up so redacted they‘ll look like a zebra has thrown up on them. I‘m positive ONI is reading this and watching the family . . . and indulging me in this bit of personal communication.\u003c/p\u003e\n\u003cp\u003eI‘m sure the only reason my letters get to you at all is that we‘re both playing this their way.\u003c/p\u003e\n\u003cp\u003eThis undeclared war has worn on me and my crew. Before I let the Bellicose become my Moby Dick, I‘m putting in to the Lambda Aurigae system on a backwater world called Roost for some long-overdue shore leave.\u003c/p\u003e\n\u003cp\u003eIt‘s nice, like home . . . if there were red sand beaches in Ohio. It might make a decent base of operations for the Gorgon in this sector of the Outer Colonies.\u003c/p\u003e\n\u003cp\u003eI miss the kids and Inna. Still. Sixteen months since the divorce and I think it‘s all a nightmare. The hardest thing is not getting any replies from the kids. I‘ve sent letters, but I think Inna burns them all.\u003c/p\u003e\n\u003cp\u003ePlease try to get them a message: Tell them I love them.\u003c/p\u003e\n\u003cp\u003e—P\u003c/p\u003e\n\u003cp\u003e{Excerpt} Personal letter from Captain Preston Cole\u003c/p\u003e\n\u003cp\u003eto his brother, Michael James Cole, March 12, 2502\u003c/p\u003e\n\u003cp\u003e(Military Calendar)\u003c/p\u003e\n\u003cp\u003eI was talking to Lyra about the Gorgon ‘s fusion reactor. (You remember her? She owns the bar on the beach? Got her PhD in nuclear engineering and moved here to fish and pour drinks? My kind of lady.)\u003c/p\u003e\n\u003cp\u003eDiscussed nothing classified, just the generalities of plasma physics, and she came up with a way to boost our output by at least 5%.\u003c/p\u003e\n\u003cp\u003eI think we‘ve all underestimated what kind of people come out to the Outer Colonies.\u003c/p\u003e\n\u003cp\u003eIf things ever settle down, you and Molly should see for yourselves. I‘m not saying leave the farm—just look.\u003c/p\u003e\n\u003cp\u003e{Excerpt} Personal letter from Captain Preston Cole\u003c/p\u003e\n\u003cp\u003eto his brother, Michael James Cole, May 28, 2502\u003c/p\u003e\n\u003cp\u003e(Military Calendar)\u003c/p\u003e\n\u003cp\u003eThat skirmish at Capella was too damned expensive. Thirty-two men and women lost. After so\u003c/p\u003e\n\u003cp\u003elittle insurgent activity for so long . . . I thought they‘d given up.\u003c/p\u003e\n\u003cp\u003eI‘ve gotten the okay from CENTCOM on Reach for a month of leave for me and the crew. What\u003c/p\u003e\n\u003cp\u003ecould they say? The Gorgon is going to be laid up that long in space dock getting patched up.\u003c/p\u003e\n\u003cp\u003eI‘ll be on Roost. No pressures. Some fishing. Some time with Lyra.\u003c/p\u003e\n\u003cp\u003eA little slice of paradise in all this purgatory.\u003c/p\u003e\n\u003cp\u003ePersonal letter from Captain Preston Cole to his brother,\u003c/p\u003e\n\u003cp\u003eMichael James Cole, November 9, 2502 (Military Calendar)\u003c/p\u003e\n\u003cp\u003eWe got married, Michael. Pictures and video attached.\u003c/p\u003e\n\u003cp\u003eI‘m sorry for the surprise. (Or maybe you‘ve known this was coming for a long time, huh?) It was nothing fancy, just a ceremony on the beach performed by the local pastor.\u003c/p\u003e\n\u003cp\u003eLyra is happy. She‘s pregnant, too.\u003c/p\u003e\n\u003cp\u003eGod, I‘m happy for the first time since I can remember. I feel like I‘ve finally gotten a real second chance out here.\u003c/p\u003e\n\u003cp\u003eEven the insurgency seems to have finally calmed down. There‘ve been just a few policing actions near Theta Ursae Majoris. Maybe this thing is finally coming to an end. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-37.html","bookId":1641,"creation":"Oct 5, 2019 6:32:09 PM","modification":"Oct 5, 2019 6:32:09 PM"}
