{"id":98139,"no":41,"title":"Page 41","content":"\u003cp\u003eUNSC Everest\u003c/p\u003e\n\u003cp\u003ePreston J. Cole\u003c/p\u003e\n\u003cp\u003eCOPY TO: LOGISTICSOFFICE, NAVCOM, REACH.\u003c/p\u003e\n\u003cp\u003eOFFICE OFNAVALINTELLIGENCE, SECTION-III, REACH\u003c/p\u003e\n\u003cp\u003e0915 APRIL 18, 2543 (MILITARY CALENDAR) \\ UNSC CRUISER\u003c/p\u003e\n\u003cp\u003eEVEREST\\ FLAGSHIP BATTLE GROUP INDIA \\ PSI SERPENTIS SYSTEM\u003c/p\u003e\n\u003cp\u003eTHE BATTLE OF PSI SERPENTIS{AI RECREATION BASED ON\u003cbr\u003e \u003cbr\u003eVIDEO, AUDIO, AND SENSOR LOGS—BLACK BOX RECORDERS—AND\u003cbr\u003e \u003cbr\u003eEYEWITNESS ACCOUNTS}\u003c/p\u003e\n\u003cp\u003eWhen Battle Group India transitioned into normal space in the Psi Serpentis System, it was the largest assembly of UNSC forces: thirteen cruisers, twenty-three carriers, seventy-nine destroyers, forty-two frigates, five prowlers—and fifty supply, repair, and rescue vessels (those latter ships remaining in slipstream space for the duration of the engagement).\u003c/p\u003e\n\u003cp\u003eThe wake from the massive transition into normal space sent a ripple outward from the fleet‘s entry point—a distortion across the electromagnetic spectrum that propagated from their location three million kilometers above the planetary plane of Psi Serpentis.\u003c/p\u003e\n\u003cp\u003eIt made auroras sparkle over the nearest three planets. It caused a visible shift in the smoldering red eye of Viperidae, the gas giant with thirteen times the mass of Jupiter (with gravity nearly enough to crush and fuse the hydrogen churning in its atmosphere). . . . and the ripple passed through the massing Covenant ships on the far side of the system.\u003c/p\u003e\n\u003cp\u003eAn unmistakable signal to the enemy.\u003c/p\u003e\n\u003cp\u003eThe Covenant ships appeared on radar like a swarm of sharks in the dark—more than a hundred sleek organic silhouettes registered—CPV destroyers, light cruisers, and the hitherto unseen in battle CCS-class battle cruiser.\u003c/p\u003e\n\u003cp\u003eTheir prows collectively turned toward Battle Group India, lateral plasma lines pulsing and illuminating hulls so it looked as if an entire alien fleet emerged from the shadows by sleight of hand.\u003c/p\u003e\n\u003cp\u003eThe UNSC prowler Wink of an Eye , having been in system for seven days waiting for this moment, moved into its proper position and reappeared, only visible because its active camouflage skin could not keep pace with the churning red and orange surface of Viperidae behind it . . . the prowler sent a radar ping to the UNSC forces to verify its position, and then the Wink flash transitioned into slipstream space to drop guidance beacons.\u003c/p\u003e\n\u003cp\u003eBattle Group India one by one moved into slipstream space, the preliminary Shaw-Fujikawa calculations having been done a week previously by Cole himself.\u003c/p\u003e\n\u003cp\u003eAnd the entire fleet then reappeared two seconds later, one hundred thousand kilometers on the opposite side of Viperidae—positioned so the gas giant blocked the enemy sight line.\u003c/p\u003e\n\u003cp\u003eUNSC FTL technology, however, was not perfect—especially over short intersystem hops near\u003c/p\u003e\n\u003cp\u003egravity wells. A dozen UNSC ships reappeared, scattered from the main group.\u003c/p\u003e\n\u003cp\u003eThe Covenant fleet angled toward the stragglers and accelerated to attack speed.\u003c/p\u003e\n\u003cp\u003eCole‘s fleet split into two wings, both using the gravity of the gas giant to slingshot around either side of the planet—and toward the onrushing enemy armada.\u003c/p\u003e\n\u003cp\u003eIn response, the Covenant fleet also split to track each portion of the UNSC forces on either side of the Viperidae.\u003c/p\u003e\n\u003cp\u003eThe starboard wing of the UNSC fleet, however, shifted its orbital burn—arced up and over the gas giant and angled back to meet the rest of the battle group.\u003c/p\u003e\n\u003cp\u003eEngine cones flaring with the power from overloaded reactors, the human ships reunited and rocketed toward the port-side breach in the Covenant line.\u003c/p\u003e\n\u003cp\u003eA dozen nuclear-tipped Shiva missiles launched, crossed the space between the two converging forces, and detonated harmlessly before reaching a single enemy vessel.\u003c/p\u003e\n\u003cp\u003eBut as the Covenant loosed their plasma charges, the exploding clouds of superheated gas from nuclear detonations scattered the alien weapons, rendering them ineffective.\u003c/p\u003e\n\u003cp\u003eJust as the Covenant fleet came into Battle Group India‘s optimal magnetic accelerator cannon range.\u003c/p\u003e\n\u003cp\u003eA dozen MAC slugs struck the leading Covenant ships—impacts timed microseconds apart as they hammered down energy shields, punched through hulls, penetrated through and through, and sent thirty-seven of the alien CPV-class destroyers careening through space.\u003c/p\u003e\n\u003cp\u003eAs the two forces closed, however, a cloud of nuclear fire no longer protected the UNSC vessels, and plasma lines lanced through the vacuum, tearing into titanium-A armor and breaching reactors.\u003c/p\u003e\n\u003cp\u003eArcher missiles fired at extreme close range to fill the space with flash and detonations, but this did little to stop the enemy.\u003c/p\u003e\n\u003cp\u003eThree human destroyers crashed headlong into a Covenant battle cruiser—their hulls splintered and the entire mass engulfed in a blob of plasma.\u003c/p\u003e\n\u003cp\u003eAs the fleets sped past one another, the UNSC ships fired thrusters, spun about one hundred eighty degrees, and launched Archer missiles to provide cover from the Covenant‘s devastating plasma weaponry.\u003c/p\u003e\n\u003cp\u003eThe Covenant had lost statistically more vessels than was typical in an engagement with the UNSC.\u003c/p\u003e\n\u003cp\u003eTwenty-three alien ships of the line now drifted in space inert or burning from within as their reactors overloaded and vented plasma.\u003c/p\u003e\n\u003cp\u003eBut Battle Group India had lost more than a third of her ships, and nearly every one of those that had survived was now scoured and pitted or had decks breached—\u003c/p\u003e\n\u003cp\u003eWith one noticeable exception: Everest , which had led the charge, emerged unscathed.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the other wing of the Covenant armada that had been outmaneuvered on the first pass came about—spinning in place as the UNSC fleet had done . . . slowing . . . and then pursuing Cole‘s ships.\u003c/p\u003e\n\u003cp\u003eSwarms of Archer missiles fired from Battle Group India. Their MAC systems had yet to recycle for another shot. The UNSC ships scattered, moving apart like an opening blossom—\u003c/p\u003e\n\u003cp\u003e—as the second wave of Covenant vessels opened fire.\u003c/p\u003e\n\u003cp\u003eThe UNSC destroyer Agincourt charged headlong into concentrated streams of incoming plasma lines—sacrificing itself to save her sister ships.\u003c/p\u003e\n\u003cp\u003eAnd still the alien fleet picked off a dozen more human vessels.\u003c/p\u003e\n\u003cp\u003eBoth sides were now scattered across the system. The first Covenant forces to engage, however, caught up with those now in pursuit. The human ships regrouped and changed course back toward the gas giant, accelerating and keeping just out of effective range of the enemy‘s plasma.\u003c/p\u003e\n\u003cp\u003eCole‘s fleet might have escaped, and yet the UNSC ships collectively slowed to allow the Covenant fleet to gain a tiny bit—as both groups of ships sped around Viperidae.\u003c/p\u003e\n\u003cp\u003eThe Covenant armada lost sight of their prey due to the curvature of the gas giant.\u003c/p\u003e\n\u003cp\u003eAs they emerged in hot pursuit of Battle Group India they saw brilliant blue flashes of Cherenkov radiation, the result of multiple slipstream transitions into normal space.\u003c/p\u003e\n\u003cp\u003eA new fleet of human ships appeared, barreling on an interceptor trajectory toward the aliens.\u003c/p\u003e\n\u003cp\u003eFifty-five ships—highly modified older UNSC warships, merchant vessels bristling with missile pods, and entirely new designs that neither human nor Covenant had ever seen before—led by Bellicose plunged into the center of the Covenant fleet and opened fire.\u003c/p\u003e\n\u003cp\u003eMAC slugs tore into the enemy vessels as they accelerated toward one another. Plasma lines\u003c/p\u003e\n\u003cp\u003elaunched—many deflected by the strong magnetic field of the gas giant in proximity. Ships collided and scraped hulls, and a dozen craft from both sides fell into the boiling clouds of Viperidae‘s upper atmosphere and perished.\u003c/p\u003e\n\u003cp\u003eThen the two forces flashed past one another . . . and the Covenant emerged, their forces decimated and wounded . . . less than half the original strength.\u003c/p\u003e\n\u003cp\u003eThe insurgent-led forces had lost one-quarter of their number. They did not turn to fight, however.\u003c/p\u003e\n\u003cp\u003eThey continued on their trajectory out of the Psi Serpentis system where, and with dozens of crackling blue flashes, they transitioned back into slipstream space.\u003c/p\u003e\n\u003cp\u003eCole‘s fleet had altered course into a high parabolic orbit, turning toward the enemy, their collective MAC systems shimmering with superconductive sparks of power—aimed directly at what remained of the Covenant fleet.\u003c/p\u003e\n\u003cp\u003eA mere million kilometers distant, however, space again rippled as new slipspace ruptures appeared . . . three . . . and a dozen . . . a hundred . . . then a fleet of more than two hundred Covenant ships appeared in normal space accelerating toward Viperidae.\u003c/p\u003e\n\u003cp\u003eThe UNSC ships continued a full ten seconds on their current course, firing neither weapons nor engines.\u003c/p\u003e\n\u003cp\u003eCOM traffic from Everest was on a secure and scrambled channel—private, for admirals to captains only—that was then deleted by a viral worm.\u003c/p\u003e\n\u003cp\u003eThe channel closed and the UNSC fleet moved off at flank speed—leaving Everest alone to face the enemy.\u003c/p\u003e\n\u003cp\u003eEverest‘s engines flared and she slipped deeper toward the gas giant. Her MACs powered down and every external light went off. All her missile silo doors, however, opened.\u003c/p\u003e\n\u003cp\u003eThe mass of the fresh Covenant armada turned to pursue the retreating Battle Group India.\u003c/p\u003e\n\u003cp\u003eCOM CHANNEL (BROADBAND ALPHA-THETA) from UNSC Everest : ― Listen to me,\u003c/p\u003e\n\u003cp\u003eCovenant. I am Vice Admiral Preston J. Cole commanding the human flagship, Everest. You claim to be the holy and glorious inheritors of the universe? I spit on your so-called holiness. You dare judge us unfit? After I have personally sent more than three hundred of your vainglorious ships to hell?\u003c/p\u003e\n\u003cp\u003eAfter kicking your collective butts off Harvest—not once—but twice? From where I sit, we are the worthy inheritors. You think otherwise, you can come and try to prove me wrong.”\u003c/p\u003e\n\u003cp\u003eThe Covenant fleet, both damaged vessels and fresh reinforcements, turned to Everest . Some ships rushed toward her position, while others skirted around the Viperidae—cutting off any possible escape vector.\u003c/p\u003e\n\u003cp\u003eEverest tightened its orbit and vanished from view as it moved to the far side of the gas giant.\u003c/p\u003e\n\u003cp\u003eShe did not slingshot out as she had done on previous occasions, but rather emerged again on the near side of Viperidae along the trajectory so low, the cruiser could never recover from the inevitable gravity spiral into the gas giant‘s crushing atmosphere.\u003c/p\u003e\n\u003cp\u003eThe leading Covenant ships fired.\u003c/p\u003e\n\u003cp\u003eA hundred plasma streams lanced toward their target . . . but spiraled about themselves and dissipated in the extreme magnetosphere of the gas giant.\u003c/p\u003e\n\u003cp\u003eLaser fire followed from the Covenant ships, peppering Everest with a thousand smoldering holes.\u003c/p\u003e\n\u003cp\u003eNo atmosphere, though, leaked from the ship, as every outer deck had already been evacuated.\u003c/p\u003e\n\u003cp\u003eCOM CHANNEL (BROADBAND ALPHA-THETA) from UNSC Everest : ― Is that the best you can do? \" Cole laughed. ― Watch what one unworthy human can do! \"\u003c/p\u003e\n\u003cp\u003eEverest launched everything she had.\u003c/p\u003e\n\u003cp\u003eArcher missiles rocketed out of the gravity well of the planet along with a dozen Shiva nuclear warheads—while another hundred Shiva missiles plunged deeper into Viperidae‘s churning clouds.\u003c/p\u003e\n\u003cp\u003eThe gas giant‘s hydrogen-helium atmosphere was so dense, so compressed, that if it had a tiny fraction more mass it would have ignited and become the smallest of brown dwarf stars.\u003c/p\u003e\n\u003cp\u003eThe Archer missiles had no effect on the Covenant shields. They did, however, provided a dazzling display of pyrotechnics: flashes of white and blue and red and obscuring clouds of propellant.\u003c/p\u003e\n\u003cp\u003eThe nukes launched out of the gravity well exploded.\u003c/p\u003e\n\u003cp\u003eThe lead Covenant ship was destroyed—an insignificant loss compared to the two hundred\u003c/p\u003e\n\u003cp\u003eremaining Covenant vessels moving closer, now near enough to punch through the magnetosphere and obliterate Everest.\u003c/p\u003e\n\u003cp\u003eBut the vast majority of the nuclear ordnance had not been aimed at the Covenant—rather, they fell deeper into the atmosphere of Viperidae.\u003c/p\u003e\n\u003cp\u003eAnd detonated.\u003c/p\u003e\n\u003cp\u003eOne hundred dots of light flickered deep within the thick atmosphere, compressing the already superpressurized hydrogen—adding the needed spark of fission that flashed through and around the gas giant‘s surface, sending helixing tentacles of solar plasma about the planet circumference.\u003c/p\u003e\n\u003cp\u003eFor an instant, Viperidae was a star.\u003c/p\u003e\n\u003cp\u003eCountless tons of hydrogen blasted off its outer layers and filled space with plasma—washed away everything with a blaze.\u003c/p\u003e\n\u003cp\u003eThe expanding ball of destruction slowed and dissipated.\u003c/p\u003e\n\u003cp\u003eUntil only a cloud of glowing haze remained . . . and in the center, the dark cinder of Viperidae.\u003c/p\u003e\n\u003cp\u003eEvery ship in the Covenant fleet had been destroyed\u003c/p\u003e\n\u003cp\u003eAs had the UNSC Everest , its crew, and Vice Admiral Preston J. Cole.\u003c/p\u003e\n\u003cp\u003eANALYSIS\u003c/p\u003e\n\u003cp\u003eA day of mourning was proclaimed July 28, 2543. Humanity had lost its supreme hero. There\u003c/p\u003e\n\u003cp\u003ewould be others elevated to this lofty position (most notably, the Spartan-IIs, who had already gone public in 2547), but for many, Preston Cole was the one man who had stood between life and\u003c/p\u003e\n\u003cp\u003eannihilation at the hands of the Covenant.\u003c/p\u003e\n\u003cp\u003eIt was no coincidence that after a brief pause in alien activity in the Outer Colonies, they renewed their efforts, overwhelmed UNSC defenses, and swarmed through the Inner Colonies. Was that\u003c/p\u003e\n\u003cp\u003ebecause Cole was gone? Or had his victory spurred the enemy to redouble their efforts?\u003c/p\u003e\n\u003cp\u003eWhat occurred at Psi Serpentis, while it was investigated, was not forensically examined in exacting detail at the time. The tactics in the battle were consistent with Cole‘s previous behaviors: innovations in FTL jump technology, a sophisticated coordination and maneuvering of multiple ships in formation, gravitationally assisted slingshot to excellent effect, and tricking the enemy into exposing vulnerabilities.\u003c/p\u003e\n\u003cp\u003eAs for the real question, what really happened to Preston Cole, we must examine the available evidence.\u003c/p\u003e\n\u003cp\u003eFirst, the AI recreation of the battle stitched together by ONI Section-III and Section-II was one part scientific analysis and one part propaganda. To be fair, there were many holes in the official record. Speculation and raw glorification of the events were inevitable.\u003c/p\u003e\n\u003cp\u003eLet us consider some anomalies and curiosities.\u003c/p\u003e\n\u003cp\u003eA frame-by-frame analysis of the last moments of Everest captured by external cameras of the withdrawing Battle Group India show the vessel spiraling into the atmosphere of Viperidae just before the detonation of her Archer missiles.\u003c/p\u003e\n\u003cp\u003eTactically those missiles served little, if any, purpose. They could not possibly have penetrated the Covenant shields. So why fire them?\u003c/p\u003e\n\u003cp\u003eHyperfine enhancements of the video make out the characteristic prow of a UNSC super-heavy\u003c/p\u003e\n\u003cp\u003ecruiser silhouetted against the backdrop of the red atmosphere—but also recorded an aura of bright blue light (which most experts assume is the premature detonation of a cluster of Archer missiles).\u003c/p\u003e\n\u003cp\u003eBut most curiously, there appears for a single frame another silhouette behind the Everest : that of a UNSC cruiser.\u003c/p\u003e\n\u003cp\u003eAll UNSC ships, surviving and destroyed, were accounted for in the battle, save Everest and the towed, never-used ―fire ship\" Cole had requested, the cruiser Io .\u003c/p\u003e\n\u003cp\u003eSpectroscopic analysis of the radioactive debris field captured in orbit of Viperidae shows amounts of tungsten-180 consistent with the newly requisitioned and repaired armor of Everest —but it failed to yield the ratio of titanium-50 in the mixture that would have been present had Everest been vaporized.\u003c/p\u003e\n\u003cp\u003eNo black-box recorder was ever found from Everest . While UNSC black-box recorders cannot survive such a nuclear cacophony, standard protocol is for the ship‘s AI to eject at least one of the redundant five black-box recorders if the ship is in imminent danger of destruction.\u003c/p\u003e\n\u003cp\u003eDetailed examination of Cole‘s Shaw-Fujikawa manifold calculation sent to the ONI/Reach\u003c/p\u003e\n\u003cp\u003esuper-AI network for number crunching reveal it to be a theoretical in-atmosphere transition from normal to slipstream space while in a severe acceleration gradient—i.e., identical conditions one might encounter in close proximity to a gas giant.\u003c/p\u003e\n\u003cp\u003eSPECULATION\u003c/p\u003e\n\u003cp\u003eThe Archer missile screen and the anomalous presence of the Io were smoke screen and decoy. Cole initiated a transition to slipstream space the instant before detonation of the Shiva nuclear ordnance and the triggering of the micronova of Viperidae.\u003c/p\u003e\n\u003cp\u003eEverest was not destroyed.\u003c/p\u003e\n\u003cp\u003eCole faked his death and escaped.\u003c/p\u003e\n\u003cp\u003eOne hole in this theory pertains to the crew of Everest . Cole’s massive personnel transfer prior to the battle might have been intended to fill his ranks with those sympathetic to his motives or, at least, those who had unwavering loyalty to him. But he could never have convinced the entire crew of Everest to agree to a wartime desertion. I do not believe Cole could kill his own crew—but perhaps he could keep potential dissenters indefinitely in cryo sleep?\u003c/p\u003e\n\u003cp\u003eAs to Cole’s motivations, that is pure speculation. But the resurfacing of Bellicose and his former lover, Lyra Castilla, point in the right direction—that, and a mental break brought on by years of constant fighting with overwhelming causalities.\u003c/p\u003e\n\u003cp\u003eScattered reports and rumors of independent human forces fighting Covenant pop up on the outer edge of what we believe to be nonsanctioned human colonized space . . . reports that track toward the Sagittarius side of the Orion arm in the Milky Way . . . and then these rumors fade to whispers\u003c/p\u003e\n\u003cp\u003e. . . and legend . . . and then die out all together.\u003c/p\u003e\n\u003cp\u003eSUMMARY CONCLUSIONS\u003c/p\u003e\n\u003cp\u003eIn my best estimation, Cole survived the Battle of Psi Serpentis.\u003c/p\u003e\n\u003cp\u003eHe may be alive and healthy today.\u003c/p\u003e\n\u003cp\u003eBy Earth-normal chronology he would be eighty-two years old, but before the Covenant War he had his liver, heart, and endocrine system replaced with flash-clone parts. Also, so many of his\u003c/p\u003e\n\u003cp\u003e“years” occupied with space travel were filled with periods of cryogenic suspension and minor but additional relativistic effects. Our best guess at Cole’s biological age is sixty.\u003c/p\u003e\n\u003cp\u003eHe is likely leading a band of colonists, insurgents, and UNSC defectors to build a new home far outside UNSC-dominated space. He always wanted a farm on some world where he could look up and not recognize the nighttime stars.\u003c/p\u003e\n\u003cp\u003eI think he did just that.\u003c/p\u003e\n\u003cp\u003eRECOMMENDATION\u003c/p\u003e\n\u003cp\u003eWhile it is remotely possible that my analysis is incorrect (AIs Phoenix and Lackluster have, however, independently corroborated my conclusions within 89.7 percent accuracy), I shall nonetheless give you my informed recommendation on this matter.\u003c/p\u003e\n\u003cp\u003eFor the moment Preston Cole may be living a simple, isolated life—the governor, perhaps, of some unknown provincial farming colony.\u003c/p\u003e\n\u003cp\u003eBut how long will that isolation last, given the highly unstable situation we find ourselves in after the Covenant War? Namely:\u003c/p\u003e\n\u003cp\u003ea. The insurgency may rise again (especially dangerous given the UNSC’s weakened postwar status); and\u003c/p\u003e\n\u003cp\u003eb. The Covenant (to the best of our limited intelligence of their culture) is in utter chaos now that their religious hierarchy has been removed. What they will do with their independent races, or collectively, is anyone’s guess.\u003c/p\u003e\n\u003cp\u003eIt is inevitable that these coming conflicts will spread to a wider region of the galaxy.\u003c/p\u003e\n\u003cp\u003eCole might be found and convinced to fight once more. In addition to possessing great military genius, he would be a natural figurehead for our battered forces to rally behind. Insurgent or Covenant aggressors would think twice before engaging Preston Cole in battle.\u003c/p\u003e\n\u003cp\u003eBut if found, will Cole fight? For us?\u003c/p\u003e\n\u003cp\u003eThere are three possibilities: (1) Cole will see that Earth and all her colonies are in peril and defend them once more. (2) He will fight for humanity . . . but perhaps not on our side. After living for years among former insurgents, he may back those forces should they rise against the UNSC. Or (3) Cole will not fight, having grown too weary to take up arms again, and will flee farther from the conflict.\u003c/p\u003e\n\u003cp\u003eNeither I nor the AIs can hazard a better than even guess as to the probabilities (plus or minus 4.35\u003c/p\u003e\n\u003cp\u003epercent, 4.05 percent, and 4.30 percent respectively).\u003c/p\u003e\n\u003cp\u003eAll that can be said with absolute certainty is that Cole will remain a leader—whether leading his people to safety . . . or back into battle once more.\u003c/p\u003e\n\u003cp\u003eI offer my services, as usual, to pick up Preston Cole’s trail, find him, and attempt to convince him to join our cause.\u003c/p\u003e\n\u003cp\u003eFailing that, if he chooses to side against us . . . well, I leave those unpleasant details to you.\u003c/p\u003e\n\u003cp\u003eI, for one, have lost my stomach for killing legends. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-evolutions-volume-i-halo-0/page-41.html","bookId":1641,"creation":"Oct 5, 2019 6:32:09 PM","modification":"Oct 5, 2019 6:32:09 PM"}
