{"id":77302,"no":17,"title":"Page 17","content":"\u003cp\u003eAnd still, every time he took out his key chain—there it was. He could envision the green door with its brass knob, brass numbers above the mail slot. He could imagine opening that door, calling up the stairwell that he was home.\u003c/p\u003e\n\u003cp\u003eWhat had Hunter said about not trying to salvage the past?\u003c/p\u003e\n\u003cp\u003eHe and Chadwick had walked away from Southeast Asia together with never a flashback. They\u0027d seen children who\u0027d stepped on land mines, shriveled Vietcong body parts strung on jute necklaces like Mexican milagros, dead GIs Huey-ed into base, their bodies cooked from napalm Chadwick\u0027s colleagues had loaded onto planes. None of that affected Chadwick much anymore. None of it gave him the shakes.\u003c/p\u003e\n\u003cp\u003eBut when it came to San Francisco—the house in the Mission—his hands still trembled.\u003c/p\u003e\n\u003cp\u003eHe put his keys back in his pocket, walked down the hall to Olsen\u0027s apartment.\u003c/p\u003e\n\u003cp\u003eHe had to knock several times before she answered.\u003c/p\u003e\n\u003cp\u003eShe stood in the doorway, squinting, the room behind her a yawning darkness that smelled of sleep and rye bagels she\u0027d bought in New York.\u003c/p\u003e\n\u003cp\u003e“Glad you\u0027re up,” Chadwick said. “Can we talk?”\u003c/p\u003e\n\u003cp\u003e“Are you crazy? I just went back to bed.”\u003c/p\u003e\n\u003cp\u003e“Your room or mine?”\u003c/p\u003e\n\u003cp\u003eShe scowled. With her buzz cut, her shapeless fatigues, her harshly plain face, she looked about twelve years old. Chadwick wondered why young women who tried to look butch always ended up looking frail and vulnerable.\u003c/p\u003e\n\u003cp\u003e“Your room,” she decided. “It\u0027s probably cleaner.”\u003c/p\u003e\n\u003cp\u003eThe comment forced Chadwick to think about what his room would look like—and it was clean, but like a hotel room, not a home. He had never asked for new furniture since the early shoestring budget days of Cold Springs. He still had the particleboard desk, the hundred-dollar double bed, the Sears CD player. The corners of the sheets, the clothes on the shelves were folded with military precision, but there was little of personal significance—just a few pictures, and a few essential books. Herodotus. Mark Twain. David McCullough.\u003c/p\u003e\n\u003cp\u003eHe opened the sliding glass door to the porch, let in the smell of cedar, the distant rush of the river.\u003c/p\u003e\n\u003cp\u003eOlsen examined the photos on Chadwick\u0027s writing desk. Her fingers hovered momentarily over the picture of Katherine—a young girl of eight, the summer they\u0027d planted morning glories, her smile wide with amazement, the flowers making a raucously colored arch around her body. Mercifully, Olsen\u0027s fingers moved on. She picked up an old group shot of Chadwick with a bunch of Laurel Heights eighth-graders, all of them in colonial costumes.\u003c/p\u003e\n\u003cp\u003eOlsen looked up at the present-day Chadwick, then back at the photo of him with the powdered wig. “Anybody ever told you—”\u003c/p\u003e\n\u003cp\u003e“Repeatedly,” Chadwick interrupted. “I look like George Washington.”\u003c/p\u003e\n\u003cp\u003eOlsen managed a crooked smile. “And these kids in the picture—”\u003c/p\u003e\n\u003cp\u003e“Students. Former students.”\u003c/p\u003e\n\u003cp\u003e“Why\u0027d you quit?”\u003c/p\u003e\n\u003cp\u003e“My daughter was a student there,” Chadwick said. “She committed suicide.”\u003c/p\u003e\n\u003cp\u003eOlsen\u0027s lips quirked, like she thought he was kidding, and then, when she was sure he wasn\u0027t, she returned the picture to its place, carefully, as if it were a detonator.\u003c/p\u003e\n\u003cp\u003e“Katherine,” she guessed. “What Mallory was talking about that night in the car.”\u003c/p\u003e\n\u003cp\u003e“She took her own life while she was baby-sitting Mallory Zedman, overdosed on heroin while Mallory was watching The Little Mermaid. Mallory was six. We were gone several hours longer than we should\u0027ve been. Mallory put in the call to 911.”\u003c/p\u003e\n\u003cp\u003eOlsen sank into a chair. She rubbed her palms on her cheeks, pushing up the corners of her eyes. “Christ, Chadwick. Okay. Fuck. I feel like a jerk now.”\u003c/p\u003e\n\u003cp\u003e“As you can tell, I\u0027m a lot of fun to be with.”\u003c/p\u003e\n\u003cp\u003e“I\u0027ve been mad at you for a week because you wouldn\u0027t talk to me about the Zedman girl. Wouldn\u0027t explain why you were acting weird. You left me in the car while you talked with her mom.”\u003c/p\u003e\n\u003cp\u003e“So don\u0027t quit escorting. I need your help.”\u003c/p\u003e\n\u003cp\u003eOlsen hunched over, laced her fingers together and stared through them.\u003c/p\u003e\n\u003cp\u003eHer hair gleamed in the light. Her skin had a yellowish hue to it, like half-churned milk. Once during the week, on the flight into La Guardia, a flight attendant had told Olsen, by way of a compliment, that she looked a lot like her father, then gestured at Chadwick. The comment weighed on Chadwick\u0027s heart like lead.\u003c/p\u003e\n\u003cp\u003eHe remembered how many times he\u0027d had to explain that he was Katherine\u0027s father. Yes—her, the Latina child. He\u0027d learned to stare through people\u0027s momentary disbelief, their embarrassment and confusion. He remembered thinking that he would never be able to claim a resemblance to Katherine, so he would have to claim something else about her—common personality, or interests, or career. Someday, he\u0027d thought, after she grew up, people would look at Katherine and think, She\u0027s so much like her father.\u003c/p\u003e\n\u003cp\u003e“I should have told you I was requesting a new assignment,” Olsen decided. “It\u0027s not you, Chadwick. It\u0027s me. I\u0027m not cut out for this work.”\u003c/p\u003e\n\u003cp\u003e“I don\u0027t agree.”\u003c/p\u003e\n\u003cp\u003e“Oh, please. I can\u0027t do what you do—not the direct intervention.”\u003c/p\u003e\n\u003cp\u003e“That\u0027s the job you requested.”\u003c/p\u003e\n\u003cp\u003e“I was unrealistic, okay? I wanted to be the rescuer, the one who whisked kids out of trouble. I thought they\u0027d respond to me because I\u0027d been there. I was wrong.”\u003c/p\u003e\n\u003cp\u003eShe\u0027d been there.\u003c/p\u003e\n\u003cp\u003eChadwick remembered Olsen\u0027s interview, how she\u0027d talked in vague terms about coming from a broken home, how that had gotten her interested in child psychology. Chadwick hadn\u0027t pressed her for details.\u003c/p\u003e\n\u003cp\u003e“You can\u0027t expect the kids to thank you,” he told her. “The more a kid fights, the worse she needs us.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “The things Mallory said to me in the car while you were in the school . . . Not a thing about your daughter. Nothing about that. But vicious things. She reminded me—”\u003c/p\u003e\n\u003cp\u003eOlsen stopped herself.\u003c/p\u003e\n\u003cp\u003eOut the window, a trio of buzzards had gathered over the river, circling for breakfast.\u003c/p\u003e\n\u003cp\u003e“Kids like Mallory,” Chadwick said, “they\u0027ve learned they can make authority figures cave in if they just act outrageous enough. That\u0027s terrifying power for an adolescent. They love it, but they hate it, too. So they keep getting wilder, hoping to find the limits. They need to hit a brick wall—somebody who finally says, ‘This is it. This is where you stop.\u0027 When a kid fights, she\u0027s testing to see if you\u0027re for real. Remember that. Remember you\u0027re basically dealing with a scared child, no matter how big or loud or out of control.”\u003c/p\u003e\n\u003cp\u003eOlsen was staring at the picture of Chadwick in his colonial outfit—the Father of his Country. Chadwick suddenly hated the picture.\u003c/p\u003e\n\u003cp\u003e“Some of those things Mallory told me,” Olsen said, “some of it was about you. You and her mother.”\u003c/p\u003e\n\u003cp\u003eChadwick made a conscious effort to keep his eyes on hers. He knew he should be open with her, like he should\u0027ve stayed on the line with Sergeant Damarodas, like he should\u0027ve confessed his secret to Norma, that cold night, so many years ago, before everything came unraveled.\u003c/p\u003e\n\u003cp\u003eBut it was hard. It was like forcing his hand to touch a hot stove plate.\u003c/p\u003e\n\u003cp\u003e“I need to go back to San Francisco,” he told her. “The boy Race—I need to find him, ask him some questions. I\u0027ll have to do that during the workweek, between escorts. I\u0027d rather have you with me than someone new. You, at least, know some of the background.”\u003c/p\u003e\n\u003cp\u003eOlsen traced her knuckle along the frame of Katherine\u0027s photograph.\u003c/p\u003e\n\u003cp\u003e“That day in Oakland,” she said, “you hesitated long enough for Race Montrose to shoot you. I almost watched you die, Chadwick.”\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t a question, not even an accusation. Just an expression of sadness, of concern, and before he knew it, he was putting his hand to the hot stove plate—telling her a story he\u0027d never shared with Ann, or Norma, or anyone.\u003c/p\u003e\n\u003cp\u003e“In 1973,” he said, “Hunter and I were in the Air Force, stationed in Thailand. We were eighteen years old, security police. Officially, the Vietnam War was over. Officially, none of us were even there. We spent a year in Korat, guarding planes that officially never dropped bombs on anybody.”\u003c/p\u003e\n\u003cp\u003eHe paused. He wasn\u0027t sure why he was telling Olsen this—a woman he\u0027d only known two weeks—but something about her drew it out of him, like snake venom.\u003c/p\u003e\n\u003cp\u003e“Hunter and I were on perimeter duty one night. We\u0027d had an intruder a few nights before—an NVA with a claymore wired to his chest whom we shot fifty yards from the fence—so we were both on edge. We were at the far end of the base, a hundred yards from anything, when this figure rose up from the rice fields only a few feet away, pointing a pistol right at us. I got off one round with my sidearm and Hunter opened up with his M-16 and the guy fell. Only later we found out we\u0027d shot a local villager kid—maybe twelve, thirteen years old. The pistol was a piece of junk, wouldn\u0027t fire even if it had bullets. I don\u0027t know why he did it. Maybe an American had done something to his family. I don\u0027t know what the hell he was thinking. But when they brought his body into base, I could see the .38 hole I put in his chest, just above his heart.”\u003c/p\u003e\n\u003cp\u003eChadwick paused, listening to the rush of river, impossible to separate from the roar of blood in his ears. “I don\u0027t think about that kid often. I\u0027m not saying I could\u0027ve done something differently, or that I haven\u0027t had kids point guns at me in this job since then. But if I hesitated a little in Rockridge . . . now you know.”\u003c/p\u003e\n\u003cp\u003eOlsen\u0027s eyes were molten glass—not yet hardened into anything definite. “Is that why you work with kids?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Because of that boy. Is that why you became a teacher?”\u003c/p\u003e\n\u003cp\u003e“Maybe. Maybe partly.”\u003c/p\u003e\n\u003cp\u003e“The pickup still bothered me, Chadwick, okay? Mallory Zedman bothered me.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t run away from that.”\u003c/p\u003e\n\u003cp\u003e“You don\u0027t understand me.” She stopped, seemed uncomfortable with what she was about to say. “What you do—you go from crisis to crisis. You\u0027re always at the point of intervention. If I kept doing that, moving on from kid to kid, I would be running away. I need resolution—I need to help one kid at a time. That\u0027s why I\u0027ve requested a counseling position. I\u0027ve specifically requested Mallory Zedman.”\u003c/p\u003e\n\u003cp\u003eChadwick felt as if she\u0027d passed her hand through his chest—gently, like a ghost\u0027s hand—and given his heart a squeeze.\u003c/p\u003e\n\u003cp\u003e“You\u0027ll be a good escort,” he managed. “I want to work with you.”\u003c/p\u003e\n\u003cp\u003eOlsen rose.\u003c/p\u003e\n\u003cp\u003e“I think you\u0027re a good person, Chadwick. But I can\u0027t. I\u0027m sorry.”\u003c/p\u003e\n\u003cp\u003eLong after she was gone—after the uncomfortable handshake and the good wishes and the smell of her soap and rye bagels dissipated—Chadwick stared out at the long shadows the morning sun was slicing from the woods, and he felt the full weight of the problem he had willingly hung around his neck—Mallory Zedman.\u003c/p\u003e\n\u003cp\u003eThere was no difference between that name and the .38 Smith \u0026amp; Wesson revolver locked in a case under his bed, the colonial photo on his desk, or the old house key in his pocket. Some things, once they are slipped on your chain, can never be removed.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eMallory dreamed she was six years old, sitting shotgun in the old Toyota, waiting for Katherine.\u003c/p\u003e\n\u003cp\u003eHer teeth chattered. She sat on her hands, pressed her back into the cracked vinyl seat, tucked her chin into her collar, but still the night cold pervaded her clothes—working its way into her jacket, under her T-shirt, slithering against her skin like dry-ice vapor. \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-17.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
