{"id":77306,"no":21,"title":"Page 21","content":"\u003cp\u003e“He did come to the school,” John guessed. “He saw Ann . . . privately?”\u003c/p\u003e\n\u003cp\u003eSome deep instinct warned her not to share what David Kraft had told her—about Ann and Chadwick kissing in the office. As much as the information had angered her, as much as she wished she could commiserate with someone, something in John\u0027s eyes told her that subject was dangerous.\u003c/p\u003e\n\u003cp\u003eShe put her hand lightly on his chest. She thought of how she\u0027d raked Chadwick\u0027s face when she\u0027d seen him, how she\u0027d cried, later, as she scrubbed and scrubbed his blood from underneath her fingernails.\u003c/p\u003e\n\u003cp\u003e“Mallory needed help,” she told John.\u003c/p\u003e\n\u003cp\u003e“Ann took her away from a police investigation. Now they think my daughter murdered that Montrose bitch. I\u0027m going to get custody, Norma. I\u0027m going to take Ann back to court until she hasn\u0027t a dime left to pay any lawyers. You know Mallory will be better off with me, don\u0027t you?”\u003c/p\u003e\n\u003cp\u003e“A minute ago you asked me to tell you if you ever put me in a bind.”\u003c/p\u003e\n\u003cp\u003eHis breath smelled of wine and peppers. In the background, Los Lobos were singing words Norma knew he couldn\u0027t understand—about the power of a gun.\u003c/p\u003e\n\u003cp\u003eHe put his hand on the small of her back, his fingers spreading out to encompass as much of her as he could.\u003c/p\u003e\n\u003cp\u003e“John,” she said.\u003c/p\u003e\n\u003cp\u003e“Why are you punishing yourself, Norma? Why are you still alone, after nine years?”\u003c/p\u003e\n\u003cp\u003eHeat spread out across her rib cage. Not excitement, exactly—more the thrill of skidding on an icy road.\u003c/p\u003e\n\u003cp\u003eHow many times had she wished that Chadwick were more like John? And now here was John, pressed against her—kissing her, his lips burning from Szechwan—and all she could think of was Chadwick, about the ravenous sadness that had made her lash out at him, claw his face, because she needed to be certain he was still real.\u003c/p\u003e\n\u003cp\u003e“Hey,” she murmured. “Knock it off.”\u003c/p\u003e\n\u003cp\u003eJohn ran a finger up her spine, sought her lips again.\u003c/p\u003e\n\u003cp\u003eAll she had to do was pretend—just a little.\u003c/p\u003e\n\u003cp\u003eShe pushed him away. “I\u0027m serious, John. Stop.”\u003c/p\u003e\n\u003cp\u003eHis eyes came back into focus, glowing with anger. Then he stepped back, managed that self-deprecating smile he did so well.\u003c/p\u003e\n\u003cp\u003e“I guess I got a head start on the wine,” he said. “Sorry.”\u003c/p\u003e\n\u003cp\u003e“I think you should leave now.”\u003c/p\u003e\n\u003cp\u003e“Okay. Sure.”\u003c/p\u003e\n\u003cp\u003eHe gathered up his coat, looked at the bottle of wine like he was thinking of taking it, then picked up his briefcase instead. Norma hadn\u0027t noticed the briefcase before. She wondered why he\u0027d brought it to dinner.\u003c/p\u003e\n\u003cp\u003e“I\u0027ll call you,” he said. “I guess you\u0027re busy with the auction.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s next Friday. Yeah.”\u003c/p\u003e\n\u003cp\u003e“If I can help—”\u003c/p\u003e\n\u003cp\u003e“I\u0027ve got it under control.”\u003c/p\u003e\n\u003cp\u003eHe lifted his fingers in an anemic farewell. “It\u0027ll be nine years exactly. Hard to believe.”\u003c/p\u003e\n\u003cp\u003eHe gave her one last smile, as if his reminder hadn\u0027t been calculated to wound her.\u003c/p\u003e\n\u003cp\u003eShe watched the taillights of his BMW disappear down Telegraph Hill. Then she walked to the balcony. A cruise ship was passing under the Golden Gate. Rain pattered on her deck, filling up her empty flower boxes.\u003c/p\u003e\n\u003cp\u003eShe cleared the Chinese food from the table so she wouldn\u0027t have to smell it. She turned off the music, then she went to her home office and stared at the dark computer screen, the empty crib of the fax machine. Everything just the way she left it.\u003c/p\u003e\n\u003cp\u003eLike what— Like John would steal her credit card numbers? Hardly.\u003c/p\u003e\n\u003cp\u003eSo why did his visit tonight bother her so much?\u003c/p\u003e\n\u003cp\u003eHis romantic advance was nothing new. He\u0027d tried that twice before, never so forcefully, but she had to put it in perspective—the guy was lonely. He was dealing with a divorce a lot fresher than hers. She was a safe target. And yes—the anniversary of Katherine\u0027s death was next week. Norma wouldn\u0027t be the only one who\u0027d have trouble dealing with that.\u003c/p\u003e\n\u003cp\u003eJohn understood “no.” Norma could handle him, as long as she was fair. She had to do a better job with that. She had to stop playing games with the guy. Why had she let it go so far?\u003c/p\u003e\n\u003cp\u003eShe took a long shower, and thought she heard John clunking around in the kitchen, but she knew it was her imagination. Then she remembered she hadn\u0027t locked the front door, hadn\u0027t even closed the glass doors to the porch.\u003c/p\u003e\n\u003cp\u003eShe knew there was nothing to be afraid of—this was hardly a high-crime neighborhood. But her heart beat faster anyway. She turned off the shower, heard nothing except the rain.\u003c/p\u003e\n\u003cp\u003eShe pulled on her terry cloth robe.\u003c/p\u003e\n\u003cp\u003eIt was pouring in earnest now—a rare event, especially this time of year. Rain sheeted off the awnings, drummed on the roof.\u003c/p\u003e\n\u003cp\u003eShe stepped into the living room in bare feet, her hair wet and cold on the back of her bare neck, and she saw him—a lean black man silhouetted in the doorway of her deck. No, not a man. A teenager. Norma backed up and seized the phone as the boy came toward her. He was wearing a mud-splattered T-shirt, jeans drenched up to the thighs with water, and a tattered camouflage coat.\u003c/p\u003e\n\u003cp\u003eShe dialed 911.\u003c/p\u003e\n\u003cp\u003e“Ms. Reyes,” the boy said. “Wait!”\u003c/p\u003e\n\u003cp\u003eShe tripped over a chair, backing into the hallway. The emergency number was ringing.\u003c/p\u003e\n\u003cp\u003e“Ms. Reyes,” the boy said. “It\u0027s me.”\u003c/p\u003e\n\u003cp\u003eShe realized she knew those eyes, the red hair, the strange set to his mouth and jaw, as if he\u0027d been pulled lengthwise when he came out of the womb. She heard herself say, “Race?”\u003c/p\u003e\n\u003cp\u003eThe emergency operator was on the line.\u003c/p\u003e\n\u003cp\u003e“Please,” Race said. “Please, just listen.”\u003c/p\u003e\n\u003cp\u003e“911 switchboard,” the operator repeated. “What is the nature of your emergency?”\u003c/p\u003e\n\u003cp\u003eNorma\u0027s fear was turning to anger. How dare Race—of all people.\u003c/p\u003e\n\u003cp\u003eShe said into the phone, “I have an intruder in my house.”\u003c/p\u003e\n\u003cp\u003e“No,” Race said. “No. Listen.”\u003c/p\u003e\n\u003cp\u003eNorma had spent years trying to follow Ann\u0027s advice—trying not to blame this boy for what his family had done. And Race had made it easy for her, most of the time. He seemed to understand her hatred. He countered it with politeness, went out of his way to treat her with respect. The older he got, the more Norma had grown to like him, and she was angry at herself for allowing that to happen.\u003c/p\u003e\n\u003cp\u003eMallory would have been a good kid, would\u0027ve gotten past Katherine\u0027s death, except the Montroses had stayed in their lives, like carbon monoxide, slowly poisoning her.\u003c/p\u003e\n\u003cp\u003eThe Montrose bitch. Had John been so wrong, calling her that?\u003c/p\u003e\n\u003cp\u003eNorma remembered a few months after Katherine\u0027s death, just after Chadwick had left for Texas—Talia Montrose showing up at Laurel Heights in her pink pants and cheap satin blouse and bleached hair, looking like a hooker—her mouth trembling, but her eyes defiant, full of vengeance she had no right to want. She asked for an application for her youngest boy. And four days later, when Ann broke the news to Norma that she was actually accepting the child—Norma exploded. She\u0027d brought up the affair with Chadwick—forced the truth out of Ann. They\u0027d said horrible, hurtful things. Then they didn\u0027t speak for two years.\u003c/p\u003e\n\u003cp\u003eAll of that was the Montroses\u0027 fault, and Race wasn\u0027t any better than the rest. He had brought a gun to school, gotten himself expelled. He\u0027d gotten Mallory involved in drugs, and a murder.\u003c/p\u003e\n\u003cp\u003eWhy would he come here now?\u003c/p\u003e\n\u003cp\u003e“Ma\u0027am?” the operator was saying. “Can you safely exit the house? The police are en route. Is there a window or a door—”\u003c/p\u003e\n\u003cp\u003e“Please, Mrs. Reyes,” Race pleaded. “You got to listen. Please.”\u003c/p\u003e\n\u003cp\u003eThe boy was shivering. He was more frightened than she was. He looked like he hadn\u0027t eaten in a week—his eyes jaundiced, his lips dry and cracked.\u003c/p\u003e\n\u003cp\u003eHer maternal instinct stirred, unwanted, the way it used to when Mallory would come over to escape her parents\u0027 arguments. She would sit at the dining table, right there, and let Norma stroke her hair while she sobbed.\u003c/p\u003e\n\u003cp\u003eNorma took the phone away from her ear, punched the off button.\u003c/p\u003e\n\u003cp\u003e“You had better explain yourself,” she told Race. “What are you doing in my house?”\u003c/p\u003e\n\u003cp\u003eHis chin started quivering. He sat down on the couch, smearing it with mud and leaves, running his fingers through his red hair. “Don\u0027t say I was here. Please—don\u0027t tell anybody. Okay? You have to promise.”\u003c/p\u003e\n\u003cp\u003e“Race, I can\u0027t promise that. The police are looking for you.”\u003c/p\u003e\n\u003cp\u003e“My mother . . .” he said. “She was murdered.”\u003c/p\u003e\n\u003cp\u003eThe words came out like they\u0027d been cut from him, and suddenly Norma remembered her first reaction when she\u0027d heard Talia was dead. She had thought, It serves her right.\u003c/p\u003e\n\u003cp\u003eNow, she realized how heartless that had been, how little Race deserved the pain.\u003c/p\u003e\n\u003cp\u003e“I\u0027m sorry, honey,” she said. “I really am.”\u003c/p\u003e\n\u003cp\u003e“Mallory was with me. My momma—she was . . .” He curled his hands as if trying to grasp the image. “She was stabbed . . .”\u003c/p\u003e\n\u003cp\u003e“Honey,” Norma said. “You need to go to the police.”\u003c/p\u003e\n\u003cp\u003e“No! No police. I know who they\u0027re gonna blame. You got to listen to me. She ain\u0027t going to be satisfied until they\u0027re both dead.”\u003c/p\u003e\n\u003cp\u003e“Who, honey? What are you talking about?”\u003c/p\u003e\n\u003cp\u003eRace swallowed, held out his hand and watched it shake. Norma got the uneasy feeling he had been talking about his dead mother—as if Talia were whispering things in his ear.\u003c/p\u003e\n\u003cp\u003e“The money,” he said. “Check the money, you don\u0027t believe me—”\u003c/p\u003e\n\u003cp\u003eThen he stopped. Norma heard the sirens a half second later, a long way off, but getting closer.\u003c/p\u003e\n\u003cp\u003e“Race,” Norma said. “Stay with me. Talk to them . . .”\u003c/p\u003e\n\u003cp\u003eBut he was out the back door faster than Norma would have believed possible—over the deck railing, the fence, then down the hillside, skidding across the black plastic tarp that was supposed to keep the slope from turning into a mudslide on nights like this. He plunged through a wet clump of manzanitas and disappeared over a ridge that dropped ten, maybe fifteen feet, straight down to Columbus Avenue.\u003c/p\u003e\n\u003cp\u003eWhen Norma turned, she realized the police had been closer than she realized. Red lights pulsed through her windows, casting blood-colored squares onto her ceilings.\u003c/p\u003e\n\u003cp\u003eJohn stopped at the Palace of Fine Arts. He couldn\u0027t face the Golden Gate Bridge traffic yet. He knew Pérez would question him, pester him as soon as he got home—and he wasn\u0027t ready for that.\u003c/p\u003e\n\u003cp\u003eHe paced under the huge dome of the pavilion—the pink Grecian columns lit up for no one, the park desolate and empty, cold rain falling outside.\u003c/p\u003e\n\u003cp\u003eHe set up his laptop on a trash can.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t realize how on edge he was until a vagrant slipped from the shadows, attracted by the glow of the screen, and wheedled, “You got a little extra, mister—”\u003c/p\u003e\n\u003cp\u003eJohn\u0027s .22 was in his hand, the muzzle pushed under the old man\u0027s grimy, bearded nose, John saying, “You want something?”\u003c/p\u003e\n\u003cp\u003e“Whoa!” The bum\u0027s eyes went completely schizoid, skipping right off the top of reality like a river rock. “Whoa, fuck.”\u003c/p\u003e\n\u003cp\u003eHe backed away, white palms melting into the darkness. Not until he was a tiny smudge of shadow on the far side of the lake did he yell, “Happy Thanksgiving, asshole!”\u003c/p\u003e\n\u003cp\u003eJohn expelled a laugh that sounded crazy, even to him. He slipped his gun back into his coat pocket.\u003c/p\u003e\n\u003cp\u003eHe was going to shake to pieces. He was a test plane at the edge of the sound barrier, the bolts of his wings starting to rattle loose.\u003c/p\u003e\n\u003cp\u003eOh, God, Norma. What had he been thinking? \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-21.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
