{"id":77314,"no":30,"title":"Page 30","content":"\u003cp\u003e“No. Not yet.”\u003c/p\u003e\n\u003cp\u003e“Don\u0027t.”\u003c/p\u003e\n\u003cp\u003eJohn looked up. “My daughter. Samuel will kill her.”\u003c/p\u003e\n\u003cp\u003e“Samuel Montrose isn\u0027t the blackmailer. Blackmailer is that asshole Chadwick. You see the look in his eyes when he grabbed you?”\u003c/p\u003e\n\u003cp\u003eIf Pérez hadn\u0027t said it, John might have let the moment pass—he might have let the doubt play in his mind, then evaporate. But Pérez saw it, too.\u003c/p\u003e\n\u003cp\u003eHow could the blackmailer have described Mallory\u0027s day at Cold Springs so well? Why had Chadwick been spared the blackmail letters, and John had not? Most importantly, who knew about that one mistake John had made, nine years ago, that had been the grounds for the blackmail?\u003c/p\u003e\n\u003cp\u003eAs much as the nightmare haunted John, he had always suspected the blackmailer couldn\u0027t be Samuel.\u003c/p\u003e\n\u003cp\u003eIt had to be Chadwick.\u003c/p\u003e\n\u003cp\u003eKatherine\u0027s suicide had derailed Chadwick\u0027s plan to steal Ann from him. Chadwick was left alone, bitter, cut off from his past. Naturally, he would look for someone besides himself to blame, someone to hate. He would look at John, who still had his wife and child, and Chadwick would grow angry. If Chadwick couldn\u0027t be happy, then neither could John. The blackmail had destroyed John\u0027s marriage. Now John was close to losing his daughter. This wasn\u0027t the work of Samuel Montrose. This was the work of an embittered friend, who\u0027d just looked John in the eye and claimed he wanted to help.\u003c/p\u003e\n\u003cp\u003e“Let me take care of this,” Pérez said. “I\u0027ll get your daughter back. I\u0027ll deal with Chadwick. Let me call a compadre of mine.”\u003c/p\u003e\n\u003cp\u003eJohn\u0027s hands trembled. Chadwick—his oldest friend.\u003c/p\u003e\n\u003cp\u003eHis daughter\u0027s life.\u003c/p\u003e\n\u003cp\u003eThe taste in his mouth was like arsenic. His reflection in the yellow plate stared up at him—sour, hard, old. Getting old alone. Without his daughter, or his wife.\u003c/p\u003e\n\u003cp\u003e“What do you need?” John asked Pérez.\u003c/p\u003e\n\u003cp\u003eAnd for the first time that John could ever remember, Pérez smiled.\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eDowntown Oakland steamed with eucalyptus and car exhaust and burning peanut oil from Chinese buffets. On Broadway, Asian women pushed strollers past the vegetable stands. Jackhammers echoed in the canyons between buildings. Businessmen chatted under the red and gold awnings of dim sum restaurants.\u003c/p\u003e\n\u003cp\u003eJones turned on 12th Street and found a nice illegal parking spot by a construction zone, where the plywood walkways were decorated with murals of César Chávez and Malcolm X.\u003c/p\u003e\n\u003cp\u003eThe address for Race\u0027s grandmother was across the street—a ten-story brick building that should\u0027ve been condemned for earthquake safety decades ago. Or maybe it had been condemned. Half the windows were boarded up, the other half open to the air, like cells in a rotten honeycomb.\u003c/p\u003e\n\u003cp\u003e“What\u0027s this kid\u0027s name again?” Jones asked.\u003c/p\u003e\n\u003cp\u003e“Race Montrose.”\u003c/p\u003e\n\u003cp\u003e“And he\u0027s not a pickup.”\u003c/p\u003e\n\u003cp\u003e“Just a kid I need to talk to.”\u003c/p\u003e\n\u003cp\u003eShe chewed her gum, then nodded. “Okay. We\u0027re getting out of the want-to-tell-me phase, into the pretty-much-have-to-tell-me phase. What the fuck\u0027s going on, Chadwick?”\u003c/p\u003e\n\u003cp\u003eHe had been waiting for a confrontation. All the way across the San Rafael Bridge, Jones had been too calm, driving almost like a human being—both hands on the wheel, speedometer not a mile over eighty. She hadn\u0027t even rammed the drivers who cut into her lane.\u003c/p\u003e\n\u003cp\u003e“I\u0027m sorry about what happened in Marin,” he said. “You don\u0027t have to come in this time.”\u003c/p\u003e\n\u003cp\u003e“Aren\u0027t we supposed to be partners?”\u003c/p\u003e\n\u003cp\u003eBehind the horn-rimmed glasses, her eyes were tranquil, almost sleepy. False advertising.\u003c/p\u003e\n\u003cp\u003e“You\u0027re right,” he said.\u003c/p\u003e\n\u003cp\u003eHe told her about Katherine and Samuel Montrose, Mallory and Race, Talia Montrose\u0027s murder. He filled in what she hadn\u0027t heard about the missing millions from Laurel Heights, the fact that Race had tried to warn Norma before it happened.\u003c/p\u003e\n\u003cp\u003eThe information seemed to weigh her down with a heavy, quiet anger that reminded him a lot of Asa Hunter.\u003c/p\u003e\n\u003cp\u003e“You\u0027re telling me somebody who lives here”—she lifted her hand toward the apartment building—“forced your rich friend in Marin to steal twenty-seven million from his ex-wife\u0027s posh school? Do I have that right?”\u003c/p\u003e\n\u003cp\u003e“There\u0027s a connection between the money and the Montroses. Race knows what it is. That\u0027s all I\u0027m saying.”\u003c/p\u003e\n\u003cp\u003e“This boy is black.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Dr. Hunter—he knows you\u0027re doing all this on company time?”\u003c/p\u003e\n\u003cp\u003e“He knows.”\u003c/p\u003e\n\u003cp\u003e“So he figures something doesn\u0027t add up. He\u0027s afraid this Race kid is going to end up in jail for murder and your friend Zedman is going to skate. He\u0027s trying to decide whether or not he wants to protect Mallory.”\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003eJones blew a bubble and bit it. “Day I interviewed? Hunter showed me that girl. She was exhibit A for how to use a straitjacket.”\u003c/p\u003e\n\u003cp\u003e“He showed her to you?”\u003c/p\u003e\n\u003cp\u003e“He was touring me around and shit. Your old partner—tall, blond crewcut—what\u0027s her name—”\u003c/p\u003e\n\u003cp\u003e“Olsen.”\u003c/p\u003e\n\u003cp\u003e“She was there, going down to counsel the girl. Should\u0027ve seen the way Mallory blew up at her. Those two have a history?”\u003c/p\u003e\n\u003cp\u003eHe remembered Olsen and Mallory on the Big Lodge porch, Mallory\u0027s spittle gleaming on Olsen\u0027s shoulder. “No history.”\u003c/p\u003e\n\u003cp\u003eKindra frowned. “The police looking for a murder suspect in the juvenile category, I know who I\u0027d nominate.”\u003c/p\u003e\n\u003cp\u003eA biplane droned overhead, dragging a yellow banner for a local microbrewery. Chadwick thought about the days when he could look up at a small plane and not wonder if it was some kind of threat, some lunatic with a canister of nerve gas. That kind of simplicity seemed as distant as Katherine\u0027s life, as the days he could come to Oakland and not think dark thoughts about the Montrose clan and the part they played in Katherine\u0027s death.\u003c/p\u003e\n\u003cp\u003e“I\u0027m not saying Mallory\u0027s an innocent victim.”\u003c/p\u003e\n\u003cp\u003e“But you\u0027ve got a stake in saving her,” Kindra said, “because of your daughter, right? And you\u0027ve got no reason to help the Montroses.”\u003c/p\u003e\n\u003cp\u003e“I\u0027ll ask Race for the truth, encourage him to talk to the police.”\u003c/p\u003e\n\u003cp\u003e“And if he doesn\u0027t, there\u0027s always the plastic cuffs.”\u003c/p\u003e\n\u003cp\u003eChadwick was silent.\u003c/p\u003e\n\u003cp\u003e“Hunter won\u0027t let you turn him in?”\u003c/p\u003e\n\u003cp\u003e“That\u0027s not why.”\u003c/p\u003e\n\u003cp\u003e“You promised Mallory?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe raised her eyebrows. “Don\u0027t tell me it\u0027s because you don\u0027t trust the police to be fair. I hear that from a white man, my whole world image is going to shatter.”\u003c/p\u003e\n\u003cp\u003e“If I turned Race in, I\u0027d be doing it for the wrong reasons.”\u003c/p\u003e\n\u003cp\u003eThe biplane hummed and tilted and arced away over Lake Merritt.\u003c/p\u003e\n\u003cp\u003eJones opened the car door. Her anger stiffened her movements like chain mail, but she gave him a punch in the leg that might almost have been an apology. “You\u0027re starting to interest me, Chad. Let\u0027s go.”\u003c/p\u003e\n\u003cp\u003eThe building\u0027s doorway was filled with a smelly green mound of blankets that might have contained a human being. Chadwick and Jones stepped over it and began climbing the dark stairwell.\u003c/p\u003e\n\u003cp\u003e“How do you know where we\u0027re going?” Kindra asked.\u003c/p\u003e\n\u003cp\u003e“Mallory said fifth floor.”\u003c/p\u003e\n\u003cp\u003e“The cops so hot to find this kid, how come they\u0027re not staking this place out?”\u003c/p\u003e\n\u003cp\u003eChadwick had wondered about that. As shorthanded as all police departments were, especially when it came to tracking juvenile offenders, he had half expected to see some surveillance on the street. Maybe they were too late. Maybe Sergeant Damarodas had already apprehended the boy.\u003c/p\u003e\n\u003cp\u003eOut every broken window on the fifth-floor hallway was a million-dollar view—afternoon light on the water, patina hills rimming the horizon, wind sweeping white sails across the Bay. Inside, the scene was twenty-first-century dungeon—peeling wallpaper and crumbling brick, carpet worn down to fungus patches on an otherwise bare concrete floor.\u003c/p\u003e\n\u003cp\u003eThey walked to the only visible door—a cheap sheet of particleboard, Motown music seeping from the uneven crack at the bottom.\u003c/p\u003e\n\u003cp\u003eChadwick knocked. Then again, more loudly.\u003c/p\u003e\n\u003cp\u003eA black woman in her sixties opened up. She was short and pudgy, but she had Race Montrose\u0027s luminous eyes, his delicate mouth. Her hair was permed and gelled into a ginger-colored hydra, pieces of aluminum foil stuck in the curls. In her grimy pink sweat suit, she looked like she\u0027d just run from a burning beauty salon.\u003c/p\u003e\n\u003cp\u003e“Mrs. Ella Montrose?” Chadwick asked.\u003c/p\u003e\n\u003cp\u003e“You that man,” she said.\u003c/p\u003e\n\u003cp\u003e“Ma\u0027am?”\u003c/p\u003e\n\u003cp\u003e“One with the stick. Big stick.” She showed him the length of the imaginary implement with her hands, glared at him like she was making the most reasonable accusation in the world.\u003c/p\u003e\n\u003cp\u003eThen the smell hit him—rum fumes rippling off the old woman as thick as gas station air.\u003c/p\u003e\n\u003cp\u003e“My name\u0027s Chadwick,” he said. “This is Ms. Jones. We\u0027re looking for Race.”\u003c/p\u003e\n\u003cp\u003eThe old woman jabbed a fat knuckle at Kindra. “You that girl, too. What you mean, bringing a big pet like this inside, where people live? Ain\u0027t I tole you before?”\u003c/p\u003e\n\u003cp\u003eJones pointed at Chadwick. “This pet here? Yes, ma\u0027am—he\u0027s mostly housebroken. You know where Race is at?”\u003c/p\u003e\n\u003cp\u003eElla Montrose raised her hands in front of her face and pushed the air away. “No, no. NO GODDAMN DEALIN\u0027 in my home. I\u0027m a CHRISTIAN woman!”\u003c/p\u003e\n\u003cp\u003eShe started to close the door, but Chadwick pressed his palm against it. “Ma\u0027am, Race is in trouble. We need to talk to him.”\u003c/p\u003e\n\u003cp\u003eHer murderous look reminded Chadwick of Samuel, that night nine years ago at the Oakland juvenile detention center. But whatever circuitry once connected Ella Montrose\u0027s brain to her face had long ago melted. On Ella Montrose, a scowl held no more menace than the eyes on a moth\u0027s wings.\u003c/p\u003e\n\u003cp\u003e“You two ain\u0027t real,” she told him. “I reach in the photo book and pull you out. Just like my Talia.”\u003c/p\u003e\n\u003cp\u003e“Ma\u0027am,” Chadwick persisted. “Is Race here?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m not going to no home. I\u0027m not crazy.”\u003c/p\u003e\n\u003cp\u003e“It\u0027s about Mallory Zedman.”\u003c/p\u003e\n\u003cp\u003eThe name seemed to set off a ripple in Ella Montrose\u0027s facial muscles. “Seen too much when he was small, that boy. You stay away from him, you hear? Go back in the picture book.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Jones said. She dug a twenty out of her pocket, held it up between two fingers, then spoke slowly and clearly, as if to a child, “How about you go down to the Jiffy Liquor, buy yourself some lunch, okay?”\u003c/p\u003e\n\u003cp\u003e“Ms. Jones—”\u003c/p\u003e\n\u003cp\u003eChadwick\u0027s reprimand was cut short by a young man\u0027s voice, coming from somewhere deep inside the apartment. “Nana?”\u003c/p\u003e\n\u003cp\u003eElla Montrose licked her lips. “He kill you, I let you in. You got to go back into the pictures, okay?”\u003c/p\u003e\n\u003cp\u003e“Take a walk, Nana,” Jones suggested gently. “Get you some Bacardi.”\u003c/p\u003e\n\u003cp\u003e“Christian woman,” Mrs. Montrose mumbled. “Girl got no business—a pet that size.”\u003c/p\u003e\n\u003cp\u003eShe snatched the twenty, pushed past Chadwick into the hallway, and made for the stairwell. The aluminum foil in her hair glinted as she passed the empty windows.\u003c/p\u003e\n\u003cp\u003eChadwick looked at Jones. “In the future, no bribery. That woman is ill.”\u003c/p\u003e\n\u003cp\u003e“So now she\u0027s ill and twenty dollars richer. We going in or not?” Her voice was harsh and brittle, as if the old lady had unnerved her more than she cared to let on. She held the door for Chadwick.\u003c/p\u003e\n\u003cp\u003eOn the other side was no apartment—just an enormous loft space, vast open floor and ceiling supported by white concrete columns, huge windows pouring in light. A living room area had been set up in one corner, a bedroom in another, so it looked like a third-rate furniture showroom rather than a place someone would live. Cheap jasmine incense burned somewhere. A boom box played “Mustang Sally.” Strung between two columns was a water-stained pink sheet; behind it, Chadwick could see the lanky silhouette of Race Montrose getting dressed. \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-30.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
