{"id":77324,"no":40,"title":"Page 40","content":"\u003cp\u003e“Race saw this happen?”\u003c/p\u003e\n\u003cp\u003e“Nobody saw him. They start arguing, and the first guy pulls a gun, but he never gets to use it. The other guys shoot him three, maybe four times. They wrap the body in an old piece of canvas and drag it away somewhere—maybe to their car. Race didn\u0027t see. He never said anything to anybody. He was scared the killers would come back and get him. He made me promise not to tell.” She looked up, her eyes defiant. “I think he was talking about Samuel. Race watched his own brother get killed.”\u003c/p\u003e\n\u003cp\u003eSilence except for the river; Leyland\u0027s voice at the other end of the clearing, telling one of the black levels how to insulate with moss.\u003c/p\u003e\n\u003cp\u003e“What about Race\u0027s other brothers?” Chadwick asked.\u003c/p\u003e\n\u003cp\u003e“No way,” Mallory said. “He\u0027s only got two others—twins, go by initials, like TJ and JT or ET and TE or something. They\u0027re in jail—armed robbery, I think. Been there for years.”\u003c/p\u003e\n\u003cp\u003eChadwick thought about what Norma had told him, Race\u0027s comment that the person to be afraid of was a she. “Any sisters?”\u003c/p\u003e\n\u003cp\u003e“One that I know—name\u0027s Doreen. I\u0027ve met her. If you\u0027re thinking she\u0027s dangerous, you\u0027re crazy. She\u0027s like a year older than me and stupid as dirt. Lives in L.A. She\u0027s eight months pregnant.”\u003c/p\u003e\n\u003cp\u003e“That leaves Race.”\u003c/p\u003e\n\u003cp\u003e“Race wouldn\u0027t hurt my family. He wouldn\u0027t hurt my father.”\u003c/p\u003e\n\u003cp\u003e“Mallory, there was a video playing in your father\u0027s bedroom last night. The Little Mermaid.”\u003c/p\u003e\n\u003cp\u003eThe meaning of his words seemed to sink in slowly. Her hand crept up to her throat.\u003c/p\u003e\n\u003cp\u003e“Did you tell Race about that video?” Chadwick asked. “Could he have told someone else?”\u003c/p\u003e\n\u003cp\u003eA tiny orange butterfly cartwheeled across her face, then floated toward the boulders. Mallory didn\u0027t even blink.\u003c/p\u003e\n\u003cp\u003e“Mr. Chadwick,” Olsen intervened. “I think that\u0027s enough questions.”\u003c/p\u003e\n\u003cp\u003eShe tried to put her hand on the girl\u0027s shoulder, but Mallory pushed it away.\u003c/p\u003e\n\u003cp\u003e“You don\u0027t know everything,” Mallory said, her voice trembling. “None of you do. I was with Katherine the night she died. I know what happened. I swear to God, if my father is hurt . . .”\u003c/p\u003e\n\u003cp\u003eChadwick waited. He felt as if the last decade of his life were being compressed into this moment—the sunset streaming into the woods; the cold thickening in the air; the black levels rustling in the clearing; and Olsen and Kindra Jones standing next to him.\u003c/p\u003e\n\u003cp\u003eThen the wind changed. He tensed, the hairs on his neck suddenly standing on end.\u003c/p\u003e\n\u003cp\u003e“What?” Kindra asked, bewildered.\u003c/p\u003e\n\u003cp\u003eThe loud SNAP echoed off the rocks, like a tree branch cracking.\u003c/p\u003e\n\u003cp\u003eBlack levels stopped working, puzzled faces turning toward the rocks—toward Chadwick.\u003c/p\u003e\n\u003cp\u003eAnother frozen heartbeat, then he yelled, “Get down!”\u003c/p\u003e\n\u003cp\u003eHe bowled into Mallory, crushing her against the side of the boulder as a second SNAP threw a spray of gravel into the air where Chadwick had been standing.\u003c/p\u003e\n\u003cp\u003e“What is it?” Mallory screamed.\u003c/p\u003e\n\u003cp\u003e“Quiet,” Chadwick ordered. “Don\u0027t move.”\u003c/p\u003e\n\u003cp\u003eIn the clearing, kids were screaming. Leyland was barking orders, repeating Chadwick\u0027s command to get down. Kindra had scrambled behind a tree, pulling one of the black levels to the ground beside her.\u003c/p\u003e\n\u003cp\u003eChadwick pushed Mallory further against the base of the boulder. Olsen crouched nearby, also trying to become one with the rock.\u003c/p\u003e\n\u003cp\u003e“Stay with Mallory,” he ordered.\u003c/p\u003e\n\u003cp\u003e“Where—”\u003c/p\u003e\n\u003cp\u003e“Just do it.”\u003c/p\u003e\n\u003cp\u003eChadwick pulled Mallory\u0027s knife out of her leg sheath, rose to a crouch. He felt his pockets and realized he\u0027d left his cell phone back at the lodge, two miles away.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eHe looked around the clearing. The young counselor, Baines, was thirty yards out, crouching behind a rock that provided him absolutely no cover. Baines was hugging the med pack—which meant he had the emergency phone, the group\u0027s only contact with the outside world.\u003c/p\u003e\n\u003cp\u003eChadwick snapped his fingers, then put his hand to his ear, miming a phone. Baines just stared at him, pleading silently.\u003c/p\u003e\n\u003cp\u003eThe young man, Chadwick realized, was in shock.\u003c/p\u003e\n\u003cp\u003eYes, idiot, it\u0027s a gun. Someone is sniping at us.\u003c/p\u003e\n\u003cp\u003eChadwick caught Kindra\u0027s eyes, gestured toward Baines, then made 9–1–1 with his fingers.\u003c/p\u003e\n\u003cp\u003eShe understood immediately, started crawling in Baines\u0027 direction.\u003c/p\u003e\n\u003cp\u003eGood girl.\u003c/p\u003e\n\u003cp\u003eAnother shot rang out, and down in the clearing, a small rock exploded into a dust cloud.\u003c/p\u003e\n\u003cp\u003eThe sniper was on top of the boulder pile, about twenty feet above Chadwick\u0027s head.\u003c/p\u003e\n\u003cp\u003eKindra got to the med pack, pulled Baines into better cover, began to search for the phone. In another fifteen minutes, they might expect some help—too late for any of them.\u003c/p\u003e\n\u003cp\u003eA fourth shot.\u003c/p\u003e\n\u003cp\u003eWhimpering, one of the black levels huddled farther into her newly made lean-to, as if the branches would hide her from bullets.\u003c/p\u003e\n\u003cp\u003eBile rose in Chadwick\u0027s throat.\u003c/p\u003e\n\u003cp\u003eThe sniper was using a high-powered rifle. He had picked his location perfectly, made sure the sun was at his back, in the target\u0027s eyes. And he was shooting at Chadwick\u0027s kids.\u003c/p\u003e\n\u003cp\u003eChadwick gripped the hunting knife, made sure Olsen was still on Mallory, then worked his way around the boulder.\u003c/p\u003e\n\u003cp\u003eAnother shot, and a black level yelped—a boy\u0027s voice, crying out in pain. Chadwick\u0027s stomach turned to a lump of hot coal.\u003c/p\u003e\n\u003cp\u003eHe leapt from one rock to the next, keeping low, moving in the direction of the firing. Behind him, Leyland\u0027s voice barked, “Baines, med kit, goddamn it!”\u003c/p\u003e\n\u003cp\u003eChadwick couldn\u0027t hear Kindra talking on the cell phone. He could only hope that was happening.\u003c/p\u003e\n\u003cp\u003eFinally, he\u0027d circled enough so that the sun was at his back. He felt soundless, an enormous, silent shadow in the dying light.\u003c/p\u003e\n\u003cp\u003eHe glimpsed the shooter—a camouflaged leg first, then a boot. He made out the shape of the man lying half hidden in a clump of grass atop the limestone ridge, the ideal vantage point over the entire riverfront. The sniper wore a ski mask. His rifle was scoped. Three clips of ammunition lay at his side. He could shoot any of them. They should\u0027ve all been dead.\u003c/p\u003e\n\u003cp\u003eThe man fired again into the clearing.\u003c/p\u003e\n\u003cp\u003eChadwick reached for his knife. Twenty yards, over gravel and leaves and open ground. He weighed his options, remembering his combat training—hating that he knew exactly what must be done.\u003c/p\u003e\n\u003cp\u003eThe shooter sensed his presence just as Chadwick gripped the knife by the point. The rifle barrel swung toward Chadwick, but the knife was already flashing, impaling itself in the man\u0027s abdomen. The man\u0027s gun discharged into the air, as Chadwick moved in with the speed of a truck.\u003c/p\u003e\n\u003cp\u003eThe sniper tried to stand, but Chadwick ripped his gun away from him, kicked him in the face and sent him toppling over the ridge, onto a boulder below, from which he rolled out of sight. The rifle was now in Chadwick\u0027s hand. A streak of the shooter\u0027s blood stained his pants.\u003c/p\u003e\n\u003cp\u003eChadwick scrambled down the side of the hill—his heart hammering, his breathing rasping loud in his ears.\u003c/p\u003e\n\u003cp\u003eBlack levels were starting to come out of hiding, despite Leyland\u0027s commands to keep down. Kindra Jones held the phone, staring wide-eyed in disbelief at the thing that had fallen into their midst, but when she saw Chadwick she managed to say, “State troopers. On the way.”\u003c/p\u003e\n\u003cp\u003eThe sniper was crumpled on a ledge of limestone like an altar. He was making wet noises as he clawed for the knife in his side. Chadwick looked down into the glazed brown eyes behind the ski mask. The sniper\u0027s arms were exposed—Latino skin, the edge of a tattoo on one forearm.\u003c/p\u003e\n\u003cp\u003ePérez, Chadwick thought.\u003c/p\u003e\n\u003cp\u003eHis vision went black.\u003c/p\u003e\n\u003cp\u003eHe clamped one hand around the sniper\u0027s shirt, dragging him off the ledge, slamming him into the trunk of a tree. The man screamed, began pleading in rapid Spanish that Chadwick couldn\u0027t understand. He didn\u0027t want to understand.\u003c/p\u003e\n\u003cp\u003eLeyland was next to Chadwick, trying to pull him off. “Hey, man, wait—”\u003c/p\u003e\n\u003cp\u003eBut not even Leyland had the strength to stop him.\u003c/p\u003e\n\u003cp\u003eChadwick tore off the mask.\u003c/p\u003e\n\u003cp\u003eThe sniper was not Pérez. It was no one Chadwick knew. He was young—maybe thirty, Hispanic, with the build and haircut and hardened face of an enlisted grunt. His eyes were glazed with pain, the knife still buried in his abdomen.\u003c/p\u003e\n\u003cp\u003eChadwick held the man against the tree, staring at his face until Olsen snarled, “Chadwick—for Christ\u0027s sake. I need your help. Smart is wounded.”\u003c/p\u003e\n\u003cp\u003eChadwick paused, then dropped the sniper. The man crumpled into a ball at the base of the tree and curled over to shelter the knife, as if anxious that no one should take it from him. There was blood—a lot of blood.\u003c/p\u003e\n\u003cp\u003eThe boy named Smart lay on the ground nearby, two other Black Level kids hovering over him, Olsen putting pressure on his arm to stop the bleeding.\u003c/p\u003e\n\u003cp\u003eChadwick yelled at Baines for the med pack, then ordered Leyland to watch the sniper, though it was obvious the man wasn\u0027t going anywhere.\u003c/p\u003e\n\u003cp\u003e“He shot me.” Smart was trembling. “He shot me.”\u003c/p\u003e\n\u003cp\u003e“Take it easy, son,” Chadwick told him. “You\u0027re going to be fine.”\u003c/p\u003e\n\u003cp\u003eChadwick worked quickly, automatically. The wound was not bad—a small rivulet carved into the skin by the bullet\u0027s path. The high velocity of the weapon had helped, reducing the amount of damage.\u003c/p\u003e\n\u003cp\u003eBy the time Chadwick had dressed the wound, Smart was actually smiling weakly at the humor the other black levels were throwing out. Smart-Mouth was going to be okay. The kid was tough. He was going to have a nice scar to show the girls back in Des Moines.\u003c/p\u003e\n\u003cp\u003eSirens wailed in the distance.\u003c/p\u003e\n\u003cp\u003eChadwick felt Leyland tug his sleeve, stepped aside to let Leyland take over. He walked back toward the sniper, only to find Olsen kneeling over the man. Seeing Olsen\u0027s eyes, Chadwick wondered if she would go into shock before the sniper did.\u003c/p\u003e\n\u003cp\u003e“He\u0027s going to die,” she said.\u003c/p\u003e\n\u003cp\u003e“No, he won\u0027t,” Chadwick promised, but when he looked down at the young sniper\u0027s pallid face, he was not at all sure about that.\u003c/p\u003e\n\u003cp\u003eThe state troopers arrived, then a fire truck from Fredericksburg. While they waited for the ambulance for Smart, and the firefighters tended to the sniper, a state trooper finally asked the obvious question—a question that rage and shock and concern for Smart had completely driven from Chadwick\u0027s mind.\u003c/p\u003e\n\u003cp\u003e“Is everyone accounted for?”\u003c/p\u003e\n\u003cp\u003eLeyland started to say yes, but Chadwick put the back of his hand on the instructor\u0027s chest. A feeling like an ice pick cut through him, and he finally realized what had just happened.\u003c/p\u003e\n\u003cp\u003e“Everyone is not all right,” he said. “We have one missing.”\u003c/p\u003e\n\u003cp\u003eMallory Zedman was gone.\u003c/p\u003e\n\u003cp\u003e22\u003c/p\u003e\n\u003cp\u003e“Get down here,” Chadwick said into the phone. “Now.”\u003c/p\u003e\n\u003cp\u003e“I can\u0027t . . . what time is it?” Ann Zedman sounded bewildered. “Chadwick, I can\u0027t. I have a meeting with my lawyer at eight in the morning. This time tomorrow night I could be in jail.”\u003c/p\u003e\n\u003cp\u003e“Maybe you didn\u0027t hear me,” he said. “Mallory\u0027s gone. A man came after her with a high-powered rifle.”\u003c/p\u003e\n\u003cp\u003e“Stop,” she pleaded. “Please—I can\u0027t be more worried than I already am. But if I leave town, I\u0027ll only make things worse.”\u003c/p\u003e\n\u003cp\u003e“I may have killed a man tonight, Ann.”\u003c/p\u003e\n\u003cp\u003eIn the night sky, the Milky Way shimmered like frost. Chadwick wished he could shut down the lights of the Big Lodge, turn off the flashing police car lights at the front gate. He wished he could send inside the counselors and white levels who stood milling around, shivering in their nightclothes, hungry for news. He wanted to be alone with Ann\u0027s voice and the stars. \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-40.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
