{"id":77326,"no":42,"title":"Page 42","content":"\u003cp\u003eChadwick hesitated, then took Mallory\u0027s compass from Hunter\u0027s outstretched hand. He went to find Kindra Jones and—for the first time in many years—to load his .38 service revolver.\u003c/p\u003e\n\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003eIn the wee hours of morning, the little town of Fredericksburg pretty much shut down.\u003c/p\u003e\n\u003cp\u003eA single lonely street lamp burned in front of City Hall. Banners for an art and wine festival sagged over the intersections, and the darkened limestone storefronts made the shopping district look almost like the city fathers wanted it to—a quaint Old West village. Main Street was a pastiche of white picket fences and barbed wire, grapevine arbors and prickly pear cactus, rose gardens and restored log cabins, B\u0026amp;Bs and Mexican restaurants—the Western and German and South-of-the-Border influences all wrestling for the soul of the town, and all of them losing to the tourists.\u003c/p\u003e\n\u003cp\u003eAt three A.M., Chadwick was parked on the north end of Milam, the heat from his car hood shimmering in the cold. He was staring at the lighted cross on the hilltop just outside of town, wondering if it had been put there as a personal insult to those who had lost their faith.\u003c/p\u003e\n\u003cp\u003eKindra Jones came out of the motel office across the street and walked to the car.\u003c/p\u003e\n\u003cp\u003e“Nothing,” she reported. “You?”\u003c/p\u003e\n\u003cp\u003eChadwick shook his head. He handed her a cup of truck stop coffee.\u003c/p\u003e\n\u003cp\u003eChadwick\u0027s belief in his own strategy was unraveling. He\u0027d been operating on the best-case scenario—that Mallory had run when the shooting started, somehow evaded Pérez, and managed to hitch a ride at the road. He assumed a local would not have picked her up, knowing as they did the nature of Cold Springs kids and being familiar with their black uniforms. A trucker might have stopped, but few used that road except for local deliveries, which meant they would\u0027ve pulled in somewhere close by for the night. Either way, Chadwick was assuming that Mallory would\u0027ve gotten away from her driver at the first opportunity. That made Fredericksburg, or some hamlet around there, the logical place to search.\u003c/p\u003e\n\u003cp\u003eSo far he and Kindra had come up dry. And at dawn—when rides out of town got easier to find—Chadwick\u0027s odds of finding her would get very long indeed.\u003c/p\u003e\n\u003cp\u003eAll this assumed the best-case scenario: that Mallory was on her own. If she was with Pérez, the task of finding her could be hopeless.\u003c/p\u003e\n\u003cp\u003e“There\u0027s another strip of motels on the west side of town.” He tried to sound enthusiastic about meeting more sleepy night clerks.\u003c/p\u003e\n\u003cp\u003eJones raised her coffee cup. “Nowhere but up.”\u003c/p\u003e\n\u003cp\u003eAs they drove, Chadwick kept an eye out, like a patrol cop—scanning doorways, sidewalks, alleys. Down by the creek off West Schubert, local teenagers clustered around a couple of pickup trucks, having an impromptu party. As Chadwick drove past, some of the kids stuck their joints and beer bottles behind their backs, as if that made them invisible. He knew they\u0027d spotted the Cold Springs logo on the side of the car—every kid in the area knew exactly what that meant—and he suddenly felt like a dogcatcher.\u003c/p\u003e\n\u003cp\u003e“I was Mallory, that\u0027s where I\u0027d be,” Jones said. “I\u0027d ditch whoever picked me up soon as I got to someplace there were lots of people. You\u0027re a runaway girl, the last person you trust is somebody who\u0027d pick up a runaway girl.”\u003c/p\u003e\n\u003cp\u003eChadwick looked over, surprised by the insight. “Confession time?”\u003c/p\u003e\n\u003cp\u003eKindra grinned. “Okay. I got an inside track. I ran away a few times.”\u003c/p\u003e\n\u003cp\u003e“Your folks come after you?”\u003c/p\u003e\n\u003cp\u003e“Nah. I did some stupid things. Some of the things you have to do to make money on the streets—then I came home on my own. See, back then, that was our boot camp. We didn\u0027t have to pay two thousand a month to learn reality. Momma just boot you outside.”\u003c/p\u003e\n\u003cp\u003eShe laughed, and Chadwick couldn\u0027t help smiling.\u003c/p\u003e\n\u003cp\u003eThe anger that had been coiling around inside him all night, like a stripped high-voltage line, momentarily untwisted.\u003c/p\u003e\n\u003cp\u003eHe looked back at the kids at the creek, debating whether he should stop to talk to them. He tried to picture Mallory hanging out with these teens from Fredericksburg. She would\u0027ve fit in about as well as Race did at Laurel Heights.\u003c/p\u003e\n\u003cp\u003eChadwick drove on.\u003c/p\u003e\n\u003cp\u003e“What about you?” Jones asked.\u003c/p\u003e\n\u003cp\u003e“What about me, what?”\u003c/p\u003e\n\u003cp\u003e“How\u0027d you grow up?”\u003c/p\u003e\n\u003cp\u003e“My reality school was the Air Force—Thailand, right at the end of the Vietnam War. Me and Hunter.”\u003c/p\u003e\n\u003cp\u003e“That must\u0027ve been some fun.”\u003c/p\u003e\n\u003cp\u003eShe said it in the tone that young people used, like the Vietnam War was a TV rerun she\u0027d seen and enjoyed on Nick at Nite.\u003c/p\u003e\n\u003cp\u003eChadwick remembered how he used to react to his granddad\u0027s stories about World War II—listening politely, unable to comprehend, and his grandfather giving him that empty stare, frustrated by what he could not share.\u003c/p\u003e\n\u003cp\u003eTime is the best revenge, he thought.\u003c/p\u003e\n\u003cp\u003eThe next few blocks, Chadwick thought about Korat, and the service revolver now chafing in its shoulder holster. He thought of Julio de la Garza, the Mexican sniper in the woods, his throat warm and taut under Chadwick\u0027s grip. The memory was not pleasant, but there was something focal about it—a clarity that kept Chadwick\u0027s raging emotions in check. He would not lose Mallory Zedman. Eight years of finding children, of making sure they were safe—all of that meant nothing if Mallory Zedman was lost.\u003c/p\u003e\n\u003cp\u003eThey searched another strip of hotels, then the only convenience store that was open twenty-four hours. No luck.\u003c/p\u003e\n\u003cp\u003eAt five A.M., they pulled in to an all-night pancake-and-diesel restaurant at the junction of Highways 290 and 87—their last-ditch hope before doubling back. The waitress, who\u0027d been on duty all night, had no recollection of anyone resembling Mallory Zedman.\u003c/p\u003e\n\u003cp\u003e“A young girl I would\u0027ve remembered,” she said, looking Kindra over. “We don\u0027t get many of them.”\u003c/p\u003e\n\u003cp\u003eHer voice indicated that she was thinking about something other than Mallory.\u003c/p\u003e\n\u003cp\u003eThe high-voltage line in Chadwick\u0027s gut made a sparking, vicious knot.\u003c/p\u003e\n\u003cp\u003e“You know what?” he told the lady. “We\u0027re staying for breakfast.”\u003c/p\u003e\n\u003cp\u003eOver Kindra\u0027s objections, he sat down at the counter and waited until the waitress, sour-faced, pushed two menus across.\u003c/p\u003e\n\u003cp\u003eThey had the restaurant to themselves except for three young truckers at a window booth. Once it became apparent that Kindra and Chadwick were ordering food, the truckers fell silent, staring at them.\u003c/p\u003e\n\u003cp\u003e“Chadwick,” Jones murmured. “We don\u0027t have to—”\u003c/p\u003e\n\u003cp\u003e“Sit down,” he said softly. “Order something.”\u003c/p\u003e\n\u003cp\u003eHe stared at the off-color pictures of eggs and bacon, the smiley-face pancake meals. He tried to convince himself he was hungry.\u003c/p\u003e\n\u003cp\u003eOne of the truckers said, “Nigger,” just loud enough for the comment to slice the air.\u003c/p\u003e\n\u003cp\u003eChadwick looked up. None of the truckers were looking at them, but one of them—a guy wearing a green bowling shirt—was grinning at his pals.\u003c/p\u003e\n\u003cp\u003e“Forget it,” Jones said tightly. “Ain\u0027t worth it.”\u003c/p\u003e\n\u003cp\u003eBut Chadwick\u0027s nerves were too raw to forget. He rose.\u003c/p\u003e\n\u003cp\u003e“Hey,” Jones insisted softly. “They\u0027re rednecks. They don\u0027t change—it isn\u0027t worth trying.”\u003c/p\u003e\n\u003cp\u003eChadwick walked toward the window booth.\u003c/p\u003e\n\u003cp\u003eJones cursed, then fell in behind him, muttering, “Or if you insist . . .”\u003c/p\u003e\n\u003cp\u003eGreen Shirt\u0027s smile melted as he realized just how big Chadwick was, and saw the bulge under the shoulder of his coat—the gun Chadwick was making no great effort to hide.\u003c/p\u003e\n\u003cp\u003e“The lady needs an apology,” Chadwick told him.\u003c/p\u003e\n\u003cp\u003e“Shit, man,” Green Shirt said, sliding his words sideways, so as to make himself invisible to criticism. “Apologize for what? Get a little brown sugar, it turns your head.”\u003c/p\u003e\n\u003cp\u003eChadwick grabbed a fistful of his hair and yanked him out of the booth, over his friends, spilling him onto the floor like so much laundry. The other two men pressed themselves against the window.\u003c/p\u003e\n\u003cp\u003e“Get up,” Chadwick told him. “Apologize.”\u003c/p\u003e\n\u003cp\u003e“Jesus, man—”\u003c/p\u003e\n\u003cp\u003e“Chadwick,” Kindra said, then she turned to the truckers, her voice urgent and polite. “Look, gentlemen—Mr. Chadwick here has had a rough night. I would humor him. Really.”\u003c/p\u003e\n\u003cp\u003eSuddenly, she and the truckers were unlikely allies—the common enemy being Chadwick\u0027s rage. Chadwick knew this, knew he should be in control, but he no longer cared.\u003c/p\u003e\n\u003cp\u003e“You were out of line, Eddie,” one of the guys in the booth offered. “She\u0027s right.”\u003c/p\u003e\n\u003cp\u003eEddie with the green shirt got up from the floor, wiped the spit off his mouth. He tried for a tough-guy look, but the fear kept melting it off his face. “Sorry. I\u0027m sorry. Okay?”\u003c/p\u003e\n\u003cp\u003eChadwick walked back to the counter, but the waitress had reclaimed their menus. “I think y\u0027all should look elsewhere for breakfast,” she told them primly.\u003c/p\u003e\n\u003cp\u003e“Good idea,” Kindra answered. “That\u0027s an excellent idea.”\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t have to worry about Chadwick arguing. The fight had gone out of him.\u003c/p\u003e\n\u003cp\u003eThey walked to the car, leaving three terrified truckers and a sour old waitress with something to talk about for weeks. Another local publicity triumph for the staff of Cold Springs.\u003c/p\u003e\n\u003cp\u003eChadwick got behind the wheel, stared through the windshield. The sun wasn\u0027t up yet, but the east was lightening, turning the color of wolf fur.\u003c/p\u003e\n\u003cp\u003e“I appreciate the sentiment and all,” Kindra said, “but don\u0027t fight my fights, okay?”\u003c/p\u003e\n\u003cp\u003e“That wasn\u0027t for you. If it was for you, it might\u0027ve been excusable.”\u003c/p\u003e\n\u003cp\u003eShe spread her hands. “Okay. Whatever, Chadwick. Remind me not to grow up my kids the Air Force way, huh? It sure as shit doesn\u0027t work.”\u003c/p\u003e\n\u003cp\u003eChadwick didn\u0027t respond. He was trying to get up his nerve to call Hunter and admit defeat, formulate Plan B.\u003c/p\u003e\n\u003cp\u003eThen his cell phone rang.\u003c/p\u003e\n\u003cp\u003eChadwick picked it up, expecting Ann with flight information.\u003c/p\u003e\n\u003cp\u003eInstead Mallory\u0027s voice said in his ear, “You passed right by me. You\u0027re supposed to be this great tracker of kids.”\u003c/p\u003e\n\u003cp\u003eBrave words, but her voice didn\u0027t sound taunting. It was broken as static.\u003c/p\u003e\n\u003cp\u003e“Where are you, Mallory?” he said. “How\u0027d you get this number?”\u003c/p\u003e\n\u003cp\u003e“It wasn\u0027t genius work,” she told him. “I called Cold Springs. I got your voice mail. Your recording gives your cell phone number. Listen—I\u0027ve got a problem.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you do.”\u003c/p\u003e\n\u003cp\u003e“I mean a bigger problem than running away. Pérez is after me. He\u0027s trying to kill me.”\u003c/p\u003e\n\u003cp\u003e“Tell me where you are. I\u0027ll protect you.”\u003c/p\u003e\n\u003cp\u003e“Where have I heard that before?”\u003c/p\u003e\n\u003cp\u003e“What\u0027s your other option, Mallory? Running?”\u003c/p\u003e\n\u003cp\u003e“What the hell was I supposed to do—sit and take a bullet? Look—I\u0027ll make a deal with you. I\u0027ll tell you where I am.”\u003c/p\u003e\n\u003cp\u003e“You\u0027re at Town Creek, with that crowd of teenagers.”\u003c/p\u003e\n\u003cp\u003e“Not anymore. I\u0027ll meet you. But you\u0027ve got to come alone. Promise you\u0027ll listen to me. Then you can decide if I have to go back to Cold Springs.”\u003c/p\u003e\n\u003cp\u003e“There can\u0027t be any if to that.”\u003c/p\u003e\n\u003cp\u003e“But you have to listen to me first. You\u0027ve got to promise you\u0027ll hear me out. Agreed?”\u003c/p\u003e\n\u003cp\u003eChadwick thought about it, but despite trying hard, he couldn\u0027t see any downside.\u003c/p\u003e\n\u003cp\u003eThey agreed on the all-night convenience store back in Fredericksburg.\u003c/p\u003e\n\u003cp\u003eMallory hung up without a goodbye.\u003c/p\u003e\n\u003cp\u003eKindra said, “You\u0027re negotiating with that girl?”\u003c/p\u003e\n\u003cp\u003e“I\u0027m bringing her in.” \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-42.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
