{"id":77340,"no":56,"title":"Page 56","content":"\u003cp\u003eMallory couldn\u0027t breathe, couldn\u0027t make her limbs obey.\u003c/p\u003e\n\u003cp\u003eOlsen opened her mouth, as if to protest, and a second gunshot blew a hole just above her kneecap, red mist erupting from the wound like a comet tail.\u003c/p\u003e\n\u003cp\u003eMallory\u0027s brain managed one blunt command to her body: Move.\u003c/p\u003e\n\u003cp\u003eShe shoved open her door and dove into the corn. The gun fired again. Glass shattered—the window where her head had been a moment before.\u003c/p\u003e\n\u003cp\u003eMallory clattered away through the corn, her ears ringing. She couldn\u0027t see, could only feel the corn cutting into her, slashing at her sleeves.\u003c/p\u003e\n\u003cp\u003e“Come on, Mallory,” Jones yelled, somewhere behind her. “You\u0027re running from the wrong person.”\u003c/p\u003e\n\u003cp\u003eMallory kept running. The gun fired again, a bullet hissing through a corn stalk inches from her ear.\u003c/p\u003e\n\u003cp\u003eStupid, she scolded herself. Jones can see the corn moving.\u003c/p\u003e\n\u003cp\u003eShe dove down, pressed herself into the snow.\u003c/p\u003e\n\u003cp\u003eShe heard Jones picking her way across the field, slowly coming toward her.\u003c/p\u003e\n\u003cp\u003e“Mallory, I don\u0027t have a problem with you. But Chadwick is a killer. Katherine\u0027s death really messed him up. You got to see that.”\u003c/p\u003e\n\u003cp\u003eMallory knew the words were a lie. Jones had brought her to this field to die.\u003c/p\u003e\n\u003cp\u003eBut her father . . . she pictured him huddled in the cabinet at Katherine\u0027s house, in the secret space where she\u0027d played hide-and-seek among the broken clock parts. She imagined a gunshot wound opening in her father\u0027s chest, his hand clutching at the blood, his eyes wide with dismay. She wanted to cry. She wanted someone to blame.\u003c/p\u003e\n\u003cp\u003e“Olsen was helping him.” Kindra Jones was rustling through the corn, getting closer to her. “They had the whole thing planned. You see that, don\u0027t you? Chadwick hates your parents. He hates you. You survived and his precious daughter didn\u0027t. Katherine was my friend, Mallory—she told me what her father was like. She killed herself because of him, because she knew what he was like and she couldn\u0027t live with the truth anymore. I\u0027m here to stop him. I can\u0027t rely on the police to do that. I\u0027m here to protect you and Race. That\u0027s Samuel\u0027s job, honey. That\u0027s what a big brother does.”\u003c/p\u003e\n\u003cp\u003e“No,” Mallory protested, realizing too late that she\u0027d spoken aloud.\u003c/p\u003e\n\u003cp\u003eThe rustling stopped.\u003c/p\u003e\n\u003cp\u003eMallory heard a sound in the distance like horse\u0027s hooves, but it was only in her mind—her own heart hammering.\u003c/p\u003e\n\u003cp\u003eSurvival rules. Survey. Organize. Strategize.\u003c/p\u003e\n\u003cp\u003eWhat was there to survey? Jones was strong. She was armed, and intended to kill her. Mallory was going to die.\u003c/p\u003e\n\u003cp\u003eNo. Not without a fight.\u003c/p\u003e\n\u003cp\u003eShe felt around her, found a peach-sized stone, smooth and heavy.\u003c/p\u003e\n\u003cp\u003eThe rustling started again, then Mallory saw a patch of green, Jones\u0027 flannel jacket, and threw her stone as high and as far away as possible.\u003c/p\u003e\n\u003cp\u003eSomewhere off to the north, the rock splashed in the corn. Jones stopped, then her green flannel receded. She\u0027d taken the bait. Now her back would be to Mallory.\u003c/p\u003e\n\u003cp\u003eMallory slid her knife from its sheath, rose to a crouch.\u003c/p\u003e\n\u003cp\u003e“I\u0027m going to leave here today, Mallory,” Jones was calling. “El Salvador, buy me a house on the beach.”\u003c/p\u003e\n\u003cp\u003eKeep talking, Mallory thought. Give me a target.\u003c/p\u003e\n\u003cp\u003e“No extradition, Mal. Nobody asking questions as long as you got money. You can come with me. You and Race both. New house, a new life. You ever been to the beaches in Central America, honey? I hear . . .”\u003c/p\u003e\n\u003cp\u003eKindra\u0027s voice trailed off, and Mallory realized the clumping sound she\u0027d heard before had become louder—a heartbeat against the earth.\u003c/p\u003e\n\u003cp\u003eThe rhythm slowed to a patter, and she heard a man\u0027s voice, followed by Olsen\u0027s broken murmur.\u003c/p\u003e\n\u003cp\u003eMallory\u0027s ears had to be deceiving her.\u003c/p\u003e\n\u003cp\u003eShe glimpsed the patch of green again, directly ahead—Kindra\u0027s jacket. Mallory was considering a knife throw—remembering her four-in-ten average back in camp, Leyland telling her that was damn good for a novice. Four-in-ten, life and death, against a moving target. She was weighing those piss-poor odds when Chadwick\u0027s voice shouted her name.\u003c/p\u003e\n\u003cp\u003eThere he was, rising above the corn on the back of the bay filly from Cold Springs—riding a goddamn horse, like goddamn George Washington. All her life she\u0027d heard that\u0027s who he looked like, but she\u0027d never seen the resemblance until now.\u003c/p\u003e\n\u003cp\u003eThe bay\u0027s coat was glossy with sweat. Chadwick\u0027s clothes were torn and water-stained as if he\u0027d ridden through a million tree branches to get here.\u003c/p\u003e\n\u003cp\u003eTheir eyes met. Mallory couldn\u0027t say anything. She couldn\u0027t warn him; she couldn\u0027t even decide if she wanted to. She thought of when she was small—how she\u0027d believed Katherine was so lucky having Chadwick as a father, a silent, gentle giant who would always protect her. And now here he was, riding to her rescue. Mallory wanted to cry. She wanted to break down and yell at him to watch out. But she couldn\u0027t do it. She resented him. He was a false hope, a hallucination—a chemical glitch of adrenaline and hormones and heroin withdrawal. Chadwick couldn\u0027t have ridden all this way in one morning. He would\u0027ve had to start at dawn, before he even knew she was in trouble.\u003c/p\u003e\n\u003cp\u003eChadwick\u0027s eyes were trying to communicate a thousand things. Then his attention turned—he must\u0027ve seen Kindra Jones. He raised an old-fashioned revolver, but Jones had had plenty of time to aim. A shot thundered, the horse whinnied in pain and toppled, taking Chadwick with it. There was a sickening crunch, then the sound of the horse huffing, thrashing through the stalks.\u003c/p\u003e\n\u003cp\u003eWhen the commotion died down, Mallory heard Jones say, “Well, lookee here. My partner.”\u003c/p\u003e\n\u003cp\u003e“Mallory.” Chadwick\u0027s voice was tight with pain. “Run. Get out of here.”\u003c/p\u003e\n\u003cp\u003eMallory edged closer, knowing it was crazy. She could see through the screen of corn plants—Kindra standing over Chadwick, his leg bent at an unnatural angle. Chadwick\u0027s gun was gone. The horse was nowhere in sight. Blood painted a trail of crushed corn plants where the wounded animal must\u0027ve gotten back on its hooves and run away.\u003c/p\u003e\n\u003cp\u003eKindra paced around Chadwick, keeping the gun barrel trained on his head. “Samuel says hello, Chad. He says you should\u0027ve stayed with your lady friend this morning.”\u003c/p\u003e\n\u003cp\u003e“You\u0027ve got the money from Laurel Heights. Twenty-seven million dollars.”\u003c/p\u003e\n\u003cp\u003e“Not bad for an Oakland girl with a teaching degree. You find teaching rewarding, Chadwick? Shit, I do.”\u003c/p\u003e\n\u003cp\u003e“You have what you want. Walk away.”\u003c/p\u003e\n\u003cp\u003eKindra\u0027s smile seemed sleepy, her eyes half lidded behind her glasses. “Katherine tells me you\u0027re right. She says to go on—catch my plane. She was hoping you\u0027d stay at the hotel this morning, get caught by the FBI. I could live with that, Chadwick, knowing you\u0027d spend the rest of your life in a fucking prison. But, see, here you are.”\u003c/p\u003e\n\u003cp\u003eMallory heard sirens in the distance.\u003c/p\u003e\n\u003cp\u003eKindra kept pacing, ignoring the sound. “I don\u0027t know how you got here so fast. Calls for some flexibility, but I\u0027m flexible. Hell, ten fucking years I\u0027ve lived Samuel\u0027s life as well as mine—I\u0027m damn flexible. All those years leading up to this. Right here, with you.”\u003c/p\u003e\n\u003cp\u003e“You killed your own mother, John Zedman, Pérez. The police know about you, Kindra. Race came forward with the whole story. The police are on their way.”\u003c/p\u003e\n\u003cp\u003eShe laughed, but the sound was brittle. “Race, huh? Race did that.” She yelled, “You hear him, Mallory? This killer, he blames me. He talks about the police, like he really wants to meet them. Come on out, honey. I want you to see this. Be good for you—closure, what your counselor would say. A real live abuser doll about to get crushed.”\u003c/p\u003e\n\u003cp\u003e“Forget the girl,” Chadwick said. “Let her go.”\u003c/p\u003e\n\u003cp\u003e“You shouldn\u0027t have given my little brother your card, Chadwick. Not after what you\u0027ve done to my family. You shouldn\u0027t have tried to protect me from those rednecks at that truck stop. There\u0027s only one protector in my family. Only one person who can do what needs to be done. Kill that bastard Ali. Take care of Race. Take care of Kindra. Katherine\u0027s talking to me now, Chadwick. She\u0027s pleading with me to spare your sorry-ass life. But I\u0027m finally going to get her voice out of my head. I\u0027m going to listen to Samuel on this one.”\u003c/p\u003e\n\u003cp\u003eAnd Mallory suddenly understood her anger. She suddenly understood Jones. She remembered the rage that had made her take a hammer to her mother\u0027s apartment, let out nine years of hate, blaming her parents for what she\u0027d become—for the path she\u0027d started the night Katherine died.\u003c/p\u003e\n\u003cp\u003eThe sirens kept wailing, closer now.\u003c/p\u003e\n\u003cp\u003eMallory could run—get away clean, nothing but the dry snap of a gun discharge behind her. Nothing on her conscience. Justice served.\u003c/p\u003e\n\u003cp\u003eBut she imagined Olsen\u0027s voice—Olsen, whose last words had been about trusting Chadwick. Olsen saying, Some connections, you can\u0027t break. Olsen, who was dead in a welter of blood in the front seat of the van.\u003c/p\u003e\n\u003cp\u003e“Mallory.” Chadwick spoke her name in a tone she hadn\u0027t heard for a long time—since nine years ago, when he used to talk to Katherine. “Your father loved you. He was doing everything he could to protect you. If he were here, he would tell you he\u0027s sorry. He did the wrong things for the right reasons. Please believe me, that\u0027s what he would say.”\u003c/p\u003e\n\u003cp\u003eKindra raised her gun.\u003c/p\u003e\n\u003cp\u003eMallory\u0027s heart shifted like a gyroscope.\u003c/p\u003e\n\u003cp\u003eShe rose to her feet and rushed Jones like she was the obstacle course wall—closing five yards, the gun turning in her direction, the snap of a bullet ripping past her ear, but nothing mattered except clearing the obstacle. Mallory\u0027s shoulder slammed into Jones\u0027 chest so hard she felt ribs crack. Jones staggered backwards, collapsing into the frozen cornstalks, and Mallory gripped the knife in her hand, putting herself between Jones and Chadwick.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t protect me,” Chadwick groaned. “Run.”\u003c/p\u003e\n\u003cp\u003eBut Mallory had finally outgrown Chadwick\u0027s advice.\u003c/p\u003e\n\u003cp\u003eWincing, Jones rose to a crouch, a dozen feet away. She looked dazed, but pleasantly surprised that Mallory had shown herself. “Katherine loves you, too, honey. Believe me, that\u0027s what she\u0027s saying.”\u003c/p\u003e\n\u003cp\u003eThe gun was still in Jones\u0027 hand. Her eyes were amber, just like her brother\u0027s.\u003c/p\u003e\n\u003cp\u003eShe raised the gun toward Mallory, and with every ounce of strength, as if with willpower alone could drive steel through the trunk of a tree, Mallory threw the knife.\u003c/p\u003e\n\u003cp\u003e37\u003c/p\u003e\n\u003cp\u003eThe next week was Christmas at Cold Springs, and a front blew up from the Rio Grande, bringing dry Mexican air that smelled of sage and brush fires. Sunshine soaked the hills until rattlesnakes came out to warm themselves on the granite and the deer became nocturnal.\u003c/p\u003e\n\u003cp\u003eChadwick spent his days proctoring White Level study halls on the main deck, learning to walk with a boot cast, and coming to terms with the fact that he\u0027d been yanked back from the edge of the precipice. He tried to convince himself that the danger had passed, that there was nothing else he needed to do.\u003c/p\u003e\n\u003cp\u003eOn Christmas Eve, Olsen was released from the hospital in San Antonio. She arrived at the lodge to find most of the staff waiting for her, holding a welcome banner the tan levels had made in art therapy class. She insisted on getting out of her wheelchair and walking the twenty feet from the parking space to the door, Asa Hunter holding her arm. She smiled as the counselors applauded, but her face was clammy white, slick with sweat from the effort.\u003c/p\u003e\n\u003cp\u003eThe doctors had told her how lucky she was. The shot to the leg had missed both artery and bone. The shot meant for her gut had instead drilled a hole through the muscles of her flank, narrowly missing her intestines. The surgeon speculated that the bulkiness of Olsen\u0027s winter jacket had saved her life, obscuring her form so that Jones\u0027 shot had been off-center. \u003c/p\u003e","sourceLink":"https://allnovel.net/cold-springs/page-56.html","bookId":2423,"creation":"Oct 5, 2019 3:37:06 PM","modification":"Oct 5, 2019 3:37:06 PM"}
