{"id":37666,"no":20,"title":"CHAPTER XX","content":"\u0026nbsp;They went out; and Montague waited a minute or two, to give them a chance to get out of the way, and then he rang the elevator bell and entered the car. \n\u003cdiv\u003e\n It stopped again at the next floor, and he gave a start of excitement. As the door opened, he saw a group of men, with Duval, Ward, and General Prentice among them. He moved behind the elevator man, so that none of them should notice him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague had caught one glimpse of the face of General Prentice. It was deathly pale. The General said not a word to anyone, but went out into the corridor. The other hesitated for a moment, then, with a sudden resolution, he turned and followed. As his friend passed out of the door, he stepped up beside him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening, General,” he said. The General turned and stared at him, half in a daze.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Montague!” he said. “How are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” said Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the street outside, among a group of half a dozen automobiles, he recognised the General\u0027s limousine car.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Home,” was the reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll ride with you, if you like,” said Montague. “I\u0027ve something to say to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said the General. He could not very well have refused, for Montague had taken him by the arm and started toward the car; he did not intend to be put off.\n\u003c/div\u003e \n\u003cdiv\u003e\n He helped the General in, got in himself, and shut to the door behind him. Prentice sat staring in front of him, still half in a daze.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague watched him for a minute or so. Then suddenly he leaned toward him, and said, “General, why do you let them persuade you to do it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hey?” said the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say,” repeated Montague, “why do you let them persuade you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The other turned and stared at him, with a startled look in his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know all about what has happened,” said Montague. “I know what went on at that conference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” gasped the General.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know what they made you promise to do. They are going to wreck the Gotham Trust Company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The General was dumfounded. “Why!” he gasped. “How? Who told you? How could you—”\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague had to wait a minute or two until his friend had got over his dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot help it,” he burst out, finally. “What can I do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can refuse to play their game!” exclaimed Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But don\u0027t you suppose that they would do it just the same? And how long do you suppose that I would last, if I refused them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But think of what it means!” cried Montague. “Think of the ruin! You will bring everything about your head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know, I know!” cried the General, in a voice of anguish. “Don\u0027t think that I haven\u0027t realised it—don\u0027t think that I haven\u0027t fought against it! But I am helpless, utterly helpless.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned upon Montague, and caught his sleeve with a trembling hand. “I never thought that I would live to face such an hour,” he exclaimed. “To despise myself—to be despised by all the world! To be browbeaten, and insulted, and dragged about—”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man paused, choking with excess of emotion. “Look at me!” he cried, with sudden vehemence. “Look at me! You think that I am a man, a person of influence in the community, the head of a great institution in which thousands of people have faith. But I am nothing of the kind. I am a puppet—I am a sham—I am a disgrace to myself and to the name I bear!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And suddenly he clasped his hands over his face, and bowed his head, so that Montague should not see his grief.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a long silence. Montague was dumb with horror. He felt that his mere presence was an outrage.\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally the General looked up again. He clenched his hand, and mastered himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have chosen my part,” he said. “I must play it through. What I feel about it makes no difference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague again said nothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no right to inflict my grief upon you,” the General continued. “I have no right to try to excuse myself. There is no turning back now. I am Dan Waterman\u0027s man, and I do his bidding.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how can you have got into such a position?” asked Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A friend of mine organised the Trust Company of the Republic. He asked me to become president, because I had a name that would be useful to him. I accepted—he was a man I knew I could trust. I managed the business properly, and it prospered; and then, three years ago, the control was bought by other men. That was when the crisis came. I should have resigned. But I had my family to think of; I had friends who were involved; I had interests that I could not leave. And I stayed—and that is all. I found that I had stayed to be a puppet, a figurehead. And now it is too late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But can\u0027t you withdraw now?” asked Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now?” echoed the General. “Now, in the most critical moment, when all my friends are hanging upon me? There is nothing that my enemies would like better, for they could lay all their sins at my door. They would class me with Stewart and Ryder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see,” said Montague, in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now the crisis comes, and I find out who my real master is. I am told to do this, and do that, and I do it. There are no threats; I understand without any. Oh, my God, Mr. Montague, if I should tell you of some of the things that I have seen in this city—of the indignities that I have seen heaped upon men, of the deeds to which I have seen them driven. Men whom you think of as the most honourable in the community—men who have grown grey in the service of the public! It is too brutal, too horrible for words!”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a long silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And there is nothing you can do?” asked Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me, General, is your institution sound?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perfectly sound.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you have done nothing improper?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then why should you fear Waterman?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” exclaimed the General. “Because I am liable for eighty per cent of my deposits, and I have only five per cent of reserves.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see!” said Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a choice between Stanley Ryder and myself,” added the other. “And Stanley Ryder will have to fight his own battle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was nothing more said. Each of the men sat buried in his own thoughts, and the only sound was the hum of the automobile as it sped up Broadway.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague was working out another course of action. He moved to another seat in the car where he could see the numbers upon the street lamps as they flashed by; and at last he touched the General upon the knee. “I will leave you at the next corner,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n The General pressed the button which signalled his chauffeur, and the car drew up at the curb. Montague descended.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good night, General,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good night,” said the other, in a faint voice. He did not offer to take Montague\u0027s hand. The latter closed the door of the car, and it sped away up the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he crossed over and went down to the River drive, and entered Lucy\u0027s apartment house.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mrs. Taylor in?” he asked of the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll see,” said the man. Montague gave his name and added, “Tell her it is very important.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucy came to the door herself, clad in an evening gown.\n\u003c/div\u003e \n\u003cdiv\u003e\n One glance at his haggard face was enough to tell her that something was wrong. “What is it, Allan?” she cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n He hung up his hat and coat, and went into the drawing-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Allan?” she cried again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lucy, do you know where Stanley Ryder is?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” she answered, and added quickly, “Oh! it\u0027s some bad news!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is,” said he. “He must be found at once.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She stared at him for a moment, hesitating; then, her anxiety overcoming every other emotion, she said, “He is in the next room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Call him,” said Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n Lucy ran to the door. “Come in. Quickly!” she called, and Ryder appeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague saw that he was very pale; and there was nothing left of his air of aristocratic serenity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Ryder,” he began, “I have just come into possession of some news which concerns you very closely. I felt that you ought to know. There is to be a directors\u0027 meeting to-morrow morning, at which it is to be decided that the bank which clears for the Gotham Trust Company will discontinue to do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ryder started as if he had been shot; his face turned grey. There was no sound except a faint cry of fright from Lucy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My information is quite positive,” continued Montague. “It has been determined to wreck your institution!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ryder caught at a chair to support himself. “Who? Who?” he stammered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is Duval and Waterman,” said Montague.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dan Waterman!” It was Lucy who spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague turned to look at her, and saw her eyes, wide open with terror.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Lucy,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, oh!” she gasped, choking; then suddenly she cried wildly, “Tell me! I don\u0027t understand—what does it mean?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It means that I am ruined,” exclaimed Ryder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ruined?” she echoed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Absolutely!” he said. “They\u0027ve got me! I knew they were after me, but I didn\u0027t think they\u0027d dare!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He ended with a furious imprecation; but Montague had kept his eyes fixed upon Lucy. It was her suffering that he cared about.\n\u003c/div\u003e \n\u003cdiv\u003e\n He heard her whisper, under her breath, “It\u0027s for me!” And then again, “It\u0027s for me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lucy,” he began; but suddenly she put up her hand, and rushed toward him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush! he doesn\u0027t know!” she panted breathlessly. “I haven\u0027t told him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And then she turned toward Ryder again. “Oh, surely there must be some way,” she cried, wildly. “Surely—”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ryder had sunk down in a chair and buried his face in his hands. “Ruined!” he exclaimed. “Utterly ruined! I won\u0027t have a dollar left in the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no,” cried Lucy, “it cannot be!” And she put her hands to her forehead, striving to think. “It must be stopped. I\u0027ll go and see him. I\u0027ll plead with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must not, Lucy!” cried Montague, starting toward her.\n\u003c/div\u003e \n\u003cdiv\u003e\n But again she whirled upon him. “Not a word!” she whispered, with fierce intensity. “Not a word!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And she rushed into the next room, and half a minute later came back with her hat and wrap.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Allan,” she said, “tell them to call me a cab!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He tried to protest again; but she would not hear him. “You can ride with me,” she said. “You can talk then. Call me a cab! Please—save me that trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He gave the message: and Lucy, meanwhile, stood in the middle of the room, twisting her hands together nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, Allan, go downstairs,” she said; “wait for me there.” And after another glance at the broken figure of Ryder, he took his hat and coat and obeyed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague spent his time pacing back and forth in the entrance-hall. The cab arrived, and a minute later Lucy appeared, wearing a heavy veil. She went straight to the vehicle, and sprang in, and Montague followed. She gave the driver the address of Waterman\u0027s great marble palace over by the park; and the cab started.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then suddenly she turned upon Montague, speaking swiftly and intensely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know what you are going to say,” she cried. “But you must spare me—and you must spare yourself. I am sorry that you should have to know this—God knows that I could not help it! But it cannot be undone. And there is no other way out of it. I must go to him, and try to save Ryder!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lucy,” he began, “listen to me—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t want to listen to you,” she cried wildly—almost hysterically. “I cannot bear to be argued with. It is too hard for me as it is!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But think of the practical side of it!” he cried. “Do you imagine that you can stop this huge machine that Waterman has set in motion?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know, I don\u0027t know!” she exclaimed, choking back a sob. “I can only do what I can. If he has any spark of feeling in him—I\u0027ll get down on my knees to him, I will beg him—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Lucy! think of what you are doing. You go there to his house at night! You put yourself into his power!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t care, Allan—I am not afraid of him. I have thought about myself too long. Now I must think about the man I love.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague did not answer, for a moment. “Lucy,” he said at last, “will you tell me how you have thought of yourself in one single thing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, yes—I will!” she cried, vehemently. “I have known all along that Waterman was following me. I have been haunted by the thought of him—I have felt his power in everything that has befallen us. And I have never once told Ryder of his peril!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was more a kindness to him—” began the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no!” panted Lucy; and she caught his coat sleeve in her trembling hands. “You see, you see—you cannot even imagine it of me! I kept it a secret—because I was afraid!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Afraid?” he echoed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was afraid that Ryder would leave me! I was afraid that he would give me up! And I loved him too much!—Now,” she rushed on—“you see what kind of a person I have been! And I can sit here, and tell you that! Is there anything that can make me ashamed after that? Is there anything that can degrade me after that? And what is there left for me to do but go to Waterman and try to undo what I have done?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Montague was speechless, before the agony of her humiliation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see!” she whispered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lucy,” he began, protesting.\n\u003c/div\u003e \n\u003cdiv\u003e\n But suddenly she caught him by the arm. “Allan,” she whispered, “I know that you have to try to stop me. But it is no use, and I must do it! And I cannot bear to hear you—it makes it too hard for me. My course is chosen, and nothing in the world can turn me; and I want you to go away and leave me. I want you to go—right now! I am not afraid of Waterman; I am not afraid of anything that he can do. I am only afraid of you, and your unhappiness. I want you to leave me to my fate! I want you to stop thinking about me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot do it, Lucy,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n She reached up and pulled the signal cord; and the cab came to a halt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want you to get out, Allan!” she cried wildly. “Please get out, and go away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He started to protest again; but she pushed him away in frenzy. “Go, go!” she cried; and half dazed, and scarcely realising what he did, he gave way to her and stepped out into the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Drive!” she called to the man, and shut the door; and Montague found himself standing on a driveway in the park, with the lights of the cab disappearing around a turn.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3231/88381.html","bookId":686,"creation":"Aug 5, 2019 8:07:35 AM","modification":"Aug 5, 2019 8:07:35 AM"}
