{"id":82824,"no":12,"title":"Page 12","content":"\u003cp\u003e\"Well, I hope you feel better.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Gina. I\u0027ll see you tomorrow morning,\" Dean said, hanging up without saying goodbye. He dropped his thick head into the pillow and stared at the blurry ceiling fan above. Most of the night had passed this way, with sleep eluding him like an escaped fugitive. Even the ceiling fan\u0027s dull hum was powerless to help him. He glanced at the alarm clock on the nightstand and let out an aggravated breath. In three minutes it would be eight in the morning and he wasn\u0027t sure if he had fallen asleep for even an hour during the night.\u003c/p\u003e\n\u003cp\u003eHe rubbed his puffy eyes and yawned, entertaining the notion of calling Evy and coming clean about Clay. It might ease her mind knowing Sugars could be getting their license back, but Clay\u0027s word was sketchy at best. Probably wise not to get her hopes up. Not yet. He rolled over onto his side, tucking an arm beneath his pillow, and stared at a tall dresser in the early morning light. Despite the exhaustion sapping his strength, his mind refused to shut down, conjuring up twisted scenarios yet to come. Nightmares besieged him whether he slept or not. One moment, back together with Evy - their love stronger than ever after surviving such a harrowing ordeal, the next she was screaming at him for ruining her life.\u003c/p\u003e\n\u003cp\u003eHis only option now was to wait and see which would happen. He shut his eyes and smiled when he thought of punching Clay in the face, a lonely highlight amidst a sea of desolation. Dean wondered what Evy was doing at this precise moment - probably serving up homemade cinnamon rolls and apple fritters to an impatient breakfast crowd. He missed her smile and laugh the most. He yawned again and saw them in Chicago, strolling shops on Michigan Avenue two weekends ago. They walked hand in hand, the wind blowing so hard it was like scaling a mountain. He could still see the look on her face when her summer dress fluttered up high enough to show off her cream colored panties. A group of high school girls had laughed and Evy marched Dean straight into an H\u0026amp;M to buy her some new jeans and a top while he begged her for just one more panty-shot. It had been a great weekend and before he knew it, sleep pulled him to a dark place that would leave him feeling tired and cranky the rest of the day.\u003c/p\u003e\n\u003cp\u003eEvy dropped a pan of cupcakes onto the silver workspace with a loud clatter, stripped the oven mitts from her hands and slammed them down. Brooke glanced over but Evy ignored her while loading a frosting gun with cherry frosting.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t get why we\u0027re even doing this,\" she grumbled, having trouble locking the plunger into place.\u003c/p\u003e\n\u003cp\u003eBrooke stopped a spatula from layering a thick coat of chocolate frosting over what was to become a three layered cake. \"You didn\u0027t have to come in this morning.\"\u003c/p\u003e\n\u003cp\u003e\"What was I suppose to do? Stare at the ceiling some more?\"\u003c/p\u003e\n\u003cp\u003eBrooke struggled to keep a civil tongue, her eyes just as red around the edges as her sister\u0027s. \"Well, we have to sell something, Evy. We can\u0027t just give up and quit.\"\u003c/p\u003e\n\u003cp\u003eEvy pinched her eyes together. \"Stop talking to me like you\u0027re mom. For the record, I\u0027m five years older than you are and I know we can\u0027t just give up,\" she replied, her eyes betraying her, because deep down, that\u0027s just what she wanted to do. Give up. Move back to Des Moines and start all over again, far away from this strife and grief.\u003c/p\u003e\n\u003cp\u003eShe clicked a long tip on the end of the barrel and wrapped a finger around the trigger. \"This is so embarrassing. What\u0027re we supposed to tell people when they order a glass of wine with their vanilla bean cheesecake? So sorry, but we\u0027re not responsible enough to sell alcohol anymore.\" She pulled the trigger instead of squeezing it, blasting a chocolate cupcake with too much frosting. Evy swore and threw the cupcake into the reject tub for Ben to eat later on. \"This is pointless!\"\u003c/p\u003e\n\u003cp\u003e\"You think I\u0027m not scared, Evy?\" Brooke cried, slamming the spatula down and bursting into tears. \"We used Ben\u0027s money to open this place! How do you think I feel about the idea of him losing everything because of me?\"\u003c/p\u003e\n\u003cp\u003eEvy closed her eyes and groaned, not believing things could possibly get worse. She lowered the gun along with her voice. \"It\u0027s not because of you.\"\u003c/p\u003e\n\u003cp\u003eBrooke buried her face in her hands. Tears slipped between her fingers and fell to the shiny floor.\u003c/p\u003e\n\u003cp\u003eEvy rushed over and wrapped her in a tight hug. \"I\u0027m sorry,\" she whispered. \"I didn\u0027t mean to take it out on you.\"\u003c/p\u003e\n\u003cp\u003eBen waltzed through the swinging door and stopped, staring at them with his mouth agape. \"Awe hell, looks like I\u0027m just in time for a little girl on girl!\"\u003c/p\u003e\n\u003cp\u003eThey turned to him, venomous scowls stretching their features.\u003c/p\u003e\n\u003cp\u003eHis smile faded. He thumbed toward the door behind him. \"I\u0027ll be helping customers if anyone needs me.\"\u003c/p\u003e\n\u003cp\u003eBrooke watched him go, biting back a smile. \"He\u0027s such an ass,\" she sniffled.\u003c/p\u003e\n\u003cp\u003eEvy wiped tears from her sister\u0027s face. \"At least he didn\u0027t knock some strange girl up,\" she muttered.\u003c/p\u003e\n\u003cp\u003e\"Evy, this isn\u0027t Dean\u0027s fault. None of it is. In fact, last I checked, he\u0027s the only one trying to help us.\"\u003c/p\u003e\n\u003cp\u003eEvy groaned again and gravitated back to the pan of cupcakes, sheepishly hanging her head. \"I know it\u0027s not his fault.\"\u003c/p\u003e\n\u003cp\u003e\"Then why don\u0027t you talk to him?\"\u003c/p\u003e\n\u003cp\u003e\"I tried last night. Remember?\"\u003c/p\u003e\n\u003cp\u003eBrooke wiped her nose with a shoulder. \"Well, try again.\"\u003c/p\u003e\n\u003cp\u003eEvy sank onto a stool and hid her eyes with a hand. \"How did everything go so wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, honey, but there\u0027s no need to make it worse.\" Brooke tipped her head down and peered at Evy through the top of her eyes. \"Stop being such a sissy and call him already.\"\u003c/p\u003e\n\u003cp\u003eEvy glanced at the cell phone resting on the table, her insides twisting uncomfortably.\u003c/p\u003e\n\u003cp\u003eDean ran as fast as he could from something so unspeakable he dared not look back when his phone began to ring. He searched himself without slowing. His empty pockets inflated his panic and he tripped over something and tumbled to the ground with a grunt bursting from his lips. His eyelids snapped back to find the sunlight driving the morning\u0027s shadows into the far corners of the room. A long yawn eased from his mouth as he rubbed his eyes, trying to recall what had been chasing him in his dream. Within seconds, the vision dissolved into nothingness, bringing his ugly reality crashing back down with a thunderous force. Evy was still gone.\u003c/p\u003e\n\u003cp\u003eHis cell phone rang, jolting him from his thoughts. He reached over and fumbled it from the nightstand, staring at the screen through sleepy eyes.\u003c/p\u003e\n\u003cp\u003e\"Hey Shaun, what\u0027s up?\" he said, trying not to sound sleepy.\u003c/p\u003e\n\u003cp\u003eHeavy breathing hissed through the line. \"Were you sleeping?\"\u003c/p\u003e\n\u003cp\u003e\"No. What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got a major problem.\"\u003c/p\u003e\n\u003cp\u003eDean closed his eyes and fought off another yawn. \"Join the club.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious. I was just served with a sexual misconduct charge, courtesy of a new patient.\"\u003c/p\u003e\n\u003cp\u003eDean sat bolt upright in bed, the covers sliding down his sculpted chest like snowpack on a warm car windshield. \"What?\" he said faintly, the cell phone amplifying his ragged breathing.\u003c/p\u003e\n\u003cp\u003eA paper rustled in the background. \"A patient I saw yesterday morning for the first time by the name of...Julie Donovan.\"\u003c/p\u003e\n\u003cp\u003eDean threw back the covers and got to his feet. \"Not that new girl you were talking about?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the one but I can assure you that nothing happened. You know I\u0027m all talk, Dean. I don\u0027t leave the house.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but...\"\u003c/p\u003e\n\u003cp\u003e\"She only wanted a cleaning, no anesthesia or gas or anything.\"\u003c/p\u003e\n\u003cp\u003eThe living room shook as Dean traipsed through it in his underwear like a drunken hobo, his hair sticking up in all directions. In the kitchen, he grabbed a cold bottle of water from the fridge. \"Who signed it?\"\u003c/p\u003e\n\u003cp\u003eShaun didn\u0027t reply.\u003c/p\u003e\n\u003cp\u003e\"The paperwork they gave you, who signed it at the bottom?\"\u003c/p\u003e\n\u003cp\u003eThe paper ruffled again. \"Some state health official by the name of Aaron Brewster. Why?\"\u003c/p\u003e\n\u003cp\u003eDean tipped the water back and drained half the bottle, extinguishing the fire in his throat. He swallowed, struggling for breath. \"Sugars had their liquor license yanked yesterday afternoon.\"\u003c/p\u003e\n\u003cp\u003eThere was a slight pause. \"Seriously?\"\u003c/p\u003e\n\u003cp\u003e\"The notice was signed by Megan\u0027s dad\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;Clay Crawford, the alderman guy.\"\u003c/p\u003e\n\u003cp\u003e\"Oh shit,\" Shaun said slowly. \"You don\u0027t think...\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s exactly what I think.\" Dean slammed the fridge shut with his foot. \"This prick is stepping on my neck until I get with the program.\"\u003c/p\u003e\n\u003cp\u003e\"What program?\"\u003c/p\u003e\n\u003cp\u003e\"The program with his pregnant daughter.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, hell no!\"\u003c/p\u003e\n\u003cp\u003eDean inhaled a long breath and held it. \"I confronted him about Sugars last night at his house.\"\u003c/p\u003e\n\u003cp\u003e\"What!\"\u003c/p\u003e\n\u003cp\u003e\"He insisted he had nothing to do with it but I know better, especially now. I\u0027m tellin you it\u0027s him.\"\u003c/p\u003e\n\u003cp\u003e\"But what\u0027d you say to him last night?\"\u003c/p\u003e\n\u003cp\u003eDean stopped in the living room, his heart pounding. \"I might have punched him right in the face.\"\u003c/p\u003e\n\u003cp\u003eShaun went silent.\u003c/p\u003e\n\u003cp\u003e\"It was an accident, and I didn\u0027t know he\u0027d go after you next. I didn\u0027t know he knew about Sugars, let alone you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re being tailed.\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s chest inflated. He glanced out the patio door to the parking lot.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re probably listening right now.\"\u003c/p\u003e\n\u003cp\u003eDean squeezed his eyes into slits, watching a black SUV pull in and park. \"I doubt it.\"\u003c/p\u003e\n\u003cp\u003e\"Your phone is bugged.\"\u003c/p\u003e\n\u003cp\u003e\"My phone is not bugged.\"\u003c/p\u003e\n\u003cp\u003e\"Mine probably is, too.\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t Person of Interest.\"\u003c/p\u003e\n\u003cp\u003e\"Then how\u0027d he know about me and Evy?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Dean, I don\u0027t need to tell you I could lose my practice over something like this, if I haven\u0027t already. This is the kind of thing that could end up making it difficult to land a job at Target during the holidays.\"\u003c/p\u003e\n\u003cp\u003eA lady wearing black slacks and a cream colored top climbed out of the SUV in high heels and unfastened a little girl from a car seat in the back. Dean exhaled a weary breath. \"Let me call you back.\"\u003c/p\u003e\n\u003cp\u003e\"Wait...\"\u003c/p\u003e\n\u003cp\u003eHe ended the call and stared at the picture of him and Evy at the ballpark, his thoughts nose-diving to the ground, the Earth rushing up at him in a furious hurry. Suddenly, winning Evy back was just one of his insurmountable hurdles. He needed to talk to her and kicked himself for not taking the opportunity last night. He closed his eyes, shutting everything out. There was no point in dragging her in any deeper and he knew it. Because of him her business was in jeopardy, and now so was Shaun\u0027s.\u003c/p\u003e\n\u003cp\u003eHis phone rang in his hand, startling him. His breath hitched when he saw the name on the bright screen. He took a deep breath and slapped his face, trying to clear the foggy mixture of sleep and anger from his head. \"Hey you,\" he answered warmly.\u003c/p\u003e\n\u003cp\u003e\"Hey yourself,\" Evy replied.\u003c/p\u003e\n\u003cp\u003eHe licked his lips, nearly smelling her perfume over the phone. \"How are you?\u0027\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been better.\"\u003c/p\u003e\n\u003cp\u003eHe snorted into the phone. \"Yeah, me too.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, Dean, I just wanted to apologize for...shutting you out over this whole Megan thing.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to apologize, Evy, believe me if anyone should be...\"\u003c/p\u003e\n\u003cp\u003e\"Please, let me finish?\"\u003c/p\u003e\n\u003cp\u003eHe swallowed his words and sucked in another deep breath to calm his racing pulse.\u003c/p\u003e\n\u003cp\u003e\"I had no right to do that. This isn\u0027t your fault,\" her voice cracked.\u003c/p\u003e\n\u003cp\u003eHer words melted his heart. \"I don\u0027t care about what happened in the past, all I care about is what will happen in the future.\"\u003c/p\u003e\n\u003cp\u003eShe paused just long enough to make his world sputter. \"I agree.\"\u003c/p\u003e\n\u003cp\u003e\"And without you...there is no future.\"\u003c/p\u003e\n\u003cp\u003eThere was a light sob. \"You don\u0027t know how glad I am to hear you say that.\"\u003c/p\u003e\n\u003cp\u003eRelief flooded his system. \"I need to see you before I go crazy.\"\u003c/p\u003e\n\u003cp\u003e\"When?\"\u003c/p\u003e\n\u003cp\u003e\"Now.\"\u003c/p\u003e\n\u003cp\u003eAnother sniffle.\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"At Sugars.\"\u003c/p\u003e\n\u003cp\u003eHis eyebrows drew together as Clay\u0027s words flittered through his mind. \"Did the city rescind Sugars\u0027 notice yet?\"\u003c/p\u003e\n\u003cp\u003eSilence briefly took the line. \"No, why? Did you talk to someone?\" she asked, her tone light and hopeful.\u003c/p\u003e\n\u003cp\u003eHe cringed and checked his watch. There was still time. \"I did, but...\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"An alderman, but I don\u0027t know how much pull he\u0027s going to have. He said he might deal with it today.\"\u003c/p\u003e\n\u003cp\u003eThere was another pause as his words sank in.\u003c/p\u003e\n\u003cp\u003e\"Dean?\"\u003c/p\u003e\n\u003cp\u003eHis blood pounded thickly in his temples. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Hurry, okay?\"\u003c/p\u003e\n\u003cp\u003eHe bit his lower lip. \"Let me grab a quick shower and I\u0027ll be right there.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you at work?\"\u003c/p\u003e\n\u003cp\u003e\"Took the day off.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she replied faintly, her voice just above a whisper. \"See you soon?\"\u003c/p\u003e\n\u003cp\u003eSomeone knocked loudly on his front door. His head snapped around to it. \"Very soon.\"\u003c/p\u003e\n\u003cp\u003eDean hung up and crept to the door, looked out the peephole with one eye closed. His heart rate shot up. Clay stood there looking back, a smirk covering his face like he could see Dean in his underwear. He tiptoed back into the bedroom and traded out his cell phone for a pair of gym shorts lying on a chair.\u003c/p\u003e\n\u003cp\u003eAnother persistent knock made him forget about grabbing a shirt. He threw the shorts on and tromped across the living room in his bare feet, dying to know what this was all about. He yanked the door back and his adrenaline spiked when an elderly man in a black suit stepped out from around the corner.\u003c/p\u003e\n\u003cp\u003eClay lifted his brow. \"Hello, Dean.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s this?\" Dean nodded to the bald man wearing dark framed glasses.\u003c/p\u003e\n\u003cp\u003eClay adjusted his necktie and grinned. \"Sorry to drop in on you like this. Do you have a moment?\" he smiled, ignoring the question and clasping his hands in front of his pinstriped suit.\u003c/p\u003e\n\u003cp\u003eDean blinked, his mind whirling to explain the unexpected visit. He turned for his bedroom and left the door open to go throw on a t-shirt and pair of sneakers while Clay and the other man let themselves in.\u003c/p\u003e\n\u003cp\u003e\"Nice place,\" Clay said, surveying the condo while his friend shut and locked the door.\u003c/p\u003e\n\u003cp\u003eDean came back into the living room and jerked his chin to the other man. \"This your lawyer?\"\u003c/p\u003e\n\u003cp\u003eClay exchanged glances with the man and chuckled. \"This is Mr. Ryder. He\u0027s an...associate of mine who hopes to help us come to some sort of an agreement.\"\u003c/p\u003e\n\u003cp\u003eDean ran a hand through his hair, attempting to smooth his nappy bed head. \"Agreement?\"\u003c/p\u003e\n\u003cp\u003eClay gestured to the couch. \"Do you mind?\"\u003c/p\u003e\n\u003cp\u003eDean shrugged his shoulders and watched Clay unbutton his coat and take a seat. Mr. Ryder remained standing, his hands folded in front of him like he was Secret Service, annoying Dean with his mechanical presence. \"Can I get you something to drink?\" he asked Mr. Ryder. \"Maybe some prune juice or Metamucil?\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder stared blankly at him through dead eyes, lacking humor as much as he did color.\u003c/p\u003e\n\u003cp\u003eDean snorted and turned back to Clay, honing his gaze to a razor\u0027s edge. \"What do you know about Shaun Morris?\"\u003c/p\u003e\n\u003cp\u003eClay stretched an arm out along the back of the couch and crossed his legs like a girl. \"I know he\u0027s going to have to take up a new line of work.\" He winked at Mr. Ryder, a sinister grin sliding across his smoothly shaven face.\u003c/p\u003e\n\u003cp\u003eAngry butterflies exploded in Dean\u0027s gut, turning his insides to mush. He clenched his teeth and curled his hands into fists. \"What did you do?\" he whispered.\u003c/p\u003e\n\u003cp\u003eClay raised his eyebrows into the middle of his forehead. \"What I had to do to protect my family, Dean.\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder watched Dean like a hawk. Dean wasn\u0027t even sure the old fart was breathing.\u003c/p\u003e\n\u003cp\u003e\"You sonofabitch,\" Dean hissed, taking a step toward Clay.\u003c/p\u003e\n\u003cp\u003eMr. Ryder responded, stepping forward and positioning himself between Dean and Clay.\u003c/p\u003e\n\u003cp\u003e\"Careful Dean, you don\u0027t want to antagonize Mr. Ryder here,\" Clay said smugly, lifting his chin. \"He can tend to get a bit melodramatic.\"\u003c/p\u003e\n\u003cp\u003eDean glared at Mr. Ryder, who stared back with indifferent eyes. Dean couldn\u0027t stop a chuckle. \"Maybe some Activia would help.\"\u003c/p\u003e\n\u003cp\u003eClay tossed his head back and howled with laughter. \"You\u0027re a funny guy, Dean.\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder, however, didn\u0027t crack a smile.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this all about?\" Dean asked, tightening his fists and making a vein bulge out along his biceps.\u003c/p\u003e\n\u003cp\u003eClay\u0027s amusement sobered. His cold eyes tightened and he spoke gravely. \"I want you to start being a man and live up to your responsibilities, like we talked about in your office.\"\u003c/p\u003e\n\u003cp\u003eDean tilted his head to one side.\u003c/p\u003e\n\u003cp\u003e\"You got my daughter pregnant and now it\u0027s time to play ball or I will crush you and everyone you know into tiny little pieces.\"\u003c/p\u003e\n\u003cp\u003eDean tried hiding the incredulous look warping his face and lost the battle. \"Why are you doing this?\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Because I\u0027m running for mayor, and then I\u0027ll run for congress, and you are not going to fuck that up for me! I cannot have a pregnant, unmarried daughter on my hands. No, let me rephrase that...I won\u0027t have a pregnant, unmarried daughter on my hands. It would kill me in the polls and I\u0027ll be damned if I\u0027ll let some horny pretty boy think he can screw my daughter and walk away scot-free when the shit hits the fan!\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s chest quivered beneath his red t-shirt. Sweat formed on his upper lip during a dumbfounded silence as a new realization settled in like a cold winter\u0027s night.\u003c/p\u003e\n\u003cp\u003eClay leaned forward and rested his elbows on his knees. \"I\u0027m going to be frank with you, Dean.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, please do.\"\u003c/p\u003e\n\u003cp\u003e\"This is what\u0027s going to happen. You are going to man up and marry my daughter or I will ruin everyone you know, including your little law firm.\"\u003c/p\u003e\n\u003cp\u003eDean laughed sharply. \"You overestimate your power, Alderman!\"\u003c/p\u003e\n\u003cp\u003eClay feigned a hurtful look. \"Do I? Perhaps you should seek a second opinion on that. Maybe Evy or Shaun would have a different outlook.\"\u003c/p\u003e\n\u003cp\u003e\"You leave them out of this!\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder shifted in his stance, not taking his dead eyes off of Dean.\u003c/p\u003e\n\u003cp\u003e\"Little late for that, Deano,\" Clay chuckled, leaning back into the couch and crossing his legs again. \"Now, if you do the right thing, and make an honest woman out of Megan, I will reinstate Sugars\u0027 liquor license and I won\u0027t go after Shaun\u0027s wife next.\"\u003c/p\u003e\n\u003cp\u003eDean gasped out loud, his world falling apart at the seams.\u003c/p\u003e\n\u003cp\u003eAn innocent frown shaped Clay\u0027s lips. \"Be a shame if they lost their jobs at the same time, especially with such a nice family and house to look after.\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s breath came in short spurts that didn\u0027t make a dent. \"You wouldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Not if you play ball.\"\u003c/p\u003e\n\u003cp\u003e\"What about Shaun?\"\u003c/p\u003e\n\u003cp\u003eClay picked a piece of lint from his slacks and let it lazily float to the floor. \"I\u0027m afraid it\u0027s too late for your friend. What\u0027s done is done, there\u0027s no going back once a sexual misconduct charge is filed. However, I will get the charge dropped but I\u0027m afraid it\u0027ll still make the news.\" An ominous grin unfolded across his face. \"He\u0027ll be lucky to be working at Burger King next quarter.\"\u003c/p\u003e\n\u003cp\u003eIt felt like steam was jutting from Dean\u0027s ears. \"You fucker!\" he yelled, rushing Clay.\u003c/p\u003e\n\u003cp\u003eMr. Ryder knocked him off his feet in midstride, sending him crashing into the patio door. Dean crumbled to the floor and turned to the old man, stunned by his quickness. Dean got to his feet, weighing his options as Mr. Ryder calmly clasped his hands in front of him again, clearly ready for more.\u003c/p\u003e\n\u003cp\u003eClay flashed a cocky grin. \"Pretty strong for an old timer, huh?\"\u003c/p\u003e\n\u003cp\u003eDean glared at Mr. Ryder through wild eyes. \"Not bad,\" he said, charging the old man with a determined battle cry.\u003c/p\u003e\n\u003cp\u003eMr. Ryder deflected Dean\u0027s advance and spun him to the ground, twisting an arm behind his back until it nearly snapped off. Dean cried out in pain as Mr. Ryder sinuously planted a knee in the back of his neck like a cop. He pulled a switchblade from a coat pocket and hit a button on the side. The cold blade flung open and dug into Dean\u0027s cheek, Mr. Ryder\u0027s sour breath washing over him in warm waves.\u003c/p\u003e\n\u003cp\u003e\"Easy Ryder,\" Clay warned. \"Megan will have a shit-fit if that pretty face gets messed up.\"\u003c/p\u003e\n\u003cp\u003eRyder hesitated and clicked the blade back inside the knife, got off Dean and automatically resumed his concrete stance. Dean scrambled to his feet, favoring his arm and hitting the old man with a chilly glare.\u003c/p\u003e\n\u003cp\u003eClay tossed Dean a small black box, which Dean bobbled before catching. \"I figured you might not have time for shopping so I took the liberty for you.\"\u003c/p\u003e\n\u003cp\u003eDean studied the tiny box in his hand, his chest rising and falling.\u003c/p\u003e\n\u003cp\u003e\"I also made a reservation for you at the Lake Park Bistro for eight o\u0027clock tonight, where you will drop onto one knee in front of the entire restaurant and ask for my daughter\u0027s hand in marriage.\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s wide eyes jerked back to Clay.\u003c/p\u003e\n\u003cp\u003eClay got to his feet and straightened his coat. \"And if you don\u0027t,\" he said, smiling at Mr. Ryder, \"well, I think we\u0027ve made ourselves clear.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be serious,\" Dean said faintly.\u003c/p\u003e\n\u003cp\u003eClay\u0027s eyebrows dipped together. \"I think you already know the answer to that.\" He pulled an envelope from an inside pocket and handed it to Dean. \"And since we don\u0027t have time to plan a big fancy wedding, nor do we want to draw any more attention to this matter than necessary, here are two tickets to Hawaii where you two crazy lovebirds will elope and spend the next week having fun in the sun. Your flight leaves at ten o\u0027clock tomorrow morning.\"\u003c/p\u003e\n\u003cp\u003eDean stood speechless, his ears ringing in the unsettling silence between them.\u003c/p\u003e\n\u003cp\u003e\"Mr. Ryder will be watching, so don\u0027t be late.\"\u003c/p\u003e\n\u003cp\u003eDean shuddered at the thought. \"You\u0027re fuckin crazy,\" he muttered.\u003c/p\u003e\n\u003cp\u003eClay laughed. \"You have to be to run for office these days, Dean!\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t just take off from work with no notice!\"\u003c/p\u003e\n\u003cp\u003eClay\u0027s smile slid down his face, leaving a bitter expression in its wake. \"You\u0027ll be taking off a lot more than a week if you don\u0027t.\" He paused to button his coat. \"Did you know that negligence shutters one in twenty law firms in the United States each year?\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s incredulous gaze narrowed, blood rushing through his veins.\u003c/p\u003e\n\u003cp\u003eClay snorted. \"It\u0027s a damn shame, too, but what\u0027re you going to do? Everyone is sue happy these days.\" He flashed his million dollar smile, his white teeth twinkling in the sunlight streaming through the windows, and turned for the front door. Mr. Ryder maintained his post while Clay grabbed the doorknob.\u003c/p\u003e\n\u003cp\u003e\"Oh and one more thing,\" Clay said, turning back around.\u003c/p\u003e\n\u003cp\u003eDean\u0027s eyebrows furrowed. He could only imagine what would come out of Clay\u0027s mouth next. He was so focused on Clay he never saw Mr. Ryder strike him in the gut, driving the air from his lungs and dropping him to his knees. The black box and envelope tumbled with him to the floor as he gasped for air that wouldn\u0027t come.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s for assaulting me in my own home in front of my family,\" Clay said calmly, watching Dean writhe in pain on the floor with great satisfaction as he cinched his silken tie. \"Look at me when I\u0027m talking to you!\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder grabbed a fistful of Dean\u0027s hair and yanked his face upward.\u003c/p\u003e\n\u003cp\u003eClay towered over Dean like a giant. \"You fail to meet any part of our agreement, or tell a living soul about any of this, and I\u0027ll let Mr. Ryder here off his leash.\"\u003c/p\u003e\n\u003cp\u003eRyder broke protocol and cracked an evil grin before dropping Dean\u0027s head back to the carpet.\u003c/p\u003e\n\u003cp\u003eClay jerked his chin to the bedroom. \"Check his phone.\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder waltzed into the bedroom and snatched the phone from the chair, flipping through screens like it was his own. He looked up and shook his head. \"It\u0027s clean.\"\u003c/p\u003e\n\u003cp\u003eClay turned to Dean with a smirk. \"Hate to find out you were recording any of this.\" He checked his silver Rolex and went to the front door. \"Call Megan and tell her you will pick her up at seven-thirty,\" he said with a casual tone, pulling the door open. \"Oh, and whatever you do,\" he said, turning back with a polite smile, \"you two kids have fun now. Ya hear?\"\u003c/p\u003e\n\u003cp\u003eMr. Ryder coolly adjusted his black tie and followed Clay out into the hallway, disappearing around the corner without shutting the door. Small sips of air scratched their way down Dean\u0027s throat, into his lungs. He crawled to the open door and was about to shut it when the old lady from upstairs passed by with mail in her hands. She stopped dead in her tracks, her eyes widening in dismay. Dean slammed the door shut in her contorted face and leaned against it with his legs stretched out before him, fighting to catch his breath. His mind raced like the wind, trying to hang onto anything remotely close to sanity and coming up way short.\u003c/p\u003e\n\u003cp\u003eHe forced himself to his feet. His gut wrenched with the movement, his lungs burning from the vicious blow. He bent over, grimacing with the pain, and picked up the black box. There was a light click when he cracked it open. The sparkling diamond nestled inside was staggering. Dean squinted with the sunlight reflecting off its polished cuts and snapped the box shut. The envelope held two airline tickets and seeing his and Megan\u0027s names in print made his gut hurt worse than moving. He looked up and stared through the patio door, imagining Megan lying next to him on a white sandy beach, her impressive ring twinkling in the sunshine as waves crashed around them. Evy\u0027s face whisked through his foggy mind, leaving entrails of smoke spiraling behind. He swallowed thickly. It should have been them. \u003c/p\u003e","sourceLink":"https://allnovel.net/fate-interrupted-fate-interrupted-1/page-12.html","bookId":1872,"creation":"Oct 5, 2019 4:47:22 PM","modification":"Oct 5, 2019 4:47:22 PM"}
