{"id":82817,"no":5,"title":"Page 5","content":"\u003cp\u003eThe next morning was overcast and dreary, in direct contrast to what Evy was feeling inside. The air was wet with drizzle and tasted sweeter than ever before. Everything looked magical, like seeing it for the first time through a child\u0027s eyes. The birds sang out from above, their spiraling trills music to her ears. A Monarch butterfly flittered along and accompanied her through a quiet stretch of downtown, before pulling over at a purple coneflower for breakfast. Even the bums looked peaceful, like they had recently showered and shaved. A thin man with a bushy gray beard leaned against a closed up liquor store. He tipped his tattered cap and returned her warm smile. She told him good morning and started to hum.\u003c/p\u003e\n\u003cp\u003eEvy had already tried thinking about something else, anything to keep the titillating distraction of Dean Jacobs at bay, but it was too much work. She shook her head, ashamed for letting some strange guy pull her thoughts from Sugars. It was her baby and here she was already thinking about something else. She owed it to Brooke and Ben to stay focused. It was their baby, too.\u003c/p\u003e\n\u003cp\u003eShe rounded the corner as the early morning sun began peeking out from the rolling clouds, her upbeat mood seeming to give the burning star the extra boost it needed. Her pulse quickened when she saw the spot where they had kissed last night in front of Sugars. She could still feel his warm lips on hers, his hands gently exploring her trembling body, the smell of his cologne stirring her hormones into a whirlwind. She fumbled through her keys and unlocked the glass door, ringing the bell when she pushed through.\u003c/p\u003e\n\u003cp\u003eBrooke looked up from a square table where she was wrapping silverware inside burgundy-colored silk napkins that had cost them a fortune.\u003c/p\u003e\n\u003cp\u003e\"Sorry I\u0027m late.\"\u003c/p\u003e\n\u003cp\u003eBrooke set a completed roll inside a gray bus tub, a sly grin pilfering her expression. \"Well, well, well, I don\u0027t think I\u0027ve ever seen anyone look so good to bake cupcakes and turnovers.\" Brooke crossed her arms and eyeballed Maris from top to bottom. \"Expecting a visitor today?\"\u003c/p\u003e\n\u003cp\u003e\"I heard Ryan Gosling is in town filming the next Bridesmaids,\" Evy replied sarcastically, going behind the counter.\u003c/p\u003e\n\u003cp\u003eBrooke\u0027s shit-eating grin plunged into her lap. She sprang to her feet and followed her sister into the kitchen. \"Don\u0027t even joke around about something like that, Evy! We\u0027ll close up shop for the day and go watch.\" She trailed Evy into the tiny office and watched her deposit her purse onto a wooden chair with wheels. \"So, how\u0027d it go last night?\" Brooke asked, leaning against the door frame.\u003c/p\u003e\n\u003cp\u003e\"It went good,\" Evy answered, lacking conviction in her voice while flipping through some recently opened bills.\u003c/p\u003e\n\u003cp\u003e\"Just good?\"\u003c/p\u003e\n\u003cp\u003e\"It was...\" Evy trailed off for a few seconds as an image of Dean\u0027s soft lips slipped through her mind. \"...pretty good. We weren\u0027t out long.\"\u003c/p\u003e\n\u003cp\u003e\"No?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eBrooke nodded slowly. \"So did you take my advice?\"\u003c/p\u003e\n\u003cp\u003eEvy looked up from the bills and narrowed her eyes.\u003c/p\u003e\n\u003cp\u003e\"Ya know, did you put frosting on his cock and blow his doors off? I left it sitting out on the counter last night.\" She gestured to the kitchen behind her without looking.\u003c/p\u003e\n\u003cp\u003eEvy dropped the bills back to the desk and tried not to laugh. \"No, Brooke I did not put frosting on his cock and blow his doors off,\" she said, pulling her hair back into a ponytail. \"Where do you even come up with this stuff?\"\u003c/p\u003e\n\u003cp\u003e\"With Ben,\" she grinned. \"Why do you think we\u0027re always low on whip cream?\"\u003c/p\u003e\n\u003cp\u003e\"Ewe,\" Evy squealed, shaking off a sudden case of the creeps and pushing past Brooke.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, we always sanitize everything when we\u0027re done.\" Brooke added, following her back up front where the morning sun was starting to come through the windows. \"Oh my God! Don\u0027t tell me he has a banana dick! I knew he was too perfect.\"\u003c/p\u003e\n\u003cp\u003eEvy stopped behind the bowed case of tarts, apple strudel coffee cake squares and frosted pumpkin bars. \"What? No!\"\u003c/p\u003e\n\u003cp\u003eBrooke stepped closer, studying her sister through grave eyes, and lowered her voice. \"Did you sleep with him? Tell me the truth.\"\u003c/p\u003e\n\u003cp\u003e\"No, I did not sleep with him.\"\u003c/p\u003e\n\u003cp\u003e\"Then how do you know he doesn\u0027t have a banana dick?\"\u003c/p\u003e\n\u003cp\u003eEvy threw her head back and laughed. \"I don\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"Well, you better find out, because that\u0027s a deal breaker.\"\u003c/p\u003e\n\u003cp\u003eEvy pulled a black apron over her head and tied it behind her back. \"I\u0027ll be sure to get right on that, Brooke,\" she scoffed, finishing the bow with a solid tug.\u003c/p\u003e\n\u003cp\u003eBrooke leaned up against a counter already supporting a fancy espresso machine. \"That was the first thing I checked on Ben.\"\u003c/p\u003e\n\u003cp\u003e\"Why doesn\u0027t that surprise me?\" Evy mumbled, firing up the heavy duty espresso and coffee machines.\u003c/p\u003e\n\u003cp\u003e\"So...did you at least kiss him?\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003eBrooke took a few seconds to study Evy\u0027s face. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" Evy replied, pulling some empty trays from the glass case and closing it back up.\u003c/p\u003e\n\u003cp\u003e\"Not even one little smooch?\"\u003c/p\u003e\n\u003cp\u003e\"Not a one,\" Evy replied smugly, whisking back into the kitchen.\u003c/p\u003e\n\u003cp\u003eBrooke followed her like a shadow and watched Evy dump the empty trays into a large sink with an industrial sprayer mounted above it. \"I think there\u0027s something you should see.\"\u003c/p\u003e\n\u003cp\u003eEvy started rinsing the trays off. \"And what\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"Come and see.\"\u003c/p\u003e\n\u003cp\u003eEvy looked over her shoulder and stopped the sprayer. \"See what?\"\u003c/p\u003e\n\u003cp\u003eBrooke nodded toward the office and started walking. Evy sighed and followed, drying her hands on her apron. Brooke took a seat in the chair behind the desk and flipped on a computer monitor as Evy came around and sat on the desk\u0027s edge. Brooke shot her a sardonic look and hit play. The monitor blinked to life, jerking a grainy image into focus.\u003c/p\u003e\n\u003cp\u003eEvy inhaled sharply, the blood rushing to her head turning her face beet red. \"Oh my God!\"\u003c/p\u003e\n\u003cp\u003eBrooke turned back to the screen just in time to see Dean yank Evy\u0027s head back by her ponytail.\u003c/p\u003e\n\u003cp\u003eEvy watched in horror, her hands over her mouth. \"Turn it off!\" she said, watching their lips mingle with a passion on the screen that still gave her the goose bumps. The grainy color video sucked her in, taking her back to last night with its regalia of flickering lights and mind numbing explosions. Her insides turned to mush and she tried to look away but couldn\u0027t as Dean cradled her cheek and inhaled her in. It was euphoric and made her wet between the legs. She wanted him and wanted him now. The way he looked into her eyes when they pulled apart tugged at her heart.\u003c/p\u003e\n\u003cp\u003eBrooke pointed to the screen. \"Is that a boner?\"\u003c/p\u003e\n\u003cp\u003e\"No!\" Evy snapped, reaching over and shutting off the monitor.\u003c/p\u003e\n\u003cp\u003eBrooke leaned back in the chair and interlocked her fingers behind her head. \"Thought you said you didn\u0027t kiss him.\"\u003c/p\u003e\n\u003cp\u003eEvy pointed to the screen. \"That is an invasion of my privacy!\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you let him go all the way?\"\u003c/p\u003e\n\u003cp\u003eEvy stormed out of the office in a huff with Brooke hot on her heels. \"We just met.\"\u003c/p\u003e\n\u003cp\u003eBrooke threw her arms out. \"Hey, at least you let him get a little boob.\"\u003c/p\u003e\n\u003cp\u003e\"Brooke,\" Evy groaned.\u003c/p\u003e\n\u003cp\u003e\"Evy, that was the sweetest thing I\u0027ve ever seen. It was like a movie.\"\u003c/p\u003e\n\u003cp\u003eEvy grabbed the sprayer but didn\u0027t squeeze the handle, staring down at the dirty trays in the sink through faraway eyes. \"It was a mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me?\" Brooke gasped. \"How can that be a mistake?\" She pointed to the scene of the crime. \"I haven\u0027t seen that much passion since I drank an entire bottle of wine by myself and watched Dear John!\"\u003c/p\u003e\n\u003cp\u003eEvy exhaled slowly and squeezed the sprayer, blasting frosting and crumbs from the yellow trays with steaming hot water. \"He\u0027s a player, Brooke. You should\u0027ve seen the girls falling all over him last night,\" she said, placing the trays into a plastic green rack. \"I bet he\u0027s slept with half the women in this town.\"\u003c/p\u003e\n\u003cp\u003eBrooke threw her hands out in frustration. \"Exactly! Which means he\u0027s good in bed!\"\u003c/p\u003e\n\u003cp\u003eEvy rolled her eyes and slid the green rack into a silver dishwasher, pulled the roll-top door down and pressed a green button on its side, igniting a loud hum inside as the machine began its soaking cycle. \"It\u0027s not a good time. I need to stay focused on this place.\"\u003c/p\u003e\n\u003cp\u003eBrooke stepped closer and took her sister\u0027s hand, their eyes meeting. \"Honey, listen, you are more than capable of handling two things at one time.\"\u003c/p\u003e\n\u003cp\u003e\"I know I am, but I just don\u0027t...\"\u003c/p\u003e\n\u003cp\u003e\"Evy, sweetie, you can\u0027t go around thinking everyone is a jerk-off like Richie because they\u0027re not. Trust me.\" Evy opened her mouth to protest but Brooke pressed a finger to her lips. \"Richie was your high school sweetheart who never grew up. He was like Peter Pan with a little tiny peter. You said it yourself.\"\u003c/p\u003e\n\u003cp\u003eEvy frowned and tried to pull her hand back.\u003c/p\u003e\n\u003cp\u003eBrooke tightened her grip. \"Now is the time to start taking some chances. Sugars is doing awesome and, let\u0027s face it, you\u0027re not getting any younger.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, you can\u0027t go around letting one asshole rule your destiny because you\u0027re afraid it will happen again.\" The dishwasher kicked into a different gear and Brooke squeezed Evy\u0027s hand and pulled her into the middle of the room. \"Leave the past in the past and just use Dean for mind-blowing sex. That way you won\u0027t get hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Brooke, you know I\u0027m not good with one night stands. They\u0027re so awkward.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve told you this a thousand times - always have a cab company in your phone, always go to their place, and always leave when they\u0027re sleeping.\"\u003c/p\u003e\n\u003cp\u003e\"What if they wake up?\"\u003c/p\u003e\n\u003cp\u003eBrooke sighed. \"Who cares? Most of em are just thankful you\u0027re leaving and pretend they\u0027re asleep.\"\u003c/p\u003e\n\u003cp\u003eEvy inhaled a deep breath, her eyes roaming the kitchen without seeing the kitchen, and exhaled slowly.\u003c/p\u003e\n\u003cp\u003e\"This is how you get good, Evy. Everyone does it.\"\u003c/p\u003e\n\u003cp\u003eEvy envisioned Dean on top of her, his sweat running onto her swollen breasts.\u003c/p\u003e\n\u003cp\u003eBrooke leaned in close to Evy\u0027s ear and lowered her voice. \"You don\u0027t have to marry the guy. Just sit back and enjoy the ride.\"\u003c/p\u003e\n\u003cp\u003eEvy shook her head, hating it when her sister was right.\u003c/p\u003e\n\u003cp\u003e\"And by that I mean I want you to fuck his brains out.\"\u003c/p\u003e\n\u003cp\u003eEvy laughed out loud and crossed over to a dry goods rack on the other side of the room.\u003c/p\u003e\n\u003cp\u003eBrooke watched Evy fill her arms with boxes of straws, napkins and candles. \"You\u0027re still on the pill, right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Evy replied dully, heading for the swinging door. \"Not that it\u0027s any of your business.\"\u003c/p\u003e\n\u003cp\u003e\"Then I want you to whip out his giant cock and fuck him ten ways to Sunday until you\u0027ve gained fifteen pounds from his salty semen!\"\u003c/p\u003e\n\u003cp\u003eEvy pushed through the door and stopped in her tracks. Brooke crashed into her from behind and poked her head around, gaping at the slack jawed man staring back from the other side of the counter. He tipped a white peaked cap at them with an uneasy smile. \"Mornin.\"\u003c/p\u003e\n\u003cp\u003e\"Oops,\" Brooke murmured.\u003c/p\u003e\n\u003cp\u003e\"I...just need a signature.\" He nodded to the dolly of stacked milk crates next to him.\u003c/p\u003e\n\u003cp\u003eEvy dropped her load onto a counter and rushed over to sign the man\u0027s electronic tablet. \"Thank you,\" she smiled, her face flushing as much as his.\u003c/p\u003e\n\u003cp\u003eHe looked from Evy to Brooke in a staggered moment of silence before wheeling the cart back to the walk-in cooler.\u003c/p\u003e\n\u003cp\u003eEvy turned a pointed glare to Brooke, who quietly shrugged in response.\u003c/p\u003e\n\u003cp\u003e\"Nice job locking the door,\" Brooke whispered, glancing into the kitchen. \"He could\u0027ve been a serial rapist.\"\u003c/p\u003e\n\u003cp\u003e\"See? I\u0027m forgetting stuff already. I can\u0027t get mixed up with anyone right now.\"\u003c/p\u003e\n\u003cp\u003eBrooke stepped closer, gritting her teeth. \"I am telling you right now...if you don\u0027t get some of Dean\u0027s big hard dick, someone else will. Guys like that don\u0027t stay on the market for long.\"\u003c/p\u003e\n\u003cp\u003e\"So I\u0027ve heard,\" Evy muttered.\u003c/p\u003e\n\u003cp\u003e\"He likes you, Evy,\" Brooke moaned. \"The least you could do is let him eat you out.\"\u003c/p\u003e\n\u003cp\u003e\"I really like what you\u0027ve done with...\" the milk man trailed off, coming back up front with his empty dolly, \"the place.\" He cleared his throat. \"If you ever need any help...changing a light bulb or anything, I\u0027m always around.\"\u003c/p\u003e\n\u003cp\u003eThey stared at him with blank expressions. He stretched his lips into a tightlipped smile and rolled the dolly toward the front door, a squeaky wheel loudly protesting along the way.\u003c/p\u003e\n\u003cp\u003eHe turned at the door and swallowed thickly. \"Okay, sounds good then. Have a nice day.\" He used his butt to push on the door, which didn\u0027t budge, and quickly realized he had to pull to get out. With another tip of his hat, he flashed them a sheepish smile and stumbled outside.\u003c/p\u003e\n\u003cp\u003eThey watched him hop up into a boxy truck and speed away, crop-dusting the sidewalk with gray fumes.\u003c/p\u003e\n\u003cp\u003eBrooke snorted. \"We\u0027re going to need a louder bell.\"\u003c/p\u003e\n\u003cp\u003eDark clouds rolled in during the afternoon, reclaiming the sun and bathing the day in a foreboding grayness that drained everything of its color. Dean shut the door on his Jeep Grand Cherokee and started across the parking lot with last night\u0027s events replaying through his mind like a broken record. It took everything he had not to call Evy right now. He was dying to know if she had even given him her real number, but mainly he just wanted to hear her voice again. He kicked a rock across the pavement, still not convinced he wasn\u0027t coming down with something. Normally, the last thing he wanted to do the day after a date was talk to them on the phone.\u003c/p\u003e\n\u003cp\u003eA wide smile crept across the hostess\u0027 pretty face when Dean stepped through the double glass doors. The cool air conditioning washed over him as she pulled a menu from a nearby stack without breaking eye contact. \"Just one today?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m meeting some friends,\" he answered, glancing around the crowded room. The place suddenly exploded into wild cheers and applause as the Milwaukee Brewers drove in another run on the many flat screens lining the tall walls. \"They\u0027re probably outside.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go take a look,\" she smiled coyly, leading him across the buzzing room.\u003c/p\u003e\n\u003cp\u003eHe scanned the absorbed faces and couldn\u0027t imagine concentrating on a baseball game right now, which only fueled his suspicions he had contracted some form of a debilitating virus. He loved Brewers games but today they seemed like background music at best. He followed the hostess outside onto a spacious patio, the sports bar\u0027s clamor fading as the door slowly swung shut behind them. Shaun waved from the far side where he sat with Jon.\u003c/p\u003e\n\u003cp\u003e\"Over there.\"\u003c/p\u003e\n\u003cp\u003eShe followed Dean\u0027s gaze and continued their trek.\u003c/p\u003e\n\u003cp\u003e\"There he is!\" Shaun bellowed, dropping a balled up napkin onto a pile of others. \"The man, the myth, the urban legend!\"\u003c/p\u003e\n\u003cp\u003eThe hostess set the menu on the table in front of Dean. \"Is there anything else I can get you?\" she asked, batting her lashes while awaiting his next command.\u003c/p\u003e\n\u003cp\u003e\"IPA on tap?\"\u003c/p\u003e\n\u003cp\u003eA grin sliced across her youthful face, clearly pleased to be making a return trip. \"I\u0027ll be right back.\" She turned for the door without asking Shaun or Jon if they needed anything and cut through the spattering of tables and chairs.\u003c/p\u003e\n\u003cp\u003eShaun watched her go, munching on a maple-honey-hot wing. A brownish red sauce lined his lips, making them look bigger than normal. \"How do you do it?\"\u003c/p\u003e\n\u003cp\u003eDean glanced over his shoulder, catching a parting shot of the girl\u0027s tight little butt. \"It\u0027s a gift.\"\u003c/p\u003e\n\u003cp\u003e\"God, I\u0027d like to hit that,\" Shaun whispered, taking a sip of his beer. \"If I had a get-out-of-jail-free card I\u0027d use it on her in a heartbeat.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m recording this entire conversation,\" Dean said.\u003c/p\u003e\n\u003cp\u003e\"No you\u0027re not.\"\u003c/p\u003e\n\u003cp\u003e\"Gonna play it back for Carrie later tonight.\"\u003c/p\u003e\n\u003cp\u003e\"No you\u0027re not.\"\u003c/p\u003e\n\u003cp\u003e\"Nice!\" Jon said, pumping a fist while focusing on one of the three flat-screens hanging beneath the striped awning. \"Brewers are going all the way this year, fellas! Hear me now, believe me later.\"\u003c/p\u003e\n\u003cp\u003eShaun paid the game no attention, keeping his eyes glued to Dean. \"So, how\u0027d it go with you last night? I heard ya ghosted Jon at the club.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, what\u0027s up with that?\" Jon said, not taking his eyes from the TV. \"Never leave your wingman, yo!\"\u003c/p\u003e\n\u003cp\u003eShaun slowly shook his head in disgust. \"Never leave your wingman, yo.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, but Becky showed up and scared off Evy,\" Dean said, stealing a drink from Jon\u0027s beer while he wasn\u0027t looking. \"It wasn\u0027t pretty.\"\u003c/p\u003e\n\u003cp\u003eJon\u0027s Brewers t-shirt bounced on his shoulders when he shrugged. \"It\u0027s all good. I ended up pulling both of those hotties I was dancing with anyway.\"\u003c/p\u003e\n\u003cp\u003eDean scrunched his face up. \"Seriously?\"\u003c/p\u003e\n\u003cp\u003eJon finally turned to him with a shit-eating grin. \"You\u0027re not the only playa in town, dude.\"\u003c/p\u003e\n\u003cp\u003e\"What about you?\" Shaun asked, biting into another wing and looking at Dean. \"Did you pull?\"\u003c/p\u003e\n\u003cp\u003e\"I did not.\"\u003c/p\u003e\n\u003cp\u003eA heavy frown stole across Jon\u0027s face. \"What? Are you getting sick or something?\"\u003c/p\u003e\n\u003cp\u003e\"Holy shit, he must be in love! Deano never lets em get away.\"\u003c/p\u003e\n\u003cp\u003eJon fanned a hand through the air and turned back to the TV. \"He\u0027s not in love.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know man, you shoulda seen the way he was drooling all over this girl last weekend at Panera.\"\u003c/p\u003e\n\u003cp\u003eDean leaned back in his chair and massaged his face with both hands, unable to even respond to something so ridiculous.\u003c/p\u003e\n\u003cp\u003eShaun swallowed. \"You wanna talk about it, big baller?\"\u003c/p\u003e\n\u003cp\u003eDean pulled his face from his hands and found Shaun\u0027s expectant eyes. \"Talk about what?\"\u003c/p\u003e\n\u003cp\u003e\"What you\u0027re feeling.\"\u003c/p\u003e\n\u003cp\u003eDean laughed out loud, his face flushing with nowhere to hide.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t do it, Deano,\" Jon said, locking his fingers behind his head and stretching out in his chair. \"I\u0027ll pay ya not to talk about your feelings.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking about my feelings.\"\u003c/p\u003e\n\u003cp\u003eShaun\u0027s face wrinkled. \"Why not? Carrie took the girls to the mall. I got all afternoon!\" He cleared his throat and took a drink of his beer. \"So what happened after you guys left Jon hanging?\"\u003c/p\u003e\n\u003cp\u003eDean leaned his elbows on the table and rubbed his hands together, still feeling her skin on his. \"We kissed.\"\u003c/p\u003e\n\u003cp\u003eShaun leaned back and whistled loudly. \"Now, we\u0027re getting somewhere. Did you see explosions?\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t even see boobs!\" Jon laughed, nudging Dean\u0027s shoe and nodding behind him. \"How about that hostess? She\u0027s pretty hot, man.\"\u003c/p\u003e\n\u003cp\u003eDean hesitated before twisting in his seat. The brown haired girl smiled at him, coming closer with a tall glass of dark beer in her hand. Dean turned back around and started checking his phone.\u003c/p\u003e\n\u003cp\u003e\"Look at him!\" Shaun laughed. \"He doesn\u0027t even care. Evy has him whipped already.\"\u003c/p\u003e\n\u003cp\u003eDean looked up from his phone with a frown. \"No, she doesn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShaun coughed into his hand. \"I think she does.\"\u003c/p\u003e\n\u003cp\u003e\"Here ya go,\" the hostess said warmly, setting a coaster down in front of Dean and then the beer on top of it. \"Anything else I can get for you?\"\u003c/p\u003e\n\u003cp\u003eDean sat up straighter and cleared his throat. \"How bout your number?\"\u003c/p\u003e\n\u003cp\u003eA bashful smile slid across her smooth complexion. She scrawled something down on a napkin, her face blushing, and set it next to his beer.\u003c/p\u003e\n\u003cp\u003eDean raised his glass to her and smiled. \"Thanks for the beer. Put it on their tab,\" he said, taking a quick sip.\u003c/p\u003e\n\u003cp\u003eShe laughed lightly and floated back across the patio as Dean waved the napkin in Shaun\u0027s face.\u003c/p\u003e\n\u003cp\u003eShaun watched her disappear back inside, shaking his head. \"Man, you could have any girl you wanted.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly!\" Jon said, tipping his Corona back and swallowing with a loud sigh. \"You have a gift, Deano, and so much more left to do. You cannot waste that gift on just one woman. That\u0027s not fair to anyone.\"\u003c/p\u003e\n\u003cp\u003eShaun snorted. \"Yeah, especially you, because once Deano is out of the game it\u0027s all over but the cryin.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about? Did you just miss my nice little threesome story?\"\u003c/p\u003e\n\u003cp\u003eShaun dug into another wing. \"Dreams don\u0027t count.\"\u003c/p\u003e\n\u003cp\u003e\"Did that really happen?\" Dean asked.\u003c/p\u003e\n\u003cp\u003eJon nodded proudly and tipped the bottle back, sending a lime wedge tumbling through the golden liquid in slow motion. He swallowed and wiped his upper lip. \"Shit got crazy, too.\"\u003c/p\u003e\n\u003cp\u003eShaun stopped chewing. \"You roll tape on that?\"\u003c/p\u003e\n\u003cp\u003e\"Had my hands full, dude.\"\u003c/p\u003e\n\u003cp\u003eShaun pursed his stained lips and added another napkin to the pile. \"One of you guys has got to start rolling video! I see the same woman naked day in and day out. The least you could do is help a brother out.\"\u003c/p\u003e\n\u003cp\u003eJon jerked a thumb at Shaun while staring glumly at Dean. \"See what you have to look forward to when you squander your gift?\"\u003c/p\u003e\n\u003cp\u003eShaun belched into his fist and ignored him. \"Dean, I\u0027m tellin you, you can\u0027t let this one get away without giving it a decent shot. Trust your feelings,\" he said, doing his best impersonation of Obi-Wan Kenobi.\u003c/p\u003e\n\u003cp\u003eDean watched beads of sweat trickle down his pint glass, Evy\u0027s smile running through his mind. He was way ahead of Shaun but didn\u0027t want to let on. He and Jon would never let him hear the end of it.\u003c/p\u003e\n\u003cp\u003eA burst of warm air ruffled Jon\u0027s lips. \"Whatever, man,\" he muttered, as if reading Dean\u0027s mind. \"It\u0027s your funeral.\"\u003c/p\u003e\n\u003cp\u003e\"When are you going to see her again?\"\u003c/p\u003e\n\u003cp\u003eDean shrugged. \"Not sure.\"\u003c/p\u003e\n\u003cp\u003eShaun folded his arms across his pink button down and stared off into space, thrilled to be talking about something that didn\u0027t involve dance recitals or yard work. \"Here\u0027s what you do...stop into her bakery tomorrow morning and get a dozen muffins for some meeting you have.\"\u003c/p\u003e\n\u003cp\u003eDean\u0027s eyes narrowed.\u003c/p\u003e\n\u003cp\u003e\"Ask her out for that night and take her somewhere nice, like PF Chang\u0027s.\"\u003c/p\u003e\n\u003cp\u003eJon\u0027s face twisted. \"PF Chang\u0027s? Man, you\u0027ve been out of the game way too long.\"\u003c/p\u003e\n\u003cp\u003e\"Trust me, Deano, girls hate it when you leave em hangin. You gotta get in there and make it happen.\"\u003c/p\u003e\n\u003cp\u003eDean leaned back, his chest rising beneath the white v-neck throttling his biceps as he inhaled a thoughtful breath. He stroked the two-day-old stubble his face wore like a coat. Tomorrow morning was too far away. He wanted to call her right now, but that went against everything he had ever known. He was dying to know if she had even given him the right number. Deep down, however, he already knew the answer. Had seen it in her eyes, felt it in her lips, heard it in her voice. Dean knocked back a slog of beer with Shaun watching him like a hawk.\u003c/p\u003e\n\u003cp\u003eShaun lifted his eyebrows. \"In the meantime, who\u0027s up for hitting a strip club? I need to see some boobs that haven\u0027t been manhandled by two kids yet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in,\" Jon responded automatically, sticking a finger into the gray sky. \u003c/p\u003e","sourceLink":"https://allnovel.net/fate-interrupted-fate-interrupted-1/page-5.html","bookId":1872,"creation":"Oct 5, 2019 4:47:22 PM","modification":"Oct 5, 2019 4:47:22 PM"}
