{"id":78809,"no":28,"title":"Page 28","content":"\u003cp\u003eColin could see that Caine\u0027s patience was wearing thin. His brother was leaning forward in his chair with\u003c/p\u003e\n\u003cp\u003ea grim look on his face. \"Bear with us, Caine. This isn\u0027t a pleasant memory for us.\"\u003c/p\u003e\n\u003cp\u003eNathan nodded. \"It was just past sunset,\" he began. \"I could still see their fins though,\" Colin interjected. Caine was sitting on the edge of his chair. He now understood the reason for Jade\u0027s nightmares. She dreamed about sharks. My God, the terror she must have endured made his heart pound.\u003c/p\u003e\n\u003cp\u003e\"Pagan told Tommy to fetch a boat, then she took his knife and came into the waters after us. The men who\u0027d put us there were sure we were done for and had already left. Pagan ... I mean, Jade, got to me first. I was closer, I guess. Anyway, she pulled me toward the boat. A shark got a fair nibble out of my leg when they were hauling me in. Tommy lost his balance and fell overboard. He never resurfaced.\"\u003c/p\u003e\n\u003cp\u003eWhen Colin paused and turned to Nathan, his friend took up the telling.\u003c/p\u003e\n\u003cp\u003e\"I still don\u0027t understand why, but the sharks kept away from me. They were in a frenzy and Tommy\u003c/p\u003e\n\u003cp\u003ehad become their target. Jade had gotten Colin into the boat by then.\"\u003c/p\u003e\n\u003cp\u003e\"I tried to help,\" Colin whispered. His voice was hoarse. \"But I passed out. The next time I opened my eyes, I was on the Emerald. The oddest-looking man I\u0027d ever seen was trying to press me into a game of chess. Honest to God, Caine, I wasn\u0027t sure if I was in heaven or hell. Then I saw Nathan sleeping on the cot next to me. I saw his sister, too, and I suddenly remembered everything. It seemed to me that it had all just happened, but I found out I\u0027d been ill for quite some time.\"\u003c/p\u003e\n\u003cp\u003eCaine leaned back in his chair in an attempt to ease the tension in his shoulders. He took several deep breaths, then noticed Colin and Nathan were doing the same thing.\u003c/p\u003e\n\u003cp\u003e\"Did she know . . . when she went into the water, did she know there were sharks?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" Nathan whispered. \"She knew.\"\u003c/p\u003e\n\u003cp\u003e\"My God, the courage that must have taken . . .\"\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t talk about it,\" Colin interjected.\u003c/p\u003e\n\u003cp\u003e\"She dreams about it.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Nathan asked.\u003c/p\u003e\n\u003cp\u003e\"She has nightmares,\" Caine explained.\u003c/p\u003e\n\u003cp\u003eNathan\u0027s brother slowly nodded.\u003c/p\u003e\n\u003cp\u003e\"Matthew and Jimbo wanted to go after the bastards who\u0027d tried to kill us, of course,\" Colin said. \"Jade wouldn\u0027t let them. She had good reason, though. She wanted the men to report back to their superior that we were both dead. Jade felt it was the only way to keep us safe. It was the right decision, I think. Nathan and I are content to stay dead for a while longer, until we find out who in hell is behind this treachery.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, Caine, we were sanctioned by our own government,\" Nathan muttered.\u003c/p\u003e\n\u003cp\u003e\"No,\" Caine countered. \"Your government didn\u0027t even know you worked for them. Did you ever report to Richards or his superiors? Were you ever acknowledged . . .\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead and say it,\" Colin interrupted.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Caine replied. \"You worked for the Tribunal.\"\u003c/p\u003e\n\u003cp\u003e\"I knew you were going to say that,\" Colin whispered.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be certain,\" Nathan argued.\u003c/p\u003e\n\u003cp\u003e\"Richards didn\u0027t know until he was informed of your deaths that you worked for the department, Nathan. He\u0027s investigating now.\"\u003c/p\u003e\n\u003cp\u003e\"Then he\u0027ll be killed,\" Nathan predicted.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s quietly investigating,\" Caine qualified.\u003c/p\u003e\n\u003cp\u003e\"Damn, I know I\u0027ve made mistakes,\" Nathan muttered. \"I almost got you killed, Colin. I never should have involved you in this.\"\u003c/p\u003e\n\u003cp\u003eColin shook his head. \"We\u0027re partners, remember?\" He turned back to his brother and said, \"Do you really believe Richards can be trusted?\"\u003c/p\u003e\n\u003cp\u003e\"I trust him with my life. Jade\u0027s going to have to give him the letters as soon as possible, or recite the contents to him.\"\u003c/p\u003e\n\u003cp\u003e\"We can write copies,\" Colin suggested. \"That way, the originals stay safe. No one will find the Emerald.\"\u003c/p\u003e\n\u003cp\u003e\"The ship was named for her, wasn\u0027t it?\" Caine asked. There was a hint of a smile on his face now. \"I should have guessed that sooner. Her eyes are the color of emeralds, especially when she\u0027s angry.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Harry named the ship after her,\" Colin said. \"Can you understand now why you became the target?\"\u003c/p\u003e\n\u003cp\u003eCaine nodded. \"Yes. I was searching for Pagan. The Tribunal couldn\u0027t take the risk of me finding the pirate and gaining the truth.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re still at risk, Caine,\" Colin reminded him.\u003c/p\u003e\n\u003cp\u003e\"But not for long,\" Caine countered. \"I have a plan.\"\u003c/p\u003e\n\u003cp\u003eColin grinned at Nathan. \"I told you he\u0027d have a plan.\" He couldn\u0027t keep the relief out of his voice.\u003c/p\u003e\n\u003cp\u003eJade walked back into the room. She looked much calmer now, almost serene. She wouldn\u0027t look at him, Caine noticed, didn\u0027t spare him a single glance as she made her way back over to the chair in front of the hearth and sat down.\u003c/p\u003e\n\u003cp\u003e\"Sterns has ordered two rooms made ready for you and Nathan,\" she told Colin. \"As soon as yours is ready, you must go upstairs and rest.\"\u003c/p\u003e\n\u003cp\u003e\"Are you certain we should stay here?\" Nathan asked. He nudged Colin in his side. \"My country home is in a very remote area. I just finished the remodeling before our last assignment,\" he added with a glance\u003c/p\u003e\n\u003cp\u003ein Caine\u0027s direction. \"We\u0027d be very comfortable there.\"\u003c/p\u003e\n\u003cp\u003eColin grinned. \"I\u0027ve heard so much about this palace of yours I know each room by heart. That\u0027s all you ever talked about.\"\u003c/p\u003e\n\u003cp\u003e\"Well, then, you have to agree with me. I have to say, Caine, that it\u0027s the most beautiful house in all of England now . .. Jade, why are you shaking your head at me? You don\u0027t think my house is grand?\"\u003c/p\u003e\n\u003cp\u003eShe gave him a quick smile. \"Oh, yes, Nathan, your house was very grand.\"\u003c/p\u003e\n\u003cp\u003eNathan looked startled. \"Was, you say?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I have some disappointing news, Nathan.\"\u003c/p\u003e\n\u003cp\u003eHer brother leaned forward. \"How disappointing?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"You see, there was this fire .. .\"\u003c/p\u003e\n\u003cp\u003e\"A fire?\" He sounded as if he were choking on something. Colin resisted the urge to slap him on his back.\u003c/p\u003e\n\u003cp\u003e\"It was a rather large fire, Nathan.\"\u003c/p\u003e\n\u003cp\u003eHer voice reeked with sympathy. Nathan winced. \"How large, Jade?\"\u003c/p\u003e\n\u003cp\u003e\"Your grand house was burned to the cellars.\"\u003c/p\u003e\n\u003cp\u003eShe turned to Caine while Nathan muttered several obscenities. \"I told you he\u0027d be disappointed.\"\u003c/p\u003e\n\u003cp\u003eNathan looked a little more than just disappointed, Caine decided. Jade\u0027s brother looked as though he wanted to kill someone. Since Caine had felt much the same reaction when his new stables were destroyed, he found himself in sympathy with Nathan.\u003c/p\u003e\n\u003cp\u003eNathan took a deep breath, then turned to Colin. He sounded as if he were whining when he said, \"I\u0027d just finished the last damned room.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, he had,\" Jade interjected, giving her brother her full support. \"The very last damned room.\"\u003c/p\u003e\n\u003cp\u003eCaine closed his eyes. \"Jade, I thought it was all a lie.\"\u003c/p\u003e\n\u003cp\u003e\"What was all a lie?\" Colin asked.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t lie about everything,\" Jade interjected at the same moment.\u003c/p\u003e\n\u003cp\u003e\"Exactly what didn\u0027t you lie about?\" Caine demanded.\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t take that tone with me, sir,\" she countered. \"I only lied about witnessing a murder,\" she added with a nod. \"It was the best I could come up with on the spur of the moment. At least, I think that\u0027s all I lied about. If I think of anything else, I\u0027ll mention it, all right? Now please quit your scowling, Caine. This isn\u0027t the time to be critical.\"\u003c/p\u003e\n\u003cp\u003e\"Will you two save your arguing for later?\" Nathan demanded. \"Jade? Tell me how the fire started.\u003c/p\u003e\n\u003cp\u003eWas someone careless with ...\"\u003c/p\u003e\n\u003cp\u003e\"It was deliberate, not careless,\" Jade explained. \"Whoever set out to burn your home, well, they certainly knew what they were about. They were very thorough. Even the wine cellar was destroyed, Nathan.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, not the wine cellar!\" Nathan cried.\u003c/p\u003e\n\u003cp\u003e\"I believe they were trying to destroy the letters,\" Jade said. \"Since they couldn\u0027t find them when they pillaged the house, they . . .\"\u003c/p\u003e\n\u003cp\u003e\"They pillaged my house?\" Nathan asked. \"When?\"\u003c/p\u003e\n\u003cp\u003e\"The day before they burned it down,\" she answered. \"Oh, dear, I just remembered,\" she added with a glance in Caine\u0027s direction. \"I lied about falling down the stairs, too. Yes, I ...\"\u003c/p\u003e\n\u003cp\u003eNathan let out a sigh, drawing her attention back to him. \"When this is over, I will rebuild,\" he said. \"What about the stables, Jade? Were they left intact?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, the stables were left untouched, Nathan. You needn\u0027t worry about that.\"\u003c/p\u003e\n\u003cp\u003eCaine was watching Jade. The worry in her gaze was so obvious, he wondered why Nathan hadn\u0027t noticed she hadn\u0027t finished giving him his disappointments yet.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too bad about your house,\" Colin said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Nathan answered. \"But the stables are all right. Colin, you should see my stock. There\u0027s one horse in particular, a fine Arabian stallion I paid a fortune for, but he was well worth the money. I\u003c/p\u003e\n\u003cp\u003enamed him Lightning.\"\u003c/p\u003e\n\u003cp\u003e\"Lightning?\" Colin asked, grinning over the absurd name. \"Sounds like Harry had a hand in choosing that name.\"\u003c/p\u003e\n\u003cp\u003e\"He did,\" Nathan admitted with a grin. \"Still, it\u0027s fitting for the steed. He runs as fast as the wind. Only Jade and I can seat him. Wait until you see him . . .\" Nathan quit his boasting when he noticed Jade was shaking her head at him again.\u003c/p\u003e\n\u003cp\u003e\"What, Jade? Are you disagreeing that Lightning isn\u0027t as fast as the wind?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, Nathan, Lightning was as fast as the wind.\"\u003c/p\u003e\n\u003cp\u003eNathan looked ready to weep. \"Was?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I have a little more disappointing news for you, Nathan. There was this mishap and your fine horse was shot between his lovely brown eyes.\"\u003c/p\u003e\n\u003cp\u003eCaine had leaned forward in his chair again. The ramifications of what she was telling her brother had just hit him full force. \"You mean to say you weren\u0027t lying about that, either?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head again.\u003c/p\u003e\n\u003cp\u003e\"What the hell!\" Nathan shouted. \"Who shot Lightning?\"\u003c/p\u003e\n\u003cp\u003eShe glared at Caine. \"I told you he was going to be disappointed,\" she muttered.\u003c/p\u003e\n\u003cp\u003e\"That sure as certain isn\u0027t my fault,\" Caine muttered. \"So you can quit glaring at me so intently.\"\u003c/p\u003e\n\u003cp\u003e\"Did Caine shoot him?\" Nathan roared.\u003c/p\u003e\n\u003cp\u003e\"No,\" Jade rushed out. \"He just didn\u0027t believe you\u0027d be so disappointed. I hadn\u0027t even met Caine then.\"\u003c/p\u003e\n\u003cp\u003eHer brother fell back against the cushions and threw his hand over his eyes. \"Is nothing sacred?\" he bellowed.\u003c/p\u003e\n\u003cp\u003e\"Apparently Lightning wasn\u0027t,\" Caine interjected dryly.\u003c/p\u003e\n\u003cp\u003eNathan glared at him. \"He was a damned fine horse.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure he was,\" Caine said before turning back to Jade. \"If you\u0027re telling me the truth about this, then it can only mean . . .\"\u003c/p\u003e\n\u003cp\u003e\"I really would appreciate it if you\u0027d quit insulting me, Caine,\" she snapped.\u003c/p\u003e\n\u003cp\u003e\"Jade always tells the truth,\" Nathan defended.\u003c/p\u003e\n\u003cp\u003e\"Really?\" Caine drawled out. \"I haven\u0027t seen that side of her yet. From the moment I met her, she\u0027s done nothing but lie. Haven\u0027t you, sweet? All that\u0027s going to change now though, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eShe refused to answer him.\u003c/p\u003e\n\u003cp\u003e\"Sweetheart, why don\u0027t you give Nathan the rest of the bad news?\"\u003c/p\u003e\n\u003cp\u003e\"The rest? My God, there\u0027s more?\"\u003c/p\u003e\n\u003cp\u003e\"Just a little bit more,\" she answered. \"Do you remember your lovely new carriage?\"\u003c/p\u003e\n\u003cp\u003e\"Not my carriage, Jade,\" Nathan protested with a low groan.\u003c/p\u003e\n\u003cp\u003eShe turned to Colin while Nathan went through his list of expletives again. \"You should have seen it, Colin. It was splendid. The interior was so large and comfortable. Nathan had the backs of the seats\u003c/p\u003e\n\u003cp\u003edone in such soft leather.\"\u003c/p\u003e\n\u003cp\u003eColin was trying to look sympathetic. \"Was?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Someone torched it,\" Jade announced.\u003c/p\u003e\n\u003cp\u003e\"Now why would anyone want to destroy a perfectly good vehicle?\"\u003c/p\u003e\n\u003cp\u003eCaine answered that question. \"Your sister has left out an important detail,\" he stated. \"She happened\u003c/p\u003e\n\u003cp\u003eto be inside when it was set on fire.\"\u003c/p\u003e\n\u003cp\u003eColin was the first to react to that statement. \"My God, Jade. Tell us what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Caine just did tell you,\" she said.\u003c/p\u003e\n\u003cp\u003e\"No, tell us exactly how it happened,\" Colin insisted. \"You could have been killed.\"\u003c/p\u003e\n\u003cp\u003e\"That was their intent,\" she said, her voice tinged with exasperation. \"They meant to kill me. After your house was destroyed, the carriage was made ready and I set out for London. I wanted to find you, Nathan . . .\"\u003c/p\u003e\n\u003cp\u003e\"How many men went with you?\" Caine interrupted to ask.\u003c/p\u003e\n\u003cp\u003e\"Hudson sent two men with me,\" she answered.\u003c/p\u003e\n\u003cp\u003eCaine shook his head. \"I thought you told me you\u0027d only been back in England two weeks,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Well, actually, it was a little longer,\" she hedged.\u003c/p\u003e\n\u003cp\u003e\"How long?\"\u003c/p\u003e\n\u003cp\u003e\"Two months,\" she admitted. \"I did have to lie about that.\"\u003c/p\u003e\n\u003cp\u003e\"You could have told me the truth.\"\u003c/p\u003e\n\u003cp\u003eHe was getting angry. She was too irritated to care. \"Oh? And would you have believed me if I\u0027d said\u003c/p\u003e\n\u003cp\u003eI was Pagan and that I had just snatched Winters, given him to Nathan, and was now trying to ... Oh, what\u0027s the use. You wouldn\u0027t have listened to me.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute,\" Nathan interrupted. \"Who is Hudson, Jade? You said Hudson sent two men with you, remember?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s the butler Lady Briars hired for you.\"\u003c/p\u003e\n\u003cp\u003eNathan nodded. \"And then what happened?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"We were just outside London when those same three men trapped us. They\u0027d blocked the road with fat tree branches. I leaned out the window to see what was going on when I heard the shouting. Someone\u003c/p\u003e\n\u003cp\u003ehit me then, Nathan, on the side of my head. It fairly knocked the wind out of me. I must have fainted, though I\u0027m embarrassed to admit to that possibility.\" She turned to look at Caine. \"It isn\u0027t at all in my nature to swoon.\"\u003c/p\u003e\n\u003cp\u003e\"Jade, you\u0027re digressing,\" Caine reminded her.\u003c/p\u003e\n\u003cp\u003eShe gave him a disgruntled look, then turned back to her brother. \"The interior of the carriage was ripped to shreds. They\u0027d used their knives on the fine leather. I smelled smoke and of course got right out.\"\u003c/p\u003e\n\u003cp\u003e\"They were hunting the letters?\" Colin asked.\u003c/p\u003e\n\u003cp\u003e\"You just opened the door and climbed out?\" Nathan asked at the very same moment. \u003c/p\u003e","sourceLink":"https://allnovel.net/guardian-angel-crown-s-spies-2/page-28.html","bookId":1791,"creation":"Oct 5, 2019 4:11:13 PM","modification":"Oct 5, 2019 4:11:13 PM"}
