{"id":78815,"no":34,"title":"Page 34","content":"\u003cp\u003e\"What are you thinking, Jade?\" he asked.\u003c/p\u003e\n\u003cp\u003eWhen she didn\u0027t answer him, he pulled on her hair. \"I know you found fulfillment. Are you going to deny it now?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she whispered shyly.\u003c/p\u003e\n\u003cp\u003eCaine moved to his feet in one fluid motion with Jade in his arms. When they were both back in bed and under the covers, she tried to turn her back to him. He wouldn\u0027t allow her retreat, but forced her to face him. \"Well?\" he demanded.\u003c/p\u003e\n\u003cp\u003e\"Well, what?\" she asked, staring into those dark eyes that made her feel fainthearted.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m good, aren\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eThe dimple was back in his cheek. She couldn\u0027t help but smile. \"Good at what?\" she asked, pretending innocence.\u003c/p\u003e\n\u003cp\u003e\"Pillaging.\"\u003c/p\u003e\n\u003cp\u003eShe slowly nodded. \"Very good,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"And did I impress you?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Perhaps just a little,\" she answered. She let out a gasp when the palm of his hand pressed against the junction of her thighs. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Impressing you again, sweetheart.\"\u003c/p\u003e\n\u003cp\u003eThe man was as good as his word, Jade decided a long while later. And he had far more stamina than\u003c/p\u003e\n\u003cp\u003eshe did. When he finally rolled away from her, she felt like a limp rag.\u003c/p\u003e\n\u003cp\u003eShe fell asleep with Caine holding her close, whispering words of love. She didn\u0027t have any nightmares that night.\u003c/p\u003e\n\u003cp\u003eBy noon, they were back at Caine\u0027s house. Matthew and Jimbo couldn\u0027t leave for Shallow\u0027s Wharf quickly enough. They were both mortified by their slip up of the night before. They\u0027d obviously underestimated the Marquess. Matthew didn\u0027t think he\u0027d ever live down the disgrace; though, of course, Jade promised not to tell anyone he\u0027d been caught so unaware.\u003c/p\u003e\n\u003cp\u003eHell, Caine had prodded him awake, and how in God\u0027s name such a big man was able to get into his\u003c/p\u003e\n\u003cp\u003eroom without making a sound still baffled him.\u003c/p\u003e\n\u003cp\u003eAs soon as they returned to Caine\u0027s home, Jade changed her gown and then went to Caine\u0027s study to make copies of the letters for him. She listened to him explain his plan. She argued something fierce\u003c/p\u003e\n\u003cp\u003eabout trusting Richards, but agreed that Lyon could hold a confidence.\u003c/p\u003e\n\u003cp\u003e\"When you meet Richards, you\u0027ll like him as much as you like Lyon,\" Caine replied. \"You\u0027ll trust him as much, too.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Caine, I like Lyon, yes, but that isn\u0027t the reason I trust him. No, no,\" she continued. \"Liking and trusting are two different kettles of fish.\"\u003c/p\u003e\n\u003cp\u003e\"Then why do you trust Lyon?\" he asked, smiling over the censure in her tone.\u003c/p\u003e\n\u003cp\u003e\"I read his file,\" she answered. \"Do you know, in comparison, Caine, you\u0027ve led the life of a choirboy.\"\u003c/p\u003e\n\u003cp\u003eCaine shook his head. \"I wouldn\u0027t mention reading his file to him,\" he advised.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she agreed. \"He\u0027d probably get as prickly as you did when I told you,\" she added. \"Lyon\u0027s file is just as fat as yours, but he didn\u0027t have a special name.\"\u003c/p\u003e\n\u003cp\u003eCaine looked thoroughly irritated with her. \"Jade, exactly how many files did you read?\"\u003c/p\u003e\n\u003cp\u003e\"Just a few,\" she replied. \"Caine, I really must concentrate on these letters. Please quit interrupting me.\"\u003c/p\u003e\n\u003cp\u003eThe library door opened then, drawing Caine\u0027s attention. Nathan walked inside. \"Why hasn\u0027t anyone tried to get to you, Caine, since you\u0027ve been here? It\u0027s damned isolated, and I would think . ..\"\u003c/p\u003e\n\u003cp\u003e\"Someone did try to get to Caine the day we arrived, Nathan,\" Jade said without looking up.\u003c/p\u003e\n\u003cp\u003eWhen Jade didn\u0027t continue, Caine filled Nathan in on the details of the failed attempt.\u003c/p\u003e\n\u003cp\u003e\"Nathan, how nice you look,\" Jade said, completely turning the topic when she glanced up and saw his handsome shirt and pants.\u003c/p\u003e\n\u003cp\u003e\"That shirt looks damned familiar,\" Caine drawled out.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s yours,\" Nathan answered with a grin. \"Fits well, too. Colin has also borrowed a few of your things. We hadn\u0027t packed sufficiently when we were tossed into the ocean. Why hasn\u0027t anyone tried to get to you since that first day?\" he added with a scowl.\u003c/p\u003e\n\u003cp\u003eNathan started to pace the room like a tiger. Caine continued to lean against the edge of the desk. \"They have.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Nathan asked. \"When?\"\u003c/p\u003e\n\u003cp\u003e\"They have not,\" Jade interjected. \"I would have known.\"\u003c/p\u003e\n\u003cp\u003e\"In the past ten days, four others have tried.\"\u003c/p\u003e\n\u003cp\u003e\"And?\" Nathan asked, demanding more of an explanation.\u003c/p\u003e\n\u003cp\u003e\"They failed.\"\u003c/p\u003e\n\u003cp\u003e\"Why wasn\u0027t I informed?\" Jade asked.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t want to worry you,\" Caine explained.\u003c/p\u003e\n\u003cp\u003e\"Then you had to have known Matthew and Jimbo were here,\" Nathan said.\u003c/p\u003e\n\u003cp\u003e\"I knew,\" Caine answered. \"I left them alone, too, until they burned down my stables. Then I had a little talk with them. Couldn\u0027t you have come up with another plan to keep me busy while you went to see my father?\"\u003c/p\u003e\n\u003cp\u003eHe was getting all worked up again. Jade guessed he still wasn\u0027t over the fire yet. Sterns had said the stables were brand new. \"I should have been more specific with Matthew,\" she announced. \"1 left the diversion up to him. Still, he was very creative, effective, too. You were busy.\"\u003c/p\u003e\n\u003cp\u003e\"You took a needless risk going off on your own like that,\" he snapped. \"Damn it, Jade, you could have been killed!\"\u003c/p\u003e\n\u003cp\u003eHe was shouting at her by the time he\u0027d finished that statement. \"I was very careful,\" she whispered, trying to placate him.\u003c/p\u003e\n\u003cp\u003e\"The hell you were!\" he roared. \"You were damn lucky, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003eShe decided she needed to turn his attention. \"I\u0027m never going to finish this task if you two don\u0027t leave\u003c/p\u003e\n\u003cp\u003eme alone.\" She tossed her hair over her shoulder and returned to her letter writing. She could feel his\u003c/p\u003e\n\u003cp\u003eglare on her. \"Why don\u0027t you both go see how Colin\u0027s doing. I\u0027m sure he\u0027d like the company.\"\u003c/p\u003e\n\u003cp\u003e\"Come on, Caine. We\u0027ve just been dismissed.\"\u003c/p\u003e\n\u003cp\u003eCaine shook his head. \"Promise me you won\u0027t take needless risks again,\" he ordered Jade. \"Then I\u0027ll leave.\"\u003c/p\u003e\n\u003cp\u003eShe immediately nodded. \"I promise.\"\u003c/p\u003e\n\u003cp\u003eThe anger seemed to drain out of him. He nodded, then leaned down to kiss her. She tried to dodge him. \"Nathan\u0027s here,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"Ignore him.\"\u003c/p\u003e\n\u003cp\u003eHer face was bright red when he lifted his mouth away from hers. Her hands were shaking, too. \"I love you,\" he whispered before he straightened up and followed Nathan out of the room.\u003c/p\u003e\n\u003cp\u003eJade stared at the desktop a long while. Was it possible? Could he really love her? She had to quit thinking about it in order to calm the trembling in her hands. Richards and his friend wouldn\u0027t be able to read the letters otherwise. Besides, it didn\u0027t matter if he loved her or not. She still had to leave him. Didn\u0027t she?\u003c/p\u003e\n\u003cp\u003eJade had worked herself into a fine state of nerves by the time dinner hour was over. Nathan had decided to eat his supper upstairs with Colin. She and Caine, and Sterns, of course, ate at the long table. They got into a heated debate about the separation between church and state. In the beginning, when Caine stated he was in favor of the separation wholeheartedly, she took the opposite opinion.\u003c/p\u003e\n\u003cp\u003eYet when he deliberately argued the opposing view, she was just as vehement in her rebuttal.\u003c/p\u003e\n\u003cp\u003eIt was a thoroughly invigorating argument. Sterns ended up acting as referee. The debate made Caine hungry again. He reached for the last slice of mutton only to have it snatched out of his reach by Sterns.\u003c/p\u003e\n\u003cp\u003e\"I wanted that, Sterns,\"\" Caine muttered. \"So did I, mi\u0027lord,\" the butler answered. He picked up his\u003c/p\u003e\n\u003cp\u003eutensils and proceeded to devour the food. Jade took sympathy on Caine and gave him half of her portion. Both Sterns and Caine looked at each other when the sudden pounding on the front doors\u003c/p\u003e\n\u003cp\u003eechoed through the room. Caine lost the staring contest. \"I\u0027ll get it,\" he announced.\u003c/p\u003e\n\u003cp\u003e\"As you wish, mi\u0027lord,\" Sterns agreed between bites of his mutton.\u003c/p\u003e\n\u003cp\u003e\"Be careful,\" Jade called out.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" Caine called back. \"No one could have gotten to the doors without my men noticing.\"\u003c/p\u003e\n\u003cp\u003eA good ten minutes elapsed before Sterns finished his second cup of tea. \"I believe I shall go and see who\u0027s calling,\" he told Jade.\u003c/p\u003e\n\u003cp\u003e\"Perhaps it\u0027s Caine\u0027s papa.\"\u003c/p\u003e\n\u003cp\u003e\"No, mi\u0027lady,\" Sterns countered. \"I have ordered the Duke and Duchess to stay away. It would draw suspicion if they began to pay daily visits to their son.\"\u003c/p\u003e\n\u003cp\u003e\"You really ordered them?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"But of course, Lady Jade.\" With a formal bow, the butler left the room.\u003c/p\u003e\n\u003cp\u003eJade drummed her fingers on the table until Sterns returned.\u003c/p\u003e\n\u003cp\u003e\"Sir Richards and the Marquess of Lyonwood have arrived,\" he announced from the doorway.\u003c/p\u003e\n\u003cp\u003e\"My lord is requesting both brandy and you in the library.\"\u003c/p\u003e\n\u003cp\u003e\"So soon?\" she asked, clearly startled. She stood up, smoothed the folds of her gold-colored gown, then patted her hair. \"I wasn\u0027t ready to meet anyone,\" she said.\u003c/p\u003e\n\u003cp\u003eSterns smiled. \"You look lovely, mi\u0027lady,\" he announced. \"You\u0027ll like these visitors. They\u0027re good men.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027ve already met Lyon,\" she replied. \"And I\u0027m certain I\u0027ll like Richards just as much.\"\u003c/p\u003e\n\u003cp\u003eAs she started for the door, her expression turned from carefree to fearful.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s really nothing to be concerned about, mi\u0027lady.\"\u003c/p\u003e\n\u003cp\u003eHer smile was radiant. \"Oh, I\u0027m not worried, Sterns. I\u0027m preparing.\"\u003c/p\u003e\n\u003cp\u003e\"I beg your pardon?\" he asked. He followed after her. \"What are you preparing for, mi\u0027lady?\"\u003c/p\u003e\n\u003cp\u003e\"To look worried,\" she answered with a laugh. \"And to look weak, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Sterns agreed with a sigh. \"Are you ill, Lady Jade?\"\u003c/p\u003e\n\u003cp\u003eShe turned to look at him when she reached the library door. \"Appearances, Sterns.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"They must be kept up. Do the expected, don\u0027t you see?\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t see,\" he answered.\u003c/p\u003e\n\u003cp\u003eShe smiled again. \"I\u0027m about to give Caine his pride back,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t aware he\u0027d misplaced it.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t either, until he mentioned it to me,\" she replied. \"Besides, they\u0027re only men, after all.\"\u003c/p\u003e\n\u003cp\u003eShe took a deep breath, then let Stems open the door for her. She stood just inside the entrance, her head bowed, her hands folded together in front of her.\u003c/p\u003e\n\u003cp\u003eSterns was so surprised by the sudden change in her demeanor, his mouth dropped open.\u003c/p\u003e\n\u003cp\u003eWhen Caine called out to her, she visibly jumped, as if his command had the power to terrify her, then slowly walked into the study. The one called Richards bounded to his feet first. He was an elderly man with gray hair, a gentle smile, and a round belly. He had kind eyes, too. Jade acknowledged the introduction by making a perfect curtsy.\u003c/p\u003e\n\u003cp\u003eShe then turned to greet Lyon. When he stood to his full height, he fairly towered over her. \"It is good\u003c/p\u003e\n\u003cp\u003eto see you again, Lyon,\" she whispered, her voice little more than a faint shiver.\u003c/p\u003e\n\u003cp\u003eLyon raised an eyebrow in reaction. He knew she was a timid creature, but he thought that she had\u003c/p\u003e\n\u003cp\u003egotten over her initial reaction to him the first time they\u0027d met. Now, however, she acted afraid again.\u003c/p\u003e\n\u003cp\u003eThe contradiction puzzled him.\u003c/p\u003e\n\u003cp\u003eCaine was sitting behind his desk. His chair was tilted back against the wall. Jade sat down on the edge\u003c/p\u003e\n\u003cp\u003eof the chair adjacent to the desk, her back ramrod straight. Her hands were clenched in her lap.\u003c/p\u003e\n\u003cp\u003eRichards and Lyon both resumed their chairs across from her.\u003c/p\u003e\n\u003cp\u003eCaine was watching Jade. She appeared to be terribly frightened. He wasn\u0027t buying it for a minute. She was up to something, he decided, but he would have to wait until later to question her.\u003c/p\u003e\n\u003cp\u003eRichards cleared his throat to get everyone\u0027s attention. His gaze was centered on Jade when he said, \"I cannot help but notice, my dear, how worried you seem to be. I\u0027ve read the letters your father saved, but before I ask you my questions, I want to make it perfectly clear that I don\u0027t hold you in less esteem because of your father\u0027s transgressions.\"\u003c/p\u003e\n\u003cp\u003eShe still looked like a trapped doe, but she managed a timid nod.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Sir Richards,\" she replied in a bare whisper. \"It is kind of you not to blame me. I was worried that you might condemn me.\"\u003c/p\u003e\n\u003cp\u003eCaine rolled his eyes heavenward. Richards, a man rarely given to showing any affection, was now clasping Jade\u0027s hands. The director looked like he wanted to take her into his arms and offer her solace.\u003c/p\u003e\n\u003cp\u003eShe did appear to be very vulnerable. Caine suddenly remembered that that same expression had been\u003c/p\u003e\n\u003cp\u003eon her face when she\u0027d stared at him in the tavern. She\u0027d appeared vulnerable then, too.\u003c/p\u003e\n\u003cp\u003eWhat was her game?\u003c/p\u003e\n\u003cp\u003e\"Neither one of us condemns you,\" Lyon interjected. He, too, leaned forward, bracing his elbows on his knees. \"You have had a difficult time of it, Jade.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she has,\" Sir Richards agreed.\u003c/p\u003e\n\u003cp\u003eCaine forced himself not to smile. Both his superior and his friend were falling under Jade\u0027s spell. He thought Lyon should have known better. After all, he\u0027d met Jade before. Still, her manner now, added\u003c/p\u003e\n\u003cp\u003eto his earlier thought that she was terribly timid, obviously convinced Lyon that she was sincere.\u003c/p\u003e\n\u003cp\u003e\"Are you up to answering a few questions now?\" Richards asked.\u003c/p\u003e\n\u003cp\u003eJade nodded. \"Would it not be better to have Nathan answer your questions? Men are so much more logical. I\u0027ll probably make a muddle out of it.\"\u003c/p\u003e\n\u003cp\u003e\"Jade.\" Caine said her name as a warning.\u003c/p\u003e\n\u003cp\u003eShe turned to give him a tremulous smile. \"Yes, Caine?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Behave yourself.\"\u003c/p\u003e\n\u003cp\u003eRichards turned to frown at Caine. Then he returned his attention to Jade.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll ask Nathan our questions later. If it isn\u0027t too painful to recount, please tell us exactly what happened to you from the moment you arrived in London.\"\u003c/p\u003e\n\u003cp\u003eJade nodded. \"Certainly,\" she agreed. \"You see, this all begins with the letters. My Uncle Harry was\u003c/p\u003e\n\u003cp\u003egiven a packet of letters by my father. Just two days later, Father was killed. Harry took me away on his ship then. He saved the letters, and when he felt the time was right, he gave them to me. I read them of course, then showed them to Nathan. My brother was working with Colin at the time, and he confided in him. Now then,\" she continued in a brisker tone. \"As Caine has probably told you, both Colin and Nathan were . . . attacked. The villains thought they\u0027d done them in, and . . . Pagan decided to let the hired thugs return to London to report their success.\"\u003c/p\u003e\n\u003cp\u003e\"A sound decision,\" Richards interjected.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Jade said. She turned to frown at Caine. \"The plan was very simple. Pagan snatched a physician \u003c/p\u003e","sourceLink":"https://allnovel.net/guardian-angel-crown-s-spies-2/page-34.html","bookId":1791,"creation":"Oct 5, 2019 4:11:13 PM","modification":"Oct 5, 2019 4:11:13 PM"}
