{"id":78790,"no":9,"title":"Page 9","content":"\u003cp\u003e\"But what if you thought I wanted you to ... and I didn\u0027t really want...\"\u003c/p\u003e\n\u003cp\u003e\"Unless you gave me your approval, your wholehearted approval, I wouldn\u0027t touch you. I promise.\"\u003c/p\u003e\n\u003cp\u003eShe thought that was the nicest promise she\u0027d ever been given. He sounded so sincere, and she knew he really meant what he said.\u003c/p\u003e\n\u003cp\u003e\"Caine? Do you know what I\u0027ve just discovered? You really are a gentleman, and an honorable one at that.\"\u003c/p\u003e\n\u003cp\u003eHe\u0027d already fallen asleep hugging her. Jade decided to do the same. She rolled over in his arms, slipped her arms around his waist, and promptly fell asleep.\u003c/p\u003e\n\u003cp\u003eCaine woke up a bare hour later when Jade cried out in her sleep. She muttered something he couldn\u0027t decipher, then let out a terrified scream. He shook her awake. When he brushed her hair away from her face, he felt the wetness on her cheeks. She\u0027d been weeping in her sleep.\u003c/p\u003e\n\u003cp\u003e\"Sweetheart, you\u0027re having a bad dream. It\u0027s all right now,\" he soothed. \"You\u0027re safe with me.\"\u003c/p\u003e\n\u003cp\u003eHe rubbed her shoulders and her back, too, until the tension eased out of her. \"What were you dreaming about?\" he asked, when her breathing had calmed down.\u003c/p\u003e\n\u003cp\u003e\"Sharks.\" The word came out in a whisper filled with anguish.\u003c/p\u003e\n\u003cp\u003e\"Sharks?\" he asked, uncertain if he\u0027d heard correctly.\u003c/p\u003e\n\u003cp\u003eShe tucked her head under his chin. \"I\u0027m so tired,\" she whispered. \"I don\u0027t remember the nightmare now. Hold me, Caine. I want to go back to sleep.\"\u003c/p\u003e\n\u003cp\u003eHer voice still trembled. Caine knew she was lying. She remembered every bit of her nightmare. He wasn\u0027t going to prod her into telling him about it, however.\u003c/p\u003e\n\u003cp\u003eHe kissed the top of her head, then complied with her order and pulled her close.\u003c/p\u003e\n\u003cp\u003eJade knew the minute he fell asleep again. She slowly eased herself away from him and moved to the side of the bed. Her heart was still slamming inside her chest. He thought she\u0027d only had a nightmare. Was reliving an actual event the same? And would she ever be able to forget the horror?\u003c/p\u003e\n\u003cp\u003eGod help her, would she ever be able to go willingly back in the water again?\u003c/p\u003e\n\u003cp\u003eShe felt like crying. It took all her discipline not to give into her urge and hold on to him now. Caine\u003c/p\u003e\n\u003cp\u003ewas such an easy man to trust. She could get used to depending on him, she knew. Yes, he was the dependable type, but he could also break her heart.\u003c/p\u003e\n\u003cp\u003eShe was thoroughly confused by her reaction to him. In her heart, she trusted him completely.\u003c/p\u003e\n\u003cp\u003eWhy then didn\u0027t his own brother?\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eCaine woke up ravenous ... for her. Jade\u0027s nightgown was tangled up around her thighs. She had cuddled up against his side and had thrown her right leg over his thighs sometime during the short night. Her knee now covered his throbbing arousal. Out of deference to her feelings, he\u0027d slept with his pants on. The clothing proved to be a paltry barrier against her softness, though, and Caine could feel the scorch of her body branding him with hot desire.\u003c/p\u003e\n\u003cp\u003eThe side of her face rested on his bare chest. Her lips were softly parted, her breathing deep, even. She had long, black-as-night eyelashes and a healthy sprinkle of freckles across the bridge of her nose. The woman was utterly feminine. Caine continued to stare at her lovely face until he was so hard, so hurting, he was clenching his teeth.\u003c/p\u003e\n\u003cp\u003eIt was a battle to move away from her. When he tried to ease her onto her back, he realized she was holding his hand. She didn\u0027t seem inclined to let go, either.\u003c/p\u003e\n\u003cp\u003eHe had to pry her fingers loose. Then he remembered she\u0027d called him a bastard rake the night before. Yet she was clinging to him now. Caine was certain she\u0027d be wary of him once again when she was\u003c/p\u003e\n\u003cp\u003ewide awake. She couldn\u0027t hide her vulnerability from him when she was sleeping, however, and that fact pleased him considerably.\u003c/p\u003e\n\u003cp\u003eA fierce wave of possessiveness consumed him. In that moment, while he stared down at his angel, he vowed he would never let anything happen to her, he would protect her with his life.\u003c/p\u003e\n\u003cp\u003eFor as long as he was her guardian ... or did he want her to stay with him much, much longer . . . Nathan would be home in two short weeks to take up the task of keeping his sister safe. Would Caine be able to let her go then?\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have any ready answers; he knew only that the thought of giving her up made his heart lurch and his stomach tighten up.\u003c/p\u003e\n\u003cp\u003eIt was all he was prepared to admit to himself, all he was willing to give.\u003c/p\u003e\n\u003cp\u003eIt certainly wasn\u0027t possible to be logical with a half-naked beauty draped over him. Yes, he thought as he leaned down and kissed her brow, he would wait until later to sort it all out in his mind.\u003c/p\u003e\n\u003cp\u003eHe washed and dressed in clothes that belonged to Lyon, then woke Jade. She tried to hit him when he nudged her awake. \"It\u0027s all right, Jade,\" he whispered. \"It\u0027s time to get up.\"\u003c/p\u003e\n\u003cp\u003eShe was blushing by the time she\u0027d sat up in bed. Caine watched her pull the coverlet all the way up to her chin. The act of modesty really wasn\u0027t necessary considering her state of undress the night before, but he decided against mentioning that to her now.\u003c/p\u003e\n\u003cp\u003e\"Please excuse my behavior,\" she whispered in a husky, sleep-filled voice. \"\u0027Tis the truth I\u0027m not at all accustomed to being awakened by a man.\"\u003c/p\u003e\n\u003cp\u003e\"I would hope not,\" he replied.\u003c/p\u003e\n\u003cp\u003eShe looked bewildered. \"Why would you hope that?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not awake enough to play Socrates with me,\" he told her, his voice gentle.\u003c/p\u003e\n\u003cp\u003eJade stared rather stupidly up at him. Caine leaned down and kissed her then, a hard, quick kiss that was over and done with before she could summon a reaction . . . or make a fist.\u003c/p\u003e\n\u003cp\u003eShe had the most astonished look on her face when he pulled away from her. \"Why did you do that?\"\u003c/p\u003e\n\u003cp\u003e\"Because I wanted to,\" he answered.\u003c/p\u003e\n\u003cp\u003eHe started for the door, but she called out to him. \"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"Downstairs,\" he replied. \"I\u0027ll meet you in the dining room. I imagine Christina left some clothes for you in the other room, sweet.\"\u003c/p\u003e\n\u003cp\u003e\"Oh my God ... she must think that we ... that is . . .\"\u003c/p\u003e\n\u003cp\u003eThe door closed on her horrified whispers.\u003c/p\u003e\n\u003cp\u003eShe could hear Caine whistling as he made his way down the corridor. Jade fell back against the pillows. The brief kiss he\u0027d given her had left her shaken. That, and the fact that his friends now thought she was wanton.\u003c/p\u003e\n\u003cp\u003eAnd just what did she care what they thought? When this deception was over, she wouldn\u0027t ever see\u003c/p\u003e\n\u003cp\u003ethem again. Still, Christina wanted to be her friend. Jade now felt as though she\u0027d just betrayed her in some way.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll simply explain that nothing happened,\" she whispered to herself. She\u0027s going to understand. A true friend would, wouldn\u0027t she?\u003c/p\u003e\n\u003cp\u003eSince Jade hadn\u0027t had any true friends in the past, she couldn\u0027t be certain what rules applied.\u003c/p\u003e\n\u003cp\u003eShe got out of her bed and rushed back into her own room. Caine had been correct, for Christina had\u003c/p\u003e\n\u003cp\u003eleft a pretty dark blue riding outfit. Dark brown boots with nary a mark on them were on the floor\u003c/p\u003e\n\u003cp\u003ebeside the chair. Jade prayed they were close to her size.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t quit thinking about Caine while she dressed. The man was going to be a challenge to her peace of mind. He was so dangerously attractive. The damned dimple made her want to swoon. Lyon had loaned him a pair of indeeently snug deerskin-colored britches. The pants accentuated the sleek\u003c/p\u003e\n\u003cp\u003ebulge of muscles in his thighs .. . and his crotch. Black Harry would throttle her if he knew she\u0027d taken the time to notice a man\u0027s body. Caine\u0027s sexuality, so raw, so appealing, made her notice, though. She might be innocent of men, but she certainly wasn\u0027t blind.\u003c/p\u003e\n\u003cp\u003eA scant fifteen minutes later, she was ready to go downstairs. The white silk blouse was a bit too tight\u003c/p\u003e\n\u003cp\u003ein the bosom, but the jacket hid that fact. The boots scrunched her toes, too, but only just a little.\u003c/p\u003e\n\u003cp\u003eShe\u0027d tried to braid her hair, but it was a disaster. She gave up the task when she saw the lopsided mess she was making. Jade had little patience and absolutely no expertise in the area of hair styling. That fact had never bothered her before, yet now it worried her. She was a gentle lady of the ton until this masquerade was finished, and it wasn\u0027t like her to let any little detail slip her notice.\u003c/p\u003e\n\u003cp\u003eThe dining room doors were wide open. Caine was sitting at the head of a long, mahogany table. A servant was pouring dark tea into a cup from a beautiful silver pot. Caine wasn\u0027t paying any attention to the man, however. He seemed to be engrossed in the newspaper he was reading.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t certain if she was supposed to curtsy or not, then decided it really didn\u0027t matter since he wasn\u0027t paying any notice. She was mistaken in that belief, however, for as soon as she reached the chair adjacent to his, he stood up and offered her his assistance.\u003c/p\u003e\n\u003cp\u003eNo one had ever held out a chair for her, not even Nathan. She couldn\u0027t make up her mind if she liked\u003c/p\u003e\n\u003cp\u003ethe fuss or not.\u003c/p\u003e\n\u003cp\u003eCaine continued to read his paper while she ate her breakfast. When he\u0027d finished with what she decided was probably a daily ritual, he leaned back in his chair, folded the newspaper, and finally gave her his complete attention.\u003c/p\u003e\n\u003cp\u003e\"Well?\" she asked as soon as he looked at her.\u003c/p\u003e\n\u003cp\u003e\"Well, what?\" he asked, smiling over the eagerness in his expression.\u003c/p\u003e\n\u003cp\u003e\"Was there mention of a finely dressed gentleman being murdered?\" She pointed to the newspaper.\u003c/p\u003e\n\u003cp\u003e\"No, there wasn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe let out a gasp of dismay. \"I\u0027ll wager they tossed him in the Thames. Do you know, Caine, now that\u003c/p\u003e\n\u003cp\u003eI reflect upon it, I did feel something slither against my legs. And you did say nothing could live for long\u003c/p\u003e\n\u003cp\u003ein the Thames, didn\u0027t you? It must have been that poor...\"\u003c/p\u003e\n\u003cp\u003e\"Jade, you\u0027re letting your imagination get the better of you,\" he interjected. \"Not only was there no mention of your finely dressed gentleman, there wasn\u0027t any mention of anyone being murdered.\"\u003c/p\u003e\n\u003cp\u003e\"Then they haven\u0027t found him yet.\"\u003c/p\u003e\n\u003cp\u003e\"If he\u0027s a member of the ton, someone would have noticed his disappearance by now. It\u0027s been two days, hasn\u0027t it, since you saw . . .\"\u003c/p\u003e\n\u003cp\u003e\"It has been two days, exactly,\" she interrupted.\u003c/p\u003e\n\u003cp\u003eCaine thought that if she became any more enthusiastic, she might jump out of her chair.\u003c/p\u003e\n\u003cp\u003e\"Which leads me to my first question,\" he announced. \"Exactly what did you see?\"\u003c/p\u003e\n\u003cp\u003eShe leaned back against her chair. \"Where are Lyon and Christina, do you suppose?\"\u003c/p\u003e\n\u003cp\u003e\"Are you avoiding my question?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I just don\u0027t want to have to tell it twice,\" she explained. Even as she gave that lie her mind was racing for another plausible story.\u003c/p\u003e\n\u003cp\u003e\"Lyon went out for a bit,\" he answered. \"And Christina is tending to Dakota. Answer me, please.\"\u003c/p\u003e\n\u003cp\u003eHer eyes widened.\u003c/p\u003e\n\u003cp\u003e\"Now what\u0027s the matter?\"\u003c/p\u003e\n\u003cp\u003e\"You just said please,\" she whispered. She sounded awestruck. \"If you\u0027re not careful, you\u0027ll soon be giving me the apologies you owe me.\"\u003c/p\u003e\n\u003cp\u003eHe knew better than to ask her why he should apologize, guessing she had her list of his faults memorized. Besides, the smile she just gave him was so dazzling, he could barely hold his concentration.\u003c/p\u003e\n\u003cp\u003e\"They pitched him from the roof.\"\u003c/p\u003e\n\u003cp\u003eCaine was jarred back to their topic when she made that announcement. \"You were on a roof?\" he asked her, trying to imagine what in God\u0027s name she\u0027d been up to.\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" she replied. \"Why would I be on a roof?\"\u003c/p\u003e\n\u003cp\u003e\"Jade ...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\" she asked, looking expectant again.\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t on a roof but you saw \"them\" throw this man ...\"\u003c/p\u003e\n\u003cp\u003e\"He was a finely dressed gentleman,\" she interrupted.\u003c/p\u003e\n\u003cp\u003e\"All right,\" he began again. \"You weren\u0027t on the roof but you saw several men throw this finely dressed gentleman from the roof? Is that it?\"\u003c/p\u003e\n\u003cp\u003e\"There were three of them.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re certain?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I was frightened, Caine, but I could still count.\"\u003c/p\u003e\n\u003cp\u003e\"Where were you when this happened?\"\u003c/p\u003e\n\u003cp\u003e\"On the ground.\"\u003c/p\u003e\n\u003cp\u003e\"I gathered that much,\" he muttered. \"If you weren\u0027t on the roof, I did assume ...\"\u003c/p\u003e\n\u003cp\u003e\"I could have been inside another building, or perhaps riding Nathan\u0027s fine horse, or even ...\"\u003c/p\u003e\n\u003cp\u003e\"Jade, stop rambling,\" he demanded. \"Just tell me where you were and what you saw.\"\u003c/p\u003e\n\u003cp\u003e\"What I heard is just as significant, Caine.\"\u003c/p\u003e\n\u003cp\u003e\"Are you deliberately trying to make me angry?\"\u003c/p\u003e\n\u003cp\u003eShe gave him a disgruntled look. \"I was just about to walk into the church when I heard all the commotion. They weren\u0027t actually on top of the church. No, they were dragging this poor man across\u003c/p\u003e\n\u003cp\u003ethe rectory\u0027s roof. It\u0027s a bit lower. From my position, I could see the gentleman was trying to get away from them. He was struggling and shouting for help. That\u0027s how I knew, Caine. I wasn\u0027t just imagining it.\"\u003c/p\u003e\n\u003cp\u003e\"And?\" he prodded when she suddenly quit her explanation.\u003c/p\u003e\n\u003cp\u003e\"They tossed him over. If I\u0027d been just a foot to the left, well sir, you wouldn\u0027t be having to protect me now. I\u0027d be as dead as the poor gentleman is.\"\u003c/p\u003e\n\u003cp\u003e\"Where is this church?\"\u003c/p\u003e\n\u003cp\u003e\"In Nathan\u0027s parish.\"\u003c/p\u003e\n\u003cp\u003e\"And where is that?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Three hours north of here,\" she answered.\u003c/p\u003e\n\u003cp\u003e\"Am I interrupting?\" Christina asked from the doorway.\u003c/p\u003e\n\u003cp\u003eJade turned to smile at her.\u003c/p\u003e\n\u003cp\u003e\"Of course not,\" Jade answered. \"Thank you for the lovely breakfast, and for loaning me your beautiful riding clothes. I shall take good care of them,\" she added.\u003c/p\u003e\n\u003cp\u003eLyon came up behind his wife and put his arms around her. While Caine and Jade watched, Christina\u0027s husband nuzzled the top of his wife\u0027s head.\u003c/p\u003e\n\u003cp\u003e\"Miss me?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Christina answered. She smiled up at her husband, then turned back to Jade. \"I went into your room . . .\"\u003c/p\u003e\n\u003cp\u003e\"Nothing happened,\" Jade rushed out. \"It\u0027s all his fault, really. But nothing happened, Christina. I tried to use my knife on him. That\u0027s all. He took exception, of course,\" she added as she waved her hand in Caine\u0027s direction. \"He was so bloody furious, he dragged me into his room. Oh Lord, I\u0027m making a muddle out of this, aren\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eShe turned to Caine. \"Will you say something, please? My new friend is going to think I\u0027m . ..\"\u003c/p\u003e\n\u003cp\u003eShe quit her explanation when she noticed Caine\u0027s astonished expression. He wasn\u0027t going to be any help at all, she realized. He was back to thinking she was daft.\u003c/p\u003e\n\u003cp\u003eShe could feel herself burning with embarrassment.\u003c/p\u003e\n\u003cp\u003e\"I went into your room to fetch your knife,\" Christina explained. \"You actually tried to cut him with that dull blade?\"\u003c/p\u003e\n\u003cp\u003eJade wanted to find a place to hide. \"No,\" she answered with a sigh. \u003c/p\u003e","sourceLink":"https://allnovel.net/guardian-angel-crown-s-spies-2/page-9.html","bookId":1791,"creation":"Oct 5, 2019 4:11:13 PM","modification":"Oct 5, 2019 4:11:13 PM"}
