{"id":92301,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It will take a moment to seep in,” she explained, sitting back on her haunches, her tail wavering over her head. “This is Mr. Sweeting’s work but poorly done. I know ze smell of his magic. I believe someone bought his poison too cheaply and applied it too hastily.” She nudged the spilled cake with the spoon. “Where did the cakes come from?”\u003c/p\u003e\n\u003cp\u003eThom looked up, his eyes red and wet with tears. “I brought them.”\u003c/p\u003e\n\u003cp\u003eHer eyes went dark. “When? From where?”\u003c/p\u003e\n\u003cp\u003e“Today, from the bakery on High Street, at her request. I stopped on the way here from work.”\u003c/p\u003e\n\u003cp\u003eReve stood, a graceful, fluid movement. Her slender fingers barely touched the plate as she leaned close to sniff the remaining five cakes.\u003c/p\u003e\n\u003cp\u003e“Sprinkled on top like sugar,” she said. “Who else has been in ze house?”\u003c/p\u003e\n\u003cp\u003e“Since I arrived, only me.” He jerked his chin at Casper’s splayed form. “And him.”\u003c/p\u003e\n\u003cp\u003eReve stalked across the room to where Casper lay in the shadows. He barely twitched as she leaned in close enough to kiss him, one hand on his chest. “Still bad news,” she muttered. “And getting worse. But he is a different kind of poison.” She glanced at Thom. “Stay with her. Don’t let go.”\u003c/p\u003e\n\u003cp\u003eThe daimon’s skin shivered over with shadows until all Thom could see of her was the glint of candlelight on her eyes. Moving like a stalking cat formed of smoke, she crept toward the door to the pet shop. The creatures within were still calling, fluttering, barking, scratching, and fighting against their cages. Reve disappeared through the door, dissolving into the darkness. Thom turned to Frannie, hoping beyond hope that she would move, or splutter, or blink. Anything.\u003c/p\u003e\n\u003cp\u003eBut nothing had changed. Her eyes were going dry, and he reached out to close them, hoping to lessen her pain somehow before dragging her into his lap and stroking back her copper-colored hair.\u003c/p\u003e\n\u003cp\u003e“I’m still here, lass. I’m not leavin’ ye. Just hold on.”\u003c/p\u003e\n\u003cp\u003eIn the pet shop, the birds took their chaos up a notch. The cages banged against one another, heavy wings slamming into the bars as the crows and parrots screamed en masse. The corgi pups took up a mournful, otherworldly howl. Thom wondered, for just a moment, if they could feel their mistress dying in his arms.\u003c/p\u003e\n\u003cp\u003eFrom the darkness of the pet shop, barely audible over the clamoring animals, there came a crash. Along with the sound of shattering glass, Thom heard a voice call out in anguish, shrieking in a language he didn’t know.\u003c/p\u003e\n\u003cp\u003e“Was that a terrarium?” Frannie whispered, and her shoulders shifted against him. He ignored the shop to pull her closer, tucking her head under his chin.\u003c/p\u003e\n\u003cp\u003eThom sent a silent prayer of thanks to Reve, to Ermenegilda, to the gods he had once cursed, standing before his own charred doorstep with a necklace of gray pearls in his hand.\u003c/p\u003e\n\u003cp\u003e“It doesna’ matter, little love,” he crooned. “We’ll get ye a new one.”\u003c/p\u003e\n\u003cp\u003e“What’s happened?” She tried to sit up, but her limbs were still weak.\u003c/p\u003e\n\u003cp\u003e“Bide a moment, love. Don’t try to stand yet.”\u003c/p\u003e\n\u003cp\u003e“But the shop,” she said, struggling harder. Another glass crashed, and a parrot mimicked a lady’s scream. “The birds—there’s something wrong in there. The bludkitten? I have to go calm them. That poor old parrot will have an apoplexy.” Her legs flopped against him like rubber, her fingers twitching.\u003c/p\u003e\n\u003cp\u003eThom chuckled, giving her a squeeze. “There’s more important things just now.”\u003c/p\u003e\n\u003cp\u003e“Thom. Why can’t I stand? What’s wrong with me?”\u003c/p\u003e\n\u003cp\u003e“You were poisoned.”\u003c/p\u003e\n\u003cp\u003e“By whom?” Frannie asked, her eyes searching his.\u003c/p\u003e\n\u003cp\u003eReve stepped into the doorway, clutching a dark cloak hiding a limp figure. She tossed it onto the floor, and it rolled, unconscious, to face the fire.\u003c/p\u003e\n\u003cp\u003e“By zis miserable excuse for a daimon.”\u003c/p\u003e\n\u003cp\u003e18\u003c/p\u003e\n\u003cp\u003eIt was a while before Frannie could stand on her own and even longer until the slight daimon in the cloak regained consciousness. By that time, the pathetic thing was bound to a chair with ropes from Reve’s bag that shimmered strangely in the firelight. With her hood pulled back, she seemed strangely small and starved, her skin smooth and slightly iridescent, like a fish’s belly.\u003c/p\u003e\n\u003cp\u003e“Who is your master?” Reve said, and the smaller daimon shrank back, turning her wasted face away. More softly, she added, “If you tell me, I may be able to free you.”\u003c/p\u003e\n\u003cp\u003e“Master Kind.” The daimon’s voice was high and quavering. “Bought me off Sweeting with the song of his heart. Told me he loved me. Promised he’d set me free if I did as I was told.”\u003c/p\u003e\n\u003cp\u003e“What were you told?”\u003c/p\u003e\n\u003cp\u003e“Kill that.” The daimon gestured to Frannie with her pointed chin, and Thom moved forward menacingly, his hands in fists at his side. Reve gave him a look and shook her head, and Frannie pulled Thom back with two still-weak hands around his wrist.\u003c/p\u003e\n\u003cp\u003e“Tell me exactly what you were told, word for word. I will know if you lie.” Reve’s tail curled over her head and was poised, waving like a snake, inches from the other daimon’s eye.\u003c/p\u003e\n\u003cp\u003eThe daimon didn’t flinch, only narrowed her eyes at Frannie. “That one”—she cocked her head at Frannie—“stood in the street over that one.” They all turned to follow her stare toward Casper, who slumped against the wall behind them, looking half-asleep and mid-nightmare. “Master Kind pointed and said, ‘Kill that man, and I’ll set you free. Don’t be seen or leave behind anything that can be traced to me.’ ” The daimon shrugged narrow shoulders and looked down, pained. “I been trying. I been following everywhere. I been failing. It’s awful hard to kill. I was waiting, this time, to make sure. That spell was hard bought.”\u003c/p\u003e\n\u003cp\u003e“Master Kind? Edwin Kind?” Frannie said. “The musician?”\u003c/p\u003e\n\u003cp\u003e“Not much of a musician, if you ask me,” Casper muttered.\u003c/p\u003e\n\u003cp\u003eThe daimon nodded. “He’ll never have me now. Never.” She burst into tears, her thin body shaking horribly.\u003c/p\u003e\n\u003cp\u003e“Do you think,” Casper said slowly, carefully enunciating each word, “that he meant to kill me?”\u003c/p\u003e\n\u003cp\u003eFrannie, Thom, and Reve all turned to glare at him.\u003c/p\u003e\n\u003cp\u003e“Of course, he meant you, ye great ninny!” Thom said. “The puir wee thing just botched it.”\u003c/p\u003e\n\u003cp\u003e“But I’m not a man,” Frannie said. “Kind pointed to the two of us and told the daimon to kill the man. What would make the daimon think . . .”\u003c/p\u003e\n\u003cp\u003eCasper lurched up and staggered to the door, furious and panting. “I’ll be leaving now,” he said, voice ragged. “I’ll send for my things. Better yet, keep them to pay for the trouble I’ve caused you. Good-bye, Frannie. I’m sorry. For everything.” Bottle in hand, he slammed the door and disappeared into the alley.\u003c/p\u003e\n\u003cp\u003e“What was that all about?” Frannie asked, throwing her hands up in the air and sitting in a chair before her legs could collapse beneath her.\u003c/p\u003e\n\u003cp\u003eThom rubbed his chin, watching the door. “It means Casper’s not human,” he said thoughtfully. “But what is he, then?”\u003c/p\u003e\n\u003cp\u003eReve smiled a secret smile. “I don’t think even he knows yet,” she said. “But I suspect he will find out rather soon.”\u003c/p\u003e\n\u003cp\u003eReve took the other daimon with her into the night. No matter how often and how many ways Frannie asked what would become of the pathetic creature, Reve simply pursed her lips.\u003c/p\u003e\n\u003cp\u003e“Daimon business is daimon business” was her only answer. “She will trouble you no more.”\u003c/p\u003e\n\u003cp\u003eThom locked the door and glanced into the pet shop, but the birds and pups had quieted. He turned on the light and winced. “The wee green snake is a bit of a mess,” he said. “Smushed.”\u003c/p\u003e\n\u003cp\u003e“It’ll keep till morning. And good riddance.” Frannie put her head in her hands. Her lips were still numb, her eyes achy and stinging. “Good heavens, what a wreck. And we never finished dinner.”\u003c/p\u003e\n\u003cp\u003e“That’ll keep till morning, too, lass. And it could still be poisoned.”\u003c/p\u003e\n\u003cp\u003eFor the third time—or fourth, she kept losing count—Thom picked her up and carried her upstairs, depositing her gently in her bed. His big hands were surprisingly nimble with her bootlaces and tender as he rolled down the high stockings.\u003c/p\u003e\n\u003cp\u003e“Top drawer,” she said, cutting her eyes to the dresser. “On the left.”\u003c/p\u003e\n\u003cp\u003eHe obediently fetched her other nightgown as she unbuttoned the sweat-soaked blouse and slithered out of the heavy tweed skirt. When he turned around to find her in only a corset and petticoats, he swallowed hard and squeezed his eyes shut. “I can’t be lookin’ at ye like that, not when you’re half-killed.”\u003c/p\u003e\n\u003cp\u003e“I’m still half-numb, honestly. And yet I feel better than I have in days. No one’s going to try to murder me tonight, and that’s rather saying something. Except the kitten—”\u003c/p\u003e\n\u003cp\u003e“Reve took it,” Thom said. His eyes roamed over her, cautious but glowing, and he unconsciously balled the forgotten nightgown in his hands. “Nothing to be afeared of. I’ll keep ye safe, lass.”\u003c/p\u003e\n\u003cp\u003eShe held out her arms, and although they shook a little, he gladly settled into them and curled on the bed beside her. “If I asked you to kiss me, would you?” she asked.\u003c/p\u003e\n\u003cp\u003e“I shouldn’t. Ye were on death’s door, woman!”\u003c/p\u003e\n\u003cp\u003e“But now I’m on the other side. Just hold me close, and don’t let go, aye?”\u003c/p\u003e\n\u003cp\u003eHe dropped the nightgown onto the floor and stroked her hair back before cupping her face and kissing her, soft and warm and sweet. “I can help ye with that,” he murmured. “But I’m no’ bringing cakes this time.”\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003eThree days later, a knock on the pet shop door set the puppies howling. Frannie was distributing seed to the sleep-ruffled birds as Thom dodged Filbert and swept up spilled hay and feathers, clad only in trousers and shirt. It wasn’t yet opening time, and their eyes met across the room, cautious.\u003c/p\u003e\n\u003cp\u003eThom reached the door first, peeking through the glass before unlocking it and looming at full height over the ragamuffin on the doorstep. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-peculiar-pets-of-miss-pleasance-blud-2/page-20.html","bookId":1602,"creation":"Oct 5, 2019 5:54:46 PM","modification":"Oct 5, 2019 5:54:46 PM"}
