{"id":69156,"no":3,"title":"Page 3","content":"\u003cp\u003e\"Do you think that’s going to make me change my mind about walking you to your car?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Her hands were buried in her pockets. \"I…just wanted you to know. It might make a difference to some men.\"\u003c/p\u003e\n\u003cp\u003e\"Not me.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"My car’s in the lot near Yesler.\"\u003c/p\u003e\n\u003cp\u003eBrand didn’t know Seattle well, but he knew enough to recognize that that area of town wasn’t the best place for a woman to be walking alone at night. He was glad he’d insisted on escorting her to her car, although even now he wasn’t completely sure of his motives.\u003c/p\u003e\n\u003cp\u003eThey turned off the main street and onto a small, narrower one that sloped sharply down to the Seattle waterfront.\u003c/p\u003e\n\u003cp\u003e\"You park here often?\" As prickly as she was, Erin would probably resent his pointing out the all-too-obvious dangers of the area.\u003c/p\u003e\n\u003cp\u003e\"Every day, but generally I’m gone shortly after five. It’s still light then.\"\u003c/p\u003e\n\u003cp\u003e\"Tonight?\"\u003c/p\u003e\n\u003cp\u003e\"Tonight,\" she said with a sigh, \"I met you.\"\u003c/p\u003e\n\u003cp\u003eBrand nodded. He found the parking lot, which by now was nearly deserted. The spaces were tightly angled between two brick buildings. The entire lot was illuminated by a single dim light.\u003c/p\u003e\n\u003cp\u003eErin pulled her keys from her purse and clenched them in her hands. \"My car is the one in the back,\" she explained.\u003c/p\u003e\n\u003cp\u003eBrand’s gaze located the small blue Toyota in the rear of the lot, facing a two-story brick structure. Once more he was forced to swallow a chastising warning.\u003c/p\u003e\n\u003cp\u003e\"I didn’t want to say anything earlier, but I’m grateful you walked with me.\"\u003c/p\u003e\n\u003cp\u003eA small – damn small – sense of satisfaction filled him. \"You’re welcome.\"\u003c/p\u003e\n\u003cp\u003eShe inserted the key into the driver’s door and unlocked her car. Pausing, she glanced up at him and smiled shyly.\u003c/p\u003e\n\u003cp\u003eBrand looked down on the slender young woman at his side and read her confusion and her regret. The desire to pull her close was so strong that it was nearly impossible to ignore.\u003c/p\u003e\n\u003cp\u003e\"I’m sorry the navy hurt you.\"\u003c/p\u003e\n\u003cp\u003e\"It didn’t. Not as much as I led you to believe. I just want to be on the safe side. For the first time in my life I have a real home with real furniture that I purchased without thinking about how well it would travel.\" She hesitated and smiled. \"I don’t worry about being transferred every other year, and – \" She hesitated again and shook her head as though to suggest he wouldn’t understand. \"I apologize if I wounded your ego. You’re really very nice.\"\u003c/p\u003e\n\u003cp\u003e\"A kiss would go a long way toward repairing the damage.\" Brand couldn’t believe he’d suggested that, but what the hell. Why not?\u003c/p\u003e\n\u003cp\u003e\"A kiss?\"\u003c/p\u003e\n\u003cp\u003eBrand nearly laughed out loud at the shocked look that came over her features. It was downright comical, as if she’d never been kissed before, or at least it had been a good long while. Not taking the time to decide which it was, he cradled her face between his large hands.\u003c/p\u003e\n\u003cp\u003eHer mouth was moist and parted, welcoming- Her eyes weren’t. They were filled with doubts, but he chose to ignore her unspoken questions, fearing that if he took the time to reassure her he’d talk himself out of kissing her.\u003c/p\u003e\n\u003cp\u003eBrand wanted this kiss.\u003c/p\u003e\n\u003cp\u003eIf Erin had questions, he was experiencing a few of his own. She was his friend’s daughter, and he was risking Casey’s wrath with this little game. But none of that seemed to matter. What did concern him was the woman staring boldly up at him.\u003c/p\u003e\n\u003cp\u003eTenderness filled him. A strange tenderness, one he didn’t fully understand or recognize. Slowly he lowered his mouth to hers. He felt her go tense with anticipation as their lips clung.\u003c/p\u003e\n\u003cp\u003eShe was soft, warm and incredibly sweet. He opened his mouth a little more, slanting his lips over hers as he plowed his fingers through her thick hair.\u003c/p\u003e\n\u003cp\u003eHer first response was tentative, as if she’d been caught unprepared, but then she sighed and sagged against him. She flattened her hands over his chest, then flexed her fingers, her long nails scraping his sweater.\u003c/p\u003e\n\u003cp\u003eGradually she opened to him, like a hothouse flower blossoming in his arms. Yet it was she who broke the contact. Her eyes were wide and soft as she stared up at him. A feeling of surprise and tenderness and need washed through him.\u003c/p\u003e\n\u003cp\u003e\"I… was just thinking,\" she said in a lacy whisper.\u003c/p\u003e\n\u003cp\u003eJust now, thinking could be dangerous. Brand knew that from experience. He silenced her with a kiss that was so thorough it left them both trembling in its aftermath.\u003c/p\u003e\n\u003cp\u003eOnce again, Erin was clinging to him, her hands gripping the V of his sweater as if she needed to hold on to something in order to remain upright.\u003c/p\u003e\n\u003cp\u003e\"The rules you have about dating military men?\" he asked, rubbing his open mouth over her honeyed lips. \"How about altering them?\"\u003c/p\u003e\n\u003cp\u003e\"Altering them?\" she echoed slowly, her eyes closed.\u003c/p\u003e\n\u003cp\u003eHe kissed her again for good measure. \"Make it a guideline instead,\" he suggested.\u003c/p\u003e\n\u003cp\u003eChapter Two\u003c/p\u003e\n\u003cp\u003eAs an adult, Erin had made several decisions about how she intended to live her life. She followed the Golden Rule, and she never used her credit cards if she couldn’t pay off the balance the following month.\u003c/p\u003e\n\u003cp\u003eAnd she didn’t date men in the military.\u003c/p\u003e\n\u003cp\u003eHer life wasn’t encumbered with a lot of restrictions. Everything that was important and necessary was wrapped up in these relatively simple rules.\u003c/p\u003e\n\u003cp\u003eThen why, she asked herself, had she agreed to have dinner with Brand Davis? Lieutenant Davis, J.G. she reminded herself disparagingly.\u003c/p\u003e\n\u003cp\u003e\"Why?\" she repeated aloud, stacking papers against the edge of her desk with enough force to bend them in half.\u003c/p\u003e\n\u003cp\u003e\"Heavens, don’t ask me,\" Aimee answered, grinning impishly. After a day spent interviewing job applicants, talking aloud to oneself was an accepted form of behavior.\u003c/p\u003e\n\u003cp\u003e\"I’m supposed to meet him tonight, you know,\" Erin said in a low, thought-filled voice. If there had been an easy way out of this, she’d have grabbed it.\u003c/p\u003e\n\u003cp\u003eIf only Brand hadn’t kissed her. No one had ever told her kissing could be so…so pleasant. First her knees had gone weak, and then her formidable will of iron had melted and pooled at her feet. Before she’d even realized what she was doing, she’d mindlessly walked into Brand’s trap. It was just like a navy man to zero in on her weakest point and attack.\u003c/p\u003e\n\u003cp\u003eRolling her antique oak chair away from her desk, Aimee relaxed against its rail back and angled her head to one side as she studied Erin. \"Are you still lamenting the fact you agreed to have dinner with that gorgeous hunk? Honey, trust me in this, you should be counting your blessings.\"\u003c/p\u003e\n\u003cp\u003e\"He’s military.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" Aimee rotated a pen between her hands as she gazed dreamily into the distance. A contented look stole over her features as she released a long-drawn-out sigh. \"I can just picture him in a uniform, standing at attention. Why, it’s enough to make my heart go pitter-patter.\"\u003c/p\u003e\n\u003cp\u003eErin refused to look at her friend. If Aimee wanted Brand, she was welcome to him. Of course, her friend wasn’t truly interested, since she was already married to Steve and had been for a decade. \"If I could think of a plausible excuse to get out of this, I would.\"\u003c/p\u003e\n\u003cp\u003e\"You’ve got to be kidding.\"\u003c/p\u003e\n\u003cp\u003eShe wasn’t. \"You have dinner with him.\"\u003c/p\u003e\n\u003cp\u003eAimee shook her head eagerly. \"Trust me, if I were five years younger I’d take you up on that.\"\u003c/p\u003e\n\u003cp\u003eSince Aimee’s marriage was going through some rocky times, Erin didn’t think it was necessary to remind her friend that dating wasn’t something that should interest her.\u003c/p\u003e\n\u003cp\u003e\"Relax, would you?\" Aimee admonished her.\u003c/p\u003e\n\u003cp\u003e\"I can’t.\" Erin tucked her stapler and several pens neatly inside her desk drawer. \"As far as I’m concerned, this evening is going to be a total waste of time.\" She could be doing something important, like… like laundry or answering mail. It was just her luck that Brand had suggested Wednesday night. Tuesday was the first class for the new session for the Women In Transition course. Thursday night was the second session. Naturally, Brand had chosen to ask her out the one night of the week when she was free.\u003c/p\u003e\n\u003cp\u003e\"You’re so tense,\" Aimee chastised. \"You might as well be walking around in a suit of armor.\"\u003c/p\u003e\n\u003cp\u003e\"I’ll be okay,\" Erin said, not listening to her fellow worker. She stood and planted her hands against the side of her desk before sighing heavily. \"This is what I’m going to do. I’ll meet him just the way we arranged.\"\u003c/p\u003e\n\u003cp\u003e\"That’s a good start,\" Aimee teased.\u003c/p\u003e\n\u003cp\u003e\"We’ll find a restaurant, and I’ll order right away, eat and then make my excuses as soon as I can. I don’t want to insult him, but at the same time I want him to understand I regret ever having agreed to this date.\" She waited for a response. When Aimee didn’t give her one, she arched her brows expectantly. \"Well?\"\u003c/p\u003e\n\u003cp\u003e\"It sounds good to me.\" But the look Aimee gave her said otherwise.\u003c/p\u003e\n\u003cp\u003eIt was amazing how much a person could say with a look. Erin didn’t want to take the time to dwell on the fact, especially now, when she was thinking about the messages she’d given Brand the night he’d kissed her.\u003c/p\u003e\n\u003cp\u003eApparently she’d encouraged him enough to ask her out to dinner a second time.\u003c/p\u003e\n\u003cp\u003eErin didn’t want to dwell on that night. It embarrassed her to think about the way she’d responded so openly to his touch. Her face grew hot just remembering. She shouldn’t think about it – she was running late as it was. Reaching for her purse, she checked her watch and hurried toward the elevator.\u003c/p\u003e\n\u003cp\u003e\"Don’t get started in the morning until we’ve had a chance to talk,\" Aimee called out after her.\u003c/p\u003e\n\u003cp\u003eThey generally clocked in at eight, reviewed files and then spent a large portion of the day with job applicants or meeting with prospective employers. Sometimes she wasn’t back in the office until after four.\u003c/p\u003e\n\u003cp\u003e\"I won’t,\" Erin promised without looking back. Walking briskly, she raised her hand in farewell.\u003c/p\u003e\n\u003cp\u003e\"Have a good time,\" Aimee called out in a provocative, teasing tone that attracted the notice of their peers.\u003c/p\u003e\n\u003cp\u003eThis time Erin did turn back to discover her co-worker sitting on the edge of her desk, her arms folded, one leg swinging. A mischievous grin brightened her round, cheerful face.\u003c/p\u003e\n\u003cp\u003eBut Erin wasn’t counting on this evening being much fun.\u003c/p\u003e\n\u003cp\u003eOnce outside the revolving glass door of the tall office complex, Erin paused and glanced around. Brand had said he’d be waiting for her there. She didn’t see him right away, and she was beginning to think he wasn’t going to show.\u003c/p\u003e\n\u003cp\u003eIt must have been wishful thinking on her part, because no sooner had the thought entered her mind than he stepped away from the building and sauntered toward her.\u003c/p\u003e\n\u003cp\u003eHis gaze found hers, and Erin was struck afresh by what a devilishly handsome man Brandon Davis was. If she wasn’t careful, she might find herself attracted to him. She wasn’t immune to good looks and charm, and they seemed to ooze from every pore of his muscular body.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" she greeted stiffly. Her defenses were in place as she deliberately kept her eyes trained away from his smile. It was compelling enough to dazzle the most stouthearted. Erin hadn’t had enough experience with the opposite sex to build up a resistance to a man like Brand. \u003c/p\u003e","sourceLink":"https://allnovel.net/navy-brat-navy-3/page-3.html","bookId":1958,"creation":"Oct 5, 2019 10:12:59 AM","modification":"Oct 5, 2019 10:12:59 AM"}
