{"id":108014,"no":25,"title":"Page 25","content":"\u003cp\u003eSEVENTY-ONE\u003c/p\u003e\n\u003cp\u003eSTEPHANIE WATCHED THORVALDSEN CLAMP ELY LUND IN A FERVENT embrace, like the affection of a father who\u0027d found a lost son.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s so wonderful to see you,\" Thorvaldsen said. \"I thought you were gone.\"\u003c/p\u003e\n\u003cp\u003e\"What in the world are you doing here?\" Ely asked, amazement in his voice.\u003c/p\u003e\n\u003cp\u003eThorvaldsen seemed to recover his composure and introduced Stephanie.\u003c/p\u003e\n\u003cp\u003e\"Ely,\" she said, \"we\u0027re kind of like an Egyptian mummy. Pressed for time. Lots happening. Can we talk?\"\u003c/p\u003e\n\u003cp\u003eHe led them both inside. The cabin was a dull place, sparsely furnished with lots of books, magazines, and papers. She noticed nothing electrical.\u003c/p\u003e\n\u003cp\u003e\"No power here,\" he said. \"I cook with gas and heat with wood. But there\u0027s clean water and lots of privacy.\"\u003c/p\u003e\n\u003cp\u003e\"How did you get here?\" Thorvaldsen asked. \"Is Zovastina holding you?\"\u003c/p\u003e\n\u003cp\u003eA puzzled look came to the man\u0027s face. \"Not at all. She saved my life. She\u0027s been protecting me.\"\u003c/p\u003e\n\u003cp\u003eThey listened as Ely explained how a man had barged into his Samarkand house and held him at gunpoint. But before anything had happened, another man saved him, killing the first. Then, his house was burned with the attacker inside. Ely had been taken to Zovastina, where she explained that her political enemies had targeted him. He was secretly brought to the cabin, where he\u0027d remained the past few months. Only a solitary guard, who lived in the village, came to check on him twice a day and brought supplies.\u003c/p\u003e\n\u003cp\u003e\"The guard has a mobile phone,\" Ely said. \"That\u0027s how Zovastina and I communicate.\"\u003c/p\u003e\n\u003cp\u003eStephanie needed to know, \"You told her about Ptolemy\u0027s riddle? About elephant medallions and Alexander\u0027s lost tomb?\"\u003c/p\u003e\n\u003cp\u003eEly grinned. \"She loves to talk about it. The Iliad is a passion of hers. Anything Greek, for that matter. She\u0027s asked me lots of questions. Still does, almost every day. And, yes, I told her all about the medallions and the lost tomb.\"\u003c/p\u003e\n\u003cp\u003eShe could see that Ely had no conception of what was happening, of the danger all of them, including him, were in. \"Cassiopeia is Zovastina\u0027s prisoner. Her life could be at stake.\"\u003c/p\u003e\n\u003cp\u003eShe saw all of the confidence leave him. \"Cassiopeia\u0027s here? In the Federation? Why would the Supreme Minister want to harm her?\"\u003c/p\u003e\n\u003cp\u003e\"Ely,\" Thorvaldsen said, \"let\u0027s just say that Zovastina is not your savior. She\u0027s your jailer, though she\u0027s constructed a clever jail-one that kept you contained without much effort.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know how many times I wanted to call Cassiopeia. But the Supreme Minister said we needed secrecy right now. I might place others in jeopardy, including Cassiopeia, if I involved them. She assured me all this would be over soon, and I could call who I wanted and go back to work.\"\u003c/p\u003e\n\u003cp\u003eStephanie decided to get to the point. \"We solved Ptolemy\u0027s riddle. We found a scytale that contained a word.\" She handed him a square of paper upon which was written. \"Can you translate it?\"\u003c/p\u003e\n\u003cp\u003e\"Klimax. Old Greek for ladder.\"\u003c/p\u003e\n\u003cp\u003e\"What possible significance could that have?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe seemed to shake himself free of any speculation. \"Is this in the context of the riddle?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s supposedly the place where the grave is located. Touch the innermost being of the golden illusion. Divide the phoenix. Life provides the measure of the true grave. We did all that and\"-she pointed to the paper-\"that\u0027s what we found.\"\u003c/p\u003e\n\u003cp\u003eEly seemed to grasp the enormity with no prompting. He stepped across to one of the tables and plucked a book from one of the stacks. He thumbed through, found what he was after, then flattened the volume on the table. She and Thorvaldsen stepped close and saw a map labeled \"Alexander\u0027s Bactrian Conquests.\"\u003c/p\u003e\n\u003cp\u003e\"Alexander swept eastward and took what is today Afghanistan and the Federation-what was once Turkmenistan, Tajikistan, and Kyrgyzstan. He never crossed the Pamirs into China. Instead, he veered south to India, where his conquests ended when his army revolted.\" Ely pointed to the map. \"The area here, between the Jaxartes and Oxus Rivers, Alexander conquered in 330 BCE. To the south was the land of Bactria. To the north Scythia.\"\u003c/p\u003e\n\u003cp\u003eShe instantly connected the dots. \"That\u0027s where Alexander learned about the draught from the Scythians.\"\u003c/p\u003e\n\u003cp\u003eEly seemed impressed. \"That\u0027s right. Samarkand existed then, in a region called Sogdiana, though the city itself was named Maracanda. Alexander established one of his many Alexandrias, here, calling it Alexandria Eschate, the Furthest. It was the city most east in his empire, and one of the last he founded.\"\u003c/p\u003e\n\u003cp\u003eEly traced his finger on the map and noted, with a pen, an X. \"Klimax was a mountain, here, in what was once Tajikistan, now in the Federation. A place revered by the Scythians and, later, by Alexander, after he negotiated a peace with them. It was said that their kings were buried in these mountains, though no evidence of that has ever been found. The museum in Samarkand sent a couple of expeditions to look around, but found nothing. Pretty barren place, in fact.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s exactly where the scytale points,\" Thorvaldsen said. \"Have you been to the area?\"\u003c/p\u003e\n\u003cp\u003eEly nodded. \"Two years ago. Part of an expedition. I\u0027m told that a good bit of this is now privately owned. One of my colleagues at the museum said there\u0027s a huge estate at the base of the mountain. A monstrous thing. Under construction.\"\u003c/p\u003e\n\u003cp\u003eStephanie recalled what Edwin Davis had told her about the Venetian League. Members were buying property, so she played a hunch. \"Do you know who owns it?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"No idea.\"\u003c/p\u003e\n\u003cp\u003e\"We need to go,\" Thorvaldsen said. \"Ely, can you lead us there?\"\u003c/p\u003e\n\u003cp\u003eThe younger man nodded. \"It\u0027s about three hours south.\"\u003c/p\u003e\n\u003cp\u003e\"How are you feeling?\"\u003c/p\u003e\n\u003cp\u003eStephanie realized what the Dane meant.\u003c/p\u003e\n\u003cp\u003e\"She knows,\" Thorvaldsen said. \"Ordinarily, I would have never said a thing, but these are far from ordinary times.\"\u003c/p\u003e\n\u003cp\u003e\"Zovastina has been supplying my daily medications. I told you she\u0027s been good to me. How\u0027s Cassiopeia?\"\u003c/p\u003e\n\u003cp\u003eThorvaldsen shook head. \"Unfortunately, I\u0027m afraid her health may well be the least of her worries.\"\u003c/p\u003e\n\u003cp\u003eA car engine grew louder outside.\u003c/p\u003e\n\u003cp\u003eStephanie stiffened and raced to the window. A man slid out of an Audi with an automatic rifle.\u003c/p\u003e\n\u003cp\u003e\"My guard,\" Ely said over her shoulder. \"From the village.\"\u003c/p\u003e\n\u003cp\u003eThe man shot out the tires on their car.\u003c/p\u003e\n\u003cp\u003eSEVENTY-TWO\u003c/p\u003e\n\u003cp\u003eSAMARKAND\u003c/p\u003e\n\u003cp\u003eCASSIOPEIA WAS HAVING TROUBLE GAUGING ZOVASTINA.\u003c/p\u003e\n\u003cp\u003e\"I was just visited by the deputy national security adviser to the American president. He told me the same thing you said at the airport. That I missed something in Venice and that you know what that is.\"\u003c/p\u003e\n\u003cp\u003e\"And you think this is going to get me to tell you?\"\u003c/p\u003e\n\u003cp\u003eZovastina admired the two stout trees, their trunks held close to the ground by a coiled rope. \"I had this clearing prepared years ago. Several have felt the agony of being torn apart alive. A couple of them actually survived their arms being ripped from their bodies. It took a few minutes for them to bleed to death.\" She shook her head. \"Horrible way to leave this world.\"\u003c/p\u003e\n\u003cp\u003eCassiopeia was helpless. Little she could do but try and bluff her way out. Viktor, who was supposedly here to help, had done nothing but make her situation worse.\u003c/p\u003e\n\u003cp\u003e\"After Hephaestion died, Alexander killed his personal physician this same way. I thought it ingenious, so I resurrected the practice.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m all you have,\" she said in a flat tone.\u003c/p\u003e\n\u003cp\u003eZovastina seemed curious. \"Really? And what is it you have?\"\u003c/p\u003e\n\u003cp\u003e\"Apparently, Ely didn\u0027t share with you what he did with me.\"\u003c/p\u003e\n\u003cp\u003eZovastina stepped close. She was a muscular woman, sallow-faced. Worrisome was the transient look of madness that occasionally revealed itself in anxious dark eyes. Especially now, when her guts were being stoked with both curiosity and anger. \"Do you know the Iliad? When Achilles finally vents his anger and kills Hector, he says something interesting. I only wish my fury would compel me to cut away your flesh and eat it raw for what you\u0027ve done. No one can keep the dogs off of your head, not if they brought me ransom of ten or twenty times as much, or more. Tell me, why are you here?\"\u003c/p\u003e\n\u003cp\u003e\"You brought me.\"\u003c/p\u003e\n\u003cp\u003e\"You never resisted.\"\u003c/p\u003e\n\u003cp\u003e\"You risked a lot coming to Venice. Why? It couldn\u0027t be all political.\"\u003c/p\u003e\n\u003cp\u003eShe noticed that Zovastina\u0027s eyes seemed a bit less belligerent.\u003c/p\u003e\n\u003cp\u003e\"Sometimes we\u0027re called upon to act for others. To risk things. No quest worth the effort is without risk. I\u0027ve been searching for Alexander\u0027s grave, hoping there might be answers there to some perplexing problems. Ely surely told you about Alexander\u0027s draught. Who knows if there\u0027s anything there? But to find the place. How glorious that would be.\"\u003c/p\u003e\n\u003cp\u003eZovastina spoke more in wonder than anger. She seemed genuinely moved by the thought. On the one hand she cast herself a foolish romantic, consumed with notions of greatness gained from dangerous quests. On the other, according to Thorvaldsen, she was plotting the death of millions.\u003c/p\u003e\n\u003cp\u003eZovastina clamped Cassiopeia\u0027s chin in a strong hold. \"You need to tell me now what you know.\"\u003c/p\u003e\n\u003cp\u003e\"The priest lied to you. In the basilica\u0027s treasury is an amulet that was found in the remains of St. Mark. A heart scarab with a phoenix carved into it. Remember the riddle. Touch the innermost being. Divide the phoenix.\"\u003c/p\u003e\n\u003cp\u003eZovastina seemed not to hear her. \"You are beautiful.\" Her breath stank of onion. \"But you\u0027re a liar and a cheat. Here to deceive me.\"\u003c/p\u003e\n\u003cp\u003eZovastina released her grip and stepped away.\u003c/p\u003e\n\u003cp\u003eCassiopeia heard the bleating of goats.\u003c/p\u003e\n\u003cp\u003eMALONE MOUNTED THE HORSE.\u003c/p\u003e\n\u003cp\u003e\"None of the roof guards will pay us any attention,\" Viktor said. \"You\u0027re with me.\"\u003c/p\u003e\n\u003cp\u003eViktor hopped back onto his ride. \"They\u0027re beyond the playing field, in the woods. She\u0027s planning on killing Vitt.\"\u003c/p\u003e\n\u003cp\u003e\"What are we waiting for?\"\u003c/p\u003e\n\u003cp\u003eViktor kicked his horse. Malone followed.\u003c/p\u003e\n\u003cp\u003eThey galloped from the corral toward an open field. He noticed striped poles at each end and an earthen pan in its center and knew what was played here. Buzkashi. He\u0027d read about the game, its violence, how deaths were routine, the barbarity and beauty it simultaneously displayed. Zovastina was apparently a connoisseur and the stabled horses were surely bred to participate, like the steed beneath him, loping forward with uncanny speed and ability. Littered across the grassy field were goats that seemed to provide an excellent manicure service. Maybe a hundred or more, and large, scattering as the horses thundered past.\u003c/p\u003e\n\u003cp\u003eHe glanced back and noticed gun posts atop the palace. As Viktor had predicted, no one seemed alarmed, surely accustomed to their Supreme Minister\u0027s exploits. Ahead, at the far end of the field, stood a thick stand of trees. Two paths cut a route into them. Viktor brought his horse to a stop. Malone reined his in, too. His legs dangled against dark streaks of sweat on the animal\u0027s flanks.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re maybe a hundred meters down that trail, in another clearing. It\u0027s up to you now.\"\u003c/p\u003e\n\u003cp\u003eHe slid from the saddle, gun in hand.\u003c/p\u003e\n\u003cp\u003e\"WE HAVE A PROBLEM,\" STEPHANIE SAID. \"IS THERE ANOTHER WAY out of here?\"\u003c/p\u003e\n\u003cp\u003eEly motioned toward the kitchen.\u003c/p\u003e\n\u003cp\u003eShe and Thorvaldsen rushed forward just as the cabin\u0027s front door burst inward. The man barked orders in a language she did not understand. She found the kitchen door and opened it, cautioning Thorvaldsen for quiet. Ely was speaking to the man in the same language.\u003c/p\u003e\n\u003cp\u003eShe slipped outside. Thorvaldsen followed.\u003c/p\u003e\n\u003cp\u003eAutomatic gunfire exploded from inside the cabin and bullets ripped into the heavy timbers behind them.\u003c/p\u003e\n\u003cp\u003eThey fell to the ground as a window exploded. Glass showered outward. Bullets found trees. She heard Ely yell something to their attacker and used that instant to spring to her feet and race around the cabin toward the car. Thorvaldsen remained on the ground, struggling to stand, and she could only hope Ely delayed the guard long enough.\u003c/p\u003e\n\u003cp\u003eShe reached the car, opened the rear door, and gripped one of the automatics.\u003c/p\u003e\n\u003cp\u003eThorvaldsen rounded the cabin.\u003c/p\u003e\n\u003cp\u003eShe assumed a defensive position with the car as a buffer, aiming across the hood, and motioned with the gun for Henrik to go right onto the front porch. He veered out of her line of fire, just as the guard appeared, his rifle leveled waist high. He seemed to spot Thorvaldsen first and pivoted to adjust his aim.\u003c/p\u003e\n\u003cp\u003eShe fired twice.\u003c/p\u003e\n\u003cp\u003eBoth bullets found the man\u0027s chest.\u003c/p\u003e\n\u003cp\u003eShe fired twice more.\u003c/p\u003e\n\u003cp\u003eThe guard collapsed to the ground.\u003c/p\u003e\n\u003cp\u003eSilence gripped her. She did not move until Ely appeared from behind the dead guardsman. Thorvaldsen stepped off the porch. Her gun was still aimed, both hands locked on the stock. Shaking. She\u0027d killed a man.\u003c/p\u003e\n\u003cp\u003eHer first.\u003c/p\u003e\n\u003cp\u003eThorvaldsen walked toward her. \"You okay?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve heard others talk about it. I told them it was their job. But now I understand. Killing someone is a big deal.\"\u003c/p\u003e\n\u003cp\u003e\"You had no choice.\"\u003c/p\u003e\n\u003cp\u003eEly walked over. \"He wouldn\u0027t listen. I told him you weren\u0027t a threat.\"\u003c/p\u003e\n\u003cp\u003e\"But we are,\" Thorvaldsen said. \"I\u0027m sure his orders were for no one to make contact with you. That would be the last thing Zovastina would want.\"\u003c/p\u003e\n\u003cp\u003eStephanie\u0027s mind began to clear. \"We need to leave.\"\u003c/p\u003e\n\u003cp\u003eSEVENTY-THREE\u003c/p\u003e\n\u003cp\u003eMALONE ADVANCED INTO THE WOODS, BLACK AND SILENT AND seemingly filled with threats. He spied a clearing ahead where sunshine spread unaffected by the leafy canopy. He glanced back and did not see Viktor, but understood why the man had disappeared. He heard voices, so he increased his pace, stopping behind a thick trunk near the path\u0027s end.\u003c/p\u003e\n\u003cp\u003eHe saw Cassiopeia. Tied between two trees. Her arms stretched outward. Irina Zovastina standing beside her.\u003c/p\u003e\n\u003cp\u003eViktor was right.\u003c/p\u003e\n\u003cp\u003eBig trouble.\u003c/p\u003e\n\u003cp\u003eZOVASTINA WAS BOTH INTRIGUED AND IRRITATED WITH CASSIOPEIA Vitt. \"You don\u0027t seem to care that you\u0027re about to die.\"\u003c/p\u003e\n\u003cp\u003e\"If I cared, I wouldn\u0027t have come with you.\"\u003c/p\u003e\n\u003cp\u003eShe decided it was time to give the woman a reason to live. \"You asked on the plane about Ely. Whether he was alive. I didn\u0027t answer you. Don\u0027t you want to know?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t believe a word you said.\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"That\u0027s a fair statement. I wouldn\u0027t, either.\"\u003c/p\u003e\n\u003cp\u003eShe found a phone in her pocket and pushed one of the buttons.\u003c/p\u003e\n\u003cp\u003eSTEPHANIE HEARD A RINGING. HER GAZE SHOT TO THE DEAD MAN lying on the rocky ground.\u003c/p\u003e\n\u003cp\u003eThorvaldsen heard it, too.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Zovastina,\" Ely said. \"She calls me on the phone he brings.\"\u003c/p\u003e\n\u003cp\u003eShe darted to the body, found the unit, and said to Ely, \"Answer it.\"\u003c/p\u003e\n\u003cp\u003eCASSIOPEIA LISTENED AS ZOVASTINA SAID, \"THERE\u0027S SOMEONE here who wants to talk to you.\"\u003c/p\u003e\n\u003cp\u003eZovastina placed the phone close to her ear. She had no intention of saying anything, but the voice that came from the other side of the call sent an electric shock down her spine.\u003c/p\u003e\n\u003cp\u003e\"What is it, Minister?\" A pause. \"Minister?\"\u003c/p\u003e\n\u003cp\u003eShe could not help herself. The voice confirmed all her doubts.\u003c/p\u003e\n\u003cp\u003e\"Ely. It\u0027s Cassiopeia.\"\u003c/p\u003e\n\u003cp\u003eSilence greeted her.\u003c/p\u003e\n\u003cp\u003e\"Ely? Are you there?\" Her eyes burned.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here. Just shocked. It\u0027s good to hear your voice.\"\u003c/p\u003e\n\u003cp\u003e\"Yours, too.\" Emotion surged through her. Everything had changed.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" Ely asked.\u003c/p\u003e\n\u003cp\u003e\"Looking for you. I knew...I hoped you weren\u0027t dead.\" She tried to maintain a tight grip on her emotions. \"Are you okay?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, but I\u0027m worried about you. Henrik\u0027s here with a woman named Stephanie Nelle.\"\u003c/p\u003e\n\u003cp\u003eThat was news. Cassiopeia tried to shove her apprehension aside and focus. Apparently, Zovastina was unaware of what was happening wherever Ely was being held. \"Tell the minister what you just told me.\"\u003c/p\u003e\n\u003cp\u003eZovastina listened into the phone.\u003c/p\u003e\n\u003cp\u003eSTEPHANIE HEARD ELY REPEAT HIMSELF. SHE UNDERSTOOD THE shock Cassiopeia must be experiencing, but why did Cassiopeia want Ely to tell the Supreme Minister they were here?\u003c/p\u003e\n\u003cp\u003eZOVASTINA SAID INTO THE PHONE, \"WHEN DID YOUR FRIEND Thorvaldsen and this woman arrive?\"\u003c/p\u003e\n\u003cp\u003e\"A short while ago. Your guard tried to kill them, but he\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"Minister,\" a new voice said in her ear, one she instantly recognized.\u003c/p\u003e\n\u003cp\u003eThorvaldsen.\u003c/p\u003e\n\u003cp\u003e\"We have Ely.\"\u003c/p\u003e\n\u003cp\u003e\"And I have Cassiopeia Vitt. I\u0027d say she has another ten minutes or so to live.\"\u003c/p\u003e\n\u003cp\u003e\"We solved the riddle.\"\u003c/p\u003e\n\u003cp\u003e\"Lots of talk. From you and Vitt. Anything to back it up?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. We\u0027ll be at the grave before nightfall. But you\u0027ll never know.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in my Federation,\" she made clear.\u003c/p\u003e\n\u003cp\u003e\"Except that we were able to enter, take your prisoner, and leave with him without you ever knowing.\"\u003c/p\u003e\n\u003cp\u003e\"But you made a point to tell me.\"\u003c/p\u003e\n\u003cp\u003e\"The only thing you have that I want is Cassiopeia. Call back if you want to bargain.\"\u003c/p\u003e\n\u003cp\u003eAnd the call ended.\u003c/p\u003e\n\u003cp\u003e\"YOU THINK THAT WAS SMART?\" STEPHANIE ASKED THORVALDSEN.\u003c/p\u003e\n\u003cp\u003e\"We have to keep her off balance.\"\u003c/p\u003e\n\u003cp\u003e\"But we don\u0027t know what\u0027s happening there.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me what I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eShe could see Thorvaldsen was worried.\u003c/p\u003e\n\u003cp\u003e\"We have to trust that Cotton is handling things,\" he said.\u003c/p\u003e\n\u003cp\u003eZOVASTINA FOUGHT THE FEELING OF UNEASINESS THAT SWEPT through her. These people fought hard, she\u0027d give them that.\u003c/p\u003e\n\u003cp\u003eShe freed a knife from its leather sleeve. \"Your friends are here. And they have Ely. Unfortunately, contrary to what Thorvaldsen may think, he has nothing I want.\"\u003c/p\u003e\n\u003cp\u003eShe stepped close to the bundle of rope. \"I\u0027d much prefer to watch you die.\"\u003c/p\u003e\n\u003cp\u003eMALONE SAW AND HEARD EVERYTHING. ELY LUND WAS APPARENTLY on the phone. He saw how Cassiopeia had been affected, but he also realized that someone else had come onto the call. Henrik? Stephanie? They were surely with Lund by now.\u003c/p\u003e\n\u003cp\u003eHe could wait no longer. He rushed from his hiding place. \"That\u0027s enough.\"\u003c/p\u003e\n\u003cp\u003eZovastina stood with her back to him. He saw that she\u0027d stopped her assault on the ropes.\u003c/p\u003e\n\u003cp\u003e\"The knife,\" he said. \"Let it go.\"\u003c/p\u003e\n\u003cp\u003eCassiopeia watched him with a look of anticipation. He felt it, too. A bad feeling. Almost as if he\u0027d been expected.\u003c/p\u003e\n\u003cp\u003eTwo men stepped from the trees, weapons trained on him.\u003c/p\u003e\n\u003cp\u003e\"Mr. Malone,\" Zovastina said, as she turned toward him with a grim look of satisfaction on her face. \"You can\u0027t kill us all.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-25.html","bookId":2234,"creation":"Oct 5, 2019 11:15:26 PM","modification":"Oct 5, 2019 11:15:26 PM"}
