{"id":108015,"no":26,"title":"Page 26","content":"\u003cp\u003ePART FIVE\u003c/p\u003e\n\u003cp\u003eSEVENTY-FOUR\u003c/p\u003e\n\u003cp\u003eVINCENTI STEPPED INTO HIS LIBRARY, CLOSED THE DOOR, AND poured himself a drink. Kumis. A local specialty he\u0027d come to enjoy. Fermented mare\u0027s milk. Not much alcohol but quite a buzz. He downed the shot in one swallow and savored its almond aftertaste.\u003c/p\u003e\n\u003cp\u003eHe poured another.\u003c/p\u003e\n\u003cp\u003eHis stomach growled. He was hungry. He should tell the chef what he wanted for dinner. A thick slab of teriyaki horse steak would be good. He\u0027d come to like that local specialty, too.\u003c/p\u003e\n\u003cp\u003eHe sipped more Kumis.\u003c/p\u003e\n\u003cp\u003eEverything was about to unfold. His intuition from all those years ago had proven correct. All that stood in the way was Irina Zovastina.\u003c/p\u003e\n\u003cp\u003eHe stepped to his desk. The house was equipped with a sophisticated satellite communications system, with direct links to Samarkand and his corporate headquarters in Venice. Drink in hand, he saw an e-mail had arrived from Kamil Revin about a half hour ago. Unusual. Revin, for all his joviality, distrusted any form of communication save face-to-face, with him controlling the time and location.\u003c/p\u003e\n\u003cp\u003eHe opened the file and read the message.\u003c/p\u003e\n\u003cp\u003eTHE AMERICANS WERE HERE.\u003c/p\u003e\n\u003cp\u003eHis tired mind snapped alert. Americans? He was about to hit \"Reply\" when the study door burst open and Peter O\u0027Conner rushed in.\u003c/p\u003e\n\u003cp\u003e\"Four helicopter gunships bearing down on us. Federation.\"\u003c/p\u003e\n\u003cp\u003eHe darted to the windows and gazed west. At the far end of the valley four dots pricked the bright sky, growing larger.\u003c/p\u003e\n\u003cp\u003e\"They just appeared,\" O\u0027Conner said. \"I\u0027m assuming this is not a social call. You expecting anyone?\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eHe returned to the computer and deleted the e-mail.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll be on the ground in less than ten minutes,\" O\u0027Conner said.\u003c/p\u003e\n\u003cp\u003eSomething was wrong.\u003c/p\u003e\n\u003cp\u003e\"Is Zovastina coming for the woman?\" O\u0027Conner asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s possible. But how would she know this fast?\"\u003c/p\u003e\n\u003cp\u003eZovastina would never have imagined what he was planning. True, she distrusted him as he distrusted her, but there was no reason for any show of force. Not now, anyway. Then there was Venice, and what happened when he\u0027d moved on Stephanie Nelle. And the Americans?\u003c/p\u003e\n\u003cp\u003eWhat didn\u0027t he know?\u003c/p\u003e\n\u003cp\u003e\"They\u0027re swinging around to land,\" O\u0027Conner said from the windows.\u003c/p\u003e\n\u003cp\u003e\"Go get her.\"\u003c/p\u003e\n\u003cp\u003eO\u0027Conner dashed from the room.\u003c/p\u003e\n\u003cp\u003eVincenti slid open one of the desk drawers and removed a pistol. They\u0027d yet to hire the full security contingent the estate would ultimately require. That would all be done in the coming weeks, while Zovastina occupied herself preparing for war. He\u0027d planned to use that diversion to its fullest.\u003c/p\u003e\n\u003cp\u003eKaryn Walde entered the library, wearing a bathrobe and slippers. Standing, on her own. O\u0027Conner followed.\u003c/p\u003e\n\u003cp\u003e\"How do you feel?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Better than I have in months. I can walk.\"\u003c/p\u003e\n\u003cp\u003eAlready, a doctor was en route from Venice who would treat her secondary infections. Lucky for her, they were remediable. \"It\u0027ll take a few days for your body to start a full recovery. But the virus is right now being assaulted by a predator against which it has no defense. As, by the way, are we.\"\u003c/p\u003e\n\u003cp\u003eO\u0027Conner assumed a position at the window. \"They\u0027re on the ground. Troops. Asians. Looks like they\u0027re hers.\"\u003c/p\u003e\n\u003cp\u003eHe faced Walde. \"Seems Irina may want you back. We\u0027re not sure what\u0027s happening.\"\u003c/p\u003e\n\u003cp\u003eHe stepped across the room to a built-in bookcase with ornate glass-fronted doors. The wood had come from China, along with the craftsman who\u0027d made the piece. But O\u0027Conner had added something extra. He pressed a button on a pocket controller and a spring-loaded mechanism above and below the cabinet released, allowing the heavy case to rotate one hundred and eighty degrees. Beyond was a lighted passageway.\u003c/p\u003e\n\u003cp\u003eWalde was impressed. \"Like in a damn horror movie.\"\u003c/p\u003e\n\u003cp\u003e\"Which is what this may become,\" he said. \"Peter, see what they want and express my regrets that I wasn\u0027t here to greet them.\" He motioned to Walde. \"Follow me.\"\u003c/p\u003e\n\u003cp\u003eSTEPHANIE\u0027S HANDS STILL SHOOK AS SHE WATCHED ELY DRAG THE body around to the rear of the cabin. She still did not like the fact that Zovastina knew they were in the Federation. Not particularly smart to alert a person with the kind of resources at her disposal. She had to trust that Thorvaldsen knew what he was doing, particularly since his butt was on the line, too.\u003c/p\u003e\n\u003cp\u003eEly emerged from the cabin\u0027s front door, followed by Thorvaldsen. He held an arm full of books and paper. \"I\u0027ll need these.\"\u003c/p\u003e\n\u003cp\u003eShe was watching the lane leading back to the highway. All seemed quiet. Thorvaldsen came up beside her. He noticed her shaking hand and calmly grasped it. Neither of them said a word. She still held the gun, her palm sweaty. Her mind needed to focus, so she asked, \"What exactly are we going to do?\"\u003c/p\u003e\n\u003cp\u003e\"We know the location,\" Ely said. \"Klimax. So let\u0027s go see what\u0027s there. It\u0027s worth a look.\"\u003c/p\u003e\n\u003cp\u003eShe fought to recall Ptolemy\u0027s words and repeated them, \"Climb the god-built walls. When you reach the attic, gaze into the tawny eye, and dare to find the distant refuge.\"\u003c/p\u003e\n\u003cp\u003e\"I remember the riddle,\" Ely said. \"I need to check some information, spur my memory, but I can do that along the way.\"\u003c/p\u003e\n\u003cp\u003eShe wanted to know, \"Why did Zovastina go after the elephant medallions?\"\u003c/p\u003e\n\u003cp\u003e\"I pointed out a connection between a mark on the medallions and the riddle. A symbol, like two Bs joined to an A. It\u0027s on one side of the medallion and in the riddle. They had to be significant. Since there were only eight known, she said she\u0027d acquire them all for comparison. But she told me she was going to buy them.\"\u003c/p\u003e\n\u003cp\u003e\"Not hardly,\" Stephanie said. \"I\u0027m still baffled. All of this is over two thousand years old. Wouldn\u0027t anything that existed have been found by now?\"\u003c/p\u003e\n\u003cp\u003eEly shrugged. \"Hard to say. Let\u0027s face it, the clues have not been out in the open. It took X-ray fluorescence to find the important stuff.\"\u003c/p\u003e\n\u003cp\u003e\"But Zovastina wants it. Whatever it is.\"\u003c/p\u003e\n\u003cp\u003eEly nodded. \"In her mind, which I always thought was a little weird, she\u0027s Alexander, or Achilles, or some other epic hero. It\u0027s a romantic vision she seems to enjoy. A quest. She believes there might be some sort of cure out there. She talked about that a lot. That was most important to her, but I don\u0027t know why.\" Ely paused. \"I won\u0027t say that it wasn\u0027t important to me, too. Her enthusiasm became infectious. I actually started to believe there might be something to find.\"\u003c/p\u003e\n\u003cp\u003eShe could see he was troubled by all that had happened, so she offered, \"You might be right.\"\u003c/p\u003e\n\u003cp\u003e\"That would be amazing, wouldn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"But how could there be any connection between St. Mark and Alexander the Great?\" Thorvaldsen asked.\u003c/p\u003e\n\u003cp\u003e\"We know that Alexander\u0027s body was in Alexandria up to 391 CE, when paganism was finally outlawed. But there\u0027s no mention of it ever again, anywhere, after that. St. Mark\u0027s body reappears in Alexandria around 400 CE. Remember, pagan relics were routinely adopted for Christian purposes.\u003c/p\u003e\n\u003cp\u003e\"There are lots of examples I\u0027ve read about from Alexandria. A bronze idol of Saturn in the Caesareum was melted down to cast a cross for the patriarch of Alexandria. The Caesareum itself became a Christian cathedral. My theory, from reading everything I could on St. Mark and Alexander, was that some fourth-century patriarch conceived a way to not only preserve the corpse of the city\u0027s founder, but to furnish Christianity with a potent relic. A win/win. So Alexander simply became St. Mark. Who\u0027d know the difference?\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like a long shot,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. You tell me Ptolemy left something in that mummy in the basilica that led you straight here. I\u0027d say theory is now firmly entrenched in reality.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right,\" Thorvaldsen said. \"It\u0027s worth going south to take a look.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t necessarily agree, but any place was preferable to here. At least they\u0027d be on the move. But something occurred to her. \"You said the area where Klimax is located is now privately owned. We could have trouble gaining access.\"\u003c/p\u003e\n\u003cp\u003eEly smiled. \"Maybe the new owner will let us have a look around.\"\u003c/p\u003e\n\u003cp\u003eSEVENTY-FIVE\u003c/p\u003e\n\u003cp\u003eMALONE WAS TRAPPED. HE SHOULD HAVE KNOWN. VIKTOR HAD led him straight to Zovastina.\u003c/p\u003e\n\u003cp\u003e\"Come to save Ms. Vitt?\"\u003c/p\u003e\n\u003cp\u003eHe still held the gun.\u003c/p\u003e\n\u003cp\u003eZovastina motioned. \"Who do you plan to kill? Choose between the three of us.\" She pointed at her guardsmen. \"One of them will shoot you before you can shoot the other.\" She displayed her knife. \"And then I\u0027ll cut these ropes.\"\u003c/p\u003e\n\u003cp\u003eAll true. His options were limited.\u003c/p\u003e\n\u003cp\u003e\"Take him,\" she ordered the guards.\u003c/p\u003e\n\u003cp\u003eOne of the men rushed forward, but a new sound captured Malone\u0027s attention. Baying. Growing louder. The guard was ten feet away when goats rushed from the other path that led back to the buzkashi field. First a few, then the entire herd exploded into the clearing.\u003c/p\u003e\n\u003cp\u003eHooves thumped the earth.\u003c/p\u003e\n\u003cp\u003eMalone spotted Viktor atop a horse, keeping the oversized animals bunched, trying not to break their advance. A lumbering pace increased into a rush, the rear shoving the front, forcing the confused goats forward. Their unexpected appearance seemed to generate the desired effect. The guards were momentarily confused and Malone used that instant to shoot the one in front of him.\u003c/p\u003e\n\u003cp\u003eAnother pop and the second guard dropped to the ground.\u003c/p\u003e\n\u003cp\u003eMalone saw that Viktor had fired the shot.\u003c/p\u003e\n\u003cp\u003eThe goats crowded the clearing, milling into one another, still baffled, slowly realizing the only way out was through the trees.\u003c/p\u003e\n\u003cp\u003eDust stirred the air.\u003c/p\u003e\n\u003cp\u003eMalone spotted Zovastina and pushed his way through the stinking animals toward her and Cassiopeia.\u003c/p\u003e\n\u003cp\u003eThe herd retreated into the woods.\u003c/p\u003e\n\u003cp\u003eHe arrived just as Viktor slid from the saddle, gun in hand. Zovastina stood with her knife, but Viktor was holding her at bay, a few feet from the ropes that anchored the two bent trees.\u003c/p\u003e\n\u003cp\u003e\"Drop the knife,\" Viktor said.\u003c/p\u003e\n\u003cp\u003eZovastina seemed shocked. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Stopping you.\" Viktor motioned with his head. \"Free her, Malone.\"\u003c/p\u003e\n\u003cp\u003e\"Tell you what,\" Malone said. \"You free Cassiopeia and I\u0027ll keep an eye on the minister.\"\u003c/p\u003e\n\u003cp\u003e\"Still don\u0027t trust me?\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just say I prefer to do this my way.\" He raised his gun. \"Like he said, drop the knife.\"\u003c/p\u003e\n\u003cp\u003e\"Or what?\" Zovastina said. \"You\u0027ll shoot me?\"\u003c/p\u003e\n\u003cp\u003eHe fired into the ground, between her legs, and she recoiled. \"The next one\u0027s in your head.\"\u003c/p\u003e\n\u003cp\u003eShe released the knife.\u003c/p\u003e\n\u003cp\u003e\"Kick it this way.\"\u003c/p\u003e\n\u003cp\u003eShe did.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" Cassiopeia asked him.\u003c/p\u003e\n\u003cp\u003e\"I owed you. Goats?\" he said to Viktor, as the other man untied Cassiopeia.\u003c/p\u003e\n\u003cp\u003e\"You use what you have. Seemed like a good diversion.\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t argue.\u003c/p\u003e\n\u003cp\u003e\"You work for the Americans?\" Zovastina asked Viktor.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eFire boiled in her eyes.\u003c/p\u003e\n\u003cp\u003eCassiopeia shook the ropes free and lunged toward Zovastina, swinging her fist and catching the other woman square in the face. A kick to the knees and Zovastina stumbled back. Cassiopeia continued her attack, planting her foot into Zovastina\u0027s stomach and slamming the woman\u0027s head into the trunk of one of the trees.\u003c/p\u003e\n\u003cp\u003eZovastina shrunk to the ground and lay still.\u003c/p\u003e\n\u003cp\u003eMalone had calmly watched the assault. \"You get all that out of your system?\"\u003c/p\u003e\n\u003cp\u003eCassiopeia breathed hard. \"I could have given her more.\" She paused, rubbing her wrists from the ropes. \"Ely\u0027s alive. I talked to him on the phone. Stephanie and Henrik are with him. We need to go.\"\u003c/p\u003e\n\u003cp\u003eMalone faced Viktor. \"I thought Washington wanted your cover protected?\"\u003c/p\u003e\n\u003cp\u003e\"I had no choice.\"\u003c/p\u003e\n\u003cp\u003e\"You sent me into this trap.\"\u003c/p\u003e\n\u003cp\u003e\"Did I tell you to confront her? You didn\u0027t give me a chance to do anything. When I saw your problem, I did what I had to.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t agree, but there was no time to argue. \"What do we do now?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to leave. We\u0027ll have a little time. No one will disturb her back here.\"\u003c/p\u003e\n\u003cp\u003e\"What about the gunfire?\" Malone asked.\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t be noticed.\" Viktor motioned around him. \"This is her killing field. Many enemies have been eliminated back here.\"\u003c/p\u003e\n\u003cp\u003eCassiopeia was lifting Zovastina\u0027s limp body from the ground.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" Malone asked.\u003c/p\u003e\n\u003cp\u003e\"Tying this bitch to those ropes, so she can see what it feels like.\"\u003c/p\u003e\n\u003cp\u003eSTEPHANIE DROVE WITH HENRIK IN THE FRONT SEAT AND ELY IN the rear. They\u0027d had no choice but to commandeer the guard\u0027s car since theirs had four flat tires. They quickly left the cabin, found the highway, and began the trek south, paralleling the Pamir foothills, heading toward what over two thousand years ago had been known as Mt. Klimax.\u003c/p\u003e\n\u003cp\u003e\"This is amazing,\" Ely said.\u003c/p\u003e\n\u003cp\u003eShe saw in the rearview mirror that he was admiring the scytale.\u003c/p\u003e\n\u003cp\u003e\"When I read Ptolemy\u0027s riddle, I wondered how he would convey any message. It\u0027s really clever.\" Ely held up the scytale. \"How did you figure it out?\"\u003c/p\u003e\n\u003cp\u003e\"A friend of ours did. Cotton Malone. He\u0027s the one with Cassiopeia.\"\u003c/p\u003e\n\u003cp\u003e\"Shouldn\u0027t we go see about her?\"\u003c/p\u003e\n\u003cp\u003eShe heard the anticipation in his question. \"We have to trust that Malone will handle his end. Our problem\u0027s here.\" She was talking again like the dispassionate head of an intelligence agency, cool and indifferent, but she was still rattled from what happened at the cabin. \"Cotton\u0027s good. He\u0027ll deal with it.\"\u003c/p\u003e\n\u003cp\u003eThorvaldsen seemed to sense Ely\u0027s quandary. \"And Cassiopeia is not helpless. She can take care of herself. Why don\u0027t you tell us what we need to know to understand all this? We read in the manuscript about the draught, from the Scythians. What do you know about them?\"\u003c/p\u003e\n\u003cp\u003eShe watched as Ely carefully laid the scytale aside.\u003c/p\u003e\n\u003cp\u003e\"A nomadic people who migrated from central Asia to southern Russia in the eighth and seventh centuries before Christ. Herodotus wrote about them. They were bloody and tribal. Feared. They\u0027d cut off the heads of their enemies and make leather-bound drinking cups from the skulls.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d say that would build you a reputation,\" Thorvaldsen said.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s their connection to Alexander?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"In the fourth and third centuries BCE, they settled in what became Kazakhstan. They successfully resisted Alexander, blocking his way east across the Syr Darya river. He fought them fiercely, was wounded several times, but eventually made a truce. I wouldn\u0027t say Alexander feared the Scythians, but he respected them.\"\u003c/p\u003e\n\u003cp\u003e\"And the draught?\" Thorvaldsen said. \"It was theirs?\"\u003c/p\u003e\n\u003cp\u003eEly nodded. \"They showed it to Alexander. Part of their peace with him. And he apparently used it to cure himself. From what I read, it appeared as some kind of natural potion. Alexander, Hephaestion, and that physician\u0027s assistant mentioned in one of the manuscripts were all cured by it. Assuming the accounts are accurate.\u003c/p\u003e\n\u003cp\u003e\"The Scythians were a strange people,\" Ely said. \"For example, in the midst of one fight with the Persians, they all abandoned the battlefield to chase a rabbit. Nobody knows why, but it\u0027s noted in an official account.\u003c/p\u003e\n\u003cp\u003e\"They were gold connoisseurs, using and wearing enormous amounts. Ornaments, belts, plates, even their weapons were gold adorned. Scythian burial mounds are full of gold artifacts. But their main problem was language. They were illiterate. No written record of them survives. Just pictures, fables, and accounts from others. Only a few of their words are even known, and that\u0027s thanks to Herodotus.\"\u003c/p\u003e\n\u003cp\u003eShe could see his face in the rearview mirror and realized there was more. \"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Like I said, only a few of their words survived. Pata meant kill. Spou, eye. Oior, man. Then there\u0027s arima.\" He shuffled through some of the papers he\u0027d brought. \"It didn\u0027t mean much, until now. Remember the riddle. When you reach the attic. Ptolemy fought the Scythians with Alexander. He knew them. Arima means, roughly, place at the top.\"\u003c/p\u003e\n\u003cp\u003e\"Like an attic,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Even more important. The place the Greeks once called Klimax, where we\u0027re headed, the locals have always called Arima. I remember that from the last time I was there.\"\u003c/p\u003e\n\u003cp\u003e\"Too many coincidences?\" Thorvaldsen asked.\u003c/p\u003e\n\u003cp\u003e\"It seems all roads point here.\"\u003c/p\u003e\n\u003cp\u003e\"And what do we hope to find?\" Stephanie asked.\u003c/p\u003e\n\u003cp\u003e\"The Scythians used mounds to cover their kings\u0027 tombs, but I\u0027ve read that mountain locations were chosen for some of their most important leaders. This was the farthest reach of Alexander\u0027s empire. Its eastern border. A long way from home. He would not have been disturbed here.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe that\u0027s why he chose it?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. The whole thing seems odd.\"\u003c/p\u003e\n\u003cp\u003eAnd she agreed.\u003c/p\u003e\n\u003cp\u003eZOVASTINA OPENED HER EYES. SHE WAS LYING ON THE GROUND and immediately recalled Cassiopeia Vitt\u0027s attack. She shook confusion from her brain and realized something was tightly gripping both wrists.\u003c/p\u003e\n\u003cp\u003eThen she realized. She was tied to the trees, just as Vitt had been. She shook her head. Humiliating.\u003c/p\u003e\n\u003cp\u003eShe stood and stared out into the clearing.\u003c/p\u003e\n\u003cp\u003eThe goats, Malone, Vitt, and Viktor were gone. One of the guardsmen lay dead. But the other was still alive, propped against a tree, bleeding from a shoulder wound.\u003c/p\u003e\n\u003cp\u003e\"Can you move?\" she asked.\u003c/p\u003e\n\u003cp\u003eThe man nodded, but was clearly in pain. All of her Sacred Band were tough, disciplined souls. She\u0027d made sure of that. Her modern incarnation was every bit as fearless as the original from Alexander\u0027s time.\u003c/p\u003e\n\u003cp\u003eThe guard struggled to his feet, his right hand clamped onto his left arm.\u003c/p\u003e\n\u003cp\u003e\"The knife,\" she said. \"There, on the ground.\"\u003c/p\u003e\n\u003cp\u003eNot a hint of pain seeped from the man\u0027s mouth. She tried to remember his name, but could not. Viktor had hired each one of the Sacred Band, and she\u0027d made a point not to become attached to any of them. They were objects. Tools to be used. That\u0027s all.\u003c/p\u003e\n\u003cp\u003eThe man staggered to the knife and managed to lift it from the ground.\u003c/p\u003e\n\u003cp\u003eHe came close to the ropes, lost his balance, and fell to his knees.\u003c/p\u003e\n\u003cp\u003e\"You can do it,\" she said. \"Fight the agony. Focus on your duty.\"\u003c/p\u003e\n\u003cp\u003eThe guard seemed to steel himself. Sweat poured down his brow and she noticed fresh blood oozing from the wound. Amazing he wasn\u0027t in shock. But this burly soul seemed in superb physical shape.\u003c/p\u003e\n\u003cp\u003eHe raised the knife, sucked a few breaths, then cut the bindings that held her right wrist. She steadied his shaking arm as he passed her the knife, and she freed herself from the other rope.\u003c/p\u003e\n\u003cp\u003e\"You did well,\" she said.\u003c/p\u003e\n\u003cp\u003eHe smiled at her compliment, his breath labored, still on his knees.\u003c/p\u003e\n\u003cp\u003e\"Lie down. Rest,\" she said.\u003c/p\u003e\n\u003cp\u003eShe heard him settle on the ground as she searched the forest floor. Near the other body she found a gun.\u003c/p\u003e\n\u003cp\u003eShe returned to the injured guardsman.\u003c/p\u003e\n\u003cp\u003eHe\u0027d seen her vulnerable and, for the first time in a long while, she\u0027d felt vulnerable.\u003c/p\u003e\n\u003cp\u003eThe man lay on his back, still gripping his shoulder.\u003c/p\u003e\n\u003cp\u003eShe stood over him. His dark eyes focused on her and, in them, she saw that he knew.\u003c/p\u003e\n\u003cp\u003eShe smiled at his courage.\u003c/p\u003e\n\u003cp\u003eThen aimed the gun at his head and fired. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-26.html","bookId":2234,"creation":"Oct 5, 2019 11:15:26 PM","modification":"Oct 5, 2019 11:15:26 PM"}
