{"id":107993,"no":3,"title":"Page 3","content":"\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eCOPENHAGEN\u003c/p\u003e\n\u003cp\u003eVIKTOR TOMAS STOOD IN THE SHADOWS, ACROSS THE CANAL, AND watched the Greco-Roman museum burn. He turned to his partner but did not speak the obvious.\u003c/p\u003e\n\u003cp\u003eProblems.\u003c/p\u003e\n\u003cp\u003eIt was Rafael who had attacked the intruder, then dragged the unconscious body into the museum. Somehow, after their surreptitious entrance, the front door had become ajar and, from the second-floor railing, he\u0027d spotted a shadow approaching the stoop. Rafael, working on the ground floor, had instantly reacted, positioning himself just inside. True, he should have simply waited and seen what the visitor\u0027s intentions had been. But instead, he\u0027d yanked the shadow inside and popped the side of the man\u0027s head with one of the sculptures.\u003c/p\u003e\n\u003cp\u003e\"The woman,\" Rafael said. \"She was waiting, with a gun. That can\u0027t be good.\"\u003c/p\u003e\n\u003cp\u003eHe agreed. Long dark hair, shapely, dressed in a tight-fitting body-suit. As the building caught fire, she\u0027d emerged from an alley and stood near the canal. When the man appeared in the window, she\u0027d produced a gun and shot out the glass.\u003c/p\u003e\n\u003cp\u003eThe man, too, was a problem.\u003c/p\u003e\n\u003cp\u003eFair-haired, tall, sinewy. He\u0027d propelled a chair through the glass then leaped out with surprising agility, as if he\u0027d done that before. He\u0027d instantly grabbed the woman and they\u0027d both plunged into the canal.\u003c/p\u003e\n\u003cp\u003eThe fire department had arrived within minutes, just as the two emerged from the water and blankets were wrapped around them. The turtles had clearly performed their tasks. Rafael had christened them with the label since, in many ways, they resembled turtles, even possessing the ability to right themselves. Thankfully, no remnant of the devices would remain. Each was made of combustible materials that vaporized in the intense heat of their destruction. True, any investigator would quickly label the blaze arson, but proof of the method and mechanism would be impossible to determine.\u003c/p\u003e\n\u003cp\u003eExcept that the man had survived.\u003c/p\u003e\n\u003cp\u003e\"Will he be trouble?\" Rafael asked.\u003c/p\u003e\n\u003cp\u003eViktor continued to watch the firemen battle the blaze. The man and woman sat on the brick parapet, still wrapped in their blankets.\u003c/p\u003e\n\u003cp\u003eThey seemed to know each other.\u003c/p\u003e\n\u003cp\u003eThat worried him more.\u003c/p\u003e\n\u003cp\u003eSo he answered Rafael\u0027s inquiry the only way he could.\u003c/p\u003e\n\u003cp\u003e\"No doubt.\"\u003c/p\u003e\n\u003cp\u003eMALONE HAD RECOVERED HIS WITS. CASSIOPEIA HUDDLED IN A blanket beside him. Only remnants of the museum\u0027s walls remained and nothing of its inside. The old building had burned quickly. Firemen continued to mind the blaze, concentrating on confining the destruction. So far, none of the adjacent buildings had been affected.\u003c/p\u003e\n\u003cp\u003eThe night air reeked of soot, along with another smell-bitter, yet sweet-similar to what he\u0027d inhaled while trapped inside. Smoke continued to drift skyward, filtering the bright stars. A stout man in dingy yellow firefighting gear waddled over for the second time. One of the crew chiefs. A city policeman had already taken a statement from both he and Cassiopeia.\u003c/p\u003e\n\u003cp\u003e\"Like you said about the sprinklers,\" the chief said in Danish. \"Our water only seemed to spark it up.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you finally control it?\" Malone asked.\u003c/p\u003e\n\u003cp\u003e\"When the tanker ran out of juice, we dipped our hoses into the canal and pumped straight from it. That worked.\"\u003c/p\u003e\n\u003cp\u003e\"Salt water?\" All of Copenhagen \u0027s canals connected to the sea.\u003c/p\u003e\n\u003cp\u003eThe chief nodded. \"Stops it cold.\"\u003c/p\u003e\n\u003cp\u003eHe wanted to know, \"Find anything in the building?\"\u003c/p\u003e\n\u003cp\u003e\"No little machines, like you told the police. But that place was so hot it melted the marble statues.\" The chief ran a hand through his wet hair. \"That\u0027s a powerful fuel. We\u0027ll need your clothes. May be the only way to determine its composition.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe not,\" he said. \"I took a dip in that canal, too.\"\u003c/p\u003e\n\u003cp\u003e\"Good point.\" The chief shook his head. \"The arson investigators are going to love this one.\"\u003c/p\u003e\n\u003cp\u003eAs the fireman lumbered off, Malone faced Cassiopeia and plunged into an interrogation. \"You want to tell me what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t supposed to be here till tomorrow morning.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not an answer to my question.\"\u003c/p\u003e\n\u003cp\u003eWet tangles of thick dark hair hung past her shoulders and roughly framed her alluring face. She was a Spanish Muslim, living in southern France. Bright, rich, and cocky-an engineer and a historian. But her presence in Copenhagen, a day earlier than she\u0027d told him, meant something. Also, she\u0027d come armed and dressed for battle-dark leather pants and a tight-fitting leather jacket. He wondered if she was going to be difficult or cooperative.\u003c/p\u003e\n\u003cp\u003e\"Lucky I was here to save your hide,\" she said to him.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t decide if she was serious or teasing him. \"How did you know my hide needing saving?\"\u003c/p\u003e\n\u003cp\u003e\"Long story, Cotton.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got the time. I\u0027m retired.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not.\"\u003c/p\u003e\n\u003cp\u003eHe heard the bitter edge in her voice and sensed something. \"You knew that building was going to burn, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eShe did not look at him, just stared off across the canal. \"I actually wanted it to burn.\"\u003c/p\u003e\n\u003cp\u003e\"Care to explain that one?\"\u003c/p\u003e\n\u003cp\u003eShe sat silently, absorbed in thought. \"I was here. Earlier. I watched while two men broke into the museum. I saw them grab you. I needed to follow them, but couldn\u0027t.\" She paused. \"Because of you.\"\u003c/p\u003e\n\u003cp\u003e\"Who were they?\"\u003c/p\u003e\n\u003cp\u003e\"The men who left those machines.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d listened as he\u0027d given his statement to the police, but he\u0027d sensed the whole time that she already knew the story. \"How about we cut the crap and you tell me what\u0027s going on. I almost got killed over whatever it is you\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003e\"You should ignore open doors in the night.\"\u003c/p\u003e\n\u003cp\u003e\"Old habits are hard to break. What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"You saw the flames. Felt the heat. Unusual, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003eHe recalled how the fire had descended the stairs then stopped, as if waiting to be invited further. \"You could say that.\"\u003c/p\u003e\n\u003cp\u003e\"In the seventh century, when the Muslim fleets attacked Constantinople, they should have easily routed the city. Better weapons. A mass of forces. But the Byzantines had a surprise. They called it liquid fire, or wild fire, and they unleashed it on the ships, totally destroying the invading fleet.\" Cassiopeia still wasn\u0027t looking at him. \"The weapon survived in various forms to the time of the Crusades, and eventually acquired the name Greek fire. The original formula was so secret that it was held personally by each Byzantine emperor. They guarded it so well that, when the empire finally fell, the formula was lost.\" She breathed deeply as she continued to clutch the blanket. \"It\u0027s been found.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re telling me that I just saw Greek fire?\"\u003c/p\u003e\n\u003cp\u003e\"With a twist. This kind hates salt water.\"\u003c/p\u003e\n\u003cp\u003e\"So why didn\u0027t you tell the firemen that when they arrived?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to answer any more questions than I have to.\"\u003c/p\u003e\n\u003cp\u003eBut he wanted to know. \"Why let this museum burn? There\u0027s nothing of any consequence there?\"\u003c/p\u003e\n\u003cp\u003eHe stared back toward the burned hulk and spotted the charred remains of his bicycle. He sensed something more from Cassiopeia, as she continued to avoid his gaze. Never in all the time he\u0027d known her had he seen any sign of misgiving, nervousness, or dejection. She was tough, eager, disciplined, and smart. But at the moment she seemed troubled.\u003c/p\u003e\n\u003cp\u003eA car appeared at the far end of the cordoned-off street. He recognized the expensive British sedan and the hunched figure that emerged from its rear seat.\u003c/p\u003e\n\u003cp\u003eHenrik Thorvaldsen.\u003c/p\u003e\n\u003cp\u003eCassiopeia stood. \"He\u0027s here to talk with us.\"\u003c/p\u003e\n\u003cp\u003e\"And how did he know we were here?\"\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s happening, Cotton.\"\u003c/p\u003e\n\u003cp\u003eSIX\u003c/p\u003e\n\u003cp\u003eVENICE\u003c/p\u003e\n\u003cp\u003e2:30 A.M.\u003c/p\u003e\n\u003cp\u003eVINCENTI WAS GLAD THE POTENTIAL DISASTER WITH THE FLORENTINE had been averted. He\u0027d made a mistake. Time was short and he was playing a dangerous game, but it seemed fate had dealt him another chance.\u003c/p\u003e\n\u003cp\u003e\"Is the situation in central Asia under control?\" one of the Council of Ten asked him. \"Did we halt whatever that fool had tried to do?\"\u003c/p\u003e\n\u003cp\u003eAll of the men and women had lingered in the meeting hall after the Florentine, struggling within his coffin, was wheeled away. A bullet to the head should have, by now, ended further resistance.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re okay,\" he said. \"I personally handled the matter, but Supreme Minister Zovastina is quite the showgirl. I assume she\u0027ll make a spectacle of things.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not to be trusted,\" another said.\u003c/p\u003e\n\u003cp\u003eHe wondered about the declaration\u0027s vehemence considering Zovastina was their ally, but he nonetheless agreed. \"Despots are always a problem.\" He stood and approached a map that hung from one wall. \"Damn if she hasn\u0027t accomplished a lot, though.\"\u003c/p\u003e\n\u003cp\u003e\"She managed to merge six corrupt Asian states into a federation that might actually succeed.\" He pointed. \"She\u0027s essentially redrawn the world map.\"\u003c/p\u003e\n\u003cp\u003e\"And how did she do it?\" came a question. \"Certainly not by diplomacy.\"\u003c/p\u003e\n\u003cp\u003eVincenti knew the official account. After the Soviet Union fell, central Asia suffered civil wars and strife, as each of the emerging \"nation-stans\" struggled with independence. The so-called Commonwealth of Independent States, which succeeded the USSR, existed in name only. Corruption and incompetence ran rampant. Irina Zovastina had headed local reforms under Gorbachev, championing perestroika and glasnost, spearheading the prosecution of many corrupt bureaucrats. Eventually, though, she led the charge to expel the Russians, reminding the people of Russia \u0027s colonial conquest and sounding an environmental alarm, noting that Asians were dying by the thousands from Russian pollution. Ultimately, she stood before Kazakhstan \u0027s Assembly of Representatives and helped proclaim the republic.\u003c/p\u003e\n\u003cp\u003eA year later, she was elected president.\u003c/p\u003e\n\u003cp\u003eThe West welcomed her. She seemed a reformer in a region that rarely reformed. Then, fifteen years ago, she stunned the world with the announcement of the Central Asian Federation.\u003c/p\u003e\n\u003cp\u003eSix nations, now one.\u003c/p\u003e\n\u003cp\u003eYet Vincenti\u0027s colleague was right. Not a miracle. More a manipulation. So he answered the inquiry with the obvious. \"She achieved it with power.\"\u003c/p\u003e\n\u003cp\u003e\"And the fortunate demise of political opponents.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s always been a way to power,\" he said. \"We can\u0027t fault her for that. We do the same.\" He stared at another of the Council members. \"Are the funds in place?\"\u003c/p\u003e\n\u003cp\u003eThe treasurer nodded. \"Three point six billion, scattered at a variety of banks around the globe, access clean, straight to Samarkand.\"\u003c/p\u003e\n\u003cp\u003e\"I assume our members are ready?\"\u003c/p\u003e\n\u003cp\u003e\"A renewed influx of investment will start immediately. Most of the members are planning major expansions. They\u0027ve been careful, per our directive, to this point.\"\u003c/p\u003e\n\u003cp\u003eTime was short. Just as with the original Council of Ten, half of the current Council would soon rotate off. League bylaws mandated that five members changed every two years. Vincenti\u0027s term would expire in less than thirty days.\u003c/p\u003e\n\u003cp\u003eA blessing and a problem.\u003c/p\u003e\n\u003cp\u003eSix hundred years ago Venice had been an oligarchical republic, governed by merchants through a complicated political system designed to prevent despotism. Faction and intrigue were thought foiled by processes that relied heavily on chance. No one person ever held sole authority. Always groups advising, deciding, and acting. Groups that changed at regular intervals.\u003c/p\u003e\n\u003cp\u003eBut corruption still crept in. Plots and pet projects flourished. Webs of conspiracy were woven.\u003c/p\u003e\n\u003cp\u003eMen always found a way.\u003c/p\u003e\n\u003cp\u003eAnd so had he.\u003c/p\u003e\n\u003cp\u003eThirty days.\u003c/p\u003e\n\u003cp\u003eMore than enough time.\u003c/p\u003e\n\u003cp\u003e\"What of Supreme Minister Zovastina?\" one of the Council asked, breaking his thoughts. \"Will she be all right?\"\u003c/p\u003e\n\u003cp\u003e\"Now that,\" he said, \"may well become the talk of this day.\"\u003c/p\u003e\n\u003cp\u003eSEVEN\u003c/p\u003e\n\u003cp\u003eSAMARKAND\u003c/p\u003e\n\u003cp\u003eCENTRAL ASIAN FEDERATION\u003c/p\u003e\n\u003cp\u003e6:20 A.M.\u003c/p\u003e\n\u003cp\u003eZOVASTINA SPURRED HER HORSE. THE OTHER CHOPENOZ WHIPPED their mounts, too. Mud splattered up at her from wet turf obliterated by hooves. She bit down on the whip and gripped the reins with both hands. No one had, as yet, made a move on the goat carcass lying in its earthen pan.\u003c/p\u003e\n\u003cp\u003e\"Come now, Bucephalas,\" she said through clenched teeth into the horse\u0027s ear. \"Time to show them.\" She yanked and the animal bolted right.\u003c/p\u003e\n\u003cp\u003eThe game was simple. Grab the boz, ride with it in hand to the far end of the field, round the pole, then return and deposit the dead goat in the circle of justice, outlined in lime on the grass. Sounded easy, but the problem came from the chopenoz who were allowed to do most anything to steal the boz.\u003c/p\u003e\n\u003cp\u003eAn invitation to play buzkashi with her was considered an honor, and she chose the participants with great care. Today\u0027s were a mixture of her personal guard and nine invited guests, making for two teams of twelve.\u003c/p\u003e\n\u003cp\u003eShe was the only woman.\u003c/p\u003e\n\u003cp\u003eAnd she liked that.\u003c/p\u003e\n\u003cp\u003eBucephalas seemed to sense what was expected of him and closed on the boz. Another player slammed into the horse\u0027s right flank. Zovastina retrieved the whip from her mouth and slashed a blow at the other rider, popping the man\u0027s face with leather tendrils. He brushed aside her attack and continued his assault, now joined by three other horsemen trying to stop her.\u003c/p\u003e\n\u003cp\u003eTwo of her team closed ranks and battled the three opponents.\u003c/p\u003e\n\u003cp\u003eA storm of horses and riders orbited the boz.\u003c/p\u003e\n\u003cp\u003eShe\u0027d told her team earlier that she wanted to make the first run around the pole and they seemed to be doing their part to accommodate her.\u003c/p\u003e\n\u003cp\u003eA fourth player from the opposing team drove his horse close.\u003c/p\u003e\n\u003cp\u003eThe world spun around her as all twenty-four chopenoz circled. One of her opponents\u0027 whips found her chest, but the thick leather jacket deflected the blow. Usually, striking the Supreme Minister was a capital offense, but that rule was waived during buzkashi. She wanted players to hold nothing back.\u003c/p\u003e\n\u003cp\u003eA horsemen slipped from his mount and slammed to the ground.\u003c/p\u003e\n\u003cp\u003eNo one stopped to help. Not allowed.\u003c/p\u003e\n\u003cp\u003eBroken limbs, cuts, and slashes were common. Five men had actually died on this field during the past two years. Death had always been common during buzkashi. Even the Federation\u0027s criminal code contained an exception to murder that applied only during the game.\u003c/p\u003e\n\u003cp\u003eShe rounded the shallow pit.\u003c/p\u003e\n\u003cp\u003eAnother rider reached for the boz, but she pounded his hand with her whip. She then pulled hard on the reins and slowed Bucephalas, whirling them both around and, once again, charging the carcass before the others caught back up with her.\u003c/p\u003e\n\u003cp\u003eTwo more riders plunged to the ground.\u003c/p\u003e\n\u003cp\u003eEach of her breaths came laced with grass and mud and she spat out the sediment, but she welcomed the scent of sweating horseflesh.\u003c/p\u003e\n\u003cp\u003eShe stuffed the whip back in her mouth and leaned down, one hand keeping a stranglehold on the saddle, the other yanking up the carcass. Blood squirted from where the goat\u0027s hooves and head had been severed. She dragged the dead goat up and held tight, then signaled for Bucephalas to sweep left.\u003c/p\u003e\n\u003cp\u003eOnly three rules now governed.\u003c/p\u003e\n\u003cp\u003eNo tying of the carcass. No striking the hand of the holder. No tripping the horses.\u003c/p\u003e\n\u003cp\u003eTime for a run at the pole.\u003c/p\u003e\n\u003cp\u003eShe spurred Bucephalas.\u003c/p\u003e\n\u003cp\u003eThe other team closed.\u003c/p\u003e\n\u003cp\u003eHer teammates galloped to her defense.\u003c/p\u003e\n\u003cp\u003eThe carcass was heavy, maybe thirty kilos, but her strong arms were more than capable of holding on. Blood continued to soak her hand and sleeve.\u003c/p\u003e\n\u003cp\u003eA blow to her spine caught her attention.\u003c/p\u003e\n\u003cp\u003eShe whirled.\u003c/p\u003e\n\u003cp\u003eTwo opposing horsemen.\u003c/p\u003e\n\u003cp\u003eMore swarmed inward.\u003c/p\u003e\n\u003cp\u003eHooves pounded the damp earth like thunder, pierced by the frenzied screams of horses. Her chopenoz came to her defense. Blows were exchanged. She held the boz in a death grip, her forearms aching.\u003c/p\u003e\n\u003cp\u003eThe pole stood fifty meters away.\u003c/p\u003e\n\u003cp\u003eThe field spread out behind the summer palace on a grassy plain that eventually ended at thick forest. The Soviets had utilized the complex as a retreat for the party elite, which explained how it had survived. She\u0027d changed the layout, but a few aspects of the Russian occupation had been wisely retained.\u003c/p\u003e\n\u003cp\u003eMore riders joined the fray as both teams fought with each other.\u003c/p\u003e\n\u003cp\u003eWhips snapped.\u003c/p\u003e\n\u003cp\u003eMen groaned in pain.\u003c/p\u003e\n\u003cp\u003eObscenities were exchanged.\u003c/p\u003e\n\u003cp\u003eShe surged into the lead, but only slightly. She\u0027d have to slow to round the pole and begin her return to the circle of justice, which would give them all an opportunity to pounce. Though her team had been accommodating to this point, the rules now allowed anyone to steal the boz and make a run of their own.\u003c/p\u003e\n\u003cp\u003eShe decided to catch them all off guard.\u003c/p\u003e\n\u003cp\u003eKicking, she directed Bucephalas to angle right.\u003c/p\u003e\n\u003cp\u003eNo out of bounds governed. Riders could, and did, venture anywhere. She arced their galloping path outward, the bulk of the chopenoz massed to her left, stretching her advance to the field\u0027s fringes where rows of tall trees guarded the perimeter. She could weave between them-she\u0027d done so before-but today she preferred a different route.\u003c/p\u003e\n\u003cp\u003eBefore any of the others could react to her sudden shift, she hooked left and crisscrossed the field, cutting off the main body of galloping riders, causing them all to slow.\u003c/p\u003e\n\u003cp\u003eTheir instant of hesitation allowed her to sweep ahead and loop the pole.\u003c/p\u003e\n\u003cp\u003eThe others followed.\u003c/p\u003e\n\u003cp\u003eShe turned her attention ahead.\u003c/p\u003e\n\u003cp\u003eOne rider waited fifty meters down the field. He was swarthy, bearded, with a stiff face. He sat tall in the saddle and she saw his hand emerge from beneath a leather cape, holding a gun. He kept the weapon close, waiting for her.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s show him, Bucephalas, that we\u0027re not afraid.\"\u003c/p\u003e\n\u003cp\u003eThe horse raced forward.\u003c/p\u003e\n\u003cp\u003eThe man with the gun did not move. Zovastina stared him down. No one would ever cause her to retreat.\u003c/p\u003e\n\u003cp\u003eThe gun came level.\u003c/p\u003e\n\u003cp\u003eA shot echoed across the field.\u003c/p\u003e\n\u003cp\u003eThe man with the gun teetered, then collapsed to the wet ground. His horse, spooked by the retort, raced away riderless.\u003c/p\u003e\n\u003cp\u003eShe trampled the corpse, Bucephalas\u0027 hooves digging into the still-warm flesh, the body swept away in their wake.\u003c/p\u003e\n\u003cp\u003eShe kept riding until the circle of justice came into view. She rode past and tossed the boz into its center, then brought Bucephalas to a stop.\u003c/p\u003e\n\u003cp\u003eThe other riders had all halted where the dead man lay.\u003c/p\u003e\n\u003cp\u003eShooting a player was absolutely against the rules. But this was not part of any game. Or maybe it was? Just a different contest. With different players and different rules. One none of the men here today would either understand or appreciate.\u003c/p\u003e\n\u003cp\u003eShe yanked on the reins and straightened herself in the saddle, casting a glance toward the palace roof. Inside one of the old Soviet gun stations, her sharpshooter signaled success by waving his rifle.\u003c/p\u003e\n\u003cp\u003eShe returned the gesture by rearing Bucephalas onto his hind legs and the horse whinnied his approval of the kill.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/the-venetian-betrayal-cotton-malone-3/page-3.html","bookId":2234,"creation":"Oct 5, 2019 11:15:26 PM","modification":"Oct 5, 2019 11:15:26 PM"}
