{"id":88956,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Of course,” Bennet said.\u003c/p\u003e\n\u003cp\u003e“Was it you?”\u003c/p\u003e\n\u003cp\u003e“No. In fact, when I started running downstairs, I could already hear a siren.”\u003c/p\u003e\n\u003cp\u003e“That’s amazing,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eYes, it was, Joe thought.\u003c/p\u003e\n\u003cp\u003e“But Mr. Bigelow was already gone?” Joe prompted.\u003c/p\u003e\n\u003cp\u003e“Stone cold, poor Thorny was stone cold,” Bennet said.\u003c/p\u003e\n\u003cp\u003e“Stone cold?” Joe repeated curiously.\u003c/p\u003e\n\u003cp\u003e“Well, cold to the touch,” Bennet said. “There was so much confusion, though. Jared was trying to resuscitate his father, and Mary, his aunt, just kept saying he had to stop, that Mr. Bigelow was dead.”\u003c/p\u003e\n\u003cp\u003e“And when she said that…you touched him?” Joe said.\u003c/p\u003e\n\u003cp\u003eBennet frowned. “I’m thinking…trying to remember exactly what I did. There seemed to be so much confusion. Um, no, no, I didn’t touch him.”\u003c/p\u003e\n\u003cp\u003e“Then how did you know that he was cold?” Joe asked.\u003c/p\u003e\n\u003cp\u003eBennet frowned. Not like a man who had lied, but like a man who was genuinely confused. “I…I guess I did touch him,” Bennet said. “I must have.”\u003c/p\u003e\n\u003cp\u003e“Then?”\u003c/p\u003e\n\u003cp\u003eBennet looked distressed.\u003c/p\u003e\n\u003cp\u003e“Joe…” Genevieve murmured, distressed.\u003c/p\u003e\n\u003cp\u003eHe gave her a fierce frown.\u003c/p\u003e\n\u003cp\u003e“It might have been right when the paramedics came in,” Bennet said. “Yes, that was it. The first young man asked if anyone had tried to revive him, and I said that his son had tried, and I touched Thorny then, and he was cold.”\u003c/p\u003e\n\u003cp\u003eJoe finished his tea. “What about Mary? Mrs. Vincenzo?” he asked.\u003c/p\u003e\n\u003cp\u003e“What about her? She and Thorny always seemed to get along fine,” Bennet assured him.\u003c/p\u003e\n\u003cp\u003e“No, did she touch him?”\u003c/p\u003e\n\u003cp\u003eAgain, Bennet appeared perplexed. “I…no. No, I don’t think so. She just kept crying, touching Jared, telling him to let his father be, he was dead. They were both so upset.”\u003c/p\u003e\n\u003cp\u003e“How did they react to you coming down?” Joe asked, filing away the question of what had made Mary so certain that Thorne was dead.\u003c/p\u003e\n\u003cp\u003e“I’m not even sure they noticed me at first. Then Jared looked at me, and he shouted, ‘Bennet, what the hell did you do to my father?’ And of course I told him I’d done nothing, nothing at all. And I asked him what had happened, and he said they’d found his father keeled over on the desk.”\u003c/p\u003e\n\u003cp\u003e“Keeled over on the desk?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So Jared moved him so he could do CPR?” And didn’t notice that the man was “stone cold”? This case was getting more and more interesting by the moment.\u003c/p\u003e\n\u003cp\u003e“I suppose so. The man was beside himself. If he could have saved his father, he would have, believe me.”\u003c/p\u003e\n\u003cp\u003e“It’s kind of you to defend him,” Genevieve said. “Considering he was so quick to accuse you of killing him.”\u003c/p\u003e\n\u003cp\u003e“Jared was simply distraught, as I told you,” Bennet explained.\u003c/p\u003e\n\u003cp\u003e“Did he keep accusing you when the police came?” Genevieve asked, looking at him sympathetically.\u003c/p\u003e\n\u003cp\u003e“No, no, I don’t think so,” Bennet said.\u003c/p\u003e\n\u003cp\u003eJoe seemed to feel he’d gotten all the information he could at that point, because he thanked Bennet for the tea and for being so forthcoming, and in a few minutes he and Gen were on their way.\u003c/p\u003e\n\u003cp\u003e“I’m not sure where you’re going with your questions,” Genevieve told Joe when they were back out on the street. “All of this must be on the record already.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“You asked me to investigate,” he said.\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“He’s a nice old guy, and you were practically attacking him, as if you were the police.”\u003c/p\u003e\n\u003cp\u003e“I would be willing to bet the police were much harder on him than I was.”\u003c/p\u003e\n\u003cp\u003e“And they didn’t arrest him, did they?”\u003c/p\u003e\n\u003cp\u003e“They don’t have the evidence to arrest him. Or anyone, if it comes to that.”\u003c/p\u003e\n\u003cp\u003e“We’re just going in circles,” Genevieve protested.\u003c/p\u003e\n\u003cp\u003eHe arched a brow to her. “Want to fire me?”\u003c/p\u003e\n\u003cp\u003e“Of course not! I just…I just feel we should be doing more.”\u003c/p\u003e\n\u003cp\u003e“And I feel,” he told her, “as if you should be staying with your mother.”\u003c/p\u003e\n\u003cp\u003eShe let out a long breath of aggravation. “I will not let this situation put me back a hundred years, do you understand?”\u003c/p\u003e\n\u003cp\u003e“You said that you were worried about her,” he reminded her.\u003c/p\u003e\n\u003cp\u003e“Yes, and when she’s at home, she couldn’t be safer,” Genevieve told him. “Bertha never leaves the mansion, and Henry is there, too. And the security system is state of the art.”\u003c/p\u003e\n\u003cp\u003e“Just like the one at Bigelow’s mansion,” he reminded her.\u003c/p\u003e\n\u003cp\u003eHe was immediately sorry he’d spoken, as her face drained of color. “That’s what’s so horrifying. Bigelow must have known, maybe even trusted, his killer. How do you ever figure out who’s lying?”\u003c/p\u003e\n\u003cp\u003e“You catch them in a lie,” he said, and glanced at his watch. Sunday afternoon was waning. “I think I should take you home.”\u003c/p\u003e\n\u003cp\u003e“No way,” she told him. “I took you to talk to the butler. Now you can take me to talk to the psychic.”\u003c/p\u003e\n\u003cp\u003eHe knew her. Knew the dead-stubborn set to her jaw. They wouldn’t be going anywhere or doing anything until he took her to see Candy Cane slash Lori Star.\u003c/p\u003e\n\u003cp\u003e“Joe, please.” She set a hand on his arm. It was such a little thing, but it sent a jolt of electricity through him as strongly as if he’d been strapped into the chair at Sing-Sing.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, let’s go,” he almost snapped. His voice sounded too deep, too husky, even to his own ears. He wondered if she really didn’t know how she affected people, men—him—and if she was truly as blind to her own assets as she seemed to be.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, they were knocking at Candy Cane’s door.\u003c/p\u003e\n\u003cp\u003eShe didn’t answer.\u003c/p\u003e\n\u003cp\u003eJoe was persistent, and he tried rapping harder. Down the hallway, a young woman poked her head out.\u003c/p\u003e\n\u003cp\u003e“Knock it off, buddy,” she said, then looked at the two of them and softened. “Sorry…I was just watching television. I didn’t mean to bite your heads off.”\u003c/p\u003e\n\u003cp\u003e“That’s okay, we’re sorry,” Genevieve told her.\u003c/p\u003e\n\u003cp\u003e“Do you know where Can—where Lori is?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“No, I’m afraid not.”\u003c/p\u003e\n\u003cp\u003eGenevieve took a step forward. “Did you see her today? Did she say anything to you? I’m sorry to bother you, but it’s really important that we speak with her.”\u003c/p\u003e\n\u003cp\u003eThe woman—who was probably only in her late twenties but already acquiring the pinched look of someone years older—took a long look at Genevieve. Then she smiled.\u003c/p\u003e\n\u003cp\u003e“Let me try to remember. I was just coming up from the laundry room when she was going out. She was all excited when she left,” the woman said. “Um…she did tell me that it was a great day, and that she was going to go see a man about a horse. Then she laughed and said it was a race horse and she was going to be in the money.”\u003c/p\u003e\n\u003cp\u003e“Really?” Genevieve said, frowning and looking at Joe.\u003c/p\u003e\n\u003cp\u003eJoe looked at Lori’s neighbor, and something about the way he looked at her clearly made her defensive.\u003c/p\u003e\n\u003cp\u003e“She wasn’t hooking,” the woman snapped.\u003c/p\u003e\n\u003cp\u003e“I didn’t suggest she was,” he assured her.\u003c/p\u003e\n\u003cp\u003e“You two cops?” the woman demanded.\u003c/p\u003e\n\u003cp\u003e“No, no,” Genevieve said quickly, and stepped forward, offering her hand. “I’m Genevieve O’Brian, and this is Joe Connolly. We just wanted to talk to Lori, that’s all.”\u003c/p\u003e\n\u003cp\u003eThe woman’s shoulders sagged, as if she didn’t have the energy to be angry anymore. “She’s really a sweet girl. She deserves a break.”\u003c/p\u003e\n\u003cp\u003e“I’m sure she does,” Joe said, and he was surprised to realize he wasn’t being sarcastic. He had been stunned himself to feel that something about Lori Star’s words had felt real and that she really had seemed like a nice kid.\u003c/p\u003e\n\u003cp\u003eThe woman smiled. “I’m Susie Norman, by the way, and I’m sorry I can’t help you.” She brightened. “Next time I see Lori, I’ll tell her you were here, though.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Joe said. He slipped a business card under Lori’s door, then walked over and handed one to Susie. “Here’s my number, in case you think of anything to help us find her. And thanks again.”\u003c/p\u003e\n\u003cp\u003eWhen they reached the street, Genevieve looked at Joe expectantly. “What now?”\u003c/p\u003e\n\u003cp\u003e“Now I have to check on some alibis.”\u003c/p\u003e\n\u003cp\u003e“Okay. Where do we start?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, looking at her with exasperation. “Genevieve, you hired me to do this job. That means I do the work, and you head on home and enjoy what’s left of your Sunday.”\u003c/p\u003e\n\u003cp\u003e“Joe, I’ve spent enough time closed up in my house. Where do we go from here?”\u003c/p\u003e\n\u003cp\u003e“I need to do some work on the computer and make some phone calls,” he told her.\u003c/p\u003e\n\u003cp\u003e“I have a computer.”\u003c/p\u003e\n\u003cp\u003e“And all my contact numbers and stuff are at my house.”\u003c/p\u003e\n\u003cp\u003e“I’m willing to bet your contact numbers are in your phone,” Genevieve told him.\u003c/p\u003e\n\u003cp\u003eNo way out of it. He let out a sigh of vast exasperation. “Then you’re coming to Brooklyn,” he told her.\u003c/p\u003e\n\u003cp\u003eShe smiled. “Fine.”\u003c/p\u003e\n\u003cp\u003eSunday in New York. It seemed as if every dog owner in the city was out. A poodle took issue with a Doberman. The owners sounded as if they were barking right along with their dogs as they accused each other of causing the problem. A Maltese went trotting by with its owner, a shaggy-haired young girl. Both were oblivious to the shouting match as they walked by.\u003c/p\u003e\n\u003cp\u003eJoe hailed a cab for Genevieve’s apartment, where they retrieved his car. The Sunday traffic wasn’t bad, and she seemed to enjoy the ride, looking out the window, watching as they traveled over the Brooklyn Bridge.\u003c/p\u003e\n\u003cp\u003eJoe realized that although they had been friends for over a year, he’d kept his distance. She had never been to his place before. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-17.html","bookId":2272,"creation":"Oct 5, 2019 5:32:03 PM","modification":"Oct 5, 2019 5:32:03 PM"}
