{"id":88957,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe lived in an old brownstone. It was three stories, plus a basement, and he had the basement and the first floor. He even had a reserved parking space, which was something of a coup in his neighborhood, which was residential, but just a block off a commercial boulevard, where he could go for coffee, or great Chinese, Italian or diner-style American food whenever he chose.\u003c/p\u003e\n\u003cp\u003eBut entering his place with Genevieve brought with it a stab of pain.\u003c/p\u003e\n\u003cp\u003eLeslie was the last woman he’d brought here.\u003c/p\u003e\n\u003cp\u003eAnd she had told him about the ghost in his basement, a Civil War era musician who had wanted the work he’d left behind to be found and performed.\u003c/p\u003e\n\u003cp\u003eGhosts.\u003c/p\u003e\n\u003cp\u003eHe’d spent his life being logical. He hadn’t believed in ghosts. But then he’d met Leslie and through her, a man named Adam Harrison and some of his employees, a group of people who found it as natural to talk to ghosts as it was to converse with strangers at a party.\u003c/p\u003e\n\u003cp\u003eBut despite everything he had come to know about Leslie and, through her, Adam Harrison and his group of paranormal investigators, he had fought against believing in any of it.\u003c/p\u003e\n\u003cp\u003eBut then he had spoken to a dead man on the highway, and after that, a corpse had looked up at him at the morgue and spoken….\u003c/p\u003e\n\u003cp\u003eRidiculous. It was all ridiculous.\u003c/p\u003e\n\u003cp\u003eHe’d been working too hard. Or not getting enough sleep. Hell, maybe he actually needed to start drinking more.\u003c/p\u003e\n\u003cp\u003e“Make yourself at home,” he told Genevieve.\u003c/p\u003e\n\u003cp\u003eHe couldn’t help watching her as she looked around his apartment.\u003c/p\u003e\n\u003cp\u003eAnd he couldn’t help wondering if he didn’t have a little bit of a chip on his shoulder where she was concerned. He’d always worked hard and made a decent income, and he was good at investing the extra, so finances weren’t a worry. But Genevieve O’Brien was the kind of rich that went beyond most people’s dreams, including his.\u003c/p\u003e\n\u003cp\u003eStill, she had chosen a life of service to others, even before her kidnapping. She had worked the meanest streets in town. She had tried to save prostitutes and their children. She had fought against heroin and crack addiction, and dealt with those who were down and out and even those suffering from AIDS. She had never given any indication that she was a spoiled rich kid just because her family had obscene amounts of money.\u003c/p\u003e\n\u003cp\u003eShe smiled, her eyes meeting his. “Joe, this place is great. That’s one of the most fantastic fireplaces ever.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” he said. “Kitchen is there, so help yourself if you want something to drink. I’ve usually got beer, wine, soda. And food, if you’re hungry. There’s a TV over there, and a pool table downstairs, if you get bored. I’ll be in my office, right down the hall.”\u003c/p\u003e\n\u003cp\u003e“Thanks. And don’t worry about me. I’m fine. Mind if I go through your CD collection?”\u003c/p\u003e\n\u003cp\u003e“Knock yourself out.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eHe nodded, still feeling oddly awkward, and walked down the hall to his office. It was lined with oak bookshelves and three-drawer filing cabinets. His desk was an antique that might have belonged to Uriah Heap, if he’d been real and not a character in a book.\u003c/p\u003e\n\u003cp\u003eHe put through a call to Raif Green at his home.\u003c/p\u003e\n\u003cp\u003e“Hey, Joe, got anything?” Raif asked as soon as Joe identified himself.\u003c/p\u003e\n\u003cp\u003e“No, sorry. I was hoping you might have something to tell me.”\u003c/p\u003e\n\u003cp\u003e“To tell you the truth…we basically have nothing,” Raif admitted. “Except what we’ve known from the beginning. Thorne Bigelow knew his killer. He let the person in, and he was willing to sit there and drink wine with him or her. So we’re looking at friends and acquaintances.”\u003c/p\u003e\n\u003cp\u003e“What’s your take on the butler?”\u003c/p\u003e\n\u003cp\u003e“Apparently, he ‘buttled’ very well,” Raif said.\u003c/p\u003e\n\u003cp\u003e“But he was there the whole time,” Joe pointed out.\u003c/p\u003e\n\u003cp\u003e“We don’t have a thing on him. We searched the house, but there was no sign of poison anywhere, including in his quarters. Naturally we looked at his son, but there was nothing to prove he was there earlier. Same thing with the aunt. The two of them arrived together.”\u003c/p\u003e\n\u003cp\u003e“Still, I’m assuming the son had the most to gain from his death?”\u003c/p\u003e\n\u003cp\u003e“Of course. We’ve talked to Bigelow’s attorney, and except for some special endowments and individual bequests, Jared Bigelow inherits everything.”\u003c/p\u003e\n\u003cp\u003e“I’m going to assume you’ve looked into the rest of the Ravens’ alibis?” Joe said.\u003c/p\u003e\n\u003cp\u003eHe heard Raif’s sigh. “Yes, of course.”\u003c/p\u003e\n\u003cp\u003e“Want to give me a list?”\u003c/p\u003e\n\u003cp\u003e“Larry Levine was at the paper.”\u003c/p\u003e\n\u003cp\u003e“On the weekend?”\u003c/p\u003e\n\u003cp\u003e“Yeah, a doorman vouched for him. Brook Avery was at home, watching television. He spoke to a neighbor around three o’clock. Um, hang on. I’ll get my notes.” There was some shuffling. Joe could hear a woman’s voice, calling Raif to dinner. He promised her that he’d be right there. Joe tried to imagine Raif Green’s domestic life. Sometimes he seemed sad and burned-out, but he had kids at home. And a wife. He investigated murders every day, then went home to kids and homework and meatloaf.\u003c/p\u003e\n\u003cp\u003eRaif came back on the line. “Nat Halloway was working on his clients’ files at his office. He was seen by a cleaning woman. Don Tracy, the actor…was rehearsing a one-man play. We verified his alibi with the director and the rest of the cast. Lila Hawkins was at a blood-donation center, seen by a dozen people around four o’clock. Barbara Hirshorn…home alone watching television. Verified by a neighbor, who saw Barbara when she went out for groceries. Lou Sayles was at an afternoon party for a retiring schoolteacher. Out in Brooklyn Heights. Verified by half a dozen people. I think we’ve got them all covered. Oh, yeah, your friend. Eileen Brideswell. She was home, too, verified by Bertha Landry, her live-in maid, and Henry Grant, her…jack of all trades, I guess you’d call him. Besides, I can guarantee you that Eileen Brideswell is as law-abiding as they come.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Joe said. “But you know, Raif…”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure any one of those is a really good alibi, the kind that guarantees someone didn’t slip out to Bigelow’s place for a half hour or so.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know,” Raif said.\u003c/p\u003e\n\u003cp\u003e“So…”\u003c/p\u003e\n\u003cp\u003e“There are laws, Joe,” Raif said. “I’m a public servant. I can’t just barge into people’s houses and search them without a warrant. I haven’t got a thing to hold anyone on.”\u003c/p\u003e\n\u003cp\u003e“What about the accident on the FDR?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“What about it? That’s Traffic’s job. I can’t do a damned thing when there’s no one out there who can give me anything more than a dark sedan that was driving erratically. I can’t connect that accident—even if Sam Latham is still in the hospital—to Thorne Bigelow’s murder. And if we’re talking Poe…”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah. Poe had no vehicular homicides in his stories. Got ya,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Of course, you’re a private investigator…” Raif reminded him, letting the words trail off suggestively.\u003c/p\u003e\n\u003cp\u003e“And your point is…?”\u003c/p\u003e\n\u003cp\u003e“You’re not subject to quite as much shit as I am.”\u003c/p\u003e\n\u003cp\u003e“Great. Are you going to get me out of jail when they lock me up for breaking and entering, or whatever it is you’re suggesting I do?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“Joe, I’m not suggesting you do anything illegal,” Raif protested. “Not that you couldn’t push the boundaries a little if you needed to.”\u003c/p\u003e\n\u003cp\u003e“Gee, thanks.”\u003c/p\u003e\n\u003cp\u003e“The thing is…”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Well, if Bigelow was killed because of the Poe thing…”\u003c/p\u003e\n\u003cp\u003e“Then you think the killer will end up striking again before he’s caught, is that what you’re saying?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“Sadly, yes,” Raif said.\u003c/p\u003e\n\u003cp\u003eJoe heard the woman’s voice calling out to Raif again. “Go eat your dinner before it gets cold,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Yeah, thanks, I will. Don’t forget, Joe, if you get anything…”\u003c/p\u003e\n\u003cp\u003e“You know I’ll call you,” Joe promised, and hung up.\u003c/p\u003e\n\u003cp\u003eHe pulled out a map of Manhattan and started going through alibis one by one. Brook Avery lived uptown; if he was where he said he’d been, getting down to Bigelow’s place would have taken a while. Joe put his name on one list. On the other hand, Larry Levine’s office was relatively close to Bigelow. He could have slipped out easily. His name went on a second list.\u003c/p\u003e\n\u003cp\u003eJoe kept going. Don Tracy. The theater was close enough, too. Don’s name went under Larry’s.\u003c/p\u003e\n\u003cp\u003eHe put Jared Bigelow and Mary Vincenzo on that list, too.\u003c/p\u003e\n\u003cp\u003eAlong with the butler.\u003c/p\u003e\n\u003cp\u003eLou Sayles had the best alibi. He put her name on the list with Brook’s. Lila Hawkins, big, pushy Lila, had been uptown at the blood-donation center. Her name, too, went on the “improbable” list. He hesitated when he got to Barbara Hirshorn. She was afraid of her own shadow, but her home was near Bigelow’s. He didn’t really see her as a potential killer, but he put her name on the “follow up first” list anyway.\u003c/p\u003e\n\u003cp\u003eHe drummed his fingers on the desk, then decided to start with Jared. Why not go for the obvious?\u003c/p\u003e\n\u003cp\u003eThe butler had been an easy choice, but if the butler hadn’t done it…\u003c/p\u003e\n\u003cp\u003ePatricide was as old as history. And Jared Bigelow was the one who would profit the most from his father’s death.\u003c/p\u003e\n\u003cp\u003eEdgar Allan Poe, so they said, was the father of the detective story. And he and his Monsieur Dupin had used “ratiocination,” or rational deduction, as their method of investigation.\u003c/p\u003e\n\u003cp\u003eSo, rationally, who benefitted? And who not only had motive but opportunity?\u003c/p\u003e\n\u003cp\u003eHe skipped over Poe and thought about Sherlock Holmes, who always told Watson that you needed to get rid of the impossible, and then what was left, no matter how improbable, had to be the truth.\u003c/p\u003e\n\u003cp\u003eJoe groaned softly, looking at his notes.\u003c/p\u003e\n\u003cp\u003eSo far, nothing seemed to be impossible.\u003c/p\u003e\n\u003cp\u003eNot even talking to dead people.\u003c/p\u003e\n\u003cp\u003eCHAPTER 8\u003c/p\u003e\n\u003cp\u003eGenevieve’s cell phone rang and she answered it absently. “Hello?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-18.html","bookId":2272,"creation":"Oct 5, 2019 5:32:03 PM","modification":"Oct 5, 2019 5:32:03 PM"}
