{"id":88960,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eYeah, a shrink was definitely in order.\u003c/p\u003e\n\u003cp\u003eHe reached out, slipping his arms around her. “I’m fine. I haven’t been so fine in a very long time,” he said.\u003c/p\u003e\n\u003cp\u003eHer smiled deepened. “Can you stay…through the night?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Just try to get rid of me,” he told her.\u003c/p\u003e\n\u003cp\u003eHer eyes, so deep, so blue, so trusting, were on him.\u003c/p\u003e\n\u003cp\u003eHe held her closer, and for a moment there was nothing between them but warmth. Contentment. Closeness. There was something so good about just being together, touching.\u003c/p\u003e\n\u003cp\u003eLater in the night, they made love again. And when they slept again at last, it was as if they were meant to fit together. The only thing that marred the feeling for him was…\u003c/p\u003e\n\u003cp\u003eFear.\u003c/p\u003e\n\u003cp\u003eDear God, he thought, please, don’t let me lose her, too. We’ve come through so much. She’s survived so much. Please…\u003c/p\u003e\n\u003cp\u003eCHAPTER 9\u003c/p\u003e\n\u003cp\u003eJared Bigelow was waiting when Joe entered his office.\u003c/p\u003e\n\u003cp\u003eHe had a floor in a Midtown building where Bigelow, Inc., ran its investment business. Most of the family money had been in real estate, but online investigation had shown Joe that Thorne had weighed other options and diversified into computers and several other high-tech concerns. He’d been president, but apparently he’d left most of the day-to-day management to his son for many years. He’d allowed himself the freedom to indulge his love of Edgar Allan Poe and to write the book that had brought him so much acclaim. And possibly led to his death.\u003c/p\u003e\n\u003cp\u003eA secretary let Joe in to see Jared, who indicated, without rising himself, that Joe should sit. There was a long sofa across from Bigelow’s desk, but Joe opted to pull over a chair from the far side of the room; he wanted to be close enough to read the man’s eyes.\u003c/p\u003e\n\u003cp\u003e“What is it? Why are you here?” Jared asked.\u003c/p\u003e\n\u003cp\u003e“To talk about your father’s death,” Joe said, as if the answer should have been obvious. “I’m assuming you want his killer caught,” he went on easily.\u003c/p\u003e\n\u003cp\u003e“Of course, I do,” Jared snapped.\u003c/p\u003e\n\u003cp\u003e“Then you shouldn’t mind helping me out.”\u003c/p\u003e\n\u003cp\u003eJared sighed, and for a moment he didn’t look like such a blustering jackass, Joe thought. “Look, my father was murdered. The police questioned me for hours. Do you think I’m an idiot? I’m obviously the first suspect on anyone’s list. I inherited his money and this company, for one thing. But I loved my father, and we worked well together. You can question everyone from now until eternity, and they’ll tell you the same thing.”\u003c/p\u003e\n\u003cp\u003eJoe nodded. “Look, I know you talked to the police. And I know it has to be hard to lose your father, then have to deal with all the questions, knowing that people suspect you. But it will help me a lot if you just go over everything one more time. Everything that happened once you found him.”\u003c/p\u003e\n\u003cp\u003eJared Bigelow sat back in his chair, tapping a pencil against his desk and looking up at the ceiling, as if he could better recreate what had occurred.\u003c/p\u003e\n\u003cp\u003e“We were supposed to go to dinner.”\u003c/p\u003e\n\u003cp\u003e“You, your aunt and your father.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And your aunt was with you when you got to your father’s house?”\u003c/p\u003e\n\u003cp\u003e“Yes, I picked her up first.”\u003c/p\u003e\n\u003cp\u003e“She lives closer to you than your father did?”\u003c/p\u003e\n\u003cp\u003e“Different direction,” Jared said. He shook his head, then shrugged. “We got there. I have a key, so I unlocked the door and went in. I called for my father, but he didn’t answer. I went into his office and…he was slumped over. I thought at first that he’d just collapsed…maybe had a heart attack. I went a little crazy.”\u003c/p\u003e\n\u003cp\u003e“You tried CPR?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eJoe was still trying to figure out how Thorne had ended up slumped over when the paramedics arrived, given that Jared had admitted to trying CPR on him, but he decided not to derail the man by asking about it now.\u003c/p\u003e\n\u003cp\u003e“And your aunt called 9-1-1?”\u003c/p\u003e\n\u003cp\u003e“Yes, I guess.”\u003c/p\u003e\n\u003cp\u003e“You didn’t call them, right?”\u003c/p\u003e\n\u003cp\u003e“I don’t…I don’t think so. I remember seeing my father…my aunt being there…and then Bennet coming down. And sirens, and then a lot of people.” He looked at Jared. “That’s all I remember,” Jared said.\u003c/p\u003e\n\u003cp\u003e“Where was the wineglass?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Your father’s wineglass. Where was it?”\u003c/p\u003e\n\u003cp\u003eJared frowned. “It was…on the desk. His desk.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“On the left, near the edge. What the hell does it matter?” He sounded aggravated again.\u003c/p\u003e\n\u003cp\u003e“I’m not sure.”\u003c/p\u003e\n\u003cp\u003eJared cleared his throat. “Well, then, if that’s it…I have to get through today, and then his memorial service is tonight.”\u003c/p\u003e\n\u003cp\u003e“And his burial?”\u003c/p\u003e\n\u003cp\u003e“He’s being cremated.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“So?” Jared Bigelow asked impatiently. “Is there anything else?”\u003c/p\u003e\n\u003cp\u003e“Just one more question,” Joe said.\u003c/p\u003e\n\u003cp\u003e“And that is?”\u003c/p\u003e\n\u003cp\u003e“How long have you been having an affair with your aunt?” Joe asked easily.\u003c/p\u003e\n\u003cp\u003eThe pencil dropped from Jared’s fingers. His face turned a mottled shade of crimson and he stood up, enraged. “Get out. Get out of my office, and don’t come back.”\u003c/p\u003e\n\u003cp\u003e“It had to be a man,” Lila Hawkins announced.\u003c/p\u003e\n\u003cp\u003eShe had decided to drop in on Eileen Brideswell for lunch. And Genevieve hadn’t been about to let Lila Hawkins anywhere near her mother without being present herself. It didn’t matter that Bertha was going to be preparing the food, and that she wouldn’t leave Eileen alone for a minute. Genevieve intended to be there.\u003c/p\u003e\n\u003cp\u003eFrom there, it had somehow turned into a ladies’ lunch. Lou Sayles and Barbara Hirshorn were both there, too, as they all congregated around Eileen’s balcony table. Henry and Bertha hovered nearby, determined to keep an eye on Eileen at all times.\u003c/p\u003e\n\u003cp\u003e“Lila, he was poisoned, so why are you so sure his killer was a man?” Eileen asked.\u003c/p\u003e\n\u003cp\u003e“And why do we have to keep rehashing this?” Barbara asked.\u003c/p\u003e\n\u003cp\u003e“We haven’t even held Thorne’s memorial yet,” Lila said. “I think it’s only natural that we’re talking about it.”\u003c/p\u003e\n\u003cp\u003e“Well, I still don’t see why you think he had to be murdered by a man,” Lou said.\u003c/p\u003e\n\u003cp\u003e“A man did it. I just know it,” Lila said.\u003c/p\u003e\n\u003cp\u003e“Pity you don’t know what man,” Genevieve said, drawing one of Lila’s reprimanding stares.\u003c/p\u003e\n\u003cp\u003e“Lila, historically, women who commit murder often use poison,” Eileen said.\u003c/p\u003e\n\u003cp\u003e“Really?” Barbara Hirshorn demanded, looking horrified. “That’s just too terrible. I can’t believe a woman could have hurt the poor man.”\u003c/p\u003e\n\u003cp\u003e“Killed him,” Lou corrected.\u003c/p\u003e\n\u003cp\u003eLila shook her head. “It was Larry Levine. He’s always been jealous of Thorne. You know, sees himself as the real writer, while Thorne was just a businessman. Poor Thorne. It’s a pity he ever wrote that book. It was his downfall.”\u003c/p\u003e\n\u003cp\u003e“Lila, it’s reckless of you to accuse Larry this way,” Eileen said firmly. “And we have no idea if Thorne’s book was really a factor or not.”\u003c/p\u003e\n\u003cp\u003eFor a moment they all paused, looking at one another awkwardly.\u003c/p\u003e\n\u003cp\u003e“Do you think that…Mary Vincenzo…could have…?” Barbara asked in a whisper.\u003c/p\u003e\n\u003cp\u003e“No,” Lila said firmly. “I don’t. I think they need to look at Larry. Hard.”\u003c/p\u003e\n\u003cp\u003e“Does Larry know that you think he’s the killer?” Barbara asked nervously.\u003c/p\u003e\n\u003cp\u003e“Oh, good heavens, I’m not foolish enough to accuse him publicly,” Lila said. “What I’m saying here is just between us…and Genevieve, of course. Although I strongly suspect some of our words will be repeated to that private investigator you hired.” She pointed a finger at Genevieve. “All right, maybe I’m saying this because I know it will be repeated, and there’s where he should be looking. Tell that young man he needs to tear apart everything in Larry Levine’s life. I promise you, Larry is—or was, anyway—viciously jealous of poor Thorne.”\u003c/p\u003e\n\u003cp\u003eGenevieve held her tongue. Lila had talked about pompous Thorne when he’d been alive, but now he was poor Thorne.\u003c/p\u003e\n\u003cp\u003e“I’ll tell Joe what you suspect, Lila,” Genevieve said. “And I’m sure he’ll investigate Larry.” Along with everyone else, she added silently.\u003c/p\u003e\n\u003cp\u003eLila nodded, as if pleased, and things were just as they should be. “Keep an eye on him at the service tonight. Keep a close eye on him,” she warned gravely.\u003c/p\u003e\n\u003cp\u003e“Of course, Lila,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eAt first, the service for Thorne Bigelow could have been any memorial. The prayers were said, and the mourners looked duly sad.\u003c/p\u003e\n\u003cp\u003eBoth Raif Green and Tom Dooley were there, but they remained at the rear of the church, just watching.\u003c/p\u003e\n\u003cp\u003eWhen the prayers were over, Jared tearfully talked about his father’s brilliance and his love for literature. Then Mary Vincenzo spoke about her brother-in-law’s philanthropic work. Afterward, Jared stepped back to the podium and invited any of the mourners who had something to say to come up, starting with those who had been in his father’s beloved society.\u003c/p\u003e\n\u003cp\u003eAnd with that, the service turned into a Poe convention.\u003c/p\u003e\n\u003cp\u003eBrook Avery came up and read from “Annabelle Lee.” Then Don Tracy did a dramatic reading of “The Raven.” Nat Halloway, though awkward and stiff, announced that he was reading from a story that was a favorite of his, as well as Thorne Bigelow’s, “The Masque of the Red Death.” Larry Levine was just as awkward, but he stumbled through a passage from “MS Found in a Bottle.”\u003c/p\u003e\n\u003cp\u003eLila Hawkins came up and briefly said that the community would mourn such a colorful man, and that the perpetrator of the crime must be caught. Lou Sayles spoke fondly of a man she would miss. Eileen was just as kind and brief. Sam Latham, though he remained in the hospital, sent his condolences through a coworker.\u003c/p\u003e\n\u003cp\u003eBarbara Hirshorn was shy and hesitant, but she commended Thorne Bigelow on all he had done for the literary community. When she finished, there was only scattered applause, because by then people were getting tired, and some had even slipped out. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-21.html","bookId":2272,"creation":"Oct 5, 2019 5:32:03 PM","modification":"Oct 5, 2019 5:32:03 PM"}
