{"id":88964,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut when he fell asleep, he dreamed again. And in his dream, Genevieve was walking toward him. They were on a beach, or maybe they were in the clouds. She was wearing something light that trailed behind her in the breeze. She was smiling, her expression radiant. Her hair whipped behind her like auburn silk.\u003c/p\u003e\n\u003cp\u003eAnd her eyes…\u003c/p\u003e\n\u003cp\u003eHer eyes were that endless blue.\u003c/p\u003e\n\u003cp\u003eShe smiled, excited, as if she were expecting something…something good.\u003c/p\u003e\n\u003cp\u003eThen the bruises began to appear on her throat, and her eyes widened and began to bulge as she stared at him, choking, gasping for breath.\u003c/p\u003e\n\u003cp\u003eHe heard her whisper, Help me. Please, help me, and he woke with a start, bolting upright in the bed.\u003c/p\u003e\n\u003cp\u003eHe didn’t wake her, though. Genevieve was asleep at his side in a soft yellow tank top and ladies’ boxers, breathing easily. The light filtering in from beyond the drawn curtains played brilliant fire tricks with her hair.\u003c/p\u003e\n\u003cp\u003eHe lay back down, convinced he really was losing his mind, then jerked into a sitting position again.\u003c/p\u003e\n\u003cp\u003eDebbie had claimed that Hastings House seemed to breathe. That it had a heartbeat. That it had tried to save her.\u003c/p\u003e\n\u003cp\u003eAnd the house—or someone in it—had whispered to him.\u003c/p\u003e\n\u003cp\u003eDead people whispered to him.\u003c/p\u003e\n\u003cp\u003eHe stared up at the ceiling, teeth clenched. No. He didn’t want to talk to ghosts. He didn’t want to listen to dead people and he damned well didn’t want to believe that a house could be haunted, much less alive.\u003c/p\u003e\n\u003cp\u003eSuddenly he was afraid, but not for himself. For Genevieve.\u003c/p\u003e\n\u003cp\u003eAfraid that his dreams meant something, that she was in danger.\u003c/p\u003e\n\u003cp\u003eHe perched on one elbow and watched her sleep, wanting to touch her, not wanting to awaken her.\u003c/p\u003e\n\u003cp\u003eBut her eyelids fluttered suddenly, as if she sensed him, sensed his concern, even in the depths of her sleep.\u003c/p\u003e\n\u003cp\u003eHer eyes opened, and she caught him studying her.\u003c/p\u003e\n\u003cp\u003e“What?” she asked, and started to sit up.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he said softly.\u003c/p\u003e\n\u003cp\u003e“Then…?”\u003c/p\u003e\n\u003cp\u003e“I was just watching you,” he said, knowing it was both a lie and the truth.\u003c/p\u003e\n\u003cp\u003eShe reached up and touched his face in that special way of hers. Then her knuckles brushed down over his chest, and the next thing he knew, she was pushing him down against the mattress and straddling him. When he would have touched her in return, she whispered a soft but commanding, “No.”\u003c/p\u003e\n\u003cp\u003eShe bent and quickly brushed her lips against his.\u003c/p\u003e\n\u003cp\u003eThen she teased his chest with her kiss and the silky caress of her hair.\u003c/p\u003e\n\u003cp\u003eFinally she moved lower, but not until he was so aroused that he couldn’t stand it did she allow him to reach for her, lift her and bring her back down on his erection. He felt as if the world exploded along with him as he entered her.\u003c/p\u003e\n\u003cp\u003eLater she slept again, and he lay beside her knowing that he had kept the truth from her. That she didn’t know he was crazy. That he had gone to Hastings House and heard the whisper of the woman with whom he’d once been falling in love.\u003c/p\u003e\n\u003cp\u003eLeslie.\u003c/p\u003e\n\u003cp\u003eA dead woman.\u003c/p\u003e\n\u003cp\u003eAnd Gen didn’t know that he kept seeing her eyes as the life was choked out of her.\u003c/p\u003e\n\u003cp\u003eShe didn’t know that the man she was depending on was slowly losing his mind.\u003c/p\u003e\n\u003cp\u003eIn the morning, he left before she woke up.\u003c/p\u003e\n\u003cp\u003eHe was suddenly anxious, because Lori Star had never contacted him.\u003c/p\u003e\n\u003cp\u003eAt Lori’s apartment, he once again got no response to his knocking. Before he could move on to Susie’s place, her door opened and she came out to speak to him. She was clearly distressed. “I was going to call you today. I don’t know what to do. I don’t think Lori ever came home.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “You haven’t seen her since Sunday?”\u003c/p\u003e\n\u003cp\u003e“No. And I don’t know what to do. I mean, I’m not her next of kin or anything. And I always heard that a person had to be missing for forty-eight hours before anyone could fill out a missing-persons report, but I don’t even know if she is a missing person. Oh, God, I’m so upset. I just don’t know what to do.”\u003c/p\u003e\n\u003cp\u003e“It’s all right. But it’s definitely time to fill out a missing-persons report. I’ll go down to the police station with you.”\u003c/p\u003e\n\u003cp\u003e“Police station?” she said, and cleared her throat. “Um, Mr. Connolly, you should know…I’ve been arrested before.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter,” he assured her.\u003c/p\u003e\n\u003cp\u003eBut she wasn’t going to go down to the station with him, he quickly realized, so he put through a call to Raif.\u003c/p\u003e\n\u003cp\u003e“That’s Missing Persons,” Raif told him.\u003c/p\u003e\n\u003cp\u003e“Raif, this is the woman who was on television after that pileup on the FDR, saying she was psychic.”\u003c/p\u003e\n\u003cp\u003e“Then talk to Traffic,” Raif said.\u003c/p\u003e\n\u003cp\u003e“Raif, dammit, Sam Latham was in that accident. It might be connected.”\u003c/p\u003e\n\u003cp\u003e“And it might not!”\u003c/p\u003e\n\u003cp\u003eExasperated, Joe held his temper. “So do you have any answers on the Thorne Bigelow murder yet?” he demanded.\u003c/p\u003e\n\u003cp\u003e“No,” Raif admitted after a moment, then sighed. “All right, I’ll get someone from Missing Persons and come over.”\u003c/p\u003e\n\u003cp\u003e“We’ve got to get into the apartment,” Joe added.\u003c/p\u003e\n\u003cp\u003e“Ask her friend if she has a key,” Raif told him. “Maybe she’s supposed to water the plants or something like that.”\u003c/p\u003e\n\u003cp\u003eRaif turned to Susie. “Do you have a key to the apartment?” he asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head, and Joe went back to his call.\u003c/p\u003e\n\u003cp\u003e“She’s a missing person, Raif. Can’t we get a warrant on probable cause to find out if she happens to be lying dead inside?”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah,” Raif said. “All right, I’ll be there as soon as I can.”\u003c/p\u003e\n\u003cp\u003eEventually Raif showed up with, as promised, an officer from Missing Persons. Susie did her best to answer all the necessary questions, but it was difficult. If Lori had living parents or other family, Susie had never met them. She didn’t even know if Lori Star was her real name.\u003c/p\u003e\n\u003cp\u003eWhile the officer worked with Susie, Raif, who had the warrant in his pocket, entered the apartment. Joe followed him in without asking permission.\u003c/p\u003e\n\u003cp\u003e“There’s nothing out of order,” Raif said. He sighed, turning to Joe. “Look, I know you thought there was something believable about her, but…the woman is a prostitute. Who knows? She wasn’t bad-looking. Maybe she found someone she could, um, ‘work’ for a while. Maybe she’s shacked up in a motel somewhere.”\u003c/p\u003e\n\u003cp\u003e“She didn’t leave with any of her belongings, not according to what Susie told us,” Joe said. “She went ‘to see a man about a horse.’ It sounds to me like she went out to meet someone, and that it didn’t go very well.”\u003c/p\u003e\n\u003cp\u003e“Either that,” Raif argued, “or she went to meet someone and it went very well. Didn’t you see Pretty Woman?”\u003c/p\u003e\n\u003cp\u003e“Raif, are you serious?” Joe demanded.\u003c/p\u003e\n\u003cp\u003e“No, but…I don’t know what to tell you.”\u003c/p\u003e\n\u003cp\u003eFrustrated, Joe looked through Lori Star’s apartment, but try as he might, he couldn’t see anything out of order, either. Nor had she left a note of her destination scribbled down on her phone pad.\u003c/p\u003e\n\u003cp\u003e“Can you trace her phone records, at least?” Joe asked Raif.\u003c/p\u003e\n\u003cp\u003e“I’ll get someone on it,” Raif promised.\u003c/p\u003e\n\u003cp\u003eAt last, with nothing else to do, Joe left, still entirely frustrated.\u003c/p\u003e\n\u003cp\u003eBut as he left Lori’s apartment, he thought of the first time Genevieve had come to him about Thorne Bigelow’s murder.\u003c/p\u003e\n\u003cp\u003eQuoth the raven: die.\u003c/p\u003e\n\u003cp\u003eNew York City hadn’t been especially good to Poe. The man had been self-destructive, true, but he had come to New York to make his fortune. In the end, the city hadn’t afforded him the fame he had craved, much less any riches. Down and out, he had left the city to take a job in Philadelphia.\u003c/p\u003e\n\u003cp\u003eAfter he had left the city, a murder had occurred, that of Mary Rogers, known in the papers of the day as the beautiful cigar girl. She had disappeared on a Sunday.\u003c/p\u003e\n\u003cp\u003eJust like Lori Star.\u003c/p\u003e\n\u003cp\u003eMary had left her home of her own free will.\u003c/p\u003e\n\u003cp\u003eJust like Lori Star.\u003c/p\u003e\n\u003cp\u003eSuddenly a sense of panic seized him, and he was desperate to see Genevieve, to make sure she was all right. He raced to her building, gave his name to the security guard and was cleared to go up. She met him at her door, an anxious look on her face.\u003c/p\u003e\n\u003cp\u003e“Joe, what is it?” she asked.\u003c/p\u003e\n\u003cp\u003e“Lori Star never came home,” he told her.\u003c/p\u003e\n\u003cp\u003eHe barely noticed that she returned to the phone on the counter and told someone, “I’ll call you back later, okay?”\u003c/p\u003e\n\u003cp\u003e“Did you call the police about her?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes, of course.” He met her eyes. “I’d like to go to my apartment,” he told her.\u003c/p\u003e\n\u003cp\u003e“All right.”\u003c/p\u003e\n\u003cp\u003e“And I want you to come with me.”\u003c/p\u003e\n\u003cp\u003e“Sure,” she agreed.\u003c/p\u003e\n\u003cp\u003eHe felt some of the tension easing out of him.\u003c/p\u003e\n\u003cp\u003eGenevieve was fine. There was no reason for him to keep feeling this awful sense of panic.\u003c/p\u003e\n\u003cp\u003e“Joe, what’s going on with you? What’s wrong?” she asked him.\u003c/p\u003e\n\u003cp\u003e“Nothing. It’s just…an uneasy time,” he said, trying to sound nonchalant. “I’m not going to be happy until we find Thorne Bigelow’s killer.”\u003c/p\u003e\n\u003cp\u003eShe looked at him and nodded, but she knew there was more to what was bothering him than that. But arguing with him wasn’t going to get her anywhere.\u003c/p\u003e\n\u003cp\u003eHe tried to keep things light as they drove out to Brooklyn. He asked her about Eileen, making sure she was keeping in regular touch with her mother.\u003c/p\u003e\n\u003cp\u003e“Of course,” she told him.\u003c/p\u003e\n\u003cp\u003e“What are we doing here?” Genevieve asked him when they got to his place.\u003c/p\u003e\n\u003cp\u003e“I live here,” he said as lightly as he could.\u003c/p\u003e\n\u003cp\u003e“No, I meant what are we going to do while we’re here? What are we looking for?”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “This may be really farfetched and stupid,” he told her.\u003c/p\u003e\n\u003cp\u003e“I’m listening.”\u003c/p\u003e\n\u003cp\u003e“All right, let’s suppose that someone really is reenacting Poe’s work with real victims. Thorne was the first victim. And Sam…maybe that was intentional, too, or maybe the killer just saw a convenient chance and took it. But if the two are connected, the murderer must have been scared shi—alarmed when Lori Star started getting attention from the media.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-25.html","bookId":2272,"creation":"Oct 5, 2019 5:32:03 PM","modification":"Oct 5, 2019 5:32:03 PM"}
