{"id":88972,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eOkay, rationally, he hated the fact that Genevieve had called Adam. Regarding him. There were far more serious matters at hand—tonight’s attempt on Sam’s life, for one thing. The police had suggested that the news not be shared with the news media or anyone else, except for on a need-to-know basis. There was no escaping the fact that there was a serial killer out there, one with either a real or feigned Poe fetish, and holding some information back would help them separate the real killer from the pretenders who were bound to come forward.\u003c/p\u003e\n\u003cp\u003eThe killer was real and needed his concentration. So think about that, he told himself. He’d tried to eliminate at least some members of the New York Poe Society board by examining their alibis for the afternoon and evening when Thorne had been killed. Now the process of elimination would be easier, because he could find out where each of them had been this evening around seven, the night of the car crash and the night Lori went missing, then cross reference everything and eliminate more of them from his suspect pool.\u003c/p\u003e\n\u003cp\u003eThey’d all been at O’Malley’s tonight, but where they had they been beforehand?\u003c/p\u003e\n\u003cp\u003eHe would find out, he thought grimly. Of course, that didn’t mean he would have the killer in his sights. It was still possible that the killer was someone else, and there were millions of people out there in New York to choose from.\u003c/p\u003e\n\u003cp\u003eBut not a million people that Thorne Bigelow would trust.\u003c/p\u003e\n\u003cp\u003eJoe suddenly realized that his steps had led him back to Hastings House.\u003c/p\u003e\n\u003cp\u003eOnce again, it was closed, since it was only open at night for special functions, as it had been the night Matt was killed at the gala held to celebrate the house’s rebirth as a museum. That night Matt had died and Leslie had touched the other side, but she had returned….\u003c/p\u003e\n\u003cp\u003eFor a year.\u003c/p\u003e\n\u003cp\u003eEnough time in which to capture his…what? His heart? Or his soul?\u003c/p\u003e\n\u003cp\u003eAs he stood there on the sidewalk, he noticed that the gate was ajar. “No,” he said aloud.\u003c/p\u003e\n\u003cp\u003eBut he couldn’t stop himself. The compulsion was too great. He told himself it was his own determination to prove that nothing was going on that science couldn’t explain, but…\u003c/p\u003e\n\u003cp\u003eBut he knew he was looking for something more.\u003c/p\u003e\n\u003cp\u003eHe let himself in through the open gate and slowly walked up the path to the steps. He looked up at the house and told himself that it was just that. A house. Brick, mortar, wood. A house. It didn’t live and breathe. No matter what Debbie thought, the house hadn’t saved her. Brick, mortar and wood would not—could not—reach out to help people.\u003c/p\u003e\n\u003cp\u003eBut Leslie would.\u003c/p\u003e\n\u003cp\u003eGreat. Now he was going to force himself to walk into the house, where he would no doubt imagine that he could hear her voice. That she was still there.\u003c/p\u003e\n\u003cp\u003eNo, he told himself. He was going to step into the house, discover that the wiring was shot and the security system was going haywire.\u003c/p\u003e\n\u003cp\u003eHe walked up the steps to the porch.\u003c/p\u003e\n\u003cp\u003eThe front door opened.\u003c/p\u003e\n\u003cp\u003eHe walked in.\u003c/p\u003e\n\u003cp\u003eIt looked just the same as it had the other night. He looked up the stairway, lit by the pale red security lights. He examined the furnishings there in the entry, checked out the runner that protected the hardwood floor. There was an oil painting on the wall, a rider in a tricorn hat. Candles in sconces.\u003c/p\u003e\n\u003cp\u003eThere were no sounds this time, though. None at all.\u003c/p\u003e\n\u003cp\u003eStrangely, the house felt warm. It was a museum, he reminded himself. It had to be kept at a certain temperature to protect the antique furnishings. But it wasn’t good, and it wasn’t evil. It was simply a house.\u003c/p\u003e\n\u003cp\u003eJoe…\u003c/p\u003e\n\u003cp\u003eThe sense of warmth increased, as if he were being comforted, beckoned. He felt something brush against his cheek, the touch almost tender.\u003c/p\u003e\n\u003cp\u003e“I want you to be here,” he said aloud, feeling like a fool but unable to stop himself.\u003c/p\u003e\n\u003cp\u003eHis cell phone started to ring. He answered it. “Connolly.”\u003c/p\u003e\n\u003cp\u003eThere was no one there. “Dammit,” he muttered aloud, and closed the phone.\u003c/p\u003e\n\u003cp\u003eWell, what the hell had he expected? That he was going to walk in and Leslie would be there, waiting for him in jeans and a T-shirt, hair loose and manner easy? That in her casual yet somehow intense manner, she would invite him in for tea?\u003c/p\u003e\n\u003cp\u003e“I’m an idiot.”\u003c/p\u003e\n\u003cp\u003eHe turned back toward the door.\u003c/p\u003e\n\u003cp\u003eThen he felt the hand. A hand, dammit. On his shoulder.\u003c/p\u003e\n\u003cp\u003eJoe…\u003c/p\u003e\n\u003cp\u003eHe heard his name again, but it wasn’t Leslie’s voice.\u003c/p\u003e\n\u003cp\u003eIt was Matt’s!\u003c/p\u003e\n\u003cp\u003eOh, hell, he really was crazy. Leslie wasn’t here, welcoming him in. She was here with Matt. They had taken up residence in Hastings House, or maybe just within the tortured confines of his mind.\u003c/p\u003e\n\u003cp\u003eIt’s all right. Please, we can help.\u003c/p\u003e\n\u003cp\u003eHe muttered a curt expletive and turned, staring intently into the shadows.\u003c/p\u003e\n\u003cp\u003eThere! Had that shadow moved? Was there something misty taking shape in front of him? Would he be shaking hands with his cousin in a matter of moments?\u003c/p\u003e\n\u003cp\u003eHe swore again. Maybe it really was time for that psychotherapy now.\u003c/p\u003e\n\u003cp\u003eHe winced. “If…if you’re there, leave me the hell alone, will you, please?” he whispered.\u003c/p\u003e\n\u003cp\u003eCrazy. He had gone completely crazy.\u003c/p\u003e\n\u003cp\u003eHe turned around and left the house, hardly noticing when the lock clicked into place as the door shut behind him.\u003c/p\u003e\n\u003cp\u003eCHAPTER 14\u003c/p\u003e\n\u003cp\u003eLori Star made all the morning shows.\u003c/p\u003e\n\u003cp\u003eIt was sad, Gen thought, that she would have been glad to know she was, even in such a horrible way, immortalized.\u003c/p\u003e\n\u003cp\u003eGenevieve had gotten up early and headed home. Now, watching television in her own apartment, she decided to call her mother and reinforce the need for her to stay home, where she would be safe. She was turning into a nagging parent, she realized. Too bad.\u003c/p\u003e\n\u003cp\u003e“I don’t want you going anywhere alone,” she told her mother. “Or with Lou or Lila or any of them,” she added firmly.\u003c/p\u003e\n\u003cp\u003e“Genevieve, seriously. It can’t be any of them,” Eileen said.\u003c/p\u003e\n\u003cp\u003e“I mean it. I can’t believe you went out last night.”\u003c/p\u003e\n\u003cp\u003e“So did you.”\u003c/p\u003e\n\u003cp\u003e“I don’t trust that group, and I don’t want you trusting them, either.”\u003c/p\u003e\n\u003cp\u003e“You trust Adam. And Joe,” Eileen said.\u003c/p\u003e\n\u003cp\u003e“Don’t turn this around. Just don’t go anywhere today. Promise?”\u003c/p\u003e\n\u003cp\u003eA sigh. “I promise,” Eileen said. “Speaking of which…I’m curious. About Adam. You called him? You asked him to come?” she said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Leslie believed in him, you know. He was very dear to her.”\u003c/p\u003e\n\u003cp\u003e“I know. I take it he’s a friend of yours, too?”\u003c/p\u003e\n\u003cp\u003e“Well, the families, you know. I’ve met him at various functions over the years. And then, last year, when I hired Joe and everyone was looking for you…well, yes, I saw quite a lot of him then.”\u003c/p\u003e\n\u003cp\u003eGenevieve waited for her mother to elaborate further. When she didn’t, Gen asked, “Did you…?”\u003c/p\u003e\n\u003cp\u003e“Did I ever need help with anything paranormal? No,” Eileen said. “But Adam is a very good man.” She hesitated. “Joe knows that. I hope he’ll trust him with…whatever.”\u003c/p\u003e\n\u003cp\u003e“I hope so, too. I…um, I love you, Mother.”\u003c/p\u003e\n\u003cp\u003e“I love you, too. More than I can ever say,” Eileen said softly.\u003c/p\u003e\n\u003cp\u003eAt ten, Adam called Genevieve. “My friends have arrived,” he told her. “Brent and Nikki Blackhawk.”\u003c/p\u003e\n\u003cp\u003e“You saw how Joe was last night. I don’t think he’ll want to meet with them.”\u003c/p\u003e\n\u003cp\u003e“Yes, he will. Brent has some information for him.”\u003c/p\u003e\n\u003cp\u003e“Information?”\u003c/p\u003e\n\u003cp\u003e“Yes, he’s not just a ghost hunter, you know,” Adam said, and she couldn’t tell if his voice was teasing or not. “He’s a great investigator, and I think he can help Joe on this. Anyway, don’t worry about it. I’ll call Joe and set up lunch.”\u003c/p\u003e\n\u003cp\u003eGreat, she thought. Joe was going to be just thrilled. But all she said was, “Let me know.”\u003c/p\u003e\n\u003cp\u003eShe hung up and walked back into her living room, where Lori Star’s face was still front and center on the television. She turned away, then heard someone say, Help me.\u003c/p\u003e\n\u003cp\u003eShe swung back to the television. For a moment Lori seemed to be staring straight at her, but then she realized that the video was from the night Lori had been on television claiming to have “seen” the accident. And that there was nothing unusual about it.\u003c/p\u003e\n\u003cp\u003eEven so, she had the strangest urge to escape her own apartment. All she wanted was to run.\u003c/p\u003e\n\u003cp\u003eBut she couldn’t run away from herself, and she knew it. She remembered the strange sensation of being the other woman in the dream, remembered how she had seen the shadows come alive in the parking garage. And now she thought that a dead woman on television was looking at her, asking for help.\u003c/p\u003e\n\u003cp\u003eShe thought about how strangely Joe was behaving. Perhaps he was running, as well.\u003c/p\u003e\n\u003cp\u003eMaybe they were both going crazy.\u003c/p\u003e\n\u003cp\u003eShe turned off the television off, and as she did, she heard her cell phone ringing. It was Adam.\u003c/p\u003e\n\u003cp\u003e“I made a reservation for one o’clock. I’ve got a car, so I’ll be in front of your place at a quarter of.”\u003c/p\u003e\n\u003cp\u003e“Joe is fine with this?”\u003c/p\u003e\n\u003cp\u003e“He’ll be there,” Adam told her.\u003c/p\u003e\n\u003cp\u003eShe hung up, reflecting on the vast difference between “He’ll be there” and “Yes, he’s fine with it.”\u003c/p\u003e\n\u003cp\u003eDoctor Frank Arbitter was a homebody. It was just that his home seemed to be the morgue, Joe thought. The man could eat, drink, chat and read the comics, all with a corpse awaiting his attention, and apparently be no more worried about it than he was about the phone on his desk.\u003c/p\u003e\n\u003cp\u003eAn elderly white woman lay beneath a sheet that morning, only her head visible, so Joe wasn’t sure what stage her autopsy was at. As Frank welcomed him and indicated a chair by his desk, Joe paused. The other man watched but didn’t comment when Joe gently pulled the sheet up to cover the woman’s face.\u003c/p\u003e\n\u003cp\u003e“She was murdered?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“No, she was just alone. It was a heart attack, I’m fairly certain, but since no one was there, we have to do the autopsy. Hey, do you want a cat?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“She came in with her cat. They didn’t know it was hiding in the blanket she had around her when she died.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-33.html","bookId":2272,"creation":"Oct 5, 2019 5:32:04 PM","modification":"Oct 5, 2019 5:32:04 PM"}
