{"id":88979,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, they’re both dead,” he said.\u003c/p\u003e\n\u003cp\u003eAnd despite the liquor sloshing around in her body and confusing her mind, she propped herself up on one elbow and stared down at him. It was now or never.\u003c/p\u003e\n\u003cp\u003e“You’re wrong. They’re together. Really together. And they can help us, if we let them. If you need everything to be flesh and blood, to be real and physical, go ahead and think it’s all in your mind. Think of it as the memories pointing you in the right direction. Do whatever works for you, but just don’t discount it. Don’t be afraid, because you know I always had the feeling that Joe Connolly wasn’t afraid of anything. And don’t be angry with me about calling Adam. Leslie believed in ghosts, you know.”\u003c/p\u003e\n\u003cp\u003e“And she’s dead now,” he interrupted harshly.\u003c/p\u003e\n\u003cp\u003eBecause I’m alive, Genevieve almost said.\u003c/p\u003e\n\u003cp\u003eBut she didn’t.\u003c/p\u003e\n\u003cp\u003eAnd neither did he.\u003c/p\u003e\n\u003cp\u003eDespite that, the words hung in the air between them, as if they were ghosts themselves.\u003c/p\u003e\n\u003cp\u003eShe was sure there was more she needed to say, as if this were an argument she needed to win. But then she sighed, exhaling all the air that was in her, and there was nowhere else left to go.\u003c/p\u003e\n\u003cp\u003eShe lay back down, and the darkness continued to spin, weird little squiggles of light dancing behind her eyelids. No wonder she had spent so many years hating whiskey.\u003c/p\u003e\n\u003cp\u003eThere was nothing but silence, and she thought he must have fallen asleep, so she was startled when his voice came out of the darkness, deep and tormented.\u003c/p\u003e\n\u003cp\u003e“Dammit, Genevieve, don’t you see? I don’t want that for you. You’ve already suffered more than anyone should. And if you keep going in this direction—whether it’s in your mind, real…whatever—you’ll just stay tortured. You’ll always be trying to understand, searching for another clue…Oh, God, never mind. I can’t explain, it’s just that…that world is that world. The dead are dead and gone. Let them rest in peace.”\u003c/p\u003e\n\u003cp\u003eShe was stunned by the passion of his words, and she let several seconds go by. Then she felt the mattress shift and sensed him looking down at her. She stared back up at him in the shadows.\u003c/p\u003e\n\u003cp\u003e“What if they can’t rest in peace? What if they’re here because they’re determined to help us, whether we’re able to accept their help or not?” she whispered.\u003c/p\u003e\n\u003cp\u003eHe groaned.\u003c/p\u003e\n\u003cp\u003e“Joe,” she said softly, reaching up, delicately brushing her fingers over the rugged contours of his face. “Joe, something is haunting you, I know it,” she told him. “It started…it started that night at O’Malley’s when you were the one who got drunk.”\u003c/p\u003e\n\u003cp\u003eHe lay down on his back beside her again, shaking his head. “We’ve got to get some sleep,” he said.\u003c/p\u003e\n\u003cp\u003eIt was an argument she wasn’t going to win, she thought. Not tonight, anyway. But maybe even an argument was better than the angry silence they’d shared before. Just then he reached for her and drew her to his side.\u003c/p\u003e\n\u003cp\u003eProtectively.\u003c/p\u003e\n\u003cp\u003eIt felt good, she thought, to be exactly where she was, even if he was just there as her guardian, a sentinel determined to keep her safe.\u003c/p\u003e\n\u003cp\u003e“Take another couple of these.”\u003c/p\u003e\n\u003cp\u003eJoe was standing above her. He’d already showered, and his hair was still damp, but he was already dressed to face the day.\u003c/p\u003e\n\u003cp\u003e“What…time is it?” She squinted against the painful light of early morning and sat up, accepting the pills. She felt disoriented, but not as sick as she knew she deserved to, after everything she’d had to drink. She just wanted to go back to sleep.\u003c/p\u003e\n\u003cp\u003e“Five-thirty,” he said.\u003c/p\u003e\n\u003cp\u003eShe swallowed the pills. “Ten more minutes,” she told him.\u003c/p\u003e\n\u003cp\u003eWasn’t happening.\u003c/p\u003e\n\u003cp\u003eHe jerked the covers back, caught her arms and dragged her up. “Shower. Now. Unless you want to stay here, locked in this room, until we get back.”\u003c/p\u003e\n\u003cp\u003eSo she headed for the shower.\u003c/p\u003e\n\u003cp\u003eWhen she got out, she had about ten minutes left. Frantically, she began throwing things into an overnight case.\u003c/p\u003e\n\u003cp\u003e“If you forget something, we can buy it when we get there,” he told her. “Here.” He was back in front of her with a cup of coffee.\u003c/p\u003e\n\u003cp\u003eShe took it from him and drank gratefully.\u003c/p\u003e\n\u003cp\u003eTo her surprise, he smiled at her and touched her chin. “That hair of yours is a mess,” he told her.\u003c/p\u003e\n\u003cp\u003eShe turned, ready to look for her brush.\u003c/p\u003e\n\u003cp\u003e“Hey, leave it. It’s sort of sexy, in a hungover kind of way,” he told her.\u003c/p\u003e\n\u003cp\u003eShe cast him a glance of ice, causing him to laugh softly again.\u003c/p\u003e\n\u003cp\u003e“There’s your bell—they’re here,” he told her.\u003c/p\u003e\n\u003cp\u003e“I’m ready,” she said, and quickly swallowed the rest of her coffee. He had added enough milk to keep it from scalding her throat, and it was good.\u003c/p\u003e\n\u003cp\u003eA road trip.\u003c/p\u003e\n\u003cp\u003eJoe couldn’t believe he was on a road trip with four other people. He expected the usual question to come from the backseat: Are we there yet? But his passengers were quiet.\u003c/p\u003e\n\u003cp\u003eBrent had brought an audio collection of Edgar Allan Poe’s work. As they drove, they listened to “The Black Cat” and then “The Pit and the Pendulum,” moving on to the poems by the time they passed into Delaware.\u003c/p\u003e\n\u003cp\u003eJust over the Maryland line, Joe pulled over at a rest stop to get gas. Everybody decided to get something to eat at that point, and he was sure they would have to wake Genevieve, who had fallen asleep before they ever left Manhattan. She was awake, though, and he noticed with amusement that she’d brushed her hair back into its usual sleek cascade.\u003c/p\u003e\n\u003cp\u003e“What time do you think we’ll get there?” Nikki asked, as they all sat down to have breakfast.\u003c/p\u003e\n\u003cp\u003e“With or without traffic?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“We’re doing well so far,” Brent said, and glanced at Joe. “If we keep moving fairly quickly, we can make it by one-thirty or two.”\u003c/p\u003e\n\u003cp\u003e“When we get there, you and I will interview the widow and stop by the police station,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Oh, really, and what about the rest of us?” Genevieve demanded, looking none the worse for wear. She’d apparently had a pretty decent sleep while he’d been driving, Joe thought.\u003c/p\u003e\n\u003cp\u003e“We should look into Poe’s history in the city,” Nikki suggested. “Maybe find another tour to take.”\u003c/p\u003e\n\u003cp\u003e“Joe is right,” Adam said. “He and Brent won’t be able to get much out of the police or the widow if we all come in like a traveling circus.”\u003c/p\u003e\n\u003cp\u003e“Another Poe tour,” Genevieve mused, cradling her coffee cup. She looked up at Joe. He expected an argument, but got a smile instead. “Good. I keep thinking that…”\u003c/p\u003e\n\u003cp\u003e“That Edgar will make an appearance?” Joe asked dryly.\u003c/p\u003e\n\u003cp\u003e“I keep thinking that maybe one of the guides will say something to give us a real clue to what’s going on,” she said.\u003c/p\u003e\n\u003cp\u003e“Maybe,” Joe agreed. He didn’t believe it for a minute, though. The current killer had a modern agenda. Either he planned to accomplish it by the murders, or he was psychotic, and Joe didn’t think it was the latter.\u003c/p\u003e\n\u003cp\u003eHe was convinced that the killer was Jared. And that the agenda was greed.\u003c/p\u003e\n\u003cp\u003eExcept that…\u003c/p\u003e\n\u003cp\u003eWas he behind the deaths in Richmond and Baltimore, as well? If so, the motive couldn’t have been greed. Jealousy? That was the most logical second choice. But jealousy over what? Poe? Why? Thorne, not his son, had been the scholar.\u003c/p\u003e\n\u003cp\u003eJoe excused himself while they waited for their food and called Raif Green. They’d talked the night before, as Joe was on his way to the pub, and this seemed like as good a time as any to check on what they’d talked about.\u003c/p\u003e\n\u003cp\u003e“Joe,” Raif said, and it sounded like a groan.\u003c/p\u003e\n\u003cp\u003e“Were you able to get anyone assigned to follow Jared Bigelow?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“I’m doing my best. This is a city of millions, you know. And the police department is always understaffed. I’ve already got plainclothes people at the hospital.”\u003c/p\u003e\n\u003cp\u003e“Someone has to watch Bigelow,” Joe insisted.\u003c/p\u003e\n\u003cp\u003e“Easier said than done.”\u003c/p\u003e\n\u003cp\u003e“Bull. You know how to work the system.”\u003c/p\u003e\n\u003cp\u003eHe heard Raif laugh. “Quit worrying. Yes, I’ve got someone watching him. I’m working things from here, I swear. And as soon as you can give me something solid from another state, we’ll have FBI access, as well. The chief’s already called the bureau. Seems they’d already been called by someone. Someone with clout,” Raif said.\u003c/p\u003e\n\u003cp\u003eAdam Harrison, Joe thought, his first reaction irritation. Still, did it matter, if it got them where they needed to be?\u003c/p\u003e\n\u003cp\u003e“Thanks,” Joe told him.\u003c/p\u003e\n\u003cp\u003e“Joe, you, of all people, should know this may take time.”\u003c/p\u003e\n\u003cp\u003e“I’m just afraid that we don’t have a lot of time. Bigelow, Lori Star…and now Sam. This guy’s gone after three people in less than two weeks.”\u003c/p\u003e\n\u003cp\u003e“I know, I know, and we’re working it.”\u003c/p\u003e\n\u003cp\u003eJoe hesitated. “I’ve got one more thing for you. Just a hunch that might prove interesting.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Pull all the phone records. Say, from a week before Bigelow’s murder until now.”\u003c/p\u003e\n\u003cp\u003e“All the phone records?”\u003c/p\u003e\n\u003cp\u003e“For the Ravens. Let’s find out who was calling in, as well as who they called.”\u003c/p\u003e\n\u003cp\u003e“What will that prove?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure. I told you, it’s a hunch.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to be joking. Do you know how big a project that is? The D.A. will have a fit.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet you know the right people to get it done,” Joe argued.\u003c/p\u003e\n\u003cp\u003eRaif started swearing, and Joe moved the phone away from his ear.\u003c/p\u003e\n\u003cp\u003eFinally Raif said, “I’ll see what I can do.” He started swearing again, so Joe thanked him and hung up.\u003c/p\u003e\n\u003cp\u003eWhen Joe returned to the table, their food had arrived. He glanced at his watch and ate quickly, and then they were back on the road.\u003c/p\u003e\n\u003cp\u003eWhen they reached Richmond just before two, they checked into a bed-and-breakfast Adam had arranged for them. Then Joe and Brent headed back out on the road for the police station and an appointment with Nancy Morton, the widow of the man who had been found strangled in his own wine cellar. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-40.html","bookId":2272,"creation":"Oct 5, 2019 5:32:04 PM","modification":"Oct 5, 2019 5:32:04 PM"}
