{"id":88982,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“William, right before he died,” she said.\u003c/p\u003e\n\u003cp\u003eA few minutes later they thanked her for her time, and she asked them to notify her if they found out anything, or if she could do anything else for them.\u003c/p\u003e\n\u003cp\u003eAs they drove away, Joe looked back at the house. He hadn’t felt anything, hadn’t seen or heard anything out of the ordinary. He looked at Brent and asked softly, “Well?”\u003c/p\u003e\n\u003cp\u003eBrent shook his head. “I’ve got nothing, except…you think his killer stole some of his files?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Will that help us any?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eBrent was silent a moment. “Did you see anything?”\u003c/p\u003e\n\u003cp\u003e“Only in my mind’s eye. A man, dead next to his favorite merlot. Poe, in a way, but badly.”\u003c/p\u003e\n\u003cp\u003e“How’s that?” Brent asked.\u003c/p\u003e\n\u003cp\u003e“He was behind a brick wall, but he hadn’t been bricked in, much less bricked in alive.”\u003c/p\u003e\n\u003cp\u003e“His killer wanted to be sure he was dead and to get away with murder.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Joe said darkly. “And so far, he has.”\u003c/p\u003e\n\u003cp\u003eThere was an old stone bench next to William Morton’s family mausoleum. The Federal-style tomb held the mortal remains of the family from eighteen-fifty-five onward, the latest burial being William’s.\u003c/p\u003e\n\u003cp\u003eHis wife’s name, with her date of birth and a blank expanse of marble where her date of death would one day be etched, was next to his.\u003c/p\u003e\n\u003cp\u003eGenevieve and Nikki sat on the bench together, and Gen tried to decide whether the world that had opened up to her was terrible or intriguing.\u003c/p\u003e\n\u003cp\u003eThey were alone, yet the cemetery was crowded.\u003c/p\u003e\n\u003cp\u003eA child in knickers went running by, chasing a ball. A woman with a bustle went racing after him, calling out distractedly, Ethan Taylor, you come back here right now! She offered Genevieve and Nikki an apologetic smile as she passed.\u003c/p\u003e\n\u003cp\u003eShe wasn’t real, of course, and neither was her son.\u003c/p\u003e\n\u003cp\u003eAfter a while, Gen felt the softness of a breeze and looked toward the monument. A pleasant-looking man of sixtysomething was standing by the iron-gated doorway. He was wearing a suit and could have been out for a pleasant stroll in the historic cemetery, pausing momentarily to catch his breath.\u003c/p\u003e\n\u003cp\u003eExcept that he wasn’t going to catch his breath again. Ever.\u003c/p\u003e\n\u003cp\u003e“So sad,” he said, looking at Genevieve.\u003c/p\u003e\n\u003cp\u003eShe forced herself to speak. “Mr. Morton?”\u003c/p\u003e\n\u003cp\u003e“William,” he said, smiling crookedly. “Not Will or Bill, much less Willie or Billy. I was always William. Don’t know why.”\u003c/p\u003e\n\u003cp\u003eShe stood slowly, her hands clenched into fists at her sides. Nikki stood up with her, so at least she wasn’t alone, but whether Nikki saw him or not, she didn’t know.\u003c/p\u003e\n\u003cp\u003eHe slammed a fist against the tomb, and Gen almost jumped back. But she realized he wasn’t angry with her when he said emphatically, “I want to help.”\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. “You were murdered.”\u003c/p\u003e\n\u003cp\u003e“I know that,” he said\u003c/p\u003e\n\u003cp\u003e“Who did it?” she asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You have to know!”\u003c/p\u003e\n\u003cp\u003e“Young lady, don’t you think I would tell you the name of my killer if I knew it?”\u003c/p\u003e\n\u003cp\u003e“But…you must have let him into your house.”\u003c/p\u003e\n\u003cp\u003eHe crossed his arms over his chest and stared at her as if daring her to dispute his next words. “All right. Poe.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Edgar Allan Poe.”\u003c/p\u003e\n\u003cp\u003eApparently Nikki did see him, because she said, “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“We were getting ready for Poe Fest,” he said. “When the doorbell rang, I assumed it was Beau Headley. He was supposed to come by so we could discuss the lectures we’d be giving that Saturday night. I was busy, just finishing up on the computer, so I wasn’t paying a great deal of attention when I opened the door. I said something like, ‘Gee, Beau, great costume, let me just run down and turn off the computer.’ But whoever it was followed me. I didn’t realize it…until I was being throttled. I fought back, though. I gouged him pretty good on his chest.”\u003c/p\u003e\n\u003cp\u003e“But his face,” Genevieve protested. “Can’t you at least describe his face?”\u003c/p\u003e\n\u003cp\u003e“He had on false whiskers and a wig. And his eyes were brown and the pupils seemed too big, so I’m thinking he had on some kind of contact lenses.”\u003c/p\u003e\n\u003cp\u003e“Are you at least sure it was a man?” Nikki asked.\u003c/p\u003e\n\u003cp\u003e“Yes. I think so.”\u003c/p\u003e\n\u003cp\u003e“You think so,” Genevieve said. She was amazed at how frustrated she was feeling. Last night she had been terrified by the very concept of ghosts, and today she was angry with one.\u003c/p\u003e\n\u003cp\u003e“We think he’s killing other people, so if you can come up with anything else, it would really help,” she said.\u003c/p\u003e\n\u003cp\u003eHe was thoughtful, leaning against the tomb. He rubbed his chin. “You see me pretty well, right?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” both women said together.\u003c/p\u003e\n\u003cp\u003e“I can’t quite get the hang of getting out of here,” he said. “The cemetery, I mean.”\u003c/p\u003e\n\u003cp\u003e“We can’t really help you there,” Nikki said. “I’m so sorry. From what I understand…you just keep trying. Others here may be able to help you.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “Tell me, please…how is my wife? Do you know?”\u003c/p\u003e\n\u003cp\u003eNikki glanced at Genevieve, then turned back to the ghost. “My husband is seeing her this afternoon,” she said. “I believe she’s doing well, though I’m certain she misses you.”\u003c/p\u003e\n\u003cp\u003e“If you can, will you let her know that I love her?” he asked.\u003c/p\u003e\n\u003cp\u003e“Of course,” Genevieve said.\u003c/p\u003e\n\u003cp\u003e“I’m sure she knows,” Nikki told him softly.\u003c/p\u003e\n\u003cp\u003e“Is there anything else you can tell us that might help to solve your murder?” Genevieve asked.\u003c/p\u003e\n\u003cp\u003e“Do you think I’ll be able to go then?” he asked wistfully, then shook his head. “I don’t think so. I think…I think I’m waiting for Nancy. We did everything together. I can’t take a major journey without her.”\u003c/p\u003e\n\u003cp\u003eThey both just looked at him, not knowing what to say.\u003c/p\u003e\n\u003cp\u003eAnd then William Morton was gone. He faded away, and then, there was nothing where he’d been but the air.\u003c/p\u003e\n\u003cp\u003eThey all met up back at the bed-and-breakfast just before seven. Adam had been busy on the computer all afternoon, and he had information.\u003c/p\u003e\n\u003cp\u003e“Thorne Bigelow and his family were here when William Morton was killed. They had come to attend a series of lectures at something called Poe Fest. They got here the day before he was killed and didn’t leave until five days after.”\u003c/p\u003e\n\u003cp\u003eHe produced several pictures he had found online and printed out. “These were taken during the festivities.”\u003c/p\u003e\n\u003cp\u003eOne shot was of a man giving a lecture, and he was dressed like Poe.\u003c/p\u003e\n\u003cp\u003eAnother was of a group at what appeared to be a garden tea party. The women wore period gowns, and several of the men were dressed like Poe.\u003c/p\u003e\n\u003cp\u003e“Kind of like trying to find a clown at a circus,” Nikki said.\u003c/p\u003e\n\u003cp\u003e“It had to be Jared,” Joe said. “Because Thorne is dead, and Mary Vincenzo couldn’t have carried it off—not alone, anyway. What we need now is proof.”\u003c/p\u003e\n\u003cp\u003e“We’re looking at a dozen would-be Poes here,” Brent said.\u003c/p\u003e\n\u003cp\u003e“Would-be Poes? What does that have to do with it?” Joe asked.\u003c/p\u003e\n\u003cp\u003eGen cleared her throat. “The killer dresses up like Poe.”\u003c/p\u003e\n\u003cp\u003e“And how do you know that?” Joe demanded. He seemed tense. “How do you know?”\u003c/p\u003e\n\u003cp\u003eGenevieve braced herself, lifted her chin and met his eyes squarely. “William Morton told us. This afternoon, at the cemetery. And…” she paused, wincing “…Leslie and Matt talked to Lori, and she said the same thing, that her killer was dressed up like Poe.”\u003c/p\u003e\n\u003cp\u003eJoe rose. She was sure he was about to tell them that they were all crazy, but he didn’t. He just ran his fingers through his hair and asked, “Do you know what would happen if I were to call Raif Green and tell him that a ghost told me we’re looking for a killer who dresses up like Edgar Allan Poe?” he asked.\u003c/p\u003e\n\u003cp\u003e“There might be another way to make the suggestion,” Adam said.\u003c/p\u003e\n\u003cp\u003eBrent leaned forward. “Joe, we all know that the rest of the world doesn’t see what we do. But you learn not to talk about what’s obvious to you to other people. You go around it. You call the cops, and you leave an anonymous tip that someone might have dressed up like Poe to kill Lori. Then someone starts checking the costume shops.”\u003c/p\u003e\n\u003cp\u003eAdam leaned back and sighed thoughtfully. “Trouble is, even if we can prove that Jared Bigelow rented a Poe costume, we still can’t prove that he wore it to kill anyone.”\u003c/p\u003e\n\u003cp\u003eJoe sat down again. “We have to come up with enough evidence for Raif to go to the D.A.’s office with at least a strong circumstantial case.”\u003c/p\u003e\n\u003cp\u003e“Let’s see what happens tomorrow,” Nikki advised. “In Baltimore.”\u003c/p\u003e\n\u003cp\u003e“For now, I think dinner’s in order,” Brent said. “I don’t know about you guys, but I haven’t eaten since breakfast.”\u003c/p\u003e\n\u003cp\u003eThey picked an Italian restaurant, on their innkeeper’s recommendation, and headed out. As they drove down Monument Avenue, Genevieve looked out at the statues that gave it its name, then gasped suddenly. “Stop!” she cried.\u003c/p\u003e\n\u003cp\u003eJoe pulled off to the side of the road so quickly that the driver behind him blasted his horn as he passed by.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I just…do you mind if I hop out for a minute?”\u003c/p\u003e\n\u003cp\u003eJoe lifted his hands and let them fall, at last staring at her as if she were crazy.\u003c/p\u003e\n\u003cp\u003eShe climbed out of the car, aware that Nikki was following her as she walked across the street to stare up at the equestrian statue that had caught her attention so dramatically. Then she read the plaque at the bottom, identifying it as General James Ewell Brown Stuart, C.S.A.\u003c/p\u003e\n\u003cp\u003e“It’s him,” Genevieve breathed.\u003c/p\u003e\n\u003cp\u003e“Who?” Even Nikki sounded worried.\u003c/p\u003e\n\u003cp\u003e“I saw him. I saw him today at the cemetery. He spoke with Jefferson Davis and his wife. He tipped his hat to me.”\u003c/p\u003e\n\u003cp\u003eThere was no denying it now, she thought as they walked back to the car. She really was seeing ghosts. She might have made up William Morton or somehow been influenced by Nikki’s proximity, but there was no denying that she’d seen General Stuart. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-43.html","bookId":2272,"creation":"Oct 5, 2019 5:32:04 PM","modification":"Oct 5, 2019 5:32:04 PM"}
