{"id":88987,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“But someone else died that night. You killed an innocent man,” Genevieve told him. “A stranger who might not even have known the name Poe.”\u003c/p\u003e\n\u003cp\u003eBarbara gave that awful giggle again. “If he didn’t know Poe’s name, he definitely deserved to die,” she said.\u003c/p\u003e\n\u003cp\u003e“And that Lori Star…Well, I took care of her,” Bennet said. “She was so easy. So desperate for fame and fortune. I rented the boat before I donned my costume, of course. I knocked her out first, then killed her on land. It ended up being a lovely recreation, don’t you think?”\u003c/p\u003e\n\u003cp\u003eGenevieve’s skin felt as if it were crawling with a thousand bugs. “Wait a minute,” she said to Barbara. “You’re supposed to be at O’Malley’s. You called and asked me to go with you and Lou. Do you really think people won’t notice that you left?”\u003c/p\u003e\n\u003cp\u003e“Are you really as stupid as you seem?” Barbara asked. “I conveniently developed a headache and decided to stay home.” She turned to her partner in crime. “Albee, get busy,” she urged.\u003c/p\u003e\n\u003cp\u003e“Wait,” Genevieve said quickly.\u003c/p\u003e\n\u003cp\u003e“What is it?” Bennet asked impatiently.\u003c/p\u003e\n\u003cp\u003e“What about the other men?” she asked.\u003c/p\u003e\n\u003cp\u003e“That fellow in Richmond?” he asked, annoyed.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Don’t you see? It was the same thing! His research was faulty. He knew nothing. Everything he used in that book of his came from me. And did he so much as offer me an acknowledgment? He did not.”\u003c/p\u003e\n\u003cp\u003e“They’ll get you, you know,” Genevieve said. “Sooner or later, they’ll figure it out.”\u003c/p\u003e\n\u003cp\u003eBarbara burst out laughing. “I’ll swear Bennet was with me that Sunday morning, if anyone asks. And your dear friend Joe can vouch for his Sunday afternoon—you two came to visit.”\u003c/p\u003e\n\u003cp\u003e“So you managed everything on Sunday morning,” Genevieve said, looking at Bennet. “Impressive.”\u003c/p\u003e\n\u003cp\u003e“I helped,” Barbara said proudly. “I was ready with the car over in Jersey. Even that road will lead back to Jared, though. We rented the boat with one of Jared’s credit cards. The Bigelows were always a bit careless. Too much money! They had so much, they never noticed little things like missing credit cards. But enough is enough. I think it’s past time for you to be dead. Albee, get going,” Barbara said shrilly.\u003c/p\u003e\n\u003cp\u003e“Someone’s here,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eThey both started.\u003c/p\u003e\n\u003cp\u003e“She’s lying. She’s trying to slow us down,” Barbara said.\u003c/p\u003e\n\u003cp\u003e“It won’t make any difference, dear,” Bennet said.\u003c/p\u003e\n\u003cp\u003e“It could be Thorne Bigelow.”\u003c/p\u003e\n\u003cp\u003eThey both froze, staring at her.\u003c/p\u003e\n\u003cp\u003eShe smiled sweetly. “Ghosts do come back,” she warned.\u003c/p\u003e\n\u003cp\u003e“You’re crazy. But if it makes you happy, feel free to come back as a ghost,” Barbara said.\u003c/p\u003e\n\u003cp\u003eAlbee started to slather on mortar so he could lay another brick, but suddenly he went still. “What’s that?” he demanded, poised to listen.\u003c/p\u003e\n\u003cp\u003e“What?” Barbara asked.\u003c/p\u003e\n\u003cp\u003e“There’s someone upstairs.”\u003c/p\u003e\n\u003cp\u003e“There can’t be. The alarm is on, and the door is locked,” Barbara said. “Stop paying attention to her. She’s playing games, trying to make us think Thorne’s coming back to haunt us. She’s just trying to buy herself time.”\u003c/p\u003e\n\u003cp\u003e“I’m telling you the truth,” Genevieve said. She managed to twist around a bit, and relieve some of the strain on her arms, but she couldn’t help breathing in all the dust Albee’s masonry was stirring up, and it was making her light-headed. She knew from the conversation that she had to be in Thorne Bigelow’s basement, but it clearly hadn’t been thoroughly cleaned in years.\u003c/p\u003e\n\u003cp\u003eAnd apparently they had built this special little niche just for her. When they were finished, no one would know there was anything behind it.\u003c/p\u003e\n\u003cp\u003eOh, God. She had to keep them talking or she would panic.\u003c/p\u003e\n\u003cp\u003eDid it matter now whether she panicked or not?\u003c/p\u003e\n\u003cp\u003e“Albee, this is wrong,” Barbara said, suddenly irritated.\u003c/p\u003e\n\u003cp\u003e“What is?”\u003c/p\u003e\n\u003cp\u003e“She’s supposed to be begging and pleading and crying and all that,” Barbara said peevishly.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. Are my questions messing up your scenario?” Genevieve demanded. “You’re so smug, but actually, you’ve messed up all your murders.”\u003c/p\u003e\n\u003cp\u003e“What the hell is that noise?” Bennet demanded, stopping.\u003c/p\u003e\n\u003cp\u003e“Oh, shut up, and finish!” Barbara demanded. “You’ve only got five bricks to go.”\u003c/p\u003e\n\u003cp\u003eAnother brick slid into place.\u003c/p\u003e\n\u003cp\u003eGenevieve knew she had to keep him talking. Keep those last bricks out.\u003c/p\u003e\n\u003cp\u003eSomeone would come. She knew that. Eventually, someone would come. But when? Long after her oxygen was gone…?\u003c/p\u003e\n\u003cp\u003e“Albee, I hear something, too,” Barbara said suddenly. “And…”\u003c/p\u003e\n\u003cp\u003eBarbara’s voice trailed off as she stared past him, and Genevieve strained to look in that direction, too.\u003c/p\u003e\n\u003cp\u003eThere was someone in the room with them.\u003c/p\u003e\n\u003cp\u003eSomeone, or…\u003c/p\u003e\n\u003cp\u003eSomething.\u003c/p\u003e\n\u003cp\u003eShe could make out a transparent, vaguely formed image of a person, and her heart leapt.\u003c/p\u003e\n\u003cp\u003eLeslie MacIntyre. And beyond Leslie…\u003c/p\u003e\n\u003cp\u003eLori Star.\u003c/p\u003e\n\u003cp\u003eLeslie was trying hard to knock over the small pile of bricks that remained. Lori was staring at Bennet and tried to strike him, but her fist went right though him. He felt something, though, because he muttered fearfully, “What the hell?”\u003c/p\u003e\n\u003cp\u003e“It’s Lori,” Genevieve said.\u003c/p\u003e\n\u003cp\u003eHe paused, staring at her. “What?”\u003c/p\u003e\n\u003cp\u003e“Lori’s ghost is in here with us right now. I’m not lying. She’s with a friend of mine, Leslie MacIntyre. You’ve heard of Leslie, of course. She saved my life before.”\u003c/p\u003e\n\u003cp\u003e“She’s full of shit, Albee!” Barbara cried.\u003c/p\u003e\n\u003cp\u003eGenevieve shook her head. “No, I’m telling you the truth. They’re both here.”\u003c/p\u003e\n\u003cp\u003e“Shut her up! Put that last brick in,” Barbara demanded. “Do it!”\u003c/p\u003e\n\u003cp\u003e“Barbara, there’s something…I can feel it,” Bennet insisted.\u003c/p\u003e\n\u003cp\u003eCould he really feel it? Perhaps. Because they were both very real, and they were doing their best to help her.\u003c/p\u003e\n\u003cp\u003eBarbara still looked unnerved, but she shouted at him, “Put that brick in, you fool!”\u003c/p\u003e\n\u003cp\u003eThen, miraculously, there was another voice.\u003c/p\u003e\n\u003cp\u003eA real voice. Hard, loud, firm.\u003c/p\u003e\n\u003cp\u003e“Put that brick in and I’ll shoot you right in the head!”\u003c/p\u003e\n\u003cp\u003eGenevieve’s muscles gave, and she sagged against the wall.\u003c/p\u003e\n\u003cp\u003eJoe!\u003c/p\u003e\n\u003cp\u003eHow had he known to come here?\u003c/p\u003e\n\u003cp\u003e“The switch!” Barbara yelled.\u003c/p\u003e\n\u003cp\u003e“No!” Joe shouted out.\u003c/p\u003e\n\u003cp\u003eBut Barbara made a leap for the wall, and the single light in the basement went out just as a bullet exploded in the night, followed by the thuds and grunts of hand-to-hand combat.\u003c/p\u003e\n\u003cp\u003eGenevieve was powerless to help in any way. She wrenched desperately at her chains and with the help of a surge of adrenaline, freed one hand. She pressed at the bricks, trying to topple the wall of her makeshift prison, but they wouldn’t give.\u003c/p\u003e\n\u003cp\u003eAnd then the light went back on.\u003c/p\u003e\n\u003cp\u003eWith her limited field of vision, she could see Joe and Albee rolling across the floor, locked in a deadly struggle for life or death.\u003c/p\u003e\n\u003cp\u003eGenevieve stretched out as far as she could, found a brick and threw it.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eBarbara screamed and crashed to her knees.\u003c/p\u003e\n\u003cp\u003eGen heard a sickening thud, and Albee screamed. He rose above Joe for a minute, then jumped back down on Joe in what looked like a wrestler’s savage slam, but with one key difference.\u003c/p\u003e\n\u003cp\u003eAlbee Bennet was dead from a bullet to the heart.\u003c/p\u003e\n\u003cp\u003e“Joe!” Genevieve gasped.\u003c/p\u003e\n\u003cp\u003e“I’m all right. He’s just…heavy.”\u003c/p\u003e\n\u003cp\u003eHe shoved the body off, and as he staggered to his feet, she could see that he was torn and bleeding. And then, in the distance, she heard the blessed sound of sirens.\u003c/p\u003e\n\u003cp\u003eJoe tore down the wall Albee had built, then jerked the second chain from the wall, lifted her and held her close.\u003c/p\u003e\n\u003cp\u003eHe didn’t pull away until a dozen policemen hurried down to the basement. Even then, he didn’t go far.\u003c/p\u003e\n\u003cp\u003e“How did you find me?” she whispered.\u003c/p\u003e\n\u003cp\u003eHe looked into her eyes. Offered her a crooked grin. “‘The Tell-Tale Heart’?” he suggested. “My heart is your heart, so I heard it from a distance?” His smile faded. “Matt told me,” he said. “Matt brought me to you.”\u003c/p\u003e\n\u003cp\u003eShe leaned against him. “Leslie and Lori were here,” she told him, then smiled. Dirty and disheveled, he smiled in return.\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eAs I said, it’s not easy being a ghost.\u003c/p\u003e\n\u003cp\u003eBut it does get better.\u003c/p\u003e\n\u003cp\u003eThe why of it, though, is something I’m just beginning to understand.\u003c/p\u003e\n\u003cp\u003eOne of the reasons we stayed behind, Matt and I—one I see so clearly now—was so we could help uncover the Poe Killer—or Killers, as it turned out. Joe put the last pieces together when he remembered how hard Albee Bennet had clapped when Barbara Hirshorn had given her reading at Thorne Bigelow’s funeral, a hint that that the man evidently had a crush on her. What he hadn’t realized at the time was just how mutual and serious those feelings were, or how far they would go on each other’s behalf.\u003c/p\u003e\n\u003cp\u003eThe couple that kills together stays together?\u003c/p\u003e\n\u003cp\u003eThey’re not together now, though I suppose they may be in the future. I was there when Albee Bennet left this world, and, I assure you, he didn’t go anywhere pleasant, with soft white clouds and harp music floating on a gentle breeze. Something came for him, something swift and oozing that reeked of brimstone and charred flesh.\u003c/p\u003e\n\u003cp\u003eBarbara Hirshorn, on the other hand, did not die that night. She’s locked up now, and I expect she will be for quite some time.\u003c/p\u003e\n\u003cp\u003eAs for Lori, though she did extremely well during her first outing as a ghost, she chose to leave us. That light is hard to resist. I hope she’s finally gotten star billing. She deserves it.\u003c/p\u003e\n\u003cp\u003eSam Latham made a full recovery and went home.\u003c/p\u003e\n\u003cp\u003eSorting out some of the other details proved a more complex task. Apparently Barbara took a few days off from the library now and then, days that coincided with the Bigelows’ travel schedule. It was easy enough for her to slip away to be with her secret lover. And for all that she adored and admired him, she would never have admitted to the affair, too afraid of what her fellow board members would say. A librarian was one thing. A librarian involved with a butler? She was certain she would have been ousted. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-death-dealer-harrison-investigation-6/page-48.html","bookId":2272,"creation":"Oct 5, 2019 5:32:04 PM","modification":"Oct 5, 2019 5:32:04 PM"}
