{"id":85672,"no":32,"title":"Page 32","content":"\u003cp\u003e“We have to stop,” I said with bated breath.\u003c/p\u003e\n\u003cp\u003e“I know,” she whispered.\u003c/p\u003e\n\u003cp\u003eI sighed as I moved away from her and she looked at me. “I’m sorry,” she said.\u003c/p\u003e\n\u003cp\u003e“Don’t apologize. You have nothing to be sorry for. I’ll wait for you for as long as it takes.”\u003c/p\u003e\n\u003cp\u003e“It’s not that I don’t want to have sex with you, Collin. I do. But I just feel like it’s not the right time.”\u003c/p\u003e\n\u003cp\u003eI slightly smiled at her and placed my hands on each side of her face. “We’ll both know when the right time comes and it will be amazing.”\u003c/p\u003e\n\u003cp\u003e“I have no doubt that it will be amazing. Just being with you makes me feel like that.”\u003c/p\u003e\n\u003cp\u003eI placed my forehead on hers and we kissed one last time before heading to the penthouse.\u003c/p\u003e\n\u003cp\u003eWe stepped off the elevator and my mom came walking down the stairs with a smile.\u003c/p\u003e\n\u003cp\u003e“Hi, Amelia. Welcome to our penthouse.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Ellery.”\u003c/p\u003e\n\u003cp\u003e“Mom. She’s been here before.”\u003c/p\u003e\n\u003cp\u003e“I know that, Collin. But she’s never stayed the night,” she said as she shot me a look and grabbed Amelia’s bag from me. “I’ll show her where the guest room is and you go talk to your dad. He’s in the living room.”\u003c/p\u003e\n\u003cp\u003eAmelia looked at me and smiled as she followed my mom upstairs. I walked into the living room. My dad was sitting on the couch with his laptop.\u003c/p\u003e\n\u003cp\u003e“Hi, son. How was your evening?”\u003c/p\u003e\n\u003cp\u003e“It was good, Dad.”\u003c/p\u003e\n\u003cp\u003e“How are things going with you and Amelia?”\u003c/p\u003e\n\u003cp\u003e“Things are good. I really like her.” I smiled.\u003c/p\u003e\n\u003cp\u003e“I think you should know that Hailey flew back to New York today.”\u003c/p\u003e\n\u003cp\u003e“The last time I talked to her, she told me she was. We sort of got disconnected when she asked if I was happy that she was coming back.”\u003c/p\u003e\n\u003cp\u003e“Ah.” He smiled. “I’ve pulled that a few times myself. It’s so unfortunate when that happens.”\u003c/p\u003e\n\u003cp\u003e“Right? I learned from the best.” I smiled at him.\u003c/p\u003e\n\u003cp\u003eJust as he was about to say something else about Hailey, my mom and Amelia walked into the room.\u003c/p\u003e\n\u003cp\u003e“What are you two talking about?” my mom asked.\u003c/p\u003e\n\u003cp\u003e“Just going over a few business things,” my dad replied.\u003c/p\u003e\n\u003cp\u003eI got up and led Amelia to the kitchen. “Are you hungry? Can I get you anything?”\u003c/p\u003e\n\u003cp\u003e“I’m fine, Collin.” She smiled as she wrapped her arms around me. “Your mom is amazing. She told me that if I ever needed to talk about anything, to come to her. She’s such a warm and caring person.”\u003c/p\u003e\n\u003cp\u003e“Yeah, she is. She had a really rough childhood and both her parents died when she was young. She’s been through a lot, so she understands,” I said as I tucked her hair behind her ear and softly kissed her lips.\u003c/p\u003e\n\u003cp\u003e“It’s getting late and we need to be up early in the morning. Maybe we should head upstairs,” she said.\u003c/p\u003e\n\u003cp\u003eI led her upstairs and kissed her goodnight. I walked across the hall and back to my room. I got undressed, put on my black pajama bottoms, and headed to the bathroom to brush my teeth. The door was closed, so I knocked.\u003c/p\u003e\n\u003cp\u003e“Amelia, are you in there?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I was going to brush my teeth,” she said as she opened the door.\u003c/p\u003e\n\u003cp\u003e“Me too. May I join you?” I smiled.\u003c/p\u003e\n\u003cp\u003e“It’s your bathroom, silly.” She laughed. “Come on in.”\u003c/p\u003e\n\u003cp\u003eI grabbed my toothbrush and stood in front of the sink next to her. I could see her eyeing me up and down as I was trying to avoid looking at how sexy she looked in her little shorts and tank top. I could feel myself starting to get hard. Oh God, not now. Once I was finished brushing, I rinsed off my toothbrush and put it away. I turned and looked at her as she brushed her beautiful blonde hair.\u003c/p\u003e\n\u003cp\u003e“Okay, goodnight,” I said as I tried to get out of there as fast as I could.\u003c/p\u003e\n\u003cp\u003e“Wait,” she said.\u003c/p\u003e\n\u003cp\u003eI turned around and looked at her. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I’m thinking that maybe you should give me one more kiss goodnight.”\u003c/p\u003e\n\u003cp\u003eI stared at her with a small smile as I placed my hands on her hips. “Your wish is my command,” I said as I leaned in closer and kissed her.\u003c/p\u003e\n\u003cp\u003eShe brought up her hands to my bare chest and softly stroked it as our lips enjoyed each other. It was torture as far as I was concerned because I wanted to be inside her so badly. I broke our soft kiss and we stared into each other’s eyes as I lifted her up and sat her on the counter. She took my hand and placed it underneath her tank top, up to her bare breast. I softly caressed her breast as I took her erect nipple between my fingers. She let out a soft moan and I immediately removed my hand.\u003c/p\u003e\n\u003cp\u003e“You’re killing me, Amelia.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I just—”\u003c/p\u003e\n\u003cp\u003e“I know,” I said as I took her face in my hands and kissed her lips. “Not here. Not in my bathroom, and certainly not in my house with my parents down the hall. Wrap your legs around me.” I smiled.\u003c/p\u003e\n\u003cp\u003eShe did as I asked and I lifted her from the counter and carried to her bed. I laid her down and kissed her forehead. “Get some sleep,” I said. As I got up from the bed, she grabbed my hand. I turned around and looked at her.\u003c/p\u003e\n\u003cp\u003e“When I’m with you, I forget about everything bad that’s happened in my life.”\u003c/p\u003e\n\u003cp\u003e“Me too.” I smiled.\u003c/p\u003e\n\u003cp\u003e“Good night, Collin.”\u003c/p\u003e\n\u003cp\u003e“Good night, Amelia.”\u003c/p\u003e\n\u003cp\u003eI walked back to my room and climbed into bed. I couldn’t stop thinking about her and how, if I wouldn’t have stopped it, we could’ve had sex for the first time in my bathroom, with my parents down the hall. I couldn’t let that happen. With Amelia, things were different as far as sex was concerned. She wasn’t going to be a fly-by-night, wham-bam, thank-you-ma’am type of fuck. I was going to make sure that it would be magical and something she’d never forget. She deserved that and much more. I closed my eyes with the image of me making love to her in my mind and suddenly, I was awoken by her softly calling my name.\u003c/p\u003e\n\u003cp\u003e“Collin, are you awake?”\u003c/p\u003e\n\u003cp\u003eI opened my eyes and all I saw was her silhouette standing next to my bed. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I had a nightmare about the accident,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Come here,” I said as I patted the other side of the bed and rolled over.\u003c/p\u003e\n\u003cp\u003eShe climbed under the covers and into my arms. Her face was wet with tears and she was shaking. “Shh. You’re okay. I’m here,” I said as I kissed her head. I lay there with her, sheltering her from the nightmare that brought her into my arms. \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-32.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
