{"id":85645,"no":4,"title":"Page 4","content":"\u003cp\u003e“Maybe you can give me a call when you come back to New York,” she said innocently.\u003c/p\u003e\n\u003cp\u003e“I think I will.” I nodded as I stared at her and started to walk away.\u003c/p\u003e\n\u003cp\u003eI checked my ticket and what the fuck! I’m flying economy class! Are you fucking kidding me?\u003c/p\u003e\n\u003cp\u003eAs I headed to my gate, I pulled my phone from my pocket and noticed there was a text message from my dad.\u003c/p\u003e\n\u003cp\u003e“I forgot to tell you that first class and business class were all booked up. Enjoy your flight in economy, son.”\u003c/p\u003e\n\u003cp\u003eI wasn’t even going to respond because he did it on purpose. Jesus, he was really making me pay. I arrived at my gate and walked up to the counter. I flashed my smile and asked the girl if there was any way to upgrade to first class. She looked at her computer and shook her head.\u003c/p\u003e\n\u003cp\u003e“No, I’m sorry, but first class is full and so is business class. You made it just in time. We’re starting to board.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes and sighed as I picked up my bag from the floor and stood in the long line with the rest of the people waiting to board the plane. I was getting so drunk tonight. I wondered if Ellie was going to be around. I found my seat and squeezed in. At least it was a window seat. This was total bullshit that I had to fly like this. Maybe I’d get lucky and some hot chick would be in the seat next to me. WRONG. It was some snot nose kid who sounded like he was going to hack up a lung.\u003c/p\u003e\n\u003cp\u003e“Hey, can you cover your mouth when you cough?”\u003c/p\u003e\n\u003cp\u003eHe looked at me with knitted eyebrows. “Can you mind your own business, fucktard?”\u003c/p\u003e\n\u003cp\u003e“Where’s your mom, kid?” I asked with irritation.\u003c/p\u003e\n\u003cp\u003e“I don’t know. Some seat way in the back.”\u003c/p\u003e\n\u003cp\u003eHe put his headphones in and blasted the music on his iPod. It was so loud, I could hear the rap over the roaring engines of the plane. I shook my head and looked out the window. When it was safe to use our phones, I pulled mine from my pocket and scrolled through my pictures. There was one I didn’t delete of Hailey. It was my favorite picture of her and I just couldn’t get rid of it.\u003c/p\u003e\n\u003cp\u003e“Who’s that? Your girlfriend?” the kid asked.\u003c/p\u003e\n\u003cp\u003eI glared over at him. “Why don’t you mind your own business?”\u003c/p\u003e\n\u003cp\u003e“Prick,” he said as he looked at his iPod.\u003c/p\u003e\n\u003cp\u003eI turned my phone to camera status and held it up. “Hey, kid, smile.”\u003c/p\u003e\n\u003cp\u003eAs soon as the kid turned his head, I snapped his picture.\u003c/p\u003e\n\u003cp\u003e“What the hell, dude,” he said and then started coughing.\u003c/p\u003e\n\u003cp\u003e“Just a memory of my flight.” I smiled.\u003c/p\u003e\n\u003cp\u003e“Fucker,” he mumbled.\u003c/p\u003e\n\u003cp\u003eI sent his picture to Julia with a text message.\u003c/p\u003e\n\u003cp\u003e“Dad made me fly commercial and this is who I’m stuck with.”\u003c/p\u003e\n\u003cp\u003e“OMG! That’s hilarious. Be nice to the kid. Remember, you’re going to be an uncle. I’m surprised that kid is in first class.”\u003c/p\u003e\n\u003cp\u003e“He’s not. I’m in economy because first and business class were sold out. Fuck this.”\u003c/p\u003e\n\u003cp\u003e“LOL at dad.”\u003c/p\u003e\n\u003cp\u003e“Haha. I’m glad you find it funny.”\u003c/p\u003e\n\u003cp\u003e“Sorry. Have a safe flight. Love you.”\u003c/p\u003e\n\u003cp\u003e“Love you too, sis.”\u003c/p\u003e\n\u003cp\u003eI looked over at the kid, who was coughing. “Are you sick or something?” I asked with sincerity.\u003c/p\u003e\n\u003cp\u003eHe turned his head and looked at me. “Yeah, I have cystic fibrosis.”\u003c/p\u003e\n\u003cp\u003eI knew what that was because I had to do a power point presentation on it in health class in college. “Dude, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I don’t want your pity,” he said.\u003c/p\u003e\n\u003cp\u003e“My name is Collin and I don’t give pity.” I smiled as I held out my hand.\u003c/p\u003e\n\u003cp\u003eHe twisted his face and looked at my hand. He slowly brought his hand to mine. “I’m Jacob Kline.”\u003c/p\u003e\n\u003cp\u003e“Nice to meet you, Jacob Kline.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he said sadly.\u003c/p\u003e\n\u003cp\u003eNow I felt sorry for this kid. I understood his rough and tough exterior. It was to hide the sadness he was feeling inside.\u003c/p\u003e\n\u003cp\u003e“So, why are you going to Chicago?”\u003c/p\u003e\n\u003cp\u003e“To see another specialist,” he replied.\u003c/p\u003e\n\u003cp\u003e“How old are you?”\u003c/p\u003e\n\u003cp\u003e“Twelve.”\u003c/p\u003e\n\u003cp\u003eI turned my head and looked out the window. I felt bad for this kid and I couldn’t believe his mom wasn’t sitting by him. What the hell kind of parent is she?\u003c/p\u003e\n\u003cp\u003e“I can switch seats with your mom if you want her to sit here,” I said.\u003c/p\u003e\n\u003cp\u003e“Nah. You’re cool.” He smiled.\u003c/p\u003e\n\u003cp\u003eFor the duration of the flight, Jacob and I talked about a lot of things. I told him about Hailey and he told me all about his disease. He said he didn’t have any friends because the other kids were scared of what he had. When the plane landed, I sat in my seat until Jacob’s mom came over to get him.\u003c/p\u003e\n\u003cp\u003e“Hey, Mom. This is Collin. He’s my new friend.” He smiled.\u003c/p\u003e\n\u003cp\u003e“Nice to meet you, Collin. I’m Diana.” She smiled.\u003c/p\u003e\n\u003cp\u003eShe was an older woman and she looked tired. As we walked off the plane together, I reached in my pocket and pulled out a twenty-dollar-bill and handed it to Jacob.\u003c/p\u003e\n\u003cp\u003e“Here, go buy yourself a souvenir from Chicago.” I winked.\u003c/p\u003e\n\u003cp\u003e“Wow! Thanks!” he exclaimed.\u003c/p\u003e\n\u003cp\u003e“That’s very nice of you, Collin, but Jacob can’t accept that.”\u003c/p\u003e\n\u003cp\u003e“Sure he can. Please, just let him have it.”\u003c/p\u003e\n\u003cp\u003e“Thank you. You’re a very kind man.”\u003c/p\u003e\n\u003cp\u003eJacob and I high-fived, and I waved goodbye to him and Diana. As I got into my car that I arranged to have pick me up, I noticed Jacob and Diana standing around. Jacob had told me on the plane that he and his mom had no money because she had just lost her job and she was spending what little savings she had on this trip for him. I told the driver to hold on and I got out of the car. I walked over to Diana and asked her to please let me give them a ride to their hotel. She resisted at first, but after Jacob’s pleading, she agreed.\u003c/p\u003e\n\u003cp\u003e“Where are you staying?” I asked.\u003c/p\u003e\n\u003cp\u003eShe looked down before answering me. “I was just going to have the cab driver take us to a motel that was the cheapest. This trip happened so fast and at the last minute, I didn’t have a chance to really find something.”\u003c/p\u003e\n\u003cp\u003eThere was no way Jacob could stay in a dirty motel. Not with his condition. I had an idea.\u003c/p\u003e\n\u003cp\u003e“Listen, before you shoot me down, let me explain. You shouldn’t be staying in a not-so-clean place with Jacob’s condition. I’ll bring you with me to the hotel I’m staying at, and I’ll pay for your room for as many days as you’re going to be in Chicago.”\u003c/p\u003e\n\u003cp\u003eDiana put her hand up and immediately got defensive. “No, absolutely not. No. I won’t allow it. It’s very kind of you, but you’re a stranger and you don’t know us and we don’t know you. Plus, I could never allow it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-4.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
