{"id":85686,"no":46,"title":"Page 46","content":"\u003cp\u003eI sat down and handed Amelia her wine and Julia her water. The lawyer entered the room and took his seat, where he continued to read from the white paper.\u003c/p\u003e\n\u003cp\u003e“Now that everyone has gotten what they needed, we can move on. Connor, I’m assuming you’re cussing me out about now and went and got your double scotch. But anyway, here are my wishes. Once you have my body cremated, I want you to spread my ashes across the Pacific Ocean. Thank you, Connor and Ellery, for taking care of me all these years. Words can never express how much I love you both. Julia and Collin, watching you grow up was the best part of my life and watching Connor struggle trying to be the perfect father was the highlight. Connor, you did well and I hope that I had a hand in helping you make the right decisions in your life. Jake, you and Julia are going to make wonderful parents and any child of yours is going to be blessed and incredibly lucky. Ellery, you were always a daughter to me and we’ve been through a lot together over the years. In fact, you and Connor exhausted me more times than I want to remember with all of your stubbornness. But it was a part of my life that I would never change. If he gets out of line, slap him around a few times and tell him it’s from me.”\u003c/p\u003e\n\u003cp\u003eWe all let out a soft laugh and my dad smiled.\u003c/p\u003e\n\u003cp\u003e“Collin, a true chip off the old block. You are definitely your father’s son and I couldn’t be more proud of you, just like I was of him. Watching you grow into a man has been a great journey for me and I’m proud to have considered you my grandson. Julia, you’re a beautiful young woman and I wish I could have stayed around to see that baby boy of yours, but the gods have called me home. You’re just like your mom and watching you grow up and defy your dad the way you did was priceless. I am proud to have considered you my granddaughter. Connor, I have a separate letter for you to read alone because I don’t need you getting all sappy on me. You can call me a fool, but these are my wishes. Black Family, you have given me more out of life than I can ever thank you for. I love you all very much, so don’t go getting used to the idea that I’m gone. I’ll always be around, watching over all of you. Did you hear that, Connor? You aren’t getting rid of me just yet. Now go get another drink, eat, and celebrate, Black Family. Peace to you all. Love, Denny.”\u003c/p\u003e\n\u003cp\u003eThe lawyer reached in his briefcase and handed my dad a sealed envelope. My dad took it and put it in his suit pocket. We all got up from the table and hugged one another. I watched as my mom hugged my dad tightly. I put my arm around Amelia as we walked into the kitchen and Julia and I started to set out the food. My mom and dad walked in and hugged us one last time before we sat down to eat and talk about life with Denny.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eA week later, as I was sitting in my office, Julia walked in and handed me a file to sign off on. She sat down and she looked really uncomfortable.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I asked.\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m okay. I’m just ready to get this child out of me.”\u003c/p\u003e\n\u003cp\u003e“I bet.” I laughed.\u003c/p\u003e\n\u003cp\u003eI looked over the papers and signed them. As I handed the folder to Julia, she stood up and then doubled over, holding her stomach. I jumped up from my chair and ran over to her.\u003c/p\u003e\n\u003cp\u003e“Julia, what’s wrong?” I asked as I lightly took hold of her arm.\u003c/p\u003e\n\u003cp\u003e“Oh, just a cramp. I’m okay.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I think so,” she said as she stood up.\u003c/p\u003e\n\u003cp\u003eI let go of her arm and, as she began to walk out of my office, she doubled over again.\u003c/p\u003e\n\u003cp\u003e“Collin, I think I’m in labor,” she said as she sat down on the floor of my office.\u003c/p\u003e\n\u003cp\u003e“What?! You can’t be. You’re not due for another month.”\u003c/p\u003e\n\u003cp\u003e“Tell that to your nephew.”\u003c/p\u003e\n\u003cp\u003eI started to panic. This couldn’t be happening right now. “I’ll call Jake.”\u003c/p\u003e\n\u003cp\u003e“He’s across town in a meeting.”\u003c/p\u003e\n\u003cp\u003e“Shit, Julia. I’ll call Dad.”\u003c/p\u003e\n\u003cp\u003eI picked up my phone from the desk and dialed my dad. No answer. I called my mom. No answer. Julia let out another yell and I ran over to her.\u003c/p\u003e\n\u003cp\u003e“No one is answering. What do I do?”\u003c/p\u003e\n\u003cp\u003e“Take me to the hospital!” she yelled. “Don’t panic. Because if you do, then I will.”\u003c/p\u003e\n\u003cp\u003e“Right. Okay, let’s go. I’ll get you there,” I said as I helped her up.\u003c/p\u003e\n\u003cp\u003eI held on to her as we waited for the elevator. She had another contraction and everyone gathered around to see what was going on because she wasn’t exactly quiet about it.\u003c/p\u003e\n\u003cp\u003e“Everyone get back to work. I’m taking Julia to the hospital. She’s in labor.”\u003c/p\u003e\n\u003cp\u003eThe elevator doors opened and we stepped inside. Once we got to the parking garage, I helped her into the Range Rover. I got in and, as I was pulling out, my dad called.\u003c/p\u003e\n\u003cp\u003e“Dad!”\u003c/p\u003e\n\u003cp\u003e“Son, what’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Julia is in labor. We’re on our way to the hospital. You need to get a hold of Jake. Julia said he’s in a meeting across town.”\u003c/p\u003e\n\u003cp\u003e“Oh God. Okay. Your mom and I will get Jake and we’ll meet you there. You tell Julia not to have that baby until we get there.”\u003c/p\u003e\n\u003cp\u003e“Dad said not to have the baby until they get there,” I said as I looked at her.\u003c/p\u003e\n\u003cp\u003e“Oh, okay. I’ll try my best!” she said with irritation.\u003c/p\u003e\n\u003cp\u003eAmelia wasn’t doing clinicals today and I knew she was in class, but I sent her a text anyway as soon as I stopped at a red light.\u003c/p\u003e\n\u003cp\u003e“On my way to the hospital with Julia. She’s in labor.”\u003c/p\u003e\n\u003cp\u003e“Oh my God! I’ll meet you there as soon as my class ends. How exciting!”\u003c/p\u003e\n\u003cp\u003e“OH GOD IT HURTS!” Julia screamed.\u003c/p\u003e\n\u003cp\u003eI reached over and grabbed her hand. “It’ll be okay, Julia.”\u003c/p\u003e\n\u003cp\u003e“NO IT WON”T BE OKAY!” she yelled at me.\u003c/p\u003e\n\u003cp\u003eI drove as fast as I could in New York midday traffic. To be honest, I was surprised we didn’t get into an accident. I was swerving in and out of traffic and running basically every red light. Julia was in a lot of pain and my main focus was getting her to the hospital before her water broke in my Range Rover. My phone rang and it was Jake.\u003c/p\u003e\n\u003cp\u003e“Jake!” I answered.\u003c/p\u003e\n\u003cp\u003e“Collin, Julia isn’t answering her phone.”\u003c/p\u003e\n\u003cp\u003e“I think she left it at the office. Here; talk to her.”\u003c/p\u003e\n\u003cp\u003eJulia seemed to calm down a little when she heard Jake’s voice. Then, suddenly she screamed.\u003c/p\u003e\n\u003cp\u003e“YOU BETTER GET YOUR ASS TO THE HOSPITAL IN TIME, JAKE JENSEN!”\u003c/p\u003e\n\u003cp\u003eShe threw the phone at me and I picked it up from my lap. “Dude, she’s in a lot of pain. She really doesn’t mean to be mean.” \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-46.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
