{"id":85689,"no":49,"title":"Page 49","content":"\u003cp\u003e“I don’t know, Collin. That’s a huge move.”\u003c/p\u003e\n\u003cp\u003e“We can help them, Dad. I wouldn’t be suggesting this if I didn’t feel it was right. Also, I want our company to start hosting charity events for cystic fibrosis. After all these years, you never branched out from the autism charities.”\u003c/p\u003e\n\u003cp\u003eHe leaned back in his chair with his hands behind his head. “Now that is a great idea. I’ll have Barb get started on that.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Dad.” I smiled.\u003c/p\u003e\n\u003cp\u003e“I’ll give some serious thought to your proposal and get back with you in a couple of days.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said as I got up from my chair.\u003c/p\u003e\n\u003cp\u003e“By the way, have you told Amelia yet about the house you purchased?” he asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Son.”\u003c/p\u003e\n\u003cp\u003e“I know, Dad. I will, don’t worry.”\u003c/p\u003e\n\u003cp\u003eI told him not to worry when it was constantly a worry on my mind. As I walked out of the building into the freezing cold, my phone rang.\u003c/p\u003e\n\u003cp\u003e“Hi, Mom.”\u003c/p\u003e\n\u003cp\u003e“Hi, sweetheart. I’m having family dinner tonight and I expect you and Amelia to be here. I know it’s last minute, but I just decided it. Julia, Jake, and the baby will be here. So if you have plans, cancel them, and I’ll see you around six.”\u003c/p\u003e\n\u003cp\u003eI didn’t have plans, but even if I did, I would have no choice but to cancel them because what my mom says goes.\u003c/p\u003e\n\u003cp\u003e“We’ll be there, Mom. I love you.”\u003c/p\u003e\n\u003cp\u003e“I love you too, my sweet boy.”\u003c/p\u003e\n\u003cp\u003eAs I was walking down the street to Starbucks, I passed the flower shop. I stopped and decided to buy Amelia some roses. It was no special occasion. I just wanted to let her know in another way that I loved her. While I was looking at the beautiful assortment of roses, my phone buzzed with a text message from Amelia.\u003c/p\u003e\n\u003cp\u003e“Hey, babe. Clinicals ended early and I need to stop by the campus library and pick up a book. I’m going to catch a cab with Cheri and then I’ll take one to your place.”\u003c/p\u003e\n\u003cp\u003e“No, Amelia. You and Cheri stay at the hospital. I’ll send Ralph over to pick you both up and then take you where you need to go.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Positive. I’ll see you later. I love you.”\u003c/p\u003e\n\u003cp\u003e“Thank you, babe. I love you too.”\u003c/p\u003e\n\u003cp\u003eI immediately called Ralph and had him pick up the girls. I told the sales clerk that I wanted two dozen red roses. As she was getting them together, I heard a voice behind me.\u003c/p\u003e\n\u003cp\u003e“Fancy seeing you in here.”\u003c/p\u003e\n\u003cp\u003eI turned around. “Hi, Hailey.”\u003c/p\u003e\n\u003cp\u003e“Buying flowers for your girlfriend?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yeah. I am. Why are you here?”\u003c/p\u003e\n\u003cp\u003e“No reason. I just saw you standing here when I was walking by and thought I’d drop in and say hi.”\u003c/p\u003e\n\u003cp\u003eThe clerk handed me the roses with a smile and I gave her my credit card. “Well, we’ve said hi and now it’s time to say goodbye.”\u003c/p\u003e\n\u003cp\u003e“I’m leaving for Paris in a couple of days.”\u003c/p\u003e\n\u003cp\u003e“Good for you. You always liked Paris.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Maybe I’ll meet some hot French dude who will sweep me off my feet with his incredible French accent.”\u003c/p\u003e\n\u003cp\u003e“I hope you do, Hailey. Now, if you’ll excuse me, I need to get going. Good luck.”\u003c/p\u003e\n\u003cp\u003eI began to walk away and stopped when I heard her next words.\u003c/p\u003e\n\u003cp\u003e“Tell me one more thing. Does she make you happier than I ever did?”\u003c/p\u003e\n\u003cp\u003e“Yes. She does,” I said as I closed my eyes and lowered my head.\u003c/p\u003e\n\u003cp\u003e“Then I’m happy you’re happy. See ya around sometime, Collin,” she said as she placed her hand on my back and then walked away.\u003c/p\u003e\n\u003cp\u003eMy phone started to ring and, when I pulled it from my pocket, I noticed it was my dad calling.\u003c/p\u003e\n\u003cp\u003e“Hello,” I said.\u003c/p\u003e\n\u003cp\u003e“Where are you?” he asked.\u003c/p\u003e\n\u003cp\u003e“Down the street at the flower shop.”\u003c/p\u003e\n\u003cp\u003e“Good. Do me a favor and pick up some roses for your mom and then you can drive me home since you sent Ralph on an errand.”\u003c/p\u003e\n\u003cp\u003eOh shit. I forgot he didn’t drive to the office himself. “Okay, Dad. What color roses for Mom?”\u003c/p\u003e\n\u003cp\u003e“Be creative and get a mix of colors. I’ll meet you in the parking garage.”\u003c/p\u003e\n\u003cp\u003eI hung up and walked back up to the counter. The clerk smiled at me.\u003c/p\u003e\n\u003cp\u003e“Sorry, but I need two dozen roses in a variety of colors.”\u003c/p\u003e\n\u003cp\u003e“Sure thing, Mr. Black. This wouldn’t happen to be for your mom, would it?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I smiled.\u003c/p\u003e\n\u003cp\u003eShe made up a bouquet of colorful roses and handed them to me. I left the store still thinking about the question Hailey asked me and the sadness in her voice when I answered her. My phone rang. It was my dad again.\u003c/p\u003e\n\u003cp\u003e“Hello,” I answered.\u003c/p\u003e\n\u003cp\u003e“Pick up some pink roses for your sister.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes and sighed. “Okay, Dad.”\u003c/p\u003e\n\u003cp\u003eI walked back into the flower shop and the woman smiled at me again.\u003c/p\u003e\n\u003cp\u003e“I need two dozen pink roses, please.”\u003c/p\u003e\n\u003cp\u003e“Sister?” She smiled.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Your dad always bought her pink roses. I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eShe handed me the roses and, before I left the store, I dialed my dad.\u003c/p\u003e\n\u003cp\u003e“Hello, son.”\u003c/p\u003e\n\u003cp\u003e“Before I leave the flower shop, is there anyone else you want flowers for?”\u003c/p\u003e\n\u003cp\u003e“No. Just your mom and Julia. I’m assuming you went there to buy Amelia flowers, correct?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then you’re all set. Hurry up and get back here.”\u003c/p\u003e\n\u003cp\u003e“I’m on my way,” I said as I hung up.\u003c/p\u003e\n\u003cp\u003eI stepped into the apartment and Amelia came from the direction of the kitchen. The corners of her mouth curved up when she saw the roses I was holding.\u003c/p\u003e\n\u003cp\u003e“Are those for me?” She smiled.\u003c/p\u003e\n\u003cp\u003e“No. Some girl at the office gave them to me.”\u003c/p\u003e\n\u003cp\u003eThe look on her face was priceless. She stood there and narrowed her eyes at me.\u003c/p\u003e\n\u003cp\u003e“What girl?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. She’s new. Anyway, she told me she loved me and then gave me these. Aren’t they pretty?”\u003c/p\u003e\n\u003cp\u003e“She told you that she loved you?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Isn’t that weird? I was totally flattered and she was really hot. But I guess if you want the flowers, you can have them.” I smiled.\u003c/p\u003e\n\u003cp\u003e“NO THANKS!” she said in a huff and walked away.\u003c/p\u003e\n\u003cp\u003eOkay, maybe I took that a little too far. Now I needed to make things right. “Of course these are for you, baby. I was just teasing.”\u003c/p\u003e\n\u003cp\u003e“Go away, Collin. In fact, I’m just going to stay at my place tonight.”\u003c/p\u003e\n\u003cp\u003eOh shit. What the fuck had I done? \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-49.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
