{"id":85646,"no":5,"title":"Page 5","content":"\u003cp\u003eJacob had his head lying on her shoulder and he looked tired. “Diana, listen. Jacob told me that you lost your job and you’re using what little you have for this trip to see the specialist. I’m going to introduce myself and then you’ll know me.”\u003c/p\u003e\n\u003cp\u003eI held out my hand. “Hi, Diana, I’m Collin Black and I work for Black Enterprises in New York City. I’m here in Chicago to deliver some plans to our Chicago office. My parents are crazy lovers, my sister and her husband are expecting their first child, and my girlfriend of six years left me to study fashion in Italy. Please let me help you out because I really like Jacob and he’s my friend.”\u003c/p\u003e\n\u003cp\u003eShe cocked her head and stared at me. You’re the son of Connor Black?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes, I am. Do you know my father?”\u003c/p\u003e\n\u003cp\u003e“No, not personally, but I know who he is. He holds charity events every year for children with autism.”\u003c/p\u003e\n\u003cp\u003e“Yes, he does. See, now you know my family and you know we like to help people. So please, Diana, let me help you and Jacob.”\u003c/p\u003e\n\u003cp\u003e“Your parents would be very proud of you.” She smiled. “Thank you, Collin. I promise to pay you back.”\u003c/p\u003e\n\u003cp\u003eI pulled out my phone and sent a text message to Ellie.\u003c/p\u003e\n\u003cp\u003e“Hey, babe. I’m in town. Let’s do some clubbing tonight.”\u003c/p\u003e\n\u003cp\u003e“It’s about time, Mr. Black. I was wondering when I’d see you again.”\u003c/p\u003e\n\u003cp\u003e“Tonight, babe. How’s seven o’clock?”\u003c/p\u003e\n\u003cp\u003e“Great. I’ll be downtown anyway, so I’ll meet you at your hotel.”\u003c/p\u003e\n\u003cp\u003e“I’ll be waiting.”\u003c/p\u003e\n\u003cp\u003eEllie was a sexy girl and I couldn’t wait to get her into bed again. My phone rang and it was my mom calling. Shit, I forgot to call her when I landed.\u003c/p\u003e\n\u003cp\u003e“Hey, Mom.”\u003c/p\u003e\n\u003cp\u003e“Are you alive? You said you’d call when you landed.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mom. I got distracted,” I said.\u003c/p\u003e\n\u003cp\u003e“Seriously, Collin?”\u003c/p\u003e\n\u003cp\u003e“Seriously, Mom. I promise to explain when I get home. Now I have to go. I just arrived at the hotel.”\u003c/p\u003e\n\u003cp\u003eThe driver took our bags from the trunk and handed them to us. Diana and Jacob stood in front of the Trump Hotel and wouldn’t stop staring at it.\u003c/p\u003e\n\u003cp\u003e“Come on. You’ll love this place.” I smiled.\u003c/p\u003e\n\u003cp\u003eThey followed me inside and up to the desk.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, Mr. Black. I have your suite ready,” the hotel clerk said.\u003c/p\u003e\n\u003cp\u003e“Thank you. I also need to book an additional room for my guests.”\u003c/p\u003e\n\u003cp\u003e“Sure, Mr. Black. How many nights will your guests be staying with us?”\u003c/p\u003e\n\u003cp\u003eI looked over at Diana. “Just two nights,” she said.\u003c/p\u003e\n\u003cp\u003e“Are you sure? You’re welcome to stay longer,” I spoke.\u003c/p\u003e\n\u003cp\u003e“I’m sure. After we see the specialist tomorrow, we’re flying back the next morning. I can’t afford to stay in Chicago any longer than necessary.”\u003c/p\u003e\n\u003cp\u003e“Two nights,” I said to the clerk.\u003c/p\u003e\n\u003cp\u003eDiana and Jacob walked over to the glass elevator and stared into it. I leaned over to the clerk and I whispered, “I want you to tell them that the mini-bar in the room is free and so is room service. Just bill everything to my room.”\u003c/p\u003e\n\u003cp\u003e“Will do, Mr. Black.”\u003c/p\u003e\n\u003cp\u003eI called Diana over and the clerk handed her the key. She explained to her how all room service and the mini bar were free to guests.\u003c/p\u003e\n\u003cp\u003e“Are you sure that’s free?” she asked her.\u003c/p\u003e\n\u003cp\u003e“It’s a perk of staying at the Trump.” I winked.\u003c/p\u003e\n\u003cp\u003eThe bellhop walked over and took their bags. Diana hugged me and, with a tear in her eye, she thanked me for all my help.\u003c/p\u003e\n\u003cp\u003e“You be brave tomorrow,” I said to Jacob as we high-fived.\u003c/p\u003e\n\u003cp\u003e“It’ll be a piece of cake.” He smiled.\u003c/p\u003e\n\u003cp\u003eThey walked onto the elevator and waved as it took them up to their floor. I pulled my phone from my pocket and called my dad.\u003c/p\u003e\n\u003cp\u003e“Hello,” he answered.\u003c/p\u003e\n\u003cp\u003e“Hey, Dad. I need you to send the plane to Chicago the day after tomorrow to pick me up.”\u003c/p\u003e\n\u003cp\u003e“Collin, I bought you a round-trip ticket.”\u003c/p\u003e\n\u003cp\u003e“I know, but something happened.”\u003c/p\u003e\n\u003cp\u003e“What do you mean ‘something happened’?” he asked. “Are you telling me that you can’t even fly to Chicago without getting into some kind of trouble?”\u003c/p\u003e\n\u003cp\u003e“I didn’t get into any trouble, Dad. I met someone.”\u003c/p\u003e\n\u003cp\u003e“Jesus Christ, Collin, I’ve heard enough.”\u003c/p\u003e\n\u003cp\u003e“No, Dad, you have to let me explain. I met a kid. A sick kid.”\u003c/p\u003e\n\u003cp\u003e“What?” he asked calmly.\u003c/p\u003e\n\u003cp\u003eI explained to him about Jacob, and I told him about Diana and how she lost her job.\u003c/p\u003e\n\u003cp\u003e“What you did for them was very nice, son. I’m proud of you,” my dad said.\u003c/p\u003e\n\u003cp\u003e“Thanks, Dad. I have to go. I need to get these plans over to the office and then I’m off to meet some friends.”\u003c/p\u003e\n\u003cp\u003e“Stay out of trouble.”\u003c/p\u003e\n\u003cp\u003e“I will. Bye, Dad.”\u003c/p\u003e\n\u003cp\u003eChapter 3\u003c/p\u003e\n\u003cp\u003eI walked through the doors of Black Enterprises and, as always, I was warmly greeted by all the ladies. I took the elevator up to Mac’s office.\u003c/p\u003e\n\u003cp\u003e“Well, if it isn’t Mr. McHottie.” She smiled as I walked through the door.\u003c/p\u003e\n\u003cp\u003e“You do know that your flattery will get you some of this,” I said as I grabbed my crotch.\u003c/p\u003e\n\u003cp\u003e“Would you like me to tell your father that you’re sexually harassing me?” She smiled as she kissed me on the cheek.\u003c/p\u003e\n\u003cp\u003e“The sad part is, he’d believe you.” I pouted. “Here’s the plans,” I said as I handed them to her.\u003c/p\u003e\n\u003cp\u003eMac – Mackenzie – was the head manager at the Chicago office. She oversaw the entire office and made sure it ran smoothly. She was an older woman and had been working for my dad since he first built the Chicago building and she’d known me since I was a baby. She was hot for her age and we liked to joke around; too bad she wasn’t into guys.\u003c/p\u003e\n\u003cp\u003e“So what did you do?” she asked.\u003c/p\u003e\n\u003cp\u003eI sat down in the chair across from her desk and folded my arms. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Your dad wouldn’t make you fly the all the way to Chicago unless you did something to piss him off.”\u003c/p\u003e\n\u003cp\u003e“I went out, got drunk, and brought a girl home. I don’t think it would’ve been a big deal if she hadn’t walked out of my room naked and right into my dad.”\u003c/p\u003e\n\u003cp\u003eMac sat at her desk and shook her head. “Collin Black. Get your head out of your ass! What’s the matter with you? You just can’t bring home a random girl with your parents down the hall. The least you could’ve done was get a hotel room. It’s not like you can’t afford it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-5.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
