{"id":85697,"no":57,"title":"Page 57","content":"\u003cp\u003e“Not real good,” I replied.\u003c/p\u003e\n\u003cp\u003e“Want to talk about what happened between you and Amelia?”\u003c/p\u003e\n\u003cp\u003eMy mom set the cocktail down in front of me and I chugged it down to get it over with. “I took her to the Hamptons yesterday, to the house. I told her that I bought it and she got pissed. She got really pissed and I don’t understand why,” I said as I put my head down on the table.\u003c/p\u003e\n\u003cp\u003e“Maybe it’s because you kept something from her that you shouldn’t have,” my mom said.\u003c/p\u003e\n\u003cp\u003e“I told you, son, that you should’ve told her about the house,” my dad chimed in.\u003c/p\u003e\n\u003cp\u003e“I remember someone doing the exact same thing. Not once, not twice, but at least three times, Connor.”\u003c/p\u003e\n\u003cp\u003e“I know, Elle, and you know I regret each and every one of those times.”\u003c/p\u003e\n\u003cp\u003e“Okay, okay. I fucked up. What else is new? What am I supposed to do?”\u003c/p\u003e\n\u003cp\u003eMy mom walked over and kissed me on the head. “Alcohol doesn’t solve your problems. It only creates more. So the first thing you’re going to do is lay off the booze. The second thing, find a way to make things right. You’re your father’s son. You can do it.”\u003c/p\u003e\n\u003cp\u003eShe walked out of the kitchen and my dad sat across the table and looked at me. “Give her time. She needs to think. You need to think. Don’t call. Don’t text. Just give her time. When she’s ready, she’ll come around.”\u003c/p\u003e\n\u003cp\u003e“Easier said than done, Dad. I miss her like crazy already.”\u003c/p\u003e\n\u003cp\u003e“I know, son. Trust me. Maybe send her a small text and tell her that you love her and that’s it. It’s the little things, you know? She’ll forgive you. She loves you and love conquers all.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Dad. I’m going to go into the office now. Do you want to drive with me?”\u003c/p\u003e\n\u003cp\u003e“No, Ralph is driving me in. I have a meeting across town this afternoon.”\u003c/p\u003e\n\u003cp\u003e“Okay. I’ll see you later.”\u003c/p\u003e\n\u003cp\u003eI sat in my office, trying to concentrate on the work that needed to be done. I threw my pen across the desk and pulled out my phone.\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003eNo response. I sighed and decided to go to the gym. I always kept a bag in my office for those spur-of-the-moment workouts. I walked into the gym and went straight to our private locker room to change into my swimming trunks. I grabbed a towel and headed to the pool. When I opened the door and walked in, I was shocked to see Julia, my mom, and Brayden in the water.\u003c/p\u003e\n\u003cp\u003e“Collin, what are you doing here?” my mom asked.\u003c/p\u003e\n\u003cp\u003e“I needed to work out.”\u003c/p\u003e\n\u003cp\u003e“Does your father know you’re not at the office?”\u003c/p\u003e\n\u003cp\u003e“Mom, cut me some slack. It’s fine.”\u003c/p\u003e\n\u003cp\u003eI jumped in and swam over to Julia and Brayden. I took him from her arms and held him in the water.\u003c/p\u003e\n\u003cp\u003e“First swimming lesson?” I asked her.\u003c/p\u003e\n\u003cp\u003e“Yeah. Never too young to learn. How are you? Mom told me what happened.”\u003c/p\u003e\n\u003cp\u003e“I’m a mess, as usual. Nothing new there, right?”\u003c/p\u003e\n\u003cp\u003e“Don’t say things like that. Amelia loves you and she’ll come around.”\u003c/p\u003e\n\u003cp\u003e“I just don’t understand why she’s so upset. I thought I was doing the right thing.”\u003c/p\u003e\n\u003cp\u003e“Maybe she’s pissed off because you kept it from her and didn’t talk to her about it first.”\u003c/p\u003e\n\u003cp\u003e“I wanted it to be a surprise. She deserves surprises in her life.”\u003c/p\u003e\n\u003cp\u003eBrayden started to fuss and I handed him back to Julia.\u003c/p\u003e\n\u003cp\u003e“She’s not Hailey, Collin. I know what you’re thinking and I know you’re scared. This is your first fight, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yeah, it is,” I said as I looked down.\u003c/p\u003e\n\u003cp\u003e“First fights are always the hardest. Don’t worry; she’ll be back in your arms before you know it.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Julia. I’m going to do some laps now. I don’t want to be gone too long because Dad will get pissed.”\u003c/p\u003e\n\u003cp\u003e“I think Brayden is starting to prune. I better get him out of the water.” She laughed.\u003c/p\u003e\n\u003cp\u003e“Where’s Mom?” I asked her as she got out of the pool.\u003c/p\u003e\n\u003cp\u003e“I have no idea. That’s strange, that she just left like that.”\u003c/p\u003e\n\u003cp\u003eEllery\u003c/p\u003e\n\u003cp\u003eI hated seeing my son in pain again. It was bad enough what he went through after Hailey left him, and I didn’t want to see him like that again. I quietly got out of the pool while Collin and Julia were talking and went to the locker room to call Amelia.\u003c/p\u003e\n\u003cp\u003e“Hello,” she answered.\u003c/p\u003e\n\u003cp\u003e“Hi, Amelia. It’s Ellery. Would you like to have a late lunch with me? Say around two thirty?”\u003c/p\u003e\n\u003cp\u003e“Hi, Ellery. Sure. I would like that very much.”\u003c/p\u003e\n\u003cp\u003e“Great. Let’s meet at Aureole’s. I’ll call and make reservations for us.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you then, Ellery.”\u003c/p\u003e\n\u003cp\u003e“Bye, Amelia.”\u003c/p\u003e\n\u003cp\u003eI went back to the pool and saw Julia and Brayden watching Collin do laps around the pool.\u003c/p\u003e\n\u003cp\u003e“Are you finished swimming, Julia?” I asked.\u003c/p\u003e\n\u003cp\u003e“Yeah, Brayden was turning into a prune. Where did you go?”\u003c/p\u003e\n\u003cp\u003e“I had to make a phone call.” I smiled.\u003c/p\u003e\n\u003cp\u003e“Please tell me you didn’t call Amelia.”\u003c/p\u003e\n\u003cp\u003e“I did, and we’re meeting for lunch at two thirty. Don’t you mention this to your brother or your dad.”\u003c/p\u003e\n\u003cp\u003e“I won’t. Good luck. But I don’t think you should get involved.”\u003c/p\u003e\n\u003cp\u003e“Well, I don’t want my son hurting and I would do the same for you.” I smiled. “Let’s go get this little guy back in his clothes. Bye, Collin. I love you.”\u003c/p\u003e\n\u003cp\u003e“Bye, Mom, Julia. I love you too.”\u003c/p\u003e\n\u003cp\u003eAmelia and I arrived at the restaurant at the same time.\u003c/p\u003e\n\u003cp\u003e“Hi, sweetheart,” I said as I hugged her.\u003c/p\u003e\n\u003cp\u003e“Hi, Ellery.”\u003c/p\u003e\n\u003cp\u003eWe walked in the restaurant and were promptly seated. I looked at Amelia and could see the sadness in her eyes.\u003c/p\u003e\n\u003cp\u003e“How are you?” I asked.\u003c/p\u003e\n\u003cp\u003e“Collin told you what happened?” she replied.\u003c/p\u003e\n\u003cp\u003e“He did. After Connor and Jake found him completely inebriated and on the floor of his apartment. They brought him up to the penthouse to sleep it off.”\u003c/p\u003e\n\u003cp\u003eShe looked down as she played with her spoon. “He shouldn’t have drunk like that.”\u003c/p\u003e\n\u003cp\u003e“No, he shouldn’t have, but he didn’t want to hurt anymore. I understand you being mad at him for not telling you about the house. I really do. Sometimes, people think they’re doing the right thing when they’re not. He should’ve talked to you about it first. Unfortunately, he gets that from his dad. Well, and maybe me too.” \u003c/p\u003e","sourceLink":"https://allnovel.net/collin-forever-4/page-57.html","bookId":1817,"creation":"Oct 5, 2019 5:08:53 PM","modification":"Oct 5, 2019 5:08:53 PM"}
