{"id":101839,"no":5,"title":"Page 5","content":"\u003cp\u003e“I…wasn’t ready to be a father. I guess I never was.”\u003c/p\u003e\n\u003cp\u003eCatherine wondered if she’d misunderstood him. “You mean to say you never had children?”\u003c/p\u003e\n\u003cp\u003e“None,” he said. “Three wives, but not one of them was interested in a family. For that matter, neither was I.” He hesitated and his gaze skirted hers. “I was a selfish bastard when I left you. Unfortunately that hasn’t changed.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t confirm or deny his words, for she no longer knew him.\u003c/p\u003e\n\u003cp\u003e“Would you mind telling me about Edward?” he asked.\u003c/p\u003e\n\u003cp\u003eCatherine leaned back and sipped her coffee. “In many ways he’s very like you. The physical resemblance is there, anyway.”\u003c/p\u003e\n\u003cp\u003eGreg looked up and smiled faintly.\u003c/p\u003e\n\u003cp\u003e“He’s six-two and muscular.”\u003c/p\u003e\n\u003cp\u003e“How old? Thirty-four?”\u003c/p\u003e\n\u003cp\u003e“Thirty-five,” she told him. “His birthday was last month on the twenty-ninth.”\u003c/p\u003e\n\u003cp\u003e“Is he married?”\u003c/p\u003e\n\u003cp\u003e“Yes, and he has a son himself and another baby on the way. Next spring.”\u003c/p\u003e\n\u003cp\u003eGreg’s smile grew wider.\u003c/p\u003e\n\u003cp\u003e“He’s a doctor.”\u003c/p\u003e\n\u003cp\u003e“Really?” Greg seemed to have trouble believing it.\u003c/p\u003e\n\u003cp\u003e“My husband is, too.” Perhaps it was time to remind Greg who Edward’s father was. “Larry raised Edward, helped make him the kind of man he is. Larry’s his father.”\u003c/p\u003e\n\u003cp\u003eGreg shook his head. “I wouldn’t interfere in his life.”\u003c/p\u003e\n\u003cp\u003eIt took a moment for his words to sink in—and then it occurred to her what he’d meant. “Are you asking to meet Edward?”\u003c/p\u003e\n\u003cp\u003eGreg didn’t respond for a long time. His face pale and intent, he finally said, “Yes. Could I?”\u003c/p\u003e\n\u003cp\u003eFour\u003c/p\u003e\n\u003cp\u003eMatthias Jamison enjoyed puttering around in his greenhouse before breakfast. The mornings—that was when he missed Mary the most. She’d been gone fifteen years now, and not a day passed that he didn’t think about the woman he’d loved for more than thirty years. Some men he’d known were quick to remarry after losing their wives. Not him. Mary had been the only woman for him, and no one else would ever fill the void left by her death.\u003c/p\u003e\n\u003cp\u003eThe sunrise over the Cascade Mountains was glorious, the light creeping up over the horizon, then spilling across his western-Washington vineyard like the promise it was. The morning sun was a reassurance, the pledge of another day, another opportunity. Mary had been the one to teach him that, but he’d never fully appreciated her enthusiasm for mornings until it was too late. He wished he’d shared more sunrises with his beloved wife.\u003c/p\u003e\n\u003cp\u003eTheir only grandson now suffered from the same rare form of leukemia that had claimed her prematurely. It looked as if Tanner, too, would die. Matthias’s jaw tensed and he closed his eyes. How could a loving God let an innocent child suffer like this?\u003c/p\u003e\n\u003cp\u003eWhat made an untenable situation even worse was the fact that his daughter bore the burden alone. Her ex had done nothing for her or the boy, making Matthias feel doubly responsible, but beyond phone calls and the occasional visit, there was little he could do to help her from where he lived.\u003c/p\u003e\n\u003cp\u003eThe phone rang and Matthias hurried back to the house, hoping for good news. “Hello,” he answered in his usual gruff voice.\u003c/p\u003e\n\u003cp\u003e“It’s Harry.”\u003c/p\u003e\n\u003cp\u003eA longtime friend and vineyard owner from the Napa Valley. “A little early for you to be phoning, don’t you think?” Matthias couldn’t prevent his disappointment from showing. He’d been hoping it was his daughter, Gloria, on the phone. He sighed heavily. It damn near killed Matthias that he was as powerless to help the boy as he’d been with Mary.\u003c/p\u003e\n\u003cp\u003e“I’ve got news that’ll cheer you right up,” Harry said.\u003c/p\u003e\n\u003cp\u003e“I could use some good news.”\u003c/p\u003e\n\u003cp\u003e“It’s about Greg Bennett.”\u003c/p\u003e\n\u003cp\u003eMatthias stiffened at the sound of the name. He hated Greg Bennett with an intensity that had grown through the years. Bennett owed him. The success of the winery was largely due to Matthias’s guiding hand. If it hadn’t been for him, especially in those early years, Greg would have lost the vineyard ten times over.\u003c/p\u003e\n\u003cp\u003eThe younger of the two Bennett boys had shown a talent for the business, but Matthias had been the one to teach him about grapes, about wine making, about operating an estate winery. Greg’s father, John Bennett, had lived for the vineyard, to the point that it had destroyed his marriage. But he’d been impatient with the boy, an ineffective teacher.\u003c/p\u003e\n\u003cp\u003eA few years after Greg had joined Bennett Wines, John had died, and Greg had taken over. From that point on, Matthias had advised Greg, guided him and helped him expand enough to buy out his brother’s share. Matthias had treated Greg as he would have treated his own son, if he’d had one. He’d shared everything with Greg Bennett, his skills and ideas, his enthusiasm for viticulture and wine making, his friendship. That was what made the betrayal so painful, so devastating. Mary’s illness was an almost intolerable blow, but Greg’s refusal to help them—that had been, in a way, an even greater blow.\u003c/p\u003e\n\u003cp\u003eMary had loved Greg, too. Many nights she’d insisted Greg join them for dinner. She’d opened her home and her heart to Greg, and when she needed him, he’d said no. Neither bonds of family nor friendship, neither obligation nor gratitude, had influenced his decision.\u003c/p\u003e\n\u003cp\u003e“What about Greg?” Matthias asked now.\u003c/p\u003e\n\u003cp\u003e“He was in San Francisco looking for a loan.”\u003c/p\u003e\n\u003cp\u003eSo Greg’s vineyard had been hit by fan leaf disease. Matthias had suspected as much, but hadn’t heard. “Did he get one?”\u003c/p\u003e\n\u003cp\u003eHarry paused for effect. “Not a dime.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“I thought you’d like hearing that.”\u003c/p\u003e\n\u003cp\u003eMatthias did, but not nearly as much as he’d hoped. All his energy was focused on doing what he could to help his daughter and grandson. For fifteen years his hatred of Greg Bennett had simmered, until it’d burned a hole straight through his heart. He couldn’t forgive or forget, but his hatred no longer dominated every waking moment.\u003c/p\u003e\n\u003cp\u003e“You always said time wounds all heels.”\u003c/p\u003e\n\u003cp\u003eMatthias grinned. Actually, Mary had been the one to say that.\u003c/p\u003e\n\u003cp\u003e“He’s going to lose everything.”\u003c/p\u003e\n\u003cp\u003e“It’s what he deserves,” Matthias said without emotion. The younger man had laid the foundation of his own troubles. If anything, Matthias was grateful he’d lived long enough to witness Bennett’s downfall.\u003c/p\u003e\n\u003cp\u003e“I bet you think he should rot in hell,” Harry said, and when Matthias didn’t comment, his friend spoke again. “Hey, I hate the guy, too. Everyone does—although not as much as you do.” He chuckled. “Well, I better get back to my morning coffee.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the call.”\u003c/p\u003e\n\u003cp\u003e“Talk to you later,” Harry said. A moment later, the line was disconnected.\u003c/p\u003e\n\u003cp\u003eMatthias appreciated knowing of Greg’s financial problems. Fan leaf, a virus, had indiscriminately infected a number of vineyards in both the Sonoma and Napa valleys. Owners had been forced to tear out formerly productive vines and start anew, a prospect that was both time-consuming and expensive. Many of the small and medium-sized wineries in the two valleys were in danger of going under, Greg’s included.\u003c/p\u003e\n\u003cp\u003eMostly retired, Matthias needed something to occupy his time. In recent years he’d been working with local vineyard owners who were trying to grow vines resistant to the fan leaf virus before it had the same devastating results in Washington as in California.\u003c/p\u003e\n\u003cp\u003eStanding next to the phone, Matthias realized he should be dancing at the news about the disaster at Bennett Wines. A year ago, even six months ago, he would have been thrilled at the thought of Greg’s troubles. Revenge was said to be a dish best eaten cold, and he’d certainly waited long enough to have it served to him. But he experienced damn little of the pleasure he’d anticipated. He’d wanted Greg to suffer the same agony that had tormented him as he stood by his wife’s bedside.\u003c/p\u003e\n\u003cp\u003eThe vineyard was everything to Greg, just as Matthias’s only grandchild had become everything to him. And this time, they were both going to lose what they loved most.\u003c/p\u003e\n\u003cp\u003e“That is so sad,” Mercy said, sitting on the edge of the counter in Matthias’s kitchen. “Just look at him.”\u003c/p\u003e\n\u003cp\u003e“He’s worried sick about his grandson.”\u003c/p\u003e\n\u003cp\u003e“What’s going to happen to the boy?” Both Goodness and Mercy turned to Shirley.\u003c/p\u003e\n\u003cp\u003e“Do I look like I have a crystal ball?” Shirley asked irritably.\u003c/p\u003e\n\u003cp\u003e“I don’t know about you two.” Goodness reclined on the long counter. “But I was hoping for something a little less stressful during this visit to earth. We’re assigned to a guy who’s a real jerk. Someone who couldn’t care less about anyone except himself.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but we’re here on earth, aren’t we?”\u003c/p\u003e\n\u003cp\u003e“Well, yes, but—”\u003c/p\u003e\n\u003cp\u003e“I agree with you,” Shirley said, cutting in while the opportunity presented itself, “but we can help.”\u003c/p\u003e\n\u003cp\u003e“Where’s the fun? We got a human with his head so far up his—”\u003c/p\u003e\n\u003cp\u003e“Mercy!”\u003c/p\u003e\n\u003cp\u003e“A self-centered human,” she revised. “You know, I think I’d feel better if Catherine had torn him to shreds. She should never have forgiven him.”\u003c/p\u003e\n\u003cp\u003e“Mercy! Just listen to yourself.”\u003c/p\u003e\n\u003cp\u003e“Right, right,” she muttered, but Shirley could see that Greg was taking a toll on her friend’s compassion.\u003c/p\u003e\n\u003cp\u003e“He’s got too many problems for us to deal with,” Goodness complained.\u003c/p\u003e\n\u003cp\u003eShirley wasn’t accustomed to such a defeatist attitude. “There’s always his brother.”\u003c/p\u003e\n\u003cp\u003e“What’s this about a brother?” Goodness asked, suddenly attentive.\u003c/p\u003e\n\u003cp\u003e“Don’t you remember?” Shirley did a double take. At their blank stares she sighed and reminded them. “Phil. You remember reading about Philip Bennett, don’t you? He’s a big muck-a-muck with Pacific Union Bank. Greg considered going to him for a loan, but couldn’t bring himself to do it.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eShirley sighed again. It would help considerably if Goodness and Mercy had finished their research.\u003c/p\u003e\n\u003cp\u003e“Refresh my memory, would you?” Goodness asked.\u003c/p\u003e\n\u003cp\u003eShirley felt the burden of responsibility. “You didn’t read the whole file, did you?” she asked wearily.\u003c/p\u003e\n\u003cp\u003e“Ah…no.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought.” It would do no good to lecture them now. “Greg’s mother was dying while he was in the middle of his second divorce.”\u003c/p\u003e\n\u003cp\u003e“I remember reading about Bobbi,” Mercy said triumphantly. “His second trophy wife.”\u003c/p\u003e\n\u003cp\u003e“His second attempt to find another Catherine, you mean,” Goodness muttered.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah. What does Bobbi and their divorce have to do with Greg’s mother?” Mercy asked. Both angels were lying on their stomachs now, chins propped on their hands.\u003c/p\u003e\n\u003cp\u003e“You didn’t finish reading the file, either?” Shirley was dismayed.\u003c/p\u003e\n\u003cp\u003eAnything that was going to get accomplished on this mission would obviously be up to her.\u003c/p\u003e\n\u003cp\u003e“It was too depressing.”\u003c/p\u003e\n\u003cp\u003e“I don’t have the patience to cope with men like him,” Goodness said. \u003c/p\u003e","sourceLink":"https://allnovel.net/shirley-goodness-and-mercy-angels-everywhere-4/page-5.html","bookId":2628,"creation":"Oct 5, 2019 10:08:31 PM","modification":"Oct 5, 2019 10:08:31 PM"}
