{"id":23956,"no":25,"title":"CHAPTER XXV. JASPER FINDS HIMSELF A PRISONER.","content":"\u0026nbsp;It was after five o\u0027clock when Jasper opened his eyes. As soon as consciousness returned he looked around him with astonishment and wonder. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where am I?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few rays of light entered at the sliding-door above, and to this his eyes were naturally drawn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here was another puzzle. He explored his memory, and could recall no such place as this. He had never before been in such a room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last he recalled the circumstances under which he fell asleep, and he jumped to the conclusion that he was in the same house still.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They must have put me to bed,\" he said to himself. \"They were very kind; but this is a queer room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus far no thought that he was a prisoner had entered his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He arose and began to feel his way around by the walls. He judged that he was in a room not more than ten feet square. He could form no idea what was the time. It might be the middle of the night, so far as he knew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is awkward,\" he thought. \"I don\u0027t fancy being shut up like this. Where\u0027s the door? There must be one somewhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He found it at last, and tried the lock, but it did not yield to his efforts.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then came the startling thought:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I a prisoner?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stopped short and thought over the situation. He recalled all he could of the men in whose company he had been at the time he went to sleep. The longer he thought the more it seemed probable that it was as he suspected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though a little startled at this view of the situation, Jasper was by no means disposed to be despondent. His courage arose with the difficulties of his position.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll find out how matters stand,\" he said to himself. \"I\u0027ll pound till somebody comes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He began to pound on the walls of the room with such effect that the old man below heard him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The bird is beating against the walls of his cage,\" he thought. \"I\u0027ll go up and see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently Jasper heard steps ascending the stairs. Almost immediately another sliding-door about four feet from the floor was drawn open, and the old man\u0027s face was poked in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you knock?\" he asked, grinning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Jasper. \"Open the door, and let me out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you have some supper first?\" asked Nathan, with a leer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I\u0027d rather go out,\" said Jasper, in a tone of suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t allow that. Oh, no!\" said Nathan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What right have you to keep me here against my will?\" exclaimed Jasper, furiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We like your company so much, my dear young man,\" said Nathan, nodding his head waggishly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s \u0027we\u0027?\" demanded Jasper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Jack, and Bill, and me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me out, I say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be agitated, my dear boy. You\u0027ll be taken good care of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d rather take care of myself. Will you open the door?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t, but I\u0027ll bring you up some supper directly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sliding-door was closed suddenly, and again Jasper found himself in the dark, fully understanding now that he was a prisoner, but why, he could not form a conjecture.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2967/81688.html","bookId":378,"creation":"Aug 2, 2019 8:35:08 PM","modification":"Aug 2, 2019 8:35:08 PM"}
