{"id":23960,"no":29,"title":"CHAPTER XXIX. JASPER IN A NEW CHARACTER.","content":"\u0026nbsp;It was a relief to be out of his prison, but it must be admitted that Jasper\u0027s situation was not particularly desirable or agreeable. It was midnight, and he was seated astride the roof of the house which had served as his prison. There seemed to be no chance to reach the street, except to slide down the roof, and that would be certain death. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasper looked about him in great perplexity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As his deliverer had told him, the next house was a story higher than the one on whose roof he was seated, and, still more important, there was a side-window looking out in that direction. When Jasper saw this, hope sprang up in his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If that window is not fastened I can get in,\" he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He edged his way along to the window, and found that to reach it he would have to slide down a little way and catch hold of the blind to prevent sliding too far.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s some risk about it,\" thought Jasper. \"Shall I try it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I don\u0027t know whether Jasper was justified in taking the risk he did, for there was great danger of sliding over into the street. I don\u0027t think I should have ventured to do it; but our hero was fearless and courageous, and he resolved that, as this was the only method of escape, he would avail himself of it. As a precaution against slipping, however, he took off his shoes, and catching the strings in his teeth commenced the perilous descent. He succeeded in grasping the blind and staying his progress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, if the window should be fastened, what should I do?\" he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it was not. He succeeded in raising it, and with a feeling of intense relief made his way into the chamber.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then for the first time there flashed upon him the thought that he had placed himself in a very suspicious predicament. He had entered a house at midnight through the window. Why might he not be taken for a burglar? This was the way a burglar was likely to enter, and if he should be caught here his explanation would be considered very unsatisfactory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasper, brave as he was, was startled by this thought, while simultaneously the difficulty of escape was forced upon him. He looked about him in mental disturbance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a small attic chamber. There was a bed in the room, a wash-stand, a couple of chairs, and a clothes-press. This, being open, revealed a few clothes belonging, apparently, to a man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why isn\u0027t he here?\" thought Jasper, \"and what shall I do if he comes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though his story was true, he nevertheless felt that it was improbable, and before he could tell it he thought it likely that an alarm would be given, resulting in his being consigned to the care of the police.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An idea came to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the bed, drew out one of the sheets and arrayed himself in it, after carefully folding back the quilt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" he said to himself, \"if it is necessary, I will see what sort of a ghost I can make.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hardly had he done this than he heard steps ascending the stairs. Jasper had little doubt that it was the occupant of the chamber which he had so unceremoniously entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll get into the wardrobe if I can,\" he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He managed to squeeze himself into the wardrobe, and waited with anxiety for the arrival of the new-comer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Through a crevice he saw the entrance of a stout, good-natured-looking young man, whistling a popular song. He was probably a clerk or young mechanic, who, after a hard day\u0027s work, had been to some cheap place of amusement. Wholly unconscious of Jasper\u0027s presence, the young man undressed himself, still continuing to whistle, and got into bed. It was so light outside that he had not lighted the gas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder how long it\u0027ll take for him to get to sleep?\" thought Jasper. \"I\u0027m getting tired of being cooped up here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unfortunately for him the young man seemed to be in no hurry. He whistled to himself, and occasionally sung in a low tone. At length Jasper decided to make a desperate move. Observing that the young man was lying with his face turned from the wardrobe, he seized his opportunity, stepped softly out, and gained the middle of the floor before he was seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The effect upon the young man was startling. The whistle died away, and with blanched cheeks and staring eyes he sat bolt upright in bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Lord!\" he exclaimed, tremulously. \"What are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not a word escaped from the white figure, but it solemnly waved its hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you a ghost?\" asked the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasper made a guttural noise and waved his arm again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Lord preserve me!\" ejaculated the young man, shaking with terror. \"Go away, do, good ghost! I haven\u0027t done anything!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he covered up his head with the bedclothes, and Jasper could see by the convulsive movements that he was in a state of the greatest agitation. Our hero felt inclined to laugh, but forebore. He considered whether it would be safe, disguised as he was, to make his way down stairs and out at the front door. But another course suddenly suggested itself. The young man looked good-natured. Why shouldn\u0027t he reveal himself to him, and throw himself upon him for protection? Besides, he was sorry to frighten him so much.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Acting upon his new resolution, he threw off the sheet and said in his natural voice:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be frightened. I am not a ghost.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man in bed took courage to uncover his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ain\u0027t you a spirit?\" he said, doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No more than you,\" said Jasper, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made you frighten me so? Who are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a friend of yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think I ever saw you before. How did you get in?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Through the window.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You ain\u0027t a burglar, are you?\" asked the young man, with fresh apprehension.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course not,\" said Jasper, laughing. \"Do I look like a burglar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; but I don\u0027t see what made you come in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fact is, I want you to help me,\" said Jasper. \"Just light the gas, and I\u0027ll tell you all about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He spoke so frankly and straightforwardly that the young man was reassured. He got out of bed and lighted the gas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There! do I look like a burglar?\" asked Jasper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, you don\u0027t; but I don\u0027t see how you got in.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll tell you. I\u0027ve just escaped from the next house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Escaped?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I was locked up in a dark room for four days, and the only way I could get out was through the roof. Of course I couldn\u0027t slide off into the street and break my neck, so I got in here through the window.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say!\" ejaculated the young man. \"What did they shut you up for? Was it your father?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. It\u0027s a long story. I knew something they were afraid I would tell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you going to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to ask you to let me out into the street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! so late as this? You would have to stay out all night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That would be better than to be locked up as I have been for the last four days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose you wait till morning. This bed is big enough for both of us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. I should like that, and shall be much obliged to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are sure you are not a burglar?\" said the young man, with a brief return of his former suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Neither burglar nor ghost,\" said Jasper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What made you put on the sheet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was afraid you would take me for a burglar, so I meant to frighten you and escape, concluding that you would be afraid to pursue me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so. I really thought you were a spirit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you think so now, just feel my muscle,\" said Jasper, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think so now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I am to sleep with you, here is your sheet. We can make better use of it than in masquerading as ghosts.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasper undressed himself and got into bed. He learned that his companion\u0027s name was Adam Diedrich, and that he kept a small cigar store near-by.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2967/81692.html","bookId":378,"creation":"Aug 2, 2019 8:35:08 PM","modification":"Aug 2, 2019 8:35:08 PM"}
