{"id":23962,"no":31,"title":"CHAPTER XXXI. THE UNWELCOME RELATIVE.","content":"\u0026nbsp;Now that Jasper has found a place we can venture to leave him for a time and go back to the home which he had felt compelled to leave. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His step-mother felt relieved by his departure. It left her mistress of the situation, with no one to interfere with or question her authority. How Jasper fared she cared little, or not at all. How he was likely to get along without money she never inquired, nor did she feel a twinge of remorse for her treatment of one who had been her late husband\u0027s sole care and hope. It was enough for her that she had Nicholas with her. Stern as she generally was toward him, she was weakly indulgent. Whatever he wanted she gave him, if it were not utterly unreasonable. She was afraid he would tire of the country and want to go away, and this led her to gratify him in his wishes, in order that she might retain him at her side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas was not slow in finding out his power and in using it. He asked and obtained a horse for his own use, and later an elegant little carriage was ordered from the city, in which he used to drive around the neighborhood with the airs of a young prince. To others he might seem arrogant and conceited—to his mother he was only possessed of the proper spirit of a gentleman. In her eyes he was handsome, though in the eyes of no one else.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But perfect happiness is short-lived. In her new prosperity Mrs. Kent forgot that she had a brother who was not likely to reflect credit upon the family. She had not heard from him for years, and supposed he did not know where she was. But in this, as we know, she was mistaken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One day Nicholas was standing on the lawn in front of the house, waiting for his carriage to be brought around from the stable, when his attention was drawn to a common-looking man who was standing by the fence and looking at him in what he considered an impudently familiar way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Since Nicholas had become a young aristocrat he was easily made angry by such familiarity on the part of anyone of the lower orders, and he resented it at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why are you standing there, fellow?\" he demanded, frowning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The man neither seemed overawed nor angry. He only looked amused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I am tired of walking,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then go somewhere else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, this suits me very well,\" said the man, smiling provokingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t suit me, though,\" said Nicholas, bristling up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who are you?\" inquired Dick, for it was he, with provoking nonchalance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who am I? I\u0027ll let you know!\" retorted Nicholas, now very angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you would. That\u0027s what I just asked you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m the owner of this place, and I warn you off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you\u0027re the owner of this place!\" said the stranger, laughing. \"Do you own the road, too?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Nicholas, \"I own the road in front of my place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick laughed again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a young man, ain\u0027t you, to be a landed proprietor. How about your mother? Doesn\u0027t she own anything?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you know about my mother?\" demanded Nicholas, a little nonplussed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"More than you think for, young man,\" said Dick. \"She used to go to school with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did she? Well, I suppose she couldn\u0027t help it if there were low persons in the school with her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s good!\" said the stranger, laughing heartily. \"So I am a low person, am I?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You look like it,\" said Nicholas, insolently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He expected the man would be angry, but instead he laughed more heartily than before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas began to think he was crazy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, boy,\" he said, after a pause, \"just remember that appearances are sometimes deceitful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think they are so in this case,\" said Nicholas, \"but I can\u0027t waste anymore time with you. There\u0027s my horse coming around. I\u0027m going to ride.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that your team? It\u0027s very neat, \u0027pon my word.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s nothing to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you give me a seat? I\u0027ve never been in this town before, and I should like to take a drive.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, fellow, you\u0027ve got cheek!\" exclaimed Nicholas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have I?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think I would be seen in such low company?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not? I\u0027m a gentleman. If you are a gentleman, then I am, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean? What have I to do with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A good deal,\" said the stranger. \"I am your uncle!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas gasped for breath. What! this low, common person his uncle? He would not credit it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a lie!\" he said. \"You are trying to humbug me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not so fast, nephew Nicholas,\" said Dick. \"You can\u0027t alter facts. I\u0027m your mother\u0027s brother. Didn\u0027t she ever tell you of your Uncle Dick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Uncle Dick! Nicholas did remember that his mother had named such a person, and the uncomfortable apprehension dawned upon him that the stranger\u0027s claim was well founded, after all. He kept silent, but flared at the stranger in a state of mental disturbance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you\u0027ve heard of me,\" said Dick, with a short laugh. \"Is your mother at home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe so,\" said Nicholas, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve come a long way to see her. Will you go in and tell her I am here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas was not overwilling to obey the person whom he had just called low, but he felt considerable curiosity as to whether the man was really his uncle, and this decided him to comply with his request.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will speak to my mother,\" he said. \"She will know whether you are what you claim to be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, she will know. I don\u0027t believe she has forgotten brother Dick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas sought and found his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, Nicholas, back so soon?\" she said, looking up from her sewing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, mother, I haven\u0027t started yet. There\u0027s a person down stairs who says he is my Uncle Dick, and he wants to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good heavens! is he here?\" exclaimed Mrs. Kent, in a tone of vexation. \"How in the world did he find me out?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it is he? He is a very common-looking person.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s kept low associates. Where is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Down on the lawn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tell him to come in. I suppose I shall have to see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may not be your brother after all,\" said Nicholas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am afraid it is. I can tell soon as I see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nicholas went down stairs in no very pleasant mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re to come in,\" he said, ungraciously. \"My mother will see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought so,\" said Dick, smiling complacently.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2967/81694.html","bookId":378,"creation":"Aug 2, 2019 8:35:08 PM","modification":"Aug 2, 2019 8:35:08 PM"}
