{"id":87513,"no":2,"title":"Page 2","content":"\u003cp\u003eI often wonder when Kiersten’s visiting, how she turned out the way she did. I have yet to actually meet Kiersten’s mother, but from what I’ve gathered, she’s definitely not ordinary. Kiersten is obviously smarter than most kids her age…even if it is in a strange way. The things that come out of her mouth make Kel and Caulder seem somewhat normal.\u003c/p\u003e\n\u003cp\u003e“Kiersten?” Eddie says. “Will you be my new best friend?”\u003c/p\u003e\n\u003cp\u003eLake grabs a french fry off her plate and throws it at Eddie, hitting her in the face with it. “That’s bullshit,” Lake says.\u003c/p\u003e\n\u003cp\u003e“Oh, go butterfly yourself,” Eddie says. She returns a fry in Lake’s direction.\u003c/p\u003e\n\u003cp\u003eI intercept the french fry, hoping this doesn’t result in another food fight like last week. I’m still finding broccoli everywhere. “Stop,” I say, dropping the French fry on the table. “If you two have another food fight in my house tonight, I’m kicking both of your butterflies!”\u003c/p\u003e\n\u003cp\u003eLake can see I’m serious about the food fight. She squeezes my leg under the table and changes the subject. “Suck and sweet time,” she says.\u003c/p\u003e\n\u003cp\u003e“Suck and sweet time?” Kiersten asks, confused.\u003c/p\u003e\n\u003cp\u003eKel fills her in. “It’s where you have to say your suck and your sweet of the day. The good and the bad. The high and the low. We do it every night at supper.”\u003c/p\u003e\n\u003cp\u003eKiersten nods as though she understands.\u003c/p\u003e\n\u003cp\u003e“I’ll go first,” Eddie says. “My suck today was registration. I got stuck in Monday, Wednesday, Friday classes. Tuesday and Thursdays were full.”\u003c/p\u003e\n\u003cp\u003eEveryone wants the Tuesday/Thursday schedules. The classes are longer, but it’s a fair trade only having to go twice a week, rather than three times.\u003c/p\u003e\n\u003cp\u003e“My sweet is meeting Kiersten, my new best friend,” Eddie says, glaring at Lake.\u003c/p\u003e\n\u003cp\u003eLake grabs another french fry and throws it at Eddie. Eddie ducks and the fry goes over her head. I take Lake’s plate from her and scoot it to the other side of me, out of her reach.\u003c/p\u003e\n\u003cp\u003eLake shrugs her shoulders and smiles at me. “Sorry.” She grabs a fry off my plate and puts it in her mouth.\u003c/p\u003e\n\u003cp\u003e“Your turn, Mr. Cooper,” Eddie says. She stills calls me that occasionally, usually when she’s trying to point out the fact that I’m being a “bore.”\u003c/p\u003e\n\u003cp\u003e“My suck was definitely registration, too. I got Monday, Wednesday, Friday.”\u003c/p\u003e\n\u003cp\u003eLake turns to me, upset. “What? I thought we were both doing Tuesday, Thursday classes.”\u003c/p\u003e\n\u003cp\u003e“I tried, Babe. They don’t offer my level courses on those days. I texted you.”\u003c/p\u003e\n\u003cp\u003eShe pouts. “Man, that really is a suck,” she says. “And I didn’t get your text. I can’t find my phone again.”\u003c/p\u003e\n\u003cp\u003eShe’s always losing her phone.\u003c/p\u003e\n\u003cp\u003e“What’s your sweet?” Eddie asks me.\u003c/p\u003e\n\u003cp\u003eThat’s easy. “My sweet is right now,” I say as I kiss Lake on the forehead.\u003c/p\u003e\n\u003cp\u003eKel and Caulder both groan. “Will, that’s your sweet every night,” Caulder says, annoyed.\u003c/p\u003e\n\u003cp\u003e“My turn,” Lake says. “Registration was actually my sweet. I haven’t figured out the statistics yet, but my other four classes were exactly what I wanted.” She looks at Eddie and continues. “My suck was losing my best friend to an eleven-year-old.”\u003c/p\u003e\n\u003cp\u003eEddie laughs.\u003c/p\u003e\n\u003cp\u003e“I wanna go,” Kiersten says. No one objects. “My suck was having bread for dinner,” she says, eyeing her plate.\u003c/p\u003e\n\u003cp\u003eShe’s ballsy. I toss another slice of bread on her plate. “Maybe next time you show up uninvited to a carnivore’s house, you should bring your own fake meat.”\u003c/p\u003e\n\u003cp\u003eShe ignores my comment. “My sweet was three o\u0027clock.”\u003c/p\u003e\n\u003cp\u003e\"What happened at three o\u0027clock?\" Gavin asks.\u003c/p\u003e\n\u003cp\u003eKiersten shrugs her shoulders. \"School let out. I butterflying hate school.\"\u003c/p\u003e\n\u003cp\u003eAll three of the kids glance at each other, almost as if there’s an unspoken agreement between them. I make a mental note to talk to Caulder about it later. Lake nudges me with her elbow and shoots me a questioning glance, letting me know she\u0027s thinking the same thing.\u003c/p\u003e\n\u003cp\u003e“Your turn, whatever your name is,” Kiersten says to Gavin.\u003c/p\u003e\n\u003cp\u003e“It’s Gavin. And my suck would have to be the fact that an eleven-year-old has a larger vocabulary than me,” he says, smiling at Kiersten. “My sweet today is sort of a surprise.” He looks at Eddie and waits for her response.\u003c/p\u003e\n\u003cp\u003e“What?” Eddie says.\u003c/p\u003e\n\u003cp\u003e“Yeah, what?” Lake adds.\u003c/p\u003e\n\u003cp\u003eI’m curious, too. Gavin just leans back in his seat with a smile on his face, waiting for us to guess.\u003c/p\u003e\n\u003cp\u003eEddie gives him a shove. “Tell us!” she says.\u003c/p\u003e\n\u003cp\u003eHe leans forward in his chair and slaps his hands on the table. “I got a job! At Getty’s, delivering pizza!”\u003c/p\u003e\n\u003cp\u003eHe looks happy for some reason.\u003c/p\u003e\n\u003cp\u003e“That’s your sweet? You’re a pizza delivery guy?” Eddie asks. “That’s more like a suck.”\u003c/p\u003e\n\u003cp\u003e“You know I’ve been looking for a job. And it’s Getty’s. We love Getty’s!”\u003c/p\u003e\n\u003cp\u003eEddie rolls her eyes. “Well, congratulations,” she says, unconvincingly.\u003c/p\u003e\n\u003cp\u003e“Do we get free pizza?” Kel asks.\u003c/p\u003e\n\u003cp\u003e“No, but we get a discount,” Gavin replies.\u003c/p\u003e\n\u003cp\u003e“That’s my sweet, then,” Kel says. “Cheap pizza!” Gavin looks pleased that someone is excited for him. “My suck today was Mrs. Brill,” Kel says.\u003c/p\u003e\n\u003cp\u003e“Oh lord, what’d she do?” Lake asks him. “Or better yet, what did you do?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t just me,” Kel says.\u003c/p\u003e\n\u003cp\u003eCaulder puts his elbow on the table and tries to hide his face from my line of sight.\u003c/p\u003e\n\u003cp\u003e“What did you do, Caulder?” I ask him. He brings his hand down and looks up at Gavin. Gavin puts his elbow on the table and shields his face from my line of sight as well. He continues to eat as he ignores my glare. “Gavin? What prank did you tell them about this time?”\u003c/p\u003e\n\u003cp\u003eGavin grabs two fries and throws them at Kel and Caulder. “No more! I’m not telling you any more stories. You two get me in trouble every time!” he says. Kel and Caulder laugh and throw the fries back at him.\u003c/p\u003e\n\u003cp\u003e“I’ll tell on them, I don’t mind,” Kiersten says. “They got in trouble at lunch. Mrs. Brill was on the other side of the cafeteria and they were thinking of a way to get her to run. Everyone says she waddles like a duck when she runs, and we wanted to see it. So Kel pretended he was choking and Caulder made a huge spectacle and got behind him and started beating on his back, pretending he was giving him the Heimlich maneuver. It freaked Mrs. Brill out! When she got to our table, Kel said he was all better. He told Mrs. Brill that Caulder saved his life. It would have been fine, but she had already told someone to call 911. Within minutes, two ambulances and a fire truck showed up to the school. One of the boys at the next table told Mrs. Brill they were faking the whole thing, so Kel got called to the office.”\u003c/p\u003e\n\u003cp\u003eLake leans forward and glares at Kel. “Please tell me this is a joke.”\u003c/p\u003e\n\u003cp\u003eKel looks up at her with an innocent look across his face. “It was a joke. I really didn’t think anyone would call 911. Now I have to spend all next week in detention.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t Mrs. Brill call me?” Lake asks him.\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure she did,” he says. “You can’t find your phone, remember?”\u003c/p\u003e\n\u003cp\u003e“Ugh! If she calls me in for another conference, you’re grounded!”\u003c/p\u003e\n\u003cp\u003eI look at Caulder and he’s attempting to avoid my gaze. “Caulder, what about you? Why didn’t Mrs. Brill try to call me?”\u003c/p\u003e\n\u003cp\u003eHe turns toward me and gives me a mischievous grin. “Kel lied for me. He told her I really thought he was choking and that I was trying to save his life,” he says. “Which brings me to my sweet for the day. I was rewarded for my heroic behavior. Mrs. Brill gave me two free study hall passes.”\u003c/p\u003e\n\u003cp\u003eOnly Caulder could find a way to avoid detention and get rewarded instead. “You two need to cut that crap out,” I say to them. “And Gavin, no more prank stories.”\u003c/p\u003e\n\u003cp\u003e“Yes, Mr. Cooper,” Gavin says sarcastically. “But I have to know,” he says, looking at the kids. “Does she really waddle?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Kiersten laughs. “She’s a waddler, alright.” She looks at Caulder. “What was your suck, Caulder?”\u003c/p\u003e\n\u003cp\u003eCaulder gets a serious look on his face. “My best friend almost choked to death today. He could have died.”\u003c/p\u003e\n\u003cp\u003eWe all laugh. As much as Lake and I try to do the responsible thing by them, sometimes it’s hard to draw the line between being the rule enforcer and being the sibling. We choose which battles to pick with the boys, and Lake says it’s important that we don’t choose very many. I look at her and she’s laughing, so I assume this isn’t one she wants to fight tonight.\u003c/p\u003e\n\u003cp\u003e“Can I finish my food now?” Lake says, pointing to her plate that’s still on the other side of me, out of her reach. I scoot the plate back in front of her. “Thank you, Mr. Cooper,” she says.\u003c/p\u003e\n\u003cp\u003eI knee her under the table. She knows I hate it when she calls me that. I don’t know why it still bothers me so much. Probably because when I actually was her teacher, it was absolute torture. Our connection progressed so quickly that first night I took her out. I’d never met anyone I had so much fun just being myself with. I spent the entire weekend thinking about her. The moment I walked around the corner and saw her standing in the hallway in front of my classroom, it felt like my heart was ripped right out of my chest. I knew immediately what she was doing there, even though it took her a little while longer to figure it out. When she finally realized I was a teacher, the look in her eyes absolutely devastated me. She was hurt. Heartbroken. Just like me. One thing I know for sure, I never want to see that look in her eyes again.\u003c/p\u003e\n\u003cp\u003eKiersten stands up and takes her plate to the sink. “I have to go. Thanks for the bread, Will,” she says sarcastically. “It was delicious.”\u003c/p\u003e\n\u003cp\u003e“I’m leaving, too. I’ll walk you home,” Kel says. He jumps out of his seat and follows her to the door. I look at Lake and she rolls her eyes. It bothers her that Kel has developed his first crush. Lake doesn’t like to think that we’re about to have to deal with teenage hormones.\u003c/p\u003e\n\u003cp\u003eCaulder gets up from the table. “I’m gonna watch TV in my room,” he says. “See you later, Kel. Bye Kiersten.” They both tell him bye as they leave.\u003c/p\u003e\n\u003cp\u003e“I really like that girl,” Eddie says after Kiersten leaves. “I hope Kel asks her to be his girlfriend. I hope they grow up and get married and have lots of weird babies. I hope she’s in our family forever.”\u003c/p\u003e\n\u003cp\u003e“Shut up, Eddie,” Lake says. “He’s only ten. He’s too young for a girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Not really, he’ll be eleven in eight days,” Gavin says. “Eleven is the prime age for first girlfriends.”\u003c/p\u003e\n\u003cp\u003eLake takes an entire handful of her fries and throws them toward Gavin’s face.\u003c/p\u003e\n\u003cp\u003eI just sigh. She’s impossible to control. “You’re cleaning up tonight,” I say to her. “You too,” I say to Eddie. “Gavin, let’s go watch some football like real men while the women do their job.” \u003c/p\u003e","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-2.html","bookId":2780,"creation":"Oct 5, 2019 5:23:10 PM","modification":"Oct 5, 2019 5:23:10 PM"}
