{"id":87532,"no":21,"title":"Page 21","content":"\u003cp\u003e“I…I was just…”\u003c/p\u003e\n\u003cp\u003e“I’m kidding,” she laughs, walking toward me.\u003c/p\u003e\n\u003cp\u003eI shoot her a dirty look for almost giving me a heart attack and turn back around to push the pot back into its original position. “I needed some things out of her house,” I say, without going into detail. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“Not much,” she says. She has a shovel in her hands and I glance behind her to see part of Lake’s sidewalk cleared. “I’m just wasting time…waiting on my husband to get home. We\u0027ve got errands to run.”\u003c/p\u003e\n\u003cp\u003eI cock my head at her. “You have a husband?” I ask with a little too much fervor. I don’t mean to sound surprised, but I am. I’ve never seen him before.\u003c/p\u003e\n\u003cp\u003eShe laughs at my response. “No, Will. My children are the result of immaculate conception.”\u003c/p\u003e\n\u003cp\u003eI laugh. She’s got a great sense of humor. It reminds me of my mother’s. And Julia’s. And Lake’s. How was I so lucky to be surrounded by such amazing women?\u003c/p\u003e\n\u003cp\u003e“Sorry,” I say. “It’s just that I’ve never seen him before.”\u003c/p\u003e\n\u003cp\u003e“He works a lot. Mostly out of state…goes on business trips and the like. He’s home for two weeks. I’d really like you to meet him.”\u003c/p\u003e\n\u003cp\u003eI don’t like that we’re standing in front of Lake’s house. She’ll be home soon. I start walking away from the house as I respond. “Well, if Kel and Kiersten get married someday, we’ll technically be in-laws, so I guess I should meet him.”\u003c/p\u003e\n\u003cp\u003e“That’s assuming you and Kel have a different type of relationship by then,” she says. “Are you planning on popping the question?” She begins walking with me toward her house. I think she can sense I just want to be off of Lake’s property before they return home.\u003c/p\u003e\n\u003cp\u003e“I’d planned on it,” I say. “I’m just not so sure now what Lake’s answer would be.”\u003c/p\u003e\n\u003cp\u003eSherry turns around and tilts her head, then sighs. She’s looking at me with pity again. “Come inside for a sec. I want to show you something.”\u003c/p\u003e\n\u003cp\u003eI continue to follow her into her house. “Sit down on the couch,” she says. “Do you have a few minutes?”\u003c/p\u003e\n\u003cp\u003e“I’ve got more than a few.”\u003c/p\u003e\n\u003cp\u003eShe walks down the hallway and returns a moment later with a DVD in her hands. After she inserts it into the DVD player, she sits down on the couch beside me and turns the television on with the remote.\u003c/p\u003e\n\u003cp\u003e“What is it?” I ask.\u003c/p\u003e\n\u003cp\u003e“A close-up of me giving birth to Kiersten.”\u003c/p\u003e\n\u003cp\u003eI jump up in protest and she rolls her eyes and laughs. “Sit down, Will. I’m kidding.”\u003c/p\u003e\n\u003cp\u003eI reluctantly sit back down. “That’s not funny,” I say.\u003c/p\u003e\n\u003cp\u003eShe presses play on the remote and the television is interrupted by a brief second of static, then cuts to a shot of a much younger Sherry. She looks about nineteen or twenty in the footage. She’s sitting on a porch swing laughing, hiding her face from the video camera with her hands. The person holding the camera is laughing, too. I assume it’s her now-husband. When he walks up the porch steps, he angles the camera around and sits beside her, focusing the lens on both of them. Sherry uncovers her face and leans her head against his and smiles.\u003c/p\u003e\n\u003cp\u003e“Why are you filming us, Jim?” Sherry says to the camera.\u003c/p\u003e\n\u003cp\u003e“Because. I want you to remember this moment forever,” he says.\u003c/p\u003e\n\u003cp\u003eThe camera shuffles again and comes to a rest on what is probably a table. It’s positioned on both of them now as he kneels down in front of her and places his hands by her side. It’s obvious he’s about to propose, but you can see Sherry attempt to suppress her excitement, in case that’s not his intention. When he pulls a small box out of his pocket, she gasps and immediately starts to cry. He brings his hand up to her face and wipes away her tears, then briefly leans forward and kisses her.\u003c/p\u003e\n\u003cp\u003eWhen he settles back onto his knee, he wipes a tear away from his own eyes. “Sherry, until I met you I didn’t know what life was. I had no clue that I wasn’t even alive. It’s like you came along and woke up my soul.\" He\u0027s looking straight at her as he talks. He doesn\u0027t sound nervous at all, like he\u0027s determined to prove to her how serious he is. He takes a deep breath and then continues. \"I’ll never be able to give you everything you deserve, but I’ll definitely spend the rest of my life trying.”\u003c/p\u003e\n\u003cp\u003eHe pulls the ring out of the box and slides it on her finger. “I’m not asking you to marry me, Sherry. I’m telling you to marry me, because I can’t live without you.”\u003c/p\u003e\n\u003cp\u003eSherry wraps her arms around his neck and they hold onto one another and cry. “Okay,” she finally says. When they begin to kiss, his hand reaches over and turns off the camera.\u003c/p\u003e\n\u003cp\u003eThe television goes black.\u003c/p\u003e\n\u003cp\u003eSherry presses the power button on the remote and she’s silent for a moment. I can tell the video brought back a lot of emotions in her. “What you saw in that video?” she says. “The connection Jim and I had? That’s true love, Will. I’ve seen you and Layken together, and she loves you like that. She really does.”\u003c/p\u003e\n\u003cp\u003eThe front door to Sherry’s house opens wide and a man enters, shaking the snow out of his hair. Sherry looks nervous as she hops up and hits eject on the DVD player and puts it back inside the case.\u003c/p\u003e\n\u003cp\u003e“Hey, Sweetie,” she says to him. She motions for me to stand up, so I do. “This is Will,” she says. “He’s Caulder’s older brother from across the street.”\u003c/p\u003e\n\u003cp\u003eThe man walks through the living room and I reach my hand out to him. As soon as I’m eye to eye with him, Sherry’s sudden nervousness is explained. This isn\u0027t Jim. This is a completely different man than whoever it was I just saw propose to Sherry on that DVD.\u003c/p\u003e\n\u003cp\u003e“I\u0027m David. Nice to meet you. Heard a lot about you.”\u003c/p\u003e\n\u003cp\u003e“Likewise,” I say. I’m lying.\u003c/p\u003e\n\u003cp\u003e“I’ve been giving Will relationship advice,” Sherry says.\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” he says. He smiles at me. “Hopefully you take it with a grain of salt, Will. Sherry thinks she’s a real guru.” He leans in and kisses Sherry on the cheek.\u003c/p\u003e\n\u003cp\u003e“Well, she is pretty smart,” I say.\u003c/p\u003e\n\u003cp\u003e“That she is,\" he says as he takes a seat on the couch. \"But take it from me…never accept any of her medicinal concoctions. You’ll regret it.”\u003c/p\u003e\n\u003cp\u003eToo late for that.\u003c/p\u003e\n\u003cp\u003e“I better get going,” I say. “Nice meeting you, David.”\u003c/p\u003e\n\u003cp\u003e“I’ll walk you out,” Sherry says.\u003c/p\u003e\n\u003cp\u003eOnce we’re outside, her smile fades after she shuts the door behind her.\u003c/p\u003e\n\u003cp\u003e“You need to know that I love my husband, Will. But there are very few people in this world lucky enough to experience love on the same level that I’ve had in the past…on the same level that you and Layken have. I’m not getting into the details of why mine didn’t work out, but take it from someone who’s had it before…you don’t want to let it slip away. Fight for her.”\u003c/p\u003e\n\u003cp\u003eShe steps back inside her house and shuts the door.\u003c/p\u003e\n\u003cp\u003e“That’s what I’m trying to do,” I whisper.\u003c/p\u003e\n\u003cp\u003e\"Can we have pizza tonight?\" Caulder says as soon as he walks through the front door. \"It\u0027s Tuesday. Gavin can get us the Tuesday special that comes with the dessert pizza.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever. I don\u0027t feel like cooking, anyway.\" I text Gavin and offer to buy them pizza if he\u0027ll bring it over when he gets off work.\u003c/p\u003e\n\u003cp\u003eBy the time eight o\u0027clock comes around, I\u0027ve got a houseful. Kiersten and Kel showed up at some point. Gavin and Eddie walk in with the pizza and we all sit down at the table to eat. The only one missing is Lake.\u003c/p\u003e\n\u003cp\u003e\"Should you invite Lake?\" I ask Eddie as I toss a pile of paper plates onto the table.\u003c/p\u003e\n\u003cp\u003eEddie looks at me and shakes her head. \"I just texted her. She said she\u0027s not hungry.\"\u003c/p\u003e\n\u003cp\u003eI sit down to the table and grab one of the paper plates and toss a slice onto it. I take a bite and drop the pizza back down onto the plate. I\u0027m suddenly not hungry, either.\u003c/p\u003e\n\u003cp\u003e\"Thanks for bringing me a cheese pizza, Gavin,\" Kiersten says. \"At least someone around here respects the fact that I don\u0027t eat meat.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t have anything to throw at her or I would. I shoot her a dirty look instead.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the plan of attack for Thursday?\" Kiersten asks me.\u003c/p\u003e\n\u003cp\u003eI glance at Eddie and she\u0027s looking right at me. \"What\u0027s Thursday?\" Eddie says.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I reply. I don\u0027t want Eddie ruining this. I\u0027m afraid she\u0027ll go warn Lake.\u003c/p\u003e\n\u003cp\u003e\"Will, if you think I\u0027ll tell her whatever it is you\u0027re planning to do, you\u0027re wrong. No one wants you two to work things out more than I do, believe me.\" She takes a bite of her pizza. She seems genuinely serious, although I\u0027m not sure why.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s doing a slam for her,\" Kiersten blurts out.\u003c/p\u003e\n\u003cp\u003eEddie looks back up at me. \"Seriously? How? You aren\u0027t gonna be able to talk her into going.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t have to,\" Kiersten says. \"I talked her into going.\"\u003c/p\u003e\n\u003cp\u003eEddie looks at Kiersten and grins at her. \"You\u0027re a sly little thing. And just how are you planning to keep her there?\" Eddie looks back at me. \"As soon as she sees you on that stage she\u0027ll get pissed and leave.\"\u003c/p\u003e\n\u003cp\u003e\"Not if I steal her purse and keys,\" Kel says.\u003c/p\u003e\n\u003cp\u003e\"Good idea, Kel!\" I say. As soon as I say it, the reality of the moment hits me. I\u0027m sitting here praising eleven-year-olds for stealing and lying to my girlfriend. What kind of role model am I?\u003c/p\u003e\n\u003cp\u003e\"And we can sit in that booth we sat in last time,\" Caulder says. \"We\u0027ll make sure Lake gets in first, that way we can trap her in. Once you start doing your slam, she won\u0027t be able to get up. She\u0027ll have to watch you.\"\u003c/p\u003e\n\u003cp\u003e\"Great idea,\" I say. I may not be a role-model, but at least I\u0027m raising smart children.\u003c/p\u003e\n\u003cp\u003e\"I want to go,\" Eddie says. She turns to Gavin. \"Can we go? Aren\u0027t you off Thursday? I want to watch Will and Layken make up.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, we can go. But how are we all getting there if she doesn\u0027t know you\u0027re going, Will? We can\u0027t all fit in Layken\u0027s car. I really don\u0027t need to be driving all the way to Detroit in mine after all the deliveries I\u0027ve been making.\"\u003c/p\u003e\n\u003cp\u003e\"You can ride with me,” I say. “Eddie can tell Lake you\u0027re working or something. Everyone else can ride with Lake.\"\u003c/p\u003e\n\u003cp\u003eEveryone seems to agree on the plans. The fact that they all seem determined to help me win her back gives me a sense of hope. If everyone in this room can see how much we need to be together, surely Lake will see it, too.\u003c/p\u003e\n\u003cp\u003eI grab another plate and throw three slices of pizza on it, then take it to the kitchen. I glance over my shoulder to make sure no one is paying attention. I reach into the cabinet and pull out a star and set it under one of the slices of pizza before I wrap it.\u003c/p\u003e\n\u003cp\u003e\"Eddie, will you take this to Lake? Make sure she eats something?\"\u003c/p\u003e\n\u003cp\u003eEddie grabs the plate and smiles at me, then walks out the front door.\u003c/p\u003e\n\u003cp\u003e\"Kids, clean the table. Put the pizza back in the fridge,\" I say. Gavin and I walk to the living room and sit on the couch.\u003c/p\u003e\n\u003cp\u003eHe lays on the couch and rests his head on the arm of it. He pinches his forehead with his hand and closes his eyes.\u003c/p\u003e\n\u003cp\u003e\"Headache?\" I say.\u003c/p\u003e\n\u003cp\u003eHe shakes his head. \"Stress.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-21.html","bookId":2780,"creation":"Oct 5, 2019 5:23:10 PM","modification":"Oct 5, 2019 5:23:10 PM"}
