{"id":87544,"no":33,"title":"Page 33","content":"\u003cp\u003eWhen the three of us get back to the gymnasium, we go to Caulder’s table and take a seat. We aren’t seated for two minutes when Mrs. Brill marches up with a scowl on her face. Right before she opens her mouth to say something, I stand up and reach my hand out to her. “Mrs. Brill,” I say with a smile. “It’s so good of you for letting Kiersten and the boys eat with me today. It really means a lot that you recognize the fact that there are families in this world with non-traditional situations. I love these kids like they’re my own. The fact that you respect our relationship even though I’m not a typical father really says a lot about your character. So I just wanted to say thank you.”\u003c/p\u003e\n\u003cp\u003eMrs. Brill lets go of my hand and steps back. She eyes Kiersten and Kel, then looks back at me. “You’re welcome,” she says. “Hope you all enjoy the luncheon.” She turns and walks away without another word.\u003c/p\u003e\n\u003cp\u003e“Well,” Kel says. “That was definitely my sweet.”\u003c/p\u003e\n\u003cp\u003eThursday, February 16th, 2012\u003c/p\u003e\n\u003cp\u003eOne more day…\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003e“So what’s the damage?” Lake asks Dr. Bradshaw.\u003c/p\u003e\n\u003cp\u003e“To what? You?” He laughs as he slowly unwraps the bandage from around her head.\u003c/p\u003e\n\u003cp\u003e“To my hair,” she says. “How much did you chop off?”\u003c/p\u003e\n\u003cp\u003e“Well,” he says. “We did have to cut through your skull, you know. We tried to save as much hair as we could, but we were faced with a pretty tough decision…it was either your hair or your life.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “Well I guess I’ll forgive you, then.”\u003c/p\u003e\n\u003cp\u003eAs soon as we get home from the doctor, she heads straight for the shower to wash her hair. She’s been dying to wash her hair. I’m pretty comfortable with leaving her home now, so I go pick up the boys. I forgot they were staying an hour after school, so I text Lake to let her know I’ll be late. The school talent show is tomorrow night and the students who signed up to perform get to stay and practice. Kiersten and Caulder both signed up, but neither of them are giving us hints as to what they’re doing. I’ve given Kiersten copies of all my poems. She says she needed them for research. I didn’t argue. There’s just something about Kiersten you don’t argue with.\u003c/p\u003e\n\u003cp\u003eWhen the boys and I finally get home, Lake is still in the bathroom. I know she’s tired of me babying her, but I check on her anyway. The fact that she’s been in there so long worries me. When I knock on the door, she tells me to go away. She doesn’t sound happy, which just means I’m not going away.\u003c/p\u003e\n\u003cp\u003e“Lake open the door,” I say. I jiggle the door knob but it’s locked.\u003c/p\u003e\n\u003cp\u003e“Will, I just need a minute,” she sniffs.\u003c/p\u003e\n\u003cp\u003eShe’s crying.\u003c/p\u003e\n\u003cp\u003e“Lake. Open the door!” I’m really worried now. I know how stubborn she is and if she hurt herself she’s probably trying to hide it. I beat on the door and shake the door knob again.\u003c/p\u003e\n\u003cp\u003eIt’s quiet. She doesn’t respond. “Lake!” I yell.\u003c/p\u003e\n\u003cp\u003eThe door knob turns and the door slowly opens. She’s staring down at the floor, crying. “I’m okay,” she says. She wipes at her eyes with a wad of toilet paper. “You really need to quit freaking out, Will.”\u003c/p\u003e\n\u003cp\u003eI step into the bathroom and hug her. “Why are you crying?”\u003c/p\u003e\n\u003cp\u003eShe pulls away from me and shakes her head, then sits down on the seat in front of the bathroom mirror. “It’s stupid,” she says.\u003c/p\u003e\n\u003cp\u003e“Are you in pain? Does your head hurt?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head and wipes at her eyes again. She brings her arm up and pulls the rubber band out of her hair and it falls down over her shoulder. “It’s my hair.”\u003c/p\u003e\n\u003cp\u003eHer hair. She’s crying about her damn hair! I breathe a sigh of relief. “It’ll grow back, Lake. It’s okay.” I walk around behind her and pull her hair away from her shoulders to her back. She’s got an area on the back of her head that’s been shaved. It can’t be covered up, because it’s smack dab in the middle of her hair. I run my fingers over it. “I think you would look cute with short hair. Wait ‘till it grows out some more and you can get it cut.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “That’ll take forever. I’m not going anywhere like this. I’m not leaving this house for another month,” she says.\u003c/p\u003e\n\u003cp\u003eI know she doesn’t mean it, but I still hate that she’s so upset. “I think it’s beautiful,” I say, running my fingers over her scar. “It’s what saved your life.” I reach around her and open the cabinet doors underneath the sink.\u003c/p\u003e\n\u003cp\u003e“What are you doing? You aren’t cutting the rest of my hair off, Will.”\u003c/p\u003e\n\u003cp\u003eI reach inside and pull out the black box that contains my hair trimmers. “I’m not cutting your hair,” I say. I plug in the cord and take off the guard and turn it on. I reach behind my head and press it against the back of my hair and make a quick swipe. When I bring it back around, I pull the pieces of my hair out and toss them in the trashcan.\u003c/p\u003e\n\u003cp\u003e“There. Now we match,” I say.\u003c/p\u003e\n\u003cp\u003eShe swings around in her seat. “Will! What the hell? Why’d you just do that?”\u003c/p\u003e\n\u003cp\u003e“It’s just hair, Babe.” I smile at her.\u003c/p\u003e\n\u003cp\u003eShe brings her wad of toilet paper back up to her eyes and turns back around, looking at our reflection in the mirror. She shakes her head and laughs.\u003c/p\u003e\n\u003cp\u003e“You look ridiculous,” she says.\u003c/p\u003e\n\u003cp\u003e“So do you.”\u003c/p\u003e\n\u003cp\u003eOther than going to the doctor yesterday, tonight is Lake’s first time out of the house. After the talent show, Sherry is watching the boys for a few hours so we can have a date. Of course, Lake got upset when I told her about our date. “You never ask me, you always tell me,” she whined. So of course I had to get down on my knee and ask her out. And of course, I’m keeping her in the dark again. She has no clue what I have planned for tonight. No clue.\u003c/p\u003e\n\u003cp\u003eEddie and Gavin are already inside with Sherry and David when we arrive. I let Lake sit next to Eddie and I take the seat next to Sherry. Lake was able to pull her hair back into a ponytail and hide most of her scar. I’m not so lucky.\u003c/p\u003e\n\u003cp\u003e“Ummm…Will? Is this some sort of new trend I’m not aware of?” Sherry asks when she sees my hair.\u003c/p\u003e\n\u003cp\u003eLake laughs. “See? You look ridiculous.”\u003c/p\u003e\n\u003cp\u003eSherry leans into me and whispers. “Can you give me a hint as to what Kiersten’s doing tonight?”\u003c/p\u003e\n\u003cp\u003eI shrug. “I don’t know what she’s doing. I’m assuming it’s a poem. She didn’t read it to you guys?”\u003c/p\u003e\n\u003cp\u003eSherry and David both shake their heads. “She’s been pretty secretive about it,” David says.\u003c/p\u003e\n\u003cp\u003e“So has Caulder,” I say. “And I have no idea what he’s up to. I don’t even think he has a talent.”\u003c/p\u003e\n\u003cp\u003eThe curtain opens and Principal Brill walks up to the microphone and does her introductions to kick off the evening. With every child that performs, there’s a different parent holding a video camera at the front of the audience. Why didn’t I bring my camera? I’m an idiot. A real parent would have brought a camera. Right when Kiersten is finally called to the stage, Lake reaches inside her purse and pulls out a camera. Of course she does.\u003c/p\u003e\n\u003cp\u003ePrincipal Brill introduces Kiersten, then walks off the stage. Kiersten doesn’t look nervous at all. She really is a miniature version of Eddie. There’s a small sack draped over her wrist with the cast. She lifts her good arm to lower the microphone.\u003c/p\u003e\n\u003cp\u003e“I’m doing something tonight called a slam. It’s a type of poetry that I was introduced to this year by a friend of mine. Thank you, Will.”\u003c/p\u003e\n\u003cp\u003eI smile.\u003c/p\u003e\n\u003cp\u003eKiersten takes a deep breath and says, “My poem tonight is called ‘Butterfly you.’”\u003c/p\u003e\n\u003cp\u003eLake and I both look at each other. I know she’s thinking the same thing I’m thinking, which is, “Oh, no.”\u003c/p\u003e\n\u003cp\u003e“Butterfly.\u003c/p\u003e\n\u003cp\u003eWhat a beautiful word\u003c/p\u003e\n\u003cp\u003eWhat a delicate creature.\u003c/p\u003e\n\u003cp\u003eDelicate like the cruel words that flow right out of your mouths\u003c/p\u003e\n\u003cp\u003eand the food that flies right out of your hands…\u003c/p\u003e\n\u003cp\u003eDoes it make you feel better?\u003c/p\u003e\n\u003cp\u003eDoes it make you feel good ?\u003c/p\u003e\n\u003cp\u003eDoes picking on a girl make you more of a man?\u003c/p\u003e\n\u003cp\u003eWell, I’m standing up for myself\u003c/p\u003e\n\u003cp\u003eLike I should have done before\u003c/p\u003e\n\u003cp\u003eI’m not putting up with your\u003c/p\u003e\n\u003cp\u003eButterfly anymore.”\u003c/p\u003e\n\u003cp\u003e(Kiersten slides the sack off her wrist and opens it, pulling out a handful of hand-made butterflies. She takes the microphone out of the stand and begins walking down the stairs as she continues speaking.)\u003c/p\u003e\n\u003cp\u003e“I’d like to extend to others what others have extended to me.”\u003c/p\u003e\n\u003cp\u003e(She walks up to Mrs. Brill first and holds out a butterfly)\u003c/p\u003e\n\u003cp\u003e“Butterfly you, Mrs. Brill.”\u003c/p\u003e\n\u003cp\u003e(Mrs. Brill smiles at her and takes the butterfly out of her hands. Lake laughs out loud and I have to nudge her to get her to be quiet. Kiersten walks around the room, passing out butterflies to several of the students, including the three from the lunchroom.)\u003c/p\u003e\n\u003cp\u003e“Butterfly you, Mark.\u003c/p\u003e\n\u003cp\u003eButterfly you, Brendan.\u003c/p\u003e\n\u003cp\u003eButterfly you, Colby.”\u003c/p\u003e\n\u003cp\u003e(When she finishes passing out the butterflies, she walks back onto the stage and places the microphone back into the stand.)\u003c/p\u003e\n\u003cp\u003e“I have one thing to say to you\u003c/p\u003e\n\u003cp\u003eAnd I’m not referring to the bullies\u003c/p\u003e\n\u003cp\u003eOr the ones they pursue.\u003c/p\u003e\n\u003cp\u003eI’m referring to those of you that just stand by\u003c/p\u003e\n\u003cp\u003eThe ones who don’t take up for those of us that cry\u003c/p\u003e\n\u003cp\u003eThose of you who just…turn a blind eye.\u003c/p\u003e\n\u003cp\u003eAfter all it’s not you it’s happening to\u003c/p\u003e\n\u003cp\u003eYou aren’t the one being bullied\u003c/p\u003e\n\u003cp\u003eAnd you aren’t the one being rude\u003c/p\u003e\n\u003cp\u003eIt isn’t your hand that’s throwing the food\u003c/p\u003e\n\u003cp\u003eBut…it is your mouth not speaking up\u003c/p\u003e\n\u003cp\u003eIt is your feet not taking a stand\u003c/p\u003e\n\u003cp\u003eIt is your arm not lending a hand\u003c/p\u003e\n\u003cp\u003eIt is your heart\u003c/p\u003e\n\u003cp\u003eNot giving a damn.\u003c/p\u003e\n\u003cp\u003eSo take up for yourself\u003c/p\u003e\n\u003cp\u003eTake up for your friends\u003c/p\u003e\n\u003cp\u003eI challenge you to be someone\u003c/p\u003e\n\u003cp\u003eWho doesn’t give in.\u003c/p\u003e\n\u003cp\u003eDon’t give in.\u003c/p\u003e\n\u003cp\u003eDon’t let them win.”\u003c/p\u003e\n\u003cp\u003eAs soon as ‘damn’ comes out of Kiersten’s mouth, Mrs. Brill is marching onto the stage. Luckily, Kiersten finishes her poem and rushes off the stage before Mrs. Brill reaches her. The audience is in shock. Well, most of the audience. Everyone on our row is giving her a standing ovation.\u003c/p\u003e\n\u003cp\u003eAs Mrs. Brill announces the next performance and we take our seats, Sherry whispers to me, “I didn’t get the whole ‘butterfly’ thing, but the rest of it was so good.”\u003c/p\u003e\n\u003cp\u003e“Yeah it was,” I agree. “It was butterflying excellent.”\u003c/p\u003e\n\u003cp\u003eCaulder is called onto the stage next. He looks nervous. I’m nervous for him. Lake’s nervous, too. I wish I knew what he was doing so I could have given him some advice before he got up there. Lake zooms the camera in and focuses it on Caulder. I take a deep breath, hoping he can get through it without cussing. Mrs. Brill already has her eye on us. Caulder walks to the microphone and introduces his talent.\u003c/p\u003e\n\u003cp\u003e“I’m Caulder. I’m also doing a slam tonight. It’s called ‘Suck and sweet.’”\u003c/p\u003e\n\u003cp\u003eOh no, here we go again.\u003c/p\u003e\n\u003cp\u003eI’ve had a lot of sucks in life\u003c/p\u003e\n\u003cp\u003eA lot\u003c/p\u003e\n\u003cp\u003eMy parents died almost four years ago, right after I turned seven \u003c/p\u003e","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-33.html","bookId":2780,"creation":"Oct 5, 2019 5:23:10 PM","modification":"Oct 5, 2019 5:23:10 PM"}
