{"id":87547,"no":36,"title":"Page 36","content":"\u003cp\u003e“Run,” I whisper. We both crawl out of the hotel room and pull ourselves up. I take her hand in mine and we run down the hallway until we find our room. I slide the key into the reader but before I open the door, she slips in front of me and faces me.\u003c/p\u003e\n\u003cp\u003e“Three more minutes,” she says. She reaches behind her and pulls down on the handle, swinging the door open. “Now carry me over the threshold, Husband.”\u003c/p\u003e\n\u003cp\u003eI bend down and grab her behind the knees and pick her up, throwing her over my shoulder. She squeals and I push the door open with her feet. I take a step and walk over the threshold with my wife.\u003c/p\u003e\n\u003cp\u003eThe door slams behind us and I ease her down onto the bed.\u003c/p\u003e\n\u003cp\u003e“I smell chocolate. And flowers,” she says. “Good job, Husband.”\u003c/p\u003e\n\u003cp\u003eI lift her leg up and slide her boot off. “Thank you, Wife.\" I lift her other leg up and slide that boot off, too. \"I also remembered the fruit. And the robes.”\u003c/p\u003e\n\u003cp\u003eShe winks at me and rolls over, scooting up onto the bed. When she gets settled, she leans forward and grabs my hand, pulling me toward her. “Come here, Husband,” she whispers.\u003c/p\u003e\n\u003cp\u003eI start to make my way up the bed, but pause when I come face to face with her shirt. “I wish you’d take this ugly thing off,” I say.\u003c/p\u003e\n\u003cp\u003e“You’re the one who hates it so much. You take it off.”\u003c/p\u003e\n\u003cp\u003eAnd so I do. I start from the bottom this time and press my lips against her skin where her stomach meets the top of her pants, causing her to squirm. She’s ticklish there. Good to know. I unbutton the next button and slowly move my lips up another inch to her belly button. I kiss it. She lets out another moan, but it doesn’t worry me this time. I continue kissing every inch of her until the ugly shirt is finally off and lying on the floor. When my lips find their way back to hers, I pause and look her in the eyes to ask her one last time.\u003c/p\u003e\n\u003cp\u003e“Wife? Are you sure you’re ready to not call retreat? Right now?”\u003c/p\u003e\n\u003cp\u003eShe wraps her legs around me and pulls me closer. “I’m butterflying positive,” she says.\u003c/p\u003e\n\u003cp\u003eAnd so we don’t.\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-36.html","bookId":2780,"creation":"Oct 5, 2019 5:23:10 PM","modification":"Oct 5, 2019 5:23:10 PM"}
