{"id":87518,"no":7,"title":"Page 7","content":"\u003cp\u003e“I could care less. We could stay here at my house for all I care. I’m just looking forward to being with you for three whole days. And finally getting to spend the night together…in the same bed, at least.”\u003c/p\u003e\n\u003cp\u003eI’m trying not to come off too eager, but next weekend is all I’ve been thinking about. She doesn’t need to know that I’ve actually got an internal countdown going constantly. Ten days and twenty-one more hours.\u003c/p\u003e\n\u003cp\u003e“Why don’t we do that?” I stop kissing her neck and look at her. “Let’s just stay here. Kel and Caulder will be in Detroit. We can lie to Eddie and Gavin and tell them we’re going away so they won’t stop by. We’ll pull the shades down and lock the doors and hole ourselves up for three whole days, right here in this bed. And in the shower too, of course.”\u003c/p\u003e\n\u003cp\u003e“Sounds bemazing,” she says. She likes to smoosh words together for more emphasis. I’m pretty sure bemazing is beautiful and amazing. I think it’s cute.\u003c/p\u003e\n\u003cp\u003e“Now back to the punishment,” she says. “What would our parents do?”\u003c/p\u003e\n\u003cp\u003eI honestly have no clue what my parents would do. If I had any clue, it wouldn’t be so hard coming up with solutions to all the problems that come along with raising kids.\u003c/p\u003e\n\u003cp\u003e“I don’t know what they would do. But I know what I want to do,” I say. “Let’s scare the butterfly out of them.”\u003c/p\u003e\n\u003cp\u003e“How?” she says.\u003c/p\u003e\n\u003cp\u003e“Act like you’re trying to calm me down. Act like I’m really pissed off. We can make them sit out there and sweat for a while.”\u003c/p\u003e\n\u003cp\u003eShe laughs. “You’re so bad.” She stands up and walks closer to the door. “Will! Calm down!” she yells.\u003c/p\u003e\n\u003cp\u003eI walk over to the door and hit it for extra emphasis. “I will not calm down! I’m PISSED!”\u003c/p\u003e\n\u003cp\u003eLake throws herself onto the bed and pulls a pillow over her face to stifle her giggles before she continues yelling. “No, stop it! You can’t go out there yet! You need to calm down, Will! You might KILL them!”\u003c/p\u003e\n\u003cp\u003eI glare at her. “Kill them?” I whisper. “Really?”\u003c/p\u003e\n\u003cp\u003eShe laughs as I hop back on the bed with her. “Lake, you suck at this.”\u003c/p\u003e\n\u003cp\u003e“Will, NO! Not the belt!” she yells dramatically.\u003c/p\u003e\n\u003cp\u003eI clasp my hand over her mouth. “Shut up!” I laugh.\u003c/p\u003e\n\u003cp\u003eWe give ourselves a few minutes to regain our composure before we exit the bedroom. When we walk down the hallway, I do my best to look intimidating. The boys are watching us with fear in their eyes as we take our seats across the bar from them.\u003c/p\u003e\n\u003cp\u003e“I’ll talk,” Lake says to them. “Will is entirely too upset right now to speak to either of you.”\u003c/p\u003e\n\u003cp\u003eI stare at them and don’t speak, putting on my best display of anger. I wonder if this is how parenting is with real parents? A bunch of ‘pretending’ to be responsible grown-ups.\u003c/p\u003e\n\u003cp\u003e“First of all,” Lake says in a very superbly-faked, motherly tone. “We would like to commend you both for defending your friend. However, you went about it all wrong. You should have spoken to someone about it. Violence is never the answer to violence,” she says.\u003c/p\u003e\n\u003cp\u003eI couldn’t have said it better if I was reading from a parenting handbook.\u003c/p\u003e\n\u003cp\u003e“You are both grounded for two weeks. And don’t think your suspension will be fun, either. We’re giving you both a list of chores to do every day. Including Saturday and Sunday.”\u003c/p\u003e\n\u003cp\u003eI tap my knee against hers under the bar, letting her know that was a nice touch.\u003c/p\u003e\n\u003cp\u003e“Do either of you have anything to say?” she asks.\u003c/p\u003e\n\u003cp\u003eKel raises his hand. “What about my birthday Friday?”\u003c/p\u003e\n\u003cp\u003eLake looks at me and I shrug my shoulders. She turns back toward Kel.\u003c/p\u003e\n\u003cp\u003e“You don’t have to be grounded on your birthday. But you’ll get an extra day of grounding. Anymore questions?”\u003c/p\u003e\n\u003cp\u003eNeither of them says anything.\u003c/p\u003e\n\u003cp\u003e“Good. Go to your room, Kel. No hanging out with Caulder or Kiersten while you’re grounded. Caulder, same goes for you. Go to your house and go to your room.”\u003c/p\u003e\n\u003cp\u003eThe boys get up from the bar and go to their respective bedrooms. When Kel disappears down the hallway and Caulder disappears out the front door, I give Lake a high five.\u003c/p\u003e\n\u003cp\u003e“Well played,” I tell her. “You almost had me convinced.”\u003c/p\u003e\n\u003cp\u003e“You too. You really seemed pissed!” she says. She walks to the living room and starts folding laundry. “So? How were your classes?”\u003c/p\u003e\n\u003cp\u003e“Good,” I reply. I spare her the details of first period. “I do have a lot of homework I need to get started on, though. Are we eating together tonight?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “I promised Eddie we could have some girl time tonight. Gavin started his job at Getty’s. But tomorrow I’m all yours.”\u003c/p\u003e\n\u003cp\u003eWhen I walk through the living room toward the front door, I stop and kiss her on top of the head. “You two have fun. Text me goodnight,” I say. “You do know where your phone is, right?”\u003c/p\u003e\n\u003cp\u003eShe nods and pulls it out of her pocket to show me. “Love you,” she says.\u003c/p\u003e\n\u003cp\u003e“Love you, too,” I say as I leave.\u003c/p\u003e\n\u003cp\u003eWhen I shut the door behind me, it feels like I left a moment too soon. I walk back in and she’s facing the other way, folding a towel. I turn her around and take the towel out of her hands. I wrap my arms around her and kiss her again, but better this time. “I love you,” I say again.\u003c/p\u003e\n\u003cp\u003eShe sighs and leans into me. “I can’t wait until next weekend, Will. I wish it would just hurry up and get here.”\u003c/p\u003e\n\u003cp\u003e“You and me both.”\u003c/p\u003e\n\u003cp\u003eTuesday, January 10th, 2012\u003c/p\u003e\n\u003cp\u003eIf I were a carpenter, I would build you a window to my soul.\u003c/p\u003e\n\u003cp\u003eBut I would leave that window shut and locked,\u003c/p\u003e\n\u003cp\u003eso that every time you tried to look through it…all you would see is your own reflection.\u003c/p\u003e\n\u003cp\u003eYou would see that my soul\u003c/p\u003e\n\u003cp\u003eis a reflection of you…\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eLake has already left for school by the time I wake up the next morning. Kel is asleep on the couch. She must have sent him over before she left. It’s trash day, so I slip my shoes on and head outside to take the can to the curb. I have to knock almost a foot of snow off the lid before I can get it to budge. Lake forgot, so I walk to her house and pull hers to the curb as well.\u003c/p\u003e\n\u003cp\u003e“Hey, Will,” Sherry says. She and Kiersten are making their way outside.\u003c/p\u003e\n\u003cp\u003e“Morning,” I say to them.\u003c/p\u003e\n\u003cp\u003e“What happened with Kel and Caulder yesterday? Are they in lots of trouble?” Kiersten asks.\u003c/p\u003e\n\u003cp\u003e“Suspended. They can’t go back until Monday.”\u003c/p\u003e\n\u003cp\u003e“Suspended for what?” Sherry asks. I can tell by the tone in her voice Kiersten must not have told her.\u003c/p\u003e\n\u003cp\u003eKiersten turns toward her mother. “They threatened those boys I was telling you about. They wrote them a note, threatening their life. Called them asswipes,” Kiersten says, matter-of-factly.\u003c/p\u003e\n\u003cp\u003e“Awe, how sweet,” Sherry says. “They defended you.” Sherry turns to me before she gets in her car. “Will, tell them thank you. That’s too sweet, defending my baby girl like that.”\u003c/p\u003e\n\u003cp\u003eI laugh and shake my head as I watch them drive away. When I get back inside, Kel and Caulder are both sitting on the couch watching TV. “Morning,” I say to them.\u003c/p\u003e\n\u003cp\u003e“Are we allowed to watch TV, at least?” Caulder asks.\u003c/p\u003e\n\u003cp\u003eI shrug. “Whatever. Do what you want. Just don’t threaten to kill anyone today.” I know I should probably be stricter, but it’s too early in the morning to care.\u003c/p\u003e\n\u003cp\u003e“They were really mean to her, Will,” Kel says. “They’ve been being mean to her since she moved here. She hasn’t done anything to them.”\u003c/p\u003e\n\u003cp\u003eI sit down on the other couch and kick my shoes off. “Not everyone is gonna be nice, Kel. There are a lot of cruel people in the world, unfortunately,” I say. “What kinds of things are they doing to her?”\u003c/p\u003e\n\u003cp\u003eCaulder turns to me and answers. “One of the sixth grade boys asked her to be his girlfriend about a week after she moved here but she told him no. He\u0027s kind of a bully. She said she was a vegetarian and couldn’t date meatheads. It made him really mad, so he’s been spreading rumors about her since then,” Caulder says. “A lot of kids are scared of him because he’s a dickhead, so now others are being mean to her, too.”\u003c/p\u003e\n\u003cp\u003e“Don’t say dickhead, Caulder. And I think you guys are doing the right thing by defending her. Lake and I aren’t mad about that, we’re actually a little proud. We just wish you would use your heads before you make some of the choices you do. This is two weeks in a row you guys have done something stupid at school. This time, you got suspended because of it. We all have enough on our plates as it is…we don’t need the added stress.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Kel says.\u003c/p\u003e\n\u003cp\u003e“Yeah. Sorry, Will,” Caulder says.\u003c/p\u003e\n\u003cp\u003e“As for Kiersten, you two keep doing what you’re doing, sticking by her. She’s a nice kid and doesn’t deserve to be treated like that. Is anyone being nice to her other than you two? She doesn’t have any other friends?”\u003c/p\u003e\n\u003cp\u003e“She’s got Abby,” Caulder says.\u003c/p\u003e\n\u003cp\u003eKel smiles. “She’s not the only one who has Abby.”\u003c/p\u003e\n\u003cp\u003e“Shut up, Kel!” Caulder hits him in the arm.\u003c/p\u003e\n\u003cp\u003e“Whoa! What’s this? Who’s Abby? Caulder do you have a girlfriend?” I tease.\u003c/p\u003e\n\u003cp\u003e“No, she’s not my girlfriend,” Caulder says defensively.\u003c/p\u003e\n\u003cp\u003e“Only because he’s too shy to ask her,” Kel says.\u003c/p\u003e\n\u003cp\u003e“You’re one to talk,” I say to Kel. “You’ve been crushing on Kiersten since the day she moved in. Why haven’t you asked her to be your girlfriend?”\u003c/p\u003e\n\u003cp\u003eKel blushes and tries to hide his smile. He reminds me of Lake when he does this.\u003c/p\u003e\n\u003cp\u003e“I already asked her. She is my girlfriend,” he says.\u003c/p\u003e\n\u003cp\u003eI’m impressed. He’s got more nerve than I thought.\u003c/p\u003e\n\u003cp\u003e“You better not tell Layken!” he says. “She’ll embarrass me.”\u003c/p\u003e\n\u003cp\u003e“I won’t say anything,” I say. “But your birthday party is this Friday. You better tell Kiersten not to be kissing you in front of Lake if you don’t want her finding out.”\u003c/p\u003e\n\u003cp\u003e“Shut up, Will! I’m not kissing her,” Kel says with a disgusted look on his face.\u003c/p\u003e\n\u003cp\u003e“Caulder, you should invite Abby to Kel’s party,” I say.\u003c/p\u003e\n\u003cp\u003eCaulder gets the same embarrassed look Kel had.\u003c/p\u003e\n\u003cp\u003e“He already did,” Kel says. Caulder hits him on the arm again.\u003c/p\u003e\n\u003cp\u003eI stand up. It’s obvious my advice isn’t needed here. “Well, you two have it all figured out, then. What do you need me for?”\u003c/p\u003e\n\u003cp\u003e“Someone has to pay for the pizza,” Caulder says.\u003c/p\u003e\n\u003cp\u003eI walk to the front door and grab both of their jackets and toss them in their laps.\u003c/p\u003e\n\u003cp\u003e“Punishment time,” I say. They both groan and roll their eyes. “You guys get to shovel driveways today.”\u003c/p\u003e\n\u003cp\u003e“Driveways? As in plural? More than one?” Caulder asks.\u003c/p\u003e\n\u003cp\u003e“Yep,” I say. “Do mine and Lakes, and when you’re done do Sherry and Kiersten’s, too. While you’re at it, go ahead and do Bob and Melinda’s.”\u003c/p\u003e\n\u003cp\u003eNeither of them moves from the couch.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eMy stomach is in knots Wednesday morning. I really don’t want to see Vaughn today. I try to leave a few minutes sooner, hoping I can make it to class early enough to pick a seat next to someone else. Unfortunately, I’m the first to arrive. I take a seat in the back again, hoping she doesn’t want to make the trek to the back of the room. \u003c/p\u003e","sourceLink":"https://allnovel.net/point-of-retreat-slammed-2/page-7.html","bookId":2780,"creation":"Oct 5, 2019 5:23:10 PM","modification":"Oct 5, 2019 5:23:10 PM"}
