{"id":88111,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThat was why, when he shifted his hand down, her reaction startled her. She grabbed his wrist, as if her fear was something separate, a monster she couldnt predict. He merely kept going, her grip sliding uncertainly to his forearm as he made his way down.\u003c/p\u003e\n\u003cp\u003eIm not going to hurt you, he crooned in that sexy, soft voice. But Im not going to stop, Chloe.\u003c/p\u003e\n\u003cp\u003eThank Goddess. It was a reassurance and she took it as such.\u003c/p\u003e\n\u003cp\u003eHe slid his fingers over her clit and then down to her labia, covering her. Her grip moved to his biceps as he began to stroke her, the way he might a kitten. A n apt comparison, she thought with wry desperation. He moved his fingers in small, massaging circles, learning her, not just following a prescription for response, making her feelwell, like the center of his universe.\u003c/p\u003e\n\u003cp\u003eYoure beautiful, he murmured. So pretty and soft. He moved so slowly, but it wasnt an easy touch. There was an intensity to it that had every part of her quivering.\u003c/p\u003e\n\u003cp\u003eHis gaze moved to her breasts, their faint tremble with her elevated breath, and lingered on her nipples.\u003c/p\u003e\n\u003cp\u003eFragile pink there too, he observed. Youre a flower, Chloe. A perfect, pale pink rose. He let his knuckles drift up her breastbone, fingertips grazing the rise of her right breast until he reached her collarbone, turned his hand over and caressed the base of her aching throat. His fingers spread out and curved there, covering that sensitive column as he bent and touched his lips to her breast. He didnt start with the nipple, but worked his way around it, nuzzling, teasing, then giving her bites, some harder than others, the suggestion of pain.\u003c/p\u003e\n\u003cp\u003eHer legs grew looser, opened further to his touch, wanting to pull him in. But he was the ocean, following his own natural pattern and pace, so she rode the direction he set, breathing his name in the semi-darkness until he lifted his head, his lips moist from the intricate track his tongue had left on her flesh.\u003c/p\u003e\n\u003cp\u003eDo you want me inside you, Chloe?\u003c/p\u003e\n\u003cp\u003eShe wanted that and more. Shed gladly throw out entire roomfuls of things she didnt want to feel or see inside herself to make room for everything he was, everything she wanted to know about him. But she didnt even want it to be that conscious. She simply wanted to absorb him in the quiet dawn, become as peaceful and passionately alive as the day itself, and as instinctive.\u003c/p\u003e\n\u003cp\u003eYes, she said.\u003c/p\u003e\n\u003cp\u003eHis hazel eyes were so close, the mouth a sweet curve. Women were so pleasing aesthetically, but there was something so uniquely beautiful about a well-formed male, a strength-coated vulnerability, such a yin and yang. Ironic, since women were often the mirror, vulnerability over steel.\u003c/p\u003e\n\u003cp\u003eReaching down to the waistband of the jeans, she pressed her knuckles into firm flesh as she unhooked the button and parted the teeth of the zipper, loosening the waist further.\u003c/p\u003e\n\u003cp\u003eOff, she breathed.\u003c/p\u003e\n\u003cp\u003eHe complied and then did something else remarkable. He took a cross-legged position on the bed and slid his arms beneath her, helping her rise to straddle him. Guiding her legs around his waist, he brought her moist lips in contact with the heat and stiffness of his desire.\u003c/p\u003e\n\u003cp\u003eI dont want you to use a condom, she said, a whisper. Im protected from pregnancy. I trust you if you say its okay.\u003c/p\u003e\n\u003cp\u003eYou can trust me, Chloe, he confirmed it, his eyes darkening with pleasure. Nothing would please me more than to be inside you, nothing between us.\u003c/p\u003e\n\u003cp\u003eFeeling his release inside her. She nodded.\u003c/p\u003e\n\u003cp\u003eHold onto my neck, he murmured, as if knowing her emotions were rising to overwhelm her again.\u003c/p\u003e\n\u003cp\u003eShe crossed her arms over his shoulders, buried her face in his hair, pressing her temple to his skull, fingers tangling in dark strands. He used the adjustment of her body to lodge the broad head of his cock in her opening, so that her breath caught in her throat. When he moved, she did, in natural accord, and then she was sinking down on him, wresting a male purr of approval from his throat, a breathless moan from hers.\u003c/p\u003e\n\u003cp\u003eIt had been over a year. She hadnt used anything in her frustrated self-pleasuring other than her fingers or something to vibrate against the outside. His cock stretched tissues anew that hadnt been used in a while, and it felt good, because he took his time with it, as if he knew. It was like that first stretch of the morning, the muscles going beyond learned response to reach even further, send a spiral of pleasure through the whole body.\u003c/p\u003e\n\u003cp\u003eHis arm tightened on her waist, bringing her home, all the way to the hilt, then snugging her up close, long fingers splaying over her backside.\u003c/p\u003e\n\u003cp\u003eGod, Chloe, he muttered. You feel fucking incredible.\u003c/p\u003e\n\u003cp\u003eThats you, she whispered into his hair.\u003c/p\u003e\n\u003cp\u003eHas it been awhile?\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003eGood. For me too. He pressed a hard kiss to her temple, holding there. A nd not just his mouth. His body remained still, heat energy vibrating from it, as he gave them both time to absorb the way it felt. Her thighs were quivering, and she couldnt keep herself from tightening on him, moving incrementally, testing. Oh Goddess.\u003c/p\u003e\n\u003cp\u003eA pleasurable starburst of almost forgotten sensation went from the point of friction where her inner muscles gripped his head, worked against the ridge, all the way to the womb.\u003c/p\u003e\n\u003cp\u003eHe speared the fingers of his other hand through her hair, gripping, and then, blissfully, he began to move. One strong, rolling movement that took him out, slow, and then back in at the same pace, lifting and bringing her back down in a nerve reaction so delicious her face tightened because of it, her fingers clutching, eyes closing and head dropping back. She did little more than hang on as he did it again, then again, so slow each time that she whimpered at the pleasure cautiously uncoiling from her belly. He kept her wrapped so securely in his arms, both of them bathed by tranquil dawn light, his heated breath brushing her ear like a tropical breeze teasing the lobe. Her breasts pressed into his chest, her arms holding him as close as she could manage.\u003c/p\u003e\n\u003cp\u003eShe loved him.\u003c/p\u003e\n\u003cp\u003ePeople thought the word was misused, often confused with lust. But she knew she could in fact love him, no matter how little she knew about him. In this incredible, astounding moment, she thought she loved him more and differently than shed ever loved anyone in her life or ever would.\u003c/p\u003e\n\u003cp\u003eBrendan. Her voice was a broken whisper.\u003c/p\u003e\n\u003cp\u003eIm here, baby, he whispered back, never faltering. His pace was increasing because hers was, and she realized he was following her pacing, anticipating it, to ensure the maximum pleasure for her. It couldnt have been easy, because her movements were becoming more fractious and insistent, the slick slide and retreat starting to smolder to flame, bodies urging toward even faster movement, piston velocity, straining into one another. The grip of his hands on her buttocks became bruising, kneading, awakening sensitive nerve endings. When she came down harder this time, smacking on his pubic bone with a reaction that rocketed through her clit, his cock lodged deeper, pushed her closer.\u003c/p\u003e\n\u003cp\u003eI want to feel you come, he managed, his eyes fastened on her face. See you lose control. Hear you sing. Feel your pussy ripple on me, because of what my cock is doing for it.\u003c/p\u003e\n\u003cp\u003eShe spasmed against him and his voice got rougher. Thats it. Will you come for me, Chloe?\u003c/p\u003e\n\u003cp\u003eGowithme. She demanded it, clutching his hair and tugging, bringing a spark to his eyes, a feral curve to his sensual mouth. Her breasts wobbled before his greedy eyes at each jarring contact. She was goaded closer to that precipice by the way his eyes devoured their movement, the distended tips of her nipples.\u003c/p\u003e\n\u003cp\u003eSuckle me, she demanded. Hard.\u003c/p\u003e\n\u003cp\u003eHis mouth fastened on her nipple, back curving, one hand continuing to hold her, another coming around to grip the breast, squeeze it into his mouth, so that the touch of his tongue ignited erogenous zones all over her body.\u003c/p\u003e\n\u003cp\u003eGoddess, yes. Thats it. Brendan\u003c/p\u003e\n\u003cp\u003eIt came up on her so fast and unexpected, because it had been so long since it had happened so easily. This was like a dam breaking over jagged rock, so she felt the rush and the broken pieces at once.\u003c/p\u003e\n\u003cp\u003eNow, she demanded, part plea, part command, as she toppled over that edge. The climax arched her into his body, his mouth. Her hips pushed down, working hard and fast against him, muscles squeezing him relentlessly inside, feeling every inch of that hard organ. Her nails dug into his shoulders, hanging on for dear life as those wonderful, rolling, punishing waves took her over and rational thought was lost.\u003c/p\u003e\n\u003cp\u003eCries wrenched from her throat, ratcheted up to a wail of victorious pleasure as he obeyed, letting go mere seconds after her. Those delightful arm and shoulder muscles stood out with the strain, rippling with the motion, his cocks friction rubbing within her, the rim of the broad head, the thick heat of him keeping her climax roaring through her, an engine fueled by the driving piston motion.\u003c/p\u003e\n\u003cp\u003eHer arms banded tight around his shoulders as the sensation overwhelmed her. A s she held him close to her breast, her hips ground down on him. She snarled, throwing her head back, nails driving in further as she took every drop of his release. Closing her eyes, she embraced the ride, far beyond any worries of what the day would bring.\u003c/p\u003e\n\u003cp\u003eIt was the best her body had felt in a long, long time.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eShe should have known it wouldnt last. A fter a brief post-coital nap, hed kissed her good morning warmly enough, run through the shower when shed wanted a few extra minutes of snoozing, then made them both one of her organic, free-range eggs while she got under the hot water.\u003c/p\u003e\n\u003cp\u003eHe handed her forkfuls through the curtain since they were running a little late. So accommodating. He hadnt coaxed her to bathe with him, hadnt even taken more than a friendly glance at her naked body in the shower.\u003c/p\u003e\n\u003cp\u003eShe had a tiny shower, so there was no way they could have shared it, but shed expected him to try. Yeah, it was a work day for both of them, but that wasnt it. If she were more sure of herself, she would have dragged him in with her, soaked his jeans and gotten both of them laughing and easy with one another again. Shed always been attuned to any sign of instability around her and gone out of her way to balance it, had enjoyed the power to do so. But she couldnt get past her own reaction. She couldnt bear knowing the first perfect thing shed experienced in months had rotted in the course of an hour. The intuition that had guided her to so many adventures and new things had become an enemy, shedding a bright light on the things she didnt want to see.\u003c/p\u003e\n\u003cp\u003eHe was distant, damn it. She could sense it, see it in his eyes. It couldnt have been something shed done, since theyd basically fallen asleep in each others arms after what was undeniably a wonderful experience for both of them. \u003c/p\u003e","sourceLink":"https://allnovel.net/branded-sanctuary-nature-of-desire-7/page-11.html","bookId":1912,"creation":"Oct 5, 2019 5:27:02 PM","modification":"Oct 5, 2019 5:27:02 PM"}
