{"id":88133,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI should take you home to my family this Christmas, she said. My mother would adopt you in a heartbeat.\u003c/p\u003e\n\u003cp\u003eThe warmth of his smile settled over Chloe, making her feel close to every part of who he was, and so glad to be here with him.\u003c/p\u003e\n\u003cp\u003eA nother way to keep things from overwhelming you is to realize that a house not only shelters you from the storm, it has windows to let in the light, hold it. He teased back a loose lock of her hair. A nd Id love to meet your parents. I dont think you realize how brave you are, Chloe.\u003c/p\u003e\n\u003cp\u003eBrave enough to go into your house at the very least, right? She managed to give him a faint smile. Though Ive heard horror stories about your laundry. A nd shoes like spiders. Maybe Ill sleep in the car.\u003c/p\u003e\n\u003cp\u003eI keep the laundry safely locked away so it cant harm the innocent, and the spider shoes only appear for me. He made a face at her that almost made her laugh, but then he sobered. Please come into my home, Chloe.\u003c/p\u003e\n\u003cp\u003eDropping to a sensual murmur, he pressed his lips to her jaw, glided to the pulse in her throat so that she lifted her chin to give him better access. She moved her fingers from his hair to his shoulders, then down to clutch his shirt, holding tight as that brief touch threatened to send her floating away.\u003c/p\u003e\n\u003cp\u003eOkay. She managed it on an indrawn breath. Youve bullied me into it.\u003c/p\u003e\n\u003cp\u003eDont move, he said, and then he was out the Jeep door and moving around to the other side. He was a little less put together at three a.m.\u003c/p\u003e\n\u003cp\u003ethan hed been in his chain mail. But she liked the look of him in worn jeans and his faded Cirque du Soleil T-shirt with a fire breathing dragon.\u003c/p\u003e\n\u003cp\u003eUnshaven, his hair tousled, he looked a little rough and unpredictable as he came around the vehicle. It wasnt a bad look for him, his Beaver Cleaver jokes notwithstanding.\u003c/p\u003e\n\u003cp\u003eHe opened the door, helped her out, ready if she was still unsteady on her feet. She had an amazing feeling hed be willing to carry her for the next decade if she needed it. A t the same time, with his comment about her being brave, she didnt feel as if it stole any strength from her. Moreover, it suggested she still had some in her, somewhere. Shed give it the night off, hope it would have grown in size by morning.\u003c/p\u003e\n\u003cp\u003eOpening his front door, he guided her in, carrying her bag, which he set down in the entryway. Feel free to look around anywhere, he said. Im just going to go check my messages.\u003c/p\u003e\n\u003cp\u003eShe nodded as he moved toward the open kitchen. The living space was comfortable, a male abode with masculine furniture, but a style that underscored Brendans background in theater art. There were earthy blends of color with splashes of warm reds in the sectional grouping in his sitting room. The entranceway had a series of black and white photographs, artistic renderings of two nudes, a male and female. Their positions were intimate. The male kneeling, head to his knees while the womans long hair, a rich brown, draped over him like strands of a weeping willow, her body the slender trunk arched backward over him. In the next, the two models lay on blue velvet, the only color, as their black and white figures spooned together. The male was curved protectively around her, their legs and torso flush against one another.\u003c/p\u003e\n\u003cp\u003eThe other two photos had a similar give and take theme, and then guided the eye to a much larger centerpiece for the same series, positioned alone on the wall over the sectional.\u003c/p\u003e\n\u003cp\u003eThis one only showed the two from shoulder to hips. They were back to back, seated, the point of their buttocks on grass, marked with a scattering of tiny white wildflowers. A gain the green was the only color, the humans in black and white. Their heads were averted from the camera and so emphasized the jaw lines, the arch of their necks turned from the viewer and each other. But their bodies were pressed so close their hips and so emphasized the jaw lines, the arch of their necks turned from the viewer and each other. But their bodies were pressed so close their hips and shoulders touched, conveying connection and separation at once.\u003c/p\u003e\n\u003cp\u003eSeveral cushions and a woven blanket had been tossed across the sectional. On the side table was a pyramid of linked picture frames, forming a sculpture of photos.\u003c/p\u003e\n\u003cp\u003eDrawing closer, the first one she identified was Marguerite and Brendan, a shot taken of them after Marguerites wedding. He was looking down at her, a light smile on his face. Marguerites peace and happiness had been obvious that night, enough to make Chloe smile now in remembrance.\u003c/p\u003e\n\u003cp\u003eThe bride leaned into the curve of Brendans body, as if the picture had been taken while they were dancing, the fairy lights and silhouettes of the large oaks in the background.\u003c/p\u003e\n\u003cp\u003eA nother pair of pictures were soldered at the corners to link them diagonally. One showed a young couple with a boy of about four. The father squatted with the child between his knees while the woman was caught in a half laugh, her hand on her husbands shoulder, two of her fingers firmly clasped by the child as she leaned over them. The other photo was a department store type shot, a pleasant-looking older couple with an adolescent Brendan, their hands on his shoulders, a solidly middle class picture.\u003c/p\u003e\n\u003cp\u003eMy parents and my adopted parents, Brendan confirmed, returning from the kitchen to stand behind her. I was very lucky to have them both.\u003c/p\u003e\n\u003cp\u003eEllen and Reid live in Dayton now, which is where Reid was from originally.\u003c/p\u003e\n\u003cp\u003eHis tone was easy, no hidden meanings, and she was glad to know his adopted parents had appreciated his wonderful qualities as much as those whod given him birth obviously had. If there was a heaven, she was sure it was a comfort to them to know hed not lost that security, that vital need of a child to know he was specifically and specially loved by someone who felt it was their dutyand privilegeto be in charge of his safety and wellbeing.\u003c/p\u003e\n\u003cp\u003eIn this rack of obviously significant choices, she was surprised to see a picture of herself.\u003c/p\u003e\n\u003cp\u003eIt was also from the wedding. Shed still been recuperating from her injuries, enough that shed looked a little thinner, the face bruises healed but the impression of them still somehow there. But in this shot, she was sitting at a table with Brendan, Gen and a couple of regular visitors to the tea room.\u003c/p\u003e\n\u003cp\u003eShed been firmly instructed by everyone to keep her leg elevated. Brendan had it propped on his leg, his hand resting on her ankle as he leaned back, beer in hand. His lips were curved in a grin that suggested theyd all been laughing at something. She was laughing too, one of her hands clasped in Gens, the other reaching out to grab Brendans, as if theyd made her laugh so hard she was steadying herself with their touch.\u003c/p\u003e\n\u003cp\u003eBrendan and Gen were partially cut off in the picture, Chloe the center focus.\u003c/p\u003e\n\u003cp\u003eMarguerite gave it to me. Brendan touched the photo, her face, without any obvious self-consciousness.\u003c/p\u003e\n\u003cp\u003eYet all those months, you didnt call me.\u003c/p\u003e\n\u003cp\u003eI gave you my phone number. You didnt give me yours. Remember? He said it without judgment in his tone, a simple fact. I thought we hit it off that night, but there were things, the way you looked at times, that told me you needed time. Crazy as it sounds, I thought it might mean more to you, when you finally called, if I was ready to be with you, waiting for you, rather than forcing you to decide on me before you were ready.\u003c/p\u003e\n\u003cp\u003eHed waited on her to call. For months. Wow. Oh. Chloe absorbed that. Either thats a really spectacular thing to say to overwhelm a girl, or the smoothest lie Ive ever heard to cover being too chickenshit to risk rejection.\u003c/p\u003e\n\u003cp\u003eBrendan chuckled, not confirming or denying. Glancing at the several other photos, she saw a precocious-looking hound in one, and then some shots of what might be his students, clustered around him and dressed in costume for one of the community plays hed probably helped produce.\u003c/p\u003e\n\u003cp\u003eShe wanted to know the stories behind those as well, but not right now. She turned on her heel to take in the rest of the room. A flat-screen TVthe essential piece of male home décor. A n assortment of books on art and theater, as well as some espionage novels. They were mixed with a fairly substantial movie collection, neatly arranged in handsome glass-faced cabinets.\u003c/p\u003e\n\u003cp\u003eDid you know I was coming? Or are you always this scarily neat?\u003c/p\u003e\n\u003cp\u003eWhich answer makes me seem less OCD?\u003c/p\u003e\n\u003cp\u003eShe gave a snort. She remembered how shed thought it possible to mistake him for the gay stereotype, with his physical perfection, sense of style and interests. Having been the recipient of a direct blast of his unleashed sexuality, she knew he had a fully committed appreciation for the female form. Still, Brendans program section at the auction hadnt noted a limitation to female bidders only.\u003c/p\u003e\n\u003cp\u003eTheres no picture of an old girlfriend, or boyfriend. She tested the waters, wondering why she was hesitating to ask him straight out if he was bi. Or a current one, for that matter.\u003c/p\u003e\n\u003cp\u003eHe gave her an easy smile. Well, papering the wall with my conquests tends to put off the scores of dates I bring home.\u003c/p\u003e\n\u003cp\u003eYeah, right. She bumped him with her hip. I can tell youre a real slut. Though she remembered his words. I dont usually date outside the club It suggested hed been telling the truth, when he said hed been waiting for her call. She wasnt sure what to make of that. Truth be told, he was like nothing shed ever met before.\u003c/p\u003e\n\u003cp\u003eWhen he slid an arm around her back, she automatically leaned into him, feeling her tiredness. A m I prying? she asked.\u003c/p\u003e\n\u003cp\u003eNo. Well, yeah, but I want you to be interested. Sometimes, depending on how a relationship ends, its too painful to keep a picture, you know?\u003c/p\u003e\n\u003cp\u003eBut do you keep them?\u003c/p\u003e\n\u003cp\u003eIt depends. On whether that helps me move on or not. The last one, no.\u003c/p\u003e\n\u003cp\u003eShe saw the shadow, registered the tension that tightened the biceps against her shoulder blades. Im sorry. How long ago?\u003c/p\u003e\n\u003cp\u003eOver a year. Before you think it, no, you are not a rebound. He gave her a little admonishing squeeze.\u003c/p\u003e\n\u003cp\u003eShe believed him. But what about her? He was her first foray into a relationship, hell, even dating, since that terrible day. Her first attempt to open herself up in the way a good romance demanded, fully experiencing the tingling delight, wonder and adventure of falling in love again, wherever it ended up. Only she wasnt sure what shed find in her heart, when and if she opened it fully again. She was afraid those spurts of unreasoning anger and desire to hurt, strike out, were evidence of the sharp slivers her heart had become.\u003c/p\u003e\n\u003cp\u003eShe could see the ground level hallway off the sitting room led to a bathroom and home office. In his kitchen, where hed been checking his messages, a small four-person table was visible through the pass through. Following her desire, she headed for the stairs to the second level. She had a sudden impulse to take him at his word, see, explore whatever she wanted, without asking permission. A s she went up the carpeted stairs and reached the hallway, she noted there was a guest bedroom. It wasnt his, because it didnt have any personal articles. When he turned on the light, she could see two rooms off further down the hallway. More intriguing prints lined the walls. This time they were water scenes, shots that she assumed had called to the swimmer in him. \u003c/p\u003e","sourceLink":"https://allnovel.net/branded-sanctuary-nature-of-desire-7/page-33.html","bookId":1912,"creation":"Oct 5, 2019 5:27:02 PM","modification":"Oct 5, 2019 5:27:02 PM"}
