{"id":7349,"no":33,"title":"Chapter 33","content":"33:1 [hgb]\u0026nbsp; 以 色 列 人 按 着 军 队 ， 在 摩 西 ， 亚 伦 的 手 下 出 埃 及 地 所 行 的 路 程 （ 或 作 站 口 下 同 ） 记 在 下 面 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; These are the journeys of the children of Israel, which went forth out of the land of Egypt with their armies under the hand of Moses and Aaron. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; These are the journeys of the children of Israel, when they went out of the land of Egypt in their armies, under the direction of Moses and Aaron. \n\u003cbr\u003e33:2 [hgb]\u0026nbsp; 摩 西 遵 着 耶 和 华 的 吩 咐 记 载 他 们 所 行 的 路 程 ， 其 路 程 乃 是 这 样 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses wrote their goings out according to their journeys by the commandment of the LORD: and these are their journeys according to their goings out. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the stages of their journey on their way out were put down in writing by Moses at the order of the Lord: these are the stages of their journey and the way they went. \n\u003cbr\u003e33:3 [hgb]\u0026nbsp; 正 月 十 五 日 ， 就 是 逾 越 节 的 次 日 ， 以 色 列 人 从 兰 塞 起 行 ， 在 一 切 埃 及 人 眼 前 昂 然 无 惧 地 出 去 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Rameses in the first month, on the fifteenth day of the first month; on the morrow after the passover the children of Israel went out with an high hand in the sight of all the Egyptians. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; On the fifteenth day of the first month they went out from Rameses; on the day after the Passover the children of Israel went out by the power of the Lord before the eyes of all the Egyptians, \n\u003cbr\u003e33:4 [hgb]\u0026nbsp; 那 时 ， 埃 及 人 正 葬 埋 他 们 的 长 子 ， 就 是 耶 和 华 在 他 们 中 间 所 击 杀 的 。 耶 和 华 也 败 坏 他 们 的 神 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For the Egyptians buried all their firstborn, which the LORD had smitten among them: upon their gods also the LORD executed judgments. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; While the Egyptians were placing in the earth the bodies of their sons on whom the Lord had sent destruction: and their gods had been judged by him. \n\u003cbr\u003e33:5 [hgb]\u0026nbsp; 以 色 列 人 从 兰 塞 起 行 ， 安 营 在 疏 割 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the children of Israel removed from Rameses, and pitched in Succoth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; So the children of Israel went from Rameses and put up their tents in Succoth. \n\u003cbr\u003e33:6 [hgb]\u0026nbsp; 从 疏 割 起 行 ， 安 营 在 旷 野 边 的 以 倘 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Succoth, and pitched in Etham, which is in the edge of the wilderness. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Succoth and put up their tents in Etham on the edge of the waste land. \n\u003cbr\u003e33:7 [hgb]\u0026nbsp; 从 以 倘 起 行 ， 转 到 比 哈 希 录 ， 是 在 巴 力 洗 分 对 面 ， 就 在 密 夺 安 营 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Etham, and turned again unto Pihahiroth, which is before Baalzephon: and they pitched before Migdol. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from Etham, turning back to Pi-hahiroth which is before Baal-zephon, they put up their tents before Migdol. \n\u003cbr\u003e33:8 [hgb]\u0026nbsp; 从 比 哈 希 录 对 面 起 行 ， 经 过 海 中 到 了 书 珥 旷 野 ， 又 在 伊 坦 的 旷 野 走 了 三 天 的 路 程 ， 就 安 营 在 玛 拉 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from before Pihahiroth, and passed through the midst of the sea into the wilderness, and went three days\u0027 journey in the wilderness of Etham, and pitched in Marah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And journeying on from before Hahiroth, they went through the sea into the waste land: they went three days\u0027 journey through the waste land of Etham and put up their tents in Marah. \n\u003cbr\u003e33:9 [hgb]\u0026nbsp; 从 玛 拉 起 行 ， 来 到 以 琳 （ 以 琳 有 十 二 股 水 泉 ， 七 十 棵 棕 树 ） ， 就 在 那 里 安 营 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Marah, and came unto Elim: and in Elim were twelve fountains of water, and threescore and ten palm trees; and they pitched there. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from Marah they went on to Elim: and in Elim there were twelve water-springs and seventy palm-trees; and they put up their tents there. \n\u003cbr\u003e33:10 [hgb]\u0026nbsp; 从 以 琳 起 行 ， 安 营 在 红 海 边 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Elim, and encamped by the Red sea. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Elim and put up their tents by the Red Sea. \n\u003cbr\u003e33:11 [hgb]\u0026nbsp; 从 红 海 边 起 行 ， 安 营 在 汛 的 旷 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from the Red sea, and encamped in the wilderness of Sin. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then from the Red Sea they went on and put up their tents in the waste land of Sin. \n\u003cbr\u003e33:12 [hgb]\u0026nbsp; 从 汛 的 旷 野 起 行 ， 安 营 在 脱 加 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they took their journey out of the wilderness of Sin, and encamped in Dophkah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from the waste land of Sin, and put up their tents in Dophkah. \n\u003cbr\u003e33:13 [hgb]\u0026nbsp; 从 脱 加 起 行 ， 安 营 在 亚 录 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Dophkah, and encamped in Alush. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Dophkah, and put up their tents in Alush. \n\u003cbr\u003e33:14 [hgb]\u0026nbsp; 从 亚 录 起 行 ， 安 营 在 利 非 订 。 在 那 里 ， 百 姓 没 有 水 喝 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Alush, and encamped at Rephidim, where was no water for the people to drink. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Alush, and put up their tents in Rephidim, where there was no drinking-water for the people. \n\u003cbr\u003e33:15 [hgb]\u0026nbsp; 从 利 非 订 起 行 ， 安 营 在 西 乃 的 旷 野 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Rephidim, and pitched in the wilderness of Sinai. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Rephidim, and put up their tents in the waste land of Sinai. \n\u003cbr\u003e33:16 [hgb]\u0026nbsp; 从 西 乃 的 旷 野 起 行 ， 安 营 在 基 博 罗 哈 他 瓦 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from the desert of Sinai, and pitched at Kibrothhattaavah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from the waste land of Sinai and put up their tents in Kibroth-hattaavah. \n\u003cbr\u003e33:17 [hgb]\u0026nbsp; 从 基 博 罗 哈 他 瓦 起 行 ， 安 营 在 哈 洗 录 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Kibrothhattaavah, and encamped at Hazeroth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Kibroth-hattaavah, and put up their tents in Hazeroth. \n\u003cbr\u003e33:18 [hgb]\u0026nbsp; 从 哈 洗 录 起 行 ， 安 营 在 利 提 玛 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Hazeroth, and pitched in Rithmah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Hazeroth, and put up their tents in Rithmah. \n\u003cbr\u003e33:19 [hgb]\u0026nbsp; 从 利 提 玛 起 行 ， 安 营 在 临 门 帕 烈 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Rithmah, and pitched at Rimmonparez. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Rithmah, and put up their tents in Rimmon-perez. \n\u003cbr\u003e33:20 [hgb]\u0026nbsp; 从 临 门 帕 烈 起 行 ， 安 营 在 立 拿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Rimmonparez, and pitched in Libnah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Rimmon-perez, and put up their tents in Libnah. \n\u003cbr\u003e33:21 [hgb]\u0026nbsp; 从 立 拿 起 行 ， 安 营 在 勒 撒 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Libnah, and pitched at Rissah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Libnah, and put up their tents in Rissah. \n\u003cbr\u003e33:22 [hgb]\u0026nbsp; 从 勒 撒 起 行 ， 安 营 在 基 希 拉 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they journeyed from Rissah, and pitched in Kehelathah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Rissah, and put up their tents in Kehelathah. \n\u003cbr\u003e33:23 [hgb]\u0026nbsp; 从 基 希 拉 他 起 行 ， 安 营 在 沙 斐 山 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they went from Kehelathah, and pitched in mount Shapher. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Kehelathah, and put up their tents in Mount Shepher. \n\u003cbr\u003e33:24 [hgb]\u0026nbsp; 从 沙 斐 山 起 行 ， 安 营 在 哈 拉 大 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from mount Shapher, and encamped in Haradah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Mount Shepher, and put up their tents in Haradah. \n\u003cbr\u003e33:25 [hgb]\u0026nbsp; 从 哈 拉 大 起 行 ， 安 营 在 玛 吉 希 录 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Haradah, and pitched in Makheloth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Haradah, and put up their tents in Makheloth. \n\u003cbr\u003e33:26 [hgb]\u0026nbsp; 从 玛 吉 希 录 起 行 ， 安 营 在 他 哈 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Makheloth, and encamped at Tahath. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Makheloth, and put up their tents in Tahath. \n\u003cbr\u003e33:27 [hgb]\u0026nbsp; 从 他 哈 起 行 ， 安 营 在 他 拉 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Tahath, and pitched at Tarah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Tahath, and put up their tents in Terah. \n\u003cbr\u003e33:28 [hgb]\u0026nbsp; 从 他 拉 起 行 ， 安 营 在 密 加 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Tarah, and pitched in Mithcah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Terah, and put up their tents in Mithkah. \n\u003cbr\u003e33:29 [hgb]\u0026nbsp; 从 密 加 起 行 ， 安 营 在 哈 摩 拿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they went from Mithcah, and pitched in Hashmonah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Mithkah, and put up their tents in Hashmonah. \n\u003cbr\u003e33:30 [hgb]\u0026nbsp; 从 哈 摩 拿 起 行 ， 安 营 在 摩 西 录 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Hashmonah, and encamped at Moseroth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Hashmonah, and put up their tents in Moseroth. \n\u003cbr\u003e33:31 [hgb]\u0026nbsp; 从 摩 西 录 起 行 ， 安 营 在 比 尼 亚 干 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Moseroth, and pitched in Benejaakan. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Moseroth, and put up their tents in Bene-jaakan. \n\u003cbr\u003e33:32 [hgb]\u0026nbsp; 从 比 尼 亚 干 起 行 ， 安 营 在 曷 哈 及 甲 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Benejaakan, and encamped at Horhagidgad. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Bene-jaakan, and put up their tents in Hor-haggidgad. \n\u003cbr\u003e33:33 [hgb]\u0026nbsp; 从 曷 哈 及 甲 起 行 ， 安 营 在 约 巴 他 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they went from Horhagidgad, and pitched in Jotbathah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Hor-haggidgad, and put up their tents in Jotbathah. \n\u003cbr\u003e33:34 [hgb]\u0026nbsp; 从 约 巴 他 起 行 ， 安 营 在 阿 博 拿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Jotbathah, and encamped at Ebronah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Jotbathah, and put up their tents in Abronah. \n\u003cbr\u003e33:35 [hgb]\u0026nbsp; 从 阿 博 拿 起 行 ， 安 营 在 以 旬 迦 别 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Ebronah, and encamped at Eziongaber. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Abronah, and put up their tents in Ezion-geber. \n\u003cbr\u003e33:36 [hgb]\u0026nbsp; 从 以 旬 迦 别 起 行 ， 安 营 在 寻 的 旷 野 ， 就 是 加 低 斯 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Eziongaber, and pitched in the wilderness of Zin, which is Kadesh. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Ezion-geber, and put up their tents in the waste land of Zin (which is Kadesh). \n\u003cbr\u003e33:37 [hgb]\u0026nbsp; 从 加 低 斯 起 行 ， 安 营 在 何 珥 山 ， 以 东 地 的 边 界 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Kadesh, and pitched in mount Hor, in the edge of the land of Edom. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Kadesh, and put up their tents in Mount Hor, on the edge of the land of Edom. \n\u003cbr\u003e33:38 [hgb]\u0026nbsp; 以 色 列 人 出 了 埃 及 地 后 四 十 年 ， 五 月 初 一 日 ， 祭 司 亚 伦 遵 着 耶 和 华 的 吩 咐 上 何 珥 山 ， 就 死 在 那 里 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Aaron the priest went up into mount Hor at the commandment of the LORD, and died there, in the fortieth year after the children of Israel were come out of the land of Egypt, in the first day of the fifth month. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Aaron the priest went up into the mountain at the order of the Lord, and came to his death there, in the fortieth year after the children of Israel had come out of the land of Egypt, in the fifth month, on the first day of the month. \n\u003cbr\u003e33:39 [hgb]\u0026nbsp; 亚 伦 死 在 何 珥 山 的 时 候 年 一 百 二 十 三 岁 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Aaron was an hundred and twenty and three years old when he died in mount Hor. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Aaron was a hundred and twenty-three years old at the time of his death in Mount Hor. \n\u003cbr\u003e33:40 [hgb]\u0026nbsp; 住 在 迦 南 南 地 的 迦 南 人 亚 拉 得 王 听 说 以 色 列 人 来 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And king Arad the Canaanite, which dwelt in the south in the land of Canaan, heard of the coming of the children of Israel. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And news of the coming of the children of Israel came to the king of Arad, the Canaanite, who was living in the South in the land of Canaan. \n\u003cbr\u003e33:41 [hgb]\u0026nbsp; 以 色 列 人 从 何 珥 山 起 行 ， 安 营 在 撒 摩 拿 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from mount Hor, and pitched in Zalmonah. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from Mount Hor they went on, and put up their tents in Zalmonah. \n\u003cbr\u003e33:42 [hgb]\u0026nbsp; 从 撒 摩 拿 起 行 ， 安 营 在 普 嫩 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Zalmonah, and pitched in Punon. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Zalmonah, and put up their tents in Punon. \n\u003cbr\u003e33:43 [hgb]\u0026nbsp; 从 普 嫩 起 行 ， 安 营 在 阿 伯 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Punon, and pitched in Oboth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Punon, and put up their tents in Oboth. \n\u003cbr\u003e33:44 [hgb]\u0026nbsp; 从 阿 伯 起 行 ， 安 营 在 以 耶 亚 巴 琳 ， 摩 押 的 边 界 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Oboth, and pitched in Ijeabarim, in the border of Moab. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Oboth, and put up their tents in Iye-abarim at the edge of Moab. \n\u003cbr\u003e33:45 [hgb]\u0026nbsp; 从 以 耶 亚 巴 琳 起 行 ， 安 营 在 底 本 迦 得 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from Iim, and pitched in Dibongad. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from Iyim, and put up their tents in Dibon-gad. \n\u003cbr\u003e33:46 [hgb]\u0026nbsp; 从 底 本 迦 得 起 行 ， 安 营 在 亚 门 低 比 拉 太 音 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Dibongad, and encamped in Almondiblathaim. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from Dibon-gad they went on, and put up their tents in Almon-diblathaim. \n\u003cbr\u003e33:47 [hgb]\u0026nbsp; 从 亚 门 低 比 拉 太 音 起 行 ， 安 营 在 尼 波 对 面 的 亚 巴 琳 山 里 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they removed from Almondiblathaim, and pitched in the mountains of Abarim, before Nebo. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And from Almon-diblathaim they went on, and put up their tents in the mountains of Abarim, before Nebo. \n\u003cbr\u003e33:48 [hgb]\u0026nbsp; 从 亚 巴 琳 山 起 行 ， 安 营 在 摩 押 平 原 约 旦 河 边 ， 耶 利 哥 对 面 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they departed from the mountains of Abarim, and pitched in the plains of Moab by Jordan near Jericho. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And they went on from the mountains of Abarim, and put up their tents in the lowlands of Moab by Jordan at Jericho; \n\u003cbr\u003e33:49 [hgb]\u0026nbsp; 他 们 在 摩 押 平 原 沿 约 旦 河 边 安 营 ， 从 伯 耶 施 末 直 到 亚 伯 什 亭 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And they pitched by Jordan, from Bethjesimoth even unto Abelshittim in the plains of Moab. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Planting their tents by the side of Jordan from Beth-jeshimoth as far as Abel-shittim in the lowlands of Moab. \n\u003cbr\u003e33:50 [hgb]\u0026nbsp; 耶 和 华 在 摩 押 平 原 约 旦 河 边 ， 耶 利 哥 对 面 晓 谕 摩 西 说 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD spake unto Moses in the plains of Moab by Jordan near Jericho, saying, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And in the lowlands of Moab by Jordan at Jericho, the Lord said to Moses, \n\u003cbr\u003e33:51 [hgb]\u0026nbsp; 你 吩 咐 以 色 列 人 说 ， 你 们 过 约 旦 河 进 迦 南 地 的 时 候 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Speak unto the children of Israel, and say unto them, When ye are passed over Jordan into the land of Canaan; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Say to the children of Israel, When you go over Jordan into the land of Canaan, \n\u003cbr\u003e33:52 [hgb]\u0026nbsp; 就 要 从 你 们 面 前 赶 出 那 里 所 有 的 居 民 ， 毁 灭 他 们 一 切 錾 成 的 石 像 和 他 们 一 切 铸 成 的 偶 像 ， 又 拆 毁 他 们 一 切 的 丘 坛 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Then ye shall drive out all the inhabitants of the land from before you, and destroy all their pictures, and destroy all their molten images, and quite pluck down all their high places: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See that all the people of the land are forced out from before you, and put to destruction all their pictured stones, and all their metal images, and all their high places: \n\u003cbr\u003e33:53 [hgb]\u0026nbsp; 你 们 要 夺 那 地 ， 住 在 其 中 ， 因 我 把 那 地 赐 给 你 们 为 业 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And ye shall dispossess the inhabitants of the land, and dwell therein: for I have given you the land to possess it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And take the land for yourselves, for your resting-place: for to you I have given the land as your heritage. \n\u003cbr\u003e33:54 [hgb]\u0026nbsp; 你 们 要 按 家 室 拈 阄 ， 承 受 那 地 。 人 多 的 ， 要 把 产 业 多 分 给 他 们 。 人 少 的 ， 要 把 产 业 少 分 给 他 们 。 拈 出 何 地 给 何 人 ， 就 要 归 何 人 。 你 们 要 按 宗 族 的 支 派 承 受 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And ye shall divide the land by lot for an inheritance among your families: and to the more ye shall give the more inheritance, and to the fewer ye shall give the less inheritance: every man\u0027s inheritance shall be in the place where his lot falleth; according to the tribes of your fathers ye shall inherit. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And you will take up your heritage in the land by the decision of the Lord, to every family its part; the greater the family the greater its heritage, and the smaller the family the smaller will be its heritage; wherever the decision of the Lord gives to any man his part, that will be his; distribution will be made to you by your fathers\u0027 tribes. \n\u003cbr\u003e33:55 [hgb]\u0026nbsp; 倘 若 你 们 不 赶 出 那 地 的 居 民 ， 所 容 留 的 居 民 就 必 作 你 们 眼 中 的 刺 ， 肋 下 的 荆 棘 ， 也 必 在 你 们 所 住 的 地 上 扰 害 你 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But if ye will not drive out the inhabitants of the land from before you; then it shall come to pass, that those which ye let remain of them shall be pricks in your eyes, and thorns in your sides, and shall vex you in the land wherein ye dwell. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But if you are slow in driving out the people of the land, then those of them who are still there will be like pin-points in your eyes and like thorns in your sides, troubling you in the land where you are living. \n\u003cbr\u003e33:56 [hgb]\u0026nbsp; 而 且 我 素 常 有 意 怎 样 待 他 们 ， 也 必 照 样 待 你 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Moreover it shall come to pass, that I shall do unto you, as I thought to do unto them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And it will come about that as it was my purpose to do to them, so I will do to you.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/20/486.html","bookId":240,"creation":"Aug 1, 2019 7:39:12 AM","modification":"Aug 1, 2019 7:39:12 AM"}
