{"id":103883,"no":10,"title":"Page 10","content":"\u003cp\u003e“How many dead?” I asked. “One hundred thousand?”\u003c/p\u003e\n\u003cp\u003e“Twice that. Most of Tatjana’s family was among them. Eventually, the war ended, Yugoslavia was divvied up along ethnic lines, and Tatjana’s little part of the world became Bosnia and Herzegovina. Unfortunately, by then the bank in Sarajevo had been looted and the Lily stolen. Tatjana immigrated to the United States, met a nice guy, married, became a U.S. citizen, and now is running a resort on the south shore of Lake Superior in Ontonagon, a small village in the Upper Peninsula of Michigan. But the story doesn’t end there.”\u003c/p\u003e\n\u003cp\u003e“I didn’t think it would.”\u003c/p\u003e\n\u003cp\u003e“Somehow—I don’t have the details—the Lily fell into the hands of Dr. Arnaud Fornier, a French oncologist who dabbled in Asian art. Dr. Fornier sold the Lily at auction to Leo Gillard, an American. The publicity and money the good doctor earned from the sale convinced him to retire from medicine and open a gallery specializing in jade. However, he didn’t have the resources necessary to acquire true jade artifacts for his many newfound customers, so he resorted to forgery. Dr. Fornier is now doing time in La Santé Prison in Paris for art fraud. He represented himself at trial, never a good idea.”\u003c/p\u003e\n\u003cp\u003e“No, never,” I agreed.\u003c/p\u003e\n\u003cp\u003e“Meanwhile, the man who bought the Lily from him, who lived in Chicago, by the way—”\u003c/p\u003e\n\u003cp\u003e“Lived?” I said.\u003c/p\u003e\n\u003cp\u003e“Leo Gillard died last summer,” Heavenly said. “He took part in a yacht race that starts at Navy Pier in downtown Chicago and ends at Mackinac Island. The race had been run for over a hundred years without a single fatality until he fell off his boat and drowned. The weather was perfect, too. People were so shocked, they thought his crew must have mutinied and made him walk the plank, but there was no evidence of such.”\u003c/p\u003e\n\u003cp\u003e“And so,” I said.\u003c/p\u003e\n\u003cp\u003e“And so the Lily became the property of Gillard’s son, Jeremy, who apparently believed enough of the curse that he loaned the Jade Lily to the City of Lakes Art Museum. The museum is using the Lily to promote its anniversary. There was also talk of making it part of a traveling exhibit that could be displayed by other museums, for a price of course.”\u003c/p\u003e\n\u003cp\u003e“Until it was stolen.”\u003c/p\u003e\n\u003cp\u003e“Until it was stolen,” Heavenly repeated.\u003c/p\u003e\n\u003cp\u003e“Which you had nothing to do with.”\u003c/p\u003e\n\u003cp\u003e“Nothing at all.”\u003c/p\u003e\n\u003cp\u003e“Then why are you here? Better yet, why am I here?”\u003c/p\u003e\n\u003cp\u003e“Because you’re going after the Lily. It is your intention to buy it back from the artnappers and return it to the museum.”\u003c/p\u003e\n\u003cp\u003e“If you say so.”\u003c/p\u003e\n\u003cp\u003e“I do say so, but here’s the thing, McKenzie—the Lily belongs to Tatjana Durakovic. She had pretty much forgotten about it until she saw all the publicity that the City of Lakes generated. Now she wants it back.”\u003c/p\u003e\n\u003cp\u003e“Ahh,” I said. Suddenly it all made sense to me. “You represent Tatjana.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Did she come to you or did you contact her?”\u003c/p\u003e\n\u003cp\u003eHeavenly shrugged. “Does it matter?” she said.\u003c/p\u003e\n\u003cp\u003e“How much is Tatjana paying you?”\u003c/p\u003e\n\u003cp\u003e“Twenty-five percent of whatever the Lily realizes at auction. We believe it will sell for a lot more than the insured value. The other day a two-hundred-and-fifty-year-old jade water buffalo sold for over four million pounds.”\u003c/p\u003e\n\u003cp\u003e“How much is that in real money?”\u003c/p\u003e\n\u003cp\u003e“Six-point-six million dollars.”\u003c/p\u003e\n\u003cp\u003e“A tidy sum,” I said. “What do you want from me?”\u003c/p\u003e\n\u003cp\u003e“You understand that the Jade Lily is Tatjana’s property. It was stolen from her.”\u003c/p\u003e\n\u003cp\u003e“That’s not my concern.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, I’m asking you to do the right thing.”\u003c/p\u003e\n\u003cp\u003e“What’s the right thing?”\u003c/p\u003e\n\u003cp\u003e“After you make the exchange, after you buy the Lily from the artnappers, bring it to me. I’ll give it to Tatjana.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“No? Just like that, no?”\u003c/p\u003e\n\u003cp\u003e“If Tatjana wants the Lily, tell her to hire a lawyer.”\u003c/p\u003e\n\u003cp\u003e“C’mon, McKenzie. Think about it.”\u003c/p\u003e\n\u003cp\u003e“Nothing to think about. I’m not going to break my word to the museum.”\u003c/p\u003e\n\u003cp\u003e“I’ll give you ten percent of my end.”\u003c/p\u003e\n\u003cp\u003eInstead of answering, I just smiled at the suggestion.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought you’d say.” Heavenly’s lovely face became very sad, very serious. “But I had to ask.”\u003c/p\u003e\n\u003cp\u003e“Where does that leave us?”\u003c/p\u003e\n\u003cp\u003eHeavenly patted my knee again. “Don’t worry, McKenzie. We’re still friends.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“If you won’t help me, I’ll get the Lily from the thieves myself.” Heavenly’s smile suddenly became as luminous as ever. “Failing that, I’ll just have to steal it from you.”\u003c/p\u003e\n\u003cp\u003e“Do you know who has the Lily?”\u003c/p\u003e\n\u003cp\u003eHeavenly leaned in close. “Do you know the secret to a successful relationship?” she asked. “Secrets.”\u003c/p\u003e\n\u003cp\u003eHeavenly kissed me full on the mouth. I might have resisted except, well, my hands were cuffed behind me.\u003c/p\u003e\n\u003cp\u003e“See you around, McKenzie,” she said. Heavenly slid open the door to the van and stepped out. “Tommy, take McKenzie back to Lake Calhoun. Don’t be foolish enough to give him the keys to the handcuffs until you’re safely driving out of the parking lot.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-10.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
