{"id":103884,"no":11,"title":"Page 11","content":"\u003cp\u003eHeavenly’s thugs—they were far too pretty to be called that, but still—did exactly as she told them, the one named Tommy handing me the key through the window of the van before driving off. I unwound the cuffs and dropped them into the pocket of my coat—you never know when they might come in handy. I walked through the cold toward the South Beach. It was nearly 5:00 P.M. and already dark; the lights of the city’s skyline glistened like stars against the snow and ice. My cell phone played the Ella Fitzgerald–Louis Armstrong cover of “Summertime” just as I reached the Jeep Cherokee. I answered the way I always did.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” I said.\u003c/p\u003e\n\u003cp\u003e“What the hell is going on?” a voice asked. It was a young man’s voice—he made no attempt to disguise it electronically or otherwise.\u003c/p\u003e\n\u003cp\u003e“Did you get a good look at me walking around the lake with the rose?”\u003c/p\u003e\n\u003cp\u003e“We got a good look at the people who jumped you and dragged you off. What was that about?”\u003c/p\u003e\n\u003cp\u003eWe, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“It would seem someone else wants the Jade Lily,” I said.\u003c/p\u003e\n\u003cp\u003eThe caller paused. While he thought it over, I climbed inside the Cherokee and fired it up.\u003c/p\u003e\n\u003cp\u003e“Who?” he asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I said. “Names were not exchanged.”\u003c/p\u003e\n\u003cp\u003eI can’t say why I lied, but the caller seemed to believe me. After another pause, he said, “It doesn’t matter. Once you pay for the Lily, we don’t care what happens to it. Just don’t fuck with us.”\u003c/p\u003e\n\u003cp\u003e“Who? Me?”\u003c/p\u003e\n\u003cp\u003e“You think this is funny? You think this is a game?”\u003c/p\u003e\n\u003cp\u003eI pivoted in a slow circle in my seat, looking through the SUV’s windows, trying to take in everyone around me, looking for someone, anyone, who was speaking into a cell phone. I saw nothing to arouse my suspicion.\u003c/p\u003e\n\u003cp\u003e“No,” I said. “I really don’t.”\u003c/p\u003e\n\u003cp\u003e“We’ll call again when the money is ready. Make sure they get it right. One million two hundred and seventy thousand dollars, half in twenties, half in fifties. Nonsequential bills.”\u003c/p\u003e\n\u003cp\u003e“Do you have any idea how much cash that is?” I said. “Do you know how much it weighs? Ninety-five pounds give or take.”\u003c/p\u003e\n\u003cp\u003e“Exactly ninety-seven pounds fourteen-point-four ounces,” he said. “Have them divide the money into three bags, the same amount and the same weight in each bag.”\u003c/p\u003e\n\u003cp\u003e“You’ve done this before,” I said.\u003c/p\u003e\n\u003cp\u003e“Have you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThat caused him to pause.\u003c/p\u003e\n\u003cp\u003e“Yes, yes you have,” he insisted. “Otherwise how would you have known about the money?”\u003c/p\u003e\n\u003cp\u003e“Just a lucky guess.”\u003c/p\u003e\n\u003cp\u003eHe paused again.\u003c/p\u003e\n\u003cp\u003e“I told you, McKenzie,” he said. “This isn’t a game. You know what will happen if you try to play us.”\u003c/p\u003e\n\u003cp\u003e“No. What?”\u003c/p\u003e\n\u003cp\u003eHe hung up without responding.\u003c/p\u003e\n\u003cp\u003eAs soon as the conversation ended, I called Mr. Donatucci.\u003c/p\u003e\n\u003cp\u003e“What happened?” he asked.\u003c/p\u003e\n\u003cp\u003eI told him that the artnappers made contact. I didn’t speak of Heavenly. I wanted to see if Donatucci mentioned her first, see if he had kept me under surveillance despite his promise not to. At least that’s what I told myself.\u003c/p\u003e\n\u003cp\u003eI explained about the money.\u003c/p\u003e\n\u003cp\u003e“Three bags suggest three partners,” Donatucci said.\u003c/p\u003e\n\u003cp\u003e“These guys seem to know what they’re doing,” I said. “But…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“They don’t know who I am.”\u003c/p\u003e\n\u003cp\u003e“We guessed that when they demanded you walk around the lake with a rose in your hand.”\u003c/p\u003e\n\u003cp\u003e“I don’t mean they don’t know what I look like,” I said. “I mean they have no idea who I am. They know nothing about my background. To them I’m just a name.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if that’s good or bad.”\u003c/p\u003e\n\u003cp\u003e“Me neither.”\u003c/p\u003e\n\u003cp\u003e“What next?” Donatucci asked.\u003c/p\u003e\n\u003cp\u003e“Follow their instructions, I guess. Also, I need to speak with someone who can give me a crash course in analyzing ancient jade artifacts so I can identify the Lily, make sure it’s not a fake before I give up the money.”\u003c/p\u003e\n\u003cp\u003e“Then you’re going to go through with it?” Donatucci asked.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eTHREE \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-11.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
