{"id":103886,"no":13,"title":"Page 13","content":"\u003cp\u003e“Ahh, no.”\u003c/p\u003e\n\u003cp\u003eA moment later, Jenness Crawford, Nina’s assistant manager, appeared and asked if I wanted the usual—that would be a Summit Ale. I said I did.\u003c/p\u003e\n\u003cp\u003e“Where’s Nina?” I asked.\u003c/p\u003e\n\u003cp\u003e“She’s hiding in her office,” Jenness said.\u003c/p\u003e\n\u003cp\u003e“Wow.”\u003c/p\u003e\n\u003cp\u003e“Want another root beer, hon?” she asked Victoria.\u003c/p\u003e\n\u003cp\u003e“That depends. Are you buying, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Yes, I’m buying.”\u003c/p\u003e\n\u003cp\u003eVictoria ordered another bottle of root beer.\u003c/p\u003e\n\u003cp\u003e“I am so getting a car,” she said when Jenness left.\u003c/p\u003e\n\u003cp\u003e“Don’t hold your breath,” I said.\u003c/p\u003e\n\u003cp\u003eA few moments later, Jenness returned with my Summit and the root beer and then went back to the bar. Erica suddenly appeared. I gave her a hug.\u003c/p\u003e\n\u003cp\u003eNearly everyone called her Rickie, yet I vowed when I started spending time with her mother that I wouldn’t use her nickname unless she gave me permission. She never did. Later, I learned she was grateful that I called her Erica, that she had dismissed Rickie as a child’s name, and since she was no longer a child, only those people who knew her as a child would be allowed to call her that. Apparently everyone she knew in New Orleans called her Erica.\u003c/p\u003e\n\u003cp\u003e“How come you’re not at Tulane?” I asked.\u003c/p\u003e\n\u003cp\u003e“I changed my flight to tomorrow morning,” she said. “I wanted to be here for this.”\u003c/p\u003e\n\u003cp\u003eShe sat next to Victoria on the other side of the booth, giving the younger girl a playful push to make room. Victoria immediately wrapped her arm around Erica’s. Erica had become Victoria’s big sister at about the same time she got her driver’s license.\u003c/p\u003e\n\u003cp\u003e“Ghosts, Erica,” I said. “Really?”\u003c/p\u003e\n\u003cp\u003e“There are ghosts here.”\u003c/p\u003e\n\u003cp\u003e“No, there aren’t.”\u003c/p\u003e\n\u003cp\u003e“Sure there are. Last year, after closing, I was helping out, trying to make some spending money for college. I was cleaning the shelves below the bar. I took all the glasses out and set them on top of the bar and cleaned the shelf. When I looked up”—she paused dramatically—“all of the glasses were stacked like a pyramid. Explain that, huh? Then, later, I was vacuuming. Suddenly I felt this hand and it was brushing up and down my arm like this.” Erica leaned across the table and started moving her hand across my arm from my shoulder to my elbow. “McKenzie, there was no one there. This happened three times while I was vacuuming and there was no one there.”\u003c/p\u003e\n\u003cp\u003eThe skepticism must have shown in my face, because Erica quickly turned to the girl next to her.\u003c/p\u003e\n\u003cp\u003e“Vicky, Vicky,” she said. “Tell him what happened to you.”\u003c/p\u003e\n\u003cp\u003e“It was the same thing with me,” Victoria said. “I was broke because some people aren’t as generous as they could be and Nina gave me a job cleaning up the basement. Last summer, remember? I was in the basement, moving stuff around, and the lights went off. You know how dark it is in the basement? Scary. I mean, it was really scary. I felt along the wall till I reached the door. Once I found the door, I was able to find the light switch. It was in the off position. No fuse blew, no light burned out. Someone turned off the lights? How was that possible? I turned the lights back on. This time I propped the basement door open with a chair, okay, so I had the hall lights working for me. I went back to work, and the lights, the overhead lights, went off a second time. I went back to the switch; it was in the off position again. I turned the light back on, and then whoosh—the chair went flying across the basement like someone threw it and the door slammed shut. I pushed the door open—and it was hard, it was like someone was leaning against it—and the lights went off again. That was enough for me.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said.\u003c/p\u003e\n\u003cp\u003e“Okay?” Erica repeated. “Did you hear what happened to the singer?”\u003c/p\u003e\n\u003cp\u003e“What singer?”\u003c/p\u003e\n\u003cp\u003e“The jazz singer that you like so much. She’s onstage with her trio doing a sound check, and all of a sudden she hears glass like people are mixing drinks and the sound of laughter and she doesn’t know where it’s coming from because the upstairs performance area is closed. There’s no one there, right; it’s not open yet. But the noise is getting louder and louder, and she asked her guys if they could hear it and they couldn’t. They couldn’t hear a thing? Huh? Huh?”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003e“What do you mean what happened?”\u003c/p\u003e\n\u003cp\u003e“Did she do the show?”\u003c/p\u003e\n\u003cp\u003e“Of course she did,” Erica said. “The show always goes on.”\u003c/p\u003e\n\u003cp\u003e“Did she keep hearing the noise?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. I think it went away.”\u003c/p\u003e\n\u003cp\u003eI looked at Victoria. “What happened to the basement?”\u003c/p\u003e\n\u003cp\u003e“After a little while, I went back down and cleaned it up.”\u003c/p\u003e\n\u003cp\u003e“Did the lights go off again? Did the door slam?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t mean anything,” Erica said.\u003c/p\u003e\n\u003cp\u003e“Ladies, have you ever read Sherlock Holmes?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-13.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
