{"id":103901,"no":28,"title":"Page 28","content":"\u003cp\u003e“I did.”\u003c/p\u003e\n\u003cp\u003e“Loaned it to the museum. Thought I was doing a good deed. That’ll teach me. Anyway, I was told about the Lily. One of the things I was told was that its recovery might very well depend on your involvement.”\u003c/p\u003e\n\u003cp\u003e“Mr. Gillard—”\u003c/p\u003e\n\u003cp\u003e“Jerry. Mr. Gillard was the old man’s name. Listen, McKenzie, I understand your reluctance. I’m on your side in this. Perrin suggested that a personal appeal from me might change your mind and I agreed to give it a go, but the more I thought about it—you’d be nuts to go after the Lily. Hell’s bells, I wouldn’t do it and it belongs to me, so why should you? Nearly everyone who’s touched the damn thing has suffered for it, including my old man.”\u003c/p\u003e\n\u003cp\u003e“I was sorry to hear about your father,” I said.\u003c/p\u003e\n\u003cp\u003e“Thank you for that. In any case, here’s the deal—if you decide to go after the Lily, I’ll match whatever amount the insurance company is offering you. But I don’t want you taking any unnecessary risks.”\u003c/p\u003e\n\u003cp\u003e“I appreciate that.”\u003c/p\u003e\n\u003cp\u003e“You need to know, McKenzie, really, you need to know—at the end of the day it’s just a really pretty rock. And it’s insured.”\u003c/p\u003e\n\u003cp\u003eAt last, my inner voice said. The voice of reason.\u003c/p\u003e\n\u003cp\u003e“I appreciate that,” I said again.\u003c/p\u003e\n\u003cp\u003e“All right. I made the call as promised. My conscience is clear. I’m flying into the Cities tomorrow. Whatever you decide, I’d be honored if you let me buy you a drink or two or three.”\u003c/p\u003e\n\u003cp\u003e“I know just the place.”\u003c/p\u003e\n\u003cp\u003e“Excellent. I have your number. I’ll call when I get in.”\u003c/p\u003e\n\u003cp\u003e“Do that.”\u003c/p\u003e\n\u003cp\u003e“Good-bye, McKenzie.”\u003c/p\u003e\n\u003cp\u003eGillard hung up, and as I put my cell in my pocket, I thought: Now that’s how it’s done. No threats. No insults. No sob stories. No appeals to the angels of our better nature. Just plain old-fashioned charm and sincerity. Plus a cash bonus. That’s how you make friends and influence people.\u003c/p\u003e\n\u003cp\u003eThe sun had already set by the time I reached my home in Falcon Heights. As I turned into my driveway, the Cherokee’s headlights swept across the rear bumper of a Nissan Altima parked in front of my house. I didn’t recognize the car, and the sight of it started my internal alarm bells ringing. They became louder when I noticed my kitchen light was on. There were logical explanations for both: The car belonged to someone visiting a neighbor; I had forgotten to turn off the light. Yet that didn’t quiet my anxiety. I wasn’t usually that paranoid, but let’s face it—it had been one of those days.\u003c/p\u003e\n\u003cp\u003eI parked in my garage and made my way to my rear door. It was unlocked, an astonishing thing in itself, but the fact that my security system wasn’t screaming intruder alert and that the place wasn’t crawling with private cops from my security company or real cops from the City of St. Anthony, was what made me pause. Do I report a burglary and wait for the police to arrive, or do I go inside? The answer came with a lyrical shout.\u003c/p\u003e\n\u003cp\u003e“McKenzie, is that you?”\u003c/p\u003e\n\u003cp\u003eI stepped through the door and into the kitchen. Heavenly Petryk was sitting at the table; a white ski jacket with a fur-lined hood was draped over the back of a chair. She was drinking coffee from one of my mugs.\u003c/p\u003e\n\u003cp\u003e“I hope you don’t mind that I let myself in,” she said. “It was damn cold outside.”\u003c/p\u003e\n\u003cp\u003e“How did you…?” I completed the question by throwing a thumb at the back door.\u003c/p\u003e\n\u003cp\u003e“The door was open and the security system was turned off.”\u003c/p\u003e\n\u003cp\u003e“No they weren’t.”\u003c/p\u003e\n\u003cp\u003e“That’s my story and I’m sticking to it.”\u003c/p\u003e\n\u003cp\u003e“I could shoot you for an intruder.”\u003c/p\u003e\n\u003cp\u003e“Nah, you wouldn’t do that.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because you like me. Besides, it would be a tough story to sell. There’s no evidence of forced entry.”\u003c/p\u003e\n\u003cp\u003eI glanced at the back door again. I hadn’t been surprised by her talents as a researcher. Heavenly had a master’s degree in English, after all. But this?\u003c/p\u003e\n\u003cp\u003e“You’ve become more resourceful since we last met,” I said. “Daring, too.”\u003c/p\u003e\n\u003cp\u003e“Heavenly Petryk, fortune hunter. I’m thinking of having cards made up.”\u003c/p\u003e\n\u003cp\u003e“Fortune hunter. Isn’t that the same as gold digger?”\u003c/p\u003e\n\u003cp\u003eHeavenly spun in her chair and looked up at me. “If you were still a lowly police officer making a lowly police officer’s salary, I bet you would have married your rich, club-owning girlfriend a long time ago.”\u003c/p\u003e\n\u003cp\u003eI had nothing to say to that. I went to the coffeemaker and poured out a mug, then sat at the kitchen table across from her.\u003c/p\u003e\n\u003cp\u003e“So, Heavenly,” I said. “Where are your playmates?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t my turn to watch them.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“Besides, I needed a break. They’re so needy.”\u003c/p\u003e\n\u003cp\u003e“I thought that was one of your requirements.”\u003c/p\u003e\n\u003cp\u003e“Only in accomplices. I demand more from my men.”\u003c/p\u003e\n\u003cp\u003e“How’s that going for you? Still seeing Boston Whitlow?”\u003c/p\u003e\n\u003cp\u003e“That ended a long time ago.” Heavenly exhaled loudly when she said it, and I wondered if it was a sigh of regret. “Are you going to invite me to your bedroom?”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-28.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
