{"id":103907,"no":34,"title":"Page 34","content":"\u003cp\u003e“I hope not,” I said. “Have you met India Cooper?”\u003c/p\u003e\n\u003cp\u003eGillard spun toward her. “Ms. Cooper,” he said. “Always a pleasure.”\u003c/p\u003e\n\u003cp\u003eDonatucci spoke up. “I was telling Mr. Gillard—”\u003c/p\u003e\n\u003cp\u003e“Jerry, Jerry,” Gillard said. “Everyone is so formal around here.”\u003c/p\u003e\n\u003cp\u003e“I was telling Jerry that the money is ready,” Donatucci said. “It’s been gathered, marked, bagged—”\u003c/p\u003e\n\u003cp\u003e“What does that mean, marked?” Gillard asked. “Do you put a little blue dot in the upper right corner or something?”\u003c/p\u003e\n\u003cp\u003e“The bills are funneled through a couple of scanners featuring optical character recognition software,” I said. “When the process is complete, you’ll have an electronic file containing the images of the bills—front and back—as well as all of the serial numbers. That way, if we do catch the artnappers and they do have the money on them, we can prove the bills were part of the ransom.”\u003c/p\u003e\n\u003cp\u003e“Do we really want to catch these guys? Once we pay off the ransom and get the Lily back, no harm, no foul, am I right?”\u003c/p\u003e\n\u003cp\u003e“How ’bout that, Mr. Donatucci?” I said. “One-point-three million. No foul?”\u003c/p\u003e\n\u003cp\u003e“Our primary concern is retrieving the Jade Lily,” he said.\u003c/p\u003e\n\u003cp\u003e“Of course. Anyway…” I turned back to Gillard. “The thieves won’t get away scot-free. The cops will go after them. Lieutenant Rask will insist on it.”\u003c/p\u003e\n\u003cp\u003e“Sounds like somebody else’s problem,” Gillard said. “Where’s the money now?”\u003c/p\u003e\n\u003cp\u003e“In a vault in the Midwest Farmers Insurance Group offices in downtown St. Paul,” Donatucci said. “Three bags, each weighing exactly thirty-two-point-six pounds as instructed. When the call comes, we’ll hand off the bags to McKenzie in the parking ramp under our building. There will be several armed guards keeping watch.”\u003c/p\u003e\n\u003cp\u003e“Hope they’re more reliable than the guards working here,” Gillard said. “Ohhh,” he added as he spun to face Perrin. She winced as he faked a couple of punches. “Low blow. A foul is called. The ref deducts points. No kidding, Perrin. Don’t worry about it. I’m not. So what happens next?”\u003c/p\u003e\n\u003cp\u003e“We wait until the thieves call,” I said.\u003c/p\u003e\n\u003cp\u003e“Well, we don’t have to wait here, do we? McKenzie, what’s this bar you were telling me about?”\u003c/p\u003e\n\u003cp\u003eWe decided to drive separately since I might have to abandon him at a moment’s notice. I gave Gillard detailed directions on how to reach Rickie’s from the museum; he had a navigation system in his rental car, but we both agreed that it couldn’t be trusted. I asked Mr. Donatucci if he wanted to join us. He declined, saying that he would return to the office and wait for my call.\u003c/p\u003e\n\u003cp\u003ePerrin thanked me again for agreeing to recover the Lily, but I blew her off. I wasn’t sure why, but I was having fun again.\u003c/p\u003e\n\u003cp\u003eAs we were leaving the storage area, India called my name. I turned. She tossed the magnifying glass to me. I caught it with both hands and stuffed it in my pocket.\u003c/p\u003e\n\u003cp\u003e“Good luck,” she said.\u003c/p\u003e\n\u003cp\u003eGillard was parked illegally in front of the museum. I told him that this wasn’t Chicago and that fixing or ignoring parking tickets was not a privilege generally enjoyed by the better-heeled citizenry. He suggested that was just another reason why Minneapolis was considered a backwater burg. I told him to wait for me at the corner while I went to the ramp for my car.\u003c/p\u003e\n\u003cp\u003eThe vehicle was parked on the third floor, but instead of taking the elevator, I jogged up the stairs. Seeing Gillard made me realize that I could afford to lose a few pounds myself. I used to exercise every day, take martial arts training to keep sharp, target practice at the range. Nowadays, I spent too much time puttering around in my kitchen and playing too many rounds of golf from a cart. You could see it on the ice. I’m slower, relying too much on my stick, not taking the body like I used to. I tell myself that I’m getting older, that’s why I’ve lost a step, even as I applaud myself for still playing hockey thirty weeks out of the year. That was just rationalization, though—the last refuge of a loser. The truth is, I was getting lazy. I was starting to enjoy my money too much.\u003c/p\u003e\n\u003cp\u003eI was breathing hard when I reached my floor, but not too hard. A couple of days in the gym and I’d be as good as new, I told myself. My car, a phantom black (that’s the color, honest) Audi S5 coupe with all the bells and whistles that I picked up at the bargain price of $71,000, was parked a half-dozen stalls from the door. I used to drive an Audi TT 225 until it was shot to death by a thug armed with an MP-9 submachine gun. I had been extra careful with this car, storing it in the garage for most of the winter, preferring to let my beaten-up four-wheel-drive Jeep Cherokee do the heavy lifting. However, among other things, the Audi had a splendid security system, and if I was going to schlep around a million-three in cash … I used my remote control key chain to disable the alarm and unlock the doors. I was reaching for the door handle when I heard him.\u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-34.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
