{"id":103914,"no":42,"title":"Page 42","content":"\u003cp\u003e“I suppose we are.”\u003c/p\u003e\n\u003cp\u003eRask leaned back in the chair, his chin pointed at the ceiling, and closed his eyes. “McKenzie,” he said, “sometimes I think I spend more time watching the sun go up and watching it go down than a person should, you know.”\u003c/p\u003e\n\u003cp\u003e“Did Tommy kill Noehring?” I asked.\u003c/p\u003e\n\u003cp\u003e“No,” he said without opening his eyes. “There was no gunshot residue on his hands or clothes. Plus, Tommy was carrying a nine-millimeter that hadn’t been fired recently. Noehring was shot with a .25.”\u003c/p\u003e\n\u003cp\u003e“The same caliber as the gun that killed Tarpley,” I said.\u003c/p\u003e\n\u003cp\u003eRask glanced at his watch. “I should be hearing from ballistics at about—at about right now, goddammit.”\u003c/p\u003e\n\u003cp\u003e“Think it’s a pro?” I asked.\u003c/p\u003e\n\u003cp\u003e“No. Tarpley took one round to the throat. That’s sloppy work. Noehring was shot in the back of the head; I’ll give you that. The first round, though, hit him on the right side just below the shoulder blade. It’s possible the second shot—the shooter might have been aiming at his back again and missed.”\u003c/p\u003e\n\u003cp\u003e“Or not,” I said.\u003c/p\u003e\n\u003cp\u003e“Or not. This Tommy, no priors, nothing. What the hell was he doing?”\u003c/p\u003e\n\u003cp\u003e“I have nothing more to add to what I’ve already told you. I only knew his first name and that he was involved with Heavenly Petryk.”\u003c/p\u003e\n\u003cp\u003e“There’s a piece of work for you.”\u003c/p\u003e\n\u003cp\u003e“Have you interviewed her yet?”\u003c/p\u003e\n\u003cp\u003e“Briefly. I left her alone in the interrogation room to think about it awhile before I go back down.”\u003c/p\u003e\n\u003cp\u003e“What else do you need from me?”\u003c/p\u003e\n\u003cp\u003eRask opened his eyes and lurched forward in the chair. “There are no cameras in this room,” he said. “No audio.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I want you to tell me everything that you left out of your statement.”\u003c/p\u003e\n\u003cp\u003e“Even the stuff you don’t want to hear?”\u003c/p\u003e\n\u003cp\u003e“Everything.”\u003c/p\u003e\n\u003cp\u003e“Clay.” I used his first name because I wanted him to know that I was on his side. “Noehring was dirty.”\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003e“I don’t know how he knew I was at Loring Park, but he was there to kill the thieves and steal the money or kill me and steal the money, one or the other, maybe both. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me you’re sorry. Tell me how you know this.”\u003c/p\u003e\n\u003cp\u003eI gave Rask a near verbatim account of my conversations with Noehring, first at the restaurant early Tuesday evening and then later at the parking ramp of the museum.\u003c/p\u003e\n\u003cp\u003e“All right, you told me,” Rask said. “You got it off your chest. Now there’s no reason for you to tell anyone else.”\u003c/p\u003e\n\u003cp\u003e“LT—”\u003c/p\u003e\n\u003cp\u003e“Do you understand what I’m saying to you, McKenzie? You don’t repeat this story, not to anyone, not ever.”\u003c/p\u003e\n\u003cp\u003e“He was a bad cop.”\u003c/p\u003e\n\u003cp\u003e“I fucking know that. You don’t think I know that? He was paying alimony and child support, yet he drove a fucking BMW. He wore Italian overcoats and Armani suits and fucking silk ties. I know he was dirty, but no one else needs to know. Noehring was a hero cop—a hero cop who went down in the line of duty. The governor is going to speak at his goddamn funeral. There’s going to be a twenty-one-gun salute, so help me God.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“You know why, don’t you, McKenzie? I don’t have to explain why.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to explain.”\u003c/p\u003e\n\u003cp\u003eRask reached into his pocket and withdrew a small GPS transmitter that he tossed on the table.\u003c/p\u003e\n\u003cp\u003e“Department issue,” he said. “It was attached to the bumper of your Audi. That’s how Noehring knew you were at Loring Park.”\u003c/p\u003e\n\u003cp\u003eI picked it up, glanced at it, and dropped it on the table.\u003c/p\u003e\n\u003cp\u003eNow, if I only knew how Tommy found me, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“You probably have one on your Jeep Cherokee, too,” Rask said. “If you do, destroy it, just get rid of it.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I keep thinking, if I was allowed to investigate Tarpley’s murder the right way none of this would have happened.”\u003c/p\u003e\n\u003cp\u003e“You might be right.”\u003c/p\u003e\n\u003cp\u003e“This Lily, this fucking Jade Lily—it’s not just between the thieves and the museum anymore. Or the state department or that bitch Petryk or anyone else. Right, McKenzie? Right?”\u003c/p\u003e\n\u003cp\u003e“Right,” I said.\u003c/p\u003e\n\u003cp\u003e“It’s about cop killers. So if you get anything—anything at all…”\u003c/p\u003e\n\u003cp\u003e“I’ll let you know, LT.”\u003c/p\u003e\n\u003cp\u003e“I spoke to the prosecutors. This thing with Tommy is going into the books as self-defense. The gun plus the witness who saw the gun in Tommy’s hand proves he came at you with deadly force, and the law allows you to respond with at least equal force, so no charges will be filed.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re free to go.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“This thing with the Jade Lily, if you continue to pursue it—I’m not saying you should. It could be dangerous for you, McKenzie, but if you do, don’t fuck around. Call me. Give me time and place. I’ll do my best to cover your ass.”\u003c/p\u003e\n\u003cp\u003eI held out the pinkie of my right hand. “Best friends forever, Clay?” I said.\u003c/p\u003e\n\u003cp\u003e“I changed my mind. Don’t call me Clay.”\u003c/p\u003e\n\u003cp\u003eI took that as a yes.\u003c/p\u003e\n\u003cp\u003eEIGHT \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-42.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
