{"id":103916,"no":44,"title":"Page 44","content":"\u003cp\u003e“Yes. No. I don’t know. Maybe.”\u003c/p\u003e\n\u003cp\u003eThis time it was my turn to sigh dramatically.\u003c/p\u003e\n\u003cp\u003e“I’m not sure about this, Mr. Donatucci. The artnappers killed at least two guys, and one of them was police. Do we want to reward them for that?”\u003c/p\u003e\n\u003cp\u003e“Do we know that for sure?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Do we know that the artnappers killed Tarpley and Noehring?”\u003c/p\u003e\n\u003cp\u003e“Who else?”\u003c/p\u003e\n\u003cp\u003e“That’s the question, isn’t it? Who else had motive?”\u003c/p\u003e\n\u003cp\u003eI decided I was too tired to play Mr. Donatucci’s mind games and told him so. “Remember at the museum when I was told that it wasn’t my job to catch the thieves or to solve the crime?” I said. “I’m holding you to that.”\u003c/p\u003e\n\u003cp\u003eMr. Donatucci said that he would contact me—and I should contact him—if the thieves called. Then he hung up.\u003c/p\u003e\n\u003cp\u003eI stood in the empty, silent kitchen for a moment. My entire body longed for sleep. Yet I decided to make breakfast first. It wasn’t that I was hungry—although I was—as much as that I felt a need to do something. So I fried up a skillet of scrambled eggs with plenty of hot sausage, jalape?o chilies, green onions, tomato, and cilantro.\u003c/p\u003e\n\u003cp\u003eI didn’t taste any of it.\u003c/p\u003e\n\u003cp\u003eThe phone rang. I rolled across my bed to answer it. It was 10:00 A.M. I had all of four hours of sleep.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” I said.\u003c/p\u003e\n\u003cp\u003e“What the hell do you think you’re doing?” a man’s voice asked.\u003c/p\u003e\n\u003cp\u003eI hung up the phone. I rolled over and shut my eyes. The phone rang again. I gave it six rings before I answered, catching it just before the call rolled over to voice mail.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” I said.\u003c/p\u003e\n\u003cp\u003e“Don’t you dare hang up on me again,” the voice said.\u003c/p\u003e\n\u003cp\u003eI hung up. I stretched, yawned, and waited. Sure enough, the phone rang a third time. This time when I answered it, I said, “Good manners are how we show respect for one another.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause.\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie,” the voice said finally. “This is Jonathan Hemsted of the U.S. State Department.” Apparently he needed to remind me of that. “I hope I did not catch you at a bad time.”\u003c/p\u003e\n\u003cp\u003e“It’s been a long night,” I said.\u003c/p\u003e\n\u003cp\u003e“Yes, I know. I would like to speak to you about your long night.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Could you meet us at our hotel suite in, say, an hour’s time?”\u003c/p\u003e\n\u003cp\u003e“Us?”\u003c/p\u003e\n\u003cp\u003e“Mr. Pozderac will be sitting in.”\u003c/p\u003e\n\u003cp\u003e“Where is the hotel?”\u003c/p\u003e\n\u003cp\u003eHe told me. I hung up without saying good-bye. Like I said, good manners are how we show our respect for one another.\u003c/p\u003e\n\u003cp\u003eThe hotel was located west of Minneapolis on the I-394 strip within easy shuttle distance of Cargill, UnitedHealthcare, Minnesota Disposal and Recycling, General Mills, and a couple of other Fortune 500 companies. I crossed the lobby and caught the attention of a pretty clerk at the front desk. I kept my leather coat closed so she wouldn’t see the 9 mm I was wearing behind my right hip. She smiled brightly and asked how she could help me.\u003c/p\u003e\n\u003cp\u003e“Mr. Hemsted, please,” I said.\u003c/p\u003e\n\u003cp\u003eShe accessed her computer. The smile became a frown.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sir, we do not have a Mr. Hemsted registered.”\u003c/p\u003e\n\u003cp\u003e“Jonathan Hemsted. H-E-M-S-T-E-D.”\u003c/p\u003e\n\u003cp\u003e“No sir, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Perhaps it’s under the name Branko Pozderac. Please don’t ask me to spell it.”\u003c/p\u003e\n\u003cp\u003eShe checked again.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sir, there is no Mr. Branko Pozderac registered with us, either.”\u003c/p\u003e\n\u003cp\u003e“Are you sure? I spoke to the man an hour ago. He said he had a suite here.”\u003c/p\u003e\n\u003cp\u003e“A suite—” She checked her computer a third time. “Oh, I am so sorry, sir. Of course, both Mr. Hemsted and Mr. Pozderac are here. They’re staying in the suite owned by MDR. Please forgive me.”\u003c/p\u003e\n\u003cp\u003e“Think nothing of it.”\u003c/p\u003e\n\u003cp\u003e“A number of companies rent rooms and suites from us year-round for their business associates. We track their guests differently.”\u003c/p\u003e\n\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003e“Would you like me to call up and announce your arrival, or would you prefer to use the house phone?”\u003c/p\u003e\n\u003cp\u003eShe pointed at a red telephone on a low round table surrounded by several chairs in the center of the lobby.\u003c/p\u003e\n\u003cp\u003e“If it’s not too much trouble, please call up. Tell whoever answers the phone that McKenzie will be waiting in the bar.”\u003c/p\u003e\n\u003cp\u003e“No trouble at all, Mr. McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Thank you for your consideration.”\u003c/p\u003e\n\u003cp\u003eI turned away from the desk, reconnoitered my position, and then headed for the bar just off the lobby. As I did so, I wondered, MDR? How did Hemsted and Pozderac score a luxury suite owned by a waste management company?\u003c/p\u003e\n\u003cp\u003ePozderac drank whiskey, Hemsted drank wine, and I had a beer. I was sure that there was something significant about our individual tastes in alcohol, I just didn’t know what. Pozderac also ordered a plate of buffalo-style chicken wings because he was hungry and lunch was a good hour away. He ate them without benefit of a napkin, a transgression that seemed to offend Hemsted greatly.\u003c/p\u003e\n\u003cp\u003e“First, allow me to offer you my sincere condolences at the passing of your friend yesterday,” Hemsted said.\u003c/p\u003e\n\u003cp\u003e“You are referring to Lieutenant Noehring,” I said.\u003c/p\u003e\n\u003cp\u003e“Yes, of course.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-44.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
