{"id":103917,"no":45,"title":"Page 45","content":"\u003cp\u003e“He was not my friend.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“However, if you wish to contact Lieutenant Rask, I’m sure he’ll be happy to commiserate with you. In fact, I know the first thing he’ll ask. Where were you last night around 8:00 P.M.? You and your”—I passed up the many adverb-adjective-noun combinations that flashed through my head and settled on “friend.”\u003c/p\u003e\n\u003cp\u003e“We have spoken to your Lieutenant Rask this morning, and I must say he is an exceedingly rude man.”\u003c/p\u003e\n\u003cp\u003eI flashed on what Perrin Stewart said about him two days earlier.\u003c/p\u003e\n\u003cp\u003e“A lot of people think that,” I said. “What did you tell him?”\u003c/p\u003e\n\u003cp\u003e“I reminded Lieutenant Rask that Mr. Pozderac enjoys diplomatic immunity.”\u003c/p\u003e\n\u003cp\u003ePozderac smiled around a chicken wing. “Im-mun-i-ty” he pronounced slowly.\u003c/p\u003e\n\u003cp\u003e“What exactly do you want, Hemsted?” I asked. “Why am I here?”\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie…”\u003c/p\u003e\n\u003cp\u003e“Drop the mister. Let’s not pretend we’re friends.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, we can at least be civil, can we not?”\u003c/p\u003e\n\u003cp\u003e“I killed a man last night, pal. This is as civil as I’m going to get for a while.”\u003c/p\u003e\n\u003cp\u003e“You shoot police?” Pozderac asked.\u003c/p\u003e\n\u003cp\u003e“No, I didn’t. Did you?”\u003c/p\u003e\n\u003cp\u003eInstead of answering, Pozderac licked his fingers and picked up another wing.\u003c/p\u003e\n\u003cp\u003e“McKenzie, I thought we had an understanding,” Hemsted said. “You went after the Jade Lily without first contacting us.”\u003c/p\u003e\n\u003cp\u003e“Tell you what. Next time I set out to commit a felony, I’ll invite you both. We’ll have an outing.”\u003c/p\u003e\n\u003cp\u003e“What is felony?” Pozderac asked.\u003c/p\u003e\n\u003cp\u003e“A criminal act,” Hemsted said.\u003c/p\u003e\n\u003cp\u003ePozderac smiled again. There was buffalo sauce at the corners of his mouth and on his chin. “Im-mun-i-ty,” he said.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Hemsted said, “I made our position clear earlier. I see no reason to repeat it now. You must believe, I will do what I said I would do.”\u003c/p\u003e\n\u003cp\u003e“Destroy my life unless I steal for you. Is that why you asked me here, to remind me?”\u003c/p\u003e\n\u003cp\u003e“Frankly, yes. Going after the Lily the way you did without first contacting us smacked of recklessness. I need ample warning next time so that I might have time to make the necessary preparations to receive it from you and then remove it from the country.”\u003c/p\u003e\n\u003cp\u003e“You can’t just shove it into a diplomatic pouch and send it back to Bosnia COD?”\u003c/p\u003e\n\u003cp\u003e“Hardly.”\u003c/p\u003e\n\u003cp\u003e“Why are you here, Hemsted? In Minnesota? How did you know the Lily was going to be stolen?”\u003c/p\u003e\n\u003cp\u003e“We didn’t know. We came to secure the Lily from the museum. Its theft was a terrible inconvenience to us.”\u003c/p\u003e\n\u003cp\u003e“Is that all it was?”\u003c/p\u003e\n\u003cp\u003e“I wish you could see this our way. It really is in the national interest.”\u003c/p\u003e\n\u003cp\u003e“It’s probably moot, anyway,” I said.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Rask is hungry for an arrest. He has two dead bodies connected to the theft of the Lily, and one of them is a police officer. There’s no way you’re going to keep him off the case now. That means sooner or later the cops are going to get their hands on the Lily. The only way you’ll be able to take it out of the country after that is with lots and lots of publicity, and I have a feeling you don’t want any publicity.”\u003c/p\u003e\n\u003cp\u003eHemsted slipped a cell phone out of his pocket.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about that,” he said.\u003c/p\u003e\n\u003cp\u003eI expected him to make a call right then and there, yet he didn’t. Instead, he held on to the phone as if it were Aladdin’s magic lamp.\u003c/p\u003e\n\u003cp\u003ePozderac tossed down a chicken wing and wiped his fingers on the tablecloth. Hemsted winced and forced himself to look away.\u003c/p\u003e\n\u003cp\u003e“Enough talk,” Pozderac said. “You will return Lily. See to it.”\u003c/p\u003e\n\u003cp\u003eHe rose, turned his back to the table, and started walking toward the hotel’s elevators. Hemsted gave him a head start before he pushed back his chair and made ready to follow. I called his name. When he turned I told him, “Pozderac might have diplomatic immunity, but you don’t. Think about it.”\u003c/p\u003e\n\u003cp\u003eI don’t know if he did or didn’t.\u003c/p\u003e\n\u003cp\u003eI stopped at the front desk on my way out, once again catching the eye of the pretty desk clerk. I asked her if it was possible to learn when Hemsted and Pozderac had checked into the hotel. She hesitated for a moment, and I had no doubt that we were both thinking the same thing—it was against hotel policy to reveal information about its guests. She must have felt she owed me a favor after the mix-up earlier, though, because she quickly checked her computer and then leaned across the desk toward me.\u003c/p\u003e\n\u003cp\u003e“Eleven forty-five A.M. Sunday,” she said.\u003c/p\u003e\n\u003cp\u003eFourteen and a quarter hours before the Jade Lily was stolen, my inner voice figured.\u003c/p\u003e\n\u003cp\u003eI thanked her and left the hotel. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-45.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
