{"id":103923,"no":51,"title":"Page 51","content":"\u003cp\u003eHerzog set his hands on the handles at the back of Chopper’s wheelchair and prepared to push Chopper across the parking lot. Chopper turned his head and gave him a look. Herzog’s hands came off the handles as if he had touched hot burners on a stove. The expression on his face said, “I can’t believe I did that.”\u003c/p\u003e\n\u003cp\u003eChopper propelled himself to the street, off the curb, across the street, and up the opposite curb quickly, efficiently, and without assistance. Herzog followed dutifully behind. I had the impression that he really wanted to help and was disappointed that Chopper wouldn’t allow it. His mood brightened when we reached the front door of a beer joint and Chopper waited for him to open it. I assumed it was a beer joint because of the neon sign in the window flashing the name of one of those crappy pasteurized brews from St. Louis. There was no other means of identification.\u003c/p\u003e\n\u003cp\u003eI followed Chopper and Herzog inside. It was dark in the bar. The lights were kept low, and a thick curtain had been pulled across the one and only window. Tony Bennett could be heard singing softly from invisible speakers. Two older men were sitting in an old-fashioned wooden booth next to the door, the kind with high backs that you can’t see over. They looked like working men having a quick beer before their shifts began. A third man, much younger, sat at a table and read the newspaper. The table was situated so that he had an unobstructed view of both the front and back doors. His winter coat was draped over the back of the chair. His gloves and a knit cap had been set on the table near his right hand. He moved his hand toward the hat when we entered, yet did not touch it. He was not drinking.\u003c/p\u003e\n\u003cp\u003e“Got him?” I whispered.\u003c/p\u003e\n\u003cp\u003e“Pussy,” Herzog whispered back.\u003c/p\u003e\n\u003cp\u003eA fourth man was sitting in a booth parallel to the guy with the hat. There was a half-filled glass of beer in front of him, along with two cell phones and an iPad. He was talking on a third cell phone, his voice a soft murmur. I could make out only one word. “No.” There was a finality to the word that made my arm hairs stand on end—somehow I had the feeling he wasn’t saying no to a slice of French apple pie.\u003c/p\u003e\n\u003cp\u003eIf there was a bartender, he was invisible.\u003c/p\u003e\n\u003cp\u003eChopper wheeled his chair right up to the booth.\u003c/p\u003e\n\u003cp\u003e“Cid, my man,” he said.\u003c/p\u003e\n\u003cp\u003e“Chopper,” Cid said. He turned off his cell and set it on the table before slipping out of the booth. He was tall, with angular features, and was deceptively dressed in sweater, jeans, and black cowboy boots. I say deceptively because despite the casual appearance, I had the impression that his clothes cost more than the average new car payment. He bent down and gave Chopper a hug as if they were veterans of the same war.\u003c/p\u003e\n\u003cp\u003eChopper waved me over.\u003c/p\u003e\n\u003cp\u003e“This here is McKenzie I told you ’bout.”\u003c/p\u003e\n\u003cp\u003eCid did not say hello; he did not offer his hand. Instead, he gave me a perfunctory head nod and slid back into the booth.\u003c/p\u003e\n\u003cp\u003e“Have a seat,” he said.\u003c/p\u003e\n\u003cp\u003eI sat on the wooden bench across from him. Herzog stood by the door where he could keep a wary eye on the exits as well as the man with the knit hat. All in all, I felt as if I had walked into a Martin Scorsese movie.\u003c/p\u003e\n\u003cp\u003e“Nice place you have here,” I said.\u003c/p\u003e\n\u003cp\u003e“Did you think I would have a ritzy office with a good-looking receptionist, a mahogany desk, and Queen Anne chairs?” Cid asked “Something like that.”\u003c/p\u003e\n\u003cp\u003e“Men in my line of work aren’t afraid of the police. We can always make deals with the police. Do you know who we’re afraid of?”\u003c/p\u003e\n\u003cp\u003eIt wasn’t a rhetorical question. Cid expected me to answer it.\u003c/p\u003e\n\u003cp\u003e“The Internal Revenue Service,” I said.\u003c/p\u003e\n\u003cp\u003eHe smiled slightly and nodded his head as if he had just learned something of value.\u003c/p\u003e\n\u003cp\u003e“You’re quick,” he said. “Yes, the IRS. In my business it pays to keep your visible assets to a minimum.”\u003c/p\u003e\n\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003eCid stuck his head out of the booth and looked behind him. As if by magic, a bartender appeared.\u003c/p\u003e\n\u003cp\u003e“What can I get you gents?” the bartender asked.\u003c/p\u003e\n\u003cp\u003e“I’m good,” Chopper said.\u003c/p\u003e\n\u003cp\u003e“Hey, Chop,” Cid said. “This isn’t a nonprofit organization.”\u003c/p\u003e\n\u003cp\u003e“Gimme a Miller Genuine Draft,” Chopper said.\u003c/p\u003e\n\u003cp\u003eWhen the bartender turned his gaze on me I pointed at Cid’s glass.\u003c/p\u003e\n\u003cp\u003e“I’ll have what El Cid is having,” I said.\u003c/p\u003e\n\u003cp\u003eCid smiled as if it were the first time he had ever heard the name.\u003c/p\u003e\n\u003cp\u003eThe bartender gestured with his chin toward Herzog. “What about your friend?” he asked.\u003c/p\u003e\n\u003cp\u003e“My friend doesn’t drink,” Chopper answered.\u003c/p\u003e\n\u003cp\u003eWhen the bartender scurried away, I said, “How does one get the nickname of an eleventh-century Spanish lord?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-51.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
