{"id":103924,"no":52,"title":"Page 52","content":"\u003cp\u003e“I don’t know,” Cid said. “People just started calling me that. Perhaps they were impressed by my regal bearing.”\u003c/p\u003e\n\u003cp\u003eI liked the answer, yet I knew it was a lie. To survive, much less flourish, in his line of work, a fence must be able to negotiate with the most dangerous thieves as well as the least scrupulous customers. The fear of betrayal, of being ripped off, of being arrested, was always present, so it was important to demonstrate a certain amount of fearlessness. “El Cid” was an affectation, just like his barroom “office,” just like the barely concealed muscle pretending to read his newspaper while carefully watching us. It was designed to make associates believe that Cid was someone not to be trifled with. From what I’d seen, it certainly got Chopper thinking. Just the same, I said, “I believe it.”\u003c/p\u003e\n\u003cp\u003eCid must have liked my response, too, because he suddenly extended his hand. “My real name is Dave Wicker,” he said.\u003c/p\u003e\n\u003cp\u003eI shook his hand and said, “Mr. Wicker.”\u003c/p\u003e\n\u003cp\u003e“Cid.”\u003c/p\u003e\n\u003cp\u003e“Cid,” I repeated.\u003c/p\u003e\n\u003cp\u003eThe bartender returned with our drinks. “Twenty-two fifty,” he said.\u003c/p\u003e\n\u003cp\u003eChopper was shocked. “Wha?” he said.\u003c/p\u003e\n\u003cp\u003e“I got it,” I said and handed the bartender the fifty that I had offered Heavenly Petryk earlier. “Keep the change.”\u003c/p\u003e\n\u003cp\u003eChopper looked at me as if I were insane. Cid smiled some more.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” he said, “you didn’t come here to throw around your money. What can I do for you?”\u003c/p\u003e\n\u003cp\u003e“I have it on excellent authority that if anyone between Chicago and the West Coast knows what happened to the Jade Lily, it would be you.”\u003c/p\u003e\n\u003cp\u003e“I appreciate the flattery, but why bring Chicago into it?”\u003c/p\u003e\n\u003cp\u003eI spread my arms wide, the palms of my hands facing upward, as if I couldn’t think of a single reason.\u003c/p\u003e\n\u003cp\u003e“I know that the assistant director of security walked it out of the art museum Sunday night and handed it off to his associates,” Cid said. “I know that the next day he turned up dead, call it an occupational hazard. I know the artnappers contacted the museum Monday morning and offered to sell the item back for one-point-three million. I know that you were enlisted to act as go-between. Beyond that…”\u003c/p\u003e\n\u003cp\u003eThis time he spread his arms and hands apart.\u003c/p\u003e\n\u003cp\u003e“Have you ever met the assistant director of security?”\u003c/p\u003e\n\u003cp\u003e“We don’t exactly travel in the same circles.”\u003c/p\u003e\n\u003cp\u003e“Do you have any idea who his associates might be?”\u003c/p\u003e\n\u003cp\u003e“Why would I?”\u003c/p\u003e\n\u003cp\u003e“I think it’s obvious that they stole the Lily with the intention of selling it back to the museum. However, with two shootings and the heat on, they might now be interested in a fence. Who else would they go to?”\u003c/p\u003e\n\u003cp\u003eCid did indeed appreciate the flattery. He smiled and leaned against the wooden wall of the booth.\u003c/p\u003e\n\u003cp\u003e“There is no one else,” he said, “and I prefer the term facilitator. Unfortunately no, McKenzie. I haven’t heard anything.”\u003c/p\u003e\n\u003cp\u003e“Would you tell me if you had?”\u003c/p\u003e\n\u003cp\u003e“Yes, I think I would. I don’t appreciate it when out-of-towners piss in my soup without asking permission first. It’s a sign of disrespect.”\u003c/p\u003e\n\u003cp\u003e“You’re sure they’re from out of town?”\u003c/p\u003e\n\u003cp\u003e“I inquired among the usual suspects when I first learned of the heist—like I said, I was upset that the job was initiated without my consent.”\u003c/p\u003e\n\u003cp\u003eGood Lord, this guy is full of himself, my inner voice said. Who does he think he is, Kid Cann?\u003c/p\u003e\n\u003cp\u003e“I am now convinced that no local talent was involved,” Cid added. “It’s an out-of-town crew, all right. Maybe they recruited Tarpley, maybe he hired them, that I can’t say.”\u003c/p\u003e\n\u003cp\u003e“It does raise a question—why ask for me?”\u003c/p\u003e\n\u003cp\u003e“To act as go-between? I don’t know. After I spoke to Chopper, I had you checked out as well. You seem capable, but you’re inexperienced. You don’t have a history of this type of work.”\u003c/p\u003e\n\u003cp\u003eYou’re telling me, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“Based on your expertise, what do you think of this crew?” I asked aloud.\u003c/p\u003e\n\u003cp\u003e“It’s hard to say after the fiasco in Loring Park last night.”\u003c/p\u003e\n\u003cp\u003e“You know about that?”\u003c/p\u003e\n\u003cp\u003e“Of course. Now understand, the park was a good move. It demonstrated care and forethought. It was a test run, you see. That’s why they chose such a public place. They wanted to know if you could be trusted to come alone. Probably they hunkered down hours before, watched the exits and watched the traffic, saw how you handled the money, if you were nervous, if you were stand-up. When Noehring appeared, they should have just walked away. I don’t know why they didn’t. Shooting him was careless. In matters such as this, you invite as little police intervention as possible. Now—a cop killing? Everybody with a badge is looking for these guys. It’s bad for them. Bad for me. Bad for business. Bad all around. The police are leaning on anyone they can find.”\u003c/p\u003e\n\u003cp\u003eCid looked at Chopper. “Have they rousted you yet?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-52.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
