{"id":103925,"no":53,"title":"Page 53","content":"\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I’m sure they’ll get around to it. They’ve already chewed on my ass a number of times. And, gentlemen, the pressure isn’t going to let up until someone takes the fall. It doesn’t matter that Noehring was as dirty as they come. You knew that, didn’t you, McKenzie, that Noehring was dirty?”\u003c/p\u003e\n\u003cp\u003eI winced at the question. “What makes you say that?” I asked.\u003c/p\u003e\n\u003cp\u003e“Me and Noehring, we’ve had dealings, and they were always to his benefit.”\u003c/p\u003e\n\u003cp\u003e“Why do you think the artnappers killed him?”\u003c/p\u003e\n\u003cp\u003e“The only way it makes sense to me is if they thought Noehring was there to fuck them over—steal the money, steal the Lily. It puts them in a bad spot, though. Now the Lily is too hot to fence. Before the killing, they had the option of taking the Lily underground, wait a few years, and then find a private buyer. I know a dozen men in the Twin Cities alone who would have paid top dollar for the Jade Lily and then stash it in a vault until the statute of limitations ran out and they were able to establish a phony sales pedigree. Not now, not with a cop killing attached to it. There’s no time limit on that. The only thing the thieves can do now is either toss the Lily in a Dumpster or”—Cid wagged his index finger at me—“make the deal as previously agreed upon.”\u003c/p\u003e\n\u003cp\u003e“Then you think they’ll try again.”\u003c/p\u003e\n\u003cp\u003e“I know they will. Only next time, McKenzie, they’ll put you in a position where they can see trouble coming from a mile away. You’ll be isolated. You’ll be alone. An empty holster”—he pointed at the spot just behind my right hip where I carried the Beretta before Chopper made me give it up—“won’t help you.”\u003c/p\u003e\n\u003cp\u003e“You see a lot,” I said.\u003c/p\u003e\n\u003cp\u003e“It’s my business. Now let me ask you a question, McKenzie. Why did you smoke Heavenly’s boy?”\u003c/p\u003e\n\u003cp\u003eGod, he’s well informed.\u003c/p\u003e\n\u003cp\u003e“How did you know about that?”\u003c/p\u003e\n\u003cp\u003e“Like I said, it’s my business. Besides, it isn’t the deepest, darkest secret in the world.”\u003c/p\u003e\n\u003cp\u003e“He went for the money,” I said.\u003c/p\u003e\n\u003cp\u003e“Odd.”\u003c/p\u003e\n\u003cp\u003e“In what way?”\u003c/p\u003e\n\u003cp\u003e“Heavenly doesn’t want the ransom. She wants the Lily. She wants to return it to its rightful owner, for which she expects to be handsomely rewarded. Personally, I don’t see the difference.”\u003c/p\u003e\n\u003cp\u003e“How do you know Heavenly Petryk?”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know her,” Cid said. “Never met her. But I keep track of talent. They tell me she’s a stone babe. Almost as pretty as Tarpley’s wife—I’d have to see her myself to believe it, though.”\u003c/p\u003e\n\u003cp\u003e“Believe it.”\u003c/p\u003e\n\u003cp\u003e“I don’t get it, a woman like that. Why knock yourself out chasing a buck when you can marry for it and then divorce if it doesn’t work out?”\u003c/p\u003e\n\u003cp\u003e“Something to do with scruples, I guess.”\u003c/p\u003e\n\u003cp\u003e“In this line of work scruples can be a major hindrance.”\u003c/p\u003e\n\u003cp\u003e“I’m learning that.”\u003c/p\u003e\n\u003cp\u003e“You know, McKenzie, if you do get the Jade Lily back, I’d be happy to take it off your hands.”\u003c/p\u003e\n\u003cp\u003e“You, too?”\u003c/p\u003e\n\u003cp\u003e“Just putting it out there.”\u003c/p\u003e\n\u003cp\u003e“I thought you said it was too hot to fence.”\u003c/p\u003e\n\u003cp\u003e“In the United States. Europe, the Pacific Rim—who knows?”\u003c/p\u003e\n\u003cp\u003e“I’ll keep it in mind.”\u003c/p\u003e\n\u003cp\u003eI thanked El Cid for his time. I slid out of the booth, and Cid did the same.\u003c/p\u003e\n\u003cp\u003e“Chopper, good to see you, man,” he said.\u003c/p\u003e\n\u003cp\u003eHe and Chopper clasped hands, and then Cid bent down to give him a hug, the hands between them to prove that, despite the show of affection, they were both manly men. At the same time, Herzog stepped forward, his impassive face giving away nothing. At first, I thought he might grab the handles of Chopper’s wheelchair again and roll him away. Instead, he stepped to the table where the muscle was pretending to read his newspaper. He yanked the knit hat off the table. Beneath it was a small-caliber semiautomatic handgun—a Ruger, I think. He tossed the hat into the young man’s lap and smirked.\u003c/p\u003e\n\u003cp\u003e“Pussy,” he said.\u003c/p\u003e\n\u003cp\u003eHerzog spun around and headed for the door. Chopper and I followed him out. Neither one of us said a word to him.\u003c/p\u003e\n\u003cp\u003eIt had started to snow while we were cloistered inside the unnamed bar, and the wind was whipping it around. It didn’t seem to bother Chopper, though. He tightened his gloves like a race car driver waiting for the starting flag and wheeled his chair forward; his tires seemed to give him plenty of traction. After Chopper cleared the far curb, Herzog aimed his remote control at the van. There was a clicking sound; the door to the van unlocked and slowly rolled open. As he approached the van, Chopper said, “Cid likes t’ think he a fuckin’ gangster. Likes t’ think he’s Don Corleone.”\u003c/p\u003e\n\u003cp\u003e“I noticed that,” I said.\u003c/p\u003e\n\u003cp\u003e“He ain’t. But he does know everything.”\u003c/p\u003e\n\u003cp\u003e“I noticed that, too.”\u003c/p\u003e\n\u003cp\u003e“He didn’ give you much, though, did he?”\u003c/p\u003e\n\u003cp\u003e“He gave me plenty.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“He said an out-of-town crew took down the Lily.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-53.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
