{"id":103926,"no":54,"title":"Page 54","content":"\u003cp\u003e“Yeah? So? I coulda told you that.”\u003c/p\u003e\n\u003cp\u003e“If it was out-of-town talent, how did they know Scott Noehring was a cop? How did they know he was dirty? How did they recognize him in the park—in the dark?”\u003c/p\u003e\n\u003cp\u003e“You’re sayin’ Cid was wrong. The crew gots t’ be local or out-of-town talent workin’ wit’ local.”\u003c/p\u003e\n\u003cp\u003e“He was wrong or he was lying.”\u003c/p\u003e\n\u003cp\u003e“Look here, man. I hates t’ see what happened to Noehring happen to you. Why not I lend you Herzy to provide air support? You know, watch your back?”\u003c/p\u003e\n\u003cp\u003e“I ain’t workin’ for no cop,” Herzog said.\u003c/p\u003e\n\u003cp\u003e“How many times I have to say?” Chopper told him. “McKenzie ain’t a cop no more.”\u003c/p\u003e\n\u003cp\u003e“You crazy you think that, Chop. Didn’ you see his face when Cid called out the dirty cop? McKenzie always be police.”\u003c/p\u003e\n\u003cp\u003eHerzog looked me directly in the eye.\u003c/p\u003e\n\u003cp\u003e“Fuckin’ cop,” he added.\u003c/p\u003e\n\u003cp\u003e“Just give me back my gun,” I said.\u003c/p\u003e\n\u003cp\u003eI drove straight home. It should have taken about fifteen minutes, only the blowing snow lengthened the trip to nearly thirty. It wasn’t particularly deep, just a dusting so far. However, the Minnesota Driver’s Manual as produced by the Minnesota Department of Public Safety clearly states you should slow down and increase stopping distance when roads become slippery and visibility is compromised, although the two accidents that I passed suggested that a lot of drivers hadn’t read it. All in all, it did not bode well for rush hour traffic—one more reason I was happy not to have a nine-to-five job.\u003c/p\u003e\n\u003cp\u003eI put the Jeep Cherokee in the garage, went inside the house, made myself a café mocha with my expensive coffee machine, sat in front of my big-screen TV to watch SportsNation on ESPN, and promptly fell asleep. (I did mention I had only four hours of sleep, right?) I was awakened abruptly by the sound of my phone ringing. By then the sun had fallen and the only light in my house came from the TV screen. I found the phone on the kitchen wall and answered it without checking the caller ID.\u003c/p\u003e\n\u003cp\u003eA young man’s voice said, “What the hell happened last night, McKenzie?”\u003c/p\u003e\n\u003cp\u003eI turned on the kitchen light and checked the LED display. It said the name and phone number were being withheld.\u003c/p\u003e\n\u003cp\u003e“Who is this?” I said.\u003c/p\u003e\n\u003cp\u003e“This is the guy who’s going to throw the fucking Jade Lily into the goddamn Mississippi River, asshole.”\u003c/p\u003e\n\u003cp\u003e“The only way you’re going to do that is if you chop a hole. The fucking river is frozen over, numb nuts.”\u003c/p\u003e\n\u003cp\u003eI should confess that I sometimes get cranky when I don’t have enough sleep.\u003c/p\u003e\n\u003cp\u003e“Is that what you want us to do?” the caller asked.\u003c/p\u003e\n\u003cp\u003e“You killed a cop last night. I don’t care what you do.”\u003c/p\u003e\n\u003cp\u003e“We did not kill that cop. We didn’t even know he was a cop until we read it in the newspaper.”\u003c/p\u003e\n\u003cp\u003e“You expect me to believe that?”\u003c/p\u003e\n\u003cp\u003e“Yes.” His voice dropped a few octaves and he spoke slowly. “All we’re trying to do is make a buck, McKenzie. It would have been insane for us to shoot a cop. What reason would we have? He wasn’t interfering with the exchange. Hell, there wasn’t going to be an exchange. We just wanted to see if you would follow instructions, if you would come alone.”\u003c/p\u003e\n\u003cp\u003e“Is this your sincere voice?” I asked.\u003c/p\u003e\n\u003cp\u003e“Dammit, McKenzie, you’re the one who brought the fucking cop.”\u003c/p\u003e\n\u003cp\u003e“I didn’t, actually.”\u003c/p\u003e\n\u003cp\u003e“Then what was he doing there?”\u003c/p\u003e\n\u003cp\u003eI could have explained, but I didn’t really want to go into it.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I said.\u003c/p\u003e\n\u003cp\u003e“What are we supposed to think now?”\u003c/p\u003e\n\u003cp\u003e“What am I supposed to think? The cop is dead and you claim you didn’t kill him. What about Patrick Tarpley? He’s dead, too.”\u003c/p\u003e\n\u003cp\u003e“We don’t know what happened to Pat,” the voice said. “He handed off the Lily just like clockwork. We were supposed to meet up later, after we were sure we were okay, before we made the call to the museum. He didn’t show. We thought he might have lost his nerve and gone on the run. We didn’t know he had been shot until Tuesday.”\u003c/p\u003e\n\u003cp\u003e“If you didn’t kill him, who did?”\u003c/p\u003e\n\u003cp\u003e“We don’t know.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“We had no reason to kill Patrick.”\u003c/p\u003e\n\u003cp\u003e“You had plenty of reasons to kill Patrick.”\u003c/p\u003e\n\u003cp\u003eHe paused, gave it some thought, sighed. “It doesn’t matter,” he said.\u003c/p\u003e\n\u003cp\u003e“Tell that to his wife.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter to us. We’re still willing to make the exchange.”\u003c/p\u003e\n\u003cp\u003e“With a crazed killer on the loose? That’s brave.”\u003c/p\u003e\n\u003cp\u003e“Do you want the Jade Lily or not?”\u003c/p\u003e\n\u003cp\u003eI almost said “not.” I came thisclose.\u003c/p\u003e\n\u003cp\u003e“Talk to me,” I said.\u003c/p\u003e\n\u003cp\u003e“We’ll try one more time.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“When we’re ready.”\u003c/p\u003e\n\u003cp\u003e“I suggest you wait until after the blizzard.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-54.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
