{"id":103927,"no":56,"title":"Page 56","content":"\u003cp\u003eBy then it was seven thirty and I was thinking about dinner. I love to cook and often host dinner parties just so I’ll have an excuse to play Iron Chef in my kitchen. I had a great Chinese barbecue chicken recipe that used onions, red bell pepper, ginger, hoisin sauce, orange marmalade, tamari, green onions, and cashews—mmm mmm good. It seemed like an awful lot of work, though. That’s the problem—it’s no fun to cook just for yourself. I had decided to doctor a frozen pizza with sharp cheddar and pepperoni slices when I was startled by a heavy knock on my back door. I spun toward it, pulling the Beretta from its holster as I turned, cradling it in both hands. I moved sideways to the door, making myself as small a target as possible, and looked through the window. I saw the top of Nina’s hat—she wore this broad-brim wool chapeau with a couple of pheasant feathers that she found in a consignment shop—and I quickly retreated back into the kitchen, hiding the gun in my junk drawer where she wouldn’t find it.\u003c/p\u003e\n\u003cp\u003e“Nina,” I said when I finally opened the door.\u003c/p\u003e\n\u003cp\u003eShe stepped inside and stamped her feet on the rug, knocking away the snow.\u003c/p\u003e\n\u003cp\u003e“Baby, it’s cold outside,” she said.\u003c/p\u003e\n\u003cp\u003eShe had an overnight bag draped over her shoulder. I took that as a good sign.\u003c/p\u003e\n\u003cp\u003eHugs and kisses were exchanged, and Nina said, “Five inches of snow have fallen already with no end in sight. Business is almost nonexistent, as you can imagine. I decided to close up and send everyone home.”\u003c/p\u003e\n\u003cp\u003e“Good for you,” I said.\u003c/p\u003e\n\u003cp\u003eI helped her with her coat—and her bag. She rubbed her hands together as if trying to warm them.\u003c/p\u003e\n\u003cp\u003e“What’s for dinner?” she asked.\u003c/p\u003e\n\u003cp\u003e“Chinese barbecue chicken with onions, red bell pepper, ginger, hoisin sauce, orange marmalade, tamari, green onions, and cashews.”\u003c/p\u003e\n\u003cp\u003e“How long will it take to make?”\u003c/p\u003e\n\u003cp\u003e“About a half hour.”\u003c/p\u003e\n\u003cp\u003e“Good.” Nina came into my arms and kissed me full on the mouth. “I’m going to be hungry later.”\u003c/p\u003e\n\u003cp\u003eTEN\u003c/p\u003e\n\u003cp\u003eI was sitting up in bed, my back against the headboard. Nina sat between my legs, her back resting against my chest. She was eating French toast sticks—my own recipe—that she dipped in a small bowl of warm maple syrup while I slowly and gently kissed my way from the point of her shoulder to the nape of her neck.\u003c/p\u003e\n\u003cp\u003e“Mmm,” she hummed.\u003c/p\u003e\n\u003cp\u003eI didn’t know if she was reacting to the touch of my lips or the food. It didn’t matter much. I was willing to accept either compliment.\u003c/p\u003e\n\u003cp\u003eThe radio was on, and the man was going down a lengthy list of school and business closings. It was eight thirty, and the snow was just now starting to taper off. Fifteen inches had fallen in Apple Valley, a suburb south of the Cities, while eight inches had been recorded in Blaine, north of the Cities. I figured we had about ten inches in Falcon Heights.\u003c/p\u003e\n\u003cp\u003e“This is so good,” Nina said.\u003c/p\u003e\n\u003cp\u003e“We aim to please,” I told her.\u003c/p\u003e\n\u003cp\u003eBy then I was nibbling on the back of her neck.\u003c/p\u003e\n\u003cp\u003e“This might be the best French toast I’ve ever had,” Nina said.\u003c/p\u003e\n\u003cp\u003e“Are you saying I’m a better cook than Monica?”\u003c/p\u003e\n\u003cp\u003e“No. On the other hand, your presentation is fantastic.”\u003c/p\u003e\n\u003cp\u003eShe hummed again, and this time I was pretty sure she was reacting to what I was doing with my hands.\u003c/p\u003e\n\u003cp\u003eA moment later, she rolled off the mattress, placed the empty plate on my nightstand, and climbed back into bed. She sat facing me, straddling my thighs, and kissed me hard on the mouth. After a few minutes of that, her lips found my chin, my cheek, my neck and throat. It was my turn to moan softly.\u003c/p\u003e\n\u003cp\u003e“I love snow days,” I said.\u003c/p\u003e\n\u003cp\u003eLater, I was lying flat on my back in the bed. Nina had cuddled up next to me, resting her head against my chest. My arm was beneath her, my hand gently caressing her shoulder. My arm had gone numb long ago, but I didn’t dare move it.\u003c/p\u003e\n\u003cp\u003e“I need to get up,” she said.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I have to get dressed; I have to go to Rickie’s.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Some of my staff probably won’t be able to make it in for a while. I should be there.”\u003c/p\u003e\n\u003cp\u003e“Snow day, Nina. Snow day.”\u003c/p\u003e\n\u003cp\u003e“C’mon, McKenzie, you know better. By noon, all of the major streets will be plowed. By five, half of the secondary streets will be cleared. By nine, I bet I’m packed.”\u003c/p\u003e\n\u003cp\u003eInstead of arguing with her, I shifted my weight on the bed and started gently moving my fingers across her warm flesh.\u003c/p\u003e\n\u003cp\u003e“I’ll give you twenty minutes to cut that out,” she said.\u003c/p\u003e\n\u003cp\u003eTurned out, that was exactly how much time she gave me before she rolled out of bed and headed for the bathroom.\u003c/p\u003e\n\u003cp\u003e“I’m really unhappy about this,” I said.\u003c/p\u003e\n\u003cp\u003e“You know, McKenzie, some people like to go to work. They enjoy their jobs. It gives them satisfaction.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-56.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
