{"id":103930,"no":59,"title":"Page 59","content":"\u003cp\u003eBosnia and Herzegovina is accelerating the privatization process for companies of strategic importance in order to increase economic growth and enhance the volume of foreign investment.\u003c/p\u003e\n\u003cp\u003eAn estimated 60% of small companies and more than 30% of the large ones are now privately owned or publicly traded. However, a number of strategic enterprises including power companies, telecommunications providers, mines and other public utilities are still not privatized, presenting a choice of opportunities for potential foreign and local investors.\u003c/p\u003e\n\u003cp\u003eThe Foreign Investment Promotion Agency of Bosnia and Herzegovina also provided a list of publicly owned enterprises ripe for privatization, breaking them down by city. As I read the list, it became obvious to me that nearly every city in Bosnia and Herzegovina—Visoko, Kakanj, Zenica, Sarajevo, Banovi?i, Viso?ica—required the same thing.\u003c/p\u003e\n\u003cp\u003eGarbage and wastewater cleaning.\u003c/p\u003e\n\u003cp\u003e“What the hell?” I said to no one in particular.\u003c/p\u003e\n\u003cp\u003eAfter pausing for a couple of minutes to think it through, I looked up the Web site for the U.S. Embassy in Sarajevo and called the number provided. It was 8:00 P.M. when the phone rang there, yet someone answered it just the same.\u003c/p\u003e\n\u003cp\u003e“United States Embassy,” a pretty voice said.\u003c/p\u003e\n\u003cp\u003e“Good evening,” I said. “I would like to speak to Jeremy Hemsted. I believe he is with your Commercial Service Office.”\u003c/p\u003e\n\u003cp\u003e“May I ask who is calling, please?”\u003c/p\u003e\n\u003cp\u003eI gave the woman my name and location. Why not? The embassy probably had caller ID, anyway.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mr. McKenzie, Mr. Hemsted is unavailable. Is there someone else who might be able to help you?”\u003c/p\u003e\n\u003cp\u003e“Do you mean Jeremy is unavailable as in he’s not in the embassy right now”—I purposely used Hemsted’s first name so the woman would think that he and I were acquainted—“or he’s unavailable as in he’s not in the country?”\u003c/p\u003e\n\u003cp\u003e“Mr. Hemsted is on vacation, sir.”\u003c/p\u003e\n\u003cp\u003e“On vacation or on assignment?”\u003c/p\u003e\n\u003cp\u003e“On vacation, sir, although he will be calling in to check his messages.”\u003c/p\u003e\n\u003cp\u003e“Will you be kind enough to deliver a message for me?”\u003c/p\u003e\n\u003cp\u003e“Would you like his voice mail?”\u003c/p\u003e\n\u003cp\u003e“Oh, no. Just tell him that McKenzie called and that I look forward to seeing him again soon.”\u003c/p\u003e\n\u003cp\u003eAfter a few moments, I refreshed my coffee mug and started wandering around again. It all made sense in that the pieces seemed to fit. Beyond that …\u003c/p\u003e\n\u003cp\u003eI called Harry. He wasn’t in his office at FBI headquarters in Brooklyn Center, so I tried his cell phone. His first question: “Why are you interrupting my lunch?”\u003c/p\u003e\n\u003cp\u003e“Explain diplomatic immunity to me.”\u003c/p\u003e\n\u003cp\u003e“Have you ever heard of the Internet? Invest in an online encyclopedia, why don’t you?”\u003c/p\u003e\n\u003cp\u003e“I need an official ruling.”\u003c/p\u003e\n\u003cp\u003e“Oh, please. Okay, um, diplomatic immunity—it’s an international law agreed upon during the Vienna Convention on Diplomatic Relations that ensures that diplomats are given safe passage across borders and are immune from prosecution under the host nation’s laws. It was enacted during the Cold War to keep rival countries from harassing each other’s representatives, accusing them of spying, that sort of thing.”\u003c/p\u003e\n\u003cp\u003e“Who gets it?”\u003c/p\u003e\n\u003cp\u003e“Official representatives of a sovereign nation and their families.”\u003c/p\u003e\n\u003cp\u003e“What if a foreign politician who is not representing his country—let’s say he’s on vacation. What if he comes to the United States and commits a crime that is totally unconnected to his diplomatic role?”\u003c/p\u003e\n\u003cp\u003e“I suppose that depends on where he’s from and what he’s done. Some countries will waive immunity if the guy’s a dirt bag, and some will bring him home and prosecute him there. In this case, I’m not sure if he’s covered. We are talking about our friend Branko Pozderac, aren’t we?”\u003c/p\u003e\n\u003cp\u003e“Who has jurisdiction?”\u003c/p\u003e\n\u003cp\u003e“We do. Is this about Branko?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“What’s he done?”\u003c/p\u003e\n\u003cp\u003e“I haven’t decided yet.”\u003c/p\u003e\n\u003cp\u003e“Geez, McKenzie, you’re messing with international law now. Please, please, please, I’m begging you—don’t do anything stupid.”\u003c/p\u003e\n\u003cp\u003e“Who? Me?”\u003c/p\u003e\n\u003cp\u003eAfter I hung up on Harry, I went to my junk drawer in the kitchen and pulled out the Beretta. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-59.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
