{"id":103880,"no":6,"title":"Page 6","content":"\u003cp\u003e“How long did Tarpley work for you?” I asked.\u003c/p\u003e\n\u003cp\u003e“He was hired three months before the museum opened,” Perrin said. “We will celebrate our second anniversary a week from Saturday. May I add, his credentials were impeccable and thoroughly vetted. He had worked at several other museums without as much as a whisper of improper behavior. We also investigated his wife, Von. She was the soul of propriety as well.”\u003c/p\u003e\n\u003cp\u003e“Do you have a photograph?”\u003c/p\u003e\n\u003cp\u003ePerrin found two colored glossies in the file in front of her and passed them across the table. The first was a head shot of Tarpley, like the kind used for identification badges. He was an older man, at least fifty, with features that suggested he might have been handsome once. His eyes seemed flat, though, as if all the energy had been drained out of them. It could have been a trick of the photographer, but the picture gave him all the vitality of a paper bag. The woman in the second photograph, however, seemed full of life. She was perhaps twenty years younger and had a quizzical smile on her lips and dancing lights in her brown eyes, as if she considered her good looks to be a lucky accident, like finding a 1943 copper penny in the street.\u003c/p\u003e\n\u003cp\u003e“It doesn’t make sense,” I said. “Forget asking why this seemingly honest man turned thief or why he waited twenty-seven months before making his move. He could have taken many items, yet he didn’t. Instead, he took only one piece, and the piece he took didn’t even rank in the top ten in value. What’s wrong with this picture?”\u003c/p\u003e\n\u003cp\u003e“If he wished to harm the museum, he couldn’t have done better than taking the Lily,” Perrin said. “It was the cornerstone of our year-two celebration. We are a young museum, as Mr. Fiegen stated. It was hoped that the publicity and attention garnered by the exhibit would help us gain the same respect and prominence currently enjoyed by the Minneapolis Institute of Arts and the Walker Art Center.”\u003c/p\u003e\n\u003cp\u003e“If Tarpley was looking to hurt the museum, why would he offer to sell the Lily back?” I asked.\u003c/p\u003e\n\u003cp\u003e“Who gives a shit?” Anderson said.\u003c/p\u003e\n\u003cp\u003e“Derek, please,” Fiegen said.\u003c/p\u003e\n\u003cp\u003e“C’mon. We’ve already had this discussion.” Anderson gestured toward Donatucci, who continued to stare at the painting. “McKenzie, we’re not asking you to solve the crime or catch the thieves. As far as we know, you might be in on it.”\u003c/p\u003e\n\u003cp\u003e“Is that what you think?”\u003c/p\u003e\n\u003cp\u003eAnderson raised the palms of his hands toward heaven. “The thieves asked for you,” he said. “Why is that?”\u003c/p\u003e\n\u003cp\u003eI didn’t know, and not knowing was the only reason I didn’t get up and walk out of the room; maybe slap Anderson a time or two before I left.\u003c/p\u003e\n\u003cp\u003e“Well?” Anderson said.\u003c/p\u003e\n\u003cp\u003e“Kiss my ass,” I told him.\u003c/p\u003e\n\u003cp\u003e“Whoa,” he said. He pointed at me even as he turned to the man sitting next to him. “I like this guy.”\u003c/p\u003e\n\u003cp\u003ePerrin set her large hand on my wrist.\u003c/p\u003e\n\u003cp\u003eFiegen leaned toward me. “Mr. McKenzie,” he said, “I hope you will forgive Derek’s outburst.”\u003c/p\u003e\n\u003cp\u003e“No, I won’t,” I said. “On the other hand, it is a question that needs asking, isn’t it? Look, this go-between business is all a matter of trust. You’re trusting me with one-point-three million bucks because Mr. Donatucci convinced you that I won’t take it to the nearest Indian casino and bet it on red; that I’ll use it to get the Lily back. I’m guessing that for some reason the artnappers trust that I’ll give them the ransom with no tricks; that they won’t end up with a suitcase filled with old telephone books and a face-to-face with a SWAT team. As for me, I have to trust that the artnappers won’t take the money and the Lily and leave me with a bullet in my back.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that why we’re paying you a hundred and twenty-five grand?” Anderson asked, “To take that risk?”\u003c/p\u003e\n\u003cp\u003e“It’s a hundred and twenty-seven, and while I expect to be paid, if I do this thing it won’t be for the money.”\u003c/p\u003e\n\u003cp\u003e“What would trigger your participation?” Fiegen asked.\u003c/p\u003e\n\u003cp\u003eI shook my head slowly because I didn’t have a satisfactory answer for him. So far, I had been motivated by curiosity—but as the proverb says, curiosity killed the cat.\u003c/p\u003e\n\u003cp\u003eSatisfaction brought it back, my inner voice said.\u003c/p\u003e\n\u003cp\u003eCats have nine lives, I told myself. I have only the one.\u003c/p\u003e\n\u003cp\u003e“No hard feelings, McKenzie, huh?” Anderson said. “We just need to know—will you help us get the Lily back?”\u003c/p\u003e\n\u003cp\u003eThe timing of the question couldn’t have been better, because a few seconds after Anderson asked it, the cell phone in Donatucci’s pocket rang. He answered it and listened for a moment.\u003c/p\u003e\n\u003cp\u003e“Ask him yourself,” he said. “He’s sitting right here.”\u003c/p\u003e\n\u003cp\u003eDonatucci set the cell on top of the conference room table and slid it toward me.\u003c/p\u003e\n\u003cp\u003e“It’s the thieves,” he said.\u003c/p\u003e\n\u003cp\u003eTWO \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-6.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
