{"id":103932,"no":61,"title":"Page 61","content":"\u003cp\u003eI was so pleased with myself when I arrived back home that I mixed a shot of bourbon into my coffee. A friend of my father’s who helped raise me, Mr. Mosley, used to insist that you should never add anything to either coffee or bourbon—“Take ’em both straight, like a man,” he’d say—so I doubt he would have approved. You should give it a try, though. It tastes good. I was thinking, in fact, of having a second cup when I heard my front doorbell ring.\u003c/p\u003e\n\u003cp\u003eInstead of saying hello when I opened the door, Mr. Donatucci asked, “Are you alone?”\u003c/p\u003e\n\u003cp\u003e“I am,” I answered. “Mr. Donatucci, what do you think of mixing coffee with bourbon?”\u003c/p\u003e\n\u003cp\u003e“I think it’s a waste of two good drinks.”\u003c/p\u003e\n\u003cp\u003eOkay, then.\u003c/p\u003e\n\u003cp\u003eDonatucci waved at the cream-colored van parked in my driveway behind Nina’s Lexus. A door opened and an armed guard stepped out. He looked slowly around him, his hand resting on the butt of the handgun holstered to his thigh, which I took as an amateur move. If he didn’t already know that the coast was clear, he should never have gotten out of the vehicle.\u003c/p\u003e\n\u003cp\u003eHe rapped on the frame of the van and a side door slid open. Another guard emerged and did a little pirouette, looking for danger in the same places as his partner. He, too, had his hand on his gun. A moment later, they pulled a dolly with three gym bags strapped to it from the vehicle. The two of them slowly rolled it to my front porch, banging the wheels against the wooden steps as they dragged it onto the porch while swiveling their heads in long arcs as if they expected an ambush at any moment.\u003c/p\u003e\n\u003cp\u003e“I like melodrama as much as the next guy,” I said, “but honestly, Mr. Donatucci.”\u003c/p\u003e\n\u003cp\u003e“Quiet, McKenzie,” he said.\u003c/p\u003e\n\u003cp\u003eThe two guards pulled the dolly into my house, rolling it across the living room carpet as if they didn’t care about the stains it made. Once inside, with the door locked, we stood in a circle, the money in the center of the circle, and stared at each other.\u003c/p\u003e\n\u003cp\u003e“Now what?” one of the guards asked.\u003c/p\u003e\n\u003cp\u003e“Now we wait,” Donatucci said.\u003c/p\u003e\n\u003cp\u003eEveryone turned to look at me.\u003c/p\u003e\n\u003cp\u003e“Have you guys ever mixed bourbon with coffee?” I asked.\u003c/p\u003e\n\u003cp\u003eA few minutes later, the guards dispersed with mugs of coffee sans bourbon. One went to an empty upstairs bedroom that gave him a clear view of the front of the house as well as both ends of Hoyt Avenue. The other found a perch in my dining room that revealed the whole of my backyard and the houses on my right and left.\u003c/p\u003e\n\u003cp\u003e“Are those wild turkeys?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” I told him.\u003c/p\u003e\n\u003cp\u003e“Huh,” he said.\u003c/p\u003e\n\u003cp\u003eMr. Donatucci and I sat at my kitchen table and reviewed the situation. He was as opposed to paying the ransom as ever.\u003c/p\u003e\n\u003cp\u003e“Then let’s not do it,” I said.\u003c/p\u003e\n\u003cp\u003eHe shook his head sadly as if the decision were out of his hands.\u003c/p\u003e\n\u003cp\u003e“You can tell your boss that I refused to cooperate,” I said. “Better yet—we can blame the cops. Put it on Rask. Say that he threatened to arrest us for obstruction of justice.”\u003c/p\u003e\n\u003cp\u003e“They’d probably fire me.”\u003c/p\u003e\n\u003cp\u003e“Let them. How old are you, anyway? You should have retired years ago.”\u003c/p\u003e\n\u003cp\u003e“You know, McKenzie, some people like their jobs. They like going to work in the morning.”\u003c/p\u003e\n\u003cp\u003e“You’re the second person to tell me that today, so I guess it must be true.”\u003c/p\u003e\n\u003cp\u003eA moment later my cell phone sang. I answered it without wondering who it might be.\u003c/p\u003e\n\u003cp\u003e“This is Mr. Fiegen,” a voice said.\u003c/p\u003e\n\u003cp\u003eI had never heard anyone use “mister” as a title in the same way a doctor or governor might, and I said so aloud.\u003c/p\u003e\n\u003cp\u003e“I do not like your tone,” Fiegen said.\u003c/p\u003e\n\u003cp\u003e“If you had told me that yesterday, I might have cared. Hang on.”\u003c/p\u003e\n\u003cp\u003eI gestured toward Donatucci. “Make yourself comfortable,” I said. “I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eI descended a flight of stairs just off the kitchen to my basement, which held my hockey equipment, my golf clubs, my camping and fishing equipment, and a treadmill that I hadn’t used since I bought it. When I was sure no one could overhear our conversation, I said “Okay,” into the cell’s microphone.\u003c/p\u003e\n\u003cp\u003e“The young man delivered your message,” Fiegen said. His voice was angry, which made me smile. It was about to get worse.\u003c/p\u003e\n\u003cp\u003e“You’re a sonuvabitch, Fiegen,” I said. “A rat, a liar, a hypocrite—I could probably think of a few other insults, but what’s the point?”\u003c/p\u003e\n\u003cp\u003e“What do you want, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“How much is the garbage business in Bosnia and Herzegovina worth to you?”\u003c/p\u003e\n\u003cp\u003e“Are you trying to blackmail me?”\u003c/p\u003e\n\u003cp\u003e“Yes, I am. How much is it worth?”\u003c/p\u003e\n\u003cp\u003eFiegen inhaled deeply and answered with the exhale.\u003c/p\u003e\n\u003cp\u003e“Bosnia and Herzegovina is an emerging country. As its gross national product increases, so will the amount of solid waste it’ll produce. We estimate that in ten years it will be generating as much as twenty-five percent more than it does now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-61.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
