{"id":103933,"no":62,"title":"Page 62","content":"\u003cp\u003e“That’s not the answer I was looking for.”\u003c/p\u003e\n\u003cp\u003e“MDR estimates gross profits at between one-point-three and one-point-seven billion euros in the first fiscal year, assuming we acquire all the territories we are bidding on.”\u003c/p\u003e\n\u003cp\u003e“A tidy sum.”\u003c/p\u003e\n\u003cp\u003e“Yes, it is. How much do you want?”\u003c/p\u003e\n\u003cp\u003e“How big is the bribe you’re paying Jonathan Hemsted to steer Pozderac your way?”\u003c/p\u003e\n\u003cp\u003eAnother pause; another sigh.\u003c/p\u003e\n\u003cp\u003e“Two hundred and fifty thousand dollars if the deal is made,” Fiegen said. “Fifty thousand if it goes away.”\u003c/p\u003e\n\u003cp\u003e“That’s pretty good money for government work.”\u003c/p\u003e\n\u003cp\u003e“Hemsted is acting as a go-between in much the same way as you are. There is nothing unethical about it.”\u003c/p\u003e\n\u003cp\u003e“I’m not arguing with you. Just making an observation. The bribe to Pozderac, though—how did you expect to deliver the Jade Lily to him?”\u003c/p\u003e\n\u003cp\u003e“Oh, some legal hocus-pocus involving condemnation via eminent domain.”\u003c/p\u003e\n\u003cp\u003e“Except the federal government isn’t actually taking title to the property, is it? Nobody would be compensated for their loss, would they?”\u003c/p\u003e\n\u003cp\u003e“Your outrage is born of ignorance, McKenzie. This is the price of doing business, especially in that part of the world. Everyone does it, including our competitors.”\u003c/p\u003e\n\u003cp\u003e“Then why keep it a secret? Why tell the mayor and police department in Minneapolis that Hemsted is acting on behalf of the State Department when he’s not?”\u003c/p\u003e\n\u003cp\u003e“It’s the system we live under.”\u003c/p\u003e\n\u003cp\u003e“Sure. It’s just business.”\u003c/p\u003e\n\u003cp\u003e“That’s right. It’s just business.”\u003c/p\u003e\n\u003cp\u003e“You’re a thief, Fiegen. Plain and simple. A lousy, second-rate thief. I have more respect for Patrick Tarpley and the crooks that walked the Lily out of the museum. They at least have the balls to do their own dirty work. You? You’re just a punk hiding behind a business title. I bet you the boys and girls at the Justice Department that enforce the antibribery provisions of the Foreign Corrupt Practices Act will agree with me, too.”\u003c/p\u003e\n\u003cp\u003e“What do you intend to do, McKenzie? Call Justice? Call the police? And tell them what? Show them what? You have no hard evidence. McKenzie, we both know you are just posturing. Just tell me what you want to go away?”\u003c/p\u003e\n\u003cp\u003e“I want a letter,” I said. “A contract if you prefer, signed by you and notarized. I want it delivered to me by the end of the day. The letter will state clearly that you will pay Midwest Farmers Insurance Group one million two hundred seventy thousand dollars should the ransom be lost to the artnappers in our attempts to recover the Jade Lily. It will state that the City of Lakes Art Museum will make no claim in any way or fashion against the insurance company as a result of the theft. It will state that you—and I mean you personally—will compensate Jeremy Gillard three million eight hundred thousand dollars for the loss of the Lily. It will state that Perrin Stewart will retain her job as executive director of the art museum for five years with a ten percent pay raise each year.”\u003c/p\u003e\n\u003cp\u003e“Why would I give you such a damning document?”\u003c/p\u003e\n\u003cp\u003e“In exchange, when I recover the Jade Lily, I will give it to Jonathan Hemsted of the United States State Department with the understanding that he will pass it on to Branko Pozderac and the peoples of Bosnia and Herzegovina. You’ll get what you want. Everyone else gets what they want. No harm, no foul.”\u003c/p\u003e\n\u003cp\u003eAnother pause, this one much longer.\u003c/p\u003e\n\u003cp\u003e“You surprise me, McKenzie,” Fiegen said.\u003c/p\u003e\n\u003cp\u003e“Sometimes I surprise myself.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what to say.”\u003c/p\u003e\n\u003cp\u003eI didn’t either, so I hung up.\u003c/p\u003e\n\u003cp\u003eELEVEN\u003c/p\u003e\n\u003cp\u003eMy phone rang at exactly 11:00 A.M.\u003c/p\u003e\n\u003cp\u003eThe guards each jumped about three feet when it did, which didn’t surprise me—they had been twitchy all morning. They crowded around me in the kitchen when I answered the phone pretty much as they had late Friday when a courier appeared at my front door with an envelope in his hand. One suggested that it might be a letter bomb, and the other actually sighed with relief when it didn’t blow up after I opened it. The letter was from Fiegen, and it contained everything that I had demanded, including the stamp and signature of a notary public. I folded it and placed it in my pocket while the guards stared.\u003c/p\u003e\n\u003cp\u003e“Guys,” I said. “Relax.”\u003c/p\u003e\n\u003cp\u003eOnly they didn’t relax until they were relieved for the night by another pair of security agents with intense dispositions. The original guards returned at about 9:00 A.M. Saturday. I would have offered them coffee, but they already seemed overcaffeinated.\u003c/p\u003e\n\u003cp\u003eThe voice on the phone was very specific about where I was supposed to be and when. It did not threaten; it did not warn me about what would happen to the Lily if I were late.\u003c/p\u003e\n\u003cp\u003eI hung up the phone and said, “Gentlemen, help me with this.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-62.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
