{"id":103935,"no":64,"title":"Page 64","content":"\u003cp\u003e“Park in front of room 122,” the voice said. “The room is unlocked. Take the money inside.”\u003c/p\u003e\n\u003cp\u003eI started the Audi and drove from the office through the parking lot, following the room numbers as I went. Room 122 was in the center of the motel. When I found it, I parked backward with my trunk facing the motel room door. The window drapes had been drawn, and I couldn’t see inside. As I did at Loring Park, I refrained from using the interior latch and instead waited to open the trunk with my remote once I was sure that there was no one nearby. I muscled the dolly and gym bags out of the trunk and pivoted toward the door. I carefully turned the knob. As promised, it was unlocked. I nudged the door open with the toe of my boot, my left hand holding the handle of the dolly and my right gripping the butt of my Beretta under my leather coat. Nothing bad happened, so I stepped inside. It was like every other motel room you had ever been in. There was a bed, a nightstand, a dresser, a small table, a pair of chairs, a cheap clock radio and telephone on the nightstand, a TV on the dresser, a lamp on the table, and a couple of paintings securely fastened to the walls—nothing anyone would ever want to steal. I closed and locked the door and rolled the dolly next to the bed. It was dark inside the room with the drapes drawn, yet not so dark that I couldn’t see. I looked in the bathroom. No one was hiding there. I turned on the overhead light and sat on the edge of the bed and waited. After a few minutes, I stretched out on the bed and waited some more. Time passed slowly. I got off the bed and went to the window. I pulled the drapes open a crack and looked outside. I saw no one. I sat down again, this time on a chair. I slipped the Beretta out from under my coat and set it within easy reach on the table. More time passed. The phone on the nightstand rang. It had a loud ringtone that was so startling I grabbed the Beretta, went into a crouch, and aimed it at the phone—I almost shot it.\u003c/p\u003e\n\u003cp\u003eDammit, McKenzie, my inner voice said. Get a grip.\u003c/p\u003e\n\u003cp\u003eI lunged for the phone.\u003c/p\u003e\n\u003cp\u003e“Yes,” I said.\u003c/p\u003e\n\u003cp\u003e“Empty the bags; put the money on the bed,” the voice said before he hung up.\u003c/p\u003e\n\u003cp\u003eI didn’t ask why. I knew why. The thieves wanted to easily check the bundles for ink packs and tracers, just like I had told Mr. Donatucci they would. I did as I was instructed, examining the bundles myself in case someone had tried to pull a fast one. The money was clean. I waited some more.\u003c/p\u003e\n\u003cp\u003eThe phone rang again. I let it ring four times before I answered.\u003c/p\u003e\n\u003cp\u003e“Bebe’s Peanut Shop, Bebe speaking.”\u003c/p\u003e\n\u003cp\u003eThere was a long pause before the voice said, “Are you fucking crazy?”\u003c/p\u003e\n\u003cp\u003eI didn’t answer.\u003c/p\u003e\n\u003cp\u003e“McKenzie?”\u003c/p\u003e\n\u003cp\u003e“I’m listening.”\u003c/p\u003e\n\u003cp\u003e“The Jade Lily is in the room directly above you—room 222. You will leave your room, take a right outside the door, and walk to the staircase, climb it, go to 222—the door is unlocked.”\u003c/p\u003e\n\u003cp\u003e“All right,” I said. “Now you listen. I scattered the money nicely over the bed. It’ll take you a few minutes to gather it together, check for tracers and ink packs, and then put it all in bags. That’s all the time I’ll need to make sure the Lily is in the room as promised. If it’s not, you’re going to find out just how crazy I am.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, I will be so very glad when our business with you is concluded. Shall we get to it?”\u003c/p\u003e\n\u003cp\u003e“I’m leaving the room now.”\u003c/p\u003e\n\u003cp\u003eThe first step, they say, is the hardest. I went to the door and pulled it open and stood there for what seemed like a very long moment. If someone wanted to pot me with a .30-06, that was as good a moment as any. The fact that I wasn’t shot encouraged me to take the next step and then the one after that. I walked the length of the motel until I reached the staircase. Did I say it was twenty-eight degrees? The way the sweat beaded on my forehead and welled up under my arms it could have been ninety-eight. I jogged up the staircase and followed the landing to room 222. It occurred to me then that we were playing out the exact same scenario as when I recovered my friend Jenny’s jewels from her Internet lover, and I wondered if there was a handbook that these bastards followed, a template. As with that time, I did not look right or left, only straight ahead until I reached the door. The drapes were closed over the lone window so I couldn’t see inside this room, either. I tried the knob. It turned easily. I opened the door and stepped inside, locking it behind me.\u003c/p\u003e\n\u003cp\u003eThe Jade Lily was sitting on the table in front of the window.\u003c/p\u003e\n\u003cp\u003eI turned on the overhead light. It didn’t give me the light that I needed, so I opened the drapes. Sunlight danced over the spinach-colored flowers. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-64.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
