{"id":103940,"no":69,"title":"Page 69","content":"\u003cp\u003eI was sitting up, a plastic plate on top of the hospital’s roll-away overbed table and both positioned so that they were tight against my stomach. I had attempted to eat beef lo mein with chopsticks and failed miserably, so I switched to a fork. That didn’t work out any better. Most people lean over their plates when they eat, only leaning forward was suddenly a painful practice for me. So I tried to eat while keeping my back straight, tilting my head down, and bringing the fork to my mouth instead of meeting it halfway. I kept spilling food all over the napkin I had tucked into the neckline of the hospital gown they had insisted I wear.\u003c/p\u003e\n\u003cp\u003e“Need any help?” Nina asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eNina shrugged and continued to consume her kung pao chicken. She was sitting at a table near the window, her feet resting on a chair opposite her, eating directly from the white takeout carton. She didn’t have any problem at all working her chopsticks. Every once in a while she’d fish a cheese puff or a bite of egg roll from one of the other cartons arranged on the table.\u003c/p\u003e\n\u003cp\u003e“This sucks,” I said.\u003c/p\u003e\n\u003cp\u003e“You did say you wanted to lose a few pounds,” Nina said. “Here’s your chance.”\u003c/p\u003e\n\u003cp\u003e“I said I needed to work out more. I didn’t say anything about losing weight.”\u003c/p\u003e\n\u003cp\u003eNina smiled.\u003c/p\u003e\n\u003cp\u003e“Do you think I need to lose some weight?’ I asked.\u003c/p\u003e\n\u003cp\u003eShe smiled some more.\u003c/p\u003e\n\u003cp\u003e“This sucks,” I said.\u003c/p\u003e\n\u003cp\u003e“You’re the one who insists on visiting the dark side all the time.”\u003c/p\u003e\n\u003cp\u003eI didn’t like the tone of her voice, so I asked, “Are you mad at me?”\u003c/p\u003e\n\u003cp\u003e“No more than usual,” she said. “I’m tired of visiting you in hospitals, though.”\u003c/p\u003e\n\u003cp\u003e“When did you visit me in a hospital?”\u003c/p\u003e\n\u003cp\u003e“There was the time after we first met…”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, but that doesn’t count. We weren’t even dating then.”\u003c/p\u003e\n\u003cp\u003e“It counts. And then…”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“And then there was that time in South Dakota.”\u003c/p\u003e\n\u003cp\u003e“You didn’t visit me in the hospital in South Dakota.”\u003c/p\u003e\n\u003cp\u003e“I would have if I had known you were in the hospital in South Dakota. The point is, I’m tired of it. Don’t make me do this anymore.”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Are we going to have another one of those conversations?”\u003c/p\u003e\n\u003cp\u003e“No, I’m tired of that, too. You are who you are and I’m who I am. How the hell we ended up together, God only knows.”\u003c/p\u003e\n\u003cp\u003e“Actually, it was God’s doing. Didn’t you know that?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“God said to me, ‘McKenzie…’”\u003c/p\u003e\n\u003cp\u003e“He talks to you personally?”\u003c/p\u003e\n\u003cp\u003e“All the time. He said, ‘McKenzie, you get Nina.’”\u003c/p\u003e\n\u003cp\u003e“Did he tell you why?”\u003c/p\u003e\n\u003cp\u003e“Because he likes me.”\u003c/p\u003e\n\u003cp\u003e“Obviously.”\u003c/p\u003e\n\u003cp\u003eI tried to eat more beef lo mein, but it fell off the fork as I was about to scoop it into my mouth.\u003c/p\u003e\n\u003cp\u003e“Are you sure you don’t need any help with that?” Nina asked.\u003c/p\u003e\n\u003cp\u003e“No, but you can come over if you like.”\u003c/p\u003e\n\u003cp\u003eNina set down her meal and made her way to the bed. She sat on the edge of it and leaned in. Her kiss was as soft as a butterfly’s wings.\u003c/p\u003e\n\u003cp\u003e“Exactly how long did they say you have to wait before you can start working out again?” she asked.\u003c/p\u003e\n\u003cp\u003e“God knows.”\u003c/p\u003e\n\u003cp\u003eNina kissed me without putting any pressure on my shoulder at all. I felt her warmth all down my right arm and chest and spreading through the rest of my body. I wanted to shove the tray away and see how far we could take this before I started screaming out in pain, but I didn’t get a chance. There was a heavy knock on the door, and a moment later Jeremy Gillard sauntered into the hospital room, stopped, looked at me, looked at Nina, looked back at me, and said, “Boy, do I know when to enter a room.”\u003c/p\u003e\n\u003cp\u003eNina eased herself off the bed and returned to the table.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I said.\u003c/p\u003e\n\u003cp\u003e“I am so sorry. I didn’t mean to interrupt.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“I can leave and come back in an hour.”\u003c/p\u003e\n\u003cp\u003e“Jeremy,” I said. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“I was just at the museum.” He threw a thumb at the door as if the museum were just on the other side of it. He smiled at Nina. “Ms. Truhler,” he said. “It is a pleasure to see you again.” He crossed the room and shook Nina’s hand, holding it much longer than I was comfortable with. “You’re looking as lovely as ever.”\u003c/p\u003e\n\u003cp\u003eNina thanked him and offered an egg roll.\u003c/p\u003e\n\u003cp\u003e“Oh, I couldn’t,” Gillard said.\u003c/p\u003e\n\u003cp\u003e“Please, help yourself,” Nina said.\u003c/p\u003e\n\u003cp\u003eGillard said, “Well, if you insist,” scooped an egg roll from the carton, and took a bite. “Oh my God, this is amazing,” he quickly added. “Where did you get these?”\u003c/p\u003e\n\u003cp\u003e“There’s a Vietnamese restaurant in Northeast Minneapolis called Que Viet Village House.”\u003c/p\u003e\n\u003cp\u003e“These are great. You know, there’s this joint in Chinatown in Chicago that I go to that makes egg rolls, but these…”\u003c/p\u003e\n\u003cp\u003e“Hey, guys,” I said.\u003c/p\u003e\n\u003cp\u003e“The difference is the filler,” Nina said. “The Chinese use cabbage, and the Vietnamese use noodles. Plus, the Vietnamese wrappers are thinner and crispier.”\u003c/p\u003e\n\u003cp\u003e“Guys?”\u003c/p\u003e\n\u003cp\u003eThey both turned toward me.\u003c/p\u003e\n\u003cp\u003e“I presume you’re here for a reason, Jer,” I said.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah,” Gillard said. “I was just at a meeting at the museum. The insurance guy, Donatucci, he told us that you got blown up trying to retrieve the Jade Lily. I just wanted to drop around and see how you were. Donatucci said you were okay, but honestly, McKenzie, you don’t look okay. Are you okay?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-69.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
