{"id":103944,"no":73,"title":"Page 73","content":"\u003cp\u003eYou need to understand something—I did not think any of this through, did not justify my actions for a moment. I just did it. The thinking part, that came later in the ER.\u003c/p\u003e\n\u003cp\u003eAfterward, I limped across the parking lot. I have no idea what I was doing. Maybe I just wanted to get a look at what was left of room 222. The romantic in me believed I wanted to see if there was anyone who needed help. In the distance I could hear sirens—cops and ambulances. I stepped on something with my left foot. My sprained ankle gave out and I started to fall. This time I twisted my body to protect my damaged shoulder. I hit my head. (I touched the bruise on my forehead.) That’s how I was knocked unconscious; that’s how I got the concussion. The next thing I remember, the paramedics were putting a collar around my neck and sliding me onto a backboard before loading me into an ambulance. I remember everything from that moment on quite vividly.\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” Nina said. “You’re saying—the Lily was not destroyed in the explosion? Is that what you’re saying?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You have it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“It should still be locked in the trunk of my car. By the way, I need your copy of my house key. My keys are in the trunk.”\u003c/p\u003e\n\u003cp\u003e“Where’s your car?”\u003c/p\u003e\n\u003cp\u003e“Rask told me it was towed to the City of Minneapolis impound lot. Believe me, I had a car towed there a few years ago during a snow emergency—the place is like fricking Fort Knox.”\u003c/p\u003e\n\u003cp\u003e“But, but…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“They wanted you to—they asked you to retrieve the Jade Lily. They asked you to trade the insurance money for it, and you did that. I mean, I know the motel room blowing up wasn’t part of the deal, but you did what they asked, you have the Lily. Why not give it to the insurance company like you promised and forget the whole thing? The job is over, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“People have been killed for the Jade Lily. I can’t let that go.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because I killed one of them.”\u003c/p\u003e\n\u003cp\u003e“Heavenly’s friend Tommy?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“That’s on her.”\u003c/p\u003e\n\u003cp\u003e“It’s on me, too.”\u003c/p\u003e\n\u003cp\u003e“What are you going to do? Are you going to hide the Lily from the insurance company, from the police?”\u003c/p\u003e\n\u003cp\u003e“For now.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“There are a few things I need to sort out.”\u003c/p\u003e\n\u003cp\u003e“Such as?”\u003c/p\u003e\n\u003cp\u003e“Such as who the Lily actually belongs to.”\u003c/p\u003e\n\u003cp\u003eShe paused for a few moments and said, “You could get into big trouble over this.”\u003c/p\u003e\n\u003cp\u003eI started to laugh. “Yes,” I said and laughed some more. “Yes, I could.” I have no idea why I laughed. Mark it down to nervous energy.\u003c/p\u003e\n\u003cp\u003e“You think this is funny?” Nina asked.\u003c/p\u003e\n\u003cp\u003eI shook my head yet continued to laugh.\u003c/p\u003e\n\u003cp\u003e“Dammit, but you make me so mad sometimes,” Nina said.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, I’m sorry. You’re right, it isn’t funny. You have to admit, though—it’s the damnedest thing.”\u003c/p\u003e\n\u003cp\u003e“You can be so terribly immature sometimes, do you know that?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess.”\u003c/p\u003e\n\u003cp\u003e“You also have a secret passion for justice.”\u003c/p\u003e\n\u003cp\u003e“How immature is that?”\u003c/p\u003e\n\u003cp\u003e“Justice in this case would be for … who?”\u003c/p\u003e\n\u003cp\u003e“I’m still working that out.”\u003c/p\u003e\n\u003cp\u003e“What can I do to help?” she asked, the implication being that I needed all the help I could get.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to get into trouble,” I said. “Who would bail me out if I get arrested?”\u003c/p\u003e\n\u003cp\u003eNina came off her suitcase and crossed the few steps between us. She grabbed both ends of my leather jacket and pulled it close.\u003c/p\u003e\n\u003cp\u003e“What are you going to do?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’m going back to the beginning.”\u003c/p\u003e\n\u003cp\u003e“The beginning?”\u003c/p\u003e\n\u003cp\u003e“The artnappers requested that I act as go-between without knowing who I was. Someone gave them my name. When I find out who that person was, I’ll find out who they are.”\u003c/p\u003e\n\u003cp\u003e“As easy as that, huh?”\u003c/p\u003e\n\u003cp\u003e“Well, the premise is simple. We’ll find out how easy it is.”\u003c/p\u003e\n\u003cp\u003e“Do you know what really frightens me?” Nina said. “The idea that the Jade Lily really is cursed; that something terrible happens to everyone who holds it, because right now you’re the one who’s holding it.”\u003c/p\u003e\n\u003cp\u003e“The history of the Lily—all that proves is that bad things happen to greedy people.”\u003c/p\u003e\n\u003cp\u003e“That’s my point, McKenzie. You’re the greediest person I know. You might not want fame or fortune, but you do love the game.”\u003c/p\u003e\n\u003cp\u003eNot long after Nina departed, Herzog arrived. I was glad she didn’t see him. He might have frightened her. The way he filled my doorway, dressed in black boots, black jeans, black turtleneck, and black leather jacket, his hands crossed just above his silver belt buckle, and said, “I’m not happy t’ be ’ere,” Herzog scared the hell out of me, and I was carrying a gun. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-73.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
