{"id":103946,"no":75,"title":"Page 75","content":"\u003cp\u003e“Are you trying to be funny?”\u003c/p\u003e\n\u003cp\u003e“People keep asking that. No, I’m not trying to be funny. I’m just trying to avoid going to jail while I make your case.”\u003c/p\u003e\n\u003cp\u003e“Oh? You’re going to make my case, are you? Which case? Tell me. I have so many.”\u003c/p\u003e\n\u003cp\u003e“Who killed Scott Noehring, that case. Who killed Patrick Tarpley, that case, too.”\u003c/p\u003e\n\u003cp\u003eRask shook his head slowly and muttered, “Uh-uh, uh-uh, no way. You don’t keep things from me.”\u003c/p\u003e\n\u003cp\u003e“I told you last week when you dragged me into this that I was high maintenance.”\u003c/p\u003e\n\u003cp\u003e“You think I’m fucking Bobby Dunston? I’m not going to play this game with you, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. Aren’t you the one who told me to get the Lily back—which I believe is conspiring to receive stolen property? Aren’t you the one who told me to get intel on the artnappers in order to help you in the Noehring investigation?”\u003c/p\u003e\n\u003cp\u003e“Oh, you’re helping me, is that what you’re doing? You’re withholding information because you’re helping me.”\u003c/p\u003e\n\u003cp\u003e“Give me a couple of days and then I’ll tell you everything.”\u003c/p\u003e\n\u003cp\u003eThe way he shook his head, I knew Rask wasn’t buying it, so I played my ace.\u003c/p\u003e\n\u003cp\u003e“Give me a couple of days, LT, and I’ll throw in a sweetener.”\u003c/p\u003e\n\u003cp\u003e“What sweetener?”\u003c/p\u003e\n\u003cp\u003e“Pozderac and Hemsted on a silver platter.”\u003c/p\u003e\n\u003cp\u003eI could see that Rask liked the idea. He rolled the thought over his tongue like a piece of Amedei chocolate but wouldn’t swallow it.\u003c/p\u003e\n\u003cp\u003e“Pozderac has diplomatic immunity,” he said.\u003c/p\u003e\n\u003cp\u003e“Maybe not. Neither Pozderac nor Hemsted, for that matter, is here representing his country. They’re both just a couple of punks looking for a payoff.”\u003c/p\u003e\n\u003cp\u003e“I can’t touch them.”\u003c/p\u003e\n\u003cp\u003e“You might not be able to, but the FBI … That’s a different matter.”\u003c/p\u003e\n\u003cp\u003e“Have you spoken to the FBI?”\u003c/p\u003e\n\u003cp\u003e“Yes, I have.”\u003c/p\u003e\n\u003cp\u003e“What is their position?”\u003c/p\u003e\n\u003cp\u003e“They would love to arrange a perp walk with these two clowns.”\u003c/p\u003e\n\u003cp\u003eYeah, I know; I was laying it on pretty thick, but Rask seemed to like it.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t mind seeing that myself,” he said. “All right, what do you need from me?”\u003c/p\u003e\n\u003cp\u003e“You said you had a photo of the man who registered at the motel.”\u003c/p\u003e\n\u003cp\u003eRask glanced around his cluttered desk, found a large white envelope, and removed a color photograph that looked like it had had been printed on white office stock with a laser printer. I gave the photo a long, hard look. It was a man in his midtwenties; dark-skinned, maybe Hispanic, maybe not, although I was sure the boys in Arizona would pick him up just to be sure. There was something familiar about him, only I couldn’t place it.\u003c/p\u003e\n\u003cp\u003e“Know him?” Rask asked.\u003c/p\u003e\n\u003cp\u003e“Never saw him before in my life.”\u003c/p\u003e\n\u003cp\u003eHe thrust his face at me. There was a hard warning in his eyes. “Are you sure about that?”\u003c/p\u003e\n\u003cp\u003eI couldn’t imagine what I had done to make him so suspicious of me.\u003c/p\u003e\n\u003cp\u003e“I’m sure,” I said.\u003c/p\u003e\n\u003cp\u003e“If you say so.”\u003c/p\u003e\n\u003cp\u003eI held up the photo. “Can I keep this?” I asked.\u003c/p\u003e\n\u003cp\u003e“Frame it if you want.”\u003c/p\u003e\n\u003cp\u003eWhile I carefully folded it and slipped it into my inside jacket pocket, I said, “Last time we spoke you were waiting on a ballistics report.”\u003c/p\u003e\n\u003cp\u003e“Yeah, the gun—the bullets that killed Patrick Tarpley and Lieutenant Noehring were fired from the same piece,” he said. “A .25.”\u003c/p\u003e\n\u003cp\u003e“Then it wasn’t a professional shooter.”\u003c/p\u003e\n\u003cp\u003e“No. A pro would never have kept the gun. Anyone who watches CSI would know not to keep the gun.”\u003c/p\u003e\n\u003cp\u003e“If the shooter didn’t dump the weapon after the first killing, odds are he didn’t dump it after the second.”\u003c/p\u003e\n\u003cp\u003e“From your lips to God’s ear,” Rask said. “The question is, where do we look for it?”\u003c/p\u003e\n\u003cp\u003eIt was a long walk down the marble corridor from room 108 to the Fifth Street entrance of the Minneapolis City Hall, and I was feeling light-headed and a little dizzy by the time I reached it, not unlike the way you do when you get up too fast after lying on a couch for a while. Except the feeling didn’t go away after a few moments. It stayed with me while I pushed open the door and descended the steps to the street. The tracks for the Hiawatha light rail line ran along Fifth, but I didn’t notice them. I walked across the tracks and into Fifth Street, and then two strong arms yanked me forward, pulling me out of the street and pushing me up against an SUV. I felt the jagged ends of my fractured collarbone rubbing together. My blurred vision became a flashing red light.\u003c/p\u003e\n\u003cp\u003e“What the fuck, McKenzie?” a voice shouted at me.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“McKenzie?”\u003c/p\u003e\n\u003cp\u003eMy head cleared and the world came into sharp focus.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Herzog said again and gave me a shake.\u003c/p\u003e\n\u003cp\u003e“Don’t do that,” I said. “Shaking a guy with a concussion is not a good thing.”\u003c/p\u003e\n\u003cp\u003eNot to mention a fractured clavicle, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“Fuckin’ A, man. You almos’ got hit by a fuckin’ train.”\u003c/p\u003e\n\u003cp\u003eIt was cold. Herzog’s words condensed into clouds that rose up in the air between us. I tilted my head so I could follow the clouds.\u003c/p\u003e\n\u003cp\u003e“I did?” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-75.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
