{"id":103950,"no":79,"title":"Page 79","content":"\u003cp\u003e“So I have someone to talk to,” she said.\u003c/p\u003e\n\u003cp\u003eIt was the only time I had been to Jenny’s home. Not long after that, she began trading her middle-class pals from Merriam Park for the company of her husband’s friends. My impression was that she wasn’t happy with the exchange. Still, I had lost track of her until she called a couple of years back and asked that I retrieve the jewels from her blackmailing lover. When I returned them she kissed me and hugged me and said I was the best friend she ever had, yet we didn’t speak again until I called her that morning. I asked for a meeting. She seemed reluctant if not downright frightened, yet she agreed. After all, she owed me one.\u003c/p\u003e\n\u003cp\u003eLake Minnetonka was actually a collection of sixteen interconnected lakes and heaven knows how many bays and inlets. It was Jenny who suggested we meet at a yacht club named after one of the bays, “where we would be alone,” she said. My guess was that her previous dalliances with infidelity had taught her to be discreet, whether she was cheating or not.\u003c/p\u003e\n\u003cp\u003eLike most of the properties on and around Lake Minnetonka, the club was designed to be out-of-the-way. To reach it, Herzog had to navigate a series of private roads that were more or less unmarked. Its carefully landscaped grounds and antebellum-style clubhouse reminded me of an exclusive country club, and so did its members-only restaurant and bar. It seated just 105, yet it seemed much larger because of the huge windows that offered a panoramic view of the snow-covered marina with its 117 deepwater slips and the bay beyond. There were no boats in the slips, yet there were plenty of snowmobile tracks, and I could envision Chip and Buffy crossing the frozen lake on their machines—the snowmobile suits they wore, of course, would have designer labels. Still, I wondered if the club did much business in January. A three-season porch that jutted out over the bay was closed, and a sign locked in a glass frame just inside the door announced that complete breakfast, lunch, and dinner menus would resume when the ice left the lake, although a limited lunch menu and dinner menu were available during the winter months.\u003c/p\u003e\n\u003cp\u003eThere were only three people in the restaurant when I arrived. A middle-aged man and woman, who were holding hands and leaning in so close that their foreheads nearly touched, sat at a table in the corner, and my first thought was that they didn’t need a bar, they needed a motel. The third person was Jenny. She was sitting alone and staring out the window at the deserted marina, a glass of gold-colored wine in front of her. Herzog and I would have made five, but he elected to remain in the Cherokee.\u003c/p\u003e\n\u003cp\u003e“You tryin’ t’ do this on the down low,” he said.\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“A black man in a place like this gonna draw attention.”\u003c/p\u003e\n\u003cp\u003e“Do you think a black man sitting alone in a car outside a place like this will go unnoticed?”\u003c/p\u003e\n\u003cp\u003eHerzog waved at the nearly empty parking lot.\u003c/p\u003e\n\u003cp\u003e“Take my chances,” he said.\u003c/p\u003e\n\u003cp\u003eJenny seemed anxious as I approached, her eyes darting right and left as if she were afraid someone might recognize us. She was tall, with the body of a gym rat, but definitely not young. Her hair was too shiny to be her natural color; over the years her thin face had lost the youthful prettiness that had originally attracted her rich husband, yet it somehow managed to retain its beauty. She was wearing an impeccably tailored blue dress with blue shoes that matched her dress and a blue bag hanging by a blue strap over the back of her chair that matched the blue shoes. I guessed that she bought all three in the same place at the same time off the same mannequin. When I reached the table, I said her name and leaned in to kiss her cheek, grunting at the effort. Her nervousness left her then, replaced by genuine concern.\u003c/p\u003e\n\u003cp\u003e“McKenzie, are you okay?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I said. I settled into the chair opposite her, slipping my coat off and sitting as straight as possible. “How is it that after all these years you still look like the girl in the yellow bikini?”\u003c/p\u003e\n\u003cp\u003eJenny laughed at the reference, laughed as if she suddenly didn’t care who saw her. “That was a long time ago,” she said.\u003c/p\u003e\n\u003cp\u003e“I remember it like yesterday. You came home from college that summer, stretched out on a lounge chair, and never seemed to leave it.”\u003c/p\u003e\n\u003cp\u003e“Yes, and I remember you and Bobby Dunston were forever cutting through our backyard.”\u003c/p\u003e\n\u003cp\u003e“We were hanging out with your brother, Paul.”\u003c/p\u003e\n\u003cp\u003e“You hated Paulie.”\u003c/p\u003e\n\u003cp\u003e“Not that summer we didn’t.”\u003c/p\u003e\n\u003cp\u003e“What little perverts you were.”\u003c/p\u003e\n\u003cp\u003e“We were in junior high and you were the most beautiful woman we had ever seen.”\u003c/p\u003e\n\u003cp\u003e“Long time ago.”\u003c/p\u003e\n\u003cp\u003e“Not so long,” I told her.\u003c/p\u003e\n\u003cp\u003eA waiter materialized out of nowhere. Jenny asked for another glass of German Riesling. I ordered a Seven and Seven. After we were served, Jenny said, “What happened to your shoulder? You didn’t get shot, did you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-79.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
