{"id":103882,"no":8,"title":"Page 8","content":"\u003cp\u003eI wasn’t kicked or punched or slapped around, although rolling about the van floor with my hands cuffed behind my back was hardly the most comfortable I’ve been. The kidnappers didn’t threaten or curse me, and I didn’t threaten or curse them. Nor I did I demand that they tell me who they were or where we were going or what they wanted. There didn’t seem to be much point. I just tried to maintain my balance and concentrate while we whipped around corner after corner.\u003c/p\u003e\n\u003cp\u003eSharp corners meant city driving, my inner voice told me. No freeways; no long country roads.\u003c/p\u003e\n\u003cp\u003eEventually the van slowed to a stop. The door slid open again. I felt the frigid wind blow into the cargo area. A woman said, “Are you sure you weren’t followed?”\u003c/p\u003e\n\u003cp\u003eA man answered, “I’m sure.”\u003c/p\u003e\n\u003cp\u003e“Did you search him?” the woman asked. “Did you check for a wire, for a GPS transmitter?”\u003c/p\u003e\n\u003cp\u003e“Oh shit,” the man said.\u003c/p\u003e\n\u003cp\u003eSuddenly there were hands patting me down, checking my pockets.\u003c/p\u003e\n\u003cp\u003e“I’m not wired, and I don’t have a tracking device,” I said. “I don’t have your money, either, so what the hell, guys?”\u003c/p\u003e\n\u003cp\u003e“I’m not interested in money, McKenzie,” the woman said. “I’m interested in the Jade Lily.”\u003c/p\u003e\n\u003cp\u003eA pair of hands pulled me off the floor and sat me upright so my back was resting against the wall of the van. Someone yanked off the hood. I blinked against the light. When my eyes focused, I found myself staring into the face of one of the loveliest women I had ever known—and the most treacherous.\u003c/p\u003e\n\u003cp\u003e“Heavenly Petryk,” I said.\u003c/p\u003e\n\u003cp\u003eShe smiled her dazzling smile, opened her arms, the palms of her hands facing upward, and said, “Ta da.”\u003c/p\u003e\n\u003cp\u003eThe door was closed and the van’s heater was working. Heavenly pulled off a knit hat, allowing her golden hair to flow over her neck and shoulders, and opened her coat to reveal a black turtleneck sweater that seemed awfully tight and not because she had put on weight recently. Her shimmering blue eyes reminded me of a half-wild feline; the kind that was well fed by doting owners who nevertheless allowed it to roam unrestricted at night. She knelt next to me on the floor of the van.\u003c/p\u003e\n\u003cp\u003e“Kidnapping, Heavenly?” I said. “Really? You couldn’t just pick up a phone and call?”\u003c/p\u003e\n\u003cp\u003e“I need you to know that I mean business,” she said. “The last time our paths crossed, I don’t think you took me seriously.”\u003c/p\u003e\n\u003cp\u003e“I took you very seriously, especially after your friends threatened to shoot me.”\u003c/p\u003e\n\u003cp\u003e“Oh, they were just fooling.”\u003c/p\u003e\n\u003cp\u003eI glanced at the three men in the van with us. None of them were holdovers from Heavenly’s previous band of miscreants, yet they all matched her criteria—they were young, good-looking, and well-muscled and watched her every move as if she were Aphrodite in earthly form. I doubted that the three of them together could have removed the childproof cap from a bottle of aspirin.\u003c/p\u003e\n\u003cp\u003e“Are you fooling now?” I asked.\u003c/p\u003e\n\u003cp\u003eHeavenly smiled and patted my knee. “It’s good to see you again, McKenzie,” she said.\u003c/p\u003e\n\u003cp\u003e“Gosh, Heavenly. It’s good to see you, too. How long has it been?”\u003c/p\u003e\n\u003cp\u003eI already knew the answer—twenty-six months. I reminded her that she and I and a fairly motley group of scoundrels had rummaged through much of St. Paul in search of gold bullion hidden decades earlier by the notorious bank robber Frank “Jelly” Nash.\u003c/p\u003e\n\u003cp\u003e“That was fun,” Heavenly said. “We made a lot of money. Not as much as we were hoping, but still…”\u003c/p\u003e\n\u003cp\u003e“What are you doing?” I asked. “Why am I here?”\u003c/p\u003e\n\u003cp\u003e“To hear my pitch.”\u003c/p\u003e\n\u003cp\u003e“Pitch?”\u003c/p\u003e\n\u003cp\u003e“I know the thieves want to sell the Jade Lily back to the museum. I knew they would pick a go-between to handle the transaction. I honestly didn’t know it would be you until early this morning.”\u003c/p\u003e\n\u003cp\u003eEarly this morning? my inner voice said. She knew before I did.\u003c/p\u003e\n\u003cp\u003e“Are you saying you didn’t steal the Lily?” I asked.\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“You’re not the one who sent me around Lake Calhoun with a red rose in my hand?”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?”\u003c/p\u003e\n\u003cp\u003eWhy, indeed? Heavenly wouldn’t need a rose to identify me. She already knew what I looked like, knew where I lived; she probably still had my cell phone number.\u003c/p\u003e\n\u003cp\u003e“Besides,” Heavenly said, “if I had stolen the Jade Lily, I sure as hell wouldn’t have involved you. You’re a dangerous man, McKenzie.”\u003c/p\u003e\n\u003cp\u003eI didn’t know if that was a compliment or not.\u003c/p\u003e\n\u003cp\u003e“Since we’re all friends here, why don’t you uncuff me?” I said.\u003c/p\u003e\n\u003cp\u003eHeavenly laughed at the suggestion. “Oh, you,” she said and patted my knee again. She gestured at her three thugs. “This is the famous Rushmore McKenzie I told you about. Do you think we should take off his handcuffs?”\u003c/p\u003e\n\u003cp\u003eThe one nearest her said, “Yeah, go ’head. He doesn’t look like much.”\u003c/p\u003e\n\u003cp\u003e“Tommy, Tommy.” Heavenly shook her head at the insult and gave him a maternal smile; the kind mothers give their children when they say something foolish. “I think we’ll keep the cuffs on.”\u003c/p\u003e\n\u003cp\u003e“So, Hep, are you going to talk to me, what?” I said.\u003c/p\u003e\n\u003cp\u003e“You remembered my nickname.”\u003c/p\u003e\n\u003cp\u003e“Heavenly Elizabeth Petryk. Who could forget?”\u003c/p\u003e\n\u003cp\u003eShe gave my knee another playful pat. “You’re sweet,” she said. “Okay, where should we begin? What do you know about the Lily?” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-8.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
