{"id":103956,"no":85,"title":"Page 85","content":"\u003cp\u003e“No, but I recognized the name. McKenzie. Not from when we met, either. You’re the one they hired to take the Jade Lily back to the museum after the ransom was paid.”\u003c/p\u003e\n\u003cp\u003eHer candor caught me by surprise. To disguise my reaction, I glanced around the living room looking for a diversion. There was a stack of framed photographs resting on one of the boxes. The top photograph was apparently a wedding photo of Von and her husband standing on a lush green hill. He was wearing a dark suit. She was wearing a simple white sheath that somehow made Kate Middleton’s bridal gown look like a dishrag—or maybe it was just the way she wore it. A pond surrounded by birch trees lay below them. I knew where it had been taken—I had been there—but didn’t say. I held it up for Von to see.\u003c/p\u003e\n\u003cp\u003e“That was taken nearly two years ago,” she said. “I’m a lot older than I was then.”\u003c/p\u003e\n\u003cp\u003eThey were not married when Tarpley was hired by the museum, my inner voice said. That came later.\u003c/p\u003e\n\u003cp\u003e“Where did you meet your husband?” I asked.\u003c/p\u003e\n\u003cp\u003e“At an art exhibit.” She took the photograph from my hand and set it back on the pile. “I thought he was dashing. Swear to God. When he was offered the job at City of Lakes, I followed him here. I thought it would be an adventure. Became a tearjerker, instead. Three-hanky special. Aren’t you going to ask why?”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I told the police. They didn’t want to hear it. I told the insurance investigator. He didn’t believe me. You’re going to be different somehow?”\u003c/p\u003e\n\u003cp\u003eHer tone was both assertive and lacking in self-confidence. It was the tone of a woman who was skating on dangerously thin ice and knew it.\u003c/p\u003e\n\u003cp\u003e“Unlike them, I’m not looking to arrest anyone,” I said.\u003c/p\u003e\n\u003cp\u003eVon caught my eyes and held them, as if she were looking for a crack that would allow her to see inside my brain. She threw a furtive glance at Herzog, then came back to me.\u003c/p\u003e\n\u003cp\u003e“What exactly do you want?” she asked.\u003c/p\u003e\n\u003cp\u003e“Like you said, I’m the guy they hired to get the Jade Lily back.”\u003c/p\u003e\n\u003cp\u003e“The Lily was blown up.”\u003c/p\u003e\n\u003cp\u003e“Who says?”\u003c/p\u003e\n\u003cp\u003e“Maybe it was the insurance guy who said, I don’t remember.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. I was blown up, too. You could say I’m a little bit miffed about that.”\u003c/p\u003e\n\u003cp\u003eVon went to a purse that rested on yet another box. She fumbled for a cigarette and lit it with a plastic lighter, laying down a blue smoke screen between us.\u003c/p\u003e\n\u003cp\u003e“You guys should probably leave,” she said. “I don’t mean to be rude. I have a lot on my mind.”\u003c/p\u003e\n\u003cp\u003eI’ll bet, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“You said the police didn’t believe your story,” I said.\u003c/p\u003e\n\u003cp\u003e“Oh, they believed it. They just didn’t want me to repeat it.”\u003c/p\u003e\n\u003cp\u003e“Try me.”\u003c/p\u003e\n\u003cp\u003eVon blew some more smoke.\u003c/p\u003e\n\u003cp\u003e“One last time?” she asked.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“Where to begin?”\u003c/p\u003e\n\u003cp\u003e“Start with the robbery.”\u003c/p\u003e\n\u003cp\u003e“No, the story begins before that.”\u003c/p\u003e\n\u003cp\u003e“Start where you like.”\u003c/p\u003e\n\u003cp\u003e“I suppose it begins with the cop.”\u003c/p\u003e\n\u003cp\u003e“What cop?”\u003c/p\u003e\n\u003cp\u003e“Lieutenant Scott Noehring of the Minneapolis Police Department. He’s a hero, you know. It said so in the newspaper.”\u003c/p\u003e\n\u003cp\u003eVon paused for a moment as if she expected me to respond. When I didn’t, she took a long drag of the cigarette and resumed talking with the exhale.\u003c/p\u003e\n\u003cp\u003e“He appeared one day not long after Patrick started his new job with the museum,” Von said. “He explained that he knew all about Patrick’s past, and if Patrick didn’t cooperate, he would give the information to City of Lakes and every other museum he could think of, effectively blackballing him from his profession.”\u003c/p\u003e\n\u003cp\u003e“What information?”\u003c/p\u003e\n\u003cp\u003eVon had enough of the cigarette and put it out in a pristine ashtray. I wondered if smoking was a habit or just something she was using as a prop.\u003c/p\u003e\n\u003cp\u003e“Let me finish,” she said. “Patrick gave in to the cop. He started paying the blackmail. A thousand dollars a month. Doesn’t sound like much until you start adding up the months. Twelve in a year. Twenty-four over two years. The cop wasn’t satisfied with the amount, so he registered Patrick as a confidential informant. I’m not even sure what a confidential informant is, how it works, but whatever, all the money the police paid Patrick went into the cop’s pocket. I begged Patrick to tell me what happened. Finally he did. He told me that when he was a senior in high school he was accused of being a child molester. Of being a pedophile. He said the accusations had followed him ever since.”\u003c/p\u003e\n\u003cp\u003e“Was it true?”\u003c/p\u003e\n\u003cp\u003e“Technically. What happened, at least what Patrick told me happened, when he was a senior in high school he had sex with a freshman…”\u003c/p\u003e\n\u003cp\u003e“I was told the kid was more like nine.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-85.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
