{"id":103958,"no":87,"title":"Page 87","content":"\u003cp\u003e“A hundred and twenty-seven thousand dollars. That’s what they were going to pay me when I retrieved the Jade Lily. Only there is no Jade Lily to bring back, so guess what? I’m not getting paid.”\u003c/p\u003e\n\u003cp\u003eBoth Von and Herzog seemed quite confused by my remark.\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about this, McKenzie,” Von said.\u003c/p\u003e\n\u003cp\u003e“What do you know?”\u003c/p\u003e\n\u003cp\u003e“Are you a cop? Are you working for the cops? You have to tell me if you are.”\u003c/p\u003e\n\u003cp\u003eIt was one of the great urban legends, of course, that the police have to identify themselves to criminals when they ask. It’s simply not true and never has been, but who was I to argue with the woman.\u003c/p\u003e\n\u003cp\u003e“No, I am not a cop,” I said. “No, I am not working for the cops or the insurance company or the museum. What about you, Mr. Herzog?”\u003c/p\u003e\n\u003cp\u003e“Fuckin’ cops,” he said.\u003c/p\u003e\n\u003cp\u003e“All I want is my hundred and twenty-seven thousand. Von…” I stepped closer and gave her my most menacing look, the one I practice in front of the mirror when I’m alone. “I mean to get what’s mine. I may not be in any condition right now to beat it out of you. My friend…” I pointed at Herzog. “What do you say, Mr. Herzog?”\u003c/p\u003e\n\u003cp\u003e“You oughtn’ mess wi’ a man’s money,” he said.\u003c/p\u003e\n\u003cp\u003e“I don’t have your money, McKenzie. I don’t have any money. You have to believe me.”\u003c/p\u003e\n\u003cp\u003e“What happened to the one-point-three million that was paid for the Lily?”\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about that.”\u003c/p\u003e\n\u003cp\u003e“What do you know?”\u003c/p\u003e\n\u003cp\u003e“I know…” Von hesitated.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said.\u003c/p\u003e\n\u003cp\u003eShe retreated behind a wall of moving crates, but they didn’t seem to give her much comfort.\u003c/p\u003e\n\u003cp\u003e“It’s true,” she said. “I admit it. I knew Patrick was going to steal the Lily. He had it all planned out. All he needed was a go-between that he could trust, someone he chose and not the insurance company. Jenny had given me your name. She gave me your name because of something else that had nothing to do with the Lily.”\u003c/p\u003e\n\u003cp\u003e“This other matter—did it have anything to do with Derek Anderson, the man you were having an affair with?”\u003c/p\u003e\n\u003cp\u003eIt was the second time I caught her by surprise.\u003c/p\u003e\n\u003cp\u003e“Jenny told you a lot, didn’t she?” Von said. “Yes, it was Derek. We weren’t having an affair, though. I was still upset about Patrick, and I guess you could say I was trying him on for size. Only he started making demands. I thought I might need help—I still cared enough about Patrick that I didn’t want him to find out about Derek and me, only this other thing came up.”\u003c/p\u003e\n\u003cp\u003e“You gave Patrick my name?”\u003c/p\u003e\n\u003cp\u003e“I did. That’s all I did.”\u003c/p\u003e\n\u003cp\u003e“What was Patrick’s plan?”\u003c/p\u003e\n\u003cp\u003e“Steal the Lily and then sell it back,” Von said. “He told me that if we worked it right—if he worked it right—the insurance company would pay for the Lily’s return and the police would never be called. He said he knew a man who could launder the money—he said the insurance company would be sure to have it marked—and afterward he would give me a share and that would be the end of it.”\u003c/p\u003e\n\u003cp\u003e“Why steal the Lily? Why not steal something that was worth more?”\u003c/p\u003e\n\u003cp\u003e“In case we—he got caught.”\u003c/p\u003e\n\u003cp\u003e“Who was in on it with him?” I asked. “Besides you?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Sure you do.”\u003c/p\u003e\n\u003cp\u003e“I don’t. After the Lily was stolen, Patrick was killed. I believe it was his accomplices who did it, just like everyone else, but I don’t know who they are. I would have told the police if I knew. I loved Patrick. He was my best friend.”\u003c/p\u003e\n\u003cp\u003e“Who was your best friend?”\u003c/p\u003e\n\u003cp\u003eThe question came from a tall, dark man standing in the doorway. He had opened the front door and stepped into the house without Von or me noticing him. Herzog noticed, though. He took a few steps backward. His right hand was hidden under his jacket at the small of his back. He was staring at the intruder while his peripheral vision picked me up. There was a serious question in his eyes. I answered it with a slight shake of my head. His empty hand came out from under his jacket.\u003c/p\u003e\n\u003cp\u003e“Who are you people?” the man asked.\u003c/p\u003e\n\u003cp\u003e“Dennis.” Von maneuvered around the boxes to the door. “This is McKenzie and Mr. Herzog. They’re working for the museum to retrieve the Jade Lily.”\u003c/p\u003e\n\u003cp\u003e“I don’t care who they work for,” Dennis said.\u003c/p\u003e\n\u003cp\u003eVon reached his side and took his arm. “It’s all right,” she said.\u003c/p\u003e\n\u003cp\u003e“No it isn’t. The way the police and the insurance company keep badgering you. Now these guys. No. I won’t allow you to answer any more questions.”\u003c/p\u003e\n\u003cp\u003e“Are you an attorney?” I asked.\u003c/p\u003e\n\u003cp\u003e“I don’t need to be a lawyer to know Mrs. Tarpley has rights.”\u003c/p\u003e\n\u003cp\u003eI drifted to the door until I was standing next to Herzog. I recognized Dennis as I drew closer, even though the first time I had seen him he was standing much farther away. Dennis was the man who met Von in the corridor outside room 108.\u003c/p\u003e\n\u003cp\u003e“How long have you and Mrs. Tarpley known each other?” I asked.\u003c/p\u003e\n\u003cp\u003e“We were introduced—” Von said.\u003c/p\u003e\n\u003cp\u003eDennis broke her sentence. “That’s none of your business,” he said.\u003c/p\u003e\n\u003cp\u003e“My associate and I might just make it our business,” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-87.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
