{"id":103963,"no":92,"title":"Page 92","content":"\u003cp\u003eIt took longer than forty-five minutes, despite some daredevil driving by Herzog that left me breathless, because Jenny’s house was located on Cook’s Bay on the far western side of Lake Minnetonka and because the roads that led to it were narrow, winding, and indifferently marked. Finally we found Jenny’s private road. It wound upward over a low hill. When we crested the hill, we could see the house. It was made of brick and glass and was lit up like Target Field on game night. There were several vehicles parked in front of the six-car garage, including a City of Mound police cruiser. We parked behind them. The house itself was two stories high and built into the side of the hill with a spectacular view of the lake below. It was erected twenty years ago right after Jenny accepted her husband’s proposal of marriage, yet it looked like it was built yesterday. We were stopped at the door by a representative of Jenny’s security firm. I gave him my name; told him I was expected. He didn’t care. Jenny saw me, though.\u003c/p\u003e\n\u003cp\u003e“McKenzie, thank God,” she said.\u003c/p\u003e\n\u003cp\u003eThat was enough for the guard, who quickly stepped back and let us pass.\u003c/p\u003e\n\u003cp\u003eJenny was sitting on a sofa that looked like it could sleep three. She was wearing white fluffy slippers that matched her white fluffy robe. She was sitting with her legs drawn up, her knees pressed against her chest, her chin resting on top of her knees. There was a uniformed police officer standing next to her, a notebook and pen in his hands. A couple of security guards lingered nearby, looking as if they wanted to be useful but didn’t know how.\u003c/p\u003e\n\u003cp\u003eI knelt in front of Jenny and took her hand in mine.\u003c/p\u003e\n\u003cp\u003e“Are you okay, sweetie?” I asked.\u003c/p\u003e\n\u003cp\u003e“McKenzie, they were here,” Jenny said. “They came, just like you said they would.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eOne of the security guards stepped forward.\u003c/p\u003e\n\u003cp\u003e“Our security system frightened off an intruder,” he said. His expression suggested that he was quite pleased with himself. “There is evidence that a car was parked near the top of the hill. The intruder got out of the car and made his way toward the house through the snow, approaching from the far side.” He made a gesture with his hand toward his right. “At about sixty yards from the structure the footprints stopped and the intruder retreated the way he came. He must have been scared off by the lights and the siren from our security system.”\u003c/p\u003e\n\u003cp\u003eI glanced up at the cop. He gave me a slight shrug of his shoulders. “Sounds right,” he said.\u003c/p\u003e\n\u003cp\u003eI turned all of my attention back toward Jenny. “I’m sorry,” I said.\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around my neck and hugged me close. “You saved me,” she said.\u003c/p\u003e\n\u003cp\u003eI didn’t have the guts to tell her that I was the one who put her in danger.\u003c/p\u003e\n\u003cp\u003e“Where’s your husband?” I asked.\u003c/p\u003e\n\u003cp\u003e“I called him after I spoke to you, after I pulled the alarm. He was meeting with a business associate and said he would come home as soon as he could.”\u003c/p\u003e\n\u003cp\u003e“Where is he?”\u003c/p\u003e\n\u003cp\u003e“Orono.”\u003c/p\u003e\n\u003cp\u003e“Orono? Orono is a lousy five miles away. He could have walked here by now.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eShe spoke the words as if they were all she needed to describe the status of her marriage.\u003c/p\u003e\n\u003cp\u003eI did a quick three-sixty of the house from where I knelt in front of the sofa. Herzog was standing near the door. The guards were still milling about, talking softly to each other. The cop was impatiently tapping his notebook with his pen. Someone had the presence of mind to build a fire in the fireplace—I knew the place had four of them. When I looked back, I found Jenny staring into the flames.\u003c/p\u003e\n\u003cp\u003e“Maybe it’s time to move back to Merriam Park,” I said.\u003c/p\u003e\n\u003cp\u003eJenny turned her head so that her cheek was resting against her knees. There was a sad sort of smile on her lips as if she knew the answer to a complicated question but wished she didn’t.\u003c/p\u003e\n\u003cp\u003e“I’m not the one who’s going to move,” she said.\u003c/p\u003e\n\u003cp\u003eThe cop had other places to be, but the security guards promised to leave a man at Jenny’s house until her husband returned. Herzog and I climbed back into the Jeep Cherokee and worked our way to the county road that wound around Cook’s Bay.\u003c/p\u003e\n\u003cp\u003e“Now what?” he said.\u003c/p\u003e\n\u003cp\u003e“Time to be proactive.”\u003c/p\u003e\n\u003cp\u003e“Wha’s ’at mean?”\u003c/p\u003e\n\u003cp\u003e“Take me to Burnsville.”\u003c/p\u003e\n\u003cp\u003e“’Bout fuckin’ time.”\u003c/p\u003e\n\u003cp\u003eWe drove past Von Tarpley’s house twice. The Toyota RAV4 was parked in front both times. Lights burned in most of the rooms—apparently Von paid as much attention to the energy conservation flyers the power company sent out each month as I did. The third time we drove past we could see Dennis through the living room window. His head was bowed as if he was speaking to someone sitting below him.\u003c/p\u003e\n\u003cp\u003eHerzog pulled over and stopped the Jeep Cherokee at the end of the street. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-92.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
