{"id":103966,"no":95,"title":"Page 95","content":"\u003cp\u003e“It was a good plan,” I told her. “Such a good plan. The plan would have worked. But you got greedy. Wanted it all. It’s an old story. As old as time. As old as rhyme.”\u003c/p\u003e\n\u003cp\u003eI realized then that I was feeling light-headed and wasn’t exactly sure of what I was saying. I put my gun in my jacket pocket and moved toward Herzog. He was slumped against the wall, still cradling his head.\u003c/p\u003e\n\u003cp\u003e“How’s it going?” I asked.\u003c/p\u003e\n\u003cp\u003eHe looked at me as if I had asked for the Colonel’s secret recipe of eleven herbs and spices.\u003c/p\u003e\n\u003cp\u003e“As much as you hate ’em, Herzy,” I said, “I’m calling the police.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” he said.\u003c/p\u003e\n\u003cp\u003eI reached into the pocket of my jeans for my cell phone.\u003c/p\u003e\n\u003cp\u003eI didn’t see her until she spoke.\u003c/p\u003e\n\u003cp\u003e“You’re not getting away with this,” she said.\u003c/p\u003e\n\u003cp\u003eWhen I turned my back, Von had quickly crawled across the floor and retrieved the Iver Johnson. She was standing now, one eye closed, the other sighting down the barrel of the gun. The gun was pointed at me.\u003c/p\u003e\n\u003cp\u003e“C’mon,” I said.\u003c/p\u003e\n\u003cp\u003e“If you had just done what you were told, none of this would have happened,” she said. “You ruined everything.”\u003c/p\u003e\n\u003cp\u003eShe stepped toward me, the Iver Johnson leading the way. I glanced at Herzog, but he didn’t seem to notice what was happening.\u003c/p\u003e\n\u003cp\u003e“Stop,” I shouted.\u003c/p\u003e\n\u003cp\u003e“Huh?” Herzog said.\u003c/p\u003e\n\u003cp\u003eNo, wait, I didn’t shout it. I was going to, but … The voice came from my left. I looked for it and found Heavenly Petryk standing in the front doorway, her body twisted into a serviceable shooting stance, both hands gripping a compact Smith \u0026amp; Wesson 9 mm. She was pointing it at Von.\u003c/p\u003e\n\u003cp\u003e“Drop the gun, Von,” Heavenly said. “I mean it. Drop the gun. I’ll blow your brains out. Von. Drop the gun.”\u003c/p\u003e\n\u003cp\u003eVon dropped the gun at my feet. I kicked it away and turned toward Heavenly. She was smiling her luminous smile.\u003c/p\u003e\n\u003cp\u003e“No,” I said.\u003c/p\u003e\n\u003cp\u003e“Hi, McKenzie,” she said. “Glad to see me?”\u003c/p\u003e\n\u003cp\u003e“Oh, hell no.”\u003c/p\u003e\n\u003cp\u003e“I told you I knew who stole the Lily.”\u003c/p\u003e\n\u003cp\u003e“Sonuvabitch.”\u003c/p\u003e\n\u003cp\u003eHerzog and I stood outside El Cid’s tavern. The cold seemed to be affecting him more than it had before, and for the seventh or eighth time that night I said we should get him to a hospital, and for the seventh or eighth time he said, “Fuck no,” adding that only a pussy would go to the hospital for a simple bump on the head. I asked if he meant me, and he said he did.\u003c/p\u003e\n\u003cp\u003e“Are you sure you’re up for this?” I asked.\u003c/p\u003e\n\u003cp\u003e“Are you going to pay the rest of my money when we done?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003eThe Burnsville Police Department had kept us answering questions for several hours. We might still be answering them if not for the intervention of Lieutenant Rask. The fact that we had cornered his cop killer seemed to go a long way with him—and the Burnsville cops, too, for that matter—especially after a preliminary ballistic examination confirmed that the Iver Johnson had indeed fired the bullets that killed both Scott Noehring and Patrick Tarpley. Determining whether Dennis or Von was the shooter was a problem to be solved later. In fact, Rask was so thrilled, he even forgave Heavenly for lying to him. He had asked that we refrain from telling anyone what happened until after the press conference the next morning, but you know how the news media is. Somehow Kelly Bressandes learned of the break in the case and broadcast the information during the 10:00 P.M. newscast. The other stations quickly picked it up, and by the time Leno and Letterman came on, everyone who was paying attention knew that the hero cop’s killers had been apprehended and had confessed. The confessed part was a fabrication on the part of Kelly’s unidentified source, but what the hell. Soon after, I received a call from El Cid. Because of the fortuitous change in circumstances, he told me, he would be delighted to take the Jade Lily off my hands at the earliest opportunity. I asked him if now was a good time, and he said that it was.\u003c/p\u003e\n\u003cp\u003e“Here we go,” I said, and Herzog opened the door to Cid’s bar.\u003c/p\u003e\n\u003cp\u003eWe stepped inside, me first. The bar was empty—it was long past closing time. Only Cid and his bodyguard were there. They were both standing in the center of the room. A table was between them. There were two medium-sized suitcases on top of the table.\u003c/p\u003e\n\u003cp\u003e“I don’t see the Lily,” Cid said.\u003c/p\u003e\n\u003cp\u003e“I don’t see the money.”\u003c/p\u003e\n\u003cp\u003eCid and the bodyguard opened the suitcases and stepped back. Cid watched me as I approached. The bodyguard watched Herzog, who remained at the door looking as menacing as ever, despite the immense headache I knew he was experiencing. I took a bundle of cash out of the suitcase and thumbed through the bills. The cash was still wrapped in the same paper sleeves that the insurance company had used. I carefully set the bundle back into the suitcase.\u003c/p\u003e\n\u003cp\u003e“Where’s the Lily?” Cid asked.\u003c/p\u003e\n\u003cp\u003eI made a show of patting my pockets like I had forgotten something.\u003c/p\u003e\n\u003cp\u003e“Well?” Cid said. \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-95.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
