{"id":103968,"no":97,"title":"Page 97","content":"\u003cp\u003eI pointed at Heavenly. “Mr. Anderson was also actively involved in helping this woman embarrass the museum.” I turned to face Perrin Stewart. “Among other things, she’s the blond bimbo that Anderson wanted to replace you with. Aren’t you, Heavenly?”\u003c/p\u003e\n\u003cp\u003e“Well, I’m blond,” she said.\u003c/p\u003e\n\u003cp\u003e“Are you an art major?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Do you have any background in museum science?”\u003c/p\u003e\n\u003cp\u003e“Not at all.”\u003c/p\u003e\n\u003cp\u003e“Wait a minute,” Anderson said.\u003c/p\u003e\n\u003cp\u003e“Why were you involved with Mr. Anderson?” I asked.\u003c/p\u003e\n\u003cp\u003e“He was helping me take possession of the Jade Lily and return it to Tatjana Durakovic, who, by the way, is the object’s rightful owner. Isn’t that correct, Jeremy?”\u003c/p\u003e\n\u003cp\u003eGillard waved his hand slightly. “Eh,” he said.\u003c/p\u003e\n\u003cp\u003e“Wait a minute,” Anderson said. “That’s crazy.”\u003c/p\u003e\n\u003cp\u003e“He was hoping to use the controversy surrounding the actual ownership of the Lily as grounds for seeking the dismissal of Ms. Stewart,” Heavenly said. “Later, after it was stolen, he gave me information concerning Tarpley, your plans for buying back the Lily, and McKenzie’s involvement, with the understanding that I would use it to steal the Lily from the thieves.” She held her thumb and index finger an inch apart and peered through the opening. “I was this close.”\u003c/p\u003e\n\u003cp\u003e“Do you want Ms. Stewart’s position?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’m hardly qualified.”\u003c/p\u003e\n\u003cp\u003e“But you told me—” Anderson began.\u003c/p\u003e\n\u003cp\u003e“Exactly what you wanted to hear,” Heavenly finished.\u003c/p\u003e\n\u003cp\u003e“Mr. Fiegen,” I said.\u003c/p\u003e\n\u003cp\u003eFiegen cleared his throat. “This matter was brought to our attention earlier,” he said. “The other members of the board and I met in closed session, and it was agreed that Mr. Anderson should be dismissed immediately from the executive board of trustees and that he no longer be allowed to participate in any activities involving the City of Lakes Art Museum.”\u003c/p\u003e\n\u003cp\u003e“You can’t do that,” Anderson insisted.\u003c/p\u003e\n\u003cp\u003e“All in favor?” Perrin said, and five hands were raised. “Opposed?”\u003c/p\u003e\n\u003cp\u003e“You can’t do that,” Anderson repeated.\u003c/p\u003e\n\u003cp\u003e“Get out,” Perrin said. She was smiling when she said it. “Don’t come back.”\u003c/p\u003e\n\u003cp\u003e“This is bullshit,” Anderson said.\u003c/p\u003e\n\u003cp\u003e“Derek, my advice—leave quietly,” I said, “because even in my diminished state I’d be happy as hell to kick your ass.”\u003c/p\u003e\n\u003cp\u003eAnderson paused for a moment, searched the room for an ally, found none, announced, “This isn’t over yet,” and left the room, slamming the door behind him.\u003c/p\u003e\n\u003cp\u003e“I thought he’d never leave,” I said.\u003c/p\u003e\n\u003cp\u003eMr. Donatucci grinned and shook his head.\u003c/p\u003e\n\u003cp\u003eWe’re having some fun now, my inner voice said.\u003c/p\u003e\n\u003cp\u003ePozderac started beating on the top of the conference room table. His face was red, and the muscles in his neck were strained—I thought I could detect a few small bruises around his throat.\u003c/p\u003e\n\u003cp\u003e“Where is Lily?” he shouted. “I want Lily.”\u003c/p\u003e\n\u003cp\u003eHemsted tried to hush him, but Pozderac would not be hushed.\u003c/p\u003e\n\u003cp\u003e“Give it to me,” he said.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah,” I said. “Keep it in your pants, willya, pal?”\u003c/p\u003e\n\u003cp\u003e“I hate you,” he said.\u003c/p\u003e\n\u003cp\u003eYeah, that’ll keep me awake at night, my inner voice said.\u003c/p\u003e\n\u003cp\u003eI turned toward Fiegen.\u003c/p\u003e\n\u003cp\u003e“Mr. Fiegen, do you have anything more to say?”\u003c/p\u003e\n\u003cp\u003eHe gave his hair a couple of pats and looked at his fellow trustees, who all were suddenly as attentive as I had seen them.\u003c/p\u003e\n\u003cp\u003e“We are delighted that the ransom money has been recovered,” he said.\u003c/p\u003e\n\u003cp\u003e“Where is Lily?” Pozderac asked.\u003c/p\u003e\n\u003cp\u003eFiegen flashed him a look then that made me take a step backward. Did I say the room was hot? For a moment, it felt very chilly indeed. Pozderac, that mass-murdering piece of dog crap, actually looked away.\u003c/p\u003e\n\u003cp\u003eAre you sure you want to mess with this guy? my inner voice asked.\u003c/p\u003e\n\u003cp\u003e“Your firm no longer has any claims on the City of Lakes Art Museum, Mr. Donatucci, is that not true?” Fiegen asked.\u003c/p\u003e\n\u003cp\u003e“It is true.”\u003c/p\u003e\n\u003cp\u003e“We no longer have any claims on you, either. This document”—Fiegen opened his folder and lifted the top sheet—“clearly states that the City of Lakes Art Museum will make no claim against the Midwest Farmers Insurance Group involving the Jade Lily now or in the future.”\u003c/p\u003e\n\u003cp\u003eGillard leaned forward in his chair. “What about me?” he asked.\u003c/p\u003e\n\u003cp\u003e“Jer,” I said.\u003c/p\u003e\n\u003cp\u003eI put a finger to my lips, the universal sign for silence. He leaned back in his chair. I took the sheet from Fiegen, limped over to Donatucci, and handed it to him.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Donatucci said.\u003c/p\u003e\n\u003cp\u003e“Next…” Fiegen lifted the second sheet on the pile. “Ms. Stewart, the board of trustees has unanimously agreed to tender you a five-year extension on your current contract with the hope that you will remain executive director of the City of Lakes Art Museum. I am sure you will find the salary and benefits to be quite acceptable.”\u003c/p\u003e\n\u003cp\u003eAgain, I took the paper from Fiegen and walked it around the table. Perrin’s expression flicked back and forth between delight and confusion. India looked at her friend. A smile formed on her lips; then it went away and she returned her gaze to her folded hands. I set the sheet of paper in front of Perrin.\u003c/p\u003e\n\u003cp\u003e“McKenzie, did you do this?” she asked.\u003c/p\u003e\n\u003cp\u003eI whispered my reply. “Take the job, do the job, be happy—don’t let what happens next ruin it for you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-97.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
