{"id":103970,"no":99,"title":"Page 99","content":"\u003cp\u003eShe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“I don’t know why India didn’t tell her friend Perrin,” I said. “She did tell Jeremy. I know because India said she had never met Gillard before, yet the other day when we were in the workroom together it was clear that he had met her. Gillard could have taken the Lily back once he realized it was a fraud, but because of the lending agreement, he’d have to have a good reason, and he didn’t want to give a reason. The Lily represented half of Gillard’s net worth. He told me that he could get by on eight million dollars, but four—I’m guessing not so much. What to do? Intact, the Lily was relatively worthless, but if it was stolen or destroyed … I’m guessing Gillard offered India a share if she helped him steal the Lily from the museum. ’Course, neither of them had experience in this sort of thing, so they needed help. Does anyone want to explain how you involved Patrick Tarpley in your plan?”\u003c/p\u003e\n\u003cp\u003eNeither India nor Gillard replied.\u003c/p\u003e\n\u003cp\u003e“Perhaps you’ll tell us someday,” I said. “In any case, Tarpley warmed to the idea for reasons involving his wife and a crooked cop. It was an easy decision to make because it happened before, didn’t it? That was why the security system was upgraded six months ago, upgraded a lousy eighteen months after it was originally installed.” I pointed a finger at Mr. Donatucci. “Something was stolen from the museum and you bought it back, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m not at liberty to say,” Donatucci said.\u003c/p\u003e\n\u003cp\u003e“Sure. Anyway, Tarpley decided to go after the Lily. He was a smart man. He knew that getting the Lily out of the museum was the hard part. He wore the mask so he could pretend he was conducting a security drill in case someone stopped him. If that didn’t work or if he was caught later, he knew that since the Lily was not the priceless artifact it was advertised to be, he could plead down to a gross misdemeanor. Once he was out of the building, Tarpley was home free. Offering to sell the Lily back was the key. He knew that the museum—and the insurance company—would not only agree to his terms, which weren’t particularly onerous, you would work real hard to keep the theft a secret from both the cops and the public—protecting your reputation, you told me, remember? You claim to be a businessman, Fiegen. How would you rate the risk-reward of Tarpley’s enterprise?”\u003c/p\u003e\n\u003cp\u003eFiegen didn’t say.\u003c/p\u003e\n\u003cp\u003e“The reason I was involved—they picked me to act as a go-between because I was reliable and because I was known to the insurance company as being reliable. See, Tarpley and his crew had no intention of returning the Lily. Instead, they had planned from the very beginning to destroy it—once I had authenticated it, of course—knowing the insurance company would accept my word that it was real. That way Tarpley would get the ransom money from my hand. Gillard would get the insurance settlement. And their accomplices, specifically India, would be protected from charges of fraud. In fact, just about everyone would be happy once the Lily was blown sky-high except the insurance company, and who was going to cry crocodile tears for you?”\u003c/p\u003e\n\u003cp\u003e“Not many,” Donatucci said.\u003c/p\u003e\n\u003cp\u003e“It was a good plan,” I said. “The plan would have worked. Tarpley’s only mistake was in picking his crew. His wife. India’s brother. He thought they were trustworthy. They should have been. They were family, for God’s sake. ’Course, the way Von wept over Dennis, well, maybe it was a crime of passion when she shot her husband, after all. By the way, I’m sorry I shot him, India—Dennis, I mean. I wouldn’t have if he hadn’t tried to shoot me first. I hope he’s all right.”\u003c/p\u003e\n\u003cp\u003e“He’ll never turn against me, you know,” India said.\u003c/p\u003e\n\u003cp\u003e“A brother’s love. Touching.”\u003c/p\u003e\n\u003cp\u003e“It’s not true,” Perrin said. “It can’t possibly be true. India? How could you, India?”\u003c/p\u003e\n\u003cp\u003eShe’s using India’s first name instead of her last, my inner voice said. I guess they’re not friends anymore.\u003c/p\u003e\n\u003cp\u003e“I knew how important the exhibit was to you,” India said. “Having the Lily stolen was better than having it revealed that you contracted to exhibit a fake.”\u003c/p\u003e\n\u003cp\u003e“That sounds nice,” I said. “Still…”\u003c/p\u003e\n\u003cp\u003e“It’s true,” India insisted.\u003c/p\u003e\n\u003cp\u003e“You were in for a third of the ransom once Tarpley was killed. You, Dennis, and Von—three bags containing approximately four hundred and thirty thousand dollars each. How much does a curator make in a year working for a small midwestern museum? Listen, Lieutenant Rask of the Minneapolis Police Department is waiting outside. He did me a big favor by letting me pretend to be Philo Vance for a while. Tell him whatever you like.” \u003c/p\u003e","sourceLink":"https://allnovel.net/curse-of-the-jade-lily-mac-mckenzie-9/page-99.html","bookId":2218,"creation":"Oct 5, 2019 10:33:54 PM","modification":"Oct 5, 2019 10:33:54 PM"}
