{"id":71178,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003eThere’s something ominous about the bridge, yet I’m drawn to it by an inner compulsion. It’s not as painful as it used to be, but there are still raw memories linked to it that will haunt me forever.\u003c/p\u003e\n\u003cp\u003eThe sky is cloudy and the gentle breeze kisses my skin. I zip my jacket up as I gaze out at the dark water, lost in my thoughts of that terrible night when I considered jumping.\u003c/p\u003e\n\u003cp\u003e“Are you sure you’re going to be okay?” Micha asks, the same question he’s been asking for the last few days. His knuckles turn white as he clutches onto the railing of the bridge and peers down at the lake. “You’ve been through a lot this weekend.”\u003c/p\u003e\n\u003cp\u003eI wince at the recollection of my dad’s angry voice when he told me he wished I wasn’t his daughter, when Dean and I had confronted him about his alcoholism. Cruel words were shouted that ripped at my heart. I keep trying to convince myself that it’s the addiction talking, not him, but I don’t entirely believe it. My body and mind are exhausted from the drama, but I’ll push through, just like I did the last time. There is no running away anymore, only dealing with it and eventually moving on.\u003c/p\u003e\n\u003cp\u003eMicha doesn’t know the entire story of what happened and I want to save him from the burden. He worries about me all the time and the guilt consumes me. He should be happy, love life, do what he wants to do. He deserves it.\u003c/p\u003e\n\u003cp\u003eI frown, hating that when we walk off the bridge, he’ll leave me to return to the road with his band. “I’m a little sad you have to go.”\u003c/p\u003e\n\u003cp\u003eHe releases the metal railing and his aqua eyes sparkle as he hugs me. I bury my face into his chest and breathe him in, never wanting to let him go.\u003c/p\u003e\n\u003cp\u003e“I love you, Ella May.” He kisses the top of my head.\u003c/p\u003e\n\u003cp\u003eI shut my eyes and suck back the tears. “I love you, too.”\u003c/p\u003e\n\u003cp\u003eHe presses his full lips to mine and kisses me passionately, his lip ring digging into my mouth. My skin warms as his hands explore my back and his fingers graze across my ass, begging my body closer to his. I tangle my fingers through his soft hair before securing my arms around the back of his neck. His tongue traces the inside of my mouth and he intensifies the kiss until we have to pull away to catch our breath.\u003c/p\u003e\n\u003cp\u003eMy chest heaves as I gaze out at the lake one last time and the sun reflects in the water. “It’s time to go, isn’t it?”\u003c/p\u003e\n\u003cp\u003eHe squeezes my hand. “It’ll be okay. We have the whole twelve-hour drive ahead of us, and I’ll be gone for only a couple weeks before I’m annoying the hell out of you again.”\u003c/p\u003e\n\u003cp\u003eI force a smile. “I know and I’m looking forward to being annoyed.”\u003c/p\u003e\n\u003cp\u003eWe walk hand in hand back to Lila’s black Mercedes. I let him drive and he flies down the dirt road, leaving a cloud of dust behind us that quickly vanishes.\u003c/p\u003e\n\u003cp\u003eChapter 1\u003c/p\u003e\n\u003cp\u003eTwo months later\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003eEvery night I have the same dream. Micha and I are standing on opposite ends of the bridge. Rain beats down violently from the dark sky and the wind kicks up debris between us.\u003c/p\u003e\n\u003cp\u003eMicha extends his hand and I walk toward him, but he slips away from me until he lands up on the railing of the bridge. He teeters in the wind and I want to save him, but my feet won’t budge. A gust of wind slams into him and he falls backward, vanishing into the darkness. I wake up screaming and full of guilt.\u003c/p\u003e\n\u003cp\u003eMy therapist has a theory that the nightmare signifies my fear of losing Micha, although that doesn’t explain why I won’t save him. When she mentioned it, my heart sped up and my palms began to sweat. I never looked far enough into the future to realize that maybe one day Micha and I may not be together.\u003c/p\u003e\n\u003cp\u003eA forever? Does such a thing exist?\u003c/p\u003e\n\u003cp\u003eWith as much time as we spend together I wonder where our relationship is going. The last time we saw each other was at Grady’s funeral. It was the second toughest day of my life; the first being my mother’s funeral.\u003c/p\u003e\n\u003cp\u003eMicha and I had been out on the cliff that overlooked the lake, with a black jar containing Grady’s ashes. The wind was blowing and all I could think about was how much death owned life. At any moment death could snatch up life and take it away, just like it had done with my mom and Grady.\u003c/p\u003e\n\u003cp\u003e“Are you ready for this?” Micha had asked, removing the lid from the jar.\u003c/p\u003e\n\u003cp\u003eNodding, I extended my hand toward the jar. “I’m as ready as I’ll ever be.”\u003c/p\u003e\n\u003cp\u003eFrom behind us, the car was running and playing Grady’s favorite song, “Simple Man” by Lynyrd Skynyrd, a song that fit Grady and his lifestyle perfectly.\u003c/p\u003e\n\u003cp\u003eHe moved the jar toward me and we held onto it together. “What’s that thing he used to say all the time?” Micha asked me. “About life?”\u003c/p\u003e\n\u003cp\u003e“It isn’t as important to feel great about all the things we do,” I say softly. “But how we feel toward the end when we look back at everything we’ve done.”\u003c/p\u003e\n\u003cp\u003eTears streamed from my eyes as we tipped the jar sideways and spilled the ashes off the cliff. As we watched them float down to the lake, Micha wrapped his arm around me and took a shot of tequila. He had offered me a sip, but I had declined.\u003c/p\u003e\n\u003cp\u003eMy insides shook as pain rushed through me, but I quickly repressed it. Though sunlight sparkled down on us, there was a chill in the air as I observed the lake that seemed to hold everything. It was connected to so many deep, painful memories of my past with my mom and myself.\u003c/p\u003e\n\u003cp\u003e“Earth to Ella.” Lila waves her hand in front of my face and I flinch. “You seriously space off more than anyone else I know. Class got out like five minutes ago… What the heck is that drawing of? It’s creepy.”\u003c/p\u003e\n\u003cp\u003eDrawn back to the present, my gaze sweeps across the empty desks in the classroom and then falls on the pen in my hand, the tip pressed to a sketch of my face, only my eyes are black and my skin looks like dry, cracked dirt.\u003c/p\u003e\n\u003cp\u003e“It’s nothing.” I stuff the drawing into my bag and grab my books. Sometimes I lose track of time and it’s unsettling, because so did my mother. “It’s just a doodle I was messing around with during Professor Mackman’s boring lecture.”\u003c/p\u003e\n\u003cp\u003e“What’s the deal with you? You’ve been like super spaced out and super grumpy,” Lila asks as we walk out of the classroom and push out the doors, stepping into the sunlight.\u003c/p\u003e\n\u003cp\u003eI adjust my bag on my shoulder and pull my sunglasses down over my eyes. “It’s nothing. I’m just tired.”\u003c/p\u003e\n\u003cp\u003eShe stops abruptly in the middle of the sidewalk, narrows her blue eyes at me, and puts her hands on her hips. “Don’t shut down on me now. We’ve been doing so well.”\u003c/p\u003e\n\u003cp\u003eI sigh, because she’s right. “It’s just this dream I’ve been having.”\u003c/p\u003e\n\u003cp\u003e“About Micha?”\u003c/p\u003e\n\u003cp\u003e“How’d you guess?”\u003c/p\u003e\n\u003cp\u003eShe elevates her eyebrows. “How could I not guess? All of your thoughts are about him.”\u003c/p\u003e\n\u003cp\u003e“Not all of my thoughts.” I dwell in my thoughts about my dad, who’s in rehab and how he won’t talk to me.\u003c/p\u003e\n\u003cp\u003eWe stroll down the sidewalk and she links arms with me. There’s a skip to her walk, and her pink dress and blonde hair blow in the gentle fall breeze. About a year ago, Lila and I looked very similar, but then Micha cracked through my shell and I opted for a happy medium. I’m wearing a black Spill Canvas T-shirt and a pair of jeans, and my long auburn hair hangs loosely around my face.\u003c/p\u003e\n\u003cp\u003e“Where should we have lunch?” she asks as we reach the edge of the parking lot. “Because our fridge is empty.”\u003c/p\u003e\n\u003cp\u003e“We need to go shopping.” I scoot over as a group of football players walk by in their scarlet and gray uniforms. “But we also need a car to go anywhere, since you won’t take the bus anymore.”\u003c/p\u003e\n\u003cp\u003e“Only because of that creeper who licked my arm,” she says, cringing. “It was disgusting.”\u003c/p\u003e\n\u003cp\u003e“It was pretty gross,” I agree, trying not to laugh.\u003c/p\u003e\n\u003cp\u003e“My dad’s such a jerk,” Lila mutters with a frown. “He should have at least warned me when he decided to tow my car back home. It makes no sense. He doesn’t want me there, yet he takes my car away because I ran out during the summer.”\u003c/p\u003e\n\u003cp\u003e“Dads tend to be jerks.” At the end of the sidewalk, I veer to the left. “Mine won’t talk to me.”\u003c/p\u003e\n\u003cp\u003e“We should make a Dads Suck Club,” she suggests sarcastically. “I’m sure a lot of people would join.”\u003c/p\u003e\n\u003cp\u003eI strain a smile. I don’t blame my dad for his negative feelings toward me. It was my choice to leave that night my mom died and now I have to deal with the consequences—it’s part of moving on.\u003c/p\u003e\n\u003cp\u003eI stay under the shade of the trees as we head up the sidewalk toward the side section of the school. “Let’s just eat at the cafeteria. It’s the easiest place to get to.”\u003c/p\u003e\n\u003cp\u003eHer nose scrunches. “Easy, in the sense that it’s close. But other than that there is nothing easy about…” She trails off as her eyes stray to the side of the campus and a conniving smile expands across her face “Here’s an idea. You could ask Blake to give us a ride somewhere.”\u003c/p\u003e\n\u003cp\u003eI spot Blake walking across the campus yard toward his car. He is in my water base media class and talks to me a lot. Lila insists it’s because he has a thing for me, but I disagree.\u003c/p\u003e\n\u003cp\u003e“I’m not going to just go up and ask him for a ride.” I tug on her arm. “Let’s just eat in the cafeteria—”\u003c/p\u003e\n\u003cp\u003e“Hey, Blake!” she hollers, waving her arms in the air, then giggles under her breath.\u003c/p\u003e\n\u003cp\u003eBlake’s brown eyes scan the campus and a smile expands across his face as he struts across the lawn toward us.\u003c/p\u003e\n\u003cp\u003e“He knows I have a boyfriend,” I tell Lila. “He’s just nice.”\u003c/p\u003e\n\u003cp\u003e“Guys are hardly ever just nice, and I’m using his little crush on you to get us a ride out of here,” Lila whispers. “I’m so sick of being stuck here.”\u003c/p\u003e\n\u003cp\u003eMy lips part in protest, but Blake reaches us, and I cinch my jaw shut.\u003c/p\u003e\n\u003cp\u003eHe has a beanie over his dark-brown hair and blue paint spots dot the front of his faded jeans and the bottom of his tan T-shirt.\u003c/p\u003e\n\u003cp\u003e“So what’s up? His thumb is hooked on to the handle of the ratty backpack slung over his shoulder and he looks at me like I’m the one who called him over. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-1.html","bookId":1970,"creation":"Oct 5, 2019 10:19:39 AM","modification":"Oct 5, 2019 10:19:39 AM"}
