{"id":71193,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eClutching onto the bouquet, I focus on Caroline and Dean, but there is a heightened sense of awareness that Micha is watching me from the back row.\u003c/p\u003e\n\u003cp\u003eThe minister starts his speech and my mind automatically drifts to my future again. I want to see it desperately. I want to know how my life goes.\u003c/p\u003e\n\u003cp\u003eAdrenaline consumes my body and I fidget with the petals on the violet flowers, mentally telling myself to stay calm as Dean and Caroline read their vows. Listening to their words of love and commitment, my body stills. I want this. So much. I want someone to be mine forever—I want Micha.\u003c/p\u003e\n\u003cp\u003eBut I need to become a person we can both love; otherwise we’ll never make it.\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eMicha\u003c/p\u003e\n\u003cp\u003eI can’t take my eyes off her the entire ceremony. She’s never been much of a crier in public so it’s startling to watch her try to choke back the tears and all I want to do is comfort her.\u003c/p\u003e\n\u003cp\u003eDean looks really happy, which kind of annoys me. Ella might have dusted what he did under the rug, but it doesn’t mean anything to me. He’s part of what broke her—part of why Ella will never be the same girl.\u003c/p\u003e\n\u003cp\u003eThe minister declares, “You may kiss the bride.”\u003c/p\u003e\n\u003cp\u003eDean and Caroline lean into one another and kiss, and everyone stands up and claps. As they walk down the aisle, people throw rose petals at them from the baskets placed in front of each chair. Lila collects a handful and joins in, throwing petals in the air.\u003c/p\u003e\n\u003cp\u003eEthan rolls his eyes. “I suddenly remembered why I never go to weddings,” he utters under his breath. “They’re too cheesy for me.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess,” I reply, not completely agreeing with him. “But the cheesiness does have a point.”\u003c/p\u003e\n\u003cp\u003eOnce Caroline and Dean leave the canopy, the groomsmen and bridesmaids follow in a line. The guy Ella’s been paired up with annoyingly keeps checking her out and he whispers something to her as they walk outside.\u003c/p\u003e\n\u003cp\u003eThe crowd moves across the yard to the back deck of the house, where another canopy is set up over tables decorated with rose petals and candles. There are lights strung across the ceiling and a massive chocolate fountain against the back wall.\u003c/p\u003e\n\u003cp\u003eElla waits at the front where a cameraman is getting set up to take pictures. As she waits, her gaze collides with mine. She rolls her eyes, like she thinks this whole thing is silly and I wink at her.\u003c/p\u003e\n\u003cp\u003eEthan, Lila, and I steal a few glasses of champagne and plates of cake and pick a table near the bar, drinking in silence as the music turns on.\u003c/p\u003e\n\u003cp\u003e“So how long are we obligated to stay here, do you think?” Ethan gags on the glass of champagne. “God, rich people have bad taste in drinks.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Lila protests, setting her glass on the table. “I think it’s good.”\u003c/p\u003e\n\u003cp\u003e“That’s because you’re rich,” Ethan jokes, shoving up the sleeves of his shirt, and then he takes a bite of his cake. “And you were brought up to think that expensive stuff tastes good.”\u003c/p\u003e\n\u003cp\u003eLila sticks out her tongue and there’s purple frosting on it. “I think you might be the one with bad taste.”\u003c/p\u003e\n\u003cp\u003eEthan scrunches his eyebrows, like he’s overthinking. “Nah, I have excellent taste.”\u003c/p\u003e\n\u003cp\u003eEthan used to give me crap about Ella and my needing to screw and get it over with. I’m considering telling him the same thing about Lila and him.\u003c/p\u003e\n\u003cp\u003eElla drops the bouquet before slumping into the chair next to me. “God, weddings are exhausting.”\u003c/p\u003e\n\u003cp\u003eI pluck a piece of grass out of her hair and flick it on the ground. “You want to get out of here? We could go get some dinner or something.”\u003c/p\u003e\n\u003cp\u003e“I can’t leave yet.” She frowns, rests her head back on the chair, and stares up at the ceiling. “There are more pictures to come.”\u003c/p\u003e\n\u003cp\u003eShe straightens up in the chair and steals a bite of my cake, leaving a little bit of purple frosting on her bottom lip. I want to lean over so badly and lick it off.\u003c/p\u003e\n\u003cp\u003e“What?” she asks when she notices me staring.\u003c/p\u003e\n\u003cp\u003eI reach toward her and she freezes as my thumb grazes her bottom lip. “We should dance.”\u003c/p\u003e\n\u003cp\u003eShe arches her eyebrows. “Since when do either of us dance?”\u003c/p\u003e\n\u003cp\u003e“We always dance.” Extending my hand to her, I get to my feet.\u003c/p\u003e\n\u003cp\u003e“But our dancing is a lot different than their dancing.” She points a finger at the area where people are slow dancing. “We’d probably scar their innocent little minds.”\u003c/p\u003e\n\u003cp\u003e“Come on, Ella May, dance with me.” Dazzling her with my most alluring smile, I keep my hand out, hoping she’ll take it.\u003c/p\u003e\n\u003cp\u003eSighing, she laces her fingers with mine, and I pull her to her feet. When we reach the center of the dance floor, I twirl her around and collide her into me. A smile tugs at her lips as I put my hands on her hips. Guiding her closer, she hooks her arms around the back of my neck.\u003c/p\u003e\n\u003cp\u003eAs we dance to the music, I put my lips beside her ear and sing along with the lyrics.\u003c/p\u003e\n\u003cp\u003eShe leans back to look me in the eyes. “How do you know the lyrics to “The Story”? Most guys don’t listen to Brandi Carlile.”\u003c/p\u003e\n\u003cp\u003e“Shh… don’t tell anyone.” I wink at her and hug her closer. “And you used to listen to this song all the time. How could I not know the lyrics?”\u003c/p\u003e\n\u003cp\u003eShe clutches onto me as I continue to sing. Her head rests on my shoulder and I’m no longer scared of telling her how I feel. I want her to know—need her to understand, because holding it inside is no longer an option.\u003c/p\u003e\n\u003cp\u003e“I love you, Ella May,” I whisper, kissing her cheek. “And one day I want to be doing this exact same thing at our wedding.”\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003e“The Story” by Brandi Carlile plays through the room, soft lyrics that tell a story that hits straight at my heart. Micha is looking into my eyes deeply and winning my heart more than he already has.\u003c/p\u003e\n\u003cp\u003eThen he tells me that he wants to do this exact thing at our wedding and my lungs compress. I want to run away and hide, but I fight to hold onto my sanity.\u003c/p\u003e\n\u003cp\u003e“Micha, I—”\u003c/p\u003e\n\u003cp\u003eHe puts a finger over my lips. “Don’t say anything, okay? Just think about it for a while. I’m not talking about right this second. I just want you to know how I feel.”\u003c/p\u003e\n\u003cp\u003eI lift his finger away. “I have to say this because it’s important that you know how I feel. I can’t do this right now.” His face falls as I continue. “But someday, yes. I need to get myself together first. I need to be okay with myself before I give you my whole heart.”\u003c/p\u003e\n\u003cp\u003eHe studies my face. “I’m not sure what you’re saying.”\u003c/p\u003e\n\u003cp\u003e“I’m saying I think we should be friends until I can figure out how to get myself together again,” I explain. “I don’t want to do anything to hurt you, and right now I just don’t know if I can do that.”\u003c/p\u003e\n\u003cp\u003eHe cocks an eyebrow. “You want us to be friends? Because I’m not sure that’s possible.”\u003c/p\u003e\n\u003cp\u003e“We have to, and then maybe one day down the road, after I’ve put my shit together, we can be more, but only if you still want to.” I summon a deep breath, my insides hurting as I add, “If someone better comes along, I don’t want you to hesitate because of me.”\u003c/p\u003e\n\u003cp\u003e“No one else could ever be better than you,” he says, and I start to open my mouth to protest, but he talks over me. “But if that’s what you need, then I’ll do it. We can be friends… for a while.”\u003c/p\u003e\n\u003cp\u003eHe’s not completely committed, but I didn’t expect him to be. He’s the most determined person I know.\u003c/p\u003e\n\u003cp\u003eI kiss his cheek and then place my head on his shoulder, breathing in the comforting smell of him as we sway in sync to the music, holding on, yet letting go.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eMicha\u003c/p\u003e\n\u003cp\u003eIt’s been a few days since Ella and I parted from the wedding, but it feels like months. We talk on the phone several times a day, but it’s not the same between us and I miss being with her.\u003c/p\u003e\n\u003cp\u003e“Man, I’m so bored,” Ethan complains as he surfs the channels with his boots kicked up on the coffee table. “Can’t we just go do something?”\u003c/p\u003e\n\u003cp\u003eI’m lying on my bed reading the message over and over again. A text showed up on my phone yesterday from my dad. It said he needed to see me—that he had something he wanted to ask. I’ve been staring at it, deciding if walking down that road with him again is a good idea. We’ve met two times and each one was uncomfortable and painful, but my mind won’t be able to settle until I know what he wants.\u003c/p\u003e\n\u003cp\u003e“I don’t know… I guess we could go get something to eat.” Sitting up, I swing my legs off the edge of the bed, and text my dad, asking him where he wants to meet up.\u003c/p\u003e\n\u003cp\u003eHe texts me back quicker than I anticipated, asking me if I can meet him at the bakery up on Ninth Street in about an hour. Wavering, I finally text back that I will.\u003c/p\u003e\n\u003cp\u003e“Never mind. I can’t go out.” I put on a black hoodie and zip it up. “I have to go meet someone.”\u003c/p\u003e\n\u003cp\u003eHe targets me with a condemning look. “A girl someone?”\u003c/p\u003e\n\u003cp\u003eI scoop up the house keys from off the top of the dresser. “No, it’s just someone I used to know.”\u003c/p\u003e\n\u003cp\u003eHis face twists with confusion. “It’s not Naomi, is it? Because I’d like to advise that you stay away from that—she’s crazy. She basically tried to rape me last night.”\u003c/p\u003e\n\u003cp\u003e“Like you didn’t like it.”\u003c/p\u003e\n\u003cp\u003e“Hey, I like my women and everything, but she’s a little too much. She went from the bartender to some dude handing out flyers on the street to me. Besides, she has a thing for you.”\u003c/p\u003e\n\u003cp\u003e“I know that.” I put my wallet into the back pocket of my jeans. “You weren’t the only one she hit on last night.”\u003c/p\u003e\n\u003cp\u003e“Wow.” His eyes widen. “And I thought I was bad.”\u003c/p\u003e\n\u003cp\u003eI stuff my phone into the pocket of my hoodie. “Can you do me a favor? Can you tell Dylan or Chase when—if—they show up, that I might not make it to practice?”\u003c/p\u003e\n\u003cp\u003eHe rummages through the very slim selection of food in the fridge. “Do you think they’ll show up? I mean, you haven’t seen anyone but Naomi since you got back and neither of them showed up to practice yesterday.”\u003c/p\u003e\n\u003cp\u003e“I know that.” I open the front door and notice it’s raining. “But just in case they show, will you tell them?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-16.html","bookId":1970,"creation":"Oct 5, 2019 10:19:39 AM","modification":"Oct 5, 2019 10:19:39 AM"}
