{"id":71202,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe’s been acting weird since last night, more affectionate, which I don’t mind, but it’s puzzling.\u003c/p\u003e\n\u003cp\u003eOnce the room is cleared out, the nurse prepares the machine and puts a needle in my arm. I barely notice the sting. My thoughts are with Ella and what she’s saying to my dad.\u003c/p\u003e\n\u003cp\u003eElla\u003c/p\u003e\n\u003cp\u003eAs soon as I lay eyes on Micha’s dad, it’s clear he’s an arrogant asshole. He’s wearing a suit and carrying a briefcase, like he needs to prove he has somewhere important to be. Micha hasn’t really talked to me much about what goes on between them, but it’s obvious that it’s been bad.\u003c/p\u003e\n\u003cp\u003eAfter the nurse asks us to leave, I sit in the waiting area and Micha’s dad seats himself across from me. It’s loud, with screaming children and people coughing.\u003c/p\u003e\n\u003cp\u003e“You’re that little girl who lived next door, aren’t you?” Micha’s dad asks with a disdainful tone. He looks like Micha, with aqua eyes and attractive facial features, only older. “The one who had the family with all the problems.”\u003c/p\u003e\n\u003cp\u003eHe hits me in my weak spot and it takes a lot of mental preparation before I retaliate. “Aren’t you the asshole who walked out on his family?”\u003c/p\u003e\n\u003cp\u003eThe old lady beside me turns her head in our direction, shunning me with a look for my foul language.\u003c/p\u003e\n\u003cp\u003eMicha’s dad leans forward in his seat, buttoning up the cuff of one of his sleeves. “I’d like to know why you think you can talk to me this way. You don’t know me.”\u003c/p\u003e\n\u003cp\u003e“But I do know you.” I cross my legs and rest my arms on my lap. “You’re the man who walked out on the greatest person you’ll never know. And you know what, I’m kind of glad you did, otherwise Micha might have turned into a dick like you.”\u003c/p\u003e\n\u003cp\u003eMicha’s dad looks at me like he wants to slap me and the old lady narrows her eyes at me, about to say something, but I leave the room before she gets an opportunity.\u003c/p\u003e\n\u003cp\u003eI wander around the hospital halls and pass the nurse’s desk, deciding to steal a lollipop from out of the bin to give to Micha as a joke. The hospital is a sad place, full of crying and screaming people and beeping machines. It’s like everyone is waiting around for someone to die and it puts an unnerving feeling in the air. It brings me back to the day my mother died and we went to the hospital with her, even though she was pronounced dead on arrival. I didn’t cry, but my dad and Dean did, hugging each other while I stood near the end of the hall, watching the nurses and doctors walk by.\u003c/p\u003e\n\u003cp\u003eI felt out of place, like I shouldn’t have been there. Finally I ended up leaving and walked all the way home, curled up in my bed, and stared at the ceiling until the sun rose, knowing my life would never be the same.\u003c/p\u003e\n\u003cp\u003eWhen I reach the psychiatry services area, it feels like an invisible hand winds around my neck and strangles me. I back away from it quickly, bumping into a nurse wearing blue scrubs.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” She glances over my shoulder at the shut door. “You shouldn’t be back here.”\u003c/p\u003e\n\u003cp\u003eI inch away from her. “Nothing. I was just looking for the restroom.”\u003c/p\u003e\n\u003cp\u003eI collect my thoughts about how I might end up in a place like this and I return to the front desk area. Micha is waiting for me in one of the chairs, flipping through a magazine. His skin is pale and his blond hair sticks to his forehead. He has on a Rise Against T-shirt and black jeans and the leather bands that were on his wrist are replaced by a bandage.\u003c/p\u003e\n\u003cp\u003eHiding the lollipop in my hand behind my back, I approach him. “You made it out alive.”\u003c/p\u003e\n\u003cp\u003eHe looks up at me and smiles tiredly. “Of course I did, but where did you wander off to?”\u003c/p\u003e\n\u003cp\u003e“Nowhere really.” I sit down in the chair beside him and he tosses the magazine onto the table. “I wanted to get away from your father.”\u003c/p\u003e\n\u003cp\u003eHe searches my face. “What did you say to him? Because he came back to the room all pissed off.”\u003c/p\u003e\n\u003cp\u003eI give a one-shouldered shrug. “Nothing but the truth.”\u003c/p\u003e\n\u003cp\u003eGrinning, he stretches his legs out in front of himself and raises his arms above his head. “If it’s okay with you I’d like to go back to the hotel room and sleep. That took a lot out of me.”\u003c/p\u003e\n\u003cp\u003e“Don’t you want to wait for your dad to get out?”\u003c/p\u003e\n\u003cp\u003e“Nah, not really.” He drops his hands to his lap. “What are you hiding behind your back?”\u003c/p\u003e\n\u003cp\u003eMy mouth curves into a grin as I extend my hand out to him with the red lollipop in my palm. “This is for being a very brave boy.”\u003c/p\u003e\n\u003cp\u003eHe laughs softly and takes the lollipop. “God, I love you.”\u003c/p\u003e\n\u003cp\u003eI get to my feet and help him to his. His movements are lethargic as we head toward the sliding-glass doors.\u003c/p\u003e\n\u003cp\u003eHe peels the wrapper off the lollipop and puts it in his mouth. “As much as I love your gift, there are a ton more ways you could make me feel better when we get back to the room.”\u003c/p\u003e\n\u003cp\u003eI laugh under my breath, not protesting, because at that moment I’d do anything for him.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eMicha\u003c/p\u003e\n\u003cp\u003eThe leaves have fallen from the trees and the air has cooled, but it’s nothing compared to Star Grove. It’s almost time to go home for Christmas break, and Christmas seems to be everywhere. Ella is still being stubborn about it. I try multiple times to convince her to go with me, but every time she declines politely.\u003c/p\u003e\n\u003cp\u003eTwo nights before Ethan and I are supposed to leave just happens to be my first gig at The Hook Up. It’s Friday night and every table and booth is full. People crowd the bar, yelling out orders to the bartender, a midtwenties woman with bright tattoos on her arms and dreadlocks and a piercing in her nose. There are red and green lights strung up along the ceiling and a Christmas tree centerpiece on each table.\u003c/p\u003e\n\u003cp\u003eIt’s been a while since I played by myself and there’s unnatural nervous energy pouring through my blood. From the back doorway, my eyes scan the room, taking in the noisy people.\u003c/p\u003e\n\u003cp\u003eSomeone pinches my ass from behind and I spin around. “What the fuck?”\u003c/p\u003e\n\u003cp\u003eElla smiles brightly at me. “You’re nervous.”\u003c/p\u003e\n\u003cp\u003eMy eyes stroll lazily down her body. Her hair is done up in this messy twist with bits and pieces framing her face, her full lips shine in the light, and she’s got this short, green, thin-strapped shirt on and a pair of skin-tight jeans that hug every inch of her curves. “Get real, pretty girl. You know I never get nervous.”\u003c/p\u003e\n\u003cp\u003e“You look nervous,” she repeats, dragging her bottom lip between her teeth.\u003c/p\u003e\n\u003cp\u003eI trace my finger across her red lips. “You look a little nervous yourself.”\u003c/p\u003e\n\u003cp\u003eShe nips playfully at my finger, startling me and turning me on. “I’m only nervous for you.”\u003c/p\u003e\n\u003cp\u003eEver since we left New York, our relationship has been on a strict friends basis. She seemed to close the door when we returned to our real lives so I backed off, even though I didn’t want to.\u003c/p\u003e\n\u003cp\u003e“Did you come back here just to psych me out?” I joke to cover up the sexual tension. I rake my hands through my hair and glance over my shoulder at the people pouring in through the front door. “Because that is very mean of you.”\u003c/p\u003e\n\u003cp\u003eShe throws her arms around my neck and bites at my earlobe. “I’m feeling very mean tonight.”\u003c/p\u003e\n\u003cp\u003eGently pushing her back by the shoulder, I notice her eyes are glossy and dilated. “Are you drunk?”\u003c/p\u003e\n\u003cp\u003eShe bobs her head up and down, looking cute as hell. “I had a rough night so Lila gave me some shots of Bacardi.”\u003c/p\u003e\n\u003cp\u003e“Lila gave you Bacardi?” I question with a doubtful arch of my eyebrow. “She doesn’t seem like the Bacardi type.”\u003c/p\u003e\n\u003cp\u003e“Well… Ethan gave it to her.” She teeters to the side, falling toward the floor, and my arm snakes around her waist.\u003c/p\u003e\n\u003cp\u003eI help her recompose her balance and keep a hand on her side. “Are you going to be okay?”\u003c/p\u003e\n\u003cp\u003e“I’ll be fine…” Her eyes drift to the middle of the room where people are dancing beneath the bright lights. “We should dance.”\u003c/p\u003e\n\u003cp\u003eSuppressing a laugh, I scoot us to the side when a group of rough-looking guys walks by. I turn her back to the wall and she leans against it while I brace a hand possessively beside her head. “Ella May, I have to play in, like, five minutes. I can’t dance right now.”\u003c/p\u003e\n\u003cp\u003eShe pouts out her bottom lip, sulking and batting her eyelashes. “Pretty please.”\u003c/p\u003e\n\u003cp\u003e“Ella…” I start through a laugh and then my shoulders jerk upward as one of her hands rubs up the front of my jeans over my hard cock. I snag her hand before she can stick it down the front of my jeans. “Baby, I think you might be a little drunk, so take it easy, okay?”\u003c/p\u003e\n\u003cp\u003eHer free hand begins to seek the same area when Ethan and Lila appear in the doorway. Ethan’s carrying a beer in his hand and Lila has a phone up to her ear, talking really loudly over the noisy room behind us.\u003c/p\u003e\n\u003cp\u003e“So she found you,” Ethan calls out with a smirk. “Thank God. She wouldn’t shut up about you.”\u003c/p\u003e\n\u003cp\u003eElla burrows her face into my chest. “I’m tired.”\u003c/p\u003e\n\u003cp\u003e“How much did you let her drink?” I ask Ethan, annoyed. “Too much, obviously.”\u003c/p\u003e\n\u003cp\u003eEthan shakes his head and tips his head back to take a swing of his beer. “She chose to drink. I left them out in the living room for, like, fifteen minutes while I was taking a shower, getting ready for this little shindig. When I came out, there was a half a bottle of our Bacardi missing and these two were in the kitchen drunk off their asses.”\u003c/p\u003e\n\u003cp\u003eLila stumbles in her heels and supports herself with a hand against the wall. “Well, I don’t really give a shit what you do,” she says into the phone. “I don’t want you coming over.”\u003c/p\u003e\n\u003cp\u003eA big grin rises across Ethan’s red-tinted face as he points at Lila. “She’s breaking up with some dude over the phone. It’s fucking hilarious.”\u003c/p\u003e\n\u003cp\u003e“Are you drunk?” I accuse, stumbling backward as Ella puts all her weight against me.\u003c/p\u003e\n\u003cp\u003eEthan nods his head. “Maybe a little.”\u003c/p\u003e\n\u003cp\u003eI smooth Ella’s hair away from her face. “Who drove?”\u003c/p\u003e\n\u003cp\u003e“We took a taxi.” Ethan gulps down his beer and sets the empty bottle down near the wall with many discarded bottles and glasses. “I’m not stupid enough to drive drunk.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-25.html","bookId":1970,"creation":"Oct 5, 2019 10:19:39 AM","modification":"Oct 5, 2019 10:19:39 AM"}
