{"id":71210,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI read out loud the words that are far too simple to sum her up. “Maralynn Daniels, loving mother and wife.” There was no mention of her struggle or how she got dealt a shitty hand at life.\u003c/p\u003e\n\u003cp\u003eMy thoughts drift back to a conversation she and I had when I was about fifteen. We were watching television, although she was dazing off a lot and not paying attention.\u003c/p\u003e\n\u003cp\u003e“Why do you think I’m this way?” she asked abruptly with a contemplative look on her face.\u003c/p\u003e\n\u003cp\u003eI turned the volume of the television down. “What do you mean, Mom?”\u003c/p\u003e\n\u003cp\u003eShe stared at the wall as if it had held the answers to life. “Why can’t I escape the dark thoughts, like everyone else? Why can’t I think the same as everyone?”\u003c/p\u003e\n\u003cp\u003eI racked my brain for a good answer to give her. “I don’t think everyone thinks the same, Mom. Everyone’s different.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but why do some people get it easy?” She looked at me and her green eyes were huge, like she was hypnotized. “They just walk through life without problems.”\u003c/p\u003e\n\u003cp\u003eI let out a slow breath, knowing my words were going to be important to her. “Everyone has their problems, Mom. It’s just that some people’s are harder.” I inched toward her and the fear in her eyes began to subside. “I think the people who go through more can end up stronger in the long run. They have insight in to what a lot of people don’t have and a better understanding—they can be more open-minded.”\u003c/p\u003e\n\u003cp\u003eThe corners of her mouth tipped upward and she gave me a rare smile. “You’re a smart girl, Ella May, and I believe that one day you’ll grow up to do great things… I really hope you do.”\u003c/p\u003e\n\u003cp\u003eThe knots in my stomach began to unwind. I’d said the right thing and she was relaxed and happy, which had been my goal. I thought I’d made an impact on her, but it turned out I was wrong.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mom,” I whisper to her grave. “I really am… Sometimes I feel like I owe you my happiness.”\u003c/p\u003e\n\u003cp\u003eThe wind rustles around me, whispering through my hair. I sit down in front of the tombstone and sit with her grave in silence, promising myself I’ll come back and visit often, vowing she won’t be forgotten.\u003c/p\u003e\n\u003cp\u003eI don’t see Micha for the rest of the night. I sleep in the same room with Lila and then sneak out of the house before Micha wakes up from his drunken stupor. I’m not really mad at him anymore for drinking. What he said was true. We all do it to hide our pain and we all need to stop. But his harsh words still haunt me.\u003c/p\u003e\n\u003cp\u003eLila and I go out to my garage and I start up my dad’s Firebird so we can go get some lunch. My dad keeps a spare key under the visor, but the car’s been sitting for so long that it takes forever to start. Finally I get the engine to roar to life and then let it run for a while as I tromp through the snow looking for a way to get into the house.\u003c/p\u003e\n\u003cp\u003eLila follows me, zipping up her coat, and then she slips on her gloves. “It is so cold here.”\u003c/p\u003e\n\u003cp\u003e“I know.” I peer up at the frosted window of the kitchen, noticing that it’s not completely shut. “Well, I think I found our way in, although it’s going to be equally as cold in there since the damn window’s probably been open for months.”\u003c/p\u003e\n\u003cp\u003eI step back from the window and my phone beeps from inside my pocket, alerting me that I have a text message.\u003c/p\u003e\n\u003cp\u003eBlake: Whatcha doin?\u003c/p\u003e\n\u003cp\u003eI hesitate then text back.\u003c/p\u003e\n\u003cp\u003eMe: Trying to break into my house.\u003c/p\u003e\n\u003cp\u003eBlake: Sounds fun.\u003c/p\u003e\n\u003cp\u003eMe: Not really.\u003c/p\u003e\n\u003cp\u003eBlake: I’m just kidding. So what else are you doing? Anything fun? I was thinking of bailing out on my dad a few days early and going back to the campus. When are you going back? Maybe we cold meet up and get some coffee or something.\u003c/p\u003e\n\u003cp\u003e“Who is it?” Lila peers over my shoulder at the screen and her nose scrunches. “Oh my God, is he seriously texting you?”\u003c/p\u003e\n\u003cp\u003eI sigh, locking the screen so it shuts off. “I told him he could.”\u003c/p\u003e\n\u003cp\u003eLila tsks me with a wave of her finger. “El, I’m warning you now to back off this supposed friendship with that guy. You’re only going to end up in a mess.”\u003c/p\u003e\n\u003cp\u003e“It is just a friendship.” I move away from the window and toward the car. “And besides, you encouraged it once so you could get a ride from him.”\u003c/p\u003e\n\u003cp\u003e“And I regret it.” She follows after me, slipping on the ice a few times. “I saw him talking to you at the gas station and there was nothing but lust in his eyes… and now he doesn’t even have a girlfriend so there’s nothing stopping him.”\u003c/p\u003e\n\u003cp\u003e“You know, I’m regretting telling you that,” I say. “And it doesn’t matter anyway. Even if he did like me I would never do anything with him.”\u003c/p\u003e\n\u003cp\u003eShe grabs my arm and forces me to look at her. “Walk away from this right now. Blake is hot and you two have that whole art thing going on. You may not think anything could happen, but sometimes stuff just does. Trust me.”\u003c/p\u003e\n\u003cp\u003e“Are you speaking from experience?” I ask as my phone beeps with another text message.\u003c/p\u003e\n\u003cp\u003eBlake: I didn’t scare u off, did I… look, I know you have a boyfriend, so I’m not proposing a date. Just going to get coffee as two fellow artists who love coffee.\u003c/p\u003e\n\u003cp\u003e“I’ve had plenty of experiences with this crap,” Lila continues, letting go of my arm. “I’ve had many guys accidently get caught up in the moment and slip up. And I know plenty of girls who have done it too. And you’re so lucky, Ella. You really are. Please, for the sake of all women, just get away from Blake and focus on the beautiful relationship you have in front of you.”\u003c/p\u003e\n\u003cp\u003e“After what happened yesterday, you still think it’s beautiful?” I ask doubtfully.\u003c/p\u003e\n\u003cp\u003e“You two fighting makes it more beautiful.” She sighs and her breath fogs out. “I also know that right now you’re mad and the last thing you want to be doing is texting some guy who has a crush on you. You might do something stupid.”\u003c/p\u003e\n\u003cp\u003e“I’m not mad at Micha. Just upset with… stuff.”\u003c/p\u003e\n\u003cp\u003e“Same difference.”\u003c/p\u003e\n\u003cp\u003eSighing, I text Blake back.\u003c/p\u003e\n\u003cp\u003eMe: I’m going to be here until the end of winter break. Maybe I’ll c u when I get back.\u003c/p\u003e\n\u003cp\u003eHe doesn’t respond and Lila and I get into the car with the heater blasting at our faces. I don’t really care whether Blake texts me back or not. He was a nice friend, but that was it. My thoughts revolve around a much bigger issue: when I face Micha and tell him it’s over.\u003c/p\u003e\n\u003cp\u003eMicha\u003c/p\u003e\n\u003cp\u003eSomething wet hits me in the face and I jump up with my fist raised in front of me.\u003c/p\u003e\n\u003cp\u003e“Settle the fuck down.” Ethan stands over me with a cup in his hand. “It’s just water.”\u003c/p\u003e\n\u003cp\u003eI wipe my face with the sleeve of my shirt. “What the fuck are you doing?”\u003c/p\u003e\n\u003cp\u003eHe sets the cup down on top of my dresser. “Well, you’ve been asleep for about fourteen hours and so I thought I’d make sure you were still alive.”\u003c/p\u003e\n\u003cp\u003eClutching my throbbing head, I check the time on the clock mounted on my wall beside the window. It’s early morning and snow flutters outside.\u003c/p\u003e\n\u003cp\u003e“What happened?” I swing my legs over the side of the bed, preparing to get up, but a bitter taste in my throat forces me to lie back down.\u003c/p\u003e\n\u003cp\u003e“Well, you drank practically all the alcohol in the house,” Ethan says, crossing his arms. “And then you ruined your relationship with almost everyone you know, besides me, but that’s because I don’t give a shit.”\u003c/p\u003e\n\u003cp\u003eI rake my hand through my hair and roll to my side. “What about Ella?”\u003c/p\u003e\n\u003cp\u003e“That one is probably the worst.” He messes with an alarm clock on my nightstand, rotating the nob on the back.\u003c/p\u003e\n\u003cp\u003eI turn back around. “Why? What’d I say?”\u003c/p\u003e\n\u003cp\u003eHe makes air quotes and says, “ ‘I’m sick of your fucking mind games and problems.’ ”\u003c/p\u003e\n\u003cp\u003eI drape my arm across my face as I shake my head. “God damn it. What was I thinking… God fucking damn it!” I punch the headboard and then wince when my knuckles pop.\u003c/p\u003e\n\u003cp\u003eHe props the clock up beside the lamp. “You were drunk, which was the reason the fight started. Ella doesn’t want you drinking so much anymore and I have to agree with her. Yes, we all drink, but it seems like you do it more as a coping mechanism than the rest of us. In fact, you’ve kind of been doing it a lot lately.”\u003c/p\u003e\n\u003cp\u003eI peer up at him from underneath my arm. “Dude, what the hell have you been reading? You sound like a psychiatrist.”\u003c/p\u003e\n\u003cp\u003eHe backs up toward the doorway with a grin on his face. “How to clean up your best friend’s drunken mistakes. Now, get your ass out of bed, so you can go patch things up with Ella before she runs away again.”\u003c/p\u003e\n\u003cp\u003eI kick the blanket off me and sway to the side as I get to my feet. “She ran off… She’s gone?”\u003c/p\u003e\n\u003cp\u003e“Calm down.” Ethan rolls his eyes. “After you yelled at her, she ran to the end of the street, but came back. She bunked up with Lila last night. I guess she doesn’t have a key to her own house, which is weird.”\u003c/p\u003e\n\u003cp\u003e“It’s not weird.” I signal at him to get out as I grab a pair of clean jeans from my dresser drawer. “Her dad and brother are assholes.”\u003c/p\u003e\n\u003cp\u003eGiving an agreeing nod, he leaves the room and shuts the door. My stomach aches and my head feels like it’s going to explode, but most of the pain lies in my heart.\u003c/p\u003e\n\u003cp\u003eI was the only one in Ella’s life who’d never done anything to intentionally hurt her, but now I’m not.\u003c/p\u003e\n\u003cp\u003e“She’s not answering her phone,” I mutter, pacing the living room floor. The carpet is old and brown and has holes in it, and the walls are this icky shade of green that resembles puke. “What if she’s run off again?”\u003c/p\u003e\n\u003cp\u003e“Dude, settle down.” Ethan peels open a cheese stick and sinks back into the leather sofa that’s missing an arm. “I texted Lila and she says they’re just out getting some lunch.”\u003c/p\u003e\n\u003cp\u003eRubbing my forehead, I plop down into the recliner and kick an empty soda bottle out of the way so I can put my feet up on the table. “God, why is our relationship always so up and down?”\u003c/p\u003e\n\u003cp\u003eEthan peels at the string cheese and rolls his eyes. “Because you both have problems, yet you won’t talk to each other about them because you want to spare one another the pain.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forever-of-ella-and-micha-the-secret-2/page-33.html","bookId":1970,"creation":"Oct 5, 2019 10:19:39 AM","modification":"Oct 5, 2019 10:19:39 AM"}
