{"id":95072,"no":10,"title":"Page 10","content":"\u003cp\u003eWhen would she ever learn? Every time she thought she\u0027d found Prince Charming, he turned out to be a frog!\u003c/p\u003e\n\u003cp\u003eShe wouldn\u0027t cry. She refused to cry. After all, she hardly knew the man. Heck, she didn\u0027t even know his last name. Didn\u0027t know if his parents were living, if he had brothers and sisters, or how old he was.\u003c/p\u003e\n\u003cp\u003eShe kicked the corner of a picket fence. How long could it take to get over a man she had only known for a few days?\u003c/p\u003e\n\u003cp\u003eA lifetime, she thought, remembering how tenderly he had made love to her. It would take a lifetime to forget a man like Micah.\u003c/p\u003e\n\u003cp\u003eSuddenly cold, she wrapped her arms around herself and then, with a sigh, she turned around and went home.\u003c/p\u003e\n\u003cp\u003eMicah met her at the door. \"Lainey...\"\u003c/p\u003e\n\u003cp\u003eShe swept past him, relieved to see he had pulled on his laundered jeans and T-shirt in her absence.\u003c/p\u003e\n\u003cp\u003e\"Lainey, forgive me. I didn\u0027t mean to hurt you.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t say anything, only gazed down at her through those amazing silver-blue eyes that seemed able to probe the furthest reaches of her soul.\u003c/p\u003e\n\u003cp\u003e\"Okay, so you hurt me. I\u0027ll get over it.\"\u003c/p\u003e\n\u003cp\u003e\"Will you?\"\u003c/p\u003e\n\u003cp\u003eShe lifted her chin defiantly. \"Of course I will.\"\u003c/p\u003e\n\u003cp\u003e\"But I will never get over you, Lainey St. John,\" he replied softly, sadly. \"No matter how long I live, no matter where I go, your goodness will always be a part of me.\"\u003c/p\u003e\n\u003cp\u003eHis words, filled with sincere feeling and regret, melted the wall of ice around her heart.\u003c/p\u003e\n\u003cp\u003e\"Micah, please don\u0027t go. Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Lainey, come and sit down.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t want to hear this, she thought as she crossed the room and sat down on the sofa.Whatever it is, I don\u0027t want to hear it .\u003c/p\u003e\n\u003cp\u003eMicah paced the floor for a moment, one hand pressed against his wounded side. And then, against his better judgment, he knelt in front of her, determined to tell her the truth before he left.\u003c/p\u003e\n\u003cp\u003e\"Lainey, there\u0027s something I have to tell you.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She shook her head, knowing that whatever he said was going to alter her life forever.\u003c/p\u003e\n\u003cp\u003e\"Please, just listen. I\u0027m not who you think I am,what you think I am.\"\u003c/p\u003e\n\u003cp\u003e\"Youare married!\" she exclaimed. \"I knew it!\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He started to reach for her hand, then thought better of it. \"Lainey, those men weren\u0027t looking for me because I\u0027m some kind of fugitive from your law. They\u0027re looking for me because I\u0027m not from your world.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Next thing I know, you\u0027ll be telling me you can\u0027t stay because your flying saucer is ready to blast off to explore a galaxy far, far away.\"\u003c/p\u003e\n\u003cp\u003e\"Lainey, it\u0027s the truth. Xanthia isn\u0027t a country. It\u0027s a planet located at the edge of the Milky Way. My spaceship crashed in the woods behind that old house where we met.\"\u003c/p\u003e\n\u003cp\u003eExasperated, she shook her head. \"If this is your way of letting me down easy, I don\u0027t find it very amusing.\"\u003c/p\u003e\n\u003cp\u003e\"Lainey, look at me. Who do I look like?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Who do I look like?\"\u003c/p\u003e\n\u003cp\u003e\"Except for your eyes, you look a lot like my favorite romance cover hunk. So what?\"\u003c/p\u003e\n\u003cp\u003e\"Do you know why?\"\u003c/p\u003e\n\u003cp\u003eLainey frowned. \"Heredity, I would imagine.\"\u003c/p\u003e\n\u003cp\u003e\"No. I look like this man because I knew he wouldn\u0027t frighten you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"When you came into the upper room in the mansion, I probed your mind for a male image that you found pleasing, one that you found attractive.\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"No...\" It was too outrageous, too incredible. She didn\u0027t believe in aliens or flying saucers any more than she believed in Santa Claus or the Easter Bunny. \"It can\u0027t be true.\"\u003c/p\u003e\n\u003cp\u003e\"I can prove it.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t ask how. She knew how. Images of space monsters flashed through her mind - the bizarre beings in the cantina scene fromStar Wars , the gill-man inThe Creature From the Black Lagoon , the hideous reptilian creature inAlien , the hulking monster fromThe Thing . Oh, Lord, what kind of hideous beast had she made love to?\u003c/p\u003e\n\u003cp\u003e\"Lainey?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, ashamed of her cowardice. \"I don\u0027t want to know.\"\u003c/p\u003e\n\u003cp\u003eA rueful smile touched his lips. \"I\u0027m considered quite handsome by those who know me.\"\u003c/p\u003e\n\u003cp\u003e\"Beauty is in the eye of the beholder,\" she retorted. \"If you feel the need to go on with this farce, just show me your spaceship and I\u0027ll believe you.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt if it\u0027s a good idea to go back there just now.\"\u003c/p\u003e\n\u003cp\u003eLainey nodded. He was right, of course. No doubt the police and the people from SETI were still searching the area.\u003c/p\u003e\n\u003cp\u003eSETI... outer space... images of the blue glow she\u0027d seen in the bathroom and the odd color of Micah\u0027s blood rose up in her mind. Merciful heavens, what if he was telling her the truth? But that was impossible. There were no such things as flying saucers. There had to be another explanation. A logical explanation.\u003c/p\u003e\n\u003cp\u003eMicah leaned forward. \"Where\u0027s the black box I gave you?\"\u003c/p\u003e\n\u003cp\u003e\"In the kitchen.\"\u003c/p\u003e\n\u003cp\u003e\"Get it.\"\u003c/p\u003e\n\u003cp\u003eMuttering under her breath, Lainey did as he asked. Returning to the living room, she handed it to him.\u003c/p\u003e\n\u003cp\u003e\"All right,\" she said, resuming her place on the sofa, \"I\u0027ll bite. What is that thing?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an intergalactic transmitter. A radio.\"\u003c/p\u003e\n\u003cp\u003eShe looked skeptical. \"It doesn\u0027t look like any radio I\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003eHis gaze held hers. \"Exactly.\"\u003c/p\u003e\n\u003cp\u003eHe tapped what sounded like some sort of code onto the top of the box with his fingertip and the lid popped open. Lainey leaned forward. There was a keypad labeled with foreign symbols of some kind, and several small, square chips that looked like the innards of her computer.\u003c/p\u003e\n\u003cp\u003eMicah frowned. \"I\u0027d hoped to have it working by now.\"\u003c/p\u003e\n\u003cp\u003e\"Hard to find spare parts this far from home, I guess,\" Lainey muttered sarcastically.\u003c/p\u003e\n\u003cp\u003eMicah nodded absently, his attention momentarily focused on the transmitter. Thus far, he hadn\u0027t activated the distress signal. Slight as it was, there was always a chance that a tracking station here on earth might pick up the signal, and he had no wish to alert the earthlings to his presence, or risk putting Pergith and his craft in danger. If he could only get the transmitter working, he could advise Pergith of his whereabouts and arrange a rendezvous. There was always a chance someone on earth might pick up his transmission, but with luck, he would be on his way back home before any of earth\u0027s tracking devices could pinpoint his location.\u003c/p\u003e\n\u003cp\u003e\"So,\" Lainey asked, \"what are you going to do?\"\u003c/p\u003e\n\u003cp\u003eMicah shrugged. \"I might be able to salvage what I need from the wreckage of my ship.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you said you couldn\u0027t go there.\"\u003c/p\u003e\n\u003cp\u003e\"Not now. But your people are bound to give up sooner or later.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003eMicah closed the box and slid it under the sofa. \"I don\u0027t want to leave you,\" he murmured fervently. \"But I can\u0027t stay. And I can\u0027t take you with me.\"\u003c/p\u003e\n\u003cp\u003eSuddenly, it was all too much. She needed to be alone, to think, to try and make sense out of something that was totally incomprehensible.\u003c/p\u003e\n\u003cp\u003eAbruptly, she stood up. \"I think I need another walk,\" she said, and rushed out of the room before he could stop her.\u003c/p\u003e\n\u003cp\u003eIt was warm outside. The sky was clear and blue; the sun was shining. The people she passed on the street looked ordinary.\u003c/p\u003e\n\u003cp\u003eOuter space. He said he was from outer space. Why would he concoct such an outlandish story if it wasn\u0027t true? Unless he was just crazy. But he didn\u0027t act crazy.\u003c/p\u003e\n\u003cp\u003eMaybe she was. She thought of the strange blue aura around the figure in the photograph, then shook her head. Probably just a glitch in the developing. And the brown blood? Try as she might, she couldn\u0027t explain that away, or blame it on a roll of faulty film.\u003c/p\u003e\n\u003cp\u003eIncreasing her stride, she headed for the library.\u003c/p\u003e\n\u003cp\u003eShe was surprised by the number of books that had been written about UFO sightings. She picked several at random, found an unoccupied table, and started to read.\u003c/p\u003e\n\u003cp\u003eFacts and figures jumped out at her. Since World War II, tens of thousands of reports of UFOs had been gathered by the Air Force and other government and civilian investigative organizations around the world.\u003c/p\u003e\n\u003cp\u003eReports came from ordinary people in small towns, from astronauts like Borman and McDivitt, to police officers like Lonnie Zamora who claimed to have seen a UFO inSocorro,New Mexico , in 1964.\u003c/p\u003e\n\u003cp\u003eNinety percent of all sightings were proven to be misidentifications of airplanes or stars or other natural or artificial objects, but the other ten percent couldn\u0027t be rationally explained away.\u003c/p\u003e\n\u003cp\u003eSightings had been reported as far back as 1896.\u003c/p\u003e\n\u003cp\u003eIn 1975, a man inNew York claimed to have seen ten or eleven aliens emerge from a spaceship. He said they were only three-and-a-half to four feet tall and clad in identical hooded, one-piece, light-colored garments. He went on to say they had dug around in the ground, poured some earth in their bags, and returned to the spaceship.\u003c/p\u003e\n\u003cp\u003eAnother man who claimed to have been abducted described the room he had been examined in as a big, circular, flattened-out oval. He said there was no sound in the room, and the table they examined him on seemed to grow out of the floor.\u003c/p\u003e\n\u003cp\u003eThere were numerous descriptions of what aliens looked like; some people had described them as tall and skeleton-thin, with enormous heads and sunken eyes; others claimed the creatures were only three or four feet tall, shapeless, with no necks.\u003c/p\u003e\n\u003cp\u003eAnother described the alien he had seen as being \"kinda flat\" with broad shoulders, a thin neck, and arms much longer than a human\u0027s, with long, bony fingers. Three fingers. And a large thumb. The head was described as egg-shaped, with sharp cheeks, a small mouth that didn\u0027t open, eyes like a cat\u0027s, very tiny ears, and no hair.\u003c/p\u003e\n\u003cp\u003eStill another description, perhaps the most frightening of all, characterized the alien as having leathery, amphibian-type skin that was greenish-yellow and wrinkly.\u003c/p\u003e\n\u003cp\u003eOne of the books contained drawings depicting beings with thin bodies and large heads. The creatures had no hair, no visible ears, large, almond-shaped eyes, and thin lips.\u003c/p\u003e\n\u003cp\u003eLainey stared at the drawings of the supposed space aliens. Was that how Micah really looked? Was he some nightmarish creature with a huge hairless head and a skeletal body? The thought made her shudder.\u003c/p\u003e\n\u003cp\u003eSo many conflicting descriptions, Lainey mused. Maybe there were alien beings from dozens of planets zooming in and out of earth\u0027s atmosphere, doing their little tests, taking samples of dirt from the earth, blood from the people...\u003c/p\u003e\n\u003cp\u003eFor a moment, she cradled her head in her hands and closed her eyes. It was too awful, too bizarre, to be true.\u003c/p\u003e\n\u003cp\u003eAfter a few moments\u0027 rest, Lainey turned to the back of the book. There were organizations you could call if you thought you\u0027d seen a UFO - the Center for UFO Studies in Chicago, Illinois; the Mutual UFO Network in Seguin, Texas; and the National Investigations Committee on UFOs in California.\u003c/p\u003e\n\u003cp\u003eThere were thousands of people who claimed to have been abducted by aliens and taken aboard flying saucers. Some said they had been examined, poked and prodded with needles; some said samples of their blood and skin had been taken. There were photos of scars supposedly left by these barbaric examinations.\u003c/p\u003e\n\u003cp\u003eThe last book mentioned that there were four kinds of encounters with aliens. The first kind was the sighting of a saucer; the second kind involved visual evidence or impressions made by a spacecraft, like burned areas or irradiated soil, grass, or trees; the third kind, the kind Spielberg had made his movie about, were those in which the person involved actually observed or confronted an alien. The fourth kind were encounters where people claimed to have been abducted.\u003c/p\u003e\n\u003cp\u003eLainey sat back in her chair.Well, what do you know , she thought, dazed,I\u0027ve been having my very own close encounter of the third kind. Very close , she amended, remembering that they had made love only a few hours before.\u003c/p\u003e\n\u003cp\u003eFrom out of nowhere came the memory of the episode ofSoap where Burt\u0027s wife, Mary, gave birth to an alien baby. For the first time in her life, Lainey was glad she couldn\u0027t have children.\u003c/p\u003e\n\u003cp\u003eShe stared, unseeing, at the books spread across the table. She would have dismissed it all as nonsense except for one thing: almost all those who had encountered aliens mentioned that the space creatures communicated telepathically, the way Micah had communicated with her.\u003c/p\u003e\n\u003cp\u003eHead spinning from all she\u0027d read, Lainey returned the books to the shelves and left the library.\u003c/p\u003e\n\u003cp\u003eShe was surprised to find that it was dark outside.\u003c/p\u003e\n\u003cp\u003eShe stood on the steps for a moment, her fear of the dark suddenly making itself known as she gazed up and down the deserted street. She wished Micah was there beside her, and then laughed. A lot of help he\u0027d be if a UFO decided to carry her away.\u003c/p\u003e\n\u003cp\u003eShaking off her fears, she started walking home.\u003c/p\u003e\n\u003cp\u003eMicah wandered through Lainey\u0027s house. Behavioral scientists on Xanthia had been studying earthlings for centuries, marking their progress, the advance of their civilization. He wished now that he had spent more time learning about Lainey\u0027s world, but in his wildest dreams, he had never imagined that he would find himself stranded on Earth.\u003c/p\u003e\n\u003cp\u003eIt took him only moments to figure out how to turn on the television, the stereo, the microwave. All were primitive by his standards, primitive but fascinating.\u003c/p\u003e\n\u003cp\u003eHe thumbed through her books - romances and mysteries, the plays of Shakespeare, the poetry of William Blake, histories of the Old West, books on other cultures and peoples, on Eastern philosophy, maps and dictionaries, a thesaurus, a book on computers.\u003c/p\u003e\n\u003cp\u003eHe stopped to smell the flowers that bloomed in the colorful clay pots on her windowsill, touched the leaves of the green plants that were scattered throughout the house. He tasted her toothpaste, ran his hand over the pale pink nightgown that hung on the back of her bedroom door.\u003c/p\u003e\n\u003cp\u003eClosing his eyes, he sprayed her perfume on the back of his hand and inhaled deeply. The scent, so much a part or her, only increased his longing for her.\u003c/p\u003e\n\u003cp\u003eHe was conscious of time passing as he moved through her house on a journey of discovery. She liked flowers and plants.\u003c/p\u003e\n\u003cp\u003eThere were a variety of odd-looking stuffed creatures on the foot of her bed. She collected unicorns. Pink appeared to be her favorite color. He thumbed through her collection of compact discs. The names of the artists were unfamiliar, of course, and he picked one at random.\u003c/p\u003e\n\u003cp\u003e\"Yanni.\" He read the name aloud as he slipped the disc into the player and turned it on.\u003c/p\u003e\n\u003cp\u003eHe liked the music immediately. It was beautiful, haunting, filled with passion, reminding him of a popular musician on Xanthia.\u003c/p\u003e\n\u003cp\u003eGoing into the kitchen, he opened the refrigerator. The food on earth was vastly different from that of Xanthia, different but not unpleasant. He liked milk and cheese, apples, potato chips, Milky Way candy bars, chocolate chip cookies.\u003c/p\u003e\n\u003cp\u003eThe water on earth tasted far different from that at home; the air was thicker, harder for him to breathe, and it reacted oddly against his skin, causing a faint blue glow.\u003c/p\u003e\n\u003cp\u003eHe looked out the window, checking the time. She\u0027d been gone for two hours by Earth\u0027s reckoning. He wondered fleetingly if she had left for good, and then dismissed the idea. This was her home, after all.\u003c/p\u003e\n\u003cp\u003eHe never should have told her who he was, he thought, but he hadn\u0027t been able to bear the thought of hurting her, of letting her think that she wasn\u0027t important to him, that he didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eStanding there, staring out the window, it occurred to him that she might have betrayed his whereabouts to the men who were searching for him. The thought gave him pause, and then he dismissed it. He would never believe that. Never.\u003c/p\u003e\n\u003cp\u003eHe went into the living room again and sat down. Bored, he picked up a newspaper and began to read, wondering when the people of earth would learn to stop killing each other and turn their time and energy to more productive endeavors, wondering if they\u0027d put an end to the pollution that was killing their planet and fouling their oceans before it killed them.\u003c/p\u003e\n\u003cp\u003eWhere was Lainey?\u003c/p\u003e\n\u003cp\u003eHe threw the newspaper on the floor and went to the window. It was dark out now, dark and cold. Closing his eyes, he let his mind search for her.\u003c/p\u003e\n\u003cp\u003eShe was on her way home.\u003c/p\u003e\n\u003cp\u003eWalking rapidly.\u003c/p\u003e\n\u003cp\u003eShivering against the wind.\u003c/p\u003e\n\u003cp\u003eShe was hungry. And tired. And confused.\u003c/p\u003e\n\u003cp\u003eMicah let out a sigh of relief. She was coming home. He peered into the darkness, wondering if he should leave before she arrived, wondering if she had stayed away so long in the hope that he would he gone by the time she returned.\u003c/p\u003e\n\u003cp\u003eAnd perhaps that would be best. It might be easier to just go, to exit her life before his presence disrupted her existence any more than it already had.\u003c/p\u003e\n\u003cp\u003eBut even as he considered leaving, he knew he couldn\u0027t go without seeing her just one more time.\u003c/p\u003e\n\u003cp\u003eDanger!\u003c/p\u003e\n\u003cp\u003eThe warning jolted through him like an electrical charge.\u003c/p\u003e\n\u003cp\u003eLainey was in danger. \u003c/p\u003e","sourceLink":"https://allnovel.net/sunlight-moonlight/page-10.html","bookId":2306,"creation":"Oct 5, 2019 6:12:52 PM","modification":"Oct 5, 2019 6:12:52 PM"}
