{"id":95077,"no":15,"title":"Page 15","content":"\u003cp\u003eShe awoke to find Micah gazing down at her, his silver-blue eyes filled with sadness.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Lainey asked. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" Micah forced himself to smile. \"Why?\"\u003c/p\u003e\n\u003cp\u003eLainey shook her head. Maybe she was just imagining things. \"Are you hungry?\"\u003c/p\u003e\n\u003cp\u003eHeat simmered in the depths of his eyes as his gaze moved over her, slowly, suggestively. \"Very.\"\u003c/p\u003e\n\u003cp\u003e\"Men,\" Lainey muttered in mock disgust. \"Don\u0027t you ever think of anything else?\"\u003c/p\u003e\n\u003cp\u003eMicah took her hand in his, his thumb making lazy circles on her palm. \"I never thought of it at all until I met you.\"\u003c/p\u003e\n\u003cp\u003eShe was melting, she thought, dissolving from the inside out.\u003c/p\u003e\n\u003cp\u003e\"Lainey...\" He brought her hand to his lips and kissed each knuckle, then turned her hand over and kissed the pulse point on her wrist. How was he ever going to leave her? How could he go back home, back to the loneliness of his old way of life, now that he had known Lainey St. John? How could he leave her, now that he knew what it was like to love, to be loved, to be a part of someone else\u0027s life?\u003c/p\u003e\n\u003cp\u003eHe drew her into his arms, crushing her close. How could he even think of a life without her? His former life seemed empty and without meaning as he recalled the years he had spent in space, exploring other worlds, gathering samples of dirt, of plant and animal life. There had been times when he had gone for months without seeing another living soul. Until now, he\u0027d always been happy with his lifestyle, content to be alone, satisfied with his work. Only now did he realize he\u0027d been lying to himself, that his life had been empty, that he\u0027d been content to be alone because he himself had been empty.\u003c/p\u003e\n\u003cp\u003e\"Micah?\"\u003c/p\u003e\n\u003cp\u003e\"Hmm?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Micah, don\u0027t lie to me. I may not be able to read your thoughts right now, but I can sense that something\u0027s bothering you.\"\u003c/p\u003e\n\u003cp\u003eHis arms tightened around her, as if he would never let go.\u003c/p\u003e\n\u003cp\u003e\"Please, Micah, you\u0027re scaring me.\"\u003c/p\u003e\n\u003cp\u003e\"I love you, Lainey. You believe that, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s because I love you that I\u0027ve got to go.\"\u003c/p\u003e\n\u003cp\u003eA cold hand squeezed the warmth from her heart. \"Go where?\"\u003c/p\u003e\n\u003cp\u003e\"Back home.\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Lainey, don\u0027t you understand? As long as I\u0027m here, you\u0027ll be in danger.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care.\"\u003c/p\u003e\n\u003cp\u003e\"I care.\"\u003c/p\u003e\n\u003cp\u003e\"But no one knows where we are. Please, don\u0027t go.\"\u003c/p\u003e\n\u003cp\u003eHe stroked her hair gently. He could feel the wetness of her tears on his chest, feel her shoulders shake with the force of her silent weeping.\u003c/p\u003e\n\u003cp\u003e\"Lainey, I don\u0027t want to hurt you.\"\u003c/p\u003e\n\u003cp\u003e\"Then don\u0027t go!\" She leaned back so she could see his face. \"I was so alone until you came. My life was so empty. There were days when I never left the house, when I buried myself in my writing because what was happening in my story was so much more exciting than reality.\"\u003c/p\u003e\n\u003cp\u003e\"Lainey...\" He drew her into his arms again, his face buried in her hair. \"I know,cominza ,\" he murmured. \"I know.\"\u003c/p\u003e\n\u003cp\u003e\"If you know, then how can you even think of leaving?\"\u003c/p\u003e\n\u003cp\u003e\"Because I love you. Those men who had me, they won\u0027t stop looking. I wasn\u0027t the first Xanthian they\u0027d captured, Lainey. There was a Xanthian skeleton in their laboratory. They\u0027re conducting the kind of experiments you once accused my people of doing.\"\u003c/p\u003e\n\u003cp\u003eAnd that was another reason he had to go back, he thought bleakly. He had to warn his people that the people of Earth knew of their existence.\u003c/p\u003e\n\u003cp\u003e\"Is there nothing I can say to make you stay?\"\u003c/p\u003e\n\u003cp\u003e\"I must go.\" He put his forefinger under her chin and tilted her head up. \"But I\u0027ll come back if I can, Lainey. I promise.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have to contact your people right away?\"\u003c/p\u003e\n\u003cp\u003eMicah shook his head. He had planned to stay another day or two. He knew now that it would take at least that long just to say good-bye.\u003c/p\u003e\n\u003cp\u003eLater that afternoon they went for a walk. Hand in hand, they climbed a narrow, winding path that led through a forest of tall trees, their footsteps muffled by a thick bed of pine needles.\u003c/p\u003e\n\u003cp\u003eIt was beautiful, Micah thought. The sky was a clear, bright blue, so different from the sky at home. Colorful birds flitted from tree to tree, filling the air with their cheerful melodies. Lainey pointed out chipmunks and squirrels, told him the names of the different kinds of birds. They paused to watch a deer grazing on a patch of grass in a shady glen.\u003c/p\u003e\n\u003cp\u003eThey\u0027d been walking about an hour when they came to a small mountain meadow fragrant with clover and wildflowers.\u003c/p\u003e\n\u003cp\u003e\"Pretty, isn\u0027t it?\" Lainey asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. Almost as pretty as you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Micah...\" Blinking back a tear, she wrapped her arms around him and pressed her cheek against his chest. She\u0027d known him such a short time, and yet she couldn\u0027t imagine what her life would be like without him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t think of it now,\" he urged.\u003c/p\u003e\n\u003cp\u003eWith a nod, she sniffed back her tears. \"There\u0027s a small lake over there. Do you know how to swim?\"\u003c/p\u003e\n\u003cp\u003e\"Like a fish.\"\u003c/p\u003e\n\u003cp\u003eThe water was cold, but Lainey hardly noticed. Wrapped in Micah\u0027s arms, feeling his wet skin against her own, she was conscious of nothing else. She ran her hands over his shoulders and down his arms, reveling in the latent power she felt there. He kissed her cheeks, her neck, the curve of her breast, and heat suffused her, making her forget the cold water, making her forget everything but Micah.\u003c/p\u003e\n\u003cp\u003eShe let her gaze move over his face, memorizing each feature, let her fingertips trail across his chest. She smiled as she felt the hard evidence of his desire press against her belly, and then his hands were doing their own exploring, filling her with a bittersweet pain.\u003c/p\u003e\n\u003cp\u003eShe had never made love in the water before. It was a unique experience, slick flesh sliding against slick flesh, their bodies buoyant in the water. It was primal, the ancient, eternal mating of male and female, life renewing itself. Almost, it was like being reborn.\u003c/p\u003e\n\u003cp\u003eSpent, they stretched out on the grass, her head pillowed on his shoulder, and let the sun bake them dry.\u003c/p\u003e\n\u003cp\u003e\"The sunlight doesn\u0027t seem to bother you anymore,\" Lainey remarked.\u003c/p\u003e\n\u003cp\u003e\"I think I must be getting acclimated to Earth\u0027s environment,\" Micah replied.\u003c/p\u003e\n\u003cp\u003eHe lifted his arm and studied it a moment. The faint blue glow that had shadowed his skin had disappeared. Except for his ears, and the webbing on his hands, he looked much like any other human male.\u003c/p\u003e\n\u003cp\u003eHe picked up Lainey\u0027s hand and pressed his own against it, palm to palm, noting how similar they were, and how different.\u003c/p\u003e\n\u003cp\u003eLainey folded her fingers over his. \"You\u0027re the best thing that ever happened to me,\" she whispered.\u003c/p\u003e\n\u003cp\u003eShe placed his hand on her belly and covered it with her own, wishing she could bear a child, wishing she could feel Micah\u0027s seed growing within her womb.\u003c/p\u003e\n\u003cp\u003e\"I wish I could stay.\" He kissed her gently. \"I want to stay.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" She turned onto her side, her head propped on one hand while she traced figure eights on the broad expanse of his chest.\u003c/p\u003e\n\u003cp\u003eHis skin was firm beneath her fingertips, warm from the kiss of the sun. For a moment, she thought of destroying the transmitter, of smashing it into a million tiny pieces so he\u0027d never be able to contact his people, never be able to leave her, but even as she thought of it, she knew she would never do such a thing.\u003c/p\u003e\n\u003cp\u003eCouldn\u0027t do it. He was an honorable man.And a man\u0027s gotta do what a man\u0027s gotta do . She didn\u0027t know where she\u0027d heard that phrase, but she suddenly realized it was true. And on the heels of that bit of wisdom came the memory of a line she\u0027d heard in the movieParenthood . Women have choices, Steve Martin\u0027s character had said to his wife, men have responsibilities.\u003c/p\u003e\n\u003cp\u003eAt the time, the seemingly chauvinistic remark had made her want to throw up. Now she wanted to cry.\u003c/p\u003e\n\u003cp\u003eGiving herself a mental shake, Lainey forced the thought that Micah was leaving out of her mind, determined to enjoy whatever time they had left.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re very handsome, you know,\" she remarked, draping her arm across his waist. \"Are all the men on Xanthia as good-looking as you are?\"\u003c/p\u003e\n\u003cp\u003eMicah shrugged, inwardly pleased that she found him attractive. \"To quote one of your people, beauty is in the eye of the beholder. Our people are no different than yours. Some are more appealing than others. Some are tall, some short, some are thin, some are not.\"\u003c/p\u003e\n\u003cp\u003eHe lifted a lock of her hair and rubbed it between his thumb and forefinger. \"But none of us has hair so black as yours, or skin so fair.\" His fingertip grazed her cheek. \"No one has eyes so dark and lovely, or lips so soft.\"\u003c/p\u003e\n\u003cp\u003eHis lips trailed feather-light kisses over her eyes and nose and mouth. \"I will never forget you, Lainey St. John, nor will I ever join with another woman.\"\u003c/p\u003e\n\u003cp\u003eHis words touched her heart and imprinted themselves on her soul.\u003c/p\u003e\n\u003cp\u003e\"No, Micah...\" Lainey placed her hand over his mouth to stifle the protest she saw in his eyes. \"I want you to join withAdana ,\" she said, and meant it, though it killed her to say the words. \"I want you to be a father, to giveAdana the child you can\u0027t give me.\"\u003c/p\u003e\n\u003cp\u003eHe took her hand from his mouth. \"No!\" He looked at her in horror. \"How can you even suggest such a thing?\"\u003c/p\u003e\n\u003cp\u003e\"Because I can\u0027t give you a child, and I don\u0027t want you to miss out on the opportunity to be a father. You said you could see your child if you wanted to. Maybe you can change things where you come from, make your people realize what they\u0027re missing by cutting themselves off from their children. And if not, you\u0027ll still have a child, someone who\u0027ll be a part of you.\"\u003c/p\u003e\n\u003cp\u003e\"Lainey...\" He turned on his side so they were face to face.\u003c/p\u003e\n\u003cp\u003eUnable to find the words to express what he was feeling, he folded her into his arms and held her close, knowing he would never forget her, that he would never forget this day.\u003c/p\u003e\n\u003cp\u003eIt was near dusk when they made their way back to the cabin. Micah sat in the kitchen, watching while Lainey prepared dinner, and again found himself wondering how he could bring himself to leave her. It had been so easy to fall in love with her, so easy to adapt to her way of life. In spite of all the violence of her world, the pollution, the poverty, there was an excitement that was missing on Xanthia.\u003c/p\u003e\n\u003cp\u003eHe watched her peel a potato and realized he had never seen a woman prepare a meal until he came here. On Xanthia, he had always eaten in restaurants, where the cooking and the serving were done by androids.\u003c/p\u003e\n\u003cp\u003eSitting there, watching Lainey cook for him, appealed to some deep primal emotion he didn\u0027t quite understand. She hummed softly as she stood at the stove, and the sound of her voice wound around his heart, binding him to her in ways he didn\u0027t fully comprehend.\u003c/p\u003e\n\u003cp\u003eShe smiled at him as she set the table, a bittersweet smile that made it difficult to swallow. He wished suddenly that the transmitter had been destroyed in the crash so that he would truly be stranded here, so that he\u0027d have no choice but to stay, to spend his life here, with Lainey.\u003c/p\u003e\n\u003cp\u003eDinner was a quiet meal. Lainey ate automatically, hardly aware of what she was eating. Micah was leaving. That single thought overshadowed everything else.\u003c/p\u003e\n\u003cp\u003eWhen they were finished, Micah helped her clear the table, then wiped the dishes while she washed.\u003c/p\u003e\n\u003cp\u003eWhen the last pot had been scrubbed, she stood at the sink, watching the water go down the drain. She could hear Micah moving around behind her, the clink of silverware as he put it in the drawer. It was such an ordinary thing, doing the dishes together, something any married couple might do. Such an ordinary thing that it brought tears to her eyes.\u003c/p\u003e\n\u003cp\u003eMicah stood behind her, noting the slump of her shoulders. Without conscious thought, he probed her mind. She was crying silent tears, her heart filled with sadness and despair.\u003c/p\u003e\n\u003cp\u003eWhispering her name, he slipped his arms around her waist, drawing her back against him. Holding her close, he bent his head and pressed his lips to her hair.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t weep, Lainey,\" he murmured. \"Please don\u0027t weep.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help it.\"\u003c/p\u003e\n\u003cp\u003eHe took a deep breath. There was always a chance his people wouldn\u0027t make any more journeys to Earth. Three of the last five spacecraft that had been sent there hadn\u0027t returned. His ship would make four. Perhaps the rulers of Xanthia would realize it was no longer safe to venture into Earth\u0027s atmosphere. He\u0027d been here many weeks now. Surely Pergith would have given up any hope of finding him alive and gone home...\u003c/p\u003e\n\u003cp\u003eHe was making excuses, grabbing at any plausible reason that would absolve him of guilt, that would make it all right for him to stay. He knew it, but he couldn\u0027t seem to stop.\u003c/p\u003e\n\u003cp\u003eAnd he couldn\u0027t leave her. Maybe she was right. Maybe no one would find them here.\u003c/p\u003e\n\u003cp\u003eMicah let his breath out in a long sigh of defeat. Right or wrong, he couldn\u0027t leave Lainey, not now. He would stay as long as it seemed safe, as long as his being there didn\u0027t put her life in danger.\u003c/p\u003e\n\u003cp\u003e\"Lainey?\"\u003c/p\u003e\n\u003cp\u003eShe sniffed. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"If I stay, will you stop weeping?\"\u003c/p\u003e\n\u003cp\u003e\"Stay?\" She spun around in his arms, her luminous brown eyes searching his. \"Do you mean it?\"\u003c/p\u003e\n\u003cp\u003eMicah nodded. \"I\u0027ll stay as long as it seems safe.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Micah!\" Standing on tiptoe, she threw her arms around his neck and kissed him. And kissed him. And kissed him again.\u003c/p\u003e\n\u003cp\u003eAnd at that moment, he knew he had made the right decision. \u003c/p\u003e","sourceLink":"https://allnovel.net/sunlight-moonlight/page-15.html","bookId":2306,"creation":"Oct 5, 2019 6:12:52 PM","modification":"Oct 5, 2019 6:12:52 PM"}
