{"id":95099,"no":37,"title":"Page 37","content":"\u003cp\u003eTraveling by night, he made his way north, to the mountains. The countryside was everything Katlaina had said it was. Beautiful and green, lush with trees and grass and flowers.\u003c/p\u003e\n\u003cp\u003eHe walked down a narrow lane. Cottages lined the roadway, their windows dark at this time of night. The air was cool, fragrant with new-cut hay and the scent of damp earth. A dog barked asNavarre passed by, but he silenced the animal with a glance and moved on, drawn toward a small, vine-covered cottage at the end of the lane.\u003c/p\u003e\n\u003cp\u003eHe placed his hand on the narrow door, closed his eyes, and concentrated on the dwelling\u0027s inhabitants. And knew that this was where Katlaina lived.\u003c/p\u003e\n\u003cp\u003eHer scent drew him toward the back of the house. Peering through a small square window, he saw Katlaina. Clad in a long white sleeping gown, she sat in a rocking chair, singing a lullaby to the child cradled in her arms.\u003c/p\u003e\n\u003cp\u003eKatlaina. His voice whispered to her mind.Katlaina .\u003c/p\u003e\n\u003cp\u003eSlowly, she looked up, a frown drawing her brows together.\u003c/p\u003e\n\u003cp\u003eDo you ever think of me?\u003c/p\u003e\n\u003cp\u003e\"Navarre?\"\u003c/p\u003e\n\u003cp\u003eI have missed you.\u003c/p\u003e\n\u003cp\u003eRising, she placed the sleeping child in its bed, then stood in the middle of the room, her hands clasped to her breasts. \"Navarre, where are you?\"\u003c/p\u003e\n\u003cp\u003eI am nearby, waiting for you. Will you come to me?\u003c/p\u003e\n\u003cp\u003eHe saw the doubt reflected in her eyes, and it cut him to the heart.\u003c/p\u003e\n\u003cp\u003eI will not hurt you.\u003c/p\u003e\n\u003cp\u003eShe shook her head, and when she spoke, he heard tears in her voice. \"I cannot. I... I am afraid. Please go away.\"\u003c/p\u003e\n\u003cp\u003eI must see you. Come to me, Katlaina.\u003c/p\u003e\n\u003cp\u003eSlowly, she took a step toward the window.\u003c/p\u003e\n\u003cp\u003eShe was more beautiful than he remembered. Her hair fell over her shoulders like a waterfall of ebony-hued silk. Her skin was smooth and unblemished. She stared at him through eyes as green as new grass; eyes filled with the memory of the love they had once shared. Eyes filled with fear as she recalled their last meeting.\u003c/p\u003e\n\u003cp\u003eI will not hurt you. He stared at her, wanting her, unable to enter the house unless she bade him do so. Katlaina, please ...\u003c/p\u003e\n\u003cp\u003eHe saw the hesitation in her eyes as she opened the window, then took a wary step backward. \"Navarre...\"\u003c/p\u003e\n\u003cp\u003eIn a single fluid movement, he was over the sill. \"Katlaina, I have missed you. Longed for you...\"\u003c/p\u003e\n\u003cp\u003e\"You should not be here.\" Her gaze moved over him, wary and confused, hopeful and fearful.\u003c/p\u003e\n\u003cp\u003e\"Come away with me.\"\u003c/p\u003e\n\u003cp\u003e\"I cannot.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I... I have a husband.\" She placed a hand on her stomach. \"We are to have a child.\"\u003c/p\u003e\n\u003cp\u003eHe stared at her in disbelief, the hurt cutting deep into his heart and soul. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"I am sorry,Navarre . I thought never to see you again.\"\u003c/p\u003e\n\u003cp\u003e\"Do you love this man?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"As you once loved me?\"\u003c/p\u003e\n\u003cp\u003eKatlaina lowered her gaze, unable to bear the pain she saw in his eyes. And behind the pain, she saw death. It frightened her now as it had frightened her before. Unaware of what she was doing, she took a step backward, instinctively placing herself betweenNavarre and her son.\u003c/p\u003e\n\u003cp\u003eThe move was not lost onNavarre . His eyes narrowed with suppressed fury.\u003c/p\u003e\n\u003cp\u003e\"Do you think I would hurt my own flesh and blood, Katlaina? Do you fear for your own life, as well?\"\u003c/p\u003e\n\u003cp\u003eShe lifted her chin defiantly, but said nothing.\u003c/p\u003e\n\u003cp\u003e\"I want to see my son.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated, andNavarre clenched his fists, waiting. He could bend her mind to his, force her to let him see the child, but he wanted it to be her decision.\u003c/p\u003e\n\u003cp\u003e\"Very well,\" she murmured, and stood aside.\u003c/p\u003e\n\u003cp\u003eNavarrecrossed the room to stare down at his child. His son. The only son he would ever have. The boy was pink of cheek and fair of face. His hair was black and curly, like his mother\u0027s. He made a soft sound of contentment as he sucked his thumb.\u003c/p\u003e\n\u003cp\u003e\"He seems a fine boy,\"Navarre remarked.\u003c/p\u003e\n\u003cp\u003e\"He is.\"\u003c/p\u003e\n\u003cp\u003e\"What name did you give him?\"\u003c/p\u003e\n\u003cp\u003e\"Navarre.\" Her answer was barely audible.\u003c/p\u003e\n\u003cp\u003e\"Will you tell him of me, when he\u0027s older?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eHe looked up at her, the tender feelings he had experienced while looking at his son swallowed up in bitter fury as he imagined Katlaina in the arms of another man, bearing another man\u0027s child when she was his.\u003c/p\u003e\n\u003cp\u003eHis fangs pricked the inside of his lower lip; his hands curled into fists as he contemplated storming through the house, finding her husband, tearing him limb from limb. It would be so easy. So easy...\u003c/p\u003e\n\u003cp\u003eAs if she had read his thoughts, Katlaina stepped forward and grabbed him by the arm. \"Navarre, no!\"\u003c/p\u003e\n\u003cp\u003e\"You were meant to be mine,\" he said, his voice filled with anguish. \"I loved you. I still love you.\"\u003c/p\u003e\n\u003cp\u003e\"And I loved you,\" she whispered. \"But you are no longer the man I loved.\"\u003c/p\u003e\n\u003cp\u003e\"I am!\"\u003c/p\u003e\n\u003cp\u003e\"No. I do not know what happened to you in theTempleofShaylyn . I thought you had been killed, yet you came back to me. But the man I knew is dead, and the man before me looks at me through soulless eyes.\"\u003c/p\u003e\n\u003cp\u003eShe choked back a sob as she moved away from him. \"I wish I could still love you,Navarre . But I cannot. I cannot! Please, I beg of you, go away from this place and never return.\"\u003c/p\u003e\n\u003cp\u003e\"Katlaina...\"\u003c/p\u003e\n\u003cp\u003e\"Please,Navarre , for the sake of the love we once shared, for the child born of that love, I beg of you, go away.\"\u003c/p\u003e\n\u003cp\u003eLoneliness knifed through him, cutting his heart from his flesh, destroying whatever was left of his soul, until he felt as though he were lying naked upon Shaylyn\u0027s altar once again, his blood draining from his veins, leaving him cold and lifeless.\u003c/p\u003e\n\u003cp\u003e\"Katlaina...\" He held out his hand, silently begging for her to touch him, to make him whole again.\u003c/p\u003e\n\u003cp\u003eTears streamed down her cheeks. \"I\u0027m sorry,Navarre ,\" she whispered hoarsely. \"I wish I could help you. I wish I could go with you. But I cannot. I cannot...\"\u003c/p\u003e\n\u003cp\u003eShe stared at him, remembering how tenderly he had loved her. Aching for him, she took a step forward and wiped a tear from his cheek, then stared, in horrified confusion, at the blood-red drop on her finger.\u003c/p\u003e\n\u003cp\u003eShe looked up at him as he reached for her.\u003c/p\u003e\n\u003cp\u003e\"Kiss me, Katlaina,\" he begged, his voice hoarse. \"One last kiss.\"\u003c/p\u003e\n\u003cp\u003eShe could not refuse him, even though her heart pounded with fear and every instinct she possessed urged her to flee, to run before it was too late.\u003c/p\u003e\n\u003cp\u003e\"Please do not hurt me,\" she pleaded softly. \"My son... our son... needs a mother\u0027s care.\"\u003c/p\u003e\n\u003cp\u003eHe gazed down at her, the ache in his heart beyond pain. \"I will not hurt you,\" he promised. \"I ask only a kiss of farewell, one kiss, to warm me through eternity.\"\u003c/p\u003e\n\u003cp\u003eShe could not refuse him. His lips were cool against her own. Her eyelids fluttered down as he deepened the kiss, and she felt his loneliness, his need, the bitterness that welled within his soul.\u003c/p\u003e\n\u003cp\u003eIt was a kiss that branded her soul. And then, like a shadow running from the sun, he was gone, and she knew she would never see him again. \u003c/p\u003e","sourceLink":"https://allnovel.net/sunlight-moonlight/page-37.html","bookId":2306,"creation":"Oct 5, 2019 6:12:52 PM","modification":"Oct 5, 2019 6:12:52 PM"}
