{"id":95112,"no":50,"title":"Page 50","content":"\u003cp\u003eShaylyn walked downMorenoBay \u0027s narrow main street, heedless of the rain that soaked her skin and clothes.\u003c/p\u003e\n\u003cp\u003eHe had refused her. For a mortal! It was beyond comprehension. No man had ever refused her. No vampire, either. Except forNavarre . From the moment she had first seen him in theTemple on Mikos almost two thousand years ago, she had wanted him, wanted him so badly that she had bestowed the Dark Gift upon him. And that night, he had turned his back on her, preferring to go off on his own rather than accompany her on a voyage of discovery.\u003c/p\u003e\n\u003cp\u003eAnd because she was proud, too proud to admit she should have killed him as she had killed all the others, she had abandoned him to his fate, certain he would never survive on his own.\u003c/p\u003e\n\u003cp\u003eBut he had survived. Survived and grown strong.\u003c/p\u003e\n\u003cp\u003eShe recalled the months they had spent together eons ago. He had been everything she had desired in a companion, everything she needed in a lover. He could be strong. He could be tender. Sometimes he had been cruel, and she had gloried in it. In all of it. There had been times when she taunted him without mercy, purposely stirring his rage, delighting in his anger. Their joining, always satisfying, had often been violent, but never dull. He had only one shortcoming, and it was that one weakness that had ruined their relationship.\u003c/p\u003e\n\u003cp\u003eShaylyn crossed the street and kept walking, heading toward the beach, cursing Navarre\u0027s unfailing sympathy for the puny mortals who provided his sustenance. Shaylyn had no qualms about taking what she needed. She was a predator in thought and action. The blood of mortals fueled her existence, and she took it with a single-mindedness that left no room for compassion or pity. At times, she took them quickly and painlessly; at other times, she toyed with them, amused by their puny cries for mercy. Not so Navarre. He took only what he needed and left his victims happily alive and unaware of what he\u0027d done.\u003c/p\u003e\n\u003cp\u003eHands clenched, she walked along the beach, oblivious to the chill wind and the rain. Lightning flashed across the heavens, and still she walked, her thoughts turned inward. Navarre.\u003c/p\u003e\n\u003cp\u003eHis strength troubled her. How could one who drank so sparingly of the sustenance of life grow so strong? Pausing, she stared out at the roiling ocean. Had he grown strong enough to destroy her?\u003c/p\u003e\n\u003cp\u003eIn her time, she had vanquished dozens of vampires, some made by her own hand. She had killed them without a thought the very instant she began to suspect that their strength, or their cunning, might be a threat.\u003c/p\u003e\n\u003cp\u003ePerhaps it would be wise to destroy Navarre, as well.\u003c/p\u003e\n\u003cp\u003eCloaked from mortal eyes, Shaylyn entered the bookstore. For a time, she stood in the shadows, watching Navarre\u0027s mortal lover as she moved around the store, chatting with customers, opening boxes, placing books on the shelf.\u003c/p\u003e\n\u003cp\u003eDid Adrianna know where Navarre took his rest?\u003c/p\u003e\n\u003cp\u003eShaylyn glanced outside. It would be dusk soon. She had spent most of the day searching for Navarre\u0027s resting place. She had gone to Cliff House first, even though she had known he would not be there. The woman\u0027s house had seemed the next likely place, though Shaylyn hadn\u0027t expected to find him there, either, and, indeed, she hadn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe had spent hours exploring the town, poking into deserted beach houses, checking the cemetery, an abandoned warehouse, the cellar of an old church. All in vain. She had detected no sign of Navarre. Had he grown strong enough to cloak his presence from the one who had made him? If so, he was more dangerous than she had imagined.\u003c/p\u003e\n\u003cp\u003eShe waited until Adrianna closed the shop, then materialized in front of the woman\u0027s startled gaze.\u003c/p\u003e\n\u003cp\u003e\"Good evening, my dear,\" Shaylyn said, pleased by the very real fear she read in the girl\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"Wh-what do you want?\"\u003c/p\u003e\n\u003cp\u003e\"Want? What makes you think I want anything?\"\u003c/p\u003e\n\u003cp\u003eAdrianna took a step backward, intimidated by the fearful glow in the other woman\u0027s eyes, by the evil that radiated from her like smoke from a fire.\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t be afraid,\" Shaylyn said, backing Adrianna into a corner. \"I mean you no harm.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. You\u0027re Navarre\u0027s friend, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eAdrianna nodded.\u003c/p\u003e\n\u003cp\u003e\"Of course you are! You needn\u0027t worry. I just wanted to see him for a few days. Navarre and I are old friends. Very old friends.\"\u003c/p\u003e\n\u003cp\u003eAdrianna cowered against the wall, her gaze trapped in the web of Shaylyn\u0027s stare.\u003c/p\u003e\n\u003cp\u003e\"Nothing to be afraid of,\" Shaylyn purred as she took Adrianna\u0027s hand in hers. \"Such lovely hands,\" she mused, rolling up the sleeve of Adrianna\u0027s sweater. \"Such smooth skin. Nothing at all to be afraid of, my dear. We\u0027re going to be good friends, you and I.\"\u003c/p\u003e\n\u003cp\u003e\"Friends,\" Adrianna repeated.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Shaylyn said. \"Relax, Adrianna. It will be over in a moment, and you will remember nothing save that I came here to ask for your friendship.\"\u003c/p\u003e\n\u003cp\u003e\"My friendship.\" Adrianna felt a sharp prick as Shaylyn bent over the bend of her elbow.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, my dear. We\u0027re going to be good friends now, aren\u0027t we?\"\u003c/p\u003e\n\u003cp\u003eAdrianna blinked at the other woman, then shook her head. \"I\u0027m sorry, did you say something?\"\u003c/p\u003e\n\u003cp\u003e\"Only that I must be going. I\u0027m so glad we\u0027ve cleared things up between us. Give my love to Navarre when you see him.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I will.\"\u003c/p\u003e\n\u003cp\u003e\"And tell him I\u0027m sorry I didn\u0027t get a chance to see him again, but I\u0027ve decided to go to Paris. My plane leaves at seven.\"\u003c/p\u003e\n\u003cp\u003e\"Seven.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell him,\" Adrianna said, but she was talking to the air. The woman was already gone.\u003c/p\u003e\n\u003cp\u003e\"She said what?\"\u003c/p\u003e\n\u003cp\u003e\"She said to tell you she was going to Paris, and that she was sorry she didn\u0027t get a chance to say good-bye.\"\u003c/p\u003e\n\u003cp\u003eNavarre frowned. Could it possibly be true? Had Shaylyn really left town? It seemed unlikely, and yet... \"Did she say anything about coming back?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Adrianna smiled up at him. \"I missed you today.\"\u003c/p\u003e\n\u003cp\u003e\"I missed you, too.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to get a cup of coffee,\" she said, taking him by the hand and walking down the hallway toward the kitchen. \"Would you like a glass of wine?\"\u003c/p\u003e\n\u003cp\u003eNavarre nodded. Sitting down at the table, he watched Adrianna move about the tiny kitchen. After pouring him a glass of wine, she microwaved a cup of instant coffee, then sat down at the table across from him.\u003c/p\u003e\n\u003cp\u003e\"So,\" he said, his gaze intent upon her face, \"what did you do today?\"\u003c/p\u003e\n\u003cp\u003eAdrianna shrugged. \"Nothing much. It was slow for a Friday. Have you given any more thought to what we talked about the other night?\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"You mean my becoming human again?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh.\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m not sure it\u0027s something I want.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" She looked away, but not before he saw the hurt, the disappointment, in her eyes.\u003c/p\u003e\n\u003cp\u003e\"Annie...\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we\u0027d better stop seeing each other.\"\u003c/p\u003e\n\u003cp\u003e\"Annie!\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, annoyed by the tears that filled her eyes. \"I can\u0027t just be your lover, Navarre. I want something more out of a relationship than just...just sex.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Annie, we have more than that, and you know it.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" She looked up at him then, her eyes dark with tears. \"But I\u0027m going to grow old. What then? How will you feel when I start to look like your mother?\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"Annie, dammit, Annie, I...\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t stand that, Navarre. I\u0027d rather end it now.\"\u003c/p\u003e\n\u003cp\u003eNavarre stood up, his hands clenched at his sides. She was right, he thought bitterly. It was better to end it now, before she got hurt.\u003c/p\u003e\n\u003cp\u003e\"Good-bye, Adrianna,\" he said quietly.\u003c/p\u003e\n\u003cp\u003eShe stared after him, too numb to think, and then a voice echoed inside her mind, sharp and demanding. You little fool! Don\u0027t let him go. Tell him you love him, that you want to be like him. Ask him to show you where he sleeps. Tell him you want the Dark Gift so that you can be his forever .\u003c/p\u003e\n\u003cp\u003eHis hand was at the front door, reaching for the latch, when he heard Adriana\u0027s voice calling his name.\u003c/p\u003e\n\u003cp\u003e\"Navarre! Navarre! Wait, don\u0027t go!\"\u003c/p\u003e\n\u003cp\u003eHe turned around, opening his arms to catch her as she flew down the hallway toward him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t leave me!\" she cried. \"I didn\u0027t mean it!\"\u003c/p\u003e\n\u003cp\u003e\"Annie!\" His arms closed around her, holding her tight, pressing her against him so that their bodies touched from shoulder to thigh.\u003c/p\u003e\n\u003cp\u003e\"We can work it out,\" she said. She lifted her face to his, her eyes awash with tears. \"Make me what you are,\" she whispered. \"I want to be with you, only you, forever.\"\u003c/p\u003e\n\u003cp\u003e\"Annie, no.\"\u003c/p\u003e\n\u003cp\u003e\"Yes! Please, Navarre, do it now!\"\u003c/p\u003e\n\u003cp\u003eEyes narrowed, he stared down at her, his mind probing hers, but he detected no sign that she had been initiated. And still he hesitated. He would be a fool to underestimate Shaylyn.\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\" he asked. \"Do you mean it?\"\u003c/p\u003e\n\u003cp\u003eHer reply was quick and certain. \"I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003eFrowning, Navarre brushed her hair aside, his gaze skimming her throat. No puncture marks marred the perfection of her skin.\u003c/p\u003e\n\u003cp\u003e\"Please, Navarre?\"\u003c/p\u003e\n\u003cp\u003eIt was hard to resist when she was looking at him like that, her eyes dewy with tears, her lips slightly parted, her expression filled with trust and desire.\u003c/p\u003e\n\u003cp\u003eHe rested his brow on the top of her head. \"Think about it for a while, Annie,\" he remarked softly. \"There\u0027s no hurry.\"\u003c/p\u003e\n\u003cp\u003e\"But I want to be like you. I want to sleep where you sleep, and wake up in your arms.\"\u003c/p\u003e\n\u003cp\u003eIt was tempting, so tempting. In two thousand years, he had never made another vampire. Never loved a woman other than Katlaina.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes as he imagined what it would be like to have Adrianna forever at his side. Together, they could roam the world. He could show her all the wonders of the ancient world; together, they could explore the future. Ah, the lure of having her share his dark sleep, of waking each day with her in his arms. With Adrianna by his side, he would never again be alone.\u003c/p\u003e\n\u003cp\u003eLowering his head, he let his tongue slide over the pulse beating in her throat, felt his fangs lengthen at the thought of piercing her tender flesh. One quick bite was all it would take. And then the ecstacy of drinking her sweetness, drinking until her essence filled him, flooded him. Listening to her heartbeat fluttering wildly, like a frightened bird, slowing, slowing, to the brink of death, and then the magic of bringing her back, changed to a creature who would be forever young, forever beautiful.\u003c/p\u003e\n\u003cp\u003eForever cursed, as he was cursed.\u003c/p\u003e\n\u003cp\u003eHe drew back, his gaze moving over her face, imagining her eyes glowing with the lust for blood, her full pink lips stained crimson.\u003c/p\u003e\n\u003cp\u003e\"Navarre?\"\u003c/p\u003e\n\u003cp\u003e\"Not tonight, Annie.\" He placed his hands on her shoulders and held her away from him. \"Let me think on it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t leave me.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t.\"\u003c/p\u003e\n\u003cp\u003eShe moved into his embrace again, her head resting on his chest. \"Are we going to make love?\"\u003c/p\u003e\n\u003cp\u003eHer voice was soft and low, with a husky, sensual quality that sent heat spiraling through him to pool in his groin like lava. His arms tightened around her, a low groan rumbling deep in his throat as her breasts were crushed to his chest. She thrust her hips forward in silent invitation, and he knew he was lost.\u003c/p\u003e\n\u003cp\u003eSweeping her into his arms, he carried her down the hall to her bedroom. He made short work of removing her clothes and his. There was no patience in him now, no tenderness, little gentleness, only an urgent need that refused to be ignored, a hunger that went deeper than desire.\u003c/p\u003e\n\u003cp\u003eHe cradled her to him, clinging to her as the world spun out of focus. She wanted him. He needed her. She had begged him to give her the Dark Gift. Did she know what she was asking?\u003c/p\u003e\n\u003cp\u003eHe sheathed himself deep within her, wanting only to bury himself in her sweetness, to forget everything but the woman in his arms, but the questions would not be denied. Why had she asked him to bring her over? She had never mentioned it before, never hinted that she would welcome the Dark Gift. Indeed, she had asked if he would accept a cure, said it was the only way they could have a life together. What had changed her mind?\u003c/p\u003e\n\u003cp\u003e\"Navarre!\" She cried his name as she found fulfillment.\u003c/p\u003e\n\u003cp\u003eA moment later, he forgot everything as he found his own release. And then, for a long while, they lay wrapped in each other\u0027s arms.\u003c/p\u003e\n\u003cp\u003eLater, he made love to her again, more slowly this time, taking her to the peak again and again before he carried her over the edge.\u003c/p\u003e\n\u003cp\u003eHe was almost asleep when he sensed the dawning of a new day. Gently, he extricated himself from her arms.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\" she murmured sleepily.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s near dawn,\" he said, pressing a kiss to her brow. \"I\u0027ve got to go.\"\u003c/p\u003e\n\u003cp\u003e\"No, stay.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Then take me with you.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eInsist on it. the voice inside her head demanded.Don\u0027t let him leave you behind .\u003c/p\u003e\n\u003cp\u003e\"Please, Navarre. I want to stay with you all day.\"\u003c/p\u003e\n\u003cp\u003e\"No, Annie. I don\u0027t want you to... I don\u0027t want to frighten you.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Annie, don\u0027t ask this of me.\"\u003c/p\u003e\n\u003cp\u003e\"I am asking.\" She looked up at him, her eyes filling with tears. \"Please don\u0027t leave me. I\u0027m so afraid when you\u0027re gone.\" Her eyes went blank for a moment, and then she smiled. \"Please, Navarre, this will give me a chance to see what it\u0027s like for you during the day. Please?\"\u003c/p\u003e\n\u003cp\u003eEverything within warned him to say no, but he couldn\u0027t help thinking it might be a good idea for her to see, firsthand, how he spent the day, the deathlike sleep that held him in its power. And if she got scared, she could always leave.\u003c/p\u003e\n\u003cp\u003eKnowing he might be making a terrible mistake, he wrapped her in a blanket, lifted her into his arms, closed his eyes, and willed himself to the place where he rested during the day.\u003c/p\u003e\n\u003cp\u003eAdrianna blinked, and blinked again, bewildered by the sudden change of surroundings. \"Where are we?\"\u003c/p\u003e\n\u003cp\u003e\"An ancient underground graveyard.\"\u003c/p\u003e\n\u003cp\u003e\"Are we still in Moreno Bay?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Gently, he put her down. A blink of his eye brought a fat white candle sputtering to life.\u003c/p\u003e\n\u003cp\u003eHer eyes seemed huge in a face gone suddenly pale as she stared at the rotting timber above her head, wrinkled her nose at the smell of death and decay.\u003c/p\u003e\n\u003cp\u003eShivering, she huddled deeper into the folds of the blanket. \"Why did you bring me here?\"\u003c/p\u003e\n\u003cp\u003e\"I needed a new place to rest.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because too many people know about Cliff House.\"\u003c/p\u003e\n\u003cp\u003e\"No one knows except me.\"\u003c/p\u003e\n\u003cp\u003e\"And Shaylyn.\"\u003c/p\u003e\n\u003cp\u003e\"But she\u0027s gone.\"\u003c/p\u003e\n\u003cp\u003e\"Is she?\" He took hold of her arm, his grip like steel. \"Has she turned you against me?\u0027\u0027\u003c/p\u003e\n\u003cp\u003e\"No!\" She winced as she tried to twist out of his grasp. \"Please, Navarre, you\u0027re hurting me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\" He released his hold on her immediately.\u003c/p\u003e\n\u003cp\u003e\"Couldn\u0027t you have found a more pleasant place to rest?\"\u003c/p\u003e\n\u003cp\u003e\"I was in a hurry when I came here. A vampire is vulnerable during the hours of the day, Adrianna.\" His gaze pierced her heart and soul. \"Never, in all my existence, have I let anyone, mortal or vampire, know where I took my rest. Until you.\"\u003c/p\u003e\n\u003cp\u003e\"Navarre...\"\u003c/p\u003e\n\u003cp\u003eBe silent!\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" He watched her carefully, wondering what she was hiding.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" She glanced at the dirt beneath her feet with dismay. \"Do you sleep on the ground?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He picked up the candle with one hand, held out his other hand in silent invitation.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t hesitate as she put her hand in his and let him guide her deeper into the catacombs. Gradually, the passageway widened, and she saw a pile of quilts and blankets spread on the ground.\u003c/p\u003e\n\u003cp\u003eNavarre placed the candle on a flat rock, then drew Adrianna into his arms. \"Are you sure you want to stay here?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, her eyes wide, guileless.\u003c/p\u003e\n\u003cp\u003e\"Will you make love to me before I sleep?\"\u003c/p\u003e\n\u003cp\u003eAt her nod, he drew her down onto the blankets. He wondered briefly if he was making the biggest, most fatal mistake of his existence, but then there was no more time for thought, there was only the woman in his arms, and the magic of her touch filling him with light and love where before there had been only darkness and loneliness...\u003c/p\u003e\n\u003cp\u003eAdrianna sat bolt upright, her whole body trembling as she glanced around the cavern, her heart pounding with dread.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s coming!\" She grabbed at Navarre\u0027s arm, shaking him, willing him to wake up.\u003c/p\u003e\n\u003cp\u003eThe panic in Adrianna\u0027s voice penetrated his daytime slumber.\u003c/p\u003e\n\u003cp\u003e\"Navarre, wake up! She\u0027s coming!\"\u003c/p\u003e\n\u003cp\u003eAdrianna needed him. The knowledge severed the darkness that held him fast.\u003c/p\u003e\n\u003cp\u003e\"Navarre!\"\u003c/p\u003e\n\u003cp\u003eHe knew, an instant before it was too late, that they were no longer alone. Thrusting Annie behind him, Navarre struggled to his feet.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve done well, my foolish little mortal,\" Shaylyn said smugly. \"And now you will finish what you have begun.\"\u003c/p\u003e\n\u003cp\u003eAdrianna stared up at the vampire woman. \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"I mean to destroy him, and you shall be the instrument of his destruction.\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t. You can\u0027t make me.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t I?\" Eyes narrowed, Shaylyn stared at Adrianna. Her lips curled back in a hideous smile as Adrianna dropped to the ground and began to writhe in pain.\u003c/p\u003e\n\u003cp\u003e\"Shaylyn,\" Navarre rasped. \"Leave her alone.\" He swayed on his feet as the darkness sought to enfold him. \"Why are you doing this?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a threat to me, Navarre. I haven\u0027t survived this long by being foolish. Your powers are too strong.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He stared at Adrianna. She was curled into a fetal position, her hands pressed to her head, her mouth open in a silent scream of agony. \"Let her go.\"\u003c/p\u003e\n\u003cp\u003e\"Does it bother you to watch her?\"\u003c/p\u003e\n\u003cp\u003e\"Shaylyn, I\u0027ll do whatever you want. Only leave her alone. She\u0027s done nothing to you.\"\u003c/p\u003e\n\u003cp\u003e\"She took you from me.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He closed his eyes, willing the darkness away. But he could feel himself growing ever weaker as the sun climbed higher in the sky.\u003c/p\u003e\n\u003cp\u003e\"Stand up, Adrianna,\" Shaylyn demanded.\u003c/p\u003e\n\u003cp\u003eAdrianna tried to refuse, but her limbs moved with a will of their own. Her legs felt as though they were weighted with lead as she went to stand beside Shaylyn.\u003c/p\u003e\n\u003cp\u003e\"Take this,\" Shaylyn said, and thrust a knife into Adrianna\u0027s hands. The handle was of thick wood, the blade was long and slender and made of pure silver. \"When I tell you to, you will cut out his heart and throw it into the fire.\"\u003c/p\u003e\n\u003cp\u003eAdrianna tried to refuse, but no words passed her lips.\u003c/p\u003e\n\u003cp\u003eShaylyn glanced at the blankets that had served as Navarre\u0027s bed, her nostrils flaring, her eyes narrowing. A moment later, the bedding burst into flame.\u003c/p\u003e\n\u003cp\u003eNavarre felt the heat of the fire at his back, but he didn\u0027t take his gaze from Adrianna. Powerless to move or speak, she stared back at him, her eyes filled with a silent plea for help.\u003c/p\u003e\n\u003cp\u003eSlowly, deliberately, Shaylyn took hold of Navarre and forced him down to the ground. Exerting her superior strength, she crouched behind him, her hands pinning his shoulders to the ground.\u003c/p\u003e\n\u003cp\u003e\"Now, Adrianna,\" she commanded.\u003c/p\u003e\n\u003cp\u003e\"Navarre...\" His name escaped Adrianna\u0027s lips even as she moved toward him. \"No,\" she whimpered. \"Please don\u0027t make me.\"\u003c/p\u003e\n\u003cp\u003eBut even as she begged Shaylyn for mercy, Adrianna was kneeling beside Navarre. She stared at her hand as if it belonged to someone else, watched in numbed horror as the hand lifted the knife.\u003c/p\u003e\n\u003cp\u003eSummoning every ounce of will she possessed, she dragged her gaze from the blade and looked down into Navarre\u0027s eyes. There was no condemnation in his deep gray eyes, only a deep and abiding expression of love and understanding. And forgiveness.\u003c/p\u003e\n\u003cp\u003e\"Do it!\" Shaylyn\u0027s voice cut across the stillness.\u003c/p\u003e\n\u003cp\u003eTears filled Adrianna\u0027s eyes as she tried to resist. But she had no will of her own, no power to refuse. Her hand tightened around the handle of the knife as she prepared to plunge it into Navarre\u0027s chest.\u003c/p\u003e\n\u003cp\u003e\"I love you, Annie,\" Navarre whispered, and closed his eyes as the knife arrowed toward his chest.\u003c/p\u003e\n\u003cp\u003eTime seemed to slow as the knife descended toward Navarre\u0027s heart. His voice, his words, rang in Adrianna\u0027s ears, stronger and louder than the screech of Shaylyn\u0027s command.\u003c/p\u003e\n\u003cp\u003eDrawing from the wellspring of Navarre\u0027s love, Adrianna launched herself at Shaylyn, shuddering with horror as she drove the blade into the other woman\u0027s breast.\u003c/p\u003e\n\u003cp\u003eShaylyn shrieked with pain and outrage as the knife pierced her flesh. Cursing loudly, she grabbed Adrianna by the shoulders, holding her in a vice-like grip as she buried her fangs in Adrianna\u0027s throat.\u003c/p\u003e\n\u003cp\u003eBlood spurted across Navarre\u0027s face, hot and warm. His blood, he thought, and wondered why there was no pain.\u003c/p\u003e\n\u003cp\u003eIt took all his strength to open his eyes, to drag himself out of the arms of the darkness.\u003c/p\u003e\n\u003cp\u003eShaylyn and Adrianna were locked together in a violent struggle, each trying to wrest the knife from the other. Blood spurted from a deep gash in Shaylyn\u0027s left breast. A crimson tide gouted from a hideous wound in Adrianna\u0027s throat.\u003c/p\u003e\n\u003cp\u003eHe knew in an instant that somehow Annie had found the inner strength to defy Shaylyn\u0027s command, that she had turned the knife on the vampire, and that she was going to lose her own life in trying to save his.\u003c/p\u003e\n\u003cp\u003eFeeling as though he were moving through thick mud, he struggled to his feet and lunged forward, his hand grabbing for the knife.\u003c/p\u003e\n\u003cp\u003eThe silver seared his skin even as the blade sliced into his hand, but he ignored the pain as he wrenched the knife from Adrianna\u0027s grasp and plunged it into Shaylyn\u0027s breast again, cutting the heart from her body, flinging it into the fire.\u003c/p\u003e\n\u003cp\u003eA scream unlike anything he had ever heard filled the air, and then Shaylyn was falling, weightless, lifeless, to the ground.\u003c/p\u003e\n\u003cp\u003eWith a feral cry of triumph, Navarre tossed the bloody corpse into the flames.\u003c/p\u003e\n\u003cp\u003eStaggering, he made his way to Adrianna\u0027s side. Dropping to his knees, he gathered her into his arms and pressed his hand to the wound in her throat. Her blood was hot against his palm, her blood mingling with his. Unable to help himself, he bent his head and licked the blood from her neck. Its heat, its life-giving force, burned into him, strengthened him, driving away the darkness.\u003c/p\u003e\n\u003cp\u003e\"Annie! Annie, can you hear me?\"\u003c/p\u003e\n\u003cp\u003e\"Navarre... ?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\" He stared into her face, willing her to open her eyes. \"Don\u0027t leave me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m... sorry...\" Her voice, low and weak, seemed to come from far away.\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t your fault. Annie! Please, Annie, don\u0027t leave me.\"\u003c/p\u003e\n\u003cp\u003eBlood. So much blood. The scent of it was all around him, seeping into his pores, filling his nostrils, tempting him to finish what Shaylyn had started.\u003c/p\u003e\n\u003cp\u003e\"Annie, help me!\"\u003c/p\u003e\n\u003cp\u003eHer eyelids fluttered open, and she stared up at him, her gaze unfocused. Death lurked in the shadowed depths of her eyes.\u003c/p\u003e\n\u003cp\u003e\"Am I... going to...\" She swallowed. \"To die?\"\u003c/p\u003e\n\u003cp\u003eNavarre nodded, unable to speak, unable to lie to her.\u003c/p\u003e\n\u003cp\u003e\"Want to stay...with you.\"\u003c/p\u003e\n\u003cp\u003e\"Annie, tell me what to do.\"\u003c/p\u003e\n\u003cp\u003e\"Do?\"\u003c/p\u003e\n\u003cp\u003eShe was dying. Her breathing was shallow and uneven, the life was fading from her eyes.\u003c/p\u003e\n\u003cp\u003e\"Forgive me,\" he whispered, and letting her head fall back over his arm, he pressed his mouth to the hideous wound in her neck, felt the sweet, salty taste of her blood as it flowed into him and through him.\u003c/p\u003e\n\u003cp\u003eHe drank deeply, absorbing her life, her essence. Her pulse slowed, her heartbeat grew faint as her strength ebbed, flowing into him, renewing him.\u003c/p\u003e\n\u003cp\u003eSated, he lifted his head and gazed down into her face, now drained of all color.\u003c/p\u003e\n\u003cp\u003e\"Forgive me,\" he murmured again, and pressed his mouth to her throat once more, stealing away the last precious drops of life. \u003c/p\u003e","sourceLink":"https://allnovel.net/sunlight-moonlight/page-50.html","bookId":2306,"creation":"Oct 5, 2019 6:12:52 PM","modification":"Oct 5, 2019 6:12:52 PM"}
