{"id":110182,"no":20,"title":"Page 20","content":"\u003cp\u003eThe Side You Despise\u003c/p\u003e\n\u003cp\u003eThunder came from the sky, like a giant drum beating fiercely and fast, forcing its way into her head and chest. It seemed to rattle the whole horizon, making the surface of the river shimmer with every thud.\u003c/p\u003e\n\u003cp\u003eTally crouched low in the water, sinking to her neck just before the machine appeared.\u003c/p\u003e\n\u003cp\u003eIt came from the direction of the mountains, flying low and kicking up dust in a dozen separate windstorms in its wake. It was much bigger than a hovercar, and a hundred times louder. Apparently without magnets, it beat the air into submission with a half-invisible disk shimmering in the sun.\u003c/p\u003e\n\u003cp\u003eWhen the machine reached the river, it banked into a turn. Its passage churned the water, sending out circular waves as if some huge stone were skimming across the surface. Tally saw people inside, looking down at her camp. The unfolded hoverboard pitched in the windstorm, its magnets fighting to keep it on the ground. Her knapsack disappeared in the dust, and she saw clothing, the sleeping bag, and packets of SpagBol scattering in the machine\u0027s wake.\u003c/p\u003e\n\u003cp\u003eTally sank lower into the frantic water, struck by the thought that she would be left here, naked and alone, with nothing. She was already half frozen.\u003c/p\u003e\n\u003cp\u003eBut the machine dipped forward, just like a hoverboard, and moved on. It headed toward the sea, vanishing as quickly as it had appeared, leaving her ears pounding and the river\u0027s surface boiling.\u003c/p\u003e\n\u003cp\u003eTally crept out shivering. Her body felt ice cold, her fingers barely able to clench into a fist. She made her way back to her camp, grasping clothes to her body, putting them on before the setting sun could dry her. She sat and wrapped her arms around herself until the shaking stopped, glancing fearfully at the red horizon every few seconds.\u003c/p\u003e\n\u003cp\u003eThe damage was less than she\u0027d feared. The hoverboard\u0027s operation light was green, and her knapsack, dusty but unharmed. After a search for SpagBol and a count of the remaining packets, Tally found that she had lost only two. But the sleeping bag was shredded. Something had chopped it to pieces.\u003c/p\u003e\n\u003cp\u003eTally swallowed. There was nothing left of the bag bigger than a handkerchief. What if she had been in it when the machine had come?\u003c/p\u003e\n\u003cp\u003eShe folded the hoverboard quickly and packed everything away. The board was ready to go almost instantly. At least the strange machine\u0027s windstorm had dried it off.\u003c/p\u003e\n\u003cp\u003e\"Thanks a lot,\" Tally said as she stepped on, leaning forward as the sun began to set. She was anxious to leave the campsite behind her as quickly as possible, in case they came back.\u003c/p\u003e\n\u003cp\u003eBut who were they? The flying machine had been just like what Tally imagined when her teachers had described Rusty contraptions: a portable tornado crashing along, destroying everything in its path. Tally had read about aircraft that shattered windows as they flew past, armored war vehicles that could drive straight through a house.\u003c/p\u003e\n\u003cp\u003eBut the Rusties had been gone a long time. Who would be stupid enough to rebuild their insane machines?\u003c/p\u003e\n\u003cp\u003eTally rode into the growing darkness, her eyes peeled for any signs of the next clue - \"Four days later take the side you despise\" - and for whatever other surprises the night would bring.\u003c/p\u003e\n\u003cp\u003eOne thing was certain now: She wasn\u0027t alone out here.\u003c/p\u003e\n\u003cp\u003eLater that night, the river branched in two.\u003c/p\u003e\n\u003cp\u003eTally cruised to a halt, surveying the junction. One of the branches was clearly larger, the other more like a broad stream. A \"tributary,\" she remembered, was the name for a small river that fed into a larger one.\u003c/p\u003e\n\u003cp\u003eProbably she should just stay on the main river. But she\u0027d been traveling for just three days, and her hoverboard was a lot faster than most. Maybe it was time for the next clue.\u003c/p\u003e\n\u003cp\u003e\"Four days later take the side you despise,\" Tally muttered.\u003c/p\u003e\n\u003cp\u003eShe peered at the two rivers in the light from the moon, which was almost full now. Which river did she despise? Or which one would Shaythink she despised? They both looked pretty ordinary to her. She squinted into the distance. Maybe one led toward something despicable that would be visible in daylight.\u003c/p\u003e\n\u003cp\u003eBut waiting would mean losing a night\u0027s travel, and sleeping in the cold and dark without a sleeping bag.\u003c/p\u003e\n\u003cp\u003eTally reminded herself that the clue might not be about this junction. Maybe she should just stay on the big river until something more obvious came up. Why would Shay call the two rivers \"sides,\" anyway? If she\u0027d meant this junction, wouldn\u0027t it be \"take the direction you despise\"?\u003c/p\u003e\n\u003cp\u003e\"The side you despise,\" Tally mumbled, remembering something.\u003c/p\u003e\n\u003cp\u003eHer fingers went to her face. When she had showed Shay her pretty morphos, Tally had mentioned how she always started by doubling her left side - that she had always hated the right side of her face. Which was exactly the sort of thing that Shay would remember.\u003c/p\u003e\n\u003cp\u003eWas this Shay\u0027s way of telling her to take a right?\u003c/p\u003e\n\u003cp\u003eBranching to the right was the smaller river, the tributary. The mountains were closer in that direction.\u003c/p\u003e\n\u003cp\u003eMaybe she was drawing near the Smoke.\u003c/p\u003e\n\u003cp\u003eShe stared at the two rivers in the darkness, one big and one small, and remembered Shay saying that pretty symmetry was silly, because she\u0027d rather have a face with two different sides.\u003c/p\u003e\n\u003cp\u003eTally hadn\u0027t realized it at the time, but that had been an important conversation for Shay, the first time she had talked about wanting to stay ugly. If only Tally had noticed at the time, maybe she could have talked Shay out of running away. And they\u0027d both be in a party tower right now, together and pretty.\u003c/p\u003e\n\u003cp\u003e\"Right it is.\" Tally sighed, and eased her board onto the smaller river.\u003c/p\u003e\n\u003cp\u003eBy the time the sun rose, Tally knew she had made the right choice.\u003c/p\u003e\n\u003cp\u003eAs the tributary climbed its way into the mountains, the fields around her filled with flowers. Soon the brilliant white bonnets were as thick as grass, driving every other color from the landscape. In the dawn light, it was as if the earth were glowing from within.\u003c/p\u003e\n\u003cp\u003e\"\u0027And look in the flowers for fire-bug eyes,\u0027\" Tally said to herself, wondering if she should get off the board. Maybe there was some kind of bug with fiery eyes she should be looking for.\u003c/p\u003e\n\u003cp\u003eShe drifted to shore and stepped off.\u003c/p\u003e\n\u003cp\u003eThe flowers came right up to the edge of the water. Tally knelt to inspect one closely. The five long white petals curved delicately up from the stem and around its mouth, which contained just a hint of yellow deep inside. One of the petals below the mouth was longer, arching down almost to the ground. Motion caught her eye, and she spotted a small bird hovering among the flowers, flitting from one to the next to alight on the longest petal, thrusting its beak into one after another.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re so beautiful,\" she said. And there were so many of them. She wanted to lie down in the flowers and sleep.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t see anything that might be \"fire-bug eyes.\" Tally stood, scanning the horizon. Nothing met her gaze but hills, blinding white with flowers, and the glimmering river climbing up into the mountains.\u003c/p\u003e\n\u003cp\u003eIt all looked so peaceful, a different world from the one that the flying machine had shattered last night.\u003c/p\u003e\n\u003cp\u003eShe stepped back on the board and continued, slower now as she looked carefully for whatever might fit Shay\u0027s clue, remembering to stick on a sunblock patch as the sun rose higher.\u003c/p\u003e\n\u003cp\u003eThe river climbed higher into the hills. From up there, Tally saw bare stretches among the flowers, expanses of dry, sandy earth. The patchy landscape was a strange sight, like a beautiful painting that someone had taken sandpaper to.\u003c/p\u003e\n\u003cp\u003eShe got off her board several times to inspect the flowers, looking for insects or anything else that might match the words \"fire-bug eyes.\" But as the day wore on, nothing made sense.\u003c/p\u003e\n\u003cp\u003eBy the time noon approached the tributary was gradually growing smaller. Sooner or later, she would reach its source, a mountain spring or melting snowdrift, and then she\u0027d have to walk. Tired after the long night, she decided to make camp.\u003c/p\u003e\n\u003cp\u003eHer eyes scanned the sky, wondering if any more of the Rusty flying machines were around. The idea of another one crashing into her in her sleep terrified her. Who knew what the people inside the thing wanted? If she hadn\u0027t been hidden in the water the night before, what would they have done with her?\u003c/p\u003e\n\u003cp\u003eOne thing was certain: The shiny solar cells of the hoverboard would be obvious from the air. Tally checked the charge; more than half remained thanks to her slow speed and the bright sun now overhead.\u003c/p\u003e\n\u003cp\u003eShe unfolded the hoverboard, but only halfway, and hid it among the tallest flowers she could find. Then she hiked to the top of a nearby hill. From up there Tally could keep her eye on the hoverboard, and hear and see anything approaching from the air. She decided to repack her knapsack before she went to sleep, so she could bolt at a moment\u0027s notice.\u003c/p\u003e\n\u003cp\u003eIt was the best she could do.\u003c/p\u003e\n\u003cp\u003eAfter a mildly revolting packet of SpagBol, Tally curled up in a spot where the white flowers were tall enough to hide her. The breeze stirred their long stalks, and shadows danced on her closed eyelids.\u003c/p\u003e\n\u003cp\u003eTally felt strangely exposed without her sleeping bag, lying there in her clothes, but the warm sun and the long night\u0027s travel put her quickly to sleep.\u003c/p\u003e\n\u003cp\u003eWhen she awoke, the world was on fire. \u003c/p\u003e","sourceLink":"https://allnovel.net/uglies-uglies-1/page-20.html","bookId":1573,"creation":"Oct 5, 2019 11:55:29 PM","modification":"Oct 5, 2019 11:55:29 PM"}
