{"id":110192,"no":30,"title":"Page 30","content":"\u003cp\u003eThe Secret\u003c/p\u003e\n\u003cp\u003eThey descended the ridge on the far side, down a steep, narrow path. David led her quickly in the darkness, finding footing on the almost invisible trail without hesitation. It was all Tally could do to keep up.\u003c/p\u003e\n\u003cp\u003eThe whole day had been one shock after another, and now to top it all off she was going to meet David\u0027s parents. That was the last thing she\u0027d expected after showing him her pendant and telling him she hadn\u0027t kept the Smoke a secret. His reactions were different from those of anyone she\u0027d ever met before. Maybe it was because he\u0027d grown up out here, away from the customs of the city. Or maybe he was just...different.\u003c/p\u003e\n\u003cp\u003eThey left the familiar ridge line far behind, and the mountain rose steeply to one side.\u003c/p\u003e\n\u003cp\u003e\"Your parents don\u0027t live in the Smoke?\"\u003c/p\u003e\n\u003cp\u003e\"No. It\u0027s too dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"Dangerous how?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s part of what I was telling you your first day here, in the railroad cave.\"\u003c/p\u003e\n\u003cp\u003e\"About your secret? How you were raised in the wild?\"\u003c/p\u003e\n\u003cp\u003eDavid stopped for a moment, turning back to face her in the darkness. \"There\u0027s more to it than that.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll let them tell you. Come on.\"\u003c/p\u003e\n\u003cp\u003eA few minutes later, a small square filled with faint light appeared, hovering in the darkness of the mountainside. Tally saw that it was a window, a light inside glowing deep red through a closed curtain.\u003c/p\u003e\n\u003cp\u003eThe house seemed half buried, as if it had been wedged into the mountain.\u003c/p\u003e\n\u003cp\u003eWhen they were still a stone\u0027s throw away, David stopped. \"Don\u0027t want to surprise them. They can be jumpy,\" he said, then shouted, \"Hello!\"\u003c/p\u003e\n\u003cp\u003eA moment later a doorway opened, letting out a shaft of light.\u003c/p\u003e\n\u003cp\u003e\"David?\" a woman\u0027s voice called. The door opened wider until the light spilled across them. \"Az, it\u0027s David.\"\u003c/p\u003e\n\u003cp\u003eAs they drew closer, Tally saw that she was an old ugly. Tally couldn\u0027t tell if she was younger or older than the Boss, but she certainly wasn\u0027t as terrifying to look at. Her eyes flashed liked a pretty\u0027s, and the lines of her face disappeared into a welcoming smile as she gathered her son into a hug.\u003c/p\u003e\n\u003cp\u003e\"Hi, Mom.\"\u003c/p\u003e\n\u003cp\u003e\"And you must be Tally.\"\u003c/p\u003e\n\u003cp\u003e\"Nice to meet you.\" She wondered if she should shake hands or something. In the city, you never spent much time with other uglies\u0027 parents, except when you hung out at friends\u0027 houses during school breaks.\u003c/p\u003e\n\u003cp\u003eThe house was much warmer than the bunkhouse, and the timber floors weren\u0027t nearly as rough, as if David\u0027s parents had lived there so long, their feet had worn them smooth. The house somehow felt more solid than any building in the Smoke. It was really cut into the mountain, she saw now. One of the walls was exposed stone, glistening with some kind of transparent sealant.\u003c/p\u003e\n\u003cp\u003e\"Nice to meet you, too, Tally,\" David\u0027s mother said. Tally wondered what her name was. David always referred to them as \"Mom\" and \"Dad,\" words Tally hadn\u0027t used for Sol and Ellie since she was a littlie.\u003c/p\u003e\n\u003cp\u003eA man appeared, shaking David\u0027s hand before turning to her. \"Good to meet you, Tally.\"\u003c/p\u003e\n\u003cp\u003eShe blinked, her breath catching, for a moment unable to speak. David and his father somehow looked...alike.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t make any sense. There had to be more than thirty years between them, if his father really had been a doctor when David was born. But their jaws, foreheads, even their slightly lopsided smiles were all so similar.\u003c/p\u003e\n\u003cp\u003e\"Tally?\" David said.\u003c/p\u003e\n\u003cp\u003e\"Sorry. You just...you look the same!\"\u003c/p\u003e\n\u003cp\u003eDavid\u0027s parents burst into laughter, and Tally felt her face turning red.\u003c/p\u003e\n\u003cp\u003e\"We get that a lot,\" his father said. \"You city kids always find it a shock. But you know about genetics, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. I know all about genes. I knew two sisters, uglies, who looked almost the same. But parents and children? That\u0027s just weird.\"\u003c/p\u003e\n\u003cp\u003eDavid\u0027s mother forced a serious expression onto her face, but the smile stayed in her eyes. \"The features that we take from our parents are the things that make us different. A big nose, thin lips, high forehead - all the things that the operation takes away.\"\u003c/p\u003e\n\u003cp\u003e\"The preference toward the mean,\" his dad said.\u003c/p\u003e\n\u003cp\u003eTally nodded, remembering school lessons. The overall average of human facial characteristics was the primary template for the operation. \"Sure. Average-looking features are one of the things people look for in a face.\"\u003c/p\u003e\n\u003cp\u003e\"But families pass on nonaverage looks. Like our big noses.\" The man tweaked his son\u0027s nose, and David rolled his eyes. Tally realized that David\u0027s nose was much bigger than any pretty\u0027s. Why hadn\u0027t she noticed that before now?\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one of the things you give up, when you become pretty. The family nose,\" his mother said. \"Az?\u003c/p\u003e\n\u003cp\u003eWhy don\u0027t you turn up the heat.\"\u003c/p\u003e\n\u003cp\u003eTally realized that she was still shivering, but not from the cold outside. This was all so weird. She couldn\u0027t get over the similarity between David and his father. \"That\u0027s okay. It\u0027s lovely in here, uh...\"\u003c/p\u003e\n\u003cp\u003e\"Maddy,\" the woman said. \"Shall we all sit down?\"\u003c/p\u003e\n\u003cp\u003eAz and Maddy apparently had been expecting them. In the front room of the house, four antique cups were set out on little saucers. Soon a kettle began to whistle softly on an electric heater, and Az poured the boiling water into an antique pot, releasing a floral scent into the room.\u003c/p\u003e\n\u003cp\u003eTally looked around her. The house was unlike any other in the Smoke. It was like a standard crumbly home, filled with impractical objects. A marble statuette stood in one corner, and rich rugs had been hung on the walls, lending their colors to the light in the room, softening the edges of everything. Maddy and Az must have brought a lot of things from the city when they ran away. And, unlike uglies, who had only their dorm uniforms and other disposable possessions, the two had actually spent half a lifetime collecting things before escaping the city.\u003c/p\u003e\n\u003cp\u003eTally remembered growing up surrounded by Sol\u0027s woodwork, abstract shapes fashioned from fallen branches she would collect from parks as a littlie. Maybe David\u0027s childhood hadn\u0027t been completely different from her own. \"This all looks so familiar,\" she said.\u003c/p\u003e\n\u003cp\u003e\"David hasn\u0027t told you?\" Maddy said. \"Az and I come from the same city as you. If we\u0027d stayed, we might have been the ones to turn you pretty.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I guess so,\" Tally murmured. If they\u0027d stayed in the city, there would have been no Smoke, and Shay never would have run away.\u003c/p\u003e\n\u003cp\u003e\"David says that you made it all the way here on your own,\" Maddy said.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I was following a friend of mine. She left me directions.\"\u003c/p\u003e\n\u003cp\u003e\"And you decided to come alone? Couldn\u0027t you wait for David to come around again?\"\u003c/p\u003e\n\u003cp\u003e\"There wasn\u0027t time to wait,\" David explained. \"She left the night before her sixteenth birthday.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s leaving things until the last minute,\" Az said.\u003c/p\u003e\n\u003cp\u003e\"But very dramatic,\" Maddy said approvingly.\u003c/p\u003e\n\u003cp\u003e\"Actually, I didn\u0027t have much choice. I hadn\u0027t even heard of the Smoke until Shay, my friend, told me she was leaving. That was about a week before my birthday.\"\u003c/p\u003e\n\u003cp\u003e\"Shay? I don\u0027t believe we\u0027ve met her,\" Az said.\u003c/p\u003e\n\u003cp\u003eTally looked at David, who shrugged. He had never brought Shay here? She wondered for a moment what had really gone on between David and Shay.\u003c/p\u003e\n\u003cp\u003e\"You certainly made up your mind quickly, then,\" Maddy said.\u003c/p\u003e\n\u003cp\u003eTally brought her mind back to the present. \"I had to. I only had one chance.\"\u003c/p\u003e\n\u003cp\u003e\"Spoken like a true Smokey,\" Az said, pouring a dark liquid from the kettle into the cups. \"Tea?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, please.\" Tally accepted a saucer and felt the scalding heat through the thin, white material of the cup. Realizing that this was one of those Smokey concoctions that burned your tongue, she sipped carefully. Her face twisted at the bitter taste. \"Ah. I mean...sorry. I\u0027ve never had tea before, actually.\"\u003c/p\u003e\n\u003cp\u003eAz\u0027s eyes widened. \"Really? But it was very popular back when we lived there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve heard of it. But it\u0027s more of a crumbly drink. Um, I mean, mostly only late pretties drink it.\" Tally willed herself not to blush.\u003c/p\u003e\n\u003cp\u003eMaddy laughed. \"Well, we\u0027re pretty crumbly, so I guess it\u0027s okay for us.\"\u003c/p\u003e\n\u003cp\u003e\"Speak for yourself, my dear.\"\u003c/p\u003e\n\u003cp\u003e\"Try this,\" David said. He dropped a white cube into Tally\u0027s tea. The next time she drank, a sweetness had spread through it, cutting the bitterness. It was possible to sip the stuff now without grimacing.\u003c/p\u003e\n\u003cp\u003e\"David\u0027s told you a little about us, I suppose,\" Maddy said.\u003c/p\u003e\n\u003cp\u003e\"Well, he said you ran away a long time ago. Before he was born.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, did he?\" Az said. The expression on his face was exactly like David\u0027s when a member of the railroad crew did something thoughtless and dangerous with a vibrasaw.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t tell her everything, Dad,\" David said. \"Just that I grew up in the wild.\"\u003c/p\u003e\n\u003cp\u003e\"You left the rest to us?\" Az said a bit stiffly. \"Very good of you.\"\u003c/p\u003e\n\u003cp\u003eDavid held his father\u0027s gaze. \"Tally came here to make sure her friend was okay. All the way here alone.\u003c/p\u003e\n\u003cp\u003eBut she might not want to stay.\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t force anyone to live here,\" Maddy said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I mean,\" David said. \"I think she should know, before she decides about going back to the city.\"\u003c/p\u003e\n\u003cp\u003eTally looked from David to his parents, quietly amazed. The way they communicated was so strange, not like uglies and crumblies at all. It was more like uglies arguing. Like equals.\u003c/p\u003e\n\u003cp\u003e\"I should know what?\" she asked softly.\u003c/p\u003e\n\u003cp\u003eThey all looked at her, Maddy and Az measuring her with their eyes.\u003c/p\u003e\n\u003cp\u003e\"The big secret,\" Az said, \"the one that made us run away almost twenty years ago.\"\u003c/p\u003e\n\u003cp\u003e\"One we usually keep to ourselves,\" Maddy said evenly, her eyes on David.\u003c/p\u003e\n\u003cp\u003e\"Tally deserves to know,\" David said, his eyes locked with his mother\u0027s. \"She\u0027ll understand how important it is.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a kid. A city kid.\"\u003c/p\u003e\n\u003cp\u003e\"She made it here alone, with only a bunch of gibberish directions to guide her.\"\u003c/p\u003e\n\u003cp\u003eMaddy scowled. \"You\u0027ve never even been to a city, David. You have no idea how coddled they are.\u003c/p\u003e\n\u003cp\u003eThey spend their whole lives in a bubble.\"\u003c/p\u003e\n\u003cp\u003e\"She survived alone for nine days, Mom. Made it through a brush fire.\"\u003c/p\u003e\n\u003cp\u003e\"Please, you two,\" Az interjected. \"Sheis sitting right here. Aren\u0027t you, Tally?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I am,\" Tally said quietly. \"And I wish you\u0027d tell me what you\u0027re talking about.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Tally,\" Maddy said. \"But this secret is very important. And very dangerous.\"\u003c/p\u003e\n\u003cp\u003eTally nodded her head, looking down at the floor. \"Everything out here is dangerous.\"\u003c/p\u003e\n\u003cp\u003eThey were all silent for a moment. All Tally heard was the tinkle of Az stirring his tea.\u003c/p\u003e\n\u003cp\u003e\"See?\" David said finally. \"She understands. You can trust her. She deserves to know the truth.\"\u003c/p\u003e\n\u003cp\u003e\"Everyone does,\" Maddy said quietly. \"Eventually.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Az said, then paused to sip his tea. \"I suppose we\u0027ll have to tell you, Tally.\"\u003c/p\u003e\n\u003cp\u003e\"Tell mewhat ?\"\u003c/p\u003e\n\u003cp\u003eDavid took a deep breath. \"The truth about being pretty.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/uglies-uglies-1/page-30.html","bookId":1573,"creation":"Oct 5, 2019 11:55:29 PM","modification":"Oct 5, 2019 11:55:29 PM"}
