{"id":73910,"no":6,"title":"Page 6","content":"\u003cp\u003eThe receptionist pauses, her brow furrowing again. I hold my breath. Did I overdo it? Maybe the head scarf was too much. But then she moves toward her computer, her fingers skating deftly over the keyboard.\u003c/p\u003e\n\u003cp\u003e“Of course,” she chirps. She runs a key card through the activation strip and passes it to me in a small, embossed folder. “Here you go, Marilyn.” She actually winks as she slides the card to me. She lowers her voice to a conspiratorial whisper, adding, “I took the liberty of upgrading you to the Emperor Suite. Your valet is complimentary as well.”\u003c/p\u003e\n\u003cp\u003eMy heart leaps. Game. Set. Match.\u003c/p\u003e\n\u003cp\u003e“Thank you so much,” I gush, then spin on one heel and stride back to the others.\u003c/p\u003e\n\u003cp\u003e“Read it and weep, ladies.” I slap the new key card into Charlotte’s outstretched palm. “We’re in the Emperor Suite now. Oh, and valet is complimentary.” I head to the car and rip the keys from the ignition, tossing them to one of the valets. “You’re welcome!” I trill over my shoulder.\u003c/p\u003e\n\u003cp\u003eCharlotte whispers something to Madeline, and the two of them smirk at me. Laurel fidgets nervously.\u003c/p\u003e\n\u003cp\u003eI put my hands on my hips. “Emperor Suite. First challenge goes to the reigning queen.”\u003c/p\u003e\n\u003cp\u003e“Actually, Sutton, not quite.” Charlotte licks her lips.\u003c/p\u003e\n\u003cp\u003eI groan. “Do you want them to add in a bottle of champagne? If so, it’s Laurel’s turn, although that’s a total gimme.”\u003c/p\u003e\n\u003cp\u003eMadeline clears her throat. “The Emperor Suite is second best. Presidential is what you wanted.” She slips the key in her pocket. “Which means you lose this round.”\u003c/p\u003e\n\u003cp\u003eLaurel squeals with delight. I glance through the doors at the girl behind the desk, considering running back in there and begging for the Presidential instead. How was I supposed to know the Presidential was the best?\u003c/p\u003e\n\u003cp\u003eBut I’d said it myself. I was the queen of the Lying Game. I was supposed to know things like that.\u003c/p\u003e\n\u003cp\u003eI shrug my shoulders, toss my bag on the cart, and walk into the lobby once more, deciding not to let my friends see my frustration. I’m just getting warmed up. This kind of oversight won’t happen again.\u003c/p\u003e\n\u003cp\u003eIt simply can’t.\u003c/p\u003e\n\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eMAKE NEW FRIENDS, DITCH THE OLD?\u003c/p\u003e\n\u003cp\u003eEarly that same evening, after we’ve settled into our rooms and taken showers, I step off the elevator, the air cool on my bare legs. I’m wearing nothing but a bikini, a sarong, and a pair of high Tory Burch wedges, and I feel greedy stares as I walk gracefully across the lobby to the spa, where I’m meeting Garrett. A group of guys having cocktails at the bar follow me with their eyes the whole way. A bellhop actually drops a suitcase.\u003c/p\u003e\n\u003cp\u003eIt’s nice to be adored.\u003c/p\u003e\n\u003cp\u003eBut even as I hold my head high and exude confidence, a tiny needle pricks me again and again. What is going on with my friends? Why did they give me a nearly impossible first challenge and then still deem Laurel the winner? Did something happen I don’t know about? I keep thinking that Mads secretly knows I spoke to Thayer the morning of the search party . . . but there’s no way. Or what about the argument I had with Thayer at school? Do they think I drove Thayer away?\u003c/p\u003e\n\u003cp\u003eAnd why drag Laurel into this? They can’t actually like her—we’ve spent years working very hard to keep her out of our business. Are they all on board the Thayer train, wanting me to be nicer to Laurel because of how much she looks up to me? Doesn’t everyone understand how complicated it is between Laurel and me? They know I’m adopted. They know Laurel is the adored bio child. I thought they got it.\u003c/p\u003e\n\u003cp\u003eI don’t know whether to be furious with them or simply determined to work harder to earn back their respect.\u003c/p\u003e\n\u003cp\u003e“Sutton Mercer?” I hear from behind me, just as I’m about to push open the heavy oak door to the spa.\u003c/p\u003e\n\u003cp\u003eI turn slowly, my eyes adjusting to the light, and take in the lanky silhouette peering at me. It’s a boy my age, with longish dark hair that flops over his lake-blue eyes. His jeans are frayed, his flannel shirt is untucked, and his slip-on tennis sneakers are scuffed and covered with ballpoint pen doodles. He’s looking at me with the same sort of wonder as every other guy in the lobby. Then he lowers his eyes, seeming suddenly embarrassed.\u003c/p\u003e\n\u003cp\u003eI clear my throat. “Ethan, right?” I say, even though I know full well who he is.\u003c/p\u003e\n\u003cp\u003eEthan Landry and I are in the same grade at Hollier. I’ve always thought he was cute, with his soulful eyes and quiet, emo-boy demeanor. Now, though, in the glamorous lobby, he just looks young and immature.\u003c/p\u003e\n\u003cp\u003eHe blinks. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eThe fountain shoots up a stream of pink-tinted water behind us. “Road trip,” I say. “You know. What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Oh, uh, I’m here for the science bowl,” Ethan says. He gestures to a banner above the door to a ballroom. Science Bowl Arizona, it says. The prize for the winning team is five thousand dollars.\u003c/p\u003e\n\u003cp\u003eThe science bowl. The one we all told our parents we’d be cheering our friends on in. I didn’t think I’d actually know anyone participating in it, though.\u003c/p\u003e\n\u003cp\u003e“Well, good luck,” I say.\u003c/p\u003e\n\u003cp\u003eEthan sniffs, staring at me skeptically. Guilt flows through my veins. My friends and I pulled a trick on Ethan a few years ago that kept him from winning a prestigious science scholarship that would have sent him to a private school in Phoenix. It had been amazing—we’d laughed for days. But it had cost him. He would have won way more than the measly five thousand dollars he would have to split with his teammates at this science competition. But whatever. All’s fair in love and the Lying Game.\u003c/p\u003e\n\u003cp\u003eShrugging, I offer Ethan a wave, murmur goodbye, and head for the spa. Garrett texted me an hour ago saying he booked the two of us a private treatment room. We’re taking a re-mineralizer soak, which, according to the spa pamphlet, removes toxins from your body and promotes relaxation. Which is exactly what I need.\u003c/p\u003e\n\u003cp\u003eI march into the spa lobby, and the girls at the counter wave me to the back room, where Garrett is already waiting. As I walk down a long hall, the air is filled with the crisp scent of eucalyptus, and I can feel my heart rate slowing already. New Age music pipes softly in the background, and the lighting is dark and soothing.\u003c/p\u003e\n\u003cp\u003eI push through the fourth door on the right. Inside, tons of candles flicker in the corners. There’s a round tub in the middle, steam rising from its center. Garrett is in the water, his arms draped over the sides, his buff shoulders and chest gleaming in the steamy air. There’s a look of calm on his face.\u003c/p\u003e\n\u003cp\u003eWhen he sees me, he brightens. “You made it.”\u003c/p\u003e\n\u003cp\u003e“I made it,” I say, suddenly feeling shy.\u003c/p\u003e\n\u003cp\u003eI remove my locket from around my neck, place it on a towel, unwrap my sarong, and then step into the tub. The water is the perfect temperature, and the cucumber-scented salts instantly calm me. I slide in the whole way and shut my eyes for a moment. “I can practically feel the toxins leaving my body,” I say softly. Then I open my eyes and look at Garrett. “Thanks for organizing this.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.” Garrett looks bashful. “Thank you for inviting me to Vegas.” He clears his throat. “To be honest, I didn’t know we were at that stage, but I’m glad we are.”\u003c/p\u003e\n\u003cp\u003eI concentrate on a big bubble near my knee, feeling a guilty twinge. It’s not like I can tell Garrett I invited him half for revenge and half for distraction. So I float closer to him. “I think we’re going to have a lot of fun together.”\u003c/p\u003e\n\u003cp\u003e“I like fun,” Garrett whispers back. “And I’m always up for a little blackjack, maybe some craps.”\u003c/p\u003e\n\u003cp\u003e“I don’t know how to play craps,” I admit.\u003c/p\u003e\n\u003cp\u003eGarrett looks astonished. “Sutton Mercer doesn’t know how to play craps? Well, we’ll have to change that. I’ll teach you—I’m a master.”\u003c/p\u003e\n\u003cp\u003eI snort. “You’re not old enough to be a master. Unless you’ve been sneaking into casinos since you were twelve.”\u003c/p\u003e\n\u003cp\u003eHe smiles. “No, but my dad taught my sister and me how to play when we were little. We had an old craps table my dad bought off eBay—it was fun. We used to play all the time, but not anymore.”\u003c/p\u003e\n\u003cp\u003e“That does sound like fun,” I say. “Why did you stop?”\u003c/p\u003e\n\u003cp\u003eA strange look comes over Garrett’s face, and he turns away slightly. “Well, my dad moved, and Louisa isn’t really into that stuff anymore,” he says quietly.\u003c/p\u003e\n\u003cp\u003eIt’s all he needs to say to send me tumbling back to the mystery that is his sister. Garrett’s face goes dark as if he’s stuck in the memory. “Do you want to talk about what happened?” I ask quietly.\u003c/p\u003e\n\u003cp\u003eHis eyes flash. He jerks his knee quickly away. “You really don’t know?”\u003c/p\u003e\n\u003cp\u003eI recoil. He said it sort of accusingly, almost like I had something to do with it. “Of course not,” I insist.\u003c/p\u003e\n\u003cp\u003eThe steam swirls around us. Garrett presses his lips together. The look on his face is angry now, full of rage. He looks like he could kill someone. But then he shuts his eyes, his expression softening. “I’m sorry,” he says. “Sometimes I just get so . . . angry. I just wish I could have protected her.”\u003c/p\u003e\n\u003cp\u003e“Stop that.” I squeeze my fingers around his tightly. “You can’t beat yourself up. What happened, whatever it is, it’s not your fault.”\u003c/p\u003e\n\u003cp\u003e“I know,” Garrett says, his voice low. “But that doesn’t change how much it hurts, seeing Louisa hurting. I just wish I had done something. I wish there was something I could do now.”\u003c/p\u003e\n\u003cp\u003eI trace my index finger along his inner wrist, feeling his pulse echo against me. “You are doing something. You’re caring for her. You’re making sure she gets better. Do you know how lucky she is to have you?” I think of my own family situation. Would my parents be so distraught if something happened to me? Would Laurel?\u003c/p\u003e\n\u003cp\u003e“Thanks.” Garrett reaches out and gently tilts my face toward his, his bright blue eyes regarding me seriously. “You seem to always know what to say to make me feel better. How do you do it?”\u003c/p\u003e\n\u003cp\u003eI shrug. “Oh, just a talent of mine, I guess.” But I like that he thinks I’m kind. I’m so used to everyone assuming I’m a bitch.\u003c/p\u003e\n\u003cp\u003eThen Garrett leans toward me. He hesitates a moment, and my heart starts pounding hard. He kisses me softly, his lips tasting faintly of lemon water. I shut my eyes and kiss him back, cupping a hand around the back of his neck. As I run my fingers back and forth, it takes a moment for me to realize that I’m searching for the loose curls I always toyed with at the nape of Thayer’s neck. Garrett’s hair is straighter and closer cropped, and my fingers only dance across bare skin.\u003c/p\u003e\n\u003cp\u003eDon’t think about Thayer right now, a voice in my head chides. Garrett is better. Garrett is here.\u003c/p\u003e\n\u003cp\u003eSomething buzzes on the teak bench along the wall. I open one eye. My cell phone glows blue from the wicker reclining chair next to the tub.\u003c/p\u003e\n\u003cp\u003eGarrett opens his eyes, too. I pull away from him, feeling conflicted, then hop out of the water. Wrapping a towel around my waist, I scoop my phone from the robe and look at the screen. It’s Thayer’s new area code.\u003c/p\u003e\n\u003cp\u003eTalk about timing.\u003c/p\u003e\n\u003cp\u003eGarrett gazes at me. “Do you need to get that?”\u003c/p\u003e\n\u003cp\u003e“Uh, yeah,” I stammer. “It’s my mom. Just a sec.” \u003c/p\u003e","sourceLink":"https://allnovel.net/true-lies-the-lying-game-0/page-6.html","bookId":2400,"creation":"Oct 5, 2019 10:29:26 AM","modification":"Oct 5, 2019 10:29:26 AM"}
