{"id":26877,"no":15,"title":"CHAPTER XIV — A BATTLE AND A VICTORY","content":"\u0026nbsp;\"What\u0027s that for?\" demanded Dick, turning round to see who had struck him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re gettin\u0027 mighty fine!\" said Micky Maguire, surveying Dick\u0027s new clothes with a scornful air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something in his words and tone, which Dick, who was disposed to stand up for his dignity, did not at all relish.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, what\u0027s the odds if I am?\" he retorted. \"Does it hurt you any?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"See him put on airs, Jim,\" said Micky, turning to his companion. \"Where\u0027d you get them clo\u0027es?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind where I got \u0027em. Maybe the Prince of Wales gave \u0027em to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hear him, now, Jim,\" said Micky. \"Most likely he stole \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stealin\u0027 aint in my line.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It might have been unconscious the emphasis which Dick placed on the word \"my.\" At any rate Micky chose to take offence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean to say I steal?\" he demanded, doubling up his fist, and advancing towards Dick in a threatening manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t say anything about it,\" answered Dick, by no means alarmed at this hostile demonstration. \"I know you\u0027ve been to the Island twice. P\u0027r\u0027aps \u0027twas to make a visit along of the Mayor and Aldermen. Maybe you was a innocent victim of oppression. I aint a goin\u0027 to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Micky\u0027s freckled face grew red with wrath, for Dick had only stated the truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean to insult me?\" he demanded shaking the fist already doubled up in Dick\u0027s face. \"Maybe you want a lickin\u0027?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I aint partic\u0027larly anxious to get one,\" said Dick, coolly. \"They don\u0027t agree with my constitution which is nat\u0027rally delicate. I\u0027d rather have a good dinner than a lickin\u0027 any time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re afraid,\" sneered Micky. \"Isn\u0027t he, Jim?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In course he is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"P\u0027r\u0027aps I am,\" said Dick, composedly, \"but it don\u0027t trouble me much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you want to fight?\" demanded Micky, encouraged by Dick\u0027s quietness, fancying he was afraid to encounter him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t,\" said Dick. \"I aint fond of fightin\u0027. It\u0027s a very poor amusement, and very bad for the complexion, \u0027specially for the eyes and nose, which is apt to turn red, white, and blue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Micky misunderstood Dick, and judged from the tenor of his speech that he would be an easy victim. As he knew, Dick very seldom was concerned in any street fight,—not from cowardice, as he imagined, but because he had too much good sense to do so. Being quarrelsome, like all bullies, and supposing that he was more than a match for our hero, being about two inches taller, he could no longer resist an inclination to assault him, and tried to plant a blow in Dick\u0027s face which would have hurt him considerably if he had not drawn back just in time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, though Dick was far from quarrelsome, he was ready to defend himself on all occasions, and it was too much to expect that he would stand quiet and allow himself to be beaten.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He dropped his blacking-box on the instant, and returned Micky\u0027s blow with such good effect that the young bully staggered back, and would have fallen, if he had not been propped up by his confederate, Limpy Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go in, Micky!\" shouted the latter, who was rather a coward on his own account, but liked to see others fight. \"Polish him off, that\u0027s a good feller.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Micky was now boiling over with rage and fury, and required no urging. He was fully determined to make a terrible example of poor Dick. He threw himself upon him, and strove to bear him to the ground; but Dick, avoiding a close hug, in which he might possibly have got the worst of it, by an adroit movement, tripped up his antagonist, and stretched him on the side walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hit him, Jim!\" exclaimed Micky, furiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Limpy Jim did not seem inclined to obey orders. There was a quiet strength and coolness about Dick, which alarmed him. He preferred that Micky should incur all the risks of battle, and accordingly set himself to raising his fallen comrade.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, Micky,\" said Dick, quietly, \"you\u0027d better give it up. I wouldn\u0027t have touched you if you hadn\u0027t hit me first. I don\u0027t want to fight. It\u0027s low business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re afraid of hurtin\u0027 your clo\u0027es,\" said Micky, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe I am,\" said Dick. \"I hope I haven\u0027t hurt yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Micky\u0027s answer to this was another attack, as violent and impetuous as the first. But his fury was in the way. He struck wildly, not measuring his blows, and Dick had no difficulty in turning aside, so that his antagonist\u0027s blow fell upon the empty air, and his momentum was such that he nearly fell forward headlong. Dick might readily have taken advantage of his unsteadiness, and knocked him down; but he was not vindictive, and chose to act on the defensive, except when he could not avoid it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Recovering himself, Micky saw that Dick was a more formidable antagonist than he had supposed, and was meditating another assault, better planned, which by its impetuosity might bear our hero to the ground. But there was an unlooked-for interference.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look out for the \u0027copp,\u0027\" said Jim, in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Micky turned round and saw a tall policeman heading towards him, and thought it might be prudent to suspend hostilities. He accordingly picked up his black-box, and, hitching up his pants, walked off, attended by Limpy Jim.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that chap been doing?\" asked the policeman of Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He was amoosin\u0027 himself by pitchin\u0027 into me,\" replied Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He didn\u0027t like it \u0027cause I patronized a different tailor from him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it seems to me you are dressed pretty smart for a boot-black,\" said the policeman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I wasn\u0027t a boot-black,\" said Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind, my lad. It\u0027s an honest business,\" said the policeman, who was a sensible man and a worthy citizen. \"It\u0027s an honest business. Stick to it till you get something better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean to,\" said Dick. \"It aint easy to get out of it, as the prisoner remarked, when he was asked how he liked his residence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you don\u0027t speak from experience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Dick; \"I don\u0027t mean to get into prison if I can help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you see that gentleman over there?\" asked the officer, pointing to a well-dressed man who was walking on the other side of the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he was once a newsboy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what is he now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He keeps a bookstore, and is quite prosperous.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick looked at the gentleman with interest, wondering if he should look as respectable when he was a grown man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It will be seen that Dick was getting ambitious. Hitherto he had thought very little of the future, but was content to get along as he could, dining as well as his means would allow, and spending the evenings in the pit of the Old Bowery, eating peanuts between the acts if he was prosperous, and if unlucky supping on dry bread or an apple, and sleeping in an old box or a wagon. Now, for the first time, he began to reflect that he could not black boots all his life. In seven years he would be a man, and, since his meeting with Frank, he felt that he would like to be a respectable man. He could see and appreciate the difference between Frank and such a boy as Micky Maguire, and it was not strange that he preferred the society of the former.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the course of the next morning, in pursuance of his new resolutions for the future, he called at a savings bank, and held out four dollars in bills besides another dollar in change. There was a high railing, and a number of clerks busily writing at desks behind it. Dick, never having been in a bank before, did not know where to go. He went, by mistake, to the desk where money was paid out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where\u0027s your book?\" asked the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t got any.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you any money deposited here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir, I want to leave some here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then go to the next desk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick followed directions, and presented himself before an elderly man with gray hair, who looked at him over the rims of his spectacles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want you to keep that for me,\" said Dick, awkwardly emptying his money out on the desk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much is there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got an account here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course you can write?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The \"of course\" was said on account of Dick\u0027s neat dress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have I got to do any writing?\" asked our hero, a little embarrassed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We want you to sign your name in this book,\" and the old gentleman shoved round a large folio volume containing the names of depositors.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick surveyed the book with some awe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I aint much on writin\u0027,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well; write as well as you can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The pen was put into Dick\u0027s hand, and, after dipping it in the inkstand, he succeeded after a hard effort, accompanied by many contortions of the face, in inscribing upon the book of the bank the name\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n DICK HUNTER.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dick!—that means Richard, I suppose,\" said the bank officer, who had some difficulty in making out the signature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; Ragged Dick is what folks call me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t look very ragged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027ve left my rags to home. They might get wore out if I used \u0027em too common.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, my lad, I\u0027ll make out a book in the name of Dick Hunter, since you seem to prefer Dick to Richard. I hope you will save up your money and deposit more with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero took his bank-book, and gazed on the entry \"Five Dollars\" with a new sense of importance. He had been accustomed to joke about Erie shares, but now, for the first time, he felt himself a capitalist; on a small scale, to be sure, but still it was no small thing for Dick to have five dollars which he could call his own. He firmly determined that he would lay by every cent he could spare from his earnings towards the fund he hoped to accumulate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Dick was too sensible not to know that there was something more than money needed to win a respectable position in the world. He felt that he was very ignorant. Of reading and writing he only knew the rudiments, and that, with a slight acquaintance with arithmetic, was all he did know of books. Dick knew he must study hard, and he dreaded it. He looked upon learning as attended with greater difficulties than it really possesses. But Dick had good pluck. He meant to learn, nevertheless, and resolved to buy a book with his first spare earnings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Dick went home at night he locked up his bank-book in one of the drawers of the bureau. It was wonderful how much more independent he felt whenever he reflected upon the contents of that drawer, and with what an important air of joint ownership he regarded the bank building in which his small savings were deposited.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2996/82660.html","bookId":305,"creation":"Aug 4, 2019 1:34:04 AM","modification":"Aug 4, 2019 1:34:04 AM"}
