{"id":92736,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe smells and licks, and finally lifts his head and howls the most-haunting sound I have ever heard him make. It’s like a song. He does it a few times and then bends his head. He takes a small bite of her stomach where the blood has stopped seeping. He limps away with her blood on his face, holding his leg in the air.\u003c/p\u003e\n\u003cp\u003eWe lie there, helpless. I never got to ask Marshall anything. I know nothing. The sound of the little boy crying over his dead mother doesn’t even touch me.\u003c/p\u003e\n\u003cp\u003eNothing can.\u003c/p\u003e\n\u003cp\u003eMy friend is dead. One of my ‘us’.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eThey arrive to the scene the way it was hours before. No one has really moved much. I’m clutching her cold-dead body to mine. Nothing can take her from me. I failed her. I let her die. I shot Mary and started it. I did this.\u003c/p\u003e\n\u003cp\u003eI didn’t know I had more tears but there they were, falling from my eyes as I continued stroking her hair.\u003c/p\u003e\n\u003cp\u003eI hear the whispers and the words around me. I know Star is starting to clean everyone up. I know I should get up, but if I let her go, she’s gone forever and I don’t trust God enough to take her.\u003c/p\u003e\n\u003cp\u003e“Hey, Em.”\u003c/p\u003e\n\u003cp\u003eI glance over to see Jake. He smiles but I can see the tears in his eyes. He takes my hand, “Come here.”\u003c/p\u003e\n\u003cp\u003eI shake my head, gripping her to me, cradling her.\u003c/p\u003e\n\u003cp\u003eHe pries my fingers from her, lifting me off the ground. I am about to scream and fight, when I see Will lift her so gently and carefully.\u003c/p\u003e\n\u003cp\u003eI cry harder.\u003c/p\u003e\n\u003cp\u003eWill is stone faced, but I can see it everywhere. Jake holds me to him, his body is keeping me together.\u003c/p\u003e\n\u003cp\u003eI bury my face, “I shot Mary and he shot Meg. I shouldn’t have shot Mary.”\u003c/p\u003e\n\u003cp\u003eI feel little fingers prying and worming their way into the embrace. I wriggle from Jake’s arms and surround the sobbing, blonde face.\u003c/p\u003e\n\u003cp\u003eStar sniffles, “She saved Leo, I saw her. Marshall put the gun up and Meg jumped. She knew what she was doing, Em.”\u003c/p\u003e\n\u003cp\u003eI give Leo a dirty look and grip Sarah, “Are you hurt?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head and sniffles. We walk, following behind Meg’s body that Will has wrapped in a sheet. Bernie has dug a hole next to a huge rose bush. Will places her in the hole. I gag a bit. He tosses a handful of dirt into the hole and steps back. Sarah and me cling to each other. I drop to my knees and watch everyone follow Will’s lead.\u003c/p\u003e\n\u003cp\u003eBernie speaks softly, “Four years ago this rose bush grew from nothing. I never planted it or watered it. It’s grown from nothing and become something that makes my day a little bit better. Now I never knew Meg well, but I got the sense that she didn’t come from a lot of love. I get the sense she found it in this group of people. I can\u0027t think of a better place to put someone from our little group.”\u003c/p\u003e\n\u003cp\u003eSarah smiles, still sniffling, “She was thorny like that rose bush too, just like Em.”\u003c/p\u003e\n\u003cp\u003eWe all laugh.\u003c/p\u003e\n\u003cp\u003eLeo finally limps over and nuzzles against me. Sarah wraps her arms around him, crying into his fur.\u003c/p\u003e\n\u003cp\u003eI see Will staring at me with a look that’s filled with pain and anger.\u003c/p\u003e\n\u003cp\u003eI nod at him and feel the defeat and loss to the full extent. I pick up my handful of dirt and get up. I stand at the edge of the hole and look down on the sheet.\u003c/p\u003e\n\u003cp\u003eI have nothing and everything to say, but I don’t know how to say it. So I look up, I know she’s there. I never knew anything with as much certainty as I do this. I drop the dirt from my hand and whisper, “Forgive me.”\u003c/p\u003e\n\u003cp\u003eI turn and walk away. I can hear the cries and the dirt being shoveled on top of her. No… not her. She’s gone. She’s with Ron.\u003c/p\u003e\n\u003cp\u003eEvery painful step fills me with something not good. I walk past the house and into the woods. I climb a tree and sit.\u003c/p\u003e\n\u003cp\u003eI feel safer off the ground.\u003c/p\u003e\n\u003cp\u003eMy arms are bleeding and so is my side. Every branch I climb hurts me in a new way, but I can\u0027t imagine the pain she was in.\u003c/p\u003e\n\u003cp\u003eI sit in the tree and think about it all.\u003c/p\u003e\n\u003cp\u003eI feel the tree sway. Anna climbs to a branch beside me. Her face is swollen from tears and bruises. Her leg is hurt. I can see the tied bandage on it.\u003c/p\u003e\n\u003cp\u003e“I screwed up.”\u003c/p\u003e\n\u003cp\u003eShe nods. She knows it too.\u003c/p\u003e\n\u003cp\u003e“If I‘d known they had Meg and Sarah, I would have let Will and Jake come. I would have made them come. I would have done the attack differently.” I lean my face into the bark, “Shows you what I know.”\u003c/p\u003e\n\u003cp\u003eShe nods. She doesn’t say anything. What can she say?\u003c/p\u003e\n\u003cp\u003e“Where’s Andy?”\u003c/p\u003e\n\u003cp\u003eShe nods at the house, “Star has him. She’s getting him to bed.”\u003c/p\u003e\n\u003cp\u003eI nod. I feel sick for what I’ve done to him. What I’ve taken from him. He’s a small kid and I’ve taken the only person in the world that loved him. Mary took everything from me. I owed her, but he didn’t do anything to me. Well, beyond annoy the hell outta me.\u003c/p\u003e\n\u003cp\u003eI look across the field and see Jake, Will, and Bernie stacking rocks on the mound of dirt. Sarah is standing there all alone. When the sun goes down, it makes Sarah look a bit like a ghost standing at the edge of the pile. Her blonde hair is a mess.\u003c/p\u003e\n\u003cp\u003eI force myself to watch her feel the loss of her closest friend and number-one protector. It fills me with a kind of cold hate. The kind that burns but not like fire—like too much frost and no feeling.\u003c/p\u003e\n\u003cp\u003eI want nothing like I want my revenge. Forget the world, the flashy crow, and the little kids. I want my revenge. I want to be like Leo and take a taste of her blood so I always remember.\u003c/p\u003e\n\u003cp\u003eMy head starts to nod as I nearly fall asleep in the tree. I climb down, leaving Anna in the tree. She nods at me as I walk away and cross the field to the house.\u003c/p\u003e\n\u003cp\u003eLeo and Sarah are sitting at the grave. I whistle but he doesn’t come.\u003c/p\u003e\n\u003cp\u003eI go inside. Bernie is restoring the power supplies and cussing about his house. He sees me and stops. Will turns and I see it.\u003c/p\u003e\n\u003cp\u003eI nod, “Just say it.”\u003c/p\u003e\n\u003cp\u003eHe folds his arms over his chest, “You fucking killed her.”\u003c/p\u003e\n\u003cp\u003eI nod again, “I know.” He walks past me and out the door. He calls Leo and Sarah inside.\u003c/p\u003e\n\u003cp\u003eStar grabs my arm and drags me to the large room off the kitchen. “We gotta stitch you up.” She pulls my shirt off and sighs, “You didn’t kill her.”\u003c/p\u003e\n\u003cp\u003e“I left her with Mary, stupid. I came here without a clue as to what was going on, stupid. I never asked Will for help, stupid. I shot Mary and started the gun fight, stupid.”\u003c/p\u003e\n\u003cp\u003eShe starts to clean my shoulder and arm, “Mary was a traitorous bitch. I have never enjoyed anything, as much as I did watching you shoot her in the face; I know how awful that sounds. I feel sad that her kid was there. He’s never going to be the same. At least he’s sleeping now. Bernie had some old, anti-nausea medicine, I knocked him out with it.” She laughs, making me laugh. We are bad people.\u003c/p\u003e\n\u003cp\u003e“We’re not good with kids, Star. We need to find someone to take him.”\u003c/p\u003e\n\u003cp\u003eShe smiles, “I know.”\u003c/p\u003e\n\u003cp\u003eI look down, “What was I thinking? I shot a woman holding her kid.” I meet her eyes, “This is what’s wrong with us. I can\u0027t see right from wrong in the heat of the moment. I never saw that shooting Mary would get Meg killed. I saw the shots the way they would go down, but I never imagined it would end like that.”\u003c/p\u003e\n\u003cp\u003eShe shrugs, “I don’t see what you did was wrong. It was a split-second decision. I see it like it was all of us or them. It’s always us or them, Em.” Her words burn into me, making the cold hate worse. She continues, “Meg would have been fine if she’d stayed beside me.”\u003c/p\u003e\n\u003cp\u003eMy lip quivers, “But Leo…”\u003c/p\u003e\n\u003cp\u003eShe nods, “Yup. Meg made the same decision you made. She saw something she wanted changed and she did it. That’s the world we live in. We give up our lives to save theirs, or we walk away and save ours.” Her eyes tear up. She presses a needle into my wound. I tense and moan. She speaks softly again, “At least you have always been true to who you are. When I found out I was different, I never told anyone. I could have saved you at the camps and I didn’t. I let them think you were the only different one.”\u003c/p\u003e\n\u003cp\u003eThrough clenched teeth, I mutter, “Trust me, we aren’t so different. I would have lied too, if I hadn’t been discovered.”\u003c/p\u003e\n\u003cp\u003eJake walks into the room. He leans against the wall, “You need to go get Leo. He’s hurt and needs to come in. He and Sarah are sitting out there in the dark.” His voice is cold. He turns and leaves after a second. “They’re pissed.”\u003c/p\u003e\n\u003cp\u003eI nod, “I would be too.” She finishes and gives me some medicine, that she’s sure won\u0027t do anything for me because it’s expired.\u003c/p\u003e\n\u003cp\u003eI walk out into the yard, past Will and Jake. I drop to my knees when I get to the pile of stones next to the rose bush.\u003c/p\u003e\n\u003cp\u003e“We gotta go inside. It’s dangerous outside.”\u003c/p\u003e\n\u003cp\u003eSarah looks at me. Her cheeks are tear-stained and her eyes so puffy they barely open, “She was my best friend.”\u003c/p\u003e\n\u003cp\u003eI nod, “I know.”\u003c/p\u003e\n\u003cp\u003eShe runs her hand through Leo’s fur, “What if that’s how it is now, we just die off one by one?”\u003c/p\u003e\n\u003cp\u003eI shake my head, “I don’t know.” I want to lie, but the cold hate is stronger than me, and it doesn’t care if she’s scared.\u003c/p\u003e\n\u003cp\u003e“Meg wanted them dead. All them ones who kill the kids.”\u003c/p\u003e\n\u003cp\u003eI nod, “I know.”\u003c/p\u003e\n\u003cp\u003eShe puts a finger out, “You have to pinky swear that you\u0027ll kill them for her. Meg always made me pinky swear.” I wrap my finger around hers and she shakes it. “You kill them.”\u003c/p\u003e\n\u003cp\u003eI nod, “Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eShe wipes her little face and nods, “Okay, me and Leo will come in.” She stands, and sure enough, he stands and follows her inside. I look at the grave, “Night, Meg.” My eyes lift to the stars. I imagine she is one of them. Anyone who would do something so brave as to save Leo with their life, is hero enough for a place in the sky.\u003c/p\u003e\n\u003cp\u003eI stand and walk behind them to the house. Will wraps an arm around Sarah and carries her upstairs. I slap my leg at Leo. He tries to follow Sarah but I snap my fingers. He bows his head and walks with me to the kitchen. He’s still limping and holding that leg in the air.\u003c/p\u003e\n\u003cp\u003eWe get to the room. I pat the table, “Can you jump up?” I know he’s got to be at least as much as I weigh. There is no way I’ll get him on the table. \u003c/p\u003e","sourceLink":"https://allnovel.net/reborn-born-3/page-10.html","bookId":1606,"creation":"Oct 5, 2019 5:58:05 PM","modification":"Oct 5, 2019 5:58:05 PM"}
