{"id":92737,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJake walks in, “You need some help?”\u003c/p\u003e\n\u003cp\u003eI nod. Leo bares his teeth instantly. Jake gives him a look, “I need to put you on this table and you can bite me if you want to, but you’re going up there.”\u003c/p\u003e\n\u003cp\u003eLeo snarls but Jake ignores it. He reaches around and grabs him. He places him on the table, getting nips and snorts from the huge timber wolf. I see a bit of blood on Jake’s arm. He doesn’t even flinch.\u003c/p\u003e\n\u003cp\u003eLeo lies down on the table, looking uneasy. Star puts her hands up, “This you can handle. I’m not getting bit.”\u003c/p\u003e\n\u003cp\u003eI stroke his face, “Hey, it’s me and you now.” He yawns and I nod, “Settle in.” I grab some scissors and cut back the tufts of fur. The bullet made a perfect hole through his leg. It missed the bone completely. I look at Jake, “Wanna pet him?”\u003c/p\u003e\n\u003cp\u003eHe laughs, “Yeah sure. He’s already done his worst.”\u003c/p\u003e\n\u003cp\u003eI start the cleaning and look at Jake, “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHe shrugs, “You aren’t ever going to trust me or Will. I get why you don’t trust him, but me, I have never done anything but be your friend.”\u003c/p\u003e\n\u003cp\u003eI nod, “I know and I’m sorry. I wish I’d asked for help. I had no idea what we were walking into.”\u003c/p\u003e\n\u003cp\u003eHe nods, “There used to be a saying, Dad always said it when me and Will were fighting. There is no ‘I’ in team. You either work as a team to win, or you lose as a group of individuals.”\u003c/p\u003e\n\u003cp\u003eI sew the wound together. Leo sits, letting Jake pet his face. He doesn’t bite him. He’s as content as he can be. He trusts me again.\u003c/p\u003e\n\u003cp\u003eWill walks in, “Sarah is sleeping.”\u003c/p\u003e\n\u003cp\u003eI look up at him, “Thanks.”\u003c/p\u003e\n\u003cp\u003eHe turns and walks out. Jake makes a face, “He might kill you in your sleep.”\u003c/p\u003e\n\u003cp\u003eI snort, “God, I hope so.” And I do. Because if he doesn’t, the cold hate is going to consume me and I’ll kill everyone until I’ve satisfied it.\u003c/p\u003e\n\u003cp\u003eI understand why I never let anything in beyond Leo. Things and people end. They don’t take everything with them though; there is always a little bit left over that burns you inside.\u003c/p\u003e\n\u003cp\u003eWe finish with Leo and force medicine down his throat. Jake helps him down, getting bit again. We follow Jake to the living room and slump into the huge chairs. The house is quiet. Anna and Bernie are snuggled into a chair. Star is sitting on the floor next to the TV that doesn’t serve a purpose anymore. Will is on the couch. Jake sits beside him. I sit on the floor and let Leo come rest his head on my lap. Bernie gets up and passes us some of whatever they’re all drinking. I sniff it, smelling things that make my body shudder.\u003c/p\u003e\n\u003cp\u003eI take a big drink and feel the burn. It feels good, warming me against the cold hate.\u003c/p\u003e\n\u003cp\u003eI look at the glass and wonder who is going to talk first.\u003c/p\u003e\n\u003cp\u003eNo one does for a long time, but then Jake smiles, “I want to toast to Meg. The first girl who ever told me that I was what she called ‘a long sip of ice-cold water on a hot day’. I asked her when she’d ever had ice-cold water and she replied, never. I just heard Momma say it whenever we saw something as yummy as you roaming the woods. To Meg.”\u003c/p\u003e\n\u003cp\u003eWe all laughed and drank a huge gulp. My head started to spin.\u003c/p\u003e\n\u003cp\u003eStar held up her glass, “To Meg, thank you for showing me how to cook deer properly, since I couldn’t do it, even if the damned deer got up and told me how.”\u003c/p\u003e\n\u003cp\u003eI laughed harder and took back another big gulp.\u003c/p\u003e\n\u003cp\u003eAnna whispered into Bernie’s ear. He held up his glass, “This is from Anna. To Meg, the girl who told me to tell Emma to stick it up her kazoo, when I told her she wouldn’t let me and Bernie date.”\u003c/p\u003e\n\u003cp\u003eI laughed and nodded. Kazoo was a weird word I swore she made up. I imagined she made up most of what she said.\u003c/p\u003e\n\u003cp\u003eI held up my glass, “To Meg, my sister. Thank you for showing me how to not take things so seriously.” I drank it back, knowing it wasn’t funny but it was true. She was always chewing a piece of grass and telling me to mind my business about Bernie and Anna. She was always telling me to just love both brothers and let them sort out the details. I drank back the last of my drink.\u003c/p\u003e\n\u003cp\u003e“How did you meet her?” Bernie asked.\u003c/p\u003e\n\u003cp\u003eI sniffled, “She saved my life. She saved me from something bad.”\u003c/p\u003e\n\u003cp\u003eBernie looks surprised, “She saved you?”\u003c/p\u003e\n\u003cp\u003eI nod, “We were with the others, in cages. I was about to be… next thing I knew, he was dead and there was little Meg cussing at me to hurry up and run away. She’d stabbed him in the side of his eye with a nail. She was a savage. She didn’t stop talking for days. Momma this, and momma that, and Auntie Heather, and Leo was sort of useless for a pet. He wasn’t as great as her precious hounds.” My eyes gloss over and I finish the drink, “She was one of my first friends, like a little sister.” I glance at Anna. She smiles and winks at me.\u003c/p\u003e\n\u003cp\u003eBernie smiles, “She was a genuinely-good person.”\u003c/p\u003e\n\u003cp\u003eJake laughs, “She was just crazy enough to be fun, but had more sense in one finger than anyone I’ve ever met.”\u003c/p\u003e\n\u003cp\u003eI laugh and hold my glass out with the last drink of the liquid, “To Meg.”\u003c/p\u003e\n\u003cp\u003eI wake the next morning stiff, achy, and hateful. My whole body is an angry mess. I climb from the bed filled with a snuggly eleven-year old and walk to the bathroom. I pull off my clothes and look at myself naked. I\u0027m a mess. Bruises, cuts, stitches, and dried blood.\u003c/p\u003e\n\u003cp\u003eI sigh and climb into the shower. The hot water is amazing. The soap stings everywhere, but every time I think about the pain, my brain chimes in and thinks, aren’t you lucky to be alive and feeling that pain. The cold hate feels lessened by the people in the house.\u003c/p\u003e\n\u003cp\u003eI climb out to find Sarah sitting in a corner in the bathroom. I wrap myself with a towel and walk to her. I drop to my knees, “You okay?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head, “I had a bad dream and then I woke up, and Andy was screaming and crying again.”\u003c/p\u003e\n\u003cp\u003eI hold my hand out to her, “Come on. I think I saw some of those packets of that sauce cook used to make you. I’ll see if Bernie can whip you up some home fries and that sauce. Maybe breakfast will help Andy too. Bernie had potatoes last time I was here.”\u003c/p\u003e\n\u003cp\u003eShe perks up and stands. I pull on clean clothes of Star’s and we go downstairs to try to start our day.\u003c/p\u003e\n\u003cp\u003eWe find only Jake in the kitchen, eating a bar. He smiles at me, “You look pretty.”\u003c/p\u003e\n\u003cp\u003eI laugh and nod, “You seen Bernie?”\u003c/p\u003e\n\u003cp\u003eHis eyes darken, “He’s in bed still.” I realize what that means and grimace, “Oh.”\u003c/p\u003e\n\u003cp\u003eHe gives me a look, “Trust me, he didn’t have much choice on the matter. He tried to be a gentleman last night after you went to bed.”\u003c/p\u003e\n\u003cp\u003eI put a hand up, “I don’t need to know.”\u003c/p\u003e\n\u003cp\u003eHe laughs, “Haven’t you ever heard that misery loves company?”\u003c/p\u003e\n\u003cp\u003eI smile, “I heard that before.”\u003c/p\u003e\n\u003cp\u003eSarah smiles brightly, “Me too.”\u003c/p\u003e\n\u003cp\u003eHe smirks, “It’s true.”\u003c/p\u003e\n\u003cp\u003eI nod toward Sarah, “You want to help me make some breakfast?”\u003c/p\u003e\n\u003cp\u003eHe smiles, “What are we having?”\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eBernie puts gold tacks on the places he knows for sure have camps or towns. It dawns on me, I don’t know anything about the world we live in.\u003c/p\u003e\n\u003cp\u003e“I didn’t know there were so many.”\u003c/p\u003e\n\u003cp\u003eHe looks up, “There are a lot of survivors, especially in the Midwest. The East Coast was completely destroyed in the tidal waves and hurricanes, but the winters were what got most of the people. The disease was worse there too, with the dense population and all.”\u003c/p\u003e\n\u003cp\u003eHe places a red felt dot on the towns he knows have Lord’s Keepers. “Here and here are the worst I’ve heard of. This place has some but it’s a mix of traders and Keepers.”\u003c/p\u003e\n\u003cp\u003eI look down, “I’ve seen them lots, always trying to get kids to come with them. I figured they were either perverts or just trying to help the children with no parents.”\u003c/p\u003e\n\u003cp\u003eHe nods, “I’m sure it’s a special mixture.”\u003c/p\u003e\n\u003cp\u003eI snort and cross my arms, “How will we get to them all?”\u003c/p\u003e\n\u003cp\u003eWill nods, “Same as we did with the breeder farms.”\u003c/p\u003e\n\u003cp\u003eI give him a look, “You haven’t been to the towns much, have you?”\u003c/p\u003e\n\u003cp\u003eHe furrows his dark brow, “Not a ton, why?”\u003c/p\u003e\n\u003cp\u003eI shrug, “There aren’t a lot of medical types who don’t know how to shoot a gun properly. Those people are survivors. They’re more like me and you.”\u003c/p\u003e\n\u003cp\u003eHis stare gets cold, “Then we should fit in famously.”\u003c/p\u003e\n\u003cp\u003eBernie looks like he’s thinking, “The thing you’re forgetting though, the townspeople want you to succeed. There’s talk of you and the rebellion.”\u003c/p\u003e\n\u003cp\u003eI frown, “The flashy crow isn’t going to get us anywhere with those people. Yeah, the ones who had family at the farms sure, but we’d have to free the work farms before any of them would really care. Women aren’t as important as men, not any more.”\u003c/p\u003e\n\u003cp\u003eBernie laughs, “Not since we went back to constantly barbecuing in a cave.”\u003c/p\u003e\n\u003cp\u003eI frown again but Will laughs. Anna gives me a confused look as she leaves the room. Star points at a spot in the middle, “There is a work camp right near there. I bet the majority of that town has family in the camps.”\u003c/p\u003e\n\u003cp\u003eBernie nods, still chuckling, “Right, we went there once. I remember that. When do we leave?”\u003c/p\u003e\n\u003cp\u003eI looked around, “We… is a bad move. We includes Sarah, Anna who can\u0027t talk, and Jake who is Jake. Bernie, no offense, but you aren’t exactly badass either.”\u003c/p\u003e\n\u003cp\u003eHe puts a hand in the air, “I’m good with staying. I don’t care what happens out there, never have.”\u003c/p\u003e\n\u003cp\u003eStar nods, “So me, you, and Will?”\u003c/p\u003e\n\u003cp\u003eI nod, “And Andy. We need to find him some people to take care of him. We could work that woman-slaver angle if we have to. I’ve seen that.” I wish I hadn’t.\u003c/p\u003e\n\u003cp\u003eJake shakes his head, “I’m coming. Leo still isn’t a hundred percent; he’s staying and Anna is never going to let you leave her here.”\u003c/p\u003e\n\u003cp\u003eAnna walks back in with a drink. I don’t meet her gaze, “I’m sure Bernie can take that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/reborn-born-3/page-11.html","bookId":1606,"creation":"Oct 5, 2019 5:58:05 PM","modification":"Oct 5, 2019 5:58:05 PM"}
