{"id":27974,"no":127,"title":"TO MRS. HAWTHORNE","content":"TO MRS. HAWTHORNE\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cdiv\u003e\n Salem, July 7th, 1848\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ownest, when thy letters come, I always feel as if I could not have done without them a moment longer. Thou must have received one from me since the date of thine, but I hope it will not weary thee to receive this brief scribblement. If my hand would only answer to my heart, what letters I should write thee! It is wonderful—the growth of our love! Six years ago, it seemed infinite; yet what was the love of that epoch to the present! Thou badest me burn two pages of thy last letter; but I cannot do it, and will not; for never was a wife\u0027s deep, warm, chaste love so well expressed, and it is as holy to me as the Bible. Oh, I cannot begin to tell how I love thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dearest, I should not forgive myself if I were to deprive the children of the country. Thou must keep them there as long as thou canst. When thou hast paid thy visit to Sarah Clark, I 195 must come and see thee in Boston, and if possible (and if I shall be welcome) will spend a Sunday there with thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There is no news. Miss Derby has finished her picture, and it is now being publicly exhibited. I have not yet seen it, but mean to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Pike is going to dine with me to-day, on green peas.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oh, for one kiss!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thy Lovingest Husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Did Julian have a tooth?—or what was the matter? Why did all the children have fever-fits? Why was Horace jumped in a wet sheet?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Sophia A. Hawthorne.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3050/84351.html","bookId":1014,"creation":"Aug 4, 2019 2:28:12 AM","modification":"Aug 11, 2019 1:30:09 PM"}
