{"id":27909,"no":62,"title":"TO MISS PEABODY","content":"\u0026nbsp;TO MISS PEABODY \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 54 Pinckney St., March 12th,—Sunday [1841]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My Life,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I have come back to thee! Thy heart gives thee no warning of my presence; yet I am here—embracing thee with all the might of my soul. Ah, forgetful Dove! How is it that thou hast had no spiritual intelligence of my advent? I am sure that if yearnings and strivings could have brought my spirit into communion with thine, thou wouldst have felt me within thy bosom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thou truest-Heart, thou art conscious of me, as much as a heavenly spirit can be, though the veil of mortality. Thou has not forgotten me for a moment. I have felt thee drawing me towards thee, when I was hundreds of miles away. The farther I went, the more was I conscious of both our loves. I cannot write how much I love thee, and what deepest trust I have in thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dearest, expect me at six o\u0027clock this afternoon. I have not the watch, as thou knowest, and so it 242 may be a few moments before or after six. Oh, I need thee this very, very moment—my heart throbs, and so does my hand, as thou mayst see by this scribble. God bless thee! I am very well.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thine Ownest Husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Sophia A. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n 13 West-street,\n\u003c/div\u003e \n\u003cdiv\u003e\n Boston.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3050/84286.html","bookId":1014,"creation":"Aug 4, 2019 2:28:12 AM","modification":"Aug 4, 2019 2:28:12 AM"}
