{"id":27855,"no":8,"title":"TO MISS PEABODY","content":"\u0026nbsp;TO MISS PEABODY \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Boston, Monday Eveg July 15th [1839]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My blessed Dove,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Your letter was brought to me at East Cambridge this afternoon:—otherwise I know not when I should have received it; for I am so busy that I know not whether I shall have time to go to the Custom-House these two or three days. I put it in my pocket, and did not read it till just now, when I could be quiet in my own chamber—for I always feel as if your letters were too sacred to be read in the midst of people—and (you will smile) I never read them without first washing my hands!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so my poor Dove is sick, and I cannot take her to my bosom. I do really feel as if I could cure her. [Portion of letter missing] Oh, my dearest, do let our love be powerful enough to make you well. I will have faith in its efficacy—not that it will work an immediate miracle—but it shall make you so well at heart that you cannot possibly be ill in the body. Partake of my 35 health and strength, my beloved. Are they not your own, as well as mine? Yes—and your illness is mine as well as yours; and with all the pain it gives me, the whole world should not buy my right to share in it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My dearest, I will not be much troubled, since you tell me (and your word is always truth) that there is no need. But, oh, be careful of yourself—remembering how much earthly happiness depends on your health. Be tranquil—let me be your Peace, as you are mine. Do not write to me, unless your heart be unquiet, and you think that you can quiet it by writing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n God bless mine own Dove. I have kissed those three last words. Do you kiss them too.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Sophia A. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n Care of Dr. N. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n Salem, Mass.\u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3050/84232.html","bookId":1014,"creation":"Aug 4, 2019 2:28:11 AM","modification":"Aug 4, 2019 2:28:11 AM"}
