{"id":27929,"no":82,"title":"TO MISS PEABODY","content":"\u0026nbsp;TO MISS PEABODY \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Brook Farm, Octr. 9th—Before Breakfast [1841]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Most dear,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here is thy husband trying to write to thee, while it is so dark that he can hardly see his own scribble—not that it is very early; for the sun is up long ago, and ought to be shining into my window. But this dismal gloom! I positively cannot submit to have this precious month all darkened with cloud and sullied with drizzle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dearest, I return the manuscript tale. It is pretty enough; but I doubt whether it be particularly suited to the American public; and, if intended for publication, I trust it will undergo a very severe revision. It will need it. I speak frankly about this matter; but I should do the same (only more frankly still) if the translation were my Dove\u0027s own.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I wonder whether Munroe has yet returned Grandfather\u0027s Chair to Elizabeth. I send back his books to-day. 61\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Belovedest, I think thou wilt see me in the latter half of next week. Thou needest not to give up any visit to South Boston on this account; for I cannot get to thee before twelve o\u0027clock. It will be but an hour or so\u0027s visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thine with deepest and keenest love,\n\u003c/div\u003e \n\u003cdiv\u003e\n Theodore De L\u0027Aubepine.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Sophia A. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n Care of Dr. N. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n Boston, Mass.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3050/84306.html","bookId":1014,"creation":"Aug 4, 2019 2:28:12 AM","modification":"Aug 4, 2019 2:28:12 AM"}
