{"id":27946,"no":99,"title":"TO MISS PEABODY","content":"\u0026nbsp;TO MISS PEABODY \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 54 Pinckney St.—June 30th.—morning [1842]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dearest Love,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thy sister Mary, after I left thee, told me that it was her opinion that we should not be married for a week longer. I had hoped, as thou knowest, for an earlier day; but I cannot help feeling that Mary is on the safe and reasonable side. Shouldst thou feel that this postponement is advisable, thou wilt find me patient beyond what thou thinkest me capable of. I will even be happy, if thou wilt only keep thy mind and heart in peace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Belovedest, didst thou sleep well, last night? My pillow was haunted with ghastly dreams, the details whereof have flitted away like vapors, but a strong impression remains about thy being magnetised. God save me from any more such! I awoke in an absolute quake. Dearest, I cannot oppose thy submitting to so much of this influence as will relieve thy headache; but, as thou lovest me, do not suffer thyself to be put to sleep. My 104 feeling on this point is so strong, that it would be wronging us both to conceal it from thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My ownest, if it will at all reconcile thee to the ceremony, I will go to Concord, tomorrow or next day, and see about our affairs there. I would even go there and live alone, if thou didst bid me though I shall be much happier in lingering here, and visiting thy couch every evening, and hearing thee say that thou art better than the night before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What a sweet morning is this; it makes me feel bright and hopeful, after the troubles of the night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thine Ownest Husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n P.S. I enclose an order for a case of mine, which is to be given to the baggage-wagoner, when he comes for the furniture. He can present it, and receive the case.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n P.S. 2d. I love thee! I love thee! I love thee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n P.S. 3d. Dost thou love me at all?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Sophia A. Peabody,\n\u003c/div\u003e \n\u003cdiv\u003e\n 13 West-street,\n\u003c/div\u003e \n\u003cdiv\u003e\n Boston.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3050/84323.html","bookId":1014,"creation":"Aug 4, 2019 2:28:12 AM","modification":"Aug 4, 2019 2:28:12 AM"}
