{"id":86604,"no":14,"title":"Page 14","content":"\u003cp\u003e\"Here\u0027s the deal,\" I say low and harsh as I grab his shirt and twist it up close to his throat. \"You stop bringing up Maggie or jail or the accident. Got it? If you want to keep running your mouth off, that\u0027s fine, but next time you do it you\u0027ll find my fist in it. Guaranteed.\"\u003c/p\u003e\n\u003cp\u003e\"I was just kidding,\" Drew chokes out, a faint thread of hysteria in his voice. \"Jeez, Caleb, lighten up.\"\u003c/p\u003e\n\u003cp\u003eI let go of his shirt, but give him one last warning. \"Up until two weeks ago I was living with a bunch of gang members. Don\u0027t tell me to lighten up.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s Thursday night, five days after the festival. I\u0027m in Kendra\u0027s bedroom while her parents are at some dinner function. We\u0027re supposed to study; we\u0027ve both got tests tomorrow.\u003c/p\u003e\n\u003cp\u003eUnfortunately, I realized about a half hour ago she\u0027s not interested in studying. Kendra is strutting in front of me, modeling different outfits she bought at the mall yesterday. \"Well ...\" she says, showing off a designer dress. \"What do you think?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m busy reading about the Magna Carta. \"I can\u0027t flunk this test, Kend.\"\u003c/p\u003e\n\u003cp\u003eShe puts her hands on her hips and pouts. \"I swear you pay more attention to the girls at school than you do to me.\"\u003c/p\u003e\n\u003cp\u003eI look up from my book. \"Are you kidding me?\"\u003c/p\u003e\n\u003cp\u003e\"No. Samantha Hunter is, like, lusting after you during gym class and you\u0027re falling for it. And I heard you and Emily Steinway were having a pretty intense conversation in biology.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t said two words to Samantha, Kend. And Emily and I are bio partners. What are you doing, spying on me? I\u0027d be glad to tell everyone we\u0027re back together. You\u0027re the one who wants to keep our relationship a damn secret.\"\u003c/p\u003e\n\u003cp\u003eThis week we\u0027ve met at the forest preserve, under the high school bleachers, and now I had to enter her house through the back door so none of her neighbors would see me coming in. I\u0027m sick of sneaking around.\u003c/p\u003e\n\u003cp\u003e\"I told you my father is up for election in November, Caleb. His daughter can\u0027t be seen dating an ex-con.\"\u003c/p\u003e\n\u003cp\u003eShe says it so easily. There\u0027s not a speck of apology or hesitation in her voice as she spurts out the word \"ex-con.\"\u003c/p\u003e\n\u003cp\u003e\"I gotta go,\" I say, then close my history book.\u003c/p\u003e\n\u003cp\u003eShe comes toward me, placing her hand on my chest. \"Don\u0027t go. I\u0027ll make it worth your while.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003eShe slowly pulls the spaghetti straps off her shoulder, revealing bare skin. A few seconds later she\u0027s stripped her dress off and is standing in front of me wearing only a black lace bra and matching thong.\u003c/p\u003e\n\u003cp\u003eMy gaze travels over her creamy white skin. Hell, yeah, I want this. But she\u0027s not acting like a girlfriend. She doesn\u0027t have to strip to keep me here. She doesn\u0027t have to use her body to lure me. This is so fucked up. \"Kendra ...\"\u003c/p\u003e\n\u003cp\u003eShe steps toward me, putting her finger on my lips to stop me from talking. \"Shh, I hear my parents in the hallway,\" she whispers.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eSure enough there\u0027s a knock on her bedroom door a second later. \"Kendra, you home?\" her mom says through the door.\u003c/p\u003e\n\u003cp\u003e\"Uh, yeah,\" Kendra says loudly as she picks up her discarded dress. \"Caleb, get in the closet,\" she whispers.\u003c/p\u003e\n\u003cp\u003eThis is seriously not happening. \"I\u0027m not getting in the closet,\" I say. There\u0027s no way I\u0027m going to get locked up again, even in my girlfriend\u0027s closet instead of a cell.\u003c/p\u003e\n\u003cp\u003e\"Shh, they\u0027re going to hear you.\"\u003c/p\u003e\n\u003cp\u003eHer mom knocks again and says, \"Who are you talking to? Kendra, open the door.\"\u003c/p\u003e\n\u003cp\u003eKendra scurries to get her dress back on. \"Nobody, Mom, I just have the radio on. I\u0027m getting dressed. I\u0027ll be out in a minute, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Hurry up. Senator Boyle came all the way back here to meet you,\" her mom says, then I hear footsteps moving away from the door.\u003c/p\u003e\n\u003cp\u003e\"When are you going to tell them we\u0027re together?\" I ask Kendra. \"After the election?\"\u003c/p\u003e\n\u003cp\u003e\"Can we talk about that later?\" she whispers as she quickly checks out her appearance in her mirror. I watch as she rolls massive amounts of lip gloss on her lips. Cherry flavor wafts to my nostrils and I wonder how long I can be stuck in this cherry-scented room before I pass out.\u003c/p\u003e\n\u003cp\u003eI open the window.\u003c/p\u003e\n\u003cp\u003e\"Caleb, what are you doing?\"\u003c/p\u003e\n\u003cp\u003eI throw my history book to the ground below, praying it\u0027ll still be intact when I retrieve it. Then I heave one foot over the ledge. \"Leaving.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a two-story house. You\u0027ll kill yourself.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m not about to hide in her room like a prisoner. Besides, if I jump hard enough and high enough, I just might be able to catch a branch on the tree a few feet away from the window.\u003c/p\u003e\n\u003cp\u003eShe runs toward me. \"Don\u0027t, CB.\"\u003c/p\u003e\n\u003cp\u003eI stare right into her blue eyes. Why, not? Because you love me, because you don\u0027t want me to get hurt... because you want to take me downstairs and announce to your parents and their friends that no matter what happened in the past, we\u0027re together and nobody can separate us?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get into trouble if they see you,\" she announces.\u003c/p\u003e\n\u003cp\u003e\"See you on the other side,\" I say to Kendra before standing on the window ledge, saying a quick prayer, and taking a leap.\u003c/p\u003e\n\u003cp\u003eTWENTY\u003c/p\u003e\n\u003cp\u003eMaggie\u003c/p\u003e\n\u003cp\u003eMrs. Reynolds is waiting for me on the back swing with the muumuu in hand when I get to her house, just like she\u0027s done since my first day on the job. I tried protesting the offending garment with no success. So now I put it on and look like a complete dork as I\u0027m working.\u003c/p\u003e\n\u003cp\u003eIt\u0027s not like I need to worry about looking good, anyway. Caleb and his friends said the only way I\u0027d even get a date for prom was to advertise on the internet. I heard them at the Fall Festival talking about me. I cried that night because I can\u0027t turn back the clock and erase what happened. Caleb stood there with the guys as if he had nothing to do with making me this way. His non-reaction hurt more than Drew\u0027s words.\u003c/p\u003e\n\u003cp\u003e\"Today we\u0027re going to clean the attic,\" Mrs. Reynolds announces. \"Here, take this broom. I\u0027ll bring the dustpan and pail.\"\u003c/p\u003e\n\u003cp\u003e\"What about planting bulbs?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sick of looking at bulbs. We can continue planting tomorrow.\"\u003c/p\u003e\n\u003cp\u003eShe leads me up the stairway to the attic. \"Don\u0027t close the door, it\u0027ll lock us in.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s dangerous,\" I say. And scary, like something out of a horror movie. There\u0027s a door stopper that she puts in place before we enter. It\u0027s a small, dark place filled with boxes and pictures and ... spider webs. \"Mrs. Reynolds?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Margaret.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid of spiders.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because they have eight creepy legs, they bite, and they have sticky string that comes out of their butts to capture bugs before they suck their blood.\"\u003c/p\u003e\n\u003cp\u003eI think Mrs. Reynolds is going to laugh at me. But she doesn\u0027t. Instead she says, \"Spiders control the insect population. They\u0027re a necessity and that\u0027s all there is to it.\"\u003c/p\u003e\n\u003cp\u003eWhile that might be true, I still don\u0027t like them. But that doesn\u0027t stop Mrs. Reynolds from leading me farther into the attic--pail, dustpan and all. I\u0027m ready to go into a rendition of \"It\u0027s a Hard Knock Life.\" I look around. This attic is definitely creepy--large trunks in one corner and moving boxes in the other.\u003c/p\u003e\n\u003cp\u003eMrs. Reynolds finds an old chair and sits in it. \"You can start by dusting the trunks first.\"\u003c/p\u003e\n\u003cp\u003eThank God those are in the middle of the floor, untouched by webs. The old lady is totally prepared. She pulls a rag and a can of Endust out of the pail. I spray the top of a wooden trunk, cleaning it until it shines.\u003c/p\u003e\n\u003cp\u003e\"Open it,\" Mrs. Reynolds says.\u003c/p\u003e\n\u003cp\u003eI look at her, unsure. Go on.\u003c/p\u003e\n\u003cp\u003eI unhook the latch, lift the top, and peer inside.\u003c/p\u003e\n\u003cp\u003eThe first thing I see is a framed picture of a man and woman. \"Is this you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, with my late husband, Albert, may he rest in peace.\"\u003c/p\u003e\n\u003cp\u003eIn the picture a much younger Mrs. Reynolds is wearing a knee-length tailored dress and satin gloves that go up over her elbows. Mr. Reynolds isn\u0027t even looking into the camera, he\u0027s gazing at Mrs. Reynolds as if she were a rare diamond. \"Did you get married young?\"\u003c/p\u003e\n\u003cp\u003e\"I was twenty and he was twenty-four. We were very much in love.\"\u003c/p\u003e\n\u003cp\u003eI hand the picture to her. \"I wish my parents loved each other. They\u0027re divorced.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, well, life does keep going on, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Yep.\" Even after the accident, when I knew I\u0027d never be able to walk normally again or play tennis anymore, life kept rolling on.\u003c/p\u003e\n\u003cp\u003eWhether I wanted it to or not.\u003c/p\u003e\n\u003cp\u003eMrs. Reynolds leans over and studies more pictures. \"I\u0027ve spent a little time with your mother at Auntie Mae\u0027s,\" she says while studying a picture of a little boy. \"She\u0027s a lovely lady.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I say, proud of Mom. She\u0027s cool, for a mom. I just wish my dad thought she was lovely enough to want to stay married to her.\u003c/p\u003e\n\u003cp\u003eMrs. Reynolds hands me the picture of the little boy. \"That\u0027s my son.\"\u003c/p\u003e\n\u003cp\u003eI almost laugh at the picture. Who thought this little boy would grow up and one day be my mom\u0027s boss?\u003c/p\u003e\n\u003cp\u003e\"He was married once. She died of ovarian cancer five years later.\" She sighs.\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t have any kids?\" I ask.\u003c/p\u003e\n\u003cp\u003eShe shakes her head. \"Okay, enough dawdling. I have a bunch of boxes that need to be tossed. Why don\u0027t we pile them in a corner so they can easily be spotted and taken to the trash. Somewhere around here are boxes labeled \u0027taxes\u0027.\" She points to one of the corners of the attic. \"I think they\u0027re over there.\"\u003c/p\u003e\n\u003cp\u003eI walk over to the boxes and do the spider-scan. Eek. Webs line the ceiling corners, just waiting for an unsuspecting insect to fly by. I don\u0027t even see the spiders. It\u0027s like they\u0027re undercover spies until their prey struggles, hopelessly stuck in the web.\u003c/p\u003e\n\u003cp\u003eI shudder just thinking about it. Thank God I\u0027m not an insect.\u003c/p\u003e\n\u003cp\u003e\"Margaret?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m getting older every second, you know.\"\u003c/p\u003e\n\u003cp\u003eI put my hands in the sleeves of the muumuu and shove boxes aside with muumuu-covered fists. I\u0027m trying not to think about my leg and how I\u0027m going to maneuver around the boxes with spiders staring down at me from the ceiling.\u003c/p\u003e\n\u003cp\u003eI\u0027ve made a path and head behind the stack of boxes. I check out an orange, plastic container made to look like a picnic basket. \"What kind of boxes are they? Bankers boxes or moving boxes?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t remember, but I\u0027m pretty certain they\u0027re labeled.\"\u003c/p\u003e\n\u003cp\u003eOkay. I start turning boxes around, hoping to find the words TAXES on the front.\u003c/p\u003e\n\u003cp\u003eI shriek when I hear something behind me.\u003c/p\u003e\n\u003cp\u003eSpinning around, I see it\u0027s only Mrs. Reynolds.\u003c/p\u003e\n\u003cp\u003e\"Oh, calm yourself,\" she chides. \"Did you find any?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\" I pick up a box marked TAXES, 1968. \"Is this one?\"\u003c/p\u003e\n\u003cp\u003eShe claps her hands, like a teacher would do if a student gets an answer correct. \"Yes. Put it by the door. There\u0027s so many to toss, I think this may take a few days.\"\u003c/p\u003e\n\u003cp\u003eAs soon as I place the first box in the \"toss\" pile, the doorbell rings. Mrs. Reynolds doesn\u0027t hear it. \"Someone\u0027s ringing the doorbell,\" I say.\u003c/p\u003e\n\u003cp\u003eShe furrows her brows and tilts her head to listen for it. \"I don\u0027t hear it, but then again these ears are about as good as my eyes. Be a doll and answer it, would you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\" I head down the stairs. The doorbell rings two more times before I can get to the door. I open it quickly, then stumble backwards. Because the last person I expected to see standing in front of me is Caleb Becker. \u003c/p\u003e","sourceLink":"https://allnovel.net/leaving-paradise-leaving-paradise-1/page-14.html","bookId":2771,"creation":"Oct 5, 2019 5:16:18 PM","modification":"Oct 5, 2019 5:16:18 PM"}
