{"id":87444,"no":17,"title":"Page 17","content":"\u003cp\u003e“She just dropped me and Caulder off. Said she would be back in a couple of hours. She wants you to order pizza.”\u003c/p\u003e\n\u003cp\u003eIf I’d have been home a few minutes sooner, I would have followed her. “Did she say where she was going?” I ask him.\u003c/p\u003e\n\u003cp\u003e“Can you ask them to put the pepperonis under the sauce this time?” He asks.\u003c/p\u003e\n\u003cp\u003e“Where\u0027d she say she was going?”\u003c/p\u003e\n\u003cp\u003e“No, wait. Tell them to put the pepperonis on first, then the cheese, then the sauce on top.”\u003c/p\u003e\n\u003cp\u003e“Dammit, Kel! Where did she go?”\u003c/p\u003e\n\u003cp\u003eHis eyes grow wide as he climbs off the stool and walks backward toward the front door. He slumps his shoulders as he slips his shoes on. I\u0027ve never cussed at him before.\u003c/p\u003e\n\u003cp\u003e“Know don’t I. Caulder’s to going I’m.”\u003c/p\u003e\n\u003cp\u003e“Be back by six, I’ll have your pizza.”\u003c/p\u003e\n\u003cp\u003eI decide to knock my homework out first. Mr. Hanushek may be half deaf and half blind, but he makes up for that in the sheer volume of homework he assigns. I finish within an hour. It’s just four-thirty.\u003c/p\u003e\n\u003cp\u003eI take this opportunity to play detective. Whatever she’s up to and whoever she’s with, I’m determined to find out. I rummage through kitchen drawers, cabinets, hallway closets. Nothing. I’ve never snooped in my parent’s room before. Ever. This is definitely a year of firsts though, so I let myself in and close the door behind me.\u003c/p\u003e\n\u003cp\u003eEverything is the same as it was in their old bedroom. Same furniture, same beige carpet. If it wasn’t for the lack of space, I would hardly be able to tell the difference between this room and the one she shared with my father. I check the obvious first; the underwear drawer. I don’t find anything. I move to the edge of the bed and slide open the drawer to her nightstand. Eye mask, pen, lotion, book, note-\u003c/p\u003e\n\u003cp\u003eNote.\u003c/p\u003e\n\u003cp\u003eI slip it out of the drawer and open it. It’s written in black ink, centered down the page. It’s a poem.\u003c/p\u003e\n\u003cp\u003eJulia,\u003c/p\u003e\n\u003cp\u003eI’ll paint you a world one day\u003c/p\u003e\n\u003cp\u003eA world where smiles don’t fade\u003c/p\u003e\n\u003cp\u003eA world where laughter is played\u003c/p\u003e\n\u003cp\u003eIn the background\u003c/p\u003e\n\u003cp\u003eLike a P.S.A.\u003c/p\u003e\n\u003cp\u003eI’ll paint it when the sun goes down\u003c/p\u003e\n\u003cp\u003eWhile you’re lying there in your gown\u003c/p\u003e\n\u003cp\u003eThe moment your smile turns around\u003c/p\u003e\n\u003cp\u003eI’ll paint right over your frown\u003c/p\u003e\n\u003cp\u003eI’ll be finished when the sun breaks in\u003c/p\u003e\n\u003cp\u003eYou’ll wake with a still-wet grin\u003c/p\u003e\n\u003cp\u003eYou’ll see that I finish what I begin\u003c/p\u003e\n\u003cp\u003eThe world I’ve painted on your chin…\u003c/p\u003e\n\u003cp\u003eIt’s pathetic. The world I’ve painted on your chin? Like a P.S.A.? What is that, anyway? Public service announcement? Who rhymes with acronyms? Whoever he is, I don’t like him. I hate him. I fold the note up and put it back in its place.\u003c/p\u003e\n\u003cp\u003eI call Getty’s and order two pizzas. Mom is pulling up in the driveway when I hang up the phone. Perfect opportunity for a shower. I lock myself in the bathroom before she makes it inside. I don’t want to see the look on her face. That look of ‘falling in love.\u0027\u003c/p\u003e\n\u003cp\u003e“What the hell?” my mother says when she opens up the box of pizza.\u003c/p\u003e\n\u003cp\u003e“That’s Kel’s. It’s backwards,” I tell her. She rolls her eyes as she pulls the second box toward her. It makes me cringe how her eyes scroll over all the slices of pizza like she’s trying to find the one that tastes the best. They’re all slices from the same pizza!\u003c/p\u003e\n\u003cp\u003e“Just pick one!” I snap.\u003c/p\u003e\n\u003cp\u003eShe flinches. “Jeez, Lake. Have you eaten today? Quite the crab, are we?” She picks up a slice and thrusts it toward me. I throw it on my plate and plop down at the bar just as Kel comes running in backwards.\u003c/p\u003e\n\u003cp\u003e“Here pizza the is?” he asks, just as he trips over the rug and lands on his butt.\u003c/p\u003e\n\u003cp\u003e“God Kel, grow up!” I snap.\u003c/p\u003e\n\u003cp\u003eMy mother shoots me a look. “Lake! What is your problem? Is there something you need to talk about?”\u003c/p\u003e\n\u003cp\u003eI push my pizza across the table and get up from the bar. I can’t pretend anymore.\u003c/p\u003e\n\u003cp\u003e“No, Mother! There’s nothing I need to talk about. I don’t keep secrets!”\u003c/p\u003e\n\u003cp\u003eShe sucks in a small gasp of air. This is it-she knows I know.\u003c/p\u003e\n\u003cp\u003eI expect her to defend herself, yell at me, put up a fight, send me to my room. Something. Isn’t that what happens when things come to fruition? The climax?\u003c/p\u003e\n\u003cp\u003eInstead, she simply looks away and grabs a plate for Kel, filling it with slices of backward pizza.\u003c/p\u003e\n\u003cp\u003eI march to my room and slam the door. Again. Who knows how many doors I’ve slammed since we moved here. I’m constantly leaving or entering rooms pissed off at someone. Will slams poems, I slam doors.\u003c/p\u003e\n\u003cp\u003eThe alarm clock is flashing red when I wake up. The power must have gone out overnight. The sun is unusually bright for this early in the morning so I grab my phone to check the time and sure enough, we slept in. I jump out of bed and throw on my clothes, brush my teeth and pull my hair on top of my head. No time for makeup. I wake Kel up and rush him to get dressed as I gather my homework. No time for coffee either.\u003c/p\u003e\n\u003cp\u003e“But I ride to school with Caulder in the mornings,” Kel whines as we pull our jackets on.\u003c/p\u003e\n\u003cp\u003e“Not today. We slept in.”\u003c/p\u003e\n\u003cp\u003eIt’s apparent we aren’t the only ones who slept in when I see Will’s car still in his driveway. Great! I can’t just leave and not wake them up.\u003c/p\u003e\n\u003cp\u003e“Kel, go knock on their door and wake them up.”\u003c/p\u003e\n\u003cp\u003eKel runs across the street and beats on the door as I climb inside my jeep and crank it. I turn the heater up full blast and grab the scraper and start wiping the frost away from the windows. I get the final window cleared when Kel returns.\u003c/p\u003e\n\u003cp\u003e“No one answered the door. I think they’re still asleep.”\u003c/p\u003e\n\u003cp\u003eUgh! I hand the scraper to Kel and tell him to get inside the jeep as I walk to Will’s house. Kel already tried the front door so I walk to the side of the house that the bedrooms are on. I don’t know which one is Will’s, so I knock on all three windows just to be sure I wake someone up.\u003c/p\u003e\n\u003cp\u003eAs I round the front of the house, the front door swings open and Will is standing there, shielding his eyes from the sun, shirtless. My hands have touched those abs before. I force myself to look away.\u003c/p\u003e\n\u003cp\u003e“Power went out. We slept in,” I tell him. ‘We’ feels odd. It’s like I’m insinuating we’re a team.\u003c/p\u003e\n\u003cp\u003e“What?” he says groggily as he rubs his face. “What time is it?”\u003c/p\u003e\n\u003cp\u003e“Almost eight.”\u003c/p\u003e\n\u003cp\u003eHe immediately perks up.\u003c/p\u003e\n\u003cp\u003e“Shit!” he says as he remembers something. “I’ve got a conference at eight!”\u003c/p\u003e\n\u003cp\u003eHe turns back inside but leaves the door open. I peek my head further inside but don’t dare step over the threshold.\u003c/p\u003e\n\u003cp\u003e“Do you need me to take Caulder to school?” I yell after him.\u003c/p\u003e\n\u003cp\u003eHe reappears from the hallway.\u003c/p\u003e\n\u003cp\u003e“Would you? Can you? You don’t mind?” He’s really frantic. He’s got a tie around his neck, but still no shirt.\u003c/p\u003e\n\u003cp\u003e“I don’t mind. Which one is his room? I’ll get him ready.”\u003c/p\u003e\n\u003cp\u003e“Oh. Yeah. That would be great. Thanks. First one on the left. Thank you.” He disappears down the hallway again.\u003c/p\u003e\n\u003cp\u003eI go to Caulder’s room and shake him awake. “Caulder I’m taking you to school. You need to get dressed.”\u003c/p\u003e\n\u003cp\u003eI assist Caulder while he gets ready, catching glimpses of Will running back and forth. The front door eventually shuts, followed by a car door. He’s gone. I’m in his house. Awkward.\u003c/p\u003e\n\u003cp\u003e“Ready, buddy?”\u003c/p\u003e\n\u003cp\u003e“I’m hungry.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah. Food. Let me see.” I rummage through cabinets in Will’s kitchen. The canned goods are stacked according to their labels. There’s an abundance of pasta. It’s easy enough to cook I guess. Everything’s so clean. Not like most twenty-one year old guys. I locate some pop tarts above the fridge and grab one for both Kel and Caulder.\u003c/p\u003e\n\u003cp\u003eI’m half an hour late for first period so I decide to sit it out in my jeep. That’s two classes in two days. I’m becoming a real rebel.\u003c/p\u003e\n\u003cp\u003eI take my seat in history and Eddie swings in behind me.\u003c/p\u003e\n\u003cp\u003e“You skip math and you don’t take me with you?” she whispers from behind me.\u003c/p\u003e\n\u003cp\u003eI turn around and she draws her neck in and pouts.\u003c/p\u003e\n\u003cp\u003e“Oh. You slept in.”\u003c/p\u003e\n\u003cp\u003eMakeup. I forgot to bring my makeup. Eddie reaches into her purse and pulls out a cosmetic bag. She can read my mind. Isn’t that what best friends do?\u003c/p\u003e\n\u003cp\u003e“My hero,” I say as I take it from her and turn around. I pull lipstick and mascara out, along with a mirror. I apply it quickly and hand her the bag back.\u003c/p\u003e\n\u003cp\u003eAs we walk into third period, Will makes eye contact with me as he mouths, “thank you.” I smile and shrug my shoulders, letting him know it wasn’t a big deal. Eddie pinches my arm as she walks past me, letting me know she saw our exchange.\u003c/p\u003e\n\u003cp\u003eYou wouldn’t know by looking at him that Will got ready in less than three minutes. His black pants are wrinkle-free, his white shirt tucked in at the waist. His tie…oh my god, his tie. I let out a laugh and he glances in my direction. He must not have noticed he put his tie on first this morning; it’s barely visible underneath his white shirt. I tug at the collar of my shirt and point to him. He glances down and pats his chest where his tie should be. He laughs as he turns and faces the chalkboard and corrects his wardrobe malfunction. The other students were still taking their seats and chatting, but I know Eddie saw what just happened. I can feel her staring a hole into my back.\u003c/p\u003e\n\u003cp\u003eNick throws himself into the seat next to me at lunch. Eddie is sitting right across from me. I expect her to give me the eye but she doesn’t, she’s just as exuberant as ever. She already knows too much. I’m afraid she may assume it’s more than it is. I was late for school today; Will obviously got dressed in a hurry. She has every right to bombard me with questions but she doesn’t. I respect her for that-for respecting me.\u003c/p\u003e\n\u003cp\u003e“New Girl, what time we leavin’?” Nick asks as he’s piling his food together.\u003c/p\u003e\n\u003cp\u003e“I don’t know. Who’s driving?”\u003c/p\u003e\n\u003cp\u003e“I’ll drive,” Gavin says.\u003c/p\u003e\n\u003cp\u003eNick looks up at Gavin. “No way, man. We’re taking my dad’s car. No way I’m riding in Monte Car-no.”\u003c/p\u003e\n\u003cp\u003e“Monte Car-no?” I look at Gavin.\u003c/p\u003e\n\u003cp\u003e“My car,” Gavin replies.\u003c/p\u003e\n\u003cp\u003e“What’s your address Layken?” Eddie asks. I’m shocked she failed to obtain it the first time we met.\u003c/p\u003e\n\u003cp\u003e“Oh I know where she lives,” Nick says. “I gave her a ride home. Same street as Mr. Cooper. We’ll pick her up last.”\u003c/p\u003e\n\u003cp\u003eHow does Nick know that? I flush as I glance down to my tray and stir my mashed potatoes, attempting to seem oblivious to Eddie’s stare.\u003c/p\u003e\n\u003cp\u003eNick and Gavin are both sitting in the front seat so I take the backseat with Eddie. When I climb in she smiles a friendly smile. She’s not going to press me. I breathe a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Layken, we need your help,” Gavin says. “Settle something for us will ya?”\u003c/p\u003e\n\u003cp\u003e“I like disputes. Shoot,” I say as I put on my seatbelt.\u003c/p\u003e\n\u003cp\u003e“Nick here thinks Texas is nothing but tornadoes. He says they don’t have hurricanes because there’s no beach. School him.”\u003c/p\u003e\n\u003cp\u003e“Well, he’s wrong on both counts,” I say. \u003c/p\u003e","sourceLink":"https://allnovel.net/slammed-slammed-1/page-17.html","bookId":2779,"creation":"Oct 5, 2019 5:22:11 PM","modification":"Oct 5, 2019 5:22:11 PM"}
