{"id":87458,"no":31,"title":"Page 31","content":"\u003cp\u003eMy hands grip the edges of the dryer as I slide off with a jerk. \"Will?\" I say as I take a step toward him.\u003c/p\u003e\n\u003cp\u003eThe light from the kitchen casts a shadow across his face but I can see his jaw-it\u0027s clenched. His eyes are full of shame as he looks at me apologetically.\u003c/p\u003e\n\u003cp\u003e\"Will? Tell me. Do the rules still apply?\"\u003c/p\u003e\n\u003cp\u003eHe doesn\u0027t have to answer me-I can tell by his reaction that they do.\u003c/p\u003e\n\u003cp\u003e\"Lake,\" he says quietly. \"I had a weak moment, I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003eI shove my hands into his chest.\u003c/p\u003e\n\u003cp\u003e\"A weak moment? That\u0027s what you call this? A weak moment?\" I yell. \"What were you gonna do, Will? When were you gonna stop making out with me and kick me out of your house this time?\" I spin and turn out of the laundry room and make my way through the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Lake, don\u0027t. I\u0027m sorry. I\u0027m so sorry. It won\u0027t happen again, I swear.\"\u003c/p\u003e\n\u003cp\u003eI stop and turn toward him. \"You\u0027re damn right it won\u0027t! I finally accepted it, Will. After an entire month of torture, I was finally able to be around you again. Then you go and do this! I can\u0027t do it anymore,\" I cry. \"The way you consume my mind when we aren\u0027t together? I don\u0027t have time for it anymore. I\u0027ve got more important things to think about now than your little weak moments.\"\u003c/p\u003e\n\u003cp\u003eI cross the living room and open the front door and pause. \"Get me the measuring tape,\" I say calmly.\u003c/p\u003e\n\u003cp\u003e\"Wh-what?\" he says.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s on the damn floor! Get me the measuring tape!\"\u003c/p\u003e\n\u003cp\u003eI hear his footsteps fade as he walks to the laundry room. He retrieves the measuring tape and brings it back to me. As he places it in my grasp, he squeezes my hand.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make me the bad guy, Lake. Please.\"\u003c/p\u003e\n\u003cp\u003eI pull my hand away from his. \"Well you\u0027re certainly not the martyr, anymore.\"\u003c/p\u003e\n\u003cp\u003eI turn and walk out, slamming the door behind me. I cross the street and don\u0027t look back to see if he\u0027s watching me. I don\u0027t care anymore.\u003c/p\u003e\n\u003cp\u003eI pause at our entryway and take a deep breath as I wipe my eyes. I open the front door to our home, put a smile across my face, and help my mother make her very last Halloween costumes.\u003c/p\u003e\n\u003cp\u003e19.\u003c/p\u003e\n\u003cp\u003e“Ain’t it like most people\u003c/p\u003e\n\u003cp\u003eI’m no different\u003c/p\u003e\n\u003cp\u003eWe love to talk on things\u003c/p\u003e\n\u003cp\u003eWe don’t know about.”\u003c/p\u003e\n\u003cp\u003e-The Avett Brothers, 10,000 words\u003c/p\u003e\n\u003cp\u003eChapter Nineteen\u003c/p\u003e\n\u003cp\u003eWill and Caulder end up going out of town after all. Mom and I spend most of Saturday and Sunday putting the finishing touches on the costumes. I let my mother know about Will\u0027s schedule and how we\u0027ll be helping them out more. As pissed as I am, I don\u0027t want Caulder and Kel to have to suffer. Sunday night when Will gets home I don\u0027t even notice; because I don\u0027t even care.\u003c/p\u003e\n\u003cp\u003e\"Kel, call Caulder and tell him he can come over and put his costume on,\" I say as I drag Kel out of bed. \"Will has to leave early anyway. He can get ready over here.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s Halloween, day of the cancerous lungs. Kel runs to the kitchen and grabs the phone.\u003c/p\u003e\n\u003cp\u003eI take a shower and finish getting ready, then wake my mother up so she can see the end results. After she gets dressed, under instruction from Caulder and Kel, she closes her eyes. I walk her into the living room and position her in front of the two boys.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" Caulder says. \"What about Will? He needs to see us, too.\"\u003c/p\u003e\n\u003cp\u003eI usher my mother back into the hallway as I run to the front door, throw on my boots and go outside. He\u0027s pulling out of his driveway so I flag him down. I can see by the look on his face that he\u0027s hoping I\u0027ve forgiven him. I immediately cease any false hope.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re still an asshole, but your brother wants you to see his costume. Come in for a second.\" I return to the house.\u003c/p\u003e\n\u003cp\u003eWhen Will walks in I position him and my mother in front of the boys and tell them to open their eyes.\u003c/p\u003e\n\u003cp\u003eKel is the right lung, Caulder is the left. The stuffed material is shaped so that their arms and head fit through small openings and the bottom is open to their waste and legs. We dyed the material so that it would reflect dead spots here and there. There are larger lumps protruding from the lungs in various places-the tumors. There is a long pause before Will and my mother react.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s disgusting,\" Will says.\u003c/p\u003e\n\u003cp\u003e\"Repulsive,\" my mother adds.\u003c/p\u003e\n\u003cp\u003e\"Hideous,\" I say.\u003c/p\u003e\n\u003cp\u003eThe boys high five. Or, rather, the lungs high five. After we take pictures, I load them up in the jeep and I drop the pair of lungs off at school.\u003c/p\u003e\n\u003cp\u003eI\u0027m not even halfway through second period when my phone starts vibrating. I pull it out of my pocket and look at the number. It\u0027s Will. Will never calls me. I assume he\u0027s trying to apologize so I put the phone back in my jacket. It vibrates again. He\u0027s calling again. I turn and look at Eddie.\u003c/p\u003e\n\u003cp\u003e\"Will keeps calling me, should I answer?\" I say. I don\u0027t know why I\u0027m asking her. Maybe she\u0027s got some great advice.\u003c/p\u003e\n\u003cp\u003e\"I dunno,\" she says.\u003c/p\u003e\n\u003cp\u003eMaybe not.\u003c/p\u003e\n\u003cp\u003eOn his third attempt, I press the send button and put the phone to my ear. \"Hello?\" I whisper.\u003c/p\u003e\n\u003cp\u003e\"Layken, it\u0027s me. Look, you\u0027ve got to get to the elementary. There\u0027s been an incident and I can\u0027t get through to your mom. I\u0027m in Detroit, I can\u0027t go.\"\u003c/p\u003e\n\u003cp\u003e\"What? With who?\" I whisper.\u003c/p\u003e\n\u003cp\u003e\"Both of them, I guess. They aren\u0027t hurt; they just need someone to pick them up. Go! Call me back.\"\u003c/p\u003e\n\u003cp\u003eI quietly excuse myself from the classroom. Eddie follows me.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" she says as we walk into the hallway.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Something with Kel and Caulder,\" I say.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going with you,\" she says.\u003c/p\u003e\n\u003cp\u003eWhen we arrive at the school, I sprint inside. I\u0027m out of breath and on the verge of hysteria when we find the office. Kel and Caulder are both sitting in the lobby.\u003c/p\u003e\n\u003cp\u003eMy feet won’t move fast enough as I run to them and hug them.\u003c/p\u003e\n\u003cp\u003e\"Are y\u0027all okay? What happened?\"\u003c/p\u003e\n\u003cp\u003eThey both shrug.\u003c/p\u003e\n\u003cp\u003e\"We don’t know,\" Kel says. \"They just told us we had to sit here until our parents came.\"\u003c/p\u003e\n\u003cp\u003e\"Ms. Cohen?\" someone says from behind me. I turn around and there is a slender woman with red hair looking at me. She\u0027s wearing a black pencil skirt and a white dress shirt. She looks more like a librarian than a principal. She gestures her hand toward her office and Eddie and I follow her.\u003c/p\u003e\n\u003cp\u003eThe woman walks into her office and takes a seat at her desk, nodding to the chairs in front of her. Eddie and I both sit.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Ms. Brill. I\u0027m the principal here at Chapman Elementary. Principal Brill.\"\u003c/p\u003e\n\u003cp\u003eThe curt way she\u0027s speaking to me and her hoity toity posture have immediately turned me off. I already don\u0027t like her.\u003c/p\u003e\n\u003cp\u003e\"Are Caulder\u0027s parents joining us?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"Caulder\u0027s parents are dead,\" I reply.\u003c/p\u003e\n\u003cp\u003eShe gasps, then attempts to control her reaction by sitting up even straighter. \"Oh, that\u0027s right. I\u0027m sorry,\" she says. \"Is it his brother? He lives with his brother, right?\"\u003c/p\u003e\n\u003cp\u003eI nod. \"He\u0027s in Detroit, he can\u0027t make it. I\u0027m Kel\u0027s sister. What\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003eShe laughs. \"Well, isn\u0027t it obvious?\" She gestures out her office window to them.\u003c/p\u003e\n\u003cp\u003eI look at the boys. They\u0027re playing rock-paper-scissors and laughing. I know she\u0027s referring to their costumes, but she\u0027s already lost my respect with her attitude, so I continue to act oblivious.\u003c/p\u003e\n\u003cp\u003e\"Is rock-paper-scissors against school policy?\" I ask.\u003c/p\u003e\n\u003cp\u003eEddie laughs.\u003c/p\u003e\n\u003cp\u003e\"Ms. Cohen,\" Principal Brill says. \"They\u0027re dressed as cancerous lungs!\" She shakes her head in disbelief.\u003c/p\u003e\n\u003cp\u003e\"I thought they were rotten kidney beans,\" Eddie says.\u003c/p\u003e\n\u003cp\u003eWe both laugh.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think this is funny,\" Principal Brill says. \"They\u0027re causing a distraction amongst the students! Those are very offensive and crude costumes! I don\u0027t know who thought it was a good idea, but you need to take them home and change their clothes.\"\u003c/p\u003e\n\u003cp\u003eMy focus returns to Principal Brill as I slowly turn around and lean forward, placing my arms on her desk.\u003c/p\u003e\n\u003cp\u003e\"Principal Brill,\" I say calmly. \"Those costumes were made by my mother. My mother, who has stage four small-cell lung cancer. My mother, who will never watch her little boy celebrate another Halloween again. My mother, who will more than likely experience a year of \u0027lasts.\u0027 Last Christmas. Last birthday. Last Easter. And if God is willing, her last Mother\u0027s Day. My mother, who when asked by her nine-year-old son if he could be her cancer for Halloween, had no choice but to make him the best cancerous tumor-ridden lung costume she could. So if you think it\u0027s so offensive, I suggest you drive them home yourself and tell my mother to her face. Do you need my address?\"\u003c/p\u003e\n\u003cp\u003ePrincipal Brill\u0027s mouth is gaped open as she shakes her head. She can\u0027t respond. I stand up and Eddie follows me out the door. I stop short and spin around and walk back into her office.\u003c/p\u003e\n\u003cp\u003e\"And one more thing. The costume contest? I hope it\u0027s fairly judged.\"\u003c/p\u003e\n\u003cp\u003eEddie laughs as I shut the door behind us.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\" Kel asks.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I say. \"Y\u0027all can go back to class. She just wanted to know where we got the materials for your costume so she can be a hemorrhoid next year.\"\u003c/p\u003e\n\u003cp\u003eEddie and I try to contain our laughter as the boys make their way back to class. We head outside and as soon as we open the doors, we explode. We laugh so hard, we cry.\u003c/p\u003e\n\u003cp\u003eWhen we get back in the jeep, I have six missed calls from my mother and two from Will. I return their calls and assure them the situation has been resolved without sparing any details.\u003c/p\u003e\n\u003cp\u003eLater that afternoon when I pick the boys up from school, they sprint to the car.\u003c/p\u003e\n\u003cp\u003e\"We won!\" Caulder yells as he climbs in the backseat. \"We both won! Fifty dollars each!\"\u003c/p\u003e\n\u003cp\u003e20.\u003c/p\u003e\n\u003cp\u003e“Well I\u0027ve been locking myself up in my house for some time now\u003c/p\u003e\n\u003cp\u003eReading and writing and reading and thinking\u003c/p\u003e\n\u003cp\u003eand searching for reasons and missing the seasons\u003c/p\u003e\n\u003cp\u003eThe Autumn, the Spring, the Summer, the snow\u003c/p\u003e\n\u003cp\u003eThe record will stop and the record will go\u003c/p\u003e\n\u003cp\u003eLatches latched the windows down,\u003c/p\u003e\n\u003cp\u003ethe dog coming in and the dog going out\u003c/p\u003e\n\u003cp\u003eUp with caffeine and down with the shot\u003c/p\u003e\n\u003cp\u003eConstantly worried about what I\u0027ve got\u003c/p\u003e\n\u003cp\u003eDistracted by work but I can\u0027t make it stop\u003c/p\u003e\n\u003cp\u003eand my confidence on and my confidence off\u003c/p\u003e\n\u003cp\u003eAnd I sink to the bottom I rise to the top\u003c/p\u003e\n\u003cp\u003eand I think to myself that I do this a lot\u003c/p\u003e\n\u003cp\u003eWorld outside just goes it goes it goes it goes it goes it goes...”\u003c/p\u003e\n\u003cp\u003e-The Avett Brothers, Talk on Indolence\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003eThe next few weeks come and go. Eddie helps out with watching the boys until Will gets home on the days I take my mother to her treatments. Will leaves every morning at six-thirty and doesn\u0027t return home until after five-thirty. We don\u0027t see each other. I make sure we don\u0027t see each other. We\u0027ve resorted to texting and phone calls when it comes to Kel and Caulder. My mother has been pressing me for information, wanting to know why he doesn\u0027t come around anymore. I lie and tell her he\u0027s just busy with his new internship.\u003c/p\u003e\n\u003cp\u003eHe\u0027s only been to the house once in the past two months. It was the only time we\u0027ve really spoken since the incident in the laundry room. He came to tell me he was offered a job at a Junior High that starts in January.\u003c/p\u003e\n\u003cp\u003eI\u0027m happy for him, but it\u0027s bittersweet. I know how much the job means for him and Caulder, but I know what it means for Will and I, too. Deep down there was a part of me silently counting down the days until his last day of internship. It\u0027s finally here, and he\u0027s already signed another contract. It solidified things for us, really. Solidified that they\u0027re over. \u003c/p\u003e","sourceLink":"https://allnovel.net/slammed-slammed-1/page-31.html","bookId":2779,"creation":"Oct 5, 2019 5:22:11 PM","modification":"Oct 5, 2019 5:22:11 PM"}
