{"id":87459,"no":32,"title":"Page 32","content":"\u003cp\u003eWe finally put the house up for sale in Texas. Mom has managed to save almost 180,000 dollars from life insurance dad actually had. The house isn\u0027t paid off yet, but after all is said and done we should get another check from the sale. Mom and I spend the majority of November focusing on our finances. We set aside more for our college funds and she opened a savings account for Kel. She payed off all the outstanding credit cards and charge cards that are in her name, and instructed me to never open any in my own name. Said she would haunt me if I did.\u003c/p\u003e\n\u003cp\u003eToday is Thursday. It’s the final day of school for all the districts; including Will’s. We have early release today, so I bring Caulder home with us. He usually spends the night on Thursdays while Will goes to the slam.\u003c/p\u003e\n\u003cp\u003eI haven\u0027t been back to Club N9NE since the night Will read his poem. I understand what Javi meant in class now-about having to relive heartache. That\u0027s why I don\u0027t go. I\u0027ve relived it enough for a lifetime.\u003c/p\u003e\n\u003cp\u003eI feed the boys and send them to their bedroom and then head to my mother\u0027s room for what has become our nightly chat.\u003c/p\u003e\n\u003cp\u003e\"Shut the door, these are Kel\u0027s,\" she whispers.\u003c/p\u003e\n\u003cp\u003eShe\u0027s wrapping Christmas gifts. I shut the door behind me and sit on the bed with her and help her wrap.\u003c/p\u003e\n\u003cp\u003e\"What are your plans for Christmas break?\" she asks.\u003c/p\u003e\n\u003cp\u003eShe\u0027s lost all of her hair now. She chose not to go with a wig-said it felt like a ferret was taking a nap on her head. She\u0027s still beautiful, nonetheless.\u003c/p\u003e\n\u003cp\u003eI shrug. \"Whatever yours are, I guess.\"\u003c/p\u003e\n\u003cp\u003eShe frowns. \"Are you going to Will\u0027s graduation with us tomorrow?\"\u003c/p\u003e\n\u003cp\u003eHe sent us an invite two weeks ago. I think each graduate gets a certain number of guests and his grandparents are the only other people he invited besides us.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, I haven\u0027t decided yet,\" I say.\u003c/p\u003e\n\u003cp\u003eShe secures a box with a bow and sets it aside. \"You should go. Whatever happened between the two of you, you should still go. He’s been there for us, Lake.\"\u003c/p\u003e\n\u003cp\u003eI don’t want to admit to her that I don\u0027t want to go because I don\u0027t know how to be around him anymore. That night in his laundry room when I thought for a brief moment that we could finally be together; I had never felt so elated. It was the most amazing feeling I\u0027ve ever experienced, to finally be free to love him. But it wasn\u0027t real. That one minute of pure happiness I felt and the heartache that came moments later is something I never want to experience again. I\u0027m tired of grieving.\u003c/p\u003e\n\u003cp\u003eMy mother moves the wrapping paper from her lap and reaches out and hugs me. I didn\u0027t realize I was wearing my emotions on my sleeve.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, but I think I may have given you some terrible advice,\" she says.\u003c/p\u003e\n\u003cp\u003eI pull away from her and laugh. \"That\u0027s impossible, Mom. You don\u0027t know how to do terrible.\"\u003c/p\u003e\n\u003cp\u003eI take a box from the floor and pull it into my lap as I grab a sheet of already cut paper and begin to wrap it.\u003c/p\u003e\n\u003cp\u003e\"I did, though. Your whole life I\u0027ve been telling you to think with your head, not your heart,\" she says.\u003c/p\u003e\n\u003cp\u003eI meticulously fold the edges up and grab the roll of tape. \"That\u0027s not good advice, Mom. That\u0027s great advice. That same advice is what has gotten me through these past few months.\" I tear a piece of tape and secure the edge of the package.\u003c/p\u003e\n\u003cp\u003eMy mother grabs the box out of my hand before I\u0027m finished wrapping it and sets it beside her. She takes my hands and turns me toward her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious. You\u0027ve been doing so much thinking with your head that you\u0027re ignoring your heart completely. There has to be a balance. The fact that both of you are letting other things consume you is about to ruin any chance you\u0027ll ever have at being happy.\"\u003c/p\u003e\n\u003cp\u003eI shake my head in confusion. \"Nothing is consuming me, Mom.\"\u003c/p\u003e\n\u003cp\u003eShe shakes my hands like I\u0027m not getting it. \"I am, Lake. I\u0027m consuming you. You\u0027ve got to stop worrying so much about me. Go live your life. I\u0027m not dead yet, you know.\"\u003c/p\u003e\n\u003cp\u003eI stare down at our hands as her words soak in. I have been focusing on her a lot. But that\u0027s what she needs. It\u0027s what we both need. She doesn\u0027t have that much time left, and I want to be there for every second of it.\u003c/p\u003e\n\u003cp\u003e\"Mom, you need me. You need me more than I need Will. Besides, Will has made his choice.\"\u003c/p\u003e\n\u003cp\u003eShe darts her eyes away and lets go of my hands. \"No he hasn\u0027t, Lake. He made what he thought was the best choice for him, but he\u0027s wrong. You\u0027re both wrong.\"\u003c/p\u003e\n\u003cp\u003eI know she wants to see me happy. I don\u0027t have the heart to tell her that it\u0027s over between us. He made his choice that night in the laundry room when he let me go. He has his priorities, and right now I\u0027m not one of them.\u003c/p\u003e\n\u003cp\u003eShe takes the box I was wrapping and returns it in front of her and starts wrapping it again. \"That night I told you I had cancer, and you ran to Will\u0027s house?\" Her voice softens. She clears her throat, still avoiding my eyes. \"I need to tell you what he said to me, at the door.\"\u003c/p\u003e\n\u003cp\u003eI remember the conversation she\u0027s referring to but I couldn’t hear what they were saying.\u003c/p\u003e\n\u003cp\u003e\"When he answered the door I told him you needed to come home. That we needed to talk about it. He looked at me with heartache in his eyes. He said, \u0027Let her stay Julia. She needs me right now.\u0027\u003c/p\u003e\n\u003cp\u003e\"Lake, you broke my heart. It broke my heart that you needed him more than you needed me. As soon as the words came out of his mouth, I realized that you were grown up…that I wasn\u0027t your whole life anymore. Will could see that. He saw how bad his words hurt me. When I turned away to walk back to the house he followed me into the yard and hugged me. He told me he would never take you from me. He said he was going to let you go…let you focus on me and on the time I had left.\"\u003c/p\u003e\n\u003cp\u003eShe places the wrapped gift on the bed. She scoots toward me and takes my hands in hers again. \"Lake, he didn\u0027t move on. He didn\u0027t choose this new job over you…he chose his new job over us. He wanted you to have more time with me.\"\u003c/p\u003e\n\u003cp\u003eI take a deep breath as I absorb everything my mother just revealed. Is she right? Does he really love me enough that he would be willing to let me go?\u003c/p\u003e\n\u003cp\u003e“Mom?” My voice is weak. “What if you’re wrong?”\u003c/p\u003e\n\u003cp\u003e“What if I’m not wrong, Lake? Question everything. What if he wants to choose you? You’ll never know if you don’t tell him how you feel. You’ve completely shut him out. You haven’t given him the chance to pick you.”\u003c/p\u003e\n\u003cp\u003eShe’s right, I haven’t. I’ve been completely closed off since that night in the laundry room. Maybe he just needs to know it’s okay. I need to let him know that it’s okay for him to love me.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s seven-thirty, Lake. You know where he is. Go tell him how you feel.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t move. My legs feel like jell-o.\u003c/p\u003e\n\u003cp\u003e\"Go!\" she laughs.\u003c/p\u003e\n\u003cp\u003eI jump off the bed and run to my room. My hands are shaking and my thoughts are all jumbled together while I throw on my pants. I put on the purple shirt that I wore on our first and only date. I go to the bathroom and inspect my reflection.\u003c/p\u003e\n\u003cp\u003eThere\u0027s something missing. I run to my room and reach under my pillow and pull out the purple clip. I snap it open and remove my mother\u0027s strands of hair and place them in my jewelry box. I go back to the bathroom and brush my bangs to the side of my head and snap the clip in place.\u003c/p\u003e\n\u003cp\u003e21.\u003c/p\u003e\n\u003cp\u003e“Don\u0027t say it\u0027s over\u003c/p\u003e\n\u003cp\u003e‘Cause that\u0027s the worst news I\u003c/p\u003e\n\u003cp\u003ecould hear I swear that I will\u003c/p\u003e\n\u003cp\u003eDo my best to be here\u003c/p\u003e\n\u003cp\u003ejust the way you like it\u003c/p\u003e\n\u003cp\u003eEven though it’s hard to hide\u003c/p\u003e\n\u003cp\u003ePush my feelings all aside\u003c/p\u003e\n\u003cp\u003eI will rearrange my plans and\u003c/p\u003e\n\u003cp\u003echange for you.”\u003c/p\u003e\n\u003cp\u003e-The Avett Brothers, If it’s the Beaches\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003eWhen I walk into the club, I don\u0027t stop to look for him. I know he\u0027s here. I don\u0027t give myself time to second guess anything as I walk with false confidence toward the front of the room. The emcee is announcing scores for the previous performer when I walk onto the stage. He\u0027s apprehensive as I grab the microphone from him and turn toward the audience. The lights are so bright, I can\u0027t see anyone\u0027s faces. I can\u0027t see Will.\u003c/p\u003e\n\u003cp\u003e\"I would like to perform a piece I wrote,\" I say into the microphone. My voice is steady, but my heart is about to jump out of my chest. I can\u0027t turn back now. I have to do this. \"I know this isn\u0027t standard protocol, but it\u0027s an emergency,\" I say.\u003c/p\u003e\n\u003cp\u003eLaughter overcomes the audience. The rumble of the crowd is loud, causing me to freeze at the thought of what I\u0027m about to do. I start to have second thoughts and turn around to the emcee but he nudges me back and gives me the go ahead.\u003c/p\u003e\n\u003cp\u003eI place the microphone in the stand and position it down to my height. I close my eyes and take a deep breath before I begin.\u003c/p\u003e\n\u003cp\u003e\"Three dollars!\" someone yells from the audience.\u003c/p\u003e\n\u003cp\u003eI open my eyes and realize I haven\u0027t paid my fee yet. I frantically dig my hands in my pockets and pull out a five dollar bill and walk it over to the emcee.\u003c/p\u003e\n\u003cp\u003eI return to the microphone and close my eyes.\u003c/p\u003e\n\u003cp\u003e\"My piece is called-\"\u003c/p\u003e\n\u003cp\u003eSomeone\u0027s tapping me on the shoulder. I open my eyes and turn around to see the emcee holding two one-dollar bills up.\u003c/p\u003e\n\u003cp\u003e\"Your change,\" he says.\u003c/p\u003e\n\u003cp\u003eI take the money and put it back in my pocket. He\u0027s still standing there.\u003c/p\u003e\n\u003cp\u003e\"Go!\" I whisper through clenched teeth.\u003c/p\u003e\n\u003cp\u003eHe stammers and walks off the stage.\u003c/p\u003e\n\u003cp\u003eOnce again, I turn toward the microphone and begin to speak. \"My piece is called Schooled,\" I say into the microphone. My voice is shaking, so I take a few deep breaths. I just hope I can remember it, I re-wrote a few lines on the way here. I inhale one last time and begin.\u003c/p\u003e\n\u003cp\u003eI got schooled this year.\u003c/p\u003e\n\u003cp\u003eBy everyone.\u003c/p\u003e\n\u003cp\u003eBy my little brother…\u003c/p\u003e\n\u003cp\u003eby The Avett Brothers…\u003c/p\u003e\n\u003cp\u003eby my mother, my best friend, my teacher, my father,\u003c/p\u003e\n\u003cp\u003ea boy that I\u0027m seriously, deeply, madly, incredibly, and undeniably in love with…\u003c/p\u003e\n\u003cp\u003eI got so schooled this year.\u003c/p\u003e\n\u003cp\u003eBy a nine-year-old.\u003c/p\u003e\n\u003cp\u003eHe taught me that it\u0027s okay to live life\u003c/p\u003e\n\u003cp\u003ea little backwards.\u003c/p\u003e\n\u003cp\u003eAnd how to laugh\u003c/p\u003e\n\u003cp\u003eAt what you would think\u003c/p\u003e\n\u003cp\u003eis un-laughable.\u003c/p\u003e\n\u003cp\u003eI got schooled this year\u003c/p\u003e\n\u003cp\u003eBy a Band!\u003c/p\u003e\n\u003cp\u003eThey taught me how to find that feeling of feeling again.\u003c/p\u003e\n\u003cp\u003eThey taught me how to decide what to be\u003c/p\u003e\n\u003cp\u003eAnd go be it.\u003c/p\u003e\n\u003cp\u003eI got schooled this year.\u003c/p\u003e\n\u003cp\u003eBy a cancer patient.\u003c/p\u003e\n\u003cp\u003eShe taught me so much. She\u0027s still teaching me so much.\u003c/p\u003e\n\u003cp\u003eShe taught me to question.\u003c/p\u003e\n\u003cp\u003eTo never regret.\u003c/p\u003e\n\u003cp\u003eShe taught me to push my boundaries,\u003c/p\u003e\n\u003cp\u003eBecause that\u0027s what they\u0027re there for.\u003c/p\u003e\n\u003cp\u003eShe told me to find a balance between head and heart\u003c/p\u003e\n\u003cp\u003eAnd then\u003c/p\u003e\n\u003cp\u003eshe taught me how…\u003c/p\u003e\n\u003cp\u003eI got schooled this year\u003c/p\u003e\n\u003cp\u003eBy a Foster Kid\u003c/p\u003e\n\u003cp\u003eShe taught me to respect the hand that I was dealt.\u003c/p\u003e\n\u003cp\u003eAnd to be grateful I was even dealt a hand.\u003c/p\u003e\n\u003cp\u003eShe taught me that family\u003c/p\u003e\n\u003cp\u003eDoesn\u0027t have to be blood.\u003c/p\u003e\n\u003cp\u003eSometimes your family\u003c/p\u003e\n\u003cp\u003eare your friends.\u003c/p\u003e\n\u003cp\u003eI got schooled this year\u003c/p\u003e\n\u003cp\u003eBy my teacher\u003c/p\u003e\n\u003cp\u003eHe taught me\u003c/p\u003e\n\u003cp\u003eThat the points are not the point,\u003c/p\u003e\n\u003cp\u003eThe point is poetry…\u003c/p\u003e\n\u003cp\u003eI got schooled this year\u003c/p\u003e\n\u003cp\u003eBy my father.\u003c/p\u003e\n\u003cp\u003eHe taught me that hero\u0027s aren\u0027t always invincible\u003c/p\u003e\n\u003cp\u003eAnd that the magic\u003c/p\u003e\n\u003cp\u003eis within me..\u003c/p\u003e\n\u003cp\u003eI got schooled this year\u003c/p\u003e\n\u003cp\u003eBoy.\u003c/p\u003e\n\u003cp\u003ea boy that I\u0027m seriously, deeply, madly, incredibly, and undeniably in love with.\u003c/p\u003e\n\u003cp\u003eAnd he taught me the most important thing of all…\u003c/p\u003e\n\u003cp\u003eTo put the emphasis\u003c/p\u003e\n\u003cp\u003eOn life.\u003c/p\u003e\n\u003cp\u003eThe feeling that comes over you, when you\u0027re in front of an audience? All those people craving for your words, yearning to see a glimpse into your soul…it\u0027s exhilarating. I thrust the microphone back into the emcee\u0027s hands and run off the stage. I look around but don\u0027t see him anywhere. I look at the booth we sat in on our first date, but it\u0027s empty. I realize, after standing there, waiting to be swept off of my feet-that he\u0027s not even here. I spin around in a circle, scanning the room a second time. A third time. He\u0027s not here. \u003c/p\u003e","sourceLink":"https://allnovel.net/slammed-slammed-1/page-32.html","bookId":2779,"creation":"Oct 5, 2019 5:22:11 PM","modification":"Oct 5, 2019 5:22:11 PM"}
