{"id":96819,"no":3,"title":"Page 3","content":"\u003cp\u003eCHAPTER TWO\u003c/p\u003e\n\u003cp\u003e1130 Hours, August 17, 2517 (Military Calendar)\u003c/p\u003e\n\u003cp\u003eEridanus Star System, Eridanus 2, Elysium City\u003c/p\u003e\n\u003cp\u003eThe orange sun cast a fiery glow on the playground of Elysium City Primary Education Facility No. 119.\u003c/p\u003e\n\u003cp\u003eDr. Halsey and Lieutenant Keyes stood in the semishade of a canvas awning and watched children as they screamed and chased one another and climbed on steel lattices and skimmed gravballs across the repulsor courts.\u003c/p\u003e\n\u003cp\u003eLieutenant Keyes looked extremely uncomfortable in civilian clothes. He wore a loose gray suit, a white shirt, and no tie. Dr. Halsey found his sudden awkwardness charming.\u003c/p\u003e\n\u003cp\u003eWhen he had complained the clothes were too loose and sloppy, she had almost laughed. He was pure military to the core. Even out of uniform, the Lieutenant stood rigid, as if he were at perpetual attention.\u003c/p\u003e\n\u003cp\u003e“It’s nice here,” she said. “This colony doesn’t know how good they’ve got it. Rural lifestyle. No pollution. No crowding. Climate-controlled weather.”\u003c/p\u003e\n\u003cp\u003eThe Lieutenant grunted an acknowledgment as he tried to smooth the wrinkles out of his silk jacket.\u003c/p\u003e\n\u003cp\u003e“Relax,” she said. “We’re supposed to be parents inspecting the school for our little girl.” She slipped her arm through his, and although she would have thought such a feat impossible, the Lieutenant stood even straighter.\u003c/p\u003e\n\u003cp\u003eShe sighed and pulled away from him, opened her purse, and retrieved a palm-sized pad. She adjusted the brim of her wide straw hat to shade the pad from the noon glare. With a tap of her finger, she accessed and scanned the file she had assembled of their subject.\u003c/p\u003e\n\u003cp\u003eNumber 117 had all the genetic markers she had flagged in her original study—he was as close to a perfect subject for her purposes as science could determine. But Dr. Halsey knew it would take more than theoretical perfection to make this project work. People were more than the sum of their genes.\u003c/p\u003e\n\u003cp\u003eThere were environmental factors, mutations, learned ethics, and a hundred other factors that could make this candidate unacceptable.\u003c/p\u003e\n\u003cp\u003eThe picture in the file showed a typical six-year-old male. He had tousled brown hair and a sly grin that revealed a gap between his front teeth. A few freckles were speckled across his checks. Good—she could match the patterns to confirm his identity.\u003c/p\u003e\n\u003cp\u003e“Our subject.” As she angled the pad toward the Lieutenant so he could see the boy, Dr. Halsey noticed that the picture was four months old. Didn’t ONI realize how fast these children changed? Sloppy. She made a note to request updated pictures on a regular basis until phase three started.\u003c/p\u003e\n\u003cp\u003e“Is that him?” the Lieutenant whispered.\u003c/p\u003e\n\u003cp\u003eDr. Halsey looked up.\u003c/p\u003e\n\u003cp\u003eThe Lieutenant nodded to a grassy hill at the end of the playground. The crest of that hill was bare dirt, scuffed clean of all vegetation. A dozen boys pushed and shoved one another—grabbed, tackled, rolled down the slope, and then got up, ran back, and started the process over.\u003c/p\u003e\n\u003cp\u003e“King of the hill,” Dr. Halsey remarked.\u003c/p\u003e\n\u003cp\u003eOne boy stood on the crest. He blocked, pushed, and strong-armed all the other children.\u003c/p\u003e\n\u003cp\u003eDr. Halsey pointed her data pad at him and recorded this incident for later study. She zoomed in on the subject to get a better look. This boy smiled and showed the same small gap between his front teeth. A split-second freeze frame and she matched his freckles to the picture on file.\u003c/p\u003e\n\u003cp\u003e“That’s our boy.”\u003c/p\u003e\n\u003cp\u003eHe was taller than the other children by a full head, and—if his performance in the game was any indicator—stronger as well. Another boy grabbed him from behind in a headlock. Number 117 peeled the boy off, and—with a laugh—tossed him down the hillside like a toy.\u003c/p\u003e\n\u003cp\u003eDr. Halsey had expected a specimen of perfect physical proportions and stunning intellect. True, the subject was strong and fast, but he was also dirty and rude.\u003c/p\u003e\n\u003cp\u003eThen again, unrealistic and subjective perceptions had to be confronted in these field studies. What did she really expect? He was a six-year-old boy—full of life and unchecked emotion and as predictable as the wind.\u003c/p\u003e\n\u003cp\u003eThree boys ganged up on him. Two grabbed his legs and one threw his arms around his chest. They all tumbled down the hill. Number 117 kicked and punched and bit his attackers until they let go and ran away to a safe distance. He rose and tore back up the hill, bumping another boy and shouting that he was king.\u003c/p\u003e\n\u003cp\u003e“He seems,” the Lieutenant started, “um, very animated.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Dr. Halsey said. “We may be able to use this one.”\u003c/p\u003e\n\u003cp\u003eShe glanced up and down the playground. The only adult was helping a girl get to her feet after falling down and scraping her elbow; she marched her towards the nurse’s office.\u003c/p\u003e\n\u003cp\u003e“Stay here and watch me, Lieutenant,” she said, and passed him the data pad. “I’m going to have a closer look.”\u003c/p\u003e\n\u003cp\u003eThe Lieutenant started to say something, but Dr. Halsey walked away, then half jogged across the painted lines of hopscotch squares on the playground. A breeze caught her sundress and she had to clutch the hem with one hand, grabbing the brim of her straw hat with the other. She slowed to a trot and halted four meters from the base of the hill.\u003c/p\u003e\n\u003cp\u003eThe children stopped and turned.\u003c/p\u003e\n\u003cp\u003e“You’re in trouble,” one boy said, and pushed Number 117.\u003c/p\u003e\n\u003cp\u003eHe shoved the boy back and then looked Dr. Halsey squarely in the eyes. The other children looked away; some wore embarrassed smirks, and a few slowly backed off.\u003c/p\u003e\n\u003cp\u003eHer subject, however, stood there defiantly. He was either confident she wasn’t going to punish him—or he simply wasn’t afraid. She saw that he had a bruise on his cheek, the knees of his pants were torn, and his lip was cracked.\u003c/p\u003e\n\u003cp\u003eDr. Halsey took three steps closer. Several of the children took three involuntary steps backward.\u003c/p\u003e\n\u003cp\u003e“Can I speak with you, please?” she asked, and continued to stare at her subject.\u003c/p\u003e\n\u003cp\u003eHe finally broke eye contact, shrugged, and then lumbered down the hill. The other children giggled and made tsking sounds; one tossed a pebble at him. Number 117 ignored them.\u003c/p\u003e\n\u003cp\u003eDr. Halsey led him to the edge of the nearby sandpit and stopped.\u003c/p\u003e\n\u003cp\u003e“What’s your name?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’m John,” he said. The boy held out his hand.\u003c/p\u003e\n\u003cp\u003eDr. Halsey didn’t expect physical contact. The subject’s father must have taught him the ritual, or the boy was highly imitative.\u003c/p\u003e\n\u003cp\u003eShe shook his hand and was surprised by the strength in his miniscule grip. “It’s very nice to meet you.”\u003c/p\u003e\n\u003cp\u003eShe knelt so she was at his level. “I wanted to ask you what you were doing?”\u003c/p\u003e\n\u003cp\u003e“Winning,” he said.\u003c/p\u003e\n\u003cp\u003eDr. Halsey smiled. He was unafraid of her . . . and she doubted that he’d have any trouble pushing her off the hill, either.\u003c/p\u003e\n\u003cp\u003e“You like games,” she said. “So do I.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “Yeah, but they made me play chess last week. That got boring. It’s too easy to win.” He took a quick breath. “Or—can we play gravball? They don’t let me play gravball anymore, but maybe if you tell them it’s okay?”\u003c/p\u003e\n\u003cp\u003e“I have a different game I want you to try,” she told him. “Look.” She reached into her purse and brought out a metal disk. She turned it over and it gleamed in the sun. “People used coins like this for currency a long time ago, when Earth was the only planet we lived on.”\u003c/p\u003e\n\u003cp\u003eHis eyes fixed on the object. He reached for it.\u003c/p\u003e\n\u003cp\u003eDr. Halsey moved it away, continuing to flip it between her thumb and index finger. “Each side is different. Do you see? One has the face of a man with long hair. The other side has a bird, called an eagle, and it’s holding—”\u003c/p\u003e\n\u003cp\u003e“Arrows,” John said.\u003c/p\u003e\n\u003cp\u003e“Yes. Good.” His eyesight must be exceptional to see such detail so far away. “We’ll use this coin in our game. If you win you can keep it.”\u003c/p\u003e\n\u003cp\u003eJohn tore his gaze from the coin and looked at her again, squinted, then said, “Okay. I always win, though. That’s why they won’t let me play gravball anymore.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you do.”\u003c/p\u003e\n\u003cp\u003e“What’s the game?”\u003c/p\u003e\n\u003cp\u003e“It’s very simple. I toss the coin like this.” She flicked her wrist, snapped her thumb, and the coin arced, spinning into the air, and landed in the sand. “Next time, though, before it lands, I want you to tell me if it will fall with the face of the man showing or with the eagle holding the arrows.”\u003c/p\u003e\n\u003cp\u003e“I got it.” John tensed, bent his knees, and then his eyes seemed to lose their focus on her and the coin.\u003c/p\u003e\n\u003cp\u003eDr. Halsey picked up the quarter. “Ready?”\u003c/p\u003e\n\u003cp\u003eJohn gave a slight nod.\u003c/p\u003e\n\u003cp\u003eShe tossed it, making sure there was plenty of spin.\u003c/p\u003e\n\u003cp\u003eJohn’s eyes watched it with that strange distant gaze. He tracked it as it went up, and then down toward the ground—his hand snapped out and snatched the quarter out of the air.\u003c/p\u003e\n\u003cp\u003eHe held up his closed hand. “Eagle!” he shouted.\u003c/p\u003e\n\u003cp\u003eShe tentatively reached for his hand and peeled open the tiny fist.\u003c/p\u003e\n\u003cp\u003eThe quarter lay in his palm: the eagle shining in the orange sun.\u003c/p\u003e\n\u003cp\u003eWas it possible that he saw which side was up when he grabbed it . . . or more improbably, could have picked which side he wanted? She hoped the Lieutenant had recorded that. She should have told him to keep the data pad trained on her.\u003c/p\u003e\n\u003cp\u003eJohn retracted his hand. “I get to keep it, right? That’s what you said.”\u003c/p\u003e\n\u003cp\u003e“Yes, you can keep it, John.” She smiled at him—then stopped.\u003c/p\u003e\n\u003cp\u003eShe shouldn’t have used his name. That was a bad sign. She couldn’t afford the luxury of liking her test subjects. She mentally stepped away from her feelings. She had to maintain a professional distance. She had to . . . because in a few months Number 117 might not be alive.\u003c/p\u003e\n\u003cp\u003e“Can we play again?”\u003c/p\u003e\n\u003cp\u003eDr. Halsey stood and took a step back. “That was the only one I had, I’m afraid. I have to leave now,”\u003c/p\u003e\n\u003cp\u003eshe told him. “Go back and play with your friends.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” He ran back, shouting to the other boys, “Look!”\u003c/p\u003e\n\u003cp\u003eDr. Halsey strode to the Lieutenant. The sun reflecting off the asphalt felt too hot, and she suddenly didn’t want to be outside. She wanted to be back in the ship, where it was cool and dark. She wanted to get off this planet.\u003c/p\u003e\n\u003cp\u003eShe stepped under the canvas awning and said to the Lieutenant, “Tell me you recorded that.”\u003c/p\u003e\n\u003cp\u003eHe handed her the data pad and looked puzzled. “Yes. What was it all about?’\u003c/p\u003e\n\u003cp\u003eDr. Halsey checked the recording and then sent a copy ahead to Toran on the Han for safekeeping.\u003c/p\u003e\n\u003cp\u003e“We screen these subjects for certain genetic markers,” she said. “Strength, agility, even predispositions for aggression and intellect. But we couldn’t remote test for everything. We don’t test for luck.”\u003c/p\u003e\n\u003cp\u003e“Luck?” Lieutenant Keyes asked. “You believe in luck, Doctor?”\u003c/p\u003e\n\u003cp\u003e“Of course not,” she said with a dismissive wave of her hand. “But we have one hundred and fifty test subjects to consider, and facilities and funding for only half that number. It’s a simple mathematical elimination, Lieutenant. That child was one of the lucky ones—either that or he is extraordinarily fast.\u003c/p\u003e\n\u003cp\u003eEither way, he’s in.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand,” Lieutenant Keyes said, and he started fiddling with the pipe he carried in his pocket.\u003c/p\u003e\n\u003cp\u003e“I hope that continues, Lieutenant, ” Dr. Halsey replied quietly. “For your sake, I hope you never understand what we’re doing.”\u003c/p\u003e\n\u003cp\u003eShe looked one last time at Number 117—at John. He was having so much fun, running and laughing.\u003c/p\u003e\n\u003cp\u003eFor a moment she envied the boy’s innocence; hers was long dead. Life or death, lucky or not, she was condemning this boy to a great deal of pain and suffering.\u003c/p\u003e\n\u003cp\u003eBut it had to be done. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-fall-of-reach-halo-1/page-3.html","bookId":1633,"creation":"Oct 5, 2019 6:23:12 PM","modification":"Oct 5, 2019 6:23:12 PM"}
