{"id":96848,"no":32,"title":"Page 32","content":"\u003cp\u003eCHAPTER THIRTY-ONE\u003c/p\u003e\n\u003cp\u003e0447 Hours, August 30, 2552 (Military Calendar)\u003c/p\u003e\n\u003cp\u003eRemote Sensing Station Fermion, Epsilon Eridani System’s edge Chief Petty Officer McRobb entered the command center of Remote Sensing Station Fermion .\u003c/p\u003e\n\u003cp\u003eLieutenants (JG) Bill Streeter and David Brightling stood and saluted.\u003c/p\u003e\n\u003cp\u003eHe wordlessly returned their salutes.\u003c/p\u003e\n\u003cp\u003eThe wall-sized monitors displayed the contents of the last Slipstream probes: multidimensional charts, a rainbow of false color enhancements, and a catalog of objects adrift in the alternate space. Some of the new officers thought the representations looked “pretty.”\u003c/p\u003e\n\u003cp\u003eTo Chief McRobb, however, each pixel on the screens represented danger. So many things could hide in multidimensional space: pirates, black marketers . . . the Covenant.\u003c/p\u003e\n\u003cp\u003eMcRobb inspected their duty stations. He double-checked that all programs and hardware were running within UNSC specifications. He ran his hand along the monitors and keypads looking for dust. Their stations were in tip-top shape.\u003c/p\u003e\n\u003cp\u003eConsidering what they were guarding, Reach, anything less than perfection was unacceptable. He made certain his crew knew it, too.\u003c/p\u003e\n\u003cp\u003e“Carry on,” he said.\u003c/p\u003e\n\u003cp\u003eSince the battle of Sigma Octanus, FLEETCOM had reassigned top people to its Remote Sensing Stations. Chief McRobb had been pulled from Fort York on the edge of the Inner Colonies. He had spent the last three months helping his crew brush up on their abstract and complex algebras to interpret the probe data.\u003c/p\u003e\n\u003cp\u003e“Ready to send out the next set of probes, sir,” Lieutenant Streeter said. “Linear accelerator and Slipspace generators online and charged.”\u003c/p\u003e\n\u003cp\u003e“Set for thirty-second return cycle and launch,” Chief McRobb ordered.\u003c/p\u003e\n\u003cp\u003e“Aye, sir. Probes away, sir. Accelerated and entering the Slipstream.”\u003c/p\u003e\n\u003cp\u003eFLEETCOM didn’t really expect anything to attack the Reach Military Complex. It was the heart of the UNSC military operations. If anything did attack it, the battle would be a short one. There were twenty Super MAC guns in orbit. They could accelerate a three-thousand-ton projectile to point four-tenths the speed of light—and place that projectile with pinpoint accuracy. If that wasn’t enough to stop a Covenant fleet, there were anywhere from a hundred to a hundred and fifty ships in the system at any given time.\u003c/p\u003e\n\u003cp\u003eChief McRobb knew, though, there had been another military base that was once thought too strong to attack—and the military had paid the price for their lack of vigilance. He wasn’t about to let Reach become another Pearl Harbor. Not on his watch.\u003c/p\u003e\n\u003cp\u003e“Probes returning, sir,” Lieutenant Brightling announced. “Alpha reentering normal space in three . . .\u003c/p\u003e\n\u003cp\u003etwo . . . one. Scanning sectors. Signal acquired at extraction point minus forty five thousand kilometers.”\u003c/p\u003e\n\u003cp\u003e“Process the signals and send out the recovery drone, Lieutenant.”\u003c/p\u003e\n\u003cp\u003e“Aye, sir. Getting signal lock on—” The Lieutenant squinted at his monitor. “Sir, would you take a look at this?”\u003c/p\u003e\n\u003cp\u003e“On the board, Lieutenant.”\u003c/p\u003e\n\u003cp\u003eRadar and neutron imager silhouettes appeared on-screen—and filled the display. Chief McRobb had never seen anything like it in Slipstream space.\u003c/p\u003e\n\u003cp\u003e“Confirm that the data stream is not corrupted,” the Chief ordered. “I’m estimating that object is three thousand kilometers in diameter.”\u003c/p\u003e\n\u003cp\u003e“Affirmative . . . thirty-two-hundred-kilometer diameter confirmed, sir. Signal integrity is green. We’ll have a trajectory for the planetoid as soon as Beta probe returns.”\u003c/p\u003e\n\u003cp\u003eIt was rare for any natural object this large to be in Slipstream space. An occasional comet or asteroid had been logged—UNSC astrophysicists still weren’t sure how the things got into the alternate dimension. But there had never been anything like this. At least, not since—\u003c/p\u003e\n\u003cp\u003e“Oh my God,” McRobb whispered.\u003c/p\u003e\n\u003cp\u003eNot since Sigma Octanus.\u003c/p\u003e\n\u003cp\u003e“We’re not waiting for Beta probe,” Chief McRobb barked. “We are initiating the Cole Protocol.\u003c/p\u003e\n\u003cp\u003eLieutenant Streeter, purge the navigational database, and I mean right now . Lieutenant Brightling, remove the safety interlocks on the station’s reactor.”\u003c/p\u003e\n\u003cp\u003eHis junior officers hesitated for a moment—then they understood the gravity of their situation. They moved quickly.\u003c/p\u003e\n\u003cp\u003e“Initiating viral data scavengers,” Lieutenant Streeter called out. “Dumping main and cache memory.”\u003c/p\u003e\n\u003cp\u003eHe turned in his seat, his face white. “Sir, the science library is offline for repairs. It has every UNSC\u003c/p\u003e\n\u003cp\u003eastrophysics journal in it.”\u003c/p\u003e\n\u003cp\u003e“With navigation data on every star within a hundred light-years,” the Chief whispered. “Including Sol.\u003c/p\u003e\n\u003cp\u003eLieutenant, you get someone down there and destroy that data. I don’t care if they have to hit it with a goddamn sledgehammer—make sure that data is wiped.”\u003c/p\u003e\n\u003cp\u003e“Aye, sir!” Streeter turned to the COM and began issuing frantic orders.\u003c/p\u003e\n\u003cp\u003e“Safety interlocks red on the board,” Lieutenant Brightling reported. His lips pressed into a single white line, concentrating. “Beta probe returning, sir, in four . . . three . . . two . . . one. There. Off target one hundred twenty thousand kilometers. Signal is weak. The probe appears to be malfunctioning. Trying to scrub the signal now.”\u003c/p\u003e\n\u003cp\u003e“It’s too much of a coincidence that it’s malfunctioning, Streeter,” the Chief said. “Get FLEETCOM on Alpha channel on the double! Compress and send the duty log.”\u003c/p\u003e\n\u003cp\u003e“Aye, sir.” Lieutenant Streeter’s fingers fumbled with the keypad as he typed—then had to retype the command. “Logs sent.”\u003c/p\u003e\n\u003cp\u003e“Beta probe signal on the board,” Lieutenant Brightling reported. “Calculating the object’s trajectory . . .\u003c/p\u003e\n\u003cp\u003e”\u003c/p\u003e\n\u003cp\u003eThe planetoid was closer. Its edges, however, had abnormalities—bumps and spikes and protrusions.\u003c/p\u003e\n\u003cp\u003eChief McRobb shifted and clenched his hands into fists.\u003c/p\u003e\n\u003cp\u003e“It will pass though Reach System,” Lieutenant Brightling said. “Intersecting the solar plane in seventeen seconds at the system’s outer edge at zero four one.” He inhaled sharply. “Sir, that’s only a light-second away from us.”\u003c/p\u003e\n\u003cp\u003eLieutenant Streeter stood and knocked over his chair, almost backing into the Chief.\u003c/p\u003e\n\u003cp\u003eMcRobb righted the chair. “Sit down, Lieutenant. We’ve got a job to do. Target the telescope array to monitor that region of space.”\u003c/p\u003e\n\u003cp\u003eLieutenant Streeter turned and gazed into the rock-solid features of the Chief. He took a deep breath.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” He sat back down. “Aye, sir, moving the array.”\u003c/p\u003e\n\u003cp\u003e“Gamma probe returning in three . . . two . . . one.” Lieutenant Brightling paused. “There’s no signal, sir.\u003c/p\u003e\n\u003cp\u003eScanning. Time plus four seconds and counting. Probe may have translated on a temporal axis.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” the Chief murmured.\u003c/p\u003e\n\u003cp\u003eLieutenant Streeter said, “Telescope array now on target, sir. On the main view screen.”\u003c/p\u003e\n\u003cp\u003ePinpoints of green light appeared at the edge of the Reach solar system. They collected and swarmed as if they were caught in a boiling liquid. Space stretched, smeared, and distorted. Half the stars in that region were blotted out.\u003c/p\u003e\n\u003cp\u003e“Radar contact,” Lieutenant Brightling said. “Contact with . . . more than three hundred large objects.”\u003c/p\u003e\n\u003cp\u003eHis hands started to shake. “Sir, silhouettes match known Covenant profiles.”\u003c/p\u003e\n\u003cp\u003e“They’re accelerating,” Lieutenant Streeter whispered. “On an intercept course for the station.”\u003c/p\u003e\n\u003cp\u003e“FLEETCOM network connections are being infiltrated,” Lieutenant Brightling said. His trembling hands could barely type in commands. “Cutting our connection.”\u003c/p\u003e\n\u003cp\u003eChief McRobb stood as straight as he could. “What about the astrophysics data?”\u003c/p\u003e\n\u003cp\u003e“Sir, they’re still trying to end the diagnostic cycle, but that takes a few minutes.”\u003c/p\u003e\n\u003cp\u003e“Then we don’t have a lot of options,” McRobb muttered.\u003c/p\u003e\n\u003cp\u003eHe set his hand on Lieutenant Brightling’s shoulder to steady the young officer. “It’s all right, Lieutenant. We’ve done the best we could. We’ve done our duty. There’s nothing more to worry about.”\u003c/p\u003e\n\u003cp\u003eHe set his palmprint on the control station. The Chief locked out the reactor safeties and saturated the fusion chamber with their deuterium reserve tanks. Chief McRobb said, “Just one last order to carry out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-fall-of-reach-halo-1/page-32.html","bookId":1633,"creation":"Oct 5, 2019 6:23:12 PM","modification":"Oct 5, 2019 6:23:12 PM"}
