{"id":96852,"no":36,"title":"Page 36","content":"\u003cp\u003eCHAPTER THIRTY-FIVE\u003c/p\u003e\n\u003cp\u003e0616 Hours, August 30, 2552 (Military Calendar)\u003c/p\u003e\n\u003cp\u003eUNSC Pelican dropship, Epsilon Eridani System near Reach Station Gamma\u003c/p\u003e\n\u003cp\u003e“Brace for maneuvering!” the Master Chief barked.\u003c/p\u003e\n\u003cp\u003eThe Spartans dove for safety harnesses and strapped in. “All secure!” Kelly shouted.\u003c/p\u003e\n\u003cp\u003eThe Master Chief killed the Pelican’s forward thrusters and triggered a short, sudden reverse burn. The Spartans were brutally slammed forward into their harnesses as the Pelican’s acceleration bled away.\u003c/p\u003e\n\u003cp\u003eThe Master Chief quickly shut down the engines.\u003c/p\u003e\n\u003cp\u003eThe tiny Pelican faced the Covenant frigate. At a kilometer’s distance, the alien ship’s launch bay and pulse laser turrets looked close enough to touch on the view screen; enough firepower to vaporize the Spartans in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eThe Master Chief’s first instinct was to fire their HE Anvil-II missiles and autocannons—but he checked his hand as he reached for the triggers.\u003c/p\u003e\n\u003cp\u003eThat would only attract their attention . . . which was the last thing he wanted. For the moment, the alien vessel ignored them—probably because the Master Chief had shut down the Pelican’s engines. But the ship also seemed dead in space: no lights, no single ships launched, and no plasma weapons charging.\u003c/p\u003e\n\u003cp\u003eThe dropship continued toward the docking station, their momentum putting distance between them and the frigate.\u003c/p\u003e\n\u003cp\u003eSpace around the Covenant ship boiled and pulled apart—and two more alien ships appeared.\u003c/p\u003e\n\u003cp\u003eThey, too, ignored the dropship. Was it too small to bother with? The Master Chief didn’t care. His luck, it seemed, was holding.\u003c/p\u003e\n\u003cp\u003eHe checked the radar—thirty kilometers to the docking ring. He ignited the engines to slow them down.\u003c/p\u003e\n\u003cp\u003eHe had to or they would crash into the station.\u003c/p\u003e\n\u003cp\u003eTwenty kilometers.\u003c/p\u003e\n\u003cp\u003eRumbling shook the dropship. They slowed—but it wasn’t going to be enough.\u003c/p\u003e\n\u003cp\u003eTen kilometers.\u003c/p\u003e\n\u003cp\u003e“Hang on,” he told Linda and James.\u003c/p\u003e\n\u003cp\u003eThe sudden impact whiplashed the Master Chief back and forth in his seat. The straps holding him snapped.\u003c/p\u003e\n\u003cp\u003eHe blinked . . . saw only blackness. His vision cleared and he noted that his shield bar was dead. It slowly began to fill again. Every display and monitor in the cockpit had shattered.\u003c/p\u003e\n\u003cp\u003eThe Master Chief shook off the disorientation and pulled himself aft.\u003c/p\u003e\n\u003cp\u003eThe interior of the dropship was a mess. Everything tied down had come loose. Ammunition boxes had broken open in the crash landing and loose carriages filled the air. Coolant leaked, spraying blobs of black fluid. In zero gravity, everything looked like the inside of a shaken snowglobe.\u003c/p\u003e\n\u003cp\u003eJames and Linda floated off the deck of the Pelican. They slowly moved.\u003c/p\u003e\n\u003cp\u003e“Any injuries?” the Master Chief asked.\u003c/p\u003e\n\u003cp\u003e“No,” Linda replied.\u003c/p\u003e\n\u003cp\u003e“I think so,” James said. “I mean, no. I’m good, sir. Was that a landing or did those Covenant ships take a shot at us?”\u003c/p\u003e\n\u003cp\u003e“If they had, we wouldn’t be here to talk about it. Get whatever gear you can and get out, double time,”\u003c/p\u003e\n\u003cp\u003ethe Master Chief said.\u003c/p\u003e\n\u003cp\u003eThe Master Chief grabbed an assault rifle and a Jackhammer launcher. He found a satchel. Inside was a kilogram of C-12, detonators, and a Lotus antitank mine. Those would come in handy. He salvaged five intact clips of ammunition but couldn’t locate his thruster pack. He’d have to do without one.\u003c/p\u003e\n\u003cp\u003e“No more time,” he said. “We’re sitting ducks here. Out the side hatch now.”\u003c/p\u003e\n\u003cp\u003eLinda went first. She paused, and—once she was satisfied the Covenant weren’t lying in ambush—\u003c/p\u003e\n\u003cp\u003emotioned them forward.\u003c/p\u003e\n\u003cp\u003eThe Master Chief and James exited, clung to the side of the Pelican in zero gravity, and took flanking positions at the fore and aft ends of the dropship.\u003c/p\u003e\n\u003cp\u003eSpace dock Gamma was a three-kilometer-diameter ring. Dull gray metal arced in either direction. On the surface were communications dishes and a few conduits—no real cover. The docking bay doors were sealed tight. The station wasn’t spinning. The dockmaster AI must have shut the place up tight when it detected the unsecured NAV database.\u003c/p\u003e\n\u003cp\u003eThe Master Chief frowned when he spotted the tail end of their Pelican—crumpled and embedded into the station’s hull. Its engines were ruined. The dropship jutted out at an angle; its prow and the charges of C-12 that were supposed to have blasted them into a Covenant ship—now pointed into the air.\u003c/p\u003e\n\u003cp\u003eThe Master Chief started to drift off the station. He clipped himself to the hull of the dropship.\u003c/p\u003e\n\u003cp\u003e“Blue-Two,” he said, “police those explosives.” He gestured to the prow. The motion sent him gyrating.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” James puffed his thruster pack once and drifted up to the nose of the Pelican.\u003c/p\u003e\n\u003cp\u003eThe Spartans had trained to fight in zero gravity. It wasn’t easy. The slightest motion sent you spinning out of control.\u003c/p\u003e\n\u003cp\u003eA flash overhead reflected off the hull. The Master Chief looked up. The Covenant ships were alive now\u003c/p\u003e\n\u003cp\u003e—lances of blue laser fire flashed and motes of red light collected on their lateral lines. Their engines glowed and they moved close to the station.\u003c/p\u003e\n\u003cp\u003eA streak crossed the Master Chief’s field of vision in the blink of an eye. The center Covenant frigate shields strobed silver; the ship shattered into a cloud of glistening fragments.\u003c/p\u003e\n\u003cp\u003eThe orbital guns had turned and fired on the new threat.\u003c/p\u003e\n\u003cp\u003eThis was a suicide maneuver. How did the Covenant think they could withstand that kind of firepower?\u003c/p\u003e\n\u003cp\u003e“Blue-One,” the Master Chief said. “Scan those ships with your scope.”\u003c/p\u003e\n\u003cp\u003eLinda floated closer to the Master Chief. She pointed her sniper rifle up and sighted the ships. “We’ve got inbound targets,” she said, and fired.\u003c/p\u003e\n\u003cp\u003eThe Master Chief hit his magnification. A dozen pods burst from the two remaining Covenant ships.\u003c/p\u003e\n\u003cp\u003eTrails of exhaust pointed right at the Spartans’ position. There were tiny specks accompanying the pods; the Master Chief increased his display’s magnification to maximum. They looked like men in thruster packs—\u003c/p\u003e\n\u003cp\u003eNo, they were definitely not men.\u003c/p\u003e\n\u003cp\u003eThese things had elongated heads—and even at this distance, the Master Chief could see past their faceplates and noted their pronounced sharklike teeth and jaws. They wore armor; it shimmered as they collided with debris—which meant energy shields.\u003c/p\u003e\n\u003cp\u003eThese must be the elite warrior class Dr. Halsey had conjectured. The Covenant’s best? They were about to find out.\u003c/p\u003e\n\u003cp\u003eLinda shot one of the EVA aliens. Shields shimmered around its body and the round bounced off. She didn’t stop. She pumped four more rounds into the creature—hitting a pinpoint target in its neck. Its shields flickered and a round got through. Black blood gushed from the wound and the creature writhed in space.\u003c/p\u003e\n\u003cp\u003eThe other aliens spotted them. They jetted toward their location, firing plasma rifle and needlers.\u003c/p\u003e\n\u003cp\u003e“Take cover,” the Master Chief said. He unclipped himself and clung to the side of the dropship.\u003c/p\u003e\n\u003cp\u003eLinda followed—bolts of fire spattering on the hull next to them, spattering molten metal. Crystalline needles bounced off their shields\u003c/p\u003e\n\u003cp\u003e“Blue-Two,” the Master Chief said. “I said fall back.”\u003c/p\u003e\n\u003cp\u003eJames almost had the explosives rigged to the nose free. A shower of needles hit him. One stuck the tank of his thruster harness—penetrated. It remained embedded for a split second . . . then exploded.\u003c/p\u003e\n\u003cp\u003eExhaust billowed from the pack. The uncontrolled jets spun James in the microgravity. He slammed into the station, bounced—then rocketed away into space, tumbling end over end, unable to control his trajectory.\u003c/p\u003e\n\u003cp\u003e“Blue-Two! Come in,” the Master Chief barked over the COM channel.\u003c/p\u003e\n\u003cp\u003e“Can—control—” James’ voice was punctuated with static. “They’ve—everywhere—” There was more static and the COM channel went dead.\u003c/p\u003e\n\u003cp\u003eThe Master Chief watched his teammate tumble away into the darkness. All his training, his superhuman strength, reflexes, and determination . . . completely useless against the laws of physics.\u003c/p\u003e\n\u003cp\u003eHe didn’t even know if James was dead. For the moment, he had to assume that he was—put him out of his mind. He had a mission to complete. If he survived, then he’d get every UNSC ship in the area to mount a search and rescue op.\u003c/p\u003e\n\u003cp\u003eLinda shrugged out of her thruster harness.\u003c/p\u003e\n\u003cp\u003eThe suppressing fire from the aliens halted. Covenant landing pods descended toward the station, touching down at roughly three-hundred-meter intervals.\u003c/p\u003e\n\u003cp\u003eA pod landed twenty meters away. Its sides uncurled like the petals of a flower. Jackals in black-and-blue vacuum suits drifted out. Their boots adhered to the station’s hull.\u003c/p\u003e\n\u003cp\u003e“Let’s pave a path out of here, Blue-One.”\u003c/p\u003e\n\u003cp\u003e“Roger that,” she said.\u003c/p\u003e\n\u003cp\u003eLinda targeted spots their energy shields didn’t cover—boots, the top of one’s head, a fingertip. Three Jackals went down in quick succession, their spacesuits ruptured by her marksmanship. The rest scrambled for cover inside the pod.\u003c/p\u003e\n\u003cp\u003eThe Master Chief braced his back against the dropship and fired his assault rifle in controlled bursts. The microgravity played havoc with his aim.\u003c/p\u003e\n\u003cp\u003eOne Jackal leaped from his cover—straight towards them.\u003c/p\u003e\n\u003cp\u003eThe Master Chief switched to full auto and blasted his shield with enough rounds to send the alien flying backward off the station. He spent the clip, reloaded, and got out a grenade. He pulled the pin and lobbed it.\u003c/p\u003e\n\u003cp\u003eHe threw it in a flat trajectory. The grenade ricocheted off the far side of the pod and bounced inside.\u003c/p\u003e\n\u003cp\u003eIt detonated—a flash and spray of freeze-dried blue vented upward. The explosion had caught the enemy on their unshielded sides.\u003c/p\u003e\n\u003cp\u003e“Blue-One, secure that landing pod. I’ll cover you.” He leveled his rifle.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” Linda grabbed a pipe that ran along the station and pulled herself hand over hand. When she was inside the pod, she flashed him a green light on his heads-up display.\u003c/p\u003e\n\u003cp\u003eThe Master Chief crawled toward the prow of the Pelican. As he crested the ship he saw that the station was swarming with Covenant troops: a hundred Jackals and at least six Elites. They pointed toward the Pelican and slowly started to advance on their position.\u003c/p\u003e\n\u003cp\u003e“Come and get it,” the Master Chief muttered.\u003c/p\u003e\n\u003cp\u003eHe pulled two grenades from his satchel and wedged them into the C-12 on the nose of the ship. He pushed off and propelled himself back to his teammate.\u003c/p\u003e\n\u003cp\u003eShe grabbed him and pulled him into the interior of the open pod. Bits of a dozen dead Jackals pasted the inside.\u003c/p\u003e\n\u003cp\u003e“You’ve got a new target,” he told her. “A pair of frag grenades. Sight on them and wait for my order to fire.”\u003c/p\u003e\n\u003cp\u003eShe propped her rifle on the edge of the open pod and aimed.\u003c/p\u003e\n\u003cp\u003eJackals crawled over the Pelican—one of the Elite warriors appeared as well, maneuvering in a harness, flying over the ship. The Elite gestured imperiously, directing the Jackals to search the ship.\u003c/p\u003e\n\u003cp\u003e“Fire,” the Master Chief said.\u003c/p\u003e\n\u003cp\u003eLinda fired once. The grenades detonated; the chain reaction set off the twenty kilograms of C-12.\u003c/p\u003e\n\u003cp\u003eA subsonic fist slammed into the Master Chief and threw him to the far side of the landing pod. Even twenty meters away, the sides of the craft warped and the top edges sheared away.\u003c/p\u003e\n\u003cp\u003eHe looked over the edge.\u003c/p\u003e\n\u003cp\u003eThere was a crater where the Pelican had been. If anything had survived that blast, it was now in orbit.\u003c/p\u003e\n\u003cp\u003e“We have a way in,” the Master Chief remarked.\u003c/p\u003e\n\u003cp\u003eLinda nodded.\u003c/p\u003e\n\u003cp\u003eIn the distance, where the station curved out of view, more Covenant pods landed—and the Master Chief saw the silhouettes of hundreds of Jackals and Elite fighters crawling and jetting their way closer.\u003c/p\u003e\n\u003cp\u003e“Let’s go, Blue-One.”\u003c/p\u003e\n\u003cp\u003eThey pulled themselves toward the hole. The detonation had blown through five decks, leaving a tunnel of ragged-edged metal and sputtering gas hoses.\u003c/p\u003e\n\u003cp\u003eThe Master Chief called up the station’s blueprints on his display. “That one,” he said, and pointed two decks down. “B level. That’s where bay nine and the Circumference should be, three hundred meters to port.”\u003c/p\u003e\n\u003cp\u003eThey climbed into the interior and into B deck’s corridor. The station’s emergency lights were on, filling the passage with dull red illumination.\u003c/p\u003e\n\u003cp\u003eThe Master Chief paused and signaled her to halt. He pulled out the Lotus antitank mine from his satchel and set it on the deck. He set the sensitivity to maximum and triggered its proximity detectors. Anything that tried to follow them would get a surprise.\u003c/p\u003e\n\u003cp\u003eThe Master Chief and Linda gripped the handrails along the corridor and pulled themselves up the curved hall.\u003c/p\u003e\n\u003cp\u003eFlashes of automatic-weapons fire flashed in the low light, just ahead of their position.\u003c/p\u003e\n\u003cp\u003e“Blue-One,” the Master Chief said, “Ahead, ten meters—there’s a pressure door open.”\u003c/p\u003e\n\u003cp\u003eThey quickly took positions on either side of the door. He sent his optical probe around the corner.\u003c/p\u003e\n\u003cp\u003eThe docking bay had a dozen ship berths on two levels. The Master Chief spotted a few battered Pelicans; a station service bot; and in berth eleven, a sleek private craft held in place by massive service clamps. Where the ship’s name should have been painted on the prow there was only a simple circle.\u003c/p\u003e\n\u003cp\u003eThat had to be the target.\u003c/p\u003e\n\u003cp\u003eTwo berths aft, four Marines in vac suits were pinned down by plasma and needler fire. The Master Chief turned his optical probe and saw what was pinning them down: thirty Jackals were in the forward portion of the bay, slowly advancing, under cover of their energy shields.\u003c/p\u003e\n\u003cp\u003eThe Marines tossed frag grenades. The Jackals scrambled for cover and turned their shields.\u003c/p\u003e\n\u003cp\u003eThree silent explosions flashed in the vacuum. Not one of the Jackals fell.\u003c/p\u003e\n\u003cp\u003eAnother explosion rippled through the deck—behind them. It shook the Master Chief’s bones in his armor. The Lotus mine had detonated.\u003c/p\u003e\n\u003cp\u003eThey didn’t have much time before the Covenant force outside caught up with them.\u003c/p\u003e\n\u003cp\u003eThe Master Chief readied his assault rifle.\u003c/p\u003e\n\u003cp\u003e“Take those Jackals out, Blue-One. I’ll make a break for the Circumference .”\u003c/p\u003e\n\u003cp\u003eLinda gripped the edge of the pressure door with her left hand, propped her rifle across it, and curled her right hand around the trigger.\u003c/p\u003e\n\u003cp\u003e“There are a lot of them,” she said. “This may take a few seconds.”\u003c/p\u003e\n\u003cp\u003eA flicker of a contact appeared on the Master Chief’s motion tracker—then vanished. He turned and brought his assault rifle to bear. Nothing. “Hang on, Blue-One. I’m going to check our six.”\u003c/p\u003e\n\u003cp\u003eLinda’s acknowledgment light winked on.\u003c/p\u003e\n\u003cp\u003eThe Master Chief eased back down the passage ten meters. No sensor contact. There was just dim red light and shadows . . . but one of the shadows moved.\u003c/p\u003e\n\u003cp\u003eIt only took an instant for the image to fully resister: a black film peeled away from the darkness. It was a meter taller than John and wore blue armor similar to that on Covenant warships. Its helmet was elongated and it had rows of sharp teeth; it looked like it was smiling at him.\u003c/p\u003e\n\u003cp\u003eThe Elite warrior leveled a plasma pistol.\u003c/p\u003e\n\u003cp\u003eAt this range, there was no way the creature would miss—the plasma weapon would cut through John’s slowly recharging shields almost immediately. And if John used his assault rifle, it wouldn’t cut though the alien’s energy shield. In a simple exchange of fire, the alien would win.\u003c/p\u003e\n\u003cp\u003eUnacceptable. He needed to change the odds.\u003c/p\u003e\n\u003cp\u003eThe Master Chief pushed off the wall and launched himself at the creature. He slammed into the Elite before it had a chance to fire.\u003c/p\u003e\n\u003cp\u003eThey tumbled backward and crashed into the bulkhead. The Master Chief saw the alien’s shield flicker and fade—\u003c/p\u003e\n\u003cp\u003e—he hammered on the edge of the alien’s gun.\u003c/p\u003e\n\u003cp\u003eThe creature howled soundlessly in the vacuum and dropped the plasma weapon.\u003c/p\u003e\n\u003cp\u003eThe Elite kicked him in the midsection; his shield took the brunt of the attack, but the blow sent him spinning end over end. He slapped his hand against the ceiling and stalled his spin—then dove under the Elite’s follow-up attack.\u003c/p\u003e\n\u003cp\u003eThe Master Chief tried to grab the alien—but their weakened shields slid and crackled over one another.\u003c/p\u003e\n\u003cp\u003eToo slippery.\u003c/p\u003e\n\u003cp\u003eThey bounced down the curved length of the passage. The Master Chief’s boot caught on a railing, twisted—a lance of pain shot up his leg—but he halted their combined momentum.\u003c/p\u003e\n\u003cp\u003eThe Elite pushed away and caught a railing on the opposite side of the passage. Then it turned and sprang back toward the Master Chief.\u003c/p\u003e\n\u003cp\u003eJohn ignored the pain in his leg. He pushed himself at the alien.\u003c/p\u003e\n\u003cp\u003eThey collided—the Master Chief struck with both fists, but the force slid off the Elite’s shields.\u003c/p\u003e\n\u003cp\u003eThe Elite grabbed him and threw him. They both spun into the wall.\u003c/p\u003e\n\u003cp\u003eThe Master Chief was pinned—perfect: he had something to brace against in the zero gravity. He swung his fist, used every muscle in his body, and connected with the alien’s midsection. Its shield shimmered and crackled but some of the momentum transferred. The alien doubled over and reeled backward—\u003c/p\u003e\n\u003cp\u003e—and its hands found the plasma weapon that it had dropped.\u003c/p\u003e\n\u003cp\u003eThe Elite recovered quickly and aimed at the Master Chief.\u003c/p\u003e\n\u003cp\u003eThe Master Chief jumped, grabbed its wrist. He locked his armor’s glove articulation—it became a vise clamp.\u003c/p\u003e\n\u003cp\u003eThey wrestled for control. The gun pointed at the alien—then the Master Chief.\u003c/p\u003e\n\u003cp\u003eThe alien was as strong as the Master Chief.\u003c/p\u003e\n\u003cp\u003eThey spun and bounced off the floor, ceiling, and walls. They were too evenly matched.\u003c/p\u003e\n\u003cp\u003eThe Master Chief managed to force a stalemate: the pistol now pointed straight up between their bodies.\u003c/p\u003e\n\u003cp\u003eIf it went off it would hit them both—one shot at point-blank range might collapse their shields. They’d both fry.\u003c/p\u003e\n\u003cp\u003eThe Master Chief whipped his forearm and elbow over the creature’s wrist and slammed it in the head.\u003c/p\u003e\n\u003cp\u003eFor a split second it was stunned and its strength ebbed.\u003c/p\u003e\n\u003cp\u003eJohn turned the gun into its face—squeezed the firing mechanism. The plasma discharge exploded into the creature. Fire sprayed across its shields; they shimmered, flickered, and dimmed.\u003c/p\u003e\n\u003cp\u003eThe energy splash washed over the Master Chief; his shields drained to a quarter. The internal suit temperature spiked to critical levels.\u003c/p\u003e\n\u003cp\u003eBut the Elite’s shields were dead.\u003c/p\u003e\n\u003cp\u003eHe didn’t wait for the plasma gun to recharge. The Master Chief grabbed the creature with his left hand\u003c/p\u003e\n\u003cp\u003e—his right fist struck an uppercut to the head, a hook to the throat and chest, three rapid-fire strikes with his forearm to its helmet—that cracked and hissed atmosphere.\u003c/p\u003e\n\u003cp\u003eThe Master Chief pushed away and fired the pistol again. The bolt of fire caught the Elite in the face.\u003c/p\u003e\n\u003cp\u003eIt writhed and clawed at nothing. The Elite shuddered . . . suspended in midair; it twitched and finally stopped moving.\u003c/p\u003e\n\u003cp\u003eThe Master Chief shot it again to make sure it was dead.\u003c/p\u003e\n\u003cp\u003eMotion sensors picked up multiple targets approaching down the corridor—forty meters and closing.\u003c/p\u003e\n\u003cp\u003eThe Master Chief turned and double-timed it back to Blue-One.\u003c/p\u003e\n\u003cp\u003eLinda was where he left her, shooting her targets with absolute concentration and precision.\u003c/p\u003e\n\u003cp\u003e“There are more on the way,” he told her.\u003c/p\u003e\n\u003cp\u003e“Reinforcements have already arrived in the bay,” she reported. “Twenty, at least. They’re learning, overlapping their shields—can’t get a good shot in.”\u003c/p\u003e\n\u003cp\u003eStatic crackled over the Master Chief’s COM channel: “Master Chief, this is Captain Keyes. Did you get the NAV database?” The Captain sounded out of breath.\u003c/p\u003e\n\u003cp\u003e“Negative, sir. We’re close.”\u003c/p\u003e\n\u003cp\u003e“We’re bound in-system to retrieve you. ETA is five minutes. Destroy the Circumference ’s database and get out ASAP. If you cannot accomplish your mission . . . I’ll have to take out the station with the Pillar of Autumn ’s weapons. We are running out of time.”\u003c/p\u003e\n\u003cp\u003e“Understood, sir.”\u003c/p\u003e\n\u003cp\u003eThe channel snapped off.\u003c/p\u003e\n\u003cp\u003eCaptain Keyes was wrong. They weren’t running out of time . . . time had already run out. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-the-fall-of-reach-halo-1/page-36.html","bookId":1633,"creation":"Oct 5, 2019 6:23:12 PM","modification":"Oct 5, 2019 6:23:12 PM"}
