{"id":91590,"no":15,"title":"Page 15","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSo how to make it a surprise? That was the real puzzle, and so far he’d come up with exactly nothing; though a nice cozy dinner with her at her place, and an early bedtime, would give him time to probe for hints of what she would really like. Crow had already bought a ring—a 1.8-carat Asscher-​cut diamond with smaller diamonds filling in a channel-​cut platinum band. Crow knew that people considered him an affable goof, but no one could accuse him of being cheap. The question was how to present it. Val was not a flowers and candy sort of woman, and traditionally romantic gestures were somewhat lost on her. Crow needed something unique and very, very smart.\u003c/p\u003e\n\u003cp\u003eInstead…he now had to go fetch his gun and play cops and robbers again. Val would just love that.\u003c/p\u003e\n\u003cp\u003eCrow locked up the shop and switched off the lights, then went into the storeroom and through the doorway that led to his apartment. Like him the place was small and messy and filled with a lot of strange things. The front end of a 1966 Volkswagen Beetle (Crow’s very first car) had been converted into a jukebox and was parked in one corner of the living room. His coffee table was a snowboard on cinder blocks. His clock was a replica of Dali’s melted timepieces. Every inch of the walls was covered with head shots of Crow’s actor friends, interspersed with some very badly painted watercolors Val had done during one of her infrequent artistic phases.\u003c/p\u003e\n\u003cp\u003eHis three cats, Pinetop, Muddy Whiskers, and Koko, flocked around him, rubbing against his legs and mewing for their supper.\u003c/p\u003e\n\u003cp\u003e“Hi, kids. Miss me?”\u003c/p\u003e\n\u003cp\u003ePinetop made his usual, weird little ak-​ak-​ak-​ak sound and walked significantly in the direction of the kitchen. Crow followed dutifully and popped open two cans of aromatic glop, divided it into three equal portions, and laid out their plates. The trio promptly ignored him and set to their feast.\u003c/p\u003e\n\u003cp\u003eHumming to himself, he wandered into the kitchen, drank a Yoo-​Hoo by the open refrigerator door, peering pointlessly at the various Tupperware containers of mystery meat, mystery pasta, and mystery sauce that lurked on each shelf. One vaguely tumescent shape lay swaddled in Saran Wrap. Crow thought it might have been a zucchini, but he just wasn’t sure. He was afraid of it and didn’t want to touch it. He found a piece of celery that didn’t look too hideous and took it over to a large glass aquarium where a rather absurd-​looking guinea pig named Professor Longhair sat meditating on a rock. Crow lifted the top and set the celery down next to the guinea pig, who opened one eye, regarded the limp celery with obvious disdain, and returned to his contemplations. Crow went back to the fridge and had another bottle of the chocolate drink, staring once more at the scientific wonders evolving in there among his bottles of Yoo-​Hoo, Red Bull, and Gatorade. He shut the door and was wondering why he was stalling rather than getting his ass in gear when the phone rang.\u003c/p\u003e\n\u003cp\u003eScooping up the receiver he said, “I’d like to order a large pizza, mushrooms and extra cheese, and an order of fries.”\u003c/p\u003e\n\u003cp\u003e“For God’s sake,” said a voice, soft, laughing.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, ma’am, the person you have reached is not a normal person. Please hang up and try your call again.”\u003c/p\u003e\n\u003cp\u003e“Okay, fine. Bye.”\u003c/p\u003e\n\u003cp\u003e“No! Wait! Hey, baby.”\u003c/p\u003e\n\u003cp\u003e“Hello, idiot.”\u003c/p\u003e\n\u003cp\u003e“You always say the nicest things.”\u003c/p\u003e\n\u003cp\u003e“True,” Val agreed, “but not to you.”\u003c/p\u003e\n\u003cp\u003e“Mm. So…what’s cooking?”\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003e“Don’t I know it?”\u003c/p\u003e\n\u003cp\u003e“No, I mean food. Supper. Turkey soup, to be precise. You are still coming over, aren’t you?” There was a brief moment of silence. “Don’t tell me you aren’t coming over, Malcolm Crow.”\u003c/p\u003e\n\u003cp\u003e“Well—”\u003c/p\u003e\n\u003cp\u003e“Damn it, Crow…”\u003c/p\u003e\n\u003cp\u003e“Hey, babe, duty calls.”\u003c/p\u003e\n\u003cp\u003e“Duty? What duty? Do you have a rush order for rubber vomit? Is there a desperate need for glow-​in-​the-​dark dog poop?”\u003c/p\u003e\n\u003cp\u003e“No, nothing nearly as important as that. Just three psychos on a killing spree.”\u003c/p\u003e\n\u003cp\u003e“Seriously, why can’t you make it? I’ve been cooking since five o’clock. I have actually worked up a sweat.”\u003c/p\u003e\n\u003cp\u003e“Are you covered in turkey blood and gristle?”\u003c/p\u003e\n\u003cp\u003e“No, but I do have a spot of gravy on my good blue shirt.”\u003c/p\u003e\n\u003cp\u003e“You have to learn to control these domestic urges before they become an obsession.”\u003c/p\u003e\n\u003cp\u003e“Ha,” she said dryly, “ha, ha.”\u003c/p\u003e\n\u003cp\u003eCrow had a powerful visceral image of her standing in the bathroom that morning, naked and glorious.\u003c/p\u003e\n\u003cp\u003e“Actually, sweetie, I actually do have some important civic duties to perform.” Briefly, he told her about the manhunt and what Terry had asked of him. There was a considerable silence on the far end of the line. After a while Crow said, “Uh…Val?”\u003c/p\u003e\n\u003cp\u003eThe silence positively oozed out of the phone. Finally, Val muttered, “So, you agreed to go gunslinging for Gus Bernhardt. Isn’t that special?”\u003c/p\u003e\n\u003cp\u003e“Well, not for Gus. Terry asked me, but it’s not like I’m actually going back on the department. Terry wouldn’t ask me to do anything like that. He just wants me to go close down the hayride for the night.”\u003c/p\u003e\n\u003cp\u003e“Carrying a gun.”\u003c/p\u003e\n\u003cp\u003e“Would you rather I went out there without a gun?”\u003c/p\u003e\n\u003cp\u003e“I’d rather you didn’t go out there at all.”\u003c/p\u003e\n\u003cp\u003e“Someone has to.”\u003c/p\u003e\n\u003cp\u003e“You know, there’s this marvelous new invention, maybe you’ve heard of it? Called a telephone?”\u003c/p\u003e\n\u003cp\u003e“We already tried calling Coop. No answer. He must be out with the kids, or walking the grounds, or maybe he really is too stupid to use a phone…and anyway I don’t want to leave that kind of a message on his answering machine. Can you imagine Coop trying to organize things all by himself?”\u003c/p\u003e\n\u003cp\u003eVal had to concede that point. George Cooper was pretty good at running the Haunted Hayride, but when it came time for any real decisive action, he was as useful as a freshly beheaded chicken. Terry had once said that Coop was the only guy who could cause a panic in an empty room. “Okay, so maybe someone does have to go. Why you, though?”\u003c/p\u003e\n\u003cp\u003e“I’m the only guy around. All the local blues are busy being actual cops for a change. Terry needed a gofer who didn’t have his head up his ass.”\u003c/p\u003e\n\u003cp\u003e“Again I ask, why you?”\u003c/p\u003e\n\u003cp\u003e“Oh, we’re just a laugh riot, aren’t we, Miss Guthrie?”\u003c/p\u003e\n\u003cp\u003eThere was another silence, briefer, less bitter. “Okay, okay,” Val said softly, “but please be careful for a change?”\u003c/p\u003e\n\u003cp\u003e“Me? Careful? Hey, careful is my middle name.”\u003c/p\u003e\n\u003cp\u003e“I’m serious, Crow.”\u003c/p\u003e\n\u003cp\u003eHe sobered. “Okay, okay, baby, I promise. No screwing around, and no heroics. And why? ’Cause there won’t be any need for heroics. Just there and back, lickety-​split.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Then you’ll come over here?”\u003c/p\u003e\n\u003cp\u003e“For leftovers?”\u003c/p\u003e\n\u003cp\u003e“No one has ever called me ‘leftovers,’ pal.”\u003c/p\u003e\n\u003cp\u003e“I was thinking of my belly, woman.”\u003c/p\u003e\n\u003cp\u003e“I was thinking of something just south of there.”\u003c/p\u003e\n\u003cp\u003e“Ah,” he said. “I see. Well then, I guess I had better get my ass in gear. Sooner I get those kids out of there—”\u003c/p\u003e\n\u003cp\u003e“…The sooner you get to come over here and taste my goodies.”\u003c/p\u003e\n\u003cp\u003e“Gad, woman, you are in a bold and licentious mood this evening!”\u003c/p\u003e\n\u003cp\u003e“Call it an incentive program to make sure you get here as safe and as soon as possible.”\u003c/p\u003e\n\u003cp\u003e“Whoosh. If you count to three and turn around I’ll probably be already there.”\u003c/p\u003e\n\u003cp\u003eShe called him a nitwit and hung up on him. He looked at the phone for a moment, leaned over and lightly banged his head on the wall a couple of times, then slowly set the receiver down.\u003c/p\u003e\n\u003cp\u003e“Yes, well,” he said aloud as if to counter a return of his desire to stall rather than do what Terry wanted, “let us get a move on, then.”\u003c/p\u003e\n\u003cp\u003eHe went into his bedroom, jerked open the closet door, and fished around on the top shelf until he found a heavy object wrapped in a towel. This he carried over to the bed and carefully unrolled it. Inside the towel was a second cloth smelling faintly of gun oil, and inside this was a Beretta 92F 9mm automatic pistol and several clips. Crow sat down on the side of the bed for a few moments, holding the gun in his right hand, turning it over, weighing it, considering it. He hadn’t worn the gun since he’d quit the department, and even though he’d gotten off the sauce long before he’d turned in his badge, just the sight of the pistol was a link to unhappier times. His drinking had been so bad that Val had broken up with him for two years and wouldn’t start dating him again until after he’d been well into his first year of sobriety. Crow wasn’t one to take a lot of pride in being sober—instead he remembered what it felt like to be a pathetic figure in the eyes of the town, and in Val’s eyes. He never wanted to let her down again, not in any way big or small, no matter how much he really wanted a drink.\u003c/p\u003e\n\u003cp\u003eSighing, he hefted the gun and worked the slide, making sure the breech was clear. He located his box of shells in the closet and methodically loaded the clip. He never kept the clips loaded as the constant stress on the clip’s springs could fatigue the metal, and it had been a long time since he’d fired the thing. He slapped the clip into the grip and double-​checked to make sure the safety was on.\u003c/p\u003e\n\u003cp\u003e“Yippee-​yi-​yo,” he said out loud as he stood and jammed the pistol into his waistband, then danced a little jig as the cold steel burned his skin like a block of ice. “Yikes!”\u003c/p\u003e\n\u003cp\u003eHe pulled off his shirt, put on a T-​shirt with an R. Crumb painting of Son House on it and tucked it in, then put the gun back into the waistband of his pants and pulled his flannel shirt over it.\u003c/p\u003e\n\u003cp\u003eAt the door he paused and glanced at the three cats that were now performing their post-​dinner ablutions, licking their paws and using them to wash their faces.\u003c/p\u003e\n\u003cp\u003e“Don’t stay up too late…and no more cable porn.” He wagged a finger. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-15.html","bookId":2567,"creation":"Oct 5, 2019 5:51:54 PM","modification":"Oct 5, 2019 5:51:54 PM"}
