{"id":91600,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe deer looked at him with that quiet nobility and innate wisdom that some animals seem to possess. Not one trace of fear flickered in those large, dark eyes and it kept its eyes on him as the creature turned and paced halfway around him, edging slightly away.\u003c/p\u003e\n\u003cp\u003e“Wow…” Mike breathed, his voice as soft as the light breeze.\u003c/p\u003e\n\u003cp\u003eThe buck’s eyes seemed unnaturally expressive and unusually intense. Mike felt as if they projected some kind of force that struck him between his own eyes. He tried to breathe and found that it was difficult to fill his lungs. The buck turned its majestically antlered head and looked at the cornfield behind him, then turned again to face Mike. Mike instantly remembered the wrecked car, and he was torn between his awe of this animal and the thought that someone might need his help. He took a small step toward the edge of the road. The deer lowered its head and shook its massive rack of razor-​sharp horns, then raised its head and stared at him. Mike swallowed something the size of a cantaloupe. He waited for maybe thirty seconds and then dared another step. Through the tangle of smashed corn he could see the gleam of metal shimmering with every new bolt of lightning. He took a third step.\u003c/p\u003e\n\u003cp\u003eWith a flash of white the deer leaped at him.\u003c/p\u003e\n\u003cp\u003eMike cried out and staggered back as the front hooves of the deer struck the ground barely a foot from his toes. He fell backward and upward, landing hard with his rump on the blacktop and legs skidding on the mud of the ditch, and the pain from his cracked rib stabbed through him like a spear. Mike cried out and the deer sprang again, and as Mike fell back he looked up in wonder as the deer passed over him, landing with a skittering of hooves on the highway beyond him. The buck wheeled toward him, standing tall and powerful, fire seeming to dance along its antlers as the sky erupted again with white brilliance.\u003c/p\u003e\n\u003cp\u003eGasping in shock and pain, Mike sat up, looking carefully over his shoulder, and then cautiously got to his feet. The world took a few dizzying spins but his rib actually hurt less now, as if falling flat on his back had pushed the jagged ends into place. The buck stood there, legs wide and braced, eyes burning black holes into him.\u003c/p\u003e\n\u003cp\u003eUncertainly, Mike turned to look across the ditch, made a slight gesture toward it, then glanced back to see how the deer would react. The buck reared up and then slammed down with both front hooves. Perhaps it was only a coincidental crash of thunder, but Mike could have sworn that the earth shook when those hooves struck the ground.\u003c/p\u003e\n\u003cp\u003e“Damn!” Mike said and reeled back. He lost balance and tottered on the edge of the ditch, arms flailing, but finally caught himself and felt the road settle down under his feet. The exertion made the pain in his rib flare again, and he squeezed his eyes shut and tried to endure the screaming white-​hot spears of pain in his side. It took the pain a long while to slide down to a level he could bear. He opened his eyes tentatively. The buck had moved a few feet closer to him. Mike could have reached out and touched its muscular front legs, but he dared not. Their eyes met, locked, held. Mike gasped again as he felt the power of that animal’s implacable stare. Something moved in those large, dark eyes. Something old and powerful and wildly beyond Mike’s comprehension. Mike was storm-​tossed by terror, wonder, and confusion, but something…\u003c/p\u003e\n\u003cp\u003eSomething passed between them. Some tiny bit of knowledge, some small breath of understanding.\u003c/p\u003e\n\u003cp\u003eAnd for a moment, a frozen fragment of a second, Mike was not on the road, not standing by his bike, not confronting a great white stag. For a splinter of time Mike Sweeney was in a dark swampy hollow. Everywhere he looked there were fires burning. In some places the bushes and trees were blazing, and in others it was bodies that were burning. Bodies that ran and capered and screamed as they burned. Mike looked down and saw that he held a samurai sword in his hands, the length of the blade covered in blood that was almost black in the firelight. Fire danced and flickered in the parts of the steel that weren’t smeared with blood.\u003c/p\u003e\n\u003cp\u003eMike raised his head and looked around. Malcolm Crow, the guy who owned the hobby shop, lay on the ground near him. He wore a big tank on his back that had a long hose, which was still clutched in his hands. Crow’s eyes were closed and he reeked of gasoline. A line of fire was eating its watch across the grass toward him. There was blood on Crow’s face and his eyes were closed.\u003c/p\u003e\n\u003cp\u003eNear him were two men—a big white guy and an older black guy—both of them were soaked with blood and stared blankly at the sky.\u003c/p\u003e\n\u003cp\u003eMike turned all the way around and he saw Val Guthrie, the woman who owned the big farm outside of town. The one who went out with Crow. She was on her knees, weeping, holding her father in her arms. Her father, Old Man Guthrie, looked dead.\u003c/p\u003e\n\u003cp\u003eEverywhere Mike looked he saw death, and where there wasn’t death there was pain. His mother was there, smiling at him with a mouth that was rimmed with blood. As she looked at him her eyes went from their familiar green to a bloody red and she stepped backward into flame-​tinged shadows and disappeared.\u003c/p\u003e\n\u003cp\u003eA shadow passed over Mike and he turned again to see what had cast it. He turned and looked up…and up. It stood there, impossibly huge, monstrous, towering above the flames, laughing in a voice that rumbled like thunder.\u003c/p\u003e\n\u003cp\u003e“Mine!” the creature hissed, and reached for him.\u003c/p\u003e\n\u003cp\u003eAnd time caught up with him so fast and hard it was like a slap across the face. Mike staggered backward against his bike, knocking it over. The stag twitched, shaking its great rack of antlers again.\u003c/p\u003e\n\u003cp\u003eThe image—dream, whatever it was—still burned in his mind, but already it was starting to fade. Mike tried to catch it, to remember it, knowing on a very deep level that it was important—though he couldn’t begin to guess why—but it faded almost instantly. Becoming fog and then blowing away, leaving only the faintest memory of fear behind like a bad but indefinable smell.\u003c/p\u003e\n\u003cp\u003eThe deer backed away a few steps. It stood there, eying him, waiting for something; then it turned toward Mike’s War Machine and kicked it lightly with a sharp hoof. It kicked it again and looked at Mike. It took Mike a few seconds to understand. He got up very slowly—it was really all he could manage—and stood there, looking from the cornfield to the deer and back again. Another shake of the antlers. Mike advanced toward the bike, and the deer backed away, matching his pace. They never broke eye contact, even as Mike bent down to pick up his bike.\u003c/p\u003e\n\u003cp\u003e“What are y—” Mike began to ask, but stopped. The deer just looked at him with those wise old eyes, and to Mike it felt wrong to actually say anything. He got back on his bike, confused, amazed, even overwhelmed. It’s just a deer, he told himself, trying to make himself listen. Just a deer.\u003c/p\u003e\n\u003cp\u003eYeah , he thought, right . Just a deer, my ass .\u003c/p\u003e\n\u003cp\u003eSlowly, and with great effort, he began to pedal away. He didn’t look over his shoulder again until he was at the bend at the far end of the straightaway. He paused and half turned to look back just in time to see the white deer leap gracefully across the ditch and walk slowly and purposefully into the field between the stalks of crushed and trampled corn.\u003c/p\u003e\n\u003cp\u003e“Man,” Mike said. “Man oh man oh man.”\u003c/p\u003e\n\u003cp\u003eHe turned to the front again and tried to get his confused mind and battered body to solve the problem of getting home, trying not to think about the deer. Or about the wrecked car. Or about the tow-​truck that had tried to run him down. Or about his battered body.\u003c/p\u003e\n\u003cp\u003eOr about Vic’s hard hands waiting for him at home.\u003c/p\u003e\n\u003cp\u003eHe did not want to think of any of these things. All he wanted was to get home and go hide in his room. He struggled on, his legs already weary, his breathing forced. Around him, the night loomed with vast black shadows.\u003c/p\u003e\n\u003cp\u003e2\u003c/p\u003e\n\u003cp\u003eFrom the edge of the cornfield, hidden by the stalks of corn, the white buck watched Mike go. Then it, too, turned away, moving step by measured step on its four hard hooves. Lightning painted corn-​shaped shadows on its white flanks. Between the bursts of light it seemed to vanish, reappearing again as the storm drew closer to Pine Deep and scattered its fireworks across the sky. The deer walked through a space of shadows and then as the next thread of lightning stitched the sky, the creature illuminated was not an albino buck with a massive rack of horns but a gray man in a black suit that was spattered with mud, a guitar slung across his shoulders. He moved just as slowly, along the same angle, and his footsteps began where the marks of the white deer ended.\u003c/p\u003e\n\u003cp\u003eThe Bone Man stopped and looked back the way he’d come. He wore a crooked smile. “Let’s see Tommy Johnson do that,” he said in a voice like a faint wind. “Hell, let’s see Robert Johnson do that.”\u003c/p\u003e\n\u003cp\u003eHe went to the top of a rise and watched as Mike labored over the farthest hill. The Bone Man’s mind burned with the image he’d seen in Mike’s mind. His gray lips formed a single silent word.\u003c/p\u003e\n\u003cp\u003e“Dhampyr.”\u003c/p\u003e\n\u003cp\u003eOverhead, thunder detonated with apocalyptic fury. The night birds took to the sky and uttered their plaintive ululations, like lost souls on the dark breeze. The moon was climbing into the sky, hiding like a criminal behind the storm clouds.\u003c/p\u003e\n\u003cp\u003eThere were hours and hours until dawn, and the night still had work to do.\u003c/p\u003e\n\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eCrow rocketed along the twists and turns of A-32 at unsafe and irresponsible speeds. He found it relaxing. His car was one of those big Impalas from the early seventies: too much engine and about as long as an aircraft carrier. Crow claimed that you could land a plane on the hood and he wasn’t far wrong. It was Hershey Kiss brown except for the right front fender that was an improbable shade of greenish yellow. The interior roof lining sagged down like a windless parachute, constantly tousling Crow’s curly hair, and all of the seats had been patched with duct tape of various vintages. There was red reflector tape over some of the rear lights and one headlight shone askew, giving the car a cross-​eyed look. Crow had found her squatting dispiritedly in a used car lot, bought her at once, and named her Missy after his first girlfriend who’d had the same cross-​eyed beauty.\u003c/p\u003e\n\u003cp\u003eHe tried never to drive Missy at anything less than a breakneck speed. Terry called Missy Crow’s “getaway car” because that’s how he drove it.\u003c/p\u003e\n\u003cp\u003eAfter Terry had left the store, Crow had been mildly amused at his “mission” and the novelty of having some big-​city bad guys fleeing through Pine Deep. It was unreal enough to be funny, and it also tickled his curiosity, though not as much as it would have a few years ago. Back when he was a full-​time cop Crow would have relished this kind of scene. Of course, back then there was even some talk about Crow running for Gus Bernhardt’s job. It was Terry’s opinion that he would have gotten the job if he’d taken even a halfhearted shot at it, and Terry’s opinion held enormous sway in town, but Crow had not wanted the job badly enough. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-25.html","bookId":2567,"creation":"Oct 5, 2019 5:51:54 PM","modification":"Oct 5, 2019 5:51:54 PM"}
