{"id":91603,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBoyd felt warmth on his leg and he peered down. Fat droplets of blood hung pendulously from the slats of the splint, and as he watched, one broke loose and splashed onto the dirt.\u003c/p\u003e\n\u003cp\u003e“Oh, that’s just fucking great!” Boyd snarled. He probed the rough bandages Karl had wound around the shattered leg, and his fingers came away black with wetness. Boyd glared at his bloody fingers for a long time, seething one moment, shivering with fear and fever the next. He half turned and swung his good right arm at the crow. “See what you made me do, you worthless piece of shit!”\u003c/p\u003e\n\u003cp\u003eThe crow shuffled sideways just a few inches and the blow missed cleanly. It fluttered its wings noiselessly and again uttered that strange muted cry.\u003c/p\u003e\n\u003cp\u003eBoyd leaned over as far as his leg would allow him and beat at the bird, but his fiercely scrabbling fingers were inches short of the mark. The bird watched him dispassionately. It was the ugliest bird Boyd had even seen: dirty and disheveled, with greasy wings that shone with oily scum. Boyd grabbed the rail and hoisted himself up, shifting his buttocks to his right just a couple of inches and then beat once more at the bird. The crow took another delicate sideways step, but this time, as Boyd’s fingers clawed at him, the bird darted its head forward and jabbed with its long, sharp beak.\u003c/p\u003e\n\u003cp\u003e“Ow! Shit!” Boyd howled, whipping his hand away and jamming his finger into his mouth. He could taste the salty blood, and when he held the finger out for inspection, he was appalled to see an inch-​long gouge, quite deep and ragged, running from the outside of the nail down past the knuckle. Fresh blood welled from it and ran down between his fingers, onto his palm, and down his wrist.\u003c/p\u003e\n\u003cp\u003eBoyd turned and glared with naked hatred at the bird. “You motherfucker! I’ll fucking kill you, you shit-​ass bitch! I’ll fucking bite your head off and piss down your neck, you little shit bag!”\u003c/p\u003e\n\u003cp\u003eIndifferent to the threats, the bird just watched him, swaying slightly with the vagaries of the wind.\u003c/p\u003e\n\u003cp\u003eA fresh wave of chills swept over Boyd, as if the wind itself had blown its cold breath on him. He shivered so violently that he could hear his teeth actually chatter. Forgetting the bird for the moment, Boyd tried to huddle into himself to keep warm. He yanked his left arm up and stuffed the dead hand into the opening of his jacket and then wrapped himself as best he could with his right. Blood continued to drip slowly and thickly from his torn shin, pooling briefly beneath his leg and then fading as the hungry soil sucked it down into darkness. More blood dripped from his torn finger, dotting his jacket with a decoration of gleaming black red and littering the ground with the salty seeds of his life.\u003c/p\u003e\n\u003cp\u003eThe crow watched him for long minutes, but then slowly raised its head as the clouds overhead were clawed open and the accusing eye of the moon glared down at Boyd and the crow and the endless ranks of silent corn. Boyd became gradually aware of the change in light, and for a while he thought that he was becoming delirious. He remembered hearing someone once say that things got brighter when you were really losing it. Before he could work up a good terror over that thought, he saw the shadow stretched out before him on the ground.\u003c/p\u003e\n\u003cp\u003eThe world once more froze into a microsecond of total terror. Boyd could see his own slumped shadow, etched in the dirt by the fresh moonlight—but above his shadow and spreading out beyond him was a second shape. A man, huge, looming, arms outstretched to seize him.\u003c/p\u003e\n\u003cp\u003eBoyd screamed and fell over, spinning as he did so to see who was lunging at him, his one arm raised in defense, his good leg curling for a kick.\u003c/p\u003e\n\u003cp\u003eOf course it was only the scarecrow.\u003c/p\u003e\n\u003cp\u003eIt hung there, arms supported by the crossbar of the post, faded old work clothes fluttering and snapping in the freshening breeze, jack-​o’-lantern head smiling emptily as it stared out over the field. The crow cawed ironically at him.\u003c/p\u003e\n\u003cp\u003eBoyd sprawled there in the dirt, bleeding, shivering, crippled. Laughing.\u003c/p\u003e\n\u003cp\u003eHe felt it rising within his chest, and before he knew it, before he could stop it, the laughter bubbled up out of him. It erupted from his gut and spilled out like vomit, choking him, twisting his gut, and spasming his chest. It boiled quickly to the level of simple hysteria and flew upward from there. He laughed until tears welled from his eyes and snot bubbled in his nostrils and blood splattered the ground as he beat it with his fist. He shook and shivered and rocked from side to side as the blood erupted from his leg and soaked the greedy dirt.\u003c/p\u003e\n\u003cp\u003eHe couldn’t stop laughing. He would look at the scarecrow and laugh; he would look at the crow and laugh. He wood look at the wide, flat disk of the moon and his lunatic laugh would soar up into the ether. Every once in a while the laughter would be punctuated with a snort, or more often, a sob.\u003c/p\u003e\n\u003cp\u003eHe was laughing even when the scarecrow turned its lumpy head and grinned darkly at him.\u003c/p\u003e\n\u003cp\u003eChapter 8\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eCrow was singing at the top of his lungs as he took the curve on two wheels, feeling Missy lift and tilt and hold in perfect balance, ball joints be damned. The Impala swept gracefully around the curve like a racing sloop rounding a point. Crow was alive with the feel of power and control as he let the steering wheel drift slowly, delicately through his fingers, paying her off into the end of the curve, getting ready for the drop down to all fours.\u003c/p\u003e\n\u003cp\u003eWhich is when the kid on the bike appeared out of nowhere.\u003c/p\u003e\n\u003cp\u003e“Holy shit!”\u003c/p\u003e\n\u003cp\u003eThe kid was just suddenly there, frozen like a startled deer in the splash of Missy’s headlights, and within the split part of a second he seemed to grow from half-​sized to a dimension that filled the entire windshield. Screaming out a string of curses, Crow gave the pedal a hard stomp, steered small and fast so that the car heeled to the right just as he reached the boy, and then steered even smaller as he swerved to the left as he passed. The upraised tires swept along about a yard from the kid’s handlebars and then lunged down at the ground. Missy landed heavily and sped on for a hundred feet, and Crow was pumping the brakes even before the chassis had stopped bouncing.\u003c/p\u003e\n\u003cp\u003eMissy skidded to a halt on the verge as dust swept up around her flanks. Crow threw her into park, killed the engine, and leaped out and sprinted toward the kid.\u003c/p\u003e\n\u003cp\u003eThe boy had barely moved, only turning to watch the car soar by.\u003c/p\u003e\n\u003cp\u003e“Jesus Christ, kid!” Crow yelled as he sprinted up. “That was the stupidest goddamn thing,” he bellowed, “that I’ve ever done!”\u003c/p\u003e\n\u003cp\u003eThe kid blinked at him, half ready to stand up for himself when the words registered. He said, “Huh?”\u003c/p\u003e\n\u003cp\u003e“Christ, I’m sorry, kid,” Crow gasped. “Are you all right? Jesus, that was stupid! Damn, I’m sorry! What the hell was I thinking?”\u003c/p\u003e\n\u003cp\u003e“You…uh, what?” was all the kid could manage to get out.\u003c/p\u003e\n\u003cp\u003eCrow gripped the kid’s upper arms and peered at him. Both of them were shadows in the darkness, featureless in the blackness. “Jesus, Mary, and Joseph, kid, tell me you’re all right.”\u003c/p\u003e\n\u003cp\u003e“Uh, yeah,” the kid said. “Sure.”\u003c/p\u003e\n\u003cp\u003e“Oh, thank God!” Relief flooded up through Crow, nearly matching the towering level of his complete embarrassment and shame. He gave the kid a kind of reassuring shake and froze as the kid winced in real and obvious pain.\u003c/p\u003e\n\u003cp\u003e“Jeez…what’s wrong? Did I hurt you? Did the car—”\u003c/p\u003e\n\u003cp\u003e“No,” the kid hissed, gritting his teeth. “It wasn’t you. It was the tow-​truck.”\u003c/p\u003e\n\u003cp\u003eCrow just looked at the boy’s shadow-​shrouded face, trying to understand why the kid’s statement didn’t make any sense. Crow blinked a couple of times. “The, um…tow-​truck?”\u003c/p\u003e\n\u003cp\u003e“Uh-​huh.”\u003c/p\u003e\n\u003cp\u003e“Ah…and which tow-​truck might that be, son?” Crow said, looking around briefly, assuring himself that no tow-​truck loomed nearby.\u003c/p\u003e\n\u003cp\u003e“The one that tried to kill me,” said the boy.\u003c/p\u003e\n\u003cp\u003e“Oh,” Crow said with a vague smile, “that one. I see.” Kid’s in shock, he thought. Poor bugger.\u003c/p\u003e\n\u003cp\u003eThey looked at each other’s silhouette for a moment, the conversation stalled by the complete lack of understanding on both parts. Above them, the moon peered out from behind a fence of clouds, bathing the kid’s face in a clear, revealing brightness.\u003c/p\u003e\n\u003cp\u003e“Mike!” Crow said with real astonishment.\u003c/p\u003e\n\u003cp\u003e“Crow…?”\u003c/p\u003e\n\u003cp\u003e“Well…shit!” Crow said, half smiling.\u003c/p\u003e\n\u003cp\u003e“Yeah,” agreed Iron Mike Sweeney.\u003c/p\u003e\n\u003cp\u003e2\u003c/p\u003e\n\u003cp\u003eThe Bone Man walked out of Dark Hollow and stepped onto a hill on A-32, not three miles from where Crow and Mike stood. Walking slowly with a lanky gait that made his body look as if it were all bones and rags with no meat at all, he strolled to the center of the road and then stopped, turning to lift his face to the brilliant moonlight. Moonlight glittered on the strings and keys of his guitar. A cloud of bats whirled and danced above him, their tiny bodies looking like torn scraps of shadow in the flickering light from the distant storm. The Bone Man stood and watched them, absently reaching up a thin hand as if anxious to join their carefree gavotte. The bats knew him and did not fly away; all the things that moved in the night knew him, knew the pale shadow of a man who cast no shadow of his own.\u003c/p\u003e\n\u003cp\u003eAll of them knew the Bone Man, the sad-​eyed wanderer, the boneyard refugee. After a while the bats flitted off into the night and he stood alone in a cold wind.\u003c/p\u003e\n\u003cp\u003eThen a night bird with a bloody beak came flapping out of the east and circled him once, twice, three times before wheeling and flapping off into the west, where a lonely farmhouse stood amid a sea of corn. From where he stood on the hill, the Bone Man could see the tiny squares of yellow light dotting two sides of the distant house.\u003c/p\u003e\n\u003cp\u003eHe considered the house, looking far and long and into it, reading its fortune in the call of the crickets and the rustle of the corn. He smelled blood on the wind, and some of it, he knew, was not yet spilled. There was still so much of this night left.\u003c/p\u003e\n\u003cp\u003eThe Bone Man turned his rake-​handle-​thin body to the east and listened to the wind. There were sounds on it. Laughter, the cries and gasps of young lovers, the screech of tires, the lonely and distant drone of a tractor-​trailer whining along the back stretch of the highway, the call of owls, the deep barking of a dog. The high, sharp wail of a man in absolute terror and unbearable pain, a sound that faded and then abruptly stopped with a wet, guttural gurgle. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-28.html","bookId":2567,"creation":"Oct 5, 2019 5:51:54 PM","modification":"Oct 5, 2019 5:51:54 PM"}
