{"id":91619,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Who is this? We have a very bad connection, so please speak up.”\u003c/p\u003e\n\u003cp\u003e“Terry, he’s back!” said the voice, and that was quite clear.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, who’s back? Who is this?”\u003c/p\u003e\n\u003cp\u003e“Terry. You have to do something.”\u003c/p\u003e\n\u003cp\u003e“Listen to me,” he said loudly and clearly, “you’ve reached the chief’s department in Pine Deep. Are you hurt or in trouble?”\u003c/p\u003e\n\u003cp\u003eNothing but the hiss of an open line.\u003c/p\u003e\n\u003cp\u003e“Little girl…? Can you hear me?”\u003c/p\u003e\n\u003cp\u003eAcross the room Detective Sergeant Ferro and his cronies were looking at him.\u003c/p\u003e\n\u003cp\u003e“Little girl? Are you still there?”\u003c/p\u003e\n\u003cp\u003e“Terry?” The voice was plaintive, sounding scared, but still distorted as if by a vast distance. “He’s back, Terry. He’s back and he’s going to hurt people again.”\u003c/p\u003e\n\u003cp\u003e“Hurt who? Little girl…who’s going to be hurt?”\u003c/p\u003e\n\u003cp\u003e“He’s back….”\u003c/p\u003e\n\u003cp\u003e“Little girl, tell me your name.”\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003e“This is the mayor. Please tell me your name and where you’re calling from.”\u003c/p\u003e\n\u003cp\u003eStill nothing. Gus Bernhardt was lumbering across the room toward him, a deep frown on his florid face.\u003c/p\u003e\n\u003cp\u003e“You have to stop him, Terry,” whispered the tiny voice.\u003c/p\u003e\n\u003cp\u003e“Where are you calling from? Little girl? Little girl?” He kept calling for her to answer, but the sound on the phone had changed. Now there was just dead emptiness. Gus reached out for the phone, held it to his own ear for a moment, then set it back on the cradle.\u003c/p\u003e\n\u003cp\u003e“What gives?” he asked.\u003c/p\u003e\n\u003cp\u003e“Weird call,” said Terry, shaking his head and scratching his red beard. “Some little kid called.” He knew that voice, too, but he didn’t dare say it, and unconsciously tapped his pocket to make sure the pill case with the antipsychotics and the Xanax was still there.\u003c/p\u003e\n\u003cp\u003e“You heard a kid on that phone?” Gus asked, half smiling.\u003c/p\u003e\n\u003cp\u003e“Yeah, and she was going on about—”\u003c/p\u003e\n\u003cp\u003e“Uh, wait a minute, Terry, let me get this straight…you got a phone call on that phone and it was some little kid?”\u003c/p\u003e\n\u003cp\u003e“A little girl, yeah.”\u003c/p\u003e\n\u003cp\u003e“On that phone?”\u003c/p\u003e\n\u003cp\u003e“No, on two other phones,” snapped Terry viciously. “Yes, of course on this phone. What, are you deaf? You saw me talking to her.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m not deaf, but you must have the greatest set of ears in the Western world if you got a phone call on that line.”\u003c/p\u003e\n\u003cp\u003e“What the heck are you talking about…?”\u003c/p\u003e\n\u003cp\u003eStill half smiling, Gus bent and snatched up the cord that came out of the back of the receiver. He reeled it up, speaking as he did so. “Since we cut back on staff, we don’t use these desks back here much,” he said. “These phones have all been disconnected.”\u003c/p\u003e\n\u003cp\u003e“Not this one, for Pete’s sake. I was just talk—”\u003c/p\u003e\n\u003cp\u003eHis voice went flat and fell silent as Gus pulled up the end of the cord and presented it with a flourish. The plug stood up between his thick fingers.\u003c/p\u003e\n\u003cp\u003eTerry looked at it and then bent low and looked under the desk at the wall. He could see no wall jack, and eventually had to shift the desk and move a trash can before he found one. Slowly he straightened and looked at the plug.\u003c/p\u003e\n\u003cp\u003eGus said, “No way this was even plugged into the wall. The cord was just coiled up under the desk.”\u003c/p\u003e\n\u003cp\u003e“I’m telling you, Gus…I heard that phone ring and I heard that kid talking.”\u003c/p\u003e\n\u003cp\u003eGus stared at him for a long five count, then shrugged. “What can I say, Terry?”\u003c/p\u003e\n\u003cp\u003eTerry snatched the plug out of Gus’s hand and glared at it. He opened his mouth but couldn’t manage to say anything. He had heard the voice. Her voice.\u003c/p\u003e\n\u003cp\u003eMandy’s voice.\u003c/p\u003e\n\u003cp\u003eThe room started spinning around him and he almost turned and ran when Detective Sergeant Ferro’s voice cut through all the chatter in the room.\u003c/p\u003e\n\u003cp\u003e“It’s the officers at the wreck site,” he said tersely. “They found something!”\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003e“Yo! Boyd—shift your ass!” called Ruger as he rounded the bend and followed Val and Guthrie into the clearing.\u003c/p\u003e\n\u003cp\u003eThey stood still, bearing the white kitchen door between them. Val was staring fixedly at the many scattered pools of dark blood that glistened like black pools of oil in the moonlight; Guthrie stood looking up at the scarecrow’s post, which was also streaked with clawed finger-​trails of blood just below where the straw-​filled dummy’s shoes stood on their perpetual post.\u003c/p\u003e\n\u003cp\u003eAt the edge of the clearing, Karl Ruger stood with his jaunty smile cracking and flaking away in the freshening night breeze.\u003c/p\u003e\n\u003cp\u003e“So much blood…” Val whispered.\u003c/p\u003e\n\u003cp\u003eRuger’s face underwent a slow change. The reptilian smile had given way to surprise and confusion, but now his features darkened with all the rage of a storm front moving over a troubled sea. Lightning flashed from his eyes and his lips furled back from white teeth as he ground them in mounting, boiling rage. Like a wolf at the moment of the kill, his nose wrinkled and his eyes were slashed to slits as the rage in him built and then burst forth.\u003c/p\u003e\n\u003cp\u003e“Boyd!” he bellowed, his voice rising like a roll of heavy thunder. “Boyd!”\u003c/p\u003e\n\u003cp\u003eHis voice changed, the words tangling into a steady and inarticulate growl of fury as he tore across the clearing, kicking aside cornstalks, poking into rows of plants, leaning over fences, searching, searching, searching…\u003c/p\u003e\n\u003cp\u003eBoyd, however, was gone. The bags of money and cocaine were gone.\u003c/p\u003e\n\u003cp\u003eOnly the blood remained.\u003c/p\u003e\n\u003cp\u003eThe blood and a single bloodstained fifty-​dollar bill stuck fast to the bottom of the scarecrow’s shoe, held by the tacky gore, fluttering in the breeze.\u003c/p\u003e\n\u003cp\u003eRuger howled in rage and dropped to his knees, beating the ground with the flashlight and the butt of his pistol. The lens of the flashlight shattered and the light flared and then burst into darkness and splintered glass.\u003c/p\u003e\n\u003cp\u003e“Boyd!” Karl yelled. “Boyd, you rotten motherfucker!”\u003c/p\u003e\n\u003cp\u003eVal dropped the wheelbarrow handles and shrank against her father’s side; they both cringed back from the towering rage and animal ferocity that burst forth from Ruger.\u003c/p\u003e\n\u003cp\u003e“Boyd! Where’s my goddamned money!”\u003c/p\u003e\n\u003cp\u003eRuger tossed away the broken flashlight, balled his left fist into a mallet of gristle and bone, and punched down at the ground, and again, and again. The shock raced up his arm, flaring with pain as the fragments of the broken lens tore his skin, but the pain only stoked his rage. He kept punching the ground, over and over and over.\u003c/p\u003e\n\u003cp\u003e“Where’s my goddamned money, you spineless piece of shit!” His words were whipped into the sky by the fierce winds of the coming storm.\u003c/p\u003e\n\u003cp\u003eGuthrie suddenly grabbed Val by the upper arm, pulled her close, and said in a fierce whisper, “Run!”\u003c/p\u003e\n\u003cp\u003eHe didn’t allow her the chance to object, but turned and shoved her toward the path that led away from the farmhouse, the access trail that went down to the main road. She staggered for two steps, and almost pitched forward, but then she bent low, dropping her center of gravity like a sprinter, and brought her weight back to the balance point. Off she went like a shot, her toes digging into the soft earth, and she was so fast that fifty yards were unreeling behind her before Karl Ruger was even aware of her flight.\u003c/p\u003e\n\u003cp\u003eGuthrie didn’t waste any time himself. Even as he shoved Val in one direction, he wheeled and made a dash for the house. He was old, but he could run a half mile if the devil was on his heels, which indeed he was.\u003c/p\u003e\n\u003cp\u003eIt took just two seconds for Ruger to understand what was happening, for him to claw himself out of his web of rage and realize that his captive birds had flown.\u003c/p\u003e\n\u003cp\u003e“Shit!” he growled and leaped to his feet. He started after Val, but before he’d even taken a full step he realized that he’d never catch her. She was already around the farthest bend and running like the wind.\u003c/p\u003e\n\u003cp\u003e“Bitch!” he growled, and then turned and pointed at the retreating back of old man Guthrie, taking aim with a two-​hand grip. Lightning flashed continuously, illuminating the man with enticing clarity, and the ghost of his old smile flickered on his lips as Ruger pulled the trigger.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003e1\u003c/p\u003e\n\u003cp\u003eTerry Wolfe and the detectives made it to the crime scene in less than ten minutes. Their late-​model dark Ford rocketed along, leaving Chief Bernhardt’s five-​year-​old police unit far behind. Terry sat in the back, gripping the door handle with one hand and the back of Ferro’s seat with the other. His face was pasty with terror, but most of his dread came from his memory of that phone call. It couldn’t have been Mandy, he thought, clinging to his denial, needing to be certain that reality was reality and no matter what he thought he’d heard he had been mistaken. That’s impossible.\u003c/p\u003e\n\u003cp\u003eThe car leaped and skidded and tore like a demon wind along the blacktop and it jolted him back to the moment.\u003c/p\u003e\n\u003cp\u003e“God!” he whispered as the car took a curve on fewer wheels than Henry Ford had intended, then bounced down onto all fours and swooped hawklike down a long hill. They rounded another, wider curve and saw two revolving dome lights in the distance. LaMastra actually accelerated down the hill and then screeched and slewed the car to a sideways stop that sent up curls of rubber smoke from all four wheels. “Oh my Lord!” Terry gasped, his finger still digging into the upholstery. “Where did you learn to drive like that?”\u003c/p\u003e\n\u003cp\u003eLaMastra grinned at him in the rearview mirror. “Old Steve McQueen movies.”\u003c/p\u003e\n\u003cp\u003e“My heart stopped beating miles back,” Terry complained.\u003c/p\u003e\n\u003cp\u003eFerro looked faintly amused. “You’ll have to forgive the detective. He lives for this kind of thing. It’s what he does in lieu of having an actual life.”\u003c/p\u003e\n\u003cp\u003eLaMastra chuckled and leaped out of the car; Ferro followed, bringing with him a large, heavy briefcase.\u003c/p\u003e\n\u003cp\u003eTerry slowly unstuck his fingers and reached for the door handle. He stepped out of the car in the same shaky way that novices depart a particularly aggressive roller-​coaster ride, placing his feet on the ground as if uncertain that it would hold him.\u003c/p\u003e\n\u003cp\u003eOfficer Rhoda Thomas came jogging over to them, pale and uncertain. She carried a huge shotgun at port arms. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-44.html","bookId":2567,"creation":"Oct 5, 2019 5:51:55 PM","modification":"Oct 5, 2019 5:51:55 PM"}
