{"id":91648,"no":73,"title":"Page 73","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCrow was touched. “Jesus, man, you are a saint.”\u003c/p\u003e\n\u003cp\u003e“Least I could do,” Head said. “Even though it was just for a couple of hours, Rhoda was my partner last night.”\u003c/p\u003e\n\u003cp\u003eCrow nodded. “Sit down—sit down and keep me company. Open these cupcakes for me and let’s have a feast.”\u003c/p\u003e\n\u003cp\u003eThey lapsed into a conversation about the job, Crow relating some stories about small-​town police work and Head talking about the streets of Philadelphia. Their rhythm was almost immediately comfortable and friendly, and Crow found he liked the Philly cop quite a bit. He was touched by the big man’s thoughtfulness, and by his loyalty to Rhoda.\u003c/p\u003e\n\u003cp\u003e“So, where do you guys stand with all this?” Crow asked.\u003c/p\u003e\n\u003cp\u003e“Shit if I know.” He told Crow about Boyd being spotted. “So with Macchio dead, that just leaves Ruger.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Which kind of brings me to the other reason I wanted to talk with you.”\u003c/p\u003e\n\u003cp\u003eCrow nodded his encouragement.\u003c/p\u003e\n\u003cp\u003eHead said, “I was on the porch and just caught the tail end of the firefight between you and Ruger. As you may remember I fired off some rounds myself.”\u003c/p\u003e\n\u003cp\u003e“Vaguely remember something. I was pretty well out of it by then.”\u003c/p\u003e\n\u003cp\u003e“My question is—did you hit Ruger? I mean, are you sure you hit him?”\u003c/p\u003e\n\u003cp\u003e“Your boss, Ferro, asked me the same thing. So has everyone else, and I’ll tell you what I told them.”\u003c/p\u003e\n\u003cp\u003e“Which is?”\u003c/p\u003e\n\u003cp\u003e“I’m absolutely fucking positive I hit him. At least three times, and maybe as much as five times.”\u003c/p\u003e\n\u003cp\u003e“No doubts?”\u003c/p\u003e\n\u003cp\u003e“No doubts. I saw the impacts, saw his body jerk with each shot.”\u003c/p\u003e\n\u003cp\u003e“What about a vest? Could he have been wearing body armor?”\u003c/p\u003e\n\u003cp\u003e“No way in hell. I fought him hand to hand before that, Jerry, and I know damn well I was hitting meat and muscle, not Kevlar.”\u003c/p\u003e\n\u003cp\u003eHead nodded and sat back, sipping his Coke. “Yeah, that was my read on it, too. I saw you shoot him. I’m pretty sure I missed, but I’ll go before a judge and swear that I saw at least two or three of your shots nail him.”\u003c/p\u003e\n\u003cp\u003eThey looked at each other in silence for a moment.\u003c/p\u003e\n\u003cp\u003e“You want to ask it, or shall I?” Crow said.\u003c/p\u003e\n\u003cp\u003e“You mean…with a hundred searchers and five teams of dogs, how did a man with five bullets in him disappear?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Man, I don’t even know. Fucker’s painted with magic.”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eAt that point the door opened again and Mike Sweeney poked his head into the room. He saw the officer and stopped, silent.\u003c/p\u003e\n\u003cp\u003e“Come on in,” Head said, rising. “I’m leaving anyway.” He reached out again and shook Crow’s hand. “I hope your lady and her family come through this okay.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Crow said. “That means a lot.”\u003c/p\u003e\n\u003cp\u003eHead turned and as he passed Mike he gave the boy a quick appraising glance, taking in the bruises. He turned briefly to Crow, eyebrows raised significantly, and then left without comment.\u003c/p\u003e\n\u003cp\u003eMike came over and sat down, dragging the chair closer to the bed.\u003c/p\u003e\n\u003cp\u003e“Dude!” Mike said. “Look at your face!”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, look at yours, too. What the hell happened to you?” And as soon as he asked the question Crow wished he could take it back. He remember Barney’s account of how Vic had beaten Mike when he picked him up.\u003c/p\u003e\n\u003cp\u003e“I, uh…”\u003c/p\u003e\n\u003cp\u003e“Fell off your bike again?” Crow asked, one eyebrow raised.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Crow said, and then had to leave it there because Mike was clearly not going to go any more distance down that conversational street. He didn’t let it show on his face, but he made a mental note to look up Vic one of these days and find some way to kick the living shit out of him and yet not wind up in jail, or in court. That son of a bitch was way overdue for an attitude adjustment.\u003c/p\u003e\n\u003cp\u003eHe sighed. “Thanks for coming, kiddo. Did you get the—”\u003c/p\u003e\n\u003cp\u003eMike suddenly grinned and dug into his jacket pocket. “I got the key from the lady at the yarn shop. I fed the cats, too.”\u003c/p\u003e\n\u003cp\u003e“Oh, jeez, I totally forgot about them!”\u003c/p\u003e\n\u003cp\u003e“They peed on the rug.”\u003c/p\u003e\n\u003cp\u003e“Swell. It’s their way of expressing disapproval at my tardiness.”\u003c/p\u003e\n\u003cp\u003e“They peed on your coffee table, too. I had to throw out your magazines and some of the mail was wet. I put that in the sink.”\u003c/p\u003e\n\u003cp\u003e“Little furry bastards.”\u003c/p\u003e\n\u003cp\u003e“Anyway…I got the box you wanted.” He produced a small box that was an inch and a half square and covered with navy blue velvet. Crow took it carefully and opened it. The engagement ring fairly lit the room with its brilliance. The Asscher-​cut stone was huge—nearly two carats—and according to the salesman, it was a nicely cut, G Color, VS1 clarity diamond—and it had put a serious dent in his savings, to which Crow did not even blink.\u003c/p\u003e\n\u003cp\u003e“Whaddya think?” he asked Mike.\u003c/p\u003e\n\u003cp\u003e“Is it real?”\u003c/p\u003e\n\u003cp\u003e“Duh!”\u003c/p\u003e\n\u003cp\u003e“Wow! Are you going to propose to her? I mean—here? In the hospital and all?”\u003c/p\u003e\n\u003cp\u003eCrow grinned. “Ever heard of distraction therapy?”\u003c/p\u003e\n\u003cp\u003e“No. But I get the idea.”\u003c/p\u003e\n\u003cp\u003eCrow closed the box and hid it in his bedside table. “Look, Mike, there’s something else I wanted to talk to you about.”\u003c/p\u003e\n\u003cp\u003eMike tensed, and Crow could see it, but he gave the boy an affable smile. “Rumor has it that I’ve been shot. As a mortally wounded person I can’t be expected to manage the daily affairs of a business as critical and cutting edge as mine. I mean—if a kid needs a tube of vampire blood, how is someone in my condition supposed to get it for him? The whole industry would come crashing down.”\u003c/p\u003e\n\u003cp\u003eGrinning, Mike said, “Can’t have that.”\u003c/p\u003e\n\u003cp\u003e“So, as the proprietor of the town’s most prestigious boutique for the gruesome and horrific I thought it might be time to hire myself an Igor. You appear to have an appropriate hump…what do you say?”\u003c/p\u003e\n\u003cp\u003eMike’s face beamed with happiness. “You’re offering me a job?”\u003c/p\u003e\n\u003cp\u003e“Well, if you can call hours of endless toil and drudgery for little pay and occasional scorn and derision from a heartless taskmaster a job, then yes.”\u003c/p\u003e\n\u003cp\u003eMike jumped to his feet, then froze, wincing and gasping. “Ouch!” he said, standing hunched over in pain, then immediately followed it with, “I’m in! Oh my God! Thanks!”\u003c/p\u003e\n\u003cp\u003eCrow held up a cautionary finger. “I will have to call you Igor, though, you understand this?”\u003c/p\u003e\n\u003cp\u003e“I believe,” said Mike, laughing, “that it’s pronounced Eye-​gor.”\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eMayor Terry Wolfe sat in the doctors’ lounge drinking Glenkinchie from a Dixie cup, his elbows resting on his knees, the cup held lightly in his big hands. Head low between hunched shoulders, he stared moodily at the irregularities of the wax coating on the cup, breathing through his nose and sighing every eighth or ninth breath.\u003c/p\u003e\n\u003cp\u003eHe had just spent an unproductive hour in a late meeting with the town selectmen, trying to calm them, cajole them, make them believe that everything was under control, when it was quite clear that not one damn thing was under control. Somehow during the last two days, Pine Deep had sunk up to its ass in shit. That’s how he thought about it. No more silly euphemisms for it, no more Sunday school expletives like “darn” or “heck.” Not today. Nope, not for Terry Wolfe. Not after that little elevator ride. Not after the things he’d seen last night. Not after the nurse hearing a roar coming from this very room while he was sleeping. Not after what happened to the arms of the leather chair.\u003c/p\u003e\n\u003cp\u003eNot after looking into the bathroom goddamn mirror again not five goddamn minutes ago.\u003c/p\u003e\n\u003cp\u003eTerry sipped the scotch and winced. He really loved scotch, but right now it tasted like boiled socks. On the way back to the hospital from the meeting he’d stopped in the liquor store and laid down forty-​four bucks and change for the bottle and would normally had savored every sip. Now he just drank it and hoped that it would either flush out his brain or knock him blind and senseless. Either one would work. He had even held out the reasonable hope that the drug interaction between the scotch and the Xanax would do the trick, but it didn’t. He couldn’t even passively kill himself.\u003c/p\u003e\n\u003cp\u003eHe had never felt so powerless in his life.\u003c/p\u003e\n\u003cp\u003eNo. That wasn’t true.\u003c/p\u003e\n\u003cp\u003eThirty years ago, almost to the day, he’d felt even more helpless, and that was a cold hard fact. That had been the day that Mandy had died and he had been nearly killed. He’d spent weeks in the hospital and even now, after cosmetic surgery and three decades, his chest and shoulder still looked like patchwork.\u003c/p\u003e\n\u003cp\u003eThinking about that made drinking more urgent, so he swallowed the whole cup and refilled it. The bottle was down about a third and he could feel the paint peeling on the walls of his brain, but he was still way too sober and he was still alive.\u003c/p\u003e\n\u003cp\u003eHe hefted the bottle and considered it, wondering how much of it he would have to drink before he succumbed to alcoholic poisoning, and then wondered if his system would rebel first and throw it up. Probably. His gut felt like an acid wash.\u003c/p\u003e\n\u003cp\u003eIt was all falling apart. Everything. The cops and the feds pretended to defer to him as if he were a person of some actual importance, but he could see in their eyes that he was just a figurehead in a pissant little town where the worst and most typical crime was overtime parking, and the local idea of a crisis was rain on Sidewalk Sale Saturday. His best friend was in the hospital. The town’s most prosperous farmer was dead. The selectmen were in a panic. Every night he had those horrible dreams—dreams that were now intruding into his waking life.\u003c/p\u003e\n\u003cp\u003eAnd my little sister’s ghost wants me to kill myself.\u003c/p\u003e\n\u003cp\u003eHe raised the refilled cup in a toast. “Here ya go, Mandy. Maybe this one will do it.” He closed his eyes, tossed back the shot, hissed as the gasses burned his throat, and then opened his eyes again. Nope. Still alive, damn it.\u003c/p\u003e\n\u003cp\u003eTerry closed his eyes for a moment, took in a deep steadying breath, held it for a moment, and then let it out as slowly as he could. Then he took his cell phone from his coat pocket and hit speed-​dial. It rang four times before a woman answered. “Hello?” \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-road-blues-pine-deep-1/page-73.html","bookId":2567,"creation":"Oct 5, 2019 5:51:55 PM","modification":"Oct 5, 2019 5:51:55 PM"}
