{"id":102048,"no":18,"title":"Page 18","content":"\u003cp\u003e\"They\u0027re here!\" Rosalie shouted from the living room. Her voice rose with excitement. She\u0027d gone to look out the window every few minutes, waiting for their daughter and her husband.\u003c/p\u003e\n\u003cp\u003e\"Is it Donna?\" Harry asked. He was no less excited than his wife.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Rosalie said, letting the curtain fall back into place.\u003c/p\u003e\n\u003cp\u003eHarry struggled to get to his feet, and instantly Rosalie was at his side. She brought him the walker he hated and then slid her arm around his waist, guiding him into the hall.\u003c/p\u003e\n\u003cp\u003e\"How do I look?\" she asked.\u003c/p\u003e\n\u003cp\u003eHarry pretended to study her, noting her carefully combed hair, a soft lovely gray, and the antique cameo she wore with her dark green dress. \"You couldn\u0027t be more beautiful if you\u0027d tried.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Harry.\"\u003c/p\u003e\n\u003cp\u003eAt his words, Harry could see the blush of pleasure that crept across her cheeks.\u003c/p\u003e\n\u003cp\u003eThe door opened and in breezed his daughter, with Richard, their son-in-law, both of them laden with parcels and bags. Soon everyone was kissing and hugging. Rosalie had tears in her eyes and, for that matter, so did Harry. Seeing his daughter renewed his waning strength.\u003c/p\u003e\n\u003cp\u003eAll their married life, Rosalie had been a gracious hostess, and as soon as Donna and Richard had taken their coats off, she led them to the formal living room and brought out a tray of coffee and cookies.\u003c/p\u003e\n\u003cp\u003eDonna helped serve, and before long they were all sitting together, chatting and catching up. Harry watched his daughter\u0027s animated gestures, and his heart swelled with love. In appearance, Donna resembled Rosalie\u0027s family, with her dark brown hair and eyes. Her personality, though, was all his. She was practical but enjoyed taking a risk now and then.\u003c/p\u003e\n\u003cp\u003eDonna was a teacher and had taught kindergarten and first grade for nearly thirty years. She was close to retirement, as was Richard. They\u0027d met in college and married soon after. They\u0027d presented him with two wonderful grandsons, two years apart.\u003c/p\u003e\n\u003cp\u003e\"Tell me about Scotty,\" Rosalie said, eager for news of their youngest grandson. In a recent conversation, Donna had hinted that she had something special to share.\u003c/p\u003e\n\u003cp\u003eDonna and Richard smiled at each other, and Richard reached for his wife\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"Scott\u0027s engaged!\" Donna said happily.\u003c/p\u003e\n\u003cp\u003e\"Is it Lana?\" Harry asked. Their grandson had stopped by to visit in September and had brought a young woman to meet them. Harry recognized the look in his eyes. The boy was in love.\u003c/p\u003e\n\u003cp\u003e\"Yes. Everyone likes Lana,\" Donna said. \"We\u0027re all so pleased. Rich and I recently met her parents, and they\u0027re just as thrilled as we are.\"\u003c/p\u003e\n\u003cp\u003e\"When\u0027s the wedding?\" Rosalie asked.\u003c/p\u003e\n\u003cp\u003e\"February,\" Donna told her mother.\u003c/p\u003e\n\u003cp\u003e\"So soon!\" his wife trilled, her eyes glowing. \"Oh, I\u0027m so glad.\"\u003c/p\u003e\n\u003cp\u003e\"Lana wanted to wait for June,\" Donna said, \"but Scott said a Valentine wedding was more romantic.\"\u003c/p\u003e\n\u003cp\u003e\"Who would\u0027ve guessed that about Scott?\" Richard asked.\u003c/p\u003e\n\u003cp\u003eRosalie glanced at Harry and they exchanged a smile. \"He gets his romantic heart from his grandfather.\"\u003c/p\u003e\n\u003cp\u003e\"Dad?\" Donna did an exaggerated double take.\u003c/p\u003e\n\u003cp\u003e\"Your father\u0027s sent me flowers every Valentine\u0027s Day since the year we met. Even during the war.\" Her eyes filled with tears as she looked at him. Pulling her lace-edged handkerchief from her sleeve, she dabbed her cheeks. \"This is such good news, isn\u0027t it, dear?\"\u003c/p\u003e\n\u003cp\u003eHarry nodded. All his grandchildren would be married now. Although Harry had only met Lana that one time, he believed the young woman was a good match for his youngest grandson.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not our only news,\" Donna said. Once again she smiled at Richard. \"Phillip called last week and Tiffany\u0027s pregnant.\"\u003c/p\u003e\n\u003cp\u003eRosalie squealed with delight.\u003c/p\u003e\n\u003cp\u003e\"Rich and I are going to be grandparents.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, my goodness,\" Rosalie said, clasping her hands. \"That means Harry and I will be great-grandparents.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re much too young to be a great-grandmother,\" Harry teased, just so he could watch Rosalie blush once more.\u003c/p\u003e\n\u003cp\u003e\"Nonsense,\" his wife countered. \"Some of our friends are great-grandparents several times over.\"\u003c/p\u003e\n\u003cp\u003eThat was true, and Harry didn\u0027t bother to comment. He\u0027d hoped to live long enough to meet his first great-grandchild but that wasn\u0027t to be.\u003c/p\u003e\n\u003cp\u003eRichard helped himself to another cookie. Rosalie had picked them up at the bakery on Saturday, and although he wouldn\u0027t tell her this, Harry thought they were as good as any she might have baked. Actually, he wouldn\u0027t mind a second one himself. As soon as he stretched out his arm, Rosalie immediately lifted the platter and offered it to him.\u003c/p\u003e\n\u003cp\u003eDonna was still talking about the baby. She\u0027d be the perfect grandmother, Harry knew. She\u0027d been an excellent mother, and after all those years spent teaching six- and seven-year-olds, she had a real way with kids. Donna\u0027s students loved her; it wasn\u0027t unusual for teenagers and adults to come and see her - people, who at one time, had been in her class.\u003c/p\u003e\n\u003cp\u003e\"When\u0027s Tiffany due?\" Rosalie asked.\u003c/p\u003e\n\u003cp\u003e\"July,\" Donna said. \"We don\u0027t know if it\u0027s a boy or a girl, although I don\u0027t think anyone really cares. The timing is certainly good.\"\u003c/p\u003e\n\u003cp\u003eRichard smiled. \"Phillip\u0027s out of graduate school now and the job he got with Microsoft seems secure. Or as secure as any corporate job is these days.\" He turned to Harry, who nodded. Over the years, they\u0027d often discussed the economy and related issues.\u003c/p\u003e\n\u003cp\u003e\"Phillip does a bit more traveling than either of them would like,\" Donna added, \"but he\u0027s in training, so that goes with the territory.\"\u003c/p\u003e\n\u003cp\u003eRichard sipped his coffee. \"I understand the two of you are planning to sell the house,\" he said.\u003c/p\u003e\n\u003cp\u003eRosalie sighed and aimed a sad smile at Harry.\u003c/p\u003e\n\u003cp\u003e\"Unfortunately we had some bad news regarding Liberty Orchard,\" Harry told him. In retrospect he\u0027d give just about anything to have handed the administrator a check for the deposit the day they\u0027d toured the facility. \"Apparently the only available unit has already been taken.\"\u003c/p\u003e\n\u003cp\u003eDonna leaned forward. \"That\u0027s what Mom said, so I phoned Liberty Orchard and talked to Elizabeth Goldsmith myself.\"\u003c/p\u003e\n\u003cp\u003e\"She can\u0027t wave a magic wand and make another unit appear.\" Harry didn\u0027t want to admit how much the news depressed him. This was to be his last gift to Rosalie before he died, and now it wasn\u0027t going to happen.\u003c/p\u003e\n\u003cp\u003e\"When I phoned,\" Donna went on to say, \"Ms. Goldsmith said she was just about to contact you.\"\u003c/p\u003e\n\u003cp\u003e\"The unit\u0027s available?\" Harry felt a surge of hope.\u003c/p\u003e\n\u003cp\u003e\"Not the one you originally saw, but another one.\"\u003c/p\u003e\n\u003cp\u003e\"Did someone die?\" Rosalie asked, frowning.\u003c/p\u003e\n\u003cp\u003e\"No, it belonged to a couple. Perhaps you met them. Ralph and Daisy - I can\u0027t remember their last name.\"\u003c/p\u003e\n\u003cp\u003e\"McDonald,\" Harry supplied. He remembered talking with the two and had quite liked them. Their children both lived in Chicago. \"Are they moving closer to their son and daughter?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"When?\" Rosalie asked.\u003c/p\u003e\n\u003cp\u003e\"They hope to be out by the fifth of January. It\u0027ll take a couple of days to give the unit a thorough cleaning and then it\u0027ll be ready for you and Dad by the tenth.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get them a check right after Christmas,\" Harry said, unable to hide his pleasure.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all taken care of, Dad,\" Donna said. \"I knew you\u0027d want the unit, so Rich and I put it on our credit card.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get the check to you then. Immediately.\" The fact that they\u0027d used credit bothered him; he couldn\u0027t help it.\u003c/p\u003e\n\u003cp\u003eDonna gestured magnanimously. \"Consider it your Christmas gift.\"\u003c/p\u003e\n\u003cp\u003eHarry wouldn\u0027t allow his daughter to do that; still, the certainty of acquiring the unit afforded him real peace of mind.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s wonderful news,\" Rosalie agreed, nodding vigorously.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s even better than you realize,\" Donna said. \"I\u0027ll be here the entire time to help you move.\"\u003c/p\u003e\n\u003cp\u003e\"What about school?\" Harry asked.\u003c/p\u003e\n\u003cp\u003eDonna smiled. \"That\u0027s my other surprise. I\u0027m retiring. As of now.\"\u003c/p\u003e\n\u003cp\u003eHarry stared at her. \"But...it\u0027s the middle of the school year.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, this is a good news/bad news situation,\" Rich explained. \"Donna needs knee-replacement surgery.\"\u003c/p\u003e\n\u003cp\u003eTheir daughter nodded. \"I guess that\u0027s what I get from all those years of crawling around on the floor with my kindergarten classes. It isn\u0027t extensive surgery, but it\u0027ll require several weeks of rehab. I\u0027d already decided to retire at the end of this school year. But with the wedding, the surgery and the baby, Rich and I felt it made more sense to do it now.\"\u003c/p\u003e\n\u003cp\u003e\"I think this is wonderful,\" Rosalie said again.\u003c/p\u003e\n\u003cp\u003eRosalie had always supported their children\u0027s decisions, even when they gave Harry pause. She was loyal to a fault; he loved that about her.\u003c/p\u003e\n\u003cp\u003e\"The paperwork\u0027s been turned in and everything\u0027s a go.\"\u003c/p\u003e\n\u003cp\u003e\"You should\u0027ve told us,\" Rosalie chastised.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t until I got the final word. I didn\u0027t mean to hide it from you, Mom, but I know how you worry.\"\u003c/p\u003e\n\u003cp\u003eWhile Donna claimed it was the surgery, the wedding and the baby, Harry suspected there was another reason his daughter had chosen to retire early. \"So you\u0027ll help us pack up the house,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Absolutely. Lorraine, too.\"\u003c/p\u003e\n\u003cp\u003eThis was welcome news to Harry. His prayer had been answered - they had a place at Liberty Orchard now. And his daughters would both be here. If God should choose to bring him home, Harry could be assured that Rosalie would be well looked after.\u003c/p\u003e\n\u003cp\u003eThis was going to be the best Christmas of his life. And the last... \u003c/p\u003e","sourceLink":"https://allnovel.net/where-angels-go-angels-everywhere-6/page-18.html","bookId":2630,"creation":"Oct 5, 2019 10:12:07 PM","modification":"Oct 5, 2019 10:12:07 PM"}
