{"id":38796,"no":6,"title":"Part One Chapter 6","content":"In those days I didn\u0027t know Dean as well as I do now, and the first thing I wanted to do was look up Chad King, which I did. I called up his house,\u0026nbsp; talked to his mother--she said, \"Why,\u0026nbsp; Sal, what are you doing in\u0026nbsp; Denver?\"\u0026nbsp; Chad is a slim blond boy with a strange witch- doctor face that goes\u0027 with his interest in anthropology and prehistory Indians.\u0026nbsp; His nose\u0026nbsp; beaks softly and almost creamily under a golden flare of hair; he has the beauty and grace of a Western hotshot who\u0027s danced in roadhouses and played a little football. A quavering twang comes out when he speaks. \"The\u0026nbsp; thing I always liked, Sal, about the Plains Indians was the way they always got s\u0027danged embarrassed af- ter they boasted the number of scalps they got. In Ruxton\u0027s iLife in the Far Westi there\u0027s an Indian who gets red all over blushing because he got so many scalps and he runs like hell into the plains to glory over his deeds in hiding. Damn, that tickled imei!\"\n\u003cbr\u003eChad\u0027s mother located him, in the drowsy Denver afternoon, working over his Indian basket-making at the local museum. I called him\u0026nbsp; there; he came and picked me up in his old Ford coupe that he used to take trips in the mountains, to dig for Indian objects. He came into the bus station wearing jeans and a big smile. I was sitting on my bag on the floor talking\u0026nbsp; to the very same sailor who\u0027d been in the Cheyenne\u0026nbsp; bus\u0026nbsp; station\u0026nbsp; with\u0026nbsp; me,\u0026nbsp; asking\u0026nbsp; him\u0026nbsp; what\u0026nbsp; happened\u0026nbsp; to\u0026nbsp; the blonde. He was so bored he didn\u0027t answer. Chad and I got in his little coupe and the first thing he had to do was get maps at the State build- ing. Then he had to see an old schoolteacher,\u0026nbsp; and so on, and all I wanted to do was drink beer. And in the back of my\u0026nbsp; mind was the wild thought, Where is Dean and what is he doing right now? Chad had decided not to be Dean\u0027s friend any more, for some odd\u0026nbsp; reason, and he didn\u0027t even know where he lived.\n\u003cbr\u003e\"Is Carlo Marx in town?\"\n\u003cbr\u003e\"Yes.\" But he wasn\u0027t talking to him any more either. This was the beginning of Chad King\u0027s withdrawal from our general gang. I was had an apartment waiting for me up Colfax Avenue, that Roland Major was already living in it and was waiting for me to join him. I sensed some kind of conspiracy in the air, and this conspiracy lined up two groups in the gang: it was Chad King and Tim Gray and Roland Major, together with the Rawlinses, generally agreeing to ignore Dean Moriar- ty and Carlo Marx. I was smack in the middle of this interesting war.\n\u003cbr\u003eIt was a war with social overtones. Dean was the son of a wino, one of the most tottering bums of Larimer Street, and Dean had in fact been brought up generally on Larimer Street and thereabouts. He used to plead in court at the age of six to have his father set free. He used to beg in front of Larimer alleys and sneak the money back to his father, who waited among the broken bottles with an old buddy. Then when Dean grew up he began hanging around the Glenarm poolhalls; he set a Denver record for stealing cars and\u0026nbsp; went to the reformatory. From the age of eleven to seventeen he was\u0026nbsp; usually in reform school. His specialty was stealing cars, gunning for girls coming out of high school in the afternoon, driving them out to the mountains, making them, and coming back to sleep in any available hotel bathtub in town. His father, once a respectable and hardworking tinsmith, had become a wine\u0026nbsp; al- coholic, which is worse than a whisky alcoholic, and was reduced to riding freights to Texas in the winter and back to Denver in the sum- mer. Dean had brothers on his dead mother\u0027s side--she died when he was small--but they disliked him. Dean\u0027s only buddies were the pool- hall boys.\u0026nbsp; Dean, who had the tremendous energy of a new kind of American saint, and Carlo were the underground monsters of that sea- son in Denver, together with the poolhall gang, and, symbolizing this most beautifully, Carlo had a basement apartment on Grant Street and we all met there many a night that went to dawn--Carlo, Dean, myself, Tom Snark, Ed Dunkel, and Roy Johnson. More of these others later.\n\u003cbr\u003eMy first afternoon in Denver I slept in Chad King\u0027s room while his mother went on with her housework downstairs and Chad worked have slept if it hadn\u0027t been for Chad King\u0027s father\u0027s invention. Chad King\u0027s father, a fine kind man, was in his seventies, old and feeble, thin and drawn-out, and telling stories with a slow, slow relish; good sto- ries, too, about his boyhood on the North Dakota plains in the eighties, when for diversion he rode ponies bareback and chased after coyotes with a club. Later he became a country schoolteacher in the Oklahoma panhandle, and finally a businessman of many devices in Denver. He still had his old office over a garage down the street--the rolltop desk was still there, together with countless dusty papers of past excitement and moneymaking. He had invented a special air-conditioner. He put an ordinary fan in a window frame and somehow conducted cool wa- ter through coils in front of the whirring blades. The result was perfect within four feet of the fan bull;--and then the water apparently turned into steam in the hot day and the downstairs part of the house was just as hot as usual. But I was sleeping right under the fan on Chad\u0027s bed, with a big bust\u0026nbsp; of Goethe staring at me, and I comfortably went to sleep, only to wake up\u0026nbsp; in twenty minutes freezing to death. I put a blanket on and still I was cold. Finally it was so cold I couldn\u0027t sleep, and\u0026nbsp; I\u0026nbsp; went\u0026nbsp; downstairs.\u0026nbsp; The\u0026nbsp; old\u0026nbsp; man\u0026nbsp; asked\u0026nbsp; me\u0026nbsp; how his\u0026nbsp; invention worked. I said it worked damned good, and I meant it within bounds. I liked the man. He was lean with memories. \"I\u0026nbsp; once\u0026nbsp; made a spot re- mover that has since been copied by big firms in the\u0026nbsp; East. I\u0027ve been trying to collect on that for some years now. If I only had enough mon- ey to raise a decent lawyer ... \" But it was too late to raise a decent law- yer; and he sat in his house dejectedly. In the evening we had a won- derful dinner his mother cooked, venison steak that Chad\u0027s uncle had shot in the mountains. But where was Dean? \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/lizhi/17/161.html","bookId":295,"creation":"Aug 5, 2019 10:50:45 AM","modification":"Aug 5, 2019 10:50:45 AM"}
