{"id":95534,"no":23,"title":"Page 23","content":"\u003cp\u003e“Unless what?”\u003c/p\u003e\n\u003cp\u003eCassandra took her time answering me. “Tell you what. I’ll give you one chance to earn their freedom.”\u003c/p\u003e\n\u003cp\u003eShe was playing games again, taunting, teasing. She dangled their freedom in front of me like a carrot, and I had no choice but to reach for it.\u003c/p\u003e\n\u003cp\u003e“What do I have to do?”\u003c/p\u003e\n\u003cp\u003e“All you have to do is take one more ride. . . .”\u003c/p\u003e\n\u003cp\u003eShe gestured toward a dark patch of ground; but it wasn’t just ground. It was moving. It was a large turntable of dark gray asphalt, about fifty yards in diameter. It slowly revolved, and out of the misty darkness spun an object: a single teacup, just large enough for a person to sit in. A spinning teacup ride. That’s all. It might not have been so bad, except for one thing:\u003c/p\u003e\n\u003cp\u003eThe teacup was yellow.\u003c/p\u003e\n\u003cp\u003eSchool bus yellow.\u003c/p\u003e\n\u003cp\u003e“Take this final ride, and if you make it through, your brother and your friends get to go home with you.”\u003c/p\u003e\n\u003cp\u003eThe yellow teacup revolved back into the misty darkness.\u003c/p\u003e\n\u003cp\u003e“You don’t have to do it,” said Quinn. But he was wrong. Even if his fate didn’t hang in the balance, I had to take this ride. I turned to Cassandra. “What happens if I don’t make it through?”\u003c/p\u003e\n\u003cp\u003eShe only smiled, pulling her hair back from her face.\u003c/p\u003e\n\u003cp\u003eI took a step toward the slowly revolving patch of asphalt, but Quinn grabbed my arm. “I’ll come with you.”\u003c/p\u003e\n\u003cp\u003e“You can’t. I ride this one alone.”\u003c/p\u003e\n\u003cp\u003eHis eyes grew moist. “Promise me you’ll be back,” he said. “Promise me you won’t disappear.”\u003c/p\u003e\n\u003cp\u003eBut I wouldn’t make him a promise I might not be able to keep.\u003c/p\u003e\n\u003cp\u003eCassandra crossed her arms impatiently. “Are you riding or not?”\u003c/p\u003e\n\u003cp\u003eI stepped up to the edge of the asphalt turntable. Its surface was slick, with a fine layer of black ice.\u003c/p\u003e\n\u003cp\u003e“Hey, Blake?”\u003c/p\u003e\n\u003cp\u003eI turned back to Quinn before I took that step onto the turntable. “Yeah?”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “I’m just wondering . . . did I ever tell you that I love you?”\u003c/p\u003e\n\u003cp\u003e“No,” I answered. “You never did.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “So maybe I will someday.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said. “Me too.”\u003c/p\u003e\n\u003cp\u003eThen I stepped onto the turntable, and it carried me away from him. “Back in five.” I kept my eyes on my brother until he faded into the mist. I turned to see the teacup just a few yards away. I pulled open the cup’s little yellow door. The seats inside were dark green leatherette. The wheel in the center was a steering wheel. I closed the door, took my seat, and grabbed the wheel. The teacup began to spin, slowly at first, but picking up speed as I pulled on the wheel, putting my weight behind it. I made that yellow teacup spin faster and faster until everything blurred. The sound of squealing tires began to fill my ears, and suddenly I was—\u003c/p\u003e\n\u003cp\u003e—spinning out of control.\u003c/p\u003e\n\u003cp\u003eA doomed school bus on an icy day.\u003c/p\u003e\n\u003cp\u003eGreen sticky seats and the smell of cherry bubble gum and a dozen kids screaming as the bus spins round and round and round. Andy Burke, my best friend, falls from his seat to the ground.\u003c/p\u003e\n\u003cp\u003eI am seven. I am there. This is not just a ride, I am there!\u003c/p\u003e\n\u003cp\u003eA teacher wails, “Oh my God, oh my God, oh my God.”\u003c/p\u003e\n\u003cp\u003eMrs. Greer. I remember her name now. I grip on to the seat in front of me to keep from being hurled across the bus. My backpack flies and I never see it again.\u003c/p\u003e\n\u003cp\u003eMy fingers slip from the seat back, and I tumble into the aisle, my cheek hitting the cold black floor that smells of rubber and mud.\u003c/p\u003e\n\u003cp\u003e“Hold on, Blake!” Mrs. Greer yells.\u003c/p\u003e\n\u003cp\u003eWhen I look up, I’m staring straight at the emergency exit at the back of the bus. It seems a hundred yards away.\u003c/p\u003e\n\u003cp\u003eBAM! We hit something hard, tearing metal. A guardrail flies up from the road, like a piece of confetti. It smashes a window and tumbles away. We’ve broken through the guardrail at the edge of Colfax Ravine. I know this place. The cliff is steep and rocky. I used to throw paper airplanes from this cliff and never see them hit the bottom. As far as I know, Colfax Ravine is as deep as the Grand Canyon.\u003c/p\u003e\n\u003cp\u003eThe front end of the bus slips over the edge of the cliff, and now the sight of the rear emergency exit door fills my mind, and I scramble toward it. No one else is opening that door. Don’t they know—don’t they see why that door is there? If no one else will open it, I will!\u003c/p\u003e\n\u003cp\u003eThe bus tilts, its back end lifting into the air. The floor of the bus rises before me like a black wave. I climb the steep angle of the floor to get to the emergency exit at the back. Screams and scraping metal. The smell of pee. Somebody’s wet themselves. Maybe it’s me.\u003c/p\u003e\n\u003cp\u003eI reach the back of the bus and grip the emergency door release bar.\u003c/p\u003e\n\u003cp\u003e“Open it, Blake,” yells Mrs. Greer. “Open it. Hurry!”\u003c/p\u003e\n\u003cp\u003eAnd then I hear another voice—one that’s not supposed to be here. The voice of Cassandra. She reclines in the back row, calmly watching, amused.\u003c/p\u003e\n\u003cp\u003e“Hurry, Blake,” she mocks. “Not much time left.”\u003c/p\u003e\n\u003cp\u003e“Open it!” screams Mrs. Greer.\u003c/p\u003e\n\u003cp\u003eBut the door is rusted shut. It doesn’t budge. “I can’t! I can’t! I can’t!”\u003c/p\u003e\n\u003cp\u003e“You couldn’t open it then,” says Cassandra, “and you can’t open it now. Such a shame.”\u003c/p\u003e\n\u003cp\u003eMetal scrapes on stone on the belly of the bus. The nose drops lower, the back rises higher, and the bus loses its balance, plunging into Colfax Ravine. I open my mouth to scream, but I am silenced by a blinding, searing explosion, and I am—\u003c/p\u003e\n\u003cp\u003e—spinning out of control.\u003c/p\u003e\n\u003cp\u003eA doomed school bus on an icy day.\u003c/p\u003e\n\u003cp\u003eScreams, the smell of bubble gum, and Andy Burke falls to the floor.\u003c/p\u003e\n\u003cp\u003eIt’s happening all over again! The ride is repeating!\u003c/p\u003e\n\u003cp\u003eMrs. Greer wails, “Oh my God, oh my God, oh my God.”\u003c/p\u003e\n\u003cp\u003eNo! Not again! I can’t go through this again! How many times will it repeat? How many times?\u003c/p\u003e\n\u003cp\u003e“Hold on, Blake!”\u003c/p\u003e\n\u003cp\u003eI’m in the aisle again. The smell of rubber and mud. And the emergency exit.\u003c/p\u003e\n\u003cp\u003eWe hit the guardrail and teeter over the edge. I’m at the back now, tugging at the stubborn emergency exit door, and Cassandra is there again, smiling in triumph.\u003c/p\u003e\n\u003cp\u003e“Here’s your own special ride,” she tells me. “And you’ll never change what happened, no matter how hard you try. You can’t change this ride!”\u003c/p\u003e\n\u003cp\u003eI ram my fist against the emergency exit release until my knuckles are bruised and raw.\u003c/p\u003e\n\u003cp\u003e“Open it, Blake,” screams Mrs. Greer.\u003c/p\u003e\n\u003cp\u003e“I can’t! I can’t! I can’t!”\u003c/p\u003e\n\u003cp\u003eWe slip off the edge, plunging into the ravine, and the moment before the explosion I can feel Cassandra’s breath in my ear as she whispers, “Welcome to eternity.”\u003c/p\u003e\n\u003cp\u003eA blinding flash, and I’m—\u003c/p\u003e\n\u003cp\u003e—spinning out of control.\u003c/p\u003e\n\u003cp\u003eA school bus on an icy day\u003c/p\u003e\n\u003cp\u003eAndy falls to the floor.\u003c/p\u003e\n\u003cp\u003e“Oh my God, oh my God, oh my God.”\u003c/p\u003e\n\u003cp\u003eI’ve always been on this ride. From the moment that Cassandra, in her bright orange car, cut in front of the bus and sent it spinning out of control, I have been riding. It has dominated my life, playing in my dreams, my daydreams, and every thought I have. This is how Cassandra can trap me—because, in a way, I never left this bus. I’ve been riding since I was seven years old.\u003c/p\u003e\n\u003cp\u003eWe crash through the guardrail. I drag myself to the back.\u003c/p\u003e\n\u003cp\u003eIf there’s a way out of every ride, there has to be a way out of this one. There has to be. What am I not seeing?\u003c/p\u003e\n\u003cp\u003eYou have to remember what you did.\u003c/p\u003e\n\u003cp\u003eI’m at the emergency exit again as the bus tips at the limit of its balance. My thoughts race too fast to hold on to. If only I could think. There has to be something I’m missing. I survived this accident. How did I do it? I close my eyes. I take a breath.\u003c/p\u003e\n\u003cp\u003e“Open it, Blake!”\u003c/p\u003e\n\u003cp\u003eNo, Mrs. Greer. No, I won’t open it. I have to slow down. I have to think. Force myself to remember. Let myself remember.\u003c/p\u003e\n\u003cp\u003eAnd all at once a rusty hinge in my head is jarred loose. My eyes snap open.\u003c/p\u003e\n\u003cp\u003e“This isn’t how it happened!”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” shouts Cassandra. “Of course it’s how it happened!”\u003c/p\u003e\n\u003cp\u003eI turn to her, realizing something for the first time. “You didn’t hang around to see, did you? You drove past the bus, cut in front of it, and sent us spinning, but you were gone before we crashed. You never saw what happened!”\u003c/p\u003e\n\u003cp\u003e“This is your ride!” she insists. “Your memory!”\u003c/p\u003e\n\u003cp\u003e“My memory’s wrong!”\u003c/p\u003e\n\u003cp\u003eWe slide into the ravine. An explosion, and I’m—\u003c/p\u003e\n\u003cp\u003e—spinning out of control.\u003c/p\u003e\n\u003cp\u003eAndy falls.\u003c/p\u003e\n\u003cp\u003e“Oh my God, oh my God, oh my God.”\u003c/p\u003e\n\u003cp\u003eAs real as it seemed before, it’s even more real now, because this time it’s not just half the memory—it’s the whole memory.\u003c/p\u003e\n\u003cp\u003eI fall from my seat, terrified. My face hits the floor.\u003c/p\u003e\n\u003cp\u003e“Hold on, Blake.”\u003c/p\u003e\n\u003cp\u003eThere are other kids in the aisle. Everyone’s screaming.\u003c/p\u003e\n\u003cp\u003eWe crash through the rail.\u003c/p\u003e\n\u003cp\u003eI see the emergency exit door. I’m climbing over my friends to get out—to get to that back door. Climbing over the backs of my friends to save myself. I have to get out. I have to. Others try to climb over me—everyone’s in the same panic—but I’m the fastest. I get there first. The bus tips, and I grab the emergency exit release.\u003c/p\u003e\n\u003cp\u003e“Open it, Blake!”\u003c/p\u003e\n\u003cp\u003eI tug and I tug. “I can’t, I can’t, I—”\u003c/p\u003e\n\u003cp\u003eAnd the latch gives. The door opens, swinging wide. I did open the door! I did! That’s what I refused to remember all those years. I did open that door!\u003c/p\u003e\n\u003cp\u003eNow I’m standing at the back of the bus. The world seems to stop, poised on the moment the way the bus is perfectly balanced on the edge of the cliff. Balanced. I am the balance.\u003c/p\u003e\n\u003cp\u003eSuddenly I was no longer on the bus; I was watching the whole scene unfold from the outside. I stood on the icy road, looking up to see my seven-year-old self standing at the open emergency exit door, the bus teetering back and forth, balanced on the edge.\u003c/p\u003e\n\u003cp\u003eThe rear wheels of the bus were high off the ground, so high that from here, I could see the spinning drive-shaft and transmission. The Works.\u003c/p\u003e\n\u003cp\u003e“Jump, Blake,” I heard Mrs. Greer yell from inside the bus. The little boy at the back of the bus—the boy whom I once was—hesitated. It was such a long way down.\u003c/p\u003e\n\u003cp\u003eAs I watched, Cassandra danced around me, thrilled to know the truth of my survival. “You jumped, didn’t you! That’s why you survived!” Her mud-toned silken shroud fluttered with every motion of her arms. “You jumped out the door, and that’s all it took to push the bus over the edge!”\u003c/p\u003e\n\u003cp\u003eI didn’t answer her. I just watched as the little boy at the back of the bus closed his eyes and leaned forward, just as the bus slipped another foot. That terrified little boy somehow found it in himself to leap from the back of the doomed bus. Even though no one else jumped with him. Even though he knew he’d be the only one out. Even with the burden of guilt he would have to bear, he—I—still chose to live. He jumped from the back of the bus, and I opened my arms, catching him. He was almost weightless, his sobs barely audible in my ears as the bus tipped and began its final slide off the edge.\u003c/p\u003e\n\u003cp\u003eCassandra stopped her dance and came in so close, I could hear her voice not just as a whisper in my ear, but inside my head. “They all died because you jumped!” \u003c/p\u003e","sourceLink":"https://allnovel.net/full-tilt/page-23.html","bookId":2591,"creation":"Oct 5, 2019 6:15:15 PM","modification":"Oct 5, 2019 6:15:15 PM"}
