{"id":95515,"no":4,"title":"Page 4","content":"\u003cp\u003e“Can I go now?” Quinn didn’t wait for an answer. He bolted into the house, slamming the screen door behind him.\u003c/p\u003e\n\u003cp\u003eCarl sighed. “Well, that could have been worse.” Then he looked at me. I was still feeling numb about the whole thing, but I knew what I had to say to get me out of this awkward situation.\u003c/p\u003e\n\u003cp\u003e“I’m very happy for you both.” I turned to go in.\u003c/p\u003e\n\u003cp\u003e“Carl has something for you, too,” Mom said.\u003c/p\u003e\n\u003cp\u003e“It’s okay,” I told them. “I’m not Quinn. I don’t need a bribe.” The words slipped out before I could hold them back.\u003c/p\u003e\n\u003cp\u003e“It’s not like that, Blake,” Carl said. “I know we’re going to be family. . . . But I want to be friends, too.”\u003c/p\u003e\n\u003cp\u003eI cringed at the word family. For years our little family had been about as misshapen as the bear I was holding. It didn’t need more stuffing, it needed a complete makeover. The guys Mom dragged into the task never made it through the preliminaries. Was Carl so different? Did I want him to be?\u003c/p\u003e\n\u003cp\u003eCarl reached into his sports jacket and produced an overstuffed envelope. He held it out to me, a gesture of friendship. “Just some things you might need at college,” he said, “and some phone numbers of friends I have in the city. New York can be rough without someone to help you out.”\u003c/p\u003e\n\u003cp\u003eI took it, thanked him, and went inside, riding a wave of sudden nausea—a sort of seasickness from the many unexpected lurches of the evening. They say it’s not the sideways motion of a ship that makes you sick, but the pitch and yaw: the constant rising and falling of the bow, both predictable and yet different with every wave. On days like this, it felt like I’d never get used to it.\u003c/p\u003e\n\u003cp\u003eOnce in the house, I spared one more look at the ungainly little bear and his unpleasant yellow shirt. It was my trophy for a twisted evening that wasn’t getting any better. The corner of the invitation stuck out of the bear’s pocket, but I didn’t care about that anymore. I wasn’t going. Cassandra would probably be there, but who was I kidding? She was out of my league.\u003c/p\u003e\n\u003cp\u003eOn the way to my room I passed Quinn’s closed door. Angry music blared on the other side. I just didn’t feel like dealing with him, or his room. I mean, imagine the debris field of a tornado, and you’ll begin to understand what it looked like. There were dust bunnies that lurked in corners, evolving into higher forms of life. Half-eaten sandwiches growing thick green fur filled the bookshelves.\u003c/p\u003e\n\u003cp\u003eNo surprise that my room looked nothing like my brother’s. I opened my door to a clean floor, a neat desk, and a host of evenly spaced travel posters lining the walls. Russia, England, and Greece hung over my desk. Above my headboard was Italy, with the Leaning Tower of Pisa, and on my closet door was France, with the Eiffel Tower and the Arc De Triomphe looking like a hundred-foot keyhole into all the places I’d never been. An oversized poster of Hawaii was strategically placed as a backdrop for some World War II model planes I’d hung from the ceiling in a mock dogfight.\u003c/p\u003e\n\u003cp\u003eThe posters had been free because they knew me at the travel agency down at the mall. When I was younger, I hung out there, and they would pretend to book me on trips to faraway places. Then they’d give me the posters, along with whatever other promotional stuff was lying around in their office. That was how I got the two carved heads from Easter Island that now served as bookends and an authentic imitation totem pole from Alaska that stood in the corner.\u003c/p\u003e\n\u003cp\u003eMy desk was empty except for a desk organizer holding paper clips, pens, and sharpened pencils. Quinn called it “anal” the way I kept everything, as if being neat were some weird complex. As if there were something wrong with having all my pencils sharpened and my books in alphabetical order and my clothes hung up by color. So what? I used to do that with my crayons, too.\u003c/p\u003e\n\u003cp\u003eI sat at my desk and opened the envelope Carl had given me. Like he said, it contained a list of names and phone numbers of people I didn’t know in New York, but there were other things in it as well. Like a subway map I couldn’t figure out no matter which way I held it. Like a brochure from Columbia University’s sports department that featured the school mascot, a menacing blue lion, stalking forward as if trying to intimidate me out of trying out for their swim team.\u003c/p\u003e\n\u003cp\u003eAnd then there were the airplane tickets.\u003c/p\u003e\n\u003cp\u003eAmerican Airlines. 6:45 A.M. departure. September 4. One was round-trip, for my mom. She got to stay for two days. The other ticket was mine and was one-way. The flight landed at an airport called LaGuardia. I’d never flown—never had the need to—but now here was a ticket, with a date only one month away.\u003c/p\u003e\n\u003cp\u003eEver have the real world hit you like a steel pole to the head? Until now all I had from the university was an acceptance letter and a dozen forms to fill out. But here, spread out before me, was solid reality on a collision course with me. Wham! Sixteen years old and living at a college in New York City? What was I, crazy? Was I totally out of my mind? My head was spinning, and whenever that happened, it always called back that memory of my first ride.\u003c/p\u003e\n\u003cp\u003eScreaming. Spinning out of control. Gripping tightly on to the seat. So dizzy . . .\u003c/p\u003e\n\u003cp\u003eToo tired to resist, I let the memory come. I was seven. There are so many details I still remember, like the smell of cherry-flavored bubble gum in the air and the cold feel of the seat and the screams of my friends, each voice a different pitch, like a terrified choir, all out of tune. And yet so much is also gone. Not so much forgotten as exiled from my brain. Maybe that’s because the ride didn’t take place at a carnival or an amusement park. It took place on an icy December morning. On a school bus.\u003c/p\u003e\n\u003cp\u003eMom never talked about it, and so neither did I. I always figured the memory of that ride was best left buried. Problem is, rides like that have a way of coming back, and then you’re stuck riding them again. And again. And again.\u003c/p\u003e\n\u003cp\u003eI brought my hands to my temples, pressing until the spinning feeling went away. Then I took the subway map, the list of names, and the brochure, and dropped them in the trash. I made sure the brochure was facedown, so I wouldn’t have to see the eyes of that blue lion. As for the plane tickets, I shoved them as far and as deep in my desk as I could, knowing I really couldn’t throw them away but wishing that I could at least make them disappear.\u003c/p\u003e\n\u003cp\u003eI went to the kitchen as Mom came inside.\u003c/p\u003e\n\u003cp\u003e“Did you look in the packet Carl gave you?”\u003c/p\u003e\n\u003cp\u003e“I’m tired, Mom. Can we talk about it in the morning?”\u003c/p\u003e\n\u003cp\u003eI scavenged through the fridge, finding doggie bags left over from her and Carl’s big engagement date. Wan Fu’s Szechuan Emporium: the most expensive Chinese restaurant in town. At least the guy had good taste in food.\u003c/p\u003e\n\u003cp\u003eMom leaned against the wall. “Why does Quinn have to be like this? It’s like I’m not allowed to have any happiness around here.”\u003c/p\u003e\n\u003cp\u003eI didn’t feel like getting into it. “Not everything’s about you, Mom.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, not everything’s about him, either.”\u003c/p\u003e\n\u003cp\u003eI snatched up the doggie bags, and instead of escaping to my clean room, I went in Quinn’s pigsty. At least there, the chaos was all out in the open, instead of hiding in unseen places.\u003c/p\u003e\n\u003cp\u003eI pushed open his door. A dart zipped through the air headed straight for my face. I deflected it with the doggie bags, and it punctured the flaming Hindenburg on Quinn’s classic Led Zeppelin poster instead, which had once been Mom’s until retro became cool and Quinn nabbed it.\u003c/p\u003e\n\u003cp\u003e“That would have been a bull’s-eye,” Quinn complained. I looked at the dartboard on the back of the door.\u003c/p\u003e\n\u003cp\u003e“Fat chance. It wouldn’t even have hit the target.”\u003c/p\u003e\n\u003cp\u003eQuinn shrugged and turned his attention to a flight simulation game on his computer. It was typical Quinn: playing darts while playing computer games while blasting music loud enough to shake the house from its foundation. I turned down the music a few hundred decibels so I could hear myself think, as Quinn ditched his plane in a cornfield.\u003c/p\u003e\n\u003cp\u003e“Isn’t the object to actually land the plane?”\u003c/p\u003e\n\u003cp\u003e“Where’s the fun in that?” Quinn quit the game and flopped bonelessly onto his bed. I sat on his desk chair, handing him one of the bags of food. “Here, stuff your face. Mom and Carl had Chinese.”\u003c/p\u003e\n\u003cp\u003e“Great! They’re engaged five minutes, and we’re already eating his table scraps.” He riffled around his desk until he found a fork with dried ketchup on it and started eating.\u003c/p\u003e\n\u003cp\u003eI studied the diamond stud in Quinn’s earlobe. “I like it better than sputnik,” I told him.\u003c/p\u003e\n\u003cp\u003eQuinn looked at me as if I’d insulted him. “You gave me sputnik.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but when I gave it to you, it was a key chain.”\u003c/p\u003e\n\u003cp\u003eHe returned to his food. Lo mein noodles dangled from his chin like worms as he sucked them in. “You watch,” Quinn said. “This guy’s going to bail, and we’ll never hear from him again. Just like the other ones . . .”\u003c/p\u003e\n\u003cp\u003eI looked away. He didn’t have to say it—I knew what he was thinking: Just like Dad.\u003c/p\u003e\n\u003cp\u003eI wanted to reach out to Quinn somehow, but I couldn’t. It made me think of this thing I once read. Scientists now think there are actually nine dimensions instead of three, but the other ones are so folded in upon themselves, we can’t experience them. Maybe that explains why I could never reach out to Quinn, because although he was only a few feet away, he somehow felt much farther than the space between us. When Dad left us all those years ago, it tore open a wound that led to a whole lot of unexpected dimensions.\u003c/p\u003e\n\u003cp\u003e“Hey, maybe this guy’ll hang around,” I said. “And maybe it won’t be so bad.”\u003c/p\u003e\n\u003cp\u003e“Easy for you to say. You’ll be off at Columbia.”\u003c/p\u003e\n\u003cp\u003eI felt the skin on the back of my neck tighten. “I never said I was going.”\u003c/p\u003e\n\u003cp\u003eQuinn laughed, his mouth full of noodles. “Yeah, right. You’re gonna turn down an Ivy League scholarship.”\u003c/p\u003e\n\u003cp\u003eWhen I didn’t answer him, his expression changed.\u003c/p\u003e\n\u003cp\u003e“Wait a second. You’re not kidding!”\u003c/p\u003e\n\u003cp\u003eI began to pace, kicking the debris on the floor out of the way. “That scholarship doesn’t cover everything. And do you know how expensive New York is?”\u003c/p\u003e\n\u003cp\u003e“One month to go, and you’re gonna talk yourself out of it?”\u003c/p\u003e\n\u003cp\u003e“I’m being practical. I know that particular word never made it into your vocabulary.”\u003c/p\u003e\n\u003cp\u003eQuinn put down his fork. “You’re chicken, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“It’s better for everyone if I get a part-time job and take some classes at a junior college.”\u003c/p\u003e\n\u003cp\u003eBut Quinn wasn’t buying it. “You’re scared! I can’t believe you. I mean, you paste your room full of places you’ll never go, and when you actually get the chance to have a life, you’re too scared to take it!”\u003c/p\u003e\n\u003cp\u003eHe had a point. But so did I. “If I go to junior college, I can live at home,” I reminded him, “and maybe keep some balance around here. Besides, you never know when someone might need their ass saved from a roller coaster again.”\u003c/p\u003e\n\u003cp\u003e“Oh, right. So it’s my fault?”\u003c/p\u003e\n\u003cp\u003e“Do you really want to face life with the newlyweds alone? What if they do crash and burn?”\u003c/p\u003e\n\u003cp\u003e“You mean like you’re doing now?” Quinn crushed a fortune cookie in his fist and let the flakes fall away. “Fine! See if I care. Go turn your life into a car accident. Or should I say a bus accident?” \u003c/p\u003e","sourceLink":"https://allnovel.net/full-tilt/page-4.html","bookId":2591,"creation":"Oct 5, 2019 6:15:15 PM","modification":"Oct 5, 2019 6:15:15 PM"}
