{"id":80318,"no":22,"title":"Page 22","content":"\u003cp\u003e“What’s it gonna be?” he asks with sparkling bright green eyes flecked by a little bit of taunt.\u003c/p\u003e\n\u003cp\u003eI’m so nervous! I feel like I’m being asked to choose which wire to cut to diffuse a bomb.\u003c/p\u003e\n\u003cp\u003e“I don’t know!” I shout, but my lips are smiling wide and nervously.\u003c/p\u003e\n\u003cp\u003eTwenty miles per hour. People are honking at us and one guy in a red car zooms past and flips us off.\u003c/p\u003e\n\u003cp\u003eFifteen miles per hour.\u003c/p\u003e\n\u003cp\u003eAhhh! I can’t stand the anticipation! I feel like I want to burst out laughing, but it’s being held captive in my throat.\u003c/p\u003e\n\u003cp\u003eHonk! Honk! Fuck you! Move out of the way a**hole!\u003c/p\u003e\n\u003cp\u003eIt all just rolls off Andrew’s back and he never stops smiling.\u003c/p\u003e\n\u003cp\u003e“That way!” I finally yell, throwing my hand up and pointing to the east ramp. I squeal out laughter and slide my back down further against the seat so that no one else can see me, I’m so embarrassed.\u003c/p\u003e\n\u003cp\u003eAndrew flips his left blinker on and slides over into the left lane with ease, in-between two other cars. We make it through the yellow light just before it turns red and in seconds we’re on another freeway and Andrew is pressing on the gas. I have no idea which direction we’re traveling, only that we’re going east, but where it leads exactly is still up in the air.\u003c/p\u003e\n\u003cp\u003e“Now that wasn’t so hard, was it?” he says, glancing over at me with a grin.\u003c/p\u003e\n\u003cp\u003e“Kind of exhilarating,” I say and then let out a sharp laugh. “You really pissed those people off.”\u003c/p\u003e\n\u003cp\u003eHe brushes it off with a shrug. “Everybody’s in too much of a hurry. God forbid you drive the speed limit or you might get lynched.”\u003c/p\u003e\n\u003cp\u003e“So true,” I say and look out ahead through the windshield. “Though I have to come clean—I’m usually one of them.” I wince admitting it.\u003c/p\u003e\n\u003cp\u003e“Yeah, me too sometimes.”\u003c/p\u003e\n\u003cp\u003eEverything gets quiet all of a sudden and it becomes the first quiet moment that the both of us notice. I wonder if he’s thinking the same thing, wondering about me and wanting to ask, just as I’m curious about so much when it comes to him. It’s one of those moments that are inevitable and almost always open the door to the stage where two people really start to get to know each other.\u003c/p\u003e\n\u003cp\u003eIt’s very different from when we were on the bus together. We thought that our time was limited then and if we were never going to see each other again, there was no reason to get all personal.\u003c/p\u003e\n\u003cp\u003eBut things have changed and personal is all that’s left.\u003c/p\u003e\n\u003cp\u003e“Tell me more about your best friend, Natalie.”\u003c/p\u003e\n\u003cp\u003eI keep my eyes on the road for several long seconds and I’m slow to answer because I’m not sure which part of her I should tell.\u003c/p\u003e\n\u003cp\u003e“If she’s even still your best friend,” he adds, sensing the animosity somehow.\u003c/p\u003e\n\u003cp\u003eI look over.\u003c/p\u003e\n\u003cp\u003e“Not anymore. She’s sort of whipped, for lack of a better explanation.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you have a better explanation,” he says, putting his eyes back on the road. “Maybe you just don’t want to explain it.”\u003c/p\u003e\n\u003cp\u003eI make a decision.\u003c/p\u003e\n\u003cp\u003e“No, I do want to explain it, actually.”\u003c/p\u003e\n\u003cp\u003eHe looks pleased, but keeps it at a respectful level.\u003c/p\u003e\n\u003cp\u003e“I’ve known her since second grade,” I begin, “and I didn’t think anything could break up our friendship, but I was so wrong about that.” I shake my head, disgusted just thinking about it.\u003c/p\u003e\n\u003cp\u003e“Well, what happened?”\u003c/p\u003e\n\u003cp\u003e“She chose her boyfriend over me.”\u003c/p\u003e\n\u003cp\u003eI think he expected more of an explanation and I intended to give him more, but it just came out the way it did.\u003c/p\u003e\n\u003cp\u003e“Did you make her choose?” he asks with a subtly raised brow.\u003c/p\u003e\n\u003cp\u003eI turn around to look at him. “No, it wasn’t like that at all.” I sigh long and heavily. “Damon—her boyfriend—got me alone one night and tried to kiss me and tell me he wanted me. Next thing I know, Natalie is calling me a lying bitch and says she never wants to see me again.”\u003c/p\u003e\n\u003cp\u003eAndrew nods one of those long, hard nods that show he completely understands now.\u003c/p\u003e\n\u003cp\u003e“An insecure girl,” he says. “She’s probably been with him for a long time, huh?”\u003c/p\u003e\n\u003cp\u003e“Yeah, about five years.”\u003c/p\u003e\n\u003cp\u003e“You know, this best friend of yours, she believes you, right?”\u003c/p\u003e\n\u003cp\u003eI gaze over at him confusedly.\u003c/p\u003e\n\u003cp\u003eHe nods. “She does; think about it, she’s known you practically all her life. Do you really think she’d just toss away a friendship like that because she didn’t believe you?”\u003c/p\u003e\n\u003cp\u003eI’m still confused.\u003c/p\u003e\n\u003cp\u003e“But she did,” I say simply. “It’s exactly what she did.”\u003c/p\u003e\n\u003cp\u003e“Nah,” he says, “it’s just a reaction, Camryn. She doesn’t want to believe it, but not so very far down, she knows it’s true. She just needs time to think on it and to see it for what it is. She’ll come around.”\u003c/p\u003e\n\u003cp\u003e“Well, by the time she does, I might not want her.”\u003c/p\u003e\n\u003cp\u003e“Maybe so,” he says and flips on his right blinker and switches lanes, “but I don’t take you for the type.”\u003c/p\u003e\n\u003cp\u003e“Unforgiving?” I say.\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003eWe speed past a crawling semi and move around in front of it.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I say, unsure myself anymore, “I’m not like I used to be.”\u003c/p\u003e\n\u003cp\u003e“How did you used to be?”\u003c/p\u003e\n\u003cp\u003eI’m not even sure about that, either. It takes me a second to find a way around mentioning Ian. “I used to be fun and outgoing and I…,” I laugh suddenly as the memory tickles my mind, “…and I used to run nak*d into a freezing lake every winter.”\u003c/p\u003e\n\u003cp\u003eAndrew’s whole beautiful face twists into a curious, energized smile. “Wow,” he says, “I can just picture it….”\u003c/p\u003e\n\u003cp\u003eI smack him on the arm again. Always smiling. He pretends it stings, but I know better.\u003c/p\u003e\n\u003cp\u003e“It was a fundraiser for the hospital in my town,” I say, “and they put it on every year.”\u003c/p\u003e\n\u003cp\u003e“Naked?” He looks thoroughly confused aside from grinning thinking about it.\u003c/p\u003e\n\u003cp\u003e“Well, not fully nak*d,” I say, “but in a tank top and shorts in freezing water, you might as well be nak*d.”\u003c/p\u003e\n\u003cp\u003e“Shit, I should sign up for hospital fundraisers when I get home,” he says, hitting the steering wheel once. “Didn’t know what I was missing out on.”\u003c/p\u003e\n\u003cp\u003eHe tames the smile a little and looks back at me. “So why is that something you used to do?”\u003c/p\u003e\n\u003cp\u003eBecause Ian was the one who talked me into it and who I did it with for two years.\u003c/p\u003e\n\u003cp\u003e“I just stopped about a year ago—just one of those things you fall out of.”\u003c/p\u003e\n\u003cp\u003eI get the feeling he doesn’t believe there’s not more to it than that, so I jump onto something else to distract from it.\u003c/p\u003e\n\u003cp\u003e“What about you?” I ask, turning around at the waist to give him my full attention. “What’s something crazy that you’ve done?”\u003c/p\u003e\n\u003cp\u003eAndrew purses his lips in thought, looking out at the road. We pass another semi and get around in front of it. The traffic is thinning out the farther away from the city we drive.\u003c/p\u003e\n\u003cp\u003e“I hood-surfed once—not so much crazy as it was stupid, though.”\u003c/p\u003e\n\u003cp\u003e“Yeah, that’s pretty stupid.”\u003c/p\u003e\n\u003cp\u003eHe reaches his left hand up and puts the underside of his wrist into view. “I fell off the damn thing and sliced my wrist open on no telling what.” I peer in at the two-inch scar running along the skin from the bottom of the thumb bone and onto his arm. “I rolled across the road. Cracked my head open.” He points to the back right side of his head. “Got nine stitches there in addition to the sixteen on my wrist. I’ll never do that again.”\u003c/p\u003e\n\u003cp\u003e“Well, I would hope not,” I say sternly, still trying to see the scar through his brown hair.\u003c/p\u003e\n\u003cp\u003eHe switches hands on the steering wheel and takes a hold of my wrist, sliding his index finger over the length of the top of mine so he can use his as a guide.\u003c/p\u003e\n\u003cp\u003eI pull closer, letting his hand guide mine.\u003c/p\u003e\n\u003cp\u003e“Right about…there,” he says when he finds it. “Do you feel it?”\u003c/p\u003e\n\u003cp\u003eHis hand falls away from mine, but I watch it for a moment.\u003c/p\u003e\n\u003cp\u003eComing back to the issue of his head, I look up and run the tip of my finger along an obvious uneven smooth strip of skin on his scalp and then I part his short hair away with my fingers. The scar is about an inch long. I run my finger over it one more time and reluctantly pull away.\u003c/p\u003e\n\u003cp\u003e“I imagine you have a lot of scars,” I say.\u003c/p\u003e\n\u003cp\u003eHe smiles. “Not too many; got one on my back from when Aidan clipped me with a bicycle chain, swingin’ it around like a whip (I wince, gritting my teeth). And when I was twelve, had Asher riding on the handlebars of my bike. Hit a rock. Bike flipped forward and sent us both skidding across the concrete.” He points to his nose. “Broke my nose, but Asher broke an arm and had fourteen stitches on his elbow. Mom thought we’d been in a car wreck and were just lying about it to cover our asses.”\u003c/p\u003e\n\u003cp\u003eI’m still looking at his perfectly shaped nose; don’t see any evidence that it had ever been broken before.\u003c/p\u003e\n\u003cp\u003e“Got a weird L-shaped scar on my inner thigh,” he goes on and points to the general area. “Not gonna show you that one though.” He grins and puts both hands on the wheel.\u003c/p\u003e\n\u003cp\u003eI blush, because it really took me all of two seconds to start envisioning him dropping his pants to show me.\u003c/p\u003e\n\u003cp\u003e“That’s a good thing,” I laugh and then lean up toward the dashboard so I can pull my babydoll Smurfette shirt up just over my hip. I catch his eyes on me and it does something to my stomach, but I ignore that. “Camping one year,” I say, “jumped off these bluffs into the water and hit a rock—I almost drowned.”\u003c/p\u003e\n\u003cp\u003eAndrew frowns and reaches over, tracing the edges of the small scar on my hipbone. A shiver runs up my spine and through the back of my neck like something freezing racing through my blood.\u003c/p\u003e\n\u003cp\u003eI ignore that too, as much as I can.\u003c/p\u003e\n\u003cp\u003eI let my shirt fall back over my hip and I lean back against the seat.\u003c/p\u003e\n\u003cp\u003e“Well, I’m glad you didn’t drown.” His eyes warm up with his face.\u003c/p\u003e\n\u003cp\u003eI smile back at him. “Yeah, that would’ve sucked.”\u003c/p\u003e\n\u003cp\u003e“Definitely.”\u003c/p\u003e\n\u003cp\u003e15\u003c/p\u003e\n\u003cp\u003eI WAKE UP AFTER dark when Andrew slows down through a toll. I don’t know how long I slept, but I feel like I got a full night in, despite being curled up in the corner of the passenger’s seat with my head against the door. I should be trying to rub out a couple of stiff muscles like when I rode on the bus, but I feel good.\u003c/p\u003e\n\u003cp\u003e“Where are we?” I ask, cupping my hand over my mouth to cover the yawn.\u003c/p\u003e\n\u003cp\u003e“Middle of nowhere Wellington, Kansas,” he says. “You slept a long time.”\u003c/p\u003e\n\u003cp\u003eI rise up the rest of the way and let my eyes and body adjust to being awake again. Andrew pulls onto another road.\u003c/p\u003e\n\u003cp\u003e“I guess I did, better than I slept on the bus the entire trip from North Carolina to Wyoming.”\u003c/p\u003e\n\u003cp\u003eI look at the glowing blue letters on the car stereo: 10:14 p.m. A song is funneling low from the speakers. It makes me think of when I met him back on the bus. I smile to myself feeling like he made sure to keep it at a low level in the car while I slept.\u003c/p\u003e\n\u003cp\u003e“What about you?” I ask, turning around to see him, the darkness casting his face in partial shadow. “I feel weird offering because it’s your dad’s car, but I’m good to drive if you need me to.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-22.html","bookId":1856,"creation":"Oct 5, 2019 4:26:05 PM","modification":"Oct 5, 2019 4:26:05 PM"}
