{"id":100886,"no":29,"title":"Page 29","content":"\u003cp\u003e“That’s a lot of shit to dump on a person’s lap,” he says and I look back up when I feel him adjusting on the bed beside me. I smell his minty breath now that he has turned fully at the waist to face me from the side. “You have every right to be hurt, Camryn.”\u003c/p\u003e\n\u003cp\u003eI don’t say anything, but I thank him with my eyes.\u003c/p\u003e\n\u003cp\u003e“I guess I can see now why you weren’t hard to convince to go on this road-trip with me,” he says.\u003c/p\u003e\n\u003cp\u003eHis face is unreadable. I hope he doesn’t think I’m using him to mimic that part of my life I had planned with Ian. The whole road-trip situation seems similar, even to me now that I think about it, but it couldn’t be further from the reason I left with Andrew. I’m with him now because I want to be.\u003c/p\u003e\n\u003cp\u003eIt’s in this moment that I realize I haven’t been thinking of Ian and Andrew so much because I’m trying to find Ian in Andrew…I think it’s guilt…maybe I’m trying to replace Ian completely.\u003c/p\u003e\n\u003cp\u003eI stand up from the bed and shake those thoughts from my mind.\u003c/p\u003e\n\u003cp\u003e“So what are you going to do?” Andrew asks from behind. “After this road-trip is over, what do you plan to do with your life?”\u003c/p\u003e\n\u003cp\u003eMy heart hardens in my chest. Not once during this trip with Andrew, or even before I met him after I left North Carolina, have I thought beyond the present. It wasn’t ever that I tried not to think about what lies ahead, I simply just didn’t think about it at all. Andrew’s question wakes me up and now I feel panicked inside. I never wanted a dose of that reality; I was content with my illusion.\u003c/p\u003e\n\u003cp\u003eI turn around, my arms crossed over my chest. Andrew’s beautiful eyes are gazing intensely at me.\u003c/p\u003e\n\u003cp\u003e“I…don’t really know.”\u003c/p\u003e\n\u003cp\u003eHe looks mildly surprised, his gaze becoming more contemplative and his eyes stray.\u003c/p\u003e\n\u003cp\u003e“You can still go to college,” he says, offering ideas to help me feel better, I guess, “and it doesn’t mean you have to get a job afterwards and work there until you die—hell, you can still backpack across Europe if you want.”\u003c/p\u003e\n\u003cp\u003eHe stands up with me. I can tell the thinking gears are churning in his head as he paces the dark green carpet a few times.\u003c/p\u003e\n\u003cp\u003e“You’re gorgeous,” he says and my heart flutters, “you’re intelligent and obviously have more determination than the average girl; I think you could do just about anything you wanted—shit, I know that all sounds commonplace, but it couldn’t be truer in your case.”\u003c/p\u003e\n\u003cp\u003eI shrug. “I guess so,” I say, “but I don’t have the slightest idea about what I want to do except that I don’t want to go home to figure it out. I think I’m afraid that if I go back there, I’ll be drowned in the same crap I pulled myself out of when I got on that bus that day.”\u003c/p\u003e\n\u003cp\u003e“Tell me something,” Andrew says suddenly and my eyes lock on him, “what part of being around everyone else frustrates you the most?”\u003c/p\u003e\n\u003cp\u003eFrustrates me?\u003c/p\u003e\n\u003cp\u003eI think on it for a second, my gaze fixated on the brass lamp mounted on the wall beside the bed.\u003c/p\u003e\n\u003cp\u003e“I-I’m…not sure.”\u003c/p\u003e\n\u003cp\u003eHe steps up to me and places two fingers at the bend of my arm, guiding me to sit back down with him and I do.\u003c/p\u003e\n\u003cp\u003e“Just think about it,” he goes on, “based on what you’ve told me already, what is different between you and them?”\u003c/p\u003e\n\u003cp\u003eI hate it that it’s taking me longer to figure something out that he seems to already have an idea about. I stare down at my hands within my lap and think about it long and hard until I come up with the only answer I feel might be right, but I’m still unsure of myself:\u003c/p\u003e\n\u003cp\u003e“Expectations?”\u003c/p\u003e\n\u003cp\u003e“Is that a question, or your answer?”\u003c/p\u003e\n\u003cp\u003eI give up.\u003c/p\u003e\n\u003cp\u003e“I really don’t know—I mean I feel…restricted around everyone, with the exception of Ian, of course.”\u003c/p\u003e\n\u003cp\u003eHe nods and listens, letting me go on without interruption while the answer is hanging on the tip of my brain.\u003c/p\u003e\n\u003cp\u003eAnd then out of nowhere, the answers just come:\u003c/p\u003e\n\u003cp\u003e“No one wants to do what I want to do,” I say and my explanation begins to unfold more quickly now that I feel more confident in the answer. “Just like with living free and not taking the ordinary route, y’know? No one wants to step out of their comfort zone to do that with me because it’s not something most people do. I was afraid to tell my parents I didn’t want to go to college because that’s what they expected me to do. I accepted a job at a department store because my mom expected it to fulfill me in some way. I went with my mom every Saturday to visit my brother in prison because she expected me to go, because he’s my brother and I should want to see him even though I didn’t. Natalie relentlessly tried to hook me up with guys because she thought it was abnormal that I be single.\u003c/p\u003e\n\u003cp\u003e“I think I’ve been afraid most of my life to be myself.”\u003c/p\u003e\n\u003cp\u003eMy head whirls around to face him. “In a way, that was even true with Ian.”\u003c/p\u003e\n\u003cp\u003eI look away quickly because that last part was not something I really expected to say out loud. It just came out while the realization was taking shape in my mind so fast.\u003c/p\u003e\n\u003cp\u003eAndrew looks inquisitive, but at the same time, unsure if he should probe.\u003c/p\u003e\n\u003cp\u003eI’m not sure if I should elaborate.\u003c/p\u003e\n\u003cp\u003eHe nods.\u003c/p\u003e\n\u003cp\u003eApparently, he decides it’s not his place to further this particular subject.\u003c/p\u003e\n\u003cp\u003eHe twists the inside of his cheek in-between his teeth. I watch him for a moment, always trying to force down the obvious attraction I have for him, but it’s becoming harder to do. I glimpse his lips and wonder what they taste like. And then I force my eyes away—I’m doing it again. Right now. I’m afraid to tell him what I want. Or, at least what I think I want.\u003c/p\u003e\n\u003cp\u003e“Andrew,” I say and his face quietly reacts to my voice saying his name.\u003c/p\u003e\n\u003cp\u003eThink about this, Cam, I say to myself. Are you sure this is what you want?\u003c/p\u003e\n\u003cp\u003e“What is it?” he asks.\u003c/p\u003e\n\u003cp\u003e“Have you ever had a one-night stand?”\u003c/p\u003e\n\u003cp\u003eIt feels like I just let the biggest secret I’ve ever been told slip while standing in front of a microphone in a room full of people. But it’s out of the bag now. I’m still not entirely sure if it’s even what I want, but it’s there in my mind and has been for a while. I remember vaguely thinking about it while up on that roof with Blake.\u003c/p\u003e\n\u003cp\u003eAndrew’s face loses all emotion and he can’t seem to find words to say. Instantly, my heart freezes and I feel sick to my stomach. I knew I shouldn’t have said that! He’s going to think I’m a slut or something.\u003c/p\u003e\n\u003cp\u003eI jump up from the bed.\u003c/p\u003e\n\u003cp\u003e“I’m sorry—God, you must think I’m—.”\u003c/p\u003e\n\u003cp\u003eHe reaches out and takes my wrist, “Sit back down.”\u003c/p\u003e\n\u003cp\u003eReluctantly, I do, but I can’t look at him. I’m completely f**king mortified.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with you?” he asks.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eI look back at him.\u003c/p\u003e\n\u003cp\u003e“You’re doing it right now.” He motions his hands to emphasize ‘right now’; his eyebrows are knotted.\u003c/p\u003e\n\u003cp\u003e“Doing what?”\u003c/p\u003e\n\u003cp\u003eHe licks his lips, sighs as if disappointed and finally says, “Camryn, you started to tell me something that maybe you’ve contemplated a time or two and just when you got the courage to speak your mind, you did a one-eighty and regretted it.” He looks deep into my eyes, his full of intensity and knowledge and something else I can’t yet place. “Ask me the question again and this time, wait for me to answer.”\u003c/p\u003e\n\u003cp\u003eI pause, searching that tense look on his face, unsure of it. Or, maybe it’s just me that I’m unsure of.\u003c/p\u003e\n\u003cp\u003eI swallow and say, “Have you ever had a one-night stand?”\u003c/p\u003e\n\u003cp\u003eHis expression doesn’t shift or fall. “Yes, I’ve had a few here and there.”\u003c/p\u003e\n\u003cp\u003eHe’s waiting for me now, even though I’m not sure yet how to make myself feel comfortable in this awkwardly-developing conversation. It’s like he knows I’m squirming inside, but to teach me a lesson he’s going to make me do the talking instead of being my shrink like he’s been since I came into his room.\u003c/p\u003e\n\u003cp\u003eHis eyebrows arch a little as if to say: Well?\u003c/p\u003e\n\u003cp\u003e“Well, I was just wondering…because I’ve never done something like that.”\u003c/p\u003e\n\u003cp\u003e“Why not?” he says so casually.\u003c/p\u003e\n\u003cp\u003eI look down and then back up at him so he doesn’t scold me for it.\u003c/p\u003e\n\u003cp\u003e“Well, it’s just kind of slutty, I guess.”\u003c/p\u003e\n\u003cp\u003eAndrew laughs and it surprises me.\u003c/p\u003e\n\u003cp\u003eFinally, he relieves me somewhat of my torture.\u003c/p\u003e\n\u003cp\u003e“If a girl did that a-lot,” he draws out that word with a squeamish smile, “then it would be slutty, sure. Once or twice, I don’t know…,” he motions his hands at level with his shoulders as if shaking the numbers around in his mind indecisively, “there’s nothing wrong with that.”\u003c/p\u003e\n\u003cp\u003eWhy isn’t he taking full advantage of this right now? I start freaking out a little inside, wondering why he’s still all shrink-mode rather than amping-up the flirting and getting down to business.\u003c/p\u003e\n\u003cp\u003e“Alright, so….”\u003c/p\u003e\n\u003cp\u003eI can’t say it. It’s just not me, to be able to casually talk about my sexual anything. I can only vaguely do that with Natalie.\u003c/p\u003e\n\u003cp\u003eAndrew sighs and his shoulders slouch over. “Are you wanting to sleep with me, to have a one-night stand with me?” He knew I wasn’t going to come out and say it, so he gave in and did it for me.\u003c/p\u003e\n\u003cp\u003eThe question, although obvious for both of us, stops my breath. It embarrasses and mortifies me with him saying it as much, maybe more, than if I would have.\u003c/p\u003e\n\u003cp\u003e“Maybe….”\u003c/p\u003e\n\u003cp\u003eHe stands up and looks down at me and says, “I’m sorry, but I’m not into you in that way.”\u003c/p\u003e\n\u003cp\u003eThe biggest fist in existence just slammed into my stomach. My hands go rigid, gripping the edge of the mattress, making my arms all the way up to the top of my shoulders, completely unmovable. All I want to do right now is run out that door and lock myself inside my room and never look at Andrew again. Not because I don’t want to see him, but because I don’t want him to see me.\u003c/p\u003e\n\u003cp\u003eI’ve never been so embarrassed in my entire life.\u003c/p\u003e\n\u003cp\u003eAnd this is what speaking my mind got me!\u003c/p\u003e\n\u003cp\u003eI don’t know whether to accept it as a lesson learned, or to hate him for making me do it.\u003c/p\u003e\n\u003cp\u003e19\u003c/p\u003e\n\u003cp\u003eIN A SPLIT-SECOND, I leap off the bed and walk as fast as I can to the door.\u003c/p\u003e\n\u003cp\u003e“Camryn, stop.”\u003c/p\u003e\n\u003cp\u003eI just keep moving, even faster when I feel him coming up behind me, and I grab the lever and swing the door open and then I run out into the hall.\u003c/p\u003e\n\u003cp\u003e“Please, just wait a damn minute!” he says, following me and I can hear the aggravation elevating in his voice.\u003c/p\u003e\n\u003cp\u003eI ignore him and reach into the little pocket on the back of my shorts and yank out my card key, thrusting it in my door. I push my way inside the room and go to close the door, but Andrew is already through it behind me.\u003c/p\u003e\n\u003cp\u003eThe door shuts after him.\u003c/p\u003e\n\u003cp\u003e“Will you just listen to me?” He tries once more, exasperated.\u003c/p\u003e\n\u003cp\u003eI don’t want to look at him, but I do anyway.\u003c/p\u003e\n\u003cp\u003eHis eyes are wide and fierce and sincere when finally I turn around.\u003c/p\u003e\n\u003cp\u003eHe steps up to me and grips my upper-arms carefully in his hands. And then he leans in and presses his lips softly against mine. I wilt, but I’m still too confused to react properly to it. Confused and stunned and my heart is racing. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-29.html","bookId":1856,"creation":"Oct 5, 2019 9:50:18 PM","modification":"Oct 5, 2019 9:50:18 PM"}
