{"id":80341,"no":47,"title":"Page 47","content":"\u003cp\u003e“But just once!” I point one finger. “And if anyone laughs at me you better not leave me in jail!”\u003c/p\u003e\n\u003cp\u003eHe grabs my face, squishing my cheeks in his hands and kisses my fish-lips.\u003c/p\u003e\n\u003cp\u003e31\u003c/p\u003e\n\u003cp\u003eMINUTES LATER, ANDREW’S COMING back through the door with his bags and his brother’s acoustic guitar.\u003c/p\u003e\n\u003cp\u003eHe is really excited about this.\u003c/p\u003e\n\u003cp\u003eI’m utterly terrified and already kicking myself for agreeing to it. But I have to admit, there’s also a tiny pang of excitement in me, too. I’m not totally afraid to be in front of a crowd—had no problem giving a speech on endangered wildlife in eleventh grade, or playing the part of Nurse Ratched in One Flew Over the Cuckoo’s Nest on stage my senior year. But singing is different. My acting isn’t all that bad. My singing, especially a duet with someone like Andrew who sings like a blues-rock god who melts panties, is another story.\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t want to hear my kind of music, anyway?”\u003c/p\u003e\n\u003cp\u003eAndrew sets his bags on the floor and goes to the bed with the guitar.\u003c/p\u003e\n\u003cp\u003e“Well, whatever that song was you were so cutely dancing and singing to, I will let slide—I was diggin’ it.”\u003c/p\u003e\n\u003cp\u003e“The Civil Wars—my flavor-of-the-month, I guess,” I say, coming out of the bathroom with wet hair, drying the ends with a towel (decided to rewash it after Andrew came back with the goods). “The song is called Barton Hollow.”\u003c/p\u003e\n\u003cp\u003e“Very modern-folksy,” he says, strumming the guitar a few times. “I like it.”\u003c/p\u003e\n\u003cp\u003eHe adds, looking up at me: “Where’s your phone?”\u003c/p\u003e\n\u003cp\u003eI walk over and get it from the windowsill, scroll the progress bar back to the beginning and hand it to him. He sets it beside him on the bed and hits play. I go back to drying my hair while he does his learn-by-ear thing, stopping and starting the music over again and again, curling his fingers around the neck of the guitar and testing the sound of the strings until he finds the right ones that match the music. In a matter of minutes, after a few out-of-tune chords, he starts to play the first riff easily.\u003c/p\u003e\n\u003cp\u003eAnd by nightfall he’s pretty much got the whole song down pat, with the exception of one short riff he keeps mixing up with another. Wanting to learn it as quickly as possible, he ended up looking for the music online and once he found it that definitely sped the progress up.\u003c/p\u003e\n\u003cp\u003eThe lyrics were easier.\u003c/p\u003e\n\u003cp\u003e“I think I’ve almost got it,” he says sitting on the windowsill against a dark and cloudy, rainy background. It started raining around eight and has been ever since.\u003c/p\u003e\n\u003cp\u003eEvery now and then I would join in and sing some with him, but I’ve been too nervous. I really don’t know how I’m going to pull something crazy like this off if I’m nervous with only him in the room. So much for not being afraid in front of crowds. I predict an extreme case of stage fright, after all.\u003c/p\u003e\n\u003cp\u003e“Come on, babe,” he says with a nod, his fingers draped over the guitar, “just because you already know all the words doesn’t mean you shouldn’t practice with me.”\u003c/p\u003e\n\u003cp\u003eI plop down on the end of the bed.\u003c/p\u003e\n\u003cp\u003e“You promise you won’t make any of your goofy faces at me, or grin, or smile, or—.”\u003c/p\u003e\n\u003cp\u003e“I won’t even breathe,” he says, laughing. “I swear! Come on.”\u003c/p\u003e\n\u003cp\u003eI sigh and get up from the bed, putting my half-eaten strip of beef jerky on the nightstand. Andrew positions the guitar on his thigh and takes a quick sip of bottled tea to get his mouth ready to sing.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” he says as I’m slowly walking over, “the guy has way more lines by himself to sing than the girl—she only has that one solo, the rest you’ll be singing right along with me.”\u003c/p\u003e\n\u003cp\u003eI shrug nervously. “True,” I admit. “At least through most of the song your voice will help drown mine out.”\u003c/p\u003e\n\u003cp\u003eHe places the guitar pick in-between his lips and reaches his hand out to me. “Baby, come here.”\u003c/p\u003e\n\u003cp\u003eI walk over and take his hand and he pulls me between his legs, the guitar between us. Once I’m still and where he wants me, he takes the pick from his mouth. “I love your voice, alright? But even if I thought you couldn’t sing I’d still want you to do this. What anyone else thinks doesn’t matter.”\u003c/p\u003e\n\u003cp\u003eMy lips lift into an unsure, demure smile. “OK,” I say, “I’ll do it for you, but it’s only for you; better remember that.” I point sternly at him. “You’re gonna owe me.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “First of all, I don’t want you doing it just for me, but since practicing is more important than arguing with you about it, I’ll wait until after you sing at Old Point to ask you if you got anything out of it other than giving me my way.”\u003c/p\u003e\n\u003cp\u003e“I think that’s fair enough.”\u003c/p\u003e\n\u003cp\u003eHe nods once and positions himself again and then starts to put the pick against the chords.\u003c/p\u003e\n\u003cp\u003e“W-Wait…maybe if you stand up, too, I won’t feel so singled out.”\u003c/p\u003e\n\u003cp\u003eAndrew laughs and stands up from the windowsill. “Damn, girl—alright, however you want to do it. If you decide you want to do it with a bag over your head, you can.”\u003c/p\u003e\n\u003cp\u003eI look at him as if entertaining the stupid idea.\u003c/p\u003e\n\u003cp\u003e“No way, Camryn, no bags. Now let’s do this.”\u003c/p\u003e\n\u003cp\u003eWe practice well into the night until we’re forced to quit because apparently we were disturbing the hotel guests on either side of us. And just when I was really starting to get the hang of it and letting loose a lot more, not worried what Andrew might be thinking of my singing.\u003c/p\u003e\n\u003cp\u003eI think I was doing pretty well.\u003c/p\u003e\n\u003cp\u003eWe go to bed earlier tonight since our practice got cut short and we lay curled up next to one another and just talk.\u003c/p\u003e\n\u003cp\u003e“I’m glad you got fed up with my shit,” I say lying in the fold of his arm. “Otherwise, I might be back in North Carolina right now.”\u003c/p\u003e\n\u003cp\u003eI feel his lips press into the side of my hair.\u003c/p\u003e\n\u003cp\u003e“I have to confess something,” he says.\u003c/p\u003e\n\u003cp\u003eMy ears perk up. “Oh?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he says, looking up at the ceiling where lights from the moving city outside move in strange patterns every now and then. “Back in Wellington, Kansas, in that first motel we got, when you were in the bathroom the next morning and I gave you two minutes to get ready…,” He pauses and I feel his head move slightly as if looking down at me.\u003c/p\u003e\n\u003cp\u003eI draw my head away from his arm so I can look up at him.\u003c/p\u003e\n\u003cp\u003e“Yeah, I remember; what did you do?”\u003c/p\u003e\n\u003cp\u003eHe smiles nervously.\u003c/p\u003e\n\u003cp\u003e“I sort of took a picture of your driver’s license with my phone.”\u003c/p\u003e\n\u003cp\u003eI blink back the mild stun.\u003c/p\u003e\n\u003cp\u003e“What for?” I rise up a little higher so I can look at him without risking my eyes getting stuck in the top of my head like that.\u003c/p\u003e\n\u003cp\u003e“Are you mad?”\u003c/p\u003e\n\u003cp\u003eI let out a spat of air. “I guess it depends on what you planned to do with the rather personal information.”\u003c/p\u003e\n\u003cp\u003eHe looks away, but I catch the blush on his face even in the darkness of the room.\u003c/p\u003e\n\u003cp\u003e“Well, it definitely wasn’t so I could find you later and cut you up into little pieces or anything.”\u003c/p\u003e\n\u003cp\u003eMy mouth falls open. “Well that’s a comfort!” I laugh.\u003c/p\u003e\n\u003cp\u003e“Seriously, though, why’d you take it?”\u003c/p\u003e\n\u003cp\u003eHe looks back at the ceiling again, seeming lost in thought.\u003c/p\u003e\n\u003cp\u003e“I just wanted to make sure I knew how to find you again,” he confesses, “you know…just in case we did decide to go our separate ways.”\u003c/p\u003e\n\u003cp\u003eMy eyes smile at him, but my mouth doesn’t. I’m not mad that he took the photo for that reason—I kind of want to kiss him for it—but I’m not sure I like the whole ‘just in case’ part, either. It makes me feel more than I already did that he planned to leave at some point, no matter what.\u003c/p\u003e\n\u003cp\u003e“Andrew?”\u003c/p\u003e\n\u003cp\u003e“Yeah, babe?”\u003c/p\u003e\n\u003cp\u003e“Is there anything else you’re not telling me?”\u003c/p\u003e\n\u003cp\u003eHe pauses. “No. Why do you ask?”\u003c/p\u003e\n\u003cp\u003eI look at the ceiling, too.\u003c/p\u003e\n\u003cp\u003e“I don’t know, I’ve just always sort of felt this strange…reluctance from you.”\u003c/p\u003e\n\u003cp\u003e“Reluctance?” he says, surprised. “Was I reluctant to talk you into going on this road trip with me? Or reluctant to go down on you?”\u003c/p\u003e\n\u003cp\u003e“No, I guess not.”\u003c/p\u003e\n\u003cp\u003e“Camryn, the only thing I’ve ever been reluctant about is wondering if it was right that we be together.”\u003c/p\u003e\n\u003cp\u003eI lift up from the bed and turn fully at the waist to see him. The shadow across his face makes his eyes fiercer. He’s shirtless and lies with one arm bent behind his head.\u003c/p\u003e\n\u003cp\u003e“You think we’re not right?”\u003c/p\u003e\n\u003cp\u003eThis conversation is starting to make my stomach fall in on itself.\u003c/p\u003e\n\u003cp\u003eHe reaches out the hand not propped behind his head and takes my wrist gently. “No, babe, I…I think we are right in every way…and that’s why I thin—that’s why I thought it was better we didn’t get involved.”\u003c/p\u003e\n\u003cp\u003e“But that doesn’t make any sense.”\u003c/p\u003e\n\u003cp\u003eHe pulls me down to him and I lay on the top of my hands on his chest.\u003c/p\u003e\n\u003cp\u003e“I just wasn’t sure if we should go through with it,” he says, combing his fingers through the hair beside my ears. “But, babe, you weren’t exactly sure of anything, either.”\u003c/p\u003e\n\u003cp\u003eI lay back down beside him. He’s got me on that one.\u003c/p\u003e\n\u003cp\u003eThe only thing I still don’t quite understand is what were his reasons for being so careful to get involved, exactly? He knows why I left home and all about Ian’s death. I have a laundry list of valid reasons stuck to the fridge by a banana magnet for all to see. Andrew’s reasons are still hidden in a shoebox somewhere labeled Christmas Cards.\u003c/p\u003e\n\u003cp\u003eAnd I think it’s more than just his dad.\u003c/p\u003e\n\u003cp\u003eHe moves his arm out from underneath my head and climbs on top of me, a leg on each side, his body propped up by his muscular arms.\u003c/p\u003e\n\u003cp\u003e“I’m glad you can’t sleep to music,” he says, apparently recalling the first thing I ever said to him and then he leans in and kisses me.\u003c/p\u003e\n\u003cp\u003eI lift my arms and cradle his beautiful face in my hands, pulling him down to kiss me again. “And I’m glad that Idaho is famous for potatoes.”\u003c/p\u003e\n\u003cp\u003eHis eyebrows scrunch up in his forehead.\u003c/p\u003e\n\u003cp\u003eI just smile and pull him toward my lips again. He kisses me deeply, tangling his tongue with mine. And then he starts to kiss his way down toward my stomach. He traces a circle around my bellybutton with the tip of his tongue and curls his fingers behind the elastic of my panties.\u003c/p\u003e\n\u003cp\u003e“I don’t think I can….” I say softly, gazing down at him.\u003c/p\u003e\n\u003cp\u003eHe licks my stomach and then kisses my fingers as my hands move to his face and then into his hair.\u003c/p\u003e\n\u003cp\u003e“No sex,” he says, “and I promise I’ll lick you carefully.” He slides my panties off and I lift my ass a little to make it easier for him.\u003c/p\u003e\n\u003cp\u003eHe kisses my inner thigh. And then the other.\u003c/p\u003e\n\u003cp\u003e“I’ll keep my tongue really wet so it doesn’t sting,” he says gently and kisses my inner thighs again, getting closer to my warmth.\u003c/p\u003e\n\u003cp\u003eI gasp a little when his fingers touch me very carefully and spread my lips apart.\u003c/p\u003e\n\u003cp\u003e“Damn, baby, you really are swollen.” His comment is heartfelt and not at all teasing.\u003c/p\u003e\n\u003cp\u003eIt does sting slightly, but my God I want this so bad….\u003c/p\u003e\n\u003cp\u003eI feel his breath hot between my legs. “I’ll be very gentle,” he says and my breath catches when his very wet tongue licks me once slowly, his fingers still holding me apart but without putting any pressure on the area. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-47.html","bookId":1856,"creation":"Oct 5, 2019 4:26:05 PM","modification":"Oct 5, 2019 4:26:05 PM"}
