{"id":80347,"no":54,"title":"Page 54","content":"\u003cp\u003e“Thank you,” I say and try not to cry myself.\u003c/p\u003e\n\u003cp\u003eMy hands fall away from her shoulders.\u003c/p\u003e\n\u003cp\u003eI reach into my back pocket and pull out a folded envelope and I put it into my mother’s reluctant hand. I kiss her forehead.\u003c/p\u003e\n\u003cp\u003eShe refuses to look down at it. To her, it’s a finality. To me, it says all of the things I won’t be able to say.\u003c/p\u003e\n\u003cp\u003eMy mother nods and more tears pour from her eyes. She sets the envelope on her tall dresser and grabs a tissue from a box next to her bed. Dabbing the tears from her cheeks and sniffling back the rest, she tries to gain her composure again before going back into the living room with Camryn.\u003c/p\u003e\n\u003cp\u003e“Why don’t you just tell her, Andrew?” she says turning back to look at me in front of the bedroom door. “You should let her know so the two of you can do the things you’ve always wanted to do before—”\u003c/p\u003e\n\u003cp\u003e“I can’t,” I say and my own words rip a hole through my chest. “I want everything to happen how it normally would and not be forced to happen sooner because of something else.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t like my answer, but she understands it.\u003c/p\u003e\n\u003cp\u003eWe walk back out together and she’s smiling as much as she can for Camryn’s sake when we enter the living room again.\u003c/p\u003e\n\u003cp\u003eCamryn keeps her smile, too, but it’s plain in her face that she knows my mother has been crying.\u003c/p\u003e\n\u003cp\u003eMom walks over to Camryn and instinctively Camryn stands up.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I have to cut this visit short,” my mom says, taking Camryn into a hug, “but I received some unfortunate news about a family member while I was on the phone with Asher. I hope you’ll understand.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Camryn says, her expression hardened by worry. She glances at me briefly. “I’m sorry to hear that. I hope you’ll be OK.”\u003c/p\u003e\n\u003cp\u003eMy mom nods and pushes a smile through her teary eyes. “Thank you, honey. Have Andrew bring you back anytime; you’re always welcome here.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Camryn says softly and takes it upon herself to hug my mom again.\u003c/p\u003e\n\u003cp\u003e“Andrew, what was that all about?” she asks before I even get my car door shut.\u003c/p\u003e\n\u003cp\u003eI sigh and turn the key in the ignition. “It’s just sibling rivalry stuff,” I say, trying not to look at her next to me. I start the car and put the gear in reverse. “Mom gets upset when Aidan and I are fighting.”\u003c/p\u003e\n\u003cp\u003e“You’re lying.”\u003c/p\u003e\n\u003cp\u003eI am and I’ll continue to.\u003c/p\u003e\n\u003cp\u003eI look over at her briefly and back the car out onto the street.\u003c/p\u003e\n\u003cp\u003e“She just didn’t want to drag you into it,” I begin and the rest of the lie just starts to fall into place. “But it has everything to do with my father’s funeral. Notice she didn’t bring it up in front of you. Taking me into the back room to talk about it was her way of sparing you.”\u003c/p\u003e\n\u003cp\u003eShe still doesn’t believe me, but I can tell she’s starting to.\u003c/p\u003e\n\u003cp\u003e“So, then what was this news about a family member?”\u003c/p\u003e\n\u003cp\u003e“There wasn’t any,” I say. “She just wanted to talk to me and I told her about the argument I had with Aidan on the phone before we left my apartment and it upset her.”\u003c/p\u003e\n\u003cp\u003eCamryn sighs and faces her window.\u003c/p\u003e\n\u003cp\u003e“My mom really likes you.”\u003c/p\u003e\n\u003cp\u003eShe looks over. At first I get the feeling she wants to further the conversation about Aidan, but she drops it.\u003c/p\u003e\n\u003cp\u003e“Well she’s a very sweet woman,” Camryn says. “Maybe you and Aidan (she puts emphasis on his name as if she still doesn’t fully believe my lie) should try to get along better so you two don’t upset her so much.”\u003c/p\u003e\n\u003cp\u003eAlthough misplaced, it’s still not bad advice.\u003c/p\u003e\n\u003cp\u003e“Baby, look, I’m sorry; maybe I should’ve waited to bring you to meet her.”\u003c/p\u003e\n\u003cp\u003e“It’s OK,” she says and scoots over to sit next to me. “I’m glad you did. It made me feel…special.”\u003c/p\u003e\n\u003cp\u003eI think she believes me now, or maybe she’s just trying to push her gut feeling into the back of her mind because she realizes I’m not going to crack the truth anytime soon.\u003c/p\u003e\n\u003cp\u003eI slip my arm around her.\u003c/p\u003e\n\u003cp\u003e“Well you are special.”\u003c/p\u003e\n\u003cp\u003eShe lays her head on my chest. “You didn’t tell her about leaving tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I know, but I will. I might call her later tonight and fill her in.” I squeeze her gently. “Now that she’s met you and definitely loves you, I think she won’t be as worried about me doing something so abnormal.”\u003c/p\u003e\n\u003cp\u003eCamryn slips her hand in-between my thighs and smiles up at me. “Yeah, now I just have to tell my mom.” She lifts up suddenly like a thought just dawned on her. “I could just wait to tell her when we drive through North Carolina and drop in so you can meet her.”\u003c/p\u003e\n\u003cp\u003eThat beautiful blue-eyed smile of hers is beaming.\u003c/p\u003e\n\u003cp\u003eI smile back and nod. “You want to take someone like me home to meet your mom? What if she takes one look at my tats and steals you away from me?” I joke.\u003c/p\u003e\n\u003cp\u003e“No way,” she says, laughing lightly. “If anything, she’ll be enamored by you.”\u003c/p\u003e\n\u003cp\u003e“Uh oh, gonna get me some cougar action!”\u003c/p\u003e\n\u003cp\u003eHer eyes bug out of her head and I throw my head back and laugh.\u003c/p\u003e\n\u003cp\u003e“Baby, I’m kidding!”\u003c/p\u003e\n\u003cp\u003eShe snarls at me and takes a deep, aggravated breath, but she’s not hiding the humor from her face very well, either.\u003c/p\u003e\n\u003cp\u003e“Hey, have you ever…you know…?”\u003c/p\u003e\n\u003cp\u003eShe can’t say it out loud and I think it’s hilarious.\u003c/p\u003e\n\u003cp\u003e“Been with an older woman?” I say, smirking.\u003c/p\u003e\n\u003cp\u003eThis topic is clearly uncomfortable for her, but she’s the one that asked and so I’m at complete liberty to torture her with it as much as possible.\u003c/p\u003e\n\u003cp\u003e“Yeah, I have.”\u003c/p\u003e\n\u003cp\u003eHer head snaps around and her eyes are even wider than before. “You have not!”\u003c/p\u003e\n\u003cp\u003eI laugh while at the same time saying, “Yes, I have.”\u003c/p\u003e\n\u003cp\u003e“How old was she? Or…they?” Her head turns at an angle, but her eyes never move.\u003c/p\u003e\n\u003cp\u003eThe plural version looks like dangerous territory all of a sudden, but I do want to be completely honest with her. Well, about this sort of thing, anyway….\u003c/p\u003e\n\u003cp\u003eI put my hand on her leg. “A couple of times. One was only about thirty-eight which to me is not much different from twenty-eight. But I also slept with a woman who was around forty-three.”\u003c/p\u003e\n\u003cp\u003eCamryn’s face is hot from blushing, but she’s not jealous or pissed off in any way. Though I think she might be a little…worried.\u003c/p\u003e\n\u003cp\u003e“What do you like better?” she asks very cautiously.\u003c/p\u003e\n\u003cp\u003eI try not to grin.\u003c/p\u003e\n\u003cp\u003e“Baby, it’s not about age,” I admit. “I mean, I’m not into grannies or anything and I think any woman, no matter how old she is, who keeps herself lookin’ hot is totally fuckable.”\u003c/p\u003e\n\u003cp\u003e“Oh my God!” Camryn laughs. “Talk about the dirty mouth on me!”\u003c/p\u003e\n\u003cp\u003eShe shakes off the stun of my words and then says, “You didn’t answer my question.”\u003c/p\u003e\n\u003cp\u003e“Technically I did,” I mess with her some more. “You asked what I like better and there’s really not a solid answer to your question, just a generality.”\u003c/p\u003e\n\u003cp\u003eI know exactly what her question really meant and I’m sure she knows as much. But I never pass up an opportunity to make her squirm.\u003c/p\u003e\n\u003cp\u003eShe narrows her eyes at me.\u003c/p\u003e\n\u003cp\u003eI laugh and finally give in.\u003c/p\u003e\n\u003cp\u003e“Baby, you are the best sex I have ever had,” I say and she purses her lips as if to say: Yeah, right, you’re just saying that because you’re currently biased. “And I mean that, Camryn. I’m not just filling your head with shit because you’re sitting in front of me and because I cherish my nutsack.”\u003c/p\u003e\n\u003cp\u003eShe smiles and rolls her eyes, but believes my words now. I pull her closer to me again and she’s happy to lay her head back on my chest.\u003c/p\u003e\n\u003cp\u003e“You’re the best sex I’ve ever had because I got something out of you I’ve never gotten out of a girl before.”\u003c/p\u003e\n\u003cp\u003eShe tilts her head upward to look at me, waiting to hear what exactly that might be.\u003c/p\u003e\n\u003cp\u003eI smile back down at her and say, “I de-virginized your innocence, made you more comfortable with yourself sexually. And that is so hot to me.”\u003c/p\u003e\n\u003cp\u003eCamryn leans up and kisses my jawline.\u003c/p\u003e\n\u003cp\u003e“You just like me for that head-job on the highway.”\u003c/p\u003e\n\u003cp\u003eI look upward and grin. “Well, I did really, really, really love that, but no, babe, that’s not what I like you for.”\u003c/p\u003e\n\u003cp\u003eI think she finally feels validated again. She nuzzles her head against my chest and grabs me tight with her right arm across my stomach.\u003c/p\u003e\n\u003cp\u003eWe ride the rest of the way back to my apartment without saying anything. I sense that her silence is less grim than my own. But I don’t want her to worry or to be brokenhearted. Not right now. Not ever. It’s inevitable, but I want to hold it back for as long as I can.\u003c/p\u003e\n\u003cp\u003eWe spend four hours watching movies in the living room, both of us sprawled out across the couch. I hold her in my arms and kiss her when she’s trying to pay attention to an important scene and I stick my tongue in her ear just to make her scream about how gross it is. She’s so cute when she’s ‘grossed out’, so it’s her own damn fault that I enjoy doing it so much. We throw popcorn into each other’s mouths and take score. She won, six to my four, before we gave up and actually started eating the popcorn instead of playing with it. And I introduced her to my plant, Georgia, who didn’t die while I was gone. Camryn told me about a mix-breed dog she adopted from an animal shelter that she named BeeBop, and I told her how sorry I felt for that dog to have been given such a f**ked up name. Coincidently, BeeBop died of congestive heart failure just like my dog and best friend, Maximus. I showed her pictures of him and she happened to have one of BeeBop with her, too. It was so ugly, it was cute.\u003c/p\u003e\n\u003cp\u003eWe talk for hours and hours until she crawls onto my lap on the couch, straddling me. She lays her body against mine and says so softly that it makes my insides shiver, “Let’s go to bed….”\u003c/p\u003e\n\u003cp\u003eI stand up with her legs still wrapped around my waist, her ass propped within my hands and I carry her to the bedroom. I slip out of my clothes, all of them, and lay down in the center of the bed. I was rock-hard before I brought her in here. And I watch her as she slowly undresses in front of me, stripping not only her clothes but her usual shy demeanor. She crawls on top of me from the foot of the bed and positions herself on my lap so that I feel myself pressing in-between her warm lips below. She never takes her eyes off mine as she leans her body over to bring her mouth closer to mine, kissing my chest and circling my n**ples with the tip of her tongue. I keep the heat of her thighs underneath my hands until she kisses me and I reach up and fill them with her br**sts.\u003c/p\u003e\n\u003cp\u003e“You feel so good,” I whisper against her mouth just before she steals my breath with her kiss.\u003c/p\u003e\n\u003cp\u003eI press gently into her below and she presses back a little harder, teasing me and making me want to shove myself deep inside of her. But right now, she’s the one in control and I’ll gladly let her have it.\u003c/p\u003e\n\u003cp\u003eShe breaks the kiss and then she kisses one side of my neck and then the other, always moving her h*ps so slowly that it makes me want her that much more.\u003c/p\u003e\n\u003cp\u003e“Let me get you wet first,” I whisper up at her, my hands locked around her little hips. She’s already wet, but that’s beside the point. “Crawl up here, baby,” I say, lifting my chin to indicate my face. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-edge-of-never-the-edge-of-never-1/page-54.html","bookId":1856,"creation":"Oct 5, 2019 4:26:05 PM","modification":"Oct 5, 2019 4:26:05 PM"}
