{"id":108398,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe passes the bottle to her and sits back. She drinks.\u003c/p\u003e\n\u003cp\u003eYour family, they’re just doin what they know how to do is all.\u003c/p\u003e\n\u003cp\u003eJust like the slugs, right?\u003c/p\u003e\n\u003cp\u003eI reckon it ain’t the first time the comparison’s been made.\u003c/p\u003e\n\u003cp\u003eHe looks at her again, and she can feel her skin go taut.\u003c/p\u003e\n\u003cp\u003eWhere exactly are you from, Sarah Mary Williams? And don’t tell me Statenville. I’ve been to Statenville, it’s a ghost town.\u003c/p\u003e\n\u003cp\u003eI’ve been down south for a while. Found myself a nice little place, but the meatskins were fixin to move in. Before that I did a lot of travelin. Alabama, Mississippi, Texas. Once I got as far north as Kansas City.\u003c/p\u003e\n\u003cp\u003eWhat about your parents?\u003c/p\u003e\n\u003cp\u003eWhat about them?\u003c/p\u003e\n\u003cp\u003eWhere are they?\u003c/p\u003e\n\u003cp\u003eBeats me. I guess I must of had some. But they either roamed free or got dead before I got any recollection of em.\u003c/p\u003e\n\u003cp\u003eWhat about—\u003c/p\u003e\n\u003cp\u003eHe points down toward the house.\u003c/p\u003e\n\u003cp\u003eIs he really your brother? he asks.\u003c/p\u003e\n\u003cp\u003eHim? Huh-uh. He’s just a dummy I picked up a ways back. He don’t talk much, but he follows directions real good. Bet he could haul quite a load, big as he is. Would be a good worker to have around if anybody had need of one.\u003c/p\u003e\n\u003cp\u003eSo you don’t have any family at all?\u003c/p\u003e\n\u003cp\u003eShe shrugs and sniffs, wiping her nose on the back of her hand.\u003c/p\u003e\n\u003cp\u003eNot really. There was a kid once. Malcolm. It could of been he was my brother—but all the papers in the orphanage got burned. And there was Uncle Jackson, but we just called him that. He wasn’t a real uncle or nothing.\u003c/p\u003e\n\u003cp\u003eWhat happened to them?\u003c/p\u003e\n\u003cp\u003eUncle Jackson, he got bit.\u003c/p\u003e\n\u003cp\u003eWHERE IT happened was up on the ridge where Uncle Jackson liked to hunt rabbits. He was crouched down in a gully taking careful aim when he felt the hands on him, the teeth sinking into the flesh of his forearm. He said he never saw the thing coming at all. That it must’ve been there in the leaves for who knows how long just waiting for some food to come along, like a Venus flytrap or something.\u003c/p\u003e\n\u003cp\u003eShe found him later, met him as he was coming back to the cabin.\u003c/p\u003e\n\u003cp\u003eYou’re gonna have to do something for me, little bit. It’s not gonna be pretty. Are you ready to do it?\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eHe led her to a fallen tree and rolled up his sleeve and put his arm out and told her to tie it tight above the elbow with his belt. She did it. Then he told her to use her gurkha and take it off.\u003c/p\u003e\n\u003cp\u003eJust one quick stroke. Do you think you can do it?\u003c/p\u003e\n\u003cp\u003eIt’s gonna hurt you bad, ain’t it?\u003c/p\u003e\n\u003cp\u003eIt’s not gonna hurt as much as the alternative, little bit. Now you go on. Thirteen years old, maybe, but you’ve got a hacking arm on you the kind I’ve never seen before. Can you do it?\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eHe put the loose end of the belt in his mouth so he wouldn’t scream when she did it.\u003c/p\u003e\n\u003cp\u003eShe brought the blade down quick and firm like he had taught her before.\u003c/p\u003e\n\u003cp\u003eAfterward, he couldn’t walk so straight, so she got under his good arm and took him back to the cabin and laid him down on his cot.\u003c/p\u003e\n\u003cp\u003eWhat happened to Uncle Jackson’s arm? Malcolm said. He gazed around Temple’s body at the man lying on the bed. He was a worrying kind, Malcolm was, and sometimes you had to make him breathe into a bag when he got stirred up.\u003c/p\u003e\n\u003cp\u003eHe got in an accident.\u003c/p\u003e\n\u003cp\u003eWas it meatskins?\u003c/p\u003e\n\u003cp\u003eIt’s gonna be okay. Go to the well and bring me back some water.\u003c/p\u003e\n\u003cp\u003eBut where’s his arm?\u003c/p\u003e\n\u003cp\u003eGo on like I told you.\u003c/p\u003e\n\u003cp\u003eThey heated water on the woodstove and put damp cloths on Uncle Jackson’s forehead and tried to get him to drink. He was fitful for a long time, his head jerking back and forth, his good hand clutching at the space where his other arm should have been.\u003c/p\u003e\n\u003cp\u003eEventually he slept, and so did Malcolm. And she sat up and watched the man in the glow of the firelight.\u003c/p\u003e\n\u003cp\u003eHe woke after midnight, but he wasn’t the same. There was a quietness to him as of someone given up.\u003c/p\u003e\n\u003cp\u003eHow you doing, little bit?\u003c/p\u003e\n\u003cp\u003eI’m all right, she said.\u003c/p\u003e\n\u003cp\u003eIt got me, he said. I can feel it.\u003c/p\u003e\n\u003cp\u003eBut your arm. It could be we got it in time. You might not change.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eI can feel it, he said. It’s in me. Whatever it is, it’s part of me now. You’re gonna have to take Malcolm away from here.\u003c/p\u003e\n\u003cp\u003eNo, she said. You don’t know. You’re sick but it might not be that. You could make it, it might not be that.\u003c/p\u003e\n\u003cp\u003eListen to me, little bit. You have to know this, it’s important. When it happens, you can feel it. All right? Are you listening? When it happens you’ll know.\u003c/p\u003e\n\u003cp\u003eBut—\u003c/p\u003e\n\u003cp\u003eGive me that pistol from the table.\u003c/p\u003e\n\u003cp\u003eShe brought the pistol to him. He popped the cartridge.\u003c/p\u003e\n\u003cp\u003eNow take out all the rounds except one.\u003c/p\u003e\n\u003cp\u003eIt could be—\u003c/p\u003e\n\u003cp\u003eCome on, little bit. You do what I’m telling you. Just leave one round. You’re gonna need the rest.\u003c/p\u003e\n\u003cp\u003eShe did it.\u003c/p\u003e\n\u003cp\u003eNow you take the guns and put them in the trunk of the car, and you take Malcolm, and the two of you drive away from here and don’t come back. You got it? You listening to me?\u003c/p\u003e\n\u003cp\u003eShe wiped her eyes on her sleeve and shook her head.\u003c/p\u003e\n\u003cp\u003eTemple, I’m talking to you, he said, his voice coming harsh and sudden and causing her to straighten up. Now you’re gonna do exactly what I tell you, do you understand?\u003c/p\u003e\n\u003cp\u003eYes, sir.\u003c/p\u003e\n\u003cp\u003eI’ll be all right here. I’ll take care of myself before it gets ahold of me.\u003c/p\u003e\n\u003cp\u003eHe gripped the gun to his chest.\u003c/p\u003e\n\u003cp\u003eNow you’ve got bigger things to think about, little bit. You’ve made a home out of this world somehow—I don’t know how you did it, but you did. And that means you can go anywhere in it. Everyplace is your backyard. You understand me?\u003c/p\u003e\n\u003cp\u003eYes, sir.\u003c/p\u003e\n\u003cp\u003eNever let anyone tell you you don’t belong where you’re at. You’re my girl, and you’re gonna climb high and stand over all of them.\u003c/p\u003e\n\u003cp\u003eYes, sir.\u003c/p\u003e\n\u003cp\u003eNow go on out of here. That’s my girl. I’m gonna remember you. That’s a dead man’s promise. Wherever my mind goes, it’s gonna have you in it.\u003c/p\u003e\n\u003cp\u003eEVERYBODY’S GOT a time to die, Temple says. That was his. I guess God’s got it all written down somewhere—but it wouldn’t do no good to read it anyway.\u003c/p\u003e\n\u003cp\u003eHe passes the bottle to her and she drinks. There’s a warm blush spreading through her chest and into her cheeks, and she fingers the smooth taffeta of her dress. The warm night air tickles the back of her neck and gives her shivers.\u003c/p\u003e\n\u003cp\u003eHow long were you with him?\u003c/p\u003e\n\u003cp\u003eTwo, three years, she shrugs. I ain’t so good about time.\u003c/p\u003e\n\u003cp\u003eAnd you’ve been traveling ever since?\u003c/p\u003e\n\u003cp\u003eMore or less.\u003c/p\u003e\n\u003cp\u003eWhat about the boy? Malcolm. What happened to him?\u003c/p\u003e\n\u003cp\u003eHer lips close themselves tight, and she looks straight ahead into the purple-black horizon.\u003c/p\u003e\n\u003cp\u003eIt was the giant outside of Tulsa. That’s where it happened. Under the giant. An iron man in a hardhat, standing proud, eight stories tall, with one elbow akimbo, one fist on his waist and the other resting on top of an oil derrick. A severe and mighty thing, looking like a soldier of God who could shake the earth with his footsteps. The locals had told her about it, said it was an artifact of the past, a towering homage to the petroleum industry during its heyday decades before.\u003c/p\u003e\n\u003cp\u003eMalcolm had to see it.\u003c/p\u003e\n\u003cp\u003eSo they took a detour and stopped and gazed up at it and felt puny.\u003c/p\u003e\n\u003cp\u003eWho built it? Malcolm asked.\u003c/p\u003e\n\u003cp\u003eI don’t know. The city, I guess.\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003eShe shrugged.\u003c/p\u003e\n\u003cp\u003eI don’t know, she said. It makes people feel good to build somethin big. Makes people feel like they’re makin progress, I reckon.\u003c/p\u003e\n\u003cp\u003eProgress toward what?\u003c/p\u003e\n\u003cp\u003eIt don’t matter. Up higher or down deeper or out farther. As long as you’re movin, it don’t matter much where you’re goin or what’s chasin you. That’s why they call it progress. It keeps goin of its own accord.\u003c/p\u003e\n\u003cp\u003eDo they still build things like this?\u003c/p\u003e\n\u003cp\u003eNot much, I don’t guess.\u003c/p\u003e\n\u003cp\u003eIs that cause there ain’t no progress anymore?\u003c/p\u003e\n\u003cp\u003eWhat you talkin about? There’s still progress. It just ain’t in iron man statues anymore.\u003c/p\u003e\n\u003cp\u003eWhere is it then?\u003c/p\u003e\n\u003cp\u003eLots of places. Like inside you.\u003c/p\u003e\n\u003cp\u003eIn me?\u003c/p\u003e\n\u003cp\u003eSure. In the history of the planet, there ain’t never been a kid like you before. A kid who’s seen the things you seen. A kid who fought the same fights you fought. You’re a new thing altogether. A brand-new thing.\u003c/p\u003e\n\u003cp\u003eHe scratched an itch on his nose and thought about that. Then he looked up again at the iron man.\u003c/p\u003e\n\u003cp\u003eAnyway, he said, I like it. It ain’t never gonna die.\u003c/p\u003e\n\u003cp\u003eHe was right. He made her take the detour, and he made her stop and look up at it, and then everything after happened the way it happened, and there’s nothing she can do to go back and change it—but he was right about the iron man. It was a powerful sight and spoke of ingenuity and human pride and the deathless specter of evolution—a thing of mightiness that cast its shadow far out past the road, and beyond that to the fertile plains of America. A country of foolishness and wonderment and capital and perversity. Feeling like God at supper in the sky, horizons pink and blue, a frontier blasted through with breath and industry, like God himself could suffocate on the beauty of the place, could curl up and die at beholdin his own creation, all the razor reds of the West and the broke-down South always on a lean, elegantlike, the coyote howl and the cannibal kudzu and the dusty windows that ain’t seen a rag of cleaning since—\u003c/p\u003e\n\u003cp\u003eHey, James Grierson says. Where’d you go?\u003c/p\u003e\n\u003cp\u003eShe realizes she hasn’t said anything for a long time. There are some things she doesn’t like to think about because thinking about them takes up every part of her mind and body.\u003c/p\u003e\n\u003cp\u003eHuh? she says.\u003c/p\u003e\n\u003cp\u003eI asked you about the boy. What happened to him?\u003c/p\u003e\n\u003cp\u003eHe ain’t with me anymore.\u003c/p\u003e\n\u003cp\u003eDid—what happened?\u003c/p\u003e\n\u003cp\u003eJames Grierson and his pale skin and his dark eyes. He is different now than he was before. He could swim in circles in the air.\u003c/p\u003e\n\u003cp\u003eTo shut him up, she leans over and kisses him hard on the lips. The bottle between them falls to the ground, and she can taste his breath and it tastes like her own breath, and he takes her head in his hands and kisses her like he would consume her if he could.\u003c/p\u003e\n\u003cp\u003eShe kisses him hard for a while, and it’s like the two of them are wolves nipping at each other. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-reapers-are-the-angels-reapers-1/page-14.html","bookId":2516,"creation":"Oct 5, 2019 11:20:50 PM","modification":"Oct 5, 2019 11:20:50 PM"}
