{"id":108414,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWilson’s men know the women here, and they find one another in the crowd and move off together in pairs, some of the women slung cackling over the shoulders of the men, their behinds stuck in the air and slapped like you would slap a sack of grain.\u003c/p\u003e\n\u003cp\u003eOther townspeople help the refugees down from the boxcars, and Wilson himself consults with a man and a woman, the elders of the town, to decide which of the refugees should stay and which should be taken on to Dallas.\u003c/p\u003e\n\u003cp\u003eOnce the train is emptied of its passengers, the children begin playing Cowboys and Indians, using it as a massive prop.\u003c/p\u003e\n\u003cp\u003eI’m huntin a nice cool drink, Lee tells her. You want one?\u003c/p\u003e\n\u003cp\u003eI reckon Maury and me’ll just look around a bit.\u003c/p\u003e\n\u003cp\u003eSuit yourself. But try not to beat up on anyone while we’re here, what do you say?\u003c/p\u003e\n\u003cp\u003eShe stands in the middle of the street for a while, not sure what to do with herself. Her place, it’s been proven over and over, is out there with the meatskins and the brutishness, not here within the confines of a pretty little peppertown. She tried that before, and it didn’t work out. What she really wants is to feel that gurkha knife solid in her hand—her palm is sweating for it—but she keeps it sheathed so as not to frighten the children.\u003c/p\u003e\n\u003cp\u003eShe tries folding her arms over her chest and then she tries clasping her wrists behind her back, and then she tries stuffing her hands in her pockets, but nothing seems quite right, and she wishes it were just her and Maury outside where she would know there was something to be done, like building a fire or hiding from pursuers or slaughtering a meatskin.\u003c/p\u003e\n\u003cp\u003eAfter a while a boy approaches her. He is a little taller than she is, and he’s wearing a plaid shirt tucked into his jeans and a belt of braided leather strips with a big silver buckle that has a horse on it.\u003c/p\u003e\n\u003cp\u003eMy name’s Dirk.\u003c/p\u003e\n\u003cp\u003eHello, Dirk.\u003c/p\u003e\n\u003cp\u003eAre you going to tell me your name?\u003c/p\u003e\n\u003cp\u003eSarah M—Temple, I guess.\u003c/p\u003e\n\u003cp\u003eYou guess? You don’t know?\u003c/p\u003e\n\u003cp\u003eIt doesn’t come naturally to her, but she’s trying out the truth since this seems like such a trusting kind of place.\u003c/p\u003e\n\u003cp\u003eIt’s Temple, she says.\u003c/p\u003e\n\u003cp\u003eWhere are you from? he says.\u003c/p\u003e\n\u003cp\u003eLots of places.\u003c/p\u003e\n\u003cp\u003eI mean, where did you grow up?\u003c/p\u003e\n\u003cp\u003eTennessee mostly.\u003c/p\u003e\n\u003cp\u003eI know where that is. I’ve seen it on a map in school, I mean. I was born here, and I haven’t been anywhere else except for Dallas once on the train. It isn’t safe other places.\u003c/p\u003e\n\u003cp\u003eSafe ain’t something I’m used to.\u003c/p\u003e\n\u003cp\u003eTemple, you shouldn’t say ain’t.\u003c/p\u003e\n\u003cp\u003eWhy not?\u003c/p\u003e\n\u003cp\u003eIt’s poor grammar, he says as though he’s quoting something. It speaks to a lack of sophistication.\u003c/p\u003e\n\u003cp\u003ePoor grammar’s the only kind of grammar I got.\u003c/p\u003e\n\u003cp\u003eHow old are you?\u003c/p\u003e\n\u003cp\u003eI don’t know. What day is it?\u003c/p\u003e\n\u003cp\u003eDirk looks at his digital watch, which also shows the date.\u003c/p\u003e\n\u003cp\u003eIt’s August fourth.\u003c/p\u003e\n\u003cp\u003eReckon I’m sixteen now. My birthday was last week.\u003c/p\u003e\n\u003cp\u003eShe tries to remember what she must have been doing on the day itself, but being on the road swallows up the lines between days.\u003c/p\u003e\n\u003cp\u003eSixteen! he says happily. I’m sixteen too. Do you want to go with me on a date?\u003c/p\u003e\n\u003cp\u003eA date?\u003c/p\u003e\n\u003cp\u003eWe can go to the diner and get a Coke.\u003c/p\u003e\n\u003cp\u003eWith ice?\u003c/p\u003e\n\u003cp\u003eThey always serve it with ice.\u003c/p\u003e\n\u003cp\u003eOkay, let’s go on a date.\u003c/p\u003e\n\u003cp\u003eThey walk to the diner, and Dirk insists upon holding her hand. He is disappointed when Maury begins to follow silently behind them, but she refuses to leave him. The diner is a real diner, with a counter and stools and booths and everything, the kind she’s seen only in a state of dusty decay on empty roadsides. Dirk wants to sit in a booth, but Temple doesn’t want to pass up the opportunity to sit at the counter—so the three of them take stools next to one another and Dirk orders three Cokes and, having decided to play a more chivalrous role, unwraps Maury’s straw for him.\u003c/p\u003e\n\u003cp\u003eDo you like music? Dirk asks.\u003c/p\u003e\n\u003cp\u003eYeah. Are there people who don’t?\u003c/p\u003e\n\u003cp\u003eWe got lucky, we have a whole music store in town. It’s right down the street. I bet I could name a hundred different musicians you’ve never even heard of.\u003c/p\u003e\n\u003cp\u003eI’d call that a pretty safe bet.\u003c/p\u003e\n\u003cp\u003eI like some rock and roll, but mostly I listen to classical composers. Tchaikovsky and Rachmaninoff and Smetana. That’s the music for people who are really civilized. Have you heard Dvoak’s Symphony Number Nine? It’s the most beautiful thing in the world, and it makes you feel like anything is possible.\u003c/p\u003e\n\u003cp\u003eHe continues to speak of things mostly foreign to Temple, but she sips her Coke and fishes ice cubes out of her glass with a spoon and crushes them between her teeth, and the world he tells her about seems like a very nice one, a very quaint one, but also one that doesn’t quite accord with the things she’s seen and the people she’s known. Still, she likes his big visions and his grand tomorrows, and she wouldn’t spoil them for anything.\u003c/p\u003e\n\u003cp\u003eHe describes how the administrators of the town have plans to expand, to move the blockades back and build the town out, block by block, until they’ve retaken the whole city. All they need are people to defend the borders, and new settlers are arriving all the time, strong people filled with skill and wit and vision.\u003c/p\u003e\n\u003cp\u003eAnd once we have all of Longview back, he says, his gestures growing more expansive by the moment, then we grow even farther, east until we meet Dallas and south to Houston. We can do it. All it takes is people. And when we connect with those cities, we can march on the rest of Texas and take it all back and claim it for civilization, and we can play Dvoak from speakers as we go, because he wrote that music for a new world, and we’ll be building a new world, and pretty soon the gobblers won’t have anywhere to go but into the ocean.\u003c/p\u003e\n\u003cp\u003eGobblers? she says.\u003c/p\u003e\n\u003cp\u003eYou know, he says. Outside. What do you call them?\u003c/p\u003e\n\u003cp\u003eIt’s a funny name. I just never heard them called that before.\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eHe looks deflated, and she feels sorry she said anything—and then she feels irritated for having to feel sorry for this boy with the big silver belt buckle.\u003c/p\u003e\n\u003cp\u003eBut he gathers himself together again, tying himself into a bow tie of optimism and gladness, and takes her by the hand and walks her up and down all nine city blocks of Longview, Texas.\u003c/p\u003e\n\u003cp\u003eHer palm is getting sweaty, and she tries to squirm it out of his hand, but he won’t let go. He smiles as he talks to her and looks straight ahead, as though confident that once they are married he will have a whole lifetime to gaze upon her.\u003c/p\u003e\n\u003cp\u003eWhat do you like to do? he asks her.\u003c/p\u003e\n\u003cp\u003eWhat do you mean?\u003c/p\u003e\n\u003cp\u003eTemple, it’s frustrating the way you always ask what I mean.\u003c/p\u003e\n\u003cp\u003eHe sighs and smiles at her, bolstering his patience.\u003c/p\u003e\n\u003cp\u003eFor example, he explains, I like to listen to music. And I like to read books, and I like to write stories, and we have a guitar I like to play sometimes. What do you like to do?\u003c/p\u003e\n\u003cp\u003eMost of the things she likes to do are related to the project of staying alive in the world, and those things don’t seem to be on the same level as playing a guitar. She tries to conjure up a fitting answer to his question, but she can’t.\u003c/p\u003e\n\u003cp\u003eThose same things, she says. I like those same things.\u003c/p\u003e\n\u003cp\u003eWe have a lot in common, he says.\u003c/p\u003e\n\u003cp\u003eRight. Look, I gotta go.\u003c/p\u003e\n\u003cp\u003eAll right.\u003c/p\u003e\n\u003cp\u003eStill holding her hand, he positions himself directly in front of her.\u003c/p\u003e\n\u003cp\u003eI enjoyed our date, he says.\u003c/p\u003e\n\u003cp\u003eSure. Me too. Thanks for the Coke.\u003c/p\u003e\n\u003cp\u003eI would enjoy doing it again sometime.\u003c/p\u003e\n\u003cp\u003eThat’s fine, but I ain’t stayin in Longview. I mean, it’s a nice place and everything, but Maury and me, we got somewhere else to be.\u003c/p\u003e\n\u003cp\u003eHe girds himself, taking the news like a man.\u003c/p\u003e\n\u003cp\u003eI won’t forget you, he says.\u003c/p\u003e\n\u003cp\u003eYeah, okay.\u003c/p\u003e\n\u003cp\u003eHe kisses her, and it feels strange, like kissing a child on the lips. His mouth fails to connect to hers the way it should, and when he pulls away she has to wipe the spit off her lower lip. She thinks of James Grierson. His kisses tasted like whiskey, and they landed right and true.\u003c/p\u003e\n\u003cp\u003eShe says goodbye to Dirk and leads Maury back to the train, where she finds Lee waiting for her.\u003c/p\u003e\n\u003cp\u003eWhere you been? he asks.\u003c/p\u003e\n\u003cp\u003eI been on a date.\u003c/p\u003e\n\u003cp\u003eA date? He begins to laugh heartily. So the warrior princess of the wastes inspires a young man’s fancy.\u003c/p\u003e\n\u003cp\u003eIt ain’t funny.\u003c/p\u003e\n\u003cp\u003eBut it is funny, and she laughs along with him, the two holding their bellies and rioting against the dying daylight.\u003c/p\u003e\n\u003cp\u003eWILSON INTRODUCES Temple to a man named Joe, who, on Wilson’s word, agrees to loan Temple a car as long as she returns it on her way back north. He tells her Point Comfort is south of Houston a little ways, about a day’s drive depending on the roads. He gives her directions, unfolding a big map on a table and tracing the route with his finger. She pays close attention to the numbers of the freeways. The 259 to Nacogdoches, where she’ll pick up the 59, and that’ll take her almost all the way there. In a place called Edna, she’ll take the 111 to the 1593.\u003c/p\u003e\n\u003cp\u003eAren’t you going to write any of this down? Joe asks.\u003c/p\u003e\n\u003cp\u003eIt’s okay. I got a good memory. 259, 59, 111, 1593.\u003c/p\u003e\n\u003cp\u003eWell, here, take the map at least.\u003c/p\u003e\n\u003cp\u003eHe traces the route with a yellow marker and folds the map into a neat rectangle and gives it to her along with some sandwiches made by the woman who operates the diner and some clothes gathered up by the town’s welcoming committee.\u003c/p\u003e\n\u003cp\u003eLater that night, Lee finds her sitting on a sidewalk bench near one of the barricades where two men sit in lawnchairs with big floodlights illuminating some meager distance of the night.\u003c/p\u003e\n\u003cp\u003eHe sits down next to her.\u003c/p\u003e\n\u003cp\u003eWhen’re you headin out? he says.\u003c/p\u003e\n\u003cp\u003eIn the morning. Joe says if the roads are good I could be there by nightfall.\u003c/p\u003e\n\u003cp\u003eUh-huh. And these people you’re taking Maury to, what if they’re not there?\u003c/p\u003e\n\u003cp\u003eI don’t know. I reckon I’ll bring him back here or take him to Dallas. Plenty of people’ll take him in.\u003c/p\u003e\n\u003cp\u003eThen what?\u003c/p\u003e\n\u003cp\u003eShe shrugs.\u003c/p\u003e\n\u003cp\u003eI figure I’ll look around a little. See some things.\u003c/p\u003e\n\u003cp\u003eListen, he says, turning to her. I suppose you won’t let me come down south with you?\u003c/p\u003e\n\u003cp\u003eYou suppose correctly.\u003c/p\u003e\n\u003cp\u003eHow come?\u003c/p\u003e\n\u003cp\u003eYou die, and that’s one more thing I gotta carry around with me.\u003c/p\u003e\n\u003cp\u003eTemple, I’ve been livin off the land for years. I ain’t gonna die. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-reapers-are-the-angels-reapers-1/page-30.html","bookId":2516,"creation":"Oct 5, 2019 11:20:50 PM","modification":"Oct 5, 2019 11:20:50 PM"}
