{"id":107324,"no":10,"title":"Page 10","content":"\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eLangdon held his breath as the X-33 spiraled into Rome\u0027s Leonardo da Vinci International Airport. Vittoria sat across from him, eyes closed as if trying to will the situation into control. The craft touched down and taxied to a private hangar.\u003c/p\u003e\n\u003cp\u003e\"Sorry for the slow flight,\" the pilot apologized, emerging from the cockpit. \"Had to trim her back. Noise regulations over populated areas.\"\u003c/p\u003e\n\u003cp\u003eLangdon checked his watch. They had been airborne thirty-seven minutes.\u003c/p\u003e\n\u003cp\u003eThe pilot popped the outer door. \"Anybody want to tell me what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003eNeither Vittoria nor Langdon responded.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" he said, stretching. \"I\u0027ll be in the cockpit with the air-conditioning and my music. Just me and Garth.\"\u003c/p\u003e\n\u003cp\u003eThe late-afternoon sun blazed outside the hangar. Langdon carried his tweed jacket over his shoulder. Vittoria turned her face skyward and inhaled deeply, as if the sun\u0027s rays somehow transferred to her some mystical replenishing energy.\u003c/p\u003e\n\u003cp\u003eMediterraneans, Langdon mused, already sweating.\u003c/p\u003e\n\u003cp\u003e\"Little old for cartoons, aren\u0027t you?\" Vittoria asked, without opening her eyes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry?\"\u003c/p\u003e\n\u003cp\u003e\"Your wristwatch. I saw it on the plane.\"\u003c/p\u003e\n\u003cp\u003eLangdon flushed slightly. He was accustomed to having to defend his timepiece. The collector\u0027s edition Mickey Mouse watch had been a childhood gift from his parents. Despite the contorted foolishness of Mickey\u0027s outstretched arms designating the hour, it was the only watch Langdon had ever worn. Waterproof and glow-in-the-dark, it was perfect for swimming laps or walking unlit college paths at night. When Langdon\u0027s students questioned his fashion sense, he told them he wore Mickey as a daily reminder to stay young at heart.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s six o\u0027clock,\" he said.\u003c/p\u003e\n\u003cp\u003eVittoria nodded, eyes still closed. \"I think our ride\u0027s here.\"\u003c/p\u003e\n\u003cp\u003eLangdon heard the distant whine, looked up, and felt a sinking feeling. Approaching from the north was a helicopter, slicing low across the runway. Langdon had been on a helicopter once in the Andean Palpa Valley looking at the Nazca sand drawings and had not enjoyed it one bit. A flying shoebox. After a morning of space plane rides, Langdon had hoped the Vatican would send a car.\u003c/p\u003e\n\u003cp\u003eApparently not.\u003c/p\u003e\n\u003cp\u003eThe chopper slowed overhead, hovered a moment, and dropped toward the runway in front of them. The craft was white and carried a coat of arms emblazoned on the side - two skeleton keys crossing a shield and papal crown. He knew the symbol well. It was the traditional seal of the Vatican - the sacred symbol of the Holy See or \"holy seat\" of government, the seat being literally the ancient throne of St. Peter.\u003c/p\u003e\n\u003cp\u003eThe Holy Chopper, Langdon groaned, watching the craft land. He\u0027d forgotten the Vatican owned one of these things, used for transporting the Pope to the airport, to meetings, or to his summer palace in Gandolfo. Langdon definitely would have preferred a car.\u003c/p\u003e\n\u003cp\u003eThe pilot jumped from the cockpit and strode toward them across the tarmac.\u003c/p\u003e\n\u003cp\u003eNow it was Vittoria who looked uneasy. \"That\u0027s our pilot?\"\u003c/p\u003e\n\u003cp\u003eLangdon shared her concern. \"To fly, or not to fly. That is the question.\"\u003c/p\u003e\n\u003cp\u003eThe pilot looked like he was festooned for a Shakespearean melodrama. His puffy tunic was vertically striped in brilliant blue and gold. He wore matching pantaloons and spats. On his feet were black flats that looked like slippers. On top of it all, he wore a black felt beret.\u003c/p\u003e\n\u003cp\u003e\"Traditional Swiss Guard uniforms,\" Langdon explained. \"Designed by Michelangelo himself.\" As the man drew closer, Langdon winced. \"I admit, not one of Michelangelo\u0027s better efforts.\"\u003c/p\u003e\n\u003cp\u003eDespite the man\u0027s garish attire, Langdon could tell the pilot meant business. He moved toward them with all the rigidity and dignity of a U.S. Marine. Langdon had read many times about the rigorous requirements for becoming one of the elite Swiss Guard. Recruited from one of Switzerland\u0027s four Catholic cantons, applicants had to be Swiss males between nineteen and thirty years old, at least 5 feet 6 inches, trained by the Swiss Army, and unmarried. This imperial corps was envied by world governments as the most allegiant and deadly security force in the world.\u003c/p\u003e\n\u003cp\u003e\"You are from CERN?\" the guard asked, arriving before them. His voice was steely.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir,\" Langdon replied.\u003c/p\u003e\n\u003cp\u003e\"You made remarkable time,\" he said, giving the X-33 a mystified stare. He turned to Vittoria. \"Ma\u0027am, do you have any other clothing?\"\u003c/p\u003e\n\u003cp\u003e\"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003eHe motioned to her legs. \"Short pants are not permitted inside Vatican City.\"\u003c/p\u003e\n\u003cp\u003eLangdon glanced down at Vittoria\u0027s legs and frowned. He had forgotten. Vatican City had a strict ban on visible legs above the knee - both male and female. The regulation was a way of showing respect for the sanctity of God\u0027s city.\u003c/p\u003e\n\u003cp\u003e\"This is all I have,\" she said. \"We came in a hurry.\"\u003c/p\u003e\n\u003cp\u003eThe guard nodded, clearly displeased. He turned next to Langdon. \"Are you carrying any weapons?\"\u003c/p\u003e\n\u003cp\u003eWeapons? Langdon thought. I\u0027m not even carrying a change of underwear! He shook his head.\u003c/p\u003e\n\u003cp\u003eThe officer crouched at Langdon\u0027s feet and began patting him down, starting at his socks. Trusting guy, Langdon thought. The guard\u0027s strong hands moved up Langdon\u0027s legs, coming uncomfortably close to his groin. Finally they moved up to his chest and shoulders. Apparently content Langdon was clean, the guard turned to Vittoria. He ran his eyes up her legs and torso.\u003c/p\u003e\n\u003cp\u003eVittoria glared. \"Don\u0027t even think about it.\"\u003c/p\u003e\n\u003cp\u003eThe guard fixed Vittoria with a gaze clearly intended to intimidate. Vittoria did not flinch.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" the guard said, pointing to a faint square bulge in the front pocket of her shorts.\u003c/p\u003e\n\u003cp\u003eVittoria removed an ultrathin cell phone. The guard took it, clicked it on, waited for a dial tone, and then, apparently satisfied that it was indeed nothing more than a phone, returned it to her. Vittoria slid it back into her pocket.\u003c/p\u003e\n\u003cp\u003e\"Turn around, please,\" the guard said.\u003c/p\u003e\n\u003cp\u003eVittoria obliged, holding her arms out and rotating a full 360 degrees.\u003c/p\u003e\n\u003cp\u003eThe guard carefully studied her. Langdon had already decided that Vittoria\u0027s form-fitting shorts and blouse were not bulging anywhere they shouldn\u0027t have been. Apparently the guard came to the same conclusion.\u003c/p\u003e\n\u003cp\u003e\"Thank you. This way please.\"\u003c/p\u003e\n\u003cp\u003eThe Swiss Guard chopper churned in neutral as Langdon and Vittoria approached. Vittoria boarded first, like a seasoned pro, barely even stooping as she passed beneath the whirling rotors. Langdon held back a moment.\u003c/p\u003e\n\u003cp\u003e\"No chance of a car?\" he yelled, half-joking to the Swiss Guard, who was climbing in the pilot\u0027s seat.\u003c/p\u003e\n\u003cp\u003eThe man did not answer.\u003c/p\u003e\n\u003cp\u003eLangdon knew that with Rome\u0027s maniacal drivers, flying was probably safer anyway. He took a deep breath and boarded, stooping cautiously as he passed beneath the spinning rotors.\u003c/p\u003e\n\u003cp\u003eAs the guard fired up the engines, Vittoria called out, \"Have you located the canister?\"\u003c/p\u003e\n\u003cp\u003eThe guard glanced over his shoulder, looking confused. \"The what?\"\u003c/p\u003e\n\u003cp\u003e\"The canister. You called CERN about a canister?\"\u003c/p\u003e\n\u003cp\u003eThe man shrugged. \"No idea what you\u0027re talking about. We\u0027ve been very busy today. My commander told me to pick you up. That\u0027s all I know.\"\u003c/p\u003e\n\u003cp\u003eVittoria gave Langdon an unsettled look.\u003c/p\u003e\n\u003cp\u003e\"Buckle up, please,\" the pilot said as the engine revved.\u003c/p\u003e\n\u003cp\u003eLangdon reached for his seat belt and strapped himself in. The tiny fuselage seemed to shrink around him. Then with a roar, the craft shot up and banked sharply north toward Rome.\u003c/p\u003e\n\u003cp\u003eRome... the caput mundi, where Caesar once ruled, where St. Peter was crucified. The cradle of modern civilization. And at its core... a ticking bomb.\u003c/p\u003e\n\u003cp\u003e33\u003c/p\u003e\n\u003cp\u003eRome from the air is a labyrinth - an indecipherable maze of ancient roadways winding around buildings, fountains, and crumbling ruins.\u003c/p\u003e\n\u003cp\u003eThe Vatican chopper stayed low in the sky as it sliced northwest through the permanent smog layer coughed up by the congestion below. Langdon gazed down at the mopeds, sight-seeing buses, and armies of miniature Fiat sedans buzzing around rotaries in all directions. Koyaanisqatsi, he thought, recalling the Hopi term for \"life out of balance.\"\u003c/p\u003e\n\u003cp\u003eVittoria sat in silent determination in the seat beside him.\u003c/p\u003e\n\u003cp\u003eThe chopper banked hard.\u003c/p\u003e\n\u003cp\u003eHis stomach dropping, Langdon gazed farther into the distance. His eyes found the crumbling ruins of the Roman Coliseum. The Coliseum, Langdon had always thought, was one of history\u0027s greatest ironies. Now a dignified symbol for the rise of human culture and civilization, the stadium had been built to host centuries of barbaric events - hungry lions shredding prisoners, armies of slaves battling to the death, gang rapes of exotic women captured from far-off lands, as well as public beheadings and castrations. It was ironic, Langdon thought, or perhaps fitting, that the Coliseum had served as the architectural blueprint for Harvard\u0027s Soldier Field - the football stadium where the ancient traditions of savagery were reenacted every fall... crazed fans screaming for bloodshed as Harvard battled Yale.\u003c/p\u003e\n\u003cp\u003eAs the chopper headed north, Langdon spied the Roman Forum - the heart of pre-Christian Rome. The decaying columns looked like toppled gravestones in a cemetery that had somehow avoided being swallowed by the metropolis surrounding it.\u003c/p\u003e\n\u003cp\u003eTo the west the wide basin of the Tiber River wound enormous arcs across the city. Even from the air Langdon could tell the water was deep. The churning currents were brown, filled with silt and foam from heavy rains.\u003c/p\u003e\n\u003cp\u003e\"Straight ahead,\" the pilot said, climbing higher.\u003c/p\u003e\n\u003cp\u003eLangdon and Vittoria looked out and saw it. Like a mountain parting the morning fog, the colossal dome rose out of the haze before them: St. Peter\u0027s Basilica.\u003c/p\u003e\n\u003cp\u003e\"Now that,\" Langdon said to Vittoria, \"is something Michelangelo got right.\"\u003c/p\u003e\n\u003cp\u003eLangdon had never seen St. Peter\u0027s from the air. The marble fa\u0026amp;ccedil;ade blazed like fire in the afternoon sun. Adorned with 140 statues of saints, martyrs, and angels, the Herculean edifice stretched two football fields wide and a staggering six long. The cavernous interior of the basilica had room for over 60,000 worshipers... over one hundred times the population of Vatican City, the smallest country in the world.\u003c/p\u003e\n\u003cp\u003eIncredibly, though, not even a citadel of this magnitude could dwarf the piazza before it. A sprawling expanse of granite, St. Peter\u0027s Square was a staggering open space in the congestion of Rome, like a classical Central Park. In front of the basilica, bordering the vast oval common, 284 columns swept outward in four concentric arcs of diminishing size... an architectural trompe de l\u0027oiel used to heighten the piazza\u0027s sense of grandeur.\u003c/p\u003e\n\u003cp\u003eAs he stared at the magnificent shrine before him, Langdon wondered what St. Peter would think if he were here now. The Saint had died a gruesome death, crucified upside down on this very spot. Now he rested in the most sacred of tombs, buried five stories down, directly beneath the central cupola of the basilica.\u003c/p\u003e\n\u003cp\u003e\"Vatican City,\" the pilot said, sounding anything but welcoming.\u003c/p\u003e\n\u003cp\u003eLangdon looked out at the towering stone bastions that loomed ahead - impenetrable fortifications surrounding the complex... a strangely earthly defense for a spiritual world of secrets, power, and mystery.\u003c/p\u003e\n\u003cp\u003e\"Look!\" Vittoria said suddenly, grabbing Langdon\u0027s arm. She motioned frantically downward toward St. Peter\u0027s Square directly beneath them. Langdon put his face to the window and looked.\u003c/p\u003e\n\u003cp\u003e\"Over there,\" she said, pointing.\u003c/p\u003e\n\u003cp\u003eLangdon looked. The rear of the piazza looked like a parking lot crowded with a dozen or so trailer trucks. Huge satellite dishes pointed skyward from the roof of every truck. The dishes were emblazoned with familiar names:\u003c/p\u003e\n\u003cp\u003eTelevisor Europea\u003c/p\u003e\n\u003cp\u003eVideo Italia\u003c/p\u003e\n\u003cp\u003eBBC\u003c/p\u003e\n\u003cp\u003eUnited Press International\u003c/p\u003e\n\u003cp\u003eLangdon felt suddenly confused, wondering if the news of the antimatter had already leaked out.\u003c/p\u003e\n\u003cp\u003eVittoria seemed suddenly tense. \"Why is the press here? What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003eThe pilot turned and gave her an odd look over his shoulder. \"What\u0027s going on? You don\u0027t know?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she fired back, her accent husky and strong.\u003c/p\u003e\n\u003cp\u003e\"Il Conclavo,\" he said. \"It is to be sealed in about an hour. The whole world is watching.\"\u003c/p\u003e\n\u003cp\u003eIl Conclavo.\u003c/p\u003e\n\u003cp\u003eThe word rang a long moment in Langdon\u0027s ears before dropping like a brick to the pit of his stomach. Il Conclavo. The Vatican Conclave. How could he have forgotten? It had been in the news recently.\u003c/p\u003e\n\u003cp\u003eFifteen days ago, the Pope, after a tremendously popular twelve-year reign, had passed away. Every paper in the world had carried the story about the Pope\u0027s fatal stroke while sleeping - a sudden and unexpected death many whispered was suspicious. But now, in keeping with the sacred tradition, fifteen days after the death of a Pope, the Vatican was holding Il Conclavo - the sacred ceremony in which the 165 cardinals of the world - the most powerful men in Christendom - gathered in Vatican City to elect the new Pope.\u003c/p\u003e\n\u003cp\u003eEvery cardinal on the planet is here today, Langdon thought as the chopper passed over St. Peter\u0027s Basilica. The expansive inner world of Vatican City spread out beneath him. The entire power structure of the Roman Catholic Church is sitting on a time bomb.\u003c/p\u003e\n\u003cp\u003e34\u003c/p\u003e\n\u003cp\u003eCardinal Mortati gazed up at the lavish ceiling of the Sistine Chapel and tried to find a moment of quiet reflection. The frescoed walls echoed with the voices of cardinals from nations around the globe. The men jostled in the candlelit tabernacle, whispering excitedly and consulting with one another in numerous languages, the universal tongues being English, Italian, and Spanish.\u003c/p\u003e\n\u003cp\u003eThe light in the chapel was usually sublime - long rays of tinted sun slicing through the darkness like rays from heaven - but not today. As was the custom, all of the chapel\u0027s windows had been covered in black velvet in the name of secrecy. This ensured that no one on the inside could send signals or communicate in any way with the outside world. The result was a profound darkness lit only by candles... a shimmering radiance that seemed to purify everyone it touched, making them all ghostly... like saints.\u003c/p\u003e\n\u003cp\u003eWhat privilege, Mortati thought, that I am to oversee this sanctified event. Cardinals over eighty years of age were too old to be eligible for election and did not attend conclave, but at seventy-nine years old, Mortati was the most senior cardinal here and had been appointed to oversee the proceedings.\u003c/p\u003e\n\u003cp\u003eFollowing tradition, the cardinals gathered here two hours before conclave to catch up with friends and engage in last-minute discussion. At 7 P.M., the late Pope\u0027s chamberlain would arrive, give opening prayer, and then leave. Then the Swiss Guard would seal the doors and lock all the cardinals inside. It was then that the oldest and most secretive political ritual in the world would begin. The cardinals would not be released until they decided who among them would be the next Pope.\u003c/p\u003e\n\u003cp\u003eConclave. Even the name was secretive. \"Con clave\" literally meant \"locked with a key.\" The cardinals were permitted no contact whatsoever with the outside world. No phone calls. No messages. No whispers through doorways. Conclave was a vacuum, not to be influenced by anything in the outside world. This would ensure that the cardinals kept Solum Dum prae oculis... only God before their eyes.\u003c/p\u003e\n\u003cp\u003eOutside the walls of the chapel, of course, the media watched and waited, speculating as to which of the cardinals would become the ruler of one billion Catholics worldwide. Conclaves created an intense, politically charged atmosphere, and over the centuries they had turned deadly: poisonings, fist fights, and even murder had erupted within the sacred walls. Ancient history, Mortati thought. Tonight\u0027s conclave will be unified, blissful, and above all... brief.\u003c/p\u003e\n\u003cp\u003eOr at least that had been his speculation.\u003c/p\u003e\n\u003cp\u003eNow, however, an unexpected development had emerged. Mystifyingly, four cardinals were absent from the chapel. Mortati knew that all the exits to Vatican City were guarded, and the missing cardinals could not have gone far, but still, with less than an hour before opening prayer, he was feeling disconcerted. After all, the four missing men were no ordinary cardinals. They were the cardinals.\u003c/p\u003e\n\u003cp\u003eThe chosen four.\u003c/p\u003e\n\u003cp\u003eAs overseer of the conclave, Mortati had already sent word through the proper channels to the Swiss Guard alerting them to the cardinals\u0027 absence. He had yet to hear back. Other cardinals had now noticed the puzzling absence. The anxious whispers had begun. Of all cardinals, these four should be on time! Cardinal Mortati was starting to fear it might be a long evening after all.\u003c/p\u003e\n\u003cp\u003eHe had no idea.\u003c/p\u003e\n\u003cp\u003e35\u003c/p\u003e\n\u003cp\u003eThe Vatican\u0027s helipad, for reasons of safety and noise control, is located in the northwest tip of Vatican City, as far from St. Peter\u0027s Basilica as possible.\u003c/p\u003e\n\u003cp\u003e\"Terra firma,\" the pilot announced as they touched down. He exited and opened the sliding door for Langdon and Vittoria.\u003c/p\u003e\n\u003cp\u003eLangdon descended from the craft and turned to help Vittoria, but she had already dropped effortlessly to the ground. Every muscle in her body seemed tuned to one objective - finding the antimatter before it left a horrific legacy.\u003c/p\u003e\n\u003cp\u003eAfter stretching a reflective sun tarp across the cockpit window, the pilot ushered them to an oversized electric golf cart waiting near the helipad. The cart whisked them silently alongside the country\u0027s western border - a fifty-foot-tall cement bulwark thick enough to ward off attacks even by tanks. Lining the interior of the wall, posted at fifty-meter intervals, Swiss Guards stood at attention, surveying the interior of the grounds. The cart turned sharply right onto Via della Osservatorio. Signs pointed in all directions:\u003c/p\u003e\n\u003cp\u003ePalazzio Governatorio\u003c/p\u003e\n\u003cp\u003eCollegio Ethiopiana\u003c/p\u003e\n\u003cp\u003eBasilica San Pietro\u003c/p\u003e\n\u003cp\u003eCapella Sistina\u003c/p\u003e\n\u003cp\u003eThey accelerated up the manicured road past a squat building marked Radio Vaticana. This, Langdon realized to his amazement, was the hub of the world\u0027s most listened-to radio programming - Radio Vaticana - spreading the word of God to millions of listeners around the globe.\u003c/p\u003e\n\u003cp\u003e\"Attenzione,\" the pilot said, turning sharply into a rotary.\u003c/p\u003e\n\u003cp\u003eAs the cart wound round, Langdon could barely believe the sight now coming into view. Giardini Vaticani, he thought. The heart of Vatican City. Directly ahead rose the rear of St. Peter\u0027s Basilica, a view, Langdon realized, most people never saw. To the right loomed the Palace of the Tribunal, the lush papal residence rivaled only by Versailles in its baroque embellishment. The severe-looking Governatorato building was now behind them, housing Vatican City\u0027s administration. And up ahead on the left, the massive rectangular edifice of the Vatican Museum. Langdon knew there would be no time for a museum visit this trip.\u003c/p\u003e\n\u003cp\u003e\"Where is everyone?\" Vittoria asked, surveying the deserted lawns and walkways.\u003c/p\u003e\n\u003cp\u003eThe guard checked his black, military-style chronograph - an odd anachronism beneath his puffy sleeve. \"The cardinals are convened in the Sistine Chapel. Conclave begins in a little under an hour.\"\u003c/p\u003e\n\u003cp\u003eLangdon nodded, vaguely recalling that before conclave the cardinals spent two hours inside the Sistine Chapel in quiet reflection and visitations with their fellow cardinals from around the globe. The time was meant to renew old friendships among the cardinals and facilitate a less heated election process. \"And the rest of the residents and staff?\"\u003c/p\u003e\n\u003cp\u003e\"Banned from the city for secrecy and security until the conclave concludes.\"\u003c/p\u003e\n\u003cp\u003e\"And when does it conclude?\"\u003c/p\u003e\n\u003cp\u003eThe guard shrugged. \"God only knows.\" The words sounded oddly literal.\u003c/p\u003e\n\u003cp\u003eAfter parking the cart on the wide lawn directly behind St. Peter\u0027s Basilica, the guard escorted Langdon and Vittoria up a stone escarpment to a marble plaza off the back of the basilica. Crossing the plaza, they approached the rear wall of the basilica and followed it through a triangular courtyard, across Via Belvedere, and into a series of buildings closely huddled together. Langdon\u0027s art history had taught him enough Italian to pick out signs for the Vatican Printing Office, the Tapestry Restoration Lab, Post Office Management, and the Church of St. Ann. They crossed another small square and arrived at their destination.\u003c/p\u003e\n\u003cp\u003eThe Office of the Swiss Guard is housed adjacent to Il Corpo di Vigilanza, directly northeast of St. Peter\u0027s Basilica. The office is a squat, stone building. On either side of the entrance, like two stone statues, stood a pair of guards.\u003c/p\u003e\n\u003cp\u003eLangdon had to admit, these guards did not look quite so comical. Although they also wore the blue and gold uniform, each wielded the traditional \"Vatican long sword\" - an eight-foot spear with a razor-sharp scythe - rumored to have decapitated countless Muslims while defending the Christian crusaders in the fifteenth century.\u003c/p\u003e\n\u003cp\u003eAs Langdon and Vittoria approached, the two guards stepped forward, crossing their long swords, blocking the entrance. One looked up at the pilot in confusion. \"I pantaloni,\" he said, motioning to Vittoria\u0027s shorts.\u003c/p\u003e\n\u003cp\u003eThe pilot waved them off. \"Il comandante vuole vederli subito.\"\u003c/p\u003e\n\u003cp\u003eThe guards frowned. Reluctantly they stepped aside.\u003c/p\u003e\n\u003cp\u003eInside, the air was cool. It looked nothing like the administrative security offices Langdon would have imagined. Ornate and impeccably furnished, the hallways contained paintings Langdon was certain any museum worldwide would gladly have featured in its main gallery.\u003c/p\u003e\n\u003cp\u003eThe pilot pointed down a steep set of stairs. \"Down, please.\"\u003c/p\u003e\n\u003cp\u003eLangdon and Vittoria followed the white marble treads as they descended between a gauntlet of nude male sculptures. Each statue wore a fig leaf that was lighter in color than the rest of the body.\u003c/p\u003e\n\u003cp\u003eThe Great Castration, Langdon thought.\u003c/p\u003e\n\u003cp\u003eIt was one of the most horrific tragedies in Renaissance art. In 1857, Pope Pius IX decided that the accurate representation of the male form might incite lust inside the Vatican. So he got a chisel and mallet and hacked off the genitalia of every single male statue inside Vatican City. He defaced works by Michelangelo, Bramante, and Bernini. Plaster fig leaves were used to patch the damage. Hundreds of sculptures had been emasculated. Langdon had often wondered if there was a huge crate of stone penises someplace.\u003c/p\u003e\n\u003cp\u003e\"Here,\" the guard announced.\u003c/p\u003e\n\u003cp\u003eThey reached the bottom of the stairs and dead-ended at a heavy, steel door. The guard typed an entry code, and the door slid open. Langdon and Vittoria entered.\u003c/p\u003e\n\u003cp\u003eBeyond the threshold was absolute mayhem. \u003c/p\u003e","sourceLink":"https://allnovel.net/angels-demons-robert-langdon-1/page-10.html","bookId":2228,"creation":"Oct 5, 2019 11:07:23 PM","modification":"Oct 5, 2019 11:07:23 PM"}
