{"id":88528,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSorrow met her eyes with a mischievous twinkle. “Don’t you mean woman the tables, Dad?”\u003c/p\u003e\n\u003cp\u003e“I don’t care who does it. All I know is Helen’s not here yet.”\u003c/p\u003e\n\u003cp\u003e“Helen needs to step up,” Laura said at once. Their waitress fought her on everything, and while she didn’t need her employees to bow at her feet, Helen’s attitude verged on downright disrespectful. “We pay her good money. If she’s not going to work for it, then we should find someone who will.”\u003c/p\u003e\n\u003cp\u003e“I know you’re not exactly friends,” Sorrow began.\u003c/p\u003e\n\u003cp\u003e“Not friends? Not hardly. Does she even have any friends?”\u003c/p\u003e\n\u003cp\u003e“We can’t just fire her,” Sorrow said. “She’s got kids.”\u003c/p\u003e\n\u003cp\u003eBear shrugged. “Your mother won’t hear of it anyhow.”\u003c/p\u003e\n\u003cp\u003e“Well, she needs to at least attempt to be on time.”\u003c/p\u003e\n\u003cp\u003e“I’ll talk to her,” Sorrow said. “Try to give her a break. I feel bad for the woman. Her husband’s never around.”\u003c/p\u003e\n\u003cp\u003eLaura did a mental scan. “She’s married to that Rob guy, from the hardware store, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Dad nodded. “Real piece of work, that one.”\u003c/p\u003e\n\u003cp\u003eWomen too hung up on their men…as far as Laura was concerned, everyone should take a page from her book and swear off the male sex completely. “Not my problem.” She went to put her coffee cup in the sink. “All I know is, business is up, and we’re relying on her more than ever.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Sorrow exclaimed, and her knife froze midchop, “what’s up with hiring another person? Dad, didn’t you say we could get some more help around here?”\u003c/p\u003e\n\u003cp\u003e“Did I?” he asked, looking a little like a trapped animal.\u003c/p\u003e\n\u003cp\u003eSorrow smiled. “Oh, you did. You told Billy, remember? How we could get someone to help with the cleaning and front desk stuff.”\u003c/p\u003e\n\u003cp\u003e“Seriously? Hired help?” Laura perked up, joining her sister. “That’d be awesome. I totally need help managing reservations.”\u003c/p\u003e\n\u003cp\u003e“I don’t know about any hiring.” Their father looked panicked. “Don’t be getting ahead of yourselves.”\u003c/p\u003e\n\u003cp\u003eShe’d been momentarily light-headed with excitement, and then her mood dipped lower than ever. “Doesn’t matter, anyway. We won’t even be able to afford Helen once we go under.”\u003c/p\u003e\n\u003cp\u003eDad swung to face her. “What kind of nonsense are you talking, girl?”\u003c/p\u003e\n\u003cp\u003e“Have you heard about Eddie’s construction project?”\u003c/p\u003e\n\u003cp\u003e“Sure.” He shrugged. “You mean that rundown ranch what’s on the old logging creek?”\u003c/p\u003e\n\u003cp\u003e“That’s the one.”\u003c/p\u003e\n\u003cp\u003eHe waved it off. “Yeah, Jessup told me about it. He says sprucing it up could be good for the town. Damned if those dot-commers ever did anything with the place. Fat waste that was. Good people could’ve been living there all this time.”\u003c/p\u003e\n\u003cp\u003e“Nobody is going to live there,” Laura said. “His project is to turn it into a hotel.”\u003c/p\u003e\n\u003cp\u003e“What of it?”\u003c/p\u003e\n\u003cp\u003e“What of it?” She looked to her sister for support.\u003c/p\u003e\n\u003cp\u003eSorrow took over in more even tones, telling him, “Laura’s worried because of who the developer is. Fairview Properties isn’t exactly small potatoes. They’ve got plans to turn the ranch into a resort.”\u003c/p\u003e\n\u003cp\u003e“But they mostly run those little hippie places, where they charge rich people an arm and a leg to eat nuts and berries, that sort of thing.”\u003c/p\u003e\n\u003cp\u003e“They run world-class resorts,” she protested. “They’ll be touting this as a world-class resort.”\u003c/p\u003e\n\u003cp\u003eBear looked back and forth between the two of them, clearly not getting it. “That little place?”\u003c/p\u003e\n\u003cp\u003e“They’re building up that little place,” Laura said. “They’re turning it into a spa thing, like Forever Sleepy Resort or something ridiculous like that. Whatever. What I do know is that once they finish, it’ll be just a matter of time before they put us out of business.”\u003c/p\u003e\n\u003cp\u003eTheir dad thought on that for a moment but finally brushed it off. “I don’t care how big they are, that old ranch is small potatoes, and small potatoes ain’t gonna bring us down. Not with Sorrow in the kitchen now.” He gave his youngest a wink.\u003c/p\u003e\n\u003cp\u003e“How times change,” Sorrow murmured with a smirk. Just a year ago, Sully had been in charge of the food, and it was meat loafs and meat pies all around.\u003c/p\u003e\n\u003cp\u003e“Well, some things don’t change,” Bear asserted. “I’ve seen that old rancher go from hand to hand since I was a kid. Trust me. Nobody’s gonna bend over backward to stay there.”\u003c/p\u003e\n\u003cp\u003eThe girls’ eyes met. There was no convincing Dad when he didn’t want to be convinced. At least her sister would be able to enjoy several months of cooking before they went under.\u003c/p\u003e\n\u003cp\u003e“It’ll be okay,” Sorrow mouthed to her as she went to the sink to fill the pot with water.\u003c/p\u003e\n\u003cp\u003eBear followed and peered over her shoulder. “What the heck are you making?” Suspicion was thick in his voice.\u003c/p\u003e\n\u003cp\u003e“She’s just busting out her famous toxic witch’s brew,” Laura deadpanned.\u003c/p\u003e\n\u003cp\u003e“Jeez, Dad, it’s soup.” Sorrow gave a swirl to the water with her spoon.\u003c/p\u003e\n\u003cp\u003e“Looks watery.”\u003c/p\u003e\n\u003cp\u003e“This is how it’s done,” she said matter-of-factly.\u003c/p\u003e\n\u003cp\u003eHe peered closer, picking up a particularly long leaf. “What the heck is this?”\u003c/p\u003e\n\u003cp\u003e“A leek.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a plumbing problem, not a vegetable.”\u003c/p\u003e\n\u003cp\u003e“That’s it.” Sorrow spun and waggled her fingers at him. “Shoo! Out of my kitchen.”\u003c/p\u003e\n\u003cp\u003e“Come on, Dad.” Laura put her arm through his. “I hear zombie hordes might be coming to the tavern today.”\u003c/p\u003e\n\u003cp\u003e“What on earth?” her father exclaimed as she ushered him into the dining room. “Zombie-whats? What are you talking about?”\u003c/p\u003e\n\u003cp\u003eBut she barely heard him. All she registered was the sight of Eddie, folding his long, strong body into a booth. “Apocalypse,” he said in his deep voice. “Sounds bad. Should I go get my gun?”\u003c/p\u003e\n\u003cp\u003eShe stopped short, glaring. “Eddie.”\u003c/p\u003e\n\u003cp\u003e“In the flesh, tiger.” He gave her a slow smile. “Just in time, too. You’ll need somebody around to help propagate the species.”\u003c/p\u003e\n\u003cp\u003eNine\u003c/p\u003e\n\u003cp\u003eBear looked his way. “We were just talking about you.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Laura said in a flat voice. “Speak of the devil.” The way it came out, one would have thought he was actual evil-spawn.\u003c/p\u003e\n\u003cp\u003eEddie touched a hand to his forehead. “What? Are my horns showing?”\u003c/p\u003e\n\u003cp\u003eShe bustled by without sparing him another glance, headed behind the bar. “Shouldn’t you be at your job site? You know, sawing, hammering, crushing the hopes of others, that sort of thing.”\u003c/p\u003e\n\u003cp\u003eBear sauntered over to join him in his the booth. “I got something to ask you.”\u003c/p\u003e\n\u003cp\u003e“Shoot.” He kept the easy smile on his face, but inside he braced. Laura looked ready to snap, and it gave him an inkling of what her father wanted to discuss.\u003c/p\u003e\n\u003cp\u003e“I hear you’re trying to put us out of business.”\u003c/p\u003e\n\u003cp\u003e“No such thing, Bear. I regret your daughter has a problem—”\u003c/p\u003e\n\u003cp\u003e“Problem?” Laura exclaimed.\u003c/p\u003e\n\u003cp\u003eHere it came.\u003c/p\u003e\n\u003cp\u003eHe ignored her to lean forward and talk fast. “With respect, sir, so long as Fairview plays by the rules—and I’ve got a permit in my truck that says they are—then I’ve got a responsibility to grow my business.”\u003c/p\u003e\n\u003cp\u003eBear liked the sir. He gave a gruff nod. “A man’s got to look out for his business.”\u003c/p\u003e\n\u003cp\u003e“I believe this’ll only bring more tourists to Sierra Falls. That rancher can only hold so many guests.” It’d be more guests once they added a second story, but he’d work up to that part. “People coming to visit the spa will need someplace to stay…” He cocked his head in the direction of the lodge, letting Bear do the math. And he honestly believed it, too. A night at the Fairview property would probably run about four times what a night at the lodge cost.\u003c/p\u003e\n\u003cp\u003eSure enough, the man gave him a slow smile as he rose from his seat. “That was my notion exactly. I like how you think.” He went to the bar, pausing to smack a hand on the counter. “Can’t fight progress, girl.”\u003c/p\u003e\n\u003cp\u003eLaura looked unusually deflated. Quietly, she said, “They’ll put us out of business, Dad.”\u003c/p\u003e\n\u003cp\u003e“No prissy health farm is going to put us Baileys out of business. Seems to me you’ve got enough to fret about, so get back to it.” Bear shook his head as he settled onto a far stool, muttering, “Spa Jacuzzi city folk prissiness.”\u003c/p\u003e\n\u003cp\u003eLaura automatically poured her dad a cup of coffee. Eddie had known the man for years, and he knew to let him sip and sit with this latest development for a while before he broke the rest of his news. It took baby steps with Bear Bailey.\u003c/p\u003e\n\u003cp\u003eAnd besides, something else was demanding his attention at the moment. Laura had begun to crash around behind the bar, slamming the coffeemaker open and shut, rattling cups in the bus tray, breaking up the ice in the freezer bin. To someone else, she might’ve looked angry, but Eddie saw something in the way her mouth was drawn. A pinched look to her eyes that made it seem like she was damming back some emotion.\u003c/p\u003e\n\u003cp\u003eHe hated it. Hated to be the bad guy in those eyes.\u003c/p\u003e\n\u003cp\u003eHe popped up from the booth and joined her behind the bar.\u003c/p\u003e\n\u003cp\u003eShe grew utterly still, watching as he poured himself a cup of coffee. “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“I came for coffee, so I’m getting myself some.”\u003c/p\u003e\n\u003cp\u003e“I can see that. You know what I mean.”\u003c/p\u003e\n\u003cp\u003eHe could tell she wanted to tear into him, but how could she fault his helping himself? Their waitress wasn’t in yet, so serving fell to the family. “Just trying to help a pretty lady.”\u003c/p\u003e\n\u003cp\u003e“Then rip up Fairview’s check.”\u003c/p\u003e\n\u003cp\u003eHe topped off Bear’s cup, then walked back around and grabbed a stool at the bar. “Seems our goals are mutually exclusive.” As he leaned his elbows on the counter, he couldn’t help but eye her tight body in that skimpy workout getup. “Although…” \u003c/p\u003e","sourceLink":"https://allnovel.net/timber-creek-sierra-falls-2/page-11.html","bookId":1914,"creation":"Oct 5, 2019 5:29:41 PM","modification":"Oct 5, 2019 5:29:41 PM"}
