{"id":88538,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It doesn’t make it right.”\u003c/p\u003e\n\u003cp\u003e“Whatever you say, gorgeous. Tell everyone to hate me. You can’t stop the work.”\u003c/p\u003e\n\u003cp\u003e“That’s where you’re wrong. You need to call Jack right now and tell him he’d better stop hacking off that roof, because I know something that will stop you once and for all.”\u003c/p\u003e\n\u003cp\u003e“Do you now?” He cracked open his water bottle and chugged, taking a moment to figure how he was going to play it: angry or easy.\u003c/p\u003e\n\u003cp\u003eShe sure hadn’t wasted any time laying into him. But she wore a little denim skirt that’d ridden up as she sat, and as he stole a glance at those long legs, he decided he’d opt for cool. It was the skirt’s fault—it robbed a man’s strength.\u003c/p\u003e\n\u003cp\u003eHe wiped his mouth, calmly telling her, “We’re not hacking off the roof. Those crossbeams are ancient. We’ve got our engineer out today, checking it out. Hotel or not, it’s something that needs to be done. Can’t have the walls caving in before we even start.”\u003c/p\u003e\n\u003cp\u003eThat silenced her for a moment, but he saw by the machinations on her face that she was working up to something else.\u003c/p\u003e\n\u003cp\u003e“El Dorado County voted in a watershed protection bond,” she blurted. “What you’re doing might be illegal. Or, at least, digging for a stupid pool might be.”\u003c/p\u003e\n\u003cp\u003eIt took him a moment to register the topic change. “How do you figure?”\u003c/p\u003e\n\u003cp\u003e“The bond was for ten million dollars,” she continued, gaining steam. “All to protect the watershed. There must be implications for the land surrounding the creek.”\u003c/p\u003e\n\u003cp\u003eHe sighed deeply. This job was turning out to be a nightmare, in more ways than one.\u003c/p\u003e\n\u003cp\u003e“You sure you don’t want any food?” He dug into his backpack and pulled out a bag of chips. “Sea salt and vinegar?” He let his eyes linger over her body—she was a workout fanatic with a tight little body, but it seemed like she’d gotten a little too thin since taking over managing the lodge. “Do you ever eat?”\u003c/p\u003e\n\u003cp\u003eShe just glared, but he’d caught how her cheeks had flushed at his perusal.\u003c/p\u003e\n\u003cp\u003e“No? Your loss.” He popped a chip in his mouth, giving her a wink.\u003c/p\u003e\n\u003cp\u003e“Ten million.” She pressed on, undaunted. She turned away, looking back at the ranch house, and the movement tugged that flimsy yellow top tightly along her curves. “That’s something.”\u003c/p\u003e\n\u003cp\u003e“It is something.” He gave an approving nod—he sure was enjoying this argument. “Something else.” He looked back up at her pretty face before she caught him staring.\u003c/p\u003e\n\u003cp\u003eHe really needed to get this under control. He was a professional, dammit.\u003c/p\u003e\n\u003cp\u003e“Maybe not for Fairview,” she added, “but it’s enough to catch their attention.” She pointed toward the mountains lining the horizon—veins of white still capped the highest elevations, the snowmelt providing water for much of Northern California. “You know as well as I do how that snow melts and fills this creek and trickles down until it eventually becomes the drinking water for all of Sacramento. If people felt strongly enough to vote in favor of a ten-million-dollar bond measure—”\u003c/p\u003e\n\u003cp\u003e“So you’ve said,” he interjected, wondering just how many times the woman could say ten million in a conversation. He wanted to end this chat and get onto more interesting things…like dessert.\u003c/p\u003e\n\u003cp\u003e“Then they’ll probably have something to say about all that’s going on in this valley,” she finished sternly.\u003c/p\u003e\n\u003cp\u003eHe brushed the chip crumbs off his hands and shoved the trash back into his pack. “Okay, I’ll look into it.”\u003c/p\u003e\n\u003cp\u003e“I…you, what?”\u003c/p\u003e\n\u003cp\u003eThe wind had mussed her hair, and a strand had stuck to her mouth, all glossy and girly and pale pink. It took everything he had not to reach out and sweep the hair from her face. He’d bet his new truck that her panties matched the bra and lip gloss.\u003c/p\u003e\n\u003cp\u003e“What do you know about bonds?” she asked again.\u003c/p\u003e\n\u003cp\u003eHe cleared his throat, forcing his eyes back up to meet hers. “I don’t know jack about bonds. But there was one construction project a while back—remember when they had to change the gas station site because of flood potential?—there was talk of watershed back then, too.”\u003c/p\u003e\n\u003cp\u003e“You’ll look into it?”\u003c/p\u003e\n\u003cp\u003e“If I say I will, I will.” Of course he’d look into it—he wanted to do the right thing. He hated being the bad guy in her eyes.\u003c/p\u003e\n\u003cp\u003eIf he could ditch this whole damned job just to make her happy, he would, but it wasn’t just his business at stake—it was Jack’s, and he owed Jack everything.\u003c/p\u003e\n\u003cp\u003eHe wanted to get the woman’s mind on other things. Like on himself, for example. She was single-minded, and he had to wonder what it’d be like to have that kind of intense focus aimed at him. Would she ever see him for who he really was?\u003c/p\u003e\n\u003cp\u003e“I might be a Neanderthal, but I’m an honorable one. Despite what you might think.” He polished off the rest of his sandwich and, standing, put his hand out. “But first you need to do something for me.”\u003c/p\u003e\n\u003cp\u003eShe was instantly on her guard. “What?”\u003c/p\u003e\n\u003cp\u003e“C’mon, I won’t bite. Yet.” He grinned, and her responding blush gave him the guts to lean down and simply snatch her hand. It was so small in his, he had to force himself not to look at it, to press it to his mouth and kiss it. When she didn’t pull away, he dared give it a little squeeze. “There’s something I need to show you.”\u003c/p\u003e\n\u003cp\u003e“I just told you, you have to stop work. Until we investigate.” She stood, looking like a wary animal.\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003e“That’s it? Just…fine?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I told you.” He gave her a tug, and she fell into step with him. He dared to sweep his thumb in a quick stroke along the side of her hand—how was it possible to have skin so soft? “But first I’ve been wanting to show you something.” He grimaced to himself, hearing how ragged his voice had sounded. She was like a skittish colt, and he was going to scare her off.\u003c/p\u003e\n\u003cp\u003eSure enough, she stopped in her tracks, pulling her hand free. “Edwin Jessup, you better not be up to no good.”\u003c/p\u003e\n\u003cp\u003e“I’m all about the good, darlin’.” But then what she’d said registered, and it was his turn to stop short. “Hold on, how’d you know my name is Edwin?”\u003c/p\u003e\n\u003cp\u003e“You are called Eddie, right? Duh.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but most people think it’s Edward.”\u003c/p\u003e\n\u003cp\u003eA wicked gleam lit her eyes. “Ed-win doesn’t like his na-ame…” She’d said it like it was a grade school taunt.\u003c/p\u003e\n\u003cp\u003eSuddenly he was ten again. He looked back toward the ranch house, as though he might find Jack watching. “Did my brothers—?”\u003c/p\u003e\n\u003cp\u003eLaura actually smiled at him. “You forget, dummy.”\u003c/p\u003e\n\u003cp\u003e“Dummy?” He grinned back. “You mean I’ve been upgraded from Neanderthal?”\u003c/p\u003e\n\u003cp\u003eShe gave his shoulder a nudge. “I’ve known you since kindergarten, so I think I know your name by now. Besides, Edward is the name of a vampire, and sorry, but you are so not vampiric.”\u003c/p\u003e\n\u003cp\u003e“Hey, that’s my line.” He nudged her back. Who knew letting Laura tease him would be the way to break through her shell? “All right, Laura Edith Bailey.”\u003c/p\u003e\n\u003cp\u003e“Ugh.” She rolled her eyes. “That makes me feel like my mom.” But then she stopped short, the laugh frozen in her throat. Her hand seized into a death grip in his. “What’s that?” she asked, staring at some greenery along the trail.\u003c/p\u003e\n\u003cp\u003eHe laughed. “That’s a fern.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?”\u003c/p\u003e\n\u003cp\u003e“Of course I’m sure.” He pulled her closer, tucking her arm in his, and she actually allowed it. “How’d you ever survive?” As they’d grown up in a small mountain town, the need for a basic understanding of the outdoors was a given. From a young age, they’d been taught how to build a snow fort, what to do if lost in the woods, all that. “How did you grow up in Sierra Falls not knowing this stuff? I mean, that was you I knew as a kid, right?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She gave him a snide look. “But don’t forget, that was also me who, pretty much from fifth grade on, was counting down the days till I could flee for the city.”\u003c/p\u003e\n\u003cp\u003eHe spotted a cluster of mushrooms at the foot of a particularly big pine. “Wait, see those? Don’t ever eat those.” Suddenly everything seemed potentially perilous for the city girl.\u003c/p\u003e\n\u003cp\u003e“Jeez, I get poison oak once, and now I’m an idiot. Of course I know not to eat random mushrooms in the woods.”\u003c/p\u003e\n\u003cp\u003e“Just gotta make sure.” He spotted a jagged ridge of poison oak growing along the creek, and he pointed that out, too. “There, there’s some more. Do you see it? Three leaves—”\u003c/p\u003e\n\u003cp\u003e“You can stop pointing it out to me,” she said after he’d drawn attention to it for the fifth time. “I promise you, I’ll never forget it again.”\u003c/p\u003e\n\u003cp\u003e“Hey”—he took her shoulders and aimed her toward his favorite spot—“here we are.” He could’ve just told her where to look, but he couldn’t resist touching her. “Look up and tell me what you see.”\u003c/p\u003e\n\u003cp\u003eShe glanced back at him over her shoulder to shoot him an impatient glare. “I see a dead tree.”\u003c/p\u003e\n\u003cp\u003eIt was skeletal, an old beech he guessed, leafless even in the heat of summer. But it wasn’t completely dead. “Look closer.”\u003c/p\u003e\n\u003cp\u003eShe fidgeted under his touch. “This is your favorite spot?”\u003c/p\u003e\n\u003cp\u003eRather than reply, he simply hugged in closer from behind her and pointed his finger slowly up the trunk, stopping when he reached an old, rotted hole. A tiny patch of brown and white was barely visible through the cracking bark—it was feathers, from which a black beady eye watched them.\u003c/p\u003e\n\u003cp\u003eHe felt the moment she saw it.\u003c/p\u003e\n\u003cp\u003eShe blurted, “An owl!”\u003c/p\u003e\n\u003cp\u003eThe creature flinched and its head swiveled, and that black beady eye twitched and disappeared. “Shh,” he told her, even though he was chuckling himself. “It’s a whole nest of them. A mama with her hatchlings.”\u003c/p\u003e\n\u003cp\u003e“Not bad, Jessup.” She looked impressed, if a bit startled. \u003c/p\u003e","sourceLink":"https://allnovel.net/timber-creek-sierra-falls-2/page-21.html","bookId":1914,"creation":"Oct 5, 2019 5:29:41 PM","modification":"Oct 5, 2019 5:29:41 PM"}
