{"id":88554,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“That’s more than I do,” she muttered. It occurred to her that he’d have to cook for a lot more than just two on his trips. “What do you feed the kids when you camp?”\u003c/p\u003e\n\u003cp\u003e“I make easy stuff. I’ve got a Sterno, and food keeps pretty well in ice chests. It’s not so hard. My monkey bread is always a hit.”\u003c/p\u003e\n\u003cp\u003eThe light in his eyes as he’d said it made her believe he truly got something from the trips.\u003c/p\u003e\n\u003cp\u003e“Monkey bread.” She grinned. “I haven’t had that since I was little and Dad took us to Big Basin to see the redwoods. Look at you…I think you enjoy the camping. It’s not just for the kids, is it?”\u003c/p\u003e\n\u003cp\u003e“Sure, it’s for me. Watching them in the woods for the first time, it kills me. These kids have had it hard. Some of them have been busted for big-deal stuff, too—especially the older ones. Concealed weapons charges. Drug stuff. But then they get out there”—he waved to the mountains along the horizon—“and they’re blown away that you can live off the land. That a man can actually walk into the woods with no cell phone and no gun, not even a cigarette lighter, just walk in there and then walk back out, a week later if he wanted, alive and well.”\u003c/p\u003e\n\u003cp\u003eHe swirled the wine in his glass, shrugging like it was no big deal. “It’s all about self-sufficiency. Personal responsibility. Keeping calm and informed. The man stuff that every boy needs to learn. That’s what I try to teach them at least. It’s what Jack taught me.”\u003c/p\u003e\n\u003cp\u003e“That’s how you got into it?”\u003c/p\u003e\n\u003cp\u003e“It’s what got me thinking about it, yeah. When I was sixteen, seventeen, I was shaping up to be a bad seed. I’m sure you remember.”\u003c/p\u003e\n\u003cp\u003eShe considered his teenage antics. “Wild child, maybe. But egging the teacher’s car seems far from bad seed material.”\u003c/p\u003e\n\u003cp\u003e“Either way, it doesn’t make for a very good man, does it?”\u003c/p\u003e\n\u003cp\u003e“What about your parents?” She didn’t know his dad well, but Marlene was such a lovely woman. “Surely they rode you about stuff.”\u003c/p\u003e\n\u003cp\u003e“I was the last one out of the house, and by the time I was a junior, senior, they were pretty involved in their own worlds. I’m sure Dad was probably having his affair by then, which on some level I’m sure my mom knew about. And it’s not like I got arrested or anything. I got decent grades, didn’t do drugs. Still, I thought I was a real son of a bitch. But then my brother showed me what a man really is, and that it’s not some bad-ass with a fast car and a bottle of Southern Comfort.”\u003c/p\u003e\n\u003cp\u003e“So you really were as naughty as all the girls said.”\u003c/p\u003e\n\u003cp\u003e“In all the right ways, darlin’,” he told her with a wink. His grin had lightened the mood, but after a moment’s silence, he turned serious again. “I guess the bottom line is, it’s important to me these kids learn what I did the hard way. That feeling good about themselves comes from inside. Not from a bottle or a fistfight. That strength, courage, self-worth…they’ve got to find it inside.”\u003c/p\u003e\n\u003cp\u003eHis words hit her hard. Was she any wiser than these kids? Her self-worth had always been so wrapped up in the trappings of her success. In the car, the fancy gym membership, the clothes. Of course, that stuff didn’t fulfill her. It was just stuff.\u003c/p\u003e\n\u003cp\u003e“I want to meet them,” she said suddenly.\u003c/p\u003e\n\u003cp\u003eHe looked stunned by that. “The kids?”\u003c/p\u003e\n\u003cp\u003eShe gave him a shy smile. “Hopefully not the skunks.”\u003c/p\u003e\n\u003cp\u003eThe sun had dipped below the mountains. She wore only her flimsy blue sundress, and her bare arms prickled into goose bumps. She hunched into herself with a little shiver.\u003c/p\u003e\n\u003cp\u003e“Hey”—he scooted closer, chafing warmth into her arms—“let’s go in.”\u003c/p\u003e\n\u003cp\u003eShe looked off to the meadow. A cool breeze had picked up, but it’d set the wildflowers dancing. “I don’t want to go in yet.”\u003c/p\u003e\n\u003cp\u003e“There’s always my hot tub,” he said playfully, his laugh sexy and teasing. But then he stood, giving her shoulder a gentle squeeze. “Seriously, I’ll run grab you a fleece.”\u003c/p\u003e\n\u003cp\u003e“Actually”—she snagged his hand, stopping him—“I kinda like the sound of that hot tub.”\u003c/p\u003e\n\u003cp\u003eTwenty-eight\u003c/p\u003e\n\u003cp\u003eEddie looked at her like he didn’t understand. “I’ve got a fleece I can lend you,” he said slowly, “but there’s no bathing suit. At least not one that’d fit.” The line was funny, but he’d knit his brows into a serious expression, watching her, waiting to hear her reply.\u003c/p\u003e\n\u003cp\u003eShe stood. Made herself hold his gaze. “I know.”\u003c/p\u003e\n\u003cp\u003eShe knew what she wanted. To have needs didn’t make a woman weak, she knew that now. She could be vulnerable with a man like Eddie and still be safe. Losing control was sometimes a good thing.\u003c/p\u003e\n\u003cp\u003e“Where is this hot tub?” she asked, while inside she complimented herself on how brave she sounded.\u003c/p\u003e\n\u003cp\u003eAnd there was no reason to be afraid anyhow. She thought of all the reasons why it’d be okay. The beige bra and panties she’d worn under her sundress were probably more sensible than her actual bikini. She didn’t need to manage every situation. Not everything needed to be perfect and planned.\u003c/p\u003e\n\u003cp\u003e“It’s around the side,” he said.\u003c/p\u003e\n\u003cp\u003e“Can we use it?”\u003c/p\u003e\n\u003cp\u003eHe gave her a smile, looking eager and wary both. “You’re not kidding?”\u003c/p\u003e\n\u003cp\u003eShe pretended outrage. “Can we get in your hot tub or not?”\u003c/p\u003e\n\u003cp\u003e“Sugar, you don’t have to ask me twice.” He snatched her hand and led her around to the side of the house.\u003c/p\u003e\n\u003cp\u003eIt was a whole other world there, with an outdoor shower, a hammock, and a shining red barbecue. “Red truck, red barbecue…you like the color red, don’t you?”\u003c/p\u003e\n\u003cp\u003eHe came up close and traced her shoulder, tugging aside the cap sleeve to reveal her thin bra strap. “Right now, I’m liking pink.”\u003c/p\u003e\n\u003cp\u003e“That color’s called nude,” she said weakly.\u003c/p\u003e\n\u003cp\u003eHe smiled. “I like that even more.”\u003c/p\u003e\n\u003cp\u003eShe began to debate the whole hot-tub thing in favor of simply tearing Eddie’s clothes off then and there. But then he stepped away to deal with the tub, pulling off the cover, releasing a cloud of steam. When he leaned over the side to turn on the bubbles, she let her eyes linger—that man sure did have the best backside she’d ever seen.\u003c/p\u003e\n\u003cp\u003eHe stood and caught the look on her face, and instead of giving her one of his trademark grins, his expression grew dark. “I’ll go grab towels,” he said, his voice hoarse.\u003c/p\u003e\n\u003cp\u003eWhen he returned, he strode toward her with such intent in his eyes. Suddenly shy, she merely hiked up her dress and sat on the edge. The sun had yet to set, but it’d dipped below the mountains, casting the scene in a gray light. Her shoulders were chilled, but the water was hot, bubbling over her feet, and her body gave a shiver of relief as she began to warm.\u003c/p\u003e\n\u003cp\u003eHe studied her, sitting there with her dress tucked tightly around her thighs. “We can still turn back.”\u003c/p\u003e\n\u003cp\u003e“I know.” She knew he meant more than the hot tub. And she also knew, whatever happened that night, he wouldn’t hold her decision against her. But turning back was the last thing she wanted. She wanted to be fearless. She could let herself lose control.\u003c/p\u003e\n\u003cp\u003e“We could just sit and talk,” Eddie said, then added playfully, “I could be a gentleman and let you keep that dress on after all.” He sat next to her on the edge, putting his back to the water and resting his feet on the tub steps. “Seriously, Laura, the stars will be out soon. I could bring you a blanket.”\u003c/p\u003e\n\u003cp\u003e“Are you so surprised that I’d want to get in?” Just how cautious did people think she was?\u003c/p\u003e\n\u003cp\u003e“I suppose I didn’t take you for the skinny-dipping type.”\u003c/p\u003e\n\u003cp\u003e“I’d have my bra and panties on,” she countered.\u003c/p\u003e\n\u003cp\u003e“We’d have to see about that.” He sneaked a finger under her sleeve, hunting for her bra strap. “Where’d it go?”\u003c/p\u003e\n\u003cp\u003e“Eddie!” She flicked water at him but was secretly pleased.\u003c/p\u003e\n\u003cp\u003eHe stood, a challenge in his eyes. “Well, if you’re not getting in, I am.”\u003c/p\u003e\n\u003cp\u003eShe watched avidly as he pulled off his shirt, but when he began to unzip his jeans, she said, “Hey, don’t you have a suit?”\u003c/p\u003e\n\u003cp\u003e“Not if you don’t.” His hands froze on his zipper. “Why, you complaining?”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003eHe grinned at that, but still, he kept on his boxers, and she suspected it was to make her more comfortable. He hopped into the tub, and water whooshed over the sides, drenching the hem of her dress. “Come on in”—he playfully patted the surface, splashing her some more—“the water’s fine.”\u003c/p\u003e\n\u003cp\u003eShe hesitated. It was tempting. He was tempting. Adorably so.\u003c/p\u003e\n\u003cp\u003eHe’d always been such an easy charmer, and it was a delight to finally embrace his flirtations. To let herself bask in them.\u003c/p\u003e\n\u003cp\u003eBut still…to undress in front of him? Just like that, outside, in the daylight? She wondered if maybe she should wait for the sun to dip lower. She’d always been a little self-conscious when it came to her body—she knew in her head that it was a good one, but knowing and feeling were two different things.\u003c/p\u003e\n\u003cp\u003eHis voice pulled her from her thoughts. “Still worried about what other people think, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“No,” she said defensively. Though really, he’d hit the nail on the head.\u003c/p\u003e\n\u003cp\u003e“I promise, there’s nobody but you and me in these woods.”\u003c/p\u003e\n\u003cp\u003e“I’m different now. I don’t care what people think.”\u003c/p\u003e\n\u003cp\u003e“Is that so?” He grew quiet, studying her, and she read affectionate understanding on his face. “Look, let’s go inside, Laura. All I want is to be with you.” He quickly added, “I don’t mean with you with you, though I’d love that, too…God, how I’d love that…” He gave her a flustered smile. “What I’m saying is, we can just hang out and watch a movie. Do the crossword. Whatever makes you happy.”\u003c/p\u003e\n\u003cp\u003eShe shot him a look. “You do the crossword?”\u003c/p\u003e\n\u003cp\u003e“No.” He made himself look innocent. “But you strike me as someone who appreciates men who do.” \u003c/p\u003e","sourceLink":"https://allnovel.net/timber-creek-sierra-falls-2/page-37.html","bookId":1914,"creation":"Oct 5, 2019 5:29:41 PM","modification":"Oct 5, 2019 5:29:41 PM"}
