{"id":13905,"no":3,"title":"Chapter 3","content":"\u0026nbsp;I threw open the folding-doors near by, and turning upon Turkey andNippers, exclaimed in an excited manner--\"He says, a second time, he won\u0027t examine his papers. \u0026nbsp;What do you thinkof it, Turkey?\"It was afternoon, be it remembered. \u0026nbsp;Turkey sat glowing like a brassboiler, his bald head steaming, his hands reeling among his blottedpapers. \n\u003cdiv\u003e\n \"Think of it?\" roared Turkey; \"I think I\u0027ll just step behind his screen,and black his eyes for him!\"So saying, Turkey rose to his feet and threw his arms into a pugilisticposition. \u0026nbsp;He was hurrying away to make good his promise, when Idetained him, alarmed at the effect of incautiously rousing Turkey\u0027scombativeness after dinner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sit down, Turkey,\" said I, \"and hear what Nippers has to say. \u0026nbsp;What doyou think of it, Nippers? \u0026nbsp;Would I not be justified in immediatelydismissing Bartleby?\"\"Excuse me, that is for you to decide, sir. \u0026nbsp;I think his conduct quiteunusual, and indeed unjust, as regards Turkey and myself. \u0026nbsp;But it mayonly be a passing whim.\"\"Ah,\" exclaimed I, \"you have strangely changed your mind then--you speakvery gently of him now.\"\"All beer,\" cried Turkey; \"gentleness is effects of beer--Nippers and Idined together to-day. \u0026nbsp;You see how gentle _I_ am, sir. \u0026nbsp;Shall I go andblack his eyes?\"\"You refer to Bartleby, I suppose. \u0026nbsp;No, not to-day, Turkey,\" I replied;\"pray, put up your fists.\"I closed the doors, and again advanced towards Bartleby. \u0026nbsp;I feltadditional incentives tempting me to my fate. \u0026nbsp;I burned to be rebelledagainst again. \u0026nbsp;I remembered that Bartleby never left the office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby,\" said I, \"Ginger Nut is away; just step round to the PostOffice, won\u0027t you? (it was but a three minute walk,) and see if there isany thing for me.\"\"I would prefer not to.\"\"You _will_ not?\"\"I _prefer_ not.\"I staggered to my desk, and sat there in a deep study. \u0026nbsp;My blindinveteracy returned. \u0026nbsp;Was there any other thing in which I could procuremyself to be ignominiously repulsed by this lean, penniless wight?--myhired clerk? \u0026nbsp;What added thing is there, perfectly reasonable, that hewill be sure to refuse to do?\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby!\"No answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby,\" in a louder tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n No answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby,\" I roared.\n\u003c/div\u003e \n\u003cdiv\u003e\n Like a very ghost, agreeably to the laws of magical invocation, at thethird summons, he appeared at the entrance of his hermitage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go to the next room, and tell Nippers to come to me.\"\"I prefer not to,\" he respectfully and slowly said, and mildlydisappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very good, Bartleby,\" said I, in a quiet sort of serenely severeself-possessed tone, intimating the unalterable purpose of some terribleretribution very close at hand. \u0026nbsp;At the moment I half intended somethingof the kind. \u0026nbsp;But upon the whole, as it was drawing towards mydinner-hour, I thought it best to put on my hat and walk home for theday, suffering much from perplexity and distress of mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n Shall I acknowledge it? \u0026nbsp;The conclusion of this whole business was, thatit soon became a fixed fact of my chambers, that a pale young scrivener,by the name of Bartleby, and a desk there; that he copied for me at theusual rate of four cents a folio (one hundred words); but he waspermanently exempt from examining the work done by him, that duty beingtransferred to Turkey and Nippers, one of compliment doubtless to theirsuperior acuteness; moreover, said Bartleby was never on any account tobe dispatched on the most trivial errand of any sort; and that even ifentreated to take upon him such a matter, it was generally understoodthat he would prefer not to--in other words, that he would refusepointblank.\n\u003c/div\u003e \n\u003cdiv\u003e\n As days passed on, I became considerably reconciled to Bartleby. \u0026nbsp;Hissteadiness, his freedom from all dissipation, his incessant industry(except when he chose to throw himself into a standing revery behind hisscreen), his great stillness, his unalterableness of demeanor under allcircumstances, made him a valuable acquisition. \u0026nbsp;One prime thing wasthis,--_he was always there;_--first in the morning, continuallythrough the day, and the last at night. \u0026nbsp;I had a singular confidence inhis honesty. \u0026nbsp;I felt my most precious papers perfectly safe in hishands. \u0026nbsp;Sometimes to be sure I could not, for the very soul of me, avoidfalling into sudden spasmodic passions with him. \u0026nbsp;For it was exceedingdifficult to bear in mind all the time those strange peculiarities,privileges, and unheard of exemptions, forming the tacit stipulations onBartleby\u0027s part under which he remained in my office. \u0026nbsp;Now and then, inthe eagerness of dispatching pressing business, I would inadvertentlysummon Bartleby, in a short, rapid tone, to put his finger, say, on theincipient tie of a bit of red tape with which I was about compressingsome papers. \u0026nbsp;Of course, from behind the screen the usual answer, \"Iprefer not to,\" was sure to come; and then, how could a human creaturewith the common infirmities of our nature, refrain from bitterlyexclaiming upon such perverseness--such unreasonableness. \u0026nbsp;However,every added repulse of this sort which I received only tended to lessenthe probability of my repeating the inadvertence.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here it must be said, that according to the custom of most legalgentlemen occupying chambers in densely-populated law buildings, therewere several keys to my door. \u0026nbsp;One was kept by a woman residing in theattic, which person weekly scrubbed and daily swept and dusted myapartments. \u0026nbsp;Another was kept by Turkey for convenience sake. \u0026nbsp;The thirdI sometimes carried in my own pocket. \u0026nbsp;The fourth I knew not who had.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, one Sunday morning I happened to go to Trinity Church, to hear acelebrated preacher, and finding myself rather early on the ground, Ithought I would walk around to my chambers for a while. \u0026nbsp;Luckily I hadmy key with me; but upon applying it to the lock, I found it resisted bysomething inserted from the inside. \u0026nbsp;Quite surprised, I called out; whento my consternation a key was turned from within; and thrusting his leanvisage at me, and holding the door ajar, the apparition of Bartlebyappeared, in his shirt sleeves, and otherwise in a strangely tattereddishabille, saying quietly that he was sorry, but he was deeply engagedjust then, and--preferred not admitting me at present. \u0026nbsp;In a brief wordor two, he moreover added, that perhaps I had better walk round theblock two or three times, and by that time he would probably haveconcluded his affairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, the utterly unsurmised appearance of Bartleby, tenanting mylaw-chambers of a Sunday morning, with his cadaverously gentlemanly_nonchalance_, yet withal firm and self-possessed, had such a strangeeffect upon me, that incontinently I slunk away from my own door, anddid as desired. \u0026nbsp;But not without sundry twinges of impotent rebellionagainst the mild effrontery of this unaccountable scrivener. \u0026nbsp;Indeed, itwas his wonderful mildness chiefly, which not only disarmed me, butunmanned me, as it were. \u0026nbsp;For I consider that one, for the time, is asort of unmanned when he tranquilly permits his hired clerk to dictateto him, and order him away from his own premises. \u0026nbsp;Furthermore, I wasfull of uneasiness as to what Bartleby could possibly be doing in myoffice in his shirt sleeves, and in an otherwise dismantled condition ofa Sunday morning. \u0026nbsp;Was any thing amiss going on? \u0026nbsp;Nay, that was out ofthe question. \u0026nbsp;It was not to be thought of for a moment that Bartlebywas an immoral person. \u0026nbsp;But what could he be doing there?--copying? \u0026nbsp;Nayagain, whatever might be his eccentricities, Bartleby was an eminentlydecorous person. \u0026nbsp;He would be the last man to sit down to his desk inany state approaching to nudity. \u0026nbsp;Besides, it was Sunday; and there wassomething about Bartleby that forbade the supposition that he would byany secular occupation violate the proprieties of the day.\n\u003c/div\u003e \n\u003cdiv\u003e\n Nevertheless, my mind was not pacified; and full of a restlesscuriosity, at last I returned to the door. \u0026nbsp;Without hindrance I insertedmy key, opened it, and entered. \u0026nbsp;Bartleby was not to be seen. \u0026nbsp;I lookedround anxiously, peeped behind his screen; but it was very plain that hewas gone. \u0026nbsp;Upon more closely examining the place, I surmised that for anindefinite period Bartleby must have ate, dressed, and slept in myoffice, and that too without plate, mirror, or bed. \u0026nbsp;The cushioned seatof a rickety old sofa in one corner bore the faint impress of a lean,reclining form. \u0026nbsp;Rolled away under his desk, I found a blanket; underthe empty grate, a blacking box and brush; on a chair, a tin basin, withsoap and a ragged towel; in a newspaper a few crumbs of ginger-nuts anda morsel of cheese. \u0026nbsp;Yes, thought I, it is evident enough that Bartlebyhas been making his home here, keeping bachelor\u0027s hall all by himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Immediately then the thought came sweeping across me, What miserablefriendlessness and loneliness are here revealed! \u0026nbsp;His poverty is great;but his solitude, how horrible! \u0026nbsp;Think of it. \u0026nbsp;Of a Sunday, Wall-streetis deserted as Petra; and every night of every day it is an emptiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n This building too, which of week-days hums with industry and life, atnightfall echoes with sheer vacancy, and all through Sunday is forlorn.\n\u003c/div\u003e \n\u003cdiv\u003e\n And here Bartleby makes his home; sole spectator of a solitude which hehas seen all populous--a sort of innocent and transformed Mariusbrooding among the ruins of Carthage!\n\u003c/div\u003e \n\u003cdiv\u003e\n For the first time in my life a feeling of overpowering stingingmelancholy seized me. \u0026nbsp;Before, I had never experienced aught but anot-unpleasing sadness. \u0026nbsp;The bond of a common humanity now drew meirresistibly to gloom. \u0026nbsp;A fraternal melancholy! \u0026nbsp;For both I and Bartlebywere sons of Adam. \u0026nbsp;I remembered the bright silks and sparkling faces Ihad seen that day, in gala trim, swan-like sailing down the Mississippiof Broadway; and I contrasted them with the pallid copyist, and thoughtto myself, Ah, happiness courts the light, so we deem the world is gay;but misery hides aloof, so we deem that misery there is none. \u0026nbsp;These sadfancyings--chimeras, doubtless, of a sick and silly brain--led on toother and more special thoughts, concerning the eccentricities ofBartleby. \u0026nbsp;Presentiments of strange discoveries hovered round me. \u0026nbsp;Thescrivener\u0027s pale form appeared to me laid out, among uncaring strangers,in its shivering winding sheet.\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly I was attracted by Bartleby\u0027s closed desk, the key in opensight left in the lock.\n\u003c/div\u003e \n\u003cdiv\u003e\n I mean no mischief, seek the gratification of no heartless curiosity,thought I; besides, the desk is mine, and its contents too, so I willmake bold to look within. \u0026nbsp;Every thing was methodically arranged, thepapers smoothly placed. \u0026nbsp;The pigeon holes were deep, and removing thefiles of documents, I groped into their recesses. \u0026nbsp;Presently I feltsomething there, and dragged it out. \u0026nbsp;It was an old bandannahandkerchief, heavy and knotted. \u0026nbsp;I opened it, and saw it was a savings\u0027\n\u003c/div\u003e \n\u003cdiv\u003e\n bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n I now recalled all the quiet mysteries which I had noted in the man. \u0026nbsp;Iremembered that he never spoke but to answer; that though at intervalshe had considerable time to himself, yet I had never seen himreading--no, not even a newspaper; that for long periods he would standlooking out, at his pale window behind the screen, upon the dead brickwall; I was quite sure he never visited any refectory or eating house;while his pale face clearly indicated that he never drank beer likeTurkey, or tea and coffee even, like other men; that he never went anywhere in particular that I could learn; never went out for a walk,unless indeed that was the case at present; that he had declined tellingwho he was, or whence he came, or whether he had any relatives in theworld; that though so thin and pale, he never complained of ill health.\n\u003c/div\u003e \n\u003cdiv\u003e\n And more than all, I remembered a certain unconscious air of pallid--howshall I call it?--of pallid haughtiness, say, or rather an austerereserve about him, which had positively awed me into my tame compliancewith his eccentricities, when I had feared to ask him to do theslightest incidental thing for me, even though I might know, from hislong-continued motionlessness, that behind his screen he must bestanding in one of those dead-wall reveries of his.\n\u003c/div\u003e \n\u003cdiv\u003e\n Revolving all these things, and coupling them with the recentlydiscovered fact that he made my office his constant abiding place andhome, and not forgetful of his morbid moodiness; revolving all thesethings, a prudential feeling began to steal over me. \u0026nbsp;My first emotionshad been those of pure melancholy and sincerest pity; but just inproportion as the forlornness of Bartleby grew and grew to myimagination, did that same melancholy merge into fear, that pity intorepulsion. \u0026nbsp;So true it is, and so terrible too, that up to a certainpoint the thought or sight of misery enlists our best affections; but,in certain special cases, beyond that point it does not. \u0026nbsp;They err whowould assert that invariably this is owing to the inherent selfishnessof the human heart. \u0026nbsp;It rather proceeds from a certain hopelessness ofremedying excessive and organic ill. \u0026nbsp;To a sensitive being, pity is notseldom pain. \u0026nbsp;And when at last it is perceived that such pity cannotlead to effectual succor, common sense bids the soul rid of it. \u0026nbsp;What Isaw that morning persuaded me that the scrivener was the victim ofinnate and incurable disorder. \u0026nbsp;I might give alms to his body; but hisbody did not pain him; it was his soul that suffered, and his soul Icould not reach.\n\u003c/div\u003e \n\u003cdiv\u003e\n I did not accomplish the purpose of going to Trinity Church thatmorning. \u0026nbsp;Somehow, the things I had seen disqualified me for the timefrom church-going. \u0026nbsp;I walked homeward, thinking what I would do withBartleby. \u0026nbsp;Finally, I resolved upon this;--I would put certain calmquestions to him the next morning, touching his history, etc., and if hedeclined to answer them openly and unreservedly (and I supposed he wouldprefer not), then to give him a twenty dollar bill over and abovewhatever I might owe him, and tell him his services were no longerrequired; but that if in any other way I could assist him, I would behappy to do so, especially if he desired to return to his native place,wherever that might be, I would willingly help to defray the expenses.\n\u003c/div\u003e \n\u003cdiv\u003e\n Moreover, if, after reaching home, he found himself at any time in wantof aid, a letter from him would be sure of a reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning came.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby,\" said I, gently calling to him behind his screen.\n\u003c/div\u003e \n\u003cdiv\u003e\n No reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bartleby,\" said I, in a still gentler tone, \"come here; I am not goingto ask you to do any thing you would prefer not to do--I simply wish tospeak to you.\"Upon this he noiselessly slid into view.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you tell me, Bartleby, where you were born?\"\"I would prefer not to.\"\"Will you tell me _any thing_ about yourself?\"\"I would prefer not to.\"\"But what reasonable objection can you have to speak to me? \u0026nbsp;I feelfriendly towards you.\"He did not look at me while I spoke, but kept his glance fixed upon mybust of Cicero, which as I then sat, was directly behind me, some sixinches above my head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your answer, Bartleby?\" said I, after waiting a considerabletime for a reply, during which his countenance remained immovable, onlythere was the faintest conceivable tremor of the white attenuated mouth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At present I prefer to give no answer,\" he said, and retired into hishermitage.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was rather weak in me I confess, but his manner on this occasionnettled me. \u0026nbsp;Not only did there seem to lurk in it a certain calmdisdain, but his perverseness seemed ungrateful, considering theundeniable good usage and indulgence he had received from me.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again I sat ruminating what I should do. \u0026nbsp;Mortified as I was at hisbehavior, and resolved as I had been to dismiss him when I entered myoffices, nevertheless I strangely felt something superstitious knockingat my heart, and forbidding me to carry out my purpose, and denouncingme for a villain if I dared to breathe one bitter word against thisforlornest of mankind. \u0026nbsp;At last, familiarly drawing my chair behind hisscreen, I sat down and said: \"Bartleby, never mind then about revealingyour history; but let me entreat you, as a friend, to comply as far asmay be with the usages of this office. \u0026nbsp;Say now you will help to examinepapers to-morrow or next day: in short, say now that in a day or two youwill begin to be a little reasonable:--say so, Bartleby.\"\"At present I would prefer not to be a little reasonable,\" was hismildly cadaverous reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then the folding-doors opened, and Nippers approached. \u0026nbsp;He seemedsuffering from an unusually bad night\u0027s rest, induced by severerindigestion than common. \u0026nbsp;He overheard those final words of Bartleby.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"_Prefer not_, eh?\" gritted Nippers--\"I\u0027d _prefer_ him, if I were you,sir,\" addressing me--\"I\u0027d _prefer_ him; I\u0027d give him preferences, thestubborn mule! \u0026nbsp;What is it, sir, pray, that he _prefers_ not to do now?\"Bartleby moved not a limb.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2837/78428.html","bookId":1224,"creation":"Aug 2, 2019 5:47:25 AM","modification":"Aug 2, 2019 5:47:25 AM"}
