{"id":101801,"no":13,"title":"Page 13","content":"\u003cp\u003e“What if we had a party?” Michelle asked.\u003c/p\u003e\n\u003cp\u003e“A Christmas party,” Jenny added, warming to the idea. “That’s perfect.” Then reality set in. “But how would we possibly feed all our friends?” It was difficult enough to scrounge up meals for the two of them.\u003c/p\u003e\n\u003cp\u003e“We’ll make it a potluck,” Michelle suggested. “All we need supply are the drinks, plus plates and silverware. Between us we could manage that, couldn’t we?”\u003c/p\u003e\n\u003cp\u003e“Sure we could.” Jenny’s nod was eager. Her spirits lifted just thinking about the celebration. She needed this, needed something to take her mind off how much she would miss Montana. “We can make the invitations ourselves.”\u003c/p\u003e\n\u003cp\u003e“Let’s hand them out. That way we could save on postage,” Michelle said, offering another money-saving idea.\u003c/p\u003e\n\u003cp\u003e“Who should we invite?”\u003c/p\u003e\n\u003cp\u003e“Bill and Susan,” Michelle suggested.\u003c/p\u003e\n\u003cp\u003eThe couple had met in drama school and had married that summer. Jenny and Michelle had been bridesmaids. Jenny had joked about how the two of them always seemed to end up as bridesmaids.\u003c/p\u003e\n\u003cp\u003e“What about Cliff?” Jenny asked.\u003c/p\u003e\n\u003cp\u003e“Abby, too.”\u003c/p\u003e\n\u003cp\u003eThe list continued until they were afraid they’d forget, so they decided to write them all down.\u003c/p\u003e\n\u003cp\u003eMichelle sat at the table and reached for a pen. “Good grief, what happened here? It looks like a paper massacre.”\u003c/p\u003e\n\u003cp\u003eThe tightness gripped Jenny’s throat. “I finally wrote my parents and told them I wouldn’t be home.” Just saying the words aloud increased the ache.\u003c/p\u003e\n\u003cp\u003e“Next year you’ll be with your family,” Michelle said with confidence.\u003c/p\u003e\n\u003cp\u003e“You’re right,” Jenny said, forcing herself to think positive thoughts. Surely living in the same city in which Norman Vincent Peale had preached his philosophy of positive thinking should teach her something. Yet here she was doing it again: stinking thinking.\u003c/p\u003e\n\u003cp\u003e“Bill and Susan,” Michelle mumbled as she repeated the names of their mutual friends. “Abby. Cliff. John.”\u003c/p\u003e\n\u003cp\u003eThe phone pealed and they froze.\u003c/p\u003e\n\u003cp\u003eMichelle looked to Jenny.\u003c/p\u003e\n\u003cp\u003eJenny to Michelle.\u003c/p\u003e\n\u003cp\u003e“You answer it,” her roommate instructed.\u003c/p\u003e\n\u003cp\u003e“You,” Jenny insisted, shaking her head. It had been like this all week. The instant the phone jingled they hoped, prayed, it was Irene, their agent. If it wasn’t Irene, then perhaps it was the casting director and maybe even the great and mighty John Peterman himself. It wasn’t likely, but they could dream.\u003c/p\u003e\n\u003cp\u003e“It’s probably some schmuck wanting to sell us aluminum siding,” Michelle joked.\u003c/p\u003e\n\u003cp\u003e“Or someone doing a survey on cat food.”\u003c/p\u003e\n\u003cp\u003eBut Jenny noticed that neither one of them took their eyes away from the kitchen telephone.\u003c/p\u003e\n\u003cp\u003eMichelle edged herself from the chair on the third ring and reached the phone. “Hello, this is Jenny and Michelle’s place,” she said cheerfully in a perfect rendition of the efficient secretary.\u003c/p\u003e\n\u003cp\u003eJenny studied her friend. Afraid to hope. Afraid to care.\u003c/p\u003e\n\u003cp\u003e“It’s for you,” Michelle stated, and handed her the receiver. Then she mouthed, “It’s a man.”\u003c/p\u003e\n\u003cp\u003eJenny pointed her finger at her heart, wondering if she’d misunderstood. “For me?”\u003c/p\u003e\n\u003cp\u003eMichelle nodded.\u003c/p\u003e\n\u003cp\u003eShe took the phone and said in a friendly but professional-sounding voice, “This is Jenny Lancaster.”\u003c/p\u003e\n\u003cp\u003e“Hello, Jenny.”\u003c/p\u003e\n\u003cp\u003eTrey.\u003c/p\u003e\n\u003cp\u003eJenny couldn’t have been more shocked if it’d been Andrew Lloyd Webber himself, wanting her to star in his next musical.\u003c/p\u003e\n\u003cp\u003e“Trey!” she said, barely managing to hide her shock.\u003c/p\u003e\n\u003cp\u003e“I got your note,” he announced.\u003c/p\u003e\n\u003cp\u003e“It was a surprise to get your Thanksgiving card,” she said, holding the receiver with both hands. She felt lightheaded and wasn’t sure if it was the shock of Trey’s call or the fact that she hadn’t eaten all day.\u003c/p\u003e\n\u003cp\u003e“You aren’t coming home for the holidays.”\u003c/p\u003e\n\u003cp\u003eTrey, her family. Everyone seemed to be pressuring her. It felt as if the walls were closing in around her. “I can’t come,” she told him, unable to disguise her own bitter disappointment. “I want to be there. More than anything, but I can’t.”\u003c/p\u003e\n\u003cp\u003e“That’s what your note said. So the bright lights of the city have blinded you?”\u003c/p\u003e\n\u003cp\u003e“No.” She longed to tell him how she hungered for the peace and solitude of Montana. New York City held its own excitement, its own energy. So often she’d walked down the crowded avenues and felt a rhythm, a cadence, that all but sang up from the asphalt. For three years she’d marched to that beat and hummed its special brand of music.\u003c/p\u003e\n\u003cp\u003eYet the lone cry in the barren hills of home played longingly to her soul, its melody haunting her.\u003c/p\u003e\n\u003cp\u003e“Your family misses you,” Trey said, tightening the screws of her regrets.\u003c/p\u003e\n\u003cp\u003eJenny bit into her lower lip.\u003c/p\u003e\n\u003cp\u003e“I miss you,” Trey added.\u003c/p\u003e\n\u003cp\u003eJenny’s eyes flew open. Trey, the man who’d invaded her dreams for weeks, admitted to missing her. He’d as much as said he wanted her home.\u003c/p\u003e\n\u003cp\u003eRegrets clamored against her chest, their fists sharp and pain-filled. “I can’t come,” she whispered miserably.\u003c/p\u003e\n\u003cp\u003eHer words were met with silence.\u003c/p\u003e\n\u003cp\u003e“Can’t or won’t?” he asked starkly.\u003c/p\u003e\n\u003cp\u003eBrynn Cassidy crossed the street in front of Manhattan High and St. Philip’s Cathedral. She found Father Grady, the gray-haired priest who’d become her friend, in the vestibule.\u003c/p\u003e\n\u003cp\u003e“Hello, Father,” she said.\u003c/p\u003e\n\u003cp\u003e“Brynn, it’s good to see you, my girl.” His green Irish eyes lit up with warm delight.\u003c/p\u003e\n\u003cp\u003e“I got your message. You wanted to see me?”\u003c/p\u003e\n\u003cp\u003e“Yes. Come over to the rectory and I’ll have Mrs. Houghton brew us a pot of tea.”\u003c/p\u003e\n\u003cp\u003eBrynn glanced at her watch. She enjoyed visiting with Father Grady, but the older priest liked to talk and she didn’t have time that afternoon.\u003c/p\u003e\n\u003cp\u003eFather Grady’s eyes followed hers. “Do you have an appointment?”\u003c/p\u003e\n\u003cp\u003e“I have to stop off at Roberto Alcantara’s this afternoon and pick up my car.”\u003c/p\u003e\n\u003cp\u003e“I know Roberto well,” Father Grady said, and motioned for her to precede him out of the church. “He’s a fine young man.” He paused to glance her way, and it seemed to Brynn that the priest was looking for her to elaborate. She didn’t.\u003c/p\u003e\n\u003cp\u003e“Emilio’s in my class.”\u003c/p\u003e\n\u003cp\u003e“Ah, yes, Emilio. Roberto’s done his best to keep his brother out of trouble. There haven’t been problems with Emilio, have there?”\u003c/p\u003e\n\u003cp\u003e“No, no,” Brynn was quick to tell him.\u003c/p\u003e\n\u003cp\u003eFather Grady’s face relaxed.\u003c/p\u003e\n\u003cp\u003eBrynn lowered her gaze. It wasn’t Emilio she’d clashed with, but Roberto. “I’m afraid Roberto doesn’t think much of me.”\u003c/p\u003e\n\u003cp\u003eFather Grady opened the door to the rectory. “I’m sure you’re mistaken.”\u003c/p\u003e\n\u003cp\u003eBrynn followed him inside. She preferred not to tell him about their brief confrontation. It rankled still. Roberto Alcantara had been both rude and unreasonable. But more than that, he’d been wrong.\u003c/p\u003e\n\u003cp\u003e“I’m not sure I have time for tea,” she reiterated when she realized that Father Grady fully intended for her to stay and chat anyway.\u003c/p\u003e\n\u003cp\u003e“Nonsense.” He escorted Brynn into the parlor and left her while he went in search of Mrs. Houghton, the elderly housekeeper who cared for Father Grady and the bishop when he was in residence.\u003c/p\u003e\n\u003cp\u003eFather Grady returned shortly with a tray and two cups. “I was hoping you’d be able to stop over this afternoon,” he said as he set the tray on the coffee table. He handed Brynn a delicate china cup and took one himself before sitting across from her on the velvet settee. “The church is sponsoring a dance this Friday evening for the youth group.”\u003c/p\u003e\n\u003cp\u003eBrynn had seen the posters. “I’ve heard several of the kids mention it.”\u003c/p\u003e\n\u003cp\u003e“We generally have a good turnout.”\u003c/p\u003e\n\u003cp\u003eBrynn was sure that was true.\u003c/p\u003e\n\u003cp\u003e“I was wondering,” Father Grady said, studying her above the china cup, “if you’d agree to be one of the chaperones.”\u003c/p\u003e\n\u003cp\u003eThe request took Brynn by surprise, although in retrospect she supposed it shouldn’t.\u003c/p\u003e\n\u003cp\u003e“The children are quite fond of you,” he added as if he felt flattering her would be necessary. “Modesto Diaz mentioned your name the other day. He said . . .” Father Grady paused, and his eyes sparkled with humor.\u003c/p\u003e\n\u003cp\u003e“Yes?” Brynn prodded.\u003c/p\u003e\n\u003cp\u003e“Well, Modesto did say you were a little weird, but that he liked you anyway.”\u003c/p\u003e\n\u003cp\u003eBrynn was sure her students didn’t quite know what to make of her teaching methods.\u003c/p\u003e\n\u003cp\u003e“I realize it’s an imposition asking you at this late date,” Father Grady continued. “I’d consider it a personal favor if you could come.”\u003c/p\u003e\n\u003cp\u003e“I’ll be happy to chaperone the dance,” Brynn murmured.\u003c/p\u003e\n\u003cp\u003e“Now,” Father Grady said, and set down his teacup. “Tell me what happened between you and Roberto Alcantara.”\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” she said, preferring to make light of their differences. “Actually Roberto’s been most helpful. My car broke down and he’s fixing it for me.”\u003c/p\u003e\n\u003cp\u003eFather Grady said nothing.\u003c/p\u003e\n\u003cp\u003e“I was on my way to pick it up now.”\u003c/p\u003e\n\u003cp\u003e“Roberto’s been through some difficult times,” the priest told her. “I’m not at liberty to tell you all the circumstances, but . . .”\u003c/p\u003e\n\u003cp\u003e“Oh, please, no. I wouldn’t want you to break a confidence. It’s nothing, really.”\u003c/p\u003e\n\u003cp\u003e“If Roberto offended you . . .”\u003c/p\u003e\n\u003cp\u003e“He didn’t. We had a difference of opinion.”\u003c/p\u003e\n\u003cp\u003eFather Grady seemed relieved. “I’m glad to hear that. If you do find him disagreeable, all I ask is that you give him a bit of slack. He’s a good man. I’d vouch for him any day.”\u003c/p\u003e\n\u003cp\u003e“I’m sure what you say is true.” Brynn stood and set the teacup back on the tray. “Now I really must be going.”\u003c/p\u003e\n\u003cp\u003eFather Grady escorted her to the front door. “I’ll see you Friday evening, then, around seven?”\u003c/p\u003e\n\u003cp\u003eBrynn nodded. “I’ll be here.”\u003c/p\u003e\n\u003cp\u003eThe priest’s eyes brightened with a smile. “Thank you, Brynn, I promise you won’t regret this.”\u003c/p\u003e\n\u003cp\u003eBrynn briskly walked the few blocks to Roberto Alcantara’s garage. Earlier that afternoon, Emilio had personally delivered the message that her car was ready for her. The youth made sure the entire class heard him, as though the two of them had a personal business arrangement. Brynn had been forced to conceal her irritation.\u003c/p\u003e\n\u003cp\u003eAs the afternoon progressed, she discovered she wasn’t looking forward to another encounter with Emilio’s older brother. The man was way off base. It was impossible to reason with anyone who regarded education as a waste of time. The fact that he’d actually urged his younger brother to drop out of school was nothing short of criminal.\u003c/p\u003e\n\u003cp\u003e“Yo, Miss Cassidy.” Emilio, Modesto, and a few more of the boys from her class drove past her slowly and waved.\u003c/p\u003e\n\u003cp\u003eBrynn returned the gesture automatically. It wasn’t until they’d turned the corner that she realized the boys were joyriding in her car.\u003c/p\u003e\n\u003cp\u003eBrynn bristled and hurried the last block to Roberto’s. When she reached the garage, she stormed in the door. “Emilio’s driving around in my car.” \u003c/p\u003e","sourceLink":"https://allnovel.net/touched-by-angels-angels-everywhere-3/page-13.html","bookId":2627,"creation":"Oct 5, 2019 10:08:06 PM","modification":"Oct 5, 2019 10:08:06 PM"}
