{"id":101813,"no":25,"title":"Page 25","content":"\u003cp\u003eAfter a time, Hannah escaped to her bedroom and closed the door. She doubted anyone would miss her.\u003c/p\u003e\n\u003cp\u003eSitting on top of her bed, her knees bent, Hannah closed her eyes and remembered her time with Joshua at the skating rink. It wasn’t right that she should be thinking of another man. Not with Carl on the other side of the door.\u003c/p\u003e\n\u003cp\u003eJoshua’s business card remained inside her coat pocket, but she didn’t need to retrieve it to find the number. In the last two days, she’d stared at that card so often, she’d committed the phone number to memory.\u003c/p\u003e\n\u003cp\u003eWhen she feared she might be missed, Hannah returned to the living room. Carl glanced her way and smiled affectionately.\u003c/p\u003e\n\u003cp\u003e“Carl,” she said, “would you like to go for a walk, or something?”\u003c/p\u003e\n\u003cp\u003e“A walk?” he repeated with a decided lack of enthusiasm. “It’s below freezing.”\u003c/p\u003e\n\u003cp\u003e“How about if we went ice skating?” she suggested next.\u003c/p\u003e\n\u003cp\u003e“Tonight?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what’s gotten into that daughter of mine,” her father commented, and chuckled. “Two nights ago she walks over to Rockefeller Center and goes ice skating.”\u003c/p\u003e\n\u003cp\u003e“I don’t skate,” Carl said with a touch of sadness.\u003c/p\u003e\n\u003cp\u003e“I could teach you,” she offered expectantly. “It isn’t difficult, and we could have a lot of fun.”\u003c/p\u003e\n\u003cp\u003eCarl looked from Hannah to her father and then back again. “Would you mind if we stayed here?”\u003c/p\u003e\n\u003cp\u003e“Remember your young man’s just getting over the flu, Hannah,” her father reminded her gently. “Carl will take you ice skating another time.”\u003c/p\u003e\n\u003cp\u003eShe tried to hide her disappointment and must have succeeded. An hour later, Helen Rabinsky announced it was time to leave. Carl stood, and for no reason Hannah could fathom the two of them were left alone. It didn’t take her long to realize her family was giving her and Carl a private moment together.\u003c/p\u003e\n\u003cp\u003e“Thanks for stopping by, Carl,” she said.\u003c/p\u003e\n\u003cp\u003e“It was good to see you again, Hannah.” He leaned forward and pressed his mouth to hers. It was a gentle kiss, but passionless. It was unfair to compare the kisses she’d shared with Joshua to the quick exchanges between her and Carl. But Hannah couldn’t help it.\u003c/p\u003e\n\u003cp\u003eJoshua’s kisses made her feel as though she’d been hit by a freight train. The emotional impact left her reeling long afterward. She knew that her kisses affected him in the same magical, exciting way. Joshua made her feel like a sensual, alluring woman.\u003c/p\u003e\n\u003cp\u003e“I’ll be calling you soon,” Carl promised.\u003c/p\u003e\n\u003cp\u003eHannah nodded, afraid to speak for fear of what she’d say. Intuitively she realized she couldn’t marry Carl. He didn’t love her any more than she loved him. He was as miserable about this arrangement as she was, but they were both caught in the trap. One of them had to break it.\u003c/p\u003e\n\u003cp\u003eAs soon as Hannah and her parents were alone, her mother turned and clapped her hands gleefully. “Helen agrees that we should hire a wedding coordinator. I couldn’t be more pleased. She suggested we talk to Wanda Thorndike.” She hugged Hannah briefly. “I’ll make an appointment with Wanda first thing in the morning.”\u003c/p\u003e\n\u003cp\u003eHannah wanted to object, to explain that she felt they were rushing matters, but she wasn’t given the opportunity.\u003c/p\u003e\n\u003cp\u003e“I overheard Carl suggest that he and Hannah pick out engagement rings right after the first of the year.”\u003c/p\u003e\n\u003cp\u003e“David,” her mother said, sighing, “you can’t imagine everything we need to consider for a large wedding.”\u003c/p\u003e\n\u003cp\u003e“We haven’t picked a date yet,” Hannah reminded her family, dread weighing down her words.\u003c/p\u003e\n\u003cp\u003e“My dear, you’re as naive as Helen and I were about all this. The wedding coordinator will be the one to choose that. She’ll know what’s available and when. Personally I’d prefer a June wedding. You should be a traditional June bride, but that’s barely six months away, and I don’t know if we could manage it in that time. One thing I’m going to have to insist we do right away, and that’s shop for your dress.”\u003c/p\u003e\n\u003cp\u003e“Mom—”\u003c/p\u003e\n\u003cp\u003e“Helen was telling me it sometimes takes as long as six months to have a dress made and delivered.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“I know, darling, we’re throwing a lot at you. Just be patient.” Humming happily to herself, Ruth Morganstern returned to the kitchen and the wedding brochures she’d pored over only moments earlier.\u003c/p\u003e\n\u003cp\u003eHannah’s father chuckled. “I don’t know when I’ve last seen your mother so pleased. This wedding has given her a renewed lease on life.”\u003c/p\u003e\n\u003cp\u003eHannah couldn’t find it in her heart to disappoint them. Not then. Later, she promised herself. She’d sit down with them both and explain that she didn’t love Carl.\u003c/p\u003e\n\u003cp\u003eBy noon the following day the deli was filled with the usual lunch crowd. Her father hand-sliced pastrami into thick wedges while Hannah and her mother assembled the sandwiches.\u003c/p\u003e\n\u003cp\u003eRunners delivered orders as fast as they could be packed.\u003c/p\u003e\n\u003cp\u003eThe routine was one in which Hannah had worked most of her life. She never questioned that she would help in the deli; it was assumed.\u003c/p\u003e\n\u003cp\u003eAround two, the heavy lunch crowd had begun to thin out. Her mother returned to the kitchen to make up a fresh batch of potato salad. Her father was preoccupied with ordering supplies when Hannah looked up to discover Joshua standing on the other side of the counter.\u003c/p\u003e\n\u003cp\u003e“Joshua,” she whispered in a low rush of air. Just seeing him again had knocked the breath out of her. She couldn’t disguise her delight. Her heart went into second gear as she glanced over her shoulder to be sure no one was paying them any mind. “What are you doing here?” she asked in a whisper.\u003c/p\u003e\n\u003cp\u003e“I came for lunch.”\u003c/p\u003e\n\u003cp\u003eOf course. She reached for a pencil, prepared to take his order.\u003c/p\u003e\n\u003cp\u003eHe read the printed menu that hung on the wall behind her. “I’ll have a pastrami on rye and a cup of coffee.”\u003c/p\u003e\n\u003cp\u003eShe wrote down his order with trembling hands.\u003c/p\u003e\n\u003cp\u003e“Are you going to make it for me yourself?”\u003c/p\u003e\n\u003cp\u003eShe nodded, avoiding eye contact. She wouldn’t be able to hide how pleased she was to see him again if she looked up.\u003c/p\u003e\n\u003cp\u003e“You didn’t phone,” he whispered just loudly enough for her to hear.\u003c/p\u003e\n\u003cp\u003e“Potato is the soup of the day,” she said.\u003c/p\u003e\n\u003cp\u003e“Hannah, look at me.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“Why can’t you?”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and braced herself “You shouldn’t have come here.”\u003c/p\u003e\n\u003cp\u003e“You don’t want my business?”\u003c/p\u003e\n\u003cp\u003eHe was making this difficult.\u003c/p\u003e\n\u003cp\u003e“You’ve thought about contacting me, haven’t you?”\u003c/p\u003e\n\u003cp\u003eAgain she didn’t answer. “Would you care for a bowl of soup with your sandwich?”\u003c/p\u003e\n\u003cp\u003eHe didn’t respond for a number of seconds, and then, “The only thing I want is you, Hannah.”\u003c/p\u003e\n\u003cp\u003e“If you’ll take a number, I’ll have your lunch delivered.”\u003c/p\u003e\n\u003cp\u003e“Will you bring it?” he asked.\u003c/p\u003e\n\u003cp\u003eHer nod was nearly imperceptible. She saw the tension leave him and couldn’t keep from glancing up and offering him a quick smile. It took only a moment or more to finish compiling his sandwich. She carried that and a cup of coffee to his table and was pleased to note he sat as far away from the counter as possible.\u003c/p\u003e\n\u003cp\u003e“Thank you, Hannah,” he said when she placed the plate on the table. “Would you care to join me?”\u003c/p\u003e\n\u003cp\u003e“I can’t.” Her hands folded over the back of the chair across from him. She glanced over her shoulder, fearing her father would notice the two of them together.\u003c/p\u003e\n\u003cp\u003e“Is that your father?” Joshua asked, looking around her.\u003c/p\u003e\n\u003cp\u003e“Yes. Mom’s in the kitchen.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t look like the kind of man who would force his daughter into a loveless marriage.”\u003c/p\u003e\n\u003cp\u003e“Joshua, please.”\u003c/p\u003e\n\u003cp\u003eHe picked up the sandwich, and once again, Hannah looked back to make sure no one was watching her. “I sometimes walk by the pond in Central Park,” she whispered.\u003c/p\u003e\n\u003cp\u003eJoshua went still. “When?”\u003c/p\u003e\n\u003cp\u003e“I was thinking of taking a stroll there this afternoon.”\u003c/p\u003e\n\u003cp\u003e“In an hour?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eJoshua’s handsome face broke into a wide grin. “I’ve always favored walking as an excellent form of exercise.”\u003c/p\u003e\n\u003cp\u003eEleven\u003c/p\u003e\n\u003cp\u003e“Are you sure you’re up to this?” Trey asked Jenny for the third time since they’d boarded the ferry headed for Ellis Island.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have suggested sight-seeing if I wasn’t feeling better,” Jenny insisted. They stood and watched as the New York skyline began to fade into the distance. “I want you to visit Ellis Island,” she continued. “It’s an emotional experience, at least it was for me the first time I made the trip. I found my great-grandfather’s name there.”\u003c/p\u003e\n\u003cp\u003e“Your great-grandfather? How?”\u003c/p\u003e\n\u003cp\u003e“I looked his name up on the computer. It showed me the year he arrived from Germany and his age at the time. I felt as though I’d stumbled upon an open treasure chest, only this one contained a part of my heritage.”\u003c/p\u003e\n\u003cp\u003e“This was your mother’s grandfather?”\u003c/p\u003e\n\u003cp\u003eJenny answered him with a quick nod. “Can you imagine packing everything you own in this world in a single suitcase?” she asked, awed by the raw courage and grit her great-grandfather had shown when he was little more than a teenager. “He came to America with nothing but his dreams and the desire for a new life.”\u003c/p\u003e\n\u003cp\u003e“Is that so unusual?” Trey asked.\u003c/p\u003e\n\u003cp\u003e“Of course it is,” she answered, feeling slightly offended that Trey didn’t recognize the fortitude and faith her great-grandfather had demonstrated. “He didn’t have an easy life here, you know. First off he didn’t speak the language, and although he was well educated he was forced into taking a menial job. For years he and my great-grandmother struggled to make a decent life for themselves and their family. I can’t tell you how much I admire them for that.”\u003c/p\u003e\n\u003cp\u003e“What you did, leaving Montana for a chance on Broadway, wasn’t all that different.”\u003c/p\u003e\n\u003cp\u003e“Me?” Jenny didn’t see the correlation. Of course there was the obvious one, but her great-grandfather had come to America friendless and without the loving support of his family.\u003c/p\u003e\n\u003cp\u003e“As I recall, when you left Custer you went with a solitary suitcase. You came to the Big Apple without a job, with little money, and with only your dreams to feed you.”\u003c/p\u003e\n\u003cp\u003e“True,” she admitted reluctantly, not wanting Trey to continue comparing her with her great-grandfather. Not when she fell so far short.\u003c/p\u003e\n\u003cp\u003eTrey placed his hand on her shoulder. “It hasn’t been easy for you, has it?” he asked gently.\u003c/p\u003e\n\u003cp\u003eHe didn’t know the half of it. Jenny turned her face into the wind and let the breeze off the Hudson River buffet against her. The thickness in her throat tightened to painful proportions, and she knew she dared not try to talk. Trey had tried to paint her as some kind of heroine, seeking her way in a new world. In retrospect, Jenny wasn’t sure she’d done the right thing to leave Montana. She wasn’t sure she was cut out for life in the city. In three years she’d never managed to feel at home in New York. \u003c/p\u003e","sourceLink":"https://allnovel.net/touched-by-angels-angels-everywhere-3/page-25.html","bookId":2627,"creation":"Oct 5, 2019 10:08:06 PM","modification":"Oct 5, 2019 10:08:06 PM"}
