{"id":101825,"no":37,"title":"Page 37","content":"\u003cp\u003eSylvia swayed gently in the oak rocker and sipped her tea. A soft creaking noise eked up from the hardwood floor beneath the braided rug.\u003c/p\u003e\n\u003cp\u003e“It’s about Carl and me,” Hannah said after a long while. She stood and walked over to the fireplace, where a gentle flame flickered over the logs. After running her hand against the top of the mantel, she turned and faced her grandmother.\u003c/p\u003e\n\u003cp\u003e“I guessed all this involved Carl.”\u003c/p\u003e\n\u003cp\u003eHannah smiled to herself, appreciating Sylvia’s insight. She sat on the braided rug next to her grandmother. Sylvia’s hand stroked the top of Hannah’s head.\u003c/p\u003e\n\u003cp\u003e“I’ve been praying for you for a good many years, Hannah. Long before you were born, I asked God if He would see fit to give my son a child, and He gave us you.”\u003c/p\u003e\n\u003cp\u003eIt was a story Hannah had heard often. Her childless parents had longed desperately for a baby. The doctors had told them it would take a miracle.\u003c/p\u003e\n\u003cp\u003eLike Hannah in the story of Samuel, a familiar one in the Bible, her mother and family had prayed diligently for a child. Samuel’s mother, like her own, had wept and pleaded with God in the temple with such anguish that Eli, the priest, had assumed she was drunk. When she spoke of her longing for a son, Eli had assured her that God had heard her prayer and that in a year’s time she would have a son.\u003c/p\u003e\n\u003cp\u003eAfter nearly twenty years of marriage, Ruth had conceived, and the Morganstern family had rejoiced. When David learned his wife was pregnant, he’d been the one to decide on his daughter’s name. Hannah had been named after Elkanah’s wife, whose faith had been richly rewarded.\u003c/p\u003e\n\u003cp\u003eAll her life Hannah had been loved and cherished. That was what made disappointing her family so difficult.\u003c/p\u003e\n\u003cp\u003e“Through the years, I have continued to pray for you,” Sylvia went on. “As you entered your teen years, I added your husband to my list.”\u003c/p\u003e\n\u003cp\u003e“My husband?”\u003c/p\u003e\n\u003cp\u003e“The man you would marry. It seemed to me that God in his almighty wisdom would choose an extraordinary man for you. A man of character, a man of wisdom and discernment. A man who would love you with all his heart.”\u003c/p\u003e\n\u003cp\u003eHer grandmother’s gentle words caused Hannah’s throat to thicken with tears. “I don’t love Carl,” she whispered brokenly.\u003c/p\u003e\n\u003cp\u003eSylvia’s hand didn’t pause as she continued to stroke Hannah’s crown. “I realized that almost immediately. You’ve met someone else, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes, and Grandma, he’s a good man, just the way you say. I can’t tell you how fortunate I feel to even know him. I love him so much that it frightens me. . . . I’m so afraid I’m going to lose him.”\u003c/p\u003e\n\u003cp\u003e“He loves you?”\u003c/p\u003e\n\u003cp\u003eHannah nodded. The knowledge should have filled her with an incredible sense of wonder that a man as wonderful as Joshua would care for her.\u003c/p\u003e\n\u003cp\u003e“Then why would you lose him?” her grandmother questioned.\u003c/p\u003e\n\u003cp\u003e“Because of Carl.”\u003c/p\u003e\n\u003cp\u003eIt was as if Sylvia had forgotten Hannah were engaged to the other man. “Ah yes, Carl.”\u003c/p\u003e\n\u003cp\u003e“Carl’s a good man,” Hannah whispered. She didn’t want to hurt him, either.\u003c/p\u003e\n\u003cp\u003e“Carl’s a fine young man, but he’s not the one for you.”\u003c/p\u003e\n\u003cp\u003e“Joshua is.” There was no doubt in Hannah’s mind about that.\u003c/p\u003e\n\u003cp\u003e“Joshua,” Sylvia repeated slowly, as if testing the name on her tongue. She shook her head once and said decisively, “If you love him the way you claim, then you have nothing to fear.”\u003c/p\u003e\n\u003cp\u003e“But everyone expects me to marry Carl. You saw what happened, how we were pressured into setting a date for the wedding.”\u003c/p\u003e\n\u003cp\u003eHer grandmother said nothing, which increased Hannah’s guilt.\u003c/p\u003e\n\u003cp\u003e“I wanted to break the engagement,” Hannah said all at once, running the words together. She didn’t think it was fair to tell her grandmother that Carl had recently lost his job; the fewer who knew, the better. The best way to handle it was to be diplomatic, she decided.\u003c/p\u003e\n\u003cp\u003e“This is a bad time for Carl,” she offered. “He’s under a lot of pressure right now. I wanted to tell him about meeting Joshua. I’ve tried—honest, I have—but something always happens. For a long time I figured that it was too late for Joshua and me. I even tried not to see him again.”\u003c/p\u003e\n\u003cp\u003e“That wouldn’t have worked.”\u003c/p\u003e\n\u003cp\u003eHannah glanced up at her grandmother, wondering at the strength and conviction in the older woman’s words.\u003c/p\u003e\n\u003cp\u003e“You and Joshua were meant to be together,” Sylvia elaborated.\u003c/p\u003e\n\u003cp\u003eHannah rested her head against her grandmother’s knee. “Joshua came into the deli this afternoon.”\u003c/p\u003e\n\u003cp\u003e“David knows him?”\u003c/p\u003e\n\u003cp\u003e“He’s a frequent customer.”\u003c/p\u003e\n\u003cp\u003e“Then he knows good food when he tastes it.”\u003c/p\u003e\n\u003cp\u003eHannah smiled.\u003c/p\u003e\n\u003cp\u003e“Tell me what happened,” Sylvia encouraged.\u003c/p\u003e\n\u003cp\u003e“Joshua wanted to talk to me, but it was impossible there. I’m sure he was about to suggest that we meet elsewhere—we’ve done it before—but he didn’t get the chance.\u003c/p\u003e\n\u003cp\u003e“Somehow Joshua and Dad got involved in a conversation, and then Dad told him that Carl and I had set the wedding date. He actually invited Joshua to the wedding.”\u003c/p\u003e\n\u003cp\u003eHer grandmother sighed heavily. “I don’t imagine Joshua was pleased.”\u003c/p\u003e\n\u003cp\u003e“He looked so hurt.” That was the only way she could think to describe the anguish she’d witnessed in Joshua’s eyes. “He congratulated me, and before I had a chance to explain, he left the deli. I got away as soon as I could and hurried to his office, but he wasn’t there and his secretary couldn’t tell me when he’d be back. I’ve got to talk to him.” She squeezed her eyes shut, berating herself silently.\u003c/p\u003e\n\u003cp\u003e“What would you have said if he had been at his office?” her grandmother questioned.\u003c/p\u003e\n\u003cp\u003e“I longed to explain how Carl and I had been coerced into picking a date for the wedding.”\u003c/p\u003e\n\u003cp\u003e“Do you think that was what he wanted to hear?”\u003c/p\u003e\n\u003cp\u003e“No,” Hannah murmured miserably. “He wants to hear that I’ve told Carl about us. He needs to know that I’ve broken off the engagement, and that my family’s been told that I won’t be marrying Carl.”\u003c/p\u003e\n\u003cp\u003e“My guess is that he’d be willing to speak to your parents with you.”\u003c/p\u003e\n\u003cp\u003eHannah dreaded telling her parents most. She’d never considered having Joshua stand with her and immediately knew that he would want to be there. He’d never ask her to confront her family alone.\u003c/p\u003e\n\u003cp\u003eWith an energy that had escaped her earlier, she leapt to her feet. “I’ve got to talk to him.”\u003c/p\u003e\n\u003cp\u003e“Joshua?” her grandmother asked.\u003c/p\u003e\n\u003cp\u003e“No, Carl. I can’t worry about his feelings any longer. He doesn’t need me to hold his hand.”\u003c/p\u003e\n\u003cp\u003e“Good girl.” Her grandmother’s face beamed with pride.\u003c/p\u003e\n\u003cp\u003e“Joshua is the man I love, he deserves my loyalty. As soon as I’ve talked to Carl, I’ll speak to Joshua.”\u003c/p\u003e\n\u003cp\u003eSylvia looked well pleased. “That, my dear, sounds like a plan.”\u003c/p\u003e\n\u003cp\u003eThe anger inside Roberto simmered just below the exploding point. His patience was gone, his temper unreasonable, his mood black. He’d probably offended every customer he’d dealt with in the last couple of days. Matters would improve drastically, he realized, if he could stop thinking about Brynn. But that seemed impossible.\u003c/p\u003e\n\u003cp\u003eHe wished to hell she’d leave. Pack her bags, hand in her resignation, and go back where she belonged. Because she sure as hell didn’t fit in this neighborhood. A delicate, beautiful rosebud among thistles.\u003c/p\u003e\n\u003cp\u003eThe only way to convince her he wanted nothing more to do with her was to shove her out of his life. His chest ached with a crippling tightness for all that he’d lost. He hadn’t meant to do it then and there, but she’d forced his actions, coming to him the way she had.\u003c/p\u003e\n\u003cp\u003eModesto’s injuries had convinced him of the terrible risk Brynn was taking working in this neighborhood. She was an easy target. Too easy. She refused to listen to reason and defied him at every turn. Fine. She could do as she damn well pleased, but he would have no part of it. Or her.\u003c/p\u003e\n\u003cp\u003eIf she wanted to sacrifice herself over a bunch of screwy, idealistic goals, so be it. But he wasn’t standing by idly to watch her fall on her face. Nor would he be there to pick up the pieces.\u003c/p\u003e\n\u003cp\u003eFor her own good, she had to leave this neighborhood, and she wouldn’t as long as he encouraged her to remain. That was exactly what their relationship was doing.\u003c/p\u003e\n\u003cp\u003eIt was over, and nothing would change his mind. Not this time. Not with Modesto in the hospital, a bullet hole in his chest, and his brother screaming with nightmares.\u003c/p\u003e\n\u003cp\u003eRoberto heard a movement behind him and glanced over his shoulder to find Emilio standing just inside the garage.\u003c/p\u003e\n\u003cp\u003e“You gonna bite my head off?” Emilio asked.\u003c/p\u003e\n\u003cp\u003e“That depends on what you want.”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Then what are you doing here?” Roberto threw a wrench toward the work bench. It landed with a discordant clanking sound. He never abused his tools, but then there was a first time for everything. A first time to fall in love. A first time to turn his back and run from what he wanted most.\u003c/p\u003e\n\u003cp\u003e“I’m bored,” Emilio confessed. “I thought it’d be fun to stay home.”\u003c/p\u003e\n\u003cp\u003e“Then go back to school,” Roberto said without emotion. He hadn’t changed his mind about education, but he was willing to agree that Brynn might have a point. For a long time he’d thought Emilio would work with him at the garage. He could teach his brother, and the two of them could be partners. But Emilio didn’t have the knack for working on cars. He liked people, liked being around them.\u003c/p\u003e\n\u003cp\u003e“I don’t want to go to school,” his brother confessed, walking all the way into the garage. He planted the tips of his fingers in his jeans pockets. This was the stance he chose when he had something to hide. His brother tended to be transparent about such things, and frankly, Roberto was grateful.\u003c/p\u003e\n\u003cp\u003eUnwilling to reveal he knew something was amiss, Roberto continued to work on the car, removing the carburetor from an engine. “I thought you liked your classes.”\u003c/p\u003e\n\u003cp\u003eEmilio shrugged. “The best are the ones Miss Cassidy teaches. She makes learning fun, but she isn’t an easy teacher. Sometimes after school me and the others talk about her.”\u003c/p\u003e\n\u003cp\u003eRoberto stiffened, then asked nonchalantly, “What do you have to say?” Emilio and the other boys in the class weren’t blind. Brynn was as beautiful as she was naive.\u003c/p\u003e\n\u003cp\u003e“She talks about things that make a person think, about war and prejudice, and stuff like that. Just about every day she gives us a writing assignment and then has us read what we wrote and talk about it.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003eEmilio’s eyes brightened as he spoke. “We’re reading this book about Anne Frank. She was this Jewish girl, who—”\u003c/p\u003e\n\u003cp\u003e“I know who Anne Frank is.”\u003c/p\u003e\n\u003cp\u003e“You do?” This appeared to impress Emilio. “Well, Miss Cassidy asked us to pretend we were the ones in hiding. To share this compact space with another family, to live in constant fear of discovery.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And we did, and then she had some of us read what we’d written, and I was surprised, you know, by how she tied it in to what’s going on in our world today. Social issues and that sort of thing. The guys and me sometimes talk about the same things we did in class. I don’t do that with any of my other subjects.” \u003c/p\u003e","sourceLink":"https://allnovel.net/touched-by-angels-angels-everywhere-3/page-37.html","bookId":2627,"creation":"Oct 5, 2019 10:08:06 PM","modification":"Oct 5, 2019 10:08:06 PM"}
