{"id":69710,"no":47,"title":"Page 47","content":"\u003cp\u003eKELLY AND DIANE were finishing getting dressed when Grace Seidel knocked at their door.\u003c/p\u003e\n\u003cp\u003e\"Breakfast is ready whenever you are.\"\u003c/p\u003e\n\u003cp\u003e\"Coming,\" Kelly called out.\u003c/p\u003e\n\u003cp\u003eDiane said, \"I hope our little stunt worked. Let\u0027s see if Grace has a morning newspaper.\" They stepped out of their room. To the right was the recreation area. A few people were gathered around the television set. As Kelly and Diane started to pass it, to go to the dining room, a television anchorman was saying:\u003c/p\u003e\n\u003cp\u003e\"And according to reports, there were no survivors. Tanner Kingsley and former senator Pauline Van Luven were on the plane, along with a pilot, copilot, and a steward.\" The two women froze. They looked at each other, turned, and walked up to the television set. On the screen were pictures of the exterior of KIG.\u003c/p\u003e\n\u003cp\u003eKingsley International Group constitutes the largest think tank in the world, with offices in thirty countries. The weather bureau has reported an unexpected electrical storm in the South Pacific area where Tanner Kingsley\u0027s private plane was flying. Pauline Van Luven was the former head of the Senate Select Committee on the Environment.\u003c/p\u003e\n\u003cp\u003eDiane and Kelly were listening, fascinated \"?And in another piece of the puzzle, there\u0027s a mystery here that the police are trying to solve.\u003c/p\u003e\n\u003cp\u003eThe press was invited to a dinner party, to visit Prima, a new weather control computer that KIG developed, but yesterday there was an explosion at KIG and Prima was completely destroyed. The fire department found the body of Andrew Kingsley in the wreckage and believe he was the only victim.\u003c/p\u003e\n\u003cp\u003eDiane said, \"Tanner Kingsley is dead.\"\u003c/p\u003e\n\u003cp\u003e\"Say that again. Slowly.\"\u003c/p\u003e\n\u003cp\u003e\"Tanner Kingsley is dead.\" Kelly breathed a deep sigh of relief. She looked at Diane and smiled. \"Life is sure going to be dull after this.\" \"I hope so,\" Diane replied. \"How would you like to sleep at the Waldorf-Astoria Towers tonight?\" Kelly grinned. \"I wouldn\u0027t mind.\" When they said their good-byes to Grace Seidel, she hugged Kelly and said,\u003c/p\u003e\n\u003cp\u003e\"Anytime.\" She never mentioned the money that she had been offered.\u003c/p\u003e\n\u003cp\u003eIN THE PRESIDENTIAL suite in the Waldorf Towers, a waiter was setting a table for dinner.\u003c/p\u003e\n\u003cp\u003eHe turned to Diane. \"Did you say you wanted it set for four?\" \"That\u0027s right.\" Kelly looked at her and said nothing.\u003c/p\u003e\n\u003cp\u003eDiane knew what she was thinking. As they were sitting down at the table, Diane said, \"Kelly, I don\u0027t think we did this alone. I think we had a little help.\" She raised her glass of champagne and said to the empty chair next to her,\u003c/p\u003e\n\u003cp\u003e\"Thank you, Richard, darling. I love you.\" As she lifted the glass to her lips, Kelly said, \"Wait a minute.\" Diane turned to her.\u003c/p\u003e\n\u003cp\u003eKelly picked up her glass of champagne and looked at the empty chair next to her. \"Mark, I love you so much. Thank you.\" They drank their toasts.\u003c/p\u003e\n\u003cp\u003eKelly smiled and said, \"That felt good. Well, what\u0027s next?\" \"I\u0027m going to the FBI in Washington and tell them what I know.\" Kelly corrected her. \"We\u0027re going to Washington and tell them what we know.\" Diane nodded. \"Right.\" She said thoughtfully, \"I think we did a good job. Our husbands would be proud of us.\" \"Yeah,\" Kelly said. \"We\u0027ve solved this. And look at the odds against us. You know what we should do now?\" \"What?\" \"Start our own detective agency.\" Diane laughed. \"You\u0027re kidding.\" Kelly gave her a long, slow smile. \"Am I?\"\u003c/p\u003e\n\u003cp\u003eAFTER DINNER, THEY watched television, and every channel was carrying the story of Tanner Kingsley\u0027s death. As Kelly watched, she said thoughtfully, \"You know, when you cut off a snake\u0027s head, the rest of the snake dies.\" \"What does that mean?\" \"Let\u0027s find out.\" Kelly walked over to the telephone. \"I want to place a call to Paris.\" Five minutes later, she heard the voice of Nicole Paradis. \"Kelly! Kelly! Kelly!\u003c/p\u003e\n\u003cp\u003eI\u0027m so glad you called.\" Kelly\u0027s heart sank. She knew what she was going to hear next. They had killed Angel.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know how to reach you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve heard the news?\" \"The whole world has heard the news. Jerome Malo and Alphonse Girouard packed their things and left in a hurry.\" \"And Philippe and his family?\" \"They are returning tomorrow.\" \"That\u0027s wonderful.\" Kelly was afraid to ask the next question. \"And Angel-?\" \"I have Angel in my apartment. They were planning to use her as bait in case you wouldn\u0027t cooperate.\" Kelly felt a sudden glow. \"Oh, that\u0027s wonderful!\" \"What would you like me to do with her?\" \"Put her on the next Air France flight to New York. Let me know when she\u0027ll arrive and I\u0027ll pick her up at the airport. You can call me here at the Waldorf Towers.\" \"I\u0027ll take care of it.\" \"Thank you.\" Kelly replaced the receiver.\u003c/p\u003e\n\u003cp\u003eDiane had been listening. \"Angel is all right?\" \"Yes.\" \"Oh, that\u0027s great!\" \"Isn\u0027t it? I\u0027m thrilled. By the way, what are you going to do with your half of the money?\" Diane looked at her. \"What?\" \"KIG put up a five-million-dollar reward. I think it\u0027s coming to us.\" \"But Kingsley\u0027s dead.\" \"I know, but KIG isn\u0027t.\" They laughed.\u003c/p\u003e\n\u003cp\u003eKelly asked, \"What\u0027s your plan after we go to Washington? Are you going to start painting again?\" Diane was thoughtful for a moment. \"No.\" Kelly was watching her. \"Really?\" \"Well, there is a painting that I want to do. It\u0027s a picnic scene in Central Park.\" Her voice broke.\u003c/p\u003e\n\u003cp\u003e\"Two lovers having a picnic in the rain. Then?we\u0027ll see. What about you?\u003c/p\u003e\n\u003cp\u003eAre you going back to modeling?\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think-\"\u003c/p\u003e\n\u003cp\u003eDiane was looking at her.\u003c/p\u003e\n\u003cp\u003e\"Well?maybe, because while I\u0027m on the runway, I can imagine Mark watching me, and blowing kisses. Yes, I think he would want me to go back to work.\" Diane smiled. \"Good.\" They watched television for another hour, and then Diane said, \"I think it\u0027s time for bed.\" Fifteen minutes later, they were undressed and in their queen beds, both reliving their recent adventures.\u003c/p\u003e\n\u003cp\u003eKelly yawned. \"I\u0027m sleepy, Diane. Let\u0027s turn out the lights.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/are-you-afraid-of-the-dark/page-47.html","bookId":2370,"creation":"Oct 5, 2019 10:14:00 AM","modification":"Oct 5, 2019 10:14:00 AM"}
