{"id":66600,"no":41,"title":"Page 41","content":"\u003cp\u003e“What if you don’t get those answers?” Olivia asked gently.\u003c/p\u003e\n\u003cp\u003eGrace had considered that, too. It was a very real possibility. Dan didn’t seem willing to tell her why he’d left—not to her face, at any rate. Perhaps that was the reason he’d decided to make a brief appearance in Cedar Cove. He’d wanted to be seen. Perhaps he was telling her he’d gotten on with his life and now she should do the same.\u003c/p\u003e\n\u003cp\u003e“If I don’t get any answers, I’ll deal with it just as I have everything else.”\u003c/p\u003e\n\u003cp\u003eOlivia shook her head admiringly. “You’re a brave woman, Grace Sherman.”\u003c/p\u003e\n\u003cp\u003eGrace didn’t view herself that way but accepted the compliment. “Hey, when are we going to get some service around here?”\u003c/p\u003e\n\u003cp\u003eOlivia placed two fingers in her mouth and gave a low piercing whistle. She’d always been proud of her ability to do that—and it had certainly impressed her sons.\u003c/p\u003e\n\u003cp\u003e“Hold on!” the sixty-year old waitress shouted from the other side of the restaurant. “I’ve only got two hands.”\u003c/p\u003e\n\u003cp\u003e“Same ol’ Pancake Palace,” Grace laughed. Some things never changed, and for that she was grateful.\u003c/p\u003e\n\u003cp\u003eThe last week of June, Olivia suddenly realized she hadn’t heard from Jack Griffin in more than a month. Not since she’d returned from California. It wasn’t until she started planning her mother’s birthday celebration that she noticed it’d been so long. Between her work in family court, the problems with Justine, James’s new family, her mother’s obsession with Tom Houston and Grace’s troubles, Olivia had been caught up in everyone else’s life. She’d nearly forgotten she had one of her own.\u003c/p\u003e\n\u003cp\u003eHome from court early on a Monday afternoon, Olivia was in a rare domestic mood and prepared a batch of her favorite breakfast muffins, a family staple.\u003c/p\u003e\n\u003cp\u003eSince Jack hadn’t seen fit to phone her, she decided to call him. It wasn’t her habit to contact men, but this time she had a perfectly good excuse—an invitation. She didn’t have a home number, so she called him at the office.\u003c/p\u003e\n\u003cp\u003e“Jack Griffin,” he snapped, answering as soon as the receptionist had rung through.\u003c/p\u003e\n\u003cp\u003e“Hello, Jack.”\u003c/p\u003e\n\u003cp\u003e“Oh—Olivia.”\u003c/p\u003e\n\u003cp\u003eHe sounded as if she’d knocked him off-balance. “I guess you weren’t expecting me,” she said.\u003c/p\u003e\n\u003cp\u003e“You could say that.” His voice softened.\u003c/p\u003e\n\u003cp\u003eIt was probably best to get to the point right away. “Have you got plans for the fourth of July?”\u003c/p\u003e\n\u003cp\u003e“Depends,” he said cautiously. “What do you have in mind?” He didn’t wait for her to answer before he offered his own suggestion. “There’s an article I’ve been meaning to write about a nudist colony out by Home. Are you interested in tagging along?”\u003c/p\u003e\n\u003cp\u003eHer laugh was answer enough.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought.” He muttered in a resigned voice, and Olivia laughed again.\u003c/p\u003e\n\u003cp\u003e“Actually, it’s my mother’s birthday on July fourth,” she said, “and I was planning a small surprise party.”\u003c/p\u003e\n\u003cp\u003e“How small?”\u003c/p\u003e\n\u003cp\u003e“You, me and Mom.” Justine had been invited, too. She would likely make an appearance without Warren, but Olivia doubted her daughter would stay long.\u003c/p\u003e\n\u003cp\u003e“Can I get back to you?”\u003c/p\u003e\n\u003cp\u003e“By all means.” They ended the conversation soon after that, and Olivia hung up with a sense of disappointment. Perhaps she’d offended Jack, although she couldn’t imagine when or how. She’d had to cancel their last date, because of a Bar Association meeting, but he’d sounded almost relieved and she hadn’t heard from him since.\u003c/p\u003e\n\u003cp\u003eFive minutes later, the doorbell chimed. When Olivia answered, she was astonished to see Jack Griffin leaning against her doorframe, doing his damnedest to look like Cary Grant in His Girl Friday.\u003c/p\u003e\n\u003cp\u003e“Jack? What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I thought it over,” he said, grinning sheepishly. “I’d love to come to your party.”\u003c/p\u003e\n\u003cp\u003e“Great.”\u003c/p\u003e\n\u003cp\u003e“Are you going to invite me in?”\u003c/p\u003e\n\u003cp\u003e“Oh, of course.” She moved aside and he stepped into the house, following her into the kitchen, where she’d brewed a fresh pot of coffee. The muffins were just out of the oven.\u003c/p\u003e\n\u003cp\u003e“This is a family recipe,” she told him as she set a warm muffin on a plate. “Mom frequently reminds me how good bran is for the older person.” She rolled her eyes on the word older.\u003c/p\u003e\n\u003cp\u003e“Bran apple muffins? Your mother included the recipe in one of her first columns.”\u003c/p\u003e\n\u003cp\u003e“The very ones.” Olivia reached for a muffin herself and joined him at the table.\u003c/p\u003e\n\u003cp\u003e“I’m glad you called,” Jack told her. “It’s been a while since we talked.”\u003c/p\u003e\n\u003cp\u003e“You could’ve phoned me, you know.”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “I, uh, wasn’t sure that was such a good idea.”\u003c/p\u003e\n\u003cp\u003e“Why not?” she asked, her tone forthright.\u003c/p\u003e\n\u003cp\u003eHe hesitated again, weighing his words. “I know you’ve been divorced a long time, but it seemed to me—and I could be wrong—that you and your ex are—”\u003c/p\u003e\n\u003cp\u003e“Friends?”\u003c/p\u003e\n\u003cp\u003eJack’s gaze held hers. “More than friends,” he said. “Are you still in love with him, Olivia?”\u003c/p\u003e\n\u003cp\u003eIt was a question she didn’t need to consider long. “Stan and I had three children together. We’ll always be linked through them.”\u003c/p\u003e\n\u003cp\u003e“That wasn’t what I asked you.”\u003c/p\u003e\n\u003cp\u003e“I know.” She wished she could explain what she felt for her ex-husband, but her feelings were complex and something of a mystery even to her. She took a deep breath. “You’re right, we’re divorced. I do love him, but it isn’t the same kind of love we had as husband and wife.”\u003c/p\u003e\n\u003cp\u003eJack looked away as if he didn’t understand the answer. Or perhaps he did understand, but didn’t like what he’d heard. Olivia felt her words were woefully inadequate. The bond between her and Stan was more than the children they’d brought into the world, more than the child they’d buried. It was everything they’d shared. There were things they knew about each other that no one else could possibly know.\u003c/p\u003e\n\u003cp\u003eLegally they were separate. Stan had a new wife and a new family, but a court decree hadn’t completely divided their hearts.\u003c/p\u003e\n\u003cp\u003e“I don’t really get it,” Jack said, his face darkening. “Basically I’m wondering, seeing how you feel about your ex, if there’s room in your life for someone else.” He straightened and threw back his shoulders. “Actually, I should be a little more specific. Is there room for me?”\u003c/p\u003e\n\u003cp\u003e“That shouldn’t be such a difficult question to answer,” Jack muttered, when she didn’t speak right away.\u003c/p\u003e\n\u003cp\u003e“It isn’t,” she tried to assure him. “I’d very much like there to be.”\u003c/p\u003e\n\u003cp\u003eHe stared at her. “Really?”\u003c/p\u003e\n\u003cp\u003eOlivia laughed. She found Jack Griffin smart and funny and in some ways almost childlike in his enthusiasm, his sense of adventure. She loved the spontaneity she saw in him.\u003c/p\u003e\n\u003cp\u003e“I like you, Jack.”\u003c/p\u003e\n\u003cp\u003eHe beamed at her. “I like you, too. A lot. It’s probably not good strategy to admit it at this early stage, but what the hell do I know about strategy anyway?” Having said that, he leaned forward and kissed her.\u003c/p\u003e\n\u003cp\u003eOlivia was sure his original intention had been a friendly peck, a short kiss to seal this new understanding. However the moment their lips met, moist and warm with freshly brewed coffee, the kiss became…real. Passionate. Jack wove his fingers into her hair and he rose to his feet to lean closer. Olivia reached for him.\u003c/p\u003e\n\u003cp\u003eThe intensity of the kiss heightened as his mouth expertly molded against hers. It’d been years since a man had touched her like this. She’d ignored that sensual part of her, let it grow dormant, and now Jack had brought it back to life.\u003c/p\u003e\n\u003cp\u003eA discordant sound drifted toward her, and Jack abruptly broke off the kiss. “Someone’s coming,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Mom!”\u003c/p\u003e\n\u003cp\u003eOlivia jerked back and nearly fell off her chair. “Justine.”\u003c/p\u003e\n\u003cp\u003e“Oh, hi.” Justine stood framed in the kitchen doorway. She looked sharply from Olivia to Jack. “I’m not interrupting anything, am I?”\u003c/p\u003e\n\u003cp\u003e“No!” Olivia shouted. “I mean…” She glanced at Jack and—damn it all—blushed.\u003c/p\u003e\n\u003cp\u003eTo her surprise, her daughter laughed. “Honestly, Mom, it’s no big deal. If you two want to continue whatever you were doing, go ahead, with my blessing. I’ll come back at a more convenient time.”\u003c/p\u003e\n\u003cp\u003e“Ah…”\u003c/p\u003e\n\u003cp\u003e“I think I should leave,” Jack said. He kissed Olivia’s cheek. “See you on the fourth. Do you want me to bring anything?”\u003c/p\u003e\n\u003cp\u003eHer mind a blank, Olivia shook her head. For the life of her she couldn’t remember what they were doing on the fourth. Oh, yes, her mother’s birthday.\u003c/p\u003e\n\u003cp\u003eJack sidled past Justine, and whistling a catchy tune, let himself out of the house.\u003c/p\u003e\n\u003cp\u003e“Mother,” her daughter said, arms folded. “I’m shocked.” Her delight was unmistakable.\u003c/p\u003e\n\u003cp\u003e“Don’t act so amused. I’m not as old as you think.”\u003c/p\u003e\n\u003cp\u003e“I know that,” Justine assured her, “but I wasn’t sure you were aware of it.”\u003c/p\u003e\n\u003cp\u003eOlivia stood on feet that felt a little unsteady. Jack’s kiss had shaken her more than she cared to admit. She walked over to the coffeepot and refilled her cup, then automatically poured one for her daughter. What had prompted this visit, Olivia couldn’t even guess.\u003c/p\u003e\n\u003cp\u003e“So how long have you and Jack been involved?”\u003c/p\u003e\n\u003cp\u003e“We’re not.”\u003c/p\u003e\n\u003cp\u003e“He was at the house when you returned from California, remember?” Justine reminded her.\u003c/p\u003e\n\u003cp\u003e“Yes, I know.” She hated the way these questions flustered her. Nothing had been settled between her and Jack. Not really. Okay, so they’d agreed to start seeing each other, but it was too early to know how significant their relationship would become.\u003c/p\u003e\n\u003cp\u003e“I asked Jack then, and he claimed you were only friends. Foolish me, I believed him.”\u003c/p\u003e\n\u003cp\u003eJustine certainly seemed to be enjoying this.\u003c/p\u003e\n\u003cp\u003e“We are friends.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” her daughter teased.\u003c/p\u003e\n\u003cp\u003e“Justine!”\u003c/p\u003e\n\u003cp\u003e“Friends and then some.”\u003c/p\u003e\n\u003cp\u003eOlivia shook her head. “All right, if you must know…this is a recent development.”\u003c/p\u003e\n\u003cp\u003e“How recent?”\u003c/p\u003e\n\u003cp\u003eOlivia peered at her watch. “Twenty minutes.”\u003c/p\u003e\n\u003cp\u003e“Mother!”\u003c/p\u003e\n\u003cp\u003e“It’s true.” And Olivia felt good about it. Optimistic. No way of knowing what would happen, of course, especially as they hadn’t yet defined their relationship. But she couldn’t help wondering where the kissing would’ve led if they hadn’t been interrupted.\u003c/p\u003e\n\u003cp\u003e“Enough about me,” Olivia said abruptly. “To what do I owe this unexpected visit?”\u003c/p\u003e\n\u003cp\u003e“Well,” Justine said, sinking down in the chair recently vacated by Jack, “I came to see what you had planned for Grandma’s birthday.”\u003c/p\u003e\n\u003cp\u003eThat was only an excuse; Justine could easily have asked over the phone. “I thought we’d have a small picnic.”\u003c/p\u003e\n\u003cp\u003e“Waterfront Park?” \u003c/p\u003e","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-41.html","bookId":1941,"creation":"Oct 5, 2019 10:01:42 AM","modification":"Oct 5, 2019 10:01:42 AM"}
