{"id":66601,"no":42,"title":"Page 42","content":"\u003cp\u003e“I hadn’t decided where, but that sounds like a good idea.” Her mother’s home was within walking distance of the waterfront area, and there’d be a lot of festivities there on the fourth. “Can you come?”\u003c/p\u003e\n\u003cp\u003e“I should be able to drop by for an hour or so.”\u003c/p\u003e\n\u003cp\u003eNot looking at Justine, she reached for her muffin. “Will Warren be with you?”\u003c/p\u003e\n\u003cp\u003e“Probably not, but we’re still seeing each other.”\u003c/p\u003e\n\u003cp\u003eOlivia was afraid of that. More than anything she wanted to ask her daughter what the future held for her and Warren, but she dared not say anything that would upset the delicate balance of her relationship with Justine.\u003c/p\u003e\n\u003cp\u003e“The truth is, Warren and I haven’t been getting along lately.”\u003c/p\u003e\n\u003cp\u003eIn one way, Olivia was glad to hear that, although she chastised herself for such an ungenerous reaction; in another way, she was distressed by Justine’s evident unhappiness. If Warren was what she really wanted…“Any reason?” she asked carefully.\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know.” Justine exhaled sharply. “We’re different people.”\u003c/p\u003e\n\u003cp\u003eDifferent generations, too, but Olivia didn’t mention that. “You might want to remember what attracted you when you first started seeing each other.”\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking about that a lot lately.” Her hands cradled the coffee mug. “I was drawn to him right away—he was so polished and successful. I’d dated other men and they were always pressuring me, wanting more from the relationship.” She hesitated. “That’s probably an oversimplification.” Lifting her mug, she stared at the coffee and then lowered it to the table without taking a drink. “Actually, I was the one to blame for past dating failures. I don’t want a long-term committment or a family.” She stared at Olivia. “I’ve told you that before. I know it upset you, and I’m sorry, but it’s the truth.”\u003c/p\u003e\n\u003cp\u003e“Warren’s already been married,” Olivia said, wanting to keep Justine talking, hoping that as her thoughts emerged, she’d gain insight into her daughter’s emotions.\u003c/p\u003e\n\u003cp\u003e“Actually, he’s been married three times.”\u003c/p\u003e\n\u003cp\u003eOlivia had only known about two of his former marriages, but wisely refrained from comment.\u003c/p\u003e\n\u003cp\u003e“His children are raised.”\u003c/p\u003e\n\u003cp\u003eFrom what she’d heard, Warren Saget had a daughter four years younger than Justine.\u003c/p\u003e\n\u003cp\u003e“In other words, he wouldn’t be interested in starting a second family.”\u003c/p\u003e\n\u003cp\u003e“Yeah, you could say that.”\u003c/p\u003e\n\u003cp\u003eOlivia merely nodded.\u003c/p\u003e\n\u003cp\u003e“Warren represents safety and security to me,” Justine said in a low, serious voice. “It’s comfortable being with him. It seemed that everything I objected to in other relationships isn’t a problem for him. He’s always been good to me and I didn’t need to worry about…you know.”\u003c/p\u003e\n\u003cp\u003eOlivia wasn’t sure she did, but again she held her tongue. “You’re looking sad.” Reaching over, she stroked the side of her daughter’s face.\u003c/p\u003e\n\u003cp\u003e“I am sad,” Justine repeated as though this was a revelation. “That’s exactly what I am.”\u003c/p\u003e\n\u003cp\u003eOlivia searched for something comforting to say, some wisdom she could pass on to her daughter. Unfortunately her mind was a blank. Every day she sat in court and issued judgments that would alter the way families lived their lives. But when it came to her own child, Olivia was at a loss.\u003c/p\u003e\n\u003cp\u003e“Have you decided to break it off?”\u003c/p\u003e\n\u003cp\u003eIt was the wrong thing to ask. Justine instantly bristled. “That’s what you’d like, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“No,” Olivia responded, sorry now that she’d said a word. “Whatever happens between you and Warren is your business. It’s obvious that you care for him.”\u003c/p\u003e\n\u003cp\u003e“I do. Sometimes he irritates me, and then sometimes he’s so kind and thoughtful…. I know what you think, Mom, what everyone thinks, but Warren’s got his insecurities, just like most people. And in his own way, he loves me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure that’s true.”\u003c/p\u003e\n\u003cp\u003eJustine stood and deposited her coffee cup in the sink, as though preparing to leave. “Thanks, Mom, I feel better.”\u003c/p\u003e\n\u003cp\u003eWell, that was good, but Olivia felt confused. She had no idea what the visit had been about; she only knew she didn’t want it to end. “Isn’t your class reunion coming up shortly?”\u003c/p\u003e\n\u003cp\u003e“Next month,” Justine mumbled, reaching for her car keys. “I doubt Seth will be there in case you’re wondering.”\u003c/p\u003e\n\u003cp\u003e“I’m not,” Olivia lied. “But…why not?” she asked, surprised that her daughter had voluntarily brought up the other man’s name. Generally Justine went out of her way to avoid the subject of Seth Gunderson.\u003c/p\u003e\n\u003cp\u003e“He’s in Alaska, and this is his busiest time of year. He won’t be able to take four or five days off and fly home for a class reunion.”\u003c/p\u003e\n\u003cp\u003e“Perhaps not,” Olivia agreed mildly.\u003c/p\u003e\n\u003cp\u003eThen out of the blue, Justine looked her square in the eye and blurted out, “Falling in love with Seth would be a terrible risk.”\u003c/p\u003e\n\u003cp\u003e“Why is that?”\u003c/p\u003e\n\u003cp\u003e“Oh, Mom, think about it. I have nothing in common with him. He’s just the type of man I want to avoid. He’s a fisherman—that’s a dead-end career if there ever was one. Besides, he lives on a boat. I have more tablecloths than he has dishes. We just don’t…mix.”\u003c/p\u003e\n\u003cp\u003e“But you’re attracted to him?”\u003c/p\u003e\n\u003cp\u003e“He makes me crazy.” She clamped her mouth shut and folded her arms tightly across her chest.\u003c/p\u003e\n\u003cp\u003e“Loving him is a risk,” Olivia repeated her daughter’s words back to her.\u003c/p\u003e\n\u003cp\u003eJustine groaned. “I know that, Mother.”\u003c/p\u003e\n\u003cp\u003e“Oh, Justine,” she whispered, hugging her daughter. “Think about it. Everything of value in life involves risk.”\u003c/p\u003e\n\u003cp\u003eHer daughter pressed her forehead against Olivia’s shoulder. “Oh, Mom, I wish I knew what to do.”\u003c/p\u003e\n\u003cp\u003e“Follow your heart.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” she whispered brokenly.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid it’ll lead me straight to Seth.”\u003c/p\u003e\n\u003cp\u003eOlivia patted her back gently, but found it impossible not to smile.\u003c/p\u003e\n\u003cp\u003eJune 25th\u003c/p\u003e\n\u003cp\u003eDearest Cecilia,\u003c/p\u003e\n\u003cp\u003eI know it’s probably a shock to get a letter from me. I’ve gotten into the habit of sending e-mails because they’re convenient and easy, and so much faster. Today, however, e-mail just seems too impersonal. It doesn’t feel right to sit down at a computer. Not today, June 25th.\u003c/p\u003e\n\u003cp\u003eYou didn’t say anything, but I’m sure Allison Marie has been on your mind. If she’d lived, we’d be celebrating her first birthday. And this year, just like last year, her daddy’s out at sea.\u003c/p\u003e\n\u003cp\u003eI don’t know if there are words enough to tell you how much I regret not being with you when Allison was born. I would’ve done anything, given everything I possess or ever will, to have the opportunity to hold my little girl just once. There’s an ache inside me that will never go away, knowing that not only could I not be with you, but I was denied the one opportunity I had to see my daughter.\u003c/p\u003e\n\u003cp\u003eYour getting pregnant when you did last year wasn’t a real surprise. A part of me was looking for it to happen, I think. I was crazy about you from the moment we met, and despite the separation, that hasn’t changed. Allison Marie was a gift from God. I don’t know why she had to die or what purpose her life served, but I do know I have no regrets about us marrying. Not a single one. Together we created a beautiful baby and together we loved our child. We still love her. The key word here is together, Cecilia. And that’s the way I want us to stay.\u003c/p\u003e\n\u003cp\u003eAfter the accident on the George Washington, you told me you love me. Oh, honey, you don’t know how good it was to hear you say it. My ribs hurt like hell, otherwise I would’ve been shouting loud enough for you to hear me all the way in Cedar Cove.\u003c/p\u003e\n\u003cp\u003eLet’s not do anything foolish—like get that divorce. When the George Washington pulls into Bremerton shipyard, I hope you’ll be there with all the other wives, waiting for their husbands. I don’t want this to be the end of our marriage, but the beginning of our lives together. I think Allison would approve of her mommy and daddy celebrating her birthday, don’t you? After all, she brought us together, didn’t she? It’s time we put away the pain and celebrated her life, short as it was. Because of Allison, you’re my wife and I’m your husband and that’s how we should remain.\u003c/p\u003e\n\u003cp\u003eI love you so much.\u003c/p\u003e\n\u003cp\u003eIan\u003c/p\u003e\n\u003cp\u003eSeventeen\u003c/p\u003e\n\u003cp\u003eCharlotte was fast losing patience with Cliff Harding. He’d assured her he’d come to town to look over the things she’d taken from Tom’s storage unit, but that was more than a month ago. Cliff continued to delay the meeting. Although his excuses sounded plausible, Charlotte could see that this simply wasn’t a high priority for him.\u003c/p\u003e\n\u003cp\u003eThat distressed her, but she wasn’t sure what to do about it.\u003c/p\u003e\n\u003cp\u003e“I’d drive out and see him myself,” her friend Laura told her on the Monday following her birthday.\u003c/p\u003e\n\u003cp\u003eCharlotte was with her knitting friends at the Senior Center. A few weeks ago she’d casually mentioned talking to Tom’s grandson, but hadn’t told them everything involved. She wasn’t about to admit, even to her nearest and dearest friends, that she’d committed a felony.\u003c/p\u003e\n\u003cp\u003e“I would, too,” Evelyn added. “From what you said, it isn’t that far.”\u003c/p\u003e\n\u003cp\u003e“It’ll mean driving on the highway.” Any road with more than two lanes terrified Charlotte. Cars whizzed past, and no matter what lane she was in, she seemed to annoy the other drivers, especially if she followed the posted speed. What did these people think the speed limit was, anyway? A suggestion? Everyone seemed to be in such an all-fired hurry these days. She’d drive over to see him if she had to, but she wouldn’t like it and she’d make darn sure Cliff Harding heard about it.\u003c/p\u003e\n\u003cp\u003e“I don’t know what it is with young people today,” Helen muttered, jerking on her yarn with unnecessary force. “They don’t respect their elders the way we were taught to.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t agree with you more.” This came from Bess, who nodded emphatically.\u003c/p\u003e\n\u003cp\u003e“You were his grandfather’s friend. One would think he’d welcome the opportunity to thank you.”\u003c/p\u003e\n\u003cp\u003e“It didn’t escape my notice,” Helen said, leaning toward Bess, “that he didn’t visit his grandfather, either.”\u003c/p\u003e\n\u003cp\u003e“I’m going to phone him again,” Charlotte said, decision made. “And I’ll let him know when he can expect me.” She’d put it off for nearly five weeks already. Cliff Harding always had an excuse. There had been that business trip, and last week there was a brief message on her answering machine—one of his horses was about to foal and he couldn’t leave. Charlotte could only imagine what his excuse would be this week. And the next. No, Laura was right, it was time to take matters into her own hands.\u003c/p\u003e\n\u003cp\u003eWhen Charlotte returned home, she tucked away her knitting, made a fuss over Harry, and then, filled with determination, headed toward her phone.\u003c/p\u003e\n\u003cp\u003eTom’s grandson answered, sounding far more congenial than he ever had before. \u003c/p\u003e","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-42.html","bookId":1941,"creation":"Oct 5, 2019 10:01:42 AM","modification":"Oct 5, 2019 10:01:42 AM"}
