{"id":66567,"no":8,"title":"Page 8","content":"\u003cp\u003e“Yes?” she asked stiffly.\u003c/p\u003e\n\u003cp\u003e“I thought you should know Ian’s going to sea. He’s been transferred to the George Washington”\u003c/p\u003e\n\u003cp\u003eThat didn’t make sense to her. The George Washington was an aircraft carrier. Ian was a submariner, a nuclear electronic technician. “He’ll be away six weeks?” she asked numbly, not understanding the transfer.\u003c/p\u003e\n\u003cp\u003e“More like six months.”\u003c/p\u003e\n\u003cp\u003eSix months? “Oh.”\u003c/p\u003e\n\u003cp\u003e“That’s why he came by tonight. He wanted you to know.”\u003c/p\u003e\n\u003cp\u003eCecilia wasn’t sure what to say.\u003c/p\u003e\n\u003cp\u003e“He didn’t mean to cause any trouble.”\u003c/p\u003e\n\u003cp\u003eCecilia swallowed hard. “He didn’t…not really.”\u003c/p\u003e\n\u003cp\u003eAndrew peered over his shoulder as if he’d heard someone call his name. “I’ve got to go. I just wanted to tell you I’m real sorry about your little girl.”\u003c/p\u003e\n\u003cp\u003e“Th-thank you,” she managed to say. But he was already gone. She waited a few moments and decided her peace of mind was worth more than her pride. She had to be sure Ian wasn’t driving. Hurrying outside, she stood on the sidewalk, searching for her husband’s car. He was nowhere to be seen.\u003c/p\u003e\n\u003cp\u003eA sense of loss filled her, an emptiness. Ian was going to sea for six months and she hated the thought of it. She didn’t want to feel anything for him, but she did. At any rate, she told herself wryly, he had his wish—with Ian at sea, she couldn’t proceed with the divorce.\u003c/p\u003e\n\u003cp\u003eTired and discouraged, Cecilia strolled toward her own ramshackle car, shoulders hunched against the cold. She could smell the ocean tonight, and a lowlying fog was rolling in from the cove. A car drove slowly past. Looking up, Cecilia saw that it was Ian’s. Thankfully, Andrew was behind the wheel. As she watched, her husband’s gaze connected with hers.\u003c/p\u003e\n\u003cp\u003eCecilia was shocked by the longing she saw in him. It was all she could do to keep herself from calling out. She yearned to wish Ian a safe voyage and see him off without this animosity between them.\u003c/p\u003e\n\u003cp\u003eBut it was too late. Much too late.\u003c/p\u003e\n\u003cp\u003eCharlotte Jefferson wore her finest dress—Navy dotted Swiss, with long sleeves and a full skirt—on her next visit to Tom Harding at the Cedar Cove Convalescent Center. She’d worked feverishly knitting the lap robe for him, and it showed excellent workmanship, even if she said so herself.\u003c/p\u003e\n\u003cp\u003eTom was sitting in his wheelchair when she breezed into the room. “I told you I’d be back,” she said, smiling warmly, the newspaper tucked under one arm. Her new friend looked well. There was color in his cheeks and his eyes were clear and bright.\u003c/p\u003e\n\u003cp\u003eTom nodded, obviously pleased to see her. His right hand pointed shakily to the empty chair.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she said, sinking gratefully onto the seat. “I don’t usually dress up in my best except on Sundays, but I just came from the funeral of a friend of my husband’s.”\u003c/p\u003e\n\u003cp\u003eTom stared at her blankly.\u003c/p\u003e\n\u003cp\u003e“We were friends with the Iversons for years,” she said. “He was a good man. Died of lung cancer. Used to smoke like a chimney.” She shook her head sadly, then crossed her legs and removed her left shoe. “I was on my feet most of the afternoon,” she explained. “I’m not as young as I used to be, and Lloyd Iverson’s death really shook me.” Sighing, she looked over at him. “How was your week?”\u003c/p\u003e\n\u003cp\u003eTom shrugged.\u003c/p\u003e\n\u003cp\u003e“Are they treating you well?”\u003c/p\u003e\n\u003cp\u003eHe nodded as if to say he had no complaints.\u003c/p\u003e\n\u003cp\u003e“How about the food?”\u003c/p\u003e\n\u003cp\u003eAnother shrug.\u003c/p\u003e\n\u003cp\u003e“Speaking of food,” she said, brightening. “I got the most fabulous recipe for broccoli lasagna at the wake. I just love it when I find a good recipe. Last month we buried Marion Parsons, and a lady from her church brought the most incredible noodle salad made with—and this is the kicker—whipped cream. Spaghetti noodles with a marshmallow and cream dressing. It was out of this world.” It suddenly occurred to her that Tom might not be interested in hearing about the recipe exchange that went on at wakes.\u003c/p\u003e\n\u003cp\u003e“I’m glad to hear you like it here in Cedar Cove.”\u003c/p\u003e\n\u003cp\u003eHe nodded again.\u003c/p\u003e\n\u003cp\u003e“I think I’ll make up a batch of that broccoli lasagna and take half of it over to my daughter. She lives alone now, and I just don’t think she eats enough vegetables. It doesn’t matter that she’s fifty-two, she’s still my little girl and I worry about her.”\u003c/p\u003e\n\u003cp\u003eTom smiled faintly.\u003c/p\u003e\n\u003cp\u003e“Would you like me to bring you a piece, too?”\u003c/p\u003e\n\u003cp\u003eGrinning, Tom shook his head.\u003c/p\u003e\n\u003cp\u003e“You don’t like broccoli, is that it? You and George Bush. Not George W. I don’t know if he likes broccoli or not.”\u003c/p\u003e\n\u003cp\u003eOnce more Tom shook his head.\u003c/p\u003e\n\u003cp\u003e“Broccoli’s good for the bowels. Now, that’s something we both need to think about, especially at our age.” She laughed outright, wondering how Olivia would react if she could hear her now.\u003c/p\u003e\n\u003cp\u003eShuffling his right foot, Tom laboriously rolled the wheelchair over to his nightstand.\u003c/p\u003e\n\u003cp\u003e“You want me to get something for you?” she asked.\u003c/p\u003e\n\u003cp\u003eHis white head bobbed.\u003c/p\u003e\n\u003cp\u003e“It’s inside the drawer here?” she asked.\u003c/p\u003e\n\u003cp\u003eHis brown eyes were intense, and he indicated that she’d guessed right.\u003c/p\u003e\n\u003cp\u003eCharlotte eased open the drawer and found a pen, pad and a small coin purse that closed with a zipper. Years earlier, Clyde had carried a similar one. Thinking Tom might want her to write something down, she took out the pen and paper.\u003c/p\u003e\n\u003cp\u003eHe frowned and shook his head.\u003c/p\u003e\n\u003cp\u003eShe reached for the coin purse, instead, and glanced at him again.\u003c/p\u003e\n\u003cp\u003eTom smiled and nodded.\u003c/p\u003e\n\u003cp\u003e“Do you want me to open it?” She realized that he must and carefully unzipped the small leather pouch. Inside was a folded yellow sheet of paper, which she removed. She set aside the coin holder and realized there was something enclosed in the paper. A key.\u003c/p\u003e\n\u003cp\u003e“What’s this?” she asked, openly curious now.\u003c/p\u003e\n\u003cp\u003eTom sat back; he seemed to be waiting for her to discover the answer on her own.\u003c/p\u003e\n\u003cp\u003eCharlotte unfolded the single sheet of paper and saw that it was a receipt for a storage unit right here in Cedar Cove. How he’d arranged that, she couldn’t guess. She’d have to ask Janet Lester.\u003c/p\u003e\n\u003cp\u003eUncertain what she was supposed to do with the key, Charlotte looked questioningly at Tom. “Everything seems to be in order,” she assured him, returning the key and the receipt to the pouch. She was about to place it in the drawer when he stopped her, leaning forward and clasping her forearm with his right hand.\u003c/p\u003e\n\u003cp\u003eHis eyes pleaded with her.\u003c/p\u003e\n\u003cp\u003e“You don’t want me to put it back here?” she asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head, breathing hard from his exertion.\u003c/p\u003e\n\u003cp\u003e“What would you like me to do with it?”\u003c/p\u003e\n\u003cp\u003eHe looked directly at her purse, which rested on the floor next to her large knitting bag.\u003c/p\u003e\n\u003cp\u003e“Take it with me?”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Wouldn’t you rather I gave it to someone in the office?” Surely that would be more appropriate than for Charlotte to keep it.\u003c/p\u003e\n\u003cp\u003eHe shook his head, his expression adamant.\u003c/p\u003e\n\u003cp\u003e“All right, but I feel I should tell Janet about this.”\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, your key’s in good hands. I’ll make sure nothing happens to it.” She slipped the pouch inside her purse, then reached for her knitting bag. “I made you a lap robe. You need something to keep your legs warm. There’s a chill in the air these January mornings, isn’t there?” She settled the robe over his legs and stepped back to admire it.\u003c/p\u003e\n\u003cp\u003eTom smiled, and made a shaky gesture to show his appreciation.\u003c/p\u003e\n\u003cp\u003e“You’re most welcome,” she said.\u003c/p\u003e\n\u003cp\u003eTom’s eyes closed briefly and she understood that he was tired. It was time to go. “I’ll be back next Thursday,” she said, gathering her bags.\u003c/p\u003e\n\u003cp\u003eHe gave a slight nod.\u003c/p\u003e\n\u003cp\u003e“Don’t you fret about a single thing. Oh, and I’ll bring you a slice of that lasagna.”\u003c/p\u003e\n\u003cp\u003eHe grinned and shook his head.\u003c/p\u003e\n\u003cp\u003e“All right, I’ll spare you.” Tom was probably on a special diet, anyway. “I promise to take good care of this key for you.”\u003c/p\u003e\n\u003cp\u003eHe sighed and patted the lap robe.\u003c/p\u003e\n\u003cp\u003e“The pleasure was all mine. Goodbye until next week.”\u003c/p\u003e\n\u003cp\u003eShe left his room more quietly than she’d entered it, and immediately sought out the social worker. She didn’t want to take the key without letting someone know.\u003c/p\u003e\n\u003cp\u003eJanet was in her office, talking on the phone. When she saw Charlotte, she motioned her in and ended the conversation a minute later.\u003c/p\u003e\n\u003cp\u003e“Hello, Charlotte, what can I do for you?”\u003c/p\u003e\n\u003cp\u003eShe explained about Tom Harding and the key.\u003c/p\u003e\n\u003cp\u003eJanet rolled her chair over to the filing cabinet and opened the top drawer. Extracting a file, she laid it on her desk. While she read through the file, Charlotte took a second look at the receipt for the storage unit. She saw that it was a renewal, which had been paid by the state—paid in full for the entire year. Apparently Tom had run out of funds for his care and become a ward of the state. What assets he owned were being stored in the unit and would be sold at the time of his death.\u003c/p\u003e\n\u003cp\u003eJanet continued to scan the file. “Unfortunately the information I have here is the bare minimum. Tom suffered a stroke five years ago, but there’s nothing about any family—and next to nothing about his background.”\u003c/p\u003e\n\u003cp\u003e“He seemed to want me to keep the key,” Charlotte said, unsure what she should do.\u003c/p\u003e\n\u003cp\u003e“Then I think you should. I know you have it, and so does Tom.”\u003c/p\u003e\n\u003cp\u003e“All right, I will.” That settled, Charlotte stood. “He’s a lovely man.”\u003c/p\u003e\n\u003cp\u003e“Yes, he is, but just a little mysterious.”\u003c/p\u003e\n\u003cp\u003eCharlotte had to agree and she admitted to being intrigued.\u003c/p\u003e\n\u003cp\u003eGrace Sherman grabbed a carton of milk and placed it in her grocery cart, then headed for the checkout stand. As she wheeled toward the front of the store, she decided to take a short detour and look over the paperback display. Books were her passion—books of all kinds, from classic fiction to mysteries and romances, from bestseller titles to biographies and history and…almost everything. That was why she’d gone into library work. She loved to read and often read late into the night. Her daughters shared her delight in books, although Dan had never been much of a reader.\u003c/p\u003e\n\u003cp\u003eAs Grace reached the front of the store, she noticed that the lineups were long. She chose one, then got the current copy of People magazine and flipped through that while she waited. The truth came to her as she approached the cashier—she dreaded going home.\u003c/p\u003e\n\u003cp\u003eThe realization left her breathless. They were low on milk, but it certainly hadn’t been necessary to make a special trip. She could easily have waited a day or two. Since she was here anyway, she’d thrown several packets of pasta into her cart, plus toilet paper and a couple of yogurts…as though to justify being to the supermarket at all. In fact, she’d been delaying the inevitable.\u003c/p\u003e\n\u003cp\u003eDan had been in such a bleak mood lately. There seemed to be problems at work, but that was only a guess because her husband refused to talk to her about anything beyond the mundane. Any other inquiries were met with one-word replies. Television was vastly more interesting than sharing any part of himself with her.\u003c/p\u003e\n\u003cp\u003eGrace wanted to discover what was wrong, but he snapped at her whenever she tried. Every night it was the same. Walking into the house after work was like standing in an electrical storm; she never knew when lightning might strike. Because Dan was uncommunicative and morose, she chatted endlessly about this thing and that, in an effort to lighten his mood—and to forestall his outbursts of anger. They always came without warning. \u003c/p\u003e","sourceLink":"https://allnovel.net/16-lighthouse-road-cedar-cove-1/page-8.html","bookId":1941,"creation":"Oct 5, 2019 10:01:42 AM","modification":"Oct 5, 2019 10:01:42 AM"}
