{"id":1941,"title":"16 Lighthouse Road (Cedar Cove #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003e16 Lighthouse Road (Cedar Cove #1) \u003c/p\u003e\n \u003cp\u003eOlivia Lockhart \u003c/p\u003e\n \u003cp\u003e16 Lighthouse Road \u003c/p\u003e\n \u003cp\u003eCedar Cove, Washington \u003c/p\u003e\n \u003cp\u003eDear Reader, \u003c/p\u003e\n \u003cp\u003eYou don\u0027t know me yet, but in a few hours that\u0027s going to change. You see, I\u0027m inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! \u003c/p\u003e\n \u003cp\u003eI have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there\u0027s my mother, Charlotte, who has plenty of opinions and is always willing to share them. \u003c/p\u003e\n \u003cp\u003eHere\u0027s an example: I\u0027m a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte\u0027s view, young Cecilia and Ian Randall hadn\u0027t tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. \u003c/p\u003e\n \u003cp\u003eWell, you wouldn\u0027t believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn\u0027t mind seeing more of!), everyone\u0027s talking. \u003c/p\u003e\n \u003cp\u003eCedar Cove - people love it and sometimes they leave it, but they never forget it! \u003c/p\u003e\n \u003cp\u003eSee you soon ... \u003c/p\u003e\n \u003cp\u003eOlivia\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/16-lighthouse-road-cedar-cove-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/16-lighthouse-road-cedar-cove-1.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:05 AM"}
