{"id":69482,"no":11,"title":"Page 11","content":"\u003cp\u003eTHE CALL CAME out of the blue on Monday morning.\u003c/p\u003e\n\u003cp\u003e\"Dana Evans?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"This is Dr. Joel Hirschberg. I\u0027m with the Children\u0027s Foundation.\"\u003c/p\u003e\n\u003cp\u003eDana listened, puzzled. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Elliot Cromwell mentioned to me that you told him you\u0027re having a problem getting a prosthetic arm for your son.\"\u003c/p\u003e\n\u003cp\u003eDana had to think a moment. \"Yes, I guess I did.\"\u003c/p\u003e\n\u003cp\u003e\"Mr. Cromwell gave me the background. This foundation has been set up to help children from war-torn countries. From what Mr. Cromwell told me, your son certainly comes under that heading. I wonder if you would like to bring him in to see me?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I - well, yes, of course.\" They made the appointment for later that day.\u003c/p\u003e\n\u003cp\u003eWhen Kemal got home from school, Dana said excitedly, \"You and I are going to see a doctor about getting a new arm for you. Would you like that?\"\u003c/p\u003e\n\u003cp\u003eKemal thought about it. \"I don\u0027t know. It won\u0027t be a real arm.\"\u003c/p\u003e\n\u003cp\u003e\"It will be as close to a real arm as we can get. Okay, pal?\"\u003c/p\u003e\n\u003cp\u003e\"Cool.\"\u003c/p\u003e\n\u003cp\u003eDr. Joel Hirschberg was in his late forties, an attractive, earnest-looking man with an air of quiet competence.\u003c/p\u003e\n\u003cp\u003eWhen Dana and Kemal exchanged hellos, Dana said, \"Doctor, I want to explain up front that we\u0027d have to work out some kind of financial arrangement, because I was told that because Kemal is growing, a new arm would be outdated every - \"\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg interrupted. \"As I told you over the phone, Miss Evans, the Children\u0027s Foundation has been set up especially to help children from war-torn countries. We\u0027ll take care of the expenses.\"\u003c/p\u003e\n\u003cp\u003eDana felt a surge of relief. \"That\u0027s wonderful.\" She said a silent prayer. God bless Elliot Cromwell.\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg turned to Kemal again. \"Now, let\u0027s take a look at you, young man.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later Dr. Hirschberg said to Dana, \"I think we can fix him up almost as good as new.\" He pulled down a chart on the wall. \"We have two kinds of prostheses, myoelectric, which is state-of-the-art, and a cable-operated arm. As you can see here, the myoelectric arm is made of plastics and covered with a handlike glove.\" He smiled at Kemal. \"It looks as good as the original.\"\u003c/p\u003e\n\u003cp\u003eKemal asked, \"Does it move?\"\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg said, \"Kemal, do you ever think about moving your hand? I mean the hand that isn\u0027t there any longer.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Kemal said.\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg leaned forward. \"Well, now, whenever you think about that phantom hand, the muscles that used to work there will contract and automatically generate a myoelectric signal. In other words, you\u0027ll be able to open and close your hand just by thinking about it.\"\u003c/p\u003e\n\u003cp\u003eKemal\u0027s face lit up. \"I will? How - how do I put the arm on and take it off?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s really very simple, Kemal. You\u0027ll just pull on the new arm. It\u0027s a suction fit. There will be a thin nylon sock over the arm. You can\u0027t swim with it, but you can do just about anything else. It\u0027s like a pair of shoes. You take it off at night and put it on in the morning.\"\u003c/p\u003e\n\u003cp\u003e\"How much does it weigh?\" Dana asked.\u003c/p\u003e\n\u003cp\u003e\"Anywhere from six ounces to a pound.\"\u003c/p\u003e\n\u003cp\u003eDana turned to Kemal. \"What do you think, sport? Should we try it?\"\u003c/p\u003e\n\u003cp\u003eKemal was trying to conceal his excitement. \"Will it look real?\"\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg smiled. \"It will look real.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds rad.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve had to become left-handed, so you\u0027re going to have to unlearn that. That will take time, Kemal. We can get you fitted immediately, but you\u0027ll have to see a therapist for a little while to learn how to make this a part of you and how to control the myoelectric signals.\"\u003c/p\u003e\n\u003cp\u003eKemal took a deep breath. \"Cool.\"\u003c/p\u003e\n\u003cp\u003eDana hugged Kemal tightly. \"It\u0027s going to be wonderful,\" she said. She was fighting back tears.\u003c/p\u003e\n\u003cp\u003eDr. Hirschberg watched them a moment, then smiled. \"Let\u0027s go to work.\"\u003c/p\u003e\n\u003cp\u003eWhen Dana returned to the office, she went in to see Elliot Cromwell.\u003c/p\u003e\n\u003cp\u003e\"Elliot, we just left Dr. Hirschberg.\"\u003c/p\u003e\n\u003cp\u003e\"Good. I hope he can help Kemal.\"\u003c/p\u003e\n\u003cp\u003e\"It looks as though he can. I can\u0027t tell you how very, very much I appreciate this.\"\u003c/p\u003e\n\u003cp\u003e\"Dana, there\u0027s nothing to appreciate. I\u0027m glad I could be helpful. Just let me know how it goes.\"\u003c/p\u003e\n\u003cp\u003e\"I will.\"Bless you.\u003c/p\u003e\n\u003cp\u003e\"Flowers!\" Olivia walked into the office with a large bouquet of flowers.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re beautiful!\" Dana exclaimed.\u003c/p\u003e\n\u003cp\u003eShe opened the envelope and read the card. Dear Miss Evans, Our friend\u0027s bark is worse than his bite. Enjoy the flowers. Jack Stone.\u003c/p\u003e\n\u003cp\u003eDana studied the card a moment. That\u0027s interesting, she thought. Jeff said his bite is worse than his bark. Which one is right? Dana had the feeling that Jack Stone hated his job. And hated his boss. I\u0027ll remember that.\u003c/p\u003e\n\u003cp\u003eDana telephoned Jack Stone at the FRA.\u003c/p\u003e\n\u003cp\u003e\"Mr. Stone? I just wanted to thank you for the beautiful - \"\u003c/p\u003e\n\u003cp\u003e\"Are you at your office?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call back.\" Dial tone.\u003c/p\u003e\n\u003cp\u003eThree minutes later Jack Stone called.\u003c/p\u003e\n\u003cp\u003e\"Miss Evans, it would be better for us both if a mutual friend didn\u0027t know we were talking. I\u0027ve tried to change his attitude, but he\u0027s a stubborn man. If you ever need me - I meanreally need me\u0026nbsp;\u0026nbsp;- I\u0027m going to give you my private cell phone number. It will reach me anytime.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Dana wrote down the number.\u003c/p\u003e\n\u003cp\u003e\"Miss Evans - \"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Never mind. Be careful.\"\u003c/p\u003e\n\u003cp\u003eWhen Jack Stone had gotten in that morning, General Booster had been waiting for him.\u003c/p\u003e\n\u003cp\u003e\"Jack, I have a feeling that Evans bitch is a troublemaker. I want you to start a file on her. And keep me in the loop.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take care of it.\"Only there\u0027s not going to be any loop. And he had sent Dana flowers.\u003c/p\u003e\n\u003cp\u003eDana and Jeff were in the television station\u0027s executive dining room talking about Kemal\u0027s prosthesis.\u003c/p\u003e\n\u003cp\u003eDana said, \"I\u0027m so excited, darling. This is going to make all the difference in the world. He\u0027s been belligerent because he feels inferior. This is going to change all that.\"\u003c/p\u003e\n\u003cp\u003e\"He must be thrilled,\" Jeff said. \"I know I am.\"\u003c/p\u003e\n\u003cp\u003e\"And the wonder is that the Children\u0027s Foundation is going to pay for all of it. If we can - \"\u003c/p\u003e\n\u003cp\u003eJeff\u0027s cell phone rang. \"Excuse me, honey.\" He pressed a button and talked into the phone. \"Hello?...Oh...\" He glanced at Dana. \"No...It\u0027s all right...Go ahead...\"\u003c/p\u003e\n\u003cp\u003eDana sat there, trying not to listen.\u003c/p\u003e\n\u003cp\u003e\"Yes...I see...Right...It\u0027s probably nothing serious, but maybe you should see a doctor. Where are you now? Brazil? They have some good doctors there. Of course...I understand...No...\" The conversation seemed to go on and on. Jeff finally said, \"Take care. Good-bye.\" He put the phone down.\u003c/p\u003e\n\u003cp\u003eDana said, \"Rachel?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. She\u0027s having some physical problems. She canceled her shoot in Rio. She\u0027s never done anything like that before.\"\u003c/p\u003e\n\u003cp\u003e\"Why is she calling you, Jeff?\"\u003c/p\u003e\n\u003cp\u003e\"She has no one else, honey. She\u0027s all alone.\"\u003c/p\u003e\n\u003cp\u003e\"Good-bye, Jeff.\"\u003c/p\u003e\n\u003cp\u003eRachel hung up reluctantly, hating to let go. She looked out the window at Sugarloaf in the distance and Ipanema Beach far below. She walked into her bedroom and lay down, exhausted, the day reeling tipsily through her mind. It had started off well. That morning she had been shooting a commercial for American Express, posing on the beach.\u003c/p\u003e\n\u003cp\u003eAround noon the director said, \"That last one was great, Rachel. But let\u0027s do one more.\"\u003c/p\u003e\n\u003cp\u003eShe started to say yes and then heard herself saying, \"No. I\u0027m sorry. I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe had looked at her in surprise. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m very tired. You\u0027ll have to excuse me.\" She had turned and fled to the hotel, through the lobby, into the safety of her room. She was trembling and felt nauseated. What is the matter with me? Her forehead was feverish.\u003c/p\u003e\n\u003cp\u003eShe picked up the telephone and called Jeff. The very sound of his voice made her feel better. Bless him. He is always there for me, my lifeline. When the conversation was over, Rachel lay in bed, thinking. We had some good times. He was always fun. We enjoyed doing the same things, and we loved sharing things. How could I have let him go? She made herself remember how the marriage had ended.\u003c/p\u003e\n\u003cp\u003eIt had started with a telephone call.\u003c/p\u003e\n\u003cp\u003e\"Rachel Stevens?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Roderick Marshall is calling.\"One of the most important directors in Hollywood.\u003c/p\u003e\n\u003cp\u003eA moment later he was on the line. \"Miss Stevens?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Roderick Marshall. Do you know who I am?\"\u003c/p\u003e\n\u003cp\u003eShe had seen several of his movies. \"Of course I do, Mr. Marshall.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been looking at photographs of you. We need you here at Fox. Would you be willing to come to Hollywood to do a screen test?\"\u003c/p\u003e\n\u003cp\u003eRachel hesitated about it for a moment. \"I don\u0027t know. I mean, I don\u0027t know if I can act. I\u0027ve never - \"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. I\u0027ll take care of that. We\u0027ll pay all your expenses, of course. I\u0027ll direct the test myself. How soon can you be out here?\"\u003c/p\u003e\n\u003cp\u003eRachel thought about her schedule. \"In three weeks.\"\u003c/p\u003e\n\u003cp\u003e\"Good. The studio will make all of the arrangements.\"\u003c/p\u003e\n\u003cp\u003eWhen Rachel hung up she realized she had not consulted Jeff. He won\u0027t mind, she thought. We\u0027re seldom together anyway.\u003c/p\u003e\n\u003cp\u003e\"Hollywood?\" Jeff had repeated.\u003c/p\u003e\n\u003cp\u003e\"It will be a lark, Jeff.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"All right. Go for it. You\u0027ll probably be great.\"\u003c/p\u003e\n\u003cp\u003e\"Can you come with me?\"\u003c/p\u003e\n\u003cp\u003e\"Honey, we\u0027re playing in Cleveland on Monday, then we\u0027re going on to Washington and then to Chicago. We still have a lot of games left on the schedule. I think the team would notice if one of their starting pitchers was missing.\"\u003c/p\u003e\n\u003cp\u003e\"Too bad.\" She tried to sound casual. \"Our lives never seem to come together, do they, Jeff?\"\u003c/p\u003e\n\u003cp\u003e\"Not often enough.\"\u003c/p\u003e\n\u003cp\u003eRachel started to say something more, but she thought, This isn\u0027t the time.\u003c/p\u003e\n\u003cp\u003eRachel was picked up at Los Angeles airport by a studio employee in a stretch limousine.\u003c/p\u003e\n\u003cp\u003e\"My name is Henry Ford.\" He chuckled. \"No relation. They call me Hank.\"\u003c/p\u003e\n\u003cp\u003eThe limousine glided out into traffic. On the way, he gave Rachel a running commentary.\u003c/p\u003e\n\u003cp\u003e\"First time in Hollywood, Miss Stevens?\"\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027ve been here many times. The last time was two years ago.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s sure changed. It\u0027s bigger and better than ever. If you\u0027re into glamour, you\u0027re going to love it.\"\u003c/p\u003e\n\u003cp\u003eIf I\u0027m into glamour.\u003c/p\u003e\n\u003cp\u003e\"The studio booked you at the Chateau Marmont. That\u0027s where all the celebrities stay.\"\u003c/p\u003e\n\u003cp\u003eRachel pretended to be impressed. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. John Belushi died there, you know, after overdosing.\"\u003c/p\u003e\n\u003cp\u003e\"My.\"\u003c/p\u003e\n\u003cp\u003e\"Gable used to stay there, Paul Newman, Marilyn Monroe.\" The name-dropping went on and on. Rachel had stopped listening.\u003c/p\u003e\n\u003cp\u003eThe Chateau Marmont was just north of the Sunset Strip, looking like a castle from a movie set.\u003c/p\u003e\n\u003cp\u003eHenry Ford said, \"I\u0027ll pick you up at two o\u0027clock to take you to the studio. You\u0027ll meet Roderick Marshall there.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be ready.\"\u003c/p\u003e\n\u003cp\u003eTwo hours later Rachel was in the office of Roderick Marshall. He was in his forties, small and compact, with the energy of a dynamo.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be glad you came,\" he said. \"I\u0027m going to make you a big star. We\u0027ll shoot your test tomorrow. I\u0027ll have one of my assistants take you over to wardrobe to choose something nice for you. You\u0027re going to do a test scene from one of our big pictures, End of a Dream. Tomorrow morning at seven o\u0027clock we\u0027ll do makeup and hair. I guess that\u0027s nothing new to you, huh?\"\u003c/p\u003e\n\u003cp\u003eRachel said tonelessly, \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Are you alone here, Rachel?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we have dinner together tonight?\"\u003c/p\u003e\n\u003cp\u003eRachel thought about it for a moment. \"Fine.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pick you up at eight o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eDinner turned out to be a whirlwind evening on the town.\u003c/p\u003e\n\u003cp\u003e\"If you know where to go - and you can get in,\" Roderick Marshall told Rachel, \"L. A. has some of the hottest clubs in the world.\"\u003c/p\u003e\n\u003cp\u003eThe evening\u0027s rounds began at the Standard, a trendy bar, restaurant, and hotel on Sunset Boulevard. As they passed the front desk, Rachel stopped to stare. Next to the desk, behind a frosted glass window, was a live human painting, a nude model.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t that great?\"\u003c/p\u003e\n\u003cp\u003e\"Unbelievable,\" Rachel said.\u003c/p\u003e\n\u003cp\u003eThere was a montage of noisy, crowded clubs, and by the end of the evening, Rachel was exhausted.\u003c/p\u003e\n\u003cp\u003eRoderick Marshall dropped her off at the hotel. \"Sleep well. Tomorrow\u0027s going to change your whole life.\"\u003c/p\u003e\n\u003cp\u003eAt 7:00A. M., Rachel was in the makeup room. Bob Van Dusen, the makeup man, looked at her appreciatively and said, \"And they\u0027re paying me for this?\"\u003c/p\u003e\n\u003cp\u003eShe laughed.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t need much makeup. Nature took care of that.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eWhen Rachel was ready, a wardrobe woman helped her into the dress they had fitted the afternoon before. An assistant director took her to the huge soundstage.\u003c/p\u003e\n\u003cp\u003eRoderick Marshall and the crew were waiting. The director studied Rachel a moment and said, \"Perfect. We\u0027re going to do a two-part test, Rachel. You\u0027re going to sit in this chair and I\u0027ll ask you some questions off-camera. Just be yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Right. And the second part?\"\u003c/p\u003e\n\u003cp\u003e\"The short test scene I mentioned.\"\u003c/p\u003e\n\u003cp\u003eRachel sat down and the cameraman set his focus. Roderick Marshall was standing off-camera. \"Are you ready?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Just relax. You\u0027re going to be wonderful. Camera. Action. Good morning.\"\u003c/p\u003e\n\u003cp\u003e\"Good morning.\"\u003c/p\u003e\n\u003cp\u003e\"I hear you\u0027re a model.\"\u003c/p\u003e\n\u003cp\u003eRachel smiled. \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"How did you get started?\"\u003c/p\u003e\n\u003cp\u003e\"I was fifteen. The owner of a model agency saw me in a restaurant with my mother, went up and talked to her, and a few days later I was a model.\"\u003c/p\u003e\n\u003cp\u003eThe interview went on for fifteen easy minutes, and Rachel\u0027s intelligence and poise shone through.\u003c/p\u003e\n\u003cp\u003e\"Cut! Wonderful!\" Roderick Marshall handed her a short test scene. \"We\u0027re going to take a break. Read this. When you\u0027re ready, tell me, and we\u0027ll shoot it. You\u0027re a cinch, Rachel.\"\u003c/p\u003e\n\u003cp\u003eRachel read the scene. It was about a wife asking her husband for a divorce. Rachel read it again.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003eRachel was introduced to Kevin Webster, who was going to play opposite her - a handsome young man in the Hollywood mold.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Roderick Marshall said. \"Let\u0027s shoot it. Camera. Action.\"\u003c/p\u003e\n\u003cp\u003eRachel looked at Kevin Webster. \"I talked to a divorce lawyer this morning, Cliff.\"\u003c/p\u003e\n\u003cp\u003e\"I heard about it. Shouldn\u0027t you have talked to me first?\"\u003c/p\u003e\n\u003cp\u003e\"I did talk to you about it. I\u0027ve talked to you about it for the last year. We don\u0027t have a marriage anymore. You just weren\u0027t listening, Jeff.\"\u003c/p\u003e\n\u003cp\u003e\"Cut,\" Roderick said. \"Rachel, his name is Cliff.\"\u003c/p\u003e\n\u003cp\u003eRachel said, embarrassed, \"I\u0027m so sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go again. Take two.\"\u003c/p\u003e\n\u003cp\u003eThe scene really is about Jeff and me, Rachel thought. We don\u0027t have a marriage anymore. How could we? We live separate lives. We hardly see each other. We both meet attractive people, but we can\u0027t get involved because of a contract that no longer means anything.\u003c/p\u003e\n\u003cp\u003e\"Rachel!\"\u003c/p\u003e\n\u003cp\u003e\"Sorry.\"\u003c/p\u003e\n\u003cp\u003eThe scene began again.\u003c/p\u003e\n\u003cp\u003eBy the time Rachel finished the test, she had made two decisions: She did not belong in Hollywood.\u003c/p\u003e\n\u003cp\u003eAnd she wanted a divorce...\u003c/p\u003e\n\u003cp\u003eNow, lying in bed in Rio, feeling ill and exhausted, Rachel thought, I made a mistake. I never should have divorced Jeff.\u003c/p\u003e\n\u003cp\u003eTuesday when Kemal finished school, Dana took him to the therapist who was working with Kemal and his new arm. The artificial arm looked real and functioned well, but it was difficult for Kemal to get used to it, both physically and psychologically.\u003c/p\u003e\n\u003cp\u003e\"It will feel like he\u0027s attached to a foreign object,\" the therapist had explained to Dana. \"Our job is to get him to accept it as a part of his own body. He has to get used to being ambidextrous again. There\u0027s usually a two- to three-month learning period. I must warn you that it can be a very difficult time.\"\u003c/p\u003e\n\u003cp\u003e\"We can handle it,\" Dana assured him.\u003c/p\u003e\n\u003cp\u003eIt was not that easy. The following morning Kemal walked out of the study without his prosthesis. \"I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003eDana looked at him in surprise. \"Where\u0027s your arm, Kemal?\"\u003c/p\u003e\n\u003cp\u003eKemal raised his left hand defiantly. \"Here it is.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean. Where\u0027s your prosthesis?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s freak. I won\u0027t wear it anymore.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll get used to it, darling. I promise. You have to give it a chance. I\u0027ll help you to - \"\u003c/p\u003e\n\u003cp\u003e\"No one can help me. I\u0027m afukati cripple...\"\u003c/p\u003e\n\u003cp\u003eDana went to see Detective Marcus Abrams again. When Dana walked in, Abrams was at his desk busily filling out reports. He looked up, scowling.\u003c/p\u003e\n\u003cp\u003e\"You know what I hate about this damned job?\" He indicated the pile of papers. \"This. I could be out on the street having fun shooting perps. Oh, I forgot. You\u0027re a reporter, aren\u0027t you? Don\u0027t quote me.\"\u003c/p\u003e\n\u003cp\u003e\"Too late.\"\u003c/p\u003e\n\u003cp\u003e\"And what can I do for you today, Miss Evans?\"\u003c/p\u003e\n\u003cp\u003e\"I came to ask about the Sinisi case. Has there been an autopsy?\"\u003c/p\u003e\n\u003cp\u003e\"Pro forma.\" He took out some papers from his desk drawer.\u003c/p\u003e\n\u003cp\u003e\"Was there anything suspicious in the report?\"\u003c/p\u003e\n\u003cp\u003eShe watched Detective Abrams scan the paper. \"No alcohol...no drugs...No.\" He looked up. \"It looks like the lady was depressed and just decided to end it all. That it?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it,\" Dana said.\u003c/p\u003e\n\u003cp\u003eDana\u0027s next stop was Detective Phoenix Wilson\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Detective Wilson.\"\u003c/p\u003e\n\u003cp\u003e\"And what brings you to my humble office?\"\u003c/p\u003e\n\u003cp\u003e\"I wondered whether there was any news on Gary Winthrop\u0027s murder.\"\u003c/p\u003e\n\u003cp\u003eDetective Wilson sighed and scratched the side of his nose. \"Not one damn thing. I would have thought that by now one of those paintings would have turned up. That\u0027s what we\u0027ve been counting on.\"\u003c/p\u003e\n\u003cp\u003eDana wanted to say, I wouldn\u0027t if I were you, but she held her tongue. \"No clues of any kind?\"\u003c/p\u003e\n\u003cp\u003e\"Not a thing. The bastards got away clean as a whistle. We don\u0027t have too many art thefts, but the MO is almost always the same. That\u0027s what\u0027s so surprising.\"\u003c/p\u003e\n\u003cp\u003e\"Surprising?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. This one is different.\"\u003c/p\u003e\n\u003cp\u003e\"Different...how?\"\u003c/p\u003e\n\u003cp\u003e\"Art thieves don\u0027t kill unarmed people, and there was no reason for these guys to shoot down Gary Winthrop in cold blood.\" He stopped. \"Do you have any special interest in this case?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Dana lied. \"Not at all. Just curious. I - \"\u003c/p\u003e\n\u003cp\u003e\"Right,\" Detective Wilson said. \"Keep in touch.\"\u003c/p\u003e\n\u003cp\u003eAt the end of a meeting in General Booster\u0027s office at the secluded the FRA headquarters, the general turned to Jack Stone and asked, \"What\u0027s happening with the Evans woman?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s going around asking questions, but I think it\u0027s harmless. She\u0027s not getting anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like her snooping around. Kick it up to a code three.\"\u003c/p\u003e\n\u003cp\u003e\"When do you want it to start?\"\u003c/p\u003e\n\u003cp\u003e\"Yesterday.\"\u003c/p\u003e\n\u003cp\u003eDana was in the middle of preparing for the next broadcast when Matt Baker walked into her office and sank into a chair.\u003c/p\u003e\n\u003cp\u003e\"I just got a phone call about you.\"\u003c/p\u003e\n\u003cp\u003eDana said lightly, \"My fans can\u0027t get enough of me, can they?\"\u003c/p\u003e\n\u003cp\u003e\"This one\u0027s had enough of you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"The call was from the FRA. They\u0027re asking you to stop your investigation of Taylor Winthrop. Nothing official. Just what they called a friendly suggestion. Looks like they want you to mind your own business.\"\u003c/p\u003e\n\u003cp\u003e\"It does, doesn\u0027t it?\" Dana said. She locked eyes with Matt. \"It makes you wonder why, doesn\u0027t it? I\u0027m not backing away from the story because some government agency wants me to. It started in Aspen, where Taylor and his wife were killed in the fire. I\u0027m going there first. And if there\u0027s something there, it should be a great kickoff story forCrime Line. \"\u003c/p\u003e\n\u003cp\u003e\"How much time do you need?\"\u003c/p\u003e\n\u003cp\u003e\"It shouldn\u0027t take more than a day or two.\"\u003c/p\u003e\n\u003cp\u003e\"Go for it.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sky-is-falling/page-11.html","bookId":2369,"creation":"Oct 5, 2019 10:13:17 AM","modification":"Oct 5, 2019 10:13:17 AM"}
