{"id":69494,"no":23,"title":"Page 23","content":"\u003cp\u003eTHERE WAS A MILITARY jet waiting at a private area of Sheremetyevo II airport. Dana was surprised to see that she and Sasha Shdanoff were the only passengers.\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\" Dana asked.\u003c/p\u003e\n\u003cp\u003eSasha Shdanoff gave her a mirthless smile. \"To Siberia.\"\u003c/p\u003e\n\u003cp\u003eSiberia. Dana felt a knot in her stomach. \"Oh.\"\u003c/p\u003e\n\u003cp\u003eThe flight took four hours. Dana tried to make conversation, hoping to get an inkling of what she was facing, but Shdanoff sat in his seat, silent and grim-faced.\u003c/p\u003e\n\u003cp\u003eWhen the plane landed at a small airport in what seemed to Dana to be the middle of nowhere, a Lada 2110 sedan was waiting on the frozen tarmac for them. Dana looked around at the most desolate landscape she had ever seen.\u003c/p\u003e\n\u003cp\u003e\"This place we\u0027re going to - is it far from here?\"And will I be coming back?\u003c/p\u003e\n\u003cp\u003e\"It is a short distance. We must be very careful.\"\u003c/p\u003e\n\u003cp\u003eCareful of what?\u003c/p\u003e\n\u003cp\u003eThere was a short, bumpy drive to what looked like a small train station. Half a dozen heavily bundled-up uniformed guards stood on the platform.\u003c/p\u003e\n\u003cp\u003eAs Dana and Shdanoff approached them, the guards were ogling Dana\u0027s skimpy outfit. One of them pointed to Dana and smirked. \"Ti vezuchi!\"\u003c/p\u003e\n\u003cp\u003e\"Kakaya krasivaya zhenshina!\"\u003c/p\u003e\n\u003cp\u003eShdanoff grinned and said something in Russian and all the guards laughed.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want to know, Dana decided.\u003c/p\u003e\n\u003cp\u003eShdanoff boarded the train and Dana followed, more confused than ever. Where could a train be going in the middle of a bleak, frozen tundra? The temperature in the train was freezing.\u003c/p\u003e\n\u003cp\u003eThe engine started, and a few minutes later the train was entering a brightly lit tunnel cut into the heart of a mountain. Dana looked at the rock on both sides, inches away, and had the feeling she was in some weird, surrealistic dream.\u003c/p\u003e\n\u003cp\u003eShe turned to Shdanoff. \"Will you please tell me where we\u0027re going?\"\u003c/p\u003e\n\u003cp\u003eThe train jerked to a stop. \"We are here.\"\u003c/p\u003e\n\u003cp\u003eThey debarked from the train and started toward an odd-shaped cement building one hundred yards away. In front of the building stood two forbidding-looking barbed-wire fences, patrolled by heavily armed soldiers. As Dana and Sasha Shdanoff approached the gates, the soldiers saluted.\u003c/p\u003e\n\u003cp\u003eShdanoff whispered, \"Put your arm in mine and kiss me and laugh.\"\u003c/p\u003e\n\u003cp\u003eJeff will never believe this, Dana thought. She put her arm in Shdanoff\u0027s, kissed him on the cheek, and forced a hollow laugh.\u003c/p\u003e\n\u003cp\u003eThe gates swung open and the two of them went through, arm in arm. The soldiers watched enviously as Commissar Shdanoff walked in with his beautiful whore. To Dana\u0027s astonishment, the structure they entered was the top of an elevator station that went below the ground. They stepped into the cab of the elevator and the door banged closed.\u003c/p\u003e\n\u003cp\u003eAs they started down, Dana asked, \"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"Beneath the mountain.\" The elevator was picking up speed.\u003c/p\u003e\n\u003cp\u003e\"How far beneath the mountain?\" Dana asked nervously.\u003c/p\u003e\n\u003cp\u003eHe said, \"Six hundred feet.\"\u003c/p\u003e\n\u003cp\u003eDana looked at him incredulously. \"We\u0027re going six hundred feet under a mountain. Why? What\u0027s down there?\"\u003c/p\u003e\n\u003cp\u003e\"You will see.\"\u003c/p\u003e\n\u003cp\u003eIn a few minutes, the elevator began to slow down. Finally, it stopped, and the door opened automatically.\u003c/p\u003e\n\u003cp\u003eCommissar Shdanoff said, \"We are here, Miss Evans.\"\u003c/p\u003e\n\u003cp\u003eBut where is here?\u003c/p\u003e\n\u003cp\u003eThey stepped out of the elevator and had walked no more than twenty feet when Dana stopped in shock. She found herself looking down the street of a modern city, with shops and restaurants and theaters. Men and women were walking along the sidewalks, and Dana suddenly realized that no one was wearing an overcoat. Dana began to feel warm. She turned to Shdanoff. \"We\u0027re underneath a mountain?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"But - \" She looked at the incredible sight spread out before her. \"I don\u0027t understand. What is this place?\"\u003c/p\u003e\n\u003cp\u003e\"I told you. Krasnoyarsk-26.\"\u003c/p\u003e\n\u003cp\u003e\"Is this some kind of bomb shelter?\"\u003c/p\u003e\n\u003cp\u003e\"On the contrary,\" Shdanoff said enigmatically.\u003c/p\u003e\n\u003cp\u003eDana looked again at all the modern buildings around her. \"Commissar, what is the point of this place?\"\u003c/p\u003e\n\u003cp\u003eHe gave Dana a long, hard look. \"You would be better off not knowing what I am about to tell you.\"\u003c/p\u003e\n\u003cp\u003eDana felt a fresh sense of alarm.\u003c/p\u003e\n\u003cp\u003e\"Do you know anything about plutonium?\"\u003c/p\u003e\n\u003cp\u003e\"Not very much, no.\"\u003c/p\u003e\n\u003cp\u003e\"Plutonium is the fuel of a nuclear warhead, the key ingredient in atomic weapons. Krasnoyarsk-26\u0027s sole purpose for existing is to make plutonium. One hundred thousand scientists and technicians live and work here, Miss Evans. In the beginning, they were given the finest food and clothes and housing. But they are all here with one restriction.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"They must agree never to leave.\"\u003c/p\u003e\n\u003cp\u003e\"You mean - \"\u003c/p\u003e\n\u003cp\u003e\"They cannot go outside. Ever. They must cut themselves off completely from the rest of the world.\"\u003c/p\u003e\n\u003cp\u003eDana looked at the people walking along the warm streets and thought to herself, This can\u0027t be real. \"Where do they make the plutonium?\"\u003c/p\u003e\n\u003cp\u003e\"I will show you.\" A tram was approaching. \"Come.\" Shdanoff boarded the tram, and Dana followed him. They rode down the busy main street, and at the end entered a maze of dimly lit tunnels.\u003c/p\u003e\n\u003cp\u003eDana thought of the incredible work and all the years that must have gone into building this city. In a few minutes, the lights began to get brighter, and the tram stopped. They were at the entrance to an enormous, brightly lit laboratory.\u003c/p\u003e\n\u003cp\u003e\"We get off here.\"\u003c/p\u003e\n\u003cp\u003eDana followed Shdanoff and looked around in awe. There were three giant reactors housed in the immense cave. Two of the reactors were silent, but the third one was in operation and surrounded by a busy cadre of technicians.\u003c/p\u003e\n\u003cp\u003eShdanoff said, \"The machines in this room can produce enough plutonium to make an atomic bomb every three days.\" He indicated the one that was working. \"That reactor is still producing half a ton of plutonium a year, enough to make a hundred bombs. The plutonium stockpiled in the next room is worth a czar\u0027s ransom.\"\u003c/p\u003e\n\u003cp\u003eDana asked, \"Commissar, if they have all that plutonium, why are they still making more?\"\u003c/p\u003e\n\u003cp\u003eShdanoff said wryly, \"It is what you Americans call a catch-twenty-two. They can\u0027t turn the reactor off because the plutonium furnishes the power for the city above. If they stop the reactor, there will be no light and no heat, and the people up there will quickly freeze to death.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s awful,\" Dana said. \"If - \"\u003c/p\u003e\n\u003cp\u003e\"Wait. What I have to tell you gets worse. Because of the state of the Russian economy, there is no longer the money to pay the scientists and technicians who work here. They have not been paid in months. The beautiful homes they were given years ago are deteriorating, and there is no money to repair them. All the luxuries have disappeared. The people here are getting desperate. You see the paradox? The amount of plutonium stored here is worth untold billions of dollars, yet the people who created it have nothing and are starting to go hungry.\"\u003c/p\u003e\n\u003cp\u003eDana said slowly, \"And you think they might sell some of the plutonium to other countries?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Before Taylor Winthrop became ambassador to Russia, friends told him about Krasnoyarsk-26 and asked him if he wanted to make a deal. After he talked to some of the scientists here who felt betrayed by their government, Winthrop was eager to make a deal. But it was complicated, and he had to wait until all the pieces fell into place.\"\u003c/p\u003e\n\u003cp\u003eHe was like a crazy man. He said something like \"All the pieces have fallen into place.\"\u003c/p\u003e\n\u003cp\u003eDana was finding it difficult to breathe.\u003c/p\u003e\n\u003cp\u003e\"Shortly after that, Taylor Winthrop became the American ambassador to Russia. Winthrop and his partner collaborated with some of the rebel scientists and began smuggling plutonium to a dozen countries, including Libya, Iran, Iraq, Pakistan, North Korea, and China.\"\u003c/p\u003e\n\u003cp\u003eAfter all the pieces had fallen into place! The ambassadorship was important to Taylor Winthrop only because he had to be on hand to control the operation.\u003c/p\u003e\n\u003cp\u003eThe commissar was going on. \"It was easy, because a mass of plutonium the size of a tennis ball is enough to make a nuclear bomb, Miss Evans. Taylor Winthrop and his partner were making billions of dollars. They handled everything very cleverly, and no one suspected a thing.\" He sounded bitter. \"Russia has become a candy store - only instead of buying candy, you can buy atomic bombs, tanks, fighter planes and missile systems.\"\u003c/p\u003e\n\u003cp\u003eDana was trying to digest everything she was hearing. \"Why was Taylor Winthrop killed?\"\u003c/p\u003e\n\u003cp\u003e\"He got greedy and decided to go into business for himself. When his partner learned what Winthrop was doing, he had him killed.\"\u003c/p\u003e\n\u003cp\u003e\"But - but why murder his whole family?\"\u003c/p\u003e\n\u003cp\u003e\"After Taylor Winthrop and his wife died in the fire, his son Paul tried to blackmail the partner, so he had Paul killed. And then he decided he could not take a chance that the other children might know about the plutonium, so he ordered the other two murdered and arranged for their deaths to look like an accident and a burglary gone wrong.\"\u003c/p\u003e\n\u003cp\u003eDana looked at him, horrified. \"Who was Taylor Winthrop\u0027s partner?\"\u003c/p\u003e\n\u003cp\u003eCommissar Shdanoff shook his head. \"You know enough for now, Miss Evans. I will give you the name when you get me out of Russia.\" He looked at his watch. \"We must leave.\"\u003c/p\u003e\n\u003cp\u003eDana turned to take one last look at the reactor that could not be shut off, that was turning out deadly plutonium twenty-four hours a day. \"Is the government of the United States aware of Krasnoyarsk-26?\"\u003c/p\u003e\n\u003cp\u003eShdanoff nodded. \"Oh, yes. They are terrified of it. Your State Department is working frantically with us to try to find a way to turn these reactors into something less lethal. Meanwhile...\" He shrugged.\u003c/p\u003e\n\u003cp\u003eIn the elevator, Commissar Shdanoff asked, \"Are you familiar with the FRA?\"\u003c/p\u003e\n\u003cp\u003eDana looked at him and said cautiously, \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"They are involved in this also.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" And then the realization hit her. That\u0027s why General Booster kept warning me away.\u003c/p\u003e\n\u003cp\u003eThey arrived at the surface and stepped out of the elevator. Shdanoff said, \"I keep an apartment here. We will go there.\"\u003c/p\u003e\n\u003cp\u003eAs they started to walk along the street, Dana saw a woman dressed as she was, clinging to the arms of a man.\u003c/p\u003e\n\u003cp\u003e\"That woman - \" Dana started.\u003c/p\u003e\n\u003cp\u003e\"I told you. Certain men are permitted to use prostitutes during the day. But at night the prostitutes must return to a guarded compound. They must know nothing of what goes on below the ground.\"\u003c/p\u003e\n\u003cp\u003eAs they walked along, Dana noted that most of the shops\u0027 windows were empty.\u003c/p\u003e\n\u003cp\u003eThe luxuries are gone. The state no longer has money to pay the scientists and technicians who work here. They have not been paid in months. Dana looked at a tall building on the corner and noticed that instead of a clock it had a large instrument mounted on top.\u003c/p\u003e\n\u003cp\u003e\"What is that?\" Dana asked.\u003c/p\u003e\n\u003cp\u003e\"A Geiger counter, a warning in case anything goes wrong with the reactors.\" They turned into a side street filled with apartment buildings. \"My apartment is in here. We must stay there for a little while so no one will be suspicious. The FSB checks on everyone.\"\u003c/p\u003e\n\u003cp\u003e\"The FSB?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. It used to be called the KGB. They changed the name, but that is all they changed.\"\u003c/p\u003e\n\u003cp\u003eThe apartment was large and was once luxurious, but it had become shabby. The curtains were torn, the carpets were worn, and the furniture needed re-upholstering.\u003c/p\u003e\n\u003cp\u003eDana sat down, thinking about what Sasha Shdanoff had told her about the FRA. And Jeff had said, The agency is a cover-up. The real function of the FRA is to spy on foreign intelligence agencies. Taylor Winthrop had once been the head of the FRA, working with Victor Booster.\u003c/p\u003e\n\u003cp\u003eI would stay as far away as you can from General Booster.\u003c/p\u003e\n\u003cp\u003eAnd her meeting with Booster. Can\u0027t you fucking journalists let the dead rest? I\u0027m warning you to stay the hell away. General Victor Booster had an enormous secret organization to carry out the murders.\u003c/p\u003e\n\u003cp\u003eAnd Jack Stone was trying to protect her. Be careful. If Victor Booster knew I was even talking to you...\u003c/p\u003e\n\u003cp\u003eThe FRA spies were everywhere, and Dana felt suddenly naked.\u003c/p\u003e\n\u003cp\u003eSasha Shdanoff looked at his watch. \"It is time to leave. Do you know yet how you are going to get me out of the country?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Dana said slowly. \"I think I know how to arrange it. I need a little time.\"\u003c/p\u003e\n\u003cp\u003eWhen the plane landed back in Moscow, there were two cars waiting. Shdanoff handed Dana a piece of paper.\u003c/p\u003e\n\u003cp\u003e\"I am staying with a friend at the Chiaka Apartments. No one knows I am there. It is what you call a \"safe house.\" Here is the address. I can\u0027t go back to my own place. Come here at eight o\u0027clock this evening. I must know your plan.\"\u003c/p\u003e\n\u003cp\u003eDana nodded. \"All right. I have a phone call to make.\"\u003c/p\u003e\n\u003cp\u003eWhen Dana got back to the lobby of the Soyuz Hotel, the woman behind the desk stared at her. I don\u0027t blame her, Dana thought. I\u0027ve got to get out of this dreadful outfit.\u003c/p\u003e\n\u003cp\u003eInside her room, Dana changed into her own clothes before making a phone call. She prayed as the phone kept ringing at the other end. Please be in. Please be in. Dana heard Cesar\u0027s blessed voice.\u003c/p\u003e\n\u003cp\u003e\"The Hudson residence.\"\u003c/p\u003e\n\u003cp\u003e\"Cesar, is Mr. Hudson in?\" Dana found that she was holding her breath.\u003c/p\u003e\n\u003cp\u003e\"Miss Evans! How nice to hear from you. Yes, Mr. Hudson is here. Hold on, please.\"\u003c/p\u003e\n\u003cp\u003eDana felt her body tremble with relief. If there was anyone who could help her get Sasha Shdanoff into the United States, Roger Hudson would be the one person able to do it.\u003c/p\u003e\n\u003cp\u003eHis voice came on the line a moment later. \"Dana?\"\u003c/p\u003e\n\u003cp\u003e\"Roger, oh, thank God I got you!\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter? Are you all right? Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in Moscow. I found out why Taylor Winthrop and his family were murdered.\"\u003c/p\u003e\n\u003cp\u003e\"What? My God. How did you - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you all about it when I see you. Roger, I hate to impose on you again, but I have a problem. There\u0027s an important Russian official who wants to escape to America. His name is Sasha Shdanoff. His life is in danger here. He knows the answers to everything that\u0027s happened. We have to get him out, and quickly! Can you help?\"\u003c/p\u003e\n\u003cp\u003e\"Dana, neither of us should be involved in anything like this. We could both get in trouble.\"\u003c/p\u003e\n\u003cp\u003e\"We have to take that chance. We have no choice. This is too important. It has to be done.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this, Dana.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to drag you into this, but I have no one else to turn to.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, I - \" He stopped. \"All right. The best thing to do right now is to get him to the American embassy. He\u0027ll be safe there until we can work out a plan to get him into the United States.\"\u003c/p\u003e\n\u003cp\u003e\"He doesn\u0027t want to go to the American embassy. He doesn\u0027t trust them.\"\u003c/p\u003e\n\u003cp\u003e\"There is no other way. I\u0027ll call the ambassador on a secure line and tell him to see that he gets protection. Where is Shdanoff now?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s waiting for me at the Chiaka Apartments. He\u0027s staying with a friend. I\u0027m going there to meet him.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Dana, when you pick him up, go directly to the American embassy. Don\u0027t stop anywhere on the way.\"\u003c/p\u003e\n\u003cp\u003eDana felt a surge of relief. \"Thank you, Roger. I meanthank you! \"\u003c/p\u003e\n\u003cp\u003e\"Be careful, Dana.\"\u003c/p\u003e\n\u003cp\u003e\"I will.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll talk later.\"\u003c/p\u003e\n\u003cp\u003eThank you, Roger. I mean thank you.\u003c/p\u003e\n\u003cp\u003eBe careful, Dana.\u003c/p\u003e\n\u003cp\u003eI will.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll talk later.\u003c/p\u003e\n\u003cp\u003eTape ends.\u003c/p\u003e\n\u003cp\u003eAt seven-thirty, Dana slipped out of the service entrance of the Soyuz Hotel. She went down an alley, ripped by the icy wind. She pulled her coat around her tightly, but the cold was in her bones. Dana walked two blocks, making sure that she was not being followed. At the first busy corner, she hailed a taxi and gave the driver the address Sasha Shdanoff had given her. Fifteen minutes later the taxi stopped in front of a nondescript apartment building.\u003c/p\u003e\n\u003cp\u003e\"Me wait?\" the driver asked.\u003c/p\u003e\n\u003cp\u003e\"No.\" Commissar Shdanoff would probably have a car. Dana took some dollars from her purse, held out her hand, and the driver grunted and took them all. Dana watched him drive off, and she went inside the building. The hallway was deserted. She looked at the slip in her hand, apartment 2BE. She approached a flight of shabby stairs and walked up to the second floor. There was no one around. A long hallway lay in front of her.\u003c/p\u003e\n\u003cp\u003eDana began to walk along it slowly, looking at the numbers on the doors. 5BE...4BE...3BE...The door to 2BE was ajar. Dana tensed. Cautiously, she pushed the door open wider and stepped inside. The apartment was dark.\u003c/p\u003e\n\u003cp\u003e\"Commissar...?\" She waited. There was no answer. \"Commissar Shdanoff?\" A heavy silence. There was a bedroom ahead, and Dana moved toward it. \"Commissar Shdanoff...\"\u003c/p\u003e\n\u003cp\u003eAs Dana entered the dark bedroom, she tripped over something and fell to the floor. She was lying on something soft and wet. Filled with revulsion, Dana scrambled to her feet. She felt along the wall until she found a switch. She pressed it, and the room was flooded with light. Her hands were covered with blood. On the floor lay the object she had stumbled over: Sasha Shdanoff\u0027s body. He was on his back, his chest soaked in blood, his throat slit from ear to ear.\u003c/p\u003e\n\u003cp\u003eDana screamed. As she did, she looked at the bed and saw the bloody body of a middle-aged woman with a plastic bag tied around her head. Dana felt her flesh crawl.\u003c/p\u003e\n\u003cp\u003eHysterical, she ran down the stairs of the apartment building.\u003c/p\u003e\n\u003cp\u003eHe was standing at the window of an apartment in the building across the street, loading a thirty-shot rifle clip into an AR-7 rifle with a silencer. He was using a 3-6 powered scope, accurate up to sixty-five yards. He moved with the easy, calm grace of a professional. This was a simple job. The woman should be coming out of the building at any minute. He smiled at the thought of how she must have panicked when she found the two bloody bodies. Now it was her turn.\u003c/p\u003e\n\u003cp\u003eThe door to the apartment building across the street flew open, and he carefully raised the rifle to his shoulder. Through the scope, he saw Dana\u0027s face as she ran out onto the street, frantically looking around, trying to decide which way to go. He aimed carefully to make sure she was in the exact center of the scope and gently squeezed the trigger.\u003c/p\u003e\n\u003cp\u003eAt that instant, a bus stopped in front of the building, and the spray of bullets hit the top of the bus and blew part of the roof off. The sniper looked down, unbelievingly. Some of the bullets had ricocheted into the bricks of the building, but the target was unharmed. People were pouring out of the bus, screaming. He knew he had to get out of there. The woman was running down the street. Not to worry. The others would deal with her.\u003c/p\u003e\n\u003cp\u003eThe streets were icy and the wind was howling, but Dana never noticed. She was in a complete panic. Two blocks away she came to a hotel and ran into the lobby.\u003c/p\u003e\n\u003cp\u003e\"Telephone?\" she said to the clerk behind the desk.\u003c/p\u003e\n\u003cp\u003eHe looked at her bloody hands and drew back.\u003c/p\u003e\n\u003cp\u003e\"Telephone!\" Dana was almost screaming.\u003c/p\u003e\n\u003cp\u003eNervously, the clerk pointed to a phone booth in a corner of the lobby. Dana hurried into it. From her purse, she took out a phone card and, with trembling fingers, telephoned the operator.\u003c/p\u003e\n\u003cp\u003e\"I want to place a call to America.\" Her hands were shaking. Through chattering teeth, she gave the operator her card number and Roger Hudson\u0027s number and waited. After what seemed to be an eternity, Dana heard Cesar\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"The Hudson residence.\"\u003c/p\u003e\n\u003cp\u003e\"Cesar! I need to talk to Mr. Hudson.\" Her voice was choked.\u003c/p\u003e\n\u003cp\u003e\"Miss Evans?\"\u003c/p\u003e\n\u003cp\u003e\"Hurry, Cesar, hurry!\"\u003c/p\u003e\n\u003cp\u003eA minute later Dana heard Roger\u0027s voice. \"Dana?\"\u003c/p\u003e\n\u003cp\u003e\"Roger!\" Tears were streaming down Dana\u0027s face. \"He\u0027s - he\u0027s dead. They m-murdered him and his friend.\"\u003c/p\u003e\n\u003cp\u003e\"What? My God, Dana. I don\u0027t know what - are you hurt?\"\u003c/p\u003e\n\u003cp\u003e\"No...but they\u0027re trying to kill me.\"\u003c/p\u003e\n\u003cp\u003e\"Now, listen carefully. There\u0027s an Air France plane that leaves for Washington at midnight. I\u0027ll get you a reservation on it. Make sure you\u0027re not followed to the airport. Don\u0027t take a taxi there. Go directly to the Hotel Metropol. The hotel has airport buses leaving regularly. Take one of them. Mingle with the crowds. I\u0027ll be waiting for you in Washington when you arrive. For God\u0027s sakes, watch yourself!\"\u003c/p\u003e\n\u003cp\u003e\"I will, Roger. Th - thank you.\"\u003c/p\u003e\n\u003cp\u003eDana hung up the phone. She stood there a moment, unable to move, filled with terror. She could not get the bloody images of Shdanoff and his friend out of her mind. She took a deep breath and walked out of the booth, past the suspicious clerk, out into the freezing-cold night.\u003c/p\u003e\n\u003cp\u003eA taxi pulled up to the curb next to her, and the driver said something to her in Russian.\u003c/p\u003e\n\u003cp\u003e\"Nyet,\"Dana said. She began to hurry down the street. She had to go back to her hotel first.\u003c/p\u003e\n\u003cp\u003eAs Roger replaced the phone, he heard Pamela come in the front door.\u003c/p\u003e\n\u003cp\u003e\"Dana\u0027s telephoned twice from Moscow. She\u0027s found out why the Winthrops were murdered.\"\u003c/p\u003e\n\u003cp\u003ePamela said, \"Then we must take care of her right away.\"\u003c/p\u003e\n\u003cp\u003e\"I already tried. We sent a sniper, but something went wrong.\"\u003c/p\u003e\n\u003cp\u003ePamela looked at him with contempt. \"You fool. Call them again. And, Roger...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Tell them to make it look like an accident.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sky-is-falling/page-23.html","bookId":2369,"creation":"Oct 5, 2019 10:13:17 AM","modification":"Oct 5, 2019 10:13:17 AM"}
