{"id":69478,"no":7,"title":"Page 7","content":"\u003cp\u003eTHE STAFF WAS getting ready for the evening news.\u003c/p\u003e\n\u003cp\u003eDana was in studio A at the anchor desk, going through last-minute changes for the broadcast. The news bulletins that had been coming in all day from wire services and police channels had been studied and selected or rejected.\u003c/p\u003e\n\u003cp\u003eSeated at the anchor table next to Dana were Jeff Connors and Richard Melton. Anastasia Mann started the countdown and ended 3-2-1 with her extended forefinger. The camera\u0027s red light flashed on.\u003c/p\u003e\n\u003cp\u003eThe announcer\u0027s voice boomed out, \"This is the eleven o\u0027clock news live on WTN with Dana Evans\" - Dana smiled into the camera -\u0026nbsp;\u0026nbsp;\"and Richard Melton.\" Melton looked into the camera and nodded. \"Jeff Connors with sports and Marvin Greer with the weather. The eleven o\u0027clock news begins right now.\"\u003c/p\u003e\n\u003cp\u003eDana looked into the camera. \"Good evening. I\u0027m Dana Evans.\"\u003c/p\u003e\n\u003cp\u003eRichard Melton smiled. \"And I\u0027m Richard Melton.\"\u003c/p\u003e\n\u003cp\u003eDana read from the TelePrompTer. \"We have a breaking story. A police chase ended earlier this evening after a holdup at a downtown liquor store.\"\u003c/p\u003e\n\u003cp\u003e\"Roll tape one.\"\u003c/p\u003e\n\u003cp\u003eThe screen flashed to the interior of a helicopter. At the controls of the WTN helicopter was Norman Bronson, a former marine pilot. Next to him sat Alyce Barker. The camera angle changed. On the ground below were three police cars surrounding a sedan that had crashed into a tree.\u003c/p\u003e\n\u003cp\u003eAlyce Barker said, \"The chase began when two men walked into the Haley Liquor Store on Pennsylvania Avenue and tried to hold up the clerk. He resisted and pressed the alarm button to summon police. The robbers fled, but the police pursued them for four miles until the suspects\u0027 car crashed into a tree.\"\u003c/p\u003e\n\u003cp\u003eThe chase was covered by the station\u0027s news helicopter. Dana looked at the picture and thought:The best thing Matt ever did was to get Elliot to buy that new helicopter. It makes a big difference to our coverage.\u003c/p\u003e\n\u003cp\u003eThere were three more segments, and the director signaled for a break. \"We\u0027ll be right back after this,\" Dana said.\u003c/p\u003e\n\u003cp\u003eA commercial came on.\u003c/p\u003e\n\u003cp\u003eRichard Melton turned to Dana. \"Have you looked outside? It\u0027s a bitch out there.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" Dana laughed. \"Our poor weatherman is going to get a lot of hate mail.\"\u003c/p\u003e\n\u003cp\u003eThe red camera light flashed on. The TelePrompTer was blank for a moment, then began to roll again. Dana started to read, \"On NewYear\u0027s Eve I\u0027d like - \" She stopped, stunned, as she looked at the rest of the words. They read:...us to get married. We\u0027ll have a double reason to celebrate every New Year\u0027s Eve.\u003c/p\u003e\n\u003cp\u003eJeff was standing next to the TelePrompTer, grinning.\u003c/p\u003e\n\u003cp\u003eDana looked into the camera and said awkwardly, \"We\u0027ll - we\u0027ll pause for another brief commercial.\" The red light went off.\u003c/p\u003e\n\u003cp\u003eDana stood up. \"Jeff!\"\u003c/p\u003e\n\u003cp\u003eThey moved toward each other and embraced. \"What do you say?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe held him tightly and whispered, \"I say yes.\"\u003c/p\u003e\n\u003cp\u003eThe studio echoed with cheers from the crew.\u003c/p\u003e\n\u003cp\u003eWhen the broadcast was over and they were alone, Jeff said, \"What would you like, honey? Big wedding, small wedding, medium wedding?\"\u003c/p\u003e\n\u003cp\u003eDana had thought about her wedding from the time she was a little girl. She had visualized herself in a beautiful, lacy white gown with a long, long train. In the movies she had seen, there was the frantic excitement of getting ready for the wedding...the guest list to prepare...the caterer to choose...the bridesmaids...the church...All her friends would be there, and her mother. It was going to be the most wonderful day of her life. And now it was a reality.\u003c/p\u003e\n\u003cp\u003eJeff said, \"Dana...?\" He was waiting for her answer.\u003c/p\u003e\n\u003cp\u003eIf I have a big wedding, Dana thought, I would have to invite Mother and her husband. I can\u0027t do that to Kemal.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s elope,\" Dana said.\u003c/p\u003e\n\u003cp\u003eJeff nodded, surprised. \"If that\u0027s what you want, then it\u0027s what I want.\"\u003c/p\u003e\n\u003cp\u003eKemal was thrilled when he heard the news. \"You mean Jeff is going to live with us?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. We\u0027ll all be together. You\u0027ll have a real family, darling.\" Dana sat at Kemal\u0027s bedside for the next hour, excitedly discussing their future. The three of them were going to live together, vacation together, and just be together. That magic word.\u003c/p\u003e\n\u003cp\u003eWhen Kemal was asleep, Dana went into her bedroom and turned on the computer. Apartments. Apartments. We\u0027ll need two bedrooms, two baths, a living room, kitchen, dining area, and maybe an office and a study. That shouldn\u0027t be too difficult. Dana thought of Gary Winthrop\u0027s town house sitting empty, and her mind began to wander. What had really happened that night? And who had turned off the alarm? If there were no signs of a break-in, then how had the burglars gotten in? Almost involuntarily her fingers typed in \"Winthrop\" on the keyboard. What the devil is the matter with me? Dana saw the same familiar information she had seen earlier.\u003c/p\u003e\n\u003cp\u003eRegional \u0026gt; U. S. States \u0026gt; Washington D. C. \u0026gt; Government \u0026gt; Politics \u0026gt; Federal Research Agency\u003c/p\u003e\n\u003cp\u003e*Winthrop, Taylor - served as Ambassador to Russia and negotiated an important trade agreement with Italy...\u003c/p\u003e\n\u003cp\u003e*Winthrop, Taylor - self-made billionaire Taylor Winthrop devoted himself to serving his country...\u003c/p\u003e\n\u003cp\u003e*Winthrop, Taylor - Winthrop family set up philanthropic trusts to help schools, libraries, and inner-city programs...\u003c/p\u003e\n\u003cp\u003eThere were fifty-four Web sites for the Winthrop family. Dana was about to change the search toApartments when a random entry caught her eye.\u003c/p\u003e\n\u003cp\u003e*Winthrop, Taylor - Lawsuit. Joan Sinisi, former secretary to Taylor Winthrop, filed a lawsuit and later dropped it.\u003c/p\u003e\n\u003cp\u003eDana read the item again. What kind of lawsuit? Dana wondered.\u003c/p\u003e\n\u003cp\u003eShe switched to several more Winthrop Web sites, but there was no further mention of any lawsuit. Dana typed in the nameJoan Sinisi. Nothing came up.\u003c/p\u003e\n\u003cp\u003e\"Is this a secure line?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I want a report on the Web sites the subject is checking.\"\u003c/p\u003e\n\u003cp\u003e\"We will take care of it immediately.\"\u003c/p\u003e\n\u003cp\u003eThe following morning, when Dana arrived at her office after dropping Kemal off at school, she looked through the Washington telephone directory. No Joan Sinisi. She tried the Maryland directory...Virginia...No luck. She\u0027s probably moved away, Dana decided.\u003c/p\u003e\n\u003cp\u003eTom Hawkins, the show\u0027s producer, walked into Dana\u0027s office. \"We beat the competition again last night.\"\u003c/p\u003e\n\u003cp\u003e\"Great.\" Dana was thoughtful for a moment. \"Tom, do you know anyone at the telephone company?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. You need a telephone?\"\u003c/p\u003e\n\u003cp\u003e\"No. I want to see if someone has an unlisted number. Do you think you could check it out?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the name?\"\u003c/p\u003e\n\u003cp\u003e\"Sinisi. Joan Sinisi.\"\u003c/p\u003e\n\u003cp\u003eHe frowned. \"Why is that name familiar?\"\u003c/p\u003e\n\u003cp\u003e\"She was involved in a lawsuit with Taylor Winthrop.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, yes. I remember now. That was about a year ago. You were in Yugoslavia. I thought there was going to be a juicy story there, but it got hushed up pretty quickly. She\u0027s probably living somewhere in Europe, but I\u0027ll try to find out.\"\u003c/p\u003e\n\u003cp\u003eFifteen minutes later Olivia Watkins said, \"Tom is on the line for you.\"\u003c/p\u003e\n\u003cp\u003e\"Tom?\"\u003c/p\u003e\n\u003cp\u003e\"Joan Sinisi is still living in Washington. I have her unlisted number for you, if you want it.\"\u003c/p\u003e\n\u003cp\u003e\"Wonderful,\" Dana said. She picked up a pen. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003e\"Five-five-five-two-six-nine-zero.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Forget the thanks. Make it a lunch.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got it.\"\u003c/p\u003e\n\u003cp\u003eThe office door opened and Dean Ulrich, Robert Fenwick, and Maria Toboso, three writers who worked on the television news, came in.\u003c/p\u003e\n\u003cp\u003eRobert Fenwick said, \"It\u0027s going to be a bloody newscast tonight. We have two train wrecks, a plane crash, and a major landslide.\"\u003c/p\u003e\n\u003cp\u003eThe four of them began to read through the incoming news bulletins. Two hours later, when the meeting was over, Dana picked up the piece of paper with Joan Sinisi\u0027s number on it and called it.\u003c/p\u003e\n\u003cp\u003eA woman answered. \"Miss Sinisi\u0027s residence.\"\u003c/p\u003e\n\u003cp\u003e\"Could I talk to Miss Sinisi, please? This is Dana Evans.\"\u003c/p\u003e\n\u003cp\u003eThe woman said, \"I\u0027ll see if she\u0027s available. Just a moment, please.\"\u003c/p\u003e\n\u003cp\u003eDana waited. Another woman\u0027s voice came on the phone, soft and hesitant. \"Hello...\"\u003c/p\u003e\n\u003cp\u003e\"Miss Sinisi?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"This is Dana Evans. I wondered if - \"\u003c/p\u003e\n\u003cp\u003e\"TheDana Evans?\"\u003c/p\u003e\n\u003cp\u003e\"Er - yes.\"\u003c/p\u003e\n\u003cp\u003e\"Oh! I watch your broadcast every night. I\u0027m a tremendous fan of yours.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" Dana said. \"That\u0027s very flattering. I wonder if you could spare a few minutes of your time, Miss Sinisi. I\u0027d like to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"You would?\" There was a happily surprised note in her voice.\u003c/p\u003e\n\u003cp\u003e\"Yes. Could we meet somewhere?\"\u003c/p\u003e\n\u003cp\u003e\"Well, certainly. Would you like to come here?\"\u003c/p\u003e\n\u003cp\u003e\"That would be fine. When would be convenient for you?\"\u003c/p\u003e\n\u003cp\u003eThere was a brief hesitation. \"Any time. I\u0027m here all day.\"\u003c/p\u003e\n\u003cp\u003e\"What about tomorrow afternoon, say around two o\u0027clock?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" She gave Dana the address.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see you tomorrow,\" Dana said. She replaced the receiver. Why am I going on with this? Well, this will be the end of it.\u003c/p\u003e\n\u003cp\u003eAt two o\u0027clock the following afternoon, Dana drove up in front of Joan Sinisi\u0027s high-rise apartment building on Prince Street. A uniformed doorman stood in front of the building. Dana looked at the imposing structure and thought, How can a secretary afford to live here? She parked the car and went inside to the lobby. There was a receptionist at the desk.\u003c/p\u003e\n\u003cp\u003e\"May I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I have an appointment to see Miss Sinisi. Dana Evans.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Miss Evans. She\u0027s expecting you. Just take the elevator to the penthouse. It\u0027s apartment A.\"\u003c/p\u003e\n\u003cp\u003eThe penthouse?\u003c/p\u003e\n\u003cp\u003eWhen Dana arrived at the top floor, she got out of the elevator and rang the doorbell of apartment A. The door was opened by a uniformed maid.\u003c/p\u003e\n\u003cp\u003e\"Miss Evans?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Come in, please.\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi lived in a twelve-room apartment with a huge terrace overlooking the city. The maid led Dana through a long hallway into a large drawing room done in white and beautifully decorated. A small, slender woman was seated on the couch. She rose as Dana entered.\u003c/p\u003e\n\u003cp\u003eJoan Sinisi was a surprise. Dana had not known what to anticipate, but the woman who got up to greet her was the last thing she would have expected. Joan Sinisi was small and plain looking, with dull brown eyes hidden behind thick glasses. Her voice was shy and almost inaudible.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a real pleasure to meet you in person, Miss Evans.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for seeing me,\" Dana said. She joined Joan Sinisi on a large white couch near the terrace.\u003c/p\u003e\n\u003cp\u003e\"I was just about to have some tea. Would you care for some?\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi turned to the maid and said almost diffidently, \"Greta, would you mind bringing us some tea?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Greta.\"\u003c/p\u003e\n\u003cp\u003eThere was a feeling of unreality about this. Dana thought, Joan Sinisi and the penthouse don\u0027t fit together at all. How could she afford to live here? What kind of settlement had Taylor Winthrop made? And what had the lawsuit been about?\u003c/p\u003e\n\u003cp\u003e\"...and I never miss your broadcasts,\" Joan Sinisi was saying softly. \"I think you\u0027re wonderful.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"I remember when you were broadcasting from Sarajevo with all those terrible bombs and guns going off. I was always afraid something was going to happen to you.\"\u003c/p\u003e\n\u003cp\u003e\"To be honest, so was I.\"\u003c/p\u003e\n\u003cp\u003e\"It must have been a horrible experience.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, in one way it was.\"\u003c/p\u003e\n\u003cp\u003eGreta came in with a tray of tea and cakes. She set it on the table in front of the two women.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pour,\" Joan Sinisi said.\u003c/p\u003e\n\u003cp\u003eDana watched as she poured the tea.\u003c/p\u003e\n\u003cp\u003e\"Would you like a cake?\"\u003c/p\u003e\n\u003cp\u003e\"No, thanks.\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi handed Dana a cup of tea, then poured a cup for herself. \"As I said, I\u0027m really delighted to meet you, but I - I can\u0027t imagine what you want to talk to me about.\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to talk to you about Taylor Winthrop.\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi gave a start and some of the tea spilled on her lap. Her face had gone white.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m - I\u0027m fine.\" She dabbed at her skirt with a napkin. \"I - I didn\u0027t know that you wanted...\" Her voice trailed off.\u003c/p\u003e\n\u003cp\u003eThe atmosphere had suddenly changed. Dana said, \"You were Taylor Winthrop\u0027s secretary, weren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi said carefully, \"Yes. But I left Mr. Winthrop\u0027s employ a year ago. I\u0027m afraid I can\u0027t help you.\" The woman was almost trembling.\u003c/p\u003e\n\u003cp\u003eDana said soothingly, \"I\u0027ve heard such good things about Taylor Winthrop. I just wondered if you could add to them?\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi looked relieved. \"Oh, yes, of course I can. Mr. Winthrop was a great man.\"\u003c/p\u003e\n\u003cp\u003e\"How long did you work for him?\"\u003c/p\u003e\n\u003cp\u003e\"Almost three years.\"\u003c/p\u003e\n\u003cp\u003eDana smiled. \"It must have been a wonderful experience.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, it was, Miss Evans.\" She sounded much more relaxed.\u003c/p\u003e\n\u003cp\u003e\"But you brought a lawsuit against him.\"\u003c/p\u003e\n\u003cp\u003eThe fear was back in Joan Sinisi\u0027s eyes. \"No - I mean yes. But it was a mistake, you see. I made a mistake.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of mistake?\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi swallowed. \"I - I misunderstood something Mr. Winthrop said to someone. I behaved very foolishly. I\u0027m ashamed of myself.\"\u003c/p\u003e\n\u003cp\u003e\"You sued, but you didn\u0027t take him to court?\"\u003c/p\u003e\n\u003cp\u003e\"No. He - we settled the lawsuit. It was nothing.\"\u003c/p\u003e\n\u003cp\u003eDana glanced around the penthouse. \"I see. Can you tell me what the settlement was?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m afraid I can\u0027t,\" Joan Sinisi said. \"It\u0027s all very confidential.\"\u003c/p\u003e\n\u003cp\u003eDana wondered what it could have been that made this timid woman bring a lawsuit against a titan like Taylor Winthrop and why she was terrified to talk about it. What was she afraid of?\u003c/p\u003e\n\u003cp\u003eThere was a long silence. Joan Sinisi was watching Dana, and Dana had the feeling that she wanted to say something.\u003c/p\u003e\n\u003cp\u003e\"Miss Sinisi - \"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi rose. \"I\u0027m sorry I can\u0027t be more - if there\u0027s nothing else, Miss Evans...\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" Dana said.\u003c/p\u003e\n\u003cp\u003eI wish I did.\u003c/p\u003e\n\u003cp\u003eHe put the tape into the machine and pressed the start button.\u003c/p\u003e\n\u003cp\u003eI - I misunderstood something Mr. Winthrop said to someone. I behaved very foolishly. I\u0027m ashamed of myself.\u003c/p\u003e\n\u003cp\u003eYou sued, but you didn\u0027t take him to court?\u003c/p\u003e\n\u003cp\u003eNo. He - we settled the lawsuit. It was nothing.\u003c/p\u003e\n\u003cp\u003eI see. Can you tell me what the settlement was?\u003c/p\u003e\n\u003cp\u003eNo, I\u0027m afraid I can\u0027t. It\u0027s all very confidential.\u003c/p\u003e\n\u003cp\u003eMiss Sinisi -\u003c/p\u003e\n\u003cp\u003eI\u0027m sorry I can\u0027t be more - if there\u0027s nothing else, Miss Evans...\u003c/p\u003e\n\u003cp\u003eI understand.\u003c/p\u003e\n\u003cp\u003eTape ends.\u003c/p\u003e\n\u003cp\u003eIt had begun.\u003c/p\u003e\n\u003cp\u003eDana had made arrangements for a real estate broker to show her apartments, but it was a wasted morning. Dana and the broker covered Georgetown, Dupont Circle, and the Adams-Morgan district. The apartments were too small, or too large, or too expensive. By noon, Dana was ready to give up.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry,\" the real estate agent said reassuringly. \"We\u0027ll find exactly what you\u0027re looking for.\"\u003c/p\u003e\n\u003cp\u003e\"I hope so,\" Dana said. And soon.\u003c/p\u003e\n\u003cp\u003eDana could not get Joan Sinisi out of her mind. What did she have on Taylor Winthrop that would make him pay her off with a penthouse and God only knew what else? She wanted to tell me something, Dana thought. I\u0027m sure of it. I have to talk to her again.\u003c/p\u003e\n\u003cp\u003eDana telephoned Joan Sinisi\u0027s apartment. Greta answered: \"Good afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"Greta, this is Dana Evans. I\u0027d like to speak to Miss Sinisi, please.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. Miss Sinisi is not taking any calls.\"\u003c/p\u003e\n\u003cp\u003e\"Well, would you tell her that it\u0027s Dana Evans, and I need - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Miss Evans. Miss Sinisi is not available.\" The line went dead.\u003c/p\u003e\n\u003cp\u003eThe following morning Dana dropped Kemal off at school. In a frozen sky, a pale sun was trying to come out. On street corners all over the city, the same faux Santa Clauses were ringing their charity bells.\u003c/p\u003e\n\u003cp\u003eI must find an apartment for the three of us before New Year\u0027s Eve, Dana thought.\u003c/p\u003e\n\u003cp\u003eWhen Dana got to the studio, she spent the morning in a conference with the news staff, discussing which stories to go with and the locations they needed to have taped. There was a story of a particularly brutal unsolved murder, and Dana thought of the Winthrops.\u003c/p\u003e\n\u003cp\u003eShe called Joan Sinisi\u0027s number again.\u003c/p\u003e\n\u003cp\u003e\"Good afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"Greta, it\u0027s very important that I talk to Miss Sinisi. Tell her that Dana Evans - \"\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t talk to you, Miss Evans.\" The line went dead.\u003c/p\u003e\n\u003cp\u003eWhat is going on? Dana wondered.\u003c/p\u003e\n\u003cp\u003eDana went in to see Matt Baker. Abbe Lasmann greeted her.\u003c/p\u003e\n\u003cp\u003e\"Congratulations! I understand the wedding date is all set.\"\u003c/p\u003e\n\u003cp\u003eDana smiled. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eAbbe sighed. \"What a romantic proposal.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s my fella.\"\u003c/p\u003e\n\u003cp\u003e\"Dana, our Advice to the Lovelorn columnist said that after the wedding, you should go out and buy a couple bags of canned groceries and stash them in the trunk of your car.\"\u003c/p\u003e\n\u003cp\u003e\"Why on earth...?\"\u003c/p\u003e\n\u003cp\u003e\"She says that one day down the road, you might decide to have a little extracurricular fun and get home late. When Jeff asks where you\u0027ve been, you just show him the bags and say, \"Shopping.\" He\u0027ll - \"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Abbe dear. Is Matt available?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell him you\u0027re here.\"\u003c/p\u003e\n\u003cp\u003eMoments later, Dana was in Matt Baker\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Sit down, Dana. Good news. We just got the latest Nielsens. We clobbered the opposition again last night.\"\u003c/p\u003e\n\u003cp\u003e\"Great. Matt, I talked to an ex-secretary of Taylor Winthrop\u0027s and she - \"\u003c/p\u003e\n\u003cp\u003eHe grinned. \"You Virgos never let go, do you? You told me that you - \"\u003c/p\u003e\n\u003cp\u003e\"I know, but listen to this. When she was working for Taylor Winthrop, she filed a lawsuit against him. It never came to trial because he settled with her. She\u0027s living in an enormous penthouse she couldn\u0027t possibly have afforded on a secretary\u0027s salary, so the settlement must have been really heavy. When I mentioned Winthrop\u0027s name, this woman was terrified, absolutely terrified. She acted as though she were in fear for her life.\"\u003c/p\u003e\n\u003cp\u003eMatt Baker said patiently, \"Did she say she was in fear for her life?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did she say she was in fear of Taylor Winthrop?\"\u003c/p\u003e\n\u003cp\u003e\"No, but - \"\u003c/p\u003e\n\u003cp\u003e\"So for all you know, she might be afraid of a boyfriend who beats her up or burglars under her bed. You have absolutely nothing to go on, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I - \" Dana saw the expression on his face.\u003c/p\u003e\n\u003cp\u003e\"Nothing concrete.\"\u003c/p\u003e\n\u003cp\u003e\"Right. About the Nielsens...\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi was watching the evening news on WTN. Dana was saying, \"...and in local news, according to the latest report, the crime rate in the United States has gone down twenty-seven percent in the last twelve months. The largest decreases in crime have been in Los Angeles, San Francisco, and Detroit...\"\u003c/p\u003e\n\u003cp\u003eJoan Sinisi was studying Dana\u0027s face, looking into her eyes, trying to come to a decision. She watched the entire newscast, and by the time it was over, she had made up her mind. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sky-is-falling/page-7.html","bookId":2369,"creation":"Oct 5, 2019 10:13:17 AM","modification":"Oct 5, 2019 10:13:17 AM"}
