{"id":69479,"no":8,"title":"Page 8","content":"\u003cp\u003eWHENDANA WALKED into her office on Monday morning, Olivia said, \"Good morning. You\u0027ve had three calls from some woman who won\u0027t leave her name.\"\u003c/p\u003e\n\u003cp\u003e\"Did she leave a number?\"\u003c/p\u003e\n\u003cp\u003e\"No. She said she would call back.\"\u003c/p\u003e\n\u003cp\u003eThirty minutes later Olivia said, \"That woman\u0027s on the line again. Do you want to talk to her?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\" Dana picked up the phone. \"Hello, this is Dana Evans. Who is - \"\u003c/p\u003e\n\u003cp\u003e\"This is Joan Sinisi.\"\u003c/p\u003e\n\u003cp\u003eDana\u0027s heart quickened. \"Yes, Miss Sinisi...\"\u003c/p\u003e\n\u003cp\u003e\"Do you still want to talk to me?\" She sounded nervous.\u003c/p\u003e\n\u003cp\u003e\"Yes. Very much.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"I can be at your apartment in - \"\u003c/p\u003e\n\u003cp\u003e\"No!\" Panic was in her voice. \"We must meet somewhere else. I - I think I\u0027m being watched.\"\u003c/p\u003e\n\u003cp\u003e\"Wherever you say. Where?\"\u003c/p\u003e\n\u003cp\u003e\"The aviary section at the zoo in the park. Can you be there in an hour?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be there.\"\u003c/p\u003e\n\u003cp\u003eThe park was virtually deserted. The icy December winds that swept through the city were keeping the usual crowds away. Dana stood in front of the aviary waiting for Joan Sinisi, shivering in the cold. Dana looked at her watch. She had been there for over an hour. I\u0027ll give her another fifteen minutes.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later Dana told herself, Another half hour, and that\u0027s it. Thirty minutes later she thought, Damn it! She\u0027s changed her mind.\u003c/p\u003e\n\u003cp\u003eDana returned to her office, chilled and wet. \"Any calls?\" she asked Olivia hopefully.\u003c/p\u003e\n\u003cp\u003e\"Half a dozen. They\u0027re on your desk.\"\u003c/p\u003e\n\u003cp\u003eDana looked at the list. Joan Sinisi\u0027s name was not on it. Dana called Joan Sinisi\u0027s number. She listened to the phone ring a dozen times before she hung up. Maybe she\u0027ll change her mind again. Dana tried twice more, but there was no answer. She debated whether to go back to the apartment but decided against it. I\u0027ll have to wait until she comes to me, Dana decided.\u003c/p\u003e\n\u003cp\u003eThere was no further word from Joan Sinisi.\u003c/p\u003e\n\u003cp\u003eAt six o\u0027clock the following morning, Dana was watching the news while she got dressed. \"...and the situation in Chechnya has worsened. A dozen more Russian bodies have been found, and in spite of the Russian government\u0027s assurance that the rebels have been defeated, the fighting is still going on...In local news, a woman fell to her death from her thirtieth-floor penthouse apartment. The victim, Joan Sinisi, was a former secretary to Ambassador Taylor Winthrop. The police are investigating the accident.\"\u003c/p\u003e\n\u003cp\u003eDana stood there, paralyzed.\u003c/p\u003e\n\u003cp\u003e\"Matt, remember the woman I told you I went to see - Joan Sinisi, Taylor Winthrop\u0027s former secretary?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. What about her?\"\u003c/p\u003e\n\u003cp\u003e\"She was on the news this morning. She\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Yesterday morning she called and made an urgent appointment to meet me. She said she had something very important to tell me. I waited for her at the zoo for more than an hour. She never showed up.\"\u003c/p\u003e\n\u003cp\u003eMatt was staring at her.\u003c/p\u003e\n\u003cp\u003e\"When I talked to her on the phone, she said she thought she was being watched.\"\u003c/p\u003e\n\u003cp\u003eMatt Baker sat there, scratching his chin. \"Jesus. What the hell have we got here?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I want to talk to Joan Sinisi\u0027s maid.\"\u003c/p\u003e\n\u003cp\u003e\"Dana...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Be careful. Be very careful.\"\u003c/p\u003e\n\u003cp\u003eWhen Dana walked into the lobby of the apartment building, there was a different doorman on duty.\u003c/p\u003e\n\u003cp\u003e\"May I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Dana Evans. I came about Miss Sinisi\u0027s death. It was a terrible tragedy.\"\u003c/p\u003e\n\u003cp\u003eThe doorman\u0027s face grew sad. \"Yes, it was. She was a lovely lady. Always quiet and kept to herself.\"\u003c/p\u003e\n\u003cp\u003e\"Did she have many visitors?\" Dana asked casually.\u003c/p\u003e\n\u003cp\u003e\"No, not really. She was very private.\"\u003c/p\u003e\n\u003cp\u003e\"Were you on duty yesterday when the\" - Dana\u0027s tongue tripped on the word\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"accidenthappened?\"\u003c/p\u003e\n\u003cp\u003e\"No, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"So you don\u0027t know whether anyone was with her?\"\u003c/p\u003e\n\u003cp\u003e\"No, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"Butsomeone was on duty here?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. Dennis. The police questioned him. He was out on an errand when poor Miss Sinisi fell.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to talk to Greta, Miss Sinisi\u0027s maid.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid that\u0027s impossible.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible? Why?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s gone.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"She said she was going home. She was terribly upset.\"\u003c/p\u003e\n\u003cp\u003e\"Where is her home?\"\u003c/p\u003e\n\u003cp\u003eThe doorman shook his head. \"I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"Is anyone up in the apartment now?\"\u003c/p\u003e\n\u003cp\u003e\"No, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eDana thought fast. \"My boss would like me to do a story for WTN on Miss Sinisi\u0027s death. I wonder if I might see the apartment again? I was here a few days ago.\"\u003c/p\u003e\n\u003cp\u003eHe thought for a moment, then shrugged. \"I don\u0027t see any problem. I\u0027ll have to go up with you.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s fine,\" Dana said.\u003c/p\u003e\n\u003cp\u003eThey rode up to the penthouse in silence. When they reached the thirtieth floor, the doorman took out a passkey and opened the door to apartment A.\u003c/p\u003e\n\u003cp\u003eDana stepped inside. The apartment was exactly as Dana had last seen it. Except that Joan Sinisi is missing.\u003c/p\u003e\n\u003cp\u003e\"Did you want to see anything in particular, Miss Evans?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Dana lied. \"I just wanted to refresh my memory.\"\u003c/p\u003e\n\u003cp\u003eShe walked down the hallway to the living room and moved toward the terrace.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s where the poor lady fell off,\" the doorman said.\u003c/p\u003e\n\u003cp\u003eDana stepped out onto the huge terrace and walked over to the edge. A four-foot wall ran completely around the terrace. There was no possible way anyone could have accidentally fallen over it.\u003c/p\u003e\n\u003cp\u003eDana looked down at the street below, bustling with Christmas traffic, and thought, Who could be ruthless enough to do a thing like that? She shuddered.\u003c/p\u003e\n\u003cp\u003eThe doorman was at her side. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eDana took a deep breath. \"Yes, fine. Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Did you want to see anything else?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027ve seen enough.\"\u003c/p\u003e\n\u003cp\u003eThe lobby of the downtown police precinct was crowded with felons, drunks, prostitutes, and desperate tourists whose wallets had mysteriously disappeared.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here to see Detective Marcus Abrams,\" Dana told the desk sergeant.\u003c/p\u003e\n\u003cp\u003e\"Third door on the right.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Dana walked down the corridor.\u003c/p\u003e\n\u003cp\u003eDetective Abrams\u0027s door was open.\u003c/p\u003e\n\u003cp\u003e\"Detective Abrams?\"\u003c/p\u003e\n\u003cp\u003eHe was at the filing cabinet, a big man with a paunch and tired brown eyes. He looked over at Dana. \"Yes?\" He recognized her. \"Dana Evans. What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m told that you\u0027re handling the Joan Sinisi\" - again that word -\u0026nbsp;\u0026nbsp;\"accident.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Can you tell me anything about it?\"\u003c/p\u003e\n\u003cp\u003eHe walked over to his desk carrying a handful of papers and sat down. \"There\u0027s not much to tell. It was either an accident or suicide. Sit down.\"\u003c/p\u003e\n\u003cp\u003eDana took a chair. \"Was anyone with her when it happened?\"\u003c/p\u003e\n\u003cp\u003e\"Just the maid. She was in the kitchen at the time. She said no one else was there.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have any idea where I can reach the maid?\" Dana asked.\u003c/p\u003e\n\u003cp\u003eHe thought it over. \"She\u0027s going to be on the news tonight, eh?\"\u003c/p\u003e\n\u003cp\u003eDana smiled at him. \"Right.\"\u003c/p\u003e\n\u003cp\u003eDetective Abrams walked back to the filing cabinet and searched through some papers. He took out a card. \"Here we are. Greta Miller. Eleven-eighty Connecticut Avenue. That do it?\"\u003c/p\u003e\n\u003cp\u003eTwenty minutes later Dana was driving on Connecticut Avenue, looking at the house numbers: 1170...1172...1174...1176...1178...\u003c/p\u003e\n\u003cp\u003eNumber 1180 was a parking lot.\u003c/p\u003e\n\u003cp\u003e\"You really believe the Sinisi woman was thrown from the terrace?\" Jeff asked.\u003c/p\u003e\n\u003cp\u003e\"Jeff, you don\u0027t call to make an urgent appointment and then commit suicide. Someone didn\u0027t want her to tell me something. It\u0027s frustrating. It\u0027s like the Hound of the Baskervilles. No one heard the dog bark. No one knows anything.\"\u003c/p\u003e\n\u003cp\u003eJeff said, \"This is getting scary. I\u0027m not sure you should go on with it.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t stop now. I have to find out.\"\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re right, Dana, six people have been murdered.\"\u003c/p\u003e\n\u003cp\u003eDana swallowed. \"I know.\"\u003c/p\u003e\n\u003cp\u003e\"...and the maid gave the police a phony address and disappeared,\" Dana was saying to Matt Baker. \"When I talked to Joan Sinisi, she seemed nervous, but she certainly didn\u0027t strike me as being suicidal. Someone helped her off that balcony.\"\u003c/p\u003e\n\u003cp\u003e\"But we have no proof.\"\u003c/p\u003e\n\u003cp\u003e\"No. But I know I\u0027m right. When I first met with her, Joan Sinisi was fine until the second I mentioned Taylor Winthrop\u0027s name. That\u0027s when she panicked. This is the first time I\u0027ve seen a crack in the wonderful legend that Taylor Winthrop has built up. A man like Winthrop didn\u0027t pay off a secretary unless she had something really big on him. It had to be blackmail. There\u0027s something weird going on. Matt, do you know anyone who worked with Taylor Winthrop who might have had a problem with him, someone who\u0027s not afraid to speak up?\"\u003c/p\u003e\n\u003cp\u003eMatt Baker was thoughtful for a moment. \"You might go see Roger Hudson. He was the majority leader in the Senate before he retired, and he worked with Taylor Winthrop on a committee or two. He might know something. He\u0027s a man who\u0027s not afraid of anybody.\"\u003c/p\u003e\n\u003cp\u003e\"Could you arrange a meeting for me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see what I can do.\"\u003c/p\u003e\n\u003cp\u003eAn hour later, Matt Baker was on the line. \"You have an appointment to see Roger Hudson Thursday at noon at his home in Georgetown.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Matt. I appreciate it.\"\u003c/p\u003e\n\u003cp\u003e\"I have to warn you, Dana...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Hudson can be pretty prickly.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try not to get too close.\"\u003c/p\u003e\n\u003cp\u003eMatt Baker was about to leave his office when Elliot Cromwell came in.\u003c/p\u003e\n\u003cp\u003e\"I want to talk to you about Dana.\"\u003c/p\u003e\n\u003cp\u003e\"Any problem?\"\u003c/p\u003e\n\u003cp\u003e\"No, and I don\u0027t want there to be. This Taylor Winthrop thing she\u0027s investigating - \"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s ruffling a few feathers, and I think she\u0027s wasting her time. I knew Taylor Winthrop and his family. They were all wonderful people.\"\u003c/p\u003e\n\u003cp\u003eMatt Baker said, \"Good. Then there\u0027s no harm in Dana going ahead.\"\u003c/p\u003e\n\u003cp\u003eElliot Cromwell looked at Matt a moment, then nodded. \"Keep me informed.\"\u003c/p\u003e\n\u003cp\u003e\"Is this a secure line?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Good. We\u0027re counting heavily on the information from WTN. Are you certain your information is reliable?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely. It\u0027s coming right from the executive tower.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sky-is-falling/page-8.html","bookId":2369,"creation":"Oct 5, 2019 10:13:17 AM","modification":"Oct 5, 2019 10:13:17 AM"}
