{"id":3293,"no":22,"title":"AFTERWORD BY THE AUTHOR","content":"\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; THIS BOOK WHILE SELF-CONTAINED, IS A CONTINUATION OFThe Foundation Trilogy , which is made up of three books:Foundation ,Foundation and Empire , andSecond Foundation .\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In addition, there are other books I have written which, while not dealing with the Foundations directly, are set in what we might call “the Foundation universe.”\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Thus, the events inThe Stars, Like Dust andThe Currents of Space take place in the years when Trantor was expanding toward Empire, while the events inPebble in the Sky take place when the First Galactic Empire was at the height of its power. InPebble , Earth is central and some of the material in it is alluded to tangentially in this new book.\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In none of the earlier books of the Foundation universe were robots mentioned. In this new book, however, there are references to robots. In this connection, you may wish to read my robot stories. The short stories are to be found inThe Complete Robot , while the two novels,The Caves of Steel andThe Naked Sun , describe the robotic period of the colonization of the Galaxy.\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; If you wish an account of the Eternals and the way in which they adjusted human history, you will find it (not entirely consistent with the references in this new book) inThe End of Eternity .\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; All the books mentioned existed as Doubleday hardcovers, to begin with.The Foundation Trilogy andThe Complete Robot are still in print in hardcover. Of the others,Pebble in the Sky andThe End of Eternity are included in the omnibus volumeThe Far Ends of Time and Earth , whileThe Stars, Like Dust andThe Currents of Space are in the omnibus volumePrisoners of the Stars . Both omnibus volumes are in print in hardcover. As forThe Caves of Steel andThe Naked Sun , they are included in the omnibus volumeThe Robot Novels , still available from the Science Fiction Book Club. And all are in print in softcover editions, of course.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eＴｈｅＥｎｄ\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1626/48157.html","bookId":124,"creation":"Aug 1, 2019 4:29:42 AM","modification":"Aug 1, 2019 4:29:42 AM"}
