{"id":21754,"no":11,"title":"CHAPTER X. GERTRUDE LEAVES HER HOME.","content":"\u0026nbsp;Left to himself in the alleyway, our hero scarcely knew what to do next. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Under ordinary circumstances he would have notified a policeman of what was going on. But he reflected that Pepper had done him many kindnesses in the past, and that it was barely possible the man was not doing as much of a wrong as he imagined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll wait a while and see what turns up,\" he soliloquized, and hid himself in a dark corner, where he could watch not only the library window, but also the side alleyway leading to the street in front of the mansion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Slowly the minutes wore away until Nelson felt certain that Sam Pepper was going to remain inside all night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps something happened to him,\" he thought. \"Maybe he got a fit, or somebody caught him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He waited a while longer, then, impelled by[Pg 78] curiosity, approached the balcony, climbed up, and tried to look into the window of the library.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he did this the curtain was suddenly thrust aside, and in the dim light he found himself face to face with Gertrude Horton!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was so astonished that, for the moment, he did not know what to say or do. Gertrude was equally amazed. She quickly raised the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What brought you here?\" she questioned. \"Did you make the noise I heard a while ago?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, miss. I—er—I just came,\" stammered our hero. He knew not what to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I heard a noise. It was that which brought me downstairs. What are you doing here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came to see if—if your home was safe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To see if it was safe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. I was on the street a while ago and a man sneaked in here. Is he around?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw nobody. But I heard a noise, as I said before. I guess I had better investigate. Did the man look like a thief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He looked like lots of men,\" answered Nelson noncommittally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It must be confessed that our hero\u0027s head was in a whirl. What had become of Sam Pepper? Was it possible that he had robbed the mansion and made his escape without discovery? And if[Pg 79] he was gone, should he expose the man who, good or bad, had cared for him so many years?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Gertrude was looking around for a match, and now she lit the gas and turned it up full. She had scarcely done so when her eyes rested on a ten-dollar gold piece lying in front of the safe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A gold piece!\" she cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here is another, miss,\" returned Nelson, stepping into the room and picking it up from where it had rolled behind a footstool. \"Twenty dollars! Gracious!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gertrude! What is the meaning of this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The voice came from the hallway, and looking around the girl and our hero saw Mark Horton standing there, clad in his dressing gown and slippers. His face was filled with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, uncle!\" cried the girl. Just then she could say no more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I have caught you, have I?\" went on the retired merchant. He turned to our hero. \"Who are you, young man?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I? I\u0027m Nelson, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nelson? Is that your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fine company you keep, Gertrude, I must say,\" sneered Mark Horton. \"I would not have believed it, had I not seen it with my own eyes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, uncle——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 80]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t talk back to me. I know all about your doings. You wish——\" The retired merchant broke off short. \"What is that in your hand? A gold piece, as I live! And this young man has another! Ha! you have been at my safe!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Pale with rage, Mark Horton tottered into the room and clutched Gertrude by the arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Uncle Mark, let me go!\" she gasped in horror.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To think it has come to this!\" groaned the invalid. \"My own niece turned robber! It is too much! Too much!\" And he sank into an armchair, overcome.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hold on, sir; you\u0027re making a mistake,\" put in Nelson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Silence, you shameful boy! I know her perhaps better than you do, even though you do come to see her on the sly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Me? On the sly?\" repeated our hero, puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You talk in riddles, uncle,\" put in Gertrude faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know what I am saying. I will not argue with you. How much have you taken from the safe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nothing,\" said Gertrude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t touched your safe,\" added our hero stoutly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 81]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will soon see.\" Mark Horton glanced at the window, which was still wide open. \"Is anybody else outside?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess not,\" said Nelson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arising with an effort, the retired merchant staggered to the safe and opened it. Then he opened the secret compartment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gone! At least six hundred dollars stolen!\" he muttered. He turned upon both of the others. \"What have you done with that gold?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n AT LEAST SIX HUNDRED DOLLARS STOLEN\n\u003c/div\u003e \n\u003cdiv\u003e\n AT LEAST SIX HUNDRED DOLLARS STOLEN,\u0027 HE MUTTERED.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nelson the Newsboy. —Page 81.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle, I have not touched it,\" sobbed Gertrude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is all I have, and I just picked that up,\" added our hero and flung the piece on the table, beside that which the girl had picked up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will not believe it!\" stormed Mark Horton, more in a rage than ever. He turned to Nelson. \"You took that money away and then thought to come back for more. Or perhaps you came back to see Gertrude.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am no thief!\" cried Nelson. \"I never stole in my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a thief, and this girl is your accomplice. Stop, did you not go past the house this afternoon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did, but——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you saw Gertrude?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I saw this young lady, but——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 82]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As I suspected. You planned this thing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Uncle Mark! what are you saying?\" sobbed Gertrude. Her heart was so full she could scarcely speak. She had always treated her uncle with every consideration, and to have him turn against her in this fashion cut her to the quick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gertrude, my eyes are open at last. From to-night you leave me!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What, going to throw her out of this house—out of her home!\" ejaculated Nelson. \"Sir, I don\u0027t know you, but I think you must be off in your mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not so crazy as you imagine. I am sick—nay, I have one foot in the grave. But this shameless girl shall no longer hoodwink me. As soon as daylight comes she shall leave this house, and she shall never set foot in it again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, sir——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will waste no further words on you, young man. Out you go, or I will call a policeman at once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, uncle, don\u0027t do that!\" burst out Gertrude. \"I will go away, if you insist upon it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do insist upon it. Pack your things at once. If it were not night I would insist upon your leaving now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Gertrude looked at him, and then drew herself up with an effort.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 83]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go now, I will not wait,\" she said. \"But if ever you need me——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll not send for you,\" finished Mark Horton quickly. \"I never want to see you again.\" He turned to our hero. \"Are you going, or must I call an officer?\" he added harshly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go,\" said Nelson. He paused as if wishing to say more, then leaped through the window and disappeared into the darkness of the alleyway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As our hero left the library by the window, Gertrude left by the hall door. Slowly she mounted the steps to her own room. Once inside, she threw herself on the bed in a passionate fit of weeping. But this did not last long. Inside of half an hour she was packing a traveling case with such things as she absolutely needed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will take nothing else,\" she told herself. \"His money bought them and they shall remain here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last her preparations were complete, and she stole downstairs with her traveling case in her hand. She looked into the library, to see her uncle sitting in a heap in the armchair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-by, Uncle Mark,\" she said sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go away!\" he returned bitterly. \"Go away!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He would say no more, and she turned, opened[Pg 84] the door to the street, and passed outside. He listened as she hurried down the steps and along the silent street. When he could no longer hear her footsteps he sank back again into the armchair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gone!\" he muttered. \"Gone, and I drove her away! What a miserable man I am! What a miserable man!\" And then he threw himself down again. He remained in the armchair for the rest of the night, weaker than ever, and tortured by an anguish he could not put into words.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2991/82495.html","bookId":321,"creation":"Aug 2, 2019 2:19:51 PM","modification":"Aug 2, 2019 2:19:51 PM"}
