{"id":21778,"no":35,"title":"CHAPTER XXXIV. FATHER AND SON—CONCLUSION.","content":"\u0026nbsp;\"It\u0027s Nelson an\u0027 Miss Gertrude I want to see,\" those in the sick chamber heard Mrs. Kennedy exclaim. \"An\u0027 I want to see \u0027em at once. I have great news for \u0027em.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go,\" said Nelson, and slipped downstairs, followed by Gertrude. They found Mrs. Kennedy in a state of high excitement. Her faded bonnet was on one ear, and she walked the floor rapidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, my! Upon me soul, I can\u0027t belave it!\" she burst out. \"It\u0027s like a dream, Nelson, so it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is like a dream, Mrs. Kennedy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The story I have to tell, Nelson. Poor, poor man! but it was all for the best—wid that crime on his mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you talking about?\" put in Gertrude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m talkin\u0027 av poor Sam Pepper, Miss Gertrude. He\u0027s dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 267]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dead!\" burst out Gertrude and Nelson simultaneously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Kennedy nodded her head half a dozen times.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, dead; cut to pieces on the elevated railroad, at the station close to me little stand. He died wid me a-holdin\u0027 av his hand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s too bad,\" murmured Nelson. \"Poor fellow! he had some ways about him that I liked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it\u0027s not that I came about,\" went on Mrs. Kennedy. \"Whin they brought the poor man to the sidewalk to wait for an ambulance, I stayed by him, and he says to me, says he, \u0027Mrs. Kennedy, I have something on me mind,\u0027 says he. \u0027I want to tell it to you,\u0027 says he. So says I, \u0027What is it?\u0027 Says he, \u0027It\u0027s about Nelson. He\u0027s a good boy,\u0027 says he. \u0027And I aint done right by him. Tell him I stole him from his father, and that his father is Mr. Mark Horton, Miss Gertrude\u0027s uncle.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mark Horton my father!\" gasped Nelson, and the room seemed to go round and round in a bewildering whirl. \"He my father! Can it be true?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be true!\" cried Gertrude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he says, too, \u0027Beware of Homer Bulson. He is a thief—he robbed his uncle\u0027s safe.[Pg 268] I caught him at it. He has his uncle\u0027s will, too,\u0027 says poor Pepper. \u0027He wants to git hold of all the money,\u0027 says he.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know Homer Bulson is a rascal,\" said Nelson. \"But this other news——\" He sank in a chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are David Horton, Nelson!\" cried Gertrude. \"I am indeed very glad of it. I know of no one I would like more for a cousin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"David Horton!\" came a hollow voice from the doorway, and Mr. Horton staggered in. \"Can this be possible? It must be! See, I recognize his face now. Yes, yes; you are my son David! Come to me!\" And he held out his arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nelson came forward slowly, then of a sudden he reached forth, and grasped Mark Horton\u0027s hands tightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I suppose it\u0027s true,\" he faltered. \"But it will take me a long time to—to get used to it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My little David had just such eyes and hair as you have,\" went on Mark Horton, as he still held Nelson closely to him. \"And your face reminds me greatly of your mother. There can be no mistake. You are my own little David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 269]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I\u0027m glad that I\u0027m not Nelson, the nobody, any longer,\" stammered our young hero. He could scarcely talk intelligibly, he felt so queer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My own cousin David!\" said Gertrude, and she, too, embraced him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I always thought we\u0027d be something to each other, Gertrude,\" said he. \"But, come to think of it, if I am David Horton, then Homer Bulson is a cousin, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Unfortunately, yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do not fear! He shall not come between you,\" said Mark Horton. \"My eyes are being opened to his schemes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sure an\u0027 he\u0027s a snake in the grass,\" burst out Mrs. Kennedy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had scarcely spoken when there was another arrival at the mansion, and Homer Bulson came in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On seeing the assembled company, he was nearly struck dumb. He looked from one to another in open-mouthed and speechless amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why—er—how did you get here?\" he questioned at last, addressing Gertrude.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my affair, Mr. Bulson,\" she answered coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you?\" he added, turning sharply to our[Pg 270] hero. \"You have no business in a gentleman\u0027s house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Homer!\" exclaimed Mark Horton, and shook his fist at his nephew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hush, uncle! We will deal with him,\" remonstrated Gertrude. \"Pray, do not excite yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have business here,\" said our hero dryly, realizing that he had a great advantage over Bulson. \"You hardly expected to see Gertrude come back from Lakewood so soon, did you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—er—I know nothing of Lakewood,\" stammered Bulson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That proves you have a wonderfully short memory, Homer Bulson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t listen to you. You get right out of this house.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t get out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll call an officer, and have you put out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you call an officer, you\u0027ll be the one to go with him,\" returned our hero calmly. \"Homer Bulson, your game is played to the end, and you have lost.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boy, you talk in riddles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll explain myself. You plotted to drive Gertrude from this house, and you [Pg 271]succeeded. Then you plotted against your uncle, and had Gertrude made a prisoner at Lakewood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stuff and nonsense!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the truth. Perhaps you\u0027ll deny next that you ever knew Sam Pepper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, has that fool come here?\" roared Bulson, in a rage. \"I told him——\" He stopped short in confusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sam Pepper is dead—killed on the elevated railroad. Before he died he confessed several things, and, among others, what a villain you were.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ah! and what else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said I was the son of Mr. Horton here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this Homer Bulson grew as pale as death. He clutched at a table, then sank heavily on a near-by chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is—is false,\" he muttered, but his looks belied his words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is true,\" broke in Mark Horton. \"The boy is my son. This Sam Pepper was merely Pepperill Sampson in disguise. Homer, you are a villain!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Mark——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t listen to you. I listened before; now I am done. If you ever try to lift a finger[Pg 272] against Gertrude or David, I will cut you off without a penny.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But—but——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am having the wine which you gave me examined. If I find that it was doctored—well, you had better be missing, that\u0027s all,\" added Mark Horton sternly. \"I am willing to do much to avoid a family scandal, but I will not stand too much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who—who has the wine?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The doctor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this piece of information Homer Bulson leaped to his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s an outrage! I won\u0027t stand it!\" he shouted. \"You are all plotting against me!\" And so speaking, he ran to the hall, picked up his silk hat, and hastily rushed from the mansion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I go after him?\" questioned our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; let him go,\" returned the retired merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But he will never come back—you may be certain of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So much the better, for then all scandal will be avoided, and we will be very well rid of him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; let him go,\" added Gertrude. [Pg 273]\"Possibly he will repent and turn over a new leaf.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right! Give him the chance,\" murmured the boy, and then turning to his father, he added: \"I guess I can afford to be generous when I\u0027ve gained a father, and such a cousin as Gertrude!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few words more, and then we will bring this story of life in New York City to a close.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As anticipated, Homer Bulson fled from the city without delay, and nothing was heard of him for months, when it was learned that he had joined an exploring expedition bound for South Africa. A year later he sent a long letter to his uncle, stating that he was in the mines of the Transvaal, and doing fairly well. He added that he bitterly repented of his wrongdoings, and hoped his uncle and the others would forgive him. To this Mr. Horton replied that he would forgive him if he continued to make a man of himself, and this Bulson did, within his limited ability.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Great was George Van Pelt\u0027s astonishment when he learned that Nelson was Mr. Horton\u0027s lost son. At first he refused to believe what was told him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 274]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are lucky,\" he said at last. \"You won\u0027t want the news stand any longer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said our hero. \"I\u0027m going to give my share to Paul Randall. And what is more, I\u0027ll pay that money we borrowed from Mr. Amos Barrow; so neither of you will have any debt hanging over you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero was as good as his word, and not only did he clear the news stand, but some time later he purchased a better fruit-and-candy stand for Mrs. Kennedy, and also a first-class flower stand for Gladys Summers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a fine young gentleman,\" said Mrs. Kennedy. \"A fine boy, Nelson—beggin\u0027 your pardon, Master David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m not used to the name yet,\" laughed our hero. \"I guess I will be Nelson the Newsboy for a long time to come among my old friends.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am very thankful to you,\" said Gladys. \"That flower stand is just what I wanted.\" And she gave Nelson her sweetest smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nothing had been heard of the Victory or of Billy Darnley. The ship sailed to the West Indies and to South America, and from there to the Pacific, and whatever became of the bully David Horton never learned, nor did he care. Len Snocks drifted to Jersey City, and then to[Pg 275] the West, and became a tramp, and was at last killed while stealing a ride on a freight train.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as it was discovered how Mr. Horton had been slowly poisoned, the doctor set to work to counteract the effects of the drugs. Gertrude, our hero, and Mrs. Conroy took turns in caring for the sick man, and before very long he began to show signs of rapid improvement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is like some terrible nightmare,\" he explained one day, when walking out, with Gertrude on one side of him and David on the other. \"I was not myself at all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, you were not yourself,\" said Gertrude. \"But you soon will be.\" And she was right. By the following spring Mark Horton was a comparatively well man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These events all occurred a number of years ago, and since that time several important things have happened to our hero. As soon as his identity was established he was provided with a private tutor, who taught him for several years and prepared him for Columbia College. He passed through college with flying colors,, and then took up civil engineering, and to-day he is building large bridges for a leading railroad company. He is doing well, and is [Pg 276]devoted to his work. He lives with his father and his cousin and is very happy. But even in his happiness it is not likely that he will ever forget the days when he was \"Nelson the Newsboy.\"\n\u003c/div\u003e   \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2991/82519.html","bookId":321,"creation":"Aug 2, 2019 2:19:51 PM","modification":"Aug 2, 2019 2:19:51 PM"}
