{"id":21747,"no":4,"title":"CHAPTER III. SAM PEPPER\u0027S RESORT.","content":"\u0026nbsp;\"Well, how have you done to-day?\" asked Sam Pepper, when Nelson entered the lunch-room and came to the rear, where Pepper stood mixing some liquors. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I sold quite a few papers,\" answered Nelson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How many?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Over a hundred.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I guess you made over a dollar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s more than I\u0027ve made to-day,\" growled Pepper. \"Business is growing worse and worse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nelson knew that he must have made more than a dollar, but he did not say anything on the point. He saw that Sam Pepper was in an ugly mood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me you ought to begin paying something for your keep,\" went on the lunch-room keeper, after he had returned from serving the drinks he had been mixing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 18]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, I\u0027m willing,\" said Nelson readily. \"But I don\u0027t get much from here now, remember.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s not my fault if you are not here at dinner time. Plenty of eating going to waste.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not going to eat other folks\u0027 left-overs,\" said the newsboy, remembering the offer made to him several days before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Those left-overs are good enough for the likes of you, Nelson. Don\u0027t git high-toned before you can afford it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you want me to pay?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You ought to pay me at least five dollars a week,\" growled Sam Pepper, after a crafty look into the boy\u0027s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five dollars a week!\" ejaculated Nelson in surprise. \"Why, I don\u0027t make it, excepting when business is good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it\u0027s got to be five dollars a week after this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can get board at other places for three.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t go to no other place. You\u0027ll stay here, and if you make a dollar or more a day you\u0027ll pay me the five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But who will buy me any clothes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Aint that suit good enough?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, it\u0027s not. I was saving up to buy another suit, but Billy Darnley stole five dollars of the[Pg 19] savings from me this morning,\" went on Nelson bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stole five dollars from you? I don\u0027t believe you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s true.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you ought to lose the money, seeing that you didn\u0027t pass it over to me,\" grumbled Sam Pepper. \"After this, you let me save your money for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point some customers came in, and Sam had to wait on them. Seeing this, the newsboy passed around the bar and into the two rooms which he and Pepper called home. They were gloomy and foul-smelling, but the newsboy did not mind this, for he was used to the surroundings. Yet his heart was heavy, as he threw himself into a dilapidated chair and gave himself up to his thoughts.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The new suit of clothes seemed further off than ever, for, if he must pay Sam Pepper five dollars a week for his board, it would be utterly impossible for him to save a cent. The extra money would be needed to buy fresh papers each day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t fair!\" he muttered. \"It isn\u0027t fair, and I won\u0027t stand it! I\u0027ll run away first; that\u0027s what I\u0027ll do!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Running away was no new idea, but, as before, he thought of the past and of what Sam Pepper[Pg 20] might have locked up in his breast. No, it would not do to go away. He must unlock the mystery of the past first.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll question Sam to-night, and I\u0027ll make him tell something,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The resolve had hardly crossed his mind when Pepper opened the door with a bang, as it flew back against the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come out here and help me,\" he snarled. \"There is plenty of work to do. The kitchen woman has left me in the lurch. Throw off your coat and git into that dishpan, and be lively about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Without a word, Nelson did as bidden. He had washed dishes before, and though the pile beside him was by no means small, he soon made away with them. Then Pepper set him to polishing up the knives, forks, and spoons, and this task took until it was time to close for the night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After the lunch-room had been locked up, and most of the lights put out, Sam Pepper went to the bar and mixed himself an extra-large glass of liquor. This was his \"nightcap,\" as he called it, and usually, after drinking it, he would retire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n To-night, however, after consuming the liquor, he went into one of the back rooms and got out his best coat and his hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 21]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m going out an hour or so,\" he said. \"You keep good watch while I\u0027m away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" answered Nelson. He was disappointed at not being able to question Pepper, but saw there was no help for it. Soon the man was gone, and Nelson was left alone. Pepper had locked the street door and taken the key with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The day\u0027s work had made Nelson tired, but he was in no humor for sleeping, and tumbled and tossed for a long while after lying down upon his hard couch. He thought of the stout gentleman, of the big newsboy who had robbed him, and of the kind young lady who had offered him assistance. For some reason he could not get the young lady out of his mind, and he half wished he might see her again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then his thoughts came back to himself. Who was he, and how had he come into Sam Pepper\u0027s care? Surely the man must know all about the past. What could Pepper be hiding from him?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last he fell asleep, and did not rouse up until early morning. Sam Pepper was just returning, and a glance showed that the man was more than half under the influence of liquor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a good game,\" muttered Pepper to himself, as he stumbled around, preparing to retire,[Pg 22] \"A good game, and it will make me rich. And Nelson shall help me, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Help you at what?\" asked the newsboy sleepily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never mind now, you go to sleep,\" answered Pepper sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He pitched himself on his bed and was soon snoring lustily, and seeing this Nelson did not attempt to disturb him. He slept soundly for the rest of the night, and by six o\u0027clock was outdoors and on his way to get his supply of morning papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Pepper had warned him to come back by eleven o\u0027clock, to go at the dishes again, for the kitchen woman was not coming back. This made him cautious about investing in newspapers. However, trade proved brisk, and by ten o\u0027clock he had sold out, and cleared sixty cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t buy any more papers until after dinner,\" he said to himself. \"I\u0027ll walk down to the ferry and see if I can find out anything about Billy Darnley.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the ferry there was the usual rush of passengers, the noise of the heavy trucks coming and going, and the shrill cries of the newsboys. Nelson stopped near the ferryhouse to view the scene.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hardly had he paused when his attention was[Pg 23] attracted to a quarrel between a large newsboy and a small one. The larger lad was shaking his fist in the face of the smaller.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You keep away from dis corner, Paul Randall!\" said the big newsboy. \"If yer don\u0027t I\u0027ll fix yer, remember dat!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have as much right here as you, Len Snocks!\" replied the little fellow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yer aint got no right here at all!\" blustered Len Snocks. \"Dis is my spot, see?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t pay for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t yer talk back ter me!\" howled Len Snocks, and catching the little lad\u0027s stock of papers he threw them down in the mud of the street. \"Now clear out, or I\u0027ll t\u0027row you down de same way,\" he went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The scene made Nelson\u0027s blood boil. He recognized both boys, and knew that Paul Randall helped support a mother who was half blind. Len Snocks was a bully belonging to the crowd with whom Billy Darnley associated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Rushing across the roadway, Nelson caught Len Snocks by the arm and held him tightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You big brute!\" he cried. \"Why don\u0027t you tackle a fellow your own size?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Nelson, he has spoiled my papers!\" sobbed Paul, running to save what was left of the stock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 24]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lemme go!\" snarled Len Snocks. \"Lemme go, do yer hear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must give Paul clean papers for the dirty ones,\" returned Nelson firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t do it!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll make you do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Make me?\" roared Len. \"I\u0027d like to see you try it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a twinkle Nelson placed one foot behind the bully. Then he gave the big newsboy a shove which landed him flat on his back. On the instant he was down on top of Len.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How many papers are dirty, Paul?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two Suns, a World, and a Journal,\" was the quick answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take \u0027em out of Len\u0027s pile.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lemme up, or I\u0027ll kill you!\" howled the bully, and struggled to arise. But Nelson was master of the situation. He continued to hold Len down, and did not let go until Paul had the papers he wished. Then he leaped up, squared off on the defensive, and awaited the outcome of the encounter. Paul lost no time in placing himself behind his newly found champion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2991/82488.html","bookId":321,"creation":"Aug 2, 2019 2:19:51 PM","modification":"Aug 2, 2019 2:19:51 PM"}
