{"id":21752,"no":9,"title":"CHAPTER VIII. THE COMBINATION OF THE SAFE.","content":"\u0026nbsp;\"Gertrude, you are making a great mistake,\" said Homer Bulson, after a pause broken only by the sobbing of the girl. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Please don\u0027t speak to me, Homer,\" she answered. \"I have heard enough for one day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have no right to blacken my character,\" he said with assumed dignity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Mark forced me to speak the truth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was not the truth. But let that pass. Why didn\u0027t you tell him you would marry me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I don\u0027t want to marry you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you might let him think that you——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am above practicing a deception upon him, Homer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you aren\u0027t a saint!\" he sneered. \"I know why you are so loving to him—you thought to get all of his money. Now you are trying to blacken my character, so that you may get all of it, anyway. But the game won\u0027t work.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I told him what I did simply to let him know why I didn\u0027t care to marry you, Cousin Homer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 64]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And why are you so opposed to me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do not like your ways. Isn\u0027t that enough? As for Uncle Mark\u0027s money, I trust he will live a long time to enjoy it himself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Mark can live but a short while longer. Anybody can see that. He is exceedingly feeble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem to wish his death,\" replied Gertrude sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I? No, indeed; I hope he does live. Haven\u0027t I done what I could for him—giving him wines and the like? And he has the best of doctors—on my recommendation.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think the wine you gave him is doing any good. He seems to become weaker after it, instead of stronger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bosh! If he hadn\u0027t the wine, he would collapse utterly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this the girl merely shrugged her shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was not the first time that Homer Bulson and herself had quarreled over the care their uncle should have. To the girl the retired merchant seemed to grow unexpectedly weak in spite of all she could do. The doctor, too, was baffled, and said he had never come across such a strange case before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you won\u0027t marry me, you shall not turn Uncle Mark against me,\" went on Bulson sternly.[Pg 65] \"If you try it, you will repent it as long as you live.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So speaking, he strode from the room and made after Mark Horton, who had gone to his private apartment on the second floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He found the retired merchant resting in an easy-chair by the window, his head bowed low.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cheer up, uncle,\" he said, placing his hand on the other\u0027s shoulder. \"Let me pour you a glass of wine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he walked to a medicine closet in a corner and got out a bottle he had brought a few days before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Homer; I will have a little wine,\" replied the retired merchant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The wine was poured out and Mark Horton gulped it down. Homer Bulson watched him closely, and then turned away his face to hide a sinister smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot understand Gertrude,\" said Mark Horton. \"I always thought she preferred you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think she has another person in view,\" answered Bulson, struck with a certain idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Another? Who is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would rather not say, uncle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I demand to know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I cannot tell you his name. But he is a [Pg 66]common sort of person. He went past the house a while ago and she nodded and smiled to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how long has this been going on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, several months, I dare say. They meet in the evening on the sly. But please don\u0027t tell Gertrude that I spoke of this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does the man do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not sure, but I think he is in the theatrical business, when he has an engagement—something on the variety stage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! My Gertrude the wife of a variety actor? Never, Homer, never!\" groaned Mark Horton. \"This is too much! I will speak to her at once!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle, you just promised not to let her know——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be safe, Homer, never fear. But I won\u0027t have this—I\u0027ll cast her out first.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose she wanted to keep this a secret until after you—that is——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Until after I am dead, so that she can use up my money on her actor husband,\" finished Mark Horton bitterly. He suddenly sprang to his feet. \"But she shall marry you, Homer, and nobody else. That is final.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pray do not excite yourself too much, uncle. Let the matter rest for a few days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And if I should die in the meantime, what[Pg 67] then? No, Homer; delays are dangerous. I—I—feel as if I cannot last much longer. Who knows but what this night may prove my last?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Mark Horton sank back again in his chair and covered his face with his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle, in case anything should happen to you, may I ask what you have done with your will?\" asked Bulson, after a long pause. \"Or, perhaps Gertrude knows about this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, she knows, but you must know, too. Both the old will and the new one are in the safe in the library, in the upper compartment on the right side. On the left side are two gold pieces which I brought home with me when I visited the mint in California.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that all the money there is in the safe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, there is more gold than that—in a secret compartment at the bottom. There is a spring to open this compartment on the left side, a small gilded knob. It is right I should tell you of this, otherwise you might never find the secret compartment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And the combination of the safe?\" went on Bulson, more anxiously than ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The combination is 0, 4, 25, 12, 32, and once around to the left to 0 again. You had better put it down. I have it written on a slip in my pocketbook.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 68]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it won\u0027t be necessary for me to put it down,\" answered the nephew, but he took good care to remember the combination, nevertheless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was now time for Mark Horton to retire, and, the wine having made him drowsy, he soon forgot his anger against Gertrude and went to sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Homer Bulson went below he paused in the hallway and glanced through the doorway into the library.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He saw that Gertrude had left the apartment and that it was empty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n None of the servants were about, and the housekeeper, an elderly lady, was also nowhere to be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder if I dare do it so soon?\" he muttered to himself. Then he shut his teeth hard. \"I must do something! I have used up my last dollar, and I can\u0027t go around empty-handed. Uncle Mark will never grow strong enough to know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Going to the front door he opened it, then slammed it violently and made a noise as if he was descending the steps. Then he closed the door with care and stole back into the gloom of the library. It was now after midnight, a fitting time for the desperate deed this misguided young man had undertaken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2991/82493.html","bookId":321,"creation":"Aug 2, 2019 2:19:51 PM","modification":"Aug 2, 2019 2:19:51 PM"}
