{"id":21221,"no":23,"title":"CHAPTER XXIII. THE FIRST DAY AT THE MINES.","content":"About three o’clock in the afternoon the stage from Sacramento arrived at Howe’s Gulch.\n\u003cbr\u003e \n\u003cbr\u003e Among the other passengers Grant descended, his limbs sore from rattling over the roughest kind of roads, and stretching himself, he looked around him.\n\u003cbr\u003e \n\u003cbr\u003e The stage had drawn up in front of the hotel, but it was not such a hotel as the reader is accustomed to see. It was a long, low frame building, with what might be called an attic overhead, which was used as a general dormitory, with loose beds of straw spread over the floor. Here twenty-five persons slept in a single room. Down below rude meals were supplied for those who could afford to pay the price.\n\u003cbr\u003e \n\u003cbr\u003e 198But Grant felt little interest in the hotel. He expected to meet Tom Cooper, and looked out for him.\n\u003cbr\u003e \n\u003cbr\u003e He had not long to wait.\n\u003cbr\u003e \n\u003cbr\u003e “How are you, Grant? Delighted to see you. How’s the folks?”\n\u003cbr\u003e \n\u003cbr\u003e Grant turned, and in the bearded, roughly dressed miner found it difficult to recognize his friend of the plains—Tom Cooper.\n\u003cbr\u003e \n\u003cbr\u003e His face lighted up as he grasped Tom’s hand cordially.\n\u003cbr\u003e \n\u003cbr\u003e “Your father and mother are well,” he said, “and so is Mr. Silverthorn.”\n\u003cbr\u003e \n\u003cbr\u003e “What! have you seen that scoundrel?”\n\u003cbr\u003e \n\u003cbr\u003e “I left him at Sacramento. He wanted me to pay his fare out here.”\n\u003cbr\u003e \n\u003cbr\u003e “You declined?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I thought he would be company for your father. He may adopt Silverthorn in your place.”\n\u003cbr\u003e \n\u003cbr\u003e “He’s welcome to him, if he likes. It’s good for sore eyes to see you, Grant. How do you feel?”\n\u003cbr\u003e \n\u003cbr\u003e “Sore enough. I thought I should be shaken to pieces over the rough road.”\n\u003cbr\u003e \n\u003cbr\u003e 199“You are hungry, I reckon. Come into the hotel, and we’ll have dinner.”\n\u003cbr\u003e \n\u003cbr\u003e Nothing loath, Grant followed Tom into the dining-room, where dinner was laid in readiness for the stage passengers. It was not such a meal as an epicure would enjoy, but Grant ate with great relish.\n\u003cbr\u003e \n\u003cbr\u003e “So you have been doing well, Tom?” said Grant, between two mouthfuls.\n\u003cbr\u003e \n\u003cbr\u003e “Yes; you didn’t tell father what I wrote you?”\n\u003cbr\u003e \n\u003cbr\u003e “No; you told me not to.”\n\u003cbr\u003e \n\u003cbr\u003e “What did he say about me?”\n\u003cbr\u003e \n\u003cbr\u003e “He said that he didn’t believe you were doing much; he thought you had better come back to Sacramento and help him in the shop.”\n\u003cbr\u003e \n\u003cbr\u003e Tom laughed.\n\u003cbr\u003e \n\u003cbr\u003e “I think I’ll stay here a little longer,” he replied. “How is dad doing?”\n\u003cbr\u003e \n\u003cbr\u003e “Finely. He is making ten dollars a day.”\n\u003cbr\u003e \n\u003cbr\u003e “Good for him! He wouldn’t do for mining. Besides, there’s mother. He’s better off where he is.”\n\u003cbr\u003e \n\u003cbr\u003e “Where do you sleep, Tom?”\n\u003cbr\u003e \n\u003cbr\u003e “Upstairs. I have a pair of blankets up 200there, and a pillow, and I don’t need anybody to make my bed.”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose I ought to have a pair of blankets.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll buy you a pair. There’s a chap going to leave to-day, and we can buy his. Now come out and see the mines.”\n\u003cbr\u003e \n\u003cbr\u003e Leaving the hotel, Tom led the way to the mining claims. There was a deep gulch half a mile distant, at the base of which ran a creek, and it was along this that the claims were staked out. They were about twenty feet wide, in some cases more. Tom led the way to his, and showed Grant the way he worked. He used a rocker, or cradle. A sieve was fitted in at the top, and into this the miner shoveled the dirt. Tom rocked the cradle with one hand, after it was filled, and poured water on the dirt from a dipper. Gradually the dirt was washed out, and if there was any gold it would remain in small gleaming particles mixed with black sand.\n\u003cbr\u003e \n\u003cbr\u003e “Isn’t that rather a rough way of working, Tom?” asked Grant, after his tour of inspection.\n\u003cbr\u003e \n\u003cbr\u003e 201“Yes; I have been thinking of getting what the miners call a ‘long tom’—no pun intended.”\n\u003cbr\u003e \n\u003cbr\u003e “What is that?”\n\u003cbr\u003e \n\u003cbr\u003e I won’t give Tom’s answer, but quote a more accurate description from an English book published in 1857: “A ‘long tom’ is nothing more than a wooden trough from twelve to twenty-five feet long, and about a foot wide. At the lower end it widens considerably, and the floor of it is a sheet of iron, pierced with holes half an inch in diameter, under which is placed a flat box a couple of inches deep. The long tom is set at a slight inclination over the place which is to be worked, and a stream of water is kept running through it by means of a hose. While some of the party shovel the dirt into the tom as fast as they can dig it up, one man stands at the lower end, stirring up the dirt as it is washed down, separating the stones and throwing them out, while the earth and small gravel fall with the water through the sieve into the ripple box. This box is about five feet long, and is crossed by two partitions. It is also placed at an inclination, 202so that the water falling into it keeps the dirt loose, allowing the gold and heavy particles to settle to the bottom, while all the lighter stuff washes over the end of the box along with the water.”\n\u003cbr\u003e \n\u003cbr\u003e The dirt taken out of the ripple box has to be washed out afterward, so as to leave the gold particles.\n\u003cbr\u003e \n\u003cbr\u003e “Where is the claim you have bought for me, Tom?” asked Grant.\n\u003cbr\u003e \n\u003cbr\u003e “A little farther down the creek. I will show you.”\n\u003cbr\u003e \n\u003cbr\u003e “Lend me your cradle, and, see if I can work it.”\n\u003cbr\u003e \n\u003cbr\u003e Grant took the cradle and, under Tom’s direction, shoveled in some dirt, and proceeded to rock it. He was quite delighted when, as the result of his labors, a few specks of gold appeared at the bottom.\n\u003cbr\u003e \n\u003cbr\u003e “How much does it amount to, Tom?” he asked, gathering it into his hand.\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps a dime.”\n\u003cbr\u003e \n\u003cbr\u003e Grant looked rather disappointed.\n\u003cbr\u003e \n\u003cbr\u003e “It would take some time to get rich at that rate,” he said rather ruefully.\n\u003cbr\u003e \n\u003cbr\u003e 203“Yes; but there is always a chance of ‘striking it rich.’ That is what keeps our spirits up. By the way, Grant, I have a proposal to make to you.”\n\u003cbr\u003e \n\u003cbr\u003e “What is it, Tom?”\n\u003cbr\u003e \n\u003cbr\u003e “Suppose we work together. We can take turns in digging, shovelling in the dirt, and rocking the cradle. That will be more sociable, and we can divide equally whatever gold we obtain.”\n\u003cbr\u003e \n\u003cbr\u003e “That will suit me exactly, Tom; but as you are more experienced than I, you ought to have more than half.”\n\u003cbr\u003e \n\u003cbr\u003e “No, Grant. It shall be share and share alike. There is another advantage. It will save getting an extra rocker.”\n\u003cbr\u003e \n\u003cbr\u003e “I am ready to begin at once.”\n\u003cbr\u003e \n\u003cbr\u003e “Are you not too tired?”\n\u003cbr\u003e \n\u003cbr\u003e “No, Tom. I want to feel that I have begun to work. If I get tired I can sleep better to-night.”\n\u003cbr\u003e \n\u003cbr\u003e They worked for two hours, when they knocked off for the day. The work was done on Grant’s claim. Tom estimated the result at a dollar.\n\u003cbr\u003e \n\u003cbr\u003e 204“That is fifty cents apiece,” he said. “To-morrow we’ll do better.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t mind, Tom. I have made a beginning. Now I feel that I am a miner.”\n\u003cbr\u003e \n\u003cbr\u003e At six o’clock they went to the hotel, which was a general lounging-place for the miners.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1644/48600.html","bookId":1227,"creation":"Aug 2, 2019 12:53:47 PM","modification":"Aug 2, 2019 12:53:47 PM"}
