{"id":21225,"no":27,"title":"CHAPTER XXVII. PAUL CRAMBO.","content":"Full of hope, Grant and Tom arrived at the cabin of the old man who had promised them his claim.\n\u003cbr\u003e \n\u003cbr\u003e “How are you feeling this morning?” inquired Grant, when they were admitted.\n\u003cbr\u003e \n\u003cbr\u003e “Rather stiff, but better than yesterday. Is this your friend?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. His name is Tom Cooper.”\n\u003cbr\u003e \n\u003cbr\u003e The old man scrutinized him closely.\n\u003cbr\u003e \n\u003cbr\u003e “It’s a good face,” he said. “You can trust him.”\n\u003cbr\u003e \n\u003cbr\u003e “I do.”\n\u003cbr\u003e \n\u003cbr\u003e Tom looked well pleased.\n\u003cbr\u003e \n\u003cbr\u003e “You have come to ask me to keep my promise.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. Your offer was a very kind one. On the strength of it we have given our claims 227at Howe’s Gulch to a stranger, who came to our cabin last night penniless.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I shall be helping him, too. Are you ready to go to work at once?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes; that’s our hope.”\n\u003cbr\u003e \n\u003cbr\u003e “The place where I made my pile is fifteen miles away. Are you good for a long walk?”\n\u003cbr\u003e \n\u003cbr\u003e “I am,” answered Grant.\n\u003cbr\u003e \n\u003cbr\u003e “I will try to keep up with you,” said Tom Cooper, smiling.\n\u003cbr\u003e \n\u003cbr\u003e “My claim was on a creek at the base of a hill, about a mile from a village called Eldora. In the pocket of yonder coat I have drawn, roughly, a plan of the place, which will be a sufficient guide.”\n\u003cbr\u003e \n\u003cbr\u003e “May I keep the paper?” asked Grant.\n\u003cbr\u003e \n\u003cbr\u003e “Certainly.”\n\u003cbr\u003e \n\u003cbr\u003e “If we start now, Grant, we can get there before night.”\n\u003cbr\u003e \n\u003cbr\u003e “Go, then, and may success attend you.”\n\u003cbr\u003e \n\u003cbr\u003e “Can’t we do anything for you before we go, sir?”\n\u003cbr\u003e \n\u003cbr\u003e “No, thank you. One thing, however, I will ask. In a month, let me know how you are getting along. I look upon you as my 228successors. I hope you may be as fortunate as I was.”\n\u003cbr\u003e \n\u003cbr\u003e The two friends set out with stout hearts, in excellent spirits. The walk was long and fatiguing, but there is nothing like hope to sweeten toil. About midway they sat down under a tree, and ate, with hearty appetite, the lunch they had taken the precaution to carry with them.\n\u003cbr\u003e \n\u003cbr\u003e “I wish there was more,” said Grant wistfully.\n\u003cbr\u003e \n\u003cbr\u003e “Your appetite seems improving.”\n\u003cbr\u003e \n\u003cbr\u003e “There’s nothing like a good walk to make a fellow feel hungry. I wonder how Stockton is getting along.”\n\u003cbr\u003e \n\u003cbr\u003e “He will make something at any rate. I pity Silverthorn if ever our long-legged friend gets hold of him.”\n\u003cbr\u003e \n\u003cbr\u003e After an hour they resumed their walk, and about four o’clock they reached their destination. They visited the location of the claim, and surveyed it with a guarded manner, not wishing to draw attention to it.\n\u003cbr\u003e \n\u003cbr\u003e They fell in with a thin man, of medium stature, who talked in a drawling tone. He 229seemed to have a considerable share of curiosity.\n\u003cbr\u003e \n\u003cbr\u003e “Where might you be from, strangers?” he inquired.\n\u003cbr\u003e \n\u003cbr\u003e “We might be from China, but we aint,” said Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Is that a joke?” asked their new acquaintance, puzzled.\n\u003cbr\u003e \n\u003cbr\u003e “Yes; it’s an attempt at a joke.”\n\u003cbr\u003e \n\u003cbr\u003e “I reckon you don’t want to tell.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes; we’re entirely willing. We came from Howe’s Gulch.”\n\u003cbr\u003e \n\u003cbr\u003e “So? Did you strike it rich there?”\n\u003cbr\u003e \n\u003cbr\u003e “No; we struck it poor,” said Grant, with a smile. “We found ourselves headed for the poorhouse, so we switched off.”\n\u003cbr\u003e \n\u003cbr\u003e “I was at Howe’s Gulch myself a year ago.”\n\u003cbr\u003e \n\u003cbr\u003e “Did you have luck?”\n\u003cbr\u003e \n\u003cbr\u003e “Not much. I paid expenses.”\n\u003cbr\u003e \n\u003cbr\u003e “Are you mining now?”\n\u003cbr\u003e \n\u003cbr\u003e “No; I’m farming. I live just out of the village—me and Mrs. Crambo, and a boy that’s working for us.”\n\u003cbr\u003e \n\u003cbr\u003e “How far from here?”\n\u003cbr\u003e \n\u003cbr\u003e 230“About a mile.”\n\u003cbr\u003e \n\u003cbr\u003e “How would you like a couple of boarders?”\n\u003cbr\u003e \n\u003cbr\u003e “Are you going to stay ’round here?“\n\u003cbr\u003e \n\u003cbr\u003e “We may—for a while.”\n\u003cbr\u003e \n\u003cbr\u003e “Come to the house, then, and speak to Mrs. Crambo. If she’s agreeable, I am.”\n\u003cbr\u003e \n\u003cbr\u003e They accompanied their new friend to a plain, but comfortable house, looking not unlike a New England farm-house. Mrs. Crambo was a pleasant looking woman, weighing at least fifty pounds more than her lord and master. She was evidently the “better man of the two,” being active and energetic, while he was slow and seemed to find exertion difficult.\n\u003cbr\u003e \n\u003cbr\u003e “If you are willing to set up a hotel, Mrs. Crambo,” said her husband, “I bring you two boarders for a starter.”\n\u003cbr\u003e \n\u003cbr\u003e “I shouldn’t mind a little company,” she said pleasantly. “How long have you been out here?”\n\u003cbr\u003e \n\u003cbr\u003e “Not long enough to make our fortunes,” answered Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Do you expect to make them out here?” she asked shrewdly.\n\u003cbr\u003e \n\u003cbr\u003e 231“We would like to. Perhaps Mr. Crambo will put us in the way of doing it.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you hear that, Paul?” she said, laughing.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Crambo scratched his head.\n\u003cbr\u003e \n\u003cbr\u003e “I haven’t made my own yet,” he answered slowly.\n\u003cbr\u003e \n\u003cbr\u003e “If it rained gold pieces, you wouldn’t pick up enough to keep you going for three months. You know you are shiftless, Paul.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, perhaps I am, Martha. I can’t get up and hustle like you.”\n\u003cbr\u003e \n\u003cbr\u003e “No, you’re not one of the hustling kind. Well, gentlemen, if you want to stay with us awhile, and don’t object to seven dollars a week each, we’ll try to accommodate you. When do you want to begin?”\n\u003cbr\u003e \n\u003cbr\u003e “Right off,” answered Tom, upon whose olfactories the savory smell of dinner, cooking in the next room, made an agreeable impression. “The terms are satisfactory.”\n\u003cbr\u003e \n\u003cbr\u003e So it happened that Tom and Grant became inmates of the Crambo household. The first meal satisfied them that their hostess was a 232most accomplished cook, and the supper seemed to them delicious.\n\u003cbr\u003e \n\u003cbr\u003e “Have you had any gold-digging near here?” asked Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Not much. There was an old man who had a claim somewhere near where I met you, but I don’t think he made much. Finally he got discouraged and went away. That’s a good while since.”\n\u003cbr\u003e \n\u003cbr\u003e “Evidently he doesn’t suspect anything,” thought Grant. “All the better. We shan’t have any competitors.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you don’t think he took much gold away with him?” he said aloud.\n\u003cbr\u003e \n\u003cbr\u003e “No. I guess he wasn’t calc’lated for a gold miner.”\n\u003cbr\u003e \n\u003cbr\u003e “He might have taken a lesson of you, Paul,” suggested Mrs. Crambo.\n\u003cbr\u003e \n\u003cbr\u003e “I never had a good claim,” answered the master of the house. “If I had I’d have done as well as the next man.”\n\u003cbr\u003e \n\u003cbr\u003e “It depends on who the next man was,” said his wife.\n\u003cbr\u003e \n\u003cbr\u003e “There aint any more money in mining,” 233said Crambo dogmatically. “All the claims are petering out.”\n\u003cbr\u003e \n\u003cbr\u003e “I guess you are the one that’s petered out.”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps you’d like to go into the business yourself, Mrs. C.”\n\u003cbr\u003e \n\u003cbr\u003e “No, thank you. I’ve all I can do to take care of you and the farm. Help yourself to the doughnuts, Mr. Cooper.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you,” said Tom. “I haven’t eaten a doughnut before, since I left home. Your doughnuts can’t be beat.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Crambo was pleased with this tribute to her cooking, and was very gracious to her new boarders. After supper she showed them to a chamber on the second floor, well and comfortably furnished.\n\u003cbr\u003e \n\u003cbr\u003e “You two gentlemen will have to room together,” she said. “This is the only room I have to spare.”\n\u003cbr\u003e \n\u003cbr\u003e “We shan’t object,” said Tom. “Grant and I are friends and partners, and are not likely to quarrel.”\n\u003cbr\u003e \n\u003cbr\u003e “Crambo and I never quarrel,” she said, with a significant laugh. “He knows better.”\n\u003cbr\u003e \n\u003cbr\u003e 234“Yes my dear,” said Paul meekly.\n\u003cbr\u003e \n\u003cbr\u003e “We’re in luck, Grant,” said Tom. “For the first time in months we shall live like Christians.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope you won’t be offended, Tom, but I like Mrs. Crambo’s cooking better than yours.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s where you show your good taste. I wasn’t intended by nature for a cook, and I can say the same for you.”\n\u003cbr\u003e \n\u003cbr\u003e The next morning the two friends set out after breakfast for the deserted claim. They opened it up, and soon found traces of past workings.\n\u003cbr\u003e \n\u003cbr\u003e They had been there for about a couple of hours when Paul Crambo came along.\n\u003cbr\u003e \n\u003cbr\u003e “What’s up?” he asked, in surprise.\n\u003cbr\u003e \n\u003cbr\u003e “We’ve gone to work,” answered Tom.\n\u003cbr\u003e \n\u003cbr\u003e “That must be the claim the old man used to run.”\n\u003cbr\u003e \n\u003cbr\u003e “Very likely. I thought some one must have been at work here before.”\n\u003cbr\u003e \n\u003cbr\u003e “Likely you’ll get discouraged and go off, as he did.”\n\u003cbr\u003e \n\u003cbr\u003e “We’ll try to make enough to pay our 235board. That’ll keep us here, even if we don’t succeed very well.”\n\u003cbr\u003e \n\u003cbr\u003e “I never like digging for gold,” said Crambo. “It made my back ache.”\n\u003cbr\u003e \n\u003cbr\u003e “Grant and I will try it awhile.”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Crambo looked on awhile and then sauntered away. It made him uncomfortable to see others work hard. He became fatigued himself out of sympathy.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1644/48604.html","bookId":1227,"creation":"Aug 2, 2019 12:53:47 PM","modification":"Aug 2, 2019 12:53:47 PM"}
