{"id":94100,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Do I?” I really was prodding now. “What happened between then and now? How…how on earth did you handle that? How did you survive?”\u003c/p\u003e\n\u003cp\u003e“We all find ways to survive. There were a few moments where I put the pistol to my head and said a prayer. I don’t know why I never pulled the trigger. Perhaps I was too scared. Too cowardly.”\u003c/p\u003e\n\u003cp\u003e“Perhaps you had hope.”\u003c/p\u003e\n\u003cp\u003eHe gave me a sad smile. “Darlin’, if I had hope you can bet your bottom that I wasn’t aware of it. There was no hope. There was nothing but hate. Anger. It consumed me. I wanted to help rid Texas of the Mexicans that took me away and the Injuns that killed my family. That’s all I wanted.”\u003c/p\u003e\n\u003cp\u003e“And you never loved again.”\u003c/p\u003e\n\u003cp\u003eHe grew silent and rotated the spit again. “I wasn’t about to get close to anyone, not in that way.”\u003c/p\u003e\n\u003cp\u003eI wasn’t about to ask about the other way. I didn’t need to know.\u003c/p\u003e\n\u003cp\u003e“What does it feel like?” I asked him. “Being in love?”\u003c/p\u003e\n\u003cp\u003eHis eyes darted over to me. “You don’t know? What about Avery?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “I…I think I was infatuated with Avery. I always had been. He’d been the only person who cared…I thought that’s what love was.” I felt horrible even saying his name but out it came.\u003c/p\u003e\n\u003cp\u003e“I see,” he said, slowly nodding. “Well, I don’t know. I reckon it’s different for everyone. With Marie it hit me hard and fast like a sledgehammer. It didn’t mean it meant any less. I suppose…” He trailed off. “I suppose other times it comes slowly. Gradually. Sneaks up on you.”\u003c/p\u003e\n\u003cp\u003e“Like a wolf.”\u003c/p\u003e\n\u003cp\u003e“Love is a wolf,” he said, the fire dancing in his eyes. “Perhaps that’s why they howl in the dark of night. Love drives them mad like it does to everyone. Fast or slow, whatever way it hits you, love will drive you mad.”\u003c/p\u003e\n\u003cp\u003e“Does it not seem so silly to be talking about such a thing when we’re out here with the wolves and the monsters in the trees?”\u003c/p\u003e\n\u003cp\u003e“No, Eve,” he said. “It’s not silly. We’re still human even in the face of beasts, even with our lives at risk. When you’re close to death, love is sometimes the only thing that makes sense in life.”\u003c/p\u003e\n\u003cp\u003eI was about to tell him that we weren’t close to death when I noticed that beneath his jacket, blood was starting to seep through his shirt.\u003c/p\u003e\n\u003cp\u003e“Shoot,” I swore under my breath.\u003c/p\u003e\n\u003cp\u003eI quickly grabbed my boots and slipped them on while noticing that he had taken them off when he put me to bed. There was something so disarming about the image of caveman Jake McGraw taking the time to undo my boots before tucking me in. It melted away some of the ice that had built up inside me.\u003c/p\u003e\n\u003cp\u003eI made my way over to the packs and brought out what was left of the first aid supplies—gauze, cloth, and tape—and came over to his side.\u003c/p\u003e\n\u003cp\u003eHe looked down at the blood that was seeping through his shirtfront. “I’m fine. Go get some rest.”\u003c/p\u003e\n\u003cp\u003e“Like hell I will,” I said determinedly.\u003c/p\u003e\n\u003cp\u003eHe grinned at me. “I’m liking your language.”\u003c/p\u003e\n\u003cp\u003eI didn’t feel the need to apologize for my cursing. I came behind him as he sat on the log and slowly helped him remove his jacket. “Do you have any moonshine left?”\u003c/p\u003e\n\u003cp\u003e“I reckon there might be some left in the flask.”\u003c/p\u003e\n\u003cp\u003eHe nodded over to the packs and I quickly retrieved it.\u003c/p\u003e\n\u003cp\u003e“You planning on getting me drunk, Pine Nut?”\u003c/p\u003e\n\u003cp\u003e“I’m planning on cleaning your wound, Ranger.”\u003c/p\u003e\n\u003cp\u003e“Ranger? I like that.” He nodded. “I like that a lot.”\u003c/p\u003e\n\u003cp\u003e“Lift up your arms,” I instructed him.\u003c/p\u003e\n\u003cp\u003e“Bossy.” But he did as I asked. I carefully pulled the shirt off of him and he immediately started shivering from the cold air.\u003c/p\u003e\n\u003cp\u003e“I won’t be long,” I said to him, coming around to his side. With his body, such a perfect specimen of a man, I wished it could take all night.\u003c/p\u003e\n\u003cp\u003eI bit down on my tongue to bring me back into the present and poured a little bit of the moonshine on his wound, wiping it around and getting rid of most of the blood.\u003c/p\u003e\n\u003cp\u003e“Easy,” he said with a wince. “You want to give me the rest of it? I feel like I might need some liquid courage tonight.”\u003c/p\u003e\n\u003cp\u003e“Just a moment,” I said. I came closer to him, feeling the heat of his body on one side of me and the fire on the other. I poured a tiny bit more on the wound and dabbed it gently. Jake’s eyes were close to mine, his lips inches away as he watched me working. I couldn’t meet his eyes—I wouldn’t.\u003c/p\u003e\n\u003cp\u003eI spent far too long pressing the cloth into him, to the point where he wasn’t even wincing anymore. Finally he shifted slightly, the sound of the fabric of his pants sliding across the log, and I felt his strong fingers brush against mine, taking the flask out of my hands.\u003c/p\u003e\n\u003cp\u003eI breathed out as he moved his head away from me to swallow down the rest of it. He coughed from the alcohol’s burn and I started layering the gauze. I worked slowly, more for other reasons than because I wanted to be gentle. With him so close to me, his warm skin beneath my fingers so surprisingly smooth, I felt like I couldn’t leave his side. I also felt like I couldn’t get closer. I was stuck in some sort of limbo.\u003c/p\u003e\n\u003cp\u003e“Eve,” he said in a silken voice.\u003c/p\u003e\n\u003cp\u003e“Yes?” I whispered. The world felt like it was changing around me. I noticed I had moved closer to him, somehow, that I had finished bandaging him already and yet my fingers were resting on his chest, pressing into him. The trees and the sky, they had grown blacker than obsidian, and the only thing lit, the only thing visible, was his bare body, glowing gold in the firelight.\u003c/p\u003e\n\u003cp\u003eBeneath my hands, his heart was beating wildly.\u003c/p\u003e\n\u003cp\u003e“Are you scared?” he asked softly. His face had come closer again, his lips near my cheek then near my ear. From the way my skin prickled, the way the hairs on my neck stood up and the shivers that slinked down my spine, I would have to say that yes, I was scared.\u003c/p\u003e\n\u003cp\u003eBut now I didn’t know of what. This fear was new. I was scared of Jake. I was scared of myself.\u003c/p\u003e\n\u003cp\u003eAnd I think I liked it. I liked this kind of fear. It was doing curious things to my insides, putting me through a beautiful sort of pain that was so very foreign to me.\u003c/p\u003e\n\u003cp\u003e“Because,” he said with a gruff voice that warmed my stomach, “the longer you touch me, the more scared I get.”\u003c/p\u003e\n\u003cp\u003eI bit my lip. “What do you think I’m going to do?” I whispered.\u003c/p\u003e\n\u003cp\u003eHe shook his head once. “No. Not you. You’re too innocent. It’s what I’m going to do. What I want to do. What I feel like doing. And Lord knows how very wrong it is to have these thoughts. Especially about you.”\u003c/p\u003e\n\u003cp\u003e“I’m not so innocent,” I managed to say, even though I could barely imagine what his thoughts could be about. He’d already kissed me once before. He couldn’t possibly want what I didn’t dare imagine he wanted. Not with me. Not with the inexperienced, young, half-Indian girl from River Bend.\u003c/p\u003e\n\u003cp\u003eHe leaned in until his lips brushed against my earlobe. “You are innocent, just like your name before she ate the apple, that forbidden fruit. And I love it.”\u003c/p\u003e\n\u003cp\u003eI couldn’t suppress the shiver. I slowly moved my head toward him so that our noses rubbed against each other. One of my hands went for the side of his head, my fingers sinking into his soft hair. I couldn’t control myself, my actions were apart from my brain, and suddenly I understood why he was afraid of what he would do. I should have been afraid of myself, too.\u003c/p\u003e\n\u003cp\u003eInstead, I welcomed it. He could have been the apple that changed Eve’s innocence. He could have been the snake. And I suddenly didn’t care.\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eWe were too close. It was all too much.\u003c/p\u003e\n\u003cp\u003eI shook my head and steadied my breath which was coming out hot and ragged. “My innocence is gone. But whatever I do have left, I want you to have it.”\u003c/p\u003e\n\u003cp\u003e“You’ll always be innocent to me,” he murmured, barely moving his lips, his gaze never leaving mine.\u003c/p\u003e\n\u003cp\u003e“Then…” I said, my heart thudding in my chest as I traced his rough jaw with my fingers, “you’ll have to at least try and take it.”\u003c/p\u003e\n\u003cp\u003e“Oh darlin’,” he said huskily. “You have no idea what you’re asking of me and I might be not be good enough of a man to say no.”\u003c/p\u003e\n\u003cp\u003e“I have some idea,” I whispered, “if you just point the way.”\u003c/p\u003e\n\u003cp\u003eHe broke into a wide grin and let out an amused chuckle that lasted a shining second before he suddenly grabbed my face, his large hands taking up both sides of it, and kissed me.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eAnd still his lips were soft, covering mine, and I felt the hot, wet pressure of his satiny tongue push into my mouth. I welcomed it and moaned once it touched mine. My cheeks flamed with heat, but I couldn’t tell if it was because I was self-conscious or it was the fire that was inside of me, burning up in my chest and belly.\u003c/p\u003e\n\u003cp\u003eI felt my innocence being charred.\u003c/p\u003e\n\u003cp\u003eAnd as he kissed me, I kissed him back. I found myself being dragged into a warm abyss that was just his hands and lips and tongue and us kissing each other like we were afraid to stop, like we’d die if we stopped.\u003c/p\u003e\n\u003cp\u003eThe world outside us stood still and it was just him and I melding together in front of the flames, feeding on each other, because with each kiss it only stoked my hunger, a hunger for him, his body and mind and heart and soul and everything so very brave and strong about him.\u003c/p\u003e\n\u003cp\u003e“Oh, Eve,” he spoke against my lips before he brought his to my neck and started sliding them down to my collar bone. I couldn’t help but moan again, my body overloaded with these feelings and sensations I had never felt before. It was an assault and I was both fighting back with my mouth and surrendering at the same time.\u003c/p\u003e\n\u003cp\u003eHe cupped my chin and pulled back a few inches, his eyes shining and his lids heavy, looking almost sleepy if not for the lust that sparked behind them. “This is why I was afraid,” he whispered intensely. “I was afraid I would do this to you.”\u003c/p\u003e\n\u003cp\u003eI leaned my forehead against his and tried to catch my breath. I squeezed his hair in my hands. “You’re not hurting me,” I said.\u003c/p\u003e\n\u003cp\u003e“But am I hurting me?” he asked. I peered at him. He trailed the soft tip of his nose across the bridge of mine and closed his eyes. “What happens after this? What happens if I lose you?”\u003c/p\u003e\n\u003cp\u003e“You won’t,” I said. “We’ll be home tomorrow and then we’ll go where you said you’re going.”\u003c/p\u003e\n\u003cp\u003e“Where was that?” He kissed the corners of my lips, his beard rough on my face. Something inside me ached with yearning, ached for him to continue.\u003c/p\u003e\n\u003cp\u003e“Wherever your heart desires,” I answered.\u003c/p\u003e\n\u003cp\u003e“And if you’re what my heart desires?”\u003c/p\u003e\n\u003cp\u003eI paused. “Then I’ll be safe with you.”\u003c/p\u003e\n\u003cp\u003e“You’ll be more than safe,” he murmured, and placed his lips back on mine. “I’ll keep you more than safe.”\u003c/p\u003e\n\u003cp\u003eThen he got to his feet and pulled me up with him.\u003c/p\u003e\n\u003cp\u003e“Come,” he said, taking me by the arm and leading me to the cave. “I’m getting cold and there’s a better way to keep warm.”\u003c/p\u003e\n\u003cp\u003eWe both ducked under the lip of the cave and squatted by the animal hides I had been under earlier. He lifted a corner back and gestured for me to get inside.\u003c/p\u003e\n\u003cp\u003eWe couldn’t be going to sleep, I thought, not after all that. Then from the sensual gleam in his eyes, I gathered that we wouldn’t be sleeping at all.\u003c/p\u003e\n\u003cp\u003eI was terrified again. Frozen in place. Torn by the yearning inside and the need to preserve myself. This was all so new to me and so sudden.\u003c/p\u003e\n\u003cp\u003e“Eve,” he whispered, coming over to me. He ran his hands through my hair. “You’re beautiful. So beautiful.”\u003c/p\u003e\n\u003cp\u003e“So are you,” I said back, feeling stupid.\u003c/p\u003e\n\u003cp\u003eHe paid that no attention. He let his hands drift down to my collarbones where he started running his fingers back and forth, so rough on my skin, stroking desire back into me.\u003c/p\u003e\n\u003cp\u003e“When I first saw you,” he said, “I hated you. I hated you, Eve, because I reckoned you were the prettiest damn woman I had ever seen and there was no way you could ever be mine. I was dealt the losing hand before I even rode into your town. You understand why now.”\u003c/p\u003e\n\u003cp\u003e“What changed?” I whispered.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “The cards are the same. My balls are just as big. I suppose I’m only feeling lucky.”\u003c/p\u003e\n\u003cp\u003eI smiled shyly. “I think you might be lucky after all.”\u003c/p\u003e\n\u003cp\u003e“I know I already am. The moment you kissed me back, that was all I needed.”\u003c/p\u003e\n\u003cp\u003e“Are you sure?” I ran my finger over his full lips. “Could I need more and not know about it?”\u003c/p\u003e\n\u003cp\u003eHe smiled and kissed me. “Do you feel this,” he said against my mouth. “Do you feel this kiss deep down inside?” As our tongues and lips danced and tangled, his fingers slowly went down the front of my dress, unbuttoning it.\u003c/p\u003e\n\u003cp\u003eI nodded. I felt like my insides were beyond hot now—I was hot enough to melt gold. I wanted the dress off of me just to get relief.\u003c/p\u003e\n\u003cp\u003eJake wasn’t wasting any time. He worked slowly but steadily until I was bare down the middle. He placed his hands on either side of the dress and pulled it apart, revealing my cotton long stay underneath.\u003c/p\u003e\n\u003cp\u003eI blushed. I was far from naked but no man had seen me this exposed before.\u003c/p\u003e\n\u003cp\u003e“You damn women wear so many layers,” he grumbled good-naturedly while he quickly took off the rest of my dress and pulled the stay and petticoat over my head until I was in just my corset and cotton pants.\u003c/p\u003e\n\u003cp\u003eHe had no patience for the corset. He ripped it down the middle, just ripped it apart with his bare hands until my breasts sprung out of it. I gasped, fully exposed.\u003c/p\u003e\n\u003cp\u003e“I’ll buy you another…” He trailed off and stared with hungry and adoring eyes that fixated on my bare upper body. I immediately went to cover up my chest with my hands but he was fast and gently held my arms down. \u003c/p\u003e","sourceLink":"https://allnovel.net/donners-of-the-dead/page-19.html","bookId":2580,"creation":"Oct 5, 2019 6:06:38 PM","modification":"Oct 5, 2019 6:06:38 PM"}
