{"id":94103,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe handed the rifle back to me then brought out the revolver from his holster, the axe in his other hand. We were a poorly armed ragtag team, but if the rest of the monsters were as decrepit as the last one, if there weren’t that many of them, then maybe we had a chance in hell.\u003c/p\u003e\n\u003cp\u003eI made a move toward the door when Jake stuck his arm out and held me back. He nodded at the fire. “When all else fails, I believe fire will work just as well.”\u003c/p\u003e\n\u003cp\u003e“I can’t exactly hold a torch around all this gunpowder, can I?”\u003c/p\u003e\n\u003cp\u003e“That’s why I said, when all else fails.”\u003c/p\u003e\n\u003cp\u003eI took in a deep breath. If we failed, we failed. There were no other options when you’re dead. Well, unless you wanted to become a monster. I know I certainly didn’t, even if it did mean a way to prolong my life.\u003c/p\u003e\n\u003cp\u003eAll of a sudden the moaning and the scratching stopped. We looked at each other in wonder. I breathed in. The stench was still there, still pungent. There may have been no noise but they were definitely still outside the cabin.\u003c/p\u003e\n\u003cp\u003eWaiting.\u003c/p\u003e\n\u003cp\u003eI took in a deep breath, tightened my grip on the rifle, and walked toward the door. I had to know. I had to get this over with.\u003c/p\u003e\n\u003cp\u003eIn unison, Jake and I stepped together into the doorframe, weapons drawn.\u003c/p\u003e\n\u003cp\u003eThe sight took my breath away and replaced it with pure primal fear.\u003c/p\u003e\n\u003cp\u003eThere were over a dozen monsters standing outside the cabin, staggered about, all of them facing us with expressions of hunger and mindless hate. Some were as close as ten feet away, close enough for me to note the glassiness of their eyes, the way their hair was falling out of their heads, the way their bare, blue cold feet shriveled in the snow. Their mouths were open, drooling, with grey tongues lolling around beside black gums.\u003c/p\u003e\n\u003cp\u003eAll of them wanted to eat us.\u003c/p\u003e\n\u003cp\u003eWe didn’t even get to make the first move.\u003c/p\u003e\n\u003cp\u003eThe closest one lurched forward, long, spindly hands clawing for us beneath a snapping mouth.\u003c/p\u003e\n\u003cp\u003eJake stepped in front and to the side of me, and with a war cry, swung the axe like a bat. It cleanly sliced the monster’s head right off so that it flew backward into the snow.\u003c/p\u003e\n\u003cp\u003eThere wasn’t a moment to appreciate it. Now the monsters were staggering forward toward us, some faster than others, some looking more human. All were terrifying in their depraved addiction.\u003c/p\u003e\n\u003cp\u003eI screamed as one lunged for me and pounced at my feet, grabbing hold of my leg and trying to bite it. It felt too dangerous to shoot him without blasting my own leg off so I kicked him in the head with my other boot until he let go, his fingernails digging so deep into my skin that he ripped away the hem of my dress and the bottom of my pants.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Jake was trying to take on two of them that had leaped for him at the last minute. He lobbed one head off but was tackled to the ground by the other, and in too close to properly swing the axe. I was wondering how risky it was for me to shoot and hope not to hit Jake when he managed to get an arm free and shoved the barrel of the revolver in the monster’s open mouth. He grinned at the beast before he pulled the trigger, and his head exploded in a red rain shower.\u003c/p\u003e\n\u003cp\u003eThe zombie came back for my legs but Jake was able to throw off the decapitated one and get a good swing with the axe, chopping the monster right in half, intestines spilling out like ribbons. Unfortunately, it did nothing to slow the monster down, and it kept on going for my leg with its angry teeth and nails.\u003c/p\u003e\n\u003cp\u003eJake reached down and pulled the monster back by its wiry white hair so its wrinkled grey-white throat was exposed. Before I realized what he was doing, he’d brought out the sharp Bowie knife and started slicing through the neck, spilling crimson rivulets of blood.\u003c/p\u003e\n\u003cp\u003eI looked away from the sight just in time to see another monster coming for us. With shaking hands, I brought the rifle up to my line of sight, but the movement from the monster at my legs was putting me off balance. If I missed, it would take time to reload and we may not even have the chance to.\u003c/p\u003e\n\u003cp\u003eThe monster was right at us, its dead, leering eyes fixated on Jake. Just as it was about to reach him, Jake finished slicing through the other monster’s head. He turned and threw the knife at the attacker, getting him right through the eye where it remained lodged. I was free to move, and it gave Jake enough time to get back and swing the axe. This time the axe went right down the middle, splitting the head and brain into two neat halves.\u003c/p\u003e\n\u003cp\u003eWe watched, our breaths in our throats, before the monster fell to the side, dead.\u003c/p\u003e\n\u003cp\u003eAll victories were short-lived. The monsters kept coming, still about a dozen of them. Jake did what he could with the axe and I tried to save my shot for when it really counted. After he beheaded three more and still more came after us, he threw a crazed look back to the cabin.\u003c/p\u003e\n\u003cp\u003e“I can’t keep this up,” he said breathlessly. “We need to get my revolver reloaded. There are paper cartridges in the pack inside. If we bar the door, perhaps we can buy some more time before we take the rest of them out.”\u003c/p\u003e\n\u003cp\u003eHe didn’t need to tell me twice. We turned back into the cabin and slammed the door behind us. There wasn’t much in the cabin to prop against it, but Jake ripped up a loose wooden plank and stuck it between the handle.\u003c/p\u003e\n\u003cp\u003eAs soon as he did that, the door began to shake and blue fingers appeared under the door, wiggling at us, taunting us. It was only a matter of time before they decided to come through the window.\u003c/p\u003e\n\u003cp\u003eLuckily Jake was fast. He loaded up all the chambers of the revolver and then spun it around. He kissed it quickly and gave me a shy look. “It may not take someone’s head off but it’ll help. The Texas Navy made this gun. They’ll never let you down.”\u003c/p\u003e\n\u003cp\u003e“There’s no time to rhapsodize about your gun!” I admonished.\u003c/p\u003e\n\u003cp\u003e“Even after last night?” Jake asked with a wag of his brows.\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes.\u003c/p\u003e\n\u003cp\u003e“Pine Nut,” he said quickly, “nothing wrong with a little joke before victory.”\u003c/p\u003e\n\u003cp\u003e“You better be certain about that,” I said just as the glass on the window shattered with a monster trying wildly to climb in.\u003c/p\u003e\n\u003cp\u003eJake took aim and shot the monster in the head. The bullet barely did anything but it was enough to get him to pull back. Unfortunately, he was replaced by another monster.\u003c/p\u003e\n\u003cp\u003eAt the same time the boards on the broken window—the one the first monster had crashed through all those nights ago—began to groan and splinter from the deathly hands pulling from the other side.\u003c/p\u003e\n\u003cp\u003eIt was followed by a clunk above us and the frantic sound of the roof being ripped apart. They were mad and through with waiting—they were coming in.\u003c/p\u003e\n\u003cp\u003eIt happened all at once. The door broke down, the windows were busted through, and a jagged hole appeared in the ceiling above us, two blue eyes peering down at us with hunger. We staggered backward toward the far wall and Jake started swinging.\u003c/p\u003e\n\u003cp\u003eI really thought he was going to kill them all. Despite his injury, he swung that axe like a god, his muscles great and straining, his strength seeming to be too large for the cabin to contain. He managed to decapitate nearly all of them, their heads and lifeless corpses scattered about.\u003c/p\u003e\n\u003cp\u003eHe almost made it.\u003c/p\u003e\n\u003cp\u003eBut it just wasn’t enough.\u003c/p\u003e\n\u003cp\u003eThe monster from the ceiling dropped onto his back just as the two others went for his legs. He fell to the floor, collapsed under the weight, the axe under him and immovable.\u003c/p\u003e\n\u003cp\u003e“Eve!” Jake screamed. The terror in his eyes was unmistakable as they clawed their way into him. “Leave! Get out of here! Go!”\u003c/p\u003e\n\u003cp\u003eBut I wouldn’t do that. I aimed the rifle at the monsters, trying to get a good shot, but it was nearly impossible.\u003c/p\u003e\n\u003cp\u003e“Eve, go!” he yelled again, fighting back against them with kicks and punches the best that he could. “Please leave, I can’t keep you safe if you’re here! Go, NOW!”\u003c/p\u003e\n\u003cp\u003eBut I couldn’t.\u003c/p\u003e\n\u003cp\u003e“You promised me!” he bellowed in anguish.\u003c/p\u003e\n\u003cp\u003eI took aim at the one on his back, the strongest one, the one doing the most damage.\u003c/p\u003e\n\u003cp\u003eI pulled the trigger.\u003c/p\u003e\n\u003cp\u003eThe gun blasted with a puff of black smoke.\u003c/p\u003e\n\u003cp\u003eAnd I missed. The bullet went flying into the door instead.\u003c/p\u003e\n\u003cp\u003eI couldn’t believe it.\u003c/p\u003e\n\u003cp\u003eI missed.\u003c/p\u003e\n\u003cp\u003eAnd that was the only shot I had.\u003c/p\u003e\n\u003cp\u003eJake was screaming again. I gave him a sad look.\u003c/p\u003e\n\u003cp\u003e“I am so sorry,” I whispered, unable to process that we were going to lose this battle. I was going to lose him before my very eyes.\u003c/p\u003e\n\u003cp\u003e“I can’t lose you too!” he cried out as he flipped onto his back and punched the monster in the face. “I won’t lose you. Please go!”\u003c/p\u003e\n\u003cp\u003eI found strength somewhere deep inside me, coiling around my heart and guts like a steel cage. I could do this. I could save him.\u003c/p\u003e\n\u003cp\u003eI looked down into the flash pan on the rifle, still full of gunpowder.\u003c/p\u003e\n\u003cp\u003eI ran over to the fire, picking up a lit log.\u003c/p\u003e\n\u003cp\u003e“Jake!” I screamed. “Cover yourself.”\u003c/p\u003e\n\u003cp\u003eJake figured out what I was going to do. He managed to punch the monster in the face enough so that he was able to crawl away a few feet.\u003c/p\u003e\n\u003cp\u003eI threw the rifle at the monsters. It landed at their feet. One even picked it up. I couldn’t have asked for better than that.\u003c/p\u003e\n\u003cp\u003eAs the monster stared down the barrel in demented curiosity, I threw the flaming log over at him.\u003c/p\u003e\n\u003cp\u003eIt collided with the rifle.\u003c/p\u003e\n\u003cp\u003eAnd everything exploded.\u003c/p\u003e\n\u003cp\u003eI went flying backward, landing on the ground in a heap. My head spun, wasting precious seconds while I tried to get my bearings. Once I did, I was up on my feet and making my way over to the wreckage.\u003c/p\u003e\n\u003cp\u003eTwo of the monsters were fully engulfed in flames, writhing on the ground, while the other had exploded into charred crisps.\u003c/p\u003e\n\u003cp\u003eJake was twitching, face down, his arm on fire.\u003c/p\u003e\n\u003cp\u003eI screamed and ran over to him, throwing off my cloak and wrapping it around his arm to put out the flames.\u003c/p\u003e\n\u003cp\u003eHe groaned and I knew he was alive.\u003c/p\u003e\n\u003cp\u003e“I take it all back,” he said, his voice cracking in agony.\u003c/p\u003e\n\u003cp\u003e“Take what back? Jake, Jake are you going to be okay? Oh God.”\u003c/p\u003e\n\u003cp\u003eHe tried to sit up, his eyelids fluttering. “I take it back, that you’re a good shot. You’re lousy. And you’re right stupid. You should have run.”\u003c/p\u003e\n\u003cp\u003e“I’d never leave you,” I told him, trying to get him to his feet.\u003c/p\u003e\n\u003cp\u003e“Don’t let that be your downfall,” he said.\u003c/p\u003e\n\u003cp\u003e“Can you get up?” I asked, still holding the cloak around his arm. The fire was out, but now I was afraid to look at the damage underneath.\u003c/p\u003e\n\u003cp\u003eHe nodded and got up, clearly in pain. “I do think we need to get out of here. There’s no telling if this was all of them.”\u003c/p\u003e\n\u003cp\u003e“I sure hope it was.”\u003c/p\u003e\n\u003cp\u003e“I never saw Hank,” he remarked grimly.\u003c/p\u003e\n\u003cp\u003eI swallowed hard. “Neither did I.”\u003c/p\u003e\n\u003cp\u003eWe exchanged a heavy look. It wasn’t over yet. We had no choice but to keep running.\u003c/p\u003e\n\u003cp\u003eI grabbed the pack and the weapons, and we left the bloody, smoldering massacre behind.\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eWe ran for a long time, through the black night, through the rain that picked up again, until there stopped being snow beneath our feet. It didn’t relieve me—nothing would. I kept grabbing onto Jake every few minutes, knowing he was in pain from his burn but so grateful that he was alive. It was as if I had to keep making sure that he was safe and with me and that we had survived.\u003c/p\u003e\n\u003cp\u003eBut I felt like our survival so far meant nothing until we got off the mountain. Yes, the monsters were all dead, but how did we know that was all of them? We had never seen Hank. Was it possible that he was still behind us, scavenging on his brethren? Was it possible that he was trailing us in the shadows?\u003c/p\u003e\n\u003cp\u003eWe walked until we found the shelters that we had built our first night out. One was destroyed, the makeshift roof caved in, perhaps by the snow that had fallen, but the other one, the one I had slept in with Donna, was still standing. It pained me to think about Donna, and of course Avery, how long ago it felt in some ways, yet in others it felt like just this morning. Donna’s kind words, Avery’s comfortable presence.\u003c/p\u003e\n\u003cp\u003eNow Jake and I were hunkering down, wrapped in animal skins. He promised me he would keep watch, and as much as I wanted to help him, to tend to his wounds the best I could and make him better, I couldn’t. He didn’t have any alcohol for the pain and my body pulled me into sleep. Even fear couldn’t keep my eyes open. Not this time.\u003c/p\u003e\n\u003cp\u003eI woke up at the crack of dawn, my head nestled against Jake’s shoulder. He was awake but barely. He looked so terrible that I felt like crying. His skin was greenish white and clammy, his forehead feverish to the back of my hand.\u003c/p\u003e\n\u003cp\u003e“Jake,” I whispered, trying to get him to look at me. I brought his chin toward mine with my fingers.\u003c/p\u003e\n\u003cp\u003eHe tried to smile but failed. His eyes were drooping shut and unfocused. I looked down at his arm and nearly dry-heaved. His jacket and shirt sleeve underneath had completely burned away, leaving his skin raw and exposed. It was a black and pink mess of burned and blistering flesh.\u003c/p\u003e\n\u003cp\u003eI put my hand to my mouth. “Jake. No. We have to fix you, now.”\u003c/p\u003e\n\u003cp\u003eI went for the pack but remembered I had used the last of the first-aid supplies on his shoulder, another thing we probably had to worry about.\u003c/p\u003e\n\u003cp\u003eHe shrugged out of my grasp. “No, Eve, no. We have to go.”\u003c/p\u003e\n\u003cp\u003eHe tried to get up but swayed unsteadily.\u003c/p\u003e\n\u003cp\u003e“But the burn,” I said. “It’ll probably lead to an infection.”\u003c/p\u003e\n\u003cp\u003eHe gave me a lazy but pained glance. “Darlin’, you saved my life back there. It won’t be for nothing. I promise you that. We’ll get ourselves to River Bend. It’s not far now. And we’ll get ourselves both fixed up.”\u003c/p\u003e\n\u003cp\u003eAs much as I wanted to argue with him, I knew that I couldn’t. He was right. Unless I found a natural healing agent such as wild honey, which was impossible at this point, we couldn’t do a thing. It tore me up inside—yes I did save his life, but it was my fault for missing in the first place. If I had just shot properly, the monster would have died and Jake would have survived unscathed. \u003c/p\u003e","sourceLink":"https://allnovel.net/donners-of-the-dead/page-22.html","bookId":2580,"creation":"Oct 5, 2019 6:06:38 PM","modification":"Oct 5, 2019 6:06:38 PM"}
