{"id":94089,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMervin Meeks was missing his pinky finger.\u003c/p\u003e\n\u003cp\u003eChapter Five\u003c/p\u003e\n\u003cp\u003eThe silence stretched out until it was shattered by Meeks’ scream. Avery and Jake jumped to attention, rushing over to him, trying to calm him as he launched into hysterics. I couldn’t move, couldn’t take my eyes off of him. My brain filtered through the last five minutes and brought up the image of a bloody mouth inches from mine.\u003c/p\u003e\n\u003cp\u003eMy Lord. That person, that pale thing, had bitten off Meeks’ finger. He must have been in shock when it happened. How on earth could something like that even happen in the first place? It was unheard of.\u003c/p\u003e\n\u003cp\u003e“Savages,” Jake snarled, holding up the hand and inspecting it while Avery and Tim were now trying to hold him down. He eyed me with hate. “Your kind of savages.”\u003c/p\u003e\n\u003cp\u003eI was too dumbstruck to care what he said about me or my kind. As savage as some Indians could be—believe me, I’d been exposed to all the stories—I also knew that none of them would do such a horrible, inhuman thing. Indians would never consume part of another human being. I couldn’t imagine anyone doing so, no matter what color they were or what they believed. They were people, not animals.\u003c/p\u003e\n\u003cp\u003eDonna finally snapped out of her religious daze and started helping them tend to Meeks’ hand. Tim had poured a lot of moonshine down his throat, so the thrashing calmed, and soon he was passed out. I sat on my bed with my knees drawn to my chest and watched until I noticed Isaac and Hank get up and head outside, blankets wrapped around their shoulders, rifles in tow.\u003c/p\u003e\n\u003cp\u003eCuriously I got up, slipped on my boots, and followed them out the door. Everyone else was so preoccupied with the disfigured Meeks that they didn’t even notice.\u003c/p\u003e\n\u003cp\u003eOutside it was crisp and cold, and I wasn’t surprised to see a few flakes of snow starting to fall from the sky. It wasn’t very heavy—just sprinkles—but I knew come morning there would at least be an inch or two on the ground. I was grateful for the ramshackle lean-to on the other side of the cabin where the horses were being kept, sheltered from the elements. I should have gone over and checked on them, but on this moonless night, I stayed by the dim glow of the cabin.\u003c/p\u003e\n\u003cp\u003eIsaac and Hank were nowhere in sight, but I had a feeling they were trying to track the way the person went. I could smell the person’s boots rising up from the scuffled footprints on the ground along with the scent of Meeks’ attacker, a mixture of blood and rot.\u003c/p\u003e\n\u003cp\u003eI went as far as I could into the forest without losing sight of the cabin and then stopped. I was better off with the horses than with Isaac and Hank in these dark, unending trees. As much as I wanted to find out what happened, why the pale man had attacked Meeks (and why he hadn’t done the same thing to me), my curiosity needed to be reined in before I did something idiotic.\u003c/p\u003e\n\u003cp\u003e“You shouldn’t be out here alone,” Jake said from behind me, his feet crunching on the fallen twigs, the air around me becoming more earthy and pleasant as he came closer. “It’s dangerous.”\u003c/p\u003e\n\u003cp\u003eI turned around to see him a few paces back, still in his long johns, and with a cigar in his hand. I quickly turned my head away—he was not leaving anything to the imagination. His body was massive, broad lines and hard muscle that seemed like it was going to burst out of the red wool.\u003c/p\u003e\n\u003cp\u003e“Aren’t you cold?” I asked, wishing I felt less embarrassed.\u003c/p\u003e\n\u003cp\u003e“Naw. You ain’t ever seen a man in his drawers, have ya?”\u003c/p\u003e\n\u003cp\u003e“A proper lady shouldn’t see that until she’s good and married,” I replied, wondering what wanton, caveman town he was from where folks were seeing each other in their undergarments. Texans were something else.\u003c/p\u003e\n\u003cp\u003e“You’ve said many times you aren’t a lady.”\u003c/p\u003e\n\u003cp\u003eHe started walking toward me until I shot him a warning look to stay right where he was.\u003c/p\u003e\n\u003cp\u003e“I only said that once,” I retorted indignantly.\u003c/p\u003e\n\u003cp\u003eHe puffed on his cigar, a few sprinkles of snow coming through the boughs of the trees and settling in his dark, lush hair. “True, but you’ve demonstrated your word many times before. No proper lady comes running out into the forest after she’s been nearly attacked by a savage.”\u003c/p\u003e\n\u003cp\u003eI glared at him, keeping my focus on his craggy face that looked strangely handsome in the burning glow of his cigar. “The man wasn’t a savage.”\u003c/p\u003e\n\u003cp\u003e“If that’s the case, then who was he?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I admitted stupidly. “I only saw him for a second and there was barely any light. He was pale though, white as a sheet, with eyes bluer than a robin’s egg. But the same smell that I’ve been picking up the last few days,” I gestured ahead into the forest, “it’s coming from him.”\u003c/p\u003e\n\u003cp\u003eHe frowned, eyes glittering with thought. “Interesting.”\u003c/p\u003e\n\u003cp\u003e“I thought so.”\u003c/p\u003e\n\u003cp\u003e“You know what the smell is?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Something rotten. But familiar.” I don’t know why I kept on talking, divulging information to him. “The other day, I smelled it on our neighbor’s horse that went rabid and tried to kill us.”\u003c/p\u003e\n\u003cp\u003eHe coughed, his eyes bugging out. “I beg your pardon, Pine Nut?”\u003c/p\u003e\n\u003cp\u003eI sighed and quickly told him what happened with Nero, knowing it would be met with disbelief.\u003c/p\u003e\n\u003cp\u003eI turned to face him and was surprised by his silence. In fact, his mouth was set in a rather grim line. “Rabies is Latin for madness.”\u003c/p\u003e\n\u003cp\u003eI raised my brow. “I didn’t know that. Is it possible that whatever infected the horse had infected this man? He did look rather mad.”\u003c/p\u003e\n\u003cp\u003eHe snorted. “You have to be more than ‘rather mad’ to bite someone’s finger clean off.”\u003c/p\u003e\n\u003cp\u003eI cringed and looked back at the cabins. “How is Meeks?”\u003c/p\u003e\n\u003cp\u003eHe took in a large drag of his cigar and let the smoke slowly trail out from his full lips. “He’s alive. Unconscious. I don’t know what else we can do for him.”\u003c/p\u003e\n\u003cp\u003e“Surely one of us will be going back to River Bend tomorrow with him.”\u003c/p\u003e\n\u003cp\u003e“Won’t be you. Won’t be me.” A smirk tugged at his lips. “Mayhaps it’ll be Avery. I’d hate to see you cry though.”\u003c/p\u003e\n\u003cp\u003e“Oh, you’d love to see me cry,” I countered. “And I wouldn’t cry over Avery.”\u003c/p\u003e\n\u003cp\u003e“You two seem awful close for being just a couple of pals.”\u003c/p\u003e\n\u003cp\u003e“I don’t see how this is any of your business, nor how it could possibly interest you,” I told him. I lowered my voice. “Besides, he is my only friend in this world.”\u003c/p\u003e\n\u003cp\u003e“I see. That explains it then,” he said, another puff of smoke rising up to the trees.\u003c/p\u003e\n\u003cp\u003e“Explains what?” I asked defensively. “And why are we always out here sparring in the middle of the night?”\u003c/p\u003e\n\u003cp\u003eHe shrugged casually. “Last night you came out to spar with me, Pine Nut.”\u003c/p\u003e\n\u003cp\u003eBefore I could say anything to that, the faint crackle of crushed ground came from the woods. Isaac and Hank appeared first as shadowy dark forms before I could see them clearly.\u003c/p\u003e\n\u003cp\u003e“Find anything?” Jake asked them.\u003c/p\u003e\n\u003cp\u003eIsaac shook his head while Hank’s cold eyes fixed on me.\u003c/p\u003e\n\u003cp\u003e“Perhaps we need to take the tracker with us,” Hank said, reaching for my arm. I took a step back into a tree, trying to escape his grasp.\u003c/p\u003e\n\u003cp\u003e“Think it’s a bit late for that,” Jake said to him, his voice taking on an edge. “We’ll have a look around in the morning.”\u003c/p\u003e\n\u003cp\u003eHank scowled at him but dropped his hand. “You really think you’re in charge of this, don’t you?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I don’t, but I do know better than you. Technically Merv’s in charge cuz Merv has the money.”\u003c/p\u003e\n\u003cp\u003e“Too bad Merv is in there dying,” Hank said without a hint of remorse.\u003c/p\u003e\n\u003cp\u003eJake took in one last puff before he flicked the cigar at the ground between Hank and I. “Tomorrow will figure itself out. Merv may have lost his finger but he hasn’t lost his life. If he seems worse by morning, we’ll get someone to take him down to River Bend.”\u003c/p\u003e\n\u003cp\u003e“Well it ain’t going to be me,” Isaac snapped at him. “This is my uncle out there.”\u003c/p\u003e\n\u003cp\u003e“So you keep saying,” Jake said, stroking at his rough beard. “I reckon you must be the most loyal nephew on earth to keep going after him so…passionately.”\u003c/p\u003e\n\u003cp\u003eThe two of them stared at each other in a silent showdown, Jake not breaking his gaze for a second. Finally Isaac muttered, “Get out of my way,” and tried to push past Jake before he realized that Jake was solid and immovable as a tree. He ended up going around him.\u003c/p\u003e\n\u003cp\u003eHank stared at me with his leering eyes and licked his cracked lips before he followed after him. I shivered with revulsion.\u003c/p\u003e\n\u003cp\u003e“Best get you inside too,” Jake said as he eyed me. Little did he know I wasn’t shivering because I was cold.\u003c/p\u003e\n\u003cp\u003eOnce we were back inside the cabin, I saw that Merv was propped up in his bed and still unconscious. His hand was fully-wrapped in muslin with only a small amount of blood soaking through, and his body was piled high with blankets.\u003c/p\u003e\n\u003cp\u003eDonna was washing her hands in a bowl of hot water beside Avery who smiled at me with relief.\u003c/p\u003e\n\u003cp\u003e“How is he?” I asked.\u003c/p\u003e\n\u003cp\u003e“I managed to stop most of the bleeding,” she said, her voice shaking. She pushed her blonde curls out of her eyes with her forearm, her hands still soapy. “The challenge is keeping the wound clean. We’ll need to keep changing the bandages.”\u003c/p\u003e\n\u003cp\u003e“Will we have to take him back to River Bend?” Jake asked, appearing beside me, still in those long johns.\u003c/p\u003e\n\u003cp\u003eShe kept her God-fearing eyes averted and looked down at Meeks’ body instead. “Not if we keep him here for the next day or two. He shouldn’t be on the move, either back to River Bend or continuing north.”\u003c/p\u003e\n\u003cp\u003e“Ah, what the hell does she know?” Hank’s voice came from the other side of the cabin.\u003c/p\u003e\n\u003cp\u003eDonna’s cheeks burned with anger. “I know enough,” she said, lowering her voice. She looked at Jake, keeping her eyes above his neck. “He’ll be too weak to ride. For goodness sake, I feel too weak to ride. That was a horrible thing that just happened. Wicked and evil, like Satan crawled right here in this cabin with us.”\u003c/p\u003e\n\u003cp\u003eJake exhaled loudly. “Don’t you think it makes sense then that we move on?”\u003c/p\u003e\n\u003cp\u003e“We could split up,” Tim mused from the corner of the cabin where he was sitting on a stool, appearing deep in thought. “Some of us can stay here, some of us can keep going.”\u003c/p\u003e\n\u003cp\u003e“Splitting up didn’t exactly worked for the Donner party, did it?” Jake pointed out.\u003c/p\u003e\n\u003cp\u003eI looked at Avery in fear, not wanting us to separate. He came over to me and put his hand on my shoulder, his head lowered toward mine. “Don’t worry, Eve, whatever we end up doing, I’m not leaving you. Not until I teach you how to fire a gun, anyway.”\u003c/p\u003e\n\u003cp\u003eJake snorted loudly.\u003c/p\u003e\n\u003cp\u003eAvery lifted his head and gave him a dirty look. “Do you think that’s funny? Eve needs to know how to protect herself.”\u003c/p\u003e\n\u003cp\u003eHis smile twisted. “A woman with a gun is a bad idea, boy. You’d be putting all our lives at risk.”\u003c/p\u003e\n\u003cp\u003e“Only your life,” I muttered under my breath. From the way his lips twitched further, I knew he had heard me.\u003c/p\u003e\n\u003cp\u003eHe walked over into the center of the room by the roaring fire and addressed everyone. “I know we’re all worried about old Merv here pulling through. I know we’re all worried about finding what we’ve come out here to find. And I know we’re all worried that something or someone has already found us. But there just ain’t no use in worrying tonight. I’ll keep watch until sunup in case the finger-biting bastard comes back. Then we’ll start figuring out what to do.”\u003c/p\u003e\n\u003cp\u003eWith the phrase “finger-biting bastard” rolling around in my head, it was a wonder I got any sleep at all.\u003c/p\u003e\n\u003cp\u003eOvernight, five inches of snow had fallen and more kept coming by morning, prompting Jake to nail boards to the broken window. Meeks was in a delirious state, more so than I would have thought. In the end, it was only his pinky finger that was missing, not a leg or anything so crucial as that, and yet he kept moaning about being ruined for the rest of his life. After everything, I would have thought he’d be more concerned with how his finger was taken but he wasn’t.\u003c/p\u003e\n\u003cp\u003eHowever, he was the only one who seemed unconcerned about that. As much as Isaac had been chomping at the bit to go forth to the next site, this morning he was hell-bent on finding the culprit. By now, theories about what it was were rampant, especially after they heard my testimony of what I saw. For whatever reason, Isaac and Hank seemed to want to track down this monster, even though the two of them seemed to have little regard for how Meeks was doing.\u003c/p\u003e\n\u003cp\u003eNaturally, I had to come along. I didn’t mind, especially when Tim said he’d stay behind to watch over Donna and Meeks. The rest of us set out on a long expedition, everyone relying on me to lead the way. The smell of rotting meat only got me so far though. Whatever or whoever that was, they were long gone.\u003c/p\u003e\n\u003cp\u003eWhen we paused for food—some leftover stew—Avery took the time to try and teach me how to load and shoot a rifle. I couldn’t say it was a success. Loading the gun itself was a long and complicated process, with having to put the right amount of gunpowder down the muzzle, then placing the ball in there and shoving it down as far as it could go, then adding cloth to the end, plus checking something called the firing cap. It was all way over my head, and even though we were doing this far away from the party, Jake would occasionally watch us and yell at Avery that he should be using a flintlock rifle, that his wasn’t a real man’s gun, that he was teaching me all wrong.\u003c/p\u003e\n\u003cp\u003eThe curious thing for me was that Avery was in very close contact with me the whole time, closer than he’d ever been, and extremely attentive. When he first showed me how to hold the rifle, he put his arms around me, embracing my back. He smelled so good, clean and familiar, despite the fact we were camping and surrounded by light snow. And yet…I felt nothing. I’d always imagined Avery and I getting closer in this sort of way, of course on the more romantic side of things, but my heart never skipped a beat; I never felt all shivery and new. I just felt like he was my good friend Avery teaching me how to shoot a gun. It was comfortable. Nothing more and nothing less. \u003c/p\u003e","sourceLink":"https://allnovel.net/donners-of-the-dead/page-8.html","bookId":2580,"creation":"Oct 5, 2019 6:06:38 PM","modification":"Oct 5, 2019 6:06:38 PM"}
