{"id":110381,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJane shrugged and flipped a light switch, and Bryn winced. The damage from the tear gas had healed, but she still felt unusually sensitive to the brightness…but then, the nanites were overworked now, struggling to keep pace with both the body’s natural self-destruction and that imposed on it from the outside. She could expect to be hurting soon…and for any further damage to be slow to heal.\u003c/p\u003e\n\u003cp\u003e“I’m useful,” Jane said. “To the right people. Cheer up, Bryn. You can be useful, too, if you work hard, study, eat your vegetables, and, above all, stop fucking around with me.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Bryn said. “That’s just never going to happen. Maybe you’d better get your badass little spoon again. Or raise your game to a full-on spork.”\u003c/p\u003e\n\u003cp\u003eJane leaned over her, and what was in her eyes was like looking through a peephole into the darkest, emptiest hell Bryn could ever imagine. “You,” Jane said, “are going to tell me anything and everything. You’re going to beg me to ask you a question. You’re going to want to tell me so bad you’d crawl over hot coals to lick my ass. Understand me, sweetie?” Her tone continued to be warm, sweet, bizarrely likable. “You are mine for as long as I want to play with you. Nobody’s coming to get you. Nobody’s taking you away. There’s no hiding.”\u003c/p\u003e\n\u003cp\u003e“Prove it,” Bryn said. She didn’t blink. She’d let go of all that fear, all that pain, all that anguish that had been haunting her since she’d woken up screaming for the first time with the taste of that plastic bag on her tongue. She had life, unlimited life, for as long as those nanites could scurry their little mechanical asses through her tissues and give it to her.\u003c/p\u003e\n\u003cp\u003eAnd she was going to use it to spit in Jane’s face for as long as possible. If it was insanity, it tasted sweetly metallic, as if she were chewing tinfoil. She didn’t care anymore. Couldn’t care anymore.\u003c/p\u003e\n\u003cp\u003eI think I broke myself, she thought, and almost laughed.\u003c/p\u003e\n\u003cp\u003eJane blinked first. Then she took a step back, cocked her head, and frowned, just a little. “You’re a weird little thing,” she said. “I mean that completely as a compliment. But—Oh, damn it! Does this happen to you? You’re getting really focused and there goes the cell—” Jane’s phone, Bryn realized, was ringing. The ringtone was Britney Spears’s “Toxic.” If that wasn’t appropriate…\u003c/p\u003e\n\u003cp\u003e“Yes?” Jane asked, and put the phone to her ear as she turned away. She strolled toward the door. Bryn focused up on the spiderweb, on the spider, on the cocooned future lunch. Maybe she wasn’t the spider or the fly. Maybe she was the web. Sticky and impossible to tear apart, no matter how hard the struggle.\u003c/p\u003e\n\u003cp\u003e“Are you kidding me?” Jane said, lowering her voice to a hard whisper. “No! No, I’m telling you, this is the one. You do not want to waste this opportunity—trust me. We need—” She stopped talking and stood very still. “All right. You’re the boss.”\u003c/p\u003e\n\u003cp\u003eThose last words didn’t sound like her at all. None of the cheer. None of the macabre joy. Just flat syllables. Jane hung up and dropped her phone back into her pocket, put her hands behind her back, and spun around to face Bryn with her face pulled into an utterly false smile.\u003c/p\u003e\n\u003cp\u003e“Aren’t you just the luckiest damn girl in the world?” Jane asked. She was smiling with teeth, and it looked as if she wanted to bite chunks out of something. Maybe Bryn. “I think maybe you are. Sweetie. Well, I have my orders. Let’s get this fucking show on the fucking road.”\u003c/p\u003e\n\u003cp\u003eShe lunged for the bed, and Bryn tensed all over to get ready for the pain. It didn’t come. Jane stomped on something on the bottom of the gurney’s rails, and Bryn felt the bed lurch as the brakes released.\u003c/p\u003e\n\u003cp\u003eThen Jane shoved the gurney out from the wall and steered it toward the door.\u003c/p\u003e\n\u003cp\u003eBryn’s breath rushed out, and she felt every muscle in her body tighten. No, no, don’t take me to the incinerator.…She knew what was coming; she’d seen it. But she wouldn’t beg, not Jane. Never.\u003c/p\u003e\n\u003cp\u003e“Relax,” Jane said, and gave her a bright, delighted, upside-down smile. “You look so tense, baby. We’re just going for a little fresh air.” She opened the door and pushed Bryn’s bed out into the hall, which still smelled of gun smoke and spilled blood. They’d be a while cleaning up the considerable property damage, which gave Bryn a bizarre sense of satisfaction. She’d hurt them. Not as much as they’d hurt her, but still. She hated to go down without a fight.\u003c/p\u003e\n\u003cp\u003e“Why are you doing this?” she asked breathlessly. “What the hell broke you this bad?”\u003c/p\u003e\n\u003cp\u003eShe surprised Jane, for once; the woman glanced down at her, and there was a momentary gleam in her eyes that wasn’t driven by madness, chaos, or bloodlust. It almost looked…human. “It’s never just one thing,” Jane said. “It’s like falling out of love. You look back and suddenly you don’t know who that person was that fell in love with him, because it isn’t you. You know what I’m talking about, Bryn. A year ago, who were you? Not who you are right now. And you’ll keep changing, because out here on the fringes, there’s no gravity left to hold you down.”\u003c/p\u003e\n\u003cp\u003eOne of the nurses was dead, and two were wounded; she saw the sheeted body, and one on a gurney while the other was being bandaged. The survivors glared. Not in the Revival club, Bryn thought. Not important enough to whatever this bizarre cause might be.\u003c/p\u003e\n\u003cp\u003eJane kept pushing her right through the door at the end of the hallway, out into the night air. There was a thin, tentative blush of dawn on the horizon. “I found the old man’s cell phone, by the way,” Jane said. “In the drawer. Still on.”\u003c/p\u003e\n\u003cp\u003e“Good for you.”\u003c/p\u003e\n\u003cp\u003e“If you think they’re going to come running to find you, they won’t,” she said. “I had a guy drive it south of the border. Ought to be deep in Cartel Land by now. With any luck, your white knights will go riding into a bunch of machetes and get mailed back in wet little pieces.”\u003c/p\u003e\n\u003cp\u003e“Don’t pretend like you’re not fucked,” Bryn said, very pleasantly. “The signal got out, and they will have traced it, because those phones like that? The ones for old people? They make them very easy to locate. In case someone falls and can’t get up.”\u003c/p\u003e\n\u003cp\u003eJane looked pinched around the mouth this time, and pushed the bed faster. “You think they’ll come rushing into some old folks’ home, guns blazing? Don’t be stupid. By this time, there’s no trace of you in the main building to find. They’ll think it was a decoy.”\u003c/p\u003e\n\u003cp\u003e“It’s hard to cover up the damage back there. All those bullet holes. All that blood.”\u003c/p\u003e\n\u003cp\u003e“That’s why, in fifteen minutes, a fire is going to gut the inside,” Jane said. “Terrible tragedy, all those innocent people caught like that. Three of our staff are going to die trying to save them.”\u003c/p\u003e\n\u003cp\u003e“Three? I only killed one.”\u003c/p\u003e\n\u003cp\u003e“Well, you wounded two, and I don’t want to explain it to the cops. Much easier if they die selfless heroes. Do you know what the word verisimilitude means?”\u003c/p\u003e\n\u003cp\u003e“You’re hard on your minions.”\u003c/p\u003e\n\u003cp\u003e“Oh, baby, you watch too many bad movies, and I don’t have minions. I have coworkers. Being paid by the same company doesn’t make us family, and they’d shiv me in the back for an extra dollar an hour. Just like in any other business.”\u003c/p\u003e\n\u003cp\u003eBryn realized they weren’t heading for the main building—or for any building, come to that. They were heading for the square, blocky shape of an ambulance that sat flashing its lights in the parking lot—probably a very common sight here. No one would remark on it at all, even if anyone noticed. A uniformed paramedic in a ball cap was standing at the rear of the vehicle, and as Jane wheeled her gurney up, he nodded and took control to load Bryn inside. He locked her wheels down into braces on the floor, then jumped down to talk with Jane in a low voice.\u003c/p\u003e\n\u003cp\u003eJane climbed inside and leaned over to look into Bryn’s face. “This is where we say our sad little good-bye. It’s been fun, Bryn. Don’t blame yourself for how this turned out; sometimes you’re the windshield, and sometimes, you’re the bug.” She squeezed Bryn’s shoulder and winked. “I just got my new assignment. I’ll be paying a visit to the Fideli family. Just in case little Jeffy remembers something he shouldn’t.”\u003c/p\u003e\n\u003cp\u003eBryn lunged against her straps. “You fucking bitch!”\u003c/p\u003e\n\u003cp\u003e“Oh, sure, look who’s talking. If you ask me nicely, I’ll go easy with the kids. They won’t feel a thing. Can’t promise the same thing for the parents, though, since I owe you one. Here’s something on account.”\u003c/p\u003e\n\u003cp\u003eShe tapped Bryn on the forehead, hard, and gave her that eerily warm smile again, then reached over to a gurney lying across from Bryn’s and tugged the sheet loose as she climbed out of the ambulance.\u003c/p\u003e\n\u003cp\u003eBryn hadn’t really registered the fact that there was someone lying across from her until that moment when the sheet pulled off the body.\u003c/p\u003e\n\u003cp\u003eIt was Carl. And Carl was really, sincerely dead. His head had been severed, not very neatly, and the gurney was soaked in fresh red blood. The ambulance reeked with it, Bryn realized. The loose head had been tucked beneath his left arm to keep it from rolling free, and Jane had positioned it for maximum effect, facing directly toward Bryn. Gravity had opened his mouth and made it seem as if he’d never stopped screaming.\u003c/p\u003e\n\u003cp\u003eMy fault, she thought. She’d thought it unlikely she could feel shock again, but it swept over her in a cold, numbing wave. This one’s my fault. She’d left Jane out there alive and free to go after innocents. Carl had died horribly. A whole hallway full of confused old people would burn to cover up her disappearance.\u003c/p\u003e\n\u003cp\u003eNow maybe the whole Fideli family was going to pay for her mistake, too.\u003c/p\u003e\n\u003cp\u003eGod, she had to kill that bitch forever.\u003c/p\u003e\n\u003cp\u003eBut she couldn’t get out of the goddamn restraints.\u003c/p\u003e\n\u003cp\u003eThe ambulance took off and drove for about five minutes before slowing down, and Bryn thought, They’re not bothering to dismember us very far from the crime scene; it showed a kind of stunning, unsettling arrogance that made her worry that Jane not only could keep her promises but might outdo them. Carl had gone down screaming, but Bryn decided she wouldn’t; if anything, when her head came off, she’d go down biting. Maybe she could take a piece off her killer, at least. \u003c/p\u003e","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-40.html","bookId":2539,"creation":"Oct 5, 2019 11:58:16 PM","modification":"Oct 5, 2019 11:58:16 PM"}
