{"id":110350,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI wish…\u003c/p\u003e\n\u003cp\u003eBryn stopped the thought, held the watch in her hand for a moment, and then put it on with sure, quick snaps of her fingers.\u003c/p\u003e\n\u003cp\u003eI’ll find you, she promised the absent ghost of her sister. I will. I swear.\u003c/p\u003e\n\u003cp\u003eBut she had nowhere to look, and nothing to go on. If her sister was still out there, still alive, still waiting, Bryn was letting her down with every moment she didn’t find her. Worse, she was letting down her whole family, who didn’t even know Annie was in trouble.\u003c/p\u003e\n\u003cp\u003eAfter a deep breath, Bryn went downstairs for a dinner for which she had, suddenly, very little appetite.\u003c/p\u003e\n\u003cp\u003eChapter 3\u003c/p\u003e\n\u003cp\u003eBryn had never liked mornings, but she’d usually been an early riser anyway—life in the army did that to you, accustomed you to being out of bed before dawn whether you wanted to be or not. She woke in the predawn light, comfortable and warm, with Mr. French snuggled against her legs on top of the covers. His chin was on her hip, and he was snoring like a little old man and twitching as he dreamed. The room was cool, dim, and soothing, but for a moment it felt…wrong. Early mornings sometimes brought her doubts out of the depths and up to breach the surface. What am I doing here? I don’t belong here, in this house.\u003c/p\u003e\n\u003cp\u003eHer apartment—cheap and crappy as it had been—had been her own space, but she’d started worrying about not her own safety there, but that of her neighbors. Innocent people, families, who had no knowledge of the kind of knife’s edge on which she lived. She’d woken up with every noise, every car engine, wondering if the government was coming to make her disappear, or worse, if someone else had decided to grab her, experiment on her.…The paranoia (justified or not) had driven her half nuts.\u003c/p\u003e\n\u003cp\u003ePatrick McCallister had made the offer to give her a room at his mansion—a protected space, safe, controlled, where she endangered no one who didn’t know the score. She hadn’t been able to bring herself to take that last step with him yet, and they weren’t lovers, but she knew she could trust him. And she knew that she wanted to be with him.\u003c/p\u003e\n\u003cp\u003eBut in the mornings, she still wondered whether she’d sacrificed her independence for security.\u003c/p\u003e\n\u003cp\u003eThen again, she thought, and yawned, the apartment complex didn’t set out a full breakfast, and have coffee going by the time I got up. Which Liam did, every morning. He was an even earlier riser than she was, and he seemed to feel that it was his sacred duty to be sure she had fuel before starting her day. Screw independence. Who doesn’t get used to that?\u003c/p\u003e\n\u003cp\u003eShe didn’t, apparently. She still felt like a guest here; regardless of what Patrick did, or what Liam would excuse, she didn’t feel that she could roll out of bed in her bathrobe and shuffle down to breakfast. No, she had to get up, shower, fix her hair, do her makeup, dress, and then go down. And she was self-conscious about it. Every day, she had the argument with herself about moving out, finding her own space, but every day, the larger part of her wanted to stay.\u003c/p\u003e\n\u003cp\u003eAnd truthfully, it was because of Patrick. They hadn’t slept together, but they’d had some fantastic everything-but-skin sessions; she didn’t feel like either of them was reluctant to take the next step, but she did feel that they were both…cautious. And careful not to push. He was waiting on her, and she was waiting on him, and that made for an interestingly frustrating relationship, because fairly soon, one of them was just going to seize the moment.\u003c/p\u003e\n\u003cp\u003eShe couldn’t help but think about that. A lot. And she imagined that he did, too.\u003c/p\u003e\n\u003cp\u003eDown, girl. Time to get up and focus. She had a meeting at Pharmadene today, which she dreaded. And she had to meet with Carl, the Returné-addicted Pharmadene employee, and try to give him a little help and perspective. If she liked his vibe, she’d invite him to the evening group meetings they had once a week…a support group, but even though they jokingly called it Dead Persons Anonymous, it was more about reaffirming their humanity than talking about the inevitable. If he was ready for it, it might be a place for him to turn to release that inner stress and panic that had been building up. The others claimed it helped.\u003c/p\u003e\n\u003cp\u003eBryn just liked being reassured that she wasn’t the only one facing this weird, uncertain future.\u003c/p\u003e\n\u003cp\u003eBryn moved Mr. French off her (he grunted, snuffled, and rolled over without waking up) and turned the lights on. Getting ready was mechanical routine, and she didn’t do a lot of thinking while that was going on…brain on idle until the checklist was done. Makeup slowed her down a little, because she was still relearning the tricks she’d ignored as a teen and never mastered in the military, but she was ready for breakfast in a record thirty-five minutes, even so.\u003c/p\u003e\n\u003cp\u003eDownstairs, Liam was laying out the chafing dishes in the small dining room. He had all her favorites ready—bacon, low-cholesterol eggs, bagels with cream cheese, orange juice, and, best of all, free-flowing coffee. She didn’t know what Liam made his coffee with, but it had to be magical sparkles and crack beans, because it was the most delicious stuff she’d ever tasted. She was on her third cup when he sat down with his own breakfast.\u003c/p\u003e\n\u003cp\u003e“Nice to see you this morning,” he said, and took a sip. He liked his coffee black, and she’d never seen him eat anything at breakfast except the occasional soft-boiled egg. Although he never wore what she would have described as butler clothes, he was definitely well dressed at all times. Even now, he was rocking a petting-soft sweater vest that matched his steel blue eyes and graying hair. “Is there anything else you need this morning?”\u003c/p\u003e\n\u003cp\u003e“No, and if I do, I’ll get it,” she replied, and flashed him a smile. “I know where the kitchen is.”\u003c/p\u003e\n\u003cp\u003e“Horrors,” he said drily. “Next you’ll be wanting to do your own laundry.”\u003c/p\u003e\n\u003cp\u003e“I already do my own laundry.”\u003c/p\u003e\n\u003cp\u003e“Appalling.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eLiam tapped delicately at the shell of his egg and removed the pieces. “May I ask what your schedule is today?”\u003c/p\u003e\n\u003cp\u003e“Only if I can ask yours.”\u003c/p\u003e\n\u003cp\u003e“Then let me phrase it another way: do you expect to be home for dinner at seven?”\u003c/p\u003e\n\u003cp\u003e“As far as I know,” she said. “I’ll call if I have to change plans.”\u003c/p\u003e\n\u003cp\u003e“That would be helpful. You are being careful, are you not?” Liam knew everything about her current not-dead status; Patrick had seen to that, on the excuse that Liam knew everything anyway that went on under this roof. She still wasn’t entirely comfortable with that, but the horses were well out of the barn on that one.\u003c/p\u003e\n\u003cp\u003e“I’m taking my medicine on time,” she said. “Thanks, Mom. And I promise not to pet stray dogs or talk to strangers with candy, too.”\u003c/p\u003e\n\u003cp\u003eLiam sent her a quelling look for that particular snarkiness. “I mean it sincerely,” he said. “I sometimes worry you don’t take enough care of yourself.”\u003c/p\u003e\n\u003cp\u003e“I do nothing but take care of myself.” She sighed. “And if I ever forget, I’m sure you’ll call to remind me, Mother Hen.”\u003c/p\u003e\n\u003cp\u003e“Eat your breakfast,” he said, and smiled. “I’m only looking after the McCallister Trust’s investments.”\u003c/p\u003e\n\u003cp\u003eThe McCallister Trust had bought the old Fairview Mortuary and repaired it after the fire, and in effect, she worked for him, as he was the trust’s administrator…which was a head-spinning turnabout, when she took the time to analyze it. The trust also paid for Manny’s research on Returné that kept her shots coming without relying on the government supplies, so in pretty much every sense, Liam held her life in his hands.\u003c/p\u003e\n\u003cp\u003eAnd made her breakfast. It was all very emotionally confusing.\u003c/p\u003e\n\u003cp\u003e“Liam,” she said, and licked a bit of jam off her fingers, “why do you do all…this? I mean, you’re the trust administrator. You’re not actually the butler here. If anything, Patrick works for you.”\u003c/p\u003e\n\u003cp\u003e“I enjoy routines,” he said. “My father worked in this house, and I’ve been on staff since I was fifteen years old. The fact that the late Mr. McCallister decided to entrust me with the family’s assets instead of his son does not require me to stop doing a job at which I’m actually quite expert.” He was quiet for a moment, then met her eyes squarely. “This is Patrick’s birthright. His father was cruel to him. It doesn’t mean that I need to continue that cycle.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean—”\u003c/p\u003e\n\u003cp\u003e“I know,” he said. “I do it because I wish to do it. And that’s all there is to say.”\u003c/p\u003e\n\u003cp\u003eIt might have led to an awkward silence, but Liam, after a brief pause, asked Bryn what she thought about replanting the gardens, and she was grateful for a change of subject—so grateful, she even got enthusiastic about bromeliads. After her meal, Bryn walked Mr. French, then headed for work.\u003c/p\u003e\n\u003cp\u003eOn the drive, she called ahead to the office. “Lucy? Hey, girl. I don’t have any appointments, do I?”\u003c/p\u003e\n\u003cp\u003e“Clear schedule this morning,” Lucy said. “You’ve got that afternoon thing at Pharmadene.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll be in the office after lunch.”\u003c/p\u003e\n\u003cp\u003e“Please tell me you are off to some romantic rendezvous with hot Mr. Pat.”\u003c/p\u003e\n\u003cp\u003e“It’s not a romantic rendezvous,” Bryn said.\u003c/p\u003e\n\u003cp\u003e“Then tell me you’re not picking up a dead person, because it is way too early for that.”\u003c/p\u003e\n\u003cp\u003eBryn laughed. “See you soon, Luce.”\u003c/p\u003e\n\u003cp\u003e“You know Joe’s gonna ask me where you are this morning.”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “I know. Good luck with that.”\u003c/p\u003e\n\u003cp\u003e“Boss! Don’t you hang me out to dry!”\u003c/p\u003e\n\u003cp\u003e“Tell them I had to meet with a vendor off-site and I’ll be in after lunch.”\u003c/p\u003e\n\u003cp\u003eThere was a short silence, and then Lucy said, all traces of humor gone, “And will I be lying to him?”\u003c/p\u003e\n\u003cp\u003e“You know, I think I’m having a bad influence on you,” Bryn said, and cut the connection. Lucy didn’t try to call back, thankfully, and Bryn felt only a little guilty. What Lucy didn’t know would ensure that Joe didn’t decide to helpfully drop in on her meeting this morning with Carl, who was probably nervous enough to bolt if he imagined he saw anyone watching him. \u003c/p\u003e","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-6.html","bookId":2539,"creation":"Oct 5, 2019 11:58:16 PM","modification":"Oct 5, 2019 11:58:16 PM"}
