{"id":110351,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCoffee Jack’s was doing—as usual—brisk business. Doorman Dave saw her parking and got up from his table to swing the door open and hold it for her. “Top of the morning!” he told her with absolutely insane cheer, and gave her a sunny smile. Doorman Dave didn’t work for the shop; he was an elderly African-American man who was just here every morning with a giant cup of coffee and nothing to do. This was his hobby—meeting people, chatting, and…opening doors. He’d been doing it for years.\u003c/p\u003e\n\u003cp\u003e“Morning, Dave,” she said, and gave him as optimistic a smile as she could. “So, anybody new this morning?”\u003c/p\u003e\n\u003cp\u003e“Ah, you know, couple of dozen walk-in-and-outs.” He gave her a surprisingly sharp look. “Are you here to meet the nervous fella?”\u003c/p\u003e\n\u003cp\u003e“Dave. You know I come here all the time. I’m a regular.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but you never asked if there’s anybody new.” He nodded inside. “Back table, in the corner. He’s drinking unleaded. That’s probably wise, since he’s jumpy as a cat in a dog factory.”\u003c/p\u003e\n\u003cp\u003eBryn glanced at the coffee in Dave’s big hand. “You need a refill?”\u003c/p\u003e\n\u003cp\u003e“Could do with one,” he said, and his smile, if possible, got even brighter. “You spoil me, Bryn.” Dave greeted hundreds of people every day, but he remembered every single name. It was amazing, really.\u003c/p\u003e\n\u003cp\u003e“I’ll order you one up,” she said. “Thanks, Dave.”\u003c/p\u003e\n\u003cp\u003eHe winked at her and let the door fall shut behind her. She ordered herself a cappuccino and Dave’s regular poison, and chatted for a second with the counter staff (necessary at Coffee Jack’s, which was the most chatty place she’d ever visited) before looking around for Carl.\u003c/p\u003e\n\u003cp\u003eJust as Dave had said, there was a pale, nervous man in a suit sitting at the back table in the corner, next to the notice board. He was watching her, and took a quick swig from his cup and stood as she came over. “Carl?” she asked. He nodded, and she slid into the seat opposite his. “Good to meet you.”\u003c/p\u003e\n\u003cp\u003eHe nodded and sat down. He had the look; Bryn would have recognized it even if she hadn’t had the heads-up from Doorman Dave. There was a certain haunted expression in the eyes that she still saw traces of in her own mirror. If Dave still worked at Pharmadene, he was likely one of those lower-level employees who’d gotten his death-and-rebirth courtesy of a corporate memo. Bryn’s murder and Revival hadn’t been pleasant, but at least there had been a point…unlike with these poor bastards, who’d just worked in the wrong cubicle, for the wrong company. And now, like her, were saddled with an addiction that was as onerous as it was terrifying.\u003c/p\u003e\n\u003cp\u003e“I heard about you from Chandra in the research labs,” he said. “She said you’re…like us. But you don’t work for the company.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Bryn said. She tried the cappuccino, and as usual, it was amazing. “I was what you might call a lab rat. I got the shots before anyone at Pharmadene did.”\u003c/p\u003e\n\u003cp\u003e“So you understand.…” Carl hesitated, shifted his coffee around without drinking it, and finally burst out with it. “The government brought in counselors, you know. We’re supposed to talk to them. But I don’t…I don’t trust them. Any of them. I want to get out of this, and get my family out of it. Get free.”\u003c/p\u003e\n\u003cp\u003e“I don’t blame you,” Bryn said. “But it isn’t that simple. You can get free of Pharmadene, at least to a certain extent, and if you want, I can help you do that, but this isn’t a situation that gets any better. It’s maintenance. Scenery can change, but every day, the shots have to happen, forever. Once you reconcile yourself to that, you can start to deal with it.”\u003c/p\u003e\n\u003cp\u003e“But I don’t want to reconcile to it. I want it to stop. There has to be a way—”\u003c/p\u003e\n\u003cp\u003e“There isn’t,” she said flatly. “Look, I went through this, Carl, and I’m still dependent on the government program to some extent. I’ve consulted experts. I’ve done everything I can to make this go away, but it doesn’t. There isn’t a cure. There’s just…living, day to day. And I’m sorry, but you need to accept that before you get yourself into trouble. If there aren’t con artists preying on your desperation yet, it’s only a matter of time before one figures out there’s an opportunity. You need to be pragmatic about this if you want to survive.”\u003c/p\u003e\n\u003cp\u003e“I haven’t told my wife,” he said, and looked down. “I don’t know how to even start doing that. How did you…?”\u003c/p\u003e\n\u003cp\u003e“I’m not married,” she said. “And I can’t tell you what to do, Carl, but you can’t hide this from her. She needs to understand why you can’t go on vacation for a weekend, or miss a day at the office, or…whatever the situation might be. Not telling her is only going to get harder. The counselors at Pharmadene have training for this.…Take your wife in with you, sit down with them, and talk it all out. She’ll have to sign the government agreements and accept being monitored twenty-four/seven—not that she isn’t already. She’ll be shocked, and angry, and betrayed that you lied to her for this long, but it’s better if you do it in a situation where others can support what you’re saying.…” Her cell phone buzzed for attention, and Bryn pulled it from her pocket and checked it. “Sorry. Hang on a minute.” She recognized the caller ID.\u003c/p\u003e\n\u003cp\u003eBryn walked over to a quiet space, and took the call. “Mrs. Renfer?”\u003c/p\u003e\n\u003cp\u003e“Bryn?” The relief in the woman’s voice was as tragic as it was obvious. “Bryn, I know you told me not to call all the time, but this is important. I think—my husband knows something. I cut my hand yesterday, a bad one, and he knows it healed up.”\u003c/p\u003e\n\u003cp\u003eSame song, second verse. “Lynnette, you haven’t told him? Why not? Didn’t we talk about that in the group?”\u003c/p\u003e\n\u003cp\u003e“Yes, but—but I just can’t. I can’t tell him the truth yet. What if I tell him…something else?”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“I’m—a—a fast healer?” It was funny, but the desperate panic in Lynnette’s voice wasn’t. Bryn was just about out of patience with the woman; there had been at least ten of these calls now, and a whole lot of meetings, and Lynnette was stubbornly stuck in place, unwilling to move forward. Maybe having her husband actually see something that tipped the scales was a good thing, ultimately. It took away any chance of Lynnette avoiding the crash.\u003c/p\u003e\n\u003cp\u003e“You know that’s nonsense,” Bryn said. “Just tell him. Take him to Pharmadene and educate him. Please.”\u003c/p\u003e\n\u003cp\u003eShe hung up on Lynnette’s standard Reasons Why That Can’t Happen, and went back to Carl, who was still staring into his no-doubt-gone-cold coffee as if it held the answers. “Was that, ah, one of us?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “Not everybody deals with it well. Carl, I’m not kidding. It’s very important that you not stay where you are right now emotionally. It’s not a good place. Your family can help you, and you need to read them in on this as soon as you can, okay? Promise me you will.”\u003c/p\u003e\n\u003cp\u003eHe nodded, but it was more of a mechanical action than agreement. “What about the shots?” he asked. “I hear you have someone else you get them from instead of the government. Should I do that? I mean, if there’s a choice, I’d rather not have the FBI looking down my throat, you know?”\u003c/p\u003e\n\u003cp\u003e“I know,” Bryn said. “But the fact is, my guy can’t manufacture enough to support everyone who needs the drug, and the other option I know about is worse than the FBI. Trust me.”\u003c/p\u003e\n\u003cp\u003eCarl laughed, a little hollowly. “What’s worse than being owned by the government?”\u003c/p\u003e\n\u003cp\u003e“Being owned by a madman who wrings you dry,” she said. “Don’t go looking for that, Carl. This is early days. Things will change, and maybe they’ll get better, but for now, play it safe. And get your wife into this. I mean it.” When he stayed silent, Bryn said, “Do you have kids?”\u003c/p\u003e\n\u003cp\u003e“Two,” he said. “A nine-year-old boy and a six-year-old girl.”\u003c/p\u003e\n\u003cp\u003eHer heart broke a little—not just for him, but selfishly on her own account. She’d wanted children, but in that vague, rosy-future sort of way that she’d assumed would eventually come into focus when she met the right person.\u003c/p\u003e\n\u003cp\u003eShe’d met the right person, she thought. But there was no future of babies. Not for her.\u003c/p\u003e\n\u003cp\u003eBryn smiled and said, “Pictures?”\u003c/p\u003e\n\u003cp\u003eHe looked startled at that, but of course he had them, snapshots on his phone at least. He passed it over, and she paged through the photos. “Wow,” she said. “Great-looking kids. What are their names?”\u003c/p\u003e\n\u003cp\u003e“Robert and Josie,” he said. “What am I supposed to tell them? They’re going to grow up, and my wife is going to get older, and I’m going to just…be this. Every day, the same. I don’t get older. I don’t change. I just…exist.”\u003c/p\u003e\n\u003cp\u003e“Some people pay good money for that,” Bryn said. She was going for a joke, but he didn’t smile, not even a little.\u003c/p\u003e\n\u003cp\u003e“We’re never going to change,” he said. “Until we rot away. How do I explain that?”\u003c/p\u003e\n\u003cp\u003eThere it was, naked and panicked in his eyes, the same feeling Bryn faced, and pushed down, at least once a day. As far as she knew, they all felt it, the same shadow stalking them, relentless and dark.\u003c/p\u003e\n\u003cp\u003eShe reached out and touched his hand, and felt him flinch. “I don’t know,” she said. “We’re all making this up, Carl, every day. But you have to start with your wife. It’s your only real choice.”\u003c/p\u003e\n\u003cp\u003eShe talked to him a little more, but it was just noise, really; he wasn’t hearing her, and she had to resign herself to the fact that Carl, like Lynnette, just wasn’t ready yet. He’d get there. He’d have to.\u003c/p\u003e\n\u003cp\u003eEasy for you to say, part of her mocked. You don’t have to explain things to your kids. Except that she forced that out of her mind, too, every day…that she’d never have kids to explain it to, never hold her own baby, never see her child grow up. That had been taken from her, along with her life, in the basement of Fairview Mortuary, and she’d never get it back. The nanites coursing through her bloodstream could keep her walking, talking, doing almost everything the living could do…but not that. \u003c/p\u003e","sourceLink":"https://allnovel.net/two-weeks-notice-revivalist-2/page-7.html","bookId":2539,"creation":"Oct 5, 2019 11:58:16 PM","modification":"Oct 5, 2019 11:58:16 PM"}
