{"id":89079,"no":22,"title":"Page 22","content":"\u003cp\u003eElizabeth checked to see if Dr. Park was looking in our direction, and then turned back around. “Abby and Parker.”\u003c/p\u003e\n\u003cp\u003eAnother girl turned. “Oh, yeah. I heard Parker walked in on you two the next morning. Is it true?”\u003c/p\u003e\n\u003cp\u003e“You heard where?” I asked, adrenaline screaming through my veins.\u003c/p\u003e\n\u003cp\u003eElizabeth shrugged. “Everywhere. People were talking about it in my class this morning.”\u003c/p\u003e\n\u003cp\u003e“Mine, too,” Levi said.\u003c/p\u003e\n\u003cp\u003eThe other girl just nodded.\u003c/p\u003e\n\u003cp\u003eElizabeth turned around a bit more, leaning in my direction. “Did she really go at it with Parker in Brazil’s hallway, and then go home with you?”\u003c/p\u003e\n\u003cp\u003eShepley frowned. “She’s staying with us.”\u003c/p\u003e\n\u003cp\u003e“No,” the girl beside Elizabeth said. “Her and Parker were making out on Brazil’s couch, and then she got up, danced with Travis, Parker left all pissed, and she left with Travis . . . and Shepley.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I heard,” Elizabeth said, visibly trying to contain her enthusiasm. “I heard it was a threesome sort of deal. So . . . which is it, Travis?”\u003c/p\u003e\n\u003cp\u003eLevi seemed to be enjoying the conversation. “I’d always heard it was the other way around.”\u003c/p\u003e\n\u003cp\u003e“What’s that?” I asked, already irritated with his tone.\u003c/p\u003e\n\u003cp\u003e“Parker getting your sloppy seconds.”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes. Whoever this guy was, he knew way more about me than he should. I leaned down. “That’s some more of your fucking business, asshole.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Shepley said, putting his hand on my desk.\u003c/p\u003e\n\u003cp\u003eLevi immediately turned, and Elizabeth’s eyebrows shot up before she followed behind him.\u003c/p\u003e\n\u003cp\u003e“Fucking dirtbag,” I grumbled. I looked to Shepley. “Lunch is next. Someone’s going to say something to her. They’re saying we both bagged her. Fuck. Fuck, Shepley what do I do?”\u003c/p\u003e\n\u003cp\u003eShepley immediately began shoving his things in his backpack, and I did the same.\u003c/p\u003e\n\u003cp\u003e“Dismissed,” Dr. Park said. “Get the hell out and be productive citizens today.”\u003c/p\u003e\n\u003cp\u003eMy backpack thumped against my lower back as I sprinted across campus, making a beeline for the cafeteria. America and Abby came into sight, just a few steps from the entrance.\u003c/p\u003e\n\u003cp\u003eShepley grabbed America’s arm. “Mare,” he puffed.\u003c/p\u003e\n\u003cp\u003eI grabbed my hips, trying to catch my breath.\u003c/p\u003e\n\u003cp\u003e“Is there a mob of angry women chasing you?” Abby teased.\u003c/p\u003e\n\u003cp\u003eI shook my head. My hands were trembling, so I gripped the straps of my backpack. “I was trying to catch you . . . before you . . . went in,” I breathed.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” America asked Shepley.\u003c/p\u003e\n\u003cp\u003e“There’s a rumor,” Shepley began. “Everyone’s saying that Travis took Abby home and . . . the details are different, but it’s pretty bad.”\u003c/p\u003e\n\u003cp\u003e“What? Are you serious?” Abby cried.\u003c/p\u003e\n\u003cp\u003eAmerica rolled her eyes. “Who cares, Abby? People have been speculating about you and Trav for weeks. It’s not the first time someone has accused you two of sleeping together.”\u003c/p\u003e\n\u003cp\u003eI looked at Shepley, hoping he’d figured a way out of the predicament I’d gotten myself into.\u003c/p\u003e\n\u003cp\u003e“What?” Abby said. “There’s something else, isn’t there?”\u003c/p\u003e\n\u003cp\u003eShepley winced. “They’re saying you slept with Parker at Brazil’s, and then you let Travis . . . take you home, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003eHer mouth fell open. “Great! So I’m the school slut now?”\u003c/p\u003e\n\u003cp\u003eI had done this, and of course it was Abby that was getting the shit end of the stick. “This is my fault. If it was anyone else, they wouldn’t be saying that about you.” I walked into the cafeteria, my hands in fists at my sides.\u003c/p\u003e\n\u003cp\u003eAbby sat, and I made sure to sit a few seats across and down from her. Rumors had been spread about me bagging girls before, and sometimes Parker’s name was even mentioned, too, but I never cared until now. Abby didn’t deserve to be thought of that way just because she was my friend.\u003c/p\u003e\n\u003cp\u003e“You don’t have to sit down there, Trav. Come on, come sit,” Abby said, patting the empty table space in front of her.\u003c/p\u003e\n\u003cp\u003e“I heard you had quite a birthday, Abby,” Chris Jenks said, throwing a piece of lettuce onto my plate.\u003c/p\u003e\n\u003cp\u003e“Don’t start with her, Jenks,” I warned, glowering.\u003c/p\u003e\n\u003cp\u003eChris smiled, pushing up his round, pink cheeks. “I heard Parker is furious. He said he came by your apartment yesterday, and you and Travis were still in bed.”\u003c/p\u003e\n\u003cp\u003e“They were taking a nap, Chris,” America sneered.\u003c/p\u003e\n\u003cp\u003eAbby’s eyes darted to me. “Parker came by?”\u003c/p\u003e\n\u003cp\u003eI shifted uncomfortably in my chair. “I was gonna tell you.”\u003c/p\u003e\n\u003cp\u003e“When?” she snapped.\u003c/p\u003e\n\u003cp\u003eAmerica leaned into her ear, probably explaining what everyone else but Abby knew.\u003c/p\u003e\n\u003cp\u003eAbby put her elbows on the table, covering her face with her hands. “This just keeps getting better.”\u003c/p\u003e\n\u003cp\u003e“So you guys really didn’t do the deed?” Chris asked. “Damn, that sucks. Here I thought Abby was right for you after all, Trav.”\u003c/p\u003e\n\u003cp\u003e“You better stop now, Chris,” Shepley warned.\u003c/p\u003e\n\u003cp\u003e“If you didn’t sleep with her, mind if I take a shot?” Chris said, chuckling to his teammates.\u003c/p\u003e\n\u003cp\u003eWithout thinking, I jumped from my seat, and climbed over the table at Chris. His face metamorphosed in slow motion from smiling to wide eyes and an open mouth. I grabbed Chris by the throat with one hand, and a fistful of his T-shirt in the other. My knuckles barely felt the connection with his face. My rage was full blown and I was just short of letting everything fly. Chris covered his face, but I kept whaling on him.\u003c/p\u003e\n\u003cp\u003e“Travis!” Abby screamed, running around the table.\u003c/p\u003e\n\u003cp\u003eMy fist froze midflight, and then I released Chris’s shirt, letting him crumble into a ball on the floor. Abby’s expression made me falter; she was afraid of what she’d just seen. She swallowed, and took a step back. Her fear only made me more angry, not at her, but because I was ashamed of myself.\u003c/p\u003e\n\u003cp\u003eI shouldered past her and shoved through everyone else in my way. Two for two. First, I’d managed to help start a rumor about the girl I was in love with, and then scared her half to death.\u003c/p\u003e\n\u003cp\u003eThe solitude of my bedroom seemed like the only place fit for me. I was too ashamed to even seek the advice of my father. Shepley caught up with me. Without a word, he got into the Charger next to me and started the engine.\u003c/p\u003e\n\u003cp\u003eWe didn’t speak as Shepley drove to the apartment. The scene that would inevitably go down when Abby decided to come home was something my mind didn’t want to process.\u003c/p\u003e\n\u003cp\u003eShepley brought his car to a stop in its usual parking spot, and I got out, walking up the stairs like a zombie. There was no possible good ending. Either Abby was going to leave because she was afraid of what she saw, or even worse—I had to release her from the bet so she could leave, even if she didn’t want to.\u003c/p\u003e\n\u003cp\u003eMy heart had been back and forth between leaving Abby alone and deciding it was okay to pursue her more times than a freshly single sorority girl on the second floor of a frat house. Once inside, I threw my backpack against the wall, and made sure to slam the bedroom door behind me. It didn’t make me feel better, in fact, stomping around like a toddler reminded me just how much of Abby’s time I was wasting by pursuing her—if it could be called that.\u003c/p\u003e\n\u003cp\u003eThe high-pitched hum of America’s Honda idled briefly before she cut the engine. Abby would be with her. She would either come in screaming, or the complete opposite. I wasn’t sure which would make me feel worse.\u003c/p\u003e\n\u003cp\u003e“Travis?” Shepley said, opening the door.\u003c/p\u003e\n\u003cp\u003eI shook my head, and then sat on the edge of the bed. It sank under my weight.\u003c/p\u003e\n\u003cp\u003e“You don’t even know what she’s going to say. She could just be checking on you.”\u003c/p\u003e\n\u003cp\u003e“I said no.”\u003c/p\u003e\n\u003cp\u003eShepley closed the door. The trees outside were brown and beginning to shed what color remained. Soon they would be leafless. By the time the last leaves fell, Abby would be gone. Damn, I felt depressed.\u003c/p\u003e\n\u003cp\u003eA few minutes later, another knock on the door. “Travis? It’s me. Open up.”\u003c/p\u003e\n\u003cp\u003eI sighed. “Walk away, Pidge.”\u003c/p\u003e\n\u003cp\u003eThe door creaked when she cracked it open. I didn’t turn around. I didn’t have to. Toto was behind me, and his small tail was beating my back at the sight of her.\u003c/p\u003e\n\u003cp\u003e“What is going on with you, Trav?” she asked.\u003c/p\u003e\n\u003cp\u003eI didn’t know how to tell her the truth, and part of me knew she wouldn’t hear me, anyway, so I just stared out the window, counting the falling leaves. With each one that detached and floated to the ground, we were one more closer to Abby disappearing from my life. My own natural hourglass.\u003c/p\u003e\n\u003cp\u003eAbby stood beside me, crossing her arms. I waited for her to yell, or chastise me somehow for the meltdown in the cafeteria.\u003c/p\u003e\n\u003cp\u003e“You’re not going to talk to me about this?”\u003c/p\u003e\n\u003cp\u003eShe began to turn for the door, and I sighed. “You know the other day when Brazil mouthed off to me and you rushed to my defense? Well . . . that’s what happened. I just got a little carried away.”\u003c/p\u003e\n\u003cp\u003e“You were angry before Chris said anything,” she said, sitting next to me on the bed. Toto immediately crawled into her lap, begging for attention. I knew the feeling. All the antics, my stupid stunts; everything was to somehow get her attention, and she seemed oblivious to it all. Even my crazy behavior.\u003c/p\u003e\n\u003cp\u003e“I meant what I said before. You need to walk away, Pidge. God knows I can’t walk away from you.”\u003c/p\u003e\n\u003cp\u003eShe reached for my arm. “You don’t want me to leave.”\u003c/p\u003e\n\u003cp\u003eShe had no idea how right—and how wrong—she was. My conflicted feelings about her were maddening. I was in love with her; couldn’t imagine a life without her in it; but at the same time, I wanted her to have better. With that in mind, the thought of Abby with someone else was unbearable. Neither one of us could win, and yet I couldn’t lose her. The constant back and forth made me exhausted.\u003c/p\u003e\n\u003cp\u003eI pulled Abby against me, and then kissed her forehead. “It doesn’t matter how hard I try. You’re going to hate me when it’s all said and done.”\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around me, linking her fingers around the cusp of my shoulder. “We have to be friends. I won’t take no for an answer.”\u003c/p\u003e\n\u003cp\u003eShe’d stolen my line from our first date at the Pizza Shack. That seemed like a hundred lifetimes ago. I wasn’t sure when things had become so complicated.\u003c/p\u003e\n\u003cp\u003e“I watch you sleeping a lot,” I said, wrapping her in both of my arms. “You always look so peaceful. I don’t have that kind of quiet. I have all this anger and rage boiling inside of me—except when I watch you sleep.\u003c/p\u003e\n\u003cp\u003e“That’s what I was doing when Parker walked in. I was awake, and he walked in, and just stood there with this shocked look on his face. I knew what he thought, but I didn’t set him straight. I didn’t explain because I wanted him to think something happened. Now the whole school thinks you were with us both in the same night. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eAbby shrugged. “If he believes the gossip, it’s his own fault.”\u003c/p\u003e\n\u003cp\u003e“It’s hard to think anything else when he sees us in bed together.”\u003c/p\u003e\n\u003cp\u003e“He knows I’m staying with you. I was fully clothed, for Christ’s sake.”\u003c/p\u003e\n\u003cp\u003eI sighed. “He was probably too pissed to notice. I know you like him, Pidge. I should have explained. I owe you that much.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003e“You’re not mad?” I asked, surprised.\u003c/p\u003e\n\u003cp\u003e“Is that what you’re so upset about? You thought I’d be mad at you when you told me the truth?”\u003c/p\u003e\n\u003cp\u003e“You should be. If someone single-handedly sunk my reputation, I’d be a little pissed.”\u003c/p\u003e\n\u003cp\u003e“You don’t care about reputations. What happened to the Travis that doesn’t give a shit what anyone thinks?” she teased, nudging me with her elbow.\u003c/p\u003e\n\u003cp\u003e“That was before I saw the look on your face when you heard what everyone’s saying. I don’t want you to get hurt because of me.”\u003c/p\u003e\n\u003cp\u003e“You would never do anything to hurt me.”\u003c/p\u003e\n\u003cp\u003e“I’d rather cut off my arm.” I sighed.\u003c/p\u003e\n\u003cp\u003eI relaxed my cheek against her hair. She always smelled so good, felt so good. Being near her was like a sedative. My entire body relaxed, and I was suddenly so tired, I didn’t want to move. We sat together, our arms around each other, her head tucked in against my neck, for the longest time. Nothing beyond that moment was guaranteed, so I stayed there inside of it, with Pigeon.\u003c/p\u003e\n\u003cp\u003eWhen the sun began to set, I heard a faint knock at the door. “Abby?” America’s voice sounded small on the other side of the wood.\u003c/p\u003e\n\u003cp\u003e“Come in, Mare,” I said, knowing she was probably worried about why we were so quiet.\u003c/p\u003e\n\u003cp\u003eAmerica walked in with Shepley, and she smiled at the sight of us tangled in each other’s arms. “We were going to grab a bite to eat. You two feel like making a Pei Wei run?”\u003c/p\u003e\n\u003cp\u003e“Ugh . . . Asian again, Mare? Really?” I asked.\u003c/p\u003e\n\u003cp\u003e“Yes, really,” she said, seeming a little more relaxed. “You guys coming or not?”\u003c/p\u003e\n\u003cp\u003e“I’m starving,” Abby said.\u003c/p\u003e\n\u003cp\u003e“Of course you are, you didn’t get to eat lunch,” I said, frowning. I stood, raising her up with me. “Come on. Let’s get you some food.”\u003c/p\u003e\n\u003cp\u003eI wasn’t ready to let go of her yet, so I kept my arm around her for the ride to Pei Wei. She didn’t seem to mind, and even leaned against me in the car while I conceded to share a number-four meal with her.\u003c/p\u003e\n\u003cp\u003eAs soon as we found a booth, I unloaded my coat beside Abby and went to the bathroom. It was weird how everyone was pretending I hadn’t just pummeled someone a few hours ago, like nothing had happened. My hands formed a cup under the water, and I splashed my face, looking into the mirror. The water dripped from my nose and chin. Once again, I was going to have to swallow the dysphoria and go along with everyone else’s fake mood. As if we had to keep up pretenses to help Abby move through reality in her little bubble of ignorance where no one felt anything too strongly, and everything was cut-and-dried. \u003c/p\u003e","sourceLink":"https://allnovel.net/walking-disaster-beautiful-2/page-22.html","bookId":2787,"creation":"Oct 5, 2019 5:33:13 PM","modification":"Oct 5, 2019 5:33:13 PM"}
