{"id":89098,"no":41,"title":"Page 41","content":"\u003cp\u003eShe looked to Brad and forced a smile. “I would love to dance, Brad.”\u003c/p\u003e\n\u003cp\u003eBrad’s freckles stretched across his cheeks as he smiled, gesturing with his hand for Abby to lead the way to the stairs.\u003c/p\u003e\n\u003cp\u003eI staggered backward, feeling like I’d just been punched in the gut. A combination of anger, jealousy, and sadness boiled in my blood.\u003c/p\u003e\n\u003cp\u003e“A toast!” I yelled, climbing onto a chair. On my way to the top, I stole someone’s beer and held it out in front of me. “To douche bags!” I said, gesturing to Brad. “And to girls that break your heart.” I bowed to Abby. My throat tightened. “And to the absolute fucking horror of losing your best friend because you were stupid enough to fall in love with her.”\u003c/p\u003e\n\u003cp\u003eI tilted back the beer, finishing what was left, and then tossed it to the floor. The room was silent except for the music playing in the basement, and everyone stared at me in mass confusion.\u003c/p\u003e\n\u003cp\u003eAbby’s quick movement drew my attention when she grabbed Brad’s hand, leading him downstairs to the dance floor.\u003c/p\u003e\n\u003cp\u003eI jumped off the chair and started for the basement, but Shepley put the side of his fist against my chest, leaning into me. “You need to stop,” he said in a hushed voice. “This is only going to end badly.”\u003c/p\u003e\n\u003cp\u003e“If it ends, what does it matter?” I shoved past Shepley and down the stairs to where Abby was dancing with Brad. The snowball was too big to stop, so I decided just to roll with it. There was no shame in going balls out. We couldn’t go back to being friends, so making one of us hate the other seemed like a good idea.\u003c/p\u003e\n\u003cp\u003eI pushed my way through the couples on the dance floor, stopping beside Abby and Brad. “I’m cutting in.”\u003c/p\u003e\n\u003cp\u003e“No, you’re not. Jesus!” Abby said, ducking her head with embarrassment.\u003c/p\u003e\n\u003cp\u003eMy eyes bore into Brad’s. “If you don’t back away from my girl, I’ll rip out your fucking throat. Right here on the dance floor.”\u003c/p\u003e\n\u003cp\u003eBrad seemed conflicted, his eyes nervously darting from me to his dance partner. “Sorry, Abby,” he said, slowly pulling his arms away. He retreated to the stairs.\u003c/p\u003e\n\u003cp\u003e“How I feel about you right now, Travis . . . it very closely resembles hate.”\u003c/p\u003e\n\u003cp\u003e“Dance with me,” I pleaded, shifting to keep my balance.\u003c/p\u003e\n\u003cp\u003eThe song ended and Abby sighed. “Go drink another bottle of whiskey, Trav.” She turned to dance with the only single guy on the dance floor.\u003c/p\u003e\n\u003cp\u003eThe tempo was faster, and with every beat, Abby moved closer and closer to her new dance partner. David, my least favorite Sig Tau brother, danced behind her, grabbing her hips. They smiled as they two-timed her, putting their hands all over her body. David grabbed her hips and dug his pelvis into her ass. Everyone stared. Instead of feeling jealous, guilt washed over me. This is what I had reduced her to.\u003c/p\u003e\n\u003cp\u003eIn two steps, I bent down and wrapped my arm around Abby’s legs, throwing her over my shoulder, shoving David to the ground for being such an opportunistic dick.\u003c/p\u003e\n\u003cp\u003e“Put me down!” Abby said, pounding her fists into my back.\u003c/p\u003e\n\u003cp\u003e“I’m not going to let you embarrass yourself over me,” I growled, taking the stairs two at a time.\u003c/p\u003e\n\u003cp\u003eEvery pair of eyes we passed watched Abby kick and scream as I carried her across the room. “You don’t think,” she said while she struggled, “this is embarrassing? Travis!”\u003c/p\u003e\n\u003cp\u003e“Shepley! Is Donnie outside?” I yelled, ducking from her flailing limbs.\u003c/p\u003e\n\u003cp\u003e“Uh . . . yeah?” he said.\u003c/p\u003e\n\u003cp\u003e“Put her down!” America said, taking a step toward us.\u003c/p\u003e\n\u003cp\u003e“America,” Abby said, squirming, “don’t just stand there! Help me!”\u003c/p\u003e\n\u003cp\u003eAmerica’s mouth turned up and she laughed once. “You two look ridiculous.”\u003c/p\u003e\n\u003cp\u003e“Thanks a lot, friend!” she said, incredulous. Once we were outside, Abby only fought harder. “Put me down, dammit!”\u003c/p\u003e\n\u003cp\u003eI walked over to Donnie’s waiting car, opened the back door, and tossed Abby inside. “Donnie, you’re the DD tonight?”\u003c/p\u003e\n\u003cp\u003eDonnie turned around, nervously watching the chaos from the driver’s seat. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“I need you to take us to my apartment,” I said as I got in beside her.\u003c/p\u003e\n\u003cp\u003e“Travis . . . I don’t think . . .”\u003c/p\u003e\n\u003cp\u003e“Do it, Donnie, or I’ll shove my fist through the back of your head, I swear to God.”\u003c/p\u003e\n\u003cp\u003eDonnie immediately put the car into gear and pulled away from the curb. Abby lunged for the door handle. “I’m not going to your apartment!”\u003c/p\u003e\n\u003cp\u003eI grabbed one of her wrists, and then the other. She leaned down, sinking her teeth into my forearm. It hurt like hell, but I just closed my eyes. When I was sure she’d broken the skin and it felt like fire was shooting up my arm, I growled to offset the pain.\u003c/p\u003e\n\u003cp\u003e“Do your worst, Pidge. I’m tired of your shit.”\u003c/p\u003e\n\u003cp\u003eShe released me and then thrashed around again, trying to hit me, more for being insulted than trying to get away. “My shit? Let me out of this fucking car!”\u003c/p\u003e\n\u003cp\u003eI pulled her wrists close to my face. “I love you, dammit! You’re not going anywhere until you sober up and we figure this out!”\u003c/p\u003e\n\u003cp\u003e“You’re the only one that hasn’t figured it out, Travis!”\u003c/p\u003e\n\u003cp\u003eI released her wrists, and she crossed her arms, pouting the rest of the way to the apartment.\u003c/p\u003e\n\u003cp\u003eWhen the car slowed to a stop, Abby leaned forward. “Can you take me home, Donnie?”\u003c/p\u003e\n\u003cp\u003eI opened the door, and then pulled Abby out by the arm, swinging her over my shoulder again. “Night, Donnie,” I said, carrying her up the stairs.\u003c/p\u003e\n\u003cp\u003e“I’m calling your dad!” Abby cried.\u003c/p\u003e\n\u003cp\u003eI couldn’t help but laugh. “And he’d probably pat me on the shoulder and tell me that it’s about damn time!”\u003c/p\u003e\n\u003cp\u003eAbby’s body writhed while I pulled the keys from my pocket. “Knock it off, Pidge, or we’re going to fall down the stairs!”\u003c/p\u003e\n\u003cp\u003eFinally the door opened, and I stomped straight into Shepley’s room.\u003c/p\u003e\n\u003cp\u003e“Put. Me. Down!” Abby screamed.\u003c/p\u003e\n\u003cp\u003e“Fine,” I said, dropping her onto Shepley’s bed. “Sleep it off. We’ll talk in the morning.”\u003c/p\u003e\n\u003cp\u003eI imagined how pissed she must have been, but even though my back was throbbing from being lambasted by Abby’s fists for the last twenty minutes, it was a relief to have her in the apartment again.\u003c/p\u003e\n\u003cp\u003e“You can’t tell me what to do anymore, Travis! I don’t belong to you!”\u003c/p\u003e\n\u003cp\u003eHer words ignited a deep anger inside me. I stomped to the bed, planted my hands on the mattress on each side of her thighs, and leaned into her face.\u003c/p\u003e\n\u003cp\u003e“Well, I belong to you!” I screamed. I put so much force behind my words, I could feel all the blood rush to my face. Abby met my glare, refusing to even flinch. I looked at her lips, panting. “I belong to you,” I whispered, my anger fading as desire took over.\u003c/p\u003e\n\u003cp\u003eAbby reached out, but instead of slapping my face, she grabbed each of my cheeks and slammed her mouth into mine. Without hesitation, I lifted her into my arms and carried her into my bedroom, letting us both fall into my mattress.\u003c/p\u003e\n\u003cp\u003eAbby grabbed at my clothes, desperate to remove them. I unzipped her dress with one smooth movement, and then watched as she pulled it quickly over her head, tossing it to the floor. Our eyes met, and then I kissed her, moaning into her mouth when she kissed me back.\u003c/p\u003e\n\u003cp\u003eBefore I’d even had the chance to think, we were both naked. Abby grabbed my ass, anxious to pull me inside of her, but I resisted, the adrenaline burning through the whiskey and beer. My senses returned, and thoughts of permanent consequences began flashing though my mind. I had been an ass, I had pissed her off, but I never wanted Abby to wonder if I’d taken advantage of this moment.\u003c/p\u003e\n\u003cp\u003e“We’re both drunk,” I said, breathing hard.\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eHer thighs squeezed my hips, and I could feel the muscles under her soft skin quiver in anticipation.\u003c/p\u003e\n\u003cp\u003e“This isn’t right.” I fought against the alcohol haze that told me that the next few hours with her was worth whatever was on the other side of that moment.\u003c/p\u003e\n\u003cp\u003eI pressed my forehead against hers. As much as I wanted her, the painful thought of making Abby take the walk of shame in the morning was stronger than what my hormones were telling me to do. If she really wanted to go through with this, I needed solid proof.\u003c/p\u003e\n\u003cp\u003e“I want you,” she whispered against my mouth.\u003c/p\u003e\n\u003cp\u003e“I need you to say it.”\u003c/p\u003e\n\u003cp\u003e“I’ll say whatever you want.”\u003c/p\u003e\n\u003cp\u003e“Then say that you belong to me. Say that you’ll take me back. I won’t do this unless we’re together.”\u003c/p\u003e\n\u003cp\u003e“We’ve never really been apart, have we?”\u003c/p\u003e\n\u003cp\u003eI shook my head, sweeping my lips across hers. Not good enough. “I need to hear you say it. I need to know you’re mine.”\u003c/p\u003e\n\u003cp\u003e“I’ve been yours since the second we met,” she said, begging.\u003c/p\u003e\n\u003cp\u003eI stared into her eyes for a few seconds, and then felt my mouth turn up into a half smile, hoping her words were true and not just spoken in the moment. I leaned down and kissed her tenderly, and then she slowly pulled me into her. My entire body felt like it was melting inside of her.\u003c/p\u003e\n\u003cp\u003e“Say it again.” Part of me couldn’t believe it was all really happening.\u003c/p\u003e\n\u003cp\u003e“I’m yours.” She breathed. “I don’t ever want to be apart from you again.”\u003c/p\u003e\n\u003cp\u003e“Promise me,” I said, groaning with another thrust.\u003c/p\u003e\n\u003cp\u003e“I love you. I’ll love you forever.” She looked straight into my eyes when she spoke, and it finally clicked that her words weren’t just an empty promise.\u003c/p\u003e\n\u003cp\u003eI sealed my mouth over hers, the rhythm of our movements picking up momentum. Nothing else needed to be said, and for the first time in months, my world wasn’t upside down. Abby’s back arched, and her legs wrapped around my back, hooked at the ankles. I tasted every part of her skin I could reach as if I’d been starving for it. A part of me was. An hour passed, and then another. Even when I was exhausted, I kept going, afraid if we stopped I would wake up, and it would all be just a dream.\u003c/p\u003e\n\u003cp\u003eI SQUINTED AGAINST THE LIGHT POURING INTO THE room. I couldn’t sleep all night, knowing when the sun came up, it would all be over. Abby stirred, and my teeth clenched. The few hours we spent together wasn’t enough. I wasn’t ready.\u003c/p\u003e\n\u003cp\u003eAbby nuzzled her cheek against my chest. I kissed her hair, and then her forehead, and then her cheeks, neck, shoulders, and then I brought her hand to my mouth and tenderly kissed her wrist, palm, and fingers. I wanted to squeeze her but restrained myself. My eyes filled with hot tears for the third time since I’d brought her to my apartment. When she woke, she was going to be mortified, angry, and then leave me forever.\u003c/p\u003e\n\u003cp\u003eI’d never been so afraid to see the different shades of gray in her irises.\u003c/p\u003e\n\u003cp\u003eHer eyes still closed, Abby smiled, and I brought my mouth back to hers, terrified for the realization to hit.\u003c/p\u003e\n\u003cp\u003e“Good morning,” she said against my mouth.\u003c/p\u003e\n\u003cp\u003eI moved halfway above her and then continued to touch my lips to various spots on her skin. My arms dug beneath her, between her back and the mattress, and I buried my face in her neck, taking in her scent before she bolted out the door.\u003c/p\u003e\n\u003cp\u003e“You’re quiet this morning,” she said, running her hands over the bare skin of my back. She slid her palms over my ass, and then hooked her leg over my hip.\u003c/p\u003e\n\u003cp\u003eI shook my head. “I just want to be like this.”\u003c/p\u003e\n\u003cp\u003e“Did I miss something?”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to wake you up. Why don’t you just go back to sleep?”\u003c/p\u003e\n\u003cp\u003eAbby leaned back against the pillow, pulling up my chin to face her.\u003c/p\u003e\n\u003cp\u003e“What in the hell is wrong with you?” she asked, her body suddenly tense.\u003c/p\u003e\n\u003cp\u003e“Just go back to sleep, Pigeon. Please?”\u003c/p\u003e\n\u003cp\u003e“Did something happen? Is it America?” With the last question, she sat up.\u003c/p\u003e\n\u003cp\u003eI sat up with her, wiping my eyes.\u003c/p\u003e\n\u003cp\u003e“No . . . America’s fine. They got home around four this morning. They’re still in bed. It’s early, let’s just go back to sleep.”\u003c/p\u003e\n\u003cp\u003eHer eyes bounced around to different points of my room as she remembered the night before. Knowing any moment she would recall the fact that I’d dragged her out of the party and made a spectacle, I put both hands on each side of her face and kissed her one last time.\u003c/p\u003e\n\u003cp\u003e“Have you slept?” she asked, wrapping her arms around my middle.\u003c/p\u003e\n\u003cp\u003e“I . . . couldn’t. I didn’t wanna . . .”\u003c/p\u003e\n\u003cp\u003eShe kissed my forehead. “Whatever it is, we’ll get through it, okay? Why don’t you get some sleep? We’ll figure it out when you wake up.”\u003c/p\u003e\n\u003cp\u003eThat was not what I expected. My head popped up and I scanned her face. “What do you mean? That we’ll get through it?”\u003c/p\u003e\n\u003cp\u003eHer eyebrows pulled in. “I don’t know what’s going on, but I’m here.”\u003c/p\u003e\n\u003cp\u003e“You’re here? As in you’re staying? With me?”\u003c/p\u003e\n\u003cp\u003eHer expression scattered in different directions. “Yes. I thought we discussed this last night?”\u003c/p\u003e\n\u003cp\u003e“We did.” I probably looked like a total tool, but I nodded emphatically.\u003c/p\u003e\n\u003cp\u003eAbby’s eyes narrowed. “You thought I was going to wake up pissed at you, didn’t you? You thought I was going to leave?”\u003c/p\u003e\n\u003cp\u003e“That is what you’re famous for.”\u003c/p\u003e\n\u003cp\u003e“Is that what you’re so upset about? You stayed up all night worrying about what would happen when I woke up?”\u003c/p\u003e\n\u003cp\u003eI shifted. “I didn’t mean for last night to happen like that. I was a little drunk, and I followed you around the party like some fucking stalker, and then I dragged you out of there, against your will . . . and then we . . .” I shook my head, disgusted with myself.\u003c/p\u003e\n\u003cp\u003e“Had the best sex of my life?” Abby said, smiling and squeezing my hand.\u003c/p\u003e\n\u003cp\u003eI laughed once, astounded at how well the conversation was going. “So we’re okay?”\u003c/p\u003e\n\u003cp\u003eAbby held my face and kissed me tenderly. “Yes, dummy. I promised, didn’t I? I told you everything you wanted to hear, we’re back together, and you’re still not happy?”\u003c/p\u003e\n\u003cp\u003eMy breath faltered, and I choked back tears. It still didn’t seem real. \u003c/p\u003e","sourceLink":"https://allnovel.net/walking-disaster-beautiful-2/page-41.html","bookId":2787,"creation":"Oct 5, 2019 5:33:13 PM","modification":"Oct 5, 2019 5:33:13 PM"}
