{"id":89064,"no":7,"title":"Page 7","content":"\u003cp\u003e“There’s never been anyone in my bed but me.”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Give me a break!”\u003c/p\u003e\n\u003cp\u003e“I’m absolutely serious. I bag ’em on the couch. I don’t let them in my room.”\u003c/p\u003e\n\u003cp\u003e“Then why am I allowed in your bed?”\u003c/p\u003e\n\u003cp\u003eI wanted to tell her. Jesus, did I ever want to mouth the words, but I could barely admit it to myself, much less her. Deep down I knew I was a piece of shit, and she deserved better. Part of me wanted to carry her to the bedroom and show her why she was different, but that was also the one thing that stopped me. She was my opposite: innocent on the surface, and damaged deep within. There was something about her I needed in my life, and even though I wasn’t sure what it was, I couldn’t give into my bad habits and fuck it up. She was the forgiving type, I could see, but she had lines drawn that I knew better than to cross.\u003c/p\u003e\n\u003cp\u003eA better option popped into my head, and I smirked. “Are you planning on having sex with me tonight?”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“That’s why. Now get your cranky ass up, take your hot shower, and then we can study some bio.”\u003c/p\u003e\n\u003cp\u003eAbby’s eyes stared me down, but she complied. She nearly shoved her shoulder into me as she passed, and then slammed the bathroom door. The pipes under the apartment immediately whined in response to her turning on the water.\u003c/p\u003e\n\u003cp\u003eShe packed light: only the essentials. I found some shorts and a T-shirt and a pair of white cotton panties with purple stripes. I held them up in front of me, and then dug a little further. They were all cotton. She really didn’t plan to get naked with me, or even to tease. A little disappointing, but at the same time it made me like her even more. I wondered if she had any thongs at all.\u003c/p\u003e\n\u003cp\u003eWas she a virgin?\u003c/p\u003e\n\u003cp\u003eI laughed. A virgin in college was unheard of these days.\u003c/p\u003e\n\u003cp\u003eA tube of toothpaste and her toothbrush, and a small tub of some sort of face cream was packed, too, so I took them with me down the hall, grabbing a clean towel from the hall linen closet on the way.\u003c/p\u003e\n\u003cp\u003eI knocked once, but she didn’t answer, so I just walked in. She was behind the curtain, anyway, and she didn’t have anything I hadn’t seen before.\u003c/p\u003e\n\u003cp\u003e“Mare?”\u003c/p\u003e\n\u003cp\u003e“No, it’s me,” I said, setting her stuff on the counter beside the sink.\u003c/p\u003e\n\u003cp\u003e“What are you doing in here? Get out!” she squealed.\u003c/p\u003e\n\u003cp\u003eI laughed once. What a baby. “You forgot a towel, and I brought your clothes, and your toothbrush, and some weird face cream I found in your bag.”\u003c/p\u003e\n\u003cp\u003e“You went through my stuff?” Her voice went up an octave.\u003c/p\u003e\n\u003cp\u003eThe sudden laughter caught in my throat and I choked it back. I brought in Prudezilla’s things to be a nice guy, and she was freaking out. Not like I was going to find anything interesting in her bag, anyway. She was about as naughty as a Sunday school teacher.\u003c/p\u003e\n\u003cp\u003eI squeezed some of her toothpaste onto my toothbrush and turned on the faucet.\u003c/p\u003e\n\u003cp\u003eAbby was strangely quiet until her forehead and eyes popped out from behind the curtain. I tried to ignore her, feeling her eyes burning a hole in the back of my head.\u003c/p\u003e\n\u003cp\u003eHer irritation was a mystery. To me, the whole scenario was oddly relaxing. That thought caused me to pause; domesticity was not something I thought I’d enjoy.\u003c/p\u003e\n\u003cp\u003e“Get out, Travis,” she growled.\u003c/p\u003e\n\u003cp\u003e“I can’t go to bed without brushing my teeth.”\u003c/p\u003e\n\u003cp\u003e“If you come within two feet of this curtain, I will poke out your eyes while you sleep.”\u003c/p\u003e\n\u003cp\u003e“I won’t peek, Pidge.” Actually, the thought of her leaning over me, even with a knife in her hand, was kind of hot. More the leaning over part than the knife.\u003c/p\u003e\n\u003cp\u003eI finished brushing my teeth and then made my way to the bedroom, smiling the whole way. Within minutes the pipes silenced, but it took forever for her to come out.\u003c/p\u003e\n\u003cp\u003eImpatient, I poked my head through the bathroom door. “C’mon, Pidge! I’m gettin’ old, here!” Her appearance surprised me. I’d seen her without makeup on before, but her skin was pink and shiny, and her long, wet hair was slicked back away from her face. I couldn’t help but stare.\u003c/p\u003e\n\u003cp\u003eAbby reared back her arm and chucked her comb at me. I ducked, and then shut the door, chuckling all the way down the hall.\u003c/p\u003e\n\u003cp\u003eI could hear her small feet padding down the hall to my room, and my heart began to pound in my chest.\u003c/p\u003e\n\u003cp\u003e“Night, Abby,” America called from Shepley’s room.\u003c/p\u003e\n\u003cp\u003e“Night, Mare.”\u003c/p\u003e\n\u003cp\u003eI had to laugh. Nightmare was right. Shepley’s girlfriend had introduced me to my very own form of crack. I couldn’t get enough, and I didn’t want to quit. Even though I couldn’t call it anything but an addiction, I didn’t dare sample even a crumb. I only kept her close, feeling better just knowing she was around. There was no hope for me.\u003c/p\u003e\n\u003cp\u003eTwo small knocks brought me back to reality.\u003c/p\u003e\n\u003cp\u003e“Come in, Pidge. You don’t have to knock.”\u003c/p\u003e\n\u003cp\u003eAbby slipped in, her hair dark and damp, in a gray T-shirt and plaid boxer shorts. Wide eyes wandered about the room as she decided different things about me based on the bareness of my walls. It was the first time a woman had been in there. That moment wasn’t something I had thought about, but Abby changing the way the room felt was not something I expected.\u003c/p\u003e\n\u003cp\u003eBefore, it was just where I slept. A place where I’d never spent much time at all. Abby’s presence made the white, clutter-less walls obvious, to the point where I felt a lesser version of embarrassment. Abby being in my room made it feel like home, and the emptiness no longer seemed right.\u003c/p\u003e\n\u003cp\u003e“Nice pj’s,” I said finally, sitting on the bed. “Well, come on. I’m not going to bite you.”\u003c/p\u003e\n\u003cp\u003eHer chin lowered and she raised her brows. “I’m not afraid of you.” Her biology book landed beside me with a thud, and then she stopped. “Do you have a pen?”\u003c/p\u003e\n\u003cp\u003eI nodded to the night table. “Top drawer.” The second I said the words, my blood turned cold. She was going to find my stash. I readied myself for the impending death match that would quickly follow.\u003c/p\u003e\n\u003cp\u003eShe put one knee on the bed and reached over, pulling open the drawer and fishing around until her hand lurched back. In the next second, she grabbed the pen and then slammed the drawer shut.\u003c/p\u003e\n\u003cp\u003e“What?” I asked, pretending to scan over the words in the biology book.\u003c/p\u003e\n\u003cp\u003e“Did you rob the health clinic?”\u003c/p\u003e\n\u003cp\u003eHow does a pigeon know where to get condoms? “No. Why?”\u003c/p\u003e\n\u003cp\u003eHer face twisted. “Your lifetime supply of condoms.”\u003c/p\u003e\n\u003cp\u003eHere it comes. “Better safe than sorry, right?” She couldn’t possibly argue with that.\u003c/p\u003e\n\u003cp\u003eInstead of the yelling and name calling I expected, she rolled her eyes. I turned the pages of the biology book, trying not to look too relieved.\u003c/p\u003e\n\u003cp\u003e“Okay, we can start here. Jesus . . . photosynthesis? Didn’t you learn this in high school?”\u003c/p\u003e\n\u003cp\u003e“Kind of,” she said, defensively. “It’s Biology 101, Trav. I didn’t pick the curriculum.”\u003c/p\u003e\n\u003cp\u003e“And you’re in calculus? How can you be so advanced in math and behind in science?”\u003c/p\u003e\n\u003cp\u003e“I’m not behind. The first half is always review.”\u003c/p\u003e\n\u003cp\u003eI raised an eyebrow. “Not really.”\u003c/p\u003e\n\u003cp\u003eShe listened while I went over the basics of photosynthesis, and then the anatomy of plant cells. It didn’t matter how long I talked, or what I said, she hung on to every word. It was easy to pretend that she was interested in me and not a passing grade.\u003c/p\u003e\n\u003cp\u003e“Lipids. Not lipides. Tell me what they are again.”\u003c/p\u003e\n\u003cp\u003eShe pulled off her glasses. “I’m beat. I can’t memorize one more macromolecule.”\u003c/p\u003e\n\u003cp\u003eFuckin’ A. Bedtime. “All right.”\u003c/p\u003e\n\u003cp\u003eAbby suddenly looked nervous, which was curiously soothing to me.\u003c/p\u003e\n\u003cp\u003eI left her alone with her nerves to take a shower. Knowing she had just been standing naked in the same spot made for some arousing thoughts, so for the five minutes before I got out, the water had to be ice cold. It was uncomfortable, but at least it got rid of my hard-on.\u003c/p\u003e\n\u003cp\u003eWhen I returned to the bedroom, Abby was lying on her side, eyes closed, and stiff as a board. I dropped my towel, changed into my boxers, and then crawled into bed, flipping off the light. Abby didn’t move, but she wasn’t asleep.\u003c/p\u003e\n\u003cp\u003eEvery muscle in her body was tense, but they tightened even more just before she turned to face me.\u003c/p\u003e\n\u003cp\u003e“You’re sleeping in here, too?”\u003c/p\u003e\n\u003cp\u003e“Well, yeah. This is my bed.”\u003c/p\u003e\n\u003cp\u003e“I know, but I . . .” she trailed off, weighing her options.\u003c/p\u003e\n\u003cp\u003e“Don’t you trust me by now? I’ll be on my best behavior, I swear.” I held up my index, middle, and pinky finger, affectionately known by my frat brothers as the “shocker.” She didn’t get it.\u003c/p\u003e\n\u003cp\u003eAs much as being good would suck, I wasn’t going to run her off the first night by doing something stupid.\u003c/p\u003e\n\u003cp\u003eAbby was a delicate balance of tough and tender. Pushing her too far seemed to garner the same reaction as a cornered animal. It was fun to walk the tightrope she required, in a terrifying, driving-at-a-thousand-miles-per-hour, backward-on-a-motorcycle kind of way.\u003c/p\u003e\n\u003cp\u003eShe turned away from me, karate chopping the blanket around every curve of her body. Another smile crept across my face, and I leaned into her ear.\u003c/p\u003e\n\u003cp\u003e“Good night, Pigeon.”\u003c/p\u003e\n\u003cp\u003eCHAPTER SIX\u003c/p\u003e\n\u003cp\u003eShots\u003c/p\u003e\n\u003cp\u003eTHE SUN HAD JUST BEGUN TO CAST SHADOWS ON THE walls of my bedroom when I opened my eyes. Abby’s hair was tangled and messy, and covering my face. I took a deep breath through my nose.\u003c/p\u003e\n\u003cp\u003eDude. What are you doing . . . besides being creepy? I thought. I turned onto my back, but before I could stop myself, took in another breath. She still smelled like shampoo and lotion.\u003c/p\u003e\n\u003cp\u003eA few seconds later, the alarm bleated, and Abby began to rouse. Her hand ran across my chest, and then lurched back.\u003c/p\u003e\n\u003cp\u003e“Travis?” she said, groggily. “Your alarm.” She waited for a minute, and then sighed, reaching across me, straining until she finally reached the clock, and then pounded against the plastic until the noise stopped.\u003c/p\u003e\n\u003cp\u003eShe fell against her pillow and puffed. A chuckle escaped my lips, and she gasped.\u003c/p\u003e\n\u003cp\u003e“You were awake?”\u003c/p\u003e\n\u003cp\u003e“I promised I’d behave. I didn’t say anything about letting you lay on me.”\u003c/p\u003e\n\u003cp\u003e“I didn’t lay on you. I couldn’t reach the clock. That has to be the most annoying alarm I’ve ever heard. It sounds like a dying animal.”\u003c/p\u003e\n\u003cp\u003e“You want breakfast?” I tucked my hands behind my head.\u003c/p\u003e\n\u003cp\u003e“I’m not hungry.”\u003c/p\u003e\n\u003cp\u003eShe seemed pissed about something, but I ignored it. She probably just wasn’t a morning person. Although with that logic, she wasn’t really an afternoon or night person, either. Come to think of it, she was kind of a cranky bitch . . . and I liked it.\u003c/p\u003e\n\u003cp\u003e“Well, I am. Why don’t you ride with me down the street to the café?”\u003c/p\u003e\n\u003cp\u003e“I don’t think I can handle your lack of driving skills this early in the morning.” She wiggled her bony little feet into her slippers, and then shuffled to the door.\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003eShe was instantly annoyed. “To get dressed and go to class. Do you need an itinerary while I’m here?”\u003c/p\u003e\n\u003cp\u003eShe wanted to play hardball? Okay. I’d play. I walked over to her and cupped her shoulders in my hands. Damn, her skin felt good against mine. “Are you always so temperamental, or will that taper off once you believe I’m not just creating some elaborate scheme to get in your pants?”\u003c/p\u003e\n\u003cp\u003e“I’m not temperamental.”\u003c/p\u003e\n\u003cp\u003eI leaned in, whispering in her ear. “I don’t want to sleep with you, Pidge. I like you too much.”\u003c/p\u003e\n\u003cp\u003eHer body grew tense, and then I left without another word. Jumping up and down to celebrate the thrill of victory would have been a bit obvious, so I restrained myself until I was sufficiently hidden behind the door, and then made a few celebratory air punches. Keeping her on her toes was never easy, but when it worked, I felt like I was one step closer to . . .\u003c/p\u003e\n\u003cp\u003eTo what? I wasn’t exactly sure. It just felt right.\u003c/p\u003e\n\u003cp\u003eIt had been a while since I’d done any grocery shopping, so breakfast wasn’t quite gourmet, but it was good enough. I scrambled eggs in a bowl, throwing in a concoction of onion, green and red pepper, and then poured it into a skillet.\u003c/p\u003e\n\u003cp\u003eAbby walked in and sat on a stool.\u003c/p\u003e\n\u003cp\u003e“You sure you don’t want some?”\u003c/p\u003e\n\u003cp\u003e“I’m sure. Thanks, though.”\u003c/p\u003e\n\u003cp\u003eShe had just rolled out of bed and was still gorgeous. It was ridiculous. I was sure that couldn’t be typical, but I wouldn’t know, either. The only girls I’d seen in the morning were Shepley’s, and I didn’t look at any of them close enough to have an opinion.\u003c/p\u003e\n\u003cp\u003eShepley grabbed some plates and held them in front of me. I scooped up eggs in the spatula and flopped them onto each plate. Abby watched with mild interest.\u003c/p\u003e\n\u003cp\u003eAmerica puffed as Shepley sat the plate in front of her. “Don’t look at me like that, Shep. I’m sorry, I just don’t want to go.”\u003c/p\u003e\n\u003cp\u003eShepley had been moping for days about America’s rejection of his invitation to the date party. I didn’t blame her. Date parties were torture. The fact that she didn’t want to go was kinda impressive. Most girls fell all over themselves to be invited to those things.\u003c/p\u003e\n\u003cp\u003e“Baby,” Shepley whined, “the House has a date party twice a year. It’s a month away. You’ll have plenty of time to find a dress and do all that girl stuff.”\u003c/p\u003e\n\u003cp\u003eAmerica wasn’t going for it. I tuned them out until I realized America had agreed to go only if Abby would. If Abby went, that meant she’d go with a date. America looked to me, and I raised an eyebrow.\u003c/p\u003e\n\u003cp\u003eShepley didn’t hesitate. “Trav doesn’t go to the date parties. It’s something you take your girlfriend to . . . and Travis doesn’t . . . you know.”\u003c/p\u003e\n\u003cp\u003eAmerica shrugged. “We could set her up with someone.”\u003c/p\u003e\n\u003cp\u003eI started to speak up, but Abby clearly wasn’t happy. “I can hear you, you know,” she grumbled.\u003c/p\u003e\n\u003cp\u003eAmerica pouted. That was the face Shepley couldn’t deny.\u003c/p\u003e\n\u003cp\u003e“Please, Abby? We’ll find you a nice guy who’s funny and witty, and you know I’ll make sure he’s hot. I promise you’ll have a good time! And who knows? Maybe you’ll hit it off.” \u003c/p\u003e","sourceLink":"https://allnovel.net/walking-disaster-beautiful-2/page-7.html","bookId":2787,"creation":"Oct 5, 2019 5:33:13 PM","modification":"Oct 5, 2019 5:33:13 PM"}
