{"id":63462,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no one I trust more.\"\u003c/p\u003e\n\u003cp\u003eSliding my arms beneath his jacket, I hugged him, soaking up the warmth of his lean, hard body.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help but worry that we were beginning to drift from one another.\u003c/p\u003e\n\u003cp\u003eGideon pressed the advantage, his tongue dipping into my mouth, lightly touching and teasing mine with velvet licks.\u003c/p\u003e\n\u003cp\u003eDeceptively unhurried.\u003c/p\u003e\n\u003cp\u003eI sought a deeper contact, needing more.\u003c/p\u003e\n\u003cp\u003eAlways more.\u003c/p\u003e\n\u003cp\u003eHating that aside from this, he gave me so little of himself.\u003c/p\u003e\n\u003cp\u003eHe groaned into my mouth, an erotic sound of pleasure and need that vibrated through me.\u003c/p\u003e\n\u003cp\u003eTilting his head, he sealed those beautifully sculpted lips over mine.\u003c/p\u003e\n\u003cp\u003eThe kiss deepened, our tongues stroking, our breaths quickening.\u003c/p\u003e\n\u003cp\u003eThe arm he\u0027d banded beneath my back tightened, pulling me closer.\u003c/p\u003e\n\u003cp\u003eHis other hand slid beneath my shirt, cradling my spine in his warm palm.\u003c/p\u003e\n\u003cp\u003eHis fingertips flexed, gentling me even as the kiss grew wild.\u003c/p\u003e\n\u003cp\u003eI arched into the caress, needing the reassurance of his touch against my bare skin.\u003c/p\u003e\n\u003cp\u003e\"Gideon .\"\u003c/p\u003e\n\u003cp\u003eFor the first time, our physical closeness wasn\u0027t enough to calm the desperate wanting inside me.\u003c/p\u003e\n\u003cp\u003e\"Shh,\" he soothed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\u003c/p\u003e\n\u003cp\u003eNot going anywhere.\"\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I buried my face in his neck, wondering if we\u0027d both be too stubborn and stay, even if it turned out that it would be best to let go.\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003eI woke with a cry that was muffled by the sweaty palm mashed over my mouth.\u003c/p\u003e\n\u003cp\u003eA crushing weight cut off my air as another hand shoved up beneath my nightgown, groping and bruising.\u003c/p\u003e\n\u003cp\u003ePanic gripped me and I thrashed, my legs kicking frantically.\u003c/p\u003e\n\u003cp\u003eNo .\u003c/p\u003e\n\u003cp\u003ePlease, no .\u003c/p\u003e\n\u003cp\u003eNo more.\u003c/p\u003e\n\u003cp\u003eNot again.\u003c/p\u003e\n\u003cp\u003ePanting like a dog, Nathan yanked my legs apart.\u003c/p\u003e\n\u003cp\u003eThe hard thing between his legs poked blindly, ramming into my inner thigh.\u003c/p\u003e\n\u003cp\u003eI fought, my lungs burning, but he was so strong.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t buck him off.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t get away.\u003c/p\u003e\n\u003cp\u003eStop it! Get off me.\u003c/p\u003e\n\u003cp\u003eDon\u0027t touch me.\u003c/p\u003e\n\u003cp\u003eOh, God .\u003c/p\u003e\n\u003cp\u003eplease don\u0027t do that to me .\u003c/p\u003e\n\u003cp\u003edon\u0027t hurt me .\u003c/p\u003e\n\u003cp\u003eMa-ma! Nathan\u0027s hand pressed down on me, squashing my head into the pillow.\u003c/p\u003e\n\u003cp\u003eThe more I struggled, the more excited he became.\u003c/p\u003e\n\u003cp\u003eGasping horrible, nasty words in my ear, he found the tender spot between my legs and shoved into me, groaning.\u003c/p\u003e\n\u003cp\u003eI froze, locking in a vise of horrendous pain.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" he grunted.\u003c/p\u003e\n\u003cp\u003e\".\u003c/p\u003e\n\u003cp\u003elike it once it\u0027s in you .\u003c/p\u003e\n\u003cp\u003ehot little slut .\u003c/p\u003e\n\u003cp\u003eyou like it .\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t breathe, my lungs shuddering with sobs, my nostrils plugged by the heel of his palm.\u003c/p\u003e\n\u003cp\u003eSpots danced before my eyes; my chest burned.\u003c/p\u003e\n\u003cp\u003eI fought again .\u003c/p\u003e\n\u003cp\u003eneeding air .\u003c/p\u003e\n\u003cp\u003edesperate for air -\u0026nbsp; \"Eva! Wake up!\" My eyes snapped open at the barked command.\u003c/p\u003e\n\u003cp\u003eI heaved myself away from the hands gripping my biceps, gaining my freedom.\u003c/p\u003e\n\u003cp\u003eI clawed away .\u003c/p\u003e\n\u003cp\u003efighting the sheets that bound my legs .\u003c/p\u003e\n\u003cp\u003etumbling down .\u003c/p\u003e\n\u003cp\u003eThe jolting impact of hitting the floor woke me fully, and an awful sound of pain and fear scraped up through my throat.\u003c/p\u003e\n\u003cp\u003e\"Christ! Eva, damn it.\u003c/p\u003e\n\u003cp\u003eDon\u0027t hurt yourself!\" I sucked in air with deep gulps and scrambled toward the bathroom on all fours.\u003c/p\u003e\n\u003cp\u003eGideon scooped me up and gripped me to his chest.\u003c/p\u003e\n\u003cp\u003e\"Eva.\"\u003c/p\u003e\n\u003cp\u003e\"Sick,\" I gasped, slapping a hand over my mouth as my stomach roiled.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got you,\" he said grimly, carrying me with brisk, powerful strides.\u003c/p\u003e\n\u003cp\u003eHe took me to the toilet and tossed up the seat.\u003c/p\u003e\n\u003cp\u003eKneeling beside me, he held my hair back as I heaved, his warm hand stroking up and down my spine.\u003c/p\u003e\n\u003cp\u003e\"Shh .\u003c/p\u003e\n\u003cp\u003eangel,\" he murmured, over and over.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay.\u003c/p\u003e\n\u003cp\u003eYou\u0027re safe.\"\u003c/p\u003e\n\u003cp\u003eWhen my stomach was empty, I flushed the toilet and rested my sweat- drenched face on my forearm, trying to focus on anything but the remnants of my dream.\u003c/p\u003e\n\u003cp\u003e\"Baby girl.\"\u003c/p\u003e\n\u003cp\u003eI turned my head to find Cary standing in the threshold of my bathroom, his handsome face marred by a frown.\u003c/p\u003e\n\u003cp\u003eHe was fully dressed in loose jeans and a henley, which made me aware that Gideon was fully dressed, too.\u003c/p\u003e\n\u003cp\u003eHe\u0027d lost the suit earlier when we\u0027d first come back to my apartment, but he wasn\u0027t wearing the sweats he had put on then.\u003c/p\u003e\n\u003cp\u003eInstead he was in jeans and a black T-shirt.\u003c/p\u003e\n\u003cp\u003eDisoriented by their appearances, I glanced at my watch and saw it was just after midnight.\u003c/p\u003e\n\u003cp\u003e\"What are you guys doing?\" \"I was just coming in,\" Cary said.\u003c/p\u003e\n\u003cp\u003e\"And caught up with Cross on his way up.\"\u003c/p\u003e\n\u003cp\u003eI looked at Gideon, whose concerned frown matched my roommate\u0027s.\u003c/p\u003e\n\u003cp\u003e\"You went out?\" Gideon helped me to my feet.\u003c/p\u003e\n\u003cp\u003e\"I told you I had some things to take care of.\"\u003c/p\u003e\n\u003cp\u003eUntil midnight? \"What things?\" \"It\u0027s not important.\"\u003c/p\u003e\n\u003cp\u003eI shrugged out of his hold and went to the sink to brush my teeth.\u003c/p\u003e\n\u003cp\u003eAnother secret.\u003c/p\u003e\n\u003cp\u003eHow many did he have? Cary appeared at my elbow, his gaze meeting mine in the reflection of my vanity mirror.\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t had a bad dream in a long time.\"\u003c/p\u003e\n\u003cp\u003eLooking into his worried green eyes, I let him see how worn down I was.He gave my shoulder a reassuring squeeze.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll take it easy this weekend.\u003c/p\u003e\n\u003cp\u003eRecharge.\u003c/p\u003e\n\u003cp\u003eWe both need it.\u003c/p\u003e\n\u003cp\u003eYou gonna be all right tonight?\" \"I\u0027ve got her.\"\u003c/p\u003e\n\u003cp\u003eGideon straightened from his perch on the lip of my bathtub, where he\u0027d taken off his boots.\u003c/p\u003e\n\u003cp\u003e\"That doesn\u0027t mean I\u0027m not here.\"\u003c/p\u003e\n\u003cp\u003eCary pressed a quick kiss to my temple.\u003c/p\u003e\n\u003cp\u003e\"Holler if you need me.\"\u003c/p\u003e\n\u003cp\u003eThe look he gave me before he left the room spoke volumes - he wasn\u0027t comfortable with Gideon sleeping over.\u003c/p\u003e\n\u003cp\u003eTruth was, I had some reservations, too.\u003c/p\u003e\n\u003cp\u003eI thought my lingering wariness over Gideon\u0027s sleep disorder was contributing a lot to my wild emotional state.\u003c/p\u003e\n\u003cp\u003eAs Cary had recently said, the man I loved was a ticking time bomb, and I shared a bed with him.\u003c/p\u003e\n\u003cp\u003eI rinsed out my mouth and dropped my toothbrush back into its holder.\u003c/p\u003e\n\u003cp\u003e\"I need a shower.\"\u003c/p\u003e\n\u003cp\u003eI\u0027d taken one before I crashed, but now I felt dirty again.\u003c/p\u003e\n\u003cp\u003eCold sweat clung to my skin and when I closed my eyes, I could smell him - Nathan - on me.\u003c/p\u003e\n\u003cp\u003eGideon turned on the water, then started stripping, blessedly distracting me with the sight of his gloriously tight body.\u003c/p\u003e\n\u003cp\u003eHis muscles were hard and well defined, his build lean yet powerful and elegant.\u003c/p\u003e\n\u003cp\u003eI left my clothes where they fell and stepped beneath the steamy spray with a groan.\u003c/p\u003e\n\u003cp\u003eHe entered the stall behind me, brushing my hair aside and pressing a kiss to my shoulder.\u003c/p\u003e\n\u003cp\u003e\"How are you?\" \"Better.\"\u003c/p\u003e\n\u003cp\u003eBecause you\u0027re near.\u003c/p\u003e\n\u003cp\u003eHis arms wrapped carefully around my waist and he released a shaky exhalation.\u003c/p\u003e\n\u003cp\u003e\"I .\u003c/p\u003e\n\u003cp\u003eJesus, Eva.\u003c/p\u003e\n\u003cp\u003eWere you dreaming about Nathan?\" I took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"Maybe one day we\u0027ll talk about our dreams, huh?\" He inhaled sharply, his fingertips flexing against my hip.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like that, is it?\" \"Yeah,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like that.\"\u003c/p\u003e\n\u003cp\u003eWe stood there for a long moment, surrounded by steam and secrets, physically close yet emotionally distant.\u003c/p\u003e\n\u003cp\u003eI hated it.\u003c/p\u003e\n\u003cp\u003eThe urge to cry was overwhelming and I didn\u0027t fight it.\u003c/p\u003e\n\u003cp\u003eIt felt good to get it out.\u003c/p\u003e\n\u003cp\u003eAll the pressure of the long day seemed to flow out of me as I sobbed.\u003c/p\u003e\n\u003cp\u003e\"Angel .\"\u003c/p\u003e\n\u003cp\u003eGideon pressed into my back, his arms tight around my waist, soothing me with the protective shield of his big body.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t cry .\u003c/p\u003e\n\u003cp\u003eGod.\u003c/p\u003e\n\u003cp\u003eI can\u0027t take it.\u003c/p\u003e\n\u003cp\u003eTell me what you need, angel.\u003c/p\u003e\n\u003cp\u003eTell me what I can do.\"\u003c/p\u003e\n\u003cp\u003e\"Wash it away,\" I whispered, leaning into him, needing the comfort of his tender possessiveness.\u003c/p\u003e\n\u003cp\u003eMy fingers laced with his against my stomach.\u003c/p\u003e\n\u003cp\u003e\"Make me clean.\"\u003c/p\u003e\n\u003cp\u003e\"You are.\"\u003c/p\u003e\n\u003cp\u003eI sucked in a shuddering breath, shaking my head.\u003c/p\u003e\n\u003cp\u003e\"Listen to me, Eva.\u003c/p\u003e\n\u003cp\u003eNo one can touch you,\" he said fiercely.\u003c/p\u003e\n\u003cp\u003e\"No one can get to you.\u003c/p\u003e\n\u003cp\u003eNever again.\"\u003c/p\u003e\n\u003cp\u003eMy fingers tightened on his.\u003c/p\u003e\n\u003cp\u003e\"They\u0027d have to get through me, Eva.\u003c/p\u003e\n\u003cp\u003eAnd that will never happen.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t speak past the ache in my throat.\u003c/p\u003e\n\u003cp\u003eThe thought of Gideon facing my nightmare .\u003c/p\u003e\n\u003cp\u003eseeing the man who\u0027d done those things to me .\u003c/p\u003e\n\u003cp\u003etightened the cold knot that had been sitting in my gut all day.\u003c/p\u003e\n\u003cp\u003eGideon reached for my shampoo and I closed my eyes, shutting it all out, everything but the man whose sole focus at that moment was me.\u003c/p\u003e\n\u003cp\u003eI waited, breathless, for the feel of his magic fingers.\u003c/p\u003e\n\u003cp\u003eWhen it came, I reached out to the wall in front of me for balance.\u003c/p\u003e\n\u003cp\u003eWith both palms pressed flat against the cool tile, I savored the feel of his fingertips kneading into my scalp and moaned.\u003c/p\u003e\n\u003cp\u003e\"Feel good?\" he asked, his voice low and rough.\u003c/p\u003e\n\u003cp\u003e\"Always.\"\u003c/p\u003e\n\u003cp\u003eI drifted in bliss as he washed and conditioned my hair, shivering lightly as he ran a wide-toothed comb through the soaked strands.\u003c/p\u003e\n\u003cp\u003eI was disappointed when he finished and must have made some sound of regret, because he leaned forward and promised, \"I\u0027m not nearly done.\"\u003c/p\u003e\n\u003cp\u003eI smelled my body wash, then -\u0026nbsp; \"Gideon.\"\u003c/p\u003e\n\u003cp\u003eI arched into his soap-slick hands.\u003c/p\u003e\n\u003cp\u003eHis thumbs dug gently into the knots in my shoulders, melting them with the perfect amount of pressure.\u003c/p\u003e\n\u003cp\u003eThen he worked his way down my spine .\u003c/p\u003e\n\u003cp\u003emy buttocks .\u003c/p\u003e\n\u003cp\u003emy legs .\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to fall,\" I slurred, drunk with pleasure.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll catch you, angel.\u003c/p\u003e\n\u003cp\u003eI\u0027ll always catch you.\"\u003c/p\u003e\n\u003cp\u003eThe pain and degradation of my memories washed away beneath the selfless reverence of Gideon\u0027s patient caretaking.\u003c/p\u003e\n\u003cp\u003eMore than the soap and water, it was his touch that freed me from the nightmare.\u003c/p\u003e\n\u003cp\u003eI turned around at his urging and looked at him crouched before me, his hands gliding up my calves, his body an amazing display of taut flexing muscle. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-10.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
