{"id":63471,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt was one of my deepest fears that his career choice would come back to haunt him in ways neither of us could bear.\u003c/p\u003e\n\u003cp\u003eMy mother took a delicate sip of her Pellegrino.\u003c/p\u003e\n\u003cp\u003eThe cafe specialized in cacao-laced menu items, but she was careful not to waste her daily calorie allotment on one meal.\u003c/p\u003e\n\u003cp\u003eI was less cautious.\u003c/p\u003e\n\u003cp\u003eI\u0027d ordered a soup and sandwich combination plus a dessert that was going to cost me at least an extra hour on the treadmill later.\u003c/p\u003e\n\u003cp\u003eI excused the indulgence with a mental reminder that I was on my period, which was a carte blanche chocolate zone in my opinion.\u003c/p\u003e\n\u003cp\u003e\"So,\" Monica smiled at Megumi, \"will you be seeing your blind date again?\" \"I hope so.\"\u003c/p\u003e\n\u003cp\u003e\"Darling, don\u0027t leave it to chance!\" As my mom started doling out her wisdom in regard to managing men, I sat back and enjoyed the show.\u003c/p\u003e\n\u003cp\u003eShe was of the firm belief that every woman deserved to have a wealthy man to dote on her, and for the first time in forever, she wasn\u0027t concentrating her matchmaking efforts on me.\u003c/p\u003e\n\u003cp\u003eWhile I was worried about how my dad and Gideon would hit it off, I had no concerns about my mom\u0027s feelings on the matter.\u003c/p\u003e\n\u003cp\u003eWe both thought I was with the right guy for me, although for different reasons.\u003c/p\u003e\n\u003cp\u003e\"Your mom rocks,\" Megumi said, when Monica ducked into the ladies\u0027 room to freshen up before we left.\u003c/p\u003e\n\u003cp\u003e\"And you look just like her, lucky you.\u003c/p\u003e\n\u003cp\u003eHow bad would it suck to have a mom who\u0027s hotter than you are?\" Laughing, I told her, \"I\u0027ll have to drag you along with us again.\u003c/p\u003e\n\u003cp\u003eThis worked out great.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like that.\"\u003c/p\u003e\n\u003cp\u003eWhen it was time to go, I looked at Clancy and the town car waiting at the curb for us and realized I wanted to walk off some of my lunch before I got back to work.\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027m going to hoof it back,\" I told them.\u003c/p\u003e\n\u003cp\u003e\"I ate too much.\u003c/p\u003e\n\u003cp\u003eYou two go on without me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go with you,\" Megumi said.\u003c/p\u003e\n\u003cp\u003e\"I could use the air, hot as it is.\u003c/p\u003e\n\u003cp\u003eThat canned air in the office makes my skin dry.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come, too,\" my mom offered.\u003c/p\u003e\n\u003cp\u003eI eyed her delicate heels skeptically, but then again, my mom wore nothing but heels.\u003c/p\u003e\n\u003cp\u003eFor her, walking in those was probably the same as walking in flats was to me.\u003c/p\u003e\n\u003cp\u003eWe headed back to the Crossfire at the standard stride rate for Manhattan, which was something of a steady, purposeful clip.\u003c/p\u003e\n\u003cp\u003eWhile weaving around human obstacles was usually part of the process, it was far less of an issue with my mom in the lead.\u003c/p\u003e\n\u003cp\u003eMen moved reverently off to the side for her, then followed her with their eyes.\u003c/p\u003e\n\u003cp\u003eIn her simple, sexy wrap dress of ice blue, she looked cool and refreshing in the humid heat.\u003c/p\u003e\n\u003cp\u003eWe\u0027d just turned the corner to reach the Crossfire when she came to an abrupt halt that caused Megumi and me to crash into the back of her.\u003c/p\u003e\n\u003cp\u003eShe stumbled forward, wobbling, and I barely caught her by the elbow before she teetered over.\u003c/p\u003e\n\u003cp\u003eI looked at the ground to see what had held her up, but when I didn\u0027t see anything I looked at her.\u003c/p\u003e\n\u003cp\u003eShe was staring at the Crossfire in a daze.\u003c/p\u003e\n\u003cp\u003e\"Jesus, Mom,\" I urged her out of the flow of pedestrians.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re white as a sheet.\u003c/p\u003e\n\u003cp\u003eIs the heat getting to you? Do you feel dizzy?\" \"What?\" Her hand went to her throat.\u003c/p\u003e\n\u003cp\u003eHer dilated gaze remained fixed to the Crossfire.\u003c/p\u003e\n\u003cp\u003eTurning my head, I followed her line of sight, trying to see whatever it was that she did.\u003c/p\u003e\n\u003cp\u003e\"What are you two looking at?\" Megumi asked, frowning down the street.\u003c/p\u003e\n\u003cp\u003e\"Mrs.\u003c/p\u003e\n\u003cp\u003eStanton.\"\u003c/p\u003e\n\u003cp\u003eClancy approached, having abandoned the town car he\u0027d been driving at a safe but discreet distance behind us.\u003c/p\u003e\n\u003cp\u003e\"Is everything all right?\" \"Did you see - ?\" she began, looking to him with her question.\u003c/p\u003e\n\u003cp\u003e\"See what?\" I demanded, as his head snapped up and his trained gaze raked the length of the street.\u003c/p\u003e\n\u003cp\u003eThe absoluteness of his focus sent a shiver down my spine.\u003c/p\u003e\n\u003cp\u003e\"Let me drive you three the rest of the way,\" he said quietly.\u003c/p\u003e\n\u003cp\u003eThe entrance to the Crossfire was literally across the street, but something in Clancy\u0027s tone brooked no argument.\u003c/p\u003e\n\u003cp\u003eWe all climbed in, with my mother taking the front seat.\u003c/p\u003e\n\u003cp\u003e\"What was that about?\" Megumi asked after we\u0027d been dropped off and had moved into the cool interior of the building.\u003c/p\u003e\n\u003cp\u003e\"Your mom looked like she\u0027d seen a ghost.\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea.\"\u003c/p\u003e\n\u003cp\u003eBut I felt ill.\u003c/p\u003e\n\u003cp\u003eSomething had frightened my mother.\u003c/p\u003e\n\u003cp\u003eIt was going to drive me crazy until I found out what it was.\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eMy back hit the mat with enough force to knock the air from my lungs.\u003c/p\u003e\n\u003cp\u003eStunned, I blinked up at the ceiling, trying to catch my breath.\u003c/p\u003e\n\u003cp\u003eParker Smith\u0027s face came into view.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wasting my time.\u003c/p\u003e\n\u003cp\u003eIf you\u0027re going to be here, be here.\u003c/p\u003e\n\u003cp\u003eOne hundred percent.\u003c/p\u003e\n\u003cp\u003eNot a million miles away in your head somewhere.\"\u003c/p\u003e\n\u003cp\u003eI grabbed the hand he extended to me, and he yanked me to my feet.\u003c/p\u003e\n\u003cp\u003eAround us, a dozen more of Parker\u0027s Krav Maga students were hard at work.\u003c/p\u003e\n\u003cp\u003eThe Brooklyn-based studio was alive with noise and activity.\u003c/p\u003e\n\u003cp\u003eHe was right.\u003c/p\u003e\n\u003cp\u003eMy thoughts were still stuck on my mom and the bizarre way she\u0027d reacted when we returned to the Crossfire after lunch.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got something on my mind.\"\u003c/p\u003e\n\u003cp\u003eHe moved like lightning, tagging me first on one knee, then my shoulder with rapid-fire slaps.\u003c/p\u003e\n\u003cp\u003e\"Do you think an attacker is going to wait until you\u0027re alert and ready before he comes after you?\" I crouched, forcing myself to focus.\u003c/p\u003e\n\u003cp\u003eParker crouched as well, his brown eyes hard and watchful.\u003c/p\u003e\n\u003cp\u003eHis shaved head and cafe au lait skin gleamed beneath the overhead fluorescent lighting.\u003c/p\u003e\n\u003cp\u003eThe studio was in a converted warehouse, which had been left rough for both economic reasons and atmosphere.\u003c/p\u003e\n\u003cp\u003eMy mother and stepfather were paranoid enough to have Clancy accompany me to my classes.\u003c/p\u003e\n\u003cp\u003eThe neighborhood was presently undergoing revitalization, which I thought was encouraging but they thought was troubling.\u003c/p\u003e\n\u003cp\u003eWhen Parker came at me again, I blocked him.\u003c/p\u003e\n\u003cp\u003eThe tagging came fast and furious then, and I pushed all other thoughts aside until later, when I was home.\u003c/p\u003e\n\u003cp\u003eWhen Gideon came over about an hour later, he found me in the bath surrounded by vanilla-scented candles.\u003c/p\u003e\n\u003cp\u003eHe undressed to join me, even though his damp hair told me he\u0027d already showered after spending time with his own personal trainer.\u003c/p\u003e\n\u003cp\u003eI watched him strip, riveted.\u003c/p\u003e\n\u003cp\u003eThe play of muscles beneath his skin and the inherent gracefulness in the way he moved sent a delicious sense of contentment sliding through me.\u003c/p\u003e\n\u003cp\u003eHe climbed into the deep oval tub behind me, his long legs sliding in on either side of mine.\u003c/p\u003e\n\u003cp\u003eHis arms wrapped around me, and then he surprised me by lifting me up and back, so that I was sitting on his lap and my legs were draped over his.\u003c/p\u003e\n\u003cp\u003e\"Lean into me, angel,\" he murmured.\u003c/p\u003e\n\u003cp\u003e\"I need to feel you.\"\u003c/p\u003e\n\u003cp\u003eI sighed with pleasure, sinking into the hardness of his powerful body as he cradled me.\u003c/p\u003e\n\u003cp\u003eMy aching muscles softened in surrender, eager as always to become completely pliable to his touch.\u003c/p\u003e\n\u003cp\u003eI loved moments like this, when the world and our emotional triggers were far away.\u003c/p\u003e\n\u003cp\u003eMoments when I felt the love he wouldn\u0027t profess for me.\u003c/p\u003e\n\u003cp\u003e\"Soaking more bruises?\" he asked with his cheek pressed to mine.\u003c/p\u003e\n\u003cp\u003e\"My fault.\u003c/p\u003e\n\u003cp\u003eMy head wasn\u0027t in the game.\"\u003c/p\u003e\n\u003cp\u003e\"Thinking about me?\" he purred, nuzzling against my ear.\u003c/p\u003e\n\u003cp\u003e\"I wish.\"\u003c/p\u003e\n\u003cp\u003eHe paused, then switched gears.\u003c/p\u003e\n\u003cp\u003e\"Tell me what\u0027s bugging you.\"\u003c/p\u003e\n\u003cp\u003eI loved how easily he could read me, then revise and revisit his approach on the fly.\u003c/p\u003e\n\u003cp\u003eI tried to be as adaptable for him.\u003c/p\u003e\n\u003cp\u003eReally, flexibility was a requirement in a relationship between two high-maintenance people.\u003c/p\u003e\n\u003cp\u003eLinking my fingers with his, I told him about my mother\u0027s weird reaction after lunch.\u003c/p\u003e\n\u003cp\u003e\"I almost expected to turn around and see my dad or something.\u003c/p\u003e\n\u003cp\u003eI was wondering .\u003c/p\u003e\n\u003cp\u003eYou have security cameras that cover the front of the building, don\u0027t you?\" \"Of course.\u003c/p\u003e\n\u003cp\u003eI\u0027ll look into it.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a ten-minute window of time, max.\u003c/p\u003e\n\u003cp\u003eI just want to see if I can figure out what went on.\"\u003c/p\u003e\n\u003cp\u003e\"Consider it done.\"\u003c/p\u003e\n\u003cp\u003eI tilted my head back and kissed his jaw.\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eHis lips pressed to the top of my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Angel, there\u0027s nothing I wouldn\u0027t do for you.\"\u003c/p\u003e\n\u003cp\u003e\"Including talking about your past?\" I felt him tense and mentally kicked myself.\u003c/p\u003e\n\u003cp\u003e\"Not right this second,\" I hastened to add, \"but sometime.\u003c/p\u003e\n\u003cp\u003eJust tell me we\u0027ll get there.\"\u003c/p\u003e\n\u003cp\u003e\"Have lunch with me tomorrow.\u003c/p\u003e\n\u003cp\u003eIn my office.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to talk about it then?\" Gideon exhaled harshly.\u003c/p\u003e\n\u003cp\u003e\"Eva.\"\u003c/p\u003e\n\u003cp\u003eI turned my face away and released him, disappointed with his evasion.\u003c/p\u003e\n\u003cp\u003eReaching for the edges of the tub, I prepared to get out and away from the man who somehow made me feel more connected to another human being than I\u0027d ever been, yet impossibly distant as well.\u003c/p\u003e\n\u003cp\u003eBeing with him fucked with my head, made me doubt the very things I\u0027d been sure of just moments before.\u003c/p\u003e\n\u003cp\u003eRinse and repeat.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m done,\" I muttered, blowing out the nearest candle.\u003c/p\u003e\n\u003cp\u003eSmoke curled up and away, as intangible as my grasp on the man I loved.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m getting out.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eHe cupped my breasts, restraining me.\u003c/p\u003e\n\u003cp\u003eWater lapped around us, as agitated as I was.\u003c/p\u003e\n\u003cp\u003e\"Let go, Gideon.\"\u003c/p\u003e\n\u003cp\u003eI caught his wrists to pull his hands away.\u003c/p\u003e\n\u003cp\u003eHe buried his face in my neck, obstinately holding on.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll get there.\u003c/p\u003e\n\u003cp\u003eOkay? Just -\u0026nbsp; We\u0027ll get there.\"\u003c/p\u003e\n\u003cp\u003eI deflated, feeling little of the triumph I had hoped to feel when I\u0027d first asked and anticipated his answer.\u003c/p\u003e\n\u003cp\u003e\"Can we give it a rest tonight?\" he asked gruffly, still clinging tight.\u003c/p\u003e\n\u003cp\u003e\"Give it all a rest? I just want to be with you, all right? Order something in for dinner, watch TV, hold you when I sleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-19.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
