{"id":63454,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Arizona is where your business is?\" \"Unfortunately.\"\u003c/p\u003e\n\u003cp\u003eUh .\u003c/p\u003e\n\u003cp\u003eInstead of risking my shot at coffee, I postponed arguing and continued on to the kitchen.\u003c/p\u003e\n\u003cp\u003eI passed through Gideon\u0027s spacious apartment with its stunning prewar architecture and slender arched windows, my heels alternately clicking over gleaming hardwood and muffled by Aubusson rugs.\u003c/p\u003e\n\u003cp\u003eDecorated in dark woods and neutral fabrics, the luxurious space was brightened by jeweled accents.\u003c/p\u003e\n\u003cp\u003eAs much as his place screamed money, it managed to remain warm and welcoming, a comfortable place to relax and feel pampered.\u003c/p\u003e\n\u003cp\u003eWhen I reached the kitchen, I wasted no time in shoving a travel mug under the one-cup coffeemaker.\u003c/p\u003e\n\u003cp\u003eGideon joined me with his jacket draped over one arm and his cell phone in his hand.\u003c/p\u003e\n\u003cp\u003eI put another portable mug under the spout for him before I went to the fridge for some half-and-half.\u003c/p\u003e\n\u003cp\u003e\"It might be fortunate after all.\"\u003c/p\u003e\n\u003cp\u003eI faced him and reminded him of my roommate issue.\u003c/p\u003e\n\u003cp\u003e\"I need to knock heads with Cary this weekend.\"\u003c/p\u003e\n\u003cp\u003eGideon dropped his phone in the inner pocket of his jacket, then hung the garment off the back of one of the bar stools at the island.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re coming with me, Eva.\"\u003c/p\u003e\n\u003cp\u003eExhaling in a rush, I added half- and-half to my coffee.\u003c/p\u003e\n\u003cp\u003e\"To do what? Lie around naked, waiting for you to finish work and fuck me?\" His gaze held mine as he collected his mug and sipped his steaming coffee with too-calm deliberation.\u003c/p\u003e\n\u003cp\u003e\"Are we going to argue?\" \"Are you going to be difficult? We talked about this.\u003c/p\u003e\n\u003cp\u003eYou know I can\u0027t leave Cary after what happened last night.\"\u003c/p\u003e\n\u003cp\u003eThe multibody tangle I\u0027d found in my living room gave new meaning to the word clusterfuck.\u003c/p\u003e\n\u003cp\u003eI put the carton back in the fridge and absorbed the sensation of being drawn to him inexorably by the force of his will.\u003c/p\u003e\n\u003cp\u003eIt\u0027d been that way from the beginning.\u003c/p\u003e\n\u003cp\u003eWhen he chose to, Gideon could make me feel his demands.\u003c/p\u003e\n\u003cp\u003eAnd it was very, very difficult to ignore the part of me that begged to give him whatever he wanted.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to take care of business and I\u0027m going to take care of my best friend, then we\u0027ll go back to taking care of each other.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t be back until Sunday night, Eva.\"\u003c/p\u003e\n\u003cp\u003eOh .\u003c/p\u003e\n\u003cp\u003eI felt a sharp twinge in my belly at hearing we\u0027d be apart that long.\u003c/p\u003e\n\u003cp\u003eMost couples didn\u0027t spend every free moment together, but we weren\u0027t like most people.\u003c/p\u003e\n\u003cp\u003eWe both had hang- ups, insecurities, and an addiction to each other that required regular contact to keep us functioning properly.\u003c/p\u003e\n\u003cp\u003eI hated being apart from him.\u003c/p\u003e\n\u003cp\u003eI rarely went more than a couple of hours without thinking of him.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t stand the thought, either,\" he said quietly, studying me in that way he had that saw everything.\u003c/p\u003e\n\u003cp\u003e\"By Sunday we\u0027ll both be worthless.\"\u003c/p\u003e\n\u003cp\u003eI blew on the surface of my coffee, then took a quick sip.\u003c/p\u003e\n\u003cp\u003eI was unsettled at the thought of going the entire weekend without him.\u003c/p\u003e\n\u003cp\u003eWorse, I hated the thought of him spending that amount of time away from me.\u003c/p\u003e\n\u003cp\u003eHe had a world of choices and possibilities out there, women who weren\u0027t so screwed up and difficult to be with.\u003c/p\u003e\n\u003cp\u003eStill, I managed to say, \"We both know that\u0027s not exactly healthy, Gideon.\"\u003c/p\u003e\n\u003cp\u003e\"Says who? No one else knows what it\u0027s like to be us.\"\u003c/p\u003e\n\u003cp\u003eOkay, I\u0027d give him that.\u003c/p\u003e\n\u003cp\u003e\"We need to get to work,\" I said, knowing this impasse was going to drive both of us crazy all day.\u003c/p\u003e\n\u003cp\u003eWe\u0027d sort it out later, but for now we were stuck with it.\u003c/p\u003e\n\u003cp\u003eResting his hip against the counter, he crossed his ankles and stubbornly settled in.\u003c/p\u003e\n\u003cp\u003e\"What we need is for you to come with me.\"\u003c/p\u003e\n\u003cp\u003e\"Gideon.\"\u003c/p\u003e\n\u003cp\u003eMy foot began to tap against the travertine tile.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t just give up my life for you.\u003c/p\u003e\n\u003cp\u003eIf I turn into arm candy, you\u0027ll get bored real quick.\u003c/p\u003e\n\u003cp\u003eHell, I\u0027d get sick of myself.\u003c/p\u003e\n\u003cp\u003eIt shouldn\u0027t kill us to spend a couple days straightening out other parts of our lives, even if we hate doing it.\"\u003c/p\u003e\n\u003cp\u003eHis gaze captured mine.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re too much trouble to be arm candy.\"\u003c/p\u003e\n\u003cp\u003e\"Takes a troublemaker to know one.\"\u003c/p\u003e\n\u003cp\u003eGideon straightened, shrugging off his brooding sensuality and instantly capturing me with his severe intensity.\u003c/p\u003e\n\u003cp\u003eSo mercurial - like me.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve gotten a lot of press lately, Eva.\u003c/p\u003e\n\u003cp\u003eIt\u0027s no secret that you\u0027re in New York.\u003c/p\u003e\n\u003cp\u003eI can\u0027t leave you here while I\u0027m gone.\u003c/p\u003e\n\u003cp\u003eBring Cary with us if you have to.\u003c/p\u003e\n\u003cp\u003eYou can butt heads with him while you\u0027re waiting for me to finish work and fuck you.\"\u003c/p\u003e\n\u003cp\u003e\"Ha.\"\u003c/p\u003e\n\u003cp\u003eEven as I acknowledged his attempt to lighten the strain with humor, I realized what his real objection to being apart from me was\u0026nbsp; - Nathan.\u003c/p\u003e\n\u003cp\u003eMy former stepbrother.\u003c/p\u003e\n\u003cp\u003eThe living nightmare from my past that Gideon seemed to fear might reappear in my present.\u003c/p\u003e\n\u003cp\u003eIt frightened me to concede that he wasn\u0027t totally wrong.\u003c/p\u003e\n\u003cp\u003eThe shield of anonymity that had protected me for years had been shattered by our highly public relationship.\u003c/p\u003e\n\u003cp\u003eGod .\u003c/p\u003e\n\u003cp\u003ewe totally didn\u0027t have the time to get into that mess, but I knew it wasn\u0027t a point Gideon would concede on.\u003c/p\u003e\n\u003cp\u003eHe was a man who claimed his possessions utterly, fought off his competitors with ruthless precision, and would never allow any harm to come to me.\u003c/p\u003e\n\u003cp\u003eI was his safe place, which made me rare and invaluable to him.\u003c/p\u003e\n\u003cp\u003eGideon glanced at his watch.\u003c/p\u003e\n\u003cp\u003e\"Time to go, angel.\"\u003c/p\u003e\n\u003cp\u003eHe fetched his jacket, then gestured for me to precede him through his luxurious living room, where I grabbed my purse and the bag holding my walking shoes and other necessities.\u003c/p\u003e\n\u003cp\u003eA few moments later, we\u0027d finished the descent to the ground floor in his private elevator and slid into the back of his black Bentley SUV.\u003c/p\u003e\n\u003cp\u003e\"Hi, Angus,\" I greeted his driver, who touched the brim of his old- fashioned chauffeur\u0027s hat.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Miss Tramell,\" he replied, smiling.\u003c/p\u003e\n\u003cp\u003eHe was an older gentleman, with a liberal sprinkling of white in his red hair.\u003c/p\u003e\n\u003cp\u003eI liked him for a lot of reasons, not the least of which was the fact that he\u0027d been driving Gideon around since grade school and genuinely cared for him.\u003c/p\u003e\n\u003cp\u003eA quick glance at the Rolex my mother and stepfather had given me told me I\u0027d make it to work on time .\u003c/p\u003e\n\u003cp\u003eif we didn\u0027t get boxed in by traffic.\u003c/p\u003e\n\u003cp\u003eEven as I thought this, Angus slid deftly into the sea of taxis and cars on the street.\u003c/p\u003e\n\u003cp\u003eAfter the tense quiet of Gideon\u0027s apartment, the noise of Manhattan woke me as effectively as a jolt of caffeine.\u003c/p\u003e\n\u003cp\u003eThe blaring of horns and the thud of tires over a manhole cover invigorated me.\u003c/p\u003e\n\u003cp\u003eRapid-moving streams of pedestrians flanked both sides of the clogged street, while buildings stretched ambitiously toward the sky, keeping us in shadow even as the sun climbed.\u003c/p\u003e\n\u003cp\u003eGod, I seriously loved New York.\u003c/p\u003e\n\u003cp\u003eI took the time every day to absorb it, to try to draw it into me.\u003c/p\u003e\n\u003cp\u003eI settled into the leather seat back and reached for Gideon\u0027s hand, giving it a squeeze.\u003c/p\u003e\n\u003cp\u003e\"Would you feel better if Cary and I left town for the weekend? Maybe a quick trip to Vegas?\" Gideon\u0027s gaze narrowed.\u003c/p\u003e\n\u003cp\u003e\"Am I a threat to Cary? Is that why you won\u0027t consider Arizona?\" \"What? No.\u003c/p\u003e\n\u003cp\u003eI don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003eShifting in the seat, I faced him.\u003c/p\u003e\n\u003cp\u003e\"Sometimes it takes an all-nighter before I can get him to open up.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think so?\" he repeated my answer, ignoring everything but the first words out of my mouth.\u003c/p\u003e\n\u003cp\u003e\"He might feel like he can\u0027t reach out to me when he needs to talk because I\u0027m always with you,\" I clarified, steadying my mug with two hands as we drove over a pothole.\u003c/p\u003e\n\u003cp\u003e\"Listen, you\u0027re going to have to get over any jealousy about Cary.\u003c/p\u003e\n\u003cp\u003eWhen I say he\u0027s like a brother to me, Gideon, I\u0027m not kidding.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t have to like him, but you have to understand that he\u0027s a permanent part of my life.\"\u003c/p\u003e\n\u003cp\u003e\"Do you tell him the same thing about me?\" \"I don\u0027t have to.\u003c/p\u003e\n\u003cp\u003eHe knows.\u003c/p\u003e\n\u003cp\u003eI\u0027m trying to reach a compromise here - \" \"I never compromise.\"\u003c/p\u003e\n\u003cp\u003eMy brows rose.\u003c/p\u003e\n\u003cp\u003e\"In business, I\u0027m sure you don\u0027t.\u003c/p\u003e\n\u003cp\u003eBut this is a relationship, Gideon.\u003c/p\u003e\n\u003cp\u003eIt requires give and - \" Gideon\u0027s growl cut me off.\u003c/p\u003e\n\u003cp\u003e\"My plane, my hotel, and if you leave the premises you take a security team with you.\"\u003c/p\u003e\n\u003cp\u003eHis sudden, reluctant capitulation surprised me silent for a long minute.\u003c/p\u003e\n\u003cp\u003eLong enough for his brow to arch over those piercing blue eyes in a look that said take it or leave it.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you think that\u0027s a little extreme?\" I prodded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have Cary with me.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll forgive me if I don\u0027t trust him with your safety after last night.\"\u003c/p\u003e\n\u003cp\u003eAs he drank his coffee, his posture made it very clear that the conversation was done in his mind.\u003c/p\u003e\n\u003cp\u003eHe\u0027d given me his acceptable options.\u003c/p\u003e\n\u003cp\u003eI might\u0027ve gotten bitchy about that kind of high-handedness if I didn\u0027t understand that taking care of me was his motivation.\u003c/p\u003e\n\u003cp\u003eMy past had vicious skeletons, and dating Gideon had put me in a media spotlight that could bring Nathan Barker right to my door.\u003c/p\u003e\n\u003cp\u003ePlus, controlling everything around him was just part of who Gideon was.\u003c/p\u003e\n\u003cp\u003eIt came with the package and I had to make accommodations for that.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" I agreed.\u003c/p\u003e\n\u003cp\u003e\"Which hotel is yours?\" \"I have a few.\u003c/p\u003e\n\u003cp\u003eYou can take your pick.\"\u003c/p\u003e\n\u003cp\u003eHe turned his head to look out the window.\u003c/p\u003e\n\u003cp\u003e\"Scott will e-mail you the list.\u003c/p\u003e\n\u003cp\u003eWhen you\u0027ve decided, let him know and he\u0027ll make the arrangements.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll fly out together and return together.\"\u003c/p\u003e\n\u003cp\u003eLeaning my shoulder into the seat, I took a drink of my coffee and noted the way his hand was fisted on his thigh.\u003c/p\u003e\n\u003cp\u003eIn the tinted window\u0027s reflection, Gideon\u0027s face was impassive, but I could feel his moodiness.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" I murmured.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t.\u003c/p\u003e\n\u003cp\u003eI\u0027m not happy about this, Eva.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-2.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
