{"id":63475,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"How did you sleep?\" \"I missed you.\u003c/p\u003e\n\u003cp\u003eIs that coffee I smell for me?\" \"If you\u0027re good.\"\u003c/p\u003e\n\u003cp\u003eMy eyes popped open.\u003c/p\u003e\n\u003cp\u003e\"But you like me bad.\"\u003c/p\u003e\n\u003cp\u003eHis smile did crazy things to me.\u003c/p\u003e\n\u003cp\u003eHe\u0027d dressed already in one of his amazingly sexy suits and looked much better this morning than he had the night before.\u003c/p\u003e\n\u003cp\u003e\"I like you bad with me.\u003c/p\u003e\n\u003cp\u003eTell me about this concert on Friday.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a band called Six-Ninths.\u003c/p\u003e\n\u003cp\u003eThat\u0027s all I know.\u003c/p\u003e\n\u003cp\u003eWanna go?\" \"It\u0027s not a question of whether I want to go.\u003c/p\u003e\n\u003cp\u003eIf you\u0027re going, so am I.\"\u003c/p\u003e\n\u003cp\u003eMy brows rose.\u003c/p\u003e\n\u003cp\u003e\"Is that right? And what if I hadn\u0027t asked you?\" He reached for my hand and gently twirled my promise ring around my finger.\u003c/p\u003e\n\u003cp\u003e\"Then you wouldn\u0027t be going, either.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me?\" I shoved my hair back.\u003c/p\u003e\n\u003cp\u003eNoting the set look on his gorgeous face, I sat up.\u003c/p\u003e\n\u003cp\u003e\"Gimme that coffee.\u003c/p\u003e\n\u003cp\u003eI want to be caffeinated when I kick your ass.\"\u003c/p\u003e\n\u003cp\u003eGideon grinned and handed the mug over.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t look at me like that,\" I warned.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m seriously not happy with you telling me I can\u0027t go somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re talking specifically about a rock concert and I didn\u0027t say you couldn\u0027t go, just that you can\u0027t go without me.\u003c/p\u003e\n\u003cp\u003eI\u0027m sorry you don\u0027t like it, but it is what it is.\"\u003c/p\u003e\n\u003cp\u003e\"Who says it\u0027s rock? Maybe it\u0027s classical.\u003c/p\u003e\n\u003cp\u003eOr Celtic.\u003c/p\u003e\n\u003cp\u003eOr pop.\"\u003c/p\u003e\n\u003cp\u003e\"Six-Ninths signed with Vidal Records.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eVidal Records was run by Gideon\u0027s stepfather, Christopher Vidal Sr., but Gideon had controlling interest.\u003c/p\u003e\n\u003cp\u003eI wondered how a boy grew up to take over his stepfather\u0027s family business.\u003c/p\u003e\n\u003cp\u003eI figured whatever the reason was, it was also why Gideon\u0027s half brother, Christopher Jr., hated him to the extreme.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen videos of their indie shows,\" he said dryly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not risking you to a crowd like that.\"\u003c/p\u003e\n\u003cp\u003eI sucked down a big gulp of coffee.\u003c/p\u003e\n\u003cp\u003e\"I get it, but you can\u0027t order me around.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t I? Shh.\"\u003c/p\u003e\n\u003cp\u003eHe placed his fingers over my lips.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t argue.\u003c/p\u003e\n\u003cp\u003eI\u0027m not a tyrant.\u003c/p\u003e\n\u003cp\u003eI may occasionally have concerns, and you\u0027ll be sensible about acknowledging them.\"\u003c/p\u003e\n\u003cp\u003eI shoved his hand away.\u003c/p\u003e\n\u003cp\u003e\"\u0027Sensible\u0027 being whatever you\u0027ve decided is best?\" \"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s bullshit.\"\u003c/p\u003e\n\u003cp\u003eHe stood.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not going to fight over a hypothetical situation.\u003c/p\u003e\n\u003cp\u003eYou asked me to go to the concert with you on Friday and I said yes.\u003c/p\u003e\n\u003cp\u003eThere\u0027s nothing to argue about.\"\u003c/p\u003e\n\u003cp\u003eSetting my coffee on the nightstand, I kicked off the covers and slid out of bed.\u003c/p\u003e\n\u003cp\u003e\"I have to be able to live my life, Gideon.\u003c/p\u003e\n\u003cp\u003eI still have to be me or this won\u0027t work.\"\u003c/p\u003e\n\u003cp\u003e\"And I have to be me.\u003c/p\u003e\n\u003cp\u003eI\u0027m not the only one who needs to compromise.\"\u003c/p\u003e\n\u003cp\u003eThat hit me hard.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t wrong\u0026nbsp; - I had a right to expect him to give me my space, but he had a right to be understood as the man he was.\u003c/p\u003e\n\u003cp\u003eI had to make accommodations for the fact that he had triggers, too.\u003c/p\u003e\n\u003cp\u003e\"What if I want a girls\u0027 night out clubbing with my friends?\" He caught my jaw in both hands and kissed my forehead.\u003c/p\u003e\n\u003cp\u003e\"You can take the limo and stick to clubs I own.\"\u003c/p\u003e\n\u003cp\u003e\"So you can have your security people spy on me?\" \"Keep an eye on you,\" he corrected, his lips sliding over my brow.\u003c/p\u003e\n\u003cp\u003e\"Is that so terrible, angel? Is it so unforgivable that I hate taking my eyes off you?\" \"Don\u0027t twist this around.\"\u003c/p\u003e\n\u003cp\u003eHe tilted my head back and looked down at me with hard, determined eyes.\u003c/p\u003e\n\u003cp\u003e\"You need to understand that even if you take the limo and stick to my clubs, I\u0027m still going to go crazy until you get home.\u003c/p\u003e\n\u003cp\u003eIf that means you\u0027re driven a little crazy with my safety precautions, isn\u0027t that part of the give-and-take?\" I growled.\u003c/p\u003e\n\u003cp\u003e\"How do you make something unreasonable sound reasonable?\" \"It\u0027s a gift.\"\u003c/p\u003e\n\u003cp\u003eGrabbing his very fine, very taut ass in my hands, I squeezed.\u003c/p\u003e\n\u003cp\u003e\"I need more coffee to deal with your gift, ace.\"\u003c/p\u003e\n\u003cp\u003eIt had become somewhat of a Wednesday tradition for Mark, his partner Steven, and me to go out to lunch.\u003c/p\u003e\n\u003cp\u003eWhen Mark and I arrived at the little Italian restaurant he\u0027d chosen and found Shawna waiting with Steven, I was really touched.\u003c/p\u003e\n\u003cp\u003eMark and I had a very professional relationship, but somehow we\u0027d managed to make that personal and it meant a lot to me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so jealous of your tan,\" Shawna said, looking casual and cute in jeans, embellished tank top, and filmy scarf.\u003c/p\u003e\n\u003cp\u003e\"The sun just makes me red and gives me more freckles.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027ve got that beautiful hair to show for it,\" I pointed out, admiring the deep red hue.\u003c/p\u003e\n\u003cp\u003eSteven ran a hand through his hair, which was the exact same color as his sister\u0027s, and grinned.\u003c/p\u003e\n\u003cp\u003e\"The things one sacrifices to be hot.\"\u003c/p\u003e\n\u003cp\u003e\"How would you know?\" Shawna shoved at his shoulder with a laugh, an effort that didn\u0027t budge her brother even an inch.\u003c/p\u003e\n\u003cp\u003eWhere she was slender as a reed, Steven was big and strapping.\u003c/p\u003e\n\u003cp\u003eI knew from talking to Mark that his partner was very hands-on with his construction business, which explained both his size and the rugged condition of his hands.\u003c/p\u003e\n\u003cp\u003eWe entered the restaurant and were seated right away, thanks to the reservation I\u0027d made when Mark had invited me to lunch.\u003c/p\u003e\n\u003cp\u003eIt was a small establishment, but it had great charm.\u003c/p\u003e\n\u003cp\u003eSunlight poured in through the floor- to-ceiling windows and the aroma of the food was so tantalizing it made my mouth water.\u003c/p\u003e\n\u003cp\u003e\"I am so excited about Friday.\"\u003c/p\u003e\n\u003cp\u003eShawna\u0027s soft blue eyes were lit with anticipation.\u003c/p\u003e\n\u003cp\u003e\"Yeah, she\u0027ll take you,\" Steven told me dryly, \"and not her big brother.\"\u003c/p\u003e\n\u003cp\u003e\"Sooo not your scene,\" she shot back.\u003c/p\u003e\n\u003cp\u003e\"You hate crowds.\"\u003c/p\u003e\n\u003cp\u003e\"Just gotta establish some personal space, that\u0027s all.\"\u003c/p\u003e\n\u003cp\u003eShawna rolled her eyes.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t be a bruiser everywhere.\"\u003c/p\u003e\n\u003cp\u003eThe talk about crowds had me thinking of Gideon and his protective streak.\u003c/p\u003e\n\u003cp\u003e\"Mind if I bring the guy I\u0027m seeing?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Or is that a buzzkill?\" \"Not at all.\u003c/p\u003e\n\u003cp\u003eDoes he have a friend who\u0027d like to come?\" \"Shawna.\"\u003c/p\u003e\n\u003cp\u003eMark was clearly shocked.\u003c/p\u003e\n\u003cp\u003eAnd disapproving.\u003c/p\u003e\n\u003cp\u003e\"What about Doug?\" \"What about him? You didn\u0027t let me finish.\"\u003c/p\u003e\n\u003cp\u003eShe looked at me and explained, \"Doug\u0027s my boyfriend.\u003c/p\u003e\n\u003cp\u003eHe\u0027s in Sicily for the summer taking a culinary course.\u003c/p\u003e\n\u003cp\u003eHe\u0027s a chef.\"\u003c/p\u003e\n\u003cp\u003e\"Nice,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I dig guys who can cook.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah.\"\u003c/p\u003e\n\u003cp\u003eShe grinned, then aimed a glare at Mark.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a keeper and I know it, so if your guy has a friend who\u0027s fine with filling the empty seat with no possibility of a hookup, bring him along.\"\u003c/p\u003e\n\u003cp\u003eI immediately thought of Cary and grinned.\u003c/p\u003e\n\u003cp\u003eBut later that day, after Gideon and I had spent quality time with our personal trainers and had returned to his apartment for the night, I changed my mind.\u003c/p\u003e\n\u003cp\u003eI got up from the couch where I\u0027d been trying unsuccessfully to read a book and padded down the hall to his home office.\u003c/p\u003e\n\u003cp\u003eI found him frowning at whatever he was working on, his fingers flying over the keyboard.\u003c/p\u003e\n\u003cp\u003eThe glow of the monitor and the spotlight aimed at the photo collage on the wall were the only sources of illumination in the room, which left much of the large space in shadow.\u003c/p\u003e\n\u003cp\u003eHe sat in the semidark, bare- chested and beautiful, alone and powerfully self-contained.\u003c/p\u003e\n\u003cp\u003eAs he always did while working, he looked solitary and unreachable.\u003c/p\u003e\n\u003cp\u003eI felt lonely just looking at him.\u003c/p\u003e\n\u003cp\u003eThe combination of the physical distance caused by my period and Gideon\u0027s understandable decision to sleep separately stirred my deepest insecurities, made me want to cling tighter and try harder to keep his attention focused on me.\u003c/p\u003e\n\u003cp\u003eThat he was working instead of spending time with me shouldn\u0027t have rankled - I knew how busy he was -\u0026nbsp; but it did.\u003c/p\u003e\n\u003cp\u003eI felt abandoned and needy, which told me I was regressing into familiar bad patterns.\u003c/p\u003e\n\u003cp\u003eThe simple fact was, Gideon and I were the best and worst things that had ever happened to each other.\u003c/p\u003e\n\u003cp\u003eHe looked up and pinned me with his gaze.\u003c/p\u003e\n\u003cp\u003eI watched his focus shift from work to me.\u003c/p\u003e\n\u003cp\u003e\"Am I neglecting you, angel?\" he asked, leaning back in his chair.\u003c/p\u003e\n\u003cp\u003eI flushed, wishing he couldn\u0027t read me so well.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to interrupt.\"\u003c/p\u003e\n\u003cp\u003e\"You should always come to me when you need something.\"\u003c/p\u003e\n\u003cp\u003ePushing his keyboard drawer in, he patted the empty space on the desk in front of him and wheeled his chair back.\u003c/p\u003e\n\u003cp\u003e\"Come sit.\"\u003c/p\u003e\n\u003cp\u003eA thrill rushed through me.\u003c/p\u003e\n\u003cp\u003eI hurried over, making no effort to hide my eagerness.\u003c/p\u003e\n\u003cp\u003eI hopped onto the desk in front of him and smiled wide when he rolled his chair forward to fill the space between my legs.\u003c/p\u003e\n\u003cp\u003eDraping his arms over my thighs, he hugged me around the hips and said, \"I should\u0027ve explained that I\u0027m trying to clear my schedule so we can take off this weekend.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" I pushed my fingers through his hair.\u003c/p\u003e\n\u003cp\u003e\"I want you all to myself for a while.\u003c/p\u003e\n\u003cp\u003eAnd I really, really need to fuck you for a very long time.\u003c/p\u003e\n\u003cp\u003eMaybe the whole time.\"\u003c/p\u003e\n\u003cp\u003eHis eyes closed as I touched him.\u003c/p\u003e\n\u003cp\u003e\"I miss being inside you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re always inside me,\" I whispered.\u003c/p\u003e\n\u003cp\u003eHis mouth curved in a slow, wicked smile and his eyes opened.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re making me hard.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s new?\" \"Everything.\"\u003c/p\u003e\n\u003cp\u003eI frowned.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll get to that,\" he said.\u003c/p\u003e\n\u003cp\u003e\"For now, tell me what you came in here for.\"\u003c/p\u003e\n\u003cp\u003eI hesitated, still stuck on his cryptic comment.\u003c/p\u003e\n\u003cp\u003e\"Eva.\"\u003c/p\u003e\n\u003cp\u003eHis firm tone focused me. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-23.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
