{"id":63483,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe folded over my back, his cock lying within the seam of my ass.\u003c/p\u003e\n\u003cp\u003e\"Tell me why, Eva,\" he crooned in my ear.\u003c/p\u003e\n\u003cp\u003e\"You knew I\u0027d be coming after you .\u003c/p\u003e\n\u003cp\u003ethat I\u0027d find you .\"\u003c/p\u003e\n\u003cp\u003eMy eyes squeezed shut, my hands clenching into fists.\u003c/p\u003e\n\u003cp\u003e\"I.\u003c/p\u003e\n\u003cp\u003eDon\u0027t.\u003c/p\u003e\n\u003cp\u003eKnow.\u003c/p\u003e\n\u003cp\u003eDamn you! I don\u0027t fucking know!\" His fingers pulled free and then his cock was pushing into me.\u003c/p\u003e\n\u003cp\u003eMy sex spasmed around the delicious hardness, sucking him deeper.\u003c/p\u003e\n\u003cp\u003eI heard his breath catch on a muffled groan, and then he was taking me.\u003c/p\u003e\n\u003cp\u003eI cried with the pleasure of it, my entire body shivering with delight as he fucked me thoroughly, the wide head of his gorgeous penis rubbing and tugging at tender, hyperstimulated nerves.\u003c/p\u003e\n\u003cp\u003eThe pressure built and built, brewing like a storm .\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I gasped, stretched tight with anticipation.\u003c/p\u003e\n\u003cp\u003eHe pulled out at the first grasp of my sex and left me hanging on the precipice again.\u003c/p\u003e\n\u003cp\u003eI screamed with frustration, fighting to get up and away from the lover who\u0027d become the source of unbearable torment.\u003c/p\u003e\n\u003cp\u003eHe whispered in my ear like the devil himself.\u003c/p\u003e\n\u003cp\u003e\"Tell me why, Eva.\u003c/p\u003e\n\u003cp\u003eAre you thinking of him now? Are you wishing it were his cock inside you? Wishing it were his cock fucking your perfect little cunt?\" I screamed again.\u003c/p\u003e\n\u003cp\u003e\"I hate you! You\u0027re a sadistic, selfish son of a - \" He was in me again, filling me, stroking rhythmically into my quivering core.\u003c/p\u003e\n\u003cp\u003eUnable to stand it a minute longer, I struggled to reach my clit with my fingers, knowing a single stroke would have me coming violently.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eGideon caught my wrists and held my hands down on the seat, his thighs between my own, keeping my legs spread wide so he could sink deep.\u003c/p\u003e\n\u003cp\u003eOver and over.\u003c/p\u003e\n\u003cp\u003eThe tempo of his thrusts unfaltering and relentless.\u003c/p\u003e\n\u003cp\u003eI was thrashing, screaming, losing my mind.\u003c/p\u003e\n\u003cp\u003eHe could make me come with just his cock, giving me an intense vaginal orgasm just from riding me at the right angle, rubbing his thick crest over and over whatever spot I needed him to, a random place inside me he knew instinctively every time he had me.\"I hate you,\" I sobbed, tears of frustration wetting my face and the seat beneath my cheek.\u003c/p\u003e\n\u003cp\u003eBending over me, he gasped in my ear, \"Tell me why, Eva.\"\u003c/p\u003e\n\u003cp\u003eFury boiled up inside me and spewed out.\u003c/p\u003e\n\u003cp\u003e\"Because you deserved it! Because you should know what it feels like! How bad it hurts, you self- centered asshole!\" He stilled.\u003c/p\u003e\n\u003cp\u003eI felt his breath heave out of him.\u003c/p\u003e\n\u003cp\u003eMy blood was roaring in my ears, so loudly that at first I thought I was deliriously imagining his voice softening with tenderness.\u003c/p\u003e\n\u003cp\u003e\"Angel.\"\u003c/p\u003e\n\u003cp\u003eHis lips brushed over my shoulder blade, his hands releasing my wrists to slide beneath me and cup my full, heavy breasts.\u003c/p\u003e\n\u003cp\u003e\"My stubborn, beautiful angel.\u003c/p\u003e\n\u003cp\u003eFinally, we get to the truth.\"\u003c/p\u003e\n\u003cp\u003eGideon lifted me up, straightening me.\u003c/p\u003e\n\u003cp\u003eExhausted, my head lolled against his shoulder, my tears dripping onto my chest.\u003c/p\u003e\n\u003cp\u003eI had nothing left to fight with, barely able to whimper when he rolled an aching nipple between his fingertips and reached between my splayed legs.\u003c/p\u003e\n\u003cp\u003eHis hips began to lunge, his cock pumping upward into me as he pinched the lips of my sex around my throbbing clit and rubbed.\u003c/p\u003e\n\u003cp\u003eI came with a hoarse cry of his name, my entire body convulsing in fierce tremors as the relief exploded through me.\u003c/p\u003e\n\u003cp\u003eThe orgasm lasted forever and Gideon was tireless, extending my pleasure with the perfect thrusts I\u0027d been so frantic for earlier.\u003c/p\u003e\n\u003cp\u003eWhen I finally collapsed in his arms, panting and soaked with sweat, he lifted me carefully off him and placed me lengthwise on the bench seat.\u003c/p\u003e\n\u003cp\u003eShattered, I covered my face with my hands, incapable of stopping him when he pushed my thighs apart and put his mouth on me.\u003c/p\u003e\n\u003cp\u003eI was soaked with his semen and he didn\u0027t care, tonguing and suckling my clit until I came again.\u003c/p\u003e\n\u003cp\u003eAnd again.\u003c/p\u003e\n\u003cp\u003eMy back arched with each orgasm, my breath soughing from my lungs.\u003c/p\u003e\n\u003cp\u003eI lost track of how many times I climaxed after they began rolling into each other, cresting and waning like the tide.\u003c/p\u003e\n\u003cp\u003eI tried to curl away from him, but he just straightened and yanked his shirt off, climbing over me with one knee on the seat and the other leg extended to the floor.\u003c/p\u003e\n\u003cp\u003eHe placed his hands on the window above my head, putting his body on display as he\u0027d refused to do before.\u003c/p\u003e\n\u003cp\u003eI shoved at him.\u003c/p\u003e\n\u003cp\u003e\"No more! I can\u0027t take any more.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003eHis abs tightened as he slid into me, his eyes on my face as he pushed carefully through swollen tissues.\u003c/p\u003e\n\u003cp\u003e\"I just want to be inside you.\"\u003c/p\u003e\n\u003cp\u003eMy neck arched as he slid deeper, a low sound escaping me because it felt sooo good.\u003c/p\u003e\n\u003cp\u003eAs worn out and overstimulated as I was, I still craved to possess him and to be possessed by him.\u003c/p\u003e\n\u003cp\u003eI knew I always would.\u003c/p\u003e\n\u003cp\u003eBending his head, he pressed his lips to my forehead.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re all I want, Eva.\u003c/p\u003e\n\u003cp\u003eThere\u0027s no one else.\u003c/p\u003e\n\u003cp\u003eThere will never be anyone else.\"\u003c/p\u003e\n\u003cp\u003e\"Gideon.\"\u003c/p\u003e\n\u003cp\u003eHe understood, as I hadn\u0027t, that the night had fallen apart because of my jealousy and the deep- seated need I had to make him feel it for himself.\u003c/p\u003e\n\u003cp\u003eHe kissed me softly, reverently, erasing every memory of anyone else\u0027s lips on mine.\u003c/p\u003e\n\u003cp\u003e\"Angel.\"\u003c/p\u003e\n\u003cp\u003eGideon\u0027s voice was a warm rasp in my ear.\u003c/p\u003e\n\u003cp\u003e\"Wake up.\"\u003c/p\u003e\n\u003cp\u003eI moaned, squeezing my eyes shut tighter and burying my face deeper in his neck.\u003c/p\u003e\n\u003cp\u003e\"Leave me alone, you sex fiend.\"\u003c/p\u003e\n\u003cp\u003eHis silent laughter shook me.\u003c/p\u003e\n\u003cp\u003eHe pressed a hard kiss to my forehead and wiggled out from under me.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re here.\"\u003c/p\u003e\n\u003cp\u003eCracking one eye open, I watched him put his shirt back on.\u003c/p\u003e\n\u003cp\u003eHe\u0027d never gotten out of his jeans.\u003c/p\u003e\n\u003cp\u003eI realized the sun was out.\u003c/p\u003e\n\u003cp\u003eI sat up and looked out the windows, gasping when I saw the ocean.\u003c/p\u003e\n\u003cp\u003eWe\u0027d stopped for gas once but I hadn\u0027t been able to get my bearings or figure out where we were.\u003c/p\u003e\n\u003cp\u003eGideon had declined to tell me when I asked, saying only that it was a surprise.\u003c/p\u003e\n\u003cp\u003e\"Where are we?\" I breathed, thrilled by the sight of the sun climbing over the water.\u003c/p\u003e\n\u003cp\u003eIt had to be solidly into morning.\u003c/p\u003e\n\u003cp\u003eMaybe even midmorning.\u003c/p\u003e\n\u003cp\u003e\"North Carolina.\u003c/p\u003e\n\u003cp\u003eLift your arms.\"\u003c/p\u003e\n\u003cp\u003eI obeyed automatically, and he slid my tank top over my head.\u003c/p\u003e\n\u003cp\u003e\"I need my bra,\" I muttered, when I could see him again.\u003c/p\u003e\n\u003cp\u003e\"No one\u0027s here to see you but me and we\u0027re going straight into the bathtub.\"\u003c/p\u003e\n\u003cp\u003eI looked again at the weathered shingle-covered building we\u0027d parked beside.\u003c/p\u003e\n\u003cp\u003eIt was at least three stories, with wraparound decks and balconies on the front and sides, and a quaint single-door entrance off the back.\u003c/p\u003e\n\u003cp\u003eIt stood on stilts at the shoreline, so close to the water that I knew the tide must come up right beneath it.\u003c/p\u003e\n\u003cp\u003e\"How long have we been driving?\" \"Almost ten hours.\"\u003c/p\u003e\n\u003cp\u003eGideon slid my skirt up my legs and I stood, allowing him to twist it straight and pull up the zipper.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eHe got out first, then held his hand out for me.\u003c/p\u003e\n\u003cp\u003eThe bracing, salty breeze hit my face, waking me.\u003c/p\u003e\n\u003cp\u003eThe rhythmic surge of the ocean grounded me to the moment and where we were.\u003c/p\u003e\n\u003cp\u003eAngus was nowhere to be seen, which was a relief, since I was very aware of my lack of underwear.\u003c/p\u003e\n\u003cp\u003e\"Angus drove all night?\" \"We switched drivers when we stopped for gas.\"\u003c/p\u003e\n\u003cp\u003eI looked at Gideon and my pulse stuttered at the tender, haunted way he was looking at me.\u003c/p\u003e\n\u003cp\u003eA shadow of a bruise marred his jaw and I reached up to touch it, my chest aching when he nuzzled into my palm.\u003c/p\u003e\n\u003cp\u003e\"Are you hurt anywhere else?\" I asked, feeling so emotionally raw after the long night we\u0027d had.\u003c/p\u003e\n\u003cp\u003eHe caught my wrist and pulled my hand down to press flat over his heart.\u003c/p\u003e\n\u003cp\u003e\"Here.\"\u003c/p\u003e\n\u003cp\u003eMy love .\u003c/p\u003e\n\u003cp\u003eIt had been hard on him, too.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry.\"\u003c/p\u003e\n\u003cp\u003e\"So am I.\"\u003c/p\u003e\n\u003cp\u003eHe kissed my fingertips, then linked our hands and led me up to the house.\u003c/p\u003e\n\u003cp\u003eThe door was unlocked and he walked right in.\u003c/p\u003e\n\u003cp\u003eA wire mesh basket sat on a console just inside the door, holding a bottle of wine and two glasses tied with ribbon.\u003c/p\u003e\n\u003cp\u003eAs Gideon turned the deadbolt with a firm click, I plucked the Welcome envelope out and opened it.\u003c/p\u003e\n\u003cp\u003eA key fell into my palm.\u003c/p\u003e\n\u003cp\u003e\"We won\u0027t be needing that.\"\u003c/p\u003e\n\u003cp\u003eHe took the key from me and set it on the console.\u003c/p\u003e\n\u003cp\u003e\"For the next two days, we\u0027re going to be hermits together.\"\u003c/p\u003e\n\u003cp\u003eA hum of pleasure warmed me from the inside, followed by more than a little awe that a man like Gideon Cross could enjoy my company so much he didn\u0027t need anyone else.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" he said, tugging me toward the stairs.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll break into that wine later.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\u003c/p\u003e\n\u003cp\u003eCoffee first.\"\u003c/p\u003e\n\u003cp\u003eI took in the decor of the house.\u003c/p\u003e\n\u003cp\u003eIt was rustic on the outside and modern contemporary on the inside.\u003c/p\u003e\n\u003cp\u003eThe wainscoted walls were painted a bright white and decorated with massive black-and-white photos of seashells.\u003c/p\u003e\n\u003cp\u003eThe furniture was all white, and most of the accessory pieces were glass and metal.\u003c/p\u003e\n\u003cp\u003eIt would have been stark if not for the gorgeous view of the ocean and the color introduced in the area rugs covering the hardwood floors and the collection of hardcover books filling built-in bookcases.\u003c/p\u003e\n\u003cp\u003eWhen we reached the top floor, I felt a flutter of happiness.\u003c/p\u003e\n\u003cp\u003eThe master suite was a totally open space, with only two support columns to break it up.\u003c/p\u003e\n\u003cp\u003eBouquets of white roses, white tulips, and white calla lilies covered nearly every flat surface, and some even sat on the floor in strategic areas.\u003c/p\u003e\n\u003cp\u003eThe bed was massive and covered in white satin, which made me think of a bridal suite, an impression reinforced by the black-and-white photo of a filmy scarf or veil blowing in the breeze hanging over the headboard.\u003c/p\u003e\n\u003cp\u003eI looked at Gideon.\u003c/p\u003e\n\u003cp\u003e\"Have you been here before?\" He reached up and freed my now- lopsided ponytail.\u003c/p\u003e\n\u003cp\u003e\"No.\u003c/p\u003e\n\u003cp\u003eWhat reason would I have to come here?\" Right.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t take women anywhere but his hotel fuck pad - that he apparently still had. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-31.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
