{"id":63496,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI made it back to my desk.\u003c/p\u003e\n\u003cp\u003eI worked industriously for the rest of the day.\u003c/p\u003e\n\u003cp\u003eDuring my lunch break, I stayed in and looked up things to do with my dad.\u003c/p\u003e\n\u003cp\u003eI decided on three possibilities - the Empire State Building, the Statue of Liberty, and a Broadway play, with the trip to Ellis Island reserved for if he really had a desire to go.\u003c/p\u003e\n\u003cp\u003eOtherwise, I figured we could skip the ferry and just check her out from the shore.\u003c/p\u003e\n\u003cp\u003eHis time in the city was short, and I didn\u0027t want to overload it with a bunch of running around.\u003c/p\u003e\n\u003cp\u003eOn my last break of the day, I called Gideon\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"Hi, Scott,\" I greeted his secretary.\u003c/p\u003e\n\u003cp\u003e\"Is it possible for me to talk to your boss real quick?\" \"Hold on a minute and I\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003eI half-expected to have my call rejected, but a couple of minutes later I was put through.\u003c/p\u003e\n\u003cp\u003e\"Yes, Eva?\" I took the length of a heartbeat to savor the sound of his voice.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to bother you.\u003c/p\u003e\n\u003cp\u003eThis is probably a stupid question, considering, but .\u003c/p\u003e\n\u003cp\u003eare you coming to dinner tomorrow to meet my father?\" \"I\u0027ll be there,\" he said gruffly.\u003c/p\u003e\n\u003cp\u003e\"Are you bringing Ireland?\" I was surprised there wasn\u0027t a tremor in my voice, considering the overwhelming relief I felt.\u003c/p\u003e\n\u003cp\u003eThere was a pause.\u003c/p\u003e\n\u003cp\u003eThen, \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"I have a late meeting tonight, so I\u0027ll have to meet you at Dr.\u003c/p\u003e\n\u003cp\u003ePetersen\u0027s.\u003c/p\u003e\n\u003cp\u003eAngus will drive you over.\u003c/p\u003e\n\u003cp\u003eI\u0027ll grab a cab.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eI sagged into my seat, feeling a spark of hope.\u003c/p\u003e\n\u003cp\u003eContinuing therapy and meeting my dad could only be seen as positive signs.\u003c/p\u003e\n\u003cp\u003eGideon and I were struggling.\u003c/p\u003e\n\u003cp\u003eBut he hadn\u0027t given up yet.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see you then.\"\u003c/p\u003e\n\u003cp\u003eAngus dropped me off at Dr.\u003c/p\u003e\n\u003cp\u003ePetersen\u0027s office at a quarter to six.\u003c/p\u003e\n\u003cp\u003eI went inside and Dr.\u003c/p\u003e\n\u003cp\u003ePetersen waved at me through his open office door, rising from his seat behind his desk to shake my hand.\u003c/p\u003e\n\u003cp\u003e\"How are you, Eva?\" \"I\u0027ve been better.\"\u003c/p\u003e\n\u003cp\u003eHis gaze swept over my face.\u003c/p\u003e\n\u003cp\u003e\"You look tired.\"\u003c/p\u003e\n\u003cp\u003e\"So everyone keeps telling me,\" I said dryly.\u003c/p\u003e\n\u003cp\u003eHe looked over my shoulder.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Gideon?\" \"He had a late meeting, so he\u0027s coming separately.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eHe gestured at the sofa.\u003c/p\u003e\n\u003cp\u003e\"This is a nice opportunity for us to talk alone.\u003c/p\u003e\n\u003cp\u003eIs there anything in particular you\u0027d like to discuss before he arrives?\" I settled on the seat and spilled my guts, telling Dr.\u003c/p\u003e\n\u003cp\u003ePetersen about the amazing trip to the Outer Banks and then the bizarre, inexplicable week we\u0027d had since.\u003c/p\u003e\n\u003cp\u003e\"I just don\u0027t get it.\u003c/p\u003e\n\u003cp\u003eI feel like he\u0027s in trouble, but I can\u0027t get him to open up at all.\u003c/p\u003e\n\u003cp\u003eHe\u0027s completely cut me off emotionally.\u003c/p\u003e\n\u003cp\u003eHonestly, I\u0027m beginning to get whiplash.\u003c/p\u003e\n\u003cp\u003eI\u0027m also worried that his change in behavior is because of Corinne.\u003c/p\u003e\n\u003cp\u003eEvery time we\u0027ve hit one of these walls, it\u0027s because of her.\"\u003c/p\u003e\n\u003cp\u003eI looked at my fingers, which were twisted around each other.\u003c/p\u003e\n\u003cp\u003eThey reminded me of my mother\u0027s habit of twisting handkerchiefs, and I forced my hands to relax.\u003c/p\u003e\n\u003cp\u003e\"It almost seems like she\u0027s got some kind of hold on him and he can\u0027t break free of it, no matter how he feels about me.\"\u003c/p\u003e\n\u003cp\u003eDr.\u003c/p\u003e\n\u003cp\u003ePetersen looked up from his typing, studying me.\u003c/p\u003e\n\u003cp\u003e\"Did he tell you that he wasn\u0027t going to make his appointment on Tuesday?\" \"No.\"\u003c/p\u003e\n\u003cp\u003eThe news hit me hard.\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t say anything.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t tell me, either.\u003c/p\u003e\n\u003cp\u003eI wouldn\u0027t say that\u0027s typical behavior for him, would you?\" I shook my head.\u003c/p\u003e\n\u003cp\u003eDr.\u003c/p\u003e\n\u003cp\u003ePetersen crossed his hands in his lap.\u003c/p\u003e\n\u003cp\u003e\"At times, one or both of you will backtrack a bit.\u003c/p\u003e\n\u003cp\u003eThat\u0027s to be expected considering the nature of your relationship - you\u0027re not just working on you as a couple, but also as individuals so you can be a couple.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t deal with this, though.\"\u003c/p\u003e\n\u003cp\u003eI took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do this yo- yo thing.\u003c/p\u003e\n\u003cp\u003eIt\u0027s driving me insane.\u003c/p\u003e\n\u003cp\u003eThe letter I sent him .\u003c/p\u003e\n\u003cp\u003eIt was awful.\u003c/p\u003e\n\u003cp\u003eAll true, but awful.\u003c/p\u003e\n\u003cp\u003eWe\u0027ve had some really beautiful moments together.\u003c/p\u003e\n\u003cp\u003eHe\u0027s said some - \" I had to stop a minute, and when I continued, my voice was hoarse.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s said some w-wonderful things to me.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want to lose those memories in a bunch of ugly ones.\u003c/p\u003e\n\u003cp\u003eI keep debating whether I should quit while I\u0027m ahead, but I\u0027m hanging in here because I promised him - and myself - that I wouldn\u0027t run anymore.\u003c/p\u003e\n\u003cp\u003eThat I was going to dig my feet in and fight for this.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s something you\u0027re working on?\"\"Yes.\u003c/p\u003e\n\u003cp\u003eYes, it is.\u003c/p\u003e\n\u003cp\u003eAnd it\u0027s not easy.\u003c/p\u003e\n\u003cp\u003eBecause some of the things he does .\u003c/p\u003e\n\u003cp\u003eI react in ways I\u0027ve learned to avoid.\u003c/p\u003e\n\u003cp\u003eFor my own sanity! At some point you have to say you gave it your best shot and it didn\u0027t work out.\u003c/p\u003e\n\u003cp\u003eRight?\" Dr.\u003c/p\u003e\n\u003cp\u003ePetersen\u0027s head tilted to the side.\u003c/p\u003e\n\u003cp\u003e\"And if you don\u0027t, what\u0027s the worst that could happen?\" \"You\u0027re asking me?\" \"Yes.\u003c/p\u003e\n\u003cp\u003eWorst-case scenario.\"\u003c/p\u003e\n\u003cp\u003e\"Well .\"\u003c/p\u003e\n\u003cp\u003eI splayed my fingers on my thighs.\u003c/p\u003e\n\u003cp\u003e\"He keeps drifting away from me, which makes me cling harder and lose all sense of self-worth.\u003c/p\u003e\n\u003cp\u003eAnd we end up with him going back to life as he knew it and me going back to therapy trying to get my head on straight again.\"\u003c/p\u003e\n\u003cp\u003eHe continued to look at me, and something about his patient watchfulness prodded me to keep talking.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid that he won\u0027t cut me loose when it\u0027s time and that I won\u0027t know better.\u003c/p\u003e\n\u003cp\u003eThat I\u0027ll keep hanging on to the sinking ship and go down with it.\u003c/p\u003e\n\u003cp\u003eI just wish I could trust that he\u0027d end it, if it comes to that.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think that needs to happen?\" \"I don\u0027t know.\u003c/p\u003e\n\u003cp\u003eMaybe.\"\u003c/p\u003e\n\u003cp\u003eI pulled my gaze away from the clock on the wall.\u003c/p\u003e\n\u003cp\u003e\"But considering it\u0027s nearly seven and he stood us both up tonight, it seems likely.\"\u003c/p\u003e\n\u003cp\u003eIt was crazy to me that I wasn\u0027t surprised to find the Bentley waiting outside my apartment at quarter to five in the morning.\u003c/p\u003e\n\u003cp\u003eThe driver who climbed out from behind the wheel when I stepped outside wasn\u0027t familiar to me.\u003c/p\u003e\n\u003cp\u003eHe was much younger than Angus; early thirties was my guess.\u003c/p\u003e\n\u003cp\u003eHe looked Latino, with rich caramel-hued skin, and dark hair and eyes.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I told him, when he rounded the front of the vehicle, \"but I\u0027ll just grab a cab.\"\u003c/p\u003e\n\u003cp\u003eHearing that, the night doorman to my building stepped out to the street to flag one down for me.\u003c/p\u003e\n\u003cp\u003e\"Mr.\u003c/p\u003e\n\u003cp\u003eCross said I\u0027m to take you to La Guardia,\" the driver said.\u003c/p\u003e\n\u003cp\u003e\"You can tell Mr.\u003c/p\u003e\n\u003cp\u003eCross that I won\u0027t be requiring his transportation services now or in the future.\"\u003c/p\u003e\n\u003cp\u003eI moved toward the cab the doorman had hailed, but stopped and turned around.\u003c/p\u003e\n\u003cp\u003e\"And tell him to go fuck himself, too.\"\u003c/p\u003e\n\u003cp\u003eI slid into the cab and settled back as it pulled away.\u003c/p\u003e\n\u003cp\u003eI\u0027ll admit to some bias when I say my father stands out in a crowd, but that didn\u0027t make it less true.\u003c/p\u003e\n\u003cp\u003eAs he exited the secure security area, Victor Reyes commanded attention.\u003c/p\u003e\n\u003cp\u003eHe was six feet tall, fit and well built, and had the commanding presence of a man who wore a badge.\u003c/p\u003e\n\u003cp\u003eHis gaze raked the immediate area around him, always a cop even when he wasn\u0027t on duty.\u003c/p\u003e\n\u003cp\u003eHe had a duffel bag slung over his shoulder and wore blue jeans with a black button-down shirt.\u003c/p\u003e\n\u003cp\u003eHis hair was dark and wavy, his eyes stormy and gray like mine.\u003c/p\u003e\n\u003cp\u003eHe was seriously hot in a brooding, dangerous, bad boy sort of way, and I tried to picture him alongside my mother\u0027s fragile, haughty beauty.\u003c/p\u003e\n\u003cp\u003eI\u0027d never seen them together, not even in pictures, and I really wanted to.\u003c/p\u003e\n\u003cp\u003eIf only just once.\u003c/p\u003e\n\u003cp\u003e\"Daddy!\" I yelled, waving.\u003c/p\u003e\n\u003cp\u003eHis face lit up when he saw me, and a wide smile curved his mouth.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s my girl.\"\u003c/p\u003e\n\u003cp\u003eHe picked me up in a hug that had my feet dangling above the floor.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve missed you like crazy.\"\u003c/p\u003e\n\u003cp\u003eI started crying.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help it.\u003c/p\u003e\n\u003cp\u003eBeing with him again was the last emotional straw.\u003c/p\u003e\n\u003cp\u003e\"Hey.\"\u003c/p\u003e\n\u003cp\u003eHe rocked me.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s with the tears?\" I wrapped my arms tighter around his neck, so grateful to have him with me, knowing all the other troubles in my life would fade into the background while he was around.\u003c/p\u003e\n\u003cp\u003e\"I missed you like crazy, too,\" I said, sniffling.\u003c/p\u003e\n\u003cp\u003eWe took a cab back to my place.\u003c/p\u003e\n\u003cp\u003eOn the ride over, my dad asked me the same sort of investigative questions about Cary\u0027s attack as the detectives had asked Cary in the hospital.\u003c/p\u003e\n\u003cp\u003eI tried to keep him distracted with that discussion when we pulled up outside my building, but it didn\u0027t do any good.\u003c/p\u003e\n\u003cp\u003eMy dad\u0027s eagle eyes took in the modern glass overhang attached to the brick fa?ade of the building.\u003c/p\u003e\n\u003cp\u003eHe stared at the doorman, Paul, who touched the brim of his hat and opened the door for us.\u003c/p\u003e\n\u003cp\u003eHe studied the front desk and concierge, and rocked back on his heels as we waited for the elevator.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t say anything and kept his poker face on, but I knew he was thinking about how much my digs must cost in a city like New York.\u003c/p\u003e\n\u003cp\u003eWhen I showed him into my apartment, his sweeping gaze took in the size of the place.\u003c/p\u003e\n\u003cp\u003eThe massive windows had a stunning view of the city, and the flat- screen television mounted on the wall was just one of the many top-of-the- line electronics on display.\u003c/p\u003e\n\u003cp\u003eHe knew I couldn\u0027t afford the place on my own.\u003c/p\u003e\n\u003cp\u003eHe knew my mother\u0027s husband was providing for me in ways he would never be able to.\u003c/p\u003e\n\u003cp\u003eAnd I wondered if he thought about my mother, and how what she needed was also beyond his means.\u003c/p\u003e\n\u003cp\u003e\"The security here is really tight,\" I told him by way of explanation.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s impossible to get past the front desk if you\u0027re not on the list and a resident can\u0027t be reached to vouch for you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-44.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
