{"id":63497,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMy dad exhaled in a rush.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\u003c/p\u003e\n\u003cp\u003eI don\u0027t think Mom could sleep at night otherwise.\"\u003c/p\u003e\n\u003cp\u003eThat made some of the tension leave his shoulders.\u003c/p\u003e\n\u003cp\u003e\"Let me show you to your room.\"\u003c/p\u003e\n\u003cp\u003eI led him down the hallway to the guest room suite.\u003c/p\u003e\n\u003cp\u003eIt had its own bathroom and mini-bar with fridge.\u003c/p\u003e\n\u003cp\u003eI saw him noting those things before he dropped his duffel on the king-size bed.\u003c/p\u003e\n\u003cp\u003e\"Are you tired?\" He looked at me.\u003c/p\u003e\n\u003cp\u003e\"I know you are.\u003c/p\u003e\n\u003cp\u003eAnd you have to work today, don\u0027t you? Why don\u0027t we nap for a bit before you have to get up?\" I stifled a yawn and nodded, knowing I could use the couple of hours of shut-eye.\u003c/p\u003e\n\u003cp\u003e\"Sounds good.\"\u003c/p\u003e\n\u003cp\u003e\"Wake me when you\u0027re up,\" he said, rolling his shoulders back.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make the coffee while you\u0027re getting ready.\"\u003c/p\u003e\n\u003cp\u003e\"Awesome.\"\u003c/p\u003e\n\u003cp\u003eMy voice came husky with suppressed tears.\u003c/p\u003e\n\u003cp\u003eGideon almost always had coffee waiting for me on days when he\u0027d spent the night, because he got up before me.\u003c/p\u003e\n\u003cp\u003eI missed that little ritual of ours.\u003c/p\u003e\n\u003cp\u003eSomehow, I\u0027d have to learn to live without it.\u003c/p\u003e\n\u003cp\u003ePushing up onto my tiptoes, I kissed my dad\u0027s cheek.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so glad you\u0027re here, Daddy.\"\u003c/p\u003e\n\u003cp\u003eI closed my eyes and clung tightly when he hugged me.\u003c/p\u003e\n\u003cp\u003eI stepped out of the small market with my bags of grocery ingredients for dinner and frowned at finding Angus idling at the curb.\u003c/p\u003e\n\u003cp\u003eI\u0027d refused a ride in the morning and again when I\u0027d left the Crossfire, and he was still following and shadowing.\u003c/p\u003e\n\u003cp\u003eIt was ridiculous.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help but wonder if Gideon didn\u0027t want me as a girlfriend anymore, but his neurotic lust for my body meant that he didn\u0027t want anyone else to have me - namely Brett.\u003c/p\u003e\n\u003cp\u003eAs I walked home, I entertained thoughts of having Brett over for dinner instead, imagining Angus having to make that call to Gideon when Brett came strolling up to my place.\u003c/p\u003e\n\u003cp\u003eIt was just a quick vengeful fantasy, since I wouldn\u0027t lead Brett on that way and he was in Florida anyway, but it did the trick.\u003c/p\u003e\n\u003cp\u003eMy step lightened and when I entered my apartment, I was in my first really good mood in days.I dumped all the dinner stuff off in the kitchen, then went to find my dad.\u003c/p\u003e\n\u003cp\u003eHe was hanging out in Cary\u0027s room playing a video game.\u003c/p\u003e\n\u003cp\u003eCary worked a nunchuk one-handed, since his other hand was in a cast.\u003c/p\u003e\n\u003cp\u003e\"Woo!\" my dad shouted.\u003c/p\u003e\n\u003cp\u003e\"Spanked.\"\u003c/p\u003e\n\u003cp\u003e\"You should be ashamed of yourself,\" Cary shot back, \"taking advantage of an invalid.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m crying a river here.\"\u003c/p\u003e\n\u003cp\u003eCary looked at me in the doorway and winked.\u003c/p\u003e\n\u003cp\u003eI loved him so much in that moment I couldn\u0027t stop myself from crossing over to him and pressing a kiss to his bruised forehead.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" I whispered.\u003c/p\u003e\n\u003cp\u003e\"Thank me with dinner.\u003c/p\u003e\n\u003cp\u003eI\u0027m starving.\"\u003c/p\u003e\n\u003cp\u003eI straightened.\u003c/p\u003e\n\u003cp\u003e\"I got the goods to make enchiladas.\"\u003c/p\u003e\n\u003cp\u003eMy dad looked at me, smiling, knowing I\u0027d need his help.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" \"When you\u0027re ready,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to grab a shower.\"\u003c/p\u003e\n\u003cp\u003eForty-five minutes later, my dad and I were in the kitchen rolling cheese and store-bought rotisserie chicken -\u0026nbsp; my little cheat to save time - into lard- soaked white corn tortillas.\u003c/p\u003e\n\u003cp\u003eIn the living room, the CD changer slipped in the next disk and Van Morrison\u0027s soulful voice piped through the surround sound speakers.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah,\" my dad said, reaching for my hand and tugging me away from the counter.\u003c/p\u003e\n\u003cp\u003e\"Hum-de-rum, hum-de- rum, moondance,\" he sang in his deep baritone, twirling me.\u003c/p\u003e\n\u003cp\u003eI laughed, delighted.\u003c/p\u003e\n\u003cp\u003eUsing the back of his hand against my spine to keep his greasy fingers off me, he swept me into a dance around the island, both of us singing the song and laughing.\u003c/p\u003e\n\u003cp\u003eWe were making our second revolution when I noticed the two people standing at the breakfast bar.\u003c/p\u003e\n\u003cp\u003eMy smile fled and I stumbled, forcing my dad to catch me.\u003c/p\u003e\n\u003cp\u003e\"You got two left feet?\" he teased, his eyes only on me.\u003c/p\u003e\n\u003cp\u003e\"Eva\u0027s a wonderful dancer,\" Gideon interjected, his face arrested in that implacable mask I detested.\u003c/p\u003e\n\u003cp\u003eMy dad turned, his smile fading, too.Gideon rounded the bar and entered the kitchen.\u003c/p\u003e\n\u003cp\u003eHe\u0027d dressed for the occasion in jeans and a Yankees T- shirt.\u003c/p\u003e\n\u003cp\u003eIt was a suitably casual choice and a conversation starter, since my dad was a die-hard Padres fan.\u003c/p\u003e\n\u003cp\u003e\"I hadn\u0027t realized she was such a good singer, as well.\u003c/p\u003e\n\u003cp\u003eGideon Cross,\" he introduced himself, holding out his hand.\u003c/p\u003e\n\u003cp\u003e\"Victor Reyes.\"\u003c/p\u003e\n\u003cp\u003eMy dad waved his shiny fingers.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a bit messy.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind.\"\u003c/p\u003e\n\u003cp\u003eShrugging, my dad took his hand and sized him up.\u003c/p\u003e\n\u003cp\u003eI tossed the dish towel to the guys and made my way over to Ireland, who was positively glowing.\u003c/p\u003e\n\u003cp\u003eHer blue eyes were bright, her cheeks flushed with pleasure.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so glad you could make it,\" I said, hugging her carefully.\u003c/p\u003e\n\u003cp\u003e\"You look gorgeous!\" \"So do you!\" It was a fib, but I appreciated it anyway.\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t done anything to my face or hair after my shower, because I knew my dad wouldn\u0027t care and I hadn\u0027t expected Gideon to show up.\u003c/p\u003e\n\u003cp\u003eAfter all, the last time I\u0027d heard from him had been when he\u0027d said he would meet me at Dr.\u003c/p\u003e\n\u003cp\u003ePetersen\u0027s office.\u003c/p\u003e\n\u003cp\u003eShe looked over at the counter where I\u0027d dumped everything.\u003c/p\u003e\n\u003cp\u003e\"Can I help?\" \"Sure.\u003c/p\u003e\n\u003cp\u003eJust don\u0027t count calories in your head - it\u0027ll explode.\"\u003c/p\u003e\n\u003cp\u003eI introduced her to my dad, who was much warmer to her than he was to Gideon, and then I led her to the sink, where she washed up.\u003c/p\u003e\n\u003cp\u003eIn short order, I had her helping to roll the last few enchiladas, while my dad put the already chilled Dos Equis Gideon had brought into the fridge.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t even bother to wonder how Gideon knew I was serving Mexican food for dinner.\u003c/p\u003e\n\u003cp\u003eI only wondered why he\u0027d invest the time to find out when it was very clear he other things to do -\u0026nbsp; like ditch his appointments.\u003c/p\u003e\n\u003cp\u003eMy dad went to his room to wash up.\u003c/p\u003e\n\u003cp\u003eGideon came up behind me and put his hands on my waist, his lips brushing over my temple.\u003c/p\u003e\n\u003cp\u003e\"Eva.\"\u003c/p\u003e\n\u003cp\u003eI tensed against the nearly irresistible urge to lean into him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t,\" I whispered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather we didn\u0027t pretend.\"\u003c/p\u003e\n\u003cp\u003eHis breath left him in a rush that ruffled my hair.\u003c/p\u003e\n\u003cp\u003eHis fingers tightened on my hips, kneading for a moment.\u003c/p\u003e\n\u003cp\u003eThen I felt his phone vibrate and he released me, backing away to look at the screen.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" he said gruffly, leaving the kitchen before answering.\u003c/p\u003e\n\u003cp\u003eIreland sidled over and whispered, \"Thank you.\u003c/p\u003e\n\u003cp\u003eI know you made him bring me along.\"\u003c/p\u003e\n\u003cp\u003eI managed a smile for her.\u003c/p\u003e\n\u003cp\u003e\"Nobody can make Gideon do anything he doesn\u0027t want to.\"\u003c/p\u003e\n\u003cp\u003e\"You could.\"\u003c/p\u003e\n\u003cp\u003eShe tossed her head, throwing her sleek waist-length black hair over her shoulder.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t see him watching you dance with your dad.\u003c/p\u003e\n\u003cp\u003eHis eyes got all shiny.\u003c/p\u003e\n\u003cp\u003eI thought he was going to cry.\u003c/p\u003e\n\u003cp\u003eAnd on the way up here, in the elevator, he tried to play it off, but I could totally tell he was nervous.\"\u003c/p\u003e\n\u003cp\u003eI stared down at the can of enchilada sauce in my hands, feeling my heart break a little more.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re mad at him, aren\u0027t you?\" Ireland asked.\u003c/p\u003e\n\u003cp\u003eI cleared my throat.\u003c/p\u003e\n\u003cp\u003e\"Some people are just better off as friends.\"\u003c/p\u003e\n\u003cp\u003e\"But you said you love him.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not always enough.\"\u003c/p\u003e\n\u003cp\u003eI turned around to reach the can opener and found Gideon standing at the other end of the island, staring at me.\u003c/p\u003e\n\u003cp\u003eI froze.\u003c/p\u003e\n\u003cp\u003eA muscle in his jaw twitched before he unclenched it.\u003c/p\u003e\n\u003cp\u003e\"Would you like a beer?\" he asked gruffly.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eI could\u0027ve used a shot, too.\u003c/p\u003e\n\u003cp\u003eMaybe a few.\u003c/p\u003e\n\u003cp\u003e\"Want a glass?\" \"No.\"\u003c/p\u003e\n\u003cp\u003eHe looked at Ireland.\u003c/p\u003e\n\u003cp\u003e\"You thirsty? There\u0027s soda, water, milk.\"\u003c/p\u003e\n\u003cp\u003e\"How about one of those beers?\" she shot back, flashing a winsome smile.\u003c/p\u003e\n\u003cp\u003e\"Try again,\" he said wryly.\u003c/p\u003e\n\u003cp\u003eI watched Ireland, noting how she sparkled when Gideon focused on her.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t believe he didn\u0027t see how she loved him.\u003c/p\u003e\n\u003cp\u003eMaybe right now it was based on superficial things, but it was there and it would grow with a little encouragement.\u003c/p\u003e\n\u003cp\u003eI hoped he\u0027d work on that.When Gideon handed me the chilled beer, his fingers brushed mine.\u003c/p\u003e\n\u003cp\u003eHe held on for a minute, looking into my eyes.\u003c/p\u003e\n\u003cp\u003eI knew he was thinking about the other night.\u003c/p\u003e\n\u003cp\u003eIt seemed like a dream now, as if his visit never really happened.\u003c/p\u003e\n\u003cp\u003eI could almost believe that I\u0027d made it up in a desperate delusion, so hungry for his touch and his love that I couldn\u0027t go another minute without giving my mind relief from the madness of wanting and craving.\u003c/p\u003e\n\u003cp\u003eIf it weren\u0027t for the lingering soreness deep inside me, I wouldn\u0027t know what was real and what was nothing but false hope.\u003c/p\u003e\n\u003cp\u003eI pulled the beer out of his grasp and turned away.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t want to say we were done and over, but it was certain now that we needed a break from each other.\u003c/p\u003e\n\u003cp\u003eGideon needed to figure out what he was doing, what he was looking for, and whether I had any meaningful place in his life.\u003c/p\u003e\n\u003cp\u003eBecause this roller-coaster ride we were on was going to break me, and I couldn\u0027t let that happen.\u003c/p\u003e\n\u003cp\u003eI wouldn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"Can I help with anything?\" he asked.\u003c/p\u003e\n\u003cp\u003eI answered without looking at him, because doing so was too painful.\u003c/p\u003e\n\u003cp\u003e\"Can you see if we can get Cary out here? He\u0027s got a wheelchair.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eHe left the room, and I could suddenly breathe deeply again.\u003c/p\u003e\n\u003cp\u003eIreland hurried over.\u003c/p\u003e\n\u003cp\u003e\"What happened to Cary?\" \"I\u0027ll tell you about it while we set the table.\"\u003c/p\u003e\n\u003cp\u003eI was surprised I could eat.\u003c/p\u003e\n\u003cp\u003eI think I was too fascinated by the silent showdown between my dad and Gideon to notice that I was stuffing food into my mouth.\u003c/p\u003e\n\u003cp\u003eAt one end of the table, Cary was charming Ireland into peals of laughter that kept making me smile. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-45.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
