{"id":63500,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eVery pretty.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t been able to wear it, because I can\u0027t think of anything I have to go with it.\u003c/p\u003e\n\u003cp\u003eCan you help me find something?\" \"Eva,\" she said, exasperated.\u003c/p\u003e\n\u003cp\u003e\"You should\u0027ve established a personal style by now - and it shouldn\u0027t be sweats!\" \"Help me out, Mom.\u003c/p\u003e\n\u003cp\u003eI\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eI took my coffee mug with me to have a purpose for leaving her.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t go anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"Where would I go?\" she replied, her voice muffled because she\u0027d stepped deeper into my walk-in closet.\u003c/p\u003e\n\u003cp\u003eI did a quick check of the living room and kitchen.\u003c/p\u003e\n\u003cp\u003eMy dad was nowhere to be seen and his bedroom door was closed, as was Cary\u0027s.\u003c/p\u003e\n\u003cp\u003eI hurried back into my room.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s this?\" she asked, holding up a champagne-hued silk blouse.\u003c/p\u003e\n\u003cp\u003eThe combination was gorgeous and classy.\u003c/p\u003e\n\u003cp\u003e\"I love it! You rock! Thank you.\u003c/p\u003e\n\u003cp\u003eBut I\u0027m sure you have to go now, right? I don\u0027t want to hold you up.\"\u003c/p\u003e\n\u003cp\u003eMy mom frowned at me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not in a hurry.\"\u003c/p\u003e\n\u003cp\u003e\"What about Stanton? This has got to be weighing on his mind.\u003c/p\u003e\n\u003cp\u003eAnd it\u0027s a Saturday - he always reserves his weekends for you.\u003c/p\u003e\n\u003cp\u003eHe needs to have the time with you.\"\u003c/p\u003e\n\u003cp\u003eAnd God, did I feel awful for his stress.\u003c/p\u003e\n\u003cp\u003eStanton had spent a great deal of his time and money on issues pertaining to me and Nathan over the four years he\u0027d been married to my mother.\u003c/p\u003e\n\u003cp\u003eIt was too much to ask of anyone, but he\u0027d come through for us.\u003c/p\u003e\n\u003cp\u003eFor the rest of my life, I would owe him for loving my mother so much.\u003c/p\u003e\n\u003cp\u003e\"This is weighing on your mind, too,\" she argued.\u003c/p\u003e\n\u003cp\u003e\"I want to be here for you, Eva.\u003c/p\u003e\n\u003cp\u003eI want to support you.\"\u003c/p\u003e\n\u003cp\u003eMy throat tightened, understanding that she was trying to make amends for what had happened to me because she was unable to forgive herself.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" I said hoarsely.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be okay.\u003c/p\u003e\n\u003cp\u003eAnd honestly, I\u0027d feel terrible keeping you away from Stanton after all he\u0027s done for us.\u003c/p\u003e\n\u003cp\u003eYou\u0027re his reward, his little piece of heaven at the end of an endless workweek.\"\u003c/p\u003e\n\u003cp\u003eHer lips curved in an enchanting smile.\u003c/p\u003e\n\u003cp\u003e\"What a lovely thing to say.\"\u003c/p\u003e\n\u003cp\u003eYes, I\u0027d thought so, too, the times Gideon had said similar things to me.\u003c/p\u003e\n\u003cp\u003eIt seemed impossible that only a week before, we\u0027d been at the beach house, madly in love and taking firm, sure steps forward in our relationship.\u003c/p\u003e\n\u003cp\u003eBut now that relationship was broken, and now I knew why.\u003c/p\u003e\n\u003cp\u003eI was angry and hurt that Gideon had kept something as monumental as Nathan being in New York hidden from me.\u003c/p\u003e\n\u003cp\u003eI was furious that he hadn\u0027t talked to me about what he was thinking and feeling.\u003c/p\u003e\n\u003cp\u003eBut I understood, too.\u003c/p\u003e\n\u003cp\u003eHe was a man who\u0027d avoided talking about anything personal for years and years, and we hadn\u0027t been together long enough for that lifetime habit to change.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t blame him for being who he was, just as I couldn\u0027t blame him for deciding that he couldn\u0027t live with what I was.\u003c/p\u003e\n\u003cp\u003eWith a sigh, I went to my mom and hugged her.\u003c/p\u003e\n\u003cp\u003e\"Having you here .\u003c/p\u003e\n\u003cp\u003eit\u0027s what I needed, Mama.\u003c/p\u003e\n\u003cp\u003eCrying and laughing and just sitting with you.\u003c/p\u003e\n\u003cp\u003eNothing could be more perfect than that.\u003c/p\u003e\n\u003cp\u003eThank you.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" She hugged me tightly, feeling so small and delicate in my arms, even though we were the same size and her heels made her taller.\u003c/p\u003e\n\u003cp\u003e\"I thought you were going crazy.\"\u003c/p\u003e\n\u003cp\u003eI pulled back and smiled.\u003c/p\u003e\n\u003cp\u003e\"I think I did for a little bit, but you brought me back.\u003c/p\u003e\n\u003cp\u003eAnd Stanton is a good man.\u003c/p\u003e\n\u003cp\u003eI\u0027m grateful for all he\u0027s done for us.\u003c/p\u003e\n\u003cp\u003ePlease tell him I said so.\"\u003c/p\u003e\n\u003cp\u003eLinking my arm with hers, I grabbed her clutch from my bed and led her to the front door.\u003c/p\u003e\n\u003cp\u003eShe hugged me again, her hands stroking up and down my back.\u003c/p\u003e\n\u003cp\u003e\"Call me tonight and tomorrow.\u003c/p\u003e\n\u003cp\u003eI want to make sure you\u0027re doing okay.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eShe studied me.\u003c/p\u003e\n\u003cp\u003e\"And let\u0027s plan on a spa day next week.\u003c/p\u003e\n\u003cp\u003eIf the doctor doesn\u0027t approve of Cary going, we\u0027ll have the technicians come here.\u003c/p\u003e\n\u003cp\u003eI think we could all use a little pampering and polish right now.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a really nice way of saying I look like shit.\"\u003c/p\u003e\n\u003cp\u003eWe were both rough around the edges, although she hid it much better than I did.\u003c/p\u003e\n\u003cp\u003eNathan was still hanging over us like a dark cloud, still capable of ruining lives and destroying our peace.\u003c/p\u003e\n\u003cp\u003eBut we\u0027d pretend that we were better off than we were.\u003c/p\u003e\n\u003cp\u003eThat was just the way we did things.\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re right - it\u0027ll be good for us and it\u0027ll make Cary feel a whole lot better, even if he can only get a mani and pedi.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make the arrangements.\u003c/p\u003e\n\u003cp\u003eI can\u0027t wait!\" My mother flashed her signature megawatt smile -\u0026nbsp;\u0026nbsp; - which is what my dad was hit with when I opened the front door.\u003c/p\u003e\n\u003cp\u003eHe stood on the threshold with Cary\u0027s keys in his hand, having been caught just about to slide one into the lock.\u003c/p\u003e\n\u003cp\u003eHe was dressed in running shorts and athletic shoes, his sweat-soaked shirt tossed carelessly over his shoulder.\u003c/p\u003e\n\u003cp\u003eStill breathing a little quickly and glistening with sweat over tanned skin and rippling muscles, Victor Reyes was one hot hunk of a man.\u003c/p\u003e\n\u003cp\u003eAnd he was staring at my mom in a way that was totally indecent.\u003c/p\u003e\n\u003cp\u003eTearing my gaze away from my seriously smokin\u0027 dad to look at my glamorous mother, I was shocked to see her looking at my father the same way he was looking at her.\u003c/p\u003e\n\u003cp\u003eOf all the times to realize my parents were in love with each other.\u003c/p\u003e\n\u003cp\u003eWell, I\u0027d suspected my dad was heartbroken over my mom, but I thought she\u0027d been embarrassed about him, as if he were a big mistake and error in judgment in her past.\u003c/p\u003e\n\u003cp\u003e\"Monica.\"\u003c/p\u003e\n\u003cp\u003eMy dad\u0027s voice was lower and deeper than I\u0027d ever heard it, and more obviously flavored with an accent.\u003c/p\u003e\n\u003cp\u003e\"Victor.\"\u003c/p\u003e\n\u003cp\u003eMy mom was breathless.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" One of his brows rose.\u003c/p\u003e\n\u003cp\u003e\"Visiting our daughter.\"\u003c/p\u003e\n\u003cp\u003e\"And now Mom has to go,\" I prodded, torn between the novelty of seeing my parents together and a loyalty to Stanton, who was exactly what my mother needed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll call you later, Mom.\"\u003c/p\u003e\n\u003cp\u003eMy dad didn\u0027t move for a moment, his gaze sliding down the length of my mom from head to toe, then gliding back up again.\u003c/p\u003e\n\u003cp\u003eThen he took a deep breath and stepped aside.\u003c/p\u003e\n\u003cp\u003eMy mom stepped out into the hallway and turned toward the elevator, and then at the last minute she turned back.\u003c/p\u003e\n\u003cp\u003eShe placed her palm over my dad\u0027s heart and lifted onto her tiptoes, kissing one of his cheeks and then the other.\u003c/p\u003e\n\u003cp\u003e\"Good-bye,\" she breathed.\u003c/p\u003e\n\u003cp\u003eI watched her walk unsteadily to the elevator and push the button, her back to us.\u003c/p\u003e\n\u003cp\u003eMy dad didn\u0027t look away until the car doors closed behind her.\u003c/p\u003e\n\u003cp\u003eHe exhaled in a rush and came into my apartment.\u003c/p\u003e\n\u003cp\u003eI shut the door.\u003c/p\u003e\n\u003cp\u003e\"How is it that I didn\u0027t know you two are crazy in love with each other?\" The look in his eyes was painful to witness.\u003c/p\u003e\n\u003cp\u003eThe raw agony was like an open wound.\u003c/p\u003e\n\u003cp\u003e\"Because it doesn\u0027t mean anything.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe that.\u003c/p\u003e\n\u003cp\u003eLove means everything.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t conquer all like they say.\"\u003c/p\u003e\n\u003cp\u003eHe snorted.\u003c/p\u003e\n\u003cp\u003e\"Can you see your mother being a cop\u0027s wife?\" I winced.\u003c/p\u003e\n\u003cp\u003e\"Right,\" he said dryly, wiping his forehead with his shirt.\u003c/p\u003e\n\u003cp\u003e\"Sometimes love isn\u0027t enough.\u003c/p\u003e\n\u003cp\u003eAnd if it\u0027s not enough, what good is it?\" The bitterness I heard in his words was something I knew very well myself.\u003c/p\u003e\n\u003cp\u003eI passed him and went into the kitchen.\u003c/p\u003e\n\u003cp\u003eMy dad followed me.\u003c/p\u003e\n\u003cp\u003e\"Are you in love with Gideon Cross?\" \"Isn\u0027t it obvious?\" \"Is he in love with you?\" Because I just didn\u0027t have the energy, I dumped my mug in the sink and pulled out new ones for me and my dad.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\u003c/p\u003e\n\u003cp\u003eI know he wants me, and sometimes he needs me.\u003c/p\u003e\n\u003cp\u003eI think he\u0027d do anything he could for me if I asked, because I\u0027ve gotten under his skin a bit.\"\u003c/p\u003e\n\u003cp\u003eBut he couldn\u0027t tell me that he loved me.\u003c/p\u003e\n\u003cp\u003eHe wouldn\u0027t tell me about his past.\u003c/p\u003e\n\u003cp\u003eAnd he couldn\u0027t, apparently, live with the evidence of my past.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a good head on your shoulders.\"\u003c/p\u003e\n\u003cp\u003eI pulled coffee beans out of the freezer to make a fresh pot.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s seriously debatable, Dad.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re honest with yourself.\u003c/p\u003e\n\u003cp\u003eThat\u0027s a good trait to have.\"\u003c/p\u003e\n\u003cp\u003eHe gave me a tight smile when I looked over my shoulder at him.\u003c/p\u003e\n\u003cp\u003e\"I used your tablet earlier to check my e-mail.\u003c/p\u003e\n\u003cp\u003eIt was on the coffee table.\u003c/p\u003e\n\u003cp\u003eI hope you don\u0027t mind.\"\u003c/p\u003e\n\u003cp\u003eI shook my head.\u003c/p\u003e\n\u003cp\u003e\"Help yourself.\"\u003c/p\u003e\n\u003cp\u003e\"I surfed the Internet while I was on there.\u003c/p\u003e\n\u003cp\u003eWanted to see what popped up about Cross.\"\u003c/p\u003e\n\u003cp\u003eMy heart sank a little.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t like him.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m withholding judgment.\"\u003c/p\u003e\n\u003cp\u003eMy dad\u0027s voice faded as he moved into the living room, then strengthened again as he returned with my tablet in hand.\u003c/p\u003e\n\u003cp\u003eAs I ground the beans, he flipped open the tablet\u0027s protective case and started tapping at the screen.\u003c/p\u003e\n\u003cp\u003e\"I had a hard time getting a bead on him last night.\u003c/p\u003e\n\u003cp\u003eI just wanted a little more information.\u003c/p\u003e\n\u003cp\u003eI found some pictures of the two of you together that looked promising.\"\u003c/p\u003e\n\u003cp\u003eHe gaze was on the screen.\u003c/p\u003e\n\u003cp\u003e\"Then I found something else.\"\u003c/p\u003e\n\u003cp\u003eHe turned the tablet around to face me.\u003c/p\u003e\n\u003cp\u003e\"Can you explain this to me? Is this another sister of his?\" Leaving the ground coffee to sit, I moved closer, my eyes on the article my dad had found on Page Six.\u003c/p\u003e\n\u003cp\u003eThe picture was of Gideon and Corinne at some sort of cocktail party.\u003c/p\u003e\n\u003cp\u003eHe had his arm around her waist, and their body language was familiar and intimate.\u003c/p\u003e\n\u003cp\u003eHe was very close to her, his lips nearly touching her temple.\u003c/p\u003e\n\u003cp\u003eShe had a drink in her hand and was laughing.\u003c/p\u003e\n\u003cp\u003eI picked up the tablet and read the caption: Gideon Cross, CEO of Cross Industries, and Corinne Giroux at the Kingsman Vodka publicity mixer. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-48.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
