{"id":63457,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMonica Tramell Barker Mitchell Stanton was very, very good at being a trophy wife.\u003c/p\u003e\n\u003cp\u003eShe knew precisely what was expected of her and delivered without fail.\u003c/p\u003e\n\u003cp\u003eAlthough she\u0027d been divorced twice, both times had been by her choice and both divorces had left her exes despondent over losing her.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t think less of my mother, because she gave as good as she got and didn\u0027t take anyone for granted, but I\u0027d grown up striving for independence.\u003c/p\u003e\n\u003cp\u003eMy right to say no was my most valued possession.\u003c/p\u003e\n\u003cp\u003eMinimizing my e-mail window, I pushed my personal life aside and went back to searching for market comparisons on fruity coffee.\u003c/p\u003e\n\u003cp\u003eI coordinated some initial meetings between the strategists and Mark and helped Mark with brainstorming a campaign for a gluten-free restaurant.\u003c/p\u003e\n\u003cp\u003eNoon approached and I was starting to feel seriously hungry when my phone rang.\u003c/p\u003e\n\u003cp\u003eI answered with my usual greeting.\u003c/p\u003e\n\u003cp\u003e\"Eva?\" an accented female voice greeted me.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Magdalene.\u003c/p\u003e\n\u003cp\u003eDo you have a minute?\" I leaned back in my chair, alert.\u003c/p\u003e\n\u003cp\u003eMagdalene and I had once shared a moment of sympathy over Corinne\u0027s unexpected and unwanted reappearance in Gideon\u0027s life, but I\u0027d never forget how vicious Magdalene had been to me the first time we\u0027d met.\u003c/p\u003e\n\u003cp\u003e\"Just.\u003c/p\u003e\n\u003cp\u003eWhat\u0027s up?\"She sighed, then spoke quickly, her words flowing in a rush.\u003c/p\u003e\n\u003cp\u003e\"I was sitting at the table behind Corinne last night.\u003c/p\u003e\n\u003cp\u003eI could hear a bit of what was being said between her and Gideon during dinner.\"\u003c/p\u003e\n\u003cp\u003eMy stomach tensed, preparing for an emotional blow.\u003c/p\u003e\n\u003cp\u003eMagdalene knew just how to exploit my insecurities about Gideon.\u003c/p\u003e\n\u003cp\u003e\"Stirring up crap while I\u0027m at work is a new low,\" I said coldly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t - \" \"He wasn\u0027t ignoring you.\"\u003c/p\u003e\n\u003cp\u003eMy mouth hung open a second, and she quickly filled the silence.\u003c/p\u003e\n\u003cp\u003e\"He was managing her, Eva.\u003c/p\u003e\n\u003cp\u003eShe was making suggestions for where to take you around New York since you\u0027re new in town, but she was doing it by playing the old remember-when-you- and-I-went-there game.\"\u003c/p\u003e\n\u003cp\u003e\"A walk down memory lane,\" I muttered, grateful now that I hadn\u0027t been able to hear much of Gideon\u0027s low-voiced conversation with his ex.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eMagdalene took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"You left because you thought he was ignoring you for her.\u003c/p\u003e\n\u003cp\u003eI just want you to know that he seemed to be thinking about you, trying to keep Corinne from upsetting you.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you care?\" \"Who says I do? I owe you one, Eva, for the way I introduced myself.\"\u003c/p\u003e\n\u003cp\u003eI thought about that.\u003c/p\u003e\n\u003cp\u003eYeah, she owed me for when she ambushed me in the bathroom with her catty jealous bullshit.\u003c/p\u003e\n\u003cp\u003eNot that I bought it as her sole motivation.\u003c/p\u003e\n\u003cp\u003eMaybe I was just the lesser of two evils.\u003c/p\u003e\n\u003cp\u003eMaybe she was keeping her enemies close.\u003c/p\u003e\n\u003cp\u003e\"All right.\u003c/p\u003e\n\u003cp\u003eThank you.\"\u003c/p\u003e\n\u003cp\u003eNo denying I felt better.\u003c/p\u003e\n\u003cp\u003eA weight I hadn\u0027t realized I was carrying around was suddenly relieved.\u003c/p\u003e\n\u003cp\u003e\"Something else,\" Magdalene went on.\u003c/p\u003e\n\u003cp\u003e\"He went after you.\"\u003c/p\u003e\n\u003cp\u003eMy grip tightened on the phone receiver.\u003c/p\u003e\n\u003cp\u003eGideon always came after me .\u003c/p\u003e\n\u003cp\u003ebecause I was always running.\u003c/p\u003e\n\u003cp\u003eMy recovery was so fragile that I\u0027d learned to protect it at all costs.\u003c/p\u003e\n\u003cp\u003eWhen something threatened my stability, I ditched it.\u003c/p\u003e\n\u003cp\u003e\"There have been other women in his life who\u0027ve tried ultimatums like that, Eva.\u003c/p\u003e\n\u003cp\u003eThey got bored or they wanted his attention or some kind of grand gesture .\u003c/p\u003e\n\u003cp\u003eSo they walked away and expected him to come after them.\u003c/p\u003e\n\u003cp\u003eYou know what he did?\" \"Nothing,\" I said softly, knowing my man.\u003c/p\u003e\n\u003cp\u003eA man who never spent social time with women he slept with and never slept with women he associated with socially.\u003c/p\u003e\n\u003cp\u003eCorinne and I were the sole exceptions to that rule, which was yet another reason why his ex sent me into fits of jealousy.\u003c/p\u003e\n\u003cp\u003e\"Nothing more than making sure Angus dropped them off safely,\" she confirmed, making me think it\u0027d been a tactic she\u0027d tried at some point.\u003c/p\u003e\n\u003cp\u003e\"But when you left, he couldn\u0027t chase after you fast enough.\u003c/p\u003e\n\u003cp\u003eAnd he wasn\u0027t himself when he said good-bye.\u003c/p\u003e\n\u003cp\u003eHe seemed .\u003c/p\u003e\n\u003cp\u003eoff.\"\u003c/p\u003e\n\u003cp\u003eBecause he\u0027d felt fear.\u003c/p\u003e\n\u003cp\u003eMy eyes closed as I mentally kicked myself.\u003c/p\u003e\n\u003cp\u003eHard.\u003c/p\u003e\n\u003cp\u003eGideon had told me more than once that it terrified him when I ran, because he couldn\u0027t handle the thought that I might not come back.\u003c/p\u003e\n\u003cp\u003eWhat good did it do to say that I couldn\u0027t imagine living without him when I so often showed him otherwise with my actions? Was it any wonder he hadn\u0027t opened up to me about his past? I had to stop running.\u003c/p\u003e\n\u003cp\u003eGideon and I were both going to have to stand and fight for this, for us, if we were going to have any hope of making our relationship work.\u003c/p\u003e\n\u003cp\u003e\"Do I owe you now?\" I asked neutrally, returning Mark\u0027s wave as he left for lunch.\u003c/p\u003e\n\u003cp\u003eMagdalene exhaled in a rush.\u003c/p\u003e\n\u003cp\u003e\"Gideon and I have known each other a long time.\u003c/p\u003e\n\u003cp\u003eOur mothers are best friends.\u003c/p\u003e\n\u003cp\u003eYou and I will see each other around, Eva, and I\u0027m hoping we can find a way to avoid any awkwardness.\"\u003c/p\u003e\n\u003cp\u003eThe woman had come up to me and told me that the minute Gideon \"shoved his dick\" in me, I was \"done.\"\u003c/p\u003e\n\u003cp\u003eAnd she\u0027d hit me with that at a moment when I was especially vulnerable.\u003c/p\u003e\n\u003cp\u003e\"Listen, Magdalene, if you don\u0027t cause drama, we\u0027ll get by.\"\u003c/p\u003e\n\u003cp\u003eAnd since she was being so forthright .\u003c/p\u003e\n\u003cp\u003e\"I can screw up my relationship with Gideon all by myself, trust me.\u003c/p\u003e\n\u003cp\u003eI don\u0027t need any help.\"\u003c/p\u003e\n\u003cp\u003eShe laughed softly.\u003c/p\u003e\n\u003cp\u003e\"That was my mistake, I think - I was too careful and too accommodating.\u003c/p\u003e\n\u003cp\u003eHe has to work at it with you.\u003c/p\u003e\n\u003cp\u003eAnyway .\u003c/p\u003e\n\u003cp\u003eI\u0027ve taken up my minute.\u003c/p\u003e\n\u003cp\u003eI\u0027ll let you go.\"\u003c/p\u003e\n\u003cp\u003e\"Enjoy your weekend,\" I said, in lieu of thanks.\u003c/p\u003e\n\u003cp\u003eI still couldn\u0027t trust her motivation.\u003c/p\u003e\n\u003cp\u003e\"You, too.\"\u003c/p\u003e\n\u003cp\u003eAs I returned the receiver to its cradle, my gaze went to the photos of me and Gideon.\u003c/p\u003e\n\u003cp\u003eI was abruptly overwhelmed by feelings of greed and possession.\u003c/p\u003e\n\u003cp\u003eHe was mine, yet I couldn\u0027t be sure from one day to the next whether he\u0027d stay mine.\u003c/p\u003e\n\u003cp\u003eAnd the thought of any other woman having him made me insane.\u003c/p\u003e\n\u003cp\u003eI pulled open my bottom drawer and dug my smartphone out of my purse.\u003c/p\u003e\n\u003cp\u003eDriven by the need to have him thinking as fiercely about me, I texted him about my sudden desperate hunger to devour him whole: I\u0027d give anything to be sucking your cock right now.\u003c/p\u003e\n\u003cp\u003eJust thinking about how he looked when I took him in my mouth .\u003c/p\u003e\n\u003cp\u003ethe feral sounds he made when he was about to come .\u003c/p\u003e\n\u003cp\u003eStanding, I deleted the text the moment I saw it\u0027d been delivered, then dropped my phone back in my purse.\u003c/p\u003e\n\u003cp\u003eSince it was noon, I closed all the windows on my computer and headed out to reception to find Megumi.\u003c/p\u003e\n\u003cp\u003e\"You hungry for anything in particular?\" she asked, pushing to her feet and giving me a chance to admire her belted, sleeveless lavender dress.\u003c/p\u003e\n\u003cp\u003eI coughed because her question came so soon after my text.\u003c/p\u003e\n\u003cp\u003e\"No.\u003c/p\u003e\n\u003cp\u003eYour choice.\u003c/p\u003e\n\u003cp\u003eI\u0027m not picky.\"\u003c/p\u003e\n\u003cp\u003eWe pushed out through the glass doors to reach the elevators.\u003c/p\u003e\n\u003cp\u003e\"I am so ready for the weekend,\" Megumi said with a groan as she stabbed the call button with an acrylic- tipped finger.\u003c/p\u003e\n\u003cp\u003e\"A day and a half left to go.\"\u003c/p\u003e\n\u003cp\u003e\"Got something fun planned?\" \"That remains to be seen.\"\u003c/p\u003e\n\u003cp\u003eShe sighed and tucked her hair behind her ear.\u003c/p\u003e\n\u003cp\u003e\"Blind date,\" she explained ruefully.\u003c/p\u003e\n\u003cp\u003e\"Ah.\u003c/p\u003e\n\u003cp\u003eDo you trust the person setting you up?\" \"My roommate.\u003c/p\u003e\n\u003cp\u003eI expect the guy will at least be physically attractive, because I know where she sleeps at night and paybacks are a bitch.\"\u003c/p\u003e\n\u003cp\u003eI was smiling as an elevator car reached our floor and we stepped inside.\u003c/p\u003e\n\u003cp\u003e\"Well, that ups your odds for a good time.\"\u003c/p\u003e\n\u003cp\u003e\"Not really, since she found him by going on a blind date with him first.\u003c/p\u003e\n\u003cp\u003eShe swears he\u0027s great, just more my type than hers.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm.\"\u003c/p\u003e\n\u003cp\u003e\"I know, right?\" Megumi shook her head and looked up at the decorative, old-fashioned needle above the car doors that marked the passing floors.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have to let me know how it goes.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah.\u003c/p\u003e\n\u003cp\u003eWish me luck.\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027d just stepped out into the lobby when I felt my purse vibrate beneath my arm.\u003c/p\u003e\n\u003cp\u003eAs we passed through the turnstiles, I dug for my phone and felt my stomach tighten at the sight of Gideon\u0027s name.\u003c/p\u003e\n\u003cp\u003eHe was calling, not sexting me back.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" I said to Megumi before answering.\u003c/p\u003e\n\u003cp\u003eShe waved it off nonchalantly.\u003c/p\u003e\n\u003cp\u003e\"Go for it.\"\u003c/p\u003e\n\u003cp\u003e\"Hey,\" I greeted him playfully.\u003c/p\u003e\n\u003cp\u003e\"Eva.\"\u003c/p\u003e\n\u003cp\u003eI missed a step hearing the way he growled my name.\u003c/p\u003e\n\u003cp\u003eThere was a wealth of promise in the roughness of his voice.\u003c/p\u003e\n\u003cp\u003eSlowing, I found I was speechless, just from hearing him say my name with that edginess I craved - the sharp bite that told me he wanted to be inside me more than he wanted anything else in the world.\u003c/p\u003e\n\u003cp\u003eWhile people flowed around me, entering and exiting the building, I was halted by the weighted silence on my phone.\u003c/p\u003e\n\u003cp\u003eThe unspoken and nearly irresistible demand.\u003c/p\u003e\n\u003cp\u003eHe made no sound at all - I couldn\u0027t even hear him breathing - but I felt his hunger.\u003c/p\u003e\n\u003cp\u003eIf I didn\u0027t have Megumi waiting patiently for me, I\u0027d be riding an elevator to the top floor to satisfy his unvoiced command to make good on my offer.\u003c/p\u003e\n\u003cp\u003eThe memory of the time I\u0027d sucked him off in his office simmered through me, making my mouth water.\u003c/p\u003e\n\u003cp\u003eI swallowed.\u003c/p\u003e\n\u003cp\u003e\"Gideon .\"\u003c/p\u003e\n\u003cp\u003e\"You wanted my attention - now you have it.\u003c/p\u003e\n\u003cp\u003eI want to hear you say those words.\"\u003c/p\u003e\n\u003cp\u003eI felt my face flush.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t.\u003c/p\u003e\n\u003cp\u003eNot here.\u003c/p\u003e\n\u003cp\u003eLet me call you later.\"\u003c/p\u003e\n\u003cp\u003e\"Step over by the column and out of the way.\"\u003c/p\u003e\n\u003cp\u003eStartled, I looked around for him.\u003c/p\u003e\n\u003cp\u003eThen I remembered that the Caller ID put him in his office.\u003c/p\u003e\n\u003cp\u003eMy gaze lifted, searching for the security cameras. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-5.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
