{"id":63504,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe hair on my nape prickled.\u003c/p\u003e\n\u003cp\u003eMegumi glanced at me, and I shook my head.\u003c/p\u003e\n\u003cp\u003eI knew better than to look directly at him.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t be sure I wouldn\u0027t do something rash or desperate.\u003c/p\u003e\n\u003cp\u003eI craved him so deeply, and it had been too long since he\u0027d held me.\u003c/p\u003e\n\u003cp\u003eI used to have the right to touch him, to reach for his hand, to lean into him, to sift my fingers through his hair.\u003c/p\u003e\n\u003cp\u003eIt was a horrible ache inside me that I wasn\u0027t allowed to do those things anymore.\u003c/p\u003e\n\u003cp\u003eI had to bite my lip to stifle a moan of agony at being this close to him again.\u003c/p\u003e\n\u003cp\u003eI kept my head down, but I felt Gideon\u0027s eyes on me.\u003c/p\u003e\n\u003cp\u003eI continued talking to my co-workers, forcing myself to focus on the discussion of furniture and the compromises necessary for cohabiting with someone of the opposite sex.\u003c/p\u003e\n\u003cp\u003eAs the car continued its ascent and frequent stops, the number of people in the car dwindled.\u003c/p\u003e\n\u003cp\u003eI was acutely attuned to where Gideon was, aware that he never took elevators this crowded, suspecting and hoping and praying that he\u0027d just wanted to see me, be with me, even if it was only in this terribly impersonal way.\u003c/p\u003e\n\u003cp\u003eWhen we arrived on the twentieth floor, I took a deep breath and prepared to step out, hating the inevitable separation from the one thing in the world that made me feel truly alive.\u003c/p\u003e\n\u003cp\u003eThe doors opened.\u003c/p\u003e\n\u003cp\u003e\"Wait.\"\u003c/p\u003e\n\u003cp\u003eMy eyes closed.\u003c/p\u003e\n\u003cp\u003eI was stopped by the softly rasped command.\u003c/p\u003e\n\u003cp\u003eI knew I should keep going as if I hadn\u0027t heard him.\u003c/p\u003e\n\u003cp\u003eI knew it was just going to hurt so much worse if I gave him any more of myself, even a minute more of my life.\u003c/p\u003e\n\u003cp\u003eBut how could I possibly resist? I\u0027d never been able to when it came to Gideon.\u003c/p\u003e\n\u003cp\u003eI stepped aside so that my co- workers could exit.\u003c/p\u003e\n\u003cp\u003eWill frowned when I didn\u0027t follow, confused, but Megumi tugged him out.\u003c/p\u003e\n\u003cp\u003eThe doors closed.\u003c/p\u003e\n\u003cp\u003eI moved into the corner, my heart pounding.\u003c/p\u003e\n\u003cp\u003eGideon waited on the opposite side, radiating expectation and demand.\u003c/p\u003e\n\u003cp\u003eAs we climbed to the top floor, my body responded to his near- tangible need.\u003c/p\u003e\n\u003cp\u003eMy breasts swelled and became heavy; my sex grew slick and swollen.\u003c/p\u003e\n\u003cp\u003eI was greedy for him.\u003c/p\u003e\n\u003cp\u003eNeedful.\u003c/p\u003e\n\u003cp\u003eMy breathing quickened.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t even touched me and I was nearly panting with desire.\u003c/p\u003e\n\u003cp\u003eThe elevator glided to a stop.\u003c/p\u003e\n\u003cp\u003eGideon pulled the key out of his pocket and plugged it into the panel, suspending the car.\u003c/p\u003e\n\u003cp\u003eThen he came to me.There were only inches between us.\u003c/p\u003e\n\u003cp\u003eI kept my head bowed and stared at his gleaming oxfords.\u003c/p\u003e\n\u003cp\u003eI heard his breathing, deep and quick like mine.\u003c/p\u003e\n\u003cp\u003eI smelled the subtly masculine scent of his skin, and my pulse leaped.\u003c/p\u003e\n\u003cp\u003e\"Turn around, Eva.\"\u003c/p\u003e\n\u003cp\u003eA shiver moved through me at the familiar and beloved authoritative tone.\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I turned, then gasped as he immediately pressed against my back, flattening me to the wall of the car.\u003c/p\u003e\n\u003cp\u003eHis fingers linked with mine, holding my hands up by my shoulders.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re so beautiful,\" he breathed, nuzzling into my hair.\u003c/p\u003e\n\u003cp\u003e\"It hurts to look at you.\"\u003c/p\u003e\n\u003cp\u003e\"Gideon.\u003c/p\u003e\n\u003cp\u003eWhat are you doing?\" I felt his hunger pouring off him, enveloping me.\u003c/p\u003e\n\u003cp\u003eHis powerful frame was hard and hot, and vibrating with tension.\u003c/p\u003e\n\u003cp\u003eHe was aroused, his thick cock a firm pressure I couldn\u0027t stop myself from grinding into.\u003c/p\u003e\n\u003cp\u003eI wanted him.\u003c/p\u003e\n\u003cp\u003eI wanted him inside me.\u003c/p\u003e\n\u003cp\u003eFilling me.\u003c/p\u003e\n\u003cp\u003eCompleting me.\u003c/p\u003e\n\u003cp\u003eI\u0027d been so empty without him.\u003c/p\u003e\n\u003cp\u003eHe took a deep shuddering breath.\u003c/p\u003e\n\u003cp\u003eHis fingers flexed restlessly between mine, as if he wanted to touch me elsewhere but restrained himself.\u003c/p\u003e\n\u003cp\u003eI felt the ring I\u0027d given him digging into my flesh.\u003c/p\u003e\n\u003cp\u003eI turned my head to look at it and tensed when I saw it, confused and agonized.\u003c/p\u003e\n\u003cp\u003e\"Why?\" I whispered.\u003c/p\u003e\n\u003cp\u003e\"What do you want from me? An orgasm? You want to fuck me, Gideon? Is that it? Blow your load inside me?\" His breath hissed out at having those crude words thrown back in his face.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t call it what it is?\" I closed my eyes.\u003c/p\u003e\n\u003cp\u003e\"Fine.\u003c/p\u003e\n\u003cp\u003eJust do it.\u003c/p\u003e\n\u003cp\u003eBut don\u0027t put that ring on and act like this is something it\u0027s not.\"\u003c/p\u003e\n\u003cp\u003e\"I never take it off.\u003c/p\u003e\n\u003cp\u003eI won\u0027t.\u003c/p\u003e\n\u003cp\u003eEver.\"\u003c/p\u003e\n\u003cp\u003eHis right hand released mine and he reached into his pocket.\u003c/p\u003e\n\u003cp\u003eI watched as he slid the ring he\u0027d given me back onto my finger, and then he lifted my hand to his mouth.\u003c/p\u003e\n\u003cp\u003eHe kissed it, then pressed his lips - quick, hard, angry - to my temple.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" he snapped.\u003c/p\u003e\n\u003cp\u003eThen he was gone.\u003c/p\u003e\n\u003cp\u003eThe car began its descent.\u003c/p\u003e\n\u003cp\u003eMy right hand curled into a fist and I backed away from the wall, breathing hard.\u003c/p\u003e\n\u003cp\u003eWait.\u003c/p\u003e\n\u003cp\u003eFor what?\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eWhen I exited the elevator on the twentieth floor, I was dry-eyed and determined.\u003c/p\u003e\n\u003cp\u003eMegumi buzzed me through the security doors and pushed to her feet.\u003c/p\u003e\n\u003cp\u003e\"Is everything all right?\" I stopped by her desk.\u003c/p\u003e\n\u003cp\u003e\"I have no fucking clue.\u003c/p\u003e\n\u003cp\u003eThat man is a total head trip.\"\u003c/p\u003e\n\u003cp\u003eHer brows rose.\u003c/p\u003e\n\u003cp\u003e\"Keep me posted.\"\u003c/p\u003e\n\u003cp\u003e\"I should just write a book,\" I muttered, resuming my walk back to my cubicle and wondering why in hell everyone was so interested in my dating life.\u003c/p\u003e\n\u003cp\u003eWhen I got to my desk, I dropped my purse in the drawer and sat down to call Cary.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" I said, when he answered.\u003c/p\u003e\n\u003cp\u003e\"If you get bored - \" \"If?\" He snorted.\u003c/p\u003e\n\u003cp\u003e\"Remember that folder of information you compiled on Gideon? Can you make me one of those on Dr.\u003c/p\u003e\n\u003cp\u003eTerrence Lucas?\" \"Okay.\u003c/p\u003e\n\u003cp\u003eDo I know this guy?\" \"No.\u003c/p\u003e\n\u003cp\u003eHe\u0027s a pediatrician.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause, then, \"Are you pregnant?\" \"No! Jeez.\u003c/p\u003e\n\u003cp\u003eAnd if I were, I\u0027d need an obstetrician.\"\u003c/p\u003e\n\u003cp\u003e\"Whew.\u003c/p\u003e\n\u003cp\u003eAll right.\u003c/p\u003e\n\u003cp\u003eSpell his name for me.\"\u003c/p\u003e\n\u003cp\u003eI gave Cary what he needed, then looked up Dr.\u003c/p\u003e\n\u003cp\u003eLucas\u0027s office and made an appointment to see him.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t need to fill out any new-patient paperwork,\" I told the receptionist.\u003c/p\u003e\n\u003cp\u003e\"I just want a quick consult.\"\u003c/p\u003e\n\u003cp\u003eAfter that, I called Vidal Records and left a message for Christopher to call me.\u003c/p\u003e\n\u003cp\u003eWhen Mark came back from lunch, I went over and knocked on his open door.\u003c/p\u003e\n\u003cp\u003e\"Hey.\u003c/p\u003e\n\u003cp\u003eI need to ask for an hour in the morning for an appointment.\u003c/p\u003e\n\u003cp\u003eIs it all right if I come in at ten and stay \u0027til six?\"\"Ten to five is fine, Eva.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me carefully.\u003c/p\u003e\n\u003cp\u003e\"Everything okay?\" \"Getting better every day.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\"\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m really glad to hear that.\"\u003c/p\u003e\n\u003cp\u003eWe dived back into work, but thoughts of Gideon weighed heavily on my mind.\u003c/p\u003e\n\u003cp\u003eI kept staring at my ring, remembering what he had said when he\u0027d first given it to me: The Xs are me holding on to you.\u003c/p\u003e\n\u003cp\u003eWait.\u003c/p\u003e\n\u003cp\u003eFor him? For him to come back to me? Why? I couldn\u0027t understand why he\u0027d cut me off the way he had, then expected me to take him back.\u003c/p\u003e\n\u003cp\u003eEspecially with Corinne in the picture.\u003c/p\u003e\n\u003cp\u003eI spent the rest of the afternoon going over the last few weeks in my mind, recalling conversations I\u0027d had with Gideon, things he\u0027d said or done, searching for answers.\u003c/p\u003e\n\u003cp\u003eWhen I left the Crossfire at the end of the day, I saw the Bentley waiting out front and waved at Angus, who smiled back.\u003c/p\u003e\n\u003cp\u003eI had issues with his boss, but Angus wasn\u0027t to blame for them.\u003c/p\u003e\n\u003cp\u003eIt was hot and muggy outside.\u003c/p\u003e\n\u003cp\u003eMiserable.\u003c/p\u003e\n\u003cp\u003eI went to the Duane Reade around the corner for a bottle of cold water to drink on the walk home and a bag of mini chocolates to enjoy once I got through my Krav Maga class.\u003c/p\u003e\n\u003cp\u003eWhen I left the drugstore, Angus was waiting just outside the door at the curb, shadowing me.\u003c/p\u003e\n\u003cp\u003eAs I turned the corner back toward the Crossfire to start the trip home, I saw Gideon step out to the street with Corinne.\u003c/p\u003e\n\u003cp\u003eHis hand was at the small of her back, leading her toward a sleek black Mercedes sedan I recognized as one of his.\u003c/p\u003e\n\u003cp\u003eShe was smiling.\u003c/p\u003e\n\u003cp\u003eHis expression was inscrutable.\u003c/p\u003e\n\u003cp\u003eHorrified, I couldn\u0027t move or look away.\u003c/p\u003e\n\u003cp\u003eI stood there in the middle of the crowded sidewalk, my stomach twisting with grief and anger and a terrible, awful feeling of betrayal.\u003c/p\u003e\n\u003cp\u003eHe looked up and saw me, freezing in place just as I had.\u003c/p\u003e\n\u003cp\u003eThe Latino driver I\u0027d met the day my father arrived opened the back door and Corinne disappeared into the car.\u003c/p\u003e\n\u003cp\u003eGideon remained where he was, his gaze locked with mine.\u003c/p\u003e\n\u003cp\u003eThere was no way he missed me lifting my hand and flipping him the bird.Abruptly, I was struck by a thought.\u003c/p\u003e\n\u003cp\u003eI turned my back to Gideon and moved off to the side, digging into my purse for my phone.\u003c/p\u003e\n\u003cp\u003eWhen I found it, I speed-dialed my mom, and when she answered, I said, \"That day we went out to lunch with Megumi, you freaked out on the walk back to the Crossfire.\u003c/p\u003e\n\u003cp\u003eYou saw him, didn\u0027t you? Nathan.\u003c/p\u003e\n\u003cp\u003eYou saw Nathan at the Crossfire.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she admitted.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why Richard decided it would be best to just pay him what he wanted.\u003c/p\u003e\n\u003cp\u003eNathan said he\u0027d stay away from you as long as he had the money to leave the country.\u003c/p\u003e\n\u003cp\u003eWhy do you ask?\" \"It didn\u0027t hit me until just now that Nathan was the reason why you reacted the way you did.\"\u003c/p\u003e\n\u003cp\u003eI faced forward again and started walking quickly toward home.\u003c/p\u003e\n\u003cp\u003eThe Mercedes was gone, but my temper was rising.\u003c/p\u003e\n\u003cp\u003e\"I have to go, Mom.\u003c/p\u003e\n\u003cp\u003eI\u0027ll call you later.\"\u003c/p\u003e\n\u003cp\u003e\"Is everything all right?\" she asked anxiously.\u003c/p\u003e\n\u003cp\u003e\"Not yet, but I\u0027m working on it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here for you, if you need me.\"\u003c/p\u003e\n\u003cp\u003eI sighed.\u003c/p\u003e\n\u003cp\u003e\"I know.\u003c/p\u003e\n\u003cp\u003eI\u0027m okay.\u003c/p\u003e\n\u003cp\u003eI love you.\"\u003c/p\u003e\n\u003cp\u003eWhen I got home, Cary was sitting on the couch with his laptop on his thighs and his bare feet on the coffee table.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he called, his gaze still on his screen.\u003c/p\u003e\n\u003cp\u003eI dumped my stuff and kicked off my shoes.\u003c/p\u003e\n\u003cp\u003e\"You know what?\" He looked up at me from beneath a lock of hair that had fallen over his eyes.\u003c/p\u003e\n\u003cp\u003e\"What?\" \"I thought Gideon took a hike because of Nathan.\u003c/p\u003e\n\u003cp\u003eEverything was fine and then it wasn\u0027t, and shortly after that the police were telling us about Nathan. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-52.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
