{"id":63508,"no":56,"title":"Page 56","content":"\u003cp\u003e\"Why do you hate him so much?\" I asked, preceding him through the revolving doors.\u003c/p\u003e\n\u003cp\u003eThunder rumbled in the distance, but the hot, driving rain had ceased, leaving the streets awash in dirty water.\u003c/p\u003e\n\u003cp\u003eHe joined me on the sidewalk and set his hand at the small of my back.\u003c/p\u003e\n\u003cp\u003eIt sent a shiver of revulsion through me.\u003c/p\u003e\n\u003cp\u003e\"Why? You want to exchange notes?\" \"Sure.\u003c/p\u003e\n\u003cp\u003eWhy not?\" By the time lunch was over, I\u0027d gotten a pretty good idea of what fueled Christopher\u0027s hatred.\u003c/p\u003e\n\u003cp\u003eAll he cared about was the man he saw in the mirror.\u003c/p\u003e\n\u003cp\u003eGideon was more handsome, richer, more powerful, more confident .\u003c/p\u003e\n\u003cp\u003ejust more.\u003c/p\u003e\n\u003cp\u003eAnd Christopher was obviously being eaten alive by jealousy.\u003c/p\u003e\n\u003cp\u003eHis memories of Gideon were colored by the belief that Gideon had received all the attention as a child.\u003c/p\u003e\n\u003cp\u003eWhich might have been true, considering how troubled he was.\u003c/p\u003e\n\u003cp\u003eWorse, the sibling rivalry had crossed over into their professional lives when Cross Industries acquired majority shares in Vidal Records.\u003c/p\u003e\n\u003cp\u003eI made a mental note to ask Gideon why he\u0027d done that.\u003c/p\u003e\n\u003cp\u003eWe stopped outside the Crossfire to part ways.\u003c/p\u003e\n\u003cp\u003eA taxi racing through a huge puddle sent a plume of foaming water right at me.\u003c/p\u003e\n\u003cp\u003eSwearing under my breath, I dodged the spray and almost stumbled into Christopher.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to take you out sometime, Eva.\u003c/p\u003e\n\u003cp\u003eDinner, perhaps?\" \"I\u0027ll get in touch,\" I hedged.\u003c/p\u003e\n\u003cp\u003e\"My roommate\u0027s really sick right now and I need to be around for him as much as possible.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got my number.\"\u003c/p\u003e\n\u003cp\u003eHe smiled and kissed the back of my hand, a gesture I\u0027m sure he thought was charming.\u003c/p\u003e\n\u003cp\u003e\"And I\u0027ll keep in touch.\"\u003c/p\u003e\n\u003cp\u003eI made my way through the Crossfire\u0027s revolving doors and headed for the turnstiles.\u003c/p\u003e\n\u003cp\u003eOne of the black-suited security guards at the desk stopped me.\u003c/p\u003e\n\u003cp\u003e\"Miss Tramell.\"\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003e\"Could you come with me, please?\" Curious, I followed him to the security office where I\u0027d originally gotten my employee badge when I was hired.\u003c/p\u003e\n\u003cp\u003eHe opened the door for me, and Gideon was waiting inside.\u003c/p\u003e\n\u003cp\u003eLeaning back against the desk with his arms crossed, he looked beautiful and fuckable and wryly amused.\u003c/p\u003e\n\u003cp\u003eThe door shut behind me and he sighed, shaking his head.\u003c/p\u003e\n\u003cp\u003e\"Are there other people in my life you plan on harassing on my behalf?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Are you spying on me again?\" \"Keeping a protective eye on you.\"\u003c/p\u003e\n\u003cp\u003eI arched a brow at him.\u003c/p\u003e\n\u003cp\u003e\"And how do you know if I harassed him or not?\" His faint smile widened.\u003c/p\u003e\n\u003cp\u003e\"Because I know you.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I didn\u0027t harass him.\u003c/p\u003e\n\u003cp\u003eReally.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t,\" I argued when he shot me a look of disbelief.\u003c/p\u003e\n\u003cp\u003e\"I was going to, but then I didn\u0027t.\u003c/p\u003e\n\u003cp\u003eAnd why are we in this room?\" \"Are you on some kind of crusade, angel?\" We were talking around each other, and I wasn\u0027t sure why.\u003c/p\u003e\n\u003cp\u003eAnd I didn\u0027t care, because something else struck me as more significant.\u003c/p\u003e\n\u003cp\u003e\"Do you realize that your reaction to my lunch with Christopher is very calm? And so is my reaction to your spending time with Corinne? We\u0027re both reacting totally different from the way we would have just a month ago.\"\u003c/p\u003e\n\u003cp\u003eHe was different.\u003c/p\u003e\n\u003cp\u003eHe smiled, and there was something unique about that warm curving of his lips.\u003c/p\u003e\n\u003cp\u003e\"We trust each other, Eva.\u003c/p\u003e\n\u003cp\u003eIt feels good, doesn\u0027t it?\"\"Trusting you doesn\u0027t mean I\u0027m any less baffled by what\u0027s going on between us.\u003c/p\u003e\n\u003cp\u003eWhy are we hiding in this office?\" \"Plausible deniability.\"\u003c/p\u003e\n\u003cp\u003eGideon straightened and came to me.\u003c/p\u003e\n\u003cp\u003eCupping my face in his hands, he tilted my head back and kissed me sweetly.\u003c/p\u003e\n\u003cp\u003e\"I love you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re getting good at saying that.\"\u003c/p\u003e\n\u003cp\u003eHe ran his fingers through my new bangs.\u003c/p\u003e\n\u003cp\u003e\"Remember that night, when you had your nightmare and I was out late? You wondered where I was.\"\u003c/p\u003e\n\u003cp\u003e\"I still wonder.\"\u003c/p\u003e\n\u003cp\u003e\"I was at the hotel, clearing out that room.\u003c/p\u003e\n\u003cp\u003eMy fuck pad, as you called it.\u003c/p\u003e\n\u003cp\u003eExplaining that while you were puking your guts out didn\u0027t seem to be the appropriate time.\"\u003c/p\u003e\n\u003cp\u003eMy breath left me in a rush.\u003c/p\u003e\n\u003cp\u003eIt was a relief to know where he\u0027d been.\u003c/p\u003e\n\u003cp\u003eAn even bigger relief to know that the fuck pad was no more.\u003c/p\u003e\n\u003cp\u003eHis gaze was soft as he looked at me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d completely forgotten about it until it came up with Dr.\u003c/p\u003e\n\u003cp\u003ePetersen.\u003c/p\u003e\n\u003cp\u003eWe both know I\u0027ll never use it again.\u003c/p\u003e\n\u003cp\u003eMy girl prefers modes of transportation to beds.\"\u003c/p\u003e\n\u003cp\u003eHe smiled and walked out.\u003c/p\u003e\n\u003cp\u003eI stared after him.\u003c/p\u003e\n\u003cp\u003eThe security guard filled the open doorway and I shoved aside my roiling thoughts to examine later, when I had the time to really grasp where they were leading me.\u003c/p\u003e\n\u003cp\u003eOn the walk home, I picked up a bottle of sparkling apple juice in lieu of champagne.\u003c/p\u003e\n\u003cp\u003eI saw the Bentley every now and then, following along, ever ready to pull over and pick me up.\u003c/p\u003e\n\u003cp\u003eIt used to irritate me, because the lingering connection it represented deepened my confusion over my breakup with Gideon.\u003c/p\u003e\n\u003cp\u003eNow, the sight of it made me smile.\u003c/p\u003e\n\u003cp\u003eDr.\u003c/p\u003e\n\u003cp\u003ePetersen had been right.\u003c/p\u003e\n\u003cp\u003eAbstinence and some space had cleared my head.\u003c/p\u003e\n\u003cp\u003eSomehow, the distance between me and Gideon had made us stronger, made us appreciate each other more and take less for granted.\u003c/p\u003e\n\u003cp\u003eI loved him more now than I ever had, and I felt that way while I was planning on a night just hanging out with my roommate, having no idea where Gideon was or who he might be with.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t matter.\u003c/p\u003e\n\u003cp\u003eI knew I was in his thoughts, in his heart.\u003c/p\u003e\n\u003cp\u003eMy phone rang and I pulled it out of my purse.\u003c/p\u003e\n\u003cp\u003eSeeing my mother\u0027s name on the screen, I answered with, \"Hi, Mom.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand what they\u0027re looking for!\" she complained, sounding angry and tearful.\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t leave Richard alone.\u003c/p\u003e\n\u003cp\u003eThey went to his offices today and took copies of the security tapes.\"\u003c/p\u003e\n\u003cp\u003e\"The detectives?\" \"Yes.\u003c/p\u003e\n\u003cp\u003eThey\u0027re relentless.\u003c/p\u003e\n\u003cp\u003eWhat do they want?\" I turned the corner to reach my street.\u003c/p\u003e\n\u003cp\u003e\"To catch a killer.\u003c/p\u003e\n\u003cp\u003eThey probably just want to see Nathan coming and going.\u003c/p\u003e\n\u003cp\u003eCheck the timing or something.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s ridiculous!\" \"Yeah, it\u0027s also just a guess.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry.\u003c/p\u003e\n\u003cp\u003eThere\u0027s nothing to find because Stanton\u0027s innocent.\u003c/p\u003e\n\u003cp\u003eEverything will be okay.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s been so good about this, Eva,\" she said softly.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s so good to me.\"\u003c/p\u003e\n\u003cp\u003eI sighed, hearing the pleading note in her voice.\u003c/p\u003e\n\u003cp\u003e\"I know, Mom.\u003c/p\u003e\n\u003cp\u003eI get it.\u003c/p\u003e\n\u003cp\u003eDad gets it.\u003c/p\u003e\n\u003cp\u003eYou\u0027re where you should be.\u003c/p\u003e\n\u003cp\u003eNo one\u0027s judging you.\u003c/p\u003e\n\u003cp\u003eWe\u0027re all good.\"\u003c/p\u003e\n\u003cp\u003eIt took me until I reached my front door to calm her down, during which time I wondered what the detectives would see if they pulled the Crossfire security tapes, too.\u003c/p\u003e\n\u003cp\u003eThe history of my relationship with Gideon could be chronicled through the times I\u0027d been in the Cross Industries vestibule with him.\u003c/p\u003e\n\u003cp\u003eHe\u0027d first propositioned me there, bluntly stating his desire.\u003c/p\u003e\n\u003cp\u003eHe\u0027d pinned me to the wall there, right after I\u0027d agreed to date him exclusively.\u003c/p\u003e\n\u003cp\u003eAnd he\u0027d rejected my touch that horrible day when he had first started pulling away from me.\u003c/p\u003e\n\u003cp\u003eThe detectives would see it all if they looked back far enough, those private and personal moments in time.\u003c/p\u003e\n\u003cp\u003e\"Call me if you need me,\" I said as I dropped my bag and purse off at the breakfast bar.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be home all night.\"\u003c/p\u003e\n\u003cp\u003eWe hung up, and I noticed an unfamiliar trench coat slung over one of the bar stools.\u003c/p\u003e\n\u003cp\u003eI shouted out to Cary, \"Honey, I\u0027m home!\" I put the bottle of apple juice in the fridge and headed down the hallway to my bedroom for a shower.\u003c/p\u003e\n\u003cp\u003eI was on the threshold of my room when Cary\u0027s door opened and Tatiana came out.\u003c/p\u003e\n\u003cp\u003eMy eyes widened at the sight of her naughty nurse costume, complete with exposed garters and fishnets.\u003c/p\u003e\n\u003cp\u003e\"Hey, honey,\" she said, looking smug.\u003c/p\u003e\n\u003cp\u003eShe was astonishingly tall in her heels, towering over me.\u003c/p\u003e\n\u003cp\u003eA successful model, Tatiana Cherlin had the kind of face and body that could stop traffic.\u003c/p\u003e\n\u003cp\u003e\"Take care of him for me.\"\u003c/p\u003e\n\u003cp\u003eBlinking, I watched the leggy blonde disappear into the living room.\u003c/p\u003e\n\u003cp\u003eI heard the front door shut a short time later.Cary appeared in his doorway, looking mussed and flushed and wearing only his boxer briefs.\u003c/p\u003e\n\u003cp\u003eHe leaned into the doorway with a lazy, satisfied grin.\u003c/p\u003e\n\u003cp\u003e\"Hey.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, yourself.\u003c/p\u003e\n\u003cp\u003eLooks like you had a good day.\"\u003c/p\u003e\n\u003cp\u003e\"Hell yeah.\"\u003c/p\u003e\n\u003cp\u003eThat made me smile.\u003c/p\u003e\n\u003cp\u003e\"No judgment here, but I assumed you and Tatiana were done.\"\u003c/p\u003e\n\u003cp\u003e\"I never thought we got started.\"\u003c/p\u003e\n\u003cp\u003eHe ran a hand through his hair, ruffling it.\u003c/p\u003e\n\u003cp\u003e\"Then she showed up today all worried and apologetic.\u003c/p\u003e\n\u003cp\u003eShe\u0027s been in Prague and didn\u0027t hear about me until this morning.\u003c/p\u003e\n\u003cp\u003eShe rushed over wearing that, like she read my perverted mind.\"\u003c/p\u003e\n\u003cp\u003eI leaned into my doorway, too.\u003c/p\u003e\n\u003cp\u003e\"Guess she knows you.\"\u003c/p\u003e\n\u003cp\u003e\"Guess she does.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see how it goes.\u003c/p\u003e\n\u003cp\u003eShe knows Trey\u0027s in my life and I hope to keep him there.\u003c/p\u003e\n\u003cp\u003eTrey, though .\u003c/p\u003e\n\u003cp\u003eI know he won\u0027t like it.\"\u003c/p\u003e\n\u003cp\u003eI felt for both men.\u003c/p\u003e\n\u003cp\u003eIt was going to take a lot of compromising for their relationship to work out.\u003c/p\u003e\n\u003cp\u003e\"How about we forget about our significant others for a night and have an action movie marathon? I brought some nonalcoholic champagne home.\"\u003c/p\u003e\n\u003cp\u003eHis brows rose.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the fun in that?\" \"Can\u0027t mix your meds with booze, you know,\" I said dryly.\u003c/p\u003e\n\u003cp\u003e\"No Krav Maga for you tonight?\" \"I\u0027ll make it up tomorrow.\u003c/p\u003e\n\u003cp\u003eI feel like chilling with you.\u003c/p\u003e\n\u003cp\u003eI want to sprawl on the couch, and eat pizza with chopsticks and Chinese food with my fingers.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a rebel, baby girl.\"\u003c/p\u003e\n\u003cp\u003eHe grinned.\u003c/p\u003e\n\u003cp\u003e\"And you\u0027ve got yourself a date.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-56.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
