{"id":63459,"no":7,"title":"Page 7","content":"\u003cp\u003eIt made me twitchy.\u003c/p\u003e\n\u003cp\u003eStill, I waved and said hello, because I wasn\u0027t a catty bitch - unless I was given good reason to be.\u003c/p\u003e\n\u003cp\u003eI took the long hallway that led to Gideon, stopping at a large secondary reception area where his secretary, Scott, manned the desk.\u003c/p\u003e\n\u003cp\u003eScott stood as I approached.\u003c/p\u003e\n\u003cp\u003e\"Hello, Eva,\" he greeted me, reaching for his phone.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll let him know you\u0027re here.\"\u003c/p\u003e\n\u003cp\u003eThe glass wall that separated Gideon\u0027s office from the rest of the floor was usually crystal clear but could be made opaque with the push of a button.\u003c/p\u003e\n\u003cp\u003eIt was frosted now, which increased my uneasiness.\u003c/p\u003e\n\u003cp\u003e\"Is he alone?\" \"Yes, but - \" Whatever else he said was lost as I pushed through the glass door and into Gideon\u0027s domain.\u003c/p\u003e\n\u003cp\u003eIt was a massive space, with three distinct seating areas, each larger than my boss Mark\u0027s entire office.\u003c/p\u003e\n\u003cp\u003eIn contrast to the elegant warmth of Gideon\u0027s apartment, his office was decorated in a cool palette of black, gray, and white broken only by the jewel-toned crystal decanters that decorated the wall behind a bar.\u003c/p\u003e\n\u003cp\u003eFloor-to-ceiling windows overlooked the city on two sides.\u003c/p\u003e\n\u003cp\u003eThe one solid wall opposite the immense desk was covered in flat screens streaming news channels from around the world.\u003c/p\u003e\n\u003cp\u003eMy gaze swept the room and caught on the throw pillow that had been carelessly knocked to the floor.\u003c/p\u003e\n\u003cp\u003eBeside it were indents in the area rug that betrayed where the couch feet were usually planted.\u003c/p\u003e\n\u003cp\u003eThe piece of furniture had, apparently, been bumped askew by a few inches.\u003c/p\u003e\n\u003cp\u003eMy heart rate sped up and my palms grew damp.\u003c/p\u003e\n\u003cp\u003eThat awful anxiety I\u0027d felt earlier intensified.\u003c/p\u003e\n\u003cp\u003eI had just noticed the open door to the washroom when Gideon stepped into view, stealing my breath with the beauty of his exposed torso.\u003c/p\u003e\n\u003cp\u003eHis hair was damp, as if from a recent shower, and his neck and upper chest were still flushed, as it became when he exerted himself physically.\u003c/p\u003e\n\u003cp\u003eHe froze when he saw me, his gaze darkening for an instant before his perfect, implacable mask slid effortlessly into place.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a good time, Eva,\" he said, shrugging into a dress shirt he\u0027d had draped over the back of a bar stool .\u003c/p\u003e\n\u003cp\u003ea different shirt from the one he\u0027d been wearing earlier that morning.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m running late to an appointment.\"\u003c/p\u003e\n\u003cp\u003eI gripped my purse tightly.\u003c/p\u003e\n\u003cp\u003eSeeing him so intimately brought home how badly I wanted him.\u003c/p\u003e\n\u003cp\u003eI loved him insanely, needed him like I needed to breathe .\u003c/p\u003e\n\u003cp\u003ewhich only made it easier for me to understand how Magdalene and Corinne felt, and to relate to any lengths they might go to in trying to lure him away from me.\u003c/p\u003e\n\u003cp\u003e\"Why are you half dressed?\" There was no help for it.\u003c/p\u003e\n\u003cp\u003eMy body responded instinctively to the sight of his, which made it even harder for me to rein in my rioting emotions.\u003c/p\u003e\n\u003cp\u003eHis open, neatly pressed dress shirt revealed golden skin stretched tightly over washboard abs and perfectly defined pectorals.\u003c/p\u003e\n\u003cp\u003eA dusting of dark hair over his chest arrowed down and darkened into a thin line, leading to a cock presently encased in boxer briefs and slacks.\u003c/p\u003e\n\u003cp\u003eJust thinking about how he felt inside me made me ache with longing.\u003c/p\u003e\n\u003cp\u003e\"I got something on my shirt.\"\u003c/p\u003e\n\u003cp\u003eHe began buttoning up, his abs flexing with his movements as he crossed over to the bar, where I saw his cuff links waiting.\u003c/p\u003e\n\u003cp\u003e\"I have to run.\u003c/p\u003e\n\u003cp\u003eIf you need something, let Scott know and he\u0027ll see to it.\u003c/p\u003e\n\u003cp\u003eOr I\u0027ll take care of it when I get back.\u003c/p\u003e\n\u003cp\u003eI shouldn\u0027t be more than two hours.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you running late?\" He didn\u0027t look at me when he answered, \"I had to squeeze in a last- minute meeting.\"\u003c/p\u003e\n\u003cp\u003eDid you now? \"You showered this morning.\"\u003c/p\u003e\n\u003cp\u003eAfter making love to me for an hour.\u003c/p\u003e\n\u003cp\u003e\"Why did you have to shower again?\" \"Why the inquisition?\" he snapped.\u003c/p\u003e\n\u003cp\u003eNeeding answers, I went to the washroom.\u003c/p\u003e\n\u003cp\u003eThe lingering humidity was oppressive.\u003c/p\u003e\n\u003cp\u003eIgnoring the voice in my head telling me not to look for trouble I couldn\u0027t bear to find, I dug his shirt out of the laundry basket .\u003c/p\u003e\n\u003cp\u003eand saw red lipstick smeared like a bloodstain on one of the cuffs.\u003c/p\u003e\n\u003cp\u003ePain twisted through my chest.\u003c/p\u003e\n\u003cp\u003eDropping the garment on the floor, I pivoted and left, needing to get as far away from Gideon as possible.\u003c/p\u003e\n\u003cp\u003eBefore I threw up or started sobbing.\u003c/p\u003e\n\u003cp\u003e\"Eva!\" he snapped as I hurried past him.\u003c/p\u003e\n\u003cp\u003e\"What the hell is the matter with you?\" \"Fuck you, asswipe.\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me?\" My hand was on the door handle when he caught me, yanking me back by the elbow.\u003c/p\u003e\n\u003cp\u003eSpinning, I slapped him with enough force to turn his head and set my palm on fire.\u003c/p\u003e\n\u003cp\u003e\"Goddamn it,\" he growled, grabbing me by the arms and shaking me.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t fucking hit me!\" \"Don\u0027t touch me!\" The feel of his bare hands on the bare skin of my arms was too much.\u003c/p\u003e\n\u003cp\u003eHe shoved back and away from me.\u003c/p\u003e\n\u003cp\u003e\"What the fuck\u0027s gotten into you?\" \"I saw her, Gideon.\"\u003c/p\u003e\n\u003cp\u003e\"Saw who?\" \"Corinne!\" He scowled.\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" Pulling my smartphone out, I thrust the photo in his face.\u003c/p\u003e\n\u003cp\u003e\"Busted.\"\u003c/p\u003e\n\u003cp\u003eGideon\u0027s gaze narrowed on the screen, and then his scowl cleared.\u003c/p\u003e\n\u003cp\u003e\"Busted doing what, exactly?\" he asked, too softly.\u003c/p\u003e\n\u003cp\u003e\"Oh, screw you.\"\u003c/p\u003e\n\u003cp\u003eI turned toward the door, shoving my phone in my purse.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not spelling it out for you.\"\u003c/p\u003e\n\u003cp\u003eHis palm slapped against the glass, holding the door closed.\u003c/p\u003e\n\u003cp\u003eCaging me with his body, he leaned down and hissed in my ear, \"Yes.\u003c/p\u003e\n\u003cp\u003eYes, you goddamn will spell it out.\"\u003c/p\u003e\n\u003cp\u003eI squeezed my eyes shut as our position at the door brought back a flood of heated memories from the first time I\u0027d been in Gideon\u0027s office.\u003c/p\u003e\n\u003cp\u003eHe\u0027d stopped me just like this, seducing me deftly, drawing us into a passionate embrace on the very couch that had recently seen some kind of action forceful enough to shove it out of position.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t a picture say a thousand words?\" I bit out through clenched teeth.\u003c/p\u003e\n\u003cp\u003e\"So Corinne was manhandled.\u003c/p\u003e\n\u003cp\u003eWhat does that have to do with me?\" \"Are you kidding me? Let me out.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t find anything even remotely funny about this.\u003c/p\u003e\n\u003cp\u003eIn fact, I don\u0027t think I\u0027ve ever been this pissed off at a woman.\u003c/p\u003e\n\u003cp\u003eYou come in here with your half-assed accusations and self- righteous bullshit - \" \"I am righteous!\" I twisted around and ducked beneath his arm, putting some much-needed distance between us.\u003c/p\u003e\n\u003cp\u003eBeing close to him hurt too much.\u003c/p\u003e\n\u003cp\u003e\"I would never cheat on you! If I wanted to fuck around, I\u0027d break it off with you first.\"\u003c/p\u003e\n\u003cp\u003eLeaning into the door, Gideon crossed his arms.\u003c/p\u003e\n\u003cp\u003eHis shirt remained untucked and open at the collar, a look I found hot and tempting, which only made me angrier.\u003c/p\u003e\n\u003cp\u003e\"You think I cheated on you?\" His tone was clipped and icy.\u003c/p\u003e\n\u003cp\u003eI sucked in a deep breath to get through the pain of imagining him with Corinne on the sofa behind me.\u003c/p\u003e\n\u003cp\u003e\"Explain to me why she was here at the Crossfire, looking like she did.\u003c/p\u003e\n\u003cp\u003eWhy your office looks like this.\u003c/p\u003e\n\u003cp\u003eWhy you look like that.\"\u003c/p\u003e\n\u003cp\u003eHis gaze went to the couch, then to the cushion on the floor, then back to me.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know why Corinne was here or why she looked like that.\u003c/p\u003e\n\u003cp\u003eI haven\u0027t seen her since last night, when you were with me.\"\u003c/p\u003e\n\u003cp\u003eLast night seemed like it\u0027d happened forever ago.\u003c/p\u003e\n\u003cp\u003eI wished that it had never happened at all.\u003c/p\u003e\n\u003cp\u003e\"But I wasn\u0027t with you,\" I pointed out.\u003c/p\u003e\n\u003cp\u003e\"She batted her eyelashes and said she wanted to introduce you to someone, and you left me standing there.\"\u003c/p\u003e\n\u003cp\u003e\"Christ.\"\u003c/p\u003e\n\u003cp\u003eHis eyes blazed.\u003c/p\u003e\n\u003cp\u003e\"Not this again.\"\u003c/p\u003e\n\u003cp\u003eI swiped angrily at a tear that slid down my cheek.\u003c/p\u003e\n\u003cp\u003eHe growled.\u003c/p\u003e\n\u003cp\u003e\"You think I went with her because I was overcome with the need to be with her and get away from you?\" \"I don\u0027t know, Gideon.\u003c/p\u003e\n\u003cp\u003eYou ditched me.\u003c/p\u003e\n\u003cp\u003eYou\u0027re the one with the answers.\"\u003c/p\u003e\n\u003cp\u003e\"You ditched me first.\"\u003c/p\u003e\n\u003cp\u003eMy mouth fell open.\u003c/p\u003e\n\u003cp\u003e\"I did not!\" \"The hell you didn\u0027t.\u003c/p\u003e\n\u003cp\u003eAlmost the second we arrived, you took off.\u003c/p\u003e\n\u003cp\u003eI had to hunt you down and when I did, you were dancing with that prick.\"\u003c/p\u003e\n\u003cp\u003e\"Martin is Stanton\u0027s nephew!\" And since Richard Stanton was my stepdad, I thought of Martin as family.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care if he\u0027s a damned priest.\u003c/p\u003e\n\u003cp\u003eHe wants to nail you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh my God.\u003c/p\u003e\n\u003cp\u003eThat\u0027s absurd! Stop deflecting.\u003c/p\u003e\n\u003cp\u003eYou were talking business with your associates.\u003c/p\u003e\n\u003cp\u003eIt was awkward standing there.\u003c/p\u003e\n\u003cp\u003eFor them as well as me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s your place, awkward or not!\"My head jerked back as if he\u0027d slapped me.\u003c/p\u003e\n\u003cp\u003e\"Come again?\" \"How would you feel if I walked away from you at a Waters Field and Leaman party because you started talking about a campaign? Then, when you found me, I was slow dancing with Magdalene?\" \"I - \" God.\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t thought of it like that.\u003c/p\u003e\n\u003cp\u003eGideon appeared smooth and unruffled with his powerful frame lounging against the door, but I could sense the anger vibrating beneath that calm surface.\u003c/p\u003e\n\u003cp\u003eHe was riveting always, but most especially when he was seething with passion.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my place to stand beside you, and support you, and yes, just fucking look pretty on your arm sometimes.\u003c/p\u003e\n\u003cp\u003eIt\u0027s my right, my duty, and my privilege, Eva, just as it\u0027s yours in reverse.\"\u003c/p\u003e\n\u003cp\u003e\"I thought I was doing you a favor by getting out of the way.\"\u003c/p\u003e\n\u003cp\u003eHis arched brow was a silent, sarcastic comeback.\u003c/p\u003e\n\u003cp\u003eMy arms crossed in front of me.\u003c/p\u003e\n\u003cp\u003e\"Is that why you walked off with Corinne? Were you punishing me?\" \"If I wanted to punish you, Eva, I\u0027d take you over my knee.\"\u003c/p\u003e\n\u003cp\u003eMy gaze narrowed.\u003c/p\u003e\n\u003cp\u003eThat was never going to happen.\u003c/p\u003e\n\u003cp\u003e\"I know how you get,\" he said curtly.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t want you jealous over Corinne before I had a chance to explain.\u003c/p\u003e\n\u003cp\u003eI needed a few minutes to make sure she understood how serious you and I are, and how important it was to me that you enjoy the evening. \u003c/p\u003e","sourceLink":"https://allnovel.net/reflected-in-you-crossfire-2/page-7.html","bookId":1923,"creation":"Oct 5, 2019 9:51:21 AM","modification":"Oct 5, 2019 9:51:21 AM"}
