{"id":37999,"no":20,"title":"Section 20","content":"\u0026nbsp;It was fortunate that this was the day of Peter’s meeting with McGivney. He could really not have kept this wonderful secret to himself over night. He made excuses to the girls, and dodged thru the chicken-yard as before, and made his way to the American House. As he walked, Peter’s mind was working busily. He had really got his grip on the ladder of prosperity now; he must not fail to tighten it. \n\u003cdiv\u003e\n McGivney saw right away from Peter’s face that something had happened. “Well?” he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got it!” exclaimed Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Got what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The name of the spy in the jail.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Christ! You don’t mean it!” cried the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No doubt about it,” answered Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter clenched his hands and summoned his resolution. “First,” he said, “you and me got to have an understanding. Mr. Guffey said I was to be paid, but he didn’t say how much, or when.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, hell!” said McGivney. “If you’ve got the name of that spy, you don’t need to worry about your reward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, that’s all right,” said Peter, “but I’d like to know what I’m to get and how I’m to get it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much do you want?” demanded the man with the face of a rat. Rat-like, he was retreating into a corner, his sharp black eyes watching his enemy. “How much?” he repeated.\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter had tried his best to rise to this occasion. Was he not working for the greatest and richest concern in American City, the Traction Trust? Tens and hundreds of millions of dollars they were worth—he had no idea how much, but he knew they could afford to pay for his secret. “I think it ought to be worth two hundred dollars,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure,” said McGivney, “that’s all right. We’ll pay you that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And straightway Peter’s heart sank. What a fool he had been! Why hadn’t he had more courage, and asked for five hundred dollars? He might even have asked a thousand, and made himself independent for life!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said McGivney, “who’s the spy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter made an agonizing, effort, and summoned yet more nerve. “First, I got to know, when do I get that money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, good God!” said McGivney. “You give us the information, and you’ll get your money all right. What kind of cheap skates do you take us for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, that’s all right,” said Peter. “But you know, Mr. Guffey didn’t give me any reason to think he loved me. I still can hardly use this wrist like I used to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, he was trying to get some information out of you,” said McGivney. “He thought you were one of them dynamiters—how could you blame him? You give me the name of that spy, and I’ll see you get your money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But still Peter wouldn’t yield. He was afraid of the rat-faced McGivney, and his heart was thumping fast, but he stood his ground. “I think I ought to see that money,” he said, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say, what the hell do you take me for?” demanded the detective. “D’you suppose I’m going to give you two hundred dollars and then have you give me some fake name and skip?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I wouldn’t do that!” cried Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do I know you wouldn’t?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I want to go on working for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure, and we want you to go on working for us. This ain’t the last secret we’ll get from you, and you’ll find we play straight with our people—how’d we ever get anywheres otherwise? There’s a million dollars been put up to hang that Goober crowd, and if you deliver the goods, you’ll get your share, and get it right on time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He spoke with conviction, and Peter was partly persuaded. But most of Peter’s lifetime had been spent in watching people bargaining with one another—watching scoundrels trying to outwit one another—and when it was a question of some money to be got, Peter was like a bulldog that has got his teeth fixed tight in another dog’s nose; he doesn’t consider the other dog’s feelings, nor does he consider whether the other dog admires him or not.\n\u003c/div\u003e \n\u003cdiv\u003e\n “On time?” said Peter. “What do you mean by ‘on time’?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, my God!” said McGivney, in disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, but I want to know,” said Peter. “D’you mean when I give the name, or d’you mean after you’ve gone and found out whether he really is the spy or not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n So they worried back and forth, these snarling bulldogs, growing more and more angry. But Peter was the one who had got his teeth in, and Peter hung on. Once McGivney hinted quite plainly that the great Traction Trust had had power enough to shut Peter in the “hole” on two occasions and keep him there, and it might have power enough to do it a third time. Peter’s heart failed with terror, but all the same, he hung on to McGivney’s nose.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said the rat-faced man, at last. He said it in a tone of wearied scorn; but that didn’t worry Peter a particle. “All right, I’ll take a chance with you.” And he reached into his pocket and pulled out a roll of bills—twenty dollar bills they were, and he counted out ten of them. Peter saw that there was still a lot left to the roll, and knew that he hadn’t asked as much money as McGivney had been prepared to have him ask; so his heart was sick within him. At the same time his heart was leaping with exultation—such a strange thing is the human heart!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3225/88006.html","bookId":701,"creation":"Aug 5, 2019 10:08:11 AM","modification":"Aug 11, 2019 1:36:57 PM"}
