{"id":38000,"no":21,"title":"Section 21","content":"\u0026nbsp;McGivney laid the money on the bed. “There it is,” he said, “and if you give me the name of the spy you can take it. But you’d better take my advice and not spend it, because if it turns out that you haven’t got the spy, by God, I believe Ed Guffey’d twist the arms out of you!” \n\u003cdiv\u003e\n Peter was easy about that. “I know he’s the spy all right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, who is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s Jack Ibbetts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The devil you say!” cried McGivney, incredulously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jack Ibbetts, one of the night keepers in the jail.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know him,” said the other. “But what put that notion into your head?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s a cousin of the Todd sisters.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are the Todd sisters?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jennie Todd is my girl,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Girl!” echoed the other; he stared at Peter, and a grin spread over his face. “You got a girl in two weeks? I didn’t know you had it in you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a doubtful compliment, but Peter’s smile was no less expansive, and showed all his crooked teeth. “I got her all right,” he said, “and she blabbed it out the first thing—that Ibbetts was her cousin. And then she was scared, because Andrews, the lawyer, had made her and her sister swear they wouldn’t mention his name to a soul. So you see, they’re using him for a spy—there ain’t a particle of doubt about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good God!” said McGivney, and there was genuine dismay in his tone. “Who’d think it possible? Why, Ibbetts is as decent a fellow as ever you talked to—and him a Red, and a traitor at that! You know, that’s what makes it the devil trying to handle these Reds—you never can tell who they’ll get; you never know who to trust. How, d’you suppose they manage it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dunno,” said Peter. “There’s a sucker born every minute, you know!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, anyhow, I see you ain’t one of ‘em,” said the rat-faced man, as he watched Peter take the roll of bills from the bed and tuck them away in an inside pocket.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3225/88007.html","bookId":701,"creation":"Aug 5, 2019 10:08:11 AM","modification":"Aug 11, 2019 1:36:59 PM"}
