{"id":37986,"no":7,"title":"Section 7","content":"\u0026nbsp;Suddenly the man reached out and grasped one of Peter’s hands. He twisted the wrist again, the sore wrist which still ached from the torture. “Will you tell?” \n\u003cdiv\u003e\n “I’d tell if I could!” screamed Peter. “My God, how can I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t lie to me,” hissed the man. “I know about it now, you can’t fool me. You know Jim Goober.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never heard of him!” wailed Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You lie!” declared the other, and he gave Peter’s wrist a twist.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, yes, I know him!” shrieked Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that’s more like it!” said the other. “Of course you know him. What sort of a looking man is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I dunno. He’s a big man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You lie! You know he’s a medium-sized man!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s a medium-sized man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A dark man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, a dark man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you know Mrs. Goober, the music teacher?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I know her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’ve been to her house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’ve been to her house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is their house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dunno—that is—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s on Fourth Street?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it’s on Fourth Street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he hired you to carry that suit-case with the bombs in it, didn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he hired me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he told you what was in it, didn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He—he—that is—I dunno.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t know whether he told you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, he told me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You knew all about the plot, didn’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, I knew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you know Isaacs, the Jew?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, I know him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was the fellow that drove the jitney, wasn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, he drove the jitney.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did he drive it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “H-h-he drove it everywhere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He drove it over here with the suit-case, didn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you know Biddle, and you know what he did, don’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’re willing to tell all you know about it, are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’ll tell it all. I’ll tell whatever you—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll tell whatever you know, will you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’ll stand by it? You’ll not try to back out? You don’t want to go back into the hole?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And suddenly Guffey pulled from his pocket a paper folded up. It was several typewritten sheets. “Peter Gudge,” he said, “I been looking up your record, and I’ve found out what you did in this case. You’ll see when you read how perfectly I’ve got it. You won’t find a single mistake in it.” Guffey meant this for wit, but poor Peter was too far gone with terror to have any idea that there was such a thing as a smile in the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is your story, d’you see?” continued Guffey. “Now take it and read it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So Peter took the paper in his trembling hand, the one which had not been twisted lame. He tried to read it, but his hand shook so that he had to put it on his knee, and then he discovered that his eyes had not yet got used to the light. He could not see the print. “I c-c-can’t,” he wailed.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the other man took the paper from him. “I’ll read it to you,” he said. “Now you listen, and put your mind on it, and make sure I’ve got it all right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And so Guffey started to read an elaborate legal document: “I, Peter Gudge, being duly sworn do depose and declare—” and so on. It was an elaborate and detailed story about a man named Jim Goober, and his wife and three other men, and how they had employed Peter to buy for them certain materials to make bombs, and how Peter had helped them to make the bombs in a certain room at a certain given address, and how they had put the bombs in a suit-case, with a time clock to set them off, and how Isaacs, the jitney driver, had driven them to a certain corner on Main Street, and how they had left the suit-case with the bombs on the street in front of the Preparedness Day parade.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was very simple and clear, and Peter, as he listened, was almost ready to cry with delight, realizing that this was all he had to do to escape from his horrible predicament. He knew now what he was supposed to know; and he knew it. Why had not Guffey told him long ago, so that he might have known it without having his fingers bent out of place and his wrist twisted off?\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now then,” said Guffey, “that’s your confession, is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you’ll stand by it to the end?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We can count on you now? No more nonsense?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You swear it’s all true?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you won’t let anybody persuade you to go back on it—no matter what they say to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “N-n-no, sir,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Guffey; and his voice showed the relief of a business man who has closed an important deal. He became almost human as lie went on. “Now, Peter,” he said, “you’re our man, and we’re going to count on you. You understand, of course, that we have to hold you as a witness, but you’re not to be a prisoner, and we’re going to treat you well. We’ll put you in the hospital part of the jail, and you’ll have good grub and nothing to do. In a week or so, we’ll want you to appear before the grand jury. Meantime, you understand—not a word to a soul! People may try to worm something out of you, but don’t you open your mouth about this case except to me. I’m your boss, and I’ll tell you what to do, and I’ll take care of you all the way. You got that all straight?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y-y-yes, sir,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3225/87993.html","bookId":701,"creation":"Aug 5, 2019 10:08:10 AM","modification":"Aug 5, 2019 10:08:10 AM"}
