{"id":85571,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI nodded, clinging tighter to him, relief and forgiveness melting my body into his. “I promise. And not just for me, and not just for you. We have a baby to think of now too. Congratulations, by the way.”\u003c/p\u003e\n\u003cp\u003eBraden’s eyes brightened. “Congratulations, sweetheart.”\u003c/p\u003e\n\u003cp\u003eI laughed. “Oh, Jesus C, that took us long enough.”\u003c/p\u003e\n\u003cp\u003eHe pulled me up into his arms, so my feet left the ground. I automatically clung to his neck and wrapped my legs around his waist, only to find myself being lowered to my back on the bed.\u003c/p\u003e\n\u003cp\u003eBraden lay over me, his loving eyes staring straight into mine. “I’ve missed you.”\u003c/p\u003e\n\u003cp\u003eI slipped my hands under his shirt, feeling his warm, muscled back beneath my fingers. “I’ve missed you too,” I told him thickly. “I love you so much. Even when I didn’t like you very much, I loved you completely.”\u003c/p\u003e\n\u003cp\u003eHis thumb brushed across my cheekbone. “Back at you, babe. And I won’t ever stop loving you. But just in case you have your doubts”—he threw me a quick, heated smile as his fingers curled around the waistband of my sweatpants—“let me show you how hard and deep . . . and desperately I love you.”\u003c/p\u003e\n\u003cp\u003eI tilted my hips, giving him better access to slowly peel the sweatpants off. As soon as they were gone I wrapped my legs around his back and my arms around his shoulders. “Let’s do this in the shower,” I murmured hungrily against his mouth.\u003c/p\u003e\n\u003cp\u003eHolding me tight, Braden stood up and cupped a hand to my nape, bringing my mouth to his. We savored one another in that kiss, tasting each other, our lips growing swollen from the passionate makeout.\u003c/p\u003e\n\u003cp\u003e“I love making out with you,” I confessed, nuzzling his neck as he began walking us toward the bathroom.\u003c/p\u003e\n\u003cp\u003eHe smiled in agreement and slowly lowered me to the ground once we were inside the bathroom. I pulled off my T-shirt and reached in to switch on the shower while Braden undressed. Divesting myself of my bra and panties, my hungry eyes roamed my husband’s body as he slipped off his boxer briefs. My lower belly clenched with need as he pulled me gently to him, his pale eyes burning with desire as his hands stroked down my spine, to caress the curve of my bottom.\u003c/p\u003e\n\u003cp\u003eI sighed, running my own hands over his chest, before pressing soft kisses across his pecs, stopping to tease his nipple with my tongue.\u003c/p\u003e\n\u003cp\u003eHe squeezed my ass, groaning and pressing his erection deeper into my stomach. I continued to explore him, my mouth trailing kisses across his skin, while my own hands brushed down across his hard abs, smoothed around his narrow hips, and grabbed his taut ass.\u003c/p\u003e\n\u003cp\u003eIn retaliation, Braden let go of my bottom, stroking up my sides until he cupped both of my tender breasts in his hands. A pleasant pain shot through me when he kneaded them and I gasped, arching my neck. “They’re tender,” I whispered, reminding him of my pregnant state.\u003c/p\u003e\n\u003cp\u003eHe kneaded them harder and I felt a rush of arousal shoot between my legs.\u003c/p\u003e\n\u003cp\u003e“Braden,” I moaned, pushing deeper against him.\u003c/p\u003e\n\u003cp\u003eTo my disappointment he eased his hold on me.\u003c/p\u003e\n\u003cp\u003eI eyed in him question and he smirked, silently answering it by arching me over his arm and lifting my breast to his hot, wet mouth. I cried out at the sensation of his teeth gently scraping my nipple and then I was holding on for dear mercy as he sucked it deep into his mouth.\u003c/p\u003e\n\u003cp\u003eMy breasts had never been this sensitive before.\u003c/p\u003e\n\u003cp\u003e“Oh, God, I think I’m going to come,” I panted in disbelief, my hips undulating against him.\u003c/p\u003e\n\u003cp\u003eAs if to test that theory, Braden sucked harder, circling my nipple with his tongue, while he squeezed and kneaded my other breast.\u003c/p\u003e\n\u003cp\u003eI was on fire, my whole body hot and stiff.\u003c/p\u003e\n\u003cp\u003eAnd then I felt the ripple in my stomach and the slick wetness between my legs. I’d just had a mini-orgasm from Braden playing with my breasts.\u003c/p\u003e\n\u003cp\u003eHe lifted his head when he felt my body relax, his eyes questioning.\u003c/p\u003e\n\u003cp\u003eBreathing heavily, I smiled languidly, brushing his hair from his face. “Yes.”\u003c/p\u003e\n\u003cp\u003eBraden coasted his hand down my stomach and I shivered, my sex clenching in anticipation. He slid two fingers inside me easily and his eyes darkened.\u003c/p\u003e\n\u003cp\u003e“You’re soaked.” He pumped his fingers and I rocked against them. “This is going to be fun, babe,” he muttered darkly.\u003c/p\u003e\n\u003cp\u003eI held on to his shoulders, moving on his fingers. “Baby, don’t stop.” I was close again.\u003c/p\u003e\n\u003cp\u003e“I want to taste you,” Braden said, stopping the penetration. “I want you to come on my tongue.”\u003c/p\u003e\n\u003cp\u003eI wasn’t going to argue with that.\u003c/p\u003e\n\u003cp\u003eIn seconds I found myself inside the shower, my back against the wall, Braden on his knees. He hooked my leg over his shoulder and I dug my fingers into his hair as he lowered his mouth as the shower water sluiced down his back. Consumed with pleasure, with chasing orgasm, nothing else mattered but his tongue circling my clit, his fingers pumping inside of me. My body stiffened as the climax came rushing for me. I cried out my husband’s name as I shuddered my release against his lapping, talented tongue.\u003c/p\u003e\n\u003cp\u003eDrowsy, languid, my hands slipped to rest on Braden’s shoulders, moving down his chest as he stood up, kissing me in a wet erotic kiss. With one hand he gripped the back of my right thigh, with the other my ass and I somehow managed to hop up, wrapping my legs around him so he could ease his hot, throbbing dick inside of me. My inner muscles quivered at the pressure of him pushing deep and Braden groaned against my lips.\u003c/p\u003e\n\u003cp\u003eOur eyes held as he moved slowly in and out of me, our breathing growing steadily more shallow. “I missed you,” he growled, his grip on me hard as his thrusts came a little faster.\u003c/p\u003e\n\u003cp\u003e“I missed you too.” I kissed him. I kissed him with everything I had and Braden bent his knees, his cock thrusting so deep into me as he surged up that my cry broke our lips apart.\u003c/p\u003e\n\u003cp\u003eMy fingernails dug into his skin as he continued to fuck me with a slow intensity that was sure to kill me. All my muscles were stiff as he worked me toward another climax.\u003c/p\u003e\n\u003cp\u003eBraden’s warm breath puffed against my mouth. “Come for me, babe,” he gasped, his hips flexing faster as it approached. “I need you to come, Jocelyn.”\u003c/p\u003e\n\u003cp\u003eAs if on cue the pressure in my lower body blew out and I shattered on a muffled scream, my sex rippling around Braden. “Fuck,” he grunted, pressing his face into my neck as he fucked me harder, faster, until his own shout of climax was muffled against my skin. His hips jerked against mine, shuddering hard as his cock flooded my womb with his warm release.\u003c/p\u003e\n\u003cp\u003eI stayed there, locked around him for a while as we tried to gain control of our breathing.\u003c/p\u003e\n\u003cp\u003eFinally, Braden lifted his head and before I could say it he smirked and murmured, “Best. Shower. Ever.”\u003c/p\u003e\n\u003cp\u003eBraden stared out at the view and then turned back to me with a pucker of confusion between his brow and a hint of annoyance in his eyes. “And we’re here why?”\u003c/p\u003e\n\u003cp\u003eStanding beyond Mons Meg at Edinburgh Castle, I wrapped my arms around my husband’s waist and pressed in close, tilting my head back to meet his eyes. “Somewhere you got the impression that I only come here when I’m in despair. I think that’s why you shut me out. You were angry that I came here when I found out about our baby.”\u003c/p\u003e\n\u003cp\u003eHe nodded, his grip on my hips tightening. “We don’t need to rehash this, Jocelyn.”\u003c/p\u003e\n\u003cp\u003eIt was a week after our reconciliation and things since then had been tentative, a little fragile, but good. We were finding our feet again but this time as a pregnant couple. Braden was so excited to be a dad that he was really helping me work through my fears. I also talked to him about seeing Dr. Pritchard again and we’d agreed to see her together, so he’d understand what I was going through even better. Seeing a therapist was not on the list of things Braden ever wanted to do, but he was doing it for our family.\u003c/p\u003e\n\u003cp\u003e“I’m not rehashing,” I promised him. “I need you to know that I don’t come here when I’m in despair.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “You don’t?”\u003c/p\u003e\n\u003cp\u003e“No.” I smiled, shaking my head. “I come here whenever I need quiet. Some peace and quiet to process stuff. When I found out I was pregnant everything just filled my head. My mom and dad. Beth. You. Ellie. Elodie. Clark. Everyone I love. And the baby, our baby. I didn’t know if I was scared or happy or sad or excited. It’s an uncomfortable feeling to have all that crap colliding without focus. I came here to focus it so I could work out what I was feeling. But you showed up before I could.”\u003c/p\u003e\n\u003cp\u003e“And jumped to conclusions.”\u003c/p\u003e\n\u003cp\u003e“Yup. Then I wanted to talk it out with you. I really did. I wanted your help.”\u003c/p\u003e\n\u003cp\u003e“And I was a complete bastard.”\u003c/p\u003e\n\u003cp\u003eI laughed. “That’s not why I brought you here. I brought you here so you’d know that this isn’t three years ago. When I need to work something out I won’t run from you. But if I come here I need you to know that it’s just a place I like to come for peace and quiet. I’m not shutting you out of it. I want to share it with you.”\u003c/p\u003e\n\u003cp\u003eHe bent his head to speak quietly against my mouth. “This is your place. You don’t need to share it with me. Just as long as you share what’s going on with you, I’m happy.”\u003c/p\u003e\n\u003cp\u003e“I can definitely do that.”\u003c/p\u003e\n\u003cp\u003eSmiling, Braden ducked his head as he opened his coat and pulled a small package out of the inside pocket. It was a weird shape and very badly gift-wrapped. “For you.”\u003c/p\u003e\n\u003cp\u003eBemused, I took the present. “What is it?”\u003c/p\u003e\n\u003cp\u003eHe shrugged, still smiling. “Just something to remind you of who you are and what a great mum you’re going to be.”\u003c/p\u003e\n\u003cp\u003eGrateful that he thought so, I quickly unwrapped the gift, my heart flipping over in my chest when I recognized it. It was a silver baby’s rattle and if I turned it I’d find my name engraved on one side and my little sister Beth’s engraved on the other. It had been my rattle and when Beth came along I had my mom get Beth’s name engraved on the other side so I could give it to my little sister. My mom had kept it in a silk-lined box, in the hopes that we’d started a new tradition of passing it down through the family. It wasn’t a story I’d told Braden, even when I’d rescued it from the storage facility in Virginia when we’d gone there to clear out my family’s belongings. \u003c/p\u003e","sourceLink":"https://allnovel.net/castle-hill-on-dublin-street-3/page-13.html","bookId":1894,"creation":"Oct 5, 2019 5:07:33 PM","modification":"Oct 5, 2019 5:07:33 PM"}
