{"id":85567,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I thought you liked that bikini.”\u003c/p\u003e\n\u003cp\u003e“I do like that bikini, but so does every man on this resort with a dick he knows how to use.”\u003c/p\u003e\n\u003cp\u003e“Hmm, okay.”\u003c/p\u003e\n\u003cp\u003eHe snorted. “You know I hate to point this out since we’re speaking again, but you’ve acted worse when you’ve found women flirting with me.”\u003c/p\u003e\n\u003cp\u003eDammit.\u003c/p\u003e\n\u003cp\u003e“Okay, true. But I thought we were trying to be grown-ups now that we’re married.”\u003c/p\u003e\n\u003cp\u003e“Is that what you were doing at the airport?” He chuckled again. “Being a grownup?”\u003c/p\u003e\n\u003cp\u003eHe had a freaking answer for everything. “Fine,” I grumbled. “I’m sorry for being pissed. I guess I was a little edgy. . . .”\u003c/p\u003e\n\u003cp\u003e“Because I mentioned kids again?”\u003c/p\u003e\n\u003cp\u003eI tensed against him. “I just . . . I want to wait a few years, but I don’t want you to be upset about that. I don’t want to disappoint you.”\u003c/p\u003e\n\u003cp\u003eI quickly found myself on my back, my husband braced over me. “You’re not,” he promised. “We’ll wait.”\u003c/p\u003e\n\u003cp\u003eIn answer I kissed him.\u003c/p\u003e\n\u003cp\u003eThinking back on it, I kissed him so I didn’t have to see the disappointment he was trying so hard to hide.\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003eThe Homecoming\u003c/p\u003e\n\u003cp\u003eSomething nudged me into consciousness, but I refused to open my eyes. Instead I kept my face buried in the warm, familiar skin of Braden’s neck.\u003c/p\u003e\n\u003cp\u003eIt became clear that the thing that woke me was my husband. I could feel him trying to extricate himself from my hold as gently as possible.\u003c/p\u003e\n\u003cp\u003eI held on tighter.\u003c/p\u003e\n\u003cp\u003eBraden shook against me, his tone rumbling with laughter as he asked, “Am I not allowed out of bed this morning?”\u003c/p\u003e\n\u003cp\u003e“Nope,” I mumbled against his skin. “If you move, I’ll have to move. If I have to move it means facing the fact that we’re no longer in Hawaii. I don’t know if I’m ready to deal with that.”\u003c/p\u003e\n\u003cp\u003eHe rolled me onto my back, laughing at the fact that I refused to open my eyes. “So is the plan to stay here forever?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“That might become a problem.”\u003c/p\u003e\n\u003cp\u003eI shook my head against the pillows. “I don’t foresee any problems. It’s a sound plan.”\u003c/p\u003e\n\u003cp\u003e“Well.” Braden sighed. “We will eventually start to smell. And needing the toilet might become a problem. And with your issues with flatulence—”\u003c/p\u003e\n\u003cp\u003eI punched him on the arm, opening my eyes so I didn’t miss. My husband fought me off, laughing as though he was the funniest man on earth.\u003c/p\u003e\n\u003cp\u003e“One year,” I growled at him. “All I’m asking for is one year without you bringing that up!”\u003c/p\u003e\n\u003cp\u003e“You getting adorably embarrassed when you fart in front of me?”\u003c/p\u003e\n\u003cp\u003eAfter throwing him a narrow-eyed glare, I rolled off the bed. “I am not adorable,” I snapped, stomping out of the bedroom.\u003c/p\u003e\n\u003cp\u003e“You’re fucking adorable!” he called to me as I made my way into the kitchen. I rolled my eyes. Braden could be pretty adorable, too, but he’d like it even less than me if I told him that.\u003c/p\u003e\n\u003cp\u003eI reached for the kettle, about to call through and ask if he wanted coffee when a wave of nausea caught me completely off guard and I found myself swaying against the counter.\u003c/p\u003e\n\u003cp\u003e“Babe, you okay?” Braden rushed to my side, grasping my hip in his hand.\u003c/p\u003e\n\u003cp\u003eBreathing through my nose, I fought to hold the sickness down. After a moment I rested my forehead on his chest. “I don’t feel so great.”\u003c/p\u003e\n\u003cp\u003eI felt his lips in my hair. “Jet lag. Sit down.” He ushered me toward the kitchen table and planted my ass at it. As he began to make the coffee the nausea rose again and I knew this time there was no fighting it. Without a word I shot up from the table and rushed out of the kitchen to the bathroom.\u003c/p\u003e\n\u003cp\u003eThe toilet lid was barely up when I heaved everything inside me into it.\u003c/p\u003e\n\u003cp\u003e“Jocelyn?” I could feel Braden behind me.\u003c/p\u003e\n\u003cp\u003eI waved him off. “I’ll be okay.”\u003c/p\u003e\n\u003cp\u003eSensing I wanted privacy, he left.\u003c/p\u003e\n\u003cp\u003eAfter waiting a few moments to make sure the nausea was dealt with, I got up on shaky legs and washed and brushed my teeth. Seeing my pale face in the mirror, I glowered at it.\u003c/p\u003e\n\u003cp\u003eHome sweet freaking home.\u003c/p\u003e\n\u003cp\u003e“Better?” Braden asked as I entered the kitchen.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I smiled, gratefully accepting the coffee. “Much.”\u003c/p\u003e\n\u003cp\u003eSitting in the waiting room, listening to people cough and sniffle, I felt breakable for the first time in a long time. My chest was heavy, like the air all around me was much too thin, and my thoughts were too harried, making me feel like a crazy person.\u003c/p\u003e\n\u003cp\u003eI just needed to know one way or the other.\u003c/p\u003e\n\u003cp\u003eIf I knew . . .\u003c/p\u003e\n\u003cp\u003eI just needed to know.\u003c/p\u003e\n\u003cp\u003e“Jocelyn Carmichael, Room Five, Dr. Orr.”\u003c/p\u003e\n\u003cp\u003eHere we go. . . .\u003c/p\u003e\n\u003cp\u003eBraden was sprawled in the armchair, his shirt sleeves rolled up, his tie askew, and he was staring at the television as if he was only half-interested in what was going on.\u003c/p\u003e\n\u003cp\u003eHe’d had a long day at work.\u003c/p\u003e\n\u003cp\u003eI’d just had a long day.\u003c/p\u003e\n\u003cp\u003eAnd now I was terrified. Terrified of answers. Terrified of fucking up. Of losing . . . everything.\u003c/p\u003e\n\u003cp\u003eWe’d been home from Hawaii for almost four weeks and I’d been hiding my sickness from Braden ever since that first morning. After a visit to the doctor’s that day I was almost sure of the diagnosis, but I wouldn’t know until they called to confirm the results.\u003c/p\u003e\n\u003cp\u003e“Jocelyn?”\u003c/p\u003e\n\u003cp\u003eI turned my head to look at my husband.\u003c/p\u003e\n\u003cp\u003eHe was frowning at me in concern. “What’s wrong, babe?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” I whispered, my heart beating hard against my ribs.\u003c/p\u003e\n\u003cp\u003e“It’s not nothing. You’ve been quiet. Tense.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I’m just on tenterhooks waiting to see if that lit agent in New York wants to sign me.”\u003c/p\u003e\n\u003cp\u003eAfter months and months of rejection letters I’d gotten an e-mail back from a lit agent from one of the top agencies in New York asking me for the first three chapters of my manuscript. When she e-mailed back asking to see the rest, I couldn’t believe it. I’d been trying not to get my hopes up, and my secret worry was helping keep my mind off it.\u003c/p\u003e\n\u003cp\u003e“You sure that’s all it is?”\u003c/p\u003e\n\u003cp\u003eI felt sick lying to him. So I didn’t. Instead I got up slowly and sauntered over to him, climbing onto the chair with him so I was straddling his lap. “I wish we were back in Hawaii,” I whispered against his mouth as he ran his hands down my back. “I wish, I wish, I wish . . .”\u003c/p\u003e\n\u003cp\u003e“Joc—”\u003c/p\u003e\n\u003cp\u003eI cut him off with a hard, desperate kiss, and that night I made love to my husband as if I knew what was coming next could change everything.\u003c/p\u003e\n\u003cp\u003eEllie and Adam had fallen in love with a property on Scotland Street, and in a bid to distract me, I let Ellie set up another viewing so that the girls and I could check it out. Jo, Liv, and I followed Ellie and her estate agent around the Georgian-period flat, and for a while Ellie’s exuberance and exciting plans for the flat took me away from my problem. For a moment I even forgot I had a problem, so it was a bit like being jolted back into reality when my phone rang as we were leaving the property.\u003c/p\u003e\n\u003cp\u003eMy stomach churned.\u003c/p\u003e\n\u003cp\u003eI gave the girls an apologetic smile and wandered off to the side to answer.\u003c/p\u003e\n\u003cp\u003e“Mrs. Carmichael, this is Dr. Orr. We have the results of your pregnancy test. I’d like to be the first to say congratulations, you are pregnant.”\u003c/p\u003e\n\u003cp\u003eThe world skewed to the left.\u003c/p\u003e\n\u003cp\u003e“Mrs. Carmichael?” Dr. Orr asked softly. And then his tone became more careful. “I’ll give you time to process the news. Please do call as soon as possible to arrange your prenatal care. We’ll set you up with your first appointment with a midwife.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I somehow managed to mutter, every nerve trembling like I’d just run the New York City Marathon. I hung up and slipped my phone back into my purse.\u003c/p\u003e\n\u003cp\u003eI could hear someone trying to speak to me.\u003c/p\u003e\n\u003cp\u003eI’m going to be a mom.\u003c/p\u003e\n\u003cp\u003eSomeone was questioning me.\u003c/p\u003e\n\u003cp\u003eI’m going to have a child.\u003c/p\u003e\n\u003cp\u003e“Joss, what is it?” Ellie’s frantic voice finally broke through.\u003c/p\u003e\n\u003cp\u003eI looked up at her, her pretty face a little fuzzy in my distress. “I have to go.”\u003c/p\u003e\n\u003cp\u003e“Go where?”\u003c/p\u003e\n\u003cp\u003e“I just—” The world skewed to the right. “I have to go.”\u003c/p\u003e\n\u003cp\u003e“Seriously, you’re scaring me. What’s going on?”\u003c/p\u003e\n\u003cp\u003eShe was scared? She was scared! “Ellie,” I snapped, feeling an invisible hand wrap around my throat and constrict my breathing. “Just . . .” I stopped cold at the unadulterated concern in her eyes. “I need to be alone for a little while.”\u003c/p\u003e\n\u003cp\u003eI waited for her nod and as soon as I got it, as soon as I knew she understood I wasn’t shutting her out—I just needed space—I turned on my heel and started walking, almost running, toward the castle.\u003c/p\u003e\n\u003cp\u003eSomehow a thirty-minute walk was over in a flash. I was buying my ticket into the castle, I was hoofing up Lang stairs, and striding up onto the elevated section of Edinburgh castle where St. Margaret’s Chapel was situated. And right outside the chapel was my place.\u003c/p\u003e\n\u003cp\u003eMy place with the canon, Mons Meg, and the best view of Edinburgh.\u003c/p\u003e\n\u003cp\u003eI leaned against the cannon for a moment, ignoring the tourists who were trying to get a photograph of it. Feeling its cool cast iron under my hand, I drew in a deep breath.\u003c/p\u003e\n\u003cp\u003eI was going to be a mom.\u003c/p\u003e\n\u003cp\u003eLimbs still quivering like a mess of jelly, I walked over to the parapet, leaned my elbows on the wall, and gazed out over my home.\u003c/p\u003e\n\u003cp\u003eHere was where I found my calm. For whatever reason, this place on Castle Hill allowed me to sort out my feelings, to process them, to deal with them. It was my special place. And I hadn’t needed it in a while.\u003c/p\u003e\n\u003cp\u003eBut now that I was going to be a mom . . . now, on top of having Braden and Ellie and all of my family and friends to lose, I had something miraculous to lose. My child.\u003c/p\u003e\n\u003cp\u003eThe tears burned in my throat, the fear becoming something raw inside of me.\u003c/p\u003e\n\u003cp\u003e“Jocelyn?”\u003c/p\u003e\n\u003cp\u003eI whirled around at the sound of Braden’s voice, knowing that everything I was feeling had to be written all over my face. \u003c/p\u003e","sourceLink":"https://allnovel.net/castle-hill-on-dublin-street-3/page-9.html","bookId":1894,"creation":"Oct 5, 2019 5:07:33 PM","modification":"Oct 5, 2019 5:07:33 PM"}
