{"id":43019,"no":17,"title":"CHAPTER XVII","content":"Samuel walked away, still pondering at the problem. Something must be done about Master Albert, that was certain. Before he went in to his dinner he had thought of yet another plan. He would appeal to Miss Gladys about it! He would get her to labor with the prodigal!\n\u003cbr\u003e At eight o\u0027clock the next morning, he and Sophie called at Miss Wygant\u0027s home. They went to the servants\u0027 entrance, and the maid who opened the door sent them away, saying that Miss Gladys never rose until ten o\u0027clock and would not see anyone until eleven.\n\u003cbr\u003e So they went home again and came at eleven; and they were taken to a sitting room upon the second floor and there Miss Gladys met them, clad in a morning gown of crimson silk.\n\u003cbr\u003e “And so this is Sophie!” she exclaimed. “Why you poor, poor child!” And she gazed at the little mill girl with her stunted figure and pinched cheeks, and her patched and threadbare dress; and Sophie, in her turn, gazed at the wonderful princess, tall and stately, glowing with health and voluptuous beauty.\n\u003cbr\u003e “And you work in our cotton mill!” she cried.\n\u003cbr\u003e “How perfectly terrible! And do you mean to tell me that this child is thirteen years old, Samuel?”\n\u003cbr\u003e “Yes, Miss Gladys,” said he.\n\u003cbr\u003e She turned quickly and pressed a button on the wall. “Send Mrs. Harris here,” she said to the man who answered.\n\u003cbr\u003e “Mrs. Harris is our housekeeper,” she added to Samuel. “I will consult her about it.”\n\u003cbr\u003e The “consulting” was very brief. “Mrs. Harris, this is Sophie Stedman, a little girl I want to help. I don\u0027t know what she can do, but you will find out. I want her to have some sort of a place in the house—and it mustn\u0027t be hard work.”\n\u003cbr\u003e “But, Miss Gladys,” said the other in perplexity, “I don\u0027t know of anything at all!”\n\u003cbr\u003e “You can find something,” was the young lady\u0027s reply. “I want her to have a chance to learn. Take her downstairs and have a talk with her about it.”\n\u003cbr\u003e “Yes, Miss Gladys,” said Mrs. Harris; and so Samuel was left alone with his goddess.\n\u003cbr\u003e He sat with his eyes upon the floor. He was just about to open the great subject he had in his mind, when suddenly Miss Gladys herself brought it up. “Samuel,” she asked, “why did you leave my cousin\u0027s?”\n\u003cbr\u003e Samuel hesitated. “I—I don\u0027t like to say, Miss Gladys.”\n\u003cbr\u003e “Please tell me,” she insisted.\n\u003cbr\u003e “I left it,” he replied in a low voice, “because I found that he got drunk.”\n\u003cbr\u003e “Oh!” said the girl, “when was this?”\n\u003cbr\u003e “It was last Wednesday night, Miss Gladys.”\n\u003cbr\u003e “Tell me all about it, Samuel.”\n\u003cbr\u003e “I—I don\u0027t like to,” he stammered. “It\u0027s not a story to tell to a lady.”\n\u003cbr\u003e “I already know something about it from my maid,” said she. “Jack Holliday was there, wasn\u0027t he?”\n\u003cbr\u003e “Yes, ma\u0027am.”\n\u003cbr\u003e “And some women?”\n\u003cbr\u003e “Yes, ma\u0027am.”\n\u003cbr\u003e “How many, Samuel?”\n\u003cbr\u003e “Four, Miss Gladys.”\n\u003cbr\u003e “Tell me about them, Samuel. What sort of women were they?”\n\u003cbr\u003e It was very hard for Samuel to answer these questions. He blushed as he talked; but Miss Gladys appeared not at all disconcerted—in fact she was greedy for the details.\n\u003cbr\u003e “You say her name was Belle. I wonder if it was that girl from \u0027The Maids of Mandelay.\u0027 Was she a dancer, Samuel?”\n\u003cbr\u003e “I don\u0027t know, Miss Gladys.”\n\u003cbr\u003e “And what became of her?”\n\u003cbr\u003e “I took her to a hotel, Miss Gladys.”\n\u003cbr\u003e “And what then?”\n\u003cbr\u003e Samuel stopped short. “I really couldn\u0027t tell you,” he said.\n\u003cbr\u003e “But why not?”\n\u003cbr\u003e “Because I promised.”\n\u003cbr\u003e “Whom did you promise?”\n\u003cbr\u003e “I promised the sergeant, Miss Gladys.”\n\u003cbr\u003e “The sergeant! A policeman, you mean?”\n\u003cbr\u003e “Yes, ma\u0027am.”\n\u003cbr\u003e “But what—what did the police have to do with it?”\n\u003cbr\u003e “They took me to jail, Miss Gladys. They thought that I did it.”\n\u003cbr\u003e “Did what?”\n\u003cbr\u003e And again the boy shut his lips.\n\u003cbr\u003e “Listen, Samuel,” pleaded the other. “You know that I am Bertie\u0027s cousin. And he\u0027s all alone. And I\u0027m responsible for him—”\n\u003cbr\u003e “Oh, Miss Gladys!” cried the boy. “If you only would try to help him! I meant to ask you—”\n\u003cbr\u003e “But how can I help him if you keep me in ignorance?”\n\u003cbr\u003e And so Samuel blurted out the whole story. And Miss Gladys sat dumb with horror. “She killed herself! She killed herself!” she gasped again and again.\n\u003cbr\u003e “Yes, Miss Gladys,” said Samuel. “And it was awful! You can\u0027t imagine it!”\n\u003cbr\u003e “I read of the suicide in the paper. But I never dreamed of Bertie!”\n\u003cbr\u003e There was a moment\u0027s pause. “It must be a dreadful thing for him to have on his conscience”—began the boy.\n\u003cbr\u003e “He must have been frightened to death!” said she. And then she added quickly, “Samuel, you haven\u0027t told anyone about this!”\n\u003cbr\u003e “Not a soul, Miss Gladys.”\n\u003cbr\u003e “You are sure?”\n\u003cbr\u003e “I\u0027m sure, ma\u0027am.”\n\u003cbr\u003e “You didn\u0027t tell Dr. Vince?”\n\u003cbr\u003e “I just told him that I had left because Master Albert got drunk, Miss Gladys. That was the truth.”\n\u003cbr\u003e “Yes,” said she; and then, “You always tell the truth, don\u0027t you, Samuel?”\n\u003cbr\u003e “I try to,” he replied.\n\u003cbr\u003e “You are very good, aren\u0027t you?” she added.\n\u003cbr\u003e Samuel blushed. “No,” he said gravely. “I\u0027m not good at all.”\n\u003cbr\u003e The other looked at him for a moment, and then a smile crossed her face. “I\u0027ve heard a saying,” she remarked—“\u0027Be good and you\u0027ll be happy, but you\u0027ll miss a lot of fun.\u0027”\n\u003cbr\u003e Samuel pondered. “I think that is a very terrible saying,” he declared earnestly.\n\u003cbr\u003e Miss Gladys laughed. And she went on to cross-question him as to the suicide—satisfying her curiosity as to the last hideous detail.\n\u003cbr\u003e Then she looked at Samuel and asked suddenly, “Why do you wear that hideous thing?”\n\u003cbr\u003e Samuel started. “What thing?” he asked.\n\u003cbr\u003e “That tie!”\n\u003cbr\u003e “Why!” he said—“I got that specially—”\n\u003cbr\u003e He stopped, embarrassed; and the other\u0027s peal of laughter rang through the room. “Take it off!” she said.\n\u003cbr\u003e She got up and came to him, saying, “I couldn\u0027t stand it.”\n\u003cbr\u003e With trembling fingers he removed the tie. And she took off the beautiful red ribbon that was tied about her waist, and cut it to the right length. “Put that on,” she said, “and I\u0027ll show you how to tie it.”\n\u003cbr\u003e And Samuel stood there, rapt in a sudden nightmare ecstasy. She was close to him, her quick fingers were playing about his throat. Her breath was upon his face, and the intoxicating perfume of her filled his nostrils. The blood mounted into his face, and the veins stood out upon his forehead, and strange and monstrous things stirred in the depths of him.\n\u003cbr\u003e “There,” she said, “that\u0027s better”—and stepped back to admire the result. She smiled upon him radiantly. “You have no taste, Samuel,” she said. “I shall have to educate you.”\n\u003cbr\u003e “Yes, Miss Gladys,” he responded in a low voice.\n\u003cbr\u003e “And listen,” she went on, “you will come to see Sophie now and then, won\u0027t you?”\n\u003cbr\u003e “Yes, yes,” he said quickly.\n\u003cbr\u003e “And come some time when I am here.”\n\u003cbr\u003e He caught his breath and gripped his hands and answered yet again, “Yes!”\n\u003cbr\u003e “Don\u0027t be afraid of me,” added the girl gently. “You don\u0027t appreciate yourself half enough, Samuel.”\n\u003cbr\u003e Then there came voices in the hall, and Miss Gladys turned, and the housekeeper and Sophie came in. “Well?” she asked.\n\u003cbr\u003e “She doesn\u0027t know anything at all,” said Mrs. Harris. “But if you want her taught—I suppose she could run errands and do sewing—”\n\u003cbr\u003e “Very good,” said the other. “And pay her well. Will you like that, Sophie?”\n\u003cbr\u003e “Yes, Miss,” whispered the child in a faint voice. She was gazing in awe and rapture at this peerless being, and she could hardly find utterance for two words.\n\u003cbr\u003e “All right, then,” said Miss Gladys, “that will do very well. You come to-morrow, Sophie. And good-by, Samuel. I must go for my ride now.”\n\u003cbr\u003e “Good-by, Miss Gladys,” said Samuel. “And please don\u0027t forget what you were going to say to Master Albert!”\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3245/88940.html","bookId":642,"creation":"Aug 11, 2019 6:26:05 AM","modification":"Aug 11, 2019 6:26:05 AM"}
