{"id":43377,"no":5,"title":"Chapter 5","content":"\u0026nbsp;Neither man spoke when the door closed behind Ackerson. The silence was long. Finally it was Boeman who moved. He opened the top left drawer of the desk and withdrew a small glass and a bottle. He poured a drink and offered it to the Secretary with a glance of his eyes. The Secretary shook his head. \n\u003cdiv\u003e\n Boeman lifted the tumbler to his lips and poured the liquid down with a quick motion. He made a face as it burned. He poured another, toyed with it before he tossed it down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, he made it.\" Boeman said finally, placing the empty glass on the desk. \"To the Moon and back—non stop.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You knew he would, didn\u0027t you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Boeman nodded, staring at the glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another awkward silence as both men were wrapped in thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Disappointed, Wade?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not disappointed. Disgusted.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He gave us what we wanted. The appropriations will be easy now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then what\u0027s wrong? Certainly you can\u0027t blame Ackerson fully. He doesn\u0027t know the entire story.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps that\u0027s what\u0027s wrong. If I could just tell the full story I might feel better.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Impossible. Can you imagine the entire nation carrying a load on its back the way you are now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Wade laughed bitterly. \"It might wake them up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand, Wade. My insides feel it too. But let him be the hero.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will be,\" Wade said, reaching for the bottle again. \"He will be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then let him. We have more important things to think about now.\" The Secretary got up. Wade grasped the empty tumbler in the palm of his hand, squeezing tightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ackerson said red.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know,\" replied the Secretary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Red means danger. The crater should have been stained yellow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps there was a mix-up in containers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t believe that, Frank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But the radio is still operating! A steady C.W. beam is coming in. If there was any danger we would be getting code.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Wade forced a smile. \"You should have been a minister. There is always hope ... is that it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Secretary placed his hat carefully on his head. \"I\u0027d better get over to the lab and take a look at those movies he took.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be so lonely ...\" Boeman said loosely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps not. Tomer was a quiet man. Those kind don\u0027t seem to mind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n A sudden, loud cheer broke the near silence in the room. Wade glanced toward the window. Then he got up slowly with the action of an old man. He went to the window and looked out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3305/90371.html","bookId":421,"creation":"Aug 11, 2019 6:45:17 AM","modification":"Aug 11, 2019 6:45:17 AM"}
