{"id":43378,"no":6,"title":"Chapter 6","content":"\u0026nbsp;Ackerson was being carried through a path of humanity aloft on dozens of shoulders. He was waving to the hundreds of well-wishers as he was carried toward the battery of microphones waiting on the wooden platform erected for the occasion. Wade couldn\u0027t help but think of a hero of another age. Lindbergh. It must have been the same then. And who remembered those that followed him? Or those that paved the way so he could make it? Wade shook his head. \n\u003cdiv\u003e\n He turned away from the window quickly, heading for the desk and the bottle. The Secretary followed him with his eyes, undecided.\n\u003c/div\u003e \n\u003cdiv\u003e\n Boeman lifted the bottle high above his head in a toasting gesture. \"To the hero.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t, Wade.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The bottle paused there while the eyes of the two men met. Finally the bottle returned to the desk as Wade surrendered. Then he slumped down in the chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Secretary placed his hand on Wade\u0027s shoulder. Boeman shook it off, and he was sorry instantly. \"O.K. Frank. You win. Ackerson wins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good,\" the Secretary said softly. \"That\u0027s the way we want it. We have to prevent everyone from feeling the way you do now. It isn\u0027t that you\u0027re jealous of Ackerson getting the glory. And you know that Tomer doesn\u0027t mind. It\u0027s your worrying about him that\u0027s clouding your mind. Everyone would be feeling the same way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The Secretary looked out the window. \"We couldn\u0027t have that. It would have set space travel back years. Ackerson is powerful evidence that space flight is safe. Tomer is our insurance. We need that just as badly. We had no choice. We had to stake a claim on the Moon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Wade poured another drink. \"And that conceited ass is getting all the credit while Tomer is sweating it out up there on that cold chunk of rock—while everyone thinks he quit the project because he got cold feet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True.\" The Secretary shook his head. \"But Tomer is our ace-in-the-hole if the iron curtain announces their intentions to land up there.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tomer can be contacted. He can set off the signal for the world to see. In the meantime we will be working to make the next flight a complete one. It won\u0027t take long. Tomer will manage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But Ackerson said the crater was red!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know. And I\u0027m wasting time talking with you. I should be looking at those movies he took.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Wade didn\u0027t watch the Secretary leave. He picked up the bottle and glass and went to the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n Down on the ramp the P.A. began to crackle. Ackerson was beginning his speech.\n\u003c/div\u003e \n\u003cdiv\u003e\n Wade took out the letter that Ackerson had sent to him. He took out a match and touched the flame to it. It was better that way. He was finished with Ackerson. He had a job to do now, one that would consume him. He had to get the Starfrost II underway. He had to get there to get Tomer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly he understood. There were all kinds of heroes. Men like Ackerson were driven by the lure of fame and money. Tomer became one because the job had to be done and there was no one else to do it. Lowe was one, in a way, fighting for peace against a world that was always in unrest. In a way Wade himself might fall in one category. The thought made him smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Secretary was right, of course. The public would crucify them if they knew Tomer had been in the supposedly unmanned test rocket fired at the Moon with no way home.\n\u003c/div\u003e  \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3305/90372.html","bookId":421,"creation":"Aug 11, 2019 6:45:17 AM","modification":"Aug 11, 2019 6:45:17 AM"}
