{"id":96671,"no":26,"title":"Page 26","content":"\u003cp\u003eTheir faces fascinated me, but nowhere among them could I find Vinnevra. A few resembled Gamelpar, purple dark of skin and reddish brown of hair, with broad, flat faces and warm, inteligent eyes.\u003c/p\u003e\n\u003cp\u003eBut Vinnevra was not here.\u003c/p\u003e\n\u003cp\u003eAge. Diversity. Very few young. That gave me my first shalow clue. Then Riser returned, dragging with him three other cha manush—a male and two females. On Erde-Tyrene, I had found females of Riser’s people to be quiet and reclusive, until they had made firm acquaintance—and then, al too familiar, quick to poke and make rude inquiries, nothing off limits, everything either wonderful or funny. I had never been quite sure how to deal with Riser’s women, or his female relatives—on those few occasions when I interacted with them—for Riser seldom invited me to his home, and seemed to prefer going out on jobs with me and his other young ha manush minions.\u003c/p\u003e\n\u003cp\u003eBut now he had two females in tow, of that ageless puzzlement of cha manush years. Cha manush grizzled in their adolescence but seldom turned al gray or white, as my people did.\u003c/p\u003e\n\u003cp\u003e“Everyone is missing bits,” Riser told me. His companions stood a few paces back, nostrils flexing, watching the rest of the crowd.\u003c/p\u003e\n\u003cp\u003eThey held hands, and one gestured for Riser to join them. He backed away from me, but nodded meaningfuly, eager to convey something important. We could barely hear each other in the rising babble, so he signed out: All from Erde-Tyrene. Younger fell from sky with us. Old ones brought here long ago.\u003c/p\u003e\n\u003cp\u003eOthers gathered around, too tightly for my comfort, but I did not discourage them or express any distress—for the story was coming out, the familiar story, that within them they had al once had old spirits, old warriors, each distinctive and opinionated.\u003c/p\u003e\n\u003cp\u003eTo a one, young and old, those inner voices were now silent.\u003c/p\u003e\n\u003cp\u003eI tried not to conspicuously stare at the missing pieces of their backs when they turned, raised their arms, gestured. But I could not help myself. Al of us on that wide-open, elevated platform—under that looming planet and starry sky, looking out over the stretch of Halo that had been the home of so many for so long—every single one of us had been wounded, sampled—“stung deep.” We al limped, old and young—and we al cringed when we moved.\u003c/p\u003e\n\u003cp\u003eBut the important question, immediate and crucial, was, why were we here? What did the machine master of the wheel intend for us? For I had little doubt that Riser was correct, that the green-eyed ancila was behind al this. Did that mean it was now alied with the Didact, or with the Librarian, the Lifeshaper herself?\u003c/p\u003e\n\u003cp\u003eHad the wheel been reclaimed by the Lady?\u003c/p\u003e\n\u003cp\u003eSomething else was missing in my thoughts, something that made al these theories pointless. I seemed to have misplaced a memory about a child. There was a child. . . . The child was in control . . .\u003c/p\u003e\n\u003cp\u003eheld sway over the green-eyed machine. We had been introduced!\u003c/p\u003e\n\u003cp\u003eBut I could not remember its name, and I certainly could not remember its shape.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Nine\u003c/p\u003e\n\u003cp\u003eTHE GROUP PARTED to open a passage. They craned their necks to see what was coming, rising over the edge of the platform. I caught a flash of briliant green. A monitor—larger than any I had seen so far, at least two meters wide—came into view and moved between the parted humans.\u003c/p\u003e\n\u003cp\u003e“Welcome to our instalation’s new command center,” it said in a beautiful, musical voice neither male nor female, nor much like a Forerunner’s.\u003c/p\u003e\n\u003cp\u003eAl of us, young and old, were pushed back by invisible forces until a circle cleared in the middle, about thirty paces across. As Riser and I were nudged back, I remembered the moments on the Didact’s ship when the entire hul seemed to vanish, giving us the sickening sensation of being suspended in space.\u003c/p\u003e\n\u003cp\u003eAt least here there was the gentle mercy of a floor—a deck, as the Lord of Admirals would have caled it.\u003c/p\u003e\n\u003cp\u003e“Al bid welcome,” the beautiful voice said, “to the new masters of this instalation.”\u003c/p\u003e\n\u003cp\u003eAt the center of our ring of frightened people, a number of hatches slid wide in the floor, and through these rose more monitors —smaler but otherwise almost indistinguishable from the large one.\u003c/p\u003e\n\u003cp\u003eEach had a single glowing green eye. As they rose, the hatches closed up beneath.\u003c/p\u003e\n\u003cp\u003eThere were now more than forty monitors crowded inside the circle, surrounded by humans old and young. Al stood out in sharp detail against the deep backdrop of stars and the ever-growing red and gray planet, which now covered a third of the sky.\u003c/p\u003e\n\u003cp\u003eThe nearest of these new monitors puled up before Riser and myself. It projected an image I instantly recognized—though I had never seen him before, not through my external eyes.\u003c/p\u003e\n\u003cp\u003eMale. Human. I looked the image over cautiously, closely, noting that his shape was similar to mine, though broader in shoulders and thighs; arms long and powerful-looking; hands thick and backed with patches of hair. A flatter, broader head and a great, square jaw.\u003c/p\u003e\n\u003cp\u003e“A strange reacquaintance,” the image said.\u003c/p\u003e\n\u003cp\u003eUnlike us, he appeared in raiment traditional for a high-ranking commander in the old human fleets: a rounded helmet that covered al but the forehead and the ears, a short coat over armor plates, a wide belt cinched just below the ribs, and form-fitting pants that revealed a bulging shield around the genitalia, which might, it seemed to me, have been more than a little exaggerated.\u003c/p\u003e\n\u003cp\u003eLike the ancilas, he was translucent—a ghost of a ghost, a whispering within made manifest without, like Genemender back in the Lifeworkers’ preserve. Yet having carried him within me for so long, I would have recognized him anywhere.\u003c/p\u003e\n\u003cp\u003eThis was Forthencho, the Lord of Admirals.\u003c/p\u003e\n\u003cp\u003e“We’re being given command,” the image said. “Believe this. It is true. The time for our victory has arrived.”\u003c/p\u003e\n\u003cp\u003eRiser touched my hand. I broke from my fascination to glance down at the little one. He clenched his jaw and made a smal shake of his head. His meaning was clear enough. He was incapable of further judgment or action. We had both been carried so far beyond any human wisdom or experience that any move we made— anything we might say or do—was equaly likely to produce a good outcome or a bad—equaly likely to pul us deeper into Forerunner madness, or propel us out and up.\u003c/p\u003e\n\u003cp\u003eThe image of the Lord of Admirals continued. “We have been carried by these descendants, our vessels, for many years. And now we are brought here, for this moment, by a machine that has long since turned against Forerunners. It wishes us to defeat them— to cause them misery and dismay. And so we shal!\u003c/p\u003e\n\u003cp\u003e“But there is no way yet to know our total strength, or how far we may go . . . with our new command, but this we do know, finaly: after ten thousand years, we have a chance to avenge our cruel mistreatment.\u003c/p\u003e\n\u003cp\u003e“We have urgent work to do al around this infernal wheel,” the Lord of Admirals continued. “Forerunners have cocked things up magnificently before having the grace to kil each other or die of the Shaping Sickness they wished to communicate to us. The wheel itself is in jeopardy. There is little time, and so extreme measures have been authorized.”\u003c/p\u003e\n\u003cp\u003eThe larger monitor rose up, a faint display of lacework energies playing across its features. It hovered over us al—the inner circle of machines and the outer of the humans.\u003c/p\u003e\n\u003cp\u003eAl around, the apparent openness of stars and planet was overlaid by vivid, glowing displays. The sky became like the inside of one of the old caves, filed with instructive images and stories masterfuly tuned to our ignorant needs. I seemed to both see and feel a sharply defined awareness of how we al needed to behave, to act in concert.\u003c/p\u003e\n\u003cp\u003eThe image of the Lord of Admirals favored me with particular attention. “You have a decent mind, young human,” he said. “We have traveled wel together. I wil place you beside me at the center of this weapon’s control and command. If together we can save this Halo, then we wil use it to strike against the heart of Forerunner defenses. But the time between now and then wil be very difficult.”\u003c/p\u003e\n\u003cp\u003eSymbols and curving lines surrounded the wolf-faced planet. Al of us tried hard to understand, as if our lives depended on that understanding—as very likely they did.\u003c/p\u003e\n\u003cp\u003eThe lines swept like an expanding tunnel toward the far curve of the wheel—a point of intersection.\u003c/p\u003e\n\u003cp\u003eNow appeared a dizzyingly strange and complicated set of instructions for creating a portal—a broad gate like a hole in space, through which great distances could be shrunk to almost nothing.\u003c/p\u003e\n\u003cp\u003eI watched a detailed record—reality, simulation, or reenactment, I could not tel which—of the Halo shedding damaged bits, leaving behind broken ships and a spreading, radiating cloud of atmosphere, ocean, terrain—and then opening just such a portal, and beginning a passage to comparative safety, where it would repair itself—or be supplied with materials transported from another instalation, much greater in scale and much farther away—to rebuild, if necessary.\u003c/p\u003e\n\u003cp\u003eAt the same time, from al around, I heard a low moaning sound, as if from a gathering of frightened livestock.\u003c/p\u003e\n\u003cp\u003e“After this wheel was transported to the Forerunner capital system, and the metarch-level ancila prepared to unleash its energies on the capital world itself, it was attacked by Forerunner fleets and defended by its own sentinels—a battle that resulted in much of the destruction we see around us. The wheel was moved again, a tremendous effort, but the Lifeworkers and many of the Builders who had survived continued to fight. They did al they could to destroy this instalation from within. They failed. One and al, they were finaly infected with the Shaping Sickness.”\u003c/p\u003e\n\u003cp\u003eMuch of this I had learned from Genemender. Stil, the implications plunged deep. The green-eyed inteligence knew us too wel. My hatred against Forerunners reached a pitch of intensity that almost blew me out of the presentation.\u003c/p\u003e\n\u003cp\u003eThe Lord of Admiral’s voice gathered certainty and strength.\u003c/p\u003e\n\u003cp\u003e“Now that the Forerunners have succumbed, either in battle or from the Shaping Sickness, they have left behind just a few confused servants—and many, many humans, awaiting a new time, a new mandate.\u003c/p\u003e\n\u003cp\u003e“And that mandate is: avenge the falen. Rise from defeat, rise from the dead!”\u003c/p\u003e\n\u003cp\u003eA great resonance hammered us with ancient instincts, reawakened emotions—and a desire to rectify ten thousand and more years of death, misery, and near extinction.\u003c/p\u003e\n\u003cp\u003e“The promise is simple,” the Lord of Admirals announced.\u003c/p\u003e\n\u003cp\u003e“Freedom. Support. Weapons unimagined in al our previous wars.\u003c/p\u003e\n\u003cp\u003eHumans will fight Forerunners again—and defeat them! ”\u003c/p\u003e\n\u003cp\u003eChapter Thirty\u003c/p\u003e\n\u003cp\u003eWHAT A RABBLE these words were addressed to! The elders and the few young stood alike in stunned silence, staring at the ghosts, projected and contained by machines much like those that had once populated Genemender’s reserve.\u003c/p\u003e\n\u003cp\u003eWe had al carried one or more of these warrior spirits; we had al become acquainted, more or less, with their natures and opinions. Now we were being asked to accept them as commanders—to folow them into battle.\u003c/p\u003e\n\u003cp\u003eMy first question was, why? What value, these old ghosts, to Forerunner machines? What value could I have?\u003c/p\u003e\n\u003cp\u003eWorse, I knew that the green-eyed master of the wheel was not actualy in command—had not been in charge of the wheel for many decades. I knew, but could not act on my knowledge.\u003c/p\u003e\n\u003cp\u003eTo do so would be to remember the encounter that had cost me a chunk of flesh and bone. The encounter with the child.\u003c/p\u003e\n\u003cp\u003eThe Lord of Admirals seemed to hold the highest rank in this unnatural assembly. His ghost stepped forward and addressed me as if we were both physical.\u003c/p\u003e\n\u003cp\u003e“It’s our final chance to reclaim history,” he said. Had he been real, I think he would have tried to grasp my shoulder. As it was, his hand swept empty air. I saw in his faltering expression that he perceived himself fuly capable of reaching out and touching. . . .\u003c/p\u003e\n\u003cp\u003eAnd I felt pity.\u003c/p\u003e\n\u003cp\u003eFor a moment, the ilusion broke.\u003c/p\u003e\n\u003cp\u003eI knew that the green-eyed machine was itself evil, and not just to humans. It had betrayed its own creators. It was in league with the Primordial. But how was that possible? In the years since the devastating test at Charum Hakkor, how could the Primordial have done so much to subvert this wheel-shaped world and its mechanical servant?\u003c/p\u003e\n\u003cp\u003eA few meters away, Riser faced off against the projection of a blocky-looking female, stout as a bul. Yprin Yprikushma, no doubt. From his wry, white-lidded expression, I could tel he was not impressed.\u003c/p\u003e\n\u003cp\u003eI always trusted Riser’s judgment.\u003c/p\u003e\n\u003cp\u003eThe unreality of it al made me sick. We had been through too much to fal for more ilusions, Riser and I. We knew that before now, al Forerunner magic—al of the tricks and wonders they called engineering or technology—had been used to reduce and then destroy humans—yet we were now being asked, commanded, by our ancestors, these old ghosts, to believe that in this one instance, we would carry out the wil of a greater Forerunner machine, simply because it had gone mad and set out to destroy its masters.\u003c/p\u003e\n\u003cp\u003eMy weakness almost brought me to my knees. I wobbled before the projection, holding out my hands to keep my balance. “You aren’t real,” I told the Lord of Admirals. “I wonder if you were ever real.”\u003c/p\u003e\n\u003cp\u003eSuddenly I could not hear what the others were saying. The air around us became tight and stil. We—the projected ghost and me —seemed locked in a box.\u003c/p\u003e\n\u003cp\u003e“I’m as real as I have ever been,” Forthencho told me.\u003c/p\u003e\n\u003cp\u003e“Since you died?”\u003c/p\u003e\n\u003cp\u003eThe air became harder and harder to breathe. The wals of the “box” were getting misty as if from the fog of my breath. I couldn’t see the others, only this one projection, and his monitor in shadow behind him.\u003c/p\u003e\n\u003cp\u003eMore tricks—more persuasion. Would I be suffocated if I did not comply?\u003c/p\u003e\n\u003cp\u003e“Why do they need us?” I asked.\u003c/p\u003e\n\u003cp\u003e“Not even a machine as powerful as the wheel’s master can do its work alone. You are alive. You can serve.”\u003c/p\u003e\n\u003cp\u003e“Humans? The last dregs of us that remain after so many Forerunner victories? We became animals. We were devolved— and only the Librarian thought enough of us to raise us back up again!”\u003c/p\u003e\n\u003cp\u003e“It doesn’t care!” the Lord of Admirals said. “The machine wil do everything it can to destroy Forerunners. It knows that I have fought Forerunners before.”\u003c/p\u003e\n\u003cp\u003e“And lost.” \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-primordium-halo-9/page-26.html","bookId":1632,"creation":"Oct 5, 2019 6:22:08 PM","modification":"Oct 5, 2019 6:22:08 PM"}
