{"id":96654,"no":9,"title":"Page 9","content":"\u003cp\u003eAl around the land again began to shake. Boulders rocked ponderously in their sandy beds, and a few started to lean, then tumble over. Some roled to the edge of the chasm and vanished in swirls of muddy vapor. I could swear I felt the entire land beneath us rippling like the hide of a water buffalo tired of stinging flies.\u003c/p\u003e\n\u003cp\u003eThe old man painfuly dragged himself beside Vinnevra and laid his arm over her. I joined them. I saw streamers of dust ascending like thunderheads many thousands of meters, obscuring the sky bridge as wel as the stars. Then a great wide shadow of dust covered us. Lightning played nearby, diffuse flashes folowed nine or ten finger-clicks later by thunder—thunder that would once have terrified me, but now seemed nothing. I wondered if the entire Halo were about to shiver itself to pieces. Was it possible for such a great Forerunner object to be destroyed?\u003c/p\u003e\n\u003cp\u003eOf course! We laid waste their fleets, attacked their outpost worlds. . . . And the Forerunners themselves found a way to bring down the indestructible architecture of the Precursors, on Charum Hakkor. . . . Charum Hakkor, once called the Eternal.\u003c/p\u003e\n\u003cp\u003eThe Lord of Admirals had no fear—he was already dead!\u003c/p\u003e\n\u003cp\u003eThen came the deluge. It fel of a sudden, curtaining sheets of water that pounded the ground until we started to sink. With an effort, I pushed against the suck of the mud, then dragged Vinnevra to firmer sand and the overhang of a very large boulder that did not seem interested in either shaking or roling. My motive was simple: Vinnevra knew where we should go, the old man did not.\u003c/p\u003e\n\u003cp\u003eBut that did not stop me from crawling back to get him. Walking was impossible in the thudding rain, each drop the size of a grape and cold as ice. Gamelpar, half buried in mud, struggled feebly to free himself. I rose on my knees, sank immediately to my thighs, and, reaching down, took hold of the center of his stick. His fists grabbed the stick tight and I half dragged, half carried him through the muck to where Vinnevra waited.\u003c/p\u003e\n\u003cp\u003eWe lay under the rock overhang as the land continued to shake.\u003c/p\u003e\n\u003cp\u003eSleep was impossible. We stared out into the plashing, thundering dark, wretched, chiled to the bone—but no longer thirsty. We took turns drinking from water that quickly filed a fold in one of my rag- garments—cold and sweet, even if it wanted to drown us, even if it wanted to be our death.\u003c/p\u003e\n\u003cp\u003eAt one point during the darkness, the boulder gave out a mighty\u003c/p\u003e\n\u003cp\u003ecrack, louder than the thunder, and sharp chips sprayed down over us. I reached up and found a fissure wide enough to accept the tip of a finger. Feeling in the fissure, I imagined it closing suddenly— and jerked back my hand, then wrapped myself in my arms and settled down. We were convinced that it would crash down on us at any second, yet we did not move.\u003c/p\u003e\n\u003cp\u003eThe overhang did not fal, the boulder did not split apart. We saw little or nothing through that long, dark day, beyond the occasional silvery flash. Numbness overtook us. We did not sleep, neither did we think. Misery filed the void behind our eyes. We were waiting for change, any change. Nothing else would rouse us from this mortification of fear and tingling boredom.\u003c/p\u003e\n\u003cp\u003eDay passed into night, folowed by another day.\u003c/p\u003e\n\u003cp\u003eFinaly, both rain and the rippling ground ceased abruptly, as if at the wave of a masterful hand. We stared out across the mud at wan, milky sunlight, condensing over the chasm into a double—no, a triple rainbow, each briliant, gaily-colored streamer intersecting, fading slowly from one end, brightening at the other—and disappearing.\u003c/p\u003e\n\u003cp\u003eVinnevra ventured out first. She puled and plunged through the mud for a few paces, then stood upright, lifting her arms to the light, moving her lips but making no sound—silent prayer.\u003c/p\u003e\n\u003cp\u003e“Who does she pray to?” I asked Gamelpar, who lay on his side, the green walking stick stil clutched in one hand.\u003c/p\u003e\n\u003cp\u003e“No one,” he said. “We have no gods we trust.”\u003c/p\u003e\n\u003cp\u003e“But we’re alive,” I reasoned. “Surely that’s worth thanks to somebody.”\u003c/p\u003e\n\u003cp\u003e“Pray to the wheel, then,” Gamelpar said. He crawled out from under the overhang, pushed up on his stick, and stood for the first time in many hours. His legs trembled but he kept upright, lifting first one foot loose from the mud, then another.\u003c/p\u003e\n\u003cp\u003eI was the last but I moved quicker and boldly walked along firmer, stony ground to the chasm. The migration below had stopped. I thought for a moment, peering down through the clear air, that those thousands were dead—drowned or struck down by\u003c/p\u003e\n\u003cp\u003eair, that those thousands were dead—drowned or struck down by avalanches.\u003c/p\u003e\n\u003cp\u003eBut then I saw some of them move. One by one, individuals, then groups, and finaly crowds picked themselves up, stumbled about in confusion, then coordinated, touched each other—and continued in the same direction as before. Just like wildebeest.\u003c/p\u003e\n\u003cp\u003eBut much closer to us than before.\u003c/p\u003e\n\u003cp\u003eThe floor of the chasm—the foundation material—had heaved itself up as if on the shoulders of a giant, rising almost halfway in the ditch. The great scar was closing. Soon, the chasm would be gone, filed in with Forerunner metal.\u003c/p\u003e\n\u003cp\u003eHere was a force, a presence—a monstrous god if you wil—that could undergo great change, suffer hideous injuries, yet stil heal itself. There was nothing mightier in our lives. Praying to the Halo might not be a bad idea after al.\u003c/p\u003e\n\u003cp\u003eI held out my hands like a shaman, as if to personaly tap into the power of what had just happened. Vinnevra looked at me as if I were crazy.\u003c/p\u003e\n\u003cp\u003eI smiled, but she turned away without a word. There had been no end of fools in her life.\u003c/p\u003e\n\u003cp\u003eWe moved on roughly paralel to the chasm. Vinnevra, puzzling out the failure of her geas, seemed to be trying to find a way around this obstruction. For a few hours, she led us inland, walking this way and that, stopping to pick up and drop pebbles, as if hoping to somehow sense the land. She would shake her head . . . and walk on.\u003c/p\u003e\n\u003cp\u003eThe Lifeshaper had her in thral, no doubt about it.\u003c/p\u003e\n\u003cp\u003eBy noon—the sun a palm-width over the sky bridge directly above us—we had only wandered back in a loop, closer to the chasm, closer again to the edge wal. This time, looking across the chasm, we saw no dust or fog. Visibility was good right up to the wal itself. But that only revealed the futility of her quest.\u003c/p\u003e\n\u003cp\u003eAt the end of the chasm, blocking the flow of the People, a great Forerunner building stuck up from the foundation through a ruckled chaos of rock and crust: a huge, square pilar curving in to lean against the wal, then thrusting high above both the wal and the air itself.\u003c/p\u003e\n\u003cp\u003eThe pilar was about a kilometer square around the base. Clouds obscured its top.\u003c/p\u003e\n\u003cp\u003eI took Vinnevra aside. “Is this our destination?” I asked.\u003c/p\u003e\n\u003cp\u003eShe had a dazed expression, eyes almost blank with the power of her inner drive, and it took some moments for her to stop pacing.\u003c/p\u003e\n\u003cp\u003eGamelpar squatted nearby, racked by coughing. When that stopped, he lifted his eyes toward the wal and slowly shook his head. He was almost worn out.\u003c/p\u003e\n\u003cp\u003eVinnevra suddenly straightened, stuck out her jaw, and walked on at a brisk trot. I caught up with her and tried to flank her. She gave me a sidewise glare.\u003c/p\u003e\n\u003cp\u003e“The old man needs time to rest,” I told her. Her mouth worked without making a sound. Finaly, I took her shoulder and grasped her chin in one hand and swung her about, forcing her to face me.\u003c/p\u003e\n\u003cp\u003eHer eyes went wild and she reached up with clawing hands to scratch my face. I batted her hands aside and held them down. At this, she leaned forward as if to take a bite out of my nose.\u003c/p\u003e\n\u003cp\u003eI dodged her teeth and pushed her back. “Stop that!” I said.\u003c/p\u003e\n\u003cp\u003e“We’re going to wait here for a while. Enough of the geas. You need to find yourself again!”\u003c/p\u003e\n\u003cp\u003eShe swung back and glared, but there were tears in her eyes.\u003c/p\u003e\n\u003cp\u003eStrangely, that look made my own breath hitch in sympathy.\u003c/p\u003e\n\u003cp\u003eThen she spun around and stalked off.\u003c/p\u003e\n\u003cp\u003eGamelpar watched wearily from where he had stopped. “Leave her go,” he caled. “She won’t wander far.”\u003c/p\u003e\n\u003cp\u003eI returned to squat beside him and we observed in silence as the girl moved away to the rim to study the leaning pilar that blocked the chasm.\u003c/p\u003e\n\u003cp\u003e“Is that the Palace of Pain?” I asked the old man.\u003c/p\u003e\n\u003cp\u003e“I never saw the Palace of Pain except from the inside,” he said.\u003c/p\u003e\n\u003cp\u003e“What was it like, inside?”\u003c/p\u003e\n\u003cp\u003eHe hooded his eyes with his hands, as if not to remember.\u003c/p\u003e\n\u003cp\u003e“Anyway, it’s not what she’s looking for,” he concluded. “The People in the ditch must not know where they’re going, either.”\u003c/p\u003e\n\u003cp\u003e“How can you be sure?” I asked.\u003c/p\u003e\n\u003cp\u003eHis face had grayed. “That she has not led us to where we need to be . . . that’s a disappointment.” He rubbed his trembling leg. He was thinking he might not finish the journey.\u003c/p\u003e\n\u003cp\u003eRestless, I walked back to the girl, now standing stiffly a few meters back from the chasm, tossing her head like some lost farm animal.\u003c/p\u003e\n\u003cp\u003eI walked right up to the rim and glanced down at the masses, miling around the base of the monument like so many turbulent pools, raising another great cloud of dust.\u003c/p\u003e\n\u003cp\u003eThen my blood seemed to stop and freeze.\u003c/p\u003e\n\u003cp\u003eThere was something different moving now among the hordes, a kilometer or two away, half-obscured by the dust, hovering over the silent crowds. At first I could not tel whether it was a variety of war sphinx. But the dust raised by tramping feet briefly cleared and I saw a huge, curled-up spider with many legs, nine or ten meters wide, resting on a round disk and floating with insolent majesty above the migration. Sparkling glints shone from the facets of two oval, slanted, widely spaced eyes on the front of its broad, flat head.\u003c/p\u003e\n\u003cp\u003eThe Captive.\u003c/p\u003e\n\u003cp\u003eThe Primordial Vinnevra came up beside me. “Is that . . . ?”\u003c/p\u003e\n\u003cp\u003eFor a moment, I could not say a word—made dumb by the old spirit’s memories: raw fear and the intensely cutting realization that this thing was now free, perhaps in control of the migrations—or at least patiently observing.\u003c/p\u003e\n\u003cp\u003eShe grabbed my arm. “I’ve been taking us toward that one, the Beast, haven’t I? That’s where they’re al going!”\u003c/p\u003e\n\u003cp\u003eA wide gate opened in the base of the leaning monument. Slowly at first, then with steady determination, the crowds began to flow into the gate. Two war sphinxes emerged from the sides to guide and guard them.\u003c/p\u003e\n\u003cp\u003eThe disk carrying the Captive also approached the gate, dipped a little, making the crowds kneel or fal beneath its shadow, then passed through as wel. When it had disappeared into the monument, those who had not been crushed picked themselves up .\u003c/p\u003e\n\u003cp\u003e. . and folowed.\u003c/p\u003e\n\u003cp\u003eVinnevra’s fingers dug into my flesh. I pried them loose. We ran back to where Gamelpar was resting.\u003c/p\u003e\n\u003cp\u003eShe composed herself and knelt beside her grandfather.\u003c/p\u003e\n\u003cp\u003e“We won’t cross the chasm,” she said. “We move inland—and west.”\u003c/p\u003e\n\u003cp\u003eI realized Vinnevra was now using my words for directions. But that hardly seemed to matter. She did not mention the Captive. She wished to spare her grandfather that horror. But our expressions were too stricken, too obvious.\u003c/p\u003e\n\u003cp\u003eI could not avoid meeting his skeptical look.\u003c/p\u003e\n\u003cp\u003e“You’ve seen it, haven’t you?” Gamelpar asked us. “The Beast.\u003c/p\u003e\n\u003cp\u003eIt’s down there.” His face crinkled with remembered terror. “That is a Palace of Pain, isn’t it? And they’re stil being lured inside. . . .”\u003c/p\u003e\n\u003cp\u003eHe could not finish.\u003c/p\u003e\n\u003cp\u003eVinnevra curled up beside the old man and patted his shoulder as he sobbed. I could not stand that, the old man weeping like a child.\u003c/p\u003e\n\u003cp\u003eI wandered off to let them be, then sat and buried my head in my arms and knees.\u003c/p\u003e\n\u003cp\u003eChapter Nine\u003c/p\u003e\n\u003cp\u003eBY TREMENDOUS FORCE of wil, Vinnevra ignored her compulsion and led us away from the chasm, back through the low dry hils and boulders to flat terrain—the direct opposite of where her geas was teling her to go. Gamelpar and I folowed, walking in as straight a line as we could manage toward haphazard foothils like wrinkles in a blanket. Looking up along the low portion of the curve, I saw the\u003c/p\u003e\n\u003cp\u003efoothils push against a sharp range of rocky mountains, al fading into the atmospheric haze about where the great body of water would be. Beyond the haze lay smooth Halo foundation lacking any artificial landscape, climbing for thousands of kilometers until it met a cloud-dotted line drawn perpendicular between the edge wals.\u003c/p\u003e\n\u003cp\u003eBeyond that line, the Halo’s false landscape appeared again, deep green and rich, tantalizing.\u003c/p\u003e\n\u003cp\u003eThe wisdom of simply reversing course did not seem obvious to me, but Gamelpar did not object—and I could think of no reason not to put as much distance as possible between us and the Captive. The girl looked haunted.\u003c/p\u003e\n\u003cp\u003eHer geas, it seems, is not fixed. The Librarian seems to have programmed this wheel with the means to direct and protect her subjects. But who controls the beacons now?\u003c/p\u003e\n\u003cp\u003eI had no answer for the old spirit’s obvious question.\u003c/p\u003e\n\u003cp\u003eWithin a couple of hours, we were walking over irregular sheets of gray, flaky crust, overlaid with a powdery white char that tasted bitter on my tongue—bitter, burnt, nasty. What passed for natural landscape overlying the layer of bedrock, itself little more than a veneer, had been burned away, as if the Gods had decided to drop sheets of fire and destroy anything living.\u003c/p\u003e\n\u003cp\u003eHundreds of meters ahead, blocking our path decisively, jagged sheets of blue-gray foundation material had peeled back, pushing aside the white char and crust and exposing a great gaping wound in the Halo itself.\u003c/p\u003e\n\u003cp\u003eRuin laid over ruin.\u003c/p\u003e\n\u003cp\u003eWe walked around the towering, curling, jagged edges of that hole, pausing once only to peer into a pit at least four or five kilometers across. None of us could speak, looking down through layer after penetrated layer of smashed, ruptured architecture and melted machinery—down many hundreds of meters, to be plugged at the bottom by shapeless black slag.\u003c/p\u003e\n\u003cp\u003eAnd yet—for the Halo, this was but a minor wound, not nearly as large as the great black smear we had seen high up on the sky bridge. Replacing our region of the wheel, our tile, was apparently not necessary. Not yet, at any rate.\u003c/p\u003e\n\u003cp\u003eThe Lord of Admirals had no comment on this destruction, but I could feel a growing impatience and restlessness, his brooding, measuring inteligence gathering strength, waiting for the proper moment to make a difference. I did not know whether to be frightened of him. So many other fears loomed larger.\u003c/p\u003e\n\u003cp\u003eAfter a few hours, we climbed a rough scarp to reach a higher, relatively undisturbed stretch of level land—dirt, rocks, a ridge of granite populated by a few singed and drooping trees—and a smal pond left over from the recent deluge. We paused. Gamelpar dipped his fingers into the pond and tasted the water, then nodded. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-primordium-halo-9/page-9.html","bookId":1632,"creation":"Oct 5, 2019 6:22:08 PM","modification":"Oct 5, 2019 6:22:08 PM"}
