{"id":81039,"no":20,"title":"Page 20","content":"\u003cp\u003e\"Well, yes, but to actually deal with such a person…\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not dealing with him. I am. To tell you the truth, Brinton\u0027s not such a bad sort. His information is usually highly reliable. If a rival clan hired someone to steal the Avylyns\u0027 prisma cutter, the chances are good one of Brinton\u0027s many sources will have heard some rumors to that effect.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like it,\" Sariana stated.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to like it or dislike it. It\u0027s done.\"\u003c/p\u003e\n\u003cp\u003eShe chewed on that for a moment. \"When will you hear from this Brinton?\" she finally asked. Gryph smiled grimly. \"I\u0027m glad you have enough common sense to be able to accept the inevitable. At\u003c/p\u003e\n\u003cp\u003eheart you\u0027re a practical woman. That\u0027s a useful trait. As far as your question goes, I\u0027m not sure when I\u0027ll\u003c/p\u003e\n\u003cp\u003ehear from Brinton. He does things in his own way and in his own time. It shouldn\u0027t take him long to find out if there are any rumors going around about the cutter, though.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to get this matter settled as soon as possible.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m aware of that fact, lady. But you\u0027re going to have to be patient.\" Gryph paused until he had her full attention.\u003c/p\u003e\n\u003cp\u003e\"Unless you\u0027d like to fire me and continue the investigation yourself?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be ridiculous. I wouldn\u0027t know how to conduct such an investigation and I can hardly go to the town guards with this.\"\u003c/p\u003e\n\u003cp\u003e\"Not if you want to keep the matter quiet,\" Gryph agreed blandly.\u003c/p\u003e\n\u003cp\u003eSilence settled on Sariana for a long moment. Gryph could practically hear the thoughts churning in her head. But when she spoke she surprised him with her question.\u003c/p\u003e\n\u003cp\u003e\"Why did Lady Avylyn address you as Lord Chassyn he other morning in my office?\" \"The title is mine by right. I\u0027m a direct descendant of a Prime Family of the Shield class. Our class may\u003c/p\u003e\n\u003cp\u003ebe an insignificant one in your eyes, with no equivalent in the east, but it is a legitimate class here in the west.\"\u003c/p\u003e\n\u003cp\u003eShe looked at him curiously. \"I didn\u0027t mean to offend you.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you?\" Sometimes, Gryph reflected, his future Shieldmate displayed a most amazing talent for annoying him.\u003c/p\u003e\n\u003cp\u003eSariana appeared uncharacteristically contrite. Her apology was gracious and formal. \"I\u0027m sorry if I have offended you or your social class. Please forgive me. All social classes are deserving of respect and equality, just as the social philosophers decreed when they created them. I have been under a certain amount of strain lately. Sometimes I speak before I think.\"\u003c/p\u003e\n\u003cp\u003e\"You ought to watch that, Sariana,\" Gryph couldn\u0027t resist saying.\u003c/p\u003e\n\u003cp\u003eShe frowned. \"Watch what?\"\u003c/p\u003e\n\u003cp\u003e\"Speaking before you think. That\u0027s a western habit. We tend to get emotional about things, you see.\" To his surprise she took the comment seriously. \"I have noticed the tendency.\" \"I\u0027ll bet you have. You couldn\u0027t have lived here for a year and not seen a lot of examples of that\u003c/p\u003e\n\u003cp\u003etendency. We\u0027re a little hot-blooded here in.the west. Also occasionally rash, passionate, and amazingly reckless at times.\"\u003c/p\u003e\n\u003cp\u003eSariana grinned unexpectedly. \"The Avylyns call it artistic temperament. They seem to think it was inevitable, given (he fact that most of the social classes on board The Serendipity had an artistic orientation. Sometimes I\u0027ve wondered if it might be caused partly by your environment. Everything seems very strongly stated here in the west. The climate, the landscape, the plants and animals. Nothing is dull or colorless.\" She glanced at the huge conservatory clock and gave a start. \"I\u0027d better get back to my suite. It\u0027s very late.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll walk you back.\"\u003c/p\u003e\n\u003cp\u003e\"No, no, that\u0027s quite all right,\" she protested quickly. \"I wouldn\u0027t want you to go out of your way.\" \"It\u0027s not out of my way. My suite is in the same wing as yours. Lady Avylyn graciously assigned it to\u003c/p\u003e\n\u003cp\u003eme this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eGryph took some satisfaction from the fact that she couldn\u0027t find anything else to say to that. Sariana, he was learning, was rarely at a loss for words.\u003c/p\u003e\n\u003cp\u003eThey walked in silence down the long gallery of the wing in which their chambers were located. At Sariana\u0027s door they came to a halt and Gryph reached down to touch the hidden spring mechanism. The door opened on its silent hinges and Sariana stepped inside. She started to turn, a polite farewell on her lips, then stopped abruptly as her attention was caught by something inside the room.\u003c/p\u003e\n\u003cp\u003e\"Oh, no!\"\u003c/p\u003e\n\u003cp\u003eGryph was inside the room at once, scanning the interior with a practiced eye. \"What\u0027s wrong?\" \"The scarlet-toe. It\u0027s out of its cage.\" Sariana hurried forward to examine the empty gold cage. The\u003c/p\u003e\n\u003cp\u003etiny door stood open. \"How could it have gotten out? I\u0027ll have to find it. I can\u0027t possibly go to sleep knowing there\u0027s a lizard running around my room.\"\u003c/p\u003e\n\u003cp\u003e\"Scarlet- toes are very clever,\" Gryph remarked. The alert tension that had gripped him when Sariana had cried out in dismay vanished. He took a good look around the room while Sariana darted about anxiously looking in comers and under chairs.\u003c/p\u003e\n\u003cp\u003eThe ornate bed was suspended from the ceiling by four heavy chains in the typical western fashion. It hung a half meter above the floor, but it was impossible to see under it because of the bed drapes.\u003c/p\u003e\n\u003cp\u003eThe walls were painted a warm yellow, the elaborate architectural details picked out in white and gilt. High, arched windows looked out over the gardens toward the river. There was a fine cabinet finished in black enamel and decorated with a flower motif. A couple of suspended chairs and a writing desk completed the basic furnishings. A doorway on the other side of the room led into what Gryph knew would be an ornate bathroom. Westerners loved ornate bathrooms. The wealthier the family, the more exotic the household baths.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to find it,\" Sariana said, glancing inside an empty vase. \"I can\u0027t go to sleep in here unless I know it\u0027s back in its cage. Here, Lucky. Where are you. Lucky?\"\u003c/p\u003e\n\u003cp\u003e\"Scarlet- toes are harmless, Sariana. You don\u0027t have to worry if we don\u0027t find it.\" \"Easy for you to say,\" she muttered as she began to check all the tiny drawers of the writing desk.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not the one who has to sleep in a room with a lizard.\"\u003c/p\u003e\n\u003cp\u003e\"The real danger is to the scarlet-toe,\" Gryph pointed out as he went down on one knee beside the bed and swept aside the drapery. You might accidentally step on it when you got out of bed in the morning.\"\u003c/p\u003e\n\u003cp\u003eSariana groaned and opened another drawer. \"What a horrible thought.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Especially for Lucky.\" Gryph bent down to look beneath the bed and saw the flash of red gems in the shadows. \"Ah, here we are.\"\u003c/p\u003e\n\u003cp\u003eSariana slammed a drawer shut and hurried across the room. \"You found it?\" Gryph settled back on his heel. \"It will be easier for you to catch it than it will be for me. I told you this \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-20.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
