{"id":81022,"no":3,"title":"Page 3","content":"\u003cp\u003e\"I don\u0027t see why,\" Sariana said with a frown. \"Oh, you mean there aren\u0027t any women in their social class except those who marry into it?\"\u003c/p\u003e\n\u003cp\u003e\"Their marriage customs are rather odd,\" Lady Avylyn began awkwardly. \"You see, they - \" She stopped as the other members of the family stared at her. She cleared her throat and waved her fan in a gesture of impatient dismissal. \"Never mind,\" she went on hurriedly. \"It\u0027s rather complicated. Just take our word for it. Shields can be difficult. The last thing one wishes to do is antagonize them.\"\u003c/p\u003e\n\u003cp\u003e\"Shouldn\u0027t you have mentioned that fact when you first told me a Shield might be able to help us get back the prisma cutter?\" Sariana retorted.\u003c/p\u003e\n\u003cp\u003e\"We did tell you that Shields are different,\" Jasso reminded her. He sounded resentful and with good reason. When the plan to engage a Shield had first been proposed, Sariana hadn\u0027t paid much attention to warnings of potential difficulties. \"We explained they walk their own paths and tend to stay on the outskirts of society. They live on the frontiers for the most part. One doesn\u0027t run into one in town very often. Fortunately.\"\u003c/p\u003e\n\u003cp\u003eBryer looked speculatively at the man on the floor. \"But occasionally one finds a Shield useful.\" \"Useful as a mercenary,\" Sariana clarified dryly. \"Let\u0027s all stop snapping at each other. For better or\u003c/p\u003e\n\u003cp\u003eworse, we\u0027ve got our Shield and we managed not to kill him in the process. Barely. We must go forward from here. Our first priority is getting back that prisma cutter, and from everything you have told me, hiring a Shield is our best bet.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure he\u0027s going to consider this a valid employment contract,\" Jasso said skeptically. \"I wonder why he passed out from that tiny drop of hypnotic drug Mara gave him?\"\u003c/p\u003e\n\u003cp\u003e\"Because Shields are different,\" Lady Avylyn said firmly. \"I told you that.\" Sariana was amused more than alarmed by the Avylyns\u0027 conviction that the man on the floor was\u003c/p\u003e\n\u003cp\u003esomehow fundamentally different from other people.\u003c/p\u003e\n\u003cp\u003eSariana eyed her captive. He certainly dressed differently than the members of most of the other social\u003c/p\u003e\n\u003cp\u003eclasses she had encountered in Serendipity. The truth was, she found his strictly styled, close fitting dmk trousers and unadorned long-sleeved shirt something of a relief from all the showy fashions that were popular in the capital city of the western provinces.\u003c/p\u003e\n\u003cp\u003eHe had on a severely cut waist-length jacket instead of the more popular flowing cape, and his boots and belt were made of untooled leather. There was nothing outrageous or ornate about his attire. No gems set in the heels of his boots or tracings of silver on the collar and cuffs of his shirt.\u003c/p\u003e\n\u003cp\u003eAnd no codpiece, Sariana noted with a flash of humor. She found that fact oddly reassuring. The only item of the Shield\u0027s apparel that could be called decorative was the black leather pouch he\u003c/p\u003e\n\u003cp\u003ewore attached to his belt. The pouch itself was made of the practically indestructible hide of the legendary snake cat. Sariana had never actually seen a snake cat, but Luri, the Avylyns\u0027 youngest, had regaled her with hair raising tales of the beasts. Apparently they favored swamplands and could swallow a man in one gulp.\u003c/p\u003e\n\u003cp\u003eSariana had no idea how accurate such tales were, but on the whole she was happy to forego the experience of encountering a live specimen. She wondered if the man on the floor had actually hunted for the leather to be used in his pouch or if he\u0027d bought it.\u003c/p\u003e\n\u003cp\u003eIt was the clasp on the leather pouch that constituted the man\u0027s one item of adornment. But that single item was a major exception. The pouch was sealed and locked with an intricate mechanism fashioned from pure prisma.\u003c/p\u003e\n\u003cp\u003eSariana had learned enough about the jewelry business from the Avylyns to recognize the strange silvery crystal when she saw.it She had also learned something of its value. The clasp on the pouch was worth a fortune. Prisma was the rarest and most expensive of all jewels. The man sprawled on the floor did not look as if he could afford\u003c/p\u003e\n\u003cp\u003esuch an expensive closure for his pouch. Perhaps he\u0027d stolen it.\u003c/p\u003e\n\u003cp\u003e\"My apologies if I offend the Clan,\" Sariana said firmly, \"but to be honest, the man does not appear to be all that dangerous. That\u0027s the problem when one puts too much credence in First Generation myths and legends. One forgets to deal in facts. I see no reason why we can\u0027t continue with our plan just as soon as he wakes up.\"\u003c/p\u003e\n\u003cp\u003eLord Avylyn was troubled. \"Do you really think you can deal with him, Sariana? How are we going to explain what happened in the tavern?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry,\" she assured him confidently. \"I\u0027ll do the talking.\" She glanced again at the black leather kit attached to the Shield\u0027s belt. Something made her very curious about it. On impulse she rose to her feet and strode briskly around the table to where the man lay motionless.\u003c/p\u003e\n\u003cp\u003e\"Sariana!\" Lady Avylyn gasped. \"What are you doing? Don\u0027t touch that.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense. It might be useful to know what the Shield considers valuable enough to decorate with prisma.\" Sariana knelt down beside the man and examined the leather strap that held the pouch to the belt. She put out her hand to undo the fastening and then paused uncertainly. Behind her she could practically hear the others holding their collective bream.\u003c/p\u003e\n\u003cp\u003eUp close like this, the Shield appeared larger and infinitely more solid than he had looked from across the room. A man lying sprawled on his back fooled the eye slightly and looked smaller than he actually was. But now that she was kneeling beside him, Sariana got a whole new perspective. She began to sense why the Avylyns were so wary of the Shield they had captured.\u003c/p\u003e\n\u003cp\u003eThere was a smooth, well-muscled strength in his shoulders and the lines of his thighs were sleek and powerful. He was lean and tough looking, and the arrogant set of his features - even when unconscious only served to emphasize his other hard qualities.\u003c/p\u003e\n\u003cp\u003eSariana realized she was forgetting to breathe. She found herself inexplicably and acutely aware of the man in a way she couldn\u0027t explain. She was suddenly, intensely interested in him. No, it was beyond that. She realized that for some reason she was fascinated by him. If she bad any faith in western tales of goblins and fairies, she might have believed she was under a small spell. But that was a crazy notion.\u003c/p\u003e\n\u003cp\u003eHer fingers hovered above the fastening that held the leather pouch to the Shield\u0027s belt, but she didn\u0027t quite touch the object. Instead she found herself examining the man\u0027s face more closely.\u003c/p\u003e\n\u003cp\u003eHis hair was black, as dark as a midnight sky. He wore it much shorter man the fashionable men in\u003c/p\u003e\n\u003cp\u003etown. Sariana’s gaze moved quickly over his closed eyes. She speculated briefly about their color and decided they would probably be dark. Dark eyes were common on the western continent. Then her gaze went to his sharp nose, took in the well etched but grim shape of his mouth and went on to the hard lines of his jaw. \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-3.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
