{"id":81058,"no":39,"title":"Page 39","content":"\u003cp\u003eSariana\u0027s fingers closed around a hand-carved tray designed to hold stationery. \"Now you speak of finding a wife the way you would talk of choosing fresh fish in the market!\"\u003c/p\u003e\n\u003cp\u003eGryph shook his head. \"Shopping for fresh fish is simpler and more rewarding, believe me.\" It was too much. Sariana lost the last shreds of her self-control. She hurled the stationery tray at\u003c/p\u003e\n\u003cp\u003eGryph\u0027s head.\u003c/p\u003e\n\u003cp\u003eHe saw it coming but he didn\u0027t bother to duck. It was as if he took one look at its trajectory and knew it would miss him by a few centimeters. When it smashed against the wall behind him and fell harmlessly to the floor he took another swallow of wine.\u003c/p\u003e\n\u003cp\u003e\"Get out of here,\" Sariana shouted, snatching up a writing instrument and flinging it at him. He reached out and casually snatched it out of midair.\u003c/p\u003e\n\u003cp\u003e\"There are a few things I have to tell you first,\" Gryph said quietly.\u003c/p\u003e\n\u003cp\u003e\" I don\u0027t want to hear them.\" Her fingers touched another object and she lifted it unthinkingly. \"Leave me alone.\"\u003c/p\u003e\n\u003cp\u003eGryph eyed the sharp point on the message packet opener. \"You and I are leaving at dawn tomorrow. Pack only the basics. We can\u0027t carry a lot of luggage.\"\u003c/p\u003e\n\u003cp\u003e\"If you think I\u0027m going anywhere with you you\u0027re out of your mind.\" She threw the packet opener, only realizing the potential danger of the blade after it had left her hand. Her eyes widened in horror as the knifelike utensil whipped across the room in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eWith a lazy movement that seemed to take place almost in slow motion, Gryph brought the jacket he\u0027d slung over his shoulder down to a point just below his belt buckle. The packet opener slammed into the tough material of the jacket and lodged there. Gryph glanced down at where the blade would have struck had it not met the jacket first.\u003c/p\u003e\n\u003cp\u003e\"I can see where a codpiece might be a useful fashion item on certain occasions,\" he observed. Sariana was shocked by her own act of violence. It jolted her back to reality. \"What have you done to\u003c/p\u003e\n\u003cp\u003eme?\" she asked in a dazed voice. \"It\u0027s because of you I\u0027m acting this way. I\u0027ve lost my self-control.\"\u003c/p\u003e\n\u003cp\u003e\"Relax, Sariana. Everyone does occasionally. It\u0027s nothing to get alarmed about.\" She stumbled away from the desk and sank into the nearest chair. \"Please leave,\" she said stiffly. \"Don\u0027t you want to know more about our trip?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going anywhere with you.\"\u003c/p\u003e\n\u003cp\u003eHe ignored that and continued to lounge against the hospitality table while he swirled the wine in his glass. \"As far as everyone else is concerned, it will be a traditional wedding journey. I\u0027ll be taking you home to introduce you to my clan. It\u0027s expected. No one will question it.\"\u003c/p\u003e\n\u003cp\u003eSomething in his voice broke through Sariana\u0027s emotional daze. \"You speak as if this stupid journey you\u0027re planning has another purpose besides ensuring my humiliation.\"\u003c/p\u003e\n\u003cp\u003e\"It does. You and I are going to find the Avylyns\u0027 precious prisma cutter.\"\u003c/p\u003e\n\u003cp\u003eShe looked up, startled.\u003c/p\u003e\n\u003cp\u003eGryph smiled evenly. \"I thought that might get your attention.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you continue to concern yourself with the cutter?\"\u003c/p\u003e\n\u003cp\u003eGryph finished the last of the wine and set the glass down. \"As I told the Avylyns this morning, the cutter has become Shield business. It must be found.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand you, Gryph.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" He started toward the door. \"And there is much about you that I don\u0027t understand. But we\u0027ll both have plenty of time to get to know each other on our wedding journey. Be ready at dawn, Sariana.\" He opened the door and closed it behind him.\u003c/p\u003e\n\u003cp\u003eSariana plucked the scarlet-toe off her shoulder and cradled it gently in her palms. The lizard gazed up at her with its unwinking, jeweled eyes.\u003c/p\u003e\n\u003cp\u003e\"If he thinks I\u0027ll tamely jump to his beck and call, he is in for a surprise,\" she informed the lizard. \"You and I are indeed going on a journey tonight, but not with Gryph Chassyn. We are going to escape this madhouse.\"\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eSariana crouched behind a row of stacked wine casks in a dockside warehouse and decided she was learning far too much about fear lately. It seemed to her that she had been forced to deal with one overpowering wave of emotion after another during the past few hours. Life had become terrifyingly irrational and dangerous for a young woman who had always assumed she knew what she wanted and how she was going to get it. Nothing was certain any longer.\u003c/p\u003e\n\u003cp\u003eA tiny hissing sound in Sariana\u0027s ear warned her that the scarlet-toe was picking up on her anxiety. Automatically Sariana touched the lizard in a light, soothing gesture. The scarlet-toe hissed again, the sound so soft it didn\u0027t cany beyond the range of Sariana\u0027s hearing.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your fault we\u0027re in here,\" Sariana muttered softly. It was true. It had been the lizard\u0027s insistent hissing that had first alerted her to the fact that she was being followed. She had assumed in the beginning that it was Gryph trailing her through the streets of Serendipity down to the wharf and she had been angered as well as nervous. She hated the feeling of being hunted.\u003c/p\u003e\n\u003cp\u003eBut a few minutes ago she had realized her pursuer was not Gryph. She didn\u0027t know how she could be so certain of that but she was. She would know if it was Gryph closing in on her. There was another hunter on her trail tonight.\u003c/p\u003e\n\u003cp\u003eSariana had left the Avylyn household an hour before dawn, carrying as many clothes and personal belongings as she could manage in two large travel pouches slung from her shoulders. The scarlet-toe had been perched on the shoulder of her cloak.\u003c/p\u003e\n\u003cp\u003eA lingering sense of duty had forced her to pause long enough to write out a series of instructions regarding the Avylyn household and business finances. She could only hope the Avylyns would have the sense to follow them in her absence.\u003c/p\u003e\n\u003cp\u003eIntent on making her way to the wharf where she would be able to book passage on one of the fast little windriggers that plied the coastal waters, Sariana had hurried through the dark streets.\u003c/p\u003e\n\u003cp\u003eThe realization that someone was following her had hit just as she had reached the deserted warehouse area near the docks. The scarlet-toe had become increasingly agitated and Sariana, who had at first been furious that Gryph had followed her, had begun to feel a trickle of fear along her spine.\u003c/p\u003e\n\u003cp\u003eIt was then she had decided that it couldn\u0027t be Gryph. She felt a lot of things around Chassyn, but she had never known that kind of fear.\u003c/p\u003e\n\u003cp\u003eShe had quickened her pace until she was moving as fast as she could with the weight of the overloaded travel pouches. Anxiously she had glanced down the street, hoping to see an early rising sailor or dockworker or guard. There had been no one in sight.\u003c/p\u003e\n\u003cp\u003eThere was no one visible behind her, either, but Sariana had no doubt the hunter was somewhere in the shadows. \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-39.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
