{"id":81074,"no":55,"title":"Page 55","content":"\u003cp\u003eDelek frowned. \"It\u0027s not necessary for you to leave us, my dear.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, smiling slightly. \"I think Gryph would be more comfortable if I went inside. I\u0027ll see you both later.\" She walked through the garden, the skirts of her yellow gown lightly brushing the heads of some of Delek\u0027s beautiful flowers.\u003c/p\u003e\n\u003cp\u003eGryph saw the expression on Delek\u0027s face as Alana left. Love and pride and quiet satisfaction were clearly evident. Gryph raised his glass of ale.\u003c/p\u003e\n\u003cp\u003e\"To your lady,\" he said formally.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll drink to that.\" Delek took a long swallow from his own glass. \"Now, let\u0027s get the business over with. Tell me what brings you so unexpectedly to Little Chance.\"\u003c/p\u003e\n\u003cp\u003eGryph put his glass down and leaned forward, resting his elbows on his thighs. \"I think someone has found a crystal ship, Delek.\"\u003c/p\u003e\n\u003cp\u003eDelek stared at him. \"There hasn\u0027t been a ship found for over fifty years.\"\u003c/p\u003e\n\u003cp\u003e\"I know. But someone has stolen a prisma cutter. Two men have died because of that cutter. One of those men was an informant I occasionally use in Serendipity. Before he died he told me there were rumors of the cutter being taken north to Little Chance. Little Chance is the last town before one heads into the region that contains the Gorge of Storms.\"\u003c/p\u003e\n\u003cp\u003eDelek sat forward, watching Gryph carefully. \"The last few crystal ships were found in the gorge.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"Shields searched the region thoroughly after they neutralized those ships to determine if there might be any more.\"\u003c/p\u003e\n\u003cp\u003e\"That was over fifty years ago. It\u0027s possible a ship was missed.\"\u003c/p\u003e\n\u003cp\u003eDelek nodded slowly. \"Possible. Not probable, but possible. The terrain of the gorge is tricky. The rock formations there can conceal prisma rays. Have you sent word to the frontier towns?\"\u003c/p\u003e\n\u003cp\u003e\"No. I haven\u0027t dared. For one thing, I don\u0027t think I have enough time to get a message to the borders and wait for the arrival of other Shields. For another, I\u0027d have to trust the message to someone outside our class and I can\u0027t do that.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003eGryph sighed. \"Because,\" he said carefully, \"I think there\u0027s a rogue behind all this.\"\u003c/p\u003e\n\u003cp\u003eDelek stared at him. \"Are you certain?\"\u003c/p\u003e\n\u003cp\u003e\"No. But my informant, the one who died, thought there was a Shield involved. Brinton\u0027s information\u003c/p\u003e\n\u003cp\u003ewas invariably accurate.\"\u003c/p\u003e\n\u003cp\u003e\"I see your problem,\" Delek said. \"This is truly Shield business, then. The possibility of another prisma crystal ship having been found is bad enough. But if a Shield has gone rogue, we\u0027re all in very serious trouble. Remember Targyn?\"\u003c/p\u003e\n\u003cp\u003e\"I remember.\" Gryph gazed at the flowers around him, remembering the tale he had once told Luri. \"Luckily he\u0027s become pure legend.\"\u003c/p\u003e\n\u003cp\u003e\"Had he lived, he would have been a very dangerous man,\" Delek said. \"He had delusions of grandeur, I\u0027m afraid. He dreamed of controlling prisma, you know. He wanted to test the old theories. He used to talk about it all the time. When no one supported his ideas he started spending more and more time alone in the mountains hunting bandits all by himself. He was crazy. No doubt about it. A real rogue Shield. Everyone was relieved when he met a glorious end. Saved us from having to send someone into the mountains to take care of him.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t remind me,\" Gryph muttered. \"I got the impression I might have been elected to do the job.\" \"Oh, no doubt about it,\" Delek assured him cheerfully, \"There aren\u0027t many men who could have taken\u003c/p\u003e\n\u003cp\u003eTargyn. You\u0027re one of the few who might have been able to do it. He was good. Damn good.\"\u003c/p\u003e\n\u003cp\u003e\"Luckily for the Targyn passed into legend all by himself.\" Gryph paused, thinking. \"Is there any other Shield in the area right now?\"\u003c/p\u003e\n\u003cp\u003e\"Not as far as I know. There haven\u0027t been many Shields through Little Chance during the past few months. No reason. Their work is out on the frontier and if they\u0027re looking for wives, they usually head for Serendipity or one of the bigger towns to the south.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t find anyone in Serendipity and I haven\u0027t got time to-search any other towns along the way.\" \"I\u0027ll come with you,\" Delek said flatly. \"I may not be of much use because of this game leg, but it looks like I\u0027m all\u003c/p\u003e\n\u003cp\u003eyou\u0027ve got in the way of backup. I assume you\u0027re going into the gorge?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the only lead I\u0027ve got. But I\u0027ve given this some thought, Delek. I\u0027ve decided it would be better if you took care of contacting the frontier clans. You know as well as I do that it has to be done in person. We can\u0027t take the risk of letting outsiders know a Shield may have gone rogue.\"\u003c/p\u003e\n\u003cp\u003eDelek nodded. \"We\u0027ll have to take care of everything ourselves. I\u0027ll leave at once. It will take a few days, even with the fastest dragonponies.\"\u003c/p\u003e\n\u003cp\u003e\"Good. We\u0027ll leave for the gorge this afternoon.\"\u003c/p\u003e\n\u003cp\u003e\"We?\" Delek asked quickly.\u003c/p\u003e\n\u003cp\u003eGryph permitted himself a small, satisfied grin. He lifted his glass. \"Congratulate me, Delek. I\u0027ve found a Shield-mate.\"\u003c/p\u003e\n\u003cp\u003eDelek smiled and raised his glass. \"A cause for congratulations, indeed. Your clan will be pleased. What is your wife\u0027s name?\"\u003c/p\u003e\n\u003cp\u003e\"Sariana Dayne. She\u0027s from the eastern provinces.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" Delek mused. \"I have not heard of any mates being found among the women of the east, but I suppose it\u0027s reasonable to assume there are some potential Shieldmates there. That should be good news to the clans.\"\u003c/p\u003e\n\u003cp\u003e\"There are some complications with an eastern Shield-male,\" Gryph admitted.\u003c/p\u003e\n\u003cp\u003e\"Such as?\"\u003c/p\u003e\n\u003cp\u003e\"As far as she\u0027s concerned, the First Generation Pact between Shields and the colonists doesn\u0027t apply to her. After all, her people did not make any treaty with the Shields.\"\u003c/p\u003e\n\u003cp\u003eDelek gaped at him in amazement. \"By the Lightstorm, Gryph, I hadn\u0027t thought about that. She\u0027s right.\" Delek grinned slowly, a very feral smile that reminded Gryph of the hunter Delek had once been. \"But by the same token, she is not protected by the Pact.\"\u003c/p\u003e\n\u003cp\u003e\"Nevertheless,\" Gryph stated proudly, \"I followed the rules.\" \"But did she know the rules before you took her to bed?\" Delek asked slyly. \"Things were rather confused that night,\" Gryph admitted. \"There wasn\u0027t time or opportunity to give\u003c/p\u003e\n\u003cp\u003eher an education on the history of Shields and colonists.\"\u003c/p\u003e\n\u003cp\u003eDelek roared with laughter and slapped his thigh. \"I\u0027ll just bet there wasn\u0027t time. Did she open your kit\u003c/p\u003e\n\u003cp\u003ethe next morning?\"\u003c/p\u003e\n\u003cp\u003e\"Easily.\" Gryph smiled with pride. \"As easily as if she were a Shield trained in working prisma and had her own kit. It was amazing.\"\u003c/p\u003e\n\u003cp\u003e\"What does she think of this whole affair?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-55.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
