{"id":81103,"no":86,"title":"Page 86","content":"\u003cp\u003ethe crystal effortlessly. It was made of a metal that closely resembled the metal lining the surrounding corridors and chambers.\u003c/p\u003e\n\u003cp\u003e\"Lately I\u0027ve learned that trouble can come from some very unexpected sources,\" Gryph said as she handed the cutter to him. He also took Sariana\u0027s hand and started quickly for the corridor.\u003c/p\u003e\n\u003cp\u003e\"What about your weapon kit?\" Sariana thought to ask.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to make another one. Targyn got rid of mine. No telling where it is.\" \"Can you make another one?\" she asked in surprise. They were approaching the three bodies in the\u003c/p\u003e\n\u003cp\u003ecorridor.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Gryph said as he paused beside Targyn\u0027s body. \"I\u0027ll just take Targyn\u0027s kit. He won\u0027t be needing it any more and I\u0027ve got better things to do than hunt down another snake cat. I\u0027ll need a new piece of prisma, but that won\u0027t be any problem, will it? There\u0027s a whole roomful of it back in that chamber.\"\u003c/p\u003e\n\u003cp\u003e\"That brings up a very interesting question,\" Sariana said as the thought struck her. \"Who owns the prisma?\"\u003c/p\u003e\n\u003cp\u003e\"By law it belongs to the Shields. To tell you the truth, it\u0027s been so long since any was found, I\u0027m not sure what the procedure is for selling it to the jewelers and artisans who use it.\"\u003c/p\u003e\n\u003cp\u003eThey made their way through the alien installation without any trouble. Gryph retrieved his boots on the way down one of the corridors. When they reached the entrance he examined the traps that had been set there for a few moments. He looked thoughtful but he said nothing.\u003c/p\u003e\n\u003cp\u003eLucky appeared from a pocket as soon as Sariana stepped into the open. The lizard scrambled up to her shoulder and surveyed the world with satisfaction. Obviously it had not enjoyed the recent ventures.\u003c/p\u003e\n\u003cp\u003eAs they started down the tumble of rocks and boulders that shielded the entrance to the cavern, Sariana remembered the river sled.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid it\u0027s going to be a long walk back to Little Chance, Gryph,\" she said unhappily.\u003c/p\u003e\n\u003cp\u003e\"Ah, yes, your accident with the sled. Where did you leave it?\"\u003c/p\u003e\n\u003cp\u003e\"It left me a couple of kilometers downstream. I must say, it wasn\u0027t a very good river sled.\" \"Are you kidding?\" Gryph asked. \"It\u0027s the best there is. Cost me a small fortune to rent it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it bounced all over the water when it hit the first few rapids.\"\u003c/p\u003e\n\u003cp\u003e\"You tried to steer through the rapids?\" he demanded, glaring at her.\u003c/p\u003e\n\u003cp\u003e\"What was I supposed to do? Get out and walk?\"\u003c/p\u003e\n\u003cp\u003e\"Damn right. Just as soon as the water turned rough. You\u0027ve had no experience taking a sled through rapids. Why didn\u0027t you put the sled ashore and continue on foot?\" Gryph blinked at his own words. \"What am I saying? That\u0027s not the question I should be asking. The one that needs asking is why didn\u0027t you head straight back to Little Chance?\"\u003c/p\u003e\n\u003cp\u003eSariana lifted the hem of her skirt so it wouldn\u0027t get caught in some thorny brush. \"You know why I didn\u0027t go straight back to Little Chance, Gryph.\"\u003c/p\u003e\n\u003cp\u003eHe was silent for a few seconds and then he stopped for a moment, wrapped his hand around her neck and tugged her close for a hard, possessive kiss. When he released her Sariana\u0027s lips felt slightly bruised. She looked up into his glittering eyes.\u003c/p\u003e\n\u003cp\u003e\"I know why,\" Gryph admitted so softly Sariana could hardly hear the words. \"You and I, we share something very special, don\u0027t we?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve come to the conclusion that we do.\" Sariana smiled tremulously.\u003c/p\u003e\n\u003cp\u003eThey found the sled a short time later. Gryph hauled it out of the water and proceeded to survey the damage. He grumbled a lot about inexperienced river sled pilots and made several comments on the nature of luck and women and then he got the craft running.\u003c/p\u003e\n\u003cp\u003e\"You westerners are so clever,\" Sariana said with amused admiration as they floated into the middle of the river.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad to see you\u0027re finally able to acknowledge a little of the local talent,\" Gryph muttered as he expertly set the sled skipping downstream.\u003c/p\u003e\n\u003cp\u003eWhen the late afternoon shadows descended, Gryph chose a small, protected cove in which to set up camp. He had become quieter and quieter as the day wore on. Sariana knew he was anxious to get back to Little Chance to see if Delek had returned with the other Shields.\u003c/p\u003e\n\u003cp\u003eThe storage lockers of the small sled had survived the encounter with the rapids. The food supplies were intact, and as she set about fixing dinner over the fire Gryph had built, Sariana realized she was very hungry. She served the simple meal in silence.\u003c/p\u003e\n\u003cp\u003eGryph accepted his plate with moody concentration. Sariana watched as he methodically ate his food. There was no flicker of awareness in her head. Whatever he was thinking, Gryph was obviously determined to keep it to himself.\u003c/p\u003e\n\u003cp\u003eA short time later, Sariana undressed down to her chemise and slid under the travel quilt Gryph had spread out on the deck. Gryph was already under it, his arms folded behind his head, his gaze fixed on the narrow patch of stars overhead. She reached out to touch him gently.\u003c/p\u003e\n\u003cp\u003e\"Gryph? Is something wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been thinking.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know,\" Sariana said gently. \"But I don\u0027t know what you\u0027re thinking. I\u0027ve been trying to read your mind all evening. It looks like you\u0027re right. The link doesn\u0027t work unless one of us is trying to project. It\u0027s very frustrating at times.\"\u003c/p\u003e\n\u003cp\u003eHe continued to gaze resolutely at the stars. \"I was thinking about us. You and me. Our marriage.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been right all along.\" There was a note of grudging respect in his voice. \"I\u0027ve been very arrogant. It probably wasn\u0027t fair to marry you the way I did.\"\u003c/p\u003e\n\u003cp\u003e\"An interesting admission for a Shield,\" Sariana said dryly. \"What brought you to that conclusion?\" \"I\u0027m not sure,\" he said honestly. \"But I\u0027ve been thinking about it this afternoon and I\u0027ve decided there\u0027s\u003c/p\u003e\n\u003cp\u003eonly one honorable thing for me to do.\"\u003c/p\u003e\n\u003cp\u003eSariana held her breath. \"What\u0027s that?\u0027\u003c/p\u003e\n\u003cp\u003eHe sat up without any warning. The quilt fell to his waist and faint starlight played on his broad shoulders. The same light also highlighted the proud planes of his face. \"You have a right to choose, Sariana,\" he declared. \"If you really want to go home to Rendezvous and become an executive in your clan\u0027s firm, I have no right to stop you.\"\u003c/p\u003e\n\u003cp\u003eSariana probed silently for an accompanying mental image that would tell her he meant what he was saying. But it was useless. Gryph was definitely not projecting. It occurred to her that as they had both become more proficient at communicating, they also seemed to have learned some skills that guarded their privacy.\u003c/p\u003e\n\u003cp\u003e\"I see,\" said Sariana, \"that\u0027s certainly very noble and generous of you. I know how you westerners tend to assume that your ways are the only acceptable ways.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-86.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
