{"id":81108,"no":91,"title":"Page 91","content":"\u003cp\u003eGryph nearly dropped his fork. \"Sariana, that\u0027s impossible. I\u0027ve explained to you that Shields only produce male offspring.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know,\" she agreed soothingly, \"but something tells me that\u0027s another thing that\u0027s going to start changing on Windarra.\"\u003c/p\u003e\n\u003cp\u003eGryph shook his head, perplexed. \"What makes you say that?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" she told him honestly. \"Lately I haven\u0027t always understood how I know some of the things I know. But it\u0027s occurred to me that this planet may be changing all of us in small, subtle ways.\" She reached up to stroke the lizard on her shoulder. \"Take this matter of women turning lizards into pets and krellcats having an affinity for human males. Even in the eastern provinces it\u0027s become fashionable in recent years for men and women to keep some odd pets. I never had one because I was always studying so hard, but I knew people who did have them. And there was something strange about the relationship, Gryph, just as there\u0027s something different about the relationship scarlet-toes and krellcats have with westerners. It\u0027s not a normal people-pet relationship.\"\u003c/p\u003e\n\u003cp\u003e\"So scarlet-toes and krellcats are a little different. So what?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure,\" Sariana said, frowning intently as their food arrived, \"but I\u0027ve been thinking about it and there are some other matters which seem to indicate slight changes taking place.\"\u003c/p\u003e\n\u003cp\u003e\"Such as?\"\u003c/p\u003e\n\u003cp\u003e\"How about the matter of a Shield learning to use his mind as a weapon? Both you and Targyn achieved that dubious distinction. Is there any indication that any of your ancestors had that ability?\"\u003c/p\u003e\n\u003cp\u003e\"Well, no, but - \"\u003c/p\u003e\n\u003cp\u003e\"And what about you and me?\" she continued forcefully. \"You\u0027ve said yourself that, our link is unusual in many ways.\"\u003c/p\u003e\n\u003cp\u003e\"Sariana,\" Gryph said grandly, \"you would be an unusual wife on any planet in the universe. I strongly suspect you\u0027re totally unique. I don\u0027t know of another woman on the face of the planet who could have convinced me to let Etion Rakken\u0027s bank handle the prisma transactions.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t change the subject. There are some other matters I\u0027ve been thinking about.\"\u003c/p\u003e\n\u003cp\u003e\"Such as?\" Gryph leaned back, resigned.\u003c/p\u003e\n\u003cp\u003e\"It has occurred to me that your ancestors were ordinary men who showed a slight potential for some form of mental ability. The scientists found a way to strengthen part of that potential by injecting those men with some chemical. Originally everyone assumed the result would be a sterile group of Shields.\"\u003c/p\u003e\n\u003cp\u003e\"So?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve wondered if all that really happened is that those scientists simply speeded up what might be a perfectly normal development process that\u0027s going on in humans already. It might be a long-range trend that would, under normal conditions, take thousands of years to impact an entire population. The scientists who worked on your ancestors concentrated on one small element of that potential, the element they could use as a shield against prisma rays. But who knows how far that basic potential can go?\u003c/p\u003e\n\u003cp\u003eMaybe the environment of Windarra somehow encourages development of that kind of mental ability in human beings.\"\u003c/p\u003e\n\u003cp\u003eGlyph shook his head in indulgent amusement. \"What makes you say that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been wondering why that huge prisma ship was left here. You\u0027ve said yourself there\u0027s no record of such a large one being found before.\"\u003c/p\u003e\n\u003cp\u003e\"The records could be wrong, you know. Don\u0027t forget my people have been out of touch with their home world as long as yours have been from theirs. We don\u0027t know what\u0027s been happening with prisma elsewhere.\"\u003c/p\u003e\n\u003cp\u003e\"True. But isn\u0027t it just possible Windarra was special in some way? Perhaps it made a particularly good storage planet for mind weapons because there\u0027s something in the environment here that favors that kind of development.\"\u003c/p\u003e\n\u003cp\u003e\"Close your lovely mouth and eat your food, my love. Pregnancy is obviously affecting your usually admirable reasoning powers.\"\u003c/p\u003e\n\u003cp\u003eShe tilted her head and looked at him. \"Are you going to spend the rest of your life telling me to shut up?\"\u003c/p\u003e\n\u003cp\u003e\"Are you kidding? If I devoted my time to a job that size I\u0027d never get anything else done. Now eat up, sweetheart. You need your nourishment.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Gryph.\"\u003c/p\u003e\n\u003cp\u003eTwo months later little Gryphina Chassyn was born and the entire Shield class went into shock. Births were always an important event, but the birth of a female Shield was unheard of. Sariana and her baby had so many visitors Gryph was forced to hire extra household attendants just to handle the flow.\u003c/p\u003e\n\u003cp\u003eAny doubts about the child\u0027s parentage on the paternal side were immediately put to rest when visitors got a good look at the infant. Gryphina had brilliant blue-green eyes; Shield eyes. She also had her father\u0027s dark hair.\u003c/p\u003e\n\u003cp\u003eEven if some had questioned the coincidence of hair and eye color, no one could doubt the strength of the bond between Gryph and Sariana. It was obvious to everyone that Gryph was claiming his daughter. He would have been just as certain of that even if she hadn\u0027t had his eyes and hair. He knew her mother too well and too intimately. The bond between Sariana and Gryph was stronger than prisma.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m exhausted,\" Gryph had announced a few hours after the birth as he sat on his wife\u0027s bed, holding his new daughter. \"I had no idea it was going to be that rough. And you deliberately blocked most of it from me, didn\u0027t you? I know you were fighting to keep from projecting. I told you to share it with me. As usual, you didn\u0027t follow orders very well.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know,\" Sariana admitted. \"But some things a woman likes to do on her own. Didn\u0027t you get enough of a taste of it there toward the end?\" she added with a tired but saucy grin. \"By that point I had lost all my noble, womanly fortitude. I seem to recall thinking you deserved a sample of what it was like.\"\u003c/p\u003e\n\u003cp\u003eGryph laughed. \"You\u0027re right. That bit at the end was about all I could take. It was worth it though,\" he added as he played with one tiny little fist. \"She\u0027s as beautiful as you are.\"\u003c/p\u003e\n\u003cp\u003e\"I know it was sort of a shock for you, Gryph.\"\u003c/p\u003e\n\u003cp\u003e\"That we have a little girl? I should have known you would prove as unpredictable in the matter of making babies as you have in everything else. But what does it mean? Why us? Why now? Maybe you were right when you said that this planet was making some changes in all of us.\"\u003c/p\u003e\n\u003cp\u003eSariana smiled at him, love in her eyes. \"It doesn\u0027t matter as long as we\u0027ll be together to face those changes.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, we\u0027ll be together,\" Gryph assured her with the arrogant, unswerving conviction of a Shield. \"You can count on it.\"\u003c/p\u003e\n\u003cp\u003e\"Word of a Shield?\" she teased softly.\u003c/p\u003e\n\u003cp\u003e\"The word of a Shield in love,\" he clarified as he bent down to kiss her with infinite tenderness. \u003c/p\u003e","sourceLink":"https://allnovel.net/shield-s-lady-lost-colony-3/page-91.html","bookId":1801,"creation":"Oct 5, 2019 4:33:09 PM","modification":"Oct 5, 2019 4:33:09 PM"}
