{"id":103541,"no":13,"title":"Page 13","content":"\u003cp\u003eThe hand mirror. The one he\u0027d forced her to clean up.\u003c/p\u003e\n\u003cp\u003eShe\u0027d taken the heavy silver-plated frame and hammered it against the equally heavy hairbrush handle to chisel away the bottom pins of the shutters. Yes, they were locked. Yes, they were thick.\u003c/p\u003e\n\u003cp\u003eBut now they opened from the bottom.\u003c/p\u003e\n\u003cp\u003eHe stormed from the room bellowing, \"Liam, saddle up my horse.\"\u003c/p\u003e\n\u003cp\u003eJust then, Liam lurched inside from the stable, eyes unfocused, hand on his head. \"She\u0027s - \"\u003c/p\u003e\n\u003cp\u003e\"Aye, I know,\" Court snapped, shoving his pistol in his trouser waist. As he rushed to saddle his mount, he thought about the scene in her room. He\u0027d never forget it for all his days. She\u0027d propped up her battered tools, carefully arranging them, to let him know the extent of her trickery. Gloating...\u003c/p\u003e\n\u003cp\u003eSince there was only one route back to Pascal\u0027s, Court knew how to follow. But she must\u0027ve ridden like hell was at her heels, because he didn\u0027t catch up with her for nearly half an hour. Just as he got his first glimpse of her, she disappeared. Once he rode to the spot where he\u0027d last seen her, he understood why and didn\u0027t even have time to tense before he and his horse went charging down a steep drop-off covered in slate. She\u0027d taken it without even pausing.\u003c/p\u003e\n\u003cp\u003eEven now, toward the bottom, she hadn\u0027t slowed her breakneck pace. Daft woman! His own horse was having difficulty flying down the terrain. He could hear the hooves fracturing the stone.\u003c/p\u003e\n\u003cp\u003eAfter this, the land twisted into canyons and wider coulees, and soon he was able to pull alongside her, yet every time he neared she veered away. Her riding was impressive, but in the end it was only a matter of time. His hand shot out to snag her reins, and in seconds he had them stopped and her swooped from her horse.\u003c/p\u003e\n\u003cp\u003e\"Let - me - go!\" She slapped at him, sounding like she was on the verge of real violence. Which she\u0027d proved she didn\u0027t mind using.\u003c/p\u003e\n\u003cp\u003e\"Riding like this at night?\" He set her down but took her shoulders. \"On slate? You\u0027re lucky you dinna break your neck.\"\u003c/p\u003e\n\u003cp\u003e\"You rode like that, too. Yet I\u0027m the one who\u0027s supposed to be considered fortunate?\"\u003c/p\u003e\n\u003cp\u003eHis hands tightened on her. \"Why will you no\u0027 listen to reason, lass? Your brother\u0027s gone and you\u0027d sacrifice yourself for nothing. If you\u0027d cooperate with me, I\u0027ll get you to safety. You ken we will no\u0027 hurt you.\"\u003c/p\u003e\n\u003cp\u003eShe narrowed her eyes accusingly. In the stark moonlight he could clearly see the abraded skin on her chin.\u003c/p\u003e\n\u003cp\u003e\"That will no\u0027 happen again,\" he said, but she still fought to break his grip.\u003c/p\u003e\n\u003cp\u003eShe kicked out, connecting with his leg, too high and too close for comfort. \"Annal¨ªa, do you want a graphic lesson on exactly why it is you should no\u0027 kick a man like that?\" Bloody hell if she didn\u0027t do it again and closer. \"One more time and I swear tae you I\u0027ll snatch up your skirts and turn you over - \" He went silent, and drew her to him, her back to his chest, covering her mouth with his hand. A sound nearby put him on edge.\u003c/p\u003e\n\u003cp\u003eHer teeth found his skin, of course, sinking deep, and he clenched his jaw. Something rustled in the bushes, getting closer. \"Who\u0027s out there?\" he called, as he pulled his pistol free.\u003c/p\u003e\n\u003cp\u003eAfter several tense moments, they heard, \"We\u0027re here to return Annal¨ªa Llorente to Pascal.\"\u003c/p\u003e\n\u003cp\u003e\"My arse,\" he muttered, cocking his gun. Had to be the Rechazados. No one else could have found them here. \"Listen to me, Anna. These men are no\u0027 here to collect you - they\u0027re the Rechazados. Have you heard of them?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, releasing her teeth.\u003c/p\u003e\n\u003cp\u003e\"So you know they\u0027re assassins, no\u0027 escorts. Now will you cooperate with me?\"\u003c/p\u003e\n\u003cp\u003eShe said a muffled, \"Yes.\"\u003c/p\u003e\n\u003cp\u003eHe eased his hand away, shaking it to regain some feeling in the skin she\u0027d chewed. \"Now we need to get - \"\u003c/p\u003e\n\u003cp\u003e\"Help me!\" she screamed, lunging forward when he caught her waist. \"I\u0027ve been captured!\"\u003c/p\u003e\n\u003cp\u003eOne shot rang out, the sound blasting through the arroyo like a cannon, then more rained down, pitting the earth all around them. Court shoved her behind him, keeping his grip on her wrist as he fired twice.\u003c/p\u003e\n\u003cp\u003eToo many of them. Too close. He clasped her in his arms and dove behind a hill.\u003c/p\u003e\n\u003cp\u003eThe horses shrieked and reared, galloping away. Bloody hell. His ammunition was in his saddlebag.\u003c/p\u003e\n\u003cp\u003e\"Help me!\" she screamed again, struggling against his grip.\u003c/p\u003e\n\u003cp\u003e\"Shut your mouth, woman. They\u0027re shooting at us, and you want to give them a bead?\"\u003c/p\u003e\n\u003cp\u003e\"They aren\u0027t shooting at me - they\u0027re shooting at you!\"\u003c/p\u003e\n\u003cp\u003e\"Those are Pascal\u0027s killers, and they are no\u0027 very discriminating.\" She still resisted, though he\u0027d brought her hard against him, her back to his chest. \"Now they\u0027ll hear the shots back at the lodge and ride out, but we\u0027ve got to be smart until then. Understand?\" he demanded. \"If you want to live, you\u0027ll do what I say or I swear to you, you\u0027ll have a bullet in your brain within a quarter hour.\"\u003c/p\u003e\n\u003cp\u003eShe sounded like she\u0027d started crying.\u003c/p\u003e\n\u003cp\u003eHis brows drew together. \"Are you...are you afraid?\" he asked, half baffled, having no idea what to do with this. He felt her nodding shakily against his chest and realized the lass was probably scared to death. Bullet in the brain. Great one, Court. But he had to be certain. \"You ken they\u0027ll kill both of us?\"\u003c/p\u003e\n\u003cp\u003eShe whispered, \"Y-You will get us to safety?\"\u003c/p\u003e\n\u003cp\u003e\"Aye,\" he said in a milder tone. Gentle. \"If you do as I say.\"\u003c/p\u003e\n\u003cp\u003eWhen she nodded again, he loosened his grip on her. At once, she drove her elbow into his throat and flew to her feet. Choking out his breath, he lunged for her and stretched to catch her dress just as he fell. The fabric brushed his fingertips.\u003c/p\u003e\n\u003cp\u003eHe\u0027d missed.\u003c/p\u003e\n\u003cp\u003eShe tore off into the clearing, screaming, \"Help me! I want to return! I want away from him!\"\u003c/p\u003e\n\u003cp\u003eMore shots rang out. He scrambled to his feet, returning fire and was sprinting after her when he saw a smoking bullet tear through the billow of her skirt. She froze with a terrified gasp, staring into the darkness. \"M-Mind your bullets!\"\u003c/p\u003e\n\u003cp\u003eA split second later, her shoulder was wrenched back just before he snagged her around the waist and dove behind a boulder. He felt wetness against his hand, saw his white shirt stained dark. \"Lass,\" he said as he dropped the empty pistol to probe her shoulders. \"Is that mine or yours?\"\u003c/p\u003e\n\u003cp\u003eHe answered his own question when he felt her shuddering. \"It\u0027ll be all right,\" he grated, though fury overwhelmed him. They\u0027d shot her. A defenseless woman. He ripped off her sleeve and just stopped himself from hissing in a breath.\u003c/p\u003e\n\u003cp\u003eIn the moonlight he could see the bullet had torn open her arm. He prayed it had missed the bone. Taking the material from her sleeve, he tied it tight over the wound.\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t been able to prevent this. He wanted to yell, to ask her why she hadn\u0027t listened to him. She was too small to take a bullet. What kind of animal would shoot a woman?\u003c/p\u003e\n\u003cp\u003eShe jerked upright and looked at him as though she\u0027d just realized something, and had just forgotten the bullet hole in her arm. \"This is all your fault! I loathe you. Detest you!\"\u003c/p\u003e\n\u003cp\u003eHe exhaled. \"I\u0027ve heard it before.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what this means, you bastard?\" she cried.\u003c/p\u003e\n\u003cp\u003eYes, he knew exactly what it meant. Pascal was making a statement to anyone who dared to take what was his. And she might now believe him about her brother.\u003c/p\u003e\n\u003cp\u003e\"Do you, you disgusting brute?\" she demanded again, seemingly uncaring of the shots all around them.\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes. \"Groom got cold feet?\"\u003c/p\u003e\n\u003cp\u003eShe screamed, springing forward, fingers in claw position to scratch down his face just before he caught her wrists. Still she fought him.\u003c/p\u003e\n\u003cp\u003e\"Damn it! Will you stop?\" He lifted her injured arm in front of her face. \"Look, wench! Look at all the blood everywhere. Now faint. Should you no\u0027 be fainting by now?\"\u003c/p\u003e\n\u003cp\u003eShe sank back against the boulder, solemnly regarding her wound, and he could see shock settling over her. \"I do appear to have been shot.\" Her tone was dazed, and he sorely regretted his taunt.\u003c/p\u003e\n\u003cp\u003eShe was too small and too delicate. Niall was right. Women like her needed to be cosseted, protected. Two nights under his protection and she\u0027d been shot.\u003c/p\u003e\n\u003cp\u003eDeath to those caught in his wake.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to get you someplace safe.\"\u003c/p\u003e\n\u003cp\u003eShe blinked up at him.\u003c/p\u003e\n\u003cp\u003eWith effort, he tore his gaze from hers to scan the area. He spotted her horse, frantic, caught by the reins tangled in a bush. Court tensed to run, but said to her, \"Stay here! This is more serious than you know.\"\u003c/p\u003e\n\u003cp\u003eIn a small voice, she said, \"It hurts as though it\u0027s serious.\"\u003c/p\u003e\n\u003cp\u003eAnnal¨ªa Llorente was docile, a sure sign she was in shock.\u003c/p\u003e\n\u003cp\u003eHe sprinted after the horse, his ribs singing as he dodged bullets. Just when he\u0027d finally secured the confused animal, which carried her bloody saddlebags full of dresses while his had had ammunition, he heard his men sounding the call. Soon after, he heard the guns he recognized by sound firing back at the assassins, but they were separated from him.\u003c/p\u003e\n\u003cp\u003e\"Niall!\" he yelled in Gaelic. \"How many are there?\"\u003c/p\u003e\n\u003cp\u003e\"Seems like the whole order! They\u0027re everywhere.\"\u003c/p\u003e\n\u003cp\u003e\"Bypass the lodge. We\u0027ll meet up at the posting house.\"\u003c/p\u003e\n\u003cp\u003e\"Aye.\"\u003c/p\u003e\n\u003cp\u003e\"Can you cover me?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, be careful with yourself and the girl.\"\u003c/p\u003e\n\u003cp\u003eHe rode back under the shield of Niall\u0027s covering shots. When he slid down from the horse to bend down beside her, he found her leaning against the rock, sitting very still, eyes closed, cradling her arm. Closer, he could see blood streaming in a line down her bent elbow, pooling into the dust. Her other hand was limp, palm up, and his makeshift tourniquet lay on it. Panic made his vision swim. He took it and retied it, knowing she\u0027d only intended to look at the wound, to check how badly she\u0027d been hurt.\u003c/p\u003e\n\u003cp\u003e\"Anna!\" He lifted her up. \"Annal¨ªa...\" She cracked open her eyes. \"Ye need tae hold on tae my neck with yer good arm.\" His brogue was so thick, he wondered if she could even understand him. \"I\u0027m goin\u0027 tae get ye and me on a horse.\"\u003c/p\u003e\n\u003cp\u003eHe had turned and was surveying the horse, figuring out how best to mount up, when he heard her say in a frail voice, \"You need rescuing as much as I do.\"\u003c/p\u003e\n\u003cp\u003eHe turned back, brows drawn. \"What?\"\u003c/p\u003e\n\u003cp\u003eShe struggled against him, weak as a kitten. \"I\u0027m better off on my own.\"\u003c/p\u003e\n\u003cp\u003eThough he sensed she was gravely sincere, and more than a bit in shock, he clucked her under the chin. \"Yer hurtin\u0027 my male pride, and will be payin\u0027 for that one.\"\u003c/p\u003e\n\u003cp\u003eHis light response worked. She exhaled and looped her thin arm around his neck. She weighed no more than a feather as he lifted her, but he teased her, saying, \"You weigh more than you look.\"\u003c/p\u003e\n\u003cp\u003e\"You are weaker than you look,\" she immediately whispered.\u003c/p\u003e\n\u003cp\u003eHe stared down at her in his arms and gathered her even closer. She met his gaze, looking very brave, but he could feel the tension leaving her body as she drifted into unconsciousness. Her eyes slowly closed, and her lips parted.\u003c/p\u003e\n\u003cp\u003eThat\u0027s when reason left him. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-dare-maccarrick-brothers-1/page-13.html","bookId":2644,"creation":"Oct 5, 2019 10:29:08 PM","modification":"Oct 5, 2019 10:29:08 PM"}
