{"id":3440,"no":10,"title":"Chapter 5","content":"COMMISSION\u0026nbsp; OF PUBLIC\u0026nbsp; SAFETY?..\u0026nbsp; The aristocratic\u0026nbsp; coterie rose\u0026nbsp; to powerafter the\u0026nbsp; assassination of Cleon I, last of the\u0026nbsp; Entuns. In the main, theyformed\u0026nbsp; an\u0026nbsp; element\u0026nbsp; of\u0026nbsp; order\u0026nbsp; during\u0026nbsp; the centuries\u0026nbsp; of\u0026nbsp; instability\u0026nbsp; anduncertainty\u0026nbsp; in\u0026nbsp; the\u0026nbsp; Imperium.\u0026nbsp; Usually under\u0026nbsp; the\u0026nbsp; control\u0026nbsp; of the\u0026nbsp; greatfamilies of\u0026nbsp; the Chens\u0026nbsp; and the Divarts,\u0026nbsp; it degenerated eventually\u0026nbsp; into ablind\u0026nbsp; instrument\u0026nbsp; for maintenance\u0026nbsp; of\u0026nbsp; the\u0026nbsp; status quo....\u0026nbsp; They were\u0026nbsp; notcompletely removed as a power in the state until after the accession of thelast\u0026nbsp;\u0026nbsp; strong\u0026nbsp; Emperor,\u0026nbsp;\u0026nbsp; Cleon\u0026nbsp;\u0026nbsp; H.\u0026nbsp; The\u0026nbsp;\u0026nbsp; first\u0026nbsp; Chief\u0026nbsp;\u0026nbsp; Commissioner....\n\u003cbr\u003e ... In\u0026nbsp; a way, the beginning\u0026nbsp; of the Commission\u0027s decline\u0026nbsp; can be traced tothe trial of Hari Seldon two years before the beginning of the FoundationalEra. That trial is described in Gaal Dornick\u0027s biography of Hari Seldon....\n\u003cbr\u003e ENCYCLOPEDIA GALACTICAGaal did\u0026nbsp; not carry out his promise. He was awakened\u0026nbsp; the next morning by amuted buzzer.\u0026nbsp; He answered it, and\u0026nbsp; the voice of the\u0026nbsp; desk clerk, as muted,polite and deprecating as\u0026nbsp; it well might be, informed him that he was underdetention\u0026nbsp;\u0026nbsp; at\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; orders\u0026nbsp; of\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; Commission\u0026nbsp;\u0026nbsp; of\u0026nbsp; Public\u0026nbsp;\u0026nbsp; Safety.\n\u003cbr\u003e Gaal sprang\u0026nbsp; to the door and\u0026nbsp; found it would no\u0026nbsp; longer open. He could onlydress and wait.\n\u003cbr\u003e They came for him\u0026nbsp; and took him elsewhere, but it was still detention. Theyasked him questions most\u0026nbsp; politely. It was all very civilized. He explainedthat\u0026nbsp; he was a\u0026nbsp; provincial of Synnax;\u0026nbsp; that he\u0026nbsp; had attended such\u0026nbsp; and suchschools\u0026nbsp; and obtained\u0026nbsp; a Doctor of\u0026nbsp; Mathematics degree\u0026nbsp; on such and\u0026nbsp; such adate.\u0026nbsp; He had applied\u0026nbsp; for a position\u0026nbsp; on Dr.\u0026nbsp; Seldon\u0027s staff and\u0026nbsp; had beenaccepted. Over\u0026nbsp; and over\u0026nbsp; again, he gave\u0026nbsp; these details; and\u0026nbsp; over and overagain, they returned to the question of his joining the Seldon Project. Howhad he\u0026nbsp; heard of it; what\u0026nbsp; were to be his\u0026nbsp; duties; what secret instructionshad he received; what was it all about?\n\u003cbr\u003e He answered\u0026nbsp; that he did not know. He had no\u0026nbsp; secret instructions. He was ascholar\u0026nbsp;\u0026nbsp; and\u0026nbsp;\u0026nbsp; a\u0026nbsp; mathematician.\u0026nbsp;\u0026nbsp; He\u0026nbsp;\u0026nbsp; had\u0026nbsp; no\u0026nbsp;\u0026nbsp; interest\u0026nbsp; in\u0026nbsp;\u0026nbsp; politics.\n\u003cbr\u003e And finally the gentle\u0026nbsp; inquisitor asked, \"When will Trantor be destroyed?\"Gaal faltered, \"I could not say of my own knowledge.\"\"Could you say of anyone\u0027s?\"\"How could I speak for another?\" He felt warm; overwarm.\n\u003cbr\u003e The inquisitor said, \"Has anyone told you of such destruction; set a date?\"And,\u0026nbsp; as the\u0026nbsp; young man\u0026nbsp; hesitated, he\u0026nbsp; went on,\u0026nbsp; \"You have\u0026nbsp; been followed,doctor. We\u0026nbsp; were at the airport when you\u0026nbsp; arrived; on the observation towerwhen\u0026nbsp; you waited\u0026nbsp; for your\u0026nbsp; appointment; and,\u0026nbsp; of course,\u0026nbsp; we were\u0026nbsp; able tooverhear your conversation with Dr. Seldon.\"Gaal said, \"Then you know his views on the matter.\"\"Perhaps. But we would like to hear them from you.\"\"He is of the opinion that Trantor would be destroyed within threecenturies.\"\"He proved it, ?uh ?mathematically?\"\"Yes, he did,\" ?defiantly.\n\u003cbr\u003e \"You\u0026nbsp; maintain\u0026nbsp;\u0026nbsp; the\u0026nbsp; ?\u0026nbsp; uh\u0026nbsp; ? mathematics\u0026nbsp;\u0026nbsp; to\u0026nbsp; be\u0026nbsp; valid,\u0026nbsp;\u0026nbsp; I\u0026nbsp; suppose.\n\u003cbr\u003e \"If Dr. Seldon vouches for it, it is valid.\"\"Then we will return.\"\"Wait.\u0026nbsp; I have\u0026nbsp; a right\u0026nbsp; to a\u0026nbsp; lawyer. I\u0026nbsp; demand my\u0026nbsp; rights as\u0026nbsp; an Imperialcitizen.\"\"You shall have them.\"And he did.\n\u003cbr\u003e It\u0026nbsp; was a tall\u0026nbsp; man that eventually\u0026nbsp; entered, a\u0026nbsp; man whose face\u0026nbsp; seemed allvertical lines and so thin that one could wonder whether there was room fora smile.\n\u003cbr\u003e Gaal looked up. He felt disheveled and wilted. So much had happened, yet hehad been on Trantor not more than thirty hours.\n\u003cbr\u003e The man\u0026nbsp; said, \"I am Lors\u0026nbsp; Avakim. Dr. Seldon has\u0026nbsp; directed me to representyou.\"\"Is\u0026nbsp; that so?\u0026nbsp; Well, then,\u0026nbsp; look here.\u0026nbsp; I demand\u0026nbsp; an instant appeal\u0026nbsp; to theEmperor.\u0026nbsp; I\u0027m\u0026nbsp; being held\u0026nbsp; without\u0026nbsp; cause.\u0026nbsp; I\u0027m innocent\u0026nbsp; of\u0026nbsp; anything. Ofanything.\" He slashed his hands outward, palms down, \"You\u0027ve got to arrangea hearing with the Emperor, instantly.\"Avakim was carefully emptying the contents of a flat folder onto the floor.\n\u003cbr\u003e If Gaal had had the stomach for it, he might have recognized Cellomet legalforms, metal thin and\u0026nbsp; tapelike, adapted for insertion within the smallnessof a\u0026nbsp; personal capsule.\u0026nbsp; He might also\u0026nbsp; have recognized a\u0026nbsp; pocket recorder.\n\u003cbr\u003e Avakim, paying no attention to Gaal\u0027s outburst, finally looked up. He said,\"The Commission will, of\u0026nbsp; course, have a spy beam on our conversation. Thisis against the law, but they will use one nevertheless.\"Gaal ground his teeth.\n\u003cbr\u003e \"However,\" and Avakim seated\u0026nbsp; himself deliberately, \"the recorder I have onthe table, ?which\u0026nbsp; is a perfectly ordinary recorder to all appearances andperforms\u0026nbsp; it\u0026nbsp; duties\u0026nbsp; well\u0026nbsp; ?has\u0026nbsp; the\u0026nbsp; additional\u0026nbsp; property of\u0026nbsp; completelyblanketing the spy beam. This is something they will not find out at once.\"\"Then I can speak.\"\"Of course.\"\"Then I want a hearing with the Emperor.\"Avakim smiled frostily, and it turned out that there was room for it on histhin face\u0026nbsp; after all. His cheeks\u0026nbsp; wrinkled to make the\u0026nbsp; room. He said, \"Youare from the provinces.\"\"I am none the\u0026nbsp; less an Imperial citizen. As good a one as you or as any ofthis Commission of Public Safety.\"\"No\u0026nbsp; doubt; no\u0026nbsp; doubt.\u0026nbsp; It is\u0026nbsp; merely that,\u0026nbsp; as\u0026nbsp; a provincial,\u0026nbsp; you\u0026nbsp; do notunderstand\u0026nbsp; life on\u0026nbsp; Trantor as\u0026nbsp; it is,\u0026nbsp; There are\u0026nbsp; no hearings\u0026nbsp; before theEmperor.\"\"To\u0026nbsp; whom\u0026nbsp; else would\u0026nbsp; one\u0026nbsp; appeal\u0026nbsp; from this\u0026nbsp; Commission?\u0026nbsp; Is there\u0026nbsp; otherprocedure?\"\"None. There\u0026nbsp; is no recourse in a\u0026nbsp; practical sense. Legalistically, you mayappeal to\u0026nbsp; the Emperor, but you would get no\u0026nbsp; hearing. The Emperor today isnot the\u0026nbsp; Emperor of an Entun dynasty, you know. Trantor,\u0026nbsp; I am afraid is inthe\u0026nbsp; hands\u0026nbsp; of the\u0026nbsp; aristocratic\u0026nbsp; families,\u0026nbsp; members of\u0026nbsp; which compose\u0026nbsp; theCommission of Public Safety.\u0026nbsp; This is a development which is well predictedby psychohistory.\"Gaal said, \"Indeed? In\u0026nbsp; that case, if Dr. Seldon can predict the history ofTrantor three hundred years into the future ?\n\u003cbr\u003e \"He\u0026nbsp;\u0026nbsp; can\u0026nbsp;\u0026nbsp; predict\u0026nbsp;\u0026nbsp; it\u0026nbsp;\u0026nbsp; fifteen\u0026nbsp;\u0026nbsp; hundred\u0026nbsp; years\u0026nbsp;\u0026nbsp; into\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; future.\"\"Let it\u0026nbsp; be fifteen thousand. Why couldn\u0027t\u0026nbsp; he yesterday have predicted theevents of\u0026nbsp; this morning and warned\u0026nbsp; me. 朜o, I\u0027m sorry.\"\u0026nbsp; Gaal sat down andrested\u0026nbsp; his\u0026nbsp;\u0026nbsp; head\u0026nbsp; in\u0026nbsp;\u0026nbsp; one\u0026nbsp; sweating\u0026nbsp; palm,\u0026nbsp; \"I\u0026nbsp;\u0026nbsp; quite\u0026nbsp; understand\u0026nbsp; thatpsychohistory is\u0026nbsp; a statistical science and cannot\u0026nbsp; predict the future of asingle\u0026nbsp; man\u0026nbsp;\u0026nbsp; with\u0026nbsp; any\u0026nbsp; accuracy.\u0026nbsp; You\u0027ll\u0026nbsp;\u0026nbsp; understand\u0026nbsp; that\u0026nbsp; I\u0027m\u0026nbsp; upset.\"\"But\u0026nbsp; you are\u0026nbsp; wrong.\u0026nbsp; Dr. Seldon\u0026nbsp; was of\u0026nbsp; the\u0026nbsp; opinion that\u0026nbsp; you\u0026nbsp; would bearrested this morning.\"\"What!\"\"It is unfortunate, but true. The Commission has been more and more hostileto his activities. New\u0026nbsp; members joining the group have been interfered withto an\u0026nbsp; increasing extent. The graphs showed\u0026nbsp; that for our purposes, mattersmight best be brought\u0026nbsp; to a climax now. The Commission of itself was movingsomewhat\u0026nbsp; slowly so\u0026nbsp; Dr. Seldon\u0026nbsp; visited you\u0026nbsp; yesterday for the\u0026nbsp; purpose offorcing their hand. No other reason.\"Gaal caught his breath, \"I resent ?\n\u003cbr\u003e \"Please. It\u0026nbsp; was necessary. You\u0026nbsp; were not picked for\u0026nbsp; any personal reasons.\n\u003cbr\u003e You\u0026nbsp; must realize\u0026nbsp; that Dr.\u0026nbsp; Seldon\u0027s plans,\u0026nbsp; which are\u0026nbsp; laid out\u0026nbsp; with thedeveloped mathematics of over eighteen years include all eventualities withsignificant probabilities. This is\u0026nbsp; one of them. I\u0027ve been sent here for noother purpose than to\u0026nbsp; assure you that you need not fear. It will end well;almost certainly\u0026nbsp; so for\u0026nbsp; the project; and with\u0026nbsp; reasonable probability foryou.\"\"What are the figures?\" demanded Gaal.\n\u003cbr\u003e \"For the project, over 99.9%.\"\"And for myself?\"\"I am instructed that this probability is 77.2%.\"\"Then I\u0027ve got better\u0026nbsp; than one chance in five of being sentenced to prisonor to death.\"\"The last is under one per cent.\"\"Indeed. Calculations\u0026nbsp; upon one\u0026nbsp; man mean nothing.\u0026nbsp; You send Dr.\u0026nbsp; Seldon tome.\"\"Unfortunately,\u0026nbsp;\u0026nbsp;\u0026nbsp; I\u0026nbsp;\u0026nbsp; cannot.\u0026nbsp;\u0026nbsp;\u0026nbsp; Dr.\u0026nbsp;\u0026nbsp; Seldon\u0026nbsp;\u0026nbsp; is\u0026nbsp;\u0026nbsp;\u0026nbsp; himself\u0026nbsp;\u0026nbsp; arrested.\"The door\u0026nbsp; was thrown open before\u0026nbsp; the rising Gaal could\u0026nbsp; do more than utterthe beginning of a cry. A guard entered, walked to the table, picked up therecorder,\u0026nbsp; looked\u0026nbsp; upon\u0026nbsp; all\u0026nbsp; sides\u0026nbsp; of\u0026nbsp; it\u0026nbsp; and\u0026nbsp; put\u0026nbsp; it\u0026nbsp; in\u0026nbsp; his\u0026nbsp; pocket.\n\u003cbr\u003e Avakim said quietly, \"I will need that instrument.\"\"We\u0026nbsp; will supply\u0026nbsp; you with\u0026nbsp; one, Counsellor,\u0026nbsp; that does\u0026nbsp; not cast\u0026nbsp; a staticfield.\"\"My interview is done, in that case.\"Gaal watched him leave and was alone.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47138.html","bookId":127,"creation":"Aug 1, 2019 4:36:37 AM","modification":"Aug 1, 2019 4:36:37 AM"}
