{"id":3446,"no":16,"title":"Chapter 8","content":"For a long while, they sat silently as the taxi whined through the hundredsof miles of worm-like tunnels toward the University. And then Gaal stirred.\n\u003cbr\u003e He said:\n\u003cbr\u003e \"Was what you told\u0026nbsp; the Commissioner true? Would your execution have reallyhastened the Fall?\"Seldon said, \"I never\u0026nbsp; lie about psychohistoric findings. Nor would it haveavailed me in\u0026nbsp; this case. Chen knew I spoke the truth.\u0026nbsp; He is a very cleverpolitician and\u0026nbsp; politicians by the very\u0026nbsp; nature of their work\u0026nbsp; must have aninstinctive feeling for the truths of psychohistory.\"\"Then\u0026nbsp; need you\u0026nbsp; have accepted\u0026nbsp; exile,\" Gaal\u0026nbsp; wondered, but Seldon\u0026nbsp; did notanswer.\n\u003cbr\u003e When they burst out upon the University grounds, Gaal\u0027s muscles took actionof their own; or rather, inaction. He had to be carried, almost, out of thetaxi.\n\u003cbr\u003e All the\u0026nbsp; University was a blaze of light. Gaal\u0026nbsp; had almost forgotten that asun could exist.\n\u003cbr\u003e The\u0026nbsp; University\u0026nbsp; structures\u0026nbsp; lacked\u0026nbsp; the hard\u0026nbsp; steel-gray\u0026nbsp; of\u0026nbsp; the rest\u0026nbsp; ofTrantor. They were silvery, rather. The metallic luster was almost ivory incolor.\n\u003cbr\u003e Seldon said, \"Soldiers, it seems.\"\"What?\" Gaal\u0026nbsp; brought his eyes to\u0026nbsp; the prosaic ground and\u0026nbsp; found a sentinelahead of them.\n\u003cbr\u003e They\u0026nbsp; stopped before\u0026nbsp; him, and\u0026nbsp; a soft-spoken\u0026nbsp; captain materialized\u0026nbsp; from anear-by doorway.\n\u003cbr\u003e He said, \"Dr. Seldon?\"\"Yes.\"\"We have\u0026nbsp; been waiting for you. You and your men\u0026nbsp; will be under martial lawhenceforth. I\u0026nbsp; have been instructed to\u0026nbsp; inform you that six\u0026nbsp; months will beallowed you for preparations to leave for Terminus.\"\"Six months!\"\u0026nbsp; began Gaal,\u0026nbsp; but Seldon\u0027s fingers\u0026nbsp; were upon his\u0026nbsp; elbow withgentle pressure.\n\u003cbr\u003e \"These are my instructions,\" repeated the captain.\n\u003cbr\u003e He\u0026nbsp; was gone,\u0026nbsp; and Gaal\u0026nbsp; turned to Seldon,\u0026nbsp; \"Why, what\u0026nbsp; can be done\u0026nbsp; in sixmonths? This is but slower murder.\"\"Quietly. Quietly. Let us reach my office.\"It\u0026nbsp; was\u0026nbsp; not\u0026nbsp; a\u0026nbsp; large\u0026nbsp; office,\u0026nbsp; but\u0026nbsp; it\u0026nbsp; was\u0026nbsp; quite\u0026nbsp; spy-proof\u0026nbsp; and\u0026nbsp; quiteundetectably so.\u0026nbsp; Spy-beams trained\u0026nbsp; upon it received\u0026nbsp; neither a suspicioussilence\u0026nbsp; nor\u0026nbsp; an even\u0026nbsp; more\u0026nbsp; suspicious\u0026nbsp; static. They\u0026nbsp; received, rather,\u0026nbsp; aconversation constructed at random out of a vast stock of innocuous phrasesin various tones and voices.\n\u003cbr\u003e \"Now,\"\u0026nbsp;\u0026nbsp; said\u0026nbsp; Seldon,\u0026nbsp; at\u0026nbsp;\u0026nbsp; his\u0026nbsp; ease,\u0026nbsp;\u0026nbsp; \"six\u0026nbsp; months\u0026nbsp; will\u0026nbsp;\u0026nbsp; be\u0026nbsp; enough.\"\"I don\u0027t see how.\"\"Because, my boy, in a plan such as ours, the actions of others are bent toour needs. Have I\u0026nbsp; not said to you already that Chen\u0027s temperamental makeuphas been subjected to greater scrutiny than that of any other single man inhistory.\u0026nbsp; The\u0026nbsp;\u0026nbsp; trial\u0026nbsp; was\u0026nbsp; not\u0026nbsp; allowed\u0026nbsp; to\u0026nbsp;\u0026nbsp; begin\u0026nbsp; until\u0026nbsp; the\u0026nbsp; time\u0026nbsp; andcircumstances\u0026nbsp;\u0026nbsp; were\u0026nbsp; fight\u0026nbsp;\u0026nbsp; for\u0026nbsp;\u0026nbsp; the\u0026nbsp; ending\u0026nbsp;\u0026nbsp; of\u0026nbsp; our\u0026nbsp;\u0026nbsp; own\u0026nbsp; choosing.\"\"But could you have arranged?\n\u003cbr\u003e \"杢o be exiled to\u0026nbsp; Terminus? Why not?\" He put his fingers on a certain spoton his desk and a small section of the wall behind him slid aside. Only hisown\u0026nbsp; fingers could have\u0026nbsp; done so,\u0026nbsp; since only his\u0026nbsp; particular print-patterncould have activated the scanner beneath.\n\u003cbr\u003e \"You\u0026nbsp; will find\u0026nbsp; several\u0026nbsp; microfilms inside,\"\u0026nbsp; said Seldon.\u0026nbsp; \"Take\u0026nbsp; the onemarked with the letter, T.\"Gaal\u0026nbsp; did so\u0026nbsp; and waited\u0026nbsp; while Seldon\u0026nbsp; fixed it\u0026nbsp; within the\u0026nbsp; projector andhanded the\u0026nbsp; young man a pair of eyepieces.\u0026nbsp; Gaal adjusted them, and watchedthe film unroll before his eyes.\n\u003cbr\u003e He said, \"But then?\n\u003cbr\u003e Seldon said, \"What surprises you?\"\"Have you been preparing to leave for two years?\"\"Two\u0026nbsp; and a\u0026nbsp; half. Of\u0026nbsp; course, we\u0026nbsp; could not\u0026nbsp; be certain\u0026nbsp; that it\u0026nbsp; would beTerminus he\u0026nbsp; would choose, but we hoped it might be\u0026nbsp; and we acted upon thatassumption?\n\u003cbr\u003e \"But why, Dr. Seldon? If you arranged the exile, why? Could not events befar better controlled here on Trantor?\"\"Why, there are some reasons. Working on Terminus, we will have Imperialsupport without ever rousing fears that we would endanger Imperial safety.\"Gaal said, \"But you aroused those fears only to force exile. I still do notunderstand.\"\"Twenty thousand families would not travel to the end of the Galaxy oftheir own will perhaps.\"\"But why should they be forced there?\" Gaal paused, \"May I not know?\"Seldon said, \"Not yet. It is enough for the moment that you know that ascientific refuge will be established on Terminus. And another will beestablished at the other end of the Galaxy, let us say,\" and he smiled, \"atStar\u0027s End. And as for the rest, I will die soon, and you will see morethan I. 朜o, no. Spare me your shock and good wishes. My doctors tell methat I cannot live longer than a year or two. But then, I have accomplishedin life what I have intended and under what circumstances may one betterdie.\"\"And after you die, sir?\"\"Why, there will be successors ?perhaps even yourself. And thesesuccessors will be able to apply the final touch in the scheme andinstigate the revolt on Anacreon at the right time and in the right manner.\n\u003cbr\u003e Thereafter, events may roll unheeded.\"\"I do not understand.\"\"You will.\" Seldon\u0027s lined face grew peaceful and tired, both at once,\"Most will leave for Terminus, but some will stay. It will be easy toarrange. 朆ut as for me,\" and he concluded in a whisper, so that Gaal couldscarcely hear him, \"I am finished.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47144.html","bookId":127,"creation":"Aug 1, 2019 4:36:53 AM","modification":"Aug 1, 2019 4:36:53 AM"}
