{"id":3454,"no":24,"title":"Chapter 4","content":"Lord\u0026nbsp; Dorwin took\u0026nbsp; snuff. He\u0026nbsp; also had\u0026nbsp; long hair, curled\u0026nbsp; intricately and,quite obviously, artificially, to\u0026nbsp; which were added a pair of fluffy, blondsideburns,\u0026nbsp; which\u0026nbsp; he\u0026nbsp; fondled\u0026nbsp; affectionately.\u0026nbsp; Then,\u0026nbsp; too,\u0026nbsp; he\u0026nbsp; spoke\u0026nbsp; inoverprecise statements and left out all the r\u0027s.\n\u003cbr\u003e At the moment,\u0026nbsp; Hardin had no time to think of more\u0026nbsp; of the reasons for theinstant detestation in which he had held the noble chancellor. Oh, yes, theelegant gestures of one\u0026nbsp; hand with which he accompanied his remarks and thestudied condescension with which\u0026nbsp; he accompanied even a simple affirmative.\n\u003cbr\u003e But, at\u0026nbsp; any rate,\u0026nbsp; the problem now\u0026nbsp; was to locate him.\u0026nbsp; He had disappearedwith Pirenne\u0026nbsp; half an hour before\u0026nbsp; ?passed clean out\u0026nbsp; of sight, blast him.\n\u003cbr\u003e Hardin\u0026nbsp; was\u0026nbsp; quite\u0026nbsp; sure\u0026nbsp; that\u0026nbsp; his\u0026nbsp; own\u0026nbsp; absence\u0026nbsp; during\u0026nbsp; the\u0026nbsp; preliminarydiscussions would quite suit Pirenne.\n\u003cbr\u003e But Pirenne had\u0026nbsp; been seen in this wing And on this\u0026nbsp; floor. It was simply amatter of trying every\u0026nbsp; door. Halfway down, he said, \"Ah!\" and stepped intothe\u0026nbsp; darkened room.\u0026nbsp; The\u0026nbsp; profile of\u0026nbsp; Lord Dorwin\u0027s\u0026nbsp; intricate\u0026nbsp; hair-do wasunmistakable against the lighted screen.\n\u003cbr\u003e Lord Dorwin\u0026nbsp; looked up\u0026nbsp; and said: \"Ah,\u0026nbsp; Hahdin. You ah looking\u0026nbsp; foah us, nodoubt?\"\u0026nbsp; He held\u0026nbsp; out his\u0026nbsp; snuffbox ? overadorned and poor\u0026nbsp; workmanship atthat, noted\u0026nbsp; Hardinand was politely refused whereat\u0026nbsp; he helped himself to apinch and smiled graciously.\n\u003cbr\u003e Pirenne\u0026nbsp; scowled\u0026nbsp;\u0026nbsp; and\u0026nbsp; Hardin\u0026nbsp; met\u0026nbsp; that\u0026nbsp;\u0026nbsp; with\u0026nbsp; an\u0026nbsp; expression\u0026nbsp; of\u0026nbsp; blankindifference.\n\u003cbr\u003e The only sound to break the short silence that followed was the clicking ofthe\u0026nbsp; lid of\u0026nbsp; Lord\u0026nbsp; Dorwin\u0027s snuffbox.\u0026nbsp; And then\u0026nbsp; he put\u0026nbsp; it away\u0026nbsp; and said:\n\u003cbr\u003e \"A gweat\u0026nbsp; achievement, this Encyclopedia of\u0026nbsp; yoahs, Hahdin. A feat, indeed,to\u0026nbsp;\u0026nbsp; rank\u0026nbsp;\u0026nbsp; with\u0026nbsp; the\u0026nbsp;\u0026nbsp; most\u0026nbsp;\u0026nbsp; majestic\u0026nbsp; accomplishments\u0026nbsp;\u0026nbsp; of\u0026nbsp; all\u0026nbsp;\u0026nbsp; time.\"\"Most of us think so, milord. It\u0027s an accomplishment not quite accomplishedas yet, however.\"\"Fwom the\u0026nbsp; little I have seen of the efficiency\u0026nbsp; of yoah Foundation, I haveno feahs\u0026nbsp; on that\u0026nbsp; scoah.\" And he\u0026nbsp; nodded to Pirenne, who\u0026nbsp; responded with adelighted bow.\n\u003cbr\u003e Quite a love feast, thought Hardin. \"I wasn\u0027t complaining about the lack ofefficiency, milord, as much\u0026nbsp; as of the definite excess of efficiency on thepart\u0026nbsp; of\u0026nbsp; the\u0026nbsp; Anacreonians\u0026nbsp; ? though\u0026nbsp; in\u0026nbsp; another\u0026nbsp; and\u0026nbsp; more\u0026nbsp; destructivedirection.\"\"Ah, yes,\u0026nbsp; Anacweon.\" A negligent wave of the hand.\u0026nbsp; \"I have just come fromtheah.\u0026nbsp; Most bahbawous\u0026nbsp; planet. It\u0026nbsp; is thowoughly inconceivable\u0026nbsp; that humanbeings could\u0026nbsp; live heah in the\u0026nbsp; Pewiphewy. The lack of\u0026nbsp; the most elementawywequiahments of a cultuahed\u0026nbsp; gentleman; the absence of the most fundamentalnecessities foah\u0026nbsp; comfoht and convenience ? the uttah desuetude into whichthey?\n\u003cbr\u003e Hardin interrupted\u0026nbsp; dryly: \"The\u0026nbsp; Anacreonians, unfortunately, have\u0026nbsp; all theelementary requirements for warfare and all the fundamental necessities fordestruction.\"\"Quite, quite.\" Lord Dorwin seemed annoyed, perhaps at being stopped midwayin his sentence. \"But we ahn\u0027t to discuss business now, y\u0027know. Weally, I\u0027mothahwise concuhned. Doctah Piwenne,\u0026nbsp; ahn\u0027t you going to show me the secondvolume? Do, please.\"The lights clicked out and for the next half-hour Hardin might as well havebeen on\u0026nbsp; Anacreon for\u0026nbsp; all the attention\u0026nbsp; they paid him. The\u0026nbsp; book upon thescreen made little sense\u0026nbsp; to him, nor did he trouble to make the attempt tofollow,\u0026nbsp; but Lord\u0026nbsp; Dorwin\u0026nbsp; became quite\u0026nbsp; humanly excited\u0026nbsp; at\u0026nbsp; times. Hardinnoticed that\u0026nbsp; during these moments of\u0026nbsp; excitement the chancellor pronouncedhis r\u0027s.\n\u003cbr\u003e When\u0026nbsp; the\u0026nbsp; lights\u0026nbsp; went\u0026nbsp; on\u0026nbsp; again,\u0026nbsp; Lord Dorwin\u0026nbsp; said:\u0026nbsp; \"Mahvelous.\u0026nbsp; Twulymahvelous.\u0026nbsp; You\u0026nbsp; ah not,\u0026nbsp; by\u0026nbsp; chance,\u0026nbsp; intewested in\u0026nbsp; ahchaeology, ah\u0026nbsp; you,Hahdin?\"\"Eh?\" Hardin shook himself out of an abstracted reverie. \"No, milord, can\u0027tsay\u0026nbsp; I am.\u0026nbsp; I\u0027m a psychologist\u0026nbsp; by original\u0026nbsp; intention and a\u0026nbsp; politician byfinal decision.\"\"Ah! No\u0026nbsp; doubt intewesting studies. 1, myself,\u0026nbsp; y\u0027know\" ?he helped himselfto a giant pinch of snuff ?dabble in ahchaeology.\"\"Indeed?\"\"His lordship,\"\u0026nbsp; interrupted Pirenne,\u0026nbsp; \"is most thoroughly\u0026nbsp; acquainted withthe field.\"\"Well, p\u0027haps\u0026nbsp; I am, p\u0027haps I am,\" said his lordship\u0026nbsp; complacently. \"I havedone an awful amount\u0026nbsp; of wuhk in the science. Extwemely well-read, in fact.\n\u003cbr\u003e I\u0027ve gone\u0026nbsp; thwough all\u0026nbsp; of Jawdun, Obijasi,\u0026nbsp; Kwomwill ... oh,\u0026nbsp; all of them,y\u0027know.\"\"I\u0027ve heard\u0026nbsp; of them, of course,\" said Hardin,\u0026nbsp; \"but I\u0027ve never read them.\"\"You\u0026nbsp; should some day,\u0026nbsp; my deah fellow.\u0026nbsp; It would\u0026nbsp; amply repay you.\u0026nbsp; Why, Icutainly considah it well\u0026nbsp; wuhth the twip heah to the Pewiphewy to see thiscopy of\u0026nbsp; Lameth. Would you believe it, my Libwawy\u0026nbsp; totally lacks a copy. Bythe\u0026nbsp; way,\u0026nbsp;\u0026nbsp; Doctah\u0026nbsp; Piwenne,\u0026nbsp; you\u0026nbsp; have\u0026nbsp;\u0026nbsp; not\u0026nbsp; fohgotten\u0026nbsp; yoah\u0026nbsp; pwomise\u0026nbsp; totwansdevelop a copy foah me befoah I leave?\"\"Only too pleased.\"\"Lameth, you must know,\"\u0026nbsp; continued the chancellor, pontifically, \"pwesentsa new and most\u0026nbsp; intwesting addition to my pwevious knowledge of the \u0027OwiginQuestion.\"\u0027\n\u003cbr\u003e \"Which question?\" asked Hardin.\n\u003cbr\u003e \"The\u0026nbsp; \u0027Owigin Question.\u0027\u0026nbsp; The\u0026nbsp; place of\u0026nbsp; the owigin\u0026nbsp; of the\u0026nbsp; human species,y\u0027know. Suahly\u0026nbsp; you must know that it is\u0026nbsp; thought that owiginally the humanwace occupied only one planetawy system.\"\"Well, yes, I know that.\"\"Of cohse, no\u0026nbsp; one knows exactly which system it is ? lost in the mists ofantiquity. Theah\u0026nbsp; ah theawies, howevah. Siwius,\u0026nbsp; some say. Othahs insist onAlpha Centauwi, oah on Sol, oah on 61 Cygni ?all in the Siwius sectah, yousee.\"\"And what does Lameth say?\"\"Well,\u0026nbsp; he goes off\u0026nbsp; along a new\u0026nbsp; twail completely.\u0026nbsp; He twies to\u0026nbsp; show thatahchaeological\u0026nbsp; wemains on the\u0026nbsp; thuhd planet\u0026nbsp; of the Ahctuwian\u0026nbsp; System showthat\u0026nbsp; humanity\u0026nbsp;\u0026nbsp; existed\u0026nbsp; theah\u0026nbsp;\u0026nbsp; befoah\u0026nbsp; theah\u0026nbsp; wah\u0026nbsp;\u0026nbsp; any\u0026nbsp; indications\u0026nbsp; ofspace-twavel.\"\"And that means it was humanity\u0027s birth planet?\"\"P\u0027haps. I must wead it closely and weigh the evidence befoah I can sayfoah cuhtain. One must see just how weliable his obsuhvations ah.\"Hardin remained\u0026nbsp; silent for a short\u0026nbsp; while. Then he said,\u0026nbsp; \"When did Lamethwrite his book?\"\"Oh ?I should say about eight hundwed yeahs ago. Of cohse, he has based itlahgely on the pwevious wuhk of Gleen.\"\"Then why\u0026nbsp; rely on\u0026nbsp; him? Why not go\u0026nbsp; to Arcturus and study\u0026nbsp; the remains foryourself?\"Lord Dorwin raised his\u0026nbsp; eyebrows and took a pinch of snuff hurriedly. \"Why,whatevah foah, my deah fellow?\"\"To get the information firsthand, of course.\"\"But\u0026nbsp; wheah\u0027s\u0026nbsp; the\u0026nbsp; necessity?\u0026nbsp;\u0026nbsp; It\u0026nbsp; seems\u0026nbsp; an\u0026nbsp; uncommonly\u0026nbsp; woundabout\u0026nbsp; andhopelessly wigmawolish\u0026nbsp; method of\u0026nbsp; getting anywheahs. Look\u0026nbsp; heah, now, I\u0027vegot\u0026nbsp; the wuhks of\u0026nbsp; all the old\u0026nbsp; mastahs ? the gweat ahchaeologists\u0026nbsp; of thepast. I wigh them\u0026nbsp; against each othah ?balance the disagweements ?analyzethe conflicting statements ?decide which is pwobably cowwect ?and come toa conclusion. That is the scientific method. At least\" ?patronizingly ?asI see it. How insuffewably cwude it would be to go to Ahctuwus, oah to Sol,foah instance,\u0026nbsp; and blundah\u0026nbsp; about, when the\u0026nbsp; old mastahs have\u0026nbsp; covahed thegwound\u0026nbsp; so\u0026nbsp; much moah\u0026nbsp; effectually\u0026nbsp; than\u0026nbsp; we could\u0026nbsp; possibly\u0026nbsp; hope to\u0026nbsp; do.\"Hardin murmured politely, \"I see.\"\"Come,\u0026nbsp; milord,\"\u0026nbsp; said\u0026nbsp; Pirenne,\u0026nbsp;\u0026nbsp; \"think\u0026nbsp; we\u0026nbsp; had\u0026nbsp; better\u0026nbsp; be\u0026nbsp; returning.\"\"Ah, yes. P\u0027haps we had.\"As\u0026nbsp; they\u0026nbsp; left\u0026nbsp; the\u0026nbsp; room, Hardin\u0026nbsp; said\u0026nbsp; suddenly,\u0026nbsp; \"Milord,\u0026nbsp; may\u0026nbsp; I ask\u0026nbsp; aquestion?\"Lord\u0026nbsp; Dorwin\u0026nbsp; smiled blandly\u0026nbsp; and\u0026nbsp; emphasized\u0026nbsp; his answer\u0026nbsp; with a\u0026nbsp; graciousflutter of\u0026nbsp; the hand. \"Cuhtainly, my\u0026nbsp; deah fellow. Only too\u0026nbsp; happy to be ofsuhvice. If\u0026nbsp; I can help you\u0026nbsp; in any way fwom\u0026nbsp; my pooah stoah of knowledge-\"\"It isn\u0027t exactly about archaeology, milord.\"\"No?\"\"No.\u0026nbsp; It\u0027s this:\u0026nbsp; Last year\u0026nbsp; we received\u0026nbsp; news here\u0026nbsp; in Terminus\u0026nbsp; about themeltdown of a power plant on Planet V of Gamma Andromeda. We got the barestoutline of the accident\u0026nbsp; ?no details at all. I wonder if you could tell meexactly what happened.\"Pirenne\u0027s mouth twisted. \"I wonder you annoy his lordship with questions ontotally irrelevant subjects.\"\"Not at\u0026nbsp; all, Doctah Piwenne,\" interceded the\u0026nbsp; chancellor. \"It is quite allwight. Theah\u0026nbsp; isn\u0027t much to say concuhning it in\u0026nbsp; any case. The powah plantdid\u0026nbsp; undergo meltdown\u0026nbsp; and it\u0026nbsp; was quite\u0026nbsp; a catastwophe, y\u0027know.\u0026nbsp; I believewadiatsen damage.\u0026nbsp; Weally, the govuhnment is\u0026nbsp; sewiously considewing placingseveah westwictions\u0026nbsp; upon the indiscwiminate use\u0026nbsp; of nucleah powah ?thoughthat is not a thing for genewal publication, y\u0027know.\"\"I\u0026nbsp; understand,\"\u0026nbsp; said\u0026nbsp; Hardin.\u0026nbsp; \"But\u0026nbsp; what\u0026nbsp; was\u0026nbsp; wrong\u0026nbsp; with\u0026nbsp; the\u0026nbsp; plant?\"\"Well,\u0026nbsp; weally,\"\u0026nbsp; replied Lord\u0026nbsp; Dorwin\u0026nbsp; indifferently, \"who\u0026nbsp; knows? It\u0026nbsp; hadbwoken down\u0026nbsp; some yeahs pweviously and it\u0026nbsp; is thought that the weplacementsand wepaiah\u0026nbsp; wuhk wuh most infewiah. It is so\u0026nbsp; difficult these days to findmen\u0026nbsp; who\u0026nbsp; weally\u0026nbsp; undahstand\u0026nbsp; the\u0026nbsp; moah\u0026nbsp; technical details\u0026nbsp; of\u0026nbsp; ouah\u0026nbsp; powahsystems.\" And he took a sorrowful pinch of snuff.\n\u003cbr\u003e \"You realize,\" said Hardin, \"that the independent kingdoms of the Peripheryhad lost nuclear power altogether?\"\"Have they?\u0026nbsp; I\u0027m not at all\u0026nbsp; suhpwised. Bahbawous planets?Oh,\u0026nbsp; but my deahfellow, don\u0027t call them independent. They ahn\u0027t, y\u0027know. The tweaties we\u0027vemade with them ah\u0026nbsp; pwoof positive of that. They acknowledge the soveweigntyof the Empewah. They\u0027d have to, of cohse, oah we wouldn\u0027t tweat with them.\"\"That\u0026nbsp; may\u0026nbsp;\u0026nbsp; be\u0026nbsp; so,\u0026nbsp; but\u0026nbsp; they\u0026nbsp;\u0026nbsp; have\u0026nbsp; considerable\u0026nbsp; freedom\u0026nbsp; of\u0026nbsp; action.\"\"Yes, I suppose so.\u0026nbsp; Considewable. But that scahcely mattahs. The Empiah isfah bettah\u0026nbsp; off, with the Pewiphewy\u0026nbsp; thwown upon its own\u0026nbsp; wesoahces ?as itis,\u0026nbsp; moah oah\u0026nbsp; less.\u0026nbsp; They ahn\u0027t\u0026nbsp; any good\u0026nbsp; to\u0026nbsp; us, y\u0027know.\u0026nbsp; Most bahbawousplanets. Scahcely civilized.\"\"They were\u0026nbsp; civilized in the past.\u0026nbsp; Anacreon was one of\u0026nbsp; the richest of theoutlying provinces.\u0026nbsp; I understand it compared\u0026nbsp; favorably with Vega itself.\"\"Oh, but, Hahdin, that\u0026nbsp; was centuwies ago. You can scahcely dwaw conclusionfwom that. Things wah\u0026nbsp; diffewent in the old gweat days. We ahn\u0027t the men weused\u0026nbsp; to be,\u0026nbsp; y\u0027know. But,\u0026nbsp; Hahdin, come,\u0026nbsp; you ah\u0026nbsp; a most\u0026nbsp; puhsistent chap.\n\u003cbr\u003e I\u0027ve told\u0026nbsp; you I\u0026nbsp; simply won\u0027t discuss\u0026nbsp; business today. Doctah\u0026nbsp; Piwenne didpwepayah me\u0026nbsp; foah you. He told\u0026nbsp; me you would twy to\u0026nbsp; badgah me, but I\u0027m fahtoo\u0026nbsp; old a\u0026nbsp; hand foah\u0026nbsp; that. Leave\u0026nbsp; it foah\u0026nbsp; next day.\u0026nbsp; And that\u0026nbsp; was that.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47152.html","bookId":127,"creation":"Aug 1, 2019 4:37:17 AM","modification":"Aug 1, 2019 4:37:17 AM"}
