{"id":3434,"no":4,"title":"Chapter 2","content":"The ship\u0026nbsp; landed in a medley\u0026nbsp; of noises. There was\u0026nbsp; the far-off hiss of theatmosphere cutting\u0026nbsp; and sliding past the\u0026nbsp; metal of the ship.\u0026nbsp; There was thesteady drone\u0026nbsp; of the\u0026nbsp; conditioners fighting the\u0026nbsp; heat of friction,\u0026nbsp; and theslower rumble\u0026nbsp; of the\u0026nbsp; engines enforcing deceleration. There\u0026nbsp; was the humansound of men and\u0026nbsp; women gathering in the debarkation rooms and the grind ofthe hoists lifting baggage, mail, and freight to the long axis of the ship,from\u0026nbsp; which they\u0026nbsp; would\u0026nbsp; be later\u0026nbsp; moved along\u0026nbsp; to the\u0026nbsp; unloading platform.\n\u003cbr\u003e Gaal\u0026nbsp; felt\u0026nbsp; the\u0026nbsp; slight\u0026nbsp; jar that\u0026nbsp; indicated\u0026nbsp; the\u0026nbsp; ship\u0026nbsp; no\u0026nbsp; longer had\u0026nbsp; anindependent\u0026nbsp; motion of\u0026nbsp; its\u0026nbsp; own. Ship\u0027s\u0026nbsp; gravity\u0026nbsp; had been\u0026nbsp; giving way\u0026nbsp; toplanetary\u0026nbsp; gravity\u0026nbsp; for hours.\u0026nbsp; Thousands\u0026nbsp; of passengers\u0026nbsp; had been\u0026nbsp; sittingpatiently\u0026nbsp; in\u0026nbsp; the\u0026nbsp; debarkation\u0026nbsp;\u0026nbsp; rooms\u0026nbsp; which\u0026nbsp; swung\u0026nbsp; easily\u0026nbsp; on\u0026nbsp; yieldingforce-fields to\u0026nbsp; accommodate its\u0026nbsp; orientation to the\u0026nbsp; changing direction ofthe gravitational forces. Now\u0026nbsp; they were crawling down curving ramps to thelarge, yawning locks.\n\u003cbr\u003e Gaal\u0027s\u0026nbsp; baggage was\u0026nbsp; minor.\u0026nbsp; He stood\u0026nbsp; at a\u0026nbsp; desk,\u0026nbsp; as it\u0026nbsp; was\u0026nbsp; quickly andexpertly taken\u0026nbsp; apart and\u0026nbsp; put together again.\u0026nbsp; His visa was\u0026nbsp; inspected andstamped. He himself paid no attention.\n\u003cbr\u003e This was\u0026nbsp; Trantor! The air seemed a little thicker\u0026nbsp; here, the gravity a bitgreater, than on his\u0026nbsp; home planet of Synnax, but he would get used to that.\n\u003cbr\u003e He wondered if he would get used to immensity.\n\u003cbr\u003e Debarkation\u0026nbsp; Building\u0026nbsp; was tremendous.\u0026nbsp; The\u0026nbsp; roof\u0026nbsp; was almost\u0026nbsp; lost in\u0026nbsp; theheights.\u0026nbsp; Gaal could\u0026nbsp; almost\u0026nbsp; imagine that\u0026nbsp; clouds could\u0026nbsp; form\u0026nbsp; beneath itsimmensity. He could see no opposite wall; just men and desks and convergingfloor till it faded out in haze.\n\u003cbr\u003e The man at the\u0026nbsp; desk was speaking again. He sounded annoyed. He said, \"Moveon, Dornick.\" He had to open the visa, look again, before he remembered thename.\n\u003cbr\u003e Gaal said, \"Where?where?\n\u003cbr\u003e The man\u0026nbsp; at the desk jerked\u0026nbsp; a thumb, \"Taxis to\u0026nbsp; the right and third left.\"Gaal moved, seeing the\u0026nbsp; glowing twists of air suspended high in nothingnessand reading, \"TAXIS TO ALL POINTS.\"A figure\u0026nbsp; detached itself from anonymity\u0026nbsp; and stopped at the\u0026nbsp; desk, as Gaalleft. The\u0026nbsp; man at the desk looked up and\u0026nbsp; nodded briefly. The figure noddedin return and followed the young immigrant.\n\u003cbr\u003e He was in time to hear Gaal\u0027s destination.\n\u003cbr\u003e Gaal found himself hard against a railing.\n\u003cbr\u003e The small\u0026nbsp; sign said, \"Supervisor.\" The\u0026nbsp; man to whom the\u0026nbsp; sign referred didnot look up. He said, \"Where to?\"Gaal wasn\u0027t\u0026nbsp; sure, but even a\u0026nbsp; few seconds hesitation meant\u0026nbsp; men queuing inline behind him.\n\u003cbr\u003e The Supervisor looked up, \"Where to?\"Gaal\u0027s funds were low,\u0026nbsp; but there was only this one night and then he wouldhave\u0026nbsp; a\u0026nbsp; job.\u0026nbsp; He\u0026nbsp; tried\u0026nbsp; to\u0026nbsp; sound\u0026nbsp; nonchalant, \"A\u0026nbsp; good\u0026nbsp; hotel,\u0026nbsp; please.\"The\u0026nbsp;\u0026nbsp; Supervisor\u0026nbsp;\u0026nbsp; was\u0026nbsp; unimpressed,\u0026nbsp;\u0026nbsp; \"They\u0027re\u0026nbsp;\u0026nbsp; all\u0026nbsp;\u0026nbsp; good.\u0026nbsp; Name\u0026nbsp;\u0026nbsp; one.\"Gaal said, desperately, \"The nearest one, please.\"The\u0026nbsp; Supervisor touched\u0026nbsp; a button. A\u0026nbsp; thin line\u0026nbsp; of light formed\u0026nbsp; along thefloor,\u0026nbsp; twisting\u0026nbsp; among others\u0026nbsp; which\u0026nbsp; brightened and\u0026nbsp; dimmed in\u0026nbsp; differentcolors\u0026nbsp; and\u0026nbsp; shades. A\u0026nbsp; ticket\u0026nbsp; was\u0026nbsp; shoved into\u0026nbsp; Gaal\u0027s\u0026nbsp; hands. It\u0026nbsp; glowedfaintly.\n\u003cbr\u003e The Supervisor said, \"One point twelve.\"Gaal fumbled for the coins. He said, \"Where do I go?\"\"Follow the\u0026nbsp; light. The ticket will keep glowing\u0026nbsp; as long as you\u0027re pointedin the tight direction.\"Gaal looked\u0026nbsp; up and began walking. There\u0026nbsp; were hundreds creeping across thevast\u0026nbsp; floor,\u0026nbsp; following\u0026nbsp; their\u0026nbsp; individual trails,\u0026nbsp; sifting\u0026nbsp; and\u0026nbsp; strainingthemselves\u0026nbsp; through\u0026nbsp; intersection\u0026nbsp; points\u0026nbsp; to arrive\u0026nbsp; at\u0026nbsp; their\u0026nbsp; respectivedestinations.\n\u003cbr\u003e His own trail ended.\u0026nbsp; A man in glaring blue and yellow uniform, shining andnew\u0026nbsp;\u0026nbsp; in\u0026nbsp;\u0026nbsp; unstainable\u0026nbsp;\u0026nbsp; plasto-textile,\u0026nbsp;\u0026nbsp; reached\u0026nbsp; for\u0026nbsp;\u0026nbsp; his\u0026nbsp;\u0026nbsp; two\u0026nbsp;\u0026nbsp; bags.\n\u003cbr\u003e \"Direct line to the Luxor,\" he said.\n\u003cbr\u003e The man\u0026nbsp; who followed Gaal heard that. He also\u0026nbsp; heard Gaal say, \"Fine,\" andwatched him enter the blunt-nosed vehicle.\n\u003cbr\u003e The\u0026nbsp; taxi\u0026nbsp; lifted straight\u0026nbsp; up.\u0026nbsp; Gaal\u0026nbsp; stared out\u0026nbsp; the curved,\u0026nbsp; transparentwindow,\u0026nbsp; marvelling\u0026nbsp; at\u0026nbsp; the\u0026nbsp; sensation\u0026nbsp; of airflight\u0026nbsp; within\u0026nbsp; an\u0026nbsp; enclosedstructure and clutching instinctively at the back of the driver\u0027s seat. Thevastness contracted and the\u0026nbsp; people became ants in random distribution. Thescene contracted further and began to slide backward.\n\u003cbr\u003e There was a wall ahead. It began high in the air and extended upward out ofsight. It\u0026nbsp; was riddled with holes\u0026nbsp; that were the mouths\u0026nbsp; of tunnels. Gaal\u0027staxi moved\u0026nbsp; toward one\u0026nbsp; then plunged into\u0026nbsp; it. For a\u0026nbsp; moment, Gaal wonderedidly how his driver could pick out one among so many.\n\u003cbr\u003e There\u0026nbsp; was now\u0026nbsp; only\u0026nbsp; blackness, with\u0026nbsp; nothing but\u0026nbsp; the past-flashing\u0026nbsp; of acolored signal\u0026nbsp; light to relieve the\u0026nbsp; gloom. The air was\u0026nbsp; full of a rushingsound.\n\u003cbr\u003e Gaal leaned\u0026nbsp; forward against deceleration\u0026nbsp; then and the taxi\u0026nbsp; popped out ofthe tunnel and descended to ground-level once more.\n\u003cbr\u003e \"The Luxor Hotel,\" said\u0026nbsp; the driver, unnecessarily. He helped Gaal with hisbaggage, accepted\u0026nbsp; a tenth-credit tip with a\u0026nbsp; businesslike air, picked up awaiting passenger, and was rising again.\n\u003cbr\u003e In all\u0026nbsp; this, from the moment of debarkation, there\u0026nbsp; had been no glimpse ofsky.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47132.html","bookId":127,"creation":"Aug 1, 2019 4:36:21 AM","modification":"Aug 1, 2019 4:36:21 AM"}
