{"id":3480,"no":50,"title":"PART IV THE TRADERS","content":"TRADERS?..\u0026nbsp; and constantly\u0026nbsp; in advance\u0026nbsp; of the\u0026nbsp; political hegemony\u0026nbsp; of theFoundation were\u0026nbsp; the Traders, reaching out\u0026nbsp; tenuous fingerholds through thetremendous distances\u0026nbsp; of the Periphery. Months\u0026nbsp; or years might pass betweenlandings on Terminus; their\u0026nbsp; ships were often nothing more than patchquiltsof\u0026nbsp; home-made repairs\u0026nbsp; and improvisations;\u0026nbsp; their honesty\u0026nbsp; was none\u0026nbsp; of thehighest; their daring...\n\u003cbr\u003e Through\u0026nbsp;\u0026nbsp; it\u0026nbsp; all\u0026nbsp;\u0026nbsp; they\u0026nbsp;\u0026nbsp; forged\u0026nbsp; an\u0026nbsp;\u0026nbsp; empire\u0026nbsp; more\u0026nbsp;\u0026nbsp; enduring\u0026nbsp;\u0026nbsp; than\u0026nbsp; thepseudo-religious despotism of the Four Kingdoms...\n\u003cbr\u003e Tales\u0026nbsp; without end\u0026nbsp; are\u0026nbsp; told of\u0026nbsp; these\u0026nbsp; massive, lonely\u0026nbsp; figures who\u0026nbsp; borehalf-seriously, half-mockingly a motto\u0026nbsp; adopted from one of Salvor Hardin\u0027sepigrams, \"Never\u0026nbsp; let your sense of\u0026nbsp; morals prevent you from\u0026nbsp; doing what isright!\"\u0026nbsp; It\u0026nbsp; is difficult\u0026nbsp; now\u0026nbsp; to\u0026nbsp; tell which\u0026nbsp; tales\u0026nbsp; are\u0026nbsp; real and\u0026nbsp; whichapocryphal.\u0026nbsp; There\u0026nbsp;\u0026nbsp; are\u0026nbsp; none\u0026nbsp;\u0026nbsp; probably\u0026nbsp; that\u0026nbsp; have\u0026nbsp;\u0026nbsp; not\u0026nbsp; suffered\u0026nbsp; someexaggeration....\n\u003cbr\u003e ENCYCLOPEDIA GALACTICALimmar Ponyets was completely a-lather when the call reached his receiver ?\n\u003cbr\u003e which proves\u0026nbsp; that the old bromide about\u0026nbsp; telemessages and the shower holdstrue\u0026nbsp;\u0026nbsp; even\u0026nbsp; in\u0026nbsp;\u0026nbsp; the\u0026nbsp; dark,\u0026nbsp;\u0026nbsp; hard\u0026nbsp; space\u0026nbsp;\u0026nbsp; of\u0026nbsp; the\u0026nbsp;\u0026nbsp; Galactic\u0026nbsp; Periphery.\n\u003cbr\u003e Luckily that\u0026nbsp; part of\u0026nbsp; a free-lance trade\u0026nbsp; ship which is not\u0026nbsp; given over tomiscellaneous merchandise\u0026nbsp; is extremely snug. So\u0026nbsp; much so, that the shower,hot water\u0026nbsp; included, is located in\u0026nbsp; a two-by-four cubby, ten\u0026nbsp; feet from thecontrol\u0026nbsp; panels. Ponyets heard\u0026nbsp; the staccato\u0026nbsp; rattle of the\u0026nbsp; receiver quiteplainly.\n\u003cbr\u003e Dripping suds\u0026nbsp; and a growl, he\u0026nbsp; stepped out to adjust\u0026nbsp; the vocal, and threehours later\u0026nbsp; a second\u0026nbsp; trade ship was\u0026nbsp; alongside, and a\u0026nbsp; grinning youngsterentered through the air tube between the ships.\n\u003cbr\u003e Ponyets\u0026nbsp; rattled\u0026nbsp; his\u0026nbsp; best\u0026nbsp; chair\u0026nbsp; forward\u0026nbsp; and\u0026nbsp; perched\u0026nbsp; himself\u0026nbsp; on\u0026nbsp; thepilot-swivel.\n\u003cbr\u003e \"What\u0027ve you\u0026nbsp; been doing, Gorm?\" he asked, darkly.\u0026nbsp; \"Chasing me all the wayfrom the Foundation?\"Les Gorm\u0026nbsp; broke out a cigarette, and shook his\u0026nbsp; head definitely, \"Me? Not achance. I\u0027m just a\u0026nbsp; sucker who happened to land on Glyptal IV the day afterthe mail. So they sent me out after you with this.\"The\u0026nbsp;\u0026nbsp; tiny,\u0026nbsp; gleaming\u0026nbsp;\u0026nbsp; sphere\u0026nbsp; changed\u0026nbsp;\u0026nbsp; hands,\u0026nbsp; and\u0026nbsp; Gorm\u0026nbsp;\u0026nbsp; added,\u0026nbsp; \"It\u0027sconfidential. Super-secret. Can\u0027t be trusted to the sub-ether and all that.\n\u003cbr\u003e Or\u0026nbsp; so I\u0026nbsp; gather. At\u0026nbsp; least, it\u0027s\u0026nbsp; a Personal\u0026nbsp; Capsule, and won\u0027t\u0026nbsp; open foranyone but you.\"Ponyets regarded\u0026nbsp; the capsule distastefully,\u0026nbsp; \"I can see that.\u0026nbsp; And I neverknew one of these to hold good news, either.\"It opened in his\u0026nbsp; hand and the thin, transparent tape unrolled stiffly. Hiseyes swept the message\u0026nbsp; quickly, for when the last of the tape had emerged,the first\u0026nbsp; was already\u0026nbsp; brown and crinkled. In\u0026nbsp; a minute and a\u0026nbsp; half it hadturned black and, molecule by molecule, fallen apart.\n\u003cbr\u003e Ponyets grunted hollowly, \"Oh, Galaxy!\"Les\u0026nbsp; Gorm\u0026nbsp; said\u0026nbsp; quietly,\u0026nbsp; \"Can I\u0026nbsp; help\u0026nbsp; somehow?\u0026nbsp; Or\u0026nbsp; is\u0026nbsp; it too\u0026nbsp; secret?\"\"It\u0026nbsp; will bear\u0026nbsp; telling,\u0026nbsp; since you\u0027re\u0026nbsp; of the\u0026nbsp; Guild.\u0026nbsp; I\u0027ve got\u0026nbsp; to\u0026nbsp; go toAskone.\"\"That place? How come?\"\"They\u0027ve imprisoned a trader. But keep it to yourself.\u0027\u0027\n\u003cbr\u003e Gorm\u0027s\u0026nbsp; expression\u0026nbsp; jolted\u0026nbsp; into\u0026nbsp; anger, \"Imprisoned!\u0026nbsp; That\u0027s\u0026nbsp; against\u0026nbsp; theConvention.\"\"So is the interference with local politics.\"\"Oh! Is\u0026nbsp; that what\u0026nbsp; he did?\" Gorm\u0026nbsp; meditated. \"Who\u0027s the\u0026nbsp; trader\u0027? Anyone Iknow?\"\"No!\" said Ponyets sharply,\u0026nbsp; and Gorm accepted the implication and asked nofurther questions.\n\u003cbr\u003e Ponyets\u0026nbsp; was up\u0026nbsp; and staring\u0026nbsp; darkly out\u0026nbsp; the visiplate. He\u0026nbsp; mumbled strongexpressions at\u0026nbsp; that part of the\u0026nbsp; misty lens-form that was\u0026nbsp; the body of theGalaxy,\u0026nbsp; then\u0026nbsp; said\u0026nbsp; loudly,\u0026nbsp;\u0026nbsp; \"Damnedest\u0026nbsp; mess!\u0026nbsp; I\u0027m\u0026nbsp; way\u0026nbsp; behind\u0026nbsp; quota.\"Light broke\u0026nbsp; on Gorm\u0027s intellect,\u0026nbsp; \"Hey, friend, Askone is\u0026nbsp; a closed area.\"\"That\u0027s right. You can\u0027t sell as much as a penknife on Askone. They won\u0027tbuy nuclear gadgets of any sort. With my quota dead on its feet, it\u0027smurder to go there.\"\"Can\u0027t get out of it?\"Ponyets shook his head absently, A know the fellow involved. Can\u0027t walk outon a friend. What\u0026nbsp; of it? I am in the hands of the Galactic Spirit and walkcheerfully in the way he points out.\"Gorm said blankly, \"Huh?\"Ponyets looked\u0026nbsp; at him, and laughed shortly, \"I\u0026nbsp; forgot. You never read the\u0027Bood of the Spirit,\u0027 did you?\"\"Never heard of it,\" said Gorm, curtly.\n\u003cbr\u003e \"Well, you would if you\u0027d had a religious training.\"\"Religious\u0026nbsp; training? For\u0026nbsp; the\u0026nbsp; priesthood?\"\u0026nbsp; Gorm was\u0026nbsp; profoundly shocked.\n\u003cbr\u003e \"Afraid so. It\u0027s my\u0026nbsp; dark shame and secret. I was too much for the ReverendFathers, though, They expelled\u0026nbsp; me, for reasons sufficient to promote me toa secular education under\u0026nbsp; the Foundation. Well, look, I\u0027d better push off.\n\u003cbr\u003e How\u0027s your quota this year?\"Gorm\u0026nbsp; crushed out\u0026nbsp; his cigarette and\u0026nbsp; adjusted his\u0026nbsp; cap, \"I\u0027ve got\u0026nbsp; my lastcargo going now. I\u0027ll make it.\"\"Lucky fellow,\" gloomed Ponyets,\u0026nbsp; and for many minutes after Les Gorm left,he sat in motionless reverie.\n\u003cbr\u003e So Eskel Gorov was on Askone ?and in prison as well!\n\u003cbr\u003e That was bad! In\u0026nbsp; fact, considerably worse than it might appear. It was onething\u0026nbsp; to tell\u0026nbsp; a curious youngster\u0026nbsp; a diluted\u0026nbsp; version of the\u0026nbsp; business tothrow him\u0026nbsp; off and send\u0026nbsp; him about his own.\u0026nbsp; It was a thing\u0026nbsp; of a differentsort to face the truth.\n\u003cbr\u003e For\u0026nbsp; Limmar Ponyets was\u0026nbsp; one of the\u0026nbsp; few people\u0026nbsp; who happened to\u0026nbsp; know thatMaster\u0026nbsp; Trader Eskel\u0026nbsp; Gorov\u0026nbsp; was not\u0026nbsp; a trader\u0026nbsp; at\u0026nbsp; all; but\u0026nbsp; that entirelydifferent thing, an agent of the Foundation!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47178.html","bookId":127,"creation":"Aug 1, 2019 4:38:28 AM","modification":"Aug 1, 2019 4:38:28 AM"}
