{"id":3488,"no":58,"title":"Chapter 5","content":"Another\u0026nbsp; week\u0026nbsp; rubbed away\u0026nbsp; before\u0026nbsp; the\u0026nbsp; meeting with\u0026nbsp; Pherl was\u0026nbsp; arranged.\n\u003cbr\u003e Ponyets\u0026nbsp; felt the\u0026nbsp; tension,\u0026nbsp; but he\u0026nbsp; was used\u0026nbsp; to\u0026nbsp; the feeling\u0026nbsp; of physicalhelplessness now.\u0026nbsp; He had left city\u0026nbsp; limits under guard. He\u0026nbsp; was in Pherl\u0027ssuburban villa\u0026nbsp; under guard. There was nothing to\u0026nbsp; do but accept it withouteven looking over his shoulder.\n\u003cbr\u003e Pherl was\u0026nbsp; taller and\u0026nbsp; younger outside the\u0026nbsp; circle of Elders.\u0026nbsp; In nonformalcostume, he seemed no Elder at all.\n\u003cbr\u003e He said\u0026nbsp; abruptly, \"You\u0027re\u0026nbsp; a peculiar man.\"\u0026nbsp; His close-set eyes\u0026nbsp; seemed toquiver. \"You\u0027ve\u0026nbsp; done nothing\u0026nbsp; this last week, and\u0026nbsp; particularly these lasttwo hours, but imply that I need gold. It seems useless labor, for who doesnot? Why not advance one step?\"\"It is\u0026nbsp; not simply gold,\"\u0026nbsp; said Ponyets, discreetly. \"Not\u0026nbsp; simply gold. Notmerely\u0026nbsp; a\u0026nbsp; coin\u0026nbsp; or\u0026nbsp;\u0026nbsp; two.\u0026nbsp; It\u0026nbsp; is\u0026nbsp; rather\u0026nbsp; all\u0026nbsp; that\u0026nbsp; lies\u0026nbsp; behind\u0026nbsp; gold.\"\"Now what\u0026nbsp; can lie behind\u0026nbsp; gold?\" prodded Pherl, with\u0026nbsp; a down-curved smile.\n\u003cbr\u003e \"Certainly this\u0026nbsp; is not\u0026nbsp; the preliminary of\u0026nbsp; another clumsy demonstration.\"\"Clumsy?\" Ponyets frowned slightly.\n\u003cbr\u003e \"Oh, definitely.\"\u0026nbsp; Pherl folded his\u0026nbsp; hands and nudged them\u0026nbsp; gently with hischin. \"I\u0026nbsp; don\u0027t criticize you. The clumsiness was on\u0026nbsp; purpose, I am sure. Imight have warned his Veneration of that, had I been certain of the motive.\n\u003cbr\u003e Now\u0026nbsp; had I\u0026nbsp; been you,\u0026nbsp; I would\u0026nbsp; have produced\u0026nbsp; the gold\u0026nbsp; upon my\u0026nbsp; ship, andoffered it\u0026nbsp; alone. The show you\u0026nbsp; offered us and the\u0026nbsp; antagonism you arousedwould have been dispensed with.\"\"True,\"\u0026nbsp; Ponyets\u0026nbsp; admitted,\u0026nbsp; \"but\u0026nbsp; since\u0026nbsp; I\u0026nbsp; was\u0026nbsp; myself,\u0026nbsp; I\u0026nbsp; accepted\u0026nbsp; theantagonism for the sake of attracting your attention.\"\"Is that\u0026nbsp; it? Simply that?\" Pherl\u0026nbsp; made no effort to\u0026nbsp; hide his contemptuousamusement. \"And I imagine\u0026nbsp; you suggested the thirty-day purification periodthat you might assure yourself time to turn the attraction into something abit\u0026nbsp; more\u0026nbsp; substantial. But\u0026nbsp; what\u0026nbsp; if the\u0026nbsp; gold\u0026nbsp; turns out\u0026nbsp; to be\u0026nbsp; impure?\"Ponyets allowed himself a dark humor in return, \"When the judgement of thatimpurity depends\u0026nbsp; upon those who\u0026nbsp; are most interested in\u0026nbsp; finding it pure?\"Pherl lifted his eyes\u0026nbsp; and stared narrowly at the trader. He seemed at oncesurprised and satisfied.\n\u003cbr\u003e \"A\u0026nbsp; sensible\u0026nbsp;\u0026nbsp; point.\u0026nbsp; Now\u0026nbsp; tell\u0026nbsp;\u0026nbsp; me\u0026nbsp; why\u0026nbsp; you\u0026nbsp; wished\u0026nbsp;\u0026nbsp; to\u0026nbsp; attract\u0026nbsp; me.\"\"This I will do. In the short time I have been here, I have observed usefulfacts that\u0026nbsp; concern you and\u0026nbsp; interest me. For instance,\u0026nbsp; you are young-veryyoung for a member\u0026nbsp; of the council, and even of a relatively young family.\"\"You criticize my family?\"\"Not at\u0026nbsp; all. Your ancestors are\u0026nbsp; great and holy; all\u0026nbsp; will admit that. Butthere are those\u0026nbsp; that say you are not a member of\u0026nbsp; one of the Five Tribes.\"Pherl leaned\u0026nbsp; back, \"With\u0026nbsp; all respect to\u0026nbsp; those involved,\" and\u0026nbsp; he did nothide his\u0026nbsp; venom, \"the Five\u0026nbsp; Tribes have impoverished loins\u0026nbsp; and thin blood.\n\u003cbr\u003e Not fifty members of the Tribes are alive.\"\"Yet there are those who say the nation would not be willing to see any manoutside\u0026nbsp; the Tribes\u0026nbsp; as\u0026nbsp; Grand Master.\u0026nbsp; And so\u0026nbsp; young and\u0026nbsp; newly-advanced afavorite of\u0026nbsp; the Grand Master is\u0026nbsp; bound to make powerful\u0026nbsp; enemies among thegreat\u0026nbsp; ones of\u0026nbsp; the State\u0026nbsp; ?it is\u0026nbsp; said. His\u0026nbsp; Veneration is aging\u0026nbsp; and hisprotection will\u0026nbsp; not last past his death, when it is\u0026nbsp; an enemy of yours whowill\u0026nbsp; undoubtedly\u0026nbsp; be\u0026nbsp; the\u0026nbsp; one to\u0026nbsp; interpret\u0026nbsp; the\u0026nbsp; words\u0026nbsp; of his\u0026nbsp; Spirit.\"Pherl\u0026nbsp; scowled, \"For\u0026nbsp; a foreigner\u0026nbsp; you hear\u0026nbsp; much. Such\u0026nbsp; ears are\u0026nbsp; made forcropping.\"\"That may be decided later.\"\"Let me\u0026nbsp; anticipate.\" Pherl stirred impatiently\u0026nbsp; in his seat. \"You\u0027re goingto offer\u0026nbsp; me wealth\u0026nbsp; and power in\u0026nbsp; terms of those evil\u0026nbsp; little machines youcarry in your ship. Well?\"\"Suppose it so. What\u0026nbsp; would be your objection? Simply your standard of goodand evil?\"Pherl shook\u0026nbsp; his head. \"Not at all. Look, my\u0026nbsp; Outlander, your opinion of usin your heathen\u0026nbsp; agnosticism is what it is ?but I\u0026nbsp; am not the entire slaveof our mythology, though I may appear so. I am an educated man, sir, and, Ihope, an\u0026nbsp; enlightened one. The full depth of\u0026nbsp; our religious customs, in theritualistic\u0026nbsp;\u0026nbsp; rather\u0026nbsp; than\u0026nbsp;\u0026nbsp; the\u0026nbsp; ethical\u0026nbsp;\u0026nbsp; sense,\u0026nbsp; is\u0026nbsp; for\u0026nbsp;\u0026nbsp; the\u0026nbsp; masses.\"\"Your objection, then?\" pressed Ponyets, gently.\n\u003cbr\u003e \"Just\u0026nbsp; that. The\u0026nbsp; masses. I\u0026nbsp; might be\u0026nbsp; willing to\u0026nbsp; deal with you,\u0026nbsp; but yourlittle machines must be\u0026nbsp; used to be useful. How might riches come to me, ifI had to use\u0026nbsp; ?what is it you sell??well, a\u0026nbsp; razor, for instance, only inthe strictest, trembling secrecy. Even if my chin were more simply and morecleanly shaven, how would I become rich? And how would I avoid death by gaschamber\u0026nbsp; or\u0026nbsp; mob\u0026nbsp; frightfulness\u0026nbsp; if I\u0026nbsp; were\u0026nbsp; ever\u0026nbsp; once\u0026nbsp; caught using\u0026nbsp; it?\"Ponyets shrugged, \"You are correct. I might point out that the remedy wouldbe\u0026nbsp; to\u0026nbsp; educate\u0026nbsp; your\u0026nbsp; own\u0026nbsp; people\u0026nbsp; into\u0026nbsp; the\u0026nbsp; use of\u0026nbsp; nucleics\u0026nbsp; for\u0026nbsp; theirconvenience and\u0026nbsp; your own substantial profit. It\u0026nbsp; would be a gigantic pieceof work;\u0026nbsp; I don\u0027t\u0026nbsp; deny it; but\u0026nbsp; the returns would be\u0026nbsp; still more gigantic.\n\u003cbr\u003e Still that\u0026nbsp; is your\u0026nbsp; concern, and, at\u0026nbsp; the moment, not\u0026nbsp; mine at\u0026nbsp; all. For Ioffer\u0026nbsp;\u0026nbsp; neither\u0026nbsp;\u0026nbsp; razor,\u0026nbsp;\u0026nbsp; knife,\u0026nbsp;\u0026nbsp; nor\u0026nbsp;\u0026nbsp; mechanical\u0026nbsp;\u0026nbsp; garbage\u0026nbsp;\u0026nbsp; disposer.\"\"What do you offer?\"\"Gold itself. Directly. You may have the machine I demonstrated last week.\"And now\u0026nbsp; Pherl stiffened and the\u0026nbsp; skin on his forehead\u0026nbsp; moved jerkily. \"Thetransmuter?\"\"Exactly.\u0026nbsp; Your supply\u0026nbsp; of gold\u0026nbsp; will equal\u0026nbsp; your supply\u0026nbsp; of iron.\u0026nbsp; That, Iimagine, is\u0026nbsp; sufficient for all needs.\u0026nbsp; Sufficient for the Grand Mastershipitself, despite youth and enemies. And it is safe.\"\"In what way?\"\"In that secrecy is the essence of its use; that same secrecy you describedas the only safety\u0026nbsp; with regard to nucleics. You may bury the transmuter inthe deepest dungeon of\u0026nbsp; the strongest fortress on your furthest estate, andit will\u0026nbsp; still bring\u0026nbsp; you instant wealth. It\u0026nbsp; is the gold you\u0026nbsp; buy, not themachine, and that gold\u0026nbsp; bears no trace of its manufacture, for it cannot betold from the natural creation.\"\"And who is to operate the machine?\"\"Yourself. Five\u0026nbsp; minutes teaching is all\u0026nbsp; you will require. I\u0027ll\u0026nbsp; set it upfor you wherever you wish.\"\"And in return?\"\"Well,\" Ponyets grew cautious.\u0026nbsp; \"I ask a price and a handsome one. It is myliving. Let\u0026nbsp; us say,?for it\u0026nbsp; its a valuable machine\u0026nbsp; ?the equivalent of acubic foot of gold in wrought iron.\"Pherl laughed, and Ponyets grew red. \"I point out, sir,\" he added, stiffly,\"that you can get your price back in two hours.\"\"True, and\u0026nbsp; in one hour, you\u0026nbsp; might be gone, and\u0026nbsp; my machine might suddenlyturn out to be useless. I\u0027ll need a guarantee.\"\"You have my word.\"\"A very good one,\" Pherl bowed sardonically, \"but your presence would be aneven better\u0026nbsp; assurance. I\u0027ll\u0026nbsp; give you\u0026nbsp; my word to\u0026nbsp; pay you\u0026nbsp; one week afterdelivery in working order.\"\"Impossible.\"\"Impossible? When you\u0027ve already incurred the death penalty very handily byeven offering\u0026nbsp; to sell\u0026nbsp; me anything. The\u0026nbsp; only alternative is\u0026nbsp; my word thatyou\u0027ll get the gas chamber tomorrow otherwise.\"Ponyet\u0027s\u0026nbsp; face was expressionless,\u0026nbsp; but his\u0026nbsp; eyes might have\u0026nbsp; flickered. Hesaid, \"It\u0026nbsp; is an\u0026nbsp; unfair advantage. You\u0026nbsp; will at least put\u0026nbsp; your promise inwriting?\"\"And\u0026nbsp; also become\u0026nbsp; liable\u0026nbsp; for execution?\u0026nbsp; No, sir!\"\u0026nbsp; Pherl smiled\u0026nbsp; a broadsatisfaction. \"No, sir! Only one of us is a fool.\"The trader said in a small voice, \"It is agreed, then.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47230.html","bookId":127,"creation":"Aug 1, 2019 4:38:54 AM","modification":"Aug 1, 2019 4:38:54 AM"}
