{"id":3492,"no":62,"title":"PART V THE MERCHANT PRINCES","content":"TRADERS-...\u0026nbsp; With\u0026nbsp; psychohistoric inevitability.\u0026nbsp; economic\u0026nbsp; control of\u0026nbsp; theFoundation\u0026nbsp; grew. The\u0026nbsp; traders grew\u0026nbsp; rich; and\u0026nbsp; with riches\u0026nbsp; came power....\n\u003cbr\u003e It\u0026nbsp; is sometimes\u0026nbsp; forgotten\u0026nbsp; that Hober\u0026nbsp; Mallow began\u0026nbsp; life as\u0026nbsp; an ordinarytrader. It is never forgotten that he ended it as the first of the MerchantPrinces....\n\u003cbr\u003e ENCYCLOPEDIA GALACTICAJorane Sutt put the\u0026nbsp; tips of carefully-manicured fingers together and said,\"It\u0027s something\u0026nbsp; of a\u0026nbsp; puzzle. In fact\u0026nbsp; ?and this\u0026nbsp; is in\u0026nbsp; the strictest ofconfidence\u0026nbsp;\u0026nbsp; ? it\u0026nbsp;\u0026nbsp; may\u0026nbsp; be\u0026nbsp;\u0026nbsp; another\u0026nbsp; one\u0026nbsp;\u0026nbsp; of\u0026nbsp; Hari\u0026nbsp;\u0026nbsp; Seldon\u0027s\u0026nbsp; crises.\"The\u0026nbsp; man opposite felt\u0026nbsp; in the pocket\u0026nbsp; of his\u0026nbsp; short Smyrnian jacket\u0026nbsp; for acigarette.\u0026nbsp; \"Don\u0027t know about\u0026nbsp; that, Sutt.\u0026nbsp; As a general\u0026nbsp; rule, politiciansstart\u0026nbsp;\u0026nbsp; shouting\u0026nbsp;\u0026nbsp; \u0027Seldon\u0026nbsp;\u0026nbsp;\u0026nbsp; crisis\u0027\u0026nbsp;\u0026nbsp; at\u0026nbsp;\u0026nbsp; every\u0026nbsp;\u0026nbsp; mayoralty\u0026nbsp;\u0026nbsp; campaign.\"Sutt\u0026nbsp; smiled\u0026nbsp; very\u0026nbsp; faintly, \"I\u0027m\u0026nbsp; not\u0026nbsp; campaigning,\u0026nbsp; Mallow. We\u0027re\u0026nbsp; facingnuclear\u0026nbsp;\u0026nbsp; weapons,\u0026nbsp; and\u0026nbsp;\u0026nbsp; we\u0026nbsp; don\u0027t\u0026nbsp;\u0026nbsp; know\u0026nbsp; where\u0026nbsp; they\u0027re\u0026nbsp;\u0026nbsp; coming\u0026nbsp; from.\"Hober\u0026nbsp;\u0026nbsp; Mallow\u0026nbsp;\u0026nbsp; of\u0026nbsp; Smyrno,\u0026nbsp;\u0026nbsp; Master\u0026nbsp;\u0026nbsp; Trader,\u0026nbsp;\u0026nbsp; smoked\u0026nbsp; quietly,\u0026nbsp;\u0026nbsp; almostindifferently. \"Go\u0026nbsp; on. If you have more to say,\u0026nbsp; get it out.\" Mallow nevermade the\u0026nbsp; mistake of being overpolite\u0026nbsp; to a Foundation man.\u0026nbsp; He might be anOutlander, but a man\u0027s a man for a?that.\n\u003cbr\u003e Sutt\u0026nbsp; indicated the\u0026nbsp; trimensional star-map\u0026nbsp; on the\u0026nbsp; table. He\u0026nbsp; adjusted thecontrols\u0026nbsp; and a\u0026nbsp; cluster\u0026nbsp; of some\u0026nbsp; half-dozen stellar\u0026nbsp; systems\u0026nbsp; blazed red.\n\u003cbr\u003e \u0027That,\" he said quietly, \"is the Korellian Republic.\"The trader\u0026nbsp; nodded, \"I\u0027ve been\u0026nbsp; there. Stinking rathole! I\u0026nbsp; suppose you cancall it a republic but it\u0027s always someone out of the Argo family that getselected Commdor each time. And if you ever don\u0027t like it ?things happen toyou.\"\u0026nbsp;\u0026nbsp; He\u0026nbsp;\u0026nbsp; twisted\u0026nbsp;\u0026nbsp; his\u0026nbsp;\u0026nbsp; lip\u0026nbsp;\u0026nbsp; and\u0026nbsp;\u0026nbsp; repeated,\u0026nbsp;\u0026nbsp; \"I\u0027ve\u0026nbsp;\u0026nbsp; been\u0026nbsp;\u0026nbsp; there.\"\"But\u0026nbsp; you\u0027ve come back,\u0026nbsp; which hasn\u0027t\u0026nbsp; always happened. Three\u0026nbsp; trade ships,inviolate under\u0026nbsp; the Conventions, have disappeared\u0026nbsp; within the territory ofthe\u0026nbsp; Republic in the\u0026nbsp; last year. And\u0026nbsp; those ships\u0026nbsp; were armed with\u0026nbsp; all theusual nuclear explosives and force-field defenses.\"\"What was the last word heard from the ships?\"\"Routine reports. Nothing else.\"\"What did Korell say?\"Sutt\u0027s\u0026nbsp; eyes\u0026nbsp; gleamed\u0026nbsp; sardonically,\u0026nbsp; \"There\u0026nbsp; was\u0026nbsp; no way\u0026nbsp; of\u0026nbsp; asking.\u0026nbsp; TheFoundation\u0027s greatest\u0026nbsp; asset throughout the Periphery\u0026nbsp; is its reputation ofpower.\u0026nbsp; Do\u0026nbsp; you\u0026nbsp; think\u0026nbsp; we\u0026nbsp; can\u0026nbsp; lose\u0026nbsp; three\u0026nbsp; ships\u0026nbsp; and\u0026nbsp;\u0026nbsp; ask\u0026nbsp; for\u0026nbsp; them?\"\"Well, then, suppose you tell me what you want with me.\"Jorane Sutt did not waste his time in the luxury of annoyance. As secretaryto the mayor, he had held off opposition councilmen, jobseekers, reformers,and\u0026nbsp; crackpots who\u0026nbsp; claimed to have\u0026nbsp; solved in\u0026nbsp; its entirety the\u0026nbsp; course offuture history\u0026nbsp; as worked out by\u0026nbsp; Hari Seldon. With training\u0026nbsp; like that, ittook a good deal to disturb him.\n\u003cbr\u003e He said\u0026nbsp; methodically, \"In a moment. You see, three\u0026nbsp; ships lost in the samesector\u0026nbsp; in\u0026nbsp; the same\u0026nbsp; year\u0026nbsp; can\u0027t be\u0026nbsp; accident,\u0026nbsp; and nuclear\u0026nbsp; power can\u0026nbsp; beconquered only by more nuclear power. The question automatically arises: ifKorell has nuclear weapons, where is it getting them?\"\"And where does it?\"\"Two alternatives. Either the Korellians have constructed them themselves?\n\u003cbr\u003e \"Far-fetched!\"\"Very! But the other possibility is that we are being afflicted with a caseof treason.\"\"You think so?\" Mallow\u0027s voice was cold.\n\u003cbr\u003e The\u0026nbsp; secretary\u0026nbsp;\u0026nbsp; said\u0026nbsp; calmly,\u0026nbsp;\u0026nbsp; \"There\u0027s\u0026nbsp; nothing\u0026nbsp; miraculous\u0026nbsp;\u0026nbsp; about\u0026nbsp; thepossibility. Since the Four Kingdoms accepted the Foundation Convention, wehave had to deal\u0026nbsp; with considerable groups of dissident populations in eachnation. Each former kingdom has its pretenders and its former noblemen, whocan\u0027t very\u0026nbsp; well pretend to love the Foundation.\u0026nbsp; Some of them are becomingactive, perhaps.\"Mallow was a dull red. \"I see. Is there anything you want to say to me? I\u0027ma Smyrnian.\"\"I\u0026nbsp; know. You\u0027re\u0026nbsp; a\u0026nbsp; Smyrnian ? born in\u0026nbsp; Smyrno,\u0026nbsp; one of\u0026nbsp; the\u0026nbsp; former FourKingdoms. You\u0027re\u0026nbsp; a Foundation man\u0026nbsp; by education only. By\u0026nbsp; birth, you\u0027re anOutlander and\u0026nbsp; a foreigner.\u0026nbsp; No doubt your\u0026nbsp; grandfather was a\u0026nbsp; baron at thetime of the wars\u0026nbsp; with Anacreon and Loris, and no doubt your family estateswere taken away when Sef Sermak redistributed the land.\"\"No, by\u0026nbsp; Black Space,\u0026nbsp; no! My grandfather was\u0026nbsp; a blood-poor son-of-a-spacerwho died heaving coal\u0026nbsp; at starving wages before the Foundation took over. Iowe\u0026nbsp; nothing to\u0026nbsp; the old\u0026nbsp; regime. But\u0026nbsp; I was\u0026nbsp; born in\u0026nbsp; Smyrno, and\u0026nbsp; I\u0027m notashamed of either Smyrno or Smyrnians, by the Galaxy. Your sly little hintsof treason\u0026nbsp; aren\u0027t going to\u0026nbsp; panic me into licking\u0026nbsp; Foundation spittle. Andnow you can either\u0026nbsp; give your orders or make your accusations. I don\u0027t carewhich.\"\"My good\u0026nbsp; Master Trader, I don\u0027t care\u0026nbsp; an electron whether your grandfatherwas King\u0026nbsp; of Smyrno\u0026nbsp; or the greatest\u0026nbsp; pauper on the planet.\u0026nbsp; I recited thatrigmarole about your birth and ancestry to show you that I\u0027m not interestedin\u0026nbsp; them. Evidently,\u0026nbsp; you missed\u0026nbsp; the point.\u0026nbsp; Let\u0027s go\u0026nbsp; back now.\u0026nbsp; You\u0027re aSmyrnian. You\u0026nbsp; know the\u0026nbsp; Outlanders. Also, you\u0027re\u0026nbsp; a trader and\u0026nbsp; one of thebest.\u0026nbsp; You\u0027ve been\u0026nbsp; to\u0026nbsp; Korell and\u0026nbsp; you know\u0026nbsp; the Korellians.\u0026nbsp; That\u0027s whereyou\u0027ve got to go.\"Mallow breathed deeply, \"As a spy?\"\"Not at\u0026nbsp; all. As a trader\u0026nbsp; ?but with your\u0026nbsp; eyes open. If you\u0026nbsp; can find outwhere\u0026nbsp; the power\u0026nbsp; is\u0026nbsp; coming from\u0026nbsp; ?I\u0026nbsp; might\u0026nbsp; remind you,\u0026nbsp; since\u0026nbsp; you\u0027re aSmyrnian,\u0026nbsp; that\u0026nbsp; two\u0026nbsp; of\u0026nbsp; those\u0026nbsp; lost\u0026nbsp; trade\u0026nbsp; ships\u0026nbsp; had\u0026nbsp; Smyrnian\u0026nbsp; crews.\"\"When do I start?\"\"When will your ship be ready?\"\"In six days.\"\"Then that\u0027s when you start. You\u0027ll have all the details at the Admiralty.\"\"Right!\"\u0026nbsp;\u0026nbsp; The\u0026nbsp; trader\u0026nbsp;\u0026nbsp; rose,\u0026nbsp; shook\u0026nbsp;\u0026nbsp; hands\u0026nbsp; roughly,\u0026nbsp; and\u0026nbsp;\u0026nbsp; strode\u0026nbsp; out.\n\u003cbr\u003e Sutt waited, spreading his fingers gingerly and rubbing out the pressure;then shrugged his shoulders and stepped into the mayor\u0027s office.\n\u003cbr\u003e The mayor deadened the visiplate and leaned back. \"What do you make of it,Sutt?\"\"He could be a good actor,\" said Sutt, and stared thoughtfully ahead.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47234.html","bookId":127,"creation":"Aug 1, 2019 4:39:06 AM","modification":"Aug 1, 2019 4:39:06 AM"}
