{"id":3438,"no":8,"title":"Chapter 4","content":"PSYCHOHISTORY?..Gaal Dornick,\u0026nbsp; using nonmathematical concepts, has definedpsychohistory\u0026nbsp; to\u0026nbsp; be\u0026nbsp; that\u0026nbsp; branch of\u0026nbsp; mathematics\u0026nbsp; which\u0026nbsp; deals with\u0026nbsp; thereactions of\u0026nbsp; human conglomerates to fixed\u0026nbsp; social and economic stimuli....\n\u003cbr\u003e ...\u0026nbsp; Implicit in\u0026nbsp; all these\u0026nbsp; definitions is\u0026nbsp; the assumption that\u0026nbsp; the humanconglomerate being\u0026nbsp; dealt with is sufficiently\u0026nbsp; large for valid statisticaltreatment. The\u0026nbsp; necessary size of such a\u0026nbsp; conglomerate may be determined bySeldon\u0027s First Theorem which ... A further necessary assumption is that thehuman conglomerate\u0026nbsp; be itself\u0026nbsp; unaware of psychohistoric\u0026nbsp; analysis in orderthat its reactions be truly random ...\n\u003cbr\u003e The basis of all valid psychohistory lies in the development of the Seldon.\n\u003cbr\u003e Functions which\u0026nbsp; exhibit properties\u0026nbsp; congruent to those of\u0026nbsp; such social andeconomic forces as ...\n\u003cbr\u003e ENCYCLOPEDIA GALACTICA\"Good afternoon, sir,\" said Gaal. \"I?I?\n\u003cbr\u003e \"You didn\u0027t think we were to meet before tomorrow? Ordinarily, we would nothave. It is just that if we are to use your services, we must work quickly.\n\u003cbr\u003e It grows continually more difficult to obtain recruits.\"\"I don\u0027t understand, sir.\"\"You\u0026nbsp; were\u0026nbsp; talking to\u0026nbsp; a\u0026nbsp; man on\u0026nbsp; the\u0026nbsp; observation tower,\u0026nbsp; were you\u0026nbsp; not?\"\"Yes.\u0026nbsp; His\u0026nbsp;\u0026nbsp; first\u0026nbsp; name\u0026nbsp;\u0026nbsp; is\u0026nbsp; Jerril.\u0026nbsp; I\u0026nbsp;\u0026nbsp; know\u0026nbsp; no\u0026nbsp; more\u0026nbsp;\u0026nbsp; about\u0026nbsp; him.\u0026nbsp; \"\"His name is nothing. He is an agent of the Commission of Public Safety. Hefollowed you from the space-port.\"\"But why? I am afraid I am very confused.\"\"Did the man on the tower say nothing about me?\"Gaal hesitated, \"He referred to you as Raven Seldon.\"\"Did he say why?\"\"He said you predict disaster.\"\"I do. What does Trantor mean to you?\"Everyone seemed to be asking his opinion of Trantor. Gaal felt incapable ofresponse beyond the bare word, \"Glorious.\"\"You say that without thinking. What of psychohistory?\"\"I haven\u0027t thought of applying it to the problem.\"\"Before\u0026nbsp; you\u0026nbsp; are\u0026nbsp; done\u0026nbsp; with\u0026nbsp; me,\u0026nbsp; young\u0026nbsp; man,\u0026nbsp; you will\u0026nbsp; learn\u0026nbsp; to\u0026nbsp; applypsychohistory\u0026nbsp; to all\u0026nbsp; problems as a\u0026nbsp; matter\u0026nbsp; of course.\u0026nbsp; 朞bserve.\" Seldonremoved his calculator pad from the pouch at his belt. Men said he kept onebeneath\u0026nbsp; his pillow\u0026nbsp; for use\u0026nbsp; in moments\u0026nbsp; of wakefulness. Its\u0026nbsp; gray, glossyfinish was slightly worn\u0026nbsp; by use. Seldon\u0027s nimble fingers, spotted now withage, played\u0026nbsp; along the files and\u0026nbsp; rows of buttons that\u0026nbsp; filled its surface.\n\u003cbr\u003e Red symbols glowed out from the upper tier.\n\u003cbr\u003e He\u0026nbsp; said,\u0026nbsp; \"That\u0026nbsp; represents\u0026nbsp; the\u0026nbsp; condition\u0026nbsp; of the\u0026nbsp; Empire\u0026nbsp; at\u0026nbsp; present.\"He waited.\n\u003cbr\u003e Gaal\u0026nbsp; said\u0026nbsp; finally,\u0026nbsp; \"Surely\u0026nbsp; that\u0026nbsp; is\u0026nbsp; not\u0026nbsp; a\u0026nbsp; complete\u0026nbsp; representation.\"\"No,\u0026nbsp; not complete,\"\u0026nbsp; said Seldon.\u0026nbsp; \"I am\u0026nbsp; glad you\u0026nbsp; do not accept\u0026nbsp; my wordblindly. However, this is\u0026nbsp; an approximation which will serve to demonstratethe proposition. Will you accept that?\"\"Subject to my later\u0026nbsp; verification of the derivation of the function, yes.\"Gaal was carefully avoiding a possible trap.\n\u003cbr\u003e \"Good.\u0026nbsp; Add\u0026nbsp; to\u0026nbsp; this\u0026nbsp; the\u0026nbsp; known probability\u0026nbsp; of\u0026nbsp; Imperial\u0026nbsp; assassination,viceregal\u0026nbsp; revolt,\u0026nbsp; the\u0026nbsp; contemporary\u0026nbsp; recurrence of\u0026nbsp; periods\u0026nbsp; of\u0026nbsp; economicdepression,\u0026nbsp; the\u0026nbsp; declining\u0026nbsp; rate\u0026nbsp; of\u0026nbsp; planetary explorations,\u0026nbsp; the.\u0026nbsp; ....\"He proceeded. As each item was mentioned, new symbols sprang to life at histouch,\u0026nbsp; and melted\u0026nbsp; into\u0026nbsp; the basic\u0026nbsp; function which\u0026nbsp; expanded\u0026nbsp; and changed.\n\u003cbr\u003e Gaal\u0026nbsp; stopped\u0026nbsp;\u0026nbsp; him\u0026nbsp; only\u0026nbsp; once.\u0026nbsp;\u0026nbsp; \"I\u0026nbsp; don\u0027t\u0026nbsp; see\u0026nbsp; the\u0026nbsp;\u0026nbsp; validity\u0026nbsp; of\u0026nbsp; thatset-transformation.\"Seldon repeated it more slowly.\n\u003cbr\u003e Gaal\u0026nbsp; said,\u0026nbsp; \"But that\u0026nbsp; is\u0026nbsp; done\u0026nbsp; by way\u0026nbsp; of\u0026nbsp; a forbidden\u0026nbsp; sociooperation.\"\"Good. You are quick, but not yet quick enough. It is not forbidden in thisconnection. Let me do it by expansions.\"The procedure was much longer and at its end, Gaal said, humbly, \"Yes, Isee now.\"Finally, Seldon stopped. \"This is Trantor three centuries from now. How doyou interpret that? Eh?\" He put his head to one side and waited.\n\u003cbr\u003e Gaal said, unbelievingly, \"Total destruction! But ?but that is impossible.\n\u003cbr\u003e Trantor has never been ?\n\u003cbr\u003e Seldon was filled with the intense excitement of a man whose body only hadgrown old. \"Come, come. You saw how the result was arrived at. Put it intowords. Forget the symbolism for a moment.\"Gaal said, \"As Trantor becomes more specialized, it be comes morevulnerable, less able to defend itself. Further, as it becomes more andmore the administrative center of Empire, it becomes a greater prize. Asthe Imperial succession becomes more and more uncertain, and the feudsamong the great families more rampant, social responsibility disappears. \"\"Enough. And what of the numerical probability of total destruction withinthree centuries?\"\"I couldn\u0027t tell.\"\"Surely you can perform a field-differentiation?\"Gaal felt himself under pressure. He was not offered the calculator pad. Itwas held a foot from his eyes. He calculated furiously and felt hisforehead grow slick with sweat.\n\u003cbr\u003e He said, \"About 85%?\"\"Not bad,\" said Seldon, thrusting out a lower lip, \"but not good. Theactual figure is 92.5%.\"Gaal said, \"And so you are called Raven Seldon? I have seen none of this inthe journals.\"\"But of course not. This is unprintable. Do you suppose the Imperium couldexpose its shakiness in this manner. That is a very simple demonstration inpsychohistory. But some of our results have leaked out among thearistocracy.\"\"That\u0027s bad.\"\"Not necessarily. All is taken into account.\"\"But is that why I\u0027m being investigated?\"\"Yes. Everything about my project is being investigated.\"\"Are you in danger, sir?\"\"Oh, yes. There is probability of 1.7% that I will be executed, but ofcourse that will not stop the project. We have taken that into account aswell. Well, never mind. You will meet me, I suppose, at the Universitytomorrow?\"\"I will,\" said Gaal.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47136.html","bookId":127,"creation":"Aug 1, 2019 4:36:32 AM","modification":"Aug 1, 2019 4:36:32 AM"}
