{"id":3510,"no":80,"title":"Chapter 10","content":"Onum\u0026nbsp; Barr\u0026nbsp; was\u0026nbsp; an\u0026nbsp; old\u0026nbsp; man,\u0026nbsp; too\u0026nbsp; old\u0026nbsp; to\u0026nbsp; be\u0026nbsp; afraid.\u0026nbsp; Since\u0026nbsp; the\u0026nbsp; lastdisturbances, he had lived alone on the fringes of the land with what bookshe had saved from\u0026nbsp; the ruins. He had nothing he feared losing, least of allthe\u0026nbsp; worn\u0026nbsp; remnant of\u0026nbsp; his\u0026nbsp; life,\u0026nbsp; and so\u0026nbsp; he\u0026nbsp; faced\u0026nbsp; the intruder\u0026nbsp; withoutcringing.\n\u003cbr\u003e \"Your door was open,\" the stranger explained.\n\u003cbr\u003e His\u0026nbsp; accent was\u0026nbsp; clipped and\u0026nbsp; harsh, and\u0026nbsp; Barr did\u0026nbsp; not fail to\u0026nbsp; notice thestrange blue-steel\u0026nbsp; hand-weapon at his hip. In the\u0026nbsp; half gloom of the smallroom,\u0026nbsp; Barr\u0026nbsp;\u0026nbsp; saw\u0026nbsp; the\u0026nbsp;\u0026nbsp; glow\u0026nbsp; of\u0026nbsp; a\u0026nbsp; force-shield\u0026nbsp;\u0026nbsp; surrounding\u0026nbsp; the\u0026nbsp; man.\n\u003cbr\u003e He\u0026nbsp; said, wearily,\u0026nbsp; \"There\u0026nbsp; is no\u0026nbsp; reason to\u0026nbsp; keep it\u0026nbsp; closed. Do\u0026nbsp; you wishanything of me?\"\"Yes.\" The\u0026nbsp; stranger remained\u0026nbsp; standing in the\u0026nbsp; center of the\u0026nbsp; room. He waslarge,\u0026nbsp; both in\u0026nbsp; height and\u0026nbsp; bulk. \"Yours\u0026nbsp; is the\u0026nbsp; only house\u0026nbsp; about here.\"\"It is a desolate\u0026nbsp; place,\" agreed Barr, \"but there is a town to the east. Ican show you the way\u0027.\"\"In a while. May I sit?\"\"If the\u0026nbsp; chairs will hold you,\"\u0026nbsp; said the old man,\u0026nbsp; gravely. They were old,too. Relics of a better youth.\n\u003cbr\u003e The stranger\u0026nbsp; said, \"My name is Hober Mallow. I\u0026nbsp; come from a far province.\"Barr nodded\u0026nbsp; and smiled, \"Your tongue convicted you of\u0026nbsp; that long ago. I amOnum\u0026nbsp;\u0026nbsp; Barr\u0026nbsp;\u0026nbsp; of\u0026nbsp;\u0026nbsp; Siwenna\u0026nbsp;\u0026nbsp; ? and\u0026nbsp;\u0026nbsp; once\u0026nbsp;\u0026nbsp; Patrician\u0026nbsp;\u0026nbsp; of\u0026nbsp; the\u0026nbsp;\u0026nbsp; Empire.\"\"Then this is Siwenna. I had only old maps to guide me.\"\"They would\u0026nbsp; have to be\u0026nbsp; old, indeed, for star-positions\u0026nbsp; to be misplaced.\"Barr sat\u0026nbsp; quite still, while the other\u0027s eyes\u0026nbsp; drifted away into a reverie.\n\u003cbr\u003e He noticed\u0026nbsp; that the nuclear\u0026nbsp; force-shield had vanished from\u0026nbsp; about the manand admitted\u0026nbsp; dryly to himself that his\u0026nbsp; person no longer seemed formidableto\u0026nbsp; strangers\u0026nbsp;\u0026nbsp; ? or\u0026nbsp; even,\u0026nbsp; for\u0026nbsp; good\u0026nbsp; or\u0026nbsp;\u0026nbsp; for\u0026nbsp; evil,\u0026nbsp; to\u0026nbsp; his\u0026nbsp; enemies.\n\u003cbr\u003e He said, \"My house\u0026nbsp; is poor and my resources few. You may share what I haveif your stomach can endure black bread and dried corn.\"Mallow shook his head,\u0026nbsp; \"No, I have eaten, and I can\u0027t stay. All I need arethe directions to the center of government.\"\"That is easily enough\u0026nbsp; done, and poor though I am, deprives me of nothing.\n\u003cbr\u003e Do\u0026nbsp; you\u0026nbsp; mean the\u0026nbsp; capital\u0026nbsp; of\u0026nbsp; the planet,\u0026nbsp; or\u0026nbsp; of\u0026nbsp; the Imperial\u0026nbsp; Sector?\"The\u0026nbsp; younger man\u0027s\u0026nbsp; eyes narrowed,\u0026nbsp; \"Aren\u0027t the\u0026nbsp; two identical?\u0026nbsp; Isn\u0027t thisSiwenna?\"The old\u0026nbsp; patrician nodded slowly,\u0026nbsp; \"Siwenna, yes. But Siwenna\u0026nbsp; is no longercapital of the Normannic Sector. Your old map has misled you after all. Thestars may\u0026nbsp; not change even\u0026nbsp; in centuries, but political\u0026nbsp; boundaries are alltoo fluid.\"\"That\u0027s too\u0026nbsp; bad. In\u0026nbsp; fact, that\u0027s very\u0026nbsp; bad. Is the new\u0026nbsp; capital far off?\"\"It\u0027s on Orsha II. Twenty parsecs off. Your map will direct you. How old isit?\"\"A hundred and fifty years.\"\"That old?\"\u0026nbsp; The old\u0026nbsp; man sighed. \"History\u0026nbsp; has been crowded\u0026nbsp; since. Do youknow any of it?\"Mallow shook his bead slowly.\n\u003cbr\u003e Barr said,\u0026nbsp; \"You\u0027re fortunate. It has been an\u0026nbsp; evil time for the provinces,but for\u0026nbsp; the reign of Stannell VI, and he died\u0026nbsp; fifty years ago. Since thattime, rebellion\u0026nbsp; and ruin,\u0026nbsp; ruin and rebellion.\"\u0026nbsp; Barr wondered if\u0026nbsp; he weregrowing\u0026nbsp; garrulous. It was\u0026nbsp; a lonely life\u0026nbsp; out here,\u0026nbsp; and he had\u0026nbsp; so littlechance to talk to men.\n\u003cbr\u003e Mallow said with sudden\u0026nbsp; sharpness, \"Ruin, eh? You sound as if the provincewere impoverished.\"\"Perhaps not\u0026nbsp; on an\u0026nbsp; absolute scale. The physical\u0026nbsp; resources of twenty-fivefirst-rank planets\u0026nbsp; take a long time\u0026nbsp; to use up. Compared\u0026nbsp; to the wealth ofthe last\u0026nbsp; century, though, we have gone a long way\u0026nbsp; downhill ?and there isno sign\u0026nbsp; of turning, not yet. Why are you so\u0026nbsp; interested in all this, youngman? You are all alive and your eyes shine!\"The trader\u0026nbsp; came near enough to blushing, as the\u0026nbsp; faded eyes seemed to looktoo deep into his and smile at what they saw.\n\u003cbr\u003e He said, \"Now look here. I\u0027m a trader out there ?out toward the rim of theGalaxy.\u0026nbsp; I\u0027ve located\u0026nbsp; some\u0026nbsp; old maps,\u0026nbsp; and I\u0027m\u0026nbsp; out\u0026nbsp; to open\u0026nbsp; new markets.\n\u003cbr\u003e Naturally, talk of impoverished\u0026nbsp; provinces disturbs me. You can\u0027t get moneyout\u0026nbsp; of a\u0026nbsp; world unless\u0026nbsp; money\u0027s there\u0026nbsp; to be\u0026nbsp; got. Now how\u0027s\u0026nbsp; Siwenna, forinstance?\"The old\u0026nbsp; man leaned forward, \"I\u0026nbsp; cannot say. It will\u0026nbsp; do even yet, perhaps.\n\u003cbr\u003e But\u0026nbsp; you a trader?\u0026nbsp; You look more like\u0026nbsp; a fighting man. You\u0026nbsp; hold your handnear your gun and there is a scar on your jawbone.\"Mallow jerked his head,\u0026nbsp; \"There isn\u0027t much law out there where I come from.\n\u003cbr\u003e Fighting and\u0026nbsp; scars are part of\u0026nbsp; a trader\u0027s overhead. But\u0026nbsp; fighting is onlyuseful when there\u0027s money\u0026nbsp; at the end, and if I can get it without, so muchthe\u0026nbsp; sweeter. Now\u0026nbsp; will\u0026nbsp; I find\u0026nbsp; enough money\u0026nbsp; here\u0026nbsp; to make\u0026nbsp; it\u0026nbsp; worth thefighting?\u0026nbsp;\u0026nbsp; I\u0026nbsp; take\u0026nbsp;\u0026nbsp; it\u0026nbsp;\u0026nbsp; I\u0026nbsp; can\u0026nbsp;\u0026nbsp; find\u0026nbsp; the\u0026nbsp;\u0026nbsp; fighting\u0026nbsp;\u0026nbsp; easily\u0026nbsp; enough.\"\"Easily enough,\" agreed Barr. \"You could join Wiscard\u0027s remnants in the RedStars. I don\u0027t know,\u0026nbsp; though, if you\u0027d call that fighting or piracy. Or youcould\u0026nbsp; join our\u0026nbsp; present gracious\u0026nbsp; viceroy ? gracious by right\u0026nbsp; of murder,pillage,\u0026nbsp; rapine,\u0026nbsp; and\u0026nbsp; the\u0026nbsp;\u0026nbsp; word\u0026nbsp; of\u0026nbsp; a\u0026nbsp; boy\u0026nbsp; Emperor,\u0026nbsp; since\u0026nbsp; rightfullyassassinated.\" The\u0026nbsp; patrician\u0027s thin\u0026nbsp; cheeks reddened. His\u0026nbsp; eyes closed andthen opened, bird-bright.\n\u003cbr\u003e \"You\u0026nbsp; don\u0027t\u0026nbsp; sound very\u0026nbsp; friendly\u0026nbsp; to\u0026nbsp; the viceroy,\u0026nbsp; Patrician Barr,\"\u0026nbsp; saidMallow. \"What if I\u0027m one of his spies?\"\"What if you are?\"\u0026nbsp; said Barr, bitterly. \"What can you take?\" He gestured awithered\u0026nbsp;\u0026nbsp; arm\u0026nbsp;\u0026nbsp; at\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; bare\u0026nbsp;\u0026nbsp; interior\u0026nbsp; of\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; decaying\u0026nbsp;\u0026nbsp; mansion.\n\u003cbr\u003e \"Your life.\"\"It would leave me\u0026nbsp; easily enough. It has been with me five years too long.\n\u003cbr\u003e But you\u0026nbsp; are not\u0026nbsp; one of the viceroy\u0027s\u0026nbsp; men. If you were,\u0026nbsp; perhaps even nowinstinctive\u0026nbsp;\u0026nbsp;\u0026nbsp; self-preservation\u0026nbsp;\u0026nbsp;\u0026nbsp; would\u0026nbsp;\u0026nbsp;\u0026nbsp; keep\u0026nbsp;\u0026nbsp;\u0026nbsp; my\u0026nbsp;\u0026nbsp; mouth\u0026nbsp;\u0026nbsp;\u0026nbsp; closed.\"\"How do you know?\"The old man laughed,\u0026nbsp; \"You seem suspicious ?Come, I\u0027ll wager you think I\u0027mtrying\u0026nbsp; to trap\u0026nbsp; you\u0026nbsp; into denouncing\u0026nbsp; the government.\u0026nbsp; No,\u0026nbsp; no. I\u0026nbsp; am pastpolitics.\"\"Past politics? Is a man ever past that? The words you used to describe theviceroy\u0026nbsp; ?what\u0026nbsp; were\u0026nbsp; they? Murder,\u0026nbsp; pillage, all\u0026nbsp; that. You\u0026nbsp; didn\u0027t soundobjective.\u0026nbsp;\u0026nbsp; Not\u0026nbsp;\u0026nbsp; exactly.\u0026nbsp;\u0026nbsp; Not\u0026nbsp;\u0026nbsp; as\u0026nbsp;\u0026nbsp; if\u0026nbsp; you\u0026nbsp;\u0026nbsp; were\u0026nbsp;\u0026nbsp; past\u0026nbsp;\u0026nbsp; politics.\"The\u0026nbsp; old man\u0026nbsp; shrugged, \"Memories\u0026nbsp; sting when\u0026nbsp; they come\u0026nbsp; suddenly. Listen!\n\u003cbr\u003e Judge\u0026nbsp; for yourself!\u0026nbsp; When\u0026nbsp; Siwenna was\u0026nbsp; the\u0026nbsp; provincial capital,\u0026nbsp; I was\u0026nbsp; apatrician and\u0026nbsp; a member of the provincial senate. My\u0026nbsp; family was an old andhonored one.\u0026nbsp; One of my\u0026nbsp; great-grandfathers had been?No,\u0026nbsp; never mind that.\n\u003cbr\u003e Past glories are poor feeding.\"\"I\u0026nbsp; take\u0026nbsp; it,\" said\u0026nbsp; Mallow,\u0026nbsp; \"there was\u0026nbsp; a\u0026nbsp; civil war,\u0026nbsp; or a\u0026nbsp; revolution.\"Barr\u0027s face darkened. \"Civil wars are chronic in these degenerate days, butSiwenna\u0026nbsp; had kept\u0026nbsp; apart.\u0026nbsp; Under Stannell\u0026nbsp; VI, it\u0026nbsp; had almost\u0026nbsp; achieved itsancient\u0026nbsp; prosperity. But\u0026nbsp; weak\u0026nbsp; emperors followed,\u0026nbsp; and weak\u0026nbsp; emperors meanstrong viceroys,\u0026nbsp; and our last\u0026nbsp; viceroy ?the same\u0026nbsp; Wiscard, whose remnantsstill\u0026nbsp; prey on the\u0026nbsp; commerce among the\u0026nbsp; Red Stars\u0026nbsp; ?aimed at\u0026nbsp; the ImperialPurple. He\u0026nbsp; wasn\u0027t the first to\u0026nbsp; aim. And if he\u0026nbsp; had succeeded, he wouldn\u0027thave been the first to succeed.\n\u003cbr\u003e \"But he\u0026nbsp; failed. For when the Emperor\u0027s\u0026nbsp; Admiral approached the province atthe head of a fleet, Siwenna itself rebelled against its rebel viceroy.\" Hestopped, sadly.\n\u003cbr\u003e Mallow found\u0026nbsp; himself tense\u0026nbsp; on the edge\u0026nbsp; of his seat,\u0026nbsp; and relaxed slowly,\"Please continue, sir.\"\"Thank you,\"\u0026nbsp; said Barr,\u0026nbsp; wearily. \"It\u0027s kind\u0026nbsp; of you to humor\u0026nbsp; an old man.\n\u003cbr\u003e They rebelled;\u0026nbsp; or I\u0026nbsp; should say, we rebelled,\u0026nbsp; for I was one\u0026nbsp; of the minorleaders. Wiscard left Siwenna, barely ahead of us, and the planet, and withit\u0026nbsp; the province,\u0026nbsp; were thrown open\u0026nbsp; to the\u0026nbsp; admiral with every\u0026nbsp; gesture ofloyalty to the Emperor. Why we did this, 朓\u0027m not sure. Maybe we felt loyalto\u0026nbsp; the symbol, if\u0026nbsp; not the person,\u0026nbsp; of the\u0026nbsp; Emperor, 朼 cruel\u0026nbsp; and viciouschild. Maybe we feared the horrors of a siege.\"\"Well?\" urged Mallow, gently.\n\u003cbr\u003e \"Well, came\u0026nbsp; the grim retort, \"that didn\u0027t suit\u0026nbsp; the admiral. He wanted theglory of conquering a\u0026nbsp; rebellious province and his men wanted the loot suchconquest would\u0026nbsp; involve. So while\u0026nbsp; the people were still\u0026nbsp; gathered in everylarge city,\u0026nbsp; cheering the\u0026nbsp; Emperor and his\u0026nbsp; admiral, he occupied\u0026nbsp; all armedcenters,\u0026nbsp; and\u0026nbsp; then\u0026nbsp; ordered\u0026nbsp; the population\u0026nbsp; put\u0026nbsp; to\u0026nbsp; the nuclear\u0026nbsp; blast.\"\"On what pretext?\"\"On the pretext that they had rebelled against their viceroy, the Emperor\u0027sanointed. And the admiral became the new viceroy, by virtue of one month ofmassacre,\u0026nbsp; pillage\u0026nbsp; and\u0026nbsp; complete\u0026nbsp; horror. I\u0026nbsp; had\u0026nbsp; six\u0026nbsp; sons.\u0026nbsp; Five died\u0026nbsp; ?\n\u003cbr\u003e variously. I had a daughter. I hope she died, eventually. I escaped becauseI was old.\u0026nbsp; I came here, too old to cause even\u0026nbsp; our viceroy worry.\" He benthis\u0026nbsp; gray head, \"They\u0026nbsp; left me nothing,\u0026nbsp; because I\u0026nbsp; had helped drive\u0026nbsp; out arebellious\u0026nbsp;\u0026nbsp; governor\u0026nbsp;\u0026nbsp; and\u0026nbsp;\u0026nbsp; deprived\u0026nbsp;\u0026nbsp;\u0026nbsp; an\u0026nbsp;\u0026nbsp; admiral\u0026nbsp;\u0026nbsp; of\u0026nbsp;\u0026nbsp; his\u0026nbsp;\u0026nbsp; glory.\"Mallow sat\u0026nbsp; silent, and\u0026nbsp; waited. Then, \"What\u0026nbsp; of your sixth\u0026nbsp; son?\" he askedsoftly.\n\u003cbr\u003e \"Eh?\" Barr\u0026nbsp; smiled acidly. \"He is safe, for he has\u0026nbsp; joined the admiral as acommon\u0026nbsp; soldier under\u0026nbsp; an assumed\u0026nbsp; name. He\u0026nbsp; is a\u0026nbsp; gunner in\u0026nbsp; the viceroy\u0027spersonal fleet.\u0026nbsp; Oh, no,\u0026nbsp; I see your eyes.\u0026nbsp; He is not an\u0026nbsp; unnatural son. Hevisits me when he can and gives me what he can. He keeps me alive. And someday, our\u0026nbsp; great and glorious viceroy will grovel to\u0026nbsp; his death, and it willbe my son who will be his executioner.\"\"And\u0026nbsp;\u0026nbsp; you\u0026nbsp;\u0026nbsp; tell\u0026nbsp;\u0026nbsp; this\u0026nbsp;\u0026nbsp; to\u0026nbsp; a\u0026nbsp;\u0026nbsp; stranger?\u0026nbsp;\u0026nbsp; You\u0026nbsp;\u0026nbsp; endanger\u0026nbsp; your\u0026nbsp;\u0026nbsp; son.\"\"No. I\u0026nbsp; help him, by\u0026nbsp; introducing a new enemy.\u0026nbsp; And were I a\u0026nbsp; friend of theviceroy, as\u0026nbsp; I am\u0026nbsp; his enemy, I would\u0026nbsp; tell him to string\u0026nbsp; outer space withships, clear to the rim of the Galaxy.\"\"There are no ships there?\"\"Did you find any? Did any space-guards question your entry? With ships fewenough, and the bordering provinces filled with their share of intrigue andiniquity, none\u0026nbsp; can be spared to guard the\u0026nbsp; barbarian outer suns. No dangerever threatened\u0026nbsp; us from the broken\u0026nbsp; edge of the Galaxy,\u0026nbsp; 杣ntil you came.\"\"I? I\u0027m no danger.\"\"There will be more after you.\"Mallow\u0026nbsp; shook\u0026nbsp;\u0026nbsp; his\u0026nbsp; head\u0026nbsp;\u0026nbsp; slowly,\u0026nbsp; \"I\u0027m\u0026nbsp; not\u0026nbsp; sure\u0026nbsp;\u0026nbsp; I\u0026nbsp; understand\u0026nbsp; you.\"\"Listen!\" There\u0026nbsp; was a\u0026nbsp; feverish edge to\u0026nbsp; the old man\u0027s voice.\u0026nbsp; \"I knew youwhen you\u0026nbsp; entered. You have a\u0026nbsp; force-shield about your body,\u0026nbsp; or had when Ifirst saw you.\"Doubtful silence, then, \"Yes, 朓 had.\"\"Good. That\u0026nbsp; was a flaw, but you didn\u0027t know that.\u0026nbsp; There are some things Iknow. It\u0027s\u0026nbsp; out of fashion in these decaying times\u0026nbsp; to be a scholar. Eventsrace and\u0026nbsp; flash past\u0026nbsp; and who cannot\u0026nbsp; fight the tide\u0026nbsp; with nuclear-blast inhand is swept away,\u0026nbsp; as I was. But I was a scholar,\u0026nbsp; and I know that in allthe\u0026nbsp; history of nucleics,\u0026nbsp; no portable\u0026nbsp; force-shield was ever\u0026nbsp; invented. Wehave force-shields ?huge,\u0026nbsp; lumbering powerhouses that will protect a city,or even a ship, but not one, single man.\"\"Ah?\" Mallow\u0027s\u0026nbsp; underlip thrust\u0026nbsp; out. \"And what\u0026nbsp; do you deduce\u0026nbsp; from that?\"\"There\u0026nbsp; have been\u0026nbsp; stories percolating\u0026nbsp; through space. They\u0026nbsp; travel strangepaths and\u0026nbsp; become distorted with every parsec, 朾ut\u0026nbsp; when I was young therewas a small ship of strange men, who did not know our customs and could nottell\u0026nbsp; where they came\u0026nbsp; from. They talked\u0026nbsp; of magicians\u0026nbsp; at the edge\u0026nbsp; of theGalaxy; magicians who glowed\u0026nbsp; in the darkness, who flew unaided through theair, and whom weapons would not touch.\n\u003cbr\u003e \"We laughed.\u0026nbsp; I laughed, too. I\u0026nbsp; forgot it till today.\u0026nbsp; But you glow in thedarkness, and I don\u0027t\u0026nbsp; think my blaster, if I had one, would hurt you. Tellme, can you fly through air as you sit there now?\"Mallow said calmly, \"I can make nothing of all this.\"Barr smiled, \"I\u0027m content\u0026nbsp; with the answer. I do not examine my guests. Butif there\u0026nbsp; are magicians; if\u0026nbsp; you are one of\u0026nbsp; them; there may some\u0026nbsp; day be agreat influx of them, or you. Perhaps that would be well. Maybe we need newblood.\" He muttered soundlessly to himself, then, slowly, \"But it works theother\u0026nbsp; way, too.\u0026nbsp; Our new\u0026nbsp; viceroy also\u0026nbsp; dreams, as\u0026nbsp; did our\u0026nbsp; old Wiscard.\"\"Also after the Emperor\u0027s crown?\"Barr nodded, \"My son\u0026nbsp; hears tales. In the viceroy\u0027s personal entourage, onecould scarcely help it.\u0026nbsp; And he tells me of them. Our new viceroy would notrefuse the\u0026nbsp; Crown if offered, but he guards his\u0026nbsp; line of retreat. There arestories that, failing Imperial\u0026nbsp; heights, he plans to carve out a new Empirein the\u0026nbsp; Barbarian hinterland. It is said, but I\u0026nbsp; don\u0027t vouch for this, thathe has already given one of his daughters as wife to a Kinglet somewhere inthe uncharted Periphery.\"\"If one listened to every story?\n\u003cbr\u003e \"I know.\u0026nbsp; There are many more.\u0026nbsp; I\u0027m old and I\u0026nbsp; babble nonsense. But what doyou say?\" And those sharp, old eyes peered deep.\n\u003cbr\u003e The trader considered, \"I\u0026nbsp; say nothing. But I\u0027d like to ask something. DoesSiwenna\u0026nbsp; have\u0026nbsp; nuclear power?\u0026nbsp; Now,\u0026nbsp; wait,\u0026nbsp; I know\u0026nbsp; that\u0026nbsp; it possesses\u0026nbsp; theknowledge of nucleics. I mean, do they have power generators intact, or didthe recent sack destroy them?\"\"Destroy them? Oh, no. Half a planet would be wiped out before the smallestpower station would be touched. They are irreplaceable and the suppliers ofthe strength\u0026nbsp; of the fleet.\" Almost proudly, \"We\u0026nbsp; have the largest and beston this side of Trantor itself.\"\"Then\u0026nbsp; what\u0026nbsp; would\u0026nbsp; I\u0026nbsp; do first\u0026nbsp; if\u0026nbsp; I\u0026nbsp; wanted\u0026nbsp; to\u0026nbsp; see these\u0026nbsp; generators?\"\"Nothing!\" replied\u0026nbsp; Barr, decisively.\u0026nbsp; \"You couldn\u0027t approach\u0026nbsp; any militarycenter without being shot\u0026nbsp; down instantly. Neither could anyone. Siwenna isstill deprived of civic rights.\"\"You\u0026nbsp;\u0026nbsp; mean\u0026nbsp;\u0026nbsp; all\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; power\u0026nbsp;\u0026nbsp; stations\u0026nbsp;\u0026nbsp; are\u0026nbsp;\u0026nbsp; under\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; military?\"\"No.\u0026nbsp; There are\u0026nbsp; the\u0026nbsp; small city\u0026nbsp; stations,\u0026nbsp; the ones\u0026nbsp; supplying power\u0026nbsp; forheating\u0026nbsp; and lighting\u0026nbsp; homes,\u0026nbsp; powering vehicles\u0026nbsp; and so\u0026nbsp; forth.\u0026nbsp; Those arealmost as bad. They\u0027re controlled by the tech-men.\"\"Who are they?\"\"A\u0026nbsp; specialized\u0026nbsp; group which\u0026nbsp; supervises\u0026nbsp; the\u0026nbsp; power plants.\u0026nbsp; The honor\u0026nbsp; ishereditary,\u0026nbsp; the\u0026nbsp; young\u0026nbsp; ones\u0026nbsp;\u0026nbsp; being\u0026nbsp; brought\u0026nbsp; up\u0026nbsp; in\u0026nbsp; the\u0026nbsp; profession\u0026nbsp; asapprentices.\u0026nbsp; Strict sense\u0026nbsp; of\u0026nbsp; duty, honor,\u0026nbsp; and all\u0026nbsp; that.\u0026nbsp; No one\u0026nbsp; but atech-man could enter a station.\"\"I see.\"\"I don\u0027t say, though,\"\u0026nbsp; added Barr, \"that there aren\u0027t cases where tech-menhaven\u0027t been bribed. In\u0026nbsp; days when we have nine emperors in fifty years andseven of\u0026nbsp; these are assassinated, 杦hen\u0026nbsp; every space-captain aspires to theusurpation\u0026nbsp; of\u0026nbsp;\u0026nbsp; a\u0026nbsp; viceroyship,\u0026nbsp;\u0026nbsp; and\u0026nbsp; every\u0026nbsp; viceroy\u0026nbsp;\u0026nbsp; to\u0026nbsp; the\u0026nbsp; Imperium,I suppose\u0026nbsp; even a tech-man can\u0026nbsp; fall prey to money.\u0026nbsp; But it would require agood deal, and I have none. Have you?\"\"Money? No. But does one always bribe with money?\"\"What else, when money buys all else.\"\"There is quite enough\u0026nbsp; that money won\u0027t buy. And now if you\u0027ll tell me thenearest\u0026nbsp; city with one\u0026nbsp; of the stations,\u0026nbsp; and how\u0026nbsp; best to get\u0026nbsp; there, I\u0027llthank you.\"\"Wait!\" Barr\u0026nbsp; held out his thin\u0026nbsp; hands. \"Where do you\u0026nbsp; rush? You come here,but I ask no questions. In the city, where the inhabitants are still calledrebels, you\u0026nbsp; would be\u0026nbsp; challenged by the\u0026nbsp; first soldier or\u0026nbsp; guard who heardyour accent and saw your clothes.\"He rose\u0026nbsp; and from an obscure\u0026nbsp; comer of an old\u0026nbsp; chest brought out a booklet.\n\u003cbr\u003e \"My passport, 杅orged. I escaped with it.\"He\u0026nbsp; placed\u0026nbsp; it in\u0026nbsp; Mallow\u0027s\u0026nbsp; hand\u0026nbsp; and folded\u0026nbsp; the\u0026nbsp; fingers\u0026nbsp; over it.\u0026nbsp; \"Thedescription doesn\u0027t\u0026nbsp; fit, but if you\u0026nbsp; flourish it, the chances\u0026nbsp; are many toone they will not look closely.\"\"But you. You\u0027ll be left without one.\"The old exile shrugged\u0026nbsp; cynically, \"What of it? And a further caution. Curbyour tongue! Your accent is barbarous, your idioms peculiar, and every oncein a while you\u0026nbsp; deliver yourself of the most astounding archaisms. The lessyou speak,\u0026nbsp; the less suspicion you\u0026nbsp; will draw upon yourself.\u0026nbsp; Now I\u0027ll tellyou how to get to the city?\n\u003cbr\u003e Five minutes later, Mallow was gone.\n\u003cbr\u003e He returned\u0026nbsp; but once, for a\u0026nbsp; moment, to the old\u0026nbsp; patrician\u0027s house, beforeleaving it\u0026nbsp; entirely, however. And\u0026nbsp; when Onum Barr stepped\u0026nbsp; into his littlegarden early\u0026nbsp; the next\u0026nbsp; morning, he found\u0026nbsp; a box at his\u0026nbsp; feet. It containedprovisions, concentrated provisions such as one would find aboard ship, andalien in taste and preparation.\n\u003cbr\u003e But they were good, and lasted long.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47252.html","bookId":127,"creation":"Aug 1, 2019 4:39:59 AM","modification":"Aug 1, 2019 4:39:59 AM"}
