{"id":3514,"no":84,"title":"Chapter 12","content":"The tech-man\u0027s\u0026nbsp; home was a small\u0026nbsp; two-story affair on the\u0026nbsp; Outskirts of thehuge, cubiform,\u0026nbsp; windowless affair\u0026nbsp; that dominated the center\u0026nbsp; of the city.\n\u003cbr\u003e Mallow passed\u0026nbsp; from one\u0026nbsp; to the other\u0026nbsp; through an underground\u0026nbsp; passage, andfound\u0026nbsp; himself in\u0026nbsp; the silent,\u0026nbsp; ozone-tinged atmosphere of\u0026nbsp; the powerhouse.\n\u003cbr\u003e For\u0026nbsp; fifteen minutes,\u0026nbsp; he\u0026nbsp; followed his\u0026nbsp; guide and\u0026nbsp; said nothing.\u0026nbsp; His eyesmissed nothing. His fingers touched nothing. And then, the tech-man said instrangled tones,\u0026nbsp; \"Have you had enough?\u0026nbsp; I couldn\u0027t trust my\u0026nbsp; underlings inthis case.\"\"Could\u0026nbsp;\u0026nbsp; you\u0026nbsp; ever?\"\u0026nbsp;\u0026nbsp; asked\u0026nbsp;\u0026nbsp; Mallow,\u0026nbsp; ironically.\u0026nbsp;\u0026nbsp; \"I\u0027ve\u0026nbsp; had\u0026nbsp;\u0026nbsp; enough.\"They were back in\u0026nbsp; the office and Mallow said, thoughtfully, \"And all thosegenerators are in your hands?\"\"Every\u0026nbsp; one,\" said\u0026nbsp; the tech-man,\u0026nbsp; with more\u0026nbsp; than a touch\u0026nbsp; of complacency.\n\u003cbr\u003e \"And you keep them running and in order?\"\"Right!\"\"And if they break down?\"The tech-man shook his head indignantly, \"They don\u0027t break down. They neverbreak down. They were built for eternity.\"\"Eternity is a long time. Just suppose?\n\u003cbr\u003e \"It is unscientific to suppose meaningless cases.\"\"All\u0026nbsp; right. Suppose\u0026nbsp; I\u0026nbsp; were to\u0026nbsp; blast a\u0026nbsp; vital\u0026nbsp; part into\u0026nbsp; nothingness? Isuppose\u0026nbsp; the machines\u0026nbsp; aren\u0027t immune\u0026nbsp; to nuclear\u0026nbsp; forces? Suppose I\u0026nbsp; fuse avital connection, or smash a quartz D-tube?\"\"Well,\u0026nbsp; then,\"\u0026nbsp; shouted the\u0026nbsp; tech-man,\u0026nbsp; furiously, \"you\u0026nbsp; would be\u0026nbsp; killed.\"\"Yes, I know that,\" Mallow was shouting, too, \"but what about thegenerator? Could you repair it?\"\"Sir,\" the tech-man howled his words, \"you have had a fair return. You\u0027vehad what you asked for. Now get out! I owe you nothing more!\"Mallow bowed with a satiric respect and left.\n\u003cbr\u003e Two days later he was back where the Far Star waited to return with him tothe planet, Terminus.\n\u003cbr\u003e And two days later, the tech-man\u0027s shield went dead, and for all hispuzzling and cursing never glowed again.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47256.html","bookId":127,"creation":"Aug 1, 2019 4:40:09 AM","modification":"Aug 1, 2019 4:40:09 AM"}
