{"id":3516,"no":86,"title":"Chapter 13","content":"Mallow relaxed for almost\u0026nbsp; the first time in six months. He was on his backin the\u0026nbsp; sunroom of\u0026nbsp; his new house,\u0026nbsp; stripped to the skin.\u0026nbsp; His great, brownarms were thrown up\u0026nbsp; and out, and the muscles tautened into a stretch, thenfaded into repose.\n\u003cbr\u003e The man\u0026nbsp; beside him\u0026nbsp; placed a cigar\u0026nbsp; between Mallow\u0027s teeth and\u0026nbsp; lit it. Hechamped on one of his own and said, \"You must be overworked. Maybe you needa long rest.\"\"Maybe I do, Jael, but I\u0027d rather rest in a council seat. Because I\u0027m goingto have that seat, and you\u0027re going to help me.\"Ankor\u0026nbsp; Jael\u0026nbsp; raised his\u0026nbsp; eyebrows\u0026nbsp; and said,\u0026nbsp; \"How\u0026nbsp; did I\u0026nbsp; get into\u0026nbsp; this?\"\"You got in obviously.\u0026nbsp; Firstly, you\u0027re an old dog of a politico. Secondly,you were\u0026nbsp; booted out of your\u0026nbsp; cabinet seat by Jorane\u0026nbsp; Sutt, the same fellowwho\u0027d rather\u0026nbsp; lose an eyeball than\u0026nbsp; see me in the\u0026nbsp; council. You don\u0027t thinkmuch of my chances, do you?\"\"Not\u0026nbsp; much,\"\u0026nbsp; agreed the\u0026nbsp; ex-Minister\u0026nbsp; of Education.\u0026nbsp; \"You\u0027re a\u0026nbsp; Smyrnian.\"\"That\u0027s no legal bar. I\u0027ve had a lay education.\"\"Well, come now. Since when does prejudice follow any law but its own. Now,how\u0026nbsp; about\u0026nbsp;\u0026nbsp; your\u0026nbsp; own\u0026nbsp; man\u0026nbsp; ? this\u0026nbsp; Jaim\u0026nbsp; Twer?\u0026nbsp; What\u0026nbsp;\u0026nbsp; does\u0026nbsp;\u0026nbsp; he\u0026nbsp;\u0026nbsp; say?\"\"He spoke\u0026nbsp; about running me for council almost\u0026nbsp; a year ago,\" replied Malloweasily, \"but I\u0027ve outgrown him. He couldn\u0027t have pulled it off in any case.\n\u003cbr\u003e Not enough depth. He\u0027s loud and forceful ?but that\u0027s only an expression ofnuisance\u0026nbsp; value.\u0026nbsp; I\u0027m\u0026nbsp; off\u0026nbsp; to\u0026nbsp; put\u0026nbsp; over\u0026nbsp; a\u0026nbsp; real\u0026nbsp; coup.\u0026nbsp; I\u0026nbsp; need\u0026nbsp;\u0026nbsp; you. \"\"Jorane Sutt is the cleverest politician on the planet and he\u0027ll be againstyou. I\u0026nbsp; don\u0027t claim to be able to outsmart him.\u0026nbsp; And don\u0027t think he doesn\u0027tfight hard, and dirty.\"\"I\u0027ve got money.\"\"Mat helps.\u0026nbsp; But it takes a lot to buy\u0026nbsp; off prejudice, you dirty Smyrnian.\"\"I\u0027ll have a lot.\"\"Well, I\u0027ll look into\u0026nbsp; the matter. But don\u0027t ever you crawl up on your hindlegs\u0026nbsp; and\u0026nbsp; bleat\u0026nbsp; that\u0026nbsp; I\u0026nbsp; encouraged\u0026nbsp; you\u0026nbsp; in\u0026nbsp; the\u0026nbsp; matter.\u0026nbsp; Who\u0027s\u0026nbsp; that?\"Mallow\u0026nbsp; pulled\u0026nbsp; the corners\u0026nbsp; of\u0026nbsp; his\u0026nbsp; mouth down,\u0026nbsp; and\u0026nbsp; said, \"Jorane\u0026nbsp; Sutthimself, I\u0026nbsp; think. He\u0027s early, and\u0026nbsp; I can understand it.\u0026nbsp; I抳e been dodginghim for\u0026nbsp; a month. Look, Jael, get into the next\u0026nbsp; room, and turn the speakeron low. I want you to listen.\"He helped the council member out of the room with a shove of his bare foot,then scrambled\u0026nbsp; up and\u0026nbsp; into a silk\u0026nbsp; robe. The synthetic\u0026nbsp; sunlight faded tonormal power.\n\u003cbr\u003e The\u0026nbsp; secretary to the\u0026nbsp; mayor entered\u0026nbsp; stiffly, while the\u0026nbsp; solemn major-domotiptoed the door shut behind him.\n\u003cbr\u003e Mallow\u0026nbsp; fastened his\u0026nbsp; belt and\u0026nbsp; said, \"Take\u0026nbsp; your choice of\u0026nbsp; chairs, Sutt.\"Sutt barely cracked a\u0026nbsp; flickering smile. The chair he chose was comfortablebut he did not relax into it. From its edge, he said, \"If you\u0027ll state yourterms to begin with, we\u0027ll get down to business.\"\"What terms?\"\"You\u0026nbsp; wish to\u0026nbsp; be coaxed?\u0026nbsp; Well, then,\u0026nbsp; what, for\u0026nbsp; instance, did you\u0026nbsp; do atKorell? Your report was incomplete.\"\"I gave it to you months ago. You were satisfied then.\"Yes,\"\u0026nbsp; Sutt rubbed his\u0026nbsp; forehead thoughtfully\u0026nbsp; with one finger,\u0026nbsp; \"but sincethen your\u0026nbsp; activities have\u0026nbsp; been significant. We\u0026nbsp; know a good\u0026nbsp; deal of whatyou\u0027re doing,\u0026nbsp; Mallow. We know, exactly,\u0026nbsp; how many factories you\u0027re puttingup; in\u0026nbsp; what a\u0026nbsp; hurry you\u0027re doing it;\u0026nbsp; and how much it\u0027s\u0026nbsp; costing you. Andthere\u0027s\u0026nbsp; this palace\u0026nbsp; you have,\"\u0026nbsp; he gazed\u0026nbsp; about him\u0026nbsp; with a cold\u0026nbsp; lack ofappreciation, \"which set you\u0026nbsp; back considerably more than my annual salary;and a swathe you\u0027ve been cutting ?a very considerable and expensive swathe?through the upper layers of Foundation society.\"\"So? Beyond proving that you employ capable spies, what does it show?\"\"It shows\u0026nbsp; you have\u0026nbsp; money you didn\u0027t\u0026nbsp; have a year\u0026nbsp; ago. And\u0026nbsp; that can showanything ? for instance, that a\u0026nbsp; good deal went on\u0026nbsp; at Korell that we knownothing of. Where are you getting your money?\"\"My dear Sutt, you can\u0027t really expect me to tell you.\"\"I don\u0027t.\"\"I didn\u0027t\u0026nbsp; think you did. That\u0027s\u0026nbsp; why I\u0027m going to\u0026nbsp; tell you. It\u0027s straightfrom the treasure-chests of the Commdor of Korell.\"Sutt blinked.\n\u003cbr\u003e Mallow\u0026nbsp; smiled and continued.\u0026nbsp; \"Unfortunately for\u0026nbsp; you, the money\u0026nbsp; is quitelegitimate. I\u0027m a Master\u0026nbsp; Trader and the money I received was a quantity ofwrought iron\u0026nbsp; and chromite in exchange for a number\u0026nbsp; of trinkets I was ableto\u0026nbsp; supply him\u0026nbsp; with. Fifty\u0026nbsp; per cent\u0026nbsp; of the\u0026nbsp; profit is mine\u0026nbsp; by hideboundcontract with the Foundation.\u0026nbsp; The other half goes to the government at theend\u0026nbsp; of\u0026nbsp;\u0026nbsp; the\u0026nbsp; year\u0026nbsp; when\u0026nbsp;\u0026nbsp; all\u0026nbsp; good\u0026nbsp; citizens\u0026nbsp; pay\u0026nbsp;\u0026nbsp; their\u0026nbsp; income\u0026nbsp; tax.\"\"There\u0026nbsp;\u0026nbsp; was\u0026nbsp; no\u0026nbsp; mention\u0026nbsp;\u0026nbsp; of\u0026nbsp; any\u0026nbsp;\u0026nbsp; trade\u0026nbsp; agreement\u0026nbsp; in\u0026nbsp;\u0026nbsp; your\u0026nbsp; report.\"\"Nor was\u0026nbsp; there any\u0026nbsp; mention of what I\u0026nbsp; had for breakfast that\u0026nbsp; day, or thename\u0026nbsp; of my\u0026nbsp; current mistress,\u0026nbsp; or any\u0026nbsp; other irrelevant\u0026nbsp; detail.\" Mallow\u0027ssmile was fading into a sneer. \"I was sent ?to quote yourself ?to keep myeyes open.\u0026nbsp; They were never. shut. You wanted to\u0026nbsp; find out what happened tothe captured\u0026nbsp; Foundation merchant ships. I never saw\u0026nbsp; or heard of them. Youwanted to find out\u0026nbsp; if Korell had nuclear power. My report tells of nuclearblasters in\u0026nbsp; the possession\u0026nbsp; of the Commdor\u0027s\u0026nbsp; private bodyguard. I\u0026nbsp; saw noother signs.\u0026nbsp; And the blasters I did see are relics\u0026nbsp; of the old Empire, andmay\u0026nbsp;\u0026nbsp; be\u0026nbsp;\u0026nbsp; show-pieces\u0026nbsp; that\u0026nbsp;\u0026nbsp; do\u0026nbsp;\u0026nbsp; not\u0026nbsp;\u0026nbsp; work,\u0026nbsp; for\u0026nbsp;\u0026nbsp; all\u0026nbsp; my\u0026nbsp;\u0026nbsp; knowledge.\n\u003cbr\u003e \"So far,\u0026nbsp; I followed orders, but\u0026nbsp; beyond that I was,\u0026nbsp; and. still am, a freeagent. According\u0026nbsp; to the laws of\u0026nbsp; the Foundation, a Master\u0026nbsp; Trader may openwhatever\u0026nbsp; new markets\u0026nbsp; he can, and\u0026nbsp; receive therefrom\u0026nbsp; his due half\u0026nbsp; of theprofits. What are your objections? I don\u0027t see them.\"Sutt bent\u0026nbsp; his eyes carefully towards\u0026nbsp; the wall and spoke\u0026nbsp; with a difficultlack\u0026nbsp; of anger, \"It\u0026nbsp; is the general\u0026nbsp; custom of\u0026nbsp; all traders to\u0026nbsp; advance thereligion with their trade.\"\"I adhere to law, and not to custom.\"\"There are times when custom can be the higher law.\"\"Then appeal to the courts.\"Sutt raised somber eyes which seemed to retreat into their sockets. \"You\u0027rea Smyrnian after all.\u0026nbsp; It seems naturalization and education can\u0027t wipe outthe\u0026nbsp; taint in\u0026nbsp; the blood.\u0026nbsp; Listen, and\u0026nbsp; try to\u0026nbsp; understand, just\u0026nbsp; the same.\n\u003cbr\u003e \"This goes beyond money,\u0026nbsp; or markets. We have the science of the great HariSeldon to\u0026nbsp; prove that upon us depends the future\u0026nbsp; empire of the Galaxy, andfrom the course that leads to that Imperium we cannot turn. The religion wehave\u0026nbsp; is our\u0026nbsp; all-important instrument\u0026nbsp; towards that\u0026nbsp; end. With it\u0026nbsp; we havebrought the\u0026nbsp; Four Kingdoms under our control, even\u0026nbsp; at the moment when theywould have\u0026nbsp; crushed us.\u0026nbsp; It is the\u0026nbsp; most potent device known\u0026nbsp; with which tocontrol men and worlds.\n\u003cbr\u003e \"The\u0026nbsp; primary\u0026nbsp; reason for\u0026nbsp; the\u0026nbsp; development\u0026nbsp; of trade\u0026nbsp; and\u0026nbsp; traders was\u0026nbsp; tointroduce and\u0026nbsp; spread this\u0026nbsp; religion more quickly,\u0026nbsp; and to insure\u0026nbsp; that theintroduction of\u0026nbsp; new techniques and a\u0026nbsp; new economy would be\u0026nbsp; subject to ourthorough and intimate control.\"He paused for breath, and Mallow interjected quietly, \"I know the theory. Iunderstand it entirely.\"\"Do you?\u0026nbsp; It is\u0026nbsp; more than I expected.\u0026nbsp; Then you see, of\u0026nbsp; course, that yourattempt at trade for its own sake; at mass production of worthless gadgets,which can only affect a world\u0027s economy superficially; at the subversion ofinterstellar policy to the\u0026nbsp; god of profits; at the divorce of nuclear powerfrom\u0026nbsp; our\u0026nbsp; controlling religion\u0026nbsp; ? can\u0026nbsp; only end\u0026nbsp; with\u0026nbsp; the overthrow\u0026nbsp; andcomplete\u0026nbsp; negation\u0026nbsp; of\u0026nbsp; the\u0026nbsp; policy\u0026nbsp; that\u0026nbsp; has worked\u0026nbsp; successfully\u0026nbsp; for\u0026nbsp; acentury.\"\"And time enough, too,\" said Mallow, indifferently, \"for a policy outdated,dangerous and\u0026nbsp; impossible. However well your\u0026nbsp; religion has succeeded in theFour Kingdoms, scarcely another\u0026nbsp; world in the Periphery has accepted it. Atthe time we seized\u0026nbsp; control of the Kingdoms, there were a sufficient numberof exiles, Galaxy knows,\u0026nbsp; to spread the story of how Salvor Hardin used thepriesthood and the superstition of the people to overthrow the independenceand power\u0026nbsp; of the secular monarchs. And if that\u0026nbsp; wasn\u0027t enough, the case ofAskone two\u0026nbsp; decades back made it\u0026nbsp; plain enough. There isn\u0027t\u0026nbsp; a ruler in thePeriphery now that wouldn\u0027t\u0026nbsp; sooner cut his own throat than let a priest ofthe Foundation enter the territory.\n\u003cbr\u003e \"I don\u0027t\u0026nbsp; propose to force Korell or any other\u0026nbsp; world to accept something Iknow they\u0026nbsp; don\u0027t want. No, Sutt.\u0026nbsp; If nuclear power makes\u0026nbsp; them dangerous, asincere friendship through trade will be many times better than an insecureoverlordship, based\u0026nbsp; on the\u0026nbsp; hated supremacy of a\u0026nbsp; foreign spiritual power,which, once\u0026nbsp; it weakens ever so slightly, can\u0026nbsp; only fall entirely and leavenothing\u0026nbsp;\u0026nbsp; substantial\u0026nbsp;\u0026nbsp; behind\u0026nbsp; except\u0026nbsp;\u0026nbsp; an\u0026nbsp;\u0026nbsp; immortal\u0026nbsp;\u0026nbsp; fear\u0026nbsp; and\u0026nbsp;\u0026nbsp; hate.\"Suit\u0026nbsp; said cynically,\u0026nbsp; \"Very nicely put.\u0026nbsp; So, to\u0026nbsp; get back to\u0026nbsp; the originalpoint of\u0026nbsp; discussion, what are your terms? What\u0026nbsp; do you require to exchangeyour ideas for mine?\"\"You think my convictions are for sale?\"\"Why not?\"\u0026nbsp; came the cold\u0026nbsp; response. \"Isn\u0027t that your\u0026nbsp; business, buying andselling?\"\"Only at\u0026nbsp; a profit,\" said Mallow,\u0026nbsp; unoffended. \"Can you offer\u0026nbsp; me more thanI\u0027m getting as is?\"\"You could\u0026nbsp; have three-quarters\u0026nbsp; of your trade profits,\u0026nbsp; rather than half.\"Mallow laughed shortly, \"A fine offer. The whole of the trade on your termswould\u0026nbsp; fall far\u0026nbsp; below\u0026nbsp; ?a\u0026nbsp; tenth share\u0026nbsp; on mine.\u0026nbsp; Try harder\u0026nbsp; than that.\"\"You could have a council seat.\"\"I\u0027ll have that anyway, without and despite you.\"With\u0026nbsp; a sudden\u0026nbsp; movement,\u0026nbsp; Sutt clenched\u0026nbsp; his\u0026nbsp; fist, \"You\u0026nbsp; could also\u0026nbsp; saveyourself a prison term. Of twenty years, if I have my way. Count the profitin that.\"\"No profit at all, but can you fulfill such a threat?\"\"How about a trial for murder?\"\"Whose murder?\" asked Mallow, contemptuously.\n\u003cbr\u003e Sutt\u0027s voice was harsh now, though no louder than before, \"The murder of anAnacreonian priest, in the service of the Foundation.\"\"Is that so now? And what\u0027s your evidence?\"The secretary to the mayor leaned forward, \"Mallow, I\u0027m not bluffing. Thepreliminaries are over. I have only to sign one final paper and the case ofthe Foundation versus Hober Mallow, Master Trader, is begun. You abandoneda subject of the Foundation to torture and death at the hands of an alienmob, Mallow, and you have only five seconds to prevent the punishment dueyou. For myself, I\u0027d rather you decided to bluff it out. You\u0027d be safer asa destroyed enemy, than as a doubtfully-converted friend.\"Mallow said solemnly, \"You have your wish.\"\"Good!\" and the secretary smiled savagely. \"It was the mayor who wished thepreliminary attempt\u0026nbsp; at compromise, not I.\u0026nbsp; Witness that I did\u0026nbsp; not try toohard.\"The door opened before him, and he left.\n\u003cbr\u003e Mallow looked up as Ankor Jael re-entered the room.\n\u003cbr\u003e Mallow said, \"Did you hear him?\"The politician\u0026nbsp; flopped to the floor. \"I never heard\u0026nbsp; him as angry as that,since I\u0027ve known the snake.\"\"All right. What do you make of it?\"\"Well,\u0026nbsp; I\u0027ll tell\u0026nbsp; you. A\u0026nbsp; foreign policy\u0026nbsp; of domination\u0026nbsp; through spiritualmeans is\u0026nbsp; his idee fixe,\u0026nbsp; but it\u0027s my notion\u0026nbsp; that his ultimate aims aren\u0027tspiritual. I was fired out of the Cabinet for arguing on the same issue, asI needn\u0027t tell you.\"\"You\u0026nbsp; needn\u0027t.\u0026nbsp; And\u0026nbsp; what\u0026nbsp; are those\u0026nbsp; unspiritual\u0026nbsp; aims\u0026nbsp; according to\u0026nbsp; yournotion?\"Jael grew serious, \"Well, he\u0027s not stupid, so he must see the bankruptcy ofour religious\u0026nbsp; policy, which\u0026nbsp; has hardly made\u0026nbsp; a single conquest\u0026nbsp; for us inseventy\u0026nbsp; years.\u0026nbsp;\u0026nbsp; He\u0027s\u0026nbsp; obviously\u0026nbsp; using\u0026nbsp; it\u0026nbsp;\u0026nbsp; for\u0026nbsp; purposes\u0026nbsp; of\u0026nbsp; his\u0026nbsp; own.\n\u003cbr\u003e \"Now any\u0026nbsp; dogma primarily based\u0026nbsp; on faith and emotionalism,\u0026nbsp; is a dangerousweapon to\u0026nbsp; use on others, since\u0026nbsp; it is almost impossible\u0026nbsp; to guarantee thatthe weapon will never be turned on the user. For a hundred years now, we\u0027vesupported a ritual and\u0026nbsp; mythology that is becoming more and more venerable,traditional ? and immovable. In some ways, it\u0026nbsp; isn\u0027t under our control anymore.\"\"In\u0026nbsp; what\u0026nbsp; ways?\" demanded\u0026nbsp; Mallow.\u0026nbsp; \"Don\u0027t\u0026nbsp; stop. I\u0026nbsp; want your\u0026nbsp; thoughts.\"\"Well,\u0026nbsp; suppose one\u0026nbsp; man,\u0026nbsp; one ambitious\u0026nbsp; man, uses\u0026nbsp; the force\u0026nbsp; of religionagainst us, rather than for us.\"\"You mean Sutt?\n\u003cbr\u003e \"You\u0027re right.\u0026nbsp; I mean Sutt. Listen, man, if\u0026nbsp; he could mobilize the varioushierarchies on\u0026nbsp; the subject planets\u0026nbsp; against the Foundation in\u0026nbsp; the name oforthodoxy, what\u0026nbsp; chance would we stand? By planting\u0026nbsp; himself at the head ofthe standards of the\u0026nbsp; pious, he could make war on heresy, as represented byyou,\u0026nbsp; for instance,\u0026nbsp; and make\u0026nbsp; himself king\u0026nbsp; eventually. After all,\u0026nbsp; it wasHardin who said: \u0027A nuclear blaster is a good weapon, but it can point bothways.\u0027\"Mallow\u0026nbsp; slapped his\u0026nbsp; bare\u0026nbsp; thigh, \"All\u0026nbsp; right, Jael,\u0026nbsp; then\u0026nbsp; get me\u0026nbsp; in thatcouncil, and I\u0027ll fight him.\"Jael paused,\u0026nbsp; then said significantly, \"Maybe not.\u0026nbsp; What was all that abouthaving a priest lynched? Is isn\u0027t true, is it?\"\"It\u0027s true enough,\" Mallow said, carelessly.\n\u003cbr\u003e Jael whistled, \"Has he definite proof?\"\"He should have.\" Mallow hesitated, then added, \"Jaim Twer was his man fromthe beginning, though neither\u0026nbsp; of them knew that I knew that. And Jaim Twerwas an eyewitness.\"Jael shook his head. \"Uh-uh. That\u0027s bad.\"\"Bad? What\u0027s bad about it? That priest was illegally upon the planet by theFoundation\u0027s own laws. He was obviously used by the Korellian government asa bait, whether involuntary\u0026nbsp; or not. By all the laws of common-sense, I hadno choice but one\u0026nbsp; action ?and that action was strictly within the law. Ifhe brings me to\u0026nbsp; trial, he\u0027ll do nothing but make a prime fool of himself.\"And Jael shook his head again, \"No, Mallow, you\u0027ve missed it. I told you heplayed dirty.\u0026nbsp; He\u0027s not out to convict you; he knows\u0026nbsp; he can\u0027t do that. Buthe\u0026nbsp; is out to ruin\u0026nbsp; your standing with the people.\u0026nbsp; You heard what he said.\n\u003cbr\u003e Custom\u0026nbsp; is\u0026nbsp; higher than\u0026nbsp; law, at\u0026nbsp; times. You\u0026nbsp; could walk\u0026nbsp; out of\u0026nbsp; the trialscot-free, but\u0026nbsp; if the\u0026nbsp; people think you\u0026nbsp; threw a priest to\u0026nbsp; the dogs, yourpopularity is gone.\n\u003cbr\u003e \"They\u0027ll admit\u0026nbsp; you did the legal thing, even\u0026nbsp; the sensible thing. But justthe\u0026nbsp; same you\u0027ll\u0026nbsp; have been, in\u0026nbsp; their eyes,\u0026nbsp; a cowardly dog,\u0026nbsp; an unfeelingbrute,\u0026nbsp; a hard-hearted\u0026nbsp; monster.\u0026nbsp; And\u0026nbsp; you would\u0026nbsp; never get elected\u0026nbsp; to thecouncil. You\u0026nbsp; might even lose your\u0026nbsp; rating as Master Trader\u0026nbsp; by having yourcitizenship voted\u0026nbsp; away from\u0026nbsp; you. You\u0027re not\u0026nbsp; native born, you\u0026nbsp; know. Whatmore\u0026nbsp; do you\u0026nbsp; think Sutt\u0026nbsp; can want?\"\u0026nbsp; Mallow frowned stubbornly,\u0026nbsp; \"So!\" \"Myboy,\" said Jael. \"I\u0027ll\u0026nbsp; stand by you, but I can\u0027t help. You\u0027re on the spot,杁ead center.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47258.html","bookId":127,"creation":"Aug 1, 2019 4:40:13 AM","modification":"Aug 1, 2019 4:40:13 AM"}
