{"id":3522,"no":92,"title":"Chapter 16","content":"Asper Argo, the Well-Beloved, Commdor of the Korellian Republic greeted hiswife\u0027s entry by a hangdog lowering of his scanty eyebrows. To her at least,his\u0026nbsp;\u0026nbsp; self-adopted\u0026nbsp;\u0026nbsp; epithet\u0026nbsp;\u0026nbsp; did\u0026nbsp;\u0026nbsp; not\u0026nbsp;\u0026nbsp; apply.\u0026nbsp; Even\u0026nbsp;\u0026nbsp; he\u0026nbsp;\u0026nbsp; knew\u0026nbsp;\u0026nbsp; that.\n\u003cbr\u003e She said,\u0026nbsp; in a\u0026nbsp; voice as sleek\u0026nbsp; as her hair\u0026nbsp; and as cold as\u0026nbsp; her eyes, \"Mygracious lord,\u0026nbsp; I understand, has finally come to\u0026nbsp; a decision upon the fateof the Foundation upstarts.\"\"Indeed?\"\u0026nbsp; said the\u0026nbsp; Commdor, sourly.\u0026nbsp; \"And what\u0026nbsp; more does\u0026nbsp; your versatileunderstanding embrace?\"\"Enough,\u0026nbsp; my\u0026nbsp; very\u0026nbsp; noble\u0026nbsp; husband. You\u0026nbsp; had\u0026nbsp; another\u0026nbsp; of your\u0026nbsp; vacillatingconsultations with your councilors. Fine advisors.\" With infinite scorn, \"Aherd\u0026nbsp; of palsied\u0026nbsp; purblind idiots\u0026nbsp; hugging their\u0026nbsp; sterile profits\u0026nbsp; close totheir\u0026nbsp;\u0026nbsp; sunken\u0026nbsp;\u0026nbsp; chests\u0026nbsp; in\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; face\u0026nbsp; of\u0026nbsp;\u0026nbsp; my\u0026nbsp; father\u0027s\u0026nbsp;\u0026nbsp; displeasure.\"\"And who,\u0026nbsp; my dear,\" was the\u0026nbsp; mild response, \"is the\u0026nbsp; excellent source fromwhich your understanding understands all this?\"The\u0026nbsp; Commdora laughed\u0026nbsp; shortly, \"If\u0026nbsp; I told\u0026nbsp; you, my\u0026nbsp; source would\u0026nbsp; be morecorpse than source.\"\"Well,\u0026nbsp; you\u0027ll have\u0026nbsp; your\u0026nbsp; own way,\u0026nbsp; as always.\"\u0026nbsp; The Commdor\u0026nbsp; shrugged andturned\u0026nbsp; away. \"And\u0026nbsp; as for\u0026nbsp; your father\u0027s\u0026nbsp; displeasure: I\u0026nbsp; much fear\u0026nbsp; me itextends to a niggardly refusal to supply more ships.\"\"More ships!\" She blazed away, hotly, \"And haven\u0027t you five? Don\u0027t deny it.\n\u003cbr\u003e I know you have five; and a sixth is promised.\"\"Promised for the last year.\"\"But one ?just\u0026nbsp; one ?can blast that Foundation into stinking rubble. Justone!\u0026nbsp;\u0026nbsp; One,\u0026nbsp;\u0026nbsp; to\u0026nbsp; sweep\u0026nbsp;\u0026nbsp; their\u0026nbsp;\u0026nbsp; little\u0026nbsp;\u0026nbsp; pygmy\u0026nbsp; boats\u0026nbsp;\u0026nbsp; out\u0026nbsp; of\u0026nbsp;\u0026nbsp; space.\"\"I couldn\u0027t attack their planet, even with a dozen.\"\"And\u0026nbsp; how long\u0026nbsp; would their planet\u0026nbsp; hold out\u0026nbsp; with their trade\u0026nbsp; ruined, andtheir\u0026nbsp; cargoes of\u0026nbsp; toys and\u0026nbsp; trash destroyed?\"\u0026nbsp; \"Those toys and\u0026nbsp; trash meanmoney,\" he sighed. \"A good deal of money.\"\"But\u0026nbsp; if\u0026nbsp; you\u0026nbsp; had\u0026nbsp; the\u0026nbsp; Foundation\u0026nbsp; itself,\u0026nbsp; would\u0026nbsp; you not\u0026nbsp; have\u0026nbsp; all\u0026nbsp; itcontained\u0027? And if you had my father\u0027s respect and gratitude, would you nothave more than ever\u0026nbsp; the Foundation could give you? It\u0027s been three years ?\n\u003cbr\u003e more\u0026nbsp; ? since that\u0026nbsp; barbarian\u0026nbsp; came\u0026nbsp; with his\u0026nbsp; magic\u0026nbsp; sideshow. It\u0027s\u0026nbsp; longenough.\"\"My dear!\" The Commdor turned and faced her. \"I am growing old. I am weary.\n\u003cbr\u003e I lack\u0026nbsp; the resilience to withstand\u0026nbsp; your rattling mouth. You\u0026nbsp; say you knowthat I\u0026nbsp; have decided.\u0026nbsp; Well, I have. It\u0026nbsp; is over, and there\u0026nbsp; is war betweenKorell and the Foundation.\"\"Well!\" The Commdora\u0027s figure\u0026nbsp; expanded and her eyes sparkled, \"You learnedwisdom at last, though\u0026nbsp; in your dotage. And now when you are master of thishinterland, you\u0026nbsp; may be sufficiently\u0026nbsp; respectable to be of\u0026nbsp; some weight andimportance\u0026nbsp; in the\u0026nbsp; Empire. For\u0026nbsp; one thing,\u0026nbsp; we might leave\u0026nbsp; this barbarousworld and attend the viceroy\u0027s court. Indeed we might.\"She swept out, with a smile, and a hand on her hip. Her hair gleamed in thelight.\n\u003cbr\u003e The Commdor\u0026nbsp; waited, and then said to the\u0026nbsp; closed door, with malignance andhate,\u0026nbsp; \"And when\u0026nbsp; I am\u0026nbsp; master of what\u0026nbsp; you call\u0026nbsp; the hinterland, I\u0026nbsp; may besufficiently\u0026nbsp; respectable to\u0026nbsp; do\u0026nbsp; without your\u0026nbsp; father\u0027s arrogance\u0026nbsp; and hisdaughter\u0027s tongue. Completely ?without!\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47315.html","bookId":127,"creation":"Aug 1, 2019 4:40:30 AM","modification":"Aug 1, 2019 4:40:30 AM"}
