{"id":3526,"no":96,"title":"Chapter 18","content":"Hober Mallow\u0026nbsp; shuffled his feet\u0026nbsp; wearily as he leafed\u0026nbsp; through the reports.\n\u003cbr\u003e Two\u0026nbsp; years of\u0026nbsp; the mayoralty\u0026nbsp; had made\u0026nbsp; him a\u0026nbsp; bit more housebroken,\u0026nbsp; a bitsofter,\u0026nbsp; a\u0026nbsp; bit more\u0026nbsp; patient,\u0026nbsp; 朾ut\u0026nbsp; it had\u0026nbsp; not\u0026nbsp; made him\u0026nbsp; learn to\u0026nbsp; likegovernment\u0026nbsp; reports and\u0026nbsp; the mind-breaking\u0026nbsp; officialese in which\u0026nbsp; they werewritten.\n\u003cbr\u003e \"How many ships did they get?\" asked Jael.\n\u003cbr\u003e \"Four trapped\u0026nbsp; on the ground. Two unreported.\u0026nbsp; All others accounted for andsafe.\"\u0026nbsp; Mallow\u0026nbsp; grunted, \"We\u0026nbsp; should\u0026nbsp; have\u0026nbsp; done better,\u0026nbsp; but\u0026nbsp; it\u0027s just\u0026nbsp; ascratch.\"There\u0026nbsp; was no\u0026nbsp; answer\u0026nbsp; and Mallow\u0026nbsp; looked\u0026nbsp; up, \"Does\u0026nbsp; anything worry\u0026nbsp; you?\"\"I\u0026nbsp; wish\u0026nbsp;\u0026nbsp; Sutt\u0026nbsp; would\u0026nbsp; get\u0026nbsp; here,\"\u0026nbsp;\u0026nbsp; was\u0026nbsp; the\u0026nbsp; almost\u0026nbsp; irrelevant\u0026nbsp; answer.\n\u003cbr\u003e \"Ah,\u0026nbsp; yes,\u0026nbsp; and\u0026nbsp; now\u0026nbsp; we\u0027ll\u0026nbsp; hear\u0026nbsp; another\u0026nbsp; lecture\u0026nbsp; on\u0026nbsp; the\u0026nbsp; home\u0026nbsp; front.\"\"No, we\u0026nbsp; won\u0027t,\" snapped Jael,\u0026nbsp; \"but you\u0027re stubborn, Mallow.\u0026nbsp; You may haveworked out the foreign\u0026nbsp; situation to the last detail but you\u0027ve never givena care about what goes on here on the home planet.\"\"Well, that\u0027s your job, isn\u0027t it? What did I make you Minister of Educationand Propaganda for?\"\"Obviously\u0026nbsp; to\u0026nbsp; send me\u0026nbsp; to\u0026nbsp; an\u0026nbsp; early and\u0026nbsp; miserable\u0026nbsp; grave,\u0026nbsp; for all\u0026nbsp; theco-operation you\u0026nbsp; give me. For the last year,\u0026nbsp; I\u0027ve been deafening you withthe rising\u0026nbsp; danger of Sutt and his Religionists.\u0026nbsp; What good will your plansbe,\u0026nbsp; if\u0026nbsp;\u0026nbsp; Sutt\u0026nbsp; forces\u0026nbsp; a\u0026nbsp; special\u0026nbsp; election\u0026nbsp;\u0026nbsp; and\u0026nbsp; has\u0026nbsp; you\u0026nbsp; thrown\u0026nbsp; out?\"\"None, I admit.\"\"And your\u0026nbsp; speech last night just about handed the\u0026nbsp; election to Sutt with asmile\u0026nbsp; and\u0026nbsp;\u0026nbsp; a\u0026nbsp; pat.\u0026nbsp; Was\u0026nbsp;\u0026nbsp; there\u0026nbsp; any\u0026nbsp; necessity\u0026nbsp; for\u0026nbsp;\u0026nbsp; being\u0026nbsp; so\u0026nbsp; frank?\"\"Isn\u0027t there such a thing as stealing Sutt\u0027s thunder?\"\"No,\"\u0026nbsp; said Jael, violently,\u0026nbsp; \"not the way\u0026nbsp; you did\u0026nbsp; it. You claim\u0026nbsp; to haveforeseen everything, and don\u0027t\u0026nbsp; explain why you traded with Korell to theirexclusive benefit\u0026nbsp; for three years. Your\u0026nbsp; only plan of battle\u0026nbsp; is to retirewithout\u0026nbsp; a battle.\u0026nbsp; You abandon all\u0026nbsp; trade with\u0026nbsp; the sectors of\u0026nbsp; space nearKorell. You openly proclaim\u0026nbsp; a stalemate. You promise no offensive, even inthe future.\u0026nbsp; Galaxy, Mallow,\u0026nbsp; what am I\u0026nbsp; supposed to do with\u0026nbsp; such a mess?\"\"It lacks glamor?\"\"It lacks mob emotion-appeal.\"\"Same thing.\"\"Mallow, wake up. You\u0026nbsp; have two alternatives. Either you present the peoplewith a dynamic foreign policy, whatever your private plans are, or you makesome sort of compromise with Sutt.\"Mallow said,\u0026nbsp; \"All right, if I\u0027ve\u0026nbsp; failed the first, let\u0027s\u0026nbsp; try the second.\n\u003cbr\u003e Sutt\u0027s just arrived.\"Sutt\u0026nbsp; and Mallow had\u0026nbsp; not met personally\u0026nbsp; since the\u0026nbsp; day of the\u0026nbsp; trial, twoyears\u0026nbsp; back. Neither\u0026nbsp; detected\u0026nbsp; any change\u0026nbsp; in the\u0026nbsp; other, except\u0026nbsp; for thatsubtle atmosphere about each\u0026nbsp; which made it quite evident that the roles ofruler and defier had changed.\n\u003cbr\u003e Sutt took his seat without shaking hands.\n\u003cbr\u003e Mallow offered a cigar and said, \"Mind if Jael stays? He wants a compromiseearnestly. He can act as mediator if tempers rise.\"Sutt shrugged, \"A compromise\u0026nbsp; will be well for you. Upon another occasion Ionce asked\u0026nbsp; you to state your\u0026nbsp; terms. I presume the\u0026nbsp; positions are reversednow.\"\"You presume correctly.\"\"Then\u0026nbsp; there are\u0026nbsp; my\u0026nbsp; terms. You\u0026nbsp; must\u0026nbsp; abandon your\u0026nbsp; blundering policy\u0026nbsp; ofeconomic bribery\u0026nbsp; and trade in\u0026nbsp; gadgetry, and return to\u0026nbsp; the tested foreignpolicy of our fathers.\"\"You mean conquest by missionary.\"\"Exactly.\"\"No compromise short of that?\"\"None.\"\"Um-mmm.\" Mallow lit up very slowly and inhaled the tip of his cigar into abright glow.\u0026nbsp; \"In Hardin\u0027s\u0026nbsp; time, when conquest\u0026nbsp; by missionary was\u0026nbsp; new andradical, men\u0026nbsp; like yourself opposed it. Now\u0026nbsp; it is tried, tested, hallowed,杄verything a Jorane Sutt\u0026nbsp; would find well. But, tell me, how would you getus out of our present mess?\"\"Your present mess. I had nothing to do with it.\"\"Consider the question suitably modified.\"\"A strong\u0026nbsp; offensive is indicated.\u0026nbsp; The stalemate you seem\u0026nbsp; to be satisfiedwith is\u0026nbsp; fatal. It would be\u0026nbsp; a confession of weakness\u0026nbsp; to all the worlds ofthe\u0026nbsp; Periphery,\u0026nbsp; where the\u0026nbsp; appearance\u0026nbsp; of strength\u0026nbsp; is all-important,\u0026nbsp; andthere\u0027s not\u0026nbsp; one vulture among them that wouldn\u0027t\u0026nbsp; join the assault for itsshare\u0026nbsp; of the\u0026nbsp; corpse. You\u0026nbsp; ought to\u0026nbsp; understand that. You\u0027re\u0026nbsp; from Smyrno,aren\u0027t you?\"Mallow passed\u0026nbsp; over the\u0026nbsp; significance of the\u0026nbsp; remark. He said,\u0026nbsp; \"And if youbeat\u0026nbsp;\u0026nbsp; Korell,\u0026nbsp; what\u0026nbsp;\u0026nbsp; of\u0026nbsp;\u0026nbsp; the\u0026nbsp; Empire?\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; That\u0026nbsp; is\u0026nbsp;\u0026nbsp; the\u0026nbsp; real\u0026nbsp;\u0026nbsp; enemy.\"Sutt\u0027s\u0026nbsp; narrow smile\u0026nbsp; tugged\u0026nbsp; at the\u0026nbsp; comers of\u0026nbsp; his\u0026nbsp; mouth, \"Oh,\u0026nbsp; no, yourrecords\u0026nbsp; of\u0026nbsp; your\u0026nbsp; visit\u0026nbsp; to Siwenna\u0026nbsp; were\u0026nbsp; complete.\u0026nbsp; The\u0026nbsp; viceroy of\u0026nbsp; theNormannic Sector is interested\u0026nbsp; in creating dissension in the Periphery forhis\u0026nbsp; own\u0026nbsp; benefit, but\u0026nbsp; only\u0026nbsp; as\u0026nbsp; a side\u0026nbsp; issue.\u0026nbsp; He isn\u0027t\u0026nbsp; going to\u0026nbsp; stakeeverything on\u0026nbsp; an expedition to the Galaxy\u0027s rim\u0026nbsp; when he has fifty hostileneighbors and\u0026nbsp; an emperor to\u0026nbsp; rebel against. I paraphrase\u0026nbsp; your own words.\"\"Oh, yes he might,\u0026nbsp; Sutt, if he thinks we\u0027re strong enough to be dangerous.\n\u003cbr\u003e And he\u0026nbsp; might think so, if\u0026nbsp; we destroy Korell by\u0026nbsp; the main force of frontalattack. We\u0027d have to be considerably more subtle.\"\"As for instance?\n\u003cbr\u003e Mallow leaned back, \"Sutt, I\u0027ll give you your chance. I don\u0027t need you, butI\u0026nbsp; can use\u0026nbsp; you. So I\u0027ll\u0026nbsp; tell you what\u0026nbsp; it\u0027s all\u0026nbsp; about, and then\u0026nbsp; you caneither join me and\u0026nbsp; receive a place in a coalition cabinet, or you can playthe martyr and rot in jail.\"\"Once before you tried that last trick.\"\"Not\u0026nbsp; very hard,\u0026nbsp; Sutt. The\u0026nbsp; right time\u0026nbsp; has only\u0026nbsp; just come.\u0026nbsp; Now listen.\"Mallow\u0027s eyes narrowed.\n\u003cbr\u003e \"When I\u0026nbsp; first landed on Korell,\"\u0026nbsp; he began, A bribed\u0026nbsp; the Commdor with thetrinkets\u0026nbsp; and gadgets\u0026nbsp; that form\u0026nbsp; the trader\u0027s\u0026nbsp; usual stock. At\u0026nbsp; the start,that. was meant only to get us entrance into a steel foundry. I had no planfurther than that, but in that I succeeded. I got what I wanted. But it wasonly\u0026nbsp; after my visit\u0026nbsp; to the Empire\u0026nbsp; that I\u0026nbsp; first realized exactly\u0026nbsp; what aweapon I could build that trade into.\n\u003cbr\u003e \"This\u0026nbsp; is a\u0026nbsp; Seldon crisis we\u0027re\u0026nbsp; facing, Sutt,\u0026nbsp; and Seldon crises\u0026nbsp; are notsolved by individuals but\u0026nbsp; by historic forces. Hari Seldon, when he plannedour course of future history, did not count on brilliant heroics but on thebroad sweeps\u0026nbsp; of economics and\u0026nbsp; sociology. So the solutions\u0026nbsp; to the variouscrises must\u0026nbsp; be achieved by the\u0026nbsp; forces that become available\u0026nbsp; to us at thetime.\n\u003cbr\u003e \"In this case, 杢rade!\"Sutt raised\u0026nbsp; his eyebrows skeptically\u0026nbsp; and took advantage of\u0026nbsp; the pause, \"Ihope I\u0026nbsp; am not of subnormal\u0026nbsp; intelligence, but the fact\u0026nbsp; is that your vaguelecture isn\u0027t very illuminating.\"\"It will\u0026nbsp; become so,\"\u0026nbsp; said Mallow. \"Consider\u0026nbsp; that until now\u0026nbsp; the power oftrade\u0026nbsp; has\u0026nbsp; been\u0026nbsp; underestimated.\u0026nbsp; It\u0026nbsp; has\u0026nbsp; been\u0026nbsp; thought that\u0026nbsp; it\u0026nbsp; took\u0026nbsp; apriesthood under our control\u0026nbsp; to make it a powerful weapon. That is not so,and\u0026nbsp; this\u0026nbsp; is\u0026nbsp; my contribution\u0026nbsp; to\u0026nbsp; the Galactic\u0026nbsp; situation. Trade\u0026nbsp; withoutpriests! Trade\u0026nbsp; alone! It is strong\u0026nbsp; enough. Let us become\u0026nbsp; very simple andspecific. Korell is now at war with us. Consequently our trade with her hasstopped.\u0026nbsp; But,\u0026nbsp; 杗otice that\u0026nbsp; I am making\u0026nbsp; this as\u0026nbsp; simple as a\u0026nbsp; problem inaddition, 杋n the past\u0026nbsp; three years she has based her economy more and moreupon the nuclear techniques\u0026nbsp; which we have introduced and which only we cancontinue\u0026nbsp; to supply.\u0026nbsp; Now what\u0026nbsp; do you\u0026nbsp; suppose will\u0026nbsp; happen once\u0026nbsp; the tinynuclear generators begin failing,\u0026nbsp; and one gadget after another goes out ofcommission?\n\u003cbr\u003e \"The\u0026nbsp; small household\u0026nbsp; appliances go\u0026nbsp; first. After\u0026nbsp; a half\u0026nbsp; a year\u0026nbsp; of thisstalemate that you abhor,\u0026nbsp; a woman\u0027s nuclear knife won\u0027t work any more. Herstove\u0026nbsp;\u0026nbsp; begins\u0026nbsp; failing.\u0026nbsp;\u0026nbsp; Her\u0026nbsp;\u0026nbsp; washer\u0026nbsp; doesn\u0027t\u0026nbsp;\u0026nbsp; do\u0026nbsp; a\u0026nbsp;\u0026nbsp; good\u0026nbsp;\u0026nbsp; job.\u0026nbsp; Thetemperature-humidity control\u0026nbsp; in her house\u0026nbsp; dies on a hot\u0026nbsp; summer day. Whathappens?\"He paused\u0026nbsp; for an answer, and\u0026nbsp; Sutt said calmly, \"Nothing.\u0026nbsp; People endure agood deal in war.\"\"Very true.\u0026nbsp; They do. They\u0027ll send\u0026nbsp; their sons out in\u0026nbsp; unlimited numbers todie horribly on broken spaceships. They\u0027ll bear up under enemy bombardment,if it means they have to live on stale bread and foul water in caves half amile\u0026nbsp; deep. But\u0026nbsp; it\u0027s very\u0026nbsp; hard to\u0026nbsp; bear up\u0026nbsp; under little things\u0026nbsp; when thepatriotic uplift\u0026nbsp; of imminent\u0026nbsp; danger is not\u0026nbsp; present. It\u0027s going\u0026nbsp; to, be astalemate.\u0026nbsp; There\u0026nbsp; will\u0026nbsp; be no\u0026nbsp; casualties,\u0026nbsp; no\u0026nbsp; bombardments, no\u0026nbsp; battles.\n\u003cbr\u003e \"There will\u0026nbsp; just be a knife\u0026nbsp; that won\u0027t cut, and\u0026nbsp; a stove that won\u0027t cook,and a\u0026nbsp; house that\u0026nbsp; freezes in the\u0026nbsp; winter. It will be\u0026nbsp; annoying, and peoplewill grumble.\"Sutt said slowly, wonderingly,\u0026nbsp; \"Is that what you\u0027re setting your hopes on,man? What\u0026nbsp; do you\u0026nbsp; expect? A housewives\u0027\u0026nbsp; rebellion? A Jacquerie?\u0026nbsp; A suddenuprising\u0026nbsp; of\u0026nbsp; butchers and\u0026nbsp; grocers\u0026nbsp; with their\u0026nbsp; cleavers and\u0026nbsp; bread-knivesshouting\u0026nbsp; \u0027Give\u0026nbsp;\u0026nbsp; us\u0026nbsp; back\u0026nbsp; our\u0026nbsp; Automatic\u0026nbsp;\u0026nbsp; Super-Kleeno\u0026nbsp; Nuclear\u0026nbsp; WashingMachines.\u0027\"\"No,\u0026nbsp; sir,\" said\u0026nbsp; Mallow,\u0026nbsp; impatiently, \"I\u0026nbsp; do\u0026nbsp; not. I\u0026nbsp; expect, however,\u0026nbsp; ageneral background of grumbling and dissatisfaction which will be seized onby more important figures later on.\"\"And what more important figures are these?\"\"The manufacturers, the factory\u0026nbsp; owners, the industrialists of Korell. Whentwo years\u0026nbsp; of the stalemate have gone, the\u0026nbsp; machines in the factories will,one\u0026nbsp; by one,\u0026nbsp; begin to fail.\u0026nbsp; Those industries\u0026nbsp; which we have\u0026nbsp; changed fromfirst\u0026nbsp; to last\u0026nbsp; with\u0026nbsp; our new\u0026nbsp; nuclear\u0026nbsp; gadgets will\u0026nbsp; find themselves\u0026nbsp; verysuddenly ruined. The heavy industries will find themselves, en masse and ata\u0026nbsp; stroke, the\u0026nbsp; owners\u0026nbsp; of nothing\u0026nbsp; but scrap\u0026nbsp; machinery that\u0026nbsp; won\u0027t work.\"\"The\u0026nbsp;\u0026nbsp; factories\u0026nbsp; ran\u0026nbsp;\u0026nbsp; well\u0026nbsp; enough\u0026nbsp;\u0026nbsp; before\u0026nbsp; you\u0026nbsp; came\u0026nbsp;\u0026nbsp; there,\u0026nbsp; Mallow.\"\"Yes, Sutt,\u0026nbsp; so they did ?at about one-twentieth\u0026nbsp; the profits, even if youleave\u0026nbsp; out\u0026nbsp; of\u0026nbsp; consideration\u0026nbsp; the cost\u0026nbsp; of\u0026nbsp; reconversion\u0026nbsp; to the\u0026nbsp; originalpre-nuclear state. With the industrialist and financier and the average manall against him, how long will the Commdor hold out?\"\"As long\u0026nbsp; as he\u0026nbsp; pleases, as soon\u0026nbsp; as it occurs\u0026nbsp; to him to\u0026nbsp; get new nucleargenerators from the Empire.\"And Mallow\u0026nbsp; laughed joyously, \"You\u0027ve missed, Sutt,\u0026nbsp; missed as badly as theCommdor himself.\u0026nbsp; You\u0027ve missed\u0026nbsp; everything, and understood\u0026nbsp; nothing. Look,man, the Empire can\u0026nbsp; replace nothing. The Empire has always been a realm ofcolossal resources.\u0026nbsp; They\u0027ve calculated\u0026nbsp; everything in planets,\u0026nbsp; in stellarsystems,\u0026nbsp; in whole\u0026nbsp; sectors of\u0026nbsp; the Galaxy.\u0026nbsp; Their generators\u0026nbsp; are giganticbecause they thought in gigantic fashion.\n\u003cbr\u003e \"But\u0026nbsp; we, ?we , our\u0026nbsp; little Foundation,\u0026nbsp; our\u0026nbsp; single world\u0026nbsp; almost withoutmetallic resources,\u0026nbsp; 杊ave had\u0026nbsp; to work with brute\u0026nbsp; economy. Our generatorshave had to be the size of our thumb, because it was all the metal we couldafford. We\u0026nbsp; had to develop new techniques\u0026nbsp; and new methods, 杢echniques andmethods\u0026nbsp; the Empire\u0026nbsp; can\u0027t follow\u0026nbsp; because they\u0026nbsp; have degenerated\u0026nbsp; past thestage\u0026nbsp;\u0026nbsp; where\u0026nbsp; they\u0026nbsp;\u0026nbsp; can\u0026nbsp; make\u0026nbsp;\u0026nbsp; any\u0026nbsp; really\u0026nbsp; vital\u0026nbsp;\u0026nbsp; scientific\u0026nbsp; advance.\n\u003cbr\u003e \"With all their nuclear shields, large enough to protect a ship, a city, anentire world; they could never build one to protect a single man. To supplylight and heat to\u0026nbsp; a city, they have motors six stories high, 朓 saw them ?\n\u003cbr\u003e where ours\u0026nbsp; could fit into this room. And when I\u0026nbsp; told one of their nuclearspecialists that a lead\u0026nbsp; container the size of a walnut contained a nucleargenerator,\u0026nbsp;\u0026nbsp; he\u0026nbsp;\u0026nbsp;\u0026nbsp; almost\u0026nbsp;\u0026nbsp; choked\u0026nbsp;\u0026nbsp; with\u0026nbsp;\u0026nbsp; indignation\u0026nbsp;\u0026nbsp;\u0026nbsp; on\u0026nbsp;\u0026nbsp; the\u0026nbsp;\u0026nbsp; spot.\n\u003cbr\u003e \"Why, they don\u0027t even understand their own colossi any longer. The machineswork from generation to\u0026nbsp; generation automatically, and the caretakers are ahereditary caste who would\u0026nbsp; be helpless if a single D-tube in all that vaststructure burnt out.\n\u003cbr\u003e \"The whole\u0026nbsp; war is a battle\u0026nbsp; between those two systems,\u0026nbsp; between the Empireand the\u0026nbsp; Foundation; between the big and the little.\u0026nbsp; To seize control of aworld,\u0026nbsp; they bribe\u0026nbsp; with\u0026nbsp; immense ships\u0026nbsp; that can\u0026nbsp; make\u0026nbsp; war, but\u0026nbsp; lack alleconomic\u0026nbsp; significance. We, on\u0026nbsp; the other\u0026nbsp; hand, bribe with\u0026nbsp; little things,useless in war, but vital to prosperity and profits.\n\u003cbr\u003e \"A king,\u0026nbsp; or a\u0026nbsp; Commdor, will take\u0026nbsp; the ships and even\u0026nbsp; make war. Arbitraryrulers throughout\u0026nbsp; history have\u0026nbsp; bartered their subjects\u0027\u0026nbsp; welfare for whatthey consider\u0026nbsp; honor, and\u0026nbsp; glory, and conquest.\u0026nbsp; But it\u0027s still\u0026nbsp; the littlethings\u0026nbsp; in life\u0026nbsp; that count\u0026nbsp; ?and\u0026nbsp; Asper Argo\u0026nbsp; won\u0027t stand up\u0026nbsp; against theeconomic\u0026nbsp; depression that\u0026nbsp; will sweep\u0026nbsp; all Korell\u0026nbsp; in two or\u0026nbsp; three years.\"Sutt was\u0026nbsp; at the window, his back to Mallow and\u0026nbsp; Jael. It was early eveningnow, and\u0026nbsp; the few stars that\u0026nbsp; struggled feebly here at\u0026nbsp; the very rim of theGalaxy\u0026nbsp; sparked\u0026nbsp; against\u0026nbsp; the\u0026nbsp; background of\u0026nbsp; the\u0026nbsp; misty,\u0026nbsp; wispy Lens\u0026nbsp; thatincluded the remnants of that Empire, still vast, that fought against them.\n\u003cbr\u003e Sutt said, \"No. You are not the man.\"\"You don\u0027t believe me?\"\"I mean I don\u0027t\u0026nbsp; trust you. You\u0027re smooth-tongued. You befooled me properlywhen I\u0026nbsp; thought I had you\u0026nbsp; under proper care on\u0026nbsp; your first trip to Korell.\n\u003cbr\u003e When I thought I\u0026nbsp; had you cornered at the trial, you wormed your way out ofit and\u0026nbsp; into the\u0026nbsp; mayor\u0027s chair by\u0026nbsp; demagoguery. There is\u0026nbsp; nothing straightabout\u0026nbsp; you; no\u0026nbsp; motive\u0026nbsp; that hasn\u0027t\u0026nbsp; another behind\u0026nbsp; it; no\u0026nbsp; statement thathasn\u0027t three meanings.\n\u003cbr\u003e \"Suppose you\u0026nbsp; were a traitor. Suppose your visit\u0026nbsp; to the Empire had broughtyou a subsidy and\u0026nbsp; a promise of power. Your actions would be precisely whatthey are\u0026nbsp; now. You\u0026nbsp; would bring about\u0026nbsp; a war after\u0026nbsp; having strengthened theenemy.\u0026nbsp; You\u0026nbsp; would force\u0026nbsp; the\u0026nbsp; Foundation\u0026nbsp; into inactivity.\u0026nbsp; And you\u0026nbsp; wouldadvance a\u0026nbsp; plausible explanation\u0026nbsp; of everything, one so\u0026nbsp; plausible it wouldconvince everyone.\"\"You\u0026nbsp;\u0026nbsp; mean\u0026nbsp;\u0026nbsp; there\u0027ll\u0026nbsp;\u0026nbsp; be\u0026nbsp;\u0026nbsp; no\u0026nbsp;\u0026nbsp; compromise?\"\u0026nbsp;\u0026nbsp; asked\u0026nbsp;\u0026nbsp; Mallow,\u0026nbsp;\u0026nbsp; gently.\n\u003cbr\u003e \"I mean you must get out, by free will or force.\"\"I warned you of the only alternative to co-operation.\"Jorane Sutt\u0027s face congested with blood in a sudden access of emotion. \"AndI warn you, Hober Mallow of Smyrno, that if you arrest me, there will be noquarter. My men will stop nowhere in spreading the truth about you, and thecommon\u0026nbsp; people of the\u0026nbsp; Foundation will\u0026nbsp; unite against their\u0026nbsp; foreign ruler.\n\u003cbr\u003e They have a consciousness of destiny that a Smyrnian can never understand ?\n\u003cbr\u003e and that consciousness will destroy you.\"Hober\u0026nbsp; Mallow said\u0026nbsp; quietly to the\u0026nbsp; two guards\u0026nbsp; who had entered,\u0026nbsp; \"Take himaway. He\u0027s under arrest.\"Sutt said, \"Your last chance.\"Mallow stubbed out his cigar and never looked up.\n\u003cbr\u003e And five\u0026nbsp; minutes later,\u0026nbsp; Jael stirred and\u0026nbsp; said, wearily, \"Well,\u0026nbsp; now thatyou\u0027ve made a martyr for the cause, what next?\"Mallow stopped playing with the ash tray and looked up, \"That\u0027s not theSutt I used to know. He\u0027s a blood-blind bull. Galaxy, he hates me.\"\"All the more dangerous then.\"\"More\u0026nbsp;\u0026nbsp; dangerous?\u0026nbsp;\u0026nbsp; Nonsense!\u0026nbsp; He\u0027s\u0026nbsp;\u0026nbsp; lost\u0026nbsp;\u0026nbsp; all\u0026nbsp;\u0026nbsp; power\u0026nbsp; of\u0026nbsp;\u0026nbsp; judgement.\"Jael\u0026nbsp; said\u0026nbsp; grimly,\u0026nbsp; \"You\u0027re\u0026nbsp; overconfident, Mallow.\u0026nbsp; You\u0027re\u0026nbsp; ignoring\u0026nbsp; thepossibility of a popular rebellion.\"Mallow looked\u0026nbsp; up, grim in his\u0026nbsp; turn, \"Once and for\u0026nbsp; all, Jael, there is nopossibility of a popular rebellion.\"\"You\u0027re sure of yourself!\"\"I\u0027m\u0026nbsp; sure\u0026nbsp; of the\u0026nbsp; Seldon\u0026nbsp; crisis\u0026nbsp; and the\u0026nbsp; historical\u0026nbsp; validity of\u0026nbsp; theirsolutions, externally\u0026nbsp; and internally. There are some things\u0026nbsp; I didn\u0027t tellSuit\u0026nbsp; right now.\u0026nbsp; He tried\u0026nbsp; to control\u0026nbsp; the Foundation itself\u0026nbsp; by religiousforces\u0026nbsp; as he\u0026nbsp; controlled the outer\u0026nbsp; worlds, and\u0026nbsp; he failed, 杦hich\u0026nbsp; is thesurest\u0026nbsp; sign\u0026nbsp;\u0026nbsp; that\u0026nbsp; in\u0026nbsp;\u0026nbsp; the\u0026nbsp; Seldon\u0026nbsp; scheme,\u0026nbsp; religion\u0026nbsp;\u0026nbsp; is\u0026nbsp; played\u0026nbsp; out.\n\u003cbr\u003e \"Economic control worked differently.\u0026nbsp; And to paraphrase that famous SalvorHardin quotation\u0026nbsp; of yours,\u0026nbsp; it\u0027s a poor\u0026nbsp; nuclear blaster that\u0026nbsp; won\u0027t pointboth\u0026nbsp; ways. If\u0026nbsp; Korell prospered with\u0026nbsp; our trade,\u0026nbsp; so did we.\u0026nbsp; If Korellianfactories fail without our trade; and if the prosperity of the outer worldsvanishes\u0026nbsp; with commercial\u0026nbsp; isolation; so\u0026nbsp; will our\u0026nbsp; factories fail\u0026nbsp; and ourprosperity vanish.\n\u003cbr\u003e \"And there isn\u0027t a\u0026nbsp; factory, not a trading center. not a shipping line thatisn\u0027t under my control; that I couldn\u0027t squeeze to nothing if Sutt attemptsrevolutionary propaganda.\u0026nbsp; Where his propaganda succeeds,\u0026nbsp; or even looks asthough it might succeed, I will make certain that prosperity dies. Where itfails,\u0026nbsp; prosperity will\u0026nbsp; continue, because\u0026nbsp; my factories will\u0026nbsp; remain fullystaffed.\n\u003cbr\u003e \"So\u0026nbsp; by the\u0026nbsp; same reasoning which\u0026nbsp; makes me\u0026nbsp; sure that the\u0026nbsp; Korellians willrevolt in favor of prosperity, I am sure we will not revolt against it. Thegame will be played out to its end.\"\"So then,\" said Jael, \"you\u0027re establishing a plutocracy. You\u0027re making us aland\u0026nbsp; of\u0026nbsp;\u0026nbsp; traders\u0026nbsp; and\u0026nbsp; merchant\u0026nbsp; princes.\u0026nbsp;\u0026nbsp; Then\u0026nbsp; what\u0026nbsp; of\u0026nbsp; the\u0026nbsp; future?\"Mallow lifted\u0026nbsp; his gloomy\u0026nbsp; face, and exclaimed fiercely,\u0026nbsp; \"What business ofmine is\u0026nbsp; the future? No doubt\u0026nbsp; Seldon has foreseen it\u0026nbsp; and prepared againstit. There\u0026nbsp; will be\u0026nbsp; other crises in the\u0026nbsp; time to come when\u0026nbsp; money power hasbecome as\u0026nbsp; dead a force as\u0026nbsp; religion is now. Let\u0026nbsp; my successors solve thosenew problems, as I have solved the one of today.\"KORELL?..And so\u0026nbsp; after three years of\u0026nbsp; a war which was\u0026nbsp; certainly the mostunfought war on record, the Republic of Korell surrendered unconditionally,and Hober\u0026nbsp; Mallow took his place\u0026nbsp; next to Hari Seldon\u0026nbsp; and Salvor Hardin inthe hearts of the people of the Foundation.\n\u003cbr\u003e ENCYCLOPEDIA GALACTICA\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; ABOUT THE AUTHORIsaac Asimov\u0026nbsp; was born in the Soviet union to\u0026nbsp; his great surprise. He movedquickly to correct the\u0026nbsp; situation. When his parents emigrated to the UnitedStates, Isaac\u0026nbsp; (three years old at the time)\u0026nbsp; stowed away in their baggage.\n\u003cbr\u003e He has been an American citizen since the age of eight.\n\u003cbr\u003e Brought up\u0026nbsp; in Brooklyn, and educated in\u0026nbsp; its public schools, he eventuallyfound his\u0026nbsp; way to Columbia University and, over\u0026nbsp; the protests of the schooladministration, managed\u0026nbsp; to annex a\u0026nbsp; series of degrees in\u0026nbsp; chemistry, up toand including a Ph.D. He then infiltrated Boston University and climbed theacademic\u0026nbsp; ladder, ignoring\u0026nbsp; all cries\u0026nbsp; of outrage,\u0026nbsp; until he\u0026nbsp; found himselfProfessor of Biochemistry.\n\u003cbr\u003e Meanwhile,\u0026nbsp; at the\u0026nbsp; age of\u0026nbsp; nine, he\u0026nbsp; found the\u0026nbsp; love of\u0026nbsp; his life\u0026nbsp; (in theinanimate sense) when he\u0026nbsp; discovered his first science-fiction magazine. Bythe\u0026nbsp; time he was\u0026nbsp; eleven, he began\u0026nbsp; to write\u0026nbsp; stories, and at\u0026nbsp; eighteen, heactually worked\u0026nbsp; up the\u0026nbsp; nerve to submit\u0026nbsp; one. It was\u0026nbsp; rejected. After fourlong\u0026nbsp; months of\u0026nbsp; tribulation and\u0026nbsp; suffering, he\u0026nbsp; sold his first\u0026nbsp; story and,thereafter, he never looked back.\n\u003cbr\u003e In 1941, when he was twenty-one years old, he wrote the classic short story\"Nightfall\" and\u0026nbsp; his future was\u0026nbsp; assured. Shortly before that\u0026nbsp; he had begunwriting\u0026nbsp; his\u0026nbsp; robot\u0026nbsp; stories,\u0026nbsp; and shortly\u0026nbsp; after\u0026nbsp; that\u0026nbsp; he\u0026nbsp; had begun\u0026nbsp; hisFoundation series.\n\u003cbr\u003e What was\u0026nbsp; left except quantity? At the present\u0026nbsp; time, he has published over260 books, distributed through\u0026nbsp; every major division of the Dewey system oflibrary classification,\u0026nbsp; and shows\u0026nbsp; no signs of\u0026nbsp; slowing up. He\u0026nbsp; remains asyouthful, as\u0026nbsp; lively, and as lovable as ever,\u0026nbsp; and grows more handsome witheach year. You can be sure that this is so since he has written this littleessay\u0026nbsp; himself\u0026nbsp; and\u0026nbsp; his devotion\u0026nbsp; to\u0026nbsp; absolute\u0026nbsp; objectivity is\u0026nbsp; notorious.\n\u003cbr\u003e He is\u0026nbsp; married to Janet Jeppson, psychiatrist\u0026nbsp; and writer, has two childrenby a previous marriage, and lives in New York City.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1586/47319.html","bookId":127,"creation":"Aug 1, 2019 4:40:38 AM","modification":"Aug 1, 2019 4:40:38 AM"}
