{"id":91286,"no":27,"title":"Page 27","content":"\u003cp\u003eThe Sea Sprite cut a difficult course northward up the Sword Coast, into the wintry winds, but Captain Deudermont and his grateful crew were determined to see the four friends safely and swiftly back to Waterdeep.\u003c/p\u003e\n\u003cp\u003eStunned expressions from every face on the docks greeted the resilient vessel as it put into Waterdeep Harbor, dodging the breakers and the ice floes as it went. Mustering all the skill he had gained through years of experience, Deudermont docked the Sea Sprite safely.\u003c/p\u003e\n\u003cp\u003eThe four friends had recovered much of their health, and their humor, during those two months at sea, despite the rough voyage. All had turned out well in the end - even Catti-brie\u0027s wounds appeared as if they would fully heal.\u003c/p\u003e\n\u003cp\u003eBut if the sea voyage back to the North was difficult, the trek across the frozen lands was even worse. Winter was on the wane but still thick in the land, and the friends could not afford to wait for the snows to melt. They said their goodbyes to Deudermont and the men of the Sea Sprite, tightened heavy cloaks and boots, and trudged off through Waterdeep\u0027s gate along the Trade Way on the northeastern course to Longsaddle.\u003c/p\u003e\n\u003cp\u003eBlizzards and wolves reared up to stop them. The path of the road, its plentiful markings buried under a year\u0027s worth of snow, became no more than the guess of a drow elf reading the stars and the sun.\u003c/p\u003e\n\u003cp\u003eSomehow they made it, though, and they stormed into Longsaddle, ready to retake Mithril Hall. Bruenor\u0027s kin from Icewind Dale were there to greet them, along with five hundred of Wulfgar\u0027s people. Less than two weeks later, General Dagnabit of Citadel Adbar led his eight thousand dwarven troops to Bruenor\u0027s side.\u003c/p\u003e\n\u003cp\u003eBattle plans were drawn and redrawn. Drizzt and Bruenor put their memories of the undercity and mine caverns together to create models of the place and estimate the number of duergar the army would face.\u003c/p\u003e\n\u003cp\u003eThen, with spring defeating the last blows of winter, and only a few days before the army was to set out to the mountains, two more groups of allies came in, quite unexpectedly: contingents of archers from Silverymoon and Nesme. Bruenor at first wanted to turn the warriors from Nesme away, remembering the treatment he and his friends had received at the hands of a Nesme patrol on their initial journey to Mithril Hall, and also because the dwarf wondered how much of the show of allegiance was motivated in the hopes of friendship, and how much in the hopes of profit!\u003c/p\u003e\n\u003cp\u003eBut, as usual, Bruenor\u0027s friends kept him on a wise course. The dwarves would have to deal extensively with Nesme, the closest settlement to Mithril Hall, once the mines were reopened, and a smart leader would patch the bad feelings there and then.\u003c/p\u003e\n\u003cp\u003eTheir numbers were overwhelming, their determination unrivaled, and their leaders magnificent. Bruenor and Dagnabit led the main assault force of battle-hardened dwarves and wild barbarians, sweeping out room after room of the duergar scum. Catti-brie, with her bow, the few Harpells who had made the journey, and the archers from the two cities, cleared the side passages along the main force\u0027s thrust.\u003c/p\u003e\n\u003cp\u003eDrizzt, Wulfgar, and Guenhwyvar, as they had so often in the past, forged out alone, scouting the areas ahead of and below the army, taking out more than their share of duergar along the way.\u003c/p\u003e\n\u003cp\u003eIn three days, the top level was cleared. In two weeks, the undercity. By the time spring had settled fully onto the northland, less than a month after the army had set out from Longsaddle, the hammers of Clan Battlehammer began their smithing song in the ancient halls once again.\u003c/p\u003e\n\u003cp\u003eAnd the rightful king took his throne.\u003c/p\u003e\n\u003cp\u003eDrizzt looked down from the mountains to the distant lights of the enchanted city of Silverymoon. He had been turned away from that city once before - a painful rejection - but not this time.\u003c/p\u003e\n\u003cp\u003eHe could walk the land as he chose, now, with his head held high and the cowl of his cloak thrown back. Most of the world did not treat him any differently; few knew the name of Drizzt Do\u0027Urden. But Drizzt knew now that he owed no apologies, or excuses, for his black skin, and to those who placed unfair judgment upon him, he offered none.\u003c/p\u003e\n\u003cp\u003eThe weight of the world\u0027s prejudice would still fall upon him heavily, but Drizzt had learned, by the insights of Catti-brie, to stand against it.\u003c/p\u003e\n\u003cp\u003eWhat a wonderful friend she was to him. Drizzt had watched her grow into a special young woman, and he was warmed now by the knowledge that she had found her home.\u003c/p\u003e\n\u003cp\u003eThe thought of her with Wulfgar, and standing beside Bruenor, touched the dark elf, who had never experienced the closeness of family.\u003c/p\u003e\n\u003cp\u003e\"How much we all have changed,\" the drow whispered to the empty mountain wind.\u003c/p\u003e\n\u003cp\u003eHis words were not a lament.\u003c/p\u003e\n\u003cp\u003eThe autumn saw the first crafted goods flow from Mithril Hall to Silverymoon, and by the time winter turned again to spring, the trade was in full force, with the barbarians from Icewind Dale working as market bearers for the dwarven goods.\u003c/p\u003e\n\u003cp\u003eThat spring, too, a carving was begun in the Hall of Kings: the likeness of Bruenor Battlehammer.\u003c/p\u003e\n\u003cp\u003eTo the dwarf who had wandered so far from his home and had seen so many marvelous - and horrible - sights, the reopening of the mines, and even the carving of his bust, seemed of minor importance when weighed against another event planned for that year.\u003c/p\u003e\n\u003cp\u003e\"I told ye he\u0027d be back,\" Bruenor said to Wulfgar and Catti-brie, who both sat beside him in his audience hall. \"Th\u0027 elf\u0027d not be missing such a thing as yer wedding!\"\u003c/p\u003e\n\u003cp\u003eGeneral Dagnabit - who, with blessings from King Harbromme of Citadel Adbar, had stayed on with two thousand other dwarves, swearing allegiance to Bruenor - entered the room, escorting a figure who had become less and less noticeable in Mithril Hall over the last few months.\u003c/p\u003e\n\u003cp\u003e\"Greetings,\" said Drizzt, moving up to his friends.\u003c/p\u003e\n\u003cp\u003e\"So ye made it,\" Catti-brie said absently, feigning disinterest.\u003c/p\u003e\n\u003cp\u003e\"We had not planned for this,\" added Wulfgar in the same casual tone. \"I pray that there may be an extra seat at the table.\"\u003c/p\u003e\n\u003cp\u003eDrizzt only smiled and bowed low in apology. He had been absent quite often - for weeks at a time - lately. Personal invitations to visit the Lady of Silverymoon and her enchanted realm were not so easily refused.\u003c/p\u003e\n\u003cp\u003e\"Bah!\" Bruenor snorted. \"I told ye he\u0027d come back! And back to stay, this time!\"\u003c/p\u003e\n\u003cp\u003eDrizzt shook his head.\u003c/p\u003e\n\u003cp\u003eBruenor cocked his in return, wondering what was getting into his friend. \"Ye hunting for that assassin, elf?\" he could not help but ask.\u003c/p\u003e\n\u003cp\u003eDrizzt grinned and shook his head again. \"I\u0027ve no desire to meet that one again,\" he replied. He looked at Catti-brie - she understood - then back to Bruenor. \"There are many sights in the wide world, dear dwarf, that cannot be seen from the shadows. Many sounds more pleasant than the ring of steel, and many smells preferable to the stench of death.\"\u003c/p\u003e\n\u003cp\u003e\"Cook another feast,\" Bruenor grumbled. \"Suren the elf has his eyes fixed on another wedding!\"\u003c/p\u003e\n\u003cp\u003eDrizzt let it go at that. Maybe there was a ring of truth in Bruenor\u0027s words, for some distant date. No longer did Drizzt limit his hopes and desires. He would see the world as he could and draw his choices from his wishes, not from limitations he might impose upon himself. For now, though, Drizzt had found something too personal to be shared.\u003c/p\u003e\n\u003cp\u003eFor the first time in his life, the drow had found peace.\u003c/p\u003e\n\u003cp\u003eAnother dwarf entered the room and scurried up to Dagnabit. They both took their leave, but Dagnabit returned a few moments later.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Bruenor asked him, confused by all the bustle.\u003c/p\u003e\n\u003cp\u003e\"Another guest,\" Dagnabit explained, but before he could launch a proper introduction, a halfling figure slipped into the room.\u003c/p\u003e\n\u003cp\u003e\"Regis!\" Catti-brie cried. She and Wulfgar rushed to meet their old friend.\u003c/p\u003e\n\u003cp\u003e\"Rumblebelly!\" Bruenor yelled. \"What in the Nine Hells - \"\u003c/p\u003e\n\u003cp\u003e\"Did you believe that I would miss this occasion?\" Regis huffed. \"The wedding of two of my dearest friends?\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027d ye know?\" Bruenor asked.\u003c/p\u003e\n\u003cp\u003e\"You underestimate your fame, King Bruenor,\" Regis said, dropping into a graceful bow.\u003c/p\u003e\n\u003cp\u003eDrizzt studied the halfling curiously. He wore his gemstudded jacket and more jewelry, including the ruby pendant, than the drow had ever seen in one place. And the pouches hanging low on Regis\u0027s belt were sure to be filled with gold and gems.\u003c/p\u003e\n\u003cp\u003e\"Might ye be staying long?\" Catti-brie asked.\u003c/p\u003e\n\u003cp\u003eRegis shrugged. \"I am in no hurry,\" he replied. Drizzt cocked an eyebrow. A master of a thieves\u0027 guild did not often leave his place of power; too many were usually ready to steal it out from under him.\u003c/p\u003e\n\u003cp\u003eCatti-brie seemed happy with the answer and happy with the timing of the halfling\u0027s return. Wulfgar\u0027s people were soon to rebuild the city of Settlestone, at the base of the mountains. She and Wulfgar, though, planned to remain in Mithril Hall, at Bruenor\u0027s side. After the wedding, they planned to do a bit of traveling they\u0027d had in mind, maybe back to Icewind Dale, maybe along with Captain Deudermont later in the year, when the Sea Sprite sailed back to the southlands.\u003c/p\u003e\n\u003cp\u003eCatti-brie dreaded telling Bruenor that they would be leaving, if only for a few months. With Drizzt so often on the road, she feared that the dwarf would be miserable. But if Regis planned to stay on for a while...\u003c/p\u003e\n\u003cp\u003e\"Might I have a room,\" Regis asked, \"to put my things and to rest away the weariness of a long road?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see to it,\" Catti-brie offered.\u003c/p\u003e\n\u003cp\u003e\"And for your attendants?\" Bruenor asked.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" stammered Regis, searching for a reply. \"I...came alone. The southerners do not take well to the chill of a northern spring, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Well, off with ye, then,\" said Bruenor. \"Suren it be me turn to set out a feast for the pleasure of yer belly.\"\u003c/p\u003e\n\u003cp\u003eRegis rubbed his hands together eagerly and left with Wulfgar and Catti-brie, the three of them breaking into tales of their latest adventures before they had even left the room.\u003c/p\u003e\n\u003cp\u003e\"Suren few folk in Calimport have ever heared o\u0027 me name, elf,\" Bruenor said to Drizzt after the others had gone. \"And who south o\u0027 Longsaddle would be knowing of the wedding?\" He turned a sly eye on his dark friend. \"Suren the little one brings a bit of his treasure along with him, eh?\"\u003c/p\u003e\n\u003cp\u003eDrizzt had come to the same conclusion the moment Regis had entered the room. \"He is running.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dark-elf-trilogy-exile-the-dark-elf-trilogy-2/page-27.html","bookId":2105,"creation":"Oct 5, 2019 5:49:29 PM","modification":"Oct 5, 2019 5:49:29 PM"}
