{"id":104939,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThen, I heard the spray change, the splattering on the tiles taking on a different tone. I glanced up and saw the part of the flow farthest from me slowly return to normal, the water shooting past the invisible obstruction in a gentle arc. The unseen thing was passing out of the stream. It wasn’t until the spray looked completely normal again that I realized this meant the invisible thing that had been blocking the water was now moving toward me.\u003c/p\u003e\n\u003cp\u003eI jumped back, moving so quick that I thought the half-open shower curtain had blown back from the wind of my rapid movement. But that wasn’t right, because the curtain didn’t return to its normal shape right away. It stayed bulged outward, something unseen pushing against it. I backed up against the wall, feeling the towel bar pressing into my back. The shower curtain fell straight again and now there was nothing in the bathroom but the radio static sound of the shower splattering against tile. I stood there, frozen, heart pounding so hard I was getting dizzy. I slowly put a hand out, tentative, toward the curtain, through the space the unseen thing had passed …\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eI decided to forget about the shower. I cranked off the water, turned toward the door and—\u003c/p\u003e\n\u003cp\u003eI saw something. Or I almost did. Just out of the corner of my eye, a dark shape, a black figure whipping through the doorway just out of sight. Like a shadow without the person.\u003c/p\u003e\n\u003cp\u003eI couldn’t have seen it for more than a tenth of a second, but I did see it, now imprinted in my brain from that flash of a glance. The form, black, in the shape of a man but then becoming formless, like a single drop of dark food coloring before it dissolves in a sink of running water.\u003c/p\u003e\n\u003cp\u003eI had seen it before.\u003c/p\u003e\n\u003cp\u003e“… I thought I saw something in there. I don’t know. Probably nothing.”\u003c/p\u003e\n\u003cp\u003eI slumped in the chair and crossed my arms.\u003c/p\u003e\n\u003cp\u003e“This is a source of anxiety for you. Having these beliefs, and feeling like you can’t talk about them without being dismissed.”\u003c/p\u003e\n\u003cp\u003eI stared out of the window, at my Bronco rusting in the parking lot, the metal eager to get back to just being dirt. Life was probably easier for it back then.\u003c/p\u003e\n\u003cp\u003eI said, “Who’s paying for these sessions again?”\u003c/p\u003e\n\u003cp\u003e“Payment is your responsibility. But we have a sliding scale.”\u003c/p\u003e\n\u003cp\u003e“Awesome.”\u003c/p\u003e\n\u003cp\u003eHe considered for a moment and then said, “Would it put you more at ease if I told you that I believe in monsters?”\u003c/p\u003e\n\u003cp\u003e“It might put me at ease, but I can’t speak for the people who hand out psychiatrist licenses.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you a story. Now, I understand that with your … hobbies, people contact you, correct? Believing they have ghosts or demons in their homes?”\u003c/p\u003e\n\u003cp\u003e“Sometimes.”\u003c/p\u003e\n\u003cp\u003e“And I am going to make an assumption—if you arrive and tell them that the source of their anxiety is not in fact supernatural, they are anything but relieved. Correct? Meaning they want the banging in their attic to be a ghost, and not a squirrel trapped in the chimney.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess.”\u003c/p\u003e\n\u003cp\u003e“So you see, fear is just another manifestation of insecurity. What humans want most of all, is to be right. Even if we’re being right about our own doom. If we believe there are monsters around the next corner ready to tear us apart, we would literally prefer to be right about the monsters, than to be shown to be wrong in the eyes of others and made to look foolish.”\u003c/p\u003e\n\u003cp\u003eI didn’t answer. I glanced around for a clock. He didn’t have one, the bastard.\u003c/p\u003e\n\u003cp\u003e“So, a few years ago, while I was presenting at a conference in Europe, my wife called and insisted that the walls of our laundry room were throbbing. That was the word she used. Pulsing, like the wall itself was alive. She described a hum, an energy, that she could feel as soon as she walked into the room. I suggested it was a wiring problem. She became … let’s just say, agitated at that point. Three days later, just before I was due to come back, she called again. The problem was getting worse, she said. There was an audible hum now, from the wall. She couldn’t sleep. She could hear it as soon as she walked in the house. She could feel it, the vibration, like something unnatural was ready to burst forth into our world. So, I flew home the next day, and found her extremely upset. I understood immediately why my suggestion of a wiring problem was so insulting—this was the sound of something alive. Something massive. So, even though I was exhausted, jet-lagged and just completely dead on my feet, I had no other thought than to go out to the garage, get my tools and peel off the siding. Guess what I found.”\u003c/p\u003e\n\u003cp\u003eI didn’t answer.\u003c/p\u003e\n\u003cp\u003e“Guess!”\u003c/p\u003e\n\u003cp\u003e“I’m not sure I want to know.”\u003c/p\u003e\n\u003cp\u003e“Bees. They had built an entire hive in the wall, sprawling from floor to ceiling. Tens of thousands of them.”\u003c/p\u003e\n\u003cp\u003eHis face was lighting up with the telling of his amusing anecdote. Why not? He was getting paid to tell it.\u003c/p\u003e\n\u003cp\u003e“So I went and put on a hat and gloves and wrapped my wife’s scarf around my face and sprayed the hive, I killed them by the thousands. Only later did I realize that the bees are quite valuable and a local beekeeper actually came and carefully removed the hive itself at no charge. I think he’d have actually paid me if I hadn’t killed so many of them at the start.”\u003c/p\u003e\n\u003cp\u003e“Hmm.”\u003c/p\u003e\n\u003cp\u003e“Do you understand?”\u003c/p\u003e\n\u003cp\u003e“Yeah, your wife thought it was a monster. Turned out to just be bees. So my little problem, probably just bees. It’s all bees. Nothing to worry about.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid you misunderstood. That was the day that a very powerful, very dangerous monster turned out to be real. Just ask the bees.”\u003c/p\u003e\n\u003cp\u003e36 Hours Prior to Outbreak\u003c/p\u003e\n\u003cp\u003eI said, “Can you see me?”\u003c/p\u003e\n\u003cp\u003eThe freckled redhead on my laptop screen said, “Yep.” Amy Sullivan had her hair in pigtails, which I like, and was wearing a huge, ironic T-shirt with a badly drawn eagle and American flag on it, which I hate. It was like a tent on her.\u003c/p\u003e\n\u003cp\u003eShe asked, “How did your therapy go?”\u003c/p\u003e\n\u003cp\u003e“Jesus, Amy. You don’t start a conversation with your boyfriend asking him how his court-ordered therapy went. You have to ease into that.”\u003c/p\u003e\n\u003cp\u003e“Ah, sorry.”\u003c/p\u003e\n\u003cp\u003e“It’s a sensitive subject.”\u003c/p\u003e\n\u003cp\u003e“Okay, forget it.”\u003c/p\u003e\n\u003cp\u003eI said, “Are you coming home for Thanksgiving?”\u003c/p\u003e\n\u003cp\u003e“Yep. You miss me, don’t you?”\u003c/p\u003e\n\u003cp\u003e“You know I can’t function on my own.”\u003c/p\u003e\n\u003cp\u003eAfter a beat and another sip of tea she said, “Are you going to be all right? Not just with the therapy but that whole … situation?”\u003c/p\u003e\n\u003cp\u003e“Your, uh, roommate isn’t around, right?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Okay. Yeah, it’s fine. Everything is quiet.”\u003c/p\u003e\n\u003cp\u003eShe said, “That scared me, that night.”\u003c/p\u003e\n\u003cp\u003e“I know it did.”\u003c/p\u003e\n\u003cp\u003e“Nothing had happened like that for a long time—”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“If something like that happens again—”\u003c/p\u003e\n\u003cp\u003e“I’ll shoot it with a crossbow again. I told you that.”\u003c/p\u003e\n\u003cp\u003e“Did you talk to your therapist about that?”\u003c/p\u003e\n\u003cp\u003e“Subtle, Amy.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m curious.”\u003c/p\u003e\n\u003cp\u003e“How did I find a girl who’s worse at conversation than I am?”\u003c/p\u003e\n\u003cp\u003eShe took a sip from a teacup she pulled from off camera. She had to balance the cup with her left wrist. That is, the stump where her left hand should be. She was in a car accident when she was a teenager, before I knew her. The crash took her hand and her parents, and left her with chronic back pain and an implanted titanium rod in her spine. She refused to get a prosthetic hand because she thought they were “creepy.” But in my mind, between the titanium spine and a robot hand, she’d be like 10 percent of the way to a cyborg, an idea that I found more than mildly arousing.\u003c/p\u003e\n\u003cp\u003eAmy and I had “met” in high school, in a special ed classroom for kids with “behavior” disorders. Neither of us really belonged there, she was there because she had a bad reaction to pain medication and bit a teacher, I was there due to a misunderstanding (a bully kept fucking with me until I snapped and gouged out his eyes—you know how kids are). Our fairy-tale romance began by us completely ignoring each other for five years, during which I only knew her by a crude nickname some asshole had given her. Then one day, John and I were asked as a favor to look into her disappearance. It wasn’t a big deal, and only took us a couple of days to get to the bottom of it (she had been kidnapped by monsters).\u003c/p\u003e\n\u003cp\u003eSetting aside her tea she said, “So what’s he like? The psychiatrist?”\u003c/p\u003e\n\u003cp\u003e“It’s just like you’ve seen in the movies, Amy. They get you talking and wait for you to announce you’ve had an epiphany.” I thought for a moment, then said, “And the therapist was a she, not a he. She’s about twenty-two. Busty. She kept turning everything into some kind of sexual innuendo. Like she said she believed therapy should be ‘hands on’ and grabbed my crotch. Then we porked on the desk for a while and the time was up.” I shrugged. “Like I said, it’s just like in that movie. Anal Therapist VI.”\u003c/p\u003e\n\u003cp\u003eShe sighed and sipped her tea. “So I guess you don’t miss me after all.”\u003c/p\u003e\n\u003cp\u003e“Wait … were we not supposed to be having sex with other people, Amy? I guess that was never made clear to me, sorry.”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer, or laugh, and I said, “Come on, you know if one of us wanted to sleep around you’d have a way easier time than I would. I’m the crazy guy who sees monsters and shoots delivery people. You’re the adorable redhead. You could go down to the guys’ floor of the dorm and say, ‘I’m a woman. I want to have sex’ and you’d have twenty guys lined up with roses and shit. I’d have to work at it.”\u003c/p\u003e\n\u003cp\u003e“Why do guys always say that? It’s just as hard for a girl.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous. Every bar is full of guys desperate to get laid and girls desperate to fend off all the horny guys. It’s just the way it is, it’s biology. It’s easier for girls.”\u003c/p\u003e\n\u003cp\u003e“That’s actually impossible. Heterosexual sex takes one man and one woman. That means guys and girls have the exact same amount of sex. That means there are an equal number of sluts and desperate people on both sides.” \u003c/p\u003e","sourceLink":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2/page-3.html","bookId":2488,"creation":"Oct 5, 2019 10:41:47 PM","modification":"Oct 5, 2019 10:41:47 PM"}
