{"id":104966,"no":31,"title":"Page 31","content":"\u003cp\u003e“Dr. Tennet, can you hear the fucking people behind me, screaming for help? Can you hear them over this intercom thing?”\u003c/p\u003e\n\u003cp\u003e“Which people? The gentleman asking for help with his wife? We lost two staff members trying to help that man’s poor ‘wife.’ If you open that door, you’ll indeed find what looks like a very frail, wounded woman. If you get within striking distance, you’ll find that woman is the transfigured tongue of a grindworm.”\u003c/p\u003e\n\u003cp\u003e“A what?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, we have to come up with names for the organisms the parasite transforms its victims into. Without getting into detail, let me just say that we spent sixteen hours trying to recover our two staff members from the creature, their screams echoing down this hall the entire night, and next day, as they were slowly twisted to pieces. The creature has been spitting splinters of their bones under its door ever since. So hopefully you’ll understand why we’re leaving that door locked. ‘Fool me once,’ as they say.”\u003c/p\u003e\n\u003cp\u003e“So … you just lock everybody up and wait for us to turn monster?”\u003c/p\u003e\n\u003cp\u003e“As I said, we’re making progress. But, regardless, this conversation is only wasting time and taxpayer money at this point, when all I need to know is if you feel up to joining the others out in the fresh air and sunshine of the hospital lawn. We need your room, to be perfectly frank.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Whatever.”\u003c/p\u003e\n\u003cp\u003e“Great, great. If you turn to your right and continue down that hall, you’ll find an elevator.”\u003c/p\u003e\n\u003cp\u003e“And then what will—”\u003c/p\u003e\n\u003cp\u003eThe monitor blinked off.\u003c/p\u003e\n\u003cp\u003eOne of the two guys behind me told me to hold still, and unlocked my cuffs and leg irons. He pointed, and through a speaker in his helmet said, “End of the hall.”\u003c/p\u003e\n\u003cp\u003eI said, “What about the girl?”\u003c/p\u003e\n\u003cp\u003e“Sir, move to the end of the hall.”\u003c/p\u003e\n\u003cp\u003e“There was a little girl in my room, named Anna. I don’t know if she snuck in and back out or what but she was in there right before you guys arrived.”\u003c/p\u003e\n\u003cp\u003eThe guy gave a glance to his partner. Uncertainty? The partner said, “Move to the elevator, or you’re going back to the room.”\u003c/p\u003e\n\u003cp\u003eI obeyed, my unsteady footsteps echoing in a dim hallway where the only illumination was dribbling out of a set of emergency lights to my left. Way down at the end was a barely lit elevator standing open.\u003c/p\u003e\n\u003cp\u003eHalfway down I turned and looked back for the two guards. Not there. Just lonely blackness beyond the pool of emergency light.\u003c/p\u003e\n\u003cp\u003eGoddamn did this seem like a long walk. My legs were weak and shaky—how long had I been strapped to that bed? What kind of drugs did they have me on? I felt my face and had no bandage there, just a little bump where the spider had bitten me. Where were John and Amy? What happened to the town? Had the world ended? Why did this hallway smell like shit?\u003c/p\u003e\n\u003cp\u003e“Walt.”\u003c/p\u003e\n\u003cp\u003eA whisper, behind me. I stopped, and held my breath. Had I actually heard it?\u003c/p\u003e\n\u003cp\u003eI continued, the elevator waiting right up ahead in the darkness, barely enough light inside to fill the tiny space.\u003c/p\u003e\n\u003cp\u003eI stopped again. I thought I could hear smaller, lighter footsteps trailing mine. Or maybe an echo.\u003c/p\u003e\n\u003cp\u003eI whispered, “Anna?”\u003c/p\u003e\n\u003cp\u003eNot sure any sound actually came out.\u003c/p\u003e\n\u003cp\u003eI turned and walked as fast as I could toward the open elevator, without breaking into what could be called a run. I made it inside, spun around and punched the button that said “1.” All the other buttons from there up had been covered with electrician’s tape.\u003c/p\u003e\n\u003cp\u003eNothing happened. I was standing under what seemed like a 25-watt bulb that was slightly brighter than a candle. Dead silence.\u003c/p\u003e\n\u003cp\u003eNo, wait. There was a faint sound. Not footsteps. A light scraping, then a brief pause, then the scrape again. The irregular rhythm of somebody trying to drag or carry an awkward load, or maybe just trying to walk with a severely wounded leg.\u003c/p\u003e\n\u003cp\u003eGetting louder. Closer. I could now make out a smacking, sticky sound, like a person loudly eating pasta right next to your ear.\u003c/p\u003e\n\u003cp\u003eI punched the “1” button again. I punched the “Close Door” button. I punched the “1” button again. Then I mashed the buttons under the electrical tape. All of them.\u003c/p\u003e\n\u003cp\u003e“Walt.”\u003c/p\u003e\n\u003cp\u003eThat wet sound, scraping toward me. I could hear it clearly now, not ten feet away. Moving faster.\u003c/p\u003e\n\u003cp\u003e“Walt. Walt. Walt.”\u003c/p\u003e\n\u003cp\u003eThe door closed.\u003c/p\u003e\n\u003cp\u003eIf they didn’t want the patients at the Undisclosed Ffirth Asylum command center slash patient processing facility to feel like prisoners, they were doing the world’s shittiest job. In the light I saw I was wearing a green prisoner jumpsuit. When the elevator arrived at the top, two more black-suited space men roughly dragged me out, put a black hood over my head, and threw me into the back of a military truck.\u003c/p\u003e\n\u003cp\u003eThe hospital was just a couple of blocks away, but the trip took twenty minutes. We drove, stopped, waited, drove, waited again, then an alarm went off and I heard an electric sound like a garage door opening. We rolled forward for five seconds, then the sound again, and the clicks of latches. Then there was another gate opening, followed by the opening of the doors of the truck. I felt sunlight and a blast of cold air hit my hood. I was dragged out and told to lay flat on the grass. I was told that if I raised any part of my body before commanded to, I would be shot.\u003c/p\u003e\n\u003cp\u003eHoly shit.\u003c/p\u003e\n\u003cp\u003eThey yanked off my hood. The truck left and I risked craning my neck enough to see a chain-link fence roll shut behind it. I turned the other way and saw that there was … another fence. I was in a gap the width of a city street, between two tall fences that were each topped with coils of Fuck-You razor wire. The inner fence, the one opposite the one the truck had just slipped out of, was opaque—they had attached tarps or some plastic sheets to it. The goal was clearly to make sure the separation between the hospital quarantine and the outside world was absolute. The plastic sheets were colorful and had printing all along them. The one nearest to me said 91.9 K-ROCK ROCKTOBER ROCKOCALYPSE.\u003c/p\u003e\n\u003cp\u003eI wondered how long they’d leave me laying like this, but soon a gate in the inner fence slid open and a voice from a PA system told me to go through. I obeyed, and entered quarantine, apparently for the second time.\u003c/p\u003e\n\u003cp\u003eI don’t know what I was expecting to find inside the gate, but it was just the hospital lawn. The building itself was immediately to my right, the front lawn of the hospital stretching off to my left. The sun hatefully spat daylight into my eyes—how long had it been since I’d seen the sun?—and I gathered it was probably midafternoon or so.\u003c/p\u003e\n\u003cp\u003eMy first thought was, “Ribs.” Meat smoke hit my nostrils, like being downwind from a barbecue joint. I heard voices. Somebody laughed.\u003c/p\u003e\n\u003cp\u003eHell, it’s a party.\u003c/p\u003e\n\u003cp\u003eWhat was stranger than that was what wasn’t there: men in space suits carrying guns. I assumed I would be roughly dragged in and told to go report to this tent or to submit to some tests or shit. But I was on my own. No soldiers. Nobody who looked official. No staff.\u003c/p\u003e\n\u003cp\u003eInstead, a smattering of tired-looking people in jumpsuits, some with hospital blankets wrapped around their shoulders, were staring at me like they were expecting someone else. When they saw it was me, they all shambled away without a word.\u003c/p\u003e\n\u003cp\u003eWell, screw you, too.\u003c/p\u003e\n\u003cp\u003eI spotted a pillar of smoke a hundred yards or so away, off near the fence that wrapped its way around the perimeter of the hospital grounds. A fence that did not exist the last time I was here, and that was covered entirely in garish ads that were each … wrong somehow, like they didn’t have a big enough tarp and covered it in rejected billboards somebody had laying around in a warehouse (SUBWAY: COME TASTE OUR NEW BEARD!). I wandered toward the fire, having absolutely no idea what else to do. It was the same strategy I employ at parties: find the food first. My lungs quivered at the contact with the chilled air. Not an unpleasant feeling. Kind of felt like freedom.\u003c/p\u003e\n\u003cp\u003e“Hey! Spider-Man! Spider-Man’s back!”\u003c/p\u003e\n\u003cp\u003eThe voice came from above me and I admit my first reaction was to glance around for the actual Spider-Man. Why not?\u003c/p\u003e\n\u003cp\u003eHe wasn’t here. I found the source of the voice, a black dude poking his head out of a fifth-floor window of the hospital. I had no idea if he was talking to me or somebody else, so I kept walking. I couldn’t help but notice the window he was yelling from was not open—the glass was busted out. That seemed weird to me.\u003c/p\u003e\n\u003cp\u003eI passed a fat lady in a dark green janitor’s jumpsuit like mine, sleeping under a blanket on what looked like a waiting room sofa that had been dragged out into the yard. The upholstery was discolored, like it had been rained on. I kicked an empty water bottle. It skidded and bounced off another one. Trash was everywhere. I noticed somebody had knocked over the Florence Nightingale statue, laying on its side like they had just toppled a dictator.\u003c/p\u003e\n\u003cp\u003eI shuffled toward the bonfire, a lot of people were congregating over there. Everybody wearing jumpsuits, either green like mine, or blood red.\u003c/p\u003e\n\u003cp\u003eTennet, tell me this is not a goddamned prison yard.\u003c/p\u003e\n\u003cp\u003eI passed the main entrance to the hospital. The sliding glass doors were propped open with two overflowing garbage cans. From the dim reception area inside it appeared the whole building was without power. Postapocalypse. How long has it been? A year? I wondered if the White House was trashed like this, the Lincoln Bedroom full of refugees. Or zombies.\u003c/p\u003e\n\u003cp\u003eI caught a whiff of that meat smell from the fire and my stomach growled. How long since I’d eaten? I felt slightly thinner, though that could have been due to the huge jumpsuit I was wearing. A clump of red jumpsuit guys were up ahead, talking and eating from bowls. I was going to ask them where the food table was but at the sight of me they all stopped talking, giving me a look like I was a cop and they were all hiding joints. Everybody had patchy beards. Greasy hair. Nobody shaving, nobody showering. On the ground were discarded plastic forks and paper plates tattooed with old grease stains and muddy shoe prints where they’d been stepped on a dozen times.\u003c/p\u003e\n\u003cp\u003eThe huddle of red suits on the opposite side of the bonfire also fell silent. The bonfire, by the way, was a crackling pile of smashed furniture, wooden pallets, at least one mattress and bundles of what looked like blackened sticks.\u003c/p\u003e\n\u003cp\u003eEverybody looking at me now. I scanned around for some fellow green jumpsuits but there was just one guy who looked about eighty years old and another middle-aged woman who looked like a schoolteacher. Her eyes showed no signs of even vague interest in this situation. The biggest of the reds, a guy with shoulder-length blond hair and more neck than head said, “We about to have a problem here?” He had the voice of a man with four testicles. His jumpsuit was zipped down to reveal an Iron Cross tattoo on his sternum. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2/page-31.html","bookId":2488,"creation":"Oct 5, 2019 10:41:47 PM","modification":"Oct 5, 2019 10:41:47 PM"}
