{"id":105009,"no":76,"title":"Page 76","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAmy squirmed out from under me, and goddamnit, she ran right out into the open again, and toward Molly.\u003c/p\u003e\n\u003cp\u003eShe kneeled down over her, crying, pressing her face to the dog’s.\u003c/p\u003e\n\u003cp\u003eI slowly stood, waving my arms at the soldiers, for all that good it had done Amy last time. Nearby I saw the shredded sleeve of one of the black space suits, and I grabbed it and waved it like a flag.\u003c/p\u003e\n\u003cp\u003eThey didn’t shoot.\u003c/p\u003e\n\u003cp\u003eI went over to Amy and Molly. The dog wasn’t whimpering or howling, thank God, because I don’t think either of us could have handled that. She was silent, her eyes closed, still. She never even felt it.\u003c/p\u003e\n\u003cp\u003eMolly had moved when the rest of the world was still, she had been able to navigate the paused world just like John and I had, and I doubted I would ever know how, beyond the fact that there were a lot of things about this animal that I didn’t understand. When things had stopped, she ran, from wherever she was, and she ran as fast as her paws could take her, knowing where she needed to be and what she needed to do. And what she needed to do was to steal my goddamned hero moment.\u003c/p\u003e\n\u003cp\u003eWe kneeled there in the cold, and finally somebody called out to us. It was a soldier, who I had a feeling was doing it against orders. He had emerged from a hatch at the top of one of the vehicles, and was yelling something at us. I couldn’t hear what he was saying, so I just showed him my empty hands and said, “We’re not armed.”\u003c/p\u003e\n\u003cp\u003eIf somehow the crying girl at my feet and I still looked like zombies, then John convinced him otherwise since he was performing the distinctly human—and distinctly non-zombie—activity of filming everything with a cell phone.\u003c/p\u003e\n\u003cp\u003eThe soldier climbed out of his vehicle and jumped down, then crossed the barricades.\u003c/p\u003e\n\u003cp\u003eSee, that’s how you get eaten in a zombie movie, kid.\u003c/p\u003e\n\u003cp\u003eI heard cars approach from the highway behind us, refugees from Undisclosed who had presumably been huddled down in the Dead Zone behind us, hearing World War III erupting up ahead. But now they came, in their pickup trucks and dirt bikes and ATVs, driving with an adherence to posted traffic laws that zombies so rarely display.\u003c/p\u003e\n\u003cp\u003eNo one on the other side of the barricades panicked and opened fire. The spell had been broken. Amy was whispering to Molly, stroking her fur. I was standing over Amy, my hand on her shoulder, looking down at them. Boots appeared on the road next to me and my eyes tracked up past gray camo pants and black knee pads. A wicked-looking assault rifle was pointed at the ground, a gloved hand on the grip, the finger resting outside the trigger guard.\u003c/p\u003e\n\u003cp\u003eThe soldier said, “Sir! Please identify yourself.”\u003c/p\u003e\n\u003cp\u003e“My name is David Wong. I am not a zombie or infected with any kind of disease that creates zombie-like symptoms or whatever other bullshit you were told by your commanding officers.”\u003c/p\u003e\n\u003cp\u003eThe soldier gestured toward the approaching vehicles and said, “You’ve escaped the city? Are there other uninfected back there?”\u003c/p\u003e\n\u003cp\u003eI thought for a moment, studying Amy’s face. I swallowed and said, “As far as I know, everybody in town is uninfected. The effects of this outbreak have been grossly exaggerated.”\u003c/p\u003e\n\u003cp\u003e“STOP FILMING, SIR! SIR!”\u003c/p\u003e\n\u003cp\u003eJohn obeyed, stuffing the phone in his pocket. He said, “You can confiscate the phone if you want. A copy of the video is currently hosted on my Web site. And you can try to get that taken down I guess, but it’s on a server based in the Ukraine. So good luck with that.”\u003c/p\u003e\n\u003cp\u003eOther soldiers were approaching cautiously from behind the first guy, and in a zombie movie this is when Molly would spring back to life and bite one of them, and then everything would go to hell. But this was not a zombie movie, Molly stayed where she was, her blood turning cold on the pavement.\u003c/p\u003e\n\u003cp\u003eThe cold rain started again. John took off his jacket and laid it over Molly, so she wouldn’t lay there and get soaked. It was for Amy’s benefit, I knew.\u003c/p\u003e\n\u003cp\u003eOne of the soldiers behind the first guy, a medic apparently, said, “Is anyone in need of medical attention?”\u003c/p\u003e\n\u003cp\u003eJohn said, “No. We’re fine.”\u003c/p\u003e\n\u003cp\u003eThen a furious voice emerged from the ditch to my left, saying, “UH, HELLO? I’ve got three bullet wounds down here and I’m laying in fucking freezing water. Somebody?”\u003c/p\u003e\n\u003cp\u003eWe didn’t realize at the time that we would have to basically ban ourselves from watching television in the aftermath. The video clip of the small, wet, redheaded girl weeping over her shot dog would be downloaded 18 million times from YouTube alone in the next month. It would air on CNN, Fox News, the BBC, Al Jazeera, all three broadcast networks and everywhere else. Amy couldn’t stand to watch it, and for a long time, it was everywhere.\u003c/p\u003e\n\u003cp\u003eIf it had been me laying there, nobody would have given a shit. A big, chubby guy in a green prison jumpsuit and a weird reputation? The factions who were still calling for blood afterward, who talked of undetectable infection and for internment—if not extermination—of the town, would maybe have still won out. Same if it had been John, or Falconer, or Owen. They could have dug up dirt on us, claimed the corpse was infected, claimed we had killed a dozen orphans just prior to taking the bullet. We’d have just been one more body in the street.\u003c/p\u003e\n\u003cp\u003eBut no one could argue against a dog.\u003c/p\u003e\n\u003cp\u003eThe loyal dog, sacrificing itself to save its owner, laying there bleeding in the rain. Then add in the tiny girl kneeling over her—the dog’s owner that the bullet had been meant for—who couldn’t have appeared more harmless if she’d been made of kittens. The image doused the world’s bloodlust like a bucket of ice water. A perfect, undeniable symbol for the price the innocent pay for unchecked paranoia.\u003c/p\u003e\n\u003cp\u003eEulogy\u003c/p\u003e\n\u003cp\u003eJohn wrapped up Molly in his jacket and laid her in the backseat of the pickup Tennet had driven out to this spot. A crowd was forming, and vehicles were now lined up bumper to bumper down the highway, an echo of the scene from the day of the outbreak. We were heading the other direction, though, back into town. In the distance, the column of smoke from the asylum inferno drifted into the sky. We passed one house where a guy was unloading suitcases from his trunk and glancing around in confusion, like he had just come back from a two-week vacation and was wondering what the fuck happened while he was gone.\u003c/p\u003e\n\u003cp\u003eWe drove to my house, or the charred remnants of my house, anyway. Amy was pretty upset at the sight of it but John pointed out that we had in fact burned the place down ourselves.\u003c/p\u003e\n\u003cp\u003eI was exhausted down to my bones, but there was this last piece of business to take care of and no way to put it off. I grabbed the shovel laying in my yard and John and I took turns digging a grave for Molly, rain pelting our shoulders. The temperature dropped into the forties but Amy stood out in it the whole time, watching us, shivering.\u003c/p\u003e\n\u003cp\u003eI laid Molly in the ground and John volunteered to say the eulogy:\u003c/p\u003e\n\u003cp\u003e“This here is Molly. She was a good dog. And when I say ‘good dog’ I don’t mean it the way other people mean it, when they’re talking about a dog that never shit on the floor or bit their kids. No, I’m talking about a dog that died saving Amy’s life. By my rough count, that’s half a dozen times Molly saved one of our lives. How many dogs can say that? Hell, how many people can say that? One time, Dave was in a burning building, and Molly here rescued him by getting behind the wheel of his car and driving through the wall. You know that couldn’t have been easy for her.\u003c/p\u003e\n\u003cp\u003e“Anyhow, Molly died in the way that all really good things die, fast and brutal and for no apparent reason. They say that even though it often appears that God just really, really doesn’t give a shit about what happens down here, that that’s just an illusion and He really does care after all, and it’s all part of His great plan to make it appear that He doesn’t care. Though what purpose that serves I can’t possibly imagine. I think God probably just wanted Molly for Himself, and I guess I can’t blame Him.\u003c/p\u003e\n\u003cp\u003e“Well, God, here’s your dog back, I guess. We hereby commit Molly to doggy heaven, which is probably nicer than regular heaven, if you think about it. Amen.”\u003c/p\u003e\n\u003cp\u003eAmy and I said, “Amen” and I noticed she was crying again and felt utterly helpless to stop it. She buried her face in my chest and I stroked her tangled, wet mess of red hair.\u003c/p\u003e\n\u003cp\u003eI said, “Let’s find a roof.”\u003c/p\u003e\n\u003cp\u003eShe said, “Let’s find a bed.”\u003c/p\u003e\n\u003cp\u003eWe walked away from the ruins of my former house and John said, “Wait, what if Tennet arranged all of this as some elaborate form of therapy?”\u003c/p\u003e\n\u003cp\u003eEPILOGUE\u003c/p\u003e\n\u003cp\u003eIt was December 22nd, or Christmas Eve Eve Eve as John so irritatingly called it. I was alone, staring out of the kitchen window of a cheap, mostly empty mobile home supplied by the Federal Emergency Management Agency. There was a single Christmas card on the counter next to me, laying on top of its mutilated envelope.\u003c/p\u003e\n\u003cp\u003eThe trailer had come with furniture, but the sofa smelled so bad we had dragged it out into the yard. I think the trailer had previously seen service in New Orleans after the hurricane and I think it got moldy. In the corner of the living room was our Christmas tree, a two-foot-tall plastic tree with huge googly eyes and a mechanical mouth. John had found it in a thrift store, it had a voice box on the bottom and I think originally it was supposed to do a humorous Christmas rap when somebody walked by. When we put batteries in it, the mouth locked in the wide-open position and it uttered a high-pitched, electronic scream of garbled feedback until we pried the batteries out again.\u003c/p\u003e\n\u003cp\u003eUnder the tree sat John’s gift, a wrapped object that was perfectly the shape of a crossbow.\u003c/p\u003e\n\u003cp\u003eI had a feeling it would take me years to piece together the whirlwind of lies that had obscured the incident the news media had finally decided to call the “Zulu Outbreak.” The consensus seemed to be that fewer than 70 people were ever actually infected with the pathogen, which they decided was some kind of rare form of bovine spongiform encephalopathy, caused by the consumption of some kind of mutated protein from contaminated sausages. So the final death toll was, according to the final CDC reports, 68 dead from Zulu, 406 dead from the violence resulting from mass hysteria.\u003c/p\u003e\n\u003cp\u003ePlenty of people from in town came forward to dispute those reports. And plenty of other people came forward to dispute those reports. A hundred different versions came out and so the public just defaulted to what the guys in suits told them. In the end, They didn’t need to cover up anything—They just drowned it out in a blizzard of conflicting stories. The world eventually gives up and moves on. Like the whole thing with the envelopes of anthrax after 9/11. \u003c/p\u003e","sourceLink":"https://allnovel.net/this-book-is-full-of-spiders-john-dies-at-the-end-2/page-76.html","bookId":2488,"creation":"Oct 5, 2019 10:41:47 PM","modification":"Oct 5, 2019 10:41:47 PM"}
