{"id":100892,"no":3,"title":"Page 3","content":"\u003cp\u003eBut still, the sight of those abs, the ink that covered them and the twin hoops through his nipples turned all my good intentions and strictly marshaled thoughts to all things sexy and naughty, where they clearly didn’t need to be. When I looked at him I had a hard time remembering the rejection and what I should be doing and instead let his wicked grin ruin all my self-control.\u003c/p\u003e\n\u003cp\u003eI averted my gaze and ordered myself not to inhale when he leaned over me to snag the other half of my untouched bagel. I wasn’t allowed to go around sniffing him, even if he smelled like temptation and rock and roll.\u003c/p\u003e\n\u003cp\u003eHe lifted a dark eyebrow in my direction and motioned toward Cora with the bagel.\u003c/p\u003e\n\u003cp\u003e“What kind of havoc are you two wreaking in here? I heard the front door slam all the way from the back of the house.” He stretched his long legs, clad in supertight black jeans, out in front of me and I wondered again how he got into them. I had never seen a guy wear such tight pants, but they worked for him. I spent an obscene amount of time wondering how to get them off of him.\u003c/p\u003e\n\u003cp\u003e“Cora was just wishing your latest conquest a safe trip home.”\u003c/p\u003e\n\u003cp\u003eHe paused before biting into the bagel and focused his eyes at the back of Cora’s head. “What did you really say to her?”\u003c/p\u003e\n\u003cp\u003eWe could see Cora’s shoulders shaking with silent laughter, but she didn’t turn her head around. “Nothing. Well, nothing that wasn’t true.”\u003c/p\u003e\n\u003cp\u003eHe took a big bite out of the breakfast treat and narrowed his eyes. They were so dark it was hard to tell where the iris and the pupil met.\u003c/p\u003e\n\u003cp\u003e“I think you’re just pissed Miley Cyrus copied your haircut and you’re taking it out on innocent girls across the land.”\u003c/p\u003e\n\u003cp\u003eSurprised laughter shot out of me as Cora jumped to her feet and hurled the nail polish bottle she had been using at Jet’s head. Luckily, he had good reflexes and caught it in the air before it smacked him in the face or broke all over the wood floors.\u003c/p\u003e\n\u003cp\u003e“I’ve had this hair forever! It’s not my fault she decided to be rock and roll all of a sudden.” She huffed out of the room and I shared a grin with Jet.\u003c/p\u003e\n\u003cp\u003e“She’s sensitive about that. Be nice.”\u003c/p\u003e\n\u003cp\u003e“It’s not nice that you two have a sliding scale for every girl I bring home, either, but you don’t hear me complaining, do you?”\u003c/p\u003e\n\u003cp\u003eI didn’t have an answer for that so I turned back to my computer screen.\u003c/p\u003e\n\u003cp\u003e“One of these days there’s going to be a ten and you’re not going to know what to do with yourselves.”\u003c/p\u003e\n\u003cp\u003eI was surprised he was aware of what we were doing. That didn’t speak too highly of his respect for the girls he brought home with him on a regular basis.\u003c/p\u003e\n\u003cp\u003eI tucked the ends of my hair, which was now styled in a short, sleek bob, behind one ear and looked at him over the top of my glasses. I wasn’t sure how I felt about it now that I knew he was in on the game.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you say something, if you knew what we were doing? ”\u003c/p\u003e\n\u003cp\u003eHe lifted a shoulder in a shrug and I watched as his mouth turned down in a frown on one side. Jet had an expressive face. I think it came from trying to project his every feeling, his every passion, to a crowd of people while he was onstage. I knew the half frown well—it meant he was thinking about something he didn’t particularly want to talk about. I always wondered what put it there.\u003c/p\u003e\n\u003cp\u003e“They get what they come for and then they go home satisfied. If they have to tangle with you two knuckleheads on the way out, I just figure that is part of the price of admission.” He cut his look back up to me and frowned for real. “Where were you last night? Everyone came to Cerberus and hung out for a few hours. Shaw said you were supposed to meet us there, but you never showed.”\u003c/p\u003e\n\u003cp\u003eI cleared my throat and fiddled with the handle on my coffee mug. “I was on a date with Adam. He didn’t want to go, so I just had him drop me off here and I did some homework I’ve been putting off.”\u003c/p\u003e\n\u003cp\u003eI saw his eyes widen and the gold rings flashed bright and clear. Jet wasn’t a fan of Adam, and Adam hated that I lived with Jet with every fiber of his being. I tried to keep the two of them apart, a task that was getting harder and harder now that Adam was pushing for us to be more than casual dating partners. We had been seeing each other for about four months, and logically I knew it was time to move one way or the other, but something always stopped me.\u003c/p\u003e\n\u003cp\u003e“Of course Adam didn’t want to go. When does that dude ever do anything you want to do? Geez, Ayd, how many freaking operas, ballets, and boring-ass art exhibits are you going to let that moron drag you to? Why can’t he just come and meet your friends and chill at the bar for a minute?”\u003c/p\u003e\n\u003cp\u003eWe’d had this conversation more than once, so I just sighed.\u003c/p\u003e\n\u003cp\u003e“My friends intimidate him. Rule and Nash don’t exactly scream ‘welcoming committee’ and you and Rowdy take way too much pleasure in making fun of anyone and everyone that you don’t like. It would be awkward for all of us, so I would rather avoid it altogether. Adam is a nice guy.”\u003c/p\u003e\n\u003cp\u003eI told myself that at least ten times a day. Adam was a nice guy and he was far more suited to a secure future than a guy who planned to play heavy metal for a living. Not to mention Adam didn’t make we want to lose control and throw caution to the wind at every turn, not the way Jet did.\u003c/p\u003e\n\u003cp\u003e“We’re your friends, Ayden, and Shaw is your girl. If this guy plans on sticking around, don’t you think he needs to suck it up and get used to all of us? Or are you planning on just ditching us for the upper crust as soon as you can?”\u003c/p\u003e\n\u003cp\u003eThere was something in his tone that spoke to a deeper conversation than the one we were currently having. But as usual, before I could probe further, he decided to change the subject to something he obviously deemed safer.\u003c/p\u003e\n\u003cp\u003e“Besides, if he didn’t want Rowdy and me to clown on him, he wouldn’t wear a damn sweater vest everywhere he goes. Who even owns a sweater vest anymore?”\u003c/p\u003e\n\u003cp\u003eI kicked him lightly under the table. “Be nice. Sweater vests aren’t that bad.”\u003c/p\u003e\n\u003cp\u003eHe made a face and climbed to his feet. I tried not to drool when he stretched his arms above his messy hair and the hem of his T-shirt rode up over the edge of his pants. It would take torture to get me to admit it, but my main goal in life was to see how far down that damn angel tattoo went, and to trace the entire thing with my tongue.\u003c/p\u003e\n\u003cp\u003eI cleared my throat to try to get my head out of the gutter, and noticed he was watching me closely.\u003c/p\u003e\n\u003cp\u003e“That’s the whole point; you don’t see anything wrong with dating a dude who thinks a sweater vest is badass, and I don’t see anything wrong with picking up a chick who gets ranked by my shithead roommates the morning after. Two different worlds, Ayd, two totally different worlds.”\u003c/p\u003e\n\u003cp\u003eHe ruffled my hair, getting several of the longer strands stuck in his rings as he walked away. I watched him solemnly until he disappeared in his room, before releasing the breath I had been holding. It took a minute for me to unclench my fingers from the coffee mug.\u003c/p\u003e\n\u003cp\u003eJet had no idea what I was really like under all the polish and primer I had slapped on before moving to Colorado with nothing but the clothes on my back. No one really did. I had talked to Shaw about it briefly and vaguely, but even my bestie had no clue about the kind of life I had lived before starting college three years ago.\u003c/p\u003e\n\u003cp\u003eI was only twenty-two, but felt like I had lived a hundred lifetimes in this short amount of time. The good girl, the girl who Jet saw as so untouchable and so different from him, was all an illusion I fought on a daily basis to maintain. Having him so close and so present put my desire to leave the old Ayden buried in the rolling hills of Kentucky to the test, every minute of every day.\u003c/p\u003e\n\u003cp\u003e“Hey!” I sputtered indignantly as a dish towel suddenly slapped across my face. Cora plopped down in the chair Jet had just vacated and gave me a knowing look.\u003c/p\u003e\n\u003cp\u003e“I thought you might want that for the slobber on your chin.”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes at her. “Knock it off.”\u003c/p\u003e\n\u003cp\u003e“Whatever. Every time, Ayd—it’s like you’re in heat or something. I don’t know how you guys ignore all the snap, crackle, and pop that happens whenever you get within breathing distance of each other, but I’m telling you it’s exhausting to watch.”\u003c/p\u003e\n\u003cp\u003eI opened my mouth to tell her, in no uncertain terms, that we were not attracted to each other, but she held up a hand and lasered a pointed glare at me before I got one word out.\u003c/p\u003e\n\u003cp\u003e“And don’t give me that bull about just being friends. I have guy friends. In fact, I have more guy friends than I do girlfriends and I do not look at a single one of them like I want to have hair-pulling, bite mark–leaving, bed-breaking sex with them. When you look at him when he’s not paying attention, Ayd”—she made a big production of fanning herself down with the towel she reclaimed—“I feel like I need a cold shower.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say to that so, I stuck with what I knew.\u003c/p\u003e\n\u003cp\u003e“We’re friends. We aren’t each other’s type and I told you what happened the one single time I let alcohol try to convince me otherwise.”\u003c/p\u003e\n\u003cp\u003eShe leaned back in the chair and regarded me with her crazy eyes. The dark brown one was all censure and knowing regard, and the turquoise one was all good-humored mirth and friendly compassion. It was hard to pull anything over on Cora, but that didn’t mean I ever stopped trying. In order to build the life I wanted, the life I so desperately craved, I had to convince everyone that it was what I had deserved all along. Who I was before wasn’t allowed to be a factor in who I was now, and no matter how hot Jet was or how much he made me want to wander off the path of good intentions, I just couldn’t allow it.\u003c/p\u003e\n\u003cp\u003e“Besides, we fundamentally want different things out of life. Once I graduate I’m going right into a master’s program. Jet has been playing at being a rock star since he was a teenager. I can’t understand not having the ambition to want something more than that, to want a secure future. We want different things all the way around.” Not to mention the way he made me want to forget everything I already knew about the dangers of the wild side totally freaked me out.\u003c/p\u003e\n\u003cp\u003eShe shook her head looking like a judgmental version of Tinker Bell. It was hard to fathom so much attitude packed in such a little frame.\u003c/p\u003e\n\u003cp\u003e“I’m going to be honest with you, babe. From the outside looking in, you and that boy want exactly the same things, only you’re both too scared of something to admit it. And FYI, nobody, and I mean nobody, looks good in a sweater vest, so you should just stop trying to sell that poor Adam guy as boyfriend material.” She climbed to her feet and gripped the back of the chair, and in typical Cora fashion switched gears while I was trying to process the last bit of insight she had dropped on me. “So you never gave me your ranking for the groupie of the day, what do you think?”\u003c/p\u003e\n\u003cp\u003eIt bugged me every time a girl came stumbling out of that room, but I refused to acknowledge it, so I held up nine fingers and played along just like I was supposed to.\u003c/p\u003e\n\u003cp\u003e“She had a seven thanks to the missing bra and inside-out shirt, but after calling you a bitch and stuffing her underwear in her back pocket, she moved up.”\u003c/p\u003e\n\u003cp\u003eCora burst into boisterous laughter and grabbed her sides. She was cackling so loud I was worried all the noise was going to bring Jet back out of his room. \u003c/p\u003e","sourceLink":"https://allnovel.net/jet-marked-men-2/page-3.html","bookId":2730,"creation":"Oct 5, 2019 9:50:26 PM","modification":"Oct 5, 2019 9:50:26 PM"}
