{"id":7360,"no":8,"title":"Chapter 8","content":"8:1 [hgb]\u0026nbsp; 耶 和 华 晓 谕 摩 西 说 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD spake unto Moses, saying, \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the Lord said to Moses, \n\u003cbr\u003e8:2 [hgb]\u0026nbsp; 你 将 亚 伦 和 他 儿 子 一 同 带 来 ， 并 将 圣 衣 ， 膏 油 ， 与 赎 罪 祭 的 一 只 公 牛 ， 两 只 公 绵 羊 ， 一 筐 无 酵 饼 都 带 来 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Take Aaron and his sons with him, and the garments, and the anointing oil, and a bullock for the sin offering, and two rams, and a basket of unleavened bread; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Take Aaron, and his sons with him, and the robes and the holy oil and the ox of the sin-offering and the two male sheep and the basket of unleavened bread; \n\u003cbr\u003e8:3 [hgb]\u0026nbsp; 又 招 聚 会 众 到 会 幕 门 口 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And gather thou all the congregation together unto the door of the tabernacle of the congregation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And let all the people come together at the door of the Tent of meeting. \n\u003cbr\u003e8:4 [hgb]\u0026nbsp; 摩 西 就 照 耶 和 华 所 吩 咐 的 行 了 ， 于 是 会 众 聚 集 在 会 幕 门 口 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses did as the LORD commanded him; and the assembly was gathered together unto the door of the tabernacle of the congregation. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses did as the Lord said, and all the people came together at the door of the Tent of meeting. \n\u003cbr\u003e8:5 [hgb]\u0026nbsp; 摩 西 告 诉 会 众 说 ， 这 就 是 耶 和 华 所 吩 咐 当 行 的 事 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses said unto the congregation, This is the thing which the LORD commanded to be done. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses said to the people, This is what the Lord has given orders to be done. \n\u003cbr\u003e8:6 [hgb]\u0026nbsp; 摩 西 带 了 亚 伦 和 他 儿 子 来 ， 用 水 洗 了 他 们 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses brought Aaron and his sons, and washed them with water. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then Moses took Aaron and his sons; and after washing them with water, \n\u003cbr\u003e8:7 [hgb]\u0026nbsp; 给 亚 伦 穿 上 内 袍 ， 束 上 腰 带 ， 穿 上 外 袍 ， 又 加 上 以 弗 得 ， 用 其 上 巧 工 织 的 带 子 把 以 弗 得 系 在 他 身 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he put upon him the coat, and girded him with the girdle, and clothed him with the robe, and put the ephod upon him, and he girded him with the curious girdle of the ephod, and bound it unto him therewith. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He put the coat on him, making it tight with its band, and then the robe, and over it the ephod, with its band of needlework to keep it in place. \n\u003cbr\u003e8:8 [hgb]\u0026nbsp; 又 给 他 戴 上 胸 牌 ， 把 乌 陵 和 土 明 放 在 胸 牌 内 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he put the breastplate upon him: also he put in the breastplate the Urim and the Thummim. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put the priest\u0027s bag on him, and in the bag he put the Urim and Thummim. \n\u003cbr\u003e8:9 [hgb]\u0026nbsp; 把 冠 冕 戴 在 他 头 上 ， 在 冠 冕 的 前 面 钉 上 金 牌 ， 就 是 圣 冠 ， 都 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he put the mitre upon his head; also upon the mitre, even upon his forefront, did he put the golden plate, the holy crown; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And on his head he put the head-dress, and in front of the head-dress the plate of gold, the holy crown, as the Lord gave orders to Moses. \n\u003cbr\u003e8:10 [hgb]\u0026nbsp; 摩 西 用 膏 油 抹 帐 幕 和 其 中 所 有 的 ， 使 它 成 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses took the anointing oil, and anointed the tabernacle and all that was therein, and sanctified them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses took the holy oil and put it on the House and on all the things in it, to make them holy. \n\u003cbr\u003e8:11 [hgb]\u0026nbsp; 又 用 膏 油 在 坛 上 弹 了 七 次 ， 又 抹 了 坛 和 坛 的 一 切 器 皿 ， 并 洗 濯 盆 和 盆 座 ， 使 它 成 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he sprinkled thereof upon the altar seven times, and anointed the altar and all his vessels, both the laver and his foot, to sanctify them. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Seven times he put oil on the altar and on all its vessels, and on the washing-basin and its base, to make them holy. \n\u003cbr\u003e8:12 [hgb]\u0026nbsp; 又 把 膏 油 倒 在 亚 伦 的 头 上 膏 他 ， 使 他 成 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he poured of the anointing oil upon Aaron\u0027s head, and anointed him, to sanctify him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And some of the oil he put on Aaron\u0027s head, to make him holy. \n\u003cbr\u003e8:13 [hgb]\u0026nbsp; 摩 西 带 了 亚 伦 的 儿 子 来 ， 给 他 们 穿 上 内 袍 ， 束 上 腰 带 ， 包 上 裹 头 巾 ， 都 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses brought Aaron\u0027s sons, and put coats upon them, and girded them with girdles, and put bonnets upon them; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then he took Aaron\u0027s sons, clothing them with the coats, and putting the bands round them, and the head-dresses on their heads, as the Lord had given him orders. \n\u003cbr\u003e8:14 [hgb]\u0026nbsp; 他 牵 了 赎 罪 祭 的 公 牛 来 ， 亚 伦 和 他 儿 子 按 手 在 赎 罪 祭 公 牛 的 头 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he brought the bullock for the sin offering: and Aaron and his sons laid their hands upon the head of the bullock for the sin offering. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he took the ox of the sin-offering: and Aaron and his sons put their hands on the head of the ox, \n\u003cbr\u003e8:15 [hgb]\u0026nbsp; 就 宰 了 公 牛 。 摩 西 用 指 头 蘸 血 ， 抹 在 坛 上 四 角 的 周 围 ， 使 坛 洁 净 ， 把 血 倒 在 坛 的 脚 那 里 ， 使 坛 成 圣 ， 坛 就 洁 净 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he slew it; and Moses took the blood, and put it upon the horns of the altar round about with his finger, and purified the altar, and poured the blood at the bottom of the altar, and sanctified it, to make reconciliation upon it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put it to death; and Moses took the blood and put it on the horns of the altar and round it with his finger, and made the altar clean, draining out the blood at the base of the altar; so he made it holy, taking away what was unclean. \n\u003cbr\u003e8:16 [hgb]\u0026nbsp; 又 取 脏 上 所 有 的 脂 油 和 肝 上 的 网 子 ， 并 两 个 腰 子 与 腰 子 上 的 脂 油 ， 都 烧 在 坛 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he took all the fat that was upon the inwards, and the caul above the liver, and the two kidneys, and their fat, and Moses burned it upon the altar. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he took all the fat on the inside parts, and the fat on the liver, and the two kidneys with their fat, to be burned on the altar; \n\u003cbr\u003e8:17 [hgb]\u0026nbsp; 惟 有 公 牛 ， 连 皮 带 肉 并 粪 ， 用 火 烧 在 营 外 ， 都 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But the bullock, and his hide, his flesh, and his dung, he burnt with fire without the camp; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But the ox, with its skin and its flesh and its waste, was burned with fire outside the tent-circle, as the Lord gave orders to Moses. \n\u003cbr\u003e8:18 [hgb]\u0026nbsp; 他 奉 上 燔 祭 的 公 绵 羊 ， 亚 伦 和 他 儿 子 按 手 在 羊 的 头 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he brought the ram for the burnt offering: and Aaron and his sons laid their hands upon the head of the ram. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put the male sheep of the burned offering before the Lord, and Aaron and his sons put their hands on its head, \n\u003cbr\u003e8:19 [hgb]\u0026nbsp; 就 宰 了 公 羊 。 摩 西 把 血 洒 在 坛 的 周 围 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he killed it; and Moses sprinkled the blood upon the altar round about. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put it to death; and Moses put some of the blood on and round the altar. \n\u003cbr\u003e8:20 [hgb]\u0026nbsp; 把 羊 切 成 块 子 ， 把 头 和 肉 块 并 脂 油 都 烧 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he cut the ram into pieces; and Moses burnt the head, and the pieces, and the fat. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And when the sheep had been cut into parts, the head and the parts and the fat were burned by Moses. \n\u003cbr\u003e8:21 [hgb]\u0026nbsp; 用 水 洗 了 脏 腑 和 腿 ， 就 把 全 羊 烧 在 坛 上 为 馨 香 的 燔 祭 ， 是 献 给 耶 和 华 的 火 祭 ， 都 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he washed the inwards and the legs in water; and Moses burnt the whole ram upon the altar: it was a burnt sacrifice for a sweet savour, and an offering made by fire unto the LORD; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And the inside parts and the legs were washed with water and all the sheep was burned by Moses on the altar; it was a burned offering for a sweet smell: it was an offering made by fire to the Lord, as the Lord gave orders to Moses. \n\u003cbr\u003e8:22 [hgb]\u0026nbsp; 他 又 奉 上 第 二 只 公 绵 羊 ， 就 是 承 接 圣 职 之 礼 的 羊 ， 亚 伦 和 他 儿 子 按 手 在 羊 的 头 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he brought the other ram, the ram of consecration: and Aaron and his sons laid their hands upon the head of the ram. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put the other sheep before the Lord, the sheep with which they were made priests; and Aaron and his sons put their hands on the head of the sheep, \n\u003cbr\u003e8:23 [hgb]\u0026nbsp; 就 宰 了 羊 。 摩 西 把 些 血 抹 在 亚 伦 的 右 耳 垂 上 和 右 手 的 大 拇 指 上 ， 并 右 脚 的 大 拇 指 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he slew it; and Moses took of the blood of it, and put it upon the tip of Aaron\u0027s right ear, and upon the thumb of his right hand, and upon the great toe of his right foot. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put it to death; and Moses took some of the blood and put it on the point of Aaron\u0027s right ear and on the thumb of his right hand and on the great toe of his right foot. \n\u003cbr\u003e8:24 [hgb]\u0026nbsp; 又 带 了 亚 伦 的 儿 子 来 ， 把 些 血 抹 在 他 们 的 右 耳 垂 上 和 右 手 的 大 拇 指 上 ， 并 右 脚 的 大 拇 指 上 ， 又 把 血 洒 在 坛 的 周 围 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he brought Aaron\u0027s sons, and Moses put of the blood upon the tip of their right ear, and upon the thumbs of their right hands, and upon the great toes of their right feet: and Moses sprinkled the blood upon the altar round about. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Then he took Aaron\u0027s sons, and Moses put some of the blood on the point of their right ears and on the thumbs of their right hands and on the great toes of their right feet: and Moses put the blood on and round the altar. \n\u003cbr\u003e8:25 [hgb]\u0026nbsp; 取 脂 油 和 肥 尾 巴 ， 并 脏 上 一 切 的 脂 油 与 肝 上 的 网 子 ， 两 个 腰 子 和 腰 子 上 的 脂 油 ， 并 右 腿 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he took the fat, and the rump, and all the fat that was upon the inwards, and the caul above the liver, and the two kidneys, and their fat, and the right shoulder: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he took the fat, and the fat tail, and the fat on the inside parts, and the fat on the liver, and the two kidneys with their fat, and the right leg; \n\u003cbr\u003e8:26 [hgb]\u0026nbsp; 再 从 耶 和 华 面 前 ， 盛 无 酵 饼 的 筐 子 里 取 出 一 个 无 酵 饼 ， 一 个 油 饼 ， 一 个 薄 饼 ， 都 放 在 脂 油 和 右 腿 上 ，\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And out of the basket of unleavened bread, that was before the LORD, he took one unleavened cake, and a cake of oiled bread, and one wafer, and put them on the fat, and upon the right shoulder: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And out of the basket of unleavened bread which was before the Lord he took one unleavened cake, and one cake of bread with oil on it, and one thin cake, and put them on the fat and on the right leg: \n\u003cbr\u003e8:27 [hgb]\u0026nbsp; 把 这 一 切 放 在 亚 伦 的 手 上 和 他 儿 子 的 手 上 作 摇 祭 ， 在 耶 和 华 面 前 摇 一 摇 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And he put all upon Aaron\u0027s hands, and upon his sons\u0027 hands, and waved them for a wave offering before the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And he put them all on the hands of Aaron and on the hands of his sons, waving them for a wave offering before the Lord. \n\u003cbr\u003e8:28 [hgb]\u0026nbsp; 摩 西 从 他 们 的 手 上 拿 下 来 ， 烧 在 坛 上 的 燔 祭 上 ， 都 是 为 承 接 圣 职 献 给 耶 和 华 馨 香 的 火 祭 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses took them from off their hands, and burnt them on the altar upon the burnt offering: they were consecrations for a sweet savour: it is an offering made by fire unto the LORD. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses took them from their hands, and they were burned on the altar on the burned offering, as a priest\u0027s offering for a sweet smell, an offering made by fire to the Lord. \n\u003cbr\u003e8:29 [hgb]\u0026nbsp; 摩 西 拿 羊 的 胸 作 为 摇 祭 ， 在 耶 和 华 面 前 摇 一 摇 ， 是 承 接 圣 职 之 礼 ， 归 摩 西 的 分 ， 都 是 照 耶 和 华 所 吩 咐 摩 西 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses took the breast, and waved it for a wave offering before the LORD: for of the ram of consecration it was Moses\u0027 part; as the LORD commanded Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses took the breast, waving it for a wave offering before the Lord; it was Moses\u0027 part of the sheep of the priest\u0027s offering, as the Lord gave orders to Moses. \n\u003cbr\u003e8:30 [hgb]\u0026nbsp; 摩 西 取 点 膏 油 和 坛 上 的 血 ， 弹 在 亚 伦 和 他 的 衣 服 上 ， 并 他 儿 子 和 他 儿 子 的 衣 服 上 ， 使 他 和 他 们 的 衣 服 一 同 成 圣 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses took of the anointing oil, and of the blood which was upon the altar, and sprinkled it upon Aaron, and upon his garments, and upon his sons, and upon his sons\u0027 garments with him; and sanctified Aaron, and his garments, and his sons, and his sons\u0027 garments with him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses took some of the holy oil and of the blood which was on the altar and put it on Aaron and on his robes, and on his sons and on his sons\u0027 robes; and made Aaron holy, and his robes and his sons and his sons\u0027 robes with him. \n\u003cbr\u003e8:31 [hgb]\u0026nbsp; 摩 西 对 亚 伦 和 他 儿 子 说 ， 把 肉 煮 在 会 幕 门 口 ， 在 那 里 吃 ， 又 吃 承 接 圣 职 筐 子 里 的 饼 ， 按 我 所 吩 咐 的 说 （ 或 作 按 所 吩 咐 我 的 说 ） ， 这 是 亚 伦 和 他 儿 子 要 吃 的 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And Moses said unto Aaron and to his sons, Boil the flesh at the door of the tabernacle of the congregation: and there eat it with the bread that is in the basket of consecrations, as I commanded, saying, Aaron and his sons shall eat it. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Moses said to Aaron and to his sons, The flesh is to be cooked in water at the door of the Tent of meeting, and there you are to take it as food, together with the bread in the basket, as I have given orders, saying, It is the food of Aaron and his sons. \n\u003cbr\u003e8:32 [hgb]\u0026nbsp; 剩 下 的 肉 和 饼 ， 你 们 要 用 火 焚 烧 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And that which remaineth of the flesh and of the bread shall ye burn with fire. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And that which is over of the flesh and of the bread is to be burned with fire. \n\u003cbr\u003e8:33 [hgb]\u0026nbsp; 你 们 七 天 不 可 出 会 幕 的 门 ， 等 到 你 们 承 接 圣 职 的 日 子 满 了 ， 因 为 主 叫 你 们 七 天 承 接 圣 职 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And ye shall not go out of the door of the tabernacle of the congregation in seven days, until the days of your consecration be at an end: for seven days shall he consecrate you. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And you are not to go out from the door of the Tent of meeting for seven days, till the days for making you priest are ended; for this will be the work of seven days. \n\u003cbr\u003e8:34 [hgb]\u0026nbsp; 像 今 天 所 行 的 都 是 耶 和 华 吩 咐 行 的 ， 为 你 们 赎 罪 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; As he hath done this day, so the LORD hath commanded to do, to make an atonement for you. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; What has been done this day, has been ordered by the Lord to take away your sin. \n\u003cbr\u003e8:35 [hgb]\u0026nbsp; 七 天 你 们 要 昼 夜 住 在 会 幕 门 口 ， 遵 守 耶 和 华 的 吩 咐 ， 免 得 你 们 死 亡 ， 因 为 所 吩 咐 我 的 就 是 这 样 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Therefore shall ye abide at the door of the tabernacle of the congregation day and night seven days, and keep the charge of the LORD, that ye die not: for so I am commanded. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And you are to keep watch for the Lord at the door of the Tent of meeting day and night for seven days, so that death may not come to you: for so he has given me orders. \n\u003cbr\u003e8:36 [hgb]\u0026nbsp; 于 是 亚 伦 和 他 儿 子 行 了 耶 和 华 借 着 摩 西 所 吩 咐 的 一 切 事 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; So Aaron and his sons did all things which the LORD commanded by the hand of Moses. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And Aaron and his sons did all the things about which the Lord had given orders through Moses.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/zongjiao/19/438.html","bookId":241,"creation":"Aug 1, 2019 7:39:43 AM","modification":"Aug 1, 2019 7:39:43 AM"}
