{"id":70336,"no":16,"title":"Page 16","content":"\u003cp\u003eSomeone led her from the room. She sat in the private area alone, desolate, inconsolable.\u003c/p\u003e\n\u003cp\u003eJerry and Alek arrived together. Jerry spoke with the hospital officials while Alek wrapped Julia in his arms and held her against him as she wept until she had no more tears.\u003c/p\u003e\n\u003cp\u003eShe needed him and was past pretending she didn’t. Her own strength was depleted. Clinging to Alek, she buried her face in his chest, seeking what solace she could. When her father died, she’d been numb with guilt and grief. The tears hadn’t come until much later.\u003c/p\u003e\n\u003cp\u003eHe held her close and she was grateful for his comfort, for his willingness to share her grief.\u003c/p\u003e\n\u003cp\u003eThey seemed to be at the hospital for hours. There were papers to sign and a hundred different decisions to make. Jerry went with her and Alek to the funeral home, where arrangements were made for Ruth’s burial.\u003c/p\u003e\n\u003cp\u003eJulia was surprised by the calm, almost unemotional way she was able to deal with the details of the funeral. The flowers, the music, discussing the program with first the funeral home director and then the family’s minister, Pastor Hall.\u003c/p\u003e\n\u003cp\u003eIt was dark by the time they’d finished. Jerry, solemn and downcast, walked out to the parking lot with her and Alek.\u003c/p\u003e\n\u003cp\u003e“Do you want to come back to the condo with us?” Julia asked, not wanting to leave her brother alone. Unlike her, he’d return to an empty house. Ruth’s death had shaken him badly. He didn’t express his grief as freely as she had.\u003c/p\u003e\n\u003cp\u003eJerry shook his head. “No, thanks.”\u003c/p\u003e\n\u003cp\u003e“Anna has dinner ready and waiting,” Alek said.\u003c/p\u003e\n\u003cp\u003e“I’ll pick up something on the way home,” he assured them both. “Don’t worry about me.”\u003c/p\u003e\n\u003cp\u003eAlek drove through the hilly streets that led to their condominium. “How are you feeling?” he asked, when he opened the front door for her.\u003c/p\u003e\n\u003cp\u003e“Drained.” The emotions seemed to be pressing against her chest. She was mentally and physically exhausted; her fatigue was so great she could barely hold up her head.\u003c/p\u003e\n\u003cp\u003eAlek guided her into the kitchen. She hadn’t eaten since breakfast, hadn’t thought about food even once. The smells were heavenly, but she had no appetite.\u003c/p\u003e\n\u003cp\u003eHe brought two plates from the oven and set them on the table.\u003c/p\u003e\n\u003cp\u003e“I’m not hungry,” she told him. “I’m going to take a bath.” She half expected him to argue with her, to insist she needed nourishment. Instead he must have realized she knew what was best for herself right now.\u003c/p\u003e\n\u003cp\u003eOne look in the bathroom mirror confirmed Julia’s worst suspicions. Her eyes were red, puffy, and her cheeks were pale, her makeup long since washed away by her tears. She looked much older than her thirty years. About a hundred years older. She looked and felt as if she’d been hit by a freight train.\u003c/p\u003e\n\u003cp\u003eRuth was gone, and other than Jerry she was alone in the world. She was grateful for Alek’s assistance during this traumatic day, but in time he’d leave and then she’d be alone again.\u003c/p\u003e\n\u003cp\u003eRunning her bathwater, she added a package of peach-scented salts and stepped into the hot, soothing water. She leaned against the back of the tub and closed her eyes, letting the heat of the bath comfort her.\u003c/p\u003e\n\u003cp\u003eChildren waiting to be born.\u003c/p\u003e\n\u003cp\u003eShe didn’t know why that phrase edged its way into her mind. There would be no children because there would be no real marriage. She was more determined than ever not to cross that line, especially now, when she was most vulnerable. She’d hurt Alek enough, abused his gentleness, taken advantage of his kindness.\u003c/p\u003e\n\u003cp\u003eHe was standing in the hallway outside the bathroom waiting for her when she finished. “I’m fine, Alek,” she said, wanting to reassure him, even if it wasn’t true.\u003c/p\u003e\n\u003cp\u003e“You’re exhausted. I turned back the sheets for you.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eHe ushered her into the bedroom as if she were a child. In other circumstances, Julia would have resented the way he’d taken control of her life, but not then. She felt only gratitude.\u003c/p\u003e\n\u003cp\u003eShe slid beneath the covers, nestled her head against the pillow and closed her eyes. “Alek,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Yes, my love?”\u003c/p\u003e\n\u003cp\u003e“Would you sing to me again?”\u003c/p\u003e\n\u003cp\u003eHe complied with a haunting melody in his own language. His voice was clear and strong, and even though she couldn’t understand the words, she found it beautiful and soothing. She wanted to ask him the meaning, but her thoughts drifted in another direction. Toward rest. Toward peace.\u003c/p\u003e\n\u003cp\u003eJulia woke with a start. She didn’t know what had jarred her awake. The room was dark, although the hall light offered little illumination. The digital clock on the nightstand informed her it was nearly 1:00 a.m. As her eyes adjusted, she realized Alek was sitting beside her in a chair, his legs stretched out before him and his head cocked at an odd, uncomfortable angle.\u003c/p\u003e\n\u003cp\u003e“Alek?” she whispered, propping herself up on one elbow.\u003c/p\u003e\n\u003cp\u003eHe stirred immediately and straightened. “Julia?”\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I didn’t want you to be alone.”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said again.\u003c/p\u003e\n\u003cp\u003e“Do you want me to sing to you?”\u003c/p\u003e\n\u003cp\u003eHot, burning tears filled her eyes at his tenderness, his concern. She shook her head. What she needed was to be held.\u003c/p\u003e\n\u003cp\u003e“Julia, my love,” he whispered, moving from the chair to the edge of the bed. His hand smoothed the hair from her face, his touch as gentle as if she were a child in need of reassurance, which was exactly the way Julia felt.\u003c/p\u003e\n\u003cp\u003e“Why do you have to be so wonderful?” she sobbed. “Why are you so good to me?”\u003c/p\u003e\n\u003cp\u003eHis lips touched her forehead, but he didn’t answer.\u003c/p\u003e\n\u003cp\u003e“I’m a rotten wife.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You haven’t given yourself a chance yet.”\u003c/p\u003e\n\u003cp\u003e“I’ve treated you terribly. You should hate me.”\u003c/p\u003e\n\u003cp\u003e“Hate you?” He seemed to find her words amusing. “That would be impossible.”\u003c/p\u003e\n\u003cp\u003e“Will you lie down with me? Please?” The words were out before she could censor them. It was a completely selfish request. “I…need you, Alek.” She added this last part for honesty’s sake, to ease her conscience.\u003c/p\u003e\n\u003cp\u003eHe kissed her, his mouth locating hers unerringly in the near-dark. Although his kiss was light, she knew it was his way of thanking her for admitting the truth.\u003c/p\u003e\n\u003cp\u003eHe stood and stripped off his pants and shirt. Julia lifted the covers and moved over as far as she could in the narrow bed.\u003c/p\u003e\n\u003cp\u003eDespite sleeping in his embrace the night before, she felt strangely shy now. He put his arm around her shoulders and brought her close. He was warm and real and felt so alive that she trembled when she laid her head on his chest. His heart was pounding strong and steady against her ear.\u003c/p\u003e\n\u003cp\u003e“Can you sleep now?” he whispered.\u003c/p\u003e\n\u003cp\u003e“I…think so. What about you?”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about me.”\u003c/p\u003e\n\u003cp\u003eThat didn’t answer her question, but she didn’t press him. “We kissed last night, didn’t we?”\u003c/p\u003e\n\u003cp\u003eHe rubbed his chin across her hair. “Yes.” She heard the strain in his voice and felt unusually pleased. She tilted her head back so that she was looking into his warm, dark eyes. Only a few inches separated their mouths.\u003c/p\u003e\n\u003cp\u003e“Would you…mind—” she hesitated and moistened her lips “—kissing me again?”\u003c/p\u003e\n\u003cp\u003eHis breathing stopped abruptly and his eyes narrowed as if he wasn’t sure he should trust her. Julia didn’t blame him.\u003c/p\u003e\n\u003cp\u003eRather than waiting for his permission, she arched toward him until their lips met. Their kiss was sweet and undemanding. She was breathing hard when they finished, but so was he.\u003c/p\u003e\n\u003cp\u003eHe kissed her again, a little deeper, a little more intensely. Then a lot more intensely.\u003c/p\u003e\n\u003cp\u003eJulia sighed as his mouth left hers, their bottom lips clinging momentarily. “Oh, Alek.” She sighed, and a trembling kind of response made its way through her body.\u003c/p\u003e\n\u003cp\u003eShe said his name again, more softly this time. “I want to make love.”\u003c/p\u003e\n\u003cp\u003eShe watched him closely and noted the different emotions flashing in his eyes. He wanted her, too; there was no question of that. He wanted her and had from the beginning of their marriage. He’d made certain she knew how much. Yet he hesitated.\u003c/p\u003e\n\u003cp\u003eHis eyes gradually changed and told her another story. They darkened with doubt, which won over the needy, sensual look she’d seen in him seconds earlier.\u003c/p\u003e\n\u003cp\u003e“Julia.” He breathed her name, his tone regretful. “Not now.”\u003c/p\u003e\n\u003cp\u003e“Why not?” She knew she sounded defensive and couldn’t help it. He’d demanded she share his bed from the first night of their marriage.\u003c/p\u003e\n\u003cp\u003eBut when she finally agreed to fulfill her part of their bargain, he rejected her. It made no sense. And it angered her.\u003c/p\u003e\n\u003cp\u003e“I’d feel as if I was taking advantage of you.”\u003c/p\u003e\n\u003cp\u003e“Shouldn’t I be the judge of that?” she said irritably.\u003c/p\u003e\n\u003cp\u003e“Right now, no.”\u003c/p\u003e\n\u003cp\u003eStunned, she jerked her head away. His fingers came to her face, resting on her cheek, directing her gaze back to his.\u003c/p\u003e\n\u003cp\u003e“I want you, Julia, don’t ever doubt that. But I refuse to put my own needs before yours. You’re confused and hurting. There’s nothing I’d like more than to—” He stopped. “I’m sure you understand.” She nodded.\u003c/p\u003e\n\u003cp\u003eHe kissed her briefly, then tucked his arm around her and brought her even closer to his side. His lips were in her hair. “When we make love, I don’t want there to be any regrets in the morning.”\u003c/p\u003e\n\u003cp\u003eJulia smiled and kissed his bare chest. “No one told me you were so noble.”\u003c/p\u003e\n\u003cp\u003e“No one told me, either,” he muttered disparagingly.\u003c/p\u003e\n\u003cp\u003eThe way he said it with a deep, shuddering sigh led her to believe that if anyone had regrets in the morning, it would be her husband.\u003c/p\u003e\n\u003cp\u003eContent now, she curled up against him and shut her eyes. She’d prefer it if they made love, but being in his arms would satisfy her for now.\u003c/p\u003e\n\u003cp\u003eAlek envied Julia her ability to sleep. For weeks he’d been waiting for his wife to come to him, to fulfill her wedding vows by her own choice. Yet when she invited him to her bed, held her arms softly around him, he felt compelled to do the honorable thing.\u003c/p\u003e\n\u003cp\u003eHonor. But at what price? His body throbbed with need. His heart ached with love. No woman had led him on a finer chase. No woman had challenged him as much as his wife. No woman had defied and infuriated him more than Julia.\u003c/p\u003e\n\u003cp\u003eShe’d been hurt and angry at his refusal, then seemed to accept the wisdom of his words. Wisdom, nothing! He was a fool.\u003c/p\u003e\n\u003cp\u003eMaybe not, he decided after a moment. Perhaps he had been wise. Only time would tell.\u003c/p\u003e\n\u003cp\u003eHe felt Julia stir some time later and was surprised to realize it was morning. Slowly he opened his eyes to discover her face staring down at his, studying him. “Good morning,” she whispered.\u003c/p\u003e\n\u003cp\u003eHe waited, thinking she might be angry at finding him in bed with her, but she revealed none of the outrage she had the morning before. Still, her eyes were clouded and her grief was evident.\u003c/p\u003e\n\u003cp\u003e“Did you sleep well?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded shyly, her gaze avoiding his. “What about you?”\u003c/p\u003e\n\u003cp\u003e“As well as can be expected.” He stretched his cramped arms and yawned loudly. They were fools, the pair of them. His sister had said as much yesterday morning. They were sleeping in a single bed when there was a perfectly good king-size bed in the other room. \u003c/p\u003e","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-16.html","bookId":1964,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
