{"id":70343,"no":19,"title":"Page 19","content":"\u003cp\u003e“You’re quiet,” Alek commented.\u003c/p\u003e\n\u003cp\u003eJulia leaned back her head and smiled up at him. They couldn’t seem to be apart from each other, even for a moment. Not just then. His touch was her reality.\u003c/p\u003e\n\u003cp\u003eHis arms tightened around her. “Any regrets?”\u003c/p\u003e\n\u003cp\u003e“None.”\u003c/p\u003e\n\u003cp\u003eHe kissed the side of her neck. “Me, neither.”\u003c/p\u003e\n\u003cp\u003e“I thought you’d gloat. Our making love is a real feather in your cap, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I care nothing for feathers. All I want is my wife.” He stroked his chin across the top of her head. “Are you still hungry?”\u003c/p\u003e\n\u003cp\u003eJulia patted her stomach. “Not a bit. Are you?”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m half-starved.”\u003c/p\u003e\n\u003cp\u003eThe odd catch in his voice told her it wasn’t food that interested him. He went still, as though he feared her response. Looking up at him, she stared into his eyes and smiled. “I have a feeling I’ve awakened a monster,” she teased.\u003c/p\u003e\n\u003cp\u003eAlek pressed her down into the thick carpet, his eyes seeking hers. “Do you mind?”\u003c/p\u003e\n\u003cp\u003e“No,” she whispered, untying the sash to her silk robe. “I don’t mind at all.”\u003c/p\u003e\n\u003cp\u003eAlek’s mouth had just touched hers when the phone rang. He froze and so did Julia.\u003c/p\u003e\n\u003cp\u003e“Let it ring,” she suggested, rubbing her hands over his chest, loving the smooth feel of his skin.\u003c/p\u003e\n\u003cp\u003e“It could be important.” Reluctantly his eyes moved from her to the phone.\u003c/p\u003e\n\u003cp\u003e“You’re probably right,” Julia said, although she was far more interested in making love with her husband than talking on the phone.\u003c/p\u003e\n\u003cp\u003e“I’ll get it.” He scrambled across the floor and grabbed the receiver. “Hello,” he said impatiently.\u003c/p\u003e\n\u003cp\u003eJulia followed, kneeling beside him. Leaning forward, she caught his earlobe between her teeth.\u003c/p\u003e\n\u003cp\u003e“Hello, Jerry,” he said curtly.\u003c/p\u003e\n\u003cp\u003eJulia playfully progressed from his ear to his chin, then down the side of his neck.\u003c/p\u003e\n\u003cp\u003e“Yes, Julia’s right here.” He seemed winded, as if he were under strain.\u003c/p\u003e\n\u003cp\u003e“It’s for you.” He handed her the phone.\u003c/p\u003e\n\u003cp\u003eJulia took it, her eyes holding his. “Hello, Jerry,” she said in a clear, even voice. “You caught me at a bad moment. Would you mind if I called you back in say…half an hour?”\u003c/p\u003e\n\u003cp\u003e“Ah…sure.” Her brother obviously wasn’t pleased, but Julia didn’t really care.\u003c/p\u003e\n\u003cp\u003e“Thanks.” She hung up the phone. “Now…”\u003c/p\u003e\n\u003cp\u003e“A bad moment?” Alek repeated, struggling to hide a smile. “Or a good one?”\u003c/p\u003e\n\u003cp\u003e“Definitely a good one,” she said. “At least from my point of view.”\u003c/p\u003e\n\u003cp\u003e“And mine, too…”\u003c/p\u003e\n\u003cp\u003eNearly thirty minutes passed before Julia returned her brother’s call.\u003c/p\u003e\n\u003cp\u003e“Hello, Jerry,” she said, when he answered the phone. “I’m sorry I couldn’t talk earlier.”\u003c/p\u003e\n\u003cp\u003e“What’s going on over there, anyway?”\u003c/p\u003e\n\u003cp\u003e“Sorry. We were busy.”\u003c/p\u003e\n\u003cp\u003eThe pause that followed was full of meaning. “Ah. I see. So,” he said smugly, “how do you like married life now?”\u003c/p\u003e\n\u003cp\u003e“I like it just fine.” She felt embarrassed to be discussing her love life with her brother even in the vaguest way. “Why are you calling? Is there a problem?”\u003c/p\u003e\n\u003cp\u003e“Yes, there is.” Jerry’s voice sharpened. “It’s Roger.”\u003c/p\u003e\n\u003cp\u003eJulia groaned inwardly. Would she never be rid of him? “What’s he up to now?”\u003c/p\u003e\n\u003cp\u003e“I told you he was after something when he showed up for the funeral.”\u003c/p\u003e\n\u003cp\u003e“We both know he didn’t come out of respect,” Julia agreed.\u003c/p\u003e\n\u003cp\u003e“I got a call from a friend who said he’s heard Roger’s been asking a lot of questions about Phoenix Paints.”\u003c/p\u003e\n\u003cp\u003e“What did your friend learn?” A cold chill skittered down Julia’s spine. Three years ago she’d handed Roger their latest fomula—the biggest advance in house paint in over thirty years. A month before Conrad Industries’ new line of paints was scheduled to hit the market, their plant burned to the ground. Within a matter of weeks Roger had left the company, and Ideal Paints was marketing Conrad Industries’ new product.\u003c/p\u003e\n\u003cp\u003eBecause of the fire, it was impossible to meet the demand for their innovation, while Ideal Paints was capable of delivering paint to every hardware store in the country.\u003c/p\u003e\n\u003cp\u003e“My friend? He couldn’t find out very much.”\u003c/p\u003e\n\u003cp\u003e“Let’s double security around the plant,” Julia suggested.\u003c/p\u003e\n\u003cp\u003e“I’ve already done that.”\u003c/p\u003e\n\u003cp\u003e“Who has Roger contacted?” she asked, pushing the hair from her forehead. They wouldn’t allow him to steal from them again.\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Jerry sounded equally concerned.\u003c/p\u003e\n\u003cp\u003e“Should we bring in a private investigator?”\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003e“Tracking phones calls. See if he’s getting information from any of our employees. We could have him watched. What do you think?”\u003c/p\u003e\n\u003cp\u003e“I don’t know what to think. This is crazy. It’s like a nightmare happening all over again. How soon did Alek say the new product would be ready for marketing?”\u003c/p\u003e\n\u003cp\u003e“Soon. He’s been working a lot of hours.”\u003c/p\u003e\n\u003cp\u003e“I figure we should move ahead as quickly as possible, don’t you? I’ll see what I can do to schedule a meeting with the marketing folks. The sooner we can get our new paint on the store shelves, the better.”\u003c/p\u003e\n\u003cp\u003e“Okay. Let me know if you hear anything else,” Julia said.\u003c/p\u003e\n\u003cp\u003e“I will,” Jerry promised.\u003c/p\u003e\n\u003cp\u003eThey said a few words of farewell and when she replaced the receiver, she sighed.\u003c/p\u003e\n\u003cp\u003e“What was that all about?” Alek asked.\u003c/p\u003e\n\u003cp\u003eJulia shook her head, not wanting to explain, because explaining would mean telling him about her relationship with Roger. That was something she wanted to avoid, at least for now.\u003c/p\u003e\n\u003cp\u003e“These lines,” he said, tracing his finger along the creases in her brow, “are because of Roger Stanhope, aren’t they?”\u003c/p\u003e\n\u003cp\u003eJulia nodded.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought. Tell me about him, Julia. It’s time I knew.”\u003c/p\u003e\n\u003cp\u003eNine\u003c/p\u003e\n\u003cp\u003e“Julia,” Alek urged when she didn’t immediately respond.\u003c/p\u003e\n\u003cp\u003e“Roger was just a man I once knew and trusted…several years ago. He proved he wasn’t trustworthy. Can we leave it at that?”\u003c/p\u003e\n\u003cp\u003e“You loved him?”\u003c/p\u003e\n\u003cp\u003eAdmitting it hurt her pride. Mixed in with all the regrets and the guilt was shame. Her only crime had been loving a man who didn’t deserve it. A man who’d used her and shocked her with his betrayal, so much so that she’d refused to believe he was responsible for what had happened until her father had literally shoved the evidence at her. Even then she’d made excuses for him, unable to accept the truth. Her father had become so exasperated with her that he’d… Julia turned her thoughts from that fateful day when her life had become a living nightmare.\u003c/p\u003e\n\u003cp\u003e“Yes, I loved him,” she answered finally. “It was a mistake. A very bad one.” “What was your mistake?” Alek probed gently.\u003c/p\u003e\n\u003cp\u003e“It’s too complicated. But rest assured, I learned my lesson.”\u003c/p\u003e\n\u003cp\u003e“And what was that?”\u003c/p\u003e\n\u003cp\u003e“That…love sometimes hurts.”\u003c/p\u003e\n\u003cp\u003eAlek studied her for a moment, but what he was hoping to see, Julia could only speculate.\u003c/p\u003e\n\u003cp\u003e“Love doesn’t always bring pain,” he said. “My love will prove otherwise.” He kissed her with a compassion that brought tears to her eyes. She managed to blink them back and offer him a look of gratitude.\u003c/p\u003e\n\u003cp\u003e“Come,” he said softly, lifting her into his arms. “It’s time for bed.”\u003c/p\u003e\n\u003cp\u003eAt dawn Alek was suddenly awake. Moonlight waltzed across the bedroom walls and the room was silent.\u003c/p\u003e\n\u003cp\u003eA chime rang the hour from the anniversary clock Julia kept on top of her bookcase. It was only 5:00 a.m. and he should be exhausted. But he was drained, sated, happy. His wife slept contentedly at his side, her slim body curled against his. He kissed her cheek, grateful Julia was married to him.\u003c/p\u003e\n\u003cp\u003eHe’d wanted to ask her more about Stanhope, but he could see the raw anguish the man’s name brought to her eyes, and even satisfying his curiosity wasn’t worth causing her additional pain.\u003c/p\u003e\n\u003cp\u003eAlek knew very little of this man, but what he did know, he didn’t like. He’d seen the way Roger had reached for Julia, placing his hand on her arm as though he had a right to touch her, to make demands. Alek didn’t like the way the other man had looked at her, either, with a leer, as if he could have her with no more than a few persuasive words.\u003c/p\u003e\n\u003cp\u003eAlek hadn’t thought of himself as jealous, but the quiet rage he’d felt when he found Roger Stanhope pestering Julia couldn’t be denied.\u003c/p\u003e\n\u003cp\u003eThe man was a weakling. Stanhope relied on his sleek good looks, his flashy smile and compelling personality instead of intelligence, honest work and business acumen.\u003c/p\u003e\n\u003cp\u003eAlek wasn’t fooled. Roger Stanhope was an enemy. Not only of Julia’s, but Jerry’s, as well. Julia hadn’t explained the telephone conversation she’d had with her brother, even when he’d asked.\u003c/p\u003e\n\u003cp\u003eAlthough she’d tried to make light of Jerry’s call, Alek had caught snatches of the conversation, enough to know she was worried. She’d been unable to disguise her distress. Stanhope wasn’t worth one iota of anxiety. As Julia’s husband, it was up to Alek to make sure that the man who’d betrayed her and her family wouldn’t be allowed to do so again.\u003c/p\u003e\n\u003cp\u003eAlek was gone when Julia woke and she instantly experienced a surge of disappointment. One look at the clock explained Alek’s absence. The last time she’d slept past ten had been as a teenager.\u003c/p\u003e\n\u003cp\u003eNevertheless, she missed him. A slow smile spread over her lips. She’d married quite a man. Obviously he worked with as much energy and enthusiasm as he made love.\u003c/p\u003e\n\u003cp\u003eShe climbed out of bed and threw on her robe. Since it was Saturday, and her week had been hellish, she intended to relax. There would be problems enough to deal with on Monday morning. The desire to rush into her office today was nonexistent.\u003c/p\u003e\n\u003cp\u003eShe was knotting the belt on her pink silk robe as she wandered into the kitchen. Anna was there, busily whipping up something delicious, no doubt.\u003c/p\u003e\n\u003cp\u003e“Good morning, Anna.”\u003c/p\u003e\n\u003cp\u003e“Good morning.” Alek’s sister stopped what she was doing and brought Julia a cup of coffee.\u003c/p\u003e\n\u003cp\u003eBeing waited on was a luxury that would soon spoil her. “I’ll take care of myself,” Julia told her, not unkindly. “You go back to whatever you’re doing.” She walked over to the counter and on closer examination saw that the contents of Anna’s bowl resembled cookie dough. A sample confirmed her guess. Oatmeal raisin, she thought.\u003c/p\u003e\n\u003cp\u003e“Yum.”\u003c/p\u003e\n\u003cp\u003eAnna grinned at the compliment. “Alek asked me to bake them this morning for your picnic.”\u003c/p\u003e\n\u003cp\u003eJulia paused halfway across the kitchen floor. “Our picnic?”\u003c/p\u003e\n\u003cp\u003e“Yes, he left a note asking me to pack a basket of food. He gave me a long list of everything he wants.”\u003c/p\u003e\n\u003cp\u003e“Where is he?” Julia asked, adding cream to her coffee. “Do you know?”\u003c/p\u003e\n\u003cp\u003eAnna shook her head as she resumed stirring the thick batter. “No. He had some errand. He doesn’t tell me much. I’m only his sister.” \u003c/p\u003e","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-19.html","bookId":1964,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
