{"id":70380,"no":38,"title":"Page 38","content":"\u003cp\u003e“You heard me.”\u003c/p\u003e\n\u003cp\u003e“Lesley, I don’t know if you realize this, but there isn’t a golf course within eight hundred miles of Twin Creeks. I’ve never played the game.”\u003c/p\u003e\n\u003cp\u003e“You’ll pick it up fast, I’m sure. Anyway, those are my conditions. Take them or leave them.”\u003c/p\u003e\n\u003cp\u003eChase groaned. “All right, if you want to see me make a fool of myself.”\u003c/p\u003e\n\u003cp\u003eMiniature golf. That was what Lesley had in mind.\u003c/p\u003e\n\u003cp\u003eShe’d left him worrying all the way through their hamburgers before they drove to the golf course and he learned the truth. It was a just punishment, he decided, for what he’d put her through.\u003c/p\u003e\n\u003cp\u003eHe’d suspected Lesley would be good at it and she was, soundly defeating him on the first nine holes. But as she’d said, he was a fast learner, rallying on the last nine. When they added up their scores, Lesley won by three strokes.\u003c/p\u003e\n\u003cp\u003e“I can’t remember the last time I laughed so much,” she said over a glass of iced tea. They were relaxing on the patio under a pink-and-orange-striped umbrella, surrounded by children and a handful of adults. “You’re a good sport, Chase.”\u003c/p\u003e\n\u003cp\u003e“Does that surprise you?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “A little. Men don’t like to lose, especially to a woman.”\u003c/p\u003e\n\u003cp\u003e“That’s not true in all situations, just some.”\u003c/p\u003e\n\u003cp\u003e“Name one.” Her challenge was there, bold and unmistakable.\u003c/p\u003e\n\u003cp\u003e“When it comes to a woman deciding between two men,” he said thoughtfully. “Naturally, I can’t speak for all men, but there’s one thing that bothers me more than anything.”\u003c/p\u003e\n\u003cp\u003e“And that’s?”\u003c/p\u003e\n\u003cp\u003e“When I’m forced to compete with another man for a woman’s affection.”\u003c/p\u003e\n\u003cp\u003eLesley grew quiet after that, and Chase hoped he hadn’t offended her with his honesty. He couldn’t apologize for speaking the truth.\u003c/p\u003e\n\u003cp\u003e“Tell me about the women you saw today,” she said unexpectedly, sounding almost cheerful. He caught the gleam in her eye and realized she was prepared to hear horror stories.\u003c/p\u003e\n\u003cp\u003e“I was really surprised by some,” he began.\u003c/p\u003e\n\u003cp\u003e“Oh? Were they that awful?”\u003c/p\u003e\n\u003cp\u003e“No.” He shook his head. “Not at all—there were some classy women in the group, with good educations. One of the first few I interviewed had her master’s degree.”\u003c/p\u003e\n\u003cp\u003e“What prompted her to respond to your ad?” The self-satisfied look disappeared, replaced by one of genuine curiosity.\u003c/p\u003e\n\u003cp\u003eChase had wondered about that himself. “I asked about her motives right off. Don’t get me wrong—Twin Creeks is a nice, civilized town, but it’s a long way from shopping centers, large libraries and cultural events. Granted, we have TV and the internet, but you aren’t ever going to see any Broadway shows performed there. I explained all that to Christine.”\u003c/p\u003e\n\u003cp\u003e“And she still wanted to marry you?”\u003c/p\u003e\n\u003cp\u003eChase nodded. “At least she said she did. She explained that she’s in her late thirties and has a successful career. But now she realizes how badly she wants a husband and family. She claimed every guy she’s dated in the last few years is emotionally scarred from a breakup or a divorce.”\u003c/p\u003e\n\u003cp\u003e“Having reentered the dating scene myself, I’m beginning to see how true that is.”\u003c/p\u003e\n\u003cp\u003e“Christine is mainly interested in starting a family,” Chase concluded.\u003c/p\u003e\n\u003cp\u003e“How do you feel about children?” She propped her elbows on the table and rested her chin in her palms as she studied him.\u003c/p\u003e\n\u003cp\u003e“I want a family, but I’d prefer to wait a year or two, to give my wife the opportunity to know me better and for me to know her. In my view, it’s important to be sure the marriage is going to last before we bring a child into the equation.”\u003c/p\u003e\n\u003cp\u003e“That’s an intelligent way of looking at it.”\u003c/p\u003e\n\u003cp\u003eLesley went silent again and he saw pain in her eyes and wondered at the cause. He was about to question her when she spoke again.\u003c/p\u003e\n\u003cp\u003e“Other than Christine, is there another woman who made an impression on you?”\u003c/p\u003e\n\u003cp\u003e“Several. A female plumber who let me know she doesn’t, uh, mind kinky sex.”\u003c/p\u003e\n\u003cp\u003eThe look that came over Lesley was very prim and proper. “I see.”\u003c/p\u003e\n\u003cp\u003e“And Bunny, who has four children under the age of six.”\u003c/p\u003e\n\u003cp\u003e“Oh, my goodness.”\u003c/p\u003e\n\u003cp\u003e“She was looking for someone to help her raise her kids and was honest about it. Her ex-husband abandoned them nine months ago.”\u003c/p\u003e\n\u003cp\u003e“The creep.”\u003c/p\u003e\n\u003cp\u003eChase agreed with her. “I don’t understand how a man can walk away from his responsibilities like that. What he did to Bunny is bad enough, but to leave those beautiful children…”\u003c/p\u003e\n\u003cp\u003e“She brought them?”\u003c/p\u003e\n\u003cp\u003e“No, I asked to see a picture. They’re cute as could be. I felt sorry for her.” He didn’t mention that he’d given her enough money to fill her gas tank so she could get home and paid for a week’s worth of groceries. She hadn’t asked, but he could tell she was in dire financial straits.\u003c/p\u003e\n\u003cp\u003e“You aren’t interested in a woman with excess baggage?” she asked, almost flippantly. Though he’d only known Lesley a short time, he already knew it wasn’t like her to be so offhand. He suspected something else was bothering her.\u003c/p\u003e\n\u003cp\u003e“Bunny’s a good woman who didn’t deserve to be treated so badly by the man she’d loved and trusted. The divorce was final less than a week ago. Bunny, and the children, too, need more love and help than I could give them. To answer your question, no, I don’t object to marrying a woman with children.”\u003c/p\u003e\n\u003cp\u003eLesley was silent for a long time after that. “My dad left us,” she finally said in a small voice.\u003c/p\u003e\n\u003cp\u003eChase chose his words carefully, not knowing how to comment or if he should. “It must have been very hard.”\u003c/p\u003e\n\u003cp\u003e“I was only six and we were going to Disneyland. Mom had worked a second job in order to save extra money for the trip. Dad took the money when he left.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lesley, I’m sorry.”\u003c/p\u003e\n\u003cp\u003eThe look in her eyes became distant, as if she were that six-year-old child, reliving the nightmare of being abandoned by her father all over again.\u003c/p\u003e\n\u003cp\u003e“I know I shouldn’t have blamed myself. I didn’t drive my father away, but for years I was convinced that if I’d been the son he wanted, he’d never have left.”\u003c/p\u003e\n\u003cp\u003e“Have you had any contact with him since?”\u003c/p\u003e\n\u003cp\u003e“He called when I was fifteen and wanted to see me.”\u003c/p\u003e\n\u003cp\u003e“Did you?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “After being so bitterly hurt, I didn’t have a lot of hope for our meeting. It’s funny the things a child will remember about someone. I always thought of my dad as big and strong and invincible. When we met again nine years later, I realized he was weak and selfish. We had lunch together and he told me I could order anything I wanted. I remember I asked for the most expensive thing on the menu even though I didn’t like steak. I barely touched the steak sandwich and took it home for our dog. I made sure he knew he’d paid top dollar to feed our collie, too.”\u003c/p\u003e\n\u003cp\u003e“What made him contact you after all those years?”\u003c/p\u003e\n\u003cp\u003eLesley sighed. “He seemed to want me to absolve him from his guilt. He told me how hard his life had been when he was married to my mother and had a child—me—with all the responsibilities that entails. He claimed he’d married too young, that they’d both made mistakes. He said he couldn’t handle the pressures of constantly being in debt and never having money to do the kinds of things he wanted to do.\u003c/p\u003e\n\u003cp\u003e“That’s when I learned the truth. My dad walked out on my mother and me because he wanted to race sports cars. Imagine, driving a sports car meaning more to him than his wife and daughter.\u003c/p\u003e\n\u003cp\u003e“You might think badly of me, but I wouldn’t give him the forgiveness he was seeking—not then. It wasn’t until later, in my early twenties, when I learned he’d died of cancer, that I was able to find it in my heart to forgive him.”\u003c/p\u003e\n\u003cp\u003e“I don’t know how any fifteen-year-old could have forgiven someone who’d wounded her so deeply,” Chase said, reaching for her hand. She gripped his fingers with surprising strength and intuitively Chase knew she didn’t often share this painful part of her childhood.\u003c/p\u003e\n\u003cp\u003eShe offered him a brief smile and picked up her drink.\u003c/p\u003e\n\u003cp\u003e“Did your mother ever remarry?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Lesley answered, “to a wonderful man who’s perfect for her. You’d have to meet my mother to understand. She has a tendency to be something of a curmudgeon. It took her a long time to find the courage to commit herself to another relationship.\u003c/p\u003e\n\u003cp\u003e“I was out of high school before she married Ken, although they’d dated for years. She never told me this, but my guess is that Ken said either they marry or end the relationship. I don’t think he would’ve followed through on the threat, but it worked.\u003c/p\u003e\n\u003cp\u003e“He and Mom are both retired. They live on a small ranch in Montana now and really love it.”\u003c/p\u003e\n\u003cp\u003e“They sound happy.”\u003c/p\u003e\n\u003cp\u003e“They’d like a couple of grandkids to spoil someday but—” Lesley stopped abruptly and her face turned a soft shade of pink.\u003c/p\u003e\n\u003cp\u003e“But what?” he inquired.\u003c/p\u003e\n\u003cp\u003e“Oh, nothing.” She shrugged, looking decidedly uncomfortable. “It’s just something Daisy said to me this afternoon. And…she might be right.” Her voice faded.\u003c/p\u003e\n\u003cp\u003e“Right about what?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” she said quickly.\u003c/p\u003e\n\u003cp\u003eWhatever the subject, it was obvious that Lesley wasn’t going to discuss it with him.\u003c/p\u003e\n\u003cp\u003e“Will you be meeting more women tomorrow?” Lesley asked.\u003c/p\u003e\n\u003cp\u003eChase nodded with little enthusiasm. “I should never have agreed to that news story. The phones have been ringing off the hook ever since. There’s no way I could possibly interview eight hundred women in two weeks’ time.”\u003c/p\u003e\n\u003cp\u003e“Eight hundred!”\u003c/p\u003e\n\u003cp\u003eLesley sounded as shocked as he’d been when he’d heard the original number of five hundred. Since the story had aired, three hundred additional calls had poured in.\u003c/p\u003e\n\u003cp\u003e“That’s…incredible.”\u003c/p\u003e\n\u003cp\u003e“Just remember, I haven’t met a single one I like better than you.”\u003c/p\u003e\n\u003cp\u003eLesley laughed. “You’ve already heard my answer to that.”\u003c/p\u003e\n\u003cp\u003e“I don’t have much time in Seattle, Lesley. Less than three weeks. I need to make some decisions soon. If you’d be willing to marry me, I’d promise to be a good husband to you.”\u003c/p\u003e\n\u003cp\u003e“Hold it!” she said, raising both hands. “Back up. I’m not in the market for a husband. Not now and possibly never again. Men have done some real damage to my heart, starting with my father and most recently Tony. I don’t need a man in my life.”\u003c/p\u003e\n\u003cp\u003e“True, but do you want one?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“It’s something to think about, then, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Not right now,” she answered, her voice insistent. “I don’t want to consider anything but having fun. That’s my goal for this summer. I want to put the past behind me and get on with life in a positive way.”\u003c/p\u003e\n\u003cp\u003e“I do, too,” Chase assured her, and it was true in a more profound way than she probably realized. \u003c/p\u003e","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-38.html","bookId":1964,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
