{"id":70408,"no":60,"title":"Page 60","content":"\u003cp\u003eLesley tensed, her hands on his shoulders. “What did you just say?” Her voice was barely audible.\u003c/p\u003e\n\u003cp\u003e“I love you.” It sounded so naked, saying it like that. “I realize blurting it out might make you uncomfortable, but I didn’t think it was fair if I told your mother how I felt and said nothing to you.”\u003c/p\u003e\n\u003cp\u003eShe was off his lap in a flash. Tears glazed her eyes as she backed away from him.\u003c/p\u003e\n\u003cp\u003e“I was sure of it when I thought you’d left me,” he explained. “I’d tried to reach you by phone and when I couldn’t, I had Pete go to the cabin. He told me the truck was gone and that Jim had flown you into Fairbanks. I didn’t know what to think. Now it seems ludicrous to leap to the conclusions I did, but at the time it made perfect sense.”\u003c/p\u003e\n\u003cp\u003e“I see.” One tear escaped the corner of her eye and rolled down the side of her face.\u003c/p\u003e\n\u003cp\u003e“Say something,” he pleaded. His heart was precariously perched at the end of his sleeve. The least she could do was let him know if she was about to pluck it off and crush it beneath her feet.\u003c/p\u003e\n\u003cp\u003e“I knew when we got married that you didn’t love me,” she said, without looking at him. “When we were in Victoria—I knew you didn’t love me then, either.”\u003c/p\u003e\n\u003cp\u003e“Don’t be so sure,” he returned, frowning. He understood the problem, had always understood it. Tony. She was in love with her former fiancé and that wasn’t likely to change for a long time.\u003c/p\u003e\n\u003cp\u003eHer head snapped up. “You were in love with me on our honeymoon?”\u003c/p\u003e\n\u003cp\u003eHe shrugged, unwilling to reveal everything quite so soon. He wished she’d express her feelings for him.\u003c/p\u003e\n\u003cp\u003e“Were you?” she asked again.\u003c/p\u003e\n\u003cp\u003eChase stood and rubbed his hand along the back of his neck, walking away from her. “Does it matter?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“All right,” he muttered. “As near as I can figure, I loved you when we got married. It just took me a while to…put everything together.” He shoved his hands inside his pockets. This wasn’t going as well as he’d hoped.\u003c/p\u003e\n\u003cp\u003e“I tried to reassure your mother, but that didn’t work,” he continued. “Tony’s got her convinced you married me on the rebound and that it was a mistake.”\u003c/p\u003e\n\u003cp\u003e“I didn’t.”\u003c/p\u003e\n\u003cp\u003eNow it was Chase’s turn to go still. He was afraid to believe what he thought she was saying. “You aren’t in love with Tony?” he asked breathlessly.\u003c/p\u003e\n\u003cp\u003e“That would be impossible when I’m crazy in love with you.” She smiled then, the soft womanly smile that never failed to stir him. Her love shone like a beacon.\u003c/p\u003e\n\u003cp\u003eChase closed his eyes to savor her words, to wrap them around his heart and hold on to the feeling. It happened then, a physical need, a craving for her that was so powerful it nearly doubled him over.\u003c/p\u003e\n\u003cp\u003eThey moved toward each other, their kisses fuel to the flames of their desire.\u003c/p\u003e\n\u003cp\u003e“Chase,” Lesley groaned between kisses, unbuttoning his shirt as she spoke. “We can’t.… Mother’s room is directly down the hall from us. She’ll hear.”\u003c/p\u003e\n\u003cp\u003eChase kissed her while trying to decide what to do.\u003c/p\u003e\n\u003cp\u003e“The cache,” he said, grateful for the inspiration. It wasn’t the ideal solution, but it would serve their purpose.\u003c/p\u003e\n\u003cp\u003eLesley’s legs seemed to have given out on her and he lifted her into his arms, pausing only long enough to grab the quilt from the rocking chair.\u003c/p\u003e\n\u003cp\u003eHe gathered her in his arms, holding her close with a fierce possessiveness.\u003c/p\u003e\n\u003cp\u003e“I love you.” Each time he said it, the words came more easily.\u003c/p\u003e\n\u003cp\u003e“I know.” She spread a slow series of kisses along his jaw.\u003c/p\u003e\n\u003cp\u003e“Your mother…”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about Mom. She’ll come around, especially when she’s got grandchildren to spoil.”\u003c/p\u003e\n\u003cp\u003e“Children,” Chase said softly.\u003c/p\u003e\n\u003cp\u003e“Is this a new concept to you?”\u003c/p\u003e\n\u003cp\u003e“Not entirely.” He grinned and she smiled back.\u003c/p\u003e\n\u003cp\u003e“Good.” Her teeth caught his lower lip. “Soon I hope,” she said a moment later. “How soon?”\u003c/p\u003e\n\u003cp\u003eLesley raised her head and her beautiful dark eyes gazed down at him. “No time like the present, is there?”\u003c/p\u003e\n\u003cp\u003eChase sucked in his breath. He’d thought they’d wait a year, possibly longer, to start their family, but he couldn’t refuse Lesley anything.\u003c/p\u003e\n\u003cp\u003e“Will I ever grow tired of you?” he wondered aloud.\u003c/p\u003e\n\u003cp\u003e“Never,” she promised.\u003c/p\u003e\n\u003cp\u003eChase instinctively knew it was true.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003e“Grandma, Grandma.” Three-year-old Justin Goodman tore out of Lesley’s grasp as they stepped into the small airport and he ran into the waiting arms of June Campbell-Sterne.\u003c/p\u003e\n\u003cp\u003eJune hugged her grandson and lifted him from the ground. “Oh, my, you’ve gotten so big.”\u003c/p\u003e\n\u003cp\u003eJustin’s chubby arms circled his grandmother’s neck and he squeezed tightly.\u003c/p\u003e\n\u003cp\u003e“Justin’s not the only one who’s grown,” Chase said, slipping his arm around Lesley’s thickened waist.\u003c/p\u003e\n\u003cp\u003e“You would have, too, if you were about to have a baby,” Lesley reminded her husband.\u003c/p\u003e\n\u003cp\u003eChase chuckled and shook hands with Ken Sterne.\u003c/p\u003e\n\u003cp\u003e“Good to see you again,” Ken said. “June’s been cooking for three days. You’d think an army was about to descend on us.”\u003c/p\u003e\n\u003cp\u003e“Hush now,” June chastised her husband. “How are you feeling?”\u003c/p\u003e\n\u003cp\u003eLesley sighed. How did any woman feel two months before her delivery date? Anxious. Nervous. Eager. “I’m okay.”\u003c/p\u003e\n\u003cp\u003eJune put down her grandson and kissed Chase on the cheek.\u003c/p\u003e\n\u003cp\u003eHis eyes met Lesley’s and he gave her a know-it-all look. It had taken time, but Lesley had been right about the effect grandchildren would have on the relationship between her mother and her husband. When they’d first met, four years earlier, her mother had been convinced Chase was some kind of demon. These days he was much closer to sainthood.\u003c/p\u003e\n\u003cp\u003e“How’s Twin Creeks?” Ken asked, steering the small party toward the baggage area.\u003c/p\u003e\n\u003cp\u003e“The population has doubled,” Lesley informed him proudly. It had started soon after her arrival. Pete had gotten married the following spring and he and his wife already had two children and another on the way. Even Jim had married, which surprised them all. A widow with four children had found a place in all their hearts.\u003c/p\u003e\n\u003cp\u003eIt seemed there was a baby being born every few months. The community was thriving. Lesley believed Chase was the one who’d put everything in motion; his venture into Seattle to find himself a wife was what had started the process. Soon the other men working at the pump station were willing to open their lives.\u003c/p\u003e\n\u003cp\u003eChase, however, was convinced that once the other men saw what a wonderful woman he’d found, they’d decided to take their chances, as well.\u003c/p\u003e\n\u003cp\u003eWhatever the reason, there were fifteen more women residing in Twin Creeks. Ten of them had apparently made it a personal goal to populate Alaska.\u003c/p\u003e\n\u003cp\u003eShe placed one arm around her husband and smiled softly to herself. How different her life would have been without him. Each and every day she thanked God for that crazy billboard she’d seen on her way to the store. \u003c/p\u003e","sourceLink":"https://allnovel.net/an-engagement-in-seattle/page-60.html","bookId":1964,"creation":"Oct 5, 2019 10:16:38 AM","modification":"Oct 5, 2019 10:16:38 AM"}
