{"id":33165,"no":18,"title":"CHAPTER XVIII. A DARK DEED.","content":"\u0026nbsp;\"There is no other way!\" thought James Cromwell, as fresh from his interview with Clara, he returned to his shop. \"The boy stands in my way. His death will bring me money, and then that man will give me the hand of the woman I love. There is no other way, unless Clara prevails upon her father to recall his condition.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But another interview with the young lady in the evening, dissipated any hope of this nature which he may have entertained. She reported that her father was immovable on this point, and that persuasion and entreaty had alike been in vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may soon be able to comply with your father\u0027s conditions,\" said Cromwell. \"I have received a letter to-day, which informs me that the party from whom I expect a legacy, is in very feeble health.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps there may be something in his story,\" thought Clara, and influenced by the doubt, she[Pg 140] smiled graciously, and said, \"Let us wait and hope that fortune may favor us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Promise me one thing,\" asked Cromwell, \"that you will wait for me, and will not admit the attention of any one else?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But this did not suit the plans of the astute Clara. She by no means wished to compromise her matrimonial chances by binding herself to an uncertainty, and accordingly answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would willingly do as you ask, Mr. Cromwell, if papa were willing, but he has expressly forbidden me to bind myself by an engagement, or make any promise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James Cromwell\u0027s countenance fell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"After all,\" she added, with a smile, \"is any promise necessary in our case? Do we not understand one another?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These words and the smile that accompanied them, restored the cheerfulness to her lover. He thought he did understand Clara Manton, but in this, as we know, he was egregiously mistaken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning he received the following letter from Paul Morton. It was the first he had received from the merchant, and was in reply to one of his own written from Madison.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 141]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"James Cromwell:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Dear Sir:—Yours of the 15th inst., informing me of your safe arrival at Madison and your determination to make that place your home, was duly received. The accident which you speak of as near befalling my ward at Niagara Falls did not surprise me. He is a careless boy, and I should not be surprised at any time to hear of his coming to harm from this cause. Of course, you will exercise proper care in cautioning him, etc., and then, should he meet with any accident, I shall exonerate you from blame in the matter. How is his health? I have at times thought he inherited the feeble constitution of his father. I understand also from the late Mr. Raymond, that his mother was an invalid, and it is hardly to be expected that he would have a very strong or vigorous constitution. However, I do not feel anxious on this point, as I am aware that you have a knowledge of medicine, and I have full confidence in your ability to take all proper care of my young ward. I suppose you have found a suitable school for him. I shall be glad to hear that he is doing well in his studies, though on account of his not very strong constitution, previously referred to, it may be well not to press him too hard in the way of study.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me hear from you respecting Robert\u0027s welfare, from time to time. Yours, etc.,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Paul Morton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 142]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James Cromwell read this letter twice over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s a crafty old spider,\" he said to himself. \"Any one to read it would think that he was very solicitous for the welfare of this boy. It would be considered an excellent letter by those who did not understand it. I am behind the scenes, and I know just what it means. He means to blame me, because I didn\u0027t make a sure thing of it at Niagara Falls, and hints pretty plainly about some accident happening to him in future. He is impatient to hear of his death, that is plain, and no doubt he will gladly pay the amount he promised, as soon as he receives intelligence of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This reflection plunged James Cromwell into serious thought. Already predisposed to the foul deed, the artful suggestions of this letter tended to fan the flame, and incite him still more to it. Danger indeed, and that most serious, was menacing our young hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So James Cromwell, spurred by a double motive, veered more and more toward the accomplishment of the dark deed which would stain his soul with bloodshed, and in return give him the fleeting possession of money and the girl whom he loved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 143]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once resolved upon the deed, the next consideration was the ways and means of accomplishing it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Should he use poison?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That seemed most in his line, and he regretted that he had not secured a supply of the same subtle poison which Paul Morton had purchased of him in the small shop on the Bowery. There was likely to be no one in that neighborhood who possessed a sufficient medical knowledge to detect its presence or trace its effects. But it was rare, and there was little chance of his obtaining it unless by sending to New York, and this would, of itself, afford strong ground for suspicion against him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, as to the ordinary poisons, their effects upon the human system were too well understood, even by ordinary physicians, for him to employ them without great peril. He decided, therefore, to adjure poisons altogether. The fact that he was a druggist would render their use even more readily suspected than in the case of an ordinary person.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How then should he proceed?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question was still undetermined in his own mind, when chance decided the matter for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 144]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One evening, while he was still pondering this question, and much embarrassed about the decision of it, he chanced to be returning home from a desultory walk which he had taken. Now, in the town of Madison, somewhat centrally situated, or at least one side of it was near the center of the town, there was a pond of about two miles in circuit. By the edge of this pond James Cromwell met Robert Raymond.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly an idea came into his mind, as casting his eyes toward the pond, he saw a small boat tied by a rope round the trunk of a tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good evening, Mr. Cromwell,\" said Robert. \"Have you been taking a walk?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but I have not been far. When did you come out?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About half an hour ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, do you know how to row?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was thinking that we might borrow this boat, and have a little row on the pond. What do you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like it,\" said Robert, promptly, for he had a boy\u0027s love of the water. \"Shall I unfasten the rope?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I wish you would.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 145]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert at once sprang to the tree, and quickly untied the rope and set the boat free.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All ready, Mr. Cromwell!\" he cried. \"Jump aboard, and I will get in afterward.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James Cromwell stepped into the boat, his heart beating quick with the thought of the deed which he meditated. His courage almost failed him, for he was of a timid nature, but the thought of the stake for which he was playing, renewed his courage, and he resolved that, come what might, that night should be Robert Raymond\u0027s last.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Which of us shall row, Mr. Cromwell?\" asked Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will row first, and you may do so afterward.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cromwell took his place, and rowed rather awkwardly until the boat reached the middle of the pond.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shan\u0027t I take the oars now, Mr. Cromwell?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite yet. I am going to row into that little recess over yonder. You can row back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The outline of the pond was irregular. In one place there was a recess, surrounded by woods, within which they would be shielded from view. It seemed a fitting place for a tragedy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 146]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they were fairly within it, Cromwell said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now you may take the oars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert rose from his seat, and stepped toward the center of the boat. His movements were naturally rather unsteady. James Cromwell turned pale, and he braced his shrinking nerve. He felt that now was his time. Unless he acted now, his opportunity would be gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Robert approached, he suddenly seized the unsuspecting boy around the middle, and threw him into the water. So suddenly was it done, that before the boy understood what had happened to him, he found himself engulfed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Never once looking back, James Cromwell seized the oars, and rowed himself swiftly back. When he got on shore, he looked nervously out over the surface of the pond. All was still. Nothing was visible of Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is drowned!\" said Cromwell to himself, wiping away the large drops of perspiration from his forehead.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2997/82691.html","bookId":304,"creation":"Aug 5, 2019 4:42:15 AM","modification":"Aug 5, 2019 4:42:15 AM"}
