{"id":33154,"no":7,"title":"CHAPTER VII. PAUL MORTON HAS A VISITOR.","content":"\u0026nbsp;Paul Morton\u0027s consternation can hardly be described, when, in the number who had come to witness the funeral ceremonies of Ralph Raymond, he recognized the shopman in the obscure druggist\u0027s shop where he had purchased the poison. The sweat stood out upon his brow, and he eagerly questioned himself—how much did this man know, or what did he suspect, or was his presence purely accidental? \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But he could hardly believe that a man in such a position would attend the funeral, unless he had some object in view. How had he found out his name and residence? Was it possible that he had been tracked?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked furtively at the young man, now grown an object of strange and dread interest to him. He noted his insignificant features, and the general meanness of his appearance, and he began to pluck up courage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose he does suspect anything,\" he[Pg 50] thought; \"will his testimony be believed against mine? A miserable druggist\u0027s clerk, probably on a starvation salary. At the worst I can buy him off for a small sum.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Reassured by these thoughts, he recovered his boldness, and in looking about him, did not hesitate to meet the gaze of James Cromwell, without suffering a trace of the first agitation to be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But that first agitation had been observed at the time by the druggist\u0027s clerk, and he had drawn his own conclusions from it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has used the poison,\" he said to himself, \"and it is for that reason that my presence alarms him,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length the funeral ceremonies were over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The company who were assembled left the house, and with them James Cromwell. He went back to his room, not feeling that it was of importance to remain longer. He had shown himself at the funeral, he had been recognized, and thus he had paved the way for the interview which he meant to have, and that very shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two evenings later, he approached the house in Twenty-ninth Street, and ascending the steps, boldly rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 51]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The servant who answered the summons, looked at him inquiringly, supposing from his appearance that he had merely come to bring some message.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is Mr. Morton at home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he is at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would like to see him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He doesn\u0027t see visitors, on account of a death in the family. I will carry your message.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must see him,\" insisted the clerk, boldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he will see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do. So go and tell him I am here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What name shall I carry to him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The name is of no consequence. You can tell him that the young man whom he noticed at the funeral is here, and wishes to see him on very important business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s a queer message,\" thought the servant, but concluded that it was some one who had something to do with furnishing something for the funeral, and was anxious to get his pay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Morton was sitting in his library, or a room furnished with books, which went by that name, when the servant entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is somebody to see you, sir,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 52]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know his name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it a gentleman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you tell him I was not receiving visitors now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said he wanted to see you on very important business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why didn\u0027t he give his name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said that I was to tell you it was the young man you noticed at the funeral,\" said the servant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Morton turned pale, but at once recovered himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not sure that I know who it is,\" he said, \"but I can easily ascertain. You may bring him up.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are to come up,\" said the girl reappearing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James Cromwell smiled in conscious triumph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought so,\" he said to himself. \"Well, now for my game. It will be a difficult one, but I will do my best.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Left alone, Paul Morton began to consider how he should treat the new-comer. He resolved to[Pg 53] affect no recognition at first, and afterward indifference. He thought he might be able to overawe the young man, from his own superiority in social position, and so prevent his carrying out the purpose he proposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Accordingly, when James Cromwell entered the room, he arched his brows a little, and looked inquiringly at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you business with me?\" he said, abruptly. \"Did not my servant inform you that, on account of a recent death, I am not receiving callers at present?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought you would see me,\" said the young man, with a mixture of familiarity and boldness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, I don\u0027t know what claims you have to be excepted to my rule,\" said Paul Morton, haughtily. \"If you are a tradesman, and have a claim against me, you might have sent it in the regular way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not a tradesman, and I have no claim against you, Mr. Morton,\" said the young man—\"that is, no regular claim.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You speak in riddles, sir,\" said Mr. Morton, in the same haughty tone. \"If you have no business with me, I am at a loss to know why you have[Pg 54] intruded yourself upon me at such a time. Perhaps, however, you were unaware of my recent affliction.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am quite aware of it, Mr. Morton. In fact, I was present at the funeral, if you refer to the death of Mr. Raymond, and unless I am greatly mistaken, you yourself observed me there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were present at the funeral! What brought you here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That seems rather an inhospitable question. For some reasons of my own, I felt an interest in what was going on in this house, and made it my business to become acquainted with all that passed. When I heard of Mr. Raymond\u0027s death, I resolved at once to attend the funeral.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you must have known Mr. Raymond, then,\" said Paul Morton, with something of a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I had not the pleasure of a personal acquaintance with the gentleman,\" said James Cromwell, who, far from being overawed by the evident haughty tone of the other, preserved his composure with admirable success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then let me repeat, I do not understand why you should have taken the trouble to be present at his funeral. Persons, in general, wait for an[Pg 55] invitation before intruding on such occasions,\" he added, with a palpable sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He wouldn\u0027t parley so long if he did not know me and fear me,\" thought James Cromwell, and this conclusion showed that he was not without a certain natural shrewdness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was Mr. Raymond rich?\" he asked, nonchalantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was more than Paul Morton could bear. He was naturally an irritable man, and he had been obliged to exercise considerable self-control thus far in the interview. It angered him that this insignificant druggist\u0027s clerk—this miserable specimen of a man—should have ventured to intrude himself in this manner on his privacy, but the terror of his crime and the consciousness that this man suspected it, had hitherto restrained him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But when James Cromwell asked this question, sitting coolly, with one leg crossed over the other, and staring impudently in his face, he could not restrain himself any longer. He rose to his feet with angry vehemence, and pointing to the door with a finger literally quivering with rage, he said, hoarsely:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You impertinent scoundrel! begone instantly,[Pg 56] or I will summon my servants and have you kicked down my front steps!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That might not be altogether prudent, Mr. Morton,\" said James Cromwell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Might not be prudent! What do you mean by your cursed impudence?\" demanded the merchant, glaring furiously at the druggist\u0027s clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do I mean?\" repeated James Cromwell. \"Do you wish me to answer your question?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I demand that you answer my question, and that immediately,\" said the merchant, hardly knowing what he did, so carried away was he by his unreasonable anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, I will do so,\" said the clerk, quietly, \"but, as it may take a brief time, will you not be kind enough to resume your seat?\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2997/82680.html","bookId":304,"creation":"Aug 5, 2019 4:42:15 AM","modification":"Aug 5, 2019 4:42:15 AM"}
