{"id":25646,"no":1,"title":"PREFACE","content":"\u0026nbsp;TO THE ENGLISH EDITION \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n SCHOLARS have been good enough to notice this book; and the majority have treated it very kindly, doubtless because they have perceived that the author has observed all the established rules of historical research and accuracy. Their kindness has touched me. I am especially grateful to MM. Gabriel Monod, Solomon Reinach and Germain Lefèvre-Pontalis, who have discovered in this work certain errors, which will not be found in the present edition.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My English critics have a special claim to my gratitude. To the memory of Joan of Arc they consecrate a pious zeal which is almost an expiatory worship. Mr. Andrew Lang\u0027s praiseworthy scruples with regard to my references have caused me to correct some and to add several.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The hagiographers alone are openly hostile. They reproach me, not with my manner of explaining the facts, but with having explained them at all. And the more my explanations are clear, natural, rational and derived from the most authoritative sources, the more these explanations displease them. They would wish the history of Joan of Arc to remain mysterious and entirely supernatural. I have restored the Maid to life and to humanity. That is[Pg vi] my crime. And these zealous inquisitors, so intent on condemning my work, have failed to discover therein any grave fault, any flagrant inexactness. Their severity has had to content itself with a few inadvertences and with a few printer\u0027s errors. What flatterers could better have gratified \"the proud weakness of my heart?\"[1]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paris, January, 1909.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3040/83984.html","bookId":1034,"creation":"Aug 3, 2019 4:22:05 PM","modification":"Aug 3, 2019 4:22:05 PM"}
