{"id":51283,"no":109,"title":"Chapter 29 Godlike Archery (1)","content":"\u003cp\u003e\u003cb\u003eChapter 29 Godlike Archery (1)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLuo Ke Di had been knocked back by Zhou Weiqing’s arrow. Luckily, he was a 5 - Jewelled Physical Jewel Master, and his physique was extremely strong and durable. Under such a circumstance, he was still able to react and lessen the damage done. Furthermore, when Zhou Weiqing shot this last arrow, he had plucked out the arrowhead, and Luo Ke Di did not sustain any damage. Otherwise, being taken by surprise like that and hit by an arrow from the Overlord Bow, even though his cultivation level was a lot higher than Zhou Weiqing’s, he would still be injured. This was the price to pay for underestimating an enemy.\u003c/p\u003e\n\u003cp\u003eIn truth, it had been extremely difficult for Zhou Weiqing to hit Luo Ke Di. The first four arrows were all testing and probing the situation, and only the fifth arrow targeting the ground was the key to his plan. Luo Ke Di had not known about the power of his Physical Jewel Consolidated Equipment, and the strength of the explosive nature of the Overlord Bow, and had been caught by surprise by the explosion and sent flying into the air. At that time, Zhou Weiqing had already won half the battle.\u003c/p\u003e\n\u003cp\u003eIn the next instant, when Zhou Weiqing fired the next arrow, he had sent the Spatial Attribute Skill Blink from his Elemental Jewel and fused it with the Overlord Bow. Calculating the fact that Luo Ke Di had a limited range of motion while in midair, his Overlord Spatial Arrow’s effect was pretty simple. It did not have any increase in power, but it was able to cause the arrow to Blink in midair. Once the arrow had reached about 250 yards from Luo Ke Di, it blinked right to him. Indeed, Luo Ke Di’s judgement had not been wrong at all, but alas he had not calculated the fact that the arrow could just blink next to him! Although Zhou Weiqing could not fully control the Overlord Spatial Arrow yet, his luck was pretty decent and it had succeeded in a single try.\u003c/p\u003e\n\u003cp\u003eA cute little white head popped up from Zhou Weiqing’s bosom, blinking its deep blue eyes, though it did not make any sound. Wasn’t that the much missed little white tiger? Nobody knew why the little white tiger was so attached to Zhou Weiqing, and though he often ‘bullied’ it, the little thing refused to leave his side. Because of this, Shangguan Bing’er was often depressed about it.\u003c/p\u003e\n\u003cp\u003eAs Luo Ke Di fell hard on the floor, he executed a perfect roll and jumped back up. Feeling the pain and stuffy feeling in his chest, he was also in a gloomy mood; after all he did not even know how he had been struck by the arrow. \u003ci\u003eWas something wrong with my hearing? That’s impossible! Just from distinguishing distances and attacks from hearing alone, even the rest of the guys in the Heavenly Bow Unit weren’t any stronger than me! \u003c/i\u003eHe thought to himself.\u003c/p\u003e\n\u003cp\u003eThis was tantamount to a skilled goose hunter getting his eyes pecked out by a goose, a skilled captain capsizing a ship in a small pond. [1. These are the literal translations of two idioms, the former is 打雁却被雁啄了眼, while the latter is 阴沟里翻船. Basically, both have similar meanings - failing miserably at an easy task, or failing at the last minute due to being careless.] With his clothes torn and filled with dirt, Luo Ke Di was rather depressed.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing and Shangguan Bing’er came running over, and Shangguan Bing’er said with concern clear in her voice: “Senior, are you okay?”\u003c/p\u003e\n\u003cp\u003eLuo Ke Di felt even worse from her comforting words; if she had ridiculed or taunted him, he probably wouldn’t have felt so bad, but being comforted and cared for by a little girl, even though his skin was thick, he couldn’t help but flush in shame. Looking strangely at the honest-looking Zhou Weiqing, he said: “Little brat, not bad! Looks like I have misjudged you.” With his archery skill and power, how could he not have felt that the arrowhead of the last arrow had been removed, otherwise he might have been injured.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing gave a hearty laugh and said: “Senior, it’s just my luck, just luck. When I shot the last arrow, my hand slipped and just happened to shoot askew of my target. Who knew that you would accidentally knock into it instead. Does that count as passing the first test?”\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eHand slipped? \u003c/i\u003eLuo Ke Di’s brow twitched at that as he couldn’t help but think to himself. \u003ci\u003eWho do you think you’re lying to?? The earlier arrows you didn’t strip the arrowhead, yet this particular one you did so. Would you do that if you didn’t have the confidence of hitting me? Hmph. This little rascal really knows how to pretend to be a boar to eat tigers \u003c/i\u003e[2. Another literal translation of a common idiom I’m sure you guys have seen before. It means hiding his true strength to surprise / defeat enemies]\u003ci\u003e , why does that seem so familiar though?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eLuo Ke Di gritted his teeth and said: “Yes, you both have passed the first test. Now it’s time for the second test. Little Brat, pass me your Purple Dawn Bow and quiver.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing started and looked at him vigilantly: “What for?”\u003c/p\u003e\n\u003cp\u003eLuo Ke Di’s eyes revealed a crafty look as he gave a faint smile. Before they could even see him moving, let alone react, Zhou Weiqing felt a flash in front of his eyes, and the weight on his body lifted, and his Purple Dawn Bow and quiver appeared in Luo Ke Di’s hands. “Earlier, you both each shot 20 arrows at me, now it’s my turn to shoot 20 arrows at you two. As long as in this 20 arrows, one of them doesn’t hit either of you, then you will pass the second test. Do not worry, I’ll pluck out the arrowheads. You guys can start running now, and I’ll count to five. One…”\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eDamn, this is falsely using authority to take personal revenge!\u003c/i\u003e Zhou Weiqing thought in his heart, but he did not dare to delay at all, as he and Shangguan Bing’er exchanged looks. Without hesitation, both turned and ran off at top speed.\u003c/p\u003e\n\u003cp\u003eAt the same time, Luo Ke Di leisurely took out an arrow from the quiver, tapping on it with his fingers and breaking off the arrowhead. He slowly nocked it and drew the bow, all the while counting slowly: “two, three, four, five… here’s the first arrow!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing and Shangguan Bing’er heard his voice, and instantly leapt and twisted to the side. However, as soon as they did so, they realised something was wrong; they did not hear any sound of an arrow whistling through the air. \u003ci\u003eCould it be a silent arrow? \u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e“Fool! If I say it’s coming, does it mean it should really come?” As Zhou Weiqing executed a roll on the ground and was just about to vault up and change directions, he suddenly felt a pain on his buttocks, and he was instantly knocked 3 feet to the front.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eIt’s really a silent arrow?\u003c/i\u003e That arrow was obviously shot after his warning, and even ignoring the fact that it was silent, he probably still wouldn’t have been able to dodge it if it was loud. After all, the arrow had reached him just as his body was still on the ground, and unless he used the Blink skill, he would not have been able to react in time. However, Zhou Weiqing did not want to reveal his Elemental Jewel secret just yet. Although he had used it earlier in the first test, that was under the condition that Luo Ke Di had not been able to see the arrow. If he used it in such a situation now, it would be extremely obvious to Luo Ke Di.\u003c/p\u003e\n\u003cp\u003eDespite the fact that the arrowhead was already broken off, but with the power of the Purple Dawn Bow, when the bow shaft struck his buttocks, Zhou Weiqing felt a large force transmit to him. However, it shuddered against the Immortal Deity Shield that automatically protected him, causing it to spread throughout his body and dissipating most of the energy; as such, he was only knocked a few feet to the front and with a slight pain.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eSo, this is the real way of using the Immortal Deity Shield!\u003c/i\u003e Inspiration struck Zhou Weiqing as he suddenly understood the Immortal Deity Shield’s effect. When the attack landed on his body, the shielding effect from the five energy whirlpools was just the basic, and the more important effect was the spreading and dissipating of the attack power. Although he would still take some damage on his body, but most of the impact had already been expended, and it would greatly reduce any injury to him.\u003c/p\u003e\n\u003cp\u003e“Eh? You’re pretty good at taking hits!” Luo Ke Did said with some surprise as he looked at Zhou Weiqing, who stumbled back to his feet and continued running forward after the first hit.\u003c/p\u003e\n\u003cp\u003eAccording to his original plan, the first arrow should have numbed his buttocks and allowed him to shoot his twenty arrows at will, as corporal punishment. He had reserved all twenty arrows for Zhou Weiqing; after all, he needed to vent away the pent up depression after being shot by Zhou Weiqing just now. However, Zhou Weiqing was unexpectedly fine after the first arrow, and this stirred up Luo Ke Di’s competitive heart.\u003c/p\u003e\n\u003cp\u003e*Swoosh* Another arrow flew out. This time, Zhou Weiqing had extended his senses to their maximum capability, and due to that, when the arrow reached him, it gave him a shock in his heart. This was because he found out that it was not a Silent Arrow! [3. I think he is referring to it as a Physical Jewel Consolidated Equipment, like Shangguan Bing’er’s Silent Tracking Arrow]\u003c/p\u003e\n\u003cp\u003eThe arrow that Luo Ke Di had shot out did actually have some sound, but it was extremely faint, and even with Zhou Weiqing’s senses at their max, it was only when it reached about 10 yards from him did he catch a faint sound.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eHow did he do that?\u003c/i\u003e Zhou Weiqing thought puzzledly, as his buttocks was hit by the arrow once again. This time, his body had just flew forward when the 3rd arrow had reached. He hadn’t even landed from the second blow and had no chance at all, and it was followed by the fourth and fifth arrow!\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er had started running at the same time as Zhou Weiqing, and the two had jumped apart earlier. However, soon, an extremely strange sight entered her eyes.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was continuously being hit by a stream of arrows from Luo Ke Di, and he wasn’t even able to hit the ground before being hit by arrow after arrow, as they kept him in mid air.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWhat sort of archery is this?\u003c/i\u003e Shangguan Bing’er mind froze and she stared dumbfoundedly. After all, both sides were 300 yard apart, and to accomplish such a feat, when the first arrow hit Zhou Weiqing, Luo Ke Di’s third arrow already had to be in the air! Only then could the arrows strike continuously without any break, causing him to be caught in midair! [4. Air combo!]. This also meant that as soon as Luo Ke Di fired his arrow, he had to determine where and how Zhou Weiqing would be knocked back, and fire his next arrow into that trajectory. This wasn’t just a simple matter of eyesight and discernment!\u003c/p\u003e\n\u003cp\u003eFurthermore, as she looked at Luo Ke Di, he was walking slowly forward as he fired the arrows rapidly, and she was barely able to make out his firing motions. He was also doing so extremely leisurely, even taking the time to give her a suave smile, and barely glancing back at Zhou Weiqing. The even more shocking thing was that, Luo Ke Di was not using a Silent Arrow, but he was able to get more than eighty percent effect of a Silent Arrow. \u003ci\u003eSuch unbelievable skill!?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eGodlike archery skills! This could only be described as godlike archery! Although his cultivation level is only 5 Jewels, but this archery, such skills, they are almost beyond human comprehension. Is this the true strength of the Heavenly Bow Unit?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eBy now, Zhou Weiqing’s Heavenly Energy levels were dropping dangerously low. After all, he had been hit by 8 or so arrows, and even his impressive reserves were running dry. Earlier, he had used the Overlord Bow and Overlord Spatial Arrow earlier, coupled with the current expenditure of energy from the Immortal Deity Technique, caused his Heavenly Energy to drop really quickly.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing made the snap decision to stop the Immortal Deity Shield from protecting him, as he needed to reserve sufficient Heavenly Energy for the use of one last Blink. He did not want to fail here in this second test!\u003c/p\u003e\n\u003cp\u003eAfter stopping the Immortal Deity Shield, a change quickly occurred, the first one being the massive increase in pain. Originally, Zhou Weiqing was only knocked 3 metres away by each arrow; without the Immortal Deity Technique, the next arrow actually knocked him 5 metres away, and the searing pain and numbness on his buttocks caused him to cry out loud.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-5-chapter-28-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-5-chapter-29-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-5-chapter-29-01","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
