{"id":51190,"no":16,"title":"Chapter 4 The secrets of Heavenly Jewel Masters (4)","content":"\u003cp\u003e\u003cstrong\u003eChapter 4 – The secrets of Heavenly Jewel Masters (4)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Wow, so fierce? Does that mean that a single Jewelled Heavenly Jewel Master is stronger than a 2-jewelled Physical or Elemental Jewel Master?” Zhou Weiqing said in shock.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said: “In terms of raw strength, yes. However, Heavenly Jewel Master’s also have a tougher time cultivating than ordinary Physical or Elemental Jewel Masters. Throughout the whole mainland, Physical or Elemental Jewel Masters who are able to cultivate to the 9th Jewel are still quite plentiful. However, we still have not heard of any Heavenly Jewel Master who has been able to cultivate to the maximum. In fact, Heavenly Jewel Masters should be considered a different profession altogether. Legend says that the strongest Heavenly Jewel Masters can train up to 12 Jewels, such a level is already against nature’s law, able to change anything in the world.” As she continued speaking, her eyes revealed a yearning for such a level.\u003c/p\u003e\n\u003cp\u003e12 Jewels, so Heavenly Jewel Masters could actually cultivate up to 12 Jewels, and not the 9 of the ordinary Physical or Elemental Jewel Masters. Only after listening to Shangguan Bing’er’s elucidation, did Zhou Weiqing finally realize how strong his father was. After all, his father was an 8-Jewel Heavenly Jewel Master!\u003c/p\u003e\n\u003cp\u003eAs such, Zhou Weiqing asked probingly: “I hear that our Heavenly Bow Empire’s Admiral Zhou is also a Heavenly Jewel Master, is he very strong?”\u003c/p\u003e\n\u003cp\u003eWithout hesitation, Shangguan Bing’er said: “Of course he’s strong! Admiral Zhou is the person I respect the most! His level is considered strong even in those large countries, let alone in our Heavenly Bow Empire. His Majesty once said before, even all the Jewel Masters in our Heavenly Bow Empire together would not be able to defeat Admiral Zhou alone. After all, Admiral Zhou has already cultivated up to 8 Heavenly Jewels, and is a mid level Tian Zong. In the whole mainland, he is still considered a first class expert. Furthermore, Admiral Zhou’s elemental alignment is one of the 4 top elemental alignments.\u003c/p\u003e\n\u003cp\u003eAlthough Shangguan Bing’er was praising his father, Zhou Weiqing somehow could not be overjoyed. The reason was simple, after his burst of exertion running quickly, his stamina was almost drained bare; he was totally drenched in sweat and panting, even speaking was too difficult now.\u003c/p\u003e\n\u003cp\u003e“Hurry up.” The whip appeared in Shangguan Bing’er’s hands, and looking at Zhou Weiqing’s face streaming with sweat, she couldn’t help but feel a sense of joy. This rascal actually had quite a good physical condition, after running so long with the load he was still able to persevere, it was clear that the pain he showed earlier in the morning after the one whip was all acting.\u003c/p\u003e\n\u003cp\u003e“Battalion Commander, I can’t continue anymore, let me rest a while please.” Zhou Weiqing wiped the sweat from his face, looking at her pleadingly.\u003c/p\u003e\n\u003cp\u003eUnfortunately, this time Shangguan Bing’er had already resolved to not fall for the same trick again, her beautiful face turned cold, and her whip lashed out like lightning to land on Zhou Weiqing’s buttocks. The pain caused Zhou Weiqing to shudder, and his slowing footsteps picked up speed again. His internal armor did not cover his buttocks after all.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Shangguan Bing’er who was running alongside Zhou Weiqing, was almost like a ghost, her feet lightly touching the ground and every step she seemed to float almost 10 metres; her running seemed almost effortless. Her Physical Jewel attribute was to increase agility and speed, and her Elemental Jewel was also the fastest attribute wind; it could be said that she had the perfect combination of attributes for an agility type Heavenly Jewel Master. If she ran at her top speed, even a 4-Jewel Physical Jewel Master would not be able to catch up with her.\u003c/p\u003e\n\u003cp\u003e“Ahh! The pain is killing me!” Upon getting the whipping, Zhou Weiqing subconsciously followed the momentum to try and fall down again. However, just as he was about to do so, a slim fine foot appeared in front of him, the toes hooking his chest and stabilizing his falling body. Following which, another whip fell upon his buttocks, causing him to yell in pain again.\u003c/p\u003e\n\u003cp\u003e“Try acting some more.” Shangguan Bing’er said with gritted teeth. She had barely used any strength on her first blow as a test, and just as she had expected, that fellow had failed the test miserably, proving he was acting all along.\u003c/p\u003e\n\u003cp\u003eIn front of Shangguan Bing’er, Zhou Weiqing did not even have the chance to fall down. She was like a purple shadow following him, as soon as he slowed down, a whip would land; as soon as he pretended to fall, he would be stabilized followed by another whip. This time, he had really gotten the worst of it, his buttocks were burning in pain, and his body was getting more tired by the second, and his lungs were like on fire, but he still could not slow down at all.\u003c/p\u003e\n\u003cp\u003e“Battalion Commander… I… I… I was … wrong.” Sweet talking was Zhou Weiqing’s specialty, and he was no stranger to admitting his mistakes. After all, a wise man does not fight when the odds are against him. Alas, once bitten twice shy, after being fooled so many times, Shangguan Bing’er was not falling for his tricks once again.\u003c/p\u003e\n\u003cp\u003e“Now you know you’re wrong? It’s too late.” Shangguan Bing’er said angrily.\u003c/p\u003e\n\u003cp\u003eAfter 15 minutes, Zhou Weiqing’s army uniform was already totally drenched in sweat; after all he was carrying 20 kg weights while running! Furthermore, he was only 13 years old, how could he withstand such a high intensity workout.\u003c/p\u003e\n\u003cp\u003eHis vision blurred and blacked out, and his body fell forward once again. Shangguan Bing’er’s foot reached him again as usual, but this time although she had hooked him up, but before her whip could fall once again, Zhou Weiqing’s body continued falling down. Shangguan Bing’er blanked for a moment, then with a flash she was behind him, supporting his body down onto the ground with her foot. Only then did she realise that this fellow had actually really fainted this time.\u003c/p\u003e\n\u003cp\u003e“Oi, Oi. Little Fatty Zhou.” Shangguan Bing’er nudged his body with his foot twice. The tourmaline on her left wrist flashed, and a pale red glow flew out to land on Zhou Weiqing’s wrist. She did not want to touch him, and thus used her energy to check his pulse.\u003c/p\u003e\n\u003cp\u003e“He really fainted?” Shangguan Bing’er’s Heavenly Energy was already at the 8th stage of Heavenly Jing Energy, although she was only using her Heavenly Energy from her Elemental Jewel to check Zhou Weiqing’s physical condition, but it was clear that this time he was not acting and had really fainted from exhaustion.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-1-chapter-4-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-1-chapter-5-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-1-chapter-4-04","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
