{"id":51359,"no":185,"title":"Chapter 55 Consolidating Equipment Master Followers (2)","content":"\u003cp\u003e\u003cb\u003eChapter 55 Consolidating Equipment Master Followers (2)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eAfter milling with their classmates for a while, Zhou Weiqing and Shangguan Bing’er left the academy. He knew that this turn of events would spread his name even further throughout the academy, and the noble students would hate him even more. WIthout question, this would bring him some more trouble, but at the same time, it would also hasten the process of bringing the commoner students to his side. Alas, he would not know until the time came whether or not how many of them would actually follow him back to the Heavenly Bow Empire. Well, he had planted the seeds and placed his bets, and he could only take things step by step from now on. The ultimate key still lay in him improving his Consolidating Equipment Master level. With his Spatial, Time and Wind Attributes combination, with sufficient Heavenly Energy, it was possible for him to start working towards becoming a High Level Consolidating Equipment Master. As for being a Consolidating Equipment Grandmaster, it would at least require him to be at minimum the four-Jeweled cultivation level, while a Zong Stage Consolidating Equipment Master would have to be at least six-Jeweled. That was something that would not be possible in a short period of time.\u003c/p\u003e\n\u003cp\u003e“Bing’er, let’s find some place to buy more materials for Consolidating Equipment Scrolls, I’ve finished all of my current materials…” Zhou Weiqing told her.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said: “Then we need to go home first… look at you, all dusty and dirty, how can you go out and buy things like that!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing looked at Shangguan Bing’er who was also covered in dust, and grinned: “Bing’er, shall we two bathe together?”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er looked at him exasperatedly and said: “You can bathe together with Da Huang and Er Huang!”\u003c/p\u003e\n\u003cp\u003eVery quickly, both of them returned to their home. Naturally, such manual work like drawing water was taken up by Zhou Weiqing; there was a well in the courtyard where he could draw the water from. He first helped Shangguan Bing’er draw a bath full of water so she could start bathing first. Of course, this fellow had thoughts of peeking, but Shangguan Bing’er’s hearing was too good, and she had been well trained and experienced in the Heavenly Bow Unit, and his success rate was just too low.\u003c/p\u003e\n\u003cp\u003eBy the time he had drawn a bath for himself, he returned to his room, grabbed hold of the little white tiger Fat Cat, and threw it into the bath.\u003c/p\u003e\n\u003cp\u003e“Wuuu Wuuuu” Fat Cat cried angrily, struggling to get out, but Zhou Weiqing had quickly stripped off his clothes, jumped in and hugged it.\u003c/p\u003e\n\u003cp\u003e“Little Fat Cat, it’s time for you to get a bath! You’re much cuter when you’re washed a nice clean white! Sigh… Bing’er refuses to take a bath with me, so I’m left with you to join me. After all, you’re at least a female. Arrghhh, how can you bite me! See if I don’t smack you good…”\u003c/p\u003e\n\u003cp\u003eAfter playing around for a while, Zhou Weiqing finally finished his bath. As soon as he opened the door, Fat Cat bolted like a bolt of lightning back into the room, ignoring Zhou Weiqing’s calls.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was wearing a fresh set of clothings, and he twisted his mouth in disdain and said: “It’s just a bath, what’s there to be embarrassed about.”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er stood in the courtyard combing her long hair, and said to him exasperatedly: “You’re bullying little Fat Cat again! You’re so bad, hmph. Be careful one day it turns big and beats you up!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing grinned and said: “No it won’t, Fat Cat’s my beloved pet. No need to fret, it will forget by the time we return.” As he said that, this rascal looked upon Shangguan Bing’er’s fresh beauty after her bath, and couldn’t help but take a big gulp of saliva. Moving closer, he tried to get intimate with her, but she quickly sidestepped him swiftly.\u003c/p\u003e\n\u003cp\u003e“Wuuu wuuu, wuuu wuuu…” Fat Cat cried out angrily in the room, scratching the walls with its claws. \u003ci\u003eAhhh! AHHHH! I want to kill that shameless rascal!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said to Shangguan Bing’er: “We should bring Da Huang, Er Huang and Fat Cat along when we go out, just in case those noble students try to take revenge, we will still be able to fight back.”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er nodded and headed back in with the Spatial Ring to store Da Huang and Er Huang. As for Zhou Weiqing, he grinned and headed back into his room.\u003c/p\u003e\n\u003cp\u003e“My dear Fat Cat, come on, come to bro’s embrace… Bro will bring you out to play!”\u003c/p\u003e\n\u003cp\u003e“Wuu wuu.” Fat Cat turned its head around, ignoring him.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing gave a humph and said: “Hurry up, don’t make me repeat myself, or when we return tonight, I’ll give you a biology lesson!”\u003c/p\u003e\n\u003cp\u003eFat Cat glared at Zhou Weiqing for a moment, but gave up in the end, jumping onto his shoulder unhappily before dropping down into his arms.\u003c/p\u003e\n\u003cp\u003eAfter the bath, Fat Cat smelled good, and was soft and comfortable in his arms. Twitching a little, it settled comfortably, and did not make any other sound. Only then did Zhou Weiqing walk out satisfied.\u003c/p\u003e\n\u003cp\u003eThe reason why he wanted to bring along the two Icy Soul Heavenly Bears and Fat Cat was due to his fight with Ming Wu. He had truly realised how weak he was compared to many in the world. The two bears were at least Zun Stage Heavenly Beasts, and in terms of combat potential, they were no weaker than he or Shangguan Bing\u0027er. As for Fat Cat, it was even stronger, having given him many surprises before. With them along, if any unforeseen dangers arose, they would at least be better able to react and escape.\u003c/p\u003e\n\u003cp\u003eIn such a large city like the Fei Li City, it was definitely not difficult to find a place to buy things. After asking around, Zhou Weiqing quickly found a suitable place.\u003c/p\u003e\n\u003cp\u003eRight in the east of the city, there was an area where all Jewel Masters gathered to trade, and was commonly called the Jewel Master Trade Center. It was set up by the Fei Li Empire, and was used by all Jewel Masters to trade for all their requirements, and had almost everything stocked up. In fact, even the Skill Storing Palace sold Skill Storing qualifications here.\u003c/p\u003e\n\u003cp\u003eThe Jewel Master Trade Center was not a single building, but was an entire area. Within this area, there were over a hundred shops selling various goods or materials that Jewel Masters required, just like a bustling market area. It was barely 2 kilometres from the academies, after all the academy students were also a big portion of the market.\u003c/p\u003e\n\u003cp\u003e“Hello, may both of you please show your membership cards?” Zhou Weiqing and Shangguan Bing\u0027er had just reached the entrance of the Jewel Master Trade Center when they were stopped by the employees. The entire Trade Centre was surrounded by a tall wall enclosure, and the only way to enter was through the four large doors each on a side of wall. The one they entered through was the south door.\u003c/p\u003e\n\u003cp\u003e“We need membership cards to buy from this place?” Zhou Weiqing asked the employees curiously.\u003c/p\u003e\n\u003cp\u003eThe employee saw their academy uniforms and smiled, saying: “Yea, all the guests purchasing anything from this area require a membership card. It also acts as a gold storage card, and all transactions here can only be done using it. This is to prevent anyone from causing trouble in the area, especially in the auction houses. It is extremely easy to register for a membership card, with the membership fees of a basic level member being a thousand gold per annum. The membership fees are waived for Heavenly Jewel Masters, however no matter what, there is a requirement to top up at least ten thousand gold coins. If you top up more than a hundred thousand gold coins at once, you will be upgraded to a mid level member; so on and so forth.” Seeing that Zhou Weiqing and Shangguan Bing\u0027er were wearing commoner uniforms, he did not elaborate further on the expenses of a high level member or beyond.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said exasperatedly: “They sure know how to earn money! Well, we’ll register for two mid level member cards.”\u003c/p\u003e\n\u003cp\u003eThe employee was rather surprised that commoner students would have so much on them, but quickly and efficiently registered the cards from them. Zhou Weiqing planned to buy quite a lot of things, so he decided to top up two hundred out of the five hundred thousand he had gotten from Ye Paopao today, in preparations for his massive purchases later.\u003c/p\u003e\n\u003cp\u003eHolding the blue mid level membership cards, the two of them finally entered the Trade Center.\u003c/p\u003e\n\u003cp\u003eThe buildings of the shops within the Trading Center all looked alike, all two-storey little buildings with a red roof and white walls, rather unique from the rest of Fei Li City. Of course, they did differ in size, but none of them actually had names, with just a big number in front of their shop. The lanes in the Trade Center were rather wide, paved in brick. Horse carriages were not allowed in here, as such there was a lot of space on the roads, and on the crossroads there were some simple but elegant carvings erected, adding some culture to the overall look.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing and Shangguan Bing’er had just started looking for a shop to enter when they were attracted by a small crowd in front of them. There weren’t that many people in the trading center, but they saw a crowd of several dozens when they turned a corner.\u003c/p\u003e\n\u003cp\u003e“Let’s go have a look as well.” Zhou Weiqing pulled Shangguan Bing’er forward excitedly. Although their fees seemed rather exorbitant, he still had quite a good impression of the entire area, at least there was some guarantee of the quality of items purchased, at least in terms of no fakes.\u003c/p\u003e\n\u003cp\u003eAs the two of them quickly walked towards the crowd, Zhou Weiqing was able to easily see what was going on due to his height advantage. It was a shop, numbered 76, and there was a sign hung outside the door, with the words - ‘High Level Consolidating Equipment Master Yun Li, Lower Level Zun Stage Heavenly Jewel Master - Accepting Followers.’\u003c/p\u003e\n\u003cp\u003eUnder the sign, there was a long wooden desk, and the person seated behind was a man of around thirty years of age. He was dressed in a Heavenly Jewel Master robes, with short black hair and relatively handsome features. His eyes had an arrogant hint in them, and as he sat on the chair looking upon the crowd.\u003c/p\u003e\n\u003cp\u003eOn the table, there was also a small wooden sign, with this written upon it: “Followers Requirement: 3 Jeweled or higher Heavenly Jewel Masters, or Five Jeweled or above for other Jewel Masters. Priority for Lifetime followers, those below thirty years of age, or ladies. Accepting five followers in total.”\u003c/p\u003e\n\u003cp\u003eThis was the first time Zhou Weiqing and Shangguan Bing’er had seen something like this, and they were extremely curious. Zhou Weiqing turned to a middle aged man near him and asked: “This big bro, what does he mean by that? I can understand accepting followers, but why are there so many restrictions? What does Lifetime Followers mean, and are there different sorts?”\u003c/p\u003e\n\u003cp\u003eThe middle aged man said in reply: “Master Yun Li is the youngest High Level Consolidating Equipment Master in our entire city; naturally he has the draw to have more stringent requirements for his Followers. There are two types of Followers usually, the first is Temporary Followers, and the other would be Lifetime Followers. For the former, they would only sign a temporary contract, sealed by a Darkness Attribute Heavenly Jewel Master, and would only be a follower for a certain stated period of time. As for Lifetime Followers, as the name suggests, it would be similar to the lifetime bonds that entail entering the Skill Storing Palace. Naturally, the higher level or higher the potential of a Consolidating Equipment Master, the higher the requirements they have for Followers. Master Yun Li is still so young, and will definitely become a Grandmaster or even a Zong Stage Consolidating Equipment Master in the future.”\u003c/p\u003e\n\u003cp\u003e“To become his follower is definitely an honour. Little brother, you are also a Jewel Master right, but it’s likely that your cultivation level isn’t sufficient for Master Yun Li. What a shame, Master Yun Li has just started his look, and it’s likely that before long, those who want to apply will likely flock here, and must pass Master Yun Li’s test first...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-7-chapter-55-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-7-chapter-55-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-7-chapter-55-02","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
