{"id":51193,"no":19,"title":"Chapter 5 Immortal Deity Technique, Heavenly Jewel Awakens (3)","content":"\u003cp\u003e\u003cstrong\u003eChapter 5 – Immortal Deity Technique, Heavenly Jewel Awakens (3)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAll of a sudden, just as he was thinking of giving up, he suddenly felt an icy feeling in his lower gut, the exact description in the manual.\u003c/p\u003e\n\u003cp\u003eHe could sense the Heavenly Energy! Zhou Weiqing rejoiced in his heart, and hurriedly focused all his attention at the lower gut area, gingerly feeling the stream of cold there and guiding it upwards.\u003c/p\u003e\n\u003cp\u003eWhat seemed to surprise him was that, after the stream of cold had appeared, it started growing more and more obvious, unlike what was described in the Immortal Deity Technique of it only being a tiny trace. As soon as it reached his chest area, it had since grown into a small ball; the whole process seemed very smooth, and it appeared that it was about to reach the Clavicle Death Acupuncture Point.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eI must succeed\u003c/strong\u003e! Zhou Weiqing screamed in his heart, he was at the point of no return now, and he gritted his teeth and willed with all his might, causing the stream of cold to viciously smash into his left Clavicle Acupuncture Point.\u003c/p\u003e\n\u003cp\u003e*Zeng* As soon as the cold stream rushed into the point, Zhou Weiqing felt as if his entire left side was struck by a bolt of lightning, losing all sensation there. Moments later, the numbness started to spread from his left side to the right, and soon his entire body had lost its feeling except for his head.\u003c/p\u003e\n\u003cp\u003eA violent, maniac air seemed to burst forth from his left Clavicle Acupuncture Point, running amok through his body. However, at this point, Zhou Weiqing did not feel any pain, but instead felt his consciousness start blurring, and with a “FWAH” sound, he spat out a mouthful of blood. He did not know that in cultivating Heavenly Energy, pain was actually not the scariest thing, but what was happening to him was indeed. Numbness, usually signified that cultivation had gone terribly wrong. The Principles outlined earlier had stated that the Immortal Deity Technique could be likened to a Certain-Death Technique, and it certainly seemed that way. However, in the cultivation world, a lot of things also depended on luck, and it could be said that success usually comes only to one in 10 thousand people. It seemed obvious that Zhou Weiqing was not such a person.\u003c/p\u003e\n\u003cp\u003eFailing to break through the Death Acupuncture Point, there would only be one result – Death.\u003c/p\u003e\n\u003cp\u003eThis poor fellow did not know what he was about to face, and was still trying his best to carry on. He only felt like his left Clavicle Acupuncture Point felt like a funnel point, funneling out all his life energy from his body. At this point nearing death, he did not feel any pain but instead felt a sense of pleasure.\u003c/p\u003e\n\u003cp\u003eAs his consciousness started fading away, Zhou Weiqing still had hopes that he had gotten lucky – Have I succeeded?\u003c/p\u003e\n\u003cp\u003eAt this point, a small stream of cold erupted from his lower gut again, as if a large ice ball had shattered in his stomach, splitting apart into countless shards of ice arrows, shooting into his various meridian passageways crazily.\u003c/p\u003e\n\u003cp\u003eA second ago, Zhou Weiqing was still floating around in pleasure, and the next moment, it was as if he had fallen into an ice cellar. The numb sensation was replaced by an unbelievable cold. At this point, his heart was overwhelmed by a strong sense of bloodlust, his eyes turned bloodshot instantly, his short black hair all standing up, and his body seemed surrounded by a greyish-black aura.\u003c/p\u003e\n\u003cp\u003eThe energy gushing out from his Clavicle Acupuncture Point had stopped with the appearance of the black aura. If we were to liken the breaking-through of the point as Zhou Weiqing puncturing a hole in a football, then the black aura had sealed the hole.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s body began shaking uncontrollably; the cold was not from the surrounding, but rather from deep within the bones, it permeated his bloodstream, down to the marrow of his bones. All he could feel was waves of cold emitting out from his body repeatedly, and along with the cold he could clearly see a black – grey layer of dust forming around his skin. The extreme cold caused him to lose control of his body, and he fell down to the ground, his mouth opened involuntarily, and every breath he took caused a gust of black-grey airstream to gush out from his body, and it seemed like the outer layer of his skin was soon covered with 2 sets of tattoos – black and grey.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing starting to learn the Immortal Deity Technique was tantamount to suicide, after all a one in ten thousand chance was certainly not high. Still, though he did not seem to have much luck on the innate talent training side, but he seemed to be extremely lucky in other ways. And this luck stemmed from the black pearl that he had swallowed in the Stars Forest.\u003c/p\u003e\n\u003cp\u003eIf successfully training the Immortal Deity Technique was a one in ten thousand chance, then swallowing the black pearl was a unique chance that could only happen once. Due to him activating the Immortal Deity Technique, causing his Clavicle Acupuncture Point to break open, it somehow also stimulated and awoke the black pearl which had been lying dormant in his body. The scenario happening now was indeed caused by the black pearl’s awakening.\u003c/p\u003e\n\u003cp\u003eOriginally, when the black pearl entered his body, it only exerted a subtle influence in improving his body slowly, but when he started on the Immortal Deity Technique this night, it had triggered the energy within the pearl in advance.\u003c/p\u003e\n\u003cp\u003eAn unspeakably evil presence seem to swell up in his body, the ice cold feeling was actually the black pearl’s immense energy; energy which was invading every corner of Zhou Weiqing’s body without any hesitation – it was indeed domineering.\u003c/p\u003e\n\u003cp\u003eIf it were anyone else, perhaps he might have self-imploded by now, but Zhou Weiqing’s body was greedily absorbing the energy of the black pearl in a frenzy.\u003c/p\u003e\n\u003cp\u003eIn fact, this was the true reason why the black pearl had chosen to enter his body after appearing in this spatial region.\u003c/p\u003e\n\u003cp\u003eAt that time, it had been drawn to Zhou Weiqing’s anger and un-resigned will after he had been struck down by Difuya’s fireball. It had just broken through the spatial dimensions into this world, when Zhou Weiqing had coincidentally spat out a mouthful of blood onto it. Zhou Weiqing’s blood itself contained a dark energy, which was also aligned with the black pearl’s own energy, and thus it had chosen Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eAs for why Zhou Weiqing’s blood contained the dark alignment energy, it was simple – because Admiral Zhou’s Elemental Jewel Alignment was Darkness. Since Zhou Weiqing was of the Admiral’s bloodline, he naturally inherited the same alignment, as such he was able to attract and fuse together with the black pearl.\u003c/p\u003e\n\u003cp\u003eHowever, the energy within the black pearl was too domineering. Besides the darkness attribute, it also contained several other elemental attributes, of which included the spatial attribute which it had used to arrive in this world, along with many other hidden attributes. The sheer amount of energy and various elemental attributes mixed together and entering his body was now changing Zhou Weiqing’s internal elemental attributes, which was the reason why the pain he was experiencing was so strong. It was definitely a much greater suffering than the muscle fatigue and soreness that he had been experiencing earlier.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-1-chapter-5-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-1-chapter-5-04\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-1-chapter-5-03","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
