{"id":51373,"no":199,"title":"Chapter 60 Who’s the disgusting one? (2)","content":"\u003cp\u003e\u003cb\u003eChapter 60 Who’s the disgusting one? (2)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eThe Spatial Shackles was a powerful skill with a high star rating. However, its use was rather limited, and could only be used in very niche circumstances. As such, it was not a popular combat skill. If used badly, it would not have any effect, or perhaps even have a detrimental effect. For example, using it on Lin TianAo now would only give him an additional layer of defense.\u003c/p\u003e\n\u003cp\u003eHowever, hearing Zhou Weiqing’s shout, Yun Li knew that Zhou Weiqing had found a chance. As the saying goes, opportunities had to be seized instantly or it would be lost forever. Despite his misgivings, Yun Li did not hesitate at all. So as not to ‘lose’ himself a second time in a day, he struck forth with all his might, pitting his life with his utmost strength.\u003c/p\u003e\n\u003cp\u003eYun Li’s body leapt high into the air, a loud cry rang forth from his lips. A thick silver light covered him, as all four of his Gold-Green Cat’s Eye Elemental Jewels lit up together. His four Spatial Attribute skills once again focused on the Consolidated Equipment Spike in his hands as he sprang towards Lin TianAo’s left leg in this last strike.\u003c/p\u003e\n\u003cp\u003eAfter the shout, Zhou Weiqing stopped his rapid fire arrow. Focusing all his Heavenly Energy and channeling it out, two of his Alexandrite Cat’s Eye Jewels fell into the sockets of the Overlord Bow, but it was covered by the left hand gripping the bow.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s shout not only alerted Yun Li, but also gave Lin TianAo an advance warning. Narrowing his eyes, he unleashed all the skills on his shield, instantly increasing the defense of not just his body but the shield again. Even without using his eyes, he could sense the massive power built up behind him, and knew that Yun Li was about to unleash his final attack. He was also clear that if he could defend against this attack, Yun Li would be useless for the rest of the fight. Under such a circumstance, it would be worth it to expend as much energy as was required.\u003c/p\u003e\n\u003cp\u003eThe arrow was finally released from the Overlord Bow. In the very instant when Zhou Weiqing let go of the drawstring, the red robed man at the side suddenly clutched his ears as a massive ringing resounded. The next instant, he felt a sharp pain in his head, as everything in front of him turned blurry.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing would never expect that Tian Er’s aid for him was not against Lin TianAo, but instead to draw the attention of this judge and audience - the red robed man. This was to ensure he would not learn of Zhou Weiqing’s secret of the Alexandrite Cat’s Eye Jewel and his many powerful skills.\u003c/p\u003e\n\u003cp\u003eThis time, the arrow shooting forth was pitch black. Even stranger, there were squiggly bright blue lines twisting and turning on the black arrow.\u003c/p\u003e\n\u003cp\u003eDodging this was definitely impossible as they were just too close to each other. Not talking about dodging, Lin TianAo wasn’t even able to see the arrow at all.\u003c/p\u003e\n\u003cp\u003eAnother huge explosion rang out, the double explosive effect of archery skill and Overlord Bow once more striking the heavy shield, no different from the previous arrows. The explosive power of the arrow was naturally totally blocked by the shield. However, in the next moment, Lin TianAo’s expression changed.\u003c/p\u003e\n\u003cp\u003eAt the same time as he released the arrow, Zhou Weiqing’s right foot had slammed into the ground, and his body charged forward as well. The Tornado Strike had been activated, along with the boost of speed from his Demonic Right Leg, caused him to instantly reach Lin TianAo.\u003c/p\u003e\n\u003cp\u003eYun Li, who was behind Lin TianAo, was also given a big surprise, as he suddenly saw Lin TianAo, who was originally covered in the yellow Rock Armour, suddenly glow with a bright blue. An explosion followed soon after, and the entire Rock Armour actually disappeared.\u003c/p\u003e\n\u003cp\u003eNot just that, a dark black also stained Lin TianAo’s body, and a strange, eerie looking black symbol appeared above his head.\u003c/p\u003e\n\u003cp\u003eCurse - This was the Curse Skill. Yun Li immediately identified the black symbol above Lin TianAo’s head.\u003c/p\u003e\n\u003cp\u003eYun Li had already known about Zhou Weiqing’s Darkness Attribute after having lost to him earlier in the shop 77 when Zhou Weiqing had used the Blood Rites - Seal of Darkness on him. However, he had not expected Zhou Weiqing to also have one of the rarer skills of the Darkness Attribute, the Curse Skill.\u003c/p\u003e\n\u003cp\u003eThe Curse Skill was actually a type of Skill within the Darkness Attribute skills, basically a form of reverse-support, or more commonly known as debuff skills. Support skills were used to buff or boost the user, or their allies, while Curse skills would weaken their enemies. The type, amount and extent of weakening, the duration, all of that would determine how powerful the Curse Skill was. By the black symbol above Lin TianAo’s head which had an obvious three red lines, it was clear that this particular Curse Skill weakened three attributes, and was probably at least a powerful Nine Star Rating Darkness Attribute.\u003c/p\u003e\n\u003cp\u003eAs for why the various defensive skills active on Lin TianAo suddenly dissipated, Yun Li did not know why. However, no matter how it happened, all that mattered was that it was definitely beneficial to his own attack. No matter how strong or tough Lin TianAo’s personal defense was, if he did not have his skills active and he did not block Yun Li’s powerful attack, he would definitely be in trouble.\u003c/p\u003e\n\u003cp\u003eWhat Zhou Weiqing used was naturally an arrow with two skills due to the two sockets on the Overlord Bow, and the two skills were new skills that he had Stored when he entered the Fei Li City, and both were all considered support or control type skills.\u003c/p\u003e\n\u003cp\u003eThe Curse Skill was naturally a sort of support skill.\u003c/p\u003e\n\u003cp\u003eYun Li’s judgement was indeed accurate - the Darkness Attribute Skill was indeed a Curse Skill, and its name was the Curse of Doom. Its powerful effect was to weaken the opponent’s defense, attack and lastly to increase their sense of pain. This Skill was rather strange, the higher level it was, the shorter the duration, but the stronger the effect. At the first level, it lasted 12 seconds, and the three attributes were all weakened by ten percent. It was rather useless at that level, besides its long duration. However, every Jewel cultivation level that was added would increase the power of the curse by ten percent for all three attributes, but the duration would shorten by a second. As such, with three sets of Jewels, Zhou Weiqing’s Curse of Doom would weaken Lin TianAo’s defense, attack by thirty percent, and increase his sense of pain by thirty percent as well, for a total of ten seconds! This was extremely powerful indeed. In the future, if Zhou Weiqing ever became a twelve-Jeweled Heavenly Jewel Master, this skill could possibly bring his opponent’s defense to a negative, even if it was just for a second, it would be more than sufficient for any other skill to deal a heavy injury.\u003c/p\u003e\n\u003cp\u003eThe Curse of Doom was even rarer than the Skills that Zhou Weiqing had Stored from the Silver Emperor. He had been lucky that he had managed to Store this Skill as well, as under ordinary circumstances it was less than a 1 in 10000 chance that someone could manage to Store the Skill.\u003c/p\u003e\n\u003cp\u003eAs for the Skill that dissipated the Defense Skills on Lin TianAo, it was another powerful but niche support skills. This was the Lightning Attribute Skill, the Heavenly Lightning Shock.\u003c/p\u003e\n\u003cp\u003eIn most people’s eyes, the Heavenly Lightning Shock was another niche skill that was usually deemed useless despite its power. It did not have any attacking or damaging capabilities, and it had only one use - to dissipate skills. It only worked on Stored Skills, and also was similar to the Absolute Delay that it would never ‘level up’. That meant it would always last for 3 seconds no matter what cultivation level he was. Of course, at the same time, it was also another Absolute effect, and would definitely dissipate any Skill.\u003c/p\u003e\n\u003cp\u003eAs long as any Jewel Master was hit by the Heavenly Lightning Shock, any Skills they were in the midst of using, or was currently affecting them, would immediately be dissipated.\u003c/p\u003e\n\u003cp\u003eThere were two reasons why many Jewel Masters thought this skill to be niche and somewhat useless. First of all, it was only activated on touching the opponent’s body. The second was that although it could interrupt skills, it would not affect any that had already left the body. For example, if someone used a Fireball Skill which was already in mid air, and the Heavenly Lightning Shock was used on him, the Fireball would not dissipate. Furthermore, there was no other control provided by the Skill. Since Lightning Attribute Jewel Masters were very rare in the first place, and they were mostly known for their powerful damaging attacks, many would not choose this niche skill, and it was only rated at four stars. After all, every Jewel Master had a very limited amount of Skills, and who would pick a Skill that could only be useful in rare circumstances? Only someone like Zhou Weiqing, who had more than four times the usual skills most Jewel Masters had, could afford to do so.\u003c/p\u003e\n\u003cp\u003eIn truth, just like the Spatial Shackles, although the Heavenly Lightning Shock was niche, when used in the right circumstance, it could have an amazing god-like effect. This was just a perfect example - having it dissipate all three of Lin TianAo’s defensive skills, including the Rock Armour, right at the perfect timing. Although the Shield was able to weaken half of most support skills, it was not able to weaken this Absolute Skill! With the help of the Socket of the Overlord Bow, Zhou Weiqing was able to make use of it without being in close combat.\u003c/p\u003e\n\u003cp\u003eWith these two skills used in conjunction on Lin TianAo, although it wasn’t able to affect his shield, it did greatly lower the personal defense of his body.\u003c/p\u003e\n\u003cp\u003eStill charging in midair, Zhou Weiqing let loose another arrow. This time, it was only imbued with a single skill - Absolute Delay.\u003c/p\u003e\n\u003cp\u003eLin TianAo immediately felt a sense of impending doom. Just as he was about to spin his shield around, the Absolute Delay reached, and he felt his entire body slow down as it took effect, and the spin of the shield slowed to a crawl.\u003c/p\u003e\n\u003cp\u003eRight at the same time, Yun Li had reached Lin TianAo’s back, the glittering spike striking out at his leg.\u003c/p\u003e\n\u003cp\u003eA critical moment had finally arrived. If Lin TianAo took this full power blow from Yun Li without any defenses, it would be without question that he would lose the bet. Under such a circumstance, he had to use his last ace in the hole. The shield in his hand glowed brightly once more, and a thick layer of light immediately formed a shield around his back.\u003c/p\u003e\n\u003cp\u003eAnother huge explosion sounded out as Yun Li’s body flew back once more, rebounding heavily along with a ear-piercing shattering sound. The yellow light which blocked Yun Li’s attack also shattered, and Lin TianAo’s leg was clearly injured, with a deep bloody line. However, no matter what, Lin TianAo had not moved.\u003c/p\u003e\n\u003cp\u003eLin TianAo heaved a big sigh of relief. That last shield of yellow light was his last ace in hand, and was the strongest unique power of the five-Jewel Assembly Set Shield. It was called the Illusory Shield, and was basically an illusion of his shield that could appear in any nearby position according to his will. The illusion had a fifth of the defensive power of the actual shield, and it could only be used once every time he Consolidated the five-Jeweled Assembly Shield. Furthermore, to use it was a huge drain on his Heavenly Energy, and he only used it in his most desperate times to save his life. Naturally, this time it had done so once more.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-7-chapter-60-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-7-chapter-60-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-7-chapter-60-02","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
