{"id":51398,"no":224,"title":"Chapter 69 The Powerful Little Witch (1)","content":"\u003cp\u003e\u003cb\u003eChapter 69 The Powerful Little Witch (1)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eXiao Yan was a powerful five-Jeweled Heavenly Jewel Master, and when he put his entire life on the line to power this Skill, one could imagine the sheer power of it. Even the black clad girl who was a whole level higher than him could not dismiss it easily. After all, Xiao Yan’s teacher was the strongest Heavenly Jewel Master in the entire Fei Li Empire, a King Stage powerhouse!\u003c/p\u003e\n\u003cp\u003eAs Xiao Yan released his ten Heavenly Jewels, the colour of the Physical Jewels were totally overshadowed by his Elemental Jewels. As a Fire Attribute Heavenly Jewel Master, his Elemental Jewels were the blindingly brilliant Star Red Rubies. As compared to ordinary red rubies, the Star Red Rubies were brighter and more brilliant, at the same time they seemed to outline show the brilliant lines of a red star, and that was the reason for its name.\u003c/p\u003e\n\u003cp\u003eThe five Star Red Rubies seemed to explode, rising in flames behind the fire phoenix, and the already hot temperature continued rising, causing ripples in the air in the hundred metre radius.\u003c/p\u003e\n\u003cp\u003e“Blue Rain Hibiscus Mutabilis!” The black clad girl struck forward with her black-grey blade, at the same time crying out softly.\u003c/p\u003e\n\u003cp\u003eA large Hibiscus Mutabilis, glowing a brilliant blue, bloomed swiftly from behind her, and rays of blue light floated out like small rays of rain, looking soft and gentle, but as they flowed out, the increasing heat in the air slowed down to a standstill.\u003c/p\u003e\n\u003cp\u003e*Weng*\u003c/p\u003e\n\u003cp\u003eA huge buzzing sound roared out in a strange picture, as the thick flame met with the uncountable blue lights, intertwining with the fire phoenix which was flying towards the girl.\u003c/p\u003e\n\u003cp\u003eIt had to be known that this fire phoenix was made of pure energy, and was at an unbelievably high temperature! Yet, at that moment, for it to be able to be suppressed by the frail looking blue lights! At the same time, the black clad girl’s grey blade struck forward in an arc.\u003c/p\u003e\n\u003cp\u003eA bright flash ensued, before the air darkened as the fire phoenix scattered into innumerable bright glows. At the same time, the blue Hibiscus Mutabilis also disappeared slowly.\u003c/p\u003e\n\u003cp\u003e“You actually used your Flame of Life to attack me! Little Witch is getting angry!” The black clad girl pursed her lips, her entire person disappearing in a flash.\u003c/p\u003e\n\u003cp\u003eEarlier, the Flame of Life that Xiao Yan had unleashed had also been imbued with the Light Energy from Drunken Bao’s ‘‘Brilliant Light - Heaven and Earth’ Skill. Although this black clad girl who called herself Little Witch was extremely powerful, such a clash had taken its toll on her energy as well.\u003c/p\u003e\n\u003cp\u003eHowever, with Xiao Yan fainted, the situation had also turned dire for the Fei Li Battle Team. Currently, the only ones who were still able to fight was Lin TianAo, Little Four, Shangguan Bing’er and Crow.\u003c/p\u003e\n\u003cp\u003eAlas, facing Little Witch’s skill of turning into mist, their physical attacks would not be of much use. Their hearts sank rock bottom. None of them had expected for it to end like this for their entire team. After holding strong for three days, they had not been done in by the hordes of Heavenly Beasts, yet it looked like they would die at the hands of this young girl.\u003c/p\u003e\n\u003cp\u003eAs the black mist gathered once more, this time the target was Lin TianAo. The grey blade indistinct, appearing and disappearing in the midst of the black mist, like a vicious fang seeking and waiting for a chance to strike at any moment of weakness.\u003c/p\u003e\n\u003cp\u003eLin TianAo remained calm, his face cold and impassive. The five-shield Assembly Set slammed down onto the ground, as the five Elemental Jewels socketed in the middle lit up at once, covering him with a thick stony armour.\u003c/p\u003e\n\u003cp\u003eUnexpectedly, Lin TianAo suddenly closed his eyes. Without hesitation, the huge shield danced around in the air, as he moved his feet slowly, stably receiving Little Witch’s attack\u003c/p\u003e\n\u003cp\u003e*Ding* *Ding* Clashing sounds mixed with ear-piercing screeches of metal against each other rang out. The black mist was also slammed around by Lin TianAo, spreading and gathering constantly.\u003c/p\u003e\n\u003cp\u003eAt the same time, a loud cry sounded out. Little Four had been gathering his power the whole time, and at that moment he descended swiftly from the sky, his entire body enveloped in a thick silver light, making his entire body look like a huge silver ball of light. In a flash, he had joined the fight, making use of his swift movement to its maximum.\u003c/p\u003e\n\u003cp\u003eA blade grasped in hand, Little Four’s wings flapped swiftly, controlling his movement in the air, pouncing down to attack and swooping away. His entire person seemed like a silver whirlwind, slicing around and dancing about the black mist as he attacked at great speed.\u003c/p\u003e\n\u003cp\u003eLittle Witch could easily ignore ordinary physical attacks. However, she still had to respect Little Four’s attacks which were imbued with a massive amount of Spatial Energy, not to mention the minor buff from Drunken Bao earlier. Although her main focus was still Lin TianAo, the harassing attacks from Little Four definitely affected her as well.\u003c/p\u003e\n\u003cp\u003eCrow also took action as well. Knowing that her powerful melee attacks would be useless against the mist, she finally revealed her Elemental Jewels for the first time.\u003c/p\u003e\n\u003cp\u003eJust like Xiao Yan, Crow’s Elemental Jewels were the Star Red Ruby of the Fire Attribute. However, in terms of her Skills, she did not actually have any that were actually offensive, instead they were all support-types! Even so, she showed her true power on the path she had chosen.\u003c/p\u003e\n\u003cp\u003eThe two huge legendary axes actually flew into the sky, and it could clearly be seen that the two axes were actually attached to a bright red chain. The chain was about ten metres long, and under Crow’s control, they flew up and down as if part of her hands, swiftly changing positions and slashing at the black mist from various angles.\u003c/p\u003e\n\u003cp\u003eBy now, the legendary axes had turned a full fiery red. Crow’s strength was in close combat melee, and her Skills were all tailored to improve that. Her Fire Attribute Skills were all the rare Support Skills in the Fire Attributes, and they were certainly not used often. As for the chain, it was actually her Physical Jewel Consolidated Equipment, and was specialised to link to and control her Legendary Axes, imbuing them with the Support Skills.\u003c/p\u003e\n\u003cp\u003eCurrently, what Crow was using was one of the secret combat axe styles of the Gold Crow Tribe: Ten Thousand Beast Shatter Strike. This axe style had been used by their ancestors to great effect, killing many Heavenly Beasts. It could be used at a close distance or ranged combat, and it was extremely powerful.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er also took action. This time, she kept her bow and arrows, instead choosing to release her second Physical Jewel Consolidated Equipment, the socketed Wind Wielding Boots.\u003c/p\u003e\n\u003cp\u003eWith the boots on, Shangguan Bing’er with her Ultimate Agility was like a gust of wind herself, speeding around at insane speeds around the outer periphery. As she ran, she constantly kicked out a large Wind Blade, each made up of seven small wind blades. Although she did not have such a skill like Xiao Yan to compress all his Fireballs together, but the seven small wind blades were all close together, striking forward at the same time. Even though its offensive power was not great, it was still sufficient to harrass Little Witch.\u003c/p\u003e\n\u003cp\u003eAlthough Shangguan Bing’er was only at the three Jeweled cultivation level, with the socketed Wind Wielding Boots and her full power, her speed was even faster than lightning. Facing the various attacks from various directions, Little Witch could not catch deal with her easily.\u003c/p\u003e\n\u003cp\u003eIn that moment, the four remaining members of the Fei Li Battle Team surrounded Little Witch, attacking her from all angles with all their might. They knew that this was their last chance. As long as she managed to take down one more person, especially someone so important like Lin TianAo, then they would all be doomed.\u003c/p\u003e\n\u003cp\u003eWith the four of them using their full power, adding to that the Light Energy from Drunken Bao’s ‘‘Brilliant Light - Heaven and Earth’ Skill, it was certainly a deadly combination. Even a Zong Stage Heavenly Beast would not be able to deal with this easily.\u003c/p\u003e\n\u003cp\u003eHowever, Little Witch showed to them that human minds were definitely incomparable to ordinary Heavenly Beasts, at least humans which had such unique abilities like hers, such a powerful Heavenly Jewel Master.\u003c/p\u003e\n\u003cp\u003eFacing the attacks by all four of them, Little Witch was not flustered at all. All of a sudden, the black mist solidified, revealing her original form once more, and her left palm struck out at Lin TianAo’s shield.\u003c/p\u003e\n\u003cp\u003eAnother ear splitting explosion occured, and Lin TianAo’s expression changed as he took three steps back involuntarily. Another palm imprint appeared on his shield, even deeper than the previous one! Just as he caught his balance, fighting to deal with the Evil Aura that had invaded his body once more, the imprint on the shield suddenly exploded. The intense explosion was at such an opportune time that it not only destroyed an incoming attack from Shangguan Bing’er, it also caused Lin TianAo to get knocked back five more steps, causing him to spurt out a few mouthfuls of blood. His entire body turned cold as his face paled rapidly.\u003c/p\u003e\n\u003cp\u003eAfter striking out with the palm and knocking Lin TianAo back, Little Witch did not stop to admire the results. Without any hesitation, she moved swiftly, the grey short blade in her hands flickering out like lightning, striking thirteen times. Each of the strikes landed on the Legendary Axes, and it could clearly be seen that the fiery red light around the axes were slowly diminished as the grey light overtook it, before finally being overwhelmed with the grey light. That grey light then continued on through the chain, flowing down towards Crow. Even all the Energy that Crow had infused into the chain was not able to halt the progress of the grey light, and the axes fell down, smashing heavily onto the ground as Crow lost control.\u003c/p\u003e\n\u003cp\u003eRight at the same time, Little Witch spun on her feet like a black whirlwind, taking on Little Four’s onslaught. In a series of swift clashes, Little Four gave a strange cry, as he was slammed back nearly twenty feet before catching his balance again. Pausing, blood flowed out from his mouth, the Consolidated Wings behind his back vanishing. His face was grey and ashen, and the buff from Drunken Bao’s ‘‘Brilliant Light - Heaven and Earth’ Skill had been eliminated from him.\u003c/p\u003e\n\u003cp\u003eIn the short span of time, Little Witch had beaten back three of the team members. At that point, her beautiful face was stained in a red flush, as a brilliant blue light expanded outwards, and the Blue Rain Hibiscus Mutabilis appeared once more, floating in midair.\u003c/p\u003e\n\u003cp\u003eAt that moment, Shangguan Bing’er tried to retreat, but it was already too late. She felt that her entire body was surrounded by an icy cold aura, slowing her movements by a huge margin. Before she could react, her body had been engulfed by the blue light, freezing her in place.\u003c/p\u003e\n\u003cp\u003eLittle Witch twirled around in a half circle, the grey blade in her hands slashing down towards Shangguan Bing’er, and a grey light seemed to split the air between them. If Shangguan Bing’er were hit by this, she would undoubtedly perish immediately.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-8-chapter-68-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-8-chapter-69-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-8-chapter-69-01","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
