{"id":51437,"no":263,"title":"Chapter 82 Evolution! Demonic Change or Zhou Weiqing? (3)","content":"\u003cp\u003e\u003cb\u003eChapter 82 Evolution! Demonic Change or Zhou Weiqing? (3)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eSuch a circumstance should appear any time a Heavenly Beast evolved, and it was one of the restrictions on Heavenly Beasts growing stronger. Even one as powerful as herself, when she had evolved, she had attracted many Zong Stage Heavenly Beasts, even Little Witch had been attracted by the aura to come and cause trouble!\u003c/p\u003e\n\u003cp\u003eYet, Zhou Weiqing did not seem to have the same problem, and the Demonic Aura surrounding his body seemed to block off any external senses, not allowing anything from leaking into the atmosphere. In Fat Cat’s eyes, it only meant one thing - Zhou Weiqing’s evolving was even stronger than her own.\u003c/p\u003e\n\u003cp\u003eThat was to say, Zhou Weiqing was in a certain way evolving into a higher level species than herself!\u003c/p\u003e\n\u003cp\u003eThat was the thing that truly caused Fat Cat to be so puzzled. After all, as a Divine Heavenly Spirit Tiger, she was at the top of this world’s ‘pyramid’, and could be considered a Godly or Divine Beast, totally comparable or perhaps beyond humans. After all, they could reach the Heavenly God Stage!\u003c/p\u003e\n\u003cp\u003eYet, standing at the top of the pyramid, she still sensed Zhou Weiqing’s evolving was of a higher level than her… how could that be possible?\u003c/p\u003e\n\u003cp\u003ePuzzled, Fat Cat was left staring and unable to react for a moment. The only thing she was sure of meow was that currently Zhou Weiqing was giving off a very dangerous feeling, a feeling that a lower ranked Heavenly Beast felt from a Higher ranked Heavenly Beast… Perhaps even clearer than that.\u003c/p\u003e\n\u003cp\u003eWhen speaking of the rank here, it was not the cultivation level but rather the bloodlines. For example, Divine Beasts like the Divine Heavenly Spirit Tiger which could reach the Heavenly God Stage as compared to the ordinary Heavenly Beasts which could only reach the maximum of Zong Stage.\u003c/p\u003e\n\u003cp\u003eThe look of disbelief in Fat Cat’s eyes grew even stronger, as she muttered to herself. “No, that’s impossible. How can he be a higher ranked Heavenly Beast than myself?! He is clearly a human! Furthermore, in this world, there shouldn’t be any Heavenly Beasts with a higher rank!”\u003c/p\u003e\n\u003cp\u003eAlas, no matter how much she told herself that, she could not change the facts happening right in front of her.\u003c/p\u003e\n\u003cp\u003eAs the grey light extended throughout Zhou Weiqing’s body, his clothes slowly dissolved. Luckily, he had fallen onto the ground when he fainted, otherwise the bed sheets and mattress would probably have been dissolved by him as well.\u003c/p\u003e\n\u003cp\u003eAs the grey light grew stronger and thicker, from an inch to two, then three. By the time two hours had passed, there was barely a trace of spirit remaining in Zhou Weiqing’s eyes, and his entire body was frozen and numb like a stiff log, and the grey light surrounding him was almost one chi thick.\u003c/p\u003e\n\u003cp\u003eFat Cat could clearly sense that she would gain much from Zhou Weiqing’s evolving. However, at this point, she dared not approach. Even with her cultivation level and powerful bloodlines, she did not know what would happen when she closed in.\u003c/p\u003e\n\u003cp\u003eAs such, she could only wait and see.\u003c/p\u003e\n\u003cp\u003eAfter the grey light had extended to about one chi thickness, it stopped extending. The familiar black tiger tattoos then started appearing from below Zhou Weiqing’s skin, starting from his right leg before spreading to every inch of his body.\u003c/p\u003e\n\u003cp\u003eThe only difference from the previously was that the ‘King’ word on his forehead was no longer the original black colour, having turned a crystal-like, almost transparent grey.\u003c/p\u003e\n\u003cp\u003eIt was not a deathlike grey, but containing a strange sort of lively spirit. The grey ‘King’ word almost seemed like a unique eye, feeling and sensing everything around.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s bones were making weird creaking sounds, almost like little explosions. The grey light around him started to undulate in a rhythmic pattern; the greatest change being around both his arms, which were rapidly expanding.\u003c/p\u003e\n\u003cp\u003eAt first, Fat Cat could see the blood vessels below the skin of his arms expanding, the skin being forced outward by the pressure within, but slowly they were hidden beneath the bulging muscles.\u003c/p\u003e\n\u003cp\u003eIn a matter of moments, Zhou Weiqing’s arms already expanded to more than double its normal size, the thick black tiger tattoos twisting and turning as if a little boat in the frenzied seas, a power emanating from his arms. Zhou Weiqing’s body also started to move at this point.\u003c/p\u003e\n\u003cp\u003eAs the grey light seemed to form an air current lifting him up from the ground slowly, his left leg remaining on the ground while the right leg rose up in a strange arc, almost reaching his own head.\u003c/p\u003e\n\u003cp\u003eBesides his ‘male pride’ that Fat Cat could see, she was astonished to see that Zhou Weiqing’s entire right leg had turned a pitch black.\u003c/p\u003e\n\u003cp\u003eThe black right leg seemed warped, even his bones mutating as it extended in length by almost half a metre. Next, his right leg seemed to bend into a strange large hook. That instant when the hook formed, the grey light around Zhou Weiqing’s body seemed to have found a point to gather, and like a swarm of bees it converged upon his right leg. At this point, only Zhou Weiqing’s powerful arms were left supporting him on the ground.\u003c/p\u003e\n\u003cp\u003eAs a terrifying power emanated in waves from his body, his hands grew as well, his nails growing two inches as they radiated a powerful black and grey light, thick and strong.\u003c/p\u003e\n\u003cp\u003eThe Demonic Change. Without any question, Zhou Weiqing was currently in the midst of the Demonic Change.\u003c/p\u003e\n\u003cp\u003eYet, Fat Cat had witnessed his Demonic Change before, and this time it looked totally different.\u003c/p\u003e\n\u003cp\u003eSuddenly, Fat Cat understood. Currently, it wasn’t just Zhou Weiqing’s body which was evolving; even his Demonic Change was evolving!\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWhat is his cultivation level? Only Three Jewels, yet his Demonic Change is already evolving?! Furthermore, he hasn’t even trained his Demonic Attribute in any way!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eFat Cat suddenly felt as if her brain wasn’t working anymore, going numb. She just felt that she had just seen so many impossible things from Zhou Weiqing, and she wondered if all she knew was even true at all.\u003c/p\u003e\n\u003cp\u003eAs the time passed second after second, and minute after minute, Zhou Weiqing finally started regaining his consciousness. As the grey light flowed towards his right leg, he finally felt as if the intense cold around his body was subsiding.\u003c/p\u003e\n\u003cp\u003eCurrently, Zhou Weiqing’s raised right leg was glowing with the unbelievably thick grey light, enveloping it while spinning in a helix pattern, slowly permeating right into his leg.\u003c/p\u003e\n\u003cp\u003eAs the unbearable cold left, he was left with an aching and tingling sensation. Zhou Weiqing felt like his entire body, down to the bones, was constantly beset with wave after wave of strange aching pin-and-needles. A little itchy, yet a weird comforting sense. It was like the first time he had entered the Demonic Change, getting help from Shangguan Bing’er, and having his Heavenly Jewels Awakened and his blocked meridians widened and ‘opened’.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWhat happened? Didn’t I enter cultivation deviation?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe terror and dread in Zhou Weiqing’s heart slowly faded, replaced eventually by a sense of excitement. He could clearly feel as the numbness and ache diminished, a sense of power was filling him. That was especially so for his arms, where his large hands were now plunged deep into the tough floor.\u003c/p\u003e\n\u003cp\u003eA gentle light shone from Zhou Weiqing’s face, as his eyes opened and lit up in a bright spark. He felt as if the Attribute Wheel in front of his eyes was spinning uncontrollably as it changed from attribute to attribute.\u003c/p\u003e\n\u003cp\u003eHis three Heavenly Jewels were also constantly swapping attribute control - and they were invariably linked indeed.\u003c/p\u003e\n\u003cp\u003eAt first, the Attribute Wheels were moving too fast, but slowly, they slowed down, and he was able to look at them clearly.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was surprised to see that when the Attribute Wheel turned to the grey zone, his first Elemental Jewel seemed to have a claw like symbol, with a round hole in the center of the claw.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eCould that mean the Devour Skill?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eWhen a Skill was Stored, it showed on the Attribute Wheel; no matter which attribute the Skill was Stored on, it would appear on the corresponding Wheel of the corresponding Jewel.\u003c/p\u003e\n\u003cp\u003eFor example, for his first Elemental Jewel, the Darkness Attribute Skill Stored was his Touch of Darkness Skill. As such, when that attribute wheel moved to the black zone, he was able to see the symbol there, a black octopus with a strange purple border. That was the symbol representing the Touch of Darkness, and each of his other skills also had their own symbol.\u003c/p\u003e\n\u003cp\u003eBefore today, only the grey zone was completely unchanged; even the colourless zone of the Time Attribute had a symbol in the First Jewel; a symbol of a whirlpool, representing the Absolute Delay Skill.\u003c/p\u003e\n\u003cp\u003eHowever, at this point, the first Elemental Jewel’s grey zone, representing the Evil or Demonic Attribute, had actually finally gone through a change, with the additional claw symbol. What did that mean? Could it be that he could finally control the Devour Skill?\u003c/p\u003e\n\u003cp\u003eAs he thought up to that point, Zhou Weiqing’s heart started racing. He did not know what star rating that Devour Skill had, but he could clearly remember what had happened the first time he had used that skill in the Demonic Change state, forcefully destroying an entire huge pack of Forest Direwolves. More importantly, it had saved his life, and not only that, it had caused his cultivation level to shoot up.\u003c/p\u003e\n\u003cp\u003eAs Zhou Weiqing was both surprised and delighted, he suddenly realised that in the grey area of his second Elemental Jewel, there seemed to be a new symbol as well. That symbol was a round shape, totally grey. When the Attribute Wheel spun to the grey zone, a strange sight occurred.\u003c/p\u003e\n\u003cp\u003eA black light and a blue light seemed to swiftly invade into the zone, mixing with the grey and forming a grey, blue and black three-coloured ball.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWhat does that mean? \u003c/i\u003eZhou Weiqing was left confused.\u003c/p\u003e\n\u003cp\u003eFrom the colours, if they were attributes, the grey represented the Demonic Attribute, the black representing the Darkness Attribute, while the blue representing the Lightning Attribute. All three were attributes he had. \u003ci\u003eCould it be… Gods! Did that mean that this Skill actually required the fusion of three attributes?!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was suddenly gripped by a fiery joy as he thought up to that point. At that moment, a name suddenly appeared in his heart… “Dark Demon God Lightning”.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-10-chapter-82-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-10-chapter-83-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-10-chapter-82-03","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
