{"id":51602,"no":428,"title":"Chapter 141 Heavenly Emperor Disciple! (2)","content":"\u003cp\u003e\u003cb\u003eChapter 141 Heavenly Emperor Disciple! (2)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e“Alright, enough about that. Hurry up and eat, after that I want to see you run through all your Skills once, to see what abilities you have and Attributes, so I know how to guide you further.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing agreed, but deep inside he was a little doubtful. So what if he was a Heavenly Emperor Stage powerhouse? He was still confident that the Skills that he had Stored were incomparable to anyone of his generation, or even anyone of his level, even amongst those of the Great Saint Lands, though his Heavenly Energy might be slightly weaker. After Zhou Weiqing had gone through the Three-Thousand Tempering Training Technique for all his Skills, he was extremely confident that he had already reached the limit that a Heavenly Jewel Master could be at for his level. Even though Long Shiya was a Heavenly Emperor Stage powerhouse, he did not think that Long Shiya could teach him much.\u003c/p\u003e\n\u003cp\u003eAfter all, even his cultivation technique was the Immortal Deity Technique, a Technique that had even stunned the Heaven’s Expanse Palace. Of course, the danger it held was great, but with the bloodline of the Dark Demon God Tiger and the Solidified Dragon Spirit, that danger was already reduced to the lowest possible.\u003c/p\u003e\n\u003cp\u003eHowever, he would still listen to Long Shiya’s words. He wanted to know what this new teacher of his would be able to teach him. As such, he started to use his Skills one by one, and as he did so, he painstakingly controlled them as best he could, displaying his best to Long Shiya.\u003c/p\u003e\n\u003cp\u003eAs Zhou Weiqing and Long Shiya were in their tent, on the other side, the shock and surprise on Shangguan Fei’er and the others’ faces had not diminished yet.\u003c/p\u003e\n\u003cp\u003eMa Qun’s tolerance was the worst, and not long after Zhou Weiqing had been grabbed off by Long Shiya, he could not resist and asked Shangguan Fei’er in a low tone: “Lady Shangguan, who is this Six Ultimate Heavenly Emperor? Is he really that powerful?”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er glanced at him and said exasperatedly: “A Heavenly Emperor Stage powerhouse, what do you think, is he powerful or not?”\u003c/p\u003e\n\u003cp\u003eZhan LingTian’s brow was furrowed and he said: “It has been almost twenty years since the Six Ultimate Heavenly Emperor has been last seen in world, why would he appear here suddenly. Fei’er, it looks like we have to change our plans to enter the Ten Thousand Beast Heavens. We have to return to report the reappearance of the Six Ultimate Heavenly Emperor immediately, to allow the two Palace Masters to decide what to do. If he were to join hands with the Heavenly Snow Mountain, that would be much trouble.”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er shook her head and said: “The Six Ultimate Heavenly Emperor will not join hands with the Heavenly Snow Mountain. Didn’t you see that he was dressed in black? If not for the fact that he was against the Heavenly Snow Mountain, would he dress like that?”\u003c/p\u003e\n\u003cp\u003eMa Qun continued asking: “Isn’t the Six Ultimate Heavenly Emperor from one of the Great Saint Lands? Why does it seem like even the Heaven’s Expanse Palace is a little afraid of him?”\u003c/p\u003e\n\u003cp\u003eA complicated look crossed Shangguan Fei’er’s face, and she nodded slightly as she said: “Indeed, we are a little afraid of him. Let me explain why that is so. The Six Ultimate Heavenly Emperor is actually a self taught cultivator, and he does not belong to any Great Saint Lands or even any Sect at all. He has always been a solitary person. However, this person is one totally enamoured with cultivating and training, and he has never married anyone. To him, there is nothing else that he cares more than cultivating or fighting. His favourite thing to do is to travel the lands and challenge all powerhouses, and he once came to our Heaven’s Expanse Palace to do so.”\u003c/p\u003e\n\u003cp\u003eThis was an absolute secret of the Heaven’s Expanse Palace, and even Zhan LingTian did not know about it. After all, he was not of the direct bloodline of the Heaven’s Expanse Palace, and he couldn’t help but exclaim in surprise: “He has actually come to our Heaven’s Expanse Palace before? He challenged the First Palace Master?”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er gave a bitter smile as she said: “No, he did not challenge Big Uncle. When he came to the Heaven’s Expanse Palace, that was more than forty years ago. At that time, my Big Uncle was about the same age as I am now. The one he challenged was my grandfather.”\u003c/p\u003e\n\u003cp\u003eZhan LingTian exclaimed in shock: “He actually challenged the Old Palace Master?! What was the result?”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er gave another bitter smile as he said: “Their cultivation level was equal, and only with the Boundless Infinitum Set did my grandfather barely win him slightly. At that time, the Six Ultimate Heavenly Emperor did not even have an full completed set of God Tier Consolidated Equipment. Rumour is that ten years after that, he came once more to the Heaven’s Expanse Palace, but the result of that challenge is unknown. However, after that fight, my grandfather passed the Palace Master position to my Big Uncle before leaving to travel the world. Before he left, he told my Big Uncle this - ‘In terms of innate talent, I am no match for Fatty Long. In terms of effort and exertion, I have lost out even more.’ After that, my grandfather vanished, and we have not heard from him ever since, and we do not even know if he is still alive. This way, you should know how powerful this Long Shiya is right?”\u003c/p\u003e\n\u003cp\u003eHearing those words, all of them drew a deep cold breath. Clearly, during the second fight between this Six Ultimate Heavenly Emperor and the old Palace Master of the Heaven’s Expanse Palace, it had resulted in the former’s win.\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er said: “Big Uncle’s appraisal of the Six Ultimate Heavenly Emperor was that he was the first amongst all Heavenly Emperor Stage powerhouses. He also has another nickname, a Heavenly God amongst all Heavenly Emperor Stages. He is also the only person in the world who actually went up the Heavenly Snow Mountain to challenge the Heavenly Snow Mountain Lord and succeeded in coming out alive. Although he has never managed to break through to the Heavenly God Stage, it is unlikely that there are many in the entire continent that can defeat this Six Ultimate Heavenly Emperor on a one-on-one fight. Besides the Heavenly Snow Mountain Lord, the known top powerhouse in the world, even the leaders of the other Great Saint Lands cannot say with confidence that they can defeat him. Little Fatty becoming his disciple is definitely not a bad thing… I just never expected that we would meet him here.”\u003c/p\u003e\n\u003cp\u003eUnfortunately, Zhou Weiqing did not hear Shangguan Fei’er’s words, otherwise he would not think that Long Shiya, a man who was so immersed in cultivating for over a hundred years could not teach him. At that point, he was still in the tent, unleashing his Skills one by one to Long Shiya.\u003c/p\u003e\n\u003cp\u003eDue to the fact that many of his Skills were rather costly in terms of Heavenly Energy, Zhou Weiqing could only use a few before he needed to recover Heavenly Energy, and he would resume unleashing them after that.\u003c/p\u003e\n\u003cp\u003eLong Shiya sat there silently, watching him unleash his Skills unceasingly. He did not give any comment, allowing him to continue uninterrupted.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had to rest three times to full recovery before he managed to unleash all his twenty four Skills, with the exception of the Time Reversal Skill.\u003c/p\u003e\n\u003cp\u003e“Master, I’ll not use the Time Reversal Skill alright? This Skill is rather unique.”\u003c/p\u003e\n\u003cp\u003eLong Shiya nodded, before looking at his young disciple, who was looking rather pleased with himself. Finally, he said: “Do you think that your complement of Skills is very good?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing grinned and said: “It’s alright, my luck was quite good so I managed to Store some higher rated Skills.”\u003c/p\u003e\n\u003cp\u003eLong Shiya gave a humph and said: “Do you know what my rating for all your Skills are? Just two words… Totally Useless.”\u003c/p\u003e\n\u003cp\u003e“Besides the recovery speed of your Heavenly Energy being impressive, that cultivation method of yours is a waste of time and life. With such unbelievable talent, you are just walking on the wrong path.”\u003c/p\u003e\n\u003cp\u003e“Ahh?” Zhou Weiqing stared at Long Shiya with a gaping jaw. In his imagination, this new teacher of his should have praised him, yet the reverse had happened. He had so many powerful Skills, yet he had been deemed totally useless!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was not convinced, saying: “Teacher, these Skills of mine are still okay right? Most of them are rated seven or eight Stars, with some even able to produce the Heavenly Skill Image. If this is considered useless, then what can be considered good?”\u003c/p\u003e\n\u003cp\u003eLong Shiya gave a disdainful smirk and said: “Watch this.”\u003c/p\u003e\n\u003cp\u003eAs he said that, he lifted up his right hand, and a dim light appeared around his palm. It was a tiny Wind Blade, its entire body formed of a brilliant green, glowing brightly in an eye catching light. Although it was just a tiny wind blade, it seemed to shimmer with a slight gold aura, looking just like an actual blade, and Zhou Weiqing did not doubt the power of this Wind Blade.\u003c/p\u003e\n\u003cp\u003eThe miraculous thing was that as soon as this Wind Blade was unleashed, a shimmering image appeared slowly behind Long Shiya’s back. It was clearly a Heavenly Skill Image forming!\u003c/p\u003e\n\u003cp\u003e“Teacher, what is that Skill? A Heavenly God Tier Skill?” Zhou Weiqing asked curiously.\u003c/p\u003e\n\u003cp\u003eLong Shiya said: “Bullshit, what Heavenly god Tier Skill? This is a low level, one-star rated Wind Blade.”\u003c/p\u003e\n\u003cp\u003eA look of disbelief crossed Zhou Weiqing’s face as he said: “Teacher, although all my Skills are self learned and I did not have much proper teachings, I am still able to recognize a Heavenly Skill Image. If it is not a Heavenly God Tier Skill, how could there possibly be a Heavenly Skill Image?”\u003c/p\u003e\n\u003cp\u003eLong Shiya laughed coldly and said: “You little fool, look clearly at what my Heavenly Skill Image is before you speak.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing lifted his head to look. By this time, the shimmering green Heavenly Skill Image had fully formed behind Long Shiya, and the moment he lifted his head, Zhou Weiqing’s jaw dropped. The Heavenly Skill Image was actually the rotund, fat Long Shiya!\u003c/p\u003e\n\u003cp\u003e“This… this…” What appeared before his eyes was far beyond Zhou Weiqing’s experience and knowledge. How could one’s Heavenly Skill Image be of himself?! Could it be this teacher of his was actually a Heavenly Beast?\u003c/p\u003e\n\u003cp\u003eThe light flashed once more, and the Wind Blade in Long Shiya hands changed into a small tornado, swirling around in his palm. However, that Heavenly Skill Image behind his back did not change, still the green Long Shiya.\u003c/p\u003e\n\u003cp\u003eOnce again, a flash of light, and the green tornado abruptly changed into a fireball… a familiar fireball that was rated one star. This time, the Heavenly Skill Image behind his back changed to a red colour, but the form did not change, still that familiar rotund figure of Long Shiya.\u003c/p\u003e\n\u003cp\u003eThe little fireball turned into an ice spike, and the only change to the Heavenly Skill Image was once again its colour, from red to blue.\u003c/p\u003e\n\u003cp\u003eNext was the Earth Attribute’s Earth Spike, the Light Attribute’s Light Arrow, and the Darkness Attribute’s Corrosive Ball. They were all the lowest level Skills, one-Star Rated. Yet, the Heavenly Skill Image behind Long Shiya did not change, with only the colour shifting along with the alignment.\u003c/p\u003e\n\u003cp\u003e“Do you understand now?” Long Shiya smiled faintly, closing his palm, and all the light disappeared.\u003c/p\u003e\n\u003cp\u003e“Let me tell you, those Skills that I unleashed just now were all one-Star rated Skills. Yet, why are they all able to produce Heavenly Skill Images. More so, why is it a Heavenly Skill Image of myself? The reason is simple.. Their own rating is extremely low, definitely not a Heavenly God Stage Skill, yet when I use them they are at the Heavenly God Stage power. That is why, the Heavenly Skill Image is of me.”\u003c/p\u003e\n\u003cp\u003e“My Six Attributes are the six elements, Water, Fire, Earth, Wind, Light, Darkness. Do you know how many Skills I have Stored for them all in total?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-18-chapter-141-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-18-chapter-141-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-18-chapter-141-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
