{"id":51624,"no":450,"title":"Chapter 149 God Tier Consolidating Equipment Master Joins! (1)","content":"\u003cp\u003e\u003cb\u003eChapter 149 God Tier Consolidating Equipment Master Joins! (1)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eAs he said that, Duan Tianlang did not hesitate and was about to kneel down towards Zhou Weiqing. Looking at him, it was definitely no act, even his tears were falling down.\u003c/p\u003e\n\u003cp\u003eHow could Zhou Weiqing possibly dare to let him kneel and kowtow towards himself! He quickly knelt down first, grabbing hold of Duan Tianlang’s waist, preventing him from kneeling down.\u003c/p\u003e\n\u003cp\u003e“Senior Uncle, please don’t do that, I would not be able to take it! I’ll show it to you…” Zhou Weiqing said hurriedly.\u003c/p\u003e\n\u003cp\u003eBy this point, he could no longer care about conning Duan Tianlang, even feeling ashamed about wanting to do so. He could clearly tell that this Senior Uncle in front of him truly wanted the ‘Hate Ground no Set’ design so much that he was even willing to give his life for it, truly showing how much Consolidating Equipment Scrolls were to him. Towards powerhouses like him, sometimes their fame, reputation and face was even more important their lives, yet he was willing to kneel and kowtow to a junior like him. Zhou Weiqing’s heartstrings had indeed been tugged. Asking himself inwardly, he knew that he might not have such a stubborn love towards something.\u003c/p\u003e\n\u003cp\u003eWith that sense of respect, he agreed to show the legendary set design.\u003c/p\u003e\n\u003cp\u003eHearing Zhou Weiqing’s words, Duan Tianlang did not reveal any sense of delight. Instead, his body seemed to waver, his eyes rolling as he entered a trancelike state.\u003c/p\u003e\n\u003cp\u003eLong Shiya instantly saw that something was wrong, and in a flash he appeared behind Duan Tianlang’s back, pressing his palms to his back, a serious look on his face. An overwhelming Heavenly Energy was drawn in from all sides, surging into Duan Tianlang as Long Shiya slapped out with his palms consecutively, striking over a hundred palms onto Duan Tianlang’s back.\u003c/p\u003e\n\u003cp\u003eThese few years, because Duan Tianlang did not feel like there was anything left to live for, he had not controlled or taken care of his body, and his life force was almost empty. This was also the reason why his Long Shiya had taken so long to return; when he had found Duan Tianlang, he was on the verge of dying, and he had used his powerful Heavenly Energy to renourish Duan Tianlang’s body, dragging him back from the verge of death before bringing him back here. Of course, it was also because of the ‘Hate Ground no Handle’ set, otherwise Duan Tianlang might not have accepted Long Shiya’s aid. Sometimes, living a long time may not be something to be happy about. Previously, after he had helped Long Shiya complete the entire set of ‘Hate Sky no Handle, he no longer had any goals or targets to live for. In terms of creativity and design, he knew inwardly that he could not surpass his forefathers, and the only thing he could still think of was the ‘Hate Ground no Handle’ Legendary Set.\u003c/p\u003e\n\u003cp\u003eThis was the first time Zhou Weiqing had experienced a Heavenly Emperor’s power first hand, and as Long Shiya manipulated the Heavenly Energy, he felt as if the entire atmosphere was like a massive Devour Whirlwind, with Long Shiya as the center, everything surging towards him. Yet, this was not Devouring, but some sort of draw or attraction, as if in that instant the entire world was in his grasp.\u003c/p\u003e\n\u003cp\u003eThe hazed eyes of Duan Tianlang seemed to slowly recover as light began to return to them, and a faint white light rose from his skin. He slowly drew a deep breath, as long as whale whistling, drawing the immense Heavenly Energy that Long Shiya had drawn in into his own body before expelling his breath. Zhou Weiqing could faintly see that the breath he expelled out was a greyish colour.\u003c/p\u003e\n\u003cp\u003eWith a new lease of life breathed into Duan Tianlang, Long Shiya slowly put his hands down. “Old friend, don’t scare me like that. I spent so much effort to drag you back from the verge of death earlier, if you were to die now, could you be satisfied? The ‘Hate Ground no Handle’ design you’ve always hoped for is now in front of you!”\u003c/p\u003e\n\u003cp\u003eDuan Tianlang looked at Long Shiya, however his eyes did not have gratitude but a mild chagrin. “It’s all you old thing, if you didn’t drag me back from the brink, would I know about the ‘Hate Ground no Handle’ Legendary Set? Perhaps, I would already be reunited with your sister in law. Now, I’ll have to stay alive a few more years at least. Don’t worry, I will take care now. As long as I don’t want to die, even if hell tries to reach up and grab me, it won’t be that easy.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing took out the stack of designs and brought it in front of Duan Tianlang respectfully. He trusted Long Shiya, and also believed that the story he had told was indeed true. However, he did not take out all the designs, just nine of the pieces. He might respect Duan Tianlang and trust in his teacher, but without Huyan Aobo’s agreement he would not show everything.”\u003c/p\u003e\n\u003cp\u003e“Senior Uncle, this is nine out of ten pieces of the entire ‘Hate Ground no Handle’ Legendary Set design. I’m sorry, as I have not gotten permission from my Legacy of Strength teacher, I cannot let you see them all now. Once I meet up with Master Huyan again and get his permission, I will pass you the last design piece to see.”\u003c/p\u003e\n\u003cp\u003eDuan Tianlang nodded silently, his hands trembling as he took the nine design sheets from Zhou Weiqing’s hands, his eyes reddening.\u003c/p\u003e\n\u003cp\u003e“How many years has it been… more than a thousand years…Hate Sky no Handle… Hate Ground no Handle… finally they reunite. Thank you Weiqing, you have truly fully fulfilled this last wish of your Senior Uncle. I am already so old, but I have gathered much over all these long years. The materials required for the ‘Hate Ground no Handle’ Set is not that much different from that of the ‘Hate Sky no Handle’ Legendary Set, and I will try to complete this set for you. I only hope that the heavens grant this old man enough time to succeed… once I can see you wear the full set of the ‘Hate Ground no Handle’, then I can truly die in peace.”\u003c/p\u003e\n\u003cp\u003eHearing his words, Zhou Weiqing was overjoyed. This meant he would have a God Tier Consolidating Equipment Master by his side specially helping him to create his Legendary Set!\u003c/p\u003e\n\u003cp\u003eBefore Long Shiya could even remind him, Zhou Weiqing had knelt down on the ground with a soft thud, kowtowing three times towards Duan Tianlang, who smiled faintly as he accepted the obeisance.\u003c/p\u003e\n\u003cp\u003e“Child, I accept your obeisance not because of your thanks. The Legacy of Strength has been split apart for far too long, and as the Sixty First Sect Leader of the main branch Legacy of Strength, I ask that you return to the main branch, to reunite both branches and form a whole and complete Legacy of Strength.”\u003c/p\u003e\n\u003cp\u003e“Oei, oei, Old Duan, one must be honest and virtuous.” Upon hearing his words, Long Shiya immediately exclaimed anxiously. To him, Zhou Weiqing was even more important than a wife, and he was afraid that his precious disciple was about to be snatched away from him.”\u003c/p\u003e\n\u003cp\u003eDuan Tianlang gave a soft smile and said: “Alright, Fatty Long, don’t give me that. Would I really steal your disciple? However, you also have to admit that Weiqing is part of my Legacy of Strength right? Although I am not taking him as an official disciple, I will still pass down all my knowledge as a Consolidating Equipment Master. Whether or not he has the time and energy to learn it, that will be his business.”\u003c/p\u003e\n\u003cp\u003eLong Shiya stared at him with jaw agape before saying: “Old Duan, when have you become so shameless?”\u003c/p\u003e\n\u003cp\u003eDuan Tianlang laughed heartily, carefully keeping the designs in his hands. “What do you mean shameless? I am teaching him everything I know, whether or not he chooses to master it is his business, how is it shameless? I can’t be bothered about you old thing. Okay, Weiqing, come help your Senior Uncle find a place to rest. I must take a bath and burn incense [1. Literal translation, basically a ‘ritual’ to prepare oneself] in preparation first before I take a good look at the brilliance of the ‘Hate Ground no Handle’.” As he spoke up to that point, his eyes gleamed with a brilliance, the sudden burst of aura no lesser than Long Shiya.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing quickly pulled his Single-Horned Ghost Demon Horse from the side, letting Long Shiya and Duan Tianlang mount it. Although Long Shiya was extremely large, Zhou Weiqing’s Ghost Demon Horse was truly a magnificent steed, and had no problems carrying both of them. He himself followed by the side of his Ghost Demon Horse, circulating his Heavenly Energy as they headed towards the direction the Peerless Battalion had left.\u003c/p\u003e\n\u003cp\u003eDue to the speed of the horse carts with all their gear, the Peerless Battalion was travelling at a much slower pace. Before long, Zhou Weiqing and his two teachers had caught up with the main group. Naturally, at that point, someone let him have a Ghost Demon Horse to mount on as well; as the Battalion Commander, it wouldn’t do for Zhou Weiqing to be running all the way along.\u003c/p\u003e\n\u003cp\u003eAs for Long Shiya and Duan Tianlang, they naturally drew many curious gazes. Riding on the Ghost Demon Horse, Long Shiya appeared drowsy and about to fall asleep, while Duan Tianlang looked to be deep in thought, neither of them seeming to care about anything happening around them.\u003c/p\u003e\n\u003cp\u003eIt did not take the entire troop long to reach close to the front of the northern army encampment. Of course, with so many gathered at once, they were stopped by the patrols, and Zhou Weiqing took out the plaque that Shen Ji had given him to get the patrolling soldiers to report back. In a jiffy, a group of riders could be seen coming from the Seventh Legion.\u003c/p\u003e\n\u003cp\u003eAt this point, the Peerless Battalion soldiers had already kept all their titanium alloy mail, and were only dressed in their army uniforms. Zhou Weiqing did not want to reveal all his secrets so easily, especially such expensive equipment… even in the entire ZhongTian Empire, not a single army unit could be as well geared as the Peerless Battalion.\u003c/p\u003e\n\u003cp\u003eThe one in front of the incoming riders was familiar to him, though her facial expression was not kind. It was the Regiment Commander Shen Bu, with her sister Shen Yi by her side. For the two sisters to see Zhou Weiqing, how could their expressions be nice. If not for Shen Ji giving them strict orders, they probably wished they could beat Zhou Weiqing up.\u003c/p\u003e\n\u003cp\u003e“Ohh, isn’t this Regiment Commander Shen Bu? How do you do, how do you do, how could I trouble you to come all the way to receive us?” Seeing Shen Bu, Zhou Weiqing felt rather amused, knowing that the enmity between them would not be so easily resolved.\u003c/p\u003e\n\u003cp\u003eShen Bu dismounted, heading towards Zhou Weiqing as she said coldly: “I have orders from Seventh Legion, Legion Commander Shen Ji to receive Battalion Commander Zhou. He has given the order that your First Special Battalion will camp right beside my Sixteenth Regiment. The space has already been cleared for you, and you all can head there to set up your camp.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing gave her a salute with palm in hand and said: “Thank you very much.”\u003c/p\u003e\n\u003cp\u003eAlthough his words were of thanks, his expression was rather indifferent. Shen Bu already knew that they had changed names to the Peerless Battalion, yet she had emphasized the old name of First Special Battalion, clearly mocking them about still being the Ruffian Battalion, and Zhou Weiqing did not see the need to give her a good expression in return.\u003c/p\u003e\n\u003cp\u003eShen Bu turned her horse around and said: “Alright, then follow me. Battalion Commander Zhou, I do need to remind you that this is the main northern army encampment. Please keep your soldiers in check, otherwise the military criminal code will still have to come in effect.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed heartily and said: “Do not worry about that Regiment Commander Shen Bu, as long as the female soldiers from your Sixteenth Regiment do not come looking for men here, our Peerless Battalion soldiers will behave themselves!”\u003c/p\u003e\n\u003cp\u003eHis voice was not soft, and laughter instantly erupted around him. These ruffian soldiers of the Peerless Battalion had camped in the north, climbing their way through the threat of death, and they would not be afraid of anyone.\u003c/p\u003e\n\u003cp\u003e“You!” Shen Yi was about to have a fit of anger, but she was quickly restrained by Shen Bu, who turned to glare coldly at Zhou Weiqing before mounting up and heading towards the main camp.\u003c/p\u003e\n\u003cp\u003eThe Peerless Battalion was situated right between the Sixteenth and Seventeenth Regiments, and it was clear that the area had been specially cleared out for them. However, though the area had been cleared out, there was still much rubbish there. Although there was no smell due to the bitter winter cold, it was still an uncomfortable thing to look at.\u003c/p\u003e\n\u003cp\u003eShen Bu acted like she did not see all the rubbish, saying impassively to Zhou Weiqing: “Please camp here Battalion Zhou, I will be heading off then.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was still smiling as he said: “Alright then, Regiment Commander Shen Bu, I shall not send you off then.”\u003c/p\u003e\n\u003cp\u003eShen Bu ignored him, leading Shen Yi and her personal guards to turn and leave.\u003c/p\u003e\n\u003cp\u003e“Boss, what do we do?” Wei Feng sidled closer to Zhou Weiqing and asked.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said calmly: “Do you still need to ask? This is an army camp, not a rubbish dump. Whoever these belong to, just throw it back to them.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-19-chapter-148-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-19-chapter-149-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-19-chapter-149-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
