{"id":51706,"no":532,"title":"Chapter 178 Phelia\u0027s Approval! (2)","content":"\u003cp\u003e\u003cb\u003eChapter 178 Phelia\u0027s Approval! (2)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eOf course, the chances of that happening were minuscule. With Long Shiya’s experience, how could he not see the approval that Xue AoTian held for Zhou Weiqing. Otherwise, with his status and power, he need not even give Zhou Weiqing the chance to compete.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, Long Shiya forced himself to calm down, though he kept his guard up and senses extended to the max. If he sensed anything amiss, he would definitely take action first.\u003c/p\u003e\n\u003cp\u003eAs Xue AoTian sent wave after wave of Divine energy into Gu Yingbing’s body, his wounds slowly mended and his spirit also recovered slightly. However, he eyes were currently filled with a conflicted expression. Without question, he had lost at this last round of the test. Up until now, Zhou Weiqing was still withstanding the pressure. Furthermore, when Zhou Weiqing had actually entered the Dragon-Tiger Transformation, he had already left the suppression area and clearly sensed it. Power aside, the patience and thought behind Zhou Weiqing’s actions caused Gu Yingbing to be filled with alarm.\u003c/p\u003e\n\u003cp\u003eThere were still two more competitions ahead, and as his Master had said, Zhou Weiqing had to defeat him in all three before he could claim victory. Currently, Gu Yingbing truly wanted to know what the contents of the next two tests were, and the one he hoped for most was a direct confrontational clash with Zhou Weiqing. Only then did he feel that he could grasp victory in his hands. After all, in terms of cultivation level, he was still so far ahead of Zhou Weiqing, almost an insurmountable gap between them. No matter how powerful and pure his bloodline was, he would not be able to fully bring it into play in an actual fight.\u003c/p\u003e\n\u003cp\u003eIf those were the terms of fighting, Gu Yingbing was still confident in his own victory.\u003c/p\u003e\n\u003cp\u003eJust as the others were still nervously lost in their own thoughts, all of a sudden, the entropic barrier dissipated. The Entropic Nether Tiger Phelia had already disappeared, leaving on Zhou Weiqing sitting there cross-legged in a meditative position.\u003c/p\u003e\n\u003cp\u003eCurrently, Zhou Weiqing was sitting there with his eyes closed, his face peaceful. The Dragon-Tiger Transformation had already vanished, though his upper body was naked, showing his solid bronzed muscles.\u003c/p\u003e\n\u003cp\u003eWithout Phelia’s shield covering Zhou Weiqing, Long Shiya could instantly sense his condition. Seeing his disciple was fine, he heaved a sigh of relief.\u003c/p\u003e\n\u003cp\u003eTurning his gaze to Xue AoTian, he said: “Old Monster Xue, the outcome of this first test is very clear right, you should proclaim it now.”\u003c/p\u003e\n\u003cp\u003eXue AoTian nodded his head and said: “Very well, as you all have seen, the first round of overwhelming with aura, the results are out. Zhou Weiqing has lasted longer in the tenth round, so he is the victor of the overall competition. I will give you both another two hours to rest and recover before we start on the next test.”\u003c/p\u003e\n\u003cp\u003eTowards Xue AoTian’s proclamation, the Lion King Gu Site was not able to say anything. The outcome had been very clear to everyone’s eyes, and if he tried to argue it would be beneath his status. Furthermore, there were still two more rounds. However, his feelings were no longer as relaxed as they had been earlier. Zhou Weiqing’s showing had proved that he could be of actual threat to Gu Yingbing.\u003c/p\u003e\n\u003cp\u003e“Mountain Lord, while bloodline and aura suppression is important, actual combat is the most important to any Heavenly Jewel Master. For the second test, shouldn’t they compete in actual combat?” Gu Site asked Xue AoTian curiously. His thinking was the same as Gu Yingbing, that it would be faster and more direct to just defeat Zhou Weiqing in a face to face clash.\u003c/p\u003e\n\u003cp\u003eAlthough Zhou Weiqing had the Six Ultimate Heavenly Emperor as his Master, Gu Yingbing also had the strongest powerhouse in the entire world as his Master, the Heavenly Snow Mountain Lord. Even if their fighting skills were similar, or with Zhou Weiqing’s slightly higher, but the difference in cultivation level was too huge that no amount of talent or skills could overcome. Actual combat was very different from aura suppression and overwhelming after all.\u003c/p\u003e\n\u003cp\u003eXue AoTian nodded and said: “That is correct. The second test is actual combat.”\u003c/p\u003e\n\u003cp\u003eHearing those words, Gu Site finally smiled once more. Long Shiya did not say anything; he knew that since he dared to bring Zhou Weiqing here, there was no avoiding some fighting. Towards Zhou Weiqing, this would be his most difficult test, and the most important as well. If he wanted to go home with his girl, he had to pass this round as well, otherwise everything else was false.\u003c/p\u003e\n\u003cp\u003eIn truth, Long Shiya was not sure whether or not Zhou Weiqing could succeed, but he wanted to give his precious disciple a chance. After all, one could lose a fight, it was just a matter of your skill being below your opponent for now, and he had the confidence he could still bring his disciple back down safely. Having the courage to fight for yourself was the most important thing. In any case, at least from the way things were going, it was still relatively smooth sailing. However, this next test would be a critical point ahead.\u003c/p\u003e\n\u003cp\u003eTime passed, minute after minute. No one else knew what had happened between Zhou Weiqing and the Entropic Nether Tiger Phelia in the last round, but they could all sense that his Heavenly Energy was still brimming. Sitting there cross legged, it seemed like like he had already recovered from the previous test, perhaps just some fatigue in terms of spirit.\u003c/p\u003e\n\u003cp\u003eThe bloodline of Dragon and Tiger… was this bloodline of that unknown black tiger fused with the Solidified Dragon Spirit so strong? Even the Entropic Nether Tiger was not able to fully suppress him. That only meant one thing - just in terms of bloodline quality alone, Zhou Weiqing’s bloodline was already above that of the Entropic Nether Tiger, and naturally that also meant that it was superior to both the Divine Heavenly Spirit Tiger and Heavenly Divine Earth Spirit Lion bloodlines. One could imagine what a shocking news that was! Towards Zhou Weiqing, all the powerhouses present had a fresh recognition towards him.\u003c/p\u003e\n\u003cp\u003eTwo hours passed very quickly. Previously when Xue AoTian was speaking out the time for their rest, both Zhou Weiqing and Gu Yingbing could clearly hear it. Although Gu Yingbing was injured, his spirit somewhat damaged by the invasion of the entropic field, but under Xue AoTian’s healing and the two hours of rest, he had pretty much recovered back to his prime state.\u003c/p\u003e\n\u003cp\u003eGu Yingbing stood up once more. Currently, this Lion Prince was once again filled with a powerful fighting intent. He had not expected to lose the first round, but he would not allow himself to lose again this time. Otherwise, even if he finally won the third test, he would not be able to live with himself as it would be an overall loss in his eyes. How could he live up to his name as the Lion Prince? Furthermore, Zhou Weiqing was more than ten years younger than he was! If he could still lose, then in the near future as that fellow grew stronger, could he have a chance?\u003c/p\u003e\n\u003cp\u003eFilled with all sorts of complicated thoughts, Gu Yingbing’s fighting spirit was fuelled to the maximum.\u003c/p\u003e\n\u003cp\u003eOn the other side, Zhou Weiqing had slowly gotten up from the floor. His eyes had returned to their normal black colour, looking as if he was totally fine, and he had not just been aura suppressed by the Entropic Nether Tiger.\u003c/p\u003e\n\u003cp\u003eHowever, the one most familiar with Zhou Weiqing, Long Shiya, could tell from the details that Zhou Weiqing’s eyes had some changes. An additional calm and tranquility, and a hint of joy within as well. Seeing that, Long Shiya finally relaxed. With Zhou Weiqing’s intelligence and wit, he would not be taken advantage of so easily, and if he had been, then he would not have such a look in his eyes. It was clear that the future mother in law had given him some benefits. Furthermore, he could judge from it that the one Phelia had chosen was clearly Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eAlthough this was the first time Long Shiya had met Old Monster Xue’s wife, he could just imagine how much feelings Xue AoTian must have for her. Twenty years apart! Without question, Phelia would have a great influence on him, and if this future mother-in-law had approved of Zhou Weiqing, then his chances would increase greatly.\u003c/p\u003e\n\u003cp\u003eXue AoTian motioned Zhou Weiqing and Gu Yingbing to come before him. As they did so, Xue AoTian said solemnly: “The first test was on your personal potential and bloodline power.”\u003c/p\u003e\n\u003cp\u003e“Zhou Weiqing is the victor for the first test, but there are two more tests to go. Now, for the second competition, it will a test of your actual fighting capabilities. If either of you want to marry my daughter, you will need to have the ability to protect her.”\u003c/p\u003e\n\u003cp\u003e“This fight will not between the two of you. After all, you are more than ten years apart in terms of age, and your cultivation level gap is large too. If it is just a fight between the two of you, then it will be too unfair to Zhou Weiqing.”\u003c/p\u003e\n\u003cp\u003eHearing Xue AoTian’s words, the Lion King Gu Site was anxious. Taking a hurried step forward, he said: “Mountain Lord, that isn’t good right? Although his age is younger, he was the one who came here to snatch the bride. You said it yourself earlier, Yingbing deserves to have an advantage right.”\u003c/p\u003e\n\u003cp\u003eXue AoTian’s face darkened. “Lion King, do you think that my disciple is not able to win a fight under fair circumstances?”\u003c/p\u003e\n\u003cp\u003eAlthough Gu Site was the King of the WanShou Empire, and his character had always been strong, in front of Xue AoTian he dared not be too impetuous. His face changed several times, before he sighed softly and said: “As the Mountain Lord instructs.”\u003c/p\u003e\n\u003cp\u003eXue AoTian continued passively: “This second test, Bro Long, you and the Lion King will be participating. For fairness sake, you will each be testing Zhou Weiqing and Gu Yingbing. Bro Long, you will be testing Yingbing, the Lion King will test Zhou Weiqing. In this way, there will not be any unfairness.”\u003c/p\u003e\n\u003cp\u003eThe Lion King Gu Site was still having a vexed look on his face a moment ago, but he started upon hearing that, and joy replaced it. He thought to himself: “The heavens are with me. Hmph, for this King to take care of that little brat, won’t it be a simple task?”\u003c/p\u003e\n\u003cp\u003eLong Shiya’s expression grew ugly. Although he did not think that Gu Yingbing could defend against himself for long, but with Zhou Weiqing at the six-Jeweled cultivation level, it was even worse for him against the Lion King Gu Site! How could they possibly compete like that?”\u003c/p\u003e\n\u003cp\u003eXue AoTian said: “My words are not done, both of you do not need to be so anxious. In order to properly test their power, I will be binding both your powers. I will use a Sealing Skill to restrict your Heavenly Energy… once the Heavenly Energy you use goes beyond my Seal, then it will be breaking the rules, and that means the disciple or son of your side will be considered to have lost. If that does not happen, then whoever loses first between Zhou Weiqing and Gu Yingbing will have lost the fight.”\u003c/p\u003e\n\u003cp\u003eHearing his words, Long Shiya’s expression settled. “Old Monster Xue, to what levels will you be restricting our cultivation level during the fight then?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-22-chapter-178-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-22-chapter-178-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-22-chapter-178-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
