{"id":51735,"no":561,"title":"Chapter 188 Powerful Peerless Seven Hundred! (2)","content":"\u003cp\u003e\u003cb\u003eChapter 188 Powerful Peerless Seven Hundred! (2)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eSeeing Zhou Weiqing’s actions, Xiao Yan’s face changed slightly. Just as he was about to follow suit, he was suddenly stopped by Lin TianAo who had grabbed his wrist. As he lifted his gaze to look, he saw Lin TianAo’s strict and fierce piercing look.\u003c/p\u003e\n\u003cp\u003e“Weiqing, no! It’s all my fault, if you want to blame someone blame me!” With a sudden thud, Xiao Yan knelt down on the ground, gritting his teeth as he looked towards Zhou Weiqing, his face filled with shame.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing started in surprise, turning to look at Lin TianAo. Seeing the fury in Lin TianAo’s eyes, he suddenly understood. All of them had misunderstood him.\u003c/p\u003e\n\u003cp\u003eIndeed, although Zhou Weiqing had never been together with Difuya, she was still his fiancee in name. From Difuya and Xiao Yan’s actions and expressions, it was clear that they had a special connection. Yet, to ‘steal’ a brother’s wife, that was something that was truly shunned.\u003c/p\u003e\n\u003cp\u003eAn idea sparked in Zhou Weiqing’s heart, and he suddenly turned to Xiao Yan, his gaze cold, but he did not say anything.\u003c/p\u003e\n\u003cp\u003eNormally, Xiao Yan was quiet and did not speak much, but currently he was choking on his words as he wept: “It’s all my fault, Weiqing, I was the one who fell for Her Highness. It is not her fault, please blame me instead. Nothing has happened between us… I…”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said passively: “Xiao Yan, you are truly a good brother of mine!”\u003c/p\u003e\n\u003cp\u003e“Don’t blame him! I was the one who fell for him!” Difuya somehow garnered the courage, abruptly moving in front of Xiao Yan, standing in front of Zhou Weiqing with her arms spread open, just like a mother chicken protecting her chicks.\u003c/p\u003e\n\u003cp\u003eTears rolled from her cheeks as she said angrily: “What right do you have to judge us? Just because you are my fiance? I have never agreed to that, and even if you are, we have been here for so long… have you even come to see me once? Big Bro Xiao Yan is here to take care of me everyday, he is a good person.”\u003c/p\u003e\n\u003cp\u003e“If you have the ability, just kill me, it has nothing to do with him. I have always encouraged him to look for you to lay our cards on the table, but all this time he has not been willing to accept me fully. It is all because of you, because of you! Kill me if you wish!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing gave a cold humph and said icily: “That is to say, you are willing to die for him?”\u003c/p\u003e\n\u003cp\u003eDifuya started momentarily, a look of disbelief flashing in her eyes. “You really want to kill me? I am the Princess, you are my subject. What right do you have?!”\u003c/p\u003e\n\u003cp\u003eA mocking look crossed Zhou Weiqing’s face as he said: “You still remember you are a Princess? Besides losing yourself in love, do you still remember that your Father is Sealed in the Heavenly Bow City? Princess… very good… very good.”\u003c/p\u003e\n\u003cp\u003eDifuya’s face turned white. All of a sudden, she yelled in rage: “I am just a woman, is it wrong for me to want a home? To want someone to love me and take care of me? Why must you keep following me like a devil! Kill me then! As long as you let Big Bro Xiao Yan go, kill me. I am willing to die for him.”\u003c/p\u003e\n\u003cp\u003e“No! It is all my fault. Weiqing, kill me instead, she is the Princess of your Heavenly Bow Empire! You can’t take action against her.” Xiao Yan forcefully tore away from Lin TianAo’s grasp, rushing towards Zhou Weiqing and pulling Difuya behind his back.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing swept his gaze coldly across the two of them, before he turned to Difuya, saying: “Xiao Yan does not need to die, and I can spare your life as well. However, from now on, you have to listen to all my orders. If you can do that, I will spare both of you.”\u003c/p\u003e\n\u003cp\u003e“I’m willing!” Difuya agreed without hesitation.\u003c/p\u003e\n\u003cp\u003eSeeing the resolution in her eyes, Zhou Weiqing was finally unable to continue acting. A faint smile appeared on his face and he said: “It looks like the passage of time, and the destruction of our Empire had truly allowed you to grow up at last. At least, you know how to bear responsibility for your actions. Although you are still that stubborn princess, not able to contribute to the Empire, but at least the current you I no longer bear any enmity.”\u003c/p\u003e\n\u003cp\u003eHearing Zhou Weiqing’s words, Difuya started, not understanding what he meant at all.\u003c/p\u003e\n\u003cp\u003eOn the other hand, Xiao Yan understood slightly. After all, he wasn’t as naive or sheltered as Difuya. “Weiqing, you… you…”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed heartily and said: “Stand up. Congratulations you both. However, Bro Xiao Yan, I must warn you that Difuya is not a good tempered woman, you will have your work cut out for you in the future. Anyway, just like how she has never thought of me as her fiance, I have never thought of her as my fiancee. At least, you both were able to hold yourselves back before I agreed, and she is also willing to die for you. With that, I can set my mind at ease to have you two together.”\u003c/p\u003e\n\u003cp\u003e“You were fooling around with us?!” Difuya’s eyes widened.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing smiled faintly and said: “As your fiance, shouldn’t I test you both first? Do not forget what you agreed to just now. Anyway, the important thing for us to do now is to annul our the betrothal between us. Otherwise, if Master Hua Feng and the other teachers see that you have betrayed that betrothal, they won’t be as nice as I am.”\u003c/p\u003e\n\u003cp\u003eAs he said that, Zhou Weiqing took out a piece of parchment and pen from his Spatial Ring, writing a simple contract of annulment. Signing his name, he passed it to Difuya.\u003c/p\u003e\n\u003cp\u003eSeeing Zhou Weiqing do all this, Difuya was stunned momentarily. Without knowing why, a small but strange sense of loss came over her for a while. Although she had not seen how Zhou Weiqing had built up the Peerless Battalion, but from the discussions of the others, she knew how much Zhou Weiqing had proven himself. Looking at his stern and resolute face, she did not know if she had made the right choice.\u003c/p\u003e\n\u003cp\u003eSeeing the contract of annulment in front of her, Difuya gave Zhou Weiqing a complicated look before taking the pen and parchment, adding her signature to it.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing heaved a sigh of relief, he had at least solved a big problem he had always had.\u003c/p\u003e\n\u003cp\u003eThis way, even after he rescued his godfather from the Seal, he wouldn’t be able to blame him! After all, this was Difuya’s own choice. If that Princess had really stuck to him, Zhou Weiqing would have no choice. After all, his godfather had been Sealed, and she was the only remaining Royal Family outside. What else could he do? Now, all issues had resolved themselves peacefully.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing carefully kept the contract in his hands and smiled, saying: “Alright, you guys pack up. Follow me.”\u003c/p\u003e\n\u003cp\u003eDifuya’s expression tightened and she looked at Zhou Weiqing warily. “What, what are you doing?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said exasperatedly: “In your eyes, am I such a monstrous fellow? Relax… for godfather’s sake, I couldn’t possibly do anything to you. Besides losing yourself in love, it is time for you to contribute to the Empire. Our grand plan to revive our Empire is beginning. As the only remaining Royal Family, you will have to be the figurehead of our revival plan. Come on, Your Highness.”\u003c/p\u003e\n\u003cp\u003eDifuya looked at Zhou Weiqing in shock: “Reviving our Empire? Did you say reviving our Empire? How is that possible? Are you just sending me to my death?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing looked at her speechlessly: “You are still that brainless bimbo! I truly don’t know how Xiao Yan can fall for you. Enough rubbish. Hurry up and come with me, don’t make me have to force you.” As he said that, Zhou Weiqing turned and left.\u003c/p\u003e\n\u003cp\u003eUp until now, Xiao Yan was still in a daze. Subconsciously, he looked towards Lin TianAo, a pleading look in his eyes.\u003c/p\u003e\n\u003cp\u003eLin TianAo glared at him coldly. “You are really my good brother.” After saying that, he also turned to leave, following behind Zhou Weiqing. Although Zhou Weiqing said he did not mind, Lin TianAo could not possible feel the same. He was the one who had introduced Zhou Weiqing to Xiao Yan and brought him along, yet Xiao Yan had now stolen Zhou Weiqing’s fiancee. How could he feel good about that?”\u003c/p\u003e\n\u003cp\u003eDifuya looked at Xiao Yan nervously: “What do we do?”\u003c/p\u003e\n\u003cp\u003eXiao Yan sighed and said: “Follow Weiqing’s words.” The two of them returned to their rooms to pack up.\u003c/p\u003e\n\u003cp\u003eLin TianAo stood behind Zhou Weiqing’s back. He sighed and said: “I’m sorry, Weiqing. It is my fault for not paying attention, I never thought…”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed heartily and said: “Big Bro, it is okay, I really do not mind. To be honest, Difuya is just a burden to me. It is great that Xiao Yan is helping me take care of this burden. I do not blame him at all. Love comes after spending time together, that I can understand.”\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, Lin TianAo did not know what to say. In his eyes, even though Zhou Weiqing said he did not mind, but no matter for any man who met something like this, how could he really not mind?\u003c/p\u003e\n\u003cp\u003eIn truth, Zhou Weiqing really did not think much about this. In fact, he was happy and relaxed that this has finally been solved. He already had so many women that he truly loved, how could he possibly care about that Princess Difuya that he did not even like? The reason he did not state things clearly like that was so that he could gain an upper hand in controlling the situation, using it to ensure that the road would be peaceful. At least, if he acted like the victim, Shangguan Xue’er and Tian’er would also treat him better. Of course, such a thinking he would not share with Lin TianAo… he had to maintain his image… right?\u003c/p\u003e\n\u003cp\u003eVery quickly, Xiao Yan and Difuya had packed up their things and left the courtyard. Both of them had their own Spatial Rings, and they did not have to carry any luggages. As the two of them looked at Zhou Weiqing, they were still slightly uneasy.\u003c/p\u003e\n\u003cp\u003eThe four mounted up and moved out of the city directly.\u003c/p\u003e\n\u003cp\u003eWhen they left the city gates, only then did Xiao Yan and Difuya see the Peerless Battalion soldiers waiting on the outskirts, like a wall of steel greeting them. In that moment, a look of utter surprise crossed their faces.\u003c/p\u003e\n\u003cp\u003eThe Gold Crow and Berserker Tribe soldiers in front were just too ferocious and valiant looking. Their terrifying bodies and stature, if one did not look closely, they would think it was an army troop from the WanShou Empire!\u003c/p\u003e\n\u003cp\u003eWith a wave of his hands, Zhou Weiqing signalled for the entire group to start moving out, following the main road towards the center of the ZhongTian Empire.\u003c/p\u003e\n\u003cp\u003eAs soon as Zhou Weiqing exited the city gates, his acting skills turned on once again, an ugly expression on his face as if he was extremely vexed. When he returned to Shangguan Xue’er and Tian’er’s side, he did not say anything, just leading the troop as they moved out.\u003c/p\u003e\n\u003cp\u003eJust as he had predicted, when Shangguan Xue’er and Tian’er deduced what had happened in the TianBei City, they were clearly more gentle towards Zhou Weiqing, and they even stopped being so prickly towards each other.\u003c/p\u003e\n\u003cp\u003eJust like this, Zhou Weiqing led the seven hundred mounted soldiers southwards. They would have to pass through the ZhongTian Empire before entering the Fei Li Empire.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-22-chapter-188-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-22-chapter-188-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-22-chapter-188-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
