{"id":51233,"no":59,"title":"Chapter 15 Zong Level Heavenly Beast Elemental Jewel Skill-Storing (3)","content":"\u003cp\u003e\u003cstrong\u003eChapter 15 Zong Level Heavenly Beast Elemental Jewel Skill-Storing (3)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er looked at him and said coldly: “Company Leader Xiao, do not forget that I am your boss.”\u003c/p\u003e\n\u003cp\u003eXiao Se said mockingly: “A boss who was absent from post for two months without authorization? Battalion Commander, do not worry, I have already reported this to the military headquarters regarding the matter of you being absent without authorization. Three days later when the new recruits barracks are completed, if the new 3rd Battalion Recruits suffer a disastrous defeat in the Fresh Recruit Tournament, I’m afraid your position as Battalion Commander will likely come to an end. Heavenly Jewel Masters are truly genius talents, but that does not mean that you also have the talent or ability in commanding.”\u003c/p\u003e\n\u003cp\u003eAs soon as he spoke these words, Xiao Se turned around and walked away unexpectedly, causing Shangguan Bing’er’s beautiful face to be angered into a pallid white.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had been standing beside Shangguan Bing’ers, and as he saw Xiao Se was walking away, he took a step forward to pursue; he had long since disliked that handsome gigolo.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er lifted her hand, catching hold of Zhou Weiqing’s arm, shaking her head at him.\u003c/p\u003e\n\u003cp\u003eXiao Se vanished as he exited the command tent, and Zhou Weiqing could no longer resist and said: “Battalion Commander, why don’t you let me me teach him a lesson? What’s the matter with this Xiao Se?”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said with a solemn voice: “Company Leader Xiao is the only son of the Empire’s Finance Minister Marquis Xiao Yunchen, otherwise did you think I would endure him til now?”\u003c/p\u003e\n\u003cp\u003eWhen he heard Shangguan Bing’er’s words, Zhou Weiqing was also very surprised, “That can’t be? Marquis Xiao is called the God of Wealth of our Empire, it could be said that one of the main reasons why our Heavenly Bow Empire’s national strength can progress and improve, has a lot to do with him. How could he possibly have such an arrogant son?”\u003c/p\u003e\n\u003cp\u003e“You also know Marquis Xiao?” Shangguan Bing’er looked somewhat surprisedly at him.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing realized that he had somewhat made a mistake, and hurriedly tried to recover and said: “Many have said that our Heavenly Bow Empire is sustained in a big way by our two great officials, one against the outside world, and one governing the inside world. The one who holds the outside is Admiral Zhou, and the governing the inside isn’t it Marquis Xiao?”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er nodded, then sighed lightly, saying: “Actually, I cannot blame Xiao Se for treating me like that. Before I came to the 3rd Battalion, the 3rd Battalion Commander position was vacant, and although he isn’t a Heavenly Jewel Master, but he is indeed a military genius with very capable commanding ability, and was the person who was most likely to succeed the Battalion Commander position, yet that position was actually snatched by me, that is why he feels so uncomfortable in his heart. Xiao Se’s elite 3rd Company is also the main trump card of our 3rd Battalion.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s expression suddenly grew extremely strange, as he suddenly recalled some past events from his childhood.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Bro Shuiniu , look at those two kids enjoying themselves play together. What a pity, your son is six years younger than my little daughter, otherwise, I will definitely snatch this son-in-law from his Majesty, hahaha.”\u003c/p\u003e\n\u003cp\u003e“Old Xiao, why do you trouble yourself with this? Weiqing this child is born with his meridian\u0026nbsp; passages blocked, sigh… he is doomed to not have a great talent!”\u003c/p\u003e\n\u003cp\u003e“Old Zhou, is your brain damaged? As bros how can you say this to me? I’m telling you now very clearly, if in the future the Princess Her Highness and Weiqing are not good together, even if Ruse is older than your son, I will marry her to Weiqing!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA 13-14 year old young girl was running in front, followed by a little boy whose nose was dripping with mucus.\u003c/p\u003e\n\u003cp\u003e“Zhou Weiqing, you little mucus monster, come quickly over here! Let’s go grab that birds nest.”\u003c/p\u003e\n\u003cp\u003e“Elder Sis Ruse, wait for me!!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA young girl with a firm and resolute expression on her face was standing protectively before a little boy, facing them were another four to five young boys encircling them.\u003c/p\u003e\n\u003cp\u003e“I won’t allow you guys to bully him, who dares to bully him will be punched by me!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Papa, where did Elder Sis Ruse go? How come she doesn’t come to play with me anymore?”\u003c/p\u003e\n\u003cp\u003e“Your Elder Sis Ruse has gone to school. Little brat, starting today, your misery has come, from today onwards you will get up at 5am to go through special training, otherwise, your father* I will punch till your ass blossoms.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Little Fatty Zhou, what are you thinking about?” Shangguan Bing’er lifted her hand and waved it in front of Zhou Weiqing’s face, asking him puzzledly.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing awoke from his train of thought and quickly shook his head, saying: “Nothing, Battalion Commander. What was the Fresh Recruit Tournament that Company Leader Xiao mentioned earlier?”\u003c/p\u003e\n\u003cp\u003eXiao Se… Xiao Ruse, those two names superimposed in his heart gradually, and the edges of Zhou Weiqing’s mouth edged up slightly, in the heart he was thinking: \u003cem\u003eAs far as I know, Uncle Xiao only has a daughter, Elder Sis Ruse, where did a son come from? Haha, they say that females go through a huge change at 18 years old, it seems like Elder Sis Ruse, you did not recognize me, and I also did not recognize you. You are pretending to be a man!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er’s brow furrowed as she said: “”We are talking about the Fresh Recruit Tournament, why are you smiling so slyly?”\u003c/p\u003e\n\u003cp\u003e“Ah? Did I smile? Battalion Commander, what I mean is that I am also a recruit, so naturally I can participate in this Fresh Recruit Tournament right?” Zhou Weiqing responded quickly, immediately finding a reason for himself.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said: “The Fresh Recruit Tournament is held after the new recruits have finished their training, and the various Companies in the Battalion will be competing against each other as a unit. This is for the purpose of selecting talented people, those recruits who put up a good display; for example the most outstanding recruit will directly be promoted to squad leader. I remember that this was how Company Leader Xiao had risen in his rank initially too, he has enlisted in the military for about three years, yet his performance has been absolutely outstanding. If I had not appeared with the rank of Heavenly Jewel Master, perhaps he has already been promoted to the rank of Battalion Commander. Furthermore, he has always relied on his own ability for promotions, and not relied on any help from Marquis Xiao. I truly admire and respect him in that aspect. Well, in any case, you will also have to participate in the Fresh Recruit Tournament, otherwise our new Company will be short of one person. However, you are absolutely not allowed to use your Heavenly Jewels.”\u003c/p\u003e\n\u003cp\u003e“Battalion Commander, I have a condition.” Zhou Weiqing said with an impish grin on his face. After realising that Xiao Se was unexpectedly his Elder Sis Ruse, he was in an excellent mood, suddenly could no longer repress his true colors.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er did not know why, but looking at him acting this way, several ripples coursed through her heart, it was as if this rascal in front of her had became real again.\u003c/p\u003e\n\u003cp\u003e“What condition?” Shangguan Bing’er put on a serious face and asked.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing grinned: “Lend me your Purple Dawn Bow. Even if I cannot use my Heavenly Jewels, I will still give them a huge surprise. Battalion Commander, just wait and see your Personal Aide Little Fatty Zhou show his suave valiance in the Fresh Recruit Tournament. However… is there any reward?”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er got angry: “What, do you still want a reward?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said: “Doesn’t the army pride itself on its fairness, discipline is upheld and punishment meted to those who deserve it, but rewards are also given to those who deserve it as well? I do not want that rank of squad leader; if I bring our 3rd Battalion’s fresh recruit Company to get the first in the tournament, in the future when there is no one else around, you will let me call your name directly, this request isn’t too excessive right?”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er originally wanted to reject him immediately, but with a quick thought she changed her mind. After all, they were both Heavenly Jewel Masters, it was no big deal letting him call her name. Furthermore, after thinking about Xiao Se’s arrogant appearance just now, she grit her teeth and said: “Alright, fine. If you can lead our fresh recruit squadron to win the first position in the tournament, then I’ll let you do so.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had not expected that Shangguan Bing’er would comply so easily, and was immediately overjoyed: “Battalion Commander, lend me your Purple Dawn Bow first, there are still three more days, I’ll practice some archery.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-3-chapter-15-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-3-chapter-15-04\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-3-chapter-15-03","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
