{"id":51790,"no":616,"title":"Chapter 207 Sis Ru Se! (3)","content":"\u003cp\u003e\u003cb\u003eChapter 207 Sis Ru Se! (3)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eOriginally, many years ago, when Xiao Ru Se was still a Company Leader, Shangguan Bing’er had already been her Battalion Commander. When Zhou Weiqing heard her call out ‘Bing’er’, at her side, his heart was filled with a thick sentiment as he remembered those times. Indeed! He had been apart from Bing’er for so long, and he truly missed her so much. He began to wonder when she would actually come out from her closed door cultivation.\u003c/p\u003e\n\u003cp\u003eAlthough he was thinking of that in his heart, he quickly stepped forward to explain the situation. “Big Sis Ru Se, you have got the wrong person. This is not Bing’er, she is Bing’er’s sister, part of triplets, Shangguan Xue’er. Naturally, she does not recognize you. Xue’er, Tian’er, let me introduce you both. This is Big Sis Xiao Ru Se, I grew up together with her. Due to the fact she wanted to join the army, she disguised herself as a man. Big Sis Ru Se is a heroine in the army indeed!”\u003c/p\u003e\n\u003cp\u003eTian’er and Shangguan Xue’er instantly glanced at Zhou Weiqing with a similar, meaningful look, before they greeted Xiao Ru Se. [1. Uh oh? ;)]\u003c/p\u003e\n\u003cp\u003eNaturally, Xiao Ru Se was also examining the two girls. Shangguan Xue’er and Bing’er looked exactly alike, so much so that she was literally amazed. As for Tian’er’s lustrous white hair and purple orbs accentuating her beauty, it was also extremely shocking. She couldn’t help but think to herself: \u003ci\u003eIt’s only been a few years, and that little rascal Weiqing has managed to meet with such beautiful women. Looking at their eyes… it seems their connection with him isn’t that simple after all!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eZhou Weiqing invited Xiao Ru Se into the house, as he couldn’t wait to ask about the circumstance on how their Empire was destroyed previously.\u003c/p\u003e\n\u003cp\u003eXiao Ru Se took some time to calm herself down before following him into the house.\u003c/p\u003e\n\u003cp\u003eAt that time, the Kalise armies had attacked just so suddenly. No one knew how they had gotten news that Admiral Zhou was not at the frontlines, and had returned for the capital city for a short time. At first time, they had sent all their armies in a massive surprise attack.\u003c/p\u003e\n\u003cp\u003eBesides the Kalise Empire’s own entire army of six Regiments of soldiers, there were also five more Regiments from the Bai Da Empire. Furthermore, the Bai Da Empire had dispatched more than a dozen powerful Heavenly Jewel Masters, led by a Heavenly King powerhouse in a concerted attack.\u003c/p\u003e\n\u003cp\u003eThere was no chance at all. The Heavenly Bow army line crumbled almost instantly, and the army rampaged all the way through the capital city. At that point, although Admiral Zhou had led his personal guard and the armies in the Heavenly Bow City to put up a last ditch stubborn resistance, the gap between both sides was just too huge. At the last moment, Admiral Zhou was forced to sacrifice himself to use his Darkness Consolidated Fate Denying Seal, Sealing the Heavenly Bow Emperor Di Fengling and some of the other higher ranking officials of the Heavenly Bow Empire in the Royal Palace.\u003c/p\u003e\n\u003cp\u003eDuring that time, Xiao Ru Se had been on the frontlines of the Kalise border, and she had been one of those who had first faced off against the Kalise and Bai Da armies. After the large battle, when all was lost, they had no choice but to flee in all directions. These defeated troops ended up springing up in small rebellions in the past year, attempting to revive their homeland.\u003c/p\u003e\n\u003cp\u003eDue to Xiao Ru Se’s identity, rank and status, her own rebellion troop was one of the largest of them all, numbering almost six thousand in total as they hid in one of the remote hills. Alas, their strength was just too low, and just by themselves, besides using the complicated terrain of the hills to protect themselves, they were unable to do much more in terms of resistance.\u003c/p\u003e\n\u003cp\u003eHowever, not long ago, it was Ming Yu’s spreading the word which had indispensable in letting them learn that a force of Heavenly Bow Empire armies had actually taken back the Crescent City, even managing a magnificent defensive victory after the Kalise armies laid siege once more. More importantly, after some more scouting, Xiao Ru Se had heard the names of Princess Difuya and Zhou Weiqing, and she immediately rushed over.\u003c/p\u003e\n\u003cp\u003eHearing Xiao Ru Se’s descriptions, Zhou Weiqing couldn’t help but sigh deeply.\u003c/p\u003e\n\u003cp\u003e“Sis Ru Se, do not worry. This time, not only are we here to revive our homeland, to bring back the Heavenly Bow Empire, we will also destroy the Kalise Empire. In the past, we were just too weak. However, those days are long past. Soon, we will firmly stand strong as one of the powerhouses in the mainland.”\u003c/p\u003e\n\u003cp\u003eTears brimmed in Xiao Ru Se’s eyes, as she looked at Zhou Weiqing with a smile on her face. “Little Wei, it is so good that you are back. We can finally have a mainstay, a pillar to support us. I do know where most of the remnants of our armies are, and I will dispatch some men immediately to contact them and gather them together. Once we can mass our forces back together, we can start to regain our homeland as quickly as possible.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was delighted, and exclaimed: “That would be great. We are now in the stage of gathering strength, to invade and reoccupy the Heavenly Bow City in one fell swoop.”\u003c/p\u003e\n\u003cp\u003eXiao Ru Se asked: “Little Fatty, how have you spent the past few years?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing also went through the events of his life simply, since he had last parted with Xiao Ru Se. As compared to Xiao Ru Se’s simple army life, his experiences were far and varied, definitely a rich and plentiful one, and as Xiao Ru Se listened to his story, she couldn’t help but be visibly moved in countenance.\u003c/p\u003e\n\u003cp\u003eBoth Shangguan Xue’er and Tian’er had left the room, leaving it for the brother and sister pair to catch up with each other, and there were only the two of them alone in the room.\u003c/p\u003e\n\u003cp\u003eAfter hearing Zhou Weiqing’s description, Xiao Ru Se couldn’t help but move her lips in a hint towards the door, saying in a low tone: “What is with those two girls? Aren’t you with Bing’er? How did you end up swapping with her sister? And that Lady Tian’er… it looks like her relationship with you isn’t that simple…”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing grinned and said: “Just intimate friends, intimate friends…Heh heh”\u003c/p\u003e\n\u003cp\u003eXiao Ru Se glared at him exasperatedly: “You terrible fellow, trying to be a playboy eh. Later I’ll tell Uncle Zhou, and get him to beat you up…”\u003c/p\u003e\n\u003cp\u003eThose were the words that Xiao Ru Se was so used to threaten him with since young, and she subconsciously said them. As soon as she did so, she regretted it instantly, looking at Zhou Weiqing with an apologetic look.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing shook his head and said: “Sis Ru Se, I’m fine. Father will definitely have the chance to beat me up again.” With firm resolution in his eyes, he said savagely: “Before long, we will be able to return. I will definitely save my father.. No matter how difficult or tough that Darkness Consolidated Fate Denying Seal is… I will definitely save him!”\u003c/p\u003e\n\u003cp\u003eRegarding the Darkness Consolidated Fate Denying Seal, how to release it and to save his father, Zhou Weiqing already had a set of plans. Normally speaking, if one released or broke the Darkness Consolidated Fate Denying Seal, it would also mean the death of Admiral Zhou. After all, he had burnt everything he had, even his life force, in unleashing such a Skill… in exchange for a chance that the Heavenly Bow Empire Royal Family could have a chance to turn the tables.\u003c/p\u003e\n\u003cp\u003eHowever, was the Darkness Consolidated Fate Denying Seal really unbreakable or without a solution? Zhou Weiqing already had some ideas about it, and he was still in the midst of refining and perfecting his plans.\u003c/p\u003e\n\u003cp\u003eRight at that moment, a knock sounded on the door, and Shangguan Xue’er’s voice rang from outside. “Weiqing, may I come in?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing started momentarily, but opposite him, Xiao Ru Se blushed slightly, glaring at him exasperatedly as she said softly: “Look, what kind of terrible character you have in those girls’ hearts.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing grinned and said: “My character is extremely good! Xue’er, come in.”\u003c/p\u003e\n\u003cp\u003eThe door opened, and Shangguan Xue’er walked in from outside, with Tian’er following behind her. In her hands, there was a letter.\u003c/p\u003e\n\u003cp\u003e“What is it?” Zhou Weiqing asked Shangguan Xue’er in puzzlement.\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er replied: “Father has just sent a letter. The next Heavenly Jewel Tournament has begun, and Father and Uncle have suggested that you join the Heavenly Jewel Tournament once more, representing the Heavenly Bow Empire.”\u003c/p\u003e\n\u003cp\u003eHearing her words, Zhou Weiqing’s heart sparked with sudden inspiration. He was an intelligent person, and he instantly understood what the two heads of the Heaven’s Expanse Palace intended.\u003c/p\u003e\n\u003cp\u003eThe Heavenly Bow Empire had just began their quest to revive themselves, and they were rising up in an abrupt but dominant fashion. At this time, if they could give a show of strength in the Heavenly Jewel Tournament, it would undoubtedly be a perfect time, allowing them to once again spread their name.\u003c/p\u003e\n\u003cp\u003eSeeing that Zhou Weiqing did not reply her immediately, Shangguan Xue’er thought that he had some misgivings or worries, and she quickly continued: “What Father and Uncle mean is that they hope you can show the rest of the Empires in the Heavenly Jewel Tournament that the Heavenly Bow Empire has returned. Furthermore… Bing’er has finally finished her closed door cultivation.”\u003c/p\u003e\n\u003cp\u003eIf at first Zhou Weiqing heard about the Heavenly Jewel Tournament, his mind was fully immersed on how he could use that to the benefit of the Heavenly Bow Empire. However, as soon as he heard Shangguan Xue’er’s last sentence, his emotions overwhelmed his reason. Abruptly, he leaped up from his seat. “Bing’er, Bing’er has finally come out? Great, that’s just too great!”\u003c/p\u003e\n\u003cp\u003eSeeing Zhou Weiqing’s excited expression, Shangguan Xue’er smiled faintly. Behind her, Tian’er’s smile was rather strained. She knew that in Zhou Weiqing’s heart, no one could replace Shangguan Bing’er.\u003c/p\u003e\n\u003cp\u003eIt could be said that without Shangguan Bing’er at the start, there would be no current Zhou Weiqing, and he would not have the power he had… or perhaps he would not even be alive.\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er said: “Weiqing, don’t be so quick to be happy. Father asked me to inform you that this is also your best chance to earn his approval. However, it will not be an easy task. Our Heaven’s Expanse Palace will be sending our strongest ever team to participate in this year’s Heavenly Jewel Tournament, to regain our lost championship. Unless you can lead your Heavenly Bow Empire to defeat us, otherwise Father will not allow you to bring Bing’er away.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing started. “Strongest team ever? What is the strongest team?”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er giggled and said: “What do you think?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing instantly understood, and his eyes widened in shock. “Wha… No… It can’t be… Uncle wouldn’t let you three sisters…”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er nodded gently, saying: “Do not think that we will go easy on you. If you do not defeat us head on in front of all the younger generation of all the Empires, how can you prove that you deserve to marry… marry Bing’er?” As she spoke up to that point, her face blushed slightly. She had originally been about to say marry the three of us, but when the words were on her lips, she just couldn’t bring herself to say it in front of Xiao Ru Se.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said with a distressed expression: “That is just too difficult right, after all I am just a single person.”\u003c/p\u003e\n\u003cp\u003eThe usually cold and impassive face of Shangguan Xue’er broke up in a rare teasing expression. “That is your problem. Whether or not you can succeed, that is up to your own ability. Don’t you have Tian’er by your side too?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing looked at Tian’er, but sighed. How could he bear for Tian’er to fight by his side in her current state! Although Tian’er had said that even if she was pregnant, it would not influence her ability to fight, and the baby would be safe. However, in Zhou Weiqing’s heart, the current Tian’er was fragile and he would not allow her to risk herself and the baby.\u003c/p\u003e\n\u003cp\u003eAlthough Zhou Weiqing had absolute confidence in himself, just like he said, the Heavenly Jewel Tournament was never about a single person… but an entire team. Lin TianAo’s power was definitely more than sufficient, but his age had already surpassed the age restriction of thirty years old. Just like the Heaven’s Expanse Palace’s Zhan LingTian and Heavenly Snow Mountain’s Gu Yingbing, both would not be able to join this year’s Heavenly Jewel Tournament.\u003c/p\u003e\n\u003cp\u003e“So, are you going or not?” Shangguan Xue’er asked as her mouth curled up in a faint smile.\u003c/p\u003e\n\u003cp\u003e“Of course I’m going. For Bing’er’s sake, no matter what I will have to pit everything to win the tournament again!” Zhou Weiqing instantly agreed, his heart already in the midst of planning what he could do. Although Lin TianAo and Xiao Yan was no longer of age and could no longer assist him in this new Heavenly Jewel Tournament, he could still build up a whole new team!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-23-chapter-207-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-23-chapter-208-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-23-chapter-207-03","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
