{"id":51836,"no":662,"title":"Chapter 223 Top Eight Fight | BaoPo Battle Team! (3)","content":"\u003cp\u003e\u003cb\u003eChapter 223 Top Eight Fight | BaoPo Battle Team! (3)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eLin TianAo’s teachings had also come into full play here, his steps and movement simple but effective, able to avoid direct clashes at critical moments, utilizing his defense to its ultimate max.\u003c/p\u003e\n\u003cp\u003eThis fight lasted almost an entire hour before Ma Qun finally lost. However, his loss was because he had fully ran out of Heavenly Energy. Up until that point, his opponent had not broken through his defenses a single time.\u003c/p\u003e\n\u003cp\u003eMa Qun’s persistence and perseverance allowed Xixi to gain any easy victory when she came up. Originally, Xixi’s overall combat prowess was already stronger than Ma Qun, though her expertise was the reverse of Ma Qun’s, far more adept in offense than defense. Under her ferocious onslaught, the poor BaoPo Battle Team member who was already exhausted from his fight with Ma Qun fell, though he did manage to force her to expend a considerable amount of Heavenly Energy before her victory.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eBaoPo Battle Team Rest House.\u003c/p\u003e\n\u003cp\u003e“Bro XiHua, let me fight.” Butterfly Orchid said eagerly, clearly itching for a fight.\u003c/p\u003e\n\u003cp\u003eXiHua looked at her in surprise, saying: “Are you that eager to fight today?”\u003c/p\u003e\n\u003cp\u003eButterfly Orchid gave a mysterious smile. Even though they had been married for so many years, XiHua was still bedazzled by the smile.\u003c/p\u003e\n\u003cp\u003e“If I go up now, we can perhaps force that Zhou Weiqing and Tian’er to fight with us both!”\u003c/p\u003e\n\u003cp\u003eXiHua laughed heartily and said: “You are still as competitive as ever. Do you really think we can defeat Zhou Weiqing though?”\u003c/p\u003e\n\u003cp\u003eButterfly Orchid smiled and said: “If we do not try, how will we know? Alright, I shall go up to fight then.”\u003c/p\u003e\n\u003cp\u003eThe Heavenly Bow Battle Team had been suppressed and disadvantaged since the start of the fight, and as soon as Butterfly Orchid entered the stage, they were fully suppressed all the way. Previously, the defensive capabilities that Ma Qun had displayed was all of his power. Those who followed him, Xixi, Crow and Yun Li, were all very good fighters in their own rights. Alas, they were facing one of top talents in one of the Great Saint Lands, one of the top few in the younger generation of the Passion Valley, Butterfly Orchid.\u003c/p\u003e\n\u003cp\u003eIt was an absolute suppression of Attributes and cultivation level, and the next few fights ended rather quickly. Butterfly Orchid’s cultivation level was actually at the later stages of the seven-Jeweled.\u003c/p\u003e\n\u003cp\u003eAs Yun Li lost in a helpless fashion, the score had suddenly become a shocking 4 to 1, with the BaoPo Battle Team leading by such a large margin.\u003c/p\u003e\n\u003cp\u003eAt last, Zhou Weiqing stood up in their Rest House. In a flash, he appeared on the stage.\u003c/p\u003e\n\u003cp\u003eSeeing that he had finally come on stage, Butterfly Orchid smiled sweetly and said: “At last, you are here. Team Leader Zhou, I have a proposal. How about we simplify the entire fight for both of us. Myself and XiHua, against you and Tian’er. If you win, we will surrender all the rest of the fights.”\u003c/p\u003e\n\u003cp\u003eAlthough Butterfly Orchid’s voice did not seem loud, all of the teams in their rest houses could still hear them.\u003c/p\u003e\n\u003cp\u003eThis might seem like an obvious advantageous proposal for the Heavenly Bow Battle Team, after all the BaoPo Battle Team was already leading with such a massive advantage. However, those who truly knew the profound secrets of the Passion Valley knew that such an ‘advantage’ wasn’t truly that at all.\u003c/p\u003e\n\u003cp\u003eWith a faint smile on his face, Zhou Weiqing said: “Lady Butterfly, that is a very interesting proposal, such fine calculation!”\u003c/p\u003e\n\u003cp\u003eButterfly Orchid smiled winsomely, saying: “Your powers are so strong, letting us get some advantage, it isn’t too much right? I just do not want to lose in such a unreconciled fashion.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed heartily and said: “Very well, if the rules allow it, I do not have a problem.” As he said that, he turned to look questioningly at Shangguan Longyin.\u003c/p\u003e\n\u003cp\u003eShangguan Longyin nodded and said: “As long as both sides agree, I will allow it as well. We can go through with that fight.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing and Butterfly Orchid both nodded, beckoning to their respective partners.\u003c/p\u003e\n\u003cp\u003eAs soon as XiHua ascended the stage, he gave a bitter smile towards Zhou Weiqing, saying: “Team Leader Zhou, I am truly sorry. We just want to experience Team Leader Zhou’s power for ourselves.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed and said: “No problem at all. Coincidentally, I also wish to truly experience the power of the Passion Valley, and the manipulation of the Time Attribute.”\u003c/p\u003e\n\u003cp\u003eShangguan Longyin’s voice rang out throughout the plaza with his Heavenly Energy voice transference. “After some discussion, the Heavenly Bow Battle Team and BaoPo Battle Team have come to an agreement to hold a last two versus two fight to determine the final victory of today’s fight. Due to the fact that the BaoPo Battle Team is especially adept in two versus two fights, I deem this to be fair. Both sides, introduce yourselves.”\u003c/p\u003e\n\u003cp\u003e“Heavenly Bow Battle Team, Zhou Weiqing, Tian’er.”\u003c/p\u003e\n\u003cp\u003e“BaoPo Battle Team, XiHua, Butterfly Orchid.”\u003c/p\u003e\n\u003cp\u003eShangguan Longyin glanced at Zhou Weiqing and said passively: “If you all cause such a huge commotion like the last fight, your payment will not be so low any longer.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s eyes twitched. \u003ci\u003eLow? Because of the damage last time, it cost me ten million gold! Is that considered low? Even if they rebuilt the entire ZhongTian Plaza, it wouldn’t cost that much right.\u003c/i\u003e Of course, he only dared think it in his heart, but would not say it out, only nodding towards Shangguan Longyin.\u003c/p\u003e\n\u003cp\u003e“Fight, begin.”\u003c/p\u003e\n\u003cp\u003eAs Shangguan Longyin shouted the proclamation, the four of them on both sides instantly circulated their Heavenly Energy. Powerful Heavenly Energy reverberations rose abruptly over all four of them.\u003c/p\u003e\n\u003cp\u003eXiHua’s cultivation was about the same as Butterfly Orchid, though he seemed slightly stronger and more profound. Still, he was at the later stage of the seventh-Jewel, at least not giving Zhou Weiqing and Tian’er another insane eight-Jeweled opponent.\u003c/p\u003e\n\u003cp\u003eIn a similar fashion to the fight against the brothers TianFeng and TianMa, as soon as both sides clashed, it was firstly a clash between their auras. Interestingly, for Zhou Weiqing and Tian’er’s side, both of them instantly held hands, and exactly at the same time, XiHua and Butterfly Orchid also held hands. It was as if there was some sort of couples meeting going on.\u003c/p\u003e\n\u003cp\u003eBoth XiHua and Butterfly Orchid had a constant faint smile, but the aura and Heavenly Energy reverberations emanating from them was not gentle at all.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was surprised to discover that all external sound seemed to have been fully isolated and blocked, and both XiHua and Butterfly Orchid in front of him became rather illusory in look.\u003c/p\u003e\n\u003cp\u003eIn terms of strength of their aura, XiHua and Butterfly Orchid added up together was perhaps lesser than the brothers TianFeng and TianMa. However, they had their own strange tricks.\u003c/p\u003e\n\u003cp\u003eThe aura around their bodies seemed to hold a certain illusory feel, and did not directly clash with Zhou Weiqing and Tian’er’s aura. Instead, it was soft and gentle like waves, ebbing and flowing one wave after the other, and their aura was slowly growing as well.\u003c/p\u003e\n\u003cp\u003eInstantly, Zhou Weiqing realised it was a profound mystery of Time Control.\u003c/p\u003e\n\u003cp\u003eSomehow, with the control of the time Attribute, the pressure of their aura was able to adjust constantly in tiny and fluid changes, and the ‘past’ aura could somehow overlap with the ‘new present’ aura, in the constant waves of overlapping, their pressure was increasing, slowly but surely, soon surpassing the maximum that their own cultivation level could have reached.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eSo… the Time Attribute can actually be used in such a manner! \u003c/i\u003eZhou Weiqing felt he had witnessed a massive eye opener, nodding to himself inwardly. It looked like today, they would have no choice but to attack first.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing and Tian’er were connected in their hearts, and abruptly, the ‘Hate Ground no Handle’ Legendary Set and God Vanquishing Heavenly Spirit Set released simultaneously. In that instant, their aura was boosted far above their opponents.\u003c/p\u003e\n\u003cp\u003eXiHua and Butterfly Orchid’s expressions changed, and they were also forced to quickly release their Consolidated Equipment as well.\u003c/p\u003e\n\u003cp\u003eThe Passion Valley was after all not the Heaven’s Expanse Palace, and XiHua and Butterfly Orchid did not both have Legendary Sets. As the seven Consolidated Equipment appeared around XiHua’s body, they were all accompanied by the now-familiar Consolidating Equipment God Protective Aura. However, Butterfly Orchid’s one was not so, as around her body appeared a set of white armour, also seven pieces in total including the weapon. Although it was not a Legendary Set, it was clearly a fully complete seven-piece set of Consolidated Equipment.\u003c/p\u003e\n\u003cp\u003eNever ever underestimate a completed set just because it isn’t a Legendary Set… that was especially because Butterfly Orchid’s Set was already complete, and could fully unleash the effect of the Set. Compared to an incomplete Legendary Set, though the former would have greater future potential, currently their boost and combat strength was not that much weaker.\u003c/p\u003e\n\u003cp\u003eAfter all, in the end she had come out from a Great Saint Lands, one of the top in the Passion Valley, and this Set of Consolidated Equipment could not possibly be weak.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing moved then, the wings behind his back spreading out as he entered the Dragon-Tiger Transformation state. In a flash, he moved out towards XiHua in a swift pounce. As his body flew forward, the Six Ultimate Godly Light Formation appeared below his feet as a thick Lightning Heavenly Energy reverberation appeared instantly, forming several hundred lightning pearls flying towards XiHua in a concerted fashion.\u003c/p\u003e\n\u003cp\u003eAs Zhou Weiqing launched this massive attack instantly, XiHua was given a shock. He was also able to launch instant Skills, but these were usually much smaller and weaker, definitely not to the extent that Zhou Weiqing had just shown, a few hundred lightning pearls blasting out at him so quickly. These Lightning Pearls did not seem to be that powerful, at least individually, but stacked together in such numbers and proximity, their power could not be dismissed.\u003c/p\u003e\n\u003cp\u003eFurthermore, right behind the massive patch of lightning pearls, there was still Zhou Weiqing and his swinging Dual Legendary Hammers.\u003c/p\u003e\n\u003cp\u003eWith a low shout, XiHua continued maintaining a hand linked with Butterfly Orchid, and together they advanced forward.\u003c/p\u003e\n\u003cp\u003eInstantly, the air began to warp in a strange fashion, and as soon as any of the lightning pearls reached a range of three metres from their bodies, they began to fly off in various different random directions, just unable to hit them.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s charging body stopped in his tracks, unable to get through the twisting light. The Legendary Hammers in his hands suddenly slammed into each other, causing a strange *Weeeng* sound, as the Six Ultimate Godly Light Formation under his feet glowed brightly.\u003c/p\u003e\n\u003cp\u003eInstantly, the lightning pearls which had been sent flying away suddenly came back, all of them still intact. Just that level of control alone was enough to shock anyone else. In the next instant, along with that strange buzzing sound, all of the lightning pearls abruptly exploded in near XiHua and Butterfly Orchid.\u003c/p\u003e\n\u003cp\u003eAfter countless practice, especially as Zhou Weiqing grew more familiar with his Six Ultimate Godly Light Formation, his control over the ‘Flying Lightning God Technique’ was also growing finer. Do not underestimate the fine control over just a single attribute; with the boosts of the ‘Hate Ground no Handle’ LEgendary Set, the Six Ultimate Godly Light Formation’s control and consolidation, this Skill was more than sufficient to compare with most Heavenly King Stage powerhouses’ skills. More importantly, it had so many myriad changes to go along with the speed of its usage.\u003c/p\u003e\n\u003cp\u003eThe violent explosion was almost enough to cause one’s ears to go deaf. The greatest feature of the Lightning Attribute was definitely its explosive power, but many people neglected the sound that came along with the explosions. An abrupt explosion like that could greatly affect one’s hearing, and the six senses were all linked together. Once the hearing was affected so suddenly, the overall senses would also be affected.\u003c/p\u003e\n\u003cp\u003eOf course, the couple XiHua and Butterfly Orchid were extremely powerful. Even facing such a massive explosion of the lightning pearls, they instantly reacted with the best possible choice. They did not attempt to go too aggressive in hopes for a overreaching win, instead playing it safe and focusing on defense in that point.\u003c/p\u003e\n\u003cp\u003eIn their eyes, though Zhou Weiqing’s attack might seem ferocious, but since he had exploded out with so many lightning pearls, covering a relatively large surface area like that, though the power was not bad, it should still be no match for an extremely small area of effect powerful Skill. At the same time, such a Skill should also be a large toll on his Heavenly Energy. As a result, they were not in a rush at all. As the saying goes, there is a limit to one’s energy, and the stronger his attacks, the faster he would decline.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-24-chapter-223-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-24-chapter-224-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-24-chapter-223-03","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
