{"id":51842,"no":668,"title":"Chapter 226 Bing’er: But, I want (1)","content":"\u003cp\u003e\u003cb\u003eChapter 226 Bing’er: But, I want… (1)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eWith the fight down to the last critical moment, at this point due to the cover of the wings, no one else could see the strange look on Zhou Weiqing’s face. Gritting his teeth, a strange energy reverberation appeared in his eyes.\u003c/p\u003e\n\u003cp\u003e*BANG* Even as Zhou Weiqing was struck by Zhan LingTian’s piercing attack, how could it be without any price to pay? The crying-face Hammer slammed savagely into his shoulders, and Zhan LingTian’s entire body flew like a cannonball several hundred metres away. As for Zhou Weiqing, though his body was swaying, he still stood firmly there.\u003c/p\u003e\n\u003cp\u003eThe wings behind his back slowly retracted into his body as he left the Dragon-Tiger Transformation state, and Zhou Weiqing pointed his Hammers towards Zhan LingTian, shouting coldly: “You have lost.”\u003c/p\u003e\n\u003cp\u003eIndeed, Zhan LingTian had lost. Although he had a Legendary Set, one uniquely tailored for his Light-Dark Divine Spear… he had still lost.\u003c/p\u003e\n\u003cp\u003eHis armour could not withstand the final blow, and as soon as Zhou Weiqing’s savage hammer blow landed, it totally shattered the Consolidated armour around Zhan LingTian’s shoulder. At the same time, his entire shoulder was smashed up, the Heavenly Energy in his body almost scattered totally by the blow. His defenses were far from being able to handle such a hit from Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eZhan LingTian no longer had any capacity of fighting left within him. He had never imagined that even with such a mighty blow that held all his power, in the end he was still unable to defeat Zhou Weiqing. The damage from this final hammer blow, he would need to cultivate and recuperate for at least half a year to one year before he could fully recover. This was an estimate that was even after the aid of the precious Heavenly Jewel Island medicines.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had won this fight between love rivals, but as he spoke the words ‘You have lost’, his eyes subconsciously turned to the other side.\u003c/p\u003e\n\u003cp\u003eThree young women, looking exactly the same, with astonishing beauty that could topple kingdoms, were rushing towards them at a surprising speed. In a flash, they had appeared in front of Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003ePerhaps the true tragedy was that these three beautiful women only had eyes for Zhou Weiqing, none of them even looking at Zhan LingTian who had been blown away.\u003c/p\u003e\n\u003cp\u003e“Little Fatty!” A voice… so familiar… one that he had dreamed of countless times… rang out suddenly. In that instant, Zhou Weiqing felt his entire soul shudder.\u003c/p\u003e\n\u003cp\u003eA rich, strong sense of yearning, filled with love. His body glowed in a flash as the Consolidated Equipment disappeared. Looking at the worried and concerned figure in front of him, he abruptly opened his arms, pulling her into his embrace.\u003c/p\u003e\n\u003cp\u003eHowever, in that instant, Zhou Weiqing’s body slowly fell back, toppling down onto the ground even as the startled cries of the young girl rang out.\u003c/p\u003e\n\u003cp\u003eThe other two beautiful young ladies could clearly see that at Zhou Weiqing’s chest area, a scary looking ‘flower’ of blood slowly appearing. In that instant, it was as if they had lost their ability to breathe.\u003c/p\u003e\n\u003cp\u003eThe three young ladies who had just appeared were naturally the three Shangguan Sisters. The news that Zhou Weiqing had ascended the Heavenly Jewel Island had traveled to them rather quickly, and Shangguan Bing’er’s yearning and longing for Zhou Weiqing was no less than his! With her strong pleading, the three sisters had rushed towards the inn where the Heavenly Bow Battle Team had settled in. Alas, Zhou Weiqing had been too urgent, having rushed out after the team settled in and bringing the team to the Consolidating Equipment Pavilion. As a result, the three sisters had missed the Heavenly Bow Battle Team totally.\u003c/p\u003e\n\u003cp\u003eAfter which, the three sisters had headed to the Consolidating Equipment Pavilion, but after walking through it once, they were still unable to find Zhou Weiqing. It was only until they met Tian’er there did they realise Zhou Weiqing had actually gone to the Heaven’s Expanse Palace, thus delaying their arrival so much.\u003c/p\u003e\n\u003cp\u003eAs Shangguan Xue’er and Shangguan Fei’er saw the spreading flower of blood at Zhou Weiqing’s chest, both stared in shock momentarily before throwing themselves down, supporting him from each side.\u003c/p\u003e\n\u003cp\u003eThis was the front of the Heaven’s Expanse Palace, and the guards in front could only stare in shock, their mouths agape. Naturally, they recognized the three Shangguan Sisters, they were the three Princesses of the Heaven’s Expanse Palace! However… they were actually currently… for the same man…This… this was something far out of their imaginations!\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er held onto Zhou Weiqing tightly, tears streaming down her face uncontrollably. Looking at the ashen complexion of Zhou Weiqing, she said anxiously: “Little Fatty, Little Fatty, don’t scare me!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing stared at Shangguan Bing’er, unable to tear his eyes off her. “Bing’er, I’m sorry, I’m sorry, I’m so sorry…”\u003c/p\u003e\n\u003cp\u003eAfter the three apologies, Zhou Weiqing fainted right in her arms.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er held Zhou Weiqing tightly, tears streaming down her cheeks as she was sobbing uncontrollably.\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er and Shangguan Fei’er both had worried looks on their faces. As Shangguan Xue’er’s cultivation level was the highest, she started to infuse her Heavenly Energy slowly into Zhou Weiqing’s body, and she could instantly sense the Light and Darkness energy still raging wantonly in his body. Luckily, it wasn’t a large amount of it, and as Zhou Weiqing’s Heavenly Energy circulated, it was slowly being dissipated by the energy whirlpools of the Death Acupuncture Points.\u003c/p\u003e\n\u003cp\u003eOn the other side, although Zhan LingTian was severely injured, he was still able to barely stand up. Upon seeing the three Shangguan Sisters all surrounding Zhou Weiqing and ignoring him, he suddenly vomited a mouthful of fresh blood and also fainted. As the one who injured Zhou Weiqing, even if he was from the Heaven’s Expanse Palace, at this current moment the three Shangguan Sisters did not sympathize with him, and the other Heaven’s Expanse Palace members quickly supported Zhan LingTian away.\u003c/p\u003e\n\u003cp\u003e“That’s not right! With his current combat abilities, how could he be injured so easily by Senior Brother Zhan?” After sensing the light and darkness energies in Zhou Weiqing’s body slowly dissipating, Shangguan Xue’er couldn’t help but say curiously.\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er did not have her usual demeanor of the Little Demon Girl of the Heaven’s Expanse Palace, saying urgently: “What’s so wrong about that? Didn’t you see as we were rushing here, he was just trying to end the fight as quickly as possible so that he could see Bing’er quickly, so he actually used his body as bait to lure his opponent in.”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er nodded, the shred of uncertainty in her heart vanishing.\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er was indeed correct. At that time, when Zhou Weiqing had struck out at Zhan LingTian, he was prepared to use such a method of direct clashing to resolve their fight quickly; after all, Zhan LingTian was no easy foe, so it was considered a type of tactics to lure in the enemy. However, one thing she had not realised was that Zhou Weiqing had actually purposely allowed the spear blow to hit him, and he had been willing to do so.\u003c/p\u003e\n\u003cp\u003eTo accept Zhan LingTian’s blow like that was not because Zhou Weiqing wanted to garner sympathy from the three Shangguan Sisters, but it was a form of self punishment. He felt that he had let down Shangguan Bing’er so much, three days he had not seen her, yet he had ended up having unclear relations with Tian’er, Fei’er and Xue’er one after the other. Now that he was about to see Shangguan Bing’er again, although he missed her so much, he did not know how to face her. As such, he had purposely let down his own guard and defenses, allowing Zhan LingTian to injure him. Of course, since it was under his control, that was not too serious an injury.\u003c/p\u003e\n\u003cp\u003eIf not for him allowing that, with the Light-Dark Divine Spear of Zhan LingTian that had already expended so much energy, it would definitely not be able to break through his Immortal Deity Shield and the powerful physique and skin of him in the Dragon-Tiger Transformation state.\u003c/p\u003e\n\u003cp\u003eThe three Shangguan Sisters carried Zhou Weiqing into the Heaven\u0027s Expanse Palace, directly entering Shangguan Bing’er’s room. However, when they removed his shirt to check his wounds, they discovered that the previously severe looking wound on his chest was actually closing and healing at an astonishing rate, and the light and darkness energy Zhan LingTian had infused in had disappeared totally.\u003c/p\u003e\n\u003cp\u003eSeeing that Zhou Weiqing was no longer in any danger, the three Shangguan Sisters heaved a sigh of relief. In truth, at that time when Zhou Weiqing fainted, the wound on his chest was secondary. More importantly, when he saw Shangguan Bing’er he had been overly agitated, thus aggravating the wound in his chest, and he had thus lapsed into a short faint.\u003c/p\u003e\n\u003cp\u003eAlthough Shangguan Xue’er and Shangguan Fei’er really wanted to stay here to continue looking after her, in the end the two sisters exchanged looks and left stealthily, leaving the room to Shangguan Bing’er, who had tears in her eyes.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s physique was extremely powerful indeed, and it did not take long for him to slowly regain consciousness. As he woke up, Zhou Weiqing instantly sensed a small, soft hand gripping his own tightly, as if afraid that he would disappear as soon as it let go.\u003c/p\u003e\n\u003cp\u003e“Bing’er.” As soon as Zhou Weiqing’ opened his eyes, he saw the beautiful, gentle eyes that were red from crying. The emotions and love in his heart burst forth, and he sat up abruptly, enveloping her in his embrace tightly. In that instant, it was as if he wished he could hug her so hard that they merged together.\u003c/p\u003e\n\u003cp\u003eIt was just a normal, pure hug. With Zhou Weiqing’s character, he actually did not make any further intimate contact with her, just hugging her tightly as the emotions and love surged in his heart. In his warm embrace, as if his entire chest was molten, Shangguan Bing’er felt as if she were melting right into him.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing held Shangguan Bing’er for a time, not even knowing how long he did so, until his feelings calmed down slightly. At last, he murmured: “I’m sorry, Bing’er. I…”\u003c/p\u003e\n\u003cp\u003eBing’er moved her face to nuzzle Zhou Weiqing’s neck closely, saying: “Don’t say anymore, Little Fatty. If I really blamed you, would I come to see you now? I should be the one to apologise to you…”\u003c/p\u003e\n\u003cp\u003e“Ah?” Zhou Weiqing was given a fright, almost thinking that Bing’er was speaking in opposites. Subconsciously, he looked up at her, but all he saw was a pair of beautiful, gentle and loving eyes.\u003c/p\u003e\n\u003cp\u003eLifting her hand to stroke Zhou Weiqing’s cheek, Shangguan Bing’er said gently: “Little Fatty, it is my fault. I was not able to be by your side during your toughest times, to accompany you through that suffering. I only discovered what happened to our Heavenly Bow Empire not long ago when I came out of the closed door cultivation… our homeland… your family… all destroyed; yet at that time I was not able to accompany you by your side. I can imagine how much you have suffered these three years, how much pain you must have been in… all the stress and pressure you must have been under, that you had to shoulder everything, all the responsibilities. I do not blame Tian’er, nor do I blame sisters. In that most difficult time, the pain and weakness in your heart, I can imagine that. As long as there was someone to accompany you and help you through it, I can only be happy and ashamed. I should not have chosen to stay here… at that time, I only thought that if I did not work hard and improve my strength, I would not be able to follow your footsteps any longer. I’m so sorry Little Fatty, can you forgive me?”\u003c/p\u003e\n\u003cp\u003eSeeing Shangguan Bing’er’s apologetic look, Zhou Weiqing once again held her tightly in his arms, as he couldn’t help but cherish her even more. With such a wife, what else could a man want? In that instant, Zhou Weiqing’s heart was full of love and tenderness.\u003c/p\u003e\n\u003cp\u003eIndeed! She was his Bing’er, forever only thinking about him… even when he had other women, she had never complained or showed any ‘colours’ towards him, instead blaming herself… pulling all the burdens upon her own shoulders!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-24-chapter-225-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-24-chapter-226-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-24-chapter-226-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
