{"id":51879,"no":705,"title":"Chapter 239: Thousand Year Golden Pearl (1)","content":"\u003cp\u003eEr Chun’s expression was incredibly dark, but he was unable to conceal the stunned surprise in his eyes.\u003c/p\u003e\n\u003cp\u003eAs one of the Heavenly Jewel Masters present with the highest cultivation, he knew how difficult it’d been for Zhou Weiqing to create a master rank Consolidated Scroll in a split second.\u003c/p\u003e\n\u003cp\u003eCreating a Consolidated Scroll didn’t only require the Spatial Attribute, but in terms of creating Consolidation Liquid, allocation of it, a proper management of time, as well as a good sense of the rhythm of changes. All of those were critical to the success of creating any Consolidating Equipment Scroll.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had created a scroll with such utter speed, completely breaking through the requirements needed to craft a scroll in terms of rhythm. A Consolidating Equipment Master who could create Consolidated Scrolls at will in spite of the requirements, even claiming to be a God Tier Consolidating Equipment Master… this was someone Er Chun had no choice but to take seriously.\u003c/p\u003e\n\u003cp\u003eAfter a series of changes in his expression, Er Chun finally managed to squeeze out an absolutely ghastly smile. “Honored God Tier Master, please forgive my earlier transgressions. It wasn’t your fault that you were unable to save their lives. You’ve successfully entered the next round and have the right to enter the finals of the XuanTian Trials. I firmly believe that you will excel in the finals as well and enter XuanTian Palace.”\u003c/p\u003e\n\u003cp\u003eHe had no other choice. If his superiors knew of what’d occurred before, then his days in XuanTian Palace were at an end. Compared to the benefits that Governor Sang Tan and the other two offered, his position at XuanTian Palace was much more important. Not to mention, offending a God Tier Master? No normal person would do so. So no matter how dejected and vengeful he currently felt, he could only swallow his blood, sweat and tears and display none of it.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing smiled faintly. “That’s good. But Master Er Chun, are you feeling unwilling? Your reaction was rather slow.” After leaving that last mocking sentence behind, he drifted away casually, holding onto Shangguan Bing’er’s hand as they turned to leave.\u003c/p\u003e\n\u003cp\u003eHe’d left the address of the inn he was staying at when he signed up, and someone would naturally be by with the paperwork for the finals.\u003c/p\u003e\n\u003cp\u003eThe Heavenly Jewel Masters below parted before him, and the pair left under a sea of enthusiastic gazes.\u003c/p\u003e\n\u003cp\u003eBack on the judges’ panel, Governor Sang Tan had actually lapsed into a coma from his sheer rage. Er Chun didn’t dare harbor ulterior motives after what’d just happened, so he made his selection anew and picked two more for the finals, finally closing the curtains on this farce.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er was a bit anxious after they returned to the inn. “Little Fatty, aren’t you being a bit too high profile? You’re not a God Tier Consolidating Equipment Master yet! It’ll be too easy for you to be revealed after you go to XuanTian Palace.”\u003c/p\u003e\n\u003cp\u003e“Who said I am not?” Zhou Weiqing chuckled. “I can play at being a God Tier Consolidating Equipment Master with the appropriate paper and materials. Although my cultivation isn’t yet at the Heavenly King level, it’s not too difficult to complete a God Tier Consolidating Equipment Scroll with the aid of Saint Energy.”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er fell silent in surprise, she really found it hard to believe Zhou Weiqing’s words. “Isn’t it too easy for you to be a God Tier Consolidating Equipment Master? Don’t you need more experience?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing shook his head. “You don’t get it. Because of Saint Energy, I have a few Stored Skills that can absolutely became heaven defying throughout the course of crafting a Consolidating Equipment Scroll. When has your husband ever indulged in braggadocio? You’ll see when the time comes.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing had come up with two plans after learning of the XuanTian Trials. The first centered around Shangguan Bing’er. With her cultivation level at Seven Jewels, it would be a snap of the fingers to become a core disciple of XuanTian Palace. She would be the key player then and he would be support, hidden in the shadows. There would certainly be a chance to investigate the matter of the Spatial Teleportation Gem within the palace. This was also a more conservative approach as well and less easy to be detected. The only problem was Shangguan Bing’er’s captivating looks. Zhou Weiqing hadn’t revealed his strength before because it was better for him to stay out of sight in the shadows and easier for him to make his moves.\u003c/p\u003e\n\u003cp\u003eAlas, who would’ve thought that they’d run into such depraved affairs during the Trials? If he still refused to take action, then he wouldn’t even have the right to enter the finals. Besides, that Sang Tan had crossed his bottom line. Zhou Weiqing had just gone with the flow and disposed of the good-for-nothing disciples as well, picking the second plan.\u003c/p\u003e\n\u003cp\u003eThe second plan was naturally the God Tier Consolidating Equipment Master identity that Zhou Weiqing had mentioned before. Compared to the other, this plan was much tougher to pull off, but also more watertight. With this identity, in the future if Zhou Weiqing and Shangguan Bing’er were forced to use their God Tier Consolidated Equipment, it wouldn’t elicit suspicion. Even though he would be entering as a God Tier Consolidating Equipment Master, Zhou Weiqing would still conceal his level of cultivation. This plan’s only problem lay in that it was a high profile one. Entering XuanTian Palace as a God Tier Master would undoubtedly draw too much attention from the Palace’s senior executives. It’d be much more difficult to take any further action. But at the same time, there was higher likelihood that they would come into contact with the Spatial Teleportation Gem.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eThe W’Batu Governor Mansion.\u003c/p\u003e\n\u003cp\u003e“Master, are our kids dead for nothing?” Sang Tan’s breathing was labored as he smacked his thick palm savagely on the table.\u003c/p\u003e\n\u003cp\u003eThere were only four present. Aside from him and Er Chun, the other two had also lost their sons today.\u003c/p\u003e\n\u003cp\u003eEr Chun’s facial muscles twitched as he pointed at the pile of wealth on the table. “I will return you these items. You have seen for yourself today… how matters weren’t under my control at all. Your sons are dead, but…” Emphasis grew in his tone. “You’re still alive.”\u003c/p\u003e\n\u003cp\u003eHe suddenly rose after this sentence and left, leaving behind three people with resentful expressions.\u003c/p\u003e\n\u003cp\u003eThese three were heavyweights in W’Batu City, but at the moment, none of them could actually give voice to any of the rage and resentment they felt.\u003c/p\u003e\n\u003cp\u003eThat was a God Tier Consolidating Equipment Master! Was this someone they could afford to offend? Er Chun’s last line had been correct. Although their sons were dead, they were still alive. If they dared seek revenge against a God Tier Consolidating Equipment Master, XuanTian Palace would never let them hear the end of it. XuanTian Palace was one that dominated XuanTian Continent, but even they only had two God Tier Consolidating Equipment Masters in residence. Those two were the absolute top existences within the Palace and had supreme positions. Even the current Palace Master had to treat them with all decorum.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing returned to his room with Shangguan Bing’er after dinner and was about to engage in a bout of lovemaking when a respectful voice sounded from outside the door.\u003c/p\u003e\n\u003cp\u003e“God Tier Master, Er Chun requests an audience.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s eyes darted around as he wiped off his leering expression towards Shangguan Bing’er. He became lofty and relaxed, almost as if he’d stepped into another body. He responded faintly, “Come in.”\u003c/p\u003e\n\u003cp\u003eEr Chun walked in with a respectful expression when the door opened. The awkwardness and arrogance from the day had disappeared. He was completely submissive and held something in his hands.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing sat down properly and didn’t invite him to sit. “Master Er Chun, what business do you have?”\u003c/p\u003e\n\u003cp\u003e“I’m not qualified for the title of master.” Er Chun responded hastily. “Please just call me by my name. I’m here to bring the finals qualifications to you and your wife.”\u003c/p\u003e\n\u003cp\u003eHe handed over the items as he spoke. There were two red envelopes and two black medallions.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing didn’t even look at them before he stored them into his Sumeru Ring with a wave. “Is there anything else?” He said passively.\u003c/p\u003e\n\u003cp\u003eEr Chun sweated profusely. He’d offered to bring these things personally because he wanted to repair his image in Zhou Weiqing’s eyes. Otherwise he’d be done for if this God Tier Consolidating Equipment Master said a few bad things about him in the XuanTian Palace. He didn’t have much of a background within the Palace, otherwise he wouldn’t have been sent to a city so far away.\u003c/p\u003e\n\u003cp\u003e“Sir, I’ve already reported your appearance to the upper echelons. It was indeed my greed overcoming my reason this morning and clouded my eyes. However, I hope Master can understand that our lives aren’t well off in a forsaken place like this! We need to come up with our own funds to purchase a Consolidated Scroll. We really have no choice. Your safety is of paramount importance and I wish to personally escort the two of you to the Heavenly City. Also... this is just a small gift. It’s not much, I hope you will accept it.”\u003c/p\u003e\n\u003cp\u003eAnother box appeared in his hands as he spoke, as if he was turning a magic trick, and respectfully brought it up to Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was slightly surprised when he took the box. A slight fragrance had wafted in the air when the box appeared. The unique scent was that of aloeswood.\u003c/p\u003e\n\u003cp\u003eAloeswood was also present on Boundless Mainland, and some Consolidated Scrolls used it in their crafting. What was inside the box was definitely priceless given that the container was made out of aloeswood.\u003c/p\u003e\n\u003cp\u003eOrdinarily speaking, one didn’t open a gift as soon as they received it, in front of the giver. However, Zhou Weiqing didn’t have that concern at all. He flicked open the exquisite lock on the aloeswood box and opened it.\u003c/p\u003e\n\u003cp\u003eThe box itself was rather heavy. It was a dense wood that would actually sink in water. As soon as the box was open, Zhou Weiqing’s eyes widened with delight when he saw what was inside. Even someone as widely experienced as him was quite surprised when he saw what was inside.\u003c/p\u003e\n\u003cp\u003eThere was a layer of yellow silk inside the box, giving the contents an additional noble feel. There were two pearls inside the size of an infant’s fist, glowing with a soft, faint and gentle hue.\u003c/p\u003e\n\u003cp\u003eEven an ordinary pearl was priceless when that large and flawless. These two were golden in color, marking them as the rarest of pearls. Furthermore, they were almost the exact same sizes, making them rare, precious treasures.\u003c/p\u003e\n\u003cp\u003ePearls were divided into white, black, and golden, going from most common to rarest respectively. Zhou Weiqing found himself even hard pressed to estimate how valuable these were.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er’s eyes were sparkling. All girls liked jewelry, especially when it was as precious and beautiful like these rare golden pearls.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-25-chapter-238-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-239-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-239-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
