{"id":51894,"no":720,"title":"Chapter 244: Fastest Consolidating Equipment Scroll Master in History (1)","content":"\u003cp\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e\u003cstrong\u003eChapter 244: Fastest Consolidating Equipment Scroll Master in History (1)\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBefore he began making Consolidating Equipment Scrolls, the vast majority did not quite believe Zhou Weiqing’s claim of being the fastest Consolidating Equipment Scroll Master in history. But now, all doubts and questions had disappeared like a puff of smoke with his performance.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAnd this was just the beginning. As the radiance of the two Consolidating Equipment Scrolls spilled out, Zhou Weiqing had already slid over three chi, the Consolidating Pen in his hand faintly swishing back and forth, the remaining Consolidating Ink had already been shaken off, none remaining. This was the wonder of a top-grade Consolidating Pen, able to be fully controlled at will with the skill of the Consolidating Equipment Master.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHis Consolidating Pen moved again and opened two completely different bottles of Consolidating Ink, but his penmanship was as smooth and natural as before. The radiance of the first two Consolidating Equipment scrolls had not even completely faded as two more rays of light began shining.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt was too dazzling. As everyone watched, they could see two rays of shimmering dark gold light glittering from left to right on Shangguan Bing’er’s wings, like waves billowing to and fro.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eFrom left to right, Zhou Weiqing made fifty Consolidating Equipment Scrolls in only half the time it took to drink a cup of tea. By the time the last two rays of light soared into the air, he was already back at the first scroll, his left hand flourishing, sweeping up every completed scroll into his hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe dark gold light faded and Shangguan Bing’er straightened up.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere was total silence. Zhou Weiqing scanned the crowd; he could clearly see almost every XuanTian Palace powerhouse’s jaw hanging open.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen had they ever seen such a terrifying Consolidating Equipment Master?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eYes, the word they were all thinking of to describe Zhou Weiqing right now was indeed ‘terrifying’. Even the other two God Tier Consolidating Equipment Masters of the XuanTian Palace had never had this effect on them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBefore, in the eyes of these Heavenly Jewel Masters, God Tier Consolidating Equipment Masters were mysterious and formidable. But Zhou Weiqing had completely upending that preconception.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen one had real and formidable power, his arrogance was no longer arrogance, but was the showing of self-confidence and actual power. Zhou Weiqing had proven himself and made these high-level XuanTian Palace people truly recognize him for the first time.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNever mind the Heavenly Jewel Masters, even the two God Tier Masters behind Zhou Weiqing has been rocked to the core. Dreamwake was still relatively okay, but Nie Han was currently staring wide-eyed, unable to help himself.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn such a short amount of time fifty Consolidating Equipment Scrolls were made using fifty different Consolidating Inks. What kind of power and latent potential was this?\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOriginally, Nie Han had felt that it was due to luck and shameless reliance on his Time attribute that had enabled Zhou Weiqing to produce a God Tier Master Consolidating Equipment Scroll. This young man’s latent potential was superb, but his foundation was perhaps barely stronger than an ordinary Grandmaster Consolidating Scroll Master.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHowever, Zhou Weiqing’s display just now had fully shown that he had more than just latent potential. The use of different Consolidating Inks and production methods for the fifty different scrolls proved without a doubt that he was a true Consolidating Equipment Master with training and legacy.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eApplause rang out. The first to clap was XuanTian Palace Master Dong Fang.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOnly then did the Heavenly Jewel Masters of XuanTian Palace genuinely react, launching into thunderous applause, spurred on by the two God Tier Masters and the four Grand Elders.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe four Grand Elders looked at Zhou Weiqing much more kindly now, and they now completely overlooked Zhou Weiqing’s age. In this world, if you really had power, nothing else really mattered all that much.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Master of XuanTian Palace smiled. “Stunning. I can only use stunning to describe that performance. I’m convinced no one present harbors any doubt about you any longer. From now on, Consecrated Zhou is one of the cornerstones of XuanTian Palace going forward. Now I will announce for the banquet to formally begin.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter Zhou Weiqing’s performance the banquet became animated; The XuanTian Palace Master personally went to Zhou Weiqing and toasted him. With this initiative, more and more followed in coming up and offering him a toast. Fortunately, ranks were obvious in XuanTian Palace. Only those Elders and above ranking dared to come and toast him. As for the high-level members on the periphery, they just raised their cups from a distance with scorching hot gazes. \u0026nbsp;\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt wasn’t just Zhou Weiqing who was offered drinks. Shangguan Bing’er’s position increased greatly as well due to her display. At her age, having a seven-Jewel cultivation stage, as well as those four God Tier Consolidated Equipment Assembly Set Wings. Her rank as Elder had now been solidified. After all, to reach the seven-jewel stage at such a young age, it was not out of the question for her to reach the Heavenly King stage. Especially since she had Zhou Weiqing, such a formidable God Tier Consolidating Equipment Master, for a husband.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEveryone present was a powerhouse, and thanks to their robust Heavenly Energy it was not easy to get them drunk. So even though the atmosphere at the banquet was quite festive, no one had too much to drink.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Weiqing, let me offer you a toast.” Dreamwake appeared before Zhou Weiqing, holding her cup, looking at him with her pretty, sparkling eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing clinked glasses with her and drained it. The alcohol was having some effect on him, so much so that his eyes were starting roam. As the saying goes, it’s easier to alter mountains and rivers than alter a person’ characters. It’s just who he was. When he saw a pretty girl he couldn’t help but get restless.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDreamwake seemed not to notice Zhou Weiqing’s wanton gaze. She smiled. “Weiqing, if I’m not mistaken the reason you were able to make a Consolidating Equipment Scroll before was because you merged the Wind attribute with the Space attribute. But, can you tell me why you have such strong power of control? How can you be so accurate while working so fast? I didn’t sense you using the Time attribute.” \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing shrugged. “Practice makes perfect. With that much practice normally, I have already committed all these ordinary Consolidating Pen strokes to muscle memory, so when the time comes, it is only natural that I can work effortlessly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe would never tell her it was his Saint Energy guiding him that made him so perfect. With his Saint Energy present, any other attribute could be fused without affecting his Consolidating Equipment Scroll making in any way. Plus it was only a Grandmaster Consolidating Equipment Scroll, nothing difficult to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDreamwake frowned. “Is that so? I wonder if I can come to you some time and learn the secrets of your scroll making?”\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing chuckled. “Of course. You’re welcome any time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e...\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe banquet came to a successful close. At that moment you could say Zhou Weiqing had finally been formally accepted into XuanTian Palace. His Consolidating Equipment Scroll performance at the banquet had had a large effect. At the very least, no one would ever again doubt his ability. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing and Shangguan Bing’er stayed at XuanTian Citadel, where they were set up in the highest power position right in the center of the Citadel. Alas, his quarters made Zhou Weiqing feel a bit helpless.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe interior of XuanTian Citadel was vast. Zhou Weiqing and Shangguan Bing’er had been set up on the sixth floor of the seven-storey XuanTian Citadel. On the seventh floor was XuanTian Palace Master’s quarters and the place where the highest-level meetings were convened, dubbed the Heavenly Hall. All important XuanTian Citadel matters were decided in the Heavenly Hall.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAside from the seventh floor, the highest-ranking members lived on the sixth floor. Zhou Weiqing was of course delighted to be so close to core of the XuanTian Citadel. However, the problem was, he wasn’t the only one living on the sixth floor. The four Grand Elders also lived there. As for the other two God Tier Consolidating Equipment Masters, Nie Han and Dreamwake actually even move back into this level to stay after Zhou Weiqing arrived.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSurrounded by six supreme powerhouses, Zhou Weiqing didn’t dare act recklessly. He wasn’t too clear about Nie Han and Dreamwake’s cultivation, but they were at least top level Heavenly King stages. And thinking about the four Heavenly Emperors being present here made his blood run cold. How was he supposed to have room to scout around for the Spatial Teleportation Gem? Extending his senses to scout out wouldn’t work; those four Grand Elders would definitely sense it right away.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith no other choice left, Zhou Weiqing could only settle down first. He was newly admitted; a probationary period of supervision was unavoidable. Anyway, he had plenty of time. He might as well relax a bit. Aside from cultivating, he could spend each day researching Consolidating Equipment Scroll making, and exchange pointers with Nie Han and Dreamwake.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe higher levels of the XuanTian Citadel had extremely thick atmospheric energies, even surpassing that of the Heaven’s Expanse Palace. Cultivating here would naturally lead to twice the gains with half the effort.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e...\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eA month passed in the blink of an eye. Zhou Weiqing’s Saint Energy had thoroughly stabilized at the thirty-seventh stage, and was beginning to steadily increase. More importantly, the rate of increase was even faster than before. Zhou Weiqing could sense that this time there shouldn’t be a bottleneck every stage like in the past, at least before he consolidated his Saint Core Nucleus. After all, he had formally entered the Heavenly Dao Energy stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn fact, if anyone learned how he had broken through to Heavenly Dao Energy they’d likely die of envy. A mere several months had been enough time for him to successfully breakthrough, how could that even be considered a bottleneck?! Of course, this was the natural advantage of Saint Energy.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs compared to his advancements in cultivation, on the Consolidating Equipment Scroll- making front, Zhou Weiqing could only describe his advancement speed as a major leap. He had originally gained the legacy and teachings of the Legacy of Strength Sect from Huyan Aobo and Duan Tianlang, and Dreamwake and Nie Han were also God Tier Consolidating Equipment Masters. With the three of them trading pointers together on Consolidating Equipment Scroll making, it was definitely an invaluable experience for Zhou Weiqing. The Consolidating Equipment Scroll \u0026nbsp;Masters on the XuanTian Continent had some different ideas about making Consolidating Equipment Scrolls, compared to those on Boundless Mainland. You could even say they had forged their own path. This was actually a huge help to Zhou Weiqing. At the same time, although he often had a different point of view than the other two God Tier Masters, since he was known to be from the ‘reclusive sect’ of the Legacy of Strength, it wouldn’t lead to any suspicions.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-243-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-244-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-244-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
