{"id":51895,"no":721,"title":"Chapter 244: Fastest Consolidating Equipment Scroll Master in History (2)","content":"\u003cp\u003e\u003cstrong\u003eChapter 244: Fastest Consolidating Equipment Scroll Master in History (2)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\" id\u003d\"docs-internal-guid-3126549c-4939-aed8-c594-fb304bcb56a1\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe days passed by just like that, one after the other. It had been a long time since Zhou Weiqing had enjoyed such a relaxed life. Each day was very fulfilling and full of constant self improvement. Of course, he would also create several Consolidating Equipment Scrolls. However, because of his cultivation level, no one forced him to create God Tier Consolidating Equipment Scrolls. For XuanTian Palace, it was clearly more important for them to treat him as a backup God Tier Consolidating Equipment Master to groom for the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing was more than happy with this. However, for the sake of proving his value, he would still create and submit ten sets of Grandmaster Consolidating Equipment Scrolls and a set of Zong Stage Consolidating Equipment Scrolls.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eCompared to Zhou Weiqing’s constant improvement, Shangguan Bing’er’s progress was actually even more obvious. She was not a Consolidating Equipment Master and did not need to spend her attention on other things. In her daily life with Zhou Weiqing, besides making love to him, all of her time and effort was invested into cultivation. With the impetus from Zhou Weiqing’s Saint Energy in addition to her own hard work, the rate of her cultivation growth shocked even Zhou Weiqing. In fact, she had already started to advance towards the upper level seven-Jeweled Stage. At this rate, Zhou Weiqing estimated that there was a possibility of Bing’er attempting to breakthrough the eighth-Jeweled Stage in less than three months. One must know that even Shangguan Fei’er, who had lived and cultivated in the superior environment of the Heaven’s Expanse Palace since young, had not yet reached the eighth-Jewel Stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e...\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Weiqing, we have to head to Heavenly Hall for a meeting.” Dreamwake’s melodious and pleasant voice was transmitted from outside the door.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEvery dwelling in this XuanTian Citidal’s six levels was completely independent, extremely spacious and each room was separate. Without the owner’s permission, even the other high level XuanTian Palace executives that stayed here did not dare to enter someone else\u0027s territory.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eUpon hearing Dreamwake’s voice, Zhou Weiqing rushed over to open the door.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eToday, Dreamwake was wearing a long light-purple dress and looked even more graceful than usual.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing had become rather familiar with her over the past month or so. The attractiveness of this beautiful God Tier Consolidating Equipment Master was even greater than he had imagined. Besides her remarkable beauty, she was also endowed with great intelligence. This smart lady was extremely knowledgeable and could be said to be both a helpful teacher and a knowledgeable friend to Zhou Weiqing in the field of Consolidating Equipment Scrolls. Dreamwake was also his most frequent visitor. In contrast, Zhou Weiqing had not caught a glimpse of the XuanTian Palace Master since the banquet party.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWith regards to the contact between Zhou Weiqing and Dreamwake, Shangguan Bing’er only said a single sentence to him, “Elder sisters will never agree to you bringing back another one. You should be very clear about this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing’s answer was, “Admiration, it is purely admiration only…” Of course, the expression on his face was very splendidly unique when he gave this answer. At the same time, he really did warn himself daily to restrain himself, to no longer get involved with any other girls. H also tried his best to practice this in reality. Besides matters related to Consolidating Equipment Scrolls, he seldom interacted with Dreamwake, and never attempted to inquire about Dreamwake’s personal affairs. All he knew about her was that she was not married and was twenty nine years old this year.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs Zhou Weiqing involuntarily took a few more glances at Dreamwake’s body, he curiously asked, “Meeting? What meeting?” Even after so much time here, he had not visited the seventh level.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDreamwake resolutely said, “Quickly follow me. Every time a meeting has been called in the Heavenly Hall, it is definitely regarding matters of paramount importance.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Okay.” Zhou Weiqing responded. He only followed Dreamwake out after notifying Shangguan Bing’er, who was cultivating in the room.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing walked shoulder to shoulder with Dreamwake as he asked in a puzzled manner, “How are we going up to the seventh storey?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDreamwake faintly smiled as she replied, “Just follow me. Only the Palace Master has the authority to open the seventh storey. It will naturally be opened when there is a meeting in Heavenly Hall.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile she spoke, she had already brought Zhou Weiqing to the center of the sixth storey. This place was normally an empty circular space. However, there was now a strange symbol on the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing was surprised when he saw this symbol, because it was actually so similar to his own\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eSix Ultimate Godly Light Formation. The symbol was that of a six pointed star, but there was an additional circle on the outermost layer.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Come.” Dreamwake took the lead and walked onto the six pointed star symbol. Zhou Weiqing knew that this was likely to be a type of Teleportation Formation. No wonder he had never seen the seventh storey before.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhen the two of them stood on the six pointed star, Dreamwake infused some Heavenly Energy into the formation. Light flashed, and they had already appeared in another location.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIt was an enormous hall, and the most peculiar thing about it was the dense light of treasure around them. Reverence emerged in Zhou Weiqing’s heart. It seemed that this seventh story of XuanTian Citadel was not an actual place, but a domain similar to the Lustre Spatial Realm. Although it was nowhere near as gigantic, complete and real, the possession of such a domain that was similar to the Lustre Spatial Realm was enough testament to how powerful XuanTian Palace was.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere was an oval table at the center of the hall. The four Grand Elders were already seated on the left, while God Tier Master Nie Han sat alone on the right, at the second seat opposite them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe master seat was still empty, but that giant high-back chair there quickly drew Zhou Weiqing’s gaze.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis high-back chair was enormous. The back of the chair alone was already slightly over ten feet tall. It was made entirely from an unknown material that was akin to extremely transparent black crystal, and was carved into the shape of a giant black dragon. The dragon’s head was located at the middle of the chair’s back. Two red fist size gems were embedded on the head as its eyes. The flickering red light gave it a rather bewitching aura.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eGiant black dragon? Zhou Weiqing had never heard of this before. He secretly pondered in his heart.\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWas this a Terror Sea Dragon? It can’t be. A Terror Sea Dragon should not be black, but deep blue.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eDreamwake silently walked to the most front seat on the right side of the oval table and sat down, while Zhou Weiqing naturally sat on the third seat.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe eyes of the four Grand Elders facing him naturally fell on his body. Under the attention of for Heavenly Emperor Stage experts, even Zhou Weiqing could not be completely comfortable.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLike how the Heaven’s Expanse Palace or any of the other five Great Saint Lands, each of them possessed a specialization. Naturally, the XuanTian Palace also had a specialization of its own, namely the Tenebrous Attribute. That\u0027s right, Tenebrous, not Darkness. There was a difference between the two.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Tenebrous Attribute seemed to be unique to XuanTian Palace, and every high level core executive had it amongst their Jewel Attributes. This included the Elders, Grand Elders and even Dreamwake and Nie Han. Zhou Weiqing could be said to be the exception. However, if one considered it, he did actually have a rather unique connection to this Tenebrous Attribute indeed.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs for the difference between the two attributes, the Tenebrous Attribute was half a rank higher than the Darkness Attribute, and the former had several innate properties similar to the Demonic Attribute. It could be said to be a new attribute made from the fusion of the Darkness and Demonic attributes. Of course, compared to the true Demonic Attribute, its power was still somewhat inferior.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eMoreover, none of those seated here had single attribute Elemental Jewel. Besides the Tenebrous Attribute, the four Grand Elders opposite Zhou Weiqing had the Water, Fire, Earth and Wind Attributes respectively. Hence, the members of XuanTian Palace normally called them Water Elder, Fire Elder, Earth Elder and Wind Elder. In contrast, ordinary Elders were known by their names.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNie Han’s Jewel Attributes were naturally the Spatial and Tenebrous Attributes. On the other hand, although Zhou Weiqing could be considered to be most familiar with Dreamwake out of all the XuanTian powerhouses, he was actually not fully aware her Elemental Jewel Attributes. He only knew that her Elemental Jewel was actually the same as his own, the Alexandrite Cat’s Eye Jewel. This meant that Dreamwake also had at least four Elemental Jewel Attributes. Perhaps this was the reason why her status was even higher than Nie Han even though they were both God Tier Consolidating Equipment Masters.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing had always been rather curious with regards to Dreamwake. She was only twenty nine years old! Yet, her cultivation was already at least at the Heavenly King Stage. How the hell did she cultivate? In the entire Boundless Mainland, he had never even heard of a Heavenly King under the age of thirty.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThis place was the so-called Heavenly Hall. The four Grand Elders seated opposite Zhou Weiqing wore rather solemn expressions. From this, one could tell that the agenda for the meeting today was important to XuanTian Palace. This point caused Zhou Weiqing to be extremely puzzled. What was so important to the upper echelons of XuanTian Palace? One must know that they did not have anymore external enemies in the entire XuanTian Continent. In fact, their overwhelming power allowed them to be an overlord. Even if some of the lower ranks were discovered to be corrupt, the upper echelons did not need to be so serious.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn addition, Zhou Weiqing discovered some unusual points. The God Tier Consolidating Equipment Master Nie Han seated beside him also seemed to be clueless about what had happened, and was likewise somewhat dazed like himself. However Dreamwake\u0027s expression was just as grim as the Grand Elders. She was clearly aware of what was going on. Since they were all God Tier Masters, why was only Dreamwake aware of the important internal matters of XuanTian Palace beforehand?\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile such thoughts swirled in Zhou Weiqing\u0027s heart, a shadowy figure stealthily appeared in the master seat. It was the masked XuanTian Palace Master.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEveryone hastily rose and bowed slightly towards the XuanTian Palace Master.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe XuanTian Palace Master waved his hands, “No need to be overly polite.” His masked face turned towards Zhou Weiqing, “How is Consecrate Zhou adjusting to life within XuanTian Citadel?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing smiled as he inclined his head, “Life is not bad. There are plenty of resources for me to use. It is much better than before when I had to personally search for materials to craft Consolidating Equipment Scrolls. Moreover, I can seek advice from Consecrate Dreamwake and Nie Han. I am very happy with my decision to join XuanTian Palace.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe XuanTian Palace Master nodded, “That\u0027s good. Everyone be seated.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eEveryone sat down again as the XuanTian Palace Master continued in a low voice, “Let us go directly into the heart of the matter. A Terror Sea Dragon has recently been active in the coastal regions, and it has destroyed over a dozen ocean faring ships. This is a huge loss for us. If we do not take action, it will likely grow even more rampant. Everyone, let me know if you believe we should directly take action.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eZhou Weiqing was instantly stunned upon hearing the three words, Terror Sea Dragon.\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eI couldn\u0027t have jinxed it right? I can\u0027t believe a Terror Sea Dragon has appeared at a sea bordering continent like the XuanTian Continent.\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAt the same time, he was inwardly thankful that he had not encountered this fellow on his trip across the sea. However, he now understood why the upper echelons of XuanTian Palace were so serious. It was indeed exceedingly difficult to deal with a Heavenly God Stage beast that was even in its most familiar territory, the ocean.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-244-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-244-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-244-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
