{"id":51903,"no":729,"title":"Chapter 247: Battling Dreamwake (2)","content":"\u003cp\u003e\u003cstrong\u003eChapter 247 – Battling Dreamwake (2)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRight.\u0026nbsp;Zhou Weiqing’s Dragon Silencing Seal was about to finish.\u0026nbsp;If Dreamwake could cheat, so could he!\u0026nbsp;He poured a tiny bit of his Saint Energy into it, causing the rate at which it formed to increase dramatically.\u0026nbsp;After enduring just one clash from the opposing image, it became fully formed.\u003c/p\u003e\n\u003cp\u003ePurple-red light flashed past him, then disappeared. Zhou Weiqing could already see a violet-red vortex appearing about Dreamwake’s head. \u003cem\u003eHeh heh!\u0026nbsp;Easy.\u0026nbsp;Once I make it temporarily impossible for you to use your Stored Skills or your Consolidated Equipment, you won’t stand a chance against me\u003c/em\u003e!\u003c/p\u003e\n\u003cp\u003eHowever… just as that purple-red light shot out, Dreamwake suddenly pointed her draconic claws at Zhou Weiqing, causing a streak of black light to shoot at him.\u0026nbsp;Zhou Weiqing wasn’t able to dodge either.\u003c/p\u003e\n\u003cp\u003eThe two streaks of light landed simultaneously.\u0026nbsp;Dreamwake’s body trembled, followed by all of her Legendary Set items vanishing without a trace.\u0026nbsp;Zhou Weiqing wasn’t much better off.\u0026nbsp;He discovered, to his amazement, that he had lost connection to his Hate Ground No Handle set.\u0026nbsp;Although the set remained on his body, it had lost all of its strength-multiplying effects.\u0026nbsp;And… he didn’t seem to be able to summon any further techniques at all?\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNo way.\u0026nbsp;That’s a crazy coincidence.\u003c/em\u003e Shocked, the two stared at each other with rather strange and puzzled looks in their eyes.\u003c/p\u003e\n\u003cp\u003eAlthough there were differences in the techniques they had just used, the effects had been essentially the same.\u0026nbsp;Both made it temporarily impossible to use Consolidated Equipment and Stored Skills.\u003c/p\u003e\n\u003cp\u003eDreamwake’s technique was a bit faster than Zhou Weiqing’s Dragon Silencing Seal, but Zhou Weiqing’s Dragon Silencing Seal could be used multiple times.\u0026nbsp;It was hard to say which technique was superior.\u003c/p\u003e\n\u003cp\u003eSince he had lost his connection to the Hate Ground No Handle set, Zhou Weiqing went ahead and discarded it.\u0026nbsp;He stared suspiciously at Dreamwake.\u0026nbsp;“What was that technique just now?\u0026nbsp;How could you use such a powerful technique without needing time to accumulate energy?”\u003c/p\u003e\n\u003cp\u003eDreamwake snorted coldly.\u0026nbsp;“And why should I tell you?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing shrugged his shoulders helplessly.\u0026nbsp;“If you don’t want to explain, just forget about it.\u0026nbsp;However… this is just the beginning.”\u0026nbsp;He suddenly leapt off the ground with his right leg, shooting straight towards Dreamwake.\u0026nbsp;It was quite the coincidence, or perhaps some sort of unspoken accord, as Dreamwake did exactly the same thing as Zhou Weiqing made his move.\u003c/p\u003e\n\u003cp\u003eIn truth, the two were thinking the exact same thing.\u0026nbsp;Neither knew how long the enemy technique would last for, and once their own sealing techniques wore off the opponent would be able to regain their Consolidated Equipment and Stored Skills.\u0026nbsp;If that happened, doom would be swift and certain.\u0026nbsp;It was best to seize the advantage and deal a game-ending blow before that happened.\u003c/p\u003e\n\u003cp\u003eWithout their Legendary Sets, both were now far slower and weaker.\u0026nbsp;The speed at which they used Heavenly Energy, however, was just as fast.\u0026nbsp;In the end, Dreamwake was a bit faster and she delivered a clawing strike with her right hand towards Zhou Weiqing’s head.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing wasn’t able to use any techniques, and even his Six Ultimate Godly Light Formation having been sealed by Dreamwake.\u0026nbsp;In the face of this attack, he only revealed a faint, odd smile on his face.\u003c/p\u003e\n\u003cp\u003eHe didn’t dodge.\u0026nbsp;Instead, he struck out with twin claws of his own.\u0026nbsp;It looked as though he was aiming at Dreamwake’s shoulders, except… they seemed to be inching downwards slightly.\u0026nbsp;This was a direct ‘attack’, which naturally would be faster than a sweeping attack.\u0026nbsp;This meant that Zhou Weiqing’s strike would land first.\u003c/p\u003e\n\u003cp\u003e“You pervert!”\u0026nbsp;Dreamwake was enraged.\u0026nbsp;She leapt upwards, delivering a kick towards Zhou Weiqing’s flank.\u0026nbsp;Both were fighting at the six-Jeweled cultivation level.\u0026nbsp;Although they were now slower than previously, they were still quite fast.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing didn’t dodge, instead lifting up his own right leg and using it to block Dreamwake’s kick.\u003c/p\u003e\n\u003cp\u003eA hint of a cold smile appeared at the corner of Dreamwake’s lips. \u003cem\u003ePreviously, when you had the Hate Ground No Handle set, I was indeed weaker than you.\u0026nbsp;But now that you aren’t strengthened by any set, do you still think that you are stronger than me when I have the benefit of dual Physical Jewels?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBoom!\u0026nbsp;Their legs collided in midair.\u0026nbsp;A piercing pain spread throughout Dreamwake’s entire body from her right leg, which had just dispelled that earlier feeling of numbness.\u0026nbsp;Once more, she retreated lightning-fast.\u003c/p\u003e\n\u003cp\u003eShe had lost again.\u0026nbsp;She could clearly sense that Zhou Weiqing’s right leg didn’t just vastly surpass her in strength, it was also incredibly tough.\u0026nbsp;She felt as though she had just kicked a steel pillar!\u0026nbsp;Although her leg wasn’t broken by the collision, it had suffered a significant injury.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHow was this possible\u003c/em\u003e?\u0026nbsp;Unfortunately, Zhou Weiqing didn’t give her any chance to consider this question.\u0026nbsp;After winning in that clash of kicks, he used his right leg to propel himself off the ground and pounce like a hungry tiger towards Dreamwake.\u0026nbsp;If he actually managed to land this pounce… ehehehe.\u0026nbsp;Not even Shangguan Xue’er had ‘survived’, much less a Dreamwake who was limited to the six-Jeweled stage.\u0026nbsp;Zhou Weiqing’s lecherous skills were quite outstanding.\u003c/p\u003e\n\u003cp\u003eDreamwake’s eyes suddenly narrowed and darkened.\u0026nbsp;Until now, she had yet to truly view Zhou Weiqing as a worthy adversary for herself.\u0026nbsp;Even though she had lowered herself to the six-Jeweled stage, she still innately viewed herself as a Heavenly King powerhouse.\u0026nbsp;By all rights, she should vastly surpass Zhou Weiqing in both battle experience as well as understanding how to apply Heavenly Energy.\u003c/p\u003e\n\u003cp\u003eHowever, reality had proven that this fellow was even harder to deal with than she had anticipated, and there was clearly something strange about his right leg.\u003c/p\u003e\n\u003cp\u003eDreamwake’s power suddenly increased explosively.\u0026nbsp;As Zhou Weiqing pounced at her, Dreamwake suddenly flew backwards and launched a vicious kick at the ground with her left leg.\u0026nbsp;She borrowed from the counter-force to spin through the air to dodge Zhou Weiqing’s pounce, then used her right hand to deliver a chop at the back of Zhou Weiqing’s neck.\u0026nbsp;At the same time, she delivered a lightning-fast kick with her left leg at Zhou Weiqing’s waist.\u0026nbsp;Her long, lithe leg stretched out, allowing her left foot to ‘hook’ itself around his waist and fasten herself to him.\u003c/p\u003e\n\u003cp\u003eHer flexibility was simply incredible!\u0026nbsp;Zhou Weiqing hurriedly lowered his head, dodging Dreamwake’s chop.\u0026nbsp;However, by now Dreamwake had already moved into close-combat range thanks to her hook-foot.\u003c/p\u003e\n\u003cp\u003eClearly, it wouldn’t be easy to throw her off.\u0026nbsp;Dreamwake had already begun to make her move.\u0026nbsp;She twisted downwards, sending Zhou Weiqing flying in the opposite direction while latching onto the clothes on his back and sending him smashing into the ground.\u003c/p\u003e\n\u003cp\u003eIn truth, Zhou Weiqing should’ve celebrated the fact that Dreamwake still wasn’t able to use any strength with her right leg.\u0026nbsp;If she was, it wouldn’t have been a simple grapple/toss.\u003c/p\u003e\n\u003cp\u003eCrack!\u0026nbsp;Zhou Weiqing was sent smashing into the ground, quite dazed.\u0026nbsp;He skidded over ten meters forwards before finally managing to come to halt.\u0026nbsp;Dreamwake didn’t press the attack, because she was still feeling tremendous pain pulse into her from her right leg.\u0026nbsp;She had to temporarily pause and press both hands against her right leg, sending pulses of faint blue light into it which made her feel a bit better.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHow could his muscles and his bones be even tougher than mine?\u0026nbsp;I’m…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eShe stared intently at him as he skidded away.\u0026nbsp;This was the first time Zhou Weiqing had come off the worse in their battle, and a questioning look was in Dreamwake’s eyes.\u0026nbsp;His actual combat ability had been far stronger than what she had imagined.\u0026nbsp;She was absolutely certain that not even a max level six-Jeweled Heavenly Jewel Master would be able to gain an advantage over him in combat.\u0026nbsp;How many secrets did he contain?!\u0026nbsp;He was a God Tier Consolidating Equipment Master, but it didn’t seem as though he had used some sort of special technique to increase his powers.\u0026nbsp;How could he have so much actual combat experience?\u003c/p\u003e\n\u003cp\u003eZhou Weiqing flipped to his feet.\u0026nbsp;Given his toughness and tenacity, this fall wasn’t able to injure him at all.\u0026nbsp;However, he felt a bit depressed.\u0026nbsp;In terms of close combat ability, he still wasn’t able to match those who had flexibility-enhancing Physical Jewels.\u0026nbsp;Fei’er had dominated him in a similar fashion long ago, and now history was repeating itself.\u003c/p\u003e\n\u003cp\u003eBoth had their own thoughts, but neither lessened their wariness of the other.\u0026nbsp;She continued to rub her leg, while he quickly replenished his own Heavenly Energy.\u0026nbsp;They were both hoping for the other’s sealing skill to disperse, allowing them to put on their Legendary Sets once more.\u003c/p\u003e\n\u003cp\u003eAlas, this entire exchange had taken less than ten seconds.\u0026nbsp;Their respective skills weren’t even close to being finished.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s eyes spun craftily, a naughty and delighted smile appearing within them.\u0026nbsp;He stood there without moving, simply flipping over his left hand and producing a long bow within it.\u0026nbsp;This wasn’t Consolidated Equipment, it was nothing more than an ordinary and real longbow that had been fashioned from Star Wood.\u003c/p\u003e\n\u003cp\u003eHe nocked the bow with three arrows, almost instantly pulling the bow to a full draw.\u0026nbsp;Then, with an ear-piercing twang, he sent all three arrows towards Dreamwake at lightning speed.\u003c/p\u003e\n\u003cp\u003eAt such close distance, Dreamwake wouldn’t be able to dodge even if she used her Heavenly King cultivation base.\u0026nbsp;She had no choice but to strike out with both palms, unleashing an awesome flood of Heavenly Energy which formed a shield to block those three arrows.\u003c/p\u003e\n\u003cp\u003eThese first three arrows were simply intended as a probe.\u0026nbsp;As they shot out, he hurriedly retreated backwards while shooting out one arrow after another.\u0026nbsp;Some he shot into the skies, some he shot straight at her, while some he shot in arcing curves.\u0026nbsp;Every single one of the arrows filled the skies with ear-piercing whistles as they shot out.\u0026nbsp;Every so often he would use the Twisting Bowstring Archery Skill, pouring his powerful Heavenly Energy into the arrows to give them even greater destructive force.\u003c/p\u003e\n\u003cp\u003eAfter just a few brief seconds, Dreamwake was unable to defend any longer.\u0026nbsp;She never would’ve imagined that Zhou Weiqing had this sort of technique at his disposal.\u0026nbsp;His archery skills could only be described as ‘godly’, as no matter where he fired the arrows would invariably come crashing down towards her at the most penetrating angles.\u0026nbsp;In addition, the arrows were filled with Zhou Weiqing’s Heavenly Energy.\u0026nbsp;Since both of them were limited to six-Jeweled Heavenly Energy, the only way for her to block these penetrating attacks was to use an even greater amount of Heavenly Energy.\u0026nbsp;Zhou Weiqing’s arrows were so fast and densely aimed that she didn’t even have the chance to use her Heavenly Dao Energy to absorb atmospheric energies to replenish her own energies.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis bastard!\u003c/em\u003e Dreamwake was enraged, but there was nothing she could do.\u003c/p\u003e\n\u003cp\u003e“You forced me to do this,” Dreamwake roared angrily. Suddenly, a surge of dense black energy exploded forth from her body. The dense Tenebrous Attribute energy instantly skyrocketed in power, forming an enormous black globe of light around her. When the endless stream of arrows Zhou Weiqing fired at her entered the range of that black globe of light, they fell completely silent and then were instantly corroded to the point of disappearing.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-247-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-247-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-247-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
