{"id":51907,"no":733,"title":"Chapter 248: Dragon Claws... (3)","content":"\u003cp\u003eNo wonder Xuantian Palace was so terrified of the Terror Sea Dragon and needed to make such lengthy preparations.\u0026nbsp;The Tenebrous Demon Dragon was already horrifyingly strong, and the Terror Sea Dragon was probably even above it in cultivation!\u0026nbsp;They would also be fighting it in its chosen environment, the sea.\u0026nbsp;No one who didn’t personally witness it in action would understand how powerful it was.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s cultivation level was the lowest of the group, and so he was located right in the middle of the Tenebrous Demon Dragon’s back.\u0026nbsp;In front of him was Palace Lord Dong Fang and Dreamwake, and by accident or design Dreamwake was less than a meter away from him.\u003c/p\u003e\n\u003cp\u003eViewing this dazzling woman from behind was quite a pleasing sight.\u0026nbsp;Dreamwake was a classic beauty, with slender shoulders and long, neat black hair which cascaded down her back like a waterfall.\u0026nbsp;As the wind blew past them, her long hair would quietly drift upwards to reveal her fine waist, as well as the round and firm arcs which jutted out below her waist.\u003c/p\u003e\n\u003cp\u003eFirm and perky!\u0026nbsp;He hadn’t noticed before, but her backside was quite intoxicating as well.\u0026nbsp;Zhou Weiqing unconsciously swallowed a mouthful of saliva.\u003c/p\u003e\n\u003cp\u003eRight at this moment, Dreamwake’s icy voice rang into his mind: “If you keep staring at me with those filthy eyes of yours, I’ll tear them out.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing lowered his head in resignation. \u003cem\u003eFine, fine.\u0026nbsp;I won’t stare.\u003c/em\u003e Every so often though, he did sneak a peek. Thankfully, Dreamwake didn’t actually attack him.\u003c/p\u003e\n\u003cp\u003eThe Tenebrous Demon Dragon flew with astonishing speed.\u0026nbsp;Even though they were high in the air, none of them were able to make out the scenery below with clarity.\u003c/p\u003e\n\u003cp\u003eThe dense tenebrous demon clouds around them blocked out the warmth of the sunlight.\u0026nbsp;From afar, the Tenebrous Demon Dragon looked like a black arrow that was shooting through the skies.\u003c/p\u003e\n\u003cp\u003eLess than two hours later, they were able to see the vast and boundless ocean appear on the horizons.\u0026nbsp;The light of the sun shone down upon the surface of the sea, causing it to sparkle.\u003c/p\u003e\n\u003cp\u003eThe weather was particularly fine today.\u0026nbsp;There weren’t too many waves, and they were able to see from up high how the light blue of the water at the seashore gradually grew darker as they went deeper into the ocean.\u003c/p\u003e\n\u003cp\u003eThe atmospheric water energies around them clearly grew denser.\u0026nbsp;Even the naturally-forming tenebrous demon clouds around the Tenebrous Demon Dragon were affected considerably, as they grew noticeably sparser.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis was the power of nature\u003c/em\u003e!\u0026nbsp;Zhou Weiqing couldn’t help but exclaim to himself.\u0026nbsp;No wonder even the Tenebrous Demon Dragon was afraid of fighting the Terror Sea Dragon in the depths of the seas.\u0026nbsp;The seas was the Terror Sea Dragon’s domain.\u003c/p\u003e\n\u003cp\u003eRight at this moment, Dreamwake’s mental voice reached out to him once more.\u0026nbsp;“Use your Demonic Change State to stay far away from the battle.\u0026nbsp;No one will have the time or energy to take care of you.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chortled and sent back, “You care about me that much, eh?”\u003c/p\u003e\n\u003cp\u003eDreamwake didn’t respond.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing continued, “Honestly, it was all a big misunderstanding.\u0026nbsp;I just didn’t want to die, right?\u0026nbsp;I did what I did to stay alive.\u0026nbsp;That’s why I saved that trump card for the very end.”\u003c/p\u003e\n\u003cp\u003eDreamwake could no longer stay silent.\u0026nbsp;“Misunderstanding?\u0026nbsp;Was what happened when we jumped down the cliff also a misunderstanding?\u0026nbsp;Your Demonic Change State is able to produce wings that allow you to fly.\u0026nbsp;How could you possibly be so terrified when falling down a cliff?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing was a grandmaster at finding excuses.\u0026nbsp;He said reasonably, “That was a different situation.\u0026nbsp;It all happened to suddenly.\u0026nbsp;Besides, everyone has a fondness for beautiful things.\u0026nbsp;You were right next to me, so I unconsciously clung to you in my fear.\u0026nbsp;By the time I recovered my senses, I was already holding onto you.\u0026nbsp;If I released you then, it would look like I was just pretending to be honorable, right?\u0026nbsp;That’s why I just kept on hugging you.\u0026nbsp;You can’t blame me!\u0026nbsp;It’s your own fault for being so comfortable to hug.”\u003c/p\u003e\n\u003cp\u003eDreamwake was nearly enraged to the point of laughter.\u0026nbsp;This scoundrel was clearly in the wrong, but insisted on trying to argue his way out of it.\u0026nbsp;He had clearly taken advantage of her, but now he was making it sound as though he had suffered a grave injustice.\u0026nbsp;She had been feeling a bit nervous at the prospect of facing the Terror Sea Dragon, but Zhou Weiqing’s nonsense actually resulted in her relaxing slightly.\u003c/p\u003e\n\u003cp\u003e“I can’t be bothered with you.\u0026nbsp;Just know that you’ll have to watch out for yourself later, because no one else will,” Dreamwake said irritably.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chortled.\u0026nbsp;“Does that mean you aren’t mad anymore?\u0026nbsp;Y’know, you’ve been avoiding me for so many days that I really was heartbroken.\u0026nbsp;I missed you so much I could hardly sleep.”\u003c/p\u003e\n\u003cp\u003eDreamwake said angrily, “Shut your mouth. Every day and every night, you ‘busy’ yourself with your wife. Miss me so much that you can’t sleep? \u0026nbsp;Do you take me for a fool?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing stuttered, “Uh, well… I can miss you while being frisky with my wife, right?”\u003c/p\u003e\n\u003cp\u003eHis voice was quite small when he said this, and Dreamwake was already in a fine rage.\u0026nbsp;As a result, she somewhat misheard his words.\u0026nbsp;She angrily turned to glare at him and said viciously, “You bastard!\u0026nbsp;You actually dare to think about me when you are being frisky with your wife?!”\u003c/p\u003e\n\u003cp\u003e“Uh, t-that’s not what I mean,” Zhou Weiqing hastily replied.\u003c/p\u003e\n\u003cp\u003eNone of the rest could hear what they were saying, but as absolute powerhouses everyone who was seated on the Tenebrous Demon Dragon’s back was able to tell that the two were engaging in a mental conversation.\u0026nbsp;When they saw Dreamwake turn her head to glare at him with an embarrassed look on her face, the various elders couldn’t help but reveal rather odd looks.\u003c/p\u003e\n\u003cp\u003eEveryone was able to tell that something ha been going on between the two of them ever since Zhou Weiqing arrived.\u0026nbsp;It was especially obvious when the two of them were together.\u0026nbsp;The supreme powerhouses of Xuantian Palace were all wily old foxes.\u0026nbsp;Although their faces remained impassive, it was hard to judge what they thought of all this.\u003c/p\u003e\n\u003cp\u003eGiven how Zhou Weiqing was a handsome and talented youth, as they saw it he would be a good match for Dreamwake in a few years once he grew stronger.\u0026nbsp;The problem was, he had come with a wife in tow!\u003c/p\u003e\n\u003cp\u003eZhou Weiqing immediately lowered his head after Dreamwake glared at him, putting on show of being honest and aggrieved.\u003c/p\u003e\n\u003cp\u003eThis was the first time Dreamwake had seen such a look on this fellow’s face.\u0026nbsp;She couldn’t help but stare in shock.\u0026nbsp;In her mind, this bad man was always proud, arrogant, and self-confident!\u0026nbsp;She couldn’t help but soften when she saw him look like this, and so she let out a snort and then turned back, no longer paying him any attention.\u003c/p\u003e\n\u003cp\u003eBy now, the Tenebrous Demon Dragon was flying over the deep ocean.\u0026nbsp;The surface of the sea beneath its feet had transformed into a deep blue color, while the tenebrous demon clouds around it had suddenly vanished.\u0026nbsp;It wasn’t because of how dense the atmospheric water energies were; rather, it was because the Tenebrous Demon Dragon had voluntarily dispelled it.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat is it up to?\u003c/em\u003e Zhou Weiqing was intrigued.\u003c/p\u003e\n\u003cp\u003eThey continued to fly for an hour, venturing even deeper into the ocean before the Tenebrous Demon Dragon slowly began to come to a halt.\u0026nbsp;All of the Xuantian Palace experts on the Tenebrous Demon Dragon suddenly retracted their auras as well, as though by unspoken accord.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing hadn’t taken part in the discussions over how to handle the Terror Sea Dragon, and so he didn’t know what they were going to do.\u0026nbsp;All he could do was watch.\u003c/p\u003e\n\u003cp\u003eThe Tenebrous Demon Dragon said in a rumbling voice, “Let’s begin.\u0026nbsp;I can vaguely sense its aura.\u0026nbsp;I will mask your energy ripples as best as I can, but you need to move quickly.”\u003c/p\u003e\n\u003cp\u003eXuantian Palace Lord Dong Fang nodded, then led the others in rising to their feet atop the Tenebrous Demon Dragon’s back.\u0026nbsp;Zhou Weiqing rose to his feet as well.\u0026nbsp;He asked the Palace Leader, “Palace Leader, what do you need me to do?”\u003c/p\u003e\n\u003cp\u003eDong Fang replied, “Just wait for us here.\u0026nbsp;Once the battle erupts shortly, retreat and just watch from afar.\u0026nbsp;We don’t need you to get involved.”\u003c/p\u003e\n\u003cp\u003e“Alright.”\u0026nbsp;Zhou Weiqing immediately agreed.\u0026nbsp;Watching as dragons fought from afar was quite a pleasing experience.\u003c/p\u003e\n\u003cp\u003eThe many Xuantian Palace experts began to move in unison.\u0026nbsp;The weakest was at least a Heavenly King, and the thirteen of them flew separately towards different directions.\u0026nbsp;They each flew nearly a thousand meters before slowly landing on the surface of the sea.\u0026nbsp;From Zhou Weiqing’s perspective, they had all transformed into tiny black dots.\u003c/p\u003e\n\u003cp\u003eThe Tenebrous Demon Dragon hovered motionless at its original location, a strange spiritual ripple spreading out from its body.\u0026nbsp;Heavenly Gods truly were impressive.\u0026nbsp;Almost instantly, its powerful spiritual ripple completely covered all of the powerhouses of Xuantian Palace.\u003c/p\u003e\n\u003cp\u003eStreaks of black light simultaneously rose up off in the distance.\u0026nbsp;Although Zhou Weiqing’s visual acuity was incredible, they were still too far away for him to tell what the Xuantian Palace powerhouses inside those beams of light were doing.\u0026nbsp;All he could sense was that they were emanating ripples of incredible power.\u003c/p\u003e\n\u003cp\u003e“Senior, what are they doing?” Zhou Weiqing asked curiously.\u003c/p\u003e\n\u003cp\u003eThe Tenebrous Demon Dragon clearly had a favorable impression of him.\u0026nbsp;“Preparing to deal with that Terror Sea Dragon, of course.\u0026nbsp;Terror Sea Dragons are incredibly powerful, and we’re fighting it in the ocean.\u0026nbsp;If we simply try to clash against it head-on, even if we win we will suffer enormous losses in the process… and we can’t avoid the possibility that it might end up escaping.\u0026nbsp;What they are doing right now is setting up a Tenebrous Demon Sealing Formation.\u0026nbsp;It is an ancient formation which requires twelve powerhouses who are at or above the Heavenly King level and who have the Tenebrous Attribute to establish.\u0026nbsp;Once this formation is established, not even a Heavenly God who enters it will be able to escape.\u0026nbsp;All of the people who created the formation will have to be slain in order for the trapped person to break free.\u0026nbsp;Within the Tenebrous Demon Sealing Formation, all types of Attributes aside from the Tenebrous Attribute will be forcibly kept at bay.\u0026nbsp;We’ll do our best to lessen the amount of energy Terror Sea Dragon can borrow from the sea.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing finally understood.\u0026nbsp;“So they spent all this time preparing for this formation!\u0026nbsp;It seems this grand formation requires an enormous amount of materials to establish.”\u003c/p\u003e\n\u003cp\u003eThe Tenebrous Demon Dragon nodded. “This formation can also increase my power. \u0026nbsp;For the sake of dealing with the Terror Sea Dragon, Xuantian Palace has brought out over half of their complete stockpile of Tenebrous Crystals. During the past month, they’ve been carving the formation onto the Tenebrous Crystals and linking them to their own bloodlines. Only by doing this can they cause the power of the Tenebrous Demon Sealing Formation to rise to its maximum power. Later, you should fly away and stay out of the range of the Tenebrous Demon Sealing Formation. So long as you remain outside, you shouldn’t be hit by the shockwaves.”\u003c/p\u003e\n\u003cp\u003e“Thank you for the guidance, Senior,” Zhou Weiqing said respectfully.\u003c/p\u003e\n\u003cp\u003eThe Tenerous Demon Dragon suddenly let out a low chortle and then whispered to Zhou Weiqing, “Hey kid. Have you fallen for that lass, Dreamwake?”\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-248-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-249-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-248-03","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
