{"id":51917,"no":743,"title":"Chapter 252: No Regrets (1)","content":"\u003cp\u003e“If this isn’t enough to be considered evidence… then I point to how, when we were preparing to battle the Terror Sea Dragon, even ‘Palace Lord Dong Fang’ was assigned to assemble the formation, while you were the one responsible for joining together with the Tenebrous Demon Dragon.\u0026nbsp;You became the most important combat force on our side.\u003c/p\u003e\n\u003cp\u003e“Also.\u0026nbsp;Other things can be faked, but there’s no way the Tenebrous Demon Dragon Set could be faked.\u0026nbsp;An eleven-piece Legendary Set!\u0026nbsp;In our Boundless Mainland, the only set which matches it is the Boundless Infinitum Set.\u0026nbsp;Not even Palace Lord Dong Fang had such a set, but you did.\u0026nbsp;Isn’t that proof enough?\u003c/p\u003e\n\u003cp\u003e“I don’t think Dreamwake is even your real name.\u0026nbsp;Although I lied to you, my name really is Zhou Weiqing.\u0026nbsp;It’s clear that both of us are liars, so I think we’re even.\u0026nbsp;Fair enough?”\u003c/p\u003e\n\u003cp\u003eAs Dreamwake listened to his analysis, she once more turned to look at him.\u0026nbsp;She didn’t rebut Zhou Weiqing’s words, just looked at him earnestly.\u003c/p\u003e\n\u003cp\u003e“Can you tell me why you chose to save us at that critical moment?\u0026nbsp;Were you just bluffing or were you really capable of blocking the Terror Sea Dragon?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing looked into her rather determined eyes, then let out an awkward smile.\u0026nbsp;“Do you want to hear the truth or a lie?”\u003c/p\u003e\n\u003cp\u003e“The truth of course,” Dreamwake said irritably.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chuckled.\u0026nbsp;“Tell me your real name and I will tell you.”\u003c/p\u003e\n\u003cp\u003eDreamwake blinked.\u0026nbsp;She nibbled on her lips, then whispered, “My name is Dongfang Hanyue.”\u003c/p\u003e\n\u003cp\u003e“Dongfang Hanyue?\u0026nbsp;A good name. It suits you,” Zhou Weiqing praised.\u0026nbsp;[1. Hanyue means cold moon.]\u003c/p\u003e\n\u003cp\u003eDongfang Hanyue said, “Time for you to tell me the truth.”\u003c/p\u003e\n\u003cp\u003e“The truth is, I don’t know,” Zhou Weiqing said honestly.\u003c/p\u003e\n\u003cp\u003eDongfang Hanyue stared at him in astonishment.\u0026nbsp;“That’s your answer?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said, “It is the most honest answer I can give.\u0026nbsp;I don’t know why I chose to save you guys either.\u0026nbsp;To me, the best course of action would’ve been to wait until both you and the Terror Sea Dragons were badly injured.\u0026nbsp;Faced with great danger, you would’ve used the Spatial Teleportation Gem.\u0026nbsp;That would be my best opportunity.\u0026nbsp;I had a 70% confidence level that I would be able to escape after seizing the gem.\u0026nbsp;I guess you can just say that I went momentarily stupid… but I don’t regret it.”\u003c/p\u003e\n\u003cp\u003eWhen she heard Zhou Weiqing say the words ‘I don’t regret it’, the rage and fierceness in Dongfang Hanyue’s eyes vanished.\u0026nbsp;She stared intently at him, seemingly in a daze.\u003c/p\u003e\n\u003cp\u003e“I’m going to find some food.”\u0026nbsp;Zhou Weiqing rose to his feet, walking towards the seashore.\u0026nbsp;He needed to calm down.\u0026nbsp;Right now, he essentially was facing a second chance at the choice he had made.\u0026nbsp;And… this would probably be the last chance.”\u003c/p\u003e\n\u003cp\u003eHe felt 80% certain that the gem was on ‘Dreamwake’, whose real name was Dongfang Hanyue.\u0026nbsp;She was the true controller of Xuantian Palace!\u0026nbsp;They were on a deserted island, and she was so weak that he could take the gem from her without needing to injure her.\u0026nbsp;He could then leave with Bing’er, this mission complete.\u003c/p\u003e\n\u003cp\u003eBut… could he really be so determined as to do something like this?\u0026nbsp;If he could, he wouldn’t have told Dreamwake so many things.\u003c/p\u003e\n\u003cp\u003eHe walked over to the side of the sea, allowing it to go past his feet.\u0026nbsp;Zhou Weiqing spread out his senses, but he wasn’t able to discover any other living creatures within the vast sea.\u003c/p\u003e\n\u003cp\u003e“Goddamnit! I want to eat some seafood to make myself feel better, but there’s none here. This is inhumane!” Zhou Weiqing roared angrily towards the sea.\u003c/p\u003e\n\u003cp\u003eHe took a few steps back, then helplessly squatted down on the beach. He used his hand to draw a few circles in the sand. “Zhou Little Fatty, you old softy. It’s all because you are emotionally weak! \u0026nbsp;Weak!”\u003c/p\u003e\n\u003cp\u003eHe drew one circle after another, but the resigned look on his face didn’t abate at all.\u0026nbsp;For him to bully a heavily wounded woman, one who had treated him extremely well… he couldn’t do it.\u0026nbsp;He really couldn’t!\u0026nbsp;If Xuantian Palace and Dongfang Hanyue had treated him poorly, he probably would’ve acted long ago.\u0026nbsp;But, he could still clearly remember how, when danger descended, she didn’t forget to protect him even though she was still angry with him.\u0026nbsp;She had even risked suffering injuries to herself to do this.\u003c/p\u003e\n\u003cp\u003eHe suddenly rose to his feet and strode straight towards Dongfang Hanyue.\u003c/p\u003e\n\u003cp\u003eWhen she saw the truculent look on his face, Dongfang Hanyue’s own face turned even paler than before.\u0026nbsp;She unconsciously covered her chest with hands while inching backwards in the sand.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing only halted when he came to stand before her.\u003c/p\u003e\n\u003cp\u003eDongfang Hanyue was like a frightened little kitten.\u0026nbsp;“W-what are you doing.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing lowered his head angrily.\u0026nbsp;“Gimme the Spatial Teleportation Gem.”\u003c/p\u003e\n\u003cp\u003eA stubborn look appeared in Dongfang Hanyue’s eyes.\u0026nbsp;“I won’t.\u0026nbsp;Kill me if you want.”\u003c/p\u003e\n\u003cp\u003e“Fine then.\u0026nbsp;Forget it.”\u0026nbsp;Zhou Weiqing let out a long sigh, a helpless smile appearing on his face.\u0026nbsp;He then flipped over and lay down next to Dongfang Hanyue.\u003c/p\u003e\n\u003cp\u003eDongfang Hanyue once more turned stiff.\u0026nbsp;Just now, when Zhou Weiqing had demanded the Spatial Teleportation gem, she had been so petrified that her heart had nearly leapt out of her throat.\u0026nbsp;But in the end, this guy had done nothing besides say that simple sentence.\u003c/p\u003e\n\u003cp\u003e“So what do you want?”\u0026nbsp;Dongfang Hanyue couldn’t help but ask.\u0026nbsp;She had no idea what this bad man was thinking.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing lay there, head leaning against his hands. “This was a perfect opportunity. I had to at least make an attempt, otherwise it would have all gone to waste. By asking, I can say that I made the attempt. You weren’t willing to give it to me, so I had no choice but to just give up. \u0026nbsp;This bro is a real man. I can’t bully a weak little girl like you on this desolate island. Hurry up and recover. After you recover, I’m going to leave.”\u003c/p\u003e\n\u003cp\u003e“You don’t want the Spatial Teleportation Gem any longer?” Dongfang Hanyue asked, puzzled.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed bitterly.\u0026nbsp;“Of course I want it.\u0026nbsp;That’s my mission.\u0026nbsp;But, I’ll figure out another way to get it.\u0026nbsp;Keep a close watch over your treasures.\u0026nbsp;Don’t let me take it too easily.”\u003c/p\u003e\n\u003cp\u003e“Hmph.”\u0026nbsp;Dongfang Hanyue let out a snort, struggling to sit up.\u0026nbsp;She then closed her eyes and quietly began to train.\u0026nbsp;As she sat up, her lips curved upwards into a faint smile… but Zhou Weiqing, who was lying down, wouldn’t be able to see it.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing could sense that Dongfang Hanyue had entered a cultivation state. Utterly bored, he stared into the skies and cursed himself mentally. \u003cem\u003eZhou Little Fatty, you really are a stupid-nice person.\u0026nbsp;Would you act like this if she wasn’t a beauty?\u0026nbsp;Absolutely not.\u0026nbsp;Like hell you would!\u0026nbsp;You perverted lecher!\u0026nbsp;Still… no matter what, I’m a genuine scoundrel.\u0026nbsp;That’s better than being a false gentleman, right?\u0026nbsp;Ugh.\u0026nbsp;My beautiful Hanyue, you really disappoint me.\u0026nbsp;Even if you don’t repay me by offering me your body, you should at least give me a kiss or something.\u0026nbsp;I treated you so well.\u0026nbsp;Can’t you be the slightest bit moved by it?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAlthough his heart was filled with perverted musings, he rose to sit up behind Dongfang Hanyue, pressing his hands against her back. \u003cem\u003eI’m not doing this to help her recover, I’m doing this to feel her wonderful figure for myself.\u003c/em\u003e This was what Little Fatty told himself as he sent his silvery-white light into their bodies.\u003cem\u003e\u0026nbsp;Well, if you are going to be a good guy, be a good guy all the way.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eDongfang Hanyue hadn’t exaggerated her injuries at all.\u0026nbsp;Not only were her meridians all badly damaged, some had been disordered.\u0026nbsp;Any ordinary person with these injuries would’ve died long ago, but she was a Heavenly Emperor powerhouse and thus was still barely managing to hang on.\u003c/p\u003e\n\u003cp\u003eClearly, she wouldn’t be able to recover from her injuries quickly.\u0026nbsp;But, Zhou Weiqing helping out changed everything.\u003c/p\u003e\n\u003cp\u003eThe gentle Saint Energy slowly poured into her delicate body, which shuddered.\u0026nbsp;That warm energy passed through his two hot hands into her back and then spread out through the rest of her body.\u0026nbsp;This was an extremely strange feeling.\u0026nbsp;Dongfang Hanyue felt her entire body turn a bit soft, but as that gentle energy entered her body the energies in her chaotic meridians were actually all assimilated by it.\u003c/p\u003e\n\u003cp\u003eAs the gentle energy advanced, her damaged meridians were gradually covered by the silvery-white light.\u0026nbsp;There was no feeling of pain at all.\u0026nbsp;She only felt as though her body was submerged in warm water.\u0026nbsp;It was indescribably comfortable.\u003c/p\u003e\n\u003cp\u003eShe gave up on her self-healing efforts and discarded any wariness, giving completely control over her body to Zhou Weiqing and allowing his Saint Energy to roam freely.\u003c/p\u003e\n\u003cp\u003eGradually, Dongfang Hanyue was actually lulled to sleep by that comfortable feeling.\u0026nbsp;Her sleep was incredibly peaceful.\u0026nbsp;Ever since she had taken on the crushing pressure of being responsible for Xuantian Palace, she had never again slept so soundly.\u003c/p\u003e\n\u003cp\u003e“What the hell? You can’t do this. I’m not a ‘good guy’, you know.” Zhou Weiqing, still seated behind Dongfang Hanyue, was instantly depressed. \u003cem\u003eIsn’t this girl afraid that I’m going to seize this opportunity to do something to her?\u0026nbsp;\u003c/em\u003e\u003cem\u003eEven if she hid the Spatial Teleportation Gem somewhere else, she can’t act like this.\u0026nbsp;Doesn’t she know just how lethal a weak, helpless little girl is to any man’s self-control?\u0026nbsp;I can’t take this!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eNight gradually enveloped the island, bringing silence with it.\u0026nbsp;A campfire was the only source of light within the island.\u0026nbsp;Zhou Weiqing was seated before the campfire, cooking some grains.\u003c/p\u003e\n\u003cp\u003eThe Sumeru Ring was on his finger once more.\u0026nbsp;This ring contained a prodigious amount of food and water.\u0026nbsp;Even though there was no seafood to eat, they wouldn’t go hungry.\u003c/p\u003e\n\u003cp\u003eEvery so often, the campfire would crackle.\u0026nbsp;Although grains made for a simple meal, cooking them made them quite tasty.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing did his best to prevent his gaze from turning towards the other end of the campfire.\u0026nbsp;Under the light of the campfire, Dongfang Hanyue’s ruddy, fragrant face was simply far too enticing.\u0026nbsp;Although Zhou Weiqing was by nature an extremely lascivious man filled with dirty thoughts, no matter what he wouldn’t allow them to overcome his morality and his conscience.\u0026nbsp;However, that didn’t mean he liked it.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing wanted to leave as soon as Dongfang Hanyue’s meridians had been healed, but when he realized that he didn’t know where the second Terror Sea Dragon was located, he simply couldn’t bring himself to abandon her and leave on his own.\u003c/p\u003e\n\u003cp\u003eHe’d wait until she woke up. It had been a long time since he had felt himself at the verge of losing control… but he had to admit, this mission had spun completely out of his control.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-251-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-252-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-252-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
