{"id":51921,"no":747,"title":"Chapter 253: Let The Storm Rage Harder (3)","content":"\u003cp\u003eWas he actually a good person or a bad person?\u0026nbsp;To Dongfang Hanyue, this no longer mattered.\u0026nbsp;Even if she knew that there was no future for them, she didn’t hesitate to give herself to him.\u0026nbsp;She had even purposefully put on that necklace.\u003c/p\u003e\n\u003cp\u003eWhen she thought back to the time they had spent together in recent months, crystalline tears began to slide down her fragrant, tender cheeks.\u003c/p\u003e\n\u003cp\u003e“You jerk.\u0026nbsp;Will you even remember me after you go back?\u0026nbsp;Why are things always so unfair.\u0026nbsp;The most precious gift you gave me wasn’t this ‘Saint Energy’, it was the memories!”\u003c/p\u003e\n\u003cp\u003eJust as Dongfang Hanyue was murmuring to herself, her slender form suddenly shuddered.\u0026nbsp;The grief in her eyes was instantly replaced with a sharp, murderous look.\u003c/p\u003e\n\u003cp\u003e“Not good!”\u0026nbsp;She didn’t hesitate at all, instantly rising into the skies and unleashing the Tenebrous Demon Dragon Transformation.\u0026nbsp;The vast dragon wings propelled her towards the direction Zhou Weiqing had taken at maximum speed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter leaving the island, Zhou Weiqing had felt rather lost.\u0026nbsp;To be honest, he really couldn’t bear to leave this place.\u0026nbsp;Not only was he already missing Dongfang Hanyue’s body, he felt a heavy feeling in his heart that he couldn’t quite explain.\u003c/p\u003e\n\u003cp\u003ePossibly because he was feeling guilty, he didn’t immediately reach out to contact Shangguan Bing’er.\u0026nbsp;He didn’t even pay attention to where he was headed.\u0026nbsp;He simply flew dazedly through the skies.\u003c/p\u003e\n\u003cp\u003eAfter flying for a while, he suddenly sensed an utterly terrifying aura of power burst forth from the sea below him.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s reaction speed was quite fast, but this creature had clearly been building up power for quite some time.\u0026nbsp;An enormous waterspout slammed straight into him, smashing him skyward.\u003c/p\u003e\n\u003cp\u003eAt this moment, Zhou Weiqing’s tough natural defenses played a critical role once more in keeping him alive.\u0026nbsp;He didn’t need to activate the Immortal Deity Shield, as it automatically sprang up to cover his body in a blurry field of golden light.\u0026nbsp;At the same time, his silvery-white Saint Energy exploded out from his body.\u003c/p\u003e\n\u003cp\u003eThis waterspout was created by Water Attribute energies.\u0026nbsp;Even though the collision contained tremendous power and was formed by incredibly dense Water Attribute energies, as soon as it touched the Saint Energy it was partially dispelled.\u0026nbsp;Only a remainder ended up slamming into Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eIn the end, this waterspout simply contained too much energy.\u0026nbsp;The collision actually blasted Zhou Weiqing over three thousand meters into the air, and he immediately vomited blood while flying upwards.\u003c/p\u003e\n\u003cp\u003eIt didn’t seem as though the giant waterspout was going to let him off easily. It actually transformed midair to become a giant claw which latched onto him and began to viciously drag him down into the sea.\u003c/p\u003e\n\u003cp\u003eThe waters below him had actually separated as the vast, 800-meter body of the second Terror Sea Dragon began to slowly rise upwards.\u0026nbsp;Its savage spikes flickered with dark blue light, while its enormous eyes were filled with hatred.\u003c/p\u003e\n\u003cp\u003eIts elder brother had died.\u0026nbsp;This had been a tremendous provocation for the Terror Sea Dragon.\u0026nbsp;It had been blasted away by that terrifying explosion as well, and when it woke up it knew that it had been deceived by Zhou Weiqing.\u0026nbsp;It had furiously swam back, but alas it found nothing save for the carcass of the self-detonated Terror Sea Dragon.\u003c/p\u003e\n\u003cp\u003eThe Grand Elders of Xuantian Palace, including Dongfang Hanyue’s mother, had immediately fled after recovering from being blasted away.\u0026nbsp;They had returned to the Xuantian Continent, precisely because they feared running into the other Terror Sea Dragon.\u003c/p\u003e\n\u003cp\u003eThe Terror Sea Dragon had been swimming around for quite some time now, but it still didn’t dare to actually chase towards the continent itself.\u003c/p\u003e\n\u003cp\u003eIn the end, the person it hated the most was probably Zhou Weiqing.\u0026nbsp;If Zhou Weiqing hadn’t summoned that image of the Demon God to frighten it, it would’ve been able to reach the Tenebrous Sealing Formation and prevent its elder brother from dying.\u003c/p\u003e\n\u003cp\u003eJust as the Terror Sea Dragon had began to leave, filled with frustration and bile, it caught a glimpse of Zhou Weiqing flying through the air.\u003c/p\u003e\n\u003cp\u003eAs a Heavenly God, its spiritual senses were incredibly acute.\u0026nbsp;It could sense everything within hundreds of kilometers, and so as soon as it discovered Zhou Weiqing it immediately went into hiding and began to prepare to unleash that sneak attack.\u003c/p\u003e\n\u003cp\u003eA sneak attack from a Heavenly God-level Heavenly Beast… even if Zhou Weiqing’s Saint Energy was much stronger than it was currently, there was no way he would be able to detect it in advance.\u0026nbsp;Indeed, he was at an immediate disadvantage from the start.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing knew right away what he had encountered when that waterspout had arisen.\u0026nbsp;All his hair stood up on end as he felt a sense of absolutely lethal danger!\u0026nbsp;If he wasn’t careful, he’d probably be forever trapped within these seas.\u003c/p\u003e\n\u003cp\u003eBut the more dangerous the situation was, the more level-headed Zhou Weiqing would be.\u0026nbsp;Although he had been injured by that great collision, his injuries weren’t all that serious.\u003c/p\u003e\n\u003cp\u003eThis was the first time he had unleashed the full defensive prowess of the Immortal Deity Shield after mastering it.\u0026nbsp;Although this Heavenly God powerhouse hadn’t been able to use its full power as it had wished to remain hidden, the Immortal Deity Shield had still been able to block the attack.\u0026nbsp;This was a testament as to just how defensively tough it was.\u003c/p\u003e\n\u003cp\u003eThe Immortal Deity Shield had instantly weakened the power of that terrifying strike, while the Saint Energy in Zhou Weiqing’s body had weakened the remainder.\u0026nbsp;The combined effect was that although Zhou Weiqing’s injuries weren’t light, he was far from being too injured to fight back.\u003c/p\u003e\n\u003cp\u003eFaced with the pressure from that terrifying claw of sea water, Zhou Weiqing unleashed a halo of faint silvery-white light from his body.\u0026nbsp;Something odd happened.\u0026nbsp;The terrifying Water Attribute energies, which had been suppressing his soul and pressuring him to the point of preventing him from moving at all, was suddenly melted away by the silvery-white light.\u003c/p\u003e\n\u003cp\u003eAlthough only part of it was melted away, to Zhou Weiqing it was essentially a life-saving effect.\u0026nbsp;Silver light flickered, and in the next instant he reappeared over a hundred meters away.\u003c/p\u003e\n\u003cp\u003eUsing Saint Energy to cast the Spatial Shuttle increased its powers dramatically.\u0026nbsp;This was the main reason why Zhou Weiqing was never worried about anything he might encounter after coming to the Xuantian Continent.\u003c/p\u003e\n\u003cp\u003eThanks to his Saint Energy, he was able to consecutively cast Spatial Shuttle within a certain period of time to flee a tremendous distance.\u0026nbsp;Although this was extremely taxing to his Saint Energy, at critical moments like this it was without a doubt a peerless life-saving measure.\u003c/p\u003e\n\u003cp\u003eThe first usage took him outside the enormous well spout.\u0026nbsp;Zhou Weiqing didn’t dare to tarry at all, immediately using Spatial Shuttle eight more times in a row to move over a thousand meters away.\u003c/p\u003e\n\u003cp\u003eHowever, this wasn’t enough against a Heavenly God.\u0026nbsp;As Zhou Weiqing teleported a thousand meters away, which he had thought to be a safe distance, an incomparably awesome pressure suddenly came crashing down upon him from the skies.\u0026nbsp;It was as though the heavens were collapsing!\u0026nbsp;This terrifying pressure shoved Zhou Weiqing into the sea, and it disrupted his ninth Spatial Shuttle.\u003c/p\u003e\n\u003cp\u003eSaint Energy could ignore any influences from Heavenly God-class Water Attribute energies, but if Zhou Weiqing wished to use a technique he would have to convert it into another Attribute.\u0026nbsp;Just now, all other types of Attributes save for the Water Attribute had been severed away within a very wide region.\u003c/p\u003e\n\u003cp\u003eFacing off against this Heavenly God by himself, for the first time Zhou Weiqing truly understood how terrifying his foe was. It was like he was the one now trapped within the Tenebrous Sealing Formation. All of his power and abilities were suppressed and unable to leave his body. Even his Saint Energy flowed much slower than before.\u003c/p\u003e\n\u003cp\u003eYes.\u0026nbsp;He relied on converting Saint Energy into other types of energy in using techniques, but these techniques were limited in that they couldn’t go without the Saint Energy.\u003c/p\u003e\n\u003cp\u003eThe local atmospheric energies were now completely unusable. Before a Heavenly God like this Terror Sea Dragon, his own level of Heavenly Dao Energy was nothing more than a joke. He could no longer use techniques like the Spatial Shuttle.\u003c/p\u003e\n\u003cp\u003eOne dark-gold beam of light after another appeared on his body.\u0026nbsp;This was his Hate Ground No Handle set.\u0026nbsp;He actually grew calmer and more focused, as he knew that there was no way to escape.\u0026nbsp;Only by fighting to the bitter end would he have a chance at surviving.\u003c/p\u003e\n\u003cp\u003e“Human, you caused my brother to die.\u0026nbsp;I won’t let you die an easy death.\u0026nbsp;I’ll let you taste the torments of a thousand tortures as I slowly kill you.”\u0026nbsp;The Terror Sea Dragon’s enormous head rose out of the sea, staring with viperous hatred at Zhou Weiqing.\u0026nbsp;It wouldn’t be tricked again.\u0026nbsp;Zhou Weiqing was like meat on the chopping board just waiting to be devoured.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing laughed coldly.\u0026nbsp;“Who knows which one of us will actually be the one to die, you stupid sea slug.\u0026nbsp;Killing me isn’t going to be easy.”\u0026nbsp;He took a deep breath, his eyes suddenly transforming to become an incandescent silver color.\u0026nbsp;Moments later, a strange aura instantly shot out of his body.\u003c/p\u003e\n\u003cp\u003eThis was an aura which came from his Bloodline, and he was releasing it to the maximum with his Saint Energy.\u003c/p\u003e\n\u003cp\u003eIt was quite odd.\u0026nbsp;When he released this aura, the enormous amount of Water Attribute energies which had sealed off this region actually shuddered repeatedly.\u0026nbsp;As for the Terror Sea Dragon, its eyes widened as the savage spikes across its body instantly transformed into a crystal blue color.\u003c/p\u003e\n\u003cp\u003e“The Dragon Emperor Bloodline?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said arrogantly, “So you know of the Dragon Emperor Bloodline, eh?\u0026nbsp;I am the heir of the Dragon Emperor.\u0026nbsp;If you dare to act against me, I’ll summon my comrades and they’ll instantly crush you into pieces.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s body did in fact contain the pure Dragon Emperor Bloodline within it.\u0026nbsp;It also contained the Dark Demon God Tiger Bloodline.\u0026nbsp;With the support of his Saint Energy, he fully unleashed the aura of his Dragon Emperor Bloodline.\u0026nbsp;Although it wouldn’t directly enhance his combat abilities, it was still the most exalted Bloodline amongst the dragons that surpassed even the Terror Sea Dragon Bloodline in status.\u0026nbsp;As a result, even the Terror Sea Dragon’s power would be slightly affected once this Bloodline’s aura was unleashed.\u003c/p\u003e\n\u003cp\u003e“Bullshit. Despicable human, don’t think you can fool me a second time. A noble dragon like myself will never fall for the same trick twice. This is the ocean! Even if other descendants of the Dragon Emperor were to truly arrive, what could they do to me? Die!”\u003c/p\u003e\n\u003cp\u003eAs it spoke, its body flashed with blue light as the Water Attribute atmospheric energies grew even denser, squeezing hard around Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003e“Screw you, do you really think I’m scared of you?”\u0026nbsp;Zhou Weiqing could tell that escape was virtually impossible, but this just stirred up his innate stubbornness.\u003c/p\u003e\n\u003cp\u003eThe Saint Energy in his body was fully unleashed, causing even his Hate Ground No Handle set to temporarily turn silver. However, the surrounding Water Attribute energies were simply too dense. Zhou Weiqing simply wasn’t able to form the technique he wished to unleash.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-253-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-254-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-253-03","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
