{"id":51935,"no":761,"title":"Chapter 258: Saint Core? Astral Core? (2)","content":"\u003cp\u003eHui Yao looked at her.\u0026nbsp;“Go ahead and sense the changes in our bodies.\u0026nbsp;After being bathed by that astral light, our bodies seemed to have benefited from it.\u0026nbsp;Not just that.\u0026nbsp;Although that night sky only appeared for a brief period, I can sense that in reality a total of forty-nine days have gone past.”\u003c/p\u003e\n\u003cp\u003eThey were Heavenly Gods whose senses regarding the natural world were far more acute than the senses of ordinary humans, especially with regards to time.\u0026nbsp;They often went into long periods of slumber, after all.\u0026nbsp;If they couldn’t sense the passing of time, they wouldn’t even know how old they were!\u003c/p\u003e\n\u003cp\u003eWhen Duo Si heard Hui Yao say this, Duo Si immediately unleashed its own senses.\u0026nbsp;A moment later, Duo Si’s jaw dropped own in surprise.\u0026nbsp;Hui Yao was right.\u0026nbsp;Forty-nine days had gone past during that brief moment of astral light accelerating and disappearing.\u003c/p\u003e\n\u003cp\u003eWhat was going on?\u0026nbsp;They had no idea, but when they looked at Zhou Weiqing they no longer saw that simple, ordinary human youth.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing continued to float there, all the light having been completely withdrawn into his body.\u0026nbsp;The only difference was that on his chest, a ball of light seemed to emanate ephemeral flickers.\u003c/p\u003e\n\u003cp\u003eThere weren’t any particularly powerful energy ripples.\u0026nbsp;Zhou Weiqing looked like a very ordinary person, but the wings on his back had already vanished.\u0026nbsp;He himself, however, continued to hover in the air.\u003c/p\u003e\n\u003cp\u003eHis skin had turned as pale as ivory, and it glowed with sleek, glossy light.\u0026nbsp;His features were never particularly handsome, but right now they felt almost holy and sacred.\u0026nbsp;He seemed to have become translucent.\u0026nbsp;As he hung there in the sky, he was like part of the air itself rather than a human.\u0026nbsp;If you closed your eyes, you wouldn’t be able to notice he was there.\u0026nbsp;Not even the two Heavenly God dragons could sense his presence.\u003c/p\u003e\n\u003cp\u003eHui Yao let out a long breath, draconic eyes spread wide.\u0026nbsp;If in the past he could easily sense how Zhou Weiqing’s cultivation was changing, even for a powerhouse like him Zhou Weiqing had now turned into an enigma.\u0026nbsp;There was no point in using any type of senses to try and scan him.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing, still floating in the air, slowly opened his eyes.\u0026nbsp;When they saw his eyes, the two great dragons and Shangguan Bing’er couldn’t help but stare.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s eyes weren’t glowing with dazzling light as they had imagined.\u0026nbsp;In fact, it was just the opposite.\u0026nbsp;His eyes looked a bit glossier than the eyes of others, but there was nothing particularly powerful to them.\u003c/p\u003e\n\u003cp\u003eHeavenly Jewel Masters were different from ordinary people.\u0026nbsp;The more powerful a Heavenly Jewel Master was, the more powerful their auras and their gazes would become.\u0026nbsp;And yet… Zhou Weiqing seemed to have completely lost these Heavenly Jewel Master abilities.\u0026nbsp;It was as though he was just an ordinary person… but could that really be true?\u0026nbsp;How could an ordinary person float in the skies?\u003c/p\u003e\n\u003cp\u003eAs he opened his eyes, the dazzling ball of light in his chest grew dim.\u0026nbsp;It was as though everything had gone back to normal.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing bowed down in midair, offering his respects to Hui Yao and Duo Si.\u0026nbsp;“Thank you, seniors, for assisting me.\u0026nbsp;Weiqing shall never forget your help.”\u003c/p\u003e\n\u003cp\u003eHis voice didn’t seem to have changed, but it now had a certain charisma that felt extremely comfortable.\u0026nbsp;Hui Yao smiled and shook his head.\u0026nbsp;“No, this was your destiny.\u0026nbsp;You did good deeds and so reaped a good reward.\u0026nbsp;In addition, we benefited from your ascendance as well.\u0026nbsp;I really want to know what cultivation level you have reached.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chuckled.\u0026nbsp;“To be honest, I’m not sure either.\u0026nbsp;I think I’m a Heavenly King, but I don’t know what stage.”\u003c/p\u003e\n\u003cp\u003eThe two great dragons were both rather shocked to hear him say he was a Heavenly King.\u0026nbsp;As they saw it, no Heavenly King could’ve caused those phenomena which Zhou Weiqing had just displayed.\u0026nbsp;Clearly, his Attributes had mutated somehow.\u003c/p\u003e\n\u003cp\u003eHowever, Shangguan Bing’er had a different interpretation when she heard this.\u0026nbsp;A twenty-three year old Heavenly King!\u0026nbsp;This was a speed of cultivation which was unequalled in past, present, and future in the Boundless Mainland… and the man who did it was her man.\u003c/p\u003e\n\u003cp\u003eA deep sense of pride pervaded Shangguan Bing’er’s heart.\u0026nbsp;The feeling was quite marvelous.\u0026nbsp;She spread her wings, discarding her embarrassment and throwing herself into Zhou Weiqing’s arms.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing held Shangguan Bing’er in his arms.\u0026nbsp;He was every bit as excited as Shangguan Bing’er, but he didn’t reveal it.\u0026nbsp;It seemed as though his mentality had transformed and grown just as much as his cultivation had.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er nestled herself into Zhou Weiqing’s arms.\u0026nbsp;She felt that he smelled extremely good right now.\u0026nbsp;She couldn’t explain what he smelled like, but she felt that it was refreshing and comfortable.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said to Hui Yao and Duo Si, “Seniors, I wasted quite some time.\u0026nbsp;Let’s continue on our journey.”\u003c/p\u003e\n\u003cp\u003eHui Yao nodded.\u0026nbsp;He exchanged a glance with his wife, then the two transformed into balls of fire that flew into the Spatial Teleportation Gem around Zhou Weiqing’s neck.\u003c/p\u003e\n\u003cp\u003eOnce they actually entered the Spatial Teleportation Gem, they discovered to their astonishment that the gem, which had teetering at the brink of collapse, had actually been fully repaired.\u0026nbsp;Now only was it now extremely sturdy, its Spatial power had increased countless times over.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing hadn’t repaired it.\u0026nbsp;Clearly, when Zhou Weiqing had made his breakthrough, the Spatial Teleportation Gem had been repaired by the energies he had emitted.\u0026nbsp;One could simply imagine how marvelous Zhou Weiqing’s Attributes were!\u003c/p\u003e\n\u003cp\u003eZhou Weiqing himself had the deepest understanding as to what had happened.\u0026nbsp;To put it simply, only Heavenly King-level Saint Energy was ‘real’ Saint Energy.\u003c/p\u003e\n\u003cp\u003eThe Sea Emperor Shuttle once more descended from the skies into the sea, with Zhou Weiqing and Shangguan Bing’er hopping into it.\u0026nbsp;They closed the lid, then Zhou Weiqing hugged Shangguan Bing’er and said with a smile, “Bing’er, I think we’ll arrive home a bit earlier.”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said, “Little Fatty, do you know how much time you used up after Devouring that thing and then breaking through?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing shook his head, puzzled.\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er said, “Nearly two months.”\u003c/p\u003e\n\u003cp\u003e“WHAT?!\u0026nbsp;That long?”\u0026nbsp;Zhou Weiqing had thought that it had been half a month at most.\u0026nbsp;He didn’t imagine that two months would have gone by in the blink of an eye.\u003c/p\u003e\n\u003cp\u003e“Then let’s hurry up and go back.\u0026nbsp;The two seniors are waiting for us to return so they can rescue their children.”\u0026nbsp;When he thought of coming back, Zhou Weiqing felt as though he needed to go home immediately.\u0026nbsp;He had temporarily discarded everything else to come here, but in truth he needed to do many, many things.\u0026nbsp;His most important task was to rescue his parents and the others, then re-establish the Heavenly Bow Empire!\u003c/p\u003e\n\u003cp\u003eZhou Weiqing didn’t use his hand to press the crystal into the indent.\u0026nbsp;Instead, he just willed it and the Sea Emperor Shuttle instantly shot forward like a bolt of lightning, diving into the sea and disappearing.\u003c/p\u003e\n\u003cp\u003eThis sudden acceleration badly startled Shangguan Bing’er, even though her body didn’t suffer from it. Zhou Weiqing’s body glowed with a layer of faint golden light which captured her as well, sending the Sea Emperor Shuttle hurtling through the seas like an arrow.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-258-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-26-chapter-258-03\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-26-chapter-258-02","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
