{"id":51985,"no":811,"title":"Chapter 276: The Sidhe\u0027s Sealed Grounds (1)","content":"\u003cp\u003eThe amount of atmospheric energy within a specific area was limited; the best ways for two Heavenly King powerhouses to succeed at breaking through at the same time would be breaking through in a cave paradise or engaging in a special way to gather atmospheric energy from somewhere far away. However, they clearly did not fulfill either criteria.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eOn another note, Shangguan Xue’er had rushed into breaking through, causing her aura to be impure. Additionally, she trained in different energies from Fei’er; when she was affected by Fei’er’s energy ripples, not all the Attributes reacted within her body. As a result, her personal energy aura became chaotic.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eUgh. I didn’t succeed completely. Looks like I won’t be able to fulfill my dream of a foursome with the triplets\u003c/em\u003e. Zhou Weiqing stood next to Shangguan Xue’er, looking rather depressed. Due to his level of cultivation, it naturally wouldn’t affect Shangguan Xue’er. Looking at her furrowing her brows, Zhou Weiqing raised his right hand and waved it in the air.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIt was different from how he usually summoned the starry skies - this time, the bright sky became pitch dark almost immediately. The galaxy of stars appeared, filling the entire sky.\u003c/p\u003e\n\u003cp\u003eAfter ascending to become a Heavenly Emperor, Zhou Weiqing’s mastery of the stars naturally increased significantly. However, the spectacular scenery of the stars that he summoned could not directly be used to attack the enemy. He had to use it in conjunction with his own energy, which would determine how effective it was.\u003c/p\u003e\n\u003cp\u003eWith the stars hanging in the sky being controlled by the force from Zhou Weiqing’s right hand, the atmospheric energies in the sky instantly became much denser, solving Shangguan Xue’er and Shangguan Fei’er’s first breakthrough problem.\u003c/p\u003e\n\u003cp\u003eImmediately afterwards, six rays of light flashed on Zhou Weiqing’s body as he released his releasing six mighty Attributes. The reddish golden starlight was splendid, and it caused the Heavenly Energy within Shangguan Xue’er’s body to immediately star circling.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eA dense and pure Astral Saint Energy channeled into Shangguan Xue’er’s body and flowed directly to the center of her chest where her Heavenly Core Nucleus was being condensed. This meant that her breakthrough had been guided to the correct route.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er looked at Zhou Weiqing’s irritated face and could not help but laugh out loud.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“Seems like you can’t do the naughty stuff you wanted. Sister’s so naturally gifted, she was able to break through on her own. Hehe.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing fiercely walked over to Shangguan Bing’er and tugged her into his arms. Of course he knew that given on Shangguan Xue’er’s nature, she did not actually need to do the deed with him to attain a breakthrough. She did it herself instead. Unfortunately, it would be impossible for him to attain his goal within a short period of time.\u003c/p\u003e\n\u003cp\u003e“The younger sister shall repay the older sister’s debt. I’m going to eat you tonight, hmph.”\u003c/p\u003e\n\u003cp\u003eShangguan Bing’er did not move to avoid him; instead, she gently leaned on him. She truly treasured the time she shared with him. No matter how magnanimous she was, she still wasn’t completely happy that she was sharing her man with several other women.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eFeeling Shangguan Bing’er’s gentleness, Zhou Weiqing’s face eased up a little. He lovingly stroked her head and lightly held her in his arms, feeling her warmth.\u003c/p\u003e\n\u003cp\u003eThe breakthrough of the Shangguan sisters took three full days, and this was with the help of Zhou Weiqing’s Astral Saint Energy. And as a result, Heavenly Bow Empire had experienced three days straight without daylight. However, it did not bring about panic. On the contrary, the marvel in the sky greatly benefited the people of Heavenly Bow Empire.\u003c/p\u003e\n\u003cp\u003eOne must know that with the galaxy of stars hanging above this region, the atmospheric energy within Heavenly Bow Empire became exceptionally plentiful. Even those who were not Heavenly Jewel Masters would still see great benefits to their bodies. Heavenly Jewel Masters who took this opportunity to cultivate would see the effectiveness of their cultivation be much greater than normally.\u003c/p\u003e\n\u003cp\u003eFour days later, dawn.\u003c/p\u003e\n\u003cp\u003eSix figures quietly soared into the air from outside of Heavenly Bow Empire and set off.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eOf course, those six people were Zhou Weiqing and his five ladies.\u003c/p\u003e\n\u003cp\u003eApart from Little Witch, the other four ladies had already reached a breakthrough to the Heavenly King Stage and thus were equipped with the ability to fly. Shangguan Bing’er relied on the Wind Spirit Saint Core Nucleus - the speed of her flight was comparable to that of a Heavenly Emperor.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eNeedless to say, Little Witch was being carried up by Zhou Weiqing - although she had not reach a breakthrough to the Heavenly King Stage, with the help of Zhou Weiqing’s Astral Saint Energy, she had already reached the Nine Jeweled level. Never did she expect her cultivation to progress this fast.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s Astral Saint Energy was indeed magical, but it could not be used nonstop. However, because the five women were the closest people to him, he did not hesitate to use it on them. By helping them breakthrough during this period of time, his own cultivation was hindered while his vitality was also negatively affected. Hence, he did not immediately help Little Witch to make a breakthrough to the Heavenly King Stage. He needed to recuperate for a period of time first.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWhile flying in the sky, Zhou Weiqing’s kept on turning his gaze towards Shangguan Xue’er. His unwillingness to resign to his earlier defeat was shown all over his face. Shangguan Xue’er did not even look at him at all - she flew right in front, expressionlessly. But if one took a closer look, one would be able to see an amused look in her eyes from time to time.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er flew next to Xue’er, also ignoring Zhou Weiqing’s presence. This fellow had made her do something extremely naughty the other day. Even though it ultimately led to her breakthrough, Shangguan Fei’er still found it rather hard to accept it.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTian’er was flying together with Shangguan Bing’er. With the four women at the front, all Zhou Weiqing had was Little Witch by his side.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said to Xue’er via voice transmission, “Xue’er, truth be told, if we do the deed it will still benefit you. The benefits are greatest the first done. Even though you have already reached a breakthrough to the Heavenly King Stage, you are still rather far from breaking through to the Heavenly Emperor Stage. If we do it often, for all you know you might suddenly break through to the Heavenly Emperor Stage in no time. By then, you would be able to wear the complete Boundless Infinitum Set! That is the best Legendary Set in the world. With the help of the Boundless Infinitum Set, our Peerless Sect’s power would be greatly increased once again.”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er turned her head and glared at him, “You idiot, how could I possibly wear the Boundless Infinitum Set?! Even though the Heaven’s Expanse Palace has strong and solid financial resources, the\u0026nbsp;Boundless Infinitum Set belongs to them exclusively – save for the Palace Master, none are allowed to possess it. They already made an exception for me by letting me own a few pieces of it. Uncle would never let me wear the remaining pieces of the Boundless Infinitum Set. You already have the four of them, why do you still keep thinking about naughty stuff? You should focus on thinking through how to settle things with the sidhe first. Even though we have grown stronger, our Consolidated Equipment isn’t complete and has not yet been fully Stored. Trying to take forceful action isn’t going to work. Also, remember that you’ve already promised me that you would not kill a single sidhe.”\u003c/p\u003e\n\u003cp\u003eUpon hearing Shangguan Xue’er’s words, not only did Zhou Weiqing did not get angry, he was actually overjoyed at the unexpected good news - since Xue’er expressed that she could not wear the Boundless Infinitum Set, this meant that she had already decided to stay by his side, giving up her future position as the Palace Master of Heaven’s Expanse Palace.\u003c/p\u003e\n\u003cp\u003eEven though Zhou Weiqing had guessed her intentions long ago, it was different hearing it directly from her mouth.\u003c/p\u003e\n\u003cp\u003eHe went in front and flew next to Shangguan Xue’er. Zhou Weiqing stared deeply into her eyes, “Xue’er, don’t you worry. I will help you solve the problems pertaining to your Legendary Set. After we have settled things with the sidhe, I will bring you guys along to take part in the Grand Tournament of Saint Lands. After it has ended, we will go back to Heaven’s Expanse Palace.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“Go back to Heaven’s Expanse Palace? For what?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chuckled, “To ask for your hands in marriage, of course! I’ll be sure to send the betrothal gifts as well. The three sisters who are as beautiful as flowers, the precious treasures of Heaven’s Expanse Palace, are about to be married off to me. If I don’t bring sufficient betrothal gifts over, they would not bear to let you three go!”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing did not use voice transmission for the above speech, hence all the ladies could hear it clearly.\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er snapped, “You’re that kind-hearted? It seems to me it’s more like you’re asking for a dowry.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing stared blankly for a bit and thought to himself:\u003cem\u003e\u0026nbsp;Fei’er knows me like the back of her hand. She understands me far too well!\u0026nbsp;\u003c/em\u003eImmediately, he forced a smile and said, “Fei’er, it’s crazy how well you know me! How do you know what I’m thinking?”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er scoffed, “How could I not understand the type of sleazy personality you have? When have you ever let yourself suffer any losses?”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing chuckled, “Besides, I’m only asking for the dowry for the sake of you guys. Since the Heaven’s Expanse Palace is marrying off their daughters, it should you the complete Set. I just want them to give you the full Legendary Set, then store a few skills for you. This is not too much to ask for, right?”\u003c/p\u003e\n\u003cp\u003eShangguan Fei’er did not make any sound - clearly, she acknowledged what Zhou Weiqing said.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZhou Weiqing looked at Fei’er and said, “As for Xue’er’s Boundless Infinitum Set, I have my ways. There are no absolutes. Trust me. If I show enough sincerity, Uncle just might come around.”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er said softly, “Little Fatty, don’t sacrifice too much for me. I can always request the three God Tier Masters to help me remove the Boundless Infinitum Set and choose another Legendary Set instead.\u003c/p\u003e\n\u003cp\u003e“It’s fine. Trust your husband.” Zhou Weiqing immediately rejected her proposal. She had to be kidding! Shangguan Xue’er had been using the Boundless Infinitum Set since childhood as the basis of her cultivation. One could say that her greatest strengths depended on the Boundless Infinitum Set itself. If she were to change Legendary Sets, it could result in a rather huge blow to Xue’er. There was no way Zhou Weiqing would let that happen.\u003c/p\u003e\n\u003cp\u003e“Xue’er, we have already set out. You can now explain to us a bit more about the sidhe.”\u003c/p\u003e\n\u003cp\u003eEven though Xue’er had agreed to take Zhou Weiqing to search for the sidhe, till now she still had yet to reveal the exact location of the sealed grounds to Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er gently nodded and replied, “The sealed grounds of the sidhe are at the eastern border of the Amber Empire, next to the Mi Ou Empire. It is relatively far from the Heavenly Bow Empire. Even the Amber Empire does not know the specific location, even though it is very close to them.”\u003c/p\u003e\n\u003cp\u003eZhou Weiqing thought for a moment and said, “The supposed sealed grounds of the sidhe - does it refer to the sidhe being sealed within it or that they set up a seal outside the area, not allowing humans to enter?”\u003c/p\u003e\n\u003cp\u003eShangguan Xue’er shook her head and said, “Both are incorrect. If that were the case, the sidhe would have been found by humans a long time ago. They would have never been able to recuperate in peace for so many years. To put it simply, the sealed grounds of the sidhe and the Luster Spatial Realm of the Heaven’s Expanse Palace are similar - they rely on strong energy forces to exist within a constructed dimensional plane which is anchored upon the Mainland.”\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-275-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-276-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-27-chapter-276-01","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
