{"id":51997,"no":823,"title":"Chapter 280 - Dragon-Tiger Demon God Transformation(1)","content":"\u003cp\u003eThe man in black’s response was definitely fast enough and he made a judgment call on the spot. After he struck the little princess hard on the back, causing her to fly to the Sidhe Queen, he turned around and ran away.\u003c/p\u003e\n\u003cp\u003e“Trying to escape? Go to hell.” Zhou Weiqing’s cold voice was heard. A whitish golden light flashed in the sky and the man in black vanished into thin air, without making a sound.\u003c/p\u003e\n\u003cp\u003eYes, he vanished and became a speck of dust in the air.\u003c/p\u003e\n\u003cp\u003eAfter dealing with the man in black, Zhou Weiqing’s body fell directly to the ground in an instant. At the same time, blood spurted out of his mouth.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHowever, nobody saw that his eyes were filled with relief, yet at the same time he had a slight crafty look in them, as he was falling to the ground.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAs the Sidhe Princess flew upon impact, the Sidhe Queen immediately rushed forward at top speed to catch her daughter. As long as her child had a chance to live, no matter how small it might be, she would rescue her without any hesitation!\u003c/p\u003e\n\u003cp\u003eAnd at this time, something strange happened. In the split second when the Sidhe Princess got struck, the speed at which she was flying at was extremely fast. However, it was only for that brief moment. After that, she stopped flying forward and started descending to the ground instead.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWith the Sidhe Queen’s high cultivation base, she effortlessly used Nature Energy to sweep the little princess up before placing her into her embrace.\u003c/p\u003e\n\u003cp\u003eOnce the little princess was in her arms, the Sidhe Queen sensed something amiss. The little princess at this moment had the same huge suction force as before; she did not stand on ceremony with her mother - she absorbed the Sidhe Queen’s Nature Attribute Energy rapidly. What was even more mysterious was the fact that she started to grow a little, as she was absorbing the energy. She originally looked like a five- or six-year-old, but she looked more like a seven- or eight-year-old now.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat is going on?\u003c/em\u003e Even though the Sidhe Queen could not comprehend what happened to her daughter, she could clearly sense the presence of her daughter’s life aura. In fact, her life aura was a lot stronger than before. As a Heavenly God Stage powerhouse, how would she be unable to tell that her daughter was safe and sound? And without a doubt, the key reason why she was still alive was because of Zhou Weiqing’s strike.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAh! Zhou Weiqing - what happened to him?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAt this moment, the Sidhe Queen thought of that miserable guy. When she took a closer look at the sky, he was nowhere in sight.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen had never experienced such an emotion before - she was filled with intense regret in an instant: \u003cem\u003eWhy did I not trust him! He was definitely the one who saved my daughter, but I just had to injure him severely.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWithout any hesitation, the Sidhe Queen immediately activated her Nature Celestial Territory as she would be able to sense everything within the sphere of her Celestial Territory immediately. At the same time, she wanted to absorb the atmospheric energy in the air at a faster rate to replenish the energy that was currently being absorbed by her child.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAt this time, the silver starlight around the Sidhe Princess’ body had gradually infused into her body, and had stopped absorbing the Sidhe Queen’s Heavenly Energy, before falling into deep slumber. The Sidhe Queen experienced a flurry of mixed emotions looking at her daughter who had become a few years older, and more beautiful than before.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHer figure flashed and in the next moment, she had already descended to the ground, appearing in front of Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eDescribing Zhou Weiqing’s current state as ‘dire straits’ would be an understatement. The Legendary Set on his body had completely disappeared; even his clothes had been completely torn up by tree branches as well as the rocks on the ground during the fall. His entire body was crushed against the concrete ground, with his limbs spread out motionlessly.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAnybody who saw him in that state would have found it hilarious, but in the case of the Sidhe Queen, she felt extreme remorse - not only did she injure him, he even used the last bit of his strength to help her kill off the enemy. Even then, she could not catch him in time, causing him to fall to the ground just like that. \u003cem\u003eZhou Weiqing, you must not die! Or else I will spend the rest of my life blaming myself.\u0026nbsp;\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAs she was thinking to herself, a light flashed in the Sidhe Queen’s hands and an enormous leaf appeared out of nowhere. She placed her daughter on top of the leaf, which curled up thereafter, wrapping the Sidhe Princess within it. A green light flashed and it vanished into thin air.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAfter keeping her daughter safe, the Sidhe Queen carefully pulled Zhou Weiqing out of the man-shaped pit on the ground.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAnyone who saw Zhou Weiqing’s current condition would cringe in pity; due to his torn clothes, his skin was showing everywhere. Furthermore, his aura was especially weak - it was extremely hard to sense any energy ripples from his body.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAt this moment, the Sidhe Queen had forgotten all gender differences. She ran both hands all over Zhou Weiqing’s body and found that the meridians in his body were badly damaged. As for his bones and muscles, they were not severely injured - the most badly injured part of his body was his shoulder.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShe carefully turned Zhou Weiqing’s body over. The Sidhe Queen slightly shuddered.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eRight now, Zhou Weiqing’s face was as yellow as joss paper; his aura was extremely weak; the Saint Energy within his body was in chaos. His right shoulder was completely swelled up - it was twice as big as its original size, so much so that his damaged veins below could clearly be seen. His entire right shoulder had already turned dark purple - it was almost impossible to check the state of his bones.\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen’s voice was shaky, she muttered, “I… I really didn’t know. It’s all my fault, I should have trusted you. I……” At this moment, her mind was in chaos. \u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShe carefully ripped Zhou Weiqing’s clothes apart, before placing both hands on his shoulder, in a bid to administer therapy via Water Elemental Energy. Trickles of life aura were continuously flowing out from the Sidhe Queen’s palm, channeling into Zhou Weiqing’s body.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eRight now, the Sidhe Queen no longer looked like a strong and powerful leader. Instead, she looked more like the little girl next door.\u003c/p\u003e\n\u003cp\u003eSince she was a child, she was not only at the center of attention within the Elf Tribe, she was also well-loved and respected by everyone. She had never touched a male elf before in her life, let alone a man!\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s thick muscles were full of manly aura, causing a great impact to the Heavenly God Stage Sidhe Queen’s heart. Even thoughts such as: \u003cem\u003eSo this is how a man is like?\u0026nbsp;\u003c/em\u003efloated through her mind.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe Water Elemental Energy that the Sidhe Queen channeled into Zhou Weiqing’s body was rejected almost immediately. Even though the remaining Saint Energy within Zhou Weiqing’s body was very little, it was Saint Energy after all. Thus, when the Water Elemental Energy was injected into Zhou Weiqing’s body, it would get engulfed by his Saint Energy. This was the same for Life Energy; there was absolutely no healing effect.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat should I do?\u003c/em\u003e The Sidhe Queen did not even dare to move Zhou Weiqing at all. If he were an ordinary human, her treatment would have shown some results - after all, she had a high cultivation base. However, as Zhou Weiqing possessed Saint Energy, a mysterious energy that even a high level powerhouse such as herself could not comprehend, there was nothing she could do except to stay by his side and carefully channel some Nature Energy into his body continuously. Even if all it did was strengthen his Saint Energy by a little, it was better than nothing.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen was very clear about the fact that when a Heavenly Jewel Master had reached a certain level, it would be difficult for him to get injured. This was due to the fact that his physical body had become way too strong to be damaged or injured easily. But precisely because of that, when he gets wounded, it would be very difficult to treat his injuries. Even minor injuries could be very problematic, because the Heavenly Energy within a powerful Heavenly Jewel Master’s body would equally be powerful. Any injury could cause a problem in the restriction of the Heavenly Energy, and therefore could easily cause it to backfire and harm him instead.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTiny beads of sweat were formed on the Sidhe Queen’s pale forehead - she had never ever expected herself to owe such a huge favor to a human being.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s condition seemed to be worse than her initial judgment; his aura was becoming weaker and weaker, the Saint Energy circling in his body was slowing down. There was a possibility than he could lose his life at any moment.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-279-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-280-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-27-chapter-280-1","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
