{"id":51998,"no":824,"title":"Chapter 280 - Dragon-Tiger Demon God Transformation (2)","content":"\u003cp\u003e\u003cem\u003eWhat should I do, what should I do!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen was panicking. If Zhou Weiqing died there, not only would it lead to a chain reaction, she herself would also be unable to accept what happened. She was the main cause of Zhou Weiqing’s injuries and that was something that the kind-hearted Sidhe Queen could not accept. If Zhou Weiqing died, it would leave behind an emotional scar in her heart for the rest of her life.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIn fact, this showed her lack of understanding of Zhou Weiqing’s Saint Energy. Zhou Weiqing’s aura becoming weaker and weaker was a self-protection mechanism, and the slowing down of the Saint Energy’s flow was because it was healing his injuries. As long as the Saint Energy-possessing Zhou Weiqing was still breathing, he definitely would not die. He would be able to heal and restore his body on his own, except that the duration depended on how serious his injuries were.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThis time, Zhou Weiqing’s injuries were indeed severe, especially so because he forcefully used up his remaining strength to kill off the man in black after receiving the fatal blow from the Sidhe Queen. This greatly diminished the remaining Saint Energy in his body, hence the process of treating his injuries slowed down a lot. Otherwise, his condition would shown signs of improvement even after just a short period of time.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSaint Energy was a form of Creation Energy, it was of utmost importance in protecting one’s body. It would never backfire and hurt oneself, unlike Heavenly Energy. Hence, Zhou Weiqing was completely safe and sound - all he needed was two or three days at most to recover.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHowever, even though Zhou Weiqing could wait, the Sidhe Queen couldn’t! She was currently going through an emotional turmoil.\u003c/p\u003e\n\u003cp\u003eLooking up at the sky, it had gradually darkened. The surroundings were very peaceful and quiet, as though an intense battle had never happened.\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen looked at Zhou Weiqing; she had a troubled look in her eyes. She pressed her right hand against her chest a few times and held it there.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“He saved my daughter; if not for him, under that man’s threat, I would not be able to do anything. However, I hurt him instead and even put his life in danger. How could I be so selfish and only think about myself?”\u003c/p\u003e\n\u003cp\u003eAfter the Sidhe Queen muttered that, she had a resolved look in her eyes. She took a deep breath, and slowly removed the front piece of her outerwear.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTo be precise, her outerwear disappeared on its own. The elves were sons and daughters of mother nature; at the Sidhe Queen’s cultivation level, her clothes were completely formed by Nature Energy.\u003c/p\u003e\n\u003cp\u003eSnow-like pale skin was slowly exposed, her body was entirely flawless. At this moment, she looked pure and holy. A layer of faint green light automatically formed around her - she did not intentionally release it. The light was formed as a result of the Natural Elemental Attributes in the air sensing her aura.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eLooking at Zhou Weiqing, the Sidhe Queen resisted the fear and nerves within her with much difficulty. Ultimately, she clenched her teeth and waved both hands. Thereafter, her long skirt completely vanished.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eA pair of smooth and slender legs, possibly the Creator’s most perfect work of art, came into view; with her slender legs, perfectly round butt, and a slim waist that could be held with one hand - every man would go crazy just by looking at her.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen clenched her teeth and finally took a deep breath; her entire body slowly floated off the ground, and the green light surrounding her body became stronger. That green misty light made the Sidhe Queen’s body faintly discernible, making it more captivating.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSlowly floating above Zhou Weiqing’s body, the green light around the Sidhe Queen started flickering. A green halo circled in the air before slowly descending and enveloping Zhou Weiqing’s body within it.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAt this very moment, the Life Energy surrounding Zhou Weiqing’s body had become terrifyingly massive, to the extent that his current Saint Energy was unable to fully absorb it.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eImmediately after, Zhou Weiqing’s body started floating above the ground as well. His torn clothes transformed into fine powder thereafter.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe Sidhe Queen looked at him and her gaze softened - all her troubled emotions vanished and were replaced by purity that could not be described by words alone.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAs she was in the air, she gradually bent her legs and tucked them into her chest. In doing so, it made her butt looked rounder. At the same time, both her arms hugged her legs; she lowered her head, pressing it against her thighs, curling herself up into a ball.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eFrom the back, the Sidhe Queen’s long green hair had already fully covered her delicate body, including her appealing butt.\u003c/p\u003e\n\u003cp\u003eDense bluish green light was released from the Sidhe Queen’s body. At this moment, she no longer looked like an elf, but a bright gem. The strong life aura surrounding her body had transformed into the purest form of essence. A bluish green circle of light gradually expanded, forming a huge halo with a radius of a hundred meters, with the Sidhe Queen and Zhou Weiqing in the center of it.\u003c/p\u003e\n\u003cp\u003eAll anyone could see within the illuminated area was bluish green, due to the massive amount of Life Energy. Something strange appeared next. The Sidhe Queen, who was all curled up and bluish green in color, started to shrink, becoming smaller and smaller.\u003c/p\u003e\n\u003cp\u003eWithin the timespan of ten breaths, she had actually transformed into a fist-size bluish green gemstone.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eA light flashed and the bluish green gem fell onto Zhou Weiqing’s chest and gradually entered his body.\u003c/p\u003e\n\u003cp\u003eImmediately, Zhou Weiqing, who originally had ample Saint Energy, entirely became a shade of bright bluish green. The stream of Saint Energy within his body started amplifying rapidly, as though it had been violently stimulated. The terrifying life aura was no longer subjected to the suppression of the Saint Energy. Under the effects of the overwhelming Life Energy, his Saint Energy was temporarily suppressed.\u003c/p\u003e\n\u003cp\u003eThere was unexpectedly a tinge of creation powers within the Life Energy, but it could not create everything, but life alone.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eDuring the Life Energy’s process of ascending, Zhou Weiqing’s body started undergoing changes. Firstly, the swelling of his shoulder went away rapidly. Next, all of his meridians started healing at a fast rate under the power of the massive Life Energy - they even became stronger and tougher than before.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eZhou Weiqing possessed Nebula Saint Energy - his vitality had always been strong. However, due to the effects of the special Life Energy, his strong vitality actually became a few times stronger.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIf Zhou Weiqing was awake at this moment, he definitely would have been extremely shocked - he never would have imagined the possibility of his physical condition improving any further.\u003c/p\u003e\n\u003cp\u003eTiger patterns, as well as dragonscale patterns, gradually appeared from beneath his skin. Under the influence of the massive Life Energy, everything started amalgamating.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003ePreviously, whenever Zhou Weiqing performed the Dragon-Tiger Transformation, dragon-shaped scales would appear on his body, while both hands and his right leg would undergo Demonic Change with the Dark Demon God Tiger Bloodline.\u003c/p\u003e\n\u003cp\u003eHowever, it was different this time - the dragon scales were still present, but the Dragon Emperor Bloodline and the Dark Demon God Tiger Bloodline started genuinely fusing together under the power of the massive Life Energy. The color of the dragon scales gradually became black, and gray tiger patterns slowly appeared on top of it. And on Zhou Weiqing’s back, a strange phantom image appeared out of thin air.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIt was a type of Dragon-Tiger Divine Beast - it had the head of a dragon, the body of a tiger, the claws of a dragon, and the tail of a scorpion. It practically looked like the amalgamation of a great dragon and a Dark Demon God Tiger. It had the same color as Zhou Weiqing’s skin - its black body was covered in gray tiger patterns that were filled with icy demonic energy.\u003c/p\u003e\n\u003cp\u003eRegardless of whether it was Dark Demon God Tiger Bloodline or\u0026nbsp;Dragon Emperor Bloodline, they were both one of the most powerful bloodlines in the world. Zhou Weiqing had tried to merge them together before, however, it was only natural for the two bloodlines to repel one another. Thereafter, following Zhou Weiqing’s continuous rise in strength and power, as well as the constant rise in the power of his Saint Energy, the repulsion between the two bloodlines was no longer apparent. Under the suppression of the Saint Energy, the energy of the bloodlines would no longer affect Zhou Weiqing in any way, or cause him any harm.\u003c/p\u003e\n\u003cp\u003eHowever, the amalgamation was not thorough after all - the full might and power of the Dragon-Tiger combination were not fully brought out. Especially after Zhou Weiqing gradually comprehended the Demon God Energy, and was able to summon the Demon God’s projection, the Dragon-Tiger Transformation became something of little value to him, in terms of boosting his abilities.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHowever, at this very moment, the unique Life Saint Energy provided by the Sidhe Queen that was filled with life creation quality became the best agent to merge them together. Under its influence, Zhou Weiqing’s Dragon-Tiger Bloodline was finally able to merge perfectly together with the Demon God Energy, achieving the current Dragon-Tiger Demon God Transformation.\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-280-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-27-chapter-281-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-27-chapter-280-2","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
