{"id":51257,"no":83,"title":"Chapter 21 Stealing the heart, Surprise Attack (3)","content":"\u003cp\u003e\u003cb\u003eChapter 21 Stealing the heart, Surprise Attack (3)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eAlthough Shangguan Bing’er was only 16 years old, but her body was quite well developed. Wearing that tight fitting leotard accentuated her beautiful curves, causing Zhou Weiqing to gulp down large amounts of saliva, and his gaze couldn’t help but wander a little.\u003c/p\u003e\n\u003cp\u003e“Hey, what are you looking at?” Shangguan Bing’er flushed a little, slapping his shoulder. “You walk in front, you’re not allowed to stare.” Zhou Weiqing’s scorching gaze had made her a little flurried.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing’s heart was racing, and he couldn’t help but think to himself. \u003ci\u003eSuch an amazingly beautiful girl, and she had already been mine? That day… why can’t I remember anything? How sad.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eUnder Zhou Weiqing’s control, his attribute wheel once again turned into the green area demarcating the wind attribute. His right wrist was now surrounded with the Icy Jade Physical Jewel, while his left wrist was surrounded by the Alexandrite Cat’s Eye Jewel, which had turned into a rosy hue in the night. With the boost to his speed, Zhou Weiqing started moving ahead once again at a high speed.\u003c/p\u003e\n\u003cp\u003eAt the same time, Shangguan Bing’er also released her Heavenly Jewels and followed behind him.\u003c/p\u003e\n\u003cp\u003eOriginally, Shangguan Bing’er had thought that for such a long distance travel, Zhou Weiqing’s speed might not be sufficient. Her plan was that if he was too slow, she would just have to help him along. However, when both of them had released their Heavenly Jewels and started moving at top speeds, she was surprised to find that Zhou Weiqing’s direct linear movement speed was actually comparable to her own, a dual agility type Heavenly Jewel Master.\u003c/p\u003e\n\u003cp\u003eSince she could observe him from behind, Shangguan Bing’er quickly found the reason why. Although Zhou Weiqing’s movement was not slow, but there was still quite some difference between his maximum speed and hers.\u003c/p\u003e\n\u003cp\u003eHowever, the true secret behind why he could travel so fast now was actually his right leg! Every time his left leg tapped onto the ground, it was merely as a fulcrum, and his body moved at a rather normal pace. However, once his right foot touched the ground, his whole body seemed to shoot forward like an arrow. As such, although his running speed was extremely fast, it was actually with a lot of sudden bursts, and was not a constant pace.\u003c/p\u003e\n\u003cp\u003e“Little Fatty, your right leg?” Shangguan Bing’er Consolidated her second Physical Jewel into her Wind Wielding Boots, and instantly a pair of green boots coalesced around her feet, allowing her to move a lot faster than Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing turned his head to look at Shangguan Bing’er who was running beside him.\u003c/p\u003e\n\u003cp\u003eHe grinned and said: “Heh, isn’t is so awesome? My leg is really powerful now. It seems to be a bonus ability that came from that black pearl. Remember that time in the forest when I was suddenly struck down with my whole body in pain when I was with Company Leader Xiao, and I had to hug you for a while before I got better? After that time, my right leg seems to have evolved, and became a lot stronger.” Towards Shangguan Bing’er whom he thought of as his own lady, he naturally would not hide anything about his abilities, and he quickly described the abilities of his new leg and the training he did.\u003c/p\u003e\n\u003cp\u003eOnly then did realisation strike Shangguan Bing’er. \u003cem\u003eNo wonder along the way he had refused to ride on his warhorse, and had instead gone on foot beside the main body of troops. It was actually to get used to his right leg.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eOriginally, she had some qualms about this surprise attack, and was feeling nervous. After all, she thought that Zhou Weiqing’s speed was insufficient to escape if things went south. However, it now seemed like her worries were for naught, and they had a higher chance of success.\u003c/p\u003e\n\u003cp\u003eA distance of three hundred li was not far for Heavenly Jewel Masters like them, and under their maximum effort, it took they about two hours to reach their target destination.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003e“Little Fatty, if we go any further, we will start reaching the enemy’s sentry posts already.” Shangguan Bing’er stopped and looked towards Zhou Weiqing.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing nodded and said: “Let’s rest for a while first, you should recover some of your Heavenly Energy as well.”\u003c/p\u003e\n\u003cp\u003eThe pair looked for a hidden corner to get a rest, and to recover their Heavenly Energy. Although Zhou Weiqing’s cultivation level was much lower than Shangguan Bing’er, he had the advantage of the Immortal Deity Technique’s amazing power, which allowed him to continue absorbing Heavenly Energy from the surroundings even while running with his Jewels Activated. As such, his actual usage of Heavenly Energy was not very high, and he managed to fully recover in a short amount of time.\u003c/p\u003e\n\u003cp\u003eDuring the last few days of training, Zhou Weiqing had basically tested and found out the limits of the recovery speed of his Immortal Deity Technique. When he manipulated the energy whirlpools to spin at maximum speeds, it took about an hour for him to fully recover his entire depleted Heavenly Energy pool. This was a truly astonishing speed of recovery. After all, other Heavenly Jewel Masters would normally take two hours or more. This was not even counting the bonus of him being able to lower the Heavenly Energy consumption by drawing from the atmosphere while using.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eAfter both of them had fully recovered their Heavenly Energy, they stood up.\u003c/p\u003e\n\u003cp\u003e“According to the news that we have received, the Kalise Empire’s sentry posts usually change shifts every four hours. It’s almost 11pm [1.子时 - the period from 11pm-1am, in ancient China they counted the time via 时辰 (2 hourly periods) which all had names]. They should be changing shifts in about an hour.” Shangguan Bing’er said.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing thought about it for a bit and said: “Then let’s wait for an hour, and we can move out when they are changing shifts. If we sneak past the obvious sentry post, and launch a sneak attack on the hidden posts, with your Silent Tracking Arrow coupled with my assistance on the side, we should be able to get through without anyone discovering us. We’ll sneak through into their camp, launch a quick salvo of attacks, then retreat straight away.”\u003c/p\u003e\n\u003cp\u003e“Alright, that sounds good.” This would be the first time that the two of them would be truly coordinating together, furthermore it was only the two of them launching the sneak attack. As such, Shangguan Bing’er was rather nervous. Taking a furtive glance at Zhou Weiqing beside her, she found that although this was also his first time, he was clearly a lot calmer than she was, looking extremely steady. Faintly, you could see an evil light occasionally flash in his eyes.\u003c/p\u003e\n\u003cp\u003eUndoubtedly, Zhou Weiqing had gotten many benefits from the black pearl. At the same time, his natural disposition had also been somewhat influenced by the powerful black pearl as well. When he thought of the killing he was about to do, this newbie on the battlefield did not feel any fear or nervousness, instead feeling a sense of excitement.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eOne hour later, two shadowy figures started moving in the dark.\u003c/p\u003e\n\u003cp\u003eIt was relatively easy to avoid the obvious sentry posts; they just needed to move swiftly and silently alongside the boundary between hills and the path, making a detour and circling around the posts, while ensuring they made no noise.\u003c/p\u003e\n\u003cp\u003eAfter they had detoured around two of the obvious sentry posts, Zhou Weiqing suddenly halted, grabbing hold of Shangguan Bing’er and pulling her down in a crouch. “Wait a while.”\u003c/p\u003e\n\u003cp\u003e“En?” Shangguan Bing’er quickly took down the Purple Dawn Bow from her back.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing said in a low tone: “On the left, above 50 yards ahead, there is a hidden sentry post. There are three soldiers there, I’ll sneak there. Once I’m there, you deal with the leftmost one, and I will deal with the remaining two.”\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eSuch excellent senses! \u003c/i\u003eShangguan Bing’er was secretly rather surprised. She had not been able to detect them despite her higher cultivation level, yet Zhou Weiqing had managed to do so. After all, the hillside was filled with thick brush and vegetation, making it rather difficult to spot or discover anything beyond a distance of 30 yards.\u003c/p\u003e\n\u003cp\u003eAfter Zhou Weiqing had told Shangguan Bing’er his plan, he started to circle around the hidden sentry post and approached it silently from the side. At the same time, Shangguan Bing’er moved slowly, vaulting up a tree and moving silently from above the treetops like a green ghost. After leaping across three large trees, she finally managed to get a good vantage position to see the three dark-clothed soldiers in the hidden sentry post.\u003c/p\u003e\n\u003cp\u003eIn order to not make any sound, she took a long time to draw her Purple Dawn Bow, taking aim at the leftmost soldier. Readying herself, she waited for Zhou Weiqing to take action before she did so as well.\u003c/p\u003e\n\u003cp\u003eRight at that moment, she suddenly saw a crouching figure moving at lightning speed, bounding forth like a cheetah and pouncing towards the back of the soldiers in the hidden sentry post.\u003c/p\u003e\n\u003cp\u003eIn that very instance, Shangguan Bing’er felt as if there was somehow a nebulous voice of fate was directing her actions then; the call of destiny. At that moment, she released her bowstring and with a *Swoosh*, the arrow shot out.\u003c/p\u003e\n\u003cp\u003eWith Shangguan Bing’er’s archery skills, adding on the fact that it was a sneak attack in the night, how could an ordinary soldier possibly dodge the arrow. With a light *puff* sound, the arrow slammed into his head, piercing right through the brain. Before the leftmost soldier could give out any cry of alarm, his body moved in a crooked fashion before falling down onto the ground.\u003c/p\u003e\n\u003cp\u003eBy the time the other two soldiers in the hidden sentry post realised that something was wrong, a large hand appeared around their necks respectively. An immense strength was instantly applied, smashing their faces viciously into the soil on the ground, and the sound of their neck vertebra smashing sounded out.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-3-chapter-21-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-3-chapter-21-04\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-3-chapter-21-03","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
