{"id":52019,"no":845,"title":"Chapter 288 - The Saint Land - The Peerless Sect (1)","content":"\u003cp\u003eThe Passion Valley army was not small in number. Huang Xingyun nodded his head towards Gu Yingbing once again and said, “The rest of them have not arrived?”\u003c/p\u003e\n\u003cp\u003eXue Aoying laughed, “The both of you are the first to arrive. Please enter. A resting area has been set up for you. Big brother will come over and greet you personally very soon.”\u003c/p\u003e\n\u003cp\u003eHuang Xingyun shook his head and replied, “It’s ok. This is the Grand Tournament, there is no need for formalities. This should be where the meeting point is, right? I’m guessing they will arrive soon. We will wait here. This year’s Grand Tournament is the most troublesome one out of all the Grand Tournaments we have ever had. It is better to settle it as soon as possible.”\u003c/p\u003e\n\u003cp\u003eXue Aoying did not insist either. He turned to Yingbing and said, “Tell big brother to come over, and that Valley Master Huang and Valley Master Yun have arrived.”\u003c/p\u003e\n\u003cp\u003eGu Yingbing nodded. He turned around and headed into the Heavenly Snow Mountain. Huang Xingyun and Yun Ruoyun led their group of powerhouses to the southern part of the wide platform. Naturally, the Heavenly Snow Mountain’s disciples brought them to their seats and tables. They served some fruits and food that were prepared beforehand.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eEven though the Grand Tournament of Saint Lands was only held once every ten years, the actual process was not that long. These Saint Land powerhouses were not willing to socialize with each other for too long and they also would not make too many stops along the way. After all, amongst the Saint Lands, even though they might seem friendly to one another on the surface, they were guarded against each other at the same time, including Passion Valley and Heaven’s Expanse Palace.\u003c/p\u003e\n\u003cp\u003eApart from the two Valley Masters, the remaining thirty-four powerhouses did not utter a single word upon thier arrival. They only looked very calm, while patiently waiting. It was practically impossible to detect any emotion from them. However, when all thirty-six of them were gathered, they gave off a strong invisible oppressive force, such that even a Heavenly Emperor like Xue Aoying was unwilling to go near them.\u003c/p\u003e\n\u003cp\u003eAfter all, in the previous tournament, Passion Valley only had four Heavenly Emperors. This time, they had six.\u003c/p\u003e\n\u003cp\u003eAt this time, Huang Xingyun suddenly pulled Yun Ruoyun up from her seat and smiled, “Our old friends are here. Tiger King, let’s welcome them.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, the couple headed for the entrance first.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eLooking down from the peak of the mountain, all that could be seen was a shade of white. Only, upon scrutiny, there were actually many white star-like dots leaping towards the summit.\u003c/p\u003e\n\u003cp\u003eTwo gusts of cool breeze appeared and two white figures had already take the lead and gone up. They did not even need to use the mountain wall as an assist - they looked as though they were flying close to the mountain wall. Two tall and straight figures in white floated to the ground. They were none other than the two brothers, Shangguan Tianyang and Shangguan Tianyue.\u003c/p\u003e\n\u003cp\u003eHuang Xingyun laughed heartily and said, “How are you, my brothers, Tianyang and Tianyue?” As he spoke, he walked up to greet them.\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang smiled, “Xingyun, you arrived early. We initially thought we would be the first.”\u003c/p\u003e\n\u003cp\u003eHuang Xingyun smiled, “We arrived not too long ago. Brother Tianyang, you brought a lot of people with you this time!” As he spoke, he shot Shangguan Tianyang a meaningful glance.\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang seemed as though he did not see it, and maintained the smile on his face. “I don’t have a choice. I feel compelled to do so under such a circumstance. How are you, Tiger King?” He finally greeted Xue Aoying.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eXue Aoying was not bothered. After all, the Heaven’s Expanse Palace and the Heavenly Snow Mountain had always been rather hostile to one another, or rather, they had always viewed each other as their biggest opponent. Additionally, he could not be compared to Huang Xingyun of Passion Valley when it came to status.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“Greetings, Palace Master Shangguan. I am still in good health,” Xue Aoying replied in a neutral way.\u003c/p\u003e\n\u003cp\u003eAt this moment, the powerhouses of the Heaven’s Expanse Palace had reached the top of the mountain. What made Xue Aoying secretly startled was that the two Shangguan brothers had brought with them a lot more people this time, compared to the previous tournament. Excluding the two brothers, there were about 108 of them. Furthermore, all 108 of them were at least of the Heavenly King stage. Everyone knew that the Heaven’s Expanse Palace had an ultimate technique called the Boundless Infinitum Technique - the greater the number of people that cast this technique, the greater its power will be. In the previous tournament, Xue Aotian had no way of winning due to this technique, which was led by Shangguan Tianyang, and hence conceded defeat, causing the Heavenly Snow Mountain to be bumped to second place. And at that time, the Shangguan brothers had only brought with them sixty-four people. This time, they had 108 people. Clearly, this was the Heaven’s Expanse Palace’s strongest battle formation.\u003c/p\u003e\n\u003cp\u003eHowever, the Heaven’s Expanse Palace should have one or two more Heavenly Emperor powerhouses who did not tag along for this tournament. Nonetheless, this was understandable as they had to stay behind to guard the Heaven’s Expanse Palace. After all, they had already dispatched their main forces.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang continued to smile, “Tiger King, where is your brother?! All the old friends are here, he should at least come out to greet us.”\u003c/p\u003e\n\u003cp\u003eTiger King’s facial expression changed slightly. Just as she was about to reply, a cold voice was heard, “Since when did the Heavenly Snow Mountain become friends with the Heaven’s Expanse Palace?”\u003c/p\u003e\n\u003cp\u003eEveryone present could sense a strong pressure that abruptly erupted from the summit of the Heavenly Snow Mountain. All the gazes looked over and saw the Heavenly Snow Mountain’s Lord Xue Aotian slowly walking out, with Gu Yingbing accompanying him.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang’s facial expression slightly hardened and the smile on his face faded a little as well. He exchanged glances with Xue Aotian and it seemed to ignite invisible sparks.\u003c/p\u003e\n\u003cp\u003eThey were old rivals. Meeting each other would naturally cause intense hostility to erupt without any reservations.\u003c/p\u003e\n\u003cp\u003eHuang Xingyun and his wife watched from the side. He slowly took half a step closer to Shangguan Tianyang. Clearly, they did share the same hostility against a common enemy. In reality, the Passion Valley had always joined forces with the Heaven’s Expanse Palace to go against the Heavenly Snow Mountain, similar to how the Amber Empire had been joining forces with Zhongtian\u003ca href\u003d\"#_msocom_1\" id\u003d\"_anchor_1\" language\u003d\"JavaScript\" name\u003d\"_msoanchor_1\" onmouseout\u003d\"msoCommentHide(\u0027_com_1\u0027)\" onmouseover\u003d\"msoCommentShow(\u0027_anchor_1\u0027,\u0027_com_1\u0027)\"\u003e[JR1]\u003c/a\u003e and Fei Li Empire to go against the WanShou\u0026nbsp;\u003ca href\u003d\"#_msocom_2\" id\u003d\"_anchor_2\" language\u003d\"JavaScript\" name\u003d\"_msoanchor_2\" onmouseout\u003d\"msoCommentHide(\u0027_com_2\u0027)\" onmouseover\u003d\"msoCommentShow(\u0027_anchor_2\u0027,\u0027_com_2\u0027)\"\u003e[JR2]\u003c/a\u003eEmpire over the past several years.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eXue Aotian was not bothered at all by Huang Xingyun’s gaze - it seemed as though he only had Shangguan Tianyang in his eyes. A killing intent was concealed in that sharp gaze of his - it seemed as though he would launch a world-shattering attack at any moment.\u003c/p\u003e\n\u003cp\u003eShangguan Tianyue also took half a step forward and stood next to Shangguan Tianyang. They still acknowledged Xue Aotian as the world’s strongest powerhouse. If they were to go against him one-on-one, nobody present could be his opponent. They were afraid that the Heavenly Snow Mountain Lord would suddenly launch a full attack against Shangguan Tianyang. If Shangguan Tianyang was unprepared, he would most likely be injured.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang did not back down either - facing Xue Aotian’s glare, he stared back at him, as though he was just an ordinary opponent. However, a faint white light started flashing around his body. This was a sign that the Boundless Infinitum Technique was about to be activated.\u003c/p\u003e\n\u003cp\u003eXue Aotian sneered coldly and said plainly, “After so many years, you still have not made any headway. I am disappointed.”\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, Shangguan Tianyang’s facial expression darkened immediately. Clearly he had hit his sore spot. “So what? The Heaven’s Expanse Palace is still the number one Saint Land. One person’s strength cannot win against the strength of a collective group.”\u003c/p\u003e\n\u003cp\u003eXue Aotian snorted coldly, “You can’t be too sure. We still don’t know which is the number one Saint Land till the end of today.”\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e“Excuse me, would the both of you please listen to what I have to say?” Huang Xingyun took a step forward once again and came between the two piercing gazes that were being exchanged by the leaders of the two Great Saint Lands. However, by doing so, he was put under great pressure. After all, they were the leaders of the two Great Saint Lands! Fortunately, he had the help of his wife, and hence, he was finally able to separate the two hostile forces, that were unwilling to budge, away from each other.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWhen Huang Xingyun sensed the gazes of Shangguan Tianyang and Xue Aotian falling on himself, he continued, “Today is the day in which the Grand Tournament is to be held amongst our five Great Saint Lands. Since it is the Grand Tournament, let us do things by the book. Since the Blood Red Hell and Heavenly Demon Sect have yet to arrive, please calm down. We will have the opportunity to fight each other in a while. Moreover…”\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHuang Xingyun paused for a moment and looked at Xue Aotian before looking at Shangguan Tianyang, who was standing behind him. His face darkened a lot before continuing, “Over the past few years, Dan Dun Empire had become more overbearing and aggressive, and even ended up exterminating the Geritimo Empire. The Blood Red Hell must have been the ones behind this. This time, we have to interrogate them thoroughly.”\u003c/p\u003e\n\u003cp\u003eXue Aotian snorted disdainfully, “The Blood Red Hell is just a contemptible scoundrel. Huang Xingyun, take your excitement back home. Even if the Dan Dun Empire is that powerful, it will not affect the WanShou Empire.”\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang’s facial expression became grave, “Are you trying to say that you are joining forces with the Dan Dun Empire to attack us?”\u003c/p\u003e\n\u003cp\u003eXue Aotian laughed coldly, “Why can’t I do that? The enemy of my enemy is my friend, except that the Blood Red Hell is not qualified to join forces with me. Shangguan Tianyang, don’t think that you are the world’s number one, just because the Heaven’s Expanse Palace controls the Zhongtian Empire. It might be true that the Zhongtian Empire has the most strategic location, but there is nothing around it that could be relied on. If we want to get rid of you, it is an easy feat.”\u003c/p\u003e\n\u003cp\u003eShangguan Tianyang snorted angrily, “Xue Aotian, you old ignorant man. Do you really think that I am afraid of you? Since you claim that I did not make any improvements, I sure want to see how much you have progressed over the past ten years.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, he leapt forward, overtaking Huang Xingyun and thrusted his palm into the air, aiming at Xue Aotian.\u003c/p\u003e\n\u003cp\u003eA milky white palm-shaped energy force appeared. When it first emerged, it was the same size as an ordinary palm. However, it rapidly increased in size. By the time it was in front of Xue Aotian, it was already one meter in diameter. Even though there was not a single leakage of energy, everyone knew how terrifying it was.\u003c/p\u003e\n\u003cp\u003eIf Shangguan Tianyang was not wearing the Boundless Infinitum Set, he could never go against Xue Aotian. However, if he was equipped with it, he would have the power to challenge a Heavenly God. Otherwise, it would be impossible for the Heaven’s Expanse Palace to defeat the Heavenly Snow Mountain with their collective forces alone.\u003c/p\u003e\n\u003cp\u003eXue Aotian similarly snorted coldly. He did not retreat - he thrusted his right fist. Everyone present could clearly see that the fist that he threw was completely gold in color.\u0026nbsp;\u003c/p\u003e\n\u003cdiv id\u003d\"_com_1\" language\u003d\"JavaScript\" onmouseout\u003d\"msoCommentHide(\u0027_com_1\u0027)\" onmouseover\u003d\"msoCommentShow(\u0027_anchor_1\u0027,\u0027_com_1\u0027)\"\u003e\n \u003cp\u003e\u003ca href\u003d\"#_msoanchor_1\"\u003e[JR1]\u003c/a\u003eI’ll do my best with names like these but sometimes i get confused on whether it should be together or not. Sorry in advanced if i make a mistake.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id\u003d\"_com_2\" language\u003d\"JavaScript\" onmouseout\u003d\"msoCommentHide(\u0027_com_2\u0027)\" onmouseover\u003d\"msoCommentShow(\u0027_anchor_2\u0027,\u0027_com_2\u0027)\"\u003e\n \u003cp\u003e\u003ca href\u003d\"#_msoanchor_2\"\u003e[JR2]\u003c/a\u003eI googled this and it’s WanShou. 1 word but capital S. Is that like a style?\u003c/p\u003e\n\u003c/div\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-28-chapter-287-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-28-chapter-288-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-28-chapter-288-1","bookId":1503,"creation":"Sep 10, 2019 4:32:14 AM","modification":"Sep 10, 2019 4:32:14 AM"}
