{"id":51266,"no":92,"title":"Chapter 23 Demonic Change (4)","content":"\u003cp\u003e\u003cb\u003eChapter 23 Demonic Change (4)\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAs the heavy breathing gradually returned to normal, Zhou Weiqing’s body also started to get warmer, and the arms embracing Shangguan Bing\u0027er also began to relax a little, as his grip lessened.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, Shangguan Bing\u0027er froze. She felt something hard… large… and erect… pressing into her lower abdomen, even twitching a little. [1. ( ͡° ͜ʖ ͡°)]\u003c/p\u003e\n\u003cp\u003eAfter a short bout of surprise, Shangguan Bing\u0027er realised what it was, but she dared not move, as she did not know if Zhou Little Fatty was still in the clutches of the Demonic Change, or if he had broken free yet.\u003c/p\u003e\n\u003cp\u003eHer body started to heat up gradually, both her arms which were embracing Zhou Weiqing were starting to shiver.\u003c/p\u003e\n\u003cp\u003eShe was a little afraid, afraid that a sudden bestial [2. ( ͡° ͜ʖ ͡°)] nature would overtake him once again, that evening she had lost herself for the first time was forever etched in her mind and she couldn’t help but ask herself. \u003ci\u003eWhat would I do if that happened again? What can I do?\u003c/i\u003e At present, Shangguan Bing\u0027er found that regarding this question, she herself simply did not have any ready answer.\u003c/p\u003e\n\u003cp\u003eWhat Shangguan Bing\u0027er could not see was that Zhou Weiqing was at this time blinking his eyes rapidly, a very strange look on his face.\u003c/p\u003e\n\u003cp\u003eIn truth, when Zhou Weiqing fell into the Demonic Change State, he had lost control of his mind for only a very short period of time. During that period, whatever that was happening outside had actually been imprinted into his mind as well, but when he started the slaughter of the Forest Direwolves, he had actually awakened somewhat. However, at that point, he was still unable to control his own body, and could only watch himself unceasingly indulge in slaughter and Devouring.\u003c/p\u003e\n\u003cp\u003eHe could only observe the attribute wheel sparkling in its grey area continuously; on one hand he was trying to comprehend the mysteries of the Evil Attribute, while on the other hand he was diligently trying to regain control of his own body.\u003c/p\u003e\n\u003cp\u003eIt was only at the point when he dealt the finishing blow and killed off the Direwolf King, and \u0026nbsp;his body flew back horizontally, when he had finally recaptured some measure of control over his own body from that instinct of endless slaughter. Without hesitation, he had thrown towards Shangguan Bing\u0027er, grabbing hold of her, and using her tourmaline aura and the link she had with him to aid him in resuming complete control of his body quickly.\u003c/p\u003e\n\u003cp\u003eAs such, Zhou Weiqing had actually woken up into a clear state of mind for quite a while, and since Shangguan Bing\u0027er had started to hug him unceasingly in order to help, their bodies were tightly pressed together and with much friction between them, how could he not have a reaction! At this time he could only feel the lower part of his body rubbing against Shangguan Bing\u0027er’s smooth and soft lower abdomen unceasingly, such a pleasant sensation it was causing him to feel, a feeling like he couldn’t ‘control himself’. Alas, at this time, this little rascal couldn’t bear to give up the beautiful maiden in his arms, such an opportunity to embrace each other was definitely a rare one!\u003c/p\u003e\n\u003cp\u003eAs Zhou Weiqing struggled with his inner conflict, all of a sudden, his body shivered violently, and he could feel the previously tranquil Heavenly Energy in his body suddenly explode forth like a volcano. The black-grey aura surrounding his body vanished, but the green lights were becoming stronger and more powerful, and the restlessly moving Heavenly Energy ignited in his body, causing him to feel as if his internal organs were being twisted all over the place.\u003c/p\u003e\n\u003cp\u003eWith a “Waah” sound, Zhou Weiqing vomited out a whole mouthful blood, as his \u0027little brother\u0027 subsided rapidly, he quickly loosen his hold around Shangguan Bing\u0027er, falling back and down, sitting on the ground.\u003c/p\u003e\n\u003cp\u003e“Little Fatty, how are you?” Shangguan Bing\u0027er was naturally extremely surprised, he seemed better just a moment ago, yet now this was happening… Was it a side effect from the Demonic Change?\u003c/p\u003e\n\u003cp\u003eZhou Weiqing quickly waved to Shangguan Bing\u0027er, saying: “I need to breakthrough the next Death Acupuncture Point.” After he said those words with great difficulty, he immediately closed his eyes and sank into deep concentration.\u003c/p\u003e\n\u003cp\u003eIt was very obvious that the sudden change in his body was the result of him having Devoured so much Wind Attribute Heavenly Energy from the Forest Direwolves. Although his own Heavenly Energy also contained the Wind Attribute, but he was a human, and unlike Heavenly Beasts, even if he had the black pearl’s power to back him up, having Devoured so much of the Wind Attribute Heavenly Energy, it was not something that his present Dantian could withstand. Previously, due to the Demonic Change, the huge amount of Heavenly Energy was suppressed, and was even able to forcibly make use of it as his own. Alas, now that the Demonic Change had ended, he immediately started having problems suppressing this sheer power.\u003c/p\u003e\n\u003cp\u003eThe Wind Attribute Heavenly Energy Devoured externally, and Zhou Weiqing own Heavenly Energy were rather incompatible, and although the four energy whirlpools for his open Death Acupuncture Points were spinning at top speed to integrate the external Heavenly Energies unceasingly, but it was much too slow and definitely not sufficient to tide him through this dangerous period now. The only solution he had now was to make use of this external power to break through a Death Acupuncture Point; if he succeeded, the situation would naturally can be solved.\u003c/p\u003e\n\u003cp\u003eThe Devour Skill that the black pearl had given Zhou Weiqing seemed to be only targeted towards Heavenly Beasts in this world, and did not work on humans. This was the reason why previously when Zhou Weiqing had issued forth the immense tiger\u0027s roar, Shangguan Bing\u0027er was not affected. However, Devour had its other limits as well, the stronger he was, the ability and capacity to support more Devoured energy would grow as well. Alas, Zhou Weiqing’s present strength was just too weak, but when he was under the Demonic Change State, he was being controlled by the instinct and need for slaughter, and naturally went about recklessly Devouring external Energy. At this point, his body contained too much excessive Wind Attribute Heavenly Energy, and if he did not deal with it promptly, many problems would occur, and in a worst case scenario, he could even implode internally and die from the excess energies.\u003c/p\u003e\n\u003cp\u003e“I’ll keep watch for you.” When Shangguan Bing\u0027er heard that Zhou Weiqing needed to break through his next Death Acupuncture Point, she unhesitatingly vaulted up and stood behind him. At this moment, what Zhou Weiqing needed most was her support, as he would no longer be able to defend himself if any other Heavenly Beasts came.\u003c/p\u003e\n\u003cp\u003eFocusing his will, Zhou Weiqing controlled the restless Wind Attribute Heavenly Energy and merging it with his own Heavenly Energy to circulate and move at crazy speeds towards his lower limbs. Presently, his own Heavenly Energy had risen by a substantial amount after exiting from the Demonic Change, and was obviously transformed from all the Wind Attribute Heavenly Energy he had Devoured. Alas, the current problem was he had Devoured too much Wind Attribute Heavenly Energy, and if he did not deal with it, they would revolt.\u003c/p\u003e\n\u003cp\u003eZhou Weiqing\u0027s personal Heavenly Energy was actually very pure, but the various Forest Direwolves’ Wind Attribute Heavenly Energy was rather mixed and different. After all, each different Forest Direwolf had a different cultivation level, and having all the dozens of different energies mixing together, especially that final bout Devoured from the Direwolf King, these energies had been running amok in his body, making him feel miserable beyond words.\u003c/p\u003e\n\u003cp\u003eAs he circulated the Heavenly Energy downwards, Zhou Weiqing could feel as though the meridian passages in his thigh area were being split apart, and in a split second, the mixed Heavenly Energy had rushed towards his Zhu San Li Death Acupuncture Point. As the Zhu San Li Death Acupuncture Point whirled with the circulated Energies, Zhou Weiqing swiftly followed the Immortal Deity Technique to manipulate both bouts of Heavenly Energy continuously downwards.\u003c/p\u003e\n\u003cp\u003eThe human body was indeed something of mystery and beauty. The same Cultivation Technique being practiced by a different person could produce a possibly vastly different results. Furthermore, it could be said that this Immortal Deity Technique was somewhat a one-of-a-kind Technique, thus he was only able to attempt it by himself.\u003c/p\u003e\n\u003cp\u003eIt seemed that Lady Luck was on his side, and as the mixed Wind Attribute Heavenly Energy charge through the Zhu San Li Death Acupuncture Point, the energy whirlpool revolving cyclone revolving sped up to three times its previous peak speed. As the mixed Energies overran the Point, it was as if they had gone through a filter, coming out obviously in a purer state.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-4-chapter-23-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heavenly-jewel-change/hjc-book-4-chapter-23-05\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heavenly-jewel-change/hjc-book-4-chapter-23-04","bookId":1503,"creation":"Sep 10, 2019 4:32:13 AM","modification":"Sep 10, 2019 4:32:13 AM"}
