{"id":85826,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMy cursor hovers over ACCEPT. IH8RA. It’s an acronym. I contemplate it, even though I could just click the link and the mystery would be solved. But that’s no fun, and I’m smart enough to figure this out and—honestly—I’ve got nothing better to do with my time. My brain works to put the pieces together.\u003c/p\u003e\n\u003cp\u003eI H 8 R A. IH8RA. IH8RA. IH8. I H8. I hate. IH8 RA. I hate RA.\u003c/p\u003e\n\u003cp\u003eRA.\u003c/p\u003e\n\u003cp\u003eRegina Afton.\u003c/p\u003e\n\u003cp\u003eI Hate Regina Afton.\u003c/p\u003e\n\u003cp\u003eYou have been invited to join the I Hate Regina Afton group on YourSpaceTM!\u003c/p\u003e\n\u003cp\u003eI throw up .\u003c/p\u003e\n\u003cp\u003eI’m hunched over the toilet watching dinner come up, and my mind is doing this the whole time: It might not have anything to do with you it could mean anything you haven’t even seen the page yet how do you know it’s about you it could be a promo for some band it might not have anything to do with you how do you know it’s about you.\u003c/p\u003e\n\u003cp\u003eKnock-knock on the bathroom door.\u003c/p\u003e\n\u003cp\u003e“Are you sick, Regina?” Mom.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eI wipe my mouth and flush the toilet.\u003c/p\u003e\n\u003cp\u003e“I’m okay. It’s nothing.”\u003c/p\u003e\n\u003cp\u003e“Let me know if you need anything?”\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eBut for a second, I think I do need her. “Mom…” She’s gone.\u003c/p\u003e\n\u003cp\u003eI run the tap as cold as it will go and splash my face. The computer hums in the next room, waiting for me, and I don’t have what I need to have inside me to go back in there and click the link. Courage.\u003c/p\u003e\n\u003cp\u003eBut that’s not going to stop me from doing it anyway. Psychedelic-colored shapes float across the monitor’s face. Screen saver. I jiggle the mouse, and the YourSpace page pops up. I stare at my choices: ACCEPT. REJECT. I choose neither. I click the blue link to take me to the group’s page to see what it’s about, because even though I know what it’s about, some small part of me hopes I’m wrong. The page loads.\u003c/p\u003e\n\u003cp\u003eI fall back into the chair. The soft sounds of the television in the living room drift in, and then other sounds follow: Dad rocking in his recliner. Mom washing dishes in the kitchen. I can hear the clinking of glass in the sink. A day off. A fan whirs next to me, raising warm air. It’s all so quiet and so family and it’s so perfect, and I have to share it with this—a page as red as my locker.\u003c/p\u003e\n\u003cp\u003eIn the upper right-hand corner of it is a picture of me. I minimize the screen, horrified, before pulling it up again. It’s not a nice picture. It wouldn’t be. I’m staring at the camera through half lids, caught in midblink. I look stoned. My mouth is lax, and my hair is sticking out at all ends. I’m not stoned. Anna woke me with the camera at a sleepover, and twenty-four hours later she had prints. It’s hideous.\u003c/p\u003e\n\u003cp\u003eThe entire world can look at it, and they can see me hideous.\u003c/p\u003e\n\u003cp\u003eTHIS IS A GROUP FOR PEOPLE WHO HATE REGINA AFTON. DO YOU HATE REGINA AFTON? FRIEND US AND LEAVE A COMMENT!!\u003c/p\u003e\n\u003cp\u003eI scroll down. The group has only one interest listed—hating me. Anna heads up the featured friends, followed by Josh— And Kara and Marta and Jeanette and—\u003c/p\u003e\n\u003cp\u003eIH8RA has 300 friends in total. There are only 450 students at Hallowell High. The remaining 150 either don’t have a YourSpace account or they haven’t checked their e-mail yet. I click through the page slowly, checking out avatars, recognizing faces. So many people. Some I’ve spoken to, others I’ve never spoken to. Some I loathe, others I’ve never spared a second thought. A few I considered acquaintances. They’re all here, all tied together by their apparent hatred of me.\u003c/p\u003e\n\u003cp\u003eI navigate back to the main page, to the comments.\u003c/p\u003e\n\u003cp\u003eYOU ARE VIEWING THE MOST RECENT OF 202 COMMENTS.\u003c/p\u003e\n\u003cp\u003eI shouldn’t read them. I have to read them.\u003c/p\u003e\n\u003cp\u003ei fuckin hate that bitch.\u003c/p\u003e\n\u003cp\u003eThe first—and latest—comment belongs to Jake Martin, some sophomore I’ve never really given a damn about. I thought he felt the same about me, but I guess not.\u003c/p\u003e\n\u003cp\u003eI guess he fuckin hates me.\u003c/p\u003e\n\u003cp\u003eTeam Anna! :)\u003c/p\u003e\n\u003cp\u003eKara, Jeanette, and Marta leave this comment several times, smiley face and all. Team Anna.\u003c/p\u003e\n\u003cp\u003eThnx for the add.\u003c/p\u003e\n\u003cp\u003eMy less-astute classmates leave this comment. The ones who add anyone and everything and drop a little thank-you note before moving on to the next one, because that’s social networking for you. They don’t get it.\u003c/p\u003e\n\u003cp\u003eOr maybe they get it and they just don’t care.\u003c/p\u003e\n\u003cp\u003eslut whore tramp keep trying with those sweaters, regina! they can’t hide what a slut u r loose slut whore slut\u003c/p\u003e\n\u003cp\u003ei fucking hate that bitch slut thnx for the add\u003c/p\u003e\n\u003cp\u003eTeam Anna! :)\u003c/p\u003e\n\u003cp\u003eThe same things over and over again. Each comment taking a cue from the last, each one a sharp jab at me. After a while, I even start feeling bruised. I scroll all the way down to the bottom of the page, and a link catches my eye:\u003c/p\u003e\n\u003cp\u003eREPORT ABUSE\u003c/p\u003e\n\u003cp\u003eMy cursor hovers over it. Click it. Click it. Report abuse. Easy: Dear YourSpace, I’d like to report abuse. My friends are abusing me.\u003c/p\u003e\n\u003cp\u003eREPORT ABUSE\u003c/p\u003e\n\u003cp\u003eI refresh the page, and the friend count has jumped. 302. So have the comments. 203. I refresh again and the comments jump again. 204. I straighten. People hate me and they’re online right now, hating me. I want to know who they are and I want to know what they’ll say. I have to know, so when I step into school tomorrow I’ll have every comment tied to a face, so when I see those faces in the halls–I’ll know.\u003c/p\u003e\n\u003cp\u003eI refresh the page.\u003c/p\u003e\n\u003cp\u003eThe buzz of my alarm clock jolts me awake. My mouth is parched and there’s a crick in my neck. It takes me a minute to remember why I’m not in bed. I fell asleep in front of the computer. The last time I looked at the YourSpace page, it was 6:00 a.m. Now it’s a quarter after eight.\u003c/p\u003e\n\u003cp\u003eForget coffee; I barely have time to get dressed, brush my teeth and hair. It isn’t until I’m racing across the parking lot that I realize how stupid this is: I’m rushing to get to school. When I reach the front doors, I hit a wall. I can’t step inside. I have one hand on the door handle, and it’s like I’m paralyzed. My mind tells my hand to open the door, but my hand won’t do it. My insides are made up of millions of feral butterflies gnawing at every bit of peace inside of me until there’s none. I can’t open this door.\u003c/p\u003e\n\u003cp\u003e“Fucking move,” someone mutters behind me. When I don’t, they shove me out of the way. It’s “Thnx for the Add.” Nora Green. She glares at me, opens the door, and steps inside. I follow her in before it swings shut in my face.\u003c/p\u003e\n\u003cp\u003eI’m ten steps in when “Slut,”\u003c/p\u003e\n\u003cp\u003e“Whore,” and “Loose” walk by. Jeri Waters, Elliott Pike, Mary Schwartz. “I fuckin hate that bitch” is talking to Gary Doyle at Gary’s locker. I start to shake. They both look me up and down when I pass.\u003c/p\u003e\n\u003cp\u003eDonnie is crossing the hall. I don’t notice him until it’s too late.\u003c/p\u003e\n\u003cp\u003eWe slam into each other and stumble backward. He looks as bad as me, maybe worse. Unshaven, dirty, disgusting, wrecked. It’s only been a week.\u003c/p\u003e\n\u003cp\u003eHe glares at me and then he gets close, so close his mouth is inches from mine. I’m afraid he’s going to do something like he did at Josh’s party, and I wonder if anyone would do anything about it if he did, because they all hate me.\u003c/p\u003e\n\u003cp\u003e“Die,” he says, and then he walks away. I close my eyes, trying to keep it together, and when I open them, Michael is halfway down the hall, at the water fountain, watching me.\u003c/p\u003e\n\u003cp\u003eI head for my locker, where my lock refuses me. I try it over and over and over again and nothing happens. So I kick it.\u003c/p\u003e\n\u003cp\u003e“What’s the problem?”\u003c/p\u003e\n\u003cp\u003eMichael. Behind me. I point at the lock. “I can’t get it open.” I swallow hard. “It won’t open.”\u003c/p\u003e\n\u003cp\u003eI must look really pathetic, because he nudges me aside gently and grabs the lock. I can smell his aftershave. Sort of earthy and clean at the same time. I take a step back because I don’t want to be this close to him.\u003c/p\u003e\n\u003cp\u003e“What’s your combination?” he asks.\u003c/p\u003e\n\u003cp\u003e“Uh…” Never tell anyone your locker combination. Ninth-grade orientation. It was the first thing they told us, but who follows the rules? “Twelve, twenty, thirty-two, and two…”\u003c/p\u003e\n\u003cp\u003eI watch his thumb spin the dial slowly, each number hitting its mark like I swear to God my thumb did. I rest my head against the locker.\u003c/p\u003e\n\u003cp\u003e“Maybe you should sit with me at lunch,” he says after a minute. “Maybe it’s safer that way….”\u003c/p\u003e\n\u003cp\u003e“I didn’t tell you about Donnie so you’d feel sorry for me.”\u003c/p\u003e\n\u003cp\u003e“Your call.” He gives the lock a jerk. It breaks free. Miracle. “There you go.”\u003c/p\u003e\n\u003cp\u003eWhen I raise my head to thank him, he’s gone.\u003c/p\u003e\n\u003cp\u003e“I told them to set up the net,” Nelson mutters, surveying the gym .\u003c/p\u003e\n\u003cp\u003e“Where. Is. It?”\u003c/p\u003e\n\u003cp\u003eI don’t know who “they” are, but I’d hate to be them when they run into Nelson later. Red creeps up her neck to her face: She’s ready to blow. I overheard someone say her name and the word hangover in the same sentence earlier, and I think it might be true, because she hasn’t touched her whistle.\u003c/p\u003e\n\u003cp\u003e“Morrison!” she barks. “Afton! Go get the volleyball net out of the storage room, and the rest of you, get out there and jog until I tell you to stop!”\u003c/p\u003e\n\u003cp\u003eNo one moves. Everyone’s holding their breath. It’s so quiet I can hear the vein pulsing in Nelson’s forehead. Morrison as in Anna. Afton as in me. The net in storage. Morrison! Afton! Go get the volleyball net out of storage. Together.\u003c/p\u003e\n\u003cp\u003e“What’s the matter with you people? Didn’t you hear me?” Nelson winces at the sound of her own voice. “Move! Morrison, Afton, don’t make me tell you twice!”\u003c/p\u003e\n\u003cp\u003e“Ms. Nelson,” Anna whines from her spot beside Kara and Josh, “can’t Kara come with me instead?”\u003c/p\u003e\n\u003cp\u003eI glance at Michael. He’s across the gym standing near some guys, not quite a part of their group but definitely a part of the scene. He rolls his eyes, bored.\u003c/p\u003e\n\u003cp\u003eMuttering. The people around us are muttering. Nelson takes several deep breaths in and out, like Anna’s just asked her the stupidest question in the world.\u003c/p\u003e\n\u003cp\u003e“Morrison,” she repeats, “and Afton. Get. The. Net.”\u003c/p\u003e\n\u003cp\u003eShe jerks her thumb at the door. Anna’s not dumb enough to tempt fate twice. Josh squeezes her shoulder sympathetically. Anna gives a horsey shake of her head, turns to Kara, mutters something bitchy, and walks across the room like she’s on a catwalk, leaving me to chase after her. \u003c/p\u003e","sourceLink":"https://allnovel.net/some-girls-are/page-10.html","bookId":1896,"creation":"Oct 5, 2019 5:10:01 PM","modification":"Oct 5, 2019 5:10:01 PM"}
