{"id":85836,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt’s dark.\u003c/p\u003e\n\u003cp\u003e“Anna?”\u003c/p\u003e\n\u003cp\u003eI take two steps forward and grope for the light overhead. My fingers find the bulb when something moves behind me. Anna. I turn. Not Anna. Kara. I rush the door, my shoulder connecting with it painfully, and I grab the doorknob just as she gives it a sharp jerk toward her, and then it’s closed. The lock clicks into place.\u003c/p\u003e\n\u003cp\u003e“Kara, don’t—Kara!” She’s locked me in. I pound on the door. “Kara, I swear to God, let me out or I’ll—”\u003c/p\u003e\n\u003cp\u003e“Or you’ll what?”\u003c/p\u003e\n\u003cp\u003e“Kara.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought,” she says, laughing.\u003c/p\u003e\n\u003cp\u003eSet up. Set up by her again. I kick the door as hard as I can, choking back a scream until I realize screaming is exactly what I should be doing.\u003c/p\u003e\n\u003cp\u003e“Somebody let me out! Is there anyone out there? LET ME OUT!”\u003c/p\u003e\n\u003cp\u003eNothing. Everyone’s in the cafeteria. I’ll be stuck in here for at least thirty minutes before someone walks by. If someone walks by.\u003c/p\u003e\n\u003cp\u003eI need light.\u003c/p\u003e\n\u003cp\u003eI go back to fumbling for the chain and give it a yank. The feeble wattage sends a dull glow around the immediate area but leaves most of the room to the shadows. I wait and I wait, and when the lunch bell rings, I yell as loudly as I can, but no one comes.\u003c/p\u003e\n\u003cp\u003eNo one comes, even though I can hear them all just outside the door.\u003c/p\u003e\n\u003cp\u003eI’m sitting behind shelves of poster board with my back against the wall. It’s been an hour. Maybe two. Every time I hear the slightest noise, I tense, preparing to be found. It never happens. I pick at my jeans, waiting. I have to go to the bathroom. I think I’m edging up on hour three when the door finally opens. I scramble to my feet, but the ensuing grunting and scuffling sounds hold me back and keep me from revealing myself.\u003c/p\u003e\n\u003cp\u003e“Fuck off! Get the—”\u003c/p\u003e\n\u003cp\u003e“Get his cell phone.”\u003c/p\u003e\n\u003cp\u003e“Get the fuck off me!”\u003c/p\u003e\n\u003cp\u003e“Easy. Don’t make this harder than it has to be.”\u003c/p\u003e\n\u003cp\u003e” Fuck off!”\u003c/p\u003e\n\u003cp\u003eI peer around the shelves. Bruce gives Donnie a hard shove, sending him to the floor. He eats ground and his eyes are on my feet. I don’t know if he’s seeing me. I can make out Josh in the doorway. Henry.\u003c/p\u003e\n\u003cp\u003e“Got his cell phone?” Bruce asks.\u003c/p\u003e\n\u003cp\u003eJosh holds it up.\u003c/p\u003e\n\u003cp\u003e“Okay, let’s go.”\u003c/p\u003e\n\u003cp\u003eNo. Josh and Henry leave. No. Donnie tries to grope his way to his feet, but Bruce gives him a sharp kick in the ribs and he stays down. They don’t know I’m here. They can’t know I’m here. That would be too fucked up, even for us.\u003c/p\u003e\n\u003cp\u003eI stumble out from behind the shelf. Bruce isn’t surprised to see me. “Oh, good,” he says.\u003c/p\u003e\n\u003cp\u003eOh my God. My heart sputters and dies. “Don’t—Bruce—”\u003c/p\u003e\n\u003cp\u003e“Have fun, kids.”\u003c/p\u003e\n\u003cp\u003eI lunge for him and trip over Donnie in the process. I sprawl across the floor, my feet all tangled up in him. He swears at me and pushes at my legs, groaning. I get to my feet and crawl to the door just as it closes. Not this. Not this. I press my palms against the door, trying to catch my breath—I can’t breathe—while Donnie gets to his feet.\u003c/p\u003e\n\u003cp\u003eNot this.\u003c/p\u003e\n\u003cp\u003eBruce, Josh, and Henry laugh themselves down the hall. I curl my fingers against the door. His hand up my skirt. Mouth on my neck. Not happening. Not happening.\u003c/p\u003e\n\u003cp\u003eNot happening not happening not happening.\u003c/p\u003e\n\u003cp\u003e“Are you ever going to turn around, Afton?”\u003c/p\u003e\n\u003cp\u003eI need to run. I need to get up. Get up. Get up. I grab the doorknob and pull myself to my feet. I need out.\u003c/p\u003e\n\u003cp\u003e“If you touch me, I’ll scream.”\u003c/p\u003e\n\u003cp\u003e“Who would hear you?”\u003c/p\u003e\n\u003cp\u003eI turn. Donnie hovers at the edge of the light. A shadow falls across his face, adding a disturbing quality to his already grim exterior. Anna must love how badly he wears being an outcast. Or maybe he just looks this bad because he’s sober.\u003c/p\u003e\n\u003cp\u003eI hope.\u003c/p\u003e\n\u003cp\u003eHe moves in my direction. I shudder, feel my throat hitch. His hand up my skirt. He was on me. Kara knew what he did to me, she knew. I go back to the door, pounding it with my fists until they hurt. A voice inside my head tells me to scream, scream, scream now, scream loud, louder, and I keep thinking I am I’m trying I’m screaming.\u003c/p\u003e\n\u003cp\u003eBut nothing is coming out of my mouth.\u003c/p\u003e\n\u003cp\u003eHis hand is on my arms. He’s behind me. Close. I jerk away and I do it too easily, which means he let me do it. He let me. He’s fucking with me.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to touch me,” I say, backing away. I put a shelf between us. His footsteps are terrible and light, and I count them getting closer.\u003c/p\u003e\n\u003cp\u003eOne. Two. Three.\u003c/p\u003e\n\u003cp\u003e“You never thought I was good enough,” he says. Four. Five. Five footsteps. “And you couldn’t just let me have Anna. You loved to tell her I wasn’t good enough for her either, all the time. Every single day.”\u003c/p\u003e\n\u003cp\u003eI take five steps back, around the same shelf, past the useless locked door. I look around the room for something I can use. Paper. Poster board. I need something heavy.\u003c/p\u003e\n\u003cp\u003eSomething.\u003c/p\u003e\n\u003cp\u003e“Everyone hates me because of you,” he says, quickening his pace. One-two-three. I step back one-two-three. “I’m not on the basketball team because of you. I get my ass kicked and locked in closets because of you—”\u003c/p\u003e\n\u003cp\u003eI grab a stack of paper. He bursts out laughing when he sees it and takes a quick step forward and back, faking me out. I stumble back, clutching the paper, and then he lunges at me for real and I throw it. Paper blizzard. It distracts him long enough for me to get to the other side of the shelf. All I have to do is keep this shelf between us for as long as we’re in here, and we can’t be in here together that much longer because these things don’t happen twice—where you need help and no one comes.\u003c/p\u003e\n\u003cp\u003e“Why the fuck would you tell Kara?” Donnie kicks at the paper. I flinch and he answers his own question. “Oh, right—it’s because you’re a fucking bitch, that’s why.”\u003c/p\u003e\n\u003cp\u003eHe shoves his hands between the free spaces in the shelves, reaching for me.\u003c/p\u003e\n\u003cp\u003e“Stop,” I beg. “Please—”\u003c/p\u003e\n\u003cp\u003e“Why?” He rounds the shelf, grinning. “What have I got to lose?” I back into the shelf, and its hard metal edge against my spine startles me forward. It’s a split-second advantage and it’s all Donnie needs. He grabs at me, just missing my arms. His fingers curl around my shirt. I hear the material give, tearing at the seam, up the side. My legs give.\u003c/p\u003e\n\u003cp\u003eHe bends down and breathes on my neck.\u003c/p\u003e\n\u003cp\u003e“Don’t,” I whisper.\u003c/p\u003e\n\u003cp\u003e“Don’t,” he repeats in my ear. He puts his hand on my shoulder. I cover my mouth. He slips his hand past the collar of my shirt. I choke back a sob and try to crawl away from him, but he pulls me back. Hands on me. Touching me.\u003c/p\u003e\n\u003cp\u003eI throw up.\u003c/p\u003e\n\u003cp\u003e“Jesus,” Donnie hisses, scrambling back. I scramble around the puddle of vomit, get myself up, and stumble toward the door. Open. Open. Open open open.\u003c/p\u003e\n\u003cp\u003eIt opens.\u003c/p\u003e\n\u003cp\u003eLiz Cooper.\u003c/p\u003e\n\u003cp\u003eI shove past her before she can get a good look at my face. It’s cold in the hall and I’m shaking and I wrap my arms around myself but I can’t stop. Shaking.\u003c/p\u003e\n\u003cp\u003e“What were you two doing in there?” she demands.\u003c/p\u003e\n\u003cp\u003e“What do you think?” Donnie asks.\u003c/p\u003e\n\u003cp\u003eLiar. Liar. But why bother saying it. No one believed me the first time. I keep moving. Away. I can’t see. I try to blink the school into focus, but I can’t. I try not to panic. I don’t need to see to get out of here. I press my hand against the wall and feel my way down the empty hall. I swallow air until I’m so full of it, I think I’ll explode.\u003c/p\u003e\n\u003cp\u003eI’ll explode and I’ll be over and I’ll be done and that will be okay.\u003c/p\u003e\n\u003cp\u003eI stop and try to guess where I’m supposed to be. I must have a class, but I don’t know what period it is. The bell rings. I find myself elbowed and shouldered down the hall with the type of zeal only reserved for the end of the day. It’s the end of the day.\u003c/p\u003e\n\u003cp\u003eGood. God.\u003c/p\u003e\n\u003cp\u003eI edge my way out of the herd, into a free space.\u003c/p\u003e\n\u003cp\u003eRight behind Kara.\u003c/p\u003e\n\u003cp\u003eWho is giggling with Jeanette.\u003c/p\u003e\n\u003cp\u003e“I’m going to kill you.”\u003c/p\u003e\n\u003cp\u003eThe words fall off my lips, stunned and stupid sounding, but so true. I’ll kill her. At some point, I will kill her. All of this has to be leading up to a moment where I wrap my hands around her neck and squeeze.\u003c/p\u003e\n\u003cp\u003eShe registers me slowly. “How did you get out?”\u003c/p\u003e\n\u003cp\u003e“You’re dead.”\u003c/p\u003e\n\u003cp\u003eI want it to sound strong coming out of my mouth. I want her to know it’s true; she’s dead. But Kara only stares and Jeanette stares and I feel like I’m going to throw up again, so I force myself back into the elbows and shoulders and hope they push me out of here, because I have to get out of here.\u003c/p\u003e\n\u003cp\u003eAn arm yanks me back.\u003c/p\u003e\n\u003cp\u003e“Who the fuck let you out? Where’s Henderson?”\u003c/p\u003e\n\u003cp\u003eBruce. I jerk my arm from his grasp and shove him, but his solid frame doesn’t budge. He just stares at me, amused, which makes me even angrier. Josh stands beside him, and I know I could shove him and he’d feel it, so I do. I press my palms into his chest and push the fuck out of my ex-boyfriend. He staggers back.\u003c/p\u003e\n\u003cp\u003eBruce grabs me again. “What’s wrong with you, Afton?”\u003c/p\u003e\n\u003cp\u003e“Get off me.”\u003c/p\u003e\n\u003cp\u003eHe grins. “Apologize.”\u003c/p\u003e\n\u003cp\u003e“Get the fuck off me!”\u003c/p\u003e\n\u003cp\u003eI shout it loudly enough for everyone to stop what they’re doing and look, but no one does anything because it’s only me and– Everyone. Hates. Me. Bruce doesn’t let me go. I start pushing at him, these small stupid sounds coming out of my mouth, but no words. I’m going to cry and I need to leave before that happens.\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003eBruce drops my hand and focuses on someone behind me. Michael. I rub my wrist and start moving away because I don’t want him to see me. I don’t want to see him.\u003c/p\u003e\n\u003cp\u003e“Why do you care?” Bruce asks.\u003c/p\u003e\n\u003cp\u003eMichael ignores him. “Regina, are you okay?”\u003c/p\u003e\n\u003cp\u003eI never answer. I’m already past rows and rows of orange lockers, past familiar blond curls and a flash of red, until the front doors are in sight, and I think I hear my name again but it’s behind me and I am never going back. \u003c/p\u003e","sourceLink":"https://allnovel.net/some-girls-are/page-20.html","bookId":1896,"creation":"Oct 5, 2019 5:10:01 PM","modification":"Oct 5, 2019 5:10:01 PM"}
