{"id":85819,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eFriday never happened.\u003c/p\u003e\n\u003cp\u003eI wipe a light sheen of sweat from my forehead. Anna, Kara, Jeanette, and Marta usually wait for me at the front so we can enter school the Fearsome Fivesome. It’s the only part of the day I sort of like, standing next to Anna, untouchable.\u003c/p\u003e\n\u003cp\u003eEveryone is afraid of us.\u003c/p\u003e\n\u003cp\u003eToday, they’re nowhere to be found.\u003c/p\u003e\n\u003cp\u003eI scope out the parking lot just in time to see a black convertible pull in. Donnie. My stomach twists and I can’t breathe. I feel wrong in all the wrong places. I have to get inside. Now. I navigate the cacophony of voices, drug deals and insults—\u003c/p\u003e\n\u003cp\u003e“—See you at lunch, okay?—”\u003c/p\u003e\n\u003cp\u003e“—I didn’t finish it, but I don’t think Bradbury will care—”\u003c/p\u003e\n\u003cp\u003e“—Wait up, I’ve got to get—”\u003c/p\u003e\n\u003cp\u003e“—For one pill? Fuck you! I can get them cheaper from—”\u003c/p\u003e\n\u003cp\u003e“—Slut! HEY, SLUT—” —and push through the front doors, into the air-conditioned main corridor. I scan the halls. They can’t be that far off. I just need to find them. I feel naked without them.\u003c/p\u003e\n\u003cp\u003eA flash of blond hair catches my eye.\u003c/p\u003e\n\u003cp\u003e“Kara!” She doesn’t turn around. She must not have heard me. “Kara!”\u003c/p\u003e\n\u003cp\u003eShe stops and I hurry over. Being next to her calms me a little; I’m not invincible yet, but it’s better than nothing. And it’s weird. I never thought we could be friendly, but she was nice to me. So I’ll be nice to her. For a while.\u003c/p\u003e\n\u003cp\u003e“Have you seen Anna?”\u003c/p\u003e\n\u003cp\u003eBut she stares at me like I’ve just told her to stab her eyes out with a pen, and even though she gives me that look a lot, I don’t get it today.\u003c/p\u003e\n\u003cp\u003e“Uh, yeah?” Bitch-voice. Okay.\u003c/p\u003e\n\u003cp\u003eI readjust my book bag and clear my throat.\u003c/p\u003e\n\u003cp\u003e“Where is she? I want to talk to her. She called this weekend and I didn’t pick up.” I wasn’t ready. “You know Anna. She’ll be pissed.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Kara agrees. “You could say that.”\u003c/p\u003e\n\u003cp\u003e“What? Did you talk to her?”\u003c/p\u003e\n\u003cp\u003eKara shrugs and flounces down the hall, her golden curls bouncing off her shoulders as she goes. A bitter taste works its way up my throat in spite of the antacid I took. I follow her. She turns a corner. I turn it.\u003c/p\u003e\n\u003cp\u003eJeanette and Marta are at Marta’s locker. Kara prances over, and they enfold her into our secret huddle, the one I should be at the heart of, but my feet are cemented into place by some kind of animal instinct that tells me I’m not allowed over there. Marta spots me. My heart leaps. Invite me over. She murmurs something to the other girls. Invite me over. They laugh. Invite me over.\u003c/p\u003e\n\u003cp\u003eThey turn their backs to me. No.\u003c/p\u003e\n\u003cp\u003eNo way.\u003c/p\u003e\n\u003cp\u003eThis is not a freeze-out.\u003c/p\u003e\n\u003cp\u003eBut I have to find Anna to be sure.\u003c/p\u003e\n\u003cp\u003eShe’s not at her locker. I check her homeroom. She’s not there either. I stalk the halls, and people are looking at me, whispering. But it’s the sweater.\u003c/p\u003e\n\u003cp\u003eI detour into the girls’ washroom, not because I think Anna will be there, but because my stomach is upset. I pop two more antacids and lean over the sink. My heart spazzes in my chest and my arms itch. I scratch along the outside of my sweater because I don’t want to look at the bruises, even though I could close my eyes and see them.\u003c/p\u003e\n\u003cp\u003eI could close my eyes and see—\u003c/p\u003e\n\u003cp\u003eDon’t think about it. Don’t think about it. Don’t think about it.\u003c/p\u003e\n\u003cp\u003eI stare at my reflection in the mirror. My hair is limp, dead, and my face is an unattractive overheated red. Anna would not approve. Anna doesn’t want to talk to me because…Because. Because.\u003c/p\u003e\n\u003cp\u003eI haven’t returned her clothes yet.\u003c/p\u003e\n\u003cp\u003eI ignored her all weekend.\u003c/p\u003e\n\u003cp\u003eDuh.\u003c/p\u003e\n\u003cp\u003eAnna doesn’t want to talk to me, and the other girls are giving me the Cryptic Cold Shoulder until I apologize to her. I exhale. It’s almost comforting in its familiarity. I’ve been here before and I can handle it. It’s not fun, but it’s easy.\u003c/p\u003e\n\u003cp\u003eIt’s not a freeze-out.\u003c/p\u003e\n\u003cp\u003eI’ll find her. Apologize.\u003c/p\u003e\n\u003cp\u003eThe first bell rings. Homeroom. I haven’t even gotten my books. I leave the washroom and step into the hall, forcing my way past the whispers and stares.\u003c/p\u003e\n\u003cp\u003eIt’s the sweater. That’s all it is.\u003c/p\u003e\n\u003cp\u003eAnd then I push through the crowd converged in front of my locker so I can get a good look at the word spray-painted across it.\u003c/p\u003e\n\u003cp\u003eWHORE\u003c/p\u003e\n\u003cp\u003eThis is a freeze-out .\u003c/p\u003e\n\u003cp\u003eThe scene fades out until it’s me and that word and nothing else .\u003c/p\u003e\n\u003cp\u003eI step forward and touch my fingers to one of the letters. It comes back black. I rub my sleeve across the metal. The paint is fresh enough to ruin my shirt but dry enough to keep from smearing into an unintelligible mess.\u003c/p\u003e\n\u003cp\u003e“Is it true?” Someone asks. I touch the paint again. It’s really there. “Did you really bone Donnie Henderson?”\u003c/p\u003e\n\u003cp\u003eThe scene fades back in. Voices assert themselves over the sound of my heart pounding in my chest, and they’re all saying something about me.\u003c/p\u003e\n\u003cp\u003eMe. Donnie Henderson. Did I really bone Donnie Henderson.\u003c/p\u003e\n\u003cp\u003eHis hand up my skirt. Mouth on my neck.\u003c/p\u003e\n\u003cp\u003eI step back and end up on someone’s foot. They swear at me. Watch it, bitch. I focus on not looking like a cornered animal and try to zero in on a face I know, someone familiar amid the slack-jawed rubberneckers.\u003c/p\u003e\n\u003cp\u003eJosh. My boyfriend.\u003c/p\u003e\n\u003cp\u003eHe hovers just outside the mob. Our eyes meet. He turns away.\u003c/p\u003e\n\u003cp\u003e“Oh, my God, here comes Holt.” Another voice. “This is so awe- some!”\u003c/p\u003e\n\u003cp\u003eThe second bell rings. Principal Holt is there before I can escape, the decrepit old janitor trailing behind him. His face purples as he surveys the damage. He paces, yells, and makes such a fuss, a new crowd is born. He orders a temporary cover for my locker until the paint can be removed, and he vows the perpetrators will be brought to justice.\u003c/p\u003e\n\u003cp\u003eAnd then he asks me if I know who they are.\u003c/p\u003e\n\u003cp\u003eAfter homeroom, I’m gone. I’m at that pay phone again and I’m calling Josh. Again. I pick at the phone book dangling from a string, half torn away by some vandal with nothing better to do, while the sun continues its slow rise overhead. It’s hot in this booth. I turn my back to the cars rushing past me, on their way to the main street.\u003c/p\u003e\n\u003cp\u003eI finally get his voice mail.\u003c/p\u003e\n\u003cp\u003e“It’s me.” A car goes by. I swallow twice and try to figure out what to say while the silence on the other end of the line waits for me to fill it. “Look, what they’re—what they’re all saying—what I—” I can’t tell this to Josh. Not on the phone.”…You heard it from Kara, didn’t you?”\u003c/p\u003e\n\u003cp\u003eI hang up. Kara.\u003c/p\u003e\n\u003cp\u003eKara, Kara, Kara.\u003c/p\u003e\n\u003cp\u003eKara Myers.\u003c/p\u003e\n\u003cp\u003eKara.\u003c/p\u003e\n\u003cp\u003eI am such a fool.\u003c/p\u003e\n\u003cp\u003eI’m used to everyone’s eyes on me; that’s nothing new. When you’re\u003c/p\u003e\n\u003cp\u003eAnna Morrison’s best friend, people look. We’re the kind of popular that parents like to pretend doesn’t exist so they can sleep at night, and we’re the kind of popular that makes our peers unable to sleep at night. Everyone hates us, but they’re afraid of us, too. Anna thrives on it. She says the day people stop hating us is the day something is really wrong. She says I should look at it that way, but I can’t. Everyone hates us, and it makes me a total wreck. She hated that about me.\u003c/p\u003e\n\u003cp\u003eThese people are nothing. They don’t matter. None of this matters. There’s a whole world outside of this hellhole. God, Regina. You could at least act like you don’t give a damn.\u003c/p\u003e\n\u003cp\u003eSo I do it like she does it: I square my shoulders and march across the parking lot, my jaw clenched and my eyes narrowed. I try not to let the heat touch me or flinch at the blast of cold air on my skin when I step through the school doors.\u003c/p\u003e\n\u003cp\u003eI’m ushered in by whispers and stares. Half the student body relishes it; they’ve waited a long time to show me just how much they hate me. The other half doesn’t know what to make of it after spending four years fearfully revering me.\u003c/p\u003e\n\u003cp\u003ePrincipal Holt makes quick work of restoring my locker, but whoever repainted it doesn’t know how to color-match. My locker has been painted red. Every other locker in this school is a bright, hideous pumpkin orange. It’s a wash of a coat, too.\u003c/p\u003e\n\u003cp\u003eI can still see the WHORE forcing its way through.\u003c/p\u003e\n\u003cp\u003eI grab my books. Two girls go by, and I hear my name but not the context surrounding it. Probably something like: Regina Afton is a slut who slept with Anna Morrison’s boyfriend I know can you believe it pass it on.\u003c/p\u003e\n\u003cp\u003eI will kill myself before I get used to this.\u003c/p\u003e\n\u003cp\u003eAnna catches my eye then, swaggering down the hall in the opposite direction. A dozen guys watch her as she goes; it’s the way her skirt moves with her hips when she walks. She takes a sharp turn left, and I know where she’s going. And she’s alone.\u003c/p\u003e\n\u003cp\u003eThis is my chance.\u003c/p\u003e\n\u003cp\u003eI take the same left, push through the pale blue door that opens into the girls’ washroom, and there she is, admiring her reflection in the mirrors over the sinks. I don’t blame her. Anna is beautiful, with her soft, fine auburn hair and the kind of body that brings guys to their knees. It’s cliché, but she’s a Siren. Impossible to fight, there’s no better feeling than to hear her sing your name until she has you and eats you alive. The people at this school think it’s hard enough living beneath her, but it’s even harder being her friend. Anna.\u003c/p\u003e\n\u003cp\u003eThe door swings shut. She stiffens and turns, and the air leaves my lungs. I’m torn between wanting to be far away from her and wanting to throw myself at her feet to beg forgiveness for something I didn’t do. As long as it means we can be friends again.\u003c/p\u003e\n\u003cp\u003eI’m sorry. I’ll never sleep with your boyfriend again, never, never, never….\u003c/p\u003e\n\u003cp\u003eMaybe I should’ve thought this out better.\u003c/p\u003e\n\u003cp\u003eShe takes me in slowly, one eyebrow arched. She wants me to feel like I’m not good enough to be acknowledged, and it’s working. I’m suddenly aware of the sloppy ponytail tied at the back of my head and how dumb my outfit looks—jeans and a sweater on another sweltering day—but it doesn’t matter. She’s always been prettier than me.\u003c/p\u003e\n\u003cp\u003e“Nice job you did on my locker,” I say.\u003c/p\u003e\n\u003cp\u003eWe stare at each other, Western-movie-showdown-style. Several agonizing seconds pass, but Anna never draws her gun, which is good, because I’m totally unarmed. She turns back to the mirror and digs through the makeup bag in front of her. \u003c/p\u003e","sourceLink":"https://allnovel.net/some-girls-are/page-3.html","bookId":1896,"creation":"Oct 5, 2019 5:10:01 PM","modification":"Oct 5, 2019 5:10:01 PM"}
