{"id":85823,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe’d probably have to forget he hates me for that to happen.\u003c/p\u003e\n\u003cp\u003eI look around the cafeteria. Josh, Henry, and Bruce are laughing obnoxiously together. Josh looks so proud of himself for what he did to Donnie.\u003c/p\u003e\n\u003cp\u003eI turn back to Michael. His Moleskine catches my eye, triggering a memory. Eager to fill the silence, I start babbling more things I know about his mom, just so I can hear him say something back. I bet if I talked about her enough he’d forget he hates me.\u003c/p\u003e\n\u003cp\u003e“She was really big on writing things down,” I say. I nod at the Moleskine. “Is that why you keep that thing? She always used to say, ‘Write it down today, put it away, make sense of it tomorrow.’”\u003c/p\u003e\n\u003cp\u003e“Yeah, she always used to say that to her patients,” he says, nodding. Oh my God, Oh no. Why did I say that? It dawns on him slowly, horribly. His eyes widen and he laughs in disbelief. “You have got to be fucking kidding me.”\u003c/p\u003e\n\u003cp\u003eMy face turns red.\u003c/p\u003e\n\u003cp\u003e“You?” he asks. “You were one of her patients?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I say quickly. I don’t know what else to say, but I really don’t want to eat lunch alone tomorrow. “Michael, I’m—”\u003c/p\u003e\n\u003cp\u003e“Were you one of her patients?”\u003c/p\u003e\n\u003cp\u003eI can’t believe I fucked this up this badly and so quickly. “Answer me.” I nod feebly.\u003c/p\u003e\n\u003cp\u003e“I knew it,” he says. “I knew you were lying. I couldn’t figure out how a bitch like you would know my mother, much less be friends with her.”\u003c/p\u003e\n\u003cp\u003eI bite my lip and dig my fingers into my jeans and try to channel Anna so he can’t see how much that one hurt.\u003c/p\u003e\n\u003cp\u003e“You were her patient. Why?” I shake my head. I’m not giving him anything else to throw in my face. “So when you saw my mom for whatever you saw her for, did you tell her you were spreading vicious rumors all over school about her son? Did that come up during your sessions? I’m sure she would’ve loved it.”\u003c/p\u003e\n\u003cp\u003eI don’t say anything.\u003c/p\u003e\n\u003cp\u003e“And then she died, and you—” He edges his chair back, like he can’t stand being this close to me. “And now you’re sitting across from me….” He just can’t believe it. “I don’t know what you needed, but you didn’t deserve to get it from her.”\u003c/p\u003e\n\u003cp\u003e“I needed help.”\u003c/p\u003e\n\u003cp\u003eHe gives me a disgusted look and gets up from the table. My heart seizes. He can’t leave me here. Alone. “Where are you going?” I ask.\u003c/p\u003e\n\u003cp\u003e“I don’t owe you anything,” he tells me. “And forget about sitting here tomorrow. Stay away from me. I’m serious.”\u003c/p\u003e\n\u003cp\u003eHe stalks out of the cafeteria. I fight the heat working its way up to my face. I get up fake-casually, grateful Anna and Kara aren’t around to see this, and decide to wait out the rest of lunch in history class, which is where I’m due next. I walk the mostly deserted halls to my red locker, yank the door open, and—\u003c/p\u003e\n\u003cp\u003eMy books are gone.\u003c/p\u003e\n\u003cp\u003eAll of them.\u003c/p\u003e\n\u003cp\u003eThere’s an envelope taped to the inside of the door. My name is scrawled on the front in loopy, cutesy handwriting. I rip it off and open it up. Written on stationery that’s decorated with cartoon stars— Kara’s stationery—is the word pool.\u003c/p\u003e\n\u003cp\u003eI wasn’t supposed to get this until after lunch, when I’d. have to scramble for my books in front of everyone.\u003c/p\u003e\n\u003cp\u003eSmall mercies.\u003c/p\u003e\n\u003cp\u003eI crumple the note and make my way to the pool. At lunch, nothing happens here. It’s off-limits. Two week’s detention if you’re caught anywhere near it unsupervised, since drowned students don’t reflect so well on the administration. My only obstacle should be getting past Sadowsky’s office, but he’s probably enjoying a nap in the teacher’s lounge about now. I push through the doors and find my books drifting across the water. I grab the skimmer and fish them out quickly. My notes are pulp. The damaged textbooks will have to be paid for and replaced.\u003c/p\u003e\n\u003cp\u003eI gather everything in my arms and get the hell out. Perfect timing; I pass Sadowsky in the halls. The books soak through the front of my shirt and trail water behind me, but all he says is, “Get to class Afton, or do you want another detention this week?”\u003c/p\u003e\n\u003cp\u003eTeachers never go out of their way to notice anything.\u003c/p\u003e\n\u003cp\u003eAnna, Kara, Jeanette, and Marta spend the day stalking me in yellow.\u003c/p\u003e\n\u003cp\u003eThey’re always in the background and they always disappear when I try to get a closer look. The dumb thing is, I used to do this to other girls. I know how it works. No one ever goes in for the kill, but I still can’t keep my heart from trying to claw its way up my throat every time I glimpse them.\u003c/p\u003e\n\u003cp\u003eBetween classes is open season. I get stared at. I get muttered insults, spewed insults, shoved, and laughed at.\u003c/p\u003e\n\u003cp\u003eI am a bitch whore slut.\u003c/p\u003e\n\u003cp\u003eThese names attach themselves to me in the halls, flutter away during class, and reattach themselves as soon as the bell rings.\u003c/p\u003e\n\u003cp\u003eI’m between first and second period, my head ducked, clutching my books and weaving through the hall like an idiot, which is okay as long as I don’t have to look anyone in the eyes. I end up crashing into Henry Carlson. He grabs me by the arm and doesn’t let go. He’s alone. No Josh, no Bruce, no Anna. But Anna’s always here, even when she’s not.\u003c/p\u003e\n\u003cp\u003e“Better watch it, Afton,” he says, grinning. I jerk my arm away, and he frowns, like I’ve wounded him. “Ouch. What’s the rush?”\u003c/p\u003e\n\u003cp\u003e“I have a class to get to.” I try to step around him, and he blocks my path. I sigh and level a glare at him, like any look I give him could make him submit. “Get out of my way.”\u003c/p\u003e\n\u003cp\u003e“Just give me a minute.”\u003c/p\u003e\n\u003cp\u003e“Henry, I’m warning you—”\u003c/p\u003e\n\u003cp\u003eHe catches sight of something behind me, and before I can turn to look, he grabs me by the shoulders and forces me back, a light push that startles me enough to send me reeling into a wall of flesh. The wall of flesh shoves me back. I drop my books, turn, and find myself face-to-face with Donnie Henderson. He grabs me by the arm and pulls me close enough to say, “You’ll pay for talking.”\u003c/p\u003e\n\u003cp\u003eAll I can see is his wrecked face. There’s nothing else. My vision blurs, like my eyes are totally rejecting him, can’t handle it. I wrench away, and as soon as his hand is off me, the hall comes back into focus. People are watching.\u003c/p\u003e\n\u003cp\u003eThey all think I slept with him.\u003c/p\u003e\n\u003cp\u003eThey all think I wanted it.\u003c/p\u003e\n\u003cp\u003eDonnie stomps away. Henry hangs around to laugh at his handiwork, a picture of lazy triumph. I grab my books and head in the opposite direction and the bell rings, and all I can think is next, next, next, next class.\u003c/p\u003e\n\u003cp\u003eBy lunch, I’m a mess. I spend the period in the girls’ room with a bag of chips from the vending machine, but I can’t eat.\u003c/p\u003e\n\u003cp\u003eI roll up my sleeves and stare at what’s left of my bruises.\u003c/p\u003e\n\u003cp\u003eI want to run away and I never want to come back.\u003c/p\u003e\n\u003cp\u003eWhen the last bell signals freedom, I’m on edge. Spent. I get my stuff from my locker—warped history books and all—and push through a flood of students.\u003c/p\u003e\n\u003cp\u003eTotally alone.\u003c/p\u003e\n\u003cp\u003eI’m halfway down the stairs when someone pushes me from behind. I lurch forward and I’m flying, steps blurring past. I land at the bottom of them with a sick thud. The pain is immediate. So is the laughter. It comes in from all sides, and I stay on the floor, surrounded by it. It’s amazing how one day you wake up and this is your life.\u003c/p\u003e\n\u003cp\u003eI am not going to cry.\u003c/p\u003e\n\u003cp\u003e“Way to walk, Regina.”\u003c/p\u003e\n\u003cp\u003eI look up. Kara. Anna. Jeanette. Bruce. Josh. Josh averts his eyes, and Anna grins and she’s gone; Kara whisks her away. They low-five. Josh and Bruce follow after them. I am not going to cry.\u003c/p\u003e\n\u003cp\u003e“Oh!” Ms. Arnett, the school’s secretary, materializes in the middle of the crowd and hurries over to me, her face full of wrinkly concern. “That was a nasty fall you took, Regina! Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I mutter. She pulls me up by the elbow and looks me over. My left knee aches, and a small patch of blood is soaking through my jeans.\u003c/p\u003e\n\u003cp\u003e“Oh, but you’re bleeding. Come to the office and we’ll get—”\u003c/p\u003e\n\u003cp\u003eI shrug her off me. “I said I’m fine.”\u003c/p\u003e\n\u003cp\u003eShe stares at me with her watery blue eyes.\u003c/p\u003e\n\u003cp\u003e“Well…,” she says, “if you’re sure.”\u003c/p\u003e\n\u003cp\u003eI hobble away from Arnett, everyone, and push through the front doors. The warm air envelops me, and my head is full of the fall and after the fall: the stairs, my palms pressed against the floor, Anna, Kara, Josh. Way to walk, Regina. Arnett. As soon as I’m out of the parking lot and onto the street, I stop. I just stop.\u003c/p\u003e\n\u003cp\u003eI think of the year stretched out before me like a tunnel, and I see myself in it, awake and running.\u003c/p\u003e\n\u003cp\u003eA car pulls up to the curb and snaps me back to life. I resume my stilted walk home. Ten steps later, I notice the car is keeping pace with me. I have this crazy thought it’s Anna and Kara and they’re going to egg me or something, but when I look, it’s only Michael in the shoddy blue Saturn he drives to school every day. The window is rolled down, and his arm hangs out the side, casual. He taps his fingers along the door, dividing his gaze between the road and me.\u003c/p\u003e\n\u003cp\u003e“I’ll give you a ride home,” he says.\u003c/p\u003e\n\u003cp\u003e“No, you won’t.”\u003c/p\u003e\n\u003cp\u003e“Kara pushed you.” I ignore him. “Are you sure you don’t want a ride?”\u003c/p\u003e\n\u003cp\u003eIt’s tempting: It’s hot and gross out, and my knee hurts. But I won’t. Not after what happened in the cafeteria yesterday. I force myself to keep going, and he keeps creeping alongside me in the car. I squint up at the sun.\u003c/p\u003e\n\u003cp\u003e“Do you have air-conditioning?”\u003c/p\u003e\n\u003cp\u003e“It’s one of the few things in this wreck that works.”\u003c/p\u003e\n\u003cp\u003eMichael rolls up his window as I walk around to the passenger’s side and get in. It’s really weird to think that not that long ago, this would be Josh’s car and I’d be sitting in it.\u003c/p\u003e\n\u003cp\u003eMichael pulls away from the curb. “Where do you live?”\u003c/p\u003e\n\u003cp\u003e“Keep going down this road, past the phone booth. It’s the second left turn, seven houses down. You’ll see it. It’s the first brick house.”\u003c/p\u003e\n\u003cp\u003eI run my hand over my knee. It’s stopped bleeding. “I was so sure you’d go crawling back to them by now,” he comments. “I’m amazed you have any pride.” I don’t say anything for a minute. \u003c/p\u003e","sourceLink":"https://allnovel.net/some-girls-are/page-7.html","bookId":1896,"creation":"Oct 5, 2019 5:10:01 PM","modification":"Oct 5, 2019 5:10:01 PM"}
