{"id":29515,"no":2,"title":"The One Month Prologue","content":"\u003cp\u003eThere was this . . . disease that the clacksmen got. It was like the illness known as ‘calenture’ that sailors experienced when, having been becalmed for weeks under a pitiless sun, they suddenly believed that the ship was surrounded by green fields and stepped overboard.\u003c/p\u003e \n\u003cp\u003eSometimes, the clacksmen thought they could fly.\u003c/p\u003e \n\u003cp\u003eThere was about eight miles between the big semaphore towers and when you were at the top you were maybe a hundred and fifty feet above the plains. Work up there too long without a hat on, they said, and the tower you were on got taller and the nearest tower got closer and maybe you thought you could jump from one to the other, or ride on the invisible messages sleeting between them, or perhaps you thought that you were a message. Perhaps, as some said, all this was nothing more than a disturbance in the brain caused by the wind in the rigging. No one knew for sure. People who step on to the air one hundred and fifty feet above the ground seldom have much to discuss afterwards.\u003c/p\u003e \n\u003cp\u003eThe tower shifted gently in the wind, but that was okay. There were lots of new designs in this tower. It stored the wind to power its mechanisms, it bent rather than broke, it acted more like a tree than a fortress. You could build most of it on the ground and raise it into place in an hour. It was a thing of grace and beauty. And it could send messages up to four times faster than the old towers, thanks to the new shutter system and the coloured lights.\u003c/p\u003e \n\u003cp\u003eAt least, it would once they had sorted out a few lingering problems . . .\u003c/p\u003e \n\u003cp\u003eThe young man climbed swiftly to the very top of the tower. For most of the way he was in clinging, grey morning mist, and then he was rising through glorious sunlight, the mist spreading below him, all the way to the horizon, like a sea.\u003c/p\u003e \n\u003cp\u003eHe paid the view no attention. He’d never dreamed of flying. He dreamed of mechanisms, of making things work better than they’d ever done before.\u003c/p\u003e \n\u003cp\u003eRight now, he wanted to find out what was making the new shutter array stick again. He oiled the sliders, checked the tension on the wires, and then swung himself out over fresh air to check the shutters themselves. It wasn’t what you were supposed to do, but every linesman knew it was the only way to get things done. Anyway, it was perfectly safe if you—\u003c/p\u003e \n\u003cp\u003eThere was a clink. He looked back and saw the snaphook of his safety rope lying on the walkway, saw the shadow, felt the terrible pain in his fingers, heard the scream and dropped . . .\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;. . . like an anchor.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/339/622.html","bookId":331,"creation":"Aug 5, 2019 1:37:53 AM","modification":"Aug 5, 2019 1:37:53 AM"}
