{"id":78853,"no":12,"title":"Page 12","content":"\u003cp\u003e“Machines,” he whispered. “Again machines.”\u003c/p\u003e\n\u003cp\u003eAs Dougless watched him, she had an idea. Perhaps she could use music to help bring his memory back.\u003c/p\u003e\n\u003cp\u003eAlong one wall of the store was a selection of cassette tapes. She chose Beethoven, excerpts from La Traviata, and some Irish folk music. She started to choose the Rolling Stones, but then thought she ought to get something more modern, but her thought made her laugh at herself. “Mozart is new to him,” she said as she took the Stones tape off the shelf. “Maybe.” On the bottom shelf were some inexpensive cassette players for sale, so she bought one that included earphones.\u003c/p\u003e\n\u003cp\u003eWhen she went back to Nicholas, he had moved to the stationery section of the store and was gingerly touching the wide selection of papers. Dougless picked up a spiral notebook and began demonstrating felt-tip pens, ballpoints, and mechanical pencils. Nicholas made a few squiggles on the testing paper, but she noticed that he didn’t write words. For all that, according to him, his mother was a scholar of great magnitude, Dougless wondered if he could read and write, but she didn’t ask him.\u003c/p\u003e\n\u003cp\u003eThey left the store with another shopping bag, this one full of spiral notebooks, felt-tips of every color imaginable, cassettes and a player, plus six travel books. Three of the travel books were on England, one about America, and two were about the world. On impulse she’d also purchased a set of Winsor and Newton watercolors and a block of watercolor paper for Nicholas. She somehow felt that he might like to paint. She also tucked in an Agatha Christie.\u003c/p\u003e\n\u003cp\u003e“Could we take these bags back to the hotel now?” Dougless asked. Her arms felt as if they were lengthening from carrying the heavy bags.\u003c/p\u003e\n\u003cp\u003eBut Nicholas had stopped again, this time in front of a women’s clothing store. “You will purchase yourself new clothing,” he said, and it was an order.\u003c/p\u003e\n\u003cp\u003eDougless didn’t like his tone. “I have my own clothes, and when I get them, I will—”\u003c/p\u003e\n\u003cp\u003e“I will travel with no beldame,” he said stiffly.\u003c/p\u003e\n\u003cp\u003eDougless wasn’t sure what the word meant, but she could guess. She looked at her reflection in the glass. If she thought she had looked bad yesterday, she had surpassed herself today. There was a time for pride and a time for being sensible. Without another word, she handed him the bag with the books. “Wait for me over there,” she said in the same tone of command that he had used on her, as she pointed to a wooden bench under a tree.\u003c/p\u003e\n\u003cp\u003eAfter taking the bag with the cosmetics, Dougless straightened her shoulders and entered the shop.\u003c/p\u003e\n\u003cp\u003eIt took over an hour, but when Dougless returned to him, she didn’t look like the same person. Her auburn hair, wildly unkempt from days without care, was now pulled back off her face and, neatly combed, it fell back in soft waves to the silk scarf she’d used to tie it at the nape of her neck. Softly applied cosmetics brought out the beauty of her face. She was not a beauty of the type that looked fragile and overbred, but Dougless was healthy and wholesome-looking, as though she’d grown up on a horse ranch in Kentucky or on a sailboat in Maine—which she had.\u003c/p\u003e\n\u003cp\u003eShe’d chosen clothes that were simple, but exquisitely made: a teal Austrian jacket; a paisley skirt of teal, plum, and navy; a plum silk blouse; and boots of soft navy leather. On impulse she’d also purchased navy kid gloves and a navy leather handbag, as well as a full set of lingerie and a nightgown.\u003c/p\u003e\n\u003cp\u003eCarrying her shopping bags, she crossed the road toward Nicholas, and when he saw her, she was pleased by his incredulous expression. “Well?” she asked.\u003c/p\u003e\n\u003cp\u003e“Beauty knows no time,” he said softly, rising, then kissing her hand.\u003c/p\u003e\n\u003cp\u003eThere were advantages to Elizabethan men, she thought.\u003c/p\u003e\n\u003cp\u003e“Is it time for tea yet?” he asked.\u003c/p\u003e\n\u003cp\u003eDougless groaned. Men were timeless, she thought. It was always: You-look-great-what’s-for-dinner?\u003c/p\u003e\n\u003cp\u003e“We are now going to experience one of the worst aspects of England, and that is lunch. Breakfast is great; tea is great. Dinner is great if you like butter and cream, but lunch is . . . indescribable.”\u003c/p\u003e\n\u003cp\u003eHe was listening to her with concentration, as one does when hearing a foreign language. “What is this ‘lunch’?”\u003c/p\u003e\n\u003cp\u003e“You’ll see,” Dougless said as she led the way to a nearby pub. Pubs were one of the things Dougless liked best about England, as they were family oriented, but you could still have a drink. After they’d settled into a booth, Dougless ordered two cheese salad sandwiches, a pint of beer for him, a lemonade for her; then she proceeded to tell Nicholas the difference between a bar in America and a pub in England.\u003c/p\u003e\n\u003cp\u003e“There are more unescorted women?” he asked in amazement.\u003c/p\u003e\n\u003cp\u003e“More than just me?” she asked, smiling. “There are lots of independent women today. We have our own jobs, our own credit cards. We don’t have, or need, men to take care of us.”\u003c/p\u003e\n\u003cp\u003e“But what of cousins and uncles? Do these women have no sons to look after them?”\u003c/p\u003e\n\u003cp\u003e“It’s not like that now. It’s—” She stopped talking when the waitress put their sandwiches before them. But they were not sandwiches as Americans know them. An English cheese sandwich was a piece of cheese on two pieces of buttered white bread. A cheese salad sandwich had a small piece of lettuce on it. The sandwich was small, dry, tasteless.\u003c/p\u003e\n\u003cp\u003eNicholas watched her as she picked up the strange-looking food and began to eat it; then he followed her lead.\u003c/p\u003e\n\u003cp\u003e“Do you like it?” she asked.\u003c/p\u003e\n\u003cp\u003e“It has no flavor,” he said, then took a drink of his beer. “Nor does the beer.”\u003c/p\u003e\n\u003cp\u003eDougless looked about the pub and asked if it was anything like the public houses in the sixteenth century. Not that she believed he was . . . The heck with it, she thought.\u003c/p\u003e\n\u003cp\u003e“Nay,” he answered. “There is gloom and quiet here. There is no danger here.”\u003c/p\u003e\n\u003cp\u003e“But that’s good. Peace and safety are good.”\u003c/p\u003e\n\u003cp\u003eNicholas shrugged as he ate the rest of the sandwich in two bites. “I prefer flavor in my food and flavor in my public houses.”\u003c/p\u003e\n\u003cp\u003eShe smiled as she started to stand up. “Are you ready to go? We still have lots to do.”\u003c/p\u003e\n\u003cp\u003e“Leave? But where is dinner?”\u003c/p\u003e\n\u003cp\u003e“You just ate it.”\u003c/p\u003e\n\u003cp\u003eHe raised one eyebrow at her. “Where is the landlord?”\u003c/p\u003e\n\u003cp\u003e“The man behind the bar seems to be in charge, and I saw a woman behind the counter. Maybe she cooks. Wait a minute, Nicholas, don’t make a fuss. The English don’t like for people to cause problems. If you’ll wait a minute, I’ll go and—”\u003c/p\u003e\n\u003cp\u003eBut Nicholas was already halfway to the counter. “Food is food, no matter what the year. No, madam, stay where you are and I will procure us a proper dinner.”\u003c/p\u003e\n\u003cp\u003eAs Dougless watched, Nicholas talked earnestly to the bartender for a few moments; then the woman was called over and she, too, listened to Nicholas. When Dougless saw the man and woman scurrying away to do whatever they’d been told, it occurred to her that if Nicholas learned his way around the twentieth century, he might be a bit of a problem.\u003c/p\u003e\n\u003cp\u003eMoments later he returned to the booth, and minutes afterward, dishes of food began to be placed on the table. There was chicken, beef, a big pork pie, bowls of vegetables, one of salad, and a nasty looking dark beer was set before Nicholas.\u003c/p\u003e\n\u003cp\u003e“Now, Mistress Montgomery,” he said when the table was loaded with food, “how do you propose to find my way home?”\u003c/p\u003e\n\u003cp\u003eWhen she looked up at him, his eyes were twinkling and she knew that, for once, she had been the one wearing the incredulous expression. It was his turn to be the one who knew how to do something she didn’t.\u003c/p\u003e\n\u003cp\u003e“Chalk one up for you,” she said, laughing as she speared a chicken leg. “Why don’t you ask the cook if she knows any good witches’ spells?”\u003c/p\u003e\n\u003cp\u003e“Perhaps if we mix all those bottles you bought . . .” Nicholas said, his mouth full of English beef. “Ow!” he said when he nearly pierced his tongue with the fork he was trying to learn to use.\u003c/p\u003e\n\u003cp\u003e“Forget the witchcraft,” she said as she withdrew a spiral notebook and a pen from a bag. “I have to know all about you before we can start research.” Perhaps now, with dates and places, she’d trip him up.\u003c/p\u003e\n\u003cp\u003eBut nothing she asked him even slowed him down as he ate plateful after plateful of food. He was born the sixth of June, 1537.\u003c/p\u003e\n\u003cp\u003e“And what’s your full name, or, I guess, in your case, what’s your title?” She was eating mashed parsnips with her left hand, writing with her right.\u003c/p\u003e\n\u003cp\u003e“Nicholas Stafford, earl of Thornwyck, Buckshire, and Southeaton, lord of Farlane.”\u003c/p\u003e\n\u003cp\u003eDougless blinked. “Anything else?”\u003c/p\u003e\n\u003cp\u003e“A few baronetcies, but none of great importance.”\u003c/p\u003e\n\u003cp\u003e“So much for barons,” she said as she had him repeat what he’d said so she could write it down. Next, she began to list the properties he owned. There were estates from East Yorkshire to South Wales, plus more land in France and Ireland.\u003c/p\u003e\n\u003cp\u003eWhen her head was beginning to whirl with all the names, she closed her notebook. “I think that with all that we should be able to find something about you—him,” she said, her tone showing her understatement.\u003c/p\u003e\n\u003cp\u003eAfter “lunch” they stopped in a barbershop so Nicholas could be shaved. When he sat up in the chair, clean shaven at last, Dougless took a moment to catch her breath. Hidden under the beard and mustache had been a full-lipped mouth of great sensitivity.\u003c/p\u003e\n\u003cp\u003e“I will do, madam?” he asked, softly chuckling at her expression.\u003c/p\u003e\n\u003cp\u003e“Passable,” she said, trying to sound as though she’d seen better. But as she walked ahead of him, his laugh filled her ears. Vain! she thought. He was much too vain!\u003c/p\u003e\n\u003cp\u003eWhen they returned to the bed-and-breakfast, the landlady said a room with a private bath had come vacant. A sane, sensible part of Dougless knew she should ask for a room of her own, but she didn’t open her mouth when the landlady looked at her in question. Besides, Dougless told herself, when Robert came for her, it might be good for him to see her with this divine-looking man.\u003c/p\u003e\n\u003cp\u003eAfter she and Nicholas had moved what little they had into the new room, they went to the church and spoke to the vicar, but there was no word from Robert for her, nor any inquiries about the bracelet. They went to a grocery and bought cheese and fruit; to a butcher for meat pies; to a baker for bread, scones, and pastries; then to a winery, where they purchased two bottles of wine.\u003c/p\u003e\n\u003cp\u003eBy teatime, Dougless was exhausted.\u003c/p\u003e\n\u003cp\u003e“My purse bearer looks sinking-ripe,” Nicholas said, smiling at her.\u003c/p\u003e\n\u003cp\u003eDougless felt exactly like sinking-ripe sounded. Together they walked back to their little hotel, where they took the bag containing the new books to the garden. Mrs. Beasley served them tea and scones, and gave them a blanket to spread on the grass. Nicholas and Dougless sat on the blanket, drank tea, ate the scones, and looked at the books. It was heavenly English weather, cool yet warm, sunny but not brilliant. The garden was green and lush, the roses fragrant. Dougless was sitting up; Nicholas stretched before her on his stomach as he ate scones with one hand and carefully turned pages with the other.\u003c/p\u003e\n\u003cp\u003eThe cotton shirt he wore was stretched across his back muscles, and the trousers clung to his thighs. Black curls brushed his collar. Dougless found herself looking at him more than at the travel book she was thumbing through.\u003c/p\u003e\n\u003cp\u003e“It is here!” Nicholas said, rolling over and sitting up so abruptly Dougless’s tea splashed out. “My newest house is here.” He shoved the book at her as she put down her cup.\u003c/p\u003e\n\u003cp\u003e“‘Thornwyck Castle,’” she read beside the full page photo, “‘begun in 1563 by Nicholas Stafford, earl of Thornwyck . . .’ ” She glanced at him. He was lying on his back, his hands behind his head, and smiling angelically, as though he’d at last found some proof of his existence. “‘. . . was confiscated by Queen Elizabeth the First in 1564 when . . .’ ” She trailed off.\u003c/p\u003e\n\u003cp\u003e“Go on,” Nicholas said softly, but he was no longer smiling.\u003c/p\u003e\n\u003cp\u003e“‘. . . when the earl was found guilty of treason and sentenced to be beheaded. There was some doubt of Stafford’s guilt, but all investigation stopped when’ ”—Dougless’s voice lowered—“ ‘when three days before his execution the earl was found dead in his cell. He had been writing a letter to his mother when he apparently died of a heart attack. He was found with his head face down on a table, the letter to his mother’”—she looked up and whispered—“‘unfinished.’ ”\u003c/p\u003e\n\u003cp\u003eNicholas watched the clouds overhead and was silent for a while. “Does it say what became of my mother?” he asked at last.\u003c/p\u003e\n\u003cp\u003e“No. The rest of the article describes the castle and says it was never finished. ‘What had been completed fell into disrepair after the Civil War’—your Civil War, not mine—‘then was renovated in 1824, for the James family, and—’” She stopped. “‘And now it’s an exclusive hotel with a two-star restaurant!’”\u003c/p\u003e\n\u003cp\u003e“My house is a public house?” Nicholas asked, obviously appalled. “My house was to be a center of learning and intelligence. It was—”\u003c/p\u003e\n\u003cp\u003e“Nicholas, that was hundreds of years ago. I mean, maybe it was. Don’t you see? Maybe we can get reservations to stay at this hotel. We can possibly stay at your house.”\u003c/p\u003e\n\u003cp\u003e“I am to pay to stay in my own house?” he asked, his upper lip curled in disgust.\u003c/p\u003e\n\u003cp\u003eShe threw up her hands in despair. “Okay, don’t go. We’ll just stay here and go shopping for the next twenty years, and you can spend all your time badgering pub owners into serving you medieval banquets every day.”\u003c/p\u003e\n\u003cp\u003e“You have a sharp tongue on you.”\u003c/p\u003e\n\u003cp\u003e“I can see the truth, if that’s what you mean.”\u003c/p\u003e\n\u003cp\u003e“Except about men who abandon you.”\u003c/p\u003e\n\u003cp\u003eShe started to get up, but he caught her hand.\u003c/p\u003e\n\u003cp\u003e“I will pay,” he said, looking up at her, but he began caressing the fingers of the hand he held. “You will remain with me?”\u003c/p\u003e\n\u003cp\u003eShe pulled her hand out of his grasp. “A bargain’s a bargain. I’ll help you find out what you need to know so maybe you can clear your ancestor’s name.”\u003c/p\u003e\n\u003cp\u003eNicholas smiled. “So now I am my own ancestor?”\u003c/p\u003e\n\u003cp\u003eWith a look at him that said she could do without his sarcasm, she went into the house to call Thornwyck Castle. At first the reservations clerk haughtily told her that reservations needed to be made a year in advance, but there was a commotion and a moment later the clerk returned to say that, unexpectedly, their best suite was currently available. Dougless said, “Yes!” without asking the price.\u003c/p\u003e\n\u003cp\u003eAs she hung up, Dougless realized she wasn’t surprised by the coincidence of a room becoming available. It was beginning to seem as though a kind of wish therapy was at work. Every time she wished for something, she got it. She’d wished for a Knight in Shining Armor and he had appeared. Maybe her wish had been more of a metaphor than a desire for a man who believed he was from the sixteenth century and wore silver armor, but, still, she had received her wish. She’d wished for money and a bag of coins worth hundreds of thousands of pounds had shown up. She needed a place to spend the night and that had appeared too. Now she needed a reservation to an exclusive hotel and of course the hotel had “unexpectedly” had a vacancy. \u003c/p\u003e","sourceLink":"https://allnovel.net/a-knight-in-shining-armor-montgomery-taggart-15/page-12.html","bookId":1851,"creation":"Oct 5, 2019 4:12:08 PM","modification":"Oct 5, 2019 4:12:08 PM"}
