{"id":88714,"no":13,"title":"Page 13","content":"\u003cp\u003eRashel knew she had to stop the guard before he could make a sound. The vampires\u0027 mansion was on\u003c/p\u003e\n\u003cp\u003ethe farther cliffs, overlooking open sea rather than the harbor, and the music ought to help drown outside\u003c/p\u003e\n\u003cp\u003enoises-but the greatest danger was still that they would be heard before the girls could get away.\u003c/p\u003e\n\u003cp\u003eShe launched herself at the werewolf, throwing a front snap kick to his chest. She could hear the air\u003c/p\u003e\n\u003cp\u003ewhoosh out as he fell backward. Good. No breath for howling. She landed with both knees on top of him.\u003c/p\u003e\n\u003cp\u003e\"This is silver,\" she hissed, pressing the blade against his throat. \"Don\u0027t make a noise or I\u0027ll use it.\"\u003c/p\u003e\n\u003cp\u003eHe glared at her. He had shaggy hair and eyes that were already half-animal.\u003c/p\u003e\n\u003cp\u003e\"Is there anybody on the boats?\" When he didn\u0027t answer, she pressed the silver knife harder. \"Is there?\"\u003c/p\u003e\n\u003cp\u003eHe snarled a breathless \"No.\" His teeth were turning, too, spiking and lengthening.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t change-\" Rashel began, but at that moment he decided to throw her off. He heaved once,\u003c/p\u003e\n\u003cp\u003eviolently.\u003c/p\u003e\n\u003cp\u003eA snap of her wrist would have plunged the silver blade into his throat even as she fell. Instead Rashel\u003c/p\u003e\n\u003cp\u003erolled backward in a somersault, tucking in her head and ending up on her right knee. Then, as the\u003c/p\u003e\n\u003cp\u003ewerewolf jumped at her, she slammed the sheathed knife upward against his jaw.\u003c/p\u003e\n\u003cp\u003eHe fell back unconscious.\u003c/p\u003e\n\u003cp\u003eToo bad, I wanted to ask him about the client. Rashel looked shoreward, to see that Daphne, Annelise,\u003c/p\u003e\n\u003cp\u003eand Nyala were on the pier with her. They were each holding a rock or a piece of wood broken from the\u003c/p\u003e\n\u003cp\u003ejagged pilings of the wharf.\u003c/p\u003e\n\u003cp\u003eThey were going to help me, Rashel thought. She felt oddly warmed by it.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she said rapidly. \"Annelise and Keiko, with me. Everybody else, stay. Daphne, keep watch.\"\u003c/p\u003e\n\u003cp\u003eIn a matter of minutes she and the boating girls had checked the boats and found two with features they\u003c/p\u003e\n\u003cp\u003ethought they could handle... and with fuel. Anne-lise had removed a couple of crucial engine pieces out\u003c/p\u003e\n\u003cp\u003eof the others.\u003c/p\u003e\n\u003cp\u003e\"Took out the impellers and the solenoids,\" she told Rashel mysteriously, holding out a grimy hand.\u003c/p\u003e\n\u003cp\u003e\"Good. Let\u0027s set them adrift. Everybody else, get yourself on a boat. Find a place to sit fast and sit\u003c/p\u003e\n\u003cp\u003edown.\" Rashel moved to the back of the group where Fayth had her arms around a couple of the girls\u003c/p\u003e\n\u003cp\u003ewho looked scared of setting out on the dark ocean. \"Come on, people.\" She meant to herd them in front\u003c/p\u003e\n\u003cp\u003eof her like chickens.\u003c/p\u003e\n\u003cp\u003eThat was when it happened.\u003c/p\u003e\n\u003cp\u003eRashel had an instant\u0027s warning-the faint crunch of sand on rock behind her. And then something hit her\u003c/p\u003e\n\u003cp\u003ewith incredible force in the middle of the back. It knocked her down and sent her knife flying.\u003c/p\u003e\n\u003cp\u003eWorse, it sent her mind reeling in shock. She hadn\u0027t been prepared. That instant\u0027s warning hadn\u0027t been\u003c/p\u003e\n\u003cp\u003eenough-because she had already lost zanshin.\u003c/p\u003e\n\u003cp\u003eShe no longer had the gift of continuing mind. She had lost her single purpose. In the old days she\u0027d been\u003c/p\u003e\n\u003cp\u003efixed on one thing-to kill the Night People. There had been no hesitation, no confusion.\u003c/p\u003e\n\u003cp\u003eBut now... she\u0027d already faltered twice tonight, knocking the werewolves unconscious instead of killing\u003c/p\u003e\n\u003cp\u003ethem. She was confused, uncertain. And, as a result, unprepared.\u003c/p\u003e\n\u003cp\u003eAnd now I\u0027m dead, she thought. Her numbed mind was desperately trying to recover and come up with\u003c/p\u003e\n\u003cp\u003ea strategy.\u003c/p\u003e\n\u003cp\u003eBut there was a wild snarling in her ear and a trail of hot pain down her back. Animal claws. There was\u003c/p\u003e\n\u003cp\u003ea wolf on top of her.\u003c/p\u003e\n\u003cp\u003eRudi had gotten loose.\u003c/p\u003e\n\u003cp\u003eRashel gathered herself and bucked to throw the wolf off. He slipped and she tried to roll out from under\u003c/p\u003e\n\u003cp\u003ehim, arms up to keep her throat protected. The werewolf was too heavy-and too angry. He scrambled\u003c/p\u003e\n\u003cp\u003eover her rolling body like a lumberjack on a log. His snarling muzzle kept darting for her throat in quick\u003c/p\u003e\n\u003cp\u003elunges. Rashel could see his bushy coat standing on end.\u003c/p\u003e\n\u003cp\u003eShe felt fire across her ribs-his claws had torn through her shirt. She ignored it. Her one thought was to\u003c/p\u003e\n\u003cp\u003ekeep him away from her throat. Keeping an elbow up, she reached for the knife with her other hand.\u003c/p\u003e\n\u003cp\u003eNo good. She hadn\u0027t rolled far enough. Her fingertips just missed the hilt.\u003c/p\u003e\n\u003cp\u003eAnd Rudi the wolf was right in her face. All she could see were sharp wet teeth, black gums, and blazing\u003c/p\u003e\n\u003cp\u003eyellow eyes. Her face was misted with hot canine breath.\u003c/p\u003e\n\u003cp\u003eEvery snap of those jaws made a hollow glunk. Rashel only had one option left-to block each lunge as it\u003c/p\u003e\n\u003cp\u003ecame. But she couldn\u0027t keep that up forever. She was already tiring.\u003c/p\u003e\n\u003cp\u003eIt\u0027s over, she thought. The girls who might have helped her-Daphne and Nyala and Annelise were at the\u003c/p\u003e\n\u003cp\u003efar end of the wharf or on the boats. The other girls were undoubtedly too scared even to try. Rashel was\u003c/p\u003e\n\u003cp\u003ealone, and she was going to die very soon. My own stupid fault, she thought dimly. Her arms were\u003c/p\u003e\n\u003cp\u003eshaking and bloodied. She was getting weaker fast. And the wolf knew.\u003c/p\u003e\n\u003cp\u003eEven as she thought it, she missed a block.\u003c/p\u003e\n\u003cp\u003eHer arm slipped sideways. Her throat was exposed. In slow motion she saw the jaws of the wolf\u003c/p\u003e\n\u003cp\u003eopening wide, driving toward her. She saw the triumph in those yellow eyes. She knew, with a curious\u003c/p\u003e\n\u003cp\u003esense of resignation, that the next thing she would feel was teeth ripping through her flesh. The oldest way\u003c/p\u003e\n\u003cp\u003eto die in the world.\u003c/p\u003e\n\u003cp\u003eI\u0027m sorry, Daphne, she thought. I\u0027m sorry, Nyala. Please go and be safe.\u003c/p\u003e\n\u003cp\u003eAnd then everything seemed to freeze.\u003c/p\u003e\n\u003cp\u003eThe wolf stopped in midlunge, head jerking backward. Its eyes were wide and fixed. Its jaws were open\u003c/p\u003e\n\u003cp\u003ebut not moving. It looked as if it might howl.\u003c/p\u003e\n\u003cp\u003eBut it didn\u0027t. It collapsed in a hot quivering heap on top of Rashel, legs stiff. Rashel scrambled out from\u003c/p\u003e\n\u003cp\u003eunder it automatically.\u003c/p\u003e\n\u003cp\u003eAnd saw her knife sticking out of the base of its skull.\u003c/p\u003e\n\u003cp\u003eQuinn was standing above it.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003eHe was breathing quickly, but he looked calm. Moonlight shone on his black hair.\u003c/p\u003e\n\u003cp\u003eThe entire world was huge and quivering and oddly bright. Rashel still felt as if she were moving in slow\u003c/p\u003e\n\u003cp\u003emotion.\u003c/p\u003e\n\u003cp\u003eShe stared at Quinn, then looked toward the wharf.\u003c/p\u003e\n\u003cp\u003eGirls were scattered all over, as if frozen in the\u003c/p\u003e\n\u003cp\u003emiddle of running in different directions. Some were on the decks of the two remaining boats. Some\u003c/p\u003e\n\u003cp\u003ewere heading toward her. Daphne and Nyala were only fifteen feet away, but they were both staring at\u003c/p\u003e\n\u003cp\u003eQuinn and seemed riveted in place. Nyala\u0027s expression was one of horror, hate-and recognition.\u003c/p\u003e\n\u003cp\u003eWaves hissed softly against the dock.\u003c/p\u003e\n\u003cp\u003eThink. Now think, girl, Rashel told herself. She was in a state of the strangest and most expanded\u003c/p\u003e\n\u003cp\u003econsciousness she\u0027d ever felt. Her hands were icy cold and she seemed to be floating-but her mind was\u003c/p\u003e\n\u003cp\u003eclear.\u003c/p\u003e\n\u003cp\u003eEverything depended on how she handled the next few minutes.\u003c/p\u003e\n\u003cp\u003e\"Why did you do that?\" she asked Quinn softly. At the same time she shot Daphne the fastest and the\u003c/p\u003e\n\u003cp\u003emost intense look of her life. It meant Go now. She willed Daphne to understand.\u003c/p\u003e\n\u003cp\u003e\"You just lost a guard,\" she went on, getting up slowly.\u003c/p\u003e\n\u003cp\u003eKeep his eyes on you. Keep moving. Make him talk.\u003c/p\u003e\n\u003cp\u003e\"Not a very good one,\" Quinn said, looking with fastidious disgust at the heap of fur.\u003c/p\u003e\n\u003cp\u003eGo, Daphne, run, Rashel thought. She knew the girls still had a chance. There were no other vampires\u003c/p\u003e\n\u003cp\u003ecoming down the path. That meant that Rudi had either been too angry to give a general alarm or too\u003c/p\u003e\n\u003cp\u003escared. That was one good thing about werewolves-they acted on impulse.\u003c/p\u003e\n\u003cp\u003eQuinn was the danger now.\u003c/p\u003e\n\u003cp\u003e\"Why not a good one?\" she asked. \"Because he damaged the merchandise?\" She lifted her torn shirt\u003c/p\u003e\n\u003cp\u003eaway from her ribs.\u003c/p\u003e\n\u003cp\u003eQuinn threw back his head and laughed. Something jerked in Rashel\u0027s chest, but she used the moment to\u003c/p\u003e\n\u003cp\u003echange her position. She was right by the wolf now, with her left hand at the exact level of the knife.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right,\" Quinn said. A wild and bitter smile still played around his lips. \"He was presumptuous.\u003c/p\u003e\n\u003cp\u003eYou almost surrendered to the wrong darkness there, Shelly. By the way, where\u0027d you get a silver\u003c/p\u003e\n\u003cp\u003eknife?\"\u003c/p\u003e\n\u003cp\u003eHe doesn\u0027t know who I am, Rashel thought. She felt both relief and a strange underlying grief. He still\u003c/p\u003e\n\u003cp\u003ethought she was some girl from the club- maybe a vampire hunter, but not the vampire hunter. The one\u003c/p\u003e\n\u003cp\u003ehe\u0027d admitted was good.\u003c/p\u003e\n\u003cp\u003eSo he\u0027s unprepared. He\u0027s off his guard.\u003c/p\u003e\n\u003cp\u003eIf I can kill him with one stroke, before he calls to the other vampires, the girls may get away.\u003c/p\u003e\n\u003cp\u003eShe glanced at the wharf again, deliberately, hoping to draw his gaze. But he didn\u0027t look behind him, and\u003c/p\u003e\n\u003cp\u003eDaphne and the other stupid girls weren\u0027t leaving.\u003c/p\u003e\n\u003cp\u003eRefusing to go without her. Idiots!\u003c/p\u003e\n\u003cp\u003eNow or never, Rashel thought.\u003c/p\u003e\n\u003cp\u003e\"Well, anyway,\" she said, \"I think you saved my life. Thank you.\"\u003c/p\u003e\n\u003cp\u003eKeeping her eyes down, she held out her hand.\u003c/p\u003e\n\u003cp\u003eher right hand. Quinn looked surprised, then reached out automatically.\u003c/p\u003e\n\u003cp\u003eWith one smooth motion, like a snake uncoiling, Rashel attacked.\u003c/p\u003e\n\u003cp\u003eHer right hand drove past his hand and clamped on his wrist. Her left hand plunged down to grab the\u003c/p\u003e\n\u003cp\u003eknife. Her fingers closed on the hilt and pulled- and the sheath with its attached silver blade stayed in the\u003c/p\u003e\n\u003cp\u003ewerewolf\u0027s neck.\u003c/p\u003e\n\u003cp\u003eJust as she\u0027d planned. The knife itself came free, the real knife, the one made of wood.\u003c/p\u003e\n\u003cp\u003eAnd then Quinn tried to throw her and her body responded automatically. She was moving without\u003c/p\u003e\n\u003cp\u003econscious direction, anticipating his attacks and blocking them even as he started to make them. It\u003c/p\u003e\n\u003cp\u003etransformed the fight into a dance. Faster than thought, graceful as a lioness, she countered every move\u003c/p\u003e\n\u003cp\u003ehe made.\u003c/p\u003e\n\u003cp\u003eZanshin to the max.\u003c/p\u003e\n\u003cp\u003eShe ended up straddling him with her knife at his throat.\u003c/p\u003e\n\u003cp\u003eNow. Fast. End it.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t move.\u003c/p\u003e\n\u003cp\u003eYou have to, she told herself. Quick, before he calls the others. Before he knocks you out telepathically.\u003c/p\u003e\n\u003cp\u003eHe can do it, you know that.\u003c/p\u003e\n\u003cp\u003eThen why isn\u0027t he trying?\u003c/p\u003e\n\u003cp\u003eQuinn lay still, with the point of the wooden knife in the hollow of his throat, just where his dark collar\u003c/p\u003e\n\u003cp\u003eparted. His throat was pale in the moonlight and his hair was black against the sand.\u003c/p\u003e\n\u003cp\u003eFootsteps sounded behind Rashel. She heard rapid light breathing.\u003c/p\u003e\n\u003cp\u003e\"Daphne, take the boats and go now. Leave me here. Do you understand?\" Rashel spoke every word\u003c/p\u003e\n\u003cp\u003edistinctly.\u003c/p\u003e\n\u003cp\u003e\"But Rashel-\"\u003c/p\u003e\n\u003cp\u003e\"Do it now!\" Rashel put a force she hadn\u0027t known she had behind the words. She heard the quick intake\u003c/p\u003e\n\u003cp\u003eof Daphne\u0027s breath, then footsteps scampering off.\u003c/p\u003e\n\u003cp\u003eAll the while, she hadn\u0027t taken her eyes off Quinn.\u003c/p\u003e\n\u003cp\u003eLike everything else, the green-black blade of her knife was touched with moonlight. It seemed to\u003c/p\u003e\n\u003cp\u003eshimmer almost liquidly. Lignum vitae, the Wood of Life. It would be death for him. One thrust would put\u003c/p\u003e\n\u003cp\u003eit through his throat. The next would stop his heart.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Rashel whispered.\u003c/p\u003e\n\u003cp\u003eShe was. She was truly sorry that this had to be done. But there was no way out. It was for Nyala, for\u003c/p\u003e\n\u003cp\u003eall the girls he\u0027d kidnapped and hunted and lured. It was to keep girls like them safe for the future.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a hunter,\" Rashel said softly, trying for steadiness. \"So am I. We both understand. This is the\u003c/p\u003e\n\u003cp\u003eway it goes. It\u0027s kill or be killed. It all comes down to that in the end.\" She paused to breathe.\u003c/p\u003e\n\u003cp\u003e\"Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"If I don\u0027t stop you, you\u0027ll be a danger forever.\u003c/p\u003e\n\u003cp\u003eAnd I can\u0027t let that happen. I can\u0027t let you hurt anyone else.\" She was aware that she was shaking her\u003c/p\u003e\n\u003cp\u003ehead slightly in her attempt to explain to him. Her lungs ached and there were tears in her eyes. \"I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eQuinn didn\u0027t speak. His eyes were black and bottomless. His hair was slightly mussed on his forehead,\u003c/p\u003e\n\u003cp\u003ebut he didn\u0027t show any other sign of just having been in a fight.\u003c/p\u003e\n\u003cp\u003eHe\u0027s not going to struggle, Rashel realized.\u003c/p\u003e\n\u003cp\u003eThen make it quick and merciful. No need for him to feel the pain of wood through his throat. She\u003c/p\u003e\n\u003cp\u003eswitched her grip on the knife, raising it over his chest. Holding it with both hands, poised above his\u003c/p\u003e\n\u003cp\u003eheart. One swift downward stroke and it would be over.\u003c/p\u003e\n\u003cp\u003eFor the first time since she had killed a Night Person, she didn\u0027t say what she always said. She wasn\u0027t the\u003c/p\u003e\n\u003cp\u003eCat right now; this wasn\u0027t revenge for her. It was necessity.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she whispered, and shut her eyes.\u003c/p\u003e\n\u003cp\u003eHe whispered, \"This kitten has claws.\"\u003c/p\u003e\n\u003cp\u003eRashel\u0027s muscles locked.\u003c/p\u003e\n\u003cp\u003eHer eyes opened.\u003c/p\u003e\n\u003cp\u003e\"Go on,\" Quinn said. \"Do it. You should have done it the first time.\" His gaze was as steady as Fayth\u0027s.\u003c/p\u003e\n\u003cp\u003eShe could see moonlight in his eyes.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t look wild, or bitter, or mocking. He only looked serious and a little tired.\u003c/p\u003e\n\u003cp\u003e\"I should have realized it before-that you were the one in the cellar. I knew there was something\u003c/p\u003e\n\u003cp\u003eabout you. I just couldn\u0027t figure out what. At least now I\u0027ve seen your face.\"\u003c/p\u003e\n\u003cp\u003eRashel\u0027s arms wouldn\u0027t come down.\u003c/p\u003e\n\u003cp\u003eWhat was wrong with her? Her resolve was draining away. Her whole body was weak. She felt herself\u003c/p\u003e\n\u003cp\u003ebegin to tremble, and realized to her horror she couldn\u0027t stop it.\u003c/p\u003e\n\u003cp\u003e\"Everything you said was true,\" he said. \"This is how it has to end.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Something had swollen in Rashel\u0027s throat and it hurt.\u003c/p\u003e\n\u003cp\u003e\"The only other possibility is that I kill you. Better this way than that.\" He looked exhausted suddenly-or\u003c/p\u003e\n\u003cp\u003esick. He turned his head and shut his eyes.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Rashel said numbly. He believed that?\u003c/p\u003e\n\u003cp\u003e\"Besides, now that I have seen your face, I can\u0027t stand the sight of myself in your eyes. I know what you\u003c/p\u003e\n\u003cp\u003ethink of me.\"\u003c/p\u003e\n\u003cp\u003eRashel\u0027s arms dropped.\u003c/p\u003e\n\u003cp\u003eBut limply. The blade pointed upward, between her own wrists. She sat there with her knuckles on his\u003c/p\u003e\n\u003cp\u003echest and stared at a scraggly wild raspberry bush growing out of the cliff.\u003c/p\u003e\n\u003cp\u003eShe had failed Nyala, and Nyala\u0027s sister, and countless other people. Other humans. When it really\u003c/p\u003e\n\u003cp\u003ecounted, she was letting them all down.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t kill you,\" she whispered. \"God help me, I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head once, eyes still shut. She was open to attack, but he didn\u0027t do anything.\u003c/p\u003e\n\u003cp\u003eThen he looked at her. \"I told you before. You\u0027re an idiot.\"\u003c/p\u003e\n\u003cp\u003eRashel hit him under the jaw the way she\u0027d hit the guard. The hilt of her dagger caught him squarely. He\u003c/p\u003e\n\u003cp\u003edidn\u0027t move to avoid the blow.\u003c/p\u003e\n\u003cp\u003eIt knocked him out cold.\u003c/p\u003e\n\u003cp\u003eRashel wiped her cheeks and got up, looking around for something to tie him with. Her whole life was\u003c/p\u003e\n\u003cp\u003etorn to pieces, falling around her. She didn\u0027t understand anything. All she could do was try to finish what\u003c/p\u003e\n\u003cp\u003eshe\u0027d come here for.\u003c/p\u003e\n\u003cp\u003eAction, that was what she needed. Thought could wait. It would have to wait.\u003c/p\u003e\n\u003cp\u003eThen she glanced at the wharf.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t believe it. It seemed as if at least a week had passed since she yelled at Daphne, and they\u003c/p\u003e\n\u003cp\u003ewere all still here.\u003c/p\u003e\n\u003cp\u003eThe boats were here, the girls were here, and Daphne was running toward her.\u003c/p\u003e\n\u003cp\u003eRashel strode to meet her. She grabbed Daphne by the shoulders and shook hard.\u003c/p\u003e\n\u003cp\u003e\"Get-out-of-here! Do you understand? What do I have to do, throw you in the water?\"\u003c/p\u003e\n\u003cp\u003eDaphne\u0027s eyes were huge and blue. Her blond hair flew like thistledown with the shaking. When Rashel\u003c/p\u003e\n\u003cp\u003estopped, she gasped, \"But you can come with us now!\"\u003c/p\u003e\n\u003cp\u003e\"No, I can\u0027t! I still have things to do.\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\" Then Daphne\u0027s eyes darted to the cliff. She stared at Rashel. \"You\u0027re going after them?\u003c/p\u003e\n\u003cp\u003eYou\u0027re crazy!\" Looking frightened, she grabbed Rashel\u0027s hands on her shoulders. \"Rashel, there are\u003c/p\u003e\n\u003cp\u003esupposed to be eight of them, right? Plus Lily and Ivan and who knows what else! You really think you\u003c/p\u003e\n\u003cp\u003ecan kill them all? What, are they all just going to line up?\"\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t know. But I don\u0027t need to kill them all. If I can get the guy who set this up, the client, it will\u003c/p\u003e\n\u003cp\u003ebe worth it.\"\u003c/p\u003e\n\u003cp\u003eDaphne was shaking her head, in tears. \"It won\u0027t be worth it! Not if they kill you-which they will. You\u0027re\u003c/p\u003e\n\u003cp\u003ealready hurt-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll be worth it if I can stop him from doing this again,\" Rashel said quietly. She couldn\u0027t yell anymore.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t have the strength. Her voice was quenched, but she held Daphne\u0027s eyes. \"Now get somebody\u003c/p\u003e\n\u003cp\u003eto throw me some rope or something to tie these guys with. And then leave. No, give me five minutes to\u003c/p\u003e\n\u003cp\u003eget to the top of the cliff. Six minutes. That way maybe I can surprise them before they realize you\u0027re\u003c/p\u003e\n\u003cp\u003egone.\"\u003c/p\u003e\n\u003cp\u003eDaphne was crying steadily now. Before she could say anything, Rashel went on. \"Daphne, any minute\u003c/p\u003e\n\u003cp\u003enow they could realize that. Someone\u0027s bound to check the cellar before midnight. Every second we\u003c/p\u003e\n\u003cp\u003estand here could make the difference. Please, please, don\u0027t fight me anymore.\"\u003c/p\u003e\n\u003cp\u003eDaphne opened her mouth, then shut it. Her eyes were desolate. \"Please try to take care of yourself,\"\u003c/p\u003e\n\u003cp\u003eshe whispered. She let go of Rashel\u0027s shoulders and hugged her hard. \"We all know you\u0027re doing it for\u003c/p\u003e\n\u003cp\u003eus. I\u0027m proud to be your friend.\"\u003c/p\u003e\n\u003cp\u003eThen she turned and ran, herding the others ^^ toward the boats.\u003c/p\u003e\n\u003cp\u003eA moment later she threw Rashel two pieces of line. Rashel tied up Quinn first, then the werewolf.\u003c/p\u003e\n\u003cp\u003e\"Six minutes,\" she said to Daphne. Daphne nodded, trying not to cry.\u003c/p\u003e\n\u003cp\u003eRashel wouldn\u0027t say goodbye. She hated that. Even though she knew perfectly well that she was never\u003c/p\u003e\n\u003cp\u003egoing to see Daphne again.\u003c/p\u003e\n\u003cp\u003eWithout looking back, she loped up the hiking trail.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-13.html","bookId":2079,"creation":"Oct 5, 2019 5:30:52 PM","modification":"Oct 5, 2019 5:30:52 PM"}
