{"id":88716,"no":15,"title":"Page 15","content":"\u003cp\u003eThe sound of her own voice sent Rashel spinning out of the light.\u003c/p\u003e\n\u003cp\u003eIt was as if she were emerging from deep water- from one world into another. Or as if she were\u003c/p\u003e\n\u003cp\u003ere-entering her own body. For a moment everything was confusion, and Rashel wasn\u0027t sure of where she\u003c/p\u003e\n\u003cp\u003ewas or how she was positioned... and then she felt her arms and legs and saw yellow light. Lamplight.\u003c/p\u003e\n\u003cp\u003eShe was in an upstairs room in a mansion on a private island, and Quinn was holding her.\u003c/p\u003e\n\u003cp\u003eThey had somehow ended up on the floor, half kneeling, half supported by the wall, their arms around\u003c/p\u003e\n\u003cp\u003eeach other, Rashel\u0027s head on his shoulder. She had no idea when he\u0027d stopped biting her. She also had\u003c/p\u003e\n\u003cp\u003eno idea how much time had passed.\u003c/p\u003e\n\u003cp\u003eShe coughed a little, shaken by what had just happened. That other place, with the light-it still seemed\u003c/p\u003e\n\u003cp\u003emore real than the hard shiny boards of the floor underneath her and the white walls of the room. But it\u003c/p\u003e\n\u003cp\u003ealso seemed encased in its own reality. Like a dream. She didn\u0027t know if they would ever be able to get\u003c/p\u003e\n\u003cp\u003eback there again.\u003c/p\u003e\n\u003cp\u003e\"Quinn?\" He was Quinn again. Not John.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what happened? I mean, do you understand it?\"\u003c/p\u003e\n\u003cp\u003e\"I think,\" he said, and his voice was gentle and precise, \"that sharing blood can strengthen a telepathic\u003c/p\u003e\n\u003cp\u003ebond. I\u0027ve always been able to block it out when I fed before, but...\" He didn\u0027t finish.\u003c/p\u003e\n\u003cp\u003e\"But it happened that other time. Or something like it happened. When I first met you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Well. Well, I think it\u0027s... there\u0027s something called...\" He gave up and resorted to nonverbal\u003c/p\u003e\n\u003cp\u003ecommunication. There\u0027s something called the soulmate principle. I\u0027ve never believed in it. I\u0027ve laughed at\u003c/p\u003e\n\u003cp\u003epeople who talked about it. I would have bet my life that-\u003c/p\u003e\n\u003cp\u003e\"What is it, Quinn?\" Rashel had heard of it, too, especially recently. But it wasn\u0027t something from her\u003c/p\u003e\n\u003cp\u003eworld, and she wanted a Night Person to explain.\u003c/p\u003e\n\u003cp\u003eIt\u0027s the idea that everyone has one and just one soul-mate in the world, and that if you find them, you\u003c/p\u003e\n\u003cp\u003erecognize them immediately. And... well, that\u0027s that.\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s not supposed to happen between humans and Night People. Right?\"\u003c/p\u003e\n\u003cp\u003eThere are some people who think that it is happening-now-for some reason-especially between humans\u003c/p\u003e\n\u003cp\u003eand Night People. The Redferns seem to be getting it in particular. There was a pause, then Quinn said\u003c/p\u003e\n\u003cp\u003ealoud, \"I should probably apologize to some of them, actually.\" He sounded bemused.\u003c/p\u003e\n\u003cp\u003eRashel sat up, which was difficult. She didn\u0027t want to let go of Quinn. He kept hold of her fingers, which\u003c/p\u003e\n\u003cp\u003ehelped a little.\u003c/p\u003e\n\u003cp\u003eHe looked more mussed than he had down near the wharf, his neat hair disordered, his eyes large and\u003c/p\u003e\n\u003cp\u003edark and dazed. She met his gaze directly. \"You think we\u0027re soulmates?\"\u003c/p\u003e\n\u003cp\u003e\"Well.\" He blinked. \"Do you have a better explanation?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She took a breath. \"Do you still want to make me a vampire?\"\u003c/p\u003e\n\u003cp\u003eHe stared at her, and something flamed and then fell in pain in his eyes. For an instant he looked as if\u003c/p\u003e\n\u003cp\u003eshe\u0027d hit him-then all she could see was regret. \"Oh, Rashel\" In one motion he caught her and held her.\u003c/p\u003e\n\u003cp\u003eHis face was pressed to her hair. She could feel him breathing like some stricken creature-and then she\u003c/p\u003e\n\u003cp\u003efelt him regain control, grabbing discipline from somewhere, wrapping himself in it. He rested his chin on\u003c/p\u003e\n\u003cp\u003eher head. \"I\u0027m sorry you have to ask that, but I understand. I don\u0027t want to make you a vampire. I want-\"\u003c/p\u003e\n\u003cp\u003eI want you to be what you were two minutes ago. That happy, that idealistic....\u003c/p\u003e\n\u003cp\u003eHe sounded as if it were something that had been lost forever.\u003c/p\u003e\n\u003cp\u003eBut Rashel felt a new happiness, and a new confidence. He had changed. She could sense how much he\u003c/p\u003e\n\u003cp\u003ehad changed already. They were in the real world, and he wasn\u0027t raving about needing to kill her, or her\u003c/p\u003e\n\u003cp\u003eneeding to kill him.\u003c/p\u003e\n\u003cp\u003e\"I just wanted to be sure,\" she said. She tightened her own arms around him. \"I don\u0027t know what\u0027s going\u003c/p\u003e\n\u003cp\u003eto happen-but as long as we\u0027re right together, I think I can face it.\"\u003c/p\u003e\n\u003cp\u003eI think we live or die together from now on, Quinn said simply.\u003c/p\u003e\n\u003cp\u003eYes, Rashel thought. She could still feel lingering sadness in Quinn, and confusion in herself, but they\u003c/p\u003e\n\u003cp\u003ewere right together. She didn\u0027t need to doubt him anymore.\u003c/p\u003e\n\u003cp\u003eThey trusted each other.\u003c/p\u003e\n\u003cp\u003e\"We have to do something about the people downstairs,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But we can\u0027t kill them.\"\u003c/p\u003e\n\u003cp\u003e\"No. There\u0027s been enough killing. It has to stop.\" Quinn sounded like a swimmer who\u0027d been tumbling in\u003c/p\u003e\n\u003cp\u003ea riptide, and whose feet had finally found solid ground.\u003c/p\u003e\n\u003cp\u003eRashel sat up to look at him. \"But we can\u0027t just let them walk out of here. What if they try it again? I\u003c/p\u003e\n\u003cp\u003emean, whoever set this bloodfeast up...\" She suddenly realized that she had asked everybody else, but\u003c/p\u003e\n\u003cp\u003enot him. \"Quinn, who did set this up?\"\u003c/p\u003e\n\u003cp\u003eHe smiled, a faint echo of his old savage smile. Now it was grim and self-mocking. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know?\"\u003c/p\u003e\n\u003cp\u003e\"Some vampire who wanted to get the made\u003c/p\u003e\n\u003cp\u003evampires together. But I\u0027ve never met him. Lily was the go-between, but I\u0027m not sure she knows either.\u003c/p\u003e\n\u003cp\u003eShe only spoke to him on the phone. Neither of us asked a lot of questions. We were doing it for the\u003c/p\u003e\n\u003cp\u003emoney.\" He said it flatly, not sparing himself.\u003c/p\u003e\n\u003cp\u003eAnd to be rebellious, Rashel thought. To be as bad and as damned as possible, because you figured you\u003c/p\u003e\n\u003cp\u003emight as well. She said, \"Whoever it is might just go somewhere else and find somebody else to get his\u003c/p\u003e\n\u003cp\u003eslaves for him. Those seven guys could be having a new bloodfeast next month.\"\u003c/p\u003e\n\u003cp\u003e\"That has to be stopped, too,\" Quinn said. \"How to stop it without violence, that\u0027s the question.\" His\u003c/p\u003e\n\u003cp\u003efingers were still tight on Rashel\u0027s, but he was staring into the distance, lost in grim and competent\u003c/p\u003e\n\u003cp\u003ethought.\u003c/p\u003e\n\u003cp\u003eIt was a new side of Quinn. Rashel had seen him in almost every mood from despairing to manic, but she\u003c/p\u003e\n\u003cp\u003ehad never worked with him before. Now she realized that he was going to make a strong and resourceful\u003c/p\u003e\n\u003cp\u003eSuddenly Quinn seemed to focus.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got it,\" he said. He smiled suddenly, mocking but without the bitterness. \"When violence won\u0027t\u003c/p\u003e\n\u003cp\u003ework, there\u0027s no other choice but to try persuasion.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not funny.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not meant to be.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to say, \u0027Please don\u0027t kill any more young girls\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to say, \u0027Please don\u0027t kill any more\u003c/p\u003e\n\u003cp\u003eyoung girls or I\u0027ll report you to the Joint Council.\u0027 Listen, Rashel.\" He took her by the arms, his eyes\u003c/p\u003e\n\u003cp\u003eflashing with excitement. \"I have some authority in the Night World-I\u0027m the Redfern heir. And Hunter\u003c/p\u003e\n\u003cp\u003eRedfern has more. Between us, we can make all kinds of trouble for these made vampires.\" \"But Fayth-a\u003c/p\u003e\n\u003cp\u003efriend of mine-said they were all so powerful.\" In the intensity of the moment, Rashel almost missed the\u003c/p\u003e\n\u003cp\u003efact that she\u0027d just called Fayth her friend.\u003c/p\u003e\n\u003cp\u003eQuinn was shaking his head. \"No, you have to understand. These aren\u0027t rogues, they\u0027re Night World\u003c/p\u003e\n\u003cp\u003ecitizens. And what they\u0027re doing is completely illegal. You can\u0027t just kill a bunch of girls from one area\u003c/p\u003e\n\u003cp\u003ewithout permission. Slavery\u0027s illegal, bloodfeasts are illegal. And no matter how powerful they are, they\u003c/p\u003e\n\u003cp\u003ecan\u0027t stand up against the Night World Council.\" \"But-\"\u003c/p\u003e\n\u003cp\u003e\"We threaten them with exposure to the Council. With exposure to Hunter Redfern-and to the lamia.\u003c/p\u003e\n\u003cp\u003eThe lamia will go crazy at the thought of made vampires getting together in some kind of alliance. They\u0027ll\u003c/p\u003e\n\u003cp\u003etake it as a threat of civil war.\"\u003c/p\u003e\n\u003cp\u003eIt might work, Rashel was thinking. The made vampires were just individuals-they\u0027d be up against whole\u003c/p\u003e\n\u003cp\u003elamia families. Especially against the Redfern family, the oldest and most respected clan\u003c/p\u003e\n\u003cp\u003eof vampires. \"Everybody\u0027s scared of Hunter Redfern,\" she said slowly.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s got tremendous influence. He practically owns the Council. He could run them out of the Night\u003c/p\u003e\n\u003cp\u003eWorld if he wanted. I think they\u0027ll listen.\"\u003c/p\u003e\n\u003cp\u003e\"You really do think of him as a father, don\u0027t you?\" Rashel said, her voice soft. She searched Quinn\u0027s\u003c/p\u003e\n\u003cp\u003eeyes. \"Whatever you say about hating him-you respect him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not as bad as most. He has... honor, I guess. Usually.\"\u003c/p\u003e\n\u003cp\u003eAnd he\u0027s a New Englander, Rashel thought. That means he\u0027s against vice. She considered another\u003c/p\u003e\n\u003cp\u003emoment, then she nodded. Her heart was beating fast, but she could feel a smile breaking on her face.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s try persuasion.\"\u003c/p\u003e\n\u003cp\u003eThey stood-and then they paused a moment, looking at each other. We\u0027re strong, Rashel thought. We\u0027ve\u003c/p\u003e\n\u003cp\u003egot unity. If anyone can do this, we can.\u003c/p\u003e\n\u003cp\u003eShe picked up her knife almost absent-mindedly. It was a piece of art, a valued possession, and she\u003c/p\u003e\n\u003cp\u003edidn\u0027t want to lose it.\u003c/p\u003e\n\u003cp\u003eThey walked down the stairs side by side. Music was still blasting from the gathering room at the end of\u003c/p\u003e\n\u003cp\u003ethe hall. It hadn\u0027t been that long, Rashel realized. The whole world had changed since she\u0027d been in this\u003c/p\u003e\n\u003cp\u003ehallway-but somehow it had all happened in minutes.\u003c/p\u003e\n\u003cp\u003eNow, Quinn said silently before they went in. There shouldn\u0027t be any danger-/ don\u0027t think they\u0027ll be\u003c/p\u003e\n\u003cp\u003estupid enough to attack me-but be alert anyway.\u003c/p\u003e\n\u003cp\u003eRashel nodded. She felt cool and businesslike, and she thought she was perfectly rational. It was only\u003c/p\u003e\n\u003cp\u003elater that she realized they had walked into the room like little lambs into the tiger\u0027s lair, still dizzy and\u003c/p\u003e\n\u003cp\u003ereeling from the discovery of love.\u003c/p\u003e\n\u003cp\u003eQuinn went in first and she could hear voices stop as he did. Then she was walking through the door,\u003c/p\u003e\n\u003cp\u003einto that ruddy flickering room with shadows dancing on the walls.\u003c/p\u003e\n\u003cp\u003eAnd there they were again, those handsome young guys who looked like a TV-series ensemble. They\u003c/p\u003e\n\u003cp\u003ewere looking at Quinn with various expressions of interest and surprise. When they saw her, the\u003c/p\u003e\n\u003cp\u003eexpressions sharpened to pleasure and inquiry. \"Hey, Quinn!\" \"Hi there, Quinn.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ve arrived at last. You\u0027ve kept us waiting long enough.\" That from the dark one who was\u003c/p\u003e\n\u003cp\u003elooking at his watch. Quinn said, \"Turn off the music.\" Someone went to a built-in mahogany cabinet and\u003c/p\u003e\n\u003cp\u003eturned off an expensive stereo.\u003c/p\u003e\n\u003cp\u003eQuinn was looking around the room, as if to appraise each of them. \"Campbell,\" he said, nodding\u003c/p\u003e\n\u003cp\u003eslightly. \"Radhu. Azarius. Max.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re the one who brought us here,\" Campbell said. He had rusty hair and a sleepy smile. \"We\u0027ve\u003c/p\u003e\n\u003cp\u003eall been dying to find out.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that?\" someone else added, peering at Rashel. \"The first course?\"\u003c/p\u003e\n\u003cp\u003eQuinn smiled fractionally, with a look that made the guy who\u0027d asked step backward. \"No, she\u0027s not\u003c/p\u003e\n\u003cp\u003ethe first course,\" he said softly. \"In fact, unfortunately, all the courses have disappeared.\"\u003c/p\u003e\n\u003cp\u003eThere was a silence. Everyone stared at him. Then the guy with the silver-blond hair said, \"What?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve all-just-disappeared.\" Quinn made an expressive gesture. \"Escaped. Vanished.\"\u003c/p\u003e\n\u003cp\u003eAnother silence. Rashel didn\u0027t like this one. She was beginning to get an odd impression from the group,\u003c/p\u003e\n\u003cp\u003eas if she were in a room, not with people, but with animals that had been kept past their feeding time.\u003c/p\u003e\n\u003cp\u003e\"What the hell are you talking about?\" the dark one, the one Quinn had called Azarius, said tightly.\u003c/p\u003e\n\u003cp\u003e\"What kind of joke is this?\" Campbell added.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a joke. The girls who were brought for the bloodfeast are gone,\" Quinn said slowly and\u003c/p\u003e\n\u003cp\u003edistinctly, just in case anybody hadn\u0027t gotten it yet. Then he said, \"And as a matter of fact, it\u0027s a good\u003c/p\u003e\n\u003cp\u003ething.\"\u003c/p\u003e\n\u003cp\u003e\"A good thing? Quinn, we\u0027re starving.\"\u003c/p\u003e\n\u003cp\u003e\"They can\u0027t have gone too far,\" the silver blond said. \"After all, it\u0027s an island. Let\u0027s go and-\" \"Nobody\u0027s\u003c/p\u003e\n\u003cp\u003egoing anywhere,\" Quinn said. Rashel\u003c/p\u003e\n\u003cp\u003emoved closer to him. She was still nervous. These guys were on the edge of getting out of control. But\u003c/p\u003e\n\u003cp\u003eshe trusted Quinn, and she could tell they\u003c/p\u003e\n\u003cp\u003ewere afraid of him. And, she told herself, they\u0027ll be\u003c/p\u003e\n\u003cp\u003eeven more afraid in a minute. \"Look, Quinn, if you brought us here to-\" \"I didn\u0027t bring you here. In fact, I\u003c/p\u003e\n\u003cp\u003edon\u0027t know who brought you here, but it doesn\u0027t matter. I\u0027ve got the same thing to say to all of you. There\u003c/p\u003e\n\u003cp\u003eisn\u0027t going to be any bloodfeast, now or ever. And anybody who objects to that can take their problem\u003c/p\u003e\n\u003cp\u003eto the Council.\"\u003c/p\u003e\n\u003cp\u003eThat shut everyone up. They simply stared at Quinn. It was clearly the last thing they expected.\u003c/p\u003e\n\u003cp\u003e\"In fact, if you don\u0027t want the Council to hear about this, I\u0027d advise everybody to go home quietly and\u003c/p\u003e\n\u003cp\u003epretend it never happened. And to have a headache the next time anybody asks you to a bloodfeast.\"\u003c/p\u003e\n\u003cp\u003eThis silence was broken by somebody muttering, \"You dirty...\"\u003c/p\u003e\n\u003cp\u003eMeanwhile, Rashel\u0027s mind had begun to tick. Just how were these guys going to go home quietly? There\u003c/p\u003e\n\u003cp\u003eweren\u0027t any boats. Unless the host brought one when he came-if he came. And where was he, anyway?\u003c/p\u003e\n\u003cp\u003eAnd where was Lily?\u003c/p\u003e\n\u003cp\u003e\"Quinn,\" she said softly.\u003c/p\u003e\n\u003cp\u003eBut somebody else was speaking. \"You\u0027d tell the Council?\" a lean tough-looking guy with brown hair\u003c/p\u003e\n\u003cp\u003easked.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027d let Hunter Redfern tell the Council,\" Quinn said. \"And I don\u0027t really think you want that. He\u003c/p\u003e\n\u003cp\u003emight put it in a bad light. Raise your hands everybody who thinks Hunter Redfern would approve of this\u003c/p\u003e\n\u003cp\u003elittle party.\"\u003c/p\u003e\n\u003cp\u003e\"Do I get a vote?\"\u003c/p\u003e\n\u003cp\u003eThe voice came from the doorway. It was deeper than the voices of the young guys in the room. Rashel\u003c/p\u003e\n\u003cp\u003erecognized the sound of danger instinctively and turned. And later it seemed to her that even before she\u003c/p\u003e\n\u003cp\u003eturned, she knew what she would see.\u003c/p\u003e\n\u003cp\u003eA tall man standing easily, with a girl and a child behind him in the shadows. He was colored by the\u003c/p\u003e\n\u003cp\u003eflickering ruby light of the fire, but Rashel could still see that his hair was red as blood. And his eyes were\u003c/p\u003e\n\u003cp\u003eGolden like hawk\u0027s eyes, like amber. Like Lily Redfern\u0027s eyes. Why hadn\u0027t she realized that before?\u003c/p\u003e\n\u003cp\u003eThe face was a face she would never forget. It came to her every night in her dreams. It was the man\u003c/p\u003e\n\u003cp\u003ewho\u0027d killed her mother. The man who\u0027d chased her through the climbing structure, promising her ice\u003c/p\u003e\n\u003cp\u003ecream.\u003c/p\u003e\n\u003cp\u003eAll at once, Rashel was five years old again, weak and helpless and terrified.\u003c/p\u003e\n\u003cp\u003e\"Hello, Quinn,\" Hunter Redfern said.\u003c/p\u003e\n\u003cp\u003eQuinn was absolutely still beside Rashel. She had the feeling that he couldn\u0027t even think. And she\u003c/p\u003e\n\u003cp\u003eunderstood why. She\u0027d seen into his mind; she knew what Hunter represented to him. Stern necessity,\u003c/p\u003e\n\u003cp\u003eeven ruthlessness, but honor, too. And he was just now finding out that that was all a lie.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t look so upset,\" Hunter said. He stepped forward with an amiable smile. His golden eyes were\u003c/p\u003e\n\u003cp\u003efixed on Quinn; he hadn\u0027t even glanced at Rashel yet. \"There\u0027s a reason for all this.\" He gestured to the\u003c/p\u003e\n\u003cp\u003evampires in the room, and his voice was gentle, rational. \"We need allies in the Council;\u003c/p\u003e\n\u003cp\u003ethe lamia are getting too lax. Once I\u0027ve explained it all to you, you\u0027ll understand.\"\u003c/p\u003e\n\u003cp\u003eThe way he\u0027d made Quinn understand that Quinn had to be a vampire, Rashel thought. The way he\u0027d\u003c/p\u003e\n\u003cp\u003emade Quinn understand that humans were the enemy.\u003c/p\u003e\n\u003cp\u003eShe was shaking all over, but there was a white-hot fire inside her that burned through the fear.\u003c/p\u003e\n\u003cp\u003e\"Was there a reason for killing my mother?\" she said.\u003c/p\u003e\n\u003cp\u003eThe golden eyes turned toward her. Hunter looked mildly startled. Beside her, Quinn\u0027s head jerked\u003c/p\u003e\n\u003cp\u003earound.\u003c/p\u003e\n\u003cp\u003e\"I was only five, but I remember it all,\" Rashel said. She took a step closer to Hunter. \"You killed her\u003c/p\u003e\n\u003cp\u003ejust like that-snapped her neck. Was there a reason for killing Timmy? He was four years old and you\u003c/p\u003e\n\u003cp\u003edrank his blood. Was there a reason for killing my great-aunt? You set a fire to get me, but it got her.\"\u003c/p\u003e\n\u003cp\u003eShe stopped, staring into those predatory golden eyes. She\u0027d searched for this man for twelve years, and\u003c/p\u003e\n\u003cp\u003enow he didn\u0027t seem to recognize her. \"What\u0027s wrong, did you hunt too many little kids to keep track of?\"\u003c/p\u003e\n\u003cp\u003eshe said. \"Or are you so crazy you believe your own public image?\"\u003c/p\u003e\n\u003cp\u003eQuinn whispered, \"Rashel...\"\u003c/p\u003e\n\u003cp\u003eShe turned. \"I\u0027m sure. He was the one.\"\u003c/p\u003e\n\u003cp\u003eIn that instant, she saw Quinn\u0027s face harden implacably against the man who\u0027d made him a Red-fern. His\u003c/p\u003e\n\u003cp\u003eeyes went dark as black holes-no light\u003c/p\u003e\n\u003cp\u003eescaped. Rashel suddenly had the feeling of glacial cold. Look into eyes like that and what you saw\u003c/p\u003e\n\u003cp\u003ealone might kill you, she thought.\u003c/p\u003e\n\u003cp\u003eBut she had her own fire inside her, her own vengeance. The knife was in her waistband. If she could\u003c/p\u003e\n\u003cp\u003ejust get close enough.... She moved toward Hunter Redfern again. \"You destroyed my life. And you\u003c/p\u003e\n\u003cp\u003edon\u0027t even remember, do you?\" \"I remember,\" the little shadow beside him said. And then the world\u003c/p\u003e\n\u003cp\u003eflipped and Rashel felt the floor slipping away from her. The child behind Hunter was walking into the\u003c/p\u003e\n\u003cp\u003elight-and suddenly she could smell plastic and old socks, and she could feel vinyl under her hands.\u003c/p\u003e\n\u003cp\u003eMemories were flooding up so quickly that she was drowning in them.\u003c/p\u003e\n\u003cp\u003eAll she could say was \"Oh, Timmy. Oh, God, Timmy.\"\u003c/p\u003e\n\u003cp\u003eHe was standing there, just as she\u0027d seen him last, twelve years ago. Shiny dark hair and wide tilted blue\u003c/p\u003e\n\u003cp\u003eeyes. Except that the eyes weren\u0027t exactly a child\u0027s eyes. They were some strange and terrible\u003c/p\u003e\n\u003cp\u003ecombination of child and adult. There was too much knowledge in them.\u003c/p\u003e\n\u003cp\u003e\"You left me,\" Timmy said. \"You didn\u0027t care about me.\"\u003c/p\u003e\n\u003cp\u003eRashel sank her teeth into her lip, but tears spilled anyway. \"I\u0027m sorry...\"\u003c/p\u003e\n\u003cp\u003e\"Nobody cared about me,\" Timmy said. He reached up to take Hunter\u0027s sleeve. \"No humans, anyway.\u003c/p\u003e\n\u003cp\u003eHumans are vermin.\" He smiled his old sweet smile.\u003c/p\u003e\n\u003cp\u003eHunter looked down at Timmy, then up at Quinn. \"It\u0027s amazing how quickly they learn. You haven\u0027t met\u003c/p\u003e\n\u003cp\u003eTimmy, have you? He\u0027s been living in Vegas, but I think he can be useful here.\" He turned to Rashel and\u003c/p\u003e\n\u003cp\u003ehis eyes were pure evil. \"Of course I remember you. It\u0027s just that you\u0027ve changed a little; you\u0027ve gotten\u003c/p\u003e\n\u003cp\u003eolder. You\u0027re different from us, you see.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re weak,\" Lily put in. She had stepped forward, too, to stand beside her father. Now she linked\u003c/p\u003e\n\u003cp\u003eher arm in his. \"You\u0027re short-lived. You\u0027re not very bright, and not very important. In a word, you\u0027re...\u003c/p\u003e\n\u003cp\u003edinner.\"\u003c/p\u003e\n\u003cp\u003eHunter smiled. \"Well put.\" Then he dropped the smile and said to Quinn, \"Step away from her, son.\"\u003c/p\u003e\n\u003cp\u003eQuinn moved slightly, closer to Rashel. \"This is my soulmate,\" he said, in his softest and most disturbing\u003c/p\u003e\n\u003cp\u003evoice. \"And we\u0027re leaving together.\"\u003c/p\u003e\n\u003cp\u003eHunter Redfern stared at him for several long moments. Something like disbelief flickered in his eyes.\u003c/p\u003e\n\u003cp\u003eThen he recovered and said quietly, \"What a shame.\"\u003c/p\u003e\n\u003cp\u003eBehind Rashel there were noises of stirring. It was as if a hot wind from the savanna had blown in, and\u003c/p\u003e\n\u003cp\u003ethe lions had caught its scent.\u003c/p\u003e\n\u003cp\u003e\"You know, I was already worried about you, Quinn,\" Hunter said. \"Last summer you let Ash and his\u003c/p\u003e\n\u003cp\u003esisters get away with running out on the enclave. Don\u0027t think I didn\u0027t notice that. You\u0027re getting lax, getting\u003c/p\u003e\n\u003cp\u003esoft. There\u0027s too much of that going around lately.\"\u003c/p\u003e\n\u003cp\u003eStand back to back, Quinn told Rashel. She was already moving into position. The vampires were\u003c/p\u003e\n\u003cp\u003eforming a ring, encircling them. She could see smiles on every face.\u003c/p\u003e\n\u003cp\u003e\"And Lily says you\u0027ve been strange these last few days-moody. She said you seemed preoccupied with\u003c/p\u003e\n\u003cp\u003ea human girl.\"\u003c/p\u003e\n\u003cp\u003eRashel drew her knife. The vampires were watching her with the fixed attention of big felines watching\u003c/p\u003e\n\u003cp\u003etheir prey. Absolute focus.\u003c/p\u003e\n\u003cp\u003e\"But the soulmate idea-that\u0027s really the last straw. It\u0027s like a disease infecting our people. You understand\u003c/p\u003e\n\u003cp\u003ewhy I have to stamp it out.\" Hunter paused. \"For old time\u0027s sake, let\u0027s finish this quickly.\"\u003c/p\u003e\n\u003cp\u003eA voice that wasn\u0027t Quinn\u0027s added in Rashel\u0027s mind, / told you I\u0027d see you later.\u003c/p\u003e\n\u003cp\u003eRashel stood on the balls of her feet, letting Hunter\u0027s words slide off her and drip away. She couldn\u0027t\u003c/p\u003e\n\u003cp\u003ethink about him right now. She had to concentrate on awareness, open her energy, and free her mind.\u003c/p\u003e\n\u003cp\u003eThis was going to be the biggest fight of her fife, and she needed zanshin.\u003c/p\u003e\n\u003cp\u003eBut even as she found it, a small voice inside her was whispering the truth. There were simply too many\u003c/p\u003e\n\u003cp\u003evampires. She and Quinn couldn\u0027t hold them all off at once. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-15.html","bookId":2079,"creation":"Oct 5, 2019 5:30:52 PM","modification":"Oct 5, 2019 5:30:52 PM"}
