{"id":88717,"no":16,"title":"Page 16","content":"\u003cp\u003eA fighter knows instinctively when there\u0027s no chance. But Rashel planned to fight anyway.\u003c/p\u003e\n\u003cp\u003eAnd then she noticed something wrong.\u003c/p\u003e\n\u003cp\u003eThe vampires should have caught it first. Then-senses were sharper. But their senses were turned\u003c/p\u003e\n\u003cp\u003einward, focused on the victims in front of them. Rashel was the only one whose senses were turned\u003c/p\u003e\n\u003cp\u003eoutward, alert to everything but focused on nothing.\u003c/p\u003e\n\u003cp\u003eThere was a smell that was wrong and a sound. The smell was sharp, stinging, and close by. The sound\u003c/p\u003e\n\u003cp\u003ewas soft, distant, but recognizable.\u003c/p\u003e\n\u003cp\u003eGasoline. She could smell gasoline. And she could hear a faint dull roar that sounded like the fireplace in\u003c/p\u003e\n\u003cp\u003ethe gathering room-but was coming from somewhere else in the house.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t make sense. She didn\u0027t understand. But she believed it.\u003c/p\u003e\n\u003cp\u003e\"Quinn, get ready to run,\" she said, a gasp on a soft breath. Something was about to happen.\u003c/p\u003e\n\u003cp\u003eNo, we have to fight-\u003c/p\u003e\n\u003cp\u003eHis thought to her broke off. Rashel turned to look at the doorway.\u003c/p\u003e\n\u003cp\u003eHunter Redfern had moved into the gathering room-but there was someone in the hall. Then the\u003c/p\u003e\n\u003cp\u003esomeone stepped forward and Rashel could see her face.\u003c/p\u003e\n\u003cp\u003eNyala was smiling brilliantly. Her small queenly head was high and her dark eyes were flashing. She was\u003c/p\u003e\n\u003cp\u003eholding a red gasoline can in one hand and a liter of grapefruit juice in the other. The bottle was almost\u003c/p\u003e\n\u003cp\u003efull of liquid and had a burning rag stuffed in the top.\u003c/p\u003e\n\u003cp\u003eGas. Gas from the pump on the wharf, Rashel thought. A Generation-X Molotov cocktail.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all over the house,\" Nyala said, and her voice was lilting. \"Gallons and gallons. All over the rooms\u003c/p\u003e\n\u003cp\u003eand the doors.\"\u003c/p\u003e\n\u003cp\u003eBut she shouldn\u0027t be hanging on to it, Rashel thought. That bottle is going to explode.\u003c/p\u003e\n\u003cp\u003e\"You see, I am a real vampire hunter, Rashel. I figure this way, we get rid of them all at once.\"\u003c/p\u003e\n\u003cp\u003eAnd the house is already burning....\u003c/p\u003e\n\u003cp\u003eBehind the carved screen on the right side of the room, ruddy light was flickering, growing. The faint roar\u003c/p\u003e\n\u003cp\u003ethat had disturbed Rashel was louder now. Closer.\u003c/p\u003e\n\u003cp\u003eAnd everything\u0027s wood, Rashel thought. Wood paneling, wood floors. Frame house. A deathtrap for vampires.\u003c/p\u003e\n\u003cp\u003e\"Get her,\" Hunter Redfern said. But none of the vampires charged toward Nyala with her\u003c/p\u003e\n\u003cp\u003eabout-to-explode bottle of death and her can of fire accelerant. In fact, they were backing away, moving\u003c/p\u003e\n\u003cp\u003eto the perimeter of the room.\u003c/p\u003e\n\u003cp\u003eHunter spun to face Nyala directly. You need to put that down, he began in telepathic tones of absolute\u003c/p\u003e\n\u003cp\u003eauthority-at the same time Rashel shouted, \"Nyala, no-\"\u003c/p\u003e\n\u003cp\u003eThe sound of telepathy seemed to set something off in Nyala. Flashing a dazzling savage smile, she\u003c/p\u003e\n\u003cp\u003esmashed the grapefruit juice bottle at his feet.\u003c/p\u003e\n\u003cp\u003eWith almost the same motion, she threw the gasoline can, too. It was flying in a graceful arc toward the\u003c/p\u003e\n\u003cp\u003efireplace, spinning, spilling liquid, and vampires were scattering to try to get out of the way.\u003c/p\u003e\n\u003cp\u003eAnd then everything was exploding-or maybe erupting was a better word. It was as if a dragon had\u003c/p\u003e\n\u003cp\u003ebreathed suddenly into the room, sending a roaring gale of fire through it.\u003c/p\u003e\n\u003cp\u003eBut Rashel didn\u0027t have time to watch-she and Quinn were both diving. Quinn was diving for the floor\u003c/p\u003e\n\u003cp\u003epast Nyala, trying to drag Rashel with him. Rashel was diving for Timmy.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know why. She didn\u0027t think about it consciously. She simply had to do it.\u003c/p\u003e\n\u003cp\u003eShe hit Timmy with the entire force of her body and knocked him to the floor. She covered him as the\u003c/p\u003e\n\u003cp\u003efire erupted behind her. Then she scrambled to her knees, her arm locked around his chest.\u003c/p\u003e\n\u003cp\u003eEverything was noise and heat and confusion. Vampires were yelling at each other, running, shoving each\u003c/p\u003e\n\u003cp\u003eother. The ones who\u0027d been splattered with gas were on fire, trying to put it out, getting in one another\u0027s way.\u003c/p\u003e\n\u003cp\u003e\"Come on!\" Quinn said, pulling Rashel up. \"I know a way outside.\"\u003c/p\u003e\n\u003cp\u003eRashel looked for Nyala. She didn\u0027t see her. As Quinn dragged her into the hall, she saw dark smoke\u003c/p\u003e\n\u003cp\u003ecome billowing from the dining-room area. The hall was bathed in reddish light.\u003c/p\u003e\n\u003cp\u003e\"Come on!\"\u003c/p\u003e\n\u003cp\u003eQuinn was pulling her across the hall, through the smoke. Into a room that was full of orange flames.\u003c/p\u003e\n\u003cp\u003e\"Quinn-\"\u003c/p\u003e\n\u003cp\u003eTimmy was kicking and struggling in Rashel\u0027s arms. Yelling at her. She kept her grip on him.\u003c/p\u003e\n\u003cp\u003eAnd she went with Quinn. She had to trust him. He knew the house.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t realized how frightening fire was, though. It was like a beast with hot shriveling breath. It\u003c/p\u003e\n\u003cp\u003eseemed alive and it seemed to want to get her, roaring out at her from unexpected places.\u003c/p\u003e\n\u003cp\u003eAnd it spread so fast. Rashel would never have believed it could move so quickly through a house, even\u003c/p\u003e\n\u003cp\u003ea house soaked with gasoline. In a matter of minutes the building had become an inferno. Everywhere\u003c/p\u003e\n\u003cp\u003eshe looked, there was fire, smoke, and a horrifying reflection of flames.\u003c/p\u003e\n\u003cp\u003eThey were on the other side of the room now, and Quinn was kicking at a door. His sleeve was on fire.\u003c/p\u003e\n\u003cp\u003eRashel twisted her hand out of his and beat at it to put it out. She almost lost hold of Timmy.\u003c/p\u003e\n\u003cp\u003eThen the door was swinging outward and cool air was rushing in and the fire was roaring like a crazy\u003c/p\u003e\n\u003cp\u003ething to meet it. She was simply running, in panic, her only thought to hold on to Timmy and to stay with Quinn.\u003c/p\u003e\n\u003cp\u003eThey were out. But she smelled burning. And now Quinn was grabbing her, rolling her over and over on\u003c/p\u003e\n\u003cp\u003ethe sandy unpaved road. Rashel realized, dimly, that her clothes were on fire in back.\u003c/p\u003e\n\u003cp\u003eQuinn stopped rolling her. Rashel sat up, tried to glance at her own back, then looked for Timmy.\u003c/p\u003e\n\u003cp\u003eHe was crouched on the road, staring at the house. Rashel could see flames coming out of the windows.\u003c/p\u003e\n\u003cp\u003eSmoke was pouring upward and everything seemed as bright as daylight beneath it.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" Quinn said urgently. He was looking her over.\u003c/p\u003e\n\u003cp\u003eRashel\u0027s whole body was washed with adrenaline and her heart was pounding insanely. But she couldn\u0027t\u003c/p\u003e\n\u003cp\u003etake her eyes off the house.\u003c/p\u003e\n\u003cp\u003eShe stumbled to her feet. \"Nyala\u0027s in there! I have to get her.\"\u003c/p\u003e\n\u003cp\u003eQuinn looked at her as if she were raving. Rashel just shook her head and started helplessly toward the\u003c/p\u003e\n\u003cp\u003ehouse. She didn\u0027t want to go anywhere near it.\u003c/p\u003e\n\u003cp\u003eShe knew the fire wanted her dead. But she couldn\u0027t leave Nyala in there to burn.\u003c/p\u003e\n\u003cp\u003eThen Quinn was shoving her roughly back. \"You stay here. I\u0027ll get her.\"\u003c/p\u003e\n\u003cp\u003e\"No! I have to-\"\u003c/p\u003e\n\u003cp\u003e\"You have to watch Timmy! Look, he\u0027s getting away!\"\u003c/p\u003e\n\u003cp\u003eRashel whirled. She didn\u0027t have any clear idea of where Timmy might be getting away to-but he was on\u003c/p\u003e\n\u003cp\u003ehis feet and moving. Toward the house, then away from it. She grabbed for him again. When she turned\u003c/p\u003e\n\u003cp\u003eback toward Quinn, Quinn was gone.\u003c/p\u003e\n\u003cp\u003eNo-there he was, darting into the house. Timmy was screaming again, kicking in her arms.\u003c/p\u003e\n\u003cp\u003e\"I hate you!\" he shouted. \"Let go of me! Why did you take me out?\"\u003c/p\u003e\n\u003cp\u003eRashel stared at the house. Quinn was inside now. In that holocaust of flame. And he\u0027d gone because of\u003c/p\u003e\n\u003cp\u003eher, to save her from going herself.\u003c/p\u003e\n\u003cp\u003ePlease, she thought suddenly and distinctly. Please don\u0027t let him die.\u003c/p\u003e\n\u003cp\u003eThe flames were roaring higher. The night was brilliant with them. Fire was raining in little burning bits\u003c/p\u003e\n\u003cp\u003efrom the sky, and Rashel\u0027s nose and eyes stung. She knew she should get farther back, but she couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe had to watch for Quinn.\u003c/p\u003e\n\u003cp\u003e\"Why? I hate you! Why did you take me out?\"\u003c/p\u003e\n\u003cp\u003eRashel looked at the strange little creature in her arms, the one that was biting and kicking as if it wanted\u003c/p\u003e\n\u003cp\u003eto go back into the burning house. She\u003c/p\u003e\n\u003cp\u003edidn\u0027t know what Timmy had become-some weird combination of child, adult, and animal, apparently.\u003c/p\u003e\n\u003cp\u003eAnd she didn\u0027t know what kind of future he could possibly have. But she did know, now, why she\u0027d\u003c/p\u003e\n\u003cp\u003ebrought him out.\u003c/p\u003e\n\u003cp\u003eShe looked at the childish face, the angry eyes full of hate. \"Because my mom told me to take care of\u003c/p\u003e\n\u003cp\u003eyou,\" she whispered.\u003c/p\u003e\n\u003cp\u003eAnd then she was crying. She was holding him and sobbing. Timmy didn\u0027t try to hold her back, but he\u003c/p\u003e\n\u003cp\u003edidn\u0027t bite her anymore either.\u003c/p\u003e\n\u003cp\u003eStill sobbing, Rashel looked over his head toward the house. Everything was burning. And Quinn was\u003c/p\u003e\n\u003cp\u003estill inside....\u003c/p\u003e\n\u003cp\u003eThen she saw a figure silhouetted against the flames. Two figures. One holding the other, half carrying it.\u003c/p\u003e\n\u003cp\u003e\"Quinn!\"\u003c/p\u003e\n\u003cp\u003eHe was running toward her, supporting Nyala. They were both covered with soot. Nyala was swaying,\u003c/p\u003e\n\u003cp\u003elaughing, her eyes huge and distant.\u003c/p\u003e\n\u003cp\u003eRashel threw her arms around both of them. The relief that washed over her was almost more painful\u003c/p\u003e\n\u003cp\u003ethan the fear. Her legs literally felt as if they had no bones-she was going to collapse at any second. She\u003c/p\u003e\n\u003cp\u003ewas tottering.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re alive,\" she whispered into Quinn\u0027s charred collar. \"And you got her.\" She could feel Quinn\u0027s arm\u003c/p\u003e\n\u003cp\u003earound her, holding hard. Nothing else seemed to matter.\u003c/p\u003e\n\u003cp\u003eBut now Quinn was taking his arm away, pushing her along the road. \"Come on! We\u0027ve got to get to the\u003c/p\u003e\n\u003cp\u003ewharf before they do.\"\u003c/p\u003e\n\u003cp\u003eIn a flash, Rashel understood. She got a new grip on Timmy and turned to run toward the hiking path.\u003c/p\u003e\n\u003cp\u003eHer knees were shaking, but she found she could make them move.\u003c/p\u003e\n\u003cp\u003eThey lurched down the path in the wild grass, Quinn supporting Nyala, she carrying Timmy. Rashel\u003c/p\u003e\n\u003cp\u003edidn\u0027t know how many vampires had made it out of the burning house-she hadn\u0027t seen any- but she knew\u003c/p\u003e\n\u003cp\u003ethat any who did would head for the dock.\u003c/p\u003e\n\u003cp\u003eWhere she and Annelise had disabled the boats.\u003c/p\u003e\n\u003cp\u003eBut as the wharf came into view, Rashel saw something that hadn\u0027t been there when she left it. There\u003c/p\u003e\n\u003cp\u003ewas a yacht in the harbor, swinging at anchor.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Hunter\u0027s,\" Quinn said. \"Hurry!\"\u003c/p\u003e\n\u003cp\u003eThey were flying down the hill, staggering onto the wharf. Rashel saw no sign of the werewolf she\u0027d tied\u003c/p\u003e\n\u003cp\u003eup earlier, but she saw something else new. An inflatable red dinghy was tied to the pier.\u003c/p\u003e\n\u003cp\u003e\"Quick! You get in first.\"\u003c/p\u003e\n\u003cp\u003eRashel put Timmy down and got in. Quinn lifted Timmy into her arms, then put Nyala in. Nyala was\u003c/p\u003e\n\u003cp\u003estaring around her now, laughing in spurts, then stopping to breathe hard. Rashel put her free arm around\u003c/p\u003e\n\u003cp\u003eher as Quinn climbed in the dinghy.\u003c/p\u003e\n\u003cp\u003eEvery second, Rashel was expecting to see Hunter Redfern appear, blackened and smoldering, with his\u003c/p\u003e\n\u003cp\u003earms outstretched like some vengeful demon.\u003c/p\u003e\n\u003cp\u003eAnd then the tiny motor was purring and they were moving away from the wharf. They were leaving it\u003c/p\u003e\n\u003cp\u003ebehind. They were on the ocean, the cool dark ocean, freeing themselves from land and danger.\u003c/p\u003e\n\u003cp\u003eRashel watched as the yacht got bigger and bigger. They were close to it now. They were there.\u003c/p\u003e\n\u003cp\u003e\"Come on. We can climb up the swimming ladder. Come on, fast,\" Quinn said. He was reaching for her,\u003c/p\u003e\n\u003cp\u003ehis face unfamiliar in a mask of soot, his eyes intense. Absolutely focused, absolutely determined.\u003c/p\u003e\n\u003cp\u003eThank God he knows what to do on a boat. I wouldn\u0027t. She let Quinn help her up the ladder, then\u003c/p\u003e\n\u003cp\u003ehelped Timmy and Nyala. Nyala had stopped laughing entirely now. She was simply gasping, looking\u003c/p\u003e\n\u003cp\u003ebewildered.\u003c/p\u003e\n\u003cp\u003e\"What happened? What-?\" She stared toward the cliffs where orange flame was shooting into the sky. \"I\u003c/p\u003e\n\u003cp\u003edid that. Did I do that?\"\u003c/p\u003e\n\u003cp\u003eQuinn had pulled up the anchor. He was heading for the cockpit. Timmy was crying.\u003c/p\u003e\n\u003cp\u003eKneeling on the deck, Rashel held Nyala. Nyala\u0027s eyelashes were burned to crisp curls. There was white\u003c/p\u003e\n\u003cp\u003eash on the ends. Her mouth was trembling and her body shook as if she were having convulsions.\u003c/p\u003e\n\u003cp\u003e\"I had to do it,\" she got out in a thick voice. \"You know I had to, Rashel.\"\u003c/p\u003e\n\u003cp\u003eTimmy sobbed on. A motor roared to life. All at once they were moving swiftly and the island with its\u003c/p\u003e\n\u003cp\u003eburning torch was falling behind.\u003c/p\u003e\n\u003cp\u003e\"I had to,\" Nyala said in a choked voice. \"I had to. I had to.\"\u003c/p\u003e\n\u003cp\u003eRashel leaned to rest her head on Nyala\u0027s hair. Wind was whipping around her as they raced away. She\u003c/p\u003e\n\u003cp\u003eheld the tiny vampire in one arm and the trembling human girl in the other. And she watched the fire get\u003c/p\u003e\n\u003cp\u003esmaller and smaller until it looked like a star on the ocean.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-16.html","bookId":2079,"creation":"Oct 5, 2019 5:30:52 PM","modification":"Oct 5, 2019 5:30:52 PM"}
