{"id":88705,"no":4,"title":"Page 4","content":"\u003cp\u003eQuinn was cold.\u003c/p\u003e\n\u003cp\u003eNot physically, of course. That was impossible. The icy March air had no effect on him; his body was\u003c/p\u003e\n\u003cp\u003eimpervious to little things like weather. No, this cold was inside him.\u003c/p\u003e\n\u003cp\u003eHe stood looking at the bay and the thriving city across it.Boston by starlight. It had taken him a long\u003c/p\u003e\n\u003cp\u003etime to come back toBoston after... the change.\u003c/p\u003e\n\u003cp\u003eHe\u0027d lived there once, when he\u0027d been human. But in those daysBoston was nothing but three hills, one\u003c/p\u003e\n\u003cp\u003ebeacon, and a handful of houses with thatched roofs. The place where he was standing now had been\u003c/p\u003e\n\u003cp\u003eclean beach surrounded by salt meadows and dense forest.\u003c/p\u003e\n\u003cp\u003eThe year had been 1639.\u003c/p\u003e\n\u003cp\u003eBostonhad grown since then, but Quinn hadn\u0027t.\u003c/p\u003e\n\u003cp\u003eHe was still eighteen, still the young man who\u0027d loved the sunny pastures and the clear blue water of the\u003c/p\u003e\n\u003cp\u003ewilderness. Who had lived simply, feeling grateful when there was enough food for supper on his\u003c/p\u003e\n\u003cp\u003emother\u0027s table, and who had dreamed of someday having his own fishing schooner and marrying pretty\u003c/p\u003e\n\u003cp\u003eDove Redfern.\u003c/p\u003e\n\u003cp\u003eThat was how it had all started, with Dove. Pretty Dove and her soft brown hair... sweet Dove, who\u003c/p\u003e\n\u003cp\u003ehad a secret a simple boy like Quinn could never have imagined.\u003c/p\u003e\n\u003cp\u003eWell. Quinn felt his lip curl. That was all in the past. Dove had been dead for centuries, and if her\u003c/p\u003e\n\u003cp\u003escreams still haunted him every night, no one knew but himself.\u003c/p\u003e\n\u003cp\u003eBecause he might not be any older than he had been in the days of the colonies, but he had learned a\u003c/p\u003e\n\u003cp\u003efew tricks. Like how to wrap ice around his heart so that nothing in the world could hurt him. And how to\u003c/p\u003e\n\u003cp\u003eput ice in his gaze, so that whoever looked into his black eyes saw only an endless glacial dark. He\u0027d\u003c/p\u003e\n\u003cp\u003egotten very good at that. Some people actually went pale and backed away when he turned his eyes on them.\u003c/p\u003e\n\u003cp\u003eThe tricks had worked for years, allowing him not just to survive as a vampire, but to be brilliantly\u003c/p\u003e\n\u003cp\u003esuccessful at it. He was Quinn, pitiless as a snake, whose blood ran like ice water, whose soft voice\u003c/p\u003e\n\u003cp\u003epronounced doom on anybody who got in his way. Quinn, the essence of darkness, who struck fear into\u003c/p\u003e\n\u003cp\u003ethe hearts of humans and Night People alike.\u003c/p\u003e\n\u003cp\u003eAnd just at the moment, he was tired.\u003c/p\u003e\n\u003cp\u003eTired and cold. There was a kind of bleakness inside him, like a whiter that would never change into spring.\u003c/p\u003e\n\u003cp\u003eHe had no idea what to do about it-although it had occurred to him that if he were to jump into the bay\u003c/p\u003e\n\u003cp\u003eand let those dark waters close over his head, and then stay down there for a few days without feeding...\u003c/p\u003e\n\u003cp\u003ewell, all his problems would be solved, wouldn\u0027t they?\u003c/p\u003e\n\u003cp\u003eBut that was ridiculous. He was Quinn. Nothing could touch him. The bleak feeling would go away eventually.\u003c/p\u003e\n\u003cp\u003eHe pulled himself out of his reverie, turning away from the shimmering blackness of the bay. Maybe he\u003c/p\u003e\n\u003cp\u003eshould go to the warehouse in Mission Hill, check on its inhabitants. He needed something to do, to keep\u003c/p\u003e\n\u003cp\u003ehim from thinking.\u003c/p\u003e\n\u003cp\u003eQuinn smiled, knowing it was a smile to frighten children. He set off forBoston .\u003c/p\u003e\n\u003cp\u003eRashel sat by the window, but not the way ordinary people sit. She was kneeling in a sort of crouch,\u003c/p\u003e\n\u003cp\u003eweight resting on her left leg, right leg bent and pointing forward. It was a position that allowed for swift\u003c/p\u003e\n\u003cp\u003eand unrestricted movement in any direction. Her bokken was beside her; she could spring and draw at a\u003c/p\u003e\n\u003cp\u003esecond\u0027s notice.\u003c/p\u003e\n\u003cp\u003eThe abandoned building was quiet. Steve and Vicky were outside, scouting the street. Nyala seemed\u003c/p\u003e\n\u003cp\u003elost in her own thoughts.\u003c/p\u003e\n\u003cp\u003eSuddenly Nyala reached out and touched the bokken\u0027s sheath. \"What\u0027s this?\"\u003c/p\u003e\n\u003cp\u003e\"Hm? Oh, it\u0027s a kind of Japanese sword. They use wooden swords for fencing practice because steel\u003c/p\u003e\n\u003cp\u003ewould be too dangerous. But it can actually be lethal even to humans. It\u0027s weighted and balanced just like\u003c/p\u003e\n\u003cp\u003ea steel sword.\" She pulled the sword out of the sheath and turned the flashlight on it so Nyala could see\u003c/p\u003e\n\u003cp\u003ethe satiny green-black wood.\u003c/p\u003e\n\u003cp\u003eNyala drew in her breath and touched the graceful curve lightly. \"It\u0027s beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s made of lignum vitae: the Wood of Life. That\u0027s the hardest and heaviest wood there is-it\u0027s as dense\u003c/p\u003e\n\u003cp\u003eas iron. I had it carved specially, just for me.\"\u003c/p\u003e\n\u003cp\u003e\"And you use it to kill vampires.\" \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027ve killed a lot.\" \"Yes.\" Rashel slid the sword back into its sheath. \"Good,\" Nyala said with a\u003c/p\u003e\n\u003cp\u003ethrob in her voice. She turned to stare at the street. She had a small queenly head, with hair piled on the\u003c/p\u003e\n\u003cp\u003eback like Nef-ertiti\u0027s crown. When she turned back to Rashel, her voice was quiet. \"How did you get\u003c/p\u003e\n\u003cp\u003einto all this in the first place? I mean, you seem to know so much. How did you learn it all?\"\u003c/p\u003e\n\u003cp\u003eRashel laughed. \"Bit by bit,\" she said briefly. She didn\u0027t like to talk about it. \"But I started like you. I saw\u003c/p\u003e\n\u003cp\u003eone of them kill my mom when I was five. After that, I tried to learn everything I could about vampires,\u003c/p\u003e\n\u003cp\u003eso I could fight them. And I told the story\u003c/p\u003e\n\u003cp\u003eat every foster home I lived in, and finally I found some people who believed me. They were vampire\u003c/p\u003e\n\u003cp\u003ehunters. They taught me a lot.\"\u003c/p\u003e\n\u003cp\u003eNyala looked ashamed and disgusted. \"I\u0027m so stupid-I haven\u0027t done anything like that. I wouldn\u0027t even\u003c/p\u003e\n\u003cp\u003ehave known about the Lancers if Elliot hadn\u0027t called me. He saw the article in the paper about my sister\u003c/p\u003e\n\u003cp\u003eand guessed it might have been a vampire killing. But I\u0027d never have found them on my own.\"\u003c/p\u003e\n\u003cp\u003e\"You just didn\u0027t have enough time.\"\u003c/p\u003e\n\u003cp\u003e\"No. I think it takes a special kind of person. But now that I know how to fight them, I\u0027m going to do it.\"\u003c/p\u003e\n\u003cp\u003eHer voice was tight and shaky, and Rashel glanced at her quickly. There was something unstable just\u003c/p\u003e\n\u003cp\u003eunder the surface of this girl. \"Nobody knows which of them killed my sister, so I just figure I\u0027ll get as\u003c/p\u003e\n\u003cp\u003emany of them as I can. I want to-\"\u003c/p\u003e\n\u003cp\u003e\"Quiet!\" Rashel hissed the word and put a hand over Nyala\u0027s mouth at the same instant. Nyala froze.\u003c/p\u003e\n\u003cp\u003eRashel sat tensely, listening, then got up like a spring uncoiling and put her head out the window. She\u003c/p\u003e\n\u003cp\u003elistened for another moment, then caught up her scarf and veiled her face with practiced movements.\u003c/p\u003e\n\u003cp\u003e\"Grab your ski mask and come on.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to get your wish-right now. There\u0027s a fight down there. Stay behind me... and don\u0027t\u003c/p\u003e\n\u003cp\u003eforget your mask.\"\u003c/p\u003e\n\u003cp\u003eNyala didn\u0027t need to ask about that, she noticed. It was the first thing any vampire hunter learned.\u003c/p\u003e\n\u003cp\u003eIf you were recognized and the vampire got away... well, it was all over. The Night People would\u003c/p\u003e\n\u003cp\u003esearch until they found you, then strike when you least expected it.\u003c/p\u003e\n\u003cp\u003eWith Nyala behind her, Rashel ran lightly down the stairs and around to the street.\u003c/p\u003e\n\u003cp\u003eThe sounds were coming from a pool of darkness beside one of the warehouses, far from the nearest\u003c/p\u003e\n\u003cp\u003estreetlight. As Rashel reached the place, she could make out the forms of Steve and Vicky, their faces\u003c/p\u003e\n\u003cp\u003emasked, their clubs in their hands. They were struggling with another form.\u003c/p\u003e\n\u003cp\u003eOh, for God\u0027s sake, Rashel thought, stopping dead.\u003c/p\u003e\n\u003cp\u003eOne other form. The two of them, armed with wood and lying in ambush, couldn\u0027t handle one little\u003c/p\u003e\n\u003cp\u003evampire by themselves? From the racket, she\u0027d thought they must have been surprised by a whole army.\u003c/p\u003e\n\u003cp\u003eBut this vampire seemed to be putting up quite a fight-in fact, he was clearly winning. Throwing his\u003c/p\u003e\n\u003cp\u003eattackers around with supernatural strength, just as if they were ordinary humans and not fearless vampire\u003c/p\u003e\n\u003cp\u003eslayers. He seemed to be enjoying it.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to help them!\" Nyala hissed in Rashers ear.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Rashel said joylessly. She sighed. \"Wait here; I\u0027m going to bonk him on the head.\"\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t quite that easy. Rashel got behind the vampire without trouble; he was preoccupied with the\u003c/p\u003e\n\u003cp\u003eother two and arrogant enough to be careless. But then she had a problem.\u003c/p\u003e\n\u003cp\u003eHer bokken, the honorable sword of a warrior, had one purpose: to deliver a clean blow capable of\u003c/p\u003e\n\u003cp\u003ekilling instantly. She couldn\u0027t bring herself to whack somebody unconscious with it.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t that she didn\u0027t have other weapons. She had plenty-back at home in Marblehead. All the tools\u003c/p\u003e\n\u003cp\u003eof a ninja, and some the ninja had never heard of. And she knew some extremely dirty methods of\u003c/p\u003e\n\u003cp\u003efighting. She could break bones and crush tendons; she could peel an enemy\u0027s trachea out of his neck\u003c/p\u003e\n\u003cp\u003ewith her bare hands or drive his ribs into his lungs with her feet.\u003c/p\u003e\n\u003cp\u003eBut those were desperate measures, to be used as a last resort when her own life was at stake and the\u003c/p\u003e\n\u003cp\u003eopposition was overwhelming. She simply couldn\u0027t do that to a single enemy when she had the jump on him.\u003c/p\u003e\n\u003cp\u003eJust then the single enemy threw Steve into a wall, where he landed with a muffled \"oof.\" Rashel felt\u003c/p\u003e\n\u003cp\u003esorry for him, but it solved her dilemma. She grabbed the oak club Steve had been holding as it rolled\u003c/p\u003e\n\u003cp\u003eacross the concrete. Then she circled nimbly as the vampire turned, trying to face her. At that instant\u003c/p\u003e\n\u003cp\u003eNyala threw herself into the fight, creating a distraction, and Rashel did what she\u0027d said she would. She\u003c/p\u003e\n\u003cp\u003ebonked the vampire on the head, driving the club like a home runner\u0027s swing with the force of her hips.\u003c/p\u003e\n\u003cp\u003eThe vampire cried out and fell down motionless.\u003c/p\u003e\n\u003cp\u003eRashel raised the club again, watching him. Then she lowered it, looking at Steve and Vicky. \"You guys okay?\"\u003c/p\u003e\n\u003cp\u003eVicky nodded stiffly. She was trying to get her breath. \"He surprised us,\" she said.\u003c/p\u003e\n\u003cp\u003eRashel didn\u0027t answer. She was very unhappy, and her feeling of being in top form tonight had completely\u003c/p\u003e\n\u003cp\u003eevaporated. This had been the most undignified fight she\u0027d seen in a long while, and...\u003c/p\u003e\n\u003cp\u003e... and it bothered her, the way the vampire had cried out as he fell. She couldn\u0027t explain why, but it had.\u003c/p\u003e\n\u003cp\u003eSteve picked himself up. \"He shouldn\u0027t have been able to surprise us,\" he said. \"That was our fault.\"\u003c/p\u003e\n\u003cp\u003eRashel glanced at him. It was true. In this business, you were either ready all the time, expecting the\u003c/p\u003e\n\u003cp\u003eunexpected at any moment, or you were dead.\u003c/p\u003e\n\u003cp\u003e\"He was just good,\" Vicky said shortly. \"Come on, let\u0027s get him out of here before somebody sees us.\u003c/p\u003e\n\u003cp\u003eThere\u0027s a cellar in the other building.\"\u003c/p\u003e\n\u003cp\u003eRashel took hold of the vampire\u0027s feet while Steve grabbed his shoulders. He wasn\u0027t very big, about\u003c/p\u003e\n\u003cp\u003eRashel\u0027s height and compact. He looked young, about Rashel\u0027s age.\u003c/p\u003e\n\u003cp\u003eWhich meant nothing, she reminded herself. A parasite could be a thousand and still look young. They\u003c/p\u003e\n\u003cp\u003egained eternal life from other people\u0027s blood.\u003c/p\u003e\n\u003cp\u003eShe and Steve carried their burden down the stairs into a large dank room that smelled of damp rot and\u003c/p\u003e\n\u003cp\u003emildew. They dropped him on the cold concrete floor and Rashel straightened to ease her back.\u003c/p\u003e\n\u003cp\u003e\"Okay. Now let\u0027s see what he looks like,\" Vicky said, and turned her flashlight on him.\u003c/p\u003e\n\u003cp\u003eThe vampire was pale, and his black hair looked even blacker against his white skin. His eyelashes were\u003c/p\u003e\n\u003cp\u003edark on his cheek. A little blood matted his hair in the back.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think he\u0027s the same one Elliot and I saw last night. That one looked bigger,\" Vicky said.\u003c/p\u003e\n\u003cp\u003eNyala pressed forward, staring at her very first captive vampire. \"What difference does it make? He\u0027s\u003c/p\u003e\n\u003cp\u003eone of them, right? Nobody human could have thrown Steve like that. He might even be the one who\u003c/p\u003e\n\u003cp\u003ekilled my sister. And he\u0027s ours now.\" She smiled down, looking almost like someone in love. \"You\u0027re\u003c/p\u003e\n\u003cp\u003eours,\" she said to the unconscious boy on the floor. \"Just you wait.\"\u003c/p\u003e\n\u003cp\u003eSteve rubbed his shoulder where it had hit the wall. All he said was \"Yeah,\" but his smile wasn\u0027t nice.\u003c/p\u003e\n\u003cp\u003e\"I only hope he doesn\u0027t die soon,\" Vicky said, examining the pale face critically. \"You hit him pretty hard.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not going to die,\" Rashel said. \"In fact, he\u0027ll probably wake up in a few minutes. And we\u0027d better\u003c/p\u003e\n\u003cp\u003ehope he\u0027s not one of the really powerful telepaths.\"\u003c/p\u003e\n\u003cp\u003eNyala looked up sharply. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Oh-all vampires are telepathic,\" Rashel said absently. \"But there\u0027s a big range as to how powerful they\u003c/p\u003e\n\u003cp\u003eare. Most of them can only communicate over\u003c/p\u003e\n\u003cp\u003ea short distance-like within the same house, say. But a few are a lot stronger.\"\u003c/p\u003e\n\u003cp\u003e\"Even if he is strong, it won\u0027t matter unless there are other vampires around,\" Vicky said.\u003c/p\u003e\n\u003cp\u003e\"Which there may be, if you and Elliot saw another one last night.\"\u003c/p\u003e\n\u003cp\u003e\"Well...\" Vicky hesitated, then said, \"We can check outside, make sure he doesn\u0027t have any friends\u003c/p\u003e\n\u003cp\u003ehiding around that warehouse.\"\u003c/p\u003e\n\u003cp\u003eSteve was nodding, and Nyala was listening intently. Rashel started to say that from what she\u0027d seen,\u003c/p\u003e\n\u003cp\u003ethey couldn\u0027t find a vampire in hiding to save their lives-but then she changed her mind.\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" she said. \"You take Nyala and do that. It\u0027s better to have three people than two. I\u0027ll tie him\u003c/p\u003e\n\u003cp\u003eup before he comes around. I\u0027ve got bast cord.\"\u003c/p\u003e\n\u003cp\u003eVicky glanced over quickly, but her hostility seemed to have faded since Rashel had knocked the\u003c/p\u003e\n\u003cp\u003evampire over the head. \"Okay, but let\u0027s use the handcuffs. Nyala, run up and get them.\"\u003c/p\u003e\n\u003cp\u003eNyala did, and she and Vicky fixed the wooden stocks on the vampire\u0027s wrists. Then they left with Steve.\u003c/p\u003e\n\u003cp\u003eRashel sat on the floor.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know what she was doing, or why she\u0027d sent Nyala away. All she knew was that she wanted\u003c/p\u003e\n\u003cp\u003eto be alone, and that she felt... rotten.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t that she didn\u0027t have anger. There were times when she got so angry at the universe that it was\u003c/p\u003e\n\u003cp\u003eactually like a little voice inside her whispering,\u003c/p\u003e\n\u003cp\u003eKill, kill, kill. Times when she wanted to strike out blindly, without caring who she hurt.\u003c/p\u003e\n\u003cp\u003eBut just now the little voice was silent, and Rashel felt sick.\u003c/p\u003e\n\u003cp\u003eTo keep herself busy, she tied his feet with bast, a cord made from the inner bark of trees. It was as\u003c/p\u003e\n\u003cp\u003egood for holding a vampire as Vicky\u0027s ridiculous handcuffs.\u003c/p\u003e\n\u003cp\u003eWhen it was done, she turned the flashlight on him again.\u003c/p\u003e\n\u003cp\u003eHe was good-looking. Clean features that were strongly chiseled but almost delicate. A mouth that at the\u003c/p\u003e\n\u003cp\u003emoment looked rather innocent, but which might be sensuous if he were awake. A body that was lithe\u003c/p\u003e\n\u003cp\u003eand flat-muscled, if not very tall.\u003c/p\u003e\n\u003cp\u003eAll of which had no effect on Rashel. She\u0027d seen attractive vampires before-in fact, an inordinate number\u003c/p\u003e\n\u003cp\u003eof them seemed to be really beautiful. It didn\u0027t mean anything. It only stood as a contrast to what they\u003c/p\u003e\n\u003cp\u003ewere like inside.\u003c/p\u003e\n\u003cp\u003eThe tall man who\u0027d killed her mother had been handsome. She could still see his face, his golden eyes.\u003c/p\u003e\n\u003cp\u003eFilthy parasites. Night World scum. They weren\u0027t really people. They were monsters.\u003c/p\u003e\n\u003cp\u003eBut they could still feel pain, just like any human. She\u0027d hurt this one when she hit him.\u003c/p\u003e\n\u003cp\u003eRashel jumped up and started to pace the cellar.\u003c/p\u003e\n\u003cp\u003eAll right. This vampire deserved to die. They all did. But that didn\u0027t mean she had to wait for Vicky to\u003c/p\u003e\n\u003cp\u003ecome back and poke him with pointy sticks.\u003c/p\u003e\n\u003cp\u003eRashel knew now why she\u0027d sent Nyala away. So she could give the vampire a clean death. Maybe he\u003c/p\u003e\n\u003cp\u003edidn\u0027t deserve it, but she couldn\u0027t stand around and watch Vicky kill him slowly. She couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe stopped pacing and went to the unconscious boy.\u003c/p\u003e\n\u003cp\u003eThe flashlight on the floor was still pointing at him, so she could see him clearly. He was wearing a\u003c/p\u003e\n\u003cp\u003elightweight black shirt-no sweater or coat. Vampires didn\u0027t need protection from the cold. Rashel\u003c/p\u003e\n\u003cp\u003eunbuttoned the shirt, exposing his chest. Although the angled tip of her bokken could pierce clothing, it\u003c/p\u003e\n\u003cp\u003ewas easier to drive it straight into vampire flesh without any barrier in between.\u003c/p\u003e\n\u003cp\u003eStanding with one foot on either side of the vampire\u0027s waist, she drew the heavy wooden sword. She\u003c/p\u003e\n\u003cp\u003eheld it with both hands, one near the guard, the other near the knob on the end of the hilt.\u003c/p\u003e\n\u003cp\u003eShe positioned the end exactly over the vampire\u0027s heart.\u003c/p\u003e\n\u003cp\u003e\"This kitten has claws,\" she whispered, hardly aware she was saying it.\u003c/p\u003e\n\u003cp\u003eThen she took a deep breath, eyes shut. She needed to work to focus, because she\u0027d never done\u003c/p\u003e\n\u003cp\u003eanything like this before. The vampires she\u0027d killed had usually been caught in the middle of some\u003c/p\u003e\n\u003cp\u003edespicable act-and they\u0027d all been fighting at the end. She\u0027d never staked one that was lying still.\u003c/p\u003e\n\u003cp\u003eConcentrate, she thought. You need zanshin, continuing mind, awareness of everything without fixing on anything.\u003c/p\u003e\n\u003cp\u003eShe felt her feet becoming part of the cold concrete beneath them, her muscles and bones becoming\u003c/p\u003e\n\u003cp\u003eextensions of the ground. The strike would carry the energy of the earth itself.\u003c/p\u003e\n\u003cp\u003eHer hands brought the sword up. She was ready for the kill. She opened her eyes to perfect her aim.\u003c/p\u003e\n\u003cp\u003eAnd then she saw that the vampire was awake. His eyes were open and he was looking at her. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-4.html","bookId":2079,"creation":"Oct 5, 2019 5:30:52 PM","modification":"Oct 5, 2019 5:30:52 PM"}
