{"id":88706,"no":5,"title":"Page 5","content":"\u003cp\u003eRashel froze. Her sword remained in the air, poised over the vampire\u0027s heart.\u003c/p\u003e\n\u003cp\u003e\"Well, what are you waiting for?\" the vampire said. \"Go on and do it.\"\u003c/p\u003e\n\u003cp\u003eRashel didn\u0027t know what she was waiting for. The vampire was in a position to block her sword with his\u003c/p\u003e\n\u003cp\u003ewooden handcuffs, but he didn\u0027t do any such thing. She could tell by his body language that he wasn\u0027t\u003c/p\u003e\n\u003cp\u003egoing to, either. Instead he just lay there, looking up at her with eyes that were as dark and empty as the\u003c/p\u003e\n\u003cp\u003edepths of space.\u003c/p\u003e\n\u003cp\u003eHis hair was tousled on his forehead and his mouth was a bleak line. He didn\u0027t seem afraid. He just went\u003c/p\u003e\n\u003cp\u003eon staring with those fathomless eyes.\u003c/p\u003e\n\u003cp\u003eAll right, Rashel thought. Do it. Even the leech is telling you to. Do it fast-now.\u003c/p\u003e\n\u003cp\u003eBut instead she found herself pivoting and stepping slowly away from him.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" she said out loud. \"I don\u0027t take orders from parasites.\"\u003c/p\u003e\n\u003cp\u003eShe kept her sword at the ready in case he made any sudden moves. But all he did was glance down at\u003c/p\u003e\n\u003cp\u003ethe wooden handcuffs, wiggle his wrists in them, and then lie back.\u003c/p\u003e\n\u003cp\u003e\"I see,\" he said with a strange smile. \"So it\u0027s torture this time, right? Well, that should be amusing for you.\"\u003c/p\u003e\n\u003cp\u003eStake him, dummy, came the little voice in Rashel\u0027s head. Don\u0027t talk to him. It\u0027s dangerous to get in a\u003c/p\u003e\n\u003cp\u003econversation with his kind.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t refocus herself. In a minute, she told the voice. First I have to get my own control back.\u003c/p\u003e\n\u003cp\u003eShe knelt in her ready-for-action crouch and picked up the flashlight, turning it full on his face. He\u003c/p\u003e\n\u003cp\u003eblinked and looked away, squinting.\u003c/p\u003e\n\u003cp\u003eThere. Now she could see him, but he couldn\u0027t see her. Vampire eyes were hypersensitive to light. And\u003c/p\u003e\n\u003cp\u003eeven if he did manage to get a glimpse of her, she was wearing her scarf. She had all the advantages, and\u003c/p\u003e\n\u003cp\u003eit made her feel more in command of the situation.\u003c/p\u003e\n\u003cp\u003e\"Why would you think we want to torture you?\" she said.\u003c/p\u003e\n\u003cp\u003eHe smiled at the ceiling, not trying to look at her. \"Because I\u0027m still alive.\" He raised the handcuffs. \"And\u003c/p\u003e\n\u003cp\u003earen\u0027t these traditional? A few vampires from\u003c/p\u003e\n\u003cp\u003ethe south shore have turned up mutilated with stocks like these on. It seemed to have been done for fun.\"\u003c/p\u003e\n\u003cp\u003eSmile.\u003c/p\u003e\n\u003cp\u003eVicky\u0027s work, Rashel thought. She wished he would stop smiling. It was such a disturbing smile,\u003c/p\u003e\n\u003cp\u003ebeautiful and a little mad.\u003c/p\u003e\n\u003cp\u003e\"Unless,\" the vampire was going on, \"it\u0027s information you want.\"\u003c/p\u003e\n\u003cp\u003eRashel snorted. \"Would I be likely to get information from you if I did want it?\" \"Well.\" Smile. \"Not\u003c/p\u003e\n\u003cp\u003elikely.\" \"I didn\u0027t think so,\" Rashel said dryly. He laughed out loud. Oh, God, Rashel thought. Stake him.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know what was wrong with her. Okay, he was charming-in a weird way. But she\u0027d known\u003c/p\u003e\n\u003cp\u003eother charming vampires-smooth, practiced flatterers who tried to sweet-talk or cajole their way out of\u003c/p\u003e\n\u003cp\u003ebeing staked. Some had tried to seduce her. Almost all had tried mind control. It was only because\u003c/p\u003e\n\u003cp\u003eRashel had the will to resist telepathy that she was alive today.\u003c/p\u003e\n\u003cp\u003eBut this vampire wasn\u0027t doing any of the ordinary things-and when he laughed, it made Rashers heart\u003c/p\u003e\n\u003cp\u003ethump oddly. His whole face changed when he laughed. A sort of light shone in it. Girl, you are in trouble.\u003c/p\u003e\n\u003cp\u003eKill him quick. \"Look,\" she said, and she was surprised to find her voice a little shaky. \"This isn\u0027t\u003c/p\u003e\n\u003cp\u003epersonal. And you probably don\u0027t care, but I\u0027m not the one who was going to torture you. This is\u003c/p\u003e\n\u003cp\u003ebusiness, and it\u0027s what I have to do.\" She took a deep breath and reached for the sword by her knee.\u003c/p\u003e\n\u003cp\u003eHe turned his face to the light. He wasn\u0027t smiling now and there was no amusement in his voice when he\u003c/p\u003e\n\u003cp\u003esaid, \"I understand. You\u0027ve got... honor.\" Looking back at the ceiling, he added, \"And you\u0027re right, this\u003c/p\u003e\n\u003cp\u003eis the way it always has to end when our two races meet. It\u0027s kill or be killed. The law of nature.\"\u003c/p\u003e\n\u003cp\u003eHe was speaking to her as one warrior to another. Suddenly Rashel felt something she\u0027d never felt for a\u003c/p\u003e\n\u003cp\u003evampire before. Respect. A strange wish that they weren\u0027t on opposite sides in this war. A regret that\u003c/p\u003e\n\u003cp\u003ethey could never be anything but deadly enemies.\u003c/p\u003e\n\u003cp\u003eHe\u0027s somebody I could talk to, she thought. An odd loneliness had taken hold of her. She hadn\u0027t realized\u003c/p\u003e\n\u003cp\u003eshe cared about having anyone to talk to.\u003c/p\u003e\n\u003cp\u003eShe found herself saying awkwardly, \"Is there anybody you want notified-afterward? I mean, do you\u003c/p\u003e\n\u003cp\u003ehave any family? I could make sure the news gets around, so they\u0027d know what had happened to you.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t expect him to actually give her any names. That would be crazy. In this game knowledge was\u003c/p\u003e\n\u003cp\u003epower, with each side trying to find out who the players on the other side were. If you could identify\u003c/p\u003e\n\u003cp\u003esomeone as a vampire-or a vampire hunter-you knew who to kill.\u003c/p\u003e\n\u003cp\u003eIt was Batman and Catwoman all over. The important thing was to preserve your secret identity.\u003c/p\u003e\n\u003cp\u003eBut this vampire, who was obviously a lunatic, said thoughtfully, \"Well, you could send a note to my\u003c/p\u003e\n\u003cp\u003eadopted father. He\u0027s Hunter Redfern. Sorry I can\u0027t give you an address, but he should be somewhere\u003c/p\u003e\n\u003cp\u003edown east.\" Another smile. \"I forgot to tell you my name. It\u0027s Quinn.\"\u003c/p\u003e\n\u003cp\u003eRashel felt as if she\u0027d been hit with an oak club.\u003c/p\u003e\n\u003cp\u003eQuinn.\u003c/p\u003e\n\u003cp\u003eOne of the most dangerous vampires in all the Night World. Maybe the most dangerous of the made\u003c/p\u003e\n\u003cp\u003evampires, the ones who\u0027d started out human. She knew him by reputation-every vampire hunter did. He\u003c/p\u003e\n\u003cp\u003ewas supposed to be a deadly fighter and a brilliant strategist; clever, resourceful... and cold as ice. He\u003c/p\u003e\n\u003cp\u003edespised humans, held them in utter contempt. He wanted the Night World to wipe them out, except for\u003c/p\u003e\n\u003cp\u003ea few to be used for food.\u003c/p\u003e\n\u003cp\u003eI was wrong, Rashel thought dazedly. I should have let Vicky torture him. I\u0027m sure he deserves it, if any\u003c/p\u003e\n\u003cp\u003eof them do. God only knows what he\u0027s done in his time.\u003c/p\u003e\n\u003cp\u003eQuinn had turned his head toward her again, looking straight into the flashlight even though it must be\u003c/p\u003e\n\u003cp\u003ehurting his eyes.\u003c/p\u003e\n\u003cp\u003e\"So you see, you\u0027d better kill me fast,\" he said in a voice soft as snow falling. \"Because that\u0027s certainly\u003c/p\u003e\n\u003cp\u003ewhat I\u0027m going to do to you if I get loose.\"\u003c/p\u003e\n\u003cp\u003eRashel gave a strained laugh. \"Am I supposed to be scared?\"\u003c/p\u003e\n\u003cp\u003e\"Only if you have the brains to know who I am.\"\u003c/p\u003e\n\u003cp\u003eNow he sounded tired and scornful. \"Which obviously you don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Well, let me see. I seem to remember something about the Redferns.... Aren\u0027t they the family who\u003c/p\u003e\n\u003cp\u003econtrols the vampire part of the Night World Council? The most important family of all the lamia, the\u003c/p\u003e\n\u003cp\u003eborn vampires. Descended directly from Maya, the legendary first vampire. And Hunter Redfern is their\u003c/p\u003e\n\u003cp\u003eleader, the upholder of Night World law, the one who colonized America with vampires back in the\u003c/p\u003e\n\u003cp\u003esixteen hundreds. Tell me if I\u0027m getting any of this wrong.\"\u003c/p\u003e\n\u003cp\u003eHe gave her a cold glance.\u003c/p\u003e\n\u003cp\u003e\"You see, we have our sources. And I seem to remember them mentioning your name, too. You were\u003c/p\u003e\n\u003cp\u003emade a vampire by Hunter... and since his own children were all daughters, you\u0027re also his heir.\"\u003c/p\u003e\n\u003cp\u003eQuinn laughed sourly. \"Yes, well, that\u0027s an on-again, off-again thing. You might say I have a love-hate\u003c/p\u003e\n\u003cp\u003erelationship with the Redferns. We spend most of the time wishing each other at the bottom of the Atlantic.\"\u003c/p\u003e\n\u003cp\u003e\"Teh, vampire family infighting,\" Rashel said. \"Why is it always so hard to get along with your folks?\"\u003c/p\u003e\n\u003cp\u003eDespite her light words, she had to focus to keep control of her breathing.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t fear. She truly wasn\u0027t scared of him. It was something like confusion. Clearly, she should be\u003c/p\u003e\n\u003cp\u003ekilling him at this moment instead of chatting\u003c/p\u003e\n\u003cp\u003ewith him. She couldn\u0027t understand why she wasn\u0027t doing it.\u003c/p\u003e\n\u003cp\u003eThe only excuse she had was that it seemed to make him even more confused and angry than it did her.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you\u0027ve heard enough about me,\" he said, showing his teeth. \"I\u0027m your worst nightmare,\u003c/p\u003e\n\u003cp\u003ehuman. I even shock other vampires. Like old Hunter... he has certain ideas about propriety. How you\u003c/p\u003e\n\u003cp\u003ekill, and who. If he knew some of the things I do, he\u0027d fall down dead himself.\"\u003c/p\u003e\n\u003cp\u003eGood old Hunter, Rashel thought. The stiff moral patriarch of the Redfern clan, still caught up in the\u003c/p\u003e\n\u003cp\u003eseventeenth century. He might be a vampire, but he was definitely a New Englander.\u003c/p\u003e\n\u003cp\u003e\"Maybe I should find a way to tell him,\" she said whimsically.\u003c/p\u003e\n\u003cp\u003eQuinn gave her another cold look, this time tempered with respect. \"If I thought you could find him, I\u0027d worry.\"\u003c/p\u003e\n\u003cp\u003eRashel was suddenly struck by something. \"You know, I don\u0027t think I\u0027ve ever heard anyone say your\u003c/p\u003e\n\u003cp\u003efirst name. I mean, I presume you have one.\"\u003c/p\u003e\n\u003cp\u003eHe blinked. Then, as if he were surprised himself, he said, \"John.\"\u003c/p\u003e\n\u003cp\u003e\"John Quinn. John.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t invite you to call me it.\"\u003c/p\u003e\n\u003cp\u003e\"All right, whatever.\" She said it absently, deep in thought. John Quinn. Such a normal name, a Boston\u003c/p\u003e\n\u003cp\u003ename. The name of a real person. It made\u003c/p\u003e\n\u003cp\u003eher think of him as a person, instead of as Quinn the dreadful.\u003c/p\u003e\n\u003cp\u003e\"Look,\" Rashel said, and then she asked him something she\u0027d never asked a Night Person before. She\u003c/p\u003e\n\u003cp\u003esaid, \"Did you want Hunter Redfern to make you a vampire?\"\u003c/p\u003e\n\u003cp\u003eThere was a long pause. Then Quinn said expressionlessly, \"As a matter of fact, I wanted to kill him for\u003c/p\u003e\n\u003cp\u003eit.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" I\u0027d want to do the same, Rashel thought. She didn\u0027t mean to ask any more questions, but she\u003c/p\u003e\n\u003cp\u003efound herself saying, \"Then why did he do it? I mean, why pick you?\"\u003c/p\u003e\n\u003cp\u003eAnother pause. Just when she was sure he wouldn\u0027t answer, he said, \"I was-I wanted to marry one of\u003c/p\u003e\n\u003cp\u003ehis daughters. Her name was Dove.\"\u003c/p\u003e\n\u003cp\u003e\"You wanted to marry a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know she was a vampire!\" This time Quinn\u0027s voice was quick and impatient. \"Hunter Redfern\u003c/p\u003e\n\u003cp\u003ewas accepted in Charlestown. Granted, a few people said his wife had been a witch, but in those days\u003c/p\u003e\n\u003cp\u003epeople said that if you smiled in church.\"\u003c/p\u003e\n\u003cp\u003e\"So he just lived there and nobody knew,\" Rashel said.\u003c/p\u003e\n\u003cp\u003e\"Most people accepted him.\" A faint mocking smile curved Quinn\u0027s lips. \"My own father accepted him,\u003c/p\u003e\n\u003cp\u003eand he was the minister.\"\u003c/p\u003e\n\u003cp\u003eDespite herself, Rashel was fascinated. \"And you had to be a vampire to marry her? Dove, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t get to marry her,\" Quinn said tonelessly. He seemed as surprised as she was that he was telling\u003c/p\u003e\n\u003cp\u003eher these things. But he went on, seeming to speak almost to himself. \"Hunter wanted me to marry one of\u003c/p\u003e\n\u003cp\u003ehis other daughters. I said I\u0027d rather marry a pig. Garnet-that\u0027s the oldest-was about as interesting as a\u003c/p\u003e\n\u003cp\u003estick of wood. And Lily, the middle one, was evil. I could see that in her eyes. I only wanted Dove.\"\u003c/p\u003e\n\u003cp\u003e\"And you told him that?\" \"Of course. He agreed to it finally-and then he told me his family\u0027s secret. Well.\"\u003c/p\u003e\n\u003cp\u003eQuinn laughed bitterly. \"He didn\u0027t tell me, actually. It was more of a demonstration. When I woke up, I\u003c/p\u003e\n\u003cp\u003ewas dead and a vampire. It was quite an experience.\"\u003c/p\u003e\n\u003cp\u003eRashel opened her mouth and then shut it again, trying to imagine the horror of it. Finally she just said, \"I bet.\"\u003c/p\u003e\n\u003cp\u003eThey sat for a moment in silence. Rashel had never felt so... close to a vampire. Instead of disgust and\u003c/p\u003e\n\u003cp\u003ehatred, she felt pity. \"But what happened to Dove?\" Quinn seemed to tense all over. \"She died,\" he said\u003c/p\u003e\n\u003cp\u003enastily. It was clear that his confidences were over. \"How?\"\u003c/p\u003e\n\u003cp\u003e\"None of your business!\" Rashel tilted her head and looked at him soberly. \"How, John Quinn? You\u003c/p\u003e\n\u003cp\u003eknow, there are some things you really ought to tell other people. It might help.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need a damn psychoanalyst,\" he spat. He was furious now, and there was a dark light in his\u003c/p\u003e\n\u003cp\u003eeyes that ought to have frightened Rashel. He looked as wild as she felt sometimes, when she didn\u0027t care\u003c/p\u003e\n\u003cp\u003ewho she hurt.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t frightened. She was strangely calm, the kind of calm she felt when her breathing exercises\u003c/p\u003e\n\u003cp\u003emade her feel one with the earth and absolutely sure of her path.\u003c/p\u003e\n\u003cp\u003e\"Look, Quinn-\"\u003c/p\u003e\n\u003cp\u003e\"I really think you\u0027d better kill me now,\" he said tightly. \"Unless you\u0027re too stupid or too scared. This\u003c/p\u003e\n\u003cp\u003ewood won\u0027t hold forever, you know. And when I get out, I\u0027m going to use that sword on you.\"\u003c/p\u003e\n\u003cp\u003eStartled, Rashel looked down at Vicky\u0027s handcuffs. They were bent. Not the oak, of course-it was the\u003c/p\u003e\n\u003cp\u003emetal hinges that were coming apart. Soon he\u0027d have enough room to slip them off.\u003c/p\u003e\n\u003cp\u003eHe was very strong, even for a vampire.\u003c/p\u003e\n\u003cp\u003eAnd then, with the same odd calm, she realized what she was going to do.\u003c/p\u003e\n\u003cp\u003e\"Yes, that\u0027s a good idea,\" she said. \"Keep bending them. I can say that\u0027s how you got out.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003eRashel got up and searched for a steel knife to cut the cords on his feet. \"I\u0027m letting you go, John Quinn,\" she said.\u003c/p\u003e\n\u003cp\u003eHe paused in his wrenching of the handcuffs. \"You\u0027re insane,\" he said, as if he\u0027d just discovered this.\u003c/p\u003e\n\u003cp\u003e\"You may be right.\" Rashel found the knife and slit through the bast cords.\u003c/p\u003e\n\u003cp\u003eHe gave the handcuffs a twist. \"If,\" he said deliberately, \"you think that because I was a human once, I\u003c/p\u003e\n\u003cp\u003ehave any pity on them, you are very, very wrong. I hate humans more than I hate the Redferns.\" \"Why?\"\u003c/p\u003e\n\u003cp\u003eHe bared his teeth. \"No, thank you. I don\u0027t have to explain anything to you. Just take my word for it.\"\u003c/p\u003e\n\u003cp\u003eShe believed him. He looked as angry and as dangerous as an animal in a trap. \"All right,\" she said,\u003c/p\u003e\n\u003cp\u003estepping back and putting her hand on the hilt of her bokken. \"Take your best shot. But remember, I beat\u003c/p\u003e\n\u003cp\u003eyou once. I was the one who knocked you out.\"\u003c/p\u003e\n\u003cp\u003eHe blinked. Then he shook his head in disbelief. \"You little idiot,\" he said. \"I wasn\u0027t paying attention. I\u003c/p\u003e\n\u003cp\u003ethought you were another of those jerks falling over their own feet. And I wasn\u0027t even fighting them\u003c/p\u003e\n\u003cp\u003eseriously.\" He sat up in one fluid motion that showed the strength he had, and the control of his own body.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have a chance,\" he said softly, turning those dark eyes on her. Now that he wasn\u0027t looking\u003c/p\u003e\n\u003cp\u003einto the flashlight, his pupils were huge. \"You\u0027re dead already.\"\u003c/p\u003e\n\u003cp\u003eRashel had a sinking feeling that was telling her the same thing.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m faster than any human,\" the soft voice went on. \"I\u0027m stronger than any human. I can see better in the\u003c/p\u003e\n\u003cp\u003edark. And I\u0027m much, much nastier.\"\u003c/p\u003e\n\u003cp\u003ePanic exploded inside Rashel.\u003c/p\u003e\n\u003cp\u003eAll at once, she believed him absolutely. She couldn\u0027t seem to get her breath, and a void had opened in\u003c/p\u003e\n\u003cp\u003eher stomach. She lost any vestige of her previous calm.\u003c/p\u003e\n\u003cp\u003eHe\u0027s right-you were an idiot, she told herself wildly. You had every chance to stop him and you blew it.\u003c/p\u003e\n\u003cp\u003eAnd why? Because you were sorry for him? Sorry for a deranged monster who\u0027s going to tear you limb\u003c/p\u003e\n\u003cp\u003efrom limb now? Anyone as stupid as that deserves what they get.\u003c/p\u003e\n\u003cp\u003eShe felt as if she were falling, unable to get hold of anything....\u003c/p\u003e\n\u003cp\u003eAnd then suddenly she did seem to catch something. Something that she clung to desperately, trying to\u003c/p\u003e\n\u003cp\u003eresist the fear that wanted to suck her into darkness.\u003c/p\u003e\n\u003cp\u003eYou couldn\u0027t have done anything else.\u003c/p\u003e\n\u003cp\u003eIt was the little voice in her mind, being helpful for once. And, strangely, Rashel knew it was true. She\u003c/p\u003e\n\u003cp\u003ecouldn\u0027t have killed him when he was tied up and helpless, not without becoming a monster herself. And\u003c/p\u003e\n\u003cp\u003eafter hearing his story, she couldn\u0027t have ignored the pity she felt.\u003c/p\u003e\n\u003cp\u003eI\u0027m probably going to die now, she thought. And I\u0027m still scared. But I\u0027d do it over again. It was right.\u003c/p\u003e\n\u003cp\u003eShe hung on to that as she let the last seconds tick away, the last window of opportunity to stake him\u003c/p\u003e\n\u003cp\u003ewhile the cuffs still held. She knew they were ticking away, and she knew Quinn knew.\u003c/p\u003e\n\u003cp\u003e\"What a shame to rip your throat out,\" he said.\u003c/p\u003e\n\u003cp\u003eRashel held her ground.\u003c/p\u003e\n\u003cp\u003eQuinn gave the handcuffs a final wrench, and the metal hinges squealed. Then the stocks clattered onto\u003c/p\u003e\n\u003cp\u003ethe concrete and he stood up, free. Rashel couldn\u0027t see his face anymore; it was above the reach of the\u003c/p\u003e\n\u003cp\u003eflashlight.\u003c/p\u003e\n\u003cp\u003e\"Well,\" he said evenly.\u003c/p\u003e\n\u003cp\u003eRashel whispered, \"Well.\"\u003c/p\u003e\n\u003cp\u003eThey stood facing each other.\u003c/p\u003e\n\u003cp\u003eRashel was waiting for the tiny involuntary body movements that would give away which direction he\u003c/p\u003e\n\u003cp\u003ewas going to lunge. But he was more still than any enemy she\u0027d ever seen. He kept his tension inside,\u003c/p\u003e\n\u003cp\u003eready to explode only when he directed it. His control seemed to be complete.\u003c/p\u003e\n\u003cp\u003eHe\u0027s got zanshin, she thought.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re very good,\" she said softly.\u003c/p\u003e\n\u003cp\u003e\"Thanks. So are you.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"But it isn\u0027t going to matter in the end.\"\u003c/p\u003e\n\u003cp\u003eRashel started to say, \"We\u0027ll see\"-and he lunged.\u003c/p\u003e\n\u003cp\u003eShe had an instant\u0027s warning. A barely perceptible movement of his leg told her he was going to spring to\u003c/p\u003e\n\u003cp\u003ehis right, her left. Her body reacted without her direction, moving smoothly... and she didn\u0027t realize until\u003c/p\u003e\n\u003cp\u003eshe was doing it that she wasn\u0027t using the sword.\u003c/p\u003e\n\u003cp\u003eShe had stepped forward, inside his attack, and deflected it with a mirror palm block, striking the inner\u003c/p\u003e\n\u003cp\u003eside of his arm with her left arm. Hitting the nerves to try and numb the limb.\u003c/p\u003e\n\u003cp\u003eBut not cutting him. She realized with a dizzy sense of horror that she didn\u0027t want to use the sword on him.\u003c/p\u003e\n\u003cp\u003e\"You are going to die, idiot,\" he told her, and for an instant she wasn\u0027t sure if it was him saying it or the\u003c/p\u003e\n\u003cp\u003evoice in her head.\u003c/p\u003e\n\u003cp\u003eShe tried to push him away. All she could think was that she needed time, time to get her survival\u003c/p\u003e\n\u003cp\u003ereflexes back. She shoved at him--and then her bare hand brushed his, and something happened that was completely beyond her experience.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-the-chosen-night-world-5/page-5.html","bookId":2079,"creation":"Oct 5, 2019 5:30:52 PM","modification":"Oct 5, 2019 5:30:52 PM"}
