{"id":20965,"no":19,"title":"CHAPTER XIX. PLOTTING.","content":"\u0026nbsp;Return to Table of Contents \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The following Monday Miss Edith Hudson went to work for the International Machine Company as Mr. Compton’s stenographer. Nor could the most fastidious have discovered aught to criticize in the appearance or deportment of Little Eva.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The same day the certified public accountants came. Mr. Harold Bince appeared nervous and irritable, and he would have been more nervous and more irritable had he known that Jimmy had just learned the amount of the pay-check from Everett and that he had discovered that, although five men had been laid off and no new ones employed since the previous week, the payroll check was practically the same as before— approximately one thousand dollars more than his note-book indicated it should be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Phew!” whistled Jimmy. “These C.P.A.s are going to find this a more interesting job than they anticipated. Poor old Compton! I feel mighty sorry for him, but he had better find it out now than after that grafter has wrecked his business entirely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That afternoon Mr. Compton left the office earlier than usual, complaining of a headache, and the next morning his daughter telephoned that he was ill and would not come to the office that day. During the morning as Bince was walking through the shop he stopped to talk with Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Pete Krovac was a rat-faced little foreigner, looked upon among the men as a trouble-maker. He nursed a perpetual grievance against his employer and his job, and whenever the opportunity presented, and sometimes when it did not present itself, he endeavored to inoculate others with his dissatisfaction. Bince had hired the man, and during the several months that Krovac had been with the company, the assistant general manager had learned enough from other workers to realize that the man was an agitator and a troublemaker. Several times he had been upon the point of discharging him, but now he was glad that he had not, for he thought he saw in him a type that in the light of present conditions might be of use to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In fact, for the past couple of weeks he had been using the man in an endeavor to get some information concerning Torrance and his methods that would permit him to go to Compton with a valid argument for Jimmy’s discharge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Krovac,” he said as he came upon the man, “is Torrance interfering with you any now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He hasn’t got my job yet,” growled the other, “but he’s letting out hard-working men with families without any reason. The first thing you know you’ll have a strike on your hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t heard any one else complaining,” said Bince. “You will, though,” replied Krovac. “They don’t any of us know when we are going to be canned to give Compton more profit, and men are not going to stand for that long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said Bince, “I take it that he really hasn’t interfered with you much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he’s always around asking a lot of fool questions,” said Krovac. “Last week he asked every man in the place what his name was and what wages he was getting. Wrote it all down in a little book. I suppose he is planning on cutting pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bince’s eyes narrowed. “He got that information from every man in the shop?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bince was very pale. He stood in silence for some minutes, apparently studying the man before him. At last he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Krovac,” he said, “you don’t like this man Torrance, do you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said the other, “I don’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Neither do I,” said Bince. “I know his plans even better than you. This shop has short hours and good pay, but if we don’t get rid of him it will have the longest hours and lowest pay of any shop in the city.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?” questioned Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think,” said Bince, “that there ought to be some way to prevent this man doing any further harm here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked straight into Krovac’s eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is,” muttered the latter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be worth something of course,” suggested Bince. “How much?” asked Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I should think it ought to be worth a hundred dollars,” replied Bince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Krovac thought for a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can arrange it,” he said, “but I would have to have fifty now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot give it to you here,” said Bince, “but if I should happen to pass through the shop this afternoon you might find an envelope on the floor beside your machine after I have gone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The following evening as Jimmy alighted from the Indiana Avenue car at Eighteenth Street, two men left the car behind him. He did not notice them, although, as he made his way toward his boarding-house, he heard footsteps directly in his rear, and suddenly noting that they were approaching him rapidly, he involuntarily cast a glance behind him just as one of the men raised an arm to strike at him with what appeared to be a short piece of pipe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jimmy dodged the blow and then both men sprang for him. The first one Jimmy caught on the point of the chin with a blow that put its recipient out of the fight before he got into it, and then his companion, who was the larger, succeeded in closing with the efficiency expert. Inadvertently, however, he caught Jimmy about the neck, leaving both his intended victim’s arms free with the result that the latter was able to seize his antagonist low down about the body, and then pressing him close to him and hurling himself suddenly forward, he threw the fellow backward upon the cement sidewalk with his own body on top. With a resounding whack the attacker’s head came in contact with the concrete, his arms relaxed their hold upon Jimmy’s neck, and as the latter arose he saw both his assailants, temporarily at least, out of the fighting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jimmy glanced hastily in both directions. There was no one in sight. His boardinghouse was but a few steps away, and two minutes later he was safe in his room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A year ago,” he thought to himself, smiling, “my first thought would have been to have called in the police, but the Lizard has evidently given me a new view-point in regard to them,” for the latter had impressed upon Jimmy the fact that whatever knowledge a policeman might have regarding one was always acquired with the idea that eventually it might be used against the person to whom it pertained.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a policeman don’t know about you will never hurt you,” was one way that the Lizard put it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Jimmy appeared in the shop the next morning he noted casually that Krovac had a cut upon his chin, but he did not give the matter a second thought. Bince had arrived late. His first question, as he entered the small outer office where Mr. Compton’s stenographer and his worked, was addressed to Miss Edith Hudson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mr. Torrance down yet?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied the girl, “he has been here some time. Do you wish to see him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Edith thought that the “No” which he snapped at her was a trifle more emphatic than the circumstances seemed to warrant, nor could she help but notice after he had entered his office the vehement manner in which he slammed the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what’s eating him,” thought Miss Hudson to herself. “Of course he doesn’t like Jimmy, but why is he so peeved because Jimmy came to work this morning—I don’t quite get it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Almost immediately Bince sent for Krovac, and when the latter came and stood before his desk the assistant general manager looked up at him questioningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look at my chin,” was Krovac’s reply, “and he damn near killed the other guy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe you’ll have better luck the next time,” growled Bince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There ain’t goin’ to be no next time,” asserted Krovac. “I don’t tackle that guy again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bince held out his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” he said, “you might return the fifty then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Return nothin’,” growled Krovac. “I sure done fifty dollars’ worth last night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come on,” said Bince, “hand over the fifty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothin’ doin’,” said Krovac with an angry snarl. “It might be worth another fifty to you to know that I wasn’t going to tell old man Compton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You damn scoundrel!” exclaimed Bince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t go callin’ me names,” admonished Krovac. “A fellow that hires another to croak a man for him for one hundred bucks ain’t got no license to call nobody names.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bince realized only too well that he was absolutely in the power of the fellow and immediately his manner changed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come,” he said, “Krovac, there is no use in our quarreling. You can help me and I can help you. There must be some other way to get around this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you trying to do?” asked Krovac. “I got enough on you now to send you up, and I don’t mind tellin’ yuh,” he added, “that I had a guy hid down there in the shop where he could watch you drop the envelope behind my machine. I got a witness, yuh understand!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bince did understand, but still he managed to control his temper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What of it?” he said. “Nobody would believe your story, but let’s forget that. What we want to do is get rid of Torrance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t all you want to do,” said Krovac. “There is something else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bince realized that he was compromised as hopelessly already as he could be if the man had even more information.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said, “there is something beside Torrance’s interference in the shop. He’s interfering with our accounting system and I don’t want it interfered with just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean the pay-roll?” asked Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It might be,” said Bince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You want them two new guys that are working in the office croaked, too?” asked Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want anybody ‘croaked’,” replied Bince. “I didn’t tell you to kill Torrance in the first place. I just said I didn’t want him to come back here to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, hell, what you givin’ us?” growled the other. “I knew what you meant and you knew what you meant, too. Come across straight. What do you want?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want all the records of the certified public accountants who are working here,” said Bince after a moment’s pause. “I want them destroyed, together with the pay-roll records.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They will all be in the safe in Mr. Compton’s office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Krovac knitted his brows in thought for several moments. “Say,” he said, “we can do the whole thing with one job.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” asked Bince,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We can get rid of this Torrance guy and get the records, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How?” asked Bince. “Do you know where Feinheimer’s is?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you be over there to-night about ten thirty and I’ll introduce you to a guy who can pull off this whole thing, and you and I won’t have to be mixed up in it at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-night at ten thirty,” said Bince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At Feinheimer’s,” said Krovac.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2923/80423.html","bookId":1095,"creation":"Aug 2, 2019 12:08:08 PM","modification":"Aug 2, 2019 12:08:08 PM"}
