{"id":110062,"no":23,"title":"Page 23","content":"\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003eA FUCKED-UP DAY\u003c/p\u003e\n\u003cp\u003eIt was a fucked-up day in the City by the Bay. At first light, flocks of vultures perched on the superstructures of the Golden Gate and Bay Bridges, and glared down at commuters as if they had a lot of goddamn gall to still be alive and driving. Traffic copters that were diverted to photograph the ranks of carrion birds ended up covering a spiral cloud of bats that circled the Transamerica pyramid for ten minutes, then seemed to evaporate into a black mist that floated out over the Bay. Three swimmers who had been competing in the San Francisco Triathlon drowned in the Bay, and a helicopter camera photographed something under the water, a dark shape approaching one of the swimmers from below and dragging him under. Numerous replays of the tape revealed that rather than the sleek shape of a shark, the creature had a wide wingspan and a distinctly horned head, unlike any ray or skate that anyone had ever seen before. The ducks in Golden Gate Park suddenly took to the wing and left the area, the hundreds of sea lions that normally lounged in the sun down at Pier 39 were gone as well, and even the pigeons seemed to have disappeared from the City.\u003c/p\u003e\n\u003cp\u003eA grunt reporter who had been covering the overnight police blotter noticed the coincidence of seven reports of violence or missing persons at local-area secondhand stores, and by early evening the television stations were mentioning it, along with spectacular footage of the Book \u0027em Danno building burning in the Mission. And there were hundreds of singular events experienced by individuals: creatures moving in the shadows, voices and screams from the sewer grates, milk souring, cats scratching owners, dogs howling, and a thousand people woke up to find that they no longer cared for the taste of chocolate. It was a fucked-up day.\u003c/p\u003e\n\u003cp\u003eCharlie spent the rest of the night fretting and checking locks, then double-checking them, then looking on the Internet for clues about the Underworlders, just in case someone posted a brand-new ancient document since he\u0027d last checked. He wrote a will, and several letters, which he walked outside and put in the mailbox out on the street rather than with the outgoing mail on the counter of the store. Then, around dawn, completely exhausted yet with his Beta Male imagination racing at a thousand miles an hour, he took two of the sleeping pills Jane had given him and slept through the fucked-up day, to be awakened in early evening by a call from his darling daughter.\u003c/p\u003e\n\u003cp\u003e\"Hello.\"\u003c/p\u003e\n\u003cp\u003e\"Aunt Cassie is an anti-Semite,\" said Sophie.\u003c/p\u003e\n\u003cp\u003e\"Honey, it\u0027s six in the morning. Can we discuss Aunt Cassie\u0027s politics a little later?\"\u003c/p\u003e\n\u003cp\u003e\"It is not, it\u0027s six at night. It\u0027s bath time, and Aunt Cassie won\u0027t let me bring Alvin and Mohammed into the bathroom with me for my bath, because she\u0027s an anti-Semite.\"\u003c/p\u003e\n\u003cp\u003eCharlie looked at his watch. He was sort of glad that it was six in the evening and he was talking to his daughter. Whatever happened while he was sleeping at least hadn\u0027t affected that.\u003c/p\u003e\n\u003cp\u003e\"Cassie is not an anti-Semite.\" It was Jane on the other line.\u003c/p\u003e\n\u003cp\u003e\"Is too,\" said Sophie. \"Be careful, Daddy, Aunt Jane is an anti-Semite sympathizer.\"\u003c/p\u003e\n\u003cp\u003e\"I am not,\" Jane said.\u003c/p\u003e\n\u003cp\u003e\"Listen to how smart my daughter is,\" said Charlie. \"I didn\u0027t know words like anti-Semite and sympathizer when I was her age, did you?\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t trust the goyim, Daddy,\" said Sophie. She lowered her voice to a whisper. \"They hate baths, the goyim.\"\u003c/p\u003e\n\u003cp\u003e\"Daddy\u0027s a goyim, too, baby.\"\u003c/p\u003e\n\u003cp\u003e\"Oh my God, they\u0027re everywhere, like pod people!\" He heard his daughter drop the phone, scream, and then a door slammed.\u003c/p\u003e\n\u003cp\u003e\"Sophie, you unlock this door this instant,\" Cassie said in the background.\u003c/p\u003e\n\u003cp\u003eJane said, \"Charlie, where does she get this stuff? Are you teaching her this?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Mrs. Korjev - she\u0027s descended from Cossacks and she has a little residual guilt for what her ancestors did to the Jews.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Jane said, not interested now that she couldn\u0027t blame Charlie. \"Well, you shouldn\u0027t let the dogs in the bathroom with her. They eat the soap and sometimes they get in the tub, and then - \"\u003c/p\u003e\n\u003cp\u003e\"Let them go with her, Jane,\" Charlie interrupted. \"They may be the only thing that can protect her.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, but I\u0027m only letting them eat the cheap soaps. No French-milled soaps.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re fine with domestic soap, Jane. Look, I drew up a holographic will last night. If something happens to me, I want you to raise Sophie. It\u0027s in there.\"\u003c/p\u003e\n\u003cp\u003eJane didn\u0027t answer. He could hear her breathing on the other end.\u003c/p\u003e\n\u003cp\u003e\"Jane?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, sure. Of course. What the hell is going on with you guys? What\u0027s the big danger Sophie\u0027s in? Why are you being spooky like this? And why didn\u0027t you call earlier, you fucker?\"\u003c/p\u003e\n\u003cp\u003e\"I was up all night doing stuff. Then I took two of those sleeping pills you gave me. Suddenly twelve hours are gone.\"\u003c/p\u003e\n\u003cp\u003e\"You took two? Never take two.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, thanks,\" Charlie said. \"Anyway, I\u0027m sure I\u0027ll be okay, but if for some reason I\u0027m not, you need to take Sophie and get out of the City for a while. I mean like up in the Sierras. I also sent you a letter explaining everything, as much as I know, anyway. Only open it if something happens, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing better happen, you fuck. I just lost Mom, and I - why the hell are you talking like this, Charlie? What kind of trouble are you in?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you, Jane. You have to trust me that I didn\u0027t have any choice in the matter.\"\u003c/p\u003e\n\u003cp\u003e\"How can I help?\"\u003c/p\u003e\n\u003cp\u003e\"By doing exactly what you\u0027re doing, taking care of Sophie, keeping her safe, and keeping the hellhounds with her at all times.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, but nothing better happen to you. Cassie and I are going to get married and I want you to give me away. And I want to borrow your tux, too. It\u0027s Armani, right?\"\u003c/p\u003e\n\u003cp\u003e\"No, Jane.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t give me away?\"\u003c/p\u003e\n\u003cp\u003e\"No, no, it\u0027s not that, I\u0027d pay her to take you, it\u0027s not that.\"\u003c/p\u003e\n\u003cp\u003e\"Then you don\u0027t think that gay people should be allowed to get married, is that it? You\u0027re finally coming clean. I knew it, after all - \"\u003c/p\u003e\n\u003cp\u003e\"I just don\u0027t think that gay people should be allowed to get married wearing my tux.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Jane said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll wear my Armani tux and I\u0027ll have to rent some piece of crap or buy something new and cheap, and then I\u0027ll go through eternity looking like a total dork in the wedding pictures. I know how you guys like to show wedding pictures - it\u0027s like a disease.\"\u003c/p\u003e\n\u003cp\u003e\"By \u0027you guys,\u0027 you mean lesbians?\" Jane said, sounding very much like a prosecuting attorney.\u003c/p\u003e\n\u003cp\u003e\"Yes, I mean lesbians, dumbfuck,\" said Charlie, sounding very much like a hostile witness.\u003c/p\u003e\n\u003cp\u003e\"Oh, okay,\" Jane said. \"It is my wedding, I guess I can buy a tux.\"\u003c/p\u003e\n\u003cp\u003e\"That would be nice,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sort of needing the pants cut a little looser in the seat these days anyway,\" Jane said.\u003c/p\u003e\n\u003cp\u003e\"Thatta girl.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ll be safe and give me away.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll sure try. You think Cassandra will let me bring the little Jewish kid?\"\u003c/p\u003e\n\u003cp\u003eJane laughed. \"Call me every hour,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t do that.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, when you can.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Charlie said. \"Bye.\" He smiled to himself and rolled out of bed, wondering if this might be the last time he would ever do that. Smile.\u003c/p\u003e\n\u003cp\u003eCharlie showered, ate a peanut-butter-and-jelly sandwich, and put on a thousand-dollar suit for which he had paid forty bucks. He limped around the bedroom for a few minutes and decided that his leg felt pretty good and he could do without the foam walking cast, so he left it on the floor by the bed. He put on a pot of coffee and called Inspector Rivera.\u003c/p\u003e\n\u003cp\u003e\"It was a fucked-up day,\" Rivera said. \"Charlie, you need to take your daughter and get out of town.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do that. This is about me. You\u0027ll keep me informed, right?\"\u003c/p\u003e\n\u003cp\u003e\"Promise you won\u0027t try to do anything stupid or heroic?\"\u003c/p\u003e\n\u003cp\u003e\"Not in my DNA, Inspector. I\u0027ll call you if I see anything.\"\u003c/p\u003e\n\u003cp\u003eCharlie disconnected, having no idea what he was going to do, but feeling like he had to do something. He called Jane\u0027s house to say good night to Sophie.\u003c/p\u003e\n\u003cp\u003e\"I just want you to know that I love you very much, honey.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too, Daddy. Why did you call?\"\u003c/p\u003e\n\u003cp\u003e\"What, you have a meeting or something?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re having ice cream.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s nice. Look, Sophie, Daddy has to go do some things, so I want you to stay with Aunt Jane for a few days, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Do you need some help? I\u0027m free.\"\u003c/p\u003e\n\u003cp\u003e\"No, honey, but thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, Daddy. Alvin is looking at my ice cream. He looks hungry, like bear. I have to go.\"\u003c/p\u003e\n\u003cp\u003e\"Love you, honey.\"\u003c/p\u003e\n\u003cp\u003e\"Love you, Daddy.\"\u003c/p\u003e\n\u003cp\u003e\"Apologize to Aunt Cassie for calling her an anti-Semite.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Kay.\" Click.\u003c/p\u003e\n\u003cp\u003eShe hung up on him. The apple of his eye, the light of his life, his pride and joy, hung up on him. He sighed, but felt better. Heartbreak is the natural habitat of the Beta Male.\u003c/p\u003e\n\u003cp\u003eCharlie took a few minutes in the kitchen to sharpen the edge of the sword-cane on the back of the electric can opener he and Rachel had received as a wedding present, then he headed out to check on the store.\u003c/p\u003e\n\u003cp\u003eAs soon as he opened the door to the back staircase Charlie heard strange animal noises coming from the store. It sounded as if they were coming from the back room, and there were no lights on, although he could see plenty of light filtering in from the store. Was this it? Sort of solved the problem of what he was going to do.\u003c/p\u003e\n\u003cp\u003eHe drew the sword from his cane and crept down the stairs in a crouch, moving along the edge of each step to minimize squeakage. Halfway down he saw the source of the animal noises and he recoiled, leaping nearly halfway back up the staircase.\u003c/p\u003e\n\u003cp\u003e\"For the love of God!\"\u003c/p\u003e\n\u003cp\u003e\"It needed to be done,\" Lily said. She was astraddle Ray Macy, her plaid pleated skirt (mercifully) draped out over him, covering the parts that would have caused Charlie to have to tear his eyes out, which he was thinking about doing anyway.\u003c/p\u003e\n\u003cp\u003e\"It did,\" Ray agreed breathlessly.\u003c/p\u003e\n\u003cp\u003eCharlie peeked down into the back room - they were still at it, Lily riding Ray like he was a mechanical bull, one bare breast bouncing out of the lapel of her chef \u0027s coat.\u003c/p\u003e\n\u003cp\u003e\"He was despondent,\" she said. \"I found him giving himself hickies with the shop vac. It\u0027s for the greater good, Asher.\"\u003c/p\u003e\n\u003cp\u003e\"Well, stop it,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"No, no, no, no, no,\" said Ray.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a charity thing,\" Lily said.\u003c/p\u003e\n\u003cp\u003e\"You know, Lily,\" Charlie said, covering his eyes, \"you could exercise your charity in other ways, like Salvation Army Santa or something.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to fuck those guys. Most of them are raging alcoholics, and they stink. At least Ray is clean.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mean do one, I mean be one. Ring the bell with the little red kettle. Jeez.\"\u003c/p\u003e\n\u003cp\u003e\"I am clean,\" said Ray.\u003c/p\u003e\n\u003cp\u003e\"You shut up,\" Charlie said. \"She\u0027s young enough to be your daughter.\"\u003c/p\u003e\n\u003cp\u003e\"He was suicidal,\" Lily said. \"I may be saving his life.\"\u003c/p\u003e\n\u003cp\u003e\"She is,\" Ray said.\u003c/p\u003e\n\u003cp\u003e\"Shut up, Ray,\" Charlie said. \"This is pathetic, desperate pity sex, that\u0027s all it is.\"\u003c/p\u003e\n\u003cp\u003e\"He knows that,\" Lily said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mind,\" said Ray.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m doing this for the cause, too,\" Lily said. \"Ray was holding out on you.\"\u003c/p\u003e\n\u003cp\u003e\"I was?\" said Ray.\u003c/p\u003e\n\u003cp\u003e\"How?\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"He found a woman who was buying all the soul vessels. She was with the clients you missed. Somewhere in the Mission. He wasn\u0027t going to tell you about her.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you\u0027re talking about,\" Ray said. Then added, \"Faster, please.\"\u003c/p\u003e\n\u003cp\u003e\"Tell him the address,\" Lily said.\u003c/p\u003e\n\u003cp\u003e\"Lily,\" Charlie said, \"this isn\u0027t really necessary.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Ray said.\u003c/p\u003e\n\u003cp\u003eThere was a loud smack. Charlie opened his eyes. They were still there, doing it, but Ray\u0027s right cheek was bright red and Lily was winding up to slap him again.\u003c/p\u003e\n\u003cp\u003e\"Tell him!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s on Guerrero Street, between Eighteenth and Nineteenth, I don\u0027t know the number, but it\u0027s a big green Victorian, you can\u0027t miss it. Three Jewels Buddhist Center.\"\u003c/p\u003e\n\u003cp\u003eSMACK!\u003c/p\u003e\n\u003cp\u003e\"Ouch, I told him,\" Ray whined.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s for not getting the address, BITCH!\" Lily said. Then to Charlie: \"There you go, Asher. I want a prime position when you take over the Underworld!\"\u003c/p\u003e\n\u003cp\u003eCharlie thought that one of the first things he was going to change when he took over was expanding The Great Big Book of Death to include how to handle situations like this. But instead he said, \"You got it, Lily. You\u0027ll be in charge of dress code and torture.\"\u003c/p\u003e\n\u003cp\u003e\"Sweet,\" Lily said. \"\u0027Scuse me, Asher, I have to finish this.\" Then to Ray: \"Hear that? No more flannel shirts for you, grommet!\" SMACK!\u003c/p\u003e\n\u003cp\u003eThe grunts coming from Ray increased in frequency and intensity.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Charlie said. \"I\u0027ll just go out the other door.\"\u003c/p\u003e\n\u003cp\u003e\"See ya,\" Ray said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m never going to look either one of you in the eye again, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Sounds good, Asher,\" Lily said. \"Be careful.\"\u003c/p\u003e\n\u003cp\u003eCharlie crept back up the steps, went out the front door of his apartment and down the elevator to the street entrance, suppressing his gag reflex the whole way. On the street he flagged down a cab and rode into the Mission, trying to wipe the image of his shagging employees out of his mind.\u003c/p\u003e\n\u003cp\u003eThe Morrigan had followed the gift souls that had escaped through the drains to a deserted street in the Mission. Now they waited, watching the green Victorian building from storm-drain grates at either end of the street. They were more cautious now, their rapacious nature having been dampened somewhat by having been severely blown up the night before.\u003c/p\u003e\n\u003cp\u003eThey called them the gift souls because the little patchwork creatures brought the souls right to them in the sewers - the gifts showing up in the Morrigan\u0027s weakest moment. After the accursed Boston terrier had chased them through miles of pipelines, leaving them battered and exhausted on a high ledge at a pipe junction, along marched twenty or so of the darling little nightmares, all dressed up in finery and carrying just what they needed to heal their wounds and replenish their strength: human souls. And thus renewed, they were able to scare away that obnoxious little dog. The Morrigan were back - not to the strength they\u0027d achieved before the explosion, maybe not even enough to fly, but certainly enough to venture Above once again, especially with so many souls at hand.\u003c/p\u003e\n\u003cp\u003eNo one was out on the streets tonight except the junkies, the hookers, and the homeless. After the fucked-up day in the City, most everyone had decided that it was just a better idea to stay in, safer. To the Morrigan (for all they cared), they were safer in their homes the same way a tuna fish is safer in a can, but no one knew that yet. No one knew what they were hiding from except Charlie Asher, and he was getting out of a cab right in front of them as they watched.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s New Meat,\" said Macha.\u003c/p\u003e\n\u003cp\u003e\"We should give him a new name,\" said Babd. \"I mean, he\u0027s really not that new anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Hush,\" hushed Macha.\u003c/p\u003e\n\u003cp\u003e\"Hey, lover,\" Babd called out of her drain. \"Did you miss me?\"\u003c/p\u003e\n\u003cp\u003eCharlie paid the cabbie and stood in the middle of the street looking at the big jade-green Queen Anne. There were lights on in the turret upstairs and in one window downstairs. He could just make out the sign that read THREE JEWELS BUDDHIST CENTER. He started to step toward the house and saw movement in the lattice under the porch - eyes shining. A cat maybe. His cell phone rang and he flipped it open.\u003c/p\u003e\n\u003cp\u003e\"Charlie, it\u0027s Rivera. I have some good news; we found Carrie Long, the woman from the pawnshop, and she\u0027s still alive. She was tied up and thrown in a Dumpster a block from her store.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great,\" Charlie said. But he wasn\u0027t feeling great. The things that had been moving under the porch were coming out. Moving up the stairs, standing on the porch, lining up and facing him. Twenty or thirty of them, a little more than a foot tall, dressed in ornate period costumes. Each had the skeletal face of a dead animal, cats, foxes, badgers - animals Charlie couldn\u0027t identify, but just the skulls - the eye sockets empty, black. Yet they stared.\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t believe what she said put her there, Charlie. Little creatures, little monsters, she said.\"\u003c/p\u003e\n\u003cp\u003e\"About fourteen inches tall,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"Yeah, how\u0027d you know?\"\u003c/p\u003e\n\u003cp\u003e\"Lots of teeth and claws, like animal parts stuck together, all dressed up like they were going to a grand costume ball?\"\u003c/p\u003e\n\u003cp\u003e\"What are you telling me, Charlie? What do you know?\"\u003c/p\u003e\n\u003cp\u003e\"Just guessing,\" Charlie said. He unclipped the latch on his sword-cane.\u003c/p\u003e\n\u003cp\u003e\"Hey, lover,\" came a female voice from behind him. \"Did you miss me?\"\u003c/p\u003e\n\u003cp\u003eCharlie turned. She was crawling out of the drain almost directly behind him.\u003c/p\u003e\n\u003cp\u003e\"The bad news,\" Rivera said, \"is we found the junk dealer and the bookstore guy from Book \u0027em Danno - pieces of them.\"\u003c/p\u003e\n\u003cp\u003e\"That is bad news,\" Charlie said. He started moving up the street, away from the sewer harpy and the porch full of Satan\u0027s sock puppets.\u003c/p\u003e\n\u003cp\u003e\"New Meat,\" came a voice from up the street.\u003c/p\u003e\n\u003cp\u003eCharlie looked to see another sewer harpy coming out of the drain, her eyes gleaming black in the streetlight. Behind him he heard the clacking of little animal teeth.\u003c/p\u003e\n\u003cp\u003e\"Charlie, I still think you should leave town for a while, but if you don\u0027t, and don\u0027t tell anyone I told you this, you should get a gun, maybe a couple of guns.\"\u003c/p\u003e\n\u003cp\u003e\"I think that would be a great idea,\" Charlie said. The two sewer harpies were moving very slowly toward him, awkwardly, as if their nerves were short-circuiting. The one closest to him, the one from the alley in North Beach, was licking her lips. She looked a little ragged compared to the night she\u0027d seduced him. He moved up the street away from them.\u003c/p\u003e\n\u003cp\u003e\"A shotgun, so you won\u0027t need to learn to shoot. I can\u0027t give you one, but - \"\u003c/p\u003e\n\u003cp\u003e\"Inspector, I\u0027m going to have to get back to you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious, Charlie, whatever these things are, they are going after your kind.\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea how clear that is to me, Inspector.\"\u003c/p\u003e\n\u003cp\u003e\"Is that the one who shot me?\" said the closest harpy. \"Tell him I\u0027m going to suck his eyeballs out of the sockets and chew them in his ear.\"\u003c/p\u003e\n\u003cp\u003e\"You get that, Inspector?\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s there?\"\u003c/p\u003e\n\u003cp\u003e\"They,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"This way, Meat,\" said the third sewer harpy, coming out of the drain at the far end of the block. She stood, extended her claws, and flicked a line of venom down the side of a parked car. The paint sizzled and ran where it hit.\u003c/p\u003e\n\u003cp\u003e\"Where are you, Charlie? Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in the Mission. Near the Mission.\"\u003c/p\u003e\n\u003cp\u003eThe little creatures were coming down the steps now, down the walk toward the street.\u003c/p\u003e\n\u003cp\u003e\"Look,\" said a harpy, \"he brought presents.\"\u003c/p\u003e\n\u003cp\u003e\"Charlie, where exactly are you?\" said Rivera.\u003c/p\u003e\n\u003cp\u003e\"Gotta go, Inspector.\" Charlie flipped the phone closed and dropped it in his coat pocket. Then he drew the sword from the cane and turned to the harpy from the alley. \"For you,\" he said to her, whipping the sword in a flourish through the air.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s sweet,\" she said. \"You always think about my needs.\"\u003c/p\u003e\n\u003cp\u003eThe 1957 Cadillac Eldorado Brougham was the perfect show-off of death machines. It consisted of nearly three tons of steel stamped into a massively mawed, high-tailed beast, lined with enough chrome to build a Terminator and still have parts left over - most of it in long, sharp strips that peeled off on impact and became lethal scythes to flay away pedestrian flesh. Under the four headlights it sported two chrome bumper bullets that looked like unexploded torpedoes or triple-G-cup Madonna death boobs. It had a noncollapsible steering column that would impale the driver upon any serious impact, electric windows that could pinch off a kid\u0027s head, no seat belts, and a 325 horsepower V8 with such appallingly bad fuel efficiency that you could hear it trying to slurp liquefied dinosaurs out of the ground when it passed. It had a top speed of a hundred and ten miles an hour, mushy, bargelike suspension that could in no way stabilize the car at that speed, and undersized power brakes that wouldn\u0027t stop it either. The fins jutting from the back were so high and sharp that the car was a lethal threat to pedestrians even when parked, and the whole package sat on tall, whitewall tires that looked, and generally handled, like oversized powdered doughnuts. Detroit couldn\u0027t have achieved more deadly finned ostentatia if they\u0027d covered a killer whale in rhinestones. It was a masterpiece.\u003c/p\u003e\n\u003cp\u003eAnd the reason you need to know all that, is that along with the battle-worn Morrigan and the well-dressed chimeras, a \u002757 Eldorado was rapidly approaching Charlie.\u003c/p\u003e\n\u003cp\u003eThe bloodred lacquered Eldo slid around the corner, tires screaming like flaming peacocks, hubcaps spinning off toward the curb, engine roaring, spewing blue smoke out of the rear wheel wells like a flatulent dragon. The first of the Morrigan turned in time to take a bumper bullet in the thigh before she was dragged and folded under the car and spit out the back into a black heap. The headlights came on and the Caddy veered toward the Morrigan nearest Charlie.\u003c/p\u003e\n\u003cp\u003eThe animal creatures scurried back up the sidewalk and Charlie ran up onto the hood of a parked Honda as the Eldo smacked the second Morrigan. She rag-doll-whipped over the hood as the car\u0027s brakes screamed, then flew twenty yards down the street. The Caddy peeled out and hit her again, this time rolling over her with a series of thumps and leaving her tossing down the tarmac, shedding pieces as she rolled. The Caddy blazed on toward the final Morrigan.\u003c/p\u003e\n\u003cp\u003eThis one had a few seconds on her sisters and started running up the street, her shape changing, arms to wings, tail feathers trying to manifest, but she didn\u0027t seem able to make the transformation in time to fly. The Eldo plowed over her, then hit the brakes, reversed, and burned rubber on her back.\u003c/p\u003e\n\u003cp\u003eCharlie ran up on the roof of the Honda, ready to leap away from the street, but the Caddy stopped and the blacked-out electric window wound down.\u003c/p\u003e\n\u003cp\u003e\"Get the fuck in the car,\" said Minty Fresh.\u003c/p\u003e\n\u003cp\u003eMinty Fresh hit the final Morrigan again as he speeded off down the block, took two screeching lefts, then pulled the car to the curb, jumped out, and ran around to the front.\u003c/p\u003e\n\u003cp\u003e\"Oh, goddamn,\" said Minty Fresh (damn on the downbeat, with pain and sustain). \"Goddamn, my hood and grille are all fucked up. Goddamn. I will tolerate the rising of darkness to cover the world, but you do not fuck with my ride.\"\u003c/p\u003e\n\u003cp\u003eHe jumped back in the car, threw it into gear, and screeched around the next corner.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to run over the bitches again. You do not fuck with my ride.\"\u003c/p\u003e\n\u003cp\u003e\"Well, what did you think would happen when you ran them over?\"\u003c/p\u003e\n\u003cp\u003e\"Not this. I never ran over anyone before. Don\u0027t act like that\u0027s a surprise.\"\u003c/p\u003e\n\u003cp\u003eCharlie looked at the gleaming interior of the car, the bloodred leather seats, the dash fitted with walnut burl and gold-plated knobs.\u003c/p\u003e\n\u003cp\u003e\"This is a great car. My mailman would love this car.\"\u003c/p\u003e\n\u003cp\u003e\"Your mailman?\"\u003c/p\u003e\n\u003cp\u003e\"He collects vintage pimp wear.\"\u003c/p\u003e\n\u003cp\u003e\"So what are you trying to say?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003eThey were already on Guerrero Street and Minty floored it as they approached the target block. The first Morrigan he had hit was just getting to her knees when he hit her again, knocking her over two parked cars and into the side of a vacant building. The second one turned to face them and bared her claws, which raked the hood as he rolled over her with a drumroll of thumps, then he ran over the third one\u0027s legs as she was crawling back into the storm sewer.\u003c/p\u003e\n\u003cp\u003e\"Jeez,\" Charlie said, turning and looking out the back window.\u003c/p\u003e\n\u003cp\u003eMinty Fresh seemed to turn his full attention to driving safely now. \"What the hell are those things?\"\u003c/p\u003e\n\u003cp\u003e\"I call them sewer harpies. They\u0027re the things that call to us from the storm sewers. They\u0027re a lot stronger now than they used to be.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re scary is what they are,\" said Minty.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Charlie said. \"Have you gotten a good look at them? I mean, they got the badonkadonk out back and some fine bajoopbadangs up front, know what I\u0027m sayin\u0027, dog? Buss a rock wid a playa?\" He offered his fist for Minty to buss him a rock, but alas, the mint one left him hangin\u0027.\u003c/p\u003e\n\u003cp\u003e\"Stop that,\" Fresh said.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"Talk Like a Playa in Ten Days or Less - Stone Thug Edition?\" Minty asked.\u003c/p\u003e\n\u003cp\u003eCharlie nodded. \"We got the CD into the store a couple of months ago. I practice in the van. How am I doing?\"\u003c/p\u003e\n\u003cp\u003e\"Your Negro-osity is uncanny. I had to keep checking to make sure you\u0027re still white.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" Charlie said, then, as if a light went on: \"Hey, I\u0027ve been looking for you - where the hell have you been?\"\u003c/p\u003e\n\u003cp\u003e\"Hiding out. One of those things came after me on the BART a few nights ago when I was coming back from Oakland.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you get away?\"\u003c/p\u003e\n\u003cp\u003e\"Those little animal things, a bunch of them attacked her in the dark. I could hear her screaming at them, tearing them to ribbons, but they held her off until the train pulled into the station, which was full of people. She bolted back into the tunnel. There were pieces of the animal creatures everywhere in the train car.\"\u003c/p\u003e\n\u003cp\u003eMinty turned onto Van Ness and started heading toward Charlie\u0027s side of town.\u003c/p\u003e\n\u003cp\u003e\"So they helped you? They\u0027re not part of the Underworlders trying to take over?\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t appear to be. They saved my ass.\"\u003c/p\u003e\n\u003cp\u003e\"So you know some of the Death Merchants have been killed?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know. It wasn\u0027t in the paper. I saw where Anton\u0027s shop burned up last night. He didn\u0027t make it out?\"\u003c/p\u003e\n\u003cp\u003e\"They found pieces of him,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"Charlie, I think I caused this.\" Minty Fresh turned and really looked at Charlie for the first time, his golden eyes looking forlorn. \"I failed to collect my last two soul vessels, and all of this started.\"\u003c/p\u003e\n\u003cp\u003e\"I thought it was me,\" Charlie said. \"I missed two as well. But I don\u0027t think it\u0027s us. My two clients are alive, I think they\u0027re in that house where I was going when you saved me: the Three Jewels Buddhist Center. There\u0027s a woman there who\u0027s been buying up soul vessels, too.\"\u003c/p\u003e\n\u003cp\u003e\"Cute brunette?\" Minty asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Why?\"\u003c/p\u003e\n\u003cp\u003e\"She bought some from me, too. Tried to disguise herself, but it was her.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she\u0027s in that house back there. I\u0027ve got to go back there.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want anything to do with those bitches with the claws,\" Minty said.\u003c/p\u003e\n\u003cp\u003e\"True dat,\" Charlie said. \"I had a thing with one of them.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, she got all up in my grille and shit - had to cut da ho loose.\"\u003c/p\u003e\n\u003cp\u003e\"Stop that.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry. Anyway, I\u0027ve got to go back.\"\u003c/p\u003e\n\u003cp\u003e\"You sure? I don\u0027t think they\u0027re dead. Doesn\u0027t look like they can be dead.\"\u003c/p\u003e\n\u003cp\u003e\"You could run over them again. By the way, how did you know where to find me?\"\u003c/p\u003e\n\u003cp\u003e\"After I heard about Anton\u0027s place burning, I tried to call him and got a disconnected message, so I went to your store. I talked to that little Goth girl you have working for you. She told me where you went. Talked to her for about ten minutes. She knows about me - I mean us? The Death Merchants?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I told her a long time ago. Wasn\u0027t she, uh, busy when you got there? With a guy, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"No. She seeing anyone?\"\u003c/p\u003e\n\u003cp\u003e\"I thought you were gay?\"\u003c/p\u003e\n\u003cp\u003e\"I never said that.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but you didn\u0027t go out of your way to deny it either.\"\u003c/p\u003e\n\u003cp\u003e\"Charlie, I run a music store in the Castro, I\u0027d do more business as a gay Death Merchant than a straight shopkeeper.\"\u003c/p\u003e\n\u003cp\u003e\"Good point. I never thought of that.\"\u003c/p\u003e\n\u003cp\u003e\"Color me surprised. So, she seeing anyone?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s half your age and I think she\u0027s a little twisted - sexually, I mean.\"\u003c/p\u003e\n\u003cp\u003e\"So is she seeing anyone?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s like a little sister to me, Fresh. Don\u0027t you have employees like that?\"\u003c/p\u003e\n\u003cp\u003e\"Have you never met anyone who works in a record store? There\u0027s no greater repository of unjustified arrogance in the world. I\u0027d poison my employees if I thought I could find replacements.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think she\u0027s seeing anybody, but since the world is about to be taken over by the Forces of Darkness, you may not have time for dating.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. She seems like she might have an in with the Forces of Darkness. I like her, she\u0027s funny in a sort of macabre way, and she likes Miles.\"\u003c/p\u003e\n\u003cp\u003e\"Lily likes Miles Davis?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know that about your little sister?\"\u003c/p\u003e\n\u003cp\u003eCharlie threw his hands up. \"Take her, use her, throw her away, I don\u0027t care, she\u0027s only part-time. You can date my daughter, too. She\u0027s going to be six and probably loves Coltrane for all I know.\"\u003c/p\u003e\n\u003cp\u003e\"Calm down, you\u0027re overreacting.\"\u003c/p\u003e\n\u003cp\u003e\"Just turn around and take me back to that Buddhist center. I\u0027ve got to stop this thing. It\u0027s all on me, Fresh. I\u0027m the Luminatus.\"\u003c/p\u003e\n\u003cp\u003e\"You are not.\"\u003c/p\u003e\n\u003cp\u003e\"I am,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the Great Death - with a capital D? You? You know this to be true?\"\u003c/p\u003e\n\u003cp\u003e\"I do,\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"I knew there was something different about you, but I thought that the Luminatus would be - I don\u0027t know - taller.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t start with that, okay.\"\u003c/p\u003e\n\u003cp\u003eMinty swung the car off Van Ness into a hotel turnaround.\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\" Charlie said.\u003c/p\u003e\n\u003cp\u003e\"To run over some sewer harpies again.\"\u003c/p\u003e\n\u003cp\u003e\"Back to the Buddhist center?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. You have any weapons besides that stupid sword?\"\u003c/p\u003e\n\u003cp\u003e\"My cop friend told me I should get a gun.\"\u003c/p\u003e\n\u003cp\u003eMinty Fresh reached into his moss-green jacket and came out with the biggest pistol Charlie had ever seen. He placed it on the seat. \"Take it. Desert Eagle fifty-caliber. It\u0027ll stop a bear.\"\u003c/p\u003e\n\u003cp\u003eCharlie picked up the chrome-plated pistol. It weighed like five pounds and the barrel looked big enough to stick your thumb in.\u003c/p\u003e\n\u003cp\u003e\"This thing is huge.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a big guy. Listen, it holds eight shots. There\u0027s a round in the chamber. You have to cock it and release the safety before you fire. There and there.\" He pointed to the safety and the hammer. \"Hold on to it if you have to shoot. It will knock you on your ass if you\u0027re not ready.\"\u003c/p\u003e\n\u003cp\u003e\"What about you?\"\u003c/p\u003e\n\u003cp\u003eMinty patted the other side of his coat. \"I have another one.\"\u003c/p\u003e\n\u003cp\u003eCharlie turned the gun in his hand and watched the streetlights playing off its chromed surface. (Beta Males, who inherently feel they are always at a competitive disadvantage, are suckers for showy equalizers.) \"You have a lot going on under the surface, Mr. Fresh. You are not just the run-of-the-mill seven-foot-tall Death Merchant in a pastel-green suit.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Mr. Asher. Very kind of you to say.\"\u003c/p\u003e\n\u003cp\u003e\"My pleasure.\"\u003c/p\u003e\n\u003cp\u003eCharlie\u0027s cell phone rang and he flipped it open.\u003c/p\u003e\n\u003cp\u003eRivera said, \"Asher, where the hell are you? I\u0027ve been circling the Mission and there\u0027s nothing here but a lot of black feathers flying in the air.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, it\u0027s okay. I\u0027m okay, Inspector. I found Minty Fresh, the guy who owns the music store. I\u0027m in the car with him.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re safe?\"\u003c/p\u003e\n\u003cp\u003e\"Relatively.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Lay low and I\u0027ll call you, okay? I want to talk to your friend tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"You got it, Inspector. Thanks for coming to help.\"\u003c/p\u003e\n\u003cp\u003e\"Careful, Asher.\"\u003c/p\u003e\n\u003cp\u003e\"Gotcha. I\u0027m laying low. Bye.\"\u003c/p\u003e\n\u003cp\u003eCharlie snapped the phone shut and turned to Minty Fresh. \"You ready?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely,\" said the fresh one.\u003c/p\u003e\n\u003cp\u003eThe street was deserted when they pulled up in front of the Three Jewels Buddhist Center.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go around to the back,\" Minty said.\u003c/p\u003e\n\u003cp\u003eWell, cars suck, I can tell you that,\" said Babd, trying to keep herself together as the Morrigan limped back to the great ship. \"Five thousand years, horses are fine, all of a sudden we have to have paved streets and cars. I don\u0027t see the attraction.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not even sure that we need to rise and let Darkness rule,\" said Nemain. \"Apparently darkness isn\u0027t qualified yet. Speaking as an agent of Darkness, I think it needs more time.\" She had been crushed into a half-woman, half-raven form and was shedding feathers as they limped through the pipe.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like that New Meat has someone watching over him,\" said Macha. \"Next time Orcus can deal with him.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, let\u0027s get Orcus to go after him,\" Babd said. \"See what he thinks of cars.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/a-dirty-job/page-23.html","bookId":2051,"creation":"Oct 5, 2019 11:51:02 PM","modification":"Oct 5, 2019 11:51:02 PM"}
