{"id":86662,"no":15,"title":"Page 15","content":"\u003cp\u003e\"You weren\u0027t being rational, Caleb,\" she tries to tell me, her tone too calm, like she\u0027s talking to a little kid. Or a crazy person.\u003c/p\u003e\n\u003cp\u003e\"Maybe you heard me wrong. I said you weren\u0027t rational.\"\u003c/p\u003e\n\u003cp\u003eAs I watch Damon walk toward us, I contemplate how I\u0027m going to get out of here.\u003c/p\u003e\n\u003cp\u003eDamon slides in the booth beside me, blocking my escape. \"How are my two Re-START runaways doing?\" He looks down at my plate of half-eaten food. \"Come on, Mr. Becker, eat up. You\u0027ll need your strength for the busy day ahead of us.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t touch my plate or look at Damon. I just stare right at Maggie.\u003c/p\u003e\n\u003cp\u003e\"You were going to bring me back to the dorms and leave again.\" She looks unsure and worried. Good. I want her to suffer. She betrayed me. \"I couldn\u0027t let you run away again,\" she says.\u003c/p\u003e\n\u003cp\u003e\"So better to have me locked up, right?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I meant. You can\u0027t just run away from people who care about you.\"\u003c/p\u003e\n\u003cp\u003e\"If you cared,\" I say through clenched teeth, \"my damn transition counselor wouldn\u0027t be sitting next to me right now.\u003c/p\u003e\n\u003cp\u003eThe waitress comes by to take Damon\u0027s order. \"I\u0027ll have coffee and, uh, just give me another plate of whatever these kids ordered,\" he tells her.\u003c/p\u003e\n\u003cp\u003eI stare out the window like the old man in the other booth. Now I know how he feels, wanting to forget the here and now. Why can\u0027t Maggie understand my situation? Doesn\u0027t she get that I lost what little honor I had by blurting out I wasn\u0027t the one who hit her?\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI need to get away from the truth, away from my past. I need a fresh start.\u003c/p\u003e\n\u003cp\u003eExcept there\u0027s no such thing as a fresh start, not when people from your past keep popping up and hounding you, driving home all your mistakes even further. I thought I\u0027d done a good thing for Leah when I took the fall for her, but what did I really get? No hero\u0027s welcome when I came back home, that\u0027s for damn sure. The lies are starting to blur with the truth, and Maggie\u0027s stuck smack dab in the middle of it.\u003c/p\u003e\n\u003cp\u003e\"All right, kids. Let\u0027s have it all out on the table right here and right now. Who was driving the car that hit Maggie?\" Damon fishes his cell phone out of his pocket and puts it on the table in front of him. \"If you both don\u0027t start talking, I\u0027m calling the prosecutor\u0027s office. We can handle this my way or their way. Which is it?\"\u003c/p\u003e\n\u003cp\u003eEIGHTEEN\u003c/p\u003e\n\u003cp\u003eMaggie\u003c/p\u003e\n\u003cp\u003ealeb is really mad at me. He turns away and looks out the window. I know he wants to escape right now, which is why I\u0027m so thankful that Damon is here. Physically I can\u0027t stop Caleb from leaving, but Damon can.\u003c/p\u003e\n\u003cp\u003e\"Let Damon help you,\" I say.\u003c/p\u003e\n\u003cp\u003eCaleb tenses. \"Nobody can help, Maggie. Get it through that thick skull of yours, okay?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not the enemy,\" Damon says in a terse voice. \"Man, kid, you are one master of displaced anger.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful,\" Caleb says. \"She\u0027s a wolf in sheep\u0027s clothing. This is your party, Maggie. Why don\u0027t you tell Damon everything he wants to know?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not my story to tell. It\u0027s yours.\"\u003c/p\u003e\n\u003cp\u003eWhile Damon eats, Caleb and I are silent.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m waiting,\" Damon says as he reaches for the salt shaker.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you,\" Caleb says.\u003c/p\u003e\n\u003cp\u003eDamon takes a long sip of coffee before very deliberately setting his mug back on the table. \"Why not?\"\u003c/p\u003e\n\u003cp\u003eCaleb looks at me, his eyes bleak.\u003c/p\u003e\n\u003cp\u003eDamon drums his fingers on the tabletop. \"I read the file, Caleb. You gave a detailed story about how you swerved to avoid a squirrel, hit Maggie, and panicked.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a good storyteller,\" Caleb mumbles.\u003c/p\u003e\n\u003cp\u003eThe drumming stops. \"Why did you take the blame for someone else?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not an answer.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s the only one you\u0027re gonna get out of me,\" Caleb says defiantly.\u003c/p\u003e\n\u003cp\u003eA squad car drives by the diner, making my heart beat in overtime. Did Damon call the police before he came? Caleb was right, I shouldn\u0027t have called Damon.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t have him arrested,\" I tell Damon. \"Caleb has been punished enough.\"\u003c/p\u003e\n\u003cp\u003e\"Tell you what,\" Damon says. \"I\u0027ll forget I heard about your little secret for now and you finish my Re-START program. If you do, and promise to go back to Paradise and straighten everything out, I\u0027ll make sure you stay out of jail for the drug charges. Sound like a deal?\"\u003c/p\u003e\n\u003cp\u003e\"Why would you do that?\" Caleb asks.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just say I think you\u0027re a good kid. That doesn\u0027t mean I think you make stellar choices in life. I think you\u0027ve made some damn stupid ones, not to mention the little disappearing act you and Maggie pulled last night. But I made some crappy choices as a teen and I\u0027m willing to give you one last chance. You with me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m with you,\" I say, trying to sound cheery.\u003c/p\u003e\n\u003cp\u003e\"What kind of crappy choices?\" Caleb asks, challenging Damon. \"You sit back and watch all of the Re-START crew tell our fucked-up stories, but you never say a damn word.\"\u003c/p\u003e\n\u003cp\u003eDamon picks up his mug and grips it tightly. \"I was a coke addict, and I lost everything. I lost my girlfriend, my kid, and my money. One day I didn\u0027t pay my supplier for the coke I used and they beat me up real bad. Luckily, I got out, but not a day goes by when I don\u0027t regret treating my girl and my kid like they were garbage. I\u0027d do anything to get them back, but it\u0027s too late now. She moved to Arizona and lets me see my kid once a year.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t you get them back?\" Caleb asks. \"Tell them you got your life on track and want to be a family?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that simple. I did horrible things-I stole money and property from family and friends. Some things can\u0027t be forgiven, and I\u0027ve come to terms with it. She\u0027s moved on. I have to, also. So now that you know my story, are you coming with me?\"\u003c/p\u003e\n\u003cp\u003eCaleb gives me a look that tells me he doesn\u0027t trust me anymore, but he\u0027s resigned to his fate. \"I guess I\u0027m with you, too.\"\u003c/p\u003e\n\u003cp\u003eBack at the dorm, we find the rest of the group in the lounge area waiting for us.\u003c/p\u003e\n\u003cp\u003e\"Where did you two sneak off to?\" Lenny asks. \"A secret rendezvous to do the nasty?\"\u003c/p\u003e\n\u003cp\u003eCaleb and I ignore him. Damon walks up to Lenny and smacks the back of his head while the girls follow me to my room.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you\u0027re back,\" Erin says.\u003c/p\u003e\n\u003cp\u003e\"Me too.\"\u003c/p\u003e\n\u003cp\u003eTrish sits on the edge of my bed while I unpack the stuff from my backpack. \"Where\u0027d you guys go?\"\u003c/p\u003e\n\u003cp\u003e\"Nowhere special. Caleb needed to get away, and I couldn\u0027t let him go alone.\"\u003c/p\u003e\n\u003cp\u003eWhen we first walked off campus, I thought that was it for us and Re-START. But even before I knew Caleb was going to make me come back, I realized I couldn\u0027t run away. One night in that playground castle proved I couldn\u0027t physically do it ... I can\u0027t leave even if I want to.\u003c/p\u003e\n\u003cp\u003e\"Caleb needs you,\" Trish says.\u003c/p\u003e\n\u003cp\u003eI smile weakly. \"I don\u0027t think he\u0027d agree with you right now. He\u0027s pissed that I called Damon to come get us.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll get over it if he knows what\u0027s good for him. He probably just needs some time to realize he has to rely on other people. Guys are control freaks and hate when other people know what\u0027s best for them.\"\u003c/p\u003e\n\u003cp\u003eDamon calls us out in the living room after we\u0027re all showered and dressed. He\u0027s got a clipboard tucked under one arm and claps his hands together kinda ... excited. \"We\u0027re going to juvie,\" he announces.\u003c/p\u003e\n\u003cp\u003e\"Been there, done that,\" Caleb mumbles under his breath.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time to share your stories with troubled teens who are locked up.\" Damon eyes us over the clipboard in his hands. \"Maybe when they get out they\u0027ll think twice before getting drunk, or doing drugs, or showing off to their buddies before getting behind the wheel of a car.\"\u003c/p\u003e\n\u003cp\u003eDamon walks over to Caleb and gets into his personal space. He doesn\u0027t touch him; he just stands there. \"You\u0027ll be okay, Caleb.\"\u003c/p\u003e\n\u003cp\u003eCaleb turns his face away, but as if he can\u0027t help the words from coming out against his will he says, \"I don\u0027t want to go back there, Damon. Cut me some slack, will ya?\"\u003c/p\u003e\n\u003cp\u003eI know how hard it is for Caleb to ask anyone for a favor. I know how much that request cost him.\u003c/p\u003e\n\u003cp\u003eDamon shakes his head slowly and pats him on the back. \"It\u0027s important, Caleb. And we\u0027ll all be there for you.\"\u003c/p\u003e\n\u003cp\u003eIn the van, I purposely sit next to Caleb in the back row. The muscles in his jaw are twitching and he\u0027s got his hands folded on his chest. He\u0027s tense.\u003c/p\u003e\n\u003cp\u003e\"Want to talk about it?\" I ask him quietly so nobody else can hear.\u003c/p\u003e\n\u003cp\u003e\"No comment.\" He looks out the window, shutting me out.\u003c/p\u003e\n\u003cp\u003eIt takes us almost two hours to reach the juvenile detention center, or DOC-Department of Correctionsas Caleb calls it. Our van is cleared and ushered through the tall barbed-wire gate. I can feel the tension and stress radiating off Caleb. He doesn\u0027t want to be here. I don\u0027t know everything that happened to him here, but a while back he gave me a few glimpses into what he went through.\u003c/p\u003e\n\u003cp\u003eI\u0027m having second thoughts about calling Damon and telling him we were at the diner. Maybe I should have let things stay as they were. At least then I wouldn\u0027t have Caleb mad at me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I made you come back to Re-START,\" I mumble.\u003c/p\u003e\n\u003cp\u003e\"Whatever,\" he says as he stares out the window at the barbed-wire fence surrounding the compound. \"It\u0027s over and done.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s over and done? Ditching Re-START, or us as a couple?\"\u003c/p\u003e\n\u003cp\u003eA man and woman in dark suits are in the parking lot, waiting for us. We all step out of the van, but Caleb stops me when everyone else is out but us.\u003c/p\u003e\n\u003cp\u003e\"Listen,\" he says. \"I\u0027m not gonna say I haven\u0027t thought about what it would be like if you and I, well, you know. But I think we should cool it for a while. At least until after this Re-START bullshit is over.\"\u003c/p\u003e\n\u003cp\u003e\"And after it\u0027s over, what then?\"\u003c/p\u003e\n\u003cp\u003eDamon pounds on the side of the van, startling me. \"Come on, slowpokes, get a move on!\" Damon yells. \"You\u0027re holding everyone else up!\"\u003c/p\u003e\n\u003cp\u003eI step out into the hot summer air and stare at the guards with guns in their holsters. It makes me feel safe and scared at the same time.\u003c/p\u003e\n\u003cp\u003eThe guy with the suit walks right up to Caleb. \"We haven\u0027t seen your mug here since you got released. I trust you\u0027re staying out of trouble.\"\u003c/p\u003e\n\u003cp\u003eCaleb almost stands at attention, his face as grave as I\u0027ve ever seen it. He barks out an \"I\u0027m trying to, sir,\" which makes the guy in the suit narrow his eyes at Caleb.\u003c/p\u003e\n\u003cp\u003e\"Try? I\u0027m sure you can do better than try, Becker.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir.\"\u003c/p\u003e\n\u003cp\u003eAfter staring Caleb down, the guy paces in front of all of us. \"I\u0027m Mr. Yates and this is Ms. Bushnell,\" he says loudly, so that we can all hear him. He points to the woman standing next to him, her hair pulled back into a tight bun. \"The girls will be visiting our female population with Ms. Bushnell and the boys will be visiting our male population with me. You ready?\"\u003c/p\u003e\n\u003cp\u003eWe all nod, except Caleb. I watch as he pulls Damon aside and says quietly, \"I can\u0027t do this.\"\u003c/p\u003e\n\u003cp\u003eNINETEEN\u003c/p\u003e\n\u003cp\u003eCaleb\u003c/p\u003e\n\u003cp\u003ecan\u0027t do this,\" I tell Damon again. Shit, my knee has been shaking nonstop since he started driving.\u003c/p\u003e\n\u003cp\u003eDamon pats me on the back again, as if he\u0027s a friend of mine and will stand by me no matter what. \"Yes, you can. Trust me.\"\u003c/p\u003e\n\u003cp\u003eTrust him? When was the last time I actually trusted anyone without getting screwed? \"Whatever, dude.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, you\u0027re stronger than you think, Caleb. These kids are looking for role models.\"\u003c/p\u003e\n\u003cp\u003eI swipe sweat off my forehead. \"Get a clue, Damon. I\u0027m not a role model, and I don\u0027t want to be one. What am I gonna tell these guys, that I went to jail for something I didn\u0027t do?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/return-to-paradise-leaving-paradise-2/page-15.html","bookId":2772,"creation":"Oct 5, 2019 5:17:05 PM","modification":"Oct 5, 2019 5:17:05 PM"}
