{"id":11609,"no":11,"title":"CHAPTER XI. TRIED FOR THEFT.","content":"\u0026nbsp;Herbert stared at the constable in blank amazement. \n\u003cdiv\u003e\n “I am charged with stealing stamps and money from the post office?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who makes the charge?” demanded Herbert, in great excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eben Graham.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know what it means,” said our hero, turning to George Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It means,” said Melville, “that the fellow is envious of you, and angry because he cannot supersede you with me. He evidently wants to do you an injury.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be so; but I did not imagine that Eben could be so mean. Mr. Bruce, do you believe that I am a thief?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don\u0027t, Herbert,” said the constable, “and it was very much against my will that I started out to arrest you, you may be sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When do you want me to go with you?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will go before Justice Slocum at two o\u0027clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it necessary for me to go to the lockup?” asked Herbert, shrinking, with natural repugnance, from entering the temporary house of tramps and law breakers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Herbert,” answered the constable, in a friendly tone. “I\u0027ll take it upon myself to let you go home to dinner. I will call for you at quarter of two. Of course I shall find you ready to accompany me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mr. Bruce, I am impatient to meet Eben Graham, and tell him to his face that he has been guilty of a mean and contemptible falsehood, in charging me with theft. Not a person in the village who knows me will believe it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will also call at your house, Herbert,” said George Melville, “and accompany you to the office of the justice. I shall ask leave to give the details of Eben Graham\u0027s visit to me last evening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Mr. Melville,” said Herbert, “I am glad you do not believe a word of this story.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not so easily deceived, Herbert. It is quite possible that stamps and money have been stolen, but, if so, it is your false friend and accuser who is guilty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course Herbert had to tell his mother what had happened. She was agitated and alarmed, but became calmer when Herbert told her what was Eben\u0027s probable motive in making the charge.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can he behave so shamefully!” exclaimed the indignant parent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t think him capable of it, myself, mother, although I had a poor opinion of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose that you can\u0027t prove that you are innocent, Herbert?” said Mrs. Carr, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is for him to prove that I am guilty, mother,” answered Herbert, who knew this much of law.\n\u003c/div\u003e \n\u003cdiv\u003e\n At a quarter of two Constable Bruce and Mr. Melville walked to the house together.\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was opened for them by Herbert himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you haven\u0027t taken leg bail, Herbert,” said the constable, jocosely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Mr. Bruce, I am on hand; I am in a hurry to meet Mr. Eben Graham and see whether he can look me in the face after his shameful behavior.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Mr. Bruce, I never thought you would call at my home on such an errand,” said Mrs. Carr, on the point of breaking down.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t worry, Mrs. Carr,” said the constable; “anybody may be charged with theft, however innocent. Your son has good friends who won\u0027t see him treated with injustice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert\u0027s mother was desirous of accompanying them to the office of the justice, but was persuaded to remain behind. Herbert knew that in her indignation she would not be able to be silent when she saw Eben Graham.\n\u003c/div\u003e \n\u003cdiv\u003e\n Justice Slocum was an elderly man, with a mild face and gray hair. When Herbert entered he greeted him in a friendly way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to see you here, my boy,” he said, “but I am sure there is some mistake. I have known you ever since you were a baby, and I don\u0027t believe you are guilty of theft now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I submit, Judge Slocum,” said Eben Graham, who sat in a corner, his mean features looking meaner and more insignificant than usual, “I submit that you are prejudging the case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Silence, sir!” said Judge Slocum, warmly. “How dare you impugn my conduct? Though Herbert were my own son, I would give you a chance to prove him guilty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you\u0027ll excuse me, judge,” said Eben, cringing. “I am as sorry as you are to believe the boy guilty of stealing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do your worst and say your worst, Eben Graham!” said Herbert, contemptuously, “but be very careful that you do not swear falsely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t need any instructions from you, Herbert Carr, considering that you are a criminal on trial,” said Eben, maliciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are mistaken, sir,” said George Melville. “To be under arrest does not make a man or boy a criminal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure I am much obliged for the information, Mr. Melville,” said Eben, spitefully. “You\u0027ve chosen a nice companion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There you are right,” said Melville, gravely. “I have done much better than if I had hired you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben winced, but did not reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n George Melville whispered to Herbert:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you willing to accept me as your lawyer? I am not much of one, to be sure, but this case is very simple.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very grateful for your offer, and accept it,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n I do not propose to record the whole scene in detail, but only to give a general idea of the proceedings.\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben Graham was sworn as a witness, and deposed that he had left Herbert in charge of the post office the previous evening. On his return he examined the stamps and contents of the money drawer, and found, to his surprise, that five dollars in money and six dollars\u0027 worth of stamps were missing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you know they were missing?” asked Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I knew precisely how much money was in the drawer and how many stamps were there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you counted them just before you went out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was rather a singular time to make the count, was it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know that it was, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should suppose the end of the day would be a more appropriate time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think so,” answered Eben, shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you led to make the count because you suspected Herbert\u0027s honesty?” asked Mr. Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was the very reason I did it,” said Eben, with a malicious glance at Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn\u0027t it a little curious that you should have selected a boy whose honesty you doubted, to fill your place?” asked George Melville, carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There wasn\u0027t anybody else; he knew all about post-office work.” answered Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very good! Now, Mr. Graham, if you have no objection, will you tell why you wanted to get away from the post office last evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben fidgeted, for he saw what was coming, and it made him nervous.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wanted a little rest,” he answered, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why do you ask me that question?” asked Eben, moving about uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I desire an answer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know where I went,” returned Eben, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I wish you to tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Answer the question, witness!” said the judge, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I went to the hotel,” replied Eben, evasively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “On whom did you call?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On you!” answered Eben, reluctantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We have come to it at last. Now, what was your business with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To tell you that Herbert would not suit you as a companion,” said the witness, who thought this answer rather a clever one.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whom did you recommend in his place?” pursued the questioner, relentlessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben hesitated, but his cleverness came again to his aid.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told you that I would be willing to come just to oblige you,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did Herbert know that you were going to make this proposal?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You asked him, then, to remain in the post office while you absented yourself with a view of depriving him of the position he had just secured in my employ?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would have got father to take him again in the store and post office,” said Eben, defending himself from the implied charge of treachery.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you told me so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben nodded triumphantly. Even Melville had to admit that he was not treating Herbert meanly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way,” said Melville, “isn\u0027t it rather strange that you should have been ready to recommend in your place a boy whose honesty you doubted?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t know he was a thief,” said Eben, somewhat abashed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but you suspected his honesty. That was your reason for counting the money and stamps before you left the office. At least, that is the reason you have given.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He had been in the office before I was there,” said Eben, uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “While he was there, were any stamps missing? Was he suspected of taking any stamps or money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I know of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, Mr. Graham, what answer did I make to your application?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What application?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To take you into my employ instead of Herbert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You wanted to keep him,” said the witness, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precisely. Having failed, then, in your application, you went home and discovered that some money and stamps had been stolen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. I was very much surprised—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will do, sir. Your discovery was remarkably well-timed. Herbert having obtained the position you sought, you straightway discovered proof of his dishonesty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben colored, for the insinuation was plain enough for even him to understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The two things had nothing to do with each other!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be, but I call the attention of the judge to a very remarkable coincidence. Have the missing stamps or money been found on the person of the defendant?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He hasn\u0027t been searched.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take it upon me to say that he is ready to submit to an examination,” said Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert said, emphatically, “I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it isn\u0027t likely you\u0027d find anything now.” said Eben, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has had plenty of time to put \u0027em away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing to have my mother\u0027s house searched,” said Herbert, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, they ain\u0027t there!” said Eben, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are they, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben\u0027s answer took Herbert and his lawyer, and the judge himself, by surprise.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81515.html","bookId":427,"creation":"Aug 2, 2019 4:03:09 AM","modification":"Aug 2, 2019 4:03:09 AM"}
