{"id":11611,"no":13,"title":"CHAPTER XIII. EBEN\u0027S LAST HOPE FAILS.","content":"\u0026nbsp;Ebenezer Graham had taken no stock in his son\u0027s charge against Herbert. He was not prejudiced in favor of Herbert, nor did he feel particularly friendly to him, but he was a man of shrewdness and common sense, and he knew that Herbert was not a fool. When Eben made known to him the fact that the stamps and money were missing, he said keenly: “What has become of \u0027em?” \n\u003cdiv\u003e\n “I don\u0027t know,” answered Eben, “but I can guess well enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Guess, then,” said his father, shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know Herbert Carr took my place last evening?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s no doubt that he took the stamps and money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn\u0027t very likely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel sure of it—so sure that I mean to charge him with it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you can see what he says.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ebenezer did not understand that Eben intended to have the boy arrested, and would not have consented to it had he known. But Eben slipped out of the store, and arranged for the arrest without his father\u0027s knowledge. Indeed, he did not learn till the trial had already commenced, Eben having made some excuse for his absence.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Eben returned his father greeted him in a tone very far from cordial.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Eben, I hear you\u0027ve gone and made a fool of yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have only been defending your property, father,” said Eben, sullenly. “I thought you\u0027d appreciate it better than this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ve charged an innocent boy with theft, and now all his friends will lay it up agin\u0027 us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you going to be robbed without saying a word?” asked Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I\u0027m not, Eben Graham; I\u0027m goin\u0027 to say a word, and now\u0027s the time to say it. You can\u0027t pull wool over my eyes. The money\u0027s gone, and the stamps are gone, and somebody\u0027s got \u0027em.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Herbert Carr!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it isn\u0027t Herbert Carr. It\u0027s somebody nearer to me, I\u0027m ashamed to say, than Herbert Carr.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean to say I took them?” asked Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won\u0027t bring a charge unless I can prove it, but I shall watch you pretty closely after this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case, I don\u0027t wish to work for you any longer; I throw up the situation,” said Eben, loftily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Verv well. When are you going to leave town?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ain\u0027t going to leave town at present.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going to board, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben regarded his father in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re not going to send me adrift, are you?” he asked, in consternation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m not going to support you in idleness; if you give up your situation in the store, you\u0027ll have to go to work for somebody else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I could,” thought Eben, thinking of the rich young man at the hotel, from whom he had sought a position as companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall have to leave Wayneboro,” he said; “there\u0027s nothing to do here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, there is; Farmer Collins wants a hired man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A hired man!” repeated Eben, scornfully. “Do you think I am going—to hire out on a farm?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might do a great deal worse,” answered Ebenezer, sensibly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “After being a dry-goods salesman in Boston, I haven\u0027t got down to that, I beg to assure you,” said Eben, with an air of consequence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you will have to work in the store if you expect to stay at home,” said his father. “And hark you, Eben Graham,” he added, “don\u0027t report any more losses of money or stamps. I make you responsible for both.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eben went back to his work in an uneasy frame of mind. He saw that he had not succeeded in imposing upon his father, and that the clear-sighted old gentleman strongly suspected where the missing articles had gone. Eben might have told, had he felt inclined, that the five-dollar bill had been mailed to a lottery agent in New York in payment for a ticket in a Southern lottery, and that the stamps were even now in his possession, and would be sold at the first opportunity. His plan to throw suspicion upon Herbert had utterly failed, and the cold looks with which he had been greeted showed what the villagers thought of his attempt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won\u0027t stay in Wayneboro much longer,” Eben inwardly resolved. “It\u0027s the dullest hole in creation. I can get along somehow in a large place, but here there\u0027s positively nothing. Hire out on a farm, indeed! My father ought to be ashamed to recommend such a thing to his only son, when he\u0027s so well off. If he would only give me two hundred dollars, I would go to California and trouble him no more. Plenty of people make money in California, and why shouldn\u0027t I? If that ticket draws a prize—”\n\u003c/div\u003e \n\u003cdiv\u003e\n And then Eben went into calculations of what he would do if only he drew a prize of a thousand dollars. That wasn\u0027t too much to expect, for there were several of that amount, and several considerably larger. He pictured how independent he would be with his prize, and how he would tell his father that he could get along without him, displaying at the same time a large roll of bills. When he reached California he could buy an interest in a mine, and perhaps within three or four years he could return home twenty times as rich as his father. It was pleasant to think over all this, and almost to persuade himself that the good luck had actually come. However, he must wait a few days, for the ticket had not yet come, and the lottery would not be drawn for a week.\n\u003c/div\u003e \n\u003cdiv\u003e\n The ticket arrived two days later; Eben took care to slip the envelope into his pocket without letting his father or anyone else see it, for unpleasant questions might have been asked as to where he got the money that paid for it, Mr. Graham knowing very well that his son had not five dollars by him.\n\u003c/div\u003e \n\u003cdiv\u003e\n For a few days Eben must remain in Wayneboro, until the lottery was drawn. If he was unlucky, he would have to consider some other plan for raising money to get away from Wayneboro.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not till the day after the trial and his triumphant acquittal, that Herbert saw Eben. He came to the store to buy some groceries for his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-evening, Herbert,” said Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eben,” said Herbert, coldly, “except in the way of business, I don\u0027t want to speak to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t bear malice on account of that little affair, do you, Herbert?” said Eben, smoothly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That little affair, as you call it, might have been a very serious affair to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I only did my duty,” said Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was it your duty to charge an innocent person with theft?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t see who else could have taken the things,” said Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably you know as well as anybody,” said Herbert, contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” demanded Eben, coloring.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know better than I do. How much do I owe you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thirty-three cents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is your money,” said Herbert, and walked out of the store.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hate that boy!” said Eben, scowling at Herbert\u0027s retreating figure. “He puts on too many airs, just because a city man\u0027s taken him in charity and is paying his expenses. Some time I\u0027ll be able to come up with him, I hope.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert was not of an unforgiving nature, but he felt that Eben had wronged him deeply, and saw no reason why he would not repeat the injury if he ever got the chance. He had at least a partial understanding of Eben\u0027s mean nature and utter selfishness, and felt that he wished to have nothing to do with him. Ebenezer Graham was very “close,” but he was a hard-working man and honest as the world goes. He was tolerably respected in Wayneboro, though not popular, but Eben seemed on the high road to become a rascal.\n\u003c/div\u003e \n\u003cdiv\u003e\n A week slipped by, and a circular containing the list of prizes drawn was sent to Eben.\n\u003c/div\u003e \n\u003cdiv\u003e\n He ran his eyes over it in a flutter of excitement. Alas! for his hopes. In the list of lucky numbers the number on his ticket was not included.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have drawn a blank! Curse the luck!” he muttered, savagely. “The old man needn\u0027t think I am going to stay here in Wayneboro. If he won\u0027t give me money to go out West, why, then—”\n\u003c/div\u003e \n\u003cdiv\u003e\n But he did not say what then.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81517.html","bookId":427,"creation":"Aug 2, 2019 4:03:12 AM","modification":"Aug 2, 2019 4:03:12 AM"}
