{"id":11621,"no":23,"title":"CHAPTER XXIII. A STARTLING REVELATION.","content":"\u0026nbsp;A stout, black-bearded man stood in front of the hotel to welcome the stage passengers. He took a clay pipe from his lips and nodded a welcome. \n\u003cdiv\u003e\n “Glad to see you, strangers,” he said. “Here, Peter, you black rascal, help the gentlemen with their baggage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was thrown open, and the party filed into a comfortless looking apartment, at one end of which was a rude bar.\n\u003c/div\u003e \n\u003cdiv\u003e\n One of the passengers, at least, seemed to know the landlord, for Col. Warner advanced to greet him, his face beaming with cordiality.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, John?” he said. “How does the world use you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The landlord growled something inaudible.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have a drink, colonel?” was the first audible remark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t care if I do. It\u0027s confounded dry traveling over these mountain roads. Walk up, gentlemen. Col. Warner doesn\u0027t drink alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n With the exception of Herbert and George Melville, the passengers seemed inclined to accept the offer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come along, Melville,” said the colonel; “you and your friend must join us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please excuse me, colonel,” answered Melville. “I would prefer not to drink.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, nonsense! To oblige me, now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you; but I am traveling for my health, and it would not be prudent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you say, Melville; but a little whisky would warm you up and do you good, in my opinion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you all the same, colonel; but I think you must count me out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The colonel shrugged his shoulders and beckoned Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can come, anyway; your health won\u0027t prevent.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Melville did not interfere, for he knew it would give offense, but he hoped his young clerk would refuse.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Herbert; “I won\u0027t object to a glass of sarsaparilla.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sarsaparilla!” repeated the colonel, in amazement. “What\u0027s that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We don\u0027t keep no medicine,” growled the landlord.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you root-beer?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you take me for?” said the landlord, contemptuously. “I haven\u0027t got no root-beer. Whisky\u0027s good enough for any man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you\u0027ll excuse me, then,” said Herbert. “I am not used to any strong drinks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old are you?” asked the colonel, rather contemptuously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sixteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sixteen years old and don\u0027t drink whisky! My young friend, your education has been sadly neglected.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dare say it has,” answered Herbert, good-naturedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gentlemen,” said Col. Warner, apologetically, “the boy is a stranger, and isn\u0027t used to our free Western ways. He\u0027s got the makings of a man in him, and it won\u0027t be long before he\u0027ll get over his squeamishness, and walk up to the bar as quick as any one of us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert and Melville stood apart, while the rest of the company emptied their glasses, apparently at a gulp. It was clear that their refusal had caused them to be regarded with dislike and suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n The accommodations of the Echo Gulch Hotel were far from luxurious. The chambers were scarcely larger than a small closet, clap-boarded but not plastered, and merely contained a bedstead. Washing accommodations were provided downstairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert and George Melville were assigned to a single room, to which they would not have objected had the room been larger. It was of no use to indulge in open complaints, however, since others had to fare in the same way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This isn\u0027t luxury, Herbert,” said Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered the boy; “but I don\u0027t mind it if you don\u0027t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid I may keep you awake by my coughing, Herbert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if I once get to sleep. I sleep as sound as a top.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I did; but I am one of the wakeful kind. Being an invalid, I am more easily annoyed by small inconveniences. You, with your sturdy health, are more easily suited.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Melville, I had just as lief sleep downstairs in a chair, and give you the whole of the bed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not on my account, Herbert. I congratulate myself on having you for a roommate. If I had been traveling alone I might have been packed away with the colonel, who, by this time, would be even less desirable as a bedfellow than usual.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The worthy colonel had not been content with a single glass of whisky, but had followed it up several times, till his utterance had become thick, and his face glowed with a dull, brick-dust color.\n\u003c/div\u003e \n\u003cdiv\u003e\n Col. Warner had been assigned to the adjoining chamber, or closet, whichever it may be called. He did not retire early, however, while Herbert and George Melville did.\n\u003c/div\u003e \n\u003cdiv\u003e\n Strangely enough, Herbert, who was usually so good a sleeper, after a short nap woke up. He turned to look at his companion, for it was a moonlight night, and saw that he was sleeping quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what\u0027s got into me?” he thought; “I thought I should sleep till morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He tried to compose himself to sleep, but the more effort he made the broader awake he became. Sometimes it seems as if such unaccountable deviations from our ordinary habits were Heaven-sent. As Herbert lay awake he suddenly became aware of a conversation which was being carried on, in low tones, in the next room. The first voice he heard, he recognized as that of the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said, “some of the passengers have got money. There\u0027s that Stiefel probably carries a big sum in gold and notes. When I was speaking of the chance of the stage being robbed, he was uncommon nervous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who\u0027s Stiefel?” was growled in another voice, which Herbert had no difficulty in recognizing as the landlord\u0027s.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he\u0027s the fat, red-faced German. From his talk, I reckon he\u0027s come out to buy mines somewhere in Colorado.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We\u0027ll save him the trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So we will—good joke, John. Oh, about this Stiefel, he carries his money in a belt round his waist. I infer that it is gold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good! What about the others?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s a tall, thin man—his name is Parker,” proceeded the colonel; “he\u0027s smart, or thinks he is; you\u0027ll have to pull his stockings off to get his money. Ha, ha!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you find out, colonel?” asked the landlord, in admiration.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Drew it out of him, sir. He didn\u0027t know who he was confiding in. He\u0027ll wonder how the deuce his hiding place was suspected.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Other passengers were referred to who have not been mentioned, and in each case the colonel was able to tell precisely where their money was kept.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How about that milksop that wouldn\u0027t drink with us?” inquired the landlord, after a while.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Melville? I couldn\u0027t find out where he keeps his cash. Probably he keeps it in his pocket. He doesn\u0027t look like a cautious man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who\u0027s the boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only a clerk or secretary of Melville\u0027s. He hasn\u0027t any money, and isn\u0027t worth attention.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very glad to hear it,” thought Herbert. “I don\u0027t care to receive any attention from such gentry. But who would have thought the colonel was in league with stage robbers? I thought him a gentleman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert began to understand why it was that Col. Warner, if that was his real name, had drawn the conversation to stage robbers, and artfully managed to discover where each of the passengers kept his supply of money. It was clear that he was in league with the landlord of the Echo Gulch Hotel, who, it was altogether probable, intended to waylay the stage the next day.\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a serious condition of affairs. The time had been when, in reading stories of adventure, Herbert had wished that he, too, might have some experience of the kind. Now that the opportunity had come, our hero was disposed to regard the matter with different eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What can be done,” he asked himself, anxiously, “to escape the danger which threatens us to-morrow?”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81527.html","bookId":427,"creation":"Aug 2, 2019 4:03:36 AM","modification":"Aug 2, 2019 4:03:36 AM"}
