{"id":11622,"no":24,"title":"CHAPTER XXIV. A MORNING WALK.","content":"\u0026nbsp;Herbert found it difficult to sleep from anxiety. He felt that the burden was too great for him alone to bear, and he desired to speak on the subject to George Melville. But there was a difficulty about doing this undetected, on account of the thinness of the partitions between the rooms. If he could hear Col. Warner, the latter would also be able to hear him. \n\u003cdiv\u003e\n The stage was to start at seven o\u0027clock the next morning, and before that time some decision must be made. The first question was, should they, or should they not, take passage, as they had anticipated?\n\u003c/div\u003e \n\u003cdiv\u003e\n At half-past five, Herbert, turning in bed, found his bedfellow awake.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Melville,” he whispered, “I have something important to communicate, and cannot do so here on account of the danger of being heard in the next room. Are you willing to dress and take a little walk with me before breakfast?”\n\u003c/div\u003e \n\u003cdiv\u003e\n George Melville\u0027s physical condition did not make him usually favorable to early rising, but he knew Herbert well enough to understand that he had a satisfactory reason for his request.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Herbert,” he said, “I will get up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Not a word was exchanged, for Mr. Melville\u0027s discretion prevailed over his curiosity. In ten minutes both were fully dressed and descended the stairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no one stirring except a woman, the landlord\u0027s wife, who was lighting the fire in order to prepare breakfast.\n\u003c/div\u003e \n\u003cdiv\u003e\n She regarded the two with surprise, and perhaps a little distrust.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re stirrin\u0027 early, strangers,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Melville, courteously, “we are going to take a little walk before breakfast; it may sharpen our appetites.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph!” said the woman; “that\u0027s curious. I wouldn\u0027t get up so early if I wasn\u0027t obliged. There ain\u0027t much to see outdoors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a new part of the country to us,” said Melville, “and we may not have another chance to see it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When will breakfast be ready?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Half an hour, more or less,” answered the woman, shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will be back in time,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n The landlady evidently thought their early-rising a singular proceeding, but her suspicions were not aroused. She resumed her work, and Herbert and his friend walked out through the open door.\n\u003c/div\u003e \n\u003cdiv\u003e\n When they had reached a spot a dozen rods or more distant, Melville turned to his young clerk and asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Herbert, what is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have discovered, Mr. Melville, that our stage is to be stopped to-day and the passengers plundered.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you discover this?” asked Melville, startled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By a conversation which I overheard in the next chamber to us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But that chamber is occupied by Col. Warner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he is one of the conspirators,” said Herbert, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it possible?” ejaculated Melville. “Can we have been so deceived in him? Does he propose to waylay the stage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I presume he will be one of the passengers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me all you know about this matter, Herbert. Who is engaged with him in this plot?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The landlord.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not much surprised at this,” said Melville, thoughtfully. “He is an ill-looking man, whose appearance fits the part of highwayman very well. Then you think the colonel is in league with him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure of that. Don\u0027t you remember how skillfully Col. Warner drew out of the passengers the hiding places of their money yesterday?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has told all to the landlord, and he will no doubt make use of the knowledge. That is all, Mr. Melville. I could not rest till I had told you, so that you might decide what to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems quite providential that you were kept awake last night, Herbert, otherwise this blow would have come upon us unprepared. Even with the knowledge that it impends, I hardly know what it is best for us to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We might decide not to go in the stage,” suggested Hebert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But we should have to go to-morrow. We cannot stay here, and there is no other way of traveling. As the colonel seems to think I have money, there would be another attack to-morrow. Besides, where could we stay except at this hotel, which is kept, as it appears, by the principal robber.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true,” said Herbert, puzzled; “I didn\u0027t think of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would quite as soon stand my chance of being robbed in the stage, as be attacked here. Besides, I cannot make up my mind to desert my fellow passengers. It seems cowardly to send them off to be plundered without giving them a hint of their danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Couldn\u0027t we do that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The result would be that they would not go, and there is no knowing how long we should be compelled to remain in this secluded spot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Melville,” said Herbert, suddenly, “a thought has just struck me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope it may show us a way out of our danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I am sorry to say that it won\u0027t do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Herbert?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You remember that mention was made yesterday in the stage of a certain famous bandit named Jerry Lane?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I remember.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think it is possible that he and Col. Warner may be one and the same?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is certainly a startling suggestion, Herbert. What reason have you for thinking so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was only a guess on my part; but you remember that the colonel said he was a man about his size.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That might be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he did not confine himself to the Western country, but might be met with in New York, or St. Louis. We met the colonel in Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may be as you surmise, Herbert,” said George Melville, after a pause. “It did occur to me that our worthy landlord might be the famous outlaw in question, but the description to which you refer seems to fit the colonel better. There is one thing, however, that makes me a little incredulous.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that, Mr. Melville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This Jerry Lane I take to be cool and courageous, while the colonel appears to be more of a boaster. He looks like one who can talk better than he can act. If I had ever seen a description of his appearance, I could judge better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two had been walking slowly and thoughtfully, when they were startled by a rough voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re out early, strangers?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning swiftly, they saw the dark, forbidding face of the landlord, who had approached them unobserved.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he hear anything?” thought Herbert, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, we are taking a little walk,” said Melville, pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Breakfast will be ready soon. You\u0027d better be back soon, if you\u0027re goin\u0027 by the stage this morning. You are goin\u0027, I reckon?” said the landlord, eyeing them sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We intend to do so,” said Melville. “We will walk a little farther, and then return to the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The landlord turned and retraced his steps to the Echo Gulch Hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think he heard anything that we were saying?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what brought him out here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably he wanted to make sure that we were going in the stage. He is laudably anxious to have as many victims and as much plunder as possible.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You told him you were going in the stage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have decided to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you decided upon anything else, Mr. Melville?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not positively; but there will be time to think of that. Did you hear where we were to be attacked?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At a point about five miles from here,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n This he had gathered from the conversation he had overheard.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the two friends reached the hotel, they found Col. Warner already downstairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-morning, gentlemen!” he said. “So you have taken a walk? I never walk before breakfast, for my part.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor do I often,” said Melville. “In this case I was persuaded by my young friend. I am repaid by a good appetite.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can\u0027t I persuade you to try a glass of bitters, Mr. Melville?” asked the colonel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, colonel. You will have to excuse me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Breakfast\u0027s ready!” announced the landlady, and the stage passengers sat down at a long, unpainted, wooden table, where the food was of the plainest. In spite of the impending peril of which they, only, had knowledge, Herbert ate heartily, but Melville seemed preoccupied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81528.html","bookId":427,"creation":"Aug 2, 2019 4:03:40 AM","modification":"Aug 2, 2019 4:03:40 AM"}
