{"id":11625,"no":27,"title":"CHAPTER XXVII. COL. WARNER CHANGES FRONT.","content":"\u0026nbsp;It may seem a daring thing for one man to stop a stage full of passengers, and require them to surrender their money and valuables, but this has been done time and again in unsettled portions of the West. For the most part the stage passengers are taken by surprise, and the road agent is known to be a desperado, ready to murder in cold blood anyone who dares oppose him. \n\u003cdiv\u003e\n In the present instance, however, the passengers had been warned of their danger and were ready to meet it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Brown—for, of course, the masked man was the landlord—saw four revolvers leveled at him from inside the stage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let go that horse, my friend, or you are a dead man!” said Conrad Stiefel, calmly. “Two can play at your game.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brown was taken by surprise, but he was destined to be still more astonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n Col. Warner protruded his head from the window, saying:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, my friend, you had better give up your little plan. It won\u0027t work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Such language from his confederate, on whom he fully relied, wholly disconcerted the masked robber.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I\u0027ll be blowed!” he muttered, staring, in ludicrous perplexity, at his fellow conspirator.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, my friend,” said the colonel, “I shall really be under the necessity of shooting you myself if you don\u0027t leave us alone. We are all armed and resolute. I think you had better defer your little scheme.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brown was not quick-witted. He did not see that his confederate was trying cunningly to avert suspicion from himself, and taking the only course that remained to him. Of course, he thought he was betrayed, and was, as a natural consequence, exasperated.\n\u003c/div\u003e \n\u003cdiv\u003e\n He released his hold on the horses, but, fixing his eyes on the colonel fiercely, muttered:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait till I get a chance at you! I\u0027ll pay you for this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What an idiot!” thought Warner, shrugging his shoulders. “Why can\u0027t he see that I am forced to do as I am doing? I must make things plain to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He spoke a few words rapidly in Spanish, which Brown evidently understood. His face showed a dawning comprehension of the state of affairs, and he stood aside while the stage drove on.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you say?” asked Conrad Stiefel, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You heard me, sir,” said the colonel, loftily. “You owe your rescue from this ruffian to me. Now, you can understand how much you have misjudged me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Conrad Stiefel was not so easily satisfied of this.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I heard what you said in Mexican, or whatever lingo it is, but I didn\u0027t understand it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I,” said Benson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, gentlemen; I am ready to explain. I told this man that if he ever attempted to molest me I should shoot him in his track.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn\u0027t you speak to him in English?” asked Stiefel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I had a suspicion that the fellow was the same I met once in Mexico, and I spoke to him in Spanish to make sure. As he understood, I am convinced I was right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is it, then?” asked Benson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His name, sir, is Manuel de Cordova, a well-known Mexican bandit, who seems to have found his way to this neighborhood. He is a reckless desperado, and, though I addressed him boldly, I should be very sorry to meet him in a dark night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This explanation was very fluently spoken, but probably no one present believed what the colonel said, or exonerated him from the charge which George Melville had made against him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Five miles further on Col. Warner left the stage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gentlemen,” he said, “I am sorry to leave this pleasant company, but I have a mining claim in this neighborhood, and must bid you farewell. I trust that when you think of me hereafter, you will acquit me of the injurious charges which have been made against me. I take no credit to myself for driving away the ruffian who stopped us, but hope you won\u0027t forget it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No one interfered with the colonel when he proposed to leave the stage. Indeed, the passengers were unanimous in accepting his departure as a relief. In spite of his plausible representations, he was regarded with general suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I knew the meaning of that Spanish lingo,” said the German, Conrad Stiefel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can interpret it for you, Mr. Stiefel,” said George Melville, quietly. “I have some knowledge of Spanish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he say?” asked more than one, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said: \u0027You fool! Don\u0027t you see the plot has been discovered? It wasn\u0027t my fault. I will soon join you and explain.\u0027”\n\u003c/div\u003e \n\u003cdiv\u003e\n This revelation made a sensation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he was in league with the road agent, after all?” said Parker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly he was. Did you for a moment doubt it?” said Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was staggered when I saw him order the rascal away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a shrewd villain!” said Benson. “I hope we shan\u0027t encounter him again.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81531.html","bookId":427,"creation":"Aug 2, 2019 4:03:50 AM","modification":"Aug 2, 2019 4:03:50 AM"}
