{"id":11630,"no":32,"title":"CHAPTER XXXII. THE BLAZING STAR MINE.","content":"\u0026nbsp;Toward noon the next day George Melville and Herbert were resting from a country trip, sitting on a rude wooden settee which our hero had made of some superfluous boards, and placed directly in front of the house, when a figure was seen approaching with long strides from the shadow of the neighboring woods. It was not until he was close at hand that Herbert espied him. \n\u003cdiv\u003e\n “Why, it\u0027s Mr. Holden!” he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jack Holden, my lad,” said the hunter, correcting him. “Is this the man you\u0027re living with?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack Holden was unconventional, and had been brought up in a rude school so far as manners were concerned. It did not occur to him that his question might have been better framed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am Mr. Melville,” answered that gentleman, seeing that Herbert looked embarrassed. “Herbert is my constant and valued companion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s a trump, that boy!” continued Holden. “Why, if it hadn\u0027t been for him, there\u0027d been an end of Jack Holden yesterday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Herbert told me about it. It was indeed a tragic affair. The sacrifice of life is deplorable, but seemed to have been necessary, unless, indeed, you could have disabled him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Disabled him!” echoed the hunter. “That wouldn\u0027t have answered by a long shot. As soon as the reptile got well he\u0027d have been on my trail ag\u0027in. No, sir; it was my life or his, and I don\u0027t complain of the way things turned out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you buried him?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I\u0027ve shoved him under, and it\u0027s better than he deserved, the sneakin\u0027 rascal. I\u0027m glad to make your acquaintance, Mr. Melville. Didn\u0027t know I had changed neighbors till the boy there told me yesterday. I\u0027ve tramped over this mornin\u0027 to give you a call.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind, Mr. Holden. Sit down here beside us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m more at home here,” answered Holden, stretching himself on the ground, and laying his gun beside him. “How do you like Colorado?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very much, as far as I have seen it,” said Melville. “Herbert probably told you my object, in coming here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said you were ailin\u0027 some way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, my lungs are weak. Since I have been here, I am feeling better and stronger, however.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There don\u0027t seem to be anything the matter with the boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing but a healthy appetite,” answered Herbert, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won\u0027t hurt anybody. Mr. Melville, do you smoke?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Queer! Don\u0027t see how you can do without it? Why, sir, I\u0027d been homesick without my pipe. It\u0027s company, I tell you, when a chap\u0027s alone and got no one to speak to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I take it, Mr. Holden, you are not here for your health?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I should say not; I\u0027m tough as a hickory nut. When I drop off it\u0027s more likely to be an Indian bullet than any disease. I\u0027m forty-seven years old, and I don\u0027t know what it is to be sick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are fortunate, Mr. Holden.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I expect I am. But I haven\u0027t answered your question. I\u0027m interested in mines, Mr. Melville. Have you ever been to Deer Creek?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I went over with Herbert to visit the store there one day last week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you ever hear of the Blazing Star Mine?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I believe not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I own it,” said Holden. “It\u0027s a good mine, and would make me rich if I had a little more money to work it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are the indications favorable, then?” asked Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It looks well, if that\u0027s what you mean. Yes, sir; the Star is a first-class property.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it\u0027s a pity you don\u0027t work it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s what I say myself. Mr. Melville, I\u0027ve a proposal to make to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Mr. Holden?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you could manage to call me Jack, it would seem more social like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By all means, then, Jack!” said Melville smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You give me money enough to develop the mine, and I\u0027ll make half of it over to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much is needed?” asked Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not over five hundred dollars. It\u0027s a bargain, I tell you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not myself wish to assume any business cares,” said Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack Holden looked disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just as you say,” he responded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But Herbert may feel differently,” continued Melville.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027d like the lad for a partner,” said Holden, briskly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I have no money!” said Herbert, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n George Melville smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If the mine is a good one,” he said, “I will advance you the money necessary for the purchase of a half interest. If it pays you, you may become rich. Then you can repay the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But suppose it doesn\u0027t, Mr. Melville,” objected Herbert, “how can I ever repay you so large a sum?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the whole, Herbert, I will take the risk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind, Mr. Melville,” said Herbert, his face glowing with anticipation. To be half owner of a mine, with the chance of making a large sum of money, naturally elated him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn\u0027t I be, Herbert? But I want to see the mine first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can\u0027t you go over this afternoon?” asked Holden, eager to settle the matter as soon as possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a long journey,” said Melville, hesitating.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can stay overnight,” said Jack Holden, “and come back in the morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; let us go then—that is, after dinner. Herbert, if you will set the table, we will see if we can\u0027t offer our friend here some refreshment. He is hungry, I am sure, after his long walk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ve hit it, Mr. Melville,” said Holden. “I allow I\u0027m as hungry as a wolf. But you don\u0027t set down to table, do you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes,” answered Mr. Melville, smiling pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ain\u0027t used to it,” said Holden; “but I was once. Anyhow, it won\u0027t make no difference in the victuals.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When dinner was ready the three sat down, and did ample justice to it; but Jack Holden made such furious onslaughts that the other two could hardly keep pace with him. Fortunately, there was plenty of food, for Melville did not believe in economical housekeeping.\n\u003c/div\u003e \n\u003cdiv\u003e\n After dinner they set out for Deer Creek. As has been already explained, it was the name of a mining settlement. Now, by the way, it is a prosperous town, though the name has been changed. Then, however, everything was rude and primitive.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jack Holden led the way to the Blazing Star Mine, and pointed out its capabilities and promise. He waited with some anxiety for Melville\u0027s decision.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t understand matters very well,” said Melville, “but I am willing to take a good deal on trust. If you desire it, I will buy half the mine, paying you five hundred dollars for that interest. That is, I buy it for Herbert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hooray!” shouted Holden. “Give us your hand, pard. You are my partner now, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he gripped Herbert\u0027s hand in a pressure which was so strong as to be painful, and the necessary business was gone through.\n\u003c/div\u003e \n\u003cdiv\u003e\n So Herbert found himself a half owner of the Blazing Star Mine, of Deer Creek, Colorado.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope your mine will turn out well, Herbert,” said Melville, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish it might for mother\u0027s sake!” said Herbert, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won\u0027t be my fault if it don\u0027t,” said his partner. “I shall stay here now, and get to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ought I not to help you?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; Mr. Melville will want you. I will hire a man here to help me, and charge it to your share of the expenses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So the matter was arranged; but Herbert rode over two or three times a week to look after his property.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2962/81536.html","bookId":427,"creation":"Aug 2, 2019 4:04:05 AM","modification":"Aug 2, 2019 4:04:05 AM"}
