{"id":2838,"no":36,"title":"Chapter 36","content":"I have written this to pass the time. It has amused me to look back to that summer in Nordland, when I often counted the hours, but when time flew nevertheless. All is changed. The days will no longer pass.\n\u003cbr\u003e \n\u003cbr\u003e I have many a merry hour even yet. But time — it stands still, and I cannot understand how it can stand so still. I am out of the service, and free as a prince; all is well; I meet people, drive in carriages; now and again I shut one eye and write with one finger up in the sky; I tickle the moon under the chin, and fancy that it laughs — laughs broadly at being tickled under the chin. All things smile. I pop a cork and call gay people to me.\n\u003cbr\u003e \n\u003cbr\u003e As for Edwarda, I do not think of her. Why should I not have forgotten her altogether, after all this time? I have some pride. And if anyone asks whether I have any sorrows, then I answer straight out, “No — none.”\n\u003cbr\u003e \n\u003cbr\u003e Cora lies looking at me. ?sop, it used to be, but now it is Cora that lies looking at me. The clock ticks on the mantel; outside my open window sounds the roar of the city. A knock at the door, and the postman hands me a letter. A letter with a coronet. I know who sent it; I understand it at once, or maybe I dreamed it one sleepless night. But in the envelope there is no letter at all — only two green bird’s feathers.\n\u003cbr\u003e \n\u003cbr\u003e An icy horror thrills me; I turn cold. Two green feathers! I say to myself: Well, and what of it? But why should I turn cold? Why, there is a cursed draught from those windows.\n\u003cbr\u003e \n\u003cbr\u003e And I shut the windows.\n\u003cbr\u003e \n\u003cbr\u003e There lie two bird’s feathers, I think to myself again. I seem to know them; they remind me of a little jest up in Nordland, just a little episode among a host of others. It is amusing to see those two feathers again. And suddenly I seem to see a face and hear a voice, and the voice says: “Her, Herr Lieutenant: here are your feathers.”\n\u003cbr\u003e \n\u003cbr\u003e “Your feathers.” . . .\n\u003cbr\u003e \n\u003cbr\u003e Cora, lie still — do you hear? I will kill you if you move!\n\u003cbr\u003e \n\u003cbr\u003e The weather is hot, an intolerable heat is in the room; what was I thinking of to close the windows? Open them again — open the door too; open it wide — this way, merry souls, come in! Hey, messenger, an errand — go out and fetch me a host of people . . .\n\u003cbr\u003e \n\u003cbr\u003e And the day passes; but time stands still.\n\u003cbr\u003e \n\u003cbr\u003e Now I have written this for my own pleasure only, and amused myself with it as best I could. No sorrow weighs on me, but I long to be away — where, I do not know, but far away, perhaps in Africa or India. For my place is in the woods, in solitude . . .\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/1197/36006.html","bookId":112,"creation":"Aug 1, 2019 4:09:20 AM","modification":"Aug 1, 2019 4:09:20 AM"}
