{"id":66655,"no":30,"title":"Page 30","content":"\u003cp\u003eThe Host can double as our Christmas treat –\u003c/p\u003e\n\u003cp\u003enow we can take communion as we eat!’\u003c/p\u003e\n\u003cp\u003eThe tinsel turned to dust. All of us looked away\u003c/p\u003e\n\u003cp\u003ein shock and shame, stunned not so much\u003c/p\u003e\n\u003cp\u003eby her coarse, bitter blasphemy as that she’d say\u003c/p\u003e\n\u003cp\u003esomething so cruel to you on Christmas Day –\u003c/p\u003e\n\u003cp\u003eyou, who so love us all without condition.\u003c/p\u003e\n\u003cp\u003eYou told her quietly,\u003c/p\u003e\n\u003cp\u003e‘Sit by yourself. Give thanks alone. We’ll wait\u003c/p\u003e\n\u003cp\u003efor you before we start.’ No indication\u003c/p\u003e\n\u003cp\u003eof how she’d speared your childless, pious heart.\u003c/p\u003e\n\u003cp\u003eWe didn’t eat. She sulked for half an hour\u003c/p\u003e\n\u003cp\u003eon the dark boards alone. After another\u003c/p\u003e\n\u003cp\u003eof us began to cry she crept back to your side,\u003c/p\u003e\n\u003cp\u003eand you were full of love and joy, because you always are.\u003c/p\u003e\n\u003cp\u003eShe whispered quietly, ‘I’m sorry, Mother.’\u003c/p\u003e\n\u003cp\u003e– Though you are not her mother, only she\u003c/p\u003e\n\u003cp\u003ewho once, some time ago and in a different hell,\u003c/p\u003e\n\u003cp\u003ecovered her tearful face and sang to her\u003c/p\u003e\n\u003cp\u003ewhile others dragged her mother’s body from your overcrowded cell\u003c/p\u003e\n\u003cp\u003eso that she would not see.\u003c/p\u003e\n\u003cp\u003eSandwiched in between Róża and Irina that night I thought about Christmas in Pennsylvania. Not about past Christmases – I was thinking about this Christmas. I thought about my mother, and Daddy and Karl and Kurt and Mawmaw and Grampa, and how they’d be sitting round the table for Christmas dinner – maybe they were doing it now, this very moment – sitting at the cherry table with Mother’s Limoges china from out of the corner cupboard, and the poinsettia tablecloth and the brass and china candelabra with the tall red candles on it, and Daddy starting to carve the turkey. Mawmaw would be trying to say funny things to make the boys laugh and Grampa would be starting on his third bourbon. Suddenly Mother would leap up from the table and run into the dark living room, lit only by the low fire and the red and blue and green lights on the Christmas tree, and she’d curl on the sofa and sob.\u003c/p\u003e\n\u003cp\u003eShe’d be doing it right now. I could see it so clearly, as though I were looking in the living-room window from the front porch.\u003c/p\u003e\n\u003cp\u003eShe’d know I was missing – she’d have known that for months. And she hoped and hoped I was still alive, but she didn’t really believe it.\u003c/p\u003e\n\u003cp\u003eAnd the worst thing was that even though I was alive, I would never be able to tell her – and even if I could tell her, if I could have come through the feathers of frost on the windowpane and whispered in her ear, ‘Your Rosie is still alive,’ what hope could I have given her when I told her where I was? That I was starving and freezing and covered with lice and scabies and would probably be dead of typhoid or shot for stealing a turnip before the war ended?\u003c/p\u003e\n\u003cp\u003eWell, anyway, I started to cry again.\u003c/p\u003e\n\u003cp\u003eAfter a while Róża wiped my face with her sleeve.\u003c/p\u003e\n\u003cp\u003e‘You are thinking about Pennsylvania now, aren’t you?’\u003c/p\u003e\n\u003cp\u003e‘I am thinking about my mother.’\u003c/p\u003e\n\u003cp\u003e‘You idiot. I never think about my mother. I’d rather pinch the holes in my leg until they’re black and blue than think about my mother.’\u003c/p\u003e\n\u003cp\u003eI could understand that – it was probably less painful for her never to think about her mother. But it didn’t help me.\u003c/p\u003e\n\u003cp\u003e‘My mother will never know what happened to me,’ I said. ‘At least your name is out there on the BBC. Your legs are in those photographs. I’m just French Political Prisoner 51498. They don’t even have my nationality right. No one will ever know. And I bet they’ll incinerate all their precious prisoner records anyway, when the Allies come. They won’t want anyone to find out what’s going on here, just like they don’t want anyone to find out what happened at Auschwitz last summer.’\u003c/p\u003e\n\u003cp\u003e‘Don’t think about your mother. Think about the food she’s eating,’ Róża advised cheerfully. ‘You have a special meal on Christmas Day, like the Germans, right? What do you have for Christmas dinner in Pennsylvania?’\u003c/p\u003e\n\u003cp\u003eHow she could be cheerful about food after what she did to Lisette I do not know. But we had the Christmas dinner discussion anyway. I won’t bother to write the rest of the conversation, because it was boring.\u003c/p\u003e\n\u003cp\u003eBut now I am longing again for Cope’s Dried Corn, boiled for two hours in milk and butter and sugar and salt. I am daydreaming about a tablespoon heaped with golden milky corn – just one spoonful.\u003c/p\u003e\n\u003cp\u003eOn New Year’s Day they made us line up for a special roll call, and the stinking commander gave a speech over the loudspeakers.\u003c/p\u003e\n\u003cp\u003eIt is one of the things I have nightmares about – that tinny voice droning on and on all around me, in words I can’t make head nor tail of, on and on and on. In my dreams I don’t understand the words, but at the same time I know exactly what the voice is saying.\u003c/p\u003e\n\u003cp\u003eThat’s because while we were standing there, in real life, Lisette was translating a mile a minute on one side of me and Karolina on the other, a sort of madwoman’s stereo speaker set up. So I had to listen to it all twice, Karolina a little behind Lisette.\u003c/p\u003e\n\u003cp\u003e‘He says, You’ll never get out alive –’\u003c/p\u003e\n\u003cp\u003e‘He’ll never let us out alive.’\u003c/p\u003e\n\u003cp\u003e‘They won’t let the Allies get near us –’\u003c/p\u003e\n\u003cp\u003e‘He’ll kill us all before the Allies get here.’\u003c/p\u003e\n\u003cp\u003e‘They’ll dismantle the camp –’\u003c/p\u003e\n\u003cp\u003e‘He’ll mine the camp, rig it with bombs, blow up the whole thing with us in it –’\u003c/p\u003e\n\u003cp\u003e‘– And one of the gas chambers is working now –’\u003c/p\u003e\n\u003cp\u003e‘And the first selections for gassing will be tomorrow.’\u003c/p\u003e\n\u003cp\u003eThis was the same stinking commander who liked to come and watch people get their backsides beaten raw every Friday. It could have been his idea of a joke: see if I can make all 50,000 of them cry on New Year’s Day. It was hard to know whether to take him seriously.\u003c/p\u003e\n\u003cp\u003eRóża didn’t. I could see her shoulders shaking as she tried desperately not to laugh.\u003c/p\u003e\n\u003cp\u003e‘Oh God,’ she cackled, ‘he must have really hit the New Year with a bang last night!’\u003c/p\u003e\n\u003cp\u003eHe might have been kidding about the mines. He wasn’t kidding about the gas chambers though.\u003c/p\u003e\n\u003cp\u003eThey started with the old and the injured and the sick, and they’d just pick you out of roll call. They tricked people into volunteering for it by telling them they’d be taken to a ‘rest camp’. It didn’t take us long to figure out what was going on. The Lublin Special Transport reckoned they were doomed: most of them limping, all of them condemned to death more than three years ago.\u003c/p\u003e\n\u003cp\u003eWhen it rained, when hail rattled on the roof, when the wind howled, when a train came clattering by, when the planes roared overhead or the air raid sirens wailed, when the anti-aircraft guns thumped and the demon Blockova Nadine Lutz couldn’t hear us, we all burst into a frenzy of whispered plots and panic.\u003c/p\u003e\n\u003cp\u003eIrina hadn’t let Nadine stop her from scavenging. She carried the copper wire from the shed wrapped round her waist like a belt. It was thin and flexible and she’d get it out under the table or over the ditches, sometimes even working at it lying blindly in the dark bunks with her hands held up over her head. Then she’d twist what she’d built carefully round her waist again and get it out later. Eventually she had to hide it in the roof behind the ceiling panels.\u003c/p\u003e\n\u003cp\u003e‘Are you making a bomb?’ Róża whispered in an agony of delight and curiosity, as we all balanced ourselves outside in the dark over the stinking sewer. ‘Like they did at Auschwitz?’\u003c/p\u003e\n\u003cp\u003e‘Kite!’ Karolina guessed, more sensibly.\u003c/p\u003e\n\u003cp\u003e‘It’s a plane,’ I said.\u003c/p\u003e\n\u003cp\u003eI’d been watching Irina shape the wings, the long and narrow wings of a glider. I could see where she was planning to reinforce the fuselage with her stolen strips of wood. It would be too heavy for a kite. But it might glide like a model plane, if she got a chance to cover it with her stolen paper. In the right wind it might soar for miles.\u003c/p\u003e\n\u003cp\u003eRóża choked back one of her insane giggles. ‘That’s not going to be big enough for all the Rabbits.’\u003c/p\u003e\n\u003cp\u003e‘Big enough for all your names though. Another escape for the Rabbits’ names!’\u003c/p\u003e\n\u003cp\u003e‘You have to write in piss so it’s invisible,’ Róża said knowingly. ‘That’s how we got the letter to the Pope.’\u003c/p\u003e\n\u003cp\u003eIt was getting harder and harder for the guards to keep track of what we did – we couldn’t get out of the camp, but the whole place was so crowded and filthy that it was easier to hide sabotage and thievery, if you weren’t too sick to move.\u003c/p\u003e\n\u003cp\u003e‘It will need a hell of a wind,’ Irina said. ‘If we could be ready to launch – find a place to hide it –’\u003c/p\u003e\n\u003cp\u003e‘I can launch it!’ Karolina said. ‘I can launch it from the air raid ditches. I can hide it in the sandbags till we get the right wind. You can sneak it out to us in one of your Corpse Crew carts!’\u003c/p\u003e\n\u003cp\u003e‘Corpse Crew’ – more and more, that’s what they were using my team for. During the winter, as everyone started collapsing with cold and starvation and a million diseases, that’s all we did – they stopped giving us other jobs and we were just one of a dozen Corpse Crews. They gave up on us boarding up broken windows, and concentrated on clearing the bunks in the Revier and the other sickbay blocks (they kept adding extra ones, trying to keep the typhoid and tuberculosis cases separated from everyone else). There were always dead bodies piled outside the tent in the morning, and there were usually a few from our own block with so many new people coming in – the incinerator in the crematorium was always working, greasy black soot splattering the daylight sky and red cinders spattering the sky at night.\u003c/p\u003e\n\u003cp\u003eI carried so many dead women this winter that I am – I don’t know how to put this. I want to say it’s like typhoid – I have been inoculated. I am immune. After the first couple of weeks, it stopped being appalling and became ordinary. It was better than if I’d been put to work in the crematorium. Wasn’t it?\u003c/p\u003e\n\u003cp\u003eIt was better. I didn’t do anything I’m ashamed of. Some of it was too fearsomely gruesome to write about, even to think about any more, and my mind skips lightly over it, the same way I can’t remember the week between my beatings. There was that time we had to pick up one of the schmootzichs and it turned out she wasn’t dead – this pathetic bundle of bones and rags lying in the Lagerstrasse, still breathing. The guard who’d found her made us load her up anyway, but we managed to sneak her into the washroom in the Revier on our way out to the crematorium. She was dead when we got back.\u003c/p\u003e\n\u003cp\u003eI made the place a little cleaner, a little less of a hellhole. Not much less, but what can one living girl do when there are two dozen dead women she has to move in a day? What can one starving girl on her feet do to help out a couple of hundred others who can’t get up? Especially if you don’t want to catch typhoid yourself.\u003c/p\u003e\n\u003cp\u003eI kept telling myself: I’ve been inoculated. I’ve had the ‘jabs’.\u003c/p\u003e\n\u003cp\u003eI was the only one of my work team who didn’t get sick this winter, but none of us ever got admitted to the Revier ourselves. We lived in horror of it, partly because of what we saw there several times a week – for me it was also because I knew in much too much detail what had happened to the Rabbits there. For a while Micheline had a fever high enough that she could have begged off work and got herself into the sickbay – you had to have a fever of 102 before they’d let you in – but instead she hid for three days in one of the blocked-up toilet cubicles in her barrack. None of the guards ever went in the broken toilets. Micheline was such a genius at pretending to follow rules that the whole time she was sick she didn’t miss a single roll call. \u003c/p\u003e","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-30.html","bookId":2673,"creation":"Oct 5, 2019 10:01:52 AM","modification":"Oct 5, 2019 10:01:52 AM"}
