{"id":66656,"no":31,"title":"Page 31","content":"\u003cp\u003eWe never launched Irina’s glider. We did get it hidden in the sandbags, but we never got the right wind or a moment when we wouldn’t be spotted trying to hurl a model airplane an open-arm-span wide over the twenty-foot-high walls. Who knows what happened to it, whether anyone found it, whether the names scribbled all over the fuselage were still legible? But dreaming about the potential success of our air mail service, doing it all in secret, kept us alive. When you lost hope, you turned into a schmootzich, one of the mindless beggars who were the bottom-crawlers of that entire scummy camp, or you died.\u003c/p\u003e\n\u003cp\u003eKite Flying\u003c/p\u003e\n\u003cp\u003e(by Rose Justice)\u003c/p\u003e\n\u003cp\u003eHope has no feathers.\u003c/p\u003e\n\u003cp\u003eHope takes flight\u003c/p\u003e\n\u003cp\u003etethered with twine\u003c/p\u003e\n\u003cp\u003elike a tattered kite,\u003c/p\u003e\n\u003cp\u003eslave to the wind’s\u003c/p\u003e\n\u003cp\u003ecapricious drift,\u003c/p\u003e\n\u003cp\u003eeager to soar\u003c/p\u003e\n\u003cp\u003ebut needing lift.\u003c/p\u003e\n\u003cp\u003eHope waits stubbornly,\u003c/p\u003e\n\u003cp\u003ewatching the sky\u003c/p\u003e\n\u003cp\u003efor turmoil, feeding on\u003c/p\u003e\n\u003cp\u003ethings that fly:\u003c/p\u003e\n\u003cp\u003ecrows, ashes, newspapers,\u003c/p\u003e\n\u003cp\u003edry leaves in flight\u003c/p\u003e\n\u003cp\u003eall suggest wind\u003c/p\u003e\n\u003cp\u003ethat could lift a kite.\u003c/p\u003e\n\u003cp\u003eHope sails and plunges,\u003c/p\u003e\n\u003cp\u003efirmly caught\u003c/p\u003e\n\u003cp\u003eat the end of her string –\u003c/p\u003e\n\u003cp\u003efallen slack, pulling taut,\u003c/p\u003e\n\u003cp\u003eragged and featherless.\u003c/p\u003e\n\u003cp\u003eHope never flies\u003c/p\u003e\n\u003cp\u003ebut doggedly watches\u003c/p\u003e\n\u003cp\u003efor windy skies.\u003c/p\u003e\n\u003cp\u003eLisette had bigger plans than paper airplanes.\u003c/p\u003e\n\u003cp\u003e‘There are transports leaving every day for Ravensbrück’s satellite camps,’ she directed. ‘We need to get the Rabbits out of here. We need to be organised. We’ll start with the youngest – all the Rabbits under twenty-one, the schoolgirls. Smuggle one or two at a time into the evacuation transports as they leave. Now listen, my darlings, the next time they try to pull any more Rabbits out of a roll call, we’re going to have to be brave. We’re going to have to disrupt things so violently they can’t count us. Everyone switch numbers – something like that. And every one of the girls who gets out will take the list with her – the names from the Lublin Transport, everybody who was operated on. We are going to tell the world.’\u003c/p\u003e\n\u003cp\u003eLisette got dragged out of line the next morning without warning and we thought she was dead. I marched off to my hideous work snivelling like a two-year-old. I sobbed quietly to myself all day – Micheline worked beside me and Irina without asking what was going on. It wasn’t the first time one of us had sobbed quietly to herself all day. But Anna got so fed up with me that she smacked me with someone’s empty shoe.\u003c/p\u003e\n\u003cp\u003eAnd it turned out Lisette wasn’t dead anyway. Because she was an archivist she’d been hand-picked to do some secretarial work in the record office. She came back unbelievably excited. She whispered her news to us in the evening roll call.\u003c/p\u003e\n\u003cp\u003e‘There’s a radio in the record office – a radio! It’s always on! We’ve pushed the German army back!’\u003c/p\u003e\n\u003cp\u003e‘Really?’ Karolina gasped. ‘Really?’\u003c/p\u003e\n\u003cp\u003e‘Well, back to where they were in December – everyone is fighting up to their hips in snow.’\u003c/p\u003e\n\u003cp\u003eWe groaned. It was the end of January, and the best we could do was beat the Germans back to their December starting point?\u003c/p\u003e\n\u003cp\u003e‘What about France?’ Róża and Karolina clamoured together. ‘What about Belgium? Have the Allies crossed the Rhine yet?’\u003c/p\u003e\n\u003cp\u003e‘No, no. Look, darlings, forget about the Western Allies! The Soviets are going to get here first. Yesterday they liberated Auschwitz!’\u003c/p\u003e\n\u003cp\u003eIt was all I could do not to yell. We stamped our feet wildly in the black slush, a little defiant dance of triumph.\u003c/p\u003e\n\u003cp\u003e‘Shit,’ Irina said. ‘I will go straight from a Fascist prison camp to a Soviet one.’\u003c/p\u003e\n\u003cp\u003e‘Why? You’re a double Ace! A decorated Hero of the Soviet Union! You spent four months being interrogated by the enemy and didn’t tell them anything!’\u003c/p\u003e\n\u003cp\u003e‘When a person spends four months being interrogated by the enemy and is still alive at the end, the Soviet Union calls her a traitor, not a hero. No, thank you. I would rather hang myself than go home.’\u003c/p\u003e\n\u003cp\u003eShe sounded like she meant it, too, which kind of put a damper on our excitement about being rescued by the Soviets.\u003c/p\u003e\n\u003cp\u003eAnna caught me in the horrible converted washroom and handed me a list of numbers written on a strip of grey paper a quarter of an inch wide.\u003c/p\u003e\n\u003cp\u003e‘What is this?’\u003c/p\u003e\n\u003cp\u003e‘Tomorrow’s list.’\u003c/p\u003e\n\u003cp\u003e‘Tomorrow’s death list? But –’\u003c/p\u003e\n\u003cp\u003eThere were dozens and dozens of numbers there. I started to read them, and realised that I knew almost every one of them. I associated faces with most of them. 7705 especially – Róża. Karolina too. Every single one of the Rabbits was on that list, and a few others, including Lisette.\u003c/p\u003e\n\u003cp\u003e‘They’re going to shoot eighty people in a day?’ I gasped.\u003c/p\u003e\n\u003cp\u003e‘Just tell everyone you see. That’s what I’m going to do. Maybe . . .’\u003c/p\u003e\n\u003cp\u003eI was reeling. Except Irina, my whole family was on that list.\u003c/p\u003e\n\u003cp\u003e‘They can’t execute all of them!’ I burst out, and the German girl laughed at me.\u003c/p\u003e\n\u003cp\u003e‘Of course they can. They can do whatever they fucking want. And what they’re doing now is burning the evidence.’\u003c/p\u003e\n\u003cp\u003eShe pointed to the last number on the list – 32131 – a lot higher in sequence than the others. Also a familiar number.\u003c/p\u003e\n\u003cp\u003e‘You too!’\u003c/p\u003e\n\u003cp\u003e‘I’m a witness,’ she said, with bitter irony. ‘My God. I never thought I’d end up shovelled into the Ravensbrück incinerator with that pathetic bunch of Poles.’ She suddenly took the unlit cigarette butt out of her mouth and tucked it down the front of her dress. She looked away. ‘I’m sorry.’\u003c/p\u003e\n\u003cp\u003e‘Tell me how to tell people in German!’ I gasped. ‘Tell me how to say, “They’re killing the Rabbits.” If I tell people in German, everyone will pass it on.’\u003c/p\u003e\n\u003cp\u003eShe wasn’t even listening.\u003c/p\u003e\n\u003cp\u003e‘They’ll gas us,’ she said, gripping the sides of the dry sink and staring at the stained tiles. ‘That many at once – they won’t waste the ammunition. They’ll do it all at once, now they’ve got that gas chamber operational. It hurts. If you stand by the wall near the crematorium you can hear them screaming. Ach –’\u003c/p\u003e\n\u003cp\u003eShe swore in German and let out a sob.\u003c/p\u003e\n\u003cp\u003e‘Listen, Anna,’ I said fiercely. ‘It won’t happen! OK? No one in this whole camp will let it happen. Last time they tried to execute any of the Rabbits, we hid them. They killed our block leader because she wouldn’t give them up. But that was just us, fighting back on our own. You’ve got to tell everybody this time.’\u003c/p\u003e\n\u003cp\u003eShe looked up at me with wild, wet eyes, and gave a croak of a laugh. ‘You really believe we can do something, don’t you, kid?’\u003c/p\u003e\n\u003cp\u003e‘We can try!’\u003c/p\u003e\n\u003cp\u003eAnna stared at the wall, avoiding looking at any of the bodies piled at our feet. Two more of my team came in, carrying another. I hadn’t started undressing any of them yet.\u003c/p\u003e\n\u003cp\u003e‘Anna’s on the list,’ I cried, holding it up.\u003c/p\u003e\n\u003cp\u003eAnna, grey-faced, added indifferently, ‘So are all the Kaninchen.’\u003c/p\u003e\n\u003cp\u003e‘Les Lapins!’ the French girls exploded in outrage. ‘The Rabbits? The KRÓLIKI? All of them? No. Never!’\u003c/p\u003e\n\u003cp\u003e‘Hide them!’ Micheline exclaimed. ‘Hide every one of them tonight! All of Ravensbrück will fight for the Rabbits. People are waiting for a chance to fight for the Rabbits.’\u003c/p\u003e\n\u003cp\u003e‘Karolina?’ Irina asked me. ‘Róża?’\u003c/p\u003e\n\u003cp\u003e‘All of them. The whole Lublin Transport. Lisette too.’\u003c/p\u003e\n\u003cp\u003eUnlike me, Irina didn’t panic.\u003c/p\u003e\n\u003cp\u003e‘Let me have your armband,’ she said to Anna. ‘And one hour. I can do something.’\u003c/p\u003e\n\u003cp\u003e‘Where will you go?’ Anna asked sharply.\u003c/p\u003e\n\u003cp\u003e‘To talk to my friend in the power plant – we were electricians in the Moscow Metro together, before I flew. I think she can switch off the lights. She will do it in roll call tomorrow morning. They will find no one.’\u003c/p\u003e\n\u003cp\u003eAnna moved slowly and cautiously, like a person with a migraine. She peeled off her red Kolonka’s armband and held it out to Irina. Irina slid it over her own sleeve and stalked out, her shock of white hair catching the gleam of the bare electric bulb overhead as she turned to go.\u003c/p\u003e\n\u003cp\u003e‘You’d better hide too, Anna,’ I said in English.\u003c/p\u003e\n\u003cp\u003e‘Who’ll hide me?’ she scoffed with bleak fatalism, her pale eyes bright and wild. ‘You could break my leg maybe, make me look like a Rabbit. See if the disguise fools anyone.’\u003c/p\u003e\n\u003cp\u003eWe all looked at her in pity, and looked away. I sure couldn’t invite her to hide with my Block 32 Camp Family – and even for twenty loaves of bread the Auschwitz evacuees in the tent wouldn’t hide a German criminal. I thought about offering to swap coats with her, to swap our numbers. I really did. It is the Girl Scout in me, always wanting to help. She was an OK group leader and now she just seemed so grim and crazed – so afraid. But I couldn’t come up with a good reason to sacrifice my life for her.\u003c/p\u003e\n\u003cp\u003eMicheline saw me thinking about it. She shook her head at me to stop me opening my mouth.\u003c/p\u003e\n\u003cp\u003e‘No one will notice another body here tomorrow morning,’ Micheline suggested to Anna brutally. ‘No one counts the corpses more than once. If we get the chaos the Soviet electricians promise, hide in here.’\u003c/p\u003e\n\u003cp\u003eFor Anna\u003c/p\u003e\n\u003cp\u003e(by Rose Justice)\u003c/p\u003e\n\u003cp\u003eYour sullen sneer,\u003c/p\u003e\n\u003cp\u003ethin lips and\u003c/p\u003e\n\u003cp\u003eunlit cigarette\u003c/p\u003e\n\u003cp\u003ehave disappeared\u003c/p\u003e\n\u003cp\u003ewithout a trace\u003c/p\u003e\n\u003cp\u003eand no one cares\u003c/p\u003e\n\u003cp\u003eand we’ll forget.\u003c/p\u003e\n\u003cp\u003eI don’t care either\u003c/p\u003e\n\u003cp\u003ebut I saw\u003c/p\u003e\n\u003cp\u003edesperate and raw\u003c/p\u003e\n\u003cp\u003efear in your face –\u003c/p\u003e\n\u003cp\u003eyou said you’d hide.\u003c/p\u003e\n\u003cp\u003eI wonder now\u003c/p\u003e\n\u003cp\u003ehow hard you tried –\u003c/p\u003e\n\u003cp\u003eand if you lived\u003c/p\u003e\n\u003cp\u003eor if you died,\u003c/p\u003e\n\u003cp\u003eI wonder how.\u003c/p\u003e\n\u003cp\u003eBlock 32 that night was a prison all on its own, swarming with guards and dogs, the wire gate locked, the door to the barrack barred. It was almost surprising they let the rest of us back in, but they did, and we got our soup ration as usual. We even fought over it sort of as usual:\u003c/p\u003e\n\u003cp\u003e‘Here, take mine, you need all the energy you can get tonight.’\u003c/p\u003e\n\u003cp\u003eOr more realistically, ‘Look, just give me yours, ’cause you won’t need it if they kill you tomorrow morning anyway.’\u003c/p\u003e\n\u003cp\u003eKarolina had the same fierce, dazed gleam of insanity in her eyes as our German Kolonka Anna – the look of crazed disbelief at the UNFAIRNESS of it.\u003c/p\u003e\n\u003cp\u003eLisette just looked like Lisette. Róża was a pain in the neck.\u003c/p\u003e\n\u003cp\u003e‘What do you think I’ll look like when I go up in smoke from the crematorium chimney, Rosie? As sexy as Karolina, slinking across the sky?’\u003c/p\u003e\n\u003cp\u003e‘Will you shut up!’\u003c/p\u003e\n\u003cp\u003eShe wasn’t trying to be funny. She was trying to be brave, Różyczka-style. But it was making Karolina cry.\u003c/p\u003e\n\u003cp\u003eIrina took hold of my hand and pressed it against her waist. Tied inside her dress was a pair of wire-cutters. The hard line of her mouth was set in the ghost of a grin. She spread her palm and rocked her hand at me. Still a combat pilot.\u003c/p\u003e\n\u003cp\u003eThe thing was, so many people were sobbing and crying and praying that night, that neither the guards nor Nadine could hear us as the Rabbits made their escape. I crawled with Róża and Karolina over the infested bare boards that counted as our bunks – people moved out of our way. Everybody helped. When one of the guards shouted or the dogs started growling, we lay flat and sobbed loud and genuine sobs of fear and frustration. It was easy. \u003c/p\u003e","sourceLink":"https://allnovel.net/rose-under-fire-code-name-verity-2/page-31.html","bookId":2673,"creation":"Oct 5, 2019 10:01:52 AM","modification":"Oct 5, 2019 10:01:52 AM"}
