{"id":89794,"no":36,"title":"Page 36","content":"\u003cp\u003eThen he spotted good old Father Tom, running toward his sister with another priest by his side. There was a beautiful look of terror in Tom’s eyes. He savored it and sighed with pleasure. Now what in tarnation did those silly priests think they were going to do? Pray him into giving himself up?\u003c/p\u003e\n\u003cp\u003eVengeance is mine sayeth the Lord. Was Father Tom thinking about vengeance now? The possibility amused him. Perhaps the next time he went to confession he would ask him. A priest should understand. That was his job, wasn’t it? To understand and forgive? Maybe understanding would come with death. He mulled over that philosophical possibility and then shrugged. What did he care if Tommy understood or not?\u003c/p\u003e\n\u003cp\u003eMy, oh my, he hadn’t had this much fun in a long, long time. And it was only going to get better, as long as he kept the anger reined in, controlled it, soothed the beast with promises of the havoc to come. How dare they think they could outwit him? Ignorant mules, all of them.\u003c/p\u003e\n\u003cp\u003eStill, caution was called for now. Bide his time, that was the ticket. He certainly wasn’t afraid or even worried about the mules. He had invited the FBI boys to Holy Oaks, now hadn’t he? But he so wanted to be a gracious host, a regular Martha Stewart, if you will, and so he needed to know the exact number he would be entertaining. There had to be enough refreshments to go around. Did he bring enough C-4 with him? He thought about it for a minute and then smiled. Why, yes, as a matter of fact, he did.\u003c/p\u003e\n\u003cp\u003eHeartbreaker was always prepared.\u003c/p\u003e\n\u003cp\u003eHis goal was to eliminate as many of the mules as he could, as long as it didn’t interfere with his primary objective. The target. Get the target and have a little old-fashioned fun at the same time, while he proved to the world that he was The Superior Being. None of the FBI boys were a match for him. And soon now, very soon, when it was too late and they couldn’t run and hide, they would realize it.\u003c/p\u003e\n\u003cp\u003eHe would take care of his unfinished business and at the same time let the world mock them all on national television. Prime time. KABOOM. Film at eleven. Yes, sirree.\u003c/p\u003e\n\u003cp\u003eCHAPTER 25\u003c/p\u003e\n\u003cp\u003eAnother day passed and the pressure was mounting.\u003c/p\u003e\n\u003cp\u003eThe thought of another crowded gathering was making Laurant physically ill, but she wasn’t about to disappoint Michelle on one of the biggest nights of her life, her wedding rehearsal and the dinner that followed.\u003c/p\u003e\n\u003cp\u003eAfter the first course, Michelle noticed that Laurant hadn’t touched her food. Leaning across the table, she whispered, “You don’t look so good, sweetie.”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” Laurant answered, forcing a smile.\u003c/p\u003e\n\u003cp\u003eMichelle knew better, and she turned to Nick for help. “Why don’t you take Laurant home and put her to bed,” she suggested.\u003c/p\u003e\n\u003cp\u003eWhen Laurant opened her mouth to protest, Michelle stopped her. “I don’t want you getting sick. I am not walking down that aisle tomorrow without you.”\u003c/p\u003e\n\u003cp\u003eLaurant and Nick said their early good-bye’s and headed home.\u003c/p\u003e\n\u003cp\u003eA dozen red roses were waiting on the front porch when they arrived. Nick picked up the vase on his way inside the house.\u003c/p\u003e\n\u003cp\u003e“They were delivered right after you left,” Joe said.\u003c/p\u003e\n\u003cp\u003eNick read the card out loud. “Please forgive me and come home. Love, Joel.”\u003c/p\u003e\n\u003cp\u003eLaurant took the vase and put it on the dining room table. Nick and Joe followed. The two men stood side by side frowning at the roses.\u003c/p\u003e\n\u003cp\u003e“It seems such a waste to throw them out,” she said. “But that’s what I usually do. I don’t want to be reminded of Joel Patterson every time I walk through this room.”\u003c/p\u003e\n\u003cp\u003e“How often does this creep send you flowers?” Nick asked, trying not to let his irritation show.\u003c/p\u003e\n\u003cp\u003e“About once a week,” she said. “He won’t give up.”\u003c/p\u003e\n\u003cp\u003e“Yeah? We’ll see about that.” He picked up the vase, went into the kitchen, and emptied the water in the sink, then dropped the vase and the roses into the trash can. “He’s a tenacious bastard, isn’t he?”\u003c/p\u003e\n\u003cp\u003e“Patterson’s the man in Chicago who was doing his secretary while he was chasing you, right?” Joe asked.\u003c/p\u003e\n\u003cp\u003eHis frank assessment didn’t faze her. “Yes, he’s the one.”\u003c/p\u003e\n\u003cp\u003e“I’d say he’s having trouble letting go,” Joe remarked. “But don’t worry. Nick will take care of him.”\u003c/p\u003e\n\u003cp\u003e“No, he won’t take care of him,” she countered, a bit more sharply than she’d intended. “Joel Patterson is my problem, and I’ll deal with him.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Joe said, surprised by the burst of anger. “Whatever you decide is fine with me.”\u003c/p\u003e\n\u003cp\u003e“I’m ignoring him.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t seem to be working,” he pointed out.\u003c/p\u003e\n\u003cp\u003e“Let him spend his money on flowers. I don’t care. Now can we please drop the subject?”\u003c/p\u003e\n\u003cp\u003e“Yes, sure.”\u003c/p\u003e\n\u003cp\u003eShe put her hand to her brow. “Look, I’m sorry I snapped at you. It’s just . . . after what happened at the picnic . . . he was there, Joe. And he wanted me to know he was watching me. ‘I Only Have Eyes for You.’ That was the song he requested. Cute, huh?”\u003c/p\u003e\n\u003cp\u003e“I heard all about it,” Joe said as he followed her into the kitchen. He had already guessed what she was going to do. Make tea. Joe knew the strain was getting to her. In the harsh kitchen light, she looked pale, as though she hadn’t had a good night’s sleep in weeks.\u003c/p\u003e\n\u003cp\u003eJoe blurted out what he was thinking. “You’ve got to stay strong.”\u003c/p\u003e\n\u003cp\u003eShe whirled around to face him, one hand defiantly on her hip. “You don’t have to worry about me.”\u003c/p\u003e\n\u003cp\u003eEasier said than done, Joe thought. “Why don’t you go into the living room and watch a little television?”\u003c/p\u003e\n\u003cp\u003e“I’m going to make a cup of hot tea. Would you like some?”\u003c/p\u003e\n\u003cp\u003e“Sure,” he said. It felt like it was 110 in the kitchen, but if she wanted to make hot tea for him, he’d drink it.\u003c/p\u003e\n\u003cp\u003eHe sat down and watched her work. Nick was in the back hallway, talking on his phone, his head bent, his voice too low to make out any of the conversation. Joe figured he was either talking to Morganstern or Wesson.\u003c/p\u003e\n\u003cp\u003eLaurant took the kettle to the sink and held it under the faucet. She stared at the fleur-de-lis painted on the white tile above the splash guard while she thought about the picnic.\u003c/p\u003e\n\u003cp\u003eNick had finished his call and came back into the kitchen in time to hear her say, “Lonnie was there at the picnic. He left early, but he could have put that piece of paper in the hat before Tommy chased him away.”\u003c/p\u003e\n\u003cp\u003eNick got a Diet Pepsi out of the fridge and popped the lid. He took a long swallow and then said, “Yeah, Lonnie could have done that, but he couldn’t be in two places at once, and we know he hasn’t left Holy Oaks in the last month. He was in town when the unsub talked to Tommy in the confessional.”\u003c/p\u003e\n\u003cp\u003e“When did you find that out?” Laurant asked.\u003c/p\u003e\n\u003cp\u003e“I go that bit of information from Feinberg this morning.”\u003c/p\u003e\n\u003cp\u003eShe turned back to the sink. “So who wasn’t here?” she asked.\u003c/p\u003e\n\u003cp\u003eThe kettle was filled, and water was now pouring down the sides. Nick took it out of her hands, poured out half the water, and then put the kettle on the stove top.\u003c/p\u003e\n\u003cp\u003e“The sheriff was out of town,” Joe told her. “And so was Steve Brenner. He told friends he was going fishing.”\u003c/p\u003e\n\u003cp\u003eLaurant got out the tea bags and cups from the cupboard and put them on the table. She didn’t seem to notice that Nick was drinking a Pepsi. She was still going to make him a cup of tea. He smiled while he watched her work. The quirky habit of hers was odd but sweet.\u003c/p\u003e\n\u003cp\u003eShe sat down to wait for the water to heat. Restless, she picked up the deck of cards Joe had left and began to shuffle them.\u003c/p\u003e\n\u003cp\u003e“What about the crime scene Wesson was so excited about? Shouldn’t we have heard something by now?”\u003c/p\u003e\n\u003cp\u003eJoe answered. “The lab’s working on the evidence they’ve collected. I do know the scene was contaminated.”\u003c/p\u003e\n\u003cp\u003e“Contaminated by what?”\u003c/p\u003e\n\u003cp\u003e“Cows,” Joe said.\u003c/p\u003e\n\u003cp\u003eShe couldn’t block the picture Joe had just evoked and whispered, “Oh, God.”\u003c/p\u003e\n\u003cp\u003e“Deal the cards,” he suggested, hoping to turn her attention. “We’ll play gin.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she whispered, but she continued to sit there, shuffling the cards. Joe finally took them out of her hands and dealt them for her.\u003c/p\u003e\n\u003cp\u003e“I know it seems like a lot of time has passed, but—” Nick began.\u003c/p\u003e\n\u003cp\u003eShe didn’t let him finish. “They won’t find his fingerprints. They won’t find any evidence that could lead them to him.”\u003c/p\u003e\n\u003cp\u003eNick sat down, straddling the chair with his arms braced against the back. “Don’t make him superhuman. He bleeds like the rest of us. He’s going to mess up, and then we’ll nail him.”\u003c/p\u003e\n\u003cp\u003eShe picked up her cards and looked them over. “The sooner the better, right?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Okay, then why don’t we make it happen sooner. I think Wesson’s right. Maybe I should go running alone tomorrow, and maybe I should spend the day doing errands on my own. Don’t shake your head at me. He’s looking for an opportunity, and I think we should accommodate him. You could make sure I was safe.”\u003c/p\u003e\n\u003cp\u003e“No.” He was emphatic.\u003c/p\u003e\n\u003cp\u003e“Don’t you think we should discuss this before you—”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe held her temper. “I really think—”\u003c/p\u003e\n\u003cp\u003eHe cut her off. “I promised your brother I wouldn’t let you out of my sight, and that’s the way it’s going to be.”\u003c/p\u003e\n\u003cp\u003e“Hey, Nick, chill out,” Joe suggested.\u003c/p\u003e\n\u003cp\u003eThe burst of anger was short-lived. “Yeah, right,” he agreed.\u003c/p\u003e\n\u003cp\u003eThe tension was getting to both of them. Laurant knew why she was feeling so frustrated. Her every movement was being controlled by a lunatic. Yes, that was exactly what was happening, and God, how she hated it. But why was Nick losing his temper? He should be used to working under this kind of strain, shouldn’t he? Up until tonight, he’d been very laid-back and as steady as a rock. How in God’s name was he able to do it, day in and day out? The special unit he worked for searched for abducted children. She couldn’t think of anything more terrifying than a child in danger. The pressure had to be tremendous.\u003c/p\u003e\n\u003cp\u003e“You’re the expert. I’ll let you decide what’s to be done. If you don’t want me to run alone, then I won’t,” she said.\u003c/p\u003e\n\u003cp\u003eShe’d done a complete turnaround in a matter of seconds, and Nick couldn’t figure out why she was suddenly being reasonable again. “How come?” he asked suspiciously.\u003c/p\u003e\n\u003cp\u003e“I don’t want to make your job any more difficult than it already is,” she said.\u003c/p\u003e\n\u003cp\u003e“Now that you two are calm, I kind of hate to bring this up,” Joe said. He discarded a card and picked up a new one. “ ’Cause I know Nick’s going to get upset again, but—”\u003c/p\u003e\n\u003cp\u003e“I don’t get upset. What do you need to tell me?”\u003c/p\u003e\n\u003cp\u003e“If the unsub doesn’t poke his head out of the woodpile within the next couple of days, I’m going to be reassigned.”\u003c/p\u003e\n\u003cp\u003eThe muscle in Nick’s jaw flexed.\u003c/p\u003e\n\u003cp\u003e“How do you know you’ll be reassigned?” Laurant asked Joe.\u003c/p\u003e\n\u003cp\u003eNick answered. “Wesson. I’m right, aren’t I?”\u003c/p\u003e\n\u003cp\u003eJoe nodded. “He thinks maybe the unsub knows I’m here, and if I make a big deal about leaving, then maybe—”\u003c/p\u003e\n\u003cp\u003e“Give me a break,” Nick snapped.\u003c/p\u003e\n\u003cp\u003e“And I suppose if the unsub still doesn’t try to grab her, then Wesson will reassign the other agents so the unsub will feel more comfortable? I’ve got an idea. Why don’t we all pack up now and leave? Laurant can leave the front door open so he won’t have any trouble getting inside. That’s pretty much Wesson’s game plan, isn’t it, Joe. He’ll stay in Holy Oaks though, you can bet your ass on that.”\u003c/p\u003e\n\u003cp\u003eJoe pointed at the disc to remind Nick that Wesson could be listening in. Nick couldn’t have cared less. He wanted him to know what he thought of his methods.\u003c/p\u003e\n\u003cp\u003eNick unpinned the disc and held it up so he could speak directly into the microphone. “You want to be the big man to catch the unsub, don’t you, Jules? At any cost. That’s the plan, isn’t it? It’ll look great on your record, and your political ambitions are far more important than Laurant’s safety.”\u003c/p\u003e\n\u003cp\u003eFeinberg’s voice responded. “Sorry to disappoint you, Nick, but I’m monitoring the line, not Wesson, and as far as I’m concerned, you guys are talking about the weather.”\u003c/p\u003e\n\u003cp\u003eThe agent was doing his best to protect Nick, but the effort wasn’t appreciated. Wesson couldn’t hurt Nick professionally, and even if he could, Nick wouldn’t have cared. How would he feel if he got fired? Maybe relieved, he thought. Bad attitude, he decided, but he couldn’t make himself care about that either.\u003c/p\u003e\n\u003cp\u003eMorganstern was right. Nick needed a vacation, and he needed sex. Lots of sex, but not with just any woman. He wanted Laurant.\u003c/p\u003e\n\u003cp\u003e“Gin.” Laurant smiled at Joe when she showed him her cards. He groaned.\u003c/p\u003e\n\u003cp\u003eThe kettle began to hiss. Laurant got up to fix the tea. She poured water into all three cups, then put the kettle back on the stove and turned to walk out of the kitchen.\u003c/p\u003e\n\u003cp\u003e“Hey, what about your tea?” Joe asked.\u003c/p\u003e\n\u003cp\u003e“I’m going upstairs now. I think I’d like to take a hot bubble bath.”\u003c/p\u003e\n\u003cp\u003eNick gritted his teeth. Now, why in the hell did she think they needed to know that? Damn. His mind went wild, and all he could think about was her lush body covered in a mist of bubbles. He wanted to follow her and dive into the tub with her. He headed to the guest room instead and took a cold shower.\u003c/p\u003e\n\u003cp\u003eJoe was watching a movie downstairs, so Nick, dressed in his jeans and his favorite old T-shirt, went into Laurant’s room to watch Sports Roundup.\u003c/p\u003e\n\u003cp\u003eTheo called to check in. It was late in Boston, but his brother never slept. He was in the mood to talk about the latest bizarre case he was prosecuting. Nick tried to pay attention, but his eyes were locked on that bathroom door, and x-rated images kept flashing through his mind.\u003c/p\u003e\n\u003cp\u003e“What’d you say?” he asked Theo.\u003c/p\u003e\n\u003cp\u003e“Is everything okay with you?”\u003c/p\u003e\n\u003cp\u003eHell, no. “Sure,” he answered. “You know how it goes. It’s the waiting that makes me nuts.”\u003c/p\u003e\n\u003cp\u003e“How come you haven’t mentioned Laurant? I haven’t seen her in years. I’ll bet she’s changed. What’s she like?”\u003c/p\u003e\n\u003cp\u003e“She’s Tommy’s sister. That’s what she’s like.” Big mistake, Nick realized as soon as the words were out of his mouth. He’d sounded defensive, and Theo’s reputation for being a top-rate prosecutor wasn’t just talk. He immediately went for the jugular. \u003c/p\u003e","sourceLink":"https://allnovel.net/heartbreaker-buchanan-renard-1/page-36.html","bookId":1835,"creation":"Oct 5, 2019 5:38:23 PM","modification":"Oct 5, 2019 5:38:23 PM"}
