{"id":29904,"no":2,"title":"Chapter 2","content":"\u0026nbsp;Dawn touched the High Sierras as the station whirled in from the Pacific, 500 miles high. \n\u003cdiv\u003e\n \"Bert. Get me a radar fix on White Sands.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Morrow huddled over the small computer, feeding in radar information as it came from his assistant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Rocket away!\" Blared a radio speaker on the bulkhead. The same message carried to the four space-suited tugmen floating beyond the rim of the wheel, linked with life-lines.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jones watched interestedly out the port.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There she is!\" he yelled.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sunlight caught the ascending rocket, held it in a splash of light. The intercept technique was routine now, a matter of timing, but for a moment Kevin succumbed to the frightening optical illusion that the rocket was approaching apex far below the station. Then, slowly, the slender cylinder matched velocity and pulled into the orbit, crept to its destination.\n\u003c/div\u003e \n\u003cdiv\u003e\n With deceptive ease, the four human tugs attached magnetic shoes and guided the projectile into the space station hub with short, expert blasts of heavy rocket pistols.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take over Bert,\" Morrow directed, \"I guess I\u0027m the official greeter.\" He hurried out of the control room, through a short connecting tube and emerged floating in the central space surrounding the hub where artificial gravity fell to zero. Air pressure was normal to transfer passengers without space suits.\n\u003c/div\u003e \n\u003cdiv\u003e\n The connecting lock clanked open. The rocket pilot stepped out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He got sick,\" the pilot whispered to Kevin. \"I swabbed him off, but he\u0027s hoppin\u0027 mad.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The senator\u0027s mop of white hair appeared in the port. Kevin braced to absorb a tirade, but McKelvie\u0027s deep scowl changed to an expression of bliss as he floated weightless into the tiny room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, this is wonderful!\" he sputtered. He waved his arms like a bird and kicked experimentally with a foot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Grab him!\" Kevin shouted. \"He\u0027s gone happy with it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The pilot was too late. McKelvie\u0027s body sailed gracefully through the air and his head smacked the bulkhead. His eyes glazed in a frozen expression of carefree happiness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kevin swore. \"Now he\u0027ll accuse us of a plot against his life. Help me get him to sick bay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The two men guided the weightless form into a tube connecting with the outer ring. As they pushed outward, McKelvie\u0027s weight increased until they carried him the last 50 feet into the dispensary compartment.\n\u003c/div\u003e \n\u003cdiv\u003e\n Max Gordon burst wild-eyed into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you done to the senator?\" he shouted. \"Why didn\u0027t you tell me he was coming up?\" Morrow made sure McKelvie was receiving full medical attention before he turned to the junior officer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He went space happy and bumped his head,\" Kevin said curtly, \"and there was no more reason to notify you than the rest of the crew.\" He walked away. Gordon bent solicitously over his unconscious patron.\n\u003c/div\u003e \n\u003cdiv\u003e\n Kevin found Anderson in the passageway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I ordered them to start fueling Moonbeam,\" Bert said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good. Is Mark awake?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eating breakfast. The psycho\u0027s giving him a clinical chat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish it were over.\" Morrow brushed back his hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve really got the jitters, huh chief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Morrow turned angrily and then tried to laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d sell my job for a nickel right now, Bert. This will be touch and go, without having the worst enemy of space flight aboard. If this ship fails, it\u0027s more than a rocket or the death of a man. It\u0027ll set the whole program back 50 years.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know,\" Bert answered, \"but he\u0027ll make it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Footsteps sounded in the tube outside the cabin. Mark Kramer walked in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hi, chief,\" he grinned, \"Moonbeam ready to go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The techs are out now and fuel\u0027s aboard. How about you? Shouldn\u0027t you get some rest?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s all I\u0027ve had since they shipped me out here.\" Kramer laughed. \"It\u0027ll be a snap. After all, I\u0027ll never make over two gees and pick up 7000 mph to leave you guys behind. Then I play ring around the rosy, take a look at Luna\u0027s off side and come home. Just like that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just like that,\" Kevin whispered meditatively. The moon rocket, floating there outside the station\u0027s rim was ugly, designed never to touch a planet\u0027s atmosphere, but it was the most beautiful thing man had ever built, assembled in space from individual fragments boosted laboriously from the Earth\u0027s surface.\n\u003c/div\u003e \n\u003cdiv\u003e\n Another clatter of footsteps approached the hatch. Max Gordon entered and stood at attention as Senator McKelvie made a dignified entrance. The senator wore an adhesive patch on his high forehead. He turned to Kramer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Young man,\" he rumbled, \"are you the fool risking your life in that—that thing out there? You must know it\u0027ll never reach the moon. I know it\u0027ll never—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Kramer\u0027s face paled slightly and he moved swiftly between the two men. Without using force, he backed the senator and Gordon through the hatch and slammed it behind him. Anger was a knot of green snakes in his belly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want to talk to that pilot,\" McKelvie said belligerently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m sorry, senator. The best psychiatrists on Earth worked eight months to condition Kramer for this flight. He must not be emotionally disturbed. You can\u0027t talk to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You forbid...?\" McKelvie exploded, but Morrow intercepted smoothly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gordon. I\u0027m sure the senator would like a tour of the station. Will you escort him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n McKelvie\u0027s face reddened and Max opened his mouth to object.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gordon!\" Morrow said sharply. Max closed his mouth and guided the grumbling congressman up the tube.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3073/84885.html","bookId":981,"creation":"Aug 5, 2019 1:55:52 AM","modification":"Aug 5, 2019 1:55:52 AM"}
