{"id":101889,"no":17,"title":"Page 17","content":"\u003cp\u003e\"This is downright creepy.\"\u003c/p\u003e\n\u003cp\u003e\"Meh.\" I made a half-hearted shrugging motion to accompany the word, trudging along behind the group of people who chattered in excited whispers, occasional startled gasps punctuating their conversation.\u003c/p\u003e\n\u003cp\u003eSarah stopped to give me a gimlet eye. \"Meh? Meh! This is not in the least bit meh!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re talking to someone who has been to hell itself, and had a chat with the man in charge, not to mention facing down a gauntlet of Hashmallim, which in my humble opinion is a thousand times worse than the aforementioned demon lord. Something so simple as a haunted house holds no fear to the likes of me.\"\u003c/p\u003e\n\u003cp\u003e\"I almost liked you better when you were a pigheaded skeptic,\" she answered, making a face.\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m still a skeptic...about most things I am. There are some I won\u0027t dispute fall well out of the bounds of what can be explained by existing science,\" I answered, obediently stopping when the ghost-hunting group leader waved everyone to a halt. \"I haven\u0027t seen any proof yet that this house is anything other than extremely old and\" - I sniffed the air - \"evidently inhabited by a very large family of rodents. I wish Theo was here.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the third time in an hour you\u0027ve said that - ooh, what was that?\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, that was me,\" one of the men in the group called out, sheepishly answering a cell phone that had made an odd buzzing noise.\u003c/p\u003e\n\u003cp\u003e\"Fine, I\u0027ll take it back. I don\u0027t wish Theo was here - I wish I was with him, instead.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll wait here for the two missing members,\" the group leader announced in a loud whisper. \"They\u0027re just outside the building. I\u0027ll go meet them at the door and escort them here. While we\u0027re waiting, let\u0027s take a few baseline readings of this upper floor. Those of you on the communication team may want to get into your meditative states and see if any entities contact you.\"\u003c/p\u003e\n\u003cp\u003e\"People in a new relationship are always so cloying,\" Sarah said as she sank down gracefully into a lotus position, adopting a peaceful look on her face despite the cold, damp, and rodent-infested ambiance of the three-hundred-year-old mill we were presently occupying. \"You don\u0027t see Anthony and me clinging to each other.\"\u003c/p\u003e\n\u003cp\u003eI plopped down next to her with considerably less elegance. \"You\u0027ve been married sixteen years. I assume by the time Theo and I have been together that long, I won\u0027t mind if he spends the evening off doing mysterious things that he refuses to tell me about except to say that he hopes it will give us some direction regarding the whole Hope situation.\"\u003c/p\u003e\n\u003cp\u003e\"Hush. I\u0027m meditating.\"\u003c/p\u003e\n\u003cp\u003eI hugged my knees as I sat next to a softly humming Sarah, shivering slightly in the cold midnight air. We were on the top floor of one of the oldest standing mills in England, a notoriously haunted mill which had a checkered past that supposedly included several murders, three suicides, and during the 1970s, a rash of Satanic rituals. The interior of the mill wasn\u0027t anything special to look at - for the last hundred years it had alternately been used as office space, apartments, and, finally, storage. Although I didn\u0027t have the paranormal radar that Theo assured me would come with time, I didn\u0027t sense anything in the building that felt remotely different.\u003c/p\u003e\n\u003cp\u003e\"Hey, look,\" I said softly, nudging Sarah with my elbow. The group leader, puffing slightly at all the stairs, emerged from the staircase with the two latecomers in tow. \"It\u0027s Milo from the s¨¦ance.\"\u003c/p\u003e\n\u003cp\u003e\"Mmmhmm. They belong to the group, I believe.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to say hi.\" I got up and went over to the newcomers with a smile. Milo introduced his wife, who gave me a curt nod before exclaiming that she wanted to spend a few minutes communing with the spirits of the mill.\u003c/p\u003e\n\u003cp\u003e\"The wife is a believer,\" Milo said to me in a quiet voice. We moved to the other end the room, perching ourselves on a rickety metal table that lurked in a corner. \"I\u0027ve tried to reason with her, but...\" He shrugged.\u003c/p\u003e\n\u003cp\u003e\"I know how that can be. I\u0027m not saying I can\u0027t accept that there are some things that seem to escape logical explanation...\" That was pretty much a given now that my life had become something outside of logic. \"...but most people don\u0027t even try to look for a reason that things happen. If they see a light in the sky, it must be an alien.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly,\" Milo agreed, watching the group as they sat in a circle for a group meditation. \"Logic, that\u0027s the key to it. You seem like a very logical person.\"\u003c/p\u003e\n\u003cp\u003eI smiled. \"It goes with the territory. I\u0027m a physicist, you see. Logic is more or less my forte.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\" He turned an interested face on me. \"You don\u0027t happen to like puzzles, do you? The brain teasers? I am mad for them, but seldom have anyone to share them with, since the wife doesn\u0027t like that sort of thing.\"\u003c/p\u003e\n\u003cp\u003e\"Logic puzzles, you mean? Car A leaving Los Angeles at thirty miles an hour, and a train leaving Chicago at sixty, that sort of thing?\"\u003c/p\u003e\n\u003cp\u003e\"Well...somewhat. I used to belong to a logic puzzle group in university, but have lost touch with most of the members.\"\u003c/p\u003e\n\u003cp\u003e\"Ah. I\u0027m not much of a puzzler, but those things seem to me to be set up to be easily solved if you just take the proper steps.\"\u003c/p\u003e\n\u003cp\u003e\"That they are.\" He looked thoughtful for a moment, then a smile spread across his face as he nodded toward the group in front of us. \"Would you like to try one out?\"\u003c/p\u003e\n\u003cp\u003e\"A puzzle?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. One to do with this group?\"\u003c/p\u003e\n\u003cp\u003eI looked at the six people in front of us. \"You\u0027re kidding. Logical ghost hunters?\"\u003c/p\u003e\n\u003cp\u003e\"Something like that,\" he said, laughing. \"Look, there are five members there, plus your friend Sarah. That\u0027s the makings of a logic puzzle.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take your word for that.\" I sat back on the table, pleased there was something else to do other than watch ghost hunters communing with spirits. \"I don\u0027t know if I can match someone who used to make puzzles, but I\u0027ll give it a shot.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the ticket! Let\u0027s see...you know their names, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I don\u0027t. I missed the introductions because I was in the restroom when everyone met at the local restaurant.\"\u003c/p\u003e\n\u003cp\u003e\"Perfect. I\u0027ve known these folks for the last eight years, and I can tell you that each of them - this is excepting your friend, of course - live in different towns. Now, let me see, we need a third element, something you can\u0027t tell by looking at them...hmm. Ah, got it. Each one of these teams has members with a different supposed psychic specialty.\"\u003c/p\u003e\n\u003cp\u003eI raised my eyebrows, looking them over again. With my newfound knowledge of things paranormal, I didn\u0027t see any signs in them that they were also \"in the know,\" so to speak. \"OK. So I\u0027m supposed to guess who has what psychic ability?\"\u003c/p\u003e\n\u003cp\u003e\"Supposed psychic ability,\" he said with a wink. \"Name, psychic ability, and town, how\u0027s that sound?\"\u003c/p\u003e\n\u003cp\u003e\"Better than being bored,\" I laughed. \"Let\u0027s do it.\"\u003c/p\u003e\n\u003cp\u003e\"Right, then. The psychometrist and Mr. Brand both like their tea without milk. The telepathist from Newberry and Mrs. Floring, the medium, don\u0027t get along well. The mind reader comes from St. Bartleby.\"\u003c/p\u003e\n\u003cp\u003e\"Wait, wait, wait,\" I said, scrabbling around in my purse. \"I need some paper to write this all down. Telepathist and Floring, medium, don\u0027t get along...St. Bartleby...OK, go on.\"\u003c/p\u003e\n\u003cp\u003e\"Now then, Susannah, Mr. Bitters, Michael, the Ouijist, and the person from Learing-on-Bent all usually arrive together. Mrs. Lee and Timothy are always late. Daniel the channeler and Carol sing in a local choir.\"\u003c/p\u003e\n\u003cp\u003e\"Oh man, this is getting good,\" I said, writing it all down. \"It\u0027s just like a logic class I had eons ago in college.\"\u003c/p\u003e\n\u003cp\u003e\"Daniel Richings doesn\u0027t live in Bartleby. Carol doesn\u0027t live in Leewardstone.\"\u003c/p\u003e\n\u003cp\u003e\"England has the best town names...got it. Any more?\"\u003c/p\u003e\n\u003cp\u003e\"Just one. If you asked Mrs. Lee if she had been with the club longest, she\u0027d say no, that was her friend from Edmonds, with whom she\u0027d grown up in her town of Newberry.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm. OK. Let me see here...\" I eyeballed the info I\u0027d written down, decided it was nothing more than mathematics disguised as words, and assigned each bit of information a numerical value, then began to arrange them in equations that made sense.\u003c/p\u003e\n\u003cp\u003e\"Take as long as you need, although it looks like the meditation is about up,\" Milo said, one eye on the group.\u003c/p\u003e\n\u003cp\u003e\"I almost have it...no, wait, that won\u0027t work...hmm...she can\u0027t be there and there at the same time...aaaaah.\" I looked up with a smile.\u003c/p\u003e\n\u003cp\u003e\"Figured it out, did you?\" Milo asked, a twinkle in his eye.\u003c/p\u003e\n\u003cp\u003e\"I think so. I am cheating a bit in that I can see there are only two women in the group, but even so, it makes sense that since the telepathist is from Newberry, and Mrs. Lee claims the town of Newberry, Mrs. Lee must be the telepath. Since she doesn\u0027t arrive with Susannah, then by the process of elimination, Mrs. Lee\u0027s first name must be Carol, which means that Mrs. Floring, the medium, is Susannah. She can\u0027t come from Newberry, St. Bartleby, or Learing-on-Bent, but could live in Leewardstone or Edmonds.\"\u003c/p\u003e\n\u003cp\u003eMilo smiled. My confidence rose.\u003c/p\u003e\n\u003cp\u003e\"Since Mrs. Lee\u0027s friend is from Edmonds, and Mrs. Lee and Mrs. Floring don\u0027t get along, that means she\u0027s from Leewardstone. Daniel Richings doesn\u0027t live in Bartleby, nor can he live in Newberry or Leewardstone. Thus he has to live in Edmonds or Learing-on-Bent.\"\u003c/p\u003e\n\u003cp\u003e\"What on earth are you doing?\" Sarah frowned at me. \"You\u0027re playing games while we are trying to conduct a very serious scientific investigation?\"\u003c/p\u003e\n\u003cp\u003e\"Just passing a little time,\" I said hastily, shoving my sheet of paper at Milo. \"Are you all done with your humming?\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t just humming, it\u0027s opening ourselves up to...oh, why do I bother? Honestly, Portia, I\u0027d think you could display a little more respect for what we\u0027re doing here, given the fact that you are what you now are,\" she said with a vehement whisper as she pulled me after the assembled group.\u003c/p\u003e\n\u003cp\u003eI tossed Milo an apologetic smile. He read over my paper, and gave me a thumbs-up, which I interpreted to mean I\u0027d figured out the rest of the puzzle correctly. \"Milo and I were just amusing ourselves while you guys were opening up and such. He\u0027s some sort of puzzle enthusiast. Did you know that his wife and the other woman don\u0027t get along?\"\u003c/p\u003e\n\u003cp\u003eSarah rolled her eyes and grabbed my wrist, hauling me along after the group. \"Come on, we have a room to investigate. Mr. Richings says he has recorded a temperature drop of eight degrees there on three separate occasions.\"\u003c/p\u003e\n\u003cp\u003e\"Probably just a draft,\" I muttered, but kept my voice low. I had promised Sarah I\u0027d spend the evening with her temporary ghost hunting group in exchange for her help finding out what happened to Hope, and despite my wishes to be elsewhere at that moment - Theo\u0027s arms came to mind as a good alternative - I\u0027d do what I could to see to it that Sarah had an enjoyable evening.\u003c/p\u003e\n\u003cp\u003eWhy do I sense a profound feeling of martyrdom from you?\u003c/p\u003e\n\u003cp\u003eI smiled at the voice in my head. I\u0027m feeling particularly saintly tonight.\u003c/p\u003e\n\u003cp\u003eIs it that bad?\u003c/p\u003e\n\u003cp\u003eNothing I didn\u0027t expect. A bunch of people running around with equipment measuring drafts and electromagnetic flux, and jumping at every creak and pop.\u003c/p\u003e\n\u003cp\u003eIt\u0027s only for a few hours. I\u0027m sure you will triumph over such exacting circumstances.\u003c/p\u003e\n\u003cp\u003eIndeed. Why are you talking to me, not that I\u0027m complaining? I thought you didn\u0027t want me bothering you?\u003c/p\u003e\n\u003cp\u003eSweetling, you never bother me. You do, however, distract me from matters at hand. It\u0027s your breasts. And thighs. And lips, and legs, and all the other bits in between. Theo\u0027s words were accompanied by such erotic mental images that I found myself getting aroused right there in the middle of a cold, mouse-riddled mill.\u003c/p\u003e\n\u003cp\u003eIf you don\u0027t want me running out of here, hunting you down, and wrestling you to the ground to have my way with you, you\u0027d better stop sending me those sorts of thoughts.\u003c/p\u003e\n\u003cp\u003eWould you really wrestle me to the ground? he asked, sounding intrigued.\u003c/p\u003e\n\u003cp\u003eAbsolutely. How goes the info-hunting?\u003c/p\u003e\n\u003cp\u003eHe sighed. Not so good. The nephilim I contacted knew nothing.\u003c/p\u003e\n\u003cp\u003eCrap. So we don\u0027t have any leads?\u003c/p\u003e\n\u003cp\u003eNo, we have one. My nephilim friend mentioned a vessel who evidently was very tight with Hope. But I can\u0027t find the man - he seems to have run to earth just like Hope.\u003c/p\u003e\n\u003cp\u003eA vessel is a person?\u003c/p\u003e\n\u003cp\u003eIn this instance, yes. Vessels serve mortals, under the direct rule of the principalities, who in turn take their orders from powers, and the powers, as you know, are directly beneath the mare.\u003c/p\u003e\n\u003cp\u003eSounds very much like the little old woman who swallowed a fly.\u003c/p\u003e\n\u003cp\u003ePardon?\u003c/p\u003e\n\u003cp\u003eNothing, just a joke, and not a very good one. So what now?\u003c/p\u003e\n\u003cp\u003eI\u0027m going to continue to try to locate the missing vessel. I\u0027ll meet you at the pub after your ghostly group is finished, all right?\u003c/p\u003e\n\u003cp\u003eI suppose so, although I\u0027d be happy to help you -\u003c/p\u003e\n\u003cp\u003eSarah would be hurt.\u003c/p\u003e\n\u003cp\u003e\"Portia?\"\u003c/p\u003e\n\u003cp\u003eIt was my turn to sigh. You\u0027re right. Saint Portia it is for the night, then.\u003c/p\u003e\n\u003cp\u003eHis laughter was warm and made me smile despite my cold, uncomfortable surroundings. You\u0027re no saint, sweetling. But we can discuss that later tonight.\u003c/p\u003e\n\u003cp\u003eYou\u0027re on. Take care of yourself, all right?\u003c/p\u003e\n\u003cp\u003e\"Portia!\" Sarah shook me, her face suspicious. \"You look all moony-eyed again. You must be talking to Theo. Did he find Hope?\"\u003c/p\u003e\n\u003cp\u003e\"Not yet, no. He\u0027s trying to find some Court member who supposedly is friends with her.\"\u003c/p\u003e\n\u003cp\u003e\"Ah. Smart man.\" She flashed me a smile, waggling her eyebrows. \"In more ways than one, eh?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely. So what\u0027s up with the cold spots?\"\u003c/p\u003e\n\u003cp\u003eHer face lit up. \"Oh, it\u0027s so exciting! Mr. Richings has measured a drop of eleven degrees in the corner! Come see it!\"\u003c/p\u003e\n\u003cp\u003eI admired the cold spot, keeping the thought to myself that the lack of insulation and patchy repairs in the wall were more likely to contribute to the chilly air than an unseen ghostly presence. While the group excitedly took more measurements and made furious notes, I sidled over to Milo.\u003c/p\u003e\n\u003cp\u003e\"So, is your name Lee or Floring?\"\u003c/p\u003e\n\u003cp\u003eHe smiled, holding out his hand. \"I don\u0027t think we ever were properly introduced, were we? It\u0027s Lee, Milo Lee. And Carol, my wife, is over there, but you\u0027ve already deduced that. It must be all that work in physics that gives you an analytical mind, eh?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I don\u0027t know, I think people tend to be born left-or right-brained. You\u0027re pretty left-brained yourself. What do you do? As an occupation, that is.\"\u003c/p\u003e\n\u003cp\u003e\"Customer service for a large corporation. I live to serve,\" he said, with a hint of an eye roll and a mock bow.\u003c/p\u003e\n\u003cp\u003e\"Ah. That must be challenging. I don\u0027t think I could deal with unhappy people for long.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s horrible. I\u0027ve hopes to advance very soon, though, so it\u0027s an evil I\u0027ll bear a bit longer.\"\u003c/p\u003e\n\u003cp\u003e\"Good for you. So how long did you say you and your wife have been ghost hunting?\"\u003c/p\u003e\n\u003cp\u003eWe passed the next hour chatting about minutiae, both of us watching with indulgent eyes as the ghost group moved from room to room. By the end of the second hour, with nothing to show for their work but some numbers written down from instrument readings, even Sarah\u0027s enthusiasm was beginning to drag. We drove back to the pub in relative silence - her in contemplation of the meager proceedings of the evening, and me in anticipation of seeing Theo again.\u003c/p\u003e\n\u003cp\u003eI went to bed alone, my errant vampire-cum-nephilim still out on his vessel hunt. When I found he wasn\u0027t back at the pub, I offered to help him hunt for the Court member, but Theo insisted he was almost done. Even separated by some thirty miles or so, he seemed to sense the exhaustion that was making it hard for me to think. I didn\u0027t argue when he ordered me to bed, just sent him an image of what I intended to do to him when he made his way back to me.\u003c/p\u003e\n\u003cp\u003eMy dreams were confused, but much more vivid than I remembered in the past. I woke frequently at little noises in the pub, but, sadly, remained alone. I slipped into a nightmare where giant wasps stung me repeatedly. Slowly it melted into something much more pleasant, the stings of the wasps morphing into little fluttering brushes of wings as the wasps changed into brilliant blue hummingbirds. I writhed with pleasure on the ground, naked, warmed by the sun that shown down with such intensity that I could feel its heat deep inside me, in dark, hidden places that only came to life when Theo was around. The soft, gentle touches of the birds\u0027 wings didn\u0027t soothe me, however - they made me squirm even harder, leaving me wanting to both escape their oddly erotic touches and pull them tighter to me. One of the birds landed on my belly, giving me a long look with its dark eyes before dipping its head and stabbing at my hip with a long, sharp beak.\u003c/p\u003e\n\u003cp\u003e\"Sweet mother of reason,\" I gasped, suddenly awake. Theo\u0027s head was bent over my hip, his dark curls brushing against my skin as the pain of his teeth piercing my skin was already melting into something so pleasurable I never wanted him to stop. His fingers fluttered for a moment against aroused, sensitive flesh, then plunged inside me in a move that had me arching back into the bed, my hips rising to meet the movement of his fingers.\u003c/p\u003e\n\u003cp\u003eSalus invenitur, Theo moaned into my mind as he drank deep from me. You taste sweeter than nectar, Portia. How can something so wonderful hurt so bad at the same time?\u003c/p\u003e\n\u003cp\u003eMy body tightened around his fingers, blinding me to everything but the need I felt within him, and the answer that lay within me.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too much,\" he said, lifting his head from my hip. His eyes were black as polished ebony, his face hard with hunger and passion and want.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said, feeling as if my guts had been strung tight. I pushed him onto his back, and climbed over him. \"But this may be.\"\u003c/p\u003e\n\u003cp\u003eHe tasted as I knew he would - hot, male, and incredibly wonderful, the firm flesh of his penis both silky soft and as hard as steel. He moaned aloud, his head thrown back against the mattress, both hands clutching the sheets beneath us as I took my time exploring him, reading his mind with ease, noting what drove him into a frenzy.\u003c/p\u003e\n\u003cp\u003eHis rising passion and arousal fed mine. The knee I was straddling while I pleasured him jerked beneath me, pressing tight into my own sensitive flesh. The bolt of ecstasy that ripped through me as a result took me by surprise, but not as much as Theo suddenly grabbing my hips and hauling me up his body, thrusting upward into me as he pressed me down. Existence ceased to be, my world, the entire universe, narrowing to the man beneath me who urged me, with little cries of pleasure, to ride him faster.\u003c/p\u003e\n\u003cp\u003eHow did I exist this long without you? Theo asked as his mouth closed over my breast, his teeth sinking deep into my soft flesh at the same time he exploded into a tremendous orgasm, the strength of it pushing me over into my own. His body pulsed and pumped into me while I quite simply ceased to be me, the Portia I\u0027d known for thirty-eight years, and became instead the Portia who was part of Theo. I\u0027d never believed that a woman needed a man to be complete, but this was different. This wasn\u0027t a matter of social mores or gender issues, or even the biological need for a mate. I knew to the depths of my soul that Theo enriched me in ways that no other human could, and that knowledge shook me.\u003c/p\u003e\n\u003cp\u003eIt\u0027s strange, isn\u0027t it? Theo\u0027s hands stroked gently up my back as I lay on his chest, my heart thumping wildly in my chest, my breath ragged and jerky against his shoulder. One minute we\u0027re going about our business in life, and the next our beings are so tightly intertwined with someone else\u0027s, there\u0027s no way to separate them again.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want them separated, I said without thinking, then realized that what I said sounded weak and cloying.\u003c/p\u003e\n\u003cp\u003eHis hands stilled for a moment. I could never think you weak, love. You are the strongest woman I know.\u003c/p\u003e\n\u003cp\u003eI lifted my head to look into his eyes, half fearing there would be pity or something just as painful in them, but to my relief they were filled only with satiation and an unabashed love that made me want to sing with happiness. I\u0027d say I was sorry this happened, but I\u0027m not sorry. I regret that your soul has been lost through my ignorance, but even that can\u0027t dampen the joy you bring me.\u003c/p\u003e\n\u003cp\u003eSilly woman. He pulled me back down onto his chest, his body still buried deep inside me. His lips were sweet against mine, his words sweeter still as they brushed gently against my mind. What\u0027s a soul compared to this? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-last-of-the-red-hot-vampires-dark-ones-5/page-17.html","bookId":2206,"creation":"Oct 5, 2019 10:08:58 PM","modification":"Oct 5, 2019 10:08:58 PM"}
