{"id":103348,"no":10,"title":"Page 10","content":"\u003cp\u003eI turned toward Sarah’s voice. A woman stood next to her. She was handsome in the way a well-cared-for antique was handsome. I guessed that she had probably been carded well into her forties.\u003c/p\u003e\n\u003cp\u003e“Mr. McKenzie,” Sarah repeated. “Mrs. Rogers.”\u003c/p\u003e\n\u003cp\u003eI offered the older woman my hand. She refused to take it.\u003c/p\u003e\n\u003cp\u003e“Are you my birthday present?” she asked.\u003c/p\u003e\n\u003cp\u003e“Your what?”\u003c/p\u003e\n\u003cp\u003eMrs. Rogers looked me up and down as if she wanted to redress me in something closer to her taste.\u003c/p\u003e\n\u003cp\u003e“My birthday is tomorrow,” she said. “My friends always chip in to give me a gift.” She circled me as she spoke. “Nice ass.”\u003c/p\u003e\n\u003cp\u003eSarah’s hand flew to her mouth, and she turned her head as she tried to suppress a laugh. “I need to get back to the desk,” she said behind her hand and rushed away.\u003c/p\u003e\n\u003cp\u003e“I like that you’re thin,” Mrs. Rogers said.\u003c/p\u003e\n\u003cp\u003e“I didn’t know that I was.”\u003c/p\u003e\n\u003cp\u003e“Look around. We’ve become a nation of fat people. I, on the other hand, am not fat.”\u003c/p\u003e\n\u003cp\u003e“No, ma’am, you are not.”\u003c/p\u003e\n\u003cp\u003e“I have the same figure that I had my senior year in high school.”\u003c/p\u003e\n\u003cp\u003e“I can see that.”\u003c/p\u003e\n\u003cp\u003eMrs. Rogers stopped in front of me. “Yes, you’ll do fine. Although…” She consulted a wristwatch that sparkled with diamonds. “It’d be better if you came back later when I have more time.”\u003c/p\u003e\n\u003cp\u003e“I’d be happy to,” I said. “Except I’m not your birthday gift.”\u003c/p\u003e\n\u003cp\u003e“You’re not?”\u003c/p\u003e\n\u003cp\u003e“No, ma’am.”\u003c/p\u003e\n\u003cp\u003e“What that silly girl said about wanting to talk about my property, that’s true?”\u003c/p\u003e\n\u003cp\u003e“’Fraid so.”\u003c/p\u003e\n\u003cp\u003eShe swung her fist up over her head and down again like a desperate gambler who just lost his last dollar by a nose.\u003c/p\u003e\n\u003cp\u003e“Dammit,” she said.\u003c/p\u003e\n\u003cp\u003e“You’re putting me on, aren’t you, Mrs. Rogers?”\u003c/p\u003e\n\u003cp\u003e“I can’t imagine what gave you that idea. Do you drink, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do.”\u003c/p\u003e\n\u003cp\u003e“Come with me.”\u003c/p\u003e\n\u003cp\u003eMrs. Rogers walked briskly into the interior of the club, down a corridor, through a well-appointed card room, and into the bar. I followed like a small child afraid of being left behind.\u003c/p\u003e\n\u003cp\u003e“Steven,” she called to the bartender.\u003c/p\u003e\n\u003cp\u003e“Mrs. R,” he called back.\u003c/p\u003e\n\u003cp\u003eShe replied by holding up two fingers and then slipped through a glass door onto a sprawling terrace with a stunning view of Lake Minnetonka. She moved to the railing and turned, competing with the view.\u003c/p\u003e\n\u003cp\u003e“I have a slip of a girl taking care of my properties for me,” Mrs. Rogers said.\u003c/p\u003e\n\u003cp\u003e“Anne Rehmann,” I said. “Hardly a slip of a girl.”\u003c/p\u003e\n\u003cp\u003e“Anyone half my age is a slip of a girl. She should exercise more, though, Annie should. Keep those perky breasts of hers from sagging.” I didn’t have anything to say to that. “Do I shock you, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Not particularly.”\u003c/p\u003e\n\u003cp\u003eMrs. Rogers swung her hand up and down again. “Dammit, I was trying so hard.”\u003c/p\u003e\n\u003cp\u003eI decided then and there that I liked her. She possessed a natural aggressiveness that I found engaging, although I didn’t tell her that.\u003c/p\u003e\n\u003cp\u003eSteven arrived carrying a tray with two martinis on top. He set the drinks on a small table near the railing. I held a chair for Mrs. Rogers. She nodded her head at me and sat.\u003c/p\u003e\n\u003cp\u003e“Old World manners,” she said. “Don’t see that anymore.”\u003c/p\u003e\n\u003cp\u003eI took the chair across from her. She drank half of her martini in one gulp. I took just a sip. The alcohol sent a charge of electricity through me that curled my toes.\u003c/p\u003e\n\u003cp\u003e“Ho, ho, ho,” I chanted.\u003c/p\u003e\n\u003cp\u003e“Gin martini,” Mrs. Rogers said. “Picked up the recipe in London. I used to fly the New York to London to Paris route for Pan Am. That was when we were called stewardesses instead of flight attendants.”\u003c/p\u003e\n\u003cp\u003e“Sarah at the desk told me you were a dealer in Reno.”\u003c/p\u003e\n\u003cp\u003e“Did that, too. And some acting, mostly bit parts. I lied about my age and got a job working for MGM when I was a kid. Danced in a Gene Kelly movie once, although you can hardly see me I’m so far in the back. Worked for an advertising agency. Have you ever seen the TV series Mad Men? It was very much like that. I was what Frank Sinatra used to call a broad, which might have been less respectable than a lady but a whole helluva lot better than a bitch. Do you gamble, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Occasionally. Not often.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“I don’t like to lose.”\u003c/p\u003e\n\u003cp\u003e“Most people love to lose. Rich, poor, it makes no difference. Even when they win, people keep playing until they go bust. Look around. More people are gambling today than in the entire history of the world, and sooner or later they always lose.”\u003c/p\u003e\n\u003cp\u003e“What about you?”\u003c/p\u003e\n\u003cp\u003e“Oh, I never lose.”\u003c/p\u003e\n\u003cp\u003e“How is that possible?”\u003c/p\u003e\n\u003cp\u003e“I cheat. Just this morning I made eleven twenty-eight.”\u003c/p\u003e\n\u003cp\u003e“Eleven hundred and twenty-eight dollars?”\u003c/p\u003e\n\u003cp\u003e“Eleven dollars and twenty-eight cents. What do you take me for?”\u003c/p\u003e\n\u003cp\u003eA woman, I thought, who somehow managed the most wonderful trick of growing old without ever growing up. But again, I didn’t say it.\u003c/p\u003e\n\u003cp\u003eMrs. Rogers took another pull of her martini. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-10.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
