{"id":103357,"no":19,"title":"Page 19","content":"\u003cp\u003e“You didn’t pay Mary Pat Mulally a visit earlier, did you?” I asked. “You or one of your operatives?”\u003c/p\u003e\n\u003cp\u003eHe shrugged again as if he were deliberately keeping secrets from me and didn’t care if I knew it, although … When I first started out with the cops I actually believed that I could look into the eyes of a suspect—any suspect—while he answered my questions and tell if he was lying; that my gut instinct would take over and I would know the truth beyond a doubt. I soon learned different. Some people I can read, of course. Anyone can. Others are such gifted and experienced liars that even a polygraph can’t find them out—which is why the test results are still inadmissible in a court of law. Yet I kept doing it; kept looking for the truth in their faces. Staring at Schroeder, I was able to detect a flinch, a tiny one, at the corners of his smile—if I hadn’t been watching so intently, I would have missed it. Yet it told me that he had no idea what I was talking about and not knowing alarmed him as much as it did me.\u003c/p\u003e\n\u003cp\u003e“Why are you here, Greg?” I asked.\u003c/p\u003e\n\u003cp\u003e“Boss wants to chat with you,” he said.\u003c/p\u003e\n\u003cp\u003e“Mr. Muehlenhaus?”\u003c/p\u003e\n\u003cp\u003e“Not this time.”\u003c/p\u003e\n\u003cp\u003eMargaret Muehlenhaus floated on long dancer’s legs and dancer’s feet down the steps of the portico of her splendid house and across the front lawn. Sunlight reflected off the threads of her burgundy sundress and the lenses of the reading glasses that she wore on a silver chain around her neck. Her eyes were brown and flashed without help from the sun. The few streaks of gray in her otherwise chocolate hair were artfully arranged.\u003c/p\u003e\n\u003cp\u003e“Welcome to the Pointe,” she said. After introducing herself she looked me over as if I might possibly be a salesman hawking encyclopedias door to door. Did people still do that? Probably not, but she was old enough to remember when they did.\u003c/p\u003e\n\u003cp\u003e“You are McKenzie, correct?” she said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Funny, you don’t look like a syphilitic sonuvabitch.”\u003c/p\u003e\n\u003cp\u003e“How is Mr. Muehlenhaus these days?” I asked.\u003c/p\u003e\n\u003cp\u003e“He doesn’t want you setting foot inside his house.”\u003c/p\u003e\n\u003cp\u003e“So, he’s the same, then?”\u003c/p\u003e\n\u003cp\u003eShe laughed at the question. “Come inside. I have fresh strawberry lemonade.”\u003c/p\u003e\n\u003cp\u003e“Your husband said…”\u003c/p\u003e\n\u003cp\u003e“Oh, pooh.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus hooked her arm around mine and led me across the lawn, up the steps, and past the gleaming white columns that held up the porch. It was then that I realized this was the house that Juan Carlos Navarre had been watching through his telescope.\u003c/p\u003e\n\u003cp\u003eOnce inside she shouted, “Agnes.” A moment passed and she added, “Aggie.”\u003c/p\u003e\n\u003cp\u003e“Ma’am,” a voice called from another part of the house.\u003c/p\u003e\n\u003cp\u003e“We’ll be in my room.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus continued to hold on to my arm as she maneuvered me through the mansion. Despite her age, she carried herself with the erect authority of someone that had been both powerful and handsome and still remembered how it felt.\u003c/p\u003e\n\u003cp\u003e“The house has twenty-three rooms,” she told me. “I haven’t set foot in some of them for years. This room…” She paused in front of a large mahogany door, smiled more to herself than me, turned the knob, and pushed it open. “This is where I spend most of my time.”\u003c/p\u003e\n\u003cp\u003eI stepped inside. Dozens of books had overflowed from the many bookshelves onto the furniture and floor. The walls not supporting bookshelves were filled with original paintings that seemed to have nothing in common except that the owner liked them. There were sweaters tossed here and there, and a white silk blouse that looked like it had been discarded quickly and then forgotten at the foot of a CD player. A cabinet next to it was filled with CDs ranging from Frank Sinatra, Tony Bennett, and Sarah Vaughan to U2, Rufus Wainwright, and Loreena McKennitt. Other CDs were stacked on the floor. There was also a 56-inch HDTV, a DVD player, and hundreds of movies, some of them in neat, alphabetical piles and some scattered haphazardly. Mrs. Muehlenhaus seemed particularly fond of Barbara Stanwyck.\u003c/p\u003e\n\u003cp\u003eI liked the room very much. It reminded me of my place on Hoyt. All it needed was a couple of hockey sticks and an equipment bag in the corner near the door. I turned to look and found a golf bag instead.\u003c/p\u003e\n\u003cp\u003e“In my world appearances carry great weight,” she said. “I promise you, McKenzie, I am quite adept at playing the perfect wife of the powerful man. It is a role I both relish and enjoy. However, when I am not onstage, I prefer to retreat to this room. It’s my secret lair. My girl cave. No one is allowed inside without my permission.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus sat on the leather sofa while I sat in a matching chair across from her.\u003c/p\u003e\n\u003cp\u003e“The staff is forbidden to clean in here.” She reached down, picked a dirty dinner plate off the floor, and set it on the table in front of the sofa. “In case you’re wondering.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-19.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
