{"id":103358,"no":20,"title":"Page 20","content":"\u003cp\u003eThere was a knock on the door. Mrs. Muehlenhaus said, “Enter,” and a maid walked in carrying a silver tray with a crystal pitcher and two crystal goblets. She set the tray on the table and picked up the dirty plate. Her eyes cast about as if she expected to find others.\u003c/p\u003e\n\u003cp\u003e“Shoo shoo, shoo shoo,” Mrs. Muehlenhaus said.\u003c/p\u003e\n\u003cp\u003eThe maid left reluctantly. Her head swiveled back and forth as she made her way to the door until she found a dirty cup and saucer sitting on one of the bookshelves, dashed over to grab it, and hurried from the room before Mrs. Muehlenhaus could stop her.\u003c/p\u003e\n\u003cp\u003e“It’s tough getting good help these days,” I said.\u003c/p\u003e\n\u003cp\u003e“Tell me about it.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus poured the strawberry lemonade into the crystal goblets and handed one to me. It was delicious.\u003c/p\u003e\n\u003cp\u003e“I’d offer you something a little more robust,” she said. “Only we don’t know each other well enough to get sloshed in the middle of the afternoon.”\u003c/p\u003e\n\u003cp\u003e“Here’s looking at you, kid,” I said before taking another sip.\u003c/p\u003e\n\u003cp\u003e“Casablanca. Good for you. My very first date with a boy—I was thirteen—we went to see Casablanca. I wept at the end, and the boy laughed at me. I have not seen him since.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus waved at her piles of DVDs.\u003c/p\u003e\n\u003cp\u003e“I have a copy around here somewhere,” she said. “Do you know that Riley has never seen Casablanca? I spoke to some of her friends when she was in college. They hadn’t seen it, either. They didn’t know who Ingrid Bergman was. Or Vivien Leigh. Or even Kate Hepburn. One of Riley’s classmates told me she refused to watch black-and-white movies. How terribly sad.\u003c/p\u003e\n\u003cp\u003e“On the other hand, Riley reads an enormous amount. When she was younger, she’d sneak in here and sit for days at a time reading one book after another. She is a much more serious young woman than she pretends.”\u003c/p\u003e\n\u003cp\u003eIt’s not possible for her to be more serious than she pretends, my inner voice said.\u003c/p\u003e\n\u003cp\u003e“Mrs. Muehlenhaus, why am I here?” I asked aloud.\u003c/p\u003e\n\u003cp\u003e“I want us to be friends.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“And because our mutual friend Greg Schroeder tells me that you’re searching for Juan Carlos Navarre at the behest of my granddaughter.”\u003c/p\u003e\n\u003cp\u003e“Mrs. Muehlenhaus, I am shocked by the company you keep.”\u003c/p\u003e\n\u003cp\u003e“I like Mr. Schroeder. He reminds me of Dick Powell in Murder, My Sweet. Have you seen it?”\u003c/p\u003e\n\u003cp\u003e“I have,” I said. I didn’t see the resemblance between Schroeder and the actor, though, a thought I kept to myself.\u003c/p\u003e\n\u003cp\u003e“Do you know what Walter calls him? The dependable Mr. Schroeder.”\u003c/p\u003e\n\u003cp\u003e“Ahh,” I hummed.\u003c/p\u003e\n\u003cp\u003e“Do you know what he calls you?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus laughed as if it were all a great joke.\u003c/p\u003e\n\u003cp\u003e“I have taken a fancy to you, McKenzie,” she said.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“Don’t thank me. It’s not necessarily a compliment. I have appalling taste in men. Take my husband, please.”\u003c/p\u003e\n\u003cp\u003eThe way she spoke and laughed, I swear she was flirting with me just as Irene Rogers had.\u003c/p\u003e\n\u003cp\u003eIt seems you have a knack with little old ladies, my inner voice told me. I only hope you still have it when you’re a little old man.\u003c/p\u003e\n\u003cp\u003eWhen she finished laughing, Mrs. Muehlenhaus took a sip of her lemonade, smiled brightly, and asked, “McKenzie, why are you looking for Mr. Navarre?”\u003c/p\u003e\n\u003cp\u003e“Why are you?”\u003c/p\u003e\n\u003cp\u003e“You’re not married…”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Although you and the lovely Ms. Truhler seem to be enjoying a long and extremely stable relationship.”\u003c/p\u003e\n\u003cp\u003e“It bothers me, Mrs. Muehlenhaus, that you seem to know so much about my personal life. Scares me a little, too.”\u003c/p\u003e\n\u003cp\u003eShe reached across the table and patted my knee as if she expected me to think nothing of it and kept talking.\u003c/p\u003e\n\u003cp\u003e“Ms. Truhler has an equally lovely and extremely intelligent daughter to whom you have become quite attached. Rickie is her name.”\u003c/p\u003e\n\u003cp\u003e“She prefers Erica,” I said.\u003c/p\u003e\n\u003cp\u003e“What would you do, McKenzie, if you discovered that Erica was involved with a dangerous criminal? Would you intervene?”\u003c/p\u003e\n\u003cp\u003e“Is Navarre a dangerous criminal?”\u003c/p\u003e\n\u003cp\u003e“You didn’t answer my question.”\u003c/p\u003e\n\u003cp\u003e“You didn’t answer mine.”\u003c/p\u003e\n\u003cp\u003eSomewhere behind the closed mahogany door a voice boomed. “Margaret. Margaret, where are you?”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus smiled.\u003c/p\u003e\n\u003cp\u003e“He only calls me that when he’s upset,” she said.\u003c/p\u003e\n\u003cp\u003eThe door flew open and Mr. Muehlenhaus stepped inside. He was a fairly tall man, and from the way he moved it was clear that he had no intention of ever surrendering to age.\u003c/p\u003e\n\u003cp\u003e“Dammit, Margaret. What did I tell you?”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus’s eyes grew wide, her jaw clenched, and she gestured with her head at the door. Swear to God, I thought I heard her growl.\u003c/p\u003e\n\u003cp\u003e“Oh, all right,” Mr. Muehlenhaus said.\u003c/p\u003e\n\u003cp\u003eHe spun around and left the room, closing the door behind him. A moment later, he knocked gently.\u003c/p\u003e\n\u003cp\u003e“Come in,” Mrs. Muehlenhaus called.\u003c/p\u003e\n\u003cp\u003eMr. Muehlenhaus reentered the room, moving quickly. He stepped in front of his wife yet pointed at me.\u003c/p\u003e\n\u003cp\u003e“Maggie, I left specific instructions,” he told her.\u003c/p\u003e\n\u003cp\u003e“Yes, you did, dear.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus patted the empty cushion next to her, and Mr. Muehlenhaus sat. That was the end of the argument.\u003c/p\u003e\n\u003cp\u003e“Would you like some strawberry lemonade?” Mrs. Muehlenhaus asked.\u003c/p\u003e\n\u003cp\u003e“Actually, I would prefer some of your Scotch.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-20.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
