{"id":103359,"no":21,"title":"Page 21","content":"\u003cp\u003e“You know where it is.”\u003c/p\u003e\n\u003cp\u003eI watched Muehlenhaus rise from the sofa and move to one of the bookcases where a massive three-volume set of Shelby Foote’s The Civil War: A Narrative was shelved. He pulled the books off the shelf, reached in, produced a bottle of Macallan thirty-year Highland single malt Scotch whisky, and returned the books.\u003c/p\u003e\n\u003cp\u003e“How ’bout you, McKenzie?” Mrs. Muehlenhaus asked. “Care for something a bit stronger?”\u003c/p\u003e\n\u003cp\u003e“No, I’m good,” I said.\u003c/p\u003e\n\u003cp\u003e“You don’t mind if I imbibe?”\u003c/p\u003e\n\u003cp\u003e“Not at all.”\u003c/p\u003e\n\u003cp\u003eMuehlenhaus returned to the sofa. Somewhere he found an extra glass. He blew the dust out of it and poured a generous amount of liquor. He then poured an inch into Mrs. Muehlenhaus’s now empty crystal goblet.\u003c/p\u003e\n\u003cp\u003e“I don’t know why you hide this,” he told her. “It’s not even the good stuff.”\u003c/p\u003e\n\u003cp\u003e“I’m eccentric. All I need is cats.”\u003c/p\u003e\n\u003cp\u003e“You’re allergic to cat hair.”\u003c/p\u003e\n\u003cp\u003e“So I’m saved from the stereotype. Lucky me.”\u003c/p\u003e\n\u003cp\u003eThe crystal made a beautiful ringing sound when her goblet clinked against Muehlenhaus’s glass. They drank while looking into each other’s eyes, and I thought, They are genuinely in love. At their age and after all their years of marriage. For some reason, it made me less afraid of them.\u003c/p\u003e\n\u003cp\u003e“So, kids,” I said. “Why exactly am I here, again?”\u003c/p\u003e\n\u003cp\u003e“Kids?” Muehlenhaus said. “Do I look like a child to you?”\u003c/p\u003e\n\u003cp\u003e“Here we go,” Mrs. Muehlenhaus said softly before taking another sip of Scotch.\u003c/p\u003e\n\u003cp\u003e“Mr. Muehlenhaus, there are so many reasons for you to be pissed at me,” I said. “A turn of a phrase, that’s what’s going to set you off?”\u003c/p\u003e\n\u003cp\u003e“Do you want me to tell you who you remind me of, McKenzie? I’ll tell you. You remind me of those goddamned French bastards that guillotined Louis and Marie Antoinette yet couldn’t be bothered to burn down Versailles, that didn’t so much as torch a single brick of the place.”\u003c/p\u003e\n\u003cp\u003e“I’m a true Republican.”\u003c/p\u003e\n\u003cp\u003e“No, that was a Democrat thing to do.”\u003c/p\u003e\n\u003cp\u003e“Now you’re just calling names.”\u003c/p\u003e\n\u003cp\u003e“You resent people who are wealthy and who are in charge, yet you want to be wealthy and in charge yourself.”\u003c/p\u003e\n\u003cp\u003e“I am wealthy.”\u003c/p\u003e\n\u003cp\u003e“What have you done with your money? Tell me?”\u003c/p\u003e\n\u003cp\u003e“A couple days ago I bought a TV remote that looks like Dr. Who’s sonic screwdriver. Does that count?”\u003c/p\u003e\n\u003cp\u003e“That’ll make the world a better place, I’m sure.”\u003c/p\u003e\n\u003cp\u003e“You know, dear,” Mrs. Muehlenhaus said, “this is why I wanted to talk to McKenzie alone.”\u003c/p\u003e\n\u003cp\u003e“It’s not my fault,” Muehlenhaus replied. “You can’t have a civil conversation with fucking McKenzie.”\u003c/p\u003e\n\u003cp\u003e“I heard that’s what you call me,” I said. “Do you want to know what I call you?”\u003c/p\u003e\n\u003cp\u003e“Oh, by all means, tell me.”\u003c/p\u003e\n\u003cp\u003e“Mr. Muehlenhaus.”\u003c/p\u003e\n\u003cp\u003e“Yes, well, that’s what you should call me. I’m pretty sure I earned it.”\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure I’ve earned whatever you call me, too. That doesn’t answer my question, though. Why am I here?”\u003c/p\u003e\n\u003cp\u003e“Riley.” Mrs. Muehlenhaus caught her husband’s eyes and held them. “You remember Riley, your granddaughter?”\u003c/p\u003e\n\u003cp\u003e“Yes. Of course. Please forgive my outburst,” Muehlenhaus said, although he clearly didn’t care if he was forgiven or not.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” Mrs. Muehlenhaus said, “we are concerned about Riley. We believe she is involved with the wrong people.”\u003c/p\u003e\n\u003cp\u003e“Define wrong people,” I said.\u003c/p\u003e\n\u003cp\u003e“Do we need to spell it out?” Muehlenhaus said.\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus glared at her husband some more.\u003c/p\u003e\n\u003cp\u003e“McKenzie,” she said. “I do not concern myself with whether or not Juan Carlos is rich or poor. I don’t care if he’s Hispanic or white. I don’t care if he’s a Democrat or Republican, a member of the Tea Party or supports the ACLU—I really don’t.”\u003c/p\u003e\n\u003cp\u003e“Neither do I,” Muehlenhaus said, but I didn’t believe him.\u003c/p\u003e\n\u003cp\u003e“What I do care about is that we are unable to learn anything about the boy.”\u003c/p\u003e\n\u003cp\u003e“He claims to be the son of wealthy parents,” Muehlenhaus added. “Only his parents died seven years ago and he has no other family. Don’t you think that’s a little convenient?”\u003c/p\u003e\n\u003cp\u003eI was surprised at how suddenly the anger formed in the pit of my stomach and shot up to my throat. Some other time and place I might have given it voice—being an orphan is no reason to denounce someone. But the Muehlenhauses weren’t people you went off on, especially in their own home, so I fought it down and spoke as carefully as possible.\u003c/p\u003e\n\u003cp\u003e“Both my parents are dead, and no, I don’t find it the least bit convenient.”\u003c/p\u003e\n\u003cp\u003e“Yes, well,” Muehlenhaus said.\u003c/p\u003e\n\u003cp\u003e“Despite what you think of us—or at least what my husband believes you think of us—we are concerned only with the child’s welfare,” Mrs. Muehlenhaus said. “My family has been hurt by deceivers before. My daughter, Sheila…”\u003c/p\u003e\n\u003cp\u003eMrs. Muehlenhaus didn’t finish the sentence. Her husband reached for her hand and gave it a squeeze. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-21.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
