{"id":103362,"no":24,"title":"Page 24","content":"\u003cp\u003e“I was a great baseball player.”\u003c/p\u003e\n\u003cp\u003eBobby stared straight ahead without answering until the half inning ended. He said, “No, you really weren’t,” so softly I barely heard him and then added, “Let me make a few calls,” in a louder voice.\u003c/p\u003e\n\u003cp\u003eWhich was exactly what I wanted to hear.\u003c/p\u003e\n\u003cp\u003eA short time later I left him and went upstairs. Shelby was sitting in her living room and reading a historical romance novel written by someone named Julie Klassen. The light from the floor lamp made her wheat-colored hair glow and her green eyes sparkle. I watched her for a couple of beats and not for the first time asked myself, What if I had been the one who spilled the drink on her dress way back in college instead of Bobby?\u003c/p\u003e\n\u003cp\u003eHer eyes lifted from the book and fell on me. She started to smile but fought it back down.\u003c/p\u003e\n\u003cp\u003e“Permission to speak to the prisoner?” I asked.\u003c/p\u003e\n\u003cp\u003e“Are you going to give Victoria a hug and tell her everything is going to be fine and dandy, too?”\u003c/p\u003e\n\u003cp\u003e“No. If it comes up in conversation, though, I might tell her she has the best mother in the world and should listen to her.”\u003c/p\u003e\n\u003cp\u003e“I behaved like such a bitch, McKenzie.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that part of the job description?”\u003c/p\u003e\n\u003cp\u003e“She really is a good kid. Isn’t she?”\u003c/p\u003e\n\u003cp\u003e“I always thought so, but then I’m prejudiced.”\u003c/p\u003e\n\u003cp\u003e“Did I ever thank you for making her and Katie your heirs?”\u003c/p\u003e\n\u003cp\u003e“Many times. You’ve also accused me of spoiling them rotten.”\u003c/p\u003e\n\u003cp\u003e“Yes, and I wish you would stop.”\u003c/p\u003e\n\u003cp\u003e“I was reminded today that I’m an orphan. That I have no family. I was surprised at how angry it made me after all this time.”\u003c/p\u003e\n\u003cp\u003eShelby stared at me for a beat. “At least you have us.” She gave me a dismissive wave and returned to her book. “Go,” she said. “Talk to Victoria. Don’t let her think for a second that I’m not still angry.”\u003c/p\u003e\n\u003cp\u003eI walked upstairs, found Victoria’s bedroom door, and knocked. The fifteen-year-old was sitting at her desk, a laptop opened on top of it. She seemed happy to see me.\u003c/p\u003e\n\u003cp\u003e“Welcome to the gulag,” Victoria said.\u003c/p\u003e\n\u003cp\u003eI glanced around the bedroom. It seemed to have been decorated by a young woman with plenty of interests and not too many worries. There was an abundance of books, posters of celebrities, and handwritten signs with slogans like “There’s no sense arguing over every mistake, you just keep trying till you run out of cake” and “Do something brave every day and then run as fast as you can.” The walls were painted blue. Her closet doors were open, and I could see her clothes suspended on light blue hangers alternating with dark blue hangers and arranged according to color—white, gray, pink, red, green, blue, purple, and black.\u003c/p\u003e\n\u003cp\u003eVictoria caught me examining her closet and said, “You have to admit, that looks cool.”\u003c/p\u003e\n\u003cp\u003e“I’m guessing you’ve been grounded before,” I said.\u003c/p\u003e\n\u003cp\u003e“Have you heard what I’m in for this time?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“God, that was stupid. I was so stupid doing that for a guy. I don’t even like him that much. Stupid. God. This could knock me off the honor roll. Do you know I haven’t received a grade below an A since the third grade? Then I do this. Mom was right. She said no one who cares about me would ever ask me to do something that put me at risk.”\u003c/p\u003e\n\u003cp\u003e“Did you tell her that?”\u003c/p\u003e\n\u003cp\u003e“We’re not speaking. She needs me to suffer in silence for a while. Besides, I’m not entirely sure how letting a guy cheat off my chemistry test will lead to sexual abuse, prostitution, or unwanted pregnancy. Still … Have you ever done anything that stupid, McKenzie?”\u003c/p\u003e\n\u003cp\u003e“Frequently.”\u003c/p\u003e\n\u003cp\u003eMy answer didn’t seem to give her much comfort.\u003c/p\u003e\n\u003cp\u003e“What do you want, anyway?” Victoria asked.\u003c/p\u003e\n\u003cp\u003e“?Cómo es tu Espa?ol?”\u003c/p\u003e\n\u003cp\u003e“Mejor que la tuya.”\u003c/p\u003e\n\u003cp\u003e“Everybody’s Spanish is better than mine,” I told her. “I need you to do some research for me.”\u003c/p\u003e\n\u003cp\u003e“Why not? I’m not going anywhere.”\u003c/p\u003e\n\u003cp\u003e“There’s a hundred bucks in it.”\u003c/p\u003e\n\u003cp\u003e“Even better.”\u003c/p\u003e\n\u003cp\u003eI gave her the names Felipe Navarre and Susan Kowitz, as well as Juan Carlos Navarre, and told her that most of the information I wanted would probably be found on Spanish-language Web sites and that it would be at least seven years old.\u003c/p\u003e\n\u003cp\u003e“Didn’t Juan Carlos Navarre play basketball in the Olympics for Spain?” Victoria asked.\u003c/p\u003e\n\u003cp\u003e“That was Navarro.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah. Anything specific that you’re looking for?”\u003c/p\u003e\n\u003cp\u003e“Something that proves Juan Carlos is actually Felipe and Susan’s son. I’ll pay double for a photograph.”\u003c/p\u003e\n\u003cp\u003eA few minutes later I excused myself from the Dunston household and started driving toward Rickie’s. My cell phone played the Ella Fitzgerald–Louis Armstrong cover of “Summertime.” As a rule, I would not have answered it—I don’t like to talk on my cell and drive at the same time. The caller ID flashed the name Irene Rogers, though, so I made an exception.\u003c/p\u003e\n\u003cp\u003e“Reney,” I said.\u003c/p\u003e\n\u003cp\u003e“McKenzie, thank you so much for the wine. That was very kind of you.”\u003c/p\u003e\n\u003cp\u003e“It was my pleasure.”\u003c/p\u003e\n\u003cp\u003e“It isn’t my birthday, you know.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-24.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
