{"id":103363,"no":25,"title":"Page 25","content":"\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eShe thought that was funny.\u003c/p\u003e\n\u003cp\u003e“I didn’t open the bottle yet, but I will if you join me for dinner tomorrow night. Say, seven o’clock?”\u003c/p\u003e\n\u003cp\u003e“I’d like that.”\u003c/p\u003e\n\u003cp\u003e“We can talk some more about Juan Carlos.”\u003c/p\u003e\n\u003cp\u003e“Did you contact your friends?”\u003c/p\u003e\n\u003cp\u003e“I did. They said they met Juan Carlos in DC about two and a half months before he showed up at my condo, so the letter of introduction was legitimate. My friend, though, she told me that up until he knocked on their door, she had no idea that Felipe and Susan had a son.”\u003c/p\u003e\n\u003cp\u003e“He just showed up out of the blue?”\u003c/p\u003e\n\u003cp\u003e“He did. Speaking of which, there’s someone knocking on my door now. I need to go. Tomorrow at seven here at the club?”\u003c/p\u003e\n\u003cp\u003e“I’ll be there.”\u003c/p\u003e\n\u003cp\u003eTwo blocks later, Ella sang to me again. This time the display read SHEILA BRODIN, and I wondered, Why do so many people have my cell number?\u003c/p\u003e\n\u003cp\u003e“This is McKenzie,” I said.\u003c/p\u003e\n\u003cp\u003e“This is Sheila Brodin,” the voice replied. “I wish to speak to you about my daughter.”\u003c/p\u003e\n\u003cp\u003e“Ma’am—”\u003c/p\u003e\n\u003cp\u003e“Don’t call me ma’am. Do you know where Porterhouse is?”\u003c/p\u003e\n\u003cp\u003e“The steak house in Little Canada?”\u003c/p\u003e\n\u003cp\u003e“Meet me.”\u003c/p\u003e\n\u003cp\u003eI had questions, such as when and how would I recognize her. Sheila hung up before I could ask them.\u003c/p\u003e\n\u003cp\u003eI arrived ten minutes later. Porterhouse was crowded and noisy. All of the dining room tables and booths were occupied and the ma?tre d’ was surrounded by unseated customers clamoring for attention. The small bar was just as packed by men and women who drank expensive cocktails while waiting for their names to be called. I had no idea how I was going to locate Sheila Brodin in that busy throng, and then I did. She was the only person sitting alone—at a small table in the corner. I made my way to her side. She was wearing a sheer black blouse that revealed shadows of what lay beneath and a tan linen skirt with a high slit on the side. She glanced up at me as if she had expected a man to be looking down her shirt.\u003c/p\u003e\n\u003cp\u003e“McKenzie?” she asked.\u003c/p\u003e\n\u003cp\u003e“Mrs. Brodin.”\u003c/p\u003e\n\u003cp\u003e“Call me Sheila.”\u003c/p\u003e\n\u003cp\u003eShe gestured at the chair opposite her. She squirmed in her seat and drew the fingers of both hands through her shoulder-length hair as I sat. Her hair was the dark red that you see in very old furniture, and her face combined the pleasant features of a Mrs. America contestant with the expression of an executioner. I figured she perfected the look by studying the models in Vogue. Even with the table between us I could feel the heat radiating from her body.\u003c/p\u003e\n\u003cp\u003e“Drink?” she asked.\u003c/p\u003e\n\u003cp\u003e“Later.”\u003c/p\u003e\n\u003cp\u003eThe smile came and went so quickly that I almost didn’t see it. She might have thought I was suggesting a relationship beyond the moment. I wasn’t, though. She reminded me of a cat, and not one of those domestic breeds, either. Something big enough to bring down a full-grown man. I suspected she had many kills in her time. I wasn’t going to be one of them.\u003c/p\u003e\n\u003cp\u003e“What do you think of me, McKenzie?” she asked.\u003c/p\u003e\n\u003cp\u003eIt was an awkward question, especially considering what I was thinking of her, and I didn’t answer it.\u003c/p\u003e\n\u003cp\u003e“You know of me, don’t you?” she said. “You know what they say.”\u003c/p\u003e\n\u003cp\u003e“I really don’t.”\u003c/p\u003e\n\u003cp\u003e“Whore. Slut. Adulterous. Depraved bitch.”\u003c/p\u003e\n\u003cp\u003e“I hadn’t even heard your name until your mother mentioned it a couple of hours ago.”\u003c/p\u003e\n\u003cp\u003e“My mother? That paragon of chastity and goodness?”\u003c/p\u003e\n\u003cp\u003e“Mrs. Brodin, what do you want of me?”\u003c/p\u003e\n\u003cp\u003e“I’m a mother, too. Are you sure you don’t want a drink?”\u003c/p\u003e\n\u003cp\u003eI shook my head. She finished hers in one gulp and stood.\u003c/p\u003e\n\u003cp\u003e“The service is iffy when it’s this crowded,” she said. “I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eI watched her as she moved to the bar. Others watched her as well. She knew it, too—her walk was meant to catch the eye. When she returned with a fresh drink, she said, “How is Riley?”\u003c/p\u003e\n\u003cp\u003e“Confused,” I said. “Worried.”\u003c/p\u003e\n\u003cp\u003e“About Juan Carlos?”\u003c/p\u003e\n\u003cp\u003e“You’re aware of him, then?”\u003c/p\u003e\n\u003cp\u003e“Of course. Riley brought him over to the house, which she’s never done with any man. That’s the reason I asked to speak to you. I want you to do something for me, McKenzie. I’ll pay for it any way you like.”\u003c/p\u003e\n\u003cp\u003eAny way? my inner voice said.\u003c/p\u003e\n\u003cp\u003e“What?” I asked.\u003c/p\u003e\n\u003cp\u003e“Let Riley have her chance.”\u003c/p\u003e\n\u003cp\u003e“Her chance for what?”\u003c/p\u003e\n\u003cp\u003e“Happiness. Don’t ruin it for her the way they ruined it for me. Riley is a brilliant girl and beautiful, and she’s been put through so much, not just by me, but by all of them. She deserves her chance. I don’t want you fouling it up.”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?”\u003c/p\u003e\n\u003cp\u003e“If you take Muehlenhaus money, you do as Muehlenhaus says.”\u003c/p\u003e\n\u003cp\u003e“Okay, now I get it,” I said. “Now I understand why you called. You have spies at the Pointe.”\u003c/p\u003e\n\u003cp\u003e“It’s the only way I have of keeping track of my family.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-25.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
