{"id":103370,"no":32,"title":"Page 32","content":"\u003cp\u003eRiley assured me that Navarre’s boat had a comfortable sleeping compartment. She blushed when she said it, and for a moment I could imagine the two of them anchoring at night in one of the big bays until the morning sun. And all day long, too, for that matter.\u003c/p\u003e\n\u003cp\u003eThe more I thought about it, the more convinced I became that the reason Navarre’s security system was down and his BMW was still parked in the garage was because when the time came to run for it, he went by water, not by land. He simply dashed out the back door without bothering to set the alarm, hopped in his boat, and disappeared onto the vast and sprawling lake. He was probably out there now.\u003c/p\u003e\n\u003cp\u003eBut where? Why was he hiding? From whom?\u003c/p\u003e\n\u003cp\u003eOne question at a time, my inner voice told me.\u003c/p\u003e\n\u003cp\u003eRiley wasn’t particularly helpful. The more I pressed her for information, the more curt and condescending her replies became. She insisted that Navarre didn’t have any friends on the lake whose docks he could tie up to—because he’s been in Minnesota for such a short time, you see. I told her that both Mrs. Rogers and Mary Pat Mulally said he was very good at making friends. She all but accused me of leading a Spanish Inquisition. I couldn’t remember meeting anyone as defensive as she was.\u003c/p\u003e\n\u003cp\u003eShe did tell me where Navarre bought his boat, though. That was something at least.\u003c/p\u003e\n\u003cp\u003eMcDonald’s Marina was located on a strip of land that separated Lake Tanager from Brown’s Bay in the upper northeast corner of Lake Minnetonka. I sat in the Audi and took it all in. Five piers and a chain of docks provided slips for at least 250 vessels, yet only half of them were filled. In fact, there seemed to be just as many boats resting side by side on wooden supports in a yard next to a massive warehouse as in the water, each of them shrink-wrapped in blue polyethylene film. They reminded me of toy boats still in their original packaging, assuming they were toys for giants. At the edge of the marina, a captain was trying to maneuver his cruiser into the waiting jaws of a huge boatlift and not making much progress. Apparently he wasn’t very good at driving backward.\u003c/p\u003e\n\u003cp\u003eThere were several buildings, all of them white. I walked to the building that looked most like an office while I adjusted the holster behind my right hip. I hadn’t seen anything at the marina that frightened me, yet the gun wasn’t doing me any good locked in the trunk. It was a 9 mm SIG Sauer P228. I had been a Beretta man most of my adult life. I had taken a SIG off of a disgruntled bartender in the tiny town of Krueger, Minnesota, a while back, though, and decided I liked it. When I got the holster the way I wanted, I hid it beneath my sports jacket. The sports jacket made me the best-dressed man in the marina.\u003c/p\u003e\n\u003cp\u003eThe owner was occupied, so I wandered around, looking at the boats moored at their slips until he was free. I used to have a 28-footer with an eight-and-a-half-foot beam—the largest boat you can pull on a trailer in Minnesota. As I stopped to examine a pristine cabin cruiser I wondered why I sold it.\u003c/p\u003e\n\u003cp\u003e“The Amante,” a voice said. I turned to see a middle-aged man dressed in cargo shorts and a polo shirt. He was reading the name painted on the boat’s bow. “It means ‘lover.’ The previous owner, his wife named it. She said if a husband must have a mistress, it’s best that she be made of fiberglass.” He extended his hand. “I’m Jimmy. You were looking for me?”\u003c/p\u003e\n\u003cp\u003eI shook his hand and introduced myself.\u003c/p\u003e\n\u003cp\u003e“Are you in the market?” he asked. “We have some nice boats, new, used…”\u003c/p\u003e\n\u003cp\u003e“Actually,” I said, “I wanted to ask about a boat called the So?adora.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid you must have been reading one of our old flyers. I sold that boat seven, eight weeks ago. She was very similar to the Amante here. Thirty-eight feet LOA, thirty-six-inch draft, four-hundred-horsepower Volvo engine, three-hundred-gallon gas tank, sixty-four gallons of fresh water, sleeps five.”\u003c/p\u003e\n\u003cp\u003e“How long could you keep a boat like that out on the lake?”\u003c/p\u003e\n\u003cp\u003e“How long can you go without a hot shower?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“You need shore power to run a hot water heater. Otherwise, it depends on your battery setup. With a good bank of storage batteries, and let’s say you’re frugal with your amp hours, running the refrigerator, microwave, blender, coffeemaker, TV, computer at the bare minimum, I’d say you might be able to keep this boat off the grid for three, four days. Five if you push it hard.”\u003c/p\u003e\n\u003cp\u003e“How long would it take me to recharge the batteries?”\u003c/p\u003e\n\u003cp\u003e“You could do it overnight.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Lots of places—Minnetonka Boat Club, Wayzata Marine, Howard’s Point, Rockvam Boat Yards, Blue Lagoon, Excel. There are private docks, too, depending on who you know. Listen, if you want to live on the hook for a few days, I can show you several boats besides this one that would be damn comfortable. You need to understand, though, the Lake Minnetonka Conservation District rules won’t allow you to use a watercraft as living quarters. You can’t actually live on the lake.”\u003c/p\u003e\n\u003cp\u003e“But I can take a boat out for a few days at a time with no problem, right? The lake police won’t bother me.”\u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-32.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
