{"id":103377,"no":39,"title":"Page 39","content":"\u003cp\u003eI woke in Nina’s bed to the aroma of fresh-brewed coffee. Nina used to make lousy coffee—the EPA considered it a toxic substance—and I would invent excuses to avoid drinking it, until the head chef at Rickie’s gave her a tutorial on how it was done. Now it was fabulous. Still, it wasn’t enough to rouse me. I lay there instead, naked between the warm sheets, and listened to the sounds of morning outside the window. Even in the suburbs you can hear it, traffic like surf in the distance, a barking dog, a child’s squeal, and for a moment I felt the icy hand of panic grip my heart. What the hell was I doing with my life? Where was I going? What did I hope to accomplish? They were questions I had been asking quite often lately, yet the events of the previous day made them seem more urgent. Questions without answers. Or did I simply refuse to give them answers for fear that I wouldn’t like what they revealed?\u003c/p\u003e\n\u003cp\u003eScrew it, I told myself. I flung the top sheet aside and slid out of bed, determined to make the best I could of the day.\u003c/p\u003e\n\u003cp\u003eI had clothes in Nina’s closet and bureau. I found them, and after taking a quick shower and shave—yes, I kept a razor there, too—I put them on. I paused briefly to check my cell. There were two messages from Riley Brodin, one from Mr. Muehlenhaus, and another from Greg Schroeder—nobody that I wanted to talk to at the moment. I ignored them all and sent a text message to Victoria Dunston.\u003c/p\u003e\n\u003cp\u003e“Well?” it read.\u003c/p\u003e\n\u003cp\u003eA few moments later she replied.\u003c/p\u003e\n\u003cp\u003e“OMG! U want 2 get me in trouble? I’ll call l8er.”\u003c/p\u003e\n\u003cp\u003eI went downstairs and found Nina in the kitchen. I would have paid real money to see her in the clinging silk number she had worn the previous evening. Instead, she was wearing gray sweatpants and a loose-fitting black T-shirt that proclaimed her affection for the Preservation Hall Jazz Band—a gift from Erica, who was attending Tulane University in New Orleans. The sweat at her temples and down the center of her back proved that she had already made her morning run. It did little to lessen my desire for her.\u003c/p\u003e\n\u003cp\u003e“Good morning,” she said.\u003c/p\u003e\n\u003cp\u003e“Morning.”\u003c/p\u003e\n\u003cp\u003e“Coffee?”\u003c/p\u003e\n\u003cp\u003e“Please.” She went to her coffeemaker and retrieved the glass pot. I said, “You’re up early.”\u003c/p\u003e\n\u003cp\u003e“Actually, you’re up late.”\u003c/p\u003e\n\u003cp\u003eI glanced at the clock on the wall. Eight fifteen. That wasn’t late for me, but then I was gainfully unemployed.\u003c/p\u003e\n\u003cp\u003eI sat at the table. She leaned across me and poured the coffee into a mug. “What are your plans for today?”\u003c/p\u003e\n\u003cp\u003eI pulled her down until she was sitting on my lap.\u003c/p\u003e\n\u003cp\u003e“I was toying with an idea,” I said.\u003c/p\u003e\n\u003cp\u003eNina kissed my cheek. “Besides that.”\u003c/p\u003e\n\u003cp\u003e“I haven’t decided.”\u003c/p\u003e\n\u003cp\u003e“Yes, you have. You’re going to find the man who killed your friend, who attacked the real estate agent.”\u003c/p\u003e\n\u003cp\u003e“I am?”\u003c/p\u003e\n\u003cp\u003eNina slid off my lap and returned the coffeepot to the maker.\u003c/p\u003e\n\u003cp\u003e“You decided that yesterday before you even called me, you know you did,” she said. “I was just wondering how you were going to go about it.”\u003c/p\u003e\n\u003cp\u003e“The key is Navarre. If I find him … I don’t want to talk about that right now.”\u003c/p\u003e\n\u003cp\u003e“All right, change of subject.” She sat across from me. “I’ve been thinking.”\u003c/p\u003e\n\u003cp\u003eI took a sip of coffee. Damn, it was good, and I wondered if Monica Meyer would share her formula with me. Probably not. She and I had been fencing with each other—sometimes playfully—ever since the chef was hired to manage Nina’s kitchen.\u003c/p\u003e\n\u003cp\u003e“What have you been thinking?” I asked.\u003c/p\u003e\n\u003cp\u003e“Should we make this permanent?”\u003c/p\u003e\n\u003cp\u003eI took a deep breath the way you do just before you dive into a lake.\u003c/p\u003e\n\u003cp\u003e“What?” I asked.\u003c/p\u003e\n\u003cp\u003e“I was thinking…”\u003c/p\u003e\n\u003cp\u003e“Are you proposing, Nina? Because if you are…”\u003c/p\u003e\n\u003cp\u003e“No, no, God no.”\u003c/p\u003e\n\u003cp\u003e“The answer is yes.”\u003c/p\u003e\n\u003cp\u003e“What I meant, should we move in together?”\u003c/p\u003e\n\u003cp\u003e“Not marry?”\u003c/p\u003e\n\u003cp\u003e“You and I have no business getting married to anyone, much less to each other.”\u003c/p\u003e\n\u003cp\u003e“I beg to differ.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, if we were married you’d want me to be Shelby Dunston, the perfect wife of the perfect policeman, keeping the perfect home, raising perfect children, providing you with a refuge from the troubles of your day, and let’s face it—I’m not Shelby. I’m not the perfect wife. Ask my ex-husband if you don’t believe me. I’m a girl who runs a saloon and likes it. I spend twice as much time there as I do here, and I wouldn’t have it any other way.\u003c/p\u003e\n\u003cp\u003e“You—I’d want you to be the dutiful husband, mow the lawn, shovel the snow, open jars, and pretty much attend to my every desire. Only you’re not that person, either. You’re an adventurer. You do what you do for fun and because you think you’re making the world a better place and because of some code of justice that you’ve never been able to articulate even to yourself, much less to me. Marriage would demand that we both make compromises for each other that would interfere with the lives we want to live. We’d end up making each other miserable. Look, we’ve had this conversation before.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-39.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
