{"id":103384,"no":46,"title":"Page 46","content":"\u003cp\u003e“No matter what.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid for him,” Riley said.\u003c/p\u003e\n\u003cp\u003eShe hung up, which was fine with me. Personally, I no longer gave a damn about Navarre. He could live or die or move to Iowa for all I cared. Just as long as he led me to Mrs. R’s killer first.\u003c/p\u003e\n\u003cp\u003eTWELVE\u003c/p\u003e\n\u003cp\u003eI called Anne Rehmann. She said if I wanted to talk, I could visit her home in Deephaven, not far from her office. She met me at the door dressed in a thick blue robe over flannel pajamas, heavy socks, and fluffy slippers. I didn’t know if she was cold or trying to make herself seem less like an attractive woman.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I asked.\u003c/p\u003e\n\u003cp\u003e“No, McKenzie, I’m not okay. How ’bout you?”\u003c/p\u003e\n\u003cp\u003eI didn’t answer. Instead, I asked a question. “Will you help me?”\u003c/p\u003e\n\u003cp\u003e“You or Riley Brodin?”\u003c/p\u003e\n\u003cp\u003eI was surprised by the question.\u003c/p\u003e\n\u003cp\u003e“Mrs. R,” I said.\u003c/p\u003e\n\u003cp\u003e“Come in.”\u003c/p\u003e\n\u003cp\u003eAnne held the door open and I slipped inside. The house was small, some would say cozy, and tastefully decorated. Unlike my home, it looked as if someone actually lived there and enjoyed the experience.\u003c/p\u003e\n\u003cp\u003eAnne led me into her living room. There was a sofa against the wall, a blanket and bedroom pillow tossed casually on top of it. Anne sat on the sofa, gathered the blanket around her legs, fluffed the pillow, and leaned against it. A box of tissues was on the coffee table in front of the sofa; a dozen or so used tissues were scattered around it.\u003c/p\u003e\n\u003cp\u003e“I’m having trouble sleeping,” she said. “I went to see the deputies this morning and afterward tried to take a nap, but…” She waved at a chair on the other side of the coffee table, and I sat. “They had me looking at pictures of criminals. So many pictures. I didn’t see him, though, or maybe I did, I don’t know. I’m tired, McKenzie. I can’t sleep.”\u003c/p\u003e\n\u003cp\u003eI was taught when I was a cop how to “chaperone” a sexual assault victim. I was taught about the feelings of fear, shame, anger, shock, and guilt they’ll experience; taught about their inability to sleep and the nightmares they’ll have when they do, the erratic mood swings, the sense of worthlessness that will come later. Yet all of it was in the context of keeping them composed enough to answer questions, to provide information that would help us catch their assailants. Listening to Anne, I knew there wasn’t much I could do to console her or help her get past what had happened to Mrs. R, what had happened to her, what might have happened if I hadn’t arrived at her office. Even capturing her attacker would do little to ease her pain.\u003c/p\u003e\n\u003cp\u003e“Tell me about Navarre,” I said.\u003c/p\u003e\n\u003cp\u003e“It all comes back to Juan Carlos, doesn’t it? I know the deputies are searching the lake for him. That’s what they said. I gather they’ve had no luck.”\u003c/p\u003e\n\u003cp\u003e“None that I’ve heard of.”\u003c/p\u003e\n\u003cp\u003e“I met Juan Carlos, it was early April.”\u003c/p\u003e\n\u003cp\u003eThat caught me by surprise—Riley said he arrived in June.\u003c/p\u003e\n\u003cp\u003e“He came to my office,” Anne said. “He told me he was a Spanish national. He said he was interested in moving to Minnesota and wanted to see what properties were available on the lake. I’m not foolish, McKenzie. I understand the dangers of a woman working alone in real estate. At the conventions, that’s something we always talk about. Protect yourself; always protect yourself. So I checked to make sure that he was registered at his hotel. I took his picture. I made a copy of his passport—”\u003c/p\u003e\n\u003cp\u003e“Wait. He had a passport?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Can I see the copy?”\u003c/p\u003e\n\u003cp\u003e“It’s in my office. You’ll excuse me if I don’t go there anytime soon.”\u003c/p\u003e\n\u003cp\u003e“I understand,” I said.\u003c/p\u003e\n\u003cp\u003e“I took him out on the boat. I have a speedboat that I dock across the street from the office. We toured the lake. He was particularly interested in Crystal Bay. He asked about the big white house with the purple flag on the dock. The Muehlenhaus estate. I didn’t think anything of it at the time. Why would I? Then there was Mrs. Rogers’s house across the bay. He was interested in that, too. I told him it was for sale. He asked if it was possible to lease the property. I told him I didn’t think so, but we could ask Mrs. R to see if she was agreeable.\u003c/p\u003e\n\u003cp\u003e“We checked out a few more properties. He didn’t seem to have any interest in anything outside of Crystal Bay, though. I took him back to the agency. He thanked me for my time and said he’d be in touch. Only I didn’t hear from him again. That happens all the time. I didn’t think anything of it. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-46.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
