{"id":103389,"no":52,"title":"Page 52","content":"\u003cp\u003e“I am?”\u003c/p\u003e\n\u003cp\u003e“Don’t you keep track?”\u003c/p\u003e\n\u003cp\u003e“I have people for that,” I said. Actually, I had a person—H. B. Sutton, who was a financial genius even if she did live on a houseboat. She’s been chiding me for months now because I can’t be bothered to come in and review my portfolio.\u003c/p\u003e\n\u003cp\u003eFour-point-two million? my inner voice said. Better set up an appointment.\u003c/p\u003e\n\u003cp\u003e“You seem to know a lot about my finances, yet you won’t tell me about Navarre’s,” I said aloud.\u003c/p\u003e\n\u003cp\u003eBrodin ate the rest of the chicken tender.\u003c/p\u003e\n\u003cp\u003e“Can you at least tell me if he’s tried to access his accounts in the past week?” I asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Following the money might be the only way to find him.”\u003c/p\u003e\n\u003cp\u003e“That can’t be my concern.”\u003c/p\u003e\n\u003cp\u003e“The police—”\u003c/p\u003e\n\u003cp\u003e“If the police come to me with a warrant, I’ll give them whatever information the court orders me to give them. Beyond that—I will not breach client confidentiality. Stop asking. If I won’t break the rules for that old man on the lake, I sure as hell won’t do it for you.”\u003c/p\u003e\n\u003cp\u003e“Mr. Muehlenhaus asked you to violate confidentiality?”\u003c/p\u003e\n\u003cp\u003e“Many times. That’s why I’m not welcome at the Pointe, why he works so hard to turn my daughter against me. One reason, anyway. If you don’t jump when Muehlenhaus says, he jumps on you. You of all people should know that. Fucking McKenzie.”\u003c/p\u003e\n\u003cp\u003e“When I first learned Mr. Muehlenhaus called me that, I was kinda honored. Now it just pisses me off.”\u003c/p\u003e\n\u003cp\u003e“Try living with ‘deadbeat son-in-law’ for twenty-eight years.”\u003c/p\u003e\n\u003cp\u003eBrodin raised his cup of soda as if toasting me and drank from it. He was a man of halves, I decided. Half handsome, half smart, half ambitious, half brave, half spoiled. The toes of his expensive Italian shoes were brightly polished, yet the heels were scuffed.\u003c/p\u003e\n\u003cp\u003e“You told Riley that Navarre was a con man who was only after her money,” I said. “That makes sense if he doesn’t have any. If he does…”\u003c/p\u003e\n\u003cp\u003e“He can’t be trusted.”\u003c/p\u003e\n\u003cp\u003e“Why not?\u003c/p\u003e\n\u003cp\u003eBrodin waved his hand as if that explained everything.\u003c/p\u003e\n\u003cp\u003e“Besides,” he said, “there’s no comparison between his wealth and hers, none. Wait, you want a comparison? He can afford to buy a luxury suite at Target Field to watch the Twins play baseball. She can buy the goddamn team.”\u003c/p\u003e\n\u003cp\u003e“Is Riley really worth that much?”\u003c/p\u003e\n\u003cp\u003e“The old man has been slowly transferring his assets into her name, been doing it for years, so when he dies she won’t have to pay taxes on his estate. The death tax, they call it. The old man can’t cheat death. He sure as hell can cheat the tax man.”\u003c/p\u003e\n\u003cp\u003e“Does Navarre know this?”\u003c/p\u003e\n\u003cp\u003e“I have no idea what he knows, what Riley might have told him. I should never have introduced the two of them at the club’s Fourth of July party.”\u003c/p\u003e\n\u003cp\u003e“You introduced them?”\u003c/p\u003e\n\u003cp\u003eThat’s not the way Riley told you it happened, my inner voice reminded me. Or at least that’s not the way she remembers it.\u003c/p\u003e\n\u003cp\u003e“I was chatting with Navarre,” Brodin said. “He saw Riley and asked, who is that girl with the white hair? What else could I do?”\u003c/p\u003e\n\u003cp\u003eAnother french fry. Another sip of soda.\u003c/p\u003e\n\u003cp\u003e“Riley was always a wild girl,” Brodin said. “She takes after her mother.”\u003c/p\u003e\n\u003cp\u003e“I didn’t get that impression.”\u003c/p\u003e\n\u003cp\u003e“Wild might be a bit harsh. Willful? Tell her to do one thing and she’ll do the opposite out of spite. That’s why Sheila married me, because her family told her not to. It’s also the reason why she won’t divorce me. Because that’s what her family wants.”\u003c/p\u003e\n\u003cp\u003eHe chuckled.\u003c/p\u003e\n\u003cp\u003e“Sheila can be as mean as she is pretty,” he said. “Damn if she isn’t very, very pretty.”\u003c/p\u003e\n\u003cp\u003e“I met your wife. You’re right. She’s very pretty.”\u003c/p\u003e\n\u003cp\u003e“I won’t give you a dissertation on our marriage, McKenzie. It wasn’t a happy one. People say—old man Muehlenhaus says—I married her for money and position. They’re wrong. I loved her. Truly, I did. Sheila was oh, so beautiful and exciting, and I loved her. She didn’t love me, though. She was getting older and she thought she should marry and have children because that’s what we teach women they should do. That’s what the Muehlenhauses expected her to do. I just happened to be standing there at the time. Some people shouldn’t get married, though. They don’t have the disposition for it. Sheila is one of them. Doesn’t mean they’re selfish or self-centered. Doesn’t mean they’re bad people. Sheila isn’t a bad person no matter how hard she works at it. Just a lousy wife. I only regret … I just wish we could have done better for Riley’s sake.”\u003c/p\u003e\n\u003cp\u003eI left Brodin to his fast food and returned to the Jeep Cherokee feeling no further ahead than when I started. I wondered if Lieutenant Pelzer was doing any better and gave him a call. He informed me that his deputies had painstakingly searched Lake Minnetonka yet were still unable to find the So?adora.\u003c/p\u003e\n\u003cp\u003e“How is that possible?” I asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-52.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
