{"id":103396,"no":59,"title":"Page 59","content":"\u003cp\u003eI tried to argue with her.\u003c/p\u003e\n\u003cp\u003e“What right do you have coming here, putting us at risk again?” she said. “Do you know how many people around here were hurt by what Jax did? How many went to jail? I could point to houses up and down this street where they lived, where their families still live. Even today some of them spit on the sidewalk when we walk by. Now you say he’s back. He’s back! Damn him.”\u003c/p\u003e\n\u003cp\u003e“No, no,” Delfina said. “It’s a lie. Jax didn’t do anything wrong. He’s a good boy. Now he’s come home.”\u003c/p\u003e\n\u003cp\u003e“He can’t come home,” Abril said.\u003c/p\u003e\n\u003cp\u003e“He has.”\u003c/p\u003e\n\u003cp\u003e“Mama, he was one of them…”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“If he came home…”\u003c/p\u003e\n\u003cp\u003e“No. It is not true.”\u003c/p\u003e\n\u003cp\u003eAbril threw her arms around her mother and drew her close.\u003c/p\u003e\n\u003cp\u003e“Maybe you’re right, Mama,” she said. “Maybe you’re right.”\u003c/p\u003e\n\u003cp\u003eAt the same time she fixed her eyes on my face and jerked with her head toward the door. I stepped outside and waited. A few moments later, she joined me.\u003c/p\u003e\n\u003cp\u003eAbril returned my cell phone.\u003c/p\u003e\n\u003cp\u003e“Mama thinks Jax is the one who got away,” she said. “The one who escaped when so many in the neighborhood were jailed. She’ll die thinking that. To her he’ll always be a good boy. She refuses to see him the way he really is.”\u003c/p\u003e\n\u003cp\u003e“What way is he?” I asked. “Really.”\u003c/p\u003e\n\u003cp\u003e“A selfish opportunist. He took off and left us holding the bag.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“The gang life, there’s no future in it, and Jax was always about the future. His future.”\u003c/p\u003e\n\u003cp\u003eI told Abril that I’d seen all of her brother’s academic awards. She told me that Jax had been accepted at every college he applied to, all nine of them. The University of Minnesota had always been keen on keeping the state’s best students at home and offered him a half-ride academic scholarship. So did Wisconsin and Notre Dame. Northwestern, Boston University, and the others offered only low-interest loan packages.\u003c/p\u003e\n\u003cp\u003e“Minnesota, Wisconsin—tuition is about twenty-five thousand dollars for residents, counting room and board,” Abril said. “All the others are sixty thousand or more. A year. After everything, Jax couldn’t afford to go to college.”\u003c/p\u003e\n\u003cp\u003e“Why not apply for financial aid? The government has a program. I have a friend whose daughter is in college. I’m told there’s a lot of scholarship money to be had if you know where to look.”\u003c/p\u003e\n\u003cp\u003e“What was Jax going to put on the applications? That he was a poor Hispanic with no father and a mother who’s in the country illegally, who has never even paid taxes?”\u003c/p\u003e\n\u003cp\u003e“There are organizations he could talk to. Programs…”\u003c/p\u003e\n\u003cp\u003e“Not for Jax. I hated that he became Nine-Thirty-Seven. I understand it, though. He had nowhere else to go.”\u003c/p\u003e\n\u003cp\u003eI wasn’t so sure, a kid that smart. Maybe smarter than anyone gave him credit for.\u003c/p\u003e\n\u003cp\u003e“Is it possible that he joined the Mexican Mafia with the sole purpose of eventually stealing its money so he could pay for his education?” I asked.\u003c/p\u003e\n\u003cp\u003eAbril stared as if she had just seen me saw my assistant in half and wondered how I had managed it.\u003c/p\u003e\n\u003cp\u003e“I don’t know if he planned it,” she said. “Maybe he did. I only know when he had the opportunity, he took the money and ran, leaving Mama and me to face the neighborhood alone.”\u003c/p\u003e\n\u003cp\u003e“If he did do it to pay for school, which school would he have gone to?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Why don’t you ask his Anglo whore?”\u003c/p\u003e\n\u003cp\u003eMary Gabler née Walker was not a whore, Anglo or otherwise. She was a very pretty twenty-six-year-old community relations manager for Wells Fargo Bank, who lived in Mendota Heights with her husband of fifteen months, and who agreed to meet me at a coffeehouse not far from the Mendakota County Club—but only if I promised to call her “Muffie.”\u003c/p\u003e\n\u003cp\u003e“That’s what they called me all through grade school,” she said. “High school, too. Probably my mother just started calling me that when I was an infant and it stuck. She still calls me that. So does my family, some old friends, too. Only the people I’ve met since I went to Notre Dame call me Mary.”\u003c/p\u003e\n\u003cp\u003e“Did Jax Abana call you Muffie?”\u003c/p\u003e\n\u003cp\u003e“Yes, he did. Jax—I haven’t spoken to him since, what? A week after graduation?”\u003c/p\u003e\n\u003cp\u003eIt was when she said “graduation” that I remembered where I had seen her before. In the photograph that Delfina Abana showed me. She was the blonde third from the left.\u003c/p\u003e\n\u003cp\u003e“You dated,” I reminded her.\u003c/p\u003e\n\u003cp\u003e“He was my bad boy. A girl has to date at least one bad boy in her lifetime. At least that’s what I told myself afterward.”\u003c/p\u003e\n\u003cp\u003e“How bad was he?”\u003c/p\u003e\n\u003cp\u003e“Up until the end, he wasn’t bad at all. At least, he was good to me. People, my friends, they told me I was crazy for getting involved with him, but I never knew if that was because he couldn’t be trusted or because he was Hispanic.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-59.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
