{"id":103344,"no":6,"title":"Page 6","content":"\u003cp\u003eI walked the rest of the way to the lake; the morning sun made the waves on Crystal Bay sparkle like diamonds. The shoreline was braced with a wall of enormous boulders that stretched for a hundred feet. It was divided in half by a wide wooden dock; its planks were covered with water-resistant polyurethane. I stepped out onto the dock. It was equipped with both electricity and fresh-water hookups, although no boat was moored there.\u003c/p\u003e\n\u003cp\u003eThere were plenty of boats dotting the huge bay, though, yet not nearly as many as during the summer, and I was reminded that it was the first day of October. It seems half of the people in Minnesota launch their boats—and ready their golf clubs, for that matter—on Memorial Day and then begin storing them away again right after Labor Day as if they can’t wait for winter to begin. Meanwhile, given the length of our notoriously merciless winters, the rest of us strive tirelessly to stretch summer out until the very first snowfall, and sometimes longer. The folks still out on the lake were my kind of people.\u003c/p\u003e\n\u003cp\u003eI didn’t see any bodies floating facedown in the lake, so I went back to the house. I made my way to the front door and used Riley’s key to open it. I called Navarre’s name when I stepped inside. A house gives off a certain vibe when it’s unoccupied. I felt it as I closed the door behind me and stepped deeper into the foyer. “Navarre,” I called again, but I was thinking “Wow.” It’s not often you see your face reflected in white marble when you enter a house. I called out yet again. When Navarre didn’t answer, I stepped past the foyer into a living room. This time I actually spoke the word aloud. “Wow.”\u003c/p\u003e\n\u003cp\u003eThe living room was filled with white furniture; white rugs were strategically positioned on the gleaming hardwood floor. I walked around the rugs for fear of soiling them. Even the baby grand piano in the corner was white. The lid was open, and the way sheet music was arrayed above the keyboard suggested that it had been played recently.\u003c/p\u003e\n\u003cp\u003eThe living room flanked a formal dining room, where I found a table that could easily seat two dozen beneath an honest-to-God crystal chandelier. The dining room opened onto an immense kitchen that was so opulent and so clean that I would have feared to cook anything in it. There was a door next to the refrigerator. The three-car garage was on the other side of it. A BMW 328i convertible was parked there, and nothing else—no rakes, no shovels, no lawn mowers, and no snow blowers; nothing that you might expect to find in a garage in Minnesota. I checked the Beamer. It was this year’s model; there couldn’t have been more than a few hundred miles on the odometer.\u003c/p\u003e\n\u003cp\u003eOn the far side of the kitchen I found an informal dining room—it sat only eight—which led to a sunroom filled with more wicker furniture. Thick panes of tinted glass stretching from floor to ceiling served as walls and faced south and west. A family room lay beyond and featured both leather and upholstered furniture arranged in front of an HDTV just slightly smaller than the scoreboard at the Xcel Center.\u003c/p\u003e\n\u003cp\u003eEvery surface in the house was fastidiously cleaned, dusted, vacuumed, or polished; every pillow, tapestry, quilt, comforter, and rug was artfully arranged; every collectible, antique, artifact, and work of art was displayed to maximum effect. There were no newspapers, magazines, or books littering sofa cushions or tabletops; no jackets, sweaters, or sweatshirts draped over the back of chairs; no mail, umbrellas, shoes, or keys discarded near doorways—nothing to suggest that someone actually lived there. The wastebaskets were empty, and so was the dishwasher. Even the food in the refrigerator looked as if it had been meticulously organized by an art director guiding a photo shoot.\u003c/p\u003e\n\u003cp\u003eI wandered up to the second floor. The staircase divided the upstairs more or less in half. I went to my right and discovered four bedrooms and three baths, each so pristine that at first glance you would have doubted that they had ever been used. I looked closer, however, and discovered that the bathroom off of what I assumed was the master bedroom contained a toothbrush, toothpaste, dental floss, mouthwash, shaving cream, a razor, extra blades, shampoo, conditioner, hair spray, deodorant, cologne, and other articles needful to a man who prized personal hygiene. Yet it all felt new and was so neatly arranged on shelves and in drawers that I suspected the owner suffered from an obsessive-compulsive disorder. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-6.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
