{"id":103400,"no":63,"title":"Page 63","content":"\u003cp\u003e“Fair enough. So, Arnaldo, have you learned anything interesting so far?”\u003c/p\u003e\n\u003cp\u003e“Only that you really like your coffee, man. And you meet lots of good-looking women.”\u003c/p\u003e\n\u003cp\u003e“You’re going to love the next place we go. Can’t promise any babes, though. Try to keep up.”\u003c/p\u003e\n\u003cp\u003eI hung a right onto Snelling Avenue and went north until I caught the I-94 entrance ramp. From there I headed east until I found I-35E and went north again. I signaled my turn well in advance so that the red Sentra was on my bumper when I exited onto Pennsylvania Avenue, hung a right onto Phalen Boulevard, hung another on Mississippi Street, and went east again on Grove Street. I turned left into the large parking lot. The Sentra kept going straight. I don’t know if it was all the cop cars that spooked them or the sign on the red brick wall—ST. PAUL POLICE DEPARTMENT. The idea that Arnaldo and his driver would keep heading east until they reached the Wisconsin border made me chuckle.\u003c/p\u003e\n\u003cp\u003eSergeant Billy Turner was one of the few friends I still had in the St. Paul Police Department; one of the few cops who didn’t think I sold my badge when I resigned to collect the reward on the embezzler. He was an African American living in Minnesota who played hockey, which made him a true minority in my book. I met him in his office on the first floor of the Griffin Building. The Missing Persons Unit shared space with the Juvenile Unit because—Professor Castlerock’s math notwithstanding—approximately seven hundred thousand persons go missing each year and all but fifty thousand are kids. Well over half are runaways who eventually return home, and another two hundred thousand are family abductions related to domestic and custody disputes, leaving approximately sixty thousand boys and girls seventeen years or younger that the police consider “endangered.” Billy was a busy man.\u003c/p\u003e\n\u003cp\u003e“I can give you ten minutes, McKenzie,” he said. “You’re lucky to get that, because it’s Saturday and I want to go home. Me and the missus are going to my sister-in-law’s for dinner.”\u003c/p\u003e\n\u003cp\u003e“Your sister-in-law a good cook, is she?”\u003c/p\u003e\n\u003cp\u003eThe question slowed him down.\u003c/p\u003e\n\u003cp\u003e“Okay, make it fifteen minutes,” he said. “What do you need?”\u003c/p\u003e\n\u003cp\u003e“What do you remember about a missing persons involving two young adult males named David Maurell and Collin Baird?”\u003c/p\u003e\n\u003cp\u003e“Help me out.”\u003c/p\u003e\n\u003cp\u003e“Macalester College about eight years ago?”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah. College kids coming back from some bumfuck town in Indiana. They never made it. Hang on a sec.”\u003c/p\u003e\n\u003cp\u003eBilly sat in a swivel chair, spun until he faced his computer, and typed in a few commands.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah,” he said. “Baird is from Galena, Illinois, not Indiana. My mistake. This wasn’t our case, McKenzie. Jo Daviess County in Illinois had jurisdiction since the kids were last seen in Galena. What I have, kid never called his family and his family couldn’t get a hold of him. Family became worried and checked with the school. Macalester had no record of the kid returning to campus after spring break. Jo Daviess asked for an assist. We made inquiries. All we discovered was that this Maurell kid didn’t seem to exist. He wasn’t enrolled at the school. Didn’t have a permanent address. No driver’s license. No Social Security number. Spoke to a woman who knew him, what’s her name, ahhhh … Professor Patricia Castlerock. All she had was a cell phone number. Forwarded what little intel we generated to Jo Daviess. They sent out bulletins—you know the drill. If anything came of it, they didn’t bother to tell us.” Billy spun in his chair to face me. “This is getting to be a long time ago, McKenzie. What’s your interest?”\u003c/p\u003e\n\u003cp\u003e“Maurell has apparently resurfaced using a different name.”\u003c/p\u003e\n\u003cp\u003e“Should I care?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. Hennepin County might, though.”\u003c/p\u003e\n\u003cp\u003e“Now the important question—is this going to get me in trouble with Bobby D upstairs? You know the bosses don’t like us doing favors for civvies like you.”\u003c/p\u003e\n\u003cp\u003eI was pleased to hear how he referred to Bobby. If Billy had called him by the proper title, Commander Robert Dunston of the Major Crimes Division, it would have been a sign of disrespect or at least disagreement.\u003c/p\u003e\n\u003cp\u003e“Bobby should be cool with this one,” I said. “Although, if you’d rather keep it to yourself…”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Do you have the name of someone I could reach out to in Galena?”\u003c/p\u003e\n\u003cp\u003e“Hang on.”\u003c/p\u003e\n\u003cp\u003eBilly swiveled back in front of the computer screen, found a name and phone number, scribbled them down on a sheet of paper, and gave it to me.\u003c/p\u003e\n\u003cp\u003e“Time’s up, my man,” he said.\u003c/p\u003e\n\u003cp\u003eI called the Galena Police Department from the parking lot and asked for Officer Lori Hasselback. Chief Hasselback took the call and said she remembered the Baird case vividly. She was intrigued by what I had to tell her and agreed to meet me. She said she would review her notes before I arrived. I asked if Baird’s family would also consent to an interview.\u003c/p\u003e\n\u003cp\u003e“You can ask,” she said.\u003c/p\u003e\n\u003cp\u003eMy next call was to Nina Truhler.\u003c/p\u003e\n\u003cp\u003e“Hey,” she said.\u003c/p\u003e\n\u003cp\u003e“Road trip,” I said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-63.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
