{"id":103402,"no":65,"title":"Page 65","content":"\u003cp\u003e“Cadillac DTS.”\u003c/p\u003e\n\u003cp\u003e“What’s the DTS stand for?”\u003c/p\u003e\n\u003cp\u003e“Deluxe Touring Sedan. I was hoping you wouldn’t notice. Nina, we need to talk.”\u003c/p\u003e\n\u003cp\u003eShe revolved in her seat so she could get a good look at me.\u003c/p\u003e\n\u003cp\u003e“The Caddy must have picked me up at my place when I went home to pack, only I missed it,” I said. “Which means he followed me to your house. They know where you live.”\u003c/p\u003e\n\u003cp\u003e“Who’re they?”\u003c/p\u003e\n\u003cp\u003eI explained about the Nine-Thirty-Seven Mexican Mafia.\u003c/p\u003e\n\u003cp\u003e“So?” Nina said.\u003c/p\u003e\n\u003cp\u003e“Not only that—I wasn’t going to tell you this, but the man who raped and murdered Irene Rogers probably broke into my house Thursday night. He had waited for me, but I didn’t show. I was at your place. If we had been living together, though…”\u003c/p\u003e\n\u003cp\u003e“Don’t do that.”\u003c/p\u003e\n\u003cp\u003e“The Audi isn’t in the shop because of car trouble. It’s in the shop because he shot it full of holes.”\u003c/p\u003e\n\u003cp\u003e“I knew it. I just knew it.”\u003c/p\u003e\n\u003cp\u003e“Knew what?”\u003c/p\u003e\n\u003cp\u003e“The moment I said we should live together I knew you would try to find a way to get out of it. Shelby is right. You do have commitment issues.”\u003c/p\u003e\n\u003cp\u003e“I don’t have … Nina. That’s not it at all.”\u003c/p\u003e\n\u003cp\u003e“What is it, then?”\u003c/p\u003e\n\u003cp\u003e“I’m worried about you. I can’t ask you to move in with me. I can’t put you at risk. I just can’t.”\u003c/p\u003e\n\u003cp\u003e“Bullshit.”\u003c/p\u003e\n\u003cp\u003eThe word stung like a slap. Nina almost never cursed, and when she did, you had better pay attention.\u003c/p\u003e\n\u003cp\u003e“First of all, you’re not asking me. I’m asking you. And since you brought it up, I’ve been at risk since the day I met you. How ’bout the time a man broke into my house and put a gun to my head, for God’s sake, and then kept me there, prisoner, until you came over so he could shoot you?”\u003c/p\u003e\n\u003cp\u003e“That’s what I mean.”\u003c/p\u003e\n\u003cp\u003e“How ’bout the time those guys rammed the back of my car, my Lexus—this Lexus—and threw a couple of shots at us for good measure?”\u003c/p\u003e\n\u003cp\u003e“That’s my nightmare. I don’t know what I would do if something happened to you. Especially if it happened to you because of me.”\u003c/p\u003e\n\u003cp\u003e“McKenzie, I told those stories for months afterward; told them to anyone who would care to listen. It gave me great pleasure to do so. Hasn’t it occurred to you even once after all these years, after all the nuttiness we’ve been through together, that I might actually like living the devil-may-care life?”\u003c/p\u003e\n\u003cp\u003eNo, my inner voice said. It hadn’t.\u003c/p\u003e\n\u003cp\u003eWe drove in silence for a few more miles. By then we were near Lake Pepin, about sixty miles downstream from St. Paul. Villa Bellezza Winery and Vineyards came up on our left and Nina told me to pull in. She said she wanted to get a bottle of Cinque Figilie and Sangua Della Pantera—she recited the names the way the rest of us might order a Dr. Pepper. I suspected, though, that she just wanted to get out of the car and away from me for a few minutes.\u003c/p\u003e\n\u003cp\u003eI parked in the lot near the door and she went inside the villa. A few minutes later, I said, “screw it” and followed her.\u003c/p\u003e\n\u003cp\u003e“Just in time,” she said when I approached the counter. She handed me the bottles without another word and went back outside while I stayed to pay for them. A couple of minutes later, I stepped into the bright sunshine. I couldn’t find Nina at first, and then I did. The black Cadillac DTS was parked at the far end of the lot. Nina was using the roof to balance herself as she leaned toward the driver’s window and spoke to whoever was inside.\u003c/p\u003e\n\u003cp\u003e“Sonuvabitch,” I said.\u003c/p\u003e\n\u003cp\u003eI set the wine bottles on the asphalt and reached for the Beretta holstered behind my right hip and moved toward the car. At the same time, Nina beat a quick rhythm on the roof of the Caddie, threw a wave to those inside, and started walking back toward where the Lexus was parked. She was smiling.\u003c/p\u003e\n\u003cp\u003e“What the hell do you think you’re doing?” I asked her.\u003c/p\u003e\n\u003cp\u003e“Chatting with the boys,” she answered in a cheerful voice. “Did you know, Arnaldo’s leg was broken in four places, poor thing. I told them that we weren’t actually looking for Juan Carlos just now, but if they wanted to keep following us to Illinois that was fine, too. I told them we would be staying at the AmericInn in Winona tonight, the one overlooking the river, if they should get lost. Hope you don’t mind.”\u003c/p\u003e\n\u003cp\u003eI did mind and told her so in no uncertain terms.\u003c/p\u003e\n\u003cp\u003e“Don’t ever do that again,” I said.\u003c/p\u003e\n\u003cp\u003eShe shrugged as if she would think about it, but not too hard.\u003c/p\u003e\n\u003cp\u003eA few minutes later we were in the Lexus heading south and not talking. Apparently the Cadillac DTS had turned around and gone home.\u003c/p\u003e\n\u003cp\u003ePrudence Johnson, one of my favorites, was on the CD player. She and a handful of composers had collaborated to turn fourteen poems by Edna St. Vincent Millay into a stunning jazz album called A Girl Named Vincent. One of the composers, Laura Caviani, played piano on most of the tracks.\u003c/p\u003e\n\u003cp\u003e“I’m going to buy you a piano,” I said. “A baby grand. A good one. Wherever we live, you and I, there has to be room for a piano.”\u003c/p\u003e\n\u003cp\u003e“Well,” Nina said. “It’s not a new car. Still…” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-65.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
