{"id":103413,"no":78,"title":"Page 78","content":"\u003cp\u003eLieutenant Pelzer’s brow knitted as if he were considering the many different ways he could respond to the question and finally said, “No signs of life, if that’s what you mean.”\u003c/p\u003e\n\u003cp\u003e“The wastebaskets weren’t just empty,” Special Agent Matthew Cooper said, “they were polished.”\u003c/p\u003e\n\u003cp\u003eWe stood watching as the boat strained gently against the springlines that secured it to the pier that accommodated customers of the Casa del Lago. Three thoughts came to mind—first, this is a damn expensive toy, and second, I should get one. The thought I gave voice to, however, was “Who reported it?”\u003c/p\u003e\n\u003cp\u003e“Ms. Mulally,” Pelzer said. “She said it was here when she arrived this morning to let the workers in. She seems upset.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“She won’t tell me. Maybe she’ll tell you.”\u003c/p\u003e\n\u003cp\u003e“I’ll talk to her.”\u003c/p\u003e\n\u003cp\u003ePelzer had been carrying a small package that he switched from one hand to the other. I didn’t ask what was inside.\u003c/p\u003e\n\u003cp\u003e“While you’re at it, old man Muehlenhaus won’t answer my questions, either, with or without an attorney present,” he said.\u003c/p\u003e\n\u003cp\u003e“I’ll try to talk to him, too.”\u003c/p\u003e\n\u003cp\u003e“Good, since that’s the only reason you’re not sitting in jail right now.” He raised and lowered his eyebrows Groucho Marx–style like he wanted to tell me something without actually speaking the words.\u003c/p\u003e\n\u003cp\u003e“I did thank you for that, right?” I asked.\u003c/p\u003e\n\u003cp\u003e“I don’t remember.”\u003c/p\u003e\n\u003cp\u003eWe left the dock and started moving toward the restaurant’s patio. We could hear the noise of construction inside the restaurant yet couldn’t see what was being built. Special Agent Zo’ Marin intercepted us.\u003c/p\u003e\n\u003cp\u003e“You boys get it figured out yet?” she asked.\u003c/p\u003e\n\u003cp\u003e“We were hoping you would explain it to us,” Cooper said. “Feminine intuition and all that.”\u003c/p\u003e\n\u003cp\u003eShe grinned as if she had heard it before.\u003c/p\u003e\n\u003cp\u003e“I just got off the phone.” To prove it, she slipped a smartphone into the pocket of her black jacket. I don’t know if she and Cooper intended to dress like Men in Black, yet they did. “A federal judge has agreed to temporarily freeze all of Navarre’s assets in the Lake Minnetonka Community Bank under Title Eighteen, Section Nineteen Fifty-seven.”\u003c/p\u003e\n\u003cp\u003e“Section Nineteen Fifty-seven?” I asked.\u003c/p\u003e\n\u003cp\u003e“It’s illegal for anyone to move the proceeds of a specified unlawful activity through a financial institution—or a merchant such as a boat dealership, for that matter—in an amount greater than ten thousand dollars. Navarre could appeal. He would probably win, too. This is a blatant violation of his rights; the man has yet to be formally charged with a crime. To appeal, though, would require that he appear in a federal court of law, and that would give us the chance to prove he’s actually David Maurell. In the meantime, FinCEN is backtracking the deposits. So far, we know they came from Banco Central de Espa?a in Madrid. Beyond that…”\u003c/p\u003e\n\u003cp\u003e“How much of Navarre’s money is in Minnetonka Community?” I asked.\u003c/p\u003e\n\u003cp\u003e“Thirteen million.”\u003c/p\u003e\n\u003cp\u003e“That’s ten million euros.”\u003c/p\u003e\n\u003cp\u003e“So it is.”\u003c/p\u003e\n\u003cp\u003eFor a moment I felt a thrill of panic that started below my heart and spread outward.\u003c/p\u003e\n\u003cp\u003e“Jeezus,” I said. “What if we’re wrong? What if he really is Juan Carlos Navarre?”\u003c/p\u003e\n\u003cp\u003e“Then the United States government will apologize profusely.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, that’s your problem,” I said. “Right now my big concern is Riley Brodin. If she’s with Navarre, then she’s in danger.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Pelzer said.\u003c/p\u003e\n\u003cp\u003e“Didn’t Greg Schroeder call you?”\u003c/p\u003e\n\u003cp\u003e“I don’t know him.”\u003c/p\u003e\n\u003cp\u003e“Dammit. Schroeder’s a PI who works for Mr. Muehlenhaus. He was supposed to tell you—I don’t believe it.”\u003c/p\u003e\n\u003cp\u003eI explained what Schroeder was supposed to tell Pelzer.\u003c/p\u003e\n\u003cp\u003e“Now I know why Muehlenhaus won’t answer my questions,” he said. “He thinks he’s protecting his granddaughter.”\u003c/p\u003e\n\u003cp\u003e“His granddaughter or the Muehlenhaus legacy?”\u003c/p\u003e\n\u003cp\u003e“What’s that mean?”\u003c/p\u003e\n\u003cp\u003e“It’s complicated. Listen, we need to assume that Baird is still after Navarre and that Navarre is now traveling with Riley.”\u003c/p\u003e\n\u003cp\u003e“Legally,” Pelzer said. “They’re traveling legally, so you know there’s nothing we can do about it.”\u003c/p\u003e\n\u003cp\u003e“I know,” I said, and for a moment I felt the frustration of all those people who had asked for help when I was police, only to be told that “nothing could be done,” that we couldn’t search for someone unless there was clear evidence that a crime had been committed “We’ve sent out e-briefs on Baird,” Pelzer said. “But…”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know.”\u003c/p\u003e\n\u003cp\u003e“What?” Cooper asked.\u003c/p\u003e\n\u003cp\u003e“There’s no system set in place that we can use to alert law enforcement statewide, let alone nationally,” Pelzer said. “We have a system called the e-brief to spread information, which is just that—e-mail briefings that target specific local and county police in the areas where we think the suspect might be. Any suggestions on where Baird might be?”\u003c/p\u003e\n\u003cp\u003e“What about the FBI?” I said. “They must have a better system.”\u003c/p\u003e\n\u003cp\u003eMarin chuckled at that. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-may-care-mac-mckenzie-11/page-78.html","bookId":2216,"creation":"Oct 5, 2019 10:25:49 PM","modification":"Oct 5, 2019 10:25:49 PM"}
