{"id":110282,"no":14,"title":"Page 14","content":"\u003cp\u003eAlek gripped the control saunters and took a first step.\u003c/p\u003e\n\u003cp\u003eVolger\u0027s boot pressed his left shoulder softly, and Alek nudged the walker leftward. It was annoying, being controlled like a puppet, but from topside the count had a better view.\u003c/p\u003e\n\u003cp\u003e\"Easy now,\" Klopp said as the walker leaned forward. The path led steeply downhill, into the long, narrow valley that the Herkules guarded. \"Short steps.\"\u003c/p\u003e\n\u003cp\u003eAlek nodded, his grip tightening as the walker skidded down the slope a little.\u003c/p\u003e\n\u003cp\u003e\"Drop the rear anchor, Hoffman,\" Klopp said into the intercom.\u003c/p\u003e\n\u003cp\u003eA rattle of unwinding chain came from behind them. Alek felt the tug of the anchor as it cut through roots and undergrowth, dragged along like a child\u0027s toy.\u003c/p\u003e\n\u003cp\u003e\"Bothersome, I know,\" Klopp said. \"But this way we won\u0027t roll if we fall.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going to fall,\" Alek said, his hands tight on the saunters. With the engines at quarter power, the massive feet moved slowly - like walking in syrup.\u003c/p\u003e\n\u003cp\u003eThe moon was just beginning to rise, and through the viewport Alek could see nothing but a dark confusion of branches. Volger\u0027s boots nudged him left and right with no apparent pattern, the walker\u0027s feet snagging on roots and underbrush. It was like being led, blindfolded and barefoot, across a room covered with mousetraps.\u003c/p\u003e\n\u003cp\u003eFinally they reached the valley floor, and Klopp rolled up the anchor. Alek still couldn\u0027t see anything but the branches thwacking against the open viewport, scattering leaves across the control panel. He wondered if they were stirring the treetops overhead, like a fish moving below the surface of a pond.\u003c/p\u003e\n\u003cp\u003eHis mind began to buzz with doubts. Perhaps they should have picked a windy night to try this. Or why not wait for a rainstorm? Or the darkness of the new moon?\u003c/p\u003e\n\u003cp\u003eWith a sudden clang of boots on metal, Volger dropped into the pilot\u0027s cabin.\u003c/p\u003e\n\u003cp\u003e\"Get us down!\"\u003c/p\u003e\n\u003cp\u003eAlek reached for the control panel, but Klopp\u0027s hands were faster - a hissing filled the cabin as the walker settled lower in the trees.\u003c/p\u003e\n\u003cp\u003eMoments later a blinding light swept across them.\u003c/p\u003e\n\u003cp\u003eThe searchlight lingered a few seconds, then drifted into the forest ahead, continuing its lazy path among the trees.\u003c/p\u003e\n\u003cp\u003e\"Get us moving again,\" Volger said. \"They\u0027ll look elsewhere now.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid it may be a moment,\" Klopp said, his eyes on the gauges.\u003c/p\u003e\n\u003cp\u003e\"Our engines are barely running,\" Alek explained. \"Building our knee pressure back up will take time.\" He leaned back and stretched his fingers, happy for a break. He was starting to wish the frigate would spot them and give chase. A good run would be better than creeping through the dark at quarter speed.\u003c/p\u003e\n\u003cp\u003eThe belly hatch opened, and Hoffman\u0027s head emerged.\u003c/p\u003e\n\u003cp\u003e\"Pardon me, sirs. But do you hear that?\"\u003c/p\u003e\n\u003cp\u003eThey all listened for a moment, and Alek\u0027s ears caught a rushing sound below the engine\u0027s rumble.\u003c/p\u003e\n\u003cp\u003e\"A stream?\" he asked.\u003c/p\u003e\n\u003cp\u003eHoffman grinned. \"A noisy one, sir. Noisier than us, anyway.\"\u003c/p\u003e\n\u003cp\u003e\"Excellent,\" Alek said, sitting up. \"Up to half speed, Master Klopp?\"\u003c/p\u003e\n\u003cp\u003eKlopp listened for another moment, then nodded.\u003c/p\u003e\n\u003cp\u003eSoon the Stormwalker was splashing down the stream, its engine noise mixing with the rush of water. The moon was higher now, the path shimmering in front of them. Volger was still up top watching for searchlights, but at least he wasn\u0027t standing on Alek\u0027s shoulders anymore.\u003c/p\u003e\n\u003cp\u003eThe spray from the stream was icy; snow must still have been melting up in the mountains, even now in early August. Alek wondered how long they would have to stay in the Alps. He hoped Volger\u0027s mysterious preparations included a cabin with a warm fire.\u003c/p\u003e\n\u003cp\u003eThe ground began to climb. They were nearing the rise where the land frigate stood guard. Alek lowered the engines back to quarter speed, and the Stormwalker became maddeningly lead-footed again. There were no sounds except the calls of night birds, the splashing of giant metal feet, and the babble of the stream.\u003c/p\u003e\n\u003cp\u003eThen a boot hit the back of his chair with a thump. \"Volger! What are you - \"\u003c/p\u003e\n\u003cp\u003eSomething flashed in the darkness ahead. Alek froze, the walker pausing halfway through a step. He peered into the darkness.\u003c/p\u003e\n\u003cp\u003e\"Should I shut the engines down?\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" Klopp said. \"If they\u0027ve spotted us, we\u0027ll need power.\"\u003c/p\u003e\n\u003cp\u003eVolger swung down from the hatch. \"Germans! On foot, a hundred meters ahead. They haven\u0027t seen us. Not yet, anyway.\"\u003c/p\u003e\n\u003cp\u003eAlek swore softly, his hands flexing on the controls. He wondered which was worse, being spotted or sitting here frozen, like a rabbit waiting for a hawk to swoop. He leaned closer to the viewport, shielding his eyes. Something metal flashed in the darkness, and then he heard a shout.\u003c/p\u003e\n\u003cp\u003e\"I think they just ...,\" he began.\u003c/p\u003e\n\u003cp\u003eSplashes of water sparkled white in the moonlight -\u0026nbsp;\u0026nbsp;a squad of infantrymen was running across the stream, shouting. One knelt on the bank and raised his rifle.\u003c/p\u003e\n\u003cp\u003e\"... noticed us,\" Alek finished as a crack rang out. The bullet struck metal somewhere on the walker\u0027s body.\u003c/p\u003e\n\u003cp\u003e\"Prepare to fire!\" Klopp called through the intercom.\u003c/p\u003e\n\u003cp\u003e\"No!\" Alek said as his hands flicked across the controls.\u003c/p\u003e\n\u003cp\u003e\"Alek\u0027s right,\" Count Volger said. \"Those rifles might perk up the frigate\u0027s ears, but a cannon shot will remove all doubt. Just go through them.\"\u003c/p\u003e\n\u003cp\u003eThe engines came to a roar beneath him, and Alek pushed the saunters forward. The Stormwalker\u0027s huge feet stretched out, splashing through the shallow water.\u003c/p\u003e\n\u003cp\u003eThey charged up the stream, scattering the Germans like tenpins. A few bullets pinged off the armor as they passed, but Alek didn\u0027t bother to order the viewport closed. Vision was more precious than safety.\u003c/p\u003e\n\u003cp\u003eNo stumbles now, no mistakes or they\u0027d all be caught.\u003c/p\u003e\n\u003cp\u003eThe moon had cleared the trees, the water shimmering in their path. A smile grew on Alek\u0027s face as he brought the Stormwalker into a run. Let the frigate try and catch them now.\u003c/p\u003e\n\u003cp\u003eNo one could night-walk like him.\u003c/p\u003e\n\u003cp\u003eEIGHTEEN\u003c/p\u003e\n\u003cp\u003eTHE FLARES CAME FIRST.\u003c/p\u003e\n\u003cp\u003eThey screamed across the sky, burning phosphorous spilling a cold blue light into the darkness. The icy spray from the Stormwalker\u0027s footsteps glittered like diamonds scattered in the air.\u003c/p\u003e\n\u003cp\u003eMore flares flew overhead, until the sky glowed with a dozen suns.\u003c/p\u003e\n\u003cp\u003eFlares and fireworks - not such secret weapons after all.\u003c/p\u003e\n\u003cp\u003e\"Into the forest!\" Klopp shouted.\u003c/p\u003e\n\u003cp\u003eAlek twisted the saunters hard, and the walker climbed the bank of the stream in a single step. It was darker up in the trees, the shadows shifting and dancing as the flares raced overhead.\u003c/p\u003e\n\u003cp\u003eBut there were no more rifle shots, no thud of cannon fire.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening, Count?\" Klopp shouted.\u003c/p\u003e\n\u003cp\u003e\"The frigate is turning,\" Volger called down. \"She looks sluggish.\"\u003c/p\u003e\n\u003cp\u003e\"Perfect!\" Klopp said. \"We caught her engines cold.\"\u003c/p\u003e\n\u003cp\u003e\"But why isn\u0027t she firing?\" Alek asked, veering the Stormwalker around an outcrop of bare rocks.\u003c/p\u003e\n\u003cp\u003e\"Good question, young master. Perhaps they intend to capture you alive.\"\u003c/p\u003e\n\u003cp\u003eAlek raised an eyebrow. \"Well, that\u0027s reassuring.\"\u003c/p\u003e\n\u003cp\u003eThe ground became steeper beneath them, the walker\u0027s engines straining. Wider spaces opened up among the trees as the slope increased. It made walking easier, but Alek felt exposed in the jittery light of the flares.\u003c/p\u003e\n\u003cp\u003e\"Which way to more cover?\" Klopp called up.\u003c/p\u003e\n\u003cp\u003eVolger lowered himself into the cabin. \"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\" Klopp cried.\u003c/p\u003e\n\u003cp\u003e\"The frigate isn\u0027t our immediate problem.\" Volger leaned down next to Alek. \"Bring us around. You need to see them. And load that cannon!\" he shouted down the belly hatch.\u003c/p\u003e\n\u003cp\u003eAlek brought the walker into a tight turn.\u003c/p\u003e\n\u003cp\u003eFrom up here on the unsheltered slope, he could see the frigate on its hill, the eight legs slowly flexing as it awoke. Its gun turrets had already spun around, but Alek could see why they hadn\u0027t fired yet.\u003c/p\u003e\n\u003cp\u003eClimbing the slope behind them were a half dozen walkers unlike anything Alek had ever seen. They were four-legged craft, with a galloping stride like metal horses. A single crewman rode half inside each one, his head and shoulders emerging like a centaur\u0027s. The scout walkers\u0027 single headlights danced through the trees like fireflies.\u003c/p\u003e\n\u003cp\u003eTheir only weapons were small mortar tubes mounted on the rear of the machines. As Alek watched, one blossomed with a cloud of smoke, shooting another flare into the radiant sky.\u003c/p\u003e\n\u003cp\u003e\"Some new kind of scout,\" Klopp murmured.\u003c/p\u003e\n\u003cp\u003e\"And perfect for tracking the likes of us,\" Volger said.\u003c/p\u003e\n\u003cp\u003eAlek frowned. \"But those mortars won\u0027t even scratch us!\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t have to,\" Klopp said, \"as long as they keep us in sight. The frigate will be moving sooner or later.\"\u003c/p\u003e\n\u003cp\u003e\"So what do we do?\" Alek said, hands clenching the saunters. \"Fight them now, while she\u0027s still warming up?\"\u003c/p\u003e\n\u003cp\u003eKlopp thought for a moment. \"No, keep moving. Maybe you can get us to the border faster than they expect.\"\u003c/p\u003e\n\u003cp\u003eAlek turned the walker back around and started up the slope again. He heard Volger preparing the Spandaus. The scout walkers\u0027 pilots were only half covered with armor. A few machine-gun bursts might make them think twice about following too closely.\u003c/p\u003e\n\u003cp\u003eA sudden red glare filled the Stormwalker\u0027s cabin, along with a choking wave of smoke. Alek squinted through the haze - a still-burning flare skittered away across the ground.\u003c/p\u003e\n\u003cp\u003eHe coughed into a fist. \"They\u0027re shooting flares at us now? Are they mad?\"\u003c/p\u003e\n\u003cp\u003e\"It is a bit pathetic,\" Klopp said. \"But I\u0027ll close the viewport.\"\u003c/p\u003e\n\u003cp\u003eAlek nodded. The thought of burning phosphorous bouncing around the cabin was unnerving. He hardly needed the viewport open; it was still as bright as day outside.\u003c/p\u003e\n\u003cp\u003eBut one thing was odd. The sky was lit a cold blue, but the flare that had just missed them had burned bright red.\u003c/p\u003e\n\u003cp\u003eAs the viewport cranked closed, another flare rocketed past - also red - missing the Stormwalker by a hair.\u003c/p\u003e\n\u003cp\u003eVolger started up with one of the machine guns, filling the cabin with the roar of gunfire and still more smoke. Shell casings clattered down onto the metal deck, rolling back and forth underfoot as the walker lurched along.\u003c/p\u003e\n\u003cp\u003eAnother red flare whizzed past, spitting smoke and sparks. Alek\u0027s eyes were beginning to sting, and his vision blurred with tears.\u003c/p\u003e\n\u003cp\u003e\"Otto, take over!\"\u003c/p\u003e\n\u003cp\u003eKlopp grabbed the saunters, and Alek searched blindly for his canteen. He drained it onto his face, washing the smoke from his eyes.\u003c/p\u003e\n\u003cp\u003eA metal clang shuddered through the cabin.\u003c/p\u003e\n\u003cp\u003e\"Did you hit something?\" Alek asked, blinking the water away.\u003c/p\u003e\n\u003cp\u003eKlopp shook his head. \"Hardly. It\u0027s light enough out there!\"\u003c/p\u003e\n\u003cp\u003eAlek frowned, feeling the machine rumble beneath him. The walker\u0027s steps were steady on the slope, and the gauges all flickered at normal levels.\u003c/p\u003e\n\u003cp\u003eExcept one - the temperature of the rear exhaust had suddenly jumped.\u003c/p\u003e\n\u003cp\u003eHe stood and pushed the top hatch open.\u003c/p\u003e\n\u003cp\u003e\"Alek!\" Volger said, turning from his machine gun. \"What are you doing?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/leviathan-leviathan-1/page-14.html","bookId":1574,"creation":"Oct 5, 2019 11:57:00 PM","modification":"Oct 5, 2019 11:57:00 PM"}
