{"id":104215,"no":101,"title":"Page 101","content":"\u003cp\u003e‘Damned cold, is what it is,’ Skorgen said in a growl. ‘Maybe we should turn round, Captain. That fleet never came after us anyway-we could head for Lether Mouth-’\u003c/p\u003e\n\u003cp\u003e‘And starve before we’re halfway there. No, Pretty, Second Maiden Fort’s an independent state now, and I’m finding that rather appealing. Besides, I’m curious. Aren’t you?’\u003c/p\u003e\n\u003cp\u003e‘Not enough to risk getting crushed by them white jaws, Captain.’\u003c/p\u003e\n\u003cp\u003e‘We’ll make it.’\u003c/p\u003e\n\u003cp\u003eThe foment that was the crest of the heaving bergs was the colour of old leather, shredded by the churning fragments of ice, tree roots, shattered trunks and huge broken rocks that seemed to defy the pull to the deep-at least for long enough to appear atop the water, like the leading edge of a slide, rolling on across the surface of the tumult before reluctantly vanishing into the depths.\u003c/p\u003e\n\u003cp\u003eTumbling out from this surge like rotted curtains was fog, plucked and torn by the ferocious winds, and Shurq Elalle, facing astern, watched as the maelstrom heaved in their wake. It was gaining, but not fast enough; they were moments from rounding the isle’s rocky headland, which looked to be formidable enough to shunt the ice aside, down its length.\u003c/p\u003e\n\u003cp\u003eAt least, she hoped so. If not, then Second Maiden’s harbour was doomed. Ami so is my ship and crew. As for herself, well, if she managed to avoid being crushed or frozen in place, she could probably work her way clear, maybe even clamber aboard for the long ride to the mainland’s coast.\u003c/p\u003e\n\u003cp\u003eIt won’t come to that. Islands don’t get pushed around. Buried, possibly, but then Vent Reach is where it’s all piling up\u003c/p\u003e\n\u003cp\u003e– what’s chasing us here is just an outer arm, and before long it’ll be fighting the tide. Errant fend, imagine what happened to the Edur homeland-that entire coast must have been chewed to pieces-or swallowed up entire. So what broke up the dam, that’s what I want to know:\u003c/p\u003e\n\u003cp\u003eGroaning, the Undying Gratitude rounded the point, the wind quickly dropping off as the ship settled and began its crawl into the high-walled harbour. A prison island indeed\u003c/p\u003e\n\u003cp\u003e– all the evidence remained: the massive fortifications, the towers with lines of sight and fire arcs facing both to sea and inland. Huge ballistae, mangonels and scorpions mounted on every available space, and in the harbour itself rock-pile islands held miniature forts festooned with signal flags, fast ten-man pursuit galleys moored alongside.\u003c/p\u003e\n\u003cp\u003eA dozen ships rode at anchor in the choppy waters. Along the docks, she saw, tiny figures were racing in every direction, like ants on a kicked nest. ‘Pretty, have us drop anchor other side of that odd-looking dromon. Seems like nobody’s going to pay us much attention-hear that roar? That’s the northwest shore getting hit.’\u003c/p\u003e\n\u003cp\u003e‘The whole damned island could go under, Captain.’\u003c/p\u003e\n\u003cp\u003e‘That’s why we’re staying aboard-to see what happens. If we have to run east, I want us ready to do so.’\u003c/p\u003e\n\u003cp\u003e‘Look, there’s a harbour scow comin’ our way.’\u003c/p\u003e\n\u003cp\u003eDamn. ‘Typical. World’s falling in but that don’t stop the fee-takers. All right, prepare to receive them.’\u003c/p\u003e\n\u003cp\u003eThe anchor had rattled down by the time the scow fought its way alongside. Two officious-looking women climbed aboard, one tall, the other short. The latter spoke first. ‘Who’s the captain here and where d’you hail from?’\u003c/p\u003e\n\u003cp\u003e‘I am Captain Shurq Elalle. We’ve come up from Letheras. Twenty months at sea with a hold full of goods.’\u003c/p\u003e\n\u003cp\u003eThe tall woman, thin, pale, with stringy blonde hair, smiled. ‘Very accommodating of you, dear. Now, if you’ll be so kind, Brevity here will head down into the hold to inspect the cargo.’\u003c/p\u003e\n\u003cp\u003eThe short dark-haired woman, Brevity, then said, ‘And Pithy here will collect the anchoring fee.’\u003c/p\u003e\n\u003cp\u003e‘Fifteen docks a day.’\u003c/p\u003e\n\u003cp\u003e‘That’s a little steep!’\u003c/p\u003e\n\u003cp\u003e‘Well,’ Pithy said with a lopsided shrug, ‘it’s looking like the harbour’s days are numbered. We’d best get what we can.’\u003c/p\u003e\n\u003cp\u003eBrevity was frowning at Shurq’s first mate. ‘You wouldn’t be Skorgen Kaban the Pretty, would you?’\u003c/p\u003e\n\u003cp\u003e‘Aye, that’s me.’\u003c/p\u003e\n\u003cp\u003e‘I happen to have your lost eye, Skorgen. In a jar.’\u003c/p\u003e\n\u003cp\u003eThe man scowled across at Shurq Elalle, then said, ‘You and about fifty other people.’\u003c/p\u003e\n\u003cp\u003e‘What? But I paid good money for that! How many people lose an eye sneezing? By the Errant, you’re famous!’\u003c/p\u003e\n\u003cp\u003e‘Sneeze is it? That’s what you heard? And you believed it? Spirits of the deep, lass, and you paid the crook how much?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-101.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
