{"id":104217,"no":103,"title":"Page 103","content":"\u003cp\u003e‘Now there’s a succinct report,’ Shurq Elalle said. ‘Brevity, be sure to inform the harbour master that we wish a berth at one of the stone piers, to better effect unloading our cargo. A messenger out to potential buyers might also prove… rewarding.’ She glanced at Pithy, then away, as she added, ‘As for mooring and landing fees, I will settle up with the harbour master directly, once I have negotiated the master’s commission.’\u003c/p\u003e\n\u003cp\u003e‘You think you’re smart,’ Pithy snapped. ‘I should have brought a squad with me-how would you have liked that, Captain? Poking in here and there, giving things a real look. How would you like that?’\u003c/p\u003e\n\u003cp\u003e‘Brevity, who rules Second Maiden?’ Shurq Elalle asked.\u003c/p\u003e\n\u003cp\u003e‘Shake Brullyg, Captain. He’s Grand Master of the Putative Assembly.’\u003c/p\u003e\n\u003cp\u003e‘The Putative Assembly? Are you sure you have the right word there, lass? Putative?’\u003c/p\u003e\n\u003cp\u003e‘That’s what I said. That’s right, isn’t it, Pithy?’\u003c/p\u003e\n\u003cp\u003e‘The captain thinks she’s smart, but she’s not so smart, is i she? Wait until she meets Shake Brullyg, then won’t she be surprised-’\u003c/p\u003e\n\u003cp\u003e‘Not really,’ Shurq said. ‘I happen to know Shake Brullyg. I even know the crime for which he was sent away. The only surprise is that he’s still alive.’\u003c/p\u003e\n\u003cp\u003e‘Nobody kills Shake Brullyg easily,’ Pithy said.\u003c/p\u003e\n\u003cp\u003eOne of the crew burst into a laugh that he quickly converted into a cough.\u003c/p\u003e\n\u003cp\u003e‘We’ll await the harbour master’s response,’ Shurq Elalle said.\u003c/p\u003e\n\u003cp\u003ePithy and Brevity returned to their scow, the former taking the oars.\u003c/p\u003e\n\u003cp\u003e‘Strange women,’ Skorgen Kaban muttered as they watched the wallowing craft pull away.\u003c/p\u003e\n\u003cp\u003e‘An island full of inbred prisoners,’ Shurq replied in a murmur. ‘Are you at all surprised, Pretty? And if that’s not enough, a full-blooded Shake-who just happens to be I completely mad-is ruling the roost. I tell you this, our stay should be interesting.’\u003c/p\u003e\n\u003cp\u003e‘I hate interesting.’\u003c/p\u003e\n\u003cp\u003e‘And probably profitable.’\u003c/p\u003e\n\u003cp\u003e‘Oh, good. I like profitable. I can swallow interesting so long as it’s profitable.’\u003c/p\u003e\n\u003cp\u003e‘Get the hands ready to ship the anchor. I doubt we’ll have to wait overlong for the harbour master’s signal flag.’\u003c/p\u003e\n\u003cp\u003e‘Aye, Captain.’\u003c/p\u003e\n\u003cp\u003eUdinaas sat watching her clean and oil her sword. An Edur sword, set into her hands by a Tiste Edur warrior. All she needed now was a house so she could bury the damned thing. Oh yes, and the future husband’s fateful return. Now, maybe nothing was meant by it; just a helpful gesture by one of Fear’s brothers-the only Sengar brother Udinaas actually respected. Maybe, but maybe not.\u003c/p\u003e\n\u003cp\u003eThe interminable chanting droned through the stone walls, a sound even grimmer than the blunt grunting of Edur women at mourning. The Onyx Wizards were in consultation. If such an assertion held any truth then the priestly version of their language was incomprehensible and devoid of the rhythm normally found in both song and speech. And if it was nothing but chanting, then the old fools could not even agree on the tempo.\u003c/p\u003e\n\u003cp\u003eAnd he had thought the Tiste Edur strange. They were nothing compared to these Tiste Andii, who had carried dour regard to unhuman extremes.\u003c/p\u003e\n\u003cp\u003eIt was no wonder, though. The Andara was a crumbling blackstone edifice at the base of a refuse-cluttered gorge. As isolated as a prison. The cliff walls were honeycombed with caves, pocked with irregular chambers, like giant burst bubbles along the course of winding tunnels. There were bottomless pits, dead ends, passages so steep they could not be traversed without rope ladders. Hollowed-out towers rose like inverted spires through solid bedrock; while over subterranean chasms arched narrow bridges of white pumice, carved into amorphous shapes and set without mortar. In one place there was a lake of hardened lava, smoother than wind-polished ice, the obsidian streaked with red, and this was the Amass Chamber, where the entire population could gather-barefooted-to witness the endless wrangling of the Reve Masters, otherwise known as the Onyx Wizards.\u003c/p\u003e\n\u003cp\u003eMaster of the Rock, of the Air, of the Root, of the Dark Water, of the Night. Five wizards in all, squabbling over orders of procession, hierarchies of propitiation, proper hem-length of the Onyx robes and Errant knew what else. With these half-mad neurotics any burr in the cloth became a mass of wrinkles and creases.\u003c/p\u003e\n\u003cp\u003eFrom what Udinaas had come to understand, no more than fourteen of the half-thousand or so denizens-beyond the wizards themselves-were pure Tiste Andii, and of] those, only three had ever seen daylight-which they quaintly called the blinded stars-only three had ever climbed to the world above. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-103.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
