{"id":104220,"no":106,"title":"Page 106","content":"\u003cp\u003e‘What to blame? Well, how should I know? I’m just a worn-out slave. But if I had to guess, I’d look first at that rigid hierarchy I mentioned earlier. It traps everyone, and everyone makes sure it traps everyone else. Until none of you can move, not side to side, not up either. You can move down, of course-just do something no-one else likes. Disapproval kicks out every rung of the ladder, and down you go.’\u003c/p\u003e\n\u003cp\u003e‘So it is the way of living among the Tiste Edur.’ Fear snorted, looked away.\u003c/p\u003e\n\u003cp\u003e‘All right,’ Udinaas said, sighing, ‘let me ask you this. Why wasn’t that sword offered to some Letherii-a brilliant officer of an army, a cold-blooded merchant prince? Why not Ezgara himself? Or better still, his son, Quillas? Now there was ambition and stupidity in perfect balance. And if not a Letherii, then why not a Nerek shaman? Or a Fent or a Tarthenal? Of course, all those others, well, those tribes were mostly obliterated-at least, all the taboos, traditions and rules of every sort that kept people in line-all gone, thanks to the Letherii.’\u003c/p\u003e\n\u003cp\u003e‘Very well,’ Seren Pedac said, ‘why not a Letherii?’\u003c/p\u003e\n\u003cp\u003eUdinaas shrugged. ‘The wrong fatal flaws, obviously. The Chained One recognized the absolute perfection of the Tiste Edur-their politics, their history, their culture and their political situation.’\u003c/p\u003e\n\u003cp\u003e‘Now I understand,’ Fear murmured, his arms crossed.\u003c/p\u003e\n\u003cp\u003e‘Understand what?’\u003c/p\u003e\n\u003cp\u003e‘Why Rhulad so valued you, Udinaas. You were wasted scraping fish scales all day when by the measure of your intelligence and your vision, you could sit tall on any kingdom’s throne.’\u003c/p\u003e\n\u003cp\u003eThe slave’s grin was hard with malice. ‘Damn you, Fear Sengar.’\u003c/p\u003e\n\u003cp\u003e‘How did that offend you?’\u003c/p\u003e\n\u003cp\u003e‘You just stated the central argument-both for and against the institution of slavery. I was wasted, was I? Or of necessity kept under firm heel. Too many people like me on the loose and no ruler, tyrant or otherwise, could sit assured on a throne. We would stir things up, again and again. We would challenge, we would protest, we would defy. By being enlightened, we would cause utter mayhem. So, Fear, kick another basket of fish over here, it’s better for everyone.’\u003c/p\u003e\n\u003cp\u003e‘Except you.’\u003c/p\u003e\n\u003cp\u003e‘No, even me. This way, all my brilliance remains ineffectual, harmless to anyone and therefore especially to myself, lest my lofty ideas loose a torrent of blood.’\u003c/p\u003e\n\u003cp\u003eSeren Pedac grunted, ‘You are frightened by your own ideas, Udinaas?’\u003c/p\u003e\n\u003cp\u003e‘All the time, Acquitor. Aren’t you?’\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003e‘Listen,’ Fear said. ‘The chanting has stopped.’\u003c/p\u003e\n\u003cp\u003eAs usual, the debate ended with everyone losing. The clash of intractable views produced no harmony, just exhaustion and an ache in the back of the skull. Clip, seated with his legs propped up on the back of the next lower bench, in the gloom of the uppermost tier overlooking the absurdly named Disc of Concordance on which stood five glowering Onyx Wizards, struggled to awaken his mind as the wizards turned as one to face Silchas Ruin.\u003c/p\u003e\n\u003cp\u003eOrdant Brid, Reve of the Rock, who had sent Clip to retrieve these fell wanderers, was the first to speak. ‘Silchas Ruin, brother of blood to our Black-Winged Lord, we know what you seek.’\u003c/p\u003e\n\u003cp\u003e‘Then you also know not to get in my way.’\u003c/p\u003e\n\u003cp\u003eAt these cold words, Clip sat straighter.\u003c/p\u003e\n\u003cp\u003e‘It is as I warned!’ cried Rin Varalath, Reve of the Night, in his high-pitched, grating voice. ‘He arrives like a leviathan of destruction! Which of the brothers was gifted the greater share of deliberation and wisdom? Well, the answer is clear!’\u003c/p\u003e\n\u003cp\u003e‘Calm down,’ said Penith Vinandas.\u003c/p\u003e\n\u003cp\u003eClip smiled to himself, wondering yet again if the Reve aspects created the personalities of their masters-or, in the case of Penith, mistress-or was it the other way round? Of course the Mistress of the Root would advise calm, a settling of wild wills, for she was so assuredly… rooted.\u003c/p\u003e\n\u003cp\u003e‘I am calm!’ snarled Rin Varalath. He jabbed a finger at Silchas Ruin. ‘We must not yield to this one, else all that we have achieved will be brought down upon our very heads. The balance is all that keeps us alive, and each of you knows that. And if you do not, then you are more lost than I ever imagined.’\u003c/p\u003e\n\u003cp\u003eDraxos Hulch, Reve of the Dark Water, spoke in his depthless baritone. ‘The issue, my fellow wizards, is less open to debate than you would hope. Unless, of course, we can explain to this warrior the nature of our struggle and the uneasy balance we have but recently won.’\u003c/p\u003e\n\u003cp\u003e‘Why should he be interested?’ Rin Varalath asked. ‘If this all collapses it is nothing to him. He will move on, uncaring-our deaths will be meaningless as far as he is concerned.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-106.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
