{"id":104230,"no":117,"title":"Page 117","content":"\u003cp\u003eShe frowned. ‘It’s not that I hold to an unreasoning faith in the martial prowess of Karsa Orlong. There have been enough hints that the Emperor has fought other great champions, other warriors of formidable skill, and none could defeat him. Nonetheless, I admit to a feeling of. well, loyalty.’\u003c/p\u003e\n\u003cp\u003e‘Enough to join him at Hood’s Gate?’\u003c/p\u003e\n\u003cp\u003e‘I am not sure. In any case, don’t you imagine that we’re being watched? Don’t you think that others have tried to flee their fate?’\u003c/p\u003e\n\u003cp\u003e‘No doubt. But Samar Dev, to not even try…’\u003c/p\u003e\n\u003cp\u003e‘I will think on it, Taxilian. Now, I’ve changed my mind-that second carafe of wine will have to wait. Let us walk this fair city. I am of a mind to see this ruined temple for myself. We can gawk like the foreigners we are, and the Patriotists will think nothing of it.’ She rose from her seat.\u003c/p\u003e\n\u003cp\u003eTaxilian followed suit. ‘I trust you’ve already paid the proprietor.’\u003c/p\u003e\n\u003cp\u003e‘No need. Imperial largesse.’\u003c/p\u003e\n\u003cp\u003e‘Generosity towards the condemned-that runs contrary to my sense of this fell empire.’\u003c/p\u003e\n\u003cp\u003e‘Things are always more complex than they first seem.’\u003c/p\u003e\n\u003cp\u003eTracked by the eyes of a dozen patrons, the two left the restaurant.\u003c/p\u003e\n\u003cp\u003eThe sun devoured the last shadows in the sand-floored compound, heat rising in streaming waves along the length of the rectangular, high-walled enclosure. The sands had been raked and smoothed by servants, and that surface would remain unmarred until late afternoon, when the challengers in waiting would troop out to spar with each other and gather-those who shared a language-to chew and gnaw on these odd, macabre circumstances. Yet, leaning against a wall just within the inner entranceway, Taralack Veed watched Icarium move slowly alongside the compound’s outer wall, one hand out to brush with fingertips the bleached, dusty stone and its faded frieze.\u003c/p\u003e\n\u003cp\u003eOn that frieze, faded images of imperial heroes and glory-soaked kings, chipped and scarred now by the weapons of unmindful foreigners sparring with each other, each and every one of those foreigners intent upon the murder of the Emperor now commanding the throne.\u003c/p\u003e\n\u003cp\u003eThus, a lone set of footprints now, tracking along that wall, a shadow diminished to almost nothing beneath the tall, olive-skinned warrior, who paused to look skyward as a flock of unfamiliar birds skittered across the blue gap, then continued on until he reached the far end, where a huge barred gate blocked the way into the street beyond. The figures of guards were just visible beyond the thick, rust-pitted bars. Icarium halted facing that gate, stood motionless, the sunlight bleaching him as if the Jhag had just stepped out from the frieze on his left, as faded and worn as any hero of antiquity.\u003c/p\u003e\n\u003cp\u003eBut no, not a hero. Not in anyone’s eyes. Not ever. A weapon and nothing more. Yet… he lives, he breathes, and when something breathes, it is more than a weapon. Hot blood in the veins, the grace of motion, a cavort of thoughts and feelings in that skull, awareness like flames in the eyes. The Nameless Ones had knelt on the threshold of stone for too long. Worshipping a house, its heaved grounds, its echoing rooms-why not the living, breathing ones who might dwell within that house? Why not the immortal builders? A temple was hallowed ground not to its own existence but to the god it would honour. But the Nameless Ones did not see it that way. Worship taken to its absurd extreme… yet perhaps in truth as primitive as leaving an offering in a fold of rock, of blood-paint on that worn surface… oh, I am not the one for this, for thoughts that chill the marrow of my soul.\u003c/p\u003e\n\u003cp\u003eA Gral, cut and scarred by the betrayals. The ones that wait in every man’s shadow-for we are both house and dweller. Stone and earth. Blood and flesh. And so we will haunt the old rooms, walk the familiar corridors, until, turning a corner, we find ourselves facing a stranger, who can be none other than our most evil reflection.\u003c/p\u003e\n\u003cp\u003eAnd then the knives are drawn and a life’s battle is waged, year after year, deed after deed. Courage and vile treachery, cowardice and bright malice.\u003c/p\u003e\n\u003cp\u003eThe stranger has driven me back, step by step. Until I no longer know myself-what sane man would dare recognize his own infamy? Who would draw pleasure from the sensation of evil, satisfaction from its all too bitter rewards? No, instead we run with our own lies-do 1 not utter my vows of vengeance each dawn? Do 1 not whisper my curses against all those who wronged me?\u003c/p\u003e\n\u003cp\u003eAnd now I dare judge the Nameless Ones, who would wield one evil against another. And what of my place in this dread scheme?\u003c/p\u003e\n\u003cp\u003eHe stared across at Icarium, who still faced the gate, who stood like a statue, blurred behind ripples of heat. My stranger. Yet which one of us is the evil one?\u003c/p\u003e\n\u003cp\u003eHis predecessor, Mappo-the Trell-had long ago left such struggles behind, Taralack suspected. Choosing to betray the Nameless Ones rather than this warrior before the gate. An evil choice? The Gral was no longer so sure of his answer. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-117.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
