{"id":104132,"no":12,"title":"Page 12","content":"\u003cp\u003eShe smiled. Are you, Overseer? Still?’\u003c/p\u003e\n\u003cp\u003e‘What do you mean?’\u003c/p\u003e\n\u003cp\u003e‘There are Hiroth in Drene-yes, you have met them. Each claims kinship with the Emperor, and upon that claim they have commandeered the finest estates and land. They have hundreds of Indebted as slaves. Soon, perhaps, there will be Tiste Edur among the membership of the Liberty Consign.’\u003c/p\u003e\n\u003cp\u003eBrohl Handar frowned. On a distant ridge stood three Awl dogs, two drays and one smaller cattle dog, watching as the herds were driven through the destroyed encampment-the livestock bawling in the stench of spilled blood and wastes. He studied the three silhouettes on the ridge. Where would they go now, he wondered. ‘I have seen enough.’ He tugged his horse round, too tight on the reins, and the beast’s head snapped up and it snorted, backing as it turned. Brohl struggled to keep his balance.\u003c/p\u003e\n\u003cp\u003eIf the Atri-Preda was amused she was wise enough not to show it.\u003c/p\u003e\n\u003cp\u003eIn the sky overhead, the first carrion birds had appeared,\u003c/p\u003e\n\u003cp\u003eThe South Jasp River, one of the four tributaries of Lether River leading down from the Bluerose Mountains, was flanked on its south bank by a raised road that, a short distance ahead, began its long climb to the mountain pass, beyond which lay the ancient kingdom of Bluerose, now subject to the Letherii Empire. The South Jasp ran fast here, the momentum of its savage descent from the mountains not yet slowed by the vast plain it now found itself crossing. The icy water pounded over huge boulders left behind by long-extinct glaciers, flinging bitter-cold mist into the air that drifted in clouds over the road.\u003c/p\u003e\n\u003cp\u003eThe lone figure awaiting the six Tiste Edur warriors and their entourage was if anything taller than any Edur, yet thin, wrapped in a black sealskin cloak, hood raised. Two baldrics criss-crossed its chest, from which hung two Letherii longswords, and the few wisps of long white hair that had pulled free in the wind were now wet, adhering to the collar of the cloak.\u003c/p\u003e\n\u003cp\u003eTo the approaching Merude Edur, the face within that cowl looked pallid as death, as if a corpse had just dragged itself free of the numbing river, something long frozen in the white-veined reaches of the mountains that awaited them.\u003c/p\u003e\n\u003cp\u003eThe lead warrior, a veteran of the conquest of Letheras, gestured for his comrades to halt then set out to speak to the stranger. In addition to the other five Edur, there were ten Letherii soldiers, two burdened wagons, and forty slaves shackled one to the next in a line behind the second wagon.\u003c/p\u003e\n\u003cp\u003e‘Do you wish company,’ the Merude asked, squinting to see more of that shadowed face, ‘for the climb to the pass? It’s said there remain bandits and renegades in the heights beyond.’\u003c/p\u003e\n\u003cp\u003e‘I am my own company.’\u003c/p\u003e\n\u003cp\u003eThe voice was rough, the accent archaic.\u003c/p\u003e\n\u003cp\u003eThe Merude halted three paces away. He could see more of that face, now. Edur features, more or less, yet white as snow. The eyes were… unnerving. Red as blood. ‘Then why do you block our path?’\u003c/p\u003e\n\u003cp\u003e‘You captured two Letherii two days back. They are mine.’\u003c/p\u003e\n\u003cp\u003eThe Merude shrugged. ‘Then you should have kept them chained at night, friend. These Indebted will run at any opportunity. Fortunate for you that we captured them. Oh, yes-of course I will return them into your care. At least the girl-the man is an escaped slave from the Hiroth, or so his tattoos reveal. A Drowning awaits him, alas, but I will consider offering you a replacement. In any case, the girl, young as she is, is valuable. I trust you can manage the cost of retrieving her.’\u003c/p\u003e\n\u003cp\u003e‘I will take them both. And pay you nothing.’\u003c/p\u003e\n\u003cp\u003eFrowning, the Merude said, ‘You were careless in losing them. We were diligent in recapturing them. Accordingly, we expect compensation for our efforts, just as you should expect a certain cost for your carelessness.’\u003c/p\u003e\n\u003cp\u003e‘Unchain them,’ the stranger said.\u003c/p\u003e\n\u003cp\u003e‘No. What tribe are you?’ The eyes, still fixed unwavering upon his own, looked profoundly… dead. ‘What has happened to your skin?’ As dead as the Emperor’s. ‘What is your name?’\u003c/p\u003e\n\u003cp\u003e‘Unchain them now.’\u003c/p\u003e\n\u003cp\u003eThe Merude shook his head, then he laughed-a little weakly-and waved his comrades forward as he began drawing his cutlass.\u003c/p\u003e\n\u003cp\u003eDisbelief at the absurdity of the challenge slowed his effort. The weapon was halfway out of its scabbard when one of the stranger’s longswords flashed clear of its sheath and opened the Edur’s throat.\u003c/p\u003e\n\u003cp\u003eShouting in rage, the other five warriors drew their blades and rushed forward, while the ten Letherii soldiers quickly followed suit.\u003c/p\u003e\n\u003cp\u003eThe stranger watched the leader crumple to the ground, blood spurting wild into the river mist descending onto the road. Then he unsheathed his other longsword and stepped to meet the five Edur. A clash of iron, and all at once the two Letherii weapons in the stranger’s hands were singing, a rising timbre with every blow they absorbed. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-12.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
