{"id":104233,"no":120,"title":"Page 120","content":"\u003cp\u003e‘A false god-what is false about it?’\u003c/p\u003e\n\u003cp\u003e‘I am a monk of the Unified Sects of Cabal, and it now seems necessary that I explain the nature of my religion. Among the people of Cabal there are three thousand and twelve sects. These sects are devoted, one and all, to the One God. In the past, terrible civil wars plagued the islands of Cabal, as each sect fought for domination of both secular and spiritual matters. Not until the Grand Synod of New Year One was peace secured and formalized for every generation to come. Hence, the Unified Sects. The solution to the endless conflicts was, it turned out, brilliantly simple. “Belief in the One God occludes all other concerns.”‘\u003c/p\u003e\n\u003cp\u003e‘How could there be so many sects and only one god?’\u003c/p\u003e\n\u003cp\u003e‘Ah. Well, you must understand. The One God writes nothing down. The One God has gifted its children with language and thought in the expectation that the One God’s desires be recorded by mortal hands and interpreted by mortal minds. That there were three thousand and twelve sects at New Year One is only surprising in that there were once tens of thousands, resulting from a previous misguided policy of extensive education provided to every citizen of Cabal-a policy since amended in the interests of unification. There is now one college per sect, wherein doctrine is formalized. Accordingly, Cabal has known twenty-three months of uninterrupted peace.’\u003c/p\u003e\n\u003cp\u003eYan Tovis studied the small man, the dancing eyes, the absurd mask of paint. ‘And which sect doctrine did you learn, Senior Assessor?’\u003c/p\u003e\n\u003cp\u003e‘Why, that of the Mockers.’\u003c/p\u003e\n\u003cp\u003e‘And their tenet?’\u003c/p\u003e\n\u003cp\u003e‘Only this: the One God, having written nothing down, having left all matters of interpretation of faith and worship to the unguided minds of over-educated mortals, is unequivocally insane.’\u003c/p\u003e\n\u003cp\u003e‘Which, I suppose, is why your mask shows wild laughter-’\u003c/p\u003e\n\u003cp\u003e‘Not at all. We of the Mockers are forbidden laughter, for that is an invitation to the hysteria afflicting the One God. In the Holy Expression adorning my face you are granted a true image of the One Behind the Grand Design, in so far as our sect determines such.’ The monk suddenly clasped his hands beneath his chin. ‘Now, our poor soldier has suffered overlong as it is, whilst we digressed yet again. I have assessed the taint of a false god in the beleaguered mind of this wounded man. Accordingly, that false god must be driven out. Once this is done, I shall remove the blockages in the brain preventing self-repair, and so all imbalances will be redressed. The effects of said treatment will be virtually immediate and readily obvious.’\u003c/p\u003e\n\u003cp\u003eYan Tovis blinked. ‘You can truly heal him?’\u003c/p\u003e\n\u003cp\u003e‘Have I not said so?’\u003c/p\u003e\n\u003cp\u003e‘Senior Assessor.’\u003c/p\u003e\n\u003cp\u003e‘Yes?’\u003c/p\u003e\n\u003cp\u003e‘Are you aware of the purpose you are meant to serve here in Letheras?’\u003c/p\u003e\n\u003cp\u003e‘I believe I will be expected to meet the Emperor on a pitch, whereupon we shall endeavour to kill each other. Furthermore, I am led to understand that this Emperor cannot be slain with any measure of finality, cursed as he is by a false god-the very same false god who has afflicted this soldier here, by the way. Thus, it is my assessment that I will be killed in that contest, to the dismay of no-one and everyone.’\u003c/p\u003e\n\u003cp\u003eAnd your One God will not help you, a senior priest of its temple?’\u003c/p\u003e\n\u003cp\u003eThe man’s eyes glittered. ‘The One God helps no-one. After all, should it help one then it must help all, and such potentially universal assistance would inevitably lead to irreconcilable conflict, which in turn would without question drive the One God mad. As indeed it did, long ago.’\u003c/p\u003e\n\u003cp\u003eAnd that imbalance can never be redressed?’\u003c/p\u003e\n\u003cp\u003e‘You lead me to reassess you, Atri-Preda Yan Tovis. You are rather clever, in an intuitive way. I judge that your Ten Thousand Secretions flow even and clear, probably the result of remorseless objectivity or some similar blasphemy of the spirit-for which, I assure you, I hold no particular resentment. So, we share this question, which enunciates the very core of the Mockers’ Doctrine. It is our belief that, should every mortal in this realm achieve clarity of thought and a cogent regard of morality, and so acquire a profound humility and respect for all others and for the world in which they live, then the imbalance will be redressed, and sanity will return once more to the One God.’\u003c/p\u003e\n\u003cp\u003e‘Ah… I see.’\u003c/p\u003e\n\u003cp\u003e‘I am sure you do. Now, I believe a healing was imminent. A conjoining of the warrens of High Mockra and High Denul. Physiological amendment achieved by the latter. Expurgation of the taint and elimination of the blockages, via the former. Of course, said warrens are faint in their manifestation here in this city, for a variety of reasons. Nonetheless, I do indeed possess substantial talents, some of which are directly applicable to the matter at hand.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-120.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
