{"id":104247,"no":134,"title":"Page 134","content":"\u003cp\u003e‘Tehol Beddict,’ said Janath, ‘I am glad you are here.’\u003c/p\u003e\n\u003cp\u003e‘You are?’ both Bugg and Tehol asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, not meeting their eyes. ‘I was going mad-I thought I had already done so. Yathvanar-he beat me, he raped me… and told me of his undying love all the while. So, Tehol, you are as his opposite-harmless in your infatuation. You remind me of better days.’ She was silent for a long moment. ‘Better days.’\u003c/p\u003e\n\u003cp\u003eBugg and Tehol exchanged a look, then the manservant made his way down the ladder. From above he heard Tehol say, ‘Janath, are you not impressed with what I have done with my extensive education?’\u003c/p\u003e\n\u003cp\u003e‘It is a very fine roof, Tehol Beddict.’\u003c/p\u003e\n\u003cp\u003eNodding to himself, Bugg went in search of roasted chicken through clouds of acrid smoke. Surrounded on all sides by mindless clucking. Abyss take me, I might as well be in a temple…\u003c/p\u003e\n\u003cp\u003eThe morning sun pushed through the slats on the shutters, stretching ribbons of light across the long, heavy table dominating the council room. Wiping his hands with a cloth, Rautos Hivanar entered and moved to stand behind his chair at one end of the table. He set the cloth down and studied the arrayed faces turned towards him-and saw in more than one expressions of taut fear and anxiety.\u003c/p\u003e\n\u003cp\u003e‘My friends, welcome. Two matters on the agenda. We will first address the one that I suspect is foremost in your minds at the moment. We have reached a state of crisis-the dearth of hard coin, of silver, of gold, of cut gems and indeed of copper bars, is now acute. Someone is actively sabotaging our empire’s economy-’\u003c/p\u003e\n\u003cp\u003e‘We knew this was coming,’ interrupted Uster Taran. ‘Yet what measures were taken by the Consign? As far as I can see, none. Rautos Hivanar, as much on the minds of those assembled here is the question of your continued position as Master.’\u003c/p\u003e\n\u003cp\u003e‘I see. Very well, present to me your list of concerns in that regard.’\u003c/p\u003e\n\u003cp\u003eUster’s craggy face reddened. ‘List? Concerns? Errant take us, Rautos, have you not even set the Patriotists on the trail of this mad creature? Or creatures? Could this not be an effort from the outside-from one of the border kingdoms-to destabilize us prior to invasion?\u003c/p\u003e\n\u003cp\u003eNews of this Bolkando Conspiracy should have-’\u003c/p\u003e\n\u003cp\u003e‘A moment, please. One issue at a time, Uster. The Patriotists are indeed pursuing an investigation, without result to date. A general announcement to that effect, while potentially alleviating your anxieties, would have been, in my judgement, equally likely to trigger panic. Accordingly, I chose to keep the matter private. My own inquiries, in the meantime, have led me to eliminate external sources to this financial assault. The source, my friends, is here in Letheras-’\u003c/p\u003e\n\u003cp\u003e‘Then why haven’t we caught the bastard?’ demanded Druz Thennict, his head seeming to bob atop its long, thin neck.\u003c/p\u003e\n\u003cp\u003e‘The trails are most cleverly obscured, good Druz,’ said Rautos. ‘Quite simply, we are at war with a genius.’\u003c/p\u003e\n\u003cp\u003eFrom the far end of the table, Horul Rinnesict snorted, then said, ‘Why not just mint more coins and take the pressure off?’\u003c/p\u003e\n\u003cp\u003e‘We could,’ Rautos replied, ‘although it would not be easy. There is a fixed yield from the Imperial Mines and it is, of necessity, modest. And, unfortunately, rather inflexible. Beyond that concern, you might ask yourself: what would I do then, were I this saboteur? A sudden influx of new coin? If you sought to create chaos in the economy, what would you do?’\u003c/p\u003e\n\u003cp\u003e‘Release my hoard,’ Barrakta Ilk said in a growl, ‘setting off runaway inflation. We’d be drowning in worthless coin.’\u003c/p\u003e\n\u003cp\u003eRautos Hivanar nodded. ‘It is my belief that our saboteur cannot hide much longer. He or she will need to become overt. The key will lie in observing which enterprise is the first to topple, for it is there that his or her trail will become readily discernible.’\u003c/p\u003e\n\u003cp\u003e‘At which point,’ said Barrakta, ‘the Patriotists will pounce.’\u003c/p\u003e\n\u003cp\u003eAh, this leads me into the second subject. There has, I understand, been news from Drene-no, I have no specifics as yet, but it seems to have triggered something very much like panic among the Patriotists. Last night, here in Letheras, a number of unprecedented arrests occurred-’\u003c/p\u003e\n\u003cp\u003eUster laughed. ‘What could be unprecedented about the Patriotists arresting people?’\u003c/p\u003e\n\u003cp\u003e‘Well, foremost among them was the First Concubine.’\u003c/p\u003e\n\u003cp\u003eSilence around the table.\u003c/p\u003e\n\u003cp\u003eRautos Hivanar cleared his throat, working hard to keep the fury from his voice. ‘It seems Karos Invictad acted in haste, which, as I am sure you all know, is quite unlike him. As a result, things went awry. There was a clash, both inside and outside the Eternal Domicile, between the Patriotists and the Tiste Edur.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-134.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
