{"id":104261,"no":149,"title":"Page 149","content":"\u003cp\u003eWind heaves waves unseen in the shell a cup of promise unfulfilled the rank lie of salt that bites my tongue.\u003c/p\u003e\n\u003cp\u003eI dwelt by a sea, once etching histories along the endless strand in rolling scrolls of flotsam and weed.\u003c/p\u003e\n\u003cp\u003e– Rumours of the Sea Fisher kel Tath\u003c/p\u003e\n\u003cp\u003eThere had been rain in the afternoon, which was just as well since there wasn’t much value in burning the entire forest down and besides, he wasn’t popular at the best of times. They had mocked his antics, and they had said he stank, too, so much so that no-one ever came within reach of his huge, gnarled hands. Of course, had any of his neighbours done so, he might well have torn their limbs off to answer years of scorn and abuse.\u003c/p\u003e\n\u003cp\u003eOld Hunch Arbat no longer pulled his cart from farm to farm, from shack to shack, collecting the excrement with which he buried the idols of the Tarthenal gods that had commanded a mostly forgotten glade deep in the woods. The need had passed, after all. The damned hoary nightmares were dead.\u003c/p\u003e\n\u003cp\u003eHis neighbours had not appreciated Arbat’s sudden retirement, since now the stink of their wastes had begun to foul their own homes. Lazy wastrels that they were, they weren’t of a mind to deepen their cesspits-didn’t Old Hunch empty them out on a regular basis? Well, not any more.\u003c/p\u003e\n\u003cp\u003eThat alone might have been reason enough to light out. And Arbat would have liked nothing better than to just vanish into the forest gloom, never to be seen again. Walk far, yes, until he came to a hamlet or village where none knew him, where none even knew of him. Rainwashed of all odour, just some kindly, harmless old mixed-blood Tarthenal who could, for a coin or two, mend broken things, including flesh and bone.\u003c/p\u003e\n\u003cp\u003eWalk, then. Leaving behind the old Tarthenal territories, away from the weed-snagged statues in the overgrown glades. And maybe, even, away from the ancient blood of his heritage. Not all healers were shamans, were they? They’d not ask any awkward questions, so long as he treated them right, and he could do that, easy.\u003c/p\u003e\n\u003cp\u003eOld bastards like him deserved their rest. A lifetime of service. Propitiations, the Masks of Dreaming, the leering faces of stone, the solitary rituals-all done, now. He could walk his last walk, into the unknown. A hamlet, a village, a sun-warmed boulder beside a trickling stream, where he could settle back and ease his tortured frame and not move, until the final mask was pulled away…\u003c/p\u003e\n\u003cp\u003eInstead, he had woken in darkness, in the moments before false dawn, shaking as if afflicted with ague, and before his eyes had hovered the slowly shredding fragments of a most unexpected Dream Mask. One he had never seen before, yet a visage of terrifying power. A mask crazed with cracks, a mask moments from shattering explosively-\u003c/p\u003e\n\u003cp\u003eLying on his cot, the wood frame creaking beneath him as he trembled from head to foot, he waited for revelation.\u003c/p\u003e\n\u003cp\u003eThe sun was high overhead when he finally emerged from his shack. Banks of clouds climbed the sky to the west-an almost-spent storm coming in from the sea-and he set about his preparations, ignoring the rain when it arrived.\u003c/p\u003e\n\u003cp\u003eNow, with dusk fast approaching, Arbat collected a bundled cane of rushes and set one end aflame from the hearth. He fired his shack, then the woodshed, and finally the old barn wherein resided his two-wheeled cart. Then, satisfied that each building was truly alight, he shouldered the sack containing those possessions and supplies he would need, and set out onto the trail leading down to the road.\u003c/p\u003e\n\u003cp\u003eA grunt of surprise a short time later, on the road, as he ran into a score of villagers hurrying in a mob towards him. In their lead, the Factor, who cried out in relief upon seeing Arbat.\u003c/p\u003e\n\u003cp\u003e‘Thank the Errant you’re alive, Hunch!’\u003c/p\u003e\n\u003cp\u003eScowling, Arbat studied the man’s horsey face for a moment, then scanned the pale smudges of the other faces, hovering behind the Factor. ‘What is all this?’ he demanded.\u003c/p\u003e\n\u003cp\u003e‘A troop of Edur are staying at the inn tonight, Arbat. When word of the fires reached them they insisted we head up to help-in case the wood goes up, you see-’\u003c/p\u003e\n\u003cp\u003e‘The wood, right. So where are the meddlers now, then?’\u003c/p\u003e\n\u003cp\u003e‘They remained behind, of course. But I was ordered-’ the Factor paused, then leaned closer to peer up at Arbat. ‘Was it Vrager, then? The fool likes his fires, and is no friend of yours.’\u003c/p\u003e\n\u003cp\u003e‘Vrager? Could be. He’s been in the habit of sneaking in at night and pissing on my door. Doesn’t accept me being retired and all. Says I got a duty to cart away his shit.’\u003c/p\u003e\n\u003cp\u003e‘And so you do!’ someone growled from the mob behind the Factor. ‘Why else do we let you live here anyway?’\u003c/p\u003e\n\u003cp\u003e‘Well that’s a problem solved now, ain’t it?’ Arbat said grinning. ‘Vrager burned me out, so I’m leaving.’ He hesitated, then asked, ‘What business was this of the Edur. It’s just done rained-the chances of the blaze moving much ain’t worth the worry. Didn’t you tell them my place is cleared back eighty, a hundred paces on all sides? And there’s the old settling pools-good as a moat.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-149.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
