{"id":104275,"no":163,"title":"Page 163","content":"\u003cp\u003eWhere Tehol went left.\u003c/p\u003e\n\u003cp\u003eAnd Ublala went right.\u003c/p\u003e\n\u003cp\u003eAlarms resounded in the night.\u003c/p\u003e\n\u003cp\u003eThe answering of his prayers was nothing like Bruthen Trana had imagined. Not through the grotesque creature that was Hannan Mosag, the Warlock King. The very man who had started the Edur down this path of dissolution. Ambition, greed and betrayal-it was all Bruthen could manage to stand still before Hannan Mosag, rather than strangle the life from the Warlock King.\u003c/p\u003e\n\u003cp\u003eYet from that twisted mouth had come… hope. It seemed impossible. Macabre. Mocking Bruthen Trana’s visions of heroic salvation. Rhidad falls-the whole Sengar bloodline obliterated-and then… Hannan Mosag. For his crimes. Honour can be won-1 will see to that.\u003c/p\u003e\n\u003cp\u003eThis is how it must be.\u003c/p\u003e\n\u003cp\u003eHe was not unduly worried over the Letherii. The Chancellor would not live much longer. The palace would be purged. The Patriotists would be crushed, their agents slain, and those poor prisoners whose only crime, as far as he could tell, was to disagree with the practices of the Patriotists-those prisoners, Letherii one and all, could be freed. There was no real sedition at work here. No treason. Karos Invictad used such accusations as if they encompassed a guilt that needed no proof, as if they justified any treatment of the accused he desired. Ironically, in so doing he subverted humanity itself, making him the most profound traitor of all.\u003c/p\u003e\n\u003cp\u003eBut not even that mattered much. Bruthen Trana did not like the man, a dislike that seemed reason enough to kill the bastard. Karos Invictad took pleasure in cruelty, making him both pathetic and dangerous. If he were permitted to continue, there was the very real risk that the Letherii people would rise up in true rebellion, and the gutters in every city of the empire would run crimson. No matter. I do not like him. For years I was witness to his contempt for me, there in his eyes. I will brook the affront no longer.\u003c/p\u003e\n\u003cp\u003eThis, more than anything else, dismayed Bruthen Trana. Hannan Mosag’s insisting he leave immediately-for some place where the sun dies. West. But no, not west. The Warlock King misunderstood his own vision-\u003c/p\u003e\n\u003cp\u003eA sudden thought, slowing his steps as he made his way down into the subterranean corridors and chambers beneath the Old Palace. Who answered his prayers? Who showed him this path? He suggested it was not this Crippled God. Father Shadow? Has Scabandari Bloodeye returned to us?\u003c/p\u003e\n\u003cp\u003eNo, he has not. Then… who?\u003c/p\u003e\n\u003cp\u003eA moment later, Bruthen Trana scowled, then cursed under his breath and resumed his journey. I am given hope and what do I do? Seek to kill it with my own hands. No, I understand the path-better than Hannan Mosag himself.\u003c/p\u003e\n\u003cp\u003eWhere the sun dies is not to the west.\u003c/p\u003e\n\u003cp\u003eIt is beneath the waves. In the depths.\u003c/p\u003e\n\u003cp\u003eDid not a demon of the seas retrieve his body? No, Hannan Mosag, you dare not name him. He is not even Tiste Edur. Yet he must be our salvation.\u003c/p\u003e\n\u003cp\u003eHe reached the sloping tunnel that would take him to the slave’s supposedly secret abode. These Letherii were indeed pathetic.\u003c/p\u003e\n\u003cp\u003eWe each carry a whisper of Emurlahn within us-each and every Tiste Edur. This is why no slave among the tribes could escape us.\u003c/p\u003e\n\u003cp\u003eExcept for one, he corrected himself. Udinaas. But then, the K’risnan knew where he was-or so Bruthen Trana suspected. They knew, yet chose to do nothing.\u003c/p\u003e\n\u003cp\u003eIt was no wonder Rhulad did not trust them.\u003c/p\u003e\n\u003cp\u003eNor do I.\u003c/p\u003e\n\u003cp\u003eHe could smell the stench of bitter magic as he drew nearer, and he heard her muttering in her chamber, and knew that something had changed. In the one named Feather Witch. In the power she possessed.\u003c/p\u003e\n\u003cp\u003eWell, he would give her no time to prepare.\u003c/p\u003e\n\u003cp\u003eFeather Witch looked up in fear and alarm as the Tiste Edur warrior strode in. Squealing, she backed away until brought short by a wall, then sank down and covered her face.\u003c/p\u003e\n\u003cp\u003eThe stark intent in the warrior’s face was fierce.\u003c/p\u003e\n\u003cp\u003eHe grasped her by the hair and yanked her to her feet, then higher, the pain forcing a shriek from her.\u003c/p\u003e\n\u003cp\u003eWith his other hand he grasped the small leather pouch between her breasts. When he tore it loose, the thong cut like wire across the back of her neck and behind one ear. She could feel blood. She thought that her ear had very nearly been cut loose, that it hung by a strand of-\u003c/p\u003e\n\u003cp\u003eHe flung her back down. Her head cracked against the stone of the wall. She slumped onto the floor, ragged sobbing erupting from her heaving chest.\u003c/p\u003e\n\u003cp\u003eAnd listened-beyond the close roar of blood in her skull-to his dwindling footsteps.\u003c/p\u003e\n\u003cp\u003eHe had taken the severed finger.\u003c/p\u003e\n\u003cp\u003eHe goes to find the soul of Brys Beddict.\u003c/p\u003e\n\u003cp\u003eTehol staggered into the single room, collapsed down near the hearth. Sheathed in sweat, gasping to gain his breath.\u003c/p\u003e\n\u003cp\u003eBugg, seated with his back to a wall and sipping tea, slowly raised his brows. ‘Afflicted with the delusion of competence, I see.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-163.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
