{"id":104276,"no":164,"title":"Page 164","content":"\u003cp\u003e‘That-that’s what you said-to Ublala? You cruel, heartless-’\u003c/p\u003e\n\u003cp\u003e‘The observation was made regarding all mortals, actually.’\u003c/p\u003e\n\u003cp\u003e‘He didn’t take it that way!’\u003c/p\u003e\n\u003cp\u003eJanath spoke from where she sat sipping from her own chipped clay cup. ‘All those alarms ringing through the city are because of you, Tehol Beddict?’\u003c/p\u003e\n\u003cp\u003e‘They will be on the lookout now,’ Bugg observed, ‘for a man wearing a blanket.’\u003c/p\u003e\n\u003cp\u003e‘Well,’ Tehol retorted, ‘there must be plenty of those, right?’\u003c/p\u003e\n\u003cp\u003eThere was no immediate reply.\u003c/p\u003e\n\u003cp\u003e‘There must be,’ Tehol insisted, a little wildly even to his iown ears. He hastened on in a more reasonable tone. ‘The ever growing divide between the rich and the poor and all that. Why, blankets are the new fashion among the destitute. I’m sure of it.’\u003c/p\u003e\n\u003cp\u003eNeither listener said anything, then both sipped from their cups.\u003c/p\u003e\n\u003cp\u003eScowling, Tehol said, ‘What’s that you’re drinking?’\u003c/p\u003e\n\u003cp\u003e‘Hen tea,’ Bugg said.\u003c/p\u003e\n\u003cp\u003e‘Soup, you mean.’\u003c/p\u003e\n\u003cp\u003e‘No,’ said Janath. ‘Tea.’\u003c/p\u003e\n\u003cp\u003e‘Wait, where are all the chickens?’\u003c/p\u003e\n\u003cp\u003e‘On the roof,’ Bugg said.\u003c/p\u003e\n\u003cp\u003e‘Won’t they fall off?’\u003c/p\u003e\n\u003cp\u003e‘One or two might. We do regular rounds. So far, they have displayed uncharacteristic cleverness. Rather unique for this household.’\u003c/p\u003e\n\u003cp\u003e‘Oh right, kick the exhausted fugitive why don’t you? They probably caught poor old Ublala.’\u003c/p\u003e\n\u003cp\u003e‘Maybe. He did have a diversion in mind.’\u003c/p\u003e\n\u003cp\u003eTehol’s eyes narrowed on his manservant. ‘Those wisps above your ears need trimming. Janath, find me a knife, will you?’.\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003e‘You would side with him, wouldn’t you?’\u003c/p\u003e\n\u003cp\u003e‘Bugg is actually a very capable man, Tehol. You don’t deserve him, you know.’\u003c/p\u003e\n\u003cp\u003e‘I assure you, Scholar, the undeservedness is mutual.’\u003c/p\u003e\n\u003cp\u003e‘What does that mean?’\u003c/p\u003e\n\u003cp\u003e‘You know, from the smell I think I could make a strong argument that hen tea is no different from watery chicken soup, or, at the very least, broth.’\u003c/p\u003e\n\u003cp\u003e‘You never could grasp semantics, Tehol Beddict.’\u003c/p\u003e\n\u003cp\u003e‘I couldn’t grasp much of anything, I seem to recall. Yet I will defend my diligence, my single-minded lust for seductive knowledge, the purity of true academic… uh, pursuit-why, I could go on and on-’\u003c/p\u003e\n\u003cp\u003e‘Ever your flaw, Tehol.’\u003c/p\u003e\n\u003cp\u003e‘-but I won’t, cursed as I am with an unappreciative audience. So tell me, Bugg, why was Ublala so eager to talk to this true blood Tarthenal?’\u003c/p\u003e\n\u003cp\u003e‘He wishes to discover, I imagine, if the warrior is a god.’\u003c/p\u003e\n\u003cp\u003e‘A what?’\u003c/p\u003e\n\u003cp\u003e‘A new god, I mean. Or an ascendant, to be more precise. I doubt there are worshippers involved. Yet.’\u003c/p\u003e\n\u003cp\u003e‘Well, Tarthenal only worship what terrifies them, right? This is just some warrior doomed to die by the Emperor’s sword. Hardly the subject to inspire poor Ublala Pung.’\u003c/p\u003e\n\u003cp\u003eTo that Bugg simply shrugged.\u003c/p\u003e\n\u003cp\u003eTehol wiped sweat from his brow. ‘Give me some of that hen tea, will you?’\u003c/p\u003e\n\u003cp\u003e‘With or without?’\u003c/p\u003e\n\u003cp\u003e‘With or without what?’\u003c/p\u003e\n\u003cp\u003e‘Feathers.’\u003c/p\u003e\n\u003cp\u003e‘That depends. Are they clean feathers?’\u003c/p\u003e\n\u003cp\u003e‘They are now,’ Bugg replied.\u003c/p\u003e\n\u003cp\u003eAll right, then, since I can’t think of anything more absurd. With.’\u003c/p\u003e\n\u003cp\u003eBugg reached for a clay cup. ‘I knew I could count on you, Master.’\u003c/p\u003e\n\u003cp\u003eShe woke to a metallic clang out in the corridor.\u003c/p\u003e\n\u003cp\u003eSitting up, Samar Dev stared into the darkness of her room.\u003c/p\u003e\n\u003cp\u003eShe thought she could hear breathing, just outside her door, then, distinctly, a muted whimper.\u003c/p\u003e\n\u003cp\u003eShe rose, wrapping the blanket about her, and padded to the doorway. Lifted the latch and swung the flimsy barrier aside.\u003c/p\u003e\n\u003cp\u003e‘Karsa?’\u003c/p\u003e\n\u003cp\u003eThe huge figure spun to face her.\u003c/p\u003e\n\u003cp\u003e‘No,’ she then said. ‘Not Karsa. Who are you?’\u003c/p\u003e\n\u003cp\u003e‘Where is he?’\u003c/p\u003e\n\u003cp\u003e‘Who?’\u003c/p\u003e\n\u003cp\u003e‘The one like me. Which room?’\u003c/p\u003e\n\u003cp\u003eSamar Dev edged out into the corridor. She looked to the left and saw the motionless forms of the two palace guards normally stationed to either side of the corridor’s entranceway. Their helmed heads were conspicuously close together, and those iron pots were both severely dented. ‘You killed them?’\u003c/p\u003e\n\u003cp\u003eThe huge man glanced over, then grunted. ‘They were looking the wrong way.’\u003c/p\u003e\n\u003cp\u003e‘You mean they didn’t see you.’\u003c/p\u003e\n\u003cp\u003e‘Maybe my hands.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-164.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
