{"id":104277,"no":165,"title":"Page 165","content":"\u003cp\u003eThe nonsensical yet oddly satisfying exchange had been in whispers. Samar Dev gestured that he follow and set off up the corridor until she came to the door to Karsa Orlong’s room. ‘He’s in here.’\u003c/p\u003e\n\u003cp\u003e‘Knock,’ the giant ordered. ‘Then walk in ahead of me.’\u003c/p\u003e\n\u003cp\u003e‘Or else?’\u003c/p\u003e\n\u003cp\u003e‘Or else I knock your head… together.’\u003c/p\u003e\n\u003cp\u003eSighing, she reached towards the door with one fist.\u003c/p\u003e\n\u003cp\u003eIt opened and the point of a stone sword suddenly hovered in the hollow of her throat.\u003c/p\u003e\n\u003cp\u003e‘Who is that behind you, witch?’\u003c/p\u003e\n\u003cp\u003e‘You have a visitor,’ she replied. ‘From… outside.’\u003c/p\u003e\n\u003cp\u003eKarsa Orlong, naked above the waist, his escaped slave tattoos a crazed web reaching down to his shoulders and chest, withdrew the sword and stepped back.\u003c/p\u003e\n\u003cp\u003eThe stranger pushed Samar Dev to one side and entered the small room.\u003c/p\u003e\n\u003cp\u003eWhereupon he sank down to his knees, head bowing. ‘Pure one,’ he said, the words like a prayer.\u003c/p\u003e\n\u003cp\u003eSamar Dev edged in and shut the door behind her, as Karsa Orlong tossed his sword on the cot, then reached down with one hand-and hammered the stranger in the side of the head.\u003c/p\u003e\n\u003cp\u003eRocking the man. Blood started from his nostrils and he blinked stupidly up at Karsa.\u003c/p\u003e\n\u003cp\u003eWho said, ‘There is Toblakai blood in you. Toblakai kneel to no-one.’\u003c/p\u003e\n\u003cp\u003eSamar Dev crossed her arms and leaned back against the door. ‘First lesson when dealing with Karsa Orlong,’ she murmured. ‘Expect the unexpected.’\u003c/p\u003e\n\u003cp\u003eThe huge man struggled back to his feet, wiping at the blood on his face. He was not as tall as Karsa, but almost as wide. ‘I am Ublala Pung, of the Tarthenal-’\u003c/p\u003e\n\u003cp\u003e‘Tarthenal.’\u003c/p\u003e\n\u003cp\u003eSamar Dev said, ‘A mixed-blood remnant of some local Toblakai population. Used to be more in the city-I certainly have not seen any others out in the markets and such. But they’ve virtually vanished, just like most of the other tribes the Letherii subjugated.’\u003c/p\u003e\n\u003cp\u003eUblala half turned to glower at her. ‘Not vanished. Defeated. And now those who are left live on islands in the Draconean Sea.’\u003c/p\u003e\n\u003cp\u003eAt the word ‘defeated’, Samar Dev saw Karsa scowl.\u003c/p\u003e\n\u003cp\u003eUblala faced the Toblakai once more, then said, with strange awkwardness, ‘Lead us, War Leader.’\u003c/p\u003e\n\u003cp\u003eSudden fire in Karsa’s eyes and he met Samar Dev’s gaze. ‘I told you once, witch, that I would lead an army of my kind. It has begun.’\u003c/p\u003e\n\u003cp\u003e‘They’re not Toblakai-’\u003c/p\u003e\n\u003cp\u003e‘If but one drop of Toblakai blood burns in their veins, witch, then they are Toblakai.’\u003c/p\u003e\n\u003cp\u003e‘Decimated by Letherii sorcery-’\u003c/p\u003e\n\u003cp\u003eA sneer. ‘Letherii sorcery? I care naught.’\u003c/p\u003e\n\u003cp\u003eUblala Pung, however, was shaking his head. ‘Even with our greatest shamans, Pure One, we could not defeat it. Why, Arbanat himself-’\u003c/p\u003e\n\u003cp\u003eThis time it was Samar Dev who interrupted. ‘Ublala, I have seen Karsa Orlong push his way through that sorcery.’\u003c/p\u003e\n\u003cp\u003eThe mixed-blood stared at her, mouth agape. ‘Push?’ The word was mostly mouthed, the barest of whispers.\u003c/p\u003e\n\u003cp\u003eDespite herself, she nodded. ‘I wish I could tell you otherwise, you poor bastard. I wish I could tell you to run away and hide with your kin on those islands, because this one here makes empty promises. Alas, I cannot. He does not make empty promises. Not so far, anyway. Of course,’\u003c/p\u003e\n\u003cp\u003eshe added with a shrug that belied the bitterness she felt, ‘this Edur Emperor will kill him.’\u003c/p\u003e\n\u003cp\u003eTo that, Ublala Pung shook his head.\u003c/p\u003e\n\u003cp\u003eDenial? Dismay?\u003c/p\u003e\n\u003cp\u003eKarsa Orlong addressed Ublala: ‘You must leave when this is done, warrior. You must travel to your islands and gather our people, then bring them here. You are now my army. I am Karsa Orlong, Toblakai and Teblor. I am your war leader.’\u003c/p\u003e\n\u003cp\u003e‘The marks on your face,’ Ublala whispered.\u003c/p\u003e\n\u003cp\u003e‘What of them?’\u003c/p\u003e\n\u003cp\u003e‘As shattered as the Tarthenal. As the Toblakai-broken, driven apart. So the oldest legends say-scattered, by ice, by betrayal…’\u003c/p\u003e\n\u003cp\u003eAn icy draught seemed to flow up around Samar Dev, like a cold wave engulfing a rock, and she shivered. Oh, I dislike the sound of that, since it echoes the truth of things. Too clearly.\u003c/p\u003e\n\u003cp\u003e‘Yet see my face behind it,’ Karsa said. ‘Two truths. What was and what will be. Do you deny this, Ublala of the Tarthenal?’\u003c/p\u003e\n\u003cp\u003eA mute shake of the head. Then the warrior shot another glance at Samar Dev, before saying, ‘War Leader, I have words. Of… of Rhulad Sengar, the Edur Emperor. Words… of his secret.’\u003c/p\u003e\n\u003cp\u003e‘Leave us, witch,’ Karsa said.\u003c/p\u003e\n\u003cp\u003eShe started. ‘What? Not a chance-’\u003c/p\u003e\n\u003cp\u003e‘Leave us or I will instruct my warrior to knock your head together.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-165.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
