{"id":104278,"no":166,"title":"Page 166","content":"\u003cp\u003e‘Oh, so now it’s idiocy that inspires you?’\u003c/p\u003e\n\u003cp\u003e‘Samar Dev,’ Karsa said. ‘This warrior has defeated every barrier surrounding this compound. I am not interested in his words. Did you not hear the alarms? He fights as would a Toblakai.’\u003c/p\u003e\n\u003cp\u003e‘They tried Drowning me too, once,’ Ublala said.\u003c/p\u003e\n\u003cp\u003eSamar Dev snorted. ‘With him around, it truly is a struggle to remain solemn, never mind dignified. A cure for pomposity, Karsa Orlong-be sure to keep this one at your side.’\u003c/p\u003e\n\u003cp\u003e‘Go.’\u003c/p\u003e\n\u003cp\u003eShe gestured with sudden contempt. ‘Oh, fine, on with you two, then. Later, Karsa, I will remind you of one thing.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003eShe opened the door behind her. ‘This oaf couldn’t even find your room.’\u003c/p\u003e\n\u003cp\u003eOut in the corridor, Samar Dev heard a stirring from one of the guards, then a groan and then, distinctly: ‘What are all those lights?’\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eI looked to the west and saw a thousand suns setting.\u003c/p\u003e\n\u003cp\u003e– Sidivar Trelus\u003c/p\u003e\n\u003cp\u003eThe earthy smell of the dung fires preceded the first sighting of the Awl army. Beneath the smudged light of a dull moon, the Atri-Preda and Brohl Handar rode with the scout troop to the base of a ridge, where they dismounted and, leaving one soldier with the horses, set out on foot up the slope.\u003c/p\u003e\n\u003cp\u003eThe summit was almost devoid of grasses, knobs of angular bedrock pushing through where the ceaseless winds had eroded away the scant soil. Dropping down low, the half-dozen Letherii and one Tiste Edur edged up between the outcroppings, filling the spaces in the broken spine of basalt.\u003c/p\u003e\n\u003cp\u003eBeyond, perhaps a third of a league distant, burned the cookfires of the enemy. A sea of fallen, smouldering stars, spreading out to fill the basin of an entire valley, then up the far slope, defining its contours.\u003c/p\u003e\n\u003cp\u003e‘How many do you judge?’ Brohl Handar asked the Atri-Preda in a low voice.\u003c/p\u003e\n\u003cp\u003eBivatt sighed. ‘Combatants? Maybe ten, eleven thousand. These armies are more like migrations, Overseer. Everyone tags along.’\u003c/p\u003e\n\u003cp\u003e‘Then where are the herds?’\u003c/p\u003e\n\u003cp\u003e‘Probably the other side of the far valley.’\u003c/p\u003e\n\u003cp\u003e‘So tomorrow, we ride to battle.’\u003c/p\u003e\n\u003cp\u003e‘Yes. And again, I advise that you and your bodyguard remain with the train-’\u003c/p\u003e\n\u003cp\u003e‘That will not be necessary,’ Brohl Handar cut in, repeating words he had uttered a dozen times in the past three days and nights. ‘There are Edur warriors with you, and they will be used, yes?’\u003c/p\u003e\n\u003cp\u003e‘If needed, Overseer. But the fight awaiting us looks to be no different from all the others we Letherii have had against these people of the plains. It looks as if Redmask was not able to sway the elders with any new schemes. It’s the old tactics-the ones that fail them time and again.’ She was silent for a moment, then she continued, ‘The valley behind us is called Bast Fulmar. It has some arcane significance for the Awl. That is where we will meet.’\u003c/p\u003e\n\u003cp\u003eHe turned his head and studied her in the gloom. ‘You are content to let them choose the place of battle?’\u003c/p\u003e\n\u003cp\u003eShe snorted. ‘Overseer, if these lands were filled with defiles, canyons, arroyos or impassable rivers-or forests-then indeed I would think carefully about engaging the enemy where they want us to. But not here. Visibility is not in issue-with our mages the Awl cannot hide in any case. There are no difficult avenues of retreat, no blinds. The light tomorrow will be brutal in its simplicity. Awl ferocity anainst Letherii discipline.’\u003c/p\u003e\n\u003cp\u003eAnd with this Redmask leading them, they will be fere cious indeed.’\u003c/p\u003e\n\u003cp\u003e‘Yes. But it will fail in the end.’\u003c/p\u003e\n\u003cp\u003e‘You are confident, Atri-Preda.’\u003c/p\u003e\n\u003cp\u003eHe caught her smile. ‘Relieved, Overseer. This night, I see only what I have seen a dozen times before. Do not imagine, however, that I am dismissing the enemy. It will be hloody.’ With that she gestured, and the group began withdrawing from the ridgeline.\u003c/p\u003e\n\u003cp\u003eAs they made their way down to the waiting horses, Brohl Handar said, ‘I saw no pickets, Atri-Preda. Nor mounted outriders. Does that not seem odd to you?’\u003c/p\u003e\n\u003cp\u003e‘No. They know we are close. They wanted us to see that camp.’\u003c/p\u003e\n\u003cp\u003e‘To achieve what? Some pointless effort to overawe us?’\u003c/p\u003e\n\u003cp\u003e‘Something like that, yes.’\u003c/p\u003e\n\u003cp\u003eYou invite me to feel contempt for these Awl. Why? So that you can justify not using the Tiste Edur? The K’risnan? You want this victory on the morrow to be Letherii. You do not want to find yourself beholden to the Edur-not for this grand theft of land and beast, this harvesting of slaves.\u003c/p\u003e\n\u003cp\u003eSo, I suspect, the Factor instructed, hetur Anict is not one to share the spoils.\u003c/p\u003e\n\u003cp\u003eI, Atri-Preda, am not relieved. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-166.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
