{"id":104280,"no":168,"title":"Page 168","content":"\u003cp\u003eFrom somewhere in the night came the keening howl of a wolf.\u003c/p\u003e\n\u003cp\u003eToc grunted. ‘Yes, well, it’s not as if I had the privilege of choice, is it? I wonder if any of us has. Ever.’ He raised his voice slightly, ‘You know, Torrent-yes, I see you hulking out there-it occurs to me, given the precedent, that the question of cowardice is one your Awl must face, tomorrow. I have no doubt Redmask-if he has any concerns-is thinking on that right now. Wondering. Can he bully all of you into honour?’\u003c/p\u003e\n\u003cp\u003eThe vague shape that was Torrent moved off.\u003c/p\u003e\n\u003cp\u003eToc fell silent, tossed yet another lump of rodara dung onto the fire, and thought about old friends long gone.\u003c/p\u003e\n\u003cp\u003eThe lone line of scuffed footprints ended with a figure, trudging up the distant slope of clay and pebbles. That was the thing about following a trail, Hedge reminded himself. Easy to forget the damned prints belonged to something real, especially after what seemed weeks of tracking the bastard.\u003c/p\u003e\n\u003cp\u003eT’lan Imass, as he had suspected. Those splayed, bony feet dragged too much, especially with an arch so high it left no imprint. True, some bowlegged Wickan might leave something similar, but not walking at a pace that stayed ahead of Hedge for this long. Not a chance of that. Still, it was odd that the ancient undead warrior was walking at all.\u003c/p\u003e\n\u003cp\u003eEasier traversing this wasteland as dust.\u003c/p\u003e\n\u003cp\u003eMaybe it’s too damp. Maybe it’s no fun being mud. I’ll have to ask it that.\u003c/p\u003e\n\u003cp\u003eAssuming it doesn’t kill me outright. Or try to, I mean. I keep forgetting that I’m already dead. If there’s one thing the dead should remember, it’s that crucial detail, don’t you think, Fid? Bah, what would you know. You’re still alive. And not here either.\u003c/p\u003e\n\u003cp\u003eHood take me, I’m in need of company.\u003c/p\u003e\n\u003cp\u003eNot that damned whispering wind, though. Good thing it had fled, in tatters, unable to draw any closer to this T’lan Imass with-yes-but one arm. Beat up thing, ain’t i just?\u003c/p\u003e\n\u003cp\u003eHe was sure it knew he was here, a thousand pace behind it. Probably knows I’m a ghost, too. Which is why i hasn’t bothered attacking me.\u003c/p\u003e\n\u003cp\u003eI think I’m getting used to this.\u003c/p\u003e\n\u003cp\u003eAnother third of a league passed before Hedge was able to draw close enough to finally snare the undead warrior’s regard. Halting, slowly turning about. The flint weapon in its lone hand was more a cutlass than a sword, its end strangely hooked. A hilt had been fashioned from the palmate portion of an antler, creating a shallow, tined bell-guard polished brown with age. Part of the warrior’s face had been brutally smashed: but one side of its heavy jaw was intact, giving its ghastly mien a lopsided cant.\u003c/p\u003e\n\u003cp\u003e‘Begone, ghost,’ the T’lan Imass said in a ravaged voice.\u003c/p\u003e\n\u003cp\u003e‘Well I would,’ Hedge replied, ‘only it seems we’re heading in the same direction.’\u003c/p\u003e\n\u003cp\u003e‘That cannot be.’\u003c/p\u003e\n\u003cp\u003e‘Why?’\u003c/p\u003e\n\u003cp\u003e‘Because you do not know where I am going.’\u003c/p\u003e\n\u003cp\u003e‘Oh, perfect Imass logic. In other words, absurd idiocy. No, I don’t know precisely where you are going, but it i| undeniably to be found in the same direction as where I am headed. Is that too sharp an observation for you?’\u003c/p\u003e\n\u003cp\u003e‘Why do you hold to your flesh?’\u003c/p\u003e\n\u003cp\u003e‘The same reason, I suppose, why you hold on to what’s left of yours. Listen, I am named Hedge. I was once a soldier, a Bridgeburner. Malazan marines. Are you some cast-off from Logros T’lan Imass?’\u003c/p\u003e\n\u003cp\u003eThe warrior said nothing for a moment, then, ‘I was once of Kron T’lan Imass. Born in the Season of Blood-from-the-Mountain to the clan of Eptr Phinana. My own blood arrived on the shores of Jagra Til. I am Emroth.’\u003c/p\u003e\n\u003cp\u003e‘A woman?’\u003c/p\u003e\n\u003cp\u003eA clattering, uneven shrug.\u003c/p\u003e\n\u003cp\u003e‘Well, Emroth, what are you doing walking across Hood’s forgotten ice-pit?’\u003c/p\u003e\n\u003cp\u003e‘There is no pit here.’\u003c/p\u003e\n\u003cp\u003e‘As you say.’ Hedge looked round. ‘Is this where abandoned T’lan Imass go, then?’\u003c/p\u003e\n\u003cp\u003e‘Not here,’ Emroth replied. Then the cutlass lifted and slowly pointed.\u003c/p\u003e\n\u003cp\u003eAhead. The direction Hedge had decided to call north. ‘What, are we headed towards a huge pile of frozen bones, then?’\u003c/p\u003e\n\u003cp\u003eEmroth turned and began walking once more.\u003c/p\u003e\n\u003cp\u003eHedge moved up alongside the undead creature. ‘Were you beautiful once, Emroth?’\u003c/p\u003e\n\u003cp\u003e‘I do not remember.’\u003c/p\u003e\n\u003cp\u003e‘I was hopeless with women,’ Hedge said. ‘My ears are too big-yes, that’s why I wear this leather cap. And I got knobby knees. It’s why I became a soldier, you know. To meet women. And then I discovered that women soldiers are scary. I mean, a lot more scary than normal women, which is saying something. I guess with you Imass, well, everyone was a warrior, right?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-168.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
