{"id":104286,"no":174,"title":"Page 174","content":"\u003cp\u003eThe thought made him sneer inside. What was this feeling sorry for himself? Pathetic indulgence and nothing else.\u003c/p\u003e\n\u003cp\u003eSkirting the edge of a submerged ravine, they sloshed through tepid, waist-deep water, their passage swirling up clouds of silts that had rested lightly on some unseen, interminably paved lake-bottom. Tracked now by-some kind of fish, their humped backs appearing every now and then to one side or the other, the dorsal fin ribbed, the bulge of water hinting at sizes a little too large for restful contemplation.\u003c/p\u003e\n\u003cp\u003eLeast pleasant of all, Trull Sengar’s comment only moments past that these fish were probably the same kind that had once tried to eat him.\u003c/p\u003e\n\u003cp\u003eAnd Onrack the Broken had replied, ‘Yes, they are the same as the ones we fought on the floodwall, although of course they were then in their land-dwelling stage of life.’\u003c/p\u003e\n\u003cp\u003e‘So why are they here?’ Trull then asked.\u003c/p\u003e\n\u003cp\u003e‘Hungry,’ Onrack answered.\u003c/p\u003e\n\u003cp\u003eEnough, right then and there, to stir Quick Ben from his morose taciturnity. ‘Listen to you two! We’re about to be attacked by giant wizard-eating fish and you’re reminiscing! Look, are we in real danger or what?’\u003c/p\u003e\n\u003cp\u003eOnrack’s robust, prognathous face swung to regard him for a moment, then the T’lan Imass said, ‘We were assuming that you were warding us from them, Quick Ben.’\u003c/p\u003e\n\u003cp\u003e‘Me?’ He looked about, seeking any sign of dry land-but the milky water stretched on and on.\u003c/p\u003e\n\u003cp\u003e‘Is it time, then, to make use of your gate?’\u003c/p\u003e\n\u003cp\u003eQuick Ben licked his lips. ‘I think so. I mean, I’ve recovered from the last time, more or less. And I found somewhere to go. It’s just…’\u003c/p\u003e\n\u003cp\u003eTrull Sengar leaned on his spear. ‘You came out of that magical journey, Quick Ben, wearing the grin of the condemned. If indeed our destination is as fraught as it must be, I can understand your reluctance. Also, having observed you for some time now, it is clear to me that your battle against Icarium has weakened you at some fundamental level-perhaps you fear you will not be able to fashion a gate durable enough to permit the passage of all three of us? If so-’\u003c/p\u003e\n\u003cp\u003e‘Wait,’ the wizard interjected, silently cursing. ‘All right, I am a little… fragile. Ever since Icarium. You see far too much, Trull Sengar. But I can take us all through. That’s a promise. It’s just…’ He glanced over at Onrack. ‘Well, there may be some… unanticipated, uh, developments.’\u003c/p\u003e\n\u003cp\u003eOnrack spoke, ‘I am at risk?’\u003c/p\u003e\n\u003cp\u003e‘I’m not sure. Maybe.’\u003c/p\u003e\n\u003cp\u003e‘This should not unduly affect your decision,’ the T’lan I mass replied. ‘I am expendable. These fish cannot eat me, after all.’\u003c/p\u003e\n\u003cp\u003e‘If we leave,’ Quick Ben said, ‘you will be trapped here for ever.’\u003c/p\u003e\n\u003cp\u003e‘No. I will abandon this form. I will join oblivion in these waters.’\u003c/p\u003e\n\u003cp\u003e‘Onrack-’ Trull began in clear alarm.\u003c/p\u003e\n\u003cp\u003eBut Quick Ben cut in, ‘You’re coming with us, Onrack. I’m just saying there’s a little uncertainty with what will happen to you. I can’t explain more. It just relates to where we will find ourselves. To the aspect of that realm, I mean.’\u003c/p\u003e\n\u003cp\u003eTrull Sengar snorted. ‘Sometimes,’ he said with a wry smile, ‘you are truly hopeless, wizard. Best open the gate now, before we end up in the belly of a fish.’ He then pointed behind Quick Ben. ‘That one looks to be the biggest yet-see the others scatter-and it’s coming straight for us.’\u003c/p\u003e\n\u003cp\u003eTurning, the wizard’s eyes widened.\u003c/p\u003e\n\u003cp\u003eThe waist-deep water did not even reach its eyes, and the monstrous fish was simply bulling its way through the shallows. A damned catfish of some sort, longer than a Napan galley-\u003c/p\u003e\n\u003cp\u003eQuick Ben raised his arms and shouted in a loud, oddly high-pitched voice: ‘It’s time to leave!’\u003c/p\u003e\n\u003cp\u003eFragile. Oh yes, there is that. I poured too much through me trying to beat him back. There’s only so much mortal flesh and bone can take. The oldest rule of all, for Hood’s sake.\u003c/p\u003e\n\u003cp\u003eHe forced open the gate, heard the explosive plunge of water into the realm beyond-the current wrapping round his legs-and he lunged forward, shouting, ‘Follow me!’\u003c/p\u003e\n\u003cp\u003eOnce again, that nauseating, dreadful moment of suffocation, then he was staggering through a stream, water splashing out on all sides, rushing away-and cold wintry air closed in amidst clouds of vapour.\u003c/p\u003e\n\u003cp\u003eTrull Sengar stumbled past him, using the spear to right himself a moment before falling.\u003c/p\u003e\n\u003cp\u003eGasping, Quick Ben turned.\u003c/p\u003e\n\u003cp\u003eAnd saw a figure emerge from the white mists.\u003c/p\u003e\n\u003cp\u003eTrull Sengar’s shout of surprise startled into the air birds from a nearby swath of knee-high trees, and as they raced skyward they spun in a half-circle over the head of Onrack the Broken. At their cries, at the swarm of tiny shadows darting around him, the warrior looked up, then halted. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-174.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
