{"id":104293,"no":182,"title":"Page 182","content":"\u003cp\u003eThen, directly before her, horse-archers appeared, a narrow spear driving down the centre of the battlefield, with only skirmishers opposite them-who quickly backed up the slope at a southerly angle to draw in behind her advancing Merchants’ Battalion of heavy infantry. Is 1 Redmask mad? That spear’point will be smashed against the heavies-this is not how cavalry charge-they’re only horse-archers!\u003c/p\u003e\n\u003cp\u003eWhereupon the mounted archers wheeled, the spear becoming a line-a thousand or more-suddenly sweeping southward.\u003c/p\u003e\n\u003cp\u003eCatching the Artisan skirmishers in the flank.\u003c/p\u003e\n\u003cp\u003eArrows flashed.\u003c/p\u003e\n\u003cp\u003eThe Letherii light infantry seemed to melt away, bodies tumbling down. Survivors ran for their lives.\u003c/p\u003e\n\u003cp\u003eThat broad line of horse-archers then began a complicated, stunning manoeuvre, its tailing, easternmost end now slowing, swinging up, west, pulling to shift the line south-north, now launching sweeping arrow-fire across the front ranks of the Harridict heavy infantry, then the Crimson Rampant medium, before the head of the line swung back eastward, more missiles arcing across to the Bluerose lancers, who responded with a blare of horns, surging forward to close with the Awl.\u003c/p\u003e\n\u003cp\u003eYet they were not interested in such an engagement. The line broke apart, as riders spurred hard back towards the east ridge.\u003c/p\u003e\n\u003cp\u003e‘Halt that charge!’ Bivatt shouted. Stung, we lash out-who commands that wing?\u003c/p\u003e\n\u003cp\u003eAs the lancers spread out in their hard pursuit, three wings of heavier-armed and armoured Awl horse-warriors appeared on the ridge line, then plunged down the slope to take the Bluerose companies in the flank. Three wings, outnumbering the lancers by two to one.\u003c/p\u003e\n\u003cp\u003eBivatt watched in fury as her cavalry sought to wheel to meet the attack, whilst others responded to her command\u003c/p\u003e\n\u003cp\u003e– and so lost all momentum.\u003c/p\u003e\n\u003cp\u003e‘Sound the withdrawal for those lancers!’\u003c/p\u003e\n\u003cp\u003eToo late.\u003c/p\u003e\n\u003cp\u003eThe Awl horse-warriors swept through scattered skirmishers of the Crimson Rampant, then slammed into the Bluerose companies.\u003c/p\u003e\n\u003cp\u003eShe heard animals scream, felt the impact tremble through the ground-enough to make her mount sidestep\u003c/p\u003e\n\u003cp\u003e– and then dust obscured the scene. ‘Advance the heavies at the double!’\u003c/p\u003e\n\u003cp\u003e‘Which heavies, Atri-Preda?’\u003c/p\u003e\n\u003cp\u003e‘Harridict and Merchants’, you fool! And same command for the Crimson Rampant medium! Quickly!’\u003c/p\u003e\n\u003cp\u003eShe saw riders and riderless horses plunge into view from the roiling dust clouds. Her lancers had been shattered-were the Awl pursuing? Their blood must be high-oh, let them lose control, let them meet the fists of my heavies!\u003c/p\u003e\n\u003cp\u003eBut no, there they were, rising up the far slope, waving weapons in the air to announce their triumph.\u003c/p\u003e\n\u003cp\u003eShe saw the Awl skirmishers reappearing on the ridge line, in blocks with avenues in between to let the riders pass through-but those light infantry were transformed, Equipped now with rectangular, copper-sheathed shields and bearing long spears, they closed ranks after the last horse-warriors were through, and steadied their line at the very edge of the ridge.\u003c/p\u003e\n\u003cp\u003eOn the valley floor, dust climbed skyward, slowly revealing the devastating effects of that flank charge into the Bluerose companies. Errant below, they’ve been wiped out. Hundreds of dead and dying skirmishers covered the grounds to either side of that fateful impact.\u003c/p\u003e\n\u003cp\u003eHer right advance had been deeply wounded-not yet mortal, even so-‘Advance the medium and the two heavies across the valley-order to engage that line on the ridge. Wedge formations!’ Those skirmishers are too thinly arrayed to hold.\u003c/p\u003e\n\u003cp\u003e‘Atri-Preda!’ called an aide. ‘Movement to the north side!’\u003c/p\u003e\n\u003cp\u003eShe cantered her horse to the very edge of the rise and scanned the scene below and to her left. ‘Report!’\u003c/p\u003e\n\u003cp\u003e‘Bluerose lancers in retreat, Atri-Preda-the valley floor beyond the chokepoint is theirs-’\u003c/p\u003e\n\u003cp\u003e‘What? How many damned horse-archers does he have?’\u003c/p\u003e\n\u003cp\u003eThe officer shook her head. ‘Wardogs, sir. Close on two thousand of the damned things-moving through the high grasses in the basin-they were on the lancers before they knew it. The horses went wild, sir-’\u003c/p\u003e\n\u003cp\u003e‘Shit!’ Then, upon seeing the messenger’s widening eyes, she steeled herself. ‘Very well. Move the reserve medium to the north flank of the knoll.’ Seven hundred and fifty, Merchants’ Battalion-I doubt they’d try sending dogs against that. I can still advance them to retake the chokepoint’s debouch, when the time comes.\u003c/p\u003e\n\u003cp\u003eAs she thought this, she was scanning the array before her. Directly opposite, the thousand Harridict skirmishers had crossed the riverbed, even as the Crimson Rampant sawtooth advance moved onto level ground.\u003c/p\u003e\n\u003cp\u003eAnd Redmask’s five wedges of warriors were marching to meet them. Excellent. We’ll lock that engagement-with ballistae enfilade to weaken their north flank-then down come the Crimson Rampant medium, to wheel into their flank. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-182.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
