{"id":104294,"no":183,"title":"Page 183","content":"\u003cp\u003eSurprisingly the Awl wedges more or less held to their formations, although they were each maintaining considerable distance from their flanking neighbours-once the space drew tighter, she suspected, the wedges would start mixing, edges pulled ragged. Marching in time was the most difficult battlefield manoeuvre, after all. Between each of them, then, could be found the weak points. Perhaps enough to push through with the saw’s teeth and begin isolating each wedge.\u003c/p\u003e\n\u003cp\u003e‘Wardogs on the knoll!’\u003c/p\u003e\n\u003cp\u003eShe spun at the cry. ‘Errant’s kick!’ Frenzied barking, shrieks from the weapon crews-‘Second reserve legion-the Artisan! Advance on the double-butcher those damned things!’\u003c/p\u003e\n\u003cp\u003eObscurely, she suddenly recalled a scene months ago-wounded but alive, less than a handful of the beasts on a hill overlooking an Awl camp, watching the Letherii slaughtering the last of their masters. And she wondered, with a shiver of superstitious fear, if those beasts were now exacting ferocious vengeance. Dammit, Bivatt-never mind all that.\u003c/p\u003e\n\u003cp\u003eThe Awl spear-heads were not drawing together, she saw-nor was there need to, now that she’d temporarily lost her ballistae. Indeed, the two northernmost of those wedges were now angling to challenge her Crimson Rampant medium. But this would be old-style fighting, she knew-and the Awl did not possess the discipline nor the training for this kind of steeled butchery.\u003c/p\u003e\n\u003cp\u003eYet, Redmask is not waging this battle in the Awl fashion, is he? No, this is something else. He’s treating this like a plains engagement in miniature-the. way those horse-archers wheeled, reformed, then reformed again-a hit and run tactic, all on a compacted scale.\u003c/p\u003e\n\u003cp\u003eI see now-hut it will not work for much longer.\u003c/p\u003e\n\u003cp\u003eOnce his warriors locked with her mailed fist.\u003c/p\u003e\n\u003cp\u003eThe Awl spear-heads were now nearing the flat of the riverbed-the two sides would engage on the hardpacked sand of the bed itself. No advantage of slope to either side-until the tide shifts. One way or the other-no, do not think-\u003c/p\u003e\n\u003cp\u003eA new reverberation trembled through the ground now. Deeper, rolling, ominous.\u003c/p\u003e\n\u003cp\u003eFrom the dust, between the Awl wedges, huge shapes loomed, rumbled forward.\u003c/p\u003e\n\u003cp\u003eWagons. Awl wagons, the six-wheeled bastards-not drawn, but pushed. Their beds were crowded with half-naked warriors, spears bristling. The entire front end of each rocking, pitching wagon was a horizontal forest of oversized spears. Round-shields overlapped to form a half-turtleshell that encased the forward section.\u003c/p\u003e\n\u003cp\u003eThey now thundered through the broad gaps between the wedges-twenty, fifty, a hundred-lumbering yet rolling so swiftly after the long descent into the valley that the masses of burly warriors who had been pushing them now trailed in their wake, sprinting to catch up.\u003c/p\u003e\n\u003cp\u003eThe wagons plunged straight into the face of the Crimson Rampant heavy infantry.\u003c/p\u003e\n\u003cp\u003eArmoured bodies cartwheeled above the press as the entire saw-tooth formation was torn apart-and now the bare-chested fanatics riding those wagons launched themselves out to all sides, screaming like demons.\u003c/p\u003e\n\u003cp\u003eThe three wedges facing the heavy infantry then thrust into the chaotic wake, delivering frenzied slaughter.\u003c/p\u003e\n\u003cp\u003eBivatt stared, disbelieving, then snapped, Artisan heavy, advance down at the double, crescent, and prepare to cover the retreat.’\u003c/p\u003e\n\u003cp\u003eThe aide beside her stared. ‘Retreat, Atri-Preda?’\u003c/p\u003e\n\u003cp\u003e‘You heard me! Signal general withdrawal and sound the Crimson Rampant to retreat! Quickly, before every damned one of them is butchered!’\u003c/p\u003e\n\u003cp\u003eWill Redmask follow? Oh, I’ll lose heavily if he does-but I’ll also hit back hard-on the plain. I’ll see his bones burst into flames-\u003c/p\u003e\n\u003cp\u003eShe heard more wagons, this time to her right. My other advance-‘Sound general withdrawal!’\u003c/p\u003e\n\u003cp\u003eHorns blared.\u003c/p\u003e\n\u003cp\u003eShouts behind her. ‘Attack on the baggage camp!\u003c/p\u003e\n\u003cp\u003eAttack-’\u003c/p\u003e\n\u003cp\u003e‘Quiet! Do you think the Edur cannot deal with that?’ She prayed Brohl Handar could. Without supplies this campaign was over. Without supplies, we’ll never make it back to Drene. Errant fend, I have been outwitted at every turn-\u003c/p\u003e\n\u003cp\u003eAnd now the sound behind her was rising to challenge that in the valley below. With sick dread, she tugged her horse round and rode back, past the signallers’ platform.\u003c/p\u003e\n\u003cp\u003eHer remaining reserve units had all wheeled round, reversing their facing. Seeing an officer riding between two of the squares, Bivatt spurred to catch him.\u003c/p\u003e\n\u003cp\u003e‘What in the Errant’s name is happening over there?’ she demanded. Distant screams, the reek of smoke, thunder-\u003c/p\u003e\n\u003cp\u003eThe helmed head swung round, the face beneath it pale. ‘Demons, Atri-Preda! The mages pursue them-’\u003c/p\u003e\n\u003cp\u003e‘They what? Recall them, damn you! Recall them now!’\u003c/p\u003e\n\u003cp\u003eBrohl Handar sat astride his horse in the company of eight Arapay war leaders, four warlocks and the Den-Ratha K’risnan. The two thousand foot soldiers-Tiste Edur warriors, categorized in Letherii military terms as medium to light infantry-were arranged into eight distinct blocks, fully caparisoned in armour and awaiting the word to march. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-183.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
