{"id":104308,"no":197,"title":"Page 197","content":"\u003cp\u003eEven now, over a year later, Blistig wondered if she had said what was needed. In truth, he was not quite certain what she had said. The meaning of it. Witnessed, unwitnessed, does it really make a difference? But he knew the answer to that, even if he could not articulate precisely what it was he knew. Something stirred deep in the pit of his soul, as if his thoughts were black waters caressing unseen rocks, bending to shapes that even ignorance could not alter.\u003c/p\u003e\n\u003cp\u003eWell, how can any of this make sense? I do not have the words.\u003c/p\u003e\n\u003cp\u003eBut damn me, she did. Back then. She did.\u003c/p\u003e\n\u003cp\u003eUnwitnessed. There was crime in that notion. A profound injustice against which he railed. In silence. Like every other soldier in the Bonehunters. Maybe. No, I am not mistaken-I see something in their eyes. I can see it. We rail against injustice, yes. That what we do will be seen by no-one. Our fate unmeasured.\u003c/p\u003e\n\u003cp\u003eTavore, what have you awakened? And, Hood take us, what makes you think we are equal to any of this?\u003c/p\u003e\n\u003cp\u003eThere had been no desertions. He did not understand. He didn’t think he would ever understand. What had happened that night, what had happened in that strange speech.\u003c/p\u003e\n\u003cp\u003eShe told us we would never see our loved ones again. That is what she told us: Isn’t it?\u003c/p\u003e\n\u003cp\u003eLeaving us with what?\u003c/p\u003e\n\u003cp\u003eWith each other, I suppose.\u003c/p\u003e\n\u003cp\u003e‘We shall be our own witness.’\u003c/p\u003e\n\u003cp\u003eAnd was that enough?\u003c/p\u003e\n\u003cp\u003eMaybe. So far.\u003c/p\u003e\n\u003cp\u003eBut now we are here. We have arrived. The fleet, the fleet burns-gods, that she would do that. Not a single transport left. Burned, sunk to the bottom off this damned shore. We are… cut away.\u003c/p\u003e\n\u003cp\u003eWelcome, Bonehunters, to the empire of Lether.\u003c/p\u003e\n\u003cp\u003eAlas, we are not here in festive spirit.\u003c/p\u003e\n\u003cp\u003eThe treacherous ice was behind them now, the broken mountains that had filled the sea and clambered onto the Fent Reach, crushing everything on it to dust. No ruins to ponder over in some distant future, not a single sign of human existence left on that scraped rock. Ice was annihilation. It did not do what sand did, did not simply bury every trace. It was as the Jaghut had meant it: negation, a scouring down to bare rock.\u003c/p\u003e\n\u003cp\u003eLostara Yil drew her fur-lined cloak tighter about herself as she followed the Adjunct to the forecastle deck of the Froth Wolf. The sheltered harbour was before them, a half-dozen ships anchored in the bay, including the Silanda-its heap of Tiste Andii heads hidden beneath thick tarpaulin. Getting the bone whistle from Gesler hadn’t been easy, she recalled; and among the soldiers of the two squads left to command the haunted craft, the only one willing to use it had been that corporal, Deadsmell. Not even Sinn would touch it.\u003c/p\u003e\n\u003cp\u003eBefore the splitting of the fleet there had been a flurry of shifting about among the squads and companies. The strategy for this war demanded certain adjustments, and, as was expected, few had been thrilled with the changes. Soldiers are such conservative bastards.\u003c/p\u003e\n\u003cp\u003eBut at least we pulled Blistig away from real command-worse than a rheumy old dog, that one.\u003c/p\u003e\n\u003cp\u003eLostara, still waiting for her commander to speak, turned for a glance back at the Throne of War blockading the mouth of the harbour. The last Perish ship in these waters, for now. She hoped it would be enough for what was to come.\u003c/p\u003e\n\u003cp\u003e‘Where is Sergeant Cord’s squad now/’ the Adjunct asked.\u003c/p\u003e\n\u003cp\u003e‘Northwest tip of the island,’ Lostara replied. ‘Sinn is keeping the ice away-’\u003c/p\u003e\n\u003cp\u003e‘How?’ Tavore demanded, not for the first time.\u003c/p\u003e\n\u003cp\u003eAnd Lostara could but give the same answer she had given countless times before. ‘I don’t know, Adjunct.’ She hesitated, then added, ‘Ebron believes that this ice is dying. A Jaghut ritual, crumbling. He notes the water lines on this island’s cliffs-well past any earlier high water mark.’\u003c/p\u003e\n\u003cp\u003eTo this the Adjunct said nothing. She seemed unaffected by the cold, damp wind, barring an absence of colour on her features, as if her blood had withdrawn from the surface of her flesh. Her hair was cut very short, as if to discard every hint of femininity.\u003c/p\u003e\n\u003cp\u003e‘Grub says the world is drowning,’ Lostara said.\u003c/p\u003e\n\u003cp\u003eTavore turned slightly and looked up at the unlit shrouds high overhead. ‘Grub. Another mystery,’ she said.\u003c/p\u003e\n\u003cp\u003e‘He seems able to communicate with the Nachts, which is, well, remarkable.’\u003c/p\u003e\n\u003cp\u003e‘Communicate? It’s become hard to tell them apart.’\u003c/p\u003e\n\u003cp\u003eThe Froth Wolf was sidling past the anchored ships, angling towards the stone pier, on which stood two figures. Probably Sergeant Balm and Deadsmell.\u003c/p\u003e\n\u003cp\u003eTavore said, ‘Go below, Captain, and inform the others we are about to disembark.’\u003c/p\u003e\n\u003cp\u003e‘Aye, sir.’\u003c/p\u003e\n\u003cp\u003eRemain a soldier, Lostara Yil told herself, a statement that whispered through her mind a hundred times a day. Remain a soldier, and all the rest will go away. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-197.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
