{"id":104327,"no":217,"title":"Page 217","content":"\u003cp\u003eHe gives me nothing. ‘We shall make use of it, all the way out to Third Maiden Fort.’\u003c/p\u003e\n\u003cp\u003eA nod.\u003c/p\u003e\n\u003cp\u003e‘Before that, however, we must summon the witches and warlocks.’\u003c/p\u003e\n\u003cp\u003e‘You’ll find most of them huddled in the village yonder, Queen. And Pully and Skwish will have announced your return. Taloned toes are tapping the floorboards, I would wager.’\u003c/p\u003e\n\u003cp\u003e‘Go down there,’ she commanded, facing the inn. ‘Escort them back here-I will be in the tavern.’\u003c/p\u003e\n\u003cp\u003e‘And if the tavern is not big enough?’\u003c/p\u003e\n\u003cp\u003eAn odd concern. She began walking towards the entrance. ‘Then they can perch on shoulders like the crows they are, Yedan.’\u003c/p\u003e\n\u003cp\u003e‘Twilight.’\u003c/p\u003e\n\u003cp\u003eShe half turned.\u003c/p\u003e\n\u003cp\u003eYedan was tightening the straps of his helm once again. ‘Do not do it.’\u003c/p\u003e\n\u003cp\u003e‘Do not do what?’\u003c/p\u003e\n\u003cp\u003e‘Send us to war, sister.’\u003c/p\u003e\n\u003cp\u003eShe studied him.\u003c/p\u003e\n\u003cp\u003eBut he said nothing more, and a moment later he had turned away and set off down towards the village.\u003c/p\u003e\n\u003cp\u003eShe resumed her walk, while her soldiers led the mounts towards the stable, the beasts’ hoofs slipping on the slick logs of the courtyard. They had ridden hard, these last horses drawn from a virtually empty garrison fort just north of Tulamesh-reports of bandits had sent the squads into the countryside and they’d yet to return. Yan Tovis believed they would never do so.\u003c/p\u003e\n\u003cp\u003eAt the entranceway she paused, looking down at the slab of stone beneath her boots, on which were carved Shake runes.\u003c/p\u003e\n\u003cp\u003e‘This Raised Stone honours Teyan Atovis, Rise, who was claimed by the Shore 1113th Year of the Isle. Slain by the Letherii for Debts Unremitted.’\u003c/p\u003e\n\u003cp\u003eYan Tovis grunted. One of her kin, no less, dead a thousand years now. ‘Well, Teyan,’ she muttered, ‘you died of drink, and now your stone straddles the threshold of a tavern.’ True, some list of mysterious, crushing debts had invited his ignoble fall to alcohol and misery, but this grand commemoration had taken a slanted view on the hands guiding the man’s fate. And now… Brullyg would be Rise. Will you wear the crown as well as Teyan did?\u003c/p\u003e\n\u003cp\u003eShe pushed open the door and strode inside.\u003c/p\u003e\n\u003cp\u003eThe low-ceilinged room was crowded, every face turned to her.\u003c/p\u003e\n\u003cp\u003eA familiar figure pushed into view, her face a mass of wrinkles twisted into a half-smile.\u003c/p\u003e\n\u003cp\u003e‘Pully,’ Twilight said, nodding. ‘I have just sent the Watch down to the village to find you.’\u003c/p\u003e\n\u003cp\u003e‘Be well he’ll find Skwish and a score others. They be well weaving cob to web on th’ close sea beyond the shore, Queen, an’ all the truths writ there. Strangers-’\u003c/p\u003e\n\u003cp\u003e‘I know,’ Yan Tovis interjected, looking past the old hag and scanning the other witches and warlocks, the Shoulderfolk of the Old Ways. Their eyes glittered in the smoky gloom, and Twilight could now smell these Shake elders-half-unravelled damp wool and patchy sealskin, fish-oil and rank sweat, the breath coming from mouths dark with sickened gums or rotting teeth.\u003c/p\u003e\n\u003cp\u003eIf there was a proprietor to this tavern he or she had fled. Casks had been broached and tankards filled with pungent ale. A huge pot of fish soup steamed on the centre hearth and there were countless gourd-shell bowls scattered on the tables. Large rats waddled about on the filthy floor.\u003c/p\u003e\n\u003cp\u003eFar more witches than warlocks, she noted. This had been a discernible trend among the demon-kissed-fewer and fewer males born bearing the accepted number of traits; most were far too demonic. More than two hundred of the Shoulderfolk. Gathered here.\u003c/p\u003e\n\u003cp\u003e‘Queen,’ Pully ventured, ducking her head. ‘Cob to web, all of Shake blood know that you now rule. Barring them that’s on the Isle, who only know that your mother’s dead.’\u003c/p\u003e\n\u003cp\u003e‘So Brullyg is there, anticipating…’\u003c/p\u003e\n\u003cp\u003e‘Aye, Twilight, that be well he will be Rise, King of the Shake.’\u003c/p\u003e\n\u003cp\u003eErrant take me. ‘We must sail to the Isle.’\u003c/p\u003e\n\u003cp\u003eA murmur of agreement amidst the eager quaffing of ale.\u003c/p\u003e\n\u003cp\u003e‘You intend, this night,’ Yan Tovis said, ‘a ritual.’\u003c/p\u003e\n\u003cp\u003e‘We are loosening the chains as they say, Queen. There are nets be strung across the path of the world, t’see what we catch.’\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003ePully’s black eyes narrowed. ‘What’s that?’\u003c/p\u003e\n\u003cp\u003e‘No. There will be no ritual tonight. Nor tomorrow night, nor the next. Not until we are on the Isle, and perhaps not even then.’\u003c/p\u003e\n\u003cp\u003eNot a sound in the tavern now.\u003c/p\u003e\n\u003cp\u003ePully opened her mouth, shut it, then opened it again. ‘Queen, the shore be alive wi’ voices as they say and the words they are for us. These-these they be the Old Ways, our ways-’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-217.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
