{"id":104330,"no":220,"title":"Page 220","content":"\u003cp\u003eA dragon through fire, a ship riding flames-his first sight of a Tiste Edur: dead, pinned to his chair by a giant’s spear. Oar benches where sat decapitated rowers, hands resting on the sweeps, and their severed heads heaped in a pile round the mainmast, eyes blinking in the sudden light, faces twisting into appalling expressions-\u003c/p\u003e\n\u003cp\u003eSo who built twelve wells in a forest? That’s what I want to know.\u003c/p\u003e\n\u003cp\u003eMaybe.\u003c/p\u003e\n\u003cp\u003eHe recalled a knock at the door, and opening it to see, with absurd delight, a drenched T’lan Imass whom he recognized. Stormy, it’s for you. And aye, I dream of moments like this, you red-haired ox. And what did that say about Gesler himself? Wait, I’m not that curious.\u003c/p\u003e\n\u003cp\u003e‘There you are.’\u003c/p\u003e\n\u003cp\u003eGesler looked up. ‘Stormy. I was just thinking of you.’\u003c/p\u003e\n\u003cp\u003e‘Thinking what?’\u003c/p\u003e\n\u003cp\u003eHe waved at the well’s black hole. ‘If you’d fit, of course. Most of you would go, but not, alas, your head.’\u003c/p\u003e\n\u003cp\u003e‘You keep forgetting, Gesler,’ the corporal said as he drew nearer, ‘I was one of the ones who punched back.’\u003c/p\u003e\n\u003cp\u003e‘Got no recollection of that at all.’\u003c/p\u003e\n\u003cp\u003e‘Want me to remind you?’\u003c/p\u003e\n\u003cp\u003e‘What I want is to know why you’re bothering me.’\u003c/p\u003e\n\u003cp\u003e‘We’re all gettin’ ready to head out.’\u003c/p\u003e\n\u003cp\u003e‘Stormy.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘What do you think about all this?’\u003c/p\u003e\n\u003cp\u003e‘Someone liked building wells.’\u003c/p\u003e\n\u003cp\u003e‘Not this. I mean, the war. This war, the one here.’\u003c/p\u003e\n\u003cp\u003e‘I’ll let you know once we start busting heads.’\u003c/p\u003e\n\u003cp\u003e‘And if that never happens?’\u003c/p\u003e\n\u003cp\u003eStormy shrugged, ran thick fingers through his knotted beard. ‘Just another typical Bonehunter war, then.’\u003c/p\u003e\n\u003cp\u003eGesler grunted. ‘Go on, lead the way. Wait. How many battles have we fought, you and me?’\u003c/p\u003e\n\u003cp\u003e‘You mean, with each other?’\u003c/p\u003e\n\u003cp\u003e‘No, you damned idiot. I mean against other people. How many?’\u003c/p\u003e\n\u003cp\u003e‘I lost count.’\u003c/p\u003e\n\u003cp\u003e‘Liar.’\u003c/p\u003e\n\u003cp\u003e‘All right. Thirty-seven, but not counting Y’Ghatan since I wasn’t there. Thirty-eight for you, Gesler.’\u003c/p\u003e\n\u003cp\u003eAnd how many did we manage to avoid?’\u003c/p\u003e\n\u003cp\u003e‘Hundreds.’\u003c/p\u003e\n\u003cp\u003e‘So maybe, old friend, we’re just getting better at this.’\u003c/p\u003e\n\u003cp\u003eThe huge Falari scowled. ‘You trying to ruin my day, Sergeant?’\u003c/p\u003e\n\u003cp\u003eKoryk tightened the straps of his bulky pack. ‘I just want to kill someone,’ he growled.\u003c/p\u003e\n\u003cp\u003eBottle rubbed at his face then eyed the half-blood Seti.\u003c/p\u003e\n\u003cp\u003e‘There’s always Smiles. Or Tarr, if you jump him when he’s not looking.’\u003c/p\u003e\n\u003cp\u003e‘You being funny?’\u003c/p\u003e\n\u003cp\u003e‘No, just trying to deflect your attention from the weakest guy in this squad. Namely, me.’\u003c/p\u003e\n\u003cp\u003e‘You’re a mage. Sort of. You smell like one, anyway.’\u003c/p\u003e\n\u003cp\u003e‘What does that mean?’\u003c/p\u003e\n\u003cp\u003e‘If I kill you, you’d just curse me with your last breath, then I’d be miserable.’\u003c/p\u003e\n\u003cp\u003e‘So what would change, Koryk?’\u003c/p\u003e\n\u003cp\u003e‘Having a reason to be miserable is always worse than having no reason but being miserable anyway. If it’s just a way of life, I mean.’ He suddenly drew out the latest weapon in his arsenal, a long-knife. ‘See this? Just like the kind Kalam used. It’s a damned fast weapon, but I can’t see it doing much against armour.’\u003c/p\u003e\n\u003cp\u003e‘Where Kalam stuck them there wasn’t no armour. Throat, armpit, crotch-you should give it to Smiles.’\u003c/p\u003e\n\u003cp\u003e‘I grabbed it to keep it from her, idiot.’\u003c/p\u003e\n\u003cp\u003eBottle looked over to where Smiles had, moments earlier, disappeared into the forest. She was on her way back, the placid expression on her face hiding all sorts of evil, no doubt. ‘I hope we’re not expected to stand against Edur the way heavies are,’ he said to Koryk while watching Smiles. ‘Apart from you and Tarr, and maybe Corabb, we’re not a big mailed fist kind of squad, are we? So, in a way, this kind of war suits us-subterfuge, covert stuff.’ He glanced over and saw the half-blood glaring at him. Still holding the long-knife. ‘But maybe we’re actually more versatile. We can be half mailed fist and half black glove, right?’\u003c/p\u003e\n\u003cp\u003e‘Anyway,’ Koryk said, resheathing the weapon, ‘when I said I wanted to kill someone I meant the enemy.’\u003c/p\u003e\n\u003cp\u003eTiste Edur.’\u003c/p\u003e\n\u003cp\u003e‘Letherii bandits will do-there must be bandits around here somewhere.’\u003c/p\u003e\n\u003cp\u003e‘Why?’\u003c/p\u003e\n\u003cp\u003e‘What do you mean, why? There’s always bandits in the countryside, Bottle. Led by moustached rogues with fancy names. Zorala Snicker, or Pamby Doughty-’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-220.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
