{"id":104336,"no":226,"title":"Page 226","content":"\u003cp\u003eRejoining the captain outside he said to her, ‘We can go now.’\u003c/p\u003e\n\u003cp\u003e‘That’s it?’\u003c/p\u003e\n\u003cp\u003e‘Yes sir. We’ll be a thousand paces down the road before the Tellann lights up-’\u003c/p\u003e\n\u003cp\u003e‘Fire?’\u003c/p\u003e\n\u003cp\u003e‘Yes sir. A terrible fire-they won’t even be able to get close-and it’ll burn fast but go nowhere else and by the morning there’ll be nothing but ashes.’\u003c/p\u003e\n\u003cp\u003e‘And charred bones that might belong to horses.’\u003c/p\u003e\n\u003cp\u003e‘Yes sir.’\u003c/p\u003e\n\u003cp\u003e‘You’ve done well tonight, Beak,’ Faradan Sort said, swinging up onto one of the saddled horses.\u003c/p\u003e\n\u003cp\u003eFeeling impossibly light on his feet, Beak leapt onto the other one then looked back, with pride, at the remaining seven beasts. Decent animals, just badly treated. Which made it good that they were stealing them. Malazans knew how to care for their horses, after all.\u003c/p\u003e\n\u003cp\u003eThen he frowned and looked down at his stirrups.\u003c/p\u003e\n\u003cp\u003eThe captain was doing the same, he saw a moment later, with her own. ‘What is this?’ she demanded in a hiss.\u003c/p\u003e\n\u003cp\u003e‘Broken?’ Beak wondered.\u003c/p\u003e\n\u003cp\u003e‘Not that I can see-and yours are identical to mine. What fool invented these?’\u003c/p\u003e\n\u003cp\u003e‘Captain,’ said Beak, ‘I don’t think we have to worry much about Letherii cavalry, do we?’\u003c/p\u003e\n\u003cp\u003e‘You’ve that right, Beak. Well, let’s ride. If we’re lucky, we won’t break our necks twenty paces up the road.’\u003c/p\u003e\n\u003cp\u003eThe father of the man named Throatslitter used to tell stories of the Emperor’s conquest of Li Heng, long before Kellanved was emperor of anywhere. True, he’d usurped Mock on Malaz Island and had proclaimed himself the island’s ruler, but since when was Malaz Island anything but a squalid haven for pirates? Few on the mainland took much notice of such things. A new tyrannical criminal in place of the old tyrannical criminal.\u003c/p\u003e\n\u003cp\u003eThe conquest of Li Heng changed all that. There’d been no fleet of ships crowding the river mouth to the south and east of the city; nothing, in fact, to announce the assault. Instead, on a fine spring morning no different from countless other such mornings, Throatslitter’s father, along with thousands of other doughty citizens, had, upon a casual glance towards the Inner Focus where stood the Palace of the Protectress, noted the sudden inexplicable presence of strange figures on the walls and battlements. Squat, wide, wearing furs and wielding misshapen swords and axes. Helmed in bone.\u003c/p\u003e\n\u003cp\u003eWhat had happened to the vaunted Guard? And why were tendrils of smoke rising from the barracks of the courtyard and parade ground? And was it-was it truly-the Protectress herself who had been seen plunging from the High Tower beside the City Temple at the heart of the cynosure?\u003c/p\u003e\n\u003cp\u003eSomeone had cut off Li Heng’s head in the Palace. Undead warriors stood sentinel on the walls and, a short time later, emerged in their thousands from the Inner Focus Gate to occupy the city. Li Heng’s standing army-after a half-dozen suicidal skirmishes-capitulated that same day. Kellanved now ruled the city-state, and officers and nobles of the high court knelt in fealty, and the reverberations of this conquest rattled the windows of palaces across the entire mainland of Quon Tali.\u003c/p\u003e\n\u003cp\u003e‘This, son, was the awakening of the Logros T’lan lmass. The Emperor’s undead army. I was there, on the streets, and saw with my own eyes those terrible warriors with their pitted eyeholes, the stretched, torn skin, the wisps of hair bleached of all colour. They say, son, that the Logros were always there, below Reacher’s Falls. Maybe in the Crevasse, maybe not. Maybe just the very dust that blew in from the west every damned day and night-who can say? But he woke them, he commanded them, and 1 tell you after that day every ruler on Quon Tali saw a skull’s face in their silver mirror, aye.\u003c/p\u003e\n\u003cp\u003e‘The fleet of ships came later, under the command of three madmen ~ Crust, Vrko and Nok-but first to step ashore was none other than Surly and you know who she’d become, don’t you?’\u003c/p\u003e\n\u003cp\u003eDidn’t he just. Command of the T’lan lmass didn’t stop the knife in the back, did it? This detail was the defining revelation of Throatslitter’s life. Command thousands, tens of thousands. Command sorcerors and imperial fleets. Hold in your hand the lives of a million citizens. The real power was none of this. The real power was the knife in the hand, the hand at a fool’s back.\u003c/p\u003e\n\u003cp\u003eThe egalitarian plunge. There, Father, you old crab, a word you’ve never heard among the fifty or so you knew about in your long, pointless life. Paint on pots, now there’s a useless skill, since pots never survive, and so all those lovely images end up in pieces, on the pebbled beaches, in the fill between walls, on the fields of the farmers. And it’s true enough, isn’t it, Father, that your private firing of ‘The Coming of the Logros’ proved about as popular as a whore’s dose of the face-eater?\u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-226.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
