{"id":104341,"no":231,"title":"Page 231","content":"\u003cp\u003e‘I don’t know how you can say that,’ he said. ‘He sent our sons to retrieve the sword. That decision doomed them all. Us all. And look, we now sit in the palace of the Lether Empire, rotting in the filth of Letherii excess. We have no defence against indolence and apathy, against greed and decadence. These enemies do not fall to the sword, do not skid away from a raised shield.’\u003c/p\u003e\n\u003cp\u003e‘Hannan Mosag, husband, is our only hope. You must go to him.’\u003c/p\u003e\n\u003cp\u003e‘To conspire against our son?’\u003c/p\u003e\n\u003cp\u003e‘Who is, as you have said, insane. Blood is one thing,’ Uruth said, slowly leaning forward, ‘but we now speak of the survival of the Tiste Edur. Tomad, the women are ready-we have been ready for a long time.’\u003c/p\u003e\n\u003cp\u003eHe stared at her, wondering who this woman was, this cold, cold creature. Perhaps he was a coward, after all. When Rhulad had sent Trull away, he had said nothing. But then, neither had Uruth. And what of his own conspiracy? With Binadas? Find Trull. Please. Find the bravest among us. Recall the Sengar bloodline, son. Our first strides onto this world. Leading a legion onto its stony ground, loyal officers of Scabandari. Who drew the first Andii blood on the day of betrayal? That is our blood. That not this.\u003c/p\u003e\n\u003cp\u003eSo, Tomad had sent Binadas away. Had sent a son to his death. Because I had not the will to do it myself.\u003c/p\u003e\n\u003cp\u003eCoward.\u003c/p\u003e\n\u003cp\u003eWatching him still, Uruth carefully refilled her goblet.\u003c/p\u003e\n\u003cp\u003eBinadas, my son, your slayer awaits Rhulad’s pleasure. Is that enough?\u003c/p\u003e\n\u003cp\u003eLike any old fool who had once wagered mortal lives, the Errant wandered the corridors of enlivened power, muttering his litany of lost opportunities and bad choices. Exhalation of sorcery averted the eyes of those who strode past, the guards at various doorways and intersections, the scurrying servants who fought their losing battle with the crumbling residence known-now with irony-as the Eternal Domicile. They saw but did not see, and no after-image remained in their minds upon passing.\u003c/p\u003e\n\u003cp\u003eMore than any ghost, the Elder God was forgettable. But not as forgettable as he would have liked. He had worshippers now, at the cost of an eye binding him and his power, warring with his will in the guise of faith. Of course, every god knew of that war-such subversion seemed the primary purpose of every priest. Reduction of the sacred into the mundane world of mortal rivalries, politics and the games of control and manipulation of as many people as there were adherents. Oh, and yes, the acquisition of wealth, be it land or coin, be it the adjudication of fate or the gathering of souls.\u003c/p\u003e\n\u003cp\u003eWith such thoughts haunting him, the Errant stepped into the throne room, moving silently to one side to take his usual place against a wall between two vast tapestries, as unnoticed as the grandiose scenes woven into those frames-images in which could be found some figure in the background very closely resembling the Errant.\u003c/p\u003e\n\u003cp\u003eThe Chancellor Triban Gnol-with whom the Errant had shared a bed when expedience demanded it-stood before Rhulad who slouched like some sated monstrosity, poignant with wealth and madness. One of the Chancellor’s bodyguards hovered a few paces back from Gnol, looking bored as his master recited numbers. Detailing, once more, the growing dissolution of the treasury.\u003c/p\u003e\n\u003cp\u003eThese sessions, the Errant understood, with some admiration, were deliberate travails intended to further exhaust the Emperor. Revenues and losses, expenses and the sudden peak in defaulted debts, piled up in droning cadence like the gathering of forces preparing to lay siege. An assault against which Rhulad had no defence.\u003c/p\u003e\n\u003cp\u003eHe would surrender, as he always did. Relinquishing all management to the Chancellor. A ritual as enervating to witness as it was to withstand, yet the Errant felt no pity. The Edur were barbarians. Like children in the face of civilized sophistication.\u003c/p\u003e\n\u003cp\u003eWhy do 1 come here, day after day? What am 1 waiting to witness here? Rhulad’s final collapse? Will that please me? Entertain me? How sordid have my tastes become?\u003c/p\u003e\n\u003cp\u003eHe held his gaze on the Emperor. Dulled coins luridly gleaming, a rhythm of smudged reflection rising and settling with Rhulad’s breathing; the black sanguine promise of the sword’s long, straight blade, tip dug into the marble dais, the grey bony hand gripping the wire-wrapped handle. Sprawled there on his throne, Rhulad was indeed a metaphor made real. Armoured in riches and armed with a weapon that promised both immortality and annihilation, he was impervious to everything but his own growing madness. When Rhulad fell, the Errant believed, it would be from the inside out.\u003c/p\u003e\n\u003cp\u003eThe ravaged face revealed this truth in a cascade of details, from the seamed scars of past failures to which, by virtue of his having survived them, he was indifferent, to whatever lessons they might hold. Pocked flesh to mock the possession of wealth long lost. Sunken eyes wherein resided the despairing penury of his spirit, a spirit that at times pushed close to those glittering dark prisms and let loose its silent howl. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-231.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
