{"id":104343,"no":233,"title":"Page 233","content":"\u003cp\u003e‘In droves, sire. Alas.’\u003c/p\u003e\n\u003cp\u003e‘We rescued them to deliver our own torment. Rescued them to kill them.’\u003c/p\u003e\n\u003cp\u003e‘It is, I would suggest, a somewhat unjust fate-’\u003c/p\u003e\n\u003cp\u003e‘Unjust? You scrawny snake-why did you not tell me of this before?’\u003c/p\u003e\n\u003cp\u003e‘Emperor, you indicated no interest in the financial details-’\u003c/p\u003e\n\u003cp\u003eOh, a mistake there, Gnol.\u003c/p\u003e\n\u003cp\u003e“The what?’\u003c/p\u003e\n\u003cp\u003eBeads of sweat on the back of the Chancellor’s neck now. “The varied expenses associated with their imprisonment, sire.’\u003c/p\u003e\n\u003cp\u003e‘They are Tiste Edur!’\u003c/p\u003e\n\u003cp\u003eAnother bow.\u003c/p\u003e\n\u003cp\u003eRhulad suddenly clawed at his face and looked away. ‘Edur blood,’ he murmured. ‘Rescued from slavery. Trench-pens is their reward.’\u003c/p\u003e\n\u003cp\u003eTriban Gnol cleared his throat. ‘Many died in the holds of the ships, sire. As I understand it, their maltreatment began upon leaving Sepik Island. What is it you would have me do, Emperor?’\u003c/p\u003e\n\u003cp\u003eAnd so deftly you regain ground, Triban Gnol.\u003c/p\u003e\n\u003cp\u003e‘Bring me Tomad Sengar. And Uruth. Bring to me my father and mother.’\u003c/p\u003e\n\u003cp\u003e‘Now?’\u003c/p\u003e\n\u003cp\u003eThe sword scraped free, point lifting to centre on Triban Gnol. ‘Yes, Chancellor. Now.’\u003c/p\u003e\n\u003cp\u003eTriban Gnol and his bodyguard quickly departed.\u003c/p\u003e\n\u003cp\u003eRhulad was alone in his throne room, now holding his sword out on nothing.\u003c/p\u003e\n\u003cp\u003e‘How? How could they do this? These poor people-they are of our own blood. I need to think.’ The Emperor lowered the sword then shifted about on the throne, drawing his coin-clad legs up. ‘How? Nisall? Explain this to me-no, you cannot, can you. You have fled me. Where are you, Nisall? Some claim you are dead. Yet where is your body? Are you just another bloated corpse in the canal-the ones I see from the tower-were you one of those, drifting past? They tell me you were a traitor. They tell me you were not a traitor. They all lie to me. I know that, I can see that. Hear that. They all lie to me-’ He sobbed then, his free hand covering his mouth, his eyes darting about the empty room.\u003c/p\u003e\n\u003cp\u003eThe Errant saw that gaze slide right over him. He thought to step forward then, to relinquish the sorcery hiding him, to say to the Emperor: Yes, sire. They all lie to you. But I will not. Do you dare hear the truth, Emperor Rhukd? All of it?\u003c/p\u003e\n\u003cp\u003e‘Slaves. This-this is wrong. Tomad-Father-where did this cruelty come from?’\u003c/p\u003e\n\u003cp\u003eOh, dear Rhulad…\u003c/p\u003e\n\u003cp\u003e‘Father, we will talk. You and me. Alone. And Mother, yes, you too. The three of us. It has been so long since we did that. Yes, that is what we will do. And you must… you must not lie to me. No, that I will not accept.\u003c/p\u003e\n\u003cp\u003e‘Father, where is Nisall?\u003c/p\u003e\n\u003cp\u003e‘Where is Trull?’\u003c/p\u003e\n\u003cp\u003eCould an Elder God’s heart break? The Errant almost sagged then, as Rhulad’s plaintive query echoed momentarily in the chamber, then quickly died, leaving only the sound of the Emperor’s laboured breathing.\u003c/p\u003e\n\u003cp\u003eThen, a harder voice emerging from the Emperor: ‘Hannan Mosag, this is all your fault. You did this. To us. To me. You twisted me, made me send them all away. To find champions. But no, that was my idea, wasn’t it? I can’t-can’t remember-so many lies here, so many voices, all lying. Nisall, you left me. Udinaas-I will find you both. I will see the skin flayed fr6m your writhing bodies, I will listen to your screams-’\u003c/p\u003e\n\u003cp\u003eThe sound of boots in the hallway beyond.\u003c/p\u003e\n\u003cp\u003eRhulad looked up guiltily, then settled into the throne. Righting the weapon. Licking his lips. Then, as the doors creaked open, he sat with a fixed grin, a baring of his teeth to greet his parents.\u003c/p\u003e\n\u003cp\u003eDessert arrived at the point of a sword. A full dozen Letherii guards, led by Sirryn Kanar, burst into the private chambers of Tomad and Uruth Sengar. Weapons drawn, they entered the dining room to find the two Edur seated each at one end of the long table.\u003c/p\u003e\n\u003cp\u003eNeither had moved. Neither seemed surprised.\u003c/p\u003e\n\u003cp\u003e‘On your feet,’ Sirryn growled, unable to hide his satisfaction, his delicious pleasure at this moment. ‘The Emperor demands your presence. Now.’\u003c/p\u003e\n\u003cp\u003eThe tight smile on Tomad’s face seemed to flicker a moment, before the old warrior rose to his feet.\u003c/p\u003e\n\u003cp\u003eSneering, Uruth had not moved. ‘The Emperor would see his mother? Very well, he may ask.’\u003c/p\u003e\n\u003cp\u003eSirryn looked down at her. ‘This is a command, woman.’\u003c/p\u003e\n\u003cp\u003e‘And I am a High Priestess of Shadow, you pathetic thug.’\u003c/p\u003e\n\u003cp\u003e‘Sent here by the Emperor’s will. You will stand, or-’\u003c/p\u003e\n\u003cp\u003e‘Or what? Will you dare lay hands on me, Letherii? Recall your place.’\u003c/p\u003e\n\u003cp\u003eThe guard reached out.\u003c/p\u003e\n\u003cp\u003e‘Stop!’ Tomad shouted. ‘Unless, Letherii, you wish your flesh torn from your bones. My wife has awakened Shadow, and she will not suffer your touch.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-233.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
