{"id":104346,"no":236,"title":"Page 236","content":"\u003cp\u003eHe did not believe it possible that flesh could move in as many directions all at once, every swell beneath the silk seemingly possessed of corporeal independence, yet advancing in a singular chorus of overt sexuality. Her shadow engulfing him, Tehol loosed a small whimper, struggling to drag his eyes up, past the stacked folds of her belly, past the impossibly high, bulging, grainsack-sized breasts-lost for a moment in that depthless cleavage-then, with heroic will, yet higher to the smooth udder beneath her chin; higher still, neck straining, to that so round face with its broad, painted, purple lips-higher-Errant help me-to those delicious, knowing eyes.\u003c/p\u003e\n\u003cp\u003e‘You disgust me, Tehol.’\u003c/p\u003e\n\u003cp\u003e‘I-what?’\u003c/p\u003e\n\u003cp\u003e‘Where’s Bugg with that damned couch?’\u003c/p\u003e\n\u003cp\u003eTehol leaned forward, then recoiled again with instinctive self-preservation. ‘Rucket? Is that you?’\u003c/p\u003e\n\u003cp\u003e‘Quiet, you fool. Do you have any idea how long it took us to perfect this illusion?’\u003c/p\u003e\n\u003cp\u003e‘B-but-’\u003c/p\u003e\n\u003cp\u003e‘The best disguise is misdirection.’\u003c/p\u003e\n\u003cp\u003e‘Misdirection? Oh, why… oh, well of course, when you put it that way. I mean, all the way. Sorry, that just tumbled out. Came out wrong, I mean-’\u003c/p\u003e\n\u003cp\u003e‘Stop staring at my tits.’\u003c/p\u003e\n\u003cp\u003e‘I’d be the only one in here not staring,’ he retorted, ‘which would be very suspicious. Besides, who decided on that particular… defiance of the earth’s eternal pull? Probably Ormly-it’s those piggy eyes of his, hinting at perverse fantasies.’\u003c/p\u003e\n\u003cp\u003eBugg had arrived with two of Huldo’s servers carrying the couch between them. They set it down then hastily retreated.\u003c/p\u003e\n\u003cp\u003eBugg returned to his seat. ‘Rucket,’ he said under his breath, shaking his head, ‘do you not imagine that a woman of your stature would not already be infamous in Letheras?’\u003c/p\u003e\n\u003cp\u003e‘Not if I never went out, would I? As it turns out, there are plenty of recluses in this city-’\u003c/p\u003e\n\u003cp\u003e‘Because most of them were the Guild’s illusions-false personalities you could assume when necessity demanded it.’\u003c/p\u003e\n\u003cp\u003e‘Precisely,’ she said, as if settling the matter.\u003c/p\u003e\n\u003cp\u003eWhich she then did with consummate grace, easing down fluidly into the huge couch, her massive alabaster arms spreading out along the back, which had the effect of hitching her breasts up still further then spreading them like the Gates of the Damned.\u003c/p\u003e\n\u003cp\u003eTehol glanced at Bugg. ‘There are certain laws regarding the properties of physical entities, yes? There must be. I’m sure of it.’\u003c/p\u003e\n\u003cp\u003e‘She is a defiant woman, Master. And please, if you will, adjust your blanket. Yes, there, beneath this blessed table.’\u003c/p\u003e\n\u003cp\u003e‘Stop that.’\u003c/p\u003e\n\u003cp\u003e‘Whom or what are you addressing?’ Rucket asked with a leer big enough for two women.\u003c/p\u003e\n\u003cp\u003e‘Damn you, Rucket, we’d just ordered, you know. Bugg’s purse, or his company’s, that is. And now my appetite… well… it’s-’\u003c/p\u003e\n\u003cp\u003e‘Shifted?’ she asked, thin perfect brows lifting above those knowing eyes. ‘The problem with men elucidated right there: your inability to indulge in more than one pleasure at any one time.’\u003c/p\u003e\n\u003cp\u003e‘Which you presently personify with terrible perfection. So, how precise is this illusion of yours? I mean, the couch creaked and everything.’\u003c/p\u003e\n\u003cp\u003e‘No doubt you’re most eager to explore that weighty question. But first, where’s Huldo with my lunch?’\u003c/p\u003e\n\u003cp\u003e‘He took one look at you and then went out to hire more cooks.’\u003c/p\u003e\n\u003cp\u003eShe leaned forward and pulled Tehol’s plate closer. ‘This will do. Especially after that cruel attempt at humour, Tehol.’ She began eating with absurd delicacy.\u003c/p\u003e\n\u003cp\u003e‘There’s no real way in there, is there?’\u003c/p\u003e\n\u003cp\u003eMorsel of food halted halfway to her open mouth.\u003c/p\u003e\n\u003cp\u003eBugg seemed to choke on something.\u003c/p\u003e\n\u003cp\u003eTehol wiped sweat from his brow. ‘Errant take me, I’m losing my mind.’\u003c/p\u003e\n\u003cp\u003e‘You force me,’ Rucket said, ‘to prove to you otherwise.’ The dainty popped into her mouth.\u003c/p\u003e\n\u003cp\u003e‘You expect me to succumb to an illusion?’\u003c/p\u003e\n\u003cp\u003e‘Why not? Men do that a thousand times a day.’\u003c/p\u003e\n\u003cp\u003e‘Without that, the world would grind to a halt.’\u003c/p\u003e\n\u003cp\u003e‘Yours, maybe.’\u003c/p\u003e\n\u003cp\u003e‘Speaking of which,’ Bugg interjected hastily, ‘your Guild, Rucket, is about to become bankrupt.’\u003c/p\u003e\n\u003cp\u003e‘Nonsense. We have more wealth hidden away than the Liberty Consign.’\u003c/p\u003e\n\u003cp\u003e‘That’s good, because they’re about to discover that most of their unadvertised holdings have been so thoroughly undermined that they’re not only worthless, but fatal liabilities.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-236.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
