{"id":104356,"no":246,"title":"Page 246","content":"\u003cp\u003eWhen the Warlock King had first found this chamber, it and at least forty paces of the tunnel had been under water, the depth following the downward gradient until the black, murky sludge very nearly brushed the chamber’s ceiling.\u003c/p\u003e\n\u003cp\u003eHannan Mosag had drained the water through a modest rent that led into the realm of the Nascent, which he then closed, moving quickly in his crab-like scrabble to drag seven bundled arm-length shafts of Blackwood down the slimy corridor and into the chamber. It had begun refilling, of course, and the Warlock King sloshed his way to the centre, where he untied the bundle, then began constructing an octagonal fence, each stick a hand’s width in from the walls, two to each side, held mostly upright in the thick sludge covering the floor. When he had completed this task, he called upon his fullest unveiling of Kurald Emurlahn.\u003c/p\u003e\n\u003cp\u003eAt a dreadful cost. Seeking to purge the power of all chaos, of the poisonous breath of the Crippled God, he was almost unequal to the task. His malformed flesh, his twisted bones, the thin, blackened blood in his veins and arteries; these now served the malign world of the Fallen One, forming a symbiosis of life and power. It had been so long since he had last felt-truly felt-the purity of Kurald Emurlahn that, even in its fragmented, weakened state, he very nearly recoiled at its burning touch.\u003c/p\u003e\n\u003cp\u003eWith the air reeking of scorched flesh and singed hair, Hannan Mosag sought to force sanctification upon the chamber. Trapping the power of Shadow in this, his new, private temple. An entire night of struggle, the cold water ever rising, his legs numb, he began to feel his concentration tearing apart. In desperation-feeling it all slipping away-he called upon Father Shadow.\u003c/p\u003e\n\u003cp\u003eScabandari.\u003c/p\u003e\n\u003cp\u003eDespairing, knowing that he had failed-\u003c/p\u003e\n\u003cp\u003eAnd sudden power, pure and resolute, burgeoned in the chamber. Boiling away the water in roiling gusts of steam, until oven-dry heat crackled from the stone walls. The mud on the floor hardened, cementing the Blackwood shafts.\u003c/p\u003e\n\u003cp\u003eThat heat reached into Hannan Mosag’s flesh, down to grip his very bones. He had shrieked in agony, even as a new kind of life spread through him.\u003c/p\u003e\n\u003cp\u003eIt had not healed him; had done nothing to straighten his bones or unclench scarred tissue.\u003c/p\u003e\n\u003cp\u003eNo, it had been more like a promise, a whispering invitation to some blessed future. Fading in a dozen heartbeats, yet the memory of that promise remained with Hannan Mosag.\u003c/p\u003e\n\u003cp\u003eScabandari, Father Shadow, still lived. Torn from bone and flesh, true, but the spirit remained. Answering his desperate prayer, gifting this place with sanctity.\u003c/p\u003e\n\u003cp\u003eI have found the path. I can see the end.\u003c/p\u003e\n\u003cp\u003eNow he crouched on the hard, desiccated ground and Bruthen Trana-forced to hunch slightly because of the low ceiling-stood at his side. The Warlock King gestured to the centre of the chamber. ‘There, warrior. You must lie down. The ritual is readied, but I warn you, the journey will be long and difficult.’\u003c/p\u003e\n\u003cp\u003e‘I do not understand this, Warlock King. This… this temple. It is true Kurald Emurlahn.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Bruthen Trana. Blessed by the power of Father Shadow himself. Warrior, your journey itself is so blessed. Does this not tell you that we are on the right path?’\u003c/p\u003e\n\u003cp\u003eBruthen Trana stared down at him, was silent for a half-dozen heartbeats, then said, ‘You, among all others, should have been turned away. By Father Shadow. Your betrayal-’\u003c/p\u003e\n\u003cp\u003e‘My betrayal means nothing,’ the Warlock King snapped. ‘Warrior, we are blessed! This place, it is not simply a temple of Kurald Emurlahn! It is a temple of Scabandari! Of our god himself! The very first such temple in this realm-do you not grasp what that means? He is coming back. To us.’\u003c/p\u003e\n\u003cp\u003e‘Then perhaps what we seek is pointless,’ Bruthen replied.\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘Scabandari will return, and he will stand before Rhulad Sengar. Tell me, will your Crippled God risk that confrontation?’\u003c/p\u003e\n\u003cp\u003e‘Do not be a fool, Bruthen Trana. You ask the wrong question. Will Scabandari risk that confrontation? Upon the very moment of his return? We cannot know Father Shadow’s power, but I believe he will be weak, exhausted. No, warrior, it is for us to protect him upon his return. Protect, and nourish.’\u003c/p\u003e\n\u003cp\u003e‘Has Fear Sengar found him then?’\u003c/p\u003e\n\u003cp\u003eHannan Mosag’s dark eyes narrowed. ‘What do you know of that, Bruthen Trana?’\u003c/p\u003e\n\u003cp\u003e‘Only what most Edur know. Fear left, to seek out Father Shadow. In answer to his brother. In answer to you, Warlock King.’\u003c/p\u003e\n\u003cp\u003e‘Clearly,’ Hannan Mosag said in a tight voice, ‘there has been a reconciliation.’\u003c/p\u003e\n\u003cp\u003e‘Perhaps there has. You did not answer my question.’\u003c/p\u003e\n\u003cp\u003e‘I cannot. For I do not know.’\u003c/p\u003e\n\u003cp\u003e‘Do you dissemble yet again?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-246.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
