{"id":104396,"no":287,"title":"Page 287","content":"\u003cp\u003eSo what would happen if Logros led his thousands here? If Kron-But no, Silverfox wouldn’t permit that. She needed them for something else. For another war.\u003c/p\u003e\n\u003cp\u003eIt’d be nice to know how this fragment related to the one created for the Wolves at the end of the Pannion War. From what Quick Ben had understood, that Beast Hold, or whatever it had been called, had been seeded with the souls of T’lan Imass. Or at least the memories of those souls-could be that’s all a soul really is: the bound, snarled mass of memories from one life. Huh. Might explain why mine is such a mess. Too many lives, too many disparate strands all now tangled together…\u003c/p\u003e\n\u003cp\u003eTrull Sengar had set off in search of water-springs bubbled up from bedrock almost everywhere, as if even the stone itself was saturated with glacial melt.\u003c/p\u003e\n\u003cp\u003eOnrack eyed the cats for another moment then turned to Quick Ben. ‘There is a sweep of ice beyond these hills,’ he said. ‘I can smell its rot-an ancient road, once travelled by Jaghut. Fleeing slaughter. This intrusion, wizard, troubles me.’\u003c/p\u003e\n\u003cp\u003e‘Why? Presumably that battle occurred thousands of years ago and the Jaghut are all dead.’\u003c/p\u003e\n\u003cp\u003e‘Yes. Still, that road reminds me of… things. Awakens memories…’\u003c/p\u003e\n\u003cp\u003eQuick Ben slowly nodded. ‘Like shadows, aye.’\u003c/p\u003e\n\u003cp\u003e‘Just so.’\u003c/p\u003e\n\u003cp\u003e‘You had to know it couldn’t last.’\u003c/p\u003e\n\u003cp\u003eThe Imass frowned, the expression accentuating his strangely unhuman, robust features. ‘Yes, perhaps I did, deep within me. I had… forgotten.’\u003c/p\u003e\n\u003cp\u003e‘You’re too damned hard on yourself, Onrack. You don’t need to keep yourself shining so bright all the time.’\u003c/p\u003e\n\u003cp\u003eOnrack’s smile held sadness. ‘I gift my friend,’ he said quietly, ‘for all the gifts he has given me.’\u003c/p\u003e\n\u003cp\u003eQuick Ben studied the warrior’s face. ‘The gift loses its value, Onrack, if it goes on too long. It begins to exhaust us, all of us.’\u003c/p\u003e\n\u003cp\u003e‘Yes, I see that now.’\u003c/p\u003e\n\u003cp\u003e‘Besides,’ the wizard added, watching the two emlava, their bellies full, now mock-fighting on the blood-smeared grass, ‘showing your fallible side is another kind of gift. The kind that invites empathy instead of just awe. If that makes any sense.’\u003c/p\u003e\n\u003cp\u003e‘It does.’\u003c/p\u003e\n\u003cp\u003e‘You’ve been making lots of paints, haven’t you?’\u003c/p\u003e\n\u003cp\u003eA sudden smile. ‘You are clever. When I find a wall of stone that speaks… yes, a different kind of gift. My forbidden talents.’\u003c/p\u003e\n\u003cp\u003e‘Forbidden? Why?’\u003c/p\u003e\n\u003cp\u003e‘It is taboo among my people to render our own forms in likeness to truth. Too much is captured, too much is trapped in time. Hearts can break, and betrayals breed like vermin.’\u003c/p\u003e\n\u003cp\u003eQuick Ben glanced up at Onrack, then away. Hearts can break. Aye, the soul can haunt, can’t it just.\u003c/p\u003e\n\u003cp\u003eTrull Sengar returned, waterskins sloshing. ‘By the Sisters,’ he said to Onrack, ‘is that a frown you’re wearing?’\u003c/p\u003e\n\u003cp\u003e‘It is, friend. Do you wish to know why?’\u003c/p\u003e\n\u003cp\u003e‘Not at all. It’s just, uh, well, a damned relief, to be honest.’\u003c/p\u003e\n\u003cp\u003eOnrack reached down and snagged one of the cubs, lifting it by the scruff of its neck. The beast hissed in outrage, writhing as he held it up. ‘Trull Sengar, you may explain to our friend why Imass are forbidden to paint likenesses of themselves. You may also tell him my story, so that he understands, and need not ask again why I am awakened to pain within me, recalling now, as I do, that mortal flesh is only made real when fed by the breath of love.’\u003c/p\u003e\n\u003cp\u003eQuick Ben studied Onrack with narrowed eyes. I don’t recall asking anything like that. Well, not out hud, anyway.\u003c/p\u003e\n\u003cp\u003eTrull Sengar’s relieved expression fell away and he sighed, but it was a loose sigh, the kind that marked the unbinding of long-held tensions. ‘I shall. Thank you, Onrack. Some secrets prove a heavy burden. And when I am done revealing to Quick Ben one of the details of your life that has served to forge our friendship, I will then tell you both of my own secret. I will tell you of the Eres’al and what she did to me, long before she appeared to us all in the cavern.’\u003c/p\u003e\n\u003cp\u003eA moment of long silence.\u003c/p\u003e\n\u003cp\u003eThen Quick Ben snorted. ‘Fine. And I’ll tell a tale of twelve souls. And a promise I made to a man named Whiskeyjack-a promise that has brought me all this way, with farther still to go. And then, I suppose, we shall all truly know each other.’\u003c/p\u003e\n\u003cp\u003e‘It is,’ Onrack said, collecting the second cub so he could hold both beasts up side by side, ‘a day for gifts.’\u003c/p\u003e\n\u003cp\u003eFrom beyond the hills there came the sound of thunder. That faded, and did not repeat.\u003c/p\u003e\n\u003cp\u003eThe emlava were suddenly quiet. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-287.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
