{"id":104397,"no":288,"title":"Page 288","content":"\u003cp\u003e‘What was that?’ Trull Sengar asked.\u003c/p\u003e\n\u003cp\u003eQuick Ben could feel his heart pound in his chest. ‘That, friends, was a cusser.’\u003c/p\u003e\n\u003cp\u003eFiddler made his way across the dirt floor of the barn to where Bottle slept. He stared down at the young soldier curled up beneath a dark grey blanket. Poor bastard. He nudged with his foot and Bottle groaned. ‘Sun’s set,’ Fiddler said.\u003c/p\u003e\n\u003cp\u003e‘I know, Sergeant. I watched it going down.’\u003c/p\u003e\n\u003cp\u003e‘We’ve rigged a stretcher. Just get up and eat something and then you’ve got a mobile bed for the rest of the night.’\u003c/p\u003e\n\u003cp\u003e‘Unless you need me.’\u003c/p\u003e\n\u003cp\u003e‘Unless we need you, aye.’\u003c/p\u003e\n\u003cp\u003eBottle sat up, rubbed at his face. ‘Thanks, Sergeant. I don’t need the whole night-half will do.’\u003c/p\u003e\n\u003cp\u003e‘You take what I give you, soldier. Cut it short and we could all end up regretting it.’\u003c/p\u003e\n\u003cp\u003e‘All right, fine, make me feel guilty, then. See if I care.’\u003c/p\u003e\n\u003cp\u003eSmiling, Fiddler turned away. The rest of the squad was readying the gear, a few muted words drifting between the soldiers. Gesler and his crew were in the abandoned farmhouse-no point in crowding up all in one place. Poor tactics anyway.\u003c/p\u003e\n\u003cp\u003eThere had been no pursuit. The drum had done its work. But that was four cussers lost, to add to the others they’d already used. Down to two left and that was bad news. If another enemy column found them… we’re dead or worse. Well, marines weren’t supposed to have it easy. Good enough that they were still alive.\u003c/p\u003e\n\u003cp\u003eCuttle approached. ‘Tarr says we’re ready, Fid.’ He glanced over at Bottle. ‘I got the sorry end of the stretcher to start, soldier. You better not have gas.’\u003c/p\u003e\n\u003cp\u003eBottle, a mouthful of nuts and lard bulging his cheeks, simply stared up at the sapper.\u003c/p\u003e\n\u003cp\u003e‘Gods below,’ Cuttle said, ‘you’re eating one of those Khundryl cakes, ain’t ya? Well, Fid, if we need us a torch to light the way-’\u003c/p\u003e\n\u003cp\u003e‘Permission denied, Cuttle.’\u003c/p\u003e\n\u003cp\u003e‘Aye, probably right. It’d light up half the night sky. Hood’s breath, why do I always get the short twig?’\u003c/p\u003e\n\u003cp\u003e‘So long as you face off against Corabb on that kind of thing,’ Fiddler said, ‘short’s your middle name.’\u003c/p\u003e\n\u003cp\u003eCuttle edged closer to Fiddler and said in a low voice, ‘That big bang yesterday’s gonna draw down a damned army-\u003c/p\u003e\n\u003cp\u003eAssuming they’ve fielded one. So far, we’re running into companies, battalion elements-as if an army’s dispersed, which is more or less what we expected them to do. No point in maintaining a single force when your enemy’s scattered right across Hood’s pimply backside. If they were smart they’d draw up reserves and saturate the region, leave us not a single deer trail to slink along.’\u003c/p\u003e\n\u003cp\u003e‘So far,’ Cuttle said, squinting through the gloom at the rest of the squad and massaging his roughly healed shoulder, ‘they ain’t been very smart.’\u003c/p\u003e\n\u003cp\u003e‘Moranth munitions are new to them,’ Fiddler pointed out. ‘So’s our brand of magic. Whoever’s in command here is probably still reeling, still trying to guess our plans.’\u003c/p\u003e\n\u003cp\u003e‘My guess is whoever was in command, Fid, is now Rannalled in tree branches.’\u003c/p\u003e\n\u003cp\u003eFiddler shrugged, then lifted his pack onto his shoulders and collected his crossbow.\u003c/p\u003e\n\u003cp\u003eCorporal Tarr checked his gear one last time, then straightened. He drew his left arm through the shield straps, adjusted his sword belt, then tightened the strap of his helm.\u003c/p\u003e\n\u003cp\u003e‘Most people just carry their shields on their backs,’ Koryk said from where he stood by the barn’s entrance.\u003c/p\u003e\n\u003cp\u003e‘Not me,’ said Tarr. ‘Get ambushed and there’s no time to ready, is there? So I stay readied.’ He then rolled his shoulders to settle his scaled hauberk, a most familiar, satisfying rustle and clack of iron. He felt unsteady on his feet without that solid, anchoring weight. He had quick-release clasps for his pack of equipment, could drop all that behind him one-handed even as he stepped forward and drew his sword. At least one of them in this squad had to be first to the front, after all, to give them time to bring whatever they had to bear.\u003c/p\u003e\n\u003cp\u003eThis was what he had been trained to do, from the very beginning. Braven Tooth had seen it true enough, seen into Tarr’s stolid, stubborn soul, and he’d said as much, hadn’t he? ‘Your name’s Tarr, soldier. It’s under your feet and you’re s tuck fast. When needs be. It’s your job, from now on. You hold back the enemy at that first blink of contact, you make your squad survive mat moment, aye? Now, you ain’t solid enough yet. Strap on these extra weights, soldier, then get sparring…’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-288.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
