{"id":104410,"no":301,"title":"Page 301","content":"\u003cp\u003eTriban Gnol stared, disbelieving even as he began to comprehend the direction of the Invigilator’s pompous, megalomaniacal monologue.\u003c/p\u003e\n\u003cp\u003e‘The sweetest irony is,’ Karos Invictad continued, sceptre once more tapping a beat on his shoulder, ‘that lone criminal and his pathetically simplistic efforts at financial sabotage provided me with the greatest inspiration. It was not difficult, for one of my intelligence, to advance and indeed to elaborate on that theme of seeming destabiliz’ ation. Of course, the only people being destabilized were Rautos Hivanar and his fellow bloated blue-bloods, and was I supposed to be sympathetic? I, Karos Invictad, born to a] family crushed by murderous debt? I, who struggled, using every talent I possessed to finally rid myself of that inherited misery-no,’ he laughed softly, ‘there was no sympathy in my heart. Only bright revelation, brilliant inspiration-do you know who was my greatest idol when I fought my war against Indebtedness? Tehol Beddict. Recall him? Who could not lose, whose wealth shot skyward with such stunning speed, achieving such extraordinary height, before flashing out like a spent star in the night sky. Oh, he liked his games, didn’t he? Yet, a lesson there, and one I heeded well. Such genius, sparking too hot, too soon, left; him a gutted shell. And that, Chancellor, I would not emulate.’\u003c/p\u003e\n\u003cp\u003e‘You,’ Triban Gnol said, ‘are the true source of this empire-wide sabotage.’\u003c/p\u003e\n\u003cp\u003e‘Who better positioned? Oh, I will grant you, my fellow conspirator has displayed increasingly impressive devious-ness of late. And there is no doubt that I could not have achieved quite the level of success as I have without him or her. Triban Gnol, standing before you at this moment is the wealthiest man ever to have lived in Lether. Yes, appalling stacks of coin have indeed vanished. Yes, the strain has sent fatal fissures through every merchant house in the empire. And yes, many great families are about to fall and nothing can save them, even were I so inclined. Which I am not. Thus.’ The sceptre settled motionless onto that shoulder. ‘I am both the power and the wealth, and I am poised to save this empire from financial ruin-should I so choose.’\u003c/p\u003e\n\u003cp\u003eThe Chancellor’s hands, there on the desktop, had gone white, the veins and arteries prominent in their sickly blue and green hues. The hands-his hands-felt cold as death. ‘What do you want, Karos Invictad?’\u003c/p\u003e\n\u003cp\u003e‘Oh, I mostly have it already, Chancellor. Including, I am pleased to see, your fullest understanding of the situation. As it stands now. As it will stand in the future.’\u003c/p\u003e\n\u003cp\u003e‘You seem to forget there is a war on.’\u003c/p\u003e\n\u003cp\u003e‘There always is. Opportunities for yet more profit and power. In the next week or two, Chancellor, I will become more famous, more beloved, more powerful than even you could imagine, or, should I say, fear.’ His smile broadened. ‘I assume it’s fear, but relax, Chancellor, I do not have you next on my list. Your position is secure, and, once these damned Tiste Edur are taken care of, including the Emperor, it shall be you and I in control of this empire. No, you will see plain enough, as will everyone else. The saboteur arrested. The coins recovered. The invaders bought off. The Liberty Consign obliterated and the Patriotists dominant. You see, my agents will control the internal matters, while you will possess the armies-well-paid armies, I assure you-and absolute mastery of the palace.’\u003c/p\u003e\n\u003cp\u003e‘What?’ Triban Gnol asked dryly. ‘You do not seek the throne for yourself?’\u003c/p\u003e\n\u003cp\u003eThe sceptre waved dismissively. ‘Not in the least. Throw a fop on it if you feel the need. Or better still, salute the legend and leave it empty.’\u003c/p\u003e\n\u003cp\u003eTriban Gnol folded his hands together. ‘You are about to arrest your conspirator?’\u003c/p\u003e\n\u003cp\u003e‘I am.’\u003c/p\u003e\n\u003cp\u003e‘And my armies?’\u003c/p\u003e\n\u003cp\u003e‘They will be paid. At once.’\u003c/p\u003e\n\u003cp\u003eThe Chancellor nodded. ‘Invigilator,’ he then said, with a slight frown as he studied his hands, ‘I have heard disturbing reports…’\u003c/p\u003e\n\u003cp\u003e‘Oh?’\u003c/p\u003e\n\u003cp\u003e‘Yes. It seems that, in a manner distressingly similar to Rautos Hivanar, you too have succumbed to a peculiar obsession.’ He glanced up searchingly, innocently. ‘Something about a puzzle?’\u003c/p\u003e\n\u003cp\u003e‘Who has told you that?’\u003c/p\u003e\n\u003cp\u003eThe Chancellor shrugged.\u003c/p\u003e\n\u003cp\u003eAfter a moment the flush in Invictad’s round face faded to blotches on the cheeks, and the man shrugged. ‘An idle pursuit. Amusing. A quaint challenge which I will solve in a few days. Unlike Rautos Hivanar, you see, I have found that this puzzle has in fact sharpened my mind. The world has never been clearer to my eyes. Never as clean, as precise, as perfect. That puzzle, Chancellor, has become my inspiration.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-301.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
