{"id":104416,"no":308,"title":"Page 308","content":"\u003cp\u003e‘All the masks torn off, yes.’\u003c/p\u003e\n\u003cp\u003e‘Where is the virtue in that?’\u003c/p\u003e\n\u003cp\u003eThe Elder God shrugged. ‘The perils of unfettered expansion, Advocate Sleem, are revealed in the dust and ashes left behind. Assume the species’ immortality since it suits the game. Every game. But that assumption will not save you in the end. No, in fact, it will probably kill you. That one self-serving, pious, pretentious, arrogant assumption.’\u003c/p\u003e\n\u003cp\u003e‘The bitter old man speaks.’\u003c/p\u003e\n\u003cp\u003e‘You have no idea.’\u003c/p\u003e\n\u003cp\u003e‘Would that I carried a knife. For I would kill you with it, here and now.’\u003c/p\u003e\n\u003cp\u003e‘Yes. The game always ends at some point, doesn’t it?’\u003c/p\u003e\n\u003cp\u003e‘And you dare call me the cynical one.’\u003c/p\u003e\n\u003cp\u003e‘Your cynicism lies in your willing abuse of others to consolidate your superiority over them. My cynicism is in regard to humanity’s wilful blindness with respect to its own extinction.’\u003c/p\u003e\n\u003cp\u003e‘Without that wilful blindness there is naught but despair.’\u003c/p\u003e\n\u003cp\u003e‘Oh, I am not that cynical. In fact, I do not agree at all. Maybe when the wilful blindness runs its inevitable course, there will be born wilful wisdom, the revelation of seeing things as they are.’\u003c/p\u003e\n\u003cp\u003e‘Things? To which things are you referring, old man?’\u003c/p\u003e\n\u003cp\u003e‘Why, that everything of true value is, in fact, free.’\u003c/p\u003e\n\u003cp\u003eSleem placed the coins in his own bulging purse and walked to the door. ‘A very quaint notion. Alas, I will not wish you a good day.’\u003c/p\u003e\n\u003cp\u003e‘Don’t bother.’\u003c/p\u003e\n\u003cp\u003eSleem turned at the hard edge in Bugg’s voice. His brows lifted in curiosity.\u003c/p\u003e\n\u003cp\u003eBugg smiled. ‘The sentiment wouldn’t be free now, would it?’\u003c/p\u003e\n\u003cp\u003e‘No, it would not.’\u003c/p\u003e\n\u003cp\u003eAs soon as die hapless advocate was gone, Bugg rose. Well, it’s begun. Almost to the day when Tehol said it would. The man’s uncanny. And maybe in that, there lies some hope for humanity. All those things that cannot be measured, cannot be quantified in any way at all.\u003c/p\u003e\n\u003cp\u003eMaybe.\u003c/p\u003e\n\u003cp\u003eBugg would have to disappear now. Lest he get torn limb from limb by a murder of advocates, never mind the financiers. And that would be a most unpleasant experience. But first, he needed to warn Tehol.\u003c/p\u003e\n\u003cp\u003eThe Elder God glanced around his office with something like affectionate regret, almost nostalgia. It had been fun, after all. This game. Like most games. He wondered why Tehol had stopped short the first time. But no, perhaps that wasn’t at all baffling. Come face to face with a brutal truth-with any brutal truth-and it was understandable to back away.\u003c/p\u003e\n\u003cp\u003eAs Sleem said, there is no value in despair.\u003c/p\u003e\n\u003cp\u003eBut plenty of despair in value, once the illusion is revealed. Ah, I am indeed tired.;\u003c/p\u003e\n\u003cp\u003eHe set out from his office, to which he would never return.\u003c/p\u003e\n\u003cp\u003e‘How can there be only four hens left? Yes, Ublala Pung, I am looking directly at you.’\u003c/p\u003e\n\u003cp\u003e‘For the Errant’s sake,’ Janath sighed, ‘leave the poor man alone. What did you expect to happen, Tehol? They’re hens that no longer lay eggs, making them as scrawny and dry and useless as the gaggle of matronly scholars at my old school. What Ublala did was an act of profound bravery.’\u003c/p\u003e\n\u003cp\u003e‘Eat my hens? Raw?’\u003c/p\u003e\n\u003cp\u003e‘At least he plucked their feathers.’\u003c/p\u003e\n\u003cp\u003e‘Were they dead by that point?’\u003c/p\u003e\n\u003cp\u003e‘Let’s not discuss those particular details, Tehol. Everyone is permitted one mistake.’\u003c/p\u003e\n\u003cp\u003e‘My poor pets,’ Tehol moaned, eyeing Ublala Pung’s overstuffed pillow at one end of the reed mat that served as the half-blood Tarthenal’s bed.\u003c/p\u003e\n\u003cp\u003e‘They were not pets.’\u003c/p\u003e\n\u003cp\u003eHe fixed a narrow gaze on his ex-tutor. ‘I seem to recall you going on and on about the terrors of pragmatism, all through history. Yet what do I now hear from you, Janath? “They were not pets.” A declarative statement uttered in most pragmatic tones. Why, as if by words alone you could cleanse what must have been an incident of brutal avian murder.’\u003c/p\u003e\n\u003cp\u003e‘Ublala Pung has more stomachs than both you and me combined. They need filling, Tehol.’\u003c/p\u003e\n\u003cp\u003e‘Oh?’ He placed his hands on his hips-actually to make certain that the pin was holding the blanket in place, recalling with another pang his most public display a week past. ‘Oh?’ he asked again, and then added, And what, precisely and pragmatically, was wrong with my famous Grit Soup?’\u003c/p\u003e\n\u003cp\u003e‘It was gritty.’\u003c/p\u003e\n\u003cp\u003e‘Hinting of most subtle flavours as can only be cultivated from diligent collection of floor scrapings, especially a floor pranced upon by hungry hens.’\u003c/p\u003e\n\u003cp\u003eShe stared up at him. ‘You are not serious, are you? That really was grit from the floor? This floor?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-308.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
