{"id":104432,"no":324,"title":"Page 324","content":"\u003cp\u003eAt some point, no matter how repressive the regime, the citizenry will come to comprehend the vast power in their hands. The destitute, the Indebted, the beleaguered middle classes; in short, the myriad victims. Control was sleight of hand trickery, and against a hundred thousand defiant citizens, it stood no real chance. All at once, the game was up.\u003c/p\u003e\n\u003cp\u003eThe threshold, this time, was precisely as Rautos Hivanar had feared. The pressure of a crumbling, overburdened economy. Shortage of coin, the crushing weight of huge and ever-growing debts, the sudden inability to pay for anything. The Patriotists could draw knives, swords, could wield their knotted clubs, but against desperate hunger and a sense of impending calamity, they might as well have been swinging reeds at the wind.\u003c/p\u003e\n\u003cp\u003eIn the face of all this, the Tiste Edur were helpless. Bemused, uncomprehending, and wholly unprepared. Unless, that is, their answer will be to begin killing. Everyone.\u003c/p\u003e\n\u003cp\u003eAnother of Karos Invictad’s blind spots. The Invigilator’s contempt for the Tiste Edur could well prove suicidal. Their Emperor could not be killed. Their K’risnan could unleash sorcery that could devour every Letherii in the empire. And the fool thought to target them in a campaign of arrests?\u003c/p\u003e\n\u003cp\u003eNo, the Patriotists had been useful; indeed, for a time, quite necessary. But-\u003c/p\u003e\n\u003cp\u003e‘Venitt Sathad, welcome to Drene.’\u003c/p\u003e\n\u003cp\u003eWithout looking up, Venitt gestured with one hand as he reached for the wine bottle. ‘Find yourself a chair, Orbyn Truthfinder.’ A glance upward. ‘I was just thinking about you.’\u003c/p\u003e\n\u003cp\u003eThe huge, odious man smiled. ‘I am honoured. If, that is, your thoughts were of me specifically. If,, however, they were of the Patriotists, well, I suspect that “honour” would be the wrong word indeed.’\u003c/p\u003e\n\u003cp\u003eThe proprietor was struggling to drag another chair out to the table, but it was clear that whatever had caused the limp was proving most painful. Venitt Sathad set the bottle back down, rose, and walked over to help him.\u003c/p\u003e\n\u003cp\u003e‘Humble apologies, kind sir,’ the old man gasped, his face white and beads of sweat spotting his upper lip. ‘Had a fall yestereve, sir-’\u003c/p\u003e\n\u003cp\u003e‘Must have been a bad one. Here, leave the chair to me, and find us another unbroken bottle of wine-if you can.’\u003c/p\u003e\n\u003cp\u003e‘Most obliged, sir…’\u003c/p\u003e\n\u003cp\u003eWondering where the old man had found this solid oak dining chair-one large enough to take Orbyn’s mass-Venitt Sathad pulled it across the cobbles and positioned it opposite his own chair with the table in between, then he sat down once more.\u003c/p\u003e\n\u003cp\u003e‘If not honour,’ he said, retrieving the bottle again and refilling the lone clay cup, ‘then what word comes to mind, Orbyn?’\u003c/p\u003e\n\u003cp\u003eTruthfinder eased down into the chair, gusting out a loud, wheezing sigh. ‘We can return to that anon. I have been expecting your arrival for some time now.’\u003c/p\u003e\n\u003cp\u003e‘Yet I found neither you nor the Factor in the city, Orbyn, upon my much-anticipated arrival.’\u003c/p\u003e\n\u003cp\u003eA dismissive gesture, as the proprietor limped up with a cup and a second bottle of Bluerose wine, then retreated with head bowed. ‘The Factor insisted I escort him on a venture across the sea. He has been wont to waste my time of late. I assure you, Venitt, that such luxuries are now part of the past. For Letur Anict.’\u003c/p\u003e\n\u003cp\u003e‘I imagine he is in a most discomfited state at the moment.’\u003c/p\u003e\n\u003cp\u003e‘Rattled.’\u003c/p\u003e\n\u003cp\u003e‘He lacks confidence that he can restore order?’\u003c/p\u003e\n\u003cp\u003e‘Lack of confidence has never been Letur Anict’s weakness. Reconciling it with reality is, alas.’\u003c/p\u003e\n\u003cp\u003e‘It is unfortunate that the Overseer elected to accompany Atri-Preda Bivatt’s campaign to the east.’\u003c/p\u003e\n\u003cp\u003e‘Possibly fatally so, yes.’\u003c/p\u003e\n\u003cp\u003eVenitt Sathad’s brows lifted. ‘Have some wine, Orbyn. And please elaborate on that comment.’\u003c/p\u003e\n\u003cp\u003e‘There are assassins in that company,’ Truthfinder replied, frowning to indicate his distaste. ‘Not mine, I assure you. Letur plays his own game with the Overseer. Political. In truth, I do not expect Brohl Handar to return to Drene, except perhaps as a wrapped, salted corpse.’\u003c/p\u003e\n\u003cp\u003e‘I see. Of course, this sparring of his has now put him at a great disadvantage.’\u003c/p\u003e\n\u003cp\u003eOrbyn nodded as he poured his cup full. ‘Yes, with Brohl nowhere in sight, the blame for last night’s riot rests exclusively with the Factor. There will be repercussions, no doubt?’\u003c/p\u003e\n\u003cp\u003e‘Truthfinder, that riot is not yet over. It will continue into this night, where it will boil out from the slums with still greater force and ferocity. There will be more assaults on Letur’s estate, and before long on all of his properties and holdings throughout Drene, and those he will not be able to protect. The barracks will be under siege. There will be looting. There will be slaughter.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-324.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
