{"id":104435,"no":327,"title":"Page 327","content":"\u003cp\u003eThey were finding odd cairns, bearing ghastly faces painted in white, and in the cracks and fissures of those tumuli there were peculiar offerings-tufts of wolf fur, teeth, the tusks from some unknown beast and antlers bearing rows of pecules and grooves. None of this was Awl-even the Awl scouts among Bivatt’s army had never before seen the like.\u003c/p\u003e\n\u003cp\u003eSome wandering people from the eastern wastelands, perhaps, yet when Brohl had suggested that, the Atri-Preda had simply shaken her head. She knows something. Another damned secret.\u003c/p\u003e\n\u003cp\u003eThey rode out of the rain, into steaming hot sunlight, the rich smell of soaked lichen and moss.\u003c/p\u003e\n\u003cp\u003eThe broad swath of churned ground was on their right. To draw any closer was to catch the stench of manure and human faeces, a smell he had come to associate with desperation. We fight our wars and leave in our wake the redolent reek of suffering and misery. These plains are vast, are they not? What terrible cost would we face if we just left each other alone? An end to this squabble over land-Father Shadow knows, no-one realty owns it. The game of possession belongs to us, not to the rocks and earth, the grasses and the creatures walking the surface in their fraught struggle to survive.\u003c/p\u003e\n\u003cp\u003eA bolt of lightning descends. A wild bhederin is struck and nearly explodes, as if life itself is too much to bear.\u003c/p\u003e\n\u003cp\u003eThe world is harsh enough. It does not need our deliberate cruelties. Our celebration of viciousness.\u003c/p\u003e\n\u003cp\u003eHis scout was returning at the gallop. Brohl Handar raised a hand to halt his troop.\u003c/p\u003e\n\u003cp\u003eThe young warrior reined in with impressive grace. ‘Overseer, they are on Q’uson Tapi. They did not go round it, sir-we have them!’\u003c/p\u003e\n\u003cp\u003eQ’uson Tapi, a name that was found only on the oldest Letherii maps; the words themselves were so archaic that even their meaning was unknown. The bed of a dead inland sea or vast salt lake. Flat, not a single rise or feature spanning leagues-or so the maps indicated. ‘How far ahead is this Q’uson Tapi?’\u003c/p\u003e\n\u003cp\u003eThe scout studied the sky, eyes narrowing on the sun to the west. ‘We can reach it before dusk,’ he said.\u003c/p\u003e\n\u003cp\u003e‘And the Awl?’\u003c/p\u003e\n\u003cp\u003e‘They were less than a league out from the old shoreline, Overseer. Where they go, there is no forage-the herds are doomed, as are the Awl themselves.’\u003c/p\u003e\n\u003cp\u003e‘Has the rain reached Q’uson Tapi?’\u003c/p\u003e\n\u003cp\u003e‘Not yet, but it will, and those clays will turn into slime-the great wagons will be useless against us.’\u003c/p\u003e\n\u003cp\u003eAs will cavalry on both sides, I would wager.\u003c/p\u003e\n\u003cp\u003e‘Ride back to the column,’ Brohl Handar told the scout, ‘and report to the Atri-Preda. We will await her at the old shoreline.’\u003c/p\u003e\n\u003cp\u003eA Letherii salute-yes, the younger Edur had taken quickly to such things-and the scout nudged his horse into motion.\u003c/p\u003e\n\u003cp\u003eRedmask, what have you done now?\u003c/p\u003e\n\u003cp\u003eAtri-Preda Bivatt had tried, for most of the day, to convince herself that what she had seen had been conjured from an exhausted, overwrought mind, the proclivity of the eye to find shapes in nothing, all in gleeful service to a trembling imagination. With dawn’s light barely a hint in the air she had walked out, alone, to stand before a cairn-these strange constructions they now came across as they pushed ever further east. Demonic faces in white on the flatter sides of the huge boulders. Votive offerings on niches and between the roughly stacked stones.\u003c/p\u003e\n\u003cp\u003eThey had pried apart one such cairn two days earlier, finding at its core… very little. A single flat stone on which rested a splintered fragment of weathered wood-seemingly accidental, but Bivatt knew differently. She could recall, long ago on the north shores, on a day of fierce seas crashing that coast, a row of war canoes, their prows dismantled-and the wood, the wood was as this, here in the centre of a cairn on the Awl’dan.\u003c/p\u003e\n\u003cp\u003eStanding before this new cairn, with dawn attempting to crawl skyward as grey sheets of rain hammered down, she had happened to glance up. And saw-a darker grey, man-shaped yet huge, twenty, thirty paces away. Solitary, motionless, watching her. The blood in her veins lost all heat and all at once the rain was as cold as those thrashing seas on the north coast years past.\u003c/p\u003e\n\u003cp\u003eA gust of wind, momentarily making the wall of water opaque, and when it had passed, the figure was gone.\u003c/p\u003e\n\u003cp\u003eAlas, the chill would not leave her, the sense of gauging, almost unhuman regard.\u003c/p\u003e\n\u003cp\u003eA ghost. A shape cast by her mind, a trick of the rain and wind and dawn’s uncertain birth. But no, he was there. Watching. The maker of the cairns.\u003c/p\u003e\n\u003cp\u003eRedmask. Myself. The Awl and the Letherii and Tiste Edur, here we duel on this plain. Assuming we are alone in this deadly game. Witnessed by naught but carrion birds, coyotes and the antelope gracing on the valley /loors that watch its pass by day after day. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-327.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
