{"id":104443,"no":335,"title":"Page 335","content":"\u003cp\u003e‘In their minds, they are. In my mind, Mother, they are.’\u003c/p\u003e\n\u003cp\u003eShe sneered. ‘Do the new ones now among the Bentract hold to such noble faith, Rud? Have you not seen their disdain? Their contempt for their own deluded kin? It is only a matter of time before one of them speaks true-shattering the illusion for all time-’\u003c/p\u003e\n\u003cp\u003e‘They will not,’ Rud said, once more eyeing the distant party of wanderers who were now, without question, approaching the ruined city. ‘You do not visit often enough,’ he said. ‘Disdain and contempt, yes, but now, too, you will see fear.’\u003c/p\u003e\n\u003cp\u003e‘Of you? Oh, my son, you fool! And do your adopted kin know to guard your back against them? Of course not, for that would reveal too much, would invite awkward questions-and the Imass are not ones to be easily turned away when seeking truth.’\u003c/p\u003e\n\u003cp\u003e‘My back will be guarded,’ Rud said.\u003c/p\u003e\n\u003cp\u003e‘By whom?’\u003c/p\u003e\n\u003cp\u003e‘Not you, Mother?’\u003c/p\u003e\n\u003cp\u003eShe hissed in a most reptilian manner. ‘When? While my sisters are busy trying to kill me? When he has the Finnest in his hand and casts eyes upon all of us?’\u003c/p\u003e\n\u003cp\u003e‘If not you,’ he said easily, ‘then someone else.’\u003c/p\u003e\n\u003cp\u003e‘Wiser to kill the newcomers now, Rud.’\u003c/p\u003e\n\u003cp\u003e‘And my kin would have no questions then?’\u003c/p\u003e\n\u003cp\u003e‘None but you alive to answer, and you of course may tell them anything you care to. Kill those new Imass, those strangers with their sly regard, and be quick about it.’\u003c/p\u003e\n\u003cp\u003e‘I think not.’\u003c/p\u003e\n\u003cp\u003e‘Kill them, or I will.’\u003c/p\u003e\n\u003cp\u003e‘No, Mother. The Imass are mine. Shed blood among my people-any of them-and you will stand alone the day Sukul and Sheltatha arrive, the day of Silchas Ruin who comes to claim the Finnest.’ He glanced across at her. Could white skin grow still paler? ‘Yes, all in a single day. I have been to the Twelve Gates-maintaining my vigil as you have asked.’\u003c/p\u003e\n\u003cp\u003e‘And?’ The query was almost breathless.\u003c/p\u003e\n\u003cp\u003e‘Kurald Galain is most perturbed.’\u003c/p\u003e\n\u003cp\u003e‘They draw close?’\u003c/p\u003e\n\u003cp\u003e‘You know that as well as I do-my father is with them, is he not? You steal his eyes when it suits you-’\u003c/p\u003e\n\u003cp\u003e‘Not as easy as you think.’ Her tone was genuine in its bitterness. ‘He… baffles me.’\u003c/p\u003e\n\u003cp\u003eFrightens you, you mean. ‘Silchas Ruin will demand the Finnest.’-\u003c/p\u003e\n\u003cp\u003e‘Yes, he will! And we both know what he will do with it-and that must not be permitted!’\u003c/p\u003e\n\u003cp\u003eAre you sure of that, Mother? Because, you see, I am not. Not any more. ‘Silchas Ruin may well demand. He may well make dire threats, Mother. You have said so often enough.’\u003c/p\u003e\n\u003cp\u003e‘And if we stand side by side, my son, he cannot hope to get past us.’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘But who will be guarding your back?’\u003c/p\u003e\n\u003cp\u003e‘Enough, Mother. I warned them to silence and I do not think they will attempt anything. Call it faith-not in the measure of their fear. Instead, my faith rests in the measure of… wonder.’\u003c/p\u003e\n\u003cp\u003eShe stared at him, clearly confused.\u003c/p\u003e\n\u003cp\u003eHe felt no inclination to elaborate. She would see, in time. ‘I would go to welcome these new ones,’ he said, eyes returning to the approaching strangers. ‘Will you join me, Menandore?’\u003c/p\u003e\n\u003cp\u003e‘You must be mad.’ Words filled with affection-yes, she could never rail at him for very long. Something of his father’s ethereal ease, perhaps-an ease even Rud himself could remember from that single, short visit. An ease that would slip over the Letherii’s regular, unimpressive features, whenever the wave of pain, dismay-or indeed any harsh emotion-was past and gone, leaving not a ripple in its wake.\u003c/p\u003e\n\u003cp\u003eThat ease, Rud now understood, was the true face of Udinaas. The face of his soul.\u003c/p\u003e\n\u003cp\u003eFather, I do so look forward to seeing you again.\u003c/p\u003e\n\u003cp\u003eHis mother was gone-at least from his side. At a sudden gust of wind Rud Elalle glanced up and saw the white and gold mass of her dragon form, lurching skyward with every heave of the huge wings.\u003c/p\u003e\n\u003cp\u003eThe strangers had all halted, still three hundred paces away, and were staring up, now, as Menandore lunged yet higher, slid across currents of air for a moment, until she faced them, and then swept down, straight for the small party. Oh, how she loved to intimidate lesser beings.\u003c/p\u003e\n\u003cp\u003eWhat happened then without doubt surprised Menandore more than even Rud-who gave an involuntary shout of surprise as two feline shapes launched into the air from the midst of the party. Dog-sized, forelegs lashing upward as Rud’s mother sailed overhead-and she snapped her hind legs up tight against her belly in instinctive alarm, even as a thundering beat of her wings lifted her out of harm’s way. At sight of her neck twisting round, eyes flashing in an outraged glare-indignant indeed-Rud Elalle laughed, and was satisfied to see that the sound reached his mother, enough to draw her glare and hold it, until the dragon’s momentum carried her well past the strangers and their defiant pets, out of the moment when she might have banked hard, jaws hingeing open to unleash deadly magic down on the obstreperous emlava and their masters. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-335.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
