{"id":104444,"no":336,"title":"Page 336","content":"\u003cp\u003eThe threat’s balance tilted away-as Rud had sought with that barking laugh-and on she flew, dismissing all in her wake, including her son.\u003c/p\u003e\n\u003cp\u003eAnd, were it in his nature, he would then have smiled. For he knew his mother was smiling, now. Delighted to have so amused her only son, her child who, like any Imass, saved his laughter for the wounds his body received in the ferocious games of living. And even her doubts, etched in by this conversation just past, would smooth themselves over for a time.\u003c/p\u003e\n\u003cp\u003eA little time. When they returned, Rud also knew, they would sting like fire. But by then, it would be too late. More or less.\u003c/p\u003e\n\u003cp\u003eHe climbed down from the toppled column. It was time to meet the strangers.\u003c/p\u003e\n\u003cp\u003e‘That,’ Hedge announced, ‘is no Imass. Unless they breed ‘em big round here.’\u003c/p\u003e\n\u003cp\u003e‘Not kin,’ Onrack observed with narrowed eyes.\u003c/p\u003e\n\u003cp\u003eHedge’s ghostly heart was still pounding hard in his ghostly chest in the wake of that damned dragon. If it hadn’t been for the emlava cubs and their brainless lack of fear, things might well have got messy. A cusser in Hedge’s left hand. Quick Ben with a dozen snarly warrens he might well have let loose all at once. Trull Sengar and his damned spears-aye, dragon steaks raining down from the sky.\u003c/p\u003e\n\u003cp\u003eUnless she got us first.\u003c/p\u003e\n\u003cp\u003eNo matter, the moment had passed, and he was thankful for that. ‘Maybe he’s no kin, Onrack, but he dresses like an Imass, and those are stone chips at the business end of that bone club he’s carrying.’ Hedge glanced across at Quick Ben-feeling once again the surge of delight upon seeing a familiar face, the face of a friend-and said, ‘I wish Fid was here, because just looking at that man has the hairs standing on the back of my neck.’\u003c/p\u003e\n\u003cp\u003e‘If you’ve already got a bad feeling about this,’ the wizard replied, ‘why do you need Fid?’\u003c/p\u003e\n\u003cp\u003e‘Confirmation, is why. The bastard was talking to a woman, who then veered into a dragon and thought to give us a scare. Anybody keeping scaly company makes me nervous.’\u003c/p\u003e\n\u003cp\u003e‘Onrack,’ said Trull Sengar as the man drew closer, walking with a casual, almost loose stride, ‘I think we approach the place where Cotillion wanted us to be.’\u003c/p\u003e\n\u003cp\u003eAt that, Hedge scowled. ‘Speaking of scaly-dealing with Shadowthr one’s lackey makes all this stink even worse-’\u003c/p\u003e\n\u003cp\u003e‘Leaving once more unspoken the explanation for what you’re doing here, Hedge,’ the Tiste Edur replied with a faint smile at the sapper-that damned smile, so bloody disarming that Hedge almost spilled out every secret in his head, just to see that smile grow into something more welcoming. Trull Sengar was like that, inviting friendship and camaraderie like the sweet scent of a flower-probably a poisonous one-but that might be just me. My usual paranoia. Well earned, mind. Still, there doesn’t seem to be anything poisonous about Trull Sengar.\u003c/p\u003e\n\u003cp\u003eIt’s just that 1 don’t trust nice people. There, it’s said-.at least here in my head. And no, 1 don’t need any Hood-kissed reason either. He stepped too close to one of the emlava cubs and had to dance away to avoid lashing talons. He glared at the hissing creature. ‘Your hide’s mine, you know that? Mine, kitty. Take good care of it in the meantime.’\u003c/p\u003e\n\u003cp\u003eThe eyes burned up at him, and the emlava cub opened wide its jaws to loose yet another whispering hiss.\u003c/p\u003e\n\u003cp\u003eDamn, those fangs are getting long.\u003c/p\u003e\n\u003cp\u003eOnrack had moved out ahead, and now the Imass stopped. Moments later they had all drawn up to stand a few paces behind him.\u003c/p\u003e\n\u003cp\u003eThe tall, wild-haired warrior walked closer. Five paces from Onrack he halted, smiled and said something in some guttural language.\u003c/p\u003e\n\u003cp\u003eOnrack cocked his head. ‘He speaks Imass.’\u003c/p\u003e\n\u003cp\u003e‘Not Malazan?’ Hedge asked with mock incredulity. ‘What’s wrong with the damned fool?’\u003c/p\u003e\n\u003cp\u003eThe man’s-smile broadened, those amber nugget eyes fixing on Hedge, and in Malazan he said, ‘All the children of the Imass tongue are as poetry to this damned fool. As are the languages of the Tiste,’ he added, gaze shifting to Trull Sengar. Then he spread his hands out to the sides, palms exposed. ‘I am Rud Elalle, raised among the Bentract Imass as a child of their own.’\u003c/p\u003e\n\u003cp\u003eOnrack said, ‘They have yet to show themselves, Rud Elalle. This is not the welcome I expected from kin.’\u003c/p\u003e\n\u003cp\u003e‘You have been watched, yes, for some time. Many clans. Ulshun Pral sent out word that none were to block your path.’ Rud Elalle looked down at the tethered cubs to either side of Trull Sengar. ‘The ay flee your scent, and now 1 see why.’ He then lowered his hands and stepped back. ‘I have given you my name.’\u003c/p\u003e\n\u003cp\u003e‘I am Onrack, of Logros T’lan Imass. The one who restrains the emlava is Trull Sengar, Tiste Edur of the Hiroth tribe. The dark-skinned man is Ben Adaephon Delat, born in a land called Seven Cities; and his companion is Hedge, once a soldier of the Malazan Empire.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-336.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
