{"id":104451,"no":343,"title":"Page 343","content":"\u003cp\u003e‘No’One is going to kill you,’ Sandalath said. Her hands, pressed to the sides of his face, were slick with sweat. Or rain, perhaps. Not tears-leave that to the sky, to the night.\u003c/p\u003e\n\u003cp\u003e‘I am sorry,’ Nimander said.\u003c/p\u003e\n\u003cp\u003e‘I think that apology should be saved for Phaed, don’t you?’\u003c/p\u003e\n\u003cp\u003e‘I am sorry,’ he repeated to her, then added, ‘that she’s not dead.’\u003c/p\u003e\n\u003cp\u003eHer hands pulled away, leaving his cheeks suddenly cold.\u003c/p\u003e\n\u003cp\u003e‘Hold a moment,’ Withal said, stepping to the foot of the bed and bending down to pick up something. Gleaming, edged. Her knife. ‘Now,’ he said in a murmur, ‘which one does this toy belong to, I wonder?’\u003c/p\u003e\n\u003cp\u003e‘Nimander’s still wearing his,’ Sandalath said, and then she turned to stare down at Phaed.\u003c/p\u003e\n\u003cp\u003eA moment later, Withal grunted. ‘She’s been a hateful little snake around you, Sand. But this?’ He faced Nimander. ‘You just saved my wife’s life? I think you did.’ And then he moved closer, but there was nothing of the horror of Sandalath’s face in his own. No, this was a hard expression, that slowly softened. ‘Gods below, Nimander, you knew this was coming, didn’t you? How long? When did you last sleep?’ He stared a moment longer, then spun. ‘Move aside, Sand, I think I need to finish what Nimander started-’\u003c/p\u003e\n\u003cp\u003e‘No!’ his wife snapped.\u003c/p\u003e\n\u003cp\u003e‘She’ll try again.’\u003c/p\u003e\n\u003cp\u003e‘I understand that, you stupid oaf! Do you think I’ve not seen into that fanged maw that is Phaed’s soul? Listen, there is a solution-’\u003c/p\u003e\n\u003cp\u003e‘Aye, wringing her scrawny neck-’\u003c/p\u003e\n\u003cp\u003e‘We leave them here. On the island-we sail tomorrow without them. Withal-husband-’\u003c/p\u003e\n\u003cp\u003e‘And when she recovers-creatures like this one always do-she’ll take this damned knife and do to Nimander what she’s tried to do to you. He saved your life, and I will not abandon him-’\u003c/p\u003e\n\u003cp\u003e‘She won’t kill him,’ Sandalath said. ‘You don’t understand. She cannot-without him, she would be truly alone, and that she cannot abide-it would drive her mad-’\u003c/p\u003e\n\u003cp\u003e‘Mad, aye, mad enough to take a knife to Nimander, the one who betrayed her!’\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003e‘Wife, are you so certain? Is your faith in understanding the mind of a sociopath so strong? That you would leave Nimander with her?’\u003c/p\u003e\n\u003cp\u003e‘Husband, her arms are broken.’\u003c/p\u003e\n\u003cp\u003e‘And broken bones can be healed. A knife in the eye cannot.’\u003c/p\u003e\n\u003cp\u003e‘She will not touch him.’\u003c/p\u003e\n\u003cp\u003e‘Sand-’\u003c/p\u003e\n\u003cp\u003eNimander spoke. ‘She will not touch me.’\u003c/p\u003e\n\u003cp\u003eWithal’s eyes searched his. ‘You as well?’\u003c/p\u003e\n\u003cp\u003eYou must leave us here,’ Nimander said, then winced at the sound of his own voice. So weak, so useless. He was no Anomander Rake. No Silchas Ruin. Andarist’s faith in choosing him to lead the others had been a mistake. ‘We cannot go with you. With Silanda. We cannot bear to see that ship any longer. Take it away, please, take them away!’\u003c/p\u003e\n\u003cp\u003eOh, too many screams this night, in this room. More demands from outside, in growing alarm.\u003c/p\u003e\n\u003cp\u003eSandalath turned and, drawing a robe about her-she had been, Nimander suddenly realized, naked-a woman of matronly gifts, the body of a woman who had birthed children, a body such as young men dream of. And might there be wives who might be mothers who might be lovers’…for one such as me? Stop, she is’dead-robe drawn, Sandalath walked to the door, quickly unlocked it and slipped outside, closing the door behind her. More voices in the corridor.\u003c/p\u003e\n\u003cp\u003eWithal was staring down at Phaed, who had ceased her coughing, her whimpers of pain, her fitful weeping. ‘This is not your crime, Nimander.’\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eWithal reached down and grabbed Phaed by her upper arms. She shrieked.\u003c/p\u003e\n\u003cp\u003e‘Don’t,’ Nimander said.\u003c/p\u003e\n\u003cp\u003e‘Not your crime.’\u003c/p\u003e\n\u003cp\u003e‘She will leave you, Withal. If you do that. She will leave you.’\u003c/p\u003e\n\u003cp\u003eHe stared across at Nimander, then pushed Phaed back down onto the floor. ‘You don’t know me, Nimander. Maybe she doesn’t, either-not when it comes to what I will do for her sake-and, I suppose,’ he added with a snarl, ‘for yours.’\u003c/p\u003e\n\u003cp\u003eNimander had thought his words had drawn Withal back, had kept him from doing what he had intended to do, and so he was unprepared, and so he stood, watching, as Withal snatched Phaed up, surged across the room-carrying her as if she was no more than a sack of tubers-and threw her through the window.\u003c/p\u003e\n\u003cp\u003eA punching shatter of the thick, bubbled glass, and body, flopping arms and bared lower limbs-with dainty feet at the end-were gone, out into the night that howled, spraying the room with icy rain. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-343.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
