{"id":104454,"no":346,"title":"Page 346","content":"\u003cp\u003eBehind him, Kindly spoke, ‘I have decided to accompany you, Lieutenant. To oversee your penmanship.’\u003c/p\u003e\n\u003cp\u003ePores cringed, hitched a sudden limp then rubbed at his hip before opening the cabin hatch. ‘Yes sir,’ he said weakly.\u003c/p\u003e\n\u003cp\u003eAnd when you are done, Lieutenant, my new turtleshell combs will need a thorough cleansing. Shake are not the most fastidious of peoples.’\u003c/p\u003e\n\u003cp\u003e‘Nor are turtles.’\u003c/p\u003e\n\u003cp\u003e‘Excuse me?’\u003c/p\u003e\n\u003cp\u003e‘I will be most diligent, sir.’\u003c/p\u003e\n\u003cp\u003e‘And careful.’\u003c/p\u003e\n\u003cp\u003e‘Absolutely, sir.’\u003c/p\u003e\n\u003cp\u003e‘In fact, I think I had better oversee that activity as well.’\u003c/p\u003e\n\u003cp\u003e‘Yes sir.’\u003c/p\u003e\n\u003cp\u003e‘That wasn’t a limp I saw, was it?’\u003c/p\u003e\n\u003cp\u003e‘No sir, I’m much better now.’\u003c/p\u003e\n\u003cp\u003e‘Otherwise we would have to find a good reason for your limping, Lieutenant. For example, my finding a billy club and shattering your legs into pieces. Would that do, do you think? No need to answer, I see. Now, best find the ink box, yes?’\u003c/p\u003e\n\u003cp\u003e‘I’m telling you, Masan, that was Kindly himself over there. Drooling over you.’\u003c/p\u003e\n\u003cp\u003e‘You damned fool,’ she said, then added, ‘Sergeant.’\u003c/p\u003e\n\u003cp\u003eCord just grinned. ‘Even at that distance, your charms are, uh, unmistakable.’\u003c/p\u003e\n\u003cp\u003e‘Sergeant, Kindly has probably not lain with a woman since the night of his coming of age, and that time was probably with a whore his father or uncle bought for the occasion. Women can tell these things. The man’s repressed, in all the worst ways.’\u003c/p\u003e\n\u003cp\u003e‘Oh, and what are the good ways of being repressed?’\u003c/p\u003e\n\u003cp\u003e‘For a man? Well, decorum for one, as in not taking advantage of your rank. Listen closely now, if you dare. All real acts of chivalry are forms of repressed behaviour.’\u003c/p\u003e\n\u003cp\u003e‘Where in Hood’s name did you get that? Hardly back on the savannas of Dal Hon!’\u003c/p\u003e\n\u003cp\u003e‘You’d be surprised what the women in the huts talk about, Sergeant.’\u003c/p\u003e\n\u003cp\u003e‘Well, soldier, I happen to be steering this damned ship, so it was you who walked up here to stand with me, not the other way round!’\u003c/p\u003e\n\u003cp\u003e¦\u003c/p\u003e\n\u003cp\u003e‘I was just getting away from Balm’s squad-not to mention that sapper of yours, Crump, who’s decided I’m worthy of worship. Says I’ve got the tail of some salamander god.’\u003c/p\u003e\n\u003cp\u003e‘You’ve what?’\u003c/p\u003e\n\u003cp\u003e‘Aye. And if he grabs it it’s liable to come off. I think he means he thinks I’m too perfect for the likes of him. Which is something of a relief. Doesn’t stop him ogling me, though.’\u003c/p\u003e\n\u003cp\u003e‘You get the ogles because you want the ogles, Masan Gilani. Keep your armour on and we’ll all forget about you quick enough.’\u003c/p\u003e\n\u003cp\u003e‘Armour on a ship? No thanks. That’s a guarantee of a fast plunge to the mucky bottom, Sergeant.’\u003c/p\u003e\n\u003cp\u003e‘We won’t be seeing any battle on the waves,’ Cord pronounced.\u003c/p\u003e\n\u003cp\u003e‘Why not? The Letherii got a fleet or three, don’t they?’\u003c/p\u003e\n\u003cp\u003e‘Mostly chewed up by years at sea, Masan Gilani. Besides, they’re not very good at the ship-to-ship kind of fighting-without their magic, that is.’\u003c/p\u003e\n\u003cp\u003e‘Well, without our marines, neither are we.’\u003c/p\u003e\n\u003cp\u003e‘They don’t know that, do they?’\u003c/p\u003e\n\u003cp\u003e‘We haven’t got Quick Ben any more either.’\u003c/p\u003e\n\u003cp\u003eCord leaned on the steering oar and looked across at her. You spent most of your time in the town, didn’t you? Just a few trips back and forth to us up the north side of the island. Masan Gilani, Quick Ben had all the moves, aye, and even the look of an Imperial High Mage. Shifty, mysterious and scary as Hood’s arse-crack. But I’ll tell you this-Sinn, well, she’s the real thing.’\u003c/p\u003e\n\u003cp\u003e‘If you say so.’ All Masan Gilani could think of, when it came to Sinn, was the little mute child curling up in the arms of every woman in sight, suckling on tits like a newborn. Of course, that was outside Y’Ghatan. Long ago, now.\u003c/p\u003e\n\u003cp\u003e‘I do say so,’ Cord insisted. ‘Now, if you ain’t interested in getting unofficial with this sergeant here, best take your swaying hips elsewhere,’\u003c/p\u003e\n\u003cp\u003e‘You men really are all the same.’\u003c/p\u003e\n\u003cp\u003e‘And so are you women. Might interest you,’ he added as she turned to leave, ‘Crump’s no whiskered shrew under those breeches.’\u003c/p\u003e\n\u003cp\u003e‘That’s disgusting.’ But she paused at the steps leading down to the main deck and glanced back at the sergeant. ‘Really?’\u003c/p\u003e\n\u003cp\u003e‘Think I’d lie about something like that?’\u003c/p\u003e\n\u003cp\u003eHe watched Masan Gilani sashay her way up the main deck to where Balm and the rest were gambling, Crump with all the winnings, thus far. They’d reel him in later, of course. Although idiots had a way of being damnably lucky. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-346.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
