{"id":104458,"no":350,"title":"Page 350","content":"\u003cp\u003eAs things stood at the moment, the entire crime now rested at Tehol’s feet-and Bugg’s, the still elusive manservant.\u003c/p\u003e\n\u003cp\u003e‘But we will find him, janath,’ Tanal Yathvanar had said. ‘We find everyone, eventually.’\u003c/p\u003e\n\u003cp\u003eEveryone but yourselves, she had thought to reply, for that search leads you onto a far too frightening path. Instead, she had said nothing, given him nothing at all. And watched as the sword got ever smaller in his hand-yes, that sword, too.\u003c/p\u003e\n\u003cp\u003e‘Just as we found you. Just as I found you. Oh, it’s well known now. I was the one to arrest Tehol Beddict and Scholar Janath. Me. Not Karos Invictad, who sits day and night drooling over his box and that blessed two-headed insect. It has driven him mad, you know. He does nothing else.’ He then laughed. ‘Did you know he is now the richest man in the empire? At least, he thinks he is. But I did the work for him. I made the transactions. I have copies of everything. But the real glory is this-1 am his beneficiary, and he doesn’t even know it!’\u003c/p\u003e\n\u003cp\u003eYes, the two-headed insect. One drooling, the other nattering.\u003c/p\u003e\n\u003cp\u003eTanal Yathvanar. She knew him-that was now a certainty. She knew him, because he had done all this to her before. There had been no dissembling when he had talked about that-it was the source for his gloating over her, after all, so it could not be a lie.\u003c/p\u003e\n\u003cp\u003eAnd now her memories-of the time between the end of the semester at the academy, and her awakening in the care of Tehol and Bugg-memories that had been so fragmented, images blurred beyond all understanding, began to coalesce, began to draw into focus.\u003c/p\u003e\n\u003cp\u003eShe was wanted, because she had escaped. Which meant that she had been arrested-her first arrest-and her tormentor had been none other than Tanal Yathvanar.\u003c/p\u003e\n\u003cp\u003eLogical. Reasonable intuitions from the available facts and her list of observations. Cogent argument and standing before her-some time ago now-the one man who offered the most poignant proof as he babbled on, driven by her lack of reaction. ‘Dear]anath, we must resume where we left off. 1 don’t know how you got away. 1 don’t even know how you ended up with Tehol Beddict. But once more you are mine, to do with as I please. And what I will do with you will not, alas, please you, but your pleasure is not what interests me. This time, you will beg me, you will promise anything, you will come to worship me. And that is what I will leave you with, today. To give you things to think about, until my return.’\u003c/p\u003e\n\u003cp\u003eHer silence, it had turned out, had been a weak defence.\u003c/p\u003e\n\u003cp\u003eShe was beginning to remember-past those ordered details arranged with clinical detachment-and with those memories there was… pain.\u003c/p\u003e\n\u003cp\u003ePain beyond comprehension.\u003c/p\u003e\n\u003cp\u003eI was driven mad. That is why I could not remember anything. Entirely mad-I don’t know how Bugg and Tehol healed me, but they must have. And Tehol’s consideration, his very uncharacteristic gentleness with me-not once did he seek to take advantage of me, although he must have known that he could have, that I would have welcomed it. That should have awakened suspicion in me, it should have, but I was too happy, too strangely content, even as 1 waited and waited for Tehol to find himself in my arms.\u003c/p\u003e\n\u003cp\u003eAh, now isn’t that an odd way of putting it?\u003c/p\u003e\n\u003cp\u003eShe wondered where he was. In another cell? There were plenty of moaners and criers for neighbours, most beyond all hope of communication. Was one of them Tehol Beddict? Broken into a bleeding, gibbering thing?\u003c/p\u003e\n\u003cp\u003eShe did not believe it. Would not. No, for the Great Traitor of the Empire, there would have to be spectacle. A Drowning of such extravagance as to burn like a brand into the collective memory of the Letherii people. He would need to be broken publicly. Made the singular focus for this overwhelming tide of rage and fear. Karos Invictad’s crucial act to regain control, to quell the anarchy, the panic, to restore order.\u003c/p\u003e\n\u003cp\u003eWhat irony, that even as Emperor Rhulad prepared to slaughter champions-among them some reputed to be the most dangerous Rhulad would ever face-Karos Invictad could so easily usurp the attention of everyone-well, among the Letherii, that is-with this one arrest, this one trial, this one act of bloodletting.\u003c/p\u003e\n\u003cp\u003eDoesn’t he realize? That to kill Tehol Beddict this way will be to make of him a martyr? One such as has never been seen before? Tehol Beddict sought to destroy the Letherii system of Indebtedness. Sought to destroy the unholy union of coin and power. He will be the new Errant, but a new kind of Errant. One bound to justice, to freedom, to the commonality of humans. Regardless of whether he was right, regardless even if these were his aims-none of that will matter. He will be written of, a thousand accounts, and in time but a handful will survive, drawn together to forge the heart of a new cult.\u003c/p\u003e\n\u003cp\u003eAnd you, Karos Invictad, oh, how your name will ride the breath of curses, for ever more. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-350.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
