{"id":104473,"no":365,"title":"Page 365","content":"\u003cp\u003e‘All right,’ Badan cut in, not wanting to hear again what had happened to Sinter and Kisswhere, since it had been Kisswhere who had been the reason for Sinter’s joining. Nothing good following a woman who was following another woman with worship in her eyes-even a sister-but that had been that and they were both gone now, weren’t they? ‘Primly?’\u003c/p\u003e\n\u003cp\u003eThe Quon rubbed at what passed for a beard on his face-gods, showed just how young the poor bastard was-and cast a searching gaze back on the waiting soldiers. Then he smiled suddenly. ‘Look at Skulldeath, Badan. Here we got a soldier that Toothy himself named first day on Malaz Island, and I still don’t know-was it a joke? Skulldeath’s yet to draw a drop of blood, barring mosquitoes and that blood was his own. Besides, Badan Gruk, you’ve got what looks like some kind of Dal Honese grand council here and you moonless nightshades seem to put holy terror in the Edur, like you were ghosts or something and sometimes I start wondering myself, the way you all manage to vanish in the dark. In any case, there’s you, Nep Furrow, Reliko and Neller and Strap Mull and Mulvan Dreader’s halfway there besides, and, well, we’ve come to fight, haven’t we? So let’s fight.’\u003c/p\u003e\n\u003cp\u003eMaybe you came to fight, Primly. I’m just trying to stay alive. Badan Gruk studied the two men beside him for a moment longer, then he rose to his full height, coming to very nearly Primly’s shoulder, and drew out the two-handed sickle sword from its deer-hide harness on his broad back. Adjusting his grip on the ivory handle, he eyed the two thin otataral blades inset on both sides of the curved and carved tusk. Vethbela, the weapon was called in his own language, Bonekisser, the blades not deep enough to do more than touch the long bones of a normal warrior’s legs, since those femurs were prized trophies, to be polished and carved with scenes of the owner’s glorious death-and any warrior seeking the heart of a woman needed to place more than a few at the threshold of her family’s hut, as proof of his prowess and courage.\u003c/p\u003e\n\u003cp\u003eNever did manage to use this thing properly, did I? Not a single thigh bone to show Sinter. He nodded. ‘Time to collect some trophies, then.’\u003c/p\u003e\n\u003cp\u003eFifteen paces away, Honey nudged Skim. ‘Hey, beloved, looks like we get to toss sharpers today.’\u003c/p\u003e\n\u003cp\u003e‘Stop calling me that,’ the other sapper replied in a bored tone, but she watched as Badan Gruk headed back up to where Ruffle hid, and she watched as Corporal Hunt went back down-trail to collect the 4th Squad’s corporal, Pravalak Rim, who had been guarding their butts with Shoaly and Drawfirst. And pretty soon something less than whispered was dancing through every soldier and she saw weapons being drawn, armour straps tightened, helms adjusted, and finally she grunted. ‘All right, Honey-Hood take me, how I hate saying that-looks like you’ve sniffed it just right-’\u003c/p\u003e\n\u003cp\u003e‘Just let me prove it-’\u003c/p\u003e\n\u003cp\u003e‘You’re never prying my legs apart, Honey. Why don’t you get that?’\u003c/p\u003e\n\u003cp\u003e‘What a miserable attitude,’ the lOth’s sapper complained as he loaded his crossbow. ‘Now Kisswhere, she was-’\u003c/p\u003e\n\u003cp\u003e‘So tired of your advances, Honey, that she went and blew herself up-and took her sister with her, too. And now here I am wishing I’d been with them in that scull.’ With that she rose and scrabbled over to Nep Furrow.\u003c/p\u003e\n\u003cp\u003eThe old Dal Honese mage lifted one yellowy eye to squint at her, then both eyes opened wide when he saw the sharper she held in each hand. ‘Eggit’way fra meen, tit-woman!’\u003c/p\u003e\n\u003cp\u003e‘Relax,’ she said, ‘we’re heading into a fight. You got anything left in that bent reed of yours?’\u003c/p\u003e\n\u003cp\u003e‘Wha’?’\u003c/p\u003e\n\u003cp\u003e‘Magicks, Nep, magicks-comes from the bleckers in men. Every woman knows that,’ and she winked.\u003c/p\u003e\n\u003cp\u003e‘You teasin’ tit-woman you! Eggit’way fra meen!’\u003c/p\u003e\n\u003cp\u003e‘I’m not eggitin’ away from you, Nep, until you bless these two sharpers here.’\u003c/p\u003e\n\u003cp\u003e‘Bliss ‘em clay balls? Ya mad, tit-woman? Less time I done lhat-’\u003c/p\u003e\n\u003cp\u003e‘They blew up, aye. Sinter and Kisswhere. Into pieces but nice and quick, right? Listen, it’s my only way to escape Honey’s advances. No, seriously, I want one of your blissin’ curses or cursed blissin’s. Please, Nep-’\u003c/p\u003e\n\u003cp\u003e‘Eggit’way fra meen!’\u003c/p\u003e\n\u003cp\u003eReliko, who was half a hand shorter even than his sergeant;ind therefore, by Toothy’s own assertion, the smallest heavy infantry soldier in the history of the Malazan Empire, grunted upright and drew out his shortsword as he swung his shield into position. He glanced over at Vastly Blank. ‘Time again.’\u003c/p\u003e\n\u003cp\u003eThe oversized Seti warrior, still sitting on the bed of wet moss, looked up. ‘Huh?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-365.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
