{"id":104485,"no":377,"title":"Page 377","content":"\u003cp\u003eHis last comment seemed to startle Clip for some reason.\u003c/p\u003e\n\u003cp\u003eAnd all at once Seren Pedac saw that chain with its rings differently, By the Errant! Why did I not see it before? It is a garrotte. Clip is a damned assassin! She snorted. ‘And you claim to be a Mortal Sword! You’re nothing but a murderer, Clip. Yes, Udinaas saw that long ago-which is why you hate him so. He was never fooled by all those weapons you carry. And now, neither am I.’\u003c/p\u003e\n\u003cp\u003e‘We’re wasting time indeed,’ Clip said, once more seemingly unperturbed, and he turned and approached the huge gate. Silchas Ruin set out after him, and Seren saw that the White Crow had his hands on the grips of his swords.\u003c/p\u003e\n\u003cp\u003e‘Danger ahead,’ Fear Sengar announced and yes, damn him, he then moved from his position just behind Seren’s right shoulder to directly in front of her. And drew his sword.\u003c/p\u003e\n\u003cp\u003eUdinaas witnessed all this and grunted dismissively, then half turned and said, ‘Silchas Ruin’s earned his paranoia, Fear. But even that doesn’t mean we’re about to jump into a pit of dragons.’ He then smiled without any humour. ‘Not that dragons live in pits.’\u003c/p\u003e\n\u003cp\u003eWhen he walked after the two Tiste Andii, Kettle ran up to take his hand. At first Udinaas reacted as if her touch had burned him, but then his resistance vanished.\u003c/p\u003e\n\u003cp\u003eClip reached the threshold, stepped forward and disappeared. A moment later Silchas Ruin did the same.\u003c/p\u003e\n\u003cp\u003eNeither Udinaas nor Kettle hesitated.\u003c/p\u003e\n\u003cp\u003eReaching the same point, Fear Sengar paused and eyed her. ‘What is in your mind, Acquitor?’ he asked.\u003c/p\u003e\n\u003cp\u003e‘Do you think I might abandon you all, Fear? Watch you step through and, assuming you can’t get back, I just turn round and walk this pointless road-one I probably would never leave? Is that choice left to me?’\u003c/p\u003e\n\u003cp\u003e‘All choices are left to you, Acquitor.’\u003c/p\u003e\n\u003cp\u003e‘You too, I would say. Except, of course, for the ones you willingly surrendered.’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘You admit that so easily.’\u003c/p\u003e\n\u003cp\u003e‘Perhaps it seems that way.’\u003c/p\u003e\n\u003cp\u003e‘Fear, if anyone should turn round right now, it is you.’\u003c/p\u003e\n\u003cp\u003e‘We are close, Acquitor. We are perhaps a few strides from Scabandari’s Finnest. How can you imagine I would even consider such a thing?’\u003c/p\u003e\n\u003cp\u003e‘Some stubborn thread of self-preservation, perhaps. Some last surviving faith of mine that you actually possess a brain, one that can reason, that is. Fear Sengar, you will probably die. If you pass through this gate.’\u003c/p\u003e\n\u003cp\u003eHe shrugged. ‘Perhaps I shall, if only to confound Udinaas’s expectations.’\u003c/p\u003e\n\u003cp\u003e‘Udinaas?’\u003c/p\u003e\n\u003cp\u003eA faint smile. ‘The hero fails the quest.’\u003c/p\u003e\n\u003cp\u003e‘Ah. And that would prove satisfying enough?’\u003c/p\u003e\n\u003cp\u003e‘Remains to be seen, I suppose. Now, you will follow?’\u003c/p\u003e\n\u003cp\u003e‘Of course.’\u003c/p\u003e\n\u003cp\u003e‘You then willingly surrender this choice?’\u003c/p\u003e\n\u003cp\u003eIn answer she set a hand against his chest and pushed him, step by step, into the gate. All pressure vanished when he went through, and Seren stumbled forward, only to collide with the Tiste Edur’s broad, muscled chest.\u003c/p\u003e\n\u003cp\u003eHe righted her before she could fall.\u003c/p\u003e\n\u003cp\u003eAnd she saw, before them all, a most unexpected vista. Black volcanic ash, beneath a vast sky nearly as black, despite at least three suns blazing in the sky overhead. And, on this rough plain, stretching on all sides in horrific proliferation, there were dragons.\u003c/p\u003e\n\u003cp\u003eHumped, motionless. Scores-hundreds.\u003c/p\u003e\n\u003cp\u003eShe heard Kettle’s anguished whisper. ‘Udinaas! They’re all dead!’\u003c/p\u003e\n\u003cp\u003eClip, standing twenty paces ahead, was now facing them. The chain spun tight, and then he bowed. ‘Welcome, my dear companions, to Starvald Demelain.’\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Two\u003c/p\u003e\n\u003cp\u003eThe shadows lie on the field like the dead\u003c/p\u003e\n\u003cp\u003eFrom night’s battle as the sun lifts high its standard\u003c/p\u003e\n\u003cp\u003eInto the dew-softened air\u003c/p\u003e\n\u003cp\u003eThe children rise like flowers on stalks\u003c/p\u003e\n\u003cp\u003eTo sing unworded songs we long ago surrendered\u003c/p\u003e\n\u003cp\u003eAnd the bees dance with great care\u003c/p\u003e\n\u003cp\u003eYou might touch this scene with blessing\u003c/p\u003e\n\u003cp\u003eEven as you settle the weight of weapon in hand\u003c/p\u003e\n\u003cp\u003eAnd gaze across this expanse\u003c/p\u003e\n\u003cp\u003eAnd vow to the sun another day of blood\u003c/p\u003e\n\u003cp\u003eUntitled Toc Anaster\u003c/p\u003e\n\u003cp\u003eGaskaral Traum was the first soldier in Atri-Preda Bivatt’s army to take a life that morning. A large man with faint threads of Tarthenal blood in his veins, he had pitched his tent the night before forty paces from the Tiste Edur encampment. Within it he had lit a small oil lamp and arranged his bedroll over bundles of clothing, spare boots and spare helm. Then he had lain down beside it, on the side nearest the Edur tents, and let the lamp devour the last slick of oil until the darkness within the tent matched that of outside. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-377.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
