{"id":104495,"no":387,"title":"Page 387","content":"\u003cp\u003eThe K’Chain Che’Malle had wallowed down into that mud, quite possibly even as the rains continued to thrash down in darkness. Huge as they were, they had proved skilled at burying themselves so that no sign was visible of their presence-no sign at least to a casual viewer. And after all, who could have imagined such enormous beasts were capable of simply disappearing from sight?\u003c/p\u003e\n\u003cp\u003eAnd Redmask had guessed more or less correctly where the mages would position themselves; indeed, he had invited such placements, where waves of magic would converge to maximum effect against his waiting warriors. Neither Sag’Churok nor Gunth Mach rose to find themselves too far away for that sudden, devastating rush upslope.\u003c/p\u003e\n\u003cp\u003eScreams of terror as the flat clay seemed to erupt at the old shoreline, and then, mud cascading from their backs, the demonic creatures were racing upslope, each closing in on one of the mages.\u003c/p\u003e\n\u003cp\u003ePanicked retreat-flight from the guards, flinging shields and swords away-exposing the hapless mages, both of whom sought to unleash their sorcery-\u003c/p\u003e\n\u003cp\u003e– no time, as Sag’Churok’s twin blades slashed out and the first mage seemed to vanish in a bloom of blood and meat-\u003c/p\u003e\n\u003cp\u003e– no time, as Gunth Mach leapt high in the air then landed with splayed talons directly atop the second, cowering mage, crushing him in a snap of bones-\u003c/p\u003e\n\u003cp\u003eAnd then the beasts wheeled, racing back in zigzag patterns as flights of arrows descended. Those that struck bounced or, rarely, penetrated the thick scaled hide enough to hold fixed in place, until the creature’s motion worked them loose.\u003c/p\u003e\n\u003cp\u003eIn the wake of this sudden honor, the Letherii horns sounded like cries of rage, and all at once the wedges were moving down the slope, and some battle song lifted skyward to set cadence-but it was a shrill sound, erupting from the throats of shaken soldiers-\u003c/p\u003e\n\u003cp\u003eAs easily as that, Toc Anaster reflected, this battle begins.\u003c/p\u003e\n\u003cp\u003eBehind him, Torrent was dancing in gleeful frenzy.\u003c/p\u003e\n\u003cp\u003eShouting: ‘Redmask! Redmask! Redmask!’\u003c/p\u003e\n\u003cp\u003eThe wedges edged out onto the seabed and visibly sagged as momentum slowed. Between them milled the archers, skirmishers and some medium infantry, and Toc saw soldiers slipping, falling, boots skidding out as they sought purchase to draw bowstrings-chaos. The heavy infantry in front were now sinking to their knees, while those at the back stumbled into those before them, as the rhythm broke, then utterly collapsed.\u003c/p\u003e\n\u003cp\u003eA second set of horns sounded as soon as each entire wedge was on the flat, and all forward motion ceased. A moment of relative silence as the wedges reformed, then a new song emerged from the soldiers, this one deeper, more assured, and carrying a slower cadence, a drawn-out beat that proved the perfect match to an advance of one step at a time, with a settling pause between it and the next.\u003c/p\u003e\n\u003cp\u003eToc grunted in admiration. That was impressive control indeed, and it looked to be working.\u003c/p\u003e\n\u003cp\u003eThey will reach the Awl lines intact. Still, no solid footing to fix shields or swing weapons with strength. Gods, this is going to be bloody.\u003c/p\u003e\n\u003cp\u003eFor all of Redmask’s creativity, he was not, in Toe’s judgement, a tactical genius. Here, he had done all he could to gain advantage, displaying due competence. Without the K’Chain Che’Malle, this battle might already be over. In any case, Redmask’s second surprise could not-for anyone-have been much of a surprise at all.\u003c/p\u003e\n\u003cp\u003eNatarkas, face slick with sweat behind his red mask, eased his horse into a canter. Surrounding him was the sound of thunder. Two thousand chosen warriors rode with him across the plain. As the canter was loosed into a gallop, lances were set, shields settled to cover groin, hip and chest.\u003c/p\u003e\n\u003cp\u003eNatarkas had led his cavalry through the night’s rain, east of the seabed, then north and finally, as false dawn licked the darkness, westward.\u003c/p\u003e\n\u003cp\u003eAt dawn, they were positioned a third of a league behind the Letherii forces. Arrayed into a wedge with Natarkas himself positioned in the centre of the sixth row. Awaiting the first sounds of battle.\u003c/p\u003e\n\u003cp\u003eRedmask had been adamant with his instructions. If enemy scouts found them, they were to wait, and wait yet longer, listening to the sounds of battle for at least two turns of the wheel. If they believed themselves un-discovered-if the opportunity for surprise remained-when the sounds of fighting commenced, Natarkas was to immediately lead his cavalry into an attack on the rear formations of the enemy forces-on, no doubt, the Tiste Edur. There was to be no deviation from these instructions.\u003c/p\u003e\n\u003cp\u003eAt dawn, his own scouts had ridden to Natarkas to announce that a mounted troop of Edur had discovered them. And he thought back to Redmask the night before. ‘Natarkas, do you understand why, if you are seen, I want you to hold? To not immediately charge? No? Then I will explain. If you are seen, 1 must be able to exploit that in the battle on the seabed. At least two wheels you must wait, doing nothing. This will lock the Tiste Edur in place. It may even draw out the Bluerose cavalry-and should they approach you, invite them to the chase ~ lead them away, yes, and keep leading them away. Do not engage them, Natarkas! You will be savaged! Run their horses into the dust-you see, they will cease to matter by then, and Bivatt will not have them at her disposal. This is important! Do you understand my commands?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-387.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
