{"id":104157,"no":39,"title":"Page 39","content":"\u003cp\u003e‘ 1 so look forward to next time-’\u003c/p\u003e\n\u003cp\u003e‘Tehol Beddict, do you know what fat root is used for?’\u003c/p\u003e\n\u003cp\u003eHer eyes had sharpened with suspicion, and Tehol realized that, were she indeed to dry out, she might be rather handsome after all, in a vaguely amphibian way. ‘No, why?’\u003c/p\u003e\n\u003cp\u003e‘Are you required to partake of it in some bizarre fashion?’\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e‘Are you certain? No unusual tea smelling yellow?’\u003c/p\u003e\n\u003cp\u003e‘Smelling yellow? What does that mean?’\u003c/p\u003e\n\u003cp\u003e‘If you smelled it, you’d know. Clearly, you haven’t. Good. Get out, I’m puckering.’\u003c/p\u003e\n\u003cp\u003eA hasty departure, then, from the Half-Axe. Onward, to the entrance to Grool’s Immeasurable Pots. Presumably, that description was intended to emphasize unmatched quality or something similar, since the pots themselves were sold as clocks, and for alchemical experiments and the like, and such functions were dependent on accurate rates of flow.\u003c/p\u003e\n\u003cp\u003eHe stepped inside the cramped, damp shop.\u003c/p\u003e\n\u003cp\u003e‘You’re always frowning when you come in here, Tehol Beddict.’\u003c/p\u003e\n\u003cp\u003e‘Good morning, Laudable Grool.’\u003c/p\u003e\n\u003cp\u003e‘The grey one, yes, that one there.’\u003c/p\u003e\n\u003cp\u003e‘A fine-looking pot-’\u003c/p\u003e\n\u003cp\u003e‘It’s a beaker, not a pot.’\u003c/p\u003e\n\u003cp\u003e‘Of course.’\u003c/p\u003e\n\u003cp\u003e‘Usual price.’\u003c/p\u003e\n\u003cp\u003e‘Why do you always hide behind all those pots, Laudable Grool? All I ever see of you is your hands.’\u003c/p\u003e\n\u003cp\u003e‘My hands are the only important part of me.’\u003c/p\u003e\n\u003cp\u003e‘All right.’ Tehol drew out a recently removed dorsal fin. ‘A succession of spines, these ones from a capabara. Gradating diameters-’\u003c/p\u003e\n\u003cp\u003e‘How do you know that?’\u003c/p\u003e\n\u003cp\u003e‘Well, you can see it-they get smaller as they go back.’\u003c/p\u003e\n\u003cp\u003e‘Yes, but how precise?’\u003c/p\u003e\n\u003cp\u003e‘That’s for you to decide. You demand objects with which to make holes. Here you have… what… twelve. How can you not be pleased by that?’\u003c/p\u003e\n\u003cp\u003e‘Who said I wasn’t pleased? Put them on the counter, Take the beaker. And get that damned fat root out of here.’\u003c/p\u003e\n\u003cp\u003eFrom there it was across to the small animals shop and Beastmonger Shill, an oversized woman endlessly bustling up and down the rows of tiny stacked cages, on her flattened heels a piping, scurrying swarm of little creatures. She squealed her usual delight at the gifts of beaker and fat root, the latter of which, it turned out, was most commonly used by malicious wives to effect the shrinkage of their husbands’ testicles; whilst Shill had, with some delicate modifications, applied the root’s diminutive properties to her broods, feeding the yellow-smelling tea out in precise Increments using the holed beaker.\u003c/p\u003e\n\u003cp\u003eThe meeting soured when Tehol slapped at a mosquito on his neck, only to be informed he had just killed a pygmy blood-sucking bat. His reply that the distinction was lost on him was not well received. But Shill opened the trapdoor on the floor at the back of the shop nevertheless, and Tehol descended the twenty-six narrow, steep stone steps to the crooked corridor-twenty-one paces long-that led to the ancient, empty beehive tomb, the walls of which had Been dismantled in three places to fashion rough doorways into snaking, low-cellinged tunnels, two of which ended in fatal traps. The third passageway eventually opened out int a long chamber occupied by a dozen or so dishevelled refugees, most of whom seemed to be asleep.\u003c/p\u003e\n\u003cp\u003eFortunately, Chief Investigator Rucket was not among the somnolent. Her brows rose when she saw him, her admirable face filling with an expression of unfeigned relief as she gestured him to her table. The surface was covered in parchment sheets depicting various floor plans and structural diagrams.\u003c/p\u003e\n\u003cp\u003e‘Sir, Tehol Beddict! Here, some wine! Drink. By the Brrant, a new face! You have no idea how sick I am of my Interminable companions in this hovel.’\u003c/p\u003e\n\u003cp\u003e‘Clearly,’ he replied, sitting, ‘you need to get out more.’\u003c/p\u003e\n\u003cp\u003e‘Alas, most of my investigations these days are archival in nature.’\u003c/p\u003e\n\u003cp\u003e‘Ah, the Grand Mystery you’ve uncovered. Any closer to a solution?’\u003c/p\u003e\n\u003cp\u003e‘Grand Mystery? More like Damned Mystery, and no, I remain baffled, even as my map grows with every day that passes. But let’s not talk any more about that. My agents report that the cracks in the foundation are inexorably spreading-well done, Tehol. I always figured you were smarter than you looked.’\u003c/p\u003e\n\u003cp\u003e‘Why thank you, Rucket. Have you got those lacquered tiles I asked for?’\u003c/p\u003e\n\u003cp\u003e‘Onyx finished the last one this morning. Sixteen in all, correct?’\u003c/p\u003e\n\u003cp\u003e‘Perfect. Bevelled edges?’\u003c/p\u003e\n\u003cp\u003e‘Of course. All of your instructions were adhered to with diligence.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-39.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
