{"id":104498,"no":390,"title":"Page 390","content":"\u003cp\u003eFour steps. Three.\u003c/p\u003e\n\u003cp\u003eAnd, at a bellowing shout, the points of those enormous wedges suddenly drove forward.\u003c/p\u003e\n\u003cp\u003eInto human flesh, into set shields, spears. Into the Awl.\u003c/p\u003e\n\u003cp\u003eEach and every mind dreamed of victory. Of immortality. And, among them all, not one would yield.\u003c/p\u003e\n\u003cp\u003eThe sun stared down, blazing with eager heat, on Q’uson Tapi, where two civilizations locked throat to throat.\u003c/p\u003e\n\u003cp\u003eOne last time.\u003c/p\u003e\n\u003cp\u003eA fateful decision, maybe, but he’d made it now. Dragging with him all the squads that had been in the village, Fiddler took over from some of Keneb’s more beat-up units the west-facing side of their turtleback defence. No longer standing eye to eye with that huge Letherii army and its Hood-cursed sorcerers. No, here they waited, and opposite them, drawing up in thick ranks, the Tiste Edur.\u003c/p\u003e\n\u003cp\u003eWas it cowardice? He wasn’t sure, and from the looks he caught in the eyes of his fellow sergeants-barring Hellian who’d made a temporarily unsuccessful grab at Skulldeath, or more precisely at his crotch, before Primly intervened-they weren’t sure, either.\u003c/p\u003e\n\u003cp\u003eFine, then, I just don’t want to see my death come rolling down on me. Is that cowardly? Aye, by all counts it couldn’t be anything but. Still, there’s this. I don’t feel frightened.\u003c/p\u003e\n\u003cp\u003eNo, all he wanted right now, beyond what Hellian so obviously wanted, of course, all he wanted, then, was to die fighting. To see the face of the bastard who killed him, to pass on, in that final meeting of eyes, all that dying meant, must have meant and would always mean… whatever that was, and let’s hope I do a better job of letting my killer know whatever it is-better, that is, than all those whose eyes I’ve looked into as they died at my hand. Aye, seems a worthy enough prayer.\u003c/p\u003e\n\u003cp\u003eBut I ain’t praying to you, Hood.\u003c/p\u003e\n\u003cp\u003eIn fact, damned if I know who I’m praying to, but even that doesn’t seem to matter.\u003c/p\u003e\n\u003cp\u003eHis soldiers were digging holes but not saying much. They’d received a satchelful of munitions, including two more cussers, and while that wasn’t nearly enough it made it advisable to dig the holes where they could crouch for cover when those sharpers, cussers and all the rest started going off.\u003c/p\u003e\n\u003cp\u003eAll of this, dammit, assumed there would be fighting.\u003c/p\u003e\n\u003cp\u003eFar more likely, magic would sweep over the Malazans, one and all, grabbing at their throats even as it burned away skin, muscle and organs, burned away even their last desperate, furious screams.\u003c/p\u003e\n\u003cp\u003eFiddler vowed to make his last scream a curse. A good one, too.\u003c/p\u003e\n\u003cp\u003eHe stared across at the rows of Tiste Edur.\u003c/p\u003e\n\u003cp\u003eBeside him, Cuttle said, ‘They don’t like it neither, you know.’\u003c/p\u003e\n\u003cp\u003eFiddler replied with a wordless grunt.\u003c/p\u003e\n\u003cp\u003e‘That’s their leader, that old one with the hunched shoulders. Too many paying him too much attention. I plan to take him out, Fid-with a cusser. Listen-are you listening? As soon as that wave of magic starts its roll, we should damn well up and charge these bastards.’\u003c/p\u003e\n\u003cp\u003eNot a bad idea, actually. Blinking, Fiddler faced the sapper, and then nodded. ‘Pass the word, then.’\u003c/p\u003e\n\u003cp\u003eAt that moment one of Thorn Tissy’s soldiers jogged into their midst. ‘Fist’s orders,’ he said, looking round. ‘Where’s your captain?’\u003c/p\u003e\n\u003cp\u003e‘Holding Beak’s hand, somewhere else,’ Fiddler replied. ‘You can give those orders to me, soldier.’\u003c/p\u003e\n\u003cp\u003e‘All right. Maintain the turtleback-do not advance on the enemy-’\u003c/p\u003e\n\u003cp\u003e‘That’s fucking-’\u003c/p\u003e\n\u003cp\u003e‘Enough, Cuttle!’ Fiddler snapped. To the runner he nodded and said, ‘How long?’\u003c/p\u003e\n\u003cp\u003eA blank expression answered that question.\u003c/p\u003e\n\u003cp\u003eFiddler waved the idiot on, then turned once more to stare across at the Tiste Edur.\u003c/p\u003e\n\u003cp\u003e‘Damn him, Fid!’\u003c/p\u003e\n\u003cp\u003e‘Relax, Cuttle. We’ll set out when we have to, all right?’\u003c/p\u003e\n\u003cp\u003e‘Sergeant?’ Bottle was suddenly crawling out of the hole he’d dug, and there was a strained look on his face. ‘Something… something’s happening-’\u003c/p\u003e\n\u003cp\u003eAt that moment, from the ridge to the east, a blood-chilling sound-like ten thousand anchor chains ripping up from the ground, and there rose a virulent wall of swirling magic. Dark purple and shot through with crimson veins, black etchings like lightning darting along the crest as it rose, higher, yet higher-\u003c/p\u003e\n\u003cp\u003e‘Hood’s balls!’ Cuttle breathed, eyes wide.\u003c/p\u003e\n\u003cp\u003eFiddler simply stared. This was the sorcery they’d seen off the north coast of Seven Cities. Only, then they’d had Quick Ben with them. And Bottle had his-he reached out and pulled Bottle close. ‘Listen! Is she-’\u003c/p\u003e\n\u003cp\u003e‘No, Fid! Nowhere! She’s not been with me since we landed. I’m sorry-’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-390.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
