{"id":104516,"no":408,"title":"Page 408","content":"\u003cp\u003eMenandore spun on the two remaining men. ‘You damned fools!’\u003c/p\u003e\n\u003cp\u003e‘Just for that,’ the wizard said, ‘I’m not giving you my favourite stone.’\u003c/p\u003e\n\u003cp\u003eHedge and Quick Ben watched her march back down the slope.\u003c/p\u003e\n\u003cp\u003e‘That was odd,’ the sapper muttered.\u003c/p\u003e\n\u003cp\u003e‘Wasn’t it.’\u003c/p\u003e\n\u003cp\u003eThey were silent for another hundred heartbeats, then Hedge turned to Quick Ben. ‘So what do you think?’\u003c/p\u003e\n\u003cp\u003e‘You know exactly what I’m thinking, Hedge.’\u003c/p\u003e\n\u003cp\u003e‘Same as me, then.’\u003c/p\u003e\n\u003cp\u003e‘The same.’\u003c/p\u003e\n\u003cp\u003e‘Tell me something, Quick.’\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003e‘Was that really your favourite stone?’\u003c/p\u003e\n\u003cp\u003e‘Do you mean the one I had in my hand? Or the one I slipped into her fancy white cloak?’\u003c/p\u003e\n\u003cp\u003eWith skin wrinkled and stained by millennia buried in peat, Sheltatha Lore did indeed present an iconic figure of dusk. In keeping now with her reddish hair and the murky hue of her eyes, she wore a cloak of deep burgundy, black leather leggings and boots. Bronze-studded vest drawn tight across her chest.\u003c/p\u003e\n\u003cp\u003eAt her side-like Sheltatha facing the hills-stood Sukul Ankhadu, Dapple, the mottling of her skin visible on her bared hands and forearms. On her slim shoulders a Letherii night-cloak, as was worn now by the noble born and the women of the Tiste Edur in the empire, although this one was somewhat worse for wear.\u003c/p\u003e\n\u003cp\u003e‘Soon,’ said Sheltatha Lore, ‘this realm shall be dust.’\u003c/p\u003e\n\u003cp\u003e‘This pleases you, sister?’\u003c/p\u003e\n\u003cp\u003e‘Perhaps not as much as it pleases you, Sukul. Why is this place an abomination in your eyes?’\u003c/p\u003e\n\u003cp\u003e‘I have no love for Imass. Imagine, a people grubbing in the dirt of caves for hundreds of thousands of years. Building nothing. All history trapped as memory, twisted as tales sung in rhyme every night. They are flawed. In their souls, there must be a flaw, a failing. And these ones here, they have deluded themselves into believing that they actually exist.’\u003c/p\u003e\n\u003cp\u003e‘Not all of them, Sukul.’\u003c/p\u003e\n\u003cp\u003eDapple waved dismissively. ‘The greatest failing here, Sheltatha, lies with the Lord of Death. If not for Hood’s indifference, this realm could never have lasted as long as it has. It irritates me, such carelessness.’\u003c/p\u003e\n\u003cp\u003e‘So,’ Sheltatha Lore said with a smile, ‘you will hasten the demise of these Imass, even though, with the realm dying anyway, they are already doomed.’\u003c/p\u003e\n\u003cp\u003e‘You do not understand. The situation has… changed.’\u003c/p\u003e\n\u003cp\u003e‘What do you mean?’\u003c/p\u003e\n\u003cp\u003e‘Their conceit,’ said Sukul, ‘has made them real. Mortal, now. Blood, flesh and bone. Capable of bleeding, of dying. Yet they remain ignorant of their world’s imminent extinction. My slaughtering them, sister, will be an act of mercy.’\u003c/p\u003e\n\u003cp\u003eSheltatha Lore grunted. ‘I cannot wait to hear them thank you.’\u003c/p\u003e\n\u003cp\u003eAt that moment a gold and white dragon rose into view before them, sailing low over the crests of the hills.\u003c/p\u003e\n\u003cp\u003eSukul Ankhadu sighed. ‘It begins.’\u003c/p\u003e\n\u003cp\u003eThe Soletaken glided down the slope directly towards them. Looming huge, yet still fifty paces away, the dragon tilted its wings back, crooked them as its hind limbs reached downwards, then settled onto the ground.\u003c/p\u003e\n\u003cp\u003eA blurring swirl enveloped the beast, and a moment later Menandore walked out from that spice-laden disturbance.\u003c/p\u003e\n\u003cp\u003eSheltatha Lore and Sukul Ankhadu waited, saying nothing, their faces expressionless, while Menandore approached, finally halting five paces from them, her blazing eyes moving from one sister to the other, then back again. She said, ‘Are we still agreed, then?’\u003c/p\u003e\n\u003cp\u003e‘Such glorious precedent, this moment,’ Sheltatha Lore observed.\u003c/p\u003e\n\u003cp\u003eMenandore frowned. ‘Necessity. At least we should be understood on that matter. I cannot stand alone, cannot guard the soul of Scabandari. The Finnest must not fall in his hands.’\u003c/p\u003e\n\u003cp\u003eA slight catch of breath from Sukul. ‘Is he near, then?’\u003c/p\u003e\n\u003cp\u003e‘Oh yes. I have stolen the eyes of one travelling with him. Again and again. They even now draw to the last gate, and look upon its wound, and stand before the torn corpse of that foolish Imass Bonecaster who thought she could seal it with her own soul.’ Menandore sneered. ‘Imagine such effrontery. Starvald Demelain! The very chambers of K’rul’s heart! Did she not know how that weakened him? Weakened everything7.’\u003c/p\u003e\n\u003cp\u003e‘So we three kill Silchas Ruin,’ Sheltatha Lore said. ‘And then the Imass.’\u003c/p\u003e\n\u003cp\u003e‘My son chooses to oppose us in that last detail,’ Menandore said. ‘But the Imass have outlived their usefulness. We shall wound Rud if we must, but we do not kill him. Understood? I will have your word on this. Again. Here and now, sisters.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-408.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
