{"id":104159,"no":41,"title":"Page 41","content":"\u003cp\u003e‘At the very least,’ the captain said, ‘we’ll take a look.’ She sniffed. ‘At least maybe something will come of getting blown into the flats. Have ‘em send out the sweeps, Skorgen, but keep that lookout’s head spinning in every direction;’\u003c/p\u003e\n\u003cp\u003eSkorgen looked across at her. ‘You think there might be more of ‘em out here?’\u003c/p\u003e\n\u003cp\u003eShe made a face. ‘How many ships did the Emperor send out?’\u003c/p\u003e\n\u003cp\u003eHis good eye widened, then he studied the lone derelict once more through the eyeglass. ‘You think it’s one of those? Errant’s butt hole, Captain, if you’re right…’\u003c/p\u003e\n\u003cp\u003e‘You have your orders, and it seems I must remind you yet againn, First Mate. No profanity on my ship.’\u003c/p\u003e\n\u003cp\u003e‘Apologies, Captain.’\u003c/p\u003e\n\u003cp\u003eHe hurried off, began relaying orders to the waiting crew.\u003c/p\u003e\n\u003cp\u003eDoldrums made for a quiet lot, a kind of superstitious furtiveness gripping the sailors, as if any sound reaching too far might crack the mirror of the sea.\u003c/p\u003e\n\u003cp\u003eShe listened as the twenty-four sweeps slid out, blades setting in the water. A moment later came the muted call-out of the cox, and the Undying Gratitude groaned as’ it lurched forward. Clouds of sleeper flies rose around the ship as the nearby sea’s pellucid surface was disturbed. The damned things had a tendency to seek out dark cover once driven to flight. Sailors coughed and spat-all very well for them, the captain observed, as a whining cloud spun round her head and countless insects crawled up her nose, into her ears, and across her eyes. Sun and sea were bad enough, combining to assail her dignity and whatever varnity a woman who was dead could muster, but for Shurq Blalle, these flies made for profoundly acute misery.\u003c/p\u003e\n\u003cp\u003ePirate, divine undead, strumpet of insatiability, witch of the deep waters-the times had been good ever since she first sailed out of the Letheras harbour, down the long, broad river to the western seas. Lean and sleek, that first galley had been her passage to fame, and Shurq still regretted its fiery loss to that Mare escort in Laughter’s End. But she was well pleased with the Undying Gratitude. Slightly too big for her crew, granted, but with their return to Letheras that problem could be solved easily enough. Her greatest sense of loss was with the departure of the Crimson Guard. Iron Bars had made it plain from the very start that they were working for passage. Even so, they’d been formidable additions on that wild crossing of the ocean, keeping the blood wake wide and unbroken as one merchant trader after another was taken, stripped of all valuables, then, more often than not, sent down into the dark. It hadn’t been just their swords, deadly as those were, but the magery of Corlos-a magery far more refined, far more clever, than anything Shurq had witnessed before.\u003c/p\u003e\n\u003cp\u003eSuch details opened her eyes, her mind as well. The world out there was huge. And in many fundamental ways the empire of Lether, child of the First Empire, had been left in a kind of backwater, in its thinking, in its ways of working. A humbling revelation indeed.\u003c/p\u003e\n\u003cp\u003eThe leavetaking with Iron Bars and his squad had not been quite as emotional or heartfelt for Shurq Elalle as it had probably seemed to everyone else, for the truth was, she had been growing ever more uneasy in their company. Iron Bars was not one to find subordination palatable for very long-oh, no doubt it was different when it came to his fellow Avowed among the Crimson Guard, or to their legendary commander, Prince K’azz. But she was not an Avowed, nor even one of that company’s soldiers. So long as their goals ran in parallel, things were fine enough, and Shurq had made certain to never deviate, so as to avoid any confrontation.\u003c/p\u003e\n\u003cp\u003eThey had deposited the mercenaries on a stony beach of the eastern shore of a land called Jacuruku, the sky squalling with sleeting rain. The landing had not been without witnesses, alas, and the last she’d seen of Iron Bars and his soldiers, they were turning inland to face a dozen massively armoured figures descending the broken slope, great-helmed with visors lowered. Brutal-looking biinch, and Shurq hoped all that belligerence was mostly for show. The grey sheets of rain had soon obscured all details from the strand as they pulled away on the oars back to the Gratitude.\u003c/p\u003e\n\u003cp\u003eSkorgen had sworn he’d caught the sound of blades clashing-a faint echo-with his one good ear, but Shurq herself had heard nothing.\u003c/p\u003e\n\u003cp\u003eIn any case, they’d scurried from those waters, as pirates were wont to do when there was the risk of organized resistance lurking nearby, and Shurq consoled her agitated conscience by reminding herself that Iron Bars had spoken of Jacuruku with some familiarity-at least in so far as knowing its name. And as for Corlos’s wide-eyed prayers to i lew dozen divinities, well, he was prone to melodrama. A dozen knights wouldn’t have been enough to halt Iron Bars and his Crimson Guard, determined as they were to do whatever it was they had to do, which, in this instance, was cross Jacuruku from one coast to the other, then find them-selves another ship.\u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-41.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
