{"id":104519,"no":412,"title":"Page 412","content":"\u003cp\u003eUlshun Pral smiled.\u003c/p\u003e\n\u003cp\u003eThe man scowled. ‘Quick, this oaf doesn’t understand Malazan.’ He then pointed back towards the rocks. ‘Go there! Onrack and Trull. Go!’\u003c/p\u003e\n\u003cp\u003eThe taller man snorted. ‘Enough, Hedge. That oaf understands you just fine.’\u003c/p\u003e\n\u003cp\u003e‘Oh, so why ain’t he listening to me?’\u003c/p\u003e\n\u003cp\u003e‘How should I know?’\u003c/p\u003e\n\u003cp\u003eUlshun waited a moment longer, fixing into his memory the faces of these two men, so that death would not take all of them. He hoped they were doing the same with him, although of course they might well not understand the gift, nor even that they had given it.\u003c/p\u003e\n\u003cp\u003eImass knew many truths that were lost to those who were, in every sense, their children. This, alas, did not make Imass superior, for most of those truths were unpleasant ones, and these children could not defend themselves against them, and so would be fatally weakened by their recognition.\u003c/p\u003e\n\u003cp\u003eFor example, Ulshun Pral reminded himself, he had been waiting for this time, understanding all that was coming to this moment, all the truths bound within what would happen. Unlike his people, he had not been a ghost memory. He had not lived countless millennia in a haze of self-delusion. Oh, his life had spanned that time, but it had been just that: a life. Drawn out to near immortality, not through any soul-destroying ritual, but because of this realm. This deathless realm.\u003c/p\u003e\n\u003cp\u003eThat was deathless no longer.\u003c/p\u003e\n\u003cp\u003eHe set out, then, leaving these two brave children, and made his way towards the cave.\u003c/p\u003e\n\u003cp\u003eIt might begin here, beneath this empty sky. But it would end, Ulshun Pral knew, before the Gates of Starvald Demelain.\u003c/p\u003e\n\u003cp\u003eWhere a Bentract Bonecaster had failed. Not because the wound proved too virulent, or too vast. But because the Bonecaster had been nothing more than a ghost to begin with. A faded, pallid soul, a thing with barely enough power to hold on to itself.\u003c/p\u003e\n\u003cp\u003eUlshun Pral was twenty paces from the entrance to the cave when Onrack the Broken emerged, and in Ulshun’s heart there burgeoned such a welling of pride that tears filled his eyes.\u003c/p\u003e\n\u003cp\u003e‘So I take it,’ Hedge said, locking the foot of his crossbow, ‘that what we were both thinking means neither of us is much surprised.’\u003c/p\u003e\n\u003cp\u003e‘She gave in too easily.’\u003c/p\u003e\n\u003cp\u003eHedge nodded. ‘That she did. But I’m still wondering, Quick, why didn’t she grab that damned Finnest a long time ago? Squirrel it away some place where Silchas Ruin would never find it? Answer me that!’\u003c/p\u003e\n\u003cp\u003eThe wizard grunted as he moved out to the crest of the slope. ‘She probably thought she’d done just as you said, Hedge.’\u003c/p\u003e\n\u003cp\u003eHedge blinked, then frowned. ‘Huh. Hadn’t thought of that.’\u003c/p\u003e\n\u003cp\u003e‘That’s because you’re thick, sapper. Now, if this goes the way I want it to, you won’t be needed at all. Keep that in mind, Hedge. I’m begging you.’\u003c/p\u003e\n\u003cp\u003e‘Oh, just get on with it.’\u003c/p\u003e\n\u003cp\u003e‘Fine then. I will.’\u003c/p\u003e\n\u003cp\u003eAnd Ben Adaephon Delat straightened, then slowly raised his arms.\u003c/p\u003e\n\u003cp\u003eHis scrawny arms. Hedge laughed.\u003c/p\u003e\n\u003cp\u003eThe wizard glared back at him over a shoulder. ‘Will you stop that?’\u003c/p\u003e\n\u003cp\u003e‘Sorry! Had no idea you were so touchy.’\u003c/p\u003e\n\u003cp\u003eQuick Ben cursed, then turned and walked back to Hedge.\u003c/p\u003e\n\u003cp\u003eAnd punched him in the nose.\u003c/p\u003e\n\u003cp\u003eStunned, eyes filling with tears, the sapper staggered back. Brought a hand to his face to stem the sudden gushing of blood. ‘You broke my damned nose!’\u003c/p\u003e\n\u003cp\u003e‘So I did,’ the wizard answered, shaking one hand. And look, Hedge, you’re bleeding.’\u003c/p\u003e\n\u003cp\u003e‘Is it any surprise? Ow-’\u003c/p\u003e\n\u003cp\u003e‘Hedge. You are bleeding.’\u003c/p\u003e\n\u003cp\u003eI’m-oh, gods.\u003c/p\u003e\n\u003cp\u003e‘Get it now?’\u003c/p\u003e\n\u003cp\u003eAnd Quick turned and walked back, resumed his stance at the crest.\u003c/p\u003e\n\u003cp\u003eHedge stared down at his bloody hand. ‘Shit!’\u003c/p\u003e\n\u003cp\u003eTheir conversation stopped then.\u003c/p\u003e\n\u003cp\u003eSince the three dragons were now no longer tiny specks.\u003c/p\u003e\n\u003cp\u003eMenandore’s hatred of her sisters in no way diminished her respect for their power, and against Silchas Ruin that power would be needed. She knew that the three of them, together, could destroy that bastard. Utterly. True, one or two of them might fall. But not Menandore. She had plans to ensure that she would survive.\u003c/p\u003e\n\u003cp\u003eBefore her now, minuscule on the edge of that rise, a lone mortal-the other one was crouching as if in terror, well behind his braver but equally stupid companion-a lone mortal, raising his hands.\u003c/p\u003e\n\u003cp\u003eOh, mage, to think that will be enough.\u003c/p\u003e\n\u003cp\u003eAgainst us!\u003c/p\u003e\n\u003cp\u003ePower burgeoned within her and to either side she felt the same-sudden pressure, sudden promise.\u003c/p\u003e\n\u003cp\u003eAngling downward now, three man-heights from the basin’s tawny grasses, huge shadows drawing closer, yet closer. Sleeting towards that slope. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-412.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
