{"id":104520,"no":413,"title":"Page 413","content":"\u003cp\u003eShe unhinged her jaws.\u003c/p\u003e\n\u003cp\u003eHedge wiped blood from his face, blinked to clear his vision as he swore at his own throbbing head, and then lifted the crossbow. Just in case. Sweet candy for the middle one, aye.\u003c/p\u003e\n\u003cp\u003eThe trio of dragons, wings wide, glided low above the ground, at a height that would bring them more or less level with the crest of this ancient atoll. They were, Hedge realized, awfully big.\u003c/p\u003e\n\u003cp\u003eIn perfect unison, all three dragons opened their mouths.\u003c/p\u003e\n\u003cp\u003eAnd Quick Ben, standing there like a frail willow before a tsunami, unleashed his magic.\u003c/p\u003e\n\u003cp\u003eThe very earth of the slope lifted up, heaved up to hammer the dragons like enormous fists into their chests.\u003c/p\u003e\n\u003cp\u003eNecks whipped. Heads snapped back. Sorcery exploded from those jaws, waves lashing skyward-flung uselessly into the air, where the three sorceries clashed, writhing in a frenzy of mutual destruction.\u003c/p\u003e\n\u003cp\u003eWhere the slope had been there were now clouds of dark, dusty earth, pieces of sod still spinning upward, long roots trailing like hair, and the hill lurched as the three dragons, engulfed by tons of earth, crashed into the ground forty paces from where stood Quick Ben.\u003c/p\u003e\n\u003cp\u003eAnd down, into that chaotic storm of soil and dragon, the wizard marched.\u003c/p\u003e\n\u003cp\u003eWaves erupted from him, rolling amidst the crackle of lightning, sweeping down in charging crests. Striking the floundering beasts with a succession of impacts that shook the entire hill. Black fire gouted, rocks sizzled as they were launched into the air, where they simply shattered into dust.\u003c/p\u003e\n\u003cp\u003eWave after wave unleashed from the wizard’s hands.\u003c/p\u003e\n\u003cp\u003eHedge, staggering drunkenly to the edge, saw a dragon, hammered full on, flung onto its back, then pushed, skidding, kicking, like a flesh and blood avalanche, down onto the basin, gouging deep grooves across the flat as it was driven back, and back.\u003c/p\u003e\n\u003cp\u003eAnother, with skin seeming afire, sought to lift itself into the air.\u003c/p\u003e\n\u003cp\u003eAnother wave rose above it, slapped the beast back down with a bone-snapping crunch.\u003c/p\u003e\n\u003cp\u003eThe third creature, half buried beneath steaming soil, suddenly turned then and launched itself straight for the dragon beside it. Jaws opening, magic ripping forth to lance into the side of its once-ally. Flesh exploded, blood spraying in a black cloud.\u003c/p\u003e\n\u003cp\u003eAn ear-piercing shriek, the struck one’s head whipping-even as enormous jaws closed on its throat.\u003c/p\u003e\n\u003cp\u003eHedge saw that neck collapse in a welter of blood.\u003c/p\u003e\n\u003cp\u003eMore blood poured from the stricken dragon’s gaping mouth, a damned fountain of the stuff-\u003c/p\u003e\n\u003cp\u003eQuick Ben was walking back up the slope, seemingly indifferent to the carnage behind him.\u003c/p\u003e\n\u003cp\u003eThe third dragon, the one driven far out on the basin, at the end of a torn-up track that stretched across the grass like a wound, now lifted itself into the air, streaming blood, and, climbing still higher, banked south and then eastward.\u003c/p\u003e\n\u003cp\u003eThe warring dragons at the base of the slope slashed and tore at each other, yet the attacker would not release its death-grip on the other’s neck, and those huge fangs were sawing right through. Then the spine crunched, snapped, and suddenly the severed head and its arm-length’s worth of throat fell to the churned ground with a heavy thud. The body kicked, gouging into its slayer’s underbelly for a moment longer, then sagged down as a spraying exhalation burst from the severed neck.\u003c/p\u003e\n\u003cp\u003eQuick Ben staggered onto the summit.\u003c/p\u003e\n\u003cp\u003eHedge dragged his eyes from the scene below and stared at the wizard. ‘You look like Hood’s own arse-wipe, Quick.’\u003c/p\u003e\n\u003cp\u003e‘Feel like it too, Hedge.’ He pivoted round, the motion like an old man’s. ‘Sheltatha-what a nasty creature-turned on Menandore just like that!’\u003c/p\u003e\n\u003cp\u003e‘When she realized they weren’t getting past you, aye,’ Hedge said. ‘The other one’s going for the Imass, I’d wager.’\u003c/p\u003e\n\u003cp\u003e‘Won’t get past Rud Ellalle.’\u003c/p\u003e\n\u003cp\u003e‘No surprise, since you turned her into one giant bruise.’\u003c/p\u003e\n\u003cp\u003eBelow, Sheltatha Lore, her belly ripped open, was dragging herself away.\u003c/p\u003e\n\u003cp\u003eHedge eyed the treacherous beast.\u003c/p\u003e\n\u003cp\u003e‘Aye, sapper,’ Quick Ben said in a hollow voice. ‘Now you get to play.’\u003c/p\u003e\n\u003cp\u003eHedge grunted. ‘Damn short playtime, Quick.’\u003c/p\u003e\n\u003cp\u003e‘And then you nap.’\u003c/p\u003e\n\u003cp\u003e‘Funny.’\u003c/p\u003e\n\u003cp\u003eHedge raised the crossbow, paused to gauge the angle. Then he settled his right index finger against the release. And grinned. ‘Here, suck on this, you fat winged cow.’\u003c/p\u003e\n\u003cp\u003eA solid thunk as the cusser shot out, then down.\u003c/p\u003e\n\u003cp\u003eLanding within the gaping cavity of Sheltatha Lore’s belly.\u003c/p\u003e\n\u003cp\u003eThe explosion sent chunks of dragon flesh in all directions. The thick, red, foul rain showered down on Hedge and Quick Ben. And what might have been a vertebra hammered Hedge right between the eyes, knocking him out cold. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-413.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
