{"id":104521,"no":414,"title":"Page 414","content":"\u003cp\u003eFlung onto his hands and knees by the concussion, Quick Ben stared across at his unconscious friend, then began laughing. Higher-pitched than usual.\u003c/p\u003e\n\u003cp\u003eAs they strode into the cave of paintings, Onrack reached out a hand to stay Ulshun Pral. ‘Remain here,’ he said.\u003c/p\u003e\n\u003cp\u003e‘That is never easy,’ Ulshun Pral replied, yet he halted nonetheless.\u003c/p\u003e\n\u003cp\u003eNodding, Onrack looked at the images on the walls. ‘You see again and again the flaws.’\u003c/p\u003e\n\u003cp\u003e‘The failing of my hand, yes. The language of the eyes is ever perfect. Rendering it upon stone is where weakness is found.’\u003c/p\u003e\n\u003cp\u003e‘These, Ulshun Pral, show few weaknesses.’\u003c/p\u003e\n\u003cp\u003e‘Even so…’\u003c/p\u003e\n\u003cp\u003e‘Remain, please,’ Onrack said, slowly drawing his sword. ‘The Gate… there will be intruders.’\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘Is it you they seek?’\u003c/p\u003e\n\u003cp\u003eYes, Onrack the Broken. It is me.’\u003c/p\u003e\n\u003cp\u003e‘Why?’\u003c/p\u003e\n\u003cp\u003e‘Because a Jaghut gave me something, once, long ago.’\u003c/p\u003e\n\u003cp\u003e‘A Jaghut?’\u003c/p\u003e\n\u003cp\u003eUlshun Pral smiled at the astonishment on Onrack’s face. ‘Here, in this world,’ he said, ‘we long ago ended our war. Here, we chose peace.’\u003c/p\u003e\n\u003cp\u003e‘Yet that which the Jaghut gave you now endangers you, Ulshun Pral. And your clans.’\u003c/p\u003e\n\u003cp\u003eDeep thundering concussions suddenly shook the walls around them.\u003c/p\u003e\n\u003cp\u003eOnrack bared his teeth. ‘1 must go.’\u003c/p\u003e\n\u003cp\u003eA moment later Ulshun Pral was alone, in the cave with all the paintings he had fashioned, and there was no light now that Onrack and the torch he had been carrying were gone. As the drums of grim magic reverberated through the rock surrounding him, he remained where he was, motionless, for a dozen heartbeats. Then he set out, after Onrack. On the path to the Gate.\u003c/p\u003e\n\u003cp\u003eThere was, in truth, no choice.\u003c/p\u003e\n\u003cp\u003eRud Elalle had led the Imass deeper into the rugged hills, then down the length of a narrow, crooked defile where some past earthquake had broken in half an entire mass of limestone, forming high, angled walls flanking a crack through its heart. At the mouth of this channel, as Rud Elalle urged the last few Imass into the narrow passage, Hostille Rator, Til’aras Benok and Gr’istanas Ish’ilm halted.\u003c/p\u003e\n\u003cp\u003e‘Quickly!’ cried Rud Elalle.\u003c/p\u003e\n\u003cp\u003eBut the clan chief was drawing out his cutlass-length obsidian sword with his right hand and a bone-hafted, groundstone maul with his left. ‘An enemy approaches,’ Hostille Rator said. ‘Go on, Rud Elalle. We three will guard the mouth of this passage.’\u003c/p\u003e\n\u003cp\u003eThey could hear terrible thunder from just south of the old camp.\u003c/p\u003e\n\u003cp\u003eRud Elalle seemed at a loss.\u003c/p\u003e\n\u003cp\u003eHostille Rator said, ‘We did not come to this realm… expecting what we have found. We are now flesh, and so too are those Imass you call your own. Death, Rud Elalle, has arrived.’ He pointed southward with his sword. ‘A lone dragon has escaped the High Mage. To hunt down you and the Bentract. Rud Elalle, even as a dragon, she must land here. She must then semble into her other form. So that she can walk this passageway. We will meet her here, the three of us… strangers.’\u003c/p\u003e\n\u003cp\u003e‘I can-’\u003c/p\u003e\n\u003cp\u003e‘No, Rud Elalle. This dragon may not prove the only danger to you and the clans. You must go, you must prepare to stand as their final protector.’\u003c/p\u003e\n\u003cp\u003e‘Why-why do you do this?’\u003c/p\u003e\n\u003cp\u003e‘Because it pleases us.’ Because you please us, Rud Elalle. So too Ulshun Pral. And the lmass…\u003c/p\u003e\n\u003cp\u003eAnd we came here with chaos in our hearts.\u003c/p\u003e\n\u003cp\u003e‘Go, Rud Elalle.’\u003c/p\u003e\n\u003cp\u003eSukul Ankhadu knew her sisters were dead, and for all the shock this realization engendered-the shattering of their plan to destroy Silchas Ruin, to enslave the Finnest of Scabandari and subject that torn, vulnerable soul to endless cruelty-a part of her was filled with glee. Menandore-whom she and Sheltatha Lore had intended to betray in any case-would never again befoul Sukul’s desires and ambitions. Sheltatha-well, she had done what was needed, turning upon Menandore at the moment of her greatest weakness. And had she survived that, Sukul would have had to kill the bitch herself.\u003c/p\u003e\n\u003cp\u003eExtraordinary, that a lone mortal human could unleash such venomous power. No, not a mere mortal human. There were other things hiding inside that scrawny body, she was certain of that. If she never encountered him again, she would know a life of peace, a life without fear.\u003c/p\u003e\n\u003cp\u003eHer wounds were, all things considered, relatively minor. One wing was shattered, forcing her to rely almost entirely on sorcery to keep her in the air. An assortment of scrapes and gouges, but already the bleeding had ebbed, the wounds were closing.\u003c/p\u003e\n\u003cp\u003eShe could smell the stench of the lmass, could follow their trail with ease as it wound through the broken hills below. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-414.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
