{"id":104534,"no":429,"title":"Page 429","content":"\u003cp\u003eA handful of marines to conquer an imperial capital? ‘Adjunct-’\u003c/p\u003e\n\u003cp\u003e‘Enough. You will command for this night, Captain, as my representative. We march at dawn.’ She turned. ‘I must return to the Froth Wolf.’\u003c/p\u003e\n\u003cp\u003e‘Adjunct?’\u003c/p\u003e\n\u003cp\u003eTavore grimaced. ‘Another argument with a certain weaponsmith and his belligerent wife.’ Then she paused, ‘Oh, when or if Sergeant Balm returns, I would hear his report.’\u003c/p\u003e\n\u003cp\u003e‘Of course,’ Lostara Yil replied. If?\u003c/p\u003e\n\u003cp\u003eShe watched the Adjunct walk away, down towards the shore.\u003c/p\u003e\n\u003cp\u003eAboard the Froth Wolf, Shurq Elalle leaned against the mainmast, her arms crossed, watching the three black, hairless, winged ape-like demons fighting over a shortsword. The scrap, a tumbling flurry of biting, scratching and countless inadvertent cuts and slices from the weapon itself, had migrated from the stern end of the mid-deck and was now climbing up onto the foredeck.\u003c/p\u003e\n\u003cp\u003eSailors stood here and there, keeping well clear, and trading wagers on which demon would win out-an issue of some dispute since it was hard to tell the three beasts apart.\u003c/p\u003e\n\u003cp\u003e‘-with the cut across the nose-wait, Mael’s salty slick! Now another one’s got the same cut! Okay, the one without-’\u003c/p\u003e\n\u003cp\u003e‘-which one just lost that ear? Cut nose and missing ear, then!’\u003c/p\u003e\n\u003cp\u003eClose beside Shurq Elalle, a voice said*, ‘None of it’s real, you know.’\u003c/p\u003e\n\u003cp\u003eShe turned. ‘Thought she had you chained below.’\u003c/p\u003e\n\u003cp\u003e‘Who, the Adjunct? Why-’\u003c/p\u003e\n\u003cp\u003e‘No. Your wife, Withal.’\u003c/p\u003e\n\u003cp\u003eThe man frowned. ‘That’s how it looks, is it?’\u003c/p\u003e\n\u003cp\u003e‘Only of late,’ Shurq replied. ‘She’s frightened for you, I think.’\u003c/p\u003e\n\u003cp\u003eTo that he made no response.\u003c/p\u003e\n\u003cp\u003e‘A launch is returning,’ Shurq observed, then straightened. ‘I hope it’s the Adjunct-I’m ready to leave your blessed company. No offence, Withal, but I’m nervous about my first mate and what he might be doing with the Undying Gratitude.’\u003c/p\u003e\n\u003cp\u003eThe Meckros weaponsmith turned to squint out into the darkness of the main channel. ‘Last I saw, he’d yet to drop anchor and was just sailing back and forth.’\u003c/p\u003e\n\u003cp\u003e‘Yes,’ Shurq said. ‘Sane people pace in their cabin. Skorgen paces with the whole damned ship.’\u003c/p\u003e\n\u003cp\u003e‘Why so impatient?’\u003c/p\u003e\n\u003cp\u003e‘I expect he wants to tie up in Letheras well before this army arrives. And take on panicky nobles with all their worldly goods. Then we head back out before the Malazan storm, dump the nobles over the side and share out the spoils.’\u003c/p\u003e\n\u003cp\u003e‘As any proper pirate would do.’\u003c/p\u003e\n\u003cp\u003e‘Precisely.’\u003c/p\u003e\n\u003cp\u003e‘Do you enjoy your profession, Captain? Does it not get stale after a time?’\u003c/p\u003e\n\u003cp\u003e‘No, that’s me who gets stale after a time. As for the profession, why yes, I do enjoy it, Withal.’\u003c/p\u003e\n\u003cp\u003e‘Even throwing nobles overboard?’\u003c/p\u003e\n\u003cp\u003e‘With all that money they should have paid for swimming lessons.’\u003c/p\u003e\n\u003cp\u003e‘Belated financial advice.’\u003c/p\u003e\n\u003cp\u003e‘Don’t make me laugh.’\u003c/p\u003e\n\u003cp\u003eA sudden outcry from the sailors. On the foredeck, the demons had somehow managed to skewer themselves on the sword. The weapon pinned all three of them to the deck. The creatures writhed. Blood poured from their mouths, even as the bottom-most one began strangling from behind the one in the middle, who followed suit with the one on top. The demon in the middle began cracking the back of its head into the bottom demon’s face, smashing its already cut nose.\u003c/p\u003e\n\u003cp\u003eShurq Elalle turned away. ‘Errant take me,’ she muttered. ‘I nearly lost it there.’\u003c/p\u003e\n\u003cp\u003e‘Lost what?’\u003c/p\u003e\n\u003cp\u003e‘You do not want to know.’\u003c/p\u003e\n\u003cp\u003eThe launch arrived, thumping up against the hull, and moments later the Adjunct climbed into view. She cast a single glance over at the pinned demons, then nodded greeting to Shurq Elalle as she walked up to Withal.\u003c/p\u003e\n\u003cp\u003e‘Is it time?’ he asked.\u003c/p\u003e\n\u003cp\u003e‘Almost,’ she replied. ‘Come with me.’\u003c/p\u003e\n\u003cp\u003eShurq watched the two head below.\u003c/p\u003e\n\u003cp\u003eWithal, you poor man. Now I’m frightened for you as well.\u003c/p\u003e\n\u003cp\u003eDamn, forgot to ask permission to leave. She thought to follow them, then decided not to. Sorry, Skorgen, but don’t worry. We can always outsail a marching army. Those nobles aren’t going anywhere, after all, are they?\u003c/p\u003e\n\u003cp\u003eA short time later, while the sailors argued over who’d won what, the three nachts-who had been lying motionless as if dead-stirred and deftly extricated themselves from the shortsword. One of them kicked the weapon into the river, held its hands over its ears at the soft splash.\u003c/p\u003e\n\u003cp\u003eThe three then exchanged hugs and caresses. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-429.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
