{"id":104550,"no":445,"title":"Page 445","content":"\u003cp\u003e‘All right.’ He set down his cup. ‘Rustleaf tea, Mistress.’\u003c/p\u003e\n\u003cp\u003e‘I’d drown.’\u003c/p\u003e\n\u003cp\u003e‘Not inhaled. Drunk, in civil fashion.’\u003c/p\u003e\n\u003cp\u003e‘You’re still here, dear servant, and I don’t like that at all.’\u003c/p\u003e\n\u003cp\u003eHe rose. ‘On my way, O enwreathed one.’\u003c/p\u003e\n\u003cp\u003eShe had managed to push the corpse of Tanal Yathvanar to one side, and it now lay beside her as if cuddled in sleep, the bloated, blotched face next to her own.\u003c/p\u003e\n\u003cp\u003eThere would be no-one coming for her. This room was forbidden to all but Tanal Yathvanar, and unless some disaster struck this compound in the next day or two, leading Karos Invictad to demand Tanal’s presence and so seek him out, Janath knew it would be too late for her.\u003c/p\u003e\n\u003cp\u003eChained to the bed, legs spread wide, fluids leaking from her. She stared up at the ceiling, strangely comforted by the body lying at her side. Its stillness, the coolness of the skin, the flaccid lack of resistance from the flesh. She could feel the shrivelled thing that was his penis pressing against her right thigh. And the beast within her was pleased.\u003c/p\u003e\n\u003cp\u003eShe needed water. She needed that above all else. A mouthful would be enough, would give her the strength to once again begin tugging at the chains, dragging the links against the wood, dreaming of the entire frame splintering beneath her-but it would take a strong man to do that, she knew, strong and healthy. Her dream was nothing more than that, but she held on to it as her sole amusement that would, she hoped, follow her into death. Yes, right up until the last moment.\u003c/p\u003e\n\u003cp\u003eIt would be enough.\u003c/p\u003e\n\u003cp\u003eTanal Yathvanar, her tormentor, was dead. But that would be no escape from her. She meant to resume her pursuit, her soul-sprung free of this flesh-demonic in its hunger, in the cruelty it wanted to inflict on whatever whimpering, cowering thing was left of Tanal Yathvanar.\u003c/p\u003e\n\u003cp\u003eA mouthful of water. That would be so sweet.\u003c/p\u003e\n\u003cp\u003eShe could spit it into the staring face beside her.\u003c/p\u003e\n\u003cp\u003eCoins to the belligerent multitude brought a larger, more belligerent multitude. And, at last, trepidation awoke in Karos Invictad, the Invigilator of the Patriotists. He sent servants down into the hiddenmost crypts below, to drag up chest after chest. In the compound his agents were exhausted, now simply flinging handfuls of coins over the walls since the small sacks were long gone. And a pressure was building against those walls that, it now seemed, no amount of silver and gold could relieve.\u003c/p\u003e\n\u003cp\u003eHe sat in his office, trying to comprehend that glaring truth. Of course, he told himself, there were simply too many in the mob. Not enough coins was the problem. They’d fought like jackals over the sacks, had they not?\u003c/p\u003e\n\u003cp\u003eHe had done and was doing what the Emperor should have done. Emptied the treasury and buried the people in riches. That would have purchased peace, yes. An end to the riots. Everyone returning to their homes, businesses opening once more, food on the stalls and whores beckoning from windows and plenty of ale and wine to flow down throats-all the pleasures that purchased apathy and obedience. Yes, festivals and games and Drownings and that would have solved all of this. Along with a few quiet arrests and assassinations.\u003c/p\u003e\n\u003cp\u003eBut he was running out of money. His money. Hard-won, a hoard amassed solely by his own genius. And they were taking it all.\u003c/p\u003e\n\u003cp\u003eWell, he would start all over again. Stealing it back from the pathetic bastards. Easy enough for one such as Karos Invictad.\u003c/p\u003e\n\u003cp\u003eTanal Yathvanar had disappeared, likely hiding with his prisoner, and he could rot in her arms for all that the Invigilator cared. Oh, the man schemed to overthrow him, Karos knew. Pathetic, simplistic schemes. But they would come to naught, because the next time Karos saw the man, he would kill him. A knife through the eye. Quick, precise, most satisfying.\u003c/p\u003e\n\u003cp\u003eHe could hear the shouts for Tehol Beddict, somewhat less fierce now-and that was, oddly enough, vaguely disturbing. Did they no longer want to tear him to pieces? Was he indeed hearing cries for the man’s release?\u003c/p\u003e\n\u003cp\u003eDesperate knocking on his office door.\u003c/p\u003e\n\u003cp\u003e‘Enter.’\u003c/p\u003e\n\u003cp\u003eAn agent appeared, his face white. ‘Sir, the main block-’\u003c/p\u003e\n\u003cp\u003e‘Are we breached?’\u003c/p\u003e\n\u003cp\u003e‘No-’\u003c/p\u003e\n\u003cp\u003e‘Then go away-wait, check on Tehol Beddict. Make sure he’s regained consciousness. I want him able to walk when we march to the Drownings.’\u003c/p\u003e\n\u003cp\u003eThe man stared at him for a long moment, then he said, ‘Yes sir.’\u003c/p\u003e\n\u003cp\u003e‘Is that all?’\u003c/p\u003e\n\u003cp\u003e‘No, the main block-’ He gestured out into the corridor.\u003c/p\u003e\n\u003cp\u003e‘What is it, you damned fool?’\u003c/p\u003e\n\u003cp\u003e‘It’s filling with rats, sir!’\u003c/p\u003e\n\u003cp\u003eRats?\u003c/p\u003e\n\u003cp\u003e‘They’re coming from over the walls-we throw coins and rats come back. Thousands!’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-445.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
