{"id":104551,"no":446,"title":"Page 446","content":"\u003cp\u003e‘That guild no longer exists!’\u003c/p\u003e\n\u003cp\u003eThe shriek echoed like a woman’s scream.\u003c/p\u003e\n\u003cp\u003eThe agent blinked, and all at once his tone changed, steadied. ‘The mob, sir, they’re calling for Tehol Beddict’s release-can you not hear it? They’re calling him a hero, a revolutionary-’\u003c/p\u003e\n\u003cp\u003eKaros Invictad slammed his sceptre down on his desk and rose. ‘Is this what my gold paid for?’\u003c/p\u003e\n\u003cp\u003eFeather Witch sensed the rebirth of Brys Beddict. She stopped plucking at the strips of skin hanging from her toes, drawing a deep breath as she felt him rushing closer, ever closer. So fast!\u003c/p\u003e\n\u003cp\u003eCrooning under her breath, she closed her eyes and conjured in her mind that severed finger. That fool the Errant had a lot to learn, still. About his formidable High Priestess. The finger still belonged to her, still held drops of her blood from when she had pushed it up inside her. Month after month, like a waterlogged stick in a stream, soaking her up.\u003c/p\u003e\n\u003cp\u003eBrys Beddict belonged to her, and she would use him well.\u003c/p\u003e\n\u003cp\u003eThe death that was a non-death, for Rhulad Sengar, the insane Emperor. The murder of Hannan Mosag. And the Chancellor. And everyone else she didn’t like.\u003c/p\u003e\n\u003cp\u003eAnd then… the handsome young man kneeling before her as she sat on her raised temple throne-in the new temple that would be built, sanctified to the Errant-kneeling, yes, while she spread her legs and invited him in. To kiss the place where his finger had been. To drive his tongue deep.\u003c/p\u003e\n\u003cp\u003eThe future was so very bright, so very-\u003c/p\u003e\n\u003cp\u003eFeather Witch’s eyes snapped open. Disbelieving.\u003c/p\u003e\n\u003cp\u003eAs she felt Brys Beddict being pulled away, pulled out of her grasp. By some other force.\u003c/p\u003e\n\u003cp\u003ePulled away!\u003c/p\u003e\n\u003cp\u003eShe screamed, lurching forward on the dais, hands plunging into the floodwater-as if to reach down into the current and grasp hold of him once, more-but it was deeper than she’d remembered. Unbalanced, she plunged face-first into the water. Involuntarily drew in a lungful of the cold, biting fluid.\u003c/p\u003e\n\u003cp\u003eEyes staring into the darkness, as she thrashed about, her lungs contracting again and again, new lungfuls of water, one after another.\u003c/p\u003e\n\u003cp\u003eDeep-where was up?\u003c/p\u003e\n\u003cp\u003eA knee scraped the stone floor and she sought to bring her legs under her, but they were numb, heavy as logs-they would not work. One hand then, onto the floor, pushing upward-but not high enough to break the surface. The other hand, then, trying to guide her knees together-but one would drift out as soon as she left it seeking the other.\u003c/p\u003e\n\u003cp\u003eThe darkness outside her eyes flooded in. Into her mind.\u003c/p\u003e\n\u003cp\u003eAnd, with blessed relief, she ceased struggling.\u003c/p\u003e\n\u003cp\u003eShe would dream now. She could feel the sweet lure of that dream-almost within reach-and all the pain in her chest was gone-she could breathe this, she could. In and out, in and out, and then she no longer had to do even that. She could grow still, sinking down onto the slimy floor.\u003c/p\u003e\n\u003cp\u003eDarkness in and out, the dream drifting closer, almost within reach.\u003c/p\u003e\n\u003cp\u003eAlmost…\u003c/p\u003e\n\u003cp\u003eThe Errant stood in the waist-deep water, his hand on her back. He waited, even though her struggles had ceased. Sometimes, it was true, a nudge was not enough.\u003c/p\u003e\n\u003cp\u003eThe malformed, twisted thing that was Hannan Mosag crawled up the last street before the narrow, crooked alley that led to Settle Lake. Roving bands had come upon the wretched Tiste Edur in the darkness before dawn and had given him wide berth, chased away by his laughter.\u003c/p\u003e\n\u003cp\u003eSoon, everything would return to him. All of his power, purest Kurald Emurlahn, and he would heal this mangled body, heal the scars of his mind. With the demon-god freed of the ice and bound to his will once more, who could challenge him?\u003c/p\u003e\n\u003cp\u003eRhulad Sengar could remain Emperor-that hardly mattered, did it? The Warlock King would not be frightened of him, not any more. And, to crush him yet further, he possessed a certain note, a confession-oh, the madness unleashed then!\u003c/p\u003e\n\u003cp\u003eThen, these damned invaders-well, they were about to find themselves without a fleet.\u003c/p\u003e\n\u003cp\u003eAnd the river shall rise, flooding, a torrent to cleanse this accursed city. Of foreigners. Of the Letherii themselves. 1 will see them all drowned.\u003c/p\u003e\n\u003cp\u003eReaching the mouth of the alley, he dragged himself into its gloom, pleased to be out of the dawn’s grey light, and the stench of the pond wafted down to him. Rot, dissolution, the dying of the ice. At long last, all his ambitions were about to come true.\u003c/p\u003e\n\u003cp\u003eCrawling over the slick, mould-slimed cobblestones. He could hear thousands.in the streets, somewhere near. Some name being cried out like a chant. Disgust filled Hannan Mosag. He never wanted anything to do with these Letherii. No, he would have raised an impenetrable wall between them and his people. He would have ruled over the tribes, remaining in the north, where the rain fell like mist and the forests of sacred trees embraced every village. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-446.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
