{"id":104558,"no":453,"title":"Page 453","content":"\u003cp\u003eAll that poured from his wrists flared incandescent. And Icarium walked into the white.\u003c/p\u003e\n\u003cp\u003eTaxilian was thrown back as the liquid fire exploded outward. A moment of surprise, before he was incinerated. The eruption tore into the neighbouring buildings, obliterating them. The street in front of what had once been Scale House became a maelstrom of shattered cobbles, the shards of stone racing outward to stipple walls and punch through shutters. The building opposite tilted back, every brace snapping, then collapsed inward.\u003c/p\u003e\n\u003cp\u003eFleeing the sudden storm, Taralack Veed and Senior Assessor ran-a half-dozen strides before both were thrown from their feet.\u003c/p\u003e\n\u003cp\u003eThe Cabalhii monk, lying on his back, had a momentary vision of a mass of masonry rushing down, and in that moment he burst out laughing-a sound cut short as the tons of rubble crushed him.\u003c/p\u003e\n\u003cp\u003eTaralack Veed had rolled with his tumble, narrowly avoiding that descending wall. Deafened, half blind, he used his hands to drag himself onward, tearing his nails away and lacerating his palms and fingers on the broken cobbles.\u003c/p\u003e\n\u003cp\u003eAnd there, through the dust, the billowing white fire, he saw his village, the huts, the horses in their roped kraal, and there, on the hill beyond, the goats huddled beneath the tree, sheltering from the terrible sun. Dogs lying in the shade, children on their knees playing with the tiny clay figurines that some travelling Malazan scholar had thought to be of great and sacred significance, but were in truth no more than toys, for all children loved toys.\u003c/p\u003e\n\u003cp\u003eWhy, he had had his very own collection and this was long before he killed his woman and her lover, before killing the man’s brother who had proclaimed the feud and had drawn the knife.\u003c/p\u003e\n\u003cp\u003eBut now, all at once, the goats were crying out, crying out in dread pain and terror-dying! The huge tree in flames, branches crashing down.\u003c/p\u003e\n\u003cp\u003eThe huts were burning and bodies sprawled in the dust with faces red with ruin. And this was death, then, death in the breaking of what had always been, solid and predictable, pure and reliable. The breaking-devastation, to take it all away.\u003c/p\u003e\n\u003cp\u003eTaralack Veed screamed, bloodied hands reaching for those toys-those beautiful, so very sacred toys-\u003c/p\u003e\n\u003cp\u003eThe enormous chunk of stone that slanted down took the top of Taralack Veed’s head at an angle, crushing bone and brain, and, as it skidded away, it left a greasy smear of red-and grey-streaked hair.\u003c/p\u003e\n\u003cp\u003eThroughout the city, buildings erupted into clouds of dust. Stone, tile, bricks and wood sailed outward, and white fire poured forth, shafts of argent light arcing out through walls, as if nothing could exist that could impede them. A shimmering, crazed web of light, linking each piece of the machine. And the power flowed, racing in blinding pulses, and they all drew inward, to one place, to one heart.\u003c/p\u003e\n\u003cp\u003eIcarium.\u003c/p\u003e\n\u003cp\u003eThe north and west outer walls detonated as sections of their foundations shifted, moved four, five paces, twisting as if vast pieces of a giant puzzle were being moved into place. Rent, sundered, parts of those walls toppled and the sound of that impact rumbled beneath every street.\u003c/p\u003e\n\u003cp\u003eIn the courtyard of an inn that had, through nefarious schemes, become the property of Rautos Hivanar, a huge piece of metal, bent at right angles, now lifted straight upward to twice the height of the man standing before it. Revealing, at its base, a hinge of white fire.\u003c/p\u003e\n\u003cp\u003eAnd the structure then tilted, dropped forward like a smith’s hammer.\u003c/p\u003e\n\u003cp\u003eRautos Hivanar dived to escape, but not quickly enough, as the massive object slammed down onto the backs of his legs.\u003c/p\u003e\n\u003cp\u003ePinned, as white fire licked out towards him, Rautos could feel his blood draining down from his crushed legs, turning the compound’s dust into mud.\u003c/p\u003e\n\u003cp\u003eYes, he thought, as it began with mud, so it now ends-\u003c/p\u003e\n\u003cp\u003eThe white fire enveloped him.\u003c/p\u003e\n\u003cp\u003eAnd sucked out from his mind every memory he possessed.\u003c/p\u003e\n\u003cp\u003eThe thing that died there a short time later was not Rautos Hivanar.\u003c/p\u003e\n\u003cp\u003eThe vast web’s pulsing lasted but a half-dozen heartbeats. The shifting of the pieces of the machine, with all the destruction that entailed, was even more short-lived. Yet, in that time, all who were devoured by the white fire emptied their lives into it. Every memory, from the pain of birth to the last moment of death.\u003c/p\u003e\n\u003cp\u003eThe machine, alas, was indeed broken.\u003c/p\u003e\n\u003cp\u003eAs the echoes of groaning stone and metal slowly faded, the web flickered, then vanished. And now, dust warred with the smoke in the air above Letheras.\u003c/p\u003e\n\u003cp\u003eA few remaining sections of stone and brick toppled, but these were but modest adjustments in the aftermath of what had gone before.\u003c/p\u003e\n\u003cp\u003eAnd in this time of settling, the first voices of pain, the first cries for help, lifted weakly from heaps of rubble.\u003c/p\u003e\n\u003cp\u003eThe ruins of Scale House were naught but white dust, and from it nothing stirred. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-453.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
