{"id":104564,"no":459,"title":"Page 459","content":"\u003cp\u003eThere was a gate, closed, but no guards in sight. Damned strange. Where is everyone?\u003c/p\u003e\n\u003cp\u003eHe returned to where his soldiers waited, catching their breaths in the centre of the flat rooftop. ‘All right,’ he said, setting down his crossbow and opening his satchel, ‘there’s a gate that I can take out with a cusser from here. Then down we go and straight across and straight in, fast and mean. Kill everyone in sight, understood?’ He drew out his cusser quarrel and carefully loaded the crossbow. Then resumed his instructions. ‘Tarr takes up the rear crossing the street. Bottle, keep everything you got right at hand-’\u003c/p\u003e\n\u003cp\u003e‘Sergeant-’\u003c/p\u003e\n\u003cp\u003e‘Not now, Corabb. Listen! We’re heading for the throne room. I want Cuttle out front-’\u003c/p\u003e\n\u003cp\u003e‘Sergeant-’\u003c/p\u003e\n\u003cp\u003e‘-with sharpers in hand. Koryk, you’re next-’\u003c/p\u003e\n\u003cp\u003e‘Sergeant-’\u003c/p\u003e\n\u003cp\u003e‘What in Hood’s name is it, Corabb?’\u003c/p\u003e\n\u003cp\u003eThe man was pointing. Northward.\u003c/p\u003e\n\u003cp\u003eFiddler and the others all turned.\u003c/p\u003e\n\u003cp\u003eTo see an enormous white dragon bearing down on them.\u003c/p\u003e\n\u003cp\u003eAn infrequent scattering of cut-down Letherii soldiers and small fires left behind by munitions had provided enough of a trail for Quick Ben and Hedge, and they were now crouched at the foot of a door to a burnt-out building.\u003c/p\u003e\n\u003cp\u003e‘Listen,’ Hedge was insisting, ‘the roof here’s right opposite the gate. I know Fid and I’m telling you, he’s on that Hood-damned roof!’\u003c/p\u003e\n\u003cp\u003e‘Fine, fine, lead on, sapper.’ Quick Ben shook his head. Something… I don’t know…\u003c/p\u003e\n\u003cp\u003eThey plunged inside. The stench of smoke was acrid, biting. Charred wreckage lay all about, the detritus of a ruined empire.\u003c/p\u003e\n\u003cp\u003e‘There,’ Hedge said, then headed on into a corridor, down to a set of stairs leading upward.\u003c/p\u003e\n\u003cp\u003eSomething…oh, gods!\u003c/p\u003e\n\u003cp\u003e‘Move it!’ Quick Ben snarled, shoving the sapper forward.\u003c/p\u003e\n\u003cp\u003e‘What-’\u003c/p\u003e\n\u003cp\u003e‘Hurry!’\u003c/p\u003e\n\u003cp\u003eThe huge dragon angled down, straight for them.\u003c/p\u003e\n\u003cp\u003eFiddler stared for a moment longer, seeing the beast opening its mouth, knowing what was coming, then he raised his crossbow and fired.\u003c/p\u003e\n\u003cp\u003eThe bolt shot upward.\u003c/p\u003e\n\u003cp\u003eA hind limb of the dragon snapped out to bat the quarrel aside.\u003c/p\u003e\n\u003cp\u003eAnd the cusser detonated.\u003c/p\u003e\n\u003cp\u003eThe explosion flattened the marines on the rooftop, sent Fiddler tumbling backward.\u003c/p\u003e\n\u003cp\u003eThe roof itself sagged beneath them with grinding, crunching sounds.\u003c/p\u003e\n\u003cp\u003eFiddler caught a glimpse of the dragon, streaming blood, its chest torn open, sliding off to one side, heading towards the street below, shredded wings flailing like sails in a storm.\u003c/p\u003e\n\u003cp\u003eA second bolt flew out to intercept it.\u003c/p\u003e\n\u003cp\u003eAnother explosion, sending the dragon lurching back, down, into a building, which suddenly folded inward on that side, then collapsed with a deafening roar.\u003c/p\u003e\n\u003cp\u003eFiddler twisted round-\u003c/p\u003e\n\u003cp\u003e– and saw Hedge.\u003c/p\u003e\n\u003cp\u003e– and Quick Ben, who was running towards the roof’s edge, his hands raised and sorcery building round him as if he was the prow of a ship cutting through water.\u003c/p\u003e\n\u003cp\u003eFiddler leapt to his feet and followed the wizard.\u003c/p\u003e\n\u003cp\u003eFrom the wreckage of the building beside the Eternal Domicile, the dragon was pulling itself free. Lacerated, bones jutting and blood leaking from terrible wounds. And then, impossibly, it rose skyward once more, rent wings flapping-but Fiddler knew that it was sorcery that was lifting the creature back into the air.\u003c/p\u003e\n\u003cp\u003eAs it cleared the collapsed building, Quick Ben unleashed his magic. A wave of crackling fire crashed into the dragon, sent it reeling back.\u003c/p\u003e\n\u003cp\u003eAnother.\u003c/p\u003e\n\u003cp\u003eAnd then another-the dragon was now two streets away, writhing under the burgeoning assault.\u003c/p\u003e\n\u003cp\u003eThen, with a piercing cry, it wheeled, climbed higher, and flew away, in full retreat.\u003c/p\u003e\n\u003cp\u003eQuick Ben lowered his arms, then fell to his knees.\u003c/p\u003e\n\u003cp\u003eStaring after the fast-diminishing dragon, Fiddler leaned his crossbow onto his shoulder.\u003c/p\u003e\n\u003cp\u003e‘This ain’t your fight,’ he said to the distant creature. ‘Fucking dragon.’\u003c/p\u003e\n\u003cp\u003eThen he turned and stared at Hedge.\u003c/p\u003e\n\u003cp\u003eWho, grinning, stared back.\u003c/p\u003e\n\u003cp\u003e‘No ghost?’\u003c/p\u003e\n\u003cp\u003e‘No ghost. Aye, Fid, I’m back.’\u003c/p\u003e\n\u003cp\u003eFiddler scowled, then shook his head. ‘Hood help us all.’ Then he turned to Quick Ben. ‘And where in the Abyss have you been?’\u003c/p\u003e\n\u003cp\u003ePicking himself up from the buckled rooftop, Bottle stared across at those three soldiers. Didn’t know one of them except that he was a sapper. And a damned Bridgeburner.\u003c/p\u003e\n\u003cp\u003eBeside him, Koryk groaned, then spat. ‘Look at ‘em,’ he said.\u003c/p\u003e\n\u003cp\u003eBottle nodded.\u003c/p\u003e\n\u003cp\u003eAnd, oddly enough, for all the soldiers in the squad, nothing more about it needed saying. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-459.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
