{"id":104164,"no":46,"title":"Page 46","content":"\u003cp\u003e‘We ride against the Letherii? War Leader, did you not moments ago mock the notion of seven warriors waging war against them? Yet now you say-’\u003c/p\u003e\n\u003cp\u003e‘War is for later,’ Redmask said. ‘As you say, we need herds. To buy the services of the warriors.’ He paused and looked back at the trailing youth. ‘Where did the Letherii get their beasts?’\u003c/p\u003e\n\u003cp\u003e‘From the Awl! From us!’\u003c/p\u003e\n\u003cp\u003e‘Yes. They stole them. So we must steal them back.’\u003c/p\u003e\n\u003cp\u003e‘Four of us, War Leader?’\u003c/p\u003e\n\u003cp\u003e‘And one dray, and my guardians.’\u003c/p\u003e\n\u003cp\u003e‘What guardians?’\u003c/p\u003e\n\u003cp\u003eRedmask resumed his journey. ‘You lack respect, Masarch. Tonight, I think, you will have your death night.’\u003c/p\u003e\n\u003cp\u003e‘The old ways are useless! I will not!’\u003c/p\u003e\n\u003cp\u003eRedmask’s fist was a blur-it was questionable whether, in the gloom, Masarch even saw it-even as it connected solidly with the youth’s jaw, dropping him in his tracks. Redmask reached down and grabbed a handful of hide jerkin, then began dragging the unconscious Masarch back down to the camp.\u003c/p\u003e\n\u003cp\u003eWhen the young man awoke, he would find himself in a coffin, beneath an arm’s reach of earth and stones. None of the usual traditional, measured rituals prior to a death night, alas, the kind that served to prepare the chosen for internment. Of course, Masarch’s loose reins displayed an;ippalling absence of respect, sufficient to obviate the gift of mercy, which in truth was what all those rituals were about.\u003c/p\u003e\n\u003cp\u003eHard lessons, then. But becoming an adult depended on such lessons.\u003c/p\u003e\n\u003cp\u003eHe expected he would have to pound the others into submission as well, which made for a long night ahead.\u003c/p\u003e\n\u003cp\u003eFor us all.\u003c/p\u003e\n\u003cp\u003eThe camp’s old women would be pleased by the ruckus, he suspected. Preferable to wailing through the night, in any case.\u003c/p\u003e\n\u003cp\u003eThe last tier of the buried city proved the most interesting, as far as Udinaas was concerned. He’d had his fill of the damned sniping that seemed to plague this fell party of fugitives, a testiness that seemed to be getting worse, especially from Fear Sengar. The ex-slave knew that the Tiste Edur wanted to murder him, and as for the details surrounding the abandonment of Rhulad-which made it clear that Udinaas himself had had no choice in the matter, that he had been as much a victim as Fear’s own brother-well, Fear wasn’t interested. Mitigating circumstances did not alter his intransigence, his harsh sense of right and wrong which did not, it appeared, extend to his own actions-after all, Fear had been the one to deliberately walk away from Rhulad.\u003c/p\u003e\n\u003cp\u003eUdinaas, upon regaining consciousness, should have returned to the Emperor.\u003c/p\u003e\n\u003cp\u003eTo do what? Suffer a grisly death at Rhulad’s hands? Yes, we were almost friends, he and I-as much as might be possible between slave and master, and of that the master ever feels more generous and virtuous than the slave-but I did not ask to be there, at the madman’s side, struggling to guide him across that narrow bridge of sanity, when all Rhulad wanted to do was leap head-first over the side at every step. No, he had made do with what he had, and in showing that mere splinter of sympathy, he had done more for Rhulad than any of the Sengars-brothers, mother, father. More indeed than any Tiste Edur. Is it any wonder none of you know happiness, Fear Sengar? You are all twisted branches from the same sick tree.\u003c/p\u003e\n\u003cp\u003eThere was no point in arguing this, of course. Seren Pedac alone might understand, might even agree with all that Udinaas had to say, but she wasn’t interested in actually being one of this party. She clung to the role of Acquitor, a finder of trails, the reader of all those jealously guarded maps in her head. She liked not having to choose; better still, she liked not having to care.\u003c/p\u003e\n\u003cp\u003eA strange woman, the Acquitor. Habitually remote. Without friends… yet she carries a Tiste Edur sword. Trull Sengar’s sword. Kettle says he set it into her hands. Did she under’ stand the significance of that gesture? She must have. Trull Sengar had then returned to Rhulad. Perhaps the only brother who’d actually cared-where was he now? Probably dead.\u003c/p\u003e\n\u003cp\u003eFresh, night-cooled air flowed down the broad ramp, moaned in the doorways situated every ten paces or so to either side. They were nearing the surface, somewhere in the saddleback pass-but on which side of the fort and its garrison? If the wrong side, then Silchas Ruin’s swords would keen loud and long. The dead piled up in the wake of that walking white-skinned, red-eyed nightmare, didn’t they just. The few times the hunters caught up with the hunted, they paid with their lives, yet they kept coming, and that made little sense.\u003c/p\u003e\n\u003cp\u003eAlmost as ridiculous as this mosaic floor with its glowing armies. Images of lizard warriors locked in war, long-tails against short-tails, with the long-tails doing most of the dying, as far as he could tell. The bizarre slaughter beneath their feet spilled out into the adjoining rooms, each one, it seemed, devoted to the heroic death of some champion-Fouled K’ell, Naw’rhuk Adat and Matrons, said Silchas Ruin as, enwreathed in sorcerous light, he explored each such side chamber, his interest desultory and cursory at best. In any case, Udinaas could read enough into the colourful scenes to recognize a campaign of mutual annihilation, with every scene of short-tail victory answered with a Matron’s sorcerous conflagration. The winners never won because the losers refused to lose. An insane war. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-46.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
