{"id":104567,"no":462,"title":"Page 462","content":"\u003cp\u003eTehol refuted that with the brightest smile, and it transformed him, and suddenly Lostara forgot all about the man’s martial-looking brother.\u003c/p\u003e\n\u003cp\u003eSpirits of the sand, those eyes…\u003c/p\u003e\n\u003cp\u003e‘I do apologize, Commander. I admit I have been somewhat taken aback.’\u003c/p\u003e\n\u003cp\u003eThe Adjunct slowly nodded. ‘By this popular acclaim, yes, I imagine-’\u003c/p\u003e\n\u003cp\u003e‘No, not that. She said I was not half bad in bed. I am crushed by the other half, the “half good” bit-’\u003c/p\u003e\n\u003cp\u003e‘Oh, Tehol,’ the fat woman said, ‘I was being modest for your sake.’\u003c/p\u003e\n\u003cp\u003e‘Modesty from you, Rucket? You don’t know the meaning of the word! I mean, I just look at you and it’s hard not to, if you know what I mean.’\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003e‘Anyway!’ Tehol clapped his hands together. ‘We’ve had the fireworks, now let’s get this parade started!’\u003c/p\u003e\n\u003cp\u003eSirryn Kanar ran down the corridor, away from the fighting. The damned foreigners were in the Eternal Domicile, delivering slaughter-no calls for surrender, no demands to throw down weapons. Just those deadly quarrels, those chopping shortswords and those devastating grenados. His fellow guards were dying by the score, their blood splashing the once pristine walls.\u003c/p\u003e\n\u003cp\u003eAnd Sirryn vowed he was not going to suffer the same fate.\u003c/p\u003e\n\u003cp\u003eThey wouldn’t kill the Chancellor. They needed him, and besides, he was an old man. Obviously unarmed, a peaceful man. Civilized. And the guard they’d find standing at his side, well, even he carried naught but a knife at his belt. No sword, no shield, no helm or even armour.\u003c/p\u003e\n\u003cp\u003eI can stay alive there, right at the Chancellor’s side.\u003c/p\u003e\n\u003cp\u003eBut where is he?\u003c/p\u003e\n\u003cp\u003eThe throne room had been empty.\u003c/p\u003e\n\u003cp\u003eThe Emperor is in the arena. The mad fool is still fighting his pointless, pathetic fights. And the Chancellor would be there, attending, ironic witness to the last Tiste Edur’s drooling stupidity. The last Tiste Edur in the city. Yes.\u003c/p\u003e\n\u003cp\u003eHe hurried on, leaving the sounds of fighting well behind him.\u003c/p\u003e\n\u003cp\u003eA day of madness-would it never end?\u003c/p\u003e\n\u003cp\u003eChancellor Triban Gnol stepped back. The realization had come suddenly to him, with the force of a hammer blow. Rhulad Sengar will not return. The Emperor of a Thousand Deaths… has died his last death.\u003c/p\u003e\n\u003cp\u003eToblakai. Karsa Orhng, I do not know what you have done, I do not know how-but you have cleared the path.\u003c/p\u003e\n\u003cp\u003eYou have cleared it and for that I bless you.\u003c/p\u003e\n\u003cp\u003eHe looked about, and saw that the meagre audience had fled-yes, the Eternal Domicile was breached, the enemy was within. He turned to the Finadd standing nearby. ‘Varat Taun.’\u003c/p\u003e\n\u003cp\u003e‘Sir?’\u003c/p\u003e\n\u003cp\u003e‘We are done here. Gather your soldiers and escort me to the throne room, where we will await the conquerors.’\u003c/p\u003e\n\u003cp\u003e‘Yes sir.’\u003c/p\u003e\n\u003cp\u003e‘And we bring that witch with us-I would know what has happened here. I would know why she laid open her hand with that knife. I would know everything.’\u003c/p\u003e\n\u003cp\u003e‘Yes, Chancellor.’\u003c/p\u003e\n\u003cp\u003eThe captain was surprisingly gentle taking the pale woman into his custody, and indeed, he seemed to whisper something to her that elicited a weary nod. Triban Gnol’s eyes narrowed. No, he did not trust this new Finadd. Would that he had Sirryn with him.\u003c/p\u003e\n\u003cp\u003eAs they made their way from the arena, the Chancellor paused for one look back, one last look at the pathetic figure lying on the bloody sand. Dead. He is truly dead.\u003c/p\u003e\n\u003cp\u003eI believe I always knew Karsa Orhng would be the one. Yes, I believe I did.\u003c/p\u003e\n\u003cp\u003eHe was almost tempted to head back, down onto the arena floor, to walk across the pitch and stand over the body of Rhulad Sengar. And spit into the Emperor’s face.\u003c/p\u003e\n\u003cp\u003eNo time. Such pleasure will have to wait.\u003c/p\u003e\n\u003cp\u003eBut I vow I will do it yet.\u003c/p\u003e\n\u003cp\u003eCuttle waved them to the intersection. Fiddler led the rest of his squad to join the sapper.\u003c/p\u003e\n\u003cp\u003e‘This is the main approach,’ Cuttle said. ‘It’s got to be.’\u003c/p\u003e\n\u003cp\u003eFiddler nodded. The corridor was ornately decorated, impressively wide, with an arched ceiling gleaming with gold leaf. There was no-one about. ‘So where are the guards, and in which direction is the throne room?’\u003c/p\u003e\n\u003cp\u003e‘No idea,’ Cuttle replied. ‘But I’d guess we go left.’\u003c/p\u003e\n\u003cp\u003e‘Why?’\u003c/p\u003e\n\u003cp\u003e‘No reason, except everyone who tried to get away from us was more or less heading that way.’\u003c/p\u003e\n\u003cp\u003e‘Good point, unless they were all headed out the back door.’ Fiddler wiped sweat from his eyes. Oh, this had been a nasty bloodletting, but he’d let his soldiers go, despite the disapproving looks from Quick Ben. Damned High Mage and his nose in the air-and where in Hood’s name did all that magic come from? Quick had never showed anything like that before. Not even close. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-462.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
