{"id":104568,"no":463,"title":"Page 463","content":"\u003cp\u003eHe looked across at Hedge.\u003c/p\u003e\n\u003cp\u003eSame old Hedge. No older than the last time Fiddler had seen him. Gods, it doesn’t feel real. He’s back. Living, breathing, farting… He reached out and cuffed the man in the side of the head.\u003c/p\u003e\n\u003cp\u003e‘Hey, what’s that for?’\u003c/p\u003e\n\u003cp\u003e‘No reason, but I’m sure I was owed doing that at least once.’\u003c/p\u003e\n\u003cp\u003e‘Who saved your skin in the desert? And under the city?’\u003c/p\u003e\n\u003cp\u003e‘Some ghost up to no good,’ Fiddler replied.\u003c/p\u003e\n\u003cp\u003e‘Hood, that white beard makes you look ancient, Fid, you know that?’\u003c/p\u003e\n\u003cp\u003eOh, be quiet.\u003c/p\u003e\n\u003cp\u003e‘Crossbows loaded, everyone? Good. Lead on, Cuttle, but slow and careful, right?’\u003c/p\u003e\n\u003cp\u003eThey were five paces into the corridor when a side entrance ahead and to their right was suddenly filled with figures. And mayhem was let loose once more.\u003c/p\u003e\n\u003cp\u003eTarr saw the old man first, the one in the lead, or even if he didn’t see him first, he got off his shot before anyone else. And the quarrel sank into the side of the man’s head, dead in the centre of his left temple. And everything sprayed out the other side.\u003c/p\u003e\n\u003cp\u003eOther quarrels caught him, at least two, spinning his scrawny but nice-robed body round before it toppled.\u003c/p\u003e\n\u003cp\u003eA handful of guards who had been accompanying the old man reeled back, at least two stuck good, and Tarr was already rushing forward, drawing his shortsword and bringing his shield round. He bumped hard against Corabb who was doing the same and swore as the man got in front of him.\u003c/p\u003e\n\u003cp\u003eTarr raised his sword, a sudden, overwhelming urge to hammer the blade down on the bastard’s head-but no, save that for the enemy-\u003c/p\u003e\n\u003cp\u003eWho were throwing down their weapons as they backed down the corridor.\u003c/p\u003e\n\u003cp\u003e‘For Hood’s sake!’ Quick Ben shouted, dragging at Tarr to get past, then shoving Corabb to one side. ‘They’re surrendering, damn you! Stop slaughtering everyone!’\u003c/p\u003e\n\u003cp\u003eAnd from the Letherii group, a woman’s voice called out in Malazan, ‘We surrender! Don’t kill us!’\u003c/p\u003e\n\u003cp\u003eThat voice was enough to draw everyone up.\u003c/p\u003e\n\u003cp\u003eTarr swung round, as did the others, to look at Fiddler.\u003c/p\u003e\n\u003cp\u003eAfter a moment, the sergeant nodded. ‘Take ‘em prisoner, then. They can lead us to the damned throne room.’\u003c/p\u003e\n\u003cp\u003eSmiles ran up to the body of the old man and started pulling at all his gaudy rings.\u003c/p\u003e\n\u003cp\u003eA Letherii officer stepped forward, hands raised. ‘There’s no-one in the throne room,’ he said. ‘The Emperor is dead-his body’s in the arena-’\u003c/p\u003e\n\u003cp\u003e‘Take us there, then,’ Quick Ben demanded, with a glare at Fiddler. ‘I want to see for myself.’\u003c/p\u003e\n\u003cp\u003eThe officer nodded. ‘We just came from there, but very well’\u003c/p\u003e\n\u003cp\u003eFiddler waved his squad forward, then scowled over at Smiles. ‘Do that later, soldier-’\u003c/p\u003e\n\u003cp\u003eShe bared her teeth like a dog over a kill, then drew out a large knife and, with two savage chops, took the old man’s pretty hands.\u003c/p\u003e\n\u003cp\u003eTrull Sengar stepped out onto the sand of the arena, eyes fixed on the body lying near the far end. The gleam of coins, the head tilted back. He slowly walked forward.\u003c/p\u003e\n\u003cp\u003eThere was chaos in the corridors and chambers of the Eternal Palace. He could search for his parents later, but he suspected he would not find them. They had gone with the rest of the Tiste Edur. Back north. Back to their homeland. And so, in the end, they too had abandoned Rhulad, their youngest son.\u003c/p\u003e\n\u003cp\u003eWhy does he lie unmoving? Why has he not returned?\u003c/p\u003e\n\u003cp\u003eHe came to Rhulad’s side and fell to his knees. Set down his spear. A missing arm, a missing sword.\u003c/p\u003e\n\u003cp\u003eHe reached out and lifted his brother’s head. Heavy, the face so scarred, so twisted with pain that it was hardly recognizable. He settled it into his lap.\u003c/p\u003e\n\u003cp\u003eTwice now, 1 am made to do this. With a brother whose face, there below me, rests too still. Too emptied of life. They look so… wrong.\u003c/p\u003e\n\u003cp\u003eHe would have tried, one last time, a final offering of reason to his young brother, an appeal to all that he had once been. Before all this. Before, in foolish but understandable zeal, he had grasped hold of a sword on a field of ice.\u003c/p\u003e\n\u003cp\u003eRhulad would then, in another moment of weakness, pronounce Trull Shorn. Dead in the eyes of all Tiste Edur. And chain him to stone to await a slow, wasting death. Or the rise of water.\u003c/p\u003e\n\u003cp\u003eTrull had come, yes, to forgive him. It was the cry in his heart, a cry he had lived with for what seemed for ever. You were wounded, brother. So wounded. He had cut you down, laid you low but not dead. He had done what he needed to do, to end your nightmare. But you did not see it that way. You could not.\u003c/p\u003e\n\u003cp\u003eInstead, you saw your brothers abandon you.\u003c/p\u003e\n\u003cp\u003eSo now, my brother, as I forgive you, will you now forgive me? \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-463.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
