{"id":104206,"no":92,"title":"Page 92","content":"\u003cp\u003eRhulad looked ready to weep. ‘Treason among the Edur? My Edur? No, this cannot be-has he proof?’\u003c/p\u003e\n\u003cp\u003eA faint shrug. ‘Highness, I doubt he would have ventured this inquiry had he not inadvertently stumbled on some… sensitive information.’\u003c/p\u003e\n\u003cp\u003e‘Go away. Get out. Get out!’\u003c/p\u003e\n\u003cp\u003eTriban Gnol bowed, then backed from the chamber. Perhaps he’d gone too far, yet the seed had been planted. In most fertile soil.\u003c/p\u003e\n\u003cp\u003eAs soon as the outer doors closed, Nisall stepped from the alcove. Rhulad waved her closer.\u003c/p\u003e\n\u003cp\u003e‘My love,’ he whispered in a child’s voice, ‘what am I to do? The demon-they brought it here.’\u003c/p\u003e\n\u003cp\u003e‘You cannot be defeated, Emperor.’\u003c/p\u003e\n\u003cp\u003eAnd to destroy it, how many times must I die? No, I’m not ready. Binadas was a powerful sorcerer, rival to the Warlock King himself. My brother…’\u003c/p\u003e\n\u003cp\u003e‘It may be,’ Nisall ventured, ‘that the Chancellor erred in the details of that. It may indeed be that Tomad’s dream was a deceitful sending-there are many gods and spirits out there who see the Crippled God as an enemy.’\u003c/p\u003e\n\u003cp\u003e‘No more. I am cursed into confusion; I don’t understand any of this. What is happening, Nisall?’\u003c/p\u003e\n\u003cp\u003e‘Palace ambitions, beloved. The return of the fleets has stirred things up.’\u003c/p\u003e\n\u003cp\u003e‘My own Edur… plotting treason…’\u003c/p\u003e\n\u003cp\u003eShe reached out and set a hand on his left shoulder. The lightest of touches, momentary, then withdrawn once more. Dare I? ‘Karos Invictad is perhaps the most ambitious of them all. He revels in his reign of terror among the Letherii, and would expand it to include the Tiste Edur. Highness, I am Letherii-I know men like the Invigilator, I know what drives them, what feeds their malign souls. He hungers for control, for his heart quails in fear at all that is outside his control-at chaos itself. In his world, he is assailed on all sides. Highness, Karos Invictad’s ideal world is one surrounded by a sea of corpses, every unknown and unknowable obliterated. And even then, he will find no peace.’\u003c/p\u003e\n\u003cp\u003e‘Perhaps he should face me in the arena,’ Rhulad said, with a sudden vicious smile. ‘Face to face with a child of chaos, yes? But no, I need him to hunt down his Letherii. The traitors.’\u003c/p\u003e\n\u003cp\u003e‘And shall this Letherii be granted domination over Tiste Edur as well?’\u003c/p\u003e\n\u003cp\u003e‘Treason is colourless,’ Rhulad said, shifting uneasily on the throne once more. ‘It flows unseen no matter the hue of blood. I have not decided on that. I need to think, to understand. Perhaps I should summon the Chancellor once again.’\u003c/p\u003e\n\u003cp\u003e‘Highness, you once appointed an Edur to oversee the Patriotists. Do you recall?’\u003c/p\u003e\n\u003cp\u003e‘Of course I do. Do you think me an idiot, woman?’\u003c/p\u003e\n\u003cp\u003e‘Perhaps Bruthen Trana-’\u003c/p\u003e\n\u003cp\u003e‘Yes, that’s him. Not once has he reported to me. Has he done as I commanded? How do I even know?’\u003c/p\u003e\n\u003cp\u003e‘Summon him, then, Highness.’\u003c/p\u003e\n\u003cp\u003e‘Why does he hide from me? Unless he conspires with the other traitors.’\u003c/p\u003e\n\u003cp\u003e‘Highness, I know for a truth that he seeks an audience with you almost daily.’\u003c/p\u003e\n\u003cp\u003e‘You?’ Rhulad glanced over at her, eyes narrowing. ‘How?’\u003c/p\u003e\n\u003cp\u003e‘Bruthen Trana sought me out, beseeching me to speak to you on his behalf. The Chancellor denies him an audience with you-’\u003c/p\u003e\n\u003cp\u003eTriban Gnol cannot deny such things! He is a Letherii! Where are my Edur? Why do I never see them? And now Tomad has returned, and Hanradi Khalag! None of them will speak to me!’\u003c/p\u003e\n\u003cp\u003e‘Highness, Tomad waits in the outer chamber-’\u003c/p\u003e\n\u003cp\u003e‘He knew I would deny him. You are confusing me, whore. I don’t need you-I don’t need anyone! I just need time. To think. That is all. They’re all frightened of me, and with good reason, oh yes. Traitors are always frightened, and when their schemes are discovered, oh how they plead for their lives! Perhaps I should kill everyone-a sea of corpses, then there would be peace. And that is all I want. Peace. Tell me, are the people happy, Nisall?’\u003c/p\u003e\n\u003cp\u003eShe bowed her head. ‘I do not know, Highness.’\u003c/p\u003e\n\u003cp\u003e‘Are you? Are you happy with me?’\u003c/p\u003e\n\u003cp\u003e‘I feel naught but love for you, Emperor. My heart is yours.’\u003c/p\u003e\n\u003cp\u003e‘The same words you spoke to Diskanar, no doubt. And all the other men you’ve bedded. Have your slaves draw a bath-you stink of sweat, woman. Then await me beneath silks.’ He raised his voice. ‘Call the Chancellor! We wish to speak to him immediately! Go, Nisall, your Letherii stink makes me ill.’\u003c/p\u003e\n\u003cp\u003eAs she backed away Rhulad raised his free hand. ‘My dearest, the golden silks-you are like a pearl among those. The sweetest pearl…’ \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-92.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
