{"id":104211,"no":97,"title":"Page 97","content":"\u003cp\u003eAh well, sailors have simple minds, friend. And pirates are failed sailors, mostly, taking simpledom to profound extremes-’\u003c/p\u003e\n\u003cp\u003e‘What? I have news, you know.’\u003c/p\u003e\n\u003cp\u003e‘Do you now?’\u003c/p\u003e\n\u003cp\u003e‘I do.’\u003c/p\u003e\n\u003cp\u003e‘Can I hear it?’\u003c/p\u003e\n\u003cp\u003e‘Do you want to?’\u003c/p\u003e\n\u003cp\u003e‘Why yes, else I would not have asked.’\u003c/p\u003e\n\u003cp\u003e‘Really want to?’\u003c/p\u003e\n\u003cp\u003e‘Look, if you’re not interested in telling me-’\u003c/p\u003e\n\u003cp\u003e‘No, I’m interested. In telling you. That is why I’m here, although I will have some of that soup if you’re offering.’\u003c/p\u003e\n\u003cp\u003e‘Ublala Pung, you are most welcome to this soup, but first let me fish out this rag I fed into the broth, lest you choke or something.’\u003c/p\u003e\n\u003cp\u003e‘Rag? What kind of rag?’\u003c/p\u003e\n\u003cp\u003e‘Well, squarish, mostly. I believe it was used to wipe down a kitchen counter, thereby absorbing countless assorted foodstuffs.’\u003c/p\u003e\n\u003cp\u003e‘Tehol Beddict, one of the pure blood has come to the city.’\u003c/p\u003e\n\u003cp\u003e‘Is that your news?’\u003c/p\u003e\n\u003cp\u003eThe huge man nodded solemnly.\u003c/p\u003e\n\u003cp\u003e‘Pure blood?’\u003c/p\u003e\n\u003cp\u003eAnother nod.\u003c/p\u003e\n\u003cp\u003e‘So, a Tarthenal-’\u003c/p\u003e\n\u003cp\u003e‘No,’ Ublala Pung cut in. ‘Pure blood. Purer than any Tarthenal. And he carries a stone sword. On his face are the most terrifying tattoos, like a shattered tile. He is greatly scarred and countless ghosts swirl in his wake-’\u003c/p\u003e\n\u003cp\u003e‘Ghosts? You could see ghosts following him around?’\u003c/p\u003e\n\u003cp\u003e‘See them? Of course not. But I smelled them.’\u003c/p\u003e\n\u003cp\u003e‘Really? So what do ghosts smell like? Never mind. A Tarthenal who’s more Tarthenal than any Tarthenal has arrived in the city. What does he want?’\u003c/p\u003e\n\u003cp\u003e‘You do not understand, Tehol Beddict. He is a champion. He is here to challenge the Emperor.’\u003c/p\u003e\n\u003cp\u003e‘Oh, the poor man.’\u003c/p\u003e\n\u003cp\u003e‘Yes. The poor man, but he’s not a man, is he? He’s a Tiste Edur.’\u003c/p\u003e\n\u003cp\u003eTehol Beddict frowned across at Ublala Pung. ‘Ah, we were speaking of two different poor men. Well, a short time earlier a runner from Rucket visited-it seems Scale House collapsed during that earthquake. But it was not your normal earthquake, such as never occurs around here anyway. Ublala Pung, there is another champion, one far more frightening than any pure blood Tarthenal. There is great consternation among the Rat Catchers, all of whom seem to know more than they’re letting on. The view seems to be that this time the Emperor’s search has drawn in a most deadly haul.’\u003c/p\u003e\n\u003cp\u003e‘Well, I don’t know nothing about that,’ Ublala Pung said, rubbing thoughtfully at the bristle on his chin. ‘Only, this pure blood has a stone sword. Chipped, like those old spear-points people are selling in the Downs Market. It’s almost as tall as he is, and he’s taller than me. I saw him pick up a Letherii guard and throw him away.’\u003c/p\u003e\n\u003cp\u003e‘Throw him away?’\u003c/p\u003e\n\u003cp\u003e‘Like a small sack of… of mushrooms or something.’\u003c/p\u003e\n\u003cp\u003e‘So his temper is even worse than yours, then.’\u003c/p\u003e\n\u003cp\u003e‘Pure bloods know no fear.’\u003c/p\u003e\n\u003cp\u003e‘Right. So how is it you know about pure bloods?’\u003c/p\u003e\n\u003cp\u003e‘The Sereghal. Our gods, the ones I helped to kill, they were fallen pure bloods. Cast out.’\u003c/p\u003e\n\u003cp\u003e‘So the one who has just arrived, he’s the equivalent of one of your gods, Ublala Pung? Please, don’t tell me you’re planning on trying to kill him. I mean, he has a stone sword and all’\u003c/p\u003e\n\u003cp\u003e‘Kill him? No, you don’t understand, Tehol Beddict. This one, this pure blood, he is worthy of true worship. Not the way we appeased the Sereghal-that was to keep them away. Wait and see, wait and see what is going to happen. My kin will gather, once the word spreads. They will gather.’\u003c/p\u003e\n\u003cp\u003e‘What if the Emperor kills him?’\u003c/p\u003e\n\u003cp\u003eUblala Pung simply shook his head.\u003c/p\u003e\n\u003cp\u003eThey both looked over as Bugg appeared in the doorway, in his arms the body of a naked woman.\u003c/p\u003e\n\u003cp\u003e‘Now really,’ Tehol said, ‘the pot’s not nearly big enough. Besides, hungry as I am, there are limits and eating academics far exceeds them-’\u003c/p\u003e\n\u003cp\u003eThe manservant frowned. ‘You recognize this woman?’\u003c/p\u003e\n\u003cp\u003e‘I do, from my former life, replete as it was with stern tutors and the occasional subjects of youthful crushes and the like. Alas, she looks much worse for wear. I had always heard that the world of scholars was cut-throat-what debate on nuances resulted in this, I wonder?’\u003c/p\u003e\n\u003cp\u003eBugg carried her over and set her down on his own sleeping pallet.\u003c/p\u003e\n\u003cp\u003eAs the manservant stepped back, Ublala Pung stepped close and struck Bugg in the side of the head, hard enough to send the old man reeling against a wall. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-97.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
