{"id":104213,"no":99,"title":"Page 99","content":"\u003cp\u003eHe could hear voices from somewhere just beyond the longhouse. Panek, Aystar and the other surviving children-well, hardly children any more. They’d seen battle, they’d seen their friends die, they knew the world-every world-was an unpleasant place where a human’s life was not worth much. They knew, too, what it meant to be used.\u003c/p\u003e\n\u003cp\u003eFurther down the beach, well past the lone hooded figure, walked Trull Sengar and the T’lan Imass, Onrack the Broken. Like an artist with his deathless muse, or; perhaps at his shoulder a critic of ghastly mien. An odd friendship, that one. But then, T’lan Imass were full of surprises.\u003c/p\u003e\n\u003cp\u003eSighing, Cotillion set off down the slope.\u003c/p\u003e\n\u003cp\u003eThe hooded head half turned at his approach. A face the hue of burnished leather, eyes dark beneath the felted wool rim of the hood. ‘Have you come with the key, Cotillion?’\u003c/p\u003e\n\u003cp\u003e‘Quick Ben, it is good to see that you have recovered.’\u003c/p\u003e\n\u003cp\u003e‘More or less.’\u003c/p\u003e\n\u003cp\u003e‘What key?’\u003c/p\u003e\n\u003cp\u003eThe flash of a humourless smile. ‘The one that sets me free.’\u003c/p\u003e\n\u003cp\u003eCotillion stood beside the wizard and studied the murky expanse of water. ‘I would imagine that you could leave here at any time. You are a High Mage, with more than one warren at your disposal. Force a gate, then walk through it.’\u003c/p\u003e\n\u003cp\u003e‘Do you take me for a fool?’ Quick Ben asked in a quiet voice. ‘This damned realm is wandering. There’s no telling where I would come out, although if I guess correctly, I would be in for a long swim.’\u003c/p\u003e\n\u003cp\u003e‘Ah. Well, I’m afraid I pay little attention to such things these days. We are crossing an ocean, then?’\u003c/p\u003e\n\u003cp\u003e‘So I suspect.’\u003c/p\u003e\n\u003cp\u003e‘Then indeed, to journey anywhere you require our help.’\u003c/p\u003e\n\u003cp\u003eThe wizard shot him a glance. ‘As I thought. You have created pathways, gates with fixed exits. How did you manage that, Cotillion?’\u003c/p\u003e\n\u003cp\u003e‘Oh, not our doing, I assure you. We simply stumbled onto them, in a manner of speaking.’\u003c/p\u003e\n\u003cp\u003e‘The Azath.’\u003c/p\u003e\n\u003cp\u003e‘Very good. You always were sharp, Ben Delat.’\u003c/p\u003e\n\u003cp\u003eA grunt. ‘I’ve not used that version of my name in a long time.’\u003c/p\u003e\n\u003cp\u003e‘Oh? When was the last time-do you recall?’\u003c/p\u003e\n\u003cp\u003e‘These Azath,’ Quick Ben said, clearly ignoring the question. ‘The House of Shadow itself, here in this realm, correct? Somehow, it has usurped the gate, the original gate. Kurald Emurlahn. The House exists both as a cast shadow and as its true physical manifestation. No distinction can be made between the two. A nexus… but that is not unusual for Azath constructs, is it? What is, however, is that the gate to Kurald Emurlahn was vulnerable in the first place, to such a usurpation.’\u003c/p\u003e\n\u003cp\u003e‘Necessity, I expect,’ said Cotillion, frowning at seeing a slow sweep of broad ripples approach the shore, their source somewhere further out. Not at all what it seems…\u003c/p\u003e\n\u003cp\u003e‘What do you mean?’\u003c/p\u003e\n\u003cp\u003eThe god shrugged. ‘The realm was shattered. Dying.’\u003c/p\u003e\n\u003cp\u003e‘The Azath participated in healing the fragments? Intentional? By design, by intellect? Or in the manner that blood dries to create a scab? Is the Azath nothing more than some kind of natural immune system, such as our bodies unleash to fight illness?’\u003c/p\u003e\n\u003cp\u003e‘The breadth of your scholarly knowledge is impressive, Quick Ben.’\u003c/p\u003e\n\u003cp\u003e‘Never mind that. The warrens were K’rul’s supreme sacrifice-his own flesh, his own blood. But not the Elder Warrens-or so we are to believe. Whose veins were opened to create those, Cotillion?’\u003c/p\u003e\n\u003cp\u003e‘I wish I knew. No, rather, I don’t. I doubt it is relevant, in any case. Does the Azath simply respond to damage, or is there a guiding intelligence behind its actions? I cannot answer you. I doubt anyone can. Does it even matter?’\u003c/p\u003e\n\u003cp\u003e‘I don’t know, to be honest. But not knowing makes me nervous.’\u003c/p\u003e\n\u003cp\u003e‘I have a key for youf’ Cotillion said after a moment. Trull Sengar and Onrack were now walking towards them. ‘For the three of you, in fact. If you want it.’\u003c/p\u003e\n\u003cp\u003e‘There’s a choice?’\u003c/p\u003e\n\u003cp\u003e‘Not for them,’ Cotillion said, nodding in the direction of Trull and the T’lan Imass. ‘And they could use your I help.’\u003c/p\u003e\n\u003cp\u003e‘The same was true of Kalam Mekhar,’ Quick Ben said. ‘Not to mention Adjunct Tavore.’\u003c/p\u003e\n\u003cp\u003e‘They survived,’ Cotillion replied.\u003c/p\u003e\n\u003cp\u003e‘You cannot be sure, though-not with Kalam. You can’t be entirely sure, can you?’\u003c/p\u003e\n\u003cp\u003e‘He was alive when the Deadhouse took him.’\u003c/p\u003e\n\u003cp\u003e‘So Shadowthrone claims.’\u003c/p\u003e\n\u003cp\u003e‘He would not lie.’\u003c/p\u003e\n\u003cp\u003eThe wizard barked a bitter laugh. \u003c/p\u003e","sourceLink":"https://allnovel.net/reaper-s-gale-the-malazan-book-of-the-fallen-7/page-99.html","bookId":2013,"creation":"Oct 5, 2019 10:37:33 PM","modification":"Oct 5, 2019 10:37:33 PM"}
