{"id":98881,"no":24,"title":"Page 24","content":"\u003cp\u003eBridget consumed his thoughts when she was with him or away. For two weeks, he’d been in a constant state of arousal that had only been whetted by what had taken place between them.\u003c/p\u003e\n\u003cp\u003e“Chad!” snapped Miss Gore. She leaned over the arm of the treadmill and hit the emergency stop button.\u003c/p\u003e\n\u003cp\u003eAt the last minute, he caught himself before he ate the tread. “Jesus!”\u003c/p\u003e\n\u003cp\u003e“Not quite.” She folded her arms. “Have you been listening to me at all?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He grabbed the towel off the front and stepped off the treadmill, mopping up his sweat. “I’m taking her out later today, before dinner, to one of those damn places you picked out that’s going to cost me a month’s salary.”\u003c/p\u003e\n\u003cp\u003eMiss Gore nodded her approval. “Bridget will like the place.”\u003c/p\u003e\n\u003cp\u003e“How do you know what she likes?” He tore off his shirt and tossed it into a laundry basket. Miss Gore was so not affected by any partial nudity on his end.\u003c/p\u003e\n\u003cp\u003eShe followed him out into the kitchen. “I like her, you know.”\u003c/p\u003e\n\u003cp\u003eGrabbing a bottle of water, he raised a brow at her.\u003c/p\u003e\n\u003cp\u003e“Your friends seem to like her, too. You seem to like her.”\u003c/p\u003e\n\u003cp\u003eChad downed half of the bottle. “What are you getting at?”\u003c/p\u003e\n\u003cp\u003eMiss Gore shrugged her bony shoulders. “All I’m saying is that you two are really convincing.”\u003c/p\u003e\n\u003cp\u003eWhatever. He said that out loud, too.\u003c/p\u003e\n\u003cp\u003e“Well, the good news is that the Nationals are beyond pleased with you.” A proud smile tilted the corners of her lips, and she looked almost human for a moment. “The Christmas event they plan should seal the deal. You should be happy about this. There’s only a week and some odd days left.”\u003c/p\u003e\n\u003cp\u003eChad wasn’t happy about this.\u003c/p\u003e\n\u003cp\u003e“Of course, you’re not getting rid of me that easily.”\u003c/p\u003e\n\u003cp\u003eOf course not.\u003c/p\u003e\n\u003cp\u003e“I’ll stay on to make sure you maintain your image,” she continued. “If we play our cards right, we’ll get the public’s sympathy after your split from Miss Rodgers.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed. “Oh, so we’re going to make her the villain in all of this?”\u003c/p\u003e\n\u003cp\u003e“Better than you coming out the bad guy, right?” Miss Gore frowned. “What? Does that bother you?”\u003c/p\u003e\n\u003cp\u003eChad didn’t say anything, because honestly, what did this woman think of him if she thought he’d be okay with that? There’d be nothing she could say that would get him to let Bridget take the blame. Contract or no.\u003c/p\u003e\n\u003cp\u003eAfter a while, Miss Gore left, passing his older brother Chandler on the way out. The two came to a complete standstill in the foyer. Neither would move out of the way for the other. There couldn’t be two more obstinate people in the world, he realized. Chad left them to figure how to enter and exit at the same time.\u003c/p\u003e\n\u003cp\u003eLater, it turned out Bridget did love the Little Boutique on 27 Avenue. She floated from one rack of sparkly dresses to another while he sat in one of those chairs that reminded him of a throne—a pink throne that someone’s grandmother took a Bedazzler to.\u003c/p\u003e\n\u003cp\u003eThrough narrowed eyes, he watched her look over the accessories first. She had her eye on a necklace that appeared to be a real emerald dangling from a silver chain. She kept running her fingers over it, and he thought the stone would match her eyes—\u003c/p\u003e\n\u003cp\u003eWhat the hell was he thinking? A necklace would match her eyes? God, he sounded like Chase.\u003c/p\u003e\n\u003cp\u003eShe finally moved over to the dresses, going straight for a deep-green one that looked like it would hug her curves. He hoped she picked that one. His gaze dropped to her sweet, round ass, and he had to look away before things got real awkward up in here.\u003c/p\u003e\n\u003cp\u003eAt the counter, two clerks were giggling and whispering as they stared at him.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, he went back to staring at Bridget as he slid farther down in his pink throne, spreading his thighs wide to get a little more comfortable. He saw her pick up the tag and then frown. She dropped the dress.\u003c/p\u003e\n\u003cp\u003e“Bridget?”\u003c/p\u003e\n\u003cp\u003eShe looked over her shoulder at him. Her hair was pulled up in a high ponytail and a bright red and purple silk scarf was intricately tied around her neck. “What?”\u003c/p\u003e\n\u003cp\u003e“I liked that dress.” He nodded at the green one she’d held.\u003c/p\u003e\n\u003cp\u003eWalking over to him, she straightened the edges on the scarf. “I do, too.”\u003c/p\u003e\n\u003cp\u003e“Then try it on.”\u003c/p\u003e\n\u003cp\u003eShe bit down on her plump lip, and he was jealous. He wanted to bite it—lick it. “It’s too expensive.”\u003c/p\u003e\n\u003cp\u003eHe reached into the pocket of his jeans and pulled out a lollipop he’d stolen from the counter when they’d come in. “How much is it?”\u003c/p\u003e\n\u003cp\u003e“You don’t even want to know.”\u003c/p\u003e\n\u003cp\u003eTearing off the wrapper, he popped the lolli in his mouth. “How much?”\u003c/p\u003e\n\u003cp\u003e“Too much,” she replied.\u003c/p\u003e\n\u003cp\u003e“How much, Bridget?”\u003c/p\u003e\n\u003cp\u003eShe sighed and her eyes narrowed. “It’s a little shy of fifteen hundred.”\u003c/p\u003e\n\u003cp\u003eChad didn’t even blink. “Try it on.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“Try it on.” When she didn’t budge, he arched a brow. “Or I will.”\u003c/p\u003e\n\u003cp\u003eHer stern expression slipped away as she giggled. “Is that supposed to convince me? I’d die to see you in that dress.”\u003c/p\u003e\n\u003cp\u003eChad swirled the lolli around, eyes narrowing. “I’ll try it on right here, in front of the two nice ladies up front. You know, by the counter and the glass windows.”\u003c/p\u003e\n\u003cp\u003e“Go ahead,” she said, but when he raised both brows, she rolled her eyes and made a sound of disgust. “Fine.”\u003c/p\u003e\n\u003cp\u003eWhen she spun around, he got an eyeful of the frustrated little twitch in her step and his lips split into a grin. Biting into the hard candy, he watched her stalk past him with the dress in hand, shooting him a dark look.\u003c/p\u003e\n\u003cp\u003eOf course, the moment he heard the soft click of the dressing room door, pictures of her stripping her clothes off filled his head. Images of her wiggling that ass out of those jeans and unhooking her bra, because that dress was strapless, teased him.\u003c/p\u003e\n\u003cp\u003eChad shifted in the blitzed-out throne, feeling himself swell.\u003c/p\u003e\n\u003cp\u003eTwice now Bridget had stopped things right before the real fun could get started. Complicate things? As if the whole situation wasn’t already complicated as fuck. So why not just do what they both wanted? Because he knew she wanted him.\u003c/p\u003e\n\u003cp\u003eAs he sat there, the stupidest shit popped into his head. Chad thought about his father. Now that was a man who had pretty much done whatever he wanted, when he wanted. Not that his father’s behavior was something to look up to. Hell, the way his father had behaved, as if the world was one giant playground built just for him, had fucked with all their heads. It was why Chase had stayed away from Maddie as long as he had and why Chandler was a controlling, obstinate fuck.\u003c/p\u003e\n\u003cp\u003eAnd it was why Chad acted like…well, like the world was his playground.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eSitting up straighter, he thought what a fucked-up place to have such a realization. He was sitting in a damn pink throne. And you’d think that would’ve changed what he was about to do, but it didn’t. He was pissed, confused, and horny. Not a good combination.\u003c/p\u003e\n\u003cp\u003eChad stood up and tossed the ladies up front a grin and a wink. “I’m going to help her zip her dress.”\u003c/p\u003e\n\u003cp\u003eOne of them giggled. “You do that.”\u003c/p\u003e\n\u003cp\u003eSwaggering back down the hall, he knocked on the door and then immediately opened it. The curve of a pale back greeted him. There was a freckle right beside her spine.\u003c/p\u003e\n\u003cp\u003eYeah, he was going to get up close and personal with that freckle.\u003c/p\u003e\n\u003cp\u003eBridget gasped and jerked around, clutching the front of the green dress to her breasts. Her eyes widened when she saw him. “What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Remember when I said I was being a good boy? Well, now I’m being naughty.”\u003c/p\u003e\n\u003cp\u003e“Chad!” Her voice came out in a hushed whisper. “We’re in a dressing room. There are people right out the—”\u003c/p\u003e\n\u003cp\u003e“I don’t care.” He caught her arms, totally not missing the flare of heat in her eyes. Oh, baby, Bridget had a naughty girl in her. “There is something I need to do.”\u003c/p\u003e\n\u003cp\u003eBridget opened her mouth, probably to ask a shit ton worth of questions, because that woman was inquisitive as hell, but he silenced her words with his mouth. Kissing her, he didn’t hold back. He claimed her, forcing her lips open, and just when her body started to tremble, he pulled back and flipped her around, so that her back was against his front.\u003c/p\u003e\n\u003cp\u003e“We shouldn’t be doing this,” she said, but her voice was husky and betrayed her needs.\u003c/p\u003e\n\u003cp\u003eHe slid the material down her hips, letting it pool around her ankles. Then he kissed that freckle and when he licked it, her back arched. He straightened, dragging his hands up her sides. He could see her in the mirror, the rosy tips of her breasts pebbled, begging for him.\u003c/p\u003e\n\u003cp\u003eWho was he to deny her?\u003c/p\u003e\n\u003cp\u003eChad cupped her breasts in both hands from behind and lowered his head, his breath stirring the tiny strands of red hair. “I like the dress.”\u003c/p\u003e\n\u003cp\u003eBridget’s eyes were only half open. “You didn’t even see me in it.”\u003c/p\u003e\n\u003cp\u003e“I saw enough to know you’d look good out of the dress.” He rolled her nipples between his fingers, causing her to jerk. “So, yeah, I like the dress.”\u003c/p\u003e\n\u003cp\u003eHer breath was coming out in short rasps. “Chad, we need to stop this. This isn’t—”\u003c/p\u003e\n\u003cp\u003eShe’d grabbed at his hands, but he easily caught her wrists in one hand. Holding them captured under her breasts, he placed a kiss against her thundering pulse. “This isn’t what? Something that you want? Bullshit. You want it.”\u003c/p\u003e\n\u003cp\u003eA shudder rocked her body, and her lashes lowered completely, fanning her flushed cheeks. Chad smiled against her exposed neck as he slid his free hand down her belly, loving the softness of her skin. When his fingers reached the band on her panties, she tried to pull her hands free.\u003c/p\u003e\n\u003cp\u003e“Oh, no, you’re not going anywhere.” He kissed the spot below her ear and was rewarded with a shiver. “We’re going to do this right now.”\u003c/p\u003e\n\u003cp\u003eIn the mirror, he could see her teeth clamped down on her plump lower lip and he knew he had her. “Open your eyes,” he ordered. “I want you to watch me.”\u003c/p\u003e\n\u003cp\u003eBridget’s lashes lifted.\u003c/p\u003e\n\u003cp\u003e“See what I’m doing?” Slipping a hand between her spread thighs, he slid his fingers under the satiny panties. “You like that?”\u003c/p\u003e\n\u003cp\u003eHeat flared, turning her eyes an emerald shade of green. “Yes,” she gasped.\u003c/p\u003e\n\u003cp\u003eBrushing over her damp folds, he groaned deep in his throat. She was already wet and ready for him.\u003c/p\u003e\n\u003cp\u003eFor. Him.\u003c/p\u003e\n\u003cp\u003e“Well, you’re really going to like this.” He eased a finger in her, and it didn’t take much.\u003c/p\u003e\n\u003cp\u003eBridget’s hips immediately rolled into the rhythm, her ass pressing back against his cock over and over, and if he wasn’t careful, it was going to be a very awkward walk out of the boutique.\u003c/p\u003e\n\u003cp\u003eWhen he felt her muscles starting to tremble, he let go of her wrists and placed his hand over her mouth, silencing her cries. She surprised him, though, when she sucked one of his fingers into her mouth as she came. He felt that all the way to the tip of his dick.\u003c/p\u003e\n\u003cp\u003eLetting her go when he was sure she wouldn’t collapse, he put distance between them. Perhaps this wasn’t one of his brightest ideas. The smell of her clung to him, he could still feel her pushing back against him, and now he wanted nothing more than to just take her to the floor. Against the mirror. Fuck, anywhere. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempting-the-player-gamble-brothers-2/page-24.html","bookId":2004,"creation":"Oct 5, 2019 6:38:04 PM","modification":"Oct 5, 2019 6:38:04 PM"}
