{"id":98860,"no":3,"title":"Page 3","content":"\u003cp\u003eSitting so close, his knee pressed into her thigh. “So, what do you do, Bridget?”\u003c/p\u003e\n\u003cp\u003eShe started to say where she worked but decided against it. The fact that she knew Maddie and Chase would definitely change things. “I work downtown as an executive assistant. I know. I know. That’s a glorified term for a secretary, but I love what I do.”\u003c/p\u003e\n\u003cp\u003eChad placed an arm on the counter, toying with the neck of his beer bottle. “Hey, as long as it’s something you enjoy, doesn’t matter what it is.”\u003c/p\u003e\n\u003cp\u003e“Do you still enjoy playing baseball?” At the weird look that crossed his face, she added, “I mean, you always hear professional players either love or hate the game after a while.”\u003c/p\u003e\n\u003cp\u003e“Ah, I get what you mean. I still love the game. Politics of it, not so much, but I wouldn’t change what I do. I get to play and get paid for it.”\u003c/p\u003e\n\u003cp\u003e“Politics?” she asked, curious.\u003c/p\u003e\n\u003cp\u003e“The behind-the-scenes stuff,” he explained, taking a swig of his beer. “Agents. Managers. Contracts. All that stuff doesn’t really interest me.”\u003c/p\u003e\n\u003cp\u003eBridget nodded, wondering what he thought about the heated debate going on in the sports column lately about whether or not he’d take the New York contract. She really didn’t follow baseball, only ended up reading the section during a particularly boring lunch one day. Typically, she made a beeline for the gossip page, which always had a hefty amount of info on Chad, now that she thought about it.\u003c/p\u003e\n\u003cp\u003eAs she finished her drink, he peppered her with questions about her background, seeming genuinely interested in what she said. When she asked him about his schooling, she pretended she didn’t know what high school and college he went to, but she knew. They were the same as Madison’s.\u003c/p\u003e\n\u003cp\u003e“So, you come here often?” she asked when there was a lull in conversation. Her gaze dipped to his mouth. She was having a hard time not looking there and imagining what his lips would feel like against hers, how he tasted.\u003c/p\u003e\n\u003cp\u003e“Once a month, sometimes more or less.” he explained. “My friend Tony probably comes more.”\u003c/p\u003e\n\u003cp\u003eNow she knew why the dark-haired guy looked familiar. Another baseball player. “Does the entire team come here a lot?”\u003c/p\u003e\n\u003cp\u003eChad laughed deeply. “No, most of the guys aren’t into this kind of thing.”\u003c/p\u003e\n\u003cp\u003e“Oh? But you are?” Yeah, she assumed some of the guys were probably married.\u003c/p\u003e\n\u003cp\u003e“Most definitely.” He leaned over, placing his arm on the back of her stool. “So you’re not originally from the DC area?”\u003c/p\u003e\n\u003cp\u003e“Nope, I hail from Pennsylvania.”\u003c/p\u003e\n\u003cp\u003e“Pennsylvania lost a treasure.”\u003c/p\u003e\n\u003cp\u003e“Ha. Ha,” she said, but she was secretly flattered. Of course, she’d take that fact to the grave. “And you were doing so well before that line.”\u003c/p\u003e\n\u003cp\u003eChad chuckled. “In this case, I meant what I said, but I agree. That line was bad.” His face took on the shape of someone exaggerating being deep in thought, his finger tapping his chin. “Hmm. What’s a better line? How about…”\u003c/p\u003e\n\u003cp\u003e“No, no,” she said. “Let’s forget about better lines. What’s your worst line? That sounds like way more fun.”\u003c/p\u003e\n\u003cp\u003e“My worst line?” His eyes twinkled. “You’re assuming I have a worst line, aren’t you?”\u003c/p\u003e\n\u003cp\u003eBridget gestured at the bar around her with one hand while leaning closer, settling her chin on her other hand, her arm resting on the bar in what she hoped was a seductive pose. She was a little out of practice. “Given you’ve admitted you hang out here a lot, why yes, I do believe you have many worse lines in you, playa playa.” And then she winked. She actually winked. She sincerely hoped he wasn’t going to call her out for her worst flirting moves ever because she was pretty sure she’d just emptied the vault in one shebang.\u003c/p\u003e\n\u003cp\u003eChad laughed deep and throaty, the sound thrumming down her spine. “Well, I wouldn’t want to waste my worst lines on someone as sexy as you.”\u003c/p\u003e\n\u003cp\u003eBridget couldn’t help it—she snorted with laughter. “Well played, sir. Well. Played.” And now she was grinning like an idiot, but at least his grin made a matching set. Man, she’d forgotten how fun it was to just get out and flirt with a smart, sexy guy.\u003c/p\u003e\n\u003cp\u003eHe gave a mock bow. “I try.”\u003c/p\u003e\n\u003cp\u003eTwo shots of vodka arrived mysteriously. Chad laughed when she had to do the shot in two gulps.\u003c/p\u003e\n\u003cp\u003e“Cheater,” he teased, eyes dancing.\u003c/p\u003e\n\u003cp\u003eWaving a hand in her face, she laughed. “I don’t know how you do it. That stuff is strong.”\u003c/p\u003e\n\u003cp\u003e“Years of practice.”\u003c/p\u003e\n\u003cp\u003e“It’s good to see that you excel at something other than baseball.”\u003c/p\u003e\n\u003cp\u003eHis gaze settled on her lips. “I excel at many things.”\u003c/p\u003e\n\u003cp\u003eChad motioned to the bartender for a glass of water and then slid it to her. She gave him a grateful smile and took a sip.\u003c/p\u003e\n\u003cp\u003eLike one of the women in the romance books she read, she was snared in his gaze. “You know, one more line and you win a set of steak knives.”\u003c/p\u003e\n\u003cp\u003eHe leaned in and it felt like there was no room. Her heart sped up as his smile turned half secretive, half playful. “Many, many things.”\u003c/p\u003e\n\u003cp\u003eBridget flushed, blaming the alcohol. “I think you should know, I’m impervious to bar bullshit.” She wasn’t, of course, as her racing heart clearly proved, but damn if she didn’t care.\u003c/p\u003e\n\u003cp\u003eHe reached out, brushing his knuckles along her warm cheek. She shivered. “I like the way you blush.”\u003c/p\u003e\n\u003cp\u003eBridget felt even more crimson sweep across her cheeks as she reached for her water. “Hey, I thought we agreed no more bad pickup lines.” Peeking at him, she found him watching her intently. Actually, she was pretty sure he hadn’t taken his eyes off her longer than a few seconds.\u003c/p\u003e\n\u003cp\u003e“Well, that’s no fun.” But his eyes were still crinkled with laughter. His gaze flicked to the bartender. “Another drink?”\u003c/p\u003e\n\u003cp\u003eWhen she nodded, she ordered something with less punch to it. They resumed talking and before Bridget knew it, she had completely lost sight of Shell as the crowd in the club thickened around the bar, obscuring the view of the tables. Chad had moved closer, his entire leg now pressed against hers. The contact made her skin tingle beneath her dress.\u003c/p\u003e\n\u003cp\u003eGlancing away, her gaze found a couple dancing nearby—if you called what they were doing dancing. It was basically sex standing up with clothes on. The woman’s short denim skirt was pushed high and her leg curled along the narrow slant of the man’s hips. Her partner’s hand was under the frayed hem as their hips grinded together. She swallowed and turned back to her drink.\u003c/p\u003e\n\u003cp\u003e“I can’t believe I’m giving you my A-game here and you’re calling foul ball. I’m wounded,” he said, placing a hand over his heart in mock pain.\u003c/p\u003e\n\u003cp\u003eThe teasing tone brought a grin to her lips. “I can tell you have self-esteem issues.”\u003c/p\u003e\n\u003cp\u003eChad laughed, the sound deep and rumbling before slowly waning off. He leaned in, his expression growing serious for the first time that night. “Can I be honest with you, Bridget?”\u003c/p\u003e\n\u003cp\u003eShe arched a brow. “Do I want you to be?”\u003c/p\u003e\n\u003cp\u003eHis palm traced her wildly beating pulse, his long fingers wrapping around the nape of her neck. “I saw you before you saw me. I came to this side of the bar just to talk to you.”\u003c/p\u003e\n\u003cp\u003eAll coherent thought fled her. Was Chad serious? And how much had he been drinking before they met up? It wasn’t that she had a low self-esteem. Bridget knew she was pretty, but she also knew her body went out of fashion several decades ago and this club was packed with supermodel type chicks. The kind she saw him pictured with time and time again.\u003c/p\u003e\n\u003cp\u003eBut it was her he was talking to, touching.\u003c/p\u003e\n\u003cp\u003eTheir lips were so close that their breath mingled. The steady hum of raucous conversation and music around them faded. Maybe it was the alcohol or the fact that it was Chad Gamble. Like any woman with ovaries, she had her fair share of fantasies surrounding the playboy, but everything felt surreal. She was hyperaware of what was happening and at the same time detached from logic.\u003c/p\u003e\n\u003cp\u003e“And just to be clear, that was not a line.” Chad’s head tilted to the side. “I want to kiss you.”\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003e“Now?” Bridget’s muscles tensed and then immediately relaxed under his skilled ministrations.\u003c/p\u003e\n\u003cp\u003e“Now.”\u003c/p\u003e\n\u003cp\u003eBridget’s head was tipping back, her body relaxing into his touch, pressing toward it, yielding to it. Chad was spinning a seductive web around her, blurring reality. Her throat was dry and his fingers…his fingers were guiding her head back farther and an ache had started in the pit of her stomach. “I…”\u003c/p\u003e\n\u003cp\u003e“Just a kiss.” His breath danced over her cheek, and her eyes drifted shut. Bridget’s hands opened and closed uselessly in her lap.\u003c/p\u003e\n\u003cp\u003eKissing Chad in a packed bar shouldn’t turn her on as much as it did. PDA wasn’t something she regularly indulged in and usually made fun of when she saw it in public, especially when it was Madison and Chase because they were all over each other constantly, but this…this was different and before she knew what she was doing, she said yes.\u003c/p\u003e\n\u003cp\u003eBridget didn’t feel his lips on hers like she expected.\u003c/p\u003e\n\u003cp\u003eThe tip of his nose brushed over the curve of her jaw, causing her breath to catch, and then his head dipped lower. With Bridget’s head tipped back, her throat was exposed to him. Her hands clenched and then his hot mouth was against where her pulse pounded.\u003c/p\u003e\n\u003cp\u003eBridget’s entire body jerked as if he were doing something far more wicked than what was usually considered a sweet gesture. The kiss was quick, but as he started to lift his head, he nipped at her neck and then she felt his tongue sweep across her skin, soothing the sting. A moan escaped her parted lips.\u003c/p\u003e\n\u003cp\u003e“See? It was just a kiss,” he said, his voice deep and husky.\u003c/p\u003e\n\u003cp\u003eHer lashes fluttered open, and Chad was staring down at her, his eyes hooded. “That…”\u003c/p\u003e\n\u003cp\u003eHis smug smile spread as he brushed his lips over hers, feather light, making her gasp. “That was? Good?”\u003c/p\u003e\n\u003cp\u003e“Very nice,” she murmured.\u003c/p\u003e\n\u003cp\u003eHe chuckled, and his lips brushed hers once more. “Well, I have to do better than nice.”\u003c/p\u003e\n\u003cp\u003eHer heart doubled its beat.\u003c/p\u003e\n\u003cp\u003eHis hair brushed along the underside of her chin, soft as silk, and her fingers itched to touch them, but she didn’t dare move. Chad’s fingers had slipped through the mass of hair, and his hand was now cradling the back of her head.\u003c/p\u003e\n\u003cp\u003eThere was a moment, so full of anticipation and the unknown, that Bridget’s heart stuttered, and then his mouth was against her pulse again and her body tensed tight. His lips were warm and smooth, and she got lost in the feel of them. His tongue circled the area he’d kissed, and then he moved on, trailing tiny kisses down her neck. He nipped at the skin gently, and she jerked. He repeated the tiny scrape of teeth as he went to the hollow between her neck and shoulder, chuckling against her skin when she gasped again.\u003c/p\u003e\n\u003cp\u003e“Was that very nice?” he asked.\u003c/p\u003e\n\u003cp\u003eBreathing rapidly, she squeezed her hands into fists. “It was good.”\u003c/p\u003e\n\u003cp\u003eHis mouth moved against that tender spot. “You’re killing me, Bridget. We have to do better than good or nice.”\u003c/p\u003e\n\u003cp\u003eChad’s mouth was pushing aside the wide scoop collar, exposing more skin for his oddly tender and wholly sensual explorations. He pressed a kiss to the ridge of her collarbone, and then his free hand was suddenly on her knee, his fingers slipping up under the hem of her dress, curving along her thigh, and she thought about the couple on the dance floor, of what the man’s hand was surely doing under the scrape of denim, and then she stopped thinking. She’d slipped into a world where everything was about feeling and wanting, and she uncrossed her legs. \u003c/p\u003e","sourceLink":"https://allnovel.net/tempting-the-player-gamble-brothers-2/page-3.html","bookId":2004,"creation":"Oct 5, 2019 6:38:04 PM","modification":"Oct 5, 2019 6:38:04 PM"}
