{"id":22712,"no":6,"title":"CHAPTER 6","content":"\u0026nbsp;\"Jonner,\" said Aron, \"there are a couple of blips on the radar screen that shouldn\u0027t be there.\" \n\u003cdiv\u003e\n Jonner swung the control chair to look at the screen. There were two dots there, almost directly to the rear of the spaceship. Jonner watched them. They held their position on the screen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" he said. \"Pretty large for meteors, and there doesn\u0027t seem to be any lateral movement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Their ship had just begun acceleration, following a hyperbola that would break them free of Mars\u0027 gravity. It was a hyperbola that swung the ship against the direction of the planet\u0027s orbital travel, and, while speeding the ship away from the planet, slowed it in relation to the sun.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jonner and Aron were on duty on the control deck. Stein and Farlan slept on the centerdeck below. Two 24-hour periods had passed since they captured The Egg and maneuvered it into the right orbit for their departure from the Martian area.\n\u003c/div\u003e \n\u003cdiv\u003e\n The blips grew on the screen, and still they did not move laterally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Spaceships,\" Jonner decided.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027re following our course, and overtaking us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Marscorp ships!\" exclaimed Aron. \"But Jonner, we never were in radar range of any Marscorp ship or installation. How could they know our position and course?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Without replying, Jonner arose from the control chair and went around behind the control board. The wires to the radio transmitter, which he had disconnected so carefully, had been reconnected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Aron,\" said Jonner, coming back to the control chair, \"go down and chain Farlan to his bunk. He\u0027s our Marscorp spy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is?\" Aron\u0027s eyes widened. \"How do you know?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because you haven\u0027t been out of my sight since we took The Egg in tow, and you haven\u0027t been near that control board while we were on duty. Stein must have let Farlan get away from him again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not Stein?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You forget. Stein and Wessfeld arrived together from Charax, at the rendezvous. They had to be clean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Aron unstrapped and arose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shouldn\u0027t we boost acceleration and try to evade them?\" he asked, gesturing at the radar screen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We can\u0027t now,\" said Jonner. \"We\u0027re on an escape hyperbola and we\u0027ve got to hold this acceleration until she runs out, or we\u0027d throw it completely off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Aron went below. Jonner watched the screen anxiously. The Marscorp ships must have set an interception course, for their acceleration was much too high to be following their own escape orbit. They were getting closer rapidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jonner looked at the chronometer and at the tape still ticking through the ship\u0027s control mechanism. Eleven minutes was a brief time, but it seemed long when enemy ships were overtaking them at twice their acceleration.\n\u003c/div\u003e \n\u003cdiv\u003e\n Towing The Egg, this old ship could not match the Marscorp attackers\u0027 acceleration. It could accelerate much faster than it was, but if he was to hit the Earthward orbit he had been ordered to take he would have to hold his present acceleration until the eleven minutes was up.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the Marscorp ships got closer by the minute.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/3274/89549.html","bookId":408,"creation":"Aug 2, 2019 3:04:08 PM","modification":"Aug 2, 2019 3:04:08 PM"}
