{"id":108636,"no":7,"title":"Page 7","content":"\u003cp\u003e\"Group two, begin.\"\u003c/p\u003e\n\u003cp\u003eThe words broke the reverie of the four companions as they stood quietly together. Harrington looked at each of his group. Sandra stood to his right. He had argued strenuously against his daughter coming tonight, but, in the end, it had been futile. John and Amy Stone sat to his left and held hands so tightly that their skin had long since turned white. He looked at each in turn. No words were spoken. None were needed. The group stood, embraced silently, and melted into the darkness.\u003c/p\u003e\n\u003cp\u003eJohn Kelly heard the radio crackle and knew that the time had long passed for changing their minds. They were committed. He always felt nervous just before an attack. His stomach would twist, his hands would shake uncontrollably, and pain would shoot through his body. Normally he would hide his nervousness and keep his hands in his pockets or sit alone and pretend to go over the plan one last time. Tonight, though, he was on his own. He could pace freely and count down the remaining seconds. He looked again at his watch and felt a calm suddenly come over him as all the tension passed.\u003c/p\u003e\n\u003cp\u003eIt was time.\u003c/p\u003e\n\u003cp\u003eHe bent down, picked up the axe from the grass and smiled when he saw that his hand no longer shook.\u003c/p\u003e\n\u003cp\u003eHarris waited until the guards on sentry passed his position and then dropped from the tree. They would take only ten minutes to complete a full circuit of the complex, so he hurried over to the fence and began to climb. When he reached the top he threw a rubber mat over the barbed wire to protect himself. He looked around quickly to make sure he hadn\u0027t been seen and then pulled himself over and dropped to the ground. He checked his backpack was secure, pulled an Uzi machine pistol from its holster on his hip, and then disappeared into the darkness.\u003c/p\u003e\n\u003cp\u003eSandra Harrington sighted along the aiming bubble at the end of the crossbow. The subject of her attention was a thrall in the east tower. She followed his pacing for a second and then allowed herself to exhale slowly. She forced herself to relax and said a quiet prayer. Her finger squeezed the trigger and she felt the weapon snap back against her shoulder. Many thoughts raced through her mind. Would her training pay off? Would she miss and cause the alarm to be raised?\u003c/p\u003e\n\u003cp\u003eThe thrall suddenly jerked upright and then crumpled silently to the floor of the tower. Sandra smiled grimly and allowed the crossbow to swing from its strap. She looked again at her watch and then began to climb. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-apocalypse-a-world-torn-asunder/page-7.html","bookId":2518,"creation":"Oct 5, 2019 11:24:02 PM","modification":"Oct 5, 2019 11:24:02 PM"}
