{"id":64522,"no":1,"title":"Page 1","content":"\u003cp\u003e\"Cowards die many times before their deaths;\u003c/p\u003e\n\u003cp\u003eThe valiant never taste of death but once.\u003c/p\u003e\n\u003cp\u003eOf all the wonders that I yet have heard,\u003c/p\u003e\n\u003cp\u003eIt seems to me most strange that men should fear,\u003c/p\u003e\n\u003cp\u003eSeeing that death, a necessary end,\u003c/p\u003e\n\u003cp\u003eWill come when it will come.\"\u003c/p\u003e\n\u003cp\u003e--Shakespeare, Julius Caesar\u003c/p\u003e\n\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eThere are some days in the world that just seem perfect. Some days when a certain stillness covers the world, when a calm blankets you so thoroughly that you feel as if you could just disappear, when you feel such a sense of peace, immune from all the worries of the world. Immune from fear. From tomorrow. I can count moments like these on a single hand.\u003c/p\u003e\n\u003cp\u003eAnd one of them is right now.\u003c/p\u003e\n\u003cp\u003eI am thirteen years old, Bree is six, and we stand on a beach of fine, soft sand. dad holds my hand, and mom holds Bree\u0027s, and the four of us step across the hot sand, on our way into the ocean. The cool spray of the waves feels so good on my face, tapering off the heat of this August day. Waves crash all around us, and dad and mom are laughing, carefree. I have never seen them so relaxed. I catch them looking at each other with such love, and I implant the image in my mind. It is one of the few times I\u0027ve seen them so happy with each other, and I don\u0027t want to forget it. Bree yells in ecstasy, thrilled at the crash of the waves, which are at her chest, at the tug of the undertow, up to her thighs. Mom holds her tight and dad squeezes my hand, holding us back from the pull of the ocean.\u003c/p\u003e\n\u003cp\u003e\"ONE! TWO! THREE!\" dad yells.\u003c/p\u003e\n\u003cp\u003eI am lifted high into the air as dad pulls my hand and mom pulls Bree\u0027s. I go up high, over a wave, and scream as I clear it and it crashes behind me. I am amazed that dad can stand there like that, so strong, like a rock, seemingly oblivious to the force of nature.\u003c/p\u003e\n\u003cp\u003eAs I sink down into the ocean I enter it with shock, the cold water at my chest. I squeeze dad\u0027s hand harder, as the undertow returns, and again he holds me firmly in place. I feel, in that moment, that he will protect me from everything, forever.\u003c/p\u003e\n\u003cp\u003eWave after wave crashes down, and for the first time in as long as I can remember, mom and dad are in no rush. They hoist us again and again, Bree shouting with ever more delight. I don\u0027t know how much time passes on this magnificent summer day, on this peaceful beach, under a cloudless sky, the spray hitting my face. I never want the sun to set, never want any of this to change. I want to be here, like this, forever. And in this moment, I feel like I might be.\u003c/p\u003e\n\u003cp\u003eI open my eyes slowly, disoriented by what I see before me. I\u0027m not at the ocean, but sitting in the passenger seat of a motor boat, racing its way up a river. It is not summer, but winter, and the banks are lined with snow. Occasional chunks of ice float past us. My face is sprayed with water, but it is not the cool mist of the ocean waves in summer but rather the freezing spray of the icy Hudson in winter. I blink several times until I realize it is not a cloudless summer morning, but a cloudy winter afternoon. I try to figure out what happened, how everything changed.\u003c/p\u003e\n\u003cp\u003eI sit up with a chill and look around, immediately on guard. I haven\u0027t fallen asleep in daylight in as long as I can remember, and it surprises me. I quickly get my bearings and see Logan, standing stoically behind the wheel, eyes fixed on the river, navigating the Hudson. I turn and see Ben, head in his hands, staring out at the river, lost in his own world. On the other side of the boat sit Bree, eyes closed, leaning back in her seat, and her new friend Rose cuddled up with her, asleep on her shoulder. Sitting in her lap is our new pet, the one-eyed Chihuahua, asleep.\u003c/p\u003e\n\u003cp\u003eI\u0027m amazed I allowed myself to sleep, too, but as I look down and notice the half-drunk bottle of champagne in my hand, I realize the alcohol, which I haven\u0027t had in years, must have knocked me out - that, combined with so many sleepless nights, and so many days of adrenaline rush. My body is so banged up, so sore and bruised, it must\u0027ve just fallen asleep by itself. I feel guilty: I never let Bree out of my sight before. But as I look over at Logan, his presence so strong, I realize I must\u0027ve felt safe enough around him to do that. In some ways, it\u0027s like having my dad back. Is that why I dreamed of him?\u003c/p\u003e\n\u003cp\u003e\"Nice to have you back,\" comes Logan\u0027s deep voice. He glances my way, a small smile playing at the corner of his lips.\u003c/p\u003e\n\u003cp\u003eI lean forward, surveying the river before us as we cut through it like butter. The roar of the engine is deafening, and the boat rides the current, moving up and down in subtle motions, rocking just a tiny bit. The freezing spray hits my face directly, and I look down and see I\u0027m still dressed in the same clothes I\u0027ve been wearing for days. The clothes practically cling to my skin, caked with sweat and blood and dirt - and now moist from the spray. I am damp, and cold, and hungry. I would do anything for a hot shower, a hot chocolate, a roaring fire, and a change of clothes.\u003c/p\u003e\n\u003cp\u003eI scan the horizon: the Hudson is like a vast and wide sea. We stick to the middle, far from either shore, Logan wisely keeping us away from any potential predators. Remembering, I immediately turn back, checking for any sign of slaverunners. I see none.\u003c/p\u003e\n\u003cp\u003eI turn back and look for any signs of any boats on the horizon before us. Nothing. I scan the shorelines, looking for any sign of activity. Nothing. It is as if we have the world to ourselves. It is comforting and desolate at the same time.\u003c/p\u003e\n\u003cp\u003eSlowly, I relax my guard. It feels like I\u0027ve been asleep forever, but from the sun\u0027s position in the sky, it\u0027s only mid-afternoon. I couldn\u0027t have been asleep for more than an hour, at most. I look around for any familiar landmark. After all, we are nearly back near home. But I see none.\u003c/p\u003e\n\u003cp\u003e\"How long was I out?\" I ask Logan.\u003c/p\u003e\n\u003cp\u003eHe shrugs. \"Maybe an hour.\"\u003c/p\u003e\n\u003cp\u003eAn hour, I think. It feels like an eternity.\u003c/p\u003e\n\u003cp\u003eI check the gas gauge, and it reads half empty. That doesn\u0027t bode well.\u003c/p\u003e\n\u003cp\u003e\"Any sign of fuel anywhere?\" I ask.\u003c/p\u003e\n\u003cp\u003eThe moment I ask, I realize it is a stupid question.\u003c/p\u003e\n\u003cp\u003eLogan looks over at me, as if to say really? Of course, if he had seen a fuel depot, he would have hit it.\u003c/p\u003e\n\u003cp\u003e\"Where are we?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"These are your parts,\" he says. \"I was going to ask you the same thing.\"\u003c/p\u003e\n\u003cp\u003eI scan the river again, but still can\u0027t recognize anything. That\u0027s the thing about the Hudson - it\u0027s so wide, and it stretches forever, and it\u0027s so easy to lose one\u0027s bearings.\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you wake me?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Why should I? You needed the sleep.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t quite know what else to say to him. That\u0027s the thing about Logan: I like him, and I feel he likes me, but I don\u0027t know if we have all that much to say to each other. It doesn\u0027t help that he\u0027s guarded, and that I am, too.\u003c/p\u003e\n\u003cp\u003eWe continue in silence, the white water churning beneath us, and I wonder how much longer we can go on. What will we do when our fuel runs out?\u003c/p\u003e\n\u003cp\u003eIn the distance, I spot something on the horizon. It looks like some sort of structure, in the water. At first I wonder if I am seeing things, but then Logan cranes his neck, alert, and I realize he must see it, too.\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s a bridge,\" he says. \"A downed bridge.\"\u003c/p\u003e\n\u003cp\u003eI realize he\u0027s right. Growing ever closer is a towering hunk of twisted metal, sticking up out of the water like some sort of monument to hell. I remember this bridge: it once beautifully spanned the river; now, it\u0027s a huge heap of scrap metal, plunging at jagged angles down into the water.\u003c/p\u003e\n\u003cp\u003eLogan slows the boat, the engine quieting as we get closer. Our speed drops and the boat rocks wildly. The jagged metal protrudes from every direction, and Logan navigates, turning the boat left and right, creating his own little pathway. I look up as we go at the bridge\u0027s remains, looming over us. It looks like it rises hundreds of feet high, a testament to what humanity was once able to do before we started killing each other.\u003c/p\u003e\n\u003cp\u003e\"The Tappan Zee,\" I remark. \"We\u0027re about an hour north of the city. We\u0027ve got a good jump on them, if they\u0027re coming after us.\"\u003c/p\u003e\n\u003cp\u003e\"They are coming after us,\" he said. \"You can bet on it.\"\u003c/p\u003e\n\u003cp\u003eI look at him. \"How can you be so sure?\"\u003c/p\u003e\n\u003cp\u003e\"I know them. They never forget.\"\u003c/p\u003e\n\u003cp\u003eAs we pass the last scrap of metal, Logan picks up speed and I lean back as we accelerate.\u003c/p\u003e\n\u003cp\u003e\"How far behind us do you think they are?\" I ask.\u003c/p\u003e\n\u003cp\u003eHe looks at the horizon, stoic. Finally, he shrugs.\u003c/p\u003e\n\u003cp\u003e\"Hard to say. Depends how long it takes to rally the troops. Snow\u0027s heavy, which is good for us. Maybe three hours? Maybe six, if we\u0027re lucky? Good thing is, this baby\u0027s fast. I think we can outrun them, as long as we have fuel.\"\u003c/p\u003e\n\u003cp\u003e\"But we don\u0027t,\" I say, pointing out the obvious. \"We left with a full tank - now we\u0027re half empty. We\u0027ll be empty in just a few hours. Canada\u0027s a long way away. How do you propose we find fuel?\"\u003c/p\u003e\n\u003cp\u003eLogan stares at the water, thinking.\u003c/p\u003e\n\u003cp\u003e\"We have no choice,\" he says. \"We have to find it. There\u0027s no alternative. We can\u0027t stop.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to need to rest at some point,\" I say. \"We\u0027re going to need food, and some sort of shelter. We can\u0027t stay out in this temperature all day and all night.\"\u003c/p\u003e\n\u003cp\u003e\"Better to starve and freeze than be caught by slaverunners,\" he says.\u003c/p\u003e\n\u003cp\u003eI think of dad\u0027s house, farther upriver. We\u0027re going to pass right by it. I remember my vow to my old dog, Sasha, to bury her. I also think of all the food up there, in that stone cottage - we can salvage it, and it would sustain us for days. I think of all the tools in dad\u0027s garage, all the things we can make use of. Not to mention the extra clothes, blankets and matches.\u003c/p\u003e\n\u003cp\u003e\"I want to make a stop.\"\u003c/p\u003e\n\u003cp\u003eLogan turns and looks at me as if I\u0027m crazy. I can see that he doesn\u0027t like this.\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"My dad\u0027s house. In Catskill. About an hour north of here. I want to stop there. There are a lot of things we can salvage. Things we\u0027ll need. Like food. And,\" I pause, \"I want to bury my dog.\"\u003c/p\u003e\n\u003cp\u003e\"Bury your dog?\" he asks, his voice rising. \"Are you crazy? You want to get us all killed for that?\"\u003c/p\u003e\n\u003cp\u003e\"I promised her,\" I say.\u003c/p\u003e\n\u003cp\u003e\"Promised?\" he shoots back. \"Your dog? Your dead dog? You\u0027ve got to be kidding.\"\u003c/p\u003e\n\u003cp\u003eI stare him down, and he realizes pretty quickly that I\u0027m not.\u003c/p\u003e\n\u003cp\u003e\"If I promise something, I deliver. I\u0027d bury you if I promised.\"\u003c/p\u003e\n\u003cp\u003eHe shakes his head.\u003c/p\u003e\n\u003cp\u003e\"Listen,\" I say firmly. \"You wanted Canada. We could have gone anywhere. That was your dream. Not mine. Who knows it this town even exists? I\u0027m following you on a whim. And this boat\u0027s not just yours. All I want is to stop at my dad\u0027s place. Get some stuff, which we need, and put my dog to rest. It won\u0027t take long. We\u0027ve got a big jump on the slaverunners. Not to mention, we have a small canister of fuel up there. It\u0027s not much, but it will help.\"\u003c/p\u003e\n\u003cp\u003eLogan slowly shakes his head.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather not have that fuel and not take such a risk. You\u0027re talking about the mountains. You\u0027re talking about twenty miles inland, right? How do you propose we get there once we dock? Hike?\"\u003c/p\u003e\n\u003cp\u003e\"I know where there\u0027s an old truck. A beat-up pickup. It\u0027s just a rusted shell, but it runs, and it\u0027s got just enough fuel to get us there and back. It\u0027s hidden, by the river line. The river will take us right to it. The truck will take us up and back. It will be quick. And then we can continue on our long trip to Canada. And we\u0027ll be better for it.\"\u003c/p\u003e\n\u003cp\u003eLogan stares silently at the water for a long time, his fists clenched tight around the wheel.\u003c/p\u003e\n\u003cp\u003eFinally, he says, \"Whatever. It\u0027s your life to risk. But I\u0027m staying with the boat. You\u0027ve got two hours. If you\u0027re not back in time, I\u0027m taking off.\"\u003c/p\u003e\n\u003cp\u003eI turn away from him and look out at the water, fuming mad. I wanted him to come. I feel like he\u0027s looking out for himself, and it disappoints me. I thought he was better than that.\u003c/p\u003e\n\u003cp\u003e\"So you only care about yourself, is that it?\" I ask.\u003c/p\u003e\n\u003cp\u003eIt also worries me that he doesn\u0027t want to accompany me to my dad\u0027s house; I hadn\u0027t thought of that. I know Ben won\u0027t want to come and I would\u0027ve appreciated some backup. Whatever. I\u0027m still resolved. I made a promise, and I will keep it. With or without him.\u003c/p\u003e\n\u003cp\u003eHe doesn\u0027t respond, and I can tell he\u0027s annoyed.\u003c/p\u003e\n\u003cp\u003eI look out at the water, not wanting to see him. As the water churns amidst the constant whine of the engine, I realize I\u0027m mad not only because I\u0027m disappointed in him, but because I was actually starting to like him, to count on him. I haven\u0027t depended on anyone for a long time. It\u0027s a scary feeling, depending on someone again, and I feel betrayed.\u003c/p\u003e\n\u003cp\u003e\"Brooke?\"\u003c/p\u003e\n\u003cp\u003eMy heart lifts at the sounds of the familiar voice, and I turn to see my little sister awake. Rose wakes, too. Those two are already like peas in a pod, like extensions of one person.\u003c/p\u003e\n\u003cp\u003eI still can hardly believe that Bree is here, back with me. It\u0027s like a dream. When she was taken, a part of me was sure I\u0027d never see her alive again. Every moment I am with her, I feel like I\u0027ve been given a second chance, and I feel more determined than ever to watch over her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hungry,\" Bree says, rubbing her eyes with the back of her hands.\u003c/p\u003e\n\u003cp\u003ePenelope sits up, too, in Bree\u0027s lap. She won\u0027t stop trembling, and she raises her good eye and looks at me, as if she\u0027s hungry, too.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m freezing,\" Rose echoes, rubbing her shoulders. She wears only a thin shirt, and I feel terrible for her.\u003c/p\u003e\n\u003cp\u003eI understand. I\u0027m starving and freezing, too. My nose is red and I can barely feel it. Those goodies we found in the boat were amazing, but hardly filling - especially on an empty stomach. And that was hours ago. I think again of the food chest, of what little we have left, and wonder how long until it runs out. I know I should ration the food. But then again, we\u0027re all starving, and I can\u0027t stand to see Bree looking like that.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s not much food left,\" I tell her, \"but I can give you guys a little bit of it now. We have some cookies, and some crackers.\"\u003c/p\u003e\n\u003cp\u003e\"Cookies!\" they both yell at once. Penelope barks.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t do that,\" comes Logan\u0027s voice beside me.\u003c/p\u003e\n\u003cp\u003eI look over, and see him glancing back disapprovingly.\u003c/p\u003e\n\u003cp\u003e\"We need to ration it.\"\u003c/p\u003e\n\u003cp\u003e\"Please!\" Bree cries out. \"I need something. I\u0027m starving.\"\u003c/p\u003e\n\u003cp\u003e\"I need to give them something,\" I say firmly back to Logan, understanding where his head is, but annoyed at his lack of compassion. \"I\u0027m doling out one cookie each. For all of us.\"\u003c/p\u003e\n\u003cp\u003e\"What about Penelope?\" Rose asks.\u003c/p\u003e\n\u003cp\u003e\"The dog\u0027s not getting any of our food,\" Logan snaps. \"She\u0027s on her own.\"\u003c/p\u003e\n\u003cp\u003eI feel another twinge of upset at Logan, though I know he\u0027s being rational. Still, as I see the crestfallen look on Rose and Bree\u0027s faces, and as I hear her bark again, I can\u0027t bear to let her starve. I quietly resign to give her some food from my own rations.\u003c/p\u003e\n\u003cp\u003eI open the chest, and survey once again our stash of food. I see two boxes of cookies, three boxes of crackers, several bags of gummy bears, and a half dozen chocolate bars. I wish there was some more substantial food, and I don\u0027t know how we\u0027re going to make this last, how this will suffice for three meals a day for five people.\u003c/p\u003e\n\u003cp\u003eI pull out the cookies and dole out one to each person. Ben finally snaps out of it at the site of the food, and accepts a cookie. His eyes have black circles under them, and he looks as if he hasn\u0027t slept. It is painful to see his expression, so devastated from the loss of his brother, and I look away as I hand him his cookie.\u003c/p\u003e\n\u003cp\u003eI come to the front of the boat, and hand Logan his. He takes it and silently puts into his pocket, of course, rationing it for later. I don\u0027t know where he gets his strength from. Myself, I go weak at the smell of the chocolate chip cookie. I know I should ration it, too, but I can\u0027t help it. I take a small bite, resolving to put it away - but it tastes so good, I can\u0027t help myself - I devour the entire thing, saving only the last bite, which I set aside for Penelope.\u003c/p\u003e\n\u003cp\u003eThe food feels so good. The sugar rushes to my head, then through my body, and I wish I had a dozen more. I take a deep breath at the stomach pain, trying to control myself.\u003c/p\u003e\n\u003cp\u003eThe river narrows, the shores becoming ever closer to each other, as it twists and turns. We\u0027re close to land and I\u0027m on high alert, looking to the shorelines for any sign of danger. As we round a bend I look to my left and see, high up on a cliff, the ruins of an old fortification, now bombed out. I am shocked as I realize what it once was.\u003c/p\u003e\n\u003cp\u003e\"West Point,\" Logan says. He must realize at the same time as I do.\u003c/p\u003e\n\u003cp\u003eIt is shocking to see this bastion of American strength now just a pile of rubble, its twisted flagpole hanging limply over the Hudson. Hardly anything remains of what once was.\u003c/p\u003e\n\u003cp\u003e\"What is that?\" Bree asks, her teeth chattering. She and Rose have climbed to the front of the boat, beside me, and she looks out, following my gaze. I don\u0027t want to tell her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing sweetie,\" I say. \"Just a ruin.\"\u003c/p\u003e\n\u003cp\u003eI put my arm around her and pull her close, and put my other arm around Rose and pull her close, too. I tried to warm them up, rubbing their shoulders as best I can.\u003c/p\u003e\n\u003cp\u003e\"When are we going home?\" Rose asks.\u003c/p\u003e\n\u003cp\u003eLogan and I exchange a look. I hardly know how to answer.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not going home,\" I say to Rose, as gently as I can, \"but we\u0027re on our way to find a new home.\"\u003c/p\u003e\n\u003cp\u003e\"Are we going to pass by our old home?\" Bree asks.\u003c/p\u003e\n\u003cp\u003eI hesitate. \"Yes,\" I say.\u003c/p\u003e\n\u003cp\u003e\"But we\u0027re not going back there, right?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"Right,\" I say. \"It\u0027s too dangerous to live there now.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to live there again,\" she says. \"I hated that place. But we can\u0027t just leave Sasha there. Are we going stop and bury her? You promised.\"\u003c/p\u003e\n\u003cp\u003eI think back to my argument with Logan.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" I say softly. \"I did promise. And yes, we will stop.\"\u003c/p\u003e\n\u003cp\u003eLogan turns away, clearly miffed.\u003c/p\u003e\n\u003cp\u003e\"And then what?\" Rose asks. \"And then where will we go?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to keep going upriver,\" I explain. \"As far as it will take us.\"\u003c/p\u003e\n\u003cp\u003e\"Where does it end?\" she asks.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a good question, and I take it as a much more profound question. Where does all of this end? With our deaths? With our survival? Will it ever end? Is there any end in sight?\u003c/p\u003e\n\u003cp\u003eI don\u0027t have the answer.\u003c/p\u003e\n\u003cp\u003eI turn, and kneel, and look into her eyes. I need to give her hope. Something to live for.\u003c/p\u003e\n\u003cp\u003e\"It ends in a beautiful place,\" I say. \"Where we\u0027re going, everything is good again. The streets are so clean that they shine, and everything is perfect and safe. There will be people there, friendly people, and they will take us in and protect us. There will be food, too, real food, all you can eat, all the time. It will be the most beautiful place you\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003eRose\u0027s eyes open wide.\u003c/p\u003e\n\u003cp\u003e\"Is that true?\" she asks.\u003c/p\u003e\n\u003cp\u003eI nod. Slowly, she breaks into a wide smile.\u003c/p\u003e\n\u003cp\u003e\"How long until we make it there?\"\u003c/p\u003e\n\u003cp\u003eI smile. \"I don\u0027t know sweetheart.\"\u003c/p\u003e\n\u003cp\u003eBree, though, is more cynical than Rose.\u003c/p\u003e\n\u003cp\u003e\"Is that really true?\" she asks, softly. \"Is there really such a place?\"\u003c/p\u003e\n\u003cp\u003e\"It is,\" I say to her, trying my best to sound convincing. \"Isn\u0027t that true, Logan?\"\u003c/p\u003e\n\u003cp\u003eLogan looks over, nods at them briefly, then looks away. He is the one, after all, that believes in Canada, believes in a promised land. How can he deny it now?\u003c/p\u003e\n\u003cp\u003eThe Hudson twists and turns, getting more narrow, then widening again. Finally, we enter familiar territory. We race past places I recognize, getting closer and closer to dad\u0027s house.\u003c/p\u003e\n\u003cp\u003eWe turn another bank, and I see a small, uninhabited island, just a rocky outcropping. On it sits the remains of a lighthouse, its light long shattered, its structure hardly more than a fa\u0026amp;ccedil;ade.\u003c/p\u003e\n\u003cp\u003eWe turn another bend in the river and in the distance I spot the bridge I\u0027d been on just days before, when chasing after the slaverunners. There, in the middle of the bridge, I see the center blown out, the huge hole, as if a wrecking ball had been dropped through the middle. I flash back to when Ben and I raced across it in the motorcycle and nearly skidded into it. I can\u0027t believe it. We\u0027re almost there.\u003c/p\u003e\n\u003cp\u003eThis makes me think of Ben, makes me remember how he saved my life that day. I turn and look at him. He stares into the water, morose.\u003c/p\u003e\n\u003cp\u003e\"Ben?\" I ask.\u003c/p\u003e\n\u003cp\u003eHe turns and looks at me.\u003c/p\u003e\n\u003cp\u003e\"Remember that bridge?\"\u003c/p\u003e\n\u003cp\u003eHe turns and looks, and I see fear in his eyes. He remembers.\u003c/p\u003e\n\u003cp\u003eBree elbows me. \"Is it okay if I give Penelope some of my cookie?\" she asks.\u003c/p\u003e\n\u003cp\u003e\"Me, too?\" Rose echoes.\u003c/p\u003e\n\u003cp\u003e\"Sure it is,\" I say loudly, so Logan can hear. He\u0027s not the only one in charge here, and we can do with our food as we wish.\u003c/p\u003e\n\u003cp\u003eThe dog, in Rose\u0027s lap, perks up, as if she understands. It is incredible. I have never seen such a smart animal.\u003c/p\u003e\n\u003cp\u003eBree leans in to feed her a piece of her cookie, but I stop her hand.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" I say. \"If you\u0027re going to feed her, she should have a name, shouldn\u0027t she?\"\u003c/p\u003e\n\u003cp\u003e\"But she has no collar,\" Rose says. \"Her name could be anything.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s your dog now,\" I say. \"Give her a new one.\"\u003c/p\u003e\n\u003cp\u003eRose and Bree exchange an excited glance.\u003c/p\u003e\n\u003cp\u003e\"What should we call her?\" Bree asks.\u003c/p\u003e\n\u003cp\u003e\"How about Penelope?\" Rose says.\u003c/p\u003e\n\u003cp\u003e\"Penelope!\" Bree screams. \"I like that.\"\u003c/p\u003e\n\u003cp\u003e\"I like it, too,\" I say.\u003c/p\u003e\n\u003cp\u003e\"Penelope!\" Rose cries out to the dog.\u003c/p\u003e\n\u003cp\u003eAmazingly, the dog actually turns to her when she says it, as if that were always her name.\u003c/p\u003e\n\u003cp\u003eBree smiles as she reaches out and feeds her a piece of cookie. Penelope snatches it out of her hands and gobbles it up in one bite. Bree and Rose giggle hysterically, and Rose feeds her the rest of her cookie. She snatches that, too, and I reach out and feed her the last bite of my cookie. Penelope looks back at all three of us excitedly, trembling, and barks three times.\u003c/p\u003e\n\u003cp\u003eWe all laugh. For a moment, I nearly forget our troubles.\u003c/p\u003e\n\u003cp\u003eBut then, in the distance, over Bree\u0027s shoulder, I spot something.\u003c/p\u003e\n\u003cp\u003e\"There,\" I say to Logan, stepping up and pointing to our left. \"That\u0027s where we need to go. Turn there.\"\u003c/p\u003e\n\u003cp\u003eI spot the peninsula where Ben and I drove off on the motorcycle, onto the ice of the Hudson. It makes me flinch to think of it, to think of how crazy that chase was. It\u0027s amazing I\u0027m still alive.\u003c/p\u003e\n\u003cp\u003eLogan checks over his shoulder to see if anyone is following; then, reluctantly, he eases up on the throttle and turns us off to the side, bringing us towards the inlet.\u003c/p\u003e\n\u003cp\u003eOn edge, I look around warily as we reach the mouth of the peninsula. We glide beside it as it curves inland. We are so close to shore now, passing a dilapidated water tower. We continue on and soon glide alongside the ruins of a town, right into the heart of it. Catskill. There are burnt-out buildings on all sides and it looks like it\u0027s been hit by a bomb.\u003c/p\u003e\n\u003cp\u003eWe are all on edge as we make our way slowly up the inlet, getting deeper inland, the shore now feet away as it narrows. We are exposed to ambush, and I find myself unconsciously reaching down and resting my hand on my hip, on my knife. I notice Logan do the same.\u003c/p\u003e\n\u003cp\u003eI check back over my shoulder for Ben; but he is still in a nearly catatonic state.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the truck?\" Logan asks, an edge to his voice. \"I\u0027m not going too deep inland, I\u0027ll tell you right now. If anything happens, we need to be able to get out to the Hudson, and fast. This is a death trap,\" he says, warily eyeing the shore.\u003c/p\u003e\n\u003cp\u003eI eye it, too. But the shore is empty, desolate, frozen over with no humanity in sight as far as the eye can see.\u003c/p\u003e\n\u003cp\u003e\"See there,\" I say, pointing. \"That rusted shed? It\u0027s inside.\"\u003c/p\u003e\n\u003cp\u003eLogan drives us another thirty yards or so, then turns for the shed. There is an old crumbling dock, and he\u0027s able to pull the boat up, feet from shore. He kills the engine, grabs the anchor and throws it overboard. He then grabs the rope from the boat, makes a loose knot at one end, and throws it to a rusted metal post. It catches and he pulls us in all the way, tightening it, so we can walk onto the dock.\u003c/p\u003e\n\u003cp\u003e\"Are we getting out?\" Bree asks.\u003c/p\u003e\n\u003cp\u003e\"I am,\" I say. \"Wait for me here, with the boat. It\u0027s too dangerous for you to go. I\u0027ll be back soon. I\u0027ll bury Sasha. I promise.\"\u003c/p\u003e\n\u003cp\u003e\"No!\" she screams. \"You promised we would never be apart again. You promised! You can\u0027t leave me here alone! You CAN\u0027T!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not leaving you alone,\" I answer, my heart breaking. \"You\u0027ll be here with Logan, and Ben, and Rose. You\u0027ll be perfectly safe. I promise.\"\u003c/p\u003e\n\u003cp\u003eBut Bree stands and to my surprise, she takes a running jump across the bow, and jumps onto the sandy shore, landing right in the snow.\u003c/p\u003e\n\u003cp\u003eShe stands ashore, hands on her hips, glaring back at me defiantly.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re going, I\u0027m going too,\" she states.\u003c/p\u003e\n\u003cp\u003eI take a deep breath, seeing she\u0027s resigned. I know that when she gets like this, she means it.\u003c/p\u003e\n\u003cp\u003eIt will be a liability, having her, but I have to admit, a part of me feels good having her in my sight at all times. And if I try to talk her out of it, I\u0027ll just waste more time.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" I say. \"Just stay close the entire time. Promise?\"\u003c/p\u003e\n\u003cp\u003eShe nods. \"I promise.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m scared,\" Rose says, looking over at Bree, wide-eyed. \"I don\u0027t want to leave the boat. I want to stay here, with Penelope. Is that okay?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to,\" I say to her, silently refusing to take her, too.\u003c/p\u003e\n\u003cp\u003eI turn to Ben, and he turns and meets my eyes with his mournful ones. The look in them makes me want to look away, but I force myself not to.\u003c/p\u003e\n\u003cp\u003e\"Are you coming?\" I ask. I hope he says yes. I\u0027m annoyed at Logan for staying here, for letting me down, and I could really use the backup.\u003c/p\u003e\n\u003cp\u003eBut Ben, still clearly in shock, just stares back. He looks at me as if he doesn\u0027t comprehend. I wonder if he\u0027s fully registering all that\u0027s happening around him.\u003c/p\u003e\n\u003cp\u003e\"Are you coming?\" I ask more forcefully. I don\u0027t have the patience for this.\u003c/p\u003e\n\u003cp\u003eSlowly, he shakes his head, withdrawing. He\u0027s really out of it, and I try to forgive him - but it\u0027s hard.\u003c/p\u003e\n\u003cp\u003eI turn to leave the boat, and jump onto shore. It feels good to have my feet on dry land.\u003c/p\u003e\n\u003cp\u003e\"Wait!\"\u003c/p\u003e\n\u003cp\u003eI turn and see Logan get up from the driver seat.\u003c/p\u003e\n\u003cp\u003e\"I knew some crap like this would happen,\" he says.\u003c/p\u003e\n\u003cp\u003eHe walks across the boat, gathering his stuff.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"What do you think?\" he asks. \"I\u0027m not letting you two go alone.\"\u003c/p\u003e\n\u003cp\u003eMy heart swells with relief. If it were just me I wouldn\u0027t care as much - but I am thrilled to have another set of eyes to watch Bree.\u003c/p\u003e\n\u003cp\u003eHe jumps off the boat, and onto shore.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you right now, this is a stupid idea,\" he says, as he lands besides me. \"We should keep moving. It will be night soon. The Hudson can freeze. We could get stuck here. Not to mention the slaverunners. You\u0027ve got 90 minutes, understand? 30 minutes in, 30 there, and 30 back. No exceptions, for any reason. Otherwise, I\u0027m leaving without you.\"\u003c/p\u003e\n\u003cp\u003eI look back at him, impressed and grateful.\u003c/p\u003e\n\u003cp\u003e\"Deal,\" I say.\u003c/p\u003e\n\u003cp\u003eI think of the sacrifice he just made, and I am beginning to feel something else. Behind all his posturing, I am beginning to feel that Logan really likes me. And he\u0027s not as selfish as I thought.\u003c/p\u003e\n\u003cp\u003eAs we turn to go, there\u0027s another shuffling on the boat.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" Ben cries out.\u003c/p\u003e\n\u003cp\u003eI turn and look.\u003c/p\u003e\n\u003cp\u003e\"You guys can\u0027t leave me here alone with Rose. What if someone comes? What am I supposed to do?\u003c/p\u003e\n\u003cp\u003e\"Watch the boat,\" Logan says, turning again to leave.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how to drive it!\" Ben yells out. \"I don\u0027t have any weapons!\"\u003c/p\u003e\n\u003cp\u003eLogan turns again, annoyed, reaches down, takes one of the guns off a strap from his thigh, and chucks it to him. It hits him hard in the chest, and he fumbles with it.\u003c/p\u003e\n\u003cp\u003e\"Maybe you\u0027ll learn how to use it,\" Logan sneers, as he turns away again.\u003c/p\u003e\n\u003cp\u003eI get a good look at Ben, who stands there, looking so helpless and afraid, holding a gun he barely seems to know how to use. He seems absolutely terrified.\u003c/p\u003e\n\u003cp\u003eI want to comfort him. To tell him everything will be OK, that we\u0027ll be back soon. But as I turn away and look up at the vast mountain range before us, for the first time, I am not so sure that we will. \u003c/p\u003e","sourceLink":"https://allnovel.net/arena-two/page-1.html","bookId":1692,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
