{"id":64524,"no":3,"title":"Page 3","content":"\u003cp\u003e\"LOWER YOUR WEAPON!\" Rupert screams. \"NOW!\"\u003c/p\u003e\n\u003cp\u003eLogan stands a few feet away, pistol raised, aiming it right past my head. He holds it in place, and I can see him deliberating whether to take a head shot on this man. I see he wants to, but he\u0027s worried about hitting me.\u003c/p\u003e\n\u003cp\u003eI realize now how stupid I was to pick up this person. Logan had been right all along. I should have listened. Rupert was just using us all along, wanting to take our boat and food and supplies and have it all to himself. He is completely desperate. I realize in a flash that he will surely kill me. I have no doubt about it.\u003c/p\u003e\n\u003cp\u003e\"Take the shot!\" I scream out to Logan. \"Do it!\"\u003c/p\u003e\n\u003cp\u003eI trust Logan - I know he is a great shot. But Rupert holds me tight, and I see Logan wavering, unsure. It is in that moment that I see in Logan\u0027s eyes how scared he is of losing me. He does care, after all. He really does.\u003c/p\u003e\n\u003cp\u003eSlowly, Logan holds out his gun with an open palm, then gently places it down in the snow. My heart sinks.\u003c/p\u003e\n\u003cp\u003e\"Let her go!\" he commands.\u003c/p\u003e\n\u003cp\u003e\"The food!\" Rupert yells back, his breath hot in my ears. \"Those sacks! Bring them to me! Now!\"\u003c/p\u003e\n\u003cp\u003eLogan slowly walks to the back of the truck, reaches in, takes out the four heavy sacks, and walks towards the man.\u003c/p\u003e\n\u003cp\u003e\"Place them on the ground!\" Rupert yells. \"Slowly!\"\u003c/p\u003e\n\u003cp\u003eSlowly, Logan places them down the ground.\u003c/p\u003e\n\u003cp\u003eIn the distance, I hear the whine of the slaverunners\u0027 engines, getting closer. I can\u0027t believe it, how stupid I was. Everything is falling apart, right before my eyes.\u003c/p\u003e\n\u003cp\u003eBree gets out of the truck.\u003c/p\u003e\n\u003cp\u003e\"Let my sister go!\" she screams at him.\u003c/p\u003e\n\u003cp\u003eThat is when I see the future unraveling before my eyes. I see what will happen. Rupert will slice my throat, then take Logan\u0027s gun and kill him and Bree. Then Ben and Rose. He will take our food and our boat and be gone.\u003c/p\u003e\n\u003cp\u003eHis killing me is one thing. But his harming Bree is another matter. That is something I cannot allow.\u003c/p\u003e\n\u003cp\u003eSuddenly, I snap. Images of my dad flash through my mind, of his toughness, of the hand-to-hand combat moves he drilled into me. Pressure points. Strikes. Locks. How to get out of almost anything. How to bring a man to his knees with a single finger. And how to get a knife off your throat.\u003c/p\u003e\n\u003cp\u003eI summon some ancient reflex, and let my body take over. I raise my inner elbow up six inches, and bring it straight back, aiming for his solar plexus.\u003c/p\u003e\n\u003cp\u003eI make sharp impact, right where I wanted to. His knife digs into my throat a bit more, scratching it, and it hurts.\u003c/p\u003e\n\u003cp\u003eBut the same time, I hear him gasp, and realize my strike worked.\u003c/p\u003e\n\u003cp\u003eI take a step forward, pull his arm away from my throat, and do a back kick, hitting him hard between the legs.\u003c/p\u003e\n\u003cp\u003eHe stumbles back a few feet, and collapses in the snow.\u003c/p\u003e\n\u003cp\u003eI breathe deep, gasping, my throat killing me. Logan dives for his gun.\u003c/p\u003e\n\u003cp\u003eI turn and see Rupert hit the ground running, racing for our boat. He takes three big steps and leaps right to the center of it. In the same motion, he reaches over and cuts the line holding the boat to shore. It all happens in the blink of an eye; I can\u0027t believe how quickly he moves.\u003c/p\u003e\n\u003cp\u003eBen stands there, dazed and confused, not knowing how to react. Rupert, on the other hand, doesn\u0027t hesitate: he leaps towards Ben and punches him hard across the face with his free hand.\u003c/p\u003e\n\u003cp\u003eBen stumbles and is knocked over, and before he can get up, Rupert grabs him from behind in a chokehold, and holds the knife to his throat.\u003c/p\u003e\n\u003cp\u003eHe turns and faces us, using Ben as a human shield. Inside the boat, Rose is cowering and screaming, and Penelope barks like crazy.\u003c/p\u003e\n\u003cp\u003e\"You shoot me and you take him out, too!\" Rupert screams.\u003c/p\u003e\n\u003cp\u003eLogan has his gun back, and he stands there, taking aim. But it is not an easy shot. The boat drifts farther from shore, a good fifteen yards away, bobbing wildly in the rough tide. Logan has about a two inch radius to take him out without killing Ben. Logan hesitates, and I can see he doesn\u0027t want to risk killing Ben, not even for our own survival. It is a redeeming quality.\u003c/p\u003e\n\u003cp\u003e\"The keys!\" Rupert yells at Ben.\u003c/p\u003e\n\u003cp\u003eBen, to his credit, has at least done something right: he must have hid the keys somewhere when he saw Rupert coming. Smart move.\u003c/p\u003e\n\u003cp\u003eIn the distance, I suddenly see the slaverunners come into view, as the whine of their engines grows louder. I feel a deepening sense of dread, of helplessness. I don\u0027t know what to do. Our boat is too far from shore to get to it now - and even if we could, Rupert might kill Ben in the process.\u003c/p\u003e\n\u003cp\u003ePenelope barks and jumps out of Rose\u0027s hands, race across the boat, and dig her teeth into Rupert\u0027s calf.\u003c/p\u003e\n\u003cp\u003eHe screams and momentarily lets go of Ben.\u003c/p\u003e\n\u003cp\u003eA gunshot rings out. Logan found his chance, and wasted no time.\u003c/p\u003e\n\u003cp\u003eIt is a clean shot, right between the eyes. Rupert stares back at us for a moment as the bullet enters his brain, wide-eyed. Then he slumps back, on the edge of the boat, as if sitting down, and falls over backwards, landing in the water with a splash.\u003c/p\u003e\n\u003cp\u003eIt is over.\u003c/p\u003e\n\u003cp\u003e\"Get our boat back to shore!\" Logan screams to Ben. \"NOW!\"\u003c/p\u003e\n\u003cp\u003eBen, still dazed, jumps into action. He fishes the keys out of his pocket, starts the boat, and steers it back toward shore. I grab two sacks of food and Logan grabs the others, and we throw them in the boat as it touches shore. I grab Bree and hoist her into the boat, then run back to the truck. Logan grabs my sacks of salvaged supplies, and I grab Sasha. Then, remembering, I run back to the truck and grab Rupert\u0027s bow and arrows. The last one in, I jump from the shore into the boat, as it starts to drift away. Logan takes over the wheel, hits the throttle and guns it, steering us out of the small channel.\u003c/p\u003e\n\u003cp\u003eWe race towards the entrance to the Hudson, a few hundred yards ahead of us. On the horizon, the slaverunners\u0027 boat - sleek, black, menacing - races towards us, maybe half a mile away. It\u0027s going to be tight. It looks like we\u0027ll barely get out of the channel in time, and barely have a chance to make a run for it. They\u0027ll be right behind us.\u003c/p\u003e\n\u003cp\u003eWe burst out into the Hudson just as it\u0027s getting dark and as we do, the slaverunners come into full view. They are barely a hundred yards behind us, and closing in fast. Behind them, on the horizon, I also spot the other boat, though that is still a good mile away.\u003c/p\u003e\n\u003cp\u003eI\u0027m sure that if we had more time, Logan would say I told you so. And he would be right.\u003c/p\u003e\n\u003cp\u003eJust as I\u0027m thinking these thoughts, suddenly, gunshots ring out. Bullets whiz by us, one impacting the side of our boat, shattering wood. Rose and Bree scream out.\u003c/p\u003e\n\u003cp\u003e\"Get down!\" I scream.\u003c/p\u003e\n\u003cp\u003eI lunge to Bree and Rose, grab them and throw them down to the ground. Logan, to his credit, doesn\u0027t flinch, and continues to drive the boat. He swerves a little but doesn\u0027t lose control. He crouches down low as he steers, trying to avoid bullets as he also tries to avoid the large chunks of ice beginning to form.\u003c/p\u003e\n\u003cp\u003eI take a knee in the back of the boat, raising my head only as high as I need to, and take aim, military style, with my handgun. I aim for the driver, and fire several shots.\u003c/p\u003e\n\u003cp\u003eThey all miss, but I do manage to get their boat to swerve.\u003c/p\u003e\n\u003cp\u003e\"Take the wheel!\" Logan yells to Ben.\u003c/p\u003e\n\u003cp\u003eBen, to his credit, doesn\u0027t hesitate. He hurries forward and takes the wheel; the boat swerves as he does.\u003c/p\u003e\n\u003cp\u003eLogan then hurries to my side, taking a knee beside me.\u003c/p\u003e\n\u003cp\u003eHe fires and his bullets just miss, grazing off their boat. They return fire, and a bullet misses my head by inches. They\u0027re closing in fast.\u003c/p\u003e\n\u003cp\u003eAnother bullet shatters a large chunk of wood off the back of our boat.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re going for our gas tank!\" Logan screams out. \"Go for theirs!\"\u003c/p\u003e\n\u003cp\u003e\"Where is it?\" I scream out over the roar of the engine and flying bullets.\u003c/p\u003e\n\u003cp\u003e\"In the back of their boat, on the left side!\" he yells.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t get a clean shot at it,\" I say. \"Not while they\u0027re facing us.\"\u003c/p\u003e\n\u003cp\u003eSuddenly, I have an idea.\u003c/p\u003e\n\u003cp\u003e\"Ben!\" I scream out. \"You need to make them turn. We need a clean shot at the gas tank!\"\u003c/p\u003e\n\u003cp\u003eBen doesn\u0027t hesitate; I\u0027ve barely finished speaking the words when he turns hard on the wheel, the force of it throwing me sideways in the boat.\u003c/p\u003e\n\u003cp\u003eThe slaverunners turn, too, trying to follow us. And that exposes the side of their boat.\u003c/p\u003e\n\u003cp\u003eI take a knee, as does Logan, and we fire several times.\u003c/p\u003e\n\u003cp\u003eAt first, our barrage of fire misses.\u003c/p\u003e\n\u003cp\u003eCome on. Come on!\u003c/p\u003e\n\u003cp\u003eI think of my dad. I steady my wrist, breathe deep, and take one more shot.\u003c/p\u003e\n\u003cp\u003eTo my surprise, I land a direct hit.\u003c/p\u003e\n\u003cp\u003eThe slaverunners\u0027 boat suddenly explodes. The half dozen slaverunners on it burst into flames, shrieking as the boat speeds out of control. Seconds later, it smashes head on into the shoreline.\u003c/p\u003e\n\u003cp\u003eAnother huge explosion. Their boat sinks quickly, and if anyone survived, they are surely drowning in the Hudson.\u003c/p\u003e\n\u003cp\u003eBen turns us back upriver, keeping us going straight; slowly, I rise and take a deep breath. I can hardly believe it. We killed them.\u003c/p\u003e\n\u003cp\u003e\"Nice shot,\" Logan says.\u003c/p\u003e\n\u003cp\u003eBut it\u0027s not time to rest on our laurels. On the horizon, closing in, is another boat. I doubt we\u0027ll be so lucky a second time.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m out of ammo,\" I say.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m almost out, too,\" Logan says.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t confront the next boat,\" I say. \"And we\u0027re not fast enough to outrun them.\"\u003c/p\u003e\n\u003cp\u003e\"What do you suggest?\" he asks.\u003c/p\u003e\n\u003cp\u003e\"We have to hide.\"\u003c/p\u003e\n\u003cp\u003eI turn to Ben.\u003c/p\u003e\n\u003cp\u003e\"Find us shelter. Do it now. We have to hide this boat. NOW!\"\u003c/p\u003e\n\u003cp\u003eBen guns it and I run up to the front, standing beside him, scanning the river for any possible hiding spot. Maybe, if we\u0027re lucky, they\u0027ll zoom right past us.\u003c/p\u003e\n\u003cp\u003eThen again, maybe not. \u003c/p\u003e","sourceLink":"https://allnovel.net/arena-two/page-3.html","bookId":1692,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
