{"id":109981,"no":1,"title":"Page 1","content":"\u003cp\u003eINTRODUCTION\u003c/p\u003e\n\u003cp\u003eI\u0027VE ALWAYS BEEN FASCINATED BY spiders. I used to collect them when I was younger. I\u0027d spend hours rooting through the dusty old shed at the bottom of our garden, hunting the cobwebs for lurking eight-legged predators. When I found one, I\u0027d bring it in and let it loose in my bedroom.\u003c/p\u003e\n\u003cp\u003eIt used to drive my mom crazy!\u003c/p\u003e\n\u003cp\u003eUsually, the spider would slip away after no more than a day or two, never to be seen again, but sometimes they hung around longer. I had one who made a cobweb above my bed and stood guard for almost a month. Going to sleep, I used to imagine the spider creeping down, crawling into my mouth, sliding down my throat, and laying loads of eggs in my belly. The baby spiders would hatch after a while and eat me alive, from the inside out.\u003c/p\u003e\n\u003cp\u003eI loved being scared when I was little.\u003c/p\u003e\n\u003cp\u003eWhen I was nine, my mom and dad gave me a small tarantula. It wasn\u0027t poisonous or very big, but it was the greatest gift I\u0027d ever received. I played with that spider almost every waking hour of the day. Gave it all sorts of treats: flies and cockroaches and tiny worms. Spoiled it rotten.\u003c/p\u003e\n\u003cp\u003eThen, one day, I did something stupid. I\u0027d been watching a cartoon in which one of the characters was sucked up by a vacuum cleaner. No harm came to him. He squeezed out of the bag, dusty and dirty and mad as hell. It was very funny.\u003c/p\u003e\n\u003cp\u003eSo funny, I tried it myself. With the tarantula.\u003c/p\u003e\n\u003cp\u003eNeedless to say, things didn\u0027t happen quite like they did in the cartoon. The spider was ripped to pieces. I cried a lot, but it was too late for tears. My pet was dead, it was my fault, and there was nothing I could do about it.\u003c/p\u003e\n\u003cp\u003eMy parents practically hollered the roof down when they found out what I\u0027d done - the tarantula had cost quite a lot of money. They said I was irresponsible, and from that day on they never again let me have a pet, not even an ordinary garden spider.\u003c/p\u003e\n\u003cp\u003eI started with that tale from the past for two reasons. One will become obvious as this book unfolds. The other reason is:\u003c/p\u003e\n\u003cp\u003eThis is a true story.\u003c/p\u003e\n\u003cp\u003eI don\u0027t expect you to believe me - I wouldn\u0027t believe it myself if I hadn\u0027t lived it - but it is. Everything I describe in this book happened, just as I tell it.\u003c/p\u003e\n\u003cp\u003eThe thing about real life is, when you do something stupid, it normally costs you. In books, the heroes can make as many mistakes as they like. It doesn\u0027t matter what they do, because everything works out in the end. They\u0027ll beat the bad guys and put things right and everything ends up cool.\u003c/p\u003e\n\u003cp\u003eIn real life, vacuum cleaners kill spiders. If you cross a busy road without looking, you get whacked by a car. If you fall out of a tree, you break some bones.\u003c/p\u003e\n\u003cp\u003eReal life\u0027s nasty. It\u0027s cruel. It doesn\u0027t care about heroes and happy endings and the way things should be. In real life, bad things happen. People die. Fights are lost. Evil often wins.\u003c/p\u003e\n\u003cp\u003eI just wanted to make that clear before I began.\u003c/p\u003e\n\u003cp\u003eOne more thing: my name isn\u0027t really Darren Shan. Everything\u0027s true in this book, except for names. I\u0027ve had to change them because... well, by the time you get to the end, you\u0027ll understand.\u003c/p\u003e\n\u003cp\u003eI haven\u0027t used any real names, not mine, my sister\u0027s, my friends, or teachers. Nobody\u0027s. I\u0027m not even going to tell you the name of my town or country. I don\u0027t dare.\u003c/p\u003e\n\u003cp\u003eAnyway, that\u0027s enough of an introduction. If you\u0027re ready, let\u0027s begin. If this were a made-up story, it would begin at night, with a storm blowing and owls hooting and rattling noises under the bed. But this is a real story, so I have to begin where it really started.\u003c/p\u003e\n\u003cp\u003eIt started in a toilet. \u003c/p\u003e","sourceLink":"https://allnovel.net/cirque-du-freak-the-saga-of-darren-shan-1/page-1.html","bookId":1570,"creation":"Oct 5, 2019 11:49:54 PM","modification":"Oct 5, 2019 11:49:54 PM"}
