{"id":64364,"no":31,"title":"Page 31","content":"\u003cp\u003e“I’m so sorry.”\u003c/p\u003e\n\u003cp\u003eI gave a little shrug. The idea of someone pitying me where my father was concerned made me uncomfortable. I was the least of his victims…\u003c/p\u003e\n\u003cp\u003e“Sven, I have something to tell you,” I said, wanting to get it off my chest.\u003c/p\u003e\n\u003cp\u003eHe just nodded at me to go on.\u003c/p\u003e\n\u003cp\u003e“Our father killed my mother. That was why I ran away. I didn’t know about you, and I didn’t know about your mother, or I would have tried to warn you both. Your mother contacted me shortly before she died. She left before I could tell her, and then I couldn’t get ahold of her. I wanted to warn her about just what he was capable of. I wasn’t successful, and I feel responsible.”\u003c/p\u003e\n\u003cp\u003eThis time his hand covered mine. “You shouldn’t. Even if my mother had known about yours, she would’ve stayed. I doubt anything could have made her leave, so don’t put that on yourself. All of this falls squarely on his shoulders. All that we can hope for is that they’ll find the bastard, and lock him up for good.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-THREE\u003c/p\u003e\n\u003cp\u003eMr. Uncivilized\u003c/p\u003e\n\u003cp\u003eI stayed much longer than I’d planned to. I hadn’t expected us to have so much to say to each other. I’d thought it would be awkward, and brief, and likely pointless. I had not expected this feeling of kinship. We instantly had some kind of a bond that I didn’t understand, but I knew without a doubt that we would be seeing more of each other.\u003c/p\u003e\n\u003cp\u003eI had been so deprived of all blood ties for so long that it was a revelation to me that this tie could actually mean something. Sven and I had certain things in common that no one else did, and that no one else could. There was something here worth cultivating. I hadn’t seen that coming.\u003c/p\u003e\n\u003cp\u003e“So what do you do here in New York?” I asked him. We had been working backwards towards small talk, starting with the really heavy stuff.\u003c/p\u003e\n\u003cp\u003eHe smiled a self-deprecating smile. “Stockbroker. I do okay at it, though I acknowledge that my occupation means I got at least some of the family gambling gene. In my defense, though, New York gambling is a lot less destructive than Vegas gambling. I guess we all say that until we lose big. And you’re a flight attendant. I confess, I’ve read everything about you that I could get my hands on. I’m curious by nature.”\u003c/p\u003e\n\u003cp\u003eThat made me visibly flinch.\u003c/p\u003e\n\u003cp\u003eHe held up his hands in a sign of peace. “I know most of it’s garbage, but the long lost sibling thing always got to me. I have so little family that it’s always felt like something was missing. I just wanted to see you—to see pictures of you, and get an idea how you were doing. Though I have to admit, some of those pictures made me blush.”\u003c/p\u003e\n\u003cp\u003eI blushed just thinking of it. The first picture that popped into my mind was me in that see-through slip on the cover of a magazine. I had little hope that he hadn’t seen that one.\u003c/p\u003e\n\u003cp\u003e“How did you get my number?” I asked.\u003c/p\u003e\n\u003cp\u003e“My mother sent it to me. She said that she happened to run into one of your co-workers and talked them into giving it to her. I have no idea who or how.”\u003c/p\u003e\n\u003cp\u003e“I might need to get a new number soon. A few media sources have gotten ahold of it. I’ll let you know when it changes.”\u003c/p\u003e\n\u003cp\u003eHe inclined his head. “I appreciate it.”\u003c/p\u003e\n\u003cp\u003e“And I won’t be a flight attendant for much longer. My company filed for bankruptcy.”\u003c/p\u003e\n\u003cp\u003e“I heard about that. Sorry to hear it.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “I’m taking a voluntary furlough. I’m going to try to turn painting into a career.”\u003c/p\u003e\n\u003cp\u003e“Wow! That’s amazing! I’d love to see your work.”\u003c/p\u003e\n\u003cp\u003eI flushed. “I’m having a gallery showing in L.A. soon. I’ll make sure you get an invitation, though of course, I’ll understand if you can’t make it. It is across the country.”\u003c/p\u003e\n\u003cp\u003eHe waved that off. “I’ll be there. Just tell me when. That is such an accomplishment. I hear it’s near to impossible to get a showing.”\u003c/p\u003e\n\u003cp\u003eI flushed harder. “To be honest, my boyfriend played a big part there, but I’m still going to give it a shot.”\u003c/p\u003e\n\u003cp\u003e“James Cavendish,” he said.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“Well, let me know. I’m looking forward to seeing your work.” He sounded sincere.\u003c/p\u003e\n\u003cp\u003e“I will. It’s still being planned, but I’ll keep you posted.”\u003c/p\u003e\n\u003cp\u003e“I have a girlfriend,” he volunteered. “She’s very nice. It’s serious. Hopefully you can meet her sometime.”\u003c/p\u003e\n\u003cp\u003eI nodded. “That sounds nice. Maybe we can all have dinner sometime.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’d like that. She works odd hours—a lot of them, but I’m sure we can work something out.”\u003c/p\u003e\n\u003cp\u003e“What does she do?” I asked.\u003c/p\u003e\n\u003cp\u003e“She’s a model. I went to one of her shoots. It’s a strange sort of job, but she loves it.”\u003c/p\u003e\n\u003cp\u003eI smiled, reminded of my recent and similar experience. “I was just at a photo shoot for James. They are bizarre. I swear they had a team just for rubbing him down with oil.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Yeah, it is a strange business.”\u003c/p\u003e\n\u003cp\u003eHe looked at his phone suddenly, the first time he’d done so since we’d gotten there.\u003c/p\u003e\n\u003cp\u003e“That’s weird,” he muttered.\u003c/p\u003e\n\u003cp\u003e“What is it?” I asked.\u003c/p\u003e\n\u003cp\u003e“It’s from a co-worker of mine, asking where I am. Says my boss is looking for me, but I’m on my own time, so that’s out of line.” He began texting back.\u003c/p\u003e\n\u003cp\u003e“Did you tell him?” I asked, getting a sick feeling in my gut.\u003c/p\u003e\n\u003cp\u003eHe nodded. “It’s not his business, but I still don’t want to get on his bad side. It’s just bizarre for him to be looking for me on my own time. This isn’t like him at all.”\u003c/p\u003e\n\u003cp\u003eI’d left my phone at home, but no one should have even known I was gone. So why was I suddenly tense and worried?\u003c/p\u003e\n\u003cp\u003eI glanced around nervously. “I could be way off, but that might have something to do with my boyfriend. He’s extremely overprotective of me, since the attack.” I knew I was kidding myself with that statement. He’d likely be that way no matter what, with or without the attack as an excuse. It was his nature.\u003c/p\u003e\n\u003cp\u003e“What attack?” Sven asked, and I remembered that he didn’t know. The attack must not have made the headlines as what it actually was. They’d probably turned my being shipped off in an ambulance and hospitalized for a week into an overdose story, or God only knew what. I hadn’t wanted to check.\u003c/p\u003e\n\u003cp\u003e“It was our dad, over a month ago. He came to my house and attacked me. That was when I went to the police about what he’d done to my mother. The police and a team of private investigators have been looking for him ever since.”\u003c/p\u003e\n\u003cp\u003e“Even after all this time, he was still coming after you?”\u003c/p\u003e\n\u003cp\u003eI explained some of the events leading up to the attack, as far as I understood it, anyway.\u003c/p\u003e\n\u003cp\u003e“He saw me in the headlines. He saw that I was dating someone wealthy, and he thought that that would make me more likely to turn him in. The crazy part is, he was right, at least about some of it. I was getting ready to turn him in, though money had nothing to do with it.”\u003c/p\u003e\n\u003cp\u003eSven glanced around, looking a little nervous. “I’m surprised that he didn’t make you take security here with you, with the attack and all.”\u003c/p\u003e\n\u003cp\u003eI sighed. “I actually didn’t tell him I was coming. As far as he knows, I’m still asleep in bed.”\u003c/p\u003e\n\u003cp\u003e“Do you live together?” he asked.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003eHis eyes widened. “Yeah, I’m going to guess that he had something to do with my boss acting strange, then. Maybe I should walk you home before all hell breaks loose.”\u003c/p\u003e\n\u003cp\u003eI waved my half-empty cup of coffee. We’d spent a half hour talking before I’d finally grabbed a cup. “Sounds good. Let me just finish my coffee and we’ll go.”\u003c/p\u003e\n\u003cp\u003eI had nearly completed that goal when Sven’s expression froze. My back was to the entrance of the café, and he was facing it, so I knew right away who had just walked through the door.\u003c/p\u003e\n\u003cp\u003e“Looks like you weren’t way off about your boyfriend,” he said, his eyes staying glued to the door of the coffee house.\u003c/p\u003e\n\u003cp\u003eI took deep breaths, getting very nervous suddenly. I knew I should just get up and walk to the door. That would be the best thing I could do, as far as defusing the situation went. I told my body to do just that, but I was frozen in place, my body just waiting to see what James would do.\u003c/p\u003e\n\u003cp\u003eI didn’t turn to look at him, but I would’ve sworn I felt his presence behind me—his eyes on me. I felt his stillness as he just stood in that doorway, and then I felt him move, walking slowly across the crowded room. I knew it with a certainty when he was standing directly at my back.\u003c/p\u003e\n\u003cp\u003eSven seemed just as frozen, staring at the other man with wide eyes. It was a good minute before he tried to speak. “H—“ was all he got out.\u003c/p\u003e\n\u003cp\u003e“Not now, Sven Karlsson,” James said quietly. His tone was more menacing than I’d ever heard it. “You and I will talk later, but now is not a good time.”\u003c/p\u003e\n\u003cp\u003eA hand descended to cup the nape of my neck, oh so gently. That hand left me almost instantly, as though James had recoiled. That did nothing good for my peace of mind. My heart felt like it was trying to pound right out of my chest.\u003c/p\u003e\n\u003cp\u003e“Stand up, Bianca,” Mr. Cavendish said quietly. His voice was no less menacing for me. The Dom was driving him at that moment, no hint of his other side present.\u003c/p\u003e\n\u003cp\u003eI stood up, my body obeying that dangerous tone without hesitation.\u003c/p\u003e\n\u003cp\u003eJames gripped my arm very lightly, that spot just above my elbow, and led me from the café without another word.\u003c/p\u003e\n\u003cp\u003eI saw that our security was there in force as we passed them. My usual detail was there, sans Johnny, and Clark was at the car. He nodded politely, his face blank, as he opened the door for us.\u003c/p\u003e\n\u003cp\u003eJames handed me into the car. I scooted across the seat but he didn’t crowd me, staying as far away from me as possible on the long seat.\u003c/p\u003e\n\u003cp\u003eClark started driving the second the doors closed, leaving the rest of the bodyguards at the café.\u003c/p\u003e\n\u003cp\u003eI turned my head to watch them as we drove away. Apparently, they’d be walking back.\u003c/p\u003e\n\u003cp\u003eI took a deep breath. “James—“\u003c/p\u003e\n\u003cp\u003eHe held up a hand. “Not. Right. Now.”\u003c/p\u003e\n\u003cp\u003eThat shut me up. And if his words hadn’t, the look he shot me before he turned away again would have.\u003c/p\u003e\n\u003cp\u003eHis face was a stoic mask, but his eyes…they were uncivilized.\u003c/p\u003e\n\u003cp\u003eWhen we reached the underground garage entrance into the apartment, he handed me out of the car without a word, his touch light and brief.\u003c/p\u003e\n\u003cp\u003eHe only took my arm again once we reached our apartment, pulling me out of the elevator and directly to the stairs.\u003c/p\u003e\n\u003cp\u003eWe hadn’t taken the first step up the stairs when a commotion from the direction of the kitchen caught my attention.\u003c/p\u003e\n\u003cp\u003eStephan spilled around the corner, looking frantic. “Bee! Thank God! James had just about sent a search party out!”\u003c/p\u003e\n\u003cp\u003eHe moved towards us and James held up a hand.\u003c/p\u003e\n\u003cp\u003e“Not now,” James told him, sparing him a single glance.\u003c/p\u003e\n\u003cp\u003eThat look must have held something that alarmed Stephan, because he strode to us, looking resolute.\u003c/p\u003e\n\u003cp\u003e“I think you need to take a breather, James. You aren’t in any state to—“\u003c/p\u003e\n\u003cp\u003e“Don’t you dare,” James said in a dangerous voice, moving to meet the other man, dropping my arm in the process. \u003c/p\u003e","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-31.html","bookId":1928,"creation":"Oct 5, 2019 9:54:16 AM","modification":"Oct 5, 2019 9:54:16 AM"}
