{"id":64372,"no":39,"title":"Page 39","content":"\u003cp\u003eThe small room was empty for long moments before Jolene walked in and knelt on the floor in front of the bed.\u003c/p\u003e\n\u003cp\u003eShe was wearing a tiny black see-through slip that hung at her hips and didn’t cover a thing. I recognized that slip, or at least the style of it. It felt like a slap in the face to see that he’d had me wear something so similar to what she had worn for him. It wasn’t a good start, not that there was any way the horrid video could have had a good start.\u003c/p\u003e\n\u003cp\u003eShe knelt there, all of her glorious assets displayed, her pierced nipples jutting out for drawn-out moments before James joined her in the room. Someone, either the person who had released the video or the person whose site I was watching it on, had added snarky little comments to the video. Directly beneath Jolene, ‘HOTTEST FUCKING BITCH EVER!’ was scrawled in hot pink.\u003c/p\u003e\n\u003cp\u003eJames was shirtless, wearing just unbuttoned slacks. His body was ripped up and spectacular, though he was slightly thinner back then, his hair a little longer, the dirty blond strands tied back from his face.\u003c/p\u003e\n\u003cp\u003eHis face was a mask of cold indifference, only his dominant persona present that I could see. He said something to her and she bowed lower. There was no audio, aside from a particularly graphic rap song about being a pimp playing in the background, courtesy of the video’s editor.\u003c/p\u003e\n\u003cp\u003eHe pulled her up by the hair and led her the short distance to the bed. She kept her eyes downcast the entire time.\u003c/p\u003e\n\u003cp\u003eThe bed was designed vaguely like a smaller version of the beds that James had in his homes, with a sturdy frame and a top designed for bondage. This bed had bars lining the top. James tied her arms above her head with swift motions. I couldn’t make out his words, and he didn’t speak much, but when he did, Jolene shuddered in pleasure. She reminded me of a cat in heat, with her back arched and her wiggling body responding to his every movement. I hated to watch it, but I didn’t stop. I felt compelled to finish it, some part of me having to see if he showed her even a glimmer of the tenderness he showed me in our passionate moments.\u003c/p\u003e\n\u003cp\u003eHe stood behind her once she was secured. He pressed against her, and had to bend down far to say something into her ear. I thought pettily to myself that she was too short for him. The height difference looked ridiculous. She barely came to his chest.\u003c/p\u003e\n\u003cp\u003eShe shuddered and he moved away. He walked out of the room without looking back, returning after a brief time with an object clutched in one hand.\u003c/p\u003e\n\u003cp\u003eIt was a cat o’ nine, with long tails that were tipped with small silver balls. It looked brutal, and it wasn’t anything he’d ever used on me. He said something to her just before he began to work her over.\u003c/p\u003e\n\u003cp\u003eFrom the first strike, the music in the video changed to ‘Smack My Bitch Up’. Whoever had edited the video seemed to have enjoyed themselves.\u003c/p\u003e\n\u003cp\u003eHe worked her over thoroughly, showing no mercy. She kept her head bent forward, her eyes downcast the entire time. She seemed like a different person than the Jolene that I’d been subjected to.\u003c/p\u003e\n\u003cp\u003eHer body writhed, her big breasts quivering with every hard strike. The flesh of her butt and thighs was crisscrossed with pink welts by the time he let up.\u003c/p\u003e\n\u003cp\u003eI felt like I was watching in slow motion as he dropped the whip and began to unbutton his pants. My hands fisted, my nails digging hard into my palms. This was going to hurt me to watch. Still, I couldn’t look away.\u003c/p\u003e\n\u003cp\u003eHe pulled his thick erection free.\u003c/p\u003e\n\u003cp\u003e‘HOLY HUGE DICK!’ scrolled along the bottom of the screen.\u003c/p\u003e\n\u003cp\u003eI despised with a passion whoever had edited the thing.\u003c/p\u003e\n\u003cp\u003eI thought I might be ill as he stroked himself, standing just behind her.\u003c/p\u003e\n\u003cp\u003eHe pulled a condom out of his pocket, ripping it open and rolling it on with smooth, practiced motions.\u003c/p\u003e\n\u003cp\u003eHe poised himself behind her, his huge arousal looking even bigger against her petite form. I knew it was totally irrational, but God, I hated her.\u003c/p\u003e\n\u003cp\u003eMy hand covered my mouth as he drove into her. I’d known before I turned it on that it would be bad for my heart to watch it, but I had the thought again.\u003c/p\u003e\n\u003cp\u003eHe fucked her so hard that it must have hurt, though I supposed that was the point. She shuddered as she came, and he pulled out of her, still hard, while those waves of pleasure still wracked her body.\u003c/p\u003e\n\u003cp\u003eHe turned her, and I realized that as hard as that had been to watch, it was about to get worse.\u003c/p\u003e\n\u003cp\u003eShe started to raise her eyes to him as he entered her then, but he said something and her eyes lowered again. I felt the fist around my heart loosen just a bit. There was no eye contact as he pounded into her from that angle. He fucked her hard until he had her shuttering again, and then again.\u003c/p\u003e\n\u003cp\u003eNew words scrolled along the bottom of the screen. ‘RICH, GORGEOUS, AND HE FUCKS LIKE A MACHINE. WHAT’S NOT TO LOVE?’\u003c/p\u003e\n\u003cp\u003eAgain, I had some nasty thoughts about the editor.\u003c/p\u003e\n\u003cp\u003eHe pulled out of her roughly, and I saw his cock twitching inside of that tight rubber with his own release. Unfortunately, the video was good enough that I could make out every detail, even the tip of the condom filling with cum.\u003c/p\u003e\n\u003cp\u003eAt least he hadn’t come inside of her. And at least he’d worn that rubber. I knew it was ridiculous to feel possessive of a body that I hadn’t even known at the time of the video, but knowing didn’t change the feeling.\u003c/p\u003e\n\u003cp\u003eHe left her tied to the bed and strode from the room. When he came back in, he was fully dressed in a suit.\u003c/p\u003e\n\u003cp\u003eIt didn’t look like they said another word to each other, and she never once raised her eyes to him as he untied her and she lay down on the bed. She was curling her body around a pillow as he strode from the room. He never looked back.\u003c/p\u003e\n\u003cp\u003eMy heart was pounding as the video ended. It had hurt to watch it, but I felt like I’d learned something important. It was a fact that James had been a slut before he’d met me. As much as the images in the video had bothered me, there wasn’t an instant of their interaction where he’d shared anything but his body and his cold domination with her. There had been nothing that I would have called intimacy between the two of them.\u003c/p\u003e\n\u003cp\u003eHe’d told me once that sex had just been a bodily function for him before he’d met me, and I’d just seen the proof of it. I knew it was perverse, but I felt both sick and relieved at the same time.\u003c/p\u003e\n\u003cp\u003eA movement out of the corner of my eye caught my attention. I turned to look.\u003c/p\u003e\n\u003cp\u003eJames stood in the doorway.\u003c/p\u003e\n\u003cp\u003eHis face was stricken—his eyes bleak, as he looked at the computer screen. I wondered how long he’d been there, but obviously it had been long enough to see what I was watching.\u003c/p\u003e\n\u003cp\u003eToo late, I closed out the window of that horrid video.\u003c/p\u003e\n\u003cp\u003eI looked back at him, but he wasn’t looking at me. His eyes were glazed and unseeing, still glued to the computer. He took a step back and closed the door behind him, leaving me alone in the room.\u003c/p\u003e\n\u003cp\u003eI just sat there for a few minutes, my mind still processing what I’d seen. I needed a minute to compose myself before we spoke about it, if there was even anything to say.\u003c/p\u003e\n\u003cp\u003eSo he’d had sex with that horrible woman, probably too many times to count. Watching it had at least given me some clarity. James at his angriest, at his coldest, at his most furious, had never been to me what he was to Jolene. They had been a Dom and a sub letting off steam, nothing else.\u003c/p\u003e\n\u003cp\u003eAlthough I hadn’t realized it at the time, James had always been different with me. Looking back on it now, James had shown me a profound tenderness and love that belonged only to me, from our very first time together. I realized that I needed to value that more, because it was more precious of a gift than I’d allowed myself to see. He was my Dom, and I was his sub, but our love had turned it into so much more than what I’d seen on that video. Yes, James had been a hedonist and a slut before I’d met him, but I saw now that I’d been his first lover. He’d changed his rules for me. He bended for me constantly. Because he loved me.\u003c/p\u003e\n\u003cp\u003eI sat and brooded for maybe ten minutes before I got up and followed him.\u003c/p\u003e\n\u003cp\u003eI thought I’d find him in our bedroom. It was empty. I found my phone and called him. He didn’t answer. I searched the huge apartment for him, even venturing tentatively onto the fourth floor in my efforts.\u003c/p\u003e\n\u003cp\u003eI finally resorted to calling Blake.\u003c/p\u003e\n\u003cp\u003e“Ms. Karlsson,” she answered promptly.\u003c/p\u003e\n\u003cp\u003e“Blake, do you know where James is? Did he leave the apartment?”\u003c/p\u003e\n\u003cp\u003e“Yes, Ma’am. He left just a few minutes after he’d arrived.”\u003c/p\u003e\n\u003cp\u003e“Do you know where he went?”\u003c/p\u003e\n\u003cp\u003e“No…”\u003c/p\u003e\n\u003cp\u003e“Can you find out?” I asked, starting to panic a little.\u003c/p\u003e\n\u003cp\u003eI wanted to see him. I didn’t want him thinking the worst about my reaction to watching that video, as I knew he would.\u003c/p\u003e\n\u003cp\u003e“I’ll make some calls, Ms. Karlsson.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I said.\u003c/p\u003e\n\u003cp\u003eShe hung up.\u003c/p\u003e\n\u003cp\u003eShe called back about ten minutes later. “I couldn’t locate him, Ms. Karlsson. Clark isn’t picking up, and he’s the only one with Mr. Cavendish. The only answer I could get from the others is that he went out.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY\u003c/p\u003e\n\u003cp\u003eMr. Kinky\u003c/p\u003e\n\u003cp\u003eI tried to just wait after that, but I was restless and worried. I had no clue where he could have gone. I didn’t know where he’d go if he was going out and upset. It was only two in the afternoon. Had he just gone back to work? I hadn’t a clue.\u003c/p\u003e\n\u003cp\u003eI tried hard just to wait patiently for him to return. I tried to paint, but it was no good. I tried to watch TV, but I was hopelessly distracted. I called Stephan, who was in Vegas with Javier, but he hadn’t heard from James. I told him what had happened.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asked. “Do you want to talk about it?”\u003c/p\u003e\n\u003cp\u003eOf course my feelings would be his first concern, I thought.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I told him. “It sucked, but it’s not as though James has ever made a secret of his past. If anything, it made me see that what he did with those other women is not the same thing that we do. I’m worried about him, not me. The look in his eyes, Stephan… I feel like I broke his heart again. I need to find him.”\u003c/p\u003e\n\u003cp\u003eHe had no idea where James had gone either, but Stephan did what he did best. We talked for hours, about everything, but mostly about James, and I felt better when we said goodbye.\u003c/p\u003e\n\u003cp\u003eThat good feeling lasted only an hour when there was still no sign of James. It was almost seven p.m. when I got desperate.\u003c/p\u003e\n\u003cp\u003eI was wearing a small slip of a dress, sans bra. It was an ‘around the house in the hottest part of the summer’ kind of outfit. I took the time to put on a bra, and found some comfortable shoes that matched the sleeveless, off-white dress. I called Blake as I grabbed my bag. I was at the top of the stairs when she answered.\u003c/p\u003e\n\u003cp\u003e“I’m going out,” I told her before she could say a word.\u003c/p\u003e\n\u003cp\u003e“I’ll meet you at the elevator.”\u003c/p\u003e\n\u003cp\u003eAnd she was there, quick as a flash.\u003c/p\u003e\n\u003cp\u003eThe rest of the security was waiting in the lobby for us. They hadn’t replaced Johnny, and I was fine with that. I figured if this many people couldn’t protect me, it was a lost cause, anyway.\u003c/p\u003e\n\u003cp\u003eNo one asked me where we were going until we were all in the large black SUV that had been designated for my use.\u003c/p\u003e\n\u003cp\u003e“The Cavendish Hotel,” I said. It was only a guess on my part, but I could see him going to his office if he was upset.\u003c/p\u003e\n\u003cp\u003eSecurity escorted me to the office suites, and I thought I must have been right as I saw that his receptionist was still on duty. She nodded for me to enter his office, as though she’d been instructed just to let me in. \u003c/p\u003e","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-39.html","bookId":1928,"creation":"Oct 5, 2019 9:54:16 AM","modification":"Oct 5, 2019 9:54:16 AM"}
