{"id":64375,"no":42,"title":"Page 42","content":"\u003cp\u003eI knew that he was probably right.\u003c/p\u003e\n\u003cp\u003e“Do you mind if I go and check to see if he’s okay?” James asked.\u003c/p\u003e\n\u003cp\u003e“Not at all,” I reassured him, thinking that he was the sweetest, most thoughtful man in the world.\u003c/p\u003e\n\u003cp\u003eDanika approached me, looking more serious than she had for most of the night. Every time she had sought me out before, she had been beaming, ecstatic to give me the news of another sale.\u003c/p\u003e\n\u003cp\u003e“I’m sorry you had to hear that little exchange in the bathroom,” she said, meeting my eyes steadily.\u003c/p\u003e\n\u003cp\u003eI thought I must have blushed down to my toes. “I am so sorry about that.”\u003c/p\u003e\n\u003cp\u003eShe waved me off. “It was hardly your fault. You were just using the restroom. But I saw your shoes under the stall, and I wanted to explain myself. I probably sounded like a cold bitch.”\u003c/p\u003e\n\u003cp\u003eI stopped her, holding my hand up. “You didn’t. I understand completely. Sometimes protecting your heart is the only way to keep your sanity.”\u003c/p\u003e\n\u003cp\u003eShe nodded, her mouth firm. “Yes, exactly. I won’t get mixed up with him again, and I refuse to lead him on. When I was younger, and stupid, I thought that he was the most wonderful and exciting thing in the world. I fell crazy, stupid, jump off a cliff in love with him. It was like being in love with a tornado. And when he was done with me, I felt like I’d been in a tornado. It took me years to pick up all of the pieces he’d left me in, but I did it, and I won’t go back. These days I want stability in my life. I need it.”\u003c/p\u003e\n\u003cp\u003eI nodded. I could well understand that. When you’d been through hell, stability was heaven.\u003c/p\u003e\n\u003cp\u003eShe seemed to see that she’d made her point. She patted me on the shoulder and walked away.\u003c/p\u003e\n\u003cp\u003eBlake had come to hover near me when James had gone to find Tristan. As on top of things as ever, she was able to direct me to him, as well.\u003c/p\u003e\n\u003cp\u003eHe was outside, speaking to Frankie and Tristan in a private patio area. James had his back to the door, his hands in his pockets.\u003c/p\u003e\n\u003cp\u003eI approached the three of them tentatively, not wanting to intrude.\u003c/p\u003e\n\u003cp\u003eTristan was sucking on a cigarette like his life depended on it, his eyes wide on Frankie as she threw her arms in the air and spoke to him in a low voice, obviously giving him a piece of her mind. He’d taken off his tuxedo jacket and loosened his tie. The crisp white sleeves of his tux were rolled up to reveal tatted up forearms. He’d played well at being clean cut for a few hours, but his bad boy had obviously broken back out.\u003c/p\u003e\n\u003cp\u003eTristan saw me first. He exhaled. “Bianca, help me! Frankie is a little termagant. Please tell her that one cigarette is not going to kill me.”\u003c/p\u003e\n\u003cp\u003eJames turned to look at me, his eyes warm as they ran over me. He snagged my arm as I came into reach, pulling my back to his front and kissing the top of my head.\u003c/p\u003e\n\u003cp\u003eOne of Frankie’s tiny fingers poked into Tristan’s massive chest. “This is not about one cigarette. This is about having one short conversation with her, and picking up a habit you quit five years ago. You need to call your sponsor right this second!”\u003c/p\u003e\n\u003cp\u003eTristan rolled his eyes, taking another long drag of the cigarette. “You know, nagging can be a trigger.”\u003c/p\u003e\n\u003cp\u003e“This isn’t a joke,” she fumed, sounding as much worried as mad. “I’m worried about you. You’re acting strange, and the first thing you tried to do was slip away by yourself. The last thing you need to do is be alone right now.”\u003c/p\u003e\n\u003cp\u003e“I’m not on suicide watch, Frankie. I’m smoking one fucking cigarette and then I’ll go back in, k? If you’re that worried about me, maybe you and your girl should sleep with me tonight. I shouldn’t be alone in my big, huge, lonely bed.”\u003c/p\u003e\n\u003cp\u003eShe threw her hands in the air. “Like you have any trouble finding bodies to warm that bed.”\u003c/p\u003e\n\u003cp\u003e“You said it yourself. I’m in a vulnerable place right now, and I should be surrounded by people I love. So come sleep with me, Frankie.”\u003c/p\u003e\n\u003cp\u003eShe smacked him hard on the arm. “When is the ‘trying to get the lesbian to sleep with me’ bit going to get old? I would really love to know.”\u003c/p\u003e\n\u003cp\u003eHe grinned, flashing deep dimples at her. He was putting on a good tough guy show, but he still looked like he was hurting. “You aren’t ’the lesbian’, you’re my favorite lesbian. And I was only talking about cuddling. Your dirty mind did the rest.”\u003c/p\u003e\n\u003cp\u003eShe sighed, looking defeated. “Fine. I’ll come cuddle with you tonight if it means you won’t be alone. No hitting on my girlfriend, though.”\u003c/p\u003e\n\u003cp\u003eThey made a funny pair. The top of her head barely reached his chest, and she was clearly unimpressed that he towered over her and weighed at least twice as much as she did.\u003c/p\u003e\n\u003cp\u003eTristan finished his cigarette like it was the last one on earth, enjoying it to the last drag. He and Frankie headed back inside together, but James held me back from following them.\u003c/p\u003e\n\u003cp\u003eHe cupped my face, smiling down at me. “Since I have you alone, I wanted to tell you something; I’m really proud of you. You already know that I’m your biggest fan, but I just wanted you to know that tonight was a huge accomplishment. I know you have yourself convinced that I did all of this for you, but it’s just not true. I set up the meeting. That was all. The second Danika saw your work she was smitten, and you would have had this showing with or without a connection to me. Those paintings sold because people wanted them, and found value in them. You have a talent that brings me to my knees. Thank you for sharing it with the world.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I told him simply, feeling my eyes get just a touch moist. The damned man made me so emotional. And he had a way with words that got me every time. “I love you to distraction, James.”\u003c/p\u003e\n\u003cp\u003eHis eyes smiled into mine. “Yes. I love you like that. The world went from black and white and into color when I laid eyes on you, my love. There’ll be no going back.”\u003c/p\u003e\n\u003cp\u003eIt was such a perfect moment that I had to beat back those evil doubts in my mind that told me something this perfect just had to come to a short, bad end. Life can just be good, I told myself. This bad feeling is not a premonition. Nothing bad will happen to us. I’d had to tell this to myself a lot lately.\u003c/p\u003e\n\u003cp\u003eTowards the end of the evening, Tristan bought my largest landscape and a smaller still-life. Frankie bought a painting as well. It was a watercolor of the fat cat from my yard. She said she was going to put it up in her tattoo shop for the world to see. She even harassed James that he should give her the portrait of me that had inspired the tattoo on his back. He took it well, which told me he’d forgiven her for the tattoo on my back.\u003c/p\u003e\n\u003cp\u003eSven bought one of my small acrylic paintings of a desert flower.\u003c/p\u003e\n\u003cp\u003eI insisted repeatedly that he didn’t have to buy anything.\u003c/p\u003e\n\u003cp\u003e“I want to,” he told me firmly. “It would mean a lot to me to have something that you made hanging in my home, and I love this picture.”\u003c/p\u003e\n\u003cp\u003e“I’ll paint you something for free! You shouldn’t have to pay thirteen grand just for a reminder. It’s not too late to change your mind.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No. This is perfect. Though, if you ever want to paint me something, I certainly won’t dissuade you!”\u003c/p\u003e\n\u003cp\u003eIt warmed me and embarrassed me a little that everyone was being so supportive.\u003c/p\u003e\n\u003cp\u003eAs the night grew to a close, I felt giddy with the realization that I’d actually enjoyed myself. The evening had far exceeded my expectations. My nerves hadn’t allowed me to look forward to the launch of my new career, but I loved that I could look back on my debut with relief and pleasure. It was over, and it had actually been a success.\u003c/p\u003e\n\u003cp\u003eThere was a small blemish on the evening, as we took our leave of the gallery.\u003c/p\u003e\n\u003cp\u003eThe gallery was a large three-story building, set up in a trendy area and situated adjacent to the Cavendish L.A. hotel and sharing a back parking lot with that property. We exited out of the front, where we had entered. A small red carpet had been set up outside for photo ops prior to the event. A fairly polite crowd of photographers had snapped shots of us going in. A larger crowd had gathered by the time we left, very late into the evening. I was surprised they’d waited so long. And even stranger to me was the crowd of bystanders gathered behind them, just watching for our departure.\u003c/p\u003e\n\u003cp\u003eJames maneuvered himself closer to the crowd, though there was a barricade that separated them. He threw an arm around my shoulders, his opposite hand moving to the diamond hoop attached to my choker.\u003c/p\u003e\n\u003cp\u003eWe had made it maybe six steps when there was a collective gasp from the crowd, and I turned just in time to see Blake jump a few inches into the air and catch a large plastic cup in her hand mid-air. The lid of the thing flew off, and dark soda and ice went flying in every direction, but it was still an impressive catch. It had been aimed at either James, myself, or both, but not even a drop of it reached us. Blake was drenched. She looked unperturbed about her own wet shirt and face. She threw the cup on the ground and scanned the crowd, a very hostile look on her face.\u003c/p\u003e\n\u003cp\u003eIt was as though the drink throwing had opened a floodgate. People began to shout lewd comments in our direction. I couldn’t make them all out, but the loudest comments seemed to be coming from women, and aimed at James.\u003c/p\u003e\n\u003cp\u003e“You are so fucking hot!” a woman shrieked.\u003c/p\u003e\n\u003cp\u003e“With a dick that huge, you can spank me anytime!” another one shouted.\u003c/p\u003e\n\u003cp\u003eIt was all so silly that a giggle escaped me as Clark ushered us into the limo. Blake followed us in.\u003c/p\u003e\n\u003cp\u003e“Good catch, Blake,” James said. “I’m giving you a raise for not letting a drop of that reach Bianca.”\u003c/p\u003e\n\u003cp\u003eShe nodded solemnly. “Just doing my job, sir.”\u003c/p\u003e\n\u003cp\u003eHer response sobered me up a little, because I began to think about just what her job was. If it had been a bullet instead of a drink, she probably would have done the same thing. I hated that. I didn’t want to get hurt, but the thought of someone being harmed in my place seemed even worse to me.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-TWO\u003c/p\u003e\n\u003cp\u003eMr. Matchmaker\u003c/p\u003e\n\u003cp\u003eI barely took a breath after my last flight before it was time for our trip to Japan. I was more excited than I’d ever been about a trip as we got ready. I’d traveled a lot for work, but always for short trips with short layovers, more work than play, and something as frivolous as two solid weeks of being a tourist was such a treat. James would have to work a little, he’d told me, since we were visiting his Tokyo property, but even he would be off work for the majority of the trip.\u003c/p\u003e\n\u003cp\u003eI knew it was a very long flight—we could be on the plane for up to fourteen hours, and that those hours would feel like days, but my mind was already in Tokyo as we boarded the jet.\u003c/p\u003e\n\u003cp\u003eJames was doing his usual control freak buckling me in thing when he informed me of a minor detour. “We’re going to go have lunch in Maui first,” he said, his tone idle.\u003c/p\u003e\n\u003cp\u003eMy brow furrowed. It seemed a little out of the way… “Maui?” I asked him.\u003c/p\u003e\n\u003cp\u003eHe shrugged and gave me his most charming smile. “I want you to guess why.”\u003c/p\u003e\n\u003cp\u003eThere was only one thing that made me think of Maui. “Something to do with Lana?” I guessed.\u003c/p\u003e\n\u003cp\u003eHe shrugged again. “I can’t help myself. It’s the first time she’s opened up about it. I set up a lunch with this Akira guy. I know I’m meddling, but somebody needs to do it.”\u003c/p\u003e\n\u003cp\u003eI studied him, and felt myself fall a little deeper. He had such a romantic soul. Just knowing him had made me more romantic. It was a contagious state of mind. “What do you plan to say to him?” \u003c/p\u003e","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-42.html","bookId":1928,"creation":"Oct 5, 2019 9:54:16 AM","modification":"Oct 5, 2019 9:54:16 AM"}
