{"id":64341,"no":8,"title":"Page 8","content":"\u003cp\u003eI cringed. I hadn’t thought that through. I’d started at maybe five a.m., forgetting there was even anyone else in the monstrosity of an apartment.\u003c/p\u003e\n\u003cp\u003eI set down my brush and opened the door, keeping my body hidden.\u003c/p\u003e\n\u003cp\u003eI was surprised to find Blake at the door, holding my phone, though I shouldn’t have been. I had just naturally assumed it would be either Marion or Stephan at the door, and I’d been hoping for Stephan. If anyone had to see me in a see-through nightie besides James, of course I’d pick Stephan.\u003c/p\u003e\n\u003cp\u003e“Ms. Karlsson. Mr. Cavendish would like a word. Please try to keep your phone on you, for security purposes,” she said, her face set in those painfully severe lines.\u003c/p\u003e\n\u003cp\u003eI just nodded and shut the door in her face. I wasn’t trying to be rude, but it was hard not to be, when I was a grown woman and she seemed to feel the need to tell me what to do.\u003c/p\u003e\n\u003cp\u003eI didn’t even have a chance to dial James before he was calling me.\u003c/p\u003e\n\u003cp\u003e“Hello, Mr. Cavendish,” I said into the phone.\u003c/p\u003e\n\u003cp\u003e“You’re painting,” he said in the warmest voice.\u003c/p\u003e\n\u003cp\u003e“Mmmhmm. How could you tell?”\u003c/p\u003e\n\u003cp\u003e“Just by the sound of your voice. It’s sort of dreamy and soft. I wish I were there. I love to watch you paint. I love to watch those dreams in your eyes.”\u003c/p\u003e\n\u003cp\u003eI shivered, adoring those romantic words and the low raspy cadence of his voice. “I wish you were here, too, though if you were, I’d be working on the nude.”\u003c/p\u003e\n\u003cp\u003e“I’ll pose tonight, if you like.”\u003c/p\u003e\n\u003cp\u003e“I like.”\u003c/p\u003e\n\u003cp\u003e“Mostly I called because I’m between meetings and I wanted to hear the sound of your voice, but also Lana is trying to get ahold of you. She is a ruthlessly persistent woman, and she made me agree to ask you to call her. She’s been trying, but you obviously forgot that you have a phone. Again.”\u003c/p\u003e\n\u003cp\u003e“I did,” I agreed. I could hardly deny it.\u003c/p\u003e\n\u003cp\u003eI heard him sigh heavily. “I need to go, but please keep your phone on you.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I said. I could tell by his tone that he needed to rush, so I kept it short. “I’ll see you tonight,” I told him softly.\u003c/p\u003e\n\u003cp\u003e“Yes, you will. Goodbye, Love.”\u003c/p\u003e\n\u003cp\u003eCHAPTER SIX\u003c/p\u003e\n\u003cp\u003eMr. Romantic\u003c/p\u003e\n\u003cp\u003eI was looking through my contact list, hoping that someone had added Lana’s number, when my phone began to ring in my hand. It was a strange New York area code, so I thought it must be her.\u003c/p\u003e\n\u003cp\u003eI answered right away. “Hello,” I said with a smile. I was looking forward to our lunch date.\u003c/p\u003e\n\u003cp\u003eA definitely male, definitely unfamiliar voice answered back. “Bianca Karlsson?”\u003c/p\u003e\n\u003cp\u003eI didn’t answer right away, confused and leery of someone unfamiliar having my number. Was it a tabloid? Was it part of the Cavendish army of security guards?\u003c/p\u003e\n\u003cp\u003e“This is she,” I said finally, keeping my voice cool and polite.\u003c/p\u003e\n\u003cp\u003eThe man cleared his throat on the other end. He was nervous. I was almost certain of it. Who was this?\u003c/p\u003e\n\u003cp\u003e“I’m sorry to bother you…I’m Sven. Sven Karlsson.”\u003c/p\u003e\n\u003cp\u003eMy heart felt like it froze in my chest when I heard my father’s name. My ears just sort of filled with white noise, and for a long time I just stood there, silently stunned.\u003c/p\u003e\n\u003cp\u003e“I’m your, um, half-brother. Sven Jr., I guess.”\u003c/p\u003e\n\u003cp\u003eI still couldn’t find any words to speak. I needed to sit down, but couldn’t make myself turn to look for a chair.\u003c/p\u003e\n\u003cp\u003eFinally he spoke again, “Sorry to bother you. I probably shouldn’t have called.” His voice sounded so forlorn that I suddenly found I could speak again.\u003c/p\u003e\n\u003cp\u003e“No, no, don’t be sorry. I just heard about your mother. I’m so sorry for your loss. I didn’t even know that you both existed until a few days ago.”\u003c/p\u003e\n\u003cp\u003e“Oh,” he said. “Well, I know this is strange, but I’d heard that you spend a lot of time in Manhattan. I live here, and I was wondering if we could just meet up for coffee sometime. I don’t have any family, and to be honest, I’ve wanted to meet you for a long time.”\u003c/p\u003e\n\u003cp\u003eHe had stunned me into silence again. This was the last thing I’d expected when I heard I had a half-brother. The thought of someone who was related to me by blood that would actually want to meet me was just so…foreign. I couldn’t say I loved the idea, but how could I refuse?\u003c/p\u003e\n\u003cp\u003e“Okay,” I agreed finally. “I’m not sure when I’ll be able to, though.”\u003c/p\u003e\n\u003cp\u003e“That’s fine. You can just get back to me on that. Whenever and wherever you’re comfortable with.”\u003c/p\u003e\n\u003cp\u003eHe seemed so…nice. When I’d thought of my father’s son, I’d just automatically thought of my father, but this man did not sound like that.\u003c/p\u003e\n\u003cp\u003e“Okay,” I said with more certainty. I wanted this, wanted to see this man who was a strange missing piece of my broken family. “I’ll do that. Perhaps in a week or two, on a Friday around lunchtime?”\u003c/p\u003e\n\u003cp\u003e“Sounds great. Just let me know. I can take a few hours whenever I need to, so last minute plans are fine with me, as well.”\u003c/p\u003e\n\u003cp\u003eWe said our awkward goodbyes, and I finally sprawled out on the studio’s white divan, trying to wrap my numb mind around the strange turn of events.\u003c/p\u003e\n\u003cp\u003eI was just starting to sit up, trying to do something other than just sit and think, when my phone rang in my hand.\u003c/p\u003e\n\u003cp\u003eIt was another strange New York number, and I just answered, really hoping it was Lana this time.\u003c/p\u003e\n\u003cp\u003e“Ha! I found you,” Lana said without preamble. “Come meet me at the Cavendish property, at the Light Café. James said he’d loan you to me for lunch, but only if we ate at his hotel. Have you noticed that your boyfriend’s kind of bossy?”\u003c/p\u003e\n\u003cp\u003eI laughed. “I have noticed that,” I said, my mood instantly lifting. Lunch with a fun girlfriend was just what I needed.\u003c/p\u003e\n\u003cp\u003eWe decided to meet at noon, ending the conversation quickly.\u003c/p\u003e\n\u003cp\u003eI showered quickly and dressed in a smart little gray pleated skirt paired with a high-necked light blue sleeveless silk blouse. Orange patent leather wedge sandals completed the ensemble. I used Jackie’s suggestion for the shoes, and again wasn’t sorry, though I never would have paired them together on my own.\u003c/p\u003e\n\u003cp\u003eI had noticed that the vanity now sported an entire section just for my jewelry. I’d been wary to even look at it, but knowing that I would probably be seeing James, since we were going to his hotel, and that not much would please him more, I peeked at what were obviously new additions to my jewelry collection.\u003c/p\u003e\n\u003cp\u003eI wore my collar, so I only looked at the earring selection. I noticed a small white box immediately, since it looked different from the rest. It was older, with more dated packaging, and a note on the top. I plucked that note up, feeling brave.\u003c/p\u003e\n\u003cp\u003eBianca, my love,\u003c/p\u003e\n\u003cp\u003eThese were my mother’s. Please take them. It will break my heart if you reject them.\u003c/p\u003e\n\u003cp\u003eJames\u003c/p\u003e\n\u003cp\u003eMy hand shook and my eyes filled with tears. With love and with guilt, because I would have rejected them, especially knowing that they were his mother’s, if it weren’t for that terribly romantic note. I opened the box with trembling hands.\u003c/p\u003e\n\u003cp\u003eInside sat large, princess cut, diamond studs surrounded by small sapphire baguettes. Or rather, that’s what I guessed the gemstones were.\u003c/p\u003e\n\u003cp\u003eI didn’t let myself think about it—didn’t let myself doubt. I just put the lovely things on, knowing that they were so much more than ungodly expensive earrings.\u003c/p\u003e\n\u003cp\u003eI brushed my drying hair behind my shoulders. They sparkled even through my hair, but I decided to clip one side back to showcase them more clearly.\u003c/p\u003e\n\u003cp\u003eI took more time than usual with my makeup, knowing that Lana would look model perfect, and that I’d be seeing James.\u003c/p\u003e\n\u003cp\u003eI knocked on Stephan and Javier’s door when I was ready to go.\u003c/p\u003e\n\u003cp\u003eStephan answered the door, wearing only his boxers and looking gorgeous. We smiled at each other. He pulled me into his chest in a warm hug, kissing the top of my head. I hugged him tightly back, burrowing into his chest. He smelled like family…and Javier, but I took that as a good sign.\u003c/p\u003e\n\u003cp\u003e“I’m going to lunch with Lana, this really nice lady, and a close friend of James’s that I met last week. You guys have a late night?” Clearly they had, since Javier was face down on the bed, out cold.\u003c/p\u003e\n\u003cp\u003eStephan chuckled. “You could say that. We went a little nuts with the car and driver.”\u003c/p\u003e\n\u003cp\u003eJavier made a very sexual sound from the bed, moving against the covers in a suggestive way.\u003c/p\u003e\n\u003cp\u003eI blushed.\u003c/p\u003e\n\u003cp\u003eStephan laughed. “He’s dreaming about me. Have fun, Bee. Love you.”\u003c/p\u003e\n\u003cp\u003e“Love you, too,” I said, beating a hasty retreat. The guys obviously needed their privacy.\u003c/p\u003e\n\u003cp\u003eLana was already waiting inside of the Light Café in the Cavendish hotel when I got there. She was seated in one of the well-spaced center tables, next to a huge, but strangely quiet, stone fountain. It was a huge dining room, with the top and three sides lined with windows, letting in an almost blinding amount of light. I had to put my shades back on as I entered the café.\u003c/p\u003e\n\u003cp\u003eThe decor was all gray stone and red detailing, as though little pieces of Red, which was next door, had bled into the restaurant.\u003c/p\u003e\n\u003cp\u003eShe stood and gave me a warm hug when I approached the table. She wore an ivory pencil skirt, with a white men’s dress shirt. It would have been very business-like attire, if not for her swimsuit model figure and her peep-toe crimson stilettos. Her jewelry was simple and gold, with hoops at her ears, and a plain band at her neck and wrist. All of the wealthy women I’d been introduced to of late seemed to wear less extravagant jewelry than I did. It was an alarming thought.\u003c/p\u003e\n\u003cp\u003eOut of the corner of my eye, I saw my security positioning themselves around the room.\u003c/p\u003e\n\u003cp\u003eWe sat.\u003c/p\u003e\n\u003cp\u003e“James is incorrigible. I swear he called the paparazzi on me! They were outside photographing me when I arrived. I usually don’t get paparazzi, unless of course I’m hanging out with James. I’m just too boring. But now they’re going to print a piece about how even the Middleton heiress prefers the Cavendish hotel, damn him.”\u003c/p\u003e\n\u003cp\u003eI laughed, because she was damning him with a genuinely fond smile on her face.\u003c/p\u003e\n\u003cp\u003eWe both ordered plain tea and water. Lana smiled at me. “We really could be sisters. So tell me, how is it going with James? You know he’s hopelessly in love with you, right?”\u003c/p\u003e\n\u003cp\u003eI blushed and swallowed. “He’s wonderful, but so overwhelming. I’m not the type to rush into anything, even if it’s something small, but he just doesn’t get it. I love being with him, but it’s been a roller-coaster.”\u003c/p\u003e\n\u003cp\u003e“That’s why you needed time apart. I get it,” she said, her voice rich with understanding and sympathy. “He was so sad that month, so…bereft. I’d never seen him like that before. I’m glad he got you back. He needs you, Bianca. Everyone should get to experience a love like that. That kind of love makes us better people.”\u003c/p\u003e\n\u003cp\u003eHer words made me think of the man she’d referred to briefly the first time we’d met. I still remembered the name, since it had held such meaning to her just at its utterance.\u003c/p\u003e\n\u003cp\u003eThe waitress returned just then to bring our drinks and take our orders. I got a turkey melt on wheat bread with sweet potato fries. I thought it was strange fair for such a posh café to have on the menu, but it sounded good to me.\u003c/p\u003e\n\u003cp\u003e“Tell me about Akira Kalua,” I said, because she’d promised me she would. \u003c/p\u003e","sourceLink":"https://allnovel.net/grounded-up-in-the-air-3/page-8.html","bookId":1928,"creation":"Oct 5, 2019 9:54:16 AM","modification":"Oct 5, 2019 9:54:16 AM"}
