{"id":69860,"no":33,"title":"Page 33","content":"\u003cp\u003e“Don’t mock me, man,” he says, getting up, going over to the mirror. He scratches at an imaginary mark on his chin, turns away.\u003c/p\u003e\n\u003cp\u003e“It’s no use,” I say suddenly.\u003c/p\u003e\n\u003cp\u003e“I’m too young,” he says. “Duh.”\u003c/p\u003e\n\u003cp\u003e“I can’t even remember when I met you,” I say, quietly, then I look up at him.\u003c/p\u003e\n\u003cp\u003e“What?” he asks, surprised. “You expect me to remember?” He drops the sheet and, nude, walks back to the toilet and sits down and takes a swig from the bottle of white wine. I notice a scar on the inside of his thigh and I reach out and touch his leg. He pulls back, takes a drag on the joint. My hand stays there, in space, and I bring it back, embarrassed.\u003c/p\u003e\n\u003cp\u003e“Would a smart person make fun of me for asking you what you’re thinking?”\u003c/p\u003e\n\u003cp\u003e“I have—” He stops, then slowly continues. “I have been thinking about how awful it was, losing my virginity.” He pauses. “I have been thinking about that all day.”\u003c/p\u003e\n\u003cp\u003e“It usually is when you lose it to a truck driver.” A long, hateful pause. I turn away. “That was stupid.” I want to touch him again but sip Chardonnay instead.\u003c/p\u003e\n\u003cp\u003e“What makes you so f**king perfect?” His eyes narrow, the jaw sets. He gets up, bends over, picks up the sheet, walks back into the bedroom. I get up out of the tub and dry off and, a little drunk, walk into the room, naked, holding the bottle of wine and my glass, and I get under the sheet with him. He turns channels. I do not know why he is here or where we met and he’s lying next to me, naked, gazing at videos.\u003c/p\u003e\n\u003cp\u003e“Does your husband know about this?” he asks, a tone of false amusement. “He says the divorce isn’t finalized. He says he’s not your ex.”\u003c/p\u003e\n\u003cp\u003eI don’t move, don’t answer, for a moment I don’t see Danny or anything else in the room.\u003c/p\u003e\n\u003cp\u003e“Well?”\u003c/p\u003e\n\u003cp\u003eI need another glass of wine but I force myself to wait a few minutes before I pour it. Another video. Danny hums along with it. I remember sitting in a car in the parking lot of the Galleria and William holding my hand.\u003c/p\u003e\n\u003cp\u003e“Does it matter?” I say once the video ends. I close my eyes, easily pretend that I’m not here. When I open them it’s darker in the room and I look over at Danny and he’s still staring at the TV. A photograph of L.A. at night is on the screen. A red streak flies over the neon landscape. The name of a local radio station appears.\u003c/p\u003e\n\u003cp\u003e“Do you like him?” Danny asks.\u003c/p\u003e\n\u003cp\u003e“No. I really don’t.” I sip the wine, easing toward tired. “Do you like … him?”\u003c/p\u003e\n\u003cp\u003e“Who? Your husband?”\u003c/p\u003e\n\u003cp\u003e“No,” I say. “Biff, Boff, Buff, whatever.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Do you like him?” I ask again. “More than me?”\u003c/p\u003e\n\u003cp\u003eDanny doesn’t say anything.\u003c/p\u003e\n\u003cp\u003e“You don’t have to answer immediately.” I could say this stronger but don’t. “As if you’re capable.”\u003c/p\u003e\n\u003cp\u003e“Don’t ask me this,” he says, his eyes a dull gray-blue, blank, half closed. “Just don’t ask me this. Don’t do this.”\u003c/p\u003e\n\u003cp\u003e“It’s just all so typical.” I’m giggling.\u003c/p\u003e\n\u003cp\u003e“What did Tarzan say when he saw the elephants coming over the hill?” he asks, yawning.\u003c/p\u003e\n\u003cp\u003e“What?” I’m still giggling, my eyes closed.\u003c/p\u003e\n\u003cp\u003e“Here come the elephants over the hill.”\u003c/p\u003e\n\u003cp\u003e“I think I’ve heard this one before.” I’m picturing Danny’s long tan fingers and then, less appealing, where his tan line stops, starts again, the thick unsmiling lips.\u003c/p\u003e\n\u003cp\u003e“What did Tarzan say when he saw the elephants come over the hill with raincoats on?” he asks.\u003c/p\u003e\n\u003cp\u003eI finish the wine and set the glass on the nightstand, next to an empty bottle. “What?”\u003c/p\u003e\n\u003cp\u003e“Here come the elephants over the hill wearing raincoats.” He waits for my response.\u003c/p\u003e\n\u003cp\u003e“He … did?” I ask, finally.\u003c/p\u003e\n\u003cp\u003e“What did Tarzan say when he saw the elephants come over the hill with sunglasses on?”\u003c/p\u003e\n\u003cp\u003e“I don’t think I really want to know this, Danny,” I say, my tongue thick, closing my eyes again, things clogged.\u003c/p\u003e\n\u003cp\u003e“Nothing,” Danny says lifelessly. “He didn’t recognize them.”\u003c/p\u003e\n\u003cp\u003e“Why are you telling me this?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Pause. “To keep me amused maybe.”\u003c/p\u003e\n\u003cp\u003e“What?” I say, drifting. “What did you say?”\u003c/p\u003e\n\u003cp\u003e“To keep me amused?”\u003c/p\u003e\n\u003cp\u003eI fall asleep next to him for a minute, then wake up but don’t open my eyes. My breathing steady, I feel the touch of two dry fingers trailing up my leg. I lie perfectly still, eyes closed, and he touches me, no heat in the touch, and then he climbs gently on top of me and I lie perfectly still but soon I have to open my eyes because I’m breathing too hard. The instant I do, he softens, rolls off. When I wake up in the middle of the night, he’s gone. His lighter, which looks like a small gold handgun, is on the nightstand next to the empty bottle of wine and the large glass and I remember that when he first showed it to me I thought he was actually going to fire it and when he didn’t I felt my life become an anticlimax and looking into his eyes, his gaze rendering everything inconsequential, pools incapable of remembering anything, I moved deeper into them until I was comfortable. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-informers/page-33.html","bookId":2685,"creation":"Oct 5, 2019 10:14:55 AM","modification":"Oct 5, 2019 10:14:55 AM"}
