{"id":69866,"no":39,"title":"Page 39","content":"\u003cp\u003e“I did it shaving—who the f**k cares? Just … get a doctor.”\u003c/p\u003e\n\u003cp\u003eAfter a while, Roger asks, “If it’s not bleeding anymore, does it matter?”\u003c/p\u003e\n\u003cp\u003e“But there was a lot of … blood, man.”\u003c/p\u003e\n\u003cp\u003e“But does it even hurt?” Roger asks. “Can you even feel it?”\u003c/p\u003e\n\u003cp\u003eA long pause, then, “No, um, not really.” I wait a minute before saying, “Sort of.”\u003c/p\u003e\n\u003cp\u003e“I’ll get you a doctor. Jesus.”\u003c/p\u003e\n\u003cp\u003e“And a maid. A vacuum. I need a … vacuum, man.”\u003c/p\u003e\n\u003cp\u003e“You are a vacuum, Bryan,” Roger says. I can hear giggling in the background, which Roger silences by hissing, then he tells me, “Your father keeps calling.” I can hear Roger lighting a cigarette. “For what it’s worth.”\u003c/p\u003e\n\u003cp\u003e“My fingers, um, Roger, won’t move.”\u003c/p\u003e\n\u003cp\u003e“Did you hear me or, like, what’s the bloody story?”\u003c/p\u003e\n\u003cp\u003e“What did he want? Is that what you want me to ask?” I sigh. “How did he know where I am?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Some emergency. Your mom’s in the hospital? I’m not sure. Who knows?”\u003c/p\u003e\n\u003cp\u003eI try to sit up, then with my left hand light a cigarette. When it becomes apparent to Roger that I’m not going to say anything else, Roger says, “I’ll give you three hours to get cleaned up. Do you need longer? I hope to holy Christ not, okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“And wear something with long sleeves,” Roger warns.\u003c/p\u003e\n\u003cp\u003e“What?” I ask, confused.\u003c/p\u003e\n\u003cp\u003e“Long sleeves, man. Wear long sleeves. Something poofy.”\u003c/p\u003e\n\u003cp\u003eI look down at my arms. “Why?”\u003c/p\u003e\n\u003cp\u003e“Multiple choice: (a) you look nice in long sleeves; (b) you have holes in your arms; (c) you have holes in your arms; (d) you have holes in your arms.”\u003c/p\u003e\n\u003cp\u003eA long pause that I finally break up by saying, “C?”\u003c/p\u003e\n\u003cp\u003e“Good,” Roger says, then hangs up.\u003c/p\u003e\n\u003cp\u003eA producer from Warner Brothers who is in Tokyo to meet with Japanese representatives from Sony is thirty and balding and has a face like a death mask and is wearing a kimono with tennis shoes, pacing languidly around his suite, smoking a joint, and it’s all really fab and to die over and Roger is flipping through Billboard, sitting on a giant unmade bed, and the producer has been on the phone forever and whenever he is put on hold he points at Roger and says, basically, “That minipony is really nifty,” and Roger, pleased that the producer has noticed the small tuft of hair, nods, turns around, shows the thing off.\u003c/p\u003e\n\u003cp\u003e“Like Adam Ant?” the producer asks.\u003c/p\u003e\n\u003cp\u003e“You bet.” Roger, who should be mortified, turns back to Billboard.\u003c/p\u003e\n\u003cp\u003e“Help yourself to sake.”\u003c/p\u003e\n\u003cp\u003eRoger leads me by the hand out to the balcony, where two Oriental girls, maybe fifteen, fourteen, sit at a table piled with plates of sushi and what looks like waffles.\u003c/p\u003e\n\u003cp\u003e“Wow,” I say. “Waffles.”\u003c/p\u003e\n\u003cp\u003e“Please don’t feel like you’re saying too much,” Roger says.\u003c/p\u003e\n\u003cp\u003e“Why don’t you just ignore me?” I plead.\u003c/p\u003e\n\u003cp\u003e“On second thought,” Roger says, making a terrible face, “why don’t you just sit this one out?”\u003c/p\u003e\n\u003cp\u003eOne of the Oriental girls is wearing pink satin underwear and no top and she’s the one I was with last night and the other girl, wearing a POLICE T-shirt, has a Walkman on and glazed eyes. The producer moves over to the balcony doors and is now talking to Manuel about having some deli but no pickles and it’s really fab. He clicks off, snaps his fingers as he sits down with a pained expression, motioning for the girl with pink satin underwear to cover herself. The girl, who has a heart of ice, stands up, walks slowly back into the room, turns the television on and falls to the floor with a thump.\u003c/p\u003e\n\u003cp\u003eThe producer sits next to the Oriental girl with the Walkman, sighs, takes a hit off the joint. He offers it to Roger, who shakes his head, then to me. Roger shakes his head for me too.\u003c/p\u003e\n\u003cp\u003e“Sake?” the producer asks. “It’s chilled.”\u003c/p\u003e\n\u003cp\u003e“Great,” Roger says.\u003c/p\u003e\n\u003cp\u003e“Bryan?” the producer asks.\u003c/p\u003e\n\u003cp\u003eRoger shakes his head again.\u003c/p\u003e\n\u003cp\u003e“Anybody feel the earthquake?” the producer asks, pouring the sake straight from the bottle into champagne glasses.\u003c/p\u003e\n\u003cp\u003e“Yeah, I did,” Roger says, lighting a cigarette. “Really terrifying,” and then, after glancing over at me, “Well, not so scary.”\u003c/p\u003e\n\u003cp\u003e“Don’t trust these f**king Japs,” the producer says. “I hope it got some of them.”\u003c/p\u003e\n\u003cp\u003e“Who does, man?” Roger sighs, nodding tiredly in agreement. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-informers/page-39.html","bookId":2685,"creation":"Oct 5, 2019 10:14:55 AM","modification":"Oct 5, 2019 10:14:55 AM"}
