{"id":69869,"no":42,"title":"Page 42","content":"\u003cp\u003eI hang up, pass out.\u003c/p\u003e\n\u003cp\u003eOn the way to the arena, sitting in the back of the limo, watching television, sumo wrestling, what could be an old Bruce Lee movie, the same commercial about a blue lemonade seven times, throwing ice cubes I’ve sucked on at the small square screen, I roll the glass partition down and tell the chauffeur I need a lot of cigarettes and the chauffeur reaches into the glove compartment, tosses back a pack of Marlboros, and cocaine I’d taken earlier isn’t doing much of anything, which I expected, and dismayingly it just seems to intensify the pain in my hand and I keep swallowing but residue keeps tickling the back of my throat in an insistent, annoying kind of way and I keep drinking Scotch which almost takes away the taste.\u003c/p\u003e\n\u003cp\u003eThe stage reeks of sweat and it’s a hundred degrees onstage and we have been playing for about fifty minutes and all I want to do is sing the last song, which the band, when I mention this in between breaks, thinks is a pretty bad idea. All the songs are from the last three solo albums but from the front row I can hear Orientals crying out in thick, r-less accents the names of big hits I played with the band and this band launches into the biggest hit off the second solo LP and I can’t really tell if the audience is enthused even when they applaud loudly and behind me a four-hundred-foot tapestry—BRYAN METRO WORLD TOUR 1984—billows in back of us and I’m moving slowly across the large expanse of stage, trying to peer out into the audience but bright blinding spotlights turn the arena into this moving mass of gray darkness and as I begin to sing the second verse of the song I forget the lyrics. I sing “Another night passes by and still you wonder what happened” and then I freeze. A guitarist suddenly jerks his head up and a bassist moves closer toward me, the drummer still keeping beat. I’m not even playing my guitar anymore. I start the second verse again: “Another night passes by and still you wonder what happened… ,” then nothing. The bassist yells out something. I turn my head toward him, my hands killing me, and the bassist urges “You give the world one more try” and I’m saying “What?” and the bassist calls out “You give the world one more try” and I’m saying “What?” and the bassist yells “You give the world one more try—Jesus” and I’m thinking to myself why in the hell would I sing this and then who the f**k wrote this piece of shit and I motion for the band to go into the chorus and we finish the song okay and there’s no encore.\u003c/p\u003e\n\u003cp\u003eRoger rides with me in the limo back to the hotel.\u003c/p\u003e\n\u003cp\u003e“Terrific show, Bryan.” Roger sighs. “Your concentration and showmanship really cannot be improved upon. I would be lying if I said they could. I’m all out of superlatives.”\u003c/p\u003e\n\u003cp\u003e“My hands are … fucked up.”\u003c/p\u003e\n\u003cp\u003e“Just the hands?” he says, not even really sarcastically, no edge in his voice, a muffled complaint maybe, an observation not worth making.\u003c/p\u003e\n\u003cp\u003e“We’ll just tell the promoters you had an uneven synth mix,” Roger says. “We’ll just tell people that your mother died.”\u003c/p\u003e\n\u003cp\u003eWe pass a crowded street diagonal to the hotel and everyone is trying to peer into the tinted windows as the limo rolls toward the Hilton.\u003c/p\u003e\n\u003cp\u003e“Jesus,” I’m mumbling to mvself. “All these f**king gooks. just look at them, Roger. just look at all these f**king gooks, Roger.”\u003c/p\u003e\n\u003cp\u003e“All those f**king gooks bought your last album,” Roger says, then adds, under his breath, “You brain-dead ass**le.”\u003c/p\u003e\n\u003cp\u003eI’m sighing, putting my sunglasses on. “I’d like to get out of this limo and tell these gooks what I think of them.”\u003c/p\u003e\n\u003cp\u003e“That’s not gonna happen, baby.”\u003c/p\u003e\n\u003cp\u003e“Why … not?”\u003c/p\u003e\n\u003cp\u003e“Because you aren’t presentable for direct contact with the public.”\u003c/p\u003e\n\u003cp\u003e“Think of all the words that rhyme with my name, Roger,” I say.\u003c/p\u003e\n\u003cp\u003e“Are there a lot?” Roger asks.\u003c/p\u003e\n\u003cp\u003eRoger and I are standing in an elevator.\u003c/p\u003e\n\u003cp\u003e“Get me a maid or something, okay?” I ask him. “My room is like a total wreck, man.”\u003c/p\u003e\n\u003cp\u003e“Clean it yourself.”\u003c/p\u003e\n\u003cp\u003e“No. Unh-uh.”\u003c/p\u003e\n\u003cp\u003e“I’ll move you, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“You’ve got the whole floor, you cadaver. Take your pick.”\u003c/p\u003e\n\u003cp\u003e“Why can’t you just get me a maid?”\u003c/p\u003e\n\u003cp\u003e“Because housekeeping at the Tokyo Hilton seems to think that you raped two of their maids. Is this true, Bryan?”\u003c/p\u003e\n\u003cp\u003e“Define, um, rape, Roger.”\u003c/p\u003e\n\u003cp\u003e“I’ll have room service send up a dictionary.” Roger makes a terrible face. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-informers/page-42.html","bookId":2685,"creation":"Oct 5, 2019 10:14:55 AM","modification":"Oct 5, 2019 10:14:55 AM"}
