{"id":69873,"no":46,"title":"Page 46","content":"\u003cp\u003eIn a dressing room at the arena before we are supposed to go on, I just sit in a chair in front of a huge oval mirror staring at my reflection through Wayfarers, at myself nibbling radishes. I start to kick my foot against the wall, my fists clenched. Roger walks in, sits down, lights a cigarette. After a while I say something.\u003c/p\u003e\n\u003cp\u003e“What?” Roger asks. “You’re mumbling.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to go out there.”\u003c/p\u003e\n\u003cp\u003e“Because why?” Roger asks as if speaking to a child.\u003c/p\u003e\n\u003cp\u003e“I don’t feel too good.” I stare at my reflection, uselessly.\u003c/p\u003e\n\u003cp\u003e“Don’t say that. You have a distinctly upbeat air about you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, and you’re gonna win Mr. Congeniality any f**king year now,” I growl, then, calmed down, “Get Reggie.”\u003c/p\u003e\n\u003cp\u003e“Get ready for what?” he asks and then, seeing that I am about to pounce on him, relents. “Just a joke.”\u003c/p\u003e\n\u003cp\u003eRoger makes a phone call, ten minutes later someone is wrapping something around my arm, a vein is slapped, pinpricks, vitamins, saying yeah, weird warmness rushing through me, flushing out the coldness, fast at first, then, more slowly, yeah, sure.\u003c/p\u003e\n\u003cp\u003eRoger sits back down on the couch and says, “Don’t beat up any more groupies, all right? Can you hear me? Lay off.”\u003c/p\u003e\n\u003cp\u003e“Oh man,” I say. “They … like … it. They like to pet me. I let them pet … me.”\u003c/p\u003e\n\u003cp\u003e“Just cool it. Do you hear me?”\u003c/p\u003e\n\u003cp\u003e“Oh man f**k you man I’ll do it again.”\u003c/p\u003e\n\u003cp\u003e“What did you say to me?”\u003c/p\u003e\n\u003cp\u003e“Man, I’m Bryan—”\u003c/p\u003e\n\u003cp\u003e“I know who you are,” Roger cuts me off. “You’re the same awful ass**le who beat up three girls on the last tour, threatened one with a carving knife. These are girls we are still paying off. Do you remember that bitch from Missouri?”\u003c/p\u003e\n\u003cp\u003e“Missouri?” I giggle.\u003c/p\u003e\n\u003cp\u003e“The one you almost killed?” Roger says. “Does that refresh your memory?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“We are still paying her and some scumbag lawyer off—”\u003c/p\u003e\n\u003cp\u003e“You’re getting heavy, man, and when you’re getting heavy … you must, um, leave me alone.”\u003c/p\u003e\n\u003cp\u003e“Do you remember how you f**ked that one up?”\u003c/p\u003e\n\u003cp\u003e“Don’t dwell on the past, dude.”\u003c/p\u003e\n\u003cp\u003e“Do you know how much we still have to pay that bitch off every f**king month?”\u003c/p\u003e\n\u003cp\u003e“Leave me alone,” I whisper.\u003c/p\u003e\n\u003cp\u003e“She was in a wheelchair for a year.”\u003c/p\u003e\n\u003cp\u003e“I have something to tell you.”\u003c/p\u003e\n\u003cp\u003e“So don’t give me that oh-man-l-know-it shit. You don’t know,” Roger says. “You don’t know shit.”\u003c/p\u003e\n\u003cp\u003e“I have something to tell you.”\u003c/p\u003e\n\u003cp\u003e“What? You’re announcing your retirement?” Roger hisses. “Let me guess—you’re going to sell out big-time?”\u003c/p\u003e\n\u003cp\u003e“I hate Japan,” I say.\u003c/p\u003e\n\u003cp\u003e“You hate everywhere,” Roger groans. “You loathsome f**k.”\u003c/p\u003e\n\u003cp\u003e“Japan’s so … different,” I say, finally.\u003c/p\u003e\n\u003cp\u003e“That’s a joke. You say every place is different.” Roger sighs. “Focus, focus, focus, for Christ sakes, focus.”\u003c/p\u003e\n\u003cp\u003eI stare back into the mirror, hear screaming coming from the arena.\u003c/p\u003e\n\u003cp\u003e“Adjust my dreams for me, Roger,” I whisper. “Adjust my dreams for me.”\u003c/p\u003e\n\u003cp\u003eOn the plane leaving Tokyo I’m sitting alone in back twisting the knobs on an Etch-A-Sketch and Roger is next to me singing “Over the Rainbow” straight into my ear, things changing, failing apart, fading, another year, a few more moves, a hard person who doesn’t give a f**k, a boredom so monumental it humbles, arrangements so fleeting made by people you don’t even know that it requires you to lose any sense of reality you might have once acquired, expectations so unreasonable you become superstitious about ever matching them. Roger offers me a joint and I take a drag and stare out the window and I relax for a moment when the lights of Tokyo, which I never realized is an island, vanish from view but this feeling only lasts a moment because Roger is telling me that other lights in other cities, in other countries, on other planets, are coming into view soon.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eLETTERS FROM L.A.\u003c/p\u003e\n\u003cp\u003eSept 4 1983\u003c/p\u003e\n\u003cp\u003eDear Sean,\u003c/p\u003e\n\u003cp\u003eGuess you didn’t expect to hear from me. Talk about getting away from it all! Here I am-all away across the country in California, sitting on my bed, drinking diet Coke and listening to Bowie. Pretty weird, isn’t it? I’ve been in L.A. a week and I still can’t quite believe it. All this summer I knew that I’d be coming out here but somehow the idea wasn’t quite real. It’s just as well that I didn’t spend too much time thinking about it because nothing would have prepared me. L.A. is something else. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-informers/page-46.html","bookId":2685,"creation":"Oct 5, 2019 10:14:55 AM","modification":"Oct 5, 2019 10:14:55 AM"}
