{"id":95401,"no":10,"title":"Page 10","content":"\u003cp\u003eThe Grog Auxiliaries: the Kurian Order keeps its place through its Church, police forces, riot squads, troops, and of course the Reapers. Some might say the paperwork and permits of existence in the Kurian Zone is a form of control, a little less obvious and more debilitating than the policeman on the street or the riot cop at his fire hose. Fear has its role too.\u003c/p\u003e\n\u003cp\u003eOf course, the Kurians sometimes have difficulty getting men to shoot down other men, especially in the early days of their advent. They brought the Grogs over through the Interworld Tree, telling them that a rich planet was theirs for the taking if they\u0027d evict an indolent and degenerate infestation of scrawny humans.\u003c/p\u003e\n\u003cp\u003eSo the Grogs came, though where they expected to frighten and herd away the humans (as their scouts who\u0027d gone among the confused, starving multitudes in a few devastated areas had reported) they found resistance. But Grogs take to new modalities of warfare like ducks to different-sized bodies of water, and soon modified human weapons for their own use.\u003c/p\u003e\n\u003cp\u003eThe Gray Baron\u0027s \"Missouri Division\" is a recent construct. The Grogs in central Missouri now recognize no law but their own, and are quite happy to raid north, south, east, or west-and the rich lands of Iowa have valuable cattle and swine worth stealing. Starting with nothing but a starving, co-opted Western Missouri clan of Grogs known as the Wrist-Rings, he built them up into a formidable fighting band over the course of a decade, absorbing bands of Grogs along the Missouri Valley with promises of easy duty-when not fighting.\u003c/p\u003e\n\u003cp\u003eHe kept that promise. His warriors enjoy an enviable lifestyle, only chieftains south of the river live in the manner of his lowliest fighter. As for the clan chiefs, some believe they\u0027ve died and returned to Earth as demigods, so much wealth and wives and slaves do they have at their command.\u003c/p\u003e\n\u003cp\u003eThe next generation of fighting Grogs and their human masters is training even now, while a third is being selected and bred. What plans the Gray Baron has for them perhaps not even his human lieutenants may say.\u003c/p\u003e\n\u003cp\u003eValentine wondered if Snake Arms\u0027s comment was a plant, to make him anxious. Or perhaps it was a warning about crossing the Gray Baron.\u003c/p\u003e\n\u003cp\u003eIf he hadn\u0027t seen him in his command car, Valentine would have suspected the Gray Baron was a creation, a boogeyman developed by the Kurians to keep both their Grogs and soldiers in line.\u003c/p\u003e\n\u003cp\u003eAhn-Kha was true to his word, as always. Two nights later Valentine was awoken by the discreet scratch of Patches. The ratbit had a little pack made out of a zip-up eyeglass case, and in it was a pad and paper.\u003c/p\u003e\n\u003cp\u003eValentine had spent some time thinking about the vulnerabilities of the Baron\u0027s human/Gray One legion. For the first message, he just passed word of the supplies he needed them to gather from Brostoff\u0027s forward Wolf base. They might not be able to spare guns, but they had plenty to eat and drink ...\u003c/p\u003e\n\u003cp\u003eValentine puzzled out why there were no Grog overseers. Men ordered, and sometimes struck men; the Grogs did the same for and to their own kind.\u003c/p\u003e\n\u003cp\u003eHe had plenty of time to give it thought, under the orders and the implied threat of short whip, knotted rope, or crop in the hands of some ill-tempered NCO.\u003c/p\u003e\n\u003cp\u003eHe\u0027d seen, all too often, one race or species used to supervise another. It focused the subject people\u0027s animosity in the right direction-at least in the tyrant\u0027s terms-at a powerful tormentor. Every shortage, every injury, every illness could be blamed on the people charged with policing. The group on top had to be fiercely loyal to the existing order, or they\u0027d fall-and a bloody, hard fall it would be.\u003c/p\u003e\n\u003cp\u003eSeemed crazy of the Gray Baron not to use this system on his human forced labor. But instead, a few men and women with clipboards and kepis kept quiet watch, little brutality required.\u003c/p\u003e\n\u003cp\u003eProbably the Gray Baron wanted to make sure his fighting Grogs didn\u0027t get any ideas about pushing men around. In Valentine\u0027s experience, all Gray Ones considered themselves superior to puny humans, most of whom weren\u0027t even as strong as a prepubescent youth.\u003c/p\u003e\n\u003cp\u003eValentine wondered if the Gray Baron wasn\u0027t sitting on a throne of sweaty dynamite. If only he were more sensitive to the unspoken currents among Grogs-he might be able to find an ambitious revolutionary among the Deathring Tribe.\u003c/p\u003e\n\u003cp\u003eOver the next two days, Valentine paid more attention to the young people he saw in camp. Teenage and preteen humans and Gray Ones worked together, dressed alike in either green or blue overalls, putting up utility poles, working in the kitchens and laundry. They looked healthy, intelligent, and strong-they reminded him of the Kurian Zone propaganda posters where everyone had firm jaws and full heads of hair.\u003c/p\u003e\n\u003cp\u003eThe cooperation between the younger humans and Gray Ones was the closest thing to symbiosis Valentine had seen. The juvenile Gray Ones did much of the heavy work, with the human youths directing and checking and correcting. But when not engaged in work, the roles were reversed and the Gray Ones ate first while humans served and poured, with humans cleaning their ears and nails and teeth, making sure the bedding was clean and the chamber pots empty. Perhaps to the teens, the Grogs were glorified, highly trainable pets that needed care, and to the young Gray warriors, the human allies were their slaves once the enforced egalitarianism of action was over.\u003c/p\u003e\n\u003cp\u003eThe Baron\u0027s stronghold didn\u0027t feel like a Kurian Zone. The elements were there, a survivor at the top with absolute power, his close advisors and guards just below, then the common herd scratching for any kind of advantage or notice to climb up the next rung of the ladder.\u003c/p\u003e\n\u003cp\u003eValentine had his chance to step up a rung with the Warmoon Festival.\u003c/p\u003e\n\u003cp\u003eIt was his first time inside the old megachurch that served as the Baron\u0027s headquarters. He was, to his surprise, the Baron\u0027s new champion human bare-handed fighter, and despite his lowly status as forced labor, he\u0027d won a front-row seat at the festivities. Even more oddly, Sergeant Stock was to lead his small party, which consisted of a teenage girl who had finished studies at the top of her class in the stronghold\u0027s school and a Youth Vanguard military track student commander who\u0027d travelled all the way from a little town near Buffalo on Lake Erie to join the Baron\u0027s forces.\u003c/p\u003e\n\u003cp\u003eAgain, a less Kurian Zone establishment could hardly be imagined. It reminded him of some of the older, forgotten corners of Southern Command, where staff inspectors were rare and the men built a little military world they liked. There were captured weapons and pieces of uniform hung on the timbered walls, hunting-lodge style.\u003c/p\u003e\n\u003cp\u003eTrying to get out of the press of flesh moving for the big central arena, he stepped off the corridor and into a sort of museum-cum-trophy hall. Some of it was a little gruesome. There was a collection of human scalps in one case, an early souvenir of the Deathring Tribe. Valentine saw some photos of piles of corpses, bodies lying in the streets in front of apartment buildings, one plummeting to earth after being tossed out by corpse-disposal teams, what looked like a wild band of ravies victims, shot down Goya-like and frozen in time and space, white eyed and screaming, in a photographer\u0027s flash.\u003c/p\u003e\n\u003cp\u003eThe only time you ever saw photos of corpses were in Church museums featuring the sins of the Old World, such as the Nike and Coca-Cola corporations\u0027 slaughter of laborers in the sugar plantation killing fields of Cambodia or the murder of the Tutsi nation in central Africa by a New York diamond consortium.\u003c/p\u003e\n\u003cp\u003eValentine guessed that the genesis of the Baron\u0027s organization was a body locator and gravedigger\u0027s unit, judging from some of the pictures and souvenirs in the first cabinet.\u003c/p\u003e\n\u003cp\u003eThe \"Warmoon\" to the Gray Ones was the first crescent moon after the vernal equinox-the fang that signaled the start of the season when their obscure cosmology looked favorably on fighting.\u003c/p\u003e\n\u003cp\u003eSnake Arms found him looking at some early Gray One weaponry and armor, much of it cut from car parts and old utility tools.\u003c/p\u003e\n\u003cp\u003e\"Future father of my child!\" she called. She was dressed, if you could call it that, in a costume made out of silk patching, snakeskin, feathers, and lines of beads, both atavistic and glamorous somehow. She had multiple, thick layers of makeup on, giving her face an otherworldly whiteness.\u003c/p\u003e\n\u003cp\u003e\"Baby come?\" Valentine asked.\u003c/p\u003e\n\u003cp\u003e\"Just kidding. Women don\u0027t know so fast, you know.\"\u003c/p\u003e\n\u003cp\u003e\"We go again now?\"\u003c/p\u003e\n\u003cp\u003e\"What are you, punchy? You don\u0027t want to be seen arriving late under the Baron\u0027s nose.\"\u003c/p\u003e\n\u003cp\u003eHe kept glancing down at her costume.\u003c/p\u003e\n\u003cp\u003e\"Like it? The enlisted ranks do. It\u0027s what keeps me in my trailer with some of the other wives. If they hauled me to the officers\u0027 whorehouse, I think there\u0027d be a riot.\"\u003c/p\u003e\n\u003cp\u003e\"Top come off, you\u0027ll see riots plenty,\" Valentine said.\u003c/p\u003e\n\u003cp\u003e\"I have to get backstage. See you later.\"\u003c/p\u003e\n\u003cp\u003eValentine caught up to his group and they entered the big auditorium.\u003c/p\u003e\n\u003cp\u003ePerhaps next to the Memphis Pyramid\u0027s stadium, it was the largest indoor structure Valentine had ever entered. Unlike the Pyramid, smoke hung heavy in the air and it smelled like a pig show.\u003c/p\u003e\n\u003cp\u003eThe main auditorium of the old church reminded Valentine of a gigantic pup tent. Thick wooden beams, six of them, rose to the ceiling, where skylights admitted the evening light at the pinnacle. There was a balcony-one part glassed in, presumably for the families with small children when it served as a church.\u003c/p\u003e\n\u003cp\u003eValentine was surprised to see the cross still there. It was a simple one, made of the same thick, wrought-iron bolted beams of the ceiling, and it hung down at an angle over the congregation, making Valentine think of a set of last rites he\u0027d seen performed by Father Max over a dying woman in his youth. He\u0027d held the cross before her face at just that angle. Whether that had been the original architecture or a recent change Valentine couldn\u0027t tell.\u003c/p\u003e\n\u003cp\u003eThere was too much activity to look at.\u003c/p\u003e\n\u003cp\u003eThe Gray Ones, for the most part, filled the lower level. The church\u0027s pews had been turned into benches to better accommodate them. A few clan leaders of the Deathring Tribe had their own furniture brought in, or perhaps it was permanently placed there, waiting for them, great perches like oversized Roman chairs.\u003c/p\u003e\n\u003cp\u003eThe human soldiers inhabited the balconies, emblazoned with painted battalion symbols and specialist patches. The iconography was fierce, colorful, and oddly Midwestern, featuring hawks and foxes and coyotes and an out-of-place cobra. More humans sat upon the old altar riser, which projected out into the pews, though that part of it was empty for now.\u003c/p\u003e\n\u003cp\u003eValentine marked the Gray Baron from his seat off to the Baron\u0027s right on the main floor. He sat in a plain, high-backed chair, flanked by two flag bearers, human and Gray One, the Grog with what looked to be a red-and-black checkerboard design with a few spiky icons stitched in the square\u0027s contrasting color, and the human holding the other, the modified tricolor of the Iowa State flag, featuring a pair of sharpened parentheses crossing each other-the locked bull horns, he\u0027d heard them called, but it might also be stolen from a pre-2022 Chanel handbag.\u003c/p\u003e\n\u003cp\u003eValentine thought he looked like something out of another age. He could see this man sitting on a smoky Tatar\u0027s throne or commanding some cut-off Victorian regiment in Afghanistan.\u003c/p\u003e\n\u003cp\u003eHe had a heavy, sloping forehead and a mountain spur of a nose hooked like a hawk\u0027s talon. But even the oversized nose was nothing compared to the Pancho Villa mustache. It was like a curtain obscuring his upper lip and the sides of his mouth. It made his expression rather difficult to read; Valentine couldn\u0027t tell if he was smiling or frowning.\u003c/p\u003e\n\u003cp\u003eA network of scars crisscrossed his face as though a maniacal game of tic-tac-toe had been played with an assortment of scalpels. Valentine had enough battle wounds to know they couldn\u0027t have been accidental. Unless the Gray Baron had stuck his head into an oversized lamprey\u0027s mouth, someone in his past had made a point of cutting him up into shreds.\u003c/p\u003e\n\u003cp\u003eFlanking him, discreetly behind the flags, were three Reapers.\u003c/p\u003e\n\u003cp\u003eValentine had never seen Reapers like this. They were fleshy-he thought fat Reapers didn\u0027t exist, it seemed the Kurians drained off calories along with the vital aura the Reapers transmitted. Despite the bellies and love handles, their faces shone hard and alert, yellow eyes watchful of the few empty square yards in front of the Gray Baron\u0027s throne. Rich red, white, and black war paint striped their bodies in a series of Vs, and their claws and a band across their eyes were a deep blue.\u003c/p\u003e\n\u003cp\u003eThe Gray Baron had a woman next to him, a rather hard-faced brunette with an athletic build. Her hair was piled up tight atop her head, bound together by a pair of stilettos in Asian hairstick fashion. Valentine wondered if the blades were just for show. She had her own stool, but chose to drape herself over the back of his chair, playing with his hair.\u003c/p\u003e\n\u003cp\u003eNext to the Gray Baron on the stage was a feeble-looking old Grog gone white and bent-Danger Close, Valentine guessed. He tried counting bullet wounds in the thick old hide and stopped after nine. He was attended by a bevy of six she-Grogs, wives, daughters, concubines, or some combination. They all carried little ceremonial working blades, like the skinning knives native tribes of the Arctic north use to separate seal blubber from skin.\u003c/p\u003e\n\u003cp\u003eA few Golden One representatives watched the celebration, stone faced. They stood apart from both the humans and the wild Grogs. The celebration was like some fantasy of a black mass. Grog warriors ran up with linked bags of netted heads, tossing them so the line hung over the massive cross at the front of the church.\u003c/p\u003e\n\u003cp\u003eA gong sounded, and the auditorium began to go quiet. From somewhere behind the curtained \"stage\" Valentine heard kettledrums pound slowly, a deep and thrilling sound that touched you in the pelvis. It grew louder, or perhaps the crowd grew quieter, and then the Gray Baron led Danger Close out on the platform projecting near the center point of the auditorium.\u003c/p\u003e\n\u003cp\u003e\"My brothers ...\" he began.\u003c/p\u003e\n\u003cp\u003eDanger Close repeated the words in a Gray One dialect Valentine more or less understood.\u003c/p\u003e\n\u003cp\u003eThe Gray Baron kept it brief. The most auspicious season for war had begun.\u003c/p\u003e\n\u003cp\u003eDanger Close translated, but not exactly. He expressed the same sentiments, but in a Gray One idiom.\u003c/p\u003e\n\u003cp\u003eThis would be another year of building and training. They would venture regularly to Springfield and the Missouri River, even to the outskirts of Saint Louis, yet fighting only when another sought to fight. Otherwise they would be peaceable, friendly, even helpful. A Gray One clan with a broken water tank? Fix it! Illinois bandits stealing cattle or goats? Drive them off and return the livestock. In time their legion would be thought of as a two-headed dragon, not just because one head was human and the other Gray One, but because one head was smiling upon friends, the other biting and rending enemies. Then would come a time of alliances, and in a very few years, the strength to whip the true enemies, the humans of the Ozarks. Addled by fevers, radiator-still whiskey, and backwoods religious monomania, an army with patience to gather and strike would crumble them like a hollowed egg.\u003c/p\u003e\n\u003cp\u003eThey finished to applause and Grog stomps of approval.\u003c/p\u003e\n\u003cp\u003eThen some Gray One storytellers spoke, giving anecdotes of the importance of treating the seasons with respect. Not all could fight even at the best of times, and those who\u0027d already won great glory fighting might wish to take a season off and enjoy their wives and increase their herds and teach youngsters the stern tasks of warfare so that they might survive to win their own glories and wives.\u003c/p\u003e\n\u003cp\u003eThe storytellers met more approval from the main floor than from the balcony.\u003c/p\u003e\n\u003cp\u003eThe Gray Ones had several stomping patters, and Valentine\u0027s quick mind enjoyed puzzling them out. There was one for hearty approval, and another that might be characterized as a nod, and a quick one-two that asked for more of the same.\u003c/p\u003e\n\u003cp\u003eThen there was a display of captured weapons and torn-off service patches. Valentine felt a pang when he recognized a Zulu-Company patch and a Logistics Commando wagon wheel on a helmet, but he applauded with the rest of the humans.\u003c/p\u003e\n\u003cp\u003e\"Trophies are great indicators of luck, to the Gray Ones,\" Stock explained to the boy from Buffalo. \"A poor year for trophies one year will make them more conservative about what they attempt when the next spring\u0027s warmoon rolls around. A good year means they\u0027ll be more aggressive.\"\u003c/p\u003e\n\u003cp\u003e\"Last year was a good one?\" the kid asked.\u003c/p\u003e\n\u003cp\u003e\"No, but it wasn\u0027t our fault. Southern Command quit trying to supply Omaha or move into Kansas, and the days of them slipping recruiting teams up to Minnesota or the Dakotas are long over. The Baron thinks that Southern Command\u0027s lost the will to fight, and wants to take advantage of it, but the Gray Ones will be hard to convince.\"\u003c/p\u003e\n\u003cp\u003eHoots and yelps broke out. Valentine saw Snake Arms step into the open space on the main floor. She had a rattlesnake wrapped around each arm.\u003c/p\u003e\n\u003cp\u003e\"Snakes are big juju with the Groggies,\" Stock said.\u003c/p\u003e\n\u003cp\u003eThe kettledrums started up again along with something that twanged and the familiar scraping of a well-played fiddle. She began to dance.\u003c/p\u003e\n\u003cp\u003eIt was a fascinating routine, as most of it played out from beneath her rib cage down. Her arms stayed statue-steady so as not to disturb the serpents, heads pointed out at the crowd, black eyes glittering. Her head moved as though on a gimbal-mount with her lower limbs, but the torso and arms opened and closed only occasionally.\u003c/p\u003e\n\u003cp\u003eThe Gray Ones watched in silent reverence. Even the emotionless Golden Ones leaned forward in their seats.\u003c/p\u003e\n\u003cp\u003eValentine could just hear the quiet rattle of their tails as she moved, if he really sought the sound.\u003c/p\u003e\n\u003cp\u003eAfter the dance came a combat display, Grogs wrestling, fighting with sticks, and finally swordplay. Valentine wondered if on their home world they used swords or if they\u0027d adopted the weapons from machetes and such captured after 2022. Their fighting style, at least in this theatrical display, involved cuts and parries in precise, ever increasing tempo time. The Gray Ones in the audience became increasingly excited as the more furious blows and parries drew accidental blood.\u003c/p\u003e\n\u003cp\u003eAfter that came a bloody sacrifice.\u003c/p\u003e\n\u003cp\u003eAnimals were slaughtered, starting with chickens and moving up to an ox and a captured eagle. They made a great show of presenting the eagle\u0027s feathers to Danger Close.\u003c/p\u003e\n\u003cp\u003e\"A few deaths prove that they\u0027re serious about getting on the good side of all the invisibles,\" Stock said. \"Don\u0027t let it scare you.\"\u003c/p\u003e\n\u003cp\u003eHe glanced closely at Valentine. Valentine looked down to see that some of the spray from the sacrificed ox had struck his shirt, peppering it in red.\u003c/p\u003e\n\u003cp\u003eBy now the crowd was excited.\u003c/p\u003e\n\u003cp\u003eThey brought a huddled line of shorn men and a few Gray Ones out onto the pulpit projection. Two of the proposed victims were brought in on stretchers.\u003c/p\u003e\n\u003cp\u003e\"Bad head injuries,\" Stock said. \"Sometimes they\u0027re considered prophets, but if they\u0027re only barely responsive, they\u0027re done away with.\"\u003c/p\u003e\n\u003cp\u003eMen with riot guns stood behind, and the Baron\u0027s three pet Reapers flanked the column and stood at its head.\u003c/p\u003e\n\u003cp\u003eValentine recognized one of the sacrifices. It was Beach Boy, from Hole Three. He hadn\u0027t seen him since the fight with Fat Daddy, though he\u0027d heard he\u0027d been put in another hole to stave off further fighting.\u003c/p\u003e\n\u003cp\u003eThe Baron stepped forward, carrying a bamboo cane. A string with some weighted feathers hung from the handle end. He grabbed it by the base, and held it up over the first man in line. The feather just touched the top of the convicted man\u0027s hands as the two Reapers held him, one at the ankles and one at the elbows, with the third behind.\u003c/p\u003e\n\u003cp\u003e\"Raminov, knifed a man over cards,\" Stock said to his party.\u003c/p\u003e\n\u003cp\u003eThere was some hooting from the Gray Ones. A voice cried out from the balcony: I\u0027d knife a man who was cheating at cards too!\u003c/p\u003e\n\u003cp\u003eSome applause and whistling broke out from the men, with a faint boo or \"open him\" shouted.\u003c/p\u003e\n\u003cp\u003eThe feather moved on to a shorn Gray One behind him. Fierce growls broke out among the Gray Ones.\u003c/p\u003e\n\u003cp\u003e\"No idea what he did,\" Stock said.\u003c/p\u003e\n\u003cp\u003eThe convict fell back. He gave one violent shrug. The fist of the Reaper behind him exploded out of his chest in a shower of blood. Valentine noted, rather coldly, that the Reaper had discreetly locked its teeth at the Grog\u0027s shoulder and appeared to have its tongue wedged beneath one of the thick rhino-hide plates of cartilaginous armor.\u003c/p\u003e\n\u003cp\u003eThe auditorium roared approval.\u003c/p\u003e\n\u003cp\u003eIt was a revolting ceremony. Valentine decided it wasn\u0027t so much a sacrifice, or an execution, as a final appeal. Valentine noticed the crowd went silent for some of the victims. Someone from the audience would shriek out a plea for mercy, and if that met with approval there was a great stamping of feet. The Baron never failed to heed the collective verdict, either way.\u003c/p\u003e\n\u003cp\u003eValentine, tired and nervous and sick to his stomach, tried to keep his meagre dinner down. Hot-blooded killing was one thing, but execution as grand theater ...\u003c/p\u003e\n\u003cp\u003eHe\u0027d seen his share of executions. There were several combat-zone offenses that could get one shot, or a civilian hanged, in Southern Command military jurisprudence. He himself had been under a death sentence, thanks to escaping trial and the rendering of an in absentia conviction. Arguably, he\u0027d performed them himself, as some half-awake sentry at one end of an unlit bridge was just as helpless against his knife as a chained convict. You didn\u0027t execute men like this, in front of the next one in line with a holiday crowd roaring.\u003c/p\u003e\n\u003cp\u003eThe feather moved over Beach Boy.\u003c/p\u003e\n\u003cp\u003e\"He was in your hole, I think,\" Stock said, looking at Valentine. \"He\u0027s in for shirking. They found him sleeping under a truck on his shift. When you\u0027re forced labor, that\u0027s it.\"\u003c/p\u003e\n\u003cp\u003eBeach Boy was a silly little toady, certainly, but how many in the audience knew him by anything deeper than sight? Perhaps enough had seen him in the fields to know he played the fool, always with the softest jobs and gentlest duties, to better preserve his supple, scented skin for Fat Daddy.\u003c/p\u003e\n\u003cp\u003e\"Give him another chance!\" Valentine shouted.\u003c/p\u003e\n\u003cp\u003eThe growls and angry murmurs grew louder.\u003c/p\u003e\n\u003cp\u003e\"Chance! Chance! Chance!\" some others began to shout. The chant picked up voices, and the feather moved on. Beach Boy looked skyward.\u003c/p\u003e\n\u003cp\u003eHe could guess the thoughts of every man in the audience: if it was me up there, how would I take it? Tears? Pleas for mercy? Reasoned argument? A final mouthful of spit?\u003c/p\u003e\n\u003cp\u003e\"Just like you, Valentine, trying to save a worthless little dicksicle like that,\" Sergeant Stock said out of the side of his mouth.\u003c/p\u003e\n\u003cp\u003eThe rest of the ceremony was mostly a blur. He was enlisted to carry the glass box with Snake Arms\u0027s reptiles back to her trailer.\u003c/p\u003e\n\u003cp\u003eSo, Graf Stockard knew his name. He must have seen a picture through Molly, or looked him up sometime or other at headquarters. Perhaps he\u0027d even met him at some point or other before either of them knew Molly Carlson, and Stockard remembered and Valentine didn\u0027t. Much of his life before becoming a Wolf had a vague, dreamy feel to it these days.\u003c/p\u003e\n\u003cp\u003eStockard had whispered a few words about speaking to him in private. He\u0027d used the word escape, at least Valentine thought so. The din of the Warmoon Festival as the sacrifices were offered to a successful summer of battle made the word difficult to pick out.\u003c/p\u003e\n\u003cp\u003e\"Warmoon Festival\u0027s going to last for five days. I think they\u0027ll cut you off before then. My fertile period this month\u0027s almost over.\"\u003c/p\u003e\n\u003cp\u003e\"Have they tried to breed you before?\" Valentine said, slowly, as though thinking over every word.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll let you in on a secret, my lash-worn prince. About half the guys here are bent as jackknives. It\u0027s kind of a haven for the rugged, outdoorsy ones.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t like girls. They don\u0027t like them so much, fucking\u0027s about out of the question.\"\u003c/p\u003e\n\u003cp\u003eValentine pretended to puzzle it over for a bit. \"Ahhh,\" he finally said. \"Men\u0027s men.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\"\u003c/p\u003e\n\u003cp\u003eShe murmured something into her pillow about being like Dorothy, all the men she met were missing either heart, courage, or brain.\u003c/p\u003e\n\u003cp\u003eValentine heard Snake Arms\u0027s door open and came into alarmed wakefulness. He sat up so quickly, he half-rolled her off the bed, where she was sleeping atop the sheet.\u003c/p\u003e\n\u003cp\u003eA flashlight shone in his face.\u003c/p\u003e\n\u003cp\u003e\"Yeah, it\u0027s Scar all right,\" a man said.\u003c/p\u003e\n\u003cp\u003eThe dazzling light made ghostly circles on his optic nerves and gave him an instant migraine.\u003c/p\u003e\n\u003cp\u003e\"Whassat?\" Snake Arms said.\u003c/p\u003e\n\u003cp\u003e\"Baron wants to see ya, Champ.\"\u003c/p\u003e\n\u003cp\u003eThis time it was four who escorted him, two from Snake Arms\u0027s trailer joining up with two more waiting outside. These men were neater and a good deal more alert than the Baron\u0027s usual human soldiers who supervised the labor gangs.\u003c/p\u003e\n\u003cp\u003eThey let him dress completely and didn\u0027t put him in handcuffs, so perhaps the Baron was having some sort of private after-midnight celebration.\u003c/p\u003e\n\u003cp\u003eThey brought him to a different part of the camp, in the wooded hills behind the church. They walked him on a pavement path big enough for a single truck up a hill and down into a hummock between two higher hills.\u003c/p\u003e\n\u003cp\u003eA glow of lights frosted the red oaks and maples. Valentine got the sense of some kind of compound. The planting of the trees did a good job of concealing it, but he suspected heavy fencing stretching off into the woods. It looked like someone had planted quick-growing, thorny trees of some sort along a double line of razor wire a few years back. The trees turned the wire into a messy tangle that was difficult to spot at night.\u003c/p\u003e\n\u003cp\u003eThe ground flattened, and they came to a second line of fencing, nice-looking iron railing, gated at the trail. Valentine smelled dogs, but didn\u0027t see or hear them. His escort nodded to a sentry at a shelter and was waved in.\u003c/p\u003e\n\u003cp\u003eValentine got his first look at the Baronial residence.\u003c/p\u003e\n\u003cp\u003eIt looked like a hunting lodge or a small hotel set in the pretty wooded hills, with decorative rather than security lighting.\u003c/p\u003e\n\u003cp\u003eHe passed under a threshold. The posts and lintels were covered with deep-burned Gray One markings, wedge-writing like cuneiform. Valentine recognized one for \"victory\" and one for \"health.\"\u003c/p\u003e\n\u003cp\u003eThe inside was just as rugged. Slabs of limestone and great, river-smoothed rocks in a sort of hunting-lodge meets prairie-style that the Gray Baron seemed to favor.\u003c/p\u003e\n\u003cp\u003eHe was taken into an office-cum-game room. There was a pool table with a low electric light hanging just above it and a dartboard at one end, and a great semicircle of bookcases high enough that they needed a ladder with a desk in the middle at the other. A beautiful button-backed leather sofa sat near a massive stone fireplace, partly in the office, partly in the gaming area.\u003c/p\u003e\n\u003cp\u003eThe books looked dusty and not in any sort of order. Valentine wondered if they were just for show.\u003c/p\u003e\n\u003cp\u003e\"Welcome to my home, Scar, isn\u0027t it?\" he said. Valentine nodded in reply. \"Sorry to keep you up so late. I\u0027m a night owl. Useless in the morning. Coffee?\"\u003c/p\u003e\n\u003cp\u003e\"Whiskey spirits?\" Valentine asked.\u003c/p\u003e\n\u003cp\u003e\"Not when I\u0027m working,\" the Baron said. \"Sit.\"\u003c/p\u003e\n\u003cp\u003eThe woman he\u0027d seen draped behind his chair shuffled papers.\u003c/p\u003e\n\u003cp\u003e\"Chuckles here has three degrees,\" the Baron said. \"You know what a degree is?\"\u003c/p\u003e\n\u003cp\u003e\"Hot,\" Valentine said, wondering if he looked wary enough.\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s a piece of paper that says you know better than someone who\u0027s been in the field their whole life. But she makes everything I do look right on paper. Keeps the generals in Iowa happy. I don\u0027t imagine you know any Iowa generals, but they expect the paperwork correct. Murder all you like, just file it in triplicate.\"\u003c/p\u003e\n\u003cp\u003eThe dark woman came out with a wooden tray. A little chrome-and-glass pot and some cups sat on it.\u003c/p\u003e\n\u003cp\u003e\"Three degrees to serve coffee,\" the Baron said.\u003c/p\u003e\n\u003cp\u003e\"And five technical certifications, plus security clearance,\" she said.\u003c/p\u003e\n\u003cp\u003eValentine sipped the coffee. It was rich stuff, but he felt a slight lift that wouldn\u0027t be explained by caffeine as it warmed him. Probably a few drops of some KZ happy/alert mix favored by higher-level Quislings.\u003c/p\u003e\n\u003cp\u003e\"Why did you speak up for Beach Boy?\" the Baron asked.\u003c/p\u003e\n\u003cp\u003e\"Knew him, room, gang same-same,\" Valentine said.\u003c/p\u003e\n\u003cp\u003e\"That made you like him better? He\u0027s been a problem since he hit the recruitment office in Davenport. He\u0027s been here nine months. Never bothered to learn the first thing about military discipline. We tossed him into labor after his three months probation was up, figured he could serve out his term there, then let him muster out. But sleeping on the job-that\u0027s a death sentence, whether it\u0027s a sentry on duty, a rail switchman, or a guy with a shovel.\"\u003c/p\u003e\n\u003cp\u003eValentine shrugged. The dark woman was staring at him. It made him uncomfortable.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re clearly tough, well-muscled, healthy. I\u0027m impressed with your reflexes. I think you\u0027re a lot smarter than you\u0027re letting on. I\u0027d like you in one of my service uniforms.\"\u003c/p\u003e\n\u003cp\u003e\"Soldier-no good,\" Valentine said. \"Fighting-dead quick.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s drop this pidgin shit, shall we?\" the Baron said. The dark-haired woman handed him a red paper folder. He unhooked a binding band.\u003c/p\u003e\n\u003cp\u003e\"David Stuart Valentine. Born date unsure, probably in 2047, Boundary Waters region, Northern Minnesota. Father Lee Valentine, formerly of Southern Command, formerly of the United States Navy. Mother-well, that\u0027s a bit of a question mark, isn\u0027t it? Mother is suspected to be Helen St. Croix, much of her information isn\u0027t available to a mind of my level and capabilities, as the Kurian Order styles it. Recruited into Southern Command by guerilla fighters-\"\u003c/p\u003e\n\u003cp\u003eHe turned the open folder around. Valentine felt cold sweat running over him, started to nerve himself for a fight. There was nothing on the desk that might be used as a weapon. There was an old picture of him, eyes closed, looking beat up, both full face and profile. It must have been when he was captured in Nebraska by the Twisted Cross, after the bullet to the leg in the General\u0027s rail yards.\u003c/p\u003e\n\u003cp\u003e\"You might say I inherited it from your old friend the General. My Groggies used to guard his trains, sometimes. Valentine, let\u0027s be civilized about this. We\u0027re just talking.\"\u003c/p\u003e\n\u003cp\u003e\"When do the Reapers show themselves?\" Valentine asked.\u003c/p\u003e\n\u003cp\u003e\"Not giving away all my secrets, but yes, my bodyguard is nearby. There are other forces I\u0027m a lot more worried about than you. I don\u0027t think you understand the nature of my power. I determine my own destiny. I\u0027m better than those ring-holding rabbits on their estates in Iowa with their board meetings and balls and cotillions. Those precious, precious, my precious rings. The Kurians can take those back.\u003c/p\u003e\n\u003cp\u003e\"No one, no one, can take my power away from me. I can lose it, through inattention, bad luck, bloody Christ, some Grog witch doctor might even declare me an evil spirit if he thinks the graybacks\u0027ll stand by him. Have you ever drawn a truly free breath?\u003c/p\u003e\n\u003cp\u003e\"Out here, there\u0027s no law but what I say is the law. I say I want seven new wives brought in and three old ones carried out, hippetyhoppety it\u0027s done.\u003c/p\u003e\n\u003cp\u003e\"Want to know the secret of my success?\u003c/p\u003e\n\u003cp\u003e\"I employ oddballs. There are two kinds of oddballs in the world, those who are weird because they got nothing else going for them, and those who operate on a level where they just don\u0027t fit in seamlessly with something like those Kurian ant farms. I\u0027ll take both kinds and watch \u0027em for a bit, just to see if I\u0027m mistaken about which group they belong to. But I can find a place for either.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not asking you to join my team, Valentine. I\u0027d like you as an ally, with that crew that\u0027s about to get kicked out of Kentucky. I know you\u0027re more open than most Southern Command military ticks to working with Grogs. I could arrange for you to take back Saint Louis. Think of all the human captives you\u0027d free. You\u0027d be the biggest liberator since Lincoln. All I\u0027d ask in return is your help taking out a few Kurian towers of my choosing. The Rings in Iowa are worried that they\u0027re about to get muscled, since they\u0027re the only east-west connection left north of the Gulf, unless you count that patchwork in Minnesota connected to the Pacific Northwest through Oregon.\"\u003c/p\u003e\n\u003cp\u003e\"Mind if I take a nap while you finish jerking off? That couch looks a lot more comfortable than those kennels.\" Valentine had the odd feeling that he\u0027d been called a bastard, if that word applied for the ridiculous circumstance of having one\u0027s own mother unknown. Of course he was the son of Helen St. Croix, he had her cheekbones, hair, and dusky skin. He wished he had her kindness, or the gently teasing way she kissed fingers and toes as she put him and his baby sister to sleep.\u003c/p\u003e\n\u003cp\u003e\"Play the hard-ass, Valentine. I have some exciting news. There are several parties very, very interested in getting you back for a variety of reasons. Don\u0027t worry, they think you\u0027ve been captured in Minnesota, trying to get back to your birthplace. I have a smaller contingent up there, too. Bids are pouring in. The Ordnance in Ohio, the Lich King in Seattle, assorted lordships and illustriousnesses from New Orleans plus the plain old Coastal Marines, and one fat old rug runner in Michigan who resents what happened to his glorious, God-favored Moondaggers.\"\u003c/p\u003e\n\u003cp\u003e\"An embarrassment of bitches,\" Valentine said. \"Don\u0027t tell me there\u0027s not some Twisted Cross colonel over in Nebraska or Kansas who doesn\u0027t want his pound of flesh too.\"\u003c/p\u003e\n\u003cp\u003e\"My Golden Guard did too thorough a job on them, Valentine,\" the Gray Baron purred. \"Before they had the good sense to come under my protective wing. There are some Twisted Cross in the Alps in Europe and the mountains of Asia Minor, I understand, but they have no special grievance and are muchly occupied with another tiresome Polish rebellion. No, I\u0027m limiting myself to Kurians, I think. They have the most to offer, and will probably be the most creative in making use of human vermin. I don\u0027t believe in hell in the classical sense, of course, but the Kurians can keep you alive and screaming for what seems like an eternity. Several human lifetimes of torment might be in your future.\"\u003c/p\u003e\n\u003cp\u003e\"I imagine there\u0027s an unless coming up.\"\u003c/p\u003e\n\u003cp\u003e\"I can think of several. Unless you\u0027re clever enough to kill yourself before a down payment is arranged and delivery worked out. Unless you escape. You\u0027ve done it before, so I\u0027m considering welding you into your cell and putting napalm somewhere where it can be delivered into the cells in a hurry in case of a disturbance.\"\u003c/p\u003e\n\u003cp\u003e\"Or unless I join you.\"\u003c/p\u003e\n\u003cp\u003e\"That makes me into a video villain, and a not very imaginative one at that. I do wonder if it wouldn\u0027t be better to release you, at that. To my knowledge you\u0027ve been involved in some very unlucky operations. Very unlucky indeed. Southern Command is much the worse for wear thanks to the David Valentines of its officer corps. Full of plots and plans ahead of them and lines of silent, shallow soldiers\u0027 graves behind.\"\u003c/p\u003e\n\u003cp\u003eValentine yawned and sat. \"Mind if I stretch out? I\u0027m not as much of a night owl, even with some of your drugged coffee.\"\u003c/p\u003e\n\u003cp\u003eThe Gray Baron shrugged. \"I don\u0027t expect you to weep and crawl, but some recognition of the relative balance of power between us would be in order. Since I\u0027m running a silent auction for your hide, I might not take the highest bidder and instead send you to whoever has the most vicious way of dealing with your brand of nuisance. You know, Valentine, when I risk something, I try and make sure it\u0027s a pawn or a bishop at most. That\u0027s why I lead Grogs. There are always more Grogs. That bright young lieutenant, Rand-how many more like him are in Southern Command? Or somebody like William Post-there\u0027s an active, intelligence man who\u0027d be an asset to any headquarters. He\u0027s reading intelligence reports from his wheelchair these days, I believe.\"\u003c/p\u003e\n\u003cp\u003eValentine put his feet on the elaborately knobbed armrest of the sofa. \"You have my full attention. If you\u0027re going to offer an alternative to winding up in Seattle\u0027s rooftop aquarium, I\u0027ll be happy to hear it.\"\u003c/p\u003e\n\u003cp\u003e\"Your name and abilities intrigue me, Valentine. You have some kind of understanding of Kurian Zone politics, I believe?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t keep up with the latest alliances and betrayals,\" Valentine said. \"It\u0027s all I can do to stay current on Noonside Passions, and that has much prettier actors.\"\u003c/p\u003e\n\u003cp\u003eThe Gray Baron smiled. \"We can agree on that, Valentine. I\u0027ve always had a bit of an obsession with that Barbara Diamate. Leggy and hippy, but it makes that Youth Vanguard Directing Executive uniform skirt look so much better during her walk and talks. Slit higher than regulation, of course, but that\u0027s television for you. I\u0027ve asked for a publicity tour in Iowa, of course, but they\u0027re much too busy.\"\u003c/p\u003e\n\u003cp\u003e\"We could have a Christmas Truce to watch it together, Baron.\"\u003c/p\u003e\n\u003cp\u003e\"Back to business. I mean to say-I and the Iowans have certain enemies . . . Kurian enemies ... who it would be expedient to be rid of, or at least see greatly weakened in power and influence. Now, I could provide you with information, possibly even a contact or two on the inside, and you and your barefoot little Kentucky band could, what\u0027s the phrase-choke a bitch for me.\"\u003c/p\u003e\n\u003cp\u003e\"My troops aren\u0027t barefoot,\" Valentine said.\u003c/p\u003e\n\u003cp\u003e\"Then perhaps someone\u0027s been feeding me bad intelligence. Since my sources are in Southern Command proper, I\u0027d suggest keeping your own superiors more up-to-date.\"\u003c/p\u003e\n\u003cp\u003eValentine needed to buy time. He said he would have to consider their conversation carefully, at leisure.\u003c/p\u003e\n\u003cp\u003e\"Tell me one thing. What clued you in?\"\u003c/p\u003e\n\u003cp\u003e\"Something funny happened. After you spoke up for Beach Boy, Sergeant Stock here asked for Scar to be assigned to him for a day. Except he didn\u0027t call you Scar. Called you Valentine. I mentioned it to Chuckles here and she recognized the name and dug up your file.\"\u003c/p\u003e\n\u003cp\u003eThey took him to a no-fooling jail car in a wired corner of the rail yard. It was well lit and noisy from the sound of work on the trains.\u003c/p\u003e\n\u003cp\u003eHe reviewed the conversation. Whoever was feeding the Gray Baron intelligence wasn\u0027t doing a very good job of it. Or perhaps they were passing on misinformation.\u003c/p\u003e\n\u003cp\u003eShould have kept my fool mouth shut, Valentine thought. Well, he\u0027d been playacting the laconic, insolent veteran and let it get away from him.\u003c/p\u003e\n\u003cp\u003eThey let him stew behind bars for two days. Then, on the final night of the Warmoon Festival, they put him in irons again, under gunpoint from a pistol close, a shotgun at the door, and a rifle outside the bars.\u003c/p\u003e\n\u003cp\u003e\"You got another fight on, buck,\" his guard said.\u003c/p\u003e\n\u003cp\u003eOn the way to the headquarters, they saw that festivities had spilled out in front of the headquarters, where a throng of Gray Ones and some men were gathered around parked vehicles.\u003c/p\u003e\n\u003cp\u003e\"Hey, the roamin\u0027 emporium\u0027s set up already,\" he said.\u003c/p\u003e\n\u003cp\u003eValentine couldn\u0027t believe they\u0027d arrived so quickly. He\u0027d figured it would be another few days at least.\u003c/p\u003e\n\u003cp\u003eThey were parked there, bold as brass in a line of thick-wheeled trucks in the vehicle loading lot between headquarters and the motor pool. Valentine recognized two of the trailers from near Brostoff\u0027s headquarters.\u003c/p\u003e\n\u003cp\u003eFrat rode on the hood of one, sitting cross-legged with yards of woven hair and necklaces of dog teeth and ear-reamers made out of shinbones. God knew where he accumulated the Grog trade goods, probably from some back room at Hobarth\u0027s Truckstart and Trading Post.\u003c/p\u003e\n\u003cp\u003e\"Name\u0027s China Jack, they say,\" the guard said. \"Sergeant Major Quince knows him from Kansas City.\"\u003c/p\u003e\n\u003cp\u003eValentine wondered if this was some strange ability that went with Frat\u0027s background as a Kurian agent. As far as these men were concerned, he was somebody they knew from way back.\u003c/p\u003e\n\u003cp\u003e\"I met him south of Omaha. Got a great pair of boots,\" the shotgun man said.\u003c/p\u003e\n\u003cp\u003e\"Bought my kids a baseball and two gloves from him, couple years back, at Hannibal,\" the rifleman put in. \"He\u0027s upgraded his vehicles since then. Used to be old truck frames pulled by horses.\"\u003c/p\u003e\n\u003cp\u003eBee rode shotgun in the first truck, Chieftain in the second. Chieftain had toned down his look a great deal, and wore some greasy mechanic\u0027s overalls.\u003c/p\u003e\n\u003cp\u003eThe third truck had ROOT BEER in giant black stencils on a white sheet. That had the largest crowd around it. Valentine almost smiled. The Baron\u0027s headquarters was in for a wild night.\u003c/p\u003e\n\u003cp\u003eAlready, the Gray Ones were lining up to buy.\u003c/p\u003e\n\u003cp\u003eThey brought him to the atrium. A temporary wire cage had been set up, the sort of thing used to keep dogs in, about eight feet high.\u003c/p\u003e\n\u003cp\u003eThe Baron looked down on it from a balcony.\u003c/p\u003e\n\u003cp\u003eAgain, it was mostly Gray Ones on the main floor, though in the smaller atrium there was a good deal of shoving and standing on flower beds and other interior decor of the old church to get a view. Men and Gray One elders were ringing the balcony.\u003c/p\u003e\n\u003cp\u003eThe Grogs were unusually agitated, pushing each other and snarling. Some were idly digging daggers into the woodwork.\u003c/p\u003e\n\u003cp\u003eLuckily there were few women in the Baron\u0027s command. Valentine hoped Snake Arms wasn\u0027t dancing in the moonlight tonight.\u003c/p\u003e\n\u003cp\u003eThey turned down the lights and some brighter spots were focused on the white floor in the cage. Valentine was led in. He saw Bee outside the cage, looking at him, fighting off paws reaching for her. She snapped her teeth at the more aggressive suitors.\u003c/p\u003e\n\u003cp\u003eSnake Arms came into the cage and began to unlock his shackles with a key. They must have figured she wouldn\u0027t kill him.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve arranged a special fight tonight,\" the Baron said. He saw a commotion next to him, caught a flash of one of the Baron\u0027s pet Reaper faces.\u003c/p\u003e\n\u003cp\u003eThey threw a figure off the balcony. It pivoted neatly in fall, and landed on its feet.\u003c/p\u003e\n\u003cp\u003eDuvalier!\u003c/p\u003e\n\u003cp\u003eShe had a bandage on her left hand and an ugly bruise on her chin, but otherwise looked healthy. Like Valentine, she was stripped to the waist. Unlike Valentine, she was armed, with a Kabar-style fighting knife.\u003c/p\u003e\n\u003cp\u003e\"We caught one of Southern Command\u0027s finest sneaking around the woods in civilian clothes,\" the Baron said. \"By rights, she can be shot as a spy. But we\u0027ll give her a fighting chance against our champion, here. Only one of these two will leave the cage alive, tonight. The other\u0027s head will go up on the ancient cross for Warmoon!\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Val,\" Duvalier said. \"Whaddya suppose they\u0027ll do to us if we don\u0027t fight.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s easy. You all three die. Snake Arms, too,\" the Baron said.\u003c/p\u003e\n\u003cp\u003eSnake Arms flew to the cage\u0027s door, but a chain closed it. \"No, this isn\u0027t part of the deal! I could be pregnant! You can\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll fight, all right,\" Valentine said. \"Bee, tell the Gray Ones what I\u0027m saying. Speak my words!\"\u003c/p\u003e\n\u003cp\u003eBee nodded. She swung up to the top of the cage, standing balanced at the joints with one arm bracing herself, like King Kong atop the Empire State Building.\u003c/p\u003e\n\u003cp\u003eValentine smiled at the hubbub. The Gray Ones were putting their heads together and muttering.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll give you all a fight,\" Valentine said. \"I\u0027ve mated with a woman under the Chief\u0027s protection. I\u0027m part of the Deathring Tribe now, and demand my rights.\"\u003c/p\u003e\n\u003cp\u003eHe patted Snake Arms on the belly. He had no idea if she might be pregnant, nor had enough time passed for her to have an inkling either, he suspected, but the Grogs understood the gesture.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t talk tribe to us, buck,\" one of the Iowans said. \"This is a military organization, not some Grog\u0027s head hut.\"\u003c/p\u003e\n\u003cp\u003e\"To you, perhaps,\" Valentine said. \"I\u0027m challenging the Chief\u0027s leadership.\" He switched to his poor Gray One dialect and repeated it. \"Has he ever had to fight to win it or defend it?\"\u003c/p\u003e\n\u003cp\u003eA few laughs broke out among the humans, but the Grogs began to go quiet. He spoke the words again, louder. Bee amplified them.\u003c/p\u003e\n\u003cp\u003e\"When night stalkers come, does Chief protect? Does he give? Where are herds, where are wives? Deathring Tribe fight hard for no reward. Where are the wives?\"\u003c/p\u003e\n\u003cp\u003eThe excited Grogs digging their daggers into the woodwork and pawing at Bee looked up and began to bellow at the Gray Baron.\u003c/p\u003e\n\u003cp\u003e\"You fucking idiot,\" his dark assistant he called \"Chuckles\" said in his ear.\u003c/p\u003e\n\u003cp\u003e\"Honor much. Weapons taken and kept,\" the Baron said.\u003c/p\u003e\n\u003cp\u003e\"Wives! Wives! Wives!\" the Grogs chanted.\u003c/p\u003e\n\u003cp\u003e\"Oh, screw that,\" the Gray Baron said, reaching for his shoulder holster. He pulled his pistol and fired at Valentine.\u003c/p\u003e\n\u003cp\u003eValentine needed every iota of his hair-trigger reflexes to throw himself sideways and down out of the path of the bullet.\u003c/p\u003e\n\u003cp\u003eA hail of plates, bones, and bottles rained on the Gray Baron and his officers. One of the Chief\u0027s clan had issued a challenge all could understand, and the Chief had neither pacified the malcontent nor met him in fair fight! No wonder his teeth had turned black and lies came from his mouth.\u003c/p\u003e\n\u003cp\u003eThe cage suddenly collapsed. Grogs pushed, prodded, and poked Valentine. It felt uncomfortably like the way he\u0027d seen an old Wolf cook testing hung meat. Were they planning a mixed buffet barbecue?\u003c/p\u003e\n\u003cp\u003eA massive shape loomed over him, blotting out the light.\u003c/p\u003e\n\u003cp\u003e\"Dvfud,\" it mouthed.\u003c/p\u003e\n\u003cp\u003eBee!\u003c/p\u003e\n\u003cp\u003eShe reared up on her hind legs and shoved the Gray Ones apart. Valentine basked in the air and space that two muscular arms the length of a good road bike could provide.\u003c/p\u003e\n\u003cp\u003eBee put her back to him and began to talk, loudly and quickly. To Valentine, Grog speech always sounded like old boards being pulled apart and melon-sized rocks being tossed into a pond.\u003c/p\u003e\n\u003cp\u003eThen Ahn-Kha was beside him. A hairy arm wrapped about his chest, took him carefully under the armpit, and lifted him clear of the mass of Grogs.\u003c/p\u003e\n\u003cp\u003eValentine ignored Ahn-Kha\u0027s rescue, mesmerized by the sight of Bee. Usually she remained quietly at heel, like a companionable older dog who simply enjoyed watching events rather than creating them. This new version of Bee might be mistaken for Snake Arms doing her dance. She talked with mouth, arms, fingers, and foot stomps, half dance and half speech.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s Bee saying? Or is it just a protective display?\"\u003c/p\u003e\n\u003cp\u003e\"Her dialect is a little difficult to follow, my David, but in general, she\u0027s saying that you put the moon in the sky. This is the first I\u0027ve heard of you rescuing her from a circus.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know warrior Grogs listened to females.\"\u003c/p\u003e\n\u003cp\u003e\"They do. Bee\u0027s at a respectable age, where she becomes-the human word would be \u0027Auntie.\u0027 That is an important title.\"\u003c/p\u003e\n\u003cp\u003e\"Auntie Bee?\" Valentine said. His head was swimming. \"Why does that sound familiar?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t speak much of your family. I am not sure. My David, did you intend for Gray Ones to come to Kentucky as well?\"\u003c/p\u003e\n\u003cp\u003e\"No, only your people.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t think Bee fully understands your plans. She is talking up the place in the manner of a-what is that title?-real estate salesman.\"\u003c/p\u003e\n\u003cp\u003eYips and hoots broke out among the Grogs.\u003c/p\u003e\n\u003cp\u003e\"What excites them?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s talking about how many legworms there are, and that the humans are friendly and welcoming to Grogs.\"\u003c/p\u003e\n\u003cp\u003eValentine looked at the Gray Ones. They were spellbound. Or perhaps still under the influence of the Kurian aphrodisiacs. Bee had them riveted as she spoke to the ring, turning every moment or two on one vast forearm to face a different part of the audience.\u003c/p\u003e\n\u003cp\u003eThe hundreds of Grogs broke out of their circle, forming groups, calling, pushing, pulling, and cajoling. Others loped off in a four-legged run to acquire friends and relatives for the scrum.\u003c/p\u003e\n\u003cp\u003e\"I think a new Grog tribe is being formed, my David.\"\u003c/p\u003e\n\u003cp\u003e\"Would your people mind having them along, or does it mean interspecies warfare?\"\u003c/p\u003e\n\u003cp\u003e\"We look on the Gray Ones as rustics. Some we find charming and congenial, others-not so. As long as they are not high-handed. Some of the habits of the Gray Baron\u0027s army will have to be changed.\"\u003c/p\u003e\n\u003cp\u003eThe camp was in chaos. Gray Ones were chasing the few available females. \"Chuckles\" was missing. Valentine hoped for her sake she\u0027d made it out unmolested. But Gray Ones had been known to make do with human females and other livestock, when desperate ...\u003c/p\u003e\n\u003cp\u003eThey\u0027d patched up Valentine as best they could without a surgeon. He\u0027d heal, if he could just eat and drink enough. He still felt light-headed, but he had to help bring order to the camp. The Golden Ones were freed, by Valentine\u0027s word as new Stronghold Chieftain, and he\u0027d promised Danger Close that once everyone who wanted to leave did, the headquarters would be his.\u003c/p\u003e\n\u003cp\u003eBut first, he wanted to give the Baron the same chance he\u0027d been given. Now it was his turn to feel the weight of shackles and uncertainty about the future.\u003c/p\u003e\n\u003cp\u003e\"Okay, what happened?\" the Baron asked. \"How did you turn my army into a Spring Break party?\"\u003c/p\u003e\n\u003cp\u003eBee had told him that the threat to Snake Arms had also motivated them. She was strong juju, in charge of the spirits who\u0027d died in the Baron\u0027s service.\u003c/p\u003e\n\u003cp\u003e\"The Root Beer,\" Valentine said. \"We dumped a case of Kurian aphrodisiacs in it. We weren\u0027t sure of the pharmacological effects. By the books, by my beliefs, you\u0027re my enemy. I don\u0027t feel it in my guts, however. My gut tells me you\u0027re a friend.\"\u003c/p\u003e\n\u003cp\u003e\"A friend?\" the Gray Baron said. \"Give me a knife, and I\u0027ll spill your guts and have a look, see what the problem is.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve taken a bullet from you. I wouldn\u0027t want to return the experience.\"\u003c/p\u003e\n\u003cp\u003e\"One thing I know about the Kurians. They\u0027re not a forgive-and-forget race. They\u0027ll suck the life out of their own mother as soon as she reverts back to being a father, if the parent\u0027s dumb enough to let them. I\u0027ve sent as many of your forces in the field as I can get in touch with off to the west. It\u0027s full spring now, and the Grogs in the Missouri Valley will be feeling their oats. How soon before they head north to make a warrior\u0027s name for themselves?\"\u003c/p\u003e\n\u003cp\u003e\"The way I see it, you have three options. First, I can leave you behind to explain things as best as you can to the Iowans. Second, I can take you prisoner and drop you off with Southern Command. I\u0027ll assume they have nothing on you, other than you being a high-ranking Quisling, which will probably mean you\u0027ll get a few more appeals before they shoot you. Third, you can come with me.\"\u003c/p\u003e\n\u003cp\u003e\"Ha!\"\u003c/p\u003e\n\u003cp\u003e\"You told me once you liked the taste of real freedom. I don\u0027t think you know the meaning of the word. I\u0027m part of a sort of experimental formation that gives Quislings a second chance, if they want it. You choose a new name, swear under it, and serve six years. You can serve more if you want a chance at a pension or a land grant, later. You\u0027re a good leader. You\u0027d probably even still be in command of some of your same Grogs. We sure could use a man like you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m no turncoat. So there\u0027s honor involved. You talk about land allotments? Like some patch of Texas scrub can compare with what the Kurians give?\"\u003c/p\u003e\n\u003cp\u003e\"What do they give, really?\"\u003c/p\u003e\n\u003cp\u003e\"Eternal life. Not some mystical Jesus hoo-ha, either. Life you can see and touch. The churchmen said that if I can pacify Missouri, they\u0027ll get me a brass ring and the power to extend my life as long as I like.\"\u003c/p\u003e\n\u003cp\u003e\"Feeding on your fellow men?\"\u003c/p\u003e\n\u003cp\u003e\"There are other ways. No shortage of pigs and dogs. Pigs are more emotionally developed than we think. I met one of their archons, Japanese and Korean guy; he was born in the 1920s and he lives off pigs.\"\u003c/p\u003e\n\u003cp\u003e\"You think that offer is still open? Suppose I order a couple companies of your Grogs to go burn some towns in Iowa.\"\u003c/p\u003e\n\u003cp\u003e\"Their officers know better. They\u0027d march right back here to see what was wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Well, either way, you\u0027re coming with us. When we get back to the bootheel country, I\u0027ll let you make up your mind-a Southern Command military prison or freedom in Kentucky.\"\u003c/p\u003e\n\u003cp\u003e\"Bootheel country\u0027s a long way off. That\u0027s a tough march with all these Grogs.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll manage.\"\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027re the one jerking off, Valentine. You think everyone\u0027s just going to settle down, happy? A couple of lambs will go missing, and there\u0027ll be bloodshed, and somebody\u0027s going to get their head chopped off. Then it\u0027s all-out tribal warfare. Just wait and see. You want to build something that\u0027ll last, I\u0027d suggest a permanent hierarchy. Humans on top, then the Golden, then the Gray. That\u0027s what I was working toward.\"\u003c/p\u003e\n\u003cp\u003e\"You left out the Kurians.\"\u003c/p\u003e\n\u003cp\u003e\"I said working toward, Valentine. Till you screwed everything up.\"\u003c/p\u003e\n\u003cp\u003eValentine left the Baron in an evil mood matching his own.\u003c/p\u003e\n\u003cp\u003e\"I have a message for you, sir,\" the Wolf said. \"Repeat from Colonel Lambert at Field HQ.\"\u003c/p\u003e\n\u003cp\u003eValentine read the block pencil letters. The coms tech had lined out the code phrases beginning and ending the message that acted as filler to make decryption more difficult.\u003c/p\u003e\n\u003cp\u003eGENERAL HEADQUARTERS TO SENG/ LAMBERT THROUGH EASTERN OPERATIONS. PERMISSION FOR GG TRANSPORT AND SUPPLY DENIED. PRESENCE OF NONHUMAN FORCES CONSIDERED DANGEROUS AND PROBLEMATIC FOR CIVILIAN MORALE. RIVERINE ELEMENTS WILL PROVIDE LIMITED SUPPORT FOR TRANSFER TO KENTUCKY. CONGRATULATIONS ON ACTION IN N. MISSOURI-SIGNED MARTINEZ\u003c/p\u003e\n\u003cp\u003eValentine wondered if the scrambler chatter at the end was a simple mistake or the headquarters code clerk sending his own secret message.\u003c/p\u003e\n\u003cp\u003eAnger throbbed, tightening his chest. The general had done it to him again. That bastard. Maybe he knows I\u0027m involved, somehow.\u003c/p\u003e\n\u003cp\u003e\"Well, my David?\" Ahn-Kha asked.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t land in the Ozark Free Territory,\" Valentine said.\u003c/p\u003e\n\u003cp\u003e\"Odd that they\u0027d be so nervous about it. Chances of more than a few civilians seeing them are slim, there\u0027s not much civilian presence near the river in the bootheel country.\"\u003c/p\u003e\n\u003cp\u003e\"We must still go ahead. My people\u0027s dice are cast. They are trapped between enemies.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/march-in-country-vampire-earth-9/page-10.html","bookId":2590,"creation":"Oct 5, 2019 6:14:45 PM","modification":"Oct 5, 2019 6:14:45 PM"}
