{"id":85456,"no":4,"title":"Page 4","content":"\u003cp\u003eFOUR\u003c/p\u003e\n\u003cp\u003eStan had watched everyone go, watched Beggar glide out like the angel of doom back to his ivory tower. I told Lou to lock up then take a hike. Stan\u0027s driver-bodyguard waited in Stan\u0027s Fleetwood, so it was just me and him sitting around the Monopoly table in the monkey cage.\u003c/p\u003e\n\u003cp\u003e\"Get a bottle,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Of what?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever. Bring two glasses.\"\u003c/p\u003e\n\u003cp\u003eI fetched a bottle of Chivas, straddled my chair backwards. I leaned forward, filled each glass a third full.\u003c/p\u003e\n\u003cp\u003eHe sipped. I sipped. We sat.\u003c/p\u003e\n\u003cp\u003eFinally he said, \"You heard all that?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"How do you size it up? The situation.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re handing you a big shit sandwich,\" I said.\u003c/p\u003e\n\u003cp\u003eStan nodded. Smiled. Not a happy smile. A might-as-well-get-used-to-taking-it-up-the-ass smile. \"You have a good way with words, Charlie. Charlie the Hook. Anybody still call you that?\"\u003c/p\u003e\n\u003cp\u003e\"Hardly anybody.\"\u003c/p\u003e\n\u003cp\u003eHe scratched his head. \"How\u0027d you get that nickname? Been so long, I forgot.\"\u003c/p\u003e\n\u003cp\u003e\"I killed a man with a boat hook once.\"\u003c/p\u003e\n\u003cp\u003eHe chuckled. \"Oh yeah.\" He\u0027d been forgetting a lot lately.\u003c/p\u003e\n\u003cp\u003eHe finished the Chivas, coughed a little. \"I don\u0027t really drink anymore. Eighty-one years old. Believe that shit? All I\u0027ve lived through, and it\u0027s drinking and smoking and cholesterol and shit I have to worry about. Fuck.\"\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003e\"But tonight-\" He tapped his glass. I poured it a third full again. \"- tonight I need a drink.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, Stan.\"\u003c/p\u003e\n\u003cp\u003eHe drank. I drank. We still sat.\u003c/p\u003e\n\u003cp\u003eI cleared my throat some, kind of looked at him.\u003c/p\u003e\n\u003cp\u003e\"Go ahead and ask,\" he said.\u003c/p\u003e\n\u003cp\u003e\"What do we do?\"\u003c/p\u003e\n\u003cp\u003e\"Right now we do nothing. We toe the line. You know Kyle Donovan?\"\u003c/p\u003e\n\u003cp\u003eNot personally, but I\u0027d been listening on the wire. \"Owns a titty bar called Toppers on Orange Blossom Trail. He answers to you?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s pretty far down the food chain,\" said Stan. \"He answers to people who pay me for the honor of doing business in my neighborhood.\"\u003c/p\u003e\n\u003cp\u003e\"Who do you want me to take along?\"\u003c/p\u003e\n\u003cp\u003e\"Who do you need?\"\u003c/p\u003e\n\u003cp\u003eI only thought a second. \"Bob and Benny to cover the doors. I\u0027ll go in myself after hours. I\u0027ll leave New Guy to watch out for things here.\"\u003c/p\u003e\n\u003cp\u003e\"New Guy? Who the fuck\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"Lou Morgan. The huge guy. Muscles.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about that. I want you to call Benny and Bob. I want you taking care of this tonight before Beggar heads back for Miami.\"\u003c/p\u003e\n\u003cp\u003e\"Tonight?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that? Some kind of problem?\"\u003c/p\u003e\n\u003cp\u003e\"No problem, Stan.\"\u003c/p\u003e\n\u003cp\u003e\"Good. Nobody gets out. Got it? If it moves, it\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"I got it.\"\u003c/p\u003e\n\u003cp\u003e\"Now listen, Charlie. This is the important part. There\u0027s a black, eel-skin briefcase with the initials A. A. Combination locked. Grab it. Turn the place inside out if you have to but put the snatch on it top priority, capiche? Beggar wants the case taken to Alan Jeffers.\"\u003c/p\u003e\n\u003cp\u003eStan explained Jeffers was the twitchy coke-head that worked for Beggar. Beggar\u0027s blond gunman was a cat named Lloyd Mercury.\u003c/p\u003e\n\u003cp\u003eI said, \"I understand. What\u0027s in the case?\"\u003c/p\u003e\n\u003cp\u003e\"What the fuck you care what\u0027s in the case? Just get it.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, Stan.\"\u003c/p\u003e\n\u003cp\u003e\"Shit, what a fucking night. Look, forget I snapped. I\u0027m a cranky old man, right?\"\u003c/p\u003e\n\u003cp\u003e\"No problem, Stan.\"\u003c/p\u003e\n\u003cp\u003e\"I got to go. I\u0027m trusting you to take care of this.\"\u003c/p\u003e\n\u003cp\u003eWe said our goodbyes. From the window I watched him bend his old-man body into the Fleetwood.\u003c/p\u003e\n\u003cp\u003eAs I was dialing Benny\u0027s number, I thought that Stan still hadn\u0027t asked where Blade Sanchez had vanished to. Maybe he had a reason for not asking. When you asked questions, you risked getting answers.\u003c/p\u003e\n\u003cp\u003eBenny answered after four rings. \"Yeah?\" He didn\u0027t sound sleepy. Night owl.\u003c/p\u003e\n\u003cp\u003e\"Put your fun hat on,\" I told him. \"We got work.\"\u003c/p\u003e\n\u003cp\u003eAt a quarter to five, me and Benny and Bob waited in a black mini-van in the Toppers parking lot. The girls had left in a steady stream, not quite as appealing out of their g-strings and in their street clothes. When the lot was empty, I told my team to check the loads on their shotguns. The plan: I go in and sweep the place clean. They wait by the exits and plug anyone who tries to bolt.\u003c/p\u003e\n\u003cp\u003e\"You sure about this, Charlie?\" Benny chewed his fingernails. All of his jittery habits surfaced when it was go time. But he had his head on straight. No problem.\u003c/p\u003e\n\u003cp\u003e\"Our best guess is there\u0027s about nine guys in there,\" he said. \"We\u0027ll know better when you talk to the girl.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but the breakdown\u0027s okay. We got one bookworm counting the night\u0027s take, two bartenders, and two bouncers who may or may not be packing. That leaves four probably carrying heat, and I take them first.\"\u003c/p\u003e\n\u003cp\u003e\"Look, I got plenty of faith in you,\" said Benny. \"But maybe I should come with, huh?\"\u003c/p\u003e\n\u003cp\u003e\"I got it. You cover the rear.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Benny handed me an envelope. \"Her name\u0027s Candy.\"\u003c/p\u003e\n\u003cp\u003e\"Sure it is.\"\u003c/p\u003e\n\u003cp\u003eI leaned against the back wall between the rear entrance and the Dumpster. Two minutes later, a ragged blond with big fake tits emerged and held the back door open for me.\u003c/p\u003e\n\u003cp\u003e\"How many?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Nine,\" she said and snapped her gum. \"The four suits all have guns. I sat in Myron\u0027s lap earlier, so I know he ain\u0027t packing.\"\u003c/p\u003e\n\u003cp\u003e\"Myron?\"\u003c/p\u003e\n\u003cp\u003e\"Donovan\u0027s cousin from down south.\"\u003c/p\u003e\n\u003cp\u003eMy ears perked up. \"How far down south?\"\u003c/p\u003e\n\u003cp\u003e\"Miami, I think. What do I know? He had busy hands and wasn\u0027t much interested in talking.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Who else?\"\u003c/p\u003e\n\u003cp\u003e\"Sal and Ron- the bartenders- don\u0027t carry anything on them, but there\u0027s a small silver revolver underneath the register. The bouncers got nothing but muscles.\"\u003c/p\u003e\n\u003cp\u003eI handed Candy the envelope. \"I don\u0027t know what your plans are, but I wouldn\u0027t come back here.\"\u003c/p\u003e\n\u003cp\u003eShe opened the envelope, thumbed through the bills briefly, then stuffed the cash into her jeans. \"Don\u0027t worry. I ain\u0027t ever coming back to this shithole.\" And she was gone.\u003c/p\u003e\n\u003cp\u003eI entered the dim hall and closed the door behind me. A few quick steps brought me to the girls\u0027 dressing room. A curtain on the left led to the stage, and the door on the right opened into a long hall that led to the kitchen. So far, it had been just like Benny told me it would be. I took a few seconds to check my guns. The twin.45s hung snug in their shoulder holsters, and the.38 with the three-inch barrel was clipped tight to my belt just below my belly. I used to wear a little.380 on my ankle, but I\u0027d never needed it and it made movement awkward.\u003c/p\u003e\n\u003cp\u003eMy last touch was a pair of latex gloves. You can get a whole box of them for free when you see your doctor for a routine checkup. A little compensation for having to read two-year-old magazines in the waiting room. Anyway, I wasn\u0027t eager to leave fingerprints.\u003c/p\u003e\n\u003cp\u003eI drew the.45 automatics and slipped down the hall toward the kitchen.\u003c/p\u003e\n\u003cp\u003eThe kitchen was completely dark except for the dusty light that spilled in from the lounge beyond. I could hear men\u0027s voices and the clink of glasses floating in from the next room. I crept up to the edge of the doorway, staying in the shadow, and peeked in. One of the big bouncers still sat on his perch near the front door. He looked bored and tired and leaned heavily against the red velvet wallpaper, his eyes drooping. Both bartenders washed and dried glasses behind the bar, and the guy who had to be Myron sat at one of the big tables in the center of the room with two of the suits. Both suits looked clean-cut and serious.\u003c/p\u003e\n\u003cp\u003eI watched from the shadows for two more minutes, and my patience paid off. The other two suits returned and pulled chairs up to Myron\u0027s table. Myron was bent over some papers, reading hard and fast. The other bouncer was still unaccounted for, but I felt good enough about the situation to go in. I made a mental note of the order I wanted to start shooting people. From where I stood, I couldn\u0027t get a clear shot at everyone, so I needed to be on the move.\u003c/p\u003e\n\u003cp\u003eI started pulling triggers as soon as I stepped into the light.\u003c/p\u003e\n\u003cp\u003eThe shouting and confusion erupted like it always did. Men pushed chairs away from the table, went for pistols inside jackets. Another thing about strip clubs: most are wall-to-wall mirrors, and the effect was that blazing death had descended on them from all directions. The thick-necked bouncer awoke on his stool, his eyes widening with panic.\u003c/p\u003e\n\u003cp\u003eI swung the automatics in a deliberate arc, squeezing lead into the four suits. They spun around in a shower of blood, guns halfway out of their holsters. Myron dove under the table, and I left him for the moment, turned my attention to the bar. From the corner of my eye, I caught sight of the bouncer\u0027s back as he disappeared through the front door. I was vaguely aware of a shotgun blast outside.\u003c/p\u003e\n\u003cp\u003eBehind the long, wooden bar, both bartenders were in motion. The first bolted for the kitchen door. The other went for the pistol beneath the register, and I followed him with a rain of lead. Booze bottles danced and shattered behind him, but I had to abandon him and attend to the second bouncer who emerged from the dancers\u0027 dressing room with a sawed-off shotgun. He stood center stage and blew a chunk of wood out of the table I\u0027d overturned for cover. I stood and emptied both clips into him, and he fell into a lifeless heap on the stage.\u003c/p\u003e\n\u003cp\u003eI dropped the empty automatics, deciding it would be quicker to pull the.38 from the belly holster than it would be to shove another clip into one of the.45s. I thumbed back the hammer and rolled along the tile floor until I was up against the bar.\u003c/p\u003e\n\u003cp\u003eThe bartender might still be crouched near the register, but if he was smart he\u0027d have crawled two-thirds of the way to the other end, so he could pop up and squeeze off a few shots at me. But I didn\u0027t know if he was smart or not, so I watched the bar in the mirror on the other side of the room.\u003c/p\u003e\n\u003cp\u003eI guess he wasn\u0027t too smart, because he popped up about ten seconds later, still near the register, holding the little silver revolver in front of him like he was trying to choke it. After the rage of gunfire, the club was now strangely quiet.\u003c/p\u003e\n\u003cp\u003e\"Dave?\" he called. \"You okay? You get him?\"\u003c/p\u003e\n\u003cp\u003eI double-checked his position in the mirror, then stood and fired. I caught him solid right behind the ear. Blood surged fleshy and wet. He slumped forward over the bar. The pistol fell out of his hand and clattered across the tile.\u003c/p\u003e\n\u003cp\u003eI thumbed back the hammer again and slowly approached the table in the center of the club. I crouched, the.38 leading the way, and found Myron flat on his stomach with his hands over his head. I was about to turn his lights out when he said something interesting.\u003c/p\u003e\n\u003cp\u003e\"Who are you? You want it? Just take it. Okay? Leave me alone.\" He thrust a finger over his head. \"In the briefcase.\" Myron was a portly, sweaty man with fat arms and fat legs and stubby fingers and a nose that looked like a little fist. A cowering blob in a nice suit. I\u0027d seen a hundred like him, but I was suddenly curious.\u003c/p\u003e\n\u003cp\u003e\"You stay put.\" I kept the revolver on him. I couldn\u0027t afford to be too curious. The shots would bring the sirens soon enough, but I had this gut feeling that there was more going on here than the after-hours strip club routine. I tried the briefcase, but it was combination locked with a three-digit code. The initials A. A. in gold.\u003c/p\u003e\n\u003cp\u003eI waved Myron out from under the table. \"Open it.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, pal. You got it. I\u0027m cooperating, see?\" Myron worked the combination, flipped the latch and reached into the case.\u003c/p\u003e\n\u003cp\u003eI saw his shoulders tense and twisted away from him just as his fat hand came out of the case with a snub-nose revolver. He fired once where my midsection had been. I felt the hot kiss of the slug glance along a rib as it passed through my shirt and jacket. My side grew warm and wet with my own blood.\u003c/p\u003e\n\u003cp\u003eThe.38 jerked in my hand three times. The bullets sprouted red across Myron\u0027s chest. He twitched once and fell across the table, slamming the briefcase closed. Locks clicking shut again.\u003c/p\u003e\n\u003cp\u003eI checked myself. The wound stung like hell, but it wasn\u0027t too bad. I kicked Myron away from the table and grabbed the briefcase. On my way out, I passed over one of the dead suits. A brassy hint of metal sticking out of his jacket caught my eye. By all the rules, I should have hauled my ass out the back door a long time ago. But some strange little tickle in the back of my brain made me stop and poke my nose into things that were none of my business. My job was done. I should be gone. But that little tickle.\u003c/p\u003e\n\u003cp\u003eI bent and shoved back the suit\u0027s lapel, revealing the shiny hunk of metal pinned to his vest.\u003c/p\u003e\n\u003cp\u003eIt was a badge.\u003c/p\u003e\n\u003cp\u003eMy heart shifted into passing gear, and I swallowed hard. A quick check revealed three more badges on the others. I\u0027d just pulled the plug on four cops. This wasn\u0027t in the game plan. Not by a long shot. I pocketed one of the badges, picked up my automatics. And left Toppers through the same door I\u0027d come in. Benny and Bob looked impatient.\u003c/p\u003e\n\u003cp\u003e\"Christ,\" said Bob. \"We almost left you. Get in the van, and let\u0027s get out of here.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, guys, something\u0027s fucked up,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s always fucked up,\" said Bob. \"Let\u0027s talk about it in the van.\"\u003c/p\u003e\n\u003cp\u003eI flashed him the badge, and his eyes got big as hubcaps. \"I took it off one of the marks in there. There\u0027s three more just like it. Somebody\u0027s not telling us everything. The shit\u0027s going to hit the fan. I just thought we should get ready to duck.\"\u003c/p\u003e\n\u003cp\u003eHe looked unhappy. \"Goddamnmotherfuckshit.\"\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027d better go someplace. Figure this out.\"\u003c/p\u003e\n\u003cp\u003e\"The monkey cage.\" Benny\u0027s suggestion.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"I know where. And we can get some breakfast.\"\u003c/p\u003e\n\u003cp\u003eI held a handkerchief to my bleeding side as I climbed into the van. The angry song of sirens chased us into the fading night. \u003c/p\u003e","sourceLink":"https://allnovel.net/gun-monkeys/page-4.html","bookId":2246,"creation":"Oct 5, 2019 5:07:09 PM","modification":"Oct 5, 2019 5:07:09 PM"}
