{"id":85458,"no":6,"title":"Page 6","content":"\u003cp\u003eSIX\u003c/p\u003e\n\u003cp\u003eMy suit was dirty.\u003c/p\u003e\n\u003cp\u003eSo was the left side of my head.\u003c/p\u003e\n\u003cp\u003eThat\u0027s what happens when you lie facedown in a sandy driveway, I guess. I felt the back of my head before trying to get up. No sticky layer of blood. Thank God for small favors. I got up on one knee, a little wobbly. I put my hands against the trunk of the Buick for support, climbed to my feet.\u003c/p\u003e\n\u003cp\u003eI brushed myself off.\u003c/p\u003e\n\u003cp\u003eI looked up at the sun, down at my watch. I\u0027d been lying in the dirt all morning.\u003c/p\u003e\n\u003cp\u003eI was very very late to meet Stan.\u003c/p\u003e\n\u003cp\u003eStan. I stood straight, head jerking around, scanning the yard. The briefcase- the eel-skin briefcase with the initials A. A., the briefcase I\u0027d pried open with a knife, the briefcase I\u0027d shot everybody dead in a titty bar for- was gone.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI bent, looked under the Buick. The gym bag. I opened it. The books.\u003c/p\u003e\n\u003cp\u003eNervous, relieved giggling elbowed its way out of my throat, skipped away on the mild winter breeze. I re-zipped the gym bag, took the stairs two at a time back up to my apartment.\u003c/p\u003e\n\u003cp\u003eI called Stan\u0027s home phone. Twenty-one rings. No answer.\u003c/p\u003e\n\u003cp\u003eI dialed Bob Tate. Three rings and an answering machine. \"Hey, this is Bob. I\u0027m not here right now but-\"\u003c/p\u003e\n\u003cp\u003eI hung up.\u003c/p\u003e\n\u003cp\u003eI dialed Benny. Fifteen rings. No answer.\u003c/p\u003e\n\u003cp\u003eWhere the hell was everybody?\u003c/p\u003e\n\u003cp\u003eI called O\u0027Malley\u0027s. Twelve rings and no answer. I let it ring five more times. Still nobody.\u003c/p\u003e\n\u003cp\u003eThat was just wrong.\u003c/p\u003e\n\u003cp\u003eI looked out my window. Scanned the yard. No trouble. At least none that I could see.\u003c/p\u003e\n\u003cp\u003eOkay, Charlie old boy, now what?\u003c/p\u003e\n\u003cp\u003eI called Ma. She answered after three rings.\u003c/p\u003e\n\u003cp\u003e\"Ma, let me speak to Danny.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s out back punching the bag.\"\u003c/p\u003e\n\u003cp\u003e\"Get him.\"\u003c/p\u003e\n\u003cp\u003e\"Is something wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I just want to talk to Danny.\"\u003c/p\u003e\n\u003cp\u003eShe went for him. He came on the phone panting. \"Charlie?\"\u003c/p\u003e\n\u003cp\u003e\"Look out the front window. I\u0027ll wait.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Just do it.\"\u003c/p\u003e\n\u003cp\u003e\"What am I looking for?\"\u003c/p\u003e\n\u003cp\u003e\"A strange car parked across the street. Maybe somebody sitting inside. Take a good look. Maybe parked down a block.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"Just do it.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on.\"\u003c/p\u003e\n\u003cp\u003eI waited, looked out my own window.\u003c/p\u003e\n\u003cp\u003eDanny came back. \"It\u0027s clear.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Still want to help?\"\u003c/p\u003e\n\u003cp\u003e\"Does this mean I\u0027m hired?\"\u003c/p\u003e\n\u003cp\u003e\"Call it an audition. Still got your Buck Rogers gun?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Keep it handy. Don\u0027t let Ma see. No sense sending her off the deep end. Stay inside and try to talk her out of going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s Ma. Where would she go?\"\u003c/p\u003e\n\u003cp\u003e\"Keep an eye on the window. Don\u0027t let anyone near that you don\u0027t know. I\u0027ll be in touch later.\"\u003c/p\u003e\n\u003cp\u003e\"Charlie, what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"Probably nothing. Just being careful.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what you need me to do? Guard Ma?\"\u003c/p\u003e\n\u003cp\u003e\"That just shows you don\u0027t know anything,\" I said. \"First thing you learn in the monkey cage is watch after your own.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay. Take it easy.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be in touch.\"\u003c/p\u003e\n\u003cp\u003eI hung up and took the medicine cabinet apart again. I withdrew the Colts and put them in the shoulder holsters but didn\u0027t wear them. I shoved them in the gym bag with the books.\u003c/p\u003e\n\u003cp\u003eI left the apartment, locked the door. I was halfway down the stairs when the phone started ringing behind me. I ran back up, fumbled the keys out. I unlocked the door and answered the phone on the eighth ring.\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Charlie?\"\u003c/p\u003e\n\u003cp\u003eLou Morgan. New Guy. \"Where in the shit are you?\"\u003c/p\u003e\n\u003cp\u003e\"O\u0027Malley\u0027s,\" he said. \"Where\u0027s everybody else? Place is locked up tighter than Bob Tate\u0027s colon after a chunk of cheese.\"\u003c/p\u003e\n\u003cp\u003e\"Can the comedy, New Guy. This is fucking serious. How long you been there?\"\u003c/p\u003e\n\u003cp\u003e\"An hour maybe.\"\u003c/p\u003e\n\u003cp\u003e\"I tried calling.\"\u003c/p\u003e\n\u003cp\u003e\"I was across the street,\" said Lou. \"I thought maybe it was a holiday or something, so I wanted to see if Jan\u0027s was open.\" The deli across from O\u0027Malley\u0027s. \"I mean it\u0027s dead here, man. Nobody out front in the bar. Nobody back in the cage. Nothing.\"\u003c/p\u003e\n\u003cp\u003eThe wheels in my head cranked, began to turn. \"Have you talked to Bob or Benny?\"\u003c/p\u003e\n\u003cp\u003e\"No. I tried calling Bob first.\"\u003c/p\u003e\n\u003cp\u003e\"Lou,\" I said, my slow thoughts stumbling over one another, \"I think maybe you ought to get out of there.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" said Lou. \"Somebody\u0027s at the door.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t answer it, Lou.\"\u003c/p\u003e\n\u003cp\u003e\"It might be Bob. It\u0027ll just take a second.\" I heard Lou lay the receiver on the bar.\u003c/p\u003e\n\u003cp\u003e\"Bob has a key,\" I yelled into the phone. \"Lou!\"\u003c/p\u003e\n\u003cp\u003eThe scene beyond the phone unfolded like a radio play. The door opening. The rush of bodies into the room. Shouts. Lou\u0027s voice: Fuckers! Shots. Yelling. More shots. Glass shattering. Movement. Pushing? Another voice: Around there. Hurry.\u003c/p\u003e\n\u003cp\u003e\"Lou!\" My voice urgent.\u003c/p\u003e\n\u003cp\u003eIt went silent quickly. Steps. The click and buzz on the other end of the phone. Disconnect.\u003c/p\u003e\n\u003cp\u003eI drove as fast as I could without risking a ticket, knowing the party would be over by the time I got there from my apartment. What else could I do? I fingered the.38 in the belly holster. The gym bag perched on the passenger seat.\u003c/p\u003e\n\u003cp\u003eThis wasn\u0027t the slow squeeze anymore. It was bad.\u003c/p\u003e\n\u003cp\u003eBut when I got to O\u0027Malley\u0027s I found out it was worse.\u003c/p\u003e\n\u003cp\u003eI got within a block. A uniformed cop held back a crowd. Squad cars.\u003c/p\u003e\n\u003cp\u003eBeyond, fire engines.\u003c/p\u003e\n\u003cp\u003eAngry black smoke poured from the windows of O\u0027Malley\u0027s. A team of earnest firemen directed hoses, drenched the burning building.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t watch long, put the Buick into gear and drove on. Behind me, a world ended, my small, fixed place in it swept clean by fire, escaping and dispersing into the wide sky with smoke.\u003c/p\u003e\n\u003cp\u003eBob Tate\u0027s house was ten minutes away. I screeched to a halt in his driveway, jumped out of the Buick, left the driver\u0027s side door open. I knocked on Bob\u0027s front door. Waited. No answer.\u003c/p\u003e\n\u003cp\u003eI knocked again. Louder. Insistent.\u003c/p\u003e\n\u003cp\u003eWhen I tried the knob, the door was unlocked. I pushed it open, walked inside.\u003c/p\u003e\n\u003cp\u003e\"Bob?\"\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eI tilted my head, listened. The house was dead still except at the open windows. The cool breeze tickled the thin curtains. Where next? In the living room or up the stairs?\u003c/p\u003e\n\u003cp\u003e\"Bob?\" This time louder.\u003c/p\u003e\n\u003cp\u003eI decided on the living room. I found his answering machine. It blinked its story at me. Two phone calls. I played the messages. First Lou, then me. Variations on a theme. Where the hell are you?\u003c/p\u003e\n\u003cp\u003eInto the dining room- nothing- through to the kitchen.\u003c/p\u003e\n\u003cp\u003eA jagged scattering of glass glittered on the floor. My eyes traveled up the back door where a square of glass had been punched out just above the door handle. A break-in.\u003c/p\u003e\n\u003cp\u003e\"Bob!\"\u003c/p\u003e\n\u003cp\u003eThrough the rest of the ground floor. I ran up the stairs two at a time and pushed open the first door I came to. A bedroom. Bob\u0027s bedroom.\u003c/p\u003e\n\u003cp\u003eBob was there.\u003c/p\u003e\n\u003cp\u003eHe lay faceup on his bed in his boxers and undershirt. The clothes he wore the night before at Toppers trailed from the bathroom to the foot of the bed. Bob wore a neat bullet-hole in the exact center of his forehead. A trickle of blood ran down past his open eyes, alongside his nose and over his lips.\u003c/p\u003e\n\u003cp\u003eBob had been a cold-blooded, hard-as-nails killer. A brute with a sap or an axe handle or a set of brass knuckles. His wife had left him and took the twins back to Jersey. He chewed with his mouth open. He farted for comedy. No one on the planet would miss Bob Tate.\u003c/p\u003e\n\u003cp\u003eExcept me.\u003c/p\u003e\n\u003cp\u003eI pulled up a chair, sat looking at Bob\u0027s cold body. After a few minutes of his vacant eyes, I got up and threw a blanket over him. I sat down again in the chair, put my head in my hands.\u003c/p\u003e\n\u003cp\u003eWould I find the same scene at Benny\u0027s place? At Stan\u0027s? I\u0027d already heard what had happened to Lou. What now, Charlie? What now, you dumb, thick monkey? I\u0027d spent a lot of years doing what I was told. Now I had to think for myself.\u003c/p\u003e\n\u003cp\u003eI suddenly felt tired, ragged. How long without sleep? From Toppers to Ma\u0027s to my apartment. I\u0027d spent some time facedown in my driveway. Did that count as sleep? I didn\u0027t feel rested.\u003c/p\u003e\n\u003cp\u003eAnd why wasn\u0027t I dead? Somebody had clocked me good but left me alive. They\u0027d only wanted the books.\u003c/p\u003e\n\u003cp\u003eI got to my feet, down the stairs, back out to my car.\u003c/p\u003e\n\u003cp\u003eI drove.\u003c/p\u003e\n\u003cp\u003eWhere? Not back to my apartment. Fuck that. Too dangerous. I didn\u0027t want to end like Bob. Back to Ma\u0027s. Hell, no. They\u0027d think to look there. I\u0027d only get Ma killed with me and Danny. Better for them if I stayed away. I pulled into a convenience store, found a pay phone, dialed a number.\u003c/p\u003e\n\u003cp\u003eShe picked up after four rings. \"Hello?\"\u003c/p\u003e\n\u003cp\u003e\"Marcie?\"\u003c/p\u003e\n\u003cp\u003e\"Yep.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Charlie.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"I need a place to stay.\"\u003c/p\u003e\n\u003cp\u003eNo hesitation. \"Come on then.\"\u003c/p\u003e\n\u003cp\u003eMarcie let me in, took my coat. \"Are you okay?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know yet.\" I handed her the gym bag. \"Put that someplace out of the way. Please.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" She disappeared into the garage then came back.\u003c/p\u003e\n\u003cp\u003eI still stood in her dim foyer. \"Where\u0027d you put it?\"\u003c/p\u003e\n\u003cp\u003e\"In the freezer under the raccoon.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Come on. You look terrible.\"\u003c/p\u003e\n\u003cp\u003eShe took my hand and led me into the living room. I stood there like I didn\u0027t know what to do. I felt numb, listless, indifferent. She lowered me into the big leather recliner in front of the TV, put the remote on the arm of the chair but didn\u0027t switch it on. I leaned back, raised the chair\u0027s footrest. My muscles cried in relief.\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t noticed Marcie had left the room until she returned. She handed me a drink. Chivas. My brand. She\u0027d been shopping. I nodded my thanks at her.\u003c/p\u003e\n\u003cp\u003e\"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a long story,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Maybe I can help.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t help.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know. Try me.\"\u003c/p\u003e\n\u003cp\u003eI thought about it, closed my eyes. \"My boss is being squeezed out by a big shot from Miami. All my buddies are dead, and the place where I work just burned to the ground. I was hit on the head and slept in the dirt. And all I got is a gym bag full of questions. Still think you can help?\" I gulped back the Chivas, emptied the glass.\u003c/p\u003e\n\u003cp\u003eShe took the glass from me. \"Well, anyway, I can get you another drink.\" The rustle of her clothing followed her out.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t hear her return, didn\u0027t get my next drink. I sank into the comfort of the chair, down into vivid Technicolor dreams.\u003c/p\u003e\n\u003cp\u003eThe first dream was a rerun. I was looking down the barrel of Blade Sanchez\u0027s Luger again. He was talking and talking but only one thing he said really came through clear. Beggar says I can go to work for him anytime.\u003c/p\u003e\n\u003cp\u003eWhy would Beggar want to hire your sorry, dumb ass?\u003c/p\u003e\n\u003cp\u003eIn the next dream, I walked through O\u0027Malley\u0027s. Flames licked the walls, skipped across the carpet. I kept thinking we needed to get everybody out. But Lou Morgan was there, waving a big muscle arm. \"Get out, man. It\u0027s empty.\"\u003c/p\u003e\n\u003cp\u003eYeah. Empty. Where were the people? The place should have been full of drunks. The bartenders. Amber. Why weren\u0027t they there? I was alone in a burning house with nobody to save.\u003c/p\u003e\n\u003cp\u003eSomebody had tipped them off. That was the only answer, and I realized I wasn\u0027t dreaming anymore. I was thinking, figuring it out. But I didn\u0027t want to think too hard about thinking. It was like asking the centipede which foot he started walking with. Think about it, and you\u0027re fucked. So I let the thoughts drift. Somebody had tipped the bartenders. They didn\u0027t come open. Patrons couldn\u0027t get in. Don\u0027t show today. Fire. Everyone gets the tip-off.\u003c/p\u003e\n\u003cp\u003eExcept the monkey cage. We didn\u0027t get the word. Somebody\u0027d set us up.\u003c/p\u003e\n\u003cp\u003eSold us out.\u003c/p\u003e\n\u003cp\u003eI opened my eyes to darkness. \u003c/p\u003e","sourceLink":"https://allnovel.net/gun-monkeys/page-6.html","bookId":2246,"creation":"Oct 5, 2019 5:07:09 PM","modification":"Oct 5, 2019 5:07:09 PM"}
