{"id":90675,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“We think someone helped Brady Laurie drown,” Will said bluntly.\u003c/p\u003e\n\u003cp\u003eSimonton gaped at him. “Wow. Well, I can’t see how that could have happened. I mean, his own people were right behind him and they’re the ones who found him.” He sat back, staring at them, still not threatened, just surprised. “Um, you’re welcome to search anything we own or, uh, whatever.”\u003c/p\u003e\n\u003cp\u003e“Thanks. If we need to search, we’ll get back to you,” Kat said. “What we could use is information on the Egyptian Sand Diggers.”\u003c/p\u003e\n\u003cp\u003e“Oh, sure!” He started rummaging through his desk. “That invitation is in here somewhere…. They used nice stationery and calligraphy on it.”\u003c/p\u003e\n\u003cp\u003eHe gave up with a sigh and stood, heading out to the receptionist’s desk. “Gina, can you find me that invitation from the Egyptian Sand Diggers?”\u003c/p\u003e\n\u003cp\u003eSimonton stood by the door as Gina searched for the invitation. Kat leaned over and whispered to Will. “Why don’t you just call the Tribune and announce that we’re looking for a murderer? We’re not even sure of it ourselves!”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “What? You think people will believe the FBI is involved because we want to dive a wreck?”\u003c/p\u003e\n\u003cp\u003eShe gritted her teeth again, but before she could respond, Simonton returned with the invitation. “Here you go. Their address is right there, where it says RSVP.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Kat said, accepting it. She smiled. “You were really helpful. I hope we can count on you in the future, if we need to.”\u003c/p\u003e\n\u003cp\u003eHe gave her a warm smile in return. “Oh, you bet!”\u003c/p\u003e\n\u003cp\u003e“You did a lovely job. Maybe I should let you do all the talking,” Will muttered as they left the office.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe turned to her. “Mr. Simonton was quite…taken with you. That’s good. He’ll help us.”\u003c/p\u003e\n\u003cp\u003e“Agent Chan, that is hardly—”\u003c/p\u003e\n\u003cp\u003e“Professional? Sorry. But you were being all nicey-nice, and in this case, it seemed to work. I say we go with it.”\u003c/p\u003e\n\u003cp\u003e“I say it’s better than you offending M.E.s and cops!”\u003c/p\u003e\n\u003cp\u003e“McFarland needed to know that he’d make a fool of himself if he crossed Laurie off as an accidental death. Now he knows, and he won’t do it. And I was perfectly polite with the cops. I don’t blame them. This is a tough town, and when they can close the books on a situation, they have to do it. I honestly don’t think it occurred to most people working the drowning that it might have been an assisted drowning—or murder. Now, they’ll think about.”\u003c/p\u003e\n\u003cp\u003e“Are we going out to talk to Landry or the Egyptian Sand Diggers?” Kat asked. She decided to let his previous remarks—a backhanded compliment if ever there was one—slide.\u003c/p\u003e\n\u003cp\u003e“Let’s check out Landry first,” Will said.\u003c/p\u003e\n\u003cp\u003eKat agreed, getting out her phone.\u003c/p\u003e\n\u003cp\u003eWill glanced over at her. “Are you getting someone to look up the Sand Diggers?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Good idea.”\u003c/p\u003e\n\u003cp\u003eAfter a brief conversation, Logan promised that he’d learn whatever he could about the avid amateur Egyptologists. By the time she’d finished, they were pulling into a lot by the glass-and-chrome offices of Landry Salvage.\u003c/p\u003e\n\u003cp\u003e“They seem to be doing a bit better here, don’t you think?” he asked Kat.\u003c/p\u003e\n\u003cp\u003e“Either that, or they’re more impressed with appearances.”\u003c/p\u003e\n\u003cp\u003eWhere the offices of Simonton’s Sea Search had seemed like an old-fashioned sea shanty, Landry’s was almost sterile. The floors were bare, the white walls adorned with single black strokes of paint. The reception desk was sparse, and the woman who greeted them was young, very pretty and very blank. It seemed to take her several minutes to figure out who they were, and then several more to understand what they wanted. The little sign on her desk identified her as Sherry Bertelli.\u003c/p\u003e\n\u003cp\u003e“Oh, oh, oh!” she said at last. “Oh! You’re here about the professor or the Egyptologist or the…whatever he was who died so tragically!” She pushed a button on the single piece of office equipment before her. “Mr. Landry, the FBI is here to see you.”\u003c/p\u003e\n\u003cp\u003eThey heard an impatient reply. “The FBI? Whatever for?”\u003c/p\u003e\n\u003cp\u003eKat leaned over the desk. “Agents Katya Sokolov and Will Chan, Mr. Landry. We’d like to speak with you. We’re hoping you can help us.”\u003c/p\u003e\n\u003cp\u003eThere was a moment of dead silence, and then Landry said, “Of course. Come on in. Ms. Bertelli will escort you.”\u003c/p\u003e\n\u003cp\u003eSherry Bertelli rose quickly. “This way, please.”\u003c/p\u003e\n\u003cp\u003eIt was hard to tell where glass walls and doors met. They went down a long hallway. Eventually Sherry Bertelli pushed on a glass panel, and they were ushered into another state-of-the-art ultramodern office where Landry was standing behind a black chrome desk.\u003c/p\u003e\n\u003cp\u003e“How do you do, how do you do?” he asked, stepping around to shake their hands. “I’m Stewart Landry. Have a seat, please, have a seat. Would you like coffee or anything?”\u003c/p\u003e\n\u003cp\u003e“No, no, thank you, we’re fine,” Kat assured him. Will held one of the chairs for her, then took his own. Stewart Landry sat back at his desk. Sherry Bertelli just stood there.\u003c/p\u003e\n\u003cp\u003e“That’s all, Sherry, thank you,” Landry said.\u003c/p\u003e\n\u003cp\u003eWithout a word she turned and marched out of the office. Landry cleared his throat. “Sherry’s, uh, very popular with our clientele,” he said, as if excusing his receptionist’s undeniable limitations.\u003c/p\u003e\n\u003cp\u003eLandry was somewhere between fifty and sixty years old. His suit was designer label, his nails were clean and buffed and his silver hair was well groomed. Kat had to wonder if there wasn’t something more intimate going on between him and Sherry than the typical employee-boss relationship.\u003c/p\u003e\n\u003cp\u003e“Now, how can I help you?” Landry asked.\u003c/p\u003e\n\u003cp\u003e“Frankly,” Will said, “we’re trying to find out if you’d considered diving the site of the Jerry McGuen. We understand that a group called the Egyptian Sand Diggers was encouraging local interest and, as I’m sure you’ve read or seen on the news, a diver died at the site.”\u003c/p\u003e\n\u003cp\u003eLandry frowned. “Yes, I saw the news, and I knew Brady Laurie. He was quite angry at that reception and behaved rather badly. He wasn’t a member of the group, made very clear that kind of thing was beneath a true historian such as himself. He argued with the members that he was already on the case, and that he and his colleagues needed to find the treasure, not any of us ‘money-grubbing bastards.’ Don’t get me wrong—the death of any young person is lamentable. But Dr. Laurie was out of line. The Egyptian Sand Diggers invited us all to that soiree, and I think it was because they didn’t believe Laurie was right in his calculations. He was, of course. That’s obvious now.”\u003c/p\u003e\n\u003cp\u003e“Did you plan to dive the site at all?” Kat asked, returning to the original question.\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Honestly? It was an intriguing thought. But as to planning any operation—no. Our big ship is out in Lake Huron working on a ferry that went down. We have some smaller vessels working more shallow waters, but as to the Jerry McGuen… If Laurie hadn’t found her, we might’ve made an attempt to see what our sonar could identify in the area. Thing is, no one really knew exactly where she went down, other than that she was supposedly near Chicago. You might not realize it, but the lake is huge. Searching it is almost like searching the North Atlantic. When you’re just looking at the lake, it seems to stretch out forever. And when you’re boating on it alone, you can feel as if you’re the last man on earth.”\u003c/p\u003e\n\u003cp\u003e“But the treasure in the Jerry McGuen is of inestimable worth,” Will commented.\u003c/p\u003e\n\u003cp\u003eLandry nodded. He smiled suddenly. “But searching for that kind of treasure—needle in a haystack. I can tell you that Brady Laurie was obsessed with it. I wasn’t shocked when I heard about his death. He was threatened by all of us—no, no, that came out wrong. No one ever threatened him, but…check with the Egyptian Sand Diggers. They were pointing out the historic value of the find, which we already knew, and he got furious. Their president is a fellow named Dirk Manning, and what they call their ‘guardian’—an old fellow who’s been involved in it since he was twenty-one—is a man named Austin Miller. Talk to one of them about Brady Laurie. In my opinion, he had no real interest in joining the group, but he probably spoke to those gentlemen more than anyone else. Me? I believe Laurie was so obsessed with the ship that he signed his own death warrant.”\u003c/p\u003e\n\u003cp\u003eWill stood up and shook hands with Landry. Kat stood, too. “If there’s anything I can do, please let me know,” Landry said.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Kat smiled—then remembered Will’s earlier remark about her niceness.\u003c/p\u003e\n\u003cp\u003e“I’ll have Ms. Bertelli show you out,” Landry offered.\u003c/p\u003e\n\u003cp\u003e“We can find our way,” Will told him, “but thanks.”\u003c/p\u003e\n\u003cp\u003eWhen they passed Sherry Bertelli, she was sitting behind her desk, flipping through the pages of a fashion magazine. She looked up long enough to smile vaguely at them and wave. “Ta-ta!”\u003c/p\u003e\n\u003cp\u003e“Yep, ta-ta,” Kat responded.\u003c/p\u003e\n\u003cp\u003eShe didn’t realize Will was laughing until they were in the car again. “Ta-ta?”\u003c/p\u003e\n\u003cp\u003e“I simply returned the courtesy,” she said primly.\u003c/p\u003e\n\u003cp\u003e“I get the feeling they didn’t hire her for her math skills.”\u003c/p\u003e\n\u003cp\u003eKat shook her head and turned to him. “This is just about impossible,” she said. “No one, not even the first responders, really knows if anyone else was near the site when Brady died—or was killed. It sounds like he could be extremely hostile about anything concerning the Jerry McGuen. He did dive alone—and went down almost a hundred feet in cold water. This wasn’t a pleasure dive to a warm-water reef.”\u003c/p\u003e\n\u003cp\u003eWill glanced at her, then looked at the road again. “But you saw his body.”\u003c/p\u003e\n\u003cp\u003e“Yes. I saw his body. And seeing his body made me believe this is worth investigating. But what we saw doesn’t guarantee that Brady Laurie was murdered. There are other explanations for the bruises. It’s possible that he might have gotten into an altercation with someone. He was furious with the Egyptian Sand Diggers and apparently everyone knew it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-11.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
