{"id":90682,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Dial 9-1-1,” she said quietly.\u003c/p\u003e\n\u003cp\u003e“He can be helped!” Manning cried.\u003c/p\u003e\n\u003cp\u003e“No, Mr. Manning, I’m so sorry,” Kat said. “He’s…gone. I’d say he’s been dead a few days, but I don’t have any equipment with me to figure out a more precise time. And, of course, the authorities must be alerted.”\u003c/p\u003e\n\u003cp\u003e“Austin!” Manning wailed.\u003c/p\u003e\n\u003cp\u003eThere were tears not just in his bright blue eyes but streaming down his face. Will placed an arm around his shoulders, trying to turn him so he could lead him from the room. “Mr. Manning, you don’t need to be in here right now.”\u003c/p\u003e\n\u003cp\u003e“Wait!”\u003c/p\u003e\n\u003cp\u003e“What is it?” Will asked him gently.\u003c/p\u003e\n\u003cp\u003e“Horus!”\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003e“Horus—there was a statue of Horus that always sat on Austin’s desk. It’s not there!”\u003c/p\u003e\n\u003cp\u003e“I’ll look for it,” Will said.\u003c/p\u003e\n\u003cp\u003e“You don’t understand. That old codger and I knew each other since we were kids. He was like my big brother. The statue was his father’s and his grandfather’s before that—he said that it would sit there for all of eternity. He wouldn’t have moved it,” Manning insisted. “He wouldn’t have moved it. He wouldn’t have moved it.”\u003c/p\u003e\n\u003cp\u003eWill exchanged a glance with Kat. Then he urged Manning out of the room, steering him to a large upholstered chair tucked against the wall beneath the stairway. “Mr. Manning, sit tight. I’ll look for the statue. First thing, though, we’ve got to get the authorities out here.” He’d pulled his phone from his pocket and, while he kept an eye on Manning, started to dial 9-1-1 but then stopped. Instead, he called the police station they’d visited and asked to speak to Sergeant Riley.\u003c/p\u003e\n\u003cp\u003eWhen Riley came on, he explained where they were and what they’d found.\u003c/p\u003e\n\u003cp\u003e“I’ve seen the old guy written up in newspaper articles and on local broadcasts now and then,” Riley said. “I’m sorry to hear about his death—but why are you calling me about an elderly man dying of a heart attack?”\u003c/p\u003e\n\u003cp\u003e“I want you to come out and investigate it.”\u003c/p\u003e\n\u003cp\u003e“I’ll come, but we don’t really investigate heart attacks when they happen to a man his age,” Riley said.\u003c/p\u003e\n\u003cp\u003e“What if it was caused?”\u003c/p\u003e\n\u003cp\u003e“A drowning was caused and a heart attack is caused?” Riley asked skeptically.\u003c/p\u003e\n\u003cp\u003e“What better way to commit murder?” Will asked in return. “Sergeant, please. I’m afraid these deaths may be the start of something even more sinister. I’d like it if you could pull some rank on this. We’re here on behalf of a friend, but I’ll get my superiors to see that the governor asks us in. Until then…help us out, will you?”\u003c/p\u003e\n\u003cp\u003eRiley agreed, promising that he’d send a medical examiner’s van and ensure that the scene wasn’t trashed. Patting the still-crying Manning on the knee, Will stood and moved away, calling his own boss, Jackson Crow. Jack would talk to Adam Harrison, who’d get them the authority to take over the investigation, which would include any mysterious deaths surrounding the discovery of the Jerry McGuen. “You want to stay on this?” Jackson asked. “Logan and part of his crew should be arriving soon.”\u003c/p\u003e\n\u003cp\u003e“I started with it, so yeah, I’d like to see it through.”\u003c/p\u003e\n\u003cp\u003e“Fine. How is working with a new agent?”\u003c/p\u003e\n\u003cp\u003eWill hesitated, slightly amused. “Okay. At first I felt like I was working with Tinker Bell. Now…she’s all right.”\u003c/p\u003e\n\u003cp\u003eBy the time he hung up, he could hear a siren. The sound seemed to make Manning, if anything, more miserable.\u003c/p\u003e\n\u003cp\u003e“They’ll be coming for me soon,” he muttered. “My oldest, dearest friend is gone. I guess I’m going to be next.”\u003c/p\u003e\n\u003cp\u003e“Mr. Manning, you’re in great shape and you have a lot of wit and knowledge to continue offering the world. Plan on many more years with old friends—and not-so-old friends,” Will said.\u003c/p\u003e\n\u003cp\u003eThey’d left the gate unlocked. Will was gratified to see that Riley had sent two officers to secure the scene. They didn’t go into the den but one stood by the door and the other came over and asked Manning if he needed any assistance.\u003c/p\u003e\n\u003cp\u003eWill was free to return to the den. He paused in the doorway, trying to absorb everything in the room.\u003c/p\u003e\n\u003cp\u003eThe French doors that led out to the patio were open; a breeze was rustling the curtains. Someone could have come in through the patio. Will had noticed a security system control pad near the front entrance, but it hadn’t been set. Maybe Austin Miller typically set it just before he went to bed.\u003c/p\u003e\n\u003cp\u003eThe cat, a slender animal with spotted fur, suddenly jumped over Will’s foot and stalked into the center of the room, meowing loudly.\u003c/p\u003e\n\u003cp\u003eIf only she could talk! Will thought.\u003c/p\u003e\n\u003cp\u003e“Was it a heart attack?” he asked.\u003c/p\u003e\n\u003cp\u003eKat looked up at him. “It appears so, but…this is Chicago jurisdiction,” she said.\u003c/p\u003e\n\u003cp\u003e“I have Jackson Crow getting Adam to arrange an official invitation for us,” he told her. “That’ll give you leave to do the autopsy.”\u003c/p\u003e\n\u003cp\u003eKat stood with a shrug. “We don’t have authority yet. When an M.E. gets here, it’s going to be his or her responsibility.”\u003c/p\u003e\n\u003cp\u003e“But you can be at the autopsy?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “The thing is, I suspect we’ll find out that it was a heart attack. Another ‘accidental’ death.”\u003c/p\u003e\n\u003cp\u003e“So you don’t think it was accidental?”\u003c/p\u003e\n\u003cp\u003e“No. It looks to me as if something terrified him. He knew his heart would give out and reached for his pills, but…I think they were knocked out of his hand. And then whoever, or whatever, watched him die.”\u003c/p\u003e\n\u003cp\u003eThe cat meowed again.\u003c/p\u003e\n\u003cp\u003e“She—Bastet—must be hungry,” Kat said.\u003c/p\u003e\n\u003cp\u003e“And she must be something of a guardian cat, too,” Will noted. “She could’ve left anytime, because the French doors over there are open. But she stayed inside screaming, wanting someone to come and take care of her master.”\u003c/p\u003e\n\u003cp\u003e“I know.” Kat’s eyes were sad.\u003c/p\u003e\n\u003cp\u003e“Have you seen any other disturbance in the room?” Will asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head, and Will moved across the room, exiting onto the stone patio with its wrought-iron chairs and a table with a colorful umbrella. Beyond it was lawn and then the walls and the walkway, all bordered by trees and bushes. The wall wasn’t particularly high, maybe five feet or so. It would’ve been easy for anyone to slip over. But to have come straight to the open doors of Austin Miller’s den, the intruder would’ve needed to know not only the garden but the house. Whoever it was had escaped without being seen. Will walked through the yard, looking for any kind of evidence that anyone had been there—impressions in the soil, broken twigs, fibers caught on the stones. He heard himself hailed as he walked along the wall.\u003c/p\u003e\n\u003cp\u003eSergeant Riley had arrived, and a medical examiner’s van and a hearse had driven up outside the gate. Will hurried over to greet Riley.\u003c/p\u003e\n\u003cp\u003e“I’ll make an initial report,” Riley said, “but we’ve got a man from the Chicago morgue to see to the body.”\u003c/p\u003e\n\u003cp\u003e“Is it McFarland?” Will asked, hoping not.\u003c/p\u003e\n\u003cp\u003e“No, one of our most senior men, and he knows you want your pathologist on it. So if the call comes in from the governor that the feds can have the case, Dr. Randall won’t care. You really think it was more than a heart attack?”\u003c/p\u003e\n\u003cp\u003e“I think it was a heart attack—I just think something led up to it,” Will said. “Can we tape off the house?”\u003c/p\u003e\n\u003cp\u003e“The whole house?”\u003c/p\u003e\n\u003cp\u003e“I believe someone was in there with him.”\u003c/p\u003e\n\u003cp\u003e“Sure. Tape is cheap.” Riley shrugged. “I’ll go in and get things started. You’re lucky I happen to be the one on this,” he said wryly. “Since it looks like a natural death.”\u003c/p\u003e\n\u003cp\u003e“I am lucky. Thanks,” Will told him. Because of Kat, he was trying to be courteous, to show his appreciation. He knew very well that courtesy was the way to deal with other authority figures, witnesses or anyone else they might need, and he usually treated them politely. McFarland had just gotten to him, wanting to close the case so quickly.\u003c/p\u003e\n\u003cp\u003eHe resumed his inspection of the wall, confident that Kat could handle whatever was happening inside.\u003c/p\u003e\n\u003cp\u003eThe yard was large, at least an acre, and the wall encompassed the whole area. He finished walking around it once. He’d noticed nothing unusual and was frustrated, thinking he must have missed something.\u003c/p\u003e\n\u003cp\u003eHe started again.\u003c/p\u003e\n\u003cp\u003eAnd then he found it.\u003c/p\u003e\n\u003cp\u003eHe was about five feet from the corner, to the side of the main entry and the walkway to the front door. A car parked on the side street, he noted, would not be seen from the front, and the street would be dark at night. There were also a number of large oaks along the pathway, and they would have provided shelter and shadows.\u003c/p\u003e\n\u003cp\u003eWhat he’d found told him he was right.\u003c/p\u003e\n\u003cp\u003eThere was a bit of musty old gauze wrapping on the outside of the wall, caught on a snag. It resembled the mummy wrappings of many an old horror flick.\u003c/p\u003e\n\u003cp\u003eIt was the same as the one he’d discovered in the corridor at the hotel.\u003c/p\u003e\n\u003cp\u003eAnd near it, something lay shattered by the wall. The statue of Horus.\u003c/p\u003e\n\u003cp\u003eLooked like the mummy had done it.\u003c/p\u003e\n\u003cp\u003eKat wanted to be alone with the body.\u003c/p\u003e\n\u003cp\u003eBut they were still in Chicago, they were guests here, and she was fortunate that Dr. Randall was inviting her to perform the autopsy with him.\u003c/p\u003e\n\u003cp\u003eShe was at the morgue in a white jacket, her hair pinned into a cap, mask covering her nose and mouth. Austin Miller’s body temperature and lack of rigor led her to the conclusion that he’d died two days earlier, sometime between 8:00 p.m. and 5:00 a.m.—just hours before Brady Laurie had met his end. The stomach contents of the deceased might tell them more if they considered the time of his last meal, along with his known eating habits.\u003c/p\u003e\n\u003cp\u003eShe had expected more resistance from those working with her; after all, Austin Miller had been elderly and he’d been on heart medications. But it seemed that buzz about the “curse” was circulating and everyone, especially Dr. Cranston Randall, seemed ready to help her. It wasn’t that anyone believed in the curse, but it was titillating to think about. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-19.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
