{"id":90685,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAcross the hall, he opened the door to his room and Kat opened the door to hers. “Well…good night,” he said.\u003c/p\u003e\n\u003cp\u003e“Good night.”\u003c/p\u003e\n\u003cp\u003eThey both went into their rooms. For a moment, Will hesitated, wondering if he should knock on the connecting door and ask if she wanted it locked again, now that others were here. Then he wondered why it had even occurred to him—except that, after today, he felt he knew her.…\u003c/p\u003e\n\u003cp\u003eAnd knew that he was incredibly attracted to her.\u003c/p\u003e\n\u003cp\u003eHe shook off the thought and decided just to check out the hallway video on his computer.\u003c/p\u003e\n\u003cp\u003eHe sat down and studied the video feed. He saw Logan and the rest of Kat’s Krewe arrive, and he saw the maids come and go. Nothing else. He had a feeling, though, that they wouldn’t have a visitor again. Not when there were so many agents on the floor.\u003c/p\u003e\n\u003cp\u003eHe drummed his fingers on the desk. Someone wants something.\u003c/p\u003e\n\u003cp\u003eYes, of course, the vast treasures of the Jerry McGuen.\u003c/p\u003e\n\u003cp\u003eBut his intuition said it went deeper than that. Why kill Austin Miller? The elderly gentleman wouldn’t have been anywhere near the ship or the water.\u003c/p\u003e\n\u003cp\u003eHe was pretty sure that whatever was taking place wasn’t a one-person operation. The person who’d gone down to the ship just minutes before Brady Laurie couldn’t have been alone. He’d have needed help, someone nearby on a boat. To the best of Will’s knowledge, there was no scuba gear that would enable anyone to go to that depth—and make it back to the Chicago shoreline.\u003c/p\u003e\n\u003cp\u003eHe scribbled a note on a pad.\u003c/p\u003e\n\u003cp\u003eTiming. Who had access to a small craft—and no alibi for the morning of Brady Laurie’s death?\u003c/p\u003e\n\u003cp\u003eHe yawned, glanced at the connecting door and almost jumped when he heard the cat meow. He rose, rubbed Bastet’s head, stripped down to his briefs. He put the cat on the floor and crawled into bed.\u003c/p\u003e\n\u003cp\u003eHe started to doze off; he was so tired that sleep came quickly. But he was startled awake by the sound of a plaintive cry.\u003c/p\u003e\n\u003cp\u003eHe blinked in the darkness of his room, then turned on his bedside light. The cat was scratching at the connecting door.\u003c/p\u003e\n\u003cp\u003eHe stood and walked over to the cat, picking her up. “Hey, people have to sleep around here, you know? I volunteered to take you. You have to be happy with me.”\u003c/p\u003e\n\u003cp\u003eThe cat meowed pitifully again.\u003c/p\u003e\n\u003cp\u003eAnd then Will heard the sounds from next door. Muffled cries of distress.\u003c/p\u003e\n\u003cp\u003eHe instantly set the cat down and opened his door, then the door to Kat’s room.\u003c/p\u003e\n\u003cp\u003eShe was tossing and turning on the bed, arguing softly—and pushing at something. He couldn’t make out the words.\u003c/p\u003e\n\u003cp\u003eHe hurried to her bedside, sitting next to her and clasping her shoulders. It occurred to him that he should let her sleep, but she seemed to be fighting some real demon in her dream. And losing.\u003c/p\u003e\n\u003cp\u003e“Kat! Kat!” He shook her gently, trying to awaken her from the depths of her dream.\u003c/p\u003e\n\u003cp\u003eShe fought him, striking out violently. He caught her arm to keep her from giving him a good right hook to the jaw or a black eye, and shook her with a little more force.\u003c/p\u003e\n\u003cp\u003e“Kat!”\u003c/p\u003e\n\u003cp\u003eShe bolted up, eyes suddenly wide open, and stared at him.\u003c/p\u003e\n\u003cp\u003e“Will.”\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I—I— Yes, yes, of course,” she said. In the light streaming from his room, he could see her clearly. Her eyes were the brightest, clearest, most beautiful blue he’d ever seen…or could ever imagine. And she might possess the greatest strength and will in the world, but at that moment, she seemed fragile to him.\u003c/p\u003e\n\u003cp\u003e“You were dreaming again.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“The ship—or the mummy?” he asked.\u003c/p\u003e\n\u003cp\u003e“The ship. I was on the ship. I could see everyone, so elegant and beautiful and having a wonderful time. The sky was gorgeous—and then everything changed. The storm came in. I kept hearing people screaming about the curse. And then, when I turned, there was something coming at the ship. Something huge and ominous… You can’t have a tsunami on a lake, can you?”\u003c/p\u003e\n\u003cp\u003e“Well, no, but in a storm… You’ve seen the lake. It’s huge and, in bad weather, the water can be an extreme power.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I just didn’t feel it was part of the storm.”\u003c/p\u003e\n\u003cp\u003eHe could feel her trembling beneath the thin fabric of the oversize T-shirt she wore to bed. He wanted to pull her to him and stroke the softness of her hair, hold her close, feel the beating of her heart, of his own heart….\u003c/p\u003e\n\u003cp\u003eHe started to stand. She reached out to stop him, her movement impulsive. “Will—”\u003c/p\u003e\n\u003cp\u003e“I’ll stay here and work for a while if you want.”\u003c/p\u003e\n\u003cp\u003e“I, um, that’s silly. You need to get some sleep. I need sleep. Like real sleep. Badly.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’m not that much of a sleeper.”\u003c/p\u003e\n\u003cp\u003e“No. You have to go back to bed. You have to. Just leave the doors between the two rooms open.” She hesitated. “Did I scream?”\u003c/p\u003e\n\u003cp\u003eAs if on cue, Bastet leaped up onto the bed beside her.\u003c/p\u003e\n\u003cp\u003eWill laughed. “There’s your answer. The cat was scratching at the door to get into this room. And when I went to stop her, I heard you crying out.”\u003c/p\u003e\n\u003cp\u003eShe smiled, shaking her head. “Okay, Bastet, we’ll keep the doors open. Then you can come and go as you like.” She flushed, looking at Will. “Do you mind? I’m not a coward. I wasn’t best in my class on the firing range, but I did score in the ninetieth percentile. It’s just that…you can’t shoot a dream.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind at all,” he assured her. “I’ll hang around in here if you want.”\u003c/p\u003e\n\u003cp\u003eShe shook her head again firmly. “We have to dive tomorrow. I want you to be well rested.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. “But if you need me, holler!”\u003c/p\u003e\n\u003cp\u003e“I’ll send the guard cat,” she promised. “Oh, would you turn on the small desk light?”\u003c/p\u003e\n\u003cp\u003e“You’ve got it.” He went over and turned the light on, said good-night and left her. She lay back as he did, and he was stricken by the sight of them, Kat and the cat, curled comfortably together in the blankets. At the moment, though, he saw only one of them. The woman. He was gratified that she seemed so comforted by his nearness. Her eyes were closing and she let out a sigh, arms curled around her pillow and blond hair a radiant halo.\u003c/p\u003e\n\u003cp\u003eHe returned to his own bed. He was afraid to dream, even though he wouldn’t dream of the ship or the mummy.\u003c/p\u003e\n\u003cp\u003eHe would dream about Kat Sokolov, her blue eyes intense as sapphires, her hair teasing his skin, and his hands…all over her.\u003c/p\u003e\n\u003cp\u003eHe lay down.\u003c/p\u003e\n\u003cp\u003eAnd prayed for morning.\u003c/p\u003e\n\u003cp\u003eKat was delighted to see Kelsey, Tyler, Jane and Sean in the dining room with Logan when she stepped inside. Her Krewe had become like family to her. She wanted to ask Tyler about his recent vacation and ask Sean about Madison, but they were already deeply involved in the case at hand. Sean rose first to give her a welcoming hug. “Amun Mopat. Can’t get away from the guy,” he said with a grimace.\u003c/p\u003e\n\u003cp\u003e“If we’re lucky, the salvage crew will find the real Amun Mopat’s sarcophagi and mummy,” she said.\u003c/p\u003e\n\u003cp\u003eWill came in behind her; he’d stopped at the coffee stand before joining them. She felt a twinge of guilt, certain that it was her fault he needed the coffee. But he looked alert and well rested. Actually, he seemed more impressive than the first day she’d met him, standing behind the autopsy table that held Brady Laurie’s remains. She suddenly found herself thinking they could be an article in a women’s magazine: Can this relationship work? No, they didn’t meet in a bar or online—they met over the body of a dead man.\u003c/p\u003e\n\u003cp\u003eShe quickly looked away from him. They were working, and today promised to be as long as the day before.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eTrue, she’d initially thought he was a total jerk. Brash, abrasive, out of line. But now it seemed that he’d merely been indignant about work that wasn’t up to par. He could be more than decent, respect her skills and talent, become gentle and empathetic.\u003c/p\u003e\n\u003cp\u003eTyler stood to shake hands with Will, and then, as they all sat down again, Sean and Will immediately got involved in conversation. That was natural, since they were both technical whizzes when it came to computers and cameras. They all ordered; Kat decided she’d just share with Jane because she didn’t want to eat heavily. There was a fair amount of chatter around the table until Logan cleared his throat.\u003c/p\u003e\n\u003cp\u003eHe passed out a stack of folders. “Everything we’ve discovered so far. Will, make sure you have all our numbers on speed dial. Tonight you and Sean will meet up with the film crew when you’ve finished with everything else, so until then… Will and Kat, get going. We’ll be in contact after the dive. Whoever’s most caught up with their research will meet you at Austin Miller’s house.”\u003c/p\u003e\n\u003cp\u003eWill nodded. He rose, and Kat rose beside him.\u003c/p\u003e\n\u003cp\u003e“Have fun, you two,” Tyler said, rising. Despite his respect for his female colleagues, Tyler stood whenever a woman did, and whenever she entered a room. Sean Cameron was like that, too. It made Kat smile. Sean always said it was a Texas thing. Or maybe they just couldn’t let an old courtesy die.\u003c/p\u003e\n\u003cp\u003e“It’ll be a blast,” Kat said.\u003c/p\u003e\n\u003cp\u003eJane shivered. “I don’t envy you in the least. That water is cold!”\u003c/p\u003e\n\u003cp\u003e“Ain’t it the truth.” Kat smiled at Jane. Her coworker was a trim, attractive woman and a brilliant artist. She could have been doing just about anything. She had an uncanny ability to draw a face from someone else’s description—or to build a recognizable face from the skull of a dead man.\u003c/p\u003e\n\u003cp\u003e“I think I’ll be diving with you tomorrow,” Sean said. He rolled his eyes at Kat. “I guess we’re in this one because of Bernie, Alan and Earl, so…”\u003c/p\u003e\n\u003cp\u003e“Yeah, you’re right. You get your just-vacationed butt down there!” Kat teased him.\u003c/p\u003e\n\u003cp\u003e“We’ll be in touch as soon as we’re up and out,” Will said.\u003c/p\u003e\n\u003cp\u003eThey left, pulling their equipment. Although it would’ve been easier to leave it on the boat yesterday, Will had decided they should keep their hands on their personal dive gear; he didn’t intend to take any chances. And he was right, she thought. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-22.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
