{"id":90695,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWill shrugged. “You’d hope so,” he said.\u003c/p\u003e\n\u003cp\u003eEarl took a step into the cabin. “Transport is here,” he told them.\u003c/p\u003e\n\u003cp\u003eWill had no idea how Captain Bob and Jimmy managed to stay calm while working with Amanda, but they were pleasant and ready to move with their usual speed and competence when they picked up the film crew, plus Sean and Will. Two of Alan King’s security guys remained on the control boat, including the young man who’d resumed watching the screen.\u003c/p\u003e\n\u003cp\u003eWill stood with Captain Bob as he took the helm.\u003c/p\u003e\n\u003cp\u003e“Press has gone wild.” Bob rolled his eyes. “The dock was a zoo when we came back in.”\u003c/p\u003e\n\u003cp\u003e“I guess it’ll be frenzy for a while. This is pretty momentous. Finding a ship in one of the Great Lakes would be enough, but the Jerry McGuen held a mummy,” Will said. “I assume the crate made it safely off the dock?”\u003c/p\u003e\n\u003cp\u003e“I make sure things like that happen, you know. This is our living,” Captain Bob said with a grin. “And your friend, Mr. King, pays very nicely.”\u003c/p\u003e\n\u003cp\u003e“Glad to hear it,” Will said, grinning back.\u003c/p\u003e\n\u003cp\u003eThirty minutes later, he and Sean were dropped off at the hotel. Will’s cell rang as they left the elevator—Kat, saying that she and Tyler had just reached the center, and Amanda and her team were waiting for the documentary crew to arrive. Kat spoke quietly, and he knew she didn’t intend to be overheard.\u003c/p\u003e\n\u003cp\u003e“Will, I got some interesting information off Amanda’s cell phone. Tyler and I have been checking out her recent communications. She sent a threatening email to both of the major salvage companies who had contact with the Sand Diggers. But she also called Landry Salvage—every day!”\u003c/p\u003e\n\u003cp\u003e“Who was she speaking to?”\u003c/p\u003e\n\u003cp\u003e“The switchboard. We can’t track calls to specific extensions, only to the main number.”\u003c/p\u003e\n\u003cp\u003e“There’s something…fishy about that woman,” Will said drily. “We’ll have to look into it. Does Logan have a report on anyone who might have a diving motor device?”\u003c/p\u003e\n\u003cp\u003e“Both Landry and Simonton have one. He found a few others that were privately owned, but he’s already gotten alibis on those. Oh, and a few companies up in Wisconsin have them, but from what he can discover, they can’t be connected to what’s going on here.”\u003c/p\u003e\n\u003cp\u003e“All right, thanks. Sean and I will be there in about thirty minutes. Don’t start the party without us.”\u003c/p\u003e\n\u003cp\u003eThe crate was going to be opened in a climate-controlled clean room and everyone present had to be suited up—face masks, booties, hair in a gauze cap.\u003c/p\u003e\n\u003cp\u003eThe area was kept cool to avoid degradation that might set in with any kind of heat. Even a speck of dust could harm certain instruments or damage artifacts that had been underwater for years. They wore masks to avoid contaminating the objects…and to protect themselves from any ancient bacteria or microorganisms that might have survived.\u003c/p\u003e\n\u003cp\u003eThere were sterile stainless-steel tables to receive the treasures in the crates, but everything, including the crowbars, had been sterilized first. Earl’s camera and the microphone and boom had to be cleaned and covered, as well. If she wasn’t consumed by the fact that they were looking for a murderer, Kat would have found the whole procedure fascinating.\u003c/p\u003e\n\u003cp\u003eShe was already gowned and masked when Will and Sean showed up, but Will came right over to her. She raised a brow and he grinned behind his mask. “At last—all shall be revealed.” And although she couldn’t forget the murders for a second, Kat suddenly felt excited.\u003c/p\u003e\n\u003cp\u003eDespite all the precautions and the machinery, pure brawn was needed at times. Will, Sean and Tyler were called upon to help as the giant crate was dismantled. There was layer after layer of packaging, which was in itself a historic find. Canvas and wood chips had been used for waterproofing inside the crate and under the tarp; another box was beneath those, and it took well over an hour to get through the packing to the real treasure. But then they reached it.\u003c/p\u003e\n\u003cp\u003eThe outer sarcophagus was the size of a coffin and a half. It had been carved out of granite and was staggeringly heavy. Even with the use of robotic arms, winches and small cranes, it took real effort by all the men to maneuver it.\u003c/p\u003e\n\u003cp\u003eJon Hunt was as much in awe as Amanda, remarking on the preservation of the sarcophagus, the beauty, the design.\u003c/p\u003e\n\u003cp\u003eExtremely carefully, the seals were broken, and the lid was finally removed.\u003c/p\u003e\n\u003cp\u003eBeneath it lay another sarcophagus.\u003c/p\u003e\n\u003cp\u003eEarl moved the camera close, and Bernie wielded the microphone while Amanda explained the intricate designs and what they signified. Amun Mopat had seen himself as perhaps greater than the pharaoh he’d served, and that pharaoh had been one of the most powerful ever to rule. She spoke briefly about the New Kingdom and the glorious reign of those pharaohs and their priests. Toward the end of her talk, she pointed to hieroglyphics on the coffin depicting creatures who’d had so much significance in Egyptian life, such as the cobra, the jackal and the cat.\u003c/p\u003e\n\u003cp\u003eThen it was time to open the inner sarcophagus. There was silence when the lid was lifted.\u003c/p\u003e\n\u003cp\u003eKat almost gasped aloud.\u003c/p\u003e\n\u003cp\u003eAmun Mopat wore a gold and bejeweled death mask, which depicted him in the prime of life.\u003c/p\u003e\n\u003cp\u003eHis face, on the mask, was the face she’d seen in her dreams.\u003c/p\u003e\n\u003cp\u003eWill knew that he and every member of the Krewe tried not to stare at Kat.\u003c/p\u003e\n\u003cp\u003eBut, of course, they’d all seen the picture Jane had drawn from Kat’s description, and now…there he lay.\u003c/p\u003e\n\u003cp\u003eIn death.\u003c/p\u003e\n\u003cp\u003eKat didn’t move; she barely blinked. She didn’t give away a thing in front of the others. Will was impressed by her lack of reaction. Eyes were the most telling feature on the human face, and her eyes were all that was truly visible.\u003c/p\u003e\n\u003cp\u003eAmanda noticed nothing at all wrong. She marveled at the discovery for the camera and the microphone and went on to say how they wouldn’t disturb the mummy further until it had been CAT scanned, X-rayed and all the noninvasive work possible was done. At the end, she preened for the camera, Earl Candy shot the mummy from all angles and Amanda announced that they were done for the day.\u003c/p\u003e\n\u003cp\u003eBut when Earl turned off the camera, she was still staring at the mummy.\u003c/p\u003e\n\u003cp\u003e“What?” Jon asked her.\u003c/p\u003e\n\u003cp\u003e“We haven’t lifted the mask,” she murmured. “But…I thought the scepter would have been in the sarcophagus.”\u003c/p\u003e\n\u003cp\u003e“Amanda, are you ever happy?” Jon burst out. “We’ve found the mummy. The mummy, Amanda. And it’s in excellent shape, and all the outer trappings are just about perfect. I’m going out for a drink to celebrate. Who’s coming with me?”\u003c/p\u003e\n\u003cp\u003e“I’m in!” Earl exclaimed. “I am so in!”\u003c/p\u003e\n\u003cp\u003e“Let’s get out of these bunny suits and take a little time to relax,” Bernie agreed. He appeared to be extremely happy.\u003c/p\u003e\n\u003cp\u003eWill glanced at Alan King.\u003c/p\u003e\n\u003cp\u003eAlan was more cautious, but he nodded. “It’s late, no one’s eaten since lunch, and I’d say we owe ourselves a celebration.”\u003c/p\u003e\n\u003cp\u003e“I’ve got a bottle of fifty-year-old tequila in my office. I bought it off a Mexican. I’m not stealing any treasures!” Jon said. “Shots all around!”\u003c/p\u003e\n\u003cp\u003e“Out of the clean room—and out of the bunny suits!” Amanda said, joining in, if rather belatedly.\u003c/p\u003e\n\u003cp\u003eWill stayed close to Kat as they exited first into the alcove, where they removed their “clean” covering, and then into the lobby. Jon Hunt led the way to the conference room and excused himself while he went to get the tequila. One of the interns entered, bearing platters of snacks, and the receptionist hurried in, too. She was looking at her watch, however—anxious to leave for the day. Will had the feeling that momentous discoveries didn’t mean as much to her as the fact that she was already in for massive overtime.\u003c/p\u003e\n\u003cp\u003e“I am one of the few who loathe tequila,” Kat whispered to him.\u003c/p\u003e\n\u003cp\u003e“Just raise the glass!” he told her.\u003c/p\u003e\n\u003cp\u003eSoon, they were assembled and the shots passed around. Earl balanced his while he held the camera; he wanted the celebration on film.\u003c/p\u003e\n\u003cp\u003e“To Brady Laurie and his vision. May he rest in the heaven of his choice! Brady, we are so grateful to you. Wherever these treasures may go, your name will be held in high esteem,” Alan said.\u003c/p\u003e\n\u003cp\u003e“To Brady!” the others chorused.\u003c/p\u003e\n\u003cp\u003eFor a while, the group remained seated around the table, chatting. Will asked Jon Hunt about the security they had for the center.\u003c/p\u003e\n\u003cp\u003e“We have a state-of-the-art alarm system,” Jon said. “And a guard on duty at the reception desk through the night.”\u003c/p\u003e\n\u003cp\u003eLogan stepped over to join them. “We’ll have a team from the Chicago office of the FBI watching the building tonight, too,” he said. “And the Chicago police are aware of the discovery—and the risk of fortune-seekers breaking in.” He looked at Jon. “I’d say it’s time to get it all locked down for the night.”\u003c/p\u003e\n\u003cp\u003eEveryone seemed to agree. The visitors were ushered out, waiting in front while the center employees closed the offices. Will met with the guard who came in for his shift. The man tried to seem assured, but he obviously hadn’t expected to be guarding a place that might be under siege.\u003c/p\u003e\n\u003cp\u003eAs they stood on the lawn in front of the center, Will stepped over to Logan. “Should one of us stay here through the night?” he asked.\u003c/p\u003e\n\u003cp\u003eLogan sighed. “Not you or Kat. She’s the key on this, and you’ve been working with her. You two need the rest. Like I said, we’ve got a couple of local agents who are going to be watching, but I’ll have Tyler and Jane on lookout for a while. Kelsey and I will hold it down while they get some dinner, and then they can take over. I believe there’s a break in the diving tomorrow?”\u003c/p\u003e\n\u003cp\u003eWill nodded. “Amanda wants to play with her new toy,” he said.\u003c/p\u003e\n\u003cp\u003eLogan drew closer. “Kat’s vision was of Amun Mopat himself.” He spoke in a low voice.\u003c/p\u003e\n\u003cp\u003e“Yes, but I don’t believe the ancient ghost of a priest caused a ship to sink.”\u003c/p\u003e\n\u003cp\u003e“And you don’t think the storm caused it to sink?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t. Today I studied the way she went down. My guess is she was rammed.”\u003c/p\u003e\n\u003cp\u003e“Sunk on purpose?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-32.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
