{"id":90697,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut all at once she went from that place of warmth and safety to another, somewhere else. It was as if she’d suddenly been drawn to the television screen, and then into it.\u003c/p\u003e\n\u003cp\u003eShe was part of The Mummy—now in living color.\u003c/p\u003e\n\u003cp\u003eIt really didn’t frighten her at first. It was so silly! The mummy moved slowly—all anyone had to do was outrun it!\u003c/p\u003e\n\u003cp\u003eShe’d often thought so. Only silly girls screamed, did nothing and fell down while staring at the mummy and walking backward.\u003c/p\u003e\n\u003cp\u003eBut now, she wasn’t in a movie anymore, and it wasn’t a movie mummy lurching awkwardly toward her. Instead, there were dozens of mummies, and when she turned to run, there were more of them, behind her and on either side.\u003c/p\u003e\n\u003cp\u003eThere was nowhere to run.\u003c/p\u003e\n\u003cp\u003eShe was suddenly fighting them, smashing at them, kicking them, wrenching and tearing. She was an M.E., for God’s sake, and she could make them all fall apart. In the early days of Egyptology, she knew, mummies had been so plentiful they’d been used as fuel for home and cooking fires. She could beat them.\u003c/p\u003e\n\u003cp\u003eBut they were strong….\u003c/p\u003e\n\u003cp\u003eSo many…\u003c/p\u003e\n\u003cp\u003eAnd coming through them, one who wasn’t a mummy, one who seemed to be a living, breathing human.\u003c/p\u003e\n\u003cp\u003eAmun Mopat.\u003c/p\u003e\n\u003cp\u003e“Not in my name,” he cried out to her. “Not in my name!” he said again. “Don’t they understand? You put something in a man’s mind, and he believes it. But I will have it no more. Not in my name.”\u003c/p\u003e\n\u003cp\u003eShe stopped because she was so astounded. And then she could feel the things, closing in on her, touching her. She twisted and turned, and saw that Amanda Channel was walking toward her from one direction and Amun Mopat from the other.\u003c/p\u003e\n\u003cp\u003eAnd then, her strange realm was pierced by a loud shrieking.\u003c/p\u003e\n\u003cp\u003eIt was Amanda. She was screaming in terror.\u003c/p\u003e\n\u003cp\u003eKat woke with a start.\u003c/p\u003e\n\u003cp\u003eAt her side, Will instantly woke, as well. Alert to danger, he sat up, reaching automatically into the drawer at the side of the bed, as if he’d forgotten they were in her room. It didn’t matter, though. That was where she kept her service Glock, too.\u003c/p\u003e\n\u003cp\u003e“What?” he asked. His voice was thick; he’d been sleeping soundly. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Did you hear a scream?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe jumped out of bed, racing around to find fresh clothing.\u003c/p\u003e\n\u003cp\u003e“Kat?”\u003c/p\u003e\n\u003cp\u003eShe grabbed panties and a pair of jeans from her drawer. “Will, come on! We have to go.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“The Preservation Center. Something’s happening there.”\u003c/p\u003e\n\u003cp\u003e“Kat, it’s not even six. Tyler and Jane are in a car, watching the place. There are two other agents and the cops are going by constantly. Are you—”\u003c/p\u003e\n\u003cp\u003e“Sure? Yes, positive. Will, something is happening there. Please come with me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t have to ask again. He was out of bed, hurrying to his own room to dress and retrieve his weapon.\u003c/p\u003e\n\u003cp\u003eThere was very little traffic. They parked directly in front of the center in a no-parking zone, but Will didn’t care and neither did she. Tyler got out of his rental as she ran toward him.\u003c/p\u003e\n\u003cp\u003e“Kat! What’s the matter?”\u003c/p\u003e\n\u003cp\u003e“Have you seen anything? Has Amanda come back here?” she asked.\u003c/p\u003e\n\u003cp\u003e“No, nothing. Those are the other feds right over there and the police have been around every fifteen minutes, like clockwork,” Tyler said.\u003c/p\u003e\n\u003cp\u003eJane, looking slightly disheveled from sitting up in the car all night, was beside them a moment later.\u003c/p\u003e\n\u003cp\u003e“We’ve got to get that guard to let us in,” Kat said urgently.\u003c/p\u003e\n\u003cp\u003eShe led the way, almost running as they all followed her.\u003c/p\u003e\n\u003cp\u003eAt the door, she paused. Beyond the plate-glass doors, she could see the guard.\u003c/p\u003e\n\u003cp\u003eHe lay on the floor in a pool of blood, his gun in his outstretched hand.\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eThe center’s glass front doors were still bolted shut.\u003c/p\u003e\n\u003cp\u003eAlthough the guard, lying by the shadow of the reception desk, appeared to be dead, they couldn’t wait. If there was a chance he was alive, they had to get in.\u003c/p\u003e\n\u003cp\u003eWill tried ramming his shoulder against the door to smash it, joined by Tyler, but the heavy safety glass didn’t break. “Stand back,” Will said. He raised his Glock and shot out the glass. He noted in the back of his mind that the center’s alarm didn’t go off. He heard the sound of glass shattering and emergency sirens approaching the center, which meant someone had called 9-1-1.\u003c/p\u003e\n\u003cp\u003eHe wrapped his hand in his jacket and reached in, undoing the bolts. They were inside the center in a matter of seconds. Kat immediately went to the man on the floor, feeling for a pulse. She looked up. “He’s got a pulse—it’s faint, but he’s got a pulse!”\u003c/p\u003e\n\u003cp\u003eWill hunkered down by her side. “Gunshot wound to the chest,” she said. “Missed the heart…we need an ambulance…like ten minutes ago.” She had taken off her jacket and used it to apply pressure to the wound. She nodded at Tyler, who’d had some paramedic training. He got down on his knees and listened to her quick words of instruction, taking over from her, applying pressure to stop the bleeding while she ripped off the man’s tie and wrenched open buttons. She looked over at Will. “Go—someone is in here. Amanda’s here for some reason…I just know it. Please, Will, go.”\u003c/p\u003e\n\u003cp\u003eWill indicated that Jane should take the conference room while he moved toward the climate-controlled area. The two agents who’d watched the center from a distance had entered behind them. The older of the two, a tall, dark-haired man of about forty, nodded at him and then at his partner. The older agent accompanied Will, while the younger man followed Jane.\u003c/p\u003e\n\u003cp\u003eWill and the other agent passed the entry and turned to the left. They paused at the first workroom, positioned themselves on either side of the door. The agent counted off three with his fingers and Will kicked it in.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long to see that the room was empty, except for a statuette on the work stand in the process of being cleaned.\u003c/p\u003e\n\u003cp\u003eThey went down the hall and reached the climate-controlled room. Heavy plastic barriers guarded the area where the “bunny” suits were kept; steel racks held boxes of gloves, masks and booties. The plastic barriers could have hidden a person, and the two men held back again, communicating silently. The agent pulled back one of the plastic slats while Will stepped forward, Glock tightly gripped in both hands.\u003c/p\u003e\n\u003cp\u003eWill passed through the dressing area and came to the next plastic barrier, just before the entry to the clean room. The other agent was behind him.\u003c/p\u003e\n\u003cp\u003eA double sheet of plastic hung in front of the clean room itself. He moved it, looking in, thinking of the care they’d taken that day and aware that he wasn’t at all clean. The preservation of history, however, had to take a backseat to the protection of the living.\u003c/p\u003e\n\u003cp\u003eThe giant outer sarcophagus lay as they’d left it twelve hours before; the inner sarcophagus was on the stand, also exactly as they’d left it.\u003c/p\u003e\n\u003cp\u003eThere was nothing else in the room other than the steel racks of sterile equipment and the two giant sarcophagi.\u003c/p\u003e\n\u003cp\u003eWill stepped carefully forward to look in both. The first was empty.\u003c/p\u003e\n\u003cp\u003eHe went to the second, where the death mask lay over the mummy of Amun Mopat.\u003c/p\u003e\n\u003cp\u003eAnd that was where he found her.\u003c/p\u003e\n\u003cp\u003eDr. Amanda Channel—wedged next to the fragile mummy, eyes closed, arms crossed over her chest.\u003c/p\u003e\n\u003cp\u003eThe paramedics arrived in less than three minutes.\u003c/p\u003e\n\u003cp\u003eStill, Kat knew the guard had suffered a great deal of blood loss. Without causing further trauma, the best she could do while waiting was staunch the flow of blood and ease his breathing and that, with Tyler’s help, she’d accomplished. When the emergency techs rushed in, she told them her findings and stepped back. Tyler stood at her side.\u003c/p\u003e\n\u003cp\u003eA couple of minutes later, she saw Jane returning from a search of the conference room to the right of the entry. A young FBI man in a suit was with her.\u003c/p\u003e\n\u003cp\u003e“Anything?” she asked.\u003c/p\u003e\n\u003cp\u003eJane shook her head.\u003c/p\u003e\n\u003cp\u003eKat heard the med techs talking to one another, their voices quiet as they assessed the victim and worked on him before transferring him to a portable gurney. Then she saw that Will and a second FBI man were walking toward them.\u003c/p\u003e\n\u003cp\u003eWill looked tense.\u003c/p\u003e\n\u003cp\u003e“Amanda Channel,” he said.\u003c/p\u003e\n\u003cp\u003e“She’s…here?”\u003c/p\u003e\n\u003cp\u003e“She’s dead.”\u003c/p\u003e\n\u003cp\u003e“Dead? No pulse, nothing?” Kat asked. “Where?”\u003c/p\u003e\n\u003cp\u003eShe pushed past him before he could stop her.\u003c/p\u003e\n\u003cp\u003e“The clean room, Kat. And she is dead. Believe me.”\u003c/p\u003e\n\u003cp\u003eShe believed him; still, she had to check for herself. The guard stood a small chance of surviving, so, even knowing that Will was probably right, she hurried to find Amanda.\u003c/p\u003e\n\u003cp\u003eGiving no thought to dust or germs, Kat rushed through the layers of protection to get to the clean room.\u003c/p\u003e\n\u003cp\u003e“The sarcophagus,” Will called from behind her.\u003c/p\u003e\n\u003cp\u003eShe came to an abrupt halt, staring in shock at Amanda tucked into the sarcophagus with her beloved mummy. The woman had been as slim as a reed, which was the only reason she fit. She was wedged beside the preserved remains of the long-dead priest. No ancient linen wrap covered her, but her arms were crossed in the typical fashion of ancient Egyptian burial. Kat took a shaky breath and ran over to check for a pulse or a sign of breath. She felt Amanda’s cooling flesh and knew, before using any instruments, that the woman was far beyond medical help.\u003c/p\u003e\n\u003cp\u003eWill came to stand by her side. “How long?” he asked softly.\u003c/p\u003e\n\u003cp\u003e“Core body temperature drops at an estimated rate of 0.8K every hour from the time of death,” she said, “But there are variables, this room being one of them. A number of factors can be part of determining the exact time—humidity levels, air movement and, in Amanda’s case, the fact that there are very few fat cells in her body. Rigor mortis has just started to set in, so…”\u003c/p\u003e\n\u003cp\u003e“Rigor mortis can set in soon after death, right?”\u003c/p\u003e\n\u003cp\u003e“Right. In half an hour or less. We’ll know more at the morgue.”\u003c/p\u003e\n\u003cp\u003e“Can you tell how she died?” he asked.\u003c/p\u003e\n\u003cp\u003eThere were no visible signs of trauma on the body. Kat examined her eyes for petechial hemorrhage, then shook her head. “She wasn’t strangled. I’m assuming it has to be from some kind of toxin in the body. I’m not seeing any blood or signs of outer damage.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-34.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
