{"id":90704,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe ship in the painting rode the high waves with majestic beauty.\u003c/p\u003e\n\u003cp\u003e“The Jerry McGuen,” Dirk Manning said, standing behind her.\u003c/p\u003e\n\u003cp\u003e“She was a beautiful ship,” another voice said.\u003c/p\u003e\n\u003cp\u003eKat turned. Manning looked at her, and she smiled. “He’s here, Dirk. Austin is here. I can’t explain how to see him or feel him, but he’s here.”\u003c/p\u003e\n\u003cp\u003eDirk sat down in the chair behind the desk, hard.\u003c/p\u003e\n\u003cp\u003e“He can’t see me, can he?” Austin asked her sadly.\u003c/p\u003e\n\u003cp\u003e“No, not now, but he may,” she said. “Later on.”\u003c/p\u003e\n\u003cp\u003e“He who?” Dirk asked, his expression lost. “Me?”\u003c/p\u003e\n\u003cp\u003e“Yes. But Dirk, I swear to you, he’s here with us.”\u003c/p\u003e\n\u003cp\u003eTears stung Dirk Manning’s eyes. “My old friend. My good friend!” he said softly.\u003c/p\u003e\n\u003cp\u003e“You be careful.” Austin set a hand on Dirk’s shoulder. “You be careful, my friend.”\u003c/p\u003e\n\u003cp\u003eManning trembled. “I feel…something. Like a little chill,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Austin’s standing right behind you,” Kat told him. “That’s what you felt, Dirk. His presence.”\u003c/p\u003e\n\u003cp\u003eAustin frowned at Kat. “And you, young lady! You repeat my words just as I say them, do you understand? What were you up to last night? You said things I didn’t!”\u003c/p\u003e\n\u003cp\u003e“Mr. Miller, I’m trying to lure your killer into the open.”\u003c/p\u003e\n\u003cp\u003e“You might have gotten a young woman killed!” he said indignantly.\u003c/p\u003e\n\u003cp\u003e“If that young woman and the others hadn’t rushed off in such a fright, nothing would have happened. All right now, both of you—what can you tell me about the sinking of the Jerry McGuen?”\u003c/p\u003e\n\u003cp\u003eDirk gave her a half smile. “I’m old—but not that old.”\u003c/p\u003e\n\u003cp\u003e“But you two know so much. What do you think of this? Will Chan believes the ship might have been purposely sunk—rammed by an icebreaker on the lake. Have you ever heard such a story?”\u003c/p\u003e\n\u003cp\u003e“An icebreaker…” Dirk murmured. “Of course, many shipping companies were using icebreakers on the Great Lakes by the turn of the century. So was the Coast Guard.”\u003c/p\u003e\n\u003cp\u003e“Why would an icebreaker have been used to sink the Jerry McGuen?” Austin muttered with a frown.\u003c/p\u003e\n\u003cp\u003e“I don’t know. That’s why I’m asking you two,” Kat said.\u003c/p\u003e\n\u003cp\u003e“Is Austin speaking?” Dirk asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You can see him? You can have conversations with him?”\u003c/p\u003e\n\u003cp\u003e“Yes. And you can feel him. I see that you do,” Kat said. “Okay, listen. This is what we think. Whoever is doing this isn’t after treasure. Any treasure belongs to the State of Illinois, or probably to the Egyptian people. Our theory is that the person or persons behind this followed Brady’s steps and actually reached the Jerry McGuen first, but they didn’t go down to get various little pieces or even big pieces that they might put on the black market. I believe they’re after something specific for reasons that have nothing to do with money or with Egyptology, per se. Someone purposely sank the Jerry McGuen because of whatever this object might be. And someone is killing now, with the express purpose of recovering that object. Someone or several someones,” she added.\u003c/p\u003e\n\u003cp\u003eDirk stared at her blankly. Then he said, “Ask Austin. He has a book somewhere with pictures of ships from the late 1800s, including the icebreakers of the time. Maybe you can find what you’re looking for there.”\u003c/p\u003e\n\u003cp\u003eKat wasn’t sure what she’d discover by studying the ships, but it was worth a try.\u003c/p\u003e\n\u003cp\u003e“Where is the book, Austin?” she asked.\u003c/p\u003e\n\u003cp\u003e“Under the golden jackal in the display case,” Austin told her. He walked to the case and pointed. “Here.”\u003c/p\u003e\n\u003cp\u003eKat pulled it out and brought it to the desk, sitting in the guest chair across from Dirk. She began to flip through the pages, wondering what she could see in a photograph.\u003c/p\u003e\n\u003cp\u003eThen she froze. The picture had been taken more than a hundred years ago and it was grainy and unclear, but it gave her what she wanted.\u003c/p\u003e\n\u003cp\u003eShe turned the book to face Manning and shoved it toward him.\u003c/p\u003e\n\u003cp\u003e“She was called the Egyptian,” Kat said.\u003c/p\u003e\n\u003cp\u003e“Yes, yes, I’ve seen pictures of her. But she went down, too.”\u003c/p\u003e\n\u003cp\u003e“When?” Kat grabbed the book back.\u003c/p\u003e\n\u003cp\u003e“The same year the Jerry McGuen went down, but she was discovered decades ago. She’s in deep water, below two hundred feet. And she’s completely wrecked—pieces scattered all over the lake bed,” Manning said.\u003c/p\u003e\n\u003cp\u003e“But she was an icebreaker, right?”\u003c/p\u003e\n\u003cp\u003eManning tapped the book impatiently. “That’s what it says, is it not?”\u003c/p\u003e\n\u003cp\u003e“Look at her closely. What’s that on the bow?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“A figurehead. Ships back then had figureheads.”\u003c/p\u003e\n\u003cp\u003e“Look at it closely,” Kat insisted.\u003c/p\u003e\n\u003cp\u003eManning bent over the book. “The figurehead’s an Egyptian man. It’s a myth, really, that all figureheads were female. I’ve seen stunning examples of figureheads that were carved as males. That one is of—”\u003c/p\u003e\n\u003cp\u003eHe looked up at Kat.\u003c/p\u003e\n\u003cp\u003e“That’s Amun Mopat,” she finished for him. “That’s the exact image of the death mask on the mummy.”\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eWill was eager to speak with Dirk Manning. Now that he knew the medical examiner had given a speech that was, for all intents and purposes, on ways to kill without being detected, he wanted to know precisely who among the Egyptian Sand Diggers and their so-called associates had been at the lecture.\u003c/p\u003e\n\u003cp\u003eBut when Kat answered his call, he noticed that her tone was odd, and before he could make his request, she told him what she’d learned.\u003c/p\u003e\n\u003cp\u003e“So, there really was an icebreaker, and it was named the Egyptian and it went down the same year,” he summarized.\u003c/p\u003e\n\u003cp\u003e“Yes, and the figurehead was Amun Mopat,” she said.\u003c/p\u003e\n\u003cp\u003e“Well, it explains your dream.”\u003c/p\u003e\n\u003cp\u003e“I’m looking up more information on it now,” she told him.\u003c/p\u003e\n\u003cp\u003e“Great. Find out anything you can. And tell Dirk Manning what I need the names of all those who were at Dr. McFarland’s lecture.”\u003c/p\u003e\n\u003cp\u003e“I’ll do that.”\u003c/p\u003e\n\u003cp\u003e“Ask him to write up a list for me,” Will said. “And in the meantime, ask him if Stewart Landry and Andy Simonton attended. I think it’s time to bring them in for questioning, as well.”\u003c/p\u003e\n\u003cp\u003eHe heard Kat speaking with Dirk; a moment later she came back to the phone. “Yes, Will. Both men were there. The lecture was presented at a barbecue luncheon at the Sand Diggers’ mansion.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Kat. I’m going to see that both men are now invited down to the station for a bit of discussion.”\u003c/p\u003e\n\u003cp\u003e“We still don’t have any proof,” she said.\u003c/p\u003e\n\u003cp\u003e“Yes, but those two are looking more and more suspicious. They both have small boats that would work well as dive boats. Both men own diver motor devices, and both have been with the Sand Diggers. If they were connected with Brady Laurie or Amanda in any way, they’d know about the facilities at the Preservation Center, and if Amanda had relationships with either of these men, she might have thought she was encouraging help while she was giving away information she shouldn’t have been. I don’t know how it all fits together yet, but I feel we’re making progress. And questioning the men in a police station might get more out of them, just as it did with Dr. McFarland.”\u003c/p\u003e\n\u003cp\u003e“You go for it,” Kat said. “I’ll keep reading.”\u003c/p\u003e\n\u003cp\u003e“Keep me posted on whatever you learn.”\u003c/p\u003e\n\u003cp\u003e“Okay. Oh, anything from Jane or Kelsey about the guard?”\u003c/p\u003e\n\u003cp\u003e“Not that I’ve heard,” Will replied.\u003c/p\u003e\n\u003cp\u003eThey rang off a minute later.\u003c/p\u003e\n\u003cp\u003e“Who should we bring in first?” Tyler asked him. “Landry or Simonton?”\u003c/p\u003e\n\u003cp\u003e“I say we bring them both in,” Will said. “Make sure each knows the other is there, and then we’ll see if any accusations fly.”\u003c/p\u003e\n\u003cp\u003eTyler nodded in agreement. “I’ll tell Riley to send out escorts with our invitation.”\u003c/p\u003e\n\u003cp\u003e“Your grandfather would have been a talented journalist,” Kat told Austin Miller.\u003c/p\u003e\n\u003cp\u003e“My grandfather?” Dirk asked her blankly.\u003c/p\u003e\n\u003cp\u003e“Sorry. Austin’s grandfather,” Kat said. “Austin, can you show me which of these might have been written after the Jerry McGuen went down?”\u003c/p\u003e\n\u003cp\u003eAustin tried to push the journals toward her, but his spectral fingers went right through them. Impatiently, he tried again.\u003c/p\u003e\n\u003cp\u003eA book moved half an inch.\u003c/p\u003e\n\u003cp\u003eDirk Manning jumped to his feet, staring at the journals and then at Kat.\u003c/p\u003e\n\u003cp\u003e“He’s really here. I mean…really,” he said, his voice a mere breath.\u003c/p\u003e\n\u003cp\u003e“Yes, and I think this is the book I want,” Kat said, picking up the journal he’d indicated. It was dated late February, about two months after the sinking of the Jerry McGuen.\u003c/p\u003e\n\u003cp\u003eSince the two men were with her, she read aloud.\u003c/p\u003e\n\u003cp\u003e“‘The Egyptian was lost today—the news was terrible. Twenty-two men on board, and not a survivor among them. But then, I always thought Captain Ely was more of a fanatic than any man on a dig. He was a believer. His wife told me once that he adhered to spiritualism and that he had an intense belief in magic, in ghosts—and in curses. I spoke to him once, soon after the loss of the Jerry McGuen. He told me that men were fools if they did not believe in a higher power. I assured him that I was a good and active member of the Episcopal Church. He shook his head and said I did not begin to understand all the powers we could not see. He told me that day that the Jerry McGuen had gone down because of the curse, that no man should have interfered with the tomb of Amun Mopat. I should’ve known, he told me. Amun Mopat had been a powerful sorcerer. He had maintained vast power through his scepter. Of course, I had seen the scepter—I was there the day it was found in the tomb. It was a beautiful piece, a rod or staff of the most valuable ebony, carved with vultures and lions and cobras and topped with the largest, most fantastic ball of crystal I have ever seen. I knew, from what hieroglyphics I could decipher in the tomb and the painting within, that Amun Mopat had used the scepter in his ceremonies. He had raised it to the sun, and when the sun caught the crystal, it seemed that the entire sky lit up, and whenever it did, people kneeled before him. I held the scepter myself, and I tried to explain to Captain Ely that it was a beautiful artifact, nothing more. But legend claimed that it was the scepter that gave Amun Mopat the power of the gods. He could save lives with it, and he could take lives away. The power was so great that he was beloved of Ramses II. Riches came to him, and people bowed to the ground when he walked by, as if he were himself a god or a pharaoh. Captain Ely seemed to believe that I was the crazy one. I do not understand precisely why he was so determined to retrieve the scepter, whether his intent was for good or ill. They say that after the sinking of the Jerry McGuen, he became worse and worse, more and more deluded. Men were afraid to sail aboard his ships, and on the night his Egyptian went down, many had warned him that was not a night for even an icebreaker to be out on the water.’” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-unspoken-krewe-of-hunters-7/page-41.html","bookId":2281,"creation":"Oct 5, 2019 5:44:17 PM","modification":"Oct 5, 2019 5:44:17 PM"}
