{"id":86333,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Nope.\" He had his eyes closed, one hand on her ass in a possessive hold, the other around her back, his hand playing with her hair, making her shiver.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because as soon as I get past this postcoital coma I\u0027m in, I\u0027m going to start all over again. I\u0027m going to do this to you over and over, so when the kids come back in the morning, you won\u0027t have any doubts about the fact I\u0027m not going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have any doubts now.\"\u003c/p\u003e\n\u003cp\u003eHe opened his eyes, tilted his face down, filled with surprise. \"You convinced me,\" she admitted. \"You did what a great negotiator is supposed to do. I know the world\u0027s not a certain place, Lucas, but I\u0027m going to put my faith in you. Whatever happens between us, I\u0027ll know it was worth the leap. So, will you untie me now?\"\u003c/p\u003e\n\u003cp\u003eHis face was a study of emotions that touched her heart. Then a light smile lifted his mouth. \"I promised you a glass of wine.\" His gaze traveled down her body. \"I never said where I was going to pour it, or the type of vessel I was going to drink from. And I find I have quite a thirst.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t possibly.\"\u003c/p\u003e\n\u003cp\u003e\"No. Men are limited in that way. But women aren\u0027t.\" His eyes flashing with promise, he rose, sliding her hands from around his neck to go retrieve the bottle of wine, as well as a towel from her bathroom.\u003c/p\u003e\n\u003cp\u003eAs he came back, she was still halfheartedly protesting, though the shiver in her limbs and his intent gaze riveting on her bound body told her it would do little good.\u003c/p\u003e\n\u003cp\u003e\"Would you deny me, Cassandra?\" He gave her the look that made her pulse leap and told her she was his, body, heart, and soul. No, she wouldn\u0027t deny him. Though next time that male propensity for postcoital coma kicked in, she was going to pounce on him, bind his hands with his belt, and go to work on every inch of his body with her mouth the way she craved to do.\u003c/p\u003e\n\u003cp\u003e\"Can you do crepes? Talia loves crepes.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I can do things you can\u0027t even imagine. Will you deny me, Cass?\"\u003c/p\u003e\n\u003cp\u003eShe swallowed, all desire to tease fleeing before that expression. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" He put the towel down, parting her legs with a gentle but inexorable hand upon one. \"Because I intend to give you everything.\"\u003c/p\u003e\n\u003cp\u003eHe did eventually release her hands. And as he held himself on his arms over her, in the small hours of the night, prepared to make love to her the third or fourth time—or maybe it was the fifth—she allowed herself the pleasure of finally fingering the soft hair across his forehead. Was there such a thing as a fantasy that turned into something better in reality? Could she let herself believe what had started over a month ago could be something real that lasted? Could Sleeping Beauty really be roused from her sleep by one kiss, and want to spend her life with the prince? And him with her?\u003c/p\u003e\n\u003cp\u003eShe\u0027d never given herself the luxury of hope in such a thing, with its unacceptable and often disappointing truth. But perhaps Sleeping Beauty had seen in her prince\u0027s eyes what she saw in Lucas\u0027s now as he slowly entered her once again, keeping his gaze locked on hers as her lips parted, tender body arching to accept him again. Something that wasn\u0027t disappointing, something she knew was worth working for, getting up off the princess\u0027s dais and following him into a whole new world of possibilities.\u003c/p\u003e\n\u003cp\u003eWhen Lucas bent, bringing his mouth to hers in a kiss that melted her, that she suspected always would, she met it. Lifting her head, putting her hands on either side of his neck, she dug into the silky short hair at his nape, finding the rough line of his jaw under her thumbs, feeling his hard body stretched all along her softer one. She gave way before truth again and gloried in it. His.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to lose that bet,\" he muttered against her lips.\u003c/p\u003e\n\u003cp\u003e\"What bet?\" \u0027\u003c/p\u003e\n\u003cp\u003eHe shook his head, taking her head back to the pillow, his forehead resting on it. \"Tighten on me, sweetheart. The bet doesn\u0027t matter. You\u0027re what matters. Tell me again you\u0027re mine.\"\u003c/p\u003e\n\u003cp\u003eShe smiled and kissed him, but didn\u0027t answer. Taking Savannah\u0027s words to heart, especially in their current position, she decided she wanted him to work for it. All night, and then some.\u003c/p\u003e\n\u003cp\u003eAnd then she\u0027d ask for those bracelets back.\u003c/p\u003e","sourceLink":"https://allnovel.net/controlled-response-knights-of-the-board-room-2/page-30.html","bookId":1901,"creation":"Oct 5, 2019 5:13:28 PM","modification":"Oct 5, 2019 5:13:28 PM"}
