{"id":89858,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWes smiled and shook his head. “I know, I know.” Then he ate his three cheeseburgers.\u003c/p\u003e\n\u003cp\u003e“So how does it feel to be the Quiz Bowl Antichrist?” Damien asked in a mock-sportscaster voice, holding an invisible microphone out for my reply.\u003c/p\u003e\n\u003cp\u003e“Well, as James D. Watson said, I’m the motherfuckin’ princess. All other quiz bowlers shall bow down to me. Because you know what?”\u003c/p\u003e\n\u003cp\u003e“What?” Damien and Wes both asked.\u003c/p\u003e\n\u003cp\u003e“One of these days, I’m going to be the goddamn answer to a quiz bowl question.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Wes said. “‘What quiz bowl alternate murdered his team captain in the semifinals and later wrote a book, Among Boring People?’”\u003c/p\u003e\n\u003cp\u003eDamien shook his head. “Not funny. There will be no murder tonight or tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Do you realize, if we win this thing, it’s going to come up on Google Search for the rest of our lives?” I said.\u003c/p\u003e\n\u003cp\u003e“Let’s wear masks in the photo,” Wes suggested.\u003c/p\u003e\n\u003cp\u003e“I’ll be Michelangelo. You can be Donatello.”\u003c/p\u003e\n\u003cp\u003eAnd it went on like this for a while. Damien stopped talking and just watched me and Wes going back and forth. I was talking, but mostly I was watching him back. The green-blue of his eyes. The side of his neck. The curl of hair that dangled over the left corner of his forehead. No matter where I looked, there was something to see.\u003c/p\u003e\n\u003cp\u003eI didn’t have any control over it. Something inside of me was shifting. Everything I’d refused to articulate was starting to spell itself out. Not as knowledge, but as the impulse beneath the knowledge. I knew I wanted to be with him, and I was also starting to feel why. He was a reason I was here. He was a reason it mattered.\u003c/p\u003e\n\u003cp\u003eI was talking to Wes, but really I was talking to Damien through what I was saying to Wes. I wanted him to find me entertaining. I wanted him to find me interesting. I wanted him to find me.\u003c/p\u003e\n\u003cp\u003eWe were done pretty quickly, and before I knew it we were walking back to the Westin. Once we got to the lobby, Wes magically decided to head back to our room until the “scrimmage” at eight. That left Damien and me with two hours and nothing to do.\u003c/p\u003e\n\u003cp\u003e“Why don’t we go to my room?” Damien suggested.\u003c/p\u003e\n\u003cp\u003eI didn’t argue. I started to feel nervous—unreasonably nervous. We were just two friends going to a room. There wasn’t anything else to it. And yet…he hadn’t mentioned watching TV, and last time he’d said, “Why don’t we go to my room to watch TV?”\u003c/p\u003e\n\u003cp\u003e“I’m glad it’s just the two of us,” I ventured.\u003c/p\u003e\n\u003cp\u003e“Yeah, me, too,” Damien said.\u003c/p\u003e\n\u003cp\u003eWe rode the elevator in silence and walked down the hallway in silence. When we got to the door, he swiped his electronic key in the lock and got a green light on the first try. I could never manage to do that.\u003c/p\u003e\n\u003cp\u003e“After you,” he said, opening the door and gesturing me in.\u003c/p\u003e\n\u003cp\u003eI walked forward, down the small hallway, turning toward the beds. And that’s when I realized—there was someone in the room. And it was Sung. And he was on his bed. And he wasn’t wearing his jacket. Or a shirt. And he was moaning a little.\u003c/p\u003e\n\u003cp\u003eI thought we’d caught him jerking off. I couldn’t help it—I burst out laughing. And that’s what made him notice we were in the room. He jumped and turned around, and I realized Frances was in the bed with him, shirt also off, but bra still on.\u003c/p\u003e\n\u003cp\u003eIt was all so messed up that I couldn’t stop laughing. Tears were coming to my eyes.\u003c/p\u003e\n\u003cp\u003e“Get out!” Sung yelled.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Frances,” I said between laughing fits. “I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“GET OUT!” Sung screamed again, standing up now. Thank god he still had his pants on. “YOU ARE THE DEVIL. THE DEVIL!”\u003c/p\u003e\n\u003cp\u003e“I prefer Antichrist,” I told him.\u003c/p\u003e\n\u003cp\u003e“THE DEVIL!”\u003c/p\u003e\n\u003cp\u003e“THE DEVIL!” I mimicked back.\u003c/p\u003e\n\u003cp\u003eI felt Damien’s hand on my shoulder. “Let’s go,” he whispered.\u003c/p\u003e\n\u003cp\u003e“This is so pathetic,” I said. “Sung, man, you’re pathetic.”\u003c/p\u003e\n\u003cp\u003eSung lunged forward then, and Damien stepped in between us.\u003c/p\u003e\n\u003cp\u003e“Go,” Damien told me. “Now.”\u003c/p\u003e\n\u003cp\u003eI was laughing again, so I apologized to Frances again, then I pulled myself into the hallway, where I doubled over with more laughter.\u003c/p\u003e\n\u003cp\u003eDamien came out a few seconds later and closed the door behind us.\u003c/p\u003e\n\u003cp\u003e“Holy shit!” I said. “That was hysterical!”\u003c/p\u003e\n\u003cp\u003e“Stop it,” Damien said. “Enough.”\u003c/p\u003e\n\u003cp\u003e“Enough?” I laughed again. “I haven’t even started.”\u003c/p\u003e\n\u003cp\u003eDamien shook his head.\u003c/p\u003e\n\u003cp\u003e“You’re cold, man,” he said. “I can’t believe how cold you are.”\u003c/p\u003e\n\u003cp\u003e“What?” I asked. “You don’t find this funny?”\u003c/p\u003e\n\u003cp\u003e“You have no heart.”\u003c/p\u003e\n\u003cp\u003eThis sobered me up pretty quickly. “How can you say that?” I asked. It made no sense to me. “How can you, of all people, say that?”\u003c/p\u003e\n\u003cp\u003e“What does that mean? Me, of all people?”\u003c/p\u003e\n\u003cp\u003eHe’d gotten me.\u003c/p\u003e\n\u003cp\u003e“Alec?”\u003c/p\u003e\n\u003cp\u003e“I don’t know!” I shouted. “Okay? I don’t know.”\u003c/p\u003e\n\u003cp\u003eThis sounded like the truth, but it was feeling less than that. I knew. Or I was starting to know.\u003c/p\u003e\n\u003cp\u003e“I do have a heart,” I said. But I stopped there. I couldn’t tell him what was inside it. Because I still wasn’t sure of myself. The only thing I was sure of was that he wouldn’t want to hear it.\u003c/p\u003e\n\u003cp\u003eI could feel it all coming apart. The collapse of all those invisible plans, the appearance of all those hidden thoughts. I couldn’t let him see it. I had to get out of there.\u003c/p\u003e\n\u003cp\u003eI bolted. I left him right there in the hallway. I didn’t wait for the elevator—I hit the emergency stairs. I ran like I was the one on the cross-country team, even when I heard him following me.\u003c/p\u003e\n\u003cp\u003e“Don’t!” I yelled back at him.\u003c/p\u003e\n\u003cp\u003eI got to my floor and ran to my room. The card wouldn’t work the first time, and I nervously looked at the stairway exit, waiting for him to show up. But he must’ve stopped. He must’ve heard. I got the key through the second time.\u003c/p\u003e\n\u003cp\u003eWes was on his bed, reading a comic.\u003c/p\u003e\n\u003cp\u003e“You’re back early,” he said, not looking up.\u003c/p\u003e\n\u003cp\u003eI couldn’t say a thing. There was a knock on the door. Damien calling out my name.\u003c/p\u003e\n\u003cp\u003e“Don’t answer it,” I said. “Please, don’t answer it.”\u003c/p\u003e\n\u003cp\u003eI locked myself in the bathroom. I stared at the mirror.\u003c/p\u003e\n\u003cp\u003eI heard Wes murmur something to Damien through the door without opening it. Then he was at my door.\u003c/p\u003e\n\u003cp\u003e“Alec? Are you okay?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I said, but my voice was soggy coming out of my throat.\u003c/p\u003e\n\u003cp\u003e“Open up.”\u003c/p\u003e\n\u003cp\u003eI couldn’t. I sat on the lip of the tub, breathing in, breathing out. I remembered the look on Sung’s face and started to laugh. Then I thought of Frances lying there and felt sad. I wondered if I really didn’t have a heart.\u003c/p\u003e\n\u003cp\u003e“Alec,” Wes said again, gently. “Come on.”\u003c/p\u003e\n\u003cp\u003eI waited until he walked off again. Then I opened the door and went into the bedroom. He was back on his bed, but he hadn’t picked up the comic. He was sitting on the edge, waiting for me.\u003c/p\u003e\n\u003cp\u003eI told him what had happened. Not the part about Damien at first, but the part about Sung and Frances. He didn’t laugh, and neither did I. Then I told him Damien’s reaction to my reaction, without going into what was underneath.\u003c/p\u003e\n\u003cp\u003e“Do you think I’m cold?” I asked him. “Really—am I?”\u003c/p\u003e\n\u003cp\u003e“You’re not cold,” he said. “You’re just so angry.”\u003c/p\u003e\n\u003cp\u003eI must’ve looked surprised by this. He went on.\u003c/p\u003e\n\u003cp\u003e“You can be a total prick, Alec. There’s nothing wrong with that—all of us can be total pricks. We like to think that just because we’re geeks, that means we can’t be assholes. But we can be. Most of the time, though, it’s not coming from meanness or coldness. It’s coming from anger. Or sadness. I mean, I see fat people, and I just want to rip them apart.”\u003c/p\u003e\n\u003cp\u003e“But why do I want to rip Sung apart?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Because he’s a prick, too. And maybe you feel if you rip apart the quiz bowl geek, no one will think of you as a quiz bowl geek.”\u003c/p\u003e\n\u003cp\u003e“But I’m not a quiz bowl geek!”\u003c/p\u003e\n\u003cp\u003e“Haven’t you figured it out yet?” Wes asked. “Nobody’s a quiz bowl geek. We’re all just people. And you’re right, what we do here has no redeeming social value whatsoever. But it can be an interesting way to pass the time.”\u003c/p\u003e\n\u003cp\u003eI sat down on my bed, facing Wes so that our knees almost touched.\u003c/p\u003e\n\u003cp\u003e“I’m not a very happy person,” I told him. “But sometimes I can trick myself into thinking I am.”\u003c/p\u003e\n\u003cp\u003e“And where does Damien fit into all this, if I may ask?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “I really have no idea. I’m still figuring it out.”\u003c/p\u003e\n\u003cp\u003e“You know he likes girls?”\u003c/p\u003e\n\u003cp\u003e“I said, I’m still figuring it out.”\u003c/p\u003e\n\u003cp\u003e“Fair enough.”\u003c/p\u003e\n\u003cp\u003eI paused, realizing what had just been said.\u003c/p\u003e\n\u003cp\u003e“Is it that obvious?” I asked Wes.\u003c/p\u003e\n\u003cp\u003e“Only to me,” he said.\u003c/p\u003e\n\u003cp\u003eIt would take me another three months to understand why.\u003c/p\u003e\n\u003cp\u003e“Meanwhile,” he went on, “Sung and Frances.”\u003c/p\u003e\n\u003cp\u003e“Holy shit, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah, holy shit. And you know the worst part?”\u003c/p\u003e\n\u003cp\u003e“I can’t imagine what’s worse than seeing it with my own eyes.”\u003c/p\u003e\n\u003cp\u003e“Gordon is totally in love with Frances.”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“Yup. I wouldn’t miss practice tonight for all the money in the world.”\u003c/p\u003e\n\u003cp\u003eWe all showed up. Mr. Phillips could sense there was some tension in the room, but he truly had no idea.\u003c/p\u003e\n\u003cp\u003eFrances was wearing Sung’s varsity jacket. And suddenly I didn’t mind it so much.\u003c/p\u003e\n\u003cp\u003eGordon glared at Sung.\u003c/p\u003e\n\u003cp\u003eSung glared at me.\u003c/p\u003e\n\u003cp\u003eI avoided Damien’s eye.\u003c/p\u003e\n\u003cp\u003eWhen I looked at Wes, he made me feel like I might be worth saving. \u003c/p\u003e","sourceLink":"https://allnovel.net/geektastic-stories-from-the-nerd-herd/page-27.html","bookId":2793,"creation":"Oct 5, 2019 5:39:14 PM","modification":"Oct 5, 2019 5:39:14 PM"}
