{"id":89877,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWas that it? Maybe. We don’t know. But we know it was something because they’re definitely dead.\u003c/p\u003e\n\u003cp\u003eSo maybe there was some way to live out my fantasy. Maybe I just hadn’t figured it out yet.\u003c/p\u003e\n\u003cp\u003eBut I had to. It was killing me.\u003c/p\u003e\n\u003cp\u003eI never knew that being in love was a physical thing. I never knew your body reacted. Like when I saw Jamie and my stomach felt like someone had tied lines to it and pulled it in ten directions at once. Or the way I became suddenly aware of myself, of my body, when I sat across the aisle from him in bio—the way I felt my hair and my eyelashes and my lips and my nose and every motion of my body as I breathed, hyper-conscious in every way.\u003c/p\u003e\n\u003cp\u003eBut it didn’t matter. Because one day it all became impossible.\u003c/p\u003e\n\u003cp\u003eThat day was the worst day of my life. My own personal extinction-level event, right in the halls of high school.\u003c/p\u003e\n\u003cp\u003eI was leaving gym, following close to Andi. I did that whenever I could. Watching her. Listening. Trying to learn. Doing my research, like a good scientist.\u003c/p\u003e\n\u003cp\u003eBut then, suddenly, Andi turned around, as if she’d forgotten something. Maybe she had. I don’t know. All I know is this: The worst thing that could possibly happen, happened.\u003c/p\u003e\n\u003cp\u003eShe bumped into me. Hard.\u003c/p\u003e\n\u003cp\u003eI dropped everything I was holding. Including my bio notebook.\u003c/p\u003e\n\u003cp\u003eWhich fell, fluttering like a wounded bird, to the floor.\u003c/p\u003e\n\u003cp\u003eAnd landed spread open.\u003c/p\u003e\n\u003cp\u003eThe reproductions of Jamie’s tattoo.\u003c/p\u003e\n\u003cp\u003eThat tattoo. Over and over and over again. Meticulous. Precise. Because that’s the only way I knew how to draw.\u003c/p\u003e\n\u003cp\u003eI prayed that Andi wouldn’t notice it. But her eyes dipped down.\u003c/p\u003e\n\u003cp\u003eI prayed that she wouldn’t realize what it was.\u003c/p\u003e\n\u003cp\u003eFat chance. Like I said—precise. It couldn’t be anything but Jamie’s tattoo.\u003c/p\u003e\n\u003cp\u003eBefore she could say anything, I started babbling. I just couldn’t stop myself. I was terrified and embarrassed and strangely giddy all at once.\u003c/p\u003e\n\u003cp\u003e“Please don’t say anything. Andi. Please. Please. It’s nothing. It’s really nothing. It doesn’t mean…I would never try to take him away from you, really. Never.”\u003c/p\u003e\n\u003cp\u003eHer eyes got wide and then she laughed. She laughed.\u003c/p\u003e\n\u003cp\u003e“Are you serious? Do you think I’m afraid of that? He doesn’t give a shit about you. He needs you following him around like he needs a hole in his head.”\u003c/p\u003e\n\u003cp\u003e“Actually, um, that can be useful.” Oh my God! What on earth? Where was that coming from? “The theropods had holes in their skulls to make their heads more lightweight.” Shut up, Katie! I begged myself. Shut up!\u003c/p\u003e\n\u003cp\u003eBut I couldn’t stop myself. I was on autopilot. It was like my brain and my mouth became disconnected and my mouth just kept on going.\u003c/p\u003e\n\u003cp\u003e“It’s something of an evolutionary advantage for a large predator to have at least one hole in its head, as a way of reducing drag when?—”\u003c/p\u003e\n\u003cp\u003e“Hey!” she snapped. Her eyes scrunched and her brows came together and her mouth twisted into a scowl. Andi was suddenly the one thing I never thought she could be—ugly. It shocked me into silence. “Shut your little prissy, geeky mouth and listen to me, okay?\u003c/p\u003e\n\u003cp\u003e“Look, Dino Girl. There’s, like, a natural order to things, okay? It’s the way the world works. And girls like you do not get to go with guys like Jamie, okay? Especially when the guy is already with a girl like me. Do you get it? Did that get through your little lizard head?”\u003c/p\u003e\n\u003cp\u003eDinosaurs aren’t lizards! I wanted to shout. Just like spiders aren’t insects or rabbits aren’t rodents, you stupid piece of coprolite!\u003c/p\u003e\n\u003cp\u003eBut I said—I shouted—nothing. I just stood there, pinned, frozen by her anger.\u003c/p\u003e\n\u003cp\u003e“Do you get me, Dino Girl?”\u003c/p\u003e\n\u003cp\u003eI thought about that lizard in the picture book. And wouldn’t it just shock the living hell out of those T. rexes if it suddenly stood on up on its hind legs and roared and bit one of their heads off?\u003c/p\u003e\n\u003cp\u003eImpossible, of course. A physiological impossibility.\u003c/p\u003e\n\u003cp\u003eBut I wasn’t a lizard. I was a human being.\u003c/p\u003e\n\u003cp\u003eAnd yet…\u003c/p\u003e\n\u003cp\u003eAnd yet I stood there. And I said and I did nothing.\u003c/p\u003e\n\u003cp\u003e“I asked you a question, lizard brain!”\u003c/p\u003e\n\u003cp\u003e“I understand.” My voice didn’t sound like my own. It sounded like a very small girl who has just learned how to speak and is being punished by her parents.\u003c/p\u003e\n\u003cp\u003eAndi turned away, stepping on my notebook. She left an imprint of her shoe there, destroying two of my sketches. A pathway for the modern dominant girlosaur. What would a future paleontologist make of it?\u003c/p\u003e\n\u003cp\u003eI was proud of myself: I managed to scoop up my stuff and make it to the girls’ bathroom before I burst into tears. I thought about the girl Sooz had told me about, the one Andi made cry in the bathroom for an hour. All she had done was make fun of her. Me? She had destroyed my soul. How long would I be in there?\u003c/p\u003e\n\u003cp\u003eWhy did she have to be so mean? Why? All I wanted was a kiss. All I wanted was for a boy to like me. A special boy.\u003c/p\u003e\n\u003cp\u003eI locked the door to a stall in the corner and sat down, bringing my knees up to my chest. No one else was there, so I cried and cried and cried, but I don’t think it would have mattered. I don’t think I could have held it in even if the entire school had been sitting out there.\u003c/p\u003e\n\u003cp\u003eShe was mean. Yes. But the worst part was that she was honest.\u003c/p\u003e\n\u003cp\u003eLike she said, he wouldn’t like me. He would never love me. I was just a geeky girl who knew too much about dinosaurs.\u003c/p\u003e\n\u003cp\u003eNo threat to her. Just a little lizard. The most pathetic example of prey—not even worth the time for a predator to hunt, much less eat.\u003c/p\u003e\n\u003cp\u003eI spent the rest of the afternoon in the bathroom. I just couldn’t make myself leave. And when I left at the end of the day, I felt like everyone knew. Like Andi had texted everyone in school and sent instant messages and e-mails and then put up a Web page, just to make sure: “DINO GIRL LOVES MY BOYFRIEND! ISN’T THAT CUTE PATHETIC?”\u003c/p\u003e\n\u003cp\u003eMom and Dad could tell something was wrong when I got home. I told them I had really bad cramps. They didn’t believe me. I’ve always been a lousy liar.\u003c/p\u003e\n\u003cp\u003eBut I stuck to my story anyway and went to bed early and lay there, replaying those horrible moments in my mind over and over.\u003c/p\u003e\n\u003cp\u003eI fell asleep praying for a sudden Ice Age that would just make all of us extinct.\u003c/p\u003e\n\u003cp\u003eThe next day, I went to school prepared for the worst. I somehow anticipated posters of my face throughout the school, with the word “LOSER!” plastered over them in big fonts.\u003c/p\u003e\n\u003cp\u003eBut no one said anything. No one did anything. No one even looked at me funny.\u003c/p\u003e\n\u003cp\u003eAndi hadn’t told anyone. Maybe it wouldn’t be as bad as I thought. Sure, I’d blown any chance of being friends with Andi, but at least no one would be making fun…. And maybe I could get past it. Maybe someday it would be the kind of thing Andi and I would laugh about. Remember the time you tried to steal my boyfriend and I was mean to you?\u003c/p\u003e\n\u003cp\u003eBut then came biology. I panicked. Jamie. What if she told Jamie?\u003c/p\u003e\n\u003cp\u003eSomehow, that had been the furthest thing from my mind. I had been so concerned with Andi that I couldn’t even make the leap to her telling Jamie about my crush on him.\u003c/p\u003e\n\u003cp\u003eJamie sauntered into bio just before the bell.\u003c/p\u003e\n\u003cp\u003eMy breath went out of me, entirely gone. I couldn’t find any more. I was in a vacuum.\u003c/p\u003e\n\u003cp\u003eHe sat down.\u003c/p\u003e\n\u003cp\u003eHe was wearing a long-sleeve shirt, but he had the sleeves rolled up so that I could see the bottom of his tattoo.\u003c/p\u003e\n\u003cp\u003eThe tattoo burned my eyes. I thought of those pages from my notebook, now carefully torn out and left at home, where they could no longer incriminate me—too late.\u003c/p\u003e\n\u003cp\u003eAnd then…\u003c/p\u003e\n\u003cp\u003eAnd then he rolled his sleeve down. Slowly. Like an afterthought. Like he was trying to be casual about it. He stared straight ahead while he did it, not looking at me.\u003c/p\u003e\n\u003cp\u003eShe told.\u003c/p\u003e\n\u003cp\u003eShe told him.\u003c/p\u003e\n\u003cp\u003eI wanted to die. I wanted to combust, to burn up and die right there, leaving nothing but the smell of fried hair and a black scorch mark on the chair and the desk and the floor.\u003c/p\u003e\n\u003cp\u003eI heard nothing throughout bio. It was my favorite class, my best class, but I heard nothing and when I looked at my notebook later that day, there was nothing on the page. Just the date, printed neatly like on the rest of the pages, and then nothing.\u003c/p\u003e\n\u003cp\u003eSame thing with my memory. Just a white space—a blank like my notebook—in my brain where the carbon cycle should have been.\u003c/p\u003e\n\u003cp\u003eI stumbled out of class. Jamie knew. He knew I was in love with him. She’d told him. I had lost everything.\u003c/p\u003e\n\u003cp\u003eShe could have just walked away from me. She didn’t have to be mean. If I wasn’t a threat, she could have been kind and just walked away and never mentioned it to anyone, ever.\u003c/p\u003e\n\u003cp\u003eAnd that’s the thing: She could have been kind. Why wasn’t she? Why was she so mean? If you’re not going to eat the prey, why smack it around? It just doesn’t make sense.\u003c/p\u003e\n\u003cp\u003eI spent the day in my own little hell, trying to figure it out. Trying to figure out what she had to gain by it. If she was right, if Jamie would never be interested in me (and she was right—I knew it, and I knew it all along), then why hurt me like that? Why?\u003c/p\u003e\n\u003cp\u003eJust because she could? Just because she was a dinosaur? Just because she was a dinosaur and I was a lizard, predator and prey, and she could?\u003c/p\u003e\n\u003cp\u003eShe could. That’s what it came down to: She could do whatever she wanted just because she was Andi Donnelly, and there was nothing I could do about it.\u003c/p\u003e\n\u003cp\u003eAnd then…\u003c/p\u003e\n\u003cp\u003eAnd then, on the bus on the way home…\u003c/p\u003e\n\u003cp\u003eIt hit me.\u003c/p\u003e\n\u003cp\u003eLike a comet.\u003c/p\u003e\n\u003cp\u003eIt hit me:\u003c/p\u003e\n\u003cp\u003eThe dinosaurs were more powerful, but the lizards survived.\u003c/p\u003e\n\u003cp\u003eLook around. They still exist. In forms almost identical to their dinosaur-age forebears. I could show you a salamander from the late Triassic and you would think, “Hmm, that looks like a salamander.” You would recognize it right away. Because it survived and the dinosaur didn’t.\u003c/p\u003e\n\u003cp\u003eThey used to be prey, but they lived. They thrived, these lizards. Some of them are even predators now.\u003c/p\u003e\n\u003cp\u003eIt’s scientifically, biologically impossible for a lizard to evolve into a dinosaur.\u003c/p\u003e\n\u003cp\u003eBut prey can become a predator. It happens all the time.\u003c/p\u003e\n\u003cp\u003eAll the time.\u003c/p\u003e\n\u003cp\u003e“Well, what are you going to do about her?” Sooz asked when I finally told her everything.\u003c/p\u003e\n\u003cp\u003eI couldn’t believe it when I heard the words come out of my mouth: \u003c/p\u003e","sourceLink":"https://allnovel.net/geektastic-stories-from-the-nerd-herd/page-46.html","bookId":2793,"creation":"Oct 5, 2019 5:39:14 PM","modification":"Oct 5, 2019 5:39:14 PM"}
