{"id":89889,"no":58,"title":"Page 58","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCawley pulled away. “Sorry. Did I get your boobs?”\u003c/p\u003e\n\u003cp\u003e“No!” Leta laughed in embarrassment.\u003c/p\u003e\n\u003cp\u003e“’Cause I wasn’t trying to, I swear.”\u003c/p\u003e\n\u003cp\u003e“No, it’s fine if, um…it’s okay.”\u003c/p\u003e\n\u003cp\u003eCawley’s mouth pressed against hers again. His hand slipped back to her waist and Leta tried sucking in her stomach but then she didn’t have enough air to actually kiss and she had to let it go. His tongue lay on hers like a piece of fish she hadn’t decided whether she wanted to eat or eject. Should she do something with it? If so, what? Maybe she should dart it in and out quickly, cobra-style?\u003c/p\u003e\n\u003cp\u003eCawley stopped. “Not so wide,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Sorry,” Leta said. She’d opened her mouth big like going to the dentist, in order to give his tongue room. Now, she closed it, and it was a little better. They kissed for a few more seconds and Leta broke away. Her face was warm and her upper lip was sweaty; she had the overwhelming desire to escape. “We should probably get back before somebody comes in.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“I’ll go first and you can follow. But not too closely, okay? Count to twenty. No, count to fifty. Okay? Fifty?”\u003c/p\u003e\n\u003cp\u003e“Your wish is my command,” Cawley joked.\u003c/p\u003e\n\u003cp\u003eWhile Cawley was counting to fifty in the bathroom, Leta made a beeline for the smoke-filled theater management office to ask if she could stuff envelopes for the upcoming pledge drive instead of painting flats. The manager, Mr. Weingarten, handed her a fat stack, and Leta wedged herself in a far corner between a file cabinet and an enormous fake plant where she couldn’t be seen. The kiss was a letdown, not at all like the kisses she saw on TV. She wasn’t even sure she wanted to do it again. Leta spent the rest of the hour licking away the memory of it until her tongue was dry as cotton. At five o’clock, she bolted, but Cawley caught up with her at the civic center’s front doors.\u003c/p\u003e\n\u003cp\u003e“Sorry,” Leta said, her words rushing out on a weak stream of breath. “Weingarten made me stuff envelopes.”\u003c/p\u003e\n\u003cp\u003e“Drag-a-mundo.” Cawley smiled. “Hey, thanks, you know, for earlier.”\u003c/p\u003e\n\u003cp\u003eLeta’s face grew hot. “Sure. Well, I gotta go. My mom’s waiting.”\u003c/p\u003e\n\u003cp\u003eCawley leaned in, and Leta practically fell through the doors, running for the safety of her mother’s car.\u003c/p\u003e\n\u003cp\u003e“Hey, see you over at the Frankenstein Place,” Cawley called after her.\u003c/p\u003e\n\u003cp\u003eLeta pretended not to hear.\u003c/p\u003e\n\u003cp\u003eHOT PATOOTIE—BLESS MY SOUL!\u003c/p\u003e\n\u003cp\u003e“Did he kiss you? Oh, my god—details!” Agnes squealed into the phone.\u003c/p\u003e\n\u003cp\u003eLeta pulled the phone cord as far as it would allow onto the back patio, closing the door to a small crack. The concrete was cold under her bare feet. Through the window she could see her mother on the couch reading a biography of one of the presidents, her hair in rollers and her mouth set into a hard line, as if the book were disappointing her somehow but she was determined to read till the end.\u003c/p\u003e\n\u003cp\u003e“Yes. Sorta. I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What do you mean you don’t know? Did y’all kiss or not?”\u003c/p\u003e\n\u003cp\u003e“We…did?”\u003c/p\u003e\n\u003cp\u003eAgnes screeched on the other end so that Leta had to hold the phone away from her ear. “Oh, my god! I can’t believe you kissed Creepy Cawley!”\u003c/p\u003e\n\u003cp\u003e“He is not creepy. He’s actually pretty funny. And nice.”\u003c/p\u003e\n\u003cp\u003e“For a weirdo.”\u003c/p\u003e\n\u003cp\u003e“You know what? Forget I said anything. God.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Agnes said, but she was still laughing a little, and Leta wasn’t sure she really meant it. “So, tell me—was he any good? Oh, my god, did he try to feel you up?”\u003c/p\u003e\n\u003cp\u003e“No?—”\u003c/p\u003e\n\u003cp\u003e“Did you know he’s adopted? Like he thought his grandma was his mom but it turns out his Aunt Susie in Oklahoma is his real mom. She gave him up to his grandmother so she could go to college and get on with her life. I guess he found it out last year. He asked his mom—his real mom—if he could come live with her in Oklahoma, and she said no.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Leta said. She didn’t like that Agnes knew something about Cawley that she didn’t.\u003c/p\u003e\n\u003cp\u003e“Jay McCoy told me they got drunk once in a field and Cawley got quieter and quieter, and then, all of a sudden, he stood up and started screaming at the top of his lungs and hitting at this old oil drum. Remember last year when he broke his hand and he said it was a botched alien probe? Well, that’s what really happened.”\u003c/p\u003e\n\u003cp\u003eLeta could see Cawley in her mind then—the uncooperative blond hair, the crooked smile, the gap between his two front teeth, the secondhand-store bowling shirt he wore that said “Eugene” on the pocket. All those things she’d always found comforting about him now seemed turned; he’d gone from dorky-cute to intolerable in one phone call, and she couldn’t seem to reverse it.\u003c/p\u003e\n\u003cp\u003e“Roger and I almost did it today,” Agnes said suddenly.\u003c/p\u003e\n\u003cp\u003eLeta sank to the ground out of sight of the window. “You what?”\u003c/p\u003e\n\u003cp\u003e“I want to do it with him,” Agnes said as if she were planning a class trip.\u003c/p\u003e\n\u003cp\u003e“Are you sure you want to have…” Leta lowered her voice to a whisper. “Sex with him?”\u003c/p\u003e\n\u003cp\u003e“Who are you on the phone with?” Leta’s mother appeared on the porch, startling her.\u003c/p\u003e\n\u003cp\u003e“The Kremlin!” Leta snapped, her heart beating wildly.\u003c/p\u003e\n\u003cp\u003e“You shouldn’t joke about that sort of thing. You never know who’s listening in.”\u003c/p\u003e\n\u003cp\u003e“What’s your mother’s problem now?” Agnes snarled on the other end.\u003c/p\u003e\n\u003cp\u003e“She thinks the FBI’s tapped our phones.”\u003c/p\u003e\n\u003cp\u003e“Sweet Jesus,” Agnes whistled.\u003c/p\u003e\n\u003cp\u003e“Give me the phone.” Her mother made a swipe for it, but Leta dodged her. “It’s nearly ten o’clock, Leta Jane. Tell Agnes good night.”\u003c/p\u003e\n\u003cp\u003e“I’m not finished.”\u003c/p\u003e\n\u003cp\u003e“It’s late!”\u003c/p\u003e\n\u003cp\u003e“I’m not finished!” Leta held fast to the phone.\u003c/p\u003e\n\u003cp\u003e“Well, don’t stay on too long. It’s a school night,” her mother said. She padded silently to her room and closed the door with a soft thwick. Leta knew she’d won this round, but suddenly, she wished she hadn’t. It didn’t feel safe; it was like she’d taken her first steps in space only to find that her line wasn’t anchored to anything and she was hopelessly adrift.\u003c/p\u003e\n\u003cp\u003e“I better go,” Agnes said. “My dad just got home.”\u003c/p\u003e\n\u003cp\u003e“We have to talk, though,” Leta insisted. “Do you wanna go to the mall tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Can’t. I’m going to Roger’s.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Leta said. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Not for that,” Agnes scoffed. “I’m sitting in on his band’s rehearsal.”\u003c/p\u003e\n\u003cp\u003e“Wow.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I know! Isn’t that so cool?”\u003c/p\u003e\n\u003cp\u003e“Wow,” Leta said again.\u003c/p\u003e\n\u003cp\u003e“Don’t let your mother drive you too crazy.”\u003c/p\u003e\n\u003cp\u003e“I won’t.” When Leta hung up, she realized they’d never finished talking about her sort-of-maybe first kiss, and all her unasked questions settled inside her, heavy as sand.\u003c/p\u003e\n\u003cp\u003eThat night, Leta embraced her pillow, imagining Tom’s face in the whiteness above her. “I love you,” she said, because you were supposed to say that when you kissed. She pressed her lips to the pillow. Her tongue ventured out, meeting with an unwelcoming, cotton starchiness that robbed her mouth of all moisture.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she flipped the pillow over, wet spot down, and stared at the wall. In the next room, Stevie’s TV was on. She could hear the drone of it, all the shows and commercials blurring into one another. Stevie was talking, too, saying words that she knew didn’t match—cat when he meant house, football instead of man. She wondered if it made any sense to him and if it mattered that no one else understood. Was it lonely not to be able to communicate with other human beings, or was it a relief to stop trying?\u003c/p\u003e\n\u003cp\u003eAcross the hall, soft, strangled cries came from her mom’s bedroom. It reminded Leta of a nature show she’d seen once where a bear cub had caught its foot in a trap. It cried for help, and when none arrived, its cries became a muted yelp it used to comfort itself until sleep came. Leta turned away from the sounds in her mother’s room. She pressed herself closer to the wall and let the TV’s soft, repetitive noise lull her to sleep as if she were five and her parents were having a dinner party, their muffled voices in the living room a soothing wall of sound that stood between her and the rest of the world.\u003c/p\u003e\n\u003cp\u003eLeta awoke to the sound of Stevie screaming and her mother shouting. Still dazed, she stumbled into her brother’s room. Her mother had him pinned to the bed, but she was no match for him. His arm caught her across the face and she flew back, blood pooling at her lip. Stevie shook for a second and settled.\u003c/p\u003e\n\u003cp\u003e“It’s over,” Leta said, but she was trembling.\u003c/p\u003e\n\u003cp\u003e“I didn’t sign up for this.” Her mother stifled a sob. She held up a blood-smeared hand. “I need to change him now.”\u003c/p\u003e\n\u003cp\u003eLeta knew this was her cue to leave, so she turned on the little TV again, working the rabbit ears until the image was clear, letting the soft constant sound numb them all into a sleepful waking.\u003c/p\u003e\n\u003cp\u003eSCIENCE FICTION/DOUBLE FEATURE\u003c/p\u003e\n\u003cp\u003eOn Friday, Leta went to Rocky Horror alone. She’d never gone without Agnes, and as she got out of her mother’s car wearing more makeup than usual, she felt adrift. Standing in the lobby by herself, she searched for a new tribe of Rocky fans to join, but they all seemed complete already. Jennifer had added a red wig to her outfit, and Leta imagined using Riff-Raff’s gun to laser it to pieces.\u003c/p\u003e\n\u003cp\u003e“Leta?”\u003c/p\u003e\n\u003cp\u003eLeta turned around to see Miss Shelton standing behind her with some of her friends.\u003c/p\u003e\n\u003cp\u003e“Hi, Miss Shelton.”\u003c/p\u003e\n\u003cp\u003e“Amy, please!” her student teacher laughed. “Hey y’all, this is one of my students, Leta. Are you here for The Rocky Horror Picture Show?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I come every—well, most every Friday,” Leta said.\u003c/p\u003e\n\u003cp\u003eMiss Shelton’s eyes widened, and Leta enjoyed feeling like she was part of the secret club. “Cool. Are you here by yourself?” \u003c/p\u003e","sourceLink":"https://allnovel.net/geektastic-stories-from-the-nerd-herd/page-58.html","bookId":2793,"creation":"Oct 5, 2019 5:39:14 PM","modification":"Oct 5, 2019 5:39:14 PM"}
