{"id":89892,"no":61,"title":"Page 61","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Jesus God Almighty, Leta Jane Miller, what did you do to your HAIR?”\u003c/p\u003e\n\u003cp\u003eLeta put a hand to her newly shorn locks. It felt good against her skin, like freedom. “It’s just henna. It’s not permanent.”\u003c/p\u003e\n\u003cp\u003e“Nothing ever is.” Her mother crushed the flimsy cup and dropped it into the wastepaper basket. “I was going to start my master’s degree, but I guess that’s gone now. I guess I’m just not supposed to do anything. I should never make plans.”\u003c/p\u003e\n\u003cp\u003e“Stop it,” Leta said. “Just…stop.”\u003c/p\u003e\n\u003cp\u003eThey sat in the hallway on unforgiving plastic seats under hospital lights that bleached them into gray ghosts of themselves while orderlies moved up and down the hallway, pushing carts stacked with laundered sheets, plastic water pitchers, tissue boxes, cups of ice—small comforts for the sick and weary.\u003c/p\u003e\n\u003cp\u003e“I’m sorry we’re too much for you,” Leta said, and she wished it hadn’t come out sounding sarcastic, because she meant it sincerely.\u003c/p\u003e\n\u003cp\u003e“That’s a terrible thing to say,” her mother answered, but she hesitated, and the pause held the truth. Leta’s mother reached over like she was going to hug her. Instead she picked a piece of popcorn off her sweater. “We’ve just had a scare is all. Everything’s okay now.”\u003c/p\u003e\n\u003cp\u003eA doctor called Leta’s mother over for a hushed conference by a gurney. Leta stared up at the ceiling until her eyes burned. She blinked fast, but the tears came anyway. It seemed a good time for tears. She cried for the way things had been, the way they would never be again. She cried for Agnes in a backseat with Roger, Agnes who had left Leta alone in a between-world of horse models and Rocky Horror and kissing boys in bathrooms. She thought about Jennifer’s perfect dance steps, the way she’d let that faker steal the moment from her, and she cried harder. A nurse passing patted her shoulder and then she was gone.\u003c/p\u003e\n\u003cp\u003eLater, Leta took a cab back to her house while her mother stayed on at the hospital. It was late, around three in the morning, and the street was hushed. A soda can glinted in Mrs. Jaworski’s grass. Leta picked it up and tossed it in the big green trash can beside her garage.\u003c/p\u003e\n\u003cp\u003e“Leta?”\u003c/p\u003e\n\u003cp\u003eLeta started at the sound of Agnes’s voice. She was sitting on the front porch, huddled under Roger’s jacket, looking small and frail.\u003c/p\u003e\n\u003cp\u003e“I was waiting for you. I figured you’d be home about an hour ago.”\u003c/p\u003e\n\u003cp\u003e“I was at the hospital. Stevie had another seizure.”\u003c/p\u003e\n\u003cp\u003e“Oh, my god! Is he okay?”\u003c/p\u003e\n\u003cp\u003eLeta only shrugged. “For now. I thought you were at Roger’s.”\u003c/p\u003e\n\u003cp\u003e“I was. Roger and me, we…you know. We did it,” Agnes said, and Leta couldn’t be certain if there was pride or sadness in it.\u003c/p\u003e\n\u003cp\u003e“Oh. Um, congratulations. I mean, was it…are you okay?”\u003c/p\u003e\n\u003cp\u003eAgnes’ bottom lip quivered. She started to cry. “I’m so stupid.”\u003c/p\u003e\n\u003cp\u003e“Aggie. Hey. What happened? Did he do something…weird?”\u003c/p\u003e\n\u003cp\u003e“No!” Agnes said, laughing through tears. “He was super nice to me. Look, he gave me his motocross ribbon.” She opened the jacket so that Leta could see the red ribbon pinned to her shirt.\u003c/p\u003e\n\u003cp\u003e“Hey, you won first place in the Losing Your Virginity contest,” Leta joked. Agnes burst into fresh sobs, and Leta felt a surge of panic. “Sorry. It was just a joke….”\u003c/p\u003e\n\u003cp\u003e“It’s not the stupid joke.” Agnes dragged her fingers over her eyes and wiped her nose on her sleeve. “It was fine, I think. It was nice. He told me I was pretty. I just…” She shook her head and took two deep breaths. “I’m different now. I can’t go back. You know?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I know.”\u003c/p\u003e\n\u003cp\u003eAgnes’s face screwed up into fresh crying. “I started thinking about my mom, how I wished I could tell her about it. That’s totally stupid, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“No,” Leta said. “Of course not.” Her breath came out in a puff of dragon smoke. When Leta and Agnes were kids, they’d put straws to their mouths and blow out, pretending they were smoking like the smiling women they saw in magazines who played tennis or lounged poolside, looking impossibly glamorous. In the yard, the trees stood small and naked. The sky above the houses was dark and unreadable, and Leta shivered in the cold.\u003c/p\u003e\n\u003cp\u003e“I really do love your hair. It’s totally cool.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” Leta said. “My mom had a cow.”\u003c/p\u003e\n\u003cp\u003e“Even better,” Agnes said with a giggle. She quieted. “If I call Diana to come pick me up now I’ll never hear the end of it. Can I stay here?”\u003c/p\u003e\n\u003cp\u003e“Sure,” Leta said.\u003c/p\u003e\n\u003cp\u003eThe house was full of shadows. Leta turned on a lamp that only illuminated the emptiness of the living room. Leta gave Agnes a pair of her pajamas and they pulled the quilt off Leta’s bed and spread it over the carpet in her room.\u003c/p\u003e\n\u003cp\u003e“Oh, Charlie!” Agnes took Leta’s Appaloosa from its place on the horse shelf and gave him a kiss. She tucked Roger’s jacket under her head and clutched Charlie to her chest. The girls lay together on the floor, shoulders touching, and talked about who was the cutest guy in TeenBeat, whether Leta should let her hair grow out or keep it short, if it would be totally fourth grade to stage Rocky Horror with the Barbies in the morning. As Agnes’s words became softer and fewer, fading at last to a light snore, Leta stared at the glittery flecks in the ceiling and imagined they were stars winking out a message only she could understand. \u003c/p\u003e","sourceLink":"https://allnovel.net/geektastic-stories-from-the-nerd-herd/page-61.html","bookId":2793,"creation":"Oct 5, 2019 5:39:14 PM","modification":"Oct 5, 2019 5:39:14 PM"}
