{"id":63893,"no":39,"title":"Page 39","content":"\u003cp\u003e\u0026nbsp;“Better take a cab,” she suggested.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No kidding.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Let me look at you. You want to know something? You look like hell.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Thanks.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I’m serious. I know I look awful but I’ve got an excuse. Are you all right?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I was up all night.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Couldn’t sleep?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Didn’t try. I was on my way to bed when I got your message.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You should have said something. This could have waited.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I wasn’t all that sleepy. Tired, but not sleepy.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I know the feeling. Most of my waking hours are like that these days.” She frowned. “It’s more than that, though. Something’s bothering you.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I sighed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Look, I don’t mean to—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No,” I said. “No, you’re right. Is there more of that cof-fee?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I must have talked for a long time. When I ran out of words we sat in silence for a minute or two. Then she carried our coffee cups to the kitchen and brought them back full again.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;She said, “What do you ﬁgure it is? Not sex.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I didn’t think so. What, then? The old boys-will-be-boys syndrome?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Maybe.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Maybe not.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“When I’m with her,” I said, “everything else is off in some other world where I don’t have to deal with it. The sex is nothing special. She’s young and beautiful, and that was exciting at ﬁrst, just as the newness of it was exciting. But the sex is better with Elaine. With the other one—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You can say her name.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“With Lisa, I can’t always perform. And sometimes the act is perfunctory. I’m there, we’re having an affair, so we’d better get down to it or her presence in my life becomes even more inexplicable.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“ ‘Let’s get away from it all.’ ”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Who have you told?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Nobody,” I said. “No, that’s not entirely true. I’ve told you, of course—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“A nobody if there ever was one.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“And a few hours ago I told the fellow I sat up all night drinking with. Well, he was the one drinking. I stuck to club soda.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Thank God for small mercies.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I’ve wanted to talk about it with Jim. It sticks in my throat. See, he knows Elaine. It’s bad enough keeping some-thing from her, but if other people know about it and she doesn’t—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Not good.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No. And of course there’s the fact that talking about it makes it real, and I don’t want it to be real. I want it to be a place I go in dreams, if it has to be anything at all. Lately every time I leave her apartment I tell myself it’s over, that I won’t go back there again. And then a couple of days later I pick up the phone.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I don’t suppose you’ve talked about it at meetings.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No. Same reasons.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You could try going to a meeting where nobody knows you. Some remote section of the Bronx where they’ve been marrying their cousins for the past three hundred years.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“And the children are born with webbed feet.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“That’s the idea. You could say anything there.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I could.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Right. But you won’t. Have you been going to meet-ings?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Of course.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“As many as usual?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I may have lightened up a little, I don’t know. I’ve, uh, felt a little detached. My mind wanders. I wonder what the hell I’m doing there.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Doesn’t sound good, kiddo.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You know,” she said, “I think you may have picked just the right person to talk to. Dying turns out to be a very in-structive process. You learn a lot this way. The only prob-lem is you don’t have any time to act on your newfound knowledge. But isn’t that always the way? When I was ﬁf-teen years old I said to myself, ‘Oh to be twelve again, knowing what I know now.’ What the hell did I know when I was ﬁfteen?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“What do you know now?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I know that time’s much too scarce to waste. I know that only the important things are important. I know not to sweat the small stuff.” She made a face. “All these brilliant in-sights, and they come out sounding like bumper stickers. The worst part is it seems to me that I knew these things at ﬁfteen. Maybe I knew them when I was twelve. But I know them differently now.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I think I understand.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Jesus, I hope you do, Matthew.” She put a hand on my arm. “I care about you, you know. I really do. I don’t want you to fuck it up.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Something in the newspapers. Something in the past cou-ple of days.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I thought about it in the cab heading uptown, the crated bronze on the seat beside me. In front of my hotel I paid the driver and got the thing onto my shoulder again. I found a spot on the ﬂoor of my room where I wouldn’t be likely to trip over it. I’d have to uncrate it, but that could wait. I’d have to go back for the plinth, but that could wait, too.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I went to the library, and it didn’t take me long to ﬁnd the story I was looking for. It had run three days earlier. I couldn’t be sure where I’d read it, because all the local pa-pers had it, and none of them offered much in the way of detail.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;A man named Roger Prysock had been shot to death early the previous evening on the corner of Park Avenue South and East Twenty-eighth Street. According to the police, wit-nesses at the scene stated that the victim had been making a telephone call when a car pulled up alongside. A gunman emerged from the car, shot Prysock several times in the chest, ﬁred a ﬁnal shot into the back of the head, and got back into the car, which drove off. With ts tires screaming, according to the Post. The deceased was said to have been thirty-six years old, and had a lengthy criminal record, with convictions for aggravated assault and possession of a stolen property.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“He was a pimp,” Danny Boy said. “I think he must have gotten his job through afﬁrmative action.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“What do you mean?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“He was white.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“He’s not the ﬁrst white pimp.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No, but they’re pretty scarce at the street level, and Dodger Prysock was strictly street.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Dodger?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“His nom de la rue. Damn near inevitable, isn’t it? Roger the Dodger, and he was originally from Los Angeles.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I’d have thought Brooklyn.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“That’s because you have a sense of history. Mr. Prysock was not what you’d call a dominant ﬁgure in his chosen ﬁeld, but he made a living.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Enough to keep him in purple hats and zoot suits?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Not his style at all. The Dodger left that sort of thing for the brothers. Dressed very J. Press himself.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Who killed him?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No idea,” Danny Boy said. “Last I heard he was out of town. Then the ﬁrst news I got of him was the story in the paper. Who killed him? Beats me. You didn’t do it, did you?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Well, neither did I,” he said, “but that still leaves a whole lot of people.” It was the middle of the afternoon when I got to the top ﬂoor at 488 West Eighteenth, but it would have looked the same in the middle of the night. No daylight came through the windows. The glass panes in their lower halves had been re-placed with mirrors, the upper panes painted the same lemon yellow as the walls.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“We can’t have anyone seeing in here,” Julia said. “Not even the sun. Not even the Lord God.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;She gave me a cup of tea, put me in a chair, sat on the daybed with her feet tucked under her. No harem pajamas this time. She was wearing snug black slacks and a fuchsia blouse. The blouse was silk, unbuttoned at the throat, and there didn’t look to be anything under it that God or the sur-geons hadn’t given her.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I had beeped TJ, and there had been several phone calls back and forth. And now I had been granted an audience with Her Majesty.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Roger Prysock,” I said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Wasn’t there an Arthur Prysock?” she wondered. “A mu-sician, I seem to recall.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“This one’s Roger.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“A relative, perhaps.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Anything’s possible,” I said. “Roger the Dodger, they call him.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Called him. He’s dead.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Shot down on the street while he was using the phone. Three or four in the chest and an extra for insurance. In the back of the head. Does that sound familiar?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“It might ring a muted bell. How’s that tea?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“It’s ﬁne. He was a tall man, dark hair and eyes. Good-looking. Dressed well, if not as ﬂashily as other members of his profession.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Profession,” she said archly.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“He died on a street that’s been a hookers’ stroll for as long as I can remember. Now who else do we know who was tall and dark and an Ivy League dresser and died just like that, on the same kind of street?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Oh, dear,” she said. “Do you suppose we could fast-forward through the establishing shots?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Who killed him, Julia?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Well,” she said, “it certainly sounds as though it was the same person who killed our friend Glenn, and I already told you I didn’t know who that was.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“ ‘Didn’t.’ ”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Have I made a mistake in my tenses, Matthew?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;I shook my head. “You didn’t know who killed him,” I said, “but I think you do now. Because I think Glenn Holtz-mann was killed by mistake. The man who killed him was looking for Roger Prysock. Maybe he only knew the Dodger by description, or maybe they were close enough in appear-ance to fool him in that light.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I was all the way across the street,” she said. “He didn’t look like Dodger Prysock to me.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You already knew he wasn’t. You’d seen him up close earlier.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“That’s true,” she said. She examined a ﬁngernail, then gnawed at the cuticle. “I didn’t connect the two killings,” she said. “The ﬁrst one, Glenn, I haven’t even thought about it in weeks now. And I didn’t hear any details of the second shoot-ing. I didn’t know about the bullet in the back of the head.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Sort of a signature.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Yes.” She studied her nails some more and blew on them, as if the polish were still wet. “I didn’t even know he was back in town.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Prysock.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Yes. I haven’t seen him in months. I heard he’d gone back to Los Angeles. I think that’s where he’s from.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“So I’ve heard.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“The ﬁrst I heard he was back,” she said, “was when I heard he was dead.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Who had a beef with him?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Her eyes avoided mine. “I don’t have a pimp,” she said. “Or a manager, as some of them like to be called these days. And I barely knew Roger the Dodger, and I didn’t think very much of him. His clothes were conservatively cut, but he could put on a suit from Tripler and look like a ten-dollar whore in a bridesmaid’s gown. Trust me.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“All right.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Anything I could tell you would be secondhand. And you didn’t get it from me, because I will never repeat any of this. Are we very clear on that?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Crystal clear.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“What I heard,” she said, “and I didn’t hear it until well after the Dodger disappeared, was that he’d gone to Califor-nia for health reasons. In other words, somebody wanted to kill him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-devil-knows-you-re-dead-matthew-scudder-11/page-39.html","bookId":2329,"creation":"Oct 5, 2019 9:52:49 AM","modification":"Oct 5, 2019 9:52:49 AM"}
