{"id":10063,"no":31,"title":"CHAPTER XXX. GILBERT BECOMES A NEWSBOY.","content":"At an early hour the next morning Gilbert took his stand near the office of the daily “Times.” He attracted immediate attention from the members of the new profession in which he had enrolled himself without permission.\n\u003cbr\u003e \n\u003cbr\u003e “What are you doin’ here?” asked Jim Noonan, a tall newsboy, with red hair and freckled face.\n\u003cbr\u003e \n\u003cbr\u003e “I am selling papers,” answered Gilbert, quietly.\n\u003cbr\u003e \n\u003cbr\u003e “What business have you here anyhow? That’s my place.”\n\u003cbr\u003e \n\u003cbr\u003e “I shall not interfere with you.”\n\u003cbr\u003e \n\u003cbr\u003e “You’d better not,” said Jim, pugnaciously, under the impression that Gilbert was apologising. “Just you leave here!”\n\u003cbr\u003e \n\u003cbr\u003e Gilbert eyed him quietly.\n\u003cbr\u003e \n\u003cbr\u003e “I shall not interfere with you,” he repeated; “nor 267will I allow you to interfere with me,” he added, firmly.\n\u003cbr\u003e \n\u003cbr\u003e Jim looked at him attentively, and his opinion of him was somewhat altered.\n\u003cbr\u003e \n\u003cbr\u003e “What does a boy with good clothes want selling papers?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “He wants to make a living,” said Gilbert. “Paper, sir?”\n\u003cbr\u003e \n\u003cbr\u003e The man addressed purchased a four-cent paper. Gilbert made change in a business-like manner, and directly afterwards sold another, while Jim Noonan looked on enviously.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve a good mind to bust your head,” he said, angrily.\n\u003cbr\u003e \n\u003cbr\u003e “Better go to work and look for customers,” suggested Gilbert, coolly.\n\u003cbr\u003e \n\u003cbr\u003e Jim eyed him with angry discontent. He would like to have pitched into him, but Gilbert was compactly made, and, though smaller than his fellow-newsboy, looked difficult to handle. Jim had hoped to frighten him; but his success was not encouraging.\n\u003cbr\u003e \n\u003cbr\u003e Gilbert, on the whole, succeeded beyond his anticipations. 268Probably his appearance was in his favor, and attracted customers. But this was not all. He was quick and alert in manner, and kept a good look-out for trade.\n\u003cbr\u003e \n\u003cbr\u003e “How many papers have you sold?” asked Jim, after a while.\n\u003cbr\u003e \n\u003cbr\u003e “Fifty,” answered Gilbert.\n\u003cbr\u003e \n\u003cbr\u003e “Fifty!” ejaculated Jim; “why, I aint sold but twenty.”\n\u003cbr\u003e \n\u003cbr\u003e “You haven’t attended to business as closely as I have.”\n\u003cbr\u003e \n\u003cbr\u003e “Ef it hadn’t been for you I’d have sold a good many more.”\n\u003cbr\u003e \n\u003cbr\u003e “That isn’t the reason. You would have sold as many as I if you had tried as hard.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s mean, a boy like you comin’ down, and takin’ away a poor boy’s business.”\n\u003cbr\u003e \n\u003cbr\u003e “I shan’t sell papers any longer than I have to. I hope next week to go into something else.”\n\u003cbr\u003e \n\u003cbr\u003e Just then a gentleman inquired for a paper which Gilbert was out of.\n\u003cbr\u003e \n\u003cbr\u003e 269“I think he’s got it,” said Gilbert, pointing to Jim, thereby obtaining a customer for the latter.\n\u003cbr\u003e \n\u003cbr\u003e “We may as well help each other,” said Gilbert. “There’s no use in quarrelling.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you mean that?” asked Jim, doubtfully.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I do.”\n\u003cbr\u003e \n\u003cbr\u003e “You aint as mean as I thought you was,” said Jim, his dislike beginning to evaporate.\n\u003cbr\u003e \n\u003cbr\u003e “I hope you’ll stick to that opinion,” said Gilbert, good-humoredly. “When I go out of this business I’ll recommend my friends to patronize you.”\n\u003cbr\u003e \n\u003cbr\u003e Thus far Gilbert had seen no one whom he knew. That trial was yet to come. I call it a trial, because Gilbert was quite aware that in becoming a newsboy he had made a descent in the social scale. He had taken the step as a matter of necessity, and not because he liked it. He knew very well how it would be regarded by his acquaintances, and he rather dreaded the expressions of surprise which it would elicit.\n\u003cbr\u003e \n\u003cbr\u003e The first acquaintance to greet him was Alphonso Jones.\n\u003cbr\u003e \n\u003cbr\u003e 270“Good gracious, Greyson!” he exclaimed, “what are you doing here?”\n\u003cbr\u003e \n\u003cbr\u003e “Selling papers,” answered Gilbert, flushing a little.\n\u003cbr\u003e \n\u003cbr\u003e “I thought you was in a broker’s office.”\n\u003cbr\u003e \n\u003cbr\u003e “So I was, and hope to be again; but just now I’m out of a place, so I’ve gone into business on my own account.”\n\u003cbr\u003e \n\u003cbr\u003e “But, good gracious, how can you sell papers?”\n\u003cbr\u003e \n\u003cbr\u003e “It’s the only thing that offered, and I must earn my living.”\n\u003cbr\u003e \n\u003cbr\u003e “Suppose the Count Ernest de Montmorency should see you,—what would he say?”\n\u003cbr\u003e \n\u003cbr\u003e “I hope he would buy a paper of me,” returned Gilbert, smiling.\n\u003cbr\u003e \n\u003cbr\u003e “And your friends, the Vivians,—they would be awfully shocked.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t help it. I must earn a living. Won’t you have a paper, Mr. Jones? I’ve got all the morning papers—‘Times,’ ‘Tribune,’ ‘Herald,’ ‘Sun.’”\n\u003cbr\u003e \n\u003cbr\u003e “I’m afraid I haven’t got any change,” said Alphonso, whose large expenditure for clothing compelled 271him to economize on minor matters. “But, really, now, you aint going to keep the thing up, are you?”\n\u003cbr\u003e \n\u003cbr\u003e “Till I get something better,” said Gilbert, firmly. “I hope that will be soon. I don’t like it myself.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s so—so ungentlemanly a business.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t agree with you, Mr. Jones; I think it perfectly respectable.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes, of course; but it is not high-toned, you’ll admit that.”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps not,” said Gilbert, with a smile. “I don’t pretend to be a judge of what is high-toned. I hope you won’t cut my acquaintance, Mr. Jones, because I am a newsboy.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, no, of course not; but I am afraid your friends, the Vivians, will.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope not,” said Gilbert.\n\u003cbr\u003e \n\u003cbr\u003e Alphonso Jones departed, and next in order came John,—Gilbert’s successor at the broker’s.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, my eye!” he exclaimed, in genuine astonishment; “you don’t mean to say you’ve turned newsboy?”\n\u003cbr\u003e \n\u003cbr\u003e 272“Yes, I have. Will you buy a paper?”\n\u003cbr\u003e \n\u003cbr\u003e “Haven’t got a cent. How’s business?” asked John, with a grin.\n\u003cbr\u003e \n\u003cbr\u003e “Pretty good.”\n\u003cbr\u003e \n\u003cbr\u003e “Hope you’ve got a permanent situation.”\n\u003cbr\u003e \n\u003cbr\u003e “I think not. I don’t expect to sell papers more than a week.”\n\u003cbr\u003e \n\u003cbr\u003e “What are you going to do then?”\n\u003cbr\u003e \n\u003cbr\u003e “Going back into the office.”\n\u003cbr\u003e \n\u003cbr\u003e “What office?”\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Sands’ office.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you think he’d take back a—”\n\u003cbr\u003e \n\u003cbr\u003e “Stop there!” said Gilbert, sternly. “You know very well the charge against me is false. Fortunately I am in a position to prove it.”\n\u003cbr\u003e \n\u003cbr\u003e “You are?” asked John, in alarm.\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “How can you prove it?”\n\u003cbr\u003e \n\u003cbr\u003e “I will let you know when the time comes.”\n\u003cbr\u003e \n\u003cbr\u003e John was not disposed to continue the conversation. He walked back to the office, and told Simon Moore that Gilbert was selling papers in the square.\n\u003cbr\u003e \n\u003cbr\u003e 273“I am glad his pride is brought low,” said Moore, with satisfaction.\n\u003cbr\u003e \n\u003cbr\u003e “But it isn’t,” said John. “He is as proud as ever. He says he is coming back here.”\n\u003cbr\u003e \n\u003cbr\u003e “Let him talk,” said the book-keeper, contemptuously. “That is all it will amount to.”\n\u003cbr\u003e \n\u003cbr\u003e But John did not feel quite certain of this.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1888/54511.html","bookId":793,"creation":"Aug 2, 2019 2:48:53 AM","modification":"Aug 2, 2019 2:48:53 AM"}
