{"id":68032,"no":24,"title":"Page 24","content":"\u003cp\u003e“Don’t tell,” Heather had said.\u003c/p\u003e\n\u003cp\u003eDodge had kept his back to her. One of the pairs of underwear had blown off the hood and onto the ground; he kept his eyes fixed on it. It was full-butt underwear, patterned with strawberries, faded. Next to it, he’d seen two toothbrushes and a curled-up tube of toothpaste sitting on an overturned bucket, and several pairs of shoes lined up neatly in the dirt. He wondered how long they’d been camping out there.\u003c/p\u003e\n\u003cp\u003e“I won’t,” he had said without turning around.\u003c/p\u003e\n\u003cp\u003eAnd he wouldn’t. That was another thing Dodge liked about secrets: they bonded people together. “How long you think you can keep it up?” he asked now.\u003c/p\u003e\n\u003cp\u003e“As long as it takes to win,” she replied.\u003c/p\u003e\n\u003cp\u003eHe looked at her—face so serious, so dead set—and felt a sudden surge of something like joy. Understanding. That’s what it was; he and Heather understood each other.\u003c/p\u003e\n\u003cp\u003e“I like you, Heather,” he said. “You’re all right.”\u003c/p\u003e\n\u003cp\u003eShe briefly scanned his face, as if to verify that he wasn’t laughing at her. Then she smiled. “Right back at you, Dodge.”\u003c/p\u003e\n\u003cp\u003eNat reappeared, carrying a bottle of tequila. “Take a shot with me, Heather.”\u003c/p\u003e\n\u003cp\u003eHeather made a face. “Tequila?”\u003c/p\u003e\n\u003cp\u003e“Come on,” Nat said, pouting. Her words were more slurred than ever, but her eyes kept their strange, unnatural brightness—like something not quite human. “It’s my birthday.”\u003c/p\u003e\n\u003cp\u003eHeather shook her head. Nat laughed.\u003c/p\u003e\n\u003cp\u003e“I don’t believe it.” Her voice was getting louder. “You’ll play Panic, but you’re afraid of taking a shot.”\u003c/p\u003e\n\u003cp\u003e“Shhhh.” Heather’s face turned red.\u003c/p\u003e\n\u003cp\u003e“She wasn’t even supposed to play,” Nat said, pointing the bottle at Heather, as though addressing an audience. And people were listening. Dodge saw that they were turning in Heather’s direction, smirking, whispering.\u003c/p\u003e\n\u003cp\u003e“Come on, Nat. You’re not supposed to talk about the game, remember?” he said, but Nat ignored him.\u003c/p\u003e\n\u003cp\u003e“I was gonna play,” Nat announced. “I did play. Not anymore. She—you—sabotaged me. You sabotaged me.” She turned to Heather.\u003c/p\u003e\n\u003cp\u003eHeather stared at her for a second. “You’re drunk,” she said matter-of-factly, then slid off the hood of the car.\u003c/p\u003e\n\u003cp\u003eNat tried to grab her. “I was just kidding,” she said. But Heather kept walking. “Come on, Heath. I was just fucking around.”\u003c/p\u003e\n\u003cp\u003e“I’m going to find Bishop,” Heather said without turning.\u003c/p\u003e\n\u003cp\u003eNat leaned up against the car, next to Dodge. She uncapped the bottle of tequila, took a sip, and made a face. “Some birthday,” she muttered.\u003c/p\u003e\n\u003cp\u003eDodge could smell her skin, the alcohol on her breath and strawberry shampoo in her hair. He was aching to touch her. Instead he shoved his hands in his pocket and felt for the gift. He knew he had to give it to her now, before he chickened out or she got even drunker.\u003c/p\u003e\n\u003cp\u003e“Look, Nat. Is there somewhere we could go? I mean, to be alone for a minute?” Realizing she might think he was going to try to feel her up or something, he rushed on: “I have something for you.” And he showed her the little tissue-paper-wrapped box, hoping she wouldn’t care that it had gotten squashed in his pocket.\u003c/p\u003e\n\u003cp\u003eHer face changed. She smiled huge, showing off her perfect little white teeth, and set the bottle of tequila down. “Dodge, you didn’t have to,” she said. And then: “Come on, I know somewhere we can go.”\u003c/p\u003e\n\u003cp\u003eJust beyond the back porch was an area dedicated to what looked like lawn decorations: towering limestone statues of various mythical figures Dodge should probably know but didn’t; limestone benches and birdbaths full of standing water, moss, and leaves. Because of the statues and the porch it was concealed from view, and as he entered the semicircular enclosure, Dodge’s stomach started going crazy. The music was muffled, and he and Nat were alone.\u003c/p\u003e\n\u003cp\u003e“Go ahead,” he said, passing her the box. “Open it.”\u003c/p\u003e\n\u003cp\u003eHe thought he might puke. What if she hated it? Finally she got the wrapping off, and she opened the little box and stood there staring at it: a dark cord of velvet and a small, crystal butterfly charm, light dazzling from its wings, resting neatly on a bunch of cotton.\u003c/p\u003e\n\u003cp\u003eShe stared at it for so long, he thought she must hate it, and then he thought he really would be sick. The necklace had cost him three full days of the cash he got stocking shelves.\u003c/p\u003e\n\u003cp\u003e“If you want to return it . . .,” he started to say. But then she looked up and he saw that she was crying.\u003c/p\u003e\n\u003cp\u003e“It’s beautiful,” she said. “I love it.” And before he knew what was happening, she reached for him and drew him down to her and kissed him. Her lips tasted like salt and tequila.\u003c/p\u003e\n\u003cp\u003eWhen she pulled back, he felt dizzy. He’d kissed girls before but not like that. Usually he was too stressed about what their tongue was doing or whether he was using too much pressure or too little. But with Nat he forgot to think, or even breathe, and now his vision was clouded with black spots. “Listen,” he blurted out. “I want you to know I’ll still honor the split. If I win, I mean. You can still take your share of the money.”\u003c/p\u003e\n\u003cp\u003eShe stiffened suddenly, almost as if he’d slapped her. For a second she stood there, rigid. Then she shoved the jewelry box back at him. “I can’t take this,” she said. “I can’t accept it.”\u003c/p\u003e\n\u003cp\u003eDodge felt like he’d just inhaled a bowling ball. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I mean I don’t want it,” she said, and forced the box into his hand. “We’re not together, okay? I mean, I like you and all but . . . I’m seeing someone else. It isn’t right.”\u003c/p\u003e\n\u003cp\u003eCold, cold: washing through his whole body. He was freezing, confused and furious. He didn’t feel like himself, didn’t sound like himself either, as he heard himself say, “Who is it?”\u003c/p\u003e\n\u003cp\u003eShe had turned away from him. “It doesn’t matter,” she said. “No one you know.”\u003c/p\u003e\n\u003cp\u003e“You kissed me,” he said. “You kissed me, you made me think—”\u003c/p\u003e\n\u003cp\u003eShe shook her head. She still wouldn’t look at him. “It was for the game. Okay? I wanted you to help me win. That’s all.”\u003c/p\u003e\n\u003cp\u003eThat voice he didn’t recognize came out of his mouth again. “I don’t believe you.” The words sounded thin and flimsy.\u003c/p\u003e\n\u003cp\u003eShe kept speaking, almost as if he wasn’t there. “But I don’t need Panic. I don’t need you. I don’t need Heather. Kevin says I’ve got potential in front of the camera. He says—”\u003c/p\u003e\n\u003cp\u003e“Kevin?” Something clicked in Dodge’s brain, and his stomach opened up. “That scumbag you met at the mall?”\u003c/p\u003e\n\u003cp\u003e“He’s not a scumbag.” Now she whirled around to face him. She was shaking. Her fists were balled and her eyes were bright and there was wetness on her cheeks and it broke his heart. He still wanted to kiss her. He hated her. “He’s legit. He believes in me. He said he would help me.…”\u003c/p\u003e\n\u003cp\u003eThe cold in Dodge’s chest had turned into a hard fist. He could feel it beating against his ribs, threatening to explode out through his skin. “I’m sure he did,” he said, practically spitting. “Let me guess. All you had to do was show him your tits—”\u003c/p\u003e\n\u003cp\u003e“Shut up,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Maybe let him feel you up for a while. Or did you have to spread your legs, too?” As soon as he said it, he wished the words back into his mouth.\u003c/p\u003e\n\u003cp\u003eNat stiffened as though a shock had run through her. And he could tell from her face—the guilt and the sadness and the sorrow—that she did, she had.\u003c/p\u003e\n\u003cp\u003e“Nat.” He could barely say her name. He wanted to say he was sorry, and he was sorry for her too, for what she’d done. He wanted to tell her that he believed in her and thought she was beautiful.\u003c/p\u003e\n\u003cp\u003e“Go away,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Please.” He started to reach for her.\u003c/p\u003e\n\u003cp\u003eShe stumbled backward, nearly tripping on the grass. “Go,” she said. Her eyes locked on his for a minute. He saw two dark holes, like wounds; then she whirled around and was gone.\u003c/p\u003e\n\u003cp\u003eheather\u003c/p\u003e\n\u003cp\u003eBISHOP HAD A TRAMPOLINE; OR AT LEAST, HE HAD A trampoline frame. The nylon had long ago disintegrated and been replaced with a heavy canvas tarp, stretched taut. Heather wasn’t surprised to find him there, hiding out from the rest of the guests. He’d never been super social. She wasn’t either. It was one of the things that bonded them.\u003c/p\u003e\n\u003cp\u003e“Having a good time?” she asked, as she maneuvered onto the canvas next to him. Bishop smelled like cinnamon, and a little like butter.\u003c/p\u003e\n\u003cp\u003eHe shrugged. When he smiled, his nose crinkled. “So-so. You?”\u003c/p\u003e\n\u003cp\u003e“So-so,” she admitted. “How’s Lily doing?” Heather had had no choice but to bring her. They’d installed her in the den, and Bishop had volunteered to check in on her when he went inside for more plastic cups.\u003c/p\u003e\n\u003cp\u003e“She’s fine. Watching a marathon of some celebrity show. I made her popcorn.” He leaned back, so he was staring at the sky, and motioned for Heather to do the same.\u003c/p\u003e\n\u003cp\u003eWhen they were little, they had sometimes slept out here, side by side in sleeping bags, surrounded by empty packages of chips and cookies. One time, she had woken up and found a raccoon sitting on her chest. Bishop had yelled to startle it away—but not before getting a picture. It was one of her favorite memories from childhood.\u003c/p\u003e\n\u003cp\u003eShe could still remember what it felt like to wake up next to him, with dew covering their sleeping bags and soaking the canvas, their breath steaming in the air—they were so warm next to each other. Like they were in the only safe, good place in the world.\u003c/p\u003e\n\u003cp\u003eNow she unconsciously moved her head onto the hollow space between his chest and shoulder, and he wrapped one arm around her. His fingers grazed her bare arms, and her body felt suddenly fizzy and warm. She wondered how they must look from above: like two pieces of a puzzle, fitted neatly together.\u003c/p\u003e\n\u003cp\u003e“Are you going to miss me?” Bishop asked suddenly.\u003c/p\u003e\n\u003cp\u003eHeather’s heart gave a huge, awful thump, like it wanted to leap out of her throat.\u003c/p\u003e\n\u003cp\u003eShe’d been trying all summer to ignore the fact that Bishop was going away to college. Now they had less than a month left. “Don’t be an idiot,” she said, nudging him.\u003c/p\u003e\n\u003cp\u003e“I’m serious.” He shifted, withdrawing his arm from under her head, rolling over onto one elbow to face her. Casually, he slung his other arm over her waist. Her shirt was riding up and his hand was on her stomach—his tan skin against her pale, freckled belly—and her lungs were having trouble working properly.\u003c/p\u003e\n\u003cp\u003eIt’s Bishop, she reminded herself. It’s just Bishop.\u003c/p\u003e\n\u003cp\u003e“I’m gonna miss you so bad, Heather,” he said. They were so close, she could see a bit of fuzz clinging to one of his eyelashes; she could see individual spirals of color in his eyes. And his lips. Soft-looking. The perfect imperfectness of his teeth.\u003c/p\u003e\n\u003cp\u003e“What about Avery?” Heather blurted. She didn’t know where the words came from. “Are you going to miss her, too?”\u003c/p\u003e\n\u003cp\u003eHe drew back an inch, frowning. Then he sighed and shoved a hand through his hair. As soon as he wasn’t touching Heather anymore, she would have given anything to have his touch back. “I’m not with Avery anymore,” he said carefully. “We broke up.” \u003c/p\u003e","sourceLink":"https://allnovel.net/panic/page-24.html","bookId":1721,"creation":"Oct 5, 2019 10:07:44 AM","modification":"Oct 5, 2019 10:07:44 AM"}
