{"id":68036,"no":28,"title":"Page 28","content":"\u003cp\u003eThe cop took a step closer to her. “You ever heard of a game called Panic, Vivian?”\u003c/p\u003e\n\u003cp\u003eShe looked away. “No,” she said in a whisper. It was a stupid lie, and immediately she wished she’d said yes.\u003c/p\u003e\n\u003cp\u003e“I thought everybody played Panic,” the cop said.\u003c/p\u003e\n\u003cp\u003e“Not everyone,” she said, turning back to him. She saw a spark of triumph in his eyes, as though she’d admitted to something. God. She was messing this up. The back of her neck was sweating.\u003c/p\u003e\n\u003cp\u003eThe cop stared at her for a few more beats. “Go on, get out of here,” was all he said.\u003c/p\u003e\n\u003cp\u003eOutside, she took a few deep breaths. The air was thick with moisture. A storm was coming—a bad one too, judging from the sky. It was practically green, like the whole world was about to get sick. She shoved her hood back, letting the sweat cool off her forehead.\u003c/p\u003e\n\u003cp\u003eShe jogged across the parking lot to the pump.\u003c/p\u003e\n\u003cp\u003eAnd stopped.\u003c/p\u003e\n\u003cp\u003eLily was gone.\u003c/p\u003e\n\u003cp\u003eThere was a resonant boom, a sound so loud she jumped. The sky opened up, and rain hissed angrily against the pavement. She reached the car just as the first fork of lightning tore across the sky. She jiggled the door handle. Locked. Where the hell was Lily?\u003c/p\u003e\n\u003cp\u003e“Heather!” Lily’s voice rang out over the rain.\u003c/p\u003e\n\u003cp\u003eHeather turned. A cop was standing next to a blue-and-white patrol car. He had his hand around her sister’s arm.\u003c/p\u003e\n\u003cp\u003e“Lily!” Heather ran over, forgetting to be worried about cops or being careful. “Let go of her,” she said.\u003c/p\u003e\n\u003cp\u003e“Calm down, calm down.” The cop was tall and skinny, with a face like a mule. “Everyone be calm, okay?”\u003c/p\u003e\n\u003cp\u003e“Let go of her,” Heather repeated. The cop obeyed, and Lily barreled over to Heather, wrapping her arms around Heather’s waist, like she was a little kid.\u003c/p\u003e\n\u003cp\u003e“Hold on now,” the cop said. Lightning flashed again. His teeth were lit up, gray and crooked. “I just wanted to make sure the little lady was okay.”\u003c/p\u003e\n\u003cp\u003e“She’s fine,” Heather said. “We’re fine.” She started to turn away, but the cop reached out and stopped her.\u003c/p\u003e\n\u003cp\u003e“Not so fast,” he said. “We still got a little problem.”\u003c/p\u003e\n\u003cp\u003e“We didn’t do anything,” Lily piped up.\u003c/p\u003e\n\u003cp\u003eThe cop squinted at Lily. “I believe you,” he said, his voice a little softer. “But that right there”—and he pointed to the beat-up Taurus—“is a stolen car.”\u003c/p\u003e\n\u003cp\u003eThe rain was coming down so hard, Heather couldn’t think. Lily looked sad and extra skinny with her T-shirt sticking to her ribs.\u003c/p\u003e\n\u003cp\u003eThe cop opened the back door of the squad car. “Go on and get in,” he said to Lily. “Dry off.” Heather didn’t like it—she didn’t want Lily anywhere near the police car. That’s how they got you: they were nice, and they lured you into thinking you were safe, and then they flipped the tables without warning. She thought of Bishop and felt her throat squeeze. That was how everyone got you.\u003c/p\u003e\n\u003cp\u003eBut Lily had scooted inside before Heather could say, Don’t.\u003c/p\u003e\n\u003cp\u003e“How about we go somewhere and talk?” the cop said. At least he didn’t sound mad.\u003c/p\u003e\n\u003cp\u003eHeather crossed her arms. “I’m fine,” she said, hoping he wouldn’t see her shiver. “And I didn’t steal that car,” she said. “It’s my mom’s car.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Your mom said you stole it.” She could barely hear him over the rain. “You got quite the setup in the backseat. Food. Blankets. Clothes.” A bead of rain rolled off the tip of his nose, and Heather thought he looked almost as pathetic as Lily had.\u003c/p\u003e\n\u003cp\u003eShe looked away. She felt the need to tell, to spill, to explain, swelling like a balloon inside her chest, pressing painfully against her ribs. But she just said, “I’m not going home. You can’t make me.”\u003c/p\u003e\n\u003cp\u003e“Sure I can.”\u003c/p\u003e\n\u003cp\u003e“I’m eighteen,” she said.\u003c/p\u003e\n\u003cp\u003e“With no job, no money, no home,” he said.\u003c/p\u003e\n\u003cp\u003e“I have a job.” She knew she was being stupid, stubborn, but she didn’t care. She’d promised Lily they wouldn’t go back, and they wouldn’t. Probably if she told on her mom, told about the partying and the drugs, she wouldn’t have to go back. But maybe they’d stick her mom in jail and put Lily in some home with strangers who didn’t care about her. “I have a good job.”\u003c/p\u003e\n\u003cp\u003eAnd suddenly it occurred to her: Anne.\u003c/p\u003e\n\u003cp\u003eShe looked at the cop. “Don’t I get one phone call or something?”\u003c/p\u003e\n\u003cp\u003eFor the first time, he smiled. But his eyes were still sad. “You’re not under arrest.”\u003c/p\u003e\n\u003cp\u003e“I know,” she said. She was suddenly so nervous, she felt like she would puke. What if Anne didn’t care? Or worse, sided with the police? “But I want my phone call, just the same.”\u003c/p\u003e\n\u003cp\u003eDODGE HAD ONLY MADE IT HALFWAY HOME WHEN THE sky split open and it began to pour. Just his fucking luck. Within a few minutes, he was totally soaked. A car passed, blaring its horn, sending a fierce spray of water across his jeans. He was still two miles from home.\u003c/p\u003e\n\u003cp\u003eHe was hoping the storm would let up, but it got worse. Lightning ripped across the sky, quick flashes that gripped the world in weird green glow. Water accumulated fast in the ditches, driving leaves and paper cups onto his shoes. He was practically blind; he couldn’t see the oncoming traffic until it was practically on top of him.\u003c/p\u003e\n\u003cp\u003eHe realized, suddenly, that he was only a few minutes away from Bishop’s. He turned off the road and started jogging. With any luck, Bishop would be home, and he could wait it out or bum a ride.\u003c/p\u003e\n\u003cp\u003eBut when he came up the driveway, he saw the whole house was dark. Still, he went up to the porch and knocked on the front door, praying that Bishop would answer. Nothing.\u003c/p\u003e\n\u003cp\u003eHe remembered the back porch was screened in, and circled the house through the slog of mud. He banged his shin against an old lawn mower and went stumbling forward, nearly face-planting, cursing.\u003c/p\u003e\n\u003cp\u003eThe screen door was, of course, locked. He was wet and so miserable he briefly considered punching a hole through it—but then lightning bit through the sky again, and in that half second of unnatural brightness, he saw a kind of gardening shed, a little ways back and half-obscured by the trees.\u003c/p\u003e\n\u003cp\u003eThe door to the shed was protected by a padlock, but Dodge had his first bit of luck: the lock wasn’t actually in place. He pushed into the shed and stood shivering in the sudden dryness and coolness, inhaling the smell of wet blankets and old wood, waiting for his eyes to adjust. He couldn’t see shit. Just outlines, dark objects, probably more junk.\u003c/p\u003e\n\u003cp\u003eHe pulled out his cell phone for light and saw the battery was almost out. He couldn’t even call Bishop and ask where he was and when he would be home. Great. But at least in the glow of the screen he could make a better scan of the shed, and he was surprised to see that it was actually wired: a plain bulb was screwed into the ceiling, and there was a switch on the wall, too.\u003c/p\u003e\n\u003cp\u003eThe bulb was dim, but it was better than nothing. Immediately he saw that the shed was better organized than he’d thought. Certainly cleaner than the junkyard. There was a stool and a desk and a bunch of shelves. A bunch of betting slips, water-warped and weighted down with a metal turtle, were piled on the desk.\u003c/p\u003e\n\u003cp\u003eNext to the betting slips was a pile of old A/V and recording equipment, and one of those cheap pay-per-use cell phones, the kind that required no subscription.\u003c/p\u003e\n\u003cp\u003eHis second piece of luck: the cell phone powered on and didn’t require a password.\u003c/p\u003e\n\u003cp\u003eHe looked in his contacts for Bishop’s cell phone number and managed to retrieve it just before his cell went dead.\u003c/p\u003e\n\u003cp\u003eHe thumbed it into the keypad of the cell phone he’d found and listened to it ring. Five times, then Bishop’s voice mail. He hung up without leaving a message. Instead he flipped over to the texts, planning to shoot off a 911 to Bishop. He had to come home sometime. Where could he be in this weather, anyway?\u003c/p\u003e\n\u003cp\u003eAnd then: he froze. The driving of the rain on the roof, even the weight of the cell phone—all of it receded, and he saw only the words of the last outgoing text.\u003c/p\u003e\n\u003cp\u003eTime to go solo. Tomorrow night we’ll see what you’re really made of.\u003c/p\u003e\n\u003cp\u003eHe read it again, and a third time.\u003c/p\u003e\n\u003cp\u003eThe feeling returned in a rush.\u003c/p\u003e\n\u003cp\u003eHe scrolled down. More texts: instructions for the game. Messages to other players. And at the very bottom, a text to Heather’s number.\u003c/p\u003e\n\u003cp\u003eQuit now, before you get hurt.\u003c/p\u003e\n\u003cp\u003eDodge replaced the phone carefully, exactly where it had been. Now everything looked different: recording equipment. Cameras. Spray paint stacked in the corner, and plywood leaning against the shed walls. All the stuff Bishop had needed for the challenges.\u003c/p\u003e\n\u003cp\u003eA half-dozen mason jars were lined up on one shelf; he bent down to examine them and then cried out, stumbling away, nearly upsetting a stack of plywood.\u003c/p\u003e\n\u003cp\u003eSpiders. The jars were full of them—crawling up the glass, dark brown bodies blurring together. Meant for him, probably.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003eDodge spun around. His heart was still beating hard; he was imagining the feel of a hundred spiders on his skin.\u003c/p\u003e\n\u003cp\u003eBishop was standing in the doorway, totally immobile. The storm was still raging behind him, sending down sheets of water. He was wearing a hooded rain poncho, and his face was in shadow. For a second, Dodge was truly afraid of him; he looked like a serial killer in some bad horror movie.\u003c/p\u003e\n\u003cp\u003eDodge had a sudden flash of clarity: this was what the game was really about. This was what true fear was—that you could never know other people, not completely. That you were always just guessing blind.\u003c/p\u003e\n\u003cp\u003eThen Bishop took another step into the shed, shoving off his hood, and the impression passed. It was just Bishop. Some of Dodge’s fear eased too, although his skin was still prickling, and he was uncomfortably aware of the spiders in their thin glass jars, only a few feet away.\u003c/p\u003e\n\u003cp\u003e“What the hell, Dodge?” Bishop burst out. His fists were balled up.\u003c/p\u003e\n\u003cp\u003e“I was looking for you,” Dodge said, raising both hands, just in case Bishop was thinking of swinging at him. “I just wanted to get out of the rain.”\u003c/p\u003e\n\u003cp\u003e“You’re not supposed to be in here,” Bishop insisted.\u003c/p\u003e\n\u003cp\u003e“It’s all right,” Dodge said. “I know, okay? I already know.”\u003c/p\u003e\n\u003cp\u003eThere was a minute of electric silence. Bishop stared at him. “Know what?” he said at last.\u003c/p\u003e\n\u003cp\u003e“Come on, man. Don’t bullshit,” Dodge said quietly. “Just tell me one thing: why? I thought you hated Panic.”\u003c/p\u003e\n\u003cp\u003eDodge thought Bishop might not answer, might still try to deny the whole thing. Then his body seemed to collapse, like someone had pulled the drain in his center. He tugged the door closed behind him, then sagged into the chair. For a moment, he sat with his head in his hands. Finally he looked up.\u003c/p\u003e\n\u003cp\u003e“Why did you play?” he asked.\u003c/p\u003e\n\u003cp\u003eRevenge, Dodge thought, and Because I have nothing else. But out loud he said, “Money. Why else?”\u003c/p\u003e\n\u003cp\u003eBishop gestured wide with his hands. “Same.”\u003c/p\u003e\n\u003cp\u003e“Really?” Dodge watched him closely. There was a look on Bishop’s face he couldn’t identify. Bishop nodded, but Dodge could tell he was lying. It was more than that. He chose to let it go.\u003c/p\u003e\n\u003cp\u003eEveryone needed secrets.\u003c/p\u003e\n\u003cp\u003e“So what now?” Bishop asked. He sounded exhausted. He looked exhausted too. Dodge realized how much it must have weighed on him this summer—all the planning, all the lies. \u003c/p\u003e","sourceLink":"https://allnovel.net/panic/page-28.html","bookId":1721,"creation":"Oct 5, 2019 10:07:44 AM","modification":"Oct 5, 2019 10:07:44 AM"}
