{"id":94591,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eErik remained silent as he watched Daisy wage a silent war with herself, trying to decide who presented more danger to her survival, himself or Rhys. In the long run, it didn\u0027t matter what she decided, because she was staying whether she liked it or not.\u003c/p\u003e\n\u003cp\u003e\"Will it ever be safe for me to go home?\" she asked with a sigh of resignation.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"I could go stay with Nonnie.\" She voiced the suggestion aloud, curious to see Erik\u0027s reaction.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"My grandmother. She\u0027s the one who made my compass. Since she magicked a way for me to locate vampires, I\u0027m sure she could conjure something to protect me from Rhys.\"\u003c/p\u003e\n\u003cp\u003e\"And from me?\"\u003c/p\u003e\n\u003cp\u003eHer gaze slid away from his.\u003c/p\u003e\n\u003cp\u003eIt was all the answer he needed. \"Where does she live?\"\u003c/p\u003e\n\u003cp\u003e\"In Boca Raton. She has a gift shop there.\"\u003c/p\u003e\n\u003cp\u003e\"Is she a hunter, too?\"\u003c/p\u003e\n\u003cp\u003e\"No. She sells handmade jewelry and seashells. And an occasional charm or two.\"\u003c/p\u003e\n\u003cp\u003e\"And you think she can protect you from Rhys?\"\u003c/p\u003e\n\u003cp\u003eDaisy nodded, although she wasn\u0027t sure at all.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll think about it,\" Erik said. \"Right now, I\u0027ve got to meet Rhys.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t tell him I\u0027m here?\"\u003c/p\u003e\n\u003cp\u003e\"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, it was a silly question.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be back soon,\" he said, caressing her cheek with his knuckles. \"Behave yourself while I\u0027m gone.\"\u003c/p\u003e\n\u003cp\u003eStifling the urge to stick her tongue out at him, she watched him leave the house, although leave wasn\u0027t exactly the right word. He didn\u0027t go out the door, he merely dissolved into a mist of sparkling dove gray motes and vanished from her sight.\u003c/p\u003e\n\u003cp\u003eDaisy stared at the place where he had stood only moments before, then shook her head.\u003c/p\u003e\n\u003cp\u003e\"If I could do that,\" she muttered, \"I wouldn\u0027t have to worry about Rhys or anyone else.\"\u003c/p\u003e\n\u003cp\u003eWhen Erik arrived at La Morte Rouge, Rhys was waiting for him at the bar.\u003c/p\u003e\n\u003cp\u003e\"So, you\u0027re here. Are you ready for dessert?\" Rhys asked with a good-natured grin.\u003c/p\u003e\n\u003cp\u003eErik shrugged. \"Sure, I could use a bite or two.\" Or three or four, he thought, his hunger rising as his nostrils filled with the mingled scents of warm blood and desire that filled the air.\u003c/p\u003e\n\u003cp\u003eHe glanced around the club, noting the usual Sunday night crowd was in full swing. The human females wore provocative clothing, mostly black, that bared their throats and a good deal of cleavage. Of course, none of them used their real names. Instead, they wore delicate brooches inscribed with the French names they were known by in the club--Monique, Babette, Fifi. The males wore vests and slacks, again, mostly black, and had names like Henri, Etienne, and Jacques.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve reserved two rooms,\" Rhys remarked, slapping Erik on the shoulder. \"Monique is already waiting for you in number three. I\u0027ll meet you back here later.\"\u003c/p\u003e\n\u003cp\u003eErik nodded. He watched Rhys stride across the floor toward room six where his choice of the night awaited. Rhys didn\u0027t have a favorite at the club. His usual requirement was that his companion for the evening be young, female, and blonde.\u003c/p\u003e\n\u003cp\u003eWondering why he felt a sudden twinge of guilt, Erik went into room three. The rooms at the club were all decorated with Louis XV furniture and artwork. The bed linen was changed after each visit. A small bathroom provided a place to wash up after each encounter, if necessary.\u003c/p\u003e\n\u003cp\u003eMonique was waiting for him on the bed, a smile of welcome on her face. She was a beautiful woman in her mid-forties, with a toned body and tanned skin. Long red hair framed an oval face. He had been visiting her regularly ever since he moved to California. Some nights he wanted only to feed, some nights he satisfied his other hungers.\u003c/p\u003e\n\u003cp\u003e\"Good evening,\" she purred. \"What are you in the mood for tonight, mon chevalier fonce?\"\u003c/p\u003e\n\u003cp\u003eErik snorted softly. Her dark knight, indeed. Sitting on the edge of the bed, he brushed the hair away from her neck, then bent to drop kisses along the smooth curve of her throat.\u003c/p\u003e\n\u003cp\u003eWith a sigh, she surrendered to him, willing to give whatever he asked.\u003c/p\u003e\n\u003cp\u003eErik fed quickly, wishing all the while that it was Daisy in his arms. After closing the wounds in Monique\u0027s neck, he kissed her cheek, then gained his feet. \"Till next time, cherie.\"\u003c/p\u003e\n\u003cp\u003e\"I was hoping you\u0027d stay till morning,\" Monique said, pouting prettily. \"It\u0027s been a long time since we shared a night together.\"\u003c/p\u003e\n\u003cp\u003eHe forced a smile. \"Another time. Rhys is waiting for me.\"\u003c/p\u003e\n\u003cp\u003eThe smile faded from her lips. Monique and Rhys had a long-standing dislike for one another. Erik wondered from time to time what had caused the rift, but neither of them would discuss it.\u003c/p\u003e\n\u003cp\u003e\"Until next time,\" he said and left the room, relieved, for the first time since he had met Monique, that he had an excuse to leave.\u003c/p\u003e\n\u003cp\u003eRhys joined him at the bar a short time later.\u003c/p\u003e\n\u003cp\u003e\"So,\" Erik asked, \"what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I wanted to ask you.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been a little distant the last few days.\"\u003c/p\u003e\n\u003cp\u003eErik shrugged. \"So I wanted a little alone time. Anything wrong with that?\"\u003c/p\u003e\n\u003cp\u003eRhys rested his elbow on the bar. \"It\u0027s Mariah. She thinks you\u0027re up to something.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Like what?\"\u003c/p\u003e\n\u003cp\u003e\"Beats the hell out of me. You know Mariah,\" Rhys said with a grin. \"She\u0027s always out for blood of one kind or another. She doesn\u0027t think you\u0027re taking the whole Blood Thief thing seriously enough, that maybe you\u0027re hiding something.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s right,\" Erik said. \"I\u0027m hiding the Thief in my back pocket.\"\u003c/p\u003e\n\u003cp\u003e\"Look, I know Mariah\u0027s not your favorite person, but cut her a little slack. She\u0027s worried.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t we all?\" Erik muttered.\u003c/p\u003e\n\u003cp\u003eRhys punched Erik in the arm. \"So I told her I\u0027d have a talk with you, and now we\u0027ve had it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I should be asking you what\u0027s going on,\" Erik said. \"Since when do you worry about what anyone else--especially a woman--thinks?\"\u003c/p\u003e\n\u003cp\u003e\"Mellowing in my old age, I guess. Hell, I\u0027m just trying to keep the peace. Oh, one more thing and then I\u0027ll be on my way,\" Rhys remarked, all humor gone from his eyes. \"The Blood Thief has struck again.\"\u003c/p\u003e\n\u003cp\u003eIn an effort to buy a little time, Erik sipped his drink. He didn\u0027t know which Blood Thief had struck again, but it couldn\u0027t be the one living under his roof. Could it? He shook the thought from his mind. Such a thing was impossible. Daisy hadn\u0027t been out of his house in days. Still...\"How do you know?\"\u003c/p\u003e\n\u003cp\u003e\"I just got a phone call from Mariah. She was supposed to meet Tina at Craig\u0027s place tonight. When she got there, they were both dead.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry to hear that.\" Though Erik had harbored no real affection for either Tina or her mortal lover, senseless death was always unfortunate. \"What makes you think...?\"\u003c/p\u003e\n\u003cp\u003eErik swore softly. He had almost asked Rhys what made him think there was another thief in town.\u003c/p\u003e\n\u003cp\u003e\"What makes me think what?\" Rhys asked.\u003c/p\u003e\n\u003cp\u003e\"What makes you think it\u0027s the work of the Blood Thief and not some other hunter?\"\u003c/p\u003e\n\u003cp\u003eRhys looked at Erik, his eyes narrowed. \"What makes you think it isn\u0027t?\"\u003c/p\u003e\n\u003cp\u003eErik shrugged. \"Maybe Tina and Craig had a fight and killed each other.\" It was a slim possibility, but in his world, stranger things had happened.\u003c/p\u003e\n\u003cp\u003e\"I guess Craig and Tina could have committed suicide, too,\" Rhys remarked, his voice dripping with sarcasm, \"but Craig had a ten-inch knife in his back and Tina had been drained dry and staked. Doesn\u0027t sound like a double suicide to me.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay,\" Erik muttered. \"Have it your way.\"\u003c/p\u003e\n\u003cp\u003eRhys nodded. \"I always do.\"\u003c/p\u003e\n\u003cp\u003eErik grunted softly. If there was one thing about the Master of the City that annoyed Erik more than anything else, it was that, right or wrong, Rhys always managed to get things done the way he wanted.\u003c/p\u003e\n\u003cp\u003e\"The Blood Thief\u0027s never killed a mortal before.\" Erik drummed his fingertips on the bar top. \"Besides, if he wanted to destroy Tina, why didn\u0027t he do it the first time he attacked her? Why take her blood and not her head?\" Erik didn\u0027t know who had killed Tina and Craig, but he knew it hadn\u0027t been Daisy.\u003c/p\u003e\n\u003cp\u003e\"Beats the hell out of me.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t make much sense.\"\u003c/p\u003e\n\u003cp\u003e\"A lot of things in this old world don\u0027t make sense,\" Rhys muttered dryly.\u003c/p\u003e\n\u003cp\u003eErik nodded. He couldn\u0027t argue with that.\u003c/p\u003e\n\u003cp\u003e\"Maybe somebody scared him off the first time,\" Rhys said, thinking aloud. \"But that\u0027s neither here nor there. He\u0027s as good as got.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Rhys smiled, a predatory gleam in his eyes. \"I forgot to tell you the best part.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"The Blood Thief left his scent behind this time.\"\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eErik went suddenly still, and then relaxed. It couldn\u0027t be Daisy, but another hunter in the city was bad news for all of them. \"Was it anyone you recognize?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Rhys said, \"but now we have something to go on.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t follow his scent?\"\u003c/p\u003e\n\u003cp\u003e\"I lost it on the freeway. If the murder had taken place at Tina\u0027s, we\u0027d have it on video.\"\u003c/p\u003e\n\u003cp\u003eErik grunted softly.\u003c/p\u003e\n\u003cp\u003e\"I want a camera in your place by tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Why the hell not?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like the idea.\"\u003c/p\u003e\n\u003cp\u003e\"It was your idea!\"\u003c/p\u003e\n\u003cp\u003eErik shrugged. He couldn\u0027t install a camera as long as Daisy was in the house.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t give a damn whether you like it or not. We all agreed it was the thing to do.\"\u003c/p\u003e\n\u003cp\u003eErik cocked his head to the side. \"Is there a camera in your lair?\" he asked, deciding to take the offensive.\u003c/p\u003e\n\u003cp\u003eRhys cleared his throat before muttering, \"No, not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Well, there you go. When you get one, I will.\"\u003c/p\u003e\n\u003cp\u003eMuttering an oath, Rhys pushed away from the bar and stalked across the room.\u003c/p\u003e\n\u003cp\u003e\"Damn.\" Erik finished his drink, then stared into his empty glass. If there really was another hunter in town, it would take the heat off Daisy. None of the vampires were aware of her or knew she was the one who had taken Tina\u0027s blood, or that she had destroyed Saul. She hadn\u0027t left her scent at either place. That being the case, she was probably safe from Rhys and the others. He could probably let her go home. He should have been relieved at the thought of having his house to himself again. He should have been, but he wasn\u0027t. \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-16.html","bookId":2303,"creation":"Oct 5, 2019 6:09:32 PM","modification":"Oct 5, 2019 6:09:32 PM"}
