{"id":94607,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"All good, I hope,\" Daisy said, offering her hand.\u003c/p\u003e\n\u003cp\u003e\"Of course it\u0027s all good,\" Brandon said. \"I\u0027m not telling her any of the bad stuff until she says \u0027I do.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" Daisy replied.\u003c/p\u003e\n\u003cp\u003ePaula resumed her seat beside Brandon and Daisy sat in the overstuffed chair across from them.\u003c/p\u003e\n\u003cp\u003e\"Where are Dad and Alex?\" Brandon asked.\u003c/p\u003e\n\u003cp\u003e\"Oh, they went out this morning,\" Daisy said. \"They should be back soon. I hear you\u0027ve been shopping.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Paula bought out most every store in town.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Not quite,\" Paula said, poking Brandon in the ribs.\u003c/p\u003e\n\u003cp\u003e\"Really,\" Brandon said. \"This girl has a credit card and she knows how to use it.\"\u003c/p\u003e\n\u003cp\u003e\"Brandon, stop it,\" Paula said, blushing.\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t like people to know her family\u0027s rich.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" Daisy tried to keep her surprise from showing. Her mother hadn\u0027t mentioned that the O\u0027Reilly family had money.\u003c/p\u003e\n\u003cp\u003e\"My dad writes computer software,\" Paula said with a shrug. \"He\u0027s very good at it.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great,\" Daisy exclaimed with a smile.\u003c/p\u003e\n\u003cp\u003e\"Well, we just stopped by to drop off a few things,\" Brandon said, rising. \"And now we\u0027re going to dinner. You wanna come along?\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think so. I\u0027ve been cleaning my room all day and now I just want to relax.\" It was partly true. She didn\u0027t want to leave until she knew her dad and Alex were okay. But mainly she wanted to be here if Erik showed up.\u003c/p\u003e\n\u003cp\u003e\"Okay, sis, catch ya later. Tell Dad I\u0027ll be late.\"\u003c/p\u003e\n\u003cp\u003eDaisy waited until Brandon and Paula left the house, then grabbed her cell phone and dialed her father\u0027s number. There was no answer. Frowning, she disconnected the call and dialed her brother\u0027s number. Again, there was no answer.\u003c/p\u003e\n\u003cp\u003eIt would be dark soon, so where were they?\u003c/p\u003e\n\u003cp\u003eShe jumped when someone knocked at the door. She peeked through the peephole, hoping it was her dad and Alex. Her heart skipped a beat when she saw Erik on the front porch.\u003c/p\u003e\n\u003cp\u003eUnlocking the door, she smiled up at him. \"Hi.\"\u003c/p\u003e\n\u003cp\u003e\"Hi.\"\u003c/p\u003e\n\u003cp\u003eShe stepped back so he could come in, frowned when he made no move to enter the house, and then remembered he couldn\u0027t enter a home without an invitation. \"Come on in, Dracula,\" she said with a grin.\u003c/p\u003e\n\u003cp\u003e\"Very funny,\" Erik muttered as he followed her into the living room. He took a quick look around. The walls were off-white, the carpet a deep shade of forest green; the furniture looked worn and comfortable but not shabby. There were books and knickknacks on several shelves, numerous framed family photographs on the fireplace mantel. The morning paper was spread out over the coffee table.\u003c/p\u003e\n\u003cp\u003e\"Sit down,\" Daisy said, taking a place on the sofa. Her earlier smile had vanished. Worry lines creased her brow.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\" Erik asked, sitting beside her\u003c/p\u003e\n\u003cp\u003e\"My dad and Alex went hunting this morning. They should have been back by now. They\u0027re not answering their phones...\"\u003c/p\u003e\n\u003cp\u003e\"Idiots.\"\u003c/p\u003e\n\u003cp\u003e\"Can you find them?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe, but it\u0027s doubtful.\" Boston had roughly six hundred thousand people. Finding two amongst so many could prove to be difficult. Then again...\"I might be able to follow their car,\" he remarked, thinking aloud. Every vehicle carried its own individual scent.\u003c/p\u003e\n\u003cp\u003e\"They took Dad\u0027s truck.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, Erik left the house with Daisy close on his heels.\u003c/p\u003e\n\u003cp\u003eHe paced back and forth across the driveway, then closed his eyes, sorting through the myriad scents of gasoline, trees, and grass until he located the truck\u0027s singular smell.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Daisy asked.\u003c/p\u003e\n\u003cp\u003e\"Go back inside and lock the door.\"\u003c/p\u003e\n\u003cp\u003e\"No way! I\u0027m going with you.\"\u003c/p\u003e\n\u003cp\u003e\"Not this time. You\u0027ll only slow me down. Keep your phone on. I\u0027ll call you if I find them. You call me if they show up here.\"\u003c/p\u003e\n\u003cp\u003e\"But...\"\u003c/p\u003e\n\u003cp\u003e\"Daisy, we don\u0027t have time to argue about this.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, all right.\" She didn\u0027t like the idea of being left behind. She wasn\u0027t used to it. After all, in her own way, she was a hunter, too.\u003c/p\u003e\n\u003cp\u003eHe kissed her quickly, and then he was gone.\u003c/p\u003e\n\u003cp\u003eMoving too swiftly for human eyes to follow, Erik followed the distinctive scent of the O\u0027Donnells\u0027 truck, passing ancient red brick sidewalks, Federalist houses, and soaring towers made of glass. The trail ended near Dorchester Bay. Amid the smell of salt water, diesel oil, smoke, and fish, he caught a new scent, that of vampire.\u003c/p\u003e\n\u003cp\u003eHe followed the vampire\u0027s scent to a luxury yacht. It took little effort to make the jump from the shore to the deck of the ship. There were humans below, and a vampire. The smell of blood roused his hunger.\u003c/p\u003e\n\u003cp\u003eGoing below, Erik followed the vampire\u0027s scent into a stateroom where he found the two O\u0027Donnell men lying on the floor, bound and apparently under some kind of supernatural enchantment. He was moving toward them when he realized he was no longer alone.\u003c/p\u003e\n\u003cp\u003eErik whirled around, fangs extended, and came face-to-face with one of his kind. Clad in a pair of black trousers and a loose-fitting white shirt, the vampire was tall and lean and looked to be in his late twenties, though his aura was much older.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\" the vampire asked. His voice was mild, though his eyes blazed red.\u003c/p\u003e\n\u003cp\u003e\"I know these two,\" Erik said, gesturing at Daisy\u0027s father and brother. \"They\u0027re not to be harmed.\"\u003c/p\u003e\n\u003cp\u003eThe other vampire lifted one brow. \"Indeed?\"\u003c/p\u003e\n\u003cp\u003eErik nodded.\u003c/p\u003e\n\u003cp\u003e\"They violated my lair. They tried to destroy me. I am within my rights to do with them as it pleases me. And it pleases me to kill them.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid I can\u0027t allow you to do that.\"\u003c/p\u003e\n\u003cp\u003e\"No? Who are you?\"\u003c/p\u003e\n\u003cp\u003e\"Erik Delacourt.\"\u003c/p\u003e\n\u003cp\u003e\"Ah.\"\u003c/p\u003e\n\u003cp\u003e\"You know me?\" Erik asked.\u003c/p\u003e\n\u003cp\u003e\"I have heard of you. It is said you are a close friend of Costain\u0027s.\"\u003c/p\u003e\n\u003cp\u003eErik nodded, wondering if that was good or bad. \"Who the hell are you?\"\u003c/p\u003e\n\u003cp\u003e\"Tomas Villagrande.\"\u003c/p\u003e\n\u003cp\u003eErik swore under his breath. Villagrande was the Master of the East Coast vampires, and was even older than Rhys. It was rumored among the ranks of the Undead that Villagrande was one of the first of their kind, that it was Villagrande who had bequeathed the Dark Gift to Dracula himself. Erik didn\u0027t know if that was true, but Villagrande\u0027s preternatural power was unmistakable.\u003c/p\u003e\n\u003cp\u003eVillagrande folded his arms over his chest. \"Why do you care if these two live or die?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re related to someone I hold dear.\"\u003c/p\u003e\n\u003cp\u003e\"That does change things, does it not?\" Villagrande mused aloud. \"And yet the fact remains that they are mine.\"\u003c/p\u003e\n\u003cp\u003eTension thrummed through Erik as he summoned his power. If the other vampire wanted a fight, so be it, although pitting his strength against that of a much older vampire seemed like suicide.\u003c/p\u003e\n\u003cp\u003e\"This someone you hold dear, is it a woman?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Ah. And is she young and beautiful beyond compare?\"\u003c/p\u003e\n\u003cp\u003eErik nodded even as he wondered what game Villagrande was playing.\u003c/p\u003e\n\u003cp\u003e\"You are in love with her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"An overrated emotion to be sure,\" Villagrande remarked, his voice melancholy. \"Yet I confess that I, too, have been caught in that snare from time to time. Tell me, are you willing to challenge me in combat to save these two?\"\u003c/p\u003e\n\u003cp\u003eErik swore inwardly. He had hoped it wouldn\u0027t come to that, but he couldn\u0027t go back to Daisy and tell her he had failed. Better not to return at all. \"If I have to.\"\u003c/p\u003e\n\u003cp\u003eVillagrande stroked his chin as he contemplated Erik\u0027s decision. \"She means that much to you, this woman?\"\u003c/p\u003e\n\u003cp\u003e\"And more.\"\u003c/p\u003e\n\u003cp\u003eVillagrande laughed softly. \"I do not wish to kill you. You have trouble enough. Take them and go.\"\u003c/p\u003e\n\u003cp\u003e\"Just like that?\"\u003c/p\u003e\n\u003cp\u003e\"Just like that.\" Villagrande smiled, showing a hint of fang. \"Never let it be said that Tomas Villagrande stood in the way of true love. As for your inept friends here, I am surprised they have survived as long as they have. They should wake in half an hour or so. You might tell them to be more careful in the future,\" he said, and with a wave of his hand, he vanished.\u003c/p\u003e\n\u003cp\u003eErik stood there a moment, his senses searching for some trace of Villagrande. It was then that he realized he might have made a fatal mistake in giving Villagrande his name. A word from the East Coast Master of the City and Rhys would know where to find Erik, which would lead him to Alex. And Daisy.\u003c/p\u003e\n\u003cp\u003eCursing his stupidity, Erik untied Daisy\u0027s father and Alex. Hefting a man over each shoulder, he transported himself to the shore. A thought carried him to Daisy\u0027s front porch.\u003c/p\u003e\n\u003cp\u003eShe answered before he knocked, making him think she had been looking out the window, waiting for his return.\u003c/p\u003e\n\u003cp\u003eHer eyes widened when she saw her dad and brother. \"Are they...?\"\u003c/p\u003e\n\u003cp\u003e\"No, just unconscious.\"\u003c/p\u003e\n\u003cp\u003e\"Thank the Lord!\" She had been terrified that Erik had found them too late. And then she frowned. \"What\u0027s wrong with them?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing. They\u0027ll come around in a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know?\"\u003c/p\u003e\n\u003cp\u003e\"The vampire they found told me so.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" There was a wealth of curiosity in that single word.\u003c/p\u003e\n\u003cp\u003eErik lowered Noah O\u0027Donnell onto one end of the sofa and Alex onto the other. \"I don\u0027t know how we\u0027re going to explain this,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"Alex has a GPS on his phone. I\u0027ll say I called the police and they tracked it, and then I called you.... No, that won\u0027t work. The police would have taken them to the hospital and doctors would have kept them there until they regained consciousness. What are we going to do? How are we going to explain how they got home?\"\u003c/p\u003e\n\u003cp\u003e\"Beats the hell out of me.\"\u003c/p\u003e\n\u003cp\u003eDaisy frowned thoughtfully as she glanced at her dad and Alex. \"Why didn\u0027t the vampire kill them?\"\u003c/p\u003e\n\u003cp\u003e\"He was going to.\" Erik had no doubt that, had he arrived a few minutes later, he would have found Villagrande dining on his captives. \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-32.html","bookId":2303,"creation":"Oct 5, 2019 6:09:32 PM","modification":"Oct 5, 2019 6:09:32 PM"}
