{"id":94615,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t slow him down,\" Erik said, his voice muffled by her sweater.\u003c/p\u003e\n\u003cp\u003eDaisy followed Alex up the stairs to the street, her heart pounding. She dared not look behind her for fear she would see Rhys. If she lived to be a hundred, she would never forget how it had felt to drive a stake into his back. Never forget the way he had looked at her, his eyes red and wild, his fangs dripping with Alex\u0027s blood.\u003c/p\u003e\n\u003cp\u003eWhen they reached the car, Alex shoved Erik none too gently into the backseat and slammed the door. Daisy scrambled into the passenger seat while Alex slid behind the wheel, jammed the key in the ignition, and peeled away from the curb, leaving a wide swath of rubber behind.\u003c/p\u003e\n\u003cp\u003e\"Go to my place,\" Erik said.\u003c/p\u003e\n\u003cp\u003eAlex shook his head. \"No. I don\u0027t like that idea at all.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s closer,\" Daisy said. \"We don\u0027t have time to argue.\"\u003c/p\u003e\n\u003cp\u003e\"Daisy, maybe he\u0027s right for once,\" Erik said. \"Rhys has never been to your house. The threshold should keep him out.\"\u003c/p\u003e\n\u003cp\u003e\"Should?\" Alex careened around a corner on two wheels. \"Will it or won\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" Erik closed his eyes in an effort to shut out the beating of mortal hearts, but it was no use. The sound of their rapidly beating hearts, the scent of their blood, was overpowering. The heat of the sun coming through the back window made his skin tingle, rivaling the burning pain in his hands and legs where the chains had burned his skin. Damn, he couldn\u0027t remember when he\u0027d felt this bad.\u003c/p\u003e\n\u003cp\u003eTwenty minutes later, Alex pulled into Daisy\u0027s garage. Erik breathed a sigh of relief as the garage door came down, shutting out the sun.\u003c/p\u003e\n\u003cp\u003eFor a moment, the three of them sat there, then Alex got out of the car, a stake in one hand.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" Daisy asked, getting out of the car.\u003c/p\u003e\n\u003cp\u003e\"Look at him and then ask me that. You\u0027ve brought a monster home with you, and a damn hungry one from the looks of him.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right, Daisy.\" Erik clenched his hands at his side. \"You\u0027re in more danger from me than from Rhys.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not afraid.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, you should be!\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go inside.\"\u003c/p\u003e\n\u003cp\u003e\"Are you out of your mind?\" Alex asked.\u003c/p\u003e\n\u003cp\u003e\"Erik needs to feed,\" Daisy said with a calmness she was far from feeling. \"So, this is what we\u0027ll do. I\u0027ll let him drink from me, and you...\"\u003c/p\u003e\n\u003cp\u003e\"No way!\" Alex said.\u003c/p\u003e\n\u003cp\u003e\"And you,\" Daisy continued, \"will stand behind me to make sure he doesn\u0027t take too much. And then he\u0027s going to drink from you.\"\u003c/p\u003e\n\u003cp\u003e\"Like hell!\"\u003c/p\u003e\n\u003cp\u003eDaisy glanced at Erik. She had never truly been afraid of him before, never believed she was in any danger from him, until now. \"Alex, we don\u0027t have time to argue.\"\u003c/p\u003e\n\u003cp\u003e\"Dammit, Daisy, this is the dumbest idea you\u0027ve ever had!\"\u003c/p\u003e\n\u003cp\u003eDaisy didn\u0027t reply. Sweeping past her brother, she unlocked the door that connected the garage to the kitchen and went inside.\u003c/p\u003e\n\u003cp\u003eAfter a moment, Erik exited the car and followed her.\u003c/p\u003e\n\u003cp\u003eAlex glared at the vampire\u0027s back. Muttering an oath, he slammed the car door, then stomped into the house. He found Daisy and Erik facing each other in the living room. Erik looked like death warmed over. Alex looked at his sister, wondering if she was as relaxed as she appeared.\u003c/p\u003e\n\u003cp\u003e\"All right, let\u0027s get this over with.\" Daisy turned toward Erik. After taking a deep breath, she held her hair away from her neck. \"Go on. If Rhys shows up, you\u0027ll need to be strong.\"\u003c/p\u003e\n\u003cp\u003eErik stared at her. He wanted to refuse, but her blood called to him, screamed to him. \"Don\u0027t let me feed for more than a few minutes,\" he told Alex, and then, uttering a vile oath, he wrapped his arms around her.\u003c/p\u003e\n\u003cp\u003eAlex stood close behind Erik, his gaze fixed on the vampire. He had hunted vampires since he turned seventeen. He had staked them. He had beheaded them. But he had never actually seen one feed. It was totally revolting and yet he had to admit that watching Erik drink from Daisy held a certain morbid fascination.\u003c/p\u003e\n\u003cp\u003eA glance at Daisy showed that she didn\u0027t find it the least bit revolting. Her eyes were closed, her expression was one of a woman in the throes of ecstasy.\u003c/p\u003e\n\u003cp\u003eWith a shake of his head, Alex glanced at this watch. Erik had said not to let him feed for more than a few minutes. How many minutes in a few? Two? Three? Five? How the hell was he supposed to know how long was too long?\u003c/p\u003e\n\u003cp\u003eHe looked at Erik. The vampire\u0027s eyes were also closed. Grimacing, Alex shook his head. If he didn\u0027t know better, he would have sworn Erik and Daisy were making love. Hell, maybe they were. What did he know about vampire lovemaking?\u003c/p\u003e\n\u003cp\u003eAnother minute ticked past, and then another.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, Alex poked Erik in the back with the point of the stake. \"That\u0027s enough!\"\u003c/p\u003e\n\u003cp\u003eWith a low hiss, Erik lifted his head from Daisy\u0027s neck.\u003c/p\u003e\n\u003cp\u003eAlex recoiled a step, then held his ground, the stake held high. \"You said not to let you feed too long.\"\u003c/p\u003e\n\u003cp\u003eErik nodded. \"You were right to stop me.\" A swipe of his tongue closed the two tiny puncture wounds in her throat.\u003c/p\u003e\n\u003cp\u003eDaisy\u0027s eyelids fluttered open. For a moment, she stared up at Erik, a half smile on her lips. And then she looked at her brother. \"Your turn.\"\u003c/p\u003e\n\u003cp\u003eAlex stared at Erik.\u003c/p\u003e\n\u003cp\u003eUnblinking, Erik looked back at Alex, an unspoken challenge in his eyes.\u003c/p\u003e\n\u003cp\u003eAlex thrust out his arm, his expression defiant. \"Go ahead, bloodsucker, take what you need.\"\u003c/p\u003e\n\u003cp\u003e\"How very gracious of you to offer,\" Erik said dryly.\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, don\u0027t get carried away.\" Alex held up the wooden stake clutched tightly in his hand. \"I\u0027ve still got this.\"\u003c/p\u003e\n\u003cp\u003eMurmuring, \"I\u0027m terrified,\" Erik took hold of Alex\u0027s arm.\u003c/p\u003e\n\u003cp\u003eAlex swore softly as Erik sank his fangs, none too gently, into the vein in his wrist.\u003c/p\u003e\n\u003cp\u003eDaisy sighed as she glanced from one man to the other. She loved them both, but she didn\u0027t have much hope that they would ever be friends. Time seemed to slow to a stop as she watched Erik feed. She glanced at her watch, then back at Erik. She could see him growing stronger right before her eyes.\u003c/p\u003e\n\u003cp\u003eHer gaze moved over Alex. His whole body was rigid, his knuckles white around the stake clutched in his hand.\u003c/p\u003e\n\u003cp\u003eDaisy was beginning to worry that she would have to do something to stop Erik when he ran his tongue over the bites in Alex\u0027s wrist, then lifted his head.\u003c/p\u003e\n\u003cp\u003eAlex took a step backward, his expression uncertain.\u003c/p\u003e\n\u003cp\u003eErik\u0027s gaze met hers. His eyes were still red and glowing; a drop of bright red blood stained his lower lip. With his gaze still on hers, he licked it off.\u003c/p\u003e\n\u003cp\u003e\"Waste not, want not,\" he muttered.\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003eRhys Costain stared into the empty cell. How the devil had Erik slipped his bonds and escaped? Silver rendered a vampire powerless. Erik couldn\u0027t have dissolved into mist and floated away.\u003c/p\u003e\n\u003cp\u003eStepping into the cell, Rhys nudged the shackles with his foot. Someone had picked the lock.\u003c/p\u003e\n\u003cp\u003eClosing his eyes, he took a deep breath, then spat out a string of curses as two familiar scents mingled with Delacourt\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Dammit!\" He drove his fist into the wall, shattering brick and mortar as if it were cardboard. \"Traitor!\" The word echoed off the cold stone walls. \"Traitor!\"\u003c/p\u003e\n\u003cp\u003eDamn her! Mariah had been right all along. Delacourt had been in league with the hunters who had tried to destroy him. But why now, after all this time? And what the hell difference did it make?\u003c/p\u003e\n\u003cp\u003eRhys slammed the cell door shut. The clang of metal against metal echoed off the walls.\u003c/p\u003e\n\u003cp\u003e\"Vampire, trust no one,\" he muttered.\u003c/p\u003e\n\u003cp\u003eTurning on his heel, he stalked toward the stairway, his anger growing with every step.\u003c/p\u003e\n\u003cp\u003e\"Damn your black soul, Delacourt. You can run, but you can\u0027t hide from me. I\u0027ll find you. All of you. And death will be a long time coming!\"\u003c/p\u003e\n\u003cp\u003eChapter 32\u003c/p\u003e\n\u003cp\u003e\"So, what now?\" Daisy asked.\u003c/p\u003e\n\u003cp\u003eAt Erik\u0027s request, she and Alex had both had something to eat and drink and now the three of them were sitting in the living room. Erik sat in the chair facing the sofa, his expression pensive. Alex sat on the sofa beside Daisy. He looked wary and apprehensive. Daisy couldn\u0027t blame him. She wasn\u0027t anxious to face Rhys Costain again, even with Erik on their side. She knew Erik was a powerful vampire, but Rhys was far older, and vampires grew stronger with every passing year.\u003c/p\u003e\n\u003cp\u003eAlex straightened in his chair. \"What are you staring at, vampire?\"\u003c/p\u003e\n\u003cp\u003e\"I was thinking about the reward on Costain\u0027s head. Who told you about it?\"\u003c/p\u003e\n\u003cp\u003e\"I found it on a Web site. You know, sort of a vampire hunter\u0027s craigslist.\"\u003c/p\u003e\n\u003cp\u003e\"Who offered it?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. There was no name, just an e-mail address.\"\u003c/p\u003e\n\u003cp\u003eErik ran a hand over his jaw, his expression thoughtful. \"How were you supposed to claim the reward?\"\u003c/p\u003e\n\u003cp\u003e\"I was instructed to send an e-mail saying it was done, and then we were supposed to arrange a meet.\"\u003c/p\u003e\n\u003cp\u003e\"What were you going to take as proof? Once you kill him, he\u0027s dust.\"\u003c/p\u003e\n\u003cp\u003eAlex shrugged. \"I was told to collect whatever was left and take it with me.\"\u003c/p\u003e\n\u003cp\u003e\"Only another vampire would be able to tell if the remains belonged to Rhys or not.\"\u003c/p\u003e\n\u003cp\u003eAlex frowned. \"So, you\u0027re saying a vampire put out a hit on another vampire?\"\u003c/p\u003e\n\u003cp\u003eErik nodded.\u003c/p\u003e\n\u003cp\u003e\"Why would they do that?\" Daisy asked.\u003c/p\u003e\n\u003cp\u003e\"Could be a lot of reasons. Anger. Jealousy. Someone wanting to take over Costain\u0027s territory.\" Erik grunted softly. \"I wonder...\"\u003c/p\u003e\n\u003cp\u003e\"What are you thinking?\" Daisy asked.\u003c/p\u003e\n\u003cp\u003e\"Costain has made a lot of enemies in his time. Some of them are right here, in LA. I\u0027m thinking we might be able to set a trap.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? Before or after Costain kills us?\" Alex asked.\u003c/p\u003e\n\u003cp\u003eDaisy glared at him. \"That\u0027s not funny.\"\u003c/p\u003e\n\u003cp\u003e\"Damn right!\" Alex retorted.\u003c/p\u003e\n\u003cp\u003e\"Calm down, you two,\" Erik said impatiently. \"If we can hand the traitor to Rhys, maybe it\u0027ll let us off the hook.\"\u003c/p\u003e\n\u003cp\u003e\"And if it doesn\u0027t?\" Alex asked.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll be no worse off than we are now. Besides, I\u0027ve got a pretty good idea who it is.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/everlasting-kiss-everlasting-1/page-40.html","bookId":2303,"creation":"Oct 5, 2019 6:09:32 PM","modification":"Oct 5, 2019 6:09:32 PM"}
