{"id":76945,"no":44,"title":"Page 44","content":"\u003cp\u003e“He’s not my rat, he’s … wait, how am I to get to London?”\u003c/p\u003e\n\u003cp\u003eOne of the ostlers replied implacably as the coach set out. “Next mails come tomorrow morning, miss. Maybe they’ll let you and your pet ride up top.”\u003c/p\u003e\n\u003cp\u003eCatherine glared at him. “I don’t want to ride up top, I paid to ride inside, all the way to London, and I consider this a form of larceny! What am I to do until tomorrow morning?”\u003c/p\u003e\n\u003cp\u003eThe ostler, a young man with a long-handled mustache, shrugged. “You might ask if there’s a room available,” he suggested. “Although they probably won’t take kindly to guests with rats.” He looked beyond her as another vehicle came into the yard. “Out of the way, miss, or you’ll get thrown down by the carriage.”\u003c/p\u003e\n\u003cp\u003eInfuriated, Catherine stomped to the entrance of the inn. She looked into her carpetbag, where Dodger was playing with the cherries. Was it not enough, she thought in frustration, that she’d just had to leave a life she had loved, that she’d been through an entire night of nearly ceaseless crying and was now exhausted? Why had an unkind fate also seen fit to deposit Dodger in her care? “You,” she fumed aloud, “are the last feather that broke the horse’s back. You have plagued me for years, and stolen all my garters, and—”\u003c/p\u003e\n\u003cp\u003e“Pardon,” came a polite voice.\u003c/p\u003e\n\u003cp\u003eCatherine looked up with a scowl. In the next moment she swayed, her balance momentarily off.\u003c/p\u003e\n\u003cp\u003eHer thunderstruck eyes beheld Leo, Lord Ramsay, who looked amused. He kept his hands tucked in his pockets as he approached her in a relaxed stride. “I’m sure I shouldn’t ask. But why are you shouting at your luggage?”\u003c/p\u003e\n\u003cp\u003eDespite the negligence of his manner, his gaze went over her thoroughly, taking careful inventory.\u003c/p\u003e\n\u003cp\u003eThe sight of him had knocked the breath from her. He was so handsome, so beloved and familiar, that Catherine was nearly overcome by the impulse to fling herself at him. She couldn’t fathom why he had come after her.\u003c/p\u003e\n\u003cp\u003eHow she wished he hadn’t.\u003c/p\u003e\n\u003cp\u003eFumbling to close the carpetbag, she decided that it probably wouldn’t do to advertise Dodger’s presence before she managed to secure a room for herself. “Why are you here, my lord?” she asked unsteadily.\u003c/p\u003e\n\u003cp\u003eA leisurely shrug. “When I awakened this morning after a mere four and a half hours of sleep, I thought it would be just the thing to hop in the carriage and go for a picturesque drive to Haslemere and visit the”—Leo paused to glance at the sign above the door—“Spread Eagle Inn. What a fortuitous name.” His lips twitched at her bewildered expression, but his eyes were warm. His hand came up to her face, gently lifting her unwilling chin. “Your eyes are swollen.”\u003c/p\u003e\n\u003cp\u003e“Travel dust,” Catherine said with difficulty, swallowing hard at the sweetness of his touch. She wanted to push her chin harder against his hand, like a cat hungry to be stroked. Her eyes stung with the portent of tears.\u003c/p\u003e\n\u003cp\u003eThis would not do. Her reaction to him was nothing short of appalling. And if they stood out in the carriage yard even a moment longer, she would lose her composure altogether.\u003c/p\u003e\n\u003cp\u003e“Did you have difficulty with the coach?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes, and there won’t be another till morning. I need to arrange for a room.”\u003c/p\u003e\n\u003cp\u003eHe wouldn’t release her from his gaze. “You could come back to Hampshire with me.”\u003c/p\u003e\n\u003cp\u003eThe suggestion was more devastating than Leo could have known.\u003c/p\u003e\n\u003cp\u003e“No, I can’t. I’m going to London, to see my brother.”\u003c/p\u003e\n\u003cp\u003e“And after that?”\u003c/p\u003e\n\u003cp\u003e“After that, I’ll probably travel.”\u003c/p\u003e\n\u003cp\u003e“Travel?”\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll … I’ll tour the Continent. And settle in France or Italy.”\u003c/p\u003e\n\u003cp\u003e“By yourself?” Leo didn’t bother to hide his skepticism.\u003c/p\u003e\n\u003cp\u003e“I’ll hire a companion.”\u003c/p\u003e\n\u003cp\u003e“You can’t hire a companion, you are a companion.”\u003c/p\u003e\n\u003cp\u003e“I’ve just left the position,” she shot back.\u003c/p\u003e\n\u003cp\u003eFor just a moment, there was an alarming intensity in his gaze. Something predatory. Something dangerous. “I have a new position for you,” he said, and a little chill went down her spine.\u003c/p\u003e\n\u003cp\u003e“No, thank you.”\u003c/p\u003e\n\u003cp\u003e“You haven’t heard it yet.”\u003c/p\u003e\n\u003cp\u003e“I don’t need to.” Blindly she turned and walked into the building.\u003c/p\u003e\n\u003cp\u003eFinding the innkeeper’s table, she waited resolutely until a short, stocky man came to greet her. Although his head was shiny and bald, he had a thick gray beard and muttonchop sideburns. “May I help you?” he asked, looking from Catherine to the man just behind her.\u003c/p\u003e\n\u003cp\u003eLeo spoke before she could say a word. “I’d like to arrange a room for my wife and myself.”\u003c/p\u003e\n\u003cp\u003eHis wife? Catherine twisted to give him an offended glance. “I want my own room. And I’m not—”\u003c/p\u003e\n\u003cp\u003e“She doesn’t, really.” Leo smiled at the innkeeper, the rueful, commiserating smile of one put-upon man to another. “A marital squabble. She’s cross because I won’t let her mother visit us.”\u003c/p\u003e\n\u003cp\u003e“Ahhh…” The innkeeper made an ominous sound and bent to write in the registry book. “Don’t give in, sir. They never leave when they say they will. When my mother-in-law visits, the mice throw themselves at the cat, begging to be eaten. Your name?”\u003c/p\u003e\n\u003cp\u003e“Mr. and Mrs. Hathaway.”\u003c/p\u003e\n\u003cp\u003e“But—” Catherine began, nettled. She broke off as she felt the carpetbag quiver in her grasp. Dodger wanted to get out. She had to keep him hidden until they were safely upstairs. “All right,” she said shortly. “Let’s hurry.” \u003c/p\u003e","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-44.html","bookId":1784,"creation":"Oct 5, 2019 3:33:58 PM","modification":"Oct 5, 2019 3:33:58 PM"}
