{"id":76952,"no":51,"title":"Page 51","content":"\u003cp\u003eThe chambermaids would have left the room without incident, except that Dodger, attracted by the scent of food, emerged from beneath the quilt. He stood tall on the bed and regarded the dinner tray on the small table, his whiskers twitching. Oh, lovely, I was getting hungry! his expression seemed to say.\u003c/p\u003e\n\u003cp\u003eAs one of the maids saw Dodger, her face contorted in terror. “Eeeek!” She pointed a plump, trembling finger at the ferret. “It’s a rat, or a mouse, or—”\u003c/p\u003e\n\u003cp\u003e“No, it’s a ferret,” Leo explained, his tone reasonable and soothing. “A harmless and highly civilized creature—the favored pet of royalty, actually. Queen Elizabeth had a pet ferret, and—really, there’s no need for violence—”\u003c/p\u003e\n\u003cp\u003eThe chambermaid had picked up a fireplace poker and was raising it in anticipation of an attack.\u003c/p\u003e\n\u003cp\u003e“Dodger,” Catherine said shortly. “Come here.”\u003c/p\u003e\n\u003cp\u003eDodger slithered up to her. Before she could push him away, he licked her on the cheek in a nuzzling ferret kiss.\u003c/p\u003e\n\u003cp\u003eOne of the chambermaids looked horror-struck, while the other appeared ill.\u003c/p\u003e\n\u003cp\u003eFighting to keep a straight face, Leo gave a half-crown to each chambermaid and ushered them from the room. When the door was closed and locked, Catherine lifted the affectionate ferret from her chest and regarded him with a scowl. “You are the most troublesome creature in the world, and not at all civilized.”\u003c/p\u003e\n\u003cp\u003e“Here, Dodger.” Leo set out a saucer of beef and parsnips, and the ferret streaked over to it.\u003c/p\u003e\n\u003cp\u003eWhile the ferret was busy devouring his meal, Leo came to Catherine and took her face in gentle hands. He lowered his mouth to hers in a brief, warm kiss. “Dinner or bath first?”\u003c/p\u003e\n\u003cp\u003eShe was mortified to hear her stomach tighten with an audible kworr.\u003c/p\u003e\n\u003cp\u003eLeo grinned. “Dinner, it seems.”\u003c/p\u003e\n\u003cp\u003eThe meal consisted of beef rounds and mashed parsnips, and a bottle of strong red wine. Catherine ate ravenously, even swabbing the plate with a crust of bread.\u003c/p\u003e\n\u003cp\u003eLeo was an entertaining companion, telling amusing stories, gently winnowing out confidences, refilling her wine glass. In the light of the single candle that had been set on the table, his face was severely handsome, with thick lashes shadowing incandescent blue eyes.\u003c/p\u003e\n\u003cp\u003eIt occurred to Catherine that this was the first meal she’d ever shared alone with him. Once she would have dreaded the prospect, knowing she would have to be on her guard every second. But there was no conflict in this easy conversation. How remarkable. She almost wished that one of the Hathaway sisters were somewhere nearby, so that she could share this discovery … Your brother and I just spent an entire meal together without arguing!\u003c/p\u003e\n\u003cp\u003eIt had begun to rain outside, the sky darkening steadily, sprinkles thickening into a steady rush that obliterated the sounds of people and horses and the activity in the carriage yard. Even dressed in the heavy robe that Leo had given her to wear, Catherine shivered and felt gooseflesh rise all over.\u003c/p\u003e\n\u003cp\u003e“Time for your bath,” Leo said, coming to pull her chair back.\u003c/p\u003e\n\u003cp\u003eWondering if he intended to stay in the room, Catherine ventured, “Perhaps you might allow me some privacy.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t dream of it,” he said. “You may need assistance.”\u003c/p\u003e\n\u003cp\u003e“I can bathe myself. And I would prefer not to be watched.”\u003c/p\u003e\n\u003cp\u003e“My interest is purely aesthetic. I’ll imagine you as Rembrandt’s Hendrickje Bathina, wading in the waters of innocence.”\u003c/p\u003e\n\u003cp\u003e“Purely?” she asked doubtfully.\u003c/p\u003e\n\u003cp\u003e“Oh, I have a very pure soul. It’s only my private parts that have gotten me into trouble.”\u003c/p\u003e\n\u003cp\u003eCatherine couldn’t help laughing. “You may stay in the room, as long as you turn your back.”\u003c/p\u003e\n\u003cp\u003e“Agreed.” He went to stand by the window.\u003c/p\u003e\n\u003cp\u003eCatherine glanced at the tub with keen anticipation. She didn’t think she had ever looked forward to a bath so much. After securing her hair to the top of her head, she shed the robe, the shirt, and her spectacles, placed them on the bed, and glanced cautiously at Leo, who seemed to have taken a great interest in the view of the carriage yard. He had opened the window a few inches, letting rain-scented air into the room.\u003c/p\u003e\n\u003cp\u003e“Don’t look,” she said anxiously.\u003c/p\u003e\n\u003cp\u003e“I won’t. Although you really should discard your inhibitions,” he said. “They could get in the way of yielding to temptation.”\u003c/p\u003e\n\u003cp\u003eShe sank gingerly into the battered tub. “I would say that I’ve yielded quite thoroughly today.” She sighed in relief as the water soothed all her intimate stings and aches.\u003c/p\u003e\n\u003cp\u003e“And I was delighted to be of assistance.”\u003c/p\u003e\n\u003cp\u003e“You didn’t assist,” she said. “You are the temptation.” She heard him chuckle.\u003c/p\u003e\n\u003cp\u003eLeo kept his distance as Catherine bathed, looking out at the rain. After she had washed and rinsed herself, she was so tired that she doubted her own ability to climb out of the bath. Rising on shaking legs, she fumbled to retrieve the folded toweling from the stool next to the tub.\u003c/p\u003e\n\u003cp\u003eAs Catherine stepped out of the water, Leo came to her quickly and held up the toweling, wrapping it around her. Swathing her in a temporary cocoon, he held her for a moment. “Let me sleep with you tonight,” he said against her hair, a question in his voice.\u003c/p\u003e\n\u003cp\u003eCatherine looked up at him quizzically. “What would you do if I refused? Arrange for another room?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I would worry about your safety if I were in a different room. I’ll sleep on the floor.”\u003c/p\u003e\n\u003cp\u003e“No, we’ll share the bed.” She pressed her cheek to his chest, relaxing fully in his hold. How comfortable this was, she thought in wonder. How calm and safe she felt with him. “Why wasn’t it like this before?” she asked dreamily. “If you’d been the way you are now, I would never have argued with you about anything.” \u003c/p\u003e","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-51.html","bookId":1784,"creation":"Oct 5, 2019 3:33:58 PM","modification":"Oct 5, 2019 3:33:58 PM"}
