{"id":76975,"no":74,"title":"Page 74","content":"\u003cp\u003eLeo sat on the side of the bed, his gaze holding hers. He extended a muscular arm and caught the back of her neck in his hand, and held her steady. His mouth possessed hers roughly, until her head swam and her heart pounded. Lifting his head, he said, “I adore all of your parts exactly as they are.” He drew back and touched her taut jawline, his fingers gentle. “Can you at least admit that you’re fond of me?”\u003c/p\u003e\n\u003cp\u003eCatherine swallowed against the soft caress. “I … it’s obvious that I am.”\u003c/p\u003e\n\u003cp\u003e“Then say it,” he urged, stroking the side of her throat.\u003c/p\u003e\n\u003cp\u003e“Why must I say something if it’s obvious?”\u003c/p\u003e\n\u003cp\u003eBut he persisted, damn him, seeming to understand how difficult it was for her. “It’s only a few words.” His thumb brushed the hard, anxious pulse at the base of her neck. “Don’t be afraid.”\u003c/p\u003e\n\u003cp\u003e“Please, I can’t—”\u003c/p\u003e\n\u003cp\u003e“Say it.”\u003c/p\u003e\n\u003cp\u003eCatherine couldn’t look at him. She went hot and cold. Taking a deep breath, she managed a shaking whisper. “I’m f-fond of you.”\u003c/p\u003e\n\u003cp\u003e“There,” Leo murmured, beginning to draw her close. “Was that so bad?”\u003c/p\u003e\n\u003cp\u003eHer body was wrenched with the longing to huddle against his inviting chest. But instead she put her arms between them, preserving a crucial distance. “It makes no difference,” she forced herself to say. “In fact, it makes it worse.”\u003c/p\u003e\n\u003cp\u003eHis arms loosened. He gave her a quizzical glance. “Worse?”\u003c/p\u003e\n\u003cp\u003e“Yes, because I can never give you anything more than that. And regardless of what you claim to the contrary, you’ll want the kind of marriage your sisters have. The way Amelia is with Cam, the devotion and intimacy … you’ll want that too.”\u003c/p\u003e\n\u003cp\u003e“I don’t want intimacy with Cam.”\u003c/p\u003e\n\u003cp\u003e“Don’t joke about it,” she said wretchedly. “This is serious.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” came his quiet reply. “Sometimes serious conversations make me uncomfortable, and I tend to resort to humor as a result.” He paused. “I understand what you’re trying to tell me. But what if I say that attraction and fondness would be enough?”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t believe you. Because I know how unhappy you would become, seeing your sisters’ marriages, remembering how devoted your parents were to each other, and knowing that ours was a counterfeit by comparison. A parody.”\u003c/p\u003e\n\u003cp\u003e“What makes you so certain that we won’t come to care for each other?”\u003c/p\u003e\n\u003cp\u003e“I just am. I’ve looked inside my heart, and it’s not there. That’s what I meant before. I don’t think I’ll ever be able to trust anyone enough to love them. Even you.”\u003c/p\u003e\n\u003cp\u003eLeo’s face was expressionless, but she sensed something dark lurking beneath his self-control, something that hinted of anger, or exasperation. “It’s not that you’re unable,” he said. “It’s that you don’t want to.” He released her carefully and went to retrieve his discarded clothes. As he dressed, he spoke in a voice that chilled her with its pleasant blandness. “I have to leave.”\u003c/p\u003e\n\u003cp\u003e“You’re angry.”\u003c/p\u003e\n\u003cp\u003e“No. But if I stay, I’ll end up making love to you and proposing to you repeatedly, until morning. And even my tolerance for rejection has its limits.”\u003c/p\u003e\n\u003cp\u003eWords of regret and self-reproach hovered on her lips. But she held them back, sensing that it would only infuriate him. Leo was hardly a man to fear a challenge. But he was beginning to comprehend that he could do nothing with the challenge she presented, some inexplicable quandary that couldn’t be solved.\u003c/p\u003e\n\u003cp\u003eAfter dressing and shrugging into his coat, Leo returned to the bedside. “Don’t try to predict what you’re capable of,” he murmured, sliding his fingers beneath her chin. He bent to press his lips to her forehead, and added, “You may surprise yourself.” Going to the door, he opened it and glanced up and down the hallway. He glanced at Catherine over his shoulder. “Lock the door when I leave.”\u003c/p\u003e\n\u003cp\u003e“Good night,” she said with difficulty. “And … I’m sorry, my lord. I wish I were different. I wish I could—” She stopped and shook her head miserably.\u003c/p\u003e\n\u003cp\u003ePausing a bit longer, Leo gave her a look of amusement edged with warning. “You’re going to lose this battle, Cat. And despite yourself, you’re going to be very happy in defeat.”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-seven\u003c/p\u003e\n\u003cp\u003ePaying a call on Vanessa Darvin the following day was the last thing Leo wanted to do. However, he was curious about why she wanted to see him. The address that Poppy had given to him was of a Mayfair residence in South Audley Street, not far from the terrace he leased. It was a Georgian town house, neat red brick with white trim, fronted by a white pediment with four slender pilaster columns.\u003c/p\u003e\n\u003cp\u003eLeo liked Mayfair immensely, not so much for its fashionable reputation as the fact that it had once been deemed a “lewd and disorderly” place in the early eighteenth century by the Grand Jury of Westminster. It had been condemned for its practices of gaming, bawdy stage plays, prizefighting and animal baiting, and all the attendant vices of crime and prostitution. Over the next hundred years it had gradually gentrified until John Nash had sealed its hard-won respectability with Regent Street and Regent’s Park. To Leo, however, Mayfair would always be a respectable lady with a notorious past.\u003c/p\u003e\n\u003cp\u003eUpon arriving at the residence, Leo was shown to a reception room overlooking a two-tiered garden. Vanessa Darvin and Countess Ramsay were both present, welcoming him warmly. As they all sat and made the obligatory small talk, inquiring after the health of their family, and his, and the weather, and other safe and polite subjects of an opening acquaintance, Leo found that his impressions of the two women from the ball in Hampshire were unchanged. The countess was a garrulous biddy, and Vanessa Darvin was a self-involved beauty. \u003c/p\u003e","sourceLink":"https://allnovel.net/married-by-morning-the-hathaways-4/page-74.html","bookId":1784,"creation":"Oct 5, 2019 3:33:58 PM","modification":"Oct 5, 2019 3:33:58 PM"}
