{"id":103782,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Push harder,” Ken ordered her.\u003c/p\u003e\n\u003cp\u003e“You push harder, skinny boy,” she grumbled. It was unnerving to even be near the shaking door and hear the moans and screeches from the other side.\u003c/p\u003e\n\u003cp\u003eThe heavy oak wardrobe finally slid into place and they both stepped back to survey their work.\u003c/p\u003e\n\u003cp\u003e“Well,” Ken said, “that really doesn’t make me feel safer.”\u003c/p\u003e\n\u003cp\u003e“Not with those two big freaking windows behind the curtains,” Lenore agreed.\u003c/p\u003e\n\u003cp\u003e“Let’s put stuff in front of the curtains to slow them down if the get in,” Ken suggested.\u003c/p\u003e\n\u003cp\u003eTogether they dragged every heavy piece of furniture in the shop over to the windows to build a wall up behind the curtains. They were too afraid to actually move the curtains and press the furniture up against the glass. They noticed the zombies were actually quieter now that they couldn’t see the humans inside the shop.\u003c/p\u003e\n\u003cp\u003e“Think they gotta see us to get riled up,” Lenore wondered aloud.\u003c/p\u003e\n\u003cp\u003e“Or maybe they’re eating someone out there,” Ken offered.\u003c/p\u003e\n\u003cp\u003e“And you say I’m doom and gloom.” Lenore put her hands on her hips and surveyed their handiwork. “Might slow ‘em down.”\u003c/p\u003e\n\u003cp\u003eAgain, the Sheriff moaned behind them.\u003c/p\u003e\n\u003cp\u003e“We really should see if we can help him and maybe call 911,” Ken decided. He knelt next to the older man and gaped at him fearfully. “His breathing sounds really bad.”\u003c/p\u003e\n\u003cp\u003e“I think his lungs are filling with blood,” Lenore answered, moving toward the phone.\u003c/p\u003e\n\u003cp\u003e“You took medical training?”\u003c/p\u003e\n\u003cp\u003e“No. I watch House.” Lenore picked up the phone and punched in her grandmother’s phone number. As she expected, the line was busy. “World is coming to an end and she’s gossiping about her soap opera.” With a sigh, Lenore dialed 911 and held out the phone so Ken could hear the busy signal.\u003c/p\u003e\n\u003cp\u003e“This is not happening!” Ken exclaimed. “Seriously, I’m asleep and this is not a good dream. I would much rather have Daniel Craig as James Bond whisking me off to the French Rivera.”\u003c/p\u003e\n\u003cp\u003eLenore rolled her eyes, walked over and pinched Ken as hard as she could.\u003c/p\u003e\n\u003cp\u003e“Bitch!”\u003c/p\u003e\n\u003cp\u003e“You’re not sleeping or dreaming,” Lenore said firmly. She could feel her brow puckering as she frowned. Regardless of all her grandmother’s warnings about frown lines she didn’t really care right now. She was annoyed to no end that the world had decided to go to hell today. It was damn inconvenient and she really didn’t want to deal with it. But, of course, she would.\u003c/p\u003e\n\u003cp\u003e“Let’s drag him out the back door and take him to the hospital,” she said finally.\u003c/p\u003e\n\u003cp\u003e“Okay, but should we move him?”\u003c/p\u003e\n\u003cp\u003e“You already moved him once. If that didn’t make it worse, this probably won’t either.” Lenore sighed wearily. “Let’s do it. We’ll get him to the car, go get my grandma, and head to the hospital.” She was worried about her grandmother and the Sheriff was looking pretty bad. Ken was keeping it together a bit better than she’d expected, but she knew they were both probably in some sort of weird shock.\u003c/p\u003e\n\u003cp\u003eThe pounding on the front door was reduced to what sounded like small fists now. Probably the evil zombie kid. Lenore carefully split the curtain near her with her finger and peeked out.\u003c/p\u003e\n\u003cp\u003eThe little kid was still pounding on the door, but the adults were not in sight. The street appeared empty. The puddles of blood and bits of flesh strewn about the haphazardly-parked police cars made Lenore’s stomach clench. She slid her gaze to the little one banging on the door. He was snarling and hissing and she had the desire to slap him silly. Of course, he’d only try to eat her.\u003c/p\u003e\n\u003cp\u003eDropping the curtain into place, Lenore said to Ken, “We just got the little kid outside the door.”\u003c/p\u003e\n\u003cp\u003e“Where are the rest?” Ken lightly patted the Sheriff’s hand. It was obvious he didn’t know what else to do.\u003c/p\u003e\n\u003cp\u003e“Beats me. Trying to eat someone else, probably.”\u003c/p\u003e\n\u003cp\u003eThe phone suddenly rang beside her and, in spite of her determination to keep calm, she jerked in surprise. She snatched up the phone and said, “Hello?” She hoped to hear her grandmother’s voice.\u003c/p\u003e\n\u003cp\u003e“Lenore,” Mr. Cloy’s voice whispered. “They’re trying to get in my store.”\u003c/p\u003e\n\u003cp\u003e“Did you call the police?”\u003c/p\u003e\n\u003cp\u003e“You mean the guy lying on the floor in your shop?” Mr. Cloy sounded both afraid and peeved.\u003c/p\u003e\n\u003cp\u003e“Good point. Where you at?”\u003c/p\u003e\n\u003cp\u003e“Hiding behind the counter hoping if they can’t see me they’ll lose interest.”\u003c/p\u003e\n\u003cp\u003e“You got a weapon?”\u003c/p\u003e\n\u003cp\u003eThere was a long moment of silence, then Mr. Cloy said, “I left it in my truck. I took it home to clean and take to the range and I forgot it in my truck.”\u003c/p\u003e\n\u003cp\u003eLenore frowned and leaned against the counter. “Okay, we’re about to leave with the Sheriff for the hospital. Can you sneak to the back of the store and be ready to leave by the alley door?”\u003c/p\u003e\n\u003cp\u003e“There are cracks in the window,” Mr. Cloy said in a trembling voice.\u003c/p\u003e\n\u003cp\u003e“Are you listening to me? Can you move to the back of the store?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid to move. They’re trying so hard to get in. What if they see me and it makes them even crazier? I really thought the rapture would happen by this point. I really did.” He sounded close to hysteria.\u003c/p\u003e\n\u003cp\u003e“Okay, we will honk when we are behind your store. That is when you get up, run to the door, open it and get to the car. Okay?”\u003c/p\u003e\n\u003cp\u003eThere was a sharp intake of breath. “Okay.”\u003c/p\u003e\n\u003cp\u003e“Then we gotta plan. See you in a few.”\u003c/p\u003e\n\u003cp\u003eLenore hung up and grumbled to herself. She walked to the back of the store and grabbed Ken’s rolling office chair. Mumbling the whole time about zombies and people freaking out, she dragged it to the Sheriff and Ken.\u003c/p\u003e\n\u003cp\u003eKen was very quiet as he fearfully stared at the old man.\u003c/p\u003e\n\u003cp\u003e“Help me get him up,” Lenore ordered.\u003c/p\u003e\n\u003cp\u003e“He’s dead,” Ken answered softly.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“He just kinda let out this long breath then stopped breathing. I checked his pulse.” Ken wiped a tear away from his cheek.\u003c/p\u003e\n\u003cp\u003e“You better step back in case he gets up,” Lenore urged.\u003c/p\u003e\n\u003cp\u003eKen crawled backward, his body trembling. He rested his back against the wall and stared at the old man blankly. “Lenore, I couldn’t do anything.”\u003c/p\u003e\n\u003cp\u003e“It’s not your fault,” Lenore said firmly.\u003c/p\u003e\n\u003cp\u003e“Is he gonna come back?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Lenore answered. She grabbed the coat rack and stood over the old man. “I guess we’ll find out.”\u003c/p\u003e\n\u003cp\u003eIn silence, they waited.\u003c/p\u003e\n\u003cp\u003e6.\u003c/p\u003e\n\u003cp\u003eWhere To Go?\u003c/p\u003e\n\u003cp\u003eLenore split her attention between the body and the clock on the wall. The coat rack was increasingly heavier, but she had to be ready if the Sheriff did decide to sit up and eat them. Ken plucked a heavy lamp off a table, ditched the lampshade, and wound the cord around the base. It was a good bludgeoning weapon.\u003c/p\u003e\n\u003cp\u003e“If he gets up, I’ll hit him first then you,” Lenore instructed Ken.\u003c/p\u003e\n\u003cp\u003e“I’m ready.” Ken hoisted the lamp stand over his head. He appeared both scared and determined.\u003c/p\u003e\n\u003cp\u003eFive minutes passed.\u003c/p\u003e\n\u003cp\u003e“He’s not getting up,” Ken said at last.\u003c/p\u003e\n\u003cp\u003e“Yeah, I think you’re right.”\u003c/p\u003e\n\u003cp\u003e“The ones outside got up right away.”\u003c/p\u003e\n\u003cp\u003eLenore poked at the body with the coat rack. There was no response. “Well, zombies aren’t smart enough to fake it.”\u003c/p\u003e\n\u003cp\u003e“I think he’s really, really dead.” Ken poked the Sheriff’s head a few times with his foot. It lolled about a little, but the Sheriff did not move otherwise. “Yep. Dead.”\u003c/p\u003e\n\u003cp\u003e“Okay. Then we leave now and get Mr. Cloy,” Lenore decided.\u003c/p\u003e\n\u003cp\u003e“I’m so ready to not be here with dead things.” Ken headed to the rear of the store. Lenore trudged along behind him.\u003c/p\u003e\n\u003cp\u003e“Got your keys?”\u003c/p\u003e\n\u003cp\u003eKen frowned. “Of course-oh, wait!” He dashed to the counter, giving wide berth to the dead body on the floor, and grabbed up his keys from beside the cash register. “What would I do without you?”\u003c/p\u003e\n\u003cp\u003e“Let’s not find out,” Lenore answered.\u003c/p\u003e\n\u003cp\u003eKen rushed to her side and together they stared at the heavy wood door that opened onto the alley. “I’m scared.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“I never watched horror movies growing up. They scared me too much. I’m not ready for this,” Ken said in a trembling voice. He wrapped his arms around her and laid his head on her shoulder.\u003c/p\u003e\n\u003cp\u003eReaching up, Lenore patted his hair, stiff with hair gel and hairspray, and sighed. “Me neither. I thought they were stupid movies.”\u003c/p\u003e\n\u003cp\u003e“So neither one of us knows what we’re doing,” Ken groaned.\u003c/p\u003e\n\u003cp\u003e“Yep. But then again, it’s a unique situation. It’s not like dead babies get up every day and start eating everyone.”\u003c/p\u003e\n\u003cp\u003e“Unless you live in L.A.” Ken was convinced everything bad on the planet originated in L.A.\u003c/p\u003e\n\u003cp\u003eLenore rolled her eyes and heaved the coat rack over her shoulder. “Okay, open the door.”\u003c/p\u003e\n\u003cp\u003e“I really don’t wanna.” \u003c/p\u003e","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-2/page-10.html","bookId":2485,"creation":"Oct 5, 2019 10:32:26 PM","modification":"Oct 5, 2019 10:32:26 PM"}
