{"id":103789,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKneeling next to the woman who had raised her with a firm hand and a loving smile, Lenore could barely breathe. Her ribs suddenly felt too tight for her body and her chest hurt. Her grandmother’s face looked peaceful as if she was sleeping.\u003c/p\u003e\n\u003cp\u003e“I don’t see any blood,” Lenore whispered to Ken. Her hand clutched the heavy glass bowl at her side, ready to strike. But would she be able to?\u003c/p\u003e\n\u003cp\u003eKen remained motionless, breathing heavily, his eyes wide.\u003c/p\u003e\n\u003cp\u003eTito’s prayer ended abruptly. Lenore heard the creak of the chair as he stood and his footfalls approaching. The tips of his battered boots came into view as he stood over her grandmother. Lenore raised her head to see he was aiming his pistol over her grandmother’s head.\u003c/p\u003e\n\u003cp\u003e“Put the bowl down. I’ll do it if we have to,” he said.\u003c/p\u003e\n\u003cp\u003eLenore did as he said, then gripped her grandmother’s arm. Shaking the old woman, Lenore could feel her own heart pounding even harder. If her grandmother opened her eyes to reveal those terrible milky dead eyes, she didn’t think she could hold onto her sanity.\u003c/p\u003e\n\u003cp\u003eA low, uneven moan issued forth from the old woman’s lips.\u003c/p\u003e\n\u003cp\u003e“Oh, God,” Ken whispered.\u003c/p\u003e\n\u003cp\u003eTito didn’t fire, but Lenore saw his body tense.\u003c/p\u003e\n\u003cp\u003e“Grandma?” Lenora’s voice rasped over the word. “Grandma, wake up!”\u003c/p\u003e\n\u003cp\u003eHer grandmother sat up swiftly.\u003c/p\u003e\n\u003cp\u003eTito and Lenore both jumped back.\u003c/p\u003e\n\u003cp\u003e“Lord Jesus, save me,” her grandmother exclaimed and stared up at them in shock.\u003c/p\u003e\n\u003cp\u003eTito let out a long breath and lowered the pistol.\u003c/p\u003e\n\u003cp\u003e“Grandma, you’re alive!” Lenore hugged her tight, relief flooding her.\u003c/p\u003e\n\u003cp\u003e“Oh, thank God!” Ken threw his arms around both of them.\u003c/p\u003e\n\u003cp\u003e“I won’t be if you keep on squeezing me like this!”\u003c/p\u003e\n\u003cp\u003eLenore released her grandmother, her smile so wide she felt as if her cheeks would crack.\u003c/p\u003e\n\u003cp\u003eHer grandmother straightened her dress and looked around warily. Still woozy, she raised a hand to her head. “Okay, I remember going to the door and seeing...” She fell silent and glanced up at Tito sadly. “There were all sorts of bad stuff on the TV. I didn’t think it was here yet. But I saw-”\u003c/p\u003e\n\u003cp\u003e“I already took care of her,” Tito said in a pained tone.\u003c/p\u003e\n\u003cp\u003eLenore helped her grandmother stand. She could almost hear the older woman’s bones creaking.\u003c/p\u003e\n\u003cp\u003e“I was on the phone with her and she said someone was at the door. We were in the middle of our soap opera and I wasn’t too pleased about her taking off just when Stefano was revealing his evil plans. Then I heard her screaming.” Grandma leaned heavily against the back of her sofa and sighed. “I couldn’t do nothing, but listen. It was awful.”\u003c/p\u003e\n\u003cp\u003eTito didn’t move, but Lenore saw a tear on his cheek under his dark sunglasses.\u003c/p\u003e\n\u003cp\u003e“I went to the door and looked out and saw her out there...” Grandma sighed and shook her head. “…on the porch and Mr. Thames was...he was…I guess it was too much. I remember I was gonna go get the gun and then...I think I fainted.”\u003c/p\u003e\n\u003cp\u003e“So none of those things got you in any way or into the house?” Tito asked.\u003c/p\u003e\n\u003cp\u003e“No. No. I’m sorry, Tito, about your mother.”\u003c/p\u003e\n\u003cp\u003e“Me, too, Grandma.” Tito lightly kissed her cheek. “I’m going to double-check the doors and windows. You three stay here.”\u003c/p\u003e\n\u003cp\u003eLenore lovingly embraced her grandmother, relishing the soft warmth of her body. She was given a firm, tight hug, then released. Ken flung his arms around the old woman and was rewarded with a hug and a kiss on the cheek.\u003c/p\u003e\n\u003cp\u003e“It’s good to see you two are okay. Sorry to scare you, but my blood pressure makes it rough on me sometimes. I better take my pills.”\u003c/p\u003e\n\u003cp\u003eTito slipped back into the living room. The house was so small it didn’t take much time to check it. “Windows and doors are all locked. I closed all the curtains so that they can’t see us in here. Better close those, too.”\u003c/p\u003e\n\u003cp\u003eKen hurried over and slid the heavy velvet curtains over the bay window. They were plunged into an eerie darkness.\u003c/p\u003e\n\u003cp\u003e“I need my revolver,” Grandma decided. “It’s under my bed.”\u003c/p\u003e\n\u003cp\u003e“I’ll get it,” Tito said. “I want you three to stay in this room until I can figure out what to do next.”\u003c/p\u003e\n\u003cp\u003e“You know, we can’t stay here,” Ken said in a quavering voice. “Once they figure out we are in here, they’re gonna get in.”\u003c/p\u003e\n\u003cp\u003e“I know, man. That is why I gotta think,” Tito’s voice was sharp. “Just let me think, okay?” He walked out of the living room and into the kitchen.\u003c/p\u003e\n\u003cp\u003eKen made a face as Tito disappeared and Lenore shook her finger at him. “He just had to kill his own mama.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t need to snap my head off. I’m just trying to help!” Ken sulkily sat in a chair, Cher’s carrier on his lap, and his bag at his side.\u003c/p\u003e\n\u003cp\u003e“It’s okay, baby. We’ll get out of here,” Grandma assured him.\u003c/p\u003e\n\u003cp\u003eKen’s skin was too pale and Lenore was worried about how much he was sweating. She felt completely exhausted, too, but Ken appeared sickly. He was not emotionally resilient. The day was definitely too much for her to bear so she imagined he must be on the verge of a breakdown.\u003c/p\u003e\n\u003cp\u003eTito reappeared with the revolver, sliding bullets into the cylinder as he walked. Lenore had forgotten all about the revolver. It had belonged to her grandfather.\u003c/p\u003e\n\u003cp\u003e“Can you shoot this?”\u003c/p\u003e\n\u003cp\u003e“I can shoot it,” Grandma said confidently. “I can kill those zombies. Trust me. After what I saw them do to Olympia, I can shoot ‘em.”\u003c/p\u003e\n\u003cp\u003eTito nodded as he handed it over.\u003c/p\u003e\n\u003cp\u003e“I don’t know how to reload this,” Lenore confessed, pointing to the shotgun. “I beat the zombie with it instead.”\u003c/p\u003e\n\u003cp\u003eTito’s lips quirked into a small smile. “Okay. Let me show you how to do that. Where is the ammo?”\u003c/p\u003e\n\u003cp\u003eLenore lifted Mr. Cloy’s bag and the shells inside rattled around. For the next few minutes, Tito patiently explained to both her and Ken how to load the shotgun and what they had to do to fire it. Ken seemed to be barely paying attention and looked sleepy. Despite her head hurting so badly she wanted to remove her brain to release the pressure, Lenore felt keenly awake. She shook Ken a few times and he looked at her blearily.\u003c/p\u003e\n\u003cp\u003e“Keep alert,” Lenore ordered him.\u003c/p\u003e\n\u003cp\u003eKen nodded. “I need water.”\u003c/p\u003e\n\u003cp\u003e“I’ll get it,” Grandma said.\u003c/p\u003e\n\u003cp\u003e“Be careful,” Tito ordered.\u003c/p\u003e\n\u003cp\u003e“I got my revolver. I’m okay,” she answered, heading to the kitchen. Her fuzzy pink slippers slapped against the wood floor as she walked.\u003c/p\u003e\n\u003cp\u003e“What are we going to do now?” Lenore asked Tito.\u003c/p\u003e\n\u003cp\u003e“Get out of here. Out of the house. Out of town.”\u003c/p\u003e\n\u003cp\u003e“We can take the old caddy in the garage,” Lenore decided.\u003c/p\u003e\n\u003cp\u003e“I was thinking about Mr. Thames’s old RV,” Tito answered. “He’s got that thing in mint condition.”\u003c/p\u003e\n\u003cp\u003e“We’d have to go across the road for that.” Fear filled Ken’s voice and his eyes seemed even more sunken than before.\u003c/p\u003e\n\u003cp\u003e“We can do it if we’re smart,” Tito promised him. “Load up on supplies here, get them into the caddy, drive not to the front of his house, but down the alley in the back to where the RV is, load up, get out of town.”\u003c/p\u003e\n\u003cp\u003e“Sounds good to me,” Grandma piped up as she came into the living room holding a tall glass of ice water for Ken. “The zombies are trying to get in the back gate. I think the faster we’re out of here, the better.”\u003c/p\u003e\n\u003cp\u003eKen seized the glass of water and gulped it down like it was vodka. Lenore didn’t blame him. Her stomach was quivering with anxiety.\u003c/p\u003e\n\u003cp\u003e“Let’s get packing and moving,” Tito said.\u003c/p\u003e\n\u003cp\u003eInstead of rushing to obey his words, they all stood in silence and listened as something began to beat on the front door. Fear filled the room. Lenore felt like she was going to choke on it.\u003c/p\u003e\n\u003cp\u003e“Children, we can’t stay here and wait for them to get in. Get moving. Now!” Grandma glowered at them, waving her hands.\u003c/p\u003e\n\u003cp\u003eHer voice jarred them out of their frozen state and they began to quickly gather anything they would need on the road. Lenore watched Ken hurry to the kitchen, clutching his bag and cat carrier. He still looked bad, but at least he was moving. That gave her hope.\u003c/p\u003e\n\u003cp\u003eThen a second set of fists began to pound on the screen door and she could hear the metal frame rattling.\u003c/p\u003e\n\u003cp\u003eTime was running out.\u003c/p\u003e\n\u003cp\u003e14.\u003c/p\u003e\n\u003cp\u003ePlanning to Escape\u003c/p\u003e\n\u003cp\u003eKen stood hopelessly in the kitchen not sure what he should be doing. He couldn’t remember what Tito had said. In fact, he was having trouble stringing his thoughts together into anything coherent.\u003c/p\u003e\n\u003cp\u003eThe banging on the front door resounded through the house. Ken couldn’t stop shaking uncontrollably and he just wanted to be with Lenore. Standing alone in the kitchen, he felt vulnerable. He sought out Lenore’s bedroom, desperate to be safely near her.\u003c/p\u003e\n\u003cp\u003eHe switched Cher’s carrier to his other hand and flexed his numb one. He had not realized how hard he had been clutching the handle. Inside the carrier, Cher let out another low hiss of frustration.\u003c/p\u003e\n\u003cp\u003e“Shh, Cher. It’s okay,” he lied. He swallowed hard, trying to get the nasty lump out of his throat. \u003c/p\u003e","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-2/page-17.html","bookId":2485,"creation":"Oct 5, 2019 10:32:26 PM","modification":"Oct 5, 2019 10:32:26 PM"}
