{"id":103798,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLenore watched the sides of the road for any signs of the zombies. The junipers, cedars, and oaks lining the road could be hiding anything from zombies to deer. The last thing they needed to do was hit something on the road. Being stranded in an area where zombies were prowling around was not a situation she wanted to experience.\u003c/p\u003e\n\u003cp\u003eThe trees gave way to brush, the road flattening out between two large fields. The fences were still intact, and Lenore felt a little safer as she drove.\u003c/p\u003e\n\u003cp\u003eKen returned to his seat with the map and flipped on the CB. Static filled the air, competing with Cher’s questioning meows.\u003c/p\u003e\n\u003cp\u003e“I highlighted the path we should take,” Lenore said to Ken. “Just tell me what to do once we hit the farm road.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“And start flipping channels on that thing,” Lenore ordered, briskly indicating the CB with one hand.\u003c/p\u003e\n\u003cp\u003eKen nodded and started to dial through the various channels. There was only static and silence. Ken turned up the sound and listened intently.\u003c/p\u003e\n\u003cp\u003e“There has to be someone out there, right?”\u003c/p\u003e\n\u003cp\u003e“Not if everyone is dead,” Lenore answered.\u003c/p\u003e\n\u003cp\u003e“Maybe we’re not in range yet.” Ken’s face wrinkled with worry as he continued to skip through the channels.\u003c/p\u003e\n\u003cp\u003eCher finally ceased yowling, much to Lenore’s relief. Casting her gaze back and forth between the two sides of the road, she was relieved to see nothing stirring in the overgrown fields.\u003c/p\u003e\n\u003cp\u003e“Where do you think those zombies came from?” Ken asked.\u003c/p\u003e\n\u003cp\u003eLenore shrugged. “I wouldn’t know. Maybe from a farm. Or a road. A town. It’s been a month and a half. They could have just been walking, looking for someone to eat.” The engine was starting to pull uncomfortably and Lenore studied the gas gage. It was technically on empty. Did that mean they had a few more gallons or was this morning about to turn really sour?\u003c/p\u003e\n\u003cp\u003eThe static hissed and whined as Ken continued to turn the dial.\u003c/p\u003e\n\u003cp\u003e“Do you think they can smell us or something?”\u003c/p\u003e\n\u003cp\u003eLenore snorted. “From miles away? I think they just got lucky.”\u003c/p\u003e\n\u003cp\u003e“I guess. I’m just glad they didn’t show up when...” He faltered. “We really dropped our guard.”\u003c/p\u003e\n\u003cp\u003e“Yeah. We ain’t doing that again.” Lenore pressed on the accelerator a little harder, feeling it starting to resist. They were going to need a miracle and fast.\u003c/p\u003e\n\u003cp\u003eA voice sizzled out of the static just before Ken flipped to another channel.\u003c/p\u003e\n\u003cp\u003e“Go back!”\u003c/p\u003e\n\u003cp\u003e“Did you hear it?” Ken squealed.\u003c/p\u003e\n\u003cp\u003e“Go back!”\u003c/p\u003e\n\u003cp\u003eFingers shaking, Ken carefully turned the dial backward, both of them listening intently.\u003c/p\u003e\n\u003cp\u003e“...run was pretty successful. We’re heading back now,” a man’s voice said.\u003c/p\u003e\n\u003cp\u003e“Things are clear here, so just head to the gate,” a woman’s voice answered.\u003c/p\u003e\n\u003cp\u003e“What do I do?” Ken gasped.\u003c/p\u003e\n\u003cp\u003e“Call them, idiot!” Lenore snatched the mouthpiece off the dash and tossed it to him. The engine was feeling even more sluggish now. She fervently whispered prayers in her mind.\u003c/p\u003e\n\u003cp\u003ePressing down the button, Ken said, “Uh, hello?”\u003c/p\u003e\n\u003cp\u003e“What was that, Ed?” the woman’s voice asked.\u003c/p\u003e\n\u003cp\u003e“I didn’t say nothin’, Peggy,” Ed answered.\u003c/p\u003e\n\u003cp\u003e“Uh, hi. I’m Ken. Who are you? Hi,” Ken said.\u003c/p\u003e\n\u003cp\u003eLenore hit him.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eLenore glowered.\u003c/p\u003e\n\u003cp\u003e“Hey, there, Ken,” the woman’s voice said pleasantly enough. “I don’t think we’ve talked before. Where you calling from?”\u003c/p\u003e\n\u003cp\u003e“An RV.”\u003c/p\u003e\n\u003cp\u003eLenore hit him again.\u003c/p\u003e\n\u003cp\u003e“An RV? Y’all are out there driving around?”\u003c/p\u003e\n\u003cp\u003e“We were camping, but Grandma died and then zombies showed up and--oww!” Ken rubbed his arm. “What?”\u003c/p\u003e\n\u003cp\u003e“Find out where they are!” Lenore shouted at him.\u003c/p\u003e\n\u003cp\u003e“You okay, Ken?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I just...yeah. I’m fine. So, me and my best friend are out here and there are zombies.” Ken flattened himself against the door trying to avoid Lenore’s fist.\u003c/p\u003e\n\u003cp\u003e“My name is Peggy and I’m the city secretary here in Ashley Oaks. You looking for a place to hole up?”\u003c/p\u003e\n\u003cp\u003e“Yeah. We’re low on gas and food and I think there are more zombies...” Ken’s voice faded out.\u003c/p\u003e\n\u003cp\u003eLenore slowed the RV as the farm road came into view. The brake felt hard under her foot. They were running out of time. Then her heart nearly came to a stop as she saw what awaited them on the road.\u003c/p\u003e\n\u003cp\u003e“Ken?” the woman’s voice said through the white noise of the CB.\u003c/p\u003e\n\u003cp\u003e“Uh, there are zombies,” Ken said in a frightened voice. “A lot of them.”\u003c/p\u003e\n\u003cp\u003eA crowd of zombies shambled along the road toward them. As the RV neared the turnoff, the zombie moans swelled in anticipation.\u003c/p\u003e\n\u003cp\u003e“Where are you?” Peggy asked, her voice calm, but urgent.\u003c/p\u003e\n\u003cp\u003eKen fumbled with the map. “Uh, uh...farm road 1226. It’s on the way to Emorton.”\u003c/p\u003e\n\u003cp\u003e“Are you close to Emorton?”\u003c/p\u003e\n\u003cp\u003e“No, uh, we’re near some farm. I can see the house from here.”\u003c/p\u003e\n\u003cp\u003eLenore turned onto the farm road, the steering wheel fighting her.\u003c/p\u003e\n\u003cp\u003e“A big blue and white house with a red barn?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Ken answered, his gaze riveted to the zombie mass in the rearview mirror.\u003c/p\u003e\n\u003cp\u003e“Okay, this is how you get to where we are...” Peggy started to ramble off directions, but Lenore had stopped listening.\u003c/p\u003e\n\u003cp\u003eThe engine sputtered and died.\u003c/p\u003e\n\u003cp\u003e“Ask them if they can come get us,” Lenore said sourly as Ken’s eyes widened.\u003c/p\u003e\n\u003cp\u003eThree hundred yards behind the RV, the zombies moaned hungrily.\u003c/p\u003e\n\u003cp\u003e23.\u003c/p\u003e\n\u003cp\u003eParade of the Dead\u003c/p\u003e\n\u003cp\u003eKen felt like someone had punched him in the chest. He couldn’t breathe and he was sure his heart had stopped. Cher started yowling again and the nice lady on the CB was saying something, but nothing registered in his brain but the moans of the dead that were stumbling toward the stalled RV.\u003c/p\u003e\n\u003cp\u003eThey were going to die.\u003c/p\u003e\n\u003cp\u003eLenore snatched the mouthpiece out of his hand. “We’re out of gas and time. There is a bunch of them heading our way.”\u003c/p\u003e\n\u003cp\u003eIn shock, Ken turned and stared at his cat in her carrier. She was hissing and growling, her back arched and her fur on end.\u003c/p\u003e\n\u003cp\u003e“Slow ones. Real slow. There is no way the RV is gonna hold up though. We got a busted door,” Lenore’s voice answered the woman’s questions.\u003c/p\u003e\n\u003cp\u003eHer words gradually sunk through the numbness encompassing Ken’s mind. Sliding off his seat, he tottered to the counter where the crowbar lay. He picked it up and grabbed Cher’s carrier. The weight in his hands drew him slowly out of his fog into reality.\u003c/p\u003e\n\u003cp\u003eLenore hauled herself out of the driver’s seat. Her chubby face set with grim determination, she hurried past Ken, snatching up a hunting knife and shoving it into her hoodie pocket. Out the back window Ken could see the zombies gaining on the RV.\u003c/p\u003e\n\u003cp\u003e“What are we going to do?” Ken whispered, forcing words out of his constricted throat. His voice quivered with his distress.\u003c/p\u003e\n\u003cp\u003e“Start walking,” Lenore answered. Her voice was low and tense.\u003c/p\u003e\n\u003cp\u003e“We can’t! They’ll...they’ll...” Ken felt tears in his eyes. He thought of Mr. Cloy and the dead town they had escaped. He didn’t want to die like that.\u003c/p\u003e\n\u003cp\u003e“We can, Ken. Those bastards are slow. We can outpace them. We just need to stay ahead of them. That lady on the CB is sending people to save us. We gotta move.” Lenore searched around for anything else she could use as a weapon.\u003c/p\u003e\n\u003cp\u003eKen couldn’t stop staring at the mass of mutilated and gore covered people marching toward the RV. “Can’t we just hide in here?”\u003c/p\u003e\n\u003cp\u003e“That door is gonna give out,” Lenore said, pointing to the side door. “We’ll be dead by the time those people get here.” She cast one long look out the back window, scrutinizing the crowd. “They’re slow. See?”\u003c/p\u003e\n\u003cp\u003e“But...but...” Ken faltered as Lenore gave him a dark look. then brushed past him.\u003c/p\u003e\n\u003cp\u003eShe didn’t take the side door, but crawled over the passenger seat instead. Ken followed, his legs wobbly and unsure. Cher hissed angrily, her weight shifting constantly in the carrier. Handing the carrier to Lenore, Ken slid over the seat. His feet dangling out of the RV, he froze. He could smell the dead. They were that close.\u003c/p\u003e\n\u003cp\u003e“Ken, move it,” Lenore ordered.\u003c/p\u003e\n\u003cp\u003e“I can’t!” Ken wailed. Panicking, he grabbed for the carrier. He and Cher would hide inside. It would be safer than walking ahead of a zombie parade.\u003c/p\u003e\n\u003cp\u003eLenore swung the cat out of his reach and snagged his wrist. With one swift jerk, she hauled him out of the RV. His feet twisted under him as he landed on the hot asphalt, and he fell to his knees. Tiny pebbles bit into his hands and knees. Looking up, he saw the dead were even closer. Their moans were growing in volume at the sight of the living flesh.\u003c/p\u003e\n\u003cp\u003eAnother hard yank drew him to his feet. Lenore dragged him along as she set a quick pace away from the RV and the horde of undead. “C’mon, Ken. Keep moving. I don’t want to die today.”\u003c/p\u003e\n\u003cp\u003eKen struggled to make his feet and legs work. He kept tripping and stumbling as the slap of many feet against the asphalt mingled with the constant groans of the zombies. \u003c/p\u003e","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-2/page-26.html","bookId":2485,"creation":"Oct 5, 2019 10:32:26 PM","modification":"Oct 5, 2019 10:32:26 PM"}
