{"id":103775,"no":3,"title":"Page 3","content":"\u003cp\u003eIn seconds, the children were upon her, knocking the nozzle from her hand.\u003c/p\u003e\n\u003cp\u003eKatarina braked, shifted into park, grabbed the cleaver, and sprang from the car.\u003c/p\u003e\n\u003cp\u003eThis isn’t real, she thought, but the cleaver in her hand was sticky with blood and fleshy bits.\u003c/p\u003e\n\u003cp\u003eThe world didn’t feel real, but the cleaver did.\u003c/p\u003e\n\u003cp\u003eIt wasn’t until she was hacking away at the small limbs and heads of the children biting into her mother’s chest that the world finally snapped back into focus. Suddenly every whack of the cleaver registered fully in her senses: the impact that jarred her joints, the terrible sound of the blade slashing through flesh and bone, and the stink of death and blood.\u003c/p\u003e\n\u003cp\u003eSobbing, she kicked the bodies of the children away from her mother. The tiny broken forms lay silent and twisted on the green lawn.\u003c/p\u003e\n\u003cp\u003e“Mother, I’m so sorry,” Katarina cried out.\u003c/p\u003e\n\u003cp\u003eLeaning over her mother, she saw the woman’s angry eyes fastened on her with seething hate. The woman who had conceived her to be her servant, her caretaker, glared at her with unremorseful hate.\u003c/p\u003e\n\u003cp\u003e“I’ll take care of you, mother,” Katarina promised.\u003c/p\u003e\n\u003cp\u003eThe hateful gaze faded into oblivion.\u003c/p\u003e\n\u003cp\u003e“I’ll always take care of you.”\u003c/p\u003e\n\u003cp\u003eKatarina raised her cleaver.\u003c/p\u003e\n\u003cp\u003eIn the darkened house, Katarina listened to the world dying. Showered, dressed in jeans, a t-shirt, and denim jacket, she heard the moans of the dead mingling with the death cries of the living outside the tiny house.\u003c/p\u003e\n\u003cp\u003eThe TV was muted, but the closed captioning and scenes of chaos told the full story. Something terrible was happening in the world and it was everywhere.\u003c/p\u003e\n\u003cp\u003eAs she stared at the images of death and destruction, she loaded her father’s old hunting rifle. The cleaver was cleaned and lying on the coffee table beside a box of ammunition. A backpack filled with her meager possessions listed near the front door. Where she going she didn’t know, but she would not sit in this house any longer. It had never been a home. It had been her prison. And now, as the world died, she was set free.\u003c/p\u003e\n\u003cp\u003eStanding, she shoved the box of ammunition into her jacket. She stared at the cleaver and its brutal, shiny beauty. She started to reach for it, but reconsidered. The intimacy of killing with it was too much to bear.\u003c/p\u003e\n\u003cp\u003eShe snagged her backpack on the way out the door.\u003c/p\u003e\n\u003cp\u003eThe car sat where she had left it, the driver’s door open, the engine still ticking. One of the things that used to be a living being rushed her. She paused in her steps, raised her rifle, gazed through the sight, and fired. A plume of blood flashed bright red in the sunlight, then it fell.\u003c/p\u003e\n\u003cp\u003eShe had killed three men, two children, and her mother today.\u003c/p\u003e\n\u003cp\u003eA quick look inside the car and she saw it was clear. She slid into the driver’s seat, shut the door, and shifted gears. Black smoke was rising from the direction of the highway. She would head out of town and see if anywhere in the world was safe.\u003c/p\u003e\n\u003cp\u003eA stop sign loomed ahead and she considered running it. At the last minute, she banged on her brakes and stared through the windshield at the quiet street before her. It looked so normal, quaint, and peaceful, but it was a lie. Death was everywhere now. The world she had known was dying.\u003c/p\u003e\n\u003cp\u003eShe started the car through the intersection when she heard the whoop of a siren. Her foot stomped on the brake.\u003c/p\u003e\n\u003cp\u003eA deputy sheriff’s car pulled up beside her. The window scrolled down and she quickly lowered hers as well. A very young man with blond hair and bright blue eyes that were a little too wide stared out at her.\u003c/p\u003e\n\u003cp\u003e“You need to get to city hall! We’re making a perimeter to keep them out!” he yelled at her. “I’m heading there now. Want to come along?”\u003c/p\u003e\n\u003cp\u003eShe killed the engine, grabbed her rifle and her backpack, and abandoned her mother’s car. The deputy shoved the passenger door open and she climbed in. The car reeked of sweet and blood. The young man was shaking and looked more like a scared boy than a seasoned lawman. He was covered in blood.\u003c/p\u003e\n\u003cp\u003e“You okay?” she asked warily.\u003c/p\u003e\n\u003cp\u003e“Not my blood,” he answered sadly.\u003c/p\u003e\n\u003cp\u003e“I’m Katarina.”\u003c/p\u003e\n\u003cp\u003e“Curtis,” he said, and shifted gears.\u003c/p\u003e\n\u003cp\u003eThe car glided through town in the direction of the big hotel that loomed over Ashley Oaks. Empty store fronts, abandoned gas stations, and forlorn, empty lots were once the telltale signs of the dying town. But now it was truly dead.\u003c/p\u003e\n\u003cp\u003eOr was it?\u003c/p\u003e\n\u003cp\u003eAhead, Katarina saw trucks filled with earth pulled up around the new construction site. A group of men were shoving heavy bags of cement and dirt under the vehicles and between the cabs and the trailers creating a barricade. A mangled wreck was near the new fortifications.\u003c/p\u003e\n\u003cp\u003e“That’s it?” Katarina asked.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Curtis responded in a tired, frightened voice.\u003c/p\u003e\n\u003cp\u003eThey parked on a side street and ran together to the blocked off area. As they scrambled over the back of a truck, the construction site came into focus. People were camped inside, clustered together. She could see some of her old customers among the survivors: Juan, Travis, Old Man Watson, Peggy the city secretary, Mayor Reyes, and others.\u003c/p\u003e\n\u003cp\u003eKatarina felt the world tilt and shift again as the world took on a new reality.\u003c/p\u003e\n\u003cp\u003eA shout behind her drew her attention. Turning, she saw some of the construction workers scrambling to evade one of the dead things. Raising her rifle, she felt a tear on her cheek as she did what she now knew she was very good at and would serve her well in this new world.\u003c/p\u003e\n\u003cp\u003eShe killed.\u003c/p\u003e\n\u003cp\u003eThe Unknowns’ Story\u003c/p\u003e\n\u003cp\u003eThis untold tale is about the people who dwell in the background of the AS THE WORLD DIES trilogy. Not everyone survived to make it to the fort, and not every survivor in Texas made it to Ashley Oaks. I have been dying for some time to tell some of those stories.\u003c/p\u003e\n\u003cp\u003eThe inception of this particular story occurred when a small press asked me to be a part of a new flash fiction anthology. I wrote the first section of this story with that anthology in mind. Later, when the anthology was canceled, I decided to expand the story for my online fans now that I was free of the constraints of word limits.\u003c/p\u003e\n\u003cp\u003eThe tale is rather disturbing as it deals with vengeance, jealousy, and madness in the claustrophobic confines of a survivor haven.\u003c/p\u003e\n\u003cp\u003eI am very happy to include A Terrible Moment in this collection\u003c/p\u003e\n\u003cp\u003eA Terrible Moment\u003c/p\u003e\n\u003cp\u003eShe wanted it to be over.\u003c/p\u003e\n\u003cp\u003eThe constant moaning of the dead outside the warehouse was wearing away at her last nerve. Her hands trembled at her sides as she clenched them into tight fists. The cool air reeked of rotting citrus, but at least it kept the stench of the dead at bay.\u003c/p\u003e\n\u003cp\u003eNearby, she could see her soon to be ex-husband, his trollop secretary, and the plant manager engaged in a heated discussion. They had invited her to join their planning session, but she had declined. She wanted nothing to do with them.\u003c/p\u003e\n\u003cp\u003eShe was only here because of her children. The kids were with their lousy father when the dead had risen. In a panic, she had sped across town to this godforsaken orange juice factory, just to end up trapped with the man she loathed and his slut.\u003c/p\u003e\n\u003cp\u003eLooking over her shoulder, she saw the kids playing with toys the whore had given them. The two boys happily chatted as they played, oblivious to everything around them. They had no idea that their father was a cheating bastard and that the woman they called Aunt Julie was a fucking bitch. They didn’t understand how much pain she was in and maybe they wouldn’t even care. They worshipped their father. That thought only fed her rage.\u003c/p\u003e\n\u003cp\u003eShe looked at the glass venetian blinds covering the window next to her. She could barely make out the outline of the dead creatures gathered outside her hellish prison. Fortunately, the iron burglar bars over the windows kept the zombies out, but they also trapped her inside.\u003c/p\u003e\n\u003cp\u003eThe stench of slowly decomposing citrus was so terrible she pulled the collar of her gray sweatshirt over her nose. It was stained and worn. But then again, so was she. After marrying, she had hacked off her long tawny tresses, tossed out the makeup, and settled into a comfortable life of being a mother and wife. She had done everything she could for the good-for-nothing and now he was divorcing her.\u003c/p\u003e\n\u003cp\u003eScowling, she observed her husband as he spoke passionately to the other two adults. Some stupid plan about climbing onto the roof and lowering everyone down onto a truck with a rope was taking form. They were all idiots.\u003c/p\u003e\n\u003cp\u003e“We can break the windshield, crawl in, and get it started. Yeah, that will be a little dangerous, but the truck is high enough off the ground that they won’t be able to reach us. They don’t climb. We’ve seen that,” her husband said.\u003c/p\u003e\n\u003cp\u003eShe scoffed at his words. He always had to be in charge. What made him think he was the big hero now?\u003c/p\u003e\n\u003cp\u003eAnnoyed, she took a step closer to the window. The blinds were stuck and not completely closed. A chewed-up face with one eye missing growled at her as it pressed against the bars.\u003c/p\u003e\n\u003cp\u003eThe laughter of the kids as they played angered her. They believed their father would save them. They weren’t even paying attention to her. They didn’t care about her and her pain.\u003c/p\u003e\n\u003cp\u003eRage burned in her soul.\u003c/p\u003e\n\u003cp\u003eThey all thought they were so safe behind these bars. What was worse was that they all believed her stupid husband could actually save them from the hungry mouths of the walking dead. It disgusted her how her kids believed their daddy was so wonderful. She was the one who always took care of them. She was the one who gave them life. \u003c/p\u003e","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-2/page-3.html","bookId":2485,"creation":"Oct 5, 2019 10:32:26 PM","modification":"Oct 5, 2019 10:32:26 PM"}
