{"id":103780,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Well, I don’t like the news. I don’t like hearing sad stuff or scary stuff, but if something major is going down, I think it has to be those crazy Muslims,” Ken decided. “Seriously, they hate us.”\u003c/p\u003e\n\u003cp\u003e“Oh, Lord,” Lenore drawled.\u003c/p\u003e\n\u003cp\u003e“They do! Because we’re rich and stuff.”\u003c/p\u003e\n\u003cp\u003eLenore walked over and folded her arms across her ample bosom. “Okay, so they hate us. But why come and put a bunch of bad stuff in the water so we start eating each other and being all crazy?”\u003c/p\u003e\n\u003cp\u003e“Because they want to destroy us from within ‘cause they hate our freedom,” Mr. Cloy told her. “Honey, you’re still young-”\u003c/p\u003e\n\u003cp\u003e“Do not honey me!” Lenore snapped. “I know what is going on just as much as you do and they hate us cause we’re over there messing in their business.”\u003c/p\u003e\n\u003cp\u003e“Look here, Missy Democrat,” Ken said going all-Republican on her. “If they weren’t messing in our business-”\u003c/p\u003e\n\u003cp\u003e“It is the responsibility of the United States of America as the only superpower in the world to police-” Mr. Cloy started up.\u003c/p\u003e\n\u003cp\u003e“Oh, and what about China?” Lenore cut in.\u003c/p\u003e\n\u003cp\u003eIt was an old argument between the three of them. Ken was an old school Republican that still adored Reagan. Mr. Cloy was a Neo-Conservative Republican that disagreed completely with Ken’s sexual orientation, yet liked him anyway. Lenore was a hardcore Democrat. And all three loved to debate and argue. It was almost gleeful when they started up.\u003c/p\u003e\n\u003cp\u003eKen was about to unleash his best speech on China when the sound of police sirens pierced their conversation. Mr. Cloy, who had been making a point about the moral superiority of the United States, stopped in mid-sentence.\u003c/p\u003e\n\u003cp\u003eA car outside slammed on its brakes and there was a loud screech as they locked. The terrifying sound of two large metal objects slamming together quickly followed.\u003c/p\u003e\n\u003cp\u003e“Shit,” Mr. Cloy said, his eyes going wide behind his glasses.\u003c/p\u003e\n\u003cp\u003eKen darted around the counter and whipped back one of the curtains. Outside were six cars: two smashed together, a van, a station wagon, and two police cruisers hemming them in. Steam was billowing out from under the crumpled hood of one of the crashed cars and people were pouring out of the vehicles. Some were shouting, others were crying. A few were covered in blood.\u003c/p\u003e\n\u003cp\u003e“Oh shit,” Ken said.\u003c/p\u003e\n\u003cp\u003eLenore took one long look at the scene. “It’s here,” she said simply.\u003c/p\u003e\n\u003cp\u003e3.\u003c/p\u003e\n\u003cp\u003eThings Going Bad Fast\u003c/p\u003e\n\u003cp\u003eLenore took a long hard look at the chaos right outside their door. Two highway patrol cars and the town’s only police car had the wreck surrounded. The people pouring out of the crashed vehicles were families with children, and the cops hesitated on drawing their weapons.\u003c/p\u003e\n\u003cp\u003eMr. Cloy opened the door slightly so they could hear what was going on. Ken reached out and laid his hand on her shoulder. She knew the gesture was not only to comfort her, but also him. She rested her hand on his fingers and slightly squeezed.\u003c/p\u003e\n\u003cp\u003e“Please, we’re just trying to get away!” A young white woman with brown hair sobbed uncontrollably, holding her baby tight. “Please! We have to get away from the highway!”\u003c/p\u003e\n\u003cp\u003e“Ma’am, calm down,” one of the highway patrolmen said. His hand lingered near his weapon, but he looked calm. “You were going over a hundred miles per hour. That’s not safe.”\u003c/p\u003e\n\u003cp\u003e“It’s not safe back there!” A Hispanic man spoke up, his face was bruised and blood was splattered over his shirt. His family was still in their vehicle. The mother leaned over the back of her seat trying to calm their children. “It’s insane on the highway. We had to get off of it!”\u003c/p\u003e\n\u003cp\u003e“People were hurting each other...ripping each other apart...even...even...” another woman cried out.\u003c/p\u003e\n\u003cp\u003e“They were eating each other!” An older white man shouted out the dramatic words. His face was so red Lenore wondered if he was going to pop a blood vessel. “We got the hell out of the city when things started going bad, but out on the highway there was a car accident and it slowed all the traffic down. Next thing you know there are these...things...people...they were pulling people out of cars...and...eating them!” The man wiped his face with the back of his hand. “They pulled my wife out of the car...and I couldn’t...I couldn’t...” He began to sob and silence fell over the road.\u003c/p\u003e\n\u003cp\u003eThe Hispanic man covered in bruises and blood continued the story. “We had to drive up the embankment to get off the highway. Then everyone started to try and do it! We were the first ones off, so we made it to the frontage and we just floored it!”\u003c/p\u003e\n\u003cp\u003e“Look, we’re hearing about the violence in the cities and a thing or two about the car wrecks on the highways but that doesn’t give you the right to speed down these roads. There are children, pets, old people-” one of the highway patrolman started to say.\u003c/p\u003e\n\u003cp\u003e“Then give us a ticket and we’ll leave!” This was from the first woman clutching the baby. “We’ll leave!”\u003c/p\u003e\n\u003cp\u003eThe town’s only policeman, Chief Murphy, pulled up on his belt and said in a soothing voice, “Okay, everyone just calm down. I know you folks saw something bad back there, but we need to keep this orderly.”\u003c/p\u003e\n\u003cp\u003e“You have no idea what we saw back there!” one of the drivers shouted. “You have no idea.”\u003c/p\u003e\n\u003cp\u003eMr. Cloy leaned toward Lenore and Ken and whispered. “City folk always think they can just come out here and do what they want.”\u003c/p\u003e\n\u003cp\u003e“Did you hear what they were saying?” Lenore asked him incredulously. Mr. Cloy had a one-track mind, but he was being ridiculous\u003c/p\u003e\n\u003cp\u003eKen nodded in agreement. “I don’t blame them for freaking out. What they said sounds crazy, but look at them! They’re freaking traumatized.”\u003c/p\u003e\n\u003cp\u003eMr. Cloy frowned deeply, his hands in his jean pockets. “Say what you will, but this is the kinda thing that always turns out wrong. City people coming out here and making up their own rules and--”\u003c/p\u003e\n\u003cp\u003e“Carlos, help me!” A woman’s shrill scream sent Lenore’s skin crawling. “Something is wrong with the kids!”\u003c/p\u003e\n\u003cp\u003eA man rushed to open the door of one of the cars and the gathering crowd surged forward to see what was wrong. Mr. Cloy pushed the door to the shop all the way open and the three of them took several steps outside to see what was going on.\u003c/p\u003e\n\u003cp\u003eThe highway patrolmen hurried forward and told everyone to step back as the Sheriff helped the distressed parents lift one of their kids out of the back of the car. It was a teenage girl and she was having an appalling seizure. Blood gushed from a wound in her neck. A second child stumbled out of the car, clutching at the older girl. As everyone watched in terror, he leaned down and took a large bite of flesh from her forearm.\u003c/p\u003e\n\u003cp\u003e“Ramon, no!” His mother grabbed the boy and wrestled him from his sister.\u003c/p\u003e\n\u003cp\u003e“Oh, shit!” Ken seized Lenore’s arm and squeezed. “Did that just happen? Did that just happen?”\u003c/p\u003e\n\u003cp\u003eLenore felt queasy. “Uh huh, that baby just went crazy and tried to eat his sister.”\u003c/p\u003e\n\u003cp\u003eThe highway patrolmen pushed the gawking spectators back, then turned their attention to the girl on the ground. Her father was cradling her in his arms and sobbing. Meanwhile, the little boy who had taken a hunk out of his sister was chewing as his mother and several other people tried to drag him a safe distance away.\u003c/p\u003e\n\u003cp\u003e“Get it out of his mouth!” his mother screamed.\u003c/p\u003e\n\u003cp\u003eOne of the people trying to help her reached toward the boy’s mouth.\u003c/p\u003e\n\u003cp\u003e“This is gonna get bad fast,” Lenore said in a low voice.\u003c/p\u003e\n\u003cp\u003e“Uh huh,” Ken agreed.\u003c/p\u003e\n\u003cp\u003eTogether, they started backing toward the door to the beauty shop.\u003c/p\u003e\n\u003cp\u003e4.\u003c/p\u003e\n\u003cp\u003eThings Getting Worse Faster\u003c/p\u003e\n\u003cp\u003eKen’s grip on Lenore’s hand tightened as they backed toward the open doorway of the beauty shop.\u003c/p\u003e\n\u003cp\u003e“Hey, don’t touch that kid,” Mr. Cloy called out, stepping into the street.\u003c/p\u003e\n\u003cp\u003eThe man reaching out to pull the chunk of flesh from the child’s bloodied mouth hesitated. The kid swallowed what he was eating and lunged forward. The man and the mother of the child screamed as the kid’s hard teeth clamped on the fingers paused before his face.\u003c/p\u003e\n\u003cp\u003eAt the same time, the teenage girl on the ground stopped convulsing and her father let out an anguished cry. He attempted to throw himself over her, but one of the highway patrolmen shoved him back.\u003c/p\u003e\n\u003cp\u003e“Hold on! Let us work on her,” the patrolman said in an authoritative tone.\u003c/p\u003e\n\u003cp\u003eScreams and shouts filled the morning air as one group of people tried to wrestle the child off the screaming man while the other group gathered around the girl lying bloodied and dead on the road.\u003c/p\u003e\n\u003cp\u003e“Get inside, get inside!” Ken whispered urgently to Lenore.\u003c/p\u003e\n\u003cp\u003e“I ain’t arguing.”\u003c/p\u003e\n\u003cp\u003eThey both slipped into the shop, shut the door, and stared through the thick glass.\u003c/p\u003e\n\u003cp\u003eMr. Cloy hovered near the edge of the crowd watching with a shocked look on his face.\u003c/p\u003e\n\u003cp\u003e“Why doesn’t that damn fool get inside?” Lenore muttered.\u003c/p\u003e\n\u003cp\u003e“Why don’t any of them?” Ken clutched her arm tightly. “This is not good! So not good!”\u003c/p\u003e\n\u003cp\u003eA tug of war continued as the mother pulled on her child and two men pulled on his victim. The boy’s hard little teeth rent most of the skin off the two fingers as they were ripped from his mouth. \u003c/p\u003e","sourceLink":"https://allnovel.net/as-the-world-dies-untold-tales-volume-2/page-8.html","bookId":2485,"creation":"Oct 5, 2019 10:32:26 PM","modification":"Oct 5, 2019 10:32:26 PM"}
