{"id":111325,"no":16,"title":"Page 16","content":"\u003cp\u003eHe left after refusing to tell me where he was going. The less I knew the better, he said cryptically. As most of his explanations tended toward the cryptic, I did not think much of it at the time. I was consumed with the consumption of my breakfast, very tired, and a little on edge thinking about the grisly work that lay ahead. Looking back, I should have recognized that his secretiveness did not bode well; it never did.\u003c/p\u003e\n\u003cp\u003eFOUR\u003c/p\u003e\n\u003cp\u003eAnd the Sibyl would answer, “I would die.”\u003c/p\u003e\n\u003cp\u003eThe thing suspended in the jar, scratch, scratch.\u003c/p\u003e\n\u003cp\u003eSoft as a fly’s wing thrumming the empty air.\u003c/p\u003e\n\u003cp\u003eAnd we the dried-out husks, one rattling inside the gray carapace of the old house and the other outside in the gray, sterile air, rattling inside the carapace of his own skin.\u003c/p\u003e\n\u003cp\u003eI collapsed upon the stoop, as exhausted as the day folding into night, my hands singing with pain, rubbed raw by the digging; I was not used to manual labor.\u003c/p\u003e\n\u003cp\u003eYou must harden yourself . . . . You must become accustomed to such things.\u003c/p\u003e\n\u003cp\u003eImpossible to say how the woman named Beatrice had died. No soft tissue remained, and there were no telling injuries to the remnants of her bones except the marks from the saw where he had dismembered the body. He might have killed her, though if he had, then the Warthrop I had known since childhood was indeed no more. That Warthrop was cruel when he should have been kind and kind when cruelty was called for.\u003c/p\u003e\n\u003cp\u003e“It is my fault,” I whispered to the bones beneath my feet. “I should have known when I left him that he would fall off the edge of the goddamned world.”\u003c/p\u003e\n\u003cp\u003eDaylight dwindled, but I remained on the stoop. I resisted the instinct to rush inside and confront him. He was a stranger to me, the man who had been my sole companion for nearly twenty years, the man whose moods I had been able to read like an ancient mystic decoding the bloody entrails of the sacrificial lamb. I honestly did not know how he would react.\u003c/p\u003e\n\u003cp\u003eI drew my coat tightly across my chest. Ashes swirled in the gray air. A thought flittered across the broken landscape:\u003c/p\u003e\n\u003cp\u003eIt would be better if he were dead.\u003c/p\u003e\n\u003cp\u003eA mewling cry rose from deep in my throat, and I remembered the lambs, dark-eyed, white-faced, bleating in the gloom.\u003c/p\u003e\n\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eRiverside Drive at dusk: the mournful hoots of tugboats and the handsome facades facing dark water, the sturdy homes of somber men engaged in serious work. Civic clubs and church and jackets at dinner and the politics of respectable people. Fine crystal and crisp linen. Silk from China, tea from India, manners from England. And the lamps that quash the shadows but illuminate nothing, and the long dresses that trail dustless floors, and genteel voices from another room: Ça ne veut dire rien. Je n’y peux rien.\u003c/p\u003e\n\u003cp\u003eDid I have a card? the butler wanted to know.\u003c/p\u003e\n\u003cp\u003eNo, no, tell Miss Bates that the nine-fingered man is here.\u003c/p\u003e\n\u003cp\u003eAnd then, perhaps because she heard my voice, the elegant woman swept into the vestibule, the woman whose angelic voice had sung me back to sleep with words I did not understand, the same who had said, the last we met, It is no accident of circumstance that you’ve come to me—it is the will of God.\u003c/p\u003e\n\u003cp\u003e“William?” A hand rose to her mouth. “William!”\u003c/p\u003e\n\u003cp\u003eShe abandoned any pretense of formality, the glue that bound her petit bourgeois universe together, and crushed me to her breast in the fiercest of maternal hugs. Then a cool hand against either cheek as her eyes sought out mine, which had seen too much and not nearly enough.\u003c/p\u003e\n\u003cp\u003e“My, how you’ve grown!” she explained. “Lilly did not mention how very tall you are now!”\u003c/p\u003e\n\u003cp\u003e“How are you, Mrs. Bates?”\u003c/p\u003e\n\u003cp\u003eShe would fly down the hall chasing the startled, nightmare cries of her accidental charge and gather him into her arms, stroking his hair and pressing her lips to his head, and her voice when she sang to him was unlike anything he had ever heard, and sometimes in his confusion and grief he would forget and call her Mother. She never corrected him.\u003c/p\u003e\n\u003cp\u003eShe slipped her arm through mine and escorted me into the sitting room, where I half expected to find her husband in his reading chair, his patrician nose buried in the afternoon papers. But the room was empty—and unchanged in the three years I’d been gone. Here for a time I had been an ordinary boy playing parlor games and listening to music and reading books without even the hint of monsters in them. There were no monsters then except the one that lurked one ten-thousandth of an inch outside my range of vision.\u003c/p\u003e\n\u003cp\u003eHad I eaten? Did I want something to drink? And the woman sitting on the edge of her chair with knees demurely pressed together leaning forward and the bright von Helrung eyes shining beacons even here in the gathering shadows. She had held me and sung to me, and now I felt nothing, nothing at all, and was angry with myself for it.\u003c/p\u003e\n\u003cp\u003e“Is Lilly here?” I asked after an awkward silence.\u003c/p\u003e\n\u003cp\u003eShe left to fetch her, and I was left with no one but the faces upon the mantel, smiling at me from behind glass, Lilly and her brother and the impassive Mr. Bates and the woman who was worth more than he by far. I lowered my eyes as if in shame.\u003c/p\u003e\n\u003cp\u003e“Well, you are the last person I expected to see,” Lilly said from the doorway. Her mother hovered a few steps behind her in the hall, unsure of her place.\u003c/p\u003e\n\u003cp\u003e“Perhaps I should leave you two alone,” Mrs. Bates murmured, suddenly timid.\u003c/p\u003e\n\u003cp\u003e“Yes, you should,” Lilly said curtly. She swept into the room. Her face was free of makeup, and I saw an echo of her there, of the Lilly who’d bounded down the stairs at her great-uncle’s house with the words I know who you are.\u003c/p\u003e\n\u003cp\u003e“Why the last?” I asked her. “I told you I would come by.”\u003c/p\u003e\n\u003cp\u003e“I thought you had important scientific work tonight.”\u003c/p\u003e\n\u003cp\u003e“I do,” I replied. “Later.”\u003c/p\u003e\n\u003cp\u003e“And you’ve come by to invite me?”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t want you implicated, Lilly.”\u003c/p\u003e\n\u003cp\u003e“That presumes you will be caught. Do you think you will be?”\u003c/p\u003e\n\u003cp\u003eI laughed as if she’d made a joke and changed the subject. “Actually, there is something I forgot to ask you last night.”\u003c/p\u003e\n\u003cp\u003e“Well, you were drunk and we were attacked and threatened at gunpoint. I suppose I can forgive you.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t drunk.”\u003c/p\u003e\n\u003cp\u003e“You were well-lit, then.”\u003c/p\u003e\n\u003cp\u003e“Half-lit,” I corrected her, and that got a laugh. “Why did you come back?”\u003c/p\u003e\n\u003cp\u003eShe understood at once. “I know the answer you’d like to hear.” She paused. “I’ve been away for more than two years,” she said finally. “I was homesick.”\u003c/p\u003e\n\u003cp\u003e“And the timing had nothing to do with the annual congress?”\u003c/p\u003e\n\u003cp\u003e“And if it did?”\u003c/p\u003e\n\u003cp\u003eI cleared my throat. “I have never told you this . . .”\u003c/p\u003e\n\u003cp\u003eShe laughed. “I’m sure there are many things . . .”\u003c/p\u003e\n\u003cp\u003e“. . . but there were times your letters were the only . . .”\u003c/p\u003e\n\u003cp\u003e“. . . you have never told me.”\u003c/p\u003e\n\u003cp\u003e“. . . solace I had.”\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. “Solace?”\u003c/p\u003e\n\u003cp\u003e“Comfort.”\u003c/p\u003e\n\u003cp\u003e“Your life is uncomfortable?”\u003c/p\u003e\n\u003cp\u003e“Unusual.”\u003c/p\u003e\n\u003cp\u003e“Then receiving a simple letter must be an extraordinary thing.”\u003c/p\u003e\n\u003cp\u003e“It is. Yes.”\u003c/p\u003e\n\u003cp\u003e“Are you now? Uncomfortable?”\u003c/p\u003e\n\u003cp\u003e“Yes, I am a little.”\u003c/p\u003e\n\u003cp\u003e“That is unusual. Or would it be usual?” She frowned as if she were confused, which she was not.\u003c/p\u003e\n\u003cp\u003e“I suppose it would bring me some comfort if you pitied me for it.”\u003c/p\u003e\n\u003cp\u003e“I don’t pity you, Will. I am jealous of you. I envy you. Mine is the most usual, comfortable life imaginable.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t be jealous if you knew what it was.”\u003c/p\u003e\n\u003cp\u003e“It?”\u003c/p\u003e\n\u003cp\u003e“My life.”\u003c/p\u003e\n\u003cp\u003e“Oh, goodness! So dramatic in your old age! You really should extricate yourself from him, you know. You should ask Mother if her offer is still open.”\u003c/p\u003e\n\u003cp\u003e“Offer?”\u003c/p\u003e\n\u003cp\u003e“To adopt you!” Her eyes sparkled. She was enjoying herself.\u003c/p\u003e\n\u003cp\u003e“I don’t wish to be your brother.”\u003c/p\u003e\n\u003cp\u003e“Then what do you wish to be?”\u003c/p\u003e\n\u003cp\u003e“Of yours?”\u003c/p\u003e\n\u003cp\u003e“Of anything’s.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to be anything’s—”\u003c/p\u003e\n\u003cp\u003e“Then why don’t you leave him? Does he chain you up at night?”\u003c/p\u003e\n\u003cp\u003e“I intend to leave him, when the time is right. I have no interest in becoming what he is.”\u003c/p\u003e\n\u003cp\u003e“And what is he?”\u003c/p\u003e\n\u003cp\u003e“Not anything I want to be.”\u003c/p\u003e\n\u003cp\u003e“That’s my question, Will. What is it that you wish to be?”\u003c/p\u003e\n\u003cp\u003eI rubbed my hands together, staring at the floor. And her eyes, bird bright, upon my face.\u003c/p\u003e\n\u003cp\u003e“You told me once that you were indispensable to him,” she said softly. “Do you think you may have that backward?”\u003c/p\u003e\n\u003cp\u003eI became very still. “When you are leaving?” I asked.\u003c/p\u003e\n\u003cp\u003e“Soon.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Sunday. On the Temptation. Why?”\u003c/p\u003e\n\u003cp\u003e“Perhaps I would like to say good-bye.”\u003c/p\u003e\n\u003cp\u003e“You could say that now.”\u003c/p\u003e\n\u003cp\u003e“What have I said to upset you, Lilly? Tell me.”\u003c/p\u003e\n\u003cp\u003e“It’s what you haven’t said.”\u003c/p\u003e\n\u003cp\u003e“Tell me what to say, and I will say it.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “You really are the perfect apprentice, aren’t you? Always anxious to be of service, ever eager to please. No wonder he binds you to him so. You are the water that holds the shape of his cup.”\u003c/p\u003e\n\u003cp\u003eSeveral hours later, the water in the shape of the human cup was descending the stairs to the Monstrumarium, alone.\u003c/p\u003e\n\u003cp\u003e“Come with me tonight,” I’d said before we parted.\u003c/p\u003e\n\u003cp\u003e“I have made plans,” she’d answered.\u003c/p\u003e\n\u003cp\u003e“Change them.”\u003c/p\u003e\n\u003cp\u003e“I have no desire to change them, Mr. Henry.”\u003c/p\u003e\n\u003cp\u003e“I am a forward-thinking person,” I assured her. “I believe in full sexual equality, the right to vote, free love, all of that.”\u003c/p\u003e\n\u003cp\u003eShe grinned. “I wish you luck tonight, and in the hunt. Not that you need much—he is the greatest that ever was or will be. Something thrilling and tragic in that, when you think about it.”\u003c/p\u003e\n\u003cp\u003e“Yes. Thrillingly tragic. When will I see you again?”\u003c/p\u003e\n\u003cp\u003e“I shall be here till Sunday; I thought I told you that.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“Saturday, then.”\u003c/p\u003e\n\u003cp\u003e“I shall have to check my calendar.”\u003c/p\u003e\n\u003cp\u003eStanding in the vestibule, hands clenched at my sides, blood roaring in my ears. And his voice: Even the most chaste of kisses carries an unacceptable risk.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to kiss me again, are you?” she asked, lips slightly parted.\u003c/p\u003e\n\u003cp\u003e“I should,” I murmured in reply, edging closer to the lips slightly parted.\u003c/p\u003e\n\u003cp\u003e“Then why don’t you? Not enough wine or not enough blood?”\u003c/p\u003e\n\u003cp\u003eIt burns, my father had said. It burns.\u003c/p\u003e\n\u003cp\u003e“There is something I must tell you,” I whispered, my lips a hair’s breadth from hers, close enough to feel the heat of them and to smell her warm, sweet breath.\u003c/p\u003e\n\u003cp\u003e“Does it have to do with free love?” she asked.\u003c/p\u003e\n\u003cp\u003e“In a very roundabout way,” I answered, the words sticking in my throat. I could see my parents dancing in the blue fire of her eyes. “There is something inside of me . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-16.html","bookId":2549,"creation":"Oct 6, 2019 12:21:54 AM","modification":"Oct 6, 2019 12:21:54 AM"}
