{"id":111327,"no":18,"title":"Page 18","content":"\u003cp\u003e“I’m not afraid of you.”\u003c/p\u003e\n\u003cp\u003e“Then why are you shaking like that?”\u003c/p\u003e\n\u003cp\u003e“I’m n-n-not sh-shaking.”\u003c/p\u003e\n\u003cp\u003e“Well, you can’t be afraid of him. He’s dead and legless.”\u003c/p\u003e\n\u003cp\u003eI dragged a crate over and shoved the sundered body inside, placed the severed legs on top, and nailed down the lid. One down, one to go.\u003c/p\u003e\n\u003cp\u003eHe drew back when I stood up, as if he were the one left to pack up.\u003c/p\u003e\n\u003cp\u003e“I am innocent,” he said. “Dr. Walker is innocent.”\u003c/p\u003e\n\u003cp\u003eI shook my head and tsk-tsked, an echo of the monstrumologist when I said something particularly moronic. “Can’t say I believe you, old chum.”\u003c/p\u003e\n\u003cp\u003eHe protested his innocence no further, a mark in his favor, and I doubted Walker would have confided in him a scheme so dangerous on so many levels. Still, I couldn’t rule out the possibility. Maybe there wasn’t a tribe of Neanderthals hiding out in the Himalayas, but the unlikelihood wasn’t absolute proof.\u003c/p\u003e\n\u003cp\u003eI made short work of the eviscerated thief outside the storeroom, and after another half hour we had both crates at the side door facing Twenty-third Street. A light, cold rain was falling, the temperature hovered just above freezing, and the streetlights sizzled, shrouded in haloes of golden fire.\u003c/p\u003e\n\u003cp\u003eI stepped outside first, instructing Isaacson to wait for my signal, and crossed the street, my hands jammed deep into my pockets. A huge chestnut-colored draft horse came clopping around the corner when I reached the opposite side, pulling behind it a weathered dray wagon. The driver swung hard to the right and stopped before the side door. He did not look at me as I crossed back over. He wore a floppy hat and a black overcoat, and the hands holding the reins were very large, the knuckles swollen from more fights than anyone—including him—could remember. He was one of Warthrop’s “special men,” known for discretion, a penchant for risk, and a disdain for the law. Such unsavory characters were a necessary evil in the study of nature’s criminal side. They were Warthrop’s couriers and spies, the muscle to his mind. This one I had never met before.\u003c/p\u003e\n\u003cp\u003e“Mr. Faulk.” I greeted him cordially.\u003c/p\u003e\n\u003cp\u003e“You must be Mr. Henry, then,” he replied in a voice scraped raw by whiskey.\u003c/p\u003e\n\u003cp\u003e“There’s been a slight change in plans,” I informed him, slipping him a five-dollar note. He tucked the bill into his pocket and gave the barest of shrugs.\u003c/p\u003e\n\u003cp\u003eFive minutes later we were loaded up and making good time. I rode alongside Mr. Faulk; Isaacson sat in the back with our cargo, casting a wary eye up and down the street and clutching the side rail like a child on a Coney Island roller coaster. The temperature continued to drop, and hard pellets of ice stung our cheeks as we drew closer to the river. Ahead of us loomed the Brooklyn Bridge, its uppermost part lost in the freezing mist.\u003c/p\u003e\n\u003cp\u003eAnd in me the thing unwinding.\u003c/p\u003e\n\u003cp\u003eMr. Faulk stopped at the height of the span. I stepped down carefully. Ice crunched beneath my boots. High above the river the wind screeched, and the rain drove nearly sideways and scraped the skin like icy sandpaper. Isaacson was waiting impatiently for me at the back of the dray; for him the night had been too long already. At least it will end for you, I thought bitterly. He took one end of the first crate and I the other, and we shuffled sideways to the rail. We could not see the water below, but we could hear it and smell it and sense the drop, the empty space between our feet and its blank, black surface.\u003c/p\u003e\n\u003cp\u003e“Steady now, Isaacson,” I cautioned. “Watch your footing so you don’t go in with it! On the count of three . . .”\u003c/p\u003e\n\u003cp\u003eUp and over . . . and then down, down, and the splash was very long in coming and was very faint, a plaintive whisper, and I leaned toward him and asked, “Are you a praying man, Isaacson?” I returned to the wagon without waiting for an answer.\u003c/p\u003e\n\u003cp\u003eWe tarried for a moment at the railing after dropping the second crate over. Ice clung to our hair, our wool coats; we shimmered like angels. Now that the work was done, Isaacson relaxed a bit, and some of his former swagger returned.\u003c/p\u003e\n\u003cp\u003e“I say, old chum, this business might be pleasant if it weren’t so blasted unpleasant.”\u003c/p\u003e\n\u003cp\u003e“You didn’t answer my question,” I said softly.\u003c/p\u003e\n\u003cp\u003eHe stiffened. He seemed oddly insulted. “Of course I pray. I won’t bother asking if you do.”\u003c/p\u003e\n\u003cp\u003eHe whipped around, his good mood vanishing as quickly as it came. It took him two steps to realize Mr. Faulk was no longer hunkered in his seat.\u003c/p\u003e\n\u003cp\u003eHe stopped and turned slowly around to face me.\u003c/p\u003e\n\u003cp\u003e“Where is our driver?” he demanded, his voice rising in distress.\u003c/p\u003e\n\u003cp\u003e“Behind you,” I answered.\u003c/p\u003e\n\u003cp\u003eHe did not have the opportunity to turn round again. The unwinding thing sprang free, uncoiling with enough force to break the world in half. My fist drove into his solar plexus, the very spot where he had punched me earlier. His head dropped; his knees buckled. He was not a small person by any means, but Mr. Faulk was larger: He slung Isaacson over his shoulder with the ease of a coal heaver and carried him to the rail. He wrapped his huge paws around Isaacson’s ankle and lowered him over the side, where he dangled upside down, arms clawing uselessly at the empty air,\u003c/p\u003e\n\u003cp\u003eThe thing in the jar, scratch, scratch.\u003c/p\u003e\n\u003cp\u003e“Isaacson!” I shouted against the wind. “Isaacson, are you a praying man?”\u003c/p\u003e\n\u003cp\u003eHe yowled. I could not see his face.\u003c/p\u003e\n\u003cp\u003e“It was Dr. Walker, wasn’t it?” I shouted. “Dr. Walker who hired Maeterlinck to bring it and Dr. Walker who hired the Irishmen to steal it!”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“The truth will set you free, Isaacson!”\u003c/p\u003e\n\u003cp\u003e“I’m telling you the truth! Please, please!” He could not go on. His sobs tore into the indifferent rain.\u003c/p\u003e\n\u003cp\u003eMr. Faulk turned his head toward me slowly, his prominent brow wrinkled by a question: Let go? I shook my head.\u003c/p\u003e\n\u003cp\u003e“All right, he didn’t hire Maeterlinck, but he did the Irishmen—tell me yes, Isaacson, and we’ll pull you up!”\u003c/p\u003e\n\u003cp\u003e“He didn’t—I swear upon my mother, he didn’t! Please, please!”\u003c/p\u003e\n\u003cp\u003eI looked at Mr. Faulk. “What do you think?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “My arms are getting tired.”\u003c/p\u003e\n\u003cp\u003e“Isaacson! One more question. Answer truthfully and we’ll pull you up. Did you frig her?”\u003c/p\u003e\n\u003cp\u003e“What? What? Oh dear God!”\u003c/p\u003e\n\u003cp\u003e“Did you screw Lilly Bates?”\u003c/p\u003e\n\u003cp\u003eI waited for his answer. He was obnoxious, but he wasn’t stupid. If he had been with her and confessed to it, I might not keep my promise. If he denied it, he risked my not believing him, regardless of the veracity of his denial, which, in turn, made my dilemma no less perplexing than his.\u003c/p\u003e\n\u003cp\u003eHe unleashed an unearthly wail, twisting in the wind.\u003c/p\u003e\n\u003cp\u003e“No! No, that never happened! I swear to God, Will; I swear!”\u003c/p\u003e\n\u003cp\u003e“You swear to what?”\u003c/p\u003e\n\u003cp\u003e“To God. To God, to God, to God!”\u003c/p\u003e\n\u003cp\u003e“It isn’t God who holds you now, Samuel.” Suddenly, I was furious. “Swear to me and I’ll pull you up.”\u003c/p\u003e\n\u003cp\u003e“I swear to you, to you, I swear to you!”\u003c/p\u003e\n\u003cp\u003eBeside me Mr. Faulk was laughing softly. “He’s lying, you know.”\u003c/p\u003e\n\u003cp\u003e“No, Mr. Faulk. Only God knows that.”\u003c/p\u003e\n\u003cp\u003e“ ’Tisn’t God who matters, Mr. Henry.”\u003c/p\u003e\n\u003cp\u003e“Quite true, Mr. Faulk.”\u003c/p\u003e\n\u003cp\u003eIn the basement laboratory, when the chrysalis cracked open, I saw myself reflected in the amber eye. I was the humble conduit to the monster’s birth, the imperfect midwife, deliverer and prey.\u003c/p\u003e\n\u003cp\u003eForgive, forgive, for you are greater than I.\u003c/p\u003e\n\u003cp\u003eCanto 4\u003c/p\u003e\n\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eFull dark had fallen by the time I stepped back inside 425 Harrington Lane. I found the monstrumologist at the table, gorging himself like a man who hadn’t eaten in a week, which very well might have been the case.\u003c/p\u003e\n\u003cp\u003e“You’re not hungry,” he observed midway through the gorging.\u003c/p\u003e\n\u003cp\u003eI pulled a pewter flask from my coat pocket (the kitchen was uncomfortably cold), unscrewed the lid, and forced down a mouthful of whiskey. The monstrumologist frowned and clicked his tongue disapprovingly.\u003c/p\u003e\n\u003cp\u003e“No wonder you look terrible,” he opined, shoving a hunk of cheese into his mouth, the old rat.\u003c/p\u003e\n\u003cp\u003e“Perhaps I have been drinking too much,” I admitted. “What is your excuse?”\u003c/p\u003e\n\u003cp\u003eHe ignored the question. “You smell like smoke. And your fingernails are encrusted with dirt.”\u003c/p\u003e\n\u003cp\u003e“Ash,” I said. “Your trash barrels were overflowing.”\u003c/p\u003e\n\u003cp\u003eHis bemused expression did not change. “And the palms of your hands are rubbed raw.”\u003c/p\u003e\n\u003cp\u003e“Are you accusing me of something?”\u003c/p\u003e\n\u003cp\u003eHe smiled humorlessly. “There’re several pairs of work gloves in the shed, but you know that.”\u003c/p\u003e\n\u003cp\u003e“I do know that.”\u003c/p\u003e\n\u003cp\u003e“You must have forgotten, then.”\u003c/p\u003e\n\u003cp\u003e“My memory is not what it used to be. Just now I was trying to remember the name of that girl I hired to keep you fed and bathed and halfway human.”\u003c/p\u003e\n\u003cp\u003eWarthrop picked up a knife and sliced off a piece of apple. His hand was rock steady. He chewed very deliberately. “Beatrice,” he said. “I’ve already reminded you of that.”\u003c/p\u003e\n\u003cp\u003e“And you sacked her?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. His eyes darted about the table. “Where are the scones?”\u003c/p\u003e\n\u003cp\u003e“Or did she quit?”\u003c/p\u003e\n\u003cp\u003e“I told you I sacked her, didn’t I? Where are my scones?”\u003c/p\u003e\n\u003cp\u003e“Why did you sack her?”\u003c/p\u003e\n\u003cp\u003e“I have enough to do without some noisome busybody dogging my every step and stutter.”\u003c/p\u003e\n\u003cp\u003e“Where did she go?”\u003c/p\u003e\n\u003cp\u003e“How would I know?” His patience was wearing thin. “She didn’t say and I didn’t ask.”\u003c/p\u003e\n\u003cp\u003e“It just strikes me as odd.”\u003c/p\u003e\n\u003cp\u003e“Odd?”\u003c/p\u003e\n\u003cp\u003e“Leaving without notifying me. I was her official employer, you know. Why didn’t she tell me you sacked her and demand the balance of her pay?”\u003c/p\u003e\n\u003cp\u003e“Well, I suppose that’s something you will have to ask her.”\u003c/p\u003e\n\u003cp\u003e“That might prove difficult, since neither of us knows where she has gone.”\u003c/p\u003e\n\u003cp\u003e“Why are you so concerned about the whereabouts of some dime-a-dozen scullery maid?” he snapped, his self-control giving way.\u003c/p\u003e\n\u003cp\u003eI sipped from my flask deliberately. “I am not concerned.”\u003c/p\u003e\n\u003cp\u003e“Well. Good. You shouldn’t be. What did you think would happen, anyway? I told you I neither wanted nor needed anyone.”\u003c/p\u003e\n\u003cp\u003e“So it is my fault?”\u003c/p\u003e\n\u003cp\u003e“What? What is your fault? What do you mean?”\u003c/p\u003e\n\u003cp\u003e“The fate of Beatrice. I am to blame for forcing her upon you.”\u003c/p\u003e\n\u003cp\u003e“No. You are to blame for making the forcing of her upon me necessary.” He smiled childishly, as if he’d gotten off a cheap joke. “You’ve been holding out on me long enough, Will Henry. Where are the scones? Give them up or I shall become quite angry with you.”\u003c/p\u003e\n\u003cp\u003e“Well, we wouldn’t want that, would we?” I fetched the bag from its hiding place. He snatched it out of my hand with a giggle that made me cringe. My eyes were drawn to the basement door behind him.\u003c/p\u003e\n\u003cp\u003e“Is she the reason you put a lock upon that door?” I asked.\u003c/p\u003e\n\u003cp\u003e“Who? Beatrice? Why do you keep harping upon her?” He poured himself another cup of tea.\u003c/p\u003e\n\u003cp\u003e“I wasn’t. I was asking—” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-18.html","bookId":2549,"creation":"Oct 6, 2019 12:21:54 AM","modification":"Oct 6, 2019 12:21:54 AM"}
