{"id":111334,"no":25,"title":"Page 25","content":"\u003cp\u003eMr. Faulk was beside me. He grasped my wrist and forced my arm down. He eased the doctor’s revolver from my paralyzed fingers.\u003c/p\u003e\n\u003cp\u003e“Have to be quick,” he murmured. I nodded but didn’t move. I watched him dig the gun from the man’s jacket. Standing by the body, he pointed it at my chair and fired twice. Then he took the dead man’s hand and wrapped it around the weapon.\u003c/p\u003e\n\u003cp\u003e“Go on now, Mr. Henry,” he urged, jerking his head toward the door leading to the back hallway. The knob of the other door jiggled; a frantic pounding commenced. I crossed the room upon feet made of lead. Mr. Faulk was standing where I had stood, between the chair and the love seat, holding the revolver.\u003c/p\u003e\n\u003cp\u003e“When they take you in for questioning . . . ,” I began.\u003c/p\u003e\n\u003cp\u003eHe smiled tightly. “They might. Don’t think they will, though. Man has a right to defend himself.”\u003c/p\u003e\n\u003cp\u003e“That is the issue,” I said. The only one that mattered. Yes. The only one.\u003c/p\u003e\n\u003cp\u003eI left.\u003c/p\u003e\n\u003cp\u003eCanto 2\u003c/p\u003e\n\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eThe room was dark as pitch. I stepped over the stygian threshold and closed the door. Blind, I knew he was there; I could feel his presence.\u003c/p\u003e\n\u003cp\u003e“You might have knocked,” the doctor said from the chair by the windows. His voice, strained from his fit, floated thinly toward me, hung like a fine mist, ethereal in the dark.\u003c/p\u003e\n\u003cp\u003e“I did not wish to wake you,” I said, standing very still just inside the room.\u003c/p\u003e\n\u003cp\u003e“I might have taken you for an intruder. Shot you, though shooting you might have proved difficult, since my revolver has gone missing.”\u003c/p\u003e\n\u003cp\u003eHe turned on the light. “What are you doing?” he asked. “Why are you standing there like that?”\u003c/p\u003e\n\u003cp\u003e“There is no particular reason.”\u003c/p\u003e\n\u003cp\u003eI approached him. He regarded me with hooded eyes.\u003c/p\u003e\n\u003cp\u003e“I had the oddest dream,” he said. “I found myself descending a narrow stair. There was no rail and the steps were slick, covered in slime. I could not see the bottom and did not know my destination, though it was imperative that I reach the bottom. Time was of the essence, but I was forced to proceed slowly lest I slip and tumble all the way down. I realized where I was: Harrington Lane, and these were the steps leading down to the basement. At the thirteenth step, the stairs turned, so I could not tell how far I had left to go. Down, down, I went, until there was no light, I was descending in utter darkness, and somehow there was no turning round, no going back. It was the last passage, the final descent.”\u003c/p\u003e\n\u003cp\u003e“The final descent . . . to what? What was at the bottom?”\u003c/p\u003e\n\u003cp\u003e“I woke before I could find out.” He leaned his head back and closed his eyes. “Where is my revolver, Will?”\u003c/p\u003e\n\u003cp\u003e“Mr. Faulk has it.”\u003c/p\u003e\n\u003cp\u003e“And why does Mr. Faulk have it?”\u003c/p\u003e\n\u003cp\u003eI took a deep breath. I’d prepared a speech and now had forgotten my lines. “Dr. Warthrop, sir, it could not stand.”\u003c/p\u003e\n\u003cp\u003eHe brought his hand down hard upon the armrest, but he did not open his eyes. “You ordered him to assassinate Francesco Competello.”\u003c/p\u003e\n\u003cp\u003e“It could not stand,” I said again. I did not correct him.\u003c/p\u003e\n\u003cp\u003e“Stop that,” he snapped. “Did he succeed? Is Competello dead?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe slapped the armrest again. “You understand what this means. No, of course you do not or you wouldn’t have done it. You have inaugurated war.”\u003c/p\u003e\n\u003cp\u003e“He murdered Dr. von Helrung in cold blood,” I said. “An innocent man who had nothing to do with the deaths of his men. It could not go unanswered.”\u003c/p\u003e\n\u003cp\u003e“ ‘Unanswered’? Is that the word you used? ‘Unanswered’?” He sprang from the chair with such velocity that I flinched. “Competello was the most powerful padrone of the most vicious crime syndicate in this country—and you have murdered him! It wasn’t enough that you caused the destruction of a priceless biological specimen or the death of my dearest friend. No! Not enough for you, who have reached the bottom of those accursed stairs already . . .”\u003c/p\u003e\n\u003cp\u003e“It could not stand.”\u003c/p\u003e\n\u003cp\u003e“Stop saying that. What has happened to you? What are you, William James Henry? Where are you? I seek you, but I cannot find you. The boy I knew would never have—”\u003c/p\u003e\n\u003cp\u003e“The boy you knew—where is he? He is in Aden, Dr. Warthrop. And Socotra. And on Elizabeth Street.”\u003c/p\u003e\n\u003cp\u003eHe shook his head vehemently. “No, this is different—an entirely different animal. You had no choice in Aden: the Russians would have killed both of us if you had not acted. On Socotra, too—what choice did you have? Kearns was not letting us off that island alive. Even on Elizabeth Street, you acted in the honest—if grievously mistaken—belief that my life depended upon your actions. But this! This was an act of revenge: rash, vindictive, heartless, monstrous . . .”\u003c/p\u003e\n\u003cp\u003e“You’re wrong!” I shouted. “There is no difference! In me or what I did or what I will do. I am the same; nothing has changed. You are the heartless one. You are the monstrous one. I never asked to be this. I had no choice or say in it!”\u003c/p\u003e\n\u003cp\u003eHe grew very still. “You never asked to be what?”\u003c/p\u003e\n\u003cp\u003e“What you have made me.”\u003c/p\u003e\n\u003cp\u003eHe cocked his head at me, pinning me down with that eerie, backlit stare, the same stare with which he regarded a specimen flayed open upon his laboratory table.\u003c/p\u003e\n\u003cp\u003e“I am responsible,” he said slowly. “That is your argument.”\u003c/p\u003e\n\u003cp\u003e“More a statement of fact,” I countered.\u003c/p\u003e\n\u003cp\u003e“For all of it, that is what you are saying. The Russians. The Italians. Kearns. For every action you have taken since you came to me.”\u003c/p\u003e\n\u003cp\u003e“And for every action I have not taken, yes. Even Meister Abram. That too, Warthrop, that too.”\u003c/p\u003e\n\u003cp\u003eHe folded his arms across his chest and turned away. I went on, “There is no room for pity or love or any silly sentimental thing—I didn’t kill Competello to avenge Meister Abram. Revenge was Competello’s motive, not mine. The message contained in the box had to be answered, you know it as well as I, but Dr. Kearns was right about one thing: There is something missing in you, a blind spot that prevents you from seeing all the way down to the inescapable conclusion of your philosophy—”\u003c/p\u003e\n\u003cp\u003e“Enough!” he cried. “It is galling—it is grotesque—it is obscene!”\u003c/p\u003e\n\u003cp\u003e“It is the truth,” I said calmly. “The thing you claim to love above all else. You asked what I am, but you know already: I am the thing that waits for you at the bottom of those stairs.”\u003c/p\u003e\n\u003cp\u003eHe lunged forward, seized me by the lapels, and hauled me upright, bringing our faces inches apart. “I will give you up to them. I will tell them what you’ve done, and then you may debate with them ‘inescapable conclusions’!”\u003c/p\u003e\n\u003cp\u003eI laughed in his face. He flung me away and I staggered toward the door. I remained upright; I did not fall.\u003c/p\u003e\n\u003cp\u003e“I have made a terrible mistake,” he said. “I never should have taken you in—and in that one respect you are right: I am a hypocrite. There is no room for pity, and I took pity. No room for mercy, and I was merciful—”\u003c/p\u003e\n\u003cp\u003e“Mercy? Is that what you call it?”\u003c/p\u003e\n\u003cp\u003e“I sacrificed everything for you!” he roared. “And at every turn you have hindered me, burdened me, betrayed me! Everything was perfect, down to this latest instance, until you butted your head where it didn’t belong.”\u003c/p\u003e\n\u003cp\u003eI threw open the door. He shouted for me to close it, and I, ever the faithful servant, started to—then stopped.\u003c/p\u003e\n\u003cp\u003e“I said close that door.”\u003c/p\u003e\n\u003cp\u003e“I am leaving you, Dr. Warthrop,” I said, facing the open door and the hall outside and the elevator that would take me down a final descent and out the lobby and into a world without monstrumology and murder and the things that claw helplessly in glass jars and the inarticulate horrifying beauty that dwells in the chrysalis. I was light-headed, extremities tingling, heart buzzing with adrenaline. Freedom.\u003c/p\u003e\n\u003cp\u003eHe barked out a laugh. “And where will you go? And what will you do when you get there?”\u003c/p\u003e\n\u003cp\u003e“To the other side of the world!” I shouted. “Where I will labor to forget you and everything you represent, though it takes me a thousand years.”\u003c/p\u003e\n\u003cp\u003eMan has a right to defend himself.\u003c/p\u003e\n\u003cp\u003eThat is the issue. The only one that matters.\u003c/p\u003e\n\u003cp\u003eI left.\u003c/p\u003e\n\u003cp\u003eTWO\u003c/p\u003e\n\u003cp\u003eBy the time I reached Riverside Drive, I was running.\u003c/p\u003e\n\u003cp\u003eHow absurdly simple, I thought, and how simply absurd—the chain that bound me was made of air! The prison that housed me had walls insubstantial as water; I only needed to kick hard to break the surface and be free. Free! I was hurtling along at a hundred times the speed of light, flying to the ticket office first, unbound and unhindered, the past receding to a point infinitesimally small behind me. Free! I heard their cries from the flames no longer, nor his voice, desperate and shrill, calling me, Will Henreeeeee! and to hell with those who dance in flames and to things that swim in jars and the prison of the amber eye, the cruel mockery of monstrous things, the godlessness of nature perfected, and to him, to him, to hell with him, too: the little boy in the tattered hat who having lost God made god of the one who found him. To hell with all of it and all of him and all the blood that serving him extracted. Blood, blood, blood, rivers of blood, drenching, soaking, suffocating blood; kick, kick, kick hard and you will break the surface and breathe again.\u003c/p\u003e\n\u003cp\u003eBreathe.\u003c/p\u003e\n\u003cp\u003e“Where is she?” I demanded, breathless at the door.\u003c/p\u003e\n\u003cp\u003e“Miss Lilly? She is lying down and wishes not to—”\u003c/p\u003e\n\u003cp\u003eI shoved my way inside and raced up the stairs two at a time, ascending finally, rising at last, to burst into her room, hitting my foot hard against the side of the open steamer-trunk and toppling forward to arrive flat on my face, sprawled out upon the floor.\u003c/p\u003e\n\u003cp\u003eI heard the door close. Then her voice: “Don’t you have the nerve . . .”\u003c/p\u003e\n\u003cp\u003eI rolled onto my back and pulled the paper from my jacket pocket. “I do—and better! I’ve got this.”\u003c/p\u003e\n\u003cp\u003e“What have you got?”\u003c/p\u003e\n\u003cp\u003eI sat up, waving the slip. “My ticket on tomorrow’s passage. I am sailing with you, Miss Bates—to England!”\u003c/p\u003e\n\u003cp\u003eShe frowned. “I do not think that you are.”\u003c/p\u003e\n\u003cp\u003e“Well, I most definitely am.” I leapt up, laughing. “Steerage, though; I’m no child of Riverside Drive, after all!”\u003c/p\u003e\n\u003cp\u003eShe crossed her arms and frowned at me. “I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“I’m free, Lilly! Done with it and done with him.”\u003c/p\u003e\n\u003cp\u003eI pulled on her wrists, forcing her arms apart. She yanked free. “You’re drunk.”\u003c/p\u003e\n\u003cp\u003e“I am, but not with drink. I don’t know why I never saw it before—but you did, from the beginning you saw. My doctor, you called him. I wasn’t his; he was mine. And what belongs to me I may keep or discard as I wish. As I wish!”\u003c/p\u003e\n\u003cp\u003e“But why now? What has he done this time?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “It isn’t about him.” I reached for her again, and she tried to pull away again, but I was too quick: The hunter snared his prey. I pulled her close and said, “I love you, Lilly.”\u003c/p\u003e\n\u003cp\u003eShe turned her head away. “No.”\u003c/p\u003e\n\u003cp\u003e“I do. I love you. I have loved you since I was twelve years old. And I would do anything for you. Name it. Name it and it’s yours.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-25.html","bookId":2549,"creation":"Oct 6, 2019 12:21:54 AM","modification":"Oct 6, 2019 12:21:54 AM"}
