{"id":111319,"no":9,"title":"Page 9","content":"\u003cp\u003eTHREE\u003c/p\u003e\n\u003cp\u003eHe must have heard them that night: the howls and shrieks of the boy’s soul tearing in half, the cry of damnation’s desire, the rage against the beast that had refused to consume him. The beast that had left behind the black, smoldering casings of his parents—for what it did not use for fuel, it shat out as dust and ash. He must have heard. Every board and window and shingle and nail must have rattled with the force of his anger and grief.\u003c/p\u003e\n\u003cp\u003eThe man must have heard—and he did nothing. In fact, in those early days, the more I cried—always alone in my little attic room—the harsher, colder, and more merciless he became. Perhaps he told himself it was for my own good, and after all this was at a time when children were not coddled. Perhaps his harshness was meant to make me harsh, his coldness to make me cold, his mercilessness to make me merciless. It was the best and only answer to the brutal question as he understood it:\u003c/p\u003e\n\u003cp\u003eWhat sort of god is this?\u003c/p\u003e\n\u003cp\u003eBut now I don’t think he was being harsh or cold or merciless. He was not the harsh, cold, merciless one.\u003c/p\u003e\n\u003cp\u003eNow I think he heard my screams and remembered another boy, a boy from long ago, consigned to that same attic space away from the beating heart of the house, the lonely boy whose mother had died and whose father blamed him for it. The terrified boy who watched his father fade from him while remaining all the while in his sight, a majestic ship disappearing over the endless horizon, the boy alone and sick and sick in his loneliness. The kind of loneliness you never completely leave behind, no matter how crowded your life becomes. He was helpless to save that boy; he was helpless to save me. The distance was too great—there were not enough years in a lifetime to climb that eight-foot ladder and say to the boy, Be still, be still. I know your pain.\u003c/p\u003e\n\u003cp\u003eThese are the secrets I have kept.\u003c/p\u003e\n\u003cp\u003eThis is the trust I never betrayed.\u003c/p\u003e\n\u003cp\u003eCanto 5\u003c/p\u003e\n\u003cp\u003eONE\u003c/p\u003e\n\u003cp\u003eI knelt beside the dead man in the Monstrumarium, beside the opened door to the Locked Room.\u003c/p\u003e\n\u003cp\u003eThe back of his skull had been blasted open, a single shot at close range. Grimacing with the effort—he was not a small man—I rolled him onto his back. The bullet had passed through; he had no face. I patted his pockets. A pearl-handled switchblade knife. A pouch of tobacco and a weathered pipe. A pair of brass knuckles. His coat was thin, the elbows worn threadbare. His pants were tied with a bit of frayed rope. His hands were heavily calloused, his knuckles scraped raw. In the puddle where his head had been lay his teeth, blown free from his mandible by the impact of the round.\u003c/p\u003e\n\u003cp\u003eWaste, Will Henry, waste.\u003c/p\u003e\n\u003cp\u003eI dropped the brass knuckles and knife into my pocket and crouched close to the floor, and the light from the gas jets flung my shadow over the body.\u003c/p\u003e\n\u003cp\u003eWhen presented with a problem, look for the simplest solution first; that is always the route nature takes.\u003c/p\u003e\n\u003cp\u003eHe had not expected the blow, obviously. His back had been turned. His killer had crept up unawares or betrayed him—either a competitor or a mutinous cohort, or perhaps more than one. The find was, as Maeterlinck said, a prize for which wealthy men might sacrifice their fortunes and desperate men their very souls.\u003c/p\u003e\n\u003cp\u003eTWO\u003c/p\u003e\n\u003cp\u003eVon Helrung understood that too.\u003c/p\u003e\n\u003cp\u003e“Congratulations are in order, of course, mein guter Freund,” he gruffed, clipping off the tip of his Havana cigar. It was the evening before his niece and I would flee the dance. “Any other natural philosopher, who presented a living specimen of T. cerrejonensis, even if he was a distinguished member of our Society, would be tossed out of the assembly as a charlatan and profiteer.”\u003c/p\u003e\n\u003cp\u003e“How fortunate, then, that I am not any other—or either,” Warthrop replied dryly. We were lounging in the well-appointed sitting room of the Zeno Club, where gentlemen of like-minded philosophical outlooks gathered to share a glass of port over quiet conversation or simply to enjoy the languid atmosphere of a vanishing age: the age of reasoned discourse by serious men. We were but two decades away from a worldwide conflagration that would claim thirty-seven million lives. The fire was warm, the chairs comfortable, the carpet lush, the waiters obsequiously attentive. Warthrop had his tea and scones, von Helrung his sherry and cigar, and I my Coca-Cola and cookies. It was like the old days, except I was no longer a boy and von Helrung no longer old, but tending toward ancient. Hair thinner, face paler, stubby fingers not quite as steady. But his eyes still gleamed bird bright, and he had lost none of his acumen—or his humanity. The same could not be said of me.\u003c/p\u003e\n\u003cp\u003eHe’s going to die soon, I decided as I sat silently listening to their conversation. He won’t live out the year. When he spoke or took the smallest breath, you could hear the death rattle deep in his barrel chest. I could feel it when he wrapped his short arms around my waist and pressed his snowy white mane against me: the life force fading, the heat leaching through his vest like the earth’s heat fading into the desert sunset.\u003c/p\u003e\n\u003cp\u003e“Dear Will, how you have grown, and in the passing of but a year!” he exclaimed when he saw me. He looked up into my face intently. “Pellinore must have finally decided to feed you!” He chuckled at his own joke, and then grew very serious. “But what is it, Will? I can see that your heart is troubled. . . .”\u003c/p\u003e\n\u003cp\u003e“There is nothing troubling me, Meister Abram.”\u003c/p\u003e\n\u003cp\u003e“No?” He was frowning. Something in my expression—or perhaps lack thereof—seemed to bother him.\u003c/p\u003e\n\u003cp\u003e“No, of course not,” snapped the monstrumologist. “Why should anything be troubling Will Henry?”\u003c/p\u003e\n\u003cp\u003e“I worry, though,” the old Austrian said now, after rolling the tip of the cigar upon his flattened tongue. “On the matter of security . . .”\u003c/p\u003e\n\u003cp\u003e“I have placed it in the Locked Room,” Warthrop answered. He sipped his tea. “I suppose we could station an armed guard at the door.”\u003c/p\u003e\n\u003cp\u003eVon Helrung lit his cigar and waved away the plume of bluish smoke. “I speak of your presentation to the colloquium. The less who know of the find for now, the better. A private gathering of our most trusted colleagues.”\u003c/p\u003e\n\u003cp\u003eWarthrop stared at him from over his cup. “The general assembly is closed to the public, Meister Abram.”\u003c/p\u003e\n\u003cp\u003e“Pellinore, you know there is none dearer to me than you, unless it is young Will here, such a fine young man, such a tribute to your, may I say, paternal guidance and affection . . .”\u003c/p\u003e\n\u003cp\u003eI nearly choked on my cola. Paternal guidance and affection!\u003c/p\u003e\n\u003cp\u003e“. . . so there is no one who understands better your desire to place your name in the firmament of scientific achievement. . . .”\u003c/p\u003e\n\u003cp\u003e“I do not labor—nor have I suffered—to advance my reputation above the advancement of human knowledge, von Helrung,” the doctor said with a perfectly straight face. “But I do understand your concern. If news of a living T. cerrejonensis reaches certain quarters, we might expect a bit of trouble.”\u003c/p\u003e\n\u003cp\u003eVon Helrung nodded. He seemed relieved that my master understood the central dilemma. The most astounding discovery in a generation, one that held theory-altering implications not just for aberrant biology but for all the natural sciences, including key tenets of evolution—and it must be kept secret!\u003c/p\u003e\n\u003cp\u003e“Ach, if only this broker who brought it to you had revealed the name of his client!” cried von Helrung. “For this mysterious personage knows you, knows as well as Maeterlinck that the prize now rests in the possession of a certain Pellinore Warthrop of 425 Harrington Lane! I do not exaggerate, mein Freund. You have been in no greater peril in all your dangerous career. This, your greatest prize, may also be your undoing.”\u003c/p\u003e\n\u003cp\u003eWarthrop stiffened. “My ‘undoing,’ as you call it, must come sometime, von Helrung. Better that it comes at the height of my career than in the last bitter dregs of it.”\u003c/p\u003e\n\u003cp\u003eVon Helrung puffed on his cigar and watched his former pupil down the final drops of his tea.\u003c/p\u003e\n\u003cp\u003e“It may yet,” he murmured. “It may yet.”\u003c/p\u003e\n\u003cp\u003eTHREE\u003c/p\u003e\n\u003cp\u003eThe last bitter dregs of it.\u003c/p\u003e\n\u003cp\u003eNineteen years after uttering those words, he was sitting at the foot of his bed wrapped in a towel. I could count every rib in his bony chest, and with his wet hair and haggard features he reminded me, for some reason, of one of Macbeth’s witches. Fair is foul and foul is fair!\u003c/p\u003e\n\u003cp\u003e“Did you make tea?” he asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI stepped around to his dresser in search of some clean underwear.\u003c/p\u003e\n\u003cp\u003e“Really? I thought surely you must be, by all the banging and clattering down there. ‘Dear Will is making me a nice pot of tea,’ I thought.”\u003c/p\u003e\n\u003cp\u003e“Well, I wasn’t. I was looking to see if you had a crumb of food in the place. Which you don’t. What are you living on, Warthrop? Old carcasses from your collection?”\u003c/p\u003e\n\u003cp\u003eI tossed a clean pair of underwear—the drawer was full of them; he probably hadn’t changed his shorts in a month—at him. They landed on his head and he giggled like a child.\u003c/p\u003e\n\u003cp\u003e“You know I have no appetite when I’m working,” he said. “Now, a good, strong cup of some Darjeeling, that is something altogether different! I never could replicate your cup, Will, try as I might. Never tasted the same after you left.”\u003c/p\u003e\n\u003cp\u003eI went to the closet. Tossed a pair of trousers, a shirt, and the cleanest vest I could find onto the bed.\u003c/p\u003e\n\u003cp\u003e“I’ll make you a pot when I get back.”\u003c/p\u003e\n\u003cp\u003e“Get back? But you only just got here!”\u003c/p\u003e\n\u003cp\u003e“From the market, Warthrop. It will be closing soon.”\u003c/p\u003e\n\u003cp\u003eHe nodded. He was absently turning the underwear in his hands. “I don’t suppose you’d mind picking up a scone or two. . . .”\u003c/p\u003e\n\u003cp\u003e“I will get you some scones.”\u003c/p\u003e\n\u003cp\u003eI sat in the chair. For some reason I was out of breath.\u003c/p\u003e\n\u003cp\u003e“They never tasted the same either,” he said. “One wonders how that could be.”\u003c/p\u003e\n\u003cp\u003e“Stop that,” I said sharply. “Don’t be childish.”\u003c/p\u003e\n\u003cp\u003eI looked away. The sight of him wrapped in the towel, thin hair dripping wet, the hunched shoulders, the hollow chest, the rail-thin arms and spidery hands—it sickened me. It made me want to hit him.\u003c/p\u003e\n\u003cp\u003e“Are you going to tell me?” I asked.\u003c/p\u003e\n\u003cp\u003e“Tell you what?”\u003c/p\u003e\n\u003cp\u003e“This thing you’re working on, this thing that’s slowly killing you, this thing that will kill you, I suppose, if I let it.”\u003c/p\u003e\n\u003cp\u003eHis dark eyes glittered with that familiar infernal glow. “I believe I am in charge of my own death.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t appear that way. In fact, it appears that it is in total charge of you.”\u003c/p\u003e\n\u003cp\u003eThe fire went out. He dropped his head. “I must die sometime,” he whispered.\u003c/p\u003e\n\u003cp\u003eIt was too much. I leapt from the chair with a guttural roar and bore down upon him. He shrank at my advance, flinched as if expecting a blow.\u003c/p\u003e\n\u003cp\u003e“God damn you anyway, Pellinore Warthrop! The days of your puerile attempts to manipulate and control me are over. So save the melodramatic sniveling for someone else.”\u003c/p\u003e\n\u003cp\u003eHis shoulders heaved. “There is no one else.”\u003c/p\u003e\n\u003cp\u003e“That is your choice, not mine.”\u003c/p\u003e\n\u003cp\u003e“You chose to leave me!” he shouted up into my face.\u003c/p\u003e\n\u003cp\u003e“You gave me no choice!” I turned away. “You disgust me. ‘Always tell the truth, Will Henry, all the truth in all things at all times.’ From you, the most intellectually dishonest man I have ever known!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-final-descent-the-monstrumologist-4/page-9.html","bookId":2549,"creation":"Oct 6, 2019 12:21:54 AM","modification":"Oct 6, 2019 12:21:54 AM"}
