{"id":18116,"no":109,"title":"The Dog and the Physician","content":"\u003cp\u003eA Dog that had seen a Physician attending the burial of a wealthy patient, said: “When do you expect to dig it up?”\u003c/p\u003e \n\u003cp\u003e“Why should I dig it up?” the Physician asked.\u003c/p\u003e \n\u003cp\u003e“When I bury a bone,” said the Dog, “it is with an intention to uncover it later and pick it.”\u003c/p\u003e \n\u003cp\u003e“The bones that I bury,” said the Physician, “are those that I can no longer pick.”\u003c/p\u003e \n\u003cp\u003eThe Party Manager and the Gentleman\u003c/p\u003e \n\u003cp\u003eA Party Manager said to a Gentleman whom he saw minding his own business:\u003c/p\u003e \n\u003cp\u003e“How much will you pay for a nomination to office?”\u003c/p\u003e \n\u003cp\u003e“Nothing,” the Gentleman replied.\u003c/p\u003e \n\u003cp\u003e“But you will contribute something to the campaign fund to assist in your election, will you not?” asked the Party Manager, winking.\u003c/p\u003e \n\u003cp\u003e“Oh, no,” said the Gentleman, gravely. “If the people wish me to work for them, they must hire me without solicitation. I am very comfortable without office.”\u003c/p\u003e \n\u003cp\u003e“But,” urged the Party Manager, “an election is a thing to be desired. It is a high honour to be a servant of the people.”\u003c/p\u003e \n\u003cp\u003e“If servitude is a high honour,” the Gentleman said, “it would be indecent for me to seek it; and if obtained by my own exertion it would be no honour.”\u003c/p\u003e \n\u003cp\u003e“Well,” persisted the Party Manager, “you will at least, I hope, indorse the party platform.”\u003c/p\u003e \n\u003cp\u003eThe Gentleman replied: “It is improbable that its authors have accurately expressed my views without consulting me; and if I indorsed their work without approving it I should be a liar.”\u003c/p\u003e \n\u003cp\u003e“You are a detestable hypocrite and an idiot!” shouted the Party Manager.\u003c/p\u003e \n\u003cp\u003e“Even your good opinion of my fitness,” replied the Gentleman, “shall not persuade me.”\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/864/921.html","bookId":678,"creation":"Aug 2, 2019 9:29:51 AM","modification":"Aug 2, 2019 9:29:51 AM"}
