{"id":18169,"no":162,"title":"The Fabulist and the Animals","content":"\u003cp\u003eA Wise and illustrious Writer of Fables was visiting a travelling menagerie with a view to collecting literary materials. As he was passing near the Elephant, that animal said:\u003c/p\u003e \n\u003cp\u003e“How sad that so justly famous a satirist should mar his work by ridicule of people with long noses — who are the salt of the earth!”\u003c/p\u003e \n\u003cp\u003eThe Kangaroo said:\u003c/p\u003e \n\u003cp\u003e“I do so enjoy that great man’s censure of the ridiculous — particularly his attacks on the Proboscidae; but, alas! he has no reverence for the Marsupials, and laughs at our way of carrying our young in a pouch.”\u003c/p\u003e \n\u003cp\u003eThe Camel said:\u003c/p\u003e \n\u003cp\u003e“If he would only respect the sacred Hump, he would be faultless. As it is, I cannot permit his fables to be read in the presence of my family.”\u003c/p\u003e \n\u003cp\u003eThe Ostrich, seeing his approach, thrust her head in the straw, saying:\u003c/p\u003e \n\u003cp\u003e“If I do not conceal myself, he may be reminded to write something disagreeable about my lack of a crest or my appetite for scrap-iron; and although he is inexpressibly brilliant when he devotes himself to censure of folly and greed, his dulness is matchless when he transcends the limits of legitimate comment.”\u003c/p\u003e \n\u003cp\u003e“That,” said the Buzzard to his mate, “is the distinguished author of that glorious fable, ‘The Ostrich and the Keg of Raw Nails.’ I regret to add, that he wrote, also, ‘The Buzzard’s Feast,’ in which a carrion diet is contumeliously disparaged. A carrion diet is the foundation of sound health. If nothing else but corpses were eaten, death would be unknown.”\u003c/p\u003e \n\u003cp\u003eSeeing an attendant approaching, the wise and illustrious Writer of Fables passed out of the tent and mingled with the crowd. It was afterward discovered that he had crept in under the canvas without paying.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/864/1004.html","bookId":678,"creation":"Aug 2, 2019 9:32:12 AM","modification":"Aug 2, 2019 9:32:12 AM"}
