{"id":18010,"no":3,"title":"The Ingenious Patriot","content":"\u003cp\u003eHaving obtained an audience of the King an Ingenious Patriot pulled a paper from his pocket, saying:\u003c/p\u003e \n\u003cp\u003e“May it please your Majesty, I have here a formula for constructing armour-plating which no gun can pierce. If these plates are adopted in the Royal Navy our warships will be invulnerable, and therefore invincible. Here, also, are reports of your Majesty’s Ministers, attesting the value of the invention. I will part with my right in it for a million tumtums.”\u003c/p\u003e \n\u003cp\u003eAfter examining the papers, the King put them away and promised him an order on the Lord High Treasurer of the Extortion Department for a million tumtums.\u003c/p\u003e \n\u003cp\u003e“And here,” said the Ingenious Patriot, pulling another paper from another pocket, “are the working plans of a gun that I have invented, which will pierce that armour. Your Majesty’s Royal Brother, the Emperor of Bang, is anxious to purchase it, but loyalty to your Majesty’s throne and person constrains me to offer it first to your Majesty. The price is one million tumtums.”\u003c/p\u003e \n\u003cp\u003eHaving received the promise of another check, he thrust his hand into still another pocket, remarking:\u003c/p\u003e \n\u003cp\u003e“The price of the irresistible gun would have been much greater, your Majesty, but for the fact that its missiles can be so effectively averted by my peculiar method of treating the armour plates with a new —”\u003c/p\u003e \n\u003cp\u003eThe King signed to the Great Head Factotum to approach.\u003c/p\u003e \n\u003cp\u003e“Search this man,” he said, “and report how many pockets he has.”\u003c/p\u003e \n\u003cp\u003e“Forty-three, Sire,” said the Great Head Factotum, completing the scrutiny.\u003c/p\u003e \n\u003cp\u003e“May it please your Majesty,” cried the Ingenious Patriot, in terror, “one of them contains tobacco.”\u003c/p\u003e \n\u003cp\u003e“Hold him up by the ankles and shake him,” said the King; “then give him a check for forty-two million tumtums and put him to death. Let a decree issue declaring ingenuity a capital offence.”\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/864/777.html","bookId":678,"creation":"Aug 2, 2019 9:24:23 AM","modification":"Aug 2, 2019 9:24:23 AM"}
