{"id":9100,"no":25,"title":"Chapter II Honey-Taking, and Afterwards","content":"Saturday evening saw Dick Dewy journeying on foot to Yalbury Wood, according to the arrangement with Fancy.\n\u003cbr\u003e \n\u003cbr\u003e The landscape being concave, at the going down of the sun everything suddenly assumed a uniform robe of shade. The evening advanced from sunset to dusk long before Dick’s arrival, and his progress during the latter portion of his walk through the trees was indicated by the flutter of terrified birds that had been roosting over the path. And in crossing the glades, masses of hot dry air, that had been formed on the hills during the day, greeted his cheeks alternately with clouds of damp night air from the valleys. He reached the keeper-steward’s house, where the grass-plot and the garden in front appeared light and pale against the unbroken darkness of the grove from which he had emerged, and paused at the garden gate.\n\u003cbr\u003e \n\u003cbr\u003e He had scarcely been there a minute when he beheld a sort of procession advancing from the door in his front. It consisted first of Enoch the trapper, carrying a spade on his shoulder and a lantern dangling in his hand; then came Mrs. Day, the light of the lantern revealing that she bore in her arms curious objects about a foot long, in the form of Latin crosses (made of lath and brown paper dipped in brimstone — called matches by bee-masters); next came Miss Day, with a shawl thrown over her head; and behind all, in the gloom, Mr. Frederic Shiner.\n\u003cbr\u003e \n\u003cbr\u003e Dick, in his consternation at finding Shiner present, was at a loss how to proceed, and retired under a tree to collect his thoughts.\n\u003cbr\u003e \n\u003cbr\u003e “Here I be, Enoch,” said a voice; and the procession advancing farther, the lantern’s rays illuminated the figure of Geoffrey, awaiting their arrival beside a row of bee-hives, in front of the path. Taking the spade from Enoch, he proceeded to dig two holes in the earth beside the hives, the others standing round in a circle, except Mrs. Day, who deposited her matches in the fork of an apple-tree and returned to the house. The party remaining were now lit up in front by the lantern in their midst, their shadows radiating each way upon the garden-plot like the spokes of a wheel. An apparent embarrassment of Fancy at the presence of Shiner caused a silence in the assembly, during which the preliminaries of execution were arranged, the matches fixed, the stake kindled, the two hives placed over the two holes, and the earth stopped round the edges. Geoffrey then stood erect, and rather more, to straighten his backbone after the digging.\n\u003cbr\u003e \n\u003cbr\u003e “They were a peculiar family,” said Mr. Shiner, regarding the hives reflectively.\n\u003cbr\u003e \n\u003cbr\u003e Geoffrey nodded.\n\u003cbr\u003e \n\u003cbr\u003e “Those holes will be the grave of thousands!” said Fancy. “I think ’tis rather a cruel thing to do.”\n\u003cbr\u003e \n\u003cbr\u003e Her father shook his head. “No,” he said, tapping the hives to shake the dead bees from their cells, “if you suffocate ’em this way, they only die once: if you fumigate ’em in the new way, they come to life again, and die o’ starvation; so the pangs o’ death be twice upon ’em.”\n\u003cbr\u003e \n\u003cbr\u003e “I incline to Fancy’s notion,” said Mr. Shiner, laughing lightly.\n\u003cbr\u003e \n\u003cbr\u003e “The proper way to take honey, so that the bees be neither starved nor murdered, is a puzzling matter,” said the keeper steadily.\n\u003cbr\u003e \n\u003cbr\u003e “I should like never to take it from them,” said Fancy.\n\u003cbr\u003e \n\u003cbr\u003e “But ’tis the money,” said Enoch musingly. “For without money man is a shadder!”\n\u003cbr\u003e \n\u003cbr\u003e The lantern-light had disturbed many bees that had escaped from hives destroyed some days earlier, and, demoralized by affliction, were now getting a living as marauders about the doors of other hives. Several flew round the head and neck of Geoffrey; then darted upon him with an irritated bizz.\n\u003cbr\u003e \n\u003cbr\u003e Enoch threw down the lantern, and ran off and pushed his head into a currant bush; Fancy scudded up the path; and Mr. Shiner floundered away helter-skelter among the cabbages. Geoffrey stood his ground, unmoved and firm as a rock. Fancy was the first to return, followed by Enoch picking up the lantern. Mr. Shiner still remained invisible.\n\u003cbr\u003e \n\u003cbr\u003e “Have the craters stung ye?” said Enoch to Geoffrey.\n\u003cbr\u003e \n\u003cbr\u003e “No, not much — on’y a little here and there,” he said with leisurely solemnity, shaking one bee out of his shirt sleeve, pulling another from among his hair, and two or three more from his neck. The rest looked on during this proceeding with a complacent sense of being out of it — much as a European nation in a state of internal commotion is watched by its neighbours.\n\u003cbr\u003e \n\u003cbr\u003e “Are those all of them, father?” said Fancy, when Geoffrey had pulled away five.\n\u003cbr\u003e \n\u003cbr\u003e “Almost all — though I feel one or two more sticking into my shoulder and side. Ah! there’s another just begun again upon my backbone. You lively young mortals, how did you get inside there? However, they can’t sting me many times more, poor things, for they must be getting weak. They mid as well stay in me till bedtime now, I suppose.”\n\u003cbr\u003e \n\u003cbr\u003e As he himself was the only person affected by this arrangement, it seemed satisfactory enough; and after a noise of feet kicking against cabbages in a blundering progress among them, the voice of Mr. Shiner was heard from the darkness in that direction.\n\u003cbr\u003e \n\u003cbr\u003e “Is all quite safe again?”\n\u003cbr\u003e \n\u003cbr\u003e No answer being returned to this query, he apparently assumed that he might venture forth, and gradually drew near the lantern again. The hives were now removed from their position over the holes, one being handed to Enoch to carry indoors, and one being taken by Geoffrey himself.\n\u003cbr\u003e \n\u003cbr\u003e “Bring hither the lantern, Fancy: the spade can bide.”\n\u003cbr\u003e \n\u003cbr\u003e Geoffrey and Enoch then went towards the house, leaving Shiner and Fancy standing side by side on the garden-plot.\n\u003cbr\u003e \n\u003cbr\u003e “Allow me,” said Shiner, stooping for the lantern and seizing it at the same time with Fancy.\n\u003cbr\u003e \n\u003cbr\u003e “I can carry it,” said Fancy, religiously repressing all inclination to trifle. She had thoroughly considered that subject after the tearful explanation of the bird-catching adventure to Dick, and had decided that it would be dishonest in her, as an engaged young woman, to trifle with men’s eyes and hands any more. Finding that Shiner still retained his hold of the lantern, she relinquished it, and he, having found her retaining it, also let go. The lantern fell, and was extinguished. Fancy moved on.\n\u003cbr\u003e \n\u003cbr\u003e “Where is the path?” said Mr. Shiner.\n\u003cbr\u003e \n\u003cbr\u003e “Here,” said Fancy. “Your eyes will get used to the dark in a minute or two.”\n\u003cbr\u003e \n\u003cbr\u003e “Till that time will ye lend me your hand?” Fancy gave him the extreme tips of her fingers, and they stepped from the plot into the path.\n\u003cbr\u003e \n\u003cbr\u003e “You don’t accept attentions very freely.”\n\u003cbr\u003e \n\u003cbr\u003e “It depends upon who offers them.”\n\u003cbr\u003e \n\u003cbr\u003e “A fellow like me, for instance.” A dead silence.\n\u003cbr\u003e \n\u003cbr\u003e “Well, what do you say, Missie?”\n\u003cbr\u003e \n\u003cbr\u003e “It then depends upon how they are offered.”\n\u003cbr\u003e \n\u003cbr\u003e “Not wildly, and yet not careless-like; not purposely, and yet not by chance; not too quick nor yet too slow.”\n\u003cbr\u003e \n\u003cbr\u003e “How then?” said Fancy.\n\u003cbr\u003e \n\u003cbr\u003e “Coolly and practically,” he said. “How would that kind of love be taken?”\n\u003cbr\u003e \n\u003cbr\u003e “Not anxiously, and yet not indifferently; neither blushing nor pale; nor religiously nor yet quite wickedly.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, how?”\n\u003cbr\u003e \n\u003cbr\u003e “Not at all.”\n\u003cbr\u003e * * *\n\u003cbr\u003e \n\u003cbr\u003e Geoffrey Day’s storehouse at the back of his dwelling was hung with bunches of dried horehound, mint, and sage; brown-paper bags of thyme and lavender; and long ropes of clean onions. On shelves were spread large red and yellow apples, and choice selections of early potatoes for seed next year; — vulgar crowds of commoner kind lying beneath in heaps. A few empty beehives were clustered around a nail in one corner, under which stood two or three barrels of new cider of the first crop, each bubbling and squirting forth from the yet open bunghole.\n\u003cbr\u003e \n\u003cbr\u003e Fancy was now kneeling beside the two inverted hives, one of which rested against her lap, for convenience in operating upon the contents. She thrust her sleeves above her elbows, and inserted her small pink hand edgewise between each white lobe of honeycomb, performing the act so adroitly and gently as not to unseal a single cell. Then cracking the piece off at the crown of the hive by a slight backward and forward movement, she lifted each portion as it was loosened into a large blue platter, placed on a bench at her side.\n\u003cbr\u003e \n\u003cbr\u003e “Bother these little mortals!” said Geoffrey, who was holding the light to her, and giving his back an uneasy twist. “I really think I may as well go indoors and take ’em out, poor things! for they won’t let me alone. There’s two a stinging wi’ all their might now. I’m sure I wonder their strength can last so long.”\n\u003cbr\u003e \n\u003cbr\u003e “All right, friend; I’ll hold the candle whilst you are gone,” said Mr. Shiner, leisurely taking the light, and allowing Geoffrey to depart, which he did with his usual long paces.\n\u003cbr\u003e \n\u003cbr\u003e He could hardly have gone round to the house-door when other footsteps were heard approaching the outbuilding; the tip of a finger appeared in the hole through which the wood latch was lifted, and Dick Dewy came in, having been all this time walking up and down the wood, vainly waiting for Shiner’s departure.\n\u003cbr\u003e \n\u003cbr\u003e Fancy looked up and welcomed him rather confusedly. Shiner grasped the candlestick more firmly, and, lest doing this in silence should not imply to Dick with sufficient force that he was quite at home and cool, he sang invincibly —\n\u003cbr\u003e \n\u003cbr\u003e “‘King Arthur he had three sons.’”\n\u003cbr\u003e \n\u003cbr\u003e “Father here?” said Dick.\n\u003cbr\u003e \n\u003cbr\u003e “Indoors, I think,” said Fancy, looking pleasantly at him.\n\u003cbr\u003e \n\u003cbr\u003e Dick surveyed the scene, and did not seem inclined to hurry off just at that moment. Shiner went on singing —\n\u003cbr\u003e \n\u003cbr\u003e “‘The miller was drown’d in his pond,\n\u003cbr\u003e \n\u003cbr\u003e The weaver was hung in his yarn,\n\u003cbr\u003e \n\u003cbr\u003e And the d —— ran away with the little tail-or,\n\u003cbr\u003e \n\u003cbr\u003e With the broadcloth under his arm.’”\n\u003cbr\u003e \n\u003cbr\u003e “That’s a terrible crippled rhyme, if that’s your rhyme!” said Dick, with a grain of superciliousness in his tone.\n\u003cbr\u003e \n\u003cbr\u003e “It’s no use your complaining to me about the rhyme!” said Mr. Shiner. “You must go to the man that made it.”\n\u003cbr\u003e \n\u003cbr\u003e Fancy by this time had acquired confidence.\n\u003cbr\u003e \n\u003cbr\u003e “Taste a bit, Mr. Dewy,” she said, holding up to him a small circular piece of honeycomb that had been the last in the row of layers, remaining still on her knees and flinging back her head to look in his face; “and then I’ll taste a bit too.”\n\u003cbr\u003e \n\u003cbr\u003e “And I, if you please,” said Mr. Shiner. Nevertheless the farmer looked superior, as if he could even now hardly join the trifling from very importance of station; and after receiving the honeycomb from Fancy, he turned it over in his hand till the cells began to be crushed, and the liquid honey ran down from his fingers in a thin string.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly a faint cry from Fancy caused them to gaze at her.\n\u003cbr\u003e \n\u003cbr\u003e “What’s the matter, dear?” said Dick.\n\u003cbr\u003e \n\u003cbr\u003e “It is nothing, but O-o! a bee has stung the inside of my lip! He was in one of the cells I was eating!”\n\u003cbr\u003e \n\u003cbr\u003e “We must keep down the swelling, or it may be serious!” said Shiner, stepping up and kneeling beside her. “Let me see it.”\n\u003cbr\u003e \n\u003cbr\u003e “No, no!”\n\u003cbr\u003e \n\u003cbr\u003e “Just let me see it,” said Dick, kneeling on the other side: and after some hesitation she pressed down her lip with one finger to show the place. “O, I hope ’twill soon be better! I don’t mind a sting in ordinary places, but it is so bad upon your lip,” she added with tears in her eyes, and writhing a little from the pain.\n\u003cbr\u003e \n\u003cbr\u003e Shiner held the light above his head and pushed his face close to Fancy’s, as if the lip had been shown exclusively to himself, upon which Dick pushed closer, as if Shiner were not there at all.\n\u003cbr\u003e \n\u003cbr\u003e “It is swelling,” said Dick to her right aspect.\n\u003cbr\u003e \n\u003cbr\u003e “It isn’t swelling,” said Shiner to her left aspect.\n\u003cbr\u003e \n\u003cbr\u003e “Is it dangerous on the lip?” cried Fancy. “I know it is dangerous on the tongue.”\n\u003cbr\u003e \n\u003cbr\u003e “O no, not dangerous!” answered Dick.\n\u003cbr\u003e \n\u003cbr\u003e “Rather dangerous,” had answered Shiner simultaneously.\n\u003cbr\u003e \n\u003cbr\u003e “I must try to bear it!” said Fancy, turning again to the hives.\n\u003cbr\u003e \n\u003cbr\u003e “Hartshorn-and-oil is a good thing to put to it, Miss Day,” said Shiner with great concern.\n\u003cbr\u003e \n\u003cbr\u003e “Sweet-oil-and-hartshorn I’ve found to be a good thing to cure stings, Miss Day,” said Dick with greater concern.\n\u003cbr\u003e \n\u003cbr\u003e “We have some mixed indoors; would you kindly run and get it for me?” she said.\n\u003cbr\u003e \n\u003cbr\u003e Now, whether by inadvertence, or whether by mischievous intention, the individuality of the you was so carelessly denoted that both Dick and Shiner sprang to their feet like twin acrobats, and marched abreast to the door; both seized the latch and lifted it, and continued marching on, shoulder to shoulder, in the same manner to the dwelling-house. Not only so, but entering the room, they marched as before straight up to Mrs. Day’s chair, letting the door in the oak partition slam so forcibly, that the rows of pewter on the dresser rang like a bell.\n\u003cbr\u003e \n\u003cbr\u003e “Mrs. Day, Fancy has stung her lip, and wants you to give me the hartshorn, please,” said Mr. Shiner, very close to Mrs. Day’s face.\n\u003cbr\u003e \n\u003cbr\u003e “O, Mrs. Day, Fancy has asked me to bring out the hartshorn, please, because she has stung her lip!” said Dick, a little closer to Mrs. Day’s face.\n\u003cbr\u003e \n\u003cbr\u003e “Well, men alive! that’s no reason why you should eat me, I suppose!” said Mrs. Day, drawing back.\n\u003cbr\u003e \n\u003cbr\u003e She searched in the corner-cupboard, produced the bottle, and began to dust the cork, the rim, and every other part very carefully, Dick’s hand and Shiner’s hand waiting side by side.\n\u003cbr\u003e \n\u003cbr\u003e “Which is head man?” said Mrs. Day. “Now, don’t come mumbudgeting so close again. Which is head man?”\n\u003cbr\u003e \n\u003cbr\u003e Neither spoke; and the bottle was inclined towards Shiner. Shiner, as a high-class man, would not look in the least triumphant, and turned to go off with it as Geoffrey came downstairs after the search in his linen for concealed bees.\n\u003cbr\u003e \n\u003cbr\u003e “O— that you, Master Dewy?”\n\u003cbr\u003e \n\u003cbr\u003e Dick assured the keeper that it was; and the young man then determined upon a bold stroke for the attainment of his end, forgetting that the worst of bold strokes is the disastrous consequences they involve if they fail.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve come on purpose to speak to you very particular, Mr. Day,” he said, with a crushing emphasis intended for the ears of Mr. Shiner, who was vanishing round the door-post at that moment.\n\u003cbr\u003e \n\u003cbr\u003e “Well, I’ve been forced to go upstairs and unrind myself, and shake some bees out o’ me” said Geoffrey, walking slowly towards the open door, and standing on the threshold. “The young rascals got into my shirt and wouldn’t be quiet nohow.”\n\u003cbr\u003e \n\u003cbr\u003e Dick followed him to the door.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve come to speak a word to you,” he repeated, looking out at the pale mist creeping up from the gloom of the valley. “You may perhaps guess what it is about.”\n\u003cbr\u003e \n\u003cbr\u003e The keeper lowered his hands into the depths of his pockets, twirled his eyes, balanced himself on his toes, looked as perpendicularly downward as if his glance were a plumb-line, then horizontally, collecting together the cracks that lay about his face till they were all in the neighbourhood of his eyes.\n\u003cbr\u003e \n\u003cbr\u003e “Maybe I don’t know,” he replied.\n\u003cbr\u003e \n\u003cbr\u003e Dick said nothing; and the stillness was disturbed only by some small bird that was being killed by an owl in the adjoining wood, whose cry passed into the silence without mingling with it.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve left my hat up in chammer,” said Geoffrey; “wait while I step up and get en.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll be in the garden,” said Dick.\n\u003cbr\u003e \n\u003cbr\u003e He went round by a side wicket into the garden, and Geoffrey went upstairs. It was the custom in Mellstock and its vicinity to discuss matters of pleasure and ordinary business inside the house, and to reserve the garden for very important affairs: a custom which, as is supposed, originated in the desirability of getting away at such times from the other members of the family when there was only one room for living in, though it was now quite as frequently practised by those who suffered from no such limitation to the size of their domiciles.\n\u003cbr\u003e \n\u003cbr\u003e The head-keeper’s form appeared in the dusky garden, and Dick walked towards him. The elder paused and leant over the rail of a piggery that stood on the left of the path, upon which Dick did the same; and they both contemplated a whitish shadowy shape that was moving about and grunting among the straw of the interior.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve come to ask for Fancy,” said Dick.\n\u003cbr\u003e \n\u003cbr\u003e “I’d as lief you hadn’t.”\n\u003cbr\u003e \n\u003cbr\u003e “Why should that be, Mr. Day?”\n\u003cbr\u003e \n\u003cbr\u003e “Because it makes me say that you’ve come to ask what ye be’n’t likely to have. Have ye come for anything else?”\n\u003cbr\u003e \n\u003cbr\u003e “Nothing.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I’ll just tell ‘ee you’ve come on a very foolish errand. D’ye know what her mother was?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “A teacher in a landed family’s nursery, who was foolish enough to marry the keeper of the same establishment; for I was only a keeper then, though now I’ve a dozen other irons in the fire as steward here for my lord, what with the timber sales and the yearly fellings, and the gravel and sand sales and one thing and ‘tother. However, d’ye think Fancy picked up her good manners, the smooth turn of her tongue, her musical notes, and her knowledge of books, in a homely hole like this?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “D’ye know where?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, when I went a-wandering after her mother’s death, she lived with her aunt, who kept a boarding-school, till her aunt married Lawyer Green — a man as sharp as a needle — and the school was broke up. Did ye know that then she went to the training-school, and that her name stood first among the Queen’s scholars of her year?”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve heard so.”\n\u003cbr\u003e \n\u003cbr\u003e “And that when she sat for her certificate as Government teacher, she had the highest of the first class?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, and do ye know what I live in such a miserly way for when I’ve got enough to do without it, and why I make her work as a schoolmistress instead of living here?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “That if any gentleman, who sees her to be his equal in polish, should want to marry her, and she want to marry him, he sha’n’t be superior to her in pocket. Now do ye think after this that you be good enough for her?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “Then good-night t’ee, Master Dewy.”\n\u003cbr\u003e \n\u003cbr\u003e “Good-night, Mr. Day.”\n\u003cbr\u003e \n\u003cbr\u003e Modest Dick’s reply had faltered upon his tongue, and he turned away wondering at his presumption in asking for a woman whom he had seen from the beginning to be so superior to him.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1382/41469.html","bookId":1429,"creation":"Aug 2, 2019 1:59:48 AM","modification":"Aug 2, 2019 1:59:48 AM"}
