{"id":9101,"no":26,"title":"Chapter III Fancy in the Rain","content":"The next scene is a tempestuous afternoon in the following month, and Fancy Day is discovered walking from her father’s home towards Mellstock.\n\u003cbr\u003e \n\u003cbr\u003e A single vast gray cloud covered the country, from which the small rain and mist had just begun to blow down in wavy sheets, alternately thick and thin. The trees of the fields and plantations writhed like miserable men as the air wound its way swiftly among them: the lowest portions of their trunks, that had hardly ever been known to move, were visibly rocked by the fiercer gusts, distressing the mind by its painful unwontedness, as when a strong man is seen to shed tears. Low-hanging boughs went up and down; high and erect boughs went to and fro; the blasts being so irregular, and divided into so many cross-currents, that neighbouring branches of the same tree swept the skies in independent motions, crossed each other, or became entangled. Across the open spaces flew flocks of green and yellowish leaves, which, after travelling a long distance from their parent trees, reached the ground, and lay there with their under-sides upward.\n\u003cbr\u003e \n\u003cbr\u003e As the rain and wind increased, and Fancy’s bonnet-ribbons leapt more and more snappishly against her chin, she paused on entering Mellstock Lane to consider her latitude, and the distance to a place of shelter. The nearest house was Elizabeth Endorfield’s, in Higher Mellstock, whose cottage and garden stood not far from the junction of that hamlet with the road she followed. Fancy hastened onward, and in five minutes entered a gate, which shed upon her toes a flood of water-drops as she opened it.\n\u003cbr\u003e \n\u003cbr\u003e “Come in, chiel!” a voice exclaimed, before Fancy had knocked: a promptness that would have surprised her had she not known that Mrs. Endorfield was an exceedingly and exceptionally sharp woman in the use of her eyes and ears.\n\u003cbr\u003e \n\u003cbr\u003e Fancy went in and sat down. Elizabeth was paring potatoes for her husband’s supper.\n\u003cbr\u003e \n\u003cbr\u003e Scrape, scrape, scrape; then a toss, and splash went a potato into a bucket of water.\n\u003cbr\u003e \n\u003cbr\u003e Now, as Fancy listlessly noted these proceedings of the dame, she began to reconsider an old subject that lay uppermost in her heart. Since the interview between her father and Dick, the days had been melancholy days for her. Geoffrey’s firm opposition to the notion of Dick as a son-inlaw was more than she had expected. She had frequently seen her lover since that time, it is true, and had loved him more for the opposition than she would have otherwise dreamt of doing — which was a happiness of a certain kind. Yet, though love is thus an end in itself, it must be believed to be the means to another end if it is to assume the rosy hues of an unalloyed pleasure. And such a belief Fancy and Dick were emphatically denied just now.\n\u003cbr\u003e \n\u003cbr\u003e Elizabeth Endorfield had a repute among women which was in its nature something between distinction and notoriety. It was founded on the following items of character. She was shrewd and penetrating; her house stood in a lonely place; she never went to church; she wore a red cloak; she always retained her bonnet indoors and she had a pointed chin. Thus far her attributes were distinctly Satanic; and those who looked no further called her, in plain terms, a witch. But she was not gaunt, nor ugly in the upper part of her face, nor particularly strange in manner; so that, when her more intimate acquaintances spoke of her the term was softened, and she became simply a Deep Body, who was as long-headed as she was high. It may be stated that Elizabeth belonged to a class of suspects who were gradually losing their mysterious characteristics under the administration of the young vicar; though, during the long reign of Mr. Grinham, the parish of Mellstock had proved extremely favourable to the growth of witches.\n\u003cbr\u003e \n\u003cbr\u003e While Fancy was revolving all this in her mind, and putting it to herself whether it was worth while to tell her troubles to Elizabeth, and ask her advice in getting out of them, the witch spoke.\n\u003cbr\u003e \n\u003cbr\u003e “You be down — proper down,” she said suddenly, dropping another potato into the bucket.\n\u003cbr\u003e \n\u003cbr\u003e Fancy took no notice.\n\u003cbr\u003e \n\u003cbr\u003e “About your young man.”\n\u003cbr\u003e \n\u003cbr\u003e Fancy reddened. Elizabeth seemed to be watching her thoughts. Really, one would almost think she must have the powers people ascribed to her.\n\u003cbr\u003e \n\u003cbr\u003e “Father not in the humour for’t, hey?” Another potato was finished and flung in. “Ah, I know about it. Little birds tell me things that people don’t dream of my knowing.”\n\u003cbr\u003e \n\u003cbr\u003e Fancy was desperate about Dick, and here was a chance — O, such a wicked chance — of getting help; and what was goodness beside love!\n\u003cbr\u003e \n\u003cbr\u003e “I wish you’d tell me how to put him in the humour for it?” she said.\n\u003cbr\u003e \n\u003cbr\u003e “That I could soon do,” said the witch quietly.\n\u003cbr\u003e \n\u003cbr\u003e “Really? O, do; anyhow — I don’t care — so that it is done! How could I do it, Mrs. Endorfield?”\n\u003cbr\u003e \n\u003cbr\u003e “Nothing so mighty wonderful in it.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, but how?”\n\u003cbr\u003e \n\u003cbr\u003e “By witchery, of course!” said Elizabeth.\n\u003cbr\u003e \n\u003cbr\u003e “No!” said Fancy.\n\u003cbr\u003e \n\u003cbr\u003e “’Tis, I assure ye. Didn’t you ever hear I was a witch?”\n\u003cbr\u003e \n\u003cbr\u003e “Well,” hesitated Fancy, “I have heard you called so.”\n\u003cbr\u003e \n\u003cbr\u003e “And you believed it?”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t say that I did exactly believe it, for ’tis very horrible and wicked; but, O, how I do wish it was possible for you to be one!”\n\u003cbr\u003e \n\u003cbr\u003e “So I am. And I’ll tell you how to bewitch your father to let you marry Dick Dewy.”\n\u003cbr\u003e \n\u003cbr\u003e “Will it hurt him, poor thing?”\n\u003cbr\u003e \n\u003cbr\u003e “Hurt who?”\n\u003cbr\u003e \n\u003cbr\u003e “Father.”\n\u003cbr\u003e \n\u003cbr\u003e “No; the charm is worked by common sense, and the spell can only be broke by your acting stupidly.”\n\u003cbr\u003e \n\u003cbr\u003e Fancy looked rather perplexed, and Elizabeth went on:\n\u003cbr\u003e \n\u003cbr\u003e “This fear of Lizz — whatever ’tis —\n\u003cbr\u003e \n\u003cbr\u003e By great and small;\n\u003cbr\u003e \n\u003cbr\u003e She makes pretence to common sense,\n\u003cbr\u003e \n\u003cbr\u003e And that’s all.\n\u003cbr\u003e \n\u003cbr\u003e “You must do it like this.” The witch laid down her knife and potato, and then poured into Fancy’s ear a long and detailed list of directions, glancing up from the corner of her eye into Fancy’s face with an expression of sinister humour. Fancy’s face brightened, clouded, rose and sank, as the narrative proceeded. “There,” said Elizabeth at length, stooping for the knife and another potato, “do that, and you’ll have him by-long and by-late, my dear.”\n\u003cbr\u003e \n\u003cbr\u003e “And do it I will!” said Fancy.\n\u003cbr\u003e \n\u003cbr\u003e She then turned her attention to the external world once more. The rain continued as usual, but the wind had abated considerably during the discourse. Judging that it was now possible to keep an umbrella erect, she pulled her hood again over her bonnet, bade the witch good-bye, and went her way.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1382/41470.html","bookId":1429,"creation":"Aug 2, 2019 1:59:51 AM","modification":"Aug 2, 2019 1:59:51 AM"}
