{"id":83736,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt looks like Charlie has backed off Laurelyn tonight. He isn\u0027t eye-fucking her as they sing, so I guess he got the message. I can\u0027t knock the guy for trying, though. She is one hell of a catch.\u003c/p\u003e\n\u003cp\u003eWhen they finish playing what I think is the last song, the blokes leave the stage and Laurelyn takes a seat on a stool under the spotlight. She winks in my direction as she strums some chords on her Martin and leans toward the microphone. \"I wrote this next song during an extremely dark time in my life. I had just parted ways with the man I loved and thought we\u0027d never see each other again. It\u0027s about the things I\u0027d say to him if he ever came back to me. Well, he finally did, and this song is for him. It\u0027s called \u0027Loved by You.\u0027\"\u003c/p\u003e\n\u003cp\u003eWe were complete strangers\u003c/p\u003e\n\u003cp\u003eBrought together by fate\u0027s hand.\u003c/p\u003e\n\u003cp\u003eYou were a powerful tide\u003c/p\u003e\n\u003cp\u003eRushing over me in the sand.\u003c/p\u003e\n\u003cp\u003eYou pulled me into you\u003c/p\u003e\n\u003cp\u003eFrom the safety of the shore\u003c/p\u003e\n\u003cp\u003eAnd what I thought I wanted\u003c/p\u003e\n\u003cp\u003eBecame so much more.\u003c/p\u003e\n\u003cp\u003eNow I just want to be wanted by you.\u003c/p\u003e\n\u003cp\u003eAnd I just want to be needed by you.\u003c/p\u003e\n\u003cp\u003eMy heart just pleads to be loved by you.\u003c/p\u003e\n\u003cp\u003eIn the roughest of waters\u003c/p\u003e\n\u003cp\u003eI happily drowned in you\u003c/p\u003e\n\u003cp\u003eAnd in the calm of the storm\u003c/p\u003e\n\u003cp\u003eMy love for you grew.\u003c/p\u003e\n\u003cp\u003eBut now you\u0027re choosing\u003c/p\u003e\n\u003cp\u003eTo let me go\u003c/p\u003e\n\u003cp\u003eAnd it grows harder every day\u003c/p\u003e\n\u003cp\u003eTo not let the pain show.\u003c/p\u003e\n\u003cp\u003e\u0027Cause I just want to be wanted by you.\u003c/p\u003e\n\u003cp\u003eAnd I just want to be needed by you.\u003c/p\u003e\n\u003cp\u003eMy heart just pleads to be loved by you.\u003c/p\u003e\n\u003cp\u003eMy heart is slowly\u003c/p\u003e\n\u003cp\u003eCounting down the days\u003c/p\u003e\n\u003cp\u003eEach one bringing us closer\u003c/p\u003e\n\u003cp\u003eTo our parting ways.\u003c/p\u003e\n\u003cp\u003eAnd I worry about\u003c/p\u003e\n\u003cp\u003eHow I\u0027ll move on\u003c/p\u003e\n\u003cp\u003eWhen you\u0027re the reason\u003c/p\u003e\n\u003cp\u003eBehind my every song.\u003c/p\u003e\n\u003cp\u003e\u0027Cause I just want to be wanted by you.\u003c/p\u003e\n\u003cp\u003eAnd I just want to be needed by you.\u003c/p\u003e\n\u003cp\u003eMy heart just pleads to be loved by you.\u003c/p\u003e\n\u003cp\u003eLaurelyn finishes and mouths, \"I love you,\" before she kisses her fingers and holds her hand out in my direction. It\u0027s completely juvenile but it doesn\u0027t stop me from reaching out as if to catch her kiss and bring it to my lips. I look like a pussy, but what can I say? Love makes you do silly things and catching an air kiss would definitely fall under that category.\u003c/p\u003e\n\u003cp\u003e\"Dude, did she just blow that kiss to you?\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve sat by this guy the entire show without even looking at him until now. \"Yeah, she did. And now I\u0027m going to go get a real one.\"\u003c/p\u003e\n\u003cp\u003eI see the surprise in his eyes and it reinforces for me the huge star they see when they look at Laurelyn. \"Wow. The singer for Southern Ophelia is your girlfriend? That must rock.\"\u003c/p\u003e\n\u003cp\u003eGirlfriend doesn\u0027t feel like the right word for what she is to me. \"She\u0027s much more than my girlfriend.\"\u003c/p\u003e\n\u003cp\u003e\"Cool. Tell her it was an awesome show.\"\u003c/p\u003e\n\u003cp\u003eI walk to the spot where she told me to meet her after and she\u0027s there, waiting as promised. I pull her close and kiss the side of her face. \"Baby, you just keep amazing me.\"\u003c/p\u003e\n\u003cp\u003e\"Did you like it?\"\u003c/p\u003e\n\u003cp\u003eI assume she means the song she sang for me. \"Like it? Hell…I love it.\"\u003c/p\u003e\n\u003cp\u003e\"You know I wrote it about you. I mean every word.\"\u003c/p\u003e\n\u003cp\u003e\"I know. And that\u0027s how I feel about you too. Let\u0027s go back to the room so I can show you how much.\"\u003c/p\u003e\n\u003cp\u003eShe makes a face that tells me it\u0027s a no-go. \"The band always meets up after each performance to discuss any kinks from the show. I have to go to Charlie\u0027s room. It never lasts more than fifteen minutes max. Will you come with me? I want you to meet the guys.\"\u003c/p\u003e\n\u003cp\u003eFuck, no, I don\u0027t want to go to Charlie\u0027s room but even more, I don\u0027t want Laurelyn going without me. \"Sure, if that\u0027s what you want.\"\u003c/p\u003e\n\u003cp\u003eI think I feel my testosterone level surging as I approach the room where I\u0027ll meet the blokes Laurelyn has been closest to for the past three months. Knowing that one of them has a thing for her doesn\u0027t do much for calming my instinctual caveman tendencies to make sure he knows she\u0027s mine and not for his taking.\u003c/p\u003e\n\u003cp\u003eLaurelyn stops before we go inside and places her hands on each side of my face. \"You\u0027re tense but you shouldn\u0027t be. These guys are like brothers to me.\"\u003c/p\u003e\n\u003cp\u003eI think she forgets I have a sister and I\u0027ve never considered kissing her like what I saw last night. \"There\u0027s only one of them who makes me uptight, and he\u0027s the one I saw kissing you.\"\u003c/p\u003e\n\u003cp\u003eShe strokes her hands down my cheeks until they\u0027re on my jawline. She runs her fingers over my slight beard. \"You have to let that go.\"\u003c/p\u003e\n\u003cp\u003eEasier said than done. \"He and I will get along just fine as long as he backs off.\"\u003c/p\u003e\n\u003cp\u003e\"He already has, so there shouldn\u0027t be any problem. Right?\"\u003c/p\u003e\n\u003cp\u003eShe uses her hands to turn my head from side to side involuntarily. \"Say, \u0027No, Laurelyn. There isn\u0027t going to be any problem with Charlie.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"No, Laurelyn. There isn\u0027t going to be any problem with Charlie.\" She takes her hands from my face and I add, \"As long as he keeps his hands off you.\"\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes at me and shakes her head. \"Come on. Let\u0027s get this over with so you can see that there is no threat.\"\u003c/p\u003e\n\u003cp\u003eThe band members are sitting around talking when we enter Charlie\u0027s room, but they all come to full attention when they see I\u0027m with Laurelyn. \"Hey, y\u0027all. This is Jack, and I wanted to bring him by to meet you because you\u0027ll be seeing a lot of him for the next several weeks.\"\u003c/p\u003e\n\u003cp\u003eTheir manager, Randy, is the first to introduce himself. Then PJ and Ryan. Charlie hangs back last. At first I think it\u0027s because he\u0027s measuring me up, but then he\u0027s on his feet to offer his hand and I don\u0027t sense any type of confrontation. \"Laurelyn has told me a lot about you, so it\u0027s good to finally meet you.\"\u003c/p\u003e\n\u003cp\u003eIf I had it on my mind to be a wanker, I could construe his words into code for something else—like maybe Laurelyn telling him a lot about me means that she\u0027s confided in him or perhaps he\u0027s pointing out that it\u0027s finally nice to meet me because I haven\u0027t been around. I don\u0027t think either of these are the case. He\u0027s looking me in the eye, man to man, and he doesn\u0027t give me the Ben vibe at all.\u003c/p\u003e\n\u003cp\u003e\"Good to meet you as well, mate.\"\u003c/p\u003e\n\u003cp\u003e\"Our girl did good tonight, didn\u0027t she?\"\u003c/p\u003e\n\u003cp\u003eSurprise—that\u0027s what I feel at myself for not being the least bit offended by hearing Charlie refer to Laurelyn as our girl, as if she\u0027s partially his. I would\u0027ve lost it all together if I\u0027d ever heard Ben call her that to my face. \"Yes. She\u0027s rather amazing.\"\u003c/p\u003e\n\u003cp\u003eTime gets away from us and we end up hanging out for much longer than fifteen minutes. I don\u0027t mind because they all, surprisingly, turn out to be pretty cool. I\u0027d expected to be anxious to get out of there, but it ends up being Laurelyn coaxing me to leave because it\u0027s late and she\u0027s tired.\u003c/p\u003e\n\u003cp\u003eIt\u0027s not until we leave that I realize Laurelyn\u0027s room—our room—is next door. I\u0027ve been cool with everything else, but I don\u0027t like this. She slides the keycard in and then out for the green access light. \"This is the last time we stay next to any of them.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027re entering the room when she says, \"They always group us together. Why is it a problem as long as we\u0027re not sharing?\"\u003c/p\u003e\n\u003cp\u003eThe door shuts and I scoop her over my shoulder to carry her to the bed. I toss her playfully onto her back. \"Because we don\u0027t fuck soft and quiet. We fuck hard and loud.\"\u003c/p\u003e\n\u003cp\u003e\"And you don\u0027t want to embarrass me by having them hear us going at it?\"\u003c/p\u003e\n\u003cp\u003eEmbarrassment wasn\u0027t what I had in mind. \"Put it this way: I\u0027m not really interested in any of them wanking off to the sounds of us fucking in the next room.\"\u003c/p\u003e\n\u003cp\u003eShe scrunches her nose. \"Eww.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. If they hear some of the sounds you make, there\u0027s no hope they\u0027ll ever look at you again without visualizing what you were doing while you made that noise. Trust me when I say it\u0027s best if this is the last time we bunk down so closely.\"\u003c/p\u003e\n\u003cp\u003eAs I untuck my shirt from my pants and reach for my top button, Laurelyn scrambles to her purse on the bed. \"Wait. I have an idea.\" She reaches inside and takes out her phone. \"And we need the right kind of music for it.\" A song begins to play and she grins devilishly as she says, \"\u0027Addicted\u0027 by Saving Abel is perfect for what you\u0027re about to do for me.\"\u003c/p\u003e\n\u003cp\u003e\"And what am I about to do for you?\"\u003c/p\u003e\n\u003cp\u003eShe scoots to the head of the bed and sits against the headboard. \"You\u0027re gonna do a striptease for me while I watch.\"\u003c/p\u003e\n\u003cp\u003eMe doing the stripping would be a new one for us. \"I am?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah…you are. I\u0027ve done it for you every time you\u0027ve asked—and numerous times when you didn\u0027t. Now, I\u0027m asking, and you\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m pretty certain I better not say no if I ever want to see her dance again, so I start to move to the music as I begin to unbutton my shirt. \"You better have some bills ready for me, baby.\"\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eI didn\u0027t expect him to go along with dancing for me—at least not without a debate. I\u0027m surprised he agreed so easily—maybe a little too easily—but I don\u0027t care. He looks so damn hot doing it…like, flaming hot.\u003c/p\u003e\n\u003cp\u003eHe turns his back on me and I watch as he moves perfectly with the music, wiggling out of his white button-down and tossing it over his shoulder. It lands on my legs so I lift it to my nose. It smells delicious, just like him.\u003c/p\u003e\n\u003cp\u003eHis hands are on the back of his neck as he thrusts his pelvis forward with the song\u0027s tempo. All I can see from the back is the motion of his beautiful ass, and I imagine the way it looks when he\u0027s thrusting it between my legs.\u003c/p\u003e\n\u003cp\u003eHe spins to face me and puts his palms on his chest. He glides them down as he rotates his hips in a circular motion to the music. When his hands get to the crotch of his pants, he holds them out to use as a wall to bump and grind against.\u003c/p\u003e\n\u003cp\u003e\"Ooh, I like that.\"\u003c/p\u003e\n\u003cp\u003eHe laughs as he says, \"You\u0027ll like it a lot better when I\u0027m between your legs doing it.\"\u003c/p\u003e\n\u003cp\u003eHis promise sends a rush of heated desire straight to the area he\u0027s talking about. \"Bite your lip for me while you do it.\" He smirks but does as I tell him. \"Mmm, that\u0027s hot, but I think it\u0027s time for you to come out of those pants. You\u0027re overdressed for a stripper.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-19.html","bookId":1880,"creation":"Oct 5, 2019 4:54:40 PM","modification":"Oct 5, 2019 4:54:40 PM"}
