{"id":83743,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Oh…nothing,\" he says as we begin to stroll down the aisle but adds, \"Miss McLachlan.\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve never done this before, so I\u0027m nervous as hell about it. My parents, one of whom I barely know, are going to be here any minute to meet Jack Henry. My boyfriend. The man I love. The one throwing around words like always and future when he talks about us.\u003c/p\u003e\n\u003cp\u003eI want to throw up.\u003c/p\u003e\n\u003cp\u003eI\u0027m terrified this isn\u0027t going to go well. He already doesn\u0027t like either of my parents and I don\u0027t blame him. What if he can\u0027t keep that dislike to himself and make nice? He\u0027s opinionated and outspoken. This could be a total disaster. But even if it is, I\u0027ll still love him. This I know without a shadow of a doubt.\u003c/p\u003e\n\u003cp\u003eI reach for the lasagna in the oven and touch my inner wrist to the top of the rack above as I\u0027m taking it out. \"Shit!\" My body\u0027s reaction causes me to let go of the dish and jerk my arm back. Luckily, the dish of lasagna survives, but I\u0027ve burned the piss out of my wrist.\u003c/p\u003e\n\u003cp\u003eI run to the sink and immediately run cold water over it to stop the burning process as Jack Henry streaks into the kitchen. \"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"I burned myself. Rookie mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Let me take a look.\" Ah, the doctor is back. How nice to see you, Dr. McLachlan. It\u0027s been a while. I pull my wrist from the cold water long enough for him to examine it. \"It\u0027ll be fine. Where are your zipper bags? I\u0027ll make an ice pack for it.\"\u003c/p\u003e\n\u003cp\u003e\"Cabinet to the right of the stove.\"\u003c/p\u003e\n\u003cp\u003eHe bags up some ice cubes before wrapping them in a dishtowel and passing it to me. \"I\u0027ll get the lasagna out. You hold that ice over your burn.\"\u003c/p\u003e\n\u003cp\u003eI sit at the table so I can be worthless. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re welcome. It\u0027s the least I can do after you\u0027ve slaved in here all afternoon. Do you need me to do anything else?\"\u003c/p\u003e\n\u003cp\u003eI glance at the clock. \"It\u0027s almost six. Will you put the bread in the oven? I already have it on the pan.\"\u003c/p\u003e\n\u003cp\u003e\"Anything for you, Miss McLachlan.\"\u003c/p\u003e\n\u003cp\u003e\"You enjoy that, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" He says it so innocently, but he knows what I mean.\u003c/p\u003e\n\u003cp\u003e\"Calling me Miss McLachlan.\"\u003c/p\u003e\n\u003cp\u003e\"I certainly do. It\u0027s good practice.\"\u003c/p\u003e\n\u003cp\u003eGood practice for what?\u003c/p\u003e\n\u003cp\u003eA knock sounds at the door and I\u0027m instantly annoyed because I want to know what he means. I\u0027m tempted to tell Jake and Jolene to hold up a minute because I need to get to the bottom of this. Of course I don\u0027t, but it\u0027s a topic I plan to revisit later when we\u0027re alone.\u003c/p\u003e\n\u003cp\u003eI get up to answer the door. \"Here we go. Remember to be nice if you want your reward later.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am. Your caveman is going to make you proud.\"\u003c/p\u003e\n\u003cp\u003eI give him a quick kiss. \"That\u0027s my sweet boy.\"\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eI stand in the living room and wait for the recipients of the World\u0027s Worst Parents award to come through the door. This is going to be hard as hell to get through without opening my mouth—I know things about Jolene Prescott\u0027s past that the rest of the world doesn\u0027t, including Jake Beckett. I only have one reason to look these people in their faces and not tell them they\u0027re assholes: Laurelyn.\u003c/p\u003e\n\u003cp\u003eAs I stand there waiting, I realize Laurelyn has never shown me a picture of her mother. Without much thought, I always envisioned an older version of Laurelyn so when I see Jolene Prescott for the first time, she is nothing like I expected. She\u0027s a slim, attractive blond but looks nothing like Laurelyn. Her father, on the other hand, is a different story. Laurelyn is the spitting image of her father. I don\u0027t think a father and daughter could look more alike. He marked her well, which is ironic, considering he hasn\u0027t had anything to do with her for the last twenty-three years.\u003c/p\u003e\n\u003cp\u003eI can\u0027t let myself go there or I\u0027ll be telling these people off, so I shove the thought aside as Laurelyn introduces me to her parents for the first time. Polite introductions are made and we go into the dining room where Laurelyn has everything ready for dinner.\u003c/p\u003e\n\u003cp\u003e\"You made lasagna. Jake, it\u0027s the best you\u0027ll ever have—better than any Italian restaurant. I don\u0027t know where she got her ability to cook, because it sure wasn\u0027t from me.\"\u003c/p\u003e\n\u003cp\u003eI know where she learned. While her mother was high and passed out, she was a little girl learning how to fend for herself.\u003c/p\u003e\n\u003cp\u003eLaurelyn looks at me and I\u0027d almost think she could read my mind if I didn\u0027t know better. She taps the top of my foot with hers and gives me that look, the one that says, Stop it right now. God, how does this woman know me so well—like she can read my every thought just by the expression on my face?\u003c/p\u003e\n\u003cp\u003eI bite my tongue to prevent it from rattling off what I really think. \"Yes, ma\u0027am. She\u0027s an excellent cook.\"\u003c/p\u003e\n\u003cp\u003eLaurelyn tries her best to keep the conversation light, but Jolene manages to steer it toward the assault. There\u0027s nothing Laurelyn can do to stop it. \"I want to know what happened with Blake Phillips. Why did he attack you again?\"\u003c/p\u003e\n\u003cp\u003eAgain? This wasn\u0027t the first time? Well, that\u0027s something we\u0027ll be discussing later.\u003c/p\u003e\n\u003cp\u003e\"Blake came to see Randy about bringing us back to Nashville to record a single. He was in the room when I showed up for the post-show meeting. To say I was shocked would be the understatement of the century. We argued about recording the song and I left. I had no idea he followed me to my room and when I unlocked the door, he grabbed me from behind and forced me inside.\"\u003c/p\u003e\n\u003cp\u003e\"What did he do to you, Laurie?\"\u003c/p\u003e\n\u003cp\u003eI haven\u0027t heard these details and I don\u0027t really want to, but I\u0027m left without a choice because her mum isn\u0027t going to be satisfied until she knows it all. \"I bit his hand over my mouth so I could scream for help.\" She points to her face. \"He backhanded me here. And then he went nuts when I told him I didn\u0027t want him.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean he went nuts?\"\u003c/p\u003e\n\u003cp\u003eLaurelyn looks at me and then back to her parents. \"He tried to rape me, but Jack Henry stopped him.\"\u003c/p\u003e\n\u003cp\u003eHer mother gasps and covers her mouth with her hand. \"Oh my God. I didn\u0027t know that\u0027s what you meant when you said he attacked you.\"\u003c/p\u003e\n\u003cp\u003eHer father pounds his fist on the table. \"If I\u0027d dealt with him after that stunt he pulled with you outside the studio, this wouldn\u0027t have happened.\"\u003c/p\u003e\n\u003cp\u003eWhat stunt?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not your fault. I told you I didn\u0027t want you to make a big deal out of it because of his family. I had no idea he was that unstable, but I\u0027m pressing charges and I took out a restraining order. He\u0027s not supposed to come near me, but don\u0027t worry. Jack Henry will be here with me.\"\u003c/p\u003e\n\u003cp\u003e\"But for how long?\" her mum asks.\u003c/p\u003e\n\u003cp\u003eI don\u0027t appreciate her tone and I suspect Laurelyn sees it on my face. \"Three more weeks.\"\u003c/p\u003e\n\u003cp\u003e\"Where does that leave the two of you if you\u0027re going back?\" Jolene asks.\u003c/p\u003e\n\u003cp\u003eWe look at one another and it\u0027s evident. Neither of us knows, so we don\u0027t answer.\u003c/p\u003e\n\u003cp\u003eThe tension is thick. Jake attempts to cut through the discomfort. \"What kind of work do you do, Jack?\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s a safe topic. \"I own several vineyards and I produce a variety of vino.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like you must do well for yourself.\"\u003c/p\u003e\n\u003cp\u003e\"I manage.\" I\u0027ve never been one to boast about my wealth, except when I thought I could use it as a line for getting Laurelyn into my bed.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t let him fool you with his modesty. His vineyards do quite well.\"\u003c/p\u003e\n\u003cp\u003e\"Well enough that we don\u0027t have to worry about him being here because of the success you\u0027ve achieved since you saw him last?\" Damn! She just puts it out there, doesn\u0027t she?\u003c/p\u003e\n\u003cp\u003e\"Mom!\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay. I understand why that might raise suspicion with your parents. I\u0027m not offended in the least.\" I\u0027m not insulted by her concern. In fact, her worry makes me proud that for once, she might have her daughter\u0027s best interests at heart. However, it makes me mad as hell that she questions my love. \"Laurelyn\u0027s father isn\u0027t the only multimillionaire sitting at this table, Miss Prescott. Although I\u0027m very happy for Laurelyn and her success, I don\u0027t need one cent of her money.\"\u003c/p\u003e\n\u003cp\u003e\"I had no idea you were so wealthy.\"\u003c/p\u003e\n\u003cp\u003eOf course Laurelyn didn\u0027t tell her. She wouldn\u0027t. \"She didn\u0027t tell you because my money means nothing to her.\"\u003c/p\u003e\n\u003cp\u003eAnd that\u0027s only one of the many reasons I love her so much.\u003c/p\u003e\n\u003cp\u003eI survived dinner. Barely. And I kept my promise to Laurelyn, although I\u0027ve never bit my tongue so many times in my life. I need a fucking tongue transplant after enduring two hours with Jolene Prescott, but I told myself the entire time that it was all for my girl. That was the only way I could get through it without telling that woman what a selfish and shitty mother she\u0027s been to a woman who deserves so much more.\u003c/p\u003e\n\u003cp\u003eShe actually had the nerve to tell me that Laurelyn\u0027s career was here in the U.S. and not in Australia. She said it like I was a dumb-arse and didn\u0027t already realize that. I know America is where country music stars make it big. I don\u0027t need her to tell me that, so now I consider her insulting in addition to being selfish. But the icing on the cake was when she told me I\u0027d ruin Laurelyn\u0027s life if I robbed her of all the opportunities she had in her future.\u003c/p\u003e\n\u003cp\u003eNone of that is Jolene Prescott\u0027s decision to make. Even as badly as I want Laurelyn to choose me, it\u0027s not my decision. Only she can decide which path she wants to take in this life. And all I can do is pray that her mother doesn\u0027t get in her ear and persuade her that her life isn\u0027t with me.\u003c/p\u003e\n\u003cp\u003eWhen they\u0027re finally out the door, I fall onto the couch and rest my head on the back. I\u0027m looking at the ceiling when Laurelyn sits next to me. \"I\u0027m sorry that was…what it was.\"\u003c/p\u003e\n\u003cp\u003e\"Just so you know…that did not improve my opinion of your mum at all.\"\u003c/p\u003e\n\u003cp\u003e\"It didn\u0027t do much for mine, either. I\u0027m sorry she was such a bitch to you, but there\u0027s good news.\"\u003c/p\u003e\n\u003cp\u003e\"Please, let me in on whatever it is. I need something good in my life after that.\"\u003c/p\u003e\n\u003cp\u003eShe lowers herself to the floor between my knees and begins removing my shoes. \"You have a reward coming for the stellar way you handled yourself tonight,\" she says as she slides my second shoe off. She removes my socks and flings them over her shoulder. She pops the button on my jeans and she\u0027s wearing a wicked grin as she slides the zipper down. \"I think you need some room in these pants. They look a little tight.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-surrender-beauty-2/page-26.html","bookId":1880,"creation":"Oct 5, 2019 4:54:40 PM","modification":"Oct 5, 2019 4:54:40 PM"}
