{"id":97462,"no":1,"title":"Page 1","content":"\u003cp\u003eThe food was gone and with it the warmth. All was hollow and empty, save the call to break free. That came most insistently, a subtle urging growing into desperation.\u003c/p\u003e\n\u003cp\u003eEight tiny legs answered that imploring call. Eight tiny weapons struck at the concave wall. Battering and tearing, following the lighter shade of gray in this dark place.\u003c/p\u003e\n\u003cp\u003eA hole appeared in the leathery surface and the eight legs coordinated their attacks at that very spot, sensing weakness. Weakness could not be tolerated. Weakness had to be exploited, immediately and without mercy.\u003c/p\u003e\n\u003cp\u003eOne by one, ten by ten, a thousand by a thousand, a million by a million, tiny legs waved in the misty space between universes for the first time, tearing free of their circular prisons. Driven by hunger and ambition, by fear and an instinctive vileness, the millions of arachnids fought their first battle against a pliable, leathery barrier. Hardly a worthy adversary, but they fought with an urgency wrought of knowing that the first to emerge would hold a great advantage, knowing that they - all of them - were hungry.\u003c/p\u003e\n\u003cp\u003eAnd knowing there was nothing to eat but each other.\u003c/p\u003e\n\u003cp\u003eThe warmth of the egg sac was gone, devoured. The quiet moments of solitude, of awakening, of first sense of consciousness, were past. The walls that had served as shelter and protection became an impediment and nothing more. The soft shell was a barricade against food, against necessary battle, against satiation on so many levels.\u003c/p\u003e\n\u003cp\u003eAgainst power.\u003c/p\u003e\n\u003cp\u003eAnd that, most of all, could not be tolerated by these blessed and cursed offspring. So they fought and tore and scrabbled and scrambled to get out.\u003c/p\u003e\n\u003cp\u003eTo eat.\u003c/p\u003e\n\u003cp\u003eTo climb.\u003c/p\u003e\n\u003cp\u003eTo dominate.\u003c/p\u003e\n\u003cp\u003eTo kill.\u003c/p\u003e\n\u003cp\u003eTo become. . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/condemnation-war-of-the-spider-queen-3/page-1.html","bookId":2161,"creation":"Oct 5, 2019 6:27:34 PM","modification":"Oct 5, 2019 6:27:34 PM"}
