{"id":88788,"no":20,"title":"Page 20","content":"\u003cp\u003eLyra picked at her salad, cut a small portion of the chicken breast, and left the rest on the platter between them. Sam finished his dinner and polished off the chicken and vegetables.\u003c/p\u003e\n\u003cp\u003e“That was a great dinner,” he told her.\u003c/p\u003e\n\u003cp\u003e“I wanted to make a farewell dinner for you to say thank you, and had there been time, I would have prepared one of my grandmother’s dishes. She’s the real cook in the family. It’s too bad she didn’t cook for you.”\u003c/p\u003e\n\u003cp\u003e“Maybe someday she will.”\u003c/p\u003e\n\u003cp\u003e“I doubt it, unless she decides to visit D.C.”\u003c/p\u003e\n\u003cp\u003e“Or Scotland,” he said.\u003c/p\u003e\n\u003cp\u003eLyra stood and took their plates to the sink. He followed with the empty platter and said, “I don’t know how you did it.”\u003c/p\u003e\n\u003cp\u003eShe turned around and leaned against the sink. “Did what?”\u003c/p\u003e\n\u003cp\u003e“Went up and down that godforsaken hill every day. The stench … I’d be in the shower three times a day.”\u003c/p\u003e\n\u003cp\u003e“Actually, it was two showers a day,” she corrected. “And I’m about to take my second one. I always feel like the smell is in my hair.”\u003c/p\u003e\n\u003cp\u003eHe bent forward. “You smell great.”\u003c/p\u003e\n\u003cp\u003eShe started to load the dishwasher, but Sam stopped her. “Let me do that.”\u003c/p\u003e\n\u003cp\u003eThere wasn’t any argument from her. It was probably psychological, but the mention of the hill made her desperate to feel clean.\u003c/p\u003e\n\u003cp\u003eTwenty minutes later her hair was washed and dried and she was feeling much better. Except for feeling abandoned. She told herself things would be better when he was gone. Sam was an unneeded distraction. Nevertheless, this was their last night, and she knew he felt something for her … he’d kissed her.\u003c/p\u003e\n\u003cp\u003eShe put on her cotton pajamas and robe, propped herself up with pillows on the bed, and turned on the television.\u003c/p\u003e\n\u003cp\u003eHe knocked on her door. “You decent?”\u003c/p\u003e\n\u003cp\u003e“Sort of.”\u003c/p\u003e\n\u003cp\u003eHe opened the door and walked in. “I thought you might be working.”\u003c/p\u003e\n\u003cp\u003e“Not tonight.”\u003c/p\u003e\n\u003cp\u003e“Do you have an extra disk of your documentary on the park? Or is it back at the apartment?”\u003c/p\u003e\n\u003cp\u003e“I keep extra disks in my backpack, and I’ve got the memory cards. I have my film on my laptop, too. Why?”\u003c/p\u003e\n\u003cp\u003e“I want to watch it.”\u003c/p\u003e\n\u003cp\u003e“You saw it at the lab, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I did, but I had other things on my mind, so I didn’t get a close look.”\u003c/p\u003e\n\u003cp\u003e“Okay.” She started to get up, but he told her to stay put; he’d bring her laptop and backpack to her. Lyra suddenly felt vulnerable, wanting to call out excuses, such as the film will be boring, or she could have done a much better job narrating, or she should have picked up the pace …\u003c/p\u003e\n\u003cp\u003eSam handed her the laptop. “You want to watch it with me?” he asked.\u003c/p\u003e\n\u003cp\u003eHe didn’t give her time to make up her mind. “Scoot over,” he said and sat down beside her. Kicking off his loafers, he swung his legs up and stretched out.\u003c/p\u003e\n\u003cp\u003e“You’re going to be bored,” she warned. She handed him a pillow for his back.\u003c/p\u003e\n\u003cp\u003e“I won’t be bored.”\u003c/p\u003e\n\u003cp\u003e“It isn’t very long.”\u003c/p\u003e\n\u003cp\u003eLyra scooted closer, opened the video on her laptop, and moved it to his lap.\u003c/p\u003e\n\u003cp\u003e“I think—”\u003c/p\u003e\n\u003cp\u003e“Stop worrying.”\u003c/p\u003e\n\u003cp\u003e“Just tell me why you want to watch it again.”\u003c/p\u003e\n\u003cp\u003e“The hill made an impression on me,” he said. “I saw that you got the license plate numbers of those bastards who used the park as their own personal landfill. Now I’d like to see if you got any faces.”\u003c/p\u003e\n\u003cp\u003e“Oh, I did,” she told him. “Almost all of them turned around at some point, and if I freeze the shots, you can get a really good look at them.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” He turned his head and smiled at her. He was so close he could see the green flecks in her eyes. Emeralds, he thought. As bright as emeralds.\u003c/p\u003e\n\u003cp\u003e“How did you manage that?”\u003c/p\u003e\n\u003cp\u003e“It’s all in the angle of the camera.”\u003c/p\u003e\n\u003cp\u003e“Ready?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, and he started the film.\u003c/p\u003e\n\u003cp\u003eNeither one of them spoke while the documentary was playing. Lyra was watching with a critical eye. She cringed over the huskiness of her voice. Why didn’t she have two cameras going at the same time, one facing east, the other west? And why hadn’t she noticed the spots where the narration dragged?\u003c/p\u003e\n\u003cp\u003eSam thought the film was excellent and told her so.\u003c/p\u003e\n\u003cp\u003e“How come you were so nervous watching it?” he asked.\u003c/p\u003e\n\u003cp\u003e“I was nervous because you were watching it,” she admitted.\u003c/p\u003e\n\u003cp\u003eHe laughed. “I thought having others watch it was rather the point. To expose something horrible that was happening so that something could be done about it?”\u003c/p\u003e\n\u003cp\u003e“Yes, but I wouldn’t be sitting beside any of them listening to their comments.”\u003c/p\u003e\n\u003cp\u003eHe closed the laptop and put it on the table next to the bed. He thought silently for a while, then said, “Of all the people who could have known you were doing your project on that particular park, are there any who questioned you about it, anyone who seemed particularly interested?”\u003c/p\u003e\n\u003cp\u003e“No,” she answered.\u003c/p\u003e\n\u003cp\u003e“Could the men who broke into your apartment have known about it?”\u003c/p\u003e\n\u003cp\u003e“They could have. I had files and notebooks all over the apartment. They might have seen the name of the park. Sidney said they were tearing through all my papers, and there were photos of the hill before and after it was desecrated.”\u003c/p\u003e\n\u003cp\u003e“They might have been following you during your trips back and forth.”\u003c/p\u003e\n\u003cp\u003eThe thought of being watched gave her a chill. “There were a couple of times I thought someone else might have been there,” she said, “but I just thought it was my imagination. I was nervous because the park is in such an isolated area.”\u003c/p\u003e\n\u003cp\u003e“I would like to send this film to the FBI office here and to my office in D.C.”\u003c/p\u003e\n\u003cp\u003e“Will anything get done to clean up the hill?”\u003c/p\u003e\n\u003cp\u003e“Oh, hell yes, if it gets in the right hands.”\u003c/p\u003e\n\u003cp\u003eShe was pleased. “Good.”\u003c/p\u003e\n\u003cp\u003eHe finished sending the file and said, “That should do it.” Handing her the laptop, he slipped on his shoes to leave, but when he looked down at her, a knot formed in the pit of his stomach. The last thing he wanted to do was walk out that door.\u003c/p\u003e\n\u003cp\u003eHe had almost made it when she called out. “Sam?”\u003c/p\u003e\n\u003cp\u003eHe turned. “What?” he asked impatiently.\u003c/p\u003e\n\u003cp\u003e“I just want you to know how much I’ve appreciated your help.”\u003c/p\u003e\n\u003cp\u003eAlmost dismissively, he said. “It was nothing. I was here because Alec asked me.”\u003c/p\u003e\n\u003cp\u003e“I know, but—”\u003c/p\u003e\n\u003cp\u003e“I would have done it for anyone.”\u003c/p\u003e\n\u003cp\u003e“I’m just saying—”\u003c/p\u003e\n\u003cp\u003e“Damn it, Lyra, I’ve got to get out of here.”\u003c/p\u003e\n\u003cp\u003eHis flash of temper ignited her own. “Then go. I know you’re dying to get away from me.”\u003c/p\u003e\n\u003cp\u003eHe crossed the room and stood over her.\u003c/p\u003e\n\u003cp\u003e“Go,” she said again. “I certainly won’t miss you.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” he said as he pulled her into his arms.\u003c/p\u003e\n\u003cp\u003eTWENTY-FOUR\u003c/p\u003e\n\u003cp\u003eSAM OBVIOUSLY BELIEVED IN LONG GOOD-BYES.\u003c/p\u003e\n\u003cp\u003eHe took Lyra’s face in his hands, and his mouth came down on top of hers, taking absolute possession, his tongue thrusting inside to rub against hers. He wanted to know all of her, to kiss every inch of her, to possess her completely. The kiss deepened, becoming carnal as his tongue moved in and out of her mouth. Lyra wrapped her arms around his neck and dug her fingers into his hair. She clung to him, tasting him, losing all thought until she was trembling with passion.\u003c/p\u003e\n\u003cp\u003eWhen he lifted his head, his eyes swept over her face and he slowly brushed his thumb across her full lips.\u003c/p\u003e\n\u003cp\u003e“You’re going to miss me, sweetheart,” he said as he kissed the side of her neck.\u003c/p\u003e\n\u003cp\u003e“Not going to happen,” Lyra panted. She could barely get the words out. He was nibbling her earlobe, and she couldn’t concentrate. She sighed as he continued to play, kissing a path from her earlobe to the sensitive spot at the base of her neck.\u003c/p\u003e\n\u003cp\u003e“Your skin is so soft,” he whispered. His warm, sweet breath sent shivers through her. When his tongue tickled her skin, she felt goose bumps.\u003c/p\u003e\n\u003cp\u003eHis hands slipped under her pajama top and stroked the small of her back, then moved around her waist. His fingers brushed across her br**sts as he captured her mouth again with his. When he pulled away, his breathing was as unsteady as hers. She thought she was still in control until she looked down and saw that he had unbuttoned her top.\u003c/p\u003e\n\u003cp\u003e“Your heart’s racing,” he said as he placed his hand over it. “I can feel it pounding.”\u003c/p\u003e\n\u003cp\u003eSam needed to feel her against him. He stepped back and pulled his T-shirt over his head, tossed it on the floor, and started to unbutton his jeans. She stopped him by pushing his hands away. Staring deeply into his eyes, she slid her fingers inside the waistband and slowly unbuttoned each button, the backs of her fingers causing havoc. Her painstaking slowness was deliberate and drove him wild.\u003c/p\u003e\n\u003cp\u003e“Too slow,” he said gruffly.\u003c/p\u003e\n\u003cp\u003eHe pulled a condom from his back pocket, dropped it on the bedside table, and then stripped.\u003c/p\u003e\n\u003cp\u003eHe wasn’t the least bit shy. Looking at his beautifully sculpted body, Lyra understood why. He was built like a Greek warrior, a ripple of muscle from his chest to his legs. She could feel his strength, his power.\u003c/p\u003e\n\u003cp\u003e“Your turn,” he told her.\u003c/p\u003e\n\u003cp\u003eShe wasn’t embarrassed, but she was feeling vulnerable, wanting him to like her body as much as she did his. She removed her top and tossed it on the bed, then untied the ribbon at the waist of her pajama bottoms. The fabric puddled at her feet. Completely na*ed now, she stepped out of them and turned to face him, waiting for his reaction. She could feel the heat in her cheeks and thought she might be blushing.\u003c/p\u003e\n\u003cp\u003eThe muscle in Sam’s jaw twitched as desire knifed through him. He let out a long, ragged breath. “Ah, Lyra … you’re beautiful.” His voice shook with emotion.\u003c/p\u003e\n\u003cp\u003eHe reached for her and pulled her against him. Her soft br**sts rubbed against his chest, and the sensation coursing through him made his need all the more profound.\u003c/p\u003e\n\u003cp\u003eLyra rubbed her cheek against his chest. The sprinkle of blond hair tickled her skin as she inhaled his intoxicating scent. Leaning up, she kissed him just below the jaw, then kissed the pulse at the base of his neck.\u003c/p\u003e\n\u003cp\u003eSam couldn’t remain still. He tilted her chin up and kissed her hungrily while he lifted her onto the bed and covered her body with his. Careful not to crush her with his weight, he braced himself on his arms.\u003c/p\u003e\n\u003cp\u003eLooking into her eyes, he whispered, “Tell me what you like.”\u003c/p\u003e\n\u003cp\u003e“This,” she answered as she rubbed her lips over his. “I like this.”\u003c/p\u003e\n\u003cp\u003eShe kissed him thoroughly, exploring his mouth with her tongue. She gripped his shoulders. His body felt like hot steel against her. Each kiss was hotter than the one before.\u003c/p\u003e\n\u003cp\u003eSam tried to slow the pace. If she was trying to drive him crazy, she was doing a damn good job.\u003c/p\u003e\n\u003cp\u003e“I like this,” Sam said. He slowly moved down her body until he reached her breasts. He kissed the valley between them and skimmed each breast with his tongue. He knew she liked what he was doing because she moved restlessly against him and arched her back. He moved lower, circled her navel with kisses, and lower still until she cried out and her nails dug into his shoulders. He rolled over, pulled her on top of him, and kissed her almost savagely.\u003c/p\u003e\n\u003cp\u003e“I want you,” he growled.\u003c/p\u003e\n\u003cp\u003e“Not yet,” she answered, barely recognizing her own voice.\u003c/p\u003e\n\u003cp\u003eShe wanted him to lose his control before she did. She tugged on his ear with her teeth, smiling when she felt him tense against her. Moving lower, she caressed his hard stomach and moved lower still, touching, kissing. He grabbed her and pushed her onto her back. His movements were rough, but her passion matched his. When he nudged her legs apart, she locked her hands behind his neck and trembled in anticipation.\u003c/p\u003e\n\u003cp\u003eHe knelt between her thighs and the feel of her was his undoing. He slowly rubbed against her but stopped when he heard her indrawn breath. Rolling to his side, he reached toward the bedside table.\u003c/p\u003e\n\u003cp\u003eShe was trying to catch her breath when he came back to her and wrapped her in his arms. God, she felt good. She moved beneath him and he couldn’t wait any longer. He thrust deep. He tried to take it slow, to draw out the pleasure, but she was so tight, he didn’t last long. He moved back and thrust again. Her legs wrapped around him, and his thrusts became quicker, harder, less controlled. Sam had not felt such raw passion with any other woman. It threatened to consume him. He couldn’t stop, couldn’t control his pace as he slammed into her again and again.\u003c/p\u003e\n\u003cp\u003eLyra was as out of control as he was. When she cl**axed, her entire body tightened around him, and she cried out in ecstasy. Was he hurting her? Lyra answered by digging her nails into his back and arching against him.\u003c/p\u003e\n\u003cp\u003eHer cl**ax triggered his. Waves of pleasure washed over him. He’d never experienced anything like this. She took every bit of his strength, and he collapsed on top of her, his head nuzzled in the crook of her neck. His breathing was harsh, and it took a long while to calm his racing heart.\u003c/p\u003e\n\u003cp\u003eTheir bodies glistened with perspiration, and their hearts pounded against their chests in unison.\u003c/p\u003e\n\u003cp\u003eHe finally found enough energy to roll off her. Without a word he got up and went into the bathroom. She heard water running and thought he was taking a shower, but a couple of minutes later, he came back to bed.\u003c/p\u003e\n\u003cp\u003eLyra had turned onto her stomach but hadn’t covered up, and that pleased him considerably. He liked the fact that she was comfortable with her body and with him.\u003c/p\u003e\n\u003cp\u003eHe tapped her shoulder. “Lyra?”\u003c/p\u003e\n\u003cp\u003eShe lifted her head. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Would you like a performance evaluation?”\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to say something, then closed it. “A what?” she asked.\u003c/p\u003e\n\u003cp\u003e“A performance evaluation. You want to know how you did, don’t you?”\u003c/p\u003e\n\u003cp\u003eHe had rendered her speechless. She leaned up on an elbow, narrowed her eyes, and frowned at him. Was he kidding? Then she saw the flicker of laughter in his eyes. Okay, two can play at this game, she thought.\u003c/p\u003e\n\u003cp\u003e“Yes, please. I would love an evaluation. How did I do? And is there room for improvement?”\u003c/p\u003e\n\u003cp\u003eHe stretched out beside her, folded a pillow behind his head, and said, “I’ve got to give you high marks for enthusiasm.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“And the effort was there.”\u003c/p\u003e\n\u003cp\u003e“Is that so?”\u003c/p\u003e\n\u003cp\u003e“Absolutely,” he said. “Your technique was definitely above par.”\u003c/p\u003e\n\u003cp\u003eHe was having a good time. His grin was slow and totally unrepentant.\u003c/p\u003e\n\u003cp\u003e“Meaning I can improve?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’ll help you with that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sizzle-buchanan-renard-8/page-20.html","bookId":1829,"creation":"Oct 5, 2019 5:31:17 PM","modification":"Oct 5, 2019 5:31:17 PM"}
