{"id":88789,"no":21,"title":"Page 21","content":"\u003cp\u003e“That’d be nice,” she said, smiling. “Now it’s my turn to judge your performance.”\u003c/p\u003e\n\u003cp\u003eHe clasped his hands together as if to brace himself and said, “Okay, I’m ready.”\u003c/p\u003e\n\u003cp\u003eShe rolled on top of him. “Not bad for a warm-up.”\u003c/p\u003e\n\u003cp\u003eTWENTY-FIVE\u003c/p\u003e\n\u003cp\u003eHE WORE HER OUT. LYRA FELL INTO A DEEP SLEEP AROUND two in the morning but woke up a little after five with Sam kissing the side of her neck.\u003c/p\u003e\n\u003cp\u003eHe had to be superhuman. She had lost count of the number of times he had reached for her. Three? Four? She supposed she should be honest with herself. She had reached for him, too. Still … didn’t he need any sleep?\u003c/p\u003e\n\u003cp\u003e“Sam?” she purred.\u003c/p\u003e\n\u003cp\u003e“Hmmm?”\u003c/p\u003e\n\u003cp\u003e“What are you doing?”\u003c/p\u003e\n\u003cp\u003e“Trying to wake you for good-bye sex.”\u003c/p\u003e\n\u003cp\u003e“Didn’t we already have good-bye sex?”\u003c/p\u003e\n\u003cp\u003eShe turned in his arms so she could look at him and tell him she thought he might be insatiable, but his warm body, his sleepy eyes, and his sexy mouth changed her mind. She kissed him instead. Maybe she was insatiable, too.\u003c/p\u003e\n\u003cp\u003eTheir lovemaking wasn’t leisurely, but wild and consuming. He was tender with her, yet she could sense the hunger in him. Lyra felt as though she was coming undone. The sensations were terrifying but at the same time wonderful. She clung to him and knew she was safe.\u003c/p\u003e\n\u003cp\u003eSam’s cl**ax was shattering and exhilarating. His voice was deep and raspy as he called her name and held her h*ps tight against him. When he found the strength, he lifted up and kissed her brow. She ran her fingertips along his unshaven face.\u003c/p\u003e\n\u003cp\u003eHe touched her soft cheek. “Did I scratch you?”\u003c/p\u003e\n\u003cp\u003eHer eyes were closing, and she didn’t answer his question. “Night,” she said.\u003c/p\u003e\n\u003cp\u003eShe was sound asleep less than a minute later.\u003c/p\u003e\n\u003cp\u003eSAM RELUCTANTLY GOT OUT of bed and went into the bathroom to shower and get dressed. He wasn’t certain how early his replacement would be at the door, and he wanted to be ready.\u003c/p\u003e\n\u003cp\u003eHe shaved and packed his bag, pulled on his khaki slacks, and strapped his gun and holster onto his side. Still shoeless and bare-chested, he crossed the hall for the third time to check on Lyra, even though he knew his actions were ridiculous. She was perfectly fine. Everything about her was fine … and amazing.\u003c/p\u003e\n\u003cp\u003eShe was going to be okay. Alec had assured him that the new bodyguard—Brick Winter—would keep her safe. Brick Winter. What kind of name was Brick? Sam should have checked him out personally. Alec had vouched for him, but Sam bet if he’d looked he would have found something wrong. And how could anyone take a guy named Brick seriously? Maybe in Hollywood, but not in the real world.\u003c/p\u003e\n\u003cp\u003eSam went back into Lyra’s room to get his shoes and the clothes he’d left on the floor. He had just stuffed everything in his bag when he heard a knock at the door. Still barefoot, he unsnapped the strap over his gun and went downstairs. He looked through the peephole, saw the identification, and opened the door.\u003c/p\u003e\n\u003cp\u003eHe swore to God a frickin’ movie star stood on the welcome mat. As a rule Sam didn’t notice what men looked like, but this Brick was built like his name. In a fight, Sam would have to work hard to defeat him. He’d do it, though. Damn right.\u003c/p\u003e\n\u003cp\u003eSam sized up his replacement in a split second. He didn’t know where he’d ever seen anyone quite so handsome. A movie poster perhaps? These weren’t the usual features of a guy who worked as a bodyguard. His profile was too chiseled, too flawless. Where were the scars, the leathery skin, the bags under the eyes from the late nights on watch? He had to be an actor or a model. Maybe he was just doing this part-time until he got a part in the next big action adventure flick.\u003c/p\u003e\n\u003cp\u003eBrick extended his hand and flashed a smile with his perfect white teeth, and that was all the convincing Sam needed. There was no way Lyra could be safe with anyone like him.\u003c/p\u003e\n\u003cp\u003eSam shook Brick’s hand, then gave him a firm pat on the shoulder as he turned him around and told him there had been a mistake; Lyra didn’t need him after all. Thanking him for his trouble, Sam sent the bewildered Brick on his way.\u003c/p\u003e\n\u003cp\u003eYawning, Sam went into the kitchen and poured himself a glass of orange juice and gulped it down. Sex with Lyra had dehydrated him. He smiled, thinking about that. He could stay one more day, maybe even catch the men who were after her. Then he wouldn’t have to worry about her when he went back to D.C.\u003c/p\u003e\n\u003cp\u003eYeah, that was a plan.\u003c/p\u003e\n\u003cp\u003eHe took a cold bottle of water upstairs and set it on the night-stand for Lyra, then stripped out of his slacks and slipped into bed beside her. Her back was to him, so he pulled her up against him, draped one arm over her waist, and fell asleep for another couple of hours.\u003c/p\u003e\n\u003cp\u003eIT WAS CLOSE TO ten o’clock when Lyra finally awoke. She reached for Sam’s side of the bed, but it was empty, yet she could feel the warmth where he had lain. She closed her eyes and listened. There was no noise coming from the rest of the house. Sam was gone. No surprise there. He had told her he would be gone in the morning. That’s what all the wonderful good-bye sex was about.\u003c/p\u003e\n\u003cp\u003eShe fought off melancholy, and then sank into a deep sadness, followed by painful regret, and finally indignant anger. How dare he leave? Okay, maybe he had to, but he could have told her … what? He’d come back? That would have been a lie, and Sam had been up front from the very beginning.\u003c/p\u003e\n\u003cp\u003eA long shower didn’t make her feel any better. By the time she’d blown her hair dry, she’d made up her mind to move forward. If he could leave her that easily, then she hadn’t meant anything more to him than a night of sex.\u003c/p\u003e\n\u003cp\u003e“Glad to be rid of him,” she muttered. As she applied lip gloss, she looked in the mirror and added, “Damn glad.”\u003c/p\u003e\n\u003cp\u003eToo bad she couldn’t believe her own lie.\u003c/p\u003e\n\u003cp\u003eTime to go downstairs and meet the new bodyguard. She shoved her laptop in her backpack, unplugged her cell phone from the charger, and went downstairs. Dropping her backpack by the sofa, she crossed to the kitchen.\u003c/p\u003e\n\u003cp\u003e“Hello,” she called.\u003c/p\u003e\n\u003cp\u003eShe came around the corner and stopped cold. Sam was leaning against the counter drinking from the milk carton. Her mouth dropped open. “You’re here.”\u003c/p\u003e\n\u003cp\u003eThe way he looked at her made all the memories of what happened last night rush into her thoughts. Her heart was racing. She wanted to throw her arms around him and tell him how happy she was to see him, but she couldn’t let him see her vulnerability.\u003c/p\u003e\n\u003cp\u003eShe reached for the carton in his hand and casually took a swig of the milk. “You were supposed to be gone this morning,” she said.\u003c/p\u003e\n\u003cp\u003e“Replacement didn’t work out,” he told her with a shrug. He took the carton away from her and set it on the counter, then pulled her into his arms and kissed her.\u003c/p\u003e\n\u003cp\u003eA phone rang.\u003c/p\u003e\n\u003cp\u003eSam pulled back and said, “Mine or yours?”\u003c/p\u003e\n\u003cp\u003e“Mine,” Lyra said with a sigh.\u003c/p\u003e\n\u003cp\u003eShe went into the living room, fished her phone out of her bag, and looked at the caller ID. “Oh, no,” she groaned.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Sam called from the kitchen.\u003c/p\u003e\n\u003cp\u003e“It’s Father Henry,” she answered. “My grandmother must be at it again.”\u003c/p\u003e\n\u003cp\u003eSam watched Lyra’s expression turn from one of irritation to one of fear as she listened to what the priest was telling her. When the conversation was over, she dropped her phone in her bag and said, “I need to go to San Diego.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Now.”\u003c/p\u003e\n\u003cp\u003e“Okay. Tell me why. What’s happened?”\u003c/p\u003e\n\u003cp\u003eLyra threaded her fingers through her hair. “I need to pack and get going.”\u003c/p\u003e\n\u003cp\u003eWhen she tried to get past him, he stopped her. “Tell me,” he repeated calmly.\u003c/p\u003e\n\u003cp\u003e“I thought Father was calling about the holy water.”\u003c/p\u003e\n\u003cp\u003e“The what?”\u003c/p\u003e\n\u003cp\u003e“The holy water from the font in the church. Gigi—my grandmother—steals a little every now and then.”\u003c/p\u003e\n\u003cp\u003e“I see,” he said, though he honestly didn’t have a clue.\u003c/p\u003e\n\u003cp\u003e“This time it wasn’t about the holy water, though she did take a little for her petunias.”\u003c/p\u003e\n\u003cp\u003eWhat was Lyra talking about? Sam figured he’d get a fuller explanation when they were in the car. She was too upset to be coherent. All he needed now were the basic facts.\u003c/p\u003e\n\u003cp\u003e“What was the priest’s main concern if it wasn’t the water?”\u003c/p\u003e\n\u003cp\u003e“He was having lunch with Gigi. He loves her cooking, so she’d invited him over for lunch.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“He told me he was sitting on the porch swing enjoying his iced tea when a car drove by very slowly. He noticed the man in the passenger seat was looking intently at Gigi’s house. A couple of minutes later, it drove by again. Father tried to get the license plate number, but there was mud smeared all over it. He thought they might have done that on purpose. Alarmed, he went inside and stood by the window to watch. And sure enough, the car came by again. This time one of the guys in the car got out and looked in Gigi’s mailbox. Father rushed outside and shouted at him to leave the mailbox alone; it was private property. The man yelled back that he was looking for the Prescott house. He said the Prescott woman was going to be sorry she messed with them. They drove away when Father shouted that he was calling the police.”\u003c/p\u003e\n\u003cp\u003e“Did he call them?” Sam asked.\u003c/p\u003e\n\u003cp\u003e“No, he called me. He promised to always call me first.”\u003c/p\u003e\n\u003cp\u003eSam wanted to find out why she had gotten the priest to make such a promise, but he would wait until she was calmer to ask. Lyra’s hands were shaking now.\u003c/p\u003e\n\u003cp\u003e“You do know you’re not going anywhere without me.”\u003c/p\u003e\n\u003cp\u003e“I assumed Alec was sending another bodyguard.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow. I’m staying until tomorrow. Then you’ll get a new one.”\u003c/p\u003e\n\u003cp\u003e“Even if I’m at my grandmother’s house?”\u003c/p\u003e\n\u003cp\u003e“Yes, even then.”\u003c/p\u003e\n\u003cp\u003e“Are you upset that you had to stay?”\u003c/p\u003e\n\u003cp\u003e“I don’t get upset,” he scoffed. “It’s just a minor change in schedule, that’s all.”\u003c/p\u003e\n\u003cp\u003eLyra ran upstairs. Since she had a closet full of clothes at home with Gigi, she didn’t have to pack much.\u003c/p\u003e\n\u003cp\u003eSam had his bag and was waiting for her in the living room when she came back down. She hurried into the kitchen and tossed a few candy bars into the zippered compartment on the side of her over night case. Finally pausing for breath, she said, “Okay. Let’s go.”\u003c/p\u003e\n\u003cp\u003eTraffic was slow, and the drive to San Diego seemed to take forever. Lyra’s impatience to see her grandmother grew with every mile. When they were about an hour out of Los Angeles, her cell rang. The call came from her grandmother’s phone, so Lyra hurriedly answered.\u003c/p\u003e\n\u003cp\u003e“Lyra, dear, it’s Gigi,” her grandmother said.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” Lyra asked.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she assured her. “Father Henry had to get back to the church, but Harlan Fishwater is here doing some work. Father Henry made him promise to stay until you arrived. I really don’t think that’s necessary. I’m perfectly capable of taking care of myself.”\u003c/p\u003e\n\u003cp\u003e“Gigi, I’m on my way and will be there soon. Promise me you won’t send Harlan away until I get there.”\u003c/p\u003e\n\u003cp\u003e“All right, I promise. But don’t hurry. There’s nothing to worry about. I told you, I’m fine.”\u003c/p\u003e\n\u003cp\u003eGigi hung up the phone, and Lyra slumped back against the car seat. While relieved that her grandmother was so calm, she couldn’t help but worry about her.\u003c/p\u003e\n\u003cp\u003eShe looked at Sam. “Gigi said not to hurry. She can take care of herself.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a strong woman,” Sam said.\u003c/p\u003e\n\u003cp\u003e“Yes, she is,” Lyra agreed.\u003c/p\u003e\n\u003cp\u003eShe thought for a minute, then said, “Sam, the man shouting at Father Henry said that the Prescott woman was going to be sorry she messed with them. He had to mean me, right? The two men who broke into my apartment were looking for something. They think I took whatever it was to Gigi’s.”\u003c/p\u003e\n\u003cp\u003e“It adds up,” he admitted.\u003c/p\u003e\n\u003cp\u003e“Obviously they’re looking for something of value,” she continued. “At least to them.”\u003c/p\u003e\n\u003cp\u003e“You said you didn’t have anything of value for them to take,” he reminded her.\u003c/p\u003e\n\u003cp\u003eLyra sat up straight, as though a light had suddenly been turned on in her head. “But I did,” she said. “The books.”\u003c/p\u003e\n\u003cp\u003e“The books from the yard sale?”\u003c/p\u003e\n\u003cp\u003e“Yes, they were very valuable. I don’t know how much they were worth, but a signed first edition of a classic sells for thousands of dollars. It makes sense now. They want the books back.”\u003c/p\u003e\n\u003cp\u003e“Why would they think your grandmother has them?” he asked.\u003c/p\u003e\n\u003cp\u003e“After the yard sale, I drove to San Diego.” She paused as the realization hit her. “Oh my God. They followed me.”\u003c/p\u003e\n\u003cp\u003eTWENTY-SIX\u003c/p\u003e\n\u003cp\u003e“TELL ME ABOUT YOUR FAMILY,” SAM SAID AS HE WEAVED THEIR car through traffic. “Wasn’t all that in my file? And by the way, how long has there been a file on me?”\u003c/p\u003e\n\u003cp\u003e“Since the break-in at your apartment.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You sound disappointed.”\u003c/p\u003e\n\u003cp\u003e“You should get in the other lane.”\u003c/p\u003e\n\u003cp\u003eThey were getting close to the turnoff for Gigi’s house, and Lyra was finally beginning to relax. It wouldn’t be long before she could see for herself that her grandmother was okay.\u003c/p\u003e\n\u003cp\u003e“We’ve already talked about my family. Two brothers, a grandmother who raised us … what more do you want to know?”\u003c/p\u003e\n\u003cp\u003e“When did your parents officially become ‘those people’?”\u003c/p\u003e\n\u003cp\u003e“When they tried to have my grandmother declared incompetent. You see, the two of them had gone through an extremely generous trust fund my grandfather left for his only son, and now they’re stuck having to live on a budget. That cramps their style.”\u003c/p\u003e\n\u003cp\u003e“What about the ranch?”\u003c/p\u003e\n\u003cp\u003e“My grandfather gave it to my brothers and me before he died.”\u003c/p\u003e\n\u003cp\u003e“Then what kind of work does your father do?” he asked.\u003c/p\u003e\n\u003cp\u003e“He doesn’t. He golfs and has meetings. They’re very social people.”\u003c/p\u003e\n\u003cp\u003e“They’re your parents, and you love them no matter what.” Sam phrased this matter-of-factly, yet a question was implied.\u003c/p\u003e\n\u003cp\u003e“Not when they’re hurting my grandmother … for money of all things.”\u003c/p\u003e\n\u003cp\u003e“How do your brothers feel about all of this?”\u003c/p\u003e\n\u003cp\u003eLyra smiled. “Gigi raised them, too. There’s no way they’ll let her be put somewhere. It’s nice to have them on my side. Turn right at the light,” she instructed. “Since you’re an only child, I’ll bet you’re close to your parents.”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“Were you ever lonely as a child?”\u003c/p\u003e\n\u003cp\u003e“At times. What about you? The only girl …” \u003c/p\u003e","sourceLink":"https://allnovel.net/sizzle-buchanan-renard-8/page-21.html","bookId":1829,"creation":"Oct 5, 2019 5:31:17 PM","modification":"Oct 5, 2019 5:31:17 PM"}
