{"id":88794,"no":26,"title":"Page 26","content":"\u003cp\u003e“I found them … the boxes with the books and DVDs and a few CDs.”\u003c/p\u003e\n\u003cp\u003e“Hold on. Charlie, Stack, Milo found them. You don’t need to help him. Yes, Milo found them,” he repeated, giddy with excitement.\u003c/p\u003e\n\u003cp\u003eWhen Mr. Merriam had repeated the news to Charlie and Stack, Milo assumed he did so because they didn’t believe him. Didn’t those two goons think he was smart enough to find them on his own?\u003c/p\u003e\n\u003cp\u003e“Good job,” Mr. Merriam told Milo. “I can always count on you.”\u003c/p\u003e\n\u003cp\u003ePhone to his ear, Milo was fuming. So now Charlie and Stack got to sit around in the boss’s office. What was next? Lunches together? Milo couldn’t help but be jealous. He should be sitting in that office having lunch. Not those two losers. He held his tongue and didn’t tell Mr. Merriam how he felt, reminding himself that Lyra was more important, and he was doing this for her. Getting on the boss’s bad side might mess up his plan.\u003c/p\u003e\n\u003cp\u003e“I looked through every book in case the DVD was stuck in one of them, and I looked at every DVD, and they’re all like the labels say, just movies and stuff. I’m thinking your DVD got burned up in Rooney’s house.”\u003c/p\u003e\n\u003cp\u003e“I hope you’re right. Where did you find them?”\u003c/p\u003e\n\u003cp\u003eMilo wasn’t prepared for that question. “Where did I find them?” he repeated to stall for time. “In her grandmother’s garage.” Just in case Charlie and Stack had gone into that garage and looked for themselves, he blurted, “I was thorough in my search. They weren’t where anyone else could find them.”\u003c/p\u003e\n\u003cp\u003e“Excellent work,” Mr. Merriam said. “Bring them to the office tomorrow morning. I’ve got an appointment tonight, or I’d have you bring them now.”\u003c/p\u003e\n\u003cp\u003e“Bring what?”\u003c/p\u003e\n\u003cp\u003e“The books and DVDs.” Mr. Merriam chuckled. “What else did you think I wanted?”\u003c/p\u003e\n\u003cp\u003eMilo forced a laugh. “I was joking. See you in the morning.”\u003c/p\u003e\n\u003cp\u003eHe disconnected the call and scratched his head. Now where was he going to find old books and DVDs?\u003c/p\u003e\n\u003cp\u003eTHIRTY-TWO\u003c/p\u003e\n\u003cp\u003eLYRA WAS IN GOOD SPIRITS WHEN THEY GOT BACK INTO THE car. She had her subject for her film project now, and with Father Henry’s help getting the parents of the first graders to sign permission slips, she could start filming as early as next week or the week after, assuming she finished the script in time and met the first deadline.\u003c/p\u003e\n\u003cp\u003e“Did you see how happy those children were?” she asked Sam.\u003c/p\u003e\n\u003cp\u003e“I saw how happy Father Henry was when you handed him that check. I thought he was going to do a backflip in that dress he was wearing.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “It’s called a cassock.” The thought of the priest doing gymnastics made her laugh again.\u003c/p\u003e\n\u003cp\u003e“I also saw how much fun you were having with those children. What were they doing?”\u003c/p\u003e\n\u003cp\u003e“Playing a game they had made up, and I was having fun.”\u003c/p\u003e\n\u003cp\u003e“When do you have to have this film project done?”\u003c/p\u003e\n\u003cp\u003e“I reread the rules to be certain,” she said. “My script must be postmarked no later than the fifth. That’s a Friday. If it makes the top five, then I’ll be notified, and I have another week to send the film.”\u003c/p\u003e\n\u003cp\u003eSam got on the entrance ramp to the highway. “How long do you have to wait to find out if you’re in the top five?”\u003c/p\u003e\n\u003cp\u003e“Up to six weeks. So I have to have a film ready.”\u003c/p\u003e\n\u003cp\u003e“At least this time you won’t have to breathe toxic fumes.”\u003c/p\u003e\n\u003cp\u003e“True, and I’ll have more fun with this one, too. I’m surprised Mahler gave me this opportunity. I’m hardly one of his favorite students.”\u003c/p\u003e\n\u003cp\u003eA few miles later, she asked, “Did anyone drive by the house last night?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Were you watching?”\u003c/p\u003e\n\u003cp\u003eA quick smile, then, “Yes.”\u003c/p\u003e\n\u003cp\u003e“Why do you think they didn’t come back?” She said it as though a dinner guest had rudely not shown up.\u003c/p\u003e\n\u003cp\u003e“Maybe there was too much traffic coming and going at the house,” he said. He reached over and patted her hand. “Don’t worry. They aren’t going to disappear. They’ll be back.”\u003c/p\u003e\n\u003cp\u003e“That isn’t comforting news.” She crossed one leg over the other, and Sam automatically looked and appreciated how long they were. He remembered how they’d felt around him when he was inside her … He cleared his throat. How often did psychiatrists say a man thought about sex? Every ten seconds? Twelve? Since he’d met Lyra, it was simply all the time.\u003c/p\u003e\n\u003cp\u003e“Let’s concentrate on what we know,” he said. “We know there have been at least four different men trying to kill you. Two are in jail without bail, and then there are the two who broke into your apartment. They also could be the two who drove by Gigi’s house. Mind you, that’s just a guess.”\u003c/p\u003e\n\u003cp\u003e“I hope it’s true. Otherwise, I would have six men trying to kill me.” She looked up with a weak smile. “You don’t suppose someone’s out recruiting killers just for me, do you?”\u003c/p\u003e\n\u003cp\u003eHe laughed as he switched lanes. “No, I don’t think so.”\u003c/p\u003e\n\u003cp\u003eHer expression turned somber again. “What did I ever do to any of them?”\u003c/p\u003e\n\u003cp\u003e“I’m sure it isn’t personal. We know the two in jail work for Michael Flynn.\u003c/p\u003e\n\u003cp\u003e“He’s an Irish immigrant, and he’s been head of an organized crime family in L.A. for a long time. They’re into money laundering, prostitution, graft, but no drug trafficking, as far as we know. Up until now, he’s been able to lawyer his way out of any charges leveled against him. Detective O’Malley told me Flynn is willingly going down to the station for questioning.”\u003c/p\u003e\n\u003cp\u003e“I want to be there when they talk to him. Is that possible?”\u003c/p\u003e\n\u003cp\u003e“I don’t see why not. You can watch and listen through the glass, but you can’t say anything to him or let him see you.”\u003c/p\u003e\n\u003cp\u003e“So shooting him would be out of the question.”\u003c/p\u003e\n\u003cp\u003e“That’s my job, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“Do you think he’ll tell us anything?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then why bother?”\u003c/p\u003e\n\u003cp\u003e“Because Detective O’Malley wants to give Flynn some information. See what he does with it. We know who most of his business associates are, so maybe he’ll give us some leads.” Sam got on the phone and made arrangements for them to be there for Flynn’s interview.\u003c/p\u003e\n\u003cp\u003eWhen he finished his call, Lyra switched topics. “Why can’t I go back to my apartment? With a bodyguard at my side—”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe prodded. “Why?”\u003c/p\u003e\n\u003cp\u003e“I want to sleep through the night without getting blown up. There are other tenants to consider as well. It’s better if no one knows where we’re staying.”\u003c/p\u003e\n\u003cp\u003eHe had a valid point. She didn’t want anyone to get hurt. “Okay,” she said.\u003c/p\u003e\n\u003cp\u003e“Do you need something from your apartment?”\u003c/p\u003e\n\u003cp\u003e“No. I packed clean clothes from my closet at Gigi’s house.”\u003c/p\u003e\n\u003cp\u003e“So we don’t need to go back to campus?”\u003c/p\u003e\n\u003cp\u003e“Not today, but …” She knew he wasn’t going to like what came next. “I have to switch out the memory card at the park.”\u003c/p\u003e\n\u003cp\u003e“Hell, no,” he said. “We’re not going back there.”\u003c/p\u003e\n\u003cp\u003e“Sam …”\u003c/p\u003e\n\u003cp\u003e“I know you’re curious, and you want to find out who’s planting flowers—”\u003c/p\u003e\n\u003cp\u003e“It’s more than curiosity,” she argued. “I might want to do something with it in the future. A short film maybe. Just let me shoot another week.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“All I’m asking for is a week, and then I’ll dismantle and be done.”\u003c/p\u003e\n\u003cp\u003e“No,” he repeated, his voice firmer.\u003c/p\u003e\n\u003cp\u003e“What if I bought new camera equipment and replaced what I have at the park? I could get something with more memory and a longer battery life. It could record for a couple of weeks and I wouldn’t have to go back and forth so often.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you get that in the first place so you wouldn’t have to climb around in that garbage?”\u003c/p\u003e\n\u003cp\u003e“I wanted to use my camera. It takes such clear pictures. But I’m willing to change if you’ll just let me go to the park a couple of times.”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it.”\u003c/p\u003e\n\u003cp\u003eFrustrated, she shifted in her seat. “Sam, I’m afraid I’m going to have to pull rank on you. A bodyguard’s job is to protect. He doesn’t set the schedule. I’m going to that park with or without you.”\u003c/p\u003e\n\u003cp\u003eHe didn’t laugh at her, but she could see amusement on his face as he kept his eyes on the road. “Ah, that’s sweet.”\u003c/p\u003e\n\u003cp\u003e“What is?” she asked suspiciously.\u003c/p\u003e\n\u003cp\u003e“You, thinking you can pull rank.”\u003c/p\u003e\n\u003cp\u003eOkay, she had been bluffing, but did he have to get such a kick out of it? Lyra stared out the window at the landscape while she made a mental list of what she could be doing to help the investigation. As they arrived in L.A., her thoughts kept returning to the yard sale. She firmly believed whoever was trying to kill her was somehow connected to that yard sale. The man the shooters worked for, this Flynn, must think she had something that belonged to him. When she mentioned that to Sam for a second time, he shook his head.\u003c/p\u003e\n\u003cp\u003e“There was nothing in those boxes that would warrant this, remember?”\u003c/p\u003e\n\u003cp\u003e“But maybe they think there was.”\u003c/p\u003e\n\u003cp\u003eSam leaned his elbow on the armrest between them. She took his hand and traced the scars on his arm. “Did you get these when you went through the window to help Alec?”\u003c/p\u003e\n\u003cp\u003e“No, those are rugby scars.”\u003c/p\u003e\n\u003cp\u003eShe thought he was making that up until he held up his other arm. “I got these scars when I went through the window.”\u003c/p\u003e\n\u003cp\u003e“This arm is much worse,” she said, touching his right arm. “You don’t play rugby anymore, do you?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I do. It’s a great way to let off steam.”\u003c/p\u003e\n\u003cp\u003e“You’re too … calm, too relaxed to play such a rough game. Rugby players are aggressive. They’re …” She stopped before she offended him.\u003c/p\u003e\n\u003cp\u003e“They’re what?” he pressed as he pulled into the police station parking lot.\u003c/p\u003e\n\u003cp\u003e“Brutal,” she said. “On the field,” she qualified.\u003c/p\u003e\n\u003cp\u003eHe laughed. “Yeah, I guess you’re right.”\u003c/p\u003e\n\u003cp\u003eSam parked the car and walked close to her until they were inside.\u003c/p\u003e\n\u003cp\u003e“O’Malley’s upstairs,” a policeman who recognized Sam called out.\u003c/p\u003e\n\u003cp\u003eThe second floor of the police station was wide open with desks in three rows. Detectives sat at computers. Some were taking statements from people who sat in front of them, and others were dealing with suspects handcuffed to their chairs. Two unsavory men sat against the wall with their hands cuffed behind their backs. They were conversing in a language Lyra didn’t recognize.\u003c/p\u003e\n\u003cp\u003e“Get those two in an interrogation room,” a detective shouted to no one in particular. “The Russian interpreter is on his way.”\u003c/p\u003e\n\u003cp\u003eSam listened to the two men snickering and mocking the detective. Then one of them said something that made him smile. When Lyra slowed down to look around the large room, Sam took her hand and pulled her along. Detective O’Malley was in a glass office at the end. Spotting them, he hurried out. After asking Lyra how she was holding up, he turned to Sam. “Flynn should be here in about fifteen minutes. You’re early.”\u003c/p\u003e\n\u003cp\u003e“Good. Lyra can look at the footage from the campus security cameras.”\u003c/p\u003e\n\u003cp\u003e“No problem. I’ll pull it up.”\u003c/p\u003e\n\u003cp\u003eO’Malley went to his computer and brought the security video onto the screen. The parking lot came into view. It showed routine movement of people and cars, nothing unusual. O’Malley pointed to the upper-right-hand corner and said, “There he is.”\u003c/p\u003e\n\u003cp\u003eLyra leaned close. The picture wasn’t clear, but she could make out a dark figure circling their car. His head was covered by the hood on his raincoat. He dropped down beside the car for a couple of seconds and then stood up and strolled away.\u003c/p\u003e\n\u003cp\u003eO’Malley reversed the video to the spot where the man had disappeared and said, “Here’s where he’s planting the bomb.”\u003c/p\u003e\n\u003cp\u003eLyra shook her head. “I can’t see his face. I don’t know who he is.”\u003c/p\u003e\n\u003cp\u003eA policeman stuck his head in the door. “Flynn’s on his way up.”\u003c/p\u003e\n\u003cp\u003eO’Malley shut down the computer and led the way through the office.\u003c/p\u003e\n\u003cp\u003eWhen they walked by the detective who had called for the interpreter, Sam paused to read the name on the desk and said, “Detective Muren, those men you want to interrogate aren’t speaking Russian.”\u003c/p\u003e\n\u003cp\u003eMuren didn’t bother looking up. “I’ve got it covered. Thanks.”\u003c/p\u003e\n\u003cp\u003eSam had a bit more vital information the detective should hear, but he didn’t tell him. He knew Muren would be coming around in a little while.\u003c/p\u003e\n\u003cp\u003eWhile O’Malley entered the interrogation room, Lyra followed Sam into the observation room and stood in front of the window. They watched two men enter. The taller man handed his card to O’Malley and introduced himself as Mr. Flynn’s attorney. He sat next to his client.\u003c/p\u003e\n\u003cp\u003eMichael Flynn was a strange-looking man. He had more hair sprouting out of his ears than on his head. Lyra didn’t know why she had assumed Flynn was an old man, but he looked to be in his fifties.\u003c/p\u003e\n\u003cp\u003e“Lyra, have you ever seen him before?” Sam asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Absolutely not. Trust me, I’d remember.”\u003c/p\u003e\n\u003cp\u003eThe gigantic ring on his pinky finger drew her attention to his manicured nails, and his suit appeared to be Italian, probably hand-tailored. He could be the poster boy for “Crime Pays,” she thought.\u003c/p\u003e\n\u003cp\u003e“He’s Irish,” she commented.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThere was a tap on the door, and the detective who had given Sam the brush-off entered the room. “Sir, do you have a minute?”\u003c/p\u003e\n\u003cp\u003eSam turned to him. “Yes?”\u003c/p\u003e\n\u003cp\u003e“I’d like to apologize for being rude.” He put his hand out to shake Sam’s and introduced himself. “Detective Muren. Bill Muren. I know who you are. Three guys out there told me already. They also called me a …” He stopped when he realized Lyra was listening.\u003c/p\u003e\n\u003cp\u003eSam shook his hand but didn’t say anything more.\u003c/p\u003e\n\u003cp\u003e“It’s been a bad day,” Muren said. “Those two creeps have given me a run for my money. If they’re not speaking Russian, then what are they speaking?”\u003c/p\u003e\n\u003cp\u003e“Czech,” he said.\u003c/p\u003e\n\u003cp\u003e“It sounded Russian. Could someone who knows Russian interpret?”\u003c/p\u003e\n\u003cp\u003e“Not necessarily. There are similarities in the two, but they’re different languages.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t happen to speak Czech, would you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/sizzle-buchanan-renard-8/page-26.html","bookId":1829,"creation":"Oct 5, 2019 5:31:17 PM","modification":"Oct 5, 2019 5:31:17 PM"}
