{"id":111606,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMercy said, “I do, please.” She retrieved her handbag from inside the satchel, praising Jesus quietly for her habit of keeping it there. It could easily have been lost with the rest of her luggage.\u003c/p\u003e\n\u003cp\u003eThe man looked up at her. He was wearing a headband with a magnifying lens attached to it that hung down over his right eye. His face was shaped like a potato, and was approximately as charming.\u003c/p\u003e\n\u003cp\u003e“Where’s your husband?”\u003c/p\u003e\n\u003cp\u003e“Dead, in a field someplace in Georgia,” she answered flatly. “I’m on my own.”\u003c/p\u003e\n\u003cp\u003e“A woman traveling alone,” he observed, and lifted the edge of his nose in a distasteful sneer. “We don’t cotton to those, too much. Not here. This ain’t that kind of establishment.”\u003c/p\u003e\n\u003cp\u003eShe said, “And I ain’t that kind of client, so we don’t have a problem. I’m a nurse, passing through to Memphis. I’m on my way from the Robertson Hospital in Richmond,” she tried, since that place had opened doors for her before.\u003c/p\u003e\n\u003cp\u003e“Never heard of it.”\u003c/p\u003e\n\u003cp\u003e“Oh, for heaven’s sake . . .”\u003c/p\u003e\n\u003cp\u003e“You got any paperwork?”\u003c/p\u003e\n\u003cp\u003e“Course I do.” She rummaged through the satchel, with its logo that did nothing to melt the heart of the hotelkeeper, and found the letter from Captain Sally. She showed it to him, and he made a show of reading it.\u003c/p\u003e\n\u003cp\u003e“All right, then, I guess. But you pay up front.”\u003c/p\u003e\n\u003cp\u003e“Here.”\u003c/p\u003e\n\u003cp\u003e“Fine.” He counted it, taking his time with every coin and bill. He handed her a key. “Room eleven. First floor. The hallway to your right.”\u003c/p\u003e\n\u003cp\u003eShe forced herself to say, “Thank you,” and went immediately to her room.\u003c/p\u003e\n\u003cp\u003eThe room was bare but clean, with a bed, a dresser, a basin in the corner, and, attached to one wall, a slab of polished tin for a mirror. A note on the back of the door told her where the pump was located, so before she settled in, Mercy went out into the center courtyard to the public pump and filled the basin, then carried it back to her room and pulled off everything except her underclothes.\u003c/p\u003e\n\u003cp\u003eA slim bar of butter-​colored soap rested under the mirror.\u003c/p\u003e\n\u003cp\u003eShe used it to scrub down everything, rinsing the worst of the blood and muck out of her apron, and out of the dress beneath it where it’d soaked through. When she was done, she hung everything up around the room to dry, then dropped herself down onto the bed, which caught her with a puff of cheap, flattened feathers.\u003c/p\u003e\n\u003cp\u003eBy the time she awoke, it was late afternoon, and very, very bright. The mountain’s shadow lay long and sharp across the south side of the city, which churned and rolled with trains from every part of the Confederacy.\u003c/p\u003e\n\u003cp\u003eMercy was fiercely hungry. She couldn’t remember when she’d last eaten, except that it must’ve been in Richmond. After reassuming clothes that were mostly dry, if not quite, she went out into the lobby and found a different man behind the counter. The new fellow’s face was shaped more like a radish than a potato, and the pinched expression he wore conveyed nearsightedness more than malice.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” Mercy asked him. “Could you tell me what time it is?”\u003c/p\u003e\n\u003cp\u003e“That way, ma’am.” He pointed over her head, and when she followed his finger, she saw an enormous clock. He didn’t try to call out the time, which reinforced her suspicion.\u003c/p\u003e\n\u003cp\u003eSo she said aloud, “Ten minutes until six. I understand there’s a supper included at six thirty?”\u003c/p\u003e\n\u003cp\u003e“That’s right, ma’am. It’s served in the ballroom, down the west wing. Second door to the left.” He lowered his voice. “But if I were you, ma’am, I’d wait until six thirty on the nose. Mr. and Mrs. Ferson don’t take too kindly to those who ‘vulture,’ as they’re keen to put it.”\u003c/p\u003e\n\u003cp\u003e“Thank you, then. For that information, I mean. And could I ask you another question?”\u003c/p\u003e\n\u003cp\u003e“By all means, ma’am.”\u003c/p\u003e\n\u003cp\u003e“Could you please direct me to a notions store, or a general goods establishment? I’m afraid my—well, most of my luggage was lost, and I’ll need to replace some things.”\u003c/p\u003e\n\u003cp\u003eHe said, “Absolutely. On the next block over, to the left around the corner, you’ll find Halstead’s. If you can’t find everything you need there, I’m certain that a clerk can point you someplace else.”\u003c/p\u003e\n\u003cp\u003eShe thanked him and turned away from the counter, finding her way back out the front door and into the street, where the city looked strangely sharp—filed that way against the long, lingering rays that cut past the mountain and the ridges. Fort Chattanooga was a bustling place, filthy and disorganized. And the fort was furthermore augmented by the addition of city walls where the natural boundaries failed to provide adequate protection against incoming marauders.\u003c/p\u003e\n\u003cp\u003eHalstead’s was the promised block away.\u003c/p\u003e\n\u003cp\u003eIt had a cut-​stone front with the establishment name chiseled therein in roman block letters, and a window with printed script scrawled from corner to corner, detailing the day’s specials.\u003c/p\u003e\n\u003cp\u003eMercy pressed the door open and let herself inside.\u003c/p\u003e\n\u003cp\u003eShe found rows of goods precisely ordered and carefully stacked, divided into all the expected categories. She picked up a basket from the door’s entrance and a few of the essentials she’d lost: a comb, some gloves, a bar of soap that wouldn’t make her skin dry and itchy, a toothbrush and some baking soda to mix into a paste, some fabric for sanitary rags, a small sewing kit, a spare pair of stockings, and a handful of other small items that would fit in the large medical satchel—since she didn’t feel the need for another portmanteau and she probably couldn’t afford it, anyway. What she was carrying would have to suffice. If she had enough money left over for new clothes, she’d see about getting some in Tacoma.\u003c/p\u003e\n\u003cp\u003eAfter paying the man behind the counter, she returned outside to the busy street with its narrow wooden walkways—or, sometimes, no walkways at all.\u003c/p\u003e\n\u003cp\u003eWhen she emerged into the street again, it was almost thoroughly dark, though the sky was still orange around its western edge. Low, tree-​smattered mountains, jagged ridges, and the man-​made corners of walls had cut off the last of the winter afternoon light, and lamps were coming up everywhere. They popped and fizzed into a white, incandescent glow as a pair of small brown boys in clean gray uniforms took an L-​shaped key and removed a panel at the base of the light, then flipped a switch therein. One by one they lit the street this way.\u003c/p\u003e\n\u003cp\u003eOn the nearest corner, a stack of the morning’s leftover newspapers was being gathered up for disposal, and a stand for periodicals was closing up and being disassembled. Mercy approached the newspaper stack and the red-​haired teenager who was lifting the remaining bundles onto the waste cart. She asked, “Can I buy one off you?”\u003c/p\u003e\n\u003cp\u003eHe said, “It’s late. May as well wait for the next edition; it’ll come up in a few hours.”\u003c/p\u003e\n\u003cp\u003eShe looked back and forth between him and the round-​bellied man who was hefting the magazines and street literature into his cart. Then she asked, “Will you be here in a few hours? It looks like you’re leaving.”\u003c/p\u003e\n\u003cp\u003eThe kid shifted his eyes sideways, and brought them back to her, but he wore them lidded and wary. He told her, “I don’t rightly know. Things are about to get messy, I think.”\u003c/p\u003e\n\u003cp\u003e“You think?”\u003c/p\u003e\n\u003cp\u003e“Well, that’s what I heard.”\u003c/p\u003e\n\u003cp\u003eThe fat man on the waste cart caught just enough of this to join the conversation. “Ma’am, I don’t know what you’re doing here—if you missed a train or if you’re just passing through, or whatever reason you’re lingering on the southside all by your lonesome—but wherever you’re going, you might want to head there sooner rather than later.”\u003c/p\u003e\n\u003cp\u003e“The line,” she guessed.\u003c/p\u003e\n\u003cp\u003eHe nodded. “It’s coming, one way or t’other. Our boys is gonna hole up here, set up the city for siege and response. Don’t you worry, though. They won’t take Chatty down. I think they know it, too. I don’t know what they’s trying to prove by bumping up against us like this, but it’s all right if they want to get theyselves killed.”\u003c/p\u003e\n\u003cp\u003e“I heard they brought a walker to the fight last night,” Mercy fished.\u003c/p\u003e\n\u003cp\u003eHe snapped, “And we brought ours, and brought theirs down. They think they got a foothold, though, so they sneaking in around Raccoon and lining up behind Signal,” he said, meaning that the Union was creeping around from the mountains to the west and north.\u003c/p\u003e\n\u003cp\u003e“I heard they took the Dreadnought out of play,” said the boy as he went back to discarding his papers. “I heard they took it back north, or maybe east, to feed another cracker line. Maybe they won’t come no closer, not without their big old engine to beef ’em up.”\u003c/p\u003e\n\u003cp\u003eShe said, “Dreadnought. That’s the engine they used to move the walker, ain’t it?”\u003c/p\u003e\n\u003cp\u003eThe magazine man said, “Yeah, they use it to tote around their biggest war toys.” He sat on the back of the cart, dipping it lower on its axle. “You see, miss, what they done is, they built themselves the biggest, meanest engine they could imagine, and then they trussed it up with enough armor and artillery to be a real war machine. Ready to go from place to place, easy as anything else that rolls along a line.” He made a little gesture, like a man playing with a child’s cars on a carpet railway.\u003c/p\u003e\n\u003cp\u003e“It’s a monster,” said the boy.\u003c/p\u003e\n\u003cp\u003e“It’s a fine piece of engineering,” the man countered. “But it’s only an engine—and just one engine, at that. Even if they brought it here, to Fort Chattanooga, and used it to try and rout the lot of us straight back across the Georgia state line, it wouldn’t do no good.”\u003c/p\u003e\n\u003cp\u003eMercy asked, “And why is that?”\u003c/p\u003e\n\u003cp\u003eHe pointed a finger at her and said, “Because I don’t give two pebbles of squirrel shit how awesome the Dreadnought is. This-​here is the proper rail exchange for everything east of Houston and north of Tallahassee. We got enough engines here to run it out on a rail.” He chuckled at his own joke. “It can’t take on all of us, not all at once. Not here. This-​here city is made of rails, miss. It’s made of steel, and coal, and sweat, and no one train is going to come here and change nothing. ’Sides,” he added. “Monster or no, it can’t run across the street, or waltz up a rock wall and bust a line into a mountain.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-19.html","bookId":2551,"creation":"Oct 6, 2019 12:29:04 AM","modification":"Oct 6, 2019 12:29:04 AM"}
