{"id":111632,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSomeone to the right gasped, and Jasper Nichols came sidling up the aisle with his cousin in tow. He asked, “That red-​headed man shot the private?”\u003c/p\u003e\n\u003cp\u003e“That’s right. He accused the kid of some unpleasant activities, and when the boy tried to defend himself that rat-​faced, redheaded scientist picked up one of my pistols and shot him dead.”\u003c/p\u003e\n\u003cp\u003e“Berry was following orders,” Mercy said, but she said it feebly because she wasn’t really sure.\u003c/p\u003e\n\u003cp\u003eKorman said, “He might’ve been, but Christ knows whose orders he was answering to. Between you and me, Mrs. Lynch, I’m fairly sure that the boy was a spy.”\u003c/p\u003e\n\u003cp\u003e“Oh, you cannot be serious!” she said, not even bothering to whisper.\u003c/p\u003e\n\u003cp\u003e“Oh, but I surely can. I caught him staring down at those couplers one time too many. I think he’s the one who’s been trying to snap ’em. If I’d figured it out sooner, I would’ve shoved him off the train when I had the chance.”\u003c/p\u003e\n\u003cp\u003eJasper Nichols made a snort that said he thought it wasn’t likely to happen, a Texian picking a fight with a southern spy. Korman only grumbled in response. “It’s like I’ve said all along: I just want to get to Utah. Anyone standing between me and that goal . . . I’m happy to pitch or punch.”\u003c/p\u003e\n\u003cp\u003eMercy suddenly remembered that the telegram she’d read started with the letters CB. Cyrus Berry’s initials, but it simply hadn’t dawned on her at the time. They could’ve been lots of people’s initials, after all. Could’ve been Cole Byron’s. Could’ve been nobody’s.\u003c/p\u003e\n\u003cp\u003e“So here’s what we’re going to do now,” the ranger went on, waving the porters closer until their capped heads leaned up to the conversation. They huddled there in the middle of the aisle where no one had any room at all, so everybody’s shoulders touched, and everyone could smell everyone else’s breath. “You two fellows, can you bolt these doors from the inside? I know they all open out, but there’s got to be a good way to fix ’em shut.”\u003c/p\u003e\n\u003cp\u003eThey nodded. Cole said, “There’s a brace bar to the right. I can fix it.”\u003c/p\u003e\n\u003cp\u003eAs if he understood where this was going, Jasper said, “You can fix ’em from the outside, too, if you’re serious about keeping those men from coming into this car.”\u003c/p\u003e\n\u003cp\u003e“Excellent. Thinking ahead—I like to see that in a man. You two think you can do that, seal off this car from the last passenger car, the caboose, and the final car?”\u003c/p\u003e\n\u003cp\u003e“Yes sir. It’ll just take us a minute.”\u003c/p\u003e\n\u003cp\u003e“Then do it, and do it now. I’m going to make my way up front. I need to have a talk with the captain,” he said, his mouth set in a grim, angry line.\u003c/p\u003e\n\u003cp\u003eThe two porters shifted, begged pardons, and climbed past Mercy and the ranger, who all but crawled their way to the forward doors. Mercy was behind him, and she grabbed his foot in order to seize his attention. “Korman, that captain isn’t going to let you anywhere near that car up front.”\u003c/p\u003e\n\u003cp\u003e“Is that where they’re holed up? Not in the first sleeper?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said quickly, still holding on to the instep of his boot. “There’s no one in the first passenger car at all, I don’t think. But they’ll never let you inside their little fort. Hell, I only got inside because the captain got himself hurt.”\u003c/p\u003e\n\u003cp\u003eHe reached up for the door latch, gripped it, and looked back down at her. “They let you see it? What’s inside?”\u003c/p\u003e\n\u003cp\u003e“What do you care? You’ve said so yourself, and more than once, how you don’t care what goes on right now between the blues and the grays.”\u003c/p\u003e\n\u003cp\u003e“I said it, and I meant it, and I pretty much mean it still,” he said. “But this does change things.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003eHe turned the latch, and the door cracked open to allow a stream of blistering cold to billow through. It ruffled his mustache and rattled his hat, and he raised his voice so he could be heard over it. “Because until you said that, I was going to tell you to stay here. But now I think you’d better come with me. I need someone they’re less likely to shoot.”\u003c/p\u003e\n\u003cp\u003e“Goddammit, Mr. Korman.”\u003c/p\u003e\n\u003cp\u003e“You said it, ma’am,” he said, and shoved the door open far enough to rise to a stooped standing position. He dived for the next door and opened it, and Mercy was right behind him, swearing all the way.\u003c/p\u003e\n\u003cp\u003eOnce more, back along the winnowing length of the passenger cars, Mercy’s aching back and bent-​up legs carried her slowly through the tubes filled with luggage and frightened people. Finally they reached the first passenger car, which was still abandoned, though a few bullet holes in the windows gave the atmosphere a whistling howl that sounded like the singing of the dead.\u003c/p\u003e\n\u003cp\u003eHoratio Korman pulled himself into a sleeper compartment and drew Mercy along behind him. He said, “I don’t want any surprises in there. You tell me what they’ve got going on, up in that next car. What are they protecting?”\u003c/p\u003e\n\u003cp\u003e“Do you really think Cyrus Berry was a spy?” she asked, as if she hadn’t heard him.\u003c/p\u003e\n\u003cp\u003e“Yes, but I don’t think it’s what got him killed. I think Purdue believed the boy knew what was back there, and he didn’t want anyone else to get wind of it. Now, tell me, what’s going on up front?”\u003c/p\u003e\n\u003cp\u003eShe pointed a finger at his nose and said, “I’m trusting you on this.”\u003c/p\u003e\n\u003cp\u003e“You’re a damn fool. For all you know, I could’ve shot Berry myself.”\u003c/p\u003e\n\u003cp\u003e“But if you had,” she said, speaking above the wind and leaning forward, “the doctor or the porter would’ve said something, and they didn’t.” She looked him in the eyes one more time and then said, “It’s gold! Gold! They’re moving gold, tons of it.”\u003c/p\u003e\n\u003cp\u003e“Whatever the hell for?” he asked. “Surely they aren’t shoring up against a Rebel victory?”\u003c/p\u003e\n\u003cp\u003e“I don’t know why!” she insisted. As she leaned back in the seat, she heard a crumple of paper coming from her apron. She fiddled it out of the place where it’d been riding for half an hour now.\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, I found it in that car,” she said. “I can’t hardly read it, though. Do you have a light?”\u003c/p\u003e\n\u003cp\u003eHe said, “Hang on,” and opened up his coat to reveal a vest with many pockets and a holster with a large, shiny six-​shooter in it.\u003c/p\u003e\n\u003cp\u003eShe said, “I thought the porter said they’d took your guns.”\u003c/p\u003e\n\u003cp\u003e“Malverne Purdue is an idiot,” he said flatly. “He took the two I had out in front, but he didn’t search me. He may be some kind of brilliant scientist, but he doesn’t know a thing about self-​preservation.”\u003c/p\u003e\n\u003cp\u003eMercy said, “I don’t know,” for what felt like the hundredth time that day. Then she said, “He shot Cyrus Berry. That must count for something.”\u003c/p\u003e\n\u003cp\u003e“No,” said the ranger. “Because he wasn’t protecting himself. He was protecting whatever’s in that back car. And whatever’s there, he thinks it’s worth dying or killing over, and shoots like a man who believes that the law is on his side.”\u003c/p\u003e\n\u003cp\u003e“Oh, he does, does he?”\u003c/p\u003e\n\u003cp\u003e“I know it when I see it.” Out from a side vest pocket, he retrieved a device the size of his palm. It was shaped like a cucumber, one half made of metal, the other made out of glass. He pressed a button and the glass end glowed red.\u003c/p\u003e\n\u003cp\u003e“That’s . . . what’s that?”\u003c/p\u003e\n\u003cp\u003e“It’s a light for when you want a light that other folks can’t see,” he explained, taking the paper from her hands. He smoothed the sheet out across his knee and waved his device over it like a conductor’s baton. “Red light don’t show up very bright, not at a distance.”\u003c/p\u003e\n\u003cp\u003e“Fine, but what does the paper say?” she asked.\u003c/p\u003e\n\u003cp\u003e“It’s a deed.”\u003c/p\u003e\n\u003cp\u003e“Like, a property deed?”\u003c/p\u003e\n\u003cp\u003e“Yup. Printed up by Uncle Sam.”\u003c/p\u003e\n\u003cp\u003e“Whose deed is it?” she asked.\u003c/p\u003e\n\u003cp\u003e“Nobody’s yet. It’s blank. A grant to farm land in the Iowa territory.”\u003c/p\u003e\n\u003cp\u003eShe turned it around on his knee and leaned in close, trying to see for herself. “Mr. Korman, there were scores of these things, flying around in that car.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“There were . . .” She gestured wildly. “Somebody had opened a crate, by accident. The windows are all open in there, and the wind was throwing these papers around like a tornado. This one just stuck to me, that’s all.”\u003c/p\u003e\n\u003cp\u003e“And they all looked the same?”\u003c/p\u003e\n\u003cp\u003eShe said, “They were all about the same size and shape.”\u003c/p\u003e\n\u003cp\u003eThe ranger fingered the paper, crinkling it and uncrinkling it as he thought. “They’re moving money and land deeds west. But why? I don’t suppose you were able to sweet-​talk that captain out of any useful information.”\u003c/p\u003e\n\u003cp\u003e“Not a thing. Except,” she said after a pause, “that he don’t know what’s in that back car. Whatever Purdue is doing back there, it’s coming down from on high. Somebody over the captain’s head signed off on it.”\u003c/p\u003e\n\u003cp\u003e“That figures. The captain strikes me as a competent officer, and competent officers are never given enough information to work with. All right, here’s what we’re going to do: You’re going to go into that next car and bring out the captain. Tell him Berry’s dead, and I know what happened, and I want to talk to him.”\u003c/p\u003e\n\u003cp\u003e“I thought you were going to go storming the place, guns blazing or somesuch.”\u003c/p\u003e\n\u003cp\u003e“Now, when did I say that? I was going to knock on their door, but now I’ve got a better idea, and that better idea is you. Now, go on. Get him out here.”\u003c/p\u003e\n\u003cp\u003e“I’m not dragging him into a trap, am I?” she said levelly, meeting his eyes above the gleam of the red light, which still burned in his hand.\u003c/p\u003e\n\u003cp\u003e“No, you’re not dragging him into a trap. For God’s sake, woman. Just bring him out here.”\u003c/p\u003e\n\u003cp\u003eShe got up to do so, but just as she was about to stalk over to the door, a fresh battery of pops and pings reminded her that people were shooting just outside, and she should keep her head down. Stooping a bit, she grasped the latch and swung the door out, propping it there with her own body while she stretched her arm and reached for the other door. Finding it, she hauled herself across the gap, wishing for a helpful porter as she did so. Then she knocked on the door and whipped it open. \u003c/p\u003e","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-45.html","bookId":2551,"creation":"Oct 6, 2019 12:29:04 AM","modification":"Oct 6, 2019 12:29:04 AM"}
