{"id":111634,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSixteen\u003c/p\u003e\n\u003cp\u003eThe Dreadnought pulled into Denver early the next morning and parked a few extra hours for repairs. Most of the passengers debarked, all rattled and some crying, with apologies from the Union and vouchers to take other trains to their destinations. Of the original occupants of Mercy’s car, only Theodora Clay and her indomitable aunt Norene Butterfield remained; and of the passengers who’d been present when the meat-​baskets made their attack, only about a dozen opted to stick it out. Consequently, the train company would also be abandoning four passenger cars, leaving only three to house the soldiers and remaining scant passengers.\u003c/p\u003e\n\u003cp\u003eThose who remained were confined to the train while the repairs were made because the captain was insistent that they must get moving at the first possible instant after the repairs were done. The only exception was Horatio Korman, who was let off his car with the captain’s tacit approval, much to the astonishment and concern of the other enlisted men.\u003c/p\u003e\n\u003cp\u003ePurdue had stashed himself in the caboose, where he all but lived now. Like the other passengers, he stayed on board while the Denver crews replaced windows, reloaded ammunition bays, refilled boilers, and patched the most conspicuous bullet holes. He sat at that single portal to the train’s very back end and guarded it when he could, and had his right-​hand man, Oscar Hayes, keep watch over it when Purdue was occasionally compelled to sleep. Most of the pretense of law and order and chain of command had been abandoned in the last twenty-​four hours of the trip, and if Malverne Purdue had ever feigned any respect for the unit’s captain, his acting days were over.\u003c/p\u003e\n\u003cp\u003eWhile all these situations were simmering and settling, Theodora Clay came back to the second passenger car and sat across the sleeper compartment from Mercy, even though she and her aunt had moved to the other side of the aisle, given the reduction in the passenger load. She placed her hands on top of her knees, firmly gripping the fabric of her skirt as she leaned forward and said, “Things are going from bad to worse.”\u003c/p\u003e\n\u003cp\u003e“Yep,” Mercy replied carefully, for she suspected that Miss Clay was not making a social call.\u003c/p\u003e\n\u003cp\u003e“I’ve been talking to the captain,” she said. “And trying to talk to Mr. Purdue. You must be aware by now that he’s a madman. Did you hear he shot Cyrus Berry?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eHer forehead wrinkled, then smoothed. “Oh yes. They said your friend the Texian was there when it occurred. I suppose he passed the information along. Well.” She released her grip on the dress and sat up straighter while she sorted out what else she ought to share. “Anyway, as I said. Regarding Mr. Purdue.”\u003c/p\u003e\n\u003cp\u003e“A madman.”\u003c/p\u003e\n\u003cp\u003e“An armed madman, even more delightfully. He won’t move, and he won’t take tea or coffee, and he just sits, with his chair beside the door and a Winchester lying across his lap and several other guns strapped all over himself. Overkill, I’d call it, but there you go. Sane men take a more moderated approach to these things.”\u003c/p\u003e\n\u003cp\u003e“He’s not really crazy,” Mercy told her. “He’s just got a job to do, and he’s real excited about doing it.”\u003c/p\u003e\n\u003cp\u003eMiss Clay said, “Be that as it may. Do you have the faintest clue what his job might be? Because no one seems to know what’s in the last car, except that it holds the bodies of dead soldiers. And I think we ought to investigate.”\u003c/p\u003e\n\u003cp\u003e“We? You mean, you and me?”\u003c/p\u003e\n\u003cp\u003eShe said, “That’s right. You and I. For a brief and maddening minute I almost considered asking your Texian friend if he might be inclined to assist us, but for some reason or another, he seems to have vacated the train. I do pray he won’t be joining us again, but that’s neither here nor there.”\u003c/p\u003e\n\u003cp\u003e“He’ll be back. He’s picking up telegrams.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry to hear it. Even so, he might’ve been just the man to barrel past Mr. Purdue, or to sneak past that other boy who does Mr. Purdue’s bidding. If nothing else, I doubt he’d have too many compunctions about shooting past the pair of them. Those Texians. Dreadful lot, the whole breed.”\u003c/p\u003e\n\u003cp\u003e“I’ve often said the same about Yankee women, but you don’t see me going on about it, now, do you?” Mercy retorted.\u003c/p\u003e\n\u003cp\u003eThis shut down Miss Clay momentarily, but she chose not to read too far into the statement. After all, there were class distinctions among the northern regions same as in the southern regions, and everyone knew it. Either Miss Clay was choosing to believe she was being insulted by a Midwesterner, or she’d already concluded she dealt with a gray traitor and had come to terms with it, because she did not call attention to the remark.\u003c/p\u003e\n\u003cp\u003eInstead she said, “Come now, Mrs. Lynch. There’s no need to be rude. I want us to work together.”\u003c/p\u003e\n\u003cp\u003eThe nurse asked, “And why is that?”\u003c/p\u003e\n\u003cp\u003eTheodora Clay leaned forward again, speaking softly enough that her aunt, napping nearby, would not be roused by her words. “Because I want to know what killed those lads.”\u003c/p\u003e\n\u003cp\u003e“I reckon it was a cannonball to the chest, or something similar. Or a missing arm or leg. Like as not, if there are real war veterans dead back there, that’s what killed them.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “That, or infection, or . . .” She dropped the whisper another degree. “Poison.”\u003c/p\u003e\n\u003cp\u003e“Poison?” Mercy responded, too loudly for Miss Clay’s liking.\u003c/p\u003e\n\u003cp\u003eShe shrugged and waved her hands as if she wasn’t certain of where she was going, but the plan was forming and she was determined to exposit it. “Poison, or some kind of contamination. I . . . I overheard something.”\u003c/p\u003e\n\u003cp\u003e“Did you?”\u003c/p\u003e\n\u003cp\u003e“Yes, those Mexican inspectors, they—”\u003c/p\u003e\n\u003cp\u003e“Are they still on board?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Miss Clay said quickly, eager to get back to her idea. “They’ve moved to the next car up. They were talking about some kind of illness or poison that they think might’ve contaminated their missing men. I know you spoke with them.”\u003c/p\u003e\n\u003cp\u003e“They might’ve mentioned it.” Or she might’ve mentioned it, but she didn’t say so.\u003c/p\u003e\n\u003cp\u003eNearly exasperated, Miss Clay said, “Mr. Purdue was talking to that fellow, that Mr. Hayes.”\u003c/p\u003e\n\u003cp\u003e“About the missing Mexicans?”\u003c/p\u003e\n\u003cp\u003e“Yes. He was reading a newspaper—while he was back there, like a toad in a hole—and I was only trying to get some breakfast. He was telling Mr. Hayes that something that could alter so many hundreds of people all at once would make a tremendous weapon, if that’s what had happened. And before long, if he had his way, the Union would be in a position to produce just such a weapon.”\u003c/p\u003e\n\u003cp\u003eIt was Mercy’s turn to frown. “Turning a disease or a poison into a weapon? I’ve never heard of such a thing.”\u003c/p\u003e\n\u003cp\u003e“I have,” Miss Clay informed her. “During the French and Indian war, the government gave smallpox-​infected blankets to hostile tribes. It was cheaper and easier than exterminating them.”\u003c/p\u003e\n\u003cp\u003e“What a gruesome way of looking at it!”\u003c/p\u003e\n\u003cp\u003e“Gruesome indeed! It’s an army, Mrs. Lynch, not a schoolyard full of boys. It’s their job to destroy things and kill people in the name of their own population. They do what they must, and they do it as inexpensively as they can, and as efficiently as possible. What could be more insidious and efficient than an unseen contagion?”\u003c/p\u003e\n\u003cp\u003eMercy lifted a finger to pretend to doodle on the table between them as she responded. “But the problem with an unseen contagion is obvious, ain’t it? You’re gonna infect your own folks with it, sure as you infect other people.”\u003c/p\u003e\n\u003cp\u003e“Clearly some amount of research and development would be required, but isn’t that what Mr. Purdue does on his own time, in order to justify his continued existence as a passenger on this train? He’s a scientist, and he’s guarding a scientific treasure trove. For the military,” she emphasized this final point.\u003c/p\u003e\n\u003cp\u003e“It sounds awful, but I don’t guess I’d put it past him.”\u003c/p\u003e\n\u003cp\u003e“Neither would I,” Miss Clay said with a set of her mouth that wasn’t quite a smile, but conveyed the fact that she thought that now she and the nurse might finally be on the same page. “And that’s why we must take this opportunity while the train is stationary, to sneak into that rear car and see what’s inside.”\u003c/p\u003e\n\u003cp\u003eMercy’s eyebrows bounced up. “You can’t be serious.”\u003c/p\u003e\n\u003cp\u003e“Of course I can. I’ve even changed my shoes for the occasion.”\u003c/p\u003e\n\u003cp\u003e“Bully for you,” Mercy said. “What are you going to do? I’ve already done my best to persuade the captain to intervene. Shall you seduce your way past Mr. Purdue and—”\u003c/p\u003e\n\u003cp\u003e“Don’t be revolting. And please recall, I’ve requested your own involvement as well. It’ll be disgusting, no doubt. And it wouldn’t be necessary if that blasted captain would stand up to the hierarchy and insist for himself that the things under his purview are all known quantities. But alas, I can’t convince him to budge on the matter. Ridiculous man, and his ridiculous sense of duty.”\u003c/p\u003e\n\u003cp\u003e“He’s all right. You leave him alone.”\u003c/p\u003e\n\u003cp\u003eMiss Clay made a little sniff and said, “If you say so. Now, come on.” She changed the subject, rising to her feet. “You and I are going to perform some reconnaissance.”\u003c/p\u003e\n\u003cp\u003e“We’re going to do what?”\u003c/p\u003e\n\u003cp\u003e“We’re going to poke around, and let ourselves into that car.”\u003c/p\u003e\n\u003cp\u003eMercy asked, “How? The doors are sealed and chained. You’ve seen that yourself, I bet, when we’ve stopped at stations and stretched our legs. And even if they weren’t, Mr. Purdue and his very large gun are standing between us and that car. Or, Mr. Hayes, as the case may be.”\u003c/p\u003e\n\u003cp\u003e“Think bigger. Think higher.” She pulled on a pair of thin calfskin gloves and fastened their buttons while she said, “We’ll go over. There’s an emergency hatch on the roof. It’s designed to let people out, not in, but unless I’m sorely mistaken, it will work both ways.” Finished with her gloves, she continued, “Here’s what we’ll do: We’ll go to the last passenger car, take the side ladder up to the roof, and crawl across the top of the caboose, then jump over to the final car.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-47.html","bookId":2551,"creation":"Oct 6, 2019 12:29:04 AM","modification":"Oct 6, 2019 12:29:04 AM"}
