{"id":111648,"no":62,"title":"Page 62","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAs he pulled the whistle, he used his other arm to flip another switch, and pull a knob. He ordered the rail men and the porters to take up shovels, check the hydrogen lines, and make sure the stuff was being made and sent up from the fuel car.\u003c/p\u003e\n\u003cp\u003eThere was no room to maneuver, or even to get out of the way—not with the lieutenant and his two soldiers, the five rail men and porters, the conductor, and Inspector Galeano still firing from his bird’s-​eye perch.\u003c/p\u003e\n\u003cp\u003eMercy gripped the edge of the nearest bin, and the Dreadnought lunged. It didn’t move forward; not quite, not yet, but it gave a shove and a lean, like a man bracing himself to break down a door, and its next lean and shove drew the whole train forward with a rattle as the cars clacked together, flexing on the track, knocking against one another from the sudden pull.\u003c/p\u003e\n\u003cp\u003e“The plow!” hollered the conductor. “Start it up!”\u003c/p\u003e\n\u003cp\u003eThe nearest porter reached for a lever built into the floor; it had a squeezable handle, and when this handle was drawn back down and the lever was jammed into the necessary position, a new hum joined the fray.\u003c/p\u003e\n\u003cp\u003eThe hum started slow, and low; it began distant, and thundering, and rough. A cloud clearing its throat, or a mountain shrugging off a small avalanche. A windmill caught in a gale, shuddering and flapping. The conductor called for it, saying, “More hydrogen! Divert it from the secondary boiler! Just power the plow first—we won’t move without it!” With more fuel, the hum came louder, and steadier. It went from the crooked fan blade, unbalanced and wobbling, to a smooth and vocal growl that rose up so loud that it almost (not quite, but almost) dampened the sound of Theodora Clay and the men in the passenger car firing; the Mexican inspector, still upright, still shooting, and now openly crying; and the undead hordes oncoming.\u003c/p\u003e\n\u003cp\u003eMercy covered her ears. She could see the lieutenant gesturing, the porters shoveling coal, the rail men adjusting gauges, and the whole lot of them—their mouths open, and then their hands signing as if they were all deaf, like her—communicating over the astounding volume.\u003c/p\u003e\n\u003cp\u003eShe couldn’t stand there and hear it, hands over ears or no.\u003c/p\u003e\n\u003cp\u003eThe situation was as under control as it was going to get, and when the Dreadnought gave another heave, combined with the devouring hum as the snowplow sucked up the snow, cut it, and threw it away from the tracks . . . she could’ve sobbed with relief. She choked on the sob, forced it down, and looked away. As the engine got moving again, she clung to whatever solid and uncrowded bits of the bin she could hold, and worked her way back to the steps leading off the engine, then back through the fuel car and down its stairs to the gap.\u003c/p\u003e\n\u003cp\u003eShaking and eyes watering from the smoke and the snowplow’s ravenous roar, she wobbled to the steps and saw two of the corpse-​men. They moved as one and came toward her, but not fast enough to dodge her bullets. It took her three shots to take them down, but she pulled the trigger once on her right gun, and twice on her left and did just that. She didn’t even remember unholstering them. She couldn’t imagine how it had happened, how she’d been holding on to the rail, and then holding on to the guns, and shooting them into the faces of the men in the light-​colored uniforms.\u003c/p\u003e\n\u003cp\u003eThe Dreadnought picked up speed until it was running at a jerky, pitiful crawl.\u003c/p\u003e\n\u003cp\u003eSnow began to spray, commensurate with the pace: up a few feet, and out a few feet, feeding dunes on either side of the tracks as the rotary blades dug in and churned.\u003c/p\u003e\n\u003cp\u003eThe engine followed its snow-​gobbling plow. As Mercy stood there on the bottom of the fuel car’s steps, relieved to see the tracks moving under her feet once more, she caught a glimpse of the pilot piece sliding past—abandoned beside the tracks when the men had unhitched it and cast it aside.\u003c/p\u003e\n\u003cp\u003eMercy crossed the space between the fuel car and the passenger car, leaping to the passenger car’s platform, throwing open the door, and tossing herself inside.\u003c/p\u003e\n\u003cp\u003eMalverne Purdue was standing there, his skin whiter than his shirt with loss of blood and the stress of standing when he should’ve been lying down. His blood soaked everything near his wound and seeped down into his pants. He looked through Mercy, registering her only as something that stood between him and something he wanted.\u003c/p\u003e\n\u003cp\u003eHe staggered forward, through the door and out onto the platform again. She stumbled after him and he shoved her back.\u003c/p\u003e\n\u003cp\u003eShe considered her guns and reached for one of them. “Mr. Purdue, get back inside and—”\u003c/p\u003e\n\u003cp\u003eHe swung his arm back and struck her. He was holding something in his hand, and she couldn’t see it clearly enough to know for certain, but it looked like it might’ve been one of the ceramic mugs from the caboose’s stash. It was heavy, anyway, and it knocked her back and almost over the slender rail.\u003c/p\u003e\n\u003cp\u003eShe caught herself on it, folding over it and latching her feet under its bottommost edge. Gasping, she stood upright again and felt at her face. When she pulled her hand back from her mouth, there was blood on her glove. She didn’t think it’d been there before, but she might’ve been wrong.\u003c/p\u003e\n\u003cp\u003eNo, she wasn’t wrong. In a moment she could taste it, and feel it smearing along her teeth.\u003c/p\u003e\n\u003cp\u003eMalverne Purdue was rambling loudly. “This!” he said. “This, all of this—it could’ve been harnessed, don’t you see? Don’t you understand!”\u003c/p\u003e\n\u003cp\u003eMercy pulled herself off the rail and faced him, only to see that he’d turned and was looking over the other short rail at the corpses who were coming at them from every direction at once.\u003c/p\u003e\n\u003cp\u003eHis back to her, he continued. “We could’ve used this. We could’ve ended the war. And you would’ve lost; of course you would’ve. You’re going to lose—you know that, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Me?” she asked, as if it were a personal accusation.\u003c/p\u003e\n\u003cp\u003e“Yes, of course you. You and that ranger, and those Rebels.” He sneered at the Shenandoah, getting closer off to their left. He sniffed at the men on it, still holding their own. “I knew. I always knew. That’s not a Kentucky accent, you ridiculous woman. I can tell the difference. I’m from Ohio, myself.”\u003c/p\u003e\n\u003cp\u003eHe gave her his full attention again, in a way that was wholly unpleasant and sinister. “And it was your fault, in a way. You were the one who drew them together, and who made them stand against me. They wouldn’t have done it, if you hadn’t goaded them!”\u003c/p\u003e\n\u003cp\u003e“Me?” Mercy wondered where the other soldiers were, where the captain was, where the ranger was—where anybody was. Still shooting, she presumed. She could hear them, above her and inside the passenger car. She said, “You can call it my fault, if you want to. And that’s fine. If it’s my fault that you didn’t get to do this”—she waved her hand in the direction of the undead—“then, fine, I’ll take credit!”\u003c/p\u003e\n\u003cp\u003e“We could’ve controlled it!”\u003c/p\u003e\n\u003cp\u003eWas it madness or a last-​minute surge of strength before death that made him sound so powerful, so fiercely insane? She didn’t know, and she didn’t care to know, but she again reached her right hand for her gun as he came closer.\u003c/p\u003e\n\u003cp\u003e“This has to end someday. There has to be a winner and a loser. That’s the nature of war!”\u003c/p\u003e\n\u003cp\u003e“This isn’t nature,” she told him, clinging to her gun and holding it between them. “That, over there, those people,” she said. “That’s not nature.” She didn’t shout it. She didn’t have to. His face was as near to hers as a groom before a kiss.\u003c/p\u003e\n\u003cp\u003ePressing her gun up against his stomach she said, “I’m warning you, Mr. Purdue—I’m warning you!”\u003c/p\u003e\n\u003cp\u003eHe said, “Warning me? That you’re going to shoot me?” His breath frosted toward her face, but the cloud was drawn away by the motion of the train. Behind him, a panorama of horror unfolded—a horde, mostly men and a handful of women, running as if they’d only just learned how. All of them dead. All of them hungry. All of them coming, and chasing the train, and howling their morbid despair.\u003c/p\u003e\n\u003cp\u003e“I will shoot you,” she promised. “If I have to. And maybe even if I don’t.”\u003c/p\u003e\n\u003cp\u003eHis laugh was a barking, nasty sound filled with phlegm and blood, and it was the last noise he ever made.\u003c/p\u003e\n\u003cp\u003eSurrounded by gunfire on all sides, Mercy couldn’t tell—not at first—where the killing shot had come from. For a moment she thought it’d been her own gun, and she gasped as Malverne Purdue toppled back from her, falling away in a shuffling slump. But there was no new blood at his belly; it was on his head, and pouring down from it. As his body spiraled in a pirouette of death, she saw that the top of his skull had been struck and the crown was all but gone.\u003c/p\u003e\n\u003cp\u003eHis eyes were blank as he hit the rail, and his body buckled over it, falling off the train and into a pack of dead men and women who fell upon it like wild dogs on a deer.\u003c/p\u003e\n\u003cp\u003eMercy looked up. She still held the one gun, still pointing toward the place where the scientist had stood. She squinted against the white cliffs and the sparkling of the sun off the ice, and realized she was looking up at Theodora Clay.\u003c/p\u003e\n\u003cp\u003eMiss Clay was hanging on to the edge of the roof with one hand, her shoulders shaking with every rumbling roll of the rail ties. Her other hand held the gun she’d taken from Ranger Korman.\u003c/p\u003e\n\u003cp\u003eShe shouted down, “For such an educated man, he was never very . . . civilized!”\u003c/p\u003e\n\u003cp\u003eTwenty\u003c/p\u003e\n\u003cp\u003eBack inside the passenger car, Mercy was nearly numb.\u003c/p\u003e\n\u003cp\u003eMiss Clay joined her momentarily, and from the other door at the other end of the car, Ranger Korman entered, looking ruffled but unscathed. A few others trickled in behind him, until there were no more footsteps on the steel roof and everyone was crowded into the sleeper car.\u003c/p\u003e\n\u003cp\u003eAbove the car and all around it, the snow was blowing now—billowing harder and faster than any blizzard could’ve tossed it. Flung by the spinning blades of the plow, the snow gushed up, out, back, and around the passenger cars until it almost felt like riding through another tunnel, this one white and flecked with ice.\u003c/p\u003e\n\u003cp\u003eIt was flecked with other things, too.\u003c/p\u003e\n\u003cp\u003eHere and there, a streak of bright brown blood went slapping across the side of the train, splattering into a window. A few fingers flipped inside. Chunks of hair. Bits of clothing, and a shoe that—upon inspection—still had most of a decomposing foot inside it. The rotary plow took the undead attackers and treated them no differently from the ice and snow that had clustered on the tracks, chopping them up and tossing them, shoveling them out of the way with its rows of biting blades. \u003c/p\u003e","sourceLink":"https://allnovel.net/dreadnought-the-clockwork-century-2/page-62.html","bookId":2551,"creation":"Oct 6, 2019 12:29:04 AM","modification":"Oct 6, 2019 12:29:04 AM"}
