{"id":92976,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI lift my hand to shoulder height, and blood trails down my arm and drips from my elbow. Bowen is gone for what feels like forever, a whole minute at least. When he comes back, he’s holding a white box with a red cross painted on it.\u003c/p\u003e\n\u003cp\u003e“Upstairs. It’s too dark down here,” he says, gripping my elbow.\u003c/p\u003e\n\u003cp\u003eOn the second floor, he pushes me to sitting and opens the box. “This will hurt,” he warns, “but don’t cry out!” He crouches beside me and pulls my fingers flat, making the gash in my palm gape. With his teeth he tears open a small white packet—it looks like a sugar packet from a restaurant—and holds it over my hand. Our eyes meet. And then his face is over my palm, and he pours little round white beads that look like fertilizer into the open gash. They hiss when they touch blood, and then absorb it until they turn red. The beads expand and the bleeding slows. Pressure fills the wound. I gasp and squeeze my eyes shut. Unable to stay upright, I totter and fall to the side.\u003c/p\u003e\n\u003cp\u003eFire laces my blood, spreading from my palm to my fingers and wrist. Ice follows, traveling all the way to my elbow. And then the pain is gone. I wiggle my fingers. It feels like a rock is wedged inside the cut, and I can’t make a fist. I take a deep breath and open my eyes. A knee supports my head, and fingers are brushing the hair from my sweaty forehead.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Bowen says.\u003c/p\u003e\n\u003cp\u003eI look up at him. “No. It’s my fault for being stupid. I shouldn’t have used the glass—”\u003c/p\u003e\n\u003cp\u003e“Fo,” Bowen snaps, silencing me. “I’m not sorry the coagulant hurt your hand. You totally deserved it. But I’m sorry about what I said. About being stuck with you.”\u003c/p\u003e\n\u003cp\u003eSunshine spreads through my body. I sit up and beam at him. “Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Really. Aside from you being my potential—and most likely, terribly painful—death, you’re not that bad.” He smiles and I feel like I could float away. Without asking, he takes my injured hand and wraps it with stretchy tape.\u003c/p\u003e\n\u003cp\u003e“No showering for twenty-four hours,” he warns.\u003c/p\u003e\n\u003cp\u003eMy eyes grow round and I lean toward him. “Is there a shower here?”\u003c/p\u003e\n\u003cp\u003eHe laughs and shakes his head. “It was a joke.” A hot breeze stirs the air, and Bowen shuts his eyes. “Maybe we should sleep up here tonight. It’s a lot cooler than downstairs. And with the cover of darkness … I’ll grab our stuff.”\u003c/p\u003e\n\u003cp\u003eHe stands. I watch him go, then make my way to the west windows in time to see the sun disappear behind distant mountains. Shadows creep into the world, filling every corner and hollow. And one shadow on the street below moves. I crouch down for a better look.\u003c/p\u003e\n\u003cp\u003eThe shadow crouches, too, and for a moment I wonder if it has seen me. But then it picks something up from the ground. Something pale and limp. The bottom half of my pants.\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eI wake to the sound of a motor, and my eyes flutter open in confusion. The motor is right above me. Vibrations shatter the still morning. I lift my head in search of its source.\u003c/p\u003e\n\u003cp\u003e“No! Don’t move!” Bowen whispers, pressing on my shoulder. “Look.” He nods toward my cuffed and restrained ankles. Slowly I lift my head again and peer down the length of my body.\u003c/p\u003e\n\u003cp\u003eAbove my stomach hovers a tiny bird, inspecting the crimson stain on my shirt. Its wings drone like a motor and I am filled with awe. This fragile hummingbird is the first living, wild animal I have seen since waking up in this dead world. Its bright-green chest and red-capped head are startlingly out of place.\u003c/p\u003e\n\u003cp\u003e“Where’d it come from?” I whisper, unable to take my eyes from it.\u003c/p\u003e\n\u003cp\u003e“The wall. There are hundreds of hummingbirds living inside of it. Every once in a while one gets out. It thinks your blood is a flower. It’s probably on the verge of starving to death.”\u003c/p\u003e\n\u003cp\u003eThe hummingbird, realizing my shirt isn’t a flower, darts away, sweeping through an empty window and leaving the morning disturbingly silent.\u003c/p\u003e\n\u003cp\u003eBowen points the remote at me, and my ankles release. I stretch my legs and think about going back to sleep.\u003c/p\u003e\n\u003cp\u003eAfter a moment, I hear another sound, reminiscent of the sound of a distant hoe scraping dirt. I open my eyes and look at Bowen—the source of the sound. A gleaming knife glides along his jaw line, scraping a thin lather of white foam and dark stubble from his skin. The scent of pine floats on the air. I stare, entranced, as he scrapes all the cream off, and when he is done, his smooth face looks thirteen again. Almost.\u003c/p\u003e\n\u003cp\u003e“Here.” Bowen holds a water bottle out to me. I sit up, open it, and take a long drink. He smirks. “That’s for you shirt, Fotard. You need to wash the blood out of it.”\u003c/p\u003e\n\u003cp\u003eI open my mouth to ask him why, but before the words leave my tongue, he says, “Blood draws beasts—the smell.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Horrified, I pull off my shirt. Bowen’s smirk disappears, and his freshly shaved cheeks turn a shade pinker. He turns his back as if he’s never seen me with just the binding that wraps my chest, as if the sight of me will make him go blind. “Bowen, I’ve still got the rags binding my … never mind.” I turn the other way, hoping the back of my neck isn’t as hot as it feels, and put my shirt on the ground. Pouring water on the blood, I start rubbing the fabric against itself. I pour more water and rub more, but the blood doesn’t come out.\u003c/p\u003e\n\u003cp\u003e“I need soap or bleach,” I say over my shoulder.\u003c/p\u003e\n\u003cp\u003e“I don’t have any. Just give it a good rinse for now.” Bowen’s feet scrape on the ground, and he gasps. I turn and look up at him, every muscle in my body tensed for something bad. His eyes are fixed on my back, his mouth hanging open.\u003c/p\u003e\n\u003cp\u003e“What?” I ask.\u003c/p\u003e\n\u003cp\u003e“What happened to your back?”\u003c/p\u003e\n\u003cp\u003eI crane my neck to peer over my shoulder. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003eHe crouches behind me and trails his warm fingers over my skin, from the base of the fabric wrapping my breasts to just above the waist of my jeans. I shiver as warmth floods my body. His fingers move to the skin between my shoulder blades, just above the bindings, and trail up to my neck, leaving goose bumps in their wake.\u003c/p\u003e\n\u003cp\u003e“What is it?” I ask, my voice unsteady.\u003c/p\u003e\n\u003cp\u003e“You don’t know?”\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“You have scars from here”—he touches my neck—“to here.” His finger trails over the binding and down to the top of my hip.\u003c/p\u003e\n\u003cp\u003e“Scars?”\u003c/p\u003e\n\u003cp\u003e“Yeah. They look like they’re from … fingernails.” He presses three fingertips to my midback and drags them downward. His eyes meet mine. “What happened to Jonah?” he asks, eyes guarded.\u003c/p\u003e\n\u003cp\u003e“He’s a beast,” I say. The words scratch my throat.\u003c/p\u003e\n\u003cp\u003e“That’s what I thought. He started the vaccine the same time you did, right?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I answer without thinking, a fact I didn’t realize I knew until this very moment.\u003c/p\u003e\n\u003cp\u003eBowen taps his chin with his finger and studies me. And then he’s standing, tugging his Sprite shirt over his head. My body temperature surges, searing my neck and cheeks. He doesn’t notice, is too intent on his chest. I follow his gaze.\u003c/p\u003e\n\u003cp\u003eHis skin is suntanned and smooth over muscles earned by hard work. Right down the middle of his chest are five white lines, like five lightning bolts. I stand and get a better look. “Here, too.” He points to his shoulder. I take a step closer and study the white marks, tracing the jagged crescent with my finger.\u003c/p\u003e\n\u003cp\u003e“That looks like …”\u003c/p\u003e\n\u003cp\u003e“Teeth?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“A beast bit me. And the marks on my chest are from fingernails.” He pulls his shirt back on. “We need to go back downstairs. We’re sitting targets up here. Are you hungry?”\u003c/p\u003e\n\u003cp\u003e“What?” I’m still staring at his chest, imagining the five scar-streaks beneath his shirt.\u003c/p\u003e\n\u003cp\u003e“Hungry. Do you want something to eat?”\u003c/p\u003e\n\u003cp\u003eMy stomach growls. I haven’t eaten in more than a day. He picks up my sopping shirt and hands it to me. I pull it on and follow him downstairs.\u003c/p\u003e\n\u003cp\u003e“When did you get those scars?” I ask.\u003c/p\u003e\n\u003cp\u003e“Three years ago. I was fourteen.” The main level of the factory is dark and muggy compared to the second level. I can hardly see his face. “They had just completed the second level of the wall and were admitting more people inside, offering protection. If.”\u003c/p\u003e\n\u003cp\u003e“If what?” I ask.\u003c/p\u003e\n\u003cp\u003e“If you qualified.”\u003c/p\u003e\n\u003cp\u003e“And you didn’t?”\u003c/p\u003e\n\u003cp\u003e“No, I did. But my mom? She didn’t qualify. They turned her away.”\u003c/p\u003e\n\u003cp\u003eAn image wavers in my memory. A bathrobe and bunny slippers, and blood on snow.\u003c/p\u003e\n\u003cp\u003eJonah and I were out front, taking turns pulling each other on a sled through the snow. It was my turn to be pulled, when a door slammed across the street.\u003c/p\u003e\n\u003cp\u003eShe stood on the front porch, wearing a blue flannel robe. Twinkling Christmas lights clung to the roof of her house even though it was the end of February.\u003c/p\u003e\n\u003cp\u003e“Look, it’s the crazy lady,” Jonah whispered. “Dad says if you look at her wrong, she’ll kill herself.”\u003c/p\u003e\n\u003cp\u003eI tore my gaze from her and studied the purple plastic sled, wondering if Dreyden was embarrassed to have a mom like that—a mom who wore her bathrobe and slippers at four in the afternoon. A mom who left their Christmas lights on day and night.\u003c/p\u003e\n\u003cp\u003eThe sound of Mrs. Bowen crunching through the snow of her unshoveled driveway echoed across the street to our house. A minute later a pair of pink bunny slippers matted with snowballs crunched into our yard and stopped beside the sled. Red dripped between those slippers, like the ticking of a clock … drip-drip-drip.\u003c/p\u003e\n\u003cp\u003e“I need help,” she said. “I’ve accidentally cut my wrist.” Drip-drip-drip.\u003c/p\u003e\n\u003cp\u003eI looked up, and Jonah rammed his boot into my thigh. “Don’t look at her!” he warned.\u003c/p\u003e\n\u003cp\u003eI stood from the sled and stared at the blood melting a red hole in the snow between her slippers.\u003c/p\u003e\n\u003cp\u003e“I’ll get Dad,” I whispered.\u003c/p\u003e\n\u003cp\u003e“Why didn’t your mom qualify?” I can still see the crimson snow when I look at him.\u003c/p\u003e\n\u003cp\u003eBowen unzips his backpack and rummages around. “She didn’t pass their health requirements. And if you aren’t healthy, you aren’t worth protecting.” He takes out one of the meat-flavored disks, and my stomach rumbles. I don’t know how I hadn’t realized it before, but I’m ravenous. Eager, drooling, I hold my hand out for the disk, but he hesitates, his eyes full of guilt. \u003c/p\u003e","sourceLink":"https://allnovel.net/stung-stung-1/page-17.html","bookId":1608,"creation":"Oct 5, 2019 5:59:43 PM","modification":"Oct 5, 2019 5:59:43 PM"}
