{"id":93147,"no":22,"title":"Page 22","content":"\u003cp\u003eTHE MAGIC SWORD\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t stop laughing. Her throat had taken a bruising, and blood was backed up in her mouth.\u003c/p\u003e\n\u003cp\u003e\u0027You stupid, stupid bitch,\u0027 Kate spluttered.\u003c/p\u003e\n\u003cp\u003eShe felt her neck. It wasn\u0027t even broken.\u003c/p\u003e\n\u003cp\u003ePrincess Asa Vajda looked at the sword in her hand as if it were a snake. It seemed straight, sharp and silver. Red stuff dripped from its edge. Not blood, strawberry jam.\u003c/p\u003e\n\u003cp\u003e\u0027It\u0027s a magic sword,\u0027 Kate said, sitting up.\u003c/p\u003e\n\u003cp\u003eOrson Welles looked sheepish. Asa stabbed at his enormous torso and the sword appeared to pass through his chest without harming him.\u003c/p\u003e\n\u003cp\u003e\u0027Not your kind of magic, Princess,\u0027 Kate said. \u0027Not necromancy and sorcery. Just trickery, prestidigitation.\u0027\u003c/p\u003e\n\u003cp\u003eThe Princess looked an utter prawn. Kate wasn\u0027t the only one laughing. Penelope desperately tried to keep a straight, sympathetic face, but couldn\u0027t contain her delight at the humiliation of the Royal Fiancee.\u003c/p\u003e\n\u003cp\u003e\u0027You try saying \"prestidigitation\" in my state,\u0027 said Kate.\u003c/p\u003e\n\u003cp\u003e\u0027What manner of sword is this?\u0027 the Princess demanded of Welles.\u003c/p\u003e\n\u003cp\u003e\u0027A conjurer never reveals his secrets,\u0027 he said.\u003c/p\u003e\n\u003cp\u003eAsa Vajda had made a big mistake, and while making it had taken the name to which she was not yet entitled. A subtle hint of terror crept across her beautiful, mask-like face. Dracula would hear of her presumption, probably already knew about it.\u003c/p\u003e\n\u003cp\u003eTartars seized Kate and hauled her upright. Genevieve laid a hand on one of them, calmly powerful and impossibly lovely. Princess Asa nodded to the guards. Kate was released.\u003c/p\u003e\n\u003cp\u003ePenelope handed Kate her shoes. She was crying with suppressed laughter. The mark of Asa\u0027s whip had disappeared.\u003c/p\u003e\n\u003cp\u003e\u0027I think you\u0027d better leave, Katie,\u0027 said Penny, biting the insides of her cheeks to keep from exploding.\u003c/p\u003e\n\u003cp\u003e\u0027I think you\u0027re right.\u0027\u003c/p\u003e\n\u003cp\u003eKate kissed Penelope.\u003c/p\u003e\n\u003cp\u003e\u0027Lovely to see you, as always, Penny,\u0027 she said, really hugging her friend. \u0027And you too, Genevieve. I withdraw unequivocally my ill-judged rant of a few moments ago. You\u0027re the best friend a girl could have.\u0027\u003c/p\u003e\n\u003cp\u003eGenevieve kissed her too.\u003c/p\u003e\n\u003cp\u003eAsa muttered about the barbarous lands and isles of the West. Ireland, England, and France were far from Moldavia. The customs of those places were absurd.\u003c/p\u003e\n\u003cp\u003e\u0027Princess, good night,\u0027 said Kate. \u0027Do enjoy the rest of this democratic century.\u0027\u003c/p\u003e\n\u003cp\u003e\u0027Out,\u0027 Asa spat.\u003c/p\u003e\n\u003cp\u003eKate left.\u003c/p\u003e\n\u003cp\u003eShe was outside the palazzo before she remembered that Marcello was inside, probably choking on Vimto and cursing her appetites. Should she wait for him, or hitch a lift back to Rome by herself?\u003c/p\u003e\n\u003cp\u003eMusic filtered through the barred windows and spread out over the town. Kate sat on the broad front step and slipped her shoes back on. She was still drunk, but now under control. The danger had passed, her red rage was spent. She would not attack anyone else tonight. Unless she ran into someone ghastly.\u003c/p\u003e\n\u003cp\u003eShe could laugh about it, but her fight with Asa Vajda had been scary. If the Princess had found a more reliable sword, Kate would be a head shorter, and truly dead. Even if she\u0027d avoided the blade and gouged out the vampire elder\u0027s slippery guts, she\u0027d have wound up dying for it. Only a moment of comedy had saved her life.\u003c/p\u003e\n\u003cp\u003eSomething red rolled on the driveway: the ball she\u0027d been following. It was as if it were waiting for her. Even in her current state of not thinking straight, she knew toys were not supposed to have minds of their own.\u003c/p\u003e\n\u003cp\u003eA cannon sounded from the battlements. Something whizzed out to sea then exploded, scattering fiery chunks down onto the waves. She smelled the stink of gunpowder and conquered an impulse to throw herself flat on the ground. She\u0027d been in too many wars.\u003c/p\u003e\n\u003cp\u003eIn the flash of powder, she saw a small figure at the edge of the cliff. She looked at the dark and couldn\u0027t see the little girl any more.\u003c/p\u003e\n\u003cp\u003eShe had been there.\u003c/p\u003e\n\u003cp\u003eA fog of boiling blood rolled across her brain, the beginnings of a truly spectacular headache. She wanted to curl up and go to sleep here beside the stone lions that guarded the doors of Dracula\u0027s palace.\u003c/p\u003e\n\u003cp\u003eThe girl had left a silhouette burned into Kate\u0027s eyeballs. She momentarily took off her glasses and rubbed her eyes. In the red darkness, the child stood out.\u003c/p\u003e\n\u003cp\u003eShe had a flash of the sad face she\u0027d seen in the waters of the Trevi Fountain. The look she knew was wrong. She almost understood what was wrong with the picture.\u003c/p\u003e\n\u003cp\u003eThe ball was at the edge of the cliff. She stood up and walked across the drive onto a stretch of long, wet grass that sloped down gently until the land broke sharply away. Below the battlements was a sheer drop. Waves crashed against the base of the cliff, hammering the foundations, slowly eroding them.\u003c/p\u003e\n\u003cp\u003eEventually, the Palazzo Otranto would fall, like Mr Poe\u0027s House of Usher. And a good job, too.\u003c/p\u003e\n\u003cp\u003eThe red ball was trapped by a shrub that clung to the very edge. Kate reached down to free it and was struck dizzy at the worst possible moment, attention caught by the froth of foam hundreds of feet below. The waves came up at her and went away again, a trick of vertigo.\u003c/p\u003e\n\u003cp\u003eShe did not fall.\u003c/p\u003e\n\u003cp\u003eWhere had the little girl gone?\u003c/p\u003e\n\u003cp\u003eShe looked along the side of the palace. The wedge of green grew thin, where the cliff had crumbled away. After a few yards, the wall and the cliff became one, without even the thinnest of ledges. There was no way past the building.\u003c/p\u003e\n\u003cp\u003eA stab of guilt thrust into her heart. Had she frightened the child? Made her fall?\u003c/p\u003e\n\u003cp\u003eKate sat down, feet dangling over the edge. There was spray, like waves of fine rain. Coolness seeped into her mind, wiping away the fog. She liked the saltwater specks on her face.\u003c/p\u003e\n\u003cp\u003eAnother cannon went off.\u003c/p\u003e\n\u003cp\u003eThis time, she was looking down as the flash lit everything up. The dark rock face momentarily bleached white, and a small figure was visible.\u003c/p\u003e\n\u003cp\u003eWas she moving, waving her arms? Or was she still, animated by the flash?\u003c/p\u003e\n\u003cp\u003eKate called out.\u003c/p\u003e\n\u003cp\u003e\u0027Little girl. Ragazza.\u0027\u003c/p\u003e\n\u003cp\u003eHer voice was lost. Waves roared like the blood in her ears.\u003c/p\u003e\n\u003cp\u003eShe waited, but the next cannon blast was a long time coming. She had time for fear. The girl must have fallen. Was it Kate\u0027s pursuit, or the shock of the cannon going off? Had she been chasing her ball and overbalanced, only to be caught on an outcrop?\u003c/p\u003e\n\u003cp\u003eObviously, there was more to the child than random wandering through Kate\u0027s life. She\u0027d been in Piazza di Trevi when the Crimson Executioner had struck, and now she was here at the Palazzo Otranto for her face-off with the Princess. Somehow, she had become Kate\u0027s angel of violence.\u003c/p\u003e\n\u003cp\u003eThe ball sailed off the cliff and out to sea.\u003c/p\u003e\n\u003cp\u003eKate knew what she\u0027d have to do. She needed to remove her shoes again. This was going to ruin her stockings, and her expensive dress. But the party was over for her anyway.\u003c/p\u003e\n\u003cp\u003eShe stood on top of the cliff, arms outspread like a diver, judging the wind and the spray. Not too strong, thank heavens. She knelt on the edge and leaned over, bending down below the lip of the cliff, reaching for a handhold a few feet down.\u003c/p\u003e\n\u003cp\u003ePulling herself over the edge, she clung to the rock, feeling her weight in her shoulders and hips. She crawled down like a lizard, worried her glasses would slip off and be lost forever. Her elbows and knees grazed rock, but her fingers and toes found holds.\u003c/p\u003e\n\u003cp\u003eShe clung like a heavy fly, looking down into the dark. If the girl was still there, Kate could not see her.\u003c/p\u003e\n\u003cp\u003eSlowly, she made her zigzag way down. Her soaked dress clung to her back and bottom. Some vampires could grow wings and fly. Kate Reed had to crawl.\u003c/p\u003e\n\u003cp\u003eAnother cannon fired.\u003c/p\u003e\n\u003cp\u003eKate saw the girl looking up at her. The tiny face was shockingly close, still half-masked by that unnaturally beautiful hair. A single tear stood out from her exposed eye. And she was smiling like the Cheshire Cat.\u003c/p\u003e\n\u003cp\u003eWhen the flash was gone, the darkness came back.\u003c/p\u003e\n\u003cp\u003eShe knew what she had failed to see the first time. It was the mouth, the downturned crescent of sorrow. She had seen a reflection, upside-down, of a smile. At the sight of the Crimson Executioner murdering Kernassy and Malenka, the girl had not been shocked, but possessed with unholy delight.\u003c/p\u003e\n\u003cp\u003eIn that innocent face was Evil.\u003c/p\u003e\n\u003cp\u003eKate reached out for where the girl was, and her hand closed on nothing. There\u0027d been no cry. The child hadn\u0027t fallen.\u003c/p\u003e\n\u003cp\u003eShe lurched forward, hands free of the cliff, and scrabbled down a few yards. Her feet found holds and she dangled. There was a hole in the rock. Not a cave, but a man-made entrance. She got her hands around the hewn edges of the ingress and clung on tight.\u003c/p\u003e\n\u003cp\u003eInside the cliff, the little girl ran. \u003c/p\u003e","sourceLink":"https://allnovel.net/dracula-cha-cha-cha-anno-dracula-3/page-22.html","bookId":2295,"creation":"Oct 5, 2019 6:00:16 PM","modification":"Oct 5, 2019 6:00:16 PM"}
