{"id":16945,"no":12,"title":"CHAPTER XII SUSPENDED","content":"\u0026nbsp;Dr. Brush was seated at a table covered with papers, in a large armchair. He was an elderly man of dignified presence, not a petty tyrant such as is sometimes found in a similar position, but a man who commanded respect, without an effort. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark Manning and James Carson entered his presence a little nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Young gentlemen,\" said the doctor, gravely, \"I am informed that you have violated one of the rules of the academy by frequenting a billiard saloon where liquor is sold.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who told you, sir?\" asked Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is not to the purpose,\" said the principal, gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I should like to know who informed on me,\" persisted Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whoever did so acted as your true friend, Manning; but there is no occasion for you to know who it was. Is it true?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark would have been glad to deny the charge, and would not have felt any scruples about doing so, if it would have done any good. But it was clear, even to him, that he would not be believed, and that denial would only make his position worse. So he made a virtue of necessity, and answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have been in once or twice, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Exactly how many times have you been to the saloon?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Three times.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did you do there?\u0027\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We played billiards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you order anything at the bar?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" said Mark, reluctantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Carson, you accompanied Manning, did you not?\" said Dr. Brush, turning to Mark\u0027s companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And I suppose you also played billiards and drank?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, yes, sir, I believe I did.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You were aware, were you not, that it was against the regulations of the school?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose it must have slipped my mind,\" answered James, trying to look as innocent as possible.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dr. Brush frowned, for he saw clearly that this was but a subterfuge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If this were true,\" he continued, \"it would be no excuse. As students, it is your duty to make yourselves acquainted with the rules that govern the institution. In point of fact, I cannot believe that either of you is ignorant of the rule forbidding students to frequent places where liquor is sold. It is hardly necessary for me to defend the propriety of this rule. Intemperance is a fruitful source of vice and crime, and I cannot allow the youth under by charge to form habits of indulgence which may blast all their prospects, and lead to the most ruinous consequences.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We didn\u0027t drink much,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall not inquire how much you drank. In drinking a single glass, you violated the rule of the school, and I cannot pass over it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is he going to do with us, I wonder?\" thought Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not required to wonder long.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As this is your first offense, so far as I know,\" proceeded the principal, \"I will not be severe. You are both suspended from the institution for the remainder of the term, and are required to leave Bridgeville by the early train to-morrow morning for your respective homes. I shall write to your parents, explaining the cause of your suspension.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But a week remained of the term, and the punishment was mild, but both boys were mortified and left the study crestfallen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark was the first to recover his spirits.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is not so bad, James,\" he said. \"To-morrow will be Saturday, and I should go home, anyway. I don\u0027t mind staying at home next week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What will your father say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I\u0027ll make it all right with him! I don\u0027t mind much what he says. I guess he got into scrapes himself when he was a boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father isn\u0027t so easily managed. Just as likely as not, he\u0027ll cut off my allowance for a month; and that\u0027ll be no joke!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My father won\u0027t do that,\" said Mark. \"If he did, I would raise a fuss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would that do any good?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll bet it would!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank, who was quite ignorant of Mark\u0027s trouble, was surprised when the latter approached him a little later with a frown and said, harshly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You won\u0027t make anything by what you have done, Frank Courtney!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you be kind enough to tell me what I have done?\" asked Frank, calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve been to Dr. Brush and told him about our playing billiards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are entirely mistaken, Mark. I did not suppose he knew.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must have been you. He told us some one had informed him, and you were the only one who knew. It\u0027s a mean trick, isn\u0027t it, Carson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Awfully mean!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have already told you that the information did not come from me. It may be the best thing for you that it has been found out, for it was doing you no good to frequent such places.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want to hear any of your preaching, Frank Courtney. I guess I can manage my own affairs without any advice from you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care to intrude any advice,\" said Frank. \"I have not much reason to feel interested in you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better look out how you treat me, though,\" said Mark, insolently. \"I know very well you dislike me, but it won\u0027t be safe for you to show it while you are a dependent on my father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t propose to be a dependent on him long,\" said Frank, quietly. \"The truth of it is, you and your father are dependent upon property which of right belongs to me. The time may come when I shall be able to show this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What does he mean?\" thought Mark, uneasily. \"Will he contest the will?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was perhaps an evidence of Mark\u0027s shrewdness that he had some doubts about the validity of the will under which his father inherited.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2988/82389.html","bookId":324,"creation":"Aug 2, 2019 8:11:58 AM","modification":"Aug 2, 2019 8:11:58 AM"}
