{"id":16948,"no":15,"title":"CHAPTER XV ERASTUS TARBOX, OF NEWARK","content":"\u0026nbsp;Erastus Tarbox kept a dry-goods store in the city of Newark, New Jersey. He was well to do, not so much because of his enterprise and skill as a merchant as because of his extreme poverty. Some people called it parsimony. He only employed two clerks to assist him in his store, and they, as well as the boy who carried out parcels and ran the errands, were paid scarcely more than two-thirds the rates paid in neighboring stores. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox prided himself upon his relationship to the Courtneys. They were rich, and riches, in his eyes were a great merit. He often sighed to think that there was no chance for him to benefit by a share of the large property owned by his cousins. Without hope of personal advantage, however, he had always been obsequious to them, and often took occasion to mention them, by way of enhancing his own social credit somewhat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox had heard of Mrs. Courtney\u0027s death, but had not heard the particulars of the will. He took it for granted that Frank was sole heir, and it did cross his mind more than once how very agreeable it would be if he could be selected as guardian of the rich young heir. Of course, he knew that there was no probability of it, since the stepfather would undoubtedly be appointed to that position.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox had just sold a calico dress pattern to a poor woman, when his attention was drawn to the entrance of Frank Courtney, who entered his store, valise in hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox was rather short-sighted, and did not immediately recognize the son of his rich cousin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What can I do for you, young man?\" he asked, in his business tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is Mr. Tarbox, I believe?\" said Frank, who did not know his relatives very well.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that is my name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Frank Courtney.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bless my soul!\" ejaculated Mr. Tarbox, surprised and delighted. \"When did you arrive in Newark?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have only just arrived.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do hope you are going to make us a visit,\" said Mr. Tarbox, cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you!\" answered Frank, cheered by this warm reception. \"If you are sure it won\u0027t inconvenience you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Inconvenience me! We shall be delighted to have you with us.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must come up and see Mrs. Tarbox. She will be delighted to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox lived over his store. There was a door from the street adjoining the shop front. Mr. Tarbox opened it with a pass-key, and conducted Frank upstairs, ushering him into a gloomy parlor, with stiff, straightbacked chairs, ranged at regular intervals along the sides of the room, and a marble-topped center table, with two or three books lying upon it. There was a framed engraving, representing Washington crossing the Delaware, over the mantel, and two plaster figures and similar ornaments on the mantelpiece. The whole aspect of the room chilled Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait here, and I will call my wife,\" said Mr. Tarbox.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank sat down on a hard sofa and awaited the entrance of Mrs. Tarbox.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She came in, a tall, thin woman, about as handsome for a woman as her husband was for a man. Indeed, they were very well matched. She was quite as mean as he, and between them they managed to make annually a sensible addition to their world possessions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox privately hinted his hopes respecting Frank to his wife, and she instantly agreed that it would be a most eligible arrangement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We must make him contented, my dear,\" said her husband. \"Give him the best bedroom, and I think it might be well to have something a little extra for supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did intend to put on the rest of that cold mutton,\" said Mrs. Tarbox, doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It won\u0027t do, Martha. There is only a little of it, you know, and the boy has been traveling, and, of course, is hungry. What do you say, now, to some nice beefsteak?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Beefsteak is high now,\" said Mrs. Tarbox. \"Still, if we buy round steak—that is cheaper than sirloin or tenderloin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And quite as good,\" said her economical partner. \"We can tell Frank, however, that no sirloin was to be had so late in the day at the markets.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Tarbox nodded her head, approving the suggestion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This little matter being adjusted, the husband and wife entered the parlor where our hero was waiting patiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is our young cousin, Martha,\" said Mr. Tarbox, smiling pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Welcome to Newark,\" said Mrs. Tarbox, extending her hand. \"And how did you leave your stepfather?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is well,\" said Prank, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two exchanged glances. It was clear that Frank did not like his stepfather, and this was satisfactory to them. There was the more chance of his leaving him and boarding with them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The children will be so glad to see you,\" said Mr. Tarbox; \"won\u0027t they, Martha?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Delighted!\" assured the lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pliny must be about your age. How old are you, by the way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sixteen.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just Pliny\u0027s age. Do you remember him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank remembered a tall, thin stripling who had accompanied his parents to the Cedars, and who appeared to have an inexhaustible appetite.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I remember him. Does he go to school?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; Pliny is in a store,\" answered Mr. Tarbox.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your store?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no! I thought it would be better for him to enter the employ of a stranger. He is in a bookstore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was one great advantage in Pliny\u0027s entering the employ of a stranger. He was paid four dollars a week, whereas Mr. Tarbox paid his boy but two. Here, then, was a clear gain of two dollars a week.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you must be tired,\" said Mrs. Tarbox. \"You will see the children at supper. Martha, I think Frank would like to go to his room.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The best bedroom was over the parlor. It was rather more cheerful, because lighter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here,\" said Mr. Tarbox, \"you must make yourself at home. Martha, isn\u0027t one of the drawers in that bureau empty? I thought so. Take your clothes out of the valise and put them away. Now, is there anything you would like?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only a little water to wash in,\" said Frank. \"You are both very kind.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We hope to make you comfortable. You are our relative, you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The water was brought up by Mrs. Tarbox herself, and Frank was left alone, on the whole well pleased with his reception.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2988/82392.html","bookId":324,"creation":"Aug 2, 2019 8:12:09 AM","modification":"Aug 2, 2019 8:12:09 AM"}
