{"id":16958,"no":25,"title":"CHAPTER XXV PERPLEXITY","content":"\u0026nbsp;He went out as usual after breakfast, and then walked leisurely downtown. He proposed to go to the shop of the Great Pekin Tea Company and resign his agency. He was on the watch during his walk for any opportunities to repair his unlucky loss: \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At one place he saw a notice:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"BOY WANTED.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he felt sure the compensation would not be sufficient to allow of his accepting it, he thought it would do no harm to make inquiry, and accordingly entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was an extensive retail store, where a large number of clerks were employed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is a boy wanted here?\" asked Frank of the nearest salesman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. You may inquire at the desk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He pointed to a desk some distance back, and Frank went up to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You advertise for a boy,\" he said to a tall, stout man, who chanced to be the proprietor. \"Is the place filled.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" was the answer; \"but I don\u0027t think it would suit you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think I would not be competent, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, that is not the difficulty. It would not be worth your acceptance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I inquire what are the duties, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We want a boy to open the door to customers, and this would not be worth your accepting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir. Thank you for explaining it to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The gentleman was favorably impressed by Frank\u0027s polite and gentlemanly manners.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I had a place for you,\" he said. \"Have you ever had any experience in our line of business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; I have very little experience of any kind. I have acted for a short time as agent for a tea company.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may leave your name if you like, and I will communicate with you if I have a vacancy which you can fill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank thanked the polite proprietor and walked out of the store.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though this is a story written for boys, it may be read by some business men, who will allow me to suggest that a refusal kindly and considerately expressed loses half its bitterness, and often inspires hope, instead of discouragement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank proceeded to the office of the tea company and formally resigned his agency. He was told that he could resume it whenever he pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving the store, he walked down Broadway in the direction of Wall Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He passed an elderly man, with stooping shoulders and a gait which showed that he was accustomed to live in the country.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was looking about him in rather an undecided way. His glance happened to rest on Frank, and, after a little hesitation, he addressed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boy,\" he said, \"do you live around here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I live in the city; sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I guess you can tell me what I want to know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will if I can, sir,\" said Frank, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whereabouts is Wall Street?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Close by, sir. I am going that way, and will be happy to show you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank had no idea his compliance with the stranger\u0027s request was likely to have an important effect up his fortunes.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2988/82402.html","bookId":324,"creation":"Aug 2, 2019 8:12:37 AM","modification":"Aug 2, 2019 8:12:37 AM"}
