{"id":54990,"no":1045,"title":"Chapter 1041 God Beast Mystic Realm","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1041 – God Beast Mystic Realm\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior Huo, is that Lin Ming?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf the two strangers from different clans, the woman turned to look over all the disciples before her eyes finally fell onto Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust from looking at him, she couldn’t see anything special about Lin Ming besides his solid foundation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He defeated Crimson Strifecloud of the same age?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!” Huo Violentstone said in a satisfied voice as he stroked his beard.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm…” The woman fell into thought, not saying anything. Since Huo Violentstone said so, then even if there was some exaggeration to his stories, they were mostly true. Even so, she found it hard to believe that this handsome young man before her was such an extraordinary chosen pride of heaven.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There is Lin Ming as well as Yan Littlemoon with her perfect Ancient Phoenix bloodline. Senior’s harvests during this Ancient Phoenix smelting trial aren’t too bad!” The man from the two strangers politely said. His status was somewhat lower than Huo Violentstone’s.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is the most glorious moment that my Ancient Phoenix Clan has experienced for the last several tens of thousands of years. Of my Phoenix Clan’s two great branches, the Ice Phoenix Patriarch has gone off to who knows where and returned to some strange polar land. As for my Fire Phoenix Clan, it is hard for us to handle everything alone. We’re not like your Kirin Clan. You have several great branches supporting each other so it’s much easier for you fellows to grow and develop.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe phoenix was one of the rarest God Beasts of the Divine Realm. As for the kirins and dragons, there were many more of them. The Ancient Phoenix Clan only had two branches: the Fire Phoenix Branch and the Ice Phoenix Branch. However, the Kirin Clan actually had four branches: the Electric Violet Kirin, Fire Kirin, Water Kirin, and Umbral Kirin Branches. They had over 200 billion clansmen among their ranks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior Huo is too humble. Just your Fire Phoenix Clan is grand enough to compare favorably with two or three branches of our Kirin Clan. It seems that Senior is planning to allow Lin Ming and Yan Littlemoon to attend the journey into the God Beast Mystic Realm to explore and gain experience?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s the plan!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Violentstone nodded. The reason that Monarch Sweetyfox and Duke Golden Sword had come to Fire Spirit Star this time was to observe Yan Littlemoon as well as receive and bring her to the God Beast Mystic Realm to gain experience. They never imagined that they would find an even greater pleasant surprise in Lin Ming, to a degree that even Huo Violentstone was alerted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe God Beast Mystic Realm was located in a separate world from the Divine Realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Realm didn’t have only 3000 great worlds. Rather, there were countless worlds that existed around these 3000 worlds, with numerous mystic realms and near-endless space.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe God Beast Mystic Realm was located in one of these chaotic mystic realms. Its position was one of the greatest secrets of the four God Beast Clans.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the hidden treasure of the four God Beast Clans.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Kirin Clan woman looked at Lin Ming and Yan Littlemoon. She nodded and said, “The four great clans can only allow an extremely limited number of people to enter the mystic realm each time. The Ancient Dragon Clan accounts for most of the quota. As for the remainder of the spots divided amongst the rest, each one is extremely valuable. They do have the qualifications, but…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf the four great God Beast Clans, the Ancient Dragon Clan was the most overbearing and arrogant. But, they indeed had the capital to be overbearing. They had the richest bloodline resources, and their strength was greater than the other three clans’ combined together!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe strength of the four God Beast Clans added together could compare with a World King Family, and this was mainly because of the Ancient Dragon Clan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd the reason that the four God Beast Clans could continue to obtain the God Beast bloodline and preserve the God Beast Mystic Realm was also mainly credited to the Ancient Dragon Clan. Otherwise, there might be some World King level influences that would move against the God Beast Clans and wrest away the God Beast Mystic Realm as well as the four God Beast Clans’ bloodline strength. Although the God Beast bloodline was extremely thin, the quality was correspondingly extremely high. It was immensely beneficial to a powerhouse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Kirin Clan woman’s words trailed off, but Huo Violentstone could clearly understand her meaning. She wanted to experience Yan Littlemoon’s strength, and especially Lin Ming’s strength. After all, one couldn’t simply rely on rumors and hearsay; seeing was believing. When Huo Violentstone had described Lin Ming, it had all seemed too exaggerated. Even though the Kirin Clan woman knew that Huo Violentstone wasn’t one to speak nonsense, she still couldn’t believe his words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Violentstone stroked his beard and smiled, saying, “Lin Ming, Yan Littlemoon, the two of you go into the 18 Hells of Flame and rush as deep as you can.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Violentstone had left the Sacred Flame Testament for Lin Ming to meditate on for 200 days. Then he left Fire Spirit Star. Afterwards, for Lin Ming’s training, he didn’t question him and an entire year had passed in the meantime. He didn’t know just how Lin Ming’s cultivation had gone and he also wanted to take a good look at how he was now. This could be considered the final test before the Ancient Phoenix smelting trial ended.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I wonder just how much this brat managed to perceive from the Sacred Flame Testament, and just how much he comprehended of the fourth level Concept of Fire.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Violentstone mumbled to himself. He had great expectations in his heart. The seventh level of the Hells of Flame was called the domain of god. As for the eighth level, that was simply unimaginable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming nodded. Rushing through the Illusionary God Combat Array was troublesome but rushing through the 18 Hells of Flame was much faster. In the last four months, he had used the majority of his time to meditate on the Laws. The 18 Hells of Flame was a place where he could temper and verify the Laws he had learnt. Normally he couldn’t go too deep into the Hells of Flame, otherwise his consumption of energy would be too great and he wouldn’t be able to last too long; that wasn’t too helpful for training. Thus, Lin Ming simply didn’t know just what his limits were.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, he could finally test it out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithout further ado, Lin Ming broke straight into the 18 Hells of Flame. He opened the Gate of Wonder and Mystic Lightning Shade, hurtling deep into the Hells of Flame at a breakneck pace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA fire spirit mirror appeared in the sky above the square. The fire spirit mirror was thousands of feet long and Lin Ming was clearly reflected in it; this was naturally the handiwork of the Ruby Sovereign.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the disciples of the three branch palaces looked up at the vast fire spirit mirror in the sky, all of them were filled with rabid excitement. They also wanted to see just what progress Lin Ming had made in the last year. It had to be known that Lin Ming usually trained in the seventh level 5000 mile distance, so a thought would always pop up in these people’s minds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust where was Lin Ming’s limit?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I wonder if Junior-apprentice Brother Lin can break through the limit of the eighth level…” White Daohong whispered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBeside him, Lu Xiaoyun also watched the fire spirit mirror in the skies, her vision a bit blurry. “The eighth level. That is a legend among legends, a myth beyond reckoning. I simply cannot imagine it. When I attended the Ancient Phoenix smelting trail for a second time, even I wasn’t able to step into the eighth level…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 18 levels of the Hells of Flame became much more difficult the further down they went, nearly growing at an exponential rate. The difficulty soared at the seventh level 5000 mile mark, but at the eighth level, the difficulty took a qualitative leap forwards. It had to be known that even characters like Lu Xiaoyun and White Daohong could only reach the eleventh level at the moment, and both of their cultivations were two large boundaries higher than Lin Ming’s.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s speed was extremely high. Even at the third level he could maintain a velocity 30 times the speed of sound!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis time, he no longer needed to reduce his speed to temper his Laws. His only goal now was to plunge downward as far as he could and find out just where his limits lay!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFourth level broken!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFifth level broken!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYan Littlemoon had rushed through the Hells of Flame with Lin Ming and was rapidly flung far behind, the distance growing larger and larger between them. Although Yan Littlemoon was a stunning character in her own right, the difference between her and Lin Ming was too great.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore long, Lin Ming broke into the sixth level.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point his speed had already reduced by a great deal. The pressure of the sixth level was not minor. The reason that Lin Ming lowered his speed was not that he couldn’t maintain it, but because the consumption of energy would have been too great. Since he was trying to break past all previous records, he had to save his true essence and physical strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHalf an hour later, Lin Ming shot into the seventh level. Then, he reached 5000 miles deep into the seventh level.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis depth was the depth that Lin Ming usually trained at. When he trained here he could do so for several days at a time. Training for such a long time would exhaust nearly all of Lin Ming’s energy. Each time he finished training here he would reach his limits, and his entire body would be burnt black and made into a miserable appearance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePushing oneself to the limit was the most crude and brutal, yet effective method to comprehend the Laws.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeventh level 6000 miles, seventh level 7000 miles, seventh level 8000 miles…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s speed continued to decline. When he reached the seventh level 9000 mile distance, that was his first time reaching such a depth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this depth, Lin Ming simply felt as if he were in the midst of a sun. The flames here had long since turned into pure light. This was because the little particles had been heated up to such a mind-boggling degree that they began to release blazing light!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs this fiery light fell onto Lin Ming’s body, it fused with the spiritual fire origin energy within him, transforming it. This was an expression of the Concept of Manifestation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this depth, Lin Ming felt a tremendous pressure on him. His protective true essence was compressed to within three inches of his body. Moreover, it began to emit crackling noises as if he couldn’t withstand such a great pressure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s thoughts focused and his mind touched upon the Heretical God Sprout.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeretical God Force – open!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, the three flame leaves of the Heretical God Sprout began blooming with a brilliant radiance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming became a flaming meteor that plunged towards the eighth level!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the sound of rolling thunder, the space barrier of the eighth level was shattered by Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that time, he had truly entered into the eighth level of the Hells of Flame!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1040\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1042\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1041","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
