{"id":54051,"no":106,"title":"Chapter 105 Torrential River Rope!","content":"\u003cp\u003e\u003cstrong\u003eChapter 105 – Torrential River Rope!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Even though I will be punished, it is far better than being surpassed by Lin Ming in the future!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Moreover, a dead genius is no longer a genius. The Seven Profound Martial House will not kill me over someone who is dead. With the Tenth Prince secretly helping me, the worst that will happen is I will be dismissed from the Martial House and banished or exiled to the frontier.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut to Zhu Yan, being banished didn’t mean anything anymore. As for being dismissed from the Martial House, although it was a pity, it was absolutely worth it as long as he could kill Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the only chance he had to assassinate Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, did he really have the ability to kill Lin Ming?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn his heart, Zhu Yan lacked confidence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I still have my strongest martial skill. But, this martial skill has an enormous toll on the body. I can usually only display 60% of its full might, but if I recklessly stimulate myself to force out 100% of its abilities, I might damage my meridians. If I damage these meridians, it will be difficult to connect and open them, and become a great barrier when I want to break through to the Pulse Condensation Period. But since it’s come to this point, I have no other choices left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhu Yan’s face flashed with ferociousness as he triggered all of the true essence in his body to the limit. The Scarlet Flare sword in his hand began to issue out a shrill, keening sound.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhu Yan’s going to go all out!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What a terrifying true essence force! I’m afraid even a martial artist at the Bone Forging stage does not have such terrifying true essence!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter everyone realized that Lin Ming had perceived the secrets of the ‘Body Tearing Bone Shattering Fist’ through meditation, no one doubted Zhu Yan’s strength again. That Zhu Yan could exchange blows for such a long time with a monstrous genius like Lin Ming was testament to his extraordinary skill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming faintly smiled as he felt a heavy murderous intent emanating from Zhu Yan. ‘You want to go all out? Then I’ll follow you!’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the very start of the fight until now, Lin Ming had been gathering his potential!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though he had been using his full strength with every strike, he had been saving his momentum!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo constantly use moves and save momentum; this was the key to gathering one\u0027s potential in a fight!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow all of Lin Ming’s potential was poured into the Penetrating Rainbow spear, waiting for this last, final strike!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This fight today, is the most important fight in my life so far. And Zhu Yan, he is also the most important opponent in my life so far. In the Seven Profound Martial House’s entrance examination’s Dream Trial, he was the cause for the flaw in my heart. Today, I and Zhu Yan will put forth our strongest moves, and I will defeat him to complete my perfect heart of martial arts!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming walked forward step by heavy step, the hard floor tiles underneath him cracked and exploded into flying shards. Lin Ming’s right arm was flat and smooth, and lay upon Penetrating Rainbow. This was the most basic spear stance, ‘Iron Bridge Blocks the River’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYet in Lin Ming’s hands, even such a simple stance gave off a boundless feeling of vigor. The dark purple Penetrating Rainbow was calm as if it were a cast iron statue. It was like a rope that stretched across a torrential river. No matter how the river flowed and surged, it was unable to shake that rope a single inch.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnmovable no matter the force, ‘Iron Bridge Blocks the River’!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s the ‘Foundation Spear Technique’ stance, ‘Iron Bridge Blocks the River’!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heavens! I finally get to see Senior Apprentice Brother Lin Ming’s ‘Iron Bridge Blocks the River’ in action again!” A little girl half a year younger than Lin Ming clenched her fists in excitement. Her face was ruddy with joy. She had just entered the Human Hall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo many of the lower disciples in the Human Hall, Lin Ming and his ‘Iron Bridge Blocks the River’ stance were a legend!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany of the lower disciples from the Human Hall came from a humble birth and background, and their worth was meager. In the Seven Profound Martial House, because they were the most basic and lowest of disciples, they did not have any nice cultivation methods to choose from. Although they had the glory and honor of being a disciple of the Seven Profound Martial House, they did not entertain high hopes for the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming, who had also came from a humble birth, had used the ‘Foundation Spear Technique’ to defeat Zhang Cang, a master of the Earth Hall! And he had used the ‘Iron Bridge Blocks the River’ stance!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a miracle!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn Lin Ming’s hands, the simple, minimalist ‘Iron Bridge Blocks the River’ stance had become tranquil and immutable like a mountain! Any magnificent or exquisite martial skill was broken by a single spear!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA lone strength to shatter 10,000 styles!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe only person in all of the Seven Profound Martial House who could use the ‘Foundation Spear Technique’ to resist Zhu Yan’s finishing blow was Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing Lin Ming’s ‘Iron Bridge Blocks the River’, Zhu Yan’s complexion became filled with unprecedented dignity.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the most important match in his entire life. Even if Lin Ming used the ‘Foundation Spear Technique’, he would not look down on a single fine hair of his. Against such a monstrous genius of perception, any cultivation method in his hands could be turned into a divine miracle!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hah!” Zhu Yan shouted. The silk clothes that covered his upper body began to burn up in flames from the searing air waves that were condensed by his true essence. The charred fragments of his clothes fluttered down to the floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhu Yan ripped off his robe like a slip of paper and tore it to shreds. He revealed a toned, muscular upper body, but because of the high amount of true essence that converged on him, his skin was red like a fiery demon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Scarlet Flame sword in his hands combusted into a brilliant, shimmering flame. Zhu Yan could not yet feel the fiery true essence damaging his meridians, but the pain was like countless flame needles that gripped him. However, this pain had actually filled Zhu Yan with a bloodthirsty excitement. \u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Die!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhu Yan’s still body suddenly soared upwards into the sky. Whistling flames in the air formed together into phantasmal illusions. Zhu Yan gripped his sword with both hands and lifted it high above his head. His spine curved like a drawn bow. Fire true essence began to gather all around Zhu Yan. It condensed together and turned into a blood-red lotus that began to quietly bloom in the air…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Red Lotus Purgatory!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe entire space seemed to flash black for a moment. This strange red lotus swallowed that dark light, and it was as if it contained not just true essence, but had also gathered the blazing sun!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing Zhu Yan’s killing move, at that moment, Lin Ming’s mind was calm like water. His ears had lost all outside noise, whether it was the sound of burning flames, or the cheers and shouts of the audience.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn his vision, he only saw Zhu Yan. In his heart, there was only the Penetrating Rainbow!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of his momentum had gathered into Penetrating Rainbow. The strong true essence violently vibrated. Lin Ming thrusted out his spear, and it was like throwing down a mountain!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s spear and Zhu Yan’s ‘Red Lotus Purgatory’ frantically collided. There was a loud, deafening detonation like a rumbling thunderbolt. That intense collision of true essence sparked a fierce shockwave, along with a ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eka ka ka’\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e sound as the Martial Stage was destroyed. Large broken pieces of tiles flew off everywhere in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA silhouette wrapped in crimson flames flew outwards and loudly hit a column on the Martial Stage. Along with a breaking sound, the stone column was smashed apart from the center!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis silhouette was Zhu Yan. At this moment his entire body was bathed in blood. He was unconscious on the ground, life or death unknown.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd Lin Ming was not feeling good. He was injured in the impact of that terrifying strike, and he had flown backwards several dozen feet before using Penetrating Rainbow to steady himself in the air and fall on the ground with the support of the spear shaft.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis blood began to roil, and he almost spat out blood, but by revolving the ‘True Primal Chaos Formula’, he was just able to press it down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What a ferocious move. If I had not learned to gather my momentum and set all of it aside for a final blow, then just that move a moment ago would have defeated me, the best case was both of us being wounded! The aftermath of the impact broke through my protection of vibrating true essence and only almost made me cough blood. This was thanks to my true essence from the Large Success in Viscera Training, otherwise that strike would have injured my internal organs and caused me to be severely wounded.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhu Yan’s last move had gone all out and overdrawn his strength. His injuries this time will not be light.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eZi zi zi…\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the fragments of flames still burned, the entire audience was dead silent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the pinnacle of battle! Even two peak Bone Forging martial artists could not be so intense!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhu Yan was already a top-tier talent, but Lin Ming had actually jumped up half a realm to defeat him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Did Zhu Yan die?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That last move of of Zhu Yan’s was an absolutely desperate one with his life on the line. ‘Red Lotus Purgatory’ is not a martial skill Zhu Yan can use. He has overdrawn his true essence.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Overdrawing true essence will harm one’s cultivation. For Zhu Yan to do that in order to win this match, his obsession runs too deep. But even so, Zhu Yan was defeated. This Lin Ming is truly terrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were many masters and experts present; they had naturally seen how the final fight had played out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven several elders of the Martial House were present. They had seen the murderous killing intent contained in Zhu Yan’s final move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I find it strange. Even though Lin Ming’s perception is good, his martial talent is bad. It should be impossible for him to progress so quickly, and yet in these last two months his cultivation has leapt up an entire realm. How was this possible?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This… seems to be because Lin Ming has comprehended some kind of martial intent.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Martial intent? What’s that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well… I have only heard about it. I don’t know the specifics, but it should be powerful.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo of the low-level Human Hall disciples were having a casual conversation; however their conversation had been overheard by one of the top 50 disciples of the Ranking Stone. His eyes immediately widened, “What did you just say? Martial… martial intent? Lin Ming had comprehended a martial intent?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Uh, yes.” That low-order disciple said with a look of bewilderment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who told you that!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat Heavenly Abode disciple was suddenly all excited; this made the low-order disciple feel a bit of fear. Facing a top 50 ranking disciple of the Heavenly Abode, it was impossible for them not to feel pressured.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This… this matter was said by the deacon of the Icy Pond Waterfall, Senior Apprentice Brother Xie Dong…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Xie Dong…” The Heavenly Abode disciple gulped. Although Xie Dong had not reached the Pulse Condensation Period, he was a deacon who had worked at the Seven Profound Martial House for many years. His experience was vast, and it was impossible for him to be so wrong.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Lin Ming, had actually managed to comprehend a martial intent!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe perception of a monstrous genius, a pure and strong heart of martial arts that was a cut above everyone else, and he also had a martial intent!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was just too terrifying! \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the medical personnel of the Seven Profound Martial House hurried onstage to apply medicine to Zhu Yan. But Lin Ming had already stepped down from the Martial Stage. His true essence had already been depleted from the fight, and at present his combat strength had fallen by several levels. He might not even be able to hold off a normal Third Stage of Body Transformation martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut still, there was a hidden aura on Lin Ming’s body that emanated. Along with his formidable strength and monstrous perception he had just displayed, this made those people looking at him feel bursts of pressure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the dread that came from seeing a powerhouse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Lin Ming stepped down, several of those nearby pulled back. Even the martial artists that had been famous for a long time stepped made way with respect. And those low-order disciples who had idolized him, only worshipped him Lin Ming with more fanaticism.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mister Lin Ming! Congratulations!” Crown Prince Yang Lin stood up from afar and warmly greeted him. Among his words was just the right amount of veneration. This was the respect he demonstrated to a powerhouse, and had disregarded his status.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-104\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-106\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-105","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
