{"id":55071,"no":1126,"title":"Chapter 1122 Perfect Spirit Body","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1122 – Perfect Spirit Body\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Riverbliss’s complexion changed. If there was some accident with the array formation and the phenomena from Lin Ming’s Ninefall were revealed to the world, that would not be good for Carefree Island, which needed to be inconspicuous in this period of time. This was particularly true since there were projections of two sets of transcendent divine mights involved.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Riverbliss’s figure flashed and she appeared at Xiao Haogan’s original position. She formed runes in her hand, sending them out into the air again and again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe other Elders had also reached their limit. Their true essence was in a miserable state. They had originally thought that it was overdoing it to have 12 Elders work together to stabilize the array formation, but now they knew that the 12 of them actually weren’t enough!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNobody thought that a mere junior crossing Ninefall would actually produce world Laws that were strong to such an extent! In that vast origin energy cloud, it was unimaginable how much energy and how many world Laws existed. None of them were able to resist it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd Xiao Haogan had been acting as the eye of this array formation, thus he naturally bore the greatest brunt of the impact. Once the array formation had a problem, he would be the first one to be pushed out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Riverbliss was still at a half-step World King after all. Underneath her careful management, Lin Ming’s Ninefall world phenomena were finally suppressed by the array formation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd at this time, Lin Ming’s Ninefall had reached 32 Layered Heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this stage, the speed at which the origin energy cloud was expanding had slowed. Even so, it still slowly spread out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e97 miles, 98 miles, all the way to 99 miles!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the origin energy cloud finally stopped growing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e33 Layered Heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 33 Layered Heavens were the 33 Akashic Heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the 18 Heavens that diverged from the Nine Firmaments, in addition to the Four Immaculate Heavens, the Six Heavens of Desire, the Four Buddhist Heavens, as well as the Highest Immortal Heavens, that was a total of 33 Heavens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“33 Layered Heavens…” At this time, Mo Eversnow’s entire being shook. Even she didn’t understand just where the limits of Ninefall lay.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStories and legends of the 33 Layered Heavens had existed for a long time, but Mo Eversnow had never noticed that the 33 Layered Heavens corresponded to a 99 mile origin energy cloud.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNine through nine return to one, after 99, the first numeral was one, just like a cycle of samsara.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe number 99 in itself contained the highest truths of the Heavenly Dao.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNine was the extreme of all numbers, and three was the beginning of all numbers!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was said that the Divine Law gave birth to one, one gave life to two, two formed three, and after three came all of life. Life carried yin and held yang, filled with energy and thoughts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Law gave birth to one meant that the Heavenly Dao was the one true existence. The Heavenly Dao was the source of all existence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOne gave birth to two meant that the Heavenly Dao evolved into yin and yang energies. Yin and yang energies were the source of all matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo forming three meant the contradictions that existed between yin and yang energies. This was the so-called ‘charge’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis ‘charge’ could be understood as the interaction of yin and yang particles. This was also the ubiquitous ‘power’ that existed in the universe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ‘three’ from ‘after three came all of life’ wasn’t just a random number. Rather, it was yin energy, yang energy, and charge. All three evolved together, forming the boundless universe!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Realm had 3000 great worlds, the lower realms contained triple thousand worlds, a thousand times a thousand times a thousand worlds, there were 33 Layered Heavens, and the origin energy cloud could grow to 99 miles!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, Mo Eversnow seemed to become aware of something in her heart. She could deeply feel the perfection that was the Heavenly Dao. Every tiny facet of the Heavenly Dao was filled with reasoning and truth!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNinefall was the path a martial artist had to take to become divine. They had to accept the baptism of the Heavenly Dao which contained the greatest truths in the universe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy being able to withstand the baptism of all Laws from the 33 Layered Heavens, the advantages Lin Ming would obtain could be imagined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven Mo Eversnow, who was simply watching, still obtained a certain awareness from witnessing the evolution of the Heavenly Dao. Although she couldn’t use this awareness to directly increase her strength and cultivation, in the future, if she was able to reform her body, then she could use this experience to enhance her training.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu - !\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, all of the power of blood within that sea-like origin energy cloud suddenly gathered together.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that massive vortex, all of the world Law fragments in the origin energy cloud tumbled together, rolling up into the flesh and blood!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe highest truths of the Heavenly Dao formed lines that engraved themselves into the marrow. The Law fragments evolved into runes that buried themselves deep in the flesh and blood!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This… the Laws are being swallowed… too quickly, too easily!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Elders of Carefree Island saw the massive amount of Law fragments being swallowed up by Lin Ming like a whale drinking water, all of their eyes turned red with jealousy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese were Law fragments from the 33 Layered Heavens, a perfect Ninefall. There were countless truths and comprehensions contained within them. They were something that innumerable Divine Lord powerhouses would never be able to perceive in their entire lives!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, these Laws were rapidly absorbed into Lin Ming’s body in just a short several breaths of time. Even if he couldn’t comprehend them now, they would help him break into the Divine Sea in the future. Afterwards, his comprehension of the Laws would come at an astronomical speed! This was a great lucky chance that others would die for!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the most important role of Ninefall. The better a Ninefall, the better foundation a martial artist would have for breaking into higher boundaries in the future.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd Lin Ming’s foundation was already as solid as the endless earth. Not to mention a 100,000 foot tall building, even a rolling green mountain a thousand miles wide could easily lay upon it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Lin Ming was in a completely trance-like state, detached from the world around him. He constantly fused with the Laws and energy, withstanding this once in a lifetime lucky chance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis process continued for an unknown period of time. In that chaotic origin energy cloud that contained infinite Law fragments, time seemed to lose all meaning.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming felt as if thousands of years passed through his mind. But, all of that happened in just the blink of an eye. He had fully absorbed the world Law fragments.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThen, his flesh and blood finally began to slowly condense.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom a stream of blood, he slowly reformed his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFirst was the spiritual sea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s consciousness gradually became clear and his senses began to return to him. At this time, he felt as if he could discern every minute change in the world around him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe could feel everything outside of the origin energy cloud, grasping it all with utter clarity. He could sense the body of each disciple and Elder of Carefree Island, making out their metabolism, blood flow, heartbeat, breathing, everything fell into his senses.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnts coming and going, flowers blooming, the breeze blowing, the rain falling, as long as Lin Ming wished, all of this would be clearly reflected in his mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAwareness of sense…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis boundary suddenly appeared in Lin Ming’s mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe knew that his senses had undergone a heaven-shaking transformation. This naturally came from his soul reaching perfection after crossing Ninefall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe seventh, eighth, and ninth stages of Life Destruction were to temper the soul. After Ninefall, he would leave behind his common body, his soul force would reach the peak, and his senses would also become extremely perceptive.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter this, if one reached yet a higher boundary, one would be able to clearly see the composition of a human’s cells. And beyond that, for those Holy Lord and World King level powerhouses, they could even see the tiny particles that formed all matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd deeper, beyond even that, there was the boundary of legends, where one could clearly see the internal structure of these tiny particles and even gaze upon the changes of yin and yang energies themselves!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the past when Lin Ming mediated on the chaos stones in Totem Tower, he had relied upon the Primordius martial intent to see the evolution of yin and yang energies, thus obtaining a tremendous advantage. If his senses became sharp enough, he could directly see the movements of yin and yang energy in matter itself. The benefits from this could be imagined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming’s consciousness was alive and freed, he began to watch his own dantian form.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFirst was the black hole revolving core.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore a martial artist reached the Divine Sea, they would have a revolving core. In front of Lin Ming, energy began to collapse as a massive amount of Law fragments was sucked into the black hole revolving core, becoming a part of that glossy black crystal core. With this black hole revolving core as a foundation, Lin Ming’s flesh and blood slowly condensed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom organs, meridians, skeleton, fascia, muscles, limbs, skins, facial features, to hair.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s mortal body had completed its ninth reorganization, and also its last reorganization.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe origin energy cloud swirled. The power of the stars, moon, and sun all gathered up, swelling through Lin Ming and washing every inch of his flesh and blood. At this time, Lin Ming’s entire body shined with a brilliant glassy radiance. There wasn’t the slightest impurity within his body. His aura was like that of a divine immortal fallen down from the highest heavens, proud and aloof, living apart from all of the world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe origin energy cloud naturally formed clothes that covered Lin Ming’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy now, Lin Ming’s body had reached perfection!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s over… this is Lin Ming’s Ninefall, 33 Layered Heavens, a 99 mile origin energy cloud…” Mo Riverbliss muttered to herself. She found this hard to believe, even after seeing it with her own eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 33 Layered Heavens should be the peak of Ninefall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I never thought that Lin Ming dual cultivated body and energy. Although he was hindered a bit in his Ninefall because of the conflicts between the body transformation system and the essence gathering system, he actually obtained a tremendous advantage instead. The more accumulations he has, the greater the eruption will be.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll around Carefree Island, many Elders and direct disciples were still dazed. Everything that happened had simply been too shocking for them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the opinion of Carefree Island’s Elders, the absolute three levels was already the limit of Ninefall and everything beyond that was a legend of a legend. Even so, that was only 15-16 Layered Heavens. To them, being able to form a foundation of just a single Layered Heavens above that was an extraordinary accomplishment. But now, Lin Ming had flipped over everything they had known.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e33 Layered Heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Akashic Heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming can truly become a Great World King… to think I was able to witness the Ninefall of a Great World King. Moreover, I even experienced life or death dangers with him in the Red Desolate Mystic Realm. This is truly unbelievable…” Ye Rosewater whispered. She found all of this hard to believe. In truth, although the mission into the Red Desolate Mystic Realm had been filled with dangers, she and her subordinates had escaped safe and unscathed because of Lin Ming. Nothing that happened had gone beyond Lin Ming’s control. Even White Mirrorjade’s betrayal didn’t faze him. At this time, the feelings in Ye Rosewater’s heart were far too complex.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s finished?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming gripped his fists together, feeling his body filled with strength. His true essence had risen, his soul had become complete, and the Laws had been engraved within him. This experience had deeply carved into him an appreciation for Ninefall!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now, he felt as if something was wrong, as if something was missing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat’s right, what about the world seed?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Ninefall, when a martial artist left their common mortal physique and began to develop a divine form, the symbol of this was that their dantian would open up into a world seed. In the future when this martial artist became a Divine Sea master, this world seed would sprout and become a minor dimension.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now, Lin Ming didn’t feel a world seed within his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd at this time, Mo Eversnow looked up at that origin energy cloud. Her face was solemn and grim. “How is this… the Ninefall is over, so how come there is still so much energy left in those origin energy clouds, and how come they haven’t dispersed yet?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1121\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1123\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1122","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
