{"id":55074,"no":1129,"title":"Chapter 1125 Nine By Nine Life Destruction","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1125 – Nine By Nine Life Destruction\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStarlight shined from the heavens. Lin Ming grasped the Phoenix Blood Spear, his long hair recklessly fluttering in the wind as blood vitality surged within him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom all around, the Elders of Carefree Palace fell into a deep silence. Lin Ming had really crossed the five element grand tribulation. He had done so by relying on his powerful vitality as well as his enduring willpower!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, his blood and flesh began to regenerate as his wounds slowly healed over.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He’s crossed the five element grand tribulation. Although Lin Ming was seriously injured, once he recovers his benefits will be enormous! This is truly incredible. For Lin Ming to arrive at this step is not just a perfect Ninefall, but something that exists even beyond Ninefall, giving him more and more benefits.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Riverbliss’s voice shivered as she spoke. This was just like an imperial civil service examination of the mortal world. Lin Ming had crossed Ninefall and had reached 33 Layered Heavens; this could be considered a perfect score. This was enough to become the number one scholar of the land. But, above a perfect score were additional subjects. The five element tribulation that Lin Ming passed could be considered equal to these additional subjects.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor Lin Ming to reach this step could be said to be serendipity. This was not something that a genius could do if they wished it. One needed countless lucky chances aligning together to produce this opportunity. It was not an event that could be repeated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic Cube, two sets of transcendent divine mights, and a dual body and energy cultivation with the first six of the Eight Inner Hidden Gates opened. Each step Lin Ming took could be called perfection. Only by having all of these together was he able to galvanize the heavenly tribulation against him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the time that Lin Ming was at the Houtian realm, the resources he had consumed were several boundaries above what the average martial artist at his realm should have needed. When he was at the Body Training boundary he used the Revolving Core realm’s Shattered Demon Heart Crystal, when he was at the Houtian realm he used the Life Destruction realm’s Nirvana Dragon Root, when he was at the Xiantian realm he used the Divine Sea realm’s heaven-step Demon God Bone, when he was at the Revolving Core realm he used up a massive volume of resources that even a Divine Kingdom would find hard to withstand, and now at the Life Destruction realm, he used the phoenix blood essence and Ten Severing Dao Fruit Tree that would move a Holy Lord, and there was also the supreme dragon bone that would drive a World King powerhouse insane with jealousy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of those lucky chances had accumulated along the way, and now they had all exploded together, leading to Lin Ming’s current achievement!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“World seed, world seed…” Lin Ming closed his eyes, casting his sense through his body. He didn’t find the world seed, but he did discover that in withstanding the five element tribulation, his willpower had risen to another level. Unknowingly, his elementary gold battle spirit seemed as if it would break through its shackles and reach the small success gold level.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My world seed…” Lin Ming faintly frowned. Then, he looked up at the sky, seeming to realize something. Dark clouds surged above him, the energy still gathering as before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is… it’s still not over!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s mind shook. As he discovered this anomaly, so did Mo Riverbliss and Mo Eversnow. They looked up at that tribulation cloud and cried out in alarm, “The heavenly tribulation hasn’t ended!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s not just the five element tribulation of metal, wood, water, fire, and earth, there is also wind and thunder! That tribulation cloud still contains the energies of wind and thunder!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe five elements were considered to be metal, wood, water, fire, and earth, and often wind and thunder were placed among them. But, the truth was that wind and thunder didn’t belong to the five elements. Rather, they belonged to the eight trigrams.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe heavenly tribulation formed from these two energies was even fiercer than the five elements tribulation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEspecially thunder tribulation – that was the main form of heavenly tribulation. In the fables, thunder was the power of heavenly retribution wielded by the divine gods as they punished all who violated heaven’s will.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow gazed at the tribulation cloud in the sky that was becoming increasingly thick and strong. She grimly said, “Metal, wood, water, fire, earth, five elements tribulation as well as tribulations of wind and thunder, for a total of seven different kinds. Perhaps seven different variations of tribulation isn’t the limit…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Three represents the beginning and nine represents the limit. This is why Life Destruction takes three as a unit and nine as perfection. When some unparalleled great monsters cross tribulation, they often have to cross nine levels of heavenly tribulation. Perhaps what Lin Ming has to experience is not only wind and thunder, but two more tribulations after that, for a total of nine tribulations!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Two more tribulations… this is…” Mo Riverbliss was stunned. But, she also agreed with Mo Eversnow’s thoughts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThroughout the whole and complete journey of a martial artist’s Life Destruction, they had to cross Life Destruction nine different times. Every three stages of Life Destruction was a division. The first three stages of Life Destruction were the division of ‘essence’. Essence was the flesh and blood, and also the formation of the mortal body. The second three stages of Life Destruction were the division of ‘energy’. Energy meant the reformation of the dantian. Finally, the last three stages of Life Destruction were the division of the ‘divine’. The divine meant the soul, and was also the reformation of the soul.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEach division took three as a unit for a total of nine. They were respectively the tempering of essence, energy, and divine, three different types.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the final ninth stage of Life Destruction, it also took ‘three’ as a unit. Each Layered Heavens was represented by three miles. The lowest Ninefall would produce a three mile origin energy cloud, and every rank upwards increased by another three miles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter reaching the 33 layered Heavens, there would be a 99 mile origin energy cloud. This was the extreme of both three and nine, embodying the perfection of Heavenly Dao everywhere. Now that Lin Ming was crossing heavenly tribulation in an incomparably perfect situation, he wouldn’t stop at just seven variations of tribulation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt should be a total of nine times!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Mo Riverbliss saw each heavenly tribulation that Lin Ming faced become increasingly strong, she had no idea just how mighty the last two tribulations would be.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What Lin Ming is crossing is not some normal Ninefall. Every heavenly tribulation he crosses is a baptism of his body, his true essence, his soul, and even his will! Every tribulation he crosses could be considered a minor stage of Life Destruction. Lin Ming’s Ninefall is not a simple ninth stage Life Destruction, but can be considered nine by nine Life Destruction!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLife Destruction took nine as the peak; it was impossible for there to be 10 stages of Life Destruction because that would violate the rules of the Heavenly Dao. However, between nine and 10 also existed nine by nine numbers – this was also nine by nine Life Destruction, the limit of all limits!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNine by nine Life Destruction, that was a completely different form of Life Destruction!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Mo Riverbliss and Mo Eversnow were speaking, the great tribulations of wind and thunder had arrived!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStreams of tribulation wind rushed down, as black as ink. They were like vicious black flood dragons, growling and clawing all over. They emitted ghostly screams, as if countless miserable souls were contained within them! Such wind caused one’s scalp to tingle. This was more terrifying than the space storm experienced by someone ascending from the lower realms to the Divine Realm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd following hot behind this wind tribulation was thunder tribulation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis thunder tribulation was already difficult to describe. All that was visible was a vast purple sea with countless arcs of lightning flashing within it. This purple sea covered all of Carefree Palace. Between the heavens and earth, all that existed was this blinding and glorious purple light!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe tribulations of wind and thunder erupted at the same time!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePuff!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll around Carefree Palace, the Elders that were responsible for managing the array formation suddenly shook. The array discs beneath them exploded into powder and they vomited blood as they flew backwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven Mo Riverbliss paled. She was forced back again and again!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe power of the Heavenly Dao cut apart all cages and shackles. No one was able to help Lin Ming cross his tribulation. Even if they were only trying to withstand the energy shockwaves of the Heavenly Dao, they could still suffer a gruesome backlash. This was not a matter of cultivation. The stronger a person was, the stronger the power of heavenly tribulation they would have to withstand!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the Heavenly Dao would not obliterate all existences that violated its rules with supreme and unstoppable power. As the saying went, the heavens would never cut off all exits. The Heavenly Dao would always leave behind the slimmest chance of survival!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese were the Heavenly Dao Laws, sacred and inviolable. Even so, the Heavenly Dao allowed challengers, and those with surpassing strength could even defy the will of the heavens. From this, one could see that the Heavenly Dao was filled with contradictions. It was impossible to speculate on the workings behind it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is bad!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Mo Riverbliss was forced back, her thoughts linked to Carefree Palace. She used the power of Carefree Palace and opened up the island’s great protective array!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy now, she finally understood that it was impossible to confine the Heavenly Dao energy from Lin Ming crossing Ninefall. If she tried, she would suffer a counterattack from the Heavenly Dao. All she could do now was activate the island’s great protective array formation and conceal the entire area, having all of Carefree Island vanish for a period of time. She could only hope that no supreme elder happened to pass by the Red Desolate Sea, otherwise they would inevitably see the strangeness occurring at Carefree Island.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This power… the power of the Heavenly Dao, this is not something that a human can contend with!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Elders of Carefree Island saw even Mo Riverbliss receive a minor wound due to a backlash from the Heavenly Dao, all of them cried out in alarm. In their eyes, Mo Riverbliss was a god-like character.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey turned to that terrifying wind and thunder tribulation that blotted out the sky; it was like the end of times was arriving at their doorstep. Was this really something that a human could resist?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Will Lin Ming perish here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough everyone was perfectly aware that Lin Ming’s strength was extraordinary, none of the Elders could maintain their confidence in him as they gazed up at that terrifying heavenly tribulation. Before they could think further, Lin Ming was already swallowed up by that wind and thunder tribulation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnderneath the vast might of heaven, Lin Ming was like a piece of cotton fluff caught up in a giant summer storm, unworthy and insignificant!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood of the Ancient Phoenix – combust!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeretical God Force – erupt!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming put forth his full effort. Behind him, the Prime Emperor Lotus Flower appeared, a deep red like it had just drunk its fill of blood. It began to bloom in vivid beauty!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Prime Emperor Lotus Flower was similarly swallowed up by the wind and thunder tribulations!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe power of the Heavenly Dao was irresistible, unstoppable! Before the Heavenly Dao Laws, the strength of the living seemed far too weak and fragile!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hurry and retreat! Retreat!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Elders and direct disciples of Carefree Island all withdrew as they faced this thunder tribulation, lest they be touched by it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was heavenly tribulation brought about by that monstrous genius Lin Ming! Without needing to say it, those direct disciples knew that if they were even scratched by this power they would turn to dust!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the many Elders, none of them dared to allow the heavenly tribulation near their bodies. Although they far surpassed Lin Ming in strength, this heavenly tribulation was not any ordinary kind of energy. If they were to touch it and offend its glorious majesty, it would surely lead to a mutation in the heavenly tribulation and that backlash would fall upon them. The higher their cultivation was, the stronger the heavenly tribulation would become. This was why cultivation was useless in front of heavenly tribulation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNone of them believed that their talent could be compared with Lin Ming’s in any way. The heavenly tribulation that he aroused could truly be described as an apocalyptic hell!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCarefree Island’s main island had already been overturned by the heavenly tribulation. A massive number of palaces and pavilions were left in complete ruins by the wind and thunder tribulation. Carefree Palace’s buildings and spirit trees, once swept by the black tribulation wind, would immediately turn to ash. As for that tribulation thunder, it would leave behind sundered and scorched earth wherever it went.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eRumble rumble rumble!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe earth trembled. Massive swathes of land turned into dust, completely disintegrated. Giant gaping chasms appeared in the ground, slowly filling with water and forming massive lakes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnderneath this stifling dark purple apocalyptic scene, no one was able to use their divine sense to investigate what was happening within the wind and thunder tribulation. Even Mo Eversnow and Mo Riverbliss were no exception.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey waited for half an incense stick of time. Finally, the wind and thunder tribulation began to slowly die down until it completely faded away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe energy between the heavens and earth gradually dissipated as everything returned to quiet. As for where Lin Ming was standing before, there was nothing left there but a fathomless hole.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone couldn’t help but look at that hole. “Lin Ming, he’s still standing there!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heavens! He… he… he…!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of Carefree Island’s disciples cried out in horror. Even Ye Rosewater subconsciously covered her mouth, her lips and fingers shaking. Her heart was filled with both concern and chaos. Even someone with tough nerves like Ye Rosewater didn’t dare look down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1124\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1126\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1125","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
