{"id":55118,"no":1173,"title":"Chapter 1169 Finally Stepping Into the Divine Sea","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1169 – Finally Stepping Into the Divine Sea\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTraining passed without sense of time. Unknowingly, three months went by.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause Lin Ming displayed Heavenly Dao Judgment, there was a deficit of blood energy within his body. However, he had restored this half a month ago. According to the Celestial Tyrant Manual, the less blood essence one consumed, the faster it would regenerate. If one consumed a great deal such as 50%, then it might even take over half a year to recover. If one consumed over 50%, then not even the Gate of Life’s powerful life force restoring abilities would be able to completely restore it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter three months, Lin Ming’s essence, energy, and divine had reached the limit. The inner world seed within him had shrunk to the size of a grain of rice and was verging on the edge of eruption.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe more concentrated the world seed was, the greater the explosive force would be once it erupted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu hu hu –\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the dimensional realm, strong winds stirred. Endless heaven and earth origin energy gathered, forming a massive whirlpool-shaped origin energy cloud in the sky. The central focal point of this origin energy cloud was a 100,000 foot high crimson mountain peak. Lin Ming sat at the very summit of this peak, deep in meditation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e100,000 feet was nearly 50 miles. If this were the Sky Spill Continent, this altitude would have long since pierced through the primal chaos heavens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut in this sealed world, this height only just touched the infinite thunder clouds in the sky, bringing them in reach of one’s fingertips.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming slowly opened his eyes from meditation. He stood up, the strong winds surging past him. Lin Ming’s white clothes violently fluttered in the air as his long hair whipped about him. Beside him, 12 thick iron chains were like 12 dragons, one end wrapped around the mountain peak with the other end extending into the vast and boundless skies.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThree months of accumulation… no, it should be 10 years of accumulation. Lin Ming had first crossed Life Destruction at 22 years of age. Now, nearly 10 years had passed. Everything so far had been for this final moment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd the nine stages of Life Destruction had taken Lin Ming 10 years of time. He had nearly crossed a stage each year! Solid, step-by-step, steady and without a single shortcut taken.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis speed was considered relatively slow for a Divine Realm genius. However, such a patient and steady cultivation speed had brought tremendous benefits to Lin Ming. It had formed the foundation for him to hurtle into the future, overcoming all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eToday, Lin Ming would finally break into the Divine Sea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDivine Sea, Divine Transformation, Divine Lord, these three large boundaries and nine small boundaries were collectively called the Nine Divine Shifts, similar to the nine stages of Life Destruction. Ninefall was to overcome mortality and the Divine Sea was to transform into the divine. After reaching the Divine Sea, Lin Ming would have completed his transformation from mortality and began stepping into the realm of god.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu –\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu –\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe strong winds became increasingly violent! The center of the origin energy cloud turned into a funnel that came extending downwards. In the skies, dark clouds extended for 10,000 miles, with countless flashing arcs of thunder shining from within as if an immortal god of thunder swelled in there. And beneath the mountain peak, an inexhaustible sea of lava and flames surged about. Volcanic explosions continued without end, sending molten lava tumbling into the skies!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming took out the Boundless World Pill from his spatial ring. All of the energy within his body was gathered in his dantian, rushing into his world seed without a care for the consequences. The Heretical God Force opened, the blood of the Ancient Phoenix combusted. Together with the endless origin energy in the clouds above him, Lin Ming crazily absorbed it all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs energy constantly entered him, the world seed within Lin Ming’s dantian began to radiate a blinding light. The world seed continued to shrink, going from the size of a grain of rice to the size of a needle’s eye, and still condensing even beyond that!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the legends, when the universe first formed, it had begun from an infinitesimally small point. All of the grandmist energy in creation had been concentrated in that tiny dot, finally exploding outwards and creating the endless universe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, the formation of Lin Ming’s inner world followed the same principles as the eruption of the universe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boundless World Pill!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming already felt that his inner world had been compressed to the limit. Then, he crumbled the Boundless World Pill in his hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the pill shattered, the world spirit sealed within the center of the pill turned into an incomparably pure world power that flew into Lin Ming’s body, all of it absorbed by him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis pill that had been won with 7 trillion violet sun stones was the most valuable peak quality pill that a Divine Sea martial artist could use. Even the top genius of a Great World King Holy Land would find it difficult to use!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, this world spirit completely fused into Lin Ming’s world seed. At this time, his world seed finally exploded into pieces!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCountless tiny cracks appeared on this world seed that was smaller than a needle’s eye. An endless amount of energy erupted and Lin Ming’s dantian instantly collapsed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEnergy transformed into an incomparably terrifying storm, rushing outwards with utter brutality. All of the clouds for thousands of miles around were completely washed away by the shockwaves!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd after the raging storm of energy dissipated, Lin Ming’s body had actually vanished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn this 100,000 foot high mountain peak where one could touch the skies, a completely sealed space distortion appeared in the air. The power of time, the power of space, everything was completely twisted up in here. Even light was affected, unable to maintain a straight line.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s body was sealed up within this space distortion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a cocoon formed from a space distortion!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd Lin Ming was sealed within this cocoon, undergoing his transformation from Life Destruction to the Divine Sea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe wind had already stopped. The surging thunder and the billowing lava had died down. The endless amount of heaven and earth origin energy no longer formed violent and dangerous fluctuations of energy. Rather, it turned into fist-sized balls of glowing light. These balls of glowing light were mostly red and purple, but there was also yellow, blue, black, green, white, and every other possible color imaginable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMore and more of these glowing balls of light appeared. From tens of thousands to hundreds of thousands to millions and even more, until it seemed like an infinite sea of lights. From a few dozen miles, it rapidly expanded to a thousand miles, filling the entire world with a beautiful glow. Looking from afar, it seemed like a single infinite rainbow had appeared, beautiful and charming, stretching to infinity.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow slowly floated in the skies, looking at these endless beautiful balls of light as well as the giant cocoon floating within them. Strange and mysterious Law runes emerged from the cocoon and wrapped around it, as fantastical and amazing as a dream.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWorld seed shattered and dantian transformed into a minor dimension – this was the symbol of the Divine Sea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd after reaching the Divine Sea, the Laws that a martial artist comprehended would become a part of their system and also become the Heavenly Dao Laws of this minor dimension.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe massive cocoon floating in the air was a projection of the Laws from Lin Ming’s inner world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, one could only wait. Lin Ming’s body, soul, his everything was being transformed within this cocoon. This process might take one to two months of time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, that didn’t mean there were no risks during this period. When Lin Ming truly began stepping into the realm of god, he would have to experience and overcome his heart demons. Because his consciousness had already entered a completely different space-time realization, Lin Ming’s dreams of his heart demons might continue for far longer than a month or two.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll martial artists would have to experience their heart demons when they crossed into the Divine Sea. There were very few people that would die because they couldn’t overcome their heart demons. But, if they were influenced by their heart demons, this would cause the evolution of their soul to be incomplete, making their divine foundation unsteady.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of this would depend on Lin Ming himself. Mo Eversnow simply meditated in front of the giant cocoon, resting her soul form.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the cocoon, Lin Ming was like a baby that hadn’t been born. His arms were wrapped around his knees and his body was rolled up. His entire body was naked, no different from a baby. While a baby would soak in amniotic fluid, what Lin Ming rested in was a sea of Laws.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLaw runes appeared periodically on Lin Ming’s body before fading away. Lin Ming’s eyes were closed, unaware of all this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDeep in sleep, Lin Ming’s face was sharp and clear. His long hair hung down, covering his strong back. His tough and long legs were filled with an explosive power. Every inch of his flesh, every fiber of his muscles, it was all a work of perfect art. In this cocoon, his body, his soul, everything he was began to subtly change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn a dim haze, Lin Ming seemed to return to his childhood, and countless memories of it rushed back into his mind. All of them were strange, confusing, and unable to be discerned clearly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThen, everything rapidly changed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was chased down by Tian Mingzi. Mo Eversnow was destroyed, her soul fading into ashes. He himself was severely wounded. His boundary dropped and he would never be able to advance again in his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThen, the secret of the Magic Cube was exposed. Every martial artist under the heavens began to hunt him down. Finally, Lin Ming died without a burial ground and even his homeland, the Sky Spill Continent, was exterminated by Tian Mingzi’s underlings.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of these scenes were images that suited the weakness in Lin Ming’s heart.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a heart demon, all-pervasive and perpetual. As long as a human held desires or fear, they would inevitably have heart demons. The evolution of the soul was followed by the manifestation of these heart demons. If one wasn’t able to overcome them then their divine foundation would be damaged.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFortunately, Lin Ming’s will was incomparably powerful. He soon discovered the shadows of these fears and completely crushed his heart demons!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe saw himself killing Tian Mingzi, becoming an Empyrean, helping Mo Eversnow reforge her body, rebuilding the Verdant Feather Holy Lands, and then climbing to the peak of martial arts. There, he surpassed the boundary of Empyrean, becoming immortal and everlasting, an existence that would last for eternity. Like this, tens of thousands and hundreds of thousands of years passed. He held the world in his hands, controlled the samsara of life and death, and dominated the Heavenly Dao Laws. This feeling was incomparably realistic and wonderful.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis sort of heart demon was a manifestation of Lin Ming’s desire to reach the peak of martial arts!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if Lin Ming’s will was strong, when facing such a heart demon, the effect of his willpower would be greatly diminished. This was because Lin Ming’s will and determination to chase after the peak of martial arts was very strong, and correspondingly this heart demon was also strong, much mightier than anything an ordinary martial artist could dream of.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming wandered about this illusionary dream. He seemed to awaken and also fall asleep, again and again. He experienced lifetimes of great sadness and also lifetimes of great joy. Then, his mind suddenly shook. It was like he had seen the ends of the heavens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere, a phantom of the Magic Cube, Demon Bead, and Purple Card appeared. An icy feeling rushed through his body and Lin Ming suddenly awoke!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming examined his body, he found that his dantian had already disappeared, replaced by a minor dimension!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe world power of the Boundless World Pill had already fused into this minor dimension. The evolution of his world had come to an end.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, outside of the massive cocoon, the endless rainbow origin energy light that extended for thousands of miles suddenly gathered together, forming millions of phoenixes and fire birds that flew towards the center, all of them submerging into the giant cocoon. For a time, a blinding light filled the world, illuminating the heavens with shimmering multicolored lights.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow’s eyes suddenly shot open. She knew that at this moment, Lin Ming had stepped into the Divine Sea!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1168\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1170\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1169","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
