{"id":55175,"no":1230,"title":"Chapter 1226 Lin Ming, Dragon Fang","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1226 – Lin Ming, Dragon Fang\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming quickly looked through the jade slip. He saw an influence that might have been founded by Tian Mingzi, the Skydark Holy Lands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Miss Mo is speaking about… the Skydark Holy Lands?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes! I am speaking of the Skydark Holy Lands. Tian Mingzi’s original surname was Nether, and the influence he originally founded was called the Netherworld Holy Lands. Afterwards, he changed the name to the Skydark Holy Lands. Nether Limitless is Tian Mingzi’s descendant!” Mo Eversnow coldly said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHaving her sect exterminated, having her mortal body destroyed, having her soul sent into a deep slumber for 50,000 years, having all of her remaining family members separated, having her countless followers killed off, this hatred, this animus, this grudge was absolutely irreconcilable; the two of them would never be able to live under the same heaven!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow wished to tear Tian Mingzi to pieces with her own hands, char his bones to ashes, and torture his soul for eternity!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I understand.” Lin Ming looked at Nether Limitless’s ranking. Divine Seal Decree ranked 18!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo be ranked 18\u003c/span\u003e\u003cspan style\u003d\"\"\u003eth\u003c/span\u003e\u003cspan style\u003d\"\"\u003e in the entire Divine Realm, this was truly an extremely exaggerated result!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You must defeat him in these semifinals. If we cannot even defeat Tian Mingzi’s descendant, then it will be stupid to continue discussing killing Tian Mingzi!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow said that if Tian Mingzi was young and joined the Divine Realm First Martial Meeting, his results would be no worse than those of an Empyrean descendant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I will.” Lin Ming nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the skies above Lin Ming suddenly twisted, forming space ripples. Then, a massive spirit ship came zooming out of these space ripples, its massive body casting a shadow over the entire horizon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis spirit ship was dozens of miles long and 10 miles wide. The entire spirit ship exuded powerful fluctuations of energy; it was clearly a spirit artifact.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe spirit ship steadily came to a stop. A middle-aged man in white clothes shot out from the spirit ship and floated high in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis person was seven feet tall. As he stood in the air, faint halos of light formed behind him. His every action and movement seemed to spur fluctuations of Laws.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This person is…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming looked up. All the participants who had passed the preliminaries also looked towards this person.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Everyone!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe white-clothed man began to speak, his voice loud and sonorous, easily spreading over a thousand miles. Everyone in this range was able to clearly hear him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I am the 76th disciple of Vast Universe Heavenly Palace. Under the bidding of Elder Senior-apprentice Brother, I have come to pick you up and bring you to Gravemoon Star. That is also where the semifinals will be held. This journey will last for three months. All of you may prepare and then we shall leave.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the white-clothed man’s words, everyone was secretly shocked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn Empyrean level influence had countless disciples. However, if there was a disciple that had their own ranking, then that could only be a direct disciple of an Empyrean.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn Empyrean could live for nearly a hundred million years, and thus they would take several hundred direct disciples over the years. On average, they would take in a disciple every few hundred thousand years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf these people, the most amazing of them would become half-step Empyreans and the others would become Great World Kings or ordinary World Kings.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, there would occasionally be a peak monstrous genius that would become another Empyrean. In recorded history, there were records of Empyrean level influences that had two Empyreans. The power of these influences reached a terrifying degree!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd this white-clothed man in front of everyone was an ordinary World King powerhouse!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“A World King was actually sent to come pick us up?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was a bit stunned. This was a tad too grandiose and luxurious. With 30 semifinal areas, that meant there were at least 30 World Kings that were sent out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow spoke up from within Lin Ming’s spiritual sea, “This person is only a wisp of an incarnation. A top powerhouse can form myriad incarnations with a thought to handle multiple matters.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I see…” Lin Ming was filled with praise. This white-clothed person’s incarnation was far too lifelike – he couldn’t even figure out how it was different from that person’s true self.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t have matters he needed to finish. He directly flew onto the spirit ship.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the spirit ship there were many different dimensions. There were lush grasslands, vibrant forests, fields with spring flowers, and much more, everything filled with vitality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDozens of beautiful women were already waiting on the spirit ship. They were responsible for leading the many participants to their own rooms.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery individual had their own roomy independent dimensional space that they could rest in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming arrived at his resting area, he felt that this place was the perfect cave dwelling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was a special cultivation room, there was a martial field to practice on, there was an alchemy room, a refining room, and even a medicine garden filled with spirit herbs that were all free to use.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Just the heaven and earth origin energy in this spirit ship is better than the best cultivation area of an ordinary Holy Land. It’s about the same as the best training rooms at Imperial City Auction House.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming said with wonder. This was only a spirit ship and its main use was to shuttle martial artists around. If this were Vast Universe Heavenly Palace instead, then the conditions that one could cultivate in would truly be unimaginable. This was the background of an Empyrean level influence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMo Eversnow said, “This spirit ship itself is a high-grade spirit artifact. It is equipped with array formations that are specialized to gather heaven and earth origin energy. The value of this entire spirit ship is similar to Carefree Island’s Carefree Palace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA spirit ship used to pick up and shuttle martial artists was actually comparable to Carefree Palace, the spirit artifact that Carefree Island used to stabilize its own destiny. From this alone one could infer the difference between an Empyrean level influence and an eighth-grade sect.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Young Hero Lin, if there is anything that you desire to eat then please select it on a jade slip and place it in the transmission array. We will immediately send you anything you wish.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe young woman that guided Lin Ming respectfully said as she pointed to a table.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming glanced over to see that there were 10 jade slips set on the table. He casually picked up a jade slip and looked through it. Recorded on this jade slip were several hundred different types of dishes and drinks, all of varying styles. With 10 jade slips, there were thousands upon thousands of different types of food.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese dishes and drinks were all cooked with various heavenly materials, spirit Lingzhi, and spirit herbs. They were all truly worthy of being called top class delicacies. Although the materials weren’t as precious as dragon bones and phoenix marrow, it was still food that would cause geniuses of Holy Lands to feel pain in eating.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven so, these were only ordinary meals provided to participants of the semifinals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming picked up an empty white jade slip and randomly selected some dishes and recorded them on it. Then, he placed it on the transmission array. Before even an incense stick of time had passed, a box reappeared, wrapped in jade petals. After opening it, the thick and fragrant smell of medicines and food mixed together wafted up to his nostrils.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Smells delicious.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming acclaimed. He bluntly took out the food and set it down. But, just as he was about to eat it, his thoughts suddenly stirred. He placed down his chopsticks and walked out of his own cave dwelling. He could see that standing just outside the entrance of the cave dwelling was a black-clothed youth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis black-clothed youth was handsome and thin. His eyes were dark and bright and he had short hair, neatly trimmed, that hung down to his ears. His skin was amazingly pale and one could even make out the blue veins that crawled beneath his skin. His hands were covered with bandages and the bandages were even wet with blood. He wore a strangely-shaped ring on his hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy just standing there, this youth was like a treasure sword sheathed in its scabbard: sharp but restrained.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s pupils shrank. He instantly recalled a name. in the entire True Martial Great World, only this person should be able to give him such a deep feeling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dragon Fang?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two young men nearly spoke out at the same time. Then, they both laughed at the same time, their eyes shining with a blazing fighting intent!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a feeling that only occurred when two peerless heroes of an era encountered each other. While they longed to defeat the other, they also clearly understood each other.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s a pity that I couldn’t meet you during the preliminaries. I wanted to duel you but you didn’t emerge often to hunt. I missed you the several times that you were out, and when the third round of eliminations began I had already left True Martial World!” Dragon Fang said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Same here. Your whereabouts were mysterious and unknown so I never managed to run into you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe both of them were peak geniuses of their generation and they both also regarded the heat of battle as one of the most important aspects of their lives. To be rivals of the same age in the same era, only a battle between such top geniuses could cause one’s blood to boil with excitement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Our battle will come sooner or later. I feel that you didn’t display your true strength in the preliminaries. You should be an interesting opponent.” Dragon Fang said as he looked into Lin Ming’s eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That makes two of us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming faintly smiled. Facing Dragon Fang, he could clearly feel the great strength of this young man. This feeling did not come from reading the other person’s cultivation, foundation, Laws, and judging their comprehensive strength. Rather, it was a feeling completely based on one’s intuition. This was the intuition Lin Ming had developed from engaging in countless battles and defeating innumerable peak talents of his level.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I will wait for you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As will I!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming rode the spirit ship to Gravemoon Star, in the Good Fortune Great World, the Unbroken Cult was preparing for their own journey.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe strongest disciple of the Unbroken Cult, Yu Youming, had finally ended his adventure in the First Martial meeting. His final result was far from being able to pass the preliminaries, thus he was eliminated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, people from the Unbroken Cult had boarded a spirit ship and were preparing to go to Gravemoon Star.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Cult Master, who hadn’t even come out to watch the First Martial Meeting, specifically left \u0026nbsp;seclusion in the Unbroken Cult and planned to meet them midway.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis lineup was the grandest and most dignified gesture that the Unbroken Cult made to pay a visit to someone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, within the spirit ship, Yu Youming was looking at Mu Qianyu and Qin Xingxuan, a strange look on his face. He found it impossible to believe that their husband had actually managed to reach the top 1000 rankings of the Divine Seal Decree and ranked first on the True Martial Great World.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had to be known that Yu Youming’s final ranking was less than 200,000 on the Good Fortune Great World. In the third round of eliminations he had been one of the weak martial artists that simply wasn’t able to survive at all. He had been brutalized and killed by the nightmare beasts countless times.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnly by personally experiencing the third round of the First Martial Meeting preliminaries was he able to understand just how abnormal and monstrous the peak participants were. In Yu Youming’s eyes, they weren’t even human!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnce, he had been chased from heaven to hell by 20 some nightmare beasts. Any one of these nightmare beasts could have killed dozens of him. However, they weren’t good in speed and thus he had been able to temporarily preserve his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd after he had been fleeing for a quarter hour, he ran into a martial artist. This martial artist only used a single sword strike to cut down all of those 20 some nightmare beasts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfterwards, Yu Youming learned that the martial artist who did this was ranked around 70 on the Good Fortune Great World.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA 70\u003c/span\u003e \u003cspan style\u003d\"\"\u003esome place ranking to the first place ranking, just what sort of disparity was that?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYu Youming felt that the difference between him and Lin Ming had reached an unimaginable degree. He even doubted whether or not the husband of these two women was truly Lin Ming, who had once been ranked first on the True Martial Great World. Perhaps there might have been a mistake.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1225\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1227\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1226","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
