{"id":55200,"no":1255,"title":"Chapter 1251 To Climb the Peak","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1251 – To Climb the Peak\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He has fused the Space Laws into his sword. Using the vibrations of space, he broke through my Concept of Wind!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Bloodless Sword’s attack failed, he drew backwards. Dragon Fang’s attack had horrified him. With his attack just now, he had used a boundless sword energy to mix up the air currents, causing all the sword energy within the area to turn violent, forming something similar to a sword domain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis sword technique was far, far away from being able to cause space to tremble with sword energy; it was only creating a faintly similar phenomenon. But, this was already amazing enough. Bloodless Sword had defeated countless opponents with this move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now, Dragon Fang’s sword strike had truly disrupted space and easily broke apart Bloodless Sword’s attack. His comprehension of the Space Laws was actually formidable to such a ridiculous degree.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Too terrifying!” Bloodless Sword tightly gripped his sword hilt. He realized that this Dragon Fang standing on front of him, among his contemporaries, was the most powerful opponent he had ever faced!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, Dragon Fang raised his sword.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs his sword flashed, Dragon Fang’s star-bright pupils changed, condensing together into a single point. All around his pupils, countless mysterious patterns appeared. These eyes seemed filled with unfathomable mysteries, shrouded in darkness, causing everyone to be unable to fully look at his eyes!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Bloodless Sword saw these pupils, he felt his entire body go ice cold. At this time, Dragon Fang finally slashed out with his sword!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs this sword cut outwards, Dragon Fang’s figure divided into eight, attacking Bloodless Sword from eight directions!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBloodless Sword was left in a complete panic!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSpatial mirror images, divided into eight. This was someone that had truly stepped into the fifth level Concept of the Space Laws!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe fifth level of the Space Laws was far more difficult to reach than the elemental Laws. Even an extremely talented character like Nether Limitless had only managed to trace the threshold of the fifth level Law Concept. To be able to divide into four spatial mirror images was something that had shocked everyone present, but now Dragon Fang had truly comprehended the fifth level Concept of Space!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow was this possible…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBloodless Sword felt his entire body freeze. At the moment when Dragon Fang displayed such ridiculous power, it had nearly broken apart his sword heart, making him lose all courage to resist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe difference was too great!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eResistance, any resistance, was useless!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Absolute Star Sword!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBloodless Sword clenched his teeth and spurred the power of stars, striking out with his most powerful move. At this time, all the starlight in the skies seemed to gather together in a river of sparkling light, falling down in an incomparably gorgeous manner.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, when the sword light that Bloodless Sword sent out collided with Dragon Fang’s attack, it was instantly exterminated by the combined attack of the eight spatial mirror images!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWoosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEight figures gathered as one. Dragon Fang appeared behind Bloodless Sword like ghosts and demons. The curved Dragon Fang Blade touched against Bloodless Sword’s back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You have lost.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang lightly said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, Bloodless Sword’s entire body was stiff. His palms and his back were already dripping with sweat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTerrifying!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was an indescribable feeling. At the moment Dragon Fang rushed towards him, he had seen Dragon Fang’s pupils, and those eyes made Bloodless Sword feel as if he had died.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was no possibility of resisting!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eDrip drip!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDrops of sweat fell to the ground, rolling down from Bloodless Sword’s fingertips. The energy that still percolated in the air was broken down by the invisible Empyrean pressure, turning into fog before vanishing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBloodless Sword was frozen, resembling a statue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe billions of people in the area were left in complete silence!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat a horrifying Dragon Fang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the skies, at some unknown time, Xiao Daochild had risen up. As he looked at Dragon Fang, there was stark shock in his face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is only the semifinals, and yet a peerless genius has appeared. This Dragon Fang’s talent is terrifying beyond description!” Xiao Daochild took a deep breath. This was something completely beyond his expectations.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I must report this matter to Senior-apprentice Brother Vast Cosmos, but… Senior-apprentice Brother Vast Cosmos is likely already paying attention to here…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the arena was silenced for several breaths of time, there was an eruption of loud discussion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dragon Fang is too strong! Although Bloodless Sword is inferior to Nether Limitless, these are still top masters of 100 great worlds. The New Paradise Holy Lands is a Great World King Holy Land of a first-order world, but even so, Bloodless Sword didn’t even have the confidence to continue fighting Dragon Fang!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Bloodless Sword cannot be blamed. That is truly impossible to resist. When Dragon Fang divided into eight spatial mirror images, that is over double what Nether Limitless was capable of! At such a young age, he managed to comprehend the fifth level Concept of the Space Laws. That is simply the talent of a monstrous genius!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Space Laws are far more difficult to comprehend than the five elemental Laws. But once understood, they are far more formidable! It’s hard to imagine just what Dragon Fang’s achievements will be in the future. Even an ordinary Empyrean descendant cannot compare!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Dragon Fang is far stronger than Lin Ming!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There is no limit in this universe – there is always a higher mountain and a stronger master, so this isn’t strange at all! If this were extended to the quadrillion trillion lives of the entire Divine Realm, the number of geniuses that emerge from that number would be unimaginable. This gathering, this Divine Realm First Martial Meeting, is truly magnificent!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were simply far too many geniuses!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang, Xiao Moxian, Fairy Frost Dream, White King, Lin Ming…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCompared to them, Nether Limitless had been completely overshadowed. Because of Lin Ming’s age, he also appeared a bit too immature.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Nether Limitless was still standing on the altar steps, and he had witnessed the complete process of Dragon Fang and Bloodless Sword’s battle. A miserable and mirthless smile flashed across his face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe knew that Dragon Fang was several years younger than he was! And not just that, but Dragon Fang had taken the domain he was most proud of, the Space Laws, and had thoroughly defeated him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOne of the greatest attacks on one’s mentality was to be completely surpassed in the domain that they excelled at. This competition on the Divine Seal Altar was a tremendous blow to Nether Limitless’s confidence!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the heated and zealous cheers of billions echoed through the arena!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey were all cheering Dragon Fang’s name. The entire arena was roused into an incomparably wild frenzy!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Too strong! Perhaps during this Divine Realm First Martial Meeting, Dragon Fang can compete with the likes of Xiao Moxian and all the others!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right, in these semifinals on Gravemoon Star, Dragon Fang is the strongest! Just now he displayed the fifth level Concept of Space and easily defeated Bloodless Sword. He has yet to reveal his true strength. Who dares to say that he doesn’t have his own transcendent divine might?!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Speaking of transcendent divine mights, the top three of the Earth Proclamation are able to study a transcendent divine might, and Dragon Fang will surely be one of them! However, it is still unknown whether or not he can defeat Empyrean descendants on the level of Xiao Moxian; we still have no understanding of how strong they are. As for Lin Ming, although his talent is extremely high, his strength is still lacking that final bit. It shouldn’t be a problem for him to reach the top 10 rankings of the Earth Proclamation. But, reaching the top 10 rankings of the Heaven Proclamation would be too difficult!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“In the future, Dragon Fang and Lin Ming are sure to become Great World Kings. Two Great World Kings have gathered here, just how abnormal is that!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe billions of people were all frantically speaking amongst themselves. On the Ancient Phoenix Clan’s side, Fairy Feng felt her heart rapidly beat. These juniors were scarily fierce!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He really is strong.” Lin Ming thought to himself as he looked on at Dragon Fang. Although he held back his strength in his battle against Nether Limitless, who knew how much Dragon Fang had held back?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBloodless Sword simply didn’t have the qualifications to make Dragon Fang reveal his true strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn Lin Ming’s opinion, Dragon Fang could only be described as unfathomably deep. He was a truly terrifying opponent!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was curious as to just what fortuitous encounter Dragon Fang had.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Those pupils…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn Vast Universe Heavenly Palace, Vast Cosmos rubbed his forehead, sifting through his memories, deep in thought.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe many World Kings had been shaken by Dragon Fang’s last attack. Lin Ming had shocked them, but Dragon Fang even frightened them a little.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNone of them realized how strange Dragon Fang’s pupils were. Or, it was more correct to say that although they noticed it, they didn’t pay much attention to it. In the Divine Realm, there were far too many special bloodlines and physiques. It wasn’t uncommon at all for someone with strange pupils to appear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVast Cosmos pondered for a long time. Then, he quietly formed some seals with his hands. He completely recorded Lin Ming’s transcendent divine might and Dragon Fang’s special pupils in these seals, directly sending this notification to his Honorable Master – Empyrean Vast Universe!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, on Gravemoon Star’s Divine Seal Altar, cheers rushed through the arena like surging ocean waves, continuing for a quarter hour before gradually dying down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe supervisor of this semifinal, Xiao Daochild, floated high in the skies above the Divine Seal Altar, looking down at Lin Ming and Dragon Fang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You two… are very good! This is not the first time that I have presided over the Divine Realm First Martial Meeting. But in the last several hundred thousand years, less than 10 people have ever managed to earn such praise from me. But in these semifinals alone, there are actually two of you!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e “In my life, I have witnessed countless geniuses, many of them extreme unrivalled talents of their era. But you two have left a deep impression on me, and the reason for this is...your backgrounds!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Divine Seal Altar is laid out before you. The 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step! The 33\u003c/span\u003e\u003cspan style\u003d\"\"\u003erd\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step! Climb as high as you can and push out the limit of your potential! Let me see just how high your hands can reach!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Daochild rarely spoke so many words. Ever since the start of the semifinals, besides announcing the rules, all of the other words he spoke combined together didn’t add up to what he just said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven so, Xiao Daochild had only said ‘let me see how high your hands can reach’, instead of ‘let me see if you can mount the summit’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn other words, Xiao Daochild believed that even though Lin Ming and Dragon Fang had reached this level of talent and strength, they still didn’t possess the ability to ascend to the top.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough this Divine Seal Altar was only a replica, it was still a treasure personally refined by Empyrean Vast Universe, an Empyrean spirit treasure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWanting to reach the top during the Divine Sea realm, wasn’t that easier said than done!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s finally begun!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is the final battle! I thought that it would be between Nether Limitless and Bloodless Sword, but I never imagined it would be a battle between these two dark horses! This is far more exciting than anything that could happen between Nether Limitless and Bloodless Sword. I wonder just how far they can climb up the last two steps of the Divine Seal Altar?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I think that Dragon Fang can climb up higher. As for Lin Ming, although he won’t be able to climb higher than Dragon Fang, he should still be able to reach the 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the legends, the last several times the Divine Seal Altar had been used in the First Martial Meeting, no one had been able to climb to the 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step, let alone the 33\u003c/span\u003e\u003cspan style\u003d\"\"\u003erd\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Now, let’s go!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming and Dragon Fang looked at each other, both able to feel a soaring fighting spirit blazing from each other’s eyes. The two of them both jumped up onto the cliffs of the Divine Seal Altar’s 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 100,000 thousand foot cliff stood tall, towering into the skies, piercing through the heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pressure on the 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step was far higher than the pressure on the 31\u003c/span\u003e\u003cspan style\u003d\"\"\u003est\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step. Lin Ming instantly felt this change in pressure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What a powerful pressure. Since it’s going to be like this, then let this Empyrean pressure be even stronger!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1250\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1252\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1251","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
