{"id":55210,"no":1265,"title":"Chapter 1261 Lin Ming’s Heavenly Tribulation","content":"\u003cp\u003e\u003cspan\u003eChapter 1261 – Lin Ming’s Heavenly Tribulation\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Dragon Fang was defeated. It really is impossible for a Divine Sea martial artist to climb up this Divine Seal Altar that Empyrean Vast Universe created!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Even Dragon Fang was defeated, but he was able to crawl up 80,000 feet. That beats the top record of Vast Universe Heavenly Palace, it\u0027s amazing!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs the billions of people in the audience saw Dragon Fang wrapped in energy and slowly brought down from the Divine Seal Altar, all of them were shocked. This was truly a rare semifinals seen once every million years! To witness an unrivalled genius climb up the Divine Seal Altar was a truly unique experience. To the young geniuses present, this experience could broaden their world and even affect their future achievements to a certain extent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“We still fall far too short.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“There is no limit in this universe. There is always a higher mountain and a stronger person. I originally thought Bloodless Sword and Nether Limitless were fierce, but I never imagined that they would be nothing compared to Dragon Fang.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“We have to work harder. After all, Dragon Fang and Lin Ming’s backgrounds aren’t that outstanding!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNone of them knew that in truth, Dragon Fang was the successor of an Empyrean.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Don’t be so hasty in your assumptions. It’s possible that Dragon Fang has an extremely strong master behind him that we cannot understand. As for that Lin Ming, I really have no idea what sort of heaven-defying lucky chances he has experienced. It is impossible for a genius to accidentally grow to this level.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs everyone was speaking, their eyes naturally gathered onto Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNow, on the entire Divine Seal Altar, there was only Lin Ming left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Ming was now 68,000 feet high. He had just entered the thunder dominion and would have to experience two great tribulations before reaching the 80,000 foot height that Dragon Fang had climbed to.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“It’s already a surprise that Lin Ming can arrive at this height!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“No kidding. Out of all the geniuses on the Divine Seal Altar, his cultivation was the lowest. I never imagined he would be the one to last the longest, but he is still worse than Dragon Fang. Perhaps the Thunder Source killing formation at 70,000 feet will end his journey!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn everyone’s eyes, although Lin Ming was inferior to Dragon Fang, he was also an extreme genius. He was a character with unlimited future prospects.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBillions of people watched Lin Ming. His speed wasn’t fast, but every step he took was steady.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEndless waves of thunder crashed onto Lin Ming, baptizing him in reckless streams of electricity. Even from afar, this was still a creepy and heart-stopping scene.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe numerous young elites present found this hard to imagine. If they were placed in that thunder dominion, they knew what fate they would suffer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e69,000 feet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e69,500 feet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e70,000 feet!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Ming had finally climbed up to the great tribulation of Thunder Sources.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA great tribulation of 27 Thunder Sources; even Dragon Fang hadn’t been able to completely withstand it. He had to completely overdraw his strength and even then he has lost his right eye. This has caused Dragon Fang’s strength to greatly drop, and the consequence of this was his immediate defeat at 80,000 feet!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“A great tribulation of 27 Thunder Sources! Before, these Thunder Sources were all dispersed by Dragon Fang. Will Lin Ming still encounter them?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“I have no idea. If Lin Ming can avoid this tribulation of Thunder Sources, then that will be his luck!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“If so, then Lin Ming’s results will be much better on the 33\u003c/span\u003e\u003cspan\u003erd\u003c/span\u003e\u003cspan\u003e\u0026nbsp;step.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAlthough it was said that Thunder Sources and Fire Elementals were nearly impossible to annihilate, once they were scattered they still required some time to reform. Everyone was guessing that Lin Ming would take advantage of this brief period to bypass the test at 70,000 feet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs everyone was thinking this, there were suddenly loud rumbling sounds echoing from the purple sea above the Divine Seal Altar’s 33\u003c/span\u003e\u003cspan\u003erd\u003c/span\u003e\u003cspan\u003e\u0026nbsp;step. An infinite power of thunder gathered, forming numerous phantom figures!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThese phantoms had the appearances of all sorts of strange and unusual vicious beasts; they were the 27 Thunder Sources!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“They’re here! The great tribulation of Thunder Sources! Moreover, they haven’t weakened even a bit from Dragon Fang’s time! The Divine Seal Altar isn’t ordinary at all. One cannot rely on any type of opportunistic trick to climb past it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Let’s see how Lin Ming will cross this!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWhen Dragon Fang had faced the tribulation of 27 Thunder Sources, he had used his true body to destroy several Thunder Sources and then released seven mirror image avatars to destroy 21 more Thunder Sources. The remaining Thunder Sources had been forcefully withstood using his spatial enchantments.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn order to cross that tribulation of 27 Thunder Sources, Dragon Fang had used every method at his disposal. In the end he had paid with the price of his right eye.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs for Lin Ming, his comprehensions of the Space Laws wasn’t at the point where he could form mirror image avatars. In this situation, how could he rely on just his true self to withstand the simultaneous attack of 27 Thunder Sources?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe audience watched with eyes wide open. The disciples of the Ancient Phoenix Clan all held their breath, their hearts catching in their throats. Even Xiao Daochild was at full alert, ready to rescue Lin Ming at any moment so that he wouldn’t be severely injured or even killed by those Thunder Sources. If an extreme genius like him died while climbing up the Divine Seal Altar, then his Vast Universe Heavenly Palace would become the joke of the entire Divine Realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXiao Daochild had even specially prepared a temporary time-stop technique. In this critical moment where everything would happen nearly instantly, only this temporary time-stop would earn enough time for Xiao Daochild to save Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cspan\u003eRumble rumble rumble!\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThunder howled, the purple sea tumbled about. 27 Thunder Sources rushed towards Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOn the Divine Seal Altar, as soon as Lin Ming saw these 27 Thunder Sources form, he circulated all the true essence in his body. The energy within his inner world surged!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBefore this, he had seen how Dragon Fang crossed this tribulation of Thunder Sources, so he had an approximate grasp of this situation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThese Thunder Sources had all received the blessing and will of the Heavenly Dao. They were no longer ordinary Thunder Sources, but heavenly tribulations that stood above the elemental Thunder Laws, standing on a similar level to the Heavenly Dao Laws.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIt was impossible for any thunder-attribute cultivation method to control this power of heavenly tribulation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBut, Lin Ming was the exception.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“It’s here!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Ming raised his right hand and the Phoenix Blood Spear jumped into his grasp. The endless sea of purple was reflected in his bright eyes! This was a world of incomparably blazing thunder!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Heretical God Force – open to the limit!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Ming shouted out loud, and the power of thunder surged outwards from the Heretical God Seedling in his inner world. This power of thunder originated from his Ninefall heavenly tribulation’s thunder tribulation. It was of an even higher quality than the purple Thunder Sources above the Divine Sea Altar!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“What!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“He’s also forcefully withstanding this!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs everyone saw Lin Ming wield a spear as he was about to collide with the 27 Thunder Sources, all of them were shocked speechless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEven Empyrean Vast Universe and Xiao Daochild were dumbstruck. They had originally thought it was strange enough that Lin Ming had resisted thunder tribulation the way he had, but now he was forcefully withstanding these 27 Thunder Sources!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIf this terrifying energy exploded at a close distance, then even a top master would turn to ash!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis was madness!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn the instant that those 27 Thunder Sources touched the Phoenix Blood Spear, behind Lin Ming, a great divine tree began to rapidly grow!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eInfinite branches and leaves spread out, crazily absorbing the power of thunder. The crown of the tree towered high, overshadowing all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn just a moment, the phantom of a divine tree tens of thousands of feet high took root on the Divine Seal Altar, like a pillar that held up the heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAll around the divine tree, the inexhaustible power of thunder was controlled by it, rushing towards it like a tide! In that moment, a purple light seemed to swallow up the skies and the earth, leaving this single color shining out in the world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Heavens! What is that!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMany people cried out in shock and awe. As they thought that Lin Ming was about to be defeated, a divine tree had appeared, splitting the heavens and earth, demanding the worship and obedience of all thunder!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“A world phenomenon! What sort of world phenomenon is that?!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis reversal was too surprising! Compared to when Dragon Fang used his seven mirror image avatars and spatial enchantments to block the Thunder Sources, this was thousands of times more shocking!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOf course, even if Lin Ming had summoned the phantom of the Heretical God Tree to absorb a massive amount of the thunder tribulation, the baptism of Thunder Sources that his body had to withstand was beyond extraordinary!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA terrifying energy flooded throughout Lin Ming’s organs, his meridians, his blood vessels, swelling up like a tide of rampaging horses, permeating every inch of his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn that moment, Lin Ming’s skin ruptured and countless blood vessels broke on his body. His clothing was stained with blood and he was left with a horrible appearance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAlthough his appearance was in tatters and he had suffered great losses, Lin Ming’s momentum had reached its highest peak!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSuddenly, energy erupted from Lin Ming’s body. The power of blood burst out from him like a raging inferno, impacting through the skies. From afar, the audience could see that Lin Ming’s life force was like an inexhaustible torch, burning to the ends of time, causing them to avert their eyes from this dazzling brilliance!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Heavens! Is he even human!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“He was directly struck by thunder and there isn’t even a single unmarred point on his body. But even so, not only did he not fold, he instead erupted with an even greater aura than before. He is simply like an immortal phoenix. A phoenix can be reborn through bathing in a sea of fire, but Lin Ming’s potential erupted in a sea of thunder.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNo one knew that at this moment, deep within Lin Ming’s inner world, an earth-shaking and heaven-shifting change was occurring. After the Heretical God Seedling absorbed a massive amount of heavenly tribulation, it began to undergo a new round of evolution!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe Heretical God Seedling that originally only had several leaves began to grow at a visible speed. The young and lush branches grew longer and longer, producing different leaves that all looked different. Some resembled small tripods, some resembled vicious beasts, some resembled swords, and all sorts of other shapes. The twisting and vibrant roots grew longer and longer, digging deep into the foundation of Lin Ming’s inner world. At this moment, the Heretical God Tree had truly taken root!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIf someone were to enter Lin Ming’s inner world now, they would see this young and vibrant tree. Although it was only the height of a child, its branches and leaves were sturdy, filled with energy and vitality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Ming was aware that even though this young tree looked common and humble, in the future, it would one day grow into a 100,000 foot divine tree, becoming a true incarnation of thunder and flame.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe moment that the Heretical God Tree’s evolution was completed, Lin Ming’s eyes flashed open. All around him, the Thunder Laws began to distort, faintly gathering onto him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eFor a time, Lin Ming’s aura surged upwards, climbing and climbing until it reached unprecedented heights!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs the billions of people saw Lin Ming, all of them were left speechless. Even the presider of this competition, Xiao Daochild, was left utterly dumbfounded. Although he had prepared a time-stop spell in his hands, he hadn’t needed to use it at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis was far too abnormal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDragon Fang had used all of his techniques, using layers upon layers of abilities to just barely cross the tribulation of 27 Thunder Sources. Even so, during that process he had lost an eye and the majority of his strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs for Lin Ming, he had directly withstood the tribulation of 27 Thunder Sources!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEven using this crazy method he had successfully crossed the tribulation of Thunder Sources. Moreover, although his body was bathed in blood after crossing this tribulation, his aura hadn’t diminished in the least. Instead, it rose and rose, his blood vitality and daring fighting spirit soaring to the heavens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eJust how was this possible!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Could Lin Ming have been using that thunder tribulation to temper his body? If he really was, then he’s simply insane!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“That might be what happened, otherwise how could it be explained that he became even stronger? I can’t imagine just how he trained his mortal body!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEveryone couldn’t help but be horrified. Lin Ming’s flesh and blood body was too terrifying. If an ordinary martial artist were struck by such thunder, they would have turned to ash. But as for Lin Ming, he used this thunder to temper himself.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1260\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1262\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1261","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
