{"id":55225,"no":1280,"title":"Chapter 1276 Frost Dream, Xiao Moxian","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1276 – Frost Dream, Xiao Moxian\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAny casual disciple from Vast Universe Heavenly Palace, even if they weren’t an Empyrean direct disciple, still nearly reached the standard of a first ranked master from a semifinals area. This caused many of the young elites present to be left speechless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who… who is he?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe several Holy Land disciples speaking before felt their faces flush red with embarrassment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey weren’t able to ascertain his status before they saw that person switch hands. This time, a golden red light covered his hand as he slapped his palm onto the crystal platform.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe last time was the Space Laws, but now it was the Metal Laws!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe crystal platform shimmered with a dazzling light once more. Without needing to mention the first four levels, even the fifth level blazed for one to two breaths of time. Although his Metal Laws were slightly worse than his Space Laws, he could still be considered as having touched upon the threshold of the fifth level Concept.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe cultivated two different Laws and yet he had reached perfection of the fourth level Concept and was soon to break through the boundary of the fifth level Concept. This disparity was obvious to all present, and it caused many of them to lose all the bluster they had before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat disciple from Vast Universe Heavenly Palace swept his eyes through the entire audience and tipped his head upwards in victory. As for the person that had challenged him, his face had gone deep red as he was left speechless. Under the gaze of everyone present, he had disgracefully shamed himself.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese people were all geniuses of their various great worlds. When they came to the First Martial Meeting, although they didn’t imagine they would be able to shock the world with a brilliant feat of talent, they believed they could at least shine in glory. But now, before the finals had even begun, they had been brutally attacked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I am Zhao Ji and my Honorable Master is Vast Cosmos. Remember that.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Vast Universe Heavenly Palace disciple said with a smug smile on his face. Vast Cosmos was the chief disciple of Empyrean Vast Universe, and also had a half-step Empyrean cultivation. Not just that, but with the support of Vast Universe Heavenly Palace’s resources, the strength of the disciples he taught could be imagined. To be able to touch upon the fifth level Concepts of two different Laws wasn’t strange at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany people clenched their jaws, but they were pressured so badly they couldn’t even lift their heads. The already couldn’t compare with Empyrean direct disciples, but now these Heavenly Palace core disciples were pushing them down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hehe, to tell the truth, having the number one ranked participants of the semifinals be arranged in front of us is already doing you a favor; you should be content with what you have!” Zhao Ji sneered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePurple Blade frowned. “Brother Lin, this cocky fellow really thinks his tail reaches the skies. He’s even mocking you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was the first ranked participant of the Gravemoon Star semifinals and was arranged in the first 60 palaces. As Zhao Ji spoke, his words naturally disparaged Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming said, “Let him do as he pleases. There’s no reason to quarrel over something like this. No matter how great his results are on that platform, it won’t affect the overall result of the Divine Realm First Martial Meeting. Moreover, a genuine master wouldn’t do something so ridiculous.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was well aware that there were many martial artists in this First Martial Meeting, as well as Empyrean descendants, that had thoroughly comprehended the fifth level Concept. That was something that wasn’t as simple as touching upon the threshold!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut these people actually hadn’t moved.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming and Purple Blade’s conversation wasn’t hidden, thus Zhao Ji naturally heard them. He sneered and said, “You talk like you’re so amazing. How about you come on stage and give it a try, so we can see just how much weight you have. You really are a shameless boaster!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhao Ji provokingly said. Everyone immediately turned to Lin Ming. Out of the hundreds of people present, there were naturally some from Gravemoon Star’s semifinals, thus they recognized Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Isn’t that Lin Ming?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, that’s Lin Ming. He’s the first ranked participant of Gravemoon Star!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The first ranked participant was Lin Ming and the second ranked participant was Dragon Fang! Both are extreme geniuses!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany disciples from the Gravemoon Star semifinals started to call out Lin Ming’s name after seeing him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the people from other semifinal areas, they didn’t think much of Lin Ming. To them, there were far too many first ranked participants from the different semifinal areas.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“First ranked of Gravemoon Star? That’s him?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I guess he’s around the same as our semifinals’ first ranked participant, Blood Carnage.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs everyone was speaking, near the crystal platform, Zhao Ji stiffened, his face red, the exact same as the disciple from the World King Holy Land that he had embarrassed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You… you are… Lin Ming?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhao Ji gulped, his words coming out a bit slurred.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf one wasn’t a disciple of Vast Universe Heavenly Palace, it would be hard to imagine just how difficult it was to climb up the Divine Seal Altar’s 33 steps.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the disciples from other semifinal areas heard that Lin Ming had mounted the peak of the Divine Seal Altar, they only knew that he was fierce. As for how fierce he was, they weren’t sure. But, as a disciple of Vast Universe Heavenly Palace, Zhao Ji had personally witnessed an incomparably powerful direct disciple of Empyrean Vast Universe climb up the Divine Seal Altar in the past. However, that disciple hadn’t even been able to climb 10,000 feet up the 33\u003c/span\u003e\u003cspan style\u003d\"\"\u003erd\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step. In this situation, if Lin Ming could reach the top, just how strong was he?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the beginning, when Zhao Ji first heard this news, he simply couldn’t believe it. But, after verifying this with his master, he had learnt beyond a shadow of a doubt that this news was true, despairingly so.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if Lin Ming were using some tricks, shortcuts, or had some treasure to climb up, there was no doubting his potential. Zhao Ji knew that he absolutely couldn’t compare to such a person, because he himself couldn’t even climb up to the 32\u003c/span\u003e\u003cspan style\u003d\"\"\u003end\u003c/span\u003e\u003cspan style\u003d\"\"\u003e step.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe great disparity between them could be imagined!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, he is Lin Ming.” Purple Blade said, his lips curving upwards. He already guessed that the name of Lin Ming had some significant mental impact to this disciple of Vast Universe Heavenly Palace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming…” Zhao Ji’s complexion was very uncomfortable. In front of Lin Ming, he didn’t have any confidence at all. But even so, he couldn’t back down and lose like this here. “My senior-apprentice brother has wanted to challenge you. Your results in climbing up the Divine Seal Altar were truly heaven-defying, but you did so using nothing but tricks!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming faintly smiled. “The Divine Seal Altar is a test of your comprehension of Laws. Whether or not you can find tricks to climb up all depends on your own ability. The methods are already there. Whether you can find them is your own problem.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhao Ji was left speechless by Ling Ming’s words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was well aware that no matter how Lin Ming climbed up the Divine Seal Altar’s 33 steps, him trying to challenge Lin Ming was only bringing about his own destruction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSo he simply walked down the crystal platform. He had spoken too arrogantly just now and had ended up slapping his own face. Zhao Ji didn’t even have the shame to lift his own face up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, a pall of silence fell over the entire square.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSome people began to look towards one direction. As for others, they seemed to feel something special and also looked over.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey saw a 15-16 year old-looking young girl. She wore a long black skirt and as she walked over she resembled a devilish nocturnal temptress.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer long hair was jet black, hanging down to her waist like a waterfall of ink. Her eyes were as wide as a baby’s, incomparably bright.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven with several hundred people present, it was possible to hear the sound of a pin drop.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Xiao Moxian!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Direct disciple of Demondawn Heavenly Palace and also a direct bloodline descendant of Empyrean Demondawn – Xiao Moxian!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd what was most breathtaking was that beside Xiao Moxian was a young woman in a long pure white dress. Her figure was tall and outstanding, and her entire body exuded a sacred and sacrosanct atmosphere, making anyone near her feel inferior.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe appeared together with Xiao Moxian and she herself was a perfect and formidable young woman. Her name was heart-stopping; she was Fairy Frost Dream!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1275\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1277\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1276","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
