{"id":55248,"no":1303,"title":"Chapter 1299 Heavenly Dao Judgment","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1299 – Heavenly Dao Judgment\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was Dragon Fang’s final strike and also his strongest strike.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe joint attack of eight Dragon Fangs was already so terrifying, and now he had divided into 16 spatial mirror images and had also opened the Three Lives Pupils state of All Existence to Void. The might of this attack could be imagined!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the other hand, even Lin Ming’s fifth level Concept of Fire that was supported by the Heretical God Tree – Virtual Disintegration – was broken through by Dragon Fang. Any and all Laws would be seen through by Dragon Fang. As long as one attacked Dragon Fang with the Laws then they would be restrained!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe impression that others had of the Thunder and Fire Laws was always weaker than the Space and Time Laws. Moreover, Dragon Fang had also opened the Three Lives Pupils. As a complete transcendent divine might, and even a peak existence amongst all transcendent divine mights, its power could be imagined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is my last attack. Prepare yourself.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang cautioned Lin Ming once more. This was how confident he was in himself!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing Dragon Fang’s last strike, Lin Ming’s face was cold and determined. If he couldn’t use the Laws then there was no way he could battle Dragon Fang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith things having come to this step, he only had one final move remaining to him. This was the only Law attack that might not be seen through by Dragon Fang. In terms of Laws, it was a technique that stood beyond the Heavenly Dao.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, energy erupted from Lin Ming’s body, rising to the limit. Behind him, the phantom of the Heretical God Tree appeared once more.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is the divine tree phantom again? Useless. The Fire and Thunder Laws that this divine tree releases are mysterious, but I can still see through them all the same!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang was not boasting. The virtual fire of before had already been seen through by him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the martial artists of the Ancient Phoenix Clan saw Lin Ming about to use the same move for his last strike, all of them were worried for him. The power of thunder and fire? Was this technique still any good?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Take my sword - Void Annihilation!” The 16 Dragon Fangs slashed out with their swords together and 16 sword lights came hurtling out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eRumble rumble rumble!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe void trembled, time twisted. The power of this sword strike had reached the peak of any Divine Sea martial artist!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd at the same time, Lin Ming also shot out his spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe entirety of his will, his battle spirit, his world power, his true essence, his energies, all of it was poured into his spear. In that moment, Lin Ming’s strength detonated like a volcano, rapidly climbing up without end. The Law fragments that fused into his body during his ninth stage Life Destruction also activated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s strength grew higher and higher, quickly surpassing Dragon Fang and still climbing!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang shouted out loud and all of the sword light gathered into a single beam of light. All of the power of space and time around it was swept up into it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd suddenly, from within Lin Ming’s inner world, thunder and fire heavenly tribulation that was absorbed by the Heretical God Tree began to rush forth, swelling out in infinite waves. In the skies behind Lin Ming, a terrifying boom blasted across the world. The power of endless thunder erupted, turning the skies into a roiling sea of purple thunder!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd within that sea of thunder, flames madly howled, concentrating into a river of magma that dashed forwards!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThunder!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFire!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo wild and violent energies wove together in the sky. This inexhaustible strength caused the world to shudder!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeavenly Dao Judgment – Thunderfire Tribulation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had used his strongest attack, and also the strongest cultivation method he had created.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“…This is!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDeep within Vast Universe Heavenly Palace, Empyrean Vast Universe’s eyes popped wide open.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The power of heavenly tribulation? This is equivalent to the height of the Heavenly Dao Laws? Lin Ming is summoning heavenly tribulation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven Empyrean Divine Dream’s appearance changed. A cultivation method equal to the Heavenly Dao… that was a transcendent divine might!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen an ordinary Empyrean created a transcendent divine might, that would truly reach the level of controlling the Heavenly Dao Laws to an extent. However, they also needed to cultivate that skill to the highest limits. It was not something that a Divine Sea martial artist could ever hope to accomplish.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was because when an Empyrean created a transcendent divine might, their cultivation had already reached an exceedingly high boundary. If one wished to thoroughly comprehend and cultivate this transcendent divine might, then that person would need to be at a similar boundary to the one who had created it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor instance, if Dragon Fang wanted to cultivate the Three Lives Pupils to its highest degree then he would need at least an Empyrean cultivation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd because of this, Dragon Fang was only able to display the tiniest portion of the Three Lives Pupils’ true strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut Lin Ming’s Heavenly Dao Judgment was completely different. This ability was established during the Divine Sea realm, thus he absolutely was able to display its full power during the Divine Sea realm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a cultivation method that belonged to Lin Ming alone! And also the cultivation method that suited him the best!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eRumble rumble rumble!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThunder roared, flames howled. The entire sky turned into an endless ocean of red and purple.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s spear shot towards Dragon Fang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA sharp light flashed in Dragon Fang’s eyes. He wanted to use All Existence to Void to see through this Heavenly Dao Judgment, but no matter where or how he looked, all he felt was a stabbing pain in his eyes and an endless sea of red and purple roiling before him. It was simply impossible for him to see through the energy composition of this thunderfire heavenly tribulation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What!?” Dragon Fang was shocked beyond belief. Even though he had opened All Existence to void, he still wasn’t able to see through Lin Mings attack!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he was left dumbstruck, he immediately understood what was happening. It wasn’t that Heavenly Dao Judgment was stronger than his Three Lives Pupils, but because the degree to which he had trained in the Three Lives Pupils was lacking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese were two different cultivation methods. For example, suppose the height of Laws in Three Lives Pupils was at 100 and the height of Laws for Heavenly Dao Judgment was 10, a person who practiced only 1% of the Three Lives Pupils cultivation method would be inferior to someone who had cultivated Heavenly Dao Judgment to 100%.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was where the disparity lay. Facing the power of heavenly tribulation that stood beyond the Heavenly Dao, Dragon Fang wasn’t able to see through it at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he couldn’t see through these Laws, then Dragon Fang could only bet everything he had in a direct frontal collision with Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming’s original true essence intensity added on to the erupting power of the Eight Inner Hidden Gates had surpassed Dragon Fang, not to mention that he was also utilizing the might of heavenly tribulation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe spear light and sword like struck each other and a wave of wild energy swept through the entire arena stage, lifting off the top layers of stone and leaving nothing behind but the hard timeless god stone foundation beneath. This was a truly apocalyptic scene!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePing! Ping! Ping! Ping! Ping!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBesides Dragon Fang’s true self, the 15 spatial mirror images he created completely exploded!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd Dragon Fang himself was also surrounded by endless thunder and fire. He used the Dragon Fang Blade to resist Lin Ming’s spear light, but his body was still sent flying backwards from the impact.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe space enchantments protecting Dragon Fang exploded apart, one after another!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa ka ka ka ka!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the space enchantments collapsed, the power of thunder and fire also melted away. Blood leaked through Dragon Fang’s lips and his palms were completely cracked apart. This damage was the result of the tremendous impact force rushing through him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that time, Dragon Fang’s protective true essence was no longer able to withstand the impact; it also shattered!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this critical moment, Dragon Fang shouted out loud, overdrawing all the strength within his body. He gathered a massive amount of the power of space, causing that spear light to explode!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood vessels in Dragon Fang’s eyes burst open and blood flew out. He spat out a mouthful of blood and staggered back dozens of steps before barely coming to a stop with the Dragon Fang Blade supporting him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang looked up, his bloodstained eyes staring at Lin Ming. Flames still flickered around his pupils and it was impossible to see his expression.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You, you can actually create such a technique? Even my Three Lives Pupils cannot see through it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Dragon Fang spoke, more and more blood dripped from the corners of his mouth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was astonished. Heavenly Dao Judgment could be considered his strongest attack. In a situation where his Laws weren’t suppressed and its strength had completely covered Dragon Fang, Dragon Fang had actually been able to persist through it, not even vomiting blood and falling to the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Dragon Fang was strong to the point of being a freak. The reason he could persist until now was because his Space Laws were far too powerful, whether it was in attack or defense. Otherwise, he would have long been spitting out blood and would have fallen unconscious with severe wounds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, even if Dragon Fang didn’t collapse to the ground, that didn’t mean he still had the ability to continue fighting with Lin Ming. Opening the state of All Existence to Void just then had placed a tremendous burden on his body. At the same time he had overdrawn his potential and completely used up his strength. The flames in his eyes gradually diminished until they fully dissipated away, turning back into ordinary pupils. Even his complexion paled more than usual. He only had 30-40% of his true essence remaining.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd, what was most important was that the blood vessels in Dragon Fang’s eyes had exploded because the burden was too great. He would be unable to open the Three Lives Pupils again for some time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis battle had been decided!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang’s attainments in the Laws were extremely high, but he had a weakness, and that was that his endurance was far inferior to Lin Ming’s. Moreover, his physical bodily strength and defensive ability were completely flung away by Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf Lin Ming were the one to take such damage, then he would have been able to maintain his combat strength and keep fighting.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut with Dragon Fang being the one to take so much damage, it was no longer possible for him to continue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I admit defeat.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang quietly said as he wiped away the blood from his mouth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs these three words spread through the arena, the several hundred million spectators fell into a silent lull.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this battle –\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming, victorious!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Fang, defeated!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe results weren’t too shocking. After all, Lin Ming was extremely strong and people didn’t know who was stronger between him and Dragon Fang. However, the entire fight had been far too shocking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming is too strong! I really think he might make the top three rankings!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I really have no idea what would happen if he were to fight with Xiao Moxian and Frost Dream.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What was Lin Ming’s final move just now? It’s as if I was facing the vastness of the heavens and earth.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany of the martial artists present hadn’t experienced heavenly tribulation, but they were all dragons and phoenixes of their generation, outstanding geniuses of their era. They all had a faint sense of understanding towards the Heavenly Dao.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m not too sure, but I also feel the same way. I think that Lin Ming’s move was similar to some extreme powerhouses when they use their transcendent divine might…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I have no idea if this is his limit. It would be fine if this was it, but if he can continue past this then that would be too horrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin Vast Universe Heavenly Palace, Empyrean Vast Universe and Empyrean Divine Dream were both silent as they witnessed this victory.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a long period of silence, Empyrean Divine Dream eerily said, “That is an elementary transcendent divine might.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eElementary transcendent divine might!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEmpyrean Vast Universe let out a long breath. He had also been able to see that.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s transcendent divine might was extremely weak; it could not be compared at all to complete transcendent divine mights created by the likes of Empyrean Divine Dream or Three Lives Old Man. Even when compared to those eternally incomplete transcendent divine mights created by weaker Empyreans, it was still far inferior.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, Lin Ming was only 31 years old.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had far too much time ahead of him as well as a future without limits. As Lin Ming grew, this elementary transcendent divine might would continue to develop and improve again and again until it reached perfection, becoming a truly all-encompassing ability. At that time, the endless variations of Laws contained within it would reach incredible heights, and would even be comparable to the Divine Dream Law that Empyrean Divine Dream created or the Primordius martial intent that Empyrean Primordius created!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1298\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1300\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1299","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
