{"id":55275,"no":1330,"title":"Chapter 1325 Dream Interpretation Scripture","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1325 – Dream Interpretation Scripture\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, an incomparably powerful strength of the Divine Dream Law enveloped Frost Dream. Divine dream marks flew out from her body, spinning around, wildly dancing in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream floated in the skies, the Dream Interpretation Scripture in her hands. An unbelievable strength wildly surged outwards, flooding the entire martial field. Many of the spectators couldn’t help but be affected by this strength. The older masters were somewhat better off. With their deep cultivation, the effects weren’t too great on them. But for those juniors with weaker cultivations, as they heard the sounds of the Dream Interpretation Scripture, all of them developed infinite admiration and trust towards Frost Dream in their hearts. At this moment, to them, Frost Dream seemed like a true god living in the world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany of those young elites at the early Divine Sea realm and below fell to their knees, lying prostrate in worship towards Frost Dream. Those that were able to step foot in this arena were mostly geniuses from World King Level Holy Lands. But when facing Frost Dream’s Dream Interpretation Scripture, they had no strength to resist at all. In their hearts, deep within their spiritual sea, there was a thread that was resonating with Frost Dream. This power of their thoughts emerged from their bodies, gathering towards Frost Dream.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the power of hope and also the power of faith.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen people believed in an existence without reservation, they would devote their power of faith to it. Even a mortal’s power of faith could not be underestimated. Several mortals gathered together naturally weren’t worthy of mentioning, but with trillions of mortals gathered together, their collective power of faith was no less than that of a Holy Lord or World King.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany people were willing to bow and worship Frost Dream, offering their own faith power to her. Endless amounts of faith power began to gather towards Frost Dream. This faith power came not just from the heroic young elites present, but also from the countless lives from different planes and worlds, all of them drawn in and catering to Frost Dream’s voice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dreams – are your thoughts. What you experience in your dreams is something that you will never forget in your life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dreams – are your desires. What you experience in your dreams is the bitter outcomes you chased in your previous incarnations.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“At this time, on this day, I shall borrow this power of faith from all living beings. And on the day that I step into the realm of god, then I shall interpret your dream for you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Frost Dream spoke, all of the power of faith gathered completely into her hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, many of the Holy Lords and World Kings present paled!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream was actually using the dreamland Laws to gather the power of faith from all living beings, all of them willing to worship at her feet and devote their life’s energies to her. For a single person to command the devotion of all beings, just how terrifying an ability was this!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream was at the late Divine Sea realm and she was able to affect all young elites at the early Divine Sea realm and below. Then, what about Divine Dream? She was a peak Empyrean. Did that mean that all powerhouses at an early Empyrean cultivation and below would be affected by her? In other words, everyone present here would come under Divine Dream’s influence. This caused all of them to fear Empyrean Divine Dream even more!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Divine Dream Heavenly Palace is too terrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is terrifying is the Divine Dream Law, a Law just like an enigma! This Law is the sole possession of Empyrean Divine Dream. With just what has been revealed so far about the Divine Dream Law, we’ve seen the divine dream space, the Dream Interpretation Scripture, and the Dreamsoul Immortal Melody, three incomparably powerful abilities. No one here ever knew that such techniques could exist!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDivine Dream Heavenly Palace was incomparably mysterious, with an unfathomable background. No just that, but there were very few disciples within Divine Dream Heavenly Palace and they were often hidden in their own worlds. At this First Martial Meeting, there were many World King powerhouses who were experiencing the Divine Dream Law for the first time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA tremendous power of faith gathered together into a phantom in front of Frost Dream. This phantom had faintly similar features to Frost Dream, exuding a holy aura from all over just like a profound immortal goddess from the highest heavens, looking down at the world with contempt.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a spiritual god formed from the power of hope from all living creatures, condensed from their very thoughts!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa ka ka!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs this spiritual god of thoughts and faith stepped forwards, Lin Ming felt his grandmist space violently tremble. Cracks began to appear within the grandmist space, rapidly spreading outwards. The grandmist space would soon break apart!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the grandmist space was not just suppressed, but disintegrating!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was using the incomplete Primordius martial intent to resist the complete Divine Dream Law. He was finding it difficult to resist!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis spiritual god stepped into the grandmist space, creating a crack in the dome of the grandmist space. Lin Ming’s body shook as he was forced backwards, his face wan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is a spiritual god formed from the power of thoughts! It carries with it a terrifying will. Ordinary Laws and domains simply cannot resist the force of it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, and Frost Dream hasn’t even used the Dreamsoul Immortal Melody. When she fought Hang Chi, she hadn’t completed the Dreamsoul Melody. If she can play it to completion, it should be far more terrifying than the Dream Interpretation Scripture!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Frost Dream’s methods are endless; she is simply invincible. There is no junior that can hope to compare with her. The only difference among them is who can last longer before capitulating.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany masters present didn’t understand the Divine Dream Law. But, when Frost Dream had truly used the Divine Dream Law, they were all able to see just how powerful it was.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHang Chi pressed his palms together, sighing deeply with emotion. Their Buddhist faith had countless followers and a Buddhist Empyrean could also gather the power of faith from all living creatures, displaying a truly heaven-shaking force.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, those in the Buddhist faith that could do this were all Empyreans!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn ordinary Divine Sea or Divine Transformation powerhouse could at most add the power of faith to their techniques. The combat strength they could display with this was extremely limited. It was far from being able to compare with someone like Frost Dream. It was unimaginable that she could reach this boundary at just the late Divine Sea realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe spiritual god formed from faith power took another step forwards. More and more cracks appeared in the grandmist space; it had reached its limit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, Lin Ming grasped the Phoenix Blood Spear and poured all of his energy into his inner world. Within his inner world, the energy spun around the black hole seed, forming a nebulous vortex of stars. All sorts of mystical runes flowed out, attaching to this vortex.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn an instant, Lin Ming formed thousands of seals. These seals spread through all space in an area of 10 miles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDivine Seal Art – God Forbidding Seal!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a loud shout from Lin Ming, all of those divine seals flew towards that spiritual faith god. Lin Ming actually wanted to use his own strength to seal away the spiritual faith god!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, just what sort of existence was a spiritual god formed from the power of faith? This was the power of faith that Frost Dream gathered from all living beings in numerous planes and worlds. By creating this spiritual god with the Divine Dream Law and her own supreme cultivation, how could it be sealed away so easily?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for those divine seals that Lin Ming shot out, all of them seemed dim without any terrifying fluctuations of energy at all. In fact, they looked rather plain and common.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRight now, no one believed that Lin Ming’s God Forbidding Seals would be able to do anything to that spiritual faith god. This included Frost Dream herself, Hang Chi, Jun Bluemoon, and even Old Sword.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe spiritual faith god took a third step, thoroughly stepping into Lin Ming’s grandmist space.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Lin Ming had already severed contact with the grandmist space to prevent a backlash injuring him. And at the same time, those God Forbidding Seals he sent out fell onto that spiritual faith god.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were a total of 3600 seals. As they fell onto that spiritual faith god, they completely submerged into that shimmering being, vanishing out of sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat spiritual faith god didn’t seem to have been affected at all. It took a fourth step. Now, it was within reach of Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eShua!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom within its body, that spiritual faith god extracted a divine sword. Just as it was about to cut down at Lin Ming, its body suddenly shook as it violently trembled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin its body, those 3600 God Forbidding Seals that had sank into it began to change!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThose seals looked common and simple, but after they sank into the spiritual faith god, they were like a pack of ravenous animals, recklessly eating up the power of faith.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe seals seemed as if they could swallow all of existence. Even the power of faith from all creatures was no exception.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e3600 points formed 3600 energy black holes, wantonly swallowing everything nearby. As for the energy they swallowed, it passed through some invisible channels that completely converged within Lin Ming’s body, gathering into that black hole seed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Seal Art represented the Laws of Sealing as well as the Laws of Swallowing. It would swallow all into that black hole and then thoroughly seal it away!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnder the gazes of all, one could only see innumerable lines of energy forming between Lin Ming and that spiritual faith god. All of that power of faith was being swallowed up by Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the audience of over a hundred million saw this, all of them didn’t dare to believe their own eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What sort of cultivation method is this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How can this be? He can actually absorb the faith power of all creatures? How is he doing this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The faith of all creatures cannot be subdued. Unless they believe in you, you will only experience a backlash from this power!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSome of the wizened old men present had some understandings into the power of faith. The reason that people were willing to devote and offer their power of faith was because they believed in that indistinct spiritual god in their hearts. But against an evil god that dared to try and kill the spiritual god they believed in, they would naturally resist it, rather dying than surrendering.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is this the power of the faith of all creatures?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, Lin Ming could feel the energy within his black hole seed rapidly increasing. The strength of the black hole seed also rose!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, this was the power of faith. After leaving that spiritual faith god, this energy immediately became incredibly wild and violent as if it wanted to strike back at him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eRumble rumble rumble!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA great deal of the power of faith exploded within Lin Ming’s inner world, wishing to perish with him. But Lin Ming simply coldly snorted. The black hole vortex spun at a crazy rate, swallowing all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo matter how wild or tyrannical this power of faith was, all of it was sucked into the black hole vortex and thoroughly crushed. The black hole was the end point of all space and time, and also the end point of all matter and energy!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough the power of faith was strong, it was still a type of energy in the end. It couldn’t resist the terminal end of energy that was this black hole seed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter swallowing a massive amount of the power of faith, not only did Lin Ming’s aura not fade, but it grew without the slightest hint of backlash. This caused many people in the audience to be shocked speechless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe could swallow the power of faith without any backlash at all? That was far too abnormal! None of them could imagine just how Lin Ming was able to accomplish this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the arena stage, the spiritual faith god roared out louder and louder. However, no matter how much it struggled, it was sealed tighter and tighter away by Lin Ming’s God Forbidding Seals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You can actually seal away and refine the faith power of all living creatures?” Frost Dream looked deeply at Lin Ming, a look of surprise on her face. She thought that once she brought out the Dream Interpretation Scripture, this battle would be finished. She never imagined that Lin Ming would use some inconceivable cultivation method to seal away that massive faith power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, even though the Dream Interpretation Scripture was suppressed by Lin Ming, Frost Dream didn’t seem panicked at all. She still had that indifferent expression on her face as if nothing in this world was able to move her. She flicked a single finger and that spiritual faith god scattered away, turning into countless lines of faith power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSince the black vortex was recklessly swallowing and sealing away the power of faith, then Frost Dream would separate all of that energy and bombard Lin Ming with it instead!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, 90% of that faith power had been sealed away by the Divine Seal Art. But, the remaining 10% still gathered in a mighty surging wave that rushed towards Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, because Lin Ming had used the God Forbidding Seal, he had yet to recover himself. Now that he saw such a sudden change occur, he sank his thoughts into his spiritual sea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Grandmist battle spirit!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWoosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a clarion cry, a dark gold grandmist battle spirit rushed out from Lin Ming! After Lin Ming’s deep sleep for the last year and a half, the grandmist battle spirit had already faintly touched upon the threshold of becoming a blue soul battle spirit. Within that dark golden hue was a faint touch of the deepest blue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough this blue color was extremely faint, it still added an inerrable charm to the grandmist battle spirit!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe grandmist battle spirit formed a sword of will, welcoming the power of faith!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBoth sides were forces formed from the power of will. On one side was Lin Ming’s will, and on the other side was the power of faith from all living creates. Both strengths brutally crashed together.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKacha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor a time, the brilliance of will spread through the void, with the power of faith being crushed into nothing. At the same time, Lin Ming’s sword of will also broke apart! During this intense collision of wills, a powerful spiritual storm was stirred up. All of those young elites that offered up their power of faith felt as if they were drowning in a trance within this wild storm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for those stronger martial artists, even they were stunned.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Perfect gold battle spirit! Lin Ming also has a perfect gold battle spirit!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It isn’t just a perfect gold battle spirit. It’s more accurate to say that this battle spirit is making great progress into entering the blue soul boundary. Before too long, he should be able to make a breakthrough! How terrifying! This battle spirit is even superior to Frost Dream’s!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream’s battle spirit was at gold perfection. But compared to Lin Ming, it was still lacking the charm of a blue soul battle spirit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had to be known that Frost Dream originated from Divine Dream Heavenly Palace. Those from Divine Dream Heavenly Palace originally surpassed all others in the aspect of soul and will. It was normal for their battle spirits to be outrageously strong.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for Lin Ming, he only came from an ordinary Holy Land background and he had no fierce master that anyone was aware of. Even so, he managed to train his battle spirit to such a boundary; just what the hell was going on here?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis battle spirit was strong, his perception was strong, his defense was strong, his endurance was strong, he possessed a powerful domain, had reached perfection in the fifth level Fire Laws, his foundation had reached the peak of stability, and his cultivation method was strong to the point that it was even able to refine the power of faith. With so many strengths together, how could other geniuses still live?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s existence was something that many people couldn’t summon the courage to chase after.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What secrets does Lin Ming have on him? His battle spirit is able to reach such a degree and he also has such a terrifying sealing technique. That sealing technique is definitely at the level of a transcendent divine might, even at the peak of all transcendent divine mights, otherwise it is impossible for it to seal away the power of faith!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes! That sealing technique that Lin Ming used just now was not used during his battle with Hang Chi. If he knew it, he would definitely have used it then. In this last year and a half while his soul was injured, was he actually cultivating instead?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“His soul was injured? Does anyone here still believe that Lin Ming’s soul was injured? How ridiculous! Just think about it. If Lin Ming was truly in a deep sleep because his soul was injured, how could his strength rise so quickly?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt wasn’t known which old man said this, but everyone couldn’t help but gulp. If Lin Ming’s soul wasn’t injured for this last year and a half, then just what was he doing during his sleep for all that time?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1324\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1326\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1325","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
