{"id":55277,"no":1332,"title":"Chapter 1327 Final Chapter of the Dreamsoul","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1327 – Final Chapter of the Dreamsoul\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe final chapter of the Dreamsoul Immortal Melody!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing Frost Dream’s words, all of the heroic young elites present held their breaths. When Frost Dream fought with Hang Chi, she had said that once she completed the Dreamsoul Immortal Melody, he would lose without a doubt. That meant that the final chapter of the Dreamsoul Immortal Melody must contain some indescribably powerful force!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The final chapter of the Dreamsoul can eliminate all Laws of this world and wash away even the Great Dao. Try your best to withstand this.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream was unable to fully grasp the might of the Dreamsoul’s final chapter. Lin Ming might be able to defend against this move, but he might even be severely wounded. Perhaps he could even die here. With the fighting having reached this stage, it was impossible for Frost Dream to tell Lin Ming to give up. They could only fight this out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, deep within Vast Universe Heavenly Palace, Empyrean Divine Dream’s expression stirred. She seemed as if she wanted to stop Frost Dream, but after hesitating for several breaths of time, she finally shook her head. No matter how Frost Dream and Lin Ming’s battle went, she believed that Lin Ming’s destiny was so great and dreadful that he wouldn’t die here in such a simple manner. And as her reincarnation, Frost Dream was also the same.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe zither melody changed once more. That Buddha-killing harmony with its profound killing intent once more returned to a peaceful tune. No one imagined that the final chapter of the Dreamsoul, with its vast and boundless momentum that seemed to look down at the world with disdain, would actually return to such a gentle quietness. For a time, within the Immortal Melody Pure Lands, countless crystal clear flower petals fell from the air, lightly landing on Frost Dream’s long hair, shoulders, and even her icy blue dress. As she sat down in the Immortal Melody Pure Lands, her image seemed carved into eternity.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, a mysterious black crystal began to emerge behind Frost Dream, becoming larger and larger. Within the Dreamsoul Immortal Melody’s final chapter, a black crystal finally gathered. This black crystal was shaped like a cube with six even sides. It looked common, and even slightly plain, but as Lin Ming saw it his mind violently shook!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was… the Magic Cube!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this final moment, Frost Dream had summoned the phantom of the Magic Cube!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn this black cube was carved countless dark inscriptions. Lin Ming had seen these markings before; he had a profound impression of them!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the past when he first obtained the Magic Cube, the Magic Cube had these black traces carved on it, each one different and unique. Even now, Lin Ming still didn’t know what they meant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming never thought that in Frost Dream’s final chapter of the Dreamsoul Immortal Melody, she would actually use her own energy to condense a phantom of the Magic Cube!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is the Magic Cube not in my body?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s thoughts stirred. His thoughts immediately touched upon the Magic Cube space within his body; he found that Mo Eversnow and Fishy were both safely dwelling there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic Cube was still in his body – he could not be wrong about this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I understand. Frost Dream’s Magic Cube phantom has the aura of the Magic Cube, but it is still far from being able to compare to the true Magic Cube!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic Cube was a divine tool of the soul; it complemented Divine Dream Heavenly Palace’s Divine Dream Law perfectly. If so, then Divine Dream Heavenly Palace must have some inheritance related to the Magic Cube!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Could they… possess a replica of the Magic Cube?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis thought immediately flashed through Lin Ming’s mind. Although the Magic Cube phantom that Frost Dream summoned had a completely similar appearance to the true Magic Cube, its aura was far lacking. If it was said that Divine Dream Heavenly Palace had a replica of the Magic Cube, that was highly possible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor a time, Lin Ming felt the Magic Cube within his body restlessly stirring, as if it wanted to swallow the black cube above Frost Dream.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming wasn’t able to summon the Magic Cube on his own initiative yet, but if the Magic Cube began to move by itself, Lin Ming could use his own energy to move it and have it launch an attack. If this happened then the Magic Cube would undoubtedly attack Frost Dream!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnce the Magic Cube attacked her, that would be the true Magic Cube against the phantom Magic Cube formed by Frost Dream’s own energy. The result of that match up could be imagined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic Cube was a divine tool. Or, to better put it, it was a supreme spiritual object that surpassed the limits of a divine tool. From the universe’s essence, energy, and divine, this was a spiritual object produced by the ‘divine’ of the universe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magic Cube was deeply sleeping within Lin Ming and no one was able to discover its existence. Even when Lin Ming traveled deep underneath Immemorial Imperial City and met the artifact spirit of the Ancient Elysium Seal with its 3.6 billion years of experience, even that artifact spirit didn’t know of the Magic Cube’s existence. Only when Lin Ming summoned it did it find out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs long as the Magic Cube was within Lin Ming’s body then he would be safe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, once he took out the Magic Cube to launch an attack, its existence would be revealed to the hundreds of millions of people present!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMost people didn’t know what the Magic Cube was, but it was impossible for Empyrean Divine Dream to not know. Moreover, the hidden Tian Mingzi would inevitably recognize the Magic Cube. If he were to reveal the existence of the Magic Cube then he would be locked down and hunted by Tian Mingzi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was something that Lin Ming couldn’t help but consider.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if it was Empyrean Divine Dream, Lin Ming still didn’t fully trust her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEmpyrean Divine Dream was someone that dual cultivated energy and soul. She also possessed a replica of the Magic Cube. If he exposed Empyrean Primordius’s inheritance in front of her then she wouldn’t care. Empyrean Divine Dream and Empyrean Primordius were both characters at similar levels. There was no way she would give up her own Laws to inherit Empyrean Primordius’s legacy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut the Magic Cube was different!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was an extremely precious treasure, especially to someone like Empyrean Divine Dream!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Ancient Elysium Seal’s artifact spirit was not a human. It also had a mission to fulfill and its eventual death was arriving soon. If it obtained the Magic Cube then it wouldn’t find it of much use. But Empyrean Divine Dream was different. If she obtained the Magic Cube, she might even have methods to use it to directly become a True Divinity.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t dare to risk such a danger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the very least, using the Magic Cube to attack Frost Dream wasn’t his own true strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream had played the Dreamsoul’s final chapter and condensed the Magic Cube replica phantom with her own energy, displaying the absolute limits of her strength. But, if Lin Ming were to counterattack with the Magic Cube, this simply wouldn’t be meaningful to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJun Bluemoon was also in a similar situation with the Yin Yang Soul Sword. When Jun Bluemoon fought Lin Ming, because he had used the power of the Yin Yang Soul Sword instead of his own, he had admitted defeat on his own initiative. Otherwise, both Lin Ming and Xiao Moxian wouldn’t have been his match.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJun Bluemoon didn’t do so, and Lin Ming also made the same choice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming took a deep breath and poured all of his energy into the black hole seed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy exceeding the limits of his body to revolve the Divine Seal Art to the limit, the blood vessels on Lin Ming’s arms seemed ready to burst open.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was well aware of just how strong Frost Dream’s final attack was. Even after he used Eternal Darkness, she had still begun playing the final chapter of the Dreamsoul. This proved that Frost Dream was confident she could break through the Eternal Darkness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heretical God Tree!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming shouted out loud. Behind him, the phantom of the Heretical God Tree appeared.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, the power of thunder and fire heavenly tribulation contained within the Heretical God Tree completely erupted forth, weaving together into a sea of red and purple energy around Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeavenly Dao Judgment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming suddenly thrust out his spear. The power of thunder and fire heavenly tribulation gathered together, wrapping around the black hole seed in a nebula as it hurtled towards Frost Dream!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePuff puff puff!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe blood vessels on Lin Ming’s arms exploded, spilling forth blood. Many of his meridians tore apart and even his organs broke in multiple places. This was Lin Ming’s strongest attack, and also an attack that exceeded the bearing capacity of his body!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith this strike, Lin Ming’s attack violently collided with the Magic Cube phantom produced by Dreamsoul’s final chapter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that instant, the space within an area of several miles of the Divine Realm was completely torn apart. This was no longer shaking, but true tearing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA blinding divine brilliance flooded the entire arena, causing everyone to shield their eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA brutal and terrifying energy wildly surged outwards. Vast Cosmos personally took action and used his own domain to melt away the violent fluctuations of energy and avoid disaster in the spectator stands. Otherwise, those young elites with weaker cultivations simply wouldn’t be able to withstand this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is too terrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s unimaginable. I can’t believe Lin Ming is powerful to such a degree!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Just who won in the end?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone peered towards the center of the martial stage. But above the arena, the eruption of the dark black hole had formed a special dark void area that isolated everyone’s sight. It was impossible to know what the situation was like.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin that void of darkness, Lin Ming knelt on the ground, supporting himself with the Phoenix Blood Spear. His clothes were already dyed red with blood and blood was dripping down both of his arms. His meridians and organs were broken in several places and he had lost nearly all of his combat strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd in front of Lin Ming, Frost Dream had already lost support of her body. Although she was still floating in the air and hadn’t yet fallen down, she was also severely wounded. From the start of the First Martial Meeting until now, this was Frost Dream’s first injury, and it was a heavy one too.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause of her severe injuries, the mist that concealed her expression had dispersed, revealing an unrivalled appearance as beautiful as the moon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer snow white skin seemed like perfection formed by the heavens, like a newly budded ice lotus on top of a snow-capped mountain, without the slightest hint of the mortal world. But now, her enchanting complexion was slightly pale and her icy blue hair was also scattered down about her. Blood spilled out from the corners of her lips, giving her a point of pity and tenderness that moved the heart.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream wanted to use an illusion technique to conceal her appearance once more, but because the backlash from the Dreamsoul’s final chapter was too great, the energy movement within her caused her injuries to erupt again and the blood dripping from her lips to be an even deeper red.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChanging methods, Frost Dream covered up her face with a sheet of fine gauze.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer eyebrows were furrowed. Her beauty was lovely and moving, even during her weakness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1326\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1328\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1327","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
