{"id":55358,"no":1413,"title":"Chapter 1408 Witchplume, Blacksalt","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1408 – Witchplume, Blacksalt\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNorth Soar Great World, Bright Soar Planet –\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the large planet closest to the Bright Luster Great World, Bright Soar Planet became increasingly busy. There were countless martial artists passing through there every day.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn this day, a young man wearing a bamboo hat arrived at the Bright Soar Planet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe wore tight-fitting black clothes and the bamboo hat was tugged down, hiding his eyes. Within the thronging crowd, he appeared extremely common. But, if one carefully observed him, they would notice that there seemed to be an invisible force field surrounding him. Even on the busy streets, there wasn’t a single person that bumped into him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis black-clothed young man was Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he walked forwards, he could see that the restaurants, medicinal stores, weapon and armor shops, and all other businesses were booming with customers. In particular, the shops that sold one-time use talismans were nearly overrun with eager martial artists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Divine Realm is too large, there are simply too many martial artists.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming sighed. On this street, any one of these people could be considered an outstanding young genius of a Holy Land. Many of them were at least on the level of Phoenix Cry Palace’s White Daohong that Lin Ming had seen in the past.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBack then, White Daohong had been the idol of many young disciples of the Ancient Phoenix Clan. But if he were placed here, he would simply be lost in the crowd.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhite Cloud Bistro was one of the largest and most successful restaurants on the Bright Soar Planet. This business was part of the North Soar Great World’s World King Holy Land, and the restaurant itself was a spirit artifact. It had been located here for an extremely long period of time and the inner furnishings were incomparably opulent. The meals were exquisite, and they were all wonderful spirit foods and spirit wines that benefited a martial artist’s cultivation. Of course, none of this came cheap, but even so, the young elites that gathered at Bright Soar Planet were able to afford the sky high prices.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, on a floor of the restaurant, seven or eight martial artists were loudly speaking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Haha, we’re not bragging at all here. On the Bright Luster Great World’s Whiteheart Planet, the seven of us were surrounded by over a dozen of those saint mongrels. But, not only did they not kill us, but they were instead cut down by our Seven Star Formation! We killed nine of those saint mongrels and the remaining five were left scurrying away with their tails between their legs! In this war I’ve already obtained 3000 merit points!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the middle of the hall, a martial artist with a thick and full beard was enthusiastically boasting.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the people around him were all laughing. One of them mercilessly taunted him, saying, “I must say Tiny Hammer, you keep blowing your so-called heroic exploits to ridiculous levels so often that even we are finding it hard to stand. We might as well talk about the great bloodbath that will be occurring on the Chaotic Blood Continent soon.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right, the battle on the Chaotic Blood Continent will be tomorrow, but what a pity that we don’t have enough merit points to go take a look. I hear that Hang Chi and Dragon Fang are the ones fighting this time!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Humph, that Imperial Prince Naqi is too arrogant, he doesn’t even think that he needs to fight the geniuses of my human race. As for that Good Fortune Saint Son, even though he agreed to fight Lin Ming 100 years from now, that is only because the situation was special at the time so he had no choice but to agree. Normally, the Good Fortune Saint Son would only take him as a barking dog and wouldn’t bother to respond to him at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the topic of Naqi was brought up, the boisterous discussion in the restaurant immediately dimmed down. The 20 some heroic young elites that were drinking or eating suddenly had a strange complexion cross their faces. Many were angry, but there were also many that seemed to feel some dread.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Naqi?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s mind stirred. He vaguely remembered this name and also had an impression towards Naqi, because he had absorbed the memories of the dead saint World King.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Naqi was the first place champion of the saint race’s most recent Divine Sea First Martial Meeting. In terms of talent, he wasn’t much lower than the Good Fortune Saint Son. The only reason he was weaker was because of the difference in their ages.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the memories of the dead saint World King, Lin Ming could see that he had an extremely high opinion of this Imperial Prince Naqi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I see, so he was the first place champion of the saint race’s First Martial Meeting. He truly does have the qualifications to be arrogant.” Lin Ming’s eyes dimmed down. He swished the wine in his glass, saying, “They really think I’m just some barking dog. In the eyes of the saint race, humans are nothing but lambs to be butchered…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming thought this, his eyes glinted with a cold light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Imperial Prince Naqi is arrogant, but he indeed possesses the ability to be arrogant. I wonder if there is a chance that he will fight Lin Ming or Frost Dream!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt wasn’t known who said that, but the young human elites here immediately fell silent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf the humans were compared to the saints, then they really did fall short. Even though they were all champions of the First Martial Meeting, everyone always felt that the human champions were weaker than the saint champions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, it was impossible for them to truthfully say out loud that humans were weaker than saints, thus everyone remained silent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We’ll have to look at the results of Hang Chi and Dragon Fang’s battle. But, Hang Chi’s opponent isn’t Naqi, because Naqi simply didn’t bother with accepting his challenge…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hang Chi is absolutely weaker than Naqi. In the Divine Realm First Martial Meeting, he only came third. Compared to Lin Ming and Frost Dream, the disparity between them is considerable. I have no idea what Lin Ming is doing right now. I heard that he is closed up in seclusion at Mount Potala, but at this time, how could closing up in cultivation help him grow faster than fighting on the actual battlefield!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSome martial artists grumpily said. It was true that Lin Ming had been in seclusion for a long time. The great calamity had already begun over half a year ago, but Lin Ming still hadn’t left Mount Potala.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Even if Lin Ming or Frost Dream challenged Naqi, he still might not agree. That fellow always acts as if he’s above everyone else, as if there is no genius in humanity that has the capital to challenge him. If I had to say it rudely, he was looking down at all of them. Even then, if they challenged him, it would be fine if they could battle to a draw. But if they lost…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe martial artist speaking quieted down. Everyone’s complexions turned ugly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrost Dream and Lin Ming were the future hopes of mankind. This was particularly true for Lin Ming, who had to settle his grudge with the Good Fortune Saint Son in a hundred years. If he lost to Naqi here, then that would be so sad that it wasn’t funny at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If Lin Ming didn’t come to the Bright Luster Great World, that is probably a wise decision on his part. His background is shallow and he requires time to gather himself and improve. He is also much younger than Naqi.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right, Lin Ming is younger so being weaker now doesn’t matter at all.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSome people found psychological comfort in this and changed the topic to Lin Ming’s age. In Lin Ming’s age group, the only one comparable to him was Xiao Moxian.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming listened to these people speaking, he breathed out a long depressed sigh. Was he really pitiful to such a degree? Did others really need to use his age as an excuse to feel better about themselves?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Naqi, I must pay a little attention to him. Since he feels that challenging the geniuses of humanity disgraces his title of Imperial Prince, then I’ll have to see just what worth he has!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming stood up. He left behind a small bag of violet sun stones, put on his bamboo hat and then left the restaurant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe goal that he had decided for himself was to surpass the Good Fortune Saint Son in 100 years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn several hundred years, he had to reach an Empyrean level of strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA thousand years from now, when the war between the humans and the saints truly erupted, Lin Ming had to reach a half-step True Divinity level of strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was strength, not cultivation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for what boundary Lin Ming’s strength would reach at that time, it was hard to foresee.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWanting to break into the Empyrean realm within a thousand years wasn’t easy. After all, even the current youngest Empyrean, Emperor Shakya, had spent 10,000-20,000 years in order to break past the Empyrean bottleneck.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e3.6 billion years ago during the era of Empyrean Divine Seal, there were likely many young elites that had become Empyreans at a young age, but they also probably required several thousand years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA thousand year time limit was far too challenging.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe road of an Empyrean was far too difficult. Even for those extremely talented characters, there was still a chance that they would be stuck at this step.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for whether or not a Great World King realm martial artist could compare with a half-step True Divinity, that wasn’t something that Lin Ming could guess at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn short, the future was filled with unpredictable mysteries. Each lucky chance that he needed to encounter was also an unknown. Without reaching that step, it was impossible for Lin Ming to guess just what level his strength would reach.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut for his current goal, what he needed was to overcome the Good Fortune Saint Son within 100 years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe needed to use the vast pressure and brief golden age brought about by the great calamity to overcome his limits and create a miracle for himself!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming stepped forwards, passing hundreds to a thousand miles in a flash. Right now, by relying on his understandings into the Concept of Space, he could already use void transfer to move through the Divine Realm. Of course, this was still far slower than a spirit ship.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe took out the Primordius Heavenly Palace from his spatial ring and transformed the shape of it. Then, by riding the Primordius Heavenly Palace, he flew towards the Bright Luster Great World at rapid speeds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo hours later, at some point within the broad and endless Bright Luster Great World, there was a fluctuation in space as ripples appeared. A gray palace shot out from these ripples, rapidly flying forwards!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePrimordius Heavenly Palace was countless times faster than an ordinary spirit ship. Even so, the Divine Realm was far too large. Wanting to cross through a great world within a single day was a bit difficult.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd as Lin Ming was flying, the great battle atop the Chaotic Blood Continent had begun!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Chaotic Blood Continent was not a planet, but a massive continent that floated in the starry skies above the Bright Luster Great World. This continent was extremely strange. Normally, in a Divine Realm Great World, only the central mainland was able to defy physics and maintain a floating continental shape. As for the other floating continents, if they were too large, they would collapse under their own gravitational force and form a sphere, becoming a planet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRumors said that the Chaotic Blood Continent was not naturally formed, but created by the hands of a man in ancient times. This mysterious figure was said to have been an extreme Empyrean or even a True Divinity powerhouse, but whatever they were, they had used their infinite supernatural abilities to form this floating continent and then kept its shape fixed with a grand array formation. As for what the reason had been for creating this continent, it was unknown.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn this continent, all the influences were mixed up together and there were endless wars all year round. Because of this, the smell of blood and the sounds of chaos filled the air at all times, and the Chaotic Blood Continent had gained its fame like this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, within the central area of the Chaotic Blood Continent, there was a mountain hundreds of thousands of feet high. This mountain had been sliced off near the middle, and the upper half had been completely flattened, forming a massive platform.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGathered on this giant platform were many human powerhouses as well as saint race powerhouses.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong these powerhouses were also many Great World Kings and half-step Empyreans.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAccording to the conditions of the treaty, these people could not take action on the Bright Luster Great World. The only reason they appeared here was because a great battle would soon erupt and draw the attention of all eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two battling parties were the top 10 extreme geniuses of the human and saint races’ respective First Martial Meetings.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere would be a total of two battles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe first match was the sixth placed martial artist of the saint race’s First Martial Meeting versus the sixth placed martial artist of the humans’ First Martial Meeting.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was Witchplume against Dragon Fang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe second match was the saint race’s fifth placed martial artist against the humans’ third placed martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was Blacksalt against Hang Chi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWitchplume and Blacksalt were both fellow junior disciples of Naqi. The three of them often appeared together.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith humanity and the saints having fought to this point, although the saints had gained an upper hand so far, humans had also won many battles. With both sides having their own victories and defeats, no one refused to accept being the loser.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was especially true for hot-blooded young elites who were filled with vigor and daring.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battles between the two sides became increasingly intense and the slaughter grew increasingly wild. Thus, it was unavoidable that there would be a battle between the peak geniuses of the saints and the humans!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy determining who was stronger between these peak geniuses, that would equally prove which race was stronger and which race was weaker!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1407\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1409\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1408","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
