{"id":55386,"no":1441,"title":"Chapter 1436 Self Explosion","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1436 – Self Explosion\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the battlefield, Lin Ming’s figure flashed and he disappeared from sight. He was like a death reaper that haunted the night, wantonly harvesting life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis speed was far too fast. From crippling the Black Iron Ghost third brother to taking his spatial ring, this had only taken a fraction of a second. The moment that people saw blood splash out, the Black Iron Ghost third brother’s crippled body was already falling down from the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Third Brother!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron boss roared out. Although the Black Iron Ghost Triad had done all sorts of evils in their lives, they still had a bond between them because they were true blood brothers. Now that they saw their blood brother being wasted in front of their eyes, even the most cold-hearted individual couldn’t remain unresponsive.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He’s crippled Third Brother!” The Black Iron second brother shouted, his eyes turning red.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Don’t be impulsive! We are not his match at all!” The Black Iron boss could only remain as calm as he could. At this time, the only one he could save was himself. As he sent a sound transmission to his second brother he fled with all his strength. But at this time, a voice of death quietly echoed in his ears like the whispers of the end. “You are second!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Fuck, I’ll fight with you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron boss was a ruthless individual. Since he clearly knew he wasn’t able to run away, he erupted his astral essence to the limit, protecting all of his vital points as he swept his saber out towards Lin Ming’s waist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut as his saber was slashing outwards he felt himself suddenly slow down. All around him, time was distorting at incredible degrees.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTime laws!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron boss was nearly frightened to death. As a saint race martial artist, his attainments in the Laws were nearly nothing at all. A powerful saint martial artist could use their terrifying strength to crush through the Laws and break free from the shackles of time or pierce through the void, but the Black Iron boss was far from accomplishing this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu - !\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming appeared behind the Black Iron boss like ghosts and gods. His left hand grasped the Phoenix Blood Spear and his right hand formed a fist that came crashing down at the Black Iron boss’ spine!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Body Tearing Bone Shattering Fist!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Body Tearing Bone Shattering Fist was originally a body transformation system martial skill. And now that Lin Ming had fully opened the Eight Inner Hidden Gates and had also seen the threshold of the Nine Stars of the Dao Palace, this punch could even pulverize the void. If this fist struck someone, especially a place as frail as the spine, even a saint race martial artist wouldn’t be able to withstand it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKacha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a loud cracking sound, a wild and brutal vibration force spread through the Black Iron boss’ entire spine. A horrifying destructive power began to ravage his bones, marrow, and nerves!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron boss cried out in misery, his entire body shook and his head drooped downwards. His entire spine had been ruined by Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though saint race martial artists had high regenerative abilities, this sort of wound was nearly the same as crippling them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven so, Lin Ming accompanied it with a Pulse Cutting Palm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe would not allow his opponent any chance to stand back up. After all, a wound to the spine could be cured with good enough medicines. But, a wound created from the Pulse Cutting Palm would require a Great World King to spend a great deal of effort in order to concoct the correct pills to heal it. And, it was impossible for the Black Iron Ghost Triad to obtain such medicines with their abilities.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRather, it was better to say that before they could find the necessary medicines, they would have already died a horrible death in the City of Discord.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron boss’ spatial ring exploded. Lin Ming picked up the skull badge from the wreckage. As for the Black Iron boss himself, he dropped next to his third brother like a pile of rotten meat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t even pause for half a step. The space beneath him shrank to an inch and he instantly crossed a hundred miles. In the next moment he had overtaken the last of the Black Iron Ghost Triad.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ahhhh! I’ll perish with you!” The Black Iron second brother’s eyes were red with rage. His entire body began to swell up like a balloon. The astral essence within him rumbled like a volcano, ready to explode at any moment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Self-explosion?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s pupils shrank. Some martial artists, before they died, could galvanize the entirety of their inner world, their energy, and their blood vitality to explode. This explosive attack was ten times stronger than their all-out strike. Even a martial artist that was an entire boundary higher than them would have to evade such an attack, otherwise it would be easy to be wounded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, this sort of martial skill was far too vicious. It was a completely suicidal attack to bring both parties down. Normally, very few martial artists would study such a martial skill. Only those deathsworn martial artist and ruffians would ever think of learning such a move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Brat, I may die but I will drag you down with me!” The Black Iron second brother’s face was completely distorted like a deformed monster. This wasn’t because he was angry but because the astral essence within his body was nearing the point of explosion. Blood vitality began gushing out from all over him, and his muscles, bones, and meridians were already overflowing with chaotic astral essence in a complete mess. His body resembled a large meatball, disgusting and monstrous.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWoosh! Woosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron second brother’s four limbs stretched out. They suddenly turned soft as they swung towards Lin Ming like tentacles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDuring the battle at the Chaotic Blood Continent, there were saint race martial artists that had used similar abilities. As a race who thoroughly cultivated the body transformation technique, they could make their bodies as hard as diamonds or as soft as noodles in order to bind their enemies.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Blood energy lockdown!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron second brother bit down on the tip of his tongue and spat out a large mouthful of blood essence. This was 30-40% of his blood essence. Since he was going all-out with his life on the line, he no longer had the scruples to care about this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs his blood essence burned, the Black Iron second brother’s entire body erupted with a fog of blood. Then, Lin Ming felt his body slow down. It was like his entire bloodline was being attracted to the Black Iron second brother, wanting to leave his own body!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnder this traction of blood energy, Lin Ming felt like he had fallen into a swamp. His movements slowed down, making it hard for him to move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the Black Iron second brother’s so-called blood energy lockdown. Although it was an attack made by combusting his blood essence, Lin Ming could still easily work his way loose. But, in the brief moment that Lin Ming was doing so, the second brother’s four limbs wrapped themselves around him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Now that I’ve got you, you are dead! No matter how strong you are, we are going to die together!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron second brother maniacally laughed. At the moment before his death he had fallen into madness!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though Lin Ming was held down by the Black Iron second brother, he still remained as calm as before. He indifferently said, “Your self-explosion trick is useless against me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s ten fingers flashed as he formed hundreds and thousands of seals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDivine Seal Art – God Forbidding Seal!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWoosh woosh woosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese God Forbidding Seals instantly sank into the Black Iron second brother’s inflated body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe God Forbidding Seal was the first technique listed in the Divine Seal Art. Every seal was in truth a miniature black hole. Lin Ming had once used the God Forbidding Seal to break through Frost Dream’s Dreamsoul Immortal Melody and exterminate the spiritual god of faith energy that she had summoned. At that time, in terms of strength, Frost Dream was no weaker than Lin Ming, and the Laws she displayed had reached an inconceivable degree.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, when Lin Ming and the Black Iron second brother were compared to each other, they were on completely different levels in terms of strength and skill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that time, Lin Ming had forcefully blocked the spiritual god of faith energy, so what could this self-explosion skill from the Black Iron second brother hope to do against him?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eChi chi chi!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe God Forbidding Seals were like a pack of starving beasts as they wildly swallowed up the astral essence and blood vitality within the Black Iron second brother’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlack Hole seals originally had the ability to swallow all power. They could even swallow up the Divine Dream Law’s summoned power of faith, much less something as simple as astral essence and blood vitality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“W-what?” The Black Iron second brother’s complexion changed. His body actually began to shrink and wither away. The hundreds of God Forbidding Seals that entered his body were wildly swallowing up all his energy. Currently, the Black Iron second brother’s body was like a giant water bag, and these God Forbidding Seals were like hundreds of holes that constantly drained him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Explode! Explode! Why can’t I explode!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Black Iron second brother’s appearance was fierce and demented. “This is impossible! Once my Saint Demon Disintegration Art starts, not even I can stop it. Just how are you doing this!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn just several breaths of time, the Black Iron second brother’s body had shrunk to an even smaller size than his original self. Let alone exploding with energy, his astral essence and blood vitality were at pitifully low levels, making him look like he was in the last waning years of his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Divine Seal Art included the Laws of Sealing and also the Laws of Swallowing. Once everything was swallowed into these miniature black holes it would naturally be thoroughly sealed away!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe astral essence and blood vitality within the Black Iron second brother’s body had all been swallowed up and sealed away. Naturally, he no longer had the strength to explode his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is it, what a shame…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming forcefully broke through the four limbs binding him. These four broken limbs didn’t leak any blood at all; the blood vitality within them had already been cleanly swallowed by the God Forbidding Seals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I am unwilling…” The Black Iron second brother shivered, his face white. Could there be any situation more miserable than how he was now? He couldn’t escape, and the suicidal self-explosion technique he tried to use had been easily resolved. To him, this was extremely pathetic.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’re the third one… Pulse Cutting Palm!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming thrust out his palm. With a light cracking sound, the Black Iron second brother’s bones and meridians shattered as he fell to the floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLike this, the Black Iron Ghost Triad had been completely eliminated by Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming took the last skull badge. Now that he had obtained three skull badges, in addition to his own, he had four. Still, he was 46 skull badges away from completing the blue soul level trial checkpoint and 96 skull badges away from completing the zenith black level checkpoint.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough it seemed the number of skull badges for the zenith black level checkpoint was only twice that of the blue soul level checkpoint, Lin Ming knew that the difficulty was more than double, because as more time passed, obtaining skull badges would become increasingly hard.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I should look for the remaining skull badges…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming glanced around. Everyone near the battlefield had already fled away without even half a shadow remaining.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA smart choice, but unfortunately… it was useless!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Lin Ming had cut down the Black Iron Ghost Triad, he had simultaneously placed a blue soul battle spirit mark on their bodies. In this dimension realm, no matter how far they tried to run, in Lin Ming’s eyes they would be like giant beacons of light in the darkness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLike this, the true Hunter Game could begin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming didn’t immediately hunt down these people. Instead, his figure flashed and he arrived above a field of tall grass. As he looked down, he icily said, “You’ve been watching for a long time. Come out.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe winds rustled the high grass, but there was no sound of movement from within the field.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming pointed his Phoenix Blood Spear downwards. On the spear point, the light of thunder and fire sizzled. “Then, we can only fight now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait… wait…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA deep voice echoed out. The tall grass was separated and a monster martial artist covered head to toe in green hair slowly walked out. He had an extremely ugly complexion right now.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis green-furred monster martial artist was much shorter than ordinary monster race martial artists. Standing in front of Lin Ming, he was an entire head shorter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1435\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1437\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1436","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
