{"id":55423,"no":1478,"title":"Chapter 1473 Ghostly Steps","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1473 – Ghostly Steps\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Xiao Moxian rushed into the entrance without using any true essence at all, the other martial artists nearly gasped in shock!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe reason that the dragon clan girl didn’t use true essence to pass through the entrance was that she cultivated dual body and energy as well as her Divine Lord realm cultivation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, Xiao Moxian’s cultivation was only at the late Divine Transformation realm. The difference was far too great. Moreover, this black-clothed girl seemed unlikely to be a martial artist who had reached large success of body transformation, yet she still wasn’t using any true essence at all?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn a spark of light, Xiao Moxian had already broken through the entrance. The entrance dazzled with a golden light, overflowing with the chaotic powers of thunder, flame, wind blades, and even space and time, everything weaving together into a web of death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Moxian didn’t even use her Phoenix Trueform as she rushed into this web.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eCa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a light sound, Xiao Moxian’s body was struck by a bolt of thunder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe watching martial artists’ pupils shrank. Without any time to respond, they saw Xiao Moxian’s figure vanish, leaving nothing behind but an afterimage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis terrifying speed didn’t surprise Lin Ming and Monster Prince Duyu, however, the other martial artists felt their eyes widen in astonishment even as disbelief colored their faces. It was hard to imagine that this terrifyingly fast Xiao Moxian was only a Divine Transformation realm martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the web of chaotic energies, Xiao Moxian erratically drifted about, leaving behind a series of afterimages in her wake. She was like an enchanting spirit of the night, dancing through the skies and leaving a trail of ethereal smoke, freely travelling through the web of energies that was nearly impossible to avoid. When people thought that Xiao Moxian had nowhere left to dodge and she was about to be struck, she used an inconceivably fast movement technique to pass through gaps within the barrage of energies. Finally, those attacks of chaotic energies only struck her afterimages!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How terrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How is she doing that!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust looking at that dense web of attacks, no one believed that someone could simply use a movement technique to dodge everything and pass through the entrance to the inner ridge. This was simply incredible!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong the many martial artists watching, there were some who saw how Xiao Moxian was dodging. For instance, Fatty Zhou and the dragon clan youth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Although the chaotic energies at the entrance look crowded, the truth is that energy attacks come in waves and there is a brief gap between these waves that lasts for less than an instant. That black-clothed girl can see through these gaps and pass through them!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe dragon clan youth slowly said. But, this explanation was even more shocking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough this approach seemed simple it was nearly impossible to accomplish. It needed an incomparably horrifying level of observation and calculating ability. Every moment, one had to include countless variables to figure out where to dodge. Just a single mistake would mean one would be struck by the chaotic energies!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWoosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Moxian passed through the inner ridge entrance and steadily landed down without using any true essence, as she had said before. Moreover, the chaotic energies hadn’t even touched her clothing!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the dragon clan girl saw Xiao Moxian land, her complexion became ugly. Compared to Xiao Moxian’s light and sprightly movements, her using her bodily defensive capabilities and high grade spirit artifact vestment to withstand the barrage of chaotic energies seemed clumsy and oafish.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMoreover, she had to admit that she was inferior to Xiao Moxian in movement techniques.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Xiao Moxian looked at the dragon clan girl’s complexion, she smirked. This was exactly the effect she wanted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is that girl really at the Divine Transformation realm?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“In terms of movements I am not even capable of a tenth of what she can do!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Perhaps she has some particular talent in terms of movement, but what she did just now needs not only power, but also talent in observation and instantly calculating the situation. Her perception must be terrifying!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany martial artists didn’t know that Xiao Moxian was the descendant of a true God Beast. If they knew, they would be so surprised that their chins would hit the floor. After all, she was a proud beauty that even the heavens would be jealous of.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn fact, Xiao Moxian wasn’t just talented in movement. She was strong in all aspects, and her movement abilities were only a part of her strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBeside Lin Ming, Fatty Zhou traced his chin, secretly dumbfounded. He originally thought that out of all the guests here, the dragon siblings and short black-cloaked youth were already extremely talented, but he never imagined that there would be someone so bizarre. It was no wonder that this Divine Transformation realm girl would be so brave as to enter God Burying Ridge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Xiao Moxian passed the entrance, everyone turned to look at Lin Ming and Monster Prince Duyu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese two people had come together with Xiao Moxian and were also at the Divine Transformation realm. Just how strong were they?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter being looked upon by so many people, Monster Prince Duyu’s complexion was extremely poor. In his innermost heart he didn’t want to go into the inner ridge, but at this time it wouldn’t be safe for him to return alone either. His only choice was to steel his mind and continue forwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What shit luck.” Monster Prince Duyu calmly thought to himself. He revolved his true essence to the limit and directly impacted towards the entrance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa ka ka!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThunder and flames crashed onto his body. It wasn’t easy for him to withstand such a fierce destructive power. In fact, it was somewhat straining.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Xiao Moxian was at the middle Divine Transformation realm, her strength already far surpassed Monster Prince Duyu’s. Now that she had stepped into the late Divine Transformation realm, the difference between her and Monster Prince Duyu increased even more.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu - !\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMonster Prince Duyu also steadily landed on the floor. From start to finish his performance was satisfactory.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It looks like these three people are all unrivalled monstrous geniuses, and that black-clothed girl should be the most magnificent of them all. Even so, it’s incredible if just a single one of these monstrous geniuses were to appear, so why would three of them show up together?” Fatty Zhou breathed out a sigh of relief. He could feel that this black-clothed girl’s movements and talent already surpassed the scope of his understanding.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This little brother, it seems you’ll be able to easily pass too…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou smiled at Lin Ming. From just the aura emanating from Lin Ming’s body, he could feel that Lin Ming was also a dual body and energy cultivator and his foundation was shockingly solid. It was hard to imagine how strong he was.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming nodded. Then, he activated his movement techniques and rushed towards the entrance to the inner ridge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn terms of speed, Lin Ming had the Gate of Wonder and high attainments in the Thunder Laws, allowing him to surpass Xiao Moxian in this aspect. In terms of perception, Lin Ming was on par with Xiao Moxian. For him to pass through the entrance like Xiao Moxian had done wouldn’t be a problem at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming had no need to do that. Using true essence to protect his body was the simplest and easiest method.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe power of thunder and fire wrapped around Lin Ming, creating a barrier around him. This power just happened to counterbalance the chaotic energies – no more, no less, just right.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter several breaths of time, Lin Ming passed through the entrance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This youth isn’t simple either. But he doesn’t seem to be as amazing as that black-clothed girl.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany people secretly speculated. Of course, it was hard to see just how much strength Lin Ming was holding back by him passing through the entrance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It looks like we can’t regard these three as ordinary late Divine Transformation realm martial artists. Although that young man didn’t have some startling performance when he passed through the entrance, his skill in controlling energy was sublime. He didn’t waste a single speck of energy at all. It’s clear that he has high achievements in the Laws.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Fatty Zhou thought this he protected his body with true essence and passed through the entrance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBehind him the others began to follow one at a time. Some passed through with ease and some didn’t.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’re quite skilled. Allow me to introduce myself. I am called Dragon Cloud and this is my little sister Dragon Moon.” As the dragon clan youth arrived beside Lin Ming, he turned towards him and spoke with a smile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1472\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1474\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1473","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
