{"id":55424,"no":1479,"title":"Chapter 1474 Curse","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1474 – Curse\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe talented and the strong always attracted the attention of others. When Dragon Cloud saw the strength of Lin Ming’s group he immediately wanted to become friends with them. Lin Ming and Monster Prince Duyu weren’t too startling in their performance, but Xiao Moxian was stunning.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My name is Lin Lanjian.” Lin Ming said, introducing himself.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My name is Ji Xian’er.” Xiao Moxian giggled. As opposed to Lin Ming who had given a fake name, Xiao Moxian had given her true name.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe surname of Empyrean Demondawn’s direct lineage was Ji. Xiao Moxian’s birth name was Ji Xian’er.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Moxian’s name that she usually referred to herself as was one that was conferred to her in a smelting trial. Xiao Moxian – the Little Demon Fairy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou was extremely careful as he led the group forwards into the inner ridge. He pulled out the compass and constantly adjusted direction using divinations arts. His speed was even slower than when they were walking through the outer ridge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven so, no one complained.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs they continued to walk forwards, Lin Ming was silent. He looked all around him, using his sense to probe the inner ridge’s dao field.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the legends, God Burying Ridge’s dao field was left behind by the Asura Road Master and had evolved through billions of years of time. As Lin Ming investigated his surroundings, he could faintly feel a deep and boundless aura. This aura gathered into vague lines of the Great Dao that slowly flowed through the world like streams of stars.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“These Great Dao lines…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s thoughts stirred. He could feel that the Great Dao lines were somewhat familiar, however, he couldn’t immediately recall where he had seen them before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Could this be… the jade pendant’s map!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s mind shook. He seeped his divine sense into his spatial ring and began to verify the lines within the emperor jade’s map with what he could sense around him. Finally, he was able to confirm that this map within the jade pendant was a chart of God Burying Ridge’s dao field!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn other words, the Asura Road Master had once carved the entire chart of God Burying Ridge’s dao field into this jade pendant!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming realized this, he shuddered. If so, then this emperor jade was far too valuable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the entire dao field chart of God Burying Ridge, let alone the value it had in exploring this land, just the Concepts, Laws, and all sorts of principles within the dao field itself were more than enough for Lin Ming to gain massive insights.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming continued forwards with Fatty Zhou, he simultaneously verified the emperor jade map’s lines with the dao field around him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing the map was one thing and personally experiencing it for himself was another. Now that Lin Ming was able to verify this dao field with what he knew, the previously mysterious and impossibly profound emperor jade was actually able to allow Lin Ming to discover all sorts of deep and mystical principles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery two hours, Lin Ming would gain new comprehensions. To branch out a part of his concentration and divine sense to meditate on the emperor jade was extremely dangerous in God Burying Ridge. Although Lin Ming practiced the Divine Dream Law and his sense was formidable, even he wasn’t an exception.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, sharpening one’s axe wouldn’t delay the process of cutting wood; preparing himself for this area would be far more beneficial. This also allowed Lin Ming to understand the essence of God Burying Ridge. This was something that Fatty Zhou couldn’t compare with. Although Fatty Zhou could guide one into God Burying Ridge, this was due to the sum of countless predecessors who had traded their lives for more experiences. The master passed their knowledge to their apprentice and this knowledge continued all the way until now.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough these experiences were easy to use, they couldn’t explain just why God Burying Ridge was the way it was.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone continued forwards slowly and calmly. Then, at this time, a gray tornado appeared in the skies. Wind howled and the faint moans of ghosts wafted in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese ghostly beings were formed from all sorts of energy fields that had existed here for billions of years. They could be called bizarre and incomprehensible. Even a Holy Lord would feel dread facing these existences.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ignore them. As long as they don’t take the initiative to attack us then we don’t need to bother with them. I will use this Heaven Net Compass to shield the vitality of the 11 of us. These ghosts do not have eyes nor do they have divine sense; they only have an instinct to devour life. As long as they don’t smell the life coming from us they will not find us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Fatty Zhou spoke, many array symbols began to spin around them, sticking onto everyone and wrapping around them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was only a light force field with some runes. This thin barrier blocked out the ghosts that could rush towards them at any moment, wanting to steal their lives.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWu ! Wu ! Wu !\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFierce winds swept up and the cries of ghosts became increasingly loud. Then, from within the tornado, the figure of a ghost king that was several dozen feet tall appeared.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis ghost king’s body had already substantialized, and it had the facial features of a person. Two soul flames flickered within its hollow eyes; it was clearly intelligent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis intelligence was gathered from the ghost king swallowing the souls of numerous martial artists. By eating up the wisdom of living beings, this ghost king had eventually evolved its own form of a soul.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ghost king!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou frowned, a dignified look on his face. From the time he entered God Burying Ridge, Fatty Zhou had always been extremely careful and slow in his pace, but he had also been smiling the entire time. This was the first time he showed such a grim expression.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is the situation very bad?” Some people asked with a true essence sound transmission.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou nodded. “Yes. If this fellow discovers us then some of us will certainly die.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe force field that Fatty Zhou laid down was not invincible. If these ghosts were powerful enough, they could see through his force field. At that time, all of them would be in danger. This ghost king was extremely difficult to deal with and it was likely that several of them would die in the ensuing battle. But, the most terrifying part was that the echoes of their battle would likely attract other evil beings over here. Once that occurred, their losses would be astronomical.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone maintained full vigilance. Every single martial artist here was an extraordinary individual amongst their level. As they grew up to this point they had encountered many brutal battles. Facing such a grim scene, all of them appeared solemn but not panicked at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLuckily, the force field that Fatty Zhou laid down was extremely stable, locking down the life force of everyone here and not revealing the smallest trace. The ghost king didn’t notice their existence at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe black winds faded; the ghost king seemed as if it would leave soon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone began to secretly breathe a sigh of relief. Not facing a life or death battle was the best possible outcome.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe further the ghost king went, the more relieved Fatty Zhou became. The moment he was about to tell everyone to begin moving out once more, a sudden change occurred!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA mysterious and invisible strength emerged from the air, smashing into Fatty Zhou’s force field and causing it to wildly shake as if it would shatter at any moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter that strike just now, the ghost king that had been leaving stopped in its tracks as if it had sensed something.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is happening!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA half-step Holy Lord trial challenger asked, his complexion darkening.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou’s complexion was grim and unsure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith another strike, the force field became even weaker. Fatty Zhou’s palms began to drip beads of sweat. He had confirmed a terrifying fact, and that was that someone was attacking them!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNot the evil beings of God Burying Ridge, but other people!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is happening!” Some other people also discovered that something was wrong.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Curse technique… this is a curse attack that we God Burying Ridge guides use! Someone is using a secret curse technique to attack us!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA God Burying Ridge guide was an extremely special occupation in Heavendevil City that had an incalculably long inheritance. Masters passed their knowledge to their apprentices and their apprentices passed their knowledge to their students.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis included all sorts of secret techniques, including divination, feng shui, array formations, curse arts, and so on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSince long ago, the God Burying Ridge guides would compete with each other. They competed for customers, and for the reason of stealing away their rivals’ knowledge and inheritance, they would even kill them. They could use all sorts of secret arts to interfere with the other party’s abilities. In particular, this was true for when the other party was under attack by the evil beings of God Burying Ridge. Using secret techniques at this time was the most vicious and ruthless method!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Curse!? What kind of curse!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou’s words aroused unease in everyone. Curse techniques were extremely mysterious and almost impossible to guard against. As long as this other party had locked onto their soul aura they could attack from afar. Even among the common mortals there were sorcerers that could harm people by stabbing a little straw man figure of someone, much less martial artists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNormally, using curse arts against martial artists of a similar level didn’t have much effect. But, the crucial point was that this curse attack that struck Fatty Zhou at this moment was the straw that would crush the camel’s back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This curse technique… could it be the Spiders?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Fatty Zhou realized this his complexion became extremely ugly. Amongst the God Burying Ridge guides, the Spider Brothers were a notorious duo. They were infamous for murdering others to steal their possessions, and it was unknown how many fellow guides had died under their hands. Even their own customers might be killed by them!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Spiders?” Lin Ming had never heard this name before. Now that they were being attacked he naturally associated this with Imperial Prince Naqi. Could this be his doing?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking back on it, he did leave some flaws behind in his methods. It was possible that Naqi had chased him all the way to God Burying Ridge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe main point was that Lin Ming never expected he would meet Naqi at Heavendevil City to begin with. And now that he realized this, there was no time to make up for these mistakes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou’s force field shook again, as if it were about to shatter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the ghost king, it had also discovered that there was something strange here. It opened its mouth and let out a deep and ghastly roar.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1473\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1475\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1474","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
