{"id":55429,"no":1484,"title":"Chapter 1479 - Information Jade Slip","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 1479 - Information Jade Slip\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hey! Let me take a look, this thing looks really fun.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Moxian commented as she looked at the 10,000 corpse flower in Lin Ming’s hand. She reached out a curious hand to pinch it. Even when facing such a dreadful thing that was rank with blood, Xiao Moxian could still see it as a toy. One couldn’t help but sigh with admiration over how strong her nerves were. A martial artist’s life was filled with life and death; that was something she was long used to seeing. She had killed countless people already, and as for something like a 10,000 corpse flower, she simply didn’t care about the dangers it brought. This was the inherent risk-loving nature that Xiao Moxian had.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 10,000 year corpse flower resembled a blood red ginseng, but its main body actually felt meaty, as if it were formed from flesh and blood. Looking through its skin, one could even see lines that were filled with red liquid.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed like an animal but also a plant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This thing is similar to the 10,000 year corpse grass in the Eternal Demon Abyss… even the name is similar, what a strange coincidence…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming mused. The 10,000 year corpse grass he captured in the past was also a spiritual plant that grew on the corpses of powerhouses. Of course, compared to the massive number of powerhouses that died in the Asura Road, the powerhouses of the Eternal Demon Abyss could only be considered common mortals. Without a source of good nourishment, the 10,000 year corpse grass was far from being as powerful as this 10,000 corpse flower.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn truth, the Eternal Demon Abyss and God Burying Ridge both had sealed force fields. Moreover, they were lands where many powerhouses perished. It wasn’t strange for these two different lands to evolve similarly strange spirit plants.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What use does this have?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming asked Fatty Zhou.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Brother Lin’s 10,000 corpse flower can be refined to make a great number of pills. Eating it directly is also beneficial. In particular, if it were given to a contract beast to eat it can help quicken the evolution of the contract beast.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter seeing Lin Ming show his great skill twice, Fatty Zhou became increasingly respectful towards him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Quicken a contract beast’s evolution?” Xiao Moxian excitedly said. Her first thought was Big Yellow and having Big Yellow eat this plant to help hasten his growth. But, the main work of capturing this 10,000 corpse flower was due to Lin Ming, so it wasn’t considered hers at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Make pills…” Lin Ming thought for a moment. He didn’t know what sort of pills the 10,000 corpse flower could make.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Brother Lin, I have here a jade slip that records the details of many magical treasures of God Burying Ridge, and there are also many various uses for them. You can take it for a look. After looking through it you can simply destroy it.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFatty Zhou tossed a blue jade slip towards Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming received the jade slip and swept through it with his divine sense. The contents were indeed as Fatty Zhou had said; it displayed tens of thousands of magical and mystical objects that had been found in God Burying Ridge before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong the records of some magical things, not only did it list their weakness, method of capturing, and even specific dangers, there were also many ways listed to refine pills from them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, most magical things only had an extremely short description. It was clear that this was because the information was lacking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was obvious that this jade slip was quite valuable. It was certainly one of the main inheritances of the God Burying Ridge guides.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo the guides of God Burying Ridge, the most important inheritances were skills to live in God Burying Ridge, divination techniques, and methods to judge the danger of various landscapes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis sort of core inheritance was what Fatty Zhou relied on to find food. It was the sum of all information that Fatty Zhou’s predecessors had slowly gathered over time in exchange for their lives; he certainly wouldn’t give such a core inheritance to Lin Ming. Moreover, it wasn’t something that Lin Ming could learn in a single day.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Thank you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming began to skim through the jade slip. His divine sense was powerful and he had a photographic memory. Not to mention the many records of magical things listed in the jade slip, Lin Ming was even able to quickly and perfectly memorize the endless mysterious Asura Sutra from the Emperor Stone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn just a single incense stick of time, Lin Ming finished reading through the jade slip. Then, in front of Fatty Zhou, he crumbled the jade slip to dust.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Farewell and goodbye. I wish you all the best and hope you can leave here alive.” Lin Ming said. Then, he looked towards Xiao Moxian and said, “Are you sure you won’t change your mind?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course!” Xiao Moxian said, rubbing her chin. “Are you very moved by how heroic I am?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh… well, a bit.” Lin Ming was startled for a moment before he laughed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLike this, the two of them walked side by side into the far off distance. Soon, their figures vanished in the sea of flowers and grass.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Fatty Zhou saw this, he didn’t know what to feel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Big Brother… I think that separating from them might have been a mistake…” Dragon Moon whispered from beside Dragon Cloud.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Cloud shook his head. “If we went with them, we would have encountered more dangers. We’ve come with them all this way, but have we been short of people dying?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDragon Cloud rhetorically asked. Dragon Moon could only agree. Just because Lin Ming was able to survive a disaster didn’t mean that they also had the ability to do so. In a life or death moment no one would risk their own survival in order to save a stranger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We have to be cautious, and in truth… if Lin Lanjian wants to survive through dual crises of escaping a World King powerhouse and also travelling through God Burying Ridge, his hopes of doing so are near zero. No matter how strong he is, he cannot be stronger than a World King powerhouse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Dragon Cloud said this, many people agreed. Even Fatty Zhou wasn’t an exception.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe disparity between the Divine Transformation realm and the World King realm was too great. It was impossible to overcome a gap of three great boundaries.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMoreover, there were far more terrifying dangers in God Burying Ridge that Lin Ming wouldn’t be able to deal with. If he didn’t understand the terrain here, he could easily step beyond hope of redemption!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s go!” Fatty Zhou waved his hand. Everyone turned and walked away, beginning their life or death journey anew.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They seem to have… separated!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeveral hundred miles away, in a mountain valley, the imp race Spider Brothers were using a compass to divine the situation. However, their tracking mark had been placed on Fatty Zhou and not Lin Ming. They weren’t sure if Lin Ming had really separated from Fatty Zhou or not, but had extrapolated this from the available information and signs they had.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Separated?” Imperial Prince Naqi traced his chin. “If they separated then they must have realized something, otherwise they wouldn’t have done something so stupid such as dividing their forces! However, Lin Ming shouldn’t know just who is hunting him down, and separating randomly in God Burying Ridge is no different from suicide.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNaqi quickly thought. If Lin Ming separated himself from Zhou Shiyan it would indeed be far, far more difficult to find him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s speed up!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This…” The Spider Brothers had awkward expressions. The faster they went, the more dangers they would have to undergo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? Are you questioning my orders?” Naqi frowned.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We do not dare. We understand.” The Spider Brothers could only grit their teeth and agree. When one was underneath the house of others they had no choice but to lower their heads. If they were being employed by a World King powerhouse, that meant higher rewards, but at the same time they also had to swallow any insults and suffer even greater risks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Several lords, the entrance to the inner ridge is not too far away. As long as we enter the inner ridge that means we will all be in the same sealed off dao field as the person you are looking for. At that time, we can use our divine sense to search for them, but doing so may alert unknown existences there, bringing in even more dangers.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Spider Brothers cautioned. They had already arrived in front of the inner ridge entrance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1478\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-1480\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-1479","bookId":1508,"creation":"Sep 10, 2019 5:41:20 AM","modification":"Sep 10, 2019 5:41:20 AM"}
