{"id":54101,"no":156,"title":"Chapter 155 - Miniature Thunder Fire Killing Array","content":"\u003cp\u003e\u003cstrong\u003eChapter 155 Miniature Thunder Fire Killing Array.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cstrong\u003eChapter 155 – Miniature Thunder Fire Killing Array\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Since I’ve offended them, what’s done is done, it’s no big deal. Ouyang Dihua might be a little tricky to deal with, but I am not afraid of the Allied Trade Association at all.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter all, the Allied Trade Association was only a civilian organization. It was true that they had a very deep pockets of resources and a long history, but they still had to comply with the rules of the Seven Profound Martial House.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut Ouyang Dihua was different. Even if he followed the rules of the Seven Profound Martial House on the surface, he might secretly try to murder him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf the Allied Trade Association wanted to assassinate him, then that would provoke the utter outrage of the Seven Profound Martial House. Qin Ziya would never let this happen. The only result would be that the Allied Trade Association would meet with an apocalyptic disaster.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut if Ouyang Dihua wanted to assassinate him, then that was a different story. Ouyang Dihua had the backing of a Seven Profound Valleys elder. As long as he didn’t leave any evidence, not even Qin Ziya could touch him, and he would finally have to drop the matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I must be careful of Ouyang Dihua. Before I have the strength to resist him, I must go out as little as possible!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My top priority right now should be to increase my strength.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming thought this, he took out two items from his spatial ring – the Thunderbolt Devilfire Bead and the Blood Lingzhi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was not in a hurry to consume the Blood Lingzhi. Before, when he had taken the Crimson Gold Dragon Marrow Pill and the Golden Snake Scarlet Pill, there had been some pill toxins that were left in his body. He needed to cultivate for a longer period of time and completely refine the impurities out of his body, and wait for his true essence to stabilize before he could consume the Blood Lingzhi and fully absorb its effects.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the Thunderbolt Devilfire Bead, although it was a one-time use item, its power didn’t seem small, and it was obviously valuable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming looked at this bead. He wanted to search for any clues that would indicate how to use it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe bead was the side of a longan, and was an icy blue color. It had an extremely cold surface, and it was chillingly cold in his hand. He couldn’t discern anything special about it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming cautiously investigated the bead with his soul force. As soon as he began to probe, his mind moved.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? Array formation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the Thunderbolt Devilfire Bead was a myriad of dense runes. These were array symbols.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e “The inscription symbols seemed to have not unified into a complete array formation, it seems to belong to… Mm, I see, I understand…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn Lin Ming’s memories about array formations, there was more than the one kind that involved inscription symbols.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe second time that Lin Ming had entered into the infinite space of the Magic Cube, he had absorbed the soul fragment of a mighty elder array master. Lin Ming had completely sealed away this array master’s array formation memories, and had not studied them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe main reason for this was simply that his cultivation was at too low a realm, and he didn’t have the ability or money to create those large arrays.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe original plan was to wait until he reached the Xiantian realm to begin studying the formation array memories again, but now, after having seen the Thunderbolt Devilfire Bead, Lin Ming found something that surprised him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So an array formation can also be used like this…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming muttered as he looked at the Thunderbolt Devilfire Bead.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe understood that this Thunderbolt Devilfire Bead was, in essence, a highly compressed thunder fire killing array.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had originally thought that an array formation had to be arranged in a large manner, and it could only be used passively. A person had to step inside the array formation before it could display its surpassing might.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven the memories of array formation from the mighty elder from the Realm of the Gods were also like this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat mighty elder knew many different varieties of complex array formations. If they had to be classified, they would be imprisoning arrays, killing arrays, illusory arrays, sealing arrays, and so forth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe function of an imprisoning array was to trap the enemy within, a killing array was to kill an enemy, an illusory magic array was to let an enemy be lost in an endless dreamland so they could never awaken or to ruin their mental state, and a sealing array was to make seals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming never knew that an array formation could be condensed into such a small bead, and then thrown at others to attack them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf the bead contained a killing array, it could kill people. If it contained an illusory array, it would cause the other party to be swarmed by countless phantasmal illusions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDuring a battle, even if there was a great disparity in strength between two parties, if the weaker one were to throw a powerful bead like this, then they would likely change the tide of battle!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What an imaginative idea!” As Lin Ming studied the array formations within the bead, he couldn’t help but praise the Seven Profound Valleys.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seven Profound Valleys had a legacy that dated back 600 years. The sect was founded by seven individuals, each with various abilities and strengths, including one that especially studied array formations.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, it was not necessarily only the Seven Profound Valleys that had invented this ingenious method; it was likely that this was spread throughout the entire Sky Spill Continent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was the first time that Lin Ming had discovered something that was not found within the Realm of the Gods.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Any plane cannot be underestimated, even if they have a short history. After all, in these tens of thousands of years, who knows how many geniuses have emerged!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“But of course, this bead is not necessarily something that cannot be found in the Realm of the Gods. It was very possible that the mighty elder array master hadn’t learned it yet.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Realm of the Gods was incomparably vast, and its legacies and inheritances were countless; not learning some things was inevitable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause of this bead, Lin Ming began to carefully fuse with the array formation memories from that elder array master. This integration took the entire evening and even lasted until late into the next morning. It was only then that Lin Ming finally sorted out all the detailed information.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So that’s how it is. In this bead, fire and thunder are kept apart from each other. If they were primed with a bit of true essence, the fire and thunder would intersect, and it would explode. If someone doesn’t understand how to use this, it is very likely they would just blow themselves up!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The energy contained in this tiny bead is extremely potent. If it were to explode next to an early Pulse Condensation Period martial artist, they would die!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No wonder Ouyang Dihua gave me a strange look when I picked up this bead. He was looking forward to me killing myself in the explosion.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the fusion of the memories, Lin Ming had become completely clear on the roles and functions of the different symbols in the bead’s array formation. He even had a degree of certainty that he could produce a replica Thunderbolt Devilfire Bead. Of course, the one he produced would have a much weaker effect; at most it could deal with a Viscera Training stage martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘The complexity of an array formation is much higher than that of inscription symbols. If I want to reach some achievements in array formation and produce a bead that has attack power higher than my own, then I will have to put in an extensive amount of time and energy. Right now I’m low on time, so I’ll have to leave this array formation for later.’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough he was envious of the power of the different possible beads, these things still could not directly increase his strength. Since he needed to spend an overwhelming amount of time to study the intricacies, Lin Ming had delayed this for now.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter a long period of research, Lin Ming even found some ways to improve the Thunderbolt Devilfire bead, and could even enhance the power of the Thunderbolt Devilfire Bead by several tenths. Of course, to complete this sort of improvement required that he had a foundation array formation technique that was high enough. At present, Lin Ming was unable to complete this task.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe used an entire night to study the Thunderbolt Devilfire Bead. Although he didn’t have any substantial gains, the bead had given Lin Ming a great inspiration, and let him see another way to enhance his combat effectiveness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, the most fundamental way to enhance one’s own combat prowess was to look at oneself!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe first thing Lin Ming had to do now was to consolidate his Altering Muscle cultivation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlso, he had to create an inscription symbol for the Heavy Profound Soft Spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEarly on, Lin Ming had already selected a suitable inscription symbol. This inscription symbol technique had one character – ‘Astral’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ‘Astral’ inscription symbol did not have any attribute, but it was able to increase the efficiency of true essence by a mind boggling 50%, while simultaneously have a special skill of inscription – ‘Astral Spear’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe reason this skill of inscription was special was because it did not increase the combat strength of a weapon. Instead, it extended a weapon’s range of attack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter one activated ‘Astral Spear’, true essence would enter and become part of the spear. Theoretically, as long as a martial artist’s true essence was powerful enough, the spear could be infinitely extended!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe value of the rare materials required for this inscription symbol was steep. Although it was much easier than looking for those needed in the body inscription symbols, it was not so easy to collect them in a short time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming prepared a list of required materials and sent them to the Inscription Association. He would use his usual method, and trade rare materials for an inscription symbol. Those who wanted one of his inscription symbols would have to bring a rare and precious material that he needed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…………………………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSky Fortune City, Allied Trade Association –\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Guanyu had been lying comatose on the bed for an entire day and night. His face was pale white like funeral paper, and his right hand had been amputated from the wrist down. Unless he managed to find a miracle treasure that could regenerate a limb, he was destined to be forever crippled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt Zhang Guanyu’s side were six maids carefully taking care of him. Suddenly, Zhang Guanyu’s eyelids moved.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Young Master has awakened!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe maids saw Zhang Guanyu wake up, and immediately went to inform the masters. Soon, a very well maintained lady was heard trotting into the room. As she saw Zhang Guanyu’s miserable appearance, she broke down, and her tears were like a line of beads that rolled down her cheeks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis lady was Zhang Guanyu’s mother and also Zhang Fengxian’s wife. As the first lady of the Allied Trade Association, she was an extremely cruel and vicious individual. As the saying went; like mother, like son. Zhang Guanyu’s perverse and demented personality was largely inherited from his mother.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My son!” The lady tearfully wailed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed as if Zhang Guanyu had not even heard his mother’s mournful cries. He looked at his right arm’s amputated hand and his lips sorrowfully trembled. His hand was gone!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“My hand!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Guanyu’s anger filled every fiber of his being, and he spat out a mouthful of fresh blood. As an extremely arrogant person, if he suffered such a major blow, it was easy for him to fly into a rage from the psychological damage. It was possible he might even go mad or berserk.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No! There is still hope! I can cultivate the ‘Divine Acacia Power’ to the eighth layer or find some medicine that can regenerate limbs! There is still hope!” Zhang Guanyu madly clenched his teeth together and began to revolve the ‘Divine Acacia Power’. The legends said that if one cultivated the ‘Divine Acacia Power’ to the fabled eighth layer, it was even possible for dismembered limbs to be reborn!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut as he began to exercise his power, he only felt as if there were countless needles stabbing through his body!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs soon as he looked within himself, he found his meridians…his meridians had all been torn to shreds!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No!!!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Guanyu let out a roar, his vision went dark, and he immediately fainted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Zhang Guanyu fell into a coma again, his mother and the several maids were all thrown into immediate confusion. Ouyang Dihua was standing outside, and his look was gloomy throughout all of this. He understood; Zhang Guanyu was now crippled for life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow that Zhang Guanyu was crippled trash, half the plans that he came to the Sky Fortune Kingdom for were ruined!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was now impossible to collect the 12 Pure Yin girls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was the Allied Trade Association that handled to purchasing and selling of maids throughout the various countries. They were the only ones who could cobble together 12 Pure Yin girls with the correct horoscope.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Dihua clenched his fist. All of this was thanks to Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNot only did Lin Ming wreck his own good plans, but he had also ruined what face he had in front of everyone, ignored his commands, and had severely wounded Zhang Guanyu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd what was most shameful was that he had not been able to strike Lin Ming, and his oppressive aura had no effect on him…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was no way he could endure this insult.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming… I will definitely kill you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-154\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-156\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-155","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
