{"id":54103,"no":158,"title":"Chapter 157 - Flame Essence","content":"\u003cp\u003e\u003cstrong\u003eChapter 157 – Flame Essence\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould this be…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming tried to introduce another wisp of lava fire into his heart, and coincidently, the result was that the second wisp of lava fire was also devoured by the Heretical God Seed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis time, Lin Ming had a vague understanding of the principle. The function of the Heretical God Seed was to gather energy, and to compress true essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLava fire was also one kind of energy, thus it was directly eaten up by the Heretical God Seed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming cautiously probed with his soul force and found that after swallowing the two wisps of lava fire, the Heretical God Seed seemed to breathe. This breath was very weak, almost imperceptible, but it seemed as if… because of this breath, the Heretical God Seed had grown a little bit!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith this, Lin Ming was pleasantly surprised.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe didn’t think that he would inadvertently find a way to cultivate the Heretical God Seed. \u0026nbsp;However, if this growth was sustained, what kind of changes would occur?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis question caused Lin Ming to feel somewhat worried.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAccording to the memories of the mighty elder, he had found the ‘Heretical God Force’ skill manual within a long lost ancient ruin in the Realm of the Gods. There was a very high possibility that this secret skill was the last vestige left behind by an evil god.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the mighty elder had discovered the ‘Heretical God Force’, it had already been sealed away for tens of thousands of years!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the mighty elder has obtained this mystical technique, he had scrupulously hidden it away, and had not even revealed the slightest hint of this secret. The ‘Heretical God Force’ was absolutely unique within the entirety of the Realm of the Gods; only that mighty elder had knowledge of it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat was why that mighty elder had believed that the ‘Heretical God Force’ was the most precious amongst all of the arcane and mystical skills within the Realm of the Gods. Even the ‘Golden Roc Shattering the Void’ was less precious!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, that mighty elder had merely cultivated the ‘Heretical God Force’ to the third layer, and then he had followed Tian Mingzi to the Verdant Feather Sacred Lands to steal the Divine Crystal Magic Cube. Ultimately, not only did he not manage to obtain the Magic Cube, but he had lost his life in the process, and his soul was twisted and broken into pieces, then sealed into the Magic Cube.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the time that the mighty elder had found the ‘Heretical God Force’ to the time that he died, it had only been a dozen or so years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn those years, that mighty elder had been cultivating the ‘Heretical God Force’ as some sort of supplementary secret skill; he hadn’t discerned the vast mysteries of the Heretical God Seed. He didn’t know that the Heretical God Seed could do something like swallow lava fire, nor was that something he had ever thought of.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf it wasn’t for a lucky break, it would have been impossible for even Lin Ming to imagine that the Heretical God Seed had such a mysterious function like this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Heretical God Seed continuously devoured the lava fire. At the start, Lin Ming only introduced a small amount of lava fire into his heart, and then he began to send a colossal amount. The Heretical God Seed didn’t reject any, it welcomed the burning flames with open arms.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe lava fire was oppressive and tyrannical, but the Heretical God Seed was even more domineering. However much the fire lava tried to struggle, it could not escape the true essence shackles of the Heretical God Seed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Heretical God Seed fused with the lava fire for 5 to 6 hours. Lin Ming didn’t know how much lava fire had been devoured, but he had a faint feeling that the surrounding magma temperature had dropped.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Heretical God Seed engulfed the lava fire, it began to slowly grow. At the start, it had been the size of a grain of rice, but now it become the size of a mung bean.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGradually, a deep crimson wisp of a flame began to float around the Heretical God Seed. The Heretical God Seed bathed in the flame, and was suffused with a ruby-red light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA small spark emerged from the side of the Heretical God Seed, it began to circle around it. If Lin Ming hadn’t been looking carefully, it would simply have gone unnoticed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is… Flame Essence?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was shocked. The fires of the world had a soul. As long as this fire was able to exist for a long time in a remote place, it was possible that it would give birth to Flame Essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor instance, in the deepest pits of an underground magma pool, Flame Essence could be born. Or, in a location where Yin and Yang intersected, Frostfire Essence could be born.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe difference between normal fire and Flame Essence was that normal fire had to have materials to combust, or else it would be extinguished. However, Flame Essence was eternal. It could even be used as kindling to create storms of flame that could burn down a forest. No matter how much fire was created, the Flame Essence would not weaken.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was why some alchemists and refiners would travel the world to the most remote, savage, and dangerous dungeons in order to seek out a Flame Essence. They would devote all of their efforts to subdue it for their own use.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had never thought that a Flame Essence would actually be born from his own heart. Of course, this Flame Essence seemed to the weakest Flame Essence in the entire world. It was only the size of a spark, and it had been bred from low-level fire lava. He had no idea where he would need to go to find higher-grade flames.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut Lin Ming did not underestimate it. If the Heretical God Seed could unendingly devour more and more exotic flames, would the Fire Essence change along with it?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming continued to stimulate wisps of lava fire into his body to see if the Heretical God Seed would absorb them. But this time Lin Ming found that any new lava fire was only compressed around the Heretical God Seed, and no longer fused into the Flame Essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed as if the Heretical God Seed had already achieved a state of saturation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt might have been because this lava fire was simply too weak, so it couldn’t meet the needs of the Heretical God Seed’s growth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis lava fire that had been compressed was just like the true essence that had been compressed within the Heretical God Seed. Now, the Heretical God Seed contained not only a massive amount of compressed true essence, but also compressed fire lava. It was just like a powder keg that contained a truly terrifying amount of explosive energy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What rich flame energy. But if this energy was released, then…” Lin Ming had a bit of an apprehensive and jumpy feeling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Heretical God Seed could condense energy. Not only did it condense true essence, but it also condensed flames. With so much compressed energy within Lin Ming’s heart, he inevitably felt very wary.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming consoled himself. Since this was an ancient secret technique that was left behind in some ancient ruins within the Realm of the Gods, it was very unlikely to suddenly explode… right?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBy now, Lin Ming had perked up. “If the Heretical God Seed can swallow lava fire, can it also swallow other forms of energy, like… lightning?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow aware of this possibility, Lin Ming had a very odd look on his face. Of the seven major killing arrays, there was also a thunder array; it was Thunder Valley. It he wanted to absorb the power of lightning, then he would have to go there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut… he had already compressed so much fire energy. If he also absorbed the power of lightning, then…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming couldn’t help but gulp. Lightning and fire were both relatively violent and wild energies. If both were combined, then it might even explode. Since the Heretical God Seed was in Lin Ming’s heart, if there was an accident, it wouldn’t even be a joke!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was a bit afraid of this possibility. But he could not resist the temptation of this idea.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis formidable and mysterious secret technique was unique within the entirety of the Realm of the Gods!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMoreover, this secret skill seemed to have unlimited potential. If he could absorb lava fire and condense that into a Flame Essence, then what would happen if he were to absorb lightning?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith such a powerful force placed in front of Lin Ming and within his grasp, how could he not be tempted?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The ‘Heretical God Force’ is a secret skill that was left behind by an ancient evil god, and it has far more functions than the mighty elder from the Realm of the Gods was aware of. It’s a pity that the mighty elder died so quickly, so he hadn’t been able to study it further. Now I have only myself to analyze it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll just try to absorb the energy of lightning while observing with my soul force. If I find that any accident might happen, then I will immediately force out the thunder energy.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough the potential power of the ‘Heretical God Force’ was tempting, if Lin Ming didn’t have his life, then any power would simply be worthless. Thinking this, Lin Ming decided to give Thunder Valley a try.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………………………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Mountain was several hundreds of miles long. It had numerous canyons and dangerously steep peaks. At a distance not too far away from the Seven Profound Martial House, there was a palace made of glazed tiles that was located above such a peak. The palace was not overly large, but it was magnificently build and gilded in pure gold and the finest jade.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was where the current Seven Profound Envoy lived – Seven Profound Palace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, in a secret room within the Seven Profound Palace, Ouyang Dihua was sitting gloomily in a chair. In front of him was a very feminine looking man.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis feminine looking man was the other deputy house master of the Seven Profound Martial House – Bi Luo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBi Luo had long ago once taken Ouyang Boyan as his master, and was considered Ouyang Dihua’s senior apprentice brother. However, Bi Luo’s outwardly feminine appearance was simply too strong. The underlying concepts behind the Acacia Faction’s cultivation methods were to complement their Yang energy with the Yin energy of others; it was most suited for virile and exuberant young men to cultivate. Bi Luo had cultivated this for several years with low results and had only become increasingly like a woman. As for his cultivation, he hadn’t made many great gains in it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfterwards, with no other path left, Bi Luo had withdrawn from the Acacia Faction and joined the Mirage Faction. The Mirage Faction was a strange and mysterious sect of the Seven Profound Valleys. Their founder was a woman, and almost all of their faction disciples were women. They were proficient in all sorts of illusionary powers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Mirage Faction’s cultivation was most suitable for women to cultivate; it was simply impossible for others. Bi Luo had practiced this women’s cultivation method, and it was actually within his element. Now, Bi Luo had reached the middle Houtian realm and also the fourth layer of the ‘Dreamheart Magic’ cultivation method. Every illusion that he created was without the slightest flaw; even a peak Houtian stage master would be hard-pressed to see through it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“For what matter did Junior Apprentice Brother call me today? And you also chose to talk in a secret room?” Not only did Bi Luo have the looks of a woman, but he also spoke with the gentle voice of a woman. Listening to it caused Ouyang Dihua to feel quite uncomfortable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Dihua unconsciously pushed his chair back and opened up some distance between him and Bi Luo. He said, “I called Senior Apprentice Brother here today because I want Senior Apprentice Brother to help me kill a man.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh? Is it Lin Ming?” Bi Luo asked with a faint smile. Although he hadn’t attended the banquet, he knew of the scene in which Ouyang Dihua had admitted defeat to Lin Ming and had lost face. This Lin Ming was not a simple boy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes! Him!” Ouyang Dihua did not hide anything in front of Bi Luo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter that duel at the banquet, Zhang Guanyu had fallen into a coma for one day and one night. When he awoke, all of the meridians throughout his body had been wasted, and he had lost all of his martial arts cultivation. Now, he was nothing more than a bumbling invalid that had lost his mind. Zhang Guanyu had been wasted, and Ouyang Dihua’s hopes of attaining the 12 Pure Ying girls had been wasted along with him. Ouyang Dihua could not forgive Lin Ming because of this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This might be tricky. After all, I am a deputy house master of the Seven Profound Martial House. If news that I killed my own disciple were to leak out, that would just be hard to hear. Not only that, but Lin Ming will soon become a Seven Profound Martial House core disciple. He has status and influence, and Qin Ziya thinks highly of him. If I was to deal with him and this became known, it would be a very serious matter.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough Bi Luo had a certain friendship with Ouyang Dihua, it wasn’t to the point where he would bring a disaster upon himself. He had a poor relationship with Qin Ziya. If Qin Ziya found a chance, he would definitely seize that opportunity to finish him.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-156\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-158\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-157","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
