{"id":53961,"no":16,"title":"Chapter 15 - Overwhelming Symbol","content":"\u003cp\u003e\u003cstrong\u003eChapter 15 Overwhelming Symbol.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eToday, Lin Ming had prepared as well as he possibly could; solely in the tracing of the lines and symbols, he was no less than those lofty masters!\u003c/p\u003e\n\u003cp\u003eManipulating the Sky Wind Grass juice, Lin Ming opened both his hands and a single drop of emerald liquid flew into the air where it steadily remained.\u003c/p\u003e\n\u003cp\u003eLooking at this liquid green pearl, Lin Ming closed his eyes as his hands flashed and\u0026nbsp;formed a series of seals. These movements had long ago been printed in his mind, and along with memories of the soul fragment, these complex signs were as instinctual as breathing.\u003c/p\u003e\n\u003cp\u003eWith a deep breath, Lin Ming began. His ten fingers flowed like a branches in a storm, and they even collided with each other as his speed of seal formation was too fast. His fingers blurred as another drop of liquid from a different material flew into the air. With his soul force at full strength, Lin Ming rapidly formed the beautiful and mysterious inscription symbols. In order to preserve his soul force, Lin Ming had started working on another material before the first had finished!\u003c/p\u003e\n\u003cp\u003eIn this high-intensity and highly complicated plan, Lin Ming’s error rate was low extremely low.\u003c/p\u003e\n\u003cp\u003eWhen the inscription was half finished, Ming began to feel the strain.\u003c/p\u003e\n\u003cp\u003eWhen the inscription was two-thirds complete, Lin Ming felt that his soul force was reaching its end, and he began to revolve the ‘True Primal Chaos Formula.’\u003c/p\u003e\n\u003cp\u003eWith that on his mind, the chance that a problem would arise also increased. Lin Ming clenched his teeth and pressed on. He still had to divide the several materials to use them to draw the final rune.\u003c/p\u003e\n\u003cp\u003e“Sky Worm Silk…has completed!” The tense Lin Ming finally let loose a breath of relief. Sky Worm Silk was what he lacked the most, he could now allow for failure here.\u003c/p\u003e\n\u003cp\u003e“There are five runes…” Lin Ming counted the number in his heart as his soul force reached the limit.\u003c/p\u003e\n\u003cp\u003e‘Four…Three…Two….”\u003c/p\u003e\n\u003cp\u003e“Success!”\u003c/p\u003e\n\u003cp\u003eLin Ming finished the inscription at this moment. The sparkling runes shined and flashed for a brief moment as they coalesced into an inscription the size of a square inch. It hung there suspended in air.\u003c/p\u003e\n\u003cp\u003eLin Ming had almost collapsed, but as he looked at this completed inscription floating in air, he felt nothing but absolute joy! This small inscription was like his precious child; he had spent a month of inhuman suffering and massive amounts of money to raise it up!\u003c/p\u003e\n\u003cp\u003eThe elder had named this inscription the ‘Overwhelming Symbol.’ This title was a tad too vulgar and childish, but stemming from the respect that Lin Ming held for this elder in his heart, he did not change its name. It was the ‘Overwhelming Symbol!’\u003c/p\u003e\n\u003cp\u003eLin Ming had bought fifteen of the cheapest symbol papers at one to two\u0026nbsp;taels of gold per dozen. With just a slight bit of soul force, the ‘Overwhelming Symbol’ fell onto the symbol paper. Gold lines converged to form ancient runes on the symbol paper. The symbol paper truly was plain, and the overall effect made it look bland and unremarkable.\u003c/p\u003e\n\u003cp\u003eAt the last minute of forming the symbol paper, Lin Ming changed the outwards design appearance with his soul force. It resembled a flame pattern.\u003c/p\u003e\n\u003cp\u003eThis kind of design left on the inscription treasures would become a sign. His sign! Many inscription masters had their own personalized designs as a mark of their work.\u003c/p\u003e\n\u003cp\u003eLin Ming decided on\u0026nbsp;flames, as flames represented rebirth into nirvana.\u003c/p\u003e\n\u003cp\u003eCultivating a martial path was a trial by fire. Pain was constant, and danger was ever present. Travelling down this path would burn one into ashes! Only those that have firm hearts and immeasurable wills would be able to be rebirthed through the flames, and become a dragon or phoenix that ascends like a god into the skies!\u003c/p\u003e\n\u003cp\u003eLin Ming carefully received this precious symbol paper. He opened the window and the fresh air and bright sunlight sprinkled down on him and reflected on his bloodshot eyes. He was bone tired with exhaustion and wanted to go to sleep right away, but Lin Ming had an unprecedented sense of satisfaction.\u003c/p\u003e\n\u003cp\u003eTime left before the Seven Profound Martial House’s exam – two months and ten days!\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eIn the past five days Lin Ming had branded his last inscription onto the symbol paper. Thus, all his materials had been thoroughly exhausted. He had managed to altogether create four copies of the ‘Overwhelming Symbol.’\u003c/p\u003e\n\u003cp\u003eLooking at these symbol papers, Lin Ming has an unforgettable sense of achievement. Now he wanted to sell these four symbol papers!\u003c/p\u003e\n\u003cp\u003eAt the last trade fair, Master Baihong’s engraved inscription had sold for 1500 taels of gold. Clearly this was affected by the renown of the inscription master. Lin Ming had not sold any inscriptions before so he was not famous or well known, but he was confident in his work. This inscription came from the Realm of the Gods! Its effect compared to that of Master Baihong’s work was like the Heavens and Earth; there was simply no comparison.\u003c/p\u003e\n\u003cp\u003eIn that elder’s memory, the ‘Overwhelming Symbol’ was merely the most basic inscription, but it was enough to use on a superior piece of equipment, a third grade piece of equipment. If used on lower grade equipment, then the effect would increase by at least sixty percent!\u003c/p\u003e\n\u003cp\u003eNot only that, but the ‘Overwhelming Symbol’ also granted equipment an additional skill!\u003c/p\u003e\n\u003cp\u003eSome top tier inscription techniques can add additional skills to equipment. By concentrating soul force, it was possible to use these skills. They ranged from energy attacks, armor increasing shields, illusionary techniques, to demonic techniques and more!\u003c/p\u003e\n\u003cp\u003eLin Ming’s inscription, if engraved on a weapon, would give that weapon a skill called the ‘instant violent strike.’\u003c/p\u003e\n\u003cp\u003eThe small inscription rune was in fact a complex array. When the user concentrated a massive amount of soul force into the weapon, the inscription would absorb this energy, compress it to the limit, and then instantly erupt! In a close combat battle, this move was truly formidable in its lethality.\u003c/p\u003e\n\u003cp\u003eLin Ming didn’t actually believe his inscription was as amazing as the ones he recounted in the elder’s memories. There was also definitely no way for a piece of equipment to achieve a 60% increase in power at his current level. As for that ‘instant violent strike,’ Lin Mind did not know if it actually would work because the inscription technique was too complex. After making the end product, all those runes and symbols were concentrated in that tiny inscription so it was difficult for even the creator to judge the ability of the end product. There were just too many possible structures, and a corresponding number of possible mistakes. In the worst case scenario the weapon might even blow up! As long as there was the tiniest of problems, the entire inscription would have to be sold at great discount.\u003c/p\u003e\n\u003cp\u003eLin Ming finally had a night of full rest, and slept blissfully until the early morning. His soul force and energy were in peak condition. He asked Lin Xiaodong for some trade fairs and auction house addresses, and then departed with his symbol papers.\u003c/p\u003e\n\u003cp\u003eHe had bought some new clothes included a hooded cape that covered his face. Although the trade fairs and auction houses always had a good reputation for safety, and wouldn’t leak the identity of patrons, it was best to be careful. After all, if the four symbol papers were sold for any high price, then if that person were known, they might rob and kill them for their possessions.\u003c/p\u003e\n\u003cp\u003eLin Ming first went to the official Sky Fortune City Auction Hall. There were many auction halls in Sky Fortune City, and there wasn’t one that stood out among the rest, so he chose one with a slightly better reputation.\u003c/p\u003e\n\u003cp\u003eAs long as these four symbol papers sold, he would be able to purchase the materials for medicine!\u003c/p\u003e\n\u003cp\u003eHowever as Lin Ming approached the auction house, he thought that it was just too simple.\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-14\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-16\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-15","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
