{"id":54124,"no":179,"title":"Chapter 178 .","content":"\u003cp\u003e\u003cstrong\u003eChapter 178 [True Essence Bone Forging!].\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cstrong\u003eChapter 178 – [\u003cspan style\u003d\"color: #ffffff\"\u003eTrue Essence Bone Forging!\u003c/span\u003e]\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eChapter title is a spoiler, highlight it to read it now, or see it at the bottom.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo those living within the Southern Wilderness, the Feather Emperor was the equivalent of a second god; he was only second to the belief in the Sorcerer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were many followers of the faith that stubbornly believed the Feather Emperor hadn’t yet died. Instead, he had soared into the heavens to join the Sorcerer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn Na Yi’s opinion, if even the Feather Emperor could not pass the fifth trial, and the sixth and seventh trials were even more difficult, then they had no value at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWho could possibly overcome them?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…………………………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTime passed one minute and one second at a time. Lin Ming pulled out a true essence stone and revolved the True Primal Chaos Formula to slowly recover his true essence. The power of thunder and flame that he had consumed to use Thunderfire Annihilation was also slowly being restored.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause Lin Ming had an extremely formidable blood vitality, his current ability to recover was far above a normal martial artist. In just half an hour, he had been completely restored to his top condition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Start the fifth trial!” Lin Ming shouted to Yan Mo who had since disappeared.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Good. Then it shall be as you wish. This fifth trial, the Mortal World, has not been passed for 10,000 years!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“10,000 years…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t think this was too unusual. Since nobody had passed the last trial in 6,000 years, then it would be normal if no one passed this trial in the last 10,000 years.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe surrounding space began to darken. Lin Ming arrived at a vast empty space that did not contain a single thing. Underneath him was the endless earth, and above him, the twinkling bright stars shining in the sky. Around Lin Ming, there were 18 shades. These were human martial artists. They wore black clothes, and carried a variety of weapons; there were swords, sabers, spears, staffs, and so on. It could be said that every weapon was collected in these 18 shades.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming noticed the cultivation of these martial artists, his heart suddenly sank. Among these 18 individuals, 12 were at the peak Bone Forging stage, and 6 were at the Pulse Condensation Period!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could he confront this?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was speechless. No wonder no one had passed through this trial in the last 10,000 years!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf the 6 Pulse Condensation Period martial artists, 5 were at the early Pulse Condensation Period, and there was even one at the middle Pulse Condensation Period. Of the 12 peak Bone Forging stage martial artists, every single one of them was a half-step into the Pulse Condensation Period. Each one was much more powerful that the monkey-faced man and bald man!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming could not help but wonder if there could be found a 15 year old youth in the entire Sky Spill Continent that was so abnormal as to be able to defeat 18 of these martial artists at once.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWere there really people that were able to pass this sort of trial?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eListening to Yan Mo, it seemed that 10,000 years ago there really was someone that had passed through this hurdle… simply incredible!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the third to the fourth trial, the difficulty had already dramatically risen by a large amount. If it wasn’t for Thunderfire Annihilation, then it would have been impossible for Lin Ming to break past the fourth trial.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe didn’t expect that in the fifth trial, the difficulty would once again dramatically rise. If it was like this, then how could one possible pass the sixth and seventh trials?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The difficulty of this life and death smelting trial is just too abnormal. Before I entered the life and death smelting trial, I could barely cope with a Pulse Condensation Period martial artist. Now, there are actually 6 of them! And there is even one at the middle Pulse Condensation Period. There are also the 12 Bone Forging stage martial artists to pin me down, they really do think highly of me.” Lin Ming gripped the Heavy Profound Soft Spear horizontally, and let true essence revolve within his entire body. Although he had little hope he could overcome this trial, he would still try to break through with everything he had!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This life and death smelting array is a true killing array. I must be cautious. If I lose, I must give up. Otherwise, if I lose focus, I might really die here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing so many masters on all sides, Lin Ming did not dare to do like before and directly rush into the enemy like a tiger in a flock of sheep. If he did that now, it would simply be suicide.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhoosh!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA martial artist holding a long staff had already attacked Lin Ming. The staff was already sweeping towards Lin Ming’s knees. At the same time, another martial artist armed with a brilliantly snow-white saber stepped forwards. They had already sealed off all of Lin Ming’s possible evasive routes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Golden Roc Shattering the Void!” Lin Ming launched into his movement ability and threaded through the two martial artists’ attacks like a fish. Although he was able to block these two attacks, he dared not fight here, otherwise he could be caught up in the battle and become trapped in the encirclement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis body formed a series of illusory images, his speed reaching an incredible degree. He survived 4 attacks in a row, and then, like a ghost, he appeared behind a martial artist that was using a meteor hammer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe meteor hammer was a rarely used weapon. It was suitable for long-range attacks, but in close combat, it would be constrained and restrict movement. Therefore, Lin Ming had chosen this martial artist as his first target!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Flood Dragon Goes to Sea!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s spear thrust out. The meteor hammer-wielding martial artist was only at the peak Bone Forging stage, but his response was very quick. The martial artist had flicked his hand, and the meteor hammer tied its chain around the Heavy Profound Soft Spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKacha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sturdy chains had already wrapped around the spearpoint of the Heavy Profound Soft Spear, miring it in place.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf Lin Ming’s weapon was even caught for just the time it took for a few blinks, then Lin Ming would face simultaneous attacks from 18 martial artists at once. He could only abandon his weapon, otherwise there was no way he would be able to dodge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, Lin Ming grinned. A thick arc of lightning jumped out and sped down the metal chain towards the meteor hammer-wielding martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eZizizi!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe meteor hammer martial artist was electrocuted by the attack, and his entire body was paralyzed. Lin Ming seized this opportunity, and with one shout, his strength of 10,000 jins erupted at once. His right hand gripped the base of the Heavy Profound Soft Spear, swung the chain open, and thrust a fierce attack towards the meteor hammer martial artist, stabbing his throat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePuff!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOne spear had severed the throat!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHaving killed the peak Bone Forging martial artist in a single stroke, Lin Ming did not dare to pause and pulled out his spear to retreat backwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhiz!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA halberd with the thickness of a baby’s arm slammed into the spot where Lin Ming had just been. A loud explosion occurred, and the rocky ground where he stood had collapsed. This was the attack from the middle Pulse Condensation Period martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming broke out into an anxious cold sweat. This was a true killing array. If he had even been half an eye blink late a moment ago, then he would have already been left with only half his life. The subsequent instant attacks from the other martial artists wouldn’t have even given him the chance to give up within the smelting trial.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut at this moment, Lin Ming suddenly felt an extremely pure and potent heaven and earth origin energy surge into his body. With this heaven and earth origin energy, Lin Ming’s true essence reached a critical point that allowed him to break through the limit and officially step into the peak Altering Muscle stage!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? This Mortal world increases true essence and cultivation?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was overjoyed. Before, in the worlds of Hell, Hungry Ghost, Animals, or even the Witch Slave, none of them were able to directly increase his cultivation. They gave such bonuses like augmenting blood vitality and soul force. Although it would be of great advantage to Lin Ming’s future cultivation efforts, it was not able to greatly boost his immediate combat prowess. Rather than increase his cultivation from one stage to the next, it had been a qualitative change in his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ve only killed one and yet I reached the peak Altering Muscle stage. If I kill them all, then just how far will my power increase?” Lin Ming’s heart rallied with a sharply rising fighting spirit. “I’ll kill the Bone Forging stage ones first, and then those at the Pulse Condensation Period!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter reaching the peak Altering Muscle stage, Lin Ming’s strength had drastically risen, and his speed was also higher. Now, with the power of Golden Roc Shattering the Void at his back, his body was just like a passing ghost; not even the attacks of a Bone Forging stage martial artist could injure him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt could be said that Golden Roc Shattering the Void was the trump card that Lin Ming relied on in this trial. Otherwise, if he fell into an encirclement of martial artists, he would immediately be defeated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause of his extreme agility, Lin Ming launched into pseudo-guerilla warfare, and the debilitating power of thunder attached to his Heavy Profound Soft Spear was the murder weapon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf a martial artist and Lin Ming were similar in strength, then a touch of this electrical force was enough to paralyze them for just a moment. However, in a battle between masters, that moment of paralysis was enough to spell their doom.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePuff!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming swept his spear and took off a Bone Forging stage martial artist’s head. The true essence within his body rose by another level.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The limit of Altering Muscle!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was jubilant. He had only just broken through to the Altering Muscle stage a little more than a month ago, and now he had already taken strides towards the Bone Forging stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut at this moment, Lin Ming suddenly felt as if his entire body had fallen into some quagmire; every movement he took seemed to be affected by some strange invisible traction, slowing him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe turned and saw that the middle Pulse Condensation Period martial artist that wielded a halberd had stuck that halberd into the ground. Thick true essence condensed within his body and unceasingly fluctuated from him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Gravity manipulation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had just thought of this, when the sword wielding Pulse Condensation Period martial artist flashed behind him, sword striking. The deep blue sword wind sliced at Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Damn!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming lifted his spear to block but that sword wind was too relentlessly sharp. Even though some was blocked, some of the sword wind had passed the spear shaft and cut into Lin Ming’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eCha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s upper clothing was torn apart, revealing the Purple Gold Flexible Armor underneath. Potent true essence broke through that flexible armor and mercilessly stabbed at Lin Ming’s organs.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming gave a stuffy cough and was set flying back. He quickly stabilized himself and probed his body, actually taken aback by what he found.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eh? Nothing’s wrong?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough there was a slight aching feeling, his internal organs hadn’t suffered any injury. The defensive power of his body was so incredible that even Lin Ming found it hard to believe. “At the fourth trial when I killed the Witch Slave, its energy truly changed my body in an abnormal manner. That was an attack from a Pulse Condensation Period master. Even if it’s just the sword wind, it should be enough to kill a normal Altering Muscle stage martial artist, yet I was able to resist it and also wasn’t injured.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sword-wielding martial artist was only a puppet that was condensed from heaven and earth origin energy. He did not understand emotions such as surprise. Once he saw that his strike had no effect, he raised his sword to attack again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming would naturally not fight with him. His body flashed as he displayed \u0026nbsp;Golden Roc Shattering the Void. Lin Ming instantly appeared behind two peak Bone Forging stage martial artists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eChi! Chi!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo heads flew! Two martial artists were killed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Lin Ming had reached the limit of Altering Muscle, killing peak Bone Forging martial artists was nothing but an easy task.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo pure energies poured into Lin Ming’s meridians. Lin Ming began to tremble, feeling his entire skeleton go numb as if something had gotten into his bones.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis skeleton had become more dense and resilient.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“True essence enters the bones, Bone Forging stage!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, Lin Ming had officially stepped into the Bone Forging stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIncomparably powerful true essence poured into all of his limbs and bones and spread throughout his body. Lin Ming felt his strength soaring into the sky. He felt as if something had lit within his body, and endless amounts of blood began to surge within him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing that sword-wielding Pulse Condensation Period martial artist send a slash of sword wind at him, Lin Ming let out a shout and thrust out his spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Flow like Silk!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e5000 vibrating true essence threads erupted outwards, each one several times thicker than in the past. In the face of such compelling true essence, that Pulse Condensation Period’s sword wind was torn apart!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"color: #000000\"\u003e\u003cstrong\u003eChapter 178 – True Essence Bone Forging!\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-177\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-179\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-178","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
