{"id":54160,"no":215,"title":"Chapter 214 - Life’s Most Unforgettable Experience","content":"\u003cp\u003e\u003cstrong\u003eChapter 214 Life’s Most Unforgettable Experience.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 214 – Life’s Most Unforgettable Experience\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter listening to Lin Ming, the woman in red closed her eyes as if accepting her inevitable fate. Although she still looked incomparably tranquil, her slender eyelashes were actually gently trembling, as if reflecting the innermost turmoil and tension within her mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, after waiting for a good while, the touch that made her feel so intensely nervous and fearful still hadn’t come. The lady in red opened her eyes in puzzlement, and was surprised to see that Lin Ming’s face was completely flushed red like a tomato, with his hand paused in midair, neither moving forwards or backwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman in red didn’t know whether to laugh or to cry. She asked, “What are you doing?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I….” Lin Ming didn’t feel the least bit emboldened to take action. If it were Qin Xingxuan, Wang Yuhan, or even Bai Jingyun on front of him, then even though he would be a bit embarrassed and apologetic, he would never be so skittish. Instead, this woman currently in front of him was simply far too formidable. It was simply like a beggar that was given a single opportunity to violate and touch a pure jade princess; that tension would still be far less than this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat Lin Ming feared the most was that after he touched her, she would have a secret desire to kill him in order to vent her anger. If this happened, then his death would truly be unjustified.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I want to make everything….clear first….if I place my hand on you and I still can’t take out the Purple Flood Dragon Divine Thunder, then….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I won’t take out my anger on you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Then you….do not kill me afterwards….”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eListening to Lin Ming, the woman in red’s eyes twitched. She snappily retorted, “Why are you so wordy, do you actually want me to make an oath upon my heart of martial arts?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well….there’s no need.” Lin Ming took a deep breath, and slowly placed his hand on the woman in red’s chest. At this moment, his entire palm was covered in sweat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe moment her chest was touched, the woman in red shuddered. Because of Lin Ming’s nervousness and achingly hot palm, there was an extremely unusual sensation on her chest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Good…then, I’ll begin.” Lin Ming gulped a mouthful of saliva. He didn’t dare move his hand, but that soft and supple feeling was simply ecstasy; it was just like a flood that washed through his body, overwhelming him with emotions and causing his mouth to go dry. This was not just because it was his first time coming into such contact with a woman, but also because her identity had brought forth extreme anxiousness and excitement.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s heart of martial arts was very pure and strong. But as soon as it touched upon lust and desire, his talent was nothing extraordinary.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA thick true essence revolved, steadily streaming into the woman in red’s body as he began to absorb the power of thunder. At the same time, the woman in red also revolved her true essence and encircled the Purple Flood Dragon Divine Thunder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the two of them began their tandem attacks, the Purple Flood Dragon Divine Thunder moved in immediate alarm. It began to violently churn, impacting everywhere. For a time, the woman in red’s flame cage began to show cracks throughout.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the next moment, a massive coercive force came crashing down. The Purple Flood Dragon Divine Thunder was enveloped by this suppressive power, and its resistance was suddenly weakened. Shortly after, a powerful suction force appeared, pulling out all of the power of thunder within it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Purple Flood Dragon Divine Thunder began to panic. It manically impacted the flame cage like a crazy beast. The brilliant flames that were struck fiercely shook. The woman in red clenched her teeth, her face flushing red. Crystal beads of sweat began to quietly drip from her hair.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming also clenched his teeth, mustering all of his strength. Because of his excessive focus, he had completely ignored the charming feeling beneath his hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeretical God Force – Open!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming used the final card in his hand. The Heretical God Seed began to fiercely tremble, and suddenly a massive towing force flooded into the woman in red’s body like a rushing tide!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the Heretical God Force had been activated, the pressure on the Purple Flood Dragon Divine Thunder experienced an immediate massive increase!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Heretical God Seed suppressed the Thunder Soul, and the True Dragon bloodline suppressed the soul of the Thunder Flood Dragon!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnder this dual suppression, a deep and abiding fear began to creep out from the depths of the Purple Flood Dragon Divine Thunder’s soul. It snarled as its body grew by several times. The arcs of lightning around it became more violent, issuing forth explosive sounds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Roar!” The Purple Flood Dragon Divine Thunder opened its jaws to desperately bite itself free from the flame cage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKacha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe flame cage was finally cut open.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMeanwhile, a substantial essence of thunder escaped from the broken flame cage. As soon as it touched blood, the blood was turned to ashes!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman in red trembled, a strange red appearing on her face. Obviously, she had suffered an internal injury. She said, “Don’t hurry to deal with the Purple Flood Dragon Divine Thunder. Absorb its power of thunder and weaken it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming clenched his teeth and nodded, following the directions of the woman in red. Without even realizing it, his right hand had tightly clamped down. The woman in red only felt that her left breast was being completely grasped within Lin Ming’s scalding hot palm. This feeling made her feel anxious and a bit ashamed, but at such a juncture, she chose to completely ignore this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Purple Flood Dragon Divine Thunder began to rampage in a wild rage; the power of thunder unceasingly emitted from its body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough a Thunder Soul wouldn’t die out, it still needed to be supplemented by heaven and earth origin energy. Otherwise, it would weaken. If it lost too much power of thunder, it would also lose its strength, thus allowing it to be suppressed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCompared to the fire true essence that the woman in red issued forth, this strong coercive pressure, that is sucking out its power, was the Purple Flood Dragon Divine Thunder’s greatest threat. Yet, it was unable to resist this force.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the power of thunder was dragged out, the entire cave began to shine as crackling arcs of lightning and electricity sizzled the air. The heaven and earth origin energy in the surrounding space had also been stirred up. It gathered around Lin Ming and the woman in red, constantly swirling around him, until it formed a rainbow vortex that swallowed them within.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m at my limit….” Lin Ming said as he grit his teeth, his entire face dripping with sweat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman in red flicked her finger, and a deep crimson pill flew into Lin Ming’s mouth. As the pill dissolved within Lin Ming’s body, it transformed into a flow of heat that spread through all of his meridians. Lin Ming felt his nearly depleted true essence reserves come back to life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is a Bloodstone Pill refined from Bloodstone Milk; it is able to instantly recover true essence. When you are about to reach the limit of your true essence, quickly tell me,” The woman in red instructed. \u0026nbsp;Still, she was surprised by Lin Ming’s endurance so far; this was equal to that of a Xiantian realm powerhouse, yet Lin Ming was only a mere Bone Forging martial artist. The fact that he could persist for almost an incense stick of time before he reached his limit…this was simply too impressive.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, even though the problem of sustaining his true essence reserve had been resolved, Lin Ming encountered another obstacle. Because he was constantly absorbing the power of thunder from the Purple Flood Dragon Divine Thunder, Lin Ming had accumulated a massive amount of thunder energy within his body. Despite having the Heretical God Seed compressing it, there wasn’t enough time; it was to the extent that his meridians were on the verge of exploding.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Use the Magnetic Birth Stone!” The woman in red said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm!” Lin Ming clenched his teeth and pulled out the Magnetic Birth Stone. He reversed his true essence, sending the compressed stream of thunder power flowing into the Magnetic Birth Stone. The power of thunder disappeared inside as if it were a drop in an ocean, never to be found again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this world, everything had a counter. The Magnetic Birth Stone was truly the most splendid and perfect vessel for the power of thunder. Moreover, because it had been born together with the Purple Flood Dragon Divine Thunder, there was no risk of resistance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTime passed slowly. A quarter of an hour, half an hour, one hour. In that time, Lin Ming had eaten up 10 Bloodstone Pills, and all of his clothes were drenched in sweat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman in red was also in a similar situation. Because her sweat had soaked into her clothes, her clothes had directly pasted onto her body, outlining and accentuating her mesmerizing curves.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Magnetic Birth Stone absorbed the power of thunder, and Lin Ming’s true essence was constantly restored by the Bloodstone Pills. Under this battle of attrition, the purple Flood Dragon Divine Thunder became increasingly smaller. It’s purple body became less and less. It gradually became unable to withstand the coercive suction power of the Heretical God Seed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Now’s the chance!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, Lin Ming’s eyes flashed, and a deep bass roar resonated from him. But, this deep roar did not come from his throat, but emerged from the vibration of his entire body. It was just like the resounding cry of a dragon!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter this roar, not only was the Purple Flood Dragon Divine Thunder struck with awe, but even the woman in red’s heart experienced an earthquake. In absolute disbelief, she sent an incredulous look towards Lin Ming. In that brief moment, she had clearly felt a deep fear that emanated from the depths of her bloodline. It had to be known that in her body flowed the blood of the proud Vermillion Bird!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could this be?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now she had no time to reflect on the reasons; this was the critical moment in healing her wound. Lin Ming tightly clenched his teeth, and true essence erupted from his entire body. The suction force was pushed to the extreme!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eChi chi chi!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a blinding flash of electric light, the Purple Flood Dragon was abruptly pulled out from the woman in red’s body! Half of the Flood Dragon was now exposed to the outside.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hah!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs it appeared, a savage and violent fiery thunder scattered everywhere. It ignited the woman in red’s clothes, and even Lin Ming’s sleeves began to burn.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe thunder fire’s temperature was too high; any clothes it touched was instantly turned to ashes. Even Lin Ming’s right hand which was protected by true essence was burned!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTrue essence swirled in the air, forming a tornado with the heaven and earth origin energy. In that vortex, all clothes were turned to ashes and blown away, leaving the two people inside suddenly stark naked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman in red’s face instantly turned crimson.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough her left breast had been grabbed by Lin Ming, at least there had still been clothes separating them. Now, even the last leaf was pulled away. Her beautiful breast that had never been touched before was actually solidly gripped by a boy. But, this was the most critical time. She could not stop, otherwise all her efforts would have been for naught!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hurry! Faster!” The woman in red had never received such humiliation before. Most of the time, one’s temperament was maintained by one’s clothing. When a woman\u0026nbsp;became naked, no matter how elegant she\u0026nbsp;was, she\u0026nbsp;would lose all her calm and composure, exposing her most vulnerable and helpless side.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen had Lin Ming seen such a glorious spring scene before? He only saw a beautifully ripe white image in front of him, the heaving of an extremely attractive curved body, and two suffocatingly bright red circles. All in all, he began to pant as his mouth became dry. However, in this moment of blissful surprise, the Purple Flood Dragon Divine Thunder which he had pulled out with so much effort, had almost slipped back in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What are you doing!?!?” The woman in red screamed. She had always maintained a graceful and regal temperament, yet, now that she had been reduced to such a state, this young boy had actually been distracted and the Purple Flood Dragon Divine Thunder had almost drawn back in. If all her efforts were wasted because of this, then she really might have been driven\u0026nbsp;crazy!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“S-sorry!!!” Lin Ming incoherently stammered. He hurriedly ate a Bloodstone Pill again. This time, he dared not think of anything else, investing his full concentration into extracting the Purple Flood Dragon Divine Thunder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut this Purple Flood Dragon Divine Thunder was incomparably tenacious. As it saw that half of its body had been pulled out and the other half was about to be, it waged a mighty struggle against Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was no way that Lin Ming was able to let go; he kept grasping on to the woman in red’s breast.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing the Purple Flood Dragon Divine Thunder pulled back and forth, the woman in red was anxious to the point of tears. At this time, the turmoil that passed within her innermost feelings in these few seconds could take years to describe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was absolutely her life’s most unforgettable experience.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-213\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-215\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-214","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
