{"id":56222,"no":2277,"title":"Afterword","content":"\u003cp\u003eA message from Hyorinmaru:\u003c/p\u003e\n\u003cp\u003eMartial World has finally ended! I would like to thank all the Linmaniacs out there for supporting our efforts for such a long time and also venturing through the 33 Heavens and Dark Abyss with us and Lin Ming. It has been a great adventure, but though this one has ended a new one will surely begin.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; float: none; font-family: Arial, Helvetica, sans-serif; display: inline !important;\"\u003eA message from Jaspaaar:\u0026nbsp;\u003c/span\u003e\u003cspan style\u003d\"font-family: Arial,Helvetica,sans-serif;\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0);\"\u003e\u003cbr\u003e\u003cbr\u003e\u003c/span\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; float: none; display: inline !important;\"\u003eHere we are at last, after over three years of work! It\u0027s going to feel really odd to no longer be reading about Lin Ming\u0027s journey as part of my daily routine, but I hope you\u0027ve enjoyed it as much as I have. It\u0027s amazing to look back at those early chapters and realise how far we\u0027ve come. I\u0027d like to thank Hyorinmaru for bearing with me all this time, as well as all of you for making this translation possible! And, if any of you are still here, a special thanks to our original readers from back on our Wordpress blog. Reading all of your comments each day and talking to you guys was so much fun, and helped motivate us to continue. And I mustn\u0027t forget all of the people who\u0027ve spotted errors I\u0027ve missed – thank you! If you\u0027ve got questions for me or anything to say, you can always reach me directly via the Wuxiaworld Discord server (linked to right at the bottom of the page). Please continue to support us in our next project!\u003c/span\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIf interested, please join us in our upcoming new novel translation project, Martial Star Ocean!\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-2255\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-2256","bookId":1508,"creation":"Sep 10, 2019 5:41:22 AM","modification":"Sep 10, 2019 5:41:22 AM"}
