{"id":54224,"no":279,"title":"Chapter 278 - The Outcome is Clear","content":"\u003cp\u003e\u003cstrong\u003eChapter 278 The Outcome is Clear.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 278 – The Outcome is Clear\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe power of fire was continually being absorbed by the Heretical God Seed. The azure true essence within Lin Ming’s body was kindled; the power of flame that flowed through his meridians created a very strong painfully burning sensation. However, it was only a burning pain. With the endlessly growing azure true essence protecting his meridians, they were incomparably tenacious, to the point where the power of fire couldn’t damage them at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt first, Lin Ming had absorbed the Purple Flood Dragon Divine Thunder with the help of Mu Qianyu and the Magnetic Birthstone. However, that was a low-grade earth-step Thunder Soul. In the face of this medium-grade human-step Flame Essence, Lin Ming was completely able to independently deal with it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, Lin Ming was only planning on absorbing a little bit of the Abyssal Flames. There was no way that Lin Ming would actually try to take the Flame Essence within Huo Yanluo’s body, that was equal to creating a deadly blood feud with the Seven Profound Valleys’ Refiner\u0026nbsp;Faction. Even if he had the backing of Mu Qinghong, there was no way he would do something so malicious and stupid.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFlame Essences were eternal, never extinguishing. Even if Lin Ming pulled out a large amount of the power of fire, a Flame Essence would only need a bit of supplemental material and energy in order to restore to its peak condition. The Seven Profound Valleys had accumulated countless resources from plundering the nearby lands, so using some materials to nourish a Flame Essence was just a drop in the proverbial bucket.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter ten breaths of time, Lin Ming’s spear was still stabbed into the Abyssal Flame’s fire dragon, he hadn’t even taken a single step back. During this time period, Huo Yanluo had gone all out and dumped as much true essence as he could into his Flame Essence. He had even used all of his power that was born from desperation, but none of it was able to move Lin Ming even a bit!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Yanluo’s complexion became increasingly ugly. He was simply unable to accept that this was happening to him. Although he acknowledged that he had a high chance of losing to Lin Ming, he thought that Lin Ming would rely on his speed to avoid the Abyssal Flames, and then close in on him to defeat him with a spear.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe could barely accept that result. After all, Huo Yanluo understood that without the Flame Essence, his own individual strength wasn’t any better than Fang Qi’s.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, he never thought that in the face of his Flame Essence, Lin Ming wouldn’t dodge or evade, instead he just used his long spear to block. Not only that, but he had already blocked for over ten breaths of time!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Yanluo poured his true essence into the Flame Essence as if he had unlimited amounts. After a while, he had already consumed 40% of his true essence, but Lin Ming still appeared like a mountain, unshakeable and immovable!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘This is impossible! This is a medium-grade human-step Abyssal Flame! My fire origin energy\u0026nbsp;is at a sixth-grade fusion! I used a massive amount of Glacial Ice Divine Spring waters, and rested on a Polar Jade Bed, and even then I was just barely able to absorb this Flame Essence with my father’s help, and yet this fellow is blocking it with his spear!’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Yanluo’s heart was filled with a sense of fading decline. It was just like a checkers master playing chess against a chess master. The checkers master would eventually lose to the chess master in a disastrous defeat, and even the game was lost!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat could be more damaging to his self-confidence then this?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the Grand Hall, the Refiner Faction Sovereign Huo Xuan had an extremely ugly complexion. Huo Yanluo was his son, and also an outstanding natural talent. It could be said that he hadn’t hesitated at all to dump all the resources he could into his child.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the investment of so many resources, he had expected Huo Yanluo to shine like a rising star at this Total Faction Martial Meeting. He hadn’t expected that in front of Lin Ming, his son would just be like a child facing an adult, unable to muster any power to resist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming’s body… there’s something special about it?” Shi Zongtian felt that as power of fire from the Abyssal Flame continually flowed into Lin Ming’s body, it disappeared without a trace, as if it had gone into another dimension. Was this because of his azure true essence?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he spoke, he couldn’t help but glance at Mu Qinghong to see if he could glean anything from her expression. In Shi Zongtian’s mind, Mu Qinghong had a much more thorough understanding of Lin Ming than he did.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, he found that Mu Qinghong’s expression was a bit incredible – it seemed that she was also puzzled by this scene on the martial stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShi Zongtian’s heart suddenly felt balanced and better.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Huoo — !”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment onstage, Huo Yanluo finally stopped his ludicrous attack. He cut off his true essence, and the Abyssal Flames immediately extinguished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, all of the tiles under Lin Ming’s feet had melted into a dark red magma, except for the parts that had been protected by his true essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I… I admit defeat!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Yanluo clenched his teeth and he slowly spat out these words. In the Seven Profound Valleys, all of the direct disciples had a haughty pride bred into their bones, it was their way of living. And yet, Huo Lanyuo had lost this match just too miserably. It was hard for him to immediately accept defeat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well fought.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming examined himself. The Heretical God Seed’s Flame Essence hadn’t grown by much. Although the Abyssal Flame’s grade was very high, in the end it was just the power of fire, it had a limited effect on raising a Flame Essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the reason that Lin Ming chose to confront the Abyssal Flames head on was not just to absorb the power of fire and help build of up Flame Essence, but to verify an important matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen Lin Ming was in the Southern Wilderness, he had encountered the Fire Worm Tribe’s Shaman. Because the difference between their strength was too great, he hadn’t even been able to absorb the Shaman’s fire attacks – even resisting them had been extremely difficult.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now that his own strength had risen, he wanted to verify at just what degree would his Heretical God Seed be able to suppress the power of fire.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘The Fire Worm Shaman’s Eternal Flame Flame Essence grade is almost the exact same as Huo Yanluo’s Abyssal Flame Flame Essence. Since I can defend against Huo Yanluo’s attacks, I should be able to defend against the Fire Worm Shaman, and not be like before where I didn’t even have the power to strike back. After this Total Faction Martial Meeting, I will return to the Southern Wilderness and bring an end to this grudge!’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen he was at Blackwater Swamp, Lin Ming had almost died by the hands of the Fire Worm Shaman. It simply wasn’t his style to not take revenge for a deep grudge. Not to mention that the Na sisters also had an eternal enmity with the Fire Worm Shaman for killing their master, and Lin Ming also owed the Na sisters his graciousness. If it wasn’t for them, Lin Ming would never have entered the Sorcerer Pagoda, and would probably have died at Thundercrash Mountain. Just by that alone, the sisters’ enmity was something that he would help with.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, there was also another very important reason which was the Fire Worm Tribe’s Eternal Flame. In Lin Ming’s Heretical God Seed, the Thunder Soul had already taken form, but in comparison, the Flame Essence was small and incomparably weak. If he were to obtain this Eternal Flame, his strength would rise by miles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Whether it is the Fire Worm Tribe or Fire Worm Shaman, they have slaughtered countless innocents and committed sins of every nature. To get rid of such a person is already enforcing righteous justice on behalf of the heavens!’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming decided that after this Martial Meeting, he would first go to Huoluo Nation’s Seraphic Pond and immerse his body in the Seraphic Pond waters to consolidate his strength. Afterwards, he would return to the Southern Wilderness and look for the Fire Worm Shaman to settle their debts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming walked off of the stage, he heard a series of delighted cheers coming from the audience.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Junior-apprentice Brother Lin, you were terrific, awesome!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Junior-apprentice Brother Lin, you did well!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Junior-apprentice Brother Lin, you are the sexiest guy out there!!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe first few shouts weren’t too strange, but that last ‘Junior-apprentice Brother Lin, you are the sexiest guy out there!!’ was publicly shouted out by a very bold girl in front of everyone. It was an incomparably clear shout that was crisply heard throughout the arena. Lin Ming immediately blushed red from embarrassment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSky Fortune Kingdom was a nation with considerably conservative values. Although Lin Ming had been able to faintly guess that there were several girls that held some feelings towards him, no one had ever said anything. He had especially never experienced such a scene before. He turned around to look, and saw that the one boldly cheering for him was a young girl from the Zither Faction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe clear, sweet cheers were obviously done with delight. With such a scene of a beautiful and graceful girl who was crying out to him, Lin Ming was at a temporary loss on how to proceed from here.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the Refiner Faction disciple who was beside her, he had an appearance of a fighting c*ck that had just been defeated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Refiner Faction disciple had just stated equivocally that the chances of Huo Yanluo winning was 50-50, and had even mocked the Zither Faction disciple, saying that Qin Wuxin was inferior to Huo Yanluo. But Qin Wuxin had been able to face Lin Ming for a good period of time. As for Huo Yanluo, he had been defeated in a single move…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis made the Refiner Faction disciple wish he had a hole to crawl into. Of course, the Zither Faction girl could not miss this opportunity to ridicule him. She cheered for Lin Ming at the same time as taunting this Refiner Faction disciple.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnder the cheers of the young Zither Faction girl, Lin Ming awkwardly arrived at the contestant waiting here. He saw Qin Xingxuan walking towards him from the audience stage and asked, “Xingxuan, is there something you want?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm! I thought that you might be a bit hungry because you’ve been cultivating all afternoon, and didn’t have lunch. The next round won’t start for some time, would you like to grab something to eat with me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was surprised, and then he suddenly remembered that Qin Xingxuan had been guarding him and also hadn’t eaten anything. He nodded and said, “Alright, I’m actually really hungry. Guarding me this afternoon must have been very hard on you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It wasn’t too bad.” Qin Xingxuan brightly smiled like a morning sun, and then gently pulled Lin Ming’s sleeve. Although this was only a pulling of a sleeve, to Qin Xingxuan this was a very intimate action.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs she pulled Lin Ming along, Qin Xingxuan turned around to look at the young Zither Faction girl in the audience, an assertive smile on her face…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…………………………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOver half of the matches were now officially finished. The only contestants remaining with complete victories were Lin Ming, Mugu Buyu, Ouyang Ming, and Jiang Baoyun. It could be said that if there wasn’t some catastrophic accident, the top three would come from among them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 13\u003c/span\u003e\u003cspan style\u003d\"\"\u003eth\u003c/span\u003e\u003cspan style\u003d\"\"\u003e round.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Yanzhao against Qin Wuxin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Yanzhao’s Blood Wave Saber’s saber energy was easily scattered by Qin Wuxin’s zither music. Facing Qin Wuxin’s invisible sonic wave attacks, Zhang Yanzhao had no way to sense them and no way to avoid them. He easily lost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFollowing that match closely was Mugu Jirong against Jiang Lanjian. The result of this match was easily predictable too. Jiang Lanjian’s sword was too quick, and victory was decided in just five moves. In five moves, Jiang Lanjian’s sword had reached Mugu Jirong’s throat, and he hadn’t even used the Concept of Wind. The truth was that besides Lin Ming, Jiang Lanjian hadn’t used the Concept of Wind against anyone else.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e14\u003c/span\u003e\u003cspan style\u003d\"\"\u003eth\u003c/span\u003e\u003cspan style\u003d\"\"\u003e round.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuo Yanluo against Qin Wuxin. The result of this match could easily be imagined facing against Qin Wuxin’s invisible ranged Profound Wind Eight Melodies. Huo Yanluo was overly dependent on the Abyssal Flames and was simply unable to muster any resistance. The final conclusion was that Huo Yanluo’s own strength was limited, and the Abyssal Flame attacks were too plain and straightforward, without the ability to adapt. It was just too easy for someone to close in on him. Of course, a scene akin to when Lin Ming had directly met the flames with his long spear wouldn’t happen again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Wuxin continued her series of victories. During the sixteenth round, she defeated the Mirage Faction’s Huan Xiaodie with overwhelming strength. Although Huan Xiaodie transformed into 108 illusory phantoms, all of them were defeated by Qin Wuxin’s zither music!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe audience thought that the strength difference between the Seven Profound Valleys’ two proud talented ladies wouldn’t be too great – none of them had imagined it would be like this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany people couldn’t help but wonder: if Qin Wuxin hadn’t encountered Lin Ming, just how far could she have gone without losing?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe extent of Lin Ming’s power was just too confusing and complicated. Many people thought that he wouldn’t even necessarily lose to Jiang Baoyun and Mugu Buyu, they even thought he had a chance of ranking first!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battles were becoming increasingly vivid and clear. The top four had already been locked in with Lin Ming, Mugu Buyu, Ouyang Ming, and Jiang Baoyun. Now, the two struggling for fifth were Jiang Lanjian and Qin Wuxin. Both Huo Yanluo and Zhang Yanzhao who had once been favorites for the top five were completely eliminated.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sun gradually set in the west, and finally the matches of the day ended. Tomorrow would be the last day of finals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere would only be 10 rounds, and in those 10 rounds, everything would be revealed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-277\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-279\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-278","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
