{"id":54226,"no":281,"title":"Chapter 280 - Soaring Strength","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 280 – Soaring Strength\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUp until now, Ouyang Ming hadn’t encountered many top masters. He had only faced off against Fang Qi, Mugu Jirong, and Huan Xiaodie. Of these three matches, he had emerged victorious through overwhelming superiority; he hadn’t been forced to show any of his true strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, no one doubted Ouyang Ming’s power. In the last Total Faction Martial Meeting, he had defeated Jiang Baoyun for the first time. He was once considered as the one with the highest chances of becoming the next Martial Meeting champion, but he never imagined that Jiang Baoyun would recover from his loss and become a terrifying presence that occupied the spotlight and suppressed Ouyang Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn comparison to Ouyang Ming who hadn’t faced any great obstacles on his way to a string of complete victories, Lin Ming could be said to have had to overcome one great hardship after another. Now, Lin Ming’s fame was only inferior to Jiang Baoyun and Mugu Buyu, and was tied with Ouyang Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the referee announced the start of the match, the arena began to buzz with excitement. The crowd was neatly divided in half for those who favored Lin Ming and those who favored Ouyang Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany of the Acacia Faction disciples were screaming out cheers for Ouyang Ming. In comparison, the cheers for the visiting Lin Ming were much weaker. Besides the martial artists of the 36 countries cheering for him, there were the young girls of the Zither Faction who had good impressions of him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the martial stage, Ouyang Ming was dressed in complete white, and he held an iron folding fan in his hand. His long black hair was tied back with a silk ribbon, and he looked just like a handsome royal son. From his head to his toes, he had the makings of a jade tree facing the gentle wind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs a disciple of the Acacia Faction, Ouyang Ming naturally had hordes of cawing girls by his side, and groups of wives and concubines. Even so, there were still many young and beautiful girls that threw themselves at him of their own initiative. One reason was because Ouyang Ming’s looks were simply outstanding like a heavenly prince, and the second reason was because of Ouyang Ming’s status as a core disciple. If they could follow by his side, they would be able to obtain more resources and break through to the Pulse Condensation period more easily.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e200 feet away from Ouyang Ming, Lin Ming was standing straight, holding a long silver spear in his hand. His posture was upright and steady. Because Lin Ming had been practicing a Body Transformation cultivation method of the highest rank for the past six months, his body had been maturing at a very high rate. Although he was only 16 years old now, he wasn’t much shorter than the tall and handsome Ouyang Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This boy, I don’t know what the limit of his strength is…” As Ouyang Ming faced Lin Ming, he had a faint feeling in his heart that he wouldn’t be able to win. It was the same feeling as if he was looking at Mugu Buyu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore this point, he never imagined that he would be pressured so much by a disciple from the 36 countries.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was a well-rounded fighter, he was simply versatile in all aspects of combat. Such a person was a very rare existence. Most geniuses had a particular advantage that served as their point of superiority, but they also had a corresponding weakness to go with it. For instance, Qin Wuxin’s attacks were invisible and formless and they were difficult to avoid; but once one was able to close in on her and engage in close-range battle, one would basically have won.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e As for Huo Yanluo and Zhang Yanzhao, those two had an incomparably overwhelming offensive attack power, but their true combat prowess was limited. Once one dodged their attacks, they would easily lose. Even if it was someone like Jiang Lanjian who seemed to be a versatile fighter, he still had weaknesses in his insufficient attack momentum and his weak defensive power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause of the different strengths and weaknesses of geniuses, they would usually serve to restrain each other. As long as they had the same strength and the same talent, victory would be settled by which skills held advantages over others.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut as for Lin Ming, he was simply an all-around combat king. His aura was formidable, and his spear was fierce and sharp. His attacks contained the Concept of Wind, making them incomparably swift. There wasn’t even need to mention his defensive capabilities. He had been able to take Jiang Lanjian’s full attack strike head-on and come out with only a few scratches! In terms of movement speed, his agility was simply like gods and ghosts – there was almost no weakness to him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAgainst a master who didn’t seem to have any weaknesses at all, Ouyang Ming just didn’t know what he could do to win.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the match officially started, Ouyang Ming didn’t bother saying any useless words. He unfolded the iron fan in his hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Absolute Life Purple Flame!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003echi chi\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ sound, a massive purple flame burst out from his iron fan, blazing in the air like an inferno. This purple fire was a much deeper color than the Purple Flame Bone Lance that had been used by Ouyang Zifeng.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eFuu!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe purple inferno fired towards Lin Ming, and a bone chilling energy rolled off in front it. This freezing cold flame was incomparably strange.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAzure true essence erupted forth. Lin Ming took a step forwards and thrust out with his spear. 10,000 vibrating true essence filaments savagely ran out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe purple flames immediately disintegrated; they had been scattered by Flow like Silk.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter reaching the early Pulse Condensation period, combined with the power of the Flow like Silk breakthrough, the strength of Lin Ming’s past vibrating true essence could not compare to its current incarnation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming’s expression suddenly changed for the worse. Although he hadn’t held on to any hope that the purple flames would be able to defeat Lin Ming, he hadn’t thought that Lin Ming would so easily destroy his flames.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Purple Flame Bone Lance!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Scythe of the Death God!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming gave a loud shout, and a purple bone lance made of fire appeared by his side. Compared to Ouyang Zifeng, it was as if Ouyang Ming’s bone lance instantly appeared by his side, shooting forwards without even needing any time to condense his true essence. Not only that, but as he flourished his fan, a purple scythe appeared, flying forwards to cut off Lin Ming’s head!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing this roaring attack, Lin Ming maintained a completely indifferent expression. His feet moved and his speed instantly achieved the limit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA shadow blurred, and Lin Ming broke through a narrow gap between the Purple Flame Bone Lance and Scythe of the Death God. His spear was wreathed in arcs of lightning; it contained the Concept of Wind and power of thunder, thrusting straight towards Ouyang Ming’s side!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming’s heart went cold and he instantly drew back. At the same time, he waved his fan back and forth, and clouds of purple flame seemed to blossom in front of him, forming layers of defensive fire that protected his body!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e10,000 filaments of vibrating azure true essence rampaged out. The thick coils of thunder were just like massive purple snakes that twisted in a frenzy. The purple barriers of flame were only able to resist for a split second before being torn apart by the spear!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing the cold spearpoint come towards him, Ouyang Ming’s pupils contracted. He hadn’t imagined that a casual spear thrust of Lin Ming’s had achieved such a terrifying degree of strength. It had even broken through three of his purple flame cloud shields!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe instantly realized that if he was struck even once by this spear, he would lose without a doubt. When Lin Ming had faced Fang Qi, a single spear of his had broken through five continuous Nine Circles of Blue Light Arrays. Ouyang Ming was confident, but he didn’t believe that the true essence that protected his body was any stronger than five layers of Nine Circles of Blue Light Arrays.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Lin Ming, his attack power was too abnormal!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Butterflies Dance on 100 Flowers!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming’s body instantly turned into a series of shadows, evading the spear by dancing on the edge of destruction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Movement martial skill?” Lin Ming watched as Ouyang Ming flitted around like a butterfly hovering over flowers, his form drifting from end to end. This was obviously an extremely gorgeous and sublime avoidance movement skill. There were over a dozen images that seemed real and fake at the same time; it was impossible for a normal martial artist to distinguish just where Ouyang Ming’s true self was. It was futile to attack, one could only passively leave themselves vulnerable to attack. Not only that, but it was futile to guess just where Ouyang Ming’s attack came from.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, to Lin Ming, none of this was a problem. He simply closed his eyes and let his soul force fuse into the Concept of Wind. Suddenly, Lin Ming’s figure disappeared!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Total Annihilation!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming used the same constant Foundation Spear Technique and swept out into space. But in the moment that Lin Ming swept out with his spear, Ouyang Ming appeared just under the spearhead as if he had ran into it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming’s instantly paled. His Butterflies Dance on 100 Flowers had been seen through in a single try!!??\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time Ouyang Ming could not evade, collision was inevitable. He had to take this attack head-on!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe iron fan opened, and Ouyang Ming cried out, pushing all of the true essence within his body to the limit. A bluish purple evil flame shrieked as it ran out of the iron fan, directly cleaving towards the spearpoint.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe bluish purple evil flame smashed against the purple thunder, the power of thunderbolts exploded out!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the moment that the iron fan struck the spearpoint, Ouyang Ming felt as if he had chopped against a mountain. 10,000 vibrating true essence filaments cascaded forth and an incomparably vast peerless vibration directly cracked apart Ouyang Ming’s grip, causing his right arm to lose all feeling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is…!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming felt as if his chest had been hit by a massive hammer. There was a tangy copper taste in the back of his throat, and Ouyang Ming spat out a mouthful of blood as he flew backwards and struck the martial stage’s protective barrier.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis unexpected result caused the entire audience to pause, slack-jawed. Even Jiang Lanjian who usually highly respected Lin Ming’s abilities was looking at this scene, an extremely incredulous expression coloring his face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming, who had ranked third place during the last Total Faction Martial Meeting was defeated so easily?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe truth was that Jiang Lanjian had expected that Lin Ming would win. However, he thought that the two contestants would have a fierce dogfight where each one would use hidden card after hidden card, finally ending with Lin Ming as victor through a small advantage. He hadn’t expected that Lin Ming would prevail in less than 20 moves.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How did Ouyang Ming lose so easily? Doesn’t he have any more cards in his hands?” Jiang Lanjian just couldn’t believe this. He had also lost to Ouyang Ming during the last Total Faction Martial Meeting, and this time, he didn’t have much confidence that he would be able to defeat Ouyang Ming. However, Lin Ming had actually defeated Ouyang Ming so easily!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJiang Baoyun slowly said, “Ouyang Ming already used the cards in his hands, and that was his Perfect fifth stage of the ‘Divine Acacia Power’. Absolute Life Purple Flame and Scythe of the Death God are both moves that can only be used after reaching the fifth layer of the ‘Divine Acacia Power’. It’s just that they were easily broken by Lin Ming. Many people didn’t see just how strong Ouyang Ming’s attacks were… it’s not that Ouyang Ming is weak, but that Lin Ming is too strong. After breaking through to the Pulse Condensation period, his strength has soared past what it once was!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJiang Baoyun took a deep breath. Normally when a martial artist broke through to the Pulse Condensation period from the peak Bone Forging stage, their strength wouldn’t increase too much.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming wasn’t a normal martial artist. The method in which he reached Pulse Condensation was through a perfect breakthrough, and his foundation was extremely solid. Not only that, but the cultivation method he practiced was the ‘Chaotic Virtues Combat Meridians’. After breaking through each stage, his true essence would grow incomparably thicker and purer than a martial artist at the same stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlso, Lin Ming’s azure true essence, Flow like Silk, and Purple Flood Dragon Divine Thunder were absurdly abnormal and overpowered abilities. If his true essence was twice as strong, then his attack power would be three times, four times, or even five times greater!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSo from the peak Bone Forging stage to the Pulse Condensation period, Lin Ming had experienced a great leap in strength!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ouyang Ming was defeated! Now there are only three people left that still have a flawless winning streak!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Besides Mugu Buyu and Jiang Baoyun, Lin Ming has already fought with most of the other masters, except for Huan Xiaodie and Mugu Jirong. However, those two are not his match. Even if Lin Ming lost to Mugu Buyu and Jiang Baoyun, he would still reach the top three!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe audience discussed the situation of the tournament and the possible outcomes. This dark horse known as Lin Ming was simply too dark. A disciple of the 36 countries had entered the Total Faction Martial Meeting for the first time and had already reached the top three rankings. Moreover, he had just reached 16 years of age. This was simply too shocking for anyone to comprehend.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Lin Ming walked offstage, he saw Mugu Buyu staring at him. Mugu Buyu’s skinny mummy face still had his trademark tricky smile. But as he looked at Lin Ming’s eyes, his eyes no longer held the previous teasing banter and contempt. Instead, there was a solemn, dignified expression.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eClearly, Mugu Buyu finally felt threatened by Lin Ming.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-279\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-281\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-280","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
