{"id":54246,"no":301,"title":"Chapter 300 - Spear Refining Grandmaster","content":"\u003cp\u003e\u003cstrong\u003eChapter 300 Spear Refining Grandmaster.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 300 – Spear Refining Grandmaster\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe truth was that even though Liu Xuan only had a very shallow experience of these materials, Violet Electricity Spirit Bamboo was simply an exceedingly rare treasure. It could only been formed at special locations which had experienced powerful thunder for 10,000 years. The commoners who lived around Thundercrash Mountain in the Southern Wilderness had a much broader knowledge of the Violet Electricity Spirit Bamboo, as they were more closely intertwined with that environment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn addition, Liu Xuan was a refining master whose specialty was forging swords and sabers. He understood almost every kind of top quality metal, but as for bamboo and other types of wood like materials, he almost never used them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, even though Liu Xuan didn’t know much about the Violet Electricity Spirit Bamboo, that didn’t stop him from being able to see the terrifying power of thunder that was emitting from this piece of bamboo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the bamboo appeared, an incomparably rich power of thunder flooded outwards. The flashes of electricity were even enough to force Liu Xuan to subconsciously step backwards, and make all of the hairs on his body stand. This bamboo was still able to cause this effect, even though Liu Xuan was protected by his powerful true essence; obviously the thunder created a very formidable electricity field.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd what startled Liu Xuan was that he was able to see that the power of thunder origin energy of the world was flowing into this stick of bamboo, forming an invisible whirlpool of origin energy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘It can independently absorb thunder origin energy?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was simply incredible. If a thunder-attribute martial artist had this stick of bamboo, then he could continuously absorb thunder origin energy from the world during a battle in order to supplement his own reserves. Not only would his moves be more powerful, but he would have greater endurance in combat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRealizing this, Liu Xuan gulped, his throat twitching. This bamboo was absolutely a treasure material that all thunder-attribute martial artists longed for in their dreams!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong the three present, the one who best understood Thundercrash Mountain was Mu Qianyu. With just a glance, she was able to recognize this piece of Violet Electricity Spirit Bamboo, and was also able to discern just where Lin Ming got it from.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘I didn’t think that the Violet Electricity Spirit Bamboo that has been bred in Thundercrash Mountain for 10,000 years was actually obtained by him. It seems that his little sojourn into the Flood Dragon Cave really had a rich harvest.’ Thinking this, Mu Qianyu grinned as she shook her head. The wealth that the Thunder Flood Dragon had accumulated was actually all plucked away by Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShi Zongtian’s experience couldn’t compare to Mu Qianyu’s. After he saw this Violet Electricity Spirit Bamboo, he pondered for a moment before suddenly remembering that long ago, he had read about this sort of spiritual bamboo in the ancient texts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is Violet Electricity Spirit Bamboo?” Shi Zongtian asked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Violet Electricity Spirit Bamboo grows one inch every 100 years. This piece is nearly 10 feet tall. Is it 10,000 year old Violet Electricity Spirit Bamboo?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Nine feet nine inches, it is 9900 year old Violet Electricity Spirit Bamboo. It also birthed a 900 year old young bamboo shoot that is in my possession.” Lin Ming said, not bothering to conceal anything.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNine feet nine inches was the same length as the Heavy Profound Soft Spear. However, the Heavy Profound Soft Spear’s length also included the spear head.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf one were to forge a spear with the Violet Electricity Spirit Bamboo, it would also have another foot long spearhead. Its final length would be more than 10 feet long. In truth, this was a bit too long.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter hearing Lin Ming’s affirmation, Shi Zongtian sucked in a deep breath of air. This young boy had actually managed to obtain this sort of rare material. Violet Electricity Spirit Bamboo could only be found in lands of thunder. As for lands of thunder, the only place nearby would be Thundercrash Mountain!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was said that a Thunder Flood Dragon lived at the summit of Thundercrash Mountain, with a profoundly deep cultivation. Not only that, but it had the bloodline of a Saint Beast. Its strength was unfathomable. Coupled with the help of the countless Thunder Lizards that lived on Thundercrash Mountain, even the highest elder of the Seven Profound Valleys wouldn’t be able to return unscathed. And Lin Ming was actually able to obtain this Violet Electricity Spirit Bamboo from Thundercrash Mountain?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShi Zongtian found this impossible to imagine. He subconsciously glanced at Mu Qianyu. Did Mu Qianyu help Lin Ming? If so, then Mu Qianyu was simply too good to Lin Ming. Shi Zongtian thought for a moment, and then began to reevaluate the relationship between Mu Qianyu and Lin Ming. Maybe their relationship wasn’t as simple as he had imagined…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven that Thunder Soul might have only been absorbed with help from Mu Qianyu. Otherwise, how could a young boy who didn’t even have a Pulse Condensation cultivation possibly absorb a low-grade earth-step Thunder Soul?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Shi Zongtian thought more and more, he realized that the Seven Profound Valleys wouldn’t be able to retain a talent like Lin Ming. He was simply a dragon with a deep pool, and the waters of the Seven Profound Valleys were too shallow – a True Dragon could not swim in their waters.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlso, Lin Ming didn’t have an average connection to Mu Qianyu. Him joining Divine Phoenix Island was only a matter of time…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking this, Shi Zongtian let out a long breath. Before, he had struggled with his thoughts and decisions. Lin Ming had never been his, and couldn’t be considered as a Seven Profound Valleys disciple from the start.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that case, drawing back and looking at things, befriending such a master was also good.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I would like to use this Violet Electricity Spirit Bamboo to forge a spear!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming solemnly said as he held out the Violet Electricity Spirit Bamboo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLiu Xuan’s eyes jumped as he heard this. Make a spear shaft with this bamboo? This… this was just too shocking an idea. If one could create an earth-step treasure spear, with the added quality from the Violet Electricity Spirit Bamboo of being able to absorb and strengthen the power of thunder, then that spear would be a highest quality weapon for any thunder-attribute martial artist!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Yes! Wasn’t Lin Ming a thunder-attribute martial artist?’ Liu Xuan slapped his forehead, cursing himself for being so stupid. He had actually forgotten that Lin Ming was a thunder-attribute martial artist with an absurdly high thunder origin energy fusion compatibility!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Liu Xuan thought this, his mind began to shiver. This was incredible! Lin Ming was already disgustingly strong to such a degree, but if he also had a top quality thunder spear, he would be even more powerful. With his power unleashed, who among the younger generation could hope to stop him?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo wonder Lin Ming didn’t even spare a glance at the treasures of the Refiner Faction. In comparison to a top quality thunder spear that was made from Violet Electricity Spirit Bamboo, those weapons within the Treasure Pavilion were nothing more than scrap iron!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShi Zongtian’s eyes also jumped. Lin Ming’s strength was just becoming increasingly terrifying. Perhaps in one year, even Peacock Mountain’s Lin Ping might not be his match… it might even be less than a year!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe turned and looked at Liu Xuan, saying, “Liu Xuan, who within the Refiner Faction is best at forging spears?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Liu Xuan heard this question, he suddenly flushed red, looking helpless. Although there really were a few elders within the Refiner Faction who could forge spears, the best they could make were high-grade human-step treasure spears. To let them use the Violet Electricity Spirit Bamboo would simply be a waste.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLiu Xuan still remembered that he had just suspected Lin Ming of not understanding how difficult refining was, and not having any materials to craft an earth-step treasure. But now, Lin Ming had actually put out a more than adequate material, but there wasn’t anyone who could use it. Liu Xuan could only ruefully smile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLiu Xuan helplessly shook his head, looking somewhat embarrassed. He said, “Our Refiner Faction simply cannot forge an earth-step treasure spear… the most we can craft is an earth-step treasure spearhead. For instance, a Cold Star Iron spearhead…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCold Star Iron was a top quality metal material used to make earth-step treasures. The use of Cold Star Iron to create treasures was a very arduous and complicated process, and was also one of the legacy techniques of the Seven Profound Valleys’ Refiner Faction. It was a strictly confidential technique that was absolutely forbidden for outsiders. However, it was also the process they were most proud and confident in, thus Liu Xuan had suggested this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, Liu Xuan didn’t think that Mu Qianyu would shake her head and say, “Cold Star Iron can only create up to a low-grade earth-step treasure, and 10,000 year old Violet Electricity Spirit Bamboo is far beyond that. A spearhead made from Cold Star Iron does not match well with Violet Electricity Spirit Bamboo. Not only that, but if the spearhead is created separately from the spear shaft, then the spear will be unable to merge into one natural whole, and the quality of the end product would suffer greatly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Qianyu calmly spoke a statement of facts. As Liu Xuan heard this, he immediately reddened. He had actually suggested one of his Refiner Faction’s most precious legacy secret techniques, but yet in just a few demeaning words from Mu Qianyu, it had become worthless within her eyes…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe opened his mouth to speak, but couldn’t find the words to refute her. In the end, he didn’t say anything, there was simply nothing he could use as a rebuttal. This was the gap in their sects’ heritages. A dignified top fourth-grade sect would of course look down on their so-called secret technique.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Qianyu said, “Lin Ming, I actually know a spear refining master whose cultivation is at the middle Revolving Core realm. If he can be found, then the full power of the Violet Electricity Spirit Bamboo can be displayed. Of course, this is only if you can afford the other materials that can match the Violet Electricity Spirit Bamboo in order to craft the spearhead.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA middle Revolving Core realm spear refining master?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming heard Mu Qianyu, his heart rate suddenly increased. The Sovereign of the Seven Profound Valleys’ Refiner Faction only had cultivation at the late Xiantian realm. Just from cultivation only, one could imagine how much stronger a spear made by this spear refining master would be.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, thinking that Mu Qianyu also said that he needed to provide materials that matched the Violet Electricity Spirit Bamboo, Lin Ming was somewhat depressed. The value of these materials could be imagined. Even if he put forth all of his possessions, he would not be able to afford it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnless, he reached out his beggar hand towards Mu Qianyu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf Mu Qianyu was willing to pay the price, then she could of course obtain these materials. But, there was no reason that Mu Qianyu would help him for no return.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if he was a genius, he still hadn’t fully matured. There was no reason for Mu Qianyu to repeatedly give out such precious resources to him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one could say what would happen in the future. Also, he wasn’t even a Divine Phoenix Island disciple.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Qianyu saw Lin Ming’s somewhat despondent expression and was able to imagine what he was thinking about. She faintly smiled and asked, “Lin Ming, don’t you want to see this spear refining master?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I would like to, but…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Then come with me.” As Mu Qianyu said this, she clapped her hands, and a strange fluctuation of \u0026nbsp;fire true essence spread from her palms. Soon, a faint phoenix cry resounded, and a giant bird with a 70 foot long wingspan flew down towards the Grand Hall, landing in front of the square.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe bird had the head of a golden pheasant, a long neck like a snake, and feathers that burned like brilliant flames of the sun. This was Mu Qianyu’s life’s Vermillion Bird, Little Flame.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLittle Flame landed on the ground, and an incomparably scorching wave of heat burned the atmosphere. Lin Ming – and even the early Xiantian realm Liu Xuan – couldn’t help but take several steps back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming stimulated the Heretical God Seed within his body, finally able to stand firm against the burning heat waves that emanated from Little Flame. This fellow had evolved?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming remembered that when he first saw Little Flame, Little Flame only had a wingspan of 50 feet. Now, it already had a wingspan of 70 feet, and the fire true essence that percolated around its body seemed much more formidable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, Little Flame proudly stretched back its wings, preening as it raised its phoenix beak in a self-satisfied gesture, demonstrating its noble and elegant bearing. Obviously, it was quite happy seeing the shock in Lin Ming’s eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLittle Flame was naturally able to recognize Lin Ming. Or, it was more accurate to say that Little Flame was able to recognize the barbecue boy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s go.” Mu Qianyu lightly tapped her toes, jumping into the air and falling gently onto Little Flame’s back like a feather. She motioned for Lin Ming to follow her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming paused, he could sit on Little Flame’s back? Would Little Flame let him?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShi Zongtian and Liu Xuan were also incomparably startled. How arrogant and proud was a Saint Beast? Not everyone was qualified to sit on its back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSure enough, Little Flame let out a few discontented chirps. But, it was only a few chirps, it still allowed Lin Ming to climb up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was mainly because it was Mu Qianyu’s order. But Lin Ming’s status as the barbecue boy also played a major role.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming tapped his feet, soaring into the air and steadily falling onto Little Flame’s back. Liu Xuan couldn’t help but swallow a mouthful of saliva as he saw this. As a disciple of the Refining Faction, he was also a fire-attribute martial artist. Seeing Lin Ming being able to ride such a majestic fire-attribute Saint Beast, he could only feel extreme envy in his heart.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-299\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-301\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-300","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
