{"id":53978,"no":33,"title":"Chapter 32 - Oppress with Others’ Power","content":"\u003cp\u003e\u003cstrong\u003eChapter 32 Oppress with Others’ Power.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eZhao Mingshan gaped at Lin Ming. He recalled that Lin Ming had once said the words ‘You want to tie me up, but once you do, there won’t be a good outcome for you.’\u003c/p\u003e\n\u003cp\u003eFaced with such a superior backing, Zhao Mingshan had no choice but to lower his head and play as a dog for this boy. Even though this was a heavy loss of face for him, it was nothing in comparison to keeping his own little life.\u003c/p\u003e\n\u003cp\u003eZhao Mingshan immediately changed his countenance. His whole face locked up with a forced smile as he said, “It appears that we accidently fished out two dragon kings. These two fellow brothers, today was truly just a silly misunderstanding. I hope you can show some mercy and overlook my transgressions. You people, quickly untie these two fellows!”\u003c/p\u003e\n\u003cp\u003eAlthough he hadn’t been untied yet, Lin Xiaodong’s gag cloth was taken out, and he was a bit perplexed. But Lin Ming had given him all sorts of surprises these days, so he adapted quickly.\u003c/p\u003e\n\u003cp\u003eWas it that elusive and mysterious master that Lin Ming had spoken of?\u003c/p\u003e\n\u003cp\u003eTo Lin Xiaodong, such a powerful and mighty being was only a foreign concept to him. But in any case, with someone like that backing them up, he had no need to fear these idiots!\u003c/p\u003e\n\u003cp\u003e“F*ck your whole family, f*ck your mom and your family you little mother fuckers!” Lin Xiaodong let out a string of epithets as the officers struggled to unwind the ropes that bound his large body. They were pushed aside by Lin Xiaodong as he rolled around.\u003c/p\u003e\n\u003cp\u003e“You think that you tie me up and let me go whenever you want?” Lin Xiaodong had originally suffered a loss of face, but now that he had the upper hand, he naturally would return the favor.\u003c/p\u003e\n\u003cp\u003eZhao Mingshan had nothing he could do but to take the words and suffer silently. He smiled and painstakingly said, “Little brothers, I was blind and foolish, would you be merciful and overlook these matters today? I would truly be grateful if you somehow allow us to compensate you…”\u003c/p\u003e\n\u003cp\u003eLin Xiaodong crooked his neck. These officers of the Police Department only had a tiny salary with a bit of gold that they scraped up off the books. Lin Xiaodong did not have a liking for any of this money, so what was the point of offering it to him?\u003c/p\u003e\n\u003cp\u003eAt this time, Lin Xiaodong happened to see Wang Yigao off to the side. He was taking advantage of the distraction to make his escape. Lin Xiaodong angrily said, “Stop! Whose mother said to let that kid go! Return here right now!”\u003c/p\u003e\n\u003cp\u003eWang Yigao nearly fell off of his horse as he heard these words. The turn of events and frightened him silly. His father was waiting for him to return home for punishment, this was an absolute nightmare.\u003c/p\u003e\n\u003cp\u003eNow even seeing Lin Ming made his heart shudder with dread. Forget retaliating, if he ever saw Lin Ming again he would make a full effort to scamper away. Not only did Wang Yigao fear Lin Ming, but he also didn’t know what kind of backing Lin Ming had. Whatever it was, it was greater than anything he could compare with!\u003c/p\u003e\n\u003cp\u003eLosing the only advantage he had, Wang Yigao finally realized he was completely inferior to Lin Ming.\u003c/p\u003e\n\u003cp\u003e“You…what do you want?”\u003c/p\u003e\n\u003cp\u003e“You want to get away? You think there is anything in this whole world that is that easy?” Lin Xiaodong had a sudden inspiration. He turned to several officers. “You there, beat this guy up.”\u003c/p\u003e\n\u003cp\u003eWang Yigao trembled as he heard this. Zhao Mingshan grimaced; now he really didn’t know if he could preserve his own head. If they hit Wang Yigao any more, he really might die.\u003c/p\u003e\n\u003cp\u003eZhao Mingshan looked to Lin Ming with a pleading look.\u003c/p\u003e\n\u003cp\u003eLin Ming finally said, “Consider this finished. There’s no point dealing with this kind of person.”\u003c/p\u003e\n\u003cp\u003eHe looked to Wang Yigao and asked, “I ask you, when you came up to stir trouble, I saw that there were also people spying on me from the blue carriage. Was that Zhu Yan?”\u003c/p\u003e\n\u003cp\u003eWang Yigao felt his stomach fall. Did this man have eyes on the back of his head?\u003c/p\u003e\n\u003cp\u003eHe had already thoroughly feared Lin Ming, but now that fear was deepening as terror filled his eyes.\u003c/p\u003e\n\u003cp\u003eHe still didn’t speak, so Lin Ming took a single step towards him, and coldly said, “Yes, or no?”\u003c/p\u003e\n\u003cp\u003eWang Yigao’s heart stopped and he clenched his teeth. He nodded.\u003c/p\u003e\n\u003cp\u003e“Today’s matter was also thought up by Zhu Yan?”\u003c/p\u003e\n\u003cp\u003eWang Yigao nodded again.\u003c/p\u003e\n\u003cp\u003e“Good. You may go.”\u003c/p\u003e\n\u003cp\u003eLin Ming was already thinking that this was the case. Zhu Yan did not want him to enter the Seven Profound Martial House. Wang Yigao was just a pawn that had been used to prevent him from taking part in the entrance exam; Lin Ming did not want to bother with such a small bit player again. The reason was because Wang Yigao’s father was the general. Lin Ming also knew discretion, and he had already left behind some hidden true essence in him that would leave him confined to his bed for a period.\u003c/p\u003e\n\u003cp\u003eZhao Mingshao breathed a sigh of relief as he heard Lin Ming. He hurried forward to personally untie them.\u003c/p\u003e\n\u003cp\u003eLin Xiaodong flexed his chubby wrists and look at Zhao Mingshan who had jumped off a black maned horse. Lin Xiaodong had a sharp eye for money, and he understood at a glance that this horse was a superior breed. Although they couldn’t compare with the snow white horses of the Martial Quarters, their value was no less than 500 gold taels.\u003c/p\u003e\n\u003cp\u003e“We’re fine, you don’t need to send us off. Leave behind two horses. That black maned horse is also nice. I’ll take it.”\u003c/p\u003e\n\u003cp\u003eZhao Mingshao’s mouth twitched as he heard this. This horse was his beloved and treasured beauty. But he clenched his teeth and said, “If these fellow brothers like my horse, feel free to ride her.”\u003c/p\u003e\n\u003cp\u003e“Haha. Then don’t mind me being impolite.” Lin Xiaodong said. He leapt up and his pudgy body seated on the black maned horse. “Heh heh, let’s go!”\u003c/p\u003e\n\u003cp\u003eAs they left the group, Lin Xiaodong was in an excellent mood. “Sh*t, that was better than getting money! I’ve never felt so great in my life. Not only did that idiot ‘Gao Yiwang’ earn his lesson, but even the captain gave me his own horse. Haha, this is what they call the great life!”\u003c/p\u003e\n\u003cp\u003eLin Ming smiled and said, “We borrowed others’ power and influence today, but anyone can rely on connections to do that. If we really want to feel great, then we must get strong ourselves and depend on our own strength to intimidate the world. Then no one would dare to bother us. That feeling would really be great.”\u003c/p\u003e\n\u003cp\u003e“Intimidate the world? Haha, Brother Lin, I don’t have such grand dreams as you; I’m fine with relying on others’ power and influence. How about this Brother Lin, when one day your name is known across the world, you cover for me. I’ll tell them your name, and frighten them off.”\u003c/p\u003e\n\u003cp\u003e“Okay!” Lin Ming laughed out loud.\u003c/p\u003e\n\u003cp\u003eThe two were originally only brought three or four miles down the road. They galloped on their horses and in a short while arrived back at the square. In the square were still a sea of people; it seemed that the Strength Trial had just begun.\u003c/p\u003e\n\u003cp\u003eLin Ming had forgotten about the blue carriage until now; he noticed that it was still sitting there. But now Zhu Yan had disembarked from it. He was holding onto a long sword while staring an ice cold gaze.\u003c/p\u003e\n\u003cp\u003e“It seems I gave you less credit than was due. You are quite talented.” In a moment, Zhu Yan had transmitted his voice to Lin Ming. They were 200 meters away, but it was as if Zhu Yan was speaking right beside him.\u003c/p\u003e\n\u003cp\u003eThis was a message sent with true essence. It required an extremely high degree of control of true essence to achieve. Zhu Yan must have reached the peak of the Third Stage in the last six months.\u003c/p\u003e\n\u003cp\u003e“Don’t think that just because you reached the Second Stage of Body Transformation that you are anything special. Beating up some useless potatoes that are on the same level as you is no accomplishment at all. You said that one day you would surpass me? Good. I will wait for you. I will let you know the true difference between you and I, and you will learn that you are not destined to be an elite of this world.\u003c/p\u003e\n\u003cp\u003e“An elite of this world?” Lin Ming looked at Zhu Yan and smiled. “Certainly not of this world…”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-31\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-33\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-32","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
