{"id":54281,"no":336,"title":"Chapter 334 - Moon Seizing Sect’s Hidden Treasures","content":"\u003cp\u003e\u003cstrong\u003eChapter 334 Moon Seizing Sect’s Hidden Treasures.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 334 – Moon Seizing Sect’s Hidden Treasures\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing Lin Ming and Lan Yi’s departing forms, Zhuang Fan glanced at Lin Wanshan and said, “Old Lin, Lin Ming is 16 this year isn’t he?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm… it’s about time for engagement.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAccording to the traditions of Sky Fortune Kingdom, once a man reached 16 years of age and became an adult, he could be engaged, and once he reached 18 years of age, he could get married.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut a martial artist was fundamentally different. It wasn’t strange for a Xiantian realm martial artist to not be married even at 100 years of age. Lin Wanshan didn’t know what sort of plans Lin Ming had for marriage, or if he even planned to. With a single word from Lin Wanshan, he could decide who a common Lin Family junior would have to marry. If they wanted to marry who they wanted, they would have to leave the family.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut as for something so important as Lin Ming’s marriage, that was something that Lin Wanshan had absolutely no power to influence. It would all be up to Lin Ming’s own choice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhuang Fan sighed, then shook his head. He casually spoke a few words regarding Lin Ming’s age of engagement, but Lin Ming was destined to never marry into their Zhuang Family as a son-in-law. Their Zhuang Family simply couldn’t produce a daughter that was able to match up to Lin Ming. He guessed that every noble family in Sky Fortune City already had their eyes on him. As long as Lin Ming revealed the slightest bit of interest, all of the noble families would probably line up their daughters, waiting in line to deliver them up to Lin Ming, even willing to send them off as concubines.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s tent was in the center of the army camp. The arrangements inside were very simple, but actually very comfortable. There was a sturdy wooden cot that was covered with clean cotton sheets. Because it was pressed a bit too much, it was a little hard to sit on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sit.” Lin Ming indicated the wooden cot as he spoke to Lan Yi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sir Lin, my name is Zhou Xinyu. The name of Lan Yi was only my childhood nickname…” The reason that Lan Yi hadn’t given her true name was because she wanted to conceal her identity. But now that she was requesting something from Lin Ming, she naturally had to be honest in her intentions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zhou Xinyu…” Lin Ming thought back and remembered that in Divine Phoenix Island’s joint talent training program, there was a girl with this name. She was one of the 50 human-step talents. “Miss Zhou is a disciple of the Moon Seizing Sect?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Xinyu hesitated for a moment, then nodded. There was no longer any reason to hide her identity, and this was easily found out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m sorry, but could Miss Zhou tell me who destroyed the Moon Seizing Sect?” Lin Ming tried to make his tone as gentle as possible as he poured a pot of tea, in order to not aggravate her wounds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the topic of her sect’s destruction was brought up, a look of hatred mingled with sorrow in Zhou Xinyu’s eyes. She still vividly recalled that bloody day when her master had died a tragic death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They were all Revolving Core masters. Seven of them in total.” Zhou Xinyu spat out between clenched teeth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the entire Moon Seizing Sect, only their Highest Elder had barely managed to break through to the Revolving Core realm. Even with several dozens of Xiantian masters combined together, none of them could block the slaughtering rampage of seven Revolving Core powerhouses – there was even one at the middle Revolving Core stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s heart sank. With this extermination line-up, even the Seven Profound Valleys would face certain doom. Even Peacock Mountain and Falling Cloud Sect would suffer serious losses.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe let out a heavy breath and then continued, “And what matter does Miss Zhou have to discuss with me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm… that is, I… I want to join Divine Phoenix Island. I… would like to ask that Sir Lin recommend me, if possible. I would like to have a chance to study Divine Phoenix Island’s core cultivation methods. I would be very grateful.” Zhou Xinyu started out a bit embarrassed, but afterwards just spoke her request in one go. She had originally planned to befriend Lin Ming and then slowly lay down her request, but now that the situation has become like this, there was no point in beating around the bush.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want to study the core cultivation methods?” Lin Ming furrowed his eyebrows. If it was simply a recommendation, then Lin Ming would easily be able to help. With Zhou Xinyu’s talent, it wouldn’t be too difficult to join Divine Phoenix Island.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, if he wanted to recommend her to study the core cultivation methods, then that was something he wouldn’t be able to do.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDivine Phoenix Island had two main core cultivation method manuals, ‘Vermillion Bird Forbidden Divine Chronicle’ as well as ‘Blue Luan Abstract Phantom Code’. These were the both legacies left behind by the ancient Phoenix Clan, they were incomparably precious.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese two cultivation methods were normally only passed down to core disciples. Ordinary disciples could only study the most superficial knowledge of them. Even Lin Ming, who hadn’t yet officially joined Divine Phoenix Island, was only taught the first layer of the ‘Vermillion Bird Forbidden Divine Chronicle’. Not only that, but Lin Ming had also made a pledge on his heart of martial arts that he wouldn’t leak out this cultivation method.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was because there were too many profound secrets contained within the, ‘Vermillion Bird Forbidden Divine Chronicle’ as well as ‘Blue Luan Abstract Phantom Code’. As the legacies of the ancient Phoenix Clan, it was said that if one managed to cultivate them to the highest realm, one’s body would be like a phoenix, and they would be able to rebirth in a nirvana of flames, immortal and indestructible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuch a precious ancient legacy was enough to cause many powerhouses to covet it, even with all the flaws they had.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ‘Vermillion Bird Forbidden Divine Chronicle’ and ‘Blue Luan Abstract Phantom Code’ were difficult to cultivate if one didn’t have the bloodline of the Vermillion Bird or Blue Luan. Of course, this didn’t mean that one couldn’t cultivate it entirely. In the history of Divine Phoenix Island, there was once an demonic man who cultivated fire-attribute cultivation methods, and had stolen away the Saintess of Divine Phoenix Island to plunder her Primordial Yin, so that he could double cultivate the ‘Vermillion Bird Forbidden Divine Chronicle’. Like this, a catastrophe was brought down upon Divine Phoenix Island.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut Divine Phoenix Island had learned from this grave mistake. From that point on, they had strictly controlled these secrets.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I apologize, I cannot help you.” Lin Ming said, directly rejecting Lan Yi. “The core cultivation methods of Divine Phoenix Island are only passed down to the core disciples. If you could become a core disciple, then you don’t need my help to do so.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Xinyu was stunned, and then her entire complexion was colored with disappointment. Core disciple… with her talent, the most she could be was an outer court disciple. There was no way she could compete against the inner court disciples, much less a core disciple.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking of the vengeance she needed to take for her master and her sect, Zhou Xinyu absentmindedly asked, “Divine Phoenix Island will not pass on the core cultivation methods to inner court disciples?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming shook his head, “An inner court disciple can only learn the first few layers of the core cultivation methods. Divine Phoenix Island is very strict in the management of their core cultivation methods. Sorry, but I simply cannot help you…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sir Lin… I…” Zhou Xinyu had a begging expression, but the words she wanted to say were caught in her throat. Her original intent was to produce a few Heaven Opening Pills as a reward for Lin Ming’s help.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now it appeared that Heaven Opening Pills were useless. Lin Ming wasn’t lacking in Heaven Opening Pills. According to what Zhou Xinyu had heard, Lin Ming had already obtained three Heaven Opening Pills. Once Lin Ming stepped into the Houtian realm, there would probably be more.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA core disciple of Divine Phoenix Island probably received similar treatment to Lin Ming. To use a few Heaven Opening Pills in exchange for the treatment of a core disciple was simply too naïve.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Xinyu was aware that with her own talent, the most she could achieve would be becoming an inner court disciple; there was no way she would ever be able to learn the full core cultivation method manuals and enter into the Revolving Core realm. Divine Phoenix Island was too strong, a core disciple had a high chance of entering the Revolving Core realm, otherwise, this Revolving Core realm would be too worthless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDid she really have to put out \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ethat\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf she gave it to Mu Qianyu, she might be able to trade it for a core disciple position. But… the price was too steep.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the Moon Seizing Sect was destroyed, the treasure that they left behind was the hope of her master, as well as the hope for the future revival of the Moon Seizing Sect.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithout it, even if she became a core disciple and was able to learn the core cultivation methods, it would be too difficult to step into the Revolving Core realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut if she had it, then she wouldn’t be able to reach the Revolving Core realm as she wouldn’t have a high-grade cultivation method. If she didn’t reach the Revolving Core realm, she wouldn’t have the qualifications to avenge her master or rebuild the Moon Seizing Sect.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Zhou Xinyu thought of this, her mind was torn…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ve disturbed Sir Lin, excuse me.” Zhou Xinyu barely smiled, and then quietly left the tent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs she left, Lin Ming saw her desolate back, and he suddenly sighed with emotion. He hesitated for a moment, then said, “I will bring this up with Divine Phoenix Island’s Miss Mu. However, what she does will depend on her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Xinyu was happy. She hurriedly thanked Lin Ming and said, “Thank you Sir Lin, I will engrave this kindness within my mind.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Zhou Xinyu profusely thank him, she finally left. Lin Ming could only shake his head. The road of a martial artist was fraught with hardships and emotions. Talents such as Zhou Xinyu may seem like fairy maidens to a common mortal, but if they truly wished to reach the Revolving Core realm, they had to pay a great cost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn order for a common martial artist to earn a few resources, they had to venture through lands filled with vicious beasts and risk their lives to hunt for precious materials. These materials were also what young and beautiful girls sought from the Seven Profound Valleys’ Acacia Faction. In order to reach the Pulse Condensation period and extend their lives, they would exchange their own virginity for the longer-lasting youth. These sect talents were the envy of countless others, in order to search for lucky opportunities, they would enter into dangerous lands and possibly die…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe road of martial artists seemed bright and attractive, but once one stepped onto it, it was full of thorns and perils. If one fell off for any reason, there was no more hope for them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Xinyu had a wish and obsession to revive her sect and avenge her master. This obsession was truly worthy of Lin Ming’s pity and respect. However, at most, Lin Ming would only be able to mention this subject to Mu Qianyu; he couldn’t help her in any substantial way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo longer thinking about these things, Lin Ming closed the tent curtains and then took out a spatial ring. This spatial ring was left behind by Bi Luo. After Lin Ming killed Bi Luo, he had only taken the spatial ring because he was in a hurry to return to the battlefield; he hadn’t had time to investigate what was inside.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBi Luo had a limited status within the Seven Profound Valleys. Lin Ming didn’t have much hope that there would be anything within that was too valuable. He started with the mindset that it would be like looking for meat in a mosquito leg, and he began to remove the objects inside one at a time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were several medium-grade human-step treasures, as well as a high-grade human-step treasure sword and flexible armor. There were several bottles of high-grade pills for a Houtian realm martial artist to increase their cultivation, over 1000 true essence stones, and several jade slips.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was no need to look at treasures like the flexible armor. To Lin Ming, these treasures were things he could just give away. As for the high-grade cultivation pills, those were barely up to standards. They were probably gifted by Ouyang Boyan, so it would be useful to keep them. As for the 1000 true essences tones, they were better than nothing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfterwards, Lin Ming picked up the jade slips and began to casually glance through them. Suddenly, he was surprised. Mm? There was a medium-grade earth-step auxiliary secret skill jade slip?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo a sect, core secret skills were the unique legacies of those sects. For instance, Divine Phoenix Island’s ‘Vermillion Bird Forbidden Divine Chronicle’, and the Acacia Faction’s ‘Divine Acacia Power’ had no grade.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut there were some secret skills that were spread out and thus obtained a grade. A medium-grade earth-step cultivation method jade slip was equal to a top medium-grade earth-step treasure in value.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eInitially when Lin Ming had learned the ‘Body Tearing Bone Shattering Fist’, that had only been an incomplete medium-grade earth-step martial skill. But, the abstract principles found within were extremely profound. Although a medium-grade earth-step auxiliary secret skill was just a bit lower in value, it was more than enough to exchange for two Heaven Opening Pills.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Bi Luo, he was actually thinking of trade for two Heaven Opening Pills with this secret skill after he reached peak Houtian, and then breaking through to the Xiantian realm! How ambitious…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t think that Bi Luo’s treasure trove was so deep that it would have such a precious treasure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming swept through the contents of the cultivation method, his heart immediately stirred. This was a set of appearance changing and concealment methods!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo wonder Bi Luo’s appearance changing technique and concealment skill had been so superb!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-333\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-335\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-334","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
