{"id":54323,"no":378,"title":"Chapter 376 - Pale Youth","content":"\u003cp\u003e\u003cstrong\u003eChapter 376 Pale Youth.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 376 – Pale Youth\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a mere Bone Forging stage cultivation, Lin Ming had been able to absorb the Purple Flood Dragon Divine Thunder that only a middle Xiantian master should have been able to. If there wasn’t any secret within Lin Ming’s body, Mu Yuhuang would never have been able to believe this. But, if Lin Ming’s bloodline was used as the explanation, she could reluctantly come to terms with it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter all, the Purple Flood Dragon Divine Thunder contained the brutal will of a Flood Dragon. If it was to encounter a more formidable and ancient bloodline, this Flood Dragon bloodline would be awed into submission. With Yu’er’s help, this could also explain how Lin Ming was able to absorb it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Qianyu nodded, saying, “This is also the first time disciple has seen the phantom behind Lin Ming. When Senior-apprentice Sister Qinghong returned from the Seven profound Valleys, she described to me what she had seen. It was probably a similar scene… disciple believes that this is an ancient noble bloodline similar to my Divine Phoenix Island’s that Lin Ming managed to obtain through some lucky chance.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for Lin Ming’s life and background, they had already been clearly researched by Divine Phoenix Island. The common people of Sky Fortune Kingdom had been mortals for generations, it was impossible for Lin Ming to have this kind of bloodline from his family. Thus, the only other reason was that the heavens had gifted him a lucky miracle.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ancient noble bloodline?” Mu Yuhuang hesitated. Perhaps matters weren’t so simple. Just what sort of ancient noble bloodline could cause even the Vermillion Bird bloodline within her to shiver in fear?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould it be a God Beast?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Yuhuang dared not believe this. A God Beast did not exist in the Sky Spill Continent. It was said that above the Sky Spill Continent was the Realm of the Gods. But, even within the Realm of the Gods, a God Beast was an extremely rare existence. Where did Lin Ming find the blood essence of a God Beast to transplant into his bloodline?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if he had gotten that far, how could a mere Bone Forging boy have absorbed such a bloodline?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn any case, it was true that Lin Ming had a secret bloodline within him, and that this bloodline had an extraordinary origin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Mu Yuhuang didn’t wish to pry into his secrets. In truth, lucky chances were also a part of one’s destiny. A great lucky chance came with a correspondingly great destiny. Destiny was the essential truth that an unrivaled talent needed to become a Peerless Emperor. Ever since ancient times, the birth of Peerless Emperors usually resulted from the accumulated destiny of a character that stood at the pinnacle.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf one didn’t have such a destiny but still coveted these things, they would instead attract an unexpected catastrophe upon themselves. History had proven this point again and again throughout the annals of time. These so-called unlucky calamitous treasures were often priceless. However, what was strange was that if one obtained it, they would die as if they had been struck by a curse. If one didn’t have a great destiny as if they were the protagonist of the world, they would not be able to gather such treasures to them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn order to birth a genius that would become a Peerless Emperor, perhaps not even Divine Phoenix Island had such a destiny. Much less, Mu Yuhuang was just an old lady with a few hundred years of life left in her. This sort of calamitous treasure was not something she would be able to afford. Even if she managed to peacefully obtain it without accident, with her age, it was basically useless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat Mu Yuhuang most wanted to see now was only that her Divine Phoenix Island would be able to enter an age of prosperity.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the martial arts stage, Lin Ming and Xiao Chi fought once more. Both spears clashed. One side was a spear skill genius of Golden Bell Mountain whose every move contained profound principles. But as for the other side, he had a deep comprehension of spear potential. Although his spear skills were simple and lacking, every spear was like a landslide, every spear was like a tsunami, every spear contained the power of endless mountains and rivers. These two were well matched against each other.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eClang clang clang clang clang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith every strike, a violently raging true essence shockwave erupted, an azure color mixing with a golden color, causing the ground itself to shake. Because of the intense shockwaves in the air, the audience that witnessed this battle scene seemed to be watching it under the twisted ripples of water.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery spear that Lin Ming thrust out contained an enormous pressure. Even though Xiao Chi’s spear contained a strange power, it was actually forcefully dissolved by Lin Ming’s strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two youths fought for several dozen moves. Lin Ming had consumed a great deal of true essence, but so had Xiao Chi.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis battle was the longest that Lin Ming had ever fought.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith his strength, he could simply have used the Thunder Soul and won with overwhelming force. But, he did not do this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe needed this battle to see what degree of skill one’s spear play could reach.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Chi turned, thrusting out his spear. Although this spear skill looked very slow, in just a split-second the spearpoint would instantly arrive in front of you. This sort of strange and confusing spatial skill was nearly impossible to defend against.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePah!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven Lin Ming was unable to completely dodge the spear with such a confusing spatial skill. The spearpoint rubbed against Lin Ming’s bodily true essence, and with a ripping sound, an incomparably sharp golden spear had pierced through Lin Ming’s bodily true essence, taking just a touch of blood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e Xiao Chi was surprised. What was going on? In that attack, he had felt like his spear had stabbed into iron, it simply hadn’t been able to do much damage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut at the same time, Lin Ming’s spear came smashing down like an avalanche!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiao Chi quickly lifted his spear to block.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eClang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs soon as this blow smashed down, the golden spear in Xiao Chi’s hand curved into a crescent moon. He staggered back, every step creating a deep imprint in the ground. The tiles of the stage that were supported by an array formation were broken by the pressure of his feet, cracks littering the stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter retreated 70 to 80 feet, Xiao Chi finally came to a stop. He felt like his right arm was numb, and even his fingers were shaking.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What a terrifying strength and spear potential!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough he managed to block that last attack, he felt the blood within his body roiling and his meridians in crazy disorder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the audience, the Golden Bell Mountain elder gasped. “What a terrifying boy. Chi’er used a special technique to unload the force on his body. Lin Ming’s strength and spear potential that he unleashed poured along Chi’er’s muscles and skeleton, entering the ground through his feet. Even though he had let so much strength pass through him, he was still wounded. The power of this spear potential is simply like having a mountain fall on you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Indeed… this boy is truly a spear genius. But it’s such a pity that he doesn’t have a great master that can teach him spear skills. If all he learns is some Foundation Spear Technique skills, then it is truly wasteful…” Another Golden Bell Mountain elder said with some regret, obviously sad that Lin Ming hadn’t joined his Golden Ball Mountain.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Haha, what a great fight!” Xiao Chi suddenly put away his spear. His entire forehead was covered with sweat, and his face was flushed red. Blood was surging within his body, and he had obviously consumed a great deal of strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Same here.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was also panting for breath. After several continuous battles, even with pills to supplement him, he had consumed over 70% of his true essence. Not only that, but within the true essence of his body, there were many complex and strange factors. Lin Ming’s current combat strength was less than half of his optimal condition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’re just a monster. You fought through five straight fierce matches and yet you can still fight to this degree and have energy left over. I admit defeat.” Xiao Chi sighed, lamenting the result. He had been evenly matched with Lin Ming, but it turned out that Lin Ming’s endurance was much greater than his. If they continued, his defeat was simply a matter of time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Well fought.” Lin Ming cupped his hands together and bowed. During this match against Xiao Chi, he had learned many things and gained many insights. It seemed that he really needed to look for a spear art manual in order to make up for his deficiencies there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Xiao Chi admitted defeat on his own, the entire audience was silent. The strongest direct disciple under the six great chief disciples had actually lost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Xiao was defeated…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven the Five Element Region disciples that were desperately cheering for Xiao Chi were unable to accept this. The truth was, when Lin Ming hadn’t used this power of thunder and fire, yet was still able to fight evenly with Xiao Chi using just his spear play, they had already foreseen the ending that Xiao Chi would lose. It was just that they weren’t willing to accept this truth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Xiao lost. Above Xiao Chi, there are only the six great direct disciples…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough everyone knew that Lin Ming was already spent of all energy, there was no direct disciples that went onstage to challenge him. Lin Ming’s winning streak had left them breathless, and no one had the courage or qualifications to challenge him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming swallowed a pill and propped himself up on the stage using his spear. This time, he did not challenge anyone to battle. He was well aware that if he fought again, it would be against a chief disciple.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSix great chief disciples… it was unknown just how many he could fight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming turned to look at Mu Dingshan and saw that he was preparing. Next would be a contest between chief disciples!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dingshan, Xiaoqing, if you fight, try to delay as much as possible so that Lin Ming can have more time to recover.” Mu Dingshan and Mu Xiaoqing simultaneously heard the true essence sound transmission of old lady Yuhuang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, Honorable Sect Master.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the Thundercrest Sect banquet area, the pale youth glanced at Zhou Lie, ordering him to go onstage. “You challenge Lin Ming to draw out Mu Dingshan, I’ll help you take him!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pale youth tersely said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Lie frowned. He absolutely did not wish to do something so insidious like taking advantage of someone while they were in a vulnerable situation. This was not how a true gentleman acted. With such a large audience present, he couldn’t afford to lose.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hehe, what’s the matter? You think you’re taking advantage of someone while they’re down? Alright, we’ll take a break and look for another reason when they lose.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pale youth casually spoke, his words carrying an imperious tone that made Zhou Lie feel uneasy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘This fellow seems very keen on what he said before, and wants to challenge the direct disciples of Divine Phoenix Island by himself. What does he want from all this?’ Zhou Lie thought, baffled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, the pale youth used a true essence sound transmission to communicate with Lei Jingtian. Then, Lei Jingtian stood up and smiled, “High Master Yuhuang, your great island’s Lin Ming is truly a hero that from among the young. However, after he competed against five masters from my Five Element Region, it seems that he has already exhausted himself. How about we have a truce and take a break so that Lin Ming can rest. Afterwards will be the final competition between chief disciples. How about it?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? Mu Yuhuang’s willowy eyebrows rose. This fellow, just what did this little weasel want? What was he thinking about? He actually offered to call a momentary truce?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had to be known that Lin Ming had consumed too much energy. Even if Mu Dingshan and Mu Xiaoqing were able to delay for a few matches so that Lin Ming could rest, he still wouldn’t be able to fully recover in this short time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Lei Jingtian spoke, he sat down with a cheerful laugh before waiting for Mu Yuhuang’s answer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhou Lie was confused, just who was this pale youth? It seemed that his master seemed to care about his opinion a great deal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘This fellow is shrouded in mystery, he’s just like a frosty snake! Master said that he was a Saint rank talent that he found in the northern domains, but I always felt that this explanation was too farfetched. His martial talent is surprisingly good and he also understands many different cultivation methods. His cultivation is only at the early Houtian realm, yet he can easily defeat me! Not only that, but he seems to know some secrets about Sky Spill Continent, such as the legends of the Saintess…’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was definitely a problem with this man!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust who was he?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor some time, Zhou Lie even suspected that the pale fellow was possessed by some ancient monster. Of course, this was something that only existed in fantasy novels; he had no idea if things like possession existed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Zhou Lie was daydreaming, Lei Jingtian was exchanging a true essence sound transmission with the pale youth. “We’ll follow everything as you planned. Events should progress\u0026nbsp;smoothly…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm, very good!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-375\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-377\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-376","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
