{"id":54345,"no":400,"title":"Chapter 398 - Bloodline Test","content":"\u003cp\u003e\u003cstrong\u003eChapter 398 Bloodline Test.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 398 – Bloodline Test\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn order to subjugate and obtain a medium-grade earth-step Flame Essence within the Divine Phoenix Mystic Realm, it wasn’t only a question of one’s destiny – one also needed sufficient strength! As Mu Dingshan thought back to half a month ago when he had witnessed a battle between two Kings of the younger generation, he could only sigh with emotion. “Junior-apprentice Brother Lin, good thing it was you. If I were the one that encountered this Flame Essence, I would be lucky to even escape with all my limbs intact.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn fact, the last time that Mu Dingshan had entered into the Divine Phoenix Mystic Realm, he had also come across a great lucky chance. Within the center of a lava pool, he had seen a Rainbow Blaze Fruit growing there. This kind of miracle medicine was able to extend the life of a fire-attribute martial artist!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough it had a limited effect on one’s cultivation, if the news that he had managed to obtain it was spread to the old Revolving Core monsters or even the Emperor level powerhouses, then they would most likely desperately bid for it. When that happened, Mu Dingshan could just open his mouth and request any treasures he wanted, from high-grade Flame Essences to top medicines.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnfortunately, this Rainbow Blaze Fruit had been guarded by a top sixth-level vicious beast. Mu Dingshan had instantly turned tail and ran away. Luckily, he had quickly and decisively run away. Otherwise, if that vicious beast had caught scent of him, he would certainly have died there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough he regretted it, he realized it was the only path he could take. With his strength, Mu Dingshan simply wasn’t able to attain a treasure like that.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is a Fallen Flame Star?” Mu Dingshan had a wide breadth of experience and recalled the name of this Flame Essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm, yes.” Lin Ming nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Fallen Star Flame is rare even within the entire Sky Spill Continent. That Junior-apprentice Brother Lin can obtain one means that you have tremendous luck!” Mu Dingshan praised. He wasn’t clear that this Fallen Star Flame had already mutated. When the meteor had crashed down in a terrifying explosion, it had caused the Fallen Star Flame to absorb the Flame Essence that was forming in the lava pool, creating an unknown chance. A Fallen Star Flame was originally extremely rare. As for this mutated Fallen Star Flame, it was simply a singularly unique existence in the world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHearing the name of the Fallen Star Flame, the surrounding disciples also began to sigh in admiration. As they spoke, the envy in their voices was thick.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAbsorbing a Flame Essence could not only increase one’s combat strength, but also enhance their cultivation. With Lin Ming’s strength and talent, it probably wouldn’t be long before he was able to absorb this Flame Essence. When that happened, his cultivation might make another breakthrough. At that time, who else could be Lin Ming’s match?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright. We have less than an hour before the Ancient Phoenix Main Hall opens. At that time, 16 jade platforms will appear. Every person can select any platform they wish to enter to Ancient Phoenix Main Hall. I hope that all of you will take advantage of the time available to rest up, and adjust to your best condition by the time the Ancient Phoenix Main Hall opens. I do not want any of you to die here, this is also the mission personally given to be by the Honorable Sect Master!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Dingshan repeated his warning, his voice serious and humorless. When they were travelling the world of the Ancient Phoenix Mystic Realm, if any of the lower ranked core disciples had died, it wouldn’t mean much. However, if any of the current 16 direct disciples were to die, it would be a great loss to Divine Phoenix Island. After they entered the Ancient Phoenix Main Hall, Mu Dingshan wouldn’t be able to protect any of them. So he could only repeatedly urge them to stay safe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Mu, what will happen in the Ancient Phoenix Main Hall?” A youth asked. This was the first time had had entered the Ancient Phoenix Main Hall, and also the first time he had entered the Divine Phoenix Mystic Realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Everyone who enters the Ancient Phoenix Main Hall will have different encounters. The Ancient Phoenix Main Hall is a trial that the Ancient Phoenix Clan used to test the experience and talent of their juniors. When the time comes, you will all be separated based on your talent and bloodline, and then sent to a smelting trial with a corresponding difficulty. Within the smelting trial, there is a chance that you can die. If anything happens, do not try to be brave. If you need to give up, then give up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Mu Dingshan spoke, he deliberately glanced over at Lin Ming. “Junior-apprentice Brother Lin, please do not be overly confident in your abilities and try to show off. Honorable Sect Master has bid me to mention this to you again and again. Her Highness the Saintess also has very high hopes for you. If anything happens to you at all, I will not have the face to return.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough Lin Ming was truly strong, the difficulty of the smelting trial depended on one’s talent. When that happened, strength was useless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn terms of bloodline talent, Lin Ming was a bit worse. Although he had absorbed the Vermillion Bird blood essence, it was still far worse than Mu Qianyu or Mu Bingyun.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Mu, please rest assured, I will definitely return safely.” In the past one to two years, Lin Ming had experienced countless dangerous life or death situations. Compared to all of that, the Ancient Phoenix Main Hall was comparatively safe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right. Senior-apprentice Brother Mu, do you understand the reasons behind the murals and reliefs in the Main Hall?” Lin Ming pointed to the walls and columns. He had a strange nagging feeling that these depictions were a record of earth-shattering events that had happened in ancient times.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh, you’re curious about these… the last time I came here, I also saw them. I went back and asked Honorable Sect Master what they were, but Honorably Sect Master only said that they were scenes from ancient times. As for who these images specifically depict, Honorable Sect Master wouldn’t know even if they were people from the Sky Spill Continent. We can only vaguely speculate on possibilities.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Dingshan’s answer wasn’t too far from Lin Ming’s expectations. The Ancient Phoenix Main Hall had already existed for countless tens or hundreds of thousands of years. But, Divine Phoenix Island only had a history of a mere 3000 years. Naturally, Divine Phoenix Island wouldn’t be clear as to what these images that were depicted meant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe passage of time was simply too long. The Realm of the Gods may have existed for hundreds of millions of years. As for the Sky Spill Continent, he had no idea how long it had existed for. The ancient texts only recorded history that went back a few tens of thousands of years. Everything before that had already been destroyed or lost to the vast and endless flow of time, and was unable to be found again. Perhaps the martial world of Sky Spill Continent had already been destroyed and reborn several times.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming shook his head, no longer thinking about these matters. If he wanted to further explore these things, he would have to wait until he obtained the strength to do so. Perhaps those majestic Holy Lands with deep legacies might have records concerning this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright everyone, let’s get started and meditate. If you are lacking pills, just tell me.” Mu Dingshan said to everyone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore entering the Divine Phoenix Mystic Realm, everyone had come fully stocked with pills. But, one couldn’t rule out the possibility that someone had run into danger multiple times and had taken all their pills.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe 16 individuals sat down and began to meditate together. Lin Ming hadn’t consumed too much energy, but he still entered the ethereal martial intent state. Entering the deep ethereal state and absorbing the surrounding origin energy to make up for whatever energy he used would be the best way to restore his top condition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTime passed. Suddenly, the Ancient Phoenix Main Hall’s floor began to slightly tremble. Lin Ming opened his eyes; it was finally time to enter the Ancient Phoenix Main Hall!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa ka ka!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the sound of a gears slowly turning, the ground in the center of the Main Hall began to lift, and a large altar dozens of feet wide appeared. On the outer ring of the alter, sparkling, crystal clear jade platforms appeared. There was a total of 16.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Good. Everyone come up and choose any jade platform.” As Mu Dingshan spoke, he stepped onto the altar, selected a jade platform, and then stood in front.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming followed. Each of the 16 jade platforms had the same shape, but there were also subtle differences. Every jade platform had different patterns carved into it; there seemed to be mysterious array symbols that were etched onto the surface of the jade platforms. On the jade platform, there was a groove – its shape just happened to match the key he had been given to enter the Ancient Phoenix Main Hall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming casually took the jade tablet out from his spatial ring.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Place a drop of blood onto the jade tablet, and then place the jade tablet into the groove. Then, the smelting trial will open. Every smelting trial will be different. Everyone, this is where we part from now. I hope that seven days from now, I will be able to see the safe return of everyone here!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Mu Dingshan spoke, he cut his finger and let his blood drip onto the jade tablet. The jade tablet turned a dazzling blood red, and then Mu Dingshan placed it into the jade platform’s groove. With a flash of crimson light, Mu Dingshan instantly vanished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe altar began to flash with sparks of light. The Vermillion Bird Faction disciples were covered with a deep crimson red, and the Blue Luan Faction disciples were covered with a light blue. Suddenly, there were only a few of the 16 disciples left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming put a drop of blood on the jade tablet and then inserted it into the groove. In the next moment, he felt a warm light envelop him, and the space around him seem to twist. After several breaths of time, he was warped to a fully enclosed chamber.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming could vaguely make out his surroundings in the dark chamber. The chamber was only 100 feet wide and long, and the walls were engraved with different sorts of reliefs, just like the columns and walls he had seen before. There were all sorts of Saint Beats, humans, and demons…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSome seemed to be celebrating festivals, some seemed to be waging war.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHu!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA flame lit in the dark void within the chamber, and the fire origin energy of the room began to gather towards the flame, forming numerous radiant red dots. A moment later, these spots warped into human shape, and then began to substantialize into a red person. Its appearance was a bit fuzzy, and its build was about the same as Lin Ming. Its cultivation was at the peak Pulse Condensation period, and it held a spear in its hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSou!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe red figure stabbed out a spear at Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is this the beginning of the test?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming raised his spear and calmly counterattacked. Although this red figure’s cultivation was the same as his, its strength was far worse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSwiping away the red figure’s thrust, Lin Ming pierced his spear through its chest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe scarlet person dissipated into countless red lights. But after several more breaths of time, these points of lights once again gathered together and condensed into a red figure. Its appearance was still fuzzy and it still wielded a spear, but its cultivation was at a half-step Houtian.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA spear thrust forth!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Too weak.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming acted without hesitation, not bothering to change his style. The Purple Comet Spear thrust forth like before, and punctured the red figures chest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe second red figure fell over and dissipated once again. In the next moment, another red figure appeared. Its appearance, build, and weapon were still the same, but not its cultivation. It had risen by another level – it was at the early Houtian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Testing my limit?” The corners of Lin Ming’s lips curved up in a grin. If these red human figures became stronger every time they were defeated, then next time it would be at the middle Houtian realm. These red martial artists were probably comparable to the level of someone like Zhang Yanzhao or Huan Xiaodie in terms of talent. They were weaker than Qin Wuxin and Jiang Lanjian. As for comparing to Lin Ming, the disparity was even greater.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSlightly raising the true essence in his attack, Lin Ming thrust out like before, eliminating his opponent!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…………………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, in 15 other chambers, all of them were participating in the same test. Mu Dingshan expended a great deal of effort and finally cut apart a peak Houtian realm martial artist. But in the next moment, the scattered red light once again converged into a red figure. This time, it was a half-step Xiantian martial artist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Dingshan ruefully smiled. His cultivation was only at the peak of the early Houtian realm. As for the red figure, its talent was comparable to a third-grade sect’s direct disciple. If they were on the same level, then Mu Dingshan would naturally be able to easily deal with such an opponent. But now, his opponent had jumped stages yet again; it was at the point where he couldn’t handle it any longer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAgainst a third-grade sect’s direct disciple with a half-step Xiantian cultivation, Mu Dingshan was more likely to lose than win.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMu Dingshan’s result was considered fairly good. Of the 15 other disciples, the majority of them had already been defeated. They could challenge a late Houtian realm martial artist, but not one at the peak Houtian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter they were defeated, these martial artists were all transferred to their smelting trial path, where they would begin their smelting trial.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-397\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-399\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-398","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
