{"id":53986,"no":41,"title":"Chapter 40 - Break Through the Fourth Floor","content":"\u003cp\u003e\u003cstrong\u003eChapter 40 Break Through the Fourth Floor.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOutside of the Exquisite Pagoda, the elders saw the magic array of the fourth floor light up and they were startled. “My goodness, the fourth floor, and it only took half an incense stick of time!”\u003c/p\u003e\n\u003cp\u003e“This Wang Yanfeng, he’s not simple.” These elders had already expected Wang Yanfeng to reach the fourth floor, but hadn’t anticipated that he would do it so quickly. “At such speed, perhaps Wang Yanfeng can break through the fourth floor and step into the fifth. Certainly I had thought that the fifth floor was impossible, but he should be proud even with this result.”\u003c/p\u003e\n\u003cp\u003e“I just don’t know how Lin Ming and Liang Tieshan will perform. Those two’s results weren’t too bad. Liang Tieshen was the tall and burly youth who had inborn divine strength. He was also fifteen years old.\u003c/p\u003e\n\u003cp\u003eLin Ming and Liang Tieshan were fifteen years old, had cultivation at the Second Stage of Body Transformation, and also had inborn divine strength. This kind of power at their age was definitely impressive.\u003c/p\u003e\n\u003cp\u003eHowever in the eyes of the numerous elders, if these two were compared to Wang Yanfeng, there was still a gap.\u003c/p\u003e\n\u003cp\u003eThat Lin Ming had inborn divine strength was not wrong, but he was only at the Second Stage of Body Transformation. Wang Yanfeng was at the Third Stage of Body Transformation. The main characteristic of the Third Stage was infusing true essence into the visceral organs. Viscera Training martial artists’ heart and lungs would be empowered. Their breaths would be long and their endurance double that of a Second Stage martial artist.\u003c/p\u003e\n\u003cp\u003eWithout a doubt, Wang Yanfeng also had superior technique and speed. Even looking at strength, Wang Yanfeng’s record was only 300 less than Lin Ming; the disparity was not too great.\u003c/p\u003e\n\u003cp\u003eFor this third trial, if there was no accident, then Wang Yanfeng would take first place.\u003c/p\u003e\n\u003cp\u003eThe third trial also accounted for the largest proportion when it came to the final evaluation. If Wang Yanfeng came out first in the third trial, that in addition to his talent would surpass Lin Ming, and the entrance exam’s first place would belong to him.\u003c/p\u003e\n\u003cp\u003eHowever at this moment, the truth was that Wang Yanfeng was struggling at the third floor. These two martial artists were difficult to deal with, for every few moves they traded, he would encounter one that threatened his life. Wang Yanfeng used a tremendous amount of strength and true essence to defeat one, but had also suffered a minor injury.\u003c/p\u003e\n\u003cp\u003e“Damnit, how is this so freakish. Even with the ‘Nine Paths of Truth’ that is passed down in my family I only managed to kill one. It seems that chances of reaching the fourth floor are getting less and less certain.” Wang Yanfeng worried; he had already consumed 20% of his inner true essence. In this dreamland he was unable to supplement it with pills or drugs. He could only depend on his Third Stage viscera training to supplement his energy bit by bit.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eWang Yanfeng was anxious over his true essence consumption rate, but Lin Ming was also worrying over the same reason. He was not at Viscera Training, but was only at the Second Stage of Body Transformation, Flesh Training. He did not have excessive vitality and his every move consumed more true essence.\u003c/p\u003e\n\u003cp\u003eLuckily, Lin Ming had the ‘True Primal Chaos Formula’ and had achieved the small success of the first stage. This ancient skill revolved within him, it allowed him to supplement his true essence with an unceasing supply. Although he could not use it endlessly, it was still able to alleviate the intense pressure he felt.\u003c/p\u003e\n\u003cp\u003eThis time in front of Lin Ming, the opponents were two first-level vicious beasts – Iron Armor Bears.\u003c/p\u003e\n\u003cp\u003eThere were strong and weak first-level vicious beasts. The Single Horned Rhinoceros was weak; it was only equal to a peak Second Stage martial artist. But this Iron Armor Bear was actually equal to a peak Third Stage martial artist. Not only that, but there were two.\u003c/p\u003e\n\u003cp\u003eLin Ming was solemn. Before this he had never fought against an opponent at the peak of the Third Stage. He did not have complete confidence in victory in defeating one, and not to mention this was a pair.\u003c/p\u003e\n\u003cp\u003eBut most importantly was that this battle had two strict conditions. First, he could not use up his limited true essence. Second, he could not receive a single injury.\u003c/p\u003e\n\u003cp\u003eLin Ming took a steadying breath as he recalled every detail he knew about the Iron Armor Bear.\u003c/p\u003e\n\u003cp\u003eThe Iron Armor Bear’s strength was 5000 jins. Its speed was a bit slow, but the entire body was covered in thick plates of bone armor. A sword or spear would find it hard to penetrate this carapace, and it did not have any specific weakness.\u003c/p\u003e\n\u003cp\u003eAlthough he knew that the armor did not have any weaknesses, Lin Ming knew that the Iron Armor Bear itself had a weakness, and that was that between the numerous intersections and crosses of the bone armor were a few small slits.\u003c/p\u003e\n\u003cp\u003eThe slits were located at the joints. They were thin and hard to target; if he wanted to strike at these places in the heat of battle, he must open his eyes to his insight and utilize instantaneous judgement and peerless accuracy to have a chance.\u003c/p\u003e\n\u003cp\u003eBut after practicing the ‘True Primal Chaos Formula’, Lin Ming’s perception had risen to a new level and his judgement and accuracy had been fostered steadily by his years of deboning.\u003c/p\u003e\n\u003cp\u003e“Zhu Yan should have easily been able to deal with these two Iron Armor Bears half a year ago, not to mention now Zhu Yan must have progressed. I can’t lose to him like this.”\u003c/p\u003e\n\u003cp\u003eLin Ming stared at the two Iron Armor Bears and his fighting spirit began to rise in his heart.\u003c/p\u003e\n\u003cp\u003e“Hu!”\u003c/p\u003e\n\u003cp\u003eAn Iron Armor Bear suddenly leapt upwards and smashed its thick, heavy paws at Lin Ming.\u003c/p\u003e\n\u003cp\u003eThe Iron Armor Bear weighed over a thousand jins. Coupled with its awesome strength, this strike would have even felled an elephant!\u003c/p\u003e\n\u003cp\u003eLin Ming’s eyes widened and he did not retreat. Instead, like a graceful bird that flew with grace and poise, he passed by the Iron Armor Bear. His eye’s focused onto a point of the bear’s abdomen where two bone armor plates joined with each other and struck out with his knife!\u003c/p\u003e\n\u003cp\u003e“!”\u003c/p\u003e\n\u003cp\u003eIt was only a simple deboning knife, but Lin Ming had practiced its strokes tens of thousands of times. The knife accurately slid between the two bone armor plates. The knife was quick, and with only a slight hitch in the thick flesh, it slid through with extreme speed.\u003c/p\u003e\n\u003cp\u003eAs soon as the blow struck, before the time it takes to snap a finger, blood shot into the air.\u003c/p\u003e\n\u003cp\u003e“Rahh!” The Iron Armor Bear became mad. The knife wound had not been fatal and it rushed crazily at Lin Ming!\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e“Less than forty people have been eliminated and more than fifty have passed. This is a decent result.” A Seven Profound Martial House elder slowly said as he watched the candidates who had been kicked from the Exquisite Pagoda.\u003c/p\u003e\n\u003cp\u003eThe Exquisite Pagoda was completely sealed from the outside. The elders were not Xiantian experts and had no way to see what was happening inside the Exquisite Pagoda. They could only judge how far the candidates had gone by which layer they had been ejected from.\u003c/p\u003e\n\u003cp\u003eIf they were ejected from the first floor then they were eliminated, and if they were ejected from the second then they passed.\u003c/p\u003e\n\u003cp\u003eA quarter of an hour had passed since the candidates had entered the Exquisite Pagoda, and all of them had long since passed the first floor. Some had arrived on the third floor and some were even challenging the fourth.\u003c/p\u003e\n\u003cp\u003e“Now only five people have not yet come out.” As an elder said this, the symbols began to flash on the Exquisite Pagoda and another two candidates were kicked out. They had been ejected from the third floor, so they had failed at the third floor.\u003c/p\u003e\n\u003cp\u003eSeveral martial artists had already ran up and were caring for the unconscious candidates.\u003c/p\u003e\n\u003cp\u003eThese two candidates were at the peak of the Third Stage of Body Transformation and their strength results had been 2300 jins. Unfortunately they were also seventeen and eighteen. They had not been able to break through the third floor of the Exquisite Pagoda, but they were also proud of their results.\u003c/p\u003e\n\u003cp\u003eWhen these two people were ejected, Lan Yunyue immediately turned to them and instantly distinguished that they were not Lin Ming.\u003c/p\u003e\n\u003cp\u003eOut of the 92 candidates that had entered so far, 39 had already been ejected from the Exquisite Pagoda. Lan Yanyue could clearly see that these people did not include Lin Ming. That could only mean that Lin Ming was still within the Exquisite Pagoda!\u003c/p\u003e\n\u003cp\u003eLin Ming… Lan Yunyue lightly nipped her lips as he eyes glazed over with memories.\u003c/p\u003e\n\u003cp\u003eShe knew that this meant that Lin Ming had passed, and was at least at the third floor.\u003c/p\u003e\n\u003cp\u003eThe third floor was in truth an enormous glory. In the school records of the Seven Profound Martial House, those that passed the third floor would one day achieve the peak of Body Transformation, the Sixth Stage of Pulse Condensation.\u003c/p\u003e\n\u003cp\u003eThe Royal Government would bestow upon all those martial artists of the Pulse Condensation Period a rank and title within the kingdom. Although it was only a third-class viscount, it was not that different from an official position and was even hereditary.\u003c/p\u003e\n\u003cp\u003eThis was a noble title! In the Sky Fortune Kingdom, this was a symbol of glory and of the aristocracy. Because of a single person’s personal glory, their family would enter the lineage of the aristocracy and bring honor to their ancestors.\u003c/p\u003e\n\u003cp\u003eJust then, another candidate was expelled from the fourth floor.\u003c/p\u003e\n\u003cp\u003eThis meant that Lin Ming had passed the third floor!\u003c/p\u003e\n\u003cp\u003eThis tall and sturdy boy with thick features was the boy with inborn divine strength, Liang Tieshan. He had put forth his utmost effort and after taking a severe wound had broke to the third floor and was defeated nearly upon arrival.\u003c/p\u003e\n\u003cp\u003e“This Liang Tieshen is a good seedling. He’s worth cultivating with resources.”\u003c/p\u003e\n\u003cp\u003e“Mm., he’s quite good. Now there are two left, Lin Ming and Wang Yanfeng.”\u003c/p\u003e\n\u003cp\u003e“That Lin Ming can persist even with his present strength is not easy. His strength is greater compared to Liang Tieshan’s and he also has a strong heart of martial arts that helps him. But to break through the fourth floor is uncertain…”\u003c/p\u003e\n\u003cp\u003e“Mmm, let alone Lin Ming, even Wang Yanfeng will not find it easy.”\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e“Poh!” With a single stroke from his knife, blood shot out from the leg of the Iron Armor Bear. Lin Ming tumbled away as the angry Iron Armor Bear pounced on him.\u003c/p\u003e\n\u003cp\u003eBy now, the two Iron Armor Bears had become Blood Bears. They each had several more knife cuts across the weak points between their armor plates. While the wounds were not fatal, loss of blood could quickly become deadly!\u003c/p\u003e\n\u003cp\u003eThe motion of these two Iron Armor Bears had obviously slowed down from excessive blood loss.\u003c/p\u003e\n\u003cp\u003eChance!\u003c/p\u003e\n\u003cp\u003eLin Ming dodged around the two bears who tried to catch him. Their blood loss and exhaustion exposed openings in their defense, and Lin Ming sprung upwards like a cheetah.\u003c/p\u003e\n\u003cp\u003e“Roar!” The Iron Armored Bear stood up on its hind legs and threw a strike with its paws. But Lin Ming had already escaped, and while evading at the same time, Lin Ming directly stabbed his deboning knife into the Iron Armor Bear’s eye!\u003c/p\u003e\n\u003cp\u003eBlood splashed from the grisly wound and the Iron Armor Bear let out an angry and painful roar. Lin Ming closed his hand into a fist and punched down on the handle like a jackhammer, and the deboning knife sunk directly into the brains of the beast.\u003c/p\u003e\n\u003cp\u003eThe Iron Armor Bear died!\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-39\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-41\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-40","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
