{"id":54359,"no":414,"title":"Chapter 412 - The Sound of Broken Jade","content":"\u003cp\u003e\u003cstrong\u003eChapter 412 The Sound of Broken Jade.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 412 – The Sound of Broken Jade\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn Blood Demon Island, within the thousand miles of the island, the entire land was covered with a hazy, thick blood-red fog all year round. This fog had magical properties. If it touched a wound, it would be like a leech that dug into a person’s body, corroding their blood essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThus, if someone were to be seriously injured on Blood Demon Island, they would quickly die if they didn’t receive prompt treatment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, the sun was high in the sky. On Blood Demon Island’s Thundercrest Sect transmission array, there was deafening thunderclap. A blaze of flames scattered out, sending several Houtian disciples that had been defending the location flying away by the forceful and intense winds. Fireshine spread its massive 100 feet long wings and shot into the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What… this… what is happening!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA disciple flew in, his eyes filled with complete disbelief as he watched the giant Vermillion Bird shoot up into the sky. What was going on? How could a Vermillion Bird have come out of their transmission array?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFireshine was far too fast. In the blink of an eye, it had already turned into a dot in the horizon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe group of stunned Thundercrest Sect disciples were left puzzled, entirely unsure of what was happening…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There’s a response from the jade slip…” Qin Ziya looked at the soul jade slip in his hand, the sliver of soul inside was dimming even further.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s most likely in that position.” Qin Ziya pointed. The soul jade slip could only make out a vague direction when it came to long distances.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Give me the jade slip!” Lin Ming received the soul jade slip, controlling which direction Fireshine was flying.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood Demon Island had a thousand mile diameter. If the jade slip could accurately indicate which direction she was in, he could quickly find Qin Xingxuan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, Lin Ming’s mind began to shake. He slowly lowered his head to look at the jade slip in his hand, and heard a ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eka ka ka\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ sound emit from it. This light ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eka ka ka\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e’ was as if the jade slip was under a tremendous pressure and was about to shatter at any moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s complexion completely changed, and his heart stopped beating for a moment. As he held the jade slip in both hands, even his fingers began to tremble.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf this soul jade slip broke, that was proof that Qin Xingxuan had died!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe jade slip slowly shook for several breaths of time, and then finally stopped. The gentle glow of the soul sliver within the jade slip had completely vanished. Qin Ziya’s face was full of lament. “Qin Xingxuan is still alive. It’s just, Xingxuan now…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Ziya didn’t continue speaking. A soul jade slip was connected to a martial artist’s soul. Even if they were physically injured, had their limbs broken or even arms cut off, the soul jade slip would not emit sounds that it was breaking!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe only reason was if the soul of the martial artist themselves was on the verge of collapsing, or if their blood essence was seriously damaged!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhatever the situation was, both of these were extremely bad results.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt could be said that Qin Xingxuan’s life was no different from a dying candle in a stormy ocean; it could disappear at any moment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s eyes flashed with a killing light filled with carnage. He silently placed the soul jade slip into his chest pocket, letting it touch his skin. He swore to himself, “Ouyang Boyan, if Xingxuan dies, I will bury your entire Seven Profound Valleys’ Ouyang Family Clan as tribute!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly, the murderous intent of Lin Ming’s body erupted like a cataclysmic volcano. Even Qin Ziya, who had a cultivation at the early Xiantian realm, felt suffocated by this killing intent, like he could drown at any time within a sea of blood. Qin Ziya thought that in the moment that Lin Ming had witnessed the dimming of the soul jade slip, it was like he had turned into a demon of war!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Vermillion Bird let out a deafening cry; flames appeared all around it, forming a swirling storm of fire. All of the blood demons around were forced to run away by this momentum that seemed to pierce the heavens, and none of them dared to approach.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were even some slower blood demons that couldn’t run away in time, and they were rapidly engulfed in these burning flames and incinerated to ashes!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………………….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, in a corner of Blood Demon Island, six martial artists were being besieged by dozens of blood demons within a clearing in the mountains.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood demons. The more people died, the more blood essence they could suck, and the more powerful they would become.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the start of the war, both sides would fight each other on Blood Demon Island. Occasionally, they would also fight blood demons. But as more and more people died, at this point, often both sides would be slaughtering blood demons!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis sort of situation could not presently be resolved. They could only wait until the end of the war, and the side that won in the end would organize a party of masters to completely clear out the blood demons.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe blood demons were only four to five feet high. They looked like humans, but they were like beasts that crawled on the ground with four limbs. Their facial features were blurred, and mostly only a big mouth and dark glowing green eyes were left behind, like a wolf stalking at night.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood demons were like sharks – they were able to sense the smell of blood. They had surrounded these six martial artists and were ready to pounce at any given moment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, every time a blood demon rushed over, they would bounce off a clear, shining barrier. Any part of their body that touched this barrier of light would be instantly charred!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Ou, if this continues we won’t be able to last much longer!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese six individuals were disciples of the Seven Profound Valleys. The one that spoke was from the Array Faction. This great array had been laid down by him in advance. Although Array Faction disciples had poor combat strength, if they were able to lay down their arrays in advance, they could play a huge role in positional battles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Senior-apprentice Brother Ou was Ou Xiong. The reason he had come to Blood Demon Island was to monitor Qin Xingxuan, and also to trap her. Since it was convenient, he would also take away all the medium-grade true essence stones that Qin Xingxuan had obtained.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for mining for medium-grade true essence stones on Blood Demon Island and killing his way through blood demons to do so, Ou Xiong had never thought of this. To him, it was not worth the risk. He hadn’t lived long enough! As a disciple of the Acacia Faction, Ou Xiong had seven or eight concubines, and also more than a dozen pleasure maids. How could Ou Xiong ever give up such a wonderful arrangement?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, when Ou Xiong saw that the disciples of the Five Element Region had obtained a Demon Blood Crystal, he couldn’t help but feel his heart stir with greed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood Demon Crystal!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a very useful treasure to a Xiantian realm martial artist. If he could obtain a Blood Demon Crystal, he would be able to exchange it for a minimum of two or three Heaven Opening Pills with the sect!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith Ou Xiong’s talent, it was unlikely he would be able to break through to the Xiantian realm. The only chance he had would be if he swallowed down three or four Heaven Opening Pills. Only then would he have a chance of stepping into the Xiantian realm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Ou Xiong’s last name was Ou, not Ouyang; who would give him three or four Heaven Opening Pills? Ou Xiong had already lost all hope of entering the Xiantian realm, but now, this opportunity had appeared in front of him. How could he not be tempted by this!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the Seven Profound Valleys, a Xiantian master was an Elder. The treatment that an Elder received was beyond that of a normal disciple. All those proud and arrogant women that had looked down on him with disdain…if he were an Elder, he could recklessly push them all down to serve his crotch!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking of this, Ou Xiong became incomparably excited. Not just that, but a Xiantian realm martial artist removed the foul Houtian air from their bodies, and their life was a hundred years longer than a Houtian real martial artist. If he had an extra hundred years of life, he could enjoy blissful days for another hundred years, and play with beautiful women for another hundred years!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThus Ou Xiong had decided to take a risk, and enter Blood Demon Island with this Seven Profound Valleys squad.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin this squad, besides Ou Xiong, there were also two Acacia Faction disciples, one Array Faction disciple, a Zither Faction disciple, and finally Qin Xingxuan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Xingxuan was in an extremely bad situation, her lips and face had already lost all traces of color. This was the result of accumulated loss of blood essence over time. Not just that, but this time, she had been sneak attacked by a blood demon and had been bitten on the right arm, having a massive amount of blood essence sucked out of her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnce a martial artist lost their blood essence, it was extremely difficult to recover!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen a martial artist lost blood essence, that also meant a loss of strength and life!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn Qin Xingxuan’s right arm, her sleeve had been completely ripped off, revealing an open wound that dripped with blood. This wound caused her life to continuously pour out of her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe blood essence within her body was being continuously corroded. With her present ability, there was no way she could prevent this from happening.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Xingxuan mirthlessly smiled; perhaps today, here, she would finally fall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if she managed to return by a stroke of luck, she would not last another month. She had lost a massive amount of blood essence, and the source of her life was like a lamp that had run nearly completely dry…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Senior-apprentice Brother Ou, the array formation will not last much longer. At most it can continue for another half an incense stick of time. We have to break through the encirclement afterwards!” The array faction disciple said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf everyone present, besides Ou Xiong who was at the middle Houtian realm, everyone’s cultivation was either at the peak Pulse Condensation period or even half-step Houtian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnly Qin Xingxuan was at the early Pulse Condensation period. Her cultivation was the lowest, and her situation was also the worst.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Break through…” Ou Xiong grit his teeth. Outside of the array formation, there were dozens of blood demons waiting to attack. There were even two higher level blood demons that weren’t much weaker than him. To break through this trap wouldn’t be easy at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Blood demons are fast. If we have to break through, we have to have some people protect the rear and stop them from following.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Ou Xiong spoke, his eyes swept past everyone and fell on Qin Xingxuan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Xingxuan’s eyes were chilling. But, the one who actually became angry for Qin Xingxuan was the Zither Faction girl. “Ou Xiong, what are you trying to say!? Junior-apprentice Sister Qin is already severely injured. You want her to bring up the rear? Are you still human!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOu Xiong callously shook his head, saying, “She cannot escape from here, her blood vitality is too weak. Whether or not she guards the rear, she will die. So if she is going to die, then why not make a sacrifice for the sect?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You…!” The Zither Faction girl’s eyes shot open, “You are shameless! Sacrifice for the sect! Maybe the one who should be sacrificed for the sect is you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOu Xiong coldly sneered, “Since that is what you think, then you can go ahead and stay with her. Do as you wish!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ou Xiong, you cruelly harm a fellow disciple and have violated the rules of the sect. Once I return to the Seven Profound Valleys, I will report this to the Elders and have them punish you for your crimes!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Ou Xiong heard these words, he frowned and his eyes flashed with killing intent. “Violate the rules of the sect? Have I killed you? Have I harmed you? I have not. Do you not want to break through? Dream on! Qin Yao, since you say so, then do not follow me when I break through this encirclement, you can stay with Qin Xingxuan!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Zither Faction girl shook with rage. She turned to look at the other disciples but found that they were avoiding her eyes. In a life or death situation, they would first think of themselves. Who would still bother to care for the fate of others?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf everyone present, the one with the highest cultivation was Ou Xiong. With Ou Xiong, they had a slim hope for survival. Without him, they would undoubtedly die.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOu Xiong looked at Qin Xingxuan and sent her a true essence sound transmission, “I really feel sorry for you. You are beautiful and talented, just don’t take this personally. You’ve lost your blood essence. Even if you can escape from here, you won’t last another month. And for you, escape is simply not possible. So, I have a pill here for you. This is a Blood Burning Pill. It can stimulate all the potential in your body. Once you eat it and you guard the rear, I can guarantee that your Qin Family will be safe. You should know that Elder Ouyang wants to deal with you and the Lin Family – he simply doesn’t care for the Qin Family.” As Ou Xiong spoke, he handed Qin Xingxuan a blood-red pill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Zither Faction girl saw Ou Xiong give this pill to Qin Xingxuan, her complexion immediately hung. “Blood Burning Pill! Junior-apprentice Sister Qin, do not take it, this is simply a suicidal pill!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOu Xiong glanced at the Zither Faction girl and sneered. He continued to speak through a true essence sound transmission, “Junior-apprentice Sister Qin, I am willing to take an oath on my heart of martial arts. As long as you can bring up the rear when we break out, I will guarantee the safety of your family. Although my promise is not too valuable, it is still an oath that I make. I won’t damage my heart of martial arts just for the lives of a few mortals. Much less, I have no enmity with your Qin Family.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-411\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-413\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-412","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
