{"id":54365,"no":420,"title":"Chapter 419 - Take Your Life","content":"\u003cp\u003e\u003cstrong\u003eChapter 419 Take Your Life.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 419 – Take Your Life\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the center of the white marble stage, a sword light flashed, and a Seven Profound Valleys disciple gave a miserable cough as he was sent flying off the stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Fierce Flood Sect’s Liu Xuan, victory!” The referee deeply looked into Liu Xuan’s eyes as he announced the result.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Fierce! This Liu Xuan has won three continuous matches!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“And he still has strength remaining.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The younger generation is really spilling forth with heroic elites. Liu Xuan, Ye Tian, Zhang Yan – all are more powerful than the last.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“But the truly fierce ones are the masters of the Seven Profound Valleys. The ones that have followed Liu Xuan up are the inner court disciples. Although they lost, the difference between them isn’t too great. If the Seven Profound Valleys’ core disciples or direct disciples enter the stage, then I have no idea what those battles will be like!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA disciple sighed. Everyone couldn’t help but glance over at Ouyang Ming, and were surprised to see that he had a clear, dreamy expression on his face as if he simply didn’t care about these fights that were occurring onstage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eObviously, battles of this level – even those including Liu Xuan – simply didn’t enter Ouyang Ming’s eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThose who glanced at him to gave birth to an an extremely deep and profound feeling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Just how far does the degree of Ouyang Ming’s strength reach?” Some people couldn’t help but ask.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I cannot fathom. In short, all I can tell is that he is surpassingly strong. Perhaps he is even stronger than our sect’s Sovereign.” The one who spoke was a disciple from a small sect. His sect’s Sovereign had already reached the peak Houtian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Stronger than your Sovereign? Isn’t that just too exaggerated!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Ouyang Boyan was sitting atop the main island, watching the stage as the battles progressed and listening to the sounds of gently instruments float to his ear. He had a very enjoyable expression on his face, as if he was taking in all the luxuries of life. He had beautiful women swaying by his sides. These were his concubines and his maids. As these beautiful women weaved around him, it was a truly beautiful sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eToday was the happiest day Ouyang Boyan had ever experienced.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had died. Qin Xingxuan would suffer a miserable and painful death. The Qin Family and Lin Family, both would be destroyed. And soon, Qin Ziya would quickly be penalized. All of Ouyang Boyan’s thoughts were smooth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNot just that, but during this banquet there was even a second-grade sect that had offered him 12 Pure Yin girls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese 12 Pure Yin girls had to have a talent above the third-grade and also be below 20 years of age. And most importantly, they also needed to be beautiful, virgin women. The most demanding requirement was their date of birth; it was extremely difficult to collect these 12 girls. Initially, Zhang Guanyu had offered a batch of 12 Pure Yin girls to Ouyang Dihua for his assistance. And, the final result of this was that Ouyang Dihua had instead lost his own life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e12 Pure Yin girls were extremely beneficial to one’s cultivation of the Divine Acacia Power. Ouyang Boyan had already looked over these 12 young and beautiful girls and he was extremely satisfied by what he saw. Tonight, he would take their virginity and use it to enhance his own cultivation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking of this, Ouyang Boyan’s thoughts began to heat up with lust; his mind had already drifted onto the bodies of those 12 beautiful girls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut at this moment, a flame suddenly lit in front of him. It was a sound transmitting talisman.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan heard the message from this sound transmitting talisman and was shocked, “Someone from Divine Phoenix is forcing their way into the Seven Profound Valleys?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan doubted this for a moment, and then heard the clarion cry of a phoenix. Ten miles away, a massive Vermillion Bird cut through the skies, leaving a path of flames that burned the heavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan stood up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Vermillion Bird was the absolute symbol of Divine Phoenix Island. If one saw a Vermillion Bird, they would know without a doubt that it was Divine Phoenix Island. But, why would someone from Divine Phoenix Island come to the Seven Profound Valleys? They couldn’t be coming to congratulate him right? Divine Phoenix Island had countless Xiantian masters. To them, Ouyang Boyan who had just broken through to the middle Xiantian realm wasn’t even worth a fart. So how would they possibly come here to celebrate?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone present also saw the massive Vermillion Bird approaching. No one was allowed to fly over the Seven Profound Valleys’ entrance, but no one dared to stop this Vermillion Bird!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming flew straight towards the Profound Sky Mountains. There were several small spirit boats that approached him, wishing to inquire about who he was, but they were instantly thrown off by Fireshine. Fireshine’s speed was even quicker than a Revolving Core master.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Heavens! Is that a phoenix!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“A phoenix! I’m not seeing things!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s coming down! It’s coming down!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeveral thousand pairs of eyes were wide as they stared into the sky. Everyone stood. Most of the people present were only from second-grade sects, when could they ever witness the advent of a Saint Beast!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey could not distinguish the difference between a phoenix and a Vermillion Bird.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA 100 foot long wingspan and a body entirely wreathed in roaring flames; strong gales formed a vortex, making it difficult to breathe for everyone below. Fireshine closed its massive wings, and looked down on the world with utter impunity as it dropped straight down!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFlames combusted in all directions. Fireshine fell directly onto the middle of the lake island, and the hot streams of fiery wind smashed away all the furniture. Those martial artists with weaker cultivations were even forced back several steps by this strong wind!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of those present were frightened. Fireshine was Mu Yuhuang’s Vermillion Bird. It was a grown Vermillion Bird. Compared to Mu Qianyu’s Little Flame, it was over double the size!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is that Divine Phoenix Island’s envoy?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Divine Phoenix Island also sends congratulations to Elder Ouyang? Elder Ouyang’s face is truly great!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe many disciples of the Seven Profound Valleys were excitedly speaking amongst themselves. They assumed that the reason Divine Phoenix Island had sent an envoy here was to congratulate Ouyang Boyan. This sounded improbable, but during the last Seven Profound Valleys’ Total Faction Martial Meeting, Divine Phoenix Island had also sent an envoy to visit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn their limited worldview, it was possible that Divine Phoenix Island would send someone to congratulate Ouyang Boyan for breaking through to the middle Xiantian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, Ouyang Boyan never entertained such a fanciful idea. His expression was solemn, and his eyes had already turned onto the several figures that were being carried on the Vermillion Bird’s back…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA youth jumped down. In that moment, every single Seven Profound Valleys disciple fell silent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeveral thousand eyes turned their gazes towards this youth, completely stunned.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis person wore black clothes, and his long hair was recklessly scattered. He held a deep purplish-red long spear in his hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis handsome face seemed as if it was hewed by a saber, and his two straight eyebrows slanted up. His eyes were deep and profound as if they contained the endless night sky! He only stood there, but yet a giant, invisible wave of pressure rushed out from him like a tide; even those people hundreds of feet away could clearly feel this aura. It caused them to find it hard to breathe and their hearts to palpitate!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, that youth standing in the center of the square was like a heavenly God of War.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who is that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe second-grade sect disciples began to speak amongst themselves. They had heard Lin Ming’s name, but they had never seen Lin Ming before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the Seven Profound Valleys’ disciples were bewildered. Many of them subconsciously rubbed their eyes, thinking that they were hallucinating.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was really Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe hadn’t died!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming’s face had completely changed. The calm smile of before had vanished, replaced by a deep awe and reverence that stemmed from the depths of his being. He would never forget the events of a year and a half ago. At the Total Faction Martial Meeting, the early Pulse Condensation period Lin Ming had completely defeated him, he didn’t even have the slightest bit of ability to resist!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, over a year had passed, and Ouyang Ming had reached the early Houtian realm. He once believed that Lin Ming had died, but never thought that he would stand in front of him here today. Not just that, but his cultivation had risen to the late Houtian realm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn just a year and a half, Lin Ming’s cultivation had risen by an entire realm and half!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt the beginning, Lin Ming’s cultivation was weaker than Ouyang Ming’s. But presently, Lin Ming had cast Ouyang Ming far behind!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf a early Pulse Condensation period Lin Ming already had the ability to defeat the peak Pulse Condensation period Jiang Baoyun, then how terrifying was the current late Houtian realm Lin Ming?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould he have strength equal to the early Xiantian realm?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming only felt his mind tremble, he no longer dared to imagine the possibilities!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan’s eyes fiercely twitched, his fists tightening and his palms sweating.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming hadn’t died!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhy!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhy didn’t he die!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNot only was he alive, but his cultivation had actually reached the late Houtian realm! In just a year and a half, how could this have happened!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan screaming in his heart!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe hated!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was unwilling!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe feared!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was impossible that Lin Ming hadn’t discovered what he had done these past months. Perhaps Lin Ming might not be able to threaten him with his current strength, but what about later?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf his growth continued at this breakneck speed, then in a year, Lin Ming might even be able to kill him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen that time came, he couldn’t count on anyone in the Seven Profound Valleys raising their head to defend him. Under the suppression of absolute strength, even the Seven Profound Valleys would not hesitate for a second to sacrifice him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat meant all he could do was escape. If he stayed in the Severn Profound Valleys, all that awaited him was death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan coldly looked at Lin Ming. He did not do something foolish or useless like apologizing. In the moment that Lin Ming had dropped down, he was able to feel the thick and overwhelming killing intent surging from his body. Ouyang Boyan knew that Lin Ming had already resolved to kill him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnfortunately, Lin Ming was far too impulsive. If he had just patiently waited for another year, then he really might have been able to kill him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, many thoughts flashed through Ouyang Boyan’s heart. He didn’t lose his calm. Instead, he stood there steadily like a tree.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Elder Ouyang! How have you been since we last met? I hope you’ve been well!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s expression was blank as he spoke. But, his voice was like a cold wind that billowed up from the ninth layer of the abyss. The entire atmosphere of the banquet suddenly chilled to subzero degrees.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany of those who were from second-grade sects didn’t know who this youth was standing before them. But what they could understand was that this person absolutely did not come to congratulate them, but instead to ruin the scene!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWho was this? He dared to force his way into the Seven Profound Valleys? But looking at the Saint Beast, this youth was definitely not common. Perhaps he came from some large family clan or sect. Many of those in the Seven Profound territory only knew that the greatest power was the Seven Profound Valleys – they didn’t know the existence of Divine Phoenix Island. This wasn’t surprising. After all, only those that stood at the top would be exposed to a greater world. Initially, Lin Ming hadn’t known of Divine Phoenix Island’s existence either.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan’s expression was ugly. He wanted to smile, but eventually stopped trying. “You are not here to celebrate with this old man!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming held his spear down, and lazily traced a full moon on the white marble square. He chuckled, and then slowly and unhurriedly said, “Of course not. I’m here to take your life!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith this sentence, the entire audience was shocked. Most of the Seven Profound Valleys disciples didn’t know that Ouyang Boyan had enmity with Lin Ming. As for those second-grade sect individuals, they didn’t even know what Lin Ming looked like, let alone something like that.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Take Ouyang Boyan’s life!? Did I hear wrong?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one was able to understand what was happening. This was the Seven Profound Valleys’ domain, and someone dared threaten to take the life of a Seven Profound Valleys Elder? Were these words that a normal person would say?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNot just that, but this youth’s cultivation was only at the late Houtian realm. Even though his momentum was formidable, just what would he able to do?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven Ouyang Ming, who acknowledged Lin Ming’s strength, also felt that Lin Ming was being naïve. With so many Acacia Faction Elders present, how could Lin Ming possibly kill someone in front of them? In fact, he probably wouldn’t be able to defeat Ouyang Boyan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eQin Ziya forced a smile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUltimately, it seemed that they couldn’t escape this result…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-418\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-420\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-419","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
