{"id":54367,"no":422,"title":"Chapter 421 - Sweeping All Away","content":"\u003cp\u003e\u003cstrong\u003eChapter 421 Sweeping All Away.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 421 – Sweeping All Away\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s strength had already exceeded the scope of understanding of every martial artist present. All of the young heroic elites present that thought to display their skills during this banquet competition suddenly realized that compared to Lin Ming, they were no more than little ants crawling around.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was younger than them, and the difference in their strength was like the heavens and earth; how could they still live knowing this?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time in the center of the square, the Acacia Faction Elder Ouyang Guang was bleeding from his nose, and his face was red all over. Previously he said that he would show Lin Ming just how strong a Xiantian realm master was, but now, in just a few moves, he had been injured to the point of bleeding from his nose.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn front of a group of juniors, Ouyang Guang had disgracefully lost!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s spear shook, and the Purple Comet Spear was pointed directly towards Ouyang Guang’s head. The spearpoint began to twinkle with lightning!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Guang’s face turned liver-red, this Lin Ming had gone too far!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor someone as noble and respected as Ouyang Guang, what he most valued was his face. But now, he was actually being provoked by a junior who was pointing a spear at his face!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnd on top of that, what was most atrocious was that he couldn’t stop Lin Ming. If he tried to attack him again, the result would be the same!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was slapping him on the face, this was simply slapping him again and again and again on the face!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Good! Very good!” Ouyang Guang trembled with rage, “What are you all doing standing around like stunned idiots! Are you planning on letting this rampant boy strut around however he wants!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Ouyang Guang no longer cared about what face he had left. He waved his hand, calling all the Acacia Faction Elders to join together.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, The Acacia Faction’s pride had already been demolished by Lin Ming. If they didn’t brace themselves and act together, then maybe their Acacia Faction might not even have the face to stay in the Seven Profound territory anymore.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were five Acacia Faction Elders that came to attend this banquet celebration. Besides Ouyang Guang and Ouyang Boyan, the rest of them were at the early Xiantian realm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor five Elders to surround and besiege a junior, let alone the Acacia Faction disciples, even the martial artists from other small sects felt their faces burn with shame.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………………………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Ming looked at the scene in the center of the square and felt tense. He could no longer watch this. “Send a sound transmission to the Sovereign. Have the Sovereign leave seclusion! Or else our Acacia Faction will be demolished by Lin Ming!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Ouyang Ming helplessly spoke, he was already completely numb to Lin Ming. A year and a half ago, he had seen the early Pulse Condensation period Lin Ming defeat the peak Pulse Condensation period Jiang Baoyun. Although this was undoubtedly amazing, he could still accept this reality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust a moment ago, with just a cultivation at the late Houtian realm, he had managed to defeat the middle Xiantian realm Ouyang Guang. This was simply unbelievable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow, he would resist the combined strength of five Great Elders by himself!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Lin Ming, oh Lin Ming, just how much will you rampage until you are willing to give up?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……………………..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Soul Severing Blood Skull!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the square, Ouyang Boyan had also joined the battle. With a single move of this Soul Severing Blood Skull, half the square was instantly covered with brilliant purple flames.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBehind Ouyang Boyan, two newly promoted Acacia Faction Elders used Life Severing Bone Blades, blocking off all directions that Lin Ming could dodge in!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSoon after, Ouyang Guang used the Purple Flame Bone Lance once more. The Purple Flame Bone Lance and Ouyang Boyan’s Soul Severing Blood Skull fused together, creating an overwhelming blood wave that swept down from the sky!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis blood wave was monstrous, it was as if the void itself were tearing apart. The five Elders had gone all out in their attacks!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, they had thrown away any face they had left. For this, they were prepared to make any sacrifice. If they couldn’t defeat Lin Ming here, their Acacia Faction would never be able to walk out in the light of day!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the five Xiantian Elders joining their attacks together, an incomparably formidable power was created. The martial artists present could only feel their blood essence swell up, as if their blood itself was being attracted towards the center of the stage and wanted to break out of their bodies. This was an extremely discomforting feeling!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMany martial artists couldn’t help but conjure up all the true essence of their body to resist the deadly corrosive effect that the aura of this attack was having on their blood and soul.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s too strong!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Truly worthy of being a joint attack from five great Xiantian Elders. If just the aura itself is so strong, how could anyone possibly defend against this!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFacing this turbulent attack that was like the raging waves of the sea, Lin Ming’s expression sank.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTempering Marrow true essence erupted!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the Purple Comet Spear, the Divine Demon Thunder Soul and Fallen Star Flame Flame Essence madly howled. A series of popping sounds exploded from within Lin Ming’s body. Behind Lin Ming, a solid, lifelike phantom of an Azure Dragon appeared. Flames converged, thunder roared!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBerserk true essence erupted like a volcano!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThunderfire Annihilation!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming thrust out his spear, and a terrifying power of thunder and fire exploded out, echoing in the air. In that instant, it seemed as if the world itself had lost all color!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA blinding light obscured the vision of everyone present. In that moment, the thunderous sound left everyone deaf. The power of thunder and fire surged out like a massive tsunami, and the waters of the lake raised into rough waves dozens of feet high, causing all the nearby pavilions to crash down; every banquet table was overturned! Every nearby martial artists was sent flying back! And some of them who were weaker vomited blood and then crashed onto the floor, unconscious.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe competition square was located on the main island, thus, most of the disciples present were from the Acacia Faction. That they had to bear the full brunt of this attack was just their bad luck. In comparison, the martial artists from small sects had an insufficient status and were stationed on the nearby islands. They all began to count their lucky stars for being able to avoid this catastrophe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePlop! Plop! Plop! Plop!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDozens of Acacia Faction disciples that had been sent flying backwards landed in the lake. The entire island was in a state of absolute chaos!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter the blinding flash of light passed, the entire square was in confusion. In the center of the square, there were only three individuals left standing. Lin Ming, Ouyang Boyan, and Ouyang Guang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs for the other three early Xiantian realm Acacia Faction Elders, their bodies were lying still on the ground, on the verge of death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the might of his spear, Lin Ming had struck down three great Xiantian Elders!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the martial artists that had their bearings saw this, they sucked in a breath of cold air. Qin Ziya was shocked, and even Qin Xingxuan behind him had the same expression plastered on her face. She knew that her Lin Ming was extremely strong, but she never imagined that it would be to such a terrifying degree. No wonder Lin Ming had dared to single-handedly storm the gates of the Seven Profound Valleys’ Acacia Faction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming gripped the Purple Comet Spear, the spear pointed towards the ground. His long hair was blown up by the waves of true essence, recklessly floating in the wind. At this time, his appearance was no different from that of a God of War .\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Ouyang Guang faced Lin Ming, he unconsciously took several steps back. His lips trembled, and a deep fear arose from his scattered mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWas this really strength that a human could possess? At 17 years of age, this Lin Ming had resisted a combined attack from five Xiantian Elders! Not only that, but three of them had been severely injured!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Die!” Lin Ming didn’t intend to give any of them a chance to catch their breath. His feet trod the ground, and he shot forwards, his spear stabbing towards Ouyang Boyan!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe normally cold and gloomy-looking Ouyang Boyan now only had an expression of utter fear on his face. He realized that if he was unlucky today, he might really die here!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUnder the threat of imminent death, Ouyang Boyan punched himself in the chest, forcing out a mouthful of blood and then spraying it on his own treasure sword. The originally blue treasure sword had turned an eerie blood red after absorbing the blood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was a move from the ‘Divine Acacia Power’ that damaged one’s cultivation and required the steep price of blood essence to use! Once he used it, it would be difficult to recover the damage to his origin energy, and it would take at least a year to recover. As for his blood essence, that was forever lost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan did not have Vermillion Bird blood essence, nor did he have the secret techniques of Divine Phoenix Island to transplant blood essence. Once he lost blood essence, he would never be able to recover it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter he used a move that cost him a part of his life and cultivation, Ouyang Boyan’s expression was fierce and grim. His face was a deep, vivid red, as if he had been possessed by a demon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan already hated Lin Ming to the marrow of his bones, he wished to kill him as quickly as possible!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming, you die here!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA sword slashed down. The sword blade became increasingly bright red, as if it were dripping fresh blood. Horrifying screams filled the air. Sword energy howled, and monstrous waves of blood covered the skies!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eCa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan stabbed out with his sword. The crimson sword formed a crimson storm. The marble tiles under his feet once again shattered, flying into the sky. Wind swirled around the sword, creating a long red line that directly shot towards Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming sneered. The Divine Demon Steel Needle fused into the Purple Comet Spear. Spear and thunder became one, arcs of lightning crazily sizzled!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Blood Extinguishing Demon Thunder!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming thrust out his spear, and his entire body emitted explosive crackling sounds. The Purple Comet Spear was enveloped in a thick red electric python. It howled as it struck the crimson storm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHong hong hong!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA series of explosions split the air. The crimson storm was constantly being torn apart and shredded by the power of thunder. At the same time, the red electric python also melted. Ouyang Boyan had burned his own blood essence as the price to make this desperate attack, and he was actually able to evenly match with Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was a bit surprised. Immediately, he turned his spear and the Blood Extinguishing Demon Thunder instantly shrank into the Divine Demon Steel Needle. It found an opening and pierced into the crimson blood storm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming and Ouyang Boyan were locked in a desperate struggle, they didn’t have much strength left over to do much else. The scarlet blood storm that managed to approach Lin Ming was burnt away to nothing by the raging power of the Fallen Star Flame.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMeanwhile, the Divine Demon Steel Needle had reached Ouyang Boyan’s front!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Ouyang Boyan saw a small flash of light, his heart was incomparably shocked. He revolved his protective true essence to the limit, and countless purple flames emerged from his body, covering him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this point, the purple and red Divine Demon Steel Needle mercilessly stabbed into the purple flames. With a small sizzle of electricity, it penetrated through the protective purple flames!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn that moment, Ouyang Boyan felt like his spirit had left his body; he could clearly feel the breath of death approaching him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis bodily true essence protection was able to resist for just a moment. Then it was completely burnt away and disappeared by the power of thunder. In this critical moment, Ouyang Boyan yelled out, and reached out a hand to grab the Divine Demon Steel Needle.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ahhhh!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Ouyang Boyan stretched out his left hand and grabbed the Divine Demon Steel Needle, his left hand was instantly charred black, and the blood and energy within his arm were rapidly absorbed by the Divine Demon Thunder Soul through his meridians. In that instant, Ouyang Boyan’s left arm had withered down to nothing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan’s eyes filled with blood. Without hesitation, he sliced off his own left arm. Blood spurted out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA shriveled arm fell onto the floor like a slab of overly cured bacon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs everyone on the island saw this, they fell into absolute silence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA lost arm!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOuyang Boyan was disabled!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA severe wound and a disability were two entirely different concepts. In many cases, to a martial artist, when their arm was cut off it wasn’t much different than killing them!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore this, many of those present had subconsciously thought there would be a little bit of drama and a nice play before matters settled. Although Lin Ming would be able to show off his strength, in the end he wouldn’t be able to do much to harm Ouyang Boyan. But now, it seemed as if this banquet celebration was about to become a battlefield of spilled blood!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming coldly sneered. In order to stop his blood essence from leaving his body, Ouyang Boyan had cut off his own arm. These Acacia Faction martial artists were truly decisive when it concerned their survival.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“But how will you defend against my next attack?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming flexed his fingers. The Divine Demon Steel Needle that had forced Ouyang Boyan to cut off his own arm appeared once again. With a flick of his fingers, it rushed towards Ouyang Boyan!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, Ouyang Boyan’s hair was disheveled. His left arm was gone, and he was charred all over and dripping with blood. As he saw the Divine Demon Steel Needle approach in his own eyes once again, his eyes began to glaze over with the color of dying despair.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs long as this needle pierced him, he would die!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this moment, a loud shout rolled out like thunder, “Stop!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-420\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-422\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-421","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
