{"id":54400,"no":455,"title":"Chapter 454 - The Title of Blood Demon","content":"\u003cp\u003e\u003cstrong\u003eChapter 454 The Title of Blood Demon.\u003c/strong\u003e\u003c/p\u003e\u0026nbsp;\u0026nbsp;\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 454 – The Title of Blood Demon\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the midst of the battlefield, Lin Ming held the Great Desolate Blood Halberd. The 10 foot long blood halberd extended straight out. The two foot long blade edge gleamed with a cold light, and the pole was like a thick python.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt that moment, the figure of Lin Ming standing there was like a deadly halberd. His aura was staggering and his flowing murderous intent was breathtaking!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of the surrounding martial artists trembled at this presence. If Lin Ming had just barely managed to defend against Xuan Chang’s probing strike, they would have been able to accept that. But now Xuan Chang had used a martial skill and Lin Ming had still blocked it, instead forcing Xuan Chang to take several steps back. This was simply unbelievable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had to be known that Lin Ming’s cultivation was more than an entire boundary worse than Xuan Chang’s!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could such a person have been unknown and unremarkable all this time?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eViolet Rain bit her lips, her eyes shining, “Captain, has Wild Halberd been hiding his cultivation?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFire Ax was silent, hiding his cultivation? If Wild Halberd wanted to hide his cultivation in front of them, that could only be possible if his cultivation was higher. But now, it looked like even Xuan Chang had recognized that Wild Halberd was a Houtian realm martial artist. Could Wild Halberd be a Revolving Core Supreme Elder? But why would a Revolving Core master hide amongst them? Was it for fun or something?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFire Ax’s eyes were radiant as he looked at the Great Desolate Blood Halberd in Lin Ming’s hands. He whispered, “Maybe Wild Halberd is the Blood Demon…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHearing Fire Ax’s hypothesis, Violet Rain was shocked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBlood Demon?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYes, Wild Halberd’s might match the strength that the Blood Demon was rumored to have. Also, Wild Halberd and the Blood Demon appeared on South Aurora Island at nearly the same time. With both of these truths combined together, it meant that Wild Halberd and Blood Demon were almost certainly one and the same!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, not only did Fire Ax make this guess, but the Demon Region’s Big Three, Lu Huo, and other perceptive martial artists also thought of this.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLu Huo’s eyelids fluttered. If Wild Halberd was the Blood Demon, then was it possible to have Wild Halberd take the lead and engage with the South Sea Demon Region in a final life or death showdown?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if they had the Blood Demon on their side, this battle would still be dancing upon the razor-thin edge of death!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut if they didn’t fight, wouldn’t they perish anyway?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNightmare’s lips moved as he sent Xuan Chang a true essence sound transmission.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang frowned, Blood Demon?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe wasn’t satisfied with this answer. Where did Blood Demon come from? How could such a ridiculous genius randomly appear out of thin air? He had to have some sort of origin, unless he was a martial artist who came from a distant land.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Blood Demon’s cultivation method was absolutely a top cultivation method of the demonic path. In that one collision a moment ago, the energy within wasn’t too great, but that strange rotating power made Xuan Chang feel as if he was unable to resist at all. This cultivation even surpassed the legacies of the South Sea Demon Region!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he took one step back and thought about it, there was only a single talent within the South Horizon Region that could compare to a genius like this, and that would be Divine Phoenix Island’s Lin Ming. Both of them were at the late Houtian realm, and both also had such outrageous combat strength…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMm, could it be…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking this, Xuan Chang’s eyes widened.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he thought of Lin Ming, even Xuan Chang felt frightened. A year ago, Lin Ming had defeated Xuan Ji, who had disguised himself as Lei Mubai!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Ji was the most radiant and outstanding talent that had appeared in the South Sea Demon Region for the last several hundred years. He reached the Houtian realm at a mere 17 years of age, and he also had the perfect Giant Demon bloodline. His talent was almost at the eighth-grade, and he also had an extremely high thunder origin energy fusion compatibility. He cultivated the ancient Devil Tome’s Halberd Arts, and with his just Houtian cultivation, he could defeat an early Xiantian martial artist from a large sect!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAgainst Xuan Ji, Xuan Chang simply didn’t have the courage to compete. But this sort of monstrous genius was actually defeated by Lin Ming, who had even jumped realms in order to do so!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf this Blood Demon was Lin Ming…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It shouldn’t be possible. Lin Ming uses a spear and Blood Demon uses a halberd. Not just that, but there is a great stylistic difference in their cultivation methods. Blood Demon practices a top demonic path cultivation method, but Lin Ming practices Divine Phoenix Island’s cultivation method…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘No matter where this fellow comes from, as long as I can kill him here today, I will be able to forever rid myself of this future calamity!’ As Xuan Chang thought this, his entire body flowed with true essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNetherworld Devil Arts – Universe of Bloody War!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Netherworld Devil Arts was the original cultivation method that the Netherworld Great Emperor had used to become infamous. Although it was inferior to the ancient Devil Tome, it wasn’t that much worse. With Xuan Chang’s cultivation as an extreme Xiantian warrior, he would undoubtedly be able to display the formidable power of the Netherworld Devil Arts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly, waves of surging blood appeared. All of the surrounding space was filled with the thick energy of blood, and some weaker martial artists felt extremely ill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf the shockwave was so powerful, then facing this head on would truly be an inconceivable terror.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s vision was profound; he stimulated his Tempering Marrow true essence to the limit. In this battle, he wouldn’t be able to hold back at all. Perhaps even his status would be revealed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang waved his halberd. True essence wrapped around the waves of blood, rushing towards Lin Ming, breaking the earth wherever it went.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Blood Seal Twisting Murder!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming clenched his right hand and stabbed out the Great Desolate Blood Halberd with indomitable momentum! Atop the blood halberd, 13 blood seals crazily spun around.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was still a spinning force, except this time it was spinning outwards.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis halberd strike that contained a spiraling power was like a thin steel needle as it tore apart the waves of blood, dispersing them all. This was the inherent style of the ‘Great Desolate Halberd Art’. If it wasn’t for the Blood Drinking Seal’s spinning power, Lin Ming would have to spend at least twice the true essence to scatter the waves of blood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? This style…!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang was shocked. Even the ancient Devil Tome’s Halberd Arts was left in the dust in terms of the exquisiteness of the technique.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Xuan Chang saw Lin Ming’s halberd piercing towards him with a spinning force, he quickly raised his halberd to block. But at this moment, an amazing scene took place. Lin Ming’s halberd seemed to penetrate through the space itself, instantly arriving in front of Xuan Chang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘What!?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang’s expression completely changed. At this life or death moment, he gnashed on his tongue, “Explode!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWaves upon waves of blood instantly blew up. Many surrounding martial artists were sent flying back in the air, several of them spitting out blood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Be careful!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Withstand it! Do not step back!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe martial artists quickly intensified their protective true essence. At this time, everyone would rather withstand the explosive waves of blood and be injured than escape to the periphery of the group. Who knew what sort of invisible space cracks were around them. If they stepped into a space crack, that meant certain death!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA massive amount of bloody fog filled the air, shrouding Lin Ming and Xuan Chang within. No one could see or hear within; even perception was being torn apart by the spiraling power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of the martial artists felt their heartbeats quicken in nervousness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Die!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the bloody fog, Xuan Chang swept his halberd towards Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t say a single word as he similarly swept his halberd.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the blade!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e13 crimson blood seals blocked Xuan Chang’s halberd blade, grounding it in place.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? This is…” Xuan Chang felt as if someone had poured molten metal onto his halberd; there was a great resistance that acted on it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this moment, Lin Ming thrust his halberd towards Xuan Chang.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Humph, explode for me!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTrue essence erupted, washing away all of Lin Ming’s Blood Drinking Seals. Xuan Chang howled, raising his halberd and slicing down at Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eClang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo halberds crossed. Lin Ming felt a strong force transmit through him and his right leg pushed down, crushing all the rocks beneath him. He was forced a step back, the blood in his body tumbling.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eChi-la!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe clothing on his chest was ripped apart, exposing his smooth and firm muscles. There was also a layer of bloody energy attached to him, constantly corroding Lin Ming’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis bloody fog… Lin Ming’s inner true essence vibrated, scattering all the bloody fog. He looked up and saw Xuan Chang take a step back; his situation was much better than Lin Ming’s.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIndeed, if Lin Ming didn’t open the Heretical God Force, then in terms of absolute strength he would be inferior to Xuan Chang. However, facing so many enemies at the same time, Lin Ming didn’t dare to rashly open the Heretical God Force.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is tricky!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s eyebrows tightened. He did have a lot of final master moves he could use, but he didn’t dare to use any of them casually. Any one of those moves consumed a great deal of energy. If he had to use it, he must ensure that Xuan Chang would be severely injured; otherwise he would be in danger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang looked at Lin Ming, his heart becoming increasingly perturbed. ‘Just what cultivation method is this? Is this the legacy of some other great demonic path sect?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘The Blood Demon’s style is extremely bizarre. It has many similarities with the ancient Devil Tome, but it seems to be even stronger than the ancient Devil Tome!’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking this, Xuan Chang’s heart suddenly shook!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould it be…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he carefully looked at the Great Desolate Blood Halberd in the Blood Demon’s hand, it looked exactly the same as Xuan Ji’s. Not just that, but although the cultivation method that the Blood Demon used was different from the ancient Devil Tome, it was truly somewhat similar! It was as if… as if his cultivation method was derived from the ancient Devil Tome, a higher evolution!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould it be that… Lin Ming had obtained Xuan Ji’s Great Desolate Blood Halberd and also the first layer of the ancient Devil Tome cultivation method, and then proceeded to independently practice and perceive its secrets to this degree???\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHeavens!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDid he improve upon the cultivation method of an ancient Supreme Elder? Just what sort \u0026nbsp;of monstrous perception was this, to be able to improve the cultivation method that an ancient Supreme Elder had created!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking of this, Xuan Chang’s complexion completely changed, and beads of sweat began to roll down his forehead. He was simply stunned by Lin Ming’s monstrous talent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNightmare, Blood Bone, and Viper were all unclear as to why Xuan Chang’s expression had changed so suddenly. It was as if he had just discovered something terrible a moment ago…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe surrounding martial artists also weren’t clear as to what was happening.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang’s complexion became increasingly grim and solemn. If this Blood Demon truly was Lin Ming, then he must kill him now! Otherwise, with Lin Ming’s monstrous perception and talent, he would probably be able to instantly kill him in another six months!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis sort of person was an abnormal being that couldn’t be stirred up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut, the key of all this was – could he kill Lin Ming?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough Xuan Chang also had many finishing blows he hadn’t used, he was aware that Lin Ming had even more methods!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he was stronger than Lin Ming by a bit, then with the help of the Demon Region’s Big Three he could suppress Lin Ming. But if Lin Ming turned around and escaped, in this world with space cracks everywhere, stopping him would be hard!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he rashly pursued him into a space crack, he would lose his head!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf he couldn’t chase and kill Lin Ming, and Lin Ming found an exit, then that abnormal youth could find a place to cultivate for a few years. In the meantime, Xuan Chang would be living in constant fear and unease, until the day that Lin Ming returned to kill him!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang suddenly found that he had jumped on the tiger and could no longer back down; just what should he do?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Nightmare saw Xuan Chang’s ugly complexion, he couldn’t help but ask with a true essence sound transmission, “Sir Envoy, this person is a bit tricky. Would Sir Envoy permit me to help in secret? Although I cannot deal with him alone, I can use my soul force to secretly attack his spiritual sea. I have complete confidence that I will be able to slow or restrain his movements. When that happens, Sir Envoy can kill him with ease!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXuan Chang’s heart stirred. Nightmare excelled at soul attacks, this plan was indeed feasible. If he was successful, he could stop Lin Ming from running. But… this was a gamble. Should he make this gamble or not?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"margin: 8px 0px\"\u003e\n \u003cp\u003e\u003c/p\u003e\n \u003cp\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-453\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-455\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-454","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
