{"id":54445,"no":500,"title":"Chapter 499 - Old Dog","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 499 – Old Dog\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who is it!?” In that moment, Lin Ming felt as if his soul had frozen. He suddenly jumped up like an arrow, twisting around with the Great Desolate Blood Halberd in front!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was just an instinctive reaction. He was well aware that if any one of those old Life Destruction fellows came back, they could easily kill him with a flip of the hand!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the cave was empty behind him, with not a soul in sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming felt a cold sweat trickle down his back, his mind vigilant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though he opened all of his perception, he couldn’t see a single person.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWere they hiding?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the strength of those old masters, it simply wasn’t worth it to do this. If they did, then it was just a mindset of a cat wanting to play with a mouse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boy, there is no need to look, you cannot find this Saint. However, this Saint is also very surprised. Although you’re just a little baby boy, you managed to put that group of 1000 year old men into such a miserable state. It really… is to this Saint’s liking!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You…” Lin Ming was shocked, his mind racing. This Saint!?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven those old Life Destruction masters didn’t proclaim themselves as a Saint. Such an arrogant and proud name…he feared that only an Emperor level powerhouse would dare to call themselves such!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe old voice echoed in his mind. This was either a true essence sound transmission, or… this voice was coming from his own spiritual sea!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming thought of this, he was suddenly shocked. Could it be…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You are the Demon Emperor!!!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Demon Emperor? Heya, this Saint is not him!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You aren’t?” Lin Ming was stunned. He was certain that this old voice was the remnant consciousness that was left within the Demon Emperor’s soul fragment, so how could it not be the Demon Emperor? “You are that red dog that was contained in the Demon Emperor’s soul fragment?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Dog!? You actually dare to call this Saint a dog!?” The old voice seemed to suddenly stir, and then Lin Ming felt a fierce struggle in the sections of his spiritual sea that he had used to seal away the red dog. Lin Ming felt a throbbing pain in his head, as if he were being bitten like there were ants inside.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, no matter how strong this remnant consciousness was in the past, it was now in a pitiful state. First it had been cut into several pieces by the Magic Cube, and then it had been sealed away by Lin Ming with the Purple Flood Dragon Divine Thunder and Blood Extinguishing Demon Thunder, and then sunk and suppressed within his spiritual sea. Although it was angry now, it could only uselessly pant and toss around. The spiritual power that it consumed was far greater than Lin Ming.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter all, when it had been sucked into the Magic Cube, its main consciousness had been twisted to pieces by the soul current. And, it had been sealed within the Magic Cube for an inestimably long stretch of time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, this old voice simply wasn’t able to admit defeat. It coldly said, “Boy, if you dare to disrespect this Saint again, then this Saint will eventually shatter your spiritual sea!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming rolled his eyes. He just didn’t have time to chit chat with this fellow. He turned and said, “If you want to, then you should come out, don’t sit there and idly talk with me!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHearing Lin Ming say this, the voice sounded a bit prouder, “Hehe, boy, you’re quite smart! Yes, yes, if this Saint comes out now, then you shall be bestowed a great lucky chance!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s eyebrows arched up. “Lucky chance?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want to obtain the Cosmic Melting Furnace, right? This Saint knows the technique to control it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm?” Lin Ming hesitated for a moment. He believed that this fellow truly did have the method to control it, but he also believed that this fellow wouldn’t help him with good intentions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“And what’s the price?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Talking to you really saves time. This Saint will tell you how to open the Cosmic Melting Furnace. But, the condition is that you unseal my separated consciousness from your spiritual sea and then restore me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Impossible!” Lin Ming immediately ruled out this possibility. He just wasn’t this old dog’s match. The Magic Cube had helped him in sealing away that horrifying dog. Without its help, releasing that old dog’s consciousness now was just seeking his own death. Perhaps it might even try to possess him. Rather than taking such a tremendous risk, Lin Ming would rather not have the Cosmic Melting Furnace at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boy, think about it! This Cosmic Melting Furnace is a great fortune! Also, once I’m restored I know a way to control the Cosmic Melting Furnace! This Saint can even allow you to take away the entire Cosmic Melting Furnace, allowing you to make it your own spiritual tool!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTake the entire Cosmic Melting Furnace?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s heart beat quickened as he heard the old dog suddenly say this. However, he eventually suppressed the rising greed in his heart. He coldly said, “It’s impossible for me to meet your conditions. You should just give it up. Time is of the essence right now, I don’t plan on staying any longer.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming put away the Great Desolate Blood Halberd and began to leave. The old dog sounded a bit more nervous now. It said, “Hey, hold on! You only need to unseal a part of my consciousness, not all of it. This Saint will still help you to obtain the Cosmic Melting Furnace!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Unseal just a part of your consciousness?” Lin Ming’s mind stirred. At first, this old dog and been torn into seven or eight pieces by the Magic Cube. If it was just one of these pieces, then Lin Ming was completely confident he would be able to subdue it. After all, when Lin Ming had fought with this old dog, he had also caused it a great amount of damage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who are you? How are you related to the Demon Emperor? And why were you in the Demon Emperor’s soul fragment?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You asked who I am? Hehe, you probably haven’t heard about me.” The old dog’s voice was proud and filled with disdain. Indeed, if this old dog came from the Realm of the Gods, then Lin Ming was unlikely to have heard about him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t want to idle away speaking nonsense with this dog. Now, with this old dog delaying him, over 20 breaths of time had passed. At most he had half an incense stick of time before he had to leave. Otherwise, it would become dangerous.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut this old dog’s conditions… who knew what sort of plot it had?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDid it want the treasures within the Cosmic Melting Furnace? Those pills or whatever else was inside would be useless to it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOne needed a flesh and blood body to swallow those pills. Lin Ming had never heard of a spiritual body that was able to take pills.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he thought it over, Lin Ming thought more and more that this was harmless. After all, it was just a part of the dog’s remnant consciousness; it wouldn’t be his match.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if the dog had some plot, then the worst thing that could happen was that he wouldn’t be able to obtain the Cosmic Melting Furnace. Lin Ming had already intended to give up on it, so even if he couldn’t obtain it, it wasn’t much of a loss.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTime was tight. Lin Ming didn’t have enough time to think it over. Since there wasn’t any danger, then he would simply agree to its condition. Giving up some lucky chances because of a bit of worry just wasn’t Lin Ming’s style.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright! Then I’ll unseal a part of your consciousness.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming entered deep within his own spiritual sea. Within his spiritual sea, that old dog’s consciousness had been divided into many pieces and individually suppressed in different corners of Lin Ming’s spiritual sea. Every piece was wrapped in a thick bundle of lightning, as if it were a cocoon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Ming saw this, he was a bit impressed. For that old dog to still be able to speak to him like this… those old Realm of the God fellows had a terrifyingly resilient soul consciousness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming chose the weakest and smallest section of consciousness, and prepared to unseal it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe old dog also seemed a bit dissatisfied. “Boy, where’s your courage? This Saint’s strength has sharply fallen. Now, all that I have left is the form of my soul, and yet you still only release the smallest piece? Even if several pieces of my consciousness joined together, I still wouldn’t be able to harm you! In order to open the Cosmic Melting Furnace, this Saint will have to expend a great deal of soul force. If you only unseal such a small piece, then this Saint will damage himself from overdrawing soul force!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Min thought little of this. He calmly said, “You’re right, I’m not that courageous. Less idle talk - do you agree or not?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming guessed that this old dog had some ulterior motive. But now, time was just too tight, and he didn’t want to negotiate. Since he had determined that it wasn’t dangerous to him, then he would deal with it as it came and try to obtain the maximum amount of benefit that he could, fishing for whatever was available. With the other party’s strength so weak, the one with the advantage here was him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“F*ck, to think that a tiger like me would be bullied by a dog. Fine, I don’t want to bother bargaining with you. Now unseal my consciousness.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e‘Tiger being bullied by a dog? Aren’t you just a dog yourself?’\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming thought this in his mind, but was disinclined to say it. This old dog didn’t seem like the great Demon Emperor, but rather an old swindler.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming flexed his fingers and began to unseal the wrapped lightning around the piece of soul consciousness. He said, “I’ll say this in advance. I only have half an incense stick of time. If you don’t succeed in that time period, then I’ll be leaving!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Half an incense stick of time? More than enough!” Obtaining freedom after being sealed away for such a long time was like a person that had been suddenly released after being tied down with ropes. The old dog’s consciousness stretched out its spirit body, and then comfortably cried out, “Woof!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHearing this, Lin Ming was speechless. How was this not a dog?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, what was even more mind boggling was what happened afterwards. As Lin Ming saw the old dog rush out from his spiritual sea and turn into a visible form, he nearly bit off his own tongue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn front of him was a half-foot long miniature puppy. Its tail was the size of a finger, and it was covered with red curls. Its ears drooped, and it stuck out its lolling tongue, a pair of small black eyes staring out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a pug, it was definitely a pug.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You… you…!” Lin Ming was at a loss for words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What’re you looking at!? This Saint’s soul force is greatly damaged. Naturally, my body will shrink a bit. What’s so strange about it!?” Seeing Lin Ming’s shocked expression, the old dog was a bit unsatisfied and wanted to blame him for being surprised.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming didn’t know whether to laugh or to cry. If this was a Saint, and this was also its soul shape, then it truly was difficult to connect the two disparate images together. But now was a moment of life or death, and Lin Ming couldn’t spare the time to care about this. He wouldn’t relax his guard just because this mini pug appeared harmless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was certain that this old dog had some plan. Otherwise, why would it be so nice as to help him open the Cosmic Melting Furnace? It probably wanted to look inside to see what sort of benefits it could fight for.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThinking of this, Lin Ming revolved the true essence in his body, staying at full alert. The Samsara martial intent also began to form in his spiritual sea, ready to attack the old dog at any time.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pug slowly drifted towards the top of the Cosmic Melting Furnace, both eyes staring at the lid. It stretched out its long tongue and licked its lips, revealing a very lascivious and disturbing smile towards Lin Ming. Then, it began to slowly mumble.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the old dog mumbled, its two short front paws also began to randomly gesticulate in the air. Lin Ming looked at this for a while, and then began to understand that these movements were creating seals.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming felt as if he had been struck by lightning.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-498\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-500\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-499","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
