{"id":54534,"no":589,"title":"Chapter 588 - King’s Cage, 100 Days","content":"\u003cp\u003eChapter 588 – King’s Cage, 100 Days\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eFor an entire month, Lin Ming was trapped in complete darkness. Even breath had become incomparably difficult. All of his organs were under pressure, and every small step he took required a tremendous amount of energy. That sort of aching fatigue made one prefer the bliss of death.\u003c/p\u003e\n\u003cp\u003eAfter arriving at the extremes of exhaustion, it became even more unbearable than the pain. Once the pain reached the limit, one could numb themselves to it after a long time, but if one was exhausted, then it was impossible to rid oneself of that feeling.\u003c/p\u003e\n\u003cp\u003eNot just that, but Lin Ming also had to bear utter loneliness in the void of space. After all, humans were social creatures. Martial artists could withstand loneliness if they went into closed-door cultivation, but that was also in a relatively comfortable environment of their design, unlike this land that made one fall into madness. There was no sound, no light, endless walking, endless traveling , and a never ending fatigue that led to madness.\u003c/p\u003e\n\u003cp\u003eAnd what was most despairing of all was that one completely couldn’t see an end! They had no idea where to go! They didn’t even know if the method they were using to break out of the chaos prison was correct.\u003c/p\u003e\n\u003cp\u003eEven though Lin Ming’s will was firm like iron, he too was close to collapsing after over 20 days.\u003c/p\u003e\n\u003cp\u003eIn the final several days, Lin Ming couldn’t even tell if he was dead or alive; reality and illusion were no different to him. All of his movements were completely mechanical and instinctive as he took that last breath and finally broke out of the chaos prison!\u003c/p\u003e\n\u003cp\u003eDuring this period, Lin Ming didn’t know how many times he had broken through the limits of his body. It had to be known that Lin Ming’s endurance was comparable to a Life Destruction Supreme Elder. Even so, he had been pushed to this degree.\u003c/p\u003e\n\u003cp\u003eThis chaos prison was simply not for a human to live in.\u003c/p\u003e\n\u003cp\u003eFingers shivering, Lin Ming took a top recovery pill out of his spatial ring and swallowed it. He immediately went into meditation and adjusted his breathing.\u003c/p\u003e\n\u003cp\u003eAt this time, the tremendous role of the Gate of Healing manifested. Even though he had only traced the Gate of Healing’s threshold, the benefits were massive.\u003c/p\u003e\n\u003cp\u003eA whirlpool of origin energy formed between Lin Ming’s clavicles, continuously supplementing him with origin energy, revitalizing his dried up meridians.\u003c/p\u003e\n\u003cp\u003eAfter recovering his physical strength, Lin Ming took several dozen high-grade Blood Demon Crystals out, sucking in all of their inherent origin energy and blood vitality in a single breath.\u003c/p\u003e\n\u003cp\u003eThus, color finally returned to Lin Ming’s face.\u003c/p\u003e\n\u003cp\u003eAn hour later, Lin Ming was finally restored to his usual condition. As he looked at his dantian, Lin Ming was surprised. In just a month, he had already reached the peak of the late Xiantian realm!\u003c/p\u003e\n\u003cp\u003eHe was just a bit away from extreme Xiantian\u0026nbsp;!\u003c/p\u003e\n\u003cp\u003eHe had only broken through to the late Xiantian realm a mere several months ago. There wasn’t that great of a distance between late Xiantian and extreme Xiantian. But for him to cross such a distance in so little time, the effects of the chaos prison were simply terrifying!\u003c/p\u003e\n\u003cp\u003eThinking about it, this was also normal. By constantly keeping his body at the very limit and suppressing his potential to the greatest degree, with the added function of the Heavenly Demon force field, every cell in his body was painstakingly tempered!\u003c/p\u003e\n\u003cp\u003eHowever, this sort of inhuman experience was unendurable for the average person. Even Lin Ming didn’t want to experience the pressure of the chaos prison again, at least not for the time being.\u003c/p\u003e\n\u003cp\u003eStanding up, Lin Ming suddenly discovered something. After adapting himself to the chaos prison and burdening the Heavenly Demon force field, although he still felt heavy, he wasn’t as uncomfortable as he was before.\u003c/p\u003e\n\u003cp\u003eJust from this alone, Lin Ming could see that his progress in the last month was great.\u003c/p\u003e\n\u003cp\u003eIt could be said that there was no way that Lin Ming’s current foundation could be any more solid.\u003c/p\u003e\n\u003cp\u003eThere was no need to mention the essence gathering system. The true essence cyclone in his dantian had condensed to the point of turning into essence, and even his marrow seemed to be rejuvenated. His body transformation system was extremely solid.\u003c/p\u003e\n\u003cp\u003e“I wonder who created this King’s Cage. That person was absolutely a great character It seemed that on Sky Spill Continent and Holy Demon Continent, there must have been something great that happened so many tens of thousands of years ago. Many peerless talents and heroes were born. But for some reason, in this era, everything including the history from 100,000 years ago have already been lost… ”\u003c/p\u003e\n\u003cp\u003eLin Ming was feeling happy for his progress just now, when suddenly, a massive pressure came smashing down on him. His blood tumbled and he almost spat out a mouthful of blood!\u003c/p\u003e\n\u003cp\u003eThis is…!\u003c/p\u003e\n\u003cp\u003eLin Ming fell to his knees, supporting himself with the Purple Comet Spear. This sudden great pressure caused his meridians to rupture in multiple locations!\u003c/p\u003e\n\u003cp\u003e“It’s too strong…”\u003c/p\u003e\n\u003cp\u003eLin Ming almost couldn’t help but curse out. The King’s Cage didn’t even give you a chance to breathe!\u003c/p\u003e\n\u003cp\u003eThe person who designed this had probably expected that a martial artist who broke through the King’s Cage would make great progress in their strength. Thus, when the Heavenly Demon force field appeared, the pressure would ramp up to another level yet again!\u003c/p\u003e\n\u003cp\u003eKa ka ka!\u003c/p\u003e\n\u003cp\u003eAround Lin Ming, the power of space seemed to warp. Then, in front of Lin Ming’s eyes, space began collapsing around him!\u003c/p\u003e\n\u003cp\u003eThis rupturing of space created vast amounts of space fragments, blocking him in every direction!\u003c/p\u003e\n\u003cp\u003eAnd in this confined space, there were ominous space cracks everywhere. There were some that Lin Ming could see, and some that he couldn’t see, his perception not even noticing them.\u003c/p\u003e\n\u003cp\u003eThey were like the jaws of a giant beast, waiting for their prey to arrive.\u003c/p\u003e\n\u003cp\u003e“This is also a cage!”\u003c/p\u003e\n\u003cp\u003eLin Ming sucked in a deep, cold breath!\u003c/p\u003e\n\u003cp\u003eHe was finally experiencing the true horror of the King’s Cage!\u003c/p\u003e\n\u003cp\u003eIt had been just over three months. If he continued, then what else would he encounter here?\u003c/p\u003e\n\u003cp\u003eThe Senior Supreme Elder who designed this cage was what kind of genius? Not only was he terrifyingly powerful, but his creativity and imagination was unrestrained, wild with ambition!\u003c/p\u003e\n\u003cp\u003e“The twelfth cage, dimensional fragments. Would you like to try passing it?”\u003c/p\u003e\n\u003cp\u003eThe strange voiceless consciousness appeared in Lin Ming’s spiritual sea again. As it appeared, a shimmering transmission array also appeared in the cage.\u003c/p\u003e\n\u003cp\u003e“After the chaos prison are dimensional fragments. I wonder what’s next…”\u003c/p\u003e\n\u003cp\u003eLin Ming did not hesitate in his decision.\u003c/p\u003e\n\u003cp\u003eWith his decision, the transmission array disappeared.\u003c/p\u003e\n\u003cp\u003eSoon after, in the enclosed space, the space fragments began to twist. The space cracks began to move up and down like spiritual snakes, causing Lin Ming to be alarmed!\u003c/p\u003e\n\u003cp\u003eWithout a doubt, the dimensional fragments could easily take his life!\u003c/p\u003e\n\u003cp\u003eIf he was cut in half by a sliver of these space cracks, it would be too late to activate any kind of escape talisman!\u003c/p\u003e\n\u003cp\u003eWith these space fragments as the boundary of this cage, and for the cage to also have space cracks that constantly morphed and move, just what kind of test was this? Just thinking of this cage made one aghast!\u003c/p\u003e\n\u003cp\u003e…………..\u003c/p\u003e\n\u003cp\u003eAt this time, outside of the King’s Cage, 95 days had passed!\u003c/p\u003e\n\u003cp\u003e95 days.\u003c/p\u003e\n\u003cp\u003eEven Muk Gu began to feel a rising sense of despair in his heart.\u003c/p\u003e\n\u003cp\u003eAlthough he didn’t wish to believe it, all logical reasoning told him that Lin Ming had most likely perished inside the King’s cage.\u003c/p\u003e\n\u003cp\u003eThe longer one stayed in the King’s Cage, the more difficult it would become. The Eightfall War Emperor had only lasted in there for 60 days, but Lin Ming had already been inside for 95 days.\u003c/p\u003e\n\u003cp\u003eWas this even possible?\u003c/p\u003e\n\u003cp\u003eIn the special practice area, Feng Shen was looking at the door of light leading to the King’s Cage deeply. He let out a protracted sigh.\u003c/p\u003e\n\u003cp\u003e“Unimaginable.”\u003c/p\u003e\n\u003cp\u003eFeng Shen shook his head and then turned to leave.\u003c/p\u003e\n\u003cp\u003eHe only felt sorrow and regret that Lin Ming had fallen here. Although he admitted that his talent was inferior to Lin Ming’s, Feng Shen actually felt no envy towards Lin Ming. He knew that some top talents might consider it a misfortune to be born in the same era as someone like Lin Ming, but Feng Shen never thought so.\u003c/p\u003e\n\u003cp\u003eTo him, this was actually a goal for him to pursue, a dream that he could drink from to enhance his own cultivation.\u003c/p\u003e\n\u003cp\u003eIf one never saw a higher peak, then they would never know how high the mountains were. This would inevitably affect their vision and also the degree of their accomplishments.\u003c/p\u003e\n\u003cp\u003eBut now, Lin Ming had died here, and that goal along with him. In Skysplit Tower, Feng Shen had the unbearable feeling of standing at the top.\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-587\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-589\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-588","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
