{"id":54535,"no":590,"title":"Chapter 589 - Crisis","content":"\u003cp\u003eChapter 589 – Crisis\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eIn the dimensional fragment cage, Lin Ming closed his eyes, moving with Golden Roc Shattering the Void. Under the tremendous pressure, his steps didn’t have any of the usual fleeting vibrancy, instead, it was like they were made of lead.\u003c/p\u003e\n\u003cp\u003eIn this cage of space, his eyes were useless. The space cracks simply couldn’t be seen by the naked eye.\u003c/p\u003e\n\u003cp\u003eEven his perception was limited.\u003c/p\u003e\n\u003cp\u003eWhat Lin Ming could depend on was his understanding towards the Law of Space, and his mastery over the power of space only.\u003c/p\u003e\n\u003cp\u003eWhenever a space crack quietly approached, Lin Ming could feel the fluctuations emitting from space. The fluctuations were like ripples in the water, appearing out of nowhere.\u003c/p\u003e\n\u003cp\u003eEvery time, Lin Ming would move in advance in order to dodge the space cracks that could cut him open.\u003c/p\u003e\n\u003cp\u003eWith Lin Ming’s strength, even if he had completed Tempering Marrow and his body was comparable to a treasure, or no matter how thick his protective true essence was, in front of these space cracks, it was nothing more than brittle paper.\u003c/p\u003e\n\u003cp\u003eWoosh!\u003c/p\u003e\n\u003cp\u003eA purple gold spear light flashed through like a meteor, smashing into the barriers of the space cage!\u003c/p\u003e\n\u003cp\u003eKacha!\u003c/p\u003e\n\u003cp\u003eSpear light erupted. The space barrier trembled just a bit before returning to normal, as if nothing had happened.\u003c/p\u003e\n\u003cp\u003eThese past days, Lin Ming had been constantly attacking the space barrier. Although he hadn’t been able to shake it, Lin Ming, through this nonstop barrage of attacks, was unconsciously deepening his comprehension into the power of space.\u003c/p\u003e\n\u003cp\u003eBut at this moment, Lin Ming’s body trembled. On his shoulder, blood erupted into a crimson rain. The blood was quickly twisted into a red mist by an invisible power before vanishing into an invisible whirlpool.\u003c/p\u003e\n\u003cp\u003eLin Ming was shocked; he immediately drew back.\u003c/p\u003e\n\u003cp\u003eHis right shoulder had been completely torn open!\u003c/p\u003e\n\u003cp\u003e“That was too close!”\u003c/p\u003e\n\u003cp\u003eLin Ming’s forehead dripped with a cold sweat. A moment ago, as he was distracted with his attacks, a small space crack the size of a slip of paper had quietly crept towards him. Such a small space crack created extremely small ripples in the void. With Lin Ming’s attention being diverted, his perception wasn’t as sensitive, so he hadn’t been able to sense it.\u003c/p\u003e\n\u003cp\u003eSuch a small space crack, yet such a terrifying destructive power!\u003c/p\u003e\n\u003cp\u003e“Luckily, it was just my shoulder!”\u003c/p\u003e\n\u003cp\u003eA chill crept up Lin Ming’s back. When he had entered the ancient ruins of the Demon God Imperial Palace, the space cracks there hadn’t been so horrifying.\u003c/p\u003e\n\u003cp\u003eAt that time, when a second stage Life Destruction Supreme Elder or those stronger flew into the broken world, they didn’t fear those space cracks at all.\u003c/p\u003e\n\u003cp\u003eLin Ming felt that although his current strength wasn’t comparable to those old Life Destruction fellows, it shouldn’t have been that far away. But yet, a small space crack the size of a tiny slip of paper had completely torn his shoulder apart!\u003c/p\u003e\n\u003cp\u003eThis showed that in this different world, the power of space cracks was completely different.\u003c/p\u003e\n\u003cp\u003eIn the Demon God Imperial Palace, the broken world that held it was already approaching collapse. The power of space there was too weak.\u003c/p\u003e\n\u003cp\u003eOn the other hand, the world of the King’s Cage was very stable. The more stable a space was, the stronger the power of space was. After space disintegrated and formed space cracks, the dimensional fragments were correspondingly more terrifying!\u003c/p\u003e\n\u003cp\u003eWho else dared to say that the Concept of Space’s striking power was weak?\u003c/p\u003e\n\u003cp\u003eIf one could truly and completely grasp the Concept of Space, touching upon the source of all space, then with a casual strike, they could tear apart space itself. Who could defend against an attack like this?\u003c/p\u003e\n\u003cp\u003eIf he could soar into the Realm of the Gods, twist the space there and use that incomparably stable space as his weapon, then how powerful would such an ability be?\u003c/p\u003e\n\u003cp\u003eAlthough this possibility was fascinating, Lin Ming didn’t have any more time for distractions. He noticed that in the space around him, he found that there were more and more tiny space fragments and space cracks appearing!\u003c/p\u003e\n\u003cp\u003eThe space cracks that had once been 10 feet long had become 3-4 feet long and now, they were only the size of a slip of paper.\u003c/p\u003e\n\u003cp\u003eIf such a space crack pierced his arm or leg, then with Lin Ming’s exceedingly abnormal regenerative ability, he would still be able to live on. But, if it pierced his heart, then Lin Ming suspected that even the Heretical God Seed or the Magic Cube wouldn’t be able to save him.\u003c/p\u003e\n\u003cp\u003e“There are more and more fragments; these should be because my attacks shattered them.”\u003c/p\u003e\n\u003cp\u003eThe stable space had been torn apart by that strange force field. Now, with Lin Ming’s attacks added on, more and more tiny space fragments started to appear.\u003c/p\u003e\n\u003cp\u003e“The Heavenly Demon force field’s pressure has increased again!”\u003c/p\u003e\n\u003cp\u003eThis time, the Heavenly Demon force field strengthened yet again. This was undoubtedly one stroke of bad luck after another!\u003c/p\u003e\n\u003cp\u003eNot only did his body slow down, but his perception was dulled. Lin Ming found it difficult to detect those tiny space fluctuations.\u003c/p\u003e\n\u003cp\u003eThis was like a martial artist being under a rain of arrows and having their vision suddenly blur.\u003c/p\u003e\n\u003cp\u003e“This is bad!”\u003c/p\u003e\n\u003cp\u003eCold sweat rolled down Lin Ming’s back; he had completely lost control of the situation!\u003c/p\u003e\n\u003cp\u003eOnce his time in the King’s Cage surpassed 100 days, Lin Ming was beginning to finally find it hard to persist!\u003c/p\u003e\n\u003cp\u003eThe dimension fragment cage couldn’t be broken and the tiny space fragments were nearly impossible to detect or defend against.\u003c/p\u003e\n\u003cp\u003eUnder this massive pressure, he was even finding it hard to maintain his speed for a long time.\u003c/p\u003e\n\u003cp\u003eLin Ming gripped the escape talisman in his hand, hesitating.\u003c/p\u003e\n\u003cp\u003eIn his life, he would only be able to enter the King’s Cage once. During his three months here, he had harvested a great deal. If he left like this, then it would be a bit dismaying.\u003c/p\u003e\n\u003cp\u003eBut in this situation, if he wasn’t careful then he might possibly die inside here. A Titled Asura, perishing in the King’s Cage. Wouldn’t that be just too big of a joke?\u003c/p\u003e\n\u003cp\u003eHowever, when four or five space fragments continuously disappeared from Lin Ming’s perception, his complexion finally changed.\u003c/p\u003e\n\u003cp\u003eHe crumpled the escape talisman.\u003c/p\u003e\n\u003cp\u003eLin Ming was resolutely determined to leave the King’s Cage.\u003c/p\u003e\n\u003cp\u003eHo--!\u003c/p\u003e\n\u003cp\u003eA transmission array suddenly appeared underneath Lin Ming’s feet. With a flash of light, Lin Ming was covered in the golden light of the escape talisman, his figure blurring.\u003c/p\u003e\n\u003cp\u003e“Mm?”\u003c/p\u003e\n\u003cp\u003eLin Ming’s expression changed. He could clearly feel that he had passed through the space channel and arrived in Skysplit Tower, but the surrounding space had been blocked off!\u003c/p\u003e\n\u003cp\u003eThe transmission channel had been sealed. He had no way to leave!\u003c/p\u003e\n\u003cp\u003e“What’s going on?”\u003c/p\u003e\n\u003cp\u003ePeng!\u003c/p\u003e\n\u003cp\u003eIn Lin Ming’s hand, the escape talisman suddenly exploded into dust. The light vanished, and Lin Ming found himself in the space cage once more.\u003c/p\u003e\n\u003cp\u003eIf the space in Skysplit Tower was blocked, then that was the same as eliminating the exit.\u003c/p\u003e\n\u003cp\u003eCould it be…?\u003c/p\u003e\n\u003cp\u003eLin Ming’s mind raced. He wasn’t an idiot. If someone could do this, then there was only one possibility; it was a high level figure of Skysplit Tower!\u003c/p\u003e\n\u003cp\u003e“A space blocking array formation. Skysplit Tower also seems to have some capable individuals. This sort of array formation is considered complex, even among ancient array formations!” Lin Ming had inherited the memories of a Realm of the Gods’ array master, so he had a great deal of understanding into this sort of array formation. But, to lay it out so that it would forcibly block a transmission array wasn’t an easy task.\u003c/p\u003e\n\u003cp\u003e“You want me to die in here?” Lin Ming’s eyes flashed with a cold light, killing intent blazing in them.\u003c/p\u003e\n\u003cp\u003eFuu! Fuu! Fuuu!\u003c/p\u003e\n\u003cp\u003eWithin the space cage, the space fragments flew around. Lin Ming could even hear some of the space fragments colliding with each other, and the sound of space breaking filled the air.\u003c/p\u003e\n\u003cp\u003eThese sounds were clear, but they were actually the sounds of death!\u003c/p\u003e\n\u003cp\u003e“What should I do!?”\u003c/p\u003e\n\u003cp\u003eThe normally calm Lin Ming was now panicking.\u003c/p\u003e\n\u003cp\u003eAlthough he had a good deal of understanding into this sort of space blocking array formation, wanting to break it open was another matter altogether. It would not be easy.\u003c/p\u003e\n\u003cp\u003eNot mention that Lin Ming couldn’t break it, but even if he believed he could, there was one condition required. This was that he needed a transmission array leading to the center of that blocked space!\u003c/p\u003e\n\u003cp\u003eTo Lin Ming, this was obviously impossible!\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-588\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-590\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-589","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
