{"id":54544,"no":599,"title":"Chapter 598 - Three Continuous Matches","content":"\u003cp\u003eChapter 598 – Three Continuous Matches\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e..\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e“Yan Chi, Maha, Kai Yang!”\u003c/p\u003e\n\u003cp\u003eAs these three people appeared, the martial artists present were all shocked. Three of the Heavenly demon Seven Stars had simultaneously arrived!\u003c/p\u003e\n\u003cp\u003eCompared to Lin Ming, none of these three auras were in any way inferior. As these three auras faintly overlapped with each other’s, it even overshadowed Lin Ming’s!\u003c/p\u003e\n\u003cp\u003e“Sir High Lord!”\u003c/p\u003e\n\u003cp\u003eYan Chi slightly bowed. Whether it was because of the soul contract or resources, the always proud Yan Chi was respectful towards the 12 High Lords.\u003c/p\u003e\n\u003cp\u003eHigh Lord Heian nodded with satisfaction. He was happy as he noticed that Yan Chi, Maha, and Kai Yan’s strengths had increased by a great deal. Fortunately, he had let the three of them into the Road of Emperor a few months ago. Now he had soldiers at the time he needed them the most.\u003c/p\u003e\n\u003cp\u003e“Good, you have not disappointed me.” High Lord Heian slowly said as he turned back to look at Lin Ming. “Lin Ming, I remember than you were in the King’s cage for 108 days. With some of the time from before, you should owe two or three matches now?”\u003c/p\u003e\n\u003cp\u003eLin Ming heard High Lord Heian speak and the corners of his lips curved up, “What are you trying to say?”\u003c/p\u003e\n\u003cp\u003e“You have doubted me, offended me, and falsely accused me. If I kill you now, then others will inevitably spread rumors about if, treating me in a completely unfair manner! Since this is the case then I have a chance for you. You’ve just come out of the King’s Cage so your strength should have risen. So, you will now finish all the matches that you owe!”\u003c/p\u003e\n\u003cp\u003eAs High Lord Heian spoke, the martial artists present began to understand. What High Lord Heian wanted was for Lin Ming to enter the arena stage and fight the Heavenly Demon Seven Stars!\u003c/p\u003e\n\u003cp\u003eNot just that, but in accordance to the rules of Skysplit tower, if one owed matches because they were in practice then they would have to fight in continuous matches! There would be no rest time between them!\u003c/p\u003e\n\u003cp\u003eWhen Lin Ming had continuously fought Yan Hu and Ming Sun, this was also a similar situation. Lin Ming had killed Yan Hu with absolute superiority, forcing Ming Sun to peacefully raise the white flag so there wasn’t even a real second match.\u003c/p\u003e\n\u003cp\u003eBut this time was different. His matches would be against the Heavenly Demon Seven Stars! Who would still dare to continuously fight them!?!?\u003c/p\u003e\n\u003cp\u003e“Time? Opponents?”\u003c/p\u003e\n\u003cp\u003eLin Ming calmly said without a hint of fear.\u003c/p\u003e\n\u003cp\u003eHigh Lord Heian was surprised for a moment. This kid was far too confident!\u003c/p\u003e\n\u003cp\u003eEven facing continuous matches with the Heavenly Demon Seven Stars he didn’t care at all, even letting High Lord Heian arrange the matches for him. To what degree did his confidence extend to!?\u003c/p\u003e\n\u003cp\u003eThe surrounding martial artists were all secretly shocked. As they looked at Lin Ming leisurely standing, this definitely wasn’t an act!\u003c/p\u003e\n\u003cp\u003eHigh Lord Heian glowered. He coldly said, “Since you are so bold then I won’t disappoint you. 10 days from now at the martial arena, you will fight Yan Chi, Maha, and Kai Yang!”\u003c/p\u003e\n\u003cp\u003eThree continuous matches?\u003c/p\u003e\n\u003cp\u003eAll of the martial artists present were confused. They knew that High Lord Heian wished for Lin Ming to die, but didn’t think that he would directly put out three continuous matches. Arguably, Lin Ming only owed two now. The third would still have to wait for some time.\u003c/p\u003e\n\u003cp\u003eThey turned towards Lin Ming, seeing if he would refuse.\u003c/p\u003e\n\u003cp\u003eLin Ming faintly smiled. “Three continuous matches? Sure!”\u003c/p\u003e\n\u003cp\u003eLin Ming easily agreed, startling all the martial artists.\u003c/p\u003e\n\u003cp\u003eTo continuously fight three Heavenly Demon Stars, especially Yan Chi and Maha who were ranked in the top three, was simply madness! Utter madness!\u003c/p\u003e\n\u003cp\u003e“Lin Ming is too reckless. It’s true that he’s strong, but according to some reliable sources, Yan Chi, Maha, and Kai Yang have all entered the Road of Emperor, gaining experience inside for the last few months. What they gained in there is most likely no less than what Lin Ming gained in the King’s Cage! And what is even worse is that if Lin Ming battled just Kai Yang alone I’m still afraid he would be in a perilous situation, and now he wants to fight three of them continuously!”\u003c/p\u003e\n\u003cp\u003e“For sure. Lin Ming just doesn’t understand how strong these three are. Agreeing to this is just too rash.”\u003c/p\u003e\n\u003cp\u003eContinuous matches was an enormous test on a martial artist\u0027s true essence and physical strength; one could only win if they had an overwhelming advantage. Otherwise, the longer these battles dragged on the more exhausted they would be, and the more tired their spirit and mind would be, causing their true essence usage to accelerate, and finally, they would be defeated.\u003c/p\u003e\n\u003cp\u003eEven Feng Shen didn’t dare to boast he could do this. There were even some that suspected that after Yan Chi entered the Road of Emperor, his strength might be no worse than Feng Shen’s!\u003c/p\u003e\n\u003cp\u003e“Hehe, this boy is too stupid!” Yan Chi sneered.\u003c/p\u003e\n\u003cp\u003e“Humph! He doesn’t want to walk the road to heaven but would rather storm through the gates of hell! If you want to die then I’ll give you a hand!” Maha said with ice cold killing intent. How could he allow their Heavenly Demon Seven Stars to be looked down on so much by a human? This fellow even thought that he could continuously fight three of them!\u003c/p\u003e\n\u003cp\u003e“Haha, allow this little brother to take the first match. Otherwise, the little brother fears that he won’t have the chance to do anything.” Kai Yang said, grinning. His strength had grown by leaps and bounds within the Road of Emperor, and he had finally absorbed a piece of Demon God Bone. His strength was incomparable to how he used to be. He certainly didn’t want to miss this chance to show off his newfound strength.\u003c/p\u003e\n\u003cp\u003eThe only way for him to get the High Lords to pay more attention to him was this match.\u003c/p\u003e\n\u003cp\u003eNot only did he need to win, he needed to do so in glorious style!\u003c/p\u003e\n\u003cp\u003eNow, even fools could see that High Lord Heian wanted Lin Ming to die.\u003c/p\u003e\n\u003cp\u003ePerhaps if one of them killing Lin Ming, they would even be able to obtain a bit of Demon God Bone as a reward!\u003c/p\u003e\n\u003cp\u003e“Good. Kai Yang, you will go first. Then Maha will take the second match.” High Lord Heian said. From the weakest to the strongest was the best way to arrange a squad.\u003c/p\u003e\n\u003cp\u003e“Haha, maybe Maha won’t even need to do anything.” Kai Yang cunningly smiled.\u003c/p\u003e\n\u003cp\u003eKai Yang was extremely confident in himself.\u003c/p\u003e\n\u003cp\u003eLin Ming’s lips curled up. Towards these three continuous matches, he didn’t feel much. It was true that he knew nothing about Yan Chi, Maha, or Kai Yang’s strength, but all he knew was that he was absolutely confident he could defeat them.\u003c/p\u003e\n\u003cp\u003eAfter opening the Gate of Healing, Lin Ming’s regenerative abilities had reached a terrifying degree. Three continuous matches? He wouldn’t even care if they all came together!\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eWith the gauntlet thrown down, High Lord Heian turned and left. His retinue of guards also drew back like a tide.\u003c/p\u003e\n\u003cp\u003eAs Kai Yang turned to leave, he said to Lin Ming with a true essence sound transmission, “Boy, wash your neck and wait for death. When I kill you, I’ll likely be granted a Demon God Bone! To me, you are nothing but a Demon Gone Bone!”\u003c/p\u003e\n\u003cp\u003eLin Ming didn’t bother to speak again. He sat back down at his table, picked up his chopsticks, and began to eat a piece of meat.\u003c/p\u003e\n\u003cp\u003eEating meat, drinking wine, all of this done calmly!\u003c/p\u003e\n\u003cp\u003eAs if nothing had happened just now.\u003c/p\u003e\n\u003cp\u003eSeeing Lin Ming eating a meal so languidly, all of the martial artists present were taken aback. He had to continuously battle Yan Chi, Maha, and Kai Yang in 10 days.\u003c/p\u003e\n\u003cp\u003eHow could he be so calm?\u003c/p\u003e\n\u003cp\u003eThis calm was not an act. This was a death match. Who could be so calm before so many death matches? If he couldn’t even live, then what was the point of putting out a front?\u003c/p\u003e\n\u003cp\u003eIt could only be said that Lin Ming was truly calm. In a situation where he didn’t even understand Chi Yan, Maha, or Kai Yang’s strength, how could he be so calm?\u003c/p\u003e\n\u003cp\u003eJust how confident was Lin Ming in his own strength!?!?\u003c/p\u003e\n\u003cp\u003e…………………….\u003c/p\u003e\n\u003cp\u003eNews of Lin Ming’s continuous three battles with Yan Chi, Maha, and Kai Yang soon spread out like a tidal wave. It wasn’t just the third floor, but all the martial artists on the second floor quickly learned this!\u003c/p\u003e\n\u003cp\u003eThis was truly explosive news!\u003c/p\u003e\n\u003cp\u003eThis would be Lin Ming’s first battle since returning from the King’s Cage! With the reputation of the number one talent since ancient times on the line, the impact of this match could be imagined!\u003c/p\u003e\n\u003cp\u003eEven if Lin Ming battled an ordinary top 10 challenger on the third floor, it would still arouse a great amount of interest.\u003c/p\u003e\n\u003cp\u003eBut now, Lin Ming’s matches were completely comprised of the Heavenly Demon Seven Stars. Not just that but… it was three continuous matches!\u003c/p\u003e\n\u003cp\u003eYan Chi, Maha, Kai Yang! Especially the first two. Their reputation sounded out like a thunderclap in everyone’s ears!\u003c/p\u003e\n\u003cp\u003eWhen Lin Ming first arrived at Sun Flood City, he had already heard of Yan Chi and Maha’s names. In Skysplit Tower, there were even many mortals that knew of them.\u003c/p\u003e\n\u003cp\u003eAnd from reliable sources, it was learned that they had stepped into the Road of Emperor months ago. Their current strength was incomparably to how it was in the past!\u003c/p\u003e\n\u003cp\u003eIt was rumored that Yan Chi was now in no way inferior to Feng Shen. Even Maha had the qualifications to fight with Feng Shen on even footing.\u003c/p\u003e\n\u003cp\u003eAt that same time, Lin Ming would be fighting three people. This was simply crazy!\u003c/p\u003e\n\u003cp\u003eEven if Lin Ming wasn’t crazy, all the other martial artists on the third floor were going crazy.\u003c/p\u003e\n\u003cp\u003eEvery martial artist that had gone into closed-door seclusion had left their practice area, and every martial artist that had gone out for adventuring was also running back as fast as they could to watch this unparalleled battle!\u003c/p\u003e\n\u003cp\u003eThe prices for admission tickets had already risen to astronomical levels.\u003c/p\u003e\n\u003cp\u003e…………………….\u003c/p\u003e\n\u003cp\u003eSkysplit Tower, martial artist service center.\u003c/p\u003e\n\u003cp\u003eWearing blue clothes, a beautiful and delicate-looking young girl was blankly staring out a window, deep in a trance as she was lost in her thoughts.\u003c/p\u003e\n\u003cp\u003eThis girl was only 15 or 16 years old. Her face still had a faint hint of blossoming youth. Although her hair and face were cleaned up neatly and her clothes were also ordered, it couldn’t conceal her tired and pale complexion, a constantly ill appearance that aroused the pity of those who saw her.\u003c/p\u003e\n\u003cp\u003eThis girl was the maid servant that had helped Lin Ming during his stay at the martial artist service center – Wan’er.\u003c/p\u003e\n\u003cp\u003eThe proprietress of the martial artist service center had originally allowed to Wan’er to be Lin Ming’s concubine. But for the entire two weeks of time, Lin Ming hadn’t even touched Wan’er once. Afterwards, when Lin Ming had gone to the second floor, a black-caped Imp martial artist had used her life as a threat in order to force Lin Ming into a match.\u003c/p\u003e\n\u003cp\u003eAt that time, Wan’er had known nothing about this. After Lin Ming defeated that black-caped Imp martial artist, Xu Yan had informed her of this matter. Her feelings had become incomparably complicated after learning of this.\u003c/p\u003e\n\u003cp\u003eShe never imagined that a challenger of Skysplit Tower would take such dangerous risks for a mere mortal.\u003c/p\u003e\n\u003cp\u003eWhen it was learned that Lin Ming had perished in the King’s Cage, if there was anyone that truly felt sadness from the heart for Lin Ming, then it wasn’t Muk Gu, nor was it Da Gu or Xun Ji.\u003c/p\u003e\n\u003cp\u003eNo, the only one who felt such deep heartbreak was Wan’er.\u003c/p\u003e\n\u003cp\u003eWan’er knew her limits. She was well aware that her path and Lin Ming’s would never cross again. She knew it was impossible for her to ever serve him again, nor did she have the qualifications to stand vigil for him. Even seeing him just once more was a wild and unattainable hope.\u003c/p\u003e\n\u003cp\u003eWhat she could only do was to worry about him from the bottom of her heart and pray for him.\u003c/p\u003e\n\u003cp\u003eAfter it was said that Lin Ming had died, Wan’er found it hard to eat or drink, making her entire body thin and frail.\u003c/p\u003e\n\u003cp\u003eHowever, no matter what, she still believed that he would come out.\u003c/p\u003e\n\u003cp\u003eNow, Lin Ming had finally emerged from the King’s Cage, and not even one day later, news was spreading that he would fight Yan Chi, Maha, and Kai Yang in a continuous death match.\u003c/p\u003e\n\u003cp\u003eWan’er didn’t understand anything about martial artists nor anything about the levels of their strength. Because she was worried, she asked Xu Yan.\u003c/p\u003e\n\u003cp\u003eAlthough Xu Yan told her that Lin Ming could win, his answer had been very reluctant. Occasionally he would sigh and shake his head. This proved that… in truth, he didn’t think Lin Ming’s chances were good.\u003c/p\u003e\n\u003cp\u003e“Wan’er.” A voice suddenly called out.\u003c/p\u003e\n\u003cp\u003eWan’er looked around, and saw that the one speaking was Xu Yan. This year, Xu Yan had also entered the second floor. But he would often come back for a visit.\u003c/p\u003e\n\u003cp\u003e“Big Brother Xu Yan, is there any news about Big Brother Lin Ming’s fight?” Wan’er’s face filled with hope.\u003c/p\u003e\n\u003cp\u003e“Mm… the match will be tomorrow. But, even if I sell everything I have, I still wouldn’t be able to afford a ticket. Also… I don’t have the authority to enter the third floor.” Xu Yan shook his head. There wasn’t anything he could do besides wait for the final result.\u003c/p\u003e\n\u003cp\u003e“Oh…” Wan’er lightly replied.\u003c/p\u003e\n\u003cp\u003eXu Yan sighed. He wanted to say some comforting words, but he eventually didn’t say anything.\u003c/p\u003e\n\u003cp\u003eContinuously fighting Yan Chi, Maha, and Kai Yang…\u003c/p\u003e\n\u003cp\u003eHow could Lin Ming ever hope to win?\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-597\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-599\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-598","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
