{"id":54545,"no":600,"title":"Chapter 599 - Fighting Kai Yang","content":"\u003cp\u003eChapter 599 – Fighting Kai Yang\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eOn the day of the decisive battle, near the martial arena in a refined restaurant.\u003c/p\u003e\n\u003cp\u003eAt this time, there were only several minutes of time left before the start of the battle.\u003c/p\u003e\n\u003cp\u003e“Lin Ming, High Lord Heian has made it clear that he wants you to die. Why would you still accept three continuous matches? This sort of fight isn’t even fair. Not even Feng Shen would dare to be so brash!”\u003c/p\u003e\n\u003cp\u003eOpposite Lin Ming, Muk Gu was sitting down. He was looking at a large hourglass at the side of the room while shaking his head.\u003c/p\u003e\n\u003cp\u003eThis hourglass had 100 scale measurements on it. Every division was a quarter hour. One day was just about 100 of these measurements. As the sand flowed down the hourglass, it was closing in on the halfway mark. This was also when the match would begin.\u003c/p\u003e\n\u003cp\u003eLin Ming was slowly drinking a cup of wine as he said, “The reason I agreed to this fight is because I wanted to grow my Heavenly Demon Tattoo.”\u003c/p\u003e\n\u003cp\u003eLin Ming was now an early eight-winged Heavenly Demon. If he wanted to form a ten-winged Heavenly Demon Tattoo, then he naturally had to fight with the Heavenly Demon Seven Stars. High Lord Heian’s arrangements were what he had been earnestly wishing for.\u003c/p\u003e\n\u003cp\u003e“You’re also thinking of forming your Heavenly Demon Tattoo right now?” Muk Gu was speechless. Lin Ming didn’t seem worried about this match at all, instead, he had been thinking about how to condense the Heavenly Demon Tattoo.\u003c/p\u003e\n\u003cp\u003eRegarding this, all he could say was…\u003c/p\u003e\n\u003cp\u003e“It’s time.”\u003c/p\u003e\n\u003cp\u003eLin Ming downed the last of his wine, slowly stood up, and then steadily stepped away.\u003c/p\u003e\n\u003cp\u003eMuk Gu shook his head and followed along.\u003c/p\u003e\n\u003cp\u003e………………..\u003c/p\u003e\n\u003cp\u003eAt this time, the outside of the martial arena was already packed and full of bustling noise. The martial arena of the third floor was normally a lonely and desolate place, but now there was a massive snaking line that had formed at the entrance. There were even a number of martial artists from the second floor that had come, but of course, these people had special relations and access, thus they were able to temporarily enter the third floor.\u003c/p\u003e\n\u003cp\u003eCertainly, they also had to pay no small price.\u003c/p\u003e\n\u003cp\u003eThe martial arena on the third floor wasn’t too large to begin with, and today the entire arena was packed to overflowing. It wasn’t an exaggeration to say that today’s fight was the grandest and most exciting one that had been held on the third floor for the last 100 years!\u003c/p\u003e\n\u003cp\u003e“Look over there! Feng Shen! Even Feng Shen came!”\u003c/p\u003e\n\u003cp\u003eSome martial artists were keen of sight. They saw a white-clothed Fey youth carrying a longsword walk in, his eyes indifferent. He glanced over at Kai Yang and then stepped towards the special guest area. This white-clothed youth was the infamous Feng Shen of the third floor.\u003c/p\u003e\n\u003cp\u003eWhen Lin Ming had battled Yan Hu and Ming Sun, Feng Shen hadn’t appeared. This was because Lin Ming’s level had been far from reaching his at the time.\u003c/p\u003e\n\u003cp\u003eHe didn’t think that in just a mere few months, Lin Ming would already grow to his own level!\u003c/p\u003e\n\u003cp\u003eThis sort of terrifying rate of development was horrifying!\u003c/p\u003e\n\u003cp\u003e“High Lord! High Lord Heian!”\u003c/p\u003e\n\u003cp\u003e“Heavens! Even a High Lord has come!”\u003c/p\u003e\n\u003cp\u003eAfter Feng Shen, the next luminary to arrive was actually… High Lord Heian.\u003c/p\u003e\n\u003cp\u003eHigh Lords rarely made appearances. To personally come to the martial arena to look at a martial artist’s match, well… this hadn’t happened in years.\u003c/p\u003e\n\u003cp\u003eThus, from this point alone, it could be seen just how grandiose this fight was!\u003c/p\u003e\n\u003cp\u003eOn one side, there was the Blood Slaughter Steppes’ number one talent of the last 10,000 years, who had also practiced for 108 days in the King’s Cage, breaking every previous record!\u003c/p\u003e\n\u003cp\u003eOn the other side, there were three masters altogether, each of them outstanding Heavenly Demon Seven Stars. They had also trained in the Road of Emperor for months and their strengths had soared up to unimaginable heights. Yan Chi and Maha both had the qualifications to struggle for the title of the third floor’s number one master!\u003c/p\u003e\n\u003cp\u003eSuch a powerful lineup of masters!\u003c/p\u003e\n\u003cp\u003eThree against one!\u003c/p\u003e\n\u003cp\u003eNo matter how one saw it, the Heavenly Demon Seven Stars were more powerful. It was true that Lin Ming must have made some great breakthrough in the King’s Cage, but no matter how great a breakthrough he had, just how much better could he be compared to the Heavenly Demon Seven Stars?\u003c/p\u003e\n\u003cp\u003eAfter all, they had entered the Road of Emperor.\u003c/p\u003e\n\u003cp\u003e“I think that Lin Ming can defeat Kai Yang. But against Maha, it’s far too difficult. He will likely lose there!”\u003c/p\u003e\n\u003cp\u003e“It’s not likely to lose but impossible to win. Kai Yan wasn’t weak to begin with. After entering the Road of Emperor, no matter how heaven-defying Lin Ming’s talent is, defeating Kai Yang will likely exhaust all of his strength. How could he continue to fight Maha after that? This Maha might not be any worse than Feng Shen!”\u003c/p\u003e\n\u003cp\u003eThe audience was loudly discussing this match.\u003c/p\u003e\n\u003cp\u003eKai Yang was standing on one side of the arena stage. As an Imp martial artist, his soul force was formidable and his perception was very sensitive. He heard all of these people’s discussions.\u003c/p\u003e\n\u003cp\u003e“Humph, they think that Lin Ming will defeat me but lose to Maha? Do they really think I’m some sort of cannon fodder or something?” Kai Yang sneered. These idiots were all clueless. They talked about the masters of the third floor as if they understood anything, when they themselves were losers!\u003c/p\u003e\n\u003cp\u003e‘This father was closed up in the Road of Emperor for an entire month. The suffering that I’ve endured in there is not what anyone could imagine! You think I’ll lose to Lin Ming? Hehe, just you all wait and see!’\u003c/p\u003e\n\u003cp\u003eAs Kai Yang remembered his experience within the Road of Emperor, he felt a lingering fear in his heart. But such an experience, after he had suffered through it all and bore the pain, his harvest had been great. After his leap in strength he had been holding it all in so that he could wait for the one moment when he needed to soar.\u003c/p\u003e\n\u003cp\u003eAnd at this moment, Lin Ming suddenly appeared.\u003c/p\u003e\n\u003cp\u003eHe wore blue clothes, and gripped his Purple Comet Spear as he walked up onstage. His steps were steady and he had a calm air around him.\u003c/p\u003e\n\u003cp\u003e“Lin Ming! You’ve finally shown up!”\u003c/p\u003e\n\u003cp\u003eKai Yang’s lips curved up in a cruel and ferocious smile. The moment to prove himself had come!\u003c/p\u003e\n\u003cp\u003e‘With my most powerful ability, I will defeat you with overwhelming strength. I will have everyone’s eyes pop out of their heads in amazement! I will have them all realize that their own judgements were stupid and wrong!’\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCa!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eKai Yang drew out his treasure saber. This saber was pure black without even the faintest sheen. As one looked at it, it made their souls feel mired in mud.\u003c/p\u003e\n\u003cp\u003e“The black saber – Soul Extinguisher!”\u003c/p\u003e\n\u003cp\u003eAs martial artists saw this saber, their hearts went cold. It was heard that Kai Yang’s Soul Extinguisher Saber came from the ruins of an ancient battlefield, the treasure saber of an ancient death god. Underneath this saber, countless martial artists had perished, their demented spirits trapped and sealed within.\u003c/p\u003e\n\u003cp\u003eOnce one was cut by this saber, their souls could be directly sliced in half!\u003c/p\u003e\n\u003cp\u003eIn addition to that, Kai Yang was originally an Imp, part of the race that was incomparably familiar with soul attacks. With both of these factors together, their combined might was incredible!\u003c/p\u003e\n\u003cp\u003eAs everyone saw this Soul Extinguisher Saber as well as the deep and foreboding aura that rolled off of Kai Yang’s body, all the martial artists that predicted that Kai Yang would lose to Lin Ming suddenly shut their mouths.\u003c/p\u003e\n\u003cp\u003eKai Yang’s strength was absolutely at an abnormally freakish level! It was just that his fame had been overshadowed by Maha and Yan Chi so others had subconsciously ignored him.\u003c/p\u003e\n\u003cp\u003eLin Ming grasped the Purple Comet Spear and calmly stood in front of Kai Yang. His aura was restrained within himself, hidden. He was like a matchless treasure spear standing proud. Kai Yan’s aura that reached him was naturally split apart, having no impact at all on Lin Ming.\u003c/p\u003e\n\u003cp\u003eThe two stood in sharp opposition!\u003c/p\u003e\n\u003cp\u003eThe audience held their breath.\u003c/p\u003e\n\u003cp\u003eFeng Shen had crossed his arms across his chest, his eyes fixed on Lin Ming.\u003c/p\u003e\n\u003cp\u003eHigh Lord Heian was jeering, waiting for Lin Ming to die.\u003c/p\u003e\n\u003cp\u003eThere was not a single movement from the audience. It was like a sense of stillness had fallen over the entire arena, the air condensing into a heavy essence that fell over them, incomparably heavy.\u003c/p\u003e\n\u003cp\u003eEveryone’s eyes were focused on Lin Ming and Kai Yang.\u003c/p\u003e\n\u003cp\u003e“Lin Ming, you seem to believe in yourself a bit. But, in Skysplit Tower, those that are too confident usually end up dead. You do not understand the depths of my strength yet you have agreed to challenge me. How stupid of you! Now die!”\u003c/p\u003e\n\u003cp\u003eKai Yang shouted as he took a step forwards. The Soul Extinguisher Saber formed a massive billowing storm of demon essence. A saber slashed down at Lin Ming!\u003c/p\u003e\n\u003cp\u003eDemonic Cloud Storm!\u003c/p\u003e\n\u003cp\u003eThe demonic clouds turned into a violent and cruel black wind, covering the air as it swept towards Lin Ming, making it so that people couldn’t see directly ahead. The surrounding martial artists all felt like a chilling wind had seeped into their bones, their hearts inexplicably turning cold!\u003c/p\u003e\n\u003cp\u003eLin Ming ignored it all as if none of this affected him and casually thrust out his spear!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBang!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe black soul storm was torn apart by Lin Ming’s spear, the storm disappearing into nothingness. But as Lin Ming stood there, not a single hair on his body was affected. Only the lower hems of his robe had been lifted a bit.\u003c/p\u003e\n\u003cp\u003e“If you don’t come with everything you have, you won’t have the chance anymore.”\u003c/p\u003e\n\u003cp\u003e“Humph! How arrogant!”\u003c/p\u003e\n\u003cp\u003eKai Yang grit his teeth. He revolved his bodily true essence to the limit, and then, at his side, a long arc of black light formed. This arc of light lingered on as if it were black thunder.\u003c/p\u003e\n\u003cp\u003e“Mm? Kai Yang has never used this move before!” Kai Yang had already been on the third floor for several years. All of the martial artists there thought they had a good grasp of Kai Yang’s cultivation methods, but this move had never been displayed.\u003c/p\u003e\n\u003cp\u003e“It seems to be an attack move that combines a soul and material attack, fusing them together. When this is used with the might of the Soul Extinguisher, this might be most of Kai Yang’s hidden strength!”\u003c/p\u003e\n\u003cp\u003e“Soul attack huh? ...I heard that Lin Ming’s defensive abilities against soul attacks are incredible!”\u003c/p\u003e\n\u003cp\u003eWhen Lin Ming was fighting in Skysplit Tower, he had battled a number of Imp martial artists all the way from the first floor to the third floor. But even so, he had never been injured once by their soul attacks, not even showing the least bit of hardship. The martial artists present were already clear about all the available information on Lin Ming.\u003c/p\u003e\n\u003cp\u003eIf a soul attack was used on Lin Ming, its effects would be greatly reduced.\u003c/p\u003e\n\u003cp\u003eBut Kai Yang still used a soul attack against Lin Ming. Was he really that confident in his soul attacks?\u003c/p\u003e\n\u003cp\u003eAt this time, a cover of light shrouded Kai Yang. Outside of this cover of light were wild arcs of black thunder that completely surrounded him.\u003c/p\u003e\n\u003cp\u003eKai Yang stood there, his lips curved up in a cunning and savage smile. No one knew that this move was one he comprehended from the Road of Emperor. It seemed like an ordinary soul attack, but the truth was that it contained a faint Emperor Will.\u003c/p\u003e\n\u003cp\u003eThis was also the greatest card hidden in his hand.\u003c/p\u003e\n\u003cp\u003e“Let’s go. I will use my strongest attack to defeat you. From this point on, I will show the world just how strong I am! Now, soar to the skies!” Kai Yang cried out. The fierce expression on his face quickly turned crazy.\u003c/p\u003e\n\u003cp\u003eSoul Extinguisher!\u003c/p\u003e\n\u003cp\u003eKai Yang suddenly took a step forwards, his body fusing together with the Soul Extinguisher Saber as it became a black ray of light.\u003c/p\u003e\n\u003cp\u003eAs soon as Lin Ming saw this, his eyebrows shot up. This is…\u003c/p\u003e\n\u003cp\u003eStroking his Purple Comet Spear, Lin Ming finally turned serious. But, it was just a bit serious. True essence erupted from within him, 30% of the Heretical God Force was released!\u003c/p\u003e\n\u003cp\u003eA spear thrust forth. A three foot wide spear light pierced through the skies, smashing into Kai Yang’s saber light like a meteor.\u003c/p\u003e\n\u003cp\u003eAbsolute power crashed. Around the golden spear light, countless arcs of thunder spun!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBang!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe saber light broke in half. Lin Ming’s spear light struck Kai Yang.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePuff!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eKai Yang spat out a mouthful of blood and hit the floor, cracking the tiles underneath him as well.\u003c/p\u003e\n\u003cp\u003eBut at the same time, a wisp of strange will drilled into Lin Ming’s body like a viper, directly rushing towards his spiritual sea!\u003c/p\u003e\n\u003cp\u003eThis was not an ordinary soul attack, but a strange force that Lin Ming had never encountered before. This strange force wanted to tear Lin Ming’s spiritual sea apart!\u003c/p\u003e\n\u003cp\u003eThe audience didn’t have time to respond to this sudden change. Kai Yang used his saber to prop himself up. Although his face was wet with blood, a hideously crazed expression split his face.\u003c/p\u003e\n\u003cp\u003e“Hahahaha! You are finished! Now that my Emperor Will has struck you, you will absolutely die!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-598\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-600\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-599","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
