{"id":54580,"no":635,"title":"Chapter 634 - Forming the Revolving Core","content":"\u003cp\u003eChapter 634 – Forming the Revolving Core\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eNormally, the ones that die in a squad were the weaklings. Duanmu Qun didn’t think that Lin Ming would fall here. Even if he heard this news from Lan Xin’s own mouth, he found it hard to believe.\u003c/p\u003e\n\u003cp\u003e“Hehe, it’s not that the chances of him dying were high, but his death was basically determined.” Not too far away from Lan Xin, a Fey youth smirked.\u003c/p\u003e\n\u003cp\u003eIf this was just after a disaster and everyone had scattered, then it could be said that Lin Ming had gone missing. But, the situation was different. They had arranged to meet after an hour but Lin Ming still hadn’t returned. If he hadn’t died then just what could it be?\u003c/p\u003e\n\u003cp\u003e“What really happened?” Duanmu Qun asked.\u003c/p\u003e\n\u003cp\u003eThe Fey youth vividly recounted the process of Lin Ming’s death, highlighting repeatedly that he had loudly discouraged him from returning, but Lin Ming had only insisted on being foolish. Finally, he had chosen the wrong method to tackle his problem and ended up never returning.\u003c/p\u003e\n\u003cp\u003eAfter the Fey youth spoke, Duanmu Qun frowned. A lost spatial ring? This reason seemed a bit far-fetched, but still passable. If Lin Ming had really fallen here because of this reason, then that was too great of a pity. To not be able to find a rival in his life… it was like Duanmu Qun had lost a goal in life.\u003c/p\u003e\n\u003cp\u003eStanding alone on a peak, if one didn’t see a higher peak, then it would be easy for their vision to be limited, resulting in them wasting their potential.\u003c/p\u003e\n\u003cp\u003eAs they were speaking, another squad arrived. This squad only had eight people remaining. In this group were two heaven-step Asura Emperor level talents. One was Feng Shen, and the other was the Great Ax Tower’s Blackstone.\u003c/p\u003e\n\u003cp\u003eAs soon as Feng Shen arrived his eyes locked onto Sada’s squad. He clearly remembered that Lin Ming was in this squad. He was curious as to just what lucky chances Lin Ming had obtained.\u003c/p\u003e\n\u003cp\u003eHowever, as he didn’t find Lin Ming, a bit of confusion clouded his eyes.\u003c/p\u003e\n\u003cp\u003e“There’s no need to look, Lin Ming’s gone missing!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun’s voice sounded out near Feng Shen’s ear.\u003c/p\u003e\n\u003cp\u003eThe peak Emperor level talents of the Skysplit Towers were often Fey. Feng Shen also came from a Holy Land and was old acquaintances with Duanmu Qun.\u003c/p\u003e\n\u003cp\u003e“He’s missing?” Feng Shen asked, startled.\u003c/p\u003e\n\u003cp\u003e“Mm… the chances of him dying are very high…” Duanmu Qun shook his head, thinking it was too great a pity.\u003c/p\u003e\n\u003cp\u003e“Lin Ming died?” Blackstone arrived with Feng Shen, and after hearing this news, was initially surprised. But he immediately smiled with disdain. Seeing was far better than believing. These top Emperor level talents were never convinced by word of mouth unless they could see with their own eyes. Blackstone had long heard rumors about Lin Ming’s talent and genius, but he had naturally played these all down in his heart.\u003c/p\u003e\n\u003cp\u003eBlackstone originally didn’t believe Lin Ming was so great. Now that he died in the 8500 mile journey here, he had an expected and satisfied expression on his face.\u003c/p\u003e\n\u003cp\u003eHe laughed and said, “I heard that Lin Ming was the greatest number one talent of the Holy Demon Continent for the least 10,000 years. But, it seems this fame was a bit cheap. To die here, heh, how mediocre!”\u003c/p\u003e\n\u003cp\u003eFeng Shen frowned as he heard this. He scowled as he said, “The facts are still unknown. According to common sense, Lin Ming should have died. However, there are always incredible and unbelievable miracles occurring \u0026nbsp;around Lin Ming!”\u003c/p\u003e\n\u003cp\u003e“Hehe, Feng Shen, I think you’ve been unnerved by Lin Ming in your heart and already have thoughts taken root in your mind\u0026nbsp; that you are inferior to Lin Ming! Once you have such thoughts, you will never surpass that person in your life!” Blackstone looked at Feng Shen with derision. When a talent loses their proud and lofty nature, their potential for growth greatly suffers.\u003c/p\u003e\n\u003cp\u003eFeng Shen didn’t speak anymore. His natural disposition was disinclined to argue with others to begin with. All he thought that was when Lin Ming entered the King’s Cage for 108 days, everyone had thought he had died, but, he had emerged at the last moment, not only alive, but with strength\u0026nbsp; that had soared shockingly, instantly proceeding to kill High Lord Heian.\u003c/p\u003e\n\u003cp\u003eThis was the same as that time… could Lin Ming have really died?\u003c/p\u003e\n\u003cp\u003eSeeing Feng Shen’s silence, Duanmu Qun walked over and patted Feng Shen’s shoulder in consolation, saying, “Although Blackstone’s\u0026nbsp; words are crude, he does still have a point. The thought of being inferior to Lin Ming had truly taken root in your heart\u0026nbsp;!”\u003c/p\u003e\n\u003cp\u003eFeng Shen shook his head and calmly said, “If I am inferior then I am inferior, it’s as simple as that. I never thought of surpassing Lin Ming. As long as I can keep up with his footsteps, then that is enough for me to be a leading hero of the future world.”\u003c/p\u003e\n\u003cp\u003eWith nothing else to say, he went to sit on a boulder and meditate. Out of all the young geniuses present, he was the only one who had come from the same Skysplit Tower as Lin Ming.\u003c/p\u003e\n\u003cp\u003eHe was the only one who had seen Lin Ming’s terrifying talent with his own eyes, his jaw-dropping speed of growth and his heaven defying strength!\u003c/p\u003e\n\u003cp\u003eWhen Feng Shen had seen all of this with his own eyes, he had only been able to sigh with envy and admiration!\u003c/p\u003e\n\u003cp\u003eNews of Lin Ming’s disappearance quickly spread around. After all, these people hadn’t come from the same Skysplit Tower as Lin Ming so they were naturally suspicious about his rumors to begin with\u0026nbsp;. After hearing that Lin Ming most likely died here, they also began to believe that this was as expected. Surely, Lin Ming was overrated.\u003c/p\u003e\n\u003cp\u003eRegardless of whether Lin Ming had truly been strong, his luck was simply too bad, or, perhaps the rumors were also exaggerated. In short, a genius that died was no longer a genius.\u003c/p\u003e\n\u003cp\u003eAn Emperor sat on a throne of a million bones. No matter how brilliant or majestic Lin Ming had been before his death, after dying, he had simply become one of the countless bleached bones paving the road for others to become Emperors!\u003c/p\u003e\n\u003cp\u003eThe topic of Lin Ming’s disappearance or death aroused several hours of discussion. Then, it began to die down. There were too many geniuses that died. With the passing of time, such people were destined to be forgotten in the sands of time.\u003c/p\u003e\n\u003cp\u003eThe people \u0026nbsp;waited like this \u0026nbsp;for three days. Slowly, they discovered that something was wrong. At the time they first set out, besides some lone Chief High Lords, there were a total of nine squads. But now, they were one squad short! There were only eight squads left, and in these three days, there had been no sign of them.\u003c/p\u003e\n\u003cp\u003eIt had to be known that the guides had special methods to communicate with each other. But now these communication methods were like stones dropped into the ocean, without the slightest response.\u003c/p\u003e\n\u003cp\u003eHad they been annihilated!?\u003c/p\u003e\n\u003cp\u003eRealizing this, everyone felt chills creep up their backs.\u003c/p\u003e\n\u003cp\u003eAn entire squad of 10 people, including even an experienced guide and powerful High Lords, was actually completely annihilated. Just what sort of terrifying situation had they come across?\u003c/p\u003e\n\u003cp\u003eWas it the legendary evil spirit \u0026nbsp;from the Eternal Demon Abyss?\u003c/p\u003e\n\u003cp\u003eThinking of this, every martial artist felt a surging cold in the air. If their squad had encountered the same things, then their fate might not have been much better!\u003c/p\u003e\n\u003cp\u003eAt this point, Sada quietly stood up and said, “It’s time, we will not wait here any longer. We will return. You can consider returning with one of us eight guides back along the old route we took. But, all the resources that are found on the return trip will not be shared with you. Or, you may now enter the 1500 radius of the Eternal Demon Abyss’ edge. There, the dangers are doubled or even tripled. Even we do not dare to rashly enter, so carefully consider your choice!\u003c/p\u003e\n\u003cp\u003eAfter Sada finished, he glanced over the crowd. A great number of martial artists had hesitation in their eyes. After learning that an entire squad had been annihilated, this news left a lingering fear within their minds. If they entered deep within the 1500 mile radius periphery of the Eternal Demon Abyss, their team might break up. Then, not only would they need to resist the threats of those evil spirits, but they also had to defend against their own companions murdering them for their wealth. The risks could be imagined!\u003c/p\u003e\n\u003cp\u003eThinking of this, those talents that had originally been full of confidence and wanted to rush into the 1200 mile radius of the Eternal Demon Abyss began to show signs of retreat.\u003c/p\u003e\n\u003cp\u003eThey looked at each other with dread. In the face of such great lucky chances as well as such significant dangers, everyone hesitated...\u003c/p\u003e\n\u003cp\u003e……………\u003c/p\u003e\n\u003cp\u003eAs all the martial artists were gathered at the meeting point 1500 miles from the Eternal Demon Abyss, Lin Ming was in the middle-late stages of breaking through to Revolving Core!\u003c/p\u003e\n\u003cp\u003eAll of the energy within Lin Ming’s meridians had been poured into his dantian. True essence was constantly forming into tiny grains, slowly spinning into a true essence cyclone there. The more it spun, the closer they approached the center, finally settling at the center of the cyclone and condensing into a spinning crystal core.\u003c/p\u003e\n\u003cp\u003eThis was… the Revolving Core.\u003c/p\u003e\n\u003cp\u003eThe reason that the Revolving Core was called ‘revolving’ core, was because the core was always spinning.\u003c/p\u003e\n\u003cp\u003eWhen a martial artist was at the Houtian realm, their dantian had just opened and their true essence was in chaos. With no regulations at all, the efficiency of this true essence was naturally low. When a martial artist reached the Xiantian realm, the true essence would form a stable true essence cyclone in their dantian, increasing the efficiency by another level. However, the total amount of true essence wouldn’t increase by too much. Finally, when a martial artist arrived at the Revolving Core realm, the true essence cyclone in their dantian would condense into a revolving true essence crystal core, with their total amounts of true essence increasing by a large margin!\u003c/p\u003e\n\u003cp\u003eThe spinning true essence turning into a crystal core was just like some celestial bodies of the universe turning into a rotating form.\u003c/p\u003e\n\u003cp\u003eThis was the so-called similarities of the Great Dao. The human body became a miniature universe.\u003c/p\u003e\n\u003cp\u003eAs another day passed, the Revolving Core in Lin Ming’s dantian was now the size of a pigeon’s egg.\u003c/p\u003e\n\u003cp\u003eDemonshine watched from the side. These days, this sleep-loving old dog had been finding it hard to stay awake as it was always carefully guarding the surroundings. As a result, it witnessed the entire process of Lin Ming attacking the Revolving Core realm.\u003c/p\u003e\n\u003cp\u003eA pigeon’s egg sized Revolving Core was a tad larger than a normal martial artists Revolving Core. Demonshine wasn’t surprised by this. In general, the more true essence a martial artist had, the larger their Revolving Core would be.\u003c/p\u003e\n\u003cp\u003eIf the Revolving Core that Lin Ming formed wasn’t much larger than other martial artists, then Demonshine would have thought that something was wrong.\u003c/p\u003e\n\u003cp\u003eAnother day later, Lin Ming’s Revolving Core grew yet again, this time turning into a more normal looking sphere. Now, it was around the size of a walnut. This Revolving Core was about 25% larger than a normal martial artist’s Revolving Core.\u003c/p\u003e\n\u003cp\u003eDemonshine rubbed his chins with his paws, nodding in praise.\u003c/p\u003e\n\u003cp\u003eAnother day passed. The Revolving Core grew once more to the size of a wild hen’s egg. Now, Demonshine was finding it hard to remain calm. This size had exceeded his expectations!\u003c/p\u003e\n\u003cp\u003eBut this wasn’t Lin Ming’s limit. After another day, the Revolving Core became the size of a chicken’s egg. Demonshine began to gulp. This was already twice the size of a normal martial artist’s Revolving Core!\u003c/p\u003e\n\u003cp\u003e“This boy, just what degree will he grow to?” Demonshine sucked in his long doggy tongue, his eyes staring unblinkingly at the true essence crystal core condensing in Lin Ming’s Dantian.\u003c/p\u003e\n\u003cp\u003eThen, the fifth day followed. The Revolving Core did not increase in size. But after that, Demonshine’s astonishment did not stop, rather, it increased.\u003c/p\u003e\n\u003cp\u003eThe Revolving Core in Lin Ming’s dantian hadn’t changed in size, but the inherent true essence began to grow more concentrated. As more true essence grains fused with the Revolving Core, the energy within became increasingly rich!\u003c/p\u003e\n\u003cp\u003eOn the sixth day, the Revolving Core shrunk, going back to the size of a wild hen’s egg. But, not only did the total amount of true essence not decrease, but it instead increased by another level!\u003c/p\u003e\n\u003cp\u003eAt this point, Demonshine was already a bit numb.\u003c/p\u003e\n\u003cp\u003eThis boy was simply a monstrous freak, an abnormally monstrous freak!\u003c/p\u003e\n\u003cp\u003eOn the seventh day, the Revolving Core shrunk once again, returning to the size of a walnut. This Revolving Core wasn’t much larger than an ordinary martial artist’s, but the total true essence quantity within was many times greater than that of an ordinary martial artist’s!\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-633\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-635\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-634","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
