{"id":54595,"no":650,"title":"Chapter 649 - Two Spears Till Death","content":"\u003cp\u003eChapter 649 – Two Spears Till Death\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eThe three new corpse devils that appeared were tall and fierce-looking. From their appearances, they had been Giant Demons and Goliaths before they died. With the female corpse devil, that was a total of four corpse devils. Just any one of them was stronger than Duanmu Qun; how could they even fight this!?\u003c/p\u003e\n\u003cp\u003eBlackstone felt his heart sink into chilling despair. Lan Xing and Feng Shen also paled.\u003c/p\u003e\n\u003cp\u003e“Let’s all rush out in one direction!”\u003c/p\u003e\n\u003cp\u003eHigh Lord Cloud Demon took the initiative to launch an attack. He took out a lance from his spatial ring and thrust straight towards a Goliath corpse devil!\u003c/p\u003e\n\u003cp\u003eHe poured all of his demon essence into this strike – there was no holding back!\u003c/p\u003e\n\u003cp\u003eGhostly Dragon Emperor Strike!\u003c/p\u003e\n\u003cp\u003eA lance thrust forth, causing massive waves of black true essence to rise up. All of the surroundings rocks were crushed by the lance’s energy, falling down like a hailstorm!\u003c/p\u003e\n\u003cp\u003eThe corpse devil that this attack was aimed at cunningly smiled. It stretched out a glowing green claw, directly blocking the lance!\u003c/p\u003e\n\u003cp\u003eA claw of flesh was actually able to resist High Lord Cloud Demon’s heaven-step treasure! With a \u003cem\u003e‘kacha’\u003c/em\u003e sound, High Lord Cloud Demon’s spear was firmly grasped by the corpse devil!\u003c/p\u003e\n\u003cp\u003eHigh Lord Cloud Demon was whiter than paper. For this strike, he had used a secret Goliath technique that wounded himself to increase his power. In addition, with his full strength and also his low-grade heaven-step treasure lance, this was enough to crack apart a large hill. But this corpse devil had actually blocked it with a claw.\u003c/p\u003e\n\u003cp\u003eWhat sort of strange power was this? What sort of terrifying body strength was this!?\u003c/p\u003e\n\u003cp\u003eBut at this moment, Duanmu Qun, Lan Xin, and Feng Shen all rushed forwards. Their three heaven-step long swords all cut down together!\u003c/p\u003e\n\u003cp\u003e“Attack the eyes!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun fully realized just how terrifying the defensive power of these corpse devils was. A sword cut apart both the eyes of the corpse devil. A savage and brutal rain of sword light came falling down, directly covering the corpse devil in a hail of incomparably keen energy!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePeng peng!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe corpse devil’s rotten eyes burst apart. However, to a corpse devil, the truth was that their eyes had already lost their use long ago. They perceived the world through smells and sensing life force. Besides angering, these attacks hadn’t done anything at all.\u003c/p\u003e\n\u003cp\u003e“Houuu!”\u003c/p\u003e\n\u003cp\u003eA corpse devil roared. Everyone around felt their ears ache with numbness, their eardrums almost rupturing. Next, a Goliath corpse devil swept out his claw and caught all three heaven-step swords in his grasp.\u003c/p\u003e\n\u003cp\u003eThese three swords were originally soft swords. After being grasped by the Goliath corpse devil, there was a screeching sound as all three swords began to twist and bend under the massive pressure!\u003c/p\u003e\n\u003cp\u003eMeanwhile, that green-haired devil corpse also shot forwards, striking out a claw at Lan Xin and Feng Shen!\u003c/p\u003e\n\u003cp\u003eAt this time, Lan Xin and Feng Shen had their swords grabbed by the Goliath corpse devil; it was impossible to pull them back out. They could only escape if they abandoned their swords. But, facing these corpse devils without their weapons, their fates could be imagined!\u003c/p\u003e\n\u003cp\u003eThey had never thought that even with a combination of four attacks, they wouldn’t even able to tear open an exit in this encirclement!\u003c/p\u003e\n\u003cp\u003eThese corpse devils were far too terrifying!\u003c/p\u003e\n\u003cp\u003e“Careful! Their claws are poisonous!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun shouted out. As his words were half out, he was suddenly surprised. He found that Lin Ming, who hadn’t yet attacked, had actually appeared behind the green-haired corpse devil. Lin Ming held the Purple Comet Spear in his hands, his face expressionless. Atop the spearpoint, a cold light sparked!\u003c/p\u003e\n\u003cp\u003eDeath!\u003c/p\u003e\n\u003cp\u003eA brilliant light flashed in Lin Ming’s eyes.\u003c/p\u003e\n\u003cp\u003eThe Heretical God Force was opened to the limit, compressed true essence erupted in surging waves, the power of thunder and fire wove together…\u003c/p\u003e\n\u003cp\u003ePenetrating Rainbow!\u003c/p\u003e\n\u003cp\u003eA spear shot out. This strike contained the will of a bronze level battle spirit. Combined with the terrifying energy, even the void around the spear trembled!\u003c/p\u003e\n\u003cp\u003eThe female corpse cackled, not bothering to dodge, allowing this spear to stab at her. At that same time, she swiveled around, reaching her claw out at Lin Ming’s neck!\u003c/p\u003e\n\u003cp\u003e“Lin Ming, be careful!”\u003c/p\u003e\n\u003cp\u003eLan Xin and Feng Shen’s expressions immediately changed. This female corpse devil had ridiculous defensive powers. She was able to ignore any and all attacks, countering in a terrifying manner. Once those glowing green claws broke through one’s protective true essence, even if it was only a minor wound, the corpse poison would be enough to cause an agonizingly painful death!\u003c/p\u003e\n\u003cp\u003eIf a martial artist were to collide with this female corpse devil, they would absolutely suffer a great loss!\u003c/p\u003e\n\u003cp\u003eHowever, facing the attack of this green-haired corpse devil, Lin Ming simply didn’t care. His spear thrust out like before!\u003c/p\u003e\n\u003cp\u003eSeeing that claw nearing Lin Ming’s neck, Lan Xin and Feng Shen became incomparably pale. But, that green-haired corpse devil was laughing like a macabre maniac!\u003c/p\u003e\n\u003cp\u003e“Gegegege!”\u003c/p\u003e\n\u003cp\u003eBut at this moment, an unbelievable scene occurred.\u003c/p\u003e\n\u003cp\u003eThe claw of the female corpse devil seemed to suddenly slow down, and the Purple Comet Spear in Lin Ming’s hands suddenly accelerated!\u003c/p\u003e\n\u003cp\u003eThe power of thunder and fire twisted together; the bronze battle spirit erupted! With a \u003cem\u003e‘chi’\u003c/em\u003e sound, the Purple Comet Spear pierced through the green-haired corpse devil’s throat!\u003c/p\u003e\n\u003cp\u003eWith a twist of the spear, the female corpse devil had half her neck torn off!\u003c/p\u003e\n\u003cp\u003eBut at this time, when the green-haired corpse devil’s claw was only half a foot from Lin Ming, he suddenly drew backwards. As he pulled back his long spear, a wisp of purple lightning shined on the tip!\u003c/p\u003e\n\u003cp\u003eA thrust, a retreat, completely clean!\u003c/p\u003e\n\u003cp\u003eThe sudden turn in events stunned Lan Xin. Even Feng Shen, who kept Lin Ming in the highest esteem, still had his mouth hanging wide open. He nearly forgot that his own sword was grasped in the hand of the Goliath corpse devil.\u003c/p\u003e\n\u003cp\u003eThey had attacked the green-haired corpse devil so they personally knew just how terrifying its defensive power was. It was like refined gold, immune to all attacks!\u003c/p\u003e\n\u003cp\u003eBut now, Lin Ming had actually penetrated it with a spear… just what had happened!?\u003c/p\u003e\n\u003cp\u003e“Lin Ming…” Lan Xin gulped, not sure what to say.\u003c/p\u003e\n\u003cp\u003e“What’re you acting so shocked about!? Attack!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun’s few words brought everyone back to reality. As the Goliath corpse devil was distracted, he took advantage of this and kicked it in the face, pulling his sword back out.\u003c/p\u003e\n\u003cp\u003e“Kill!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun had amazingly fast hand and eye reflexes. He sliced at the green-haired female devil corpse\u0027s neck, hoping to cut off the other half of its neck.\u003c/p\u003e\n\u003cp\u003eFeng Shen, Lan Xin, and High Lord Cloud Demon all seemed to awaken from some hazy dream. Immediately, they all used their ultimate killing strikes to attack the wounded green-haired corpse devil!\u003c/p\u003e\n\u003cp\u003eWith the sound of scraping metal, Duanmu Qun’s sword energies ruthlessly rushed onto the green-haired corpse devil, but, he actually wasn’t able to break past her defenses. This caused him to panic, horrified.\u003c/p\u003e\n\u003cp\u003eJust what had Lin Ming done with his strike just then that he was able to penetrate her?\u003c/p\u003e\n\u003cp\u003eAt this time, Lin Ming had already taken out his spear and drawn back several dozen feet. As he was about to launch another attack, he felt his Purple Comet Spear shake.\u003c/p\u003e\n\u003cp\u003eThat strike just now had placed a tremendous burden on the Purple Comet Spear. If it wasn’t for the battle spirit attached to it, then he feared it wouldn’t have been able to pierce through her.\u003c/p\u003e\n\u003cp\u003eIt had to be known Feng Shen, Lan Xin, Duanmu Qun, and High Lord Cloud Demon were all Holy Land descendants or Skysplit Tower High Lords; all of them were unbelievably rich and influential people. The weapons they used were all low-grade heaven-step treasures, around the same quality as that of Xuan Wuji’s. As for Lin Ming, the Purple Comet Spear in his hand was only a peak high-grade earth-step treasure. In such a high intensity fight, piercing through the hard corpse devil’s neck had been very difficult.\u003c/p\u003e\n\u003cp\u003e“These corpse devils’ bodies are too hard. If I didn’t have my battle spirit then even I wouldn’t be able to do anything!”\u003c/p\u003e\n\u003cp\u003eLin Ming frowned. These corpse devils’ bodies, after being tempered with infernal energy over tens of thousands of years, had already reached a degree of hardness at the same level as a low-grade heaven-step treasure. Duanmu Qun’s attacks hadn’t been able to break through the corpse devil’s defense because the difficulty of that was the same as destroying an entire heaven-step treasure.\u003c/p\u003e\n\u003cp\u003e“Ahh!”\u003c/p\u003e\n\u003cp\u003eAt this time, a miserable scream sounded out. Lin Ming took a closer look and knit his eyebrows together. The one who was injured was Blackstone. Just now, as everyone was collectively attacking the corpse devils, this fellow had hidden in the back. But now the other two corpse devils had attacked him.\u003c/p\u003e\n\u003cp\u003eBlackstone was also a Holy Land descendant, he was not some common genius of his generation. As the two corpse devils attacked him from both sides, he abruptly twisted his body, thinking he had escaped the attack, but the strike had actually managed to scratch his left arm.\u003c/p\u003e\n\u003cp\u003eThe corpse devil’s green claws could break apart even the hardest defenses. The claw directly tore apart Blackstone’s protective demon essence and scraped the flesh!\u003c/p\u003e\n\u003cp\u003eEven though this was a minor wound, Blackstone’s expression suddenly changed. He helplessly watched on as the flesh of his left arm began to corrode away at a speed visible to the naked eye. The tendrils of pain that spread out caused his face to twist in agony, drops of cold sweat dripping down his body!\u003c/p\u003e\n\u003cp\u003e“Cut it off!”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun’s pupils shrank. At that time, he couldn’t bother to ask why Blackstone didn’t join in the attack just now. His figure flashed and he immediately appeared in front of Blackstone, his sword already falling down!\u003c/p\u003e\n\u003cp\u003e“No!!!”\u003c/p\u003e\n\u003cp\u003eBlackstone whimpered and writhed, wanting to stop this strike. But Duanmu Qun’s sword was too fast. With a flash of sword light, a bloody light shined in response. A bloody left arm flew out in the air, completely corroded by corpse poison in midair and becoming nothing but white bones.\u003c/p\u003e\n\u003cp\u003eWhat a ghastly corpse poison!\u003c/p\u003e\n\u003cp\u003eAs Lin Ming saw this, he felt his scalp tingle with horror!\u003c/p\u003e\n\u003cp\u003e“Ahhhhhh!”\u003c/p\u003e\n\u003cp\u003eBlackstone cried out in anger, pain, and misery. To a martial artist, the value of an arm was obvious!\u003c/p\u003e\n\u003cp\u003eIn this world, there were many top miracle medicines that were able to regrow limbs. But, these medicines could only speed up the growth of a new arm that had never been tempered. This new limb would be weak, with low defense. If one wished to train it to the strength of the other arm then that was impossible.\u003c/p\u003e\n\u003cp\u003eIn other words, Blackstone’s left arm would forever be his weakness!\u003c/p\u003e\n\u003cp\u003eAs Duanmu Qun saw this, he could only shake his head. All of this had been brought on by Blackstone himself.\u003c/p\u003e\n\u003cp\u003eBlackstone was the weakest amongst everyone present. He never thought of joining in with Duanmu Qun and the others in their hopeless battle to begin with. From the very start he had planned on them rushing in and then running away in the chaos. But he didn’t think that Lin Ming would appear and reverse the battle situation with a single spear strike. Instead, it was him that had been attacked from the back by the pincer attacks of two corpse devils.\u003c/p\u003e\n\u003cp\u003e“Attack together, we’ll finish one off first! Divert their attention and allow Lin Ming to be the main attack!” Duanmu Qun rapidly judged the situation on the battlefield. After these few exchanges of moves, he discovered that although these corpse devils had amazing defense, terrifying striking power, and were also fast, they still had one fatal weakness. That was that their intelligence was low and their responses were slow!\u003c/p\u003e\n\u003cp\u003eOtherwise, these four corpse devils would have coordinated their attacks, and the ones injured wouldn’t be just Blackstone.\u003c/p\u003e\n\u003cp\u003eFeng Shen, Lan Xin and High Lord Cloud Demon spoke no further. They flourished the swords and spears in their hands, creating a weave of sharp light that covered the green-haired corpse devil.\u003c/p\u003e\n\u003cp\u003eBut, that green-haired corpse devil had already plunged into a state of rabid craziness. It ignored Feng Shen, Lan Xin, and the rest, desperately rushing towards Lin Ming, a manic and savage light in its eyes as it vowed to rip Lin Ming to shreds!\u003c/p\u003e\n\u003cp\u003eLin Ming eyes flashed with a grim light. The battle spirit in his spiritual sea fused onto the Purple Comet Spear. At the same time, he completely opened the Heretical God Force and burned the blood of the Ancient Phoenix.\u003c/p\u003e\n\u003cp\u003eWith a burst of spear light, Lin Ming stepped forwards, the Purple Comet Spear in his hands howling like an azure dragon!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eChi!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Purple Comet Spear easily thrust through the green-haired corpse devil’s neck once more. With a twist of the spear, the spear swept towards the direction opposite last time. With a sound of screeching metal, the other half of the green-haired corpse devil’s neck was cut off!\u003c/p\u003e\n\u003cp\u003eThe entire female corpse devil’s neck was severed, its head flying high into the sky. Its listless body took a few more steps forwards before plopping onto the ground!\u003c/p\u003e\n\u003cp\u003eAs Duanmu Qun, Lan Xin, Feng Shen, and High Lord Cloud Demon saw this, they were all shocked speechless. From start to end, none of them managed to play any significant role; in fact, none of them had even been able to injure the green-haired female corpse demon, and their attempts at distraction had failed.\u003c/p\u003e\n\u003cp\u003eBy himself, Lin Ming had killed off that green-haired corpse devil in two strikes!\u003c/p\u003e\n\u003cp\u003eThis striking power, just how freakishly abnormal was it!?!?\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-648\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-650\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-649","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
