{"id":54607,"no":662,"title":"Chapter 661 - Glory of the Battle Spirit","content":"\u003cp\u003eChapter 661 – Glory of the Battle Spirit\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master was forced back?\u003c/p\u003e\n\u003cp\u003eIn that collision between Lin Ming and the Polaris Tower Master, it was the Polaris Tower Master who was actually forced back!\u003c/p\u003e\n\u003cp\u003eAll of the martial artists present were stunned. It was true that Lin Ming’s aura was no weaker than the Polaris Tower Master’s, but aura didn’t represent a martial artist’s complete strength, and there was also something strange and tricky about Lin Ming’s aura. Moreover, the Polaris Tower Master’s accumulated fame and strength were too great; it was hard for anyone to imagine that a heroic youth could be stronger than him.\u003c/p\u003e\n\u003cp\u003eBut now, in a single exchange of blows, Lin Ming had only been a little shaken, but the Polaris Tower Master was actually forced back 10 whole steps. Although the Polaris Tower Master wasn’t injured, his blood still tumbled and he had eaten no small loss.\u003c/p\u003e\n\u003cp\u003eAt this point, the Polaris Tower Master’s complexion was extremely ugly. He thought that Lin Ming was only using some sort of special force field to suppress his aura, but his strength wasn’t too special.\u003c/p\u003e\n\u003cp\u003eHe didn’t use his sword for his first attack because with his status as a Tower Master, having to go all out to deal with a junior was a bit shameful. Even if he won in the end, people would still criticize him.\u003c/p\u003e\n\u003cp\u003eIn fact, although the Polaris Tower Master’s weapon of choice was a great sword, his fist skills were still extremely powerful. The reason he fought with his fist was because he wanted to use Lin Ming to demonstrate his power and authority. But he never that that if he didn’t use his sword, Lin Ming also wouldn’t use his spear and would fight with fists instead!\u003c/p\u003e\n\u003cp\u003eFist against fist, the Polaris Tower Master was confident that he could break Lin Ming’s arm. But, after their fists collided, the Polaris Tower Master discovered that what he hit clearly wasn’t a fist but an iron hammer instead! Not only was Lin Ming’s fist terrifyingly adamantine, but there was also a strange power of vibration within it, nearly causing his own arm to be broken.\u003c/p\u003e\n\u003cp\u003eThis boy, was he really human?\u003c/p\u003e\n\u003cp\u003eAlthough he guessed that Lin Ming must have practiced some sort of body transformation technique, it was impossible for the human body to be tempered to this degree. This was a durability that was comparable to a treasure! Not even the Giant Demons or Goliaths, races well known for their formidable bodies, would be able to hold a candle to him!\u003c/p\u003e\n\u003cp\u003eJust where had this abnormally monstrous freak come from!?\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master was enraged. He suddenly pulled out a heavy sword from his spatial ring and pointed it straight at Lin Ming!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHuuu –\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eA blazing black flame ignited atop the Polaris Tower Master’s great sword, the aura overwhelming!\u003c/p\u003e\n\u003cp\u003e“Medium-grade heaven-step treasure!?”\u003c/p\u003e\n\u003cp\u003eAll of the surrounding martial artists cried out in alarm. For heaven-step treasures, there were enormous differences between every rank. Within Skysplit Tower, because the High Lords overflowed with far too much wealth, it was common to see them with heaven-step treasures. But, these were mostly the lowest of heaven-step treasures. As for medium-grade heaven-step treasures, only very few people had seen them before.\u003c/p\u003e\n\u003cp\u003e“No, that’s not a medium-grade heaven-step treasure but a peak low-grade heaven-step treasure; it’s only a step away from becoming a medium-grade heaven-step treasure.”\u003c/p\u003e\n\u003cp\u003eEveryone looked at Lin Ming. Lin Ming thought for a moment, and then took out the Purple Comet Spear from his spatial ring.\u003c/p\u003e\n\u003cp\u003eThe Purple Comet Spear was originally crafted from top materials. But, those were considered top materials only relative to a fourth-grade sect like Divine Phoenix Island. Moreover, the one who forged the Purple Comet Spear was Ancestor Chi Yan who was only a middle Revolving Core powerhouse.\u003c/p\u003e\n\u003cp\u003eThus, the Purple Comet Spear within Lin Ming’s hand was only a peak high-grade earth-step treasure.\u003c/p\u003e\n\u003cp\u003e“Lin Ming’s spear is only a high-grade earth-step treasure?”\u003c/p\u003e\n\u003cp\u003eAs everyone saw Lin Ming’s spear, they were surprised before shaking their heads in disappointment.\u003c/p\u003e\n\u003cp\u003eIn fact, as an early Revolving Core powerhouse, it was already excellent that he had a high-grade earth-step treasure weapon. But, placed within the Blood Slaughter Steppes where resources were immeasurably plentiful, and also placed within this group of High Lords and Holy Land descendants, this high-grade earth-step treasure appeared rather shabby instead.\u003c/p\u003e\n\u003cp\u003eWhen compared to the Polaris Tower Master’s great sword, it especially paled. There was a difference of a large boundary between the two. With a mere high-grade earth-step treasure to resist a medium-grade heaven-step treasure, how could he even defend against it?\u003c/p\u003e\n\u003cp\u003e“The difference is too great! Even if Lin Ming is strong, he will suffer too much because of the difference in their treasures. There is no way he’ll be able to fight!”\u003c/p\u003e\n\u003cp\u003eThe use of a treasure did not lie mainly in its ability to increase a martial artist’s combat strength, but rather the degree of its own hardness!\u003c/p\u003e\n\u003cp\u003eIf an inferior treasure were to hit a top ranked treasure, it was possible for the lesser one to break in half!\u003c/p\u003e\n\u003cp\u003eEven Duanmu Qun, Lan Xin, and Feng Shen were feeling nervous for Lin Ming.\u003c/p\u003e\n\u003cp\u003e“Haha! Lin Ming, you want to use that trash spear to face my Heaven Opening Sword, you are really asking to die!” The Polaris Tower Master wickedly grinned as he looked at the Purple Comet Spear in Lin Ming’s hand, his voice filled with contempt and ridicule.\u003c/p\u003e\n\u003cp\u003eAt the start, the Polaris Tower master had wanted to win in a beautiful and awesome manner so that he could establish his authority in front of everyone. But now, after that brief period of fighting, he had changed his mind. Lin Ming’s power had already exceeded his every expectation. As long as he could win then he would be satisfied!\u003c/p\u003e\n\u003cp\u003e“Who lives and who dies, we will know after this battle!” After speaking, Lin Ming’s aura began to rise. Underneath his feet, the land began to rupture from his increasingly sharp aura.\u003c/p\u003e\n\u003cp\u003e“Humph! Your end is imminent and yet you remain such a flippant piece of garbage. Lin Ming, you dared to slander me, you dared to slander the Blood Slaughter Steppes, and for this, I shall take your dog life now!”\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master gave a loud shot and stepped forwards, the land breaking beneath his feet!\u003c/p\u003e\n\u003cp\u003eHis body turned into a stream of light that shot towards Lin Ming, the great sword in his hand cutting down like the peak of a mountain!\u003c/p\u003e\n\u003cp\u003eThis sword was actually aimed towards Lin Ming’s Purple Comet Spear! He wanted to cut apart Lin Ming’s Purple Comet Spear. As long as he succeeded, it was the same as chopping off a tiger’s fangs. Lin Ming’s combat strength would drop to the floor!\u003c/p\u003e\n\u003cp\u003eAs the surrounding martial artists saw this, they all thought in their heart that the Polaris Tower Master’s methods weren’t honorable. But, in a struggle of life and death, the winner was king and the loser was the villain. As for what method was used, none of that was important.\u003c/p\u003e\n\u003cp\u003eLin Ming’s eyes flashed with a cold light. The Heretical God Force opened to the extreme, the Eight Inner Hidden Gates erupted, and the complete battle spirit was fused into the Purple Comet Spear.\u003c/p\u003e\n\u003cp\u003eA battle spirit was invisible and intangible, but it could be attached to any treasure, turning it into an incomparably sharp killing weapon. A trivial withered leaf with a battle spirit attached to it could cut apart a treasure!\u003c/p\u003e\n\u003cp\u003eLin Ming poured his battle spirit into the Purple Comet Spear, and thus, the originally insufficient quality Purple Comet Spear began to shine with a shimmering greenish yellow light; this was the glory of a bronze battle spirit!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eClang!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master’s heavy sword smashed into the Purple Comet Spear, pressing down on it like a great mountain. The earth underneath Lin Ming’s feet exploded and the Purple Comet Spear fiercely bent, but this strike was actually abruptly kept off by Lin Ming!\u003c/p\u003e\n\u003cp\u003e“What!?”\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master was shocked. He never thought that his all-out strike, combined with a peak low-grade heaven-step Heaven Opening Sword would actually not be able to break apart a high-grade earth-step treasure spear!\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master was naturally a greatly experienced genius of his generation. An idea suddenly rose in his heart… could this greenish gray light be… a battle spirit?\u003c/p\u003e\n\u003cp\u003eImpossible! This was impossible!\u003c/p\u003e\n\u003cp\u003eNot only was the Polaris Tower Master shocked, but all the surrounding martial artists were dumbfounded as they saw that the Purple Comet Spear didn’t break. However, in that split-second, no one had time to think about what just happened.\u003c/p\u003e\n\u003cp\u003eThere was only a whistling sound, and then because of the heavy pressure, the curved Purple Comet Spear suddenly snapped back like a whip, shooting straight towards the cheek of the Polaris Tower Master.\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master could no longer afford to think about just what that greenish gray light was on the spear. He pulled back his Heaven Opening Sword and quickly drew away. But even so, the power of thunder still snuck into his body like the strike of a viper\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eChi chi chi!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master felt half of his body instantly paralyzed. That power of thunder also had Lin Ming’s battle spirit attached to it!\u003c/p\u003e\n\u003cp\u003eJust that tiny wisp of battle spirit caused the originally insufficiently ranked Thunder Soul to become incomparably dangerous!\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master wretchedly coughed. But at this moment, Lin Ming had already taken a step forwards. His feet stepped upon Golden Roc Shattering the void and all space seemed to lose meaning underneath his steps. It was as if Lin Ming had directly teleported in front of the Polaris Tower Master, the spear in his hand already thrusting down!\u003c/p\u003e\n\u003cp\u003e“Ahhh!”\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master fiercely bit down on his tongue, forcefully awakening himself with pain. He raised the Heaven Opening Sword in his hand and slashed towards Lin Ming.\u003c/p\u003e\n\u003cp\u003eHe was trying to use a purely offensive strike to force Lin Ming to retreat.\u003c/p\u003e\n\u003cp\u003eBut in this moment, the flow of time seemed to slow down around the Polaris Tower Master. His sword seemed stuck in a bog even as Lin Ming’s spear shot out like a blazing meteor, its speed reaching the extreme!\u003c/p\u003e\n\u003cp\u003eConcept of Time!?\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master’s eyes turned bloodshot. Under the threat of death, he erupted with 120% of his potential, emitting a terrifying energy and using it to directly burst out of the time cage. At the moment that Lin Ming’s spear thrust down, he moved completely contrary to the laws of physics, forcing that spear that would have struck his heart to stab into his left shoulder instead!\u003c/p\u003e\n\u003cp\u003eWith the infusion of battle spirit, Lin Ming’s spear cut through the Polaris Tower Master’s protective demon essence like it was tofu, stabbing his shoulder and penetrating straight through!\u003c/p\u003e\n\u003cp\u003eBlood shot out; Lin Ming’s spear had broken the Polaris Tower Master’s clavicle!\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master’s eyes flashed with the light of insanity. He used his muscles to firmly clamp down on the Purple Comet Spear and then slashed his sword towards Lin Ming’s neck! He wanted to use this opportunity with the Purple Comet Spear stuck in his body to cut off Lin Ming’s head!\u003c/p\u003e\n\u003cp\u003eLin Ming only coldly sneered. True essence erupted from the Purple Comet Spear. Each wisp of true essence had a touch of battle spirit fused with it, shooting out like a pack of steel needles. The Polaris Tower Master’s meridians and muscles in his left shoulder had become a twisted mess!\u003c/p\u003e\n\u003cp\u003eAs a result, the strength of the muscles imprisoning his spear no longer existed.\u003c/p\u003e\n\u003cp\u003eLin Ming’s figure dodged backwards, easily escaping the Polaris Tower Master’s sword and leaving a massive gaping wound in the Polaris Tower Master’s left shoulder!\u003c/p\u003e\n\u003cp\u003eBlood flowed like a river, the meat there ground into a blur.\u003c/p\u003e\n\u003cp\u003eThis was the terror of a battle spirit. Its name as the strongest attack wasn’t just from its unmatched sharpness, but also its terrifying destructive power!\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master fell down, staggering backwards several steps as he used his great sword to support himself, only then being able to come to a standstill.\u003c/p\u003e\n\u003cp\u003eAs the martial artists present saw this, all of them were shocked speechless. They had thought that Lin Ming’s strength might be above that of the Polaris Tower Master, but the quality of his treasure weapon was simply too inferior. Overall, he was at a disadvantage. They never imagined that after several exchanges of moves, the Polaris Tower Master would be the one who was severely wounded!\u003c/p\u003e\n\u003cp\u003eLin Ming had simply used an overwhelming strength to completely suppress the Polaris Tower Master without giving him the chance to resist.\u003c/p\u003e\n\u003cp\u003eAt this time, Zhuan Yu’s lips were shivering. He realized now that the difference between him and Lin Ming was a great boundary, like a Xiantian martial artist compared to a Revolving Core martial artist, or a Revolving Core martial artist compared to a Life Destruction master.\u003c/p\u003e\n\u003cp\u003eHow ridiculous that he had challenged Lin Ming to a battle a year from now; he really didn’t know what it meant to die!\u003c/p\u003e\n\u003cp\u003e“Great Ax, help me!”\u003c/p\u003e\n\u003cp\u003eThe Polaris Tower Master clutched his shoulder and pleaded to the Great Ax Tower Master for help.\u003c/p\u003e\n\u003cp\u003eThe Great Ax Tower Master gulped, his heart bitter. He certainly knew the true identity of the Polaris Tower Master. If he watched on helplessly as the Polaris Tower Master died in front of him, then the ruler of the Blood Slaughter Steppes would never forgive him.\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-660\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-662\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-661","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
