{"id":54616,"no":671,"title":"Chapter 669B - The State of Divine Phoenix Island","content":"\u003cp\u003eChapter 669B – The State of Divine Phoenix Island\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eThe blue-clothed youth was naturally Lin Ming. Two days, Lin Ming, Duanmu Qun, Lan Xin and Feng Shen had crossed through the ancient transmission array, crossing the many billions of miles all the way to the Skysplit Continent.\u003c/p\u003e\n\u003cp\u003eThe several of them had experienced the space storms together. Compared to Lin Ming’s strength two and a half years ago, everyone’s strength was naturally much higher. While they passed through these space storms, it could be considered distressing but not overly dangerous.\u003c/p\u003e\n\u003cp\u003eDuanmu Qun, Feng Shen and Lan Xin had originally all had a slight understanding into the Concept of Space and Time. In addition, as Fey they naturally had a much higher affinity and inborn perception towards Concepts and Laws. After the three people experienced these space and time storms, they benefitted a great deal.\u003c/p\u003e\n\u003cp\u003eAfter passing through the day-long travel time of the transmission array, they finally arrived at the broken world where the ancient transmission array was located.\u003c/p\u003e\n\u003cp\u003eHere was still the same as before, with space cracks everywhere and a great expanse of water flooding the world.\u003c/p\u003e\n\u003cp\u003eA massive amount of seawater was constantly swallowed up into the dark cracks of this world, it was unknown just where it went…\u003c/p\u003e\n\u003cp\u003eAccording to Lin Ming’s estimation, this broken world could still support itself for several hundred more years. Afterwards, this world would collapse, and this ancient transmission array would also be destroyed.\u003c/p\u003e\n\u003cp\u003eAfter coming out from the ancient transmission array, Lin Ming was anxious to go. After he sealed up the transmission array, he then led Duanmu Qun and the others to fly straight towards Divine Phoenix Island.\u003c/p\u003e\n\u003cp\u003eHowever, he soon discovered that the relay station that he remembered had been destroyed!\u003c/p\u003e\n\u003cp\u003eOriginally, within the South Sea Region, Divine Phoenix Island and the South Horizon Region Alliance had established a near-complete network of transmission arrays. This was beneficial for transporting supplies and moving information. However, all of those transmission arrays had been destroyed by human hands.\u003c/p\u003e\n\u003cp\u003eObviously… these lands had already fallen. When the Wartime Alliance of the South Horizon Region was retreating, they must have destroyed these transmission arrays before they left.\u003c/p\u003e\n\u003cp\u003eThinking of this, Lin Ming’s heart sank.\u003c/p\u003e\n\u003cp\u003eWhen he had still been at the Holy Demon Continent, he had been ardently hoping to return to Divine Phoenix Island. But now that he had truly come back, he started to feel apprehensive and fearful. He feared that when he reached Divine Phoenix Island, there would be nothing left there but ruins!\u003c/p\u003e\n\u003cp\u003eAs they flew, they were silent the entire time. Lin Ming began to discover that within the South Sea Region, there was a massive number of beasts and monsters that normally weren’t seen. Among these creatures it wasn’t strange for there to be some at the Houtian realm or even the Xiantian realm.\u003c/p\u003e\n\u003cp\u003eIt had to be known that the South Horizon Region wasn’t comparable to the Blood Slaughter Steppes. The Blood Slaughter Steppes was a gathering place for the outstanding heroic youths of the entire Holy Demon Continent. There, Xiantian realm martial artists were no different than cannon fodder. But in the South Sea Region, it was already considered very good for an island to have a second-grade sect on it. There were even many smaller islands that weren’t any stronger than the Sky Fortune Kingdom.\u003c/p\u003e\n\u003cp\u003eTo them, facing such a crowd of beasts meant total annihilation!\u003c/p\u003e\n\u003cp\u003eAnd indeed, the situation that Lin Ming saw was extremely bad. These islands that were originally inhabited by a great number of people had been turned into wreckage, the entire land desolate and uninhabited.\u003c/p\u003e\n\u003cp\u003eThe more Lin Ming saw, the more distressed he became. He wanted to stop and ask some people questions, but it wasn’t until he travelled 100,000 miles that he saw the first group of martial artists he had seen yet. This group was being led by that man named Elder Zhao, and they were being chased down by a pack of monstrous beasts. Lin Ming attached his battle spirit to the air and easily massacred those monsters.\u003c/p\u003e\n\u003cp\u003eThe main reason that Lin Ming rescued these people was to inquire about Divine Phoenix Island’s situation.\u003c/p\u003e\n\u003cp\u003eSeeing Lin Ming fly towards them, Elder Zhao and the group of martial artists became able to make out the looks and age of Lin Ming, Duanmu Qun, Feng Shen, and Lan Xin.\u003c/p\u003e\n\u003cp\u003eSeeing Lin Ming’s group, they were immediately shocked. None of the four of them seemed past their twenties. At most, they looked to be 27 or 28 years old. But their strength was actually so formidable to a point that it was horrifying. To kill a late Xiantian level monster with just a look – not even a Revolving Core powerhouse would have such ability!\u003c/p\u003e\n\u003cp\u003eThinking of this, Elder Zhao’s expression paled. Were these youths floating before him actually some super old monstrous beings that had reached a point in their cultivations where they returned to their youths?\u003c/p\u003e\n\u003cp\u003eWith Elder Zhao’s limited comprehension, he couldn’t imagine that someone could reach the Revolving Core realm in their twenties, or even a higher boundary beyond that. He could only chalk it up to Lin Ming and his group being ancient monstrous experts.\u003c/p\u003e\n\u003cp\u003eIt was said that the South Sea Demon Region had a witch who was named Xuan Yuqie. She was over 1000 years old but had a million different flavors and temperaments she could adopt, even seeming like a young married lady in her early twenties. These people currently in front of him might be in this same situation.\u003c/p\u003e\n\u003cp\u003eThinking like this, the panic in Elder Zhao’s heart began to subside. He tried to appear as respectful as possible as he said, “Reporting to Senior, this junior is surnamed Zhao. I was an outer court Elder of Little Swallow Island. The martial artists behind me are some junior martial artists from my sect as well as some other martial artists that we encountered on the road who faced the same difficulties that we did. We gathered together in order to leave the South Sea.”\u003c/p\u003e\n\u003cp\u003eSenior?\u003c/p\u003e\n\u003cp\u003eHearing this word, Lin Ming had a strange look. As for Lan Xin and Feng Shen, they couldn’t help but laugh out loud.\u003c/p\u003e\n\u003cp\u003eLan Xin giggled, “I’m not any older than you are so how can I be your senior? How interesting!”\u003c/p\u003e\n\u003cp\u003eHearing Lan Xin’s words, Elder Zhao’s mind shook. Did this young lady Lan Xin mean to imply that her age matched with her appearance!?\u003c/p\u003e\n\u003cp\u003eElder Zhao gulped, feeling his mind go numb. Where just did these four youths come from? They were so young yet they already had such strength. It was like they were angels from another world!\u003c/p\u003e\n\u003cp\u003e“You said that you are an outer court Elder of Little Swallow Island, so did you have to flee the South Sea? Was your sect destroyed? What grade sect are you from?”\u003c/p\u003e\n\u003cp\u003eThere were far too many island scattered throughout the vast South Sea. There were different sizes and influences of powers that occupied the various islands. These powers didn’t belong to the South Horizon Region nor were they under the jurisdiction of Divine Phoenix Island. For this Little Swallow Island sect to suddenly pop out of nowhere, it was normal for Lin Ming not to have heard of it before.\u003c/p\u003e\n\u003cp\u003eAs Lin Ming asked about Little Swallow Island, a trace of sadness appeared on Elder Zhao’s face. He said, “Reporting to Great Sir, Little Swallow Island was originally a second-grade sect. In recent years, it just barely managed to rise to a third grade sect. In the sect, there weren’t even over 10 Xiantian Elders. In the great beast tide of the South Sea half a year ago, most of them perished in the onslaught, and as for the rest, they disappeared without a trace…”\u003c/p\u003e\n\u003cp\u003eElder Zhao had finally changed Lin Ming’s title from senior to great sir. An existence like Lin Ming had already far surpassed his scope of understanding. Since they weren’t even within the same world, knowing the identity of the other was useless.\u003c/p\u003e\n\u003cp\u003ePerhaps he was some descendant from a Holy Land… as Elder Zhao thought this, he was also wondering… could a Holy Land descendant really be powerful to such an extent?\u003c/p\u003e\n\u003cp\u003e“South Sea great beast tide? What happened?” Lin Ming’s mind stirred. He wasn’t unfamiliar with beast tides – he had also experienced one when he was at the Sky Fortune Kingdom. That great beast tide had been spurred on by the South Sea Demon Region and had swept through the entire Divine Phoenix Province!\u003c/p\u003e\n\u003cp\u003eAt that time, there were countless people that died. If Lin Ming hadn’t made it back on time to Green Mulberry City, then all of the city’s citizens would have ended up buried in the bellies of those vicious beasts, his Lin Family included.\u003c/p\u003e\n\u003cp\u003eSeeing that Lin Ming was completely unaware of this beast tide, Elder Zhao wasn’t surprised. He said, “Reporting to Great Sir, the deep sea beast tide occurred just half a year ago. There are countless islands in the South Sea Demon Region, and the depth of the sea here doesn’t go deeper than 100,000 feet. This is called the inland sea. But outside of the South Sea Demon Region and its main domain, the depth of the sea reaches a degree that cannot be imagined. As for how deep this sea actually is, even a Divine Sea Supreme Elder would find it difficult to measure. There are a great variety of powerful deep sea vicious beasts in this area and their numbers alone are immeasurably terrifying. Normally, it wouldn’t be easy for them to enter the shallower areas of the sea, but half a year ago, an old devil of the South Sea Demon Region used some unknown method to gather hundreds of thousands of these deep sea vicious beasts to attack the center of the South Sea Wartime Alliance. Combined with the demonic Giant Leviathan, they finally broke through the defenses of the Wartime Alliance in a single fell swoop. From that point on, the Wartime Alliance survived in name only. As for Divine Phoenix Island and the Dire Space Sect which comprised the main forces of the Wartime Alliance, they have already perished in the aftermath…”\u003c/p\u003e\n\u003cp\u003eHearing this surname Zhao say such words in a dispirited manner, Lin Ming felt a humming in his mind as if he had been struck by lightning!\u003c/p\u003e\n\u003cp\u003eDivine Phoenix Island perished!?\u003c/p\u003e\n\u003cp\u003eElder Zhao didn’t notice the change in Lin Ming’s expression. He continued to say, “After the Wartime Alliance was dissolved, us smaller sects were in an even more miserable state. The entire South Sea Domain was seized by the South Sea Demon Region. In addition, for this past half year, the deep sea vicious beasts haven’t yet retreated. A number of the powerful vicious beasts divided into several groups and brought giant floods of monsters to sweep over islands where people gathered, killing most of the mortals there. It could be said that this is an apocalypse for the entire South Sea! Now, nearly all the mortal commoners of the South Sea have died. Fortunately, the martial artists were a bit better off. As soon as they obtained the news, they joined together in large units and fled to the mainland. But, there are also some others such as us, who because of various reasons were stranded within the South Sea Domain. For us to cross several hundred miles is truly harder than ascending to heaven…”\u003c/p\u003e\n\u003cp\u003eElder Zhao had deliberately spoken these words because he was hoping that Lin Ming would help him return to the mainland. However, just as he was done speaking in a selfish manner, he noticed that Lin Ming’s complexion had already become extremely gloomy, terrible to behold. Between his eyes, there seemed to be a raging flame burning there!\u003c/p\u003e\n\u003cp\u003eAs soon as Elder Zhao saw this, his heart jumped and he immediately stopped talking.\u003c/p\u003e\n\u003cp\u003e“You said that Divine Phoenix Island has perished?” Lin Ming’s eyes blazed as he looked at Elder Zhao, his vision suffocating him.\u003c/p\u003e\n\u003cp\u003e“Yes… yes, Divine Phoenix Island has… it has already… become an island of death.” Elder Zhao gulped, stammering out these words. Facing Lin Ming, he felt as if he would die any moment.\u003c/p\u003e\n\u003cp\u003e“And the people on the island?”\u003c/p\u003e\n\u003cp\u003e“About this… I… I’m not too sure. I… am just an outer court Elder of Little Swallow Island. I truly have no idea where the main remaining forces of the Wartime Alliance have run too…”\u003c/p\u003e\n\u003cp\u003eAs Elder Zhao spoke, his back was soaked with sweat. Facing Lin Ming, the pressure was simply too great!\u003c/p\u003e\n\u003cp\u003e“Brother Lin, don’t be so worried!”\u003c/p\u003e\n\u003cp\u003eAt this moment, Duanmu Qun suddenly spoke out. His voice was like a gentle spring breeze, immediately lifting off some of the pressure from Elder Zhao. Elder Zhao began to keel over, gasping for breath in big, deep gulps. Just saying those words now seemed to have overdrawn all his strength.\u003c/p\u003e\n\u003cp\u003eThis was because Lin Ming simultaneously had two different force field type martial intents. Even if his aura were to accidently leak out because of his strong emotions, it was still able to bring down a great pressure upon low level martial artists.\u003c/p\u003e\n\u003cp\u003e“Brother Lin, we need to further think and deliberate on this matter. Worrying too much right now is useless. Listening to this man’s words, the people of the Wartime Alliance might not have perished.”\u003c/p\u003e\n\u003cp\u003eDuanmu Qun had guessed what sort of relationship Lin Ming had with this Divine Phoenix Island. After thinking about it, he found it very strange. He had assumed that a heaven-defying monstrous genius like Lin Ming would have come from some super Holy Land, but as he listened to the exchange of words, it seemed as if this Divine Phoenix Island was just a middle level sect.\u003c/p\u003e\n\u003cp\u003eCould Lin Ming have originated from Divine Phoenix Island? That should be impossible, right?\u003c/p\u003e\n\u003cp\u003e“I understand...” Lin Ming closed his eyes. As he opened them once more, that gloom and worry had already been suppressed and hidden away, replaced with a calm and pure killing intent.\u003c/p\u003e\n\u003cp\u003e“Let’s go!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-669\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-670\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-669-1","bookId":1508,"creation":"Sep 10, 2019 5:41:18 AM","modification":"Sep 10, 2019 5:41:18 AM"}
