{"id":54634,"no":689,"title":"Chapter 687 - Paying Respects to the Divine Kingdom Crown Prince","content":"\u003cp\u003e\u003cstrong\u003eChapter 687 Paying Respects to the Divine Kingdom Crown Prince.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIt had to be known that once a martial artist lost their blood essence, it was extremely difficult to restore it. Thus, any secret skill related to the restoration or supplementation of blood essence was extremely precious.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs for Divine Phoenix Island’s method of transplanting a Vermillion Bird’s blood essence, that was obtained from the Divine Phoenix Mystic Realm, thus only high level figures from Divine Phoenix Island knew it.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn fact, the founding ancestor of Divine Phoenix Island was only a mortal; she had no relation with the Ancient Phoenix Clan. She accidently stumbled into the Divine Phoenix Mystic Realm, and there she obtained various cultivation methods and secret skills, and used these treasures to form Divine Phoenix Island.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eSo theoretically speaking, a martial artist from any other sect could have Vermillion Bird blood essence transplanted into them, and this would increase their talent in fire-attribute cultivation methods.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThus, Yin Yang Profound Palace had always coveted this secret technique. When Divine Phoenix Island was in its glory days, Yin Yang Profound Palace wasn’t willing to pay such a steep price and attack Divine Phoenix Island to obtain this secret technique, but now that Divine Phoenix Island was in trouble, they began to move towards this objective.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eYin Yang Profound Palace focused on water and fire cultivation methods, it was extremely similar to the ice and fire cultivation methods that Divine Phoenix Island practiced. In particular, the fire-attribute cultivation method was especially similar. Thus, they first planned to obtain the two Vermillion Birds first and take out a part of their blood essence to see whether or not they could use it to increase the fusion compatibility of their Yin Yang Profound Palace’s cultivation methods.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis was the most fundamental reason that they were willing to bear the pressure of the South Sea Demon Region and take in Divine Phoenix Island.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXing Can said, “Husband, we must hurry. If the South Sea Demon Region is subdued by this Divine Kingdom then we won’t have any more bargaining chips in our hand. When that happens, Divine Phoenix Island might not be willing to submit to us.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Humph, that might not be true! After this war, Divine Phoenix Island’s strength has plummeted. Mu Fengxian has already injured her life source, and even though she is still at the first stage of Life Destruction, the truth is that her strength is now only comparable to the late Revolving Core. As for Mu Yuhuang, she just recently passed into the first stage of Life Destruction and her cultivation is unstable. With most of their Revolving Core Elders already fallen, Divine Phoenix Island can now only be compared to an upper middle fourth-grade sect. They aren’t much better than the seven sects of the Five Element Region. They simply do not have the ability to compete with us. Now that they’ve come to my Yin Yang Profound Palace, they can forget any thoughts of leaving!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xing Ji spoke he sneered, subconsciously gripping his palms together as if he wanted to completely control Divine Phoenix Island in his hand.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xing Can saw Xing Ji’s confident appearance, she said, “Husband, with you presiding over the situation I can rest assured that Divine Phoenix Island’s secret skills will be handled. As for establishing a good relationship with that Divine Kingdom Crown Prince, I shall handle that…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xing Can spoke, the sound of footsteps suddenly rang out in the temple along with a clear voice, “Great Father, Great Mother, what are you talking about?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe one speaking was a tall and heroic-looking youth. He was handsome and his eyebrows shot up like swords. He was Xing Ji and Xing Can’s most talented son… Xing Yang.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter Xing Yang was identified as having the potential to become an Emperor level powerhouse, the Xing couple had placed all of their high expectations on him. They were counting on him to help Yin Yang Profound Palace rise to a Holy Land in the future.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Yang’er, you’ve come at just the right time. Have you heard about the pillaging of the South Sea Demon Region?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Your child has certainly heard about such a grand matter. To think that all of this came from the hands of a mysterious youth is truly unbelievable!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm, that’s right. Your father and I suspect that he is a Divine Kingdom’s Crown Prince. If you can be on good terms with him, that would be very advantageous for you and us. Yang’er, I plan on taking you to meet him. Your talent is truly extraordinary, but it may still be too difficult to compare with him, so just make sure that you don’t show any arrogance or foolishness in front of him. Your age should be close to his. As long as you can manage to become friends with him, your struggle to become a Peerless Emperor in 100 years will be much easier!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xing Can spoke, Xing Yang’s eyes began to shine. Although he was an Emperor level talent, it wasn’t true that any Emperor level talent could become a Peerless Emperor. One needed to constantly push their potential to the limits, finding resources even in the face of absolute danger. When one could combine lucky chances, destiny, effort, and all other factors together, then it was possible to become a true Emperor powerhouse.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIf he exhausted his potential or encountered an accident, he might fail.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBut if he knew that Divine Kingdom Crown Prince, it would be different!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eOver these years, Xing Yang had already been considered and raised as the future successor of his sect. As he diligently trained his cultivation, he was also well versed in human nature and befriending others.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHe believed that as long as he had a chance, he would certainly be able to win the favor of that Divine Kingdom Crown Prince.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAt that time, if he had the chance to go to a Divine Kingdom Holy Land and adventure for a bit, then the benefits could be imagined!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThinking of this, an excited light shined in Xing Yan’s eyes. He said, “What Great Mother says is true. In this world, there is always a higher mountain and a higher heaven. Your child has always understood this truth. I shall go with Great Mother, and if I have a chance to befriend that Crown Prince, then I certainly will not miss it.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm, good, truly worthy of being my son!” Xing Ji laughed. This South Sea war was definitely a great opportunity for their Yin Yang Profound Palace. Not only would they soon be able to obtain the secret skills of Divine Phoenix Island, but they could even befriend a Divine Kingdom Crown Prince.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIf they could succeed in both of these goals, Yin Yang Profound Palace would rise yet another step!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Yin Yang Profound Palace was drawing up their grand plans, Divine Phoenix Island was also considering the future of their sect.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eMu Fengxian and Mu Yuhuang were both characters that had lived for several hundred years, so how could they not have seen through Yin Yang Profound Palace’s tricks? It was just that before, under duress, they had no choice but to strike a bargain with Yin Yang Profound Palace and crawl into the snake’s den, counting on the eventual day when Lin Ming would return.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThere were still seven more years from the 10 years’ time that Lin Ming had promised. But before that, there had already been a favorable chance in the South Sea war. Now Divine Phoenix Island had to consider their next step.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAt this time, in a courtyard of Divine Phoenix Island’s temporary residence, there was a long and wide table, where seven or eight key figures of Divine Phoenix Island were seated.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Sect Master, Master Ancestor.” A blue-clothed woman politely bowed as she sat down. She was Mu Bingyun, having just returned from the Five Element Region.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Bingyun, about those rumors of the South Sea Demon Region, how exaggerated are they?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe high level figures of Divine Phoenix Island were all hidden within Yin Yang Profound Palace, and it was hard for them to know what was happening in the outside world. A great deal of their information was sent to them by Mu Bingyun.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBefore, when that mysterious youth had completely annihilated the South Sea Demon Region’s Divine Phoenix Island Branch with just his own strength, that already seemed quite exaggerated.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfterwards, Xuan Yuqie had led three other great Elders along with the Giant Leviathan to personally go out on a hunting mission. However, they had suffered a disastrous defeat. Not only had they lost the Giant Leviathan, but two Elders also died. Finally, the entire South Sea Demon Region was looted and pillaged by the mysterious youth.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis was truly incomprehensible.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis was the same as the mysterious youth sweeping out the entire South Sea Demon Region with just his strength alone, completely routing Xuan Yuqie and the other Life Destruction Elders there as if they were nothing more than dead dogs. With the massive number of martial artists that were slain throughout all of the South Sea Demon Region, they were fortunate that Xuan Wuji was still alive, otherwise the entire sect might have already collapsed because of this.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis was simply a fairytale-like legend – it was unimaginable. As for that mysterious youth, his identity became increasingly obscure even as his fame rose to unprecedented levels. It could be said that now, in the entire Five Element Region, South Horizon Region, Profound Province, or other lands nearby, there was no high ranking sect that didn’t know of this youth. Perhaps even the Great Zen Region had learned of this too.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Reporting to Sect Master, my words are not exaggerated at all.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm…” Mu Yuhuang nodded. With the appearance of this mysterious youth, the landscape of the entire South Sea war had rapidly changed. This was also a favorable turning point in their Divine Phoenix Island’s fate.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Now we only do not know when Xuan Wuji will leave seclusion. Xuan Wuji is the South Sea Demon Region’s very soul. Although the South Sea Demon Region has suffered great losses this time, they will never perish as long as Xuan Wuji is still living. The South Sea Demon Region still holds absolute dominance with him, and we still have no choice but to stay in Yin Yang Profound Palace and be pressed down by others.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Yin Yang Profound Palace was mentioned, a trace of grief and pain flashed through Mu Qianyu’s eyes. At the time, under the pressure for her sect to survive, Divine Phoenix Island had no option but to yield to certain conditions. Her Saint Beast, Little Flame, was now in the hands of Yin Yang Profound Palace. Now that they had taken Little Flame, it certainly wasn’t to raise it but rather to steal its Vermillion Bird blood essence.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Mu Qianyu thought of this, it felt as if a heated knife was twisting in her heart. Although Little Flame was a contract beast, to Mu Qianyu, Little Flame was no different from her sister. To sacrifice Little Flame to secure Divine Phoenix Island’s continued future would always be one of Mu Qianyu’s inner demons.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Mu Yuhuang saw Mu Qianyu’s expression, she sighed and said, “Yu’er, don’t worry. Yin Yang Profound Palace’s Palace Masters made an oath on their heart of martial arts that they wouldn’t harm Little Flame’s life. It… it’s just… they are taking some of Little Flame’s blood essence…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Mu Yuhuang spoke to here, she also felt sad. Her contract beast Fireshine was taken away too. Whether it was to a martial artist or Vermillion Bird, blood essence was extremely precious; it wasn’t possible to lose too much. If one did lose too much, not only would one’s cultivation drop but it would also shorten their life.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Us seeking asylum in Yin Yang Profound Palace was pure wishful thinking to begin with; we always had to pay some price. We can only hope that this mysterious youth will cause the South Sea Demon Region to suffer great losses and give us some respite. We must persist until Lin Ming returns. But in the meantime, we’ll have to patiently endure these coming years. We simply have no other choice.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm, I understand.” Mu Qianyu reluctantly smiled, motioning that she was feeling better.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eMu Yuhuang sighed and no longer said anything.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs the high level figures of Divine Phoenix Island were gathered together to discuss their sect’s future, at the great temple of Yin Yang Profound palace, a high-grade earth-step spirit boat had quietly been launched. After passing through several transmission arrays, it shot straight towards the South Sea. The people on board this boat were the mother and son, Xing Can and Xing Yan.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThey planned to go to towards Divine Phoenix Island to pay a visit to this ‘Divine Kingdom Crown Prince’.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHowever, someone was already much closer. As Yin Yang Profound Palace set out, the scouting party of Storm Valley had already landed on Divine Phoenix Island and was planning to greet Lin Ming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Storm Valley’s Free Wind Temple Protector requests an audience with the great expert!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eSeeing there was no response, the scout repeated himself. Although his voice was vigorous, his heart was beating like a wild drum. This other force was an existence able to kill off a first stage Life Destruction master and there was also no telling how great of a status he had. This scout was only a Protector of a small fourth-grade sect. In the eyes of people like this, he was no different from an ant. Was his abrupt arrival and greeting causing displeasure?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIf this person had an eccentric personality, then they might ignore them or even play around with them.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter several breaths of time passed, a young man’s voice suddenly echoed out from all directions.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Storm Valley? Is it the Five Element Region’s seven sects’ Storm Valley?\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-686\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-688\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-687","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
