{"id":54638,"no":693,"title":"Chapter 691 - A Night Of Tender Warmth","content":"\u003cp\u003eChapter 691 – A Night Of Tender Warmth\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn the rumors that Mu Qianyu had heard, the so-called Divine Kingdom Crown Prince had the strength to kill a first stage Life Destruction martial artist.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBy himself, he stirred up the South Sea Demon Region, upheaving their world. He killed over a thousand disciples of the South Sea Demon Region and forced Xuan Yuqie into a miserable state where she couldn’t even fight back.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAnd now she asked Lin Ming because their two strengths seemed similar. Such a coincidence would certainly have Mu Qianyu associate them.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHearing Mu Qianyu’s question, Lin Ming was a bit surprised. He never tried to deliberately hide his identity; he assumed that the people of Divine Phoenix Island would have already known about him. But now it seemed that the South Sea Demon Region had set up a blockade of all news, afraid that Great Zen Temple, Black Flood Dragon, or some other fifth-grade sect would try and partake in the share of Lin Ming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThinking about this, Lin Ming only sneered. The South Sea Demon Region had thought he was a lamb to be butchered, but they never imagined they would already be ruined before they could taste the meat.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLin Ming said to Mu Qianyu, “Senior-apprentice Sister, I returned to the South Horizon Region one month ago yet I couldn’t find you. I learned that Divine Phoenix Island had been destroyed, and in sadness, I went to Divine Phoenix Island to search for clues. There, I discovered that the South Sea Demon Region had set up a branch. At the time, I didn’t know where you went, so I killed the branch Elder there to search his soul. The result was that I didn’t even obtain any news of you and instead brought Xuan Yuqie and the Giant Leviathan to come knocking on my door. As for the matters after that, I’m sure that you’re well aware.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLin Ming’s words seemed understated, but Mu Qianyu was already completely bewildered.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe death god of Divine Phoenix Island that had killed three Life Destruction Elders, stolen away the Giant Leviathan and even killed his way into the South Sea Demon Region…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAll of these unbelievable events had come from Lin Ming’s hands!?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eVenturing a guess was one matter, but hearing Lin Ming confirm her suspicions was a completely different matter.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Lin Ming… you…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eMu Qianyu didn’t know what to say.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBefore this, Mu Yuhuang and everyone else was hoping that Lin Ming would be able to return in ten years and hold up the heavens for their Divine Phoenix Island. To Mu Qianyu, this already seemed like a very exaggerated possibility. After all, 10 years from now, Lin Ming would be around 27 or 28 years old; it would still be difficult for someone so young to face a fifth-grade sect by himself.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBut, she never imagined that in just a short two and a half years, Lin Ming would not only return, but completely flip over the entire South Sea Demon Region!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eJust what had Lin Ming experienced in these two and a half years? His talent was far more terrifying than when he left through the transmission array!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAt that time, if a Divine Kingdom Crown Prince or some other favored son of heaven could compare with Lin Ming, then to the current Lin Ming, such a Crown Prince or Holy Son wouldn’t even be able to touch the hem of his pants!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIt had to be known that the Divine Kingdom Crown Prince was reported to by nearly 30 years old. For a 30 year old youth to be able to change the entire South Sea war with just his own strength was already extremely shocking.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAnd Lin Ming was only 20 years old!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThat was an entire 10 years young! This was a difference of 10 years in talent and this was even when compared to a Divine Kingdom Crown Prince!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eMu Qianyu didn’t know what to say to Lin Ming. After being stunned for a long time she mumbled, “Lin Ming, what have you been through these past two and a half years?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThinking of his experience through these past two and a half years, Lin Ming was also filled with emotion. For this entire time, nearly every day was filled with thoughts of death and battle.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“It’s a long story. Let’s go somewhere else and I’ll slowly tell you.” Lin Ming didn’t plan on hiding anything from Mu Qianyu. He wanted to tell Mu Qianyu about everything he had experienced in the Holy Demon Continent.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eNo matter how tough and stable Lin Ming’s will was, if he fought on the edge of danger for too long, he would still accumulate too much tension in his nerves and mind. What he wanted was some time to relax, and to be able to confide in someone who understood him that he had absolute trust in.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm, let’s go to my cabin. It’s just underneath the mountain cliffs.” As Mu Qianyu spoke to here, her beautiful face flashed with a red blush like the glow of a setting sun.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLittle Swallow Mountain didn’t have any buildings on it to begin with. The cabins were temporary residences set up for the Divine Phoenix Island disciples. Besides the courtyard for meetings and other official business, there were no other large scale constructions. Mu Qianyu didn’t want to bring Lin Ming to the meeting hall. Thus, the best place was naturally her own cabin.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eTo invite Lin Ming to her own bedroom in the dead of night was truly a bit… suspect. But, thinking about the relationship between them, this wasn’t anything strange. A martial artist who always acted according to their own heart and objectives simply didn’t care about the gossip from others.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThinking like this, Mu Qianyu also calmed down, becoming much more confident in herself. Without waiting for Lin Ming’s reply she immediately jumped down the cliff.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe wind blowing down the mountain caused Mu Qianyu’s silk clothes to flap in the wind. Lin Ming was startled for a moment before he followed her, a strange sense of happiness surging in his heart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIf Mu Qianyu hadn’t felt that he belonged to her, she would never have made such an invitation.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe cliff was only a few hundred feet high; they arrived at the bottom of the cliff in an instant.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn the night of Little Swallow Mountain, the skies were black like ink and the stars dazzled against the vast vault of heaven. At the bottom of the cliff, the mountain winds washed over the grassy land like undulating waves. The sounds of insects were everywhere and the air was clear and fresh.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eWalking on such a mountain, one’s mood would be especially tranquil.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eStepping through the soft grass, Mu Qianyu and Lin Ming soon came to a group of cabins. This area was one of the places with the richest heaven and earth origin energy on the entirety of Little Swallow Mountain. Not only was Mu Qianyu’s cabin here, but also Mu Bingyun, Mu Yuhuang, and Mu Fengxian’s.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eA martial artist’s perception was very sensitive. As Lin Ming and Mu Qianyu walked near with no intention of hiding themselves, everyone naturally sensed the two. However, they all had a mature and tacit understanding of the situation and thus no one came out to greet them.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eQuietly looking at this group of cabins, Mu Qianyu suddenly felt extremely embarrassed. Originally she didn’t think this was a big deal, but now that she was in this situation, Mu Qianyu began to have a guilty conscience as if she were doing something naughty.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm… there isn’t an extra cabin, so you’ll have to stay here with me tonight.” Mu Qianyu awkwardly said as she opened the cabin door.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eNaturally, Lin Ming would never say something ridiculous at this moment like that Duanmu Qun and the others were staying in the spirit boat, and there was actually plenty of room there. Wouldn’t that just be spoiling the fun too much?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter he calmed his mood, he stepped foot in Mu Qianyu’s room.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe layout of Mu Qianyu’s cabin was very simple. The wood furniture was newly carved and it hadn’t even been baked through with fire. It retained a great deal of its moisture, filling the entire cabin with a light scent of bark.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe cabin was comprised of one bedroom and one living room. There was a simple bookshelf in the living room, and on this bookshelf were several types of jade slips and dozens of ancient-looking books.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn her bedroom was a large wooden bed. On the bedside was a small set of drawers, and on this set of drawers was a small jade bottle with a Vermillion Bird Flower blooming within.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn truth, all of a martial artist’s belongings could be placed into their spatial rings. Anything that was placed out in this room was there for decoration.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Is… is it too simple?” Mu Qianyu hesitantly asked. This was the first time that a man had ever entered her room. Even when they both stayed at Divine Phoenix Island, Lin Ming had never entered her room before.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis nervous feeling was a bit strange.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“It’s great.” Lin Ming lightly said, feeling the awkward atmosphere.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Tell me about what you’ve been through these past two and a half years. I want to hear it.” Mu Qianyu pulled Lin Ming’s hand and they sat on her bed together. She lifted her chin, her bright eyes staring at Lin Ming just like a young girl that was eager to listen to bedtime stories.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThus, Lin Ming began his story from when he left the Demon God Imperial Palace. He recounted from the point he took the transmission array to the Holy Demon Continent. He recounted to her everything he knew about the races, customs, and influences of the Holy Demon Continent. He spoke of when he was severely wounded in the Bewitching Cloud Prairie and forced into slavery because he lost his strength. Then, he traveled to the Blood Slaughter Steppes and climbed up Polar Skysplit Tower. From there, he fought Xing Tian in a fatal battle on the second floor, stepping onto the third floor and then entering the King’s Cage where he faced the plotting of High Lord Heian.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfterwards, he continuously defeated three great masters of the Heavenly Demon Seven Stars, and then killed High Lord Heian with his own hands. With his fame having sharply risen, through so many twists and turns, he then had to suffer the Polaris Tower Master planting a slave seal within him.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBy tricking the Polaris Tower Master, he had managed to enter the Road of Emperor and comprehend his own battle spirit. Finally, he ventured into the Eternal Demon Abyss, capturing the demon bone and then being forced to stray into the 1000 mile forbidden zone. There, he picked up a profound gold divine fruit, discovered the corpse of a 100,000 year old goddess, and then, having broken through to Revolving Core, he then killed the Polaris Tower Master...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBesides matters related to Demonshine and the Magic Cube, Lin Ming didn’t conceal anything else. He truthfully told her everything.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAlthough Mu Qianyu knew that Lin Ming would experience many trials and tribulations through these two and a half years, she never imagined that he would wade through so many life and death dangers. Even with Lin Ming sitting safe and sound right beside her, as Mu Qianyu listened to him explain all of the perilous situations and dead ends he had run into, she felt her heart tightly clench in her chest. But as she listened to how he saved the day, turning danger into safety and reversing the situation, she also felt happy for him, a joy that came from the depths of her heart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter Lin Ming finished speaking, because Mu Qianyu’s emotions had risen up and down several times, her face was blushing red. She gradually fell into Lin Ming’s arms.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe two of them supported each other as they kissed. Each of them felt the warm temperature of the other, gently stroke and caressing each other’s skin.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eWhether it was Lin Ming who had experienced constant death and fighting for the last two and a half years, being worried most of the time, or whether it was Mu Qianyu, who had suffered through the great pressure of her position and watching everything around her fall apart to the wind and rain of life, both of them needed comfort, both of them needed warmth.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eWith a warm and fragrant body pressed into his chest, Lin Ming’s entire senses were filled with a delicate scent. Lin Ming felt as if he had embraced the entire world. This intoxicating feeling that set off butterflies in his stomach made his mind throb, even as a surge of lust and desire ignited in his heart, quietly simmering…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter so many years of martial arts practice, Lin Ming was no longer that newbie who had entered the Seven Profound Martial House, nearly losing his mind in the pass of passion on that sea jade platform.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eInstead, he was a master who was capable of controlling his own emotions.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHis thoughts stirred, and a light flashed in his eyes. He wanted to use his battle spirit to cut this rising desire. But then, he thought about it some more.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe fires of his desire were in truth the development of his own consciousness, a natural progression of his growth as a man. Why would he want to cut it?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eFrom when he first encountered her at Thundercrash Mountain to when she welcomed him to Divine Phoenix Island, Mu Qianyu had truly cared for Lin Ming every step of the way.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eWhen he entered the Divine Phoenix Mystic Realm, it had seemed that Lin Ming was a star that fell from the heavens, and Mu Qianyu had fallen into sadness and despair for him.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn the Demon God Imperial Palace, Lin Ming had to face being hunted by Lei Jingtian. He had given her the Escape Symbol and the two of them had made a life and death vow. Finally, before he left through the ancient transmission array, they had promised each other a meeting ten years from now.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eEvery condition had been successful.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThen he would naturally allow this pass of passion to take its course.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLin Ming slightly suppressed the desire in his heart and softly said, “Yu’er, how have you been for these past two and a half years?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Mu Qianyu heard Lin Ming refer to her as Yu’er, her heart throbbed. She didn’t know, but this small change in her name was in truth a decision from Lin Ming…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs she thought of these two and a half years, Mu Qianyu felt a bit sad. She hesitated for a moment and then truthfully spilled out her story. Now that Lin Ming had grown up, there was no need to hide anything from him anymore.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eFrom the time that she and Lin Ming separated, she spoke of Xuan Wuji recklessly searching the entire South Sea for him. Then, she replayed the demise of the Wartime Alliance, the destruction of Divine Phoenix Island, then being forced to take refuge in Yin Yang Profound Palace, and then having to have their two Vermillion Birds taken away as well as having to suffer all sorts of harsh conditions.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHearing this, Lin Ming frowned. “Little Flame and Fireshine were taken by Yin Yang Profound Palace?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-690\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-692\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-691","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
