{"id":54692,"no":747,"title":"Chapter 745 - Fighting Xuan Wuji","content":"\u003cp\u003eChapter 745 – Fighting Xuan Wuji\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eFrom the time Lin Ming had appeared to when the strange octopus died, it seemed like a long while, but the truth was that only five to six breaths of time had passed.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBai Guanyun stared on helplessly as Lin Ming used this tiny bit of time to slaughter the strange octopus whose strength was similar to his as if it were a chicken or dog. In his heart, there was nothing but an inexplicably rising fear.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBoth of his legs had been cut off; it was impossible to escape.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHow could things turn out like this?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBai Guanyun felt as if he had gone crazy. Four months ago, Lin Ming only had the strength to barely kill a second stage Life Destruction master. How could his strength progress so quickly!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eNormally, for a martial artist to advance a single stage of Life Destruction every few dozen years was already an incredible speed. But Lin Ming had only taken four months to enhance his strength by at least a boundary. This caused Bai Guanyun to fall into a hopeless despair.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBut at this time, a billowing whirlpool suddenly appeared in the deep sea. A formidable aura surged forth like an endless tide. Bai Guanyun was suddenly overjoyed. He turned his head to see that not too far away, Xuan Wuji had grasped a jet black lance and was rushing his way over.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Brother Xuan, save me!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBai Guanyun loudly called out for help. But as his voice left him, a burning hot spear appeared like a ghost right in front of his throat.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e\u003cem\u003eCa!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eWith a faint sound, blood spurted out. Bai Guanyun stared at Lin Ming with wide eyes, unwillingness and disbelief coloring his face. However, as his perception had already faded away, he was no longer able to see anything in the water before him. The only thing that filled his vision was darkness.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e\u003cem\u003ePeng!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBai Guanyun’s true essence protection shattered and sea water came pouring in, crushing Bai Guanyun’s body to nothingness. This was a depth of hundreds of thousands of feet; the pressure was extremely terrifying. Bai Guanyun was not from the deep sea races. Once his human body lost its true essence protection, his eyeballs instantly burst apart, his eardrums perforated, and sea water fluxed into his body, squishing his organs, meridians, muscles, bones, and everything to mush.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLin Ming calmly took back his spear. With a wave of his hand, he retrieved Bai Guanyun’s spatial ring.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Lin Ming!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eA voice touched with the tiredness from the endless trials of life echoed outwards. As Lin Ming turned around, he could see that just a thousand feet away in the jet black sea water, Xuan Wuji was floating, pointing a lance straight at Lin Ming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eLin Ming indifferently waved his spear, meeting Xuan Wuji in return.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eOn one side was a cold, dark light, and on the other side was a blazing red dawn!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAfter so many years, Lin Ming had finally gained the capital to stand in front of Xuan Wuji and fight with him!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThat young, ordinary youth that had just entered the Seven Profound Martial House now had the ability to declare war on the number one master within the entire South Sea!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xuan Wuji looked at Lin Ming, various feelings and emotions filled his heart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“It should have been nearly five years since my great grandson Xuan Ji was killed by you… no, in less than five years, you’ve risen up from the peak of Pulse Condensation to the late Revolving Core realm. I have investigated your past. When you were 15 years old you were only ordinary, not special at all. Now at just 21 years of age, a bit more than six years’ time, you’ve grown from a mere common mortal to a top master that can instantly kill a third stage Life Destruction powerhouse. Within the Sky Spill Continent, your speed of cultivation is unprecedented from ancient times until now. I am truly curious; just what secret do you have with you?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xuan Wuji spoke, Lin Ming didn’t respond. However, the Turquoise-Eyed Ape Clan Patriarch that was following behind Xuan Wuji actually blanched. In less than five years he had gone from the peak of Pulse Condensation to the late Revolving Core realm!?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe Turquoise-Eyed Ape Clan Patriarch only knew that Lin Ming’s talent was monstrous. But, he had never been too sure as to what Lin Ming’s history was. But now, listening to Xuan Wuji speak, this was the first time that he discovered that Lin Ming was an absolutely heaven-defying monstrous freak of nature!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn five years, to go from the peak of Pulse Condensation to the late Revolving Core, with such a terrifying cultivation speed, only a fool would believe that Lin Ming didn’t have some heaven-shattering lucky chance with him!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eNo wonder Xuan Wuji had been willing to pay any price to capture Lin Ming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“This is… truly unbelievable, ah…” Xuan Wuji deeply sighed, his eyes flashing with a strange, otherworldly look. “At Revered Master Tianguang’s birthday banquet, you fought with Xuan Ji. Although Xuan Ji was only at the Houtian realm, his talent was still extraordinary and he had cultivated the Ancient Devil Arts. With his complete strength he was even able to match a Xiantian master. However, he was still defeated by you, a mere boy with a trivial Pulse Condensation cultivation!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“At that time, your talent was astonishing, but there were talents like you all over the four Divine Kingdoms, and there were even many young elites that surpassed you. At that time, I was startled by you, but I did not fear you. The reason I wanted to kill you was only because I wanted to avenge Xuan Ji’s death, not because I thought that you had any amazing secret on your body. I never imagined that in such a short time, you will develop to the point where you could threaten me!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Afterwards… you entered the Demon God Imperial Palace, and with your little Houtian realm cultivation, you played with us old fellows in the palm of your hand. You stole away the Nirvana Dragon Root and the Cosmic Melting Furnace! The meticulous plans that I laid down for over ten years was actually made into a gift for a little child! How laughable is that! Even now, I still don’t understand. Just how were you so skilled in ancient array formations? How did you obtain all those treasures and then make a grand escape to freedom? You snatched away the Nirvana Dragon Root and Cosmic Melting Furnace and then left for two whole years. Now you’ve returned, and you’ve returned as a complete monster. The reason I was so anxious to flush you out of hiding was because I truly feared you from the very bottom of my heart. I feared you so much that I even imagined days when I would take a nap, and the second I woke up you would have obtained the strength to kill me and would have already come rushing to my door!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji said in a single breath. After knowing of Lin Ming’s existence for such a long time, there had been too many questions pressing down on his mind. The pressure on his heart had increased every day.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Secret?” Lin Ming faintly smiled. “Xuan Wuji, don’t you know about the existence of the Realm of the Gods? You fear how fast I grow but that is only because you are nothing more than a frog in a well. In the three thousand boundless worlds, there are countless extraordinary young elites just like me. One day, perhaps you will find that everything you\u0027ve chased after in your life is nothing in the eyes of others, nothing but leftover garbage for them to step over.\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Hahaha!” Xuan Wuji laughed, “What you said is true. There are no limits in this universe; there is always a higher peak, a stronger man. I am truly nothing but a little frog in a well, but I am unwilling to remain so. I am unwilling to chase after things that are nothing but trash in the eyes of others. Thus, I want to leave this world. And you, Lin Ming, you will be my springboard to do so. Perhaps your secret is only garbage to the powerhouses in the Realm of the Gods, but in my eyes, it is the most precious treasure. It is my only hope to break past my limits! Let’s do this! Lin Ming, show me just where the limits of your strength lie!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAs Xuan Wuji spoke, he flourished the lance in his hands and thrust it straight at Lin Ming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Take my lance - Sunder the Profound Heavens!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e\u003cem\u003eBang!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji’s true essence exploded out, forming a massive amount of pressure in the sea. The seawater around Lin Ming suddenly became as hard as iron as it began to envelop him.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eAlthough this pressure wasn’t able to harm Lin Ming, it was still able to form a cage around him, sealing the directions where he could escape.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBut, the truth was that Lin Ming had no intention of dodging to begin with. A frontal melee was what he desired above all!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eTrue essence revolved in his body as the Heretical God Force was released to its limit. Lin Ming held the red spear, pouring his battle spirit into the spear point. For a time, the entire spear radiated a glorious flaming red light!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eChasing Sun!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe seawater was evaporated by the burning hot energy. Lin Ming’s spear stuck Xuan Wuji’s lance point!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e\u003cem\u003eBang bang bang!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eTwo amazing energies collided. The sea water crazily spun around, mixing up from the forces. As the Turquoise-Eyed Ape Clan Patriarch saw the situation devolving, he had already long retreated.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Mm… this is!?!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eIn the instant that Xuan Wuji exchanged moves with Lin Ming, he felt an incomparably sharp strength rush into his lance. It was like his heaven-step lance was unable to resist this force, issuing out a keening tremble!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis caused Xuan Wuji to be extremely alarmed!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Burst!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji loudly shouted, detonated the true essence on the lance point. He was driven far back from the energy backlash. As he looked down at the black spear in his hands, he could see that it was still shaking. If this continued, then he couldn’t guarantee that his lance wouldn’t break!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThis was a heaven-step treasure! If it were a high-grade earth-step treasure, it would have absolutely broken apart just now!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji’s vision focused on the red spear in Lin Ming’s hands. That spear seemed to be a heaven-step treasure, but there was something strange covering it. Xuan Wuji was completely unable to determine just what rank of treasure it was.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHowever, even if it were a medium-grade heaven-strep treasure, it was would still be impossible to create such a terrifying pressure on his heaven-step lance. As Xuan Wuji recalled that incomparably keen strength just now, his heart suddenly trembled.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eCould that strength be…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eA battle spirit?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eThe South Sea Demon Region had once been a Holy Land. It’s Holy Ruler, the Netherworld Great Emperor, had been a top ranked character within the Sky Spill Continent three thousand years ago. In the ancient texts of their sect, there were certain records of battle spirits.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji didn’t recognize this battle spirit at the start because this power was far too distant a realm for him. So, he simply never thought of it!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“This brat Lin Ming has actually formed his own battle spirit at the late Revolving Core realm? No, that’s wrong. According to the description in the ancient texts, this sort of battle spirit is not at a low grade. Lin Ming probably formed his battle spirit at an even earlier boundary! He is still young and yet he comprehended his own battle spirit! Moreover, that spear strike just now didn’t contain just a battle spirit. There was also an incomparably mystical Concept of Fire. The profound mystery of this Concept is something that perhaps even Yin Yang Profound Palace Master Xing Ji’s own Concept of Fire could not hold a candle to!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eYin Yang Profound palace was a sect that focused on the water and fire cultivation methods, using Yin and Yang elements to complement each other. Xing Ji trained in the fire-attribute and his cultivation was at the second stage of Life Destruction. Xuan Wuji had also once experienced Xing Ji’s Concept of Fire. But compared to Lin Ming’s own Concept of Fire, it was nothing more than trash.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“A battle spirit comparable to that of a Divine Sea Supreme Elder and a Concept of Fire that surpasses Xing Ji’s own understanding…” As Xuan Wuji held onto the black lance in his hands, rough and violent waves beginning to churning in his heart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eHe had always thought that the reason Lin Ming became such a monstrous genius was because his luck was good and he stumbled onto a massive lucky chance. If Xuan Wuji could obtain this lucky chance, then his achievements would be even greater.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eBut now, whether it was the Concept of Fire or a battle spirit, neither of those can be attained with just a lucky chance. Battle spirit depended on one’s will and the Concept of Fire looked at one’s perception. Could Lin Ming truly be an unprecedented rare talent?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003eXuan Wuji’s complexion sank as he turned grim. He lifted his spear and wiped his right hand on the lance point. Fresh scarlet blood poured onto the lance point and shaft. Then, an incredible scene occurred. In that moment, the black lance seemed to become a bloodthirsty vicious beast, completely absorbing Xuan Wuji’s blood and turning from black to a bright red.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"padding-left: 0;padding-right: 0\"\u003e“Lin Ming, I didn’t think that with just a single exchange you’ve already pushed me to the point of making a blood sacrifice to my lance. Today, this battle will decide our life and deaths!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-744\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-746\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-745","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
