{"id":54025,"no":80,"title":"Chapter 79 - Flood Dragon Goes to Sea","content":"\u003cp\u003e\u003cstrong\u003eChapter 79 – Flood Dragon Goes to Sea\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if he could not fight in close-quarters combat, Zhang Cang also had a martial skill!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith a shout, Zhang Cang’s aura suddenly erupted. True essence flooded into the slender saber, and that dazzlingly bright saber began to be covered with a dark red sheen the color of blood!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s the ‘Sunset Cut’!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Zhang Cang actually managed to cultivate this high-grade saber martial skill!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe entire audience’s eyes were wide with awe. This match that should have been an easy victory for Zhang Cang had turned into a fierce struggle between two evenly matched opponents. Now even with Zhang Cang utilizing the ‘Sunset Cut’, no one present thought that Lin Ming would lose.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Cang lifted that slender saber above his head. A burst of light the color of fresh blood surged from Zhang Cang’s saber. Zhan Cang’s surroundings had been illuminated by a deep red brilliance that converged together into a blooming sunset glow. This phantasmal image continuously streamed into Zhang Cang’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeeing this, Lin Ming slowly drew the spear that he had carried on his back. He had crossed the threshold of Strength Training’s ‘Flow like Silk’ that allowed him to let his empty palm meet a naked blade, but he hadn’t reached the level of empty palm meeting martial skill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe held the spear with one hand, his forearm parallel to the spear shaft, and his elbow pressing against the spear end. This 820 jin Penetrating Rainbow that was eight feet eight inches long was kept steadily horizontal. The spear stood motionless, as if he were a general cast in iron. This was a basic starting hand position of the ‘Foundation Spear Technique’ – ‘Iron Bridge Blocks the River’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming brought out his spear!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is a starting hand position of the ‘Foundation Spear Technique’! Heavens! It really is the ‘Foundation Spear Technique’!? This Lin Ming wants to use the ‘Foundation Spear Technique’ to resist the ‘Sunset Cut’? He’s too crazy!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone’s eyes widened without exception for fear of missing a single detail of this fight. If Lin Ming had been using a top-tier martial skill, they would not have anticipated this so much!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e’Foundation Spear Technique’ to ‘Sunset Cut’! What will the result be?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom this point on, none of them dared looked down any longer at Lin Ming’s ‘Foundation Spear Technique’. Because of Lin Ming’s domineering aura, this set of foundations that were the most simple spear skills had become deep and inscrutable as well!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ‘Foundation Spear Technique’ was not some profound high-grade cultivation method. In the entirety of spear arts, it was only the most basic foundation for spear moves. It was because this most basic foundation had been combined with Lin Ming’s terrifying 4200 jin strength, and with the thick true essence from the ‘True Primal Chaos Formula’, and the boundary of Strength Training’s ‘Flow like Silk’, that the power of this spear had reached such an intensely horrifying level!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Cang clenched his teeth. The muscles of his face had been complete twisted and made him unrecognizable. With his current strength, he barely managed to utilize this ‘Sunset Cut’. This was pushing his limits.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming, go die!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Cang gave a loud shot and the slender saber in his hand released an inexhaustible rose-red cloud. The air around him began to resound with deep rolling sound as if a fierce current were rushing back and forth. The wind of this red saber formed a billowing red cloud that seemed as if it would blot out the sky. Some of the nearby disciples of the Human Hall had weak cultivation, and their faces discolored as they could not withstand the berserk pressure of this strike.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eToo strong!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese disciples of the Human Hall gushed with a feeling that they had no way to resist this strike. If they stood in front of this blow, it was possible that just the pressure and aura of the rose-red cloud would overwhelm and crush them!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTurbulent red energy surged forwards like and endless raging sea. In contrast, Lin Ming’s ‘Iron Bridge Blocks the River’ was simple and unsophisticated; there was not even a half point of gaudiness to it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was as strong as he was, ‘Iron Bridge Blocks the River’!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Since you want to see my ‘Foundation Spear Technique’, that’s good, I’ve only practiced one move of the spear arts – ‘Flood Dragon Goes to Sea’!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming shouted and suddenly thrusted out the Penetrating Rainbow. This so-called ‘Flood Dragon Goes to Sea’, was in truth, simply a plain straight thrust!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe long spear had many styles. It could chop, dance, point, circle, sweep, and many other such moves. But the most basic, was the thrust!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe thrust was the spear’s soul!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA 820 jin heavy spear, a single thrust had the potential to crack open a mountain. An eight foot spear; breaking through all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith just a simple straight thrust, Lin Ming’s aura skyrocketed. Turbulent mountain rivers appeared around him and converged from all directions. They melted together and flowed into Lin Ming’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming had practiced this ‘Flood Dragon Goes to Sea’ less than a thousand times. However he had done so underneath a waterfall. This Lin Ming had practiced day after day until he had reached the stage where his spear was completely steady.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZhang Cang’s ‘Sunset Cut’ blotted out the skies above, just as if it were a turbulent and mighty current flowing in the air. But no matter how raging the current was, it could not match up to a waterfall created in an array that was setup by a Xiantian master. How could this possibly shake Lin Ming’s spear?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe red clouds that were spread all over the sky were melting as if they were clouds of snow. Lin Ming’s spear had a majestic and boundless aura, breaking through all!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe slender saber relied on speed to win. No matter how, if it competed with a spear, it would be defeated without a doubt!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe red clouds dissolved. Zhang Cang spat a mouthful of blood and flew backwards. He hit the ground with a cruel thud. It couldn’t be seen whether he was alive or dead.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming withdrew his spear. He stood at the center of the stage. At this moment, he was similarly straight just like his spear, the Penetrating Rainbow, with a sharp and unshakeable aura!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is too terrifying, this Lin Ming really won.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“’Foundation Spear Technique’… ’Foundation Spear Technique’ has that much power behind it? Lin Ming really used the ‘Foundation Spear Technique’ just now? I want to learn it too!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You want to learn it? You really think the ‘Foundation Spear Technique’ is really so fierce? This is just because that Lin Ming is way too strong, so anything he does will be strong. The move he just used was the ‘Foundation Spear Technique’s’ ‘Flood Dragon Goes to Sea’, but it is plainly just a straight thrust. If you want, you can enroll in the army. The soldiers practice this every day and I’ve never seen a soldier use it in such a kick ass way. This straight thrust is nothing fancy at all, but under Lin Ming, this simple move can break the ‘Sunset Cut’.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Someone who just entered the Viscera Training stage against someone who was a half-step into the Altering Muscle stage, and Lin Ming won. It’s not strange to defeat someone a stage ahead, but what is scary is that the one he beat is Zhang Cang. Zhang Cang is also an extreme talent that can beat those a stage ahead. If Zhang Cang left the Martial House, it wouldn’t be impossible for him to defeat someone at the peak of the Altering Muscle stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Have you noticed that from when Lin Ming came on stage to when he won, he hasn’t moved a single step…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt wasn’t known who said this, but the audience looked to where Lin Ming stood. Sure enough, after Lin Ming came onstage, he had used a palm, a fist, and a spear thrust. But he had not moved a single step!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRealizing this, even the disciples of the Heavenly Abode felt a chill crawl down their spines. Although Lin Ming’s ranking was far away, sooner or later he would enter the Heavenly Abode. With such a future rival pursuing them from behind, it made them all feel nervous and uneasy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLiu Mingxiang faced Lin Ming and felt his throat twitch as he took a dry gulp. He was completely scared, and his one consolation was that at the start of all this, Zhu Yan had looked for Zhang Cang, and not him. Otherwise, the one lying motionless on the ground would be him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe felt Zhang Cang’s pulse and found that he was alive and his life wasn’t threatened. However, his whole body was covered in severe injuries and several bone fractures. Even if he had top medical treatment, not to mention any permanent damage, he would still be bedbound for over half a month!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was not a murderer. In the Seven Profound Martial House, it was strictly prohibited to kill the opposite party in a gambling match. As for the heavy injuries from the collision, there was some suspicion, but Liu Mingxiang did not dare to investigate. In a panic, he carried the unconscious Zhang Cang on his back and prepared to leave. But at this moment, Lin Ming said, “True essence stones? 20 of them!”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-78\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-80\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-79","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
