{"id":54746,"no":801,"title":"Chapter 798 Unbelievable Speed","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 798 – Unbelievable Speed\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This brat, how is this even possible!?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe three Demon Envoys were running out of breath. They thought that Lin Ming used some kind of arcane ability that stimulated his bodily potential in order reach such extreme speeds. Those arcane abilities usually caused a few detrimental side effects, and were also impossible to maintain forever. However, Lin Ming didn’t seem like he had used up any strength at all, even after flying for such a long time. In fact, he seemed to have a great deal of energy left over. It also seemed that the more he flew, the faster he became! This was just too strange!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e1000 miles….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e2000 miles….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e3000 miles…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e4000 miles…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOnce they reached 5000 miles, Lin Ming still hadn’t slowed down, even after passing over the entire Jagged Slope Mountain Range.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Damn it! What should we do?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe third Asura Demon Envoy asked. He was a middle-aged man, ranked 93rd on the Destiny Decree. He currently had a pained expression as he took a shard of stalactite essence from his spatial ring, bitterly swallowing it down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We’ve already flown for around 5000 miles, and yet he can still last this long!?” Another Demon Envoy took a jade bottle out from his spatial ring and swallowed a snow white pill.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We’ve already consumed our true essence to the limit. His cultivation is inferior to ours, so it’s impossible for him to continue flying for much longer.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe one who spoke was the leading second Demon Envoy, his words filled with self-confidence. He was ranked 83rd on the Destiny Decree.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, what happened was….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e6000 miles….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e7000 miles…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt seemed as if Lin Ming wanted to fly out to a 10,000 mile distance. Not only that, but the more he flew, the faster he became! The first Demon Envoy had blue veins bulging out from his forehead.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was simply impossible!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had already flown an additional 2000 miles! This could already be considered as having flown far away, even with their standards….\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe second Demon Envoy’s complexion turned extremely ugly. Just what sort of secrets did this Lin Lanjian have on him? Why was he able to flee so quickly, and for such a long time?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnother 1000 miles flew by as everyone approached the 8000 mile mark. Lin Ming stlil maintained a relatively relaxed state throughout.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA flying martial artist was the same as a running mortal. If they ran at their top speeds, then they would only be able to last for about 100-200 meters before falling the ground in complete exhaustion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, if they maintained 70-80% of their maximum speed, then they could maintain this for several miles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was in the same situation. He was maintaining a flight speed of around 70-80% of his limit. After crossing 8000 miles, his consumption wasn’t too great. Furthermore, because he had already opened the Gate of Healing, his endurance and recovery ability had since far surpassed a normal martial artist. Thus, there was always an enormous amount of true essence in his dantian.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the three Demon Envoys behind him were in a much more miserable state. For the past 8000 miles, they had to fly as fast as they could, and the further they flew the more they fell behind. The third Demon Envoy had already consumed his third shard of stalactite essence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Don’t continue chasing.” The second Demon Envoy suddenly stopped. At the start of the chase, they had only been 10 miles far from Lin Lanjian. Now, they were over 100 miles away!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had also taken several medicines to supplement their true essence. No matter how good the medicine was, repeatedly consuming these medicines would eventually cause impurities to appear in their true essence. If that happened, they would be unable to display their peak combat strength. To be in that sort of situation within the borders of the Nine Furnace Divine Kingdom was undoubtedly dangerous.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This Lin Lanjian must have some sort of top supportive flight treasure or some kind of special arcane flight ability. He might even have both.” The second Demon Envoy said with a gloomy tone.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor a late Revolving Core youth to surpass a sixth stage Life Destruction master in speed and endurance, this was simply too unbelievable!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Damnit! Just how many amazing treasures are there on his body!?” The first Demon Envoy panted out. He had used up so much strength and effort, and had chased so far, just to end up empty-handed. Under their watch, they had only been able to watch helplessly as that Lin Lanjian stole away 300,000 spirit essence stones. This was simply too great a shame, and he could already see the news of this event spreading all through the martial cultivation world by tomorrow. The four Divine Kingdoms and all the powerful family clans in their hidden realms would regard them as absolute laughing stocks.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I will capture that brat and skin him alive!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe third Demon Envoy heatedly said. As he thought of the 300,000 spirit essence stones, he felt as if he would die from his intestines twisting in place.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere had been many rare, superior spirit essence stones worth 300,000 spirit essence stones in total. Even he couldn’t afford to use them during his training. He would only cautiously use a few dozen of those superior spirit essence stones if he was either breaking through a bottleneck in cultivation or attempting to cross over to another stage of Life Destruction..\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo shamefully lose 300,000 spirit essence stones just like that, the three of them would definitely take the blame for this. They would definitely be punished by the Asura Divine Kingdom!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Let’s meditate for some time and then return. There was no harvest from today, but I’ve managed to record a trace of Lin Lanjian’s energy. Even if he were to wear a wood spirit jade mask next time, I would still be able to identify him!” The second Demon Envoy said with a morose expression, before searching for a secluded area to meditate and recover.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had already flown 8000 miles outwards. This area was desolate and deserted, without any transmission arrays nearby. If they wished to return, then they would have to slowly fly back. As the three Demon Envoys remembered this fact, they became even more depressed, and their expressions became that much uglier.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They’ve finally stopped chasing me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e300 miles away from the three Demon Envoys, Lin Ming’s stood suspended in the air, his lips turned upwards in a cunning smile. Although those three Demon Envoys had consumed a great deal of their energy, he wouldn’t be so stupid as to bite off more than he could chew, and challenge the three of them. Those three were still sixth stage Life Destruction powerhouses, after all, and the fires of their lives were still blazing vibrantly. These were characters that had hopes of reaching the Divine Sea. When they were youths, they were definitely Emperor level talents, and outstanding ones at that. Even if only one remained, Lin Ming still wouldn’t dare return to provoke them. At this time, he just fundamentally wasn’t a match for them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJagged Slope Mountain, Asura Divine Kingdom Branch Division –\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That Lin Lanjian was way too impetuous. I wonder just what’s happened to him. Unfortunately, this entire Jagged Slope Mountain has been sealed off, so there’s no way for us to catch up to him.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No kidding. It’s too unfortunate, we missed a great battle!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hehe, sealing off this mountain is common, as Lin Lanjian is just that important. There are too many treasures on his body; he is simply a treasure himself. \u0026nbsp;Before he is caught, no news of this can be leaked out to others. Otherwise someone might catch up to him ahead of time, and the Asura Divine Kingdom would lose everything instead.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Elders of the various great sects were talking about whether or not Lin Lanjian would finally meet a dead end. At this time, however, three black-clothed men walked into the square. One of them was an old man who was in charge of the Asura Divine Kingdom’s Jagged Slope Mountain Branch Division.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Asura Divine Kingdom had several dozen branch divisions set up all over the Sky Spill Continent. The leader of a branch division was called the Hall Master. Because there were too many Hall Masters scattered throughout the continent, their status wasn’t considered too high.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, the Jagged Slope Mountain Branch Division was an exception. Because the Jagged Slope Mountain Branch Division was in charge of matters within the Nine Furnace Divine Kingdom, their branch division was one of the largest. This branch division’s Hall Master was just strong enough to rank on the Destiny Decree. Of course, he was far from being able to compare with the Demon Envoys.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hall Master Situ!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSeveral old men cupped their fists together in respect. They naturally recognized Hall Master Situ, due to frequently interacting with the Jagged Slope Mountain Branch Division.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHall Master Situ cupped his fists in return and said, “Everyone, please remain patient. My Divine Kingdom’s Sir Demon Envoys are already pursuing Lin Lanjian. They should be able to capture him without incident.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he spoke, he was also glad that the Jagged Slope Mountain Branch Division had three Demon Envoys garrisoning this place. Otherwise, there was no way that he could contend with Lin Lanjian. He simply couldn’t keep up with that strange, ghostly speed of his.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“As long as we can catch Lin Lanjian, then the matter of 300,000 spirit essence stones being stolen away in front of everyone, and the loss of face from that will be wiped clean. This could also be considered a great merit for me, as this gathering of heroes could be my rise to glory.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Hall Master Situ thought of this, his mood became much more pleasant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-797\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-799\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-798","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
