{"id":54036,"no":91,"title":"Chapter 90 - Cloud Prince","content":"\u003cp\u003e\u003cstrong\u003eChapter 90 – Cloud Prince\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMuyi slowly shook his head. To be fair, Yang Lin was far too kind; his temperament was not suitable to be the head of state. Although the charming stories from ancient times had told of many benevolent emperors who ruled their counties, that benevolence was only a single facet of their character. For instance, they would show one side to the officials, one side to the common people, and one side to their enemies. They would not be lenient or relent when it came to killing. Those who were too friendly and passive were not suited to be rulers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Lin said, “In the current Seven Profound Martial House ranking war, there appears to be some talent participating in the assessment. I sent Zishan and the others over because I wanted to win him over, but… I’m not entertaining any hope. My tenth younger brother has been at the battlefield in all directions for many years. He has captured the aristocrats of many neighboring countries and acquired massive amounts of wealth, jewelry, beautiful women, and cultivation method manuals… especially the rare cultivation manuals, these are particularly tempting to martial artists. I don’t think that I can offer anything comparable to what my tenth younger brother can.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the world was at peace, everyone would come to one for advantages, but when the world was in turmoil, one had to go to others for advantages. If a ruler wanted to win over talents, they needed to give corresponding rewards. Therefore, a prince’s wealth was also an important standard of their strength. Otherwise if you could not put out anything valuable, why would anyone die for them?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh? Talent? Who?” Muyi’s heart moved. He already had a faint guess.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming, 15 years old. This time he might enter the top 100 rankings in the Seven Profound Martial House.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming?” Muyi smiled. “Your highness please rest assured, Lin Ming will not be won over by the Tenth Prince.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Oh? Why do you say this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Little Brother Lin and I are friends between generations. Moreover his background is a bit mysterious; he has a formidable master behind him. He only went to the Seven Profound Martial House for some exercise and experiences. Even if the Cloud Prince were to put out some good cultivation method, it may not even be seen in Lin Ming’s eyes. And also… does your highness remember one month ago when I asked your highness to help rescue a friend? This was at the start of all and was also the same day as the Seven Profound Martial House entrance exam. He was framed and almost put in prison…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What… the… Teacher, do you mean to tell me that it was Lin Ming?” Yang Lin was quick thinking, he immediately understood what Muyi wanted to say.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Haha, yes, he was Lin Ming. Although I do not have much contact with little brother Lin, but I can tell you that I feel he is a very righteous and good person. Although at that time your highness Crown Prince’s help wasn’t much, Lin Ming should remember this kindness. Although Your Highness might not win him over, he also will not become a subordinate of the Cloud Prince and oppose Your Highness.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This, this is really a pleasant surprise.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Crown Prince lit up with an happy expression. Although the emperor’s body was getting worse every year, but under the care of precious medicines and the physicians’ martial arts conditioning, it would not be a problem to live 5 or 6 years, or even 7 to 8 years more. Such a long time was already enough for a talent to grow.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough there were quite a few Pulse Condensation martial artists in the Sky Fortune Kingdom, most of them were gathered at the Seven Profound Martial House. Others were bestowed titles by the government, and were basically in the military.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ones who could be utilized by the princes were less and less, because few people wished to wade into the turbulent waters of the throne change. Once they made a mistake and bet on the wrong horse, they would be beyond redemption!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn Yang Lin’s side, not calculating Muyi, there was only a single Pulse Condensation martial artist, who was already over 50 years old. But looking at the Seven Profound Martial House, there was Ling Sen, whose cultivation was already at the peak Fourth Stage of Body Transformation, and whose true combat strength approached the Pulse Condensation Period!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGive him a few years, and he could also reach that stage!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis Lin Ming could become the next Ling Sen!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming was a reputed rare talent at the Seven Profound Martial House that would only appear every few dozen years. If he decided to join a side, the power and influence he would gain would increase a step.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTherefore this competition for Lin Ming, although it appeared to be minor, was actually very significant!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, a red flame lit up in front of Yang Lin.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePure gold! An urgent sound transmitting talisman!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Your highness, Lin Ming’s result is in. His ranking is 62!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What!?” Yang Lin stood up on the spot. 62!!!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Crown Prince, he knew what it meant to achieve a ranking of 62 on the second assessment! Even Ling Sen was inferior to this!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLing Sen was already an abnormal existence. With his cultivation of peak Fourth Stage of Body Transformation, he was able to approach the strength of the Pulse Condensation Period, and this Lin Ming was even more aberrant!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe immediately sent out another sound transmitting talisman. Although he knew that it was impossible for Zishan and the others to make such a huge mistake, he had to confirm this matter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How is it?” The sound transmitting talisman sends the sound directly to the receiver’s mind. Muyi had not heard anything.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Lin took a deep breath and said, “Teacher, this Lin Ming’s result was rank 62.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What? 62?” Muyi was slightly perturbed for a moment but immediately relaxed. Of course, since Lin Ming was the disciple chosen by such a great master, how could he be a small fish in a pond? Ling Sen, Ta Ku, and others like them could be considered talents in the Sky Fortune Kingdom, but if compared to the disciples of the large sects that were taught by the highest masters, they were far worse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven if Lin Ming was able to reach rank 62 on his first assessment, it would not be an exaggeration!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMuyi believed that since Lin Ming had an extraordinary master behind him, then he must have a surprisingly good ability. Even if Lin Ming were to defeat Ling Sen in a few more months, Muyi at most would be astonished for a brief moment, and then also believe that this was normal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile Yang Lin received the sound transmitting talisman, the Tenth Prince also received one. The Tenth Prince did not care much for Lin Ming’s strength, as he had many more masters under him than the Crown Prince did. What he cared about was Lin Ming’s influence. Lin Ming was the eye of the storm in the Sky Fortune Capital City and a rising star in the martial artist circles. His talent was to the degree that it could only be found every few dozen years in the Seven Profound Martial House!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf such a character were to join him, then without a doubt his subordinates’ morale would greatly increase. There were even more people who were waiting to see the situation before thinking of joining him. If Lin Ming were to join, it would no doubt be easier.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut now, after hearing the news from the sound transmitting talisman, the Tenth Prince’s complexion immediately changed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo enter the Seven Profound Martial House for only one month and for this to only be his second assessment, and also to only have cultivation at the early Third Stage of Body Transformation, yet he was still able to reach rank 62 on the Ranking Stone!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis ranking had completely outstripped Ling Sen!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seven Profound Martial House had never had a record like this for a hundred years!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor one to be able to advance into the Seven Profound Martial House’s Heavenly Abode with just a peak Third Stage of Body Transformation could be considered a talent among talents if they managed to reach around rank 70. But Lin Ming had actually reached rank 62! And his cultivation was a full half-step lower! This was simply a monstrous genius!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e It was possible that Lin Ming would become a master who far exceeded Ling Sen! Disregarding the considerable influence he would have in pulling other martial artists over to his side, his combat prowess was enough to give the Tenth Prince a shock!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eDon’t forget, Lin Ming was only 15 years old and his cultivation was at the early Third Stage of Body Transformation; there was immense room for improvement!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Haha, the heavens help me! As soon as this rare talent that hasn’t been seen in a hundred years of the Seven Profound Martial House joins me, then the martial artists of Sky Fortune City will hear this and come shaking in their boots to join me!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Your Highness, any orders?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Prepare 50,000 gold taels immediately, two boxes of the finest jewelry, a dozen of the finest outstanding virgin beauties under 16 years of age, a hundred servants, and have them wait at Chunyuan Mountain Villa. Also, prepare 500 acres of fertile farmland and the title deed of Chunyuan Mountain Villa!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe man heard this and was secretly scared. Such rewards, was he for real!? Who was this for!? A villa, 50,000 gold taels, and two boxes of the finest jewelry were more than enough to win over a general!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Tenth Prince was positive that he had this. In fact, he also had a secondary reward that gave him the most confidence. It was a set of rare human-step manuals that he had looted from an aristocratic family. With this, he had won over many martial artists.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yang Lin, Yang Lin, you will lose to me. What you can put out is not even a tenth of what I can. I want to see how you will struggle when you are fully pressured by me. I don’t need that old fogy to die; I will make the first move and catch you off guard!”\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-89\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-91\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-90","bookId":1508,"creation":"Sep 10, 2019 5:41:17 AM","modification":"Sep 10, 2019 5:41:17 AM"}
