{"id":54885,"no":940,"title":"Chapter 936 Erase Them All","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 936 – Erase Them All\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWithin the 100,000 mile long White Cloud Mountain Range, in a deep and desolate canyon. Here over 50 Divine Sea powerhouses had gathered within three days. Except for the 20 some Divine Sea powerhouses from the Asura Divine Kingdom and their subordinate influences and also the Northwest Great Desert, nearly every Divine Sea powerhouse from the Sky Spill Continent had arrived here today.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Seven Star Majesty, where is Sage Lin?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes, where is Sage Lin?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone began to ask Li Yuxiao. In particular, those that had tracing marks within them or those that had a variation bloodline or divine body were especially impatient.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had to be known that most of these people had tracing marks within them and were tightly controlled by Yang Yun. If they revolted against him and won, everything would be happy and wonderful. But if they lost, it meant death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA Divine Sea powerhouse had thousands of years of life and were also overlords of their own lands; which one of them was willing to die? If Yang Yun hadn’t forced them into a dead end, none of them would have desperately risked their lives to resist him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIf they were to place their lives on the line in a final struggle, they needed a qualified leader to command them. Otherwise, rather than walking into the jaws of death, wasn’t it better to linger on alive?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one doubted Lin Ming’s talent. Within the last 100,000 years of the Sky Spill Continent, he stood at the pinnacle of all geniuses. But many of these people actually lacked faith in his strength. Three to four years ago Lin Ming hadn’t even been comparable to an ordinary Divine Sea powerhouse. In such a short span of time, no matter how many lucky chances Lin Ming obtained, was it actually possible for him to possess the strength to challenge Yang Yun?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs everyone anxiously waited, Lin Ming finally emerged from the White Cloud Mountain Range’s cave dwelling. His clothes were white and unblemished, his aura was restrained, and every step he took was peaceful as if he stepped on the void, carried by the wind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Please remain patient.” Lin Ming lifted his hand. His voice contained an invisible energy field, making all those who heard him calm down and feel relaxed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“He’s Lin Ming. He looks a bit different from the portraits that Yang Yun has given us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Indeed. Although the appearance is similar, the atmosphere and temperament around Lin Ming cannot be contained in a simple portrait. I’ve seen many mighty people in my life. Some have a tyrannical momentum, brutal and aggressive, and some have a steady aura as if they returned to their true self, indiscernible from a mortal. But the feeling I get from Lin Ming is stranger. When I look at him, I feel like I’m facing the endless starry skies. There is no order, no borders, no limit, it is impossible for me to speculate on him!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe one who spoke was a blue-clothed old man. He had a long white beard, and he stood atop a spinning compass that floated in the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis old man was named the Sage Heavenmirror. He was a martial artist that had relied on his own strength to break into the Divine Sea, and his cultivation had reached the peak of the middle Divine Sea realm. Before the appearance of Yang Yun, Old Man Good Fortune, Whitedemon, and a few others, his strength had once been ranked in the top 10 of the Sky Spill Continent. Rumors said that the compass underneath his feet could even look into the past and prophesize the future; it was extremely mysterious.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe reason that Sage Heavenmirror had such a great prestige and fame amongst the Divine Sea powerhouses of the Sky Spill Continent was because of his sight. As he first looking at Lin Ming, he felt as if he were staring at a chaotic starry sky. In truth, this was the grandmist space.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sage Heavenmirror, you have the best sight amongst us. What do you think Lin Ming’s chances of defeating Yang Yun are? I’m a bit dubious about this. Perhaps after another 5-6 years pass, he might have that possibility.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSage Heavenmirror said, “The future is comprised of infinite changes and truths; to calculate it is easier said than done. With my current cultivation, foreseeing the destiny of a mortal nation is possible, but to discern the future fate of a True Dragon, I do not possess that ability.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSage Heavenmirror shook his head again and again, attracting Lin Ming’s eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming thought to himself, “I never thought that this world would actually have such an exquisite divination cultivation method. This is quite amazing.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sage Lin, can you unravel the tracing mark in our bodies?” A soothing and melodious woman’s voice suddenly rang out. The one who spoke was Yu’er. She had a variation bloodline and also a tracing mark on her. If Yang Yun wished to kill her, there would be nowhere for her to escape to.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“That’s right, could you lift the tracing mark from us first?” Some people echoed Yu’ers thoughts. This was the most important immediate goal for them. If they didn’t have the tracing mark within them, then even if they lost they still had a chance of escaping.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAlthough Lin Ming was well known for his powerful battle spirit, the people present found it hard to believe that he could reach silver perfection in just a few years. After all, Lin Ming’s cultivation was only at the fifth stage of Life Destruction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAccording to the reports from Fairy Snow Gale, one needed to have stepped into the boundaries of the late Divine Transformation to acquire a perfect silver battle spirit\u003c/span\u003e\u003cspan style\u003d\"\"\u003e. From the fifth stage of Life Destruction to the late Divine Transformation realm, the distance between was already beyond their imaginations.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I can.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming stretched out his hand and flicked his fingers. A grey arrow of energy zipped into Yu’er’s body. This grey energy was the grandmist battle spirit. Although it was only at the silver large success level, the quality it possessed was superior to the Ancient Devil’s perfect silver battle spirit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battle spirit drifted within her body. It turned into a silver grey spear that aimed towards the battle spirit mark and violently stabbed at it!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKacha!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battle spirit mark shattered like glass as it was instantly erased!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHo!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA grey energy flew out from Yu’er’s body. She blinked several times, a dazed look on her face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Was it over?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This...the tracing mark is gone?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYu’er’s husband asked, flabbergasted. He too had a battle spirit. Although it was only at the most basic bronze forming stage, he could still sense that the battle spirit mark within Yu’er’s body had disappeared!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn just several blinks of an eye, the tracing mark that Yang Yun had left within them, a dearth perk that caused them to have trouble eating and sleeping for these past few years, was actually pulled out like radish and chopped up by Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was just too easy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were a good number of Divine Sea powerhouses that had a battle spirit. They also soon realized this. This proved that the potency of Lin Ming’s battle spirit was greater than Yang Yun’s!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“A silver grey battle spirit, how could it be silver grey?” Sage Heavenmirror couldn’t understand what was happening. He had a great deal of understandings into the ranks of battle spirits, but he had never heard of a silver grey battle spirit before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming naturally wouldn’t explain further. He said, “We’re going to speed this up. Yang Yun should have already discovered that his battle spirit mark has been erased. In ten breaths of time, I’ll erase everyone’s battle spirit marks, then we’ll collectively go the Nine Furnace Divine Kingdom through the transmission array and annihilate Yang Yun!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s words were filled with a zealous energy and the confidence that belonged to a king.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ten breaths of time? How could he possibly do that in ten breaths of time?” Some people began to wonder if Lin Ming had made a slip of the tongue. But at this time, Lin Ming flicked his fingers again and dozens of silver grey battle spirit energy balls shot out, each separately piercing into the Divine Sea powerhouses like a barrage of javelins. All of the martial artists glanced at each other, stupefied. Did Lin Ming plan to erase all of their battle spirit marks together in a single go?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was far too aggressive!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey had all thought they needed to be extremely careful in lifting the battle spirit marks, slowly wearing them down with will over an extended period of time in order to completely erase it. When Lin Ming had wiped out the battle spirit mark in Fairy Yu’er’s body in just a few blinks of the eye, that was already astounding enough to them. They never thought that the next action Lin Ming would take would be even crazier. He wanted to obliterate every battle spirit mark at the same time!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn truth, this wasn’t too strange. Lin Ming’s grandmist battle spirit was more intense than the Ancient Devil’s battle spirit. If the Ancient Devil could leave behind multiple spirit battle marks, Lin Ming could also erase multiple battle spirit marks at once!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePeng peng peng!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNearly indiscernible sounds came from everyone’s bodies, as if a soul was breaking. In just 10 breaths of time, several dozen battle spirit marks were completely and thoroughly destroyed by Lin Ming!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis scene left everyone speechless and in shock. Maybe, just maybe in another 3-4 years, Lin Ming really had the possibility of growing to a level where he could defeat Yang Yun!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e………\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt this time, deep within the Nine Furnace Divine Palace, Yang Yun was completely immersed within a blood pond. His cultivation had reached a critical point.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis entire body was covered in a diagram of blood. Viscous blood was sucked into his mouth, spreading through his meridians and seeping out of his pores. A faint trace of blood line energy and essence remained within his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn between Yang Yun’s eyebrows, the vertical red line began to slowly split open, revealing a bright red eyeball. This eyeball was also wrapped in a layer of blood essence; it looked extremely ghostly and eerie.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAround Yang Yun, the blood dao diagram slowly contracted as if it were about to fuse into his body. As it shrank it beat like a heart in a macabre fashion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s time. Once I absorb this blood dao diagram, my Great Blood Refining will nearly be complete. All I’ll have to do next is to fully form this Blood Law Eye. In another month or two, my Great Blood Refining Art will reach large success. At that time, I can use the Blood Law Eye to absorb a trace of Lin Ming’s bloodline and then find him anywhere within a million miles. I’ll hunt him down, kill him, and wrest away his destiny. With his great secrets in my hands, I’ll step onto the peak of martial arts!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe red line between Yang Yun’s eyebrows was the third eye of the Great Blood Refining Art – the elementary form of the Blood Law Eye. Once this eye was completely formed, it could be used to search for Lin Ming in a range of a million miles. As for obtaining the aura of Lin Ming’s bloodline, he had already obtained that when he fought with Lin Ming several years ago at the Temple of Marvels.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo use the Blood Law Eye to absorb the aura of a bloodline; he would then completely understand Lin Ming’s position. This was the absolute best method he had decided to search for Lin Ming using the Great Blood Refining Art.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Blood dao diagram, flesh and blood astral body, combine two as one!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun roared and energy erupted from his body like a volcanic explosion. A rich power of blood rose up, solidifying into tentacles. Every tentacle was only as thick as a finger, but there were thousands of them altogether.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePa pa pa pa!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese tentacles latched onto the blood dao diagram, wanting to completely drag it into Yang Yun’s body.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe tentacles contracted as they pulled against the resistance of the blood dao diagram’s natural strength. As for Yang Yun, his eyes turned blood red, and veins stuck out from his body like wriggling worms. He was using his complete strength in the process.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Almost there! I’m almost there!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun grit his teeth and watched as the blood dao diagram nearly completely sank into his body. But at that moment, he felt a deep pain stab into the deepest recesses of his soul, as if he was being pierced by needles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Mm? What?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Yang Yun was distracted, the blood dao diagram broke free from a tenth of the blood tentacles and began to expand outwards again.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Someone has erased my battle spirit mark?” Yang Yun was enraged. A battle spirit mark was connected to his main battle spirit. If it was forcefully wiped out, it’d naturally have an impact on his body. Especially as he was in the most critical moment of his cultivation, if there was any mistake during the process then it was possible he could fall into obsession. But if it were only a single battle spirit mark being erased, that was also easily withstood.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-935\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-937\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-936","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
