{"id":54889,"no":944,"title":"Chapter 940 Fighting Yang Yun","content":"\u003cp\u003e\u003cspan style\u003d\"\"\u003eChapter 940 – Fighting Yang Yun\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith the Nine Furnace Great Array shattered, the Nine Furnace Divine Palace was completely exposed to the barrage of over 50 Divine Sea masters.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe massive divine palace extended over several hundred miles. There were glorious jade palaces and beautiful lake pagodas, both looking like heaven on earth. But now, everything would have to bear a devastating disaster.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Everyone, please show mercy! The Nine Furnace Divine Palace houses a great number of my Nine Furnace Divine Kingdom’s disciples and clansmen. They’re all innocent! Yang Yun is currently residing in the deepest minor dimension within the Nine Furnace Divine Palace; it’ll be good as long as we can break into that area.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Fairy Snow Gale and Yang Chenglin saw everyone’s attacks about to fall onto the Nine Furnace Divine Palace, they quickly called out to stop them. They were part of the Nine Furnace Divine Kingdom and certainly didn’t hope to see the innocent disciples slaughtered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You two are right!” Lin Ming raised his hand, calling a stop to the attacks. He swept out with his divine sense, locking onto the position of the minor dimension in the blink of an eye. There it was, a red pagoda with a blood red light that soared into the skies. Without a doubt, that was where Yang Yun was hiding. There was nowhere else he could be.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“If you don’t want to come out, then I’ll make you!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming waved his hand and the Great Desolate Blood Halberd jumped into his hands. On the blood halberd, thunder and fire energy twisted together, sending out a dazzling light like a birthing sun.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePenetrating Rainbow!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming struck down with the halberd. It was like a river of stars dropping down from the nine heavens, splitting apart the sky. A titanic power of thunder and flames wove together, and within, two faint dao diagrams appeared; they were red and purple!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFor a postcelestial dao diagram to appear during a martial skill attack, this was an ability that Lin Ming gained after breaking through to the fifth stage of Life Destruction and having the dao traces engraved into his Revolving Core. Only when one\u0027s understanding of the world’s Laws reached an extremely high boundary would this sort of phenomenon occur. These dao diagrams would be naturally formed, representing the operational rules of source energy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Postcelestial dao diagram!” All of the Divine Sea powerhouses were individuals with great amounts of experience. They were able to understand just what the dao diagrams appearing behind Lin Ming meant at a glance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is incredible. Just a casual attack already contained a dao diagram, and moreover two dao diagrams at that. This sort of boundary has already surpassed my comprehension. I’ve heard rumors that when the Eightfall Thunder Emperor used the Sword of Judgment, a purple dao diagram would form behind him. But that was only one dao diagram! Lin Ming has two dao diagrams, and they seem to represent thunder and fire!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“At the fifth stage of Life Destruction Lin Ming has already surpassed the Eightfall Thunder Emperor!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the Penetrating Rainbow shot out, the world paled. This was Lin Ming’s self-created martial skill. Although its level of finesse couldn’t compare to the supernatural powers possessed by those in the Divine Realm, it was most suited for him, a martial skill tailored to his strengths.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBang!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThunderfire energy crashed down like an avalanche. A long piercing cry emitted from the deepest parts of the Nine Furnace Divine Palace. A giant blood diagram emerged from the ground to welcome the Penetrating Rainbow!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe thunder and fire dao diagrams fused together, crashing into the blood diagram.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe void shattered. The red pagoda deep within the Nine Furnace Divine Palace was broken in half, completely destroyed!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA demonic red-clothed man slowly departed from the ruins. This man had three eyes. The third eye between his eyebrows seemed wrapped in red crystal as if it weren’t fully formed yet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis person was Yang Yun. \u003c/span\u003e\u003cspan style\u003d\"\"\u003eHe was tranquil as he looked indifferently at Lin Ming; there was neither joy nor anger on his face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yang Yun…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBeside Lin Ming, as the other dozens of Divine Sea powerhouses saw Yang Yun appear, their eyes shrank. Even if they had Lin Ming commanding them, even if they had so many of them gathered together, now that they were truly coming face to face with Yang Yun, they felt their hearts shaking. This was the result of fame and momentum that had gathered over such a long period!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was just like a mortal facing a fierce tiger. Even if there was a warrior on their side able to compete with the tiger, they would also find it difficult to remain calm. No one could guarantee that this brave warrior would be able to block the tiger whil also keeping them safe and sound.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong them, only Lin Ming was calm and poised as he faced Yang Yun.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yang Yun, it’s been nearly four years since we’ve last crossed paths. Time flies by far too quickly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Nearly four years? Haha! Haven’t you been hiding from me for these last four years? I do have to admire you though. Your strength has truly risen too quickly, and your battle spirit has also nearly reached the gold level. How else would you’ve been able to erase all my tracing marks in just several breaths of time?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun’s eyes shined with a cold light. Just as his cultivation method was reaching completion, Lin Ming had chosen that most critical time to disturb him, causing him to fail and even causing his soul to be damaged. He nearly fell into madness, and the Ancient Devil he had swallowed couldn’t be suppressed for a brief moment, causing it to regain consciousness. Because of that, he had nearly lost his own identity and mind.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could Yang Yun not be furious!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming narrowed his eyes as he gazed at Yang Yun, seeming as if he could see through him. He shook his head, “I’m still very far from possessing a gold battle spirit.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA gold battle spirit and a silver battle spirit were fundamentally different.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA silver battle spirit was sharp and able to strengthen the attack of a martial artist. But it ultimately couldn’t directly impact the combat strength of a martial artist; it was like icing on the cake.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut a gold battle spirit was different. Once one had a gold battle spirit, their will would be so powerful that they could directly project their world of will into reality, affecting the real world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming, you’re marvelous. You hid from me for years and yet you managed to choose the best time to challenge me. Destiny has truly gathered in your body. It seems that for these past four years, you’ve had another series of fortuitous encounters.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming slowly said, “My destiny is accumulated over time. Through victories, through escaping dangers, I have inscribed my will to win and valiant spirit into my bones. I did this without wetting myself with karma and also by resolving my fatality with the world. Naturally I’d have a great destiny on my body. However, your sins are far too heavy. You imprisoned your father and even killed your own great grandfather. Everything you’ve done will inevitably become shackles of fate that lock you down. Moreover, my so-called fortuitous encounters aren’t fortuitous encounters at all. They’re placed there for all who can obtain them to obtain them. For me to do is the result of my strength!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming raised the Great Desolate Blood Halberd and pointed the halberd blade towards Yang Yun’s head. The Death God Force Field and Asura Force Field invisibly spread outwards. As everyone was surrounded by this killing intent that was so thick it nearly condensed into reality, they couldn’t help but retreat to a safe distance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA battle of this level already surpassed the limits of their strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBeneath Yang Yun’s steps, a crimson blood diagram appeared as he extracted a blood red sword from his spatial ring. With the blood diagram beneath his feet and a sword in his right hand, he swiped his left hand against the blade, leaving a line of blood. This was the greatest and most important battle of his life. It was time for him to fight with everything he had!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Lin Ming, you truly deserve to be called the most outstanding talent the Sky Spill Continent has seen in the last 100,000 years. But even so, you’ll still lose to me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun directed his sword at the world, his words containing a noble aura that looked down at all others with contempt. He was like the king of the heavens and earth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming only laughed as he heard Yang Yun’s words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun’s complexion turned a tad colder. “What are you laughing at?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Of course I’m laughing at you. You’ve been injured and were even forced to use an arcane ability to suppress your wounds. You even had to smear your blood essence onto your blade. To use the strength of your blood essence will cost you your lifespan. You’ve actually injured yourself just to put on such an act. You appear as if you’re filled with confidence, but all you are is a bragging faker.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s voice was light as if he were casually conversing. But as his words fell upon Yang Yun’s ears, Yang Yun felt his heart shake.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis damned brat, how did he see I was injured!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eUsing the Great Blood Refining Art, Yang Yun had sacrificed 300 years of his life in order to suppress his injuries.\u003c/span\u003e\u003cspan style\u003d\"\"\u003e This couldn’t be seen on the surface, but Lin Ming had somehow managed to see through everything. How could he not be shocked by this? It felt as if everything he did was within Lin Ming’s control. How was this possible?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Could he have calculated the time I would be wounded after he erased my battle spirit marks? Or does he have some divination high master assisting him from behind? No, that’s impossible!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming’s sudden words could be called a psychological attack. Even though Yang Yun tried not to show his emotions, he was actually tricked by Lin Ming’s words, causing the unwavering belief he had in emerging victorious to slightly shake.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust as a brief gap appeared in Yang Yun’s thoughts, Lin Ming suddenly rushed forwards. Behind him, a blood red Prime Emperor Lotus Flower bloomed. Grandmist space came shrouding down from the skies with irresistible force!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn this life or death battle, Lin Ming naturally wouldn’t care about showing a gentleman’s fairness or honesty. Killing Yang Yun was the only goal!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Humph! So you wanted to use your words to affect my mentality and ambush me! Your plan is calculated quite well, but this only proves that you do not have full assurance to defeat me! Blood array diagram, explode!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun waved his hands and the blood array diagram underneath his feet shot towards Lin Ming. As it neared him, it suddenly detonated!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Ming smashed the Great Desolate blood Halberd onto the array diagram, causing his offensive rush to be slowed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter Lin Ming took the initiative, Yang Yun was only able to sacrifice his blood array diagram to delay his attack. “Lin Ming, I’ll let you experience the glorious majesty of the Great Blood Refining Art! The Great Blood Refining Art can refine all bloodlines in the world. As long as you possess a body of flesh and blood, you will be restrained by my supernatural powers!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Six paths of samsara, eight ranks of demigods, blood pond of hell, refine!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYang Yun was covered by a blood red light that soared to the heavens. His long red hair crazily flew into the air. Behind him, a blood red scroll appeared. On it were drawn images of countless lives, and every single life was in immeasurable pain. The great ten torture methods of the world were there; shearing the nose, gouging the eyes, hot pillar, fried by oil, death by dismemberment, and the others. Not only that, but there were also the 18 hells. The black rope hell, tongue slitting hell, inferno hell, iceberg hell, and so on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery pain imaginable was represented within the picture scroll. Seas of blood reached the skies and waves of blood tumbled about. One only needed to look at this picture scroll to feel an incomparable constraint in their hearts. If one had to completely concentrate on this picture scroll, they would even turn mad.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven though the 50 some Divine Sea masters were dozens of miles away, they simply didn’t have the momentum to frontally face this picture scroll. Even so, they could feel the blood within their bodies heat up, boiling, as if all the blood within their body was being called away from them with an irresistible force. Their heartbeats quickened until it seemed as if it would burst out from their chests at any moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What a strange supernatural power! It can summon the power of blood from within a person’s body. If someone were to be wrapped in this scroll, they would probably be reduced to a puddle of blood in no time at all!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Great Blood Refining Art is truly worthy of its reputation. It can even directly refine life!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThese Divine Sea powerhouses were all experienced individuals. They only needed to look upon the aura of the picture scroll to sense how powerful it was.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lin Ming stood there, his arms crossed behind his back. Placed within the Divine Realm, the Great Blood Refining Art could only be considered a decent supernatural ability; it wasn’t anything too extraordinary. Most importantly, Yang Yun hadn’t been able to cultivate it to completion yet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-939\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/martial-world/mw-chapter-941\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/martial-world/mw-chapter-940","bookId":1508,"creation":"Sep 10, 2019 5:41:19 AM","modification":"Sep 10, 2019 5:41:19 AM"}
