{"id":86715,"no":9,"title":"Page 9","content":"\u003cp\u003eMari’s eyes opened, and she saw him standing across the room. “Oh,” she said startled. Her hands slipped to her sides like she was going to push herself up.\u003c/p\u003e\n\u003cp\u003eTrystan crossed the room quickly, before she could sit up. Grinning down at her, he asked, “Hanging upside down off the end of the couch, are we?”\u003c/p\u003e\n\u003cp\u003eMari smirked, “Maybe.” Trystan laughed and it was contagious. Mari’s soft laugh filled his body and warmed him, chasing away the rest of the animosity he felt toward Seth. “Definitely. I wanted to see if my hair could touch the floor if I leaned over the side.”\u003c/p\u003e\n\u003cp\u003e“Does it?”\u003c/p\u003e\n\u003cp\u003eShe nodded, “Yup.” Mari’s eyes were focused on his mouth. Trystan squirmed a little wondering why she was looking at him like that. “What happened to you? There’s blood on your mouth.”\u003c/p\u003e\n\u003cp\u003eTrystan straightened and tried to dab it away. “Nothing. Seth and I don’t see eye to eye on something. It didn’t end well.”\u003c/p\u003e\n\u003cp\u003eMari slipped off the couch and stood up in front of him. She licked the back of her thumb and ran it over his mouth, removing the rest of the dried blood, before wiping her hands on her jeans. The touch was light, gentle. Trystan’s stomach felt like it was floating. How she could do that, how she could reach out and touch him without thinking twice was... he didn’t know what it was. The nurse wore gloves when blood was involved, but Mari didn’t seem to think Trystan was anything to be worried about. She trusted him in a way that surprised him.\u003c/p\u003e\n\u003cp\u003eMari looked down and when she met his eyes again, Trystan asked her softly, “What does it feel like to sleep with someone you don’t love?” Her eyes widened and she looked up at him. Her lips parted like she wanted to say something, but her jaw just hung there suspended. Trystan became serious, all traces of humor stripped away by the question, “Do you really want to know?” Do you already have someone picked out? Did you give up on your dreams? Was I the one that pushed you to do it? He stared down at her, hating himself. Breathing hard, heart fluttering, he watched her. Her brown eyes didn’t stray from his.\u003c/p\u003e\n\u003cp\u003eShe didn’t apologize, she didn’t explain. She just stood there, watching him breathe like everything was normal. After a moment, Mari smiled sheepishly. “You knew that was me. I figured you would.” She looked down at her fingers, as they twisted in her hands.\u003c/p\u003e\n\u003cp\u003eHe stepped closer to her, “Of course I would. And I knew what you meant, too. I just couldn’t write it there. Too many people are watching, looking for me.” He wrapped his fingers around hers as he spoke, suspending the nervous wringing of her hands.\u003c/p\u003e\n\u003cp\u003eMari didn’t pull away. “So, what’s it like?” She sounded curious and it killed him. It killed him that she asked—that she wanted him to tell her it was good. He could hear the hope in her voice.\u003c/p\u003e\n\u003cp\u003eTrystan watched her dark, rich eyes. There was a hint of something in her voice, like she’d given up on her ideal. Guilt gnawed at him, like he was the one who pushed her to it. What was he supposed to say? That sleeping around helped him forget about his life? That he used it to hide from reality for a while. In those moments, it felt like time was suspended, like there was nothing to fear—like he could survive the lot he’d been given. But now, seeing the look on Mari’s face, he couldn’t say that.\u003c/p\u003e\n\u003cp\u003eSleeping with her would be different. He lowered his lashes, and glanced at her hands. Swallowing the lump in his throat, he finally said, “It’s not worth it, not compared to what you could have.” His thumb stroked the smooth skin on the back of her wrist. His heart pounded harder. It felt like a confession, like everything he’d done until now was wrong—like he knew his salvation was standing in front of him.\u003c/p\u003e\n\u003cp\u003e“Compared to what I could have?” she repeated. “And what’s that, Mr. Scott?” One of her dark brows lifted. It made her look jaded and he didn’t like it. Cynical was something Mari was not. There’d been a pureness that attracted him to her. The way she lived her life with her whole heart was brave. She put herself out there and was willing to take chances that he never took. That demanded admiration, even if she didn’t realize it. Now, it seemed like she was thinking about chipping that away. The thought killed him.\u003c/p\u003e\n\u003cp\u003e“Love,” Trystan’s voice was deep and determined. “It makes everything else seem trite.” He looked down, unable to meet her gaze.\u003c/p\u003e\n\u003cp\u003e“You sound like a little hypocritical, there Trystan. There can’t be one set of rules for you and another set for me.” She sucked in air and added, “I saw you leave with her last night. Ten bucks says you didn’t even bother to get her name.”\u003c/p\u003e\n\u003cp\u003eFuck. Trystan ran hands through his hair, his heart sinking into his shoes, “You’re right. I didn’t know her name. And the truth is, I didn’t know what I’d do until the moment came.” It was a confession that he didn’t plan to give, but if fell from his lips like drops of rain.\u003c/p\u003e\n\u003cp\u003eMari’s hands fell to her sides, her gaze locked on Trystan’s face. “Oh, and what’d you do?”\u003c/p\u003e\n\u003cp\u003e“Took her home. Said goodnight.” He glanced up at her from under his brow, “She’s not the one I want.” His eyes connected with hers and held. There were so many things he wanted to say. Trystan’s body felt light and lithe. In that moment he wanted nothing more than to lift his hand and feel Mari’s soft skin under his fingers, and taste her lips. The longing in his gaze made him feel exposed. He wanted her to see it. He wanted her to know she was the one.\u003c/p\u003e\n\u003cp\u003eBut for whatever reason, Mari was blind—or worse—she didn’t care. Mari looked away and nodded, “I see.”\u003c/p\u003e\n\u003cp\u003eTrystan smiled softly, whispering, “No, you don’t—but I wish you would.” Glancing at her, Trystan’s heart beat wildly in his chest. Every urge he had was wrong. He wanted to wrap his arms around her, pull her to him, and kiss her with all his might. The way her eyes darted away, the way her lips parted like she was disappointed, killed him. Part of him wanted to tell her—no, to show her, how he felt—but his mind kept telling him not to. There was only one chance for him to get this right, and now was not the time.\u003c/p\u003e\n\u003cp\u003eBefore he could say anything else, Mari smiled weakly and leaned forward, her beautiful face coming closer to his until her lips met his cheek. Her soft lips brushed his face, pressing against his cool skin before retreating.\u003c/p\u003e\n\u003cp\u003eShocked, Trystan stared after her, unable to speak. Bewildered, he finally managed to ask, “What was that for?”\u003c/p\u003e\n\u003cp\u003eMari shrugged, and looked up at him out of the corner of her eye, with a grin on her lips, “What? You’re the only one who can steal a kiss?”\u003c/p\u003e\n\u003cp\u003eCHAPTER 10\u003c/p\u003e\n\u003cp\u003e~MARI~\u003c/p\u003e\n\u003cp\u003eMy heart was pounding in my chest, beating harder than I’d ever felt it as I leaned toward Trystan’s face. It wasn’t a conscious plan. I didn’t think, hey, let’s kiss Trystan on the cheek and then grin like an idiot. Instead, I found my body moving without my consent. I was so happy he didn’t sleep with her. I was so glad that it flooded my body like liquid sunshine coursing through my veins. Before I could stop myself, I felt my lips brush his cheek. Wildly fighting every urge within me, I made sure it was just a peck. I made sure I didn’t take his gorgeous face in my palms and pull his lips to mine. Breathing steadily, I looked up at him when I stepped away, trying to ignore the jitters that were making me giddy.\u003c/p\u003e\n\u003cp\u003eTrystan’s voice was airy and filled with shock, “What was that for?”\u003c/p\u003e\n\u003cp\u003eThe perplexed look on his face made me say it. “What?” I asked, looking at him from the corner of my eyes. I could feel the smile spreading across my lips and I couldn’t hide it. “You’re the only one who can steal a kiss?”\u003c/p\u003e\n\u003cp\u003eTrystan blinked like he didn’t hear me right. It was a moment that I’d play over in my mind again and again. Everything about it was perfect. That look, that baffled look on his face, made me want to dance. Unable to hide my giddiness, I swallowed a giggle, but it sounded like a sultry laugh instead.\u003c/p\u003e\n\u003cp\u003eTrystan tilted his head to the side, eyes wide, like he didn’t know what came over me. Before I could say anything, he stepped behind me and wrapped his arms around my waist. The vixen, that seemed to possess me moments ago, fled when Trystan’s fingers started tickling my sides.\u003c/p\u003e\n\u003cp\u003eHis lips were next to my ear. I could feel his breath wash over my neck as he teased, “Kiss stealer.”\u003c/p\u003e\n\u003cp\u003eI laughed hysterically, my knees buckling from under me. Trystan scooped me up in his arms and tossed me in the air. I shrieked as I fell straight down onto the couch. Before I could breath, Trystan pinned me by sitting on my legs and continued to tickle me.\u003c/p\u003e\n\u003cp\u003e“Kiss ninja,” I laughed, trying to get my fingers to wiggle in a ticklish spot on Trystan’s lean body.\u003c/p\u003e\n\u003cp\u003e“Kiss ninja?” he laughed, moving his hands over my sides, applying the perfect amount of pressure to make me laugh the hardest.\u003c/p\u003e\n\u003cp\u003eBetween hysterical giggles I managed, “Yeah, because you sneak up all stealthy like a ninja.”\u003c/p\u003e\n\u003cp\u003e“Kiss thief,” he said smiling, his fingers moving between my belly and my underarms. Laughter made me shake so hard I couldn’t stop. The glimpses I got of Trystan were filled with pure joy. His eyes sparkled, brilliant blue as he laughed.\u003c/p\u003e\n\u003cp\u003e“Kiss cowboy,” I blurted out. That one made him chuckle really hard.\u003c/p\u003e\n\u003cp\u003e“Kiss bandit.”\u003c/p\u003e\n\u003cp\u003eRight then his hands were on both sides of my waist, applying enough pressure to make me squealing with laughter. “Kiss assassin! You’re killing me! Stop!” I laughed, certain I was going to explode in a ball of giggles. As we wrestled on the couch, Trystan leaned into me. From trying to pull away my hair was covering my face, several curls stuck to my lips.\u003c/p\u003e\n\u003cp\u003ePanting hard, he stilled and brushed the hair out of my face. “A kiss assassin sounds kind of sexy. I’d like to see one of those.”\u003c/p\u003e\n\u003cp\u003e“Grab a mirror, because I’m totally looking at one. He has bright blue eyes, a killer smile, and he’s a closet musician.” A wicked grin spread across my lips. “All the kiss assassins are—”\u003c/p\u003e\n\u003cp\u003eBefore I could say anything else, his fingers tickled me again. This time when I stopped laughing, something changed. I was more aware that here he was, how he was laying with half of his body on top of mine, on the couch—the nearness of his mouth and his breath on my face.\u003c/p\u003e\n\u003cp\u003eTrystan looked down at me, still smiling softly. My heart hammered in my chest, but this time it wasn’t from tickles or silly words. His gaze pinned me in place, those sapphire eyes stole my breath and my brains in one look. They swept over my face, moving slowly from my eyes to my lips, and back again. Trystan’s mouth parted like he was going to say something, but he didn’t. He froze like that, watching me beneath him with an unreadable expression on his face. Just when I thought my heart couldn’t take another shock, the door above us banged open.\u003c/p\u003e\n\u003cp\u003eTucker’s voice bellowed down the stairs, “Scott, get up here. Now!”\u003c/p\u003e\n\u003cp\u003eAs soon as we heard the door open, we shot apart. Trystan pushed himself upright, and stood as I rolled to my side and patted my hair, trying to make it look normal and not like we’d been doing something naughty. I glanced over at him. Trystan didn’t meet my eyes. Instead, he shoved his hands in his pockets and walked away. Before he got to the stairs, he looked over his shoulder. “Later, kiss thief.” He treated me to a dimpled grin and I nearly died. \u003c/p\u003e","sourceLink":"https://allnovel.net/backdraft-the-secret-life-of-trystan-scott-2/page-9.html","bookId":2774,"creation":"Oct 5, 2019 5:17:57 PM","modification":"Oct 5, 2019 5:17:57 PM"}
