{"id":82095,"no":14,"title":"Page 14","content":"\u003cp\u003eDid you have trouble getting away?\" Hugh said\u003c/p\u003e\n\u003cp\u003eIt was the next morning, a very different sort of day from yesterday. The sky was overcast and the air\u003c/p\u003e\n\u003cp\u003ewas heavy. Everyone Jez had passed at the Concord BART station looked a little depressed.\u003c/p\u003e\n\u003cp\u003e\"Eh, a little,\" she said, and sat down by Hugh on the platform. They were at the far end of the station,\u003c/p\u003e\n\u003cp\u003ebeyond the covered area with benches, beside a little concrete security house. It was a safe and private\u003c/p\u003e\n\u003cp\u003emeeting place since the station was almost deserted after the morning commute. \"They chained up my\u003c/p\u003e\n\u003cp\u003ebike with this huge chain. Claire drove me to school-she\u0027s been watching me like a werewolf guarding\u003c/p\u003e\n\u003cp\u003edinner. And Aunt Nan called the office to make sure I didn\u0027t cut\" Hugh shifted in concern. There was a\u003c/p\u003e\n\u003cp\u003etiny breath\u003c/p\u003e\n\u003cp\u003eof warm wind, and it stirred his fair hair. \"So what did you do?\"\u003c/p\u003e\n\u003cp\u003eJez grinned. \"I cut.\" She shrugged and added, \"I got a guy from my auto shop class to drive me here. It\u003c/p\u003e\n\u003cp\u003ewasn\u0027t hard.\"\u003c/p\u003e\n\u003cp\u003eHe smiled at her sadly, his gray eyes distant. \"But they\u0027re going to find out. Jez, I\u0027m really sorry for\u003c/p\u003e\n\u003cp\u003ecompletely messing up your life.\"\u003c/p\u003e\n\u003cp\u003eShe shrugged again. \"Yeah, but if I don\u0027t do it, everybody\u0027s life is going to be even more completely\u003c/p\u003e\n\u003cp\u003emessed up. Every human\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" He shivered slightly. Then he drew up his legs, clasping his arms around them. He looked at\u003c/p\u003e\n\u003cp\u003eher with his chin on his knees. \"So what did you find out?\"\u003c/p\u003e\n\u003cp\u003e\"That the girl Morgead thought was the Wild Power isn\u0027t.\" He looks so cute that way, Jez thought\u003c/p\u003e\n\u003cp\u003ehelplessly. So-compact. Morgead would never sit like that.\u003c/p\u003e\n\u003cp\u003eHugh winced. \"Great. You\u0027re sure?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. It was a little kid, eight years old, and she was something special-but not that. She was...\" Jez\u003c/p\u003e\n\u003cp\u003etried to think of a way to describe it. Hugh watched her with eyes that were clear and fathomless, sad\u003c/p\u003e\n\u003cp\u003eand wry and gentle all at once. And suddenly Jez got it. She gasped.\u003c/p\u003e\n\u003cp\u003e\"Goddess-I know! She was like you. That kid was an Old Soul.\"\u003c/p\u003e\n\u003cp\u003eHugh\u0027s eyebrows went up. \"You think?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure of it. She had that same way of looking at you as if she\u0027s seen all of history and she knows\u003c/p\u003e\n\u003cp\u003ethat you\u0027re just a little part. That... trig picture\u0027 look. As if she were beyond stupid human things.\"\u003c/p\u003e\n\u003cp\u003e\"But not a Wild Power,\" Hugh said softly. He looked half discouraged and half relieved. \"So then the\u003c/p\u003e\n\u003cp\u003eMorgead connection is useless.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, no. Because he\u0027s got evidence for the Wild Power on videotape.\" Jez explained about the\u003c/p\u003e\n\u003cp\u003emovie and the fire and the blue flash. \"So somebody around that kid is probably it. I know that area and\u003c/p\u003e\n\u003cp\u003eso does Morgead. We may be able to find out who.\"\u003c/p\u003e\n\u003cp\u003eHugh chewed his lip. Then he looked directly at her. \"It sounds dangerous. Just how is Morgead taking\u003c/p\u003e\n\u003cp\u003etins-you coming back and all?\"\u003c/p\u003e\n\u003cp\u003eJez stared out across the BART tracks. They looked like regular train tracks, except for the big one\u003c/p\u003e\n\u003cp\u003elabeled danger electric third rah.. There was a sound like faraway thunder, and then a train came whizzing\u003c/p\u003e\n\u003cp\u003eup like a sleek futuristic white dragon. It stopped and a few people got on and off in the distance. She\u003c/p\u003e\n\u003cp\u003ewaited until it left again to answer.\u003c/p\u003e\n\u003cp\u003e\"He... wasn\u0027t very happy at first. But then he kind of got used to it. I don\u0027t think he\u0027s going to make any\u003c/p\u003e\n\u003cp\u003etrouble-unless he finds out, you know.\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t sure what else to say. She didn\u0027t want to talk to Hugh about Morgead-and she certainly\u003c/p\u003e\n\u003cp\u003edidn\u0027t want to explain what had happened. Especially not when she was so confused about it all herself.\u003c/p\u003e\n\u003cp\u003e\"You still think he\u0027d hate you if he found out you were half human?\" Hugh\u0027s voice was quiet.\u003c/p\u003e\n\u003cp\u003eJez laughed shortly. \"Believe it. He would.\"\u003c/p\u003e\n\u003cp\u003eThere was a silence, while Hugh looked at her. Suddenly Jez found her mind posing an odd question. If\u003c/p\u003e\n\u003cp\u003eit were Hugh or Morgead, which would she take?\u003c/p\u003e\n\u003cp\u003eOf course, it was a completely ridiculous question. She couldn\u0027t have either of them. Hugh was an Old\u003c/p\u003e\n\u003cp\u003eSoul, and beyond her reach. Not to mention that he only thought of her as a friend. And Morgead might\u003c/p\u003e\n\u003cp\u003ebe her soulmate, but he would murder her if he ever discovered the truth.\u003c/p\u003e\n\u003cp\u003eBut still, if she did have a choice... Hugh or Morgead?\u003c/p\u003e\n\u003cp\u003eA day ago she\u0027d have said Hugh without question. How strange that now it came up the other way.\u003c/p\u003e\n\u003cp\u003eBecause, impossible as it was, deadly as she knew it to be, it was Morgead she was in love with. And\u003c/p\u003e\n\u003cp\u003eshe had only just understood that this moment.\u003c/p\u003e\n\u003cp\u003eWhat a pity that there was no hope in the world for them.\u003c/p\u003e\n\u003cp\u003eJez found herself giving another short laugh- and then she realized that Hugh was still looking at her. She\u003c/p\u003e\n\u003cp\u003ecould feel color rise to her cheeks.\u003c/p\u003e\n\u003cp\u003e\"You were miles away again.\"\u003c/p\u003e\n\u003cp\u003eTm just foggy. Not enough sleep, I guess.\" Plus all that fun yesterday. She was still sore from the stick\u003c/p\u003e\n\u003cp\u003efight and the fall with Iona. But that wasn\u0027t Hugh\u0027s problem.\u003c/p\u003e\n\u003cp\u003eShe took a breath, groping for another subject. \"You know, there was something I wanted to ask\u003c/p\u003e\n\u003cp\u003eyou. Morgead said the Council had dug up another prophecy-about where each of the Wild Powers is\u003c/p\u003e\n\u003cp\u003efrom. Have you heard it?\" When he shook his head, she quoted:\u003c/p\u003e\n\u003cp\u003e\"One from the land of kings long forgotten; One from the hearth which still holds the spark; One from the\u003c/p\u003e\n\u003cp\u003eDay World where two eyes are\u003c/p\u003e\n\u003cp\u003ewatching; One from the twilight to be one with the dark.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting.\" Hugh\u0027s gray eyes had lit up. \" \u0027One from the hearth\u0027... that\u0027s got to be the Harman\u003c/p\u003e\n\u003cp\u003ewitches. Their last name was originally \u0027Hearth-Woman.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Yeah. But the line about the one from the Day World-that one\u0027s a human, right?\"\u003c/p\u003e\n\u003cp\u003e\"It sounds like it.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Morgead thought-that\u0027s why he thought the little girl might be a Wild Power even though\u003c/p\u003e\n\u003cp\u003eshe was human. But what I can\u0027t figure out is what it means by \u0027where two eyes are watching.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Mmm...\" Hugh gazed into the distance, as if he liked the challenge. \"The only thing I can think of that\u003c/p\u003e\n\u003cp\u003ecombines the idea of \u0027Day* and \u0027eyes\u0027 is a poem. It goes something like \u0027The Night has a thousand eyes,\u003c/p\u003e\n\u003cp\u003eand the Day only one.\u0027 The one eye being the sun, you know, and the thousand eyes the stars at night.\"\u003c/p\u003e\n\u003cp\u003e\"Hmpf. What about the moon?\"\u003c/p\u003e\n\u003cp\u003eHugh grinned. \u0027I don\u0027t know. Maybe the author wasn\u0027t good at astronomy.\"\u003c/p\u003e\n\u003cp\u003e\"Well-that doesn\u0027t help much. I thought it might be a clue. But the truth is that we don\u0027t even know if it\u0027s\u003c/p\u003e\n\u003cp\u003ethe human Wild Power we\u0027re after.\"\u003c/p\u003e\n\u003cp\u003eHugh put his chin on his knees again. \"True. But I\u0027ll let Circle Daybreak know about that prophecy. It\u003c/p\u003e\n\u003cp\u003emight help eventually.\" He was silent a moment, then added, \"You know, they dug up something\u003c/p\u003e\n\u003cp\u003einteresting, too. Apparently the Hopi Tribe predicted the end of the world pretty accurately.\"\u003c/p\u003e\n\u003cp\u003e\"The Hopi?\"\u003c/p\u003e\n\u003cp\u003e\"I should say, the ends of the worlds. They knew that it had happened before their time, and that it\u003c/p\u003e\n\u003cp\u003ewould happen again. Their legend says that the first world was destroyed by fire. The second world was\u003c/p\u003e\n\u003cp\u003edestroyed by ice. The third world ended in water- a universal flood. And the fourth world-well, that\u0027s\u003c/p\u003e\n\u003cp\u003eours. It\u0027s supposed to end in blood and darkness- and end soon.\"\u003c/p\u003e\n\u003cp\u003eJez murmured, \"The first world-?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t remember your Night World history?\" He tched at her, with a smile that didn\u0027t reach his eyes.\u003c/p\u003e\n\u003cp\u003e\"The first civilization was the shapeshifters\u0027. Back when humans were scared to go out of their caves, the\u003c/p\u003e\n\u003cp\u003eshapeshifters ruled and the humans thought of them as gods. Animal spirits, totems. It was Shapeshifter\u003c/p\u003e\n\u003cp\u003eWorld. That lasted for about ten thousand years, until a bunch of volcanoes suddenly became active-\"\u003c/p\u003e\n\u003cp\u003e\"Fire.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. The weather changed, people migrated, and the shapeshifters lost control. After that it was really\u003c/p\u003e\n\u003cp\u003eWitch World. The witches did better than\u003c/p\u003e\n\u003cp\u003eeverybody else for ten thousand years, but then there was an Ice Age-\"\u003c/p\u003e\n\u003cp\u003e\"And the Night Wars,\" Jez said, remembering. \"When the vampires fought the witches.\"\u003c/p\u003e\n\u003cp\u003e\"Right. And after all that, the vampires were in control; it was Vampire World. Which lasted about\u003c/p\u003e\n\u003cp\u003eanother ten thousand years, until the flood. And after the flood, human civilization really started. It was\u003c/p\u003e\n\u003cp\u003eHuman World, and it has been for a long time. The Night People have just been hanging on around the\u003c/p\u003e\n\u003cp\u003eedges, hiding. But. . .\" He paused and straightened. \"That started about eight thousand\u003c/p\u003e\n\u003cp\u003eB.C.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. The millennium marks the end of our ten thousand years.\" He gave his gentle, half-mocking smile.\u003c/p\u003e\n\u003cp\u003e\"We humans are about to lose our lease. Something\u0027s going to happen to bring blood and darkness and\u003c/p\u003e\n\u003cp\u003ethen there\u0027ll be a whole new world.\"\u003c/p\u003e\n\u003cp\u003e\"Only if we don\u0027t stop it,\" Jez said. \"And we will- because we have to.\"\u003c/p\u003e\n\u003cp\u003eHugh\u0027s smiled changed, softening. \"I think we\u0027re lucky to have people like you trying.\" Then he lost the\u003c/p\u003e\n\u003cp\u003esmile completely. He looked uncertain. \"Jez- you know, Old Souls aren\u0027t really beyond \u0027stupid human\u003c/p\u003e\n\u003cp\u003ethings.\u0027 We\u0027re as human as anybody. And we ... I mean, and I...\"\u003c/p\u003e\n\u003cp\u003eJez\u0027s heart was beating uncomfortably fast. The way he was looking at her-she\u0027d never seen Hugh look\u003c/p\u003e\n\u003cp\u003elike that at anything or anyone.\u003c/p\u003e\n\u003cp\u003eAnother rumble in the distance, and then a train came rushing in.\u003c/p\u003e\n\u003cp\u003eHugh blinked, glanced up at the digital clock display above the platform, then checked his watch. He\u003c/p\u003e\n\u003cp\u003ecursed.\u003c/p\u003e\n\u003cp\u003eTm supposed to be somewhere. I\u0027m late.\"\u003c/p\u003e\n\u003cp\u003eJez\u0027s heart gave a strange thump. But not of disappointment. Weirdly, it was more like relief.\u003c/p\u003e\n\u003cp\u003e\"Me, too,\" she said. \"I\u0027m supposed to meet Morgead before everybody else gets out of school. I ought\u003c/p\u003e\n\u003cp\u003eto take the next train to San Francisco.\"\u003c/p\u003e\n\u003cp\u003eHe still hesitated. \"Jez-\"\u003c/p\u003e\n\u003cp\u003e\"Go on,\" she said, standing up. \"Ill call you if I turn up anything. Wish me luck.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful,\" he said instead, and then he was hurrying away.\u003c/p\u003e\n\u003cp\u003eJez watched him go. She couldn\u0027t help wondering what he had been about to say.\u003c/p\u003e\n\u003cp\u003eThen she turned to walk back to the central part of the station. She was partway around the concrete\u003c/p\u003e\n\u003cp\u003eguardhouse when she heard a noise on the other side.\u003c/p\u003e\n\u003cp\u003eA stealthy, sneaking noise. Not the kind a security guard would make.\u003c/p\u003e\n\u003cp\u003eJez didn\u0027t hesitate. Smoothly, completely soundless herself, she changed course, turning back and going\u003c/p\u003e\n\u003cp\u003earound the structure the other way to get behind the sneaker. The instant she had a clear view of the\u003c/p\u003e\n\u003cp\u003eintruder\u0027s back, she jumped.\u003c/p\u003e\n\u003cp\u003eShe landed on top of her quarry, with a control hold on the person\u0027s wrist. But she already knew that\u003c/p\u003e\n\u003cp\u003ethis wasn\u0027t going to be a fight to the death.\u003c/p\u003e\n\u003cp\u003e\"Jez-ow-it\u0027s me!\" Claire spluttered.\u003c/p\u003e\n\u003cp\u003e\"I know it\u0027s you, Claire.\"\u003c/p\u003e\n\u003cp\u003e\"Let go of my arm!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so, Claire. You having an interesting morning? Hear any good jokes?\"\u003c/p\u003e\n\u003cp\u003e\"Jez!\" Claire struggled, hurting herself, then got mad and hurt herself more trying to hit Jez. Jez allowed\u003c/p\u003e\n\u003cp\u003eher to sit up, still keeping hold of her.\u003c/p\u003e\n\u003cp\u003eClaire\u0027s face was flushed and wrathful, her dark hair sticking in strands to her cheeks. Her eyes were\u003c/p\u003e\n\u003cp\u003eshooting sparks.\u003c/p\u003e\n\u003cp\u003e\"Okay, so I\u0027m sorry for eavesdropping. I followed you when Greg Ludlum drove you here. I wanted to\u003c/p\u003e\n\u003cp\u003eknow what you were doing. I didn\u0027t know that you were completely freaking insane!\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s too bad you didn\u0027t figure it out earlier. Because unfortunately I have to kill you now to keep\u003c/p\u003e\n\u003cp\u003eyou from talking.\"\u003c/p\u003e\n\u003cp\u003eClaire\u0027s eyes widened and she choked. Jez suddenly realized that underneath all the sparks and the\u003c/p\u003e\n\u003cp\u003eyelling her cousin was terrified.\u003c/p\u003e\n\u003cp\u003eShe let go of Claire\u0027s arm and Claire slumped away from her, rubbing it.\u003c/p\u003e\n\u003cp\u003e\"You-you are insane, aren\u0027t you?\" Claire looked at her sideways, through clinging strands of hair. \"I\u003c/p\u003e\n\u003cp\u003emean, all that stuff about the world ending-it\u0027s some kind of bizarre game you\u0027re playing with your weird\u003c/p\u003e\n\u003cp\u003efriends, isn\u0027t it? Some kind of Dungeons and Dragons stuff...\"\u003c/p\u003e\n\u003cp\u003e\"What do you think, Claire?\" Jez stood up and offered Claire a hand, worried that someone might notice\u003c/p\u003e\n\u003cp\u003ethem. She kept that hand on Claire as she herded Claire back behind the guard house.\u003c/p\u003e\n\u003cp\u003eThe truth was that this situation wasn\u0027t funny.\u003c/p\u003e\n\u003cp\u003eClaire really was in trouble-because Jez was in trouble.\u003c/p\u003e\n\u003cp\u003eHer entire cover was blown. Everything she\u0027d worked for in the past year-Claire could destroy it all.\u003c/p\u003e\n\u003cp\u003eClaire knew way too much, and Claire hated her enough to use it.\u003c/p\u003e\n\u003cp\u003e\"I think ... I don\u0027t know what to think.\" Claire swallowed. \"Who was that guy?\"\u003c/p\u003e\n\u003cp\u003e\"One of my weird friends. Right?\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t seem so weird. When he said things- I don\u0027t know. They sounded...\" Claire\u0027s voice trailed\u003c/p\u003e\n\u003cp\u003eoff. Finally it came back, almost inaudibly. \"Real.\"\u003c/p\u003e\n\u003cp\u003e\"Great.\" I am going to have to kill her. What else can I do?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a game, is it?\" Claire said, looking at her. All the anger was gone from the dark eyes now. They\u003c/p\u003e\n\u003cp\u003ewere simply bewildered and frightened.\u003c/p\u003e\n\u003cp\u003eThen Claire shook her head. \"But, I mean, it\u0027s impossible. Vampires and shapeshifters and witches-it\u0027s\u003c/p\u003e\n\u003cp\u003eall just...\" Her voice trailed off again.\u003c/p\u003e\n\u003cp\u003eJez was simply looking at her, with eyes that might be less silvery than a year ago, but that she knew\u003c/p\u003e\n\u003cp\u003ewere still pretty strange. And after a few moments Claire\u0027s gaze lost its focus and her whole body seemed\u003c/p\u003e\n\u003cp\u003eto fall in on itself, as if it had lost something vital. Innocence maybe, Jez thought grimly.\u003c/p\u003e\n\u003cp\u003e\"Oh, God, it is true,\" Claire whispered. \u0027I mean, it\u0027s really true. That\u0027s why you\u0027re gone all the time, isn\u0027t\u003c/p\u003e\n\u003cp\u003eit? You\u0027re off-doing something.\"\u003c/p\u003e\n\u003cp\u003eJez said, \"Yeah.\"\u003c/p\u003e\n\u003cp\u003eClaire sagged against the guardhouse. \"Oh, God. I ... God. I feel so strange. It\u0027s like-nothing is what I\u003c/p\u003e\n\u003cp\u003ethought.\"\u003c/p\u003e\n\u003cp\u003eYeah, I know the feeling, Jez thought. When the whole world turns around and you have to adjust in two\u003c/p\u003e\n\u003cp\u003eseconds flat. It happened to me, too, a year ago.\u003c/p\u003e\n\u003cp\u003eBut none of that was going to help Claire. All she could say was \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003eClaire didn\u0027t seem to hear her. She was speaking in a voice that was just a breath. \"That\u0027s why... that\u0027s\u003c/p\u003e\n\u003cp\u003ewhy all that weird stuff with your father. Nobody knowing anything about his family and all. I knew from\u003c/p\u003e\n\u003cp\u003ethe beginning that there was something about you; I just couldn\u0027t tell what it was.\"\u003c/p\u003e\n\u003cp\u003eOh, great, Jez thought. Here it comes. She tried to keep her face impassive as Claire faced her squarely,\u003c/p\u003e\n\u003cp\u003eraising her eyes with a look somewhere between wonder and dread.\u003c/p\u003e\n\u003cp\u003e\"That guy-he said you were only half human. Which means you\u0027re half... something else?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m half human and half vampire,\" Jez said quietly. The interesting thing was that it was so easy to get\u003c/p\u003e\n\u003cp\u003eout. She\u0027d only ever spoken the words aloud to one person before: Hugh.\u003c/p\u003e\n\u003cp\u003eNow she looked to see if Claire would actually faint or just fall down.\u003c/p\u003e\n\u003cp\u003eClaire did neither. She just shut her eyes. \"You know the really insane thing? I believe that.\" She opened\u003c/p\u003e\n\u003cp\u003eher eyes again. \"But-I didn\u0027t know you could be. Half and half.\"\u003c/p\u003e\n\u003cp\u003e\"Neither did anybody else, till I was born. I\u0027m the\u003c/p\u003e\n\u003cp\u003eonly one.\" Jez examined her cousin, realized that she really wasn\u0027t going to faint. When she spoke again,\u003c/p\u003e\n\u003cp\u003eher voice came out more challenging than she meant it to. \"So now that you know, Claire, what are you\u003c/p\u003e\n\u003cp\u003egoing to do about it?\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean, what am I going to do?\" Claire glanced around, then her voice dropped as her eyes\u003c/p\u003e\n\u003cp\u003eglinted with interest. \"Look-do you, like, have to drink blood and everything?\"\u003c/p\u003e\n\u003cp\u003e\"Not anymore,\" Jez said shortly. What was this? Who would have thought that studious, straitlaced\u003c/p\u003e\n\u003cp\u003eClaire would have such an interest in vampires?\u003c/p\u003e\n\u003cp\u003e\"But you mean you used to?\"\u003c/p\u003e\n\u003cp\u003e\"Before I came to live with you guys. I thought I was a full vampire then. But I found out that I could live\u003c/p\u003e\n\u003cp\u003ewithout it, as long as I didn\u0027t use my powers.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got powers? Really? What kind?\"\u003c/p\u003e\n\u003cp\u003e\"No kind. Look, enough with the questions. I told you, I\u0027m not a vampire anymore.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re not evil.\" Claire said it flatly.\u003c/p\u003e\n\u003cp\u003eJez looked at her, startled. \"What makes you say that?\"\u003c/p\u003e\n\u003cp\u003e\"I heard what you were talking about, saving the world and all. I didn\u0027t understand it, but it sounded like\u003c/p\u003e\n\u003cp\u003eyou were on the right side. And-\" Claire hesitated, then shrugged. \"And I know you, okay? I mean,\u003c/p\u003e\n\u003cp\u003eyou\u0027re arrogant and stubborn and you never explain anything, but you\u0027re not evil. You just aren\u0027t-inside. I\u003c/p\u003e\n\u003cp\u003ecan tell.\"\u003c/p\u003e\n\u003cp\u003eJez laughed. A real laugh. She couldn\u0027t help it.\u003c/p\u003e\n\u003cp\u003eOf all people, Claire. She\u0027d misjudged this girl\u003c/p\u003e\n\u003cp\u003ewho was her own age but had nothing else in common with her. Her cousin had unexpected depths.\u003c/p\u003e\n\u003cp\u003e\"Well, thanks,\" she said. \"I try not to be too evil- these days.\" Then she sobered. \"Look, Claire, if you\u003c/p\u003e\n\u003cp\u003ereally think that, and if you really believe that the stuff you heard was true-\"\u003c/p\u003e\n\u003cp\u003e\"About the end of the world? I don\u0027t believe it. I mean, I heard it, and I believe you believe it-and when I\u003c/p\u003e\n\u003cp\u003efirst heard it I kind of believed it, but-\"\u003c/p\u003e\n\u003cp\u003e\"Just-skip the rest and plain believe it, Claire. It happens to be the truth. And I\u0027m trying to do something\u003c/p\u003e\n\u003cp\u003eabout it.\"\u003c/p\u003e\n\u003cp\u003e\"Something about a Wild Power, right?\" Claire wasn\u0027t sagging anymore. She looked almost excited. \"But\u003c/p\u003e\n\u003cp\u003ewhat\u0027s a-\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t need to know. The point is that if you want to, you can help me.\"\u003c/p\u003e\n\u003cp\u003e\"I can? Really?\"\u003c/p\u003e\n\u003cp\u003e\"You can help me by going back to school and forgetting that this ever happened. You can help me by\u003c/p\u003e\n\u003cp\u003ekeeping my secret and not ever saying a word about this to anybody. And, incidentally, you\u0027ll be keeping\u003c/p\u003e\n\u003cp\u003eyour family safe at the same time.\"\u003c/p\u003e\n\u003cp\u003eClaire looked away, worked her jaw. \"This stuff you\u0027re doing is pretty dangerous.\" It wasn\u0027t a question.\u003c/p\u003e\n\u003cp\u003e\"Very dangerous.\" Jez stepped back. \"And I\u0027m late for it right now. So do we have a deal? Will you help\u003c/p\u003e\n\u003cp\u003eme or not? Can I trust you?\"\u003c/p\u003e\n\u003cp\u003e\"Or otherwise you\u0027re gonna kill me, right?\" Claire looked at her sarcastically.\u003c/p\u003e\n\u003cp\u003eJez rolled her eyes. \"Don\u0027t tempt me. Seriously, are you going to help?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eJez froze, looking down at the shorter girl. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Jez-don\u0027t get mad, but I don\u0027t think I can. Not that way.\" Claire was looking back up steadily, her small\u003c/p\u003e\n\u003cp\u003eface serious and surprisingly determined. \u0027I mean how can I possibly just walk away, after hearing all\u003c/p\u003e\n\u003cp\u003ethat? If everything you said is true, how can I forget?\"\u003c/p\u003e\n\u003cp\u003e\"You can because you have to. We all do what we have to do.\" Jez looked around the station. Another\u003c/p\u003e\n\u003cp\u003etrain should be coming any minute. She simply didn\u0027t have time to spend convincing a human to stay out\u003c/p\u003e\n\u003cp\u003eof business that would kill her. To properly explain it to Claire would take days.\u003c/p\u003e\n\u003cp\u003eAll she could do was ask for something she never would have imagined Claire could give her.\u003c/p\u003e\n\u003cp\u003e\"Claire... there\u0027s no way I can convince you or make you do what I want. But I\u0027m asking you-\" She let\u003c/p\u003e\n\u003cp\u003eout her breath and went on: \"I\u0027m asking you to trust me. I\u0027m asking you to walk away and at least try to\u003c/p\u003e\n\u003cp\u003eforget this. And to believe that I\u0027m trying the best I can to do the right thing.\"\u003c/p\u003e\n\u003cp\u003eClaire kept looking at her steadily for a moment. Then, all at once, the dark eyes filled. They turned\u003c/p\u003e\n\u003cp\u003eaway, and Claire\u0027s throat moved once as she swallowed. Then, slowly, she nodded.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she whispered. \"I mean-it\u0027s okay for now. I mean, I guess I can talk to you later about it.\"\u003c/p\u003e\n\u003cp\u003eJez let out her breath. \"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eClaire stood there for another second, then straightened her shoulders and turned away. But just as\u003c/p\u003e\n\u003cp\u003esuddenly she turned back, looking tense and almost explosive. \"There\u0027s something I have to say to you.\"\u003c/p\u003e\n\u003cp\u003eJez glanced down the tracks. No train. \"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s-it\u0027s... that I\u0027m sorry. I\u0027m sorry I bugged you and tried to get Mom mad at you and everything. I\u003c/p\u003e\n\u003cp\u003ewas just-I was jealous because they let you get away with anything, and...\" She shook her head fiercely\u003c/p\u003e\n\u003cp\u003eand then went on, shrugging grimly as if she hated to admit it. \"And, yeah, because you\u0027re so gorgeous\u003c/p\u003e\n\u003cp\u003eand confident and everything. It made me feel bad and I wanted to hurt you. So. Anyway. There. I\u0027m\u003c/p\u003e\n\u003cp\u003esorry.\"\u003c/p\u003e\n\u003cp\u003eShe started to walk away, wobbling a little.\u003c/p\u003e\n\u003cp\u003e\"Claire.\"\u003c/p\u003e\n\u003cp\u003eClaire paused, then turned around.\u003c/p\u003e\n\u003cp\u003eJez spoke a little hesitantly around the obstruction in her throat. \"It\u0027s okay. And thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Claire grinned and gave a little shrug. \"See ya later.\" She turned around and started walking\u003c/p\u003e\n\u003cp\u003eSee ya, Jez thought. She felt suddenly tired and strangely emotional. There was too much inside hen\u003c/p\u003e\n\u003cp\u003esadness and relief and worry and a new feeling for Claire. She crossed her arms and looked around the\u003c/p\u003e\n\u003cp\u003estation, trying to relax, taking deep, even breaths.\u003c/p\u003e\n\u003cp\u003eAnd saw two werewolves coming straight for Claire. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-huntress-night-world-7/page-14.html","bookId":1863,"creation":"Oct 5, 2019 4:40:36 PM","modification":"Oct 5, 2019 4:40:36 PM"}
