{"id":82098,"no":17,"title":"Page 17","content":"\u003cp\u003eMorgead\u0027s entire body jerked once and then went absolutely still. As if he\u0027d been turned to stone. The\u003c/p\u003e\n\u003cp\u003eonly thing alive about him was his eyes, which were staring at Jez with shock and burning disbelief.\u003c/p\u003e\n\u003cp\u003eWell, Jez told herself, with a grim humor that was almost like sobbing grief, I startled him, that\u0027s for sure.\u003c/p\u003e\n\u003cp\u003eI finally managed to stun Morgead speechless.\u003c/p\u003e\n\u003cp\u003eIt was only then that she realized some part of her had hoped that he already knew this, too. That he\u003c/p\u003e\n\u003cp\u003ewould be able to brush it off with exasperation, the way he had the fact that she was a Daybreaker.\u003c/p\u003e\n\u003cp\u003eBut that hope was shattered now. It had been a stupid hope anyway. Being a Daybreaker was\u003c/p\u003e\n\u003cp\u003esomething that could change, a matter of confused attitude.\u003c/p\u003e\n\u003cp\u003eBeing vermin was permanent.\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s-that\u0027s not-\" Morgead seemed to be having trouble getting the words out. His eyes were large\u003c/p\u003e\n\u003cp\u003ewith horror and denial. \"That\u0027s not possible. You\u0027re a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Only half,\" Jez said. She felt as if she were killing something-and she was. She was murdering any hope\u003c/p\u003e\n\u003cp\u003efor what was between them.\u003c/p\u003e\n\u003cp\u003eMight as well stomp it good, she thought bitterly. She couldn\u0027t understand the wetness that was\u003c/p\u003e\n\u003cp\u003ethreatening to spill out of her eyes.\u003c/p\u003e\n\u003cp\u003e\"The other half is human,\" she said shortly, almost viciously. \"My mother was human. Claire is my cousin,\u003c/p\u003e\n\u003cp\u003eand she\u0027s human. I\u0027ve been living with my uncle Jim, my mother s brother, and his family. They\u0027re all\u003c/p\u003e\n\u003cp\u003ehuman.\"\u003c/p\u003e\n\u003cp\u003eMorgead shut his eyes. A moment of astonishing weakness for him, Jez thought coldly.\u003c/p\u003e\n\u003cp\u003eHis voice was still a whisper. \"Vampires and humans can\u0027t have kids. You can\u0027t be half and half.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah, I can. My father broke the laws of the Night World. He fell in love with a human, and they\u003c/p\u003e\n\u003cp\u003egot married, and here I am. And then, when I was three or so, some other vampires came and tried to\u003c/p\u003e\n\u003cp\u003ekill us all.\" In her mind Jez was seeing it again, the woman with red hair who looked like a medieval\u003c/p\u003e\n\u003cp\u003eprincess, begging for her child\u0027s life. The tall man trying to protect her. \"They knew I was half human.\u003c/p\u003e\n\u003cp\u003eThey kept yelling \u0027Kill the freak.\u0027 So that\u0027s what I am, you see.\" She turned eyes she knew were\u003c/p\u003e\n\u003cp\u003efeverishly bright on him. \"A freak.\"\u003c/p\u003e\n\u003cp\u003eHe was shaking his head, gulping as if he were\u003c/p\u003e\n\u003cp\u003eabout to be sick. It made Jez hate him, and feel sorry for him at the same time. She scarcely noticed that\u003c/p\u003e\n\u003cp\u003ehot tears were spilling down her cheeks.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m vermin, Morgead. One of them. Prey. That\u0027s what I realized a year ago, when I left the gang. Up\u003c/p\u003e\n\u003cp\u003euntil then I had no idea, but that last night we hunted, I remembered the truth. And I knew that I had to\u003c/p\u003e\n\u003cp\u003ego away and try to make up for all the things I\u0027d done to humans.\"\u003c/p\u003e\n\u003cp\u003eHe put a hand up to press against his eyes.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t just become a Daybreaker. I became a vampire hunter. I track down vampires who like to kill,\u003c/p\u003e\n\u003cp\u003ewho enjoy making humans suffer, and I stake them. You know why? Because they deserve to die.\"\u003c/p\u003e\n\u003cp\u003eHe was looking at her again, but as if he could hardly stand to. \"Jez-\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s weird. I don\u0027t know about our connection\"- she smiled bitterly at him, to let him know she knew all\u003c/p\u003e\n\u003cp\u003ethat was over now-\"but I felt bad lying to you. I\u0027m almost glad to finally tell you the truth. I kind of\u003c/p\u003e\n\u003cp\u003ewanted to tell you a year ago when it happened, but I knew you\u0027d kill me, and that made me a little\u003c/p\u003e\n\u003cp\u003ehesitant.\"\u003c/p\u003e\n\u003cp\u003eShe was laughing now. She realized she was more than a little hysterical. But it didn\u0027t seem to matter.\u003c/p\u003e\n\u003cp\u003eNothing mattered while Morgead was looking at her with that sick disbelief in his eyes.\u003c/p\u003e\n\u003cp\u003e\"So, anyway...\" She stretched her muscles, still smiling at him, but ready to defend herself. \"Are you\u003c/p\u003e\n\u003cp\u003egoing to try and kill me now? Or is the engagement just off?\"\u003c/p\u003e\n\u003cp\u003eHe simply looked at her. It was as if his entire spirit had gone out of him. He didn\u0027t speak, and all at\u003c/p\u003e\n\u003cp\u003eonce Jez couldn\u0027t think of anything to say, either. The silence stretched and stretched, like a yawning\u003c/p\u003e\n\u003cp\u003echasm between them.\u003c/p\u003e\n\u003cp\u003eThey were so far away from each other.\u003c/p\u003e\n\u003cp\u003eYou knew all along it would come to this, Jez\u0027s mind told her mockingly. How can you presume to be\u003c/p\u003e\n\u003cp\u003eupset? He\u0027s actually taking it better than you expected. He hasn\u0027t tried to tear your throat out yet.\u003c/p\u003e\n\u003cp\u003eAt last Morgead said, in a flat and empty voice, \"That\u0027s why you wouldn\u0027t drink my blood.\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t had a blood meal for a year,\" Jez said, feeling equally empty. \"I don\u0027t need to, if I don\u0027t use my\u003c/p\u003e\n\u003cp\u003ePowers.\"\u003c/p\u003e\n\u003cp\u003eHe stared past her at the metal wall. \"Well, maybe you\u0027d better drink some of your human friends\u0027,\" he\u003c/p\u003e\n\u003cp\u003esaid tiredly. \"Because whoever has\u003c/p\u003e\n\u003cp\u003eus-\u003c/p\u003e\n\u003cp\u003eHe broke off, suddenly alert. Jez knew what it was. The van was slowing down, and the tires were\u003c/p\u003e\n\u003cp\u003ecrunching on gravel.\u003c/p\u003e\n\u003cp\u003eThey were pulling into a driveway.\u003c/p\u003e\n\u003cp\u003eA long driveway, and a steep one. We\u0027re somewhere out in the country, Jez thought.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t have time for any more banter with Morgead. Although she felt drained and numb, she was\u003c/p\u003e\n\u003cp\u003efocused on outside issues now.\u003c/p\u003e\n\u003cp\u003e\"Look,\" she said tensely as the van braked. \"I know you hate me now, but whoever has us hates us\u003c/p\u003e\n\u003cp\u003eboth. I\u0027m not asking you to help me. I just want\u003c/p\u003e\n\u003cp\u003eto get my cousin away-and I\u0027m asking you not to stop me from doing that. Later, you can fight me or\u003c/p\u003e\n\u003cp\u003ewhatever. We can take care of that between the two of us. Just don\u0027t stop me from saving Claire.\"\u003c/p\u003e\n\u003cp\u003eHe just looked at her with dark and hollow eyes. He didn\u0027t agree or disagree. He didn\u0027t move when she\u003c/p\u003e\n\u003cp\u003epositioned herself to erupt out of the van as soon as the back door was opened.\u003c/p\u003e\n\u003cp\u003eBut, as it turned out, she could have saved her breath. Because when the door did open, letting in\u003c/p\u003e\n\u003cp\u003esunlight that blinded Jez, it was to reveal five vicious-looking thugs, completely blocking the entrance.\u003c/p\u003e\n\u003cp\u003eThree of them had spears with deadly points leveled right at Jez. The other two had guns.\u003c/p\u003e\n\u003cp\u003e\"If anybody tries to fight,\" a voice from around the side of the van said, \"shoot the unconscious ones in\u003c/p\u003e\n\u003cp\u003ethe kneecaps.\"\u003c/p\u003e\n\u003cp\u003eJez sagged back. She didn\u0027t try to fight as they forced her out of the van.\u003c/p\u003e\n\u003cp\u003eNeither, strangely, did Morgead. There were more thugs standing around behind the van, enough to\u003c/p\u003e\n\u003cp\u003esurround both Jez and Morgead with a forest of spears as they were led to the house.\u003c/p\u003e\n\u003cp\u003eIt was a nice house, a small sturdy Queen Anne painted barn red. There were trees all around and no\u003c/p\u003e\n\u003cp\u003eother buildings in sight.\u003c/p\u003e\n\u003cp\u003eWe\u0027re out in the boondocks, Jez thought. Maybe Point Reyes Park. Somewhere remote, anyway,\u003c/p\u003e\n\u003cp\u003ewhere nobody can hear us scream.\u003c/p\u003e\n\u003cp\u003eThey were shepherded into the living room of the house, and Hugh and Claire were dumped\u003c/p\u003e\n\u003cp\u003eunceremoniously on the floor.\u003c/p\u003e\n\u003cp\u003eAnd then they were all tied up.\u003c/p\u003e\n\u003cp\u003eJez kept watching for an opportunity to attack. But one never came. All the time she and Morgead were\u003c/p\u003e\n\u003cp\u003ebeing tied, two of the thugs pointed guns at Claire and Hugh. There was no way Jez could disarm them\u003c/p\u003e\n\u003cp\u003eboth before they got off a shot.\u003c/p\u003e\n\u003cp\u003eWorse, she was being rendered helpless by an expert. The cords were made of bast, the inner bark of\u003c/p\u003e\n\u003cp\u003etrees. Equally effective against vampires and humans. When the guy tying her up was through, she had no\u003c/p\u003e\n\u003cp\u003euse of her arms or legs.\u003c/p\u003e\n\u003cp\u003eHugh woke up, gasping with pain, when they tied his injured arm. Claire woke up when the werewolf\u003c/p\u003e\n\u003cp\u003ethug who\u0027d finished winding cords around her slapped her.\u003c/p\u003e\n\u003cp\u003eJez looked at that particular \u0027wolf carefully. She was too angry to glare at him. But she wanted to\u003c/p\u003e\n\u003cp\u003eremember his face.\u003c/p\u003e\n\u003cp\u003eThen she looked back at Claire, who was staring around her in bewilderment.\u003c/p\u003e\n\u003cp\u003e\u0027I-where are we? What\u0027s going on, Jez?\"\u003c/p\u003e\n\u003cp\u003eHugh was also looking around, but with much less confusion. His gray eyes were simply sad and full of\u003c/p\u003e\n\u003cp\u003e\u0027It\u0027s all right, Claire,\" Jez said. \"Just keep quiet, okay? We\u0027re in a little trouble, but don\u0027t tell them\u003c/p\u003e\n\u003cp\u003eanything.\" She stared at her cousin, trying to will her to understand.\u003c/p\u003e\n\u003cp\u003e\"A little trouble? I don\u0027t think so,\" came a voice from the living room doorway.\u003c/p\u003e\n\u003cp\u003eIt was the same voice that had given the order\u003c/p\u003e\n\u003cp\u003eabout shooting kneecaps. A light, cold voice, like an Arctic wind.\u003c/p\u003e\n\u003cp\u003eThe speaker was a girl.\u003c/p\u003e\n\u003cp\u003eA very pretty girl, Jez thought irrelevantly. She had black hair that fell straight down her back like silk,\u003c/p\u003e\n\u003cp\u003eand eyes that gleamed like topaz. Porcelain skin. A cruel smile. Lots of Power that surrounded her like a\u003c/p\u003e\n\u003cp\u003edark aura.\u003c/p\u003e\n\u003cp\u003eA vampire.\u003c/p\u003e\n\u003cp\u003eShe looked perhaps a year older than Jez, but that didn\u0027t mean anything. She could be any age.\u003c/p\u003e\n\u003cp\u003eAnd those eyes, Jez thought. They\u0027re vaguely familiar. Like something I\u0027ve seen in a picture....\u003c/p\u003e\n\u003cp\u003e\"I should probably introduce myself,\" the girl said, looking at her with cold mockery. \"I\u0027m Lily Redfern.\"\u003c/p\u003e\n\u003cp\u003eJez felt her stomach plummet.\u003c/p\u003e\n\u003cp\u003eHunter Redfern\u0027s daughter.\u003c/p\u003e\n\u003cp\u003eWell, that explained a lot.\u003c/p\u003e\n\u003cp\u003eShe was working for her father, of course. And she was a powerful enemy herself, over four hundred\u003c/p\u003e\n\u003cp\u003eyears old. There were rumors that last year she\u0027d been working the human slave trade, and making a lot\u003c/p\u003e\n\u003cp\u003eof money at it.\u003c/p\u003e\n\u003cp\u003eI should laugh, Jez thought. There I was telling Morgead that Hunter wanted to steal a march on the\u003c/p\u003e\n\u003cp\u003eCouncil-and here he really did. Just not through me, of course. He\u0027s sent his only surviving child out to\u003c/p\u003e\n\u003cp\u003etake care of us, to get Morgead to turn over the Wild Power.\u003c/p\u003e\n\u003cp\u003eAnd that\u0027s why so many thugs-he can afford to buy as many as he needs. And the smooth\u003c/p\u003e\n\u003cp\u003eoperation-Lily\u0027s a born strategist. Not to mention absolutely merciless and cold as ice.\u003c/p\u003e\n\u003cp\u003eShe was right. We\u0027re not in a little trouble. We\u0027re in a whole lot.\u003c/p\u003e\n\u003cp\u003eSomebody, Jez thought with a strange, quiet certainty, is going to die here.\u003c/p\u003e\n\u003cp\u003eLily was still talking. \"And now let me introduce my associates, who\u0027ve done so much to make this all\u003c/p\u003e\n\u003cp\u003epossible.\" She gestured at someone hidden in the hall to come forward. \"This is Azarius. I think you\u0027ve\u003c/p\u003e\n\u003cp\u003emet.\"\u003c/p\u003e\n\u003cp\u003eIt was the vampire Jez had fought on the platform. He was tall, with dark skin and a look of authority.\u003c/p\u003e\n\u003cp\u003e\"And this,\" Lily said, smiling, \"is someone you\u0027ve also met.\" She gestured again, and a second figure\u003c/p\u003e\n\u003cp\u003eappeared in the doorway. It was Pierce Holt.\u003c/p\u003e\n\u003cp\u003eHe was smiling faintly, his aristocratic face drawn in lines of genteel triumph. He waved one slender hand\u003c/p\u003e\n\u003cp\u003eat them, his eyes as cold as Lily\u0027s.\u003c/p\u003e\n\u003cp\u003eMorgead gave an inarticulate roar and tried to lunge at him.\u003c/p\u003e\n\u003cp\u003eHe only succeeded in falling on the floor, a struggling body in a cocoon of bast. Lily and Azarius both\u003c/p\u003e\n\u003cp\u003elaughed. Pierce just looked scornful.\u003c/p\u003e\n\u003cp\u003e\"You really didn\u0027t guess?\" he said. \"You\u0027re so stupid, Morgead. Coming out this morning to meet me, so\u003c/p\u003e\n\u003cp\u003etrusting, so naive-I thought you were smarter. I\u0027m disappointed.\"\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027re dead,\" Morgead raged from the floor. He was staring at Pierce, black hair falling over his\u003c/p\u003e\n\u003cp\u003eforehead and into green eyes that were blazing with rage. \"You are dead when this is over! You\u003c/p\u003e\n\u003cp\u003ebetrayed the gang. You\u0027re complete scum. You\u0027re-\"\u003c/p\u003e\n\u003cp\u003e\"Shut him up,\" Lily said, and one of the thugs kicked Morgead in the head.\u003c/p\u003e\n\u003cp\u003eHe must really be out of power, Jez thought, wincing. Or he\u0027d have blasted Pierce then.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m smart,\" Pierce was saying. \"And I\u0027m going to survive. I knew something was fishy when she\"- he\u003c/p\u003e\n\u003cp\u003enodded toward Jez without looking at her- \"said she had a deal with Hunter Redfern. It didn\u0027t sound\u003c/p\u003e\n\u003cp\u003eright-and then the way she was so worried about that vermin kid. So I made a few calls, and I found out\u003c/p\u003e\n\u003cp\u003ethe truth.\"\u003c/p\u003e\n\u003cp\u003e\"You realize that your friend there is working with Circle Daybreak,\" Lily interrupted. She was also\u003c/p\u003e\n\u003cp\u003elooking at Morgead and ignoring Jez. \"She lied to you and tricked you. She was trying to get the Wild\u003c/p\u003e\n\u003cp\u003ePower for them.\"\u003c/p\u003e\n\u003cp\u003eMorgead snarled something inarticulate.\u003c/p\u003e\n\u003cp\u003e\"And she\u0027s not just a Daybreaker,\" Pierce said. Finally he looked at Jez, and it was with venomous spite.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a mutant abomination. She\u0027s half vermin. She should have been drowned at birth.\"\u003c/p\u003e\n\u003cp\u003e\u0027You should have been drowned at birth,\" Morgead said through locked teeth.\u003c/p\u003e\n\u003cp\u003eLily had been watching in amusement, but now she waved one hand. \"Okay, enough fun and games.\u003c/p\u003e\n\u003cp\u003eDown to business.\" Two of the thugs sat Morgead back up, and Lily walked to the middle of the room.\u003c/p\u003e\n\u003cp\u003eShe looked at each of them in turn, Jez last. \"I\u0027ve only got one question for you,\" she\u003c/p\u003e\n\u003cp\u003esaid in her cool, quiet voice. \"Which human is the Wild Power?\"\u003c/p\u003e\n\u003cp\u003eJez stared at her.\u003c/p\u003e\n\u003cp\u003eShe doesn\u0027t know. She knows almost everything else, but not that. And if she can\u0027t find out...\u003c/p\u003e\n\u003cp\u003eJez gave Hugh and Claire one long, intense look, telling them to keep silent. Then she looked back at\u003c/p\u003e\n\u003cp\u003eLily.\u003c/p\u003e\n\u003cp\u003e\"I have no idea what you\u0027re talking about.\"\u003c/p\u003e\n\u003cp\u003eLily hit her.\u003c/p\u003e\n\u003cp\u003eIt was a pretty good blow, but nothing to compare with what Jez got when she was in a fight. Jez\u003c/p\u003e\n\u003cp\u003elaughed, a natural laugh of surprise and scorn.\u003c/p\u003e\n\u003cp\u003eLily\u0027s hawklike golden eyes went icy.\u003c/p\u003e\n\u003cp\u003e\"You think this is funny?\" she said, still quietly. \"My father sent me to get the Wild Power, and that\u0027s just\u003c/p\u003e\n\u003cp\u003ewhat I\u0027m going to do. Even if it means tearing you and your vampire boyfriend to pieces, mutant.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, suppose I don\u0027t know? Did you ever think of that? Then I can\u0027t tell, no matter what you and\u003c/p\u003e\n\u003cp\u003eyour little...\" Jez glanced at Pierce and Azarius. \"Your little hobgoblins do.\"\u003c/p\u003e\n\u003cp\u003eLily\u0027s porcelain skin was flushing with fury. It brought out faint scars on one side of her face that Jez\u003c/p\u003e\n\u003cp\u003ehadn\u0027t noticed before, like mostly-healed burn marks. \"Look, you little freak-\" Then she turned to the\u003c/p\u003e\n\u003cp\u003ethugs. \"Teach her a lesson.\"\u003c/p\u003e\n\u003cp\u003eThings were exciting for a while. Jez could hear Claire and Hugh yelling and Morgead snarling while the\u003c/p\u003e\n\u003cp\u003ehobgoblins beat her up. She hardly felt\u003c/p\u003e\n\u003cp\u003ethe blows herself. She was in a place where they didn\u0027t matter.\u003c/p\u003e\n\u003cp\u003eWhen they finally got tired and stopped, Lily walked up to her again.\u003c/p\u003e\n\u003cp\u003e\"Now,\" she said sweetly, \"has your memory gotten any better.\"\u003c/p\u003e\n\u003cp\u003eJez looked at her from under a swelling eyelid. \"I can\u0027t tell you something I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eLily opened her mouth, but before she could speak, a new voice cut in.\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t have to tell you,\" Hugh said. \"Ill tell you. It\u0027s me.\"\u003c/p\u003e\n\u003cp\u003eLily swiveled slowly to look at him.\u003c/p\u003e\n\u003cp\u003eHe was sitting up straight inside his cocoon of bonds, his face calm under the dried blood. His gray eyes\u003c/p\u003e\n\u003cp\u003ewere clear and straightforward. He didn\u0027t look afraid.\u003c/p\u003e\n\u003cp\u003eOh, Hugh, Jez thought. Her heart was beating slow and hard and her eyes prickled.\u003c/p\u003e\n\u003cp\u003eLily glanced at Azarius.\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Sure, it could be. I told you, it could be either of them. They were both at the station\u003c/p\u003e\n\u003cp\u003ewhen the flash came and the train stopped.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm,\" Lily said, a sound like a cat purring to dinner. She moved toward Hugh. He didn\u0027t look away\u003c/p\u003e\n\u003cp\u003efrom her, didn\u0027t flinch.\u003c/p\u003e\n\u003cp\u003eBut beside him, Claire gave a convulsive wiggle.\u003c/p\u003e\n\u003cp\u003eShe had been watching everything with a desperate, dazed expression. Jez was sure she didn\u0027t\u003c/p\u003e\n\u003cp\u003eunderstand a quarter of what was going on. But now she suddenly lost the muddled look. Her dark eyes\u003c/p\u003e\n\u003cp\u003esparked and she looked like the Claire who\u0027d\u003c/p\u003e\n\u003cp\u003etaunted Jez a hundred times in the hallway back home.\u003c/p\u003e\n\u003cp\u003e\u0027I don\u0027t know what you\u0027re talking about,\" she said to Hugh. \"You know perfectly well it\u0027s me.\" She\u003c/p\u003e\n\u003cp\u003eturned to Lily. Tm the Wild Power.\"\u003c/p\u003e\n\u003cp\u003eLily\u0027s mouth tightened. She put her hands on her hips, looking from Hugh to Claire.\u003c/p\u003e\n\u003cp\u003eThen Jez heard the strangest sound of her life.\u003c/p\u003e\n\u003cp\u003eIt was laughing-a wild and reckless laughing. There was an edge almost like crying to it, but also\u003c/p\u003e\n\u003cp\u003esomething that was exhilarated, daredevil, free.\u003c/p\u003e\n\u003cp\u003e\"If you really want to know who it is,\" Morgead said, \"ifs me.\"\u003c/p\u003e\n\u003cp\u003eLily whirled to glare at him. Jez simply stared, dumbfounded.\u003c/p\u003e\n\u003cp\u003eShe\u0027d never seen him look so handsome-or so mocking. His smile was brilliant and flashing, his dark hair\u003c/p\u003e\n\u003cp\u003ewas falling all over his eyes, and his eyes were blazing green emeralds. He was tied up, but he was sitting\u003c/p\u003e\n\u003cp\u003ewith his head thrown back like a prince.\u003c/p\u003e\n\u003cp\u003eSomething tore inside Jez.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t understand why he would do it. He must know he wasn\u0027t saving her. The only people he\u003c/p\u003e\n\u003cp\u003emight possibly save were Hugh and Claire. And why would he care about them?\u003c/p\u003e\n\u003cp\u003eBesides, it was a futile gesture. He didn\u0027t realize that he couldn\u0027t be the Wild Power, that he hadn\u0027t been\u003c/p\u003e\n\u003cp\u003earound when the train stopped.\u003c/p\u003e\n\u003cp\u003eBut-it was such a gallant gesture, too. Probably the most gallant thing Jez had ever seen.\u003c/p\u003e\n\u003cp\u003eShe stared at him, feeling the wetness spill from\u003c/p\u003e\n\u003cp\u003eher eyes again, wishing she were telepathic and could ask him why in the worlds he had done it.\u003c/p\u003e\n\u003cp\u003eThen his green eyes turned to her, and she heard his mental voice.\u003c/p\u003e\n\u003cp\u003eThere\u0027s just a chance they\u0027ll let one of them go with a beating. Just maybe-as a warning to Circle\u003c/p\u003e\n\u003cp\u003eDaybreak not to mess with Hunter anymore. Especially if I convince Lily I\u0027ll work with her.\u003c/p\u003e\n\u003cp\u003eJez couldn\u0027t answer, but she shook her head very faintly, and looked at him in despair. She knew he\u003c/p\u003e\n\u003cp\u003ecould read that. Do you know what they\u0027ll do to you? Especially when they find out you\u0027re a fake?\u003c/p\u003e\n\u003cp\u003eShe saw his faint answering smile. He knew.\u003c/p\u003e\n\u003cp\u003eWhat difference does it make? he said in her mind. You and me-we\u0027re lost anyway. And without you, I\u003c/p\u003e\n\u003cp\u003edon\u0027t care what happens.\u003c/p\u003e\n\u003cp\u003eJez couldn\u0027t show any reaction to that at all. Her vision was dimming, and her heart felt as if it were trying\u003c/p\u003e\n\u003cp\u003eto claw itself out of her chest.\u003c/p\u003e\n\u003cp\u003eOh, Morgead ...\u003c/p\u003e\n\u003cp\u003eLily was breathing hard, on the verge of losing control. \"If I have to kill all of you-\"\u003c/p\u003e\n\u003cp\u003e\"Wait,\" Pierce said, his cool voice a striking contrast to Lily\u0027s strained one. \"There\u0027s a simple way to find\u003c/p\u003e\n\u003cp\u003eout.\" He pointed at Jez. \"Stake her.\"\u003c/p\u003e\n\u003cp\u003eLily glared at him. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s never going to tell you anything. She\u0027s expendable. And there\u0027s something you have to understand\u003c/p\u003e\n\u003cp\u003eabout the Wild Power.\" He moved smoothly to Lily\u0027s side. \"I think Morgead was right about one thing. I\u003c/p\u003e\n\u003cp\u003ethink the Wild Power isn\u0027t operating consciously at this point. It\u0027s only when the\u003c/p\u003e\n\u003cp\u003edanger is greatest, when there\u0027s no physical way to escape, that the power comes out.\"\u003c/p\u003e\n\u003cp\u003eLily cast a sideways look at Hugh and Claire, who were sitting tensely, their eyes wide. \"You mean they\u003c/p\u003e\n\u003cp\u003emay not know which it is?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe not. Maybe it\u0027s completely automatic at this point. But there\u0027s one way to find out. They all\u003c/p\u003e\n\u003cp\u003eseem-attached-to the halfbreed. Put her life in danger, and then see which of them can break free and try\u003c/p\u003e\n\u003cp\u003eto save her.\"\u003c/p\u003e\n\u003cp\u003eLily\u0027s perfect lips slowly curved in a smile. \"I knew there was a reason I liked you,\" she said. Then she\u003c/p\u003e\n\u003cp\u003egestured at the thugs. \"Go on, do it\" Everything was confused for a bit. Not because Jez was struggling.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t. But Claire was screaming and Hugh and Morgead were shouting, and Lily was laughing.\u003c/p\u003e\n\u003cp\u003eWhen the worst of the noise died down, Jez found herself on her back. Azarius was standing over her,\u003c/p\u003e\n\u003cp\u003eand he was holding a hammer and stake.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t it interesting,\" Lily was saying, \"that a stake through the heart is the one thing that takes care of\u003c/p\u003e\n\u003cp\u003ehumans and vampires equally efficiently?\"\u003c/p\u003e\n\u003cp\u003e\"And halfbreeds, too,\" Pierce said. They were on either side of Azarius, looking down and laughing.\u003c/p\u003e\n\u003cp\u003e\"Lily, listen. Listen,\" Morgead said, his voice hoarse and desperate. \"You don\u0027t have to do this. I already\u003c/p\u003e\n\u003cp\u003etold you, it\u0027s me. Just wait a minute and talk to me-*\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t even bother, human-lover,\" Lily said without glancing at him. \"If you\u0027re the Wild Power, then save\u003c/p\u003e\n\u003cp\u003eher.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t any of you do anything!\" Jez yelled. \"Not anything, do you understand?\"\u003c/p\u003e\n\u003cp\u003eShe was yelling it mainly at Claire-or was she?\u003c/p\u003e\n\u003cp\u003eSuddenly Jez felt strangely uncertain.\u003c/p\u003e\n\u003cp\u003eHer heart was beating very quickly, and her mind was racing even faster. Fragments of thought were\u003c/p\u003e\n\u003cp\u003eglittering through her consciousness, like bits of melody almost too faint to catch. It was as if all the\u003c/p\u003e\n\u003cp\u003eprophecies she\u0027d heard about the Wild Powers were echoing, ricocheting around her brain at insane\u003c/p\u003e\n\u003cp\u003espeed. And there was something about them, something that was bothering her. Something that made her\u003c/p\u003e\n\u003cp\u003ewonder...\u003c/p\u003e\n\u003cp\u003eCould it be that Claire wasn\u0027t the Wild Power? Jez had assumed she was-but was it possible that she\u0027d\u003c/p\u003e\n\u003cp\u003ebeen wrong?\u003c/p\u003e\n\u003cp\u003eHugh had been on the platform, too, watching the train approach. Hugh had reason to be upset at having\u003c/p\u003e\n\u003cp\u003eto watch Jez die. He cared about her. Jez knew that now. And Hugh was seventeen.\u003c/p\u003e\n\u003cp\u003eCould Hugh be the Wild Power?\u003c/p\u003e\n\u003cp\u003eHe hadn\u0027t been in the Marina district-but he lived in the Bay Area; there was no reason he couldn\u0027t have\u003c/p\u003e\n\u003cp\u003ebeen watching the fire just as she and Claire had.\u003c/p\u003e\n\u003cp\u003eBut there was still something nagging at her. The prophecies... \u0027two eyes are watching\u0027... \u0027Four of\u003c/p\u003e\n\u003cp\u003eblue fire, power in their blood....\u0027\u003c/p\u003e\n\u003cp\u003eLily was speaking. Jez heard her as if from a great distance.\u003c/p\u003e\n\u003cp\u003e\"Do it. Right beside the heart first.\"\u003c/p\u003e\n\u003cp\u003eAzarius positioned the stake. He raised the hammer.\u003c/p\u003e\n\u003cp\u003eMorgead screamed, \"Jez!\"\u003c/p\u003e\n\u003cp\u003eJez shouted, \"None of you do anything-\"\u003c/p\u003e\n\u003cp\u003eAnd then the hammer came down and the universe exploded in red agony. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-huntress-night-world-7/page-17.html","bookId":1863,"creation":"Oct 5, 2019 4:40:36 PM","modification":"Oct 5, 2019 4:40:36 PM"}
