{"id":82084,"no":3,"title":"Page 3","content":"\u003cp\u003eJez burst through the door and turned immediately into the small library off the front hall. Her uncle was\u003c/p\u003e\n\u003cp\u003esitting there at his desk, surrounded by built-in bookcases. He looked up in surprise.\u003c/p\u003e\n\u003cp\u003e\"Uncle Bracken, who was my mother? How did my parents die?\" It all came out in a single rush of\u003c/p\u003e\n\u003cp\u003ebreath. And then Jez wanted to say, \"Tell me the truth,\" but instead she heard herself saving wildly, \"Tell\u003c/p\u003e\n\u003cp\u003eme it\u0027s not true. It\u0027s not possible, is it? Uncle Bracken, I\u0027m so scared.\"\u003c/p\u003e\n\u003cp\u003eHer uncle stared at her for a moment. There was shock and despair in his face. Then he bent his head\u003c/p\u003e\n\u003cp\u003eand shut his eyes.\u003c/p\u003e\n\u003cp\u003e\"But how is it possible?\" Jez whispered. \"How am I here?\" It was hours later. Dawn was tinting\u003c/p\u003e\n\u003cp\u003ethe window. She was sitting on the floor, back\u003c/p\u003e\n\u003cp\u003eagainst a bookcase, where she\u0027d collapsed, staring\u003c/p\u003e\n\u003cp\u003eemptily into the distance. \"You mean, how can a vampire-human halfbreed\u003c/p\u003e\n\u003cp\u003eexist? I don\u0027t know. Your parents never knew. They never expected to have children.\" Uncle Bracken\u003c/p\u003e\n\u003cp\u003eran both hands through his hair, head down. \"They didn\u0027t even realize you could live as a vampire. Your\u003c/p\u003e\n\u003cp\u003efather brought you to me because he was dying and I was the only person he could trust. He knew I\u003c/p\u003e\n\u003cp\u003ewouldn\u0027t turn you over to the Night World elders.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you should have,\" Jez whispered. Uncle Bracken went on as if he hadn\u0027t heard her. \"You lived\u003c/p\u003e\n\u003cp\u003ewithout blood then. You looked like a human child. I don\u0027t know what made me try to see if you could\u003c/p\u003e\n\u003cp\u003elearn how to feed. I brought you a rabbit and bit it for you and let you smell the blood.\" He gave a short\u003c/p\u003e\n\u003cp\u003elaugh of reminiscence. \"And your little teeth sharpened right up and you knew what to do. That was when\u003c/p\u003e\n\u003cp\u003eI knew you were a true Redfern.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m not.\" Jez heard the words as if someone else was speaking them from a distance. \"I\u0027m not even\u003c/p\u003e\n\u003cp\u003ea Night Person. I\u0027m vermin.\"\u003c/p\u003e\n\u003cp\u003eUncle Bracken let go of his hair and looked at her. His eyes, normally the same silvery-blue as Jez\u0027s,\u003c/p\u003e\n\u003cp\u003ewere burning with a pure silver flame. \"Your mother was a good woman,\" he said harshly. \"Your father\u003c/p\u003e\n\u003cp\u003egave up everything to be with her. She wasn\u0027t vermin.\" Jez looked away, but she wasn\u0027t ashamed. She\u003c/p\u003e\n\u003cp\u003ewas numb. She felt nothing except a vast emptiness inside her, stretching infinitely in all directions.\u003c/p\u003e\n\u003cp\u003eAnd that was good. She never wanted to feel again. Everything she\u0027d felt in her life-everything she could\u003c/p\u003e\n\u003cp\u003eremember-had been a lie.\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t a huntress, a predator fulfilling her place in the scheme of things by chasing down her lawful\u003c/p\u003e\n\u003cp\u003eprey. She was a murderer. She was a monster.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t stay here anymore,\" she said.\u003c/p\u003e\n\u003cp\u003eUncle Bracken winced. \"Where will you go?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eHe let out his breath and spoke slowly and sadly. \"I have an idea.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-huntress-night-world-7/page-3.html","bookId":1863,"creation":"Oct 5, 2019 4:40:36 PM","modification":"Oct 5, 2019 4:40:36 PM"}
