{"id":82090,"no":9,"title":"Page 9","content":"\u003cp\u003eNo. This can\u0027t be happening.\u003c/p\u003e\n\u003cp\u003eJez had never felt anything like this before, but she knew instinctively that it was dangerous. She was\u003c/p\u003e\n\u003cp\u003ebeing pulled into Morgead\u0027s mind. She could feel it surrounding her, enfolding her, a touch that was light\u003c/p\u003e\n\u003cp\u003ebut almost irresistible, that was trying to draw out the most secret part of herself.\u003c/p\u003e\n\u003cp\u003eAnd the most frightening thing was that Morgead wasn\u0027t doing it\u003c/p\u003e\n\u003cp\u003eIt was something outside both of them, something that was trying to mix them together like two pools of\u003c/p\u003e\n\u003cp\u003ewater being stirred. Jez could feel that Morgead was as startled and astonished as she was. The only\u003c/p\u003e\n\u003cp\u003edifference was that he didn\u0027t seem to be resisting the force. He didn\u0027t seem terrified and unhappy about it,\u003c/p\u003e\n\u003cp\u003eas Jez was. He seemed... exhilarated and wondering, like somebody skydiving for the first time.\u003c/p\u003e\n\u003cp\u003eThat\u0027s because he\u0027s crazy, Jez thought dizzily. He loves danger and he enjoys courting death-\u003c/p\u003e\n\u003cp\u003eI enjoy you, a voice said in her mind.\u003c/p\u003e\n\u003cp\u003eMorgead\u0027s voice. Soft as a whisper, a feather-touch that shook Jez to her soul.\u003c/p\u003e\n\u003cp\u003eIt had been so long since she\u0027d heard that voice.\u003c/p\u003e\n\u003cp\u003eAnd he had heard her. Sharing blood made even humans telepathic. Jez hadn\u0027t been able to talk mentally\u003c/p\u003e\n\u003cp\u003esince-\u003c/p\u003e\n\u003cp\u003eShe managed to cut the thought off as panic surged through her. While one part of her mind gabbled\u003c/p\u003e\n\u003cp\u003edesperately, \"He\u0027s here, he\u0027s here, he\u0027s inside, what are we going to do now?\" another part threw up a\u003c/p\u003e\n\u003cp\u003esmokescreen, flooding her thoughts with visions of mist and clouds.\u003c/p\u003e\n\u003cp\u003eThere was something like a swift gasp from Morgead.\u003c/p\u003e\n\u003cp\u003eJez. don\u0027t. Don\u0027t hide from me-\u003c/p\u003e\n\u003cp\u003eYou\u0027re not allowed here, she snapped back, this time directing the thought straight at him. Go away!\u003c/p\u003e\n\u003cp\u003eI can\u0027t. For just a moment his mental voice sounded confused and scared. She hadn\u0027t realized Morgead\u003c/p\u003e\n\u003cp\u003ecould be confused and scared. I\u0027m not doing this. It\u0027s just-happening.\u003c/p\u003e\n\u003cp\u003eBut it shouldn\u0027t be happening, Jez thought, and she didn\u0027t know whether she was talking to him or just to\u003c/p\u003e\n\u003cp\u003eherself. She was beginning to shake. She couldn\u0027t resist the pull that was trying to bring her soul to the\u003c/p\u003e\n\u003cp\u003esurface and intermingle it with Morgead\u0027s-she couldn\u0027t. It was stronger than anything she\u0027d ever\u003c/p\u003e\n\u003cp\u003eexperienced. But she knew that if she gave in, she was dead.\u003c/p\u003e\n\u003cp\u003eDon\u0027t be afraid. Don\u0027t, Morgead said in a voice she had never heard from him before. A voice of\u003c/p\u003e\n\u003cp\u003edesperate gentleness. His mind was trying to wrap around hers protectively, like dark wings shielding her,\u003c/p\u003e\n\u003cp\u003etouching her softly.\u003c/p\u003e\n\u003cp\u003eJez felt her insides turn to water.\u003c/p\u003e\n\u003cp\u003eNo. No...\u003c/p\u003e\n\u003cp\u003eYes, Morgead\u0027s voice whispered.\u003c/p\u003e\n\u003cp\u003eShe had to stop this-now. She had to break the contact. But although Jez could still feel her physical\u003c/p\u003e\n\u003cp\u003ebody, she seemed powerless to control it. She could sense Morgead\u0027s arms supporting her and his lips\u003c/p\u003e\n\u003cp\u003eon her throat and she knew that he was still drinking. But she couldn\u0027t so much as move a finger to push\u003c/p\u003e\n\u003cp\u003ehim away. The muscles that she\u0027d trained so ruthlessly to obey her under any circumstances were\u003c/p\u003e\n\u003cp\u003ebetraying her now.\u003c/p\u003e\n\u003cp\u003eShe had to try another way.\u003c/p\u003e\n\u003cp\u003eThis shouldn\u0027t be happening, she told Morgead, putting all the energy of her terror behind the thought.\u003c/p\u003e\n\u003cp\u003eI know. But that\u0027s because you\u0027re fighting it. We should be somewhere else by now.\u003c/p\u003e\n\u003cp\u003eJez was exasperated. Where else?\u003c/p\u003e\n\u003cp\u003eI don\u0027t know, he said, and she could feel a tinge of sadness in his thought. Some place-deeper. Where\u003c/p\u003e\n\u003cp\u003ewe\u0027d really be together. But you won\u0027t open your mind....\u003c/p\u003e\n\u003cp\u003eMorgead, what are you talking about? What do you think is going on?\u003c/p\u003e\n\u003cp\u003eHe seemed genuinely surprised. Don\u0027t you know? It\u0027s the soulmate principle.\u003c/p\u003e\n\u003cp\u003eJez felt the floor drop away beneath her.\u003c/p\u003e\n\u003cp\u003eNo. That\u0027s not possible. That can\u0027t be. She wasn\u0027t talking to Morgead anymore; she was desperately\u003c/p\u003e\n\u003cp\u003etrying to convince herself. I\u0027m not soulmates with Morgead. I can\u0027t be. We hate each other ... he hates\u003c/p\u003e\n\u003cp\u003eme ... all we ever do is fight. . .\u003c/p\u003e\n\u003cp\u003eHe\u0027s impossible and dangerous and hotheaded and stubborn... he\u0027s crazy... he\u0027s angry and hostile . .\u003c/p\u003e\n\u003cp\u003e. he\u0027s frustrating and infuriating and he loves to make me miserable . ..\u003c/p\u003e\n\u003cp\u003eAnd I don\u0027t even believe in soulmates. And even if I did, I wouldn\u0027t believe it could happen like this, just\u003c/p\u003e\n\u003cp\u003ebang, out of the blue, like getting hit by a train when you\u0027re not looking, without any warning or even any\u003c/p\u003e\n\u003cp\u003eattraction to the person beforehand....\u003c/p\u003e\n\u003cp\u003eBut the very hysteria of her own thoughts was a bad sign. Anything that could tear away her self-control\u003c/p\u003e\n\u003cp\u003elike this was powerful almost beyond imagination. And she could still feel it pulling at her, trying to strip\u003c/p\u003e\n\u003cp\u003eoff the layers of cloud she was hiding behind. It wanted Morgead to see her as she truly was.\u003c/p\u003e\n\u003cp\u003eAnd it was trying to show her Morgead. Flashes of his Me, of himself. Glimpses that hit her and seemed\u003c/p\u003e\n\u003cp\u003eto cut cleanly through her, leaving her gasping with their intensity.\u003c/p\u003e\n\u003cp\u003eA little boy with a mop of tousled dark hair and eyes like emerald, watching his mother walk out the\u003c/p\u003e\n\u003cp\u003edoor with some man-again. Going to play alone in the darkness, amusing himself. And then meeting a\u003c/p\u003e\n\u003cp\u003elittle redheaded girl, a girl with silvery-blue eyes and a flashing smile. And not being alone anymore. And\u003c/p\u003e\n\u003cp\u003ewalking on fences with her in the cool night air, chasing small animals, falling and giggling....\u003c/p\u003e\n\u003cp\u003eA slightly older boy with longer hair that fell around his face, uncared-for. Watching his mother walk out\u003c/p\u003e\n\u003cp\u003eone last time, never to come back. Hunting for food, sleeping in an empty house that got messier and\u003c/p\u003e\n\u003cp\u003emessier. Learning to care for himself. Training himself. Getting harder, in mind and body, seeing a sullen\u003c/p\u003e\n\u003cp\u003eexpression when he looked in the mirror...\u003c/p\u003e\n\u003cp\u003eA boy even older watching humans, who were weak and silly and short-lived, but who had all the things\u003c/p\u003e\n\u003cp\u003ehe didn\u0027t have. Family, security, food every night. Watching the Night People, the elders, who felt no\u003c/p\u003e\n\u003cp\u003eresponsibility to help an abandoned vampire child....\u003c/p\u003e\n\u003cp\u003eI never knew, Jez thought. She still felt dizzy, as if she couldn\u0027t get enough air. The images were dazzling\u003c/p\u003e\n\u003cp\u003ein their clarity and they tore at her heart.\u003c/p\u003e\n\u003cp\u003eA boy who started a gang to create a family, and who went first to the little girl with red hair. The two of\u003c/p\u003e\n\u003cp\u003ethem grinning wickedly, running wild in the streets, finding others. Collecting kids the adults couldn\u0027t\u003c/p\u003e\n\u003cp\u003econtrol or wouldn\u0027t miss. Walking around the worst parts of town, unafraid-because they had one\u003c/p\u003e\n\u003cp\u003eanother now.\u003c/p\u003e\n\u003cp\u003eThe images were coming faster, and Jez could hardly keep up with them.\u003c/p\u003e\n\u003cp\u003eDashing through the metal scrap yard... with Jez ... Hiding under a fish-smelling wharf... from Jez...\u003c/p\u003e\n\u003cp\u003eHis first big kill, a stag in the hills of San Rafael.. . and Jez there to share the hot blood that warmed and\u003c/p\u003e\n\u003cp\u003eintoxicated and brought life all at once. Fear and happiness and anger and arguments, hurt and sadness\u003c/p\u003e\n\u003cp\u003eand exasperation-but always with Jez interwoven into the fabric. She was always there in his memories,\u003c/p\u003e\n\u003cp\u003efire-colored hair streaming behind her, heavy-lashed eyes snapping with challenge and excitement. She\u003c/p\u003e\n\u003cp\u003ewas everything bright and eager and brave and honest. She was haloed with flame.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know... how could I know? How could I realize I meant so much to him... ?\u003c/p\u003e\n\u003cp\u003eAnd who would have thought it would mean so much to her when she found out? She was stunned,\u003c/p\u003e\n\u003cp\u003eovercome-but something inside her was singing, too.\u003c/p\u003e\n\u003cp\u003eShe was happy about it. She could feel something bubbling up that she hadn\u0027t even realized was there; a\u003c/p\u003e\n\u003cp\u003ewild and heady delight that seemed to shoot out to the palms of her hands and the soles of her feet.\u003c/p\u003e\n\u003cp\u003eMorgead, she whispered with her mind.\u003c/p\u003e\n\u003cp\u003eShe could sense him, but for once he didn\u0027t answer. She felt his sudden fear, his own desire to run and\u003c/p\u003e\n\u003cp\u003ehide. He hadn\u0027t meant to show her these things. They were being forced out of him by the same power\u003c/p\u003e\n\u003cp\u003ethat was dragging at Jez.\u003c/p\u003e\n\u003cp\u003eI\u0027m sorry. I didn\u0027t mean to look, she thought to him. I\u0027ll go away....\u003c/p\u003e\n\u003cp\u003eNo. Suddenly he wasn\u0027t hiding anymore. No, I don\u0027t want you to go. I want you to stay.\u003c/p\u003e\n\u003cp\u003eJez felt herself flow toward him, helplessly. The truth was that she didn\u0027t know if she could turn away\u003c/p\u003e\n\u003cp\u003eeven if he\u0027d wanted her to. She could feel his mind touching hers-she could taste the very essence of his\u003c/p\u003e\n\u003cp\u003esoul. And it made her tremble.\u003c/p\u003e\n\u003cp\u003eThis was like nothing she\u0027d ever felt before. It was so strange... but so wonderful. A pleasure that she\u003c/p\u003e\n\u003cp\u003ecouldn\u0027t have dreamed of. To be this close, and to be getting closer, like fire and bright darkness merging\u003c/p\u003e\n\u003cp\u003e... To feel her mind opening to him...\u003c/p\u003e\n\u003cp\u003eAnd then the distant echo of fear, like an animal screaming a warning.\u003c/p\u003e\n\u003cp\u003eAre you insane? This is Morgead. Let him see your soul... pry open your innermost secrets... and\u003c/p\u003e\n\u003cp\u003eyou won\u0027t live long enough to regret it. He\u0027ll tear your throat out the instant he finds out...\u003c/p\u003e\n\u003cp\u003eJez flinched wildly from the voice. She didn\u0027t want to resist the pull to Morgead any longer. But fear was\u003c/p\u003e\n\u003cp\u003eshivering through her, poisoning the warmth and closeness, freezing the edges of her mind. And she knew\u003c/p\u003e\n\u003cp\u003ethat the voice was the only rationality left in her.\u003c/p\u003e\n\u003cp\u003eDo you want to die? it asked her point-blank.\u003c/p\u003e\n\u003cp\u003eJez, Morgead was saying quietly. What\u0027s wrong? Why won\u0027t you let it happen?\u003c/p\u003e\n\u003cp\u003eNot just you dying, the voice said. All those others. Claire and Aunt Nan and Uncle Jim and Ricky.\u003c/p\u003e\n\u003cp\u003eHugh...\u003c/p\u003e\n\u003cp\u003eSomething white-hot flickered through her. Hugh. Whom she loved. Who couldn\u0027t fight for himself. She\u003c/p\u003e\n\u003cp\u003ehadn\u0027t even thought of him since she\u0027d entered Morgead\u0027s mind-and that terrified her.\u003c/p\u003e\n\u003cp\u003eHow could she have forgotten him? For the last year Hugh had represented everything good to her.\u003c/p\u003e\n\u003cp\u003eHe\u0027d awakened feelings in her that she\u0027d never had before. And he was the one person she would never\u003c/p\u003e\n\u003cp\u003ebetray.\u003c/p\u003e\n\u003cp\u003eJez, Morgead said.\u003c/p\u003e\n\u003cp\u003eJez did the only thing she could think of. She threw an image at him, a picture to stir his memories. A\u003c/p\u003e\n\u003cp\u003epicture of her walking out, leaving the gang, leaving him.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t a real picture, of course. It was a symbol.\u003c/p\u003e\n\u003cp\u003eIt was bait.\u003c/p\u003e\n\u003cp\u003eAnd she felt it hit Morgead\u0027s mind and clash there, and strike memories that flew like sparks.\u003c/p\u003e\n\u003cp\u003eThe first meeting of the gang with her not there. Questions. Puzzlement. All of them searching for her,\u003c/p\u003e\n\u003cp\u003etrying to find a hint of her unique Power signature on the streets. At first laughing as they called for her,\u003c/p\u003e\n\u003cp\u003emaking it a game, then the laughter turning into annoyance as she stayed missing. Then annoyance turning\u003c/p\u003e\n\u003cp\u003einto worry.\u003c/p\u003e\n\u003cp\u003eHer uncle Bracken\u0027s house. The gang crowded on the doorstep with Morgead in front. Uncle Bracken\u003c/p\u003e\n\u003cp\u003elooking lost and sad. \"I don\u0027t know where she is. She just-disappeared.\" And worry turning into\u003c/p\u003e\n\u003cp\u003egut-wrenching fear. Fear and anger and sorrow and betrayal.\u003c/p\u003e\n\u003cp\u003eIf she wasn\u0027t dead, then she\u0027d abandoned him. Just like everyone else. Just like his mother.\u003c/p\u003e\n\u003cp\u003eAnd that grief and fury building, both perfectly balanced because Morgead didn\u0027t know which was the\u003c/p\u003e\n\u003cp\u003etruth. But always with the knowledge, either way, that the world was cold because she was gone.\u003c/p\u003e\n\u003cp\u003eAnd then... her appearing in his room today. Obviously alive. Insultingly healthy. And unforgivably\u003c/p\u003e\n\u003cp\u003ecasual as she told him he would never know why she\u0027d left.\u003c/p\u003e\n\u003cp\u003eJez felt Morgead\u0027s outrage swelling up, a dark wave inside him, a coldness that felt no mercy for anyone\u003c/p\u003e\n\u003cp\u003eand only wanted to hurt and kill. It was filling him, sweeping everything else away. Just being in contact\u003c/p\u003e\n\u003cp\u003ewith it started her heart pounding and shortened her breath. Its raw violence was terrifying.\u003c/p\u003e\n\u003cp\u003eYou left me! he snarled at her, three syllables with a world of bitterness behind them.\u003c/p\u003e\n\u003cp\u003eI had to. And I\u0027ll never tell you why. Jez could feel her own eyes stinging; she supposed he could sense\u003c/p\u003e\n\u003cp\u003ehow it hurt her to say that. But it was the only thing that would work. The pull between them was\u003c/p\u003e\n\u003cp\u003eweakening, being smashed away by his anger.\u003c/p\u003e\n\u003cp\u003eYou\u0027re a traitor, he said. And the image behind it was that of everyone who\u0027d ever betrayed a friend or a\u003c/p\u003e\n\u003cp\u003elover or a cause for the most selfish of reasons. Every betrayer from the history of the human world or\u003c/p\u003e\n\u003cp\u003ethe Night World. That was what Morgead thought of her.\u003c/p\u003e\n\u003cp\u003eI don\u0027t care what you think, she said. You never cared, he shot back. I know that now. I don\u0027t know\u003c/p\u003e\n\u003cp\u003ewhy I ever thought differently.\u003c/p\u003e\n\u003cp\u003eThe force that had been trying to drag them together had thinned to a silver thread of connection. And\u003c/p\u003e\n\u003cp\u003ethat was good-it was necessary, Jez told herself. She made an effort and felt herself slide away from\u003c/p\u003e\n\u003cp\u003eMorgead\u0027s mind, and then further, and then further.\u003c/p\u003e\n\u003cp\u003eYou\u0027d better not forget it again, she said. It was easier to be nasty when she couldn\u0027t feel his reactions. It\u003c/p\u003e\n\u003cp\u003emight be bad for your health.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry, he told her briefly. I can take care of myself. And you\u0027d better believe I\u0027ll never forget.\u003c/p\u003e\n\u003cp\u003eThe thread was so fine and taut that Jez could hardly sense it now. She felt an odd lurch inside her, a\u003c/p\u003e\n\u003cp\u003epleading, but she knew what needed to be done.\u003c/p\u003e\n\u003cp\u003eI do what I want to, for my own reasons, she said. And nobody questions me. I\u0027m leader, remember?\u003c/p\u003e\n\u003cp\u003eSnap!\u003c/p\u003e\n\u003cp\u003eIt was a physical sensation, the feeling of breaking away, as Morgead was carried off on a wave of his\u003c/p\u003e\n\u003cp\u003eown black anger. He was retreating from her so fast that it made her dizzy....\u003c/p\u003e\n\u003cp\u003eAnd then her eyes were open and she was in her own body.\u003c/p\u003e\n\u003cp\u003eJez blinked, trying to focus on the room. She was looking up at the ceiling, and everything was too bright\u003c/p\u003e\n\u003cp\u003eand too large and too fuzzy. Morgead\u0027s arms were around her and her throat was arched back, still\u003c/p\u003e\n\u003cp\u003eexposed. Every nerve was quivering.\u003c/p\u003e\n\u003cp\u003eThen suddenly the arms around her let go and she fell. She landed on her back, still blinking, trying to\u003c/p\u003e\n\u003cp\u003egather herself and figure out which muscles moved what. Her throat stung, and she could feel dampness\u003c/p\u003e\n\u003cp\u003ethere. She was giddy.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with you? Get up and get out,\" Morgead snarled. Jez focused on him. He looked very\u003c/p\u003e\n\u003cp\u003etall from her upside-down vantage point. His green eyes were as cold as chips of gemstone.\u003c/p\u003e\n\u003cp\u003eThen she realized what was wrong.\u003c/p\u003e\n\u003cp\u003e\"You took too much blood, you jerk.\" She tried to put her usual acidity into the words, to cover up her\u003c/p\u003e\n\u003cp\u003eweakness. \"It was just supposed to be a ritual thing, but you lost control. I should\u0027ve known you would.\"\u003c/p\u003e\n\u003cp\u003eSomething flickered in Morgead\u0027s eyes, but then his mouth hardened. \"Tough,\" he said shortly. \"You\u003c/p\u003e\n\u003cp\u003eshouldn\u0027t have given me the chance.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t make the same mistake again!\" She struggled to a sitting position, trying not to show the effort it\u003c/p\u003e\n\u003cp\u003ecost her. The problem-again-was that she wasn\u0027t a vampire. She couldn\u0027t recover as quickly from loss of\u003c/p\u003e\n\u003cp\u003eblood... but Morgead didn\u0027t know that.\u003c/p\u003e\n\u003cp\u003eNot that he\u0027d care, anyway.\u003c/p\u003e\n\u003cp\u003ePart of her winced at that, tried to argue, but Jez brushed it aside. She needed all her strength and every\u003c/p\u003e\n\u003cp\u003ewall she could build if she was going to get past what had happened.\u003c/p\u003e\n\u003cp\u003eIt shouldn\u0027t have happened, whatever it had been. It had been some horrible mistake, and she was lucky\u003c/p\u003e\n\u003cp\u003eto have gotten away with her life. And from now on, the only thing to do was try to forget it.\u003c/p\u003e\n\u003cp\u003e\"I probably should tell you why I\u0027m here,\" she said, and got to her feet without a discernable wobble. \u0027I\u003c/p\u003e\n\u003cp\u003eforgot to mention it before.\"\u003c/p\u003e\n\u003cp\u003e\"Why you came back? I don\u0027t even want to know.\" He only wanted her to leave; she could tell that from\u003c/p\u003e\n\u003cp\u003ehis posture, from the tense way he was pacing.\u003c/p\u003e\n\u003cp\u003e\"You will when I tell you.\" She didn\u0027t have the energy to yell at him the way she wanted. She couldn\u0027t\u003c/p\u003e\n\u003cp\u003eafford the luxury of going with her emotions.\u003c/p\u003e\n\u003cp\u003e\"Why do you always think you know what I want?\" he snapped, his back to her.\u003c/p\u003e\n\u003cp\u003e\"Okay. Be like that. You probably wouldn\u0027t appreciate the chance anyway.\"\u003c/p\u003e\n\u003cp\u003eMorgead whirled. He glared at her in a way that meant he could think of too many nasty things to say to\u003c/p\u003e\n\u003cp\u003esettle on one. Finally he just said almost inaudibly, \"What chance?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t come back just to take over the gang. I want to do things with it. I want to make us more\u003c/p\u003e\n\u003cp\u003epowerful.\"\u003c/p\u003e\n\u003cp\u003eIn the old days the idea would have made him grin, put a wicked sparkle in his eyes. They\u0027d always\u003c/p\u003e\n\u003cp\u003eagreed on power, if nothing else.\u003c/p\u003e\n\u003cp\u003eNow he just stood there. He stared at her. His expression changed slowly from cold fury to suspicion to\u003c/p\u003e\n\u003cp\u003edawning insight. His green eyes narrowed, then widened. He let out his breath.\u003c/p\u003e\n\u003cp\u003eAnd then he threw back his head and laughed and laughed and laughed.\u003c/p\u003e\n\u003cp\u003eJez said nothing, just watched him, inconspicuously testing her balance and feeling relieved that she could\u003c/p\u003e\n\u003cp\u003estand without fainting. At last, though, she couldn\u0027t stand the sound of that laughing anymore. There was\u003c/p\u003e\n\u003cp\u003every little humor in it.\u003c/p\u003e\n\u003cp\u003e\"Want to share the joke?\"\u003c/p\u003e\n\u003cp\u003e\u0027It\u0027s just ... of course. I should have known. Maybe I did know, underneath.\" He was still chuckling, but\u003c/p\u003e\n\u003cp\u003eit was a vicious noise, and his eyes were distant and full of something like hatred. Maybe self-hatred.\u003c/p\u003e\n\u003cp\u003eCertainly bitterness.\u003c/p\u003e\n\u003cp\u003eJez felt a chill.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s only one thing that could have brought you back. And I should have realized that from the\u003c/p\u003e\n\u003cp\u003einstant you turned up. It wasn\u0027t concern for anybody here; it\u0027s got nothing to do with the gang.\" He\u003c/p\u003e\n\u003cp\u003elooked her straight in the face, his lips curved in a perfect, malevolent smile. He had never been more\u003c/p\u003e\n\u003cp\u003ehandsome, or more cold.\u003c/p\u003e\n\u003cp\u003e\"I know what it is, Jez Redfern. I know exactly why you\u0027re here today.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-huntress-night-world-7/page-9.html","bookId":1863,"creation":"Oct 5, 2019 4:40:36 PM","modification":"Oct 5, 2019 4:40:36 PM"}
