{"id":40185,"no":20,"title":"CHAPTER XX — AN OFFER OF FRIENDSHIP","content":"\u0026nbsp;Etta did not move when Steinmetz approached, except, indeed, to push one foot farther out toward the warmth of the wood fire. She certainly was very neatly shod. Steinmetz was one of her few failures. She had never got any nearer to the man. Despite his gray hair and bulky person she argued that he was still a man, and therefore an easy victim to flattery—open to the influence of beauty. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder why,” she said, looking into the fire, “you hate me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Steinmetz looked down at her with his grim smile. The mise en schne was perfect, from the thoughtful droop of the head to the innocent display of slipper.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder why you think that of me,” he replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One cannot help perceiving that which is obvious.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “While that which is purposely made obvious serves to conceal that which may exist behind it,” replied the stout man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta paused to reflect over this. Was Steinmetz going to make love to her? She was not an inexperienced girl, and knew that there was nothing impossible or even improbable in the thought. She wondered what Karl Steinmetz must have been like when he was a young man. He had a deft way even now of planting a double entendre when he took the trouble. How could she know that his manner was always easiest, his attitude always politest, toward the women whom he despised. In his way this man was a philosopher. He had a theory that an exaggerated politeness is an insult to a woman’s intellect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think I do not care,” said the Princess Howard Alexis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think I do not admire you,” replied Steinmetz imperturbably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked up at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you not give me every reason to think so?” she returned, with a toss of the head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was one of those women—and there are not a few—who would quarrel with you if you do not admire them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not intentionally, princess. I am, as you know, a German of no very subtle comprehension. My position in your household appears to me to be a little above the servants, although the prince is kind enough to make a friend of me and his friends are so good as to do the same. I do not complain. Far from it. I am well paid. I am interested in my work. I am more or less my own master. I am very fond of Paul. You—are kind and forbearing. I do my best—in a clumsy way, no doubt—to spare you my heavy society. But of course I do not presume to form an opinion upon your—upon you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I want you to form an opinion,” she said petulantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you must know that I could only form one which would be pleasing to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know nothing of the sort,” replied Etta. “Of course I know that all that you say about position and work is mere irony. Paul thinks there is no one in the world like you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Steinmetz glanced sharply down at her. He had never considered the possibility that she might love Paul. Was this, after all, jealousy? He had attributed it to vanity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I have no doubt he is right,” she went on. Suddenly she gave a little laugh. “Don’t you understand?” she said. “I want to be friends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She did not look at him, but sat with pouting lips holding out her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Karl Steinmetz had been up to the elbows, as it were, in the diplomacy of an unscrupulous, grasping age ever since his college days. He had been behind the scenes in more than one European crisis, and that which goes on behind the scenes is not always edifying or conducive to a squeamishness of touch. He was not the man to be mawkishly afraid of soiling his fingers. But the small white hand rather disconcerted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took it, however, in his great, warm, soft grasp, held it for a moment, and relinquished it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want you to address all your conversation to Maggie, and to ignore me. Do you think Maggie so very pretty?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a twist beneath the gray mustache as he answered, “Is that all the friendship you desire? Does it extend no farther than a passing wish to be first in petty rivalries of daily existence? I am afraid, my dear princess, that my friendship is a heavier matter—a clumsier thing than that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A big thing not easily moved,” she suggested, looking up with her dauntless smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shrugged his great shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may be—who knows? I hope it is,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The worst of those big things is that they are sometimes in the way,” said Etta reflectively, without looking at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet the life that is only a conglomeration of trifles is a poor life to look back upon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Meaning mine?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your life has not been trifling,” he said gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked up at him, and then for some moments kept silence while she idly opened and shut her fan. There was in the immediate vicinity of Karl Steinmetz a sort of atmosphere of sympathy which had the effect of compelling confidence. Even Etta was affected by it. During the silence recorded she was quelling a sudden desire to say things to this man which she had never said to any. She only succeeded in part.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you ever feel an unaccountable sensation of dread,” she asked, with a weary little laugh; “a sort of foreboding with nothing definite to forebode?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unaccountable—no,” replied Steinmetz. “But then I am a German—and stout, which may make a difference. I have no nerves.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked into the fire through his benevolent gold-rimmed spectacles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it nerves—or is it Petersburg?” she asked abruptly. “I think it is Petersburg. I hate Petersburg.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why Petersburg more than Moscow or Nijni or—Tver?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She drew in a long, slow breath, looking him up and down the while from the corners of her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know,” she replied collectedly; “I think it is damp. These houses are built on reclaimed land, I believe. This was all marsh, was it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not answer her question, and somehow she seemed to expect no reply. He stood blinking down into the fire while she watched him furtively from the corners of her eyes, her lips parched and open, her face quite white.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few moments before she had protested that she desired his friendship. She knew now that she could not brave his enmity. And the one word “Tver” had done it all! The mere mention of a town, obscure and squalid, on the upper waters of the mighty Volga in Mid-Russia!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n During those few moments she suddenly came face to face with her position. What had she to offer this man? She looked him up and down—stout, placid, and impenetrable. Here was no common adventurer seeking place—no coxcomb seeking ladies’ favors—no pauper to be bought with gold. She had no means of ascertaining how much he knew, how much he suspected. She had to deal with a man who held the best cards and would not play them. She could never hope to find out whether his knowledge and his suspicions were his alone or had been imparted to others. In her walk through life she had jostled mostly villains; and a villain is no very dangerous foe, for he fights on slippery ground. Except Paul she had never had to do with a man who was quite honest, upright, and fearless; and she had fallen into the common error of thinking that all such are necessarily simple, unsuspicious, and a little stupid.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She breathed hard, living through years of anxiety in a few moments of time, and she could only realize that she was helpless, bound hand and foot in this man’s power.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was he who spoke first. In the smaller crises of life it is usually the woman who takes this privilege upon herself; but the larger situations need a man’s steadier grasp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear lady,” he said, “if you are content to take my friendship as it is, it is yours. But I warn you it is no showy drawing-room article. There will be no compliments, no pretty speeches, no little gifts of flowers, and such trumpery amenities. It will all be very solid and middle-aged, like myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think,” returned the lady, “that I am fit for nothing better than pretty speeches and compliments and floral offerings?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She broke off with a forced little laugh, and awaited his verdict with defiant eyes upraised. He returned the gaze through his placid spectacles; her beauty, in its setting of brilliant dress and furniture, soft lights, flowers, and a thousand feminine surroundings, failed to dazzle him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do,” he said quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And yet you offer me your friendship?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed in acquiescence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For Paul’s sake, my dear lady.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She shrugged her shoulders and turned away from him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course,” she said, “it is quite easy to be rude. As it happens, it is precisely for Paul’s sake that I took the trouble of speaking to you on this matter. I do not wish him to be troubled with such small domestic affairs; and therefore, if we are to live under the same roof, I shall deem it a favor if you will, at all events, conceal your disapproval of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He bowed gravely and kept silence. Etta sat with a little patch of color on either cheek, looking into the fire until the door was opened and Maggie came in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Steinmetz went toward her with his grave smile, while Etta hid a face which had grown haggard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maggie glanced from one to the other with frank interest. The relationship between these two had rather puzzled her of late.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Steinmetz, “and what of St. Petersburg?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not disappointed,” replied Maggie. “It is all I expected and more. I am not blasie like Etta. Every thing interests me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We were discussing Petersburg when you came in,” said Steinmetz, drawing forward a chair. “The princess does not like it. She complains of—nerves.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nerves!” exclaimed Maggie, turning to her cousin. “I did not suspect you of having them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta smiled, a little wearily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One never knows,” she answered, forcing herself to be light, “what one may come to in old age. I saw a gray hair this morning. I am nearly thirty-three, you know. When glamour goes, nerves come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I suppose they do—especially in Russia, perhaps. There is a glamour about Russia, and I mean to cultivate it rather than nerves. There is a glamour about every thing—the broad streets, the Neva, the snow, and the cold. Especially the people. It is always especially the people, is it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the people, my dear young lady, that lend interest to the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Paul took me out in a sleigh this morning,” went on Maggie, in her cheerful voice that knew no harm. “I liked every thing—the policemen in their little boxes at the street corners, the officers in their fur coats, the cabmen, every-body. There is something so mysterious about them all. One can easily make up stories about every-body one meets in Petersburg. It is so easy to think that they are not what they seem. Paul, Etta, even you, Herr Steinmetz, may not be what you seem.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that is so,” answered Steinmetz, with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may be a Nihilist,” pursued Maggie. “You may have bombs concealed up your sleeves; you may exchange mysterious passwords with people in the streets; you may be much less innocent than you appear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All that may be so,” he admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may have a revolver in the pocket of your dress-coat,” went on Maggie, pointing to the voluminous garment with her fan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His hand went to the pocket in question, and produced exactly what she had suggested. He held out his hand with a small silver-mounted revolver lying in the palm of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even that,” he said, “may be so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maggie looked at it with a sudden curiosity, her bright eyes grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Loaded?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will not examine it. How curious! I wonder how near to the mark I may have been in other ways.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder,” said Steinmetz, looking at Etta. “And now tell us something about the princess. What do you suspect her of?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment Paul came into the room, distinguished-looking and grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miss Delafield,” pursued Steinmetz, turning to the new-comer, “is telling us her suspicions about ourselves. I am already as good as condemned to Siberia. She is now about to sit in judgment on the princess.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maggie laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Herr Steinmetz has pleaded guilty to the worst accusation,” she said. “On the other counts I leave him to his own conscience.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Any thing but that,” urged Steinmetz.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul came forward, and Maggie rather obviously avoided looking at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell us of Paul’s crimes first,” said Etta, rather hurriedly. She glanced at the clock, whither Karl Steinmetz’s eyes had also travelled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Paul,” said Maggie, rather indifferently. Indeed, it seemed as if her lightness of heart had suddenly failed her. “Well, perhaps he is deeply involved in schemes for the resurrection of the Polish kingdom, or something of that sort.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That sounds tame,” put in Steinmetz. “I think you would construct a better romance respecting the princess. In books it is always the beautiful princesses who are most deeply dyed in crime.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Maggie opened her fan and closed it again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” she said, tapping on the arm of her chair with it; “I give Etta a mysterious past. She is the sort of person who would laugh and dance at a ball with the knowledge that there was a mine beneath the floor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not think I am,” said Etta, with a shudder. She rose rather hurriedly, and crossed the room with a great rustle of silks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop her!” she whispered, as she passed Steinmetz.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2779/76936.html","bookId":1313,"creation":"Aug 5, 2019 12:35:00 PM","modification":"Aug 5, 2019 12:35:00 PM"}
