{"id":40190,"no":25,"title":"CHAPTER XXV — OSTERNO","content":"\u0026nbsp;“Always gay; always gay!” laughed Steinmetz, rubbing his broad hands together and looking down into the face of Maggie, who was busy at the breakfast-table. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered the girl, glancing toward Paul, leaning against the window reading his letters. “Yes, always gay. Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Karl Steinmetz saw the glance. It was one of the little daily incidents that one sees and half forgets. He only half forgot it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not, indeed?” he answered. “And you will be glad to hear that Ivanovitch is as ready as yourself this morning to treat the matter as a joke. He is none the worse for his freezing, and all the better for his experience. You have added another friend, my dear young lady, to a list which is, doubtless, a very long one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a nice man,” answered Maggie. “How is it,” she asked, after a little pause, “that there are more men in the lower classes whom one can call nice than among their betters?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul paused between two letters, hearing the question. He looked up as if interested in the answer, but did not join in the conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because dealing with animals and with nature is more conducive to niceness than too much trafficking with human beings,” replied Steinmetz promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose that is it,” said Maggie, lifting the tea-pot lid and looking in. “At all events, it is the sort of answer one might expect from you. You are always hard on human nature.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I take it as I find it,” replied Steinmetz, with a laugh, “but I do not worry about it like some people. Now, Paul would like to alter the course of the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he half turned toward Paul, as if suggesting that he should give an opinion, and this little action had the effect of putting a stop to the conversation. Maggie had plenty to say to Steinmetz, but toward Paul her mental attitude was different. She was probably unaware of this little fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There,” she said, after a pause, “I have obeyed Etta’s instructions. She does not want us to begin, I suppose?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” replied Paul. “She will be down in a minute.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope the princess is not overtired,” said Steinmetz, with a certain formal politeness which seemed to accompany any mention of Etta’s name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not at all, thank you,” replied Etta herself, coming into the room at that moment. She looked fresh and self-confident. “On the contrary, I am full of energy and eagerness to explore the castle. One naturally takes an interest in one’s baronial halls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With this she walked slowly across to the window. She stood there looking out, and every one in the room was watching. On looking for the first time on the same view, a few moments earlier, Maggie had uttered a little cry of surprise, and had then remained silent. Etta looked out of the window and said nothing. It was a most singular out-look—weird, uncouth, prehistoric, as some parts of the earth still are. The castle was built on the edge of a perpendicular cliff. On this side it was impregnable. Any object dropped from the breakfast-room window would fall a clear two hundred feet to the brawling Oster River. The rock was black, and shining like the topmost crags of an Alpine mountain where snow and ice have polished the bare stone. Beyond and across the river lay the boundless steppe—a sheet of virgin snow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta stood looking over this to the far horizon, where the white snow and the gray sky softly merged into one. Her first remark was characteristic, as first and last remarks usually are.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And as far as you can see is yours?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Paul simply, with that calm which only comes with hereditary possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The observation attracted Steinmetz’s attention. He went to another window, and looked across the waste critically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Four times as far as we can see is his,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta looked out slowly and comprehensively, absorbing it all like a long, sweet drink. There was no hereditary calmness in her sense of possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where is Thors?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul stretched out his arm, pointing with a lean, steady finger:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It lies out there,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Another of the little incidents that are only half forgotten. Some of the persons assembled in that room remembered the pointing finger long afterward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It makes one feel very small,” said Etta, turning to the breakfast-table—“at no time a pleasant sensation. Do you know,” she said, after a little pause, “I think it probable that I shall become very fond of Osterno, but I wish it was nearer to civilization.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul looked pleased. Steinmetz had a queer expression on his face. Maggie murmured something about one’s surroundings making but little difference to one’s happiness, and the subject was wisely shelved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After breakfast Steinmetz withdrew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Paul, “shall I show you the old place, you and Maggie?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta signified her readiness, but Maggie said that she had letters to write, that Etta could show her the castle another time, when the men were out shooting, perhaps.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But,” said Etta, “I shall do it horribly badly. They are not my ancestors, you know. I shall attach the stories to the wrong people, and locate the ghost in the wrong room. You will be wise to take Paul’s guidance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you,” replied Maggie, quite firmly and frankly. “I feel inclined to write; and the feeling is rare, so I must take advantage of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl looked at her cousin with something in her honest blue eyes that almost amounted to wonder. Etta was always surprising her. There was a whole gamut of feeling, an octave of callow, half-formed girlish instincts, of which Etta seemed to be deprived. If she had ever had them, no trace was left of their whilom presence. At first Maggie had flatly refused to come to Russia. When Paul pressed her to do so, she accepted with a sort of wonder. There was something which she did not understand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The same instinct made her refuse now to accompany Paul and Etta over their new home. Again Etta pressed her, showing her lack of some feeling which Maggie indefinitely knew she ought to have had. This time Paul made no sign. He added no word to Etta’s persuasions, but stood gravely looking at his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the door had closed behind them, Maggie stood for some minutes by the window looking out over the snow-clad plain, the rugged, broken rocks beneath her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she turned to the writing-table. She resolutely took pen and paper, but the least thing seemed to distract her attention—the coronet on the note-paper cost her five minutes of far-off reflection. She took up the pen again, and wrote “Dear Mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The room grew darker. Maggie looked up. The snow had begun again. It was driving past the window with a silent, purposeful monotony. The girl drew the writing-case toward her. She examined the pen critically and dipped it into the ink. But she added nothing to the two words already written.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The castle of Osterno is almost unique in the particular that one roof covers the ancient and the modern buildings. The vast reception-rooms, worthy of the name of state-rooms, adjoin the small stone-built apartments of the fortress which Paul’s ancestors held against the Tartars. This grimmer side of the building Paul reserved to the last for reasons of his own, and Etta’s manifest delight in the grandeur of the more modern apartments fully rewarded him. Here, again, that side of her character manifested itself which has already been shown. She was dazzled and exhilarated by the splendor of it all, and the immediate effect was a feeling of affection toward the man to whom this belonged; who was in act, if not in word, laying it at her feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they passed from the lofty rooms to the dimmer passages of the old castle Etta’s spirits visibly dropped, her interest slackened. He told her of tragedies enacted in by-gone times—such ancient tales of violent death and broken hearts as attach themselves to gray stone walls and dungeon keeps. She only half listened, for her mind was busy with the splendors they had left behind, with the purposes to which such splendors could be turned. And the sum total of her thoughts was gratified vanity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her bright presence awakened the gloom of ages within the dimly lit historic rooms. Her laugh sounded strangely light and frivolous and shallow in the silence of the ages which had brooded within these walls since the days of Tamerlane. It was perhaps the greatest tragedy of the Alexis family, this beautiful tragedy that walked by the side of Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad your grandfather brought French architects here and built the modern side,” she said. “These rooms are, of course, very interesting, but gloomy—horribly gloomy, Paul. There is a smell of ghosts and dulness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All the same, I like these rooms,” answered Paul. “Steinmetz and I used to live entirely on this side of the house. This is the smoking-room. We shot those bears, and all the deer. That is a wolf’s head. He killed a keeper before I finished him off.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta looked at her husband with a curious little smile. She sometimes felt proud of him, despite the ever present knowledge that, intellectually speaking, she was his superior. There was something strong and simple and manly in a sort of mediaeval way that pleased her in this big husband of hers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And how did you finish him off?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I choked him. That bear knocked me down, but Steinmetz shot him. We were four days out in the open after that elk. This is a lynx—a queer face—rather like De Chauxville; the dogs killed him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why do you not paper the room,” asked Etta, with a shiver, “instead of this gloomy panelling? It is so mysterious and creepy. Quite suggestive of secret passages.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are no secret passages,” answered Paul. “But there is a room behind here. This is the door. I will show it to you presently. I have things in there I want to show you. I keep all my medicines and appliances in there. It is our secret surgery and office. In that room the Charity League was organized.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta turned away suddenly and went to the narrow window, where she sat on a low window-seat, looking down into the snow-clad depths.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not know you were a doctor,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I doctor the peasants,” replied Paul, “in a rough-and-ready way. I took my degree on purpose. But, of course, they do not know that it is I; they think I am a doctor from Moscow. I put on an old coat, and wear a scarf, so that they cannot see my face. I only go to them at night. It would never do for the Government to know that we attempt to do good to the peasants. We have to keep it a secret even from the people themselves. And they hate us. They groan and hoot when we drive through the village. But they never attempt to do us any harm; they are too much afraid of us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Etta rose and came toward him her face was colorless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me see this room,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened the door and followed her into the apartment, which has already been described. Here he told further somewhat bald details of the work he had attempted to do. It is to be feared that he made neither an interesting nor a romantic story of it. There were too many details—too much statistic, and no thrilling realism whatever. The experiences of a youthful curate in Bethnal Green would have made high tragedy beside the tale that this man told his wife of the land upon which God has assuredly laid His curse—Aceldama, the field of blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta listened, and despite herself she became interested. She was sitting in a chair usually occupied by Steinmetz. There was a faint aroma of tobacco-smoke. The atmosphere of the room was manly and energetic.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul showed her his simple stores of medicine—the old coat saturated with disinfectants which had become the recognized outward sign of the Moscow doctor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And do other people, other noblemen, try to do this sort of thing too?” asked Etta at length.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Catrina Lanovitch does,” replied Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What? The girl with the hair?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Paul. He had never noticed Catrina’s hair. Etta’s appraising eye had seen more in one second than Paul had perceived in twenty years.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he answered. “But, of course, she is handicapped.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By her appearance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; by her circumstances. Her name is sufficient to handicap her every moment in this country. But she does a great deal. She—she found me out, confound her!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Etta had risen; she was looking curiously at the cupboard where Paul’s infected clothes were hanging. He had forbidden her to go near it. She turned and looked at him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Found you out! How?” she asked, with a queer smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Saw through my disguise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—she would do that!” said Etta aloud to herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is this door?” she asked, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It leads to an inner room,” replied Paul, “where Steinmetz usually works.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He passed in front of her and opened the door. As he was doing so Etta went on in the train of her thoughts:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So Catrina knows?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And no one else?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul made no answer; for he had passed on into the smaller room, where Steinmetz was seated at a writing-table.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Except, of course, Herr Steinmetz?” Etta went on interrogatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Madame,” said the German, looking up with his pleasant smile, “I know every thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he went on writing.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2779/76941.html","bookId":1313,"creation":"Aug 5, 2019 12:35:00 PM","modification":"Aug 5, 2019 12:35:00 PM"}
