{"id":23735,"no":2,"title":"THE RISE OF HISTORICAL CRITICISM","content":"\u0026nbsp;This Essay was written for the Chancellor’s English Essay Prize at Oxford in 1879, the subject being ‘Historical Criticism among the Ancients.’ \u0026nbsp;The prize was not awarded. \u0026nbsp;To Professor J. W. Mackail thanks are due for revising the proofs. \n\u003cdiv\u003e\n I\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Historical criticism nowhere occurs as an isolated fact in the civilisation or literature of any people. \u0026nbsp;It is part of that complex working towards freedom which may be described as the revolt against authority. \u0026nbsp;It is merely one facet of that speculative spirit of an innovation, which in the sphere of action produces democracy and revolution, and in that of thought is the parent of philosophy and physical science; and its importance as a factor of progress is based not so much on the results it attains, as on the tone of thought which it represents, and the method by which it works.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Being thus the resultant of forces essentially revolutionary, it is not to be found in the ancient world among the material despotisms of Asia or the stationary civilisation of Egypt. \u0026nbsp;The clay cylinders of Assyria and Babylon, the hieroglyphics of the pyramids, form not history but the material for history.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Chinese annals, ascending as they do to the barbarous forest life of the nation, are marked with a soberness of judgment, a freedom from invention, which is almost unparalleled in the writings of any people; but the protective spirit which is the characteristic of that people proved as fatal to their literature as to their commerce. \u0026nbsp;Free criticism is as unknown as free trade. \u0026nbsp;While as regards the Hindus, their acute, analytical and logical mind is directed rather to grammar, criticism and philosophy than to history or chronology. \u0026nbsp;Indeed, in history their imagination seems to have run wild, legend and fact are so indissolubly mingled together that any attempt to separate them seems vain. \u0026nbsp;If we except the identification of the Greek Sandracottus with the Indian Chandragupta, we have really no clue by which we can test the truth of their writings or examine their method of investigation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is among the Hellenic branch of the Indo-Germanic race that history proper is to be found, as well as the spirit of historical criticism; among that wonderful offshoot of the primitive Aryans, whom we call by the name of Greeks and to whom, as has been well said, we owe all that moves in the world except the blind forces of nature.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For, from the day when they left the chill table-lands of Tibet and journeyed, a nomad people, to ?gean shores, the characteristic of their nature has been the search for light, and the spirit of historical criticism is part of that wonderful Aufkl?rung or illumination of the intellect which seems to have burst on the Greek race like a great flood of light about the sixth century B.C.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n L’esprit d’un siècle ne na?t pas et ne meurt pas à jour fixe, and the first critic is perhaps as difficult to discover as the first man. \u0026nbsp;It is from democracy that the spirit of criticism borrows its intolerance of dogmatic authority, from physical science the alluring analogies of law and order, from philosophy the conception of an essential unity underlying the complex manifestations of phenomena. \u0026nbsp;It appears first rather as a changed attitude of mind than as a principle of research, and its earliest influences are to be found in the sacred writings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For men begin to doubt in questions of religion first, and then in matters of more secular interest; and as regards the nature of the spirit of historical criticism itself in its ultimate development, it is not confined merely to the empirical method of ascertaining whether an event happened or not, but is concerned also with the investigation into the causes of events, the general relations which phenomena of life hold to one another, and in its ultimate development passes into the wider question of the philosophy of history.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, while the workings of historical criticism in these two spheres of sacred and uninspired history are essentially manifestations of the same spirit, yet their methods are so different, the canons of evidence so entirely separate, and the motives in each case so unconnected, that it will be necessary for a clear estimation of the progress of Greek thought, that we should consider these two questions entirely apart from one another. \u0026nbsp;I shall then in both cases take the succession of writers in their chronological order as representing the rational order—not that the succession of time is always the succession of ideas, or that dialectics moves ever in the straight line in which Hegel conceives its advance. \u0026nbsp;In Greek thought, as elsewhere, there are periods of stagnation and apparent retrogression, yet their intellectual development, not merely in the question of historical criticism, but in their art, their poetry and their philosophy, seems so essentially normal, so free from all disturbing external influences, so peculiarly rational, that in following in the footsteps of time we shall really be progressing in the order sanctioned by reason.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2789/77206.html","bookId":552,"creation":"Aug 2, 2019 8:24:04 PM","modification":"Aug 2, 2019 8:24:04 PM"}
