{"id":79698,"no":10,"title":"Page 10","content":"\u003cp\u003eHe wondered if Hannah would be impressed.\u003c/p\u003e\n\u003cp\u003eThe crimson vehicle came to a halt next to his silver Porsche. An intense rush of anticipation swept through him. He watched the door on the driver’s side of the Honda open.\u003c/p\u003e\n\u003cp\u003eThe first thing he noticed when Hannah got out of the car was that her amber-brown hair was shorter. Eight years ago it had fallen well below her shoulders. Today it was cut in a sleek, sophisticated curve that angled along the line of her jaw.\u003c/p\u003e\n\u003cp\u003eShe didn’t look as if she had gained any weight in the intervening years, but there was something different about her figure. The black trousers and snug-fitting black top she wore revealed a fit, lithe body with a small waist, gently flared hips, and discreetly curved br**sts. It took him a few seconds to decide that the difference was the sophisticated confidence with which she carried herself. She had seemed painfully young and naïve that night on the beach. Still a girl in some ways. She was a woman now.\u003c/p\u003e\n\u003cp\u003eShe paused, holding the car door open, and leaned down slightly to speak to someone in the front seat. From his vantage point on the upper veranda he could not see who had accompanied her. Sharp disappointment gripped him. For some reason he had assumed that she would be alone. What the hell had he expected? He’d heard that her engagement had blown up a year ago, but that was no reason to think she hadn’t gotten serious about someone else in the meantime.\u003c/p\u003e\n\u003cp\u003eThe passenger door did not open. Instead, Hannah stepped back to allow an elegantly trimmed gray Schnauzer to bound out of the car.\u003c/p\u003e\n\u003cp\u003eRelief whipped through Rafe. Not a boyfriend, after all. Just a mutt. He could handle a dog.\u003c/p\u003e\n\u003cp\u003eSensing Rafe’s presence on the veranda, the Schnauzer came to a sudden halt and looked up at him. Rafe waited for the little beast to start yapping wildly in typical froufrou-dog style. But the Schnauzer did not bark. Instead, he gazed up at Rafe with an air of watchful stillness.\u003c/p\u003e\n\u003cp\u003eOkay, so maybe this was not a totally froufrou dog.\u003c/p\u003e\n\u003cp\u003eHannah looked up to see what had captured her dog’s attention. The light of the late-afternoon sun glinted on her stylish sunglasses.\u003c/p\u003e\n\u003cp\u003e“Hello, Rafe.”\u003c/p\u003e\n\u003cp\u003eThat cool reserve hadn’t been in her voice eight years ago, he thought.\u003c/p\u003e\n\u003cp\u003e“Been a while,” he said neutrally.\u003c/p\u003e\n\u003cp\u003e“Yes, it has,” she said. “I’ve been wondering, did you ever get a life?”\u003c/p\u003e\n\u003cp\u003e“Depends on your definition. What about you? The five-year plan turn out the way you expected?”\u003c/p\u003e\n\u003cp\u003e“Not exactly.” She moved one hand in a graceful gesture to indicate the big house. “You’re going to be difficult about his, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Had a feeling you would.”\u003c/p\u003e\n\u003cp\u003eShe went up the front steps and disappeared into the house. The Schnauzer gave Rafe one last, assessing look and followed Hannah inside.\u003c/p\u003e\n\u003cp\u003eHe found her standing in the solarium, arms folded beneath her br**sts. She smiled coolly, but her shoulders were angled. She was braced for battle. When Rafe walked into the glass-walled room, the Schnauzer glanced up from an exploration of a potted palm.\u003c/p\u003e\n\u003cp\u003e“Nice dog.” Rafe crouched and held out his hand.\u003c/p\u003e\n\u003cp\u003e“His name is Winston,” Hannah said crisply.\u003c/p\u003e\n\u003cp\u003e“Hello, Winston.”\u003c/p\u003e\n\u003cp\u003eWith great dignity, the Schnauzer crossed the tiled floor to where Rafe waited and sniffed politely. Apparently satisfied that the proprieties had been observed, he sat back on his haunches and looked up at Hannah.\u003c/p\u003e\n\u003cp\u003eRafe got to his feet. “I think your dog likes me.”\u003c/p\u003e\n\u003cp\u003eShe did not look pleased. “Winston is always well behaved. I wouldn’t read too much into it if I were you.”\u003c/p\u003e\n\u003cp\u003e“Right. Maybe he’s waiting until my back is turned to go for my throat. How long have you had him?”\u003c/p\u003e\n\u003cp\u003e“A couple of years.”\u003c/p\u003e\n\u003cp\u003eRafe nodded. “Outlasted your fiancé, huh? Lucky dog.”\u003c/p\u003e\n\u003cp\u003eHer mouth tightened. “I’m not here to talk about Winston or my ex-fiancé.”\u003c/p\u003e\n\u003cp\u003e“Whatever. Want some coffee?”\u003c/p\u003e\n\u003cp\u003eShe hesitated. “All right.”\u003c/p\u003e\n\u003cp\u003e“Don’t fall all over yourself.”\u003c/p\u003e\n\u003cp\u003eShe trailed after him down the hall into the big, old-fashioned kitchen. Winston trotted briskly at her heels, pausing here and there to investigate a corner or a piece of furniture.\u003c/p\u003e\n\u003cp\u003e“How did you hear about my engagement?” Hannah asked. Irritation made the question as brittle as thin ice.\u003c/p\u003e\n\u003cp\u003e“You know how gossip travels between the Hartes and the Madisons.”\u003c/p\u003e\n\u003cp\u003e“In other words, Aunt Isabel told you.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He set the kettle on the stove. “Sent me a note right after the breakup. She seemed delighted. Guess Mr. Right fell a little short in her view.”\u003c/p\u003e\n\u003cp\u003eHannah watched him intently. “How long have you been here at Dreamscape?”\u003c/p\u003e\n\u003cp\u003e“Got in late last night.” He spooned coffee into the tall glass pot.\u003c/p\u003e\n\u003cp\u003eShe glanced at the French press coffeemaker he was using. “Isabel never made her coffee in one of those. She always used a regular drip machine.”\u003c/p\u003e\n\u003cp\u003e“This is mine. I brought it with me.”\u003c/p\u003e\n\u003cp\u003e“I see.” She eyed the gleaming stainless-steel vegetable steamer on the counter. “That’s not Isabel’s either.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eFrowning, she walked to the pantry and opened the door. He knew what she saw inside. The supplies he had brought with him included several boxes of his favorite brand of dried pasta in a variety of shapes, a bottle of twelve-year-old balsamic vinegar, and a package of capers preserved in salt. There was also a supply of dried herbs and chiles and some French lentils.\u003c/p\u003e\n\u003cp\u003eHannah closed the pantry door very firmly. “You’ve certainly made yourself right at home.”\u003c/p\u003e\n\u003cp\u003e“Why not? Half this place is mine now.”\u003c/p\u003e\n\u003cp\u003e“Lillian was right,” she said tightly. “I can’t imagine what Isabel was thinking when she made out her will.”\u003c/p\u003e\n\u003cp\u003eHe poured boiling water into the pot. “You know damn well what she was thinking.”\u003c/p\u003e\n\u003cp\u003e“Romeo and Juliet.”\u003c/p\u003e\n\u003cp\u003eHe set the kettle down. “With a more upbeat ending.”\u003c/p\u003e\n\u003cp\u003e“I am prepared to make you a fair-market offer for your share of Dreamscape.”\u003c/p\u003e\n\u003cp\u003e“Forget it.” He smiled slightly. “I’m not interested.”\u003c/p\u003e\n\u003cp\u003eShe met his gaze across the width of the kitchen. There was steel in her eyes. “Do you intend to make me an offer for my half?”\u003c/p\u003e\n\u003cp\u003eHe lounged against the counter. “Are you open to one?”\u003c/p\u003e\n\u003cp\u003e“No. I have plans for Dreamscape.”\u003c/p\u003e\n\u003cp\u003e“What a coincidence. So do I.”\u003c/p\u003e\n\u003cp\u003eShe gave him a speculative look. “Looks like we have a problem.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-10.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
