{"id":79702,"no":14,"title":"Page 14","content":"\u003cp\u003eShe was halfway back to the Porsche when, to her astonishment, Rafe gave her a cool, arrogant smile. Very deliberately he uncrossed his arms and reached out to scratch Winston behind the ears.\u003c/p\u003e\n\u003cp\u003eIt was glaringly evident that Winston did not object. Hannah saw a pink tongue emerge to lick Rafe’s hand. Irritation shot through her. Winston never got chummy with strangers, especially male strangers. Winston had standards.\u003c/p\u003e\n\u003cp\u003eSomehow, during the short time that she had been inside the grocery store, Rafe had co-opted her dog.\u003c/p\u003e\n\u003cp\u003e“Uh-oh.”\u003c/p\u003e\n\u003cp\u003eShe quickened her steps, so intent on the spectacle of Winston and Rafe’s buddy-bonding that she never saw the big man who had climbed out of a battered pickup until he was directly in her path.\u003c/p\u003e\n\u003cp\u003e“Heard you and Madison were back in town,” Dell Sadler said. “Come back to screw on the beach for old times’ sake?”\u003c/p\u003e\n\u003cp\u003eHannah skidded to a halt, barely avoiding a collision. But the abrupt stop sent a shudder through her that dislodged her grip on one of the grocery sacks, and it slipped out of her grasp. She heard an ominously squishy thud. The tomatoes, she thought. Luckily the eggs were in the other bag.\u003c/p\u003e\n\u003cp\u003e“Hello, Dell,” she said quietly.\u003c/p\u003e\n\u003cp\u003eShe knew very little about Dell Sadler other than that he operated a towing service and a body shop on the outskirts of Eclipse Bay. He was a heavily built man in his late thirties with thinning hair and beefy hands. There had always been a grim, morose air about him, as though he had found life to be a serious disappointment and did not expect matters to improve.\u003c/p\u003e\n\u003cp\u003e“You two got a lot of gall coming back here after what you did.”\u003c/p\u003e\n\u003cp\u003e“If you’ll excuse me, Dell—”\u003c/p\u003e\n\u003cp\u003eHe stepped toward her, hands balled into fists. “Think I’d be gone by now? Or that I’d forget what happened to Kaitlin? Or don’t you even give a damn?”\u003c/p\u003e\n\u003cp\u003e“This isn’t a good place to talk.” With an effort she kept her voice calm and soothing. “Maybe some other time.”\u003c/p\u003e\n\u003cp\u003e“Just because everyone else in this town bought that story about you and Rafe Madison getting it on at the beach the night my sister died, don’t think I did. I know damn well he killed her and you lied for him.”\u003c/p\u003e\n\u003cp\u003e“That’s not true, and I think that deep down inside you know it.” Hannah took a cautious step back, preparing to dart around him. “Please get out of my way.”\u003c/p\u003e\n\u003cp\u003eHe thrust his face forward, raised a hand, and stabbed a finger at her chest. “Don’t you tell me what to do. Maybe everyone else around here kowtows to you Hartes, but I sure as hell don’t. Far as I’m concerned, you and Madison are both scum.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry about what happened to Kaitlin,” Hannah said. “Everyone was. But I promise you, Rafe had nothing to do with it.”\u003c/p\u003e\n\u003cp\u003e“He must have screwed you silly to get you to cover for him the way you did.”\u003c/p\u003e\n\u003cp\u003e“Stop it.”\u003c/p\u003e\n\u003cp\u003e“I hear you’re back in town on account of that big house. Word is Madison wants the whole place for himself. Probably thinks if he does you long enough and hard enough, you’ll turn over your share.”\u003c/p\u003e\n\u003cp\u003eHannah retreated again, clutching her one remaining sack of groceries. She came up hard against the unyielding fender of a big SUV. Dell closed in on her.\u003c/p\u003e\n\u003cp\u003e“Get out of my way,” she said very steadily, preparing to make a run for Rafe’s car.\u003c/p\u003e\n\u003cp\u003e“When I’m good and ready. I want you to know something. I won’t ever—”\u003c/p\u003e\n\u003cp\u003eDell broke into a yelp as a hand locked on his shoulder from behind.\u003c/p\u003e\n\u003cp\u003eRafe used the grip to spin Sadler neatly out of Hannah’s path. With seemingly little effort, he pinned the big man to the door of the pickup.\u003c/p\u003e\n\u003cp\u003eSimultaneously, Hannah heard a low, fierce growl. She glanced down and saw Winston. The Schnauzer stood braced in front of Dell Sadler.\u003c/p\u003e\n\u003cp\u003e“She asked you to get out of the way, Sadler,” Rafe said in a very soft voice.\u003c/p\u003e\n\u003cp\u003e“Screw you, you sonofabitch. You killed Kaitlin, I know you did.”\u003c/p\u003e\n\u003cp\u003e“I didn’t kill Kaitlin. I had no reason to kill her. If you ever decide you want to talk about it, come and see me. But don’t bother Hannah again. She had nothing to do with what happened to your sister.”\u003c/p\u003e\n\u003cp\u003eDell scowled. “Take your hands off me, you bastard.”\u003c/p\u003e\n\u003cp\u003eRafe shrugged, released him, and stepped back. He scooped up the sack of groceries that Hannah had dropped and took her arm.\u003c/p\u003e\n\u003cp\u003e“Let’s go,” he said.\u003c/p\u003e\n\u003cp\u003eShe did not argue. They walked quickly back to the Porsche, Winston marching beside them. When Rafe opened the door, the Schnauzer jumped into the small space behind the seats. He kept his nose close to Hannah as Rafe switched on the ignition.\u003c/p\u003e\n\u003cp\u003eHannah was acutely aware of several curious onlookers. “That little scene will keep tongues wagging for a day or two.”\u003c/p\u003e\n\u003cp\u003eRafe drove out of the small lot onto Bayview Drive. “Told you we’d give the folks a thrill.”\u003c/p\u003e\n\u003cp\u003eA short silence fell. Hannah opened her purse and found her sunglasses. She put them on. Winston licked her ear. She stroked him soothingly.\u003c/p\u003e\n\u003cp\u003e“Two-timer,” she muttered. “I saw you licking Rafe’s hand earlier.”\u003c/p\u003e\n\u003cp\u003eWinston rested his chin on her shoulder and sighed in content.\u003c/p\u003e\n\u003cp\u003e“Your dog and I decided not to duel at dawn after all,” Rafe said.\u003c/p\u003e\n\u003cp\u003e“You both chickened out?”\u003c/p\u003e\n\u003cp\u003e“We prefer to think of it as a negotiated settlement.”\u003c/p\u003e\n\u003cp\u003e“Huh. Translated, I think that means that neither of you was willing to exert yourself to do battle in my honor.”\u003c/p\u003e\n\u003cp\u003eRafe glanced at her, his gaze unreadable behind the shield of his sunglasses. “When a guy reaches a certain age, he has to pick and choose his battles. I think it’s called getting smart.”\u003c/p\u003e\n\u003cp\u003e“Excuses, excuses.” She peeked into the sack that had landed on the pavement. As she had suspected, the tomatoes were little more than pulp inside the plastic vegetable bag. The lettuce and mushrooms looked badly bruised too. “So much for dinner.”\u003c/p\u003e\n\u003cp\u003eRafe said nothing for a moment. He drove with easy skill, but he seemed to be concentrating on the road with an unnecessary degree of attention.\u003c/p\u003e\n\u003cp\u003e“Got an idea,” he said after a while.\u003c/p\u003e\n\u003cp\u003e“I’m listening.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you and Winston eat at my place tonight? I’ve got plenty of food.”\u003c/p\u003e\n\u003cp\u003eAnother overture? Maybe he really was weakening. She tried not to look too eager.\u003c/p\u003e\n\u003cp\u003e“Seeing as how there isn’t much that’s very exciting in the other sack of groceries, I believe I can speak for both Winston and myself when I say that we’d be pleased to take you up on that offer.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-14.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
