{"id":79703,"no":15,"title":"Page 15","content":"\u003cp\u003e“Okay. Fine. It’s settled.”\u003c/p\u003e\n\u003cp\u003eShe watched him out of the corner of her eye. “You appeared to have some hesitation in putting forth your invitation. Was it such a big deal to ask me over to dinner?”\u003c/p\u003e\n\u003cp\u003eHe flexed his hands on the chunky steering wheel. “Had to work up my courage.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“I was afraid you’d turn me down.”\u003c/p\u003e\n\u003cp\u003e“Why would I do that?” She gave what she hoped was a very blasé sort of shrug. “We’ve got to talk about our mutual business problem sooner or later. Might as well be tonight.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t planning to talk about the house tonight.”\u003c/p\u003e\n\u003cp\u003eShe stilled. “What do you plan to discuss?”\u003c/p\u003e\n\u003cp\u003e“Old times, maybe?”\u003c/p\u003e\n\u003cp\u003eShe contemplated that for a moment. Then she gently cleared her throat. “You and I have only one incident between us that could conceivably be classified as old times.”\u003c/p\u003e\n\u003cp\u003e“True. But you’ve got to admit it was a hell of an incident. I could have gone to jail if it hadn’t been for you. That would have really messed up my big career plan. I told you that day I called to say good-bye that I owed you.”\u003c/p\u003e\n\u003cp\u003e“Still feel that way?” She smiled sweetly. “Sell me your half of the house and we’ll call it even.”\u003c/p\u003e\n\u003cp\u003e“Not feeling quite that grateful,” he said.\u003c/p\u003e\n\u003cp\u003eRafe walked back into the solarium just as the September sky finally faded all the way to black. Hannah noticed that he did not turn on any lights. Winston, flat on his belly on the floor, looked up hopefully but lost interest when he saw the two snifters Rafe carried.\u003c/p\u003e\n\u003cp\u003eRafe lowered himself into the wicker lounger next to Hannah and handed one of the glasses to her.\u003c/p\u003e\n\u003cp\u003eShe watched the darkness settle over the bay and thought about the arugula, beet, blue cheese, and walnut salad and the pasta she had just finished. Rafe had glazed the walnuts with a little sugar and salt and heated them in the oven before adding them to the salad. The pasta had been flavored with an incredibly rich truffle-infused olive oil. A taste of heaven.\u003c/p\u003e\n\u003cp\u003e“Okay, so you can cook,” she said.\u003c/p\u003e\n\u003cp\u003e“Man’s gotta have a hobby.”\u003c/p\u003e\n\u003cp\u003e“I’m with you on that.” She took a sip of brandy. “For the record, you can fix dinner for me anytime.”\u003c/p\u003e\n\u003cp\u003e“Thanks. I’ll remember that.” He cradled his snifter in both hands and gazed out the windows into the deepening night. “Sorry about that scene with Dell Sadler this afternoon.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t your fault.”\u003c/p\u003e\n\u003cp\u003e“Depends how you look at the situation, I think. If you hadn’t been with me the night Kaitlin died, you wouldn’t have had the run-in with Sadler today.”\u003c/p\u003e\n\u003cp\u003e“Well, there is that.” She was very conscious of him sitting there, not more than a few inches away. The darkness intensified the sense of intimacy. “About that night—”\u003c/p\u003e\n\u003cp\u003eHe took a sip of brandy and waited.\u003c/p\u003e\n\u003cp\u003e“We never really talked about it.” She drew a breath and took the plunge. “You knew Kaitlin as well as anyone. What do you think happened? Do you think she committed suicide? Or was it an accident?”\u003c/p\u003e\n\u003cp\u003eHe was quiet for a long time. “I’m almost positive that she did not jump.”\u003c/p\u003e\n\u003cp\u003e“What makes you so sure?”\u003c/p\u003e\n\u003cp\u003eHe studied the brandy glass in his hands. “When she kicked me out of her car that night she was pissed as hell. She was angry, not depressed or desperate.”\u003c/p\u003e\n\u003cp\u003e“How angry?”\u003c/p\u003e\n\u003cp\u003eHe tilted his head against the back of the lounger. “Very. Said she’d had it with Eclipse Bay and everyone in it. Said she couldn’t wait to blow this burg.”\u003c/p\u003e\n\u003cp\u003e“Making plans for the future.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So her death must have been an accident.”\u003c/p\u003e\n\u003cp\u003eRafe said nothing.\u003c/p\u003e\n\u003cp\u003eHannah cleared her throat. “I said, her death must have been an accident.”\u003c/p\u003e\n\u003cp\u003e“That’s certainly the most convenient explanation for all concerned.”\u003c/p\u003e\n\u003cp\u003eShock held Hannah absolutely still for a few seconds. She finally found her breath and let it out very deliberately. “You want to elaborate on that?”\u003c/p\u003e\n\u003cp\u003e“No point.” Rafe sipped his brandy. “Not now.”\u003c/p\u003e\n\u003cp\u003e“You’re probably right. I guess we’ll never know what really happened that night.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eRafe was quiet for a while. She had the feeling that he had moved onto some other subject in his mind. Whatever it was, he did not seem to be inclined to discuss it, either.\u003c/p\u003e\n\u003cp\u003eShe tried not to be so acutely aware of him reclining there so close beside her, but it was hopeless. Probably time to go home, she thought. Make that definitely. She was about to mention that it was getting late when Rafe spoke.\u003c/p\u003e\n\u003cp\u003e“Somthing I’ve been meaning to ask you.”\u003c/p\u003e\n\u003cp\u003e“Umm?”\u003c/p\u003e\n\u003cp\u003e“What went wrong with Mr. Right?”\u003c/p\u003e\n\u003cp\u003eFor some reason that was the last question she had expected. She hesitated, not certain how far she wanted to go down that particular road.\u003c/p\u003e\n\u003cp\u003e“It didn’t work out. What about you?” she added quickly to change the subject. “Heard you got married.”\u003c/p\u003e\n\u003cp\u003e“For a while.”\u003c/p\u003e\n\u003cp\u003e“What went wrong?”\u003c/p\u003e\n\u003cp\u003e“I told you that the men in my family aren’t real good at marriage,” he said.\u003c/p\u003e\n\u003cp\u003e“As I recall, I told you that was an excuse.”\u003c/p\u003e\n\u003cp\u003eWithout warning, Rafe sat up on the edge of the lounger and rested his forearms on his knees. “Mitchell called today.”\u003c/p\u003e\n\u003cp\u003eHannah blinked. He could switch topics quickly, too. “Your grandfather?”\u003c/p\u003e\n\u003cp\u003e“He wants me to come to dinner tomorrow night. Octavia Brightwell will be there. Says he wants me to meet her.”\u003c/p\u003e\n\u003cp\u003eHannah thought quickly. “Brightwell. The owner of that new art gallery near the pier?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Rafe set his glass down on the table. “Apparently they’re involved, so to speak.”\u003c/p\u003e\n\u003cp\u003e“Good grief. I saw her on the street the other day. She’s young enough to be his granddaughter.”\u003c/p\u003e\n\u003cp\u003e“So I’m told.” He met her eyes in the shadows. “The thing is, I need a date.”\u003c/p\u003e\n\u003cp\u003eShe nearly fell out of the lounger. “You want me to go to dinner at Mitchell Madison’s house?”\u003c/p\u003e\n\u003cp\u003e“Got anything better to do?”\u003c/p\u003e\n\u003cp\u003e“Well, gee, when you put it like that, I guess not. As you once observed so pithily, the entertainment options in Eclipse Bay are somewhat limited.” She paused. “Your grandfather won’t be exactly thrilled to see you walk into the house with a Harte.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. He’ll be on his best behavior because of his new girlfriend.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-15.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
