{"id":79708,"no":20,"title":"Page 20","content":"\u003cp\u003eRafe deepened the kiss with slow deliberation.\u003c/p\u003e\n\u003cp\u003eThe stuff of teenage fantasies, she thought. Except that no teenager could have appreciated just how good the kiss really was. Only an adult woman who had learned the hard way that real life was seldom this great could savor the finer points and the little nuances here.\u003c/p\u003e\n\u003cp\u003eRafe crowded her gently up against the counter. She could feel the unmistakable shape of his erection pressed against her thigh.\u003c/p\u003e\n\u003cp\u003eOkay, so not all of the nuances here were little.\u003c/p\u003e\n\u003cp\u003eHis mouth slanted across hers. He drew his palms down her throat and covered her br**sts. A great urgency went through her. With an effort, she managed to let go of the counter edge. She heard him say something that probably would have gotten him arrested if he had said it in public. He made no effort to conceal his hunger. The knowledge that he wanted her played havoc with the last shreds of her common sense.\u003c/p\u003e\n\u003cp\u003eJust a kiss, she thought. How much damage could one kiss do?\u003c/p\u003e\n\u003cp\u003eShe heard someone moan softly. Probably her, she decided. Not real cool. It was only a kiss, after all. But at the moment she did not care if she was demonstrating a distinct lack of worldly sophistication. The only thing that mattered was getting her arms around Rafe’s neck.\u003c/p\u003e\n\u003cp\u003eThe instant she achieved her goal she heard a husky groan. Not her this time. Rafe.\u003c/p\u003e\n\u003cp\u003eHis hands tightened abruptly. She could feel his control slipping away. She wondered if he was aware of it. Then she wondered what she would do if it vanished altogether. Would she care? Should she care?\u003c/p\u003e\n\u003cp\u003eThe world tilted on its axis. She realized vaguely that Rafe had scooped her up into his arms. A shiver went through her.\u003c/p\u003e\n\u003cp\u003eHe paused briefly to switch off the lights. Then he carried her out of the kitchen into the living room. There he put her down on the aging sofa and lowered himself on top of her. His lips went to her throat. She could have sworn she felt his teeth. Another zinging thrill shot through her. She was shivering now. The weight of his body crushed her into the cushions.\u003c/p\u003e\n\u003cp\u003eAt the sound of dog claws scratching on wood, she opened her eyes for a split second. In the shadows she caught a glimpse of Winston hurrying up the stairs to the second floor. Embarrassed by the unseemly behavior taking place on the sofa, no doubt.\u003c/p\u003e\n\u003cp\u003eShe ought to be embarrassed too, she thought. And maybe she would be. Later.\u003c/p\u003e\n\u003cp\u003eIn the meantime, her body was singing a fascinating melody. She had caught a few chords of this particular tune from time to time over the years, but she had never experienced the grand finale.\u003c/p\u003e\n\u003cp\u003eShe felt one of Rafe’s hands slide beneath her sweater. The clasp of her bra dissolved at his touch. When his thumb lightly touched her nipple she almost screamed. It was as though every inch of her had been sensitized. She was in some never-never land where the line between acute pleasure and pain was murky.\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking all day that it would be like this,” Rafe muttered into the curve of her shoulder. “I was going crazy waiting to find out.”\u003c/p\u003e\n\u003cp\u003eHis hand moved over the curve of her hip. She felt his fingers on the zipper of her slacks. Things were moving swiftly. Much too swiftly. But she could not seem to summon up a lot of good reasons for calling a halt.\u003c/p\u003e\n\u003cp\u003eShe heard Winston on the stairs again. For some reason the knowledge that her dog had returned to the scene cleared some of the fog from her brain.\u003c/p\u003e\n\u003cp\u003e“I think this is far enough,” she managed to get out.\u003c/p\u003e\n\u003cp\u003e“Not nearly.” Rafe peeled up the edge of her sweater and kissed one of her br**sts. “I’ve been wanting you since you got here.”\u003c/p\u003e\n\u003cp\u003e“That’s nice.”\u003c/p\u003e\n\u003cp\u003eHe went very still. Then he raised his head and looked down at her with gleaming eyes. “Nice?”\u003c/p\u003e\n\u003cp\u003e“I’m flattered. Honest.”\u003c/p\u003e\n\u003cp\u003e“Flattered,” he repeated carefully. “Great. Flattered. Shit.”\u003c/p\u003e\n\u003cp\u003eShe swallowed. “I don’t want you to think I’m a prude, or anything, but—”\u003c/p\u003e\n\u003cp\u003e“But you’re still Miss Goody Two-Shoes, is that it?”\u003c/p\u003e\n\u003cp\u003e“Not exactly.” She was starting to grow annoyed. “It’s just that in a lot of ways you and I are strangers.”\u003c/p\u003e\n\u003cp\u003e“You’re a Harte. I’m a Madison. The way I look at it, we’ve known each other most of our lives.”\u003c/p\u003e\n\u003cp\u003eShe blinked. “That’s certainly an interesting viewpoint. Maybe it’s even true in certain ways. But something of an oversimplification, don’t you think?”\u003c/p\u003e\n\u003cp\u003e“Do you always talk like this on a date?”\u003c/p\u003e\n\u003cp\u003e“That wasn’t a date we had tonight. I did you a favor.”\u003c/p\u003e\n\u003cp\u003eHis smile was infinitely slow, infinitely seductive. “Well, in that case, allow me to repay it.” He started to lower his mouth to hers once more.\u003c/p\u003e\n\u003cp\u003eShe braced her hands on his shoulders to stop him. “My point—”\u003c/p\u003e\n\u003cp\u003eHe gave her a look of polite surprise. “You mean you’ve actually got one?”\u003c/p\u003e\n\u003cp\u003e“My point,” she continued grimly, “is that, although we’ve known of each other’s existence most of our lives, it’s stretching things to imply that we’ve been anything more than distant acquaintances. I still say we’re strangers as far as this kind of thing is concerned.”\u003c/p\u003e\n\u003cp\u003e“Shush.” He covered her mouth with the palm of his hand.\u003c/p\u003e\n\u003cp\u003e“Mmmph?” Outraged, she grabbed his wrist and tried to yank his hand away from her lips.\u003c/p\u003e\n\u003cp\u003eShe was so intent on telling him in no uncertain terms that she did not find this kind of stuff a turn-on that it took her a few seconds to realize he was not paying any attention to her. She finally noticed that he was lying much too still, his head turned toward the front door.\u003c/p\u003e\n\u003cp\u003eShe heard a very soft whine. Winston was standing at the door again, just as he had done last night. His alert, watchful tension radiated clear across the room.\u003c/p\u003e\n\u003cp\u003e“He hears something.” Rafe took his hand away from Hannah’s mouth. He kept his eyes on the dog as he sat up on the edge of the sofa.\u003c/p\u003e\n\u003cp\u003e“Probably an animal prowling for garbage.” Hannah hastily pulled her clothing back into place. “A skunk, maybe. Or cats.”\u003c/p\u003e\n\u003cp\u003e“Probably.” Rafe watched Winston intently.\u003c/p\u003e\n\u003cp\u003eHannah sat up slowly. “He did this last night, too.”\u003c/p\u003e\n\u003cp\u003eRafe got to his feet and crossed the room to where Winston vibrated at the door. He halted at the window and pulled aside the curtain. “Fog’s so thick now you can’t see past the edge of the porch.”\u003c/p\u003e\n\u003cp\u003eWinston whined softly. He glanced at Rafe and then at the door and then back at Rafe. The message was clear. He wanted to go outside to investigate.\u003c/p\u003e\n\u003cp\u003eA cold chill went through Hannah. It was the same disturbing sensation she’d experienced last night. \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-20.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
