{"id":79715,"no":27,"title":"Page 27","content":"\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“He’s still a jerk,” Rafe said.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eA speculative look gleamed in his eyes. “Are you serious about going to that political reception?”\u003c/p\u003e\n\u003cp\u003e“Very serious. Luckily I packed a black dress and a pair of heels. There’s just one more thing I need.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” Rafe looked at her. “What’s that?”\u003c/p\u003e\n\u003cp\u003e“A date.”\u003c/p\u003e\n\u003cp\u003e“I got the impression that Decatur thinks he’s going to be your date for the evening.”\u003c/p\u003e\n\u003cp\u003e“He couldn’t even be bothered to pick me up. I don’t count that as a date.”\u003c/p\u003e\n\u003cp\u003e“Got someone else in mind?”\u003c/p\u003e\n\u003cp\u003eShe gave him her brightest smile. “I figure you owe me.”\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003e“What caused the feud?” Octavia asked after a while.\u003c/p\u003e\n\u003cp\u003eMitchell paused in the process of removing dead blooms from the rosebushes. “A woman. What else?”\u003c/p\u003e\n\u003cp\u003eOctavia folded her arms on top of the fence and rested her chin on her hands. She watched him nip off another faded flower. “What was her name?”\u003c/p\u003e\n\u003cp\u003e“Her name was Claudia Banner.”\u003c/p\u003e\n\u003cp\u003e“Was she very beautiful?”\u003c/p\u003e\n\u003cp\u003eMitchell opened his mouth to say yes, but then he hesitated, thinking back through the years to his first impression of Claudia. “She was fascinating,” he said finally. “I couldn’t take my eyes off her. But I never really thought of her as beautiful. I just knew that I wanted her so badly that nothing else mattered. Unfortunately, my partner, Sullivan, wanted her too. For a while.”\u003c/p\u003e\n\u003cp\u003e“What do you mean, for a while?”\u003c/p\u003e\n\u003cp\u003eMitchell snorted softly. “Sullivan Harte was always too logical and too coolheaded to let himself be led around by his balls for long. He figured out what Claudia was up to long before I did. I refused to believe him. We fought. End of story.”\u003c/p\u003e\n\u003cp\u003e“How did it happen?”\u003c/p\u003e\n\u003cp\u003eMitchell tossed a dead bloom into a sack. “Sullivan and I set up Harte-Madison right after we got out of the army. We had us some mighty big dreams in those days. The plan was simple. We’d pick up a few cheap parking lots in downtown Portland and Seattle and then sit on ’em for as long as it took.”\u003c/p\u003e\n\u003cp\u003e“As long as it took for what?”\u003c/p\u003e\n\u003cp\u003e“For the boom times to come, naturally. We both knew that sooner or later the Northwest cities were going to be important. What with the Pacific Rim trade taking off, property values were bound to skyrocket. We figured that when the time was right, we’d sell the parking lots to developers and make our fortunes. In the meantime, we’d have income off some very low-maintenance properties in the heart of the cities.”\u003c/p\u003e\n\u003cp\u003e“How did Claudia Banner get involved?”\u003c/p\u003e\n\u003cp\u003e“Things started happening faster than we expected. We hired Claudia to help us negotiate the first sale. She’d had experience in that kind of thing, you see. Sullivan and I were novices.”\u003c/p\u003e\n\u003cp\u003e“She did the deal for you?”\u003c/p\u003e\n\u003cp\u003e“Yep.” Mitchell moved on to the next rosebush. “And it was a hell of a deal. Sullivan and I were suddenly rolling in dough. Both richer than we’d ever been in our lives. Couldn’t wait to sell the next parking lot. Claudia found us a buyer right off the bat. More money fell down out of the sky. We were golden. Couldn’t miss.”\u003c/p\u003e\n\u003cp\u003e“What went wrong?”\u003c/p\u003e\n\u003cp\u003e“Somewhere in the middle of the sale of the third lot, a big one in downtown Seattle, Claudia pointed out that Harte-Madison could structure the deal in such a way that we’d be able to keep a stake in the future profits of the office tower that was slated to be built on the site.”\u003c/p\u003e\n\u003cp\u003e“Uh-oh.”\u003c/p\u003e\n\u003cp\u003e“Yep.” Mitchell dropped another dead rose into his sack. “Uh-oh pretty much sums it up. Sullivan and I had financial stars in our eyes. We trusted Claudia. She took us for a ride and then vanished with the company profits on all three parking lots. Harte-Madison got left with a stack of leveraged debt, and the firm was suddenly out of business.”\u003c/p\u003e\n\u003cp\u003e“And you and Sullivan were at each other’s throats,” Octavia mused.\u003c/p\u003e\n\u003cp\u003eMitchell looked at her across the fence, squinting faintly against the weak sun. “I was sure he had somehow seduced Claudia into doing what she did. He figured I was working with her. Sullivan and I cornered each other outside Fulton’s Supermarket one day, and the rest, as they say around these parts, is history.”\u003c/p\u003e\n\u003cp\u003e“Did you love her very much, then?”\u003c/p\u003e\n\u003cp\u003eMitchell shrugged. “She was my passion. Naturally, I made a fool of myself over her. Making fools out of themselves over females is something Madison men do.”\u003c/p\u003e\n\u003cp\u003e“Is she still your passion?”\u003c/p\u003e\n\u003cp\u003eMitchell examined the dead rose he had just pulled off a bush. “I’ll let you in on a little secret. When you find yourself within spitting distance of ninety, you start viewing things from a slightly different perspective. If Claudia Banner walked back into my life today, I’d ask for my money back.”\u003c/p\u003e\n\u003cp\u003e“And that’s all?”\u003c/p\u003e\n\u003cp\u003e“Yep.” He smiled slightly at the dead rose. “That’s all. I’ve got other passions these days. That’s another thing I’ve learned over the years. If he gives himself a chance, even a Madison can develop a little common sense when it comes to his passions.”\u003c/p\u003e\n\u003cp\u003eOctavia was quiet for a while, watching him work. Eventually she stirred. “You know, if you leave some of the dead blooms on the bush you’ll get rose hips. They make a very healthy tonic.”\u003c/p\u003e\n\u003cp\u003e“I can’t stand rose hip tea,” Mitchell said. He snapped off another dead bloom and stuffed it into his sack. “I’ve got some good ten-year-old whiskey I use when I need a tonic.”\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eAt eight-thirty the following evening, Rafe stood with Jed Steadman at the edge of the crowd and watched Hannah dance with Perry Decatur. Decatur, he was pleased to note, did not appear to be enjoying himself.\u003c/p\u003e\n\u003cp\u003eThe whole scene bordered on amusing. Rafe could almost feel sorry for Thornley and his retinue. The reception was ostensibly in the politician’s honor, but most of the guests were too busy sneaking covert glances at Hannah and Rafe to pay much attention to Thornley. That was due to the fact that most of those present were locals, including the mayor and his wife, all of the members of the town council, and the owners of several Eclipse Bay businesses.\u003c/p\u003e\n\u003cp\u003eRafe recognized a lot of faces. He knew that the majority of these people had been around long enough to be familiar with the legend of the famous Harte-Madison feud, and virtually all of them had been living in Eclipse Bay eight years ago when Hannah had provided him with his alibi for the night of Kaitlin Sadler’s death. In addition, the entire town was no doubt aware of the terms of Isabel Harte’s will. \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-27.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
