{"id":79729,"no":41,"title":"Page 41","content":"\u003cp\u003e“Whoa,” Rafe said. “Lots of maybes here.”\u003c/p\u003e\n\u003cp\u003eShe made a face and planted her hands on her hips. “You’re right. Got a little carried away there for a minute, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“Imagination is a wonderful thing. But in this case it’s wasted. It’s been eight years. We’ll never know for sure what happened to Kaitlin that night. Like Walter said, that’s probably just as well.”\u003c/p\u003e\n\u003cp\u003eReluctantly she pulled her thoughts back to the matter at hand. The instant she refocused on her chief problem, her irritation returned.\u003c/p\u003e\n\u003cp\u003e“Let’s get something clear here,” she said. “You’re not going to do anything to Dreamscape until you and I have come to some agreement about how to handle the legal aspects of Isabel’s inheritance.”\u003c/p\u003e\n\u003cp\u003eRafe pondered the view of the hall. “I could open the restaurant in my half of the house.”\u003c/p\u003e\n\u003cp\u003e“That’s crazy. There’s no way you can turn half of this place into a restaurant. How would we divide the kitchen? What about all the people who would use my half of this hall to get to your restaurant? And who gets the solarium?”\u003c/p\u003e\n\u003cp\u003e“I thought it would make a nice dining room. In the summer I’ll set up tables outside on the veranda, too.”\u003c/p\u003e\n\u003cp\u003e“Not without my permission, you won’t. Rafe, you just can’t run roughshod over the legal technicalities of this inheritance. We’re talking several hundred thousand dollars worth of mansion here. We have to settle things first. You know that as well as I do.”\u003c/p\u003e\n\u003cp\u003e“Well,” Rafe said a little too casually, “speaking of settling the minor details, I’ve got a suggestion.”\u003c/p\u003e\n\u003cp\u003eSensing danger, she went very still. “What is it?”\u003c/p\u003e\n\u003cp\u003e“How about a partnership?”\u003c/p\u003e\n\u003cp\u003eShe stared at him, momentarily speechless.\u003c/p\u003e\n\u003cp\u003e“You?” she managed at last. “Me? Partners in Dreamscape?”\u003c/p\u003e\n\u003cp\u003e“You don’t think it would work?”\u003c/p\u003e\n\u003cp\u003e“What about last night? Are you just going to pretend it never happened?”\u003c/p\u003e\n\u003cp\u003e“What’s last night got to do with it?”\u003c/p\u003e\n\u003cp\u003eSuddenly she could no longer breathe. “Everything. How can you talk about a business partnership after—” She waved a hand, unable to finish the sentence.\u003c/p\u003e\n\u003cp\u003e“Ah.” Understanding lit his eyes. “You’re worried about us mixing business with pleasure?”\u003c/p\u003e\n\u003cp\u003eThere was a distant ringing in her ears now. Was that all it had been to him? A pleasant interlude? She struggled to regain her composure.\u003c/p\u003e\n\u003cp\u003e“Aren’t you?” she asked in as cold a voice as she could manage.\u003c/p\u003e\n\u003cp\u003e“Well, sure,” he said far too readily. “Naturally I’ll have a problem with it because I’m a Madison. Madisons always have problems when they get their financial affairs mixed up with their sexual affairs. But it shouldn’t be a stretch for you. You’re a Harte. You can compartmentalize.”\u003c/p\u003e\n\u003cp\u003eHe was goading her, she thought. She had to get out of here before she lost it. Hartes did not do that kind of thing. Not in public, at any rate.\u003c/p\u003e\n\u003cp\u003e“You’re right,” she said. “I could probably handle it. But as you just pointed out, you’re a Madison. You’d screw it up for sure.”\u003c/p\u003e\n\u003cp\u003eShe spun on her heel and walked swiftly outside. Winston, ever faithful, trotted out of the kitchen to follow her. Together they went down the front steps without a backward glance.\u003c/p\u003e\n\u003cp\u003eShe yanked open the car door. Winston bounded inside and took up his post on the passenger seat. She got in behind the wheel and slammed the door shut.\u003c/p\u003e\n\u003cp\u003eThe last thing she saw in her rearview mirror was Rafe lounging against the porch railing watching her roar out of the driveway. He had enjoyed seeing her come so close to the edge, she realized. He had deliberately pushed her, just to see what would happen.\u003c/p\u003e\n\u003cp\u003eA wave of uncertainty swept through her. All of her grandfather’s warnings about Madisons flashed through her mind. What kind of game was Rafe playing?\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eRafe brought the Porsche to a halt in the drive, switched off the engine, and sat for a while, staring at the front door of Mitchell’s house.\u003c/p\u003e\n\u003cp\u003eAsking his grandfather to come to dinner was a crazy idea. If he had any sense he would fire up the engine and drive straight back to Dreamscape. But then he would have to explain to Hannah why he had chickened out.\u003c/p\u003e\n\u003cp\u003eThe thought of going through another scene with her after the one that had taken place this morning when she had arrived to find the Willis brothers hard at work was not appealing. He had taken a chance, pushed his luck, and, predictably enough, things had exploded in his face. He would be more cautious next time. Who said a Madison couldn’t learn from his mistakes?\u003c/p\u003e\n\u003cp\u003eHe climbed out from behind the wheel and walked toward the porch steps.\u003c/p\u003e\n\u003cp\u003eThe front door opened just as he raised his hand to knock. A cadaverously thin figure with a buzz cut and a face that looked as if it had been hewn out of the side of a mountain stared at him.\u003c/p\u003e\n\u003cp\u003eBryce had worked for Mitchell for nearly ten years. No one knew where he had come from. He had started out as a part-time handyman and had gradually carved out a position as full-time majordomo. If Bryce had a last name, it had been lost in the mists of time. As far as Rafe knew, he had no close relatives. Bryce had brought order to the chaos of Mitchell’s household. He was unswervingly loyal to his employer. Beyond that, he was a mystery.\u003c/p\u003e\n\u003cp\u003e“Hello, Bryce.”\u003c/p\u003e\n\u003cp\u003e“Good afternoon.”\u003c/p\u003e\n\u003cp\u003e“I’m looking for Mitchell.”\u003c/p\u003e\n\u003cp\u003e“Your grandfather is out in the garden.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eRafe nodded in a friendly manner and walked off down the porch. No point exchanging further pleasantries. Bryce was not one for extended conversations.\u003c/p\u003e\n\u003cp\u003eRafe opened the gate and entered the lush wonderland. When he didn’t see Mitchell, he took the narrow gravel path that led toward the greenhouse at the far end of the garden.\u003c/p\u003e\n\u003cp\u003eHe found his grandfather inside the opaque structure, tending to a tray of plants. Mitchell had a long-spouted watering can in one hand and a small spade in the other.\u003c/p\u003e\n\u003cp\u003eRafe took a breath and stepped into the humid atmosphere of the greenhouse. He recalled Hannah’s comment. Your interest in cooking parallels his in gardening. Creative outlets that you both approach with passion.\u003c/p\u003e\n\u003cp\u003eThe idea of having something in common with Mitchell was a hard concept to digest.\u003c/p\u003e\n\u003cp\u003e“Lookin’ good in here,” he said. He told himself Hannah would have been proud of him for trying to start things off on a civil note. Then again, maybe not. She was pretty pissed at him right now. “You ever think about opening a commercial nursery?” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-41.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
