{"id":79731,"no":43,"title":"Page 43","content":"\u003cp\u003e“I always wondered what a newspaper editor’s office looked like,” Rafe said.\u003c/p\u003e\n\u003cp\u003eJed grinned and leaned back in his chair. “This is what this particular newspaper editor’s office looks like. Have a seat.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Rafe cleared a heap of out-of-town newspapers off a chair and sat down.\u003c/p\u003e\n\u003cp\u003e“Want some coffee?” Jed gripped the arms of his chair as if about to push himself up and out of it. “One thing we’ve got a lot of around here is caffeine. Part of the mystique.”\u003c/p\u003e\n\u003cp\u003e“No, thanks.” Rafe glanced at the computer. The screen showed a page of text. He glimpsed the words. “Thornley stated that he will run for the Senate on a platform that calls for social and personal responsibility.”\u003c/p\u003e\n\u003cp\u003e“You got a one-on-one interview with Trevor Thornley?” Rafe asked.\u003c/p\u003e\n\u003cp\u003e“Did it this morning before he left for Portland. I’m writing an editorial for tomorrow’s edition.”\u003c/p\u003e\n\u003cp\u003eRafe settled back into the chair. “What’s it like talking to a future U.S. senator?”\u003c/p\u003e\n\u003cp\u003e“Not a whole lot different than it was talking to a future member of the state legislature eight years ago. Only he’s much more polished these days. But it’s still tough to get a straight answer out of him.”\u003c/p\u003e\n\u003cp\u003e“Probably why he’s come so far, so fast.”\u003c/p\u003e\n\u003cp\u003e“Probably. Well, like they say, he may be a sonofabitch, but he’s our sonofabitch. I think Eclipse Bay can count on him to remember his roots even when he winds up in Washington, D.C.” Jed propped his elbows on the chair arms and linked his fingers across his small paunch. “What brings you here today?”\u003c/p\u003e\n\u003cp\u003e“Idle curiosity.”\u003c/p\u003e\n\u003cp\u003e“The best kind, I always say. That’s what makes good reporters.” Jed chuckled. “What are you curious about?”\u003c/p\u003e\n\u003cp\u003eRafe steepled his fingers. The decision to pay a visit to the offices of the Eclipse Bay Journal had seemed a spur-of-the-moment thing. He’d been on his way back to Dreamscape when it struck. But now that he thought about it, he realized that it had been nibbling at the back of his mind all morning, ever since Walter and Torrance Willis had voiced their theories about Kaitlin Sadler having been murdered by a sex maniac from Seattle.\u003c/p\u003e\n\u003cp\u003e“I’ve got a favor to ask,” he said. “I want to take a look at some old editions of your paper.”\u003c/p\u003e\n\u003cp\u003eJed’s eyes darkened with sudden interest. “How old?”\u003c/p\u003e\n\u003cp\u003e“Eight years.”\u003c/p\u003e\n\u003cp\u003eJed whistled tunelessly. “Well, I’ll be damned. You want to see the coverage of Kaitlin Sadler’s death, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Is that a problem?”\u003c/p\u003e\n\u003cp\u003e“Hell, no.” Jed’s chair squeaked as he sat forward abruptly. He fixed Rafe with an intent look. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“Nothing. I told you, I’m just curious, that’s all. I didn’t pay any attention to the stories that appeared in the paper at the time. I was too busy trying to keep from getting arrested. As soon as I was cleared, all I wanted to do was get out of town.”\u003c/p\u003e\n\u003cp\u003e“An understandable reaction.” Jed picked up a pen and absently tapped the edge of the computer keyboard. “Sure you’re not looking for something in particular?”\u003c/p\u003e\n\u003cp\u003e“I’m sure.”\u003c/p\u003e\n\u003cp\u003e“Hey, this is your old buddy, Jed Steadman, boy reporter and pool pal, remember? If you’ve got a line on what really happened that night, the least you can do is fill me in.”\u003c/p\u003e\n\u003cp\u003e“Think it would still be news after all this time?”\u003c/p\u003e\n\u003cp\u003eJed raised his eyebrows. “If you’ve got anything to indicate that what happened to Kaitlin was something other than an accident, yes, it sure as hell would be news. No one here has forgotten that incident.” He paused. “We’ve only had one real murder in Eclipse Bay in the past decade, and that was when a couple of tourists got into a quarrel out at the RV park and one of them shot the other.”\u003c/p\u003e\n\u003cp\u003e“I don’t have a line on Kaitlin’s death,” Rafe said swiftly. “Just a couple of questions.”\u003c/p\u003e\n\u003cp\u003e“Such as?” Jed paused ever so briefly. “I hate to remind you, but this is my newspaper now.”\u003c/p\u003e\n\u003cp\u003e“I could try the public library.”\u003c/p\u003e\n\u003cp\u003eJed’s grin came and went. “Yes, you could. All right. I’ve stuck with the agreement.” He got to his feet. “Come on, I’ll dig them out for you. Can’t blame me for trying to find out if you’ve got an angle on that old story, can you?”\u003c/p\u003e\n\u003cp\u003e“Guess not.” Rafe shoved himself up out of the chair and turned to follow Jed through the doorway. “I’ll tell you what I’m looking for, if you’ll promise to keep it quiet.”\u003c/p\u003e\n\u003cp\u003eJed raised one hand as he went down the hall. “Word of honor.”\u003c/p\u003e\n\u003cp\u003e“I want to see if whoever covered the story mentioned the fact that Kaitlin Sadler was seeing someone other than me that summer.”\u003c/p\u003e\n\u003cp\u003eJed came to a halt in another doorway and gave Rafe a quizzical frown. “Everyone knew she was seeing other men. Hell, you knew it. It was no big secret that she was running around.”\u003c/p\u003e\n\u003cp\u003e“I just want to see if the names of any of the other men she dated came up in the course of the investigation.”\u003c/p\u003e\n\u003cp\u003e“Aha.” Jed’s hand tightened on the edge of the doorjamb. He gave Rafe a knowing look. “You want to see if there were any other serious suspects besides yourself, don’t you? What is this? You think maybe one of her other boyfriends really did push her off the cliff that night?”\u003c/p\u003e\n\u003cp\u003e“I haven’t got a single thing to go on here, Jed. I’m curious, that’s all. Are you going to let me see those old papers or not?”\u003c/p\u003e\n\u003cp\u003e“Sorry. Force of habit. Come on, I’ll get you set up on the machine.”\u003c/p\u003e\n\u003cp\u003eA short time later Rafe found himself seated in front of a microfilm reader, scanning eight-year-old editions of the Eclipse Bay Journal. He paused when he came to the front-page headline that had been printed the morning after Kaitlin’s death: LOCAL WOMAN FOUND DEAD AT HIDDEN COVE.\u003c/p\u003e\n\u003cp\u003e“That’s it.” Jed hung over his shoulder, one hand gripping the back of Rafe’s chair. “I didn’t cover the story. I was busy writing up the piece on Thornley’s reception at the institute.”\u003c/p\u003e\n\u003cp\u003eRafe glanced at the byline. “Did you know Ben Orchardson well?”\u003c/p\u003e\n\u003cp\u003e“No one knew him well, but I learned a few things from him. He was a halfway decent reporter in his day. Worked for a couple of the big-city dailies for several years. But he had a problem with the bottle. Wound up here at the Journal for a while, but Ed had to let him go after a few months.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-43.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
