{"id":79732,"no":44,"title":"Page 44","content":"\u003cp\u003e“Is Orchardson still around?”\u003c/p\u003e\n\u003cp\u003e“Are you kidding? He was sixty-three when he covered the Sadler story. He retired and moved away just before I married Connie. Haven’t heard from him since he left Eclipse Bay. I remember him saying something about heading for Mexico or maybe Costa Rica where he could live like a king on his Social Security check while he wrote the great American novel. Doubt if he ever sobered up long enough to buy a computer and go to work, though.”\u003c/p\u003e\n\u003cp\u003eRafe read through the first story that had appeared, searching for names other than his own. The first one that leaped out was Hannah’s. He paused to study the short paragraph that had covered his alibi.\u003c/p\u003e\n\u003cp\u003eHannah Harte, daughter of longtime Eclipse Bay summer visitors Hamilton and Elaine Harte, stated that she had been with Raphael Madison at the time of Sadler’s death. “We met on the beach near Eclipse Arch a few minutes after midnight,” she said. “We talked for a while. Then he walked me home. It was a long walk. We arrived shortly before two.”\u003c/p\u003e\n\u003cp\u003eThe words were simple enough, but they had cost Hannah a lot at the time, Rafe reflected. He could imagine what her parents had had to say about the events of that night. But that was Hannah for you. Not a woman to stay silent when she had something to say.\u003c/p\u003e\n\u003cp\u003eJed leaned closer. “Something I’ve always wondered about… ?”\u003c/p\u003e\n\u003cp\u003eThe story jumped to an inside page. Rafe advanced the film. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“Is talking really the only thing you and Hannah Harte did that night on the beach?”\u003c/p\u003e\n\u003cp\u003eRafe leaned back and met Jed’s eyes. “Yes.”\u003c/p\u003e\n\u003cp\u003eJed straightened quickly and took a step back. He cleared his throat. “Hey, just a reporter’s natural curiosity, you understand.”\u003c/p\u003e\n\u003cp\u003eRafe turned back to the article and continued reading.\u003c/p\u003e\n\u003cp\u003eYates said that he is still investigating Sadler’s movements on the night of her death. “No one seems to know where she went or what she did after Madison got out of her car near the Arch. No one has any idea why she was on Hidden Cove Trail at that hour of the night. The trail is closed at sunset. There are no lights…”\u003c/p\u003e\n\u003cp\u003e“Whatever happened to Chief Yates?” Rafe asked as he went on to the next story. “Is he still around?”\u003c/p\u003e\n\u003cp\u003e“Didn’t you know? He died of a heart attack a couple of years ago.”\u003c/p\u003e\n\u003cp\u003e“Wonder if there’s any way of getting a look at his old file on the case?”\u003c/p\u003e\n\u003cp\u003e“The new chief of police is named Sean Valentine. He’s a solid guy. He’ll probably let you look at the old files, but I doubt that you’ll find anything. Orchardson went through them thoroughly at the time. I remember him saying that with you in the clear, there was no other viable suspect. He said he was fairly sure Kaitlin’s death had been an accident or suicide.”\u003c/p\u003e\n\u003cp\u003e“I don’t buy suicide,” Rafe said.\u003c/p\u003e\n\u003cp\u003eJed shrugged. “Neither do I. But I can see her having a few drinks and losing her balance on that trail.”\u003c/p\u003e\n\u003cp\u003e“But what was she doing there on the trail in the first place?”\u003c/p\u003e\n\u003cp\u003eJed considered for a moment. “Think maybe she went there to treat herself to a couple of beers after she ditched you?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. She didn’t have any booze in the car when she dropped me off at the Arch, I can tell you that.”\u003c/p\u003e\n\u003cp\u003e“She could have picked someone up after she left you.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Rafe studied the article on the screen. “Maybe. But Kaitlin was not a big drinker.”\u003c/p\u003e\n\u003cp\u003eJed crouched down behind the chair and rested an elbow on the back. He eyed the screen over Rafe’s shoulder. “You’re serious about this, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Curious, not serious.”\u003c/p\u003e\n\u003cp\u003e“There’s a difference?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” Rafe admitted. He went back to the front page of the story he had been reading. He paused when he saw a night shot of the brightly lit facade of the Eclipse Bay Policy Studies Institute. “I see Thornley’s big event at the think tank that night got squeezed below the fold.”\u003c/p\u003e\n\u003cp\u003eJed made a face. “Don’t remind me. My first big story, and I lost the lead because of the Sadler piece.”\u003c/p\u003e\n\u003cp\u003eRafe followed the reception story to an inside page and found a photo of the crowd that had attended the Thornley reception. “Looks like most of Eclipse Bay was there.”\u003c/p\u003e\n\u003cp\u003e“Everyone in town was invited, but it was understood that if you went you were expected to donate to Thornley’s campaign. That limited the guests to the upwardly mobile among us, the local movers and shakers, and the hustlers who felt they had a stake in getting Thornley elected.”\u003c/p\u003e\n\u003cp\u003eRafe smiled slightly. “Not a lot of guys like me there, I take it?”\u003c/p\u003e\n\u003cp\u003e“Not that I recall.” Jed grinned. “I was the youngest person there, and the only reason I attended was because I was covering it for the paper.”\u003c/p\u003e\n\u003cp\u003eRafe leaned back in the chair, thinking. “What time did the reception end?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember precisely. It ran late because Thornley was a little long-winded in those days. And because there was plenty of free booze.”\u003c/p\u003e\n\u003cp\u003eThe lights had still been on at the institute when he walked Hannah home along Bayview Drive, Rafe thought. “So, it would probably be safe to say that everyone who attended the Thornley reception that night has a reasonably solid alibi.”\u003c/p\u003e\n\u003cp\u003eJed slanted him a speculative glance. “Yes. I could probably dig up the old guest list if you want to look at it. As the only representative of the local media at the event, I’m sure I got a copy. It might be in my files. But Kaitlin didn’t move in those circles, Rafe. Why would anyone from that crowd want to kill her?”\u003c/p\u003e\n\u003cp\u003e“Good question.” Rafe thought about the oversized lingerie, the high heels, and the videos that the Willis brothers claimed to have discovered behind Kaitlin’s dryer. No point in mentioning them, he thought. He had nothing hard to go on yet. “You’re right. There’s nothing here, Jed. Sorry I wasted your time.”\u003c/p\u003e\n\u003cp\u003e“No problem,” Jed replied. “Keep me in mind if you get any other wild hairs, okay? This is a slow news town. I wouldn’t mind a big exposé on the Sadler death, especially if it involves an eight-year cover-up. Pulitzers have been won on less.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Rafe said. “If I get any more brainstorms, you’ll be the first to know.”\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003e“It was one of the more embarrassing moments of my life.” Hannah propped her heels on the ottoman, sank deeper into the brown leather sofa, and sipped glumly on the hot green tea Pamela had given her. “I couldn’t believe that I was standing there in the front hall of Dreamscape, yelling at him. I know the Willis brothers were listening to every single word. The story will be all over town by now.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-44.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
