{"id":79746,"no":58,"title":"Page 58","content":"\u003cp\u003e“Maybe not quite so certain as he let everyone think,” Rafe said. “In addition to asking a lot of questions, he did a thorough search of Kaitlin’s house and car that night. He must have had a few suspicions.”\u003c/p\u003e\n\u003cp\u003eMitchell shrugged. “Yates was a good cop in his time.”\u003c/p\u003e\n\u003cp\u003eHannah sipped coffee from a small cup. She regarded Mitchell very steadily. “We need a little help.”\u003c/p\u003e\n\u003cp\u003e“From me? Now, see here, just what are you two thinking of doing?”\u003c/p\u003e\n\u003cp\u003e“We’re going to try to find out who Kaitlin was blackmailing,” Rafe said.\u003c/p\u003e\n\u003cp\u003eMitchell frowned. “You want my advice? Don’t go poking a stick in a hole. There might be a real nasty varmint inside.”\u003c/p\u003e\n\u003cp\u003e“The problem,” Rafe said deliberately, “is that the varmint has already crawled out of the hole. I don’t think Winston was the real target last night. I have a hunch that whoever put him out there on that finger may have intended for Hannah to get caught by the incoming tide.”\u003c/p\u003e\n\u003cp\u003eHannah snapped her head around in surprise. “Rafe, what are you saying? You never told me you thought that someone had tried to—” She broke off.\u003c/p\u003e\n\u003cp\u003e“I’m not sure that someone did try to hurt you last night. Winston may have been just a warning. But I’m not taking any chances.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Never mind. We’ll deal with that later.”\u003c/p\u003e\n\u003cp\u003e“Deal with what later?” She slammed her coffee cup down onto the saucer. “Now just one damn minute. I want an explanation.”\u003c/p\u003e\n\u003cp\u003eRafe met Mitchell’s gaze and talked over the top of Hannah’s simmering words. “If I said to you ladies’ underwear in sizes big enough to fit a man, big high heels, Kaitlin Sadler, and some compromising videotapes that were bad enough to serve as blackmail material, what would you say?”\u003c/p\u003e\n\u003cp\u003eMitchell’s face worked. For a moment Rafe thought that he was going to explode with outrage. But abruptly the ire metamorphosed into something else. Curiosity, or reluctant interest, Rafe decided.\u003c/p\u003e\n\u003cp\u003e“We’re talking eight years ago, aren’t we?” Mitchell said thoughtfully.\u003c/p\u003e\n\u003cp\u003eRafe watched him. “One way or another, you’ve been connected to this town for more than fifty years. Any names come to mind?”\u003c/p\u003e\n\u003cp\u003e“No,” Mitchell said immediately. “But that’s no big surprise. I never paid much attention to other people’s sex lives. The only one that ever interested me was my own.” He paused. “But there was someone who did keep track of that kind of thing, along with every other damn secret in this town.”\u003c/p\u003e\n\u003cp\u003eHannah groaned. “I hope you’re not going to tell us that person was Arizona Snow. It’s hopeless trying to get anything out of her. She might know some secrets, but she filters them all through her conspiracy theories.”\u003c/p\u003e\n\u003cp\u003e“Wasn’t thinking of Arizona,” Mitchell said. “I was talking about Ed Bolton. Owned the Eclipse Bay Journal for more than forty years until he sold out to Jed Steadman. Ed knew everything about everyone in this town.”\u003c/p\u003e\n\u003cp\u003eDisappointment coursed through Rafe. “I heard that Ed Bolton died four or five years ago.”\u003c/p\u003e\n\u003cp\u003e“He did,” Mitchell said in an oddly neutral voice. “Heart attack. But his widow, Bev, is still around. Lives in Portland now.”\u003c/p\u003e\n\u003cp\u003e“Do you think that Bev Bolton would know the secrets that Ed knew?” Hannah asked.\u003c/p\u003e\n\u003cp\u003eMitchell nodded slowly. “Bev and Ed were together for a long time. Fine woman. Good marriage, from all accounts. Yeah, I reckon she’d know what Ed knew.”\u003c/p\u003e\n\u003cp\u003eSomewhere in the back of Rafe’s brain something went click.\u003c/p\u003e\n\u003cp\u003e“How do you know so much about Bev Bolton’s marriage?” he asked Mitchell.\u003c/p\u003e\n\u003cp\u003e“Bev and I get together once in a while,” Mitchell said very casually. “Talk over old times. You know how it is.”\u003c/p\u003e\n\u003cp\u003eRafe flopped back in his chair. “Damn. How long have you and Bev Bolton been having an affair?”\u003c/p\u003e\n\u003cp\u003eMitchell’s brows bunched and quivered in annoyance. “See here, my private life is none of your business.”\u003c/p\u003e\n\u003cp\u003e“Right. Sure. Your business.”\u003c/p\u003e\n\u003cp\u003e“Bev and I go back a long ways.” Mitchell paused. “A couple of years after Ed died, I asked her to marry me.”\u003c/p\u003e\n\u003cp\u003eRafe was astounded. “No kidding? What happened?”\u003c/p\u003e\n\u003cp\u003e“Turned me down flat,” Mitchell admitted.\u003c/p\u003e\n\u003cp\u003e“I see.” Rafe said.\u003c/p\u003e\n\u003cp\u003e“As I was saying,” Mitchell went on, “Bev and I get together whenever I go to Portland.”\u003c/p\u003e\n\u003cp\u003e“I understand.” Rafe recalled the conversation with Gabe concerning Mitchell’s frequent trips to Portland. “And you’ve found a reason to go nearly every week for the past ten months.”\u003c/p\u003e\n\u003cp\u003e“What the hell business is it of yours? A man’s got a right to his personal life.”\u003c/p\u003e\n\u003cp\u003eRafe started to smile. The smile turned into a grin before he could control it, and then, without warning, he was laughing so hard he feared he might fall off his chair.\u003c/p\u003e\n\u003cp\u003eWinston roused himself to thrust his nose inquiringly into Rafe’s hand. Rafe scratched him behind the ears and laughed even harder.\u003c/p\u003e\n\u003cp\u003eHannah and Mitchell frowned.\u003c/p\u003e\n\u003cp\u003e“What’s so funny?” Hannah asked with a bewildered expression.\u003c/p\u003e\n\u003cp\u003eMitchell glowered. “If there’s a joke here, you’d better share it.”\u003c/p\u003e\n\u003cp\u003e“The joke is on Gabe and me,” Rafe said, subduing the laughter to a wide grin. “We thought all those trips to Portland you’ve been taking for the past year were to get medical treatment. We were afraid you had some terrible, lingering disease you were hiding from us.”\u003c/p\u003e\n\u003cp\u003e“Huh.” Mitchell blinked, and then his eyes gleamed with secret amusement. “One of those trips last year was to see a doctor. But it wasn’t because I had come down with anything serious.”\u003c/p\u003e\n\u003cp\u003e“Just a checkup?” Rafe asked.\u003c/p\u003e\n\u003cp\u003e“You might say that,” Mitchell said with a benign smile. “Happy to tell you that everything is in pretty fair working order, considering the mileage I’ve put on this body.”\u003c/p\u003e\n\u003cp\u003e“Glad to hear it.” Rafe realized he felt a lot lighter.\u003c/p\u003e\n\u003cp\u003e“Unless you do me in with your cooking,” Mitchell said, “Dr. Reed tells me I’m likely to be around to pester the rest of you for quite a while yet. Now, then, as I was saying before I was so rudely interrupted, I was planning to go to Portland at the end of the week. No reason I can’t drive in with Bryce in the morning instead.”\u003c/p\u003e\n\u003cp\u003eBryce arrived to collect Mitchell shortly after ten that night. Hannah stood on the front porch with Rafe and Winston, her arms folded, and watched the big SUV lumber off down the drive. It turned left onto the road, and the headlights disappeared into the night. \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-58.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
