{"id":79750,"no":62,"title":"Page 62","content":"\u003cp\u003eVirgil arched a brow. “Did you know that she collected eighteenth-century erotica?”\u003c/p\u003e\n\u003cp\u003e“Uh, no.” Hannah cleared her throat. “She never mentioned it.”\u003c/p\u003e\n\u003cp\u003e“Yes, indeed. I helped her build her collection. I have some excellent contacts in the rare book business, you see. I’m sure you’ll run into Isabel’s old books and prints when you two start going through her things at Dreamscape. Whatever you do, don’t toss or sell any of those books and things until you check with me. Some of those volumes are worth several thousand dollars.”\u003c/p\u003e\n\u003cp\u003e“Good grief,” Hannah said weakly. “I’m suddenly getting a whole new picture of my aunt.”\u003c/p\u003e\n\u003cp\u003eRafe tried not to laugh. It wasn’t easy. The bewildered, bemused expression on Hannah’s face was priceless.\u003c/p\u003e\n\u003cp\u003eVirgil crouched and held his hand out to Winston. “Lovely dog.”\u003c/p\u003e\n\u003cp\u003eHannah frowned as Winston trotted forward to sniff politely. When the dog appeared satisfied, she hesitated and then said, “Thank you.”\u003c/p\u003e\n\u003cp\u003eShe still sounded stiff, but Rafe could tell she was softening. Virgil put his hand in the small of his back and straightened with great care.\u003c/p\u003e\n\u003cp\u003e“Arthritis,” he explained. “Or the old war wound. I can never tell the difference.”\u003c/p\u003e\n\u003cp\u003e“Which war?” Hannah asked warily.\u003c/p\u003e\n\u003cp\u003e“Does it matter? They’re all the same, aren’t they? At least, they all look the same when you’re standing in the middle of one.” He looked at Rafe. “What can I do for you? Something tells me that the two of you are not here to purchase the latest issue of Fetish magazine or to rent Alice Does Wonderland.”\u003c/p\u003e\n\u003cp\u003eRafe leaned back against a counter stocked with rainbow-colored plastic dildos arranged in order of size. He shoved his hands into his front pockets and plunged straight into the tale.\u003c/p\u003e\n\u003cp\u003e“This is about what happened the night Kaitlin Sadler died,” he said. “Hannah and I have some reason to think that her death might not have been an accident.”\u003c/p\u003e\n\u003cp\u003eVirgil nodded somberly. “Yes, of course.”\u003c/p\u003e\n\u003cp\u003eHannah shot him a quick, frowning glance. “You don’t look surprised, Mr. Nash.”\u003c/p\u003e\n\u003cp\u003e“Why should I be surprised? I’ve heard the rumors.”\u003c/p\u003e\n\u003cp\u003e“Exactly what rumors have you heard?” Rafe asked.\u003c/p\u003e\n\u003cp\u003eVirgil raised his thin shoulders in a small shrug. “Everyone knows that the two of you went to see Dell Sadler yesterday. Given his history with you, Rafe, there could be only one reason why the pair of you would sit down and talk after all this time.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Rafe said, “I’ll cut to the chase. A few things have happened lately that make us think that someone doesn’t want the old investigation reopened.”\u003c/p\u003e\n\u003cp\u003eVirgil said nothing. He just waited.\u003c/p\u003e\n\u003cp\u003e“We’ve picked up some indications,” Hannah added, “that Kaitlin Sadler may have been blackmailing someone in town. If it’s true, it might mean that same someone killed her to silence her.”\u003c/p\u003e\n\u003cp\u003eGlittering curiosity flared without warning in Virgil’s gaze. “You don’t say.”\u003c/p\u003e\n\u003cp\u003e“We don’t have anything solid to go on yet,” Rafe said. “But it looks like the blackmail material might have had something to do with someone’s sex life.”\u003c/p\u003e\n\u003cp\u003e“It often does.” Virgil paused. “But in this day and age, it would have to be a particularly interesting sex life to be worth blackmail payments or murder.”\u003c/p\u003e\n\u003cp\u003e“That’s why we came to you,” Rafe said. “Know any men in town who like to wear ladies’ underwear?”\u003c/p\u003e\n\u003cp\u003e“At least half a dozen names come to mind,” Virgil said without missing a beat. “If that’s all you’ve got, you’ll be at this investigation for a very long time.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding,” Hannah said. “You know half a dozen men in Eclipse Bay who have a penchant for female underwear?”\u003c/p\u003e\n\u003cp\u003e“The fetish for women’s undergarments is not all that rare or unusual.” Virgil adopted a professional tone as he warmed to his lecture. “It is generally considered a harmless quirk, as these things go. Indeed, the history of prominent men dressing in lingerie goes back for centuries. There have been kings, generals, presidents, statesmen—”\u003c/p\u003e\n\u003cp\u003e“But of the six men here in Eclipse Bay who like to wear lingerie which one would be seriously horrified if the news got around?” Rafe asked before Virgil could get sidetracked by his professional interest.\u003c/p\u003e\n\u003cp\u003e“I imagine that they would all be embarrassed, to varying degrees.”\u003c/p\u003e\n\u003cp\u003eHannah looked at him. “Think any of them would be so humiliated that he would pay blackmail or kill to keep the secret?”\u003c/p\u003e\n\u003cp\u003eVirgil stroked his goatee while he pondered that. In the end, he shook his head decisively. “Frankly, I don’t see any of them in the role of murderer. But one never knows, does one?”\u003c/p\u003e\n\u003cp\u003e“Six men,” Rafe repeated.\u003c/p\u003e\n\u003cp\u003e“Those are just the ones who come to mind immediately because I have had some contact with them over the years,” Virgil said. “There are no doubt several others who don’t shop at my store.”\u003c/p\u003e\n\u003cp\u003eHannah sighed. “It’s hopeless. Sounds like we can’t even get a complete list, let alone verify the whereabouts of all the men on it for the night Kaitlin died.”\u003c/p\u003e\n\u003cp\u003e“You don’t need to find all of them,” Virgil pointed out. “Just the ones who knew Kaitlin intimately.”\u003c/p\u003e\n\u003cp\u003e“From what I’ve heard, that would still be a mighty long list.” Hannah shot Rafe a dark glare.\u003c/p\u003e\n\u003cp\u003e“Don’t look at me,” Rafe said calmly. “I prefer lingerie on ladies.”\u003c/p\u003e\n\u003cp\u003e“And he is the only suspect who had an ironclad alibi that night,” Virgil reminded her. “Thanks to you.”\u003c/p\u003e\n\u003cp\u003e“I know.” Hannah scowled. “Still, there must be some way to narrow the list.”\u003c/p\u003e\n\u003cp\u003e“For starters, I imagine that you can eliminate any man who wasn’t reasonably affluent at the time,” Virgil said. “After all, no point blackmailing someone who can’t afford to pay.”\u003c/p\u003e\n\u003cp\u003eRafe was intrigued. “You’re right. That might cut the list down a little.”\u003c/p\u003e\n\u003cp\u003eHannah frowned. “If he was rich enough to pay blackmail, chances are he would have been wealthy enough to be invited to the political reception up at the institute that night. But if he was there, he’s also got a solid alibi.”\u003c/p\u003e\n\u003cp\u003e“I’m not so sure about that,” Rafe said slowly. “The institute was crowded that evening. Everyone who was anyone in Eclipse Bay was there. Someone could have slipped away long enough to murder Kaitlin and then returned to the reception with no one the wiser.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-62.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
