{"id":79761,"no":73,"title":"Page 73","content":"\u003cp\u003eShe waited for him to add undying love and mutual devotion to the list. But he didn’t. “I see. Some people would say that a marriage between a Harte and a Madison would definitely qualify as bizarre.”\u003c/p\u003e\n\u003cp\u003eHe watched her intently. “Look, I don’t know what’s on this new list of yours, but I’ve done some changing during the past eight years. I still don’t meet all the requirements you gave me when you were nineteen—”\u003c/p\u003e\n\u003cp\u003e“I was twenty that night, not nineteen.”\u003c/p\u003e\n\u003cp\u003e“Whatever. The thing is, I do meet at least some of those specifications, and I’m willing to work on the rest.”\u003c/p\u003e\n\u003cp\u003e“Why?” she asked bluntly.\u003c/p\u003e\n\u003cp\u003eHe leaned forward, intense and earnest. “You’re a Harte. You ought to see the logic in us getting married. Hey, we’d be going into this deal with our eyes wide open. We know a hell of a lot more about each other than most people know about their potential spouses. We’ve got some history together. Three generations of it. We’d have Dreamscape to work on together. Sharing a business enterprise is a very bonding experience.”\u003c/p\u003e\n\u003cp\u003e“You think so?”\u003c/p\u003e\n\u003cp\u003e“Sure.” He was warming to his theme now. “For my part, I can guarantee that this wouldn’t be another typical Madison marriage.”\u003c/p\u003e\n\u003cp\u003eShe sipped her tea, reluctantly fascinated. “In what way?”\u003c/p\u003e\n\u003cp\u003e“I just told you.” He spread his hands in a gesture of exasperation. “It won’t be based on some wild, romantic fantasy of endless lust.”\u003c/p\u003e\n\u003cp\u003e“No lust at all?” she asked around the straw.\u003c/p\u003e\n\u003cp\u003eHis jaw locked. “I’m not saying I don’t find you attractive. You know I do. We’re sexually compatible. That’s important in a marriage.”\u003c/p\u003e\n\u003cp\u003e“Sexual compatibility is nice,” she agreed.\u003c/p\u003e\n\u003cp\u003e“Right. Real important.”\u003c/p\u003e\n\u003cp\u003e“But what you’re proposing here is a marriage of convenience.”\u003c/p\u003e\n\u003cp\u003e“What I’m proposing,” he said, his voice tightening, “is a marriage based on the sort of things that are supposed to appeal to a Harte, the kind of crap that was on that original list of yours: Mutual goals. Shared interests, et cetera, et cetera.”\u003c/p\u003e\n\u003cp\u003eThe edge in his voice made her look at him quickly, but his face was an unreadable mask.\u003c/p\u003e\n\u003cp\u003e“Right.” She jiggled the straw among the ice cubes. “Crap.”\u003c/p\u003e\n\u003cp\u003eHe drew a breath. “Okay, ‘crap’ was not a great word. Look, what I’m trying to say here is that I think we’ve got a shot at making a marriage work. Hannah, you told me once that I didn’t have to repeat the same mistakes my father and my grandfather made. I haven’t been one hundred percent successful, but I have managed to avoid some of the larger disasters. And I did meet the goal I set for myself eight years ago.”\u003c/p\u003e\n\u003cp\u003e“You didn’t end up in jail.”\u003c/p\u003e\n\u003cp\u003e“Doesn’t that count for something?”\u003c/p\u003e\n\u003cp\u003e“Huh.”\u003c/p\u003e\n\u003cp\u003e“It’s taken me a while to find out what I want in life, but I’ve got it straight now. I need to know if you can stretch your new list of requirements in a husband to accommodate me.”\u003c/p\u003e\n\u003cp\u003e“Depends.” She steeled herself. “You see, the new edition of my list is extremely short, at least compared to the old one. Only one requirement is on it.”\u003c/p\u003e\n\u003cp\u003eHe watched her the way Winston watched seagulls. Hope and determination burned in his eyes, but so did the knowledge of potential defeat.\u003c/p\u003e\n\u003cp\u003eThe roar of a sturdy truck engine rumbled in the drive on the opposite side of the house. Winston removed his head from under Hannah’s hand and hurried off around the corner to investigate. Rafe frowned, clearly annoyed by the interruption. Then he realized who it was and surged to his feet.\u003c/p\u003e\n\u003cp\u003e“That will be A.Z. ,” he said. He started after Winston.\u003c/p\u003e\n\u003cp\u003eHannah glared at his back. “So much for declaring undying love and devotion.” But she said it very softly so that he would not hear her because it was entirely possible that he did not have either to declare.\u003c/p\u003e\n\u003cp\u003eWho would have guessed that a Madison would have ever settled for a marriage based on mutual interests and shared goals?\u003c/p\u003e\n\u003cp\u003eWho would have guessed that a Harte would have hungered for a little wild passion and romantic love?\u003c/p\u003e\n\u003cp\u003eThe noise of the truck engine ceased abruptly. Hannah got up from the lounger and followed Rafe and Winston around the corner.\u003c/p\u003e\n\u003cp\u003e“This here’s the log for that night.” Arizona opened the black leather-bound volume on the kitchen table and swiveled it around so that Rafe and Hannah could look at the entries. “That first Thornley reception was a big event. Lots of folks there, including some from Portland.”\u003c/p\u003e\n\u003cp\u003e“We’re looking for a record of a car that left the parking lot and returned between midnight and two.” Rafe slid the log closer to get a better look at the tiny, meticulously made notations. “I assume you stayed until the reception ended, A.Z. ?”\u003c/p\u003e\n\u003cp\u003e“Until the last car pulled out of the lot,” she assured him. “No point keeping a half-assed record, I say.”\u003c/p\u003e\n\u003cp\u003eHannah flipped pages. “There are a lot of entries here. It’s going to take a while to go through them.”\u003c/p\u003e\n\u003cp\u003e“Take your time.” Arizona shoved herself to her feet. “Reckon I’ll go out into the sunroom and relax while you two conduct your little investigation. Mind if I pour myself some more of your coffee, Rafe?”\u003c/p\u003e\n\u003cp\u003e“Help yourself.” He reached for a pen and the lined tablet he had set out on the table.\u003c/p\u003e\n\u003cp\u003e“Thanks.” Arizona reached for the pot. “Been a while since I sat in Isabel’s sunroom. Miss those visits. Isabel always had something interesting to say.”\u003c/p\u003e\n\u003cp\u003eThe sad, faintly wistful note in Arizona’s voice caught Hannah off guard. She looked up quickly.\u003c/p\u003e\n\u003cp\u003eArizona headed for the kitchen door, chunky mug in hand. “I could talk to her, you know? She understood when I told her about the goings-on up at the institute. Didn’t laugh the way some folks do.”\u003c/p\u003e\n\u003cp\u003eArizona ambled out into the hall and disappeared in the direction of the solarium. Hannah gazed after her for a moment, aware of a glimmer of curiosity.\u003c/p\u003e\n\u003cp\u003e“I wonder just how close Arizona and Aunt Isabel actually were,” she said quietly. “As far as I know, neither of them ever married. They were friends for a long time. You don’t suppose—?”\u003c/p\u003e\n\u003cp\u003e“None of our business.” Rafe wrote down a license plate number. “This will go faster if you take the notes while I read the entries.”\u003c/p\u003e\n\u003cp\u003e“All right.” She took the pen from him and positioned the yellow tablet. “Go.”\u003c/p\u003e\n\u003cp\u003eIt was a discouraging process. Arizona’s log was more than a simple list of license plates, names, and times. It was complicated by extensive notations. Rafe read some of them aloud. \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-73.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
