{"id":79766,"no":78,"title":"Page 78","content":"\u003cp\u003eHe leaped the steps and ran the length of the veranda. Winston was a short distance ahead of him. The dog was in full charge mode. He was no longer sounding the alarm with short, warning barks. The porch lights glinted on bared teeth and flattened ears.\u003c/p\u003e\n\u003cp\u003eHe had been right about Winston the first time he saw him, Rafe thought. Definitely not a froufrou pooch.\u003c/p\u003e\n\u003cp\u003e“I’ll call the fire department,” Hannah shouted.\u003c/p\u003e\n\u003cp\u003e“Right.” He did not look back as he rounded the corner of the veranda.\u003c/p\u003e\n\u003cp\u003eWinston’s growl was the only warning he got before he glimpsed the figure silhouetted by the flames. The man was attempting to flee, but the dog had closed his jaws around a pant leg.\u003c/p\u003e\n\u003cp\u003eRafe saw Winston’s victim raise the gasoline can in his hands and prepare to smash it down hard on the Schnauzer’s skull.\u003c/p\u003e\n\u003cp\u003e“Goddamn dog,” Jed yelled.\u003c/p\u003e\n\u003cp\u003eRafe slammed into him. The can sailed out onto the grass, away from the flames. Jed went down hard on the wooden boards. He opened dazed, angry eyes. Hatred and rage flared hotter than the crackling fire.\u003c/p\u003e\n\u003cp\u003eWinston tried to get a better grip on Jed’s leg.\u003c/p\u003e\n\u003cp\u003e“Let go, Winston.”\u003c/p\u003e\n\u003cp\u003eThe dog released the trouser cuff and looked at Rafe.\u003c/p\u003e\n\u003cp\u003e“You sonofabitch,” Jed roared. “I had it all planned. Waited all this time. But you had to come back and ruin everything.”\u003c/p\u003e\n\u003cp\u003eHe heaved himself upward, hands stretched out for Rafe’s throat.\u003c/p\u003e\n\u003cp\u003eRafe saw the madness in his eyes and moved back out of reach. “It’s over, Jed.”\u003c/p\u003e\n\u003cp\u003e“Why did you have to come back here and screw up everything? Why, goddamn you?”\u003c/p\u003e\n\u003cp\u003e“It’s over,” Rafe said again.\u003c/p\u003e\n\u003cp\u003eIn the distance sirens wailed. Winston pranced in agitation and started to bark again. Hannah rounded the corner, the fire extinguisher from the kitchen cupboard in her hands.\u003c/p\u003e\n\u003cp\u003e“Oh, my God.” She halted at the scene in front of her.\u003c/p\u003e\n\u003cp\u003e“I had it made until you came back.” Jed’s face crumpled in fury. “Everything was in place. After all these years, everything was in place. And then you came back.”\u003c/p\u003e\n\u003cp\u003eHe launched himself wildly across the short space that separated him from Rafe.\u003c/p\u003e\n\u003cp\u003eRafe sidestepped the charge and stuck out one foot. Jed tripped over it and fetched up against the wall of the mansion. He clung there a few seconds and then slid slowly to a sitting position.\u003c/p\u003e\n\u003cp\u003eWhen he opened his eyes this time, the rage was gone. In its wake was a bleak awareness of abject failure.\u003c/p\u003e\n\u003cp\u003e“I had it all planned,” he whispered.\u003c/p\u003e\n\u003cp\u003eChapter 24\u003c/p\u003e\n\u003cp\u003e“Winston was the hero of the hour.” Hannah looked proudly at her dog, who was gnawing on a chewing bone. “Thanks to him, the fire damage was minimal. The Willis brothers assured us they could have things in great shape in a couple of weeks.”\u003c/p\u003e\n\u003cp\u003e“I’d allow more like a couple of months, if I were you,” Mitchell said. “Construction work never gets done on time, especially when the Willis brothers are handling things.”\u003c/p\u003e\n\u003cp\u003e“Maybe it’s just as well,” Hannah said. “We wanted to make some major modifications to that wing, anyway. We can incorporate them into the repairs.”\u003c/p\u003e\n\u003cp\u003e“Makes sense.” Mitchell leaned back in his chair and cast an assessing glance the length of the veranda. “Got your work cut out for you here. But I think, in the end, you’ll have yourselves a nice little inn and restaurant.”\u003c/p\u003e\n\u003cp\u003e“Five stars,” Rafe said. His voice was soft with certainty.\u003c/p\u003e\n\u003cp\u003e“Don’t doubt it for a minute.” Mitchell chuckled. “Always knew you could do anything you set out to do. Just a matter of applying yourself.”\u003c/p\u003e\n\u003cp\u003eHannah grinned. “Gee, what a coincidence. I once told him the same thing.”\u003c/p\u003e\n\u003cp\u003eRafe stacked his heels on the railing and took a swallow from the beer bottle in his hand. “How could I miss with both of you telling me what to do with my life?”\u003c/p\u003e\n\u003cp\u003e“Took you long enough to live up to expectations, but you finally made it.” Mitchell cradled his beer in one fist and squinted into the dying light. “Any more news on Jed Steadman?”\u003c/p\u003e\n\u003cp\u003e“Just that everything went down pretty much as we figured.” Rafe looked out over the bay. “Except, of course, that Jed is claiming through his lawyer that Kaitlin’s death was an accident.”\u003c/p\u003e\n\u003cp\u003e“The result of a quarrel over the tapes,” Hannah explained.\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah,” Mitchell muttered. “Reckon it’s a given he’ll end up facing only a manslaughter charge. But what happened to the tapes?”\u003c/p\u003e\n\u003cp\u003e“Jed claims they went over the cliff with Kaitlin and were swept out to sea. Says he never even viewed them.”\u003c/p\u003e\n\u003cp\u003e“Ha.” Mitchell grimaced. “And if you believe that, I’ve got some waterfront property in Arizona I can sell you.”\u003c/p\u003e\n\u003cp\u003e“I don’t think anyone actually believes his story,” Hannah said slowly. “But if those tapes don’t surface, no one will be able to prove otherwise. The Thornley camp is taking the line that the incident had nothing to do with their man. But there’s a rumor going around that Trevor Thornley met Kaitlin when she worked for his first campaign.”\u003c/p\u003e\n\u003cp\u003e“Wonder how many copies there are of those tapes,” Mitchell mused.\u003c/p\u003e\n\u003cp\u003e“Not our problem,” Rafe said. “Thornley’s the one who has to worry about opening a tabloid someday and finding a picture of himself modeling lingerie inside. We’ve got other things to occupy us.”\u003c/p\u003e\n\u003cp\u003eMitchell cocked a brow. “Such as?”\u003c/p\u003e\n\u003cp\u003e“Such as planning a wedding,” Hannah said smoothly.\u003c/p\u003e\n\u003cp\u003eFor a split second Mitchell looked stunned. In the next instant delight exploded across his weathered features. He gave a whoop that made Winston drop his chewing bone, get up from the floor, and pad over to his chair to see what all the excitement was about.\u003c/p\u003e\n\u003cp\u003e“Well, shoot and damn,” Mitchell said when he finally got his exuberance under control. “I knew you two would get around to doing the right thing. You just needed a little kick in the you-know-where.”\u003c/p\u003e\n\u003cp\u003e“Don’t know how we could have managed without your help,” Rafe said dryly. “Telling everyone at the post office that Hannah and I were planning to get married was certainly an inspiration for us. Wasn’t it, Hannah?”\u003c/p\u003e\n\u003cp\u003e“Definitely inspirational,” Hannah said.\u003c/p\u003e\n\u003cp\u003eMitchell was clearly having trouble containing his delight. “Least I could do. Wait’ll Sullivan and the rest of those uptight, upright Hartes hear about this. Your family is going to have a combined hissy fit, Hannah.”\u003c/p\u003e\n\u003cp\u003eHannah winced. “I expect there will be some fireworks when Rafe and I tell them the good news.” \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-78.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
