{"id":79697,"no":9,"title":"Page 9","content":"\u003cp\u003e“. . . The answer is no… . See you in Eclipse Bay.”\u003c/p\u003e\n\u003cp\u003eShe had not misunderstood. His answer to her offer was loud and clear.\u003c/p\u003e\n\u003cp\u003e“I think I’ve got a problem, Winston.”\u003c/p\u003e\n\u003cp\u003eShe dropped the bombshell on her sister the following morning.\u003c/p\u003e\n\u003cp\u003e“What do you mean, he refuses to sell?” Lillian demanded on the other end of the line. “That house belonged to our great-aunt, not his. He can’t refuse to sell.”\u003c/p\u003e\n\u003cp\u003eHannah listened to the muffled sounds of a printer in the background. Lillian was hard at work. She ran her matchmaking firm, Private Arrangements, out of an office in a high-rise located only a few blocks away from the one in which Hannah and Winston lived.\u003c/p\u003e\n\u003cp\u003e“You were there when Isabel’s will was read,” Hannah reminded her wearily. “She left the house equally to Rafe and me. The lawyer says he can do whatever he wants to do with his half.”\u003c/p\u003e\n\u003cp\u003e“Hmm. Maybe you didn’t offer him enough money.”\u003c/p\u003e\n\u003cp\u003e“The negotiations didn’t even get that far. I just sent a message to him through the lawyer telling him that I would be willing to buy out his half of the house. I expected him to come back with a price.”\u003c/p\u003e\n\u003cp\u003e“What on earth do you suppose he plans to do with half of Dreamscape?” Lillian mused.\u003c/p\u003e\n\u003cp\u003e“Who knows?” Hannah frowned at the array of wedding photos that decorated her office wall. “But I have plans for Dreamscape, and I’m certainly not going to let him stand in my way.”\u003c/p\u003e\n\u003cp\u003e“You’re going to meet with him in Eclipse Bay, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t look like I’ve got much choice. I want Dreamscape. Somehow I’ve got to talk him out of his share of the place.”\u003c/p\u003e\n\u003cp\u003e“We haven’t heard much about Rafe in recent years. Just that he got married and divorced.”\u003c/p\u003e\n\u003cp\u003eHannah thought about her midnight conversation with Rafe. The men in my family aren’t much good when it comes to marriage… . Figure the odds are against me getting lucky…\u003c/p\u003e\n\u003cp\u003e“Divorce is a Madison family tradition,” she said quietly.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, it’s a very common tradition for a lot of families these days.” Lillian made a tut-tut sound. “I don’t know why so many people refuse to see the obvious. Marriage is a partnership. It should be entered into the same way one would go into any serious business arrangement. All the factors should be examined from every angle before a commitment is made.”\u003c/p\u003e\n\u003cp\u003e“Lillian—”\u003c/p\u003e\n\u003cp\u003e“There’s a staggering amount of scientific evidence that suggests that couples who are properly matched using modern psychological tests and personality inventories are far more likely to succeed at marriage than those who let their emotions—”\u003c/p\u003e\n\u003cp\u003e“Enough, Lillian. I’ve heard your professional pitch before, remember?”\u003c/p\u003e\n\u003cp\u003e“Sorry. You know me. I get a little carried away sometimes.” Lillian hesitated. “About Rafe Madison—”\u003c/p\u003e\n\u003cp\u003e“What about him?”\u003c/p\u003e\n\u003cp\u003e“Think he’s changed?”\u003c/p\u003e\n\u003cp\u003e“How should I know?” Hannah rose, phone in hand, and went to the window. “Wonder if he achieved his big career objective?”\u003c/p\u003e\n\u003cp\u003e“Didn’t know he had one.”\u003c/p\u003e\n\u003cp\u003e“Oh, he had one, all right.” Hannah studied the view of the bridge-studded Willamette River. “His great ambition was to stay out of jail.”\u003c/p\u003e\n\u003cp\u003e“Given the direction in which everyone seemed to think he was headed eight years ago, that would have been a major accomplishment.”\u003c/p\u003e\n\u003cp\u003e“I’m sure we would have heard if he had gone to prison.” Hannah tightened her grip on the phone. “That kind of news would have been hot gossip in Eclipse Bay.”\u003c/p\u003e\n\u003cp\u003e“Ah, but as far as we know, he hasn’t been back to Eclipse Bay very often since Kaitlin Sadler died. According to Mom and Dad, he makes a couple of short weekend visits to see his grandfather every few months and that’s it. How would anyone know if he’d done time?”\u003c/p\u003e\n\u003cp\u003e“I think he was too smart to end up in prison,” Hannah said.\u003c/p\u003e\n\u003cp\u003e“Smart does not always equate with common sense. We’re both in the marriage business. We see smart people do dumb things every day.”\u003c/p\u003e\n\u003cp\u003e“True.”\u003c/p\u003e\n\u003cp\u003eLillian paused. “You’re still serious about your plans for Dreamscape?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003e“I was afraid of that. My advice is don’t let Rafe know you’ve got your heart set on turning Dreamscape into an inn.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eLillian made an exasperated sound. “Use your head. If he figures out just how badly you want the place, he’ll hold out for a whopping price for his half.”\u003c/p\u003e\n\u003cp\u003e“I’ll be careful how much I say. I’m a Harte, remember? I can be cool.”\u003c/p\u003e\n\u003cp\u003e“Do that,” Lillian said dryly. “You know, something tells me that it’s a good thing that Mom and Dad went on that monthlong cruise. If they knew that you were getting ready to go toe-to-toe with Rafe Madison over Dreamscape, they’d descend on Eclipse Bay like avenging angels.”\u003c/p\u003e\n\u003cp\u003e“Speaking of family interference, I’m counting on you to keep quiet about my decision to go to Eclipse Bay for a while. I want some time to work things out with Rafe. That won’t be possible if I’m inundated with helpful Hartes.”\u003c/p\u003e\n\u003cp\u003e“I’ll keep quiet,” Lillian sighed. “I still can’t imagine what Aunt Isabel was thinking. Ever since Rafe used you as his alibi for the night Kaitlin Sadler died, she was obsessed with the notion that the two of you were the Romeo and Juliet of the Harte-Madison feud.”\u003c/p\u003e\n\u003cp\u003e“Rafe didn’t use me as his alibi,” Hannah said. “I was his alibi.”\u003c/p\u003e\n\u003cp\u003e“There’s a difference?”\u003c/p\u003e\n\u003cp\u003e“Oh, yes,” Hannah said. “There’s a difference.”\u003c/p\u003e\n\u003cp\u003eChapter 2\u003c/p\u003e\n\u003cp\u003eThe weird part was that he had never intended to come back for more than an occasional overnight stay, just the obligatory duty visits to check up on Mitchell. Now he was determined to carve out his future here in Eclipse Bay.\u003c/p\u003e\n\u003cp\u003eGo figure.\u003c/p\u003e\n\u003cp\u003eRafe propped one sneaker-clad foot on the bottom rail of the second-story veranda that wrapped around the big house. He braced his elbows on the top rail and watched the sporty little lipstick-red Honda turn into the long drive.\u003c/p\u003e\n\u003cp\u003eHe hadn’t had a lot of ambitions eight years ago. He’d only known that he had to stop screwing up. Something of a challenge, given where he was coming from. He’d achieved his primary objective, he thought, as he watched the rakish red car come closer. He’d managed to stay out of jail. \u003c/p\u003e","sourceLink":"https://allnovel.net/eclipse-bay-eclipse-bay-1/page-9.html","bookId":1795,"creation":"Oct 5, 2019 4:19:58 PM","modification":"Oct 5, 2019 4:19:58 PM"}
