{"id":21416,"no":16,"title":"Chapter 16","content":"The term drew to an end. Peter\u0027s boat went head of the river in five bumps. There was a large dinner in the College hall, and a small dinner of Peter\u0027s friends upon the following day. This last dinner had important consequences. The toasts were many, and Peter was not a seasoned man. He put vine leaves in his hair, and scarcely conscious of his limbs, danced lightly into Gamaliel quadrangle. It was a dinner at Peter\u0027s expense, exclusively of Paggers; and at one o\u0027clock in the morning they began to do each what his brain imagined.\n\u003cbr\u003e \n\u003cbr\u003e Peter secured a beautiful enamel bath which belonged to Dundoon, and for an hour he could not be interrupted. To sit in the bath of Dundoon, and to clatter hideously from flight to flight of the stone steps of the College hall was a perfect experience. It never palled. Meanwhile Peter\u0027s friends had discovered an open window of the buttery, and announcements were made to Peter from time to time. Peter sat gravely in his bath and smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"Rows of chickens for the evening meal,\" said a man from the deeps of the larder. The chickens were handed out and spread decently upon the lawn.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 108]\n\u003cbr\u003e \n\u003cbr\u003e Reports were made of a wonderful breakfast waiting to be cooked.\n\u003cbr\u003e \n\u003cbr\u003e \"How well they provide for us,\" said Peter, gazing upon rows of fish, joints of beef and mutton, hams and sides of bacon. Then Peter stood up in his bath and prophesied:\n\u003cbr\u003e \n\u003cbr\u003e \"Gentlemen,\" he said. \"All kinds of food grow upon trees of the field. I should not be at all surprised—\" He broke off, sunk in contemplation of a spreading elm.\n\u003cbr\u003e \n\u003cbr\u003e Then he again carried his bath to the head of the steps, and his friends were busy for the next half hour. At the end of that time the trees were heavy with strange fruit.\n\u003cbr\u003e \n\u003cbr\u003e Peter was then invited to join in a choral dance; but he would not leave his bath.\n\u003cbr\u003e \n\u003cbr\u003e He felt a sudden need for violent rhythm, and began heavily to beat the bath of Dundoon.\n\u003cbr\u003e \n\u003cbr\u003e Windows were flung up, and protesting shouts were heard from sleepy men in garments hastily caught up. The Junior Prior, who had as long as possible refrained, saw he must intervene. He flung on a few necessary clothes and issued from his turret.\n\u003cbr\u003e \n\u003cbr\u003e Peter lay directly in his path. He paused irresolutely at the foot of the steps.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Paragon.\"\n\u003cbr\u003e \n\u003cbr\u003e The Junior Prior asserted his authority with misgiving.\n\u003cbr\u003e \n\u003cbr\u003e \"Sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go to your rooms.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 109]\n\u003cbr\u003e \n\u003cbr\u003e Peter descended the steps unsteadily. Then he stopped, looking wistfully towards his bath. It was too much. He began to climb back again.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Paragon,\" repeated the Junior Prior.\n\u003cbr\u003e \n\u003cbr\u003e \"Sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Need you do that again?\"\n\u003cbr\u003e \n\u003cbr\u003e \"This,\" objected Peter with the faintest parody of Dundoon, \"is most important.\"\n\u003cbr\u003e \n\u003cbr\u003e The Junior Prior was seen to flush in the lamplight.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Paragon, come down!\"\n\u003cbr\u003e \n\u003cbr\u003e Peter sighed and again started to descend. He missed a step and fell rudely towards the Junior Prior, who stepped back to receive him. But the Junior Prior caught his slippered heel in a low iron railing that skirted the lawn, and fell with his legs in the air. Peter, caught by the parapet, gazed thoughtfully at the legs of the Junior Prior.\n\u003cbr\u003e \n\u003cbr\u003e The Junior Prior was loosely clad. He had put his legs hastily into a pair of trousers, kept in place by the last abdominal button. Disordered by his sudden fall, the ends of the trousers projected beyond his feet.\n\u003cbr\u003e \n\u003cbr\u003e Everything happened in a moment. Peter saw his enemy delivered up. His bland good-fellowship of the evening surrendered to Berserker rage. He stooped, and in a flash caught hold of the loose ends of the trousers. Unconscious of his enormous strength, he pulled sharp and wild. The button gave with a snap, and Peter, staggered for a moment by the recoil, was next seen rushing up[Pg 110] the lawn, a strange banner streaming about his head.\n\u003cbr\u003e \n\u003cbr\u003e Peter\u0027s friends were awed into silence. The ceremony which so largely figured in conversation at Gamaliel had at last been performed, and it had been performed on the Junior Prior.\n\u003cbr\u003e \n\u003cbr\u003e Peter, in mad rush, came upon a meditative figure. The Warden, working late into the night, was at last disturbed. He had arrived in time to see Peter staggering back from a recumbent figure in the middle distance. He watched Peter in his furious career down the lawn, and saw Peter\u0027s miserable victim glimmer hastily away into the far turret. The Warden was not ignorant of College politics. He already suspected that this was no ordinary achievement.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Mr. Paragon,\" he said as Peter forged into view. \"Are these your property?\"\n\u003cbr\u003e \n\u003cbr\u003e He caught at the trousers, and Peter, struck comparatively sober, decided to temporise.\n\u003cbr\u003e \n\u003cbr\u003e \"They are not my property, sir. They are, f-f-th\u0027 moment, borrowed.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter felt very politic and clever.\n\u003cbr\u003e \n\u003cbr\u003e \"Who is the owner of this property?\" asked the Warden.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry, sir, but I cannot tell.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter was beginning to feel how impossible it was to face the fact that he had removed the trousers of the Junior Prior. He could not tell the Warden. It seemed indelicate. He wanted to cover the shame of his victim.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 111]\n\u003cbr\u003e \n\u003cbr\u003e \"You know, of course, to whom this property belongs?\" the Warden persisted.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But you refuse to say.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter was struck miserably silent. He did not like to deny the Warden, but he could not utter the outrage he had committed.\n\u003cbr\u003e \n\u003cbr\u003e \"Very well,\" said the Warden. \"I will impound the property. Doubtless it will be claimed.\"\n\u003cbr\u003e \n\u003cbr\u003e He quietly took possession of the trousers and turned to go.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Paragon.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I rely on you to see that the College is in bed within the next ten minutes. I shall send for you in the morning. Good night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good night, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter soberly reported the interview to his friends, and they decided to sleep.\n\u003cbr\u003e \n\u003cbr\u003e Already the zest was beginning to go out of life. A comfortless grey light was beginning to peer dimly at the hanging burden of the trees.\n\u003cbr\u003e \n\u003cbr\u003e Peter sat wakefully at his window. His revolt against the discipline of Gamaliel came merely to this—that he had removed the trousers of the Junior Prior. He had been noisy and foolish, and it had seemed the best joke in the world that his friends should give the laborious College servants at least an hour\u0027s extra work to do in the morning. A large side of bacon hanging grotesquely in the pale light intolerably mocked him[Pg 112] from the noble elm beside his window. He felt very old and tired. In the morning he was summoned to the Warden\u0027s house. The Warden met him seriously, as though, Peter thought, he instinctively knew how to make him ashamed.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Mr. Paragon, the property has been identified.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sorry, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I, too, am sorry, Mr. Paragon. You are sent down for the remaining days of the term, and I shall seriously have to consider whether I can allow you to come back after the vacation. I suppose you realise that the discipline of the College must be observed?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The Junior Prior,\" the Warden continued with perfect gravity, \"has been offered an important post in a Japanese university. Perhaps he will accept it. He desires to study the refraction of light in tropical atmospheres. It may therefore be possible for you to join us again next term. Otherwise I am afraid we shall have to strike you from the books. I think you understand the position, Mr. Paragon?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter cut short his friends when they asked for an account of his roasting.\n\u003cbr\u003e \n\u003cbr\u003e \"The Wuggins,\" he said emphatically, \"is a big man. I\u0027m going down by the seven-forty to Hamingburgh.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter wanted to get away without fuss, but the[Pg 113] Paggers would not hear of it. It was decided there must be a procession to the railway station. All the folly had gone out of Peter, but he was now helplessly a hero.\n\u003cbr\u003e \n\u003cbr\u003e The procession started from the College gates. Fifty hansom-cabs, decorated with purple crape, formed up under the Warden\u0027s windows. The town band was hired to play a solemn march. Peter, compelled to bear the principal part in a joke which he no longer appreciated, was borne to the leading cab pale with mortification. The slow journey to the station seemed interminable. All Oxford was grinning from the creeping pavement. At last the station was reached. Peter leaped from duress, heartily cursed his friends, and, safe at last in the train, began to wonder how his uncle would receive him.\n\u003cbr\u003e \n\u003cbr\u003e The Warden of Gamaliel had watched Peter\u0027s funeral procession from behind the curtains of his window. He smiled as he saw Peter borne forth, clearly reflecting in his expressive young face an ineffectual dislike of his notoriety. The Warden turned from the window as the strains of a solemn march weakened along the street. He smiled again that day at odd times, but sometimes he pressed his lips together and shook his head.\n\u003cbr\u003e \n\u003cbr\u003e \"Peter Paragon is a good boy,\" he told the Fellows at dinner, \"but I don\u0027t in the least know what we are going to do with him.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2063/58747.html","bookId":535,"creation":"Aug 2, 2019 1:03:04 PM","modification":"Aug 2, 2019 1:03:04 PM"}
