{"id":21433,"no":33,"title":"Chapter 33","content":"From that hour Lady Mary began to face the future as a creditor. Her coming days with Peter were numbered and enjoyed as the reward of her sacrifice.\n\u003cbr\u003e \n\u003cbr\u003e Yet another month slipped away. The year was now at the full of the first green, and London roared at the height of the season. Peter began to be much oppressed with the social rush. Much of it he now saw as mere noise and hurry. He read steadily in the morning, for he still intended seriously to be called to the Bar. In the afternoon he rode or went for long solitary journeys on the river. An evening seldom passed without meeting Lady Mary. They frankly exchanged plans, and schemed for snatches of conversation in crowded places.\n\u003cbr\u003e \n\u003cbr\u003e At this time they were opportunely invited to leave the hurry of London for a few days in Norfolk. A friend of Haversham had got together at Wroxham a fleet of wherries. Peter and Lady Mary joined the same boat for their last unclouded days together. Only Lady Mary knew how precious and irrevocable they were. For Peter they were slow days of agreeable idleness, as they glided from reach to reach of the quietest country in the world. Always there was the same circle of sky, with an idle mill and rows of grey-green[Pg 246] sedges; the quiet lapping of water and plod of the quanting. Tiny villages dropped past them, with square towers and clusters of small buildings. Upon the third evening of the cruise, Lady Mary picked up some London letters at Potter Heigham. One was from Lord Wenderby. She opened it and read:\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Lady Mary,—I hope you will not regard this as a breach of our contract. Things are moving quickly in the Cabinet. I must decide at once to stay or go. I can wait for you six days. If you cannot now help me to break with my ties and interests of the moment I must put away our vision of the future.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"I saw you in the Park the other day. I cannot hope you will ever be my wife. Believe that I wish you all the happiness of your heart.\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp;\u0026nbsp; \"Wenderby.\"\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary answered at once. She told Wenderby to come for his answer on her return to London. Meantime, if he needed to know her mind, let him believe all that he wished.\n\u003cbr\u003e \n\u003cbr\u003e Now she had only two days. She decided to tell Peter in London when they returned. Here she would part from him without a destroying word.\n\u003cbr\u003e \n\u003cbr\u003e The last evening of the cruise was warm with a breeze from the land to the sea, enough for sailing. Peter and Lady Mary sat, after an early dinner, together on deck. Laughter came from the drawing-room below—a London [Pg 247]drawing-room planted in a wilderness of marsh and water. Sunset was burning itself out. Light was flung upon miles of water, making of the country about them a glimmering palette. The mill on the horizon was derelict, standing black and crude, an eyeless giant, blind to the colour of earth and sky.\n\u003cbr\u003e \n\u003cbr\u003e Merriment swelled below them. A clever musician parodied the latest phase of a modern French composer.\n\u003cbr\u003e \n\u003cbr\u003e \"This,\" said Peter with a sardonic gesture at the people below, \"is a return to Nature.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are more scathing than you know,\" answered Lady Mary with a smile. \"You are listening to a burlesque of the latest thing in music, written in the scale of the Opopo islanders. The Opopo islanders can only count up to five. We are determined to be primitive.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I should like to sail away into all that,\" said Peter, waving his arm vaguely at the sunset.\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary caught at the idea.\n\u003cbr\u003e \n\u003cbr\u003e \"Can you sail?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Pretty fair,\" said Peter.\n\u003cbr\u003e \n\u003cbr\u003e \"Then why not?\"\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary pointed to the dinghy beneath them. The mast was shipped, and the sail folded.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you come?\" asked Peter.\n\u003cbr\u003e \n\u003cbr\u003e \"It is our last evening.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter did not hear the sorrow of her phrase.\n\u003cbr\u003e \n\u003cbr\u003e \"Our last evening of the simple life,\" he laughed. He climbed down, and held the ladder firm.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 248]\n\u003cbr\u003e \n\u003cbr\u003e \"How are you for wraps?\" he called. \"It is going to be colder later. This breeze will freshen.\"\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary smiled at his expert way.\n\u003cbr\u003e \n\u003cbr\u003e \"Where,\" she inquired, \"did you learn all this?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I learned it with Antony. We did this sort of thing at Oxford.\"\n\u003cbr\u003e \n\u003cbr\u003e The reference to her brother brought Lady Mary again in view of her sacrifice. She shivered and was silent as Peter rowed softly out into the stream, and spread the tiny sail. The breeze caught it, and the little boat leaned over, hesitated, and swung quickly across the river. The air freshened upon their faces. They dropped almost in a moment away from the lighted flat, and soon were alone, speeding at ease over the beautiful water.\n\u003cbr\u003e \n\u003cbr\u003e \"Why didn\u0027t we think of this before?\" said Peter happily. He pushed over the tiller. The little boat turned, and the water chuckled under her bows.\n\u003cbr\u003e \n\u003cbr\u003e \"Let me take you into the open. The breeze is beginning to be stiff for this tiny boat; but we can always lower sail if it gets too rough.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Anything to-night,\" said Lady Mary.\n\u003cbr\u003e \n\u003cbr\u003e \"I love to hear you say that,\" Peter sang.\n\u003cbr\u003e \n\u003cbr\u003e They passed into a wide lake, and were soon far from the shore, which showed now as a dark line picked out here and there with light.\n\u003cbr\u003e \n\u003cbr\u003e \"Anything to-night,\" Peter echoed the phrase.[Pg 249] \"It sounds,\" he went on, \"as if the present mattered more than anything in the world.\"\n\u003cbr\u003e \n\u003cbr\u003e The breeze was stronger as they neared the middle of the water. The boat heeled dangerously.\n\u003cbr\u003e \n\u003cbr\u003e \"We\u0027ve too much canvas for a tub,\" said Peter. He lowered the sail, and found he could take in a tiny reef. The hurry of the little boat was stilled. It swung idly on the water, and the wind seemed to have left them. Peter was busy with the sail, and Lady Mary sat still as a statue opposite him, her hand on the side of the boat. His happy face was intolerable. How would he take the news which waited for him at home? He was ready now to swing the reefed sail to the mast, but she impulsively stopped him.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t do that,\" she said abruptly.\n\u003cbr\u003e \n\u003cbr\u003e \"The boat will stand it,\" Peter protested.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s not that,\" said Lady Mary. \"Let us stay a while in this open place.\"\n\u003cbr\u003e \n\u003cbr\u003e Her tone arrested him. It was urgent and entreating. He dropped the sail into the boat, and they sat silent for a time. Lady Mary was blaming her weakness. Why did she not at once signal for that brief run over the little span of water between them and the fleet? It would take her to the duty she had accepted. Her holiday was finished.\n\u003cbr\u003e \n\u003cbr\u003e Peter misread the entreaty in her voice.\n\u003cbr\u003e \n\u003cbr\u003e \"You do not want to go back?\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Not at once.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 250]\n\u003cbr\u003e \n\u003cbr\u003e \"You, too, find all that less inspiring than it seems?\" He waved his hand towards the people they had left.\n\u003cbr\u003e \n\u003cbr\u003e \"This is better, for a time,\" she answered evasively.\n\u003cbr\u003e \n\u003cbr\u003e \"You still believe in all that?\" He looked towards the lighted masts, his face troubled and perplexed.\n\u003cbr\u003e \n\u003cbr\u003e \"Of course I believe,\" she assured him.\n\u003cbr\u003e \n\u003cbr\u003e Peter eagerly bent forward. \"You remember,\" he said softly, \"a night upon the terrace at Highbury?\"\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary looked at him, terror waiting to spring at her heart.\n\u003cbr\u003e \n\u003cbr\u003e \"I hardly know,\" Peter continued, \"whether I still believe all that I believed at Highbury. It is all too insolent, and some of it is foolish and cruel. I have seen ugly and brutal things. I am beginning to see that there are no classes. Rank is nothing at all. There are only people.\"\n\u003cbr\u003e \n\u003cbr\u003e Why did he talk like that to-night? It was intolerable.\n\u003cbr\u003e \n\u003cbr\u003e \"You are wrong,\" she cried out. \"Wealth is nothing, and there are bad shoots in an old tree. But there are men and women who must think and rule. It is their right.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That may be only your beautiful dream.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Peter,\" she called distressfully, \"you don\u0027t know what you are saying.\"\n\u003cbr\u003e \n\u003cbr\u003e He looked at her in wonder at the veiled agony of her voice. The pure white line of her face[Pg 251] showed like stone in the shutting light. There was a short silence. Then Lady Mary spoke again:\n\u003cbr\u003e \n\u003cbr\u003e \"I want you to suppose something,\" she said urgently. \"It is possible that I may be asked to make a sacrifice for this belief of mine. It will be painful for me and for my dearest friend.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing in the world is worth a moment of your pain.\"\n\u003cbr\u003e \n\u003cbr\u003e Peter\u0027s sincerity redeemed from ridicule the tragic untimeliness of his dithyrambic assurance. Lady Mary was brought nearer to tears than to laughter.\n\u003cbr\u003e \n\u003cbr\u003e \"Not even my faith?\" she protested.\n\u003cbr\u003e \n\u003cbr\u003e \"It would be an evil faith, or it would not make you suffer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why do you put me so high?\" Again there was a note of stress.\n\u003cbr\u003e \n\u003cbr\u003e \"I shall always do that.\"\n\u003cbr\u003e \n\u003cbr\u003e He put his hand firmly upon hers that rested on the side of the boat. She held her breath, fighting the desperate flutter of her soul. When she dared to look at him, she still met the shining worship of a boy. His hand rested upon hers, temperate and cool. She was glad she had not trembled or drawn away. Peter felt only an exquisite sense of privilege. He sat with bright eyes, happy in her beautiful austerity. She triumphed over her thrilled senses, and in her triumph faced him carven and tense.\n\u003cbr\u003e \n\u003cbr\u003e The light faded rapidly. Colour went out of[Pg 252] the sky and the water. Lady Mary took a long farewell of Peter\u0027s adoration. She knew that the light in his eyes was soon to be put out.\n\u003cbr\u003e \n\u003cbr\u003e At last, with a deep sigh, her hand still quietly held, she said:\n\u003cbr\u003e \n\u003cbr\u003e \"Now, Peter, we must go. We have no light in the boat.\"\n\u003cbr\u003e \n\u003cbr\u003e He reluctantly made ready the sail. The breeze caught it rudely. Their dream was broken up with the noise of water and wind. They came within sight and sound of the river. Peter lowered the sail to row in to the side of their wherry. There was only a moment now.\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary caught at Peter\u0027s wrist upon the oars.\n\u003cbr\u003e \n\u003cbr\u003e \"You will believe in me always, Peter?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Always.\"\n\u003cbr\u003e \n\u003cbr\u003e \"My life may take me away from you,\" she desperately urged. \"We read things differently.\"\n\u003cbr\u003e \n\u003cbr\u003e A burst of laughter came from the deck of the wherry. Lady Mary withdrew her hand from Peter\u0027s wrist.\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing in the world can shake my belief in you,\" said Peter, still pausing on the oars.\n\u003cbr\u003e \n\u003cbr\u003e \"That is easily said.\"\n\u003cbr\u003e \n\u003cbr\u003e Lady Mary cried out in pain at the light heart of the boy she loved.\n\u003cbr\u003e \n\u003cbr\u003e \"I mean it in every fibre,\" Peter insisted. \"I am utterly yours.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Row in to the boat,\" said Lady Mary. \"This is the end.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2063/58764.html","bookId":535,"creation":"Aug 2, 2019 1:03:04 PM","modification":"Aug 2, 2019 1:03:04 PM"}
