{"id":82357,"no":26,"title":"Page 26","content":"\u003cp\u003eI didn’t know it would come this soon.\u003c/p\u003e\n\u003cp\u003eTossing the phone on to a low table, he reaches me in four long strides and grabs my shoulders, stopping me before I back into a wall. ‘Dori, we need to talk.’ He swallows, and I don’t think I’ve ever seen him look this apprehensive. ‘I’ll call for breakfast – unless you already have?’\u003c/p\u003e\n\u003cp\u003eI shake my head, no.\u003c/p\u003e\n\u003cp\u003eHe leads me to the sofa and seats me in a corner before opening the room service menu and calling in a breakfast order. On this call, his voice is full of his usual self-confidence, but it vanishes as soon as he sits next to me, the dark blue of his eyes flicking away and searching the room as though he’ll find the words he needs to say somewhere outside himself.\u003c/p\u003e\n\u003cp\u003e‘Okay. Do you know who Brooke Cameron is?’\u003c/p\u003e\n\u003cp\u003eI nod. ‘Yes.’\u003c/p\u003e\n\u003cp\u003eHe exhales a long breath, one hand at the back of his neck. ‘Well, we used to go out.’ His eyes watch mine closely, reading and measuring. I don’t know if I want to hide my thoughts or open them all to him. ‘A long time ago – five years.’\u003c/p\u003e\n\u003cp\u003eMost people dismiss relationships that take place at fourteen or fifteen. Puppy love. Infatuation. A crush. But I know all too well how serious fifteen can be.\u003c/p\u003e\n\u003cp\u003e‘It didn’t end well.’ He runs a hand through his hair, unable to stop fidgeting. ‘It was pretty ugly, actually. I thought she’d cheated on me. So I broke up with her without even really ending it. A couple of months later, she called and told me she was pregnant.’\u003c/p\u003e\n\u003cp\u003ePregnant?\u003c/p\u003e\n\u003cp\u003eMy brain calls up Colin, and what I would do or say if I ran into him now. He’d discarded me for no reason that I knew of, although Deb suggested the fact that he’d turned eighteen and I was fifteen was incentive enough. I never told him I was pregnant. I knew he wouldn’t care.\u003c/p\u003e\n\u003cp\u003e‘Dori?’ Reid says, his hand on my face. I look back into his worried eyes. ‘Where’d you go? Talk to me.’\u003c/p\u003e\n\u003cp\u003eI shake my head. ‘I don’t understand. Why is she calling you now?’ As soon as the words leave my mouth, I know the answer. No. No. No.\u003c/p\u003e\n\u003cp\u003eHis jaw flexes and his throat works. ‘She gave him up for adoption.’\u003c/p\u003e\n\u003cp\u003eI bite the inside of my cheek and my hands grip each other in my lap.\u003c/p\u003e\n\u003cp\u003eHe cups his hands over mine. ‘God, your hands are freezing. We can talk about this later –’\u003c/p\u003e\n\u003cp\u003e‘No.’ My voice is the only solid thing left of me, and he flinches. ‘Finish. Please finish.’\u003c/p\u003e\n\u003cp\u003eHe closes his eyes briefly before answering. ‘He was mine, but I didn’t know it. I didn’t talk to anyone about it, Dori. My parents didn’t know. I’ve never even told John.’\u003c/p\u003e\n\u003cp\u003e‘How do you know he’s yours?’\u003c/p\u003e\n\u003cp\u003e‘We just did a paternity test.’\u003c/p\u003e\n\u003cp\u003eJust. As in recently.\u003c/p\u003e\n\u003cp\u003eI’m missing something, and I don’t know what it is. When children are adopted, their biological parentage is no longer an issue. ‘But – you said she gave him up … Why –?’\u003c/p\u003e\n\u003cp\u003e‘A couple of months ago, she hired a private investigator to look for him. She was having nightmares about him and just wanted to make sure he was okay. The PI found out that he’d been removed from his adoptive home months ago due to drugs and gross neglect. He’s in foster care now. So she’s … she’s applying to adopt him. And … so am I.’\u003c/p\u003e\n\u003cp\u003eThe hands that he thought were cold moments ago flash like ice and then go numb. I can’t feel anything. And then, suddenly, I feel everything. Waves of chills run from the back of my neck to my toes, millions of tiny pinpricks like sharp, agonizing barbs. As though some outside source grips my throat, my airway narrows and expands, over and over, and with it, my vision.\u003c/p\u003e\n\u003cp\u003e‘I told you about … everything that happened to me – with Colin,’ I gasp. ‘And you never said – you never told me –’\u003c/p\u003e\n\u003cp\u003e‘Dori, I didn’t – I didn’t know. I thought Brooke had cheated on me. I swear, I didn’t think he was mine. We were both so young and stupid and stubborn – we didn’t talk like you and I talk –’\u003c/p\u003e\n\u003cp\u003e‘Like you and I talk? Like when you told me you had a child with someone?’\u003c/p\u003e\n\u003cp\u003eHe drops his head in his hands. ‘I didn’t think he was mine, and I had nothing to do with her decision.’\u003c/p\u003e\n\u003cp\u003e‘So you left her to make that choice – alone? And now you get a second chance at doing the right thing because she made a different choice than I made?’ I shift away from him, but he reaches out and grabs my wrists.\u003c/p\u003e\n\u003cp\u003e‘Goddammit, Dori – no. It’s not like that –’\u003c/p\u003e\n\u003cp\u003e‘You said you’re both adopting him. So you’re … you’re getting back together?’\u003c/p\u003e\n\u003cp\u003e‘No. No. Jesus. This isn’t about me and Brooke – it’s only about River.’\u003c/p\u003e\n\u003cp\u003eHis child has a name. Of course he does. ‘River?’\u003c/p\u003e\n\u003cp\u003e‘He’s four and a half. I have a picture –’ He lets go of me, stands to grab his phone from the table and clicks through it. When he offers it, I reach to take it, thinking, I don’t know him.\u003c/p\u003e\n\u003cp\u003eBut I see him in his child’s face. And if anyone needs saving, it’s this little boy. His sadness is unmistakable, mirroring so many small faces from East LA to Quito – children shouldering the weight of the world. A world they didn’t create, or ask to be abandoned to.\u003c/p\u003e\n\u003cp\u003e‘Dad is telling Mom this weekend. He’s talking with contacts in LA County Family Court tomorrow, and we’re going to Austin on Tuesday to speak with Brooke’s attorney, and possibly the caseworker and judge. Last, but not least – I’m not sure when this is going to break publicly, but once it does, it’ll be a circus.’ He takes the phone from my hand and tips my chin, looks into my eyes. ‘Dori, say something.’\u003c/p\u003e\n\u003cp\u003eThe brusque rap on the door startles us both.\u003c/p\u003e\n\u003cp\u003eHe sighs. ‘That’s breakfast, I guess.’\u003c/p\u003e\n\u003cp\u003eWhile he rises to let the attendant in, I stare out of the window at the boats in the bay. From this distance, they look like models, or radio-powered toys. I imagine the holders of the remote controls are bored demi-gods occupying rooms like this on the top floors of tall buildings.\u003c/p\u003e\n\u003cp\u003eI feel his eyes sweep over me, neither of us speaking while our breakfast table is set up.\u003c/p\u003e\n\u003cp\u003eHe is not the self-centred, arrogant boy who showed up at Habitat last summer, calling me a hypocrite for dismissing him and then proving to me that he was worth saving. Not the boy who urged me to be reckless with him last fall, because he was safe. Not the boy who showed up on the other side of my parents’ screen door weeks ago, telling me he was all in before carrying me up the stairs and making love to me in my childhood bed.\u003c/p\u003e\n\u003cp\u003eThis is Reid Alexander – the stuff of fantasy for ordinary girls. And in a few hours, this fantasy will be over. I’ll return to my life, and he’ll return to his.\u003c/p\u003e\n\u003cp\u003e20\u003c/p\u003e\n\u003cp\u003eREID\u003c/p\u003e\n\u003cp\u003eDori is as quiet on the drive back to the dorm as she was on the drive into the city two nights ago. I slide into a rare open parking spot and offer to walk her in, but she has that exam to study for, and if I get out of this car, there’s the possibility I’ll be recognized – and she clearly doesn’t need to deal with that right now.\u003c/p\u003e\n\u003cp\u003eWe angle over the centre console to kiss goodbye until I murmur, ‘Screw this,’ slide my seat back as far as it will go and pull her into my lap. ‘Mmm. Better.’ Pushing my hand into her hair, I draw her mouth to mine and kiss her deeply, every slide of my tongue against hers, every shared caress a declaration of all she means to me.\u003c/p\u003e\n\u003cp\u003eInhaling shakily, she rests her head against my shoulder. ‘You didn’t exactly encourage a lot of study time this weekend, you know.’ Her hand lies over my heart.\u003c/p\u003e\n\u003cp\u003e‘Well, I got plenty of study time. I’m pretty sure I could pick you out of a line-up of only belly buttons or kneecaps or pinkie toes now … let alone the parts I committed to memory ages ago. For instance – I could have identified you by those delicious lips two days after meeting you.’\u003c/p\u003e\n\u003cp\u003eShe blinks up at me and tilts her head back on my arm. ‘But you didn’t kiss me until, you know, the pink closet.’\u003c/p\u003e\n\u003cp\u003eI fix her with a suggestive look. ‘I remember – but those lips were one of the first things I noticed about you. I couldn’t stop thinking about them, on or off site. I kissed you a hundred times in my imagination, and once I’d actually kissed you, all I could think about was doing it again.’ I run the pad of my thumb across her plump lower lip, recalling all the wretched time I spent trying to move on, trying to forget her. It had taken no more than two seconds of seeing her face again to realize that I hadn’t forgotten a damned thing.\u003c/p\u003e\n\u003cp\u003eI wish I could read her mind. She’s a pensive, deep-thinking girl, and it’s not unusual for her to stare into space, lost in her thoughts. Normally, I’m fascinated when she does this – the shifting emotions crossing her face, marked by faint smiles, frowns or grimaces. That’s not how I feel now, when I can’t escape the uneasy awareness that her contemplations concern me.\u003c/p\u003e\n\u003cp\u003e‘What are you thinking about?’\u003c/p\u003e\n\u003cp\u003eShe blinks distractedly, and then stares up at me with eyes so dark and fathomless that I’m sure I’ll never know all the mysteries behind them. Even if I can’t follow her when she withdraws inside herself like this, I want her to know that I’ll always be there to pull her back to solid ground before she goes under. That I won’t let go.\u003c/p\u003e\n\u003cp\u003e‘I don’t want to say goodbye,’ she says, her eyes shining.\u003c/p\u003e\n\u003cp\u003e‘Then don’t say it,’ I say, ignoring the subtle premonition in her words. Ignoring the fact that she’s not asked a single question about River, or Brooke, or the adoption. Ignoring my own hunger to hear her tell me, just once, that she loves me.\u003c/p\u003e\n\u003cp\u003eRIVER\u003c/p\u003e\n\u003cp\u003eWendy told me I might get a new mama. That I might go live with her.\u003c/p\u003e\n\u003cp\u003eThe social lady came to talk to me about it – her name is Kris. She comes to talk to me sometimes. About Mama. Or about Wendy. Or about how I feel or what I think when I hide food. She said that I was just going to talk to the lady who might want to be my mama (except Kris said mother, not mama). Then she said, ‘Can you draw me a picture about that?’\u003c/p\u003e\n\u003cp\u003eThat’s what they always want me to do. Draw a picture.\u003c/p\u003e\n\u003cp\u003eI don’t want a new mama. I want to stay here with Wendy, and I wish Sean would find a new mama instead. But I don’t know how to draw that.\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eBROOKE\u003c/p\u003e\n\u003cp\u003e‘So, what you’re telling me is – we’re making a scrapbook.’ Reid lifts an eyebrow and gives me a look of undisguised bafflement. Photos and scrapbooking supplies – borrowed from my stepmother – are spread across the huge, scarred farm table in Kathryn’s kitchen where we sit side by side on a bench seat.\u003c/p\u003e\n\u003cp\u003e‘My caseworker, Sheldon, calls it a Life Book. But yeah, basically, it’s a scrapbook.’\u003c/p\u003e\n\u003cp\u003e‘And we have to do this because …?’\u003c/p\u003e\n\u003cp\u003eI heave a sigh. I can’t blame him – crafts are something neither of us does without a damned good reason, if ever. ‘River’s caseworker will give it to him, to show him who we are and where we live. Where he will live. Hopefully, his foster mother will read what we write to him. Sheldon says some kids are thrilled shitless to leave their foster homes, and some aren’t – so this helps.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/here-without-you-between-the-lines-4/page-26.html","bookId":2742,"creation":"Oct 5, 2019 4:43:32 PM","modification":"Oct 5, 2019 4:43:32 PM"}
