{"id":100910,"no":34,"title":"Page 34","content":"\u003cp\u003eWith the amount of time I spend alone – either in my trailer or walking at a barely visible distance from the huddle of trailers and sets, I think my co-stars have decided I’m one of those method actors who insists on remaining in character on and off-screen. I’ve caught insinuations that indicate as much, but I’ve no need to artificially immerse myself in the moody temperament of my current character.\u003c/p\u003e\n\u003cp\u003eI get him. Jesus Christ, do I get him.\u003c/p\u003e\n\u003cp\u003eAnd though I’m certainly drawing on my personal thoughts and emotions during filming to portray him (aka actual method acting) I’m not drawing on painful experiences from my past. All I have to do is conjure Dori, and the agony blazes through me, on cue.\u003c/p\u003e\n\u003cp\u003eBROOKE\u003c/p\u003e\n\u003cp\u003eIt’s been six days since I’ve seen him.\u003c/p\u003e\n\u003cp\u003eKathryn has been the voice of reason at every turn. ‘Don’t overwhelm him with things, Brooke,’ she says, when I want to buy him every Lego set I can find online. We choose a half-dozen, and put four of them away for later. It takes me almost an hour to narrow to a couple of plush animals – a teddy, of course, and a floppy-eared puppy (to compensate for the fact that Kathryn urges me not to buy him the real thing).\u003c/p\u003e\n\u003cp\u003eOne wall of his room at Kathryn’s has been painted green – his favourite colour, according to Wendy. His room at my condo will include lots of green – I’ve hired a trompe l’oeil artist to paint a roadway with colourful cars and background scenery all the way around at eye level. The ceiling will be baby blue, with fluffy clouds scattered from one corner to the other. His closets will be painted with chalkboard paint, so he can draw all over them.\u003c/p\u003e\n\u003cp\u003eIt appears that I can’t help but overdo.\u003c/p\u003e\n\u003cp\u003eI worry over this, too, but Kathryn laughs and shakes her head. ‘This is you, Brooke. Just try to pull back a little. Remember, what he needs is your love. That’s why poverty-stricken parents can still do a wonderful job of raising a child.’\u003c/p\u003e\n\u003cp\u003eWhat she doesn’t say: That’s why wealthy parents often fail at it. They substitute things for affection.\u003c/p\u003e\n\u003cp\u003e‘I’ll remember.’\u003c/p\u003e\n\u003cp\u003eOne thing we agree on is half-filling his built-in bookcase with books – dozens of picture books – favourites from my childhood, and anything new that catches my eye. Their spines are multi-hued and inviting when we line them up on the shelves – a miniature library. Wendy says River likes to be read to before bed, and I wonder to myself if he’d like to be read to on the flat rock by the creek, in the middle of the day, for no reason.\u003c/p\u003e\n\u003cp\u003eI buy Matchbox cars and a track with a double loop in the middle that Reid assures me every boy ever born would like, and authentic-looking construction trucks that will look even more realistic with their working parts encrusted with dirt.\u003c/p\u003e\n\u003cp\u003eI choose a green toothbrush and three kinds of toothpaste. A nightlight shaped like a racing car that switches on and off. A pair of galoshes in John Deere green, even though the forecast calls for a cool, sunny day.\u003c/p\u003e\n\u003cp\u003eRiver’s caseworker is picking him up from Wendy’s after his afternoon nap, and bringing him here. Kris has been here several times during the home study, so she’s already familiar with the place. She and Kathryn hit it off immediately – lucky for me. It took Kris longer to warm to me, but that’s the upshot of being a woman and having a blunt personality.\u003c/p\u003e\n\u003cp\u003eSometimes people just don’t like me. Go figure.\u003c/p\u003e\n\u003cp\u003eGlenn is planning a barbecue for dinner. He’s one of those guys with the manly black canvas apron boasting, Licensed to GRILL! and all the long-handled accessories you can shake a stick at. On the way home from work last night, he stocked up on supplies: sirloin patties and beef hot dogs, buns, pickles, sweet relish and shoestring potatoes.\u003c/p\u003e\n\u003cp\u003eKathryn’s charged me with assembling a fruit salad to keep me occupied (read: I’m driving her up the wall with my anxious patrolling around the house). One minute I’m happy and ridiculously domestic, and the next I’m positive someone will call to tell me they’ve made a mistake. I never should have been considered to be River’s mother. It was a court error – haha, so sorry.\u003c/p\u003e\n\u003cp\u003eWhen the phone rings, my hands jerk reflexively from the task of chopping the heads off strawberries, and I feel the sharp sting of the blade cutting through layers of skin.\u003c/p\u003e\n\u003cp\u003e‘Ouchgoddammit! I mean – darn it!’ In a matter of seconds, my index finger develops a streaming red gash.\u003c/p\u003e\n\u003cp\u003e‘Maybe handing you a paring knife wasn’t the best decision …’ Kathryn observes, turning to grab first-aid supplies from the pantry while I cleanse the cut and press a paper towel to it to stop the bleeding.\u003c/p\u003e\n\u003cp\u003eGlenn snags the phone on the third ring. ‘Y’ello?’ His expression appears concerned, which makes my heart flip over – until he says, ‘And it’s only making that noise when you’re coming to a stop, but not when you’re idling? Uh-huh. Do the noise one more time for me.’\u003c/p\u003e\n\u003cp\u003eI’m an idiot. This call is on the landline, not my cell. And it’s obviously Kelley or Kylie with some sort of car trouble, rather than the State of Texas calling to stamp out my delusions of motherhood.\u003c/p\u003e\n\u003cp\u003e‘Let’s see that grisly wound.’ Kathryn takes my hand and examines the cut. Light green eyes sparkling, she says, ‘I think we’ll be able to save the finger. Let’s bandage that up and then give you something less disaster-prone to do while we wait.’\u003c/p\u003e\n\u003cp\u003eAs though I’m six again, my stepmother seats me on the corner barstool, applies ointment to the gash and covers it with a neon-pink bandage.\u003c/p\u003e\n\u003cp\u003e‘Reid told me that you’re my role model, instead of Sharla,’ I say, and her worried gaze flashes to mine. ‘I must have known that, deep down, for years. But I never really acknowledged it. I always thought who I was – who I’d become – came down to blood, but that’s just not true. I don’t know who I’d be without you. Which seems pretty damned unfair, given the fact that my existence ruined your life.’\u003c/p\u003e\n\u003cp\u003ePressing a kiss to my forehead, she sighs. ‘Oh, honey – take a look around. Does my life look ruined to you? I have three very beautiful, talented daughters, a loving –’ We hear Glenn outside, preparing the patio cooking area and belting out his own version of an eighties pop song, in which grills are crazy about sharp-dressed men. ‘– slightly insane husband, and I’m preparing to become a grandmother twice in the next few months! I have a wonderful life, Brooke, and I’m happy you’re part of it.’\u003c/p\u003e\n\u003cp\u003eWhen the doorbell chimes, I freeze in place. I can’t breathe.\u003c/p\u003e\n\u003cp\u003e‘Go and answer the door, honey,’ Kathryn urges, slipping outside with Glenn so River won’t be overwhelmed with new faces, everyone hovering, before he even gets in the door.\u003c/p\u003e\n\u003cp\u003eI walk to the door, shaking, and pull it open, hoping my smile looks friendly instead of panic-stricken. There he stands, gripping Kris’s hand as securely as I’d held Reid’s on Wendy’s front porch just a week ago. Next to him is a miniature rolling case shaped like a rather squared-off frog. Green, of course. He makes no move to enter, and his unsmiling expression doesn’t waver.\u003c/p\u003e\n\u003cp\u003eAccording to Wendy, River is forty inches tall and weighs thirty-four pounds, putting him in the sixteenth centile for both height and weight. The medical consensus: nutritional deprivation for some portion of his first few years; with proper nourishment, he may be able to make up for some of it. In our pre-visit call last night, she notified me about his food hoarding, and the psychological causes of it. ‘Also, he sometimes experiences nightmares – and occasionally, night terrors. Most nights, now, he sleeps just fine. But these are a possibility since he’ll be in an unfamiliar environment.’\u003c/p\u003e\n\u003cp\u003eI calmly accepted everything Wendy said, asking pertinent questions and taking meticulous notes, and when I got off the phone, I walked to the creek, sat on my rock and cried until my throat was raw.\u003c/p\u003e\n\u003cp\u003eI squat down to his level and fix a careful smile on my face. I’m an actor. I can do this.\u003c/p\u003e\n\u003cp\u003eYears ago, I found a skittish litter of kittens living under Glenn’s tool shed. They were lightning-fast balls of fluff, and I wanted to hold one of them more than life itself. So I sat in the grass all afternoon, as close to motionless as I could manage, cooing and sweet-talking as though I was the safest girl who ever lived.\u003c/p\u003e\n\u003cp\u003eModerating my voice in that same way, I speak to my son, to whom I am still a stranger.\u003c/p\u003e\n\u003cp\u003e‘Hello, River. I’m glad you’ve come to visit. Would you like to come inside?’\u003c/p\u003e\n\u003cp\u003eLike those kittens, his dark blue eyes regard me warily, assessing whether I can be trusted. An eternity passes before he nods, once.\u003c/p\u003e\n\u003cp\u003eStanding, I welcome Kris as well and offer to take River’s case. His soft little fingers brush mine as he passes the handle to me, and I turn and lead the way through the living room and down the wide hallways, biting my lip.\u003c/p\u003e\n\u003cp\u003e‘Your room is right next to mine. Here we are.’\u003c/p\u003e\n\u003cp\u003ePausing in the doorway, he angles his head and scans the room – eyes moving deliberately over each individual object. I place his case on the bed and wait. When his gaze reaches me, he doesn’t skip past. I’m given the same careful regard as everything else. The thing that finally lures him into the room is the golden-coated stuffed puppy. Drifting closer, he comes to the opposite side of the twin bed, chewing his bottom lip. Kris remains in the doorway.\u003c/p\u003e\n\u003cp\u003e‘I think that puppy needs to be held.’ My voice is still whisper-soft. ‘Know why?’\u003c/p\u003e\n\u003cp\u003eHis eyes flick to mine.\u003c/p\u003e\n\u003cp\u003e‘Because we’re having hot dogs for dinner, so he’s a little worried.’\u003c/p\u003e\n\u003cp\u003eOne eyebrow quirks up, and I suppress a gasp – for the beat of two seconds, he is Reid, and I know in that moment that he’s going to be fine. I’ve never known anyone as stubborn and indomitable as this child’s father … unless it’s his mother. He’s survived the hand he was dealt because he’s tough as nails, as small and breakable as he appears.\u003c/p\u003e\n\u003cp\u003eI quirk a brow back at him. ‘We’re going to eat outside. You can bring him along if you want. He doesn’t have a name yet. I was thinking about calling him Hot Dog, but maybe that’s why he’s worried about what’s for dinner.’\u003c/p\u003e\n\u003cp\u003eHis mouth twists on one side this time, his eyes shifting back to the puppy.\u003c/p\u003e\n\u003cp\u003e‘Kris, would you like to stay for dinner?’ I offer.\u003c/p\u003e\n\u003cp\u003eShe shakes her head, smiling. ‘I think you’ve got this. Let me know if you need me – you have my numbers?’\u003c/p\u003e\n\u003cp\u003eI nod. ‘Programmed into every phone we’ve got, and your card is on the fridge.’\u003c/p\u003e\n\u003cp\u003e‘Awesome.’ She turns her smile to him. ‘Goodnight, River. I’ll see you tomorrow after lunch, okay?’\u003c/p\u003e\n\u003cp\u003eWhen I turn back, he has the puppy clutched to his chest. He looks at me one more time before nodding to her, giving her permission to leave him here with me. Alone.\u003c/p\u003e\n\u003cp\u003e26\u003c/p\u003e\n\u003cp\u003eRIVER\u003c/p\u003e\n\u003cp\u003eBrooke is pretty. Her hair looks soft, and I like her smile. Kathryn is nice, and even Glenn is nice. He’s way, way bigger than Harry, but he doesn’t scare me. He shows me how he makes broccoli taste better by sticking the tree part into a bowl of cheese.\u003c/p\u003e\n\u003cp\u003eI didn’t know cheese could come in a bowl. I like it.\u003c/p\u003e\n\u003cp\u003eBrooke and Kathryn don’t eat the cheese, but Glenn does and I do. I try my potato sticks and my hot dog in it too. (The food hot dog, not the puppy Hot Dog.) I try dipping a berry in it, but that isn’t very good. \u003c/p\u003e","sourceLink":"https://allnovel.net/here-without-you-between-the-lines-4/page-34.html","bookId":2742,"creation":"Oct 5, 2019 9:50:56 PM","modification":"Oct 5, 2019 9:50:56 PM"}
