{"id":91055,"no":1,"title":"Page 1","content":"\u003cp\u003eTo my wife, Diane and to Bryan, Geno, and Caitlin for their support and patience through this experience.\u003c/p\u003e\n\u003cp\u003eAnd to my parents, Geno and Irene. For believing in me even when I didn\u0027t.\u003c/p\u003e\n\u003cp\u003eWhenever an author takes on a project like this, especially if it is his first novel, there are invariably a number of people who help him accomplish the task. The writing of The Crystal Shard was no exception.\u003c/p\u003e\n\u003cp\u003ePublishing a novel involves three elements: a degree of talent; a lot of hard work; and a good measure of luck. The first two elements can be controlled by the author, but the third involves being in the right place at the right time and finding an editor who believes in your ability and dedication to the task at hand.\u003c/p\u003e\n\u003cp\u003eTherefore, my greatest thanks go to TSR, and especially to Mary Kirchoff, for taking a chance on a first time author and guiding me throughout the process.\u003c/p\u003e\n\u003cp\u003eWriting in the 1980s has become a high-tech chore as well as an exercise in creativity. In the case of The Crystal Shard, luck once again worked on my side. I consider myself lucky to have a friend like Brian P. Savoy, who loaned me his software expertise in smoothing out the rough edges.\u003c/p\u003e\n\u003cp\u003eMy thanks also to my personal opinion-givers, Dave Duquette and Michael LaVigueur, for pointing out strengths and weaknesses in the rough draft, to my brother, Gary Salvatore, for his work on the maps of Icewind Dale, and to the rest of my AD\u0026amp;D game group, Tom Parker, Daniel Mallard, and Roland Lortie, for their continued inspiration through the development of eccentric characters fit to wear the mantle of a hero in a fantasy novel.\u003c/p\u003e\n\u003cp\u003eAnd finally, to the man who truly brought me into the world of the AD\u0026amp;D game, Bob Brown. Since you moved away (and took the pipe smoke with you) the atmosphere around the gaming table just hasn\u0027t been the same. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-crystal-shard-the-icewind-dale-trilogy-1/page-1.html","bookId":2102,"creation":"Oct 5, 2019 5:47:08 PM","modification":"Oct 5, 2019 5:47:08 PM"}
