{"id":91078,"no":24,"title":"Page 24","content":"\u003cp\u003eHe ran under the bright sun of day; he ran under the dim stars of the night, ever with the east wind in his face. His long legs and great strides carried him tirelessly, a mere speck of movement in the empty plain. For days Wulfgar pushed himself to the absolute limits of his endurance, even hunting and eating on the run, stopping only when exhaustion felled him in his tracks.\u003c/p\u003e\n\u003cp\u003eFar to the south of him, rolling out of the Spine of the World like a toxic cloud of foul-smelling vapors, came the goblin and giant forces of Akar Kessell. With minds warped by the willpower of the crystal shard, they wanted only to kill, only to destroy. Only to please Akar Kessell.\u003c/p\u003e\n\u003cp\u003eThree days out from the dwarven valley, the barbarian came across the jumbled tracks of many warriors all leading toward a common destination. He was glad that he was able to find his people so easily, but the presence of so many tracks told him that the tribes were gathering, a fact that only emphasized the urgency of his mission. Spurred by necessity, he charged onward.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t fatigue but solitude that was Wulfgar\u0027s greatest enemy. He fought hard to keep his thoughts on the past during the long hours, recalling his vow to his dead father and contemplating the possibilities of his victories. He avoided any thought of his present path, though, understanding well that the sheer desperation of his plan might well destroy his resolve.\u003c/p\u003e\n\u003cp\u003eYet this was his only chance. He was not of noble blood, and he had no Rights of Challenge against Heafstaag. Even if he defeated the chosen king, none of his people would recognize him as their leader. The only way that one such as he could legitimitize a claim to tribal kingship was through an act of heroic proportions.\u003c/p\u003e\n\u003cp\u003eHe bounded on, toward the same goal that had lured many would-be kings before him to their deaths. And in the shadows behind him, cruising with the graceful ease that marked his race, came Drizzt Do\u0027Urden.\u003c/p\u003e\n\u003cp\u003eEver eastward, toward the Reghed Glacier and a place called Evermelt.\u003c/p\u003e\n\u003cp\u003eToward the lair of Ingeloakastimizilian, the white dragon the barbarians simply called \"Icingdeath.\"\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;\u003c/p\u003e","sourceLink":"https://allnovel.net/the-crystal-shard-the-icewind-dale-trilogy-1/page-24.html","bookId":2102,"creation":"Oct 5, 2019 5:47:08 PM","modification":"Oct 5, 2019 5:47:08 PM"}
