{"id":96016,"no":15,"title":"Page 15","content":"\u003cp\u003eDullsville High School\u0027s prom night--one evening I was lucky I wasn\u0027t a vampire. If I had to wait until sunset just to rise from sleep, I\u0027d never have time to shower, fix my hair, change from combat boots to witchy boots, decide between onyx and spiderweb earrings, rework my hair, and reapply my eyeliner. Most important, I would be nothing without a mirror.\u003c/p\u003e\n\u003cp\u003eI looked like a medieval dark angel. All that was missing was my vampire teeth.\u003c/p\u003e\n\u003cp\u003eGlancing out the window, I saw Alexander pull Jameson\u0027s Mercedes into our driveway. As I reapplied my lipstick and made the final touches to my makeup, I could hear the doorbell ring and mumbled greetings.\u003c/p\u003e\n\u003cp\u003e\"Alexander\u0027s here,\" my mother called up to me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming,\" I answered.\u003c/p\u003e\n\u003cp\u003eWith one hand I gathered the bottom of my dress, and with the other I carried my open parasol. I descended the staircase like the bride of Dracula. Alexander and my parents were seated in the living room.\u003c/p\u003e\n\u003cp\u003eWhen Alexander saw me, his eyes lit up and he immediately rose. My heart dropped. He appeared more gorgeous than I\u0027d imagined. Alexander looked like a sexy vampire idol in a silky chic dark suit with a red handkerchief poking out of his breast pocket. His hair hung in his face as his midnight eyes sparkled. He flashed me a sweet smile.\u003c/p\u003e\n\u003cp\u003eAlexander held his hand over his heart. \"You are so beautiful. I believe you\u0027ve taken my breath away.\"\u003c/p\u003e\n\u003cp\u003eHe politely kissed me on my cheek. His soft velvet lips sent chills racing through me.\u003c/p\u003e\n\u003cp\u003eAlexander handed me a black rectangular box.\u003c/p\u003e\n\u003cp\u003eI opened the box. A red rose with white baby\u0027s breath was attached to an elastic lace band with red rhinestones.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"It matches her dress to a tee. How did you know?\" my mother asked.\u003c/p\u003e\n\u003cp\u003e\"I want to put it on,\" I said excitedly.\u003c/p\u003e\n\u003cp\u003eMy mother helped take the corsage out of the box and handed it to Alexander.\u003c/p\u003e\n\u003cp\u003e\"I thought this was safer than sticking you with a pin like I did when we attended the Snow Ball,\" he said as he slid the corsage over my wrist.\u003c/p\u003e\n\u003cp\u003e\"Billy,\" my father called. \"Come down and see your sister.\"\u003c/p\u003e\n\u003cp\u003e\"We have to take pictures,\" my mother gushed.\u003c/p\u003e\n\u003cp\u003e\"No!\" I said.\u003c/p\u003e\n\u003cp\u003eMy parents looked at me oddly. \"It\u0027s bad luck.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about? Generations of people have taken pictures of their proms and have them in photo albums for years. It\u0027s a tradition,\" my mother corrected.\u003c/p\u003e\n\u003cp\u003eAlexander\u0027s eyes turned sorrowful. I could tell he felt he was denying me memories to cherish for a lifetime.\u003c/p\u003e\n\u003cp\u003eHe grabbed my hand. \"Mrs. Madison, I\u0027ll never be able to get out of my mind how beautiful Raven is today. A picture could never compare to her real beauty or be able to capture her heart and soul.\"\u003c/p\u003e\n\u003cp\u003eMy mom was stunned. She put her hand over her mouth like she was watching a made-for-TV movie unfold in her very own living room. \"You are making me misty-eyed.\"\u003c/p\u003e\n\u003cp\u003e\"We have to go,\" I finally said.\u003c/p\u003e\n\u003cp\u003e\"We have dinner reservations,\" Alexander stated proudly.\u003c/p\u003e\n\u003cp\u003e\"Really?\" my mother remarked. \"Where?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a surprise,\" Alexander answered sweetly. Billy Boy sauntered down the stairs and sized up my Victorian garb. \"For a vampire, you look awesome,\" he commented.\u003c/p\u003e\n\u003cp\u003e\"You say the most wonderful things!\" I hugged my bewildered brother and my gushing parents. Then Alexander and I flew out the door.\u003c/p\u003e\n\u003cp\u003e\"Are we going to Hatsy\u0027s Diner?\" I asked as we drove toward town.\u003c/p\u003e\n\u003cp\u003eAlexander continued to drive in silence as I tried to guess where he was taking me. Finally he parked in front of Dullsville\u0027s cemetery. \"Old Jim, the caretaker, is at Lefty\u0027s Tavern for the night,\" he stated knowingly. \"No one will bother us, except for the occasional mischievous ghost.\"\u003c/p\u003e\n\u003cp\u003eAlexander led me by the hand between the tombstones to the back end of the cemetery. A weeping willow was draped with its branches over a rectangular wooden table covered with a black lace tablecloth and set for two with fine china and sterling silverware.\u003c/p\u003e\n\u003cp\u003eAlexander lit the antique candelabra and politely held my chair out for me.\u003c/p\u003e\n\u003cp\u003eBeside each plate was a covered dish. The setting was beautifully morose. I wondered what the main course could be. I\u0027d watched way too many horror films and I imagined opening the aluminum covers to find severed heads. However, when Alexander lifted them, a delicious sight and smell lay before us--a dinner of lemon chicken, buttered green beans, and rice pilaf.\u003c/p\u003e\n\u003cp\u003eAlexander poured us sparkling cherry wine in pewter goblets.\u003c/p\u003e\n\u003cp\u003e\"This is way better than the Cricket Club,\" I said.\u003c/p\u003e\n\u003cp\u003e\"To us,\" he said as we toasted our goblets.\u003c/p\u003e\n\u003cp\u003eThe sparkling wine tickled my tongue, and Alexander and I began our meal.\u003c/p\u003e\n\u003cp\u003e\"Just when I thought you\u0027d outdone yourself at the cave, you present me a five-star dinner at a cemetery.\"\u003c/p\u003e\n\u003cp\u003eI gazed across the table, the candlelight glowing against Alexander\u0027s pale skin, highlighting his dark, mysterious eyes and sweet smile.\u003c/p\u003e\n\u003cp\u003eI had to pinch my arm to remind myself that this amazing and unusual romantic dinner with a vampire was undoubtedly real. As Alexander drove through Dullsville High\u0027s parking lot, I couldn\u0027t believe my eyes. A half-dozen white limousines were lined up at the school\u0027s front entrance, dropping off groups of Dullsvillian teenagers as if they were movie stars. Next to the white stretches, Jameson\u0027s black Mercedes looked like a hearse.\u003c/p\u003e\n\u003cp\u003eFrom one limo emerged some of the soccer team members. A handsome Matt Wells extended his hand and helped my best friend, Becky, ease out of the elongated car.\u003c/p\u003e\n\u003cp\u003eAt the head of the monstrous limo line, out popped Trevor and Jennifer Warren. As if it wasn\u0027t costly enough to arrive in a limousine, Trevor had a stretch for just the two of them.\u003c/p\u003e\n\u003cp\u003eAlexander pulled over and, ever the consummate gentleman, helped me out of the car. While he parked the Mercedes, I admired the red, white, and pink balloons tied by red ribbon to the railings of the gymnasium entrance.\u003c/p\u003e\n\u003cp\u003eMy heart melted again when I saw Alexander in his silky black suit walking up the sidewalk of my school toward me.\u003c/p\u003e\n\u003cp\u003eThere were so many students going in the main entrance, Alexander held back. Though he was glad to be going, I could tell he was equally overwhelmed in his new surroundings. He wasn\u0027t used to so many people in such a small area, fussing and flashing pictures.\u003c/p\u003e\n\u003cp\u003eI pulled him away from the crowd just to be sure he\u0027d be safe from the cameras.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go through here,\" I said, stepping out of the crowded line.\u003c/p\u003e\n\u003cp\u003eWe started for the side door, which was not being used.\u003c/p\u003e\n\u003cp\u003eAs we walked through the corridors, Alexander studied everything--the trophy case, a display of yearbooks past, a bulletin board of weekly announcements. The mundane things I passed by on a daily basis and didn\u0027t even notice were like fascinating artifacts to my boyfriend.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like a museum,\" he said.\u003c/p\u003e\n\u003cp\u003e\"A boring one, right?\"\u003c/p\u003e\n\u003cp\u003e\"No, it helps me understand you more.\"\u003c/p\u003e\n\u003cp\u003eI gazed up at Alexander and squeezed his hand.\u003c/p\u003e\n\u003cp\u003eAs we headed for the gymnasium, we passed giggling girls in gowns running to the bathroom to touch up their makeup and gossip about their dates--or possibly us.\u003c/p\u003e\n\u003cp\u003eSuddenly Alexander stopped. \"Can we see your locker? I want to know as much as I can about how you spend your day.\"\u003c/p\u003e\n\u003cp\u003e\"My locker?\" I asked. \"It\u0027s just a junky aluminum closet.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s your junk,\" he said in a velvety voice. \"I want to know everything about you.\"\u003c/p\u003e\n\u003cp\u003eHis comment took my breath away. I held his hand in mine. \"It\u0027s back this way.\"\u003c/p\u003e\n\u003cp\u003eWe walked past the auditorium and biology and chemistry labs.\u003c/p\u003e\n\u003cp\u003eI spun the dial back and forth to the unlocking coordinates and opened my locker.\u003c/p\u003e\n\u003cp\u003eI was stunned. There, hanging on my door and filling the thin locker walls, were tiny painted portraits of Alexander and me. One of us in front of Hatsy\u0027s Diner, one dancing at Dullsville\u0027s golf course, and one designed with four vertical poses, as if it were a strip from a photo booth.\u003c/p\u003e\n\u003cp\u003e\"These are amazing!\"\u003c/p\u003e\n\u003cp\u003eAlexander beamed as one by one I viewed his astounding works of art. \"How did you get in here? I thought I was the only one who liked to sneak into places.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been trying to give these to you since the cave. But I think this worked out better.\"\u003c/p\u003e\n\u003cp\u003e\"I love them!\"\u003c/p\u003e\n\u003cp\u003e\"Now you can always see us together--and be like all the other girls with normal boyfriends.\"\u003c/p\u003e\n\u003cp\u003eI gave Alexander a huge hug and kissed him tenderly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want a normal boyfriend.\"\u003c/p\u003e\n\u003cp\u003eHe pushed my hair off my shoulder.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to leave them,\" I said of my prized possessions. \"I want to stare at them forever.\"\u003c/p\u003e\n\u003cp\u003e\"Well, the real thing will have to do for tonight,\" he said, taking the picture of us on the golf course from my hand and tacking it back on my locker door. \"I can hear the music starting.\"\u003c/p\u003e\n\u003cp\u003eI shut the door on my picture shrine, and Alexander and I eagerly made our way to the gymnasium.\u003c/p\u003e\n\u003cp\u003eIn bold letters above the gymnasium door hung a sign that read VIVA LAS VALENTINES. Red and white Mylar balloons and bright candy-colored streamers hung down over the entranceway like a beaded curtain. Dozens of Dullsville\u0027s decked-out students were mingling and filing into prom. I opened my silver chain-link purse and handed our tickets to an attending chaperone. I looked up. It was my study hall teacher, Mr. Ferguson.\u003c/p\u003e\n\u003cp\u003e\"I see you finally came back,\" he said sternly, referring to my not returning to study hall.\u003c/p\u003e\n\u003cp\u003e\"There was a long line at the water fountain.\" Mr. Ferguson studied Alexander as we quickly filed past him and made our way into the gymnasium turned ballroom.\u003c/p\u003e\n\u003cp\u003eWhile the Snow Ball was elegant with its winter theme, the Prom Decorating Committee had outdone itself. Gigantic Necco-like candied paper hearts hung from the rafters like sugarcoated snowflakes. Phrases like BE MINE, TRUE LOVE, LET\u0027S KISS, BE GOOD, SWEET TALK, and MY LOVE--in baby blue, Barbie pink, sunflower yellow, winter white, lavender lilac, and mermaid green danced within arms\u0027 reach in the air above us. The white gymnasium walls, normally covered with Dullsville High banners, were replaced with three-foot-high cupid cutouts and pink hearts. The hardwood basketball floors were sprinkled with red and white heart-shaped confetti. In one corner, a photographer was stationed to snap pictures of gown-and tuxedo-clad students with a giant red heart and white lacy valentine as a backdrop.\u003c/p\u003e\n\u003cp\u003eThe band the Caped Crusaders, four men in their thirties wearing trendy black suits with cupid wings and white tennis shoes, were jamming on a makeshift stage underneath the home team\u0027s basket.\u003c/p\u003e\n\u003cp\u003eDullsville\u0027s students had metamorphosed from cheerleaders and jocks into princesses and princes. Girls glistened in their evening gowns--a rainbow of pink, blue, red, and orange dresses from Jack\u0027s department store swept over the basketball court as if we were at a Hollywood premiere.\u003c/p\u003e\n\u003cp\u003eI noticed a small brunette girl in an amazing blue vintage gown holding the hand of her dashing young date.\u003c/p\u003e\n\u003cp\u003e\"Becky!\" I called, running over to her.\u003c/p\u003e\n\u003cp\u003e\"Raven! I rode in a limousine!\"\u003c/p\u003e\n\u003cp\u003e\"I know. I saw you get out. You looked like a movie star!\"\u003c/p\u003e\n\u003cp\u003e\"You are the prettiest one here!\" she gloated.\u003c/p\u003e\n\u003cp\u003e\"No way, you are! That dress is so you--and so gorgeous!\" While Becky and I gushed, Alexander and Matt made small talk.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get our picture taken,\" Becky said. \"All four of us.\"\u003c/p\u003e\n\u003cp\u003eMy heart sank. Again I would have to miss pictures with Alexander.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still blinded from all the flashes at home,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Very funny.\" Becky pulled my arm and eagerly led me to the photo area. I glanced back. Matt was following us, but my dark-suited boyfriend stayed still.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Alexander?\" Matt asked. \"I thought he was right behind me.\"\u003c/p\u003e\n\u003cp\u003e\"He hates pictures. Something about them stealing your soul,\" I rambled on.\u003c/p\u003e\n\u003cp\u003eA crowd of promgoers gathered, waiting for their Kodak moment. All of a sudden, Becky pulled Alexander from between a group of couples standing behind us.\u003c/p\u003e\n\u003cp\u003e\"Your turn,\" the photographer said, pointing to me.\u003c/p\u003e\n\u003cp\u003eI froze, but Becky pulled me to the black duct-taped X marked on the center of the floor. \"I\u0027ll cherish this forever.\u003c/p\u003e\n\u003cp\u003e\"Maybe they\u0027ll pick this one for the yearbook,\" she continued.\u003c/p\u003e\n\u003cp\u003e\"We can only hope,\" I said through a cheesy grin.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know vampires showed up on film,\" I heard one of the students say. They were referring to me.\u003c/p\u003e\n\u003cp\u003eThe photographer angled Becky and me in a V shape and arranged Matt and Alexander behind us as if they were giant game pieces.\u003c/p\u003e\n\u003cp\u003eI glanced back at Alexander, who I was surprised to find smiling for the camera. \"On the count of three,\" the photographer said. \"One, two--\"\u003c/p\u003e\n\u003cp\u003e\"Hachoo!\" I said, faking a sneeze.\u003c/p\u003e\n\u003cp\u003e\"Bless you,\" my friends said.\u003c/p\u003e\n\u003cp\u003e\"Gesundheit,\" the photographer said, stepping away from his digital camera. \"Again, on the count of three.\" He focused behind the camera. \"One, two--\"\u003c/p\u003e\n\u003cp\u003e\"I really must get a tissue,\" I said, holding my hand up.\u003c/p\u003e\n\u003cp\u003eBecky held my arm so I couldn\u0027t move.\u003c/p\u003e\n\u003cp\u003e\"I have three hundred pictures to take this evening. I can\u0027t take the picture if you keep moving,\" the photographer warned.\u003c/p\u003e\n\u003cp\u003eI could feel the crowd around us getting restless.\u003c/p\u003e\n\u003cp\u003eThe photographer stepped behind the camera.\u003c/p\u003e\n\u003cp\u003e\"One--\" The flash went off. Tricky man. Luckily the room was bright enough that the flash didn\u0027t blind me, much less Alexander.\u003c/p\u003e\n\u003cp\u003eAnother couple scurried toward us, making their way for our spots.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thirsty,\" Alexander said anxiously, suddenly leading me through the crowd and away from the photographer.\u003c/p\u003e\n\u003cp\u003eAs Alexander and I made our escape, I could hear Matt calling us.\u003c/p\u003e\n\u003cp\u003e\"We have to take it again,\" he said. \"The photographer cut Alexander out of the picture.\"\u003c/p\u003e\n\u003cp\u003eMy nonphotographic boyfriend and I gathered at the punch bowl. The refreshment table was sprinkled with red and white chocolate kisses, bowls of Red Hots, and heart-shaped boxes filled with more chocolates. I saw Jennifer Warren in the black cocktail dress I had wanted to purchase at Jack\u0027s. I was still annoyed she had pulled the dress out from under my nose, but she really did fill out the dress so beautifully that I couldn\u0027t help but tell her so.\u003c/p\u003e\n\u003cp\u003e\"That dress was made for you.\"\u003c/p\u003e\n\u003cp\u003e\"And yours as well,\" she said with a catlike grin.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I replied.\u003c/p\u003e\n\u003cp\u003eDeep down I knew she didn\u0027t mean it as a compliment.\u003c/p\u003e\n\u003cp\u003eTrevor, in an unbuttoned sleek black tux, crisp white shirt, and solid red silk tie, walked over to Jennifer.\u003c/p\u003e\n\u003cp\u003eHe looked me over from my midnight black hair to my charcoal witchy boots.\u003c/p\u003e\n\u003cp\u003e\"Too bad you didn\u0027t want that dance,\" he said softly. \"I was planning on showing you a night to remember.\"\u003c/p\u003e\n\u003cp\u003e\"It will be a night to remember. Only I\u0027ll be forgetting you were in it.\"\u003c/p\u003e\n\u003cp\u003eJust then, Alexander stepped between us. The Caped Crusaders began to play \"Love Shack.\"\u003c/p\u003e\n\u003cp\u003e\"May I have this dance?\" Alexander said, offering his hand.\u003c/p\u003e\n\u003cp\u003eWe left Trevor by the refreshments and for the next hour, Alexander and I rocked and rolled until I was seeing hearts. Finally we were both so exhausted, we headed back to the punch bowl for a pick-me-up.\u003c/p\u003e\n\u003cp\u003eMr. Ferguson took center stage and stood in front of the Caped Crusaders. \"I\u0027d like to thank you all for coming out tonight for Viva las Valentines!\" he said into the microphone to massive applause. \"I\u0027d like to thank the Decorating Committee for volunteering their time and transforming the gymnasium into a valentine paradise.\" \"Go, Becky!\" I shouted, clapping for my best friend who was standing next to me.\u003c/p\u003e\n\u003cp\u003e\"And finally to Shirley\u0027s Bakery for the candies and refreshments,\" Mr. Ferguson continued.\u003c/p\u003e\n\u003cp\u003e\"Now we\u0027re applauding the punch bowl,\" I whispered to Alexander.\u003c/p\u003e\n\u003cp\u003e\"I am very pleased to announce tonight\u0027s King and Queen.\"\u003c/p\u003e\n\u003cp\u003e\"Woohoo!\" a soccer snob shouted over the sound of applause.\u003c/p\u003e\n\u003cp\u003e\"Drumroll, please...,\" Mr. Ferguson commanded.\u003c/p\u003e\n\u003cp\u003eThe crowd stood quiet as my study hall teacher opened a letter- sized valentine.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to present to you this year\u0027s Prom King...Trevor Mitchell.\"\u003c/p\u003e\n\u003cp\u003eTrevor high-fived his soccer-snob teammates and ran up onstage like he was receiving the World Cup.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. \"Big surprise. When Daddy owns all the land in Dullsville,\" I whispered to Alexander, \"he can afford to buy his son a throne.\"\u003c/p\u003e\n\u003cp\u003eHeather came over to Trevor, who was now standing center stage, waving to the crowd, and placed a silver staff in his hand and a crown on top of his blond locks.\u003c/p\u003e\n\u003cp\u003e\"And this year\u0027s prom queen...\" Mr. Ferguson opened the second valentine and began to say, \"Jen--\"\u003c/p\u003e\n\u003cp\u003eJennifer Warren started for the aisle.\u003c/p\u003e\n\u003cp\u003eMr. Ferguson\u0027s eyes bulged out like Jameson\u0027s. He cleared his throat and said, \"I mean, Raven Madison.\"\u003c/p\u003e\n\u003cp\u003eThe crowd went quiet. \"Raven Madison,\" he said again.\u003c/p\u003e\n\u003cp\u003eI stared at Trevor, who gave me a triumphant wink.\u003c/p\u003e\n\u003cp\u003eAll eyes were on me as the spotlight hit my face.\u003c/p\u003e\n\u003cp\u003e\"This must be wrong,\" I said to Alexander.\u003c/p\u003e\n\u003cp\u003eJennifer Warren stood stunned at the foot of the stage. \"This is my senior year! I demand a recount!\"\u003c/p\u003e\n\u003cp\u003eBecky started clapping. \"Raven, Raven!\" The other promgoers were as shocked as I was, but they joined her.\u003c/p\u003e\n\u003cp\u003e\"Raven! Raven! Raven!\" the crowd began to cheer.\u003c/p\u003e\n\u003cp\u003e\"Get up there,\" Becky said, pushing me toward the stage.\u003c/p\u003e\n\u003cp\u003eI gathered my dress and walked up the few stairs toward the stage. It felt like an eternity, walking in slow motion, as I headed over to Trevor and Mr. Ferguson. Heather came over, gave me an evil look, put a silver faux-diamond-encrusted tiara on my head, and handed me a bouquet of red roses.\u003c/p\u003e\n\u003cp\u003eI awkwardly smiled as the crowd cheered. I felt like I was in a scene from Carrie. I now knew what my payback from Trevor would be. He\u0027d imagined that I\u0027d be excited that I, the school oddball, had been chosen by the student body to be Prom Queen. At any moment, just like in the horror film, a bucket of pig\u0027s blood would fall on me, embarrassing and belittling me in front of the whole school.\u003c/p\u003e\n\u003cp\u003eOnly I had a different weapon than Carrie had.\u003c/p\u003e\n\u003cp\u003eA Victorian parasol.\u003c/p\u003e\n\u003cp\u003eI opened my elegant umbrella and glared back at Trevor, then the crowd.\u003c/p\u003e\n\u003cp\u003eI waited. And waited. And waited. Nothing came down. Not even heart-shaped confetti from the ceiling.\u003c/p\u003e\n\u003cp\u003eI stared out into the crowd of Dullsville High faces, all looking confused. Then it hit me and I realized my fate.\u003c/p\u003e\n\u003cp\u003eTrevor had a far worse plan for me than embarrassing me with pig\u0027s blood--he wanted to dance with me in front of the whole school and, most important, Alexander.\u003c/p\u003e\n\u003cp\u003e\"This dance belongs to Prom King and Queen, Trevor Mitchell and Raven Madison,\" Mr. Ferguson announced.\u003c/p\u003e\n\u003cp\u003eAll eyes were on me. I wanted to run, but I was surrounded by staring students.\u003c/p\u003e\n\u003cp\u003eTrevor gripped my hand harder than a goalie holding a soccer ball.\u003c/p\u003e\n\u003cp\u003eI saw Alexander, who stared back at me, his eyes lonely, clapping with the rest of the students. I felt awful holding another guy\u0027s hand in front of Alexander, especially the hand of my nemesis.\u003c/p\u003e\n\u003cp\u003eTrevor led me down the steps of the stage and pulled me onto the center of the dance floor.\u003c/p\u003e\n\u003cp\u003eThe lights dimmed, and red hearts danced around the gymnasium walls and floor.\u003c/p\u003e\n\u003cp\u003eI could barely breathe. Trevor put his arm around my waist and pulled me close.\u003c/p\u003e\n\u003cp\u003eI was dizzy from the lights and the music. I felt sick to my stomach. I didn\u0027t invite Alexander to come with me to prom to watch me dance with Trevor Mitchell.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t care what prom protocol dictated or who Trevor had paid off. I pulled away from my nemesis. \"You fixed this,\" I yelled over the music. \"I\u0027m not really Prom Queen. This dance belongs to Jennifer Warren.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t ditch me in front of the whole school,\" Trevor said through gritted teeth, trying to grasp my hand back.\u003c/p\u003e\n\u003cp\u003e\"Forget it!\"\u003c/p\u003e\n\u003cp\u003e\"Once a freak, always a freak. I\u0027ll get you, Monster Girl.\"\u003c/p\u003e\n\u003cp\u003eTrevor\u0027s words churned through my veins like jagged glass. As far as Trevor and I\u0027d come in the last few weeks, we were right back to being two kids in kindergarten.\u003c/p\u003e\n\u003cp\u003eI pulled my tiara off my head.\u003c/p\u003e\n\u003cp\u003eJennifer, who was being consoled by the Prada shoe snob, smiled at me.\u003c/p\u003e\n\u003cp\u003e\"This belongs to you.\" I handed her my tiara.\u003c/p\u003e\n\u003cp\u003eI turned around, triumphant, to celebrate with my vampire boyfriend.\u003c/p\u003e\n\u003cp\u003eInstead, all the smiling faces I saw were mortal.\u003c/p\u003e\n\u003cp\u003eI looked everywhere, making myself dizzy searching for Alexander in the sea of promgoers as they watched Trevor and Jennifer Warren dance. It took me a moment to catch my breath, my heart was beating so fast. I pushed through the crowd and found Becky and Matt. \"Where is Alexander?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. He was here a minute ago. I can\u0027t believe you are Prom Queen! Why did you give your tiara to Jennifer?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll talk later. I have to find Alexander.\" \"Hey--we have to retake the picture of us,\" Matt called to me.\u003c/p\u003e\n\u003cp\u003eI searched the tables where couples were sitting. Not a vampire among them.\u003c/p\u003e\n\u003cp\u003e\"Have you seen Alexander?\" I asked our class treasurer.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s Alexander?\"\u003c/p\u003e\n\u003cp\u003eI ran over to the punch table. A few couples were munching on chocolate kisses.\u003c/p\u003e\n\u003cp\u003e\"Have any of you seen Alexander?\"\u003c/p\u003e\n\u003cp\u003e\"Alexander who?\" one kid answered. \"The zombie? I think he\u0027s already been buried.\"\u003c/p\u003e\n\u003cp\u003eMy heart sank.\u003c/p\u003e\n\u003cp\u003eI raced to the side exit. A sign read EMERGENCY USE ONLY. IF DOOR IS OPENED, ALARM WILL SOUND.\u003c/p\u003e\n\u003cp\u003eDrats!\u003c/p\u003e\n\u003cp\u003eI passed the photographer, who was dismantling his equipment. I flew out the gymnasium entrance and hurried down the hallway.\u003c/p\u003e\n\u003cp\u003eMemories of the nightmarish end to the Snow Ball came storming back to me. Running outside in the pouring rain, finding a lone Alexander, begging him to talk to me as he walked home to the Mansion.\u003c/p\u003e\n\u003cp\u003eHowever, when I opened Dullsville High\u0027s main door, it wasn\u0027t pouring rain--or raining at all--but was cool and quiet.\u003c/p\u003e\n\u003cp\u003e\"Alexander!\" I called.\u003c/p\u003e\n\u003cp\u003eThere, standing at the bottom of the stairs with his back toward me, was my vampire boyfriend.\u003c/p\u003e\n\u003cp\u003eI gathered the hem of my dress and hurried down the front steps. \"Alexander, please. I didn\u0027t want to dance with that jerk.\"\u003c/p\u003e\n\u003cp\u003eAlexander didn\u0027t reply.\u003c/p\u003e\n\u003cp\u003e\"Please, look at me,\" I said, my eyes welling with tears.\u003c/p\u003e\n\u003cp\u003eAlexander turned to me and stepped aside, revealing Henry, who was standing with him.\u003c/p\u003e\n\u003cp\u003eThe pit of my stomach turned. What was Henry doing at prom?\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Billy Boy?\" I asked, worried.\u003c/p\u003e\n\u003cp\u003e\"He just told me he was going to Valentine\u0027s house,\" Henry said.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s supposed to be grounded,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I thought you should know.\"\u003c/p\u003e\n\u003cp\u003eI gazed at Alexander, who seemed as surprised to find Henry here as I was.\u003c/p\u003e\n\u003cp\u003e\"Valentine said he\u0027d been staying with his aunt, Maria Maxwell,\" Billy\u0027s nerd-mate continued. \"Since Billy\u0027s been grounded, I had some free time, so I searched the town records for Valentine\u0027s aunt. I couldn\u0027t find her listed anywhere. There is not a trace of anyone here by that name. Then, tonight, Billy dropped off our Project Vampire for me to work on. I found this.\"\u003c/p\u003e\n\u003cp\u003eHenry handed Alexander an eight-by-ten weathered piece of parchment paper.\u003c/p\u003e\n\u003cp\u003eIt was a gravestone etching.\u003c/p\u003e\n\u003cp\u003eIn jagged letters were the words:\u003c/p\u003e\n\u003cp\u003eMaria Maxwell Beloved Aunt\u003c/p\u003e\n\u003cp\u003e1824-1922 \u003c/p\u003e","sourceLink":"https://allnovel.net/dance-with-a-vampire-vampire-kisses-4/page-15.html","bookId":2143,"creation":"Oct 5, 2019 6:18:14 PM","modification":"Oct 5, 2019 6:18:14 PM"}
