{"id":96004,"no":3,"title":"Page 3","content":"\u003cp\u003eAlexander and I set off to do something I never thought I\u0027d do: crash a Math Club party.\u003c/p\u003e\n\u003cp\u003eMy vampire boyfriend held my hand as we hurried through the strip mall parking lot, across a two-lane side street, and around a gas station. We were briskly walking past the small wooded area next to the library when we heard something off in the distance. It was the sound of a dog howling.\u003c/p\u003e\n\u003cp\u003eWe stopped in our tracks. Hair stood up on the back of my neck. The dog howled again.\u003c/p\u003e\n\u003cp\u003eDead Tree Forest, as I called it, was a two-acre undeveloped property with thick brush and foliage surrounding an inner layer of decay. The trees reached out for the sun and rain in vain; all that remained were wooden skeletons. Sometimes on the weekends I\u0027d get my research from the library and do my homework among the rotting oaks and maples. There were more dead trees than live ones, but the heavy brush made it difficult to see through to the streets once inside the woods.\u003c/p\u003e\n\u003cp\u003eIn the seventies it was rumored that the woods were a haven for drunken motorcycle gangs. Others claimed no one was ever heard of coming out of the woods at nighttime alive. Streetlights illuminated the darkened exterior, casting an eerie glow.\u003c/p\u003e\n\u003cp\u003e\"Maybe Valentine is in there,\" I wondered aloud. \"Can you see him?\"\u003c/p\u003e\n\u003cp\u003e\"I can see in the dark, but I don\u0027t have X-ray vision.\"\u003c/p\u003e\n\u003cp\u003e\"Valentine could be searching for more than a tree house-- perhaps a meal? What if he plans to pounce on my brother the moment he walks out of the library?\"\u003c/p\u003e\n\u003cp\u003eThe dog howled again.\u003c/p\u003e\n\u003cp\u003eAlexander looked at me as if he, too, was uncertain about what lay in the woods--or rather who.\u003c/p\u003e\n\u003cp\u003e\"All right,\" he said valiantly, and proceeded toward the trees.\u003c/p\u003e\n\u003cp\u003eNow I was concerned for us. I clutched my boyfriend\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" I warned. \"Who knows what he\u0027ll do. Maybe we should just head for the library.\"\u003c/p\u003e\n\u003cp\u003e\"You do realize he is eleven,\" Alexander said to me.\u003c/p\u003e\n\u003cp\u003e\"But the same blood that runs through his veins also runs through Jagger\u0027s and Luna\u0027s. He isn\u0027t like any other eleven-year-old. Plus, you know better than I do what he is capable of.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" he agreed, putting his hand firmly on my shoulder. \"That\u0027s why you are staying here. If I can talk to Valentine, we can put this whole thing to rest. I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eAlexander pulled back a branch and disappeared into the brush.\u003c/p\u003e\n\u003cp\u003eI waited for a moment, my heart pounding with anxiety. I couldn\u0027t see anything from my vantage point. I wouldn\u0027t be hurting anyone if I poked my head in to get a better view.\u003c/p\u003e\n\u003cp\u003eI pulled a branch back and crept inside the thick brush. The foliage blocked out much of the streetlight and I could barely see the skinny trees before me. I guided myself around them with an outstretched hand in the faint moonlight.\u003c/p\u003e\n\u003cp\u003eThe wind whistled through the barren trees. I passed a creepy white broken fence with only a few pickets left, leaning like aging tombstones. I managed to carefully step over a few stumps, downed branches, and fallen trees.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t see Alexander anywhere. I could hardly make out the woodpiles, rocks, and discarded mattresses that were before me. Just then I heard a branch snap.\u003c/p\u003e\n\u003cp\u003eI spun around.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t feel the familiar presence of my boyfriend. I turned back around and cautiously crept forward.\u003c/p\u003e\n\u003cp\u003eIt was impossible to tell where I was. I studied the ground to see if I\u0027d made tracks, but the hardened dirt and dead grass showed no signs of combat boots. I stepped once more, not knowing if I was going toward the street or farther into the woods.\u003c/p\u003e\n\u003cp\u003eThe dog howled another time. Its cries seemed stronger. Was it howling at Valentine--or my own true love?\u003c/p\u003e\n\u003cp\u003e\"Alexander--where are you?\"\u003c/p\u003e\n\u003cp\u003eI remembered my parents were waiting for us at the Cricket Club. Alexander and I were supposed to return before the meals reached the table. We would have been back before the fish and chips arrived if I hadn\u0027t diverted us into the woods.\u003c/p\u003e\n\u003cp\u003e\"Alexander!\" I called again.\u003c/p\u003e\n\u003cp\u003eThen I realized if Valentine was here, my continued shouting was calling attention to my location. I heard a fluttering in the trees above me. I could barely see what looked like two frightened squirrels racing up a branch, running away from a winged creature. It looked like a bird, but then the moonlight illuminated its small, mouselike face. This was no bird--it was a bat. It hovered in place intently, then headed straight for me.\u003c/p\u003e\n\u003cp\u003eI raised my arm to cover my face.\u003c/p\u003e\n\u003cp\u003e\"Alexander!\"\u003c/p\u003e\n\u003cp\u003eNothing happened.\u003c/p\u003e\n\u003cp\u003eI opened my eyes and saw the creature fly overhead, through a break in the trees, into the night sky. Then it disappeared.\u003c/p\u003e\n\u003cp\u003eA hand fell hard on my shoulder.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to speak, but no words came out. I turned around.\u003c/p\u003e\n\u003cp\u003e\"I told you to stay outside on the sidewalk,\" my boyfriend scolded.\u003c/p\u003e\n\u003cp\u003e\"Was that you?\"\u003c/p\u003e\n\u003cp\u003e\"Was what me?\"\u003c/p\u003e\n\u003cp\u003e\"That bat?\"\u003c/p\u003e\n\u003cp\u003e\"What bat?\" Alexander plucked a few twigs out of my hair and shirt, which I now knew he could easily see in the dark, and grabbed my hand. \"Let\u0027s get your brother,\" he instructed softly.\u003c/p\u003e\n\u003cp\u003eAs Alexander led me back through the woods, I glanced up at the moon, wondering what, or maybe who, I\u0027d just seen. \u003c/p\u003e","sourceLink":"https://allnovel.net/dance-with-a-vampire-vampire-kisses-4/page-3.html","bookId":2143,"creation":"Oct 5, 2019 6:18:14 PM","modification":"Oct 5, 2019 6:18:14 PM"}
