{"id":96738,"no":36,"title":"Page 36","content":"\u003cp\u003e36\u003c/p\u003e\n\u003cp\u003eMARIUS STOOD at the glass window looking out at the snow. Thorne sat by the dying fire, merely looking at Marius.\u003c/p\u003e\n\u003cp\u003e\"So you have woven for me a long, fine tale,\" said Thorne, \"and I have found myself marvelously caught up in it.\"\u003c/p\u003e\n\u003cp\u003e\"Have you?\" said Marius quietly. \"And perhaps I now find myself woven within my hatred of Santino.\"\u003c/p\u003e\n\u003cp\u003e\"But Pandora was with you,\" said Thorne. \"You were reunited with her again. Why is she not with you now? What\u0027s happened?\"\u003c/p\u003e\n\u003cp\u003e\"I was united with Pandora and Amadeo,\" said Marius. \"It all came about in those nights. And I have seen them often since. But I am an injured creature. And it was I who left their company. I could go now to Lestat, and those who are with him. But I don\u0027t.\u003c/p\u003e\n\u003cp\u003e\"My soul still aches over the losses I\u0027ve suffered. I don\u0027t know which causes me the greater pain\u0026amp;iexcl;\u0026amp;ordf;the loss of my goddess, or my hatred of Santino. She is gone beyond my reach forever. But Santino still lives.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you do away with him?\" asked Thorne. \"I\u0027ll help you find him.\"\u003c/p\u003e\n\u003cp\u003e\"I can find him,\" said Marius. \"But without her permission I can\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"Maharet?\" Thorne asked. \"But why?\"\u003c/p\u003e\n\u003cp\u003e\"Because she\u0027s the eldest of us now, she and her mute twin, and we must have a leader. Mekare cannot speak and might not have wits to speak even if she could. And so it\u0027s Maharet. And even if she refuses to allow or judge, I must put the question to her.\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" said Thorne. \"In my time, we gathered to settle such questions, and a man might seek payment from one who had injured him.\"\u003c/p\u003e\n\u003cp\u003eMarius nodded.\u003c/p\u003e\n\u003cp\u003e\"I think I must seek Santino\u0027s death,\" he whispered. \"I am at peace with all others, but to him I would do violence.\"\u003c/p\u003e\n\u003cp\u003e\"And very well you should,\" said Thorne, \"from all that you\u0027ve told me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve called to Maharet,\" said Marius. \"I\u0027ve let her know that you are here and that you\u0027re seeking her. I\u0027ve let her know that I must ask her about Santino. I\u0027m hungry for her wise words. Perhaps I want to see her weary mortal eyes gazing on me with compassion.\u003c/p\u003e\n\u003cp\u003e\"I remember her brilliant resistance of the Queen. I remember her strength and maybe now I need it. ... Perhaps by now she\u0027s found the eyes of a blood drinker for herself, and need not suffer anymore with the eyes of her human victims.\"\u003c/p\u003e\n\u003cp\u003eThorne sat thinking for a long moment. Then he rose from the couch. He drew close to the glass beside Marius.\u003c/p\u003e\n\u003cp\u003e\"Can you hear her answer to you?\" he asked. He couldn\u0027t disguise his emotion. \"I want to go to her. I must go to her.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t I taught you anything?\" Marius asked. He turned to Thorne. \"Haven\u0027t I taught you to remember these tender complex creatures with love? Perhaps not. I thought that was the lesson of my stories.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, you\u0027ve taught me this,\" said Thorne, \"and love her I do, in so far as she is tender and complex as you so delicately put it, but I\u0027m a warrior, you see, and I was never fit for eternity. And the hatred you harbor for Santino is the same as the passion I harbor for her. And passion can be for evil or good. I can\u0027t help myself.\"\u003c/p\u003e\n\u003cp\u003eMarius shook his head.\u003c/p\u003e\n\u003cp\u003e\"If she brings us to herself,\" he said, \"I will only lose you. As I\u0027ve told you before, you can\u0027t possibly harm her.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps, perhaps not,\" said Thorne. \"But whatever the truth, I must see her. And she knows why I\u0027ve come, and she will have her will in the matter.\"\u003c/p\u003e\n\u003cp\u003e\"Come now,\" Marius said, \"it\u0027s time for us to go to our rest. I hear strange voices in the morning air. And I feel the need of sleep desperately.\"\u003c/p\u003e\n\u003cp\u003eWHEN THORNE AWOKE he found himself in a smooth wooden coffin.\u003c/p\u003e\n\u003cp\u003eWithout fear, he easily lifted the lid, and then opened it to one side and sat up so that he might see the room around him.\u003c/p\u003e\n\u003cp\u003eIt was a cave of sorts, and beyond he heard the loud chorus of a tropical forest.\u003c/p\u003e\n\u003cp\u003eAll the fragrances of the green jungle assaulted his nostrils. He found it delicious and strange, and he knew it could only mean one thing: that Maharet had brought him to her hiding place.\u003c/p\u003e\n\u003cp\u003eHe climbed from the coffin as gracefully as he could and he stepped out into a huge room full of scattered stone benches. On the three sides the jungle grew thick and lively against a fine wire mesh and through the mesh above a thin rain came down refreshing him.\u003c/p\u003e\n\u003cp\u003eLooking to his right and left, he saw entrances to other such open places. And following the sounds and scents as any blood drinker could do, he moved to his right until he entered a great room where his Maker sat as he had seen her at the very beginning of his long life, in a graceful gown of purple wool, pulling the red hairs from her head and weaving them into thread with her distaff and her spindle.\u003c/p\u003e\n\u003cp\u003eFor many long moments he merely stared at her, as if he could not believe this vision.\u003c/p\u003e\n\u003cp\u003eAnd she in profile, surely knowing he was there, went on with her work, without speaking a word to him.\u003c/p\u003e\n\u003cp\u003eAcross the room, he saw Marius seated on a bench and then he realized that a regal and beautiful woman sat beside him. Surely it was Pandora. Indeed, he knew her by her brown hair. And there on the other side of Marius was the auburn-haired boy he had described: Amadeo.\u003c/p\u003e\n\u003cp\u003eBut there was also another creature in the room, and this without doubt was the black-haired Santino. He sat not far from Maharet, and when Thorne entered, he appeared to shrink away from Thorne, and then glancing at Marius to draw back again, and finally towards Maharet as if in desperation.\u003c/p\u003e\n\u003cp\u003eCoward, Thorne thought, but he said nothing.\u003c/p\u003e\n\u003cp\u003eSlowly Maharet turned her head until she could see Thorne, and so that he could see her eyes\u0026amp;iexcl;\u0026amp;ordf;human eyes\u0026amp;iexcl;\u0026amp;ordf;sad and full of blood, as always.\u003c/p\u003e\n\u003cp\u003e\"What can I give you, Thorne?\" she asked, \"to make your soul quiet again?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. He motioned for silence, not to compel her but merely to plead with her.\u003c/p\u003e\n\u003cp\u003eAnd in the interval Marius rose to his feet, and at once Pandora and Amadeo on either side of him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve thought long and hard on it,\" Marius said, his eyes on Santino.\u003c/p\u003e\n\u003cp\u003e\"And I can\u0027t destroy him if you forbid it. I won\u0027t break the peace with such an action. I believe too much that we must live by rules or we shall all perish.\"\u003c/p\u003e\n\u003cp\u003e\"Then it is finished,\" said Maharet, her familiar voice bringing the chills to Thorne, \"for I\u0027ll never grant you the right to destroy Santino.\u003c/p\u003e\n\u003cp\u003eYes, he injured you and it was a terrible thing, and I have heard you in the night describing your suffering to Thorne. I\u0027ve listened to your words in sorrow. But you can\u0027t destroy him now. I forbid it. And if you go against me, then there is no one who can restrain anyone.\"\u003c/p\u003e\n\u003cp\u003e\"That can\u0027t be,\" said Marius. His face was dark and miserable. He glared at Santino. \"There must be someone to restrain others. Yet I can\u0027t bear it that he lives after what he\u0027s done to me.\"\u003c/p\u003e\n\u003cp\u003eTo Thorne\u0027s amazement the youthful face of Amadeo appeared only puzzled.\u003c/p\u003e\n\u003cp\u003eAs for Pandora, she seemed sad and anxious, as though she feared that Marius wouldn\u0027t keep to his word.\u003c/p\u003e\n\u003cp\u003eBut Thorne knew otherwise.\u003c/p\u003e\n\u003cp\u003eAnd as he assessed this black-haired creature now, Santino rose from the bench and backed away from Thorne, pointing his finger at Thorne in terror. But it was not quick enough.\u003c/p\u003e\n\u003cp\u003eThorne sent all his strength at Santino and all Santino could do as he fell to his knees was cry out: \"Thorne,\" over and over again, his body exploding, the blood flowing from every orifice, the fire finally erupting from his chest and head as he twisted and collapsed on the stone floor, the flames at last consuming him.\u003c/p\u003e\n\u003cp\u003eMaharet had let out a terrible wail of sorrow, and into the large room her twin had come, her blue eyes searching for the source of pain in her sister.\u003c/p\u003e\n\u003cp\u003eMaharet rose to her feet. She looked down on the grease and ash that lay before her.\u003c/p\u003e\n\u003cp\u003eThorne looked at Marius. He saw a small bitter smile on Marius\u0027s lips, and then Marius looked to him and nodded.\u003c/p\u003e\n\u003cp\u003e\"I need no thanks from you,\" Thorne said.\u003c/p\u003e\n\u003cp\u003eThen he looked to Maharet who was weeping, her sister now holding tight to her arms, and pleading mutely with her to explain herself.\u003c/p\u003e\n\u003cp\u003e\" Wergeld, my Maker,\" said Thorne. \"As it was in my time, I exact the wergeld or payment for my own life, which you took when you made me a blood drinker. I take it through Santino\u0027s life, which I take beneath your roof.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and against my will,\" Maharet cried. \"You have done this terrible thing! And Marius, your own friend, has told you that I must rule here.\"\u003c/p\u003e\n\u003cp\u003e\"If you would rule here, do it on your own,\" said Thorne. \"Don\u0027t look to Marius to tell you how to do it. Ah, look at your precious distaff and spindle. How will you protect the Sacred Core if you have no strength to fight those who oppose you?\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t answer him, and he could see that Marius was angered, and that Mekare looked at him with menace.\u003c/p\u003e\n\u003cp\u003eHe came towards Maharet, staring intently at her, at her smooth face which now bore no trace whatever of human life, the florid human eyes seemingly set within a sculpture.\u003c/p\u003e\n\u003cp\u003e\"Would I had a knife,\" he said, \"would I had a sword, would I had any weapon I could use against you.\" And then he did the only thing which he could do. He took her by the throat with both his hands and tried to topple her.\u003c/p\u003e\n\u003cp\u003eIt was like holding fast to marble.\u003c/p\u003e\n\u003cp\u003eAt once there came a frantic cry from her. He couldn\u0027t understand the words, but when her sister drew him back gently he knew it had been a warning for his sake. He reached out still with both hands, struggling to be free, but it was useless.\u003c/p\u003e\n\u003cp\u003eThese two were unconquerable, either divided or together, it did not matter.\u003c/p\u003e\n\u003cp\u003e\"Put an end to this, Thorne,\" cried Marius. \"It\u0027s enough. She knows what\u0027s in your heart. You can\u0027t ask for more than this.\"\u003c/p\u003e\n\u003cp\u003eMaharet collapsed to her bench and there she sat crying, her sister at her side, Mekare\u0027s eyes fixed on Thorne warily.\u003c/p\u003e\n\u003cp\u003eThorne could see that all of them were afraid of Mekare, but he was not, and when he thought of Santino again, when he looked at the black stain on the stones, he felt a good deep pleasure.\u003c/p\u003e\n\u003cp\u003eThen moving swiftly, he accosted the mute twin and whispered something hurried in her ear, meant only for her, wondering if she would get the sense of it.\u003c/p\u003e\n\u003cp\u003eWithin a second he knew that she had. As Maharet watched in wonder, Mekare forced him down on his knees. She clasped his face and turned it up. And then he felt her fingers plunge into the sockets of his eyes as she removed them.\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, this blessed darkness,\" he said, \"and then the chains, I beg you, the chains. Otherwise do away with me.\"\u003c/p\u003e\n\u003cp\u003eThrough Marius\u0027s mind, he could see the image of himself groping in blindness. He could see the blood flowing down his face. He could see Maharet as Mekare put the eyes into her head. He could see those two tall delicate women with their arms entangled, the one struggling but not enough and the other pressing for the deed to be accomplished.\u003c/p\u003e\n\u003cp\u003eThen he felt others gathered around him. He felt the fabric of their garments, he felt their smooth hands.\u003c/p\u003e\n\u003cp\u003eAnd only in the distance could he hear Maharet weeping.\u003c/p\u003e\n\u003cp\u003eThe chains were being put around him. He felt their thick links and knew he could not break loose from them. And being dragged further away, he said nothing.\u003c/p\u003e\n\u003cp\u003eThe blood flowed from his eye sockets. He knew it. And in some quiet empty place he was now bound exactly as he had dreamt of it. Only she wasn\u0027t close. She wasn\u0027t close at all. He heard the jungle sounds. And he longed for the winter cold, and this place was too warm and too full of the perfume of flowers.\u003c/p\u003e\n\u003cp\u003eBut he would get used to the heat. He would get used to the rich fragrances.\u003c/p\u003e\n\u003cp\u003e\"Maharet,\" he whispered.\u003c/p\u003e\n\u003cp\u003eHe saw what they saw again, in another room, as they looked at each other, all of them talking in hushed voices of his fate and none fully understanding it. He knew that Marius was pleading for him, and he knew that Maharet whom he saw so vividly through their eyes was as beautiful now as she had been when she made him.\u003c/p\u003e\n\u003cp\u003eSuddenly she was gone from the group. And they talked in shadows without her.\u003c/p\u003e\n\u003cp\u003eThen he felt her hand on his cheek. He knew it. He knew the soft wool of her gown. He knew her lips when she kissed him.\u003c/p\u003e\n\u003cp\u003e\"You do have my eyes,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" she said. \"I see wondrously through them.\"\u003c/p\u003e\n\u003cp\u003e\"And these chains, are they made of your hair?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she answered. \"From hair to thread, from thread to rope, from rope to links, I have woven them.\"\u003c/p\u003e\n\u003cp\u003e\"My weaving one,\" he said, smiling. \"And when you weave them now,\" he asked, \"will you keep me close to you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said. \"Always.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-and-gold-the-vampire-chronicles-8/page-36.html","bookId":2594,"creation":"Oct 5, 2019 6:22:49 PM","modification":"Oct 5, 2019 6:22:49 PM"}
