{"id":108937,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Ali,” called a voice I knew I should recognize. Male. Raspy with concern.\u003c/p\u003e\n\u003cp\u003eCole, maybe. I inhaled deeply, and oh, he smelled so good. Pure and crisp and crackling with energy. The hunger overwhelmed me all over again. My mouth watered. “Feed me,” I croaked.\u003c/p\u003e\n\u003cp\u003eGentle hands smoothed over my cheeks, offering a comforting stroke.\u003c/p\u003e\n\u003cp\u003eMy nerve endings went haywire, agonizing me further. I jerked away. “No. Don’t.”\u003c/p\u003e\n\u003cp\u003e“Ali.”\u003c/p\u003e\n\u003cp\u003eGrab him. Devour him. You’ll feel so much better.\u003c/p\u003e\n\u003cp\u003e“I administered a double dose of the antidote hours ago. Why isn’t she better?”\u003c/p\u003e\n\u003cp\u003eDefinitely Cole. He was here. He was with me.\u003c/p\u003e\n\u003cp\u003e“Give her another.”\u003c/p\u003e\n\u003cp\u003e“Can she take it?”\u003c/p\u003e\n\u003cp\u003e“Do we have a choice?”\u003c/p\u003e\n\u003cp\u003eA sharp sting in my neck, a cool rush through my veins, and the pain and hunger at last died. The second heartbeat slowed, softened, but didn’t disappear completely. Still, it was enough. I sagged into a boneless heap.\u003c/p\u003e\n\u003cp\u003e“Ali, I need you to wake up, okay?”\u003c/p\u003e\n\u003cp\u003eAnything for Cole. I ripped my way through the veil of darkness shrouding my conscious and pried open my eyelids. At first, I saw only a haze of white clouds.\u003c/p\u003e\n\u003cp\u003eClouds.\u003c/p\u003e\n\u003cp\u003eEmma.\u003c/p\u003e\n\u003cp\u003eBut...she wasn’t here. Where was here? I frowned.\u003c/p\u003e\n\u003cp\u003e“Good girl, that’s the way,” Cole said. “Come back to me, sweetheart.”\u003c/p\u003e\n\u003cp\u003eSweetheart. An endearment.\u003c/p\u003e\n\u003cp\u003eHe wasn’t upset with me anymore.\u003c/p\u003e\n\u003cp\u003eBlinking rapidly shooed away the haze. Cole leaned over the side of the bed, peering down at me. Black hair shagged over a forehead furrowed with a mix of worry and relief. His eyes were glassy and bloodshot, making me think he’d been denied sleep. The shadow-beard he always sported was now thicker.\u003c/p\u003e\n\u003cp\u003e“Hey there,” he said softly.\u003c/p\u003e\n\u003cp\u003e“Hey.” My voice was damaged, as if my vocal cords had been cut and only recently sewn back together. “I’m glad you’re speaking to me again.”\u003c/p\u003e\n\u003cp\u003eHe frowned, and suddenly I could see the storm brewing beneath his exhaustion. “I wasn’t ever not speaking to you.”\u003c/p\u003e\n\u003cp\u003e“You were avoiding me, then.”\u003c/p\u003e\n\u003cp\u003eA stilted pause before he admitted, “Yes.”\u003c/p\u003e\n\u003cp\u003eA second later, the world around me tunneled so that only Cole existed. Elation speared me—finally we were having a vision—\u003c/p\u003e\n\u003cp\u003e—in the Ankhs’ game room, Cole stood across from me. He was smiling at something Veronica was saying. I stood in front of Gavin, my hands cupping his cheeks.\u003c/p\u003e\n\u003cp\u003e“You are a better man than I ever gave you credit for,” I told him.\u003c/p\u003e\n\u003cp\u003e“I know,” Gavin replied.\u003c/p\u003e\n\u003cp\u003e“And you’re so modest.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Are you happy with the way things turned out?”\u003c/p\u003e\n\u003cp\u003eMy gaze strayed to Cole. The tension he’d worn like a second skin all these weeks had utterly vanished. “Yeah. Yeah, I am—”\u003c/p\u003e\n\u003cp\u003e—the vision vanished in a blink, right along with my elation, and Cole let his head drop into his upraised hands. He scrubbed his fingers through his already disheveled hair.\u003c/p\u003e\n\u003cp\u003e“Gavin’s a man-whore, you know. Never been with the same girl twice. And he’s never liked blondes. He won’t stay with you for long.”\u003c/p\u003e\n\u003cp\u003eThere was ice in his tone, and it scared me. “I’m not interested in Gavin.” I struggled to sit up. “Cole, you have to—”\u003c/p\u003e\n\u003cp\u003e“Don’t say anything. Just...don’t.” Motions jerky, he shoved two pillows behind my back and reached over to lift a glass of water from the nightstand.\u003c/p\u003e\n\u003cp\u003eI was in my bedroom, I realized. Determined sunlight shoved its way through the curtains. The iPod Cole had given me was stationed in its dock on the desk and turned on. Soft music filled the room.\u003c/p\u003e\n\u003cp\u003eHe placed the straw at my lips. “Drink.”\u003c/p\u003e\n\u003cp\u003eI obeyed, the cool liquid sliding down my throat, soothing for a moment only to churn in my belly, frothing up acid. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe nodded stiffly and set the cup aside. “Let’s talk about what happened with Justin.”\u003c/p\u003e\n\u003cp\u003eYes. Okay. A safe topic. “Has he recovered?”\u003c/p\u003e\n\u003cp\u003e“Yeah, and a lot quicker than you.”\u003c/p\u003e\n\u003cp\u003eThe accusation in his voice threw me, and I glowered at him. “Hey, don’t blame me. I’m the victim here.”\u003c/p\u003e\n\u003cp\u003eHe massaged the back of his neck, somewhat contrite. “Yeah. I know. Sorry. It’s been stressful, watching you suffer and not being able to help.”\u003c/p\u003e\n\u003cp\u003eSlowly I relaxed. “Has a slayer ever bitten another slayer like that?”\u003c/p\u003e\n\u003cp\u003e“Not to my knowledge. Not while both are still human.”\u003c/p\u003e\n\u003cp\u003eWhy Justin? Why me? What had been different? “Did I try to bite anyone while I was...out of it?” The moment I asked, memories came flooding back to me. Cole. I’d tried to bite Cole.\u003c/p\u003e\n\u003cp\u003e“Just me,” he said without any hint of emotion.\u003c/p\u003e\n\u003cp\u003eI soaked in horror like a sponge. “I’m sorry,” I rushed out. “I know I failed. Wait. I failed, right?”\u003c/p\u003e\n\u003cp\u003eHe gave one, sharp nod. “You did.”\u003c/p\u003e\n\u003cp\u003eI relaxed again, but only slightly. “I’m so sorry, Cole. I don’t know what came over me, but I do know I’m not going to do it again. I promise you.”\u003c/p\u003e\n\u003cp\u003eHe shrugged—and I wasn’t sure whether he was trying to tell me he believed me...or that he didn’t.\u003c/p\u003e\n\u003cp\u003e“I mean it,” I insisted.\u003c/p\u003e\n\u003cp\u003e“You tried to bite me more than once,” he said flatly.\u003c/p\u003e\n\u003cp\u003eOh. I didn’t remember the other times. “I’m so sorry,” I repeated. “I didn’t realize...”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eI gulped. Was he disgusted with me now? “Do you think Anima put Justin up to hurting me? Causing this kind of reaction, thinking we’d destroy each other?”\u003c/p\u003e\n\u003cp\u003e“Maybe, but like you, I don’t think Justin knew what he was doing.”\u003c/p\u003e\n\u003cp\u003eAgreed. The red I’d seen in his eyes... “Where is he now?”\u003c/p\u003e\n\u003cp\u003e“Ankh kept him below, in the dungeon, as you like to call it, for a few days to make sure the antidote was working and he wouldn’t try to attack anyone else. Tests were run, and a strange toxin was found in his blood. Not zombie, but actually antizombie. Different than what’s in the antidote. We think it’s what made him vomit.”\u003c/p\u003e\n\u003cp\u003eWait. Hold everything. “A few days? How long have I been out? Did you check my blood, too?”\u003c/p\u003e\n\u003cp\u003eUsed to my rapid-fire questions, he easily followed. “About a week. And yes. You had—have—the same antizombie toxin, only you have a lot more of it, which makes us think you shared it with him when he bit you.”\u003c/p\u003e\n\u003cp\u003eCrap. I’d lost another week of my life. My poor Nana. Ugh, my poor grades. “How and where would I have gotten an antizombie toxin? And why is it in my blood, rather than my spirit?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Could be an ability, like the visions. And if it’s in your spirit, it’s in your blood. We have to test what we can.”\u003c/p\u003e\n\u003cp\u003eYes. Okay. All of that made sense.\u003c/p\u003e\n\u003cp\u003eWhen I’d first moved in with Nana, I’d found a journal written in a strange numbered code that always seemed to unravel by itself. Through it, I’d learned some slayers were born with strange abilities no one could explain. A poisonous spirit, and thereby blood, had been on the list—which was actually a good thing. Like Justin, the zombies sickened soon after biting me.\u003c/p\u003e\n\u003cp\u003e“Just so you know, we told everyone you’d overdone it and reopened your wound,” Cole said. “Both of which are true.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eHe nodded, moved to the door.\u003c/p\u003e\n\u003cp\u003eHe was...leaving me? Just like that?\u003c/p\u003e\n\u003cp\u003e“Cole,” I called. “We need to talk.”\u003c/p\u003e\n\u003cp\u003e“You need to rest.”\u003c/p\u003e\n\u003cp\u003e“Cole.” My voice lashed like a whip. I wasn’t letting him get away. Not this time.\u003c/p\u003e\n\u003cp\u003eHe paused, faced me. His features were blank.\u003c/p\u003e\n\u003cp\u003e“This has to stop.”\u003c/p\u003e\n\u003cp\u003eHe gave a single nod, and the formality of the action worried me.\u003c/p\u003e\n\u003cp\u003e“I tried not to push you, but you have to give me something. Your silence is driving me crazy.”\u003c/p\u003e\n\u003cp\u003eHe crossed his arms as if preparing for battle. “Some things aren’t meant to be discussed, Ali.”\u003c/p\u003e\n\u003cp\u003eToday, I just couldn’t accept that. I’d come this far... “At Hearts, you couldn’t spend time with me. Why?”\u003c/p\u003e\n\u003cp\u003eHe ran his tongue over his teeth. “I’ve already told you all I’m willing to say on that subject.”\u003c/p\u003e\n\u003cp\u003e“You asked me to trust you, and now I’m asking you to trust me with the truth. Why?”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eArgh! I tried a different approach, saying, “You told me you wanted me to stay away from Gavin, and yet you have been the one to stay away from me. Why?”\u003c/p\u003e\n\u003cp\u003eAgain silence.\u003c/p\u003e\n\u003cp\u003eDang him! I was giving, but he wasn’t giving anything back. “What we just saw in the vision—”\u003c/p\u003e\n\u003cp\u003e“Will happen.” Fury blazed in his eyes, making me miss the expressionless mask. “You know it will. It always does.”\u003c/p\u003e\n\u003cp\u003eI’d denied it to myself, but I couldn’t deny it to him. He’d call my bluff. “Maybe it doesn’t mean what we think it means.”\u003c/p\u003e\n\u003cp\u003eHis head tilted to the side, and he studied me intently. Hopefully? “What do you think it means?”\u003c/p\u003e\n\u003cp\u003e“I...don’t know.” I wasn’t at my best just then. But I knew that just because I’d stood with Gavin, and Cole had stood with Veronica, and just because I’d had my hands on Gavin and Cole had been smiling so peacefully at Veronica, didn’t mean we belonged with Gavin and Veronica. “What do you think it means?”\u003c/p\u003e\n\u003cp\u003ePlease tell me what I want to hear.\u003c/p\u003e\n\u003cp\u003eHe would. He had to. Not many people were as layered as Cole. A hard outer shell covered razor blades, and razor blades covered steel. But for those willing to dig—and endure the injuries and bleeding—a soft, gooey center could be found. I’d dug. I’d found it. He wouldn’t let me go, wouldn’t turn to Veronica.\u003c/p\u003e\n\u003cp\u003e“I think it means...we’re over,” he said, and closed his eyes.\u003c/p\u003e\n\u003cp\u003eHe would. He really would.\u003c/p\u003e\n\u003cp\u003eHe might as well have slapped me. “No,” I said, shaking my head. “No.” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-11.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
