{"id":108953,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI still wasn’t sure what his motives were, but at the moment I had nowhere else to turn. “Possibly.”\u003c/p\u003e\n\u003cp\u003e“Possibly?”\u003c/p\u003e\n\u003cp\u003eI sat down. “That’s all I’m willing to say.” For now.\u003c/p\u003e\n\u003cp\u003eHe sat down beside me. “Okay, but I can’t help you if I don’t know what you’re dealing with.”\u003c/p\u003e\n\u003cp\u003e“Will you actually help me, though?”\u003c/p\u003e\n\u003cp\u003eHis shoulders wilted, and he said, “I guess I deserved that.”\u003c/p\u003e\n\u003cp\u003eYeah, but I didn’t have to be so crabby about it, did I? “Do you know someone by the name of Dr. Bendari?”\u003c/p\u003e\n\u003cp\u003e“No. Why?”\u003c/p\u003e\n\u003cp\u003eCrap. So...maybe Dr. Bendari wasn’t with Anima, after all. Maybe Justin was lying. Or maybe Justin just hadn’t met him. “Forget it.”\u003c/p\u003e\n\u003cp\u003e“Ali. Please. Talk to me.”\u003c/p\u003e\n\u003cp\u003eHow many times was I going to hear those words?\u003c/p\u003e\n\u003cp\u003eThe bell rang, saving me from having to reply. “Later,” I said. Maybe.\u003c/p\u003e\n\u003cp\u003eLunchtime arrived. I’d successfully managed to avoid Justin after first and second period. Trina and Mackenzie, too. But not Cole.\u003c/p\u003e\n\u003cp\u003eHe cornered me in the girls’ bathroom.\u003c/p\u003e\n\u003cp\u003eI was washing my hands as he stepped inside. A classmate of mine was in the process of closing a stall door when she spied him and squealed.\u003c/p\u003e\n\u003cp\u003e“Out,” he said, and she took off, leaving me alone with him.\u003c/p\u003e\n\u003cp\u003eMy heart thundered as I dried my hands with a paper towel. “If you plan to yell at me for hurting your girlfriend, let me save you the trouble. My anger got the best of me, but it’s not going to happen again.”\u003c/p\u003e\n\u003cp\u003e“She’s not my girlfriend.”\u003c/p\u003e\n\u003cp\u003e“It’s okay if she is. You don’t have to try and spare my feelings. I’ve moved on.”\u003c/p\u003e\n\u003cp\u003eHe did not appear grateful.\u003c/p\u003e\n\u003cp\u003eI tried to bypass him, deciding to talk to him about Trina and Mackenzie’s allegations later, in a place without mirrors. He stepped into my path. “Stay,” he said.\u003c/p\u003e\n\u003cp\u003e“Orders?” I glared up at him. “You know I’m not afraid to punch you, right?”\u003c/p\u003e\n\u003cp\u003e“Do what you want to me. I’m not leaving until you’ve listened to me.”\u003c/p\u003e\n\u003cp\u003eSometimes I really hated my curious nature. “What?”\u003c/p\u003e\n\u003cp\u003eWhen I backed off, he leaned against the sink, raked his gaze over me and frowned. “You’re wearing a different shirt.”\u003c/p\u003e\n\u003cp\u003e“Yes,” was all I said, struggling with the sudden need to cover my chest.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eStruggling—and failing. I covered my chest with my hands. “Is that why you’re here? Because my reasons don’t concern you.”\u003c/p\u003e\n\u003cp\u003eHis frown deepened. He shook his head, as if to get back on track. “I’m worried about you and want to discuss it like rational people.”\u003c/p\u003e\n\u003cp\u003e“I don’t have anything to say to you.”\u003c/p\u003e\n\u003cp\u003e“Why? You said we could try and be friends.”\u003c/p\u003e\n\u003cp\u003eLesson learned: it was better to think before I spoke. “Fine. Discuss away.”\u003c/p\u003e\n\u003cp\u003eHe muttered something under his breath before saying to me, “Ankh told me you’ve been eating bagels at his house.”\u003c/p\u003e\n\u003cp\u003eWait. “This isn’t about what happened on patrol? Or Veronica?”\u003c/p\u003e\n\u003cp\u003e“The bagels,” he insisted.\u003c/p\u003e\n\u003cp\u003eWhat was with the freaking bagels? “Yes. I have been eating bagels. Last I heard, that wasn’t a crime.”\u003c/p\u003e\n\u003cp\u003e“It is when it’s all you’re eating.”\u003c/p\u003e\n\u003cp\u003eI anchored my hands on my hips. “Why do you even care about this?”\u003c/p\u003e\n\u003cp\u003eHe ignored the question, saying, “You didn’t bring your lunch and you weren’t planning on getting anything in the cafeteria today, were you? I know, because you didn’t get anything last week, either. You’re going to starve.”\u003c/p\u003e\n\u003cp\u003eHe made it sound worse than it was. “I’m saving to buy Nana a house of her own.”\u003c/p\u003e\n\u003cp\u003e“Then bring food from Ankh’s. He has more than enough.”\u003c/p\u003e\n\u003cp\u003e“I’m living in his home free of charge. I’m not going to be any more of a burden and take more from him.”\u003c/p\u003e\n\u003cp\u003e“You’re not a burden.”\u003c/p\u003e\n\u003cp\u003e“So you say.”\u003c/p\u003e\n\u003cp\u003e“Ali.”\u003c/p\u003e\n\u003cp\u003e“No,” I said.\u003c/p\u003e\n\u003cp\u003e“Take from me, then.” He withdrew a brown leather wallet with a chain at the end. “Please.”\u003c/p\u003e\n\u003cp\u003eI violently shook my head. What the heck was happening here? “I don’t want your money.”\u003c/p\u003e\n\u003cp\u003e“Ali,” he repeated, his tone ragged. “Friends share.”\u003c/p\u003e\n\u003cp\u003e“We’re not that close anymore.”\u003c/p\u003e\n\u003cp\u003eHe flinched. “You have to eat.”\u003c/p\u003e\n\u003cp\u003e“I will. I promise.”\u003c/p\u003e\n\u003cp\u003e“More than bagels,” he insisted.\u003c/p\u003e\n\u003cp\u003eI nodded, anything to move this conversation along. After school, I’d walk to the convenience store close to the Ankhs’ and buy bread and deli meat.\u003c/p\u003e\n\u003cp\u003e“Not just later, but now, at lunch,” he said, as if he’d heard my thoughts. “Please.”\u003c/p\u003e\n\u003cp\u003ePlease.\u003c/p\u003e\n\u003cp\u003eHis concern was doing something to me, weaving one of his spells around me, making me forget the world around me, the problems, taking me deeper and deeper into an obsession that had only gotten me hurt. I wanted out. I needed out.\u003c/p\u003e\n\u003cp\u003e“It’s better that we broke up, you know.” I said the words for my own benefit. “Our connection was so fast, we never took the time to get to know each other. Not really. And how would we ever have known if we truly cared about each other or if the visions had simply convinced us that we did?”\u003c/p\u003e\n\u003cp\u003eHe smacked a hand against the mirror and leaned toward me. Glaring, he snapped, “I knew how I felt.”\u003c/p\u003e\n\u003cp\u003ePast tense. Why did that hurt? “I know how you felt, too. Not strongly enough to fight for me.”\u003c/p\u003e\n\u003cp\u003eA muscle ticked below his eye as he straightened, backed me into the black-and-gold-tiled wall. The warmth of his breath fanned over my face, as sure and sweet as a caress. His gaze took in every detail of my expression, lingering on my lips. Lips suddenly aching for the kisses he’d denied me during my recovery.\u003c/p\u003e\n\u003cp\u003e“We both know why I walked away,” he said. “We both know what’s going to happen.”\u003c/p\u003e\n\u003cp\u003e“Yes, so what the heck do you think you’re doing, closing in on me like this?” Good. I’d shaken off the melancholy and welcomed a bit of mettle.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he snarled, and I was suddenly face-to-face with Cole the Yorkie. “I never know anymore.”\u003c/p\u003e\n\u003cp\u003eFor my own good, I forced myself to say, “That’s your problem, not mine.” Then I angled around him and walked away.\u003c/p\u003e\n\u003cp\u003eThis time, he let me go.\u003c/p\u003e\n\u003cp\u003eI was getting good at not looking back.\u003c/p\u003e\n\u003cp\u003eIn the cafeteria, I spent three precious dollars on a mediocre hamburger. Cole was at the table by the time I eased beside Kat and Reeve, and he watched me eat half...and try to save the other half for later.\u003c/p\u003e\n\u003cp\u003eScowling, he planted himself at my side, scooting Kat out of the way, then unwrapped the burger and put it back in my hand. I suspected he would try to force-feed me if I resisted, so I ate the rest. My stomach nearly wept with gratitude.\u003c/p\u003e\n\u003cp\u003eHe pushed a Gatorade in my direction. His? Half the contents were already gone. I’d forgotten to buy a drink, I realized, and gratefully swallowed one mouthful, then another.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I said, trying not to care that he cared.\u003c/p\u003e\n\u003cp\u003e“That’s what friends are for, right? Even if they’re not close.” He put his mouth where mine had been and drained the rest.\u003c/p\u003e\n\u003cp\u003eAfter school, Kat and I piled into Reeve’s car. The three of us had one class together, and Mr. Toms, the teacher, had allowed us to group up for a special humanitarian project. For it, we drove to Party Palace and bought a handful of Get Well Soon balloons.\u003c/p\u003e\n\u003cp\u003e“On a totally unrelated subject,” Kat said, “do you guys want to go threezies on a gift for Aubrey Wilson’s baby shower? And by threezies I mean your dad will pay the bulk of it, Reeve. We want to get her something totes amazeballs.”\u003c/p\u003e\n\u003cp\u003e“She mentioned needing a crib,” I said. Poor girl. She had just started showing, and her boyfriend had dumped her.\u003c/p\u003e\n\u003cp\u003eReeve nodded. “Count me in.”\u003c/p\u003e\n\u003cp\u003eAs we meandered along back roads, searching for the next object we needed to complete Kat’s “most brilliant idea ever,” I checked the clouds. The sun glared at me, making my eyes water, but I still caught sight of a rabbit and moaned. No, please no. Not tonight. I wasn’t ready to face the zombies—and my reaction to them—again.\u003c/p\u003e\n\u003cp\u003eTonight I was supposed to stay at Cole’s gym and guard the bodies the slayers left behind. But. Yeah, there was always a but with me, wasn’t there? I’d be called out just as soon as the zombies were found—and they would most certainly be found.\u003c/p\u003e\n\u003cp\u003eWould I hear the voices again? Should I just call in sick?\u003c/p\u003e\n\u003cp\u003e“I’m sure we’re going to get a terrible grade for this,” Reeve said with a groan.\u003c/p\u003e\n\u003cp\u003e“If anything, we’ll receive a certificate for awesomeness,” Kat replied.\u003c/p\u003e\n\u003cp\u003eMy phone beeped. I checked the screen and stiffened.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Kat asked.\u003c/p\u003e\n\u003cp\u003e“Cole wants to meet with me,” I said without any inflection of emotion.\u003c/p\u003e\n\u003cp\u003eInside, I churned.\u003c/p\u003e\n\u003cp\u003eI read the text again. My house. Five. Be there.\u003c/p\u003e\n\u003cp\u003eDang it. I’d planned to have dinner with Nana before heading over.\u003c/p\u003e\n\u003cp\u003e“When? Where?” Reeve asked, and I gave her the details.\u003c/p\u003e\n\u003cp\u003e“Are you going to go?” Kat wondered.\u003c/p\u003e\n\u003cp\u003eHands shaking, I texted Nana. Can we reschedule? I’m so sorry, but something’s come up w/Cole.\u003c/p\u003e\n\u003cp\u003eI waited, but a response from her didn’t come.\u003c/p\u003e\n\u003cp\u003eTo Cole, I texted Why?\u003c/p\u003e\n\u003cp\u003eCole (I’d deleted the part about McHottie): Do I really need a reason?\u003c/p\u003e\n\u003cp\u003eMe: 2 talk? Yes. We’ve said all we need 2 say.\u003c/p\u003e\n\u003cp\u003eOkay, so that wasn’t exactly true. I still had to drum up the courage to mention his odd behavior, as promised.\u003c/p\u003e\n\u003cp\u003eCole: Who runs this show? Just be there.\u003c/p\u003e\n\u003cp\u003eMe: Fine.\u003c/p\u003e\n\u003cp\u003eCole: Your enthusiasm is humbling.\u003c/p\u003e\n\u003cp\u003eMe: Go screw yourself.\u003c/p\u003e\n\u003cp\u003eCole: I have. I prefer 2 have a partner.\u003c/p\u003e\n\u003cp\u003eI think I gasped.\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m going to go,” I said. I wasn’t going to call in sick. I had responsibilities. I’d keep them. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-27.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
