{"id":108954,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Hold everything.” Kat bounced up and down in her seat and clapped. “I think I see one.”\u003c/p\u003e\n\u003cp\u003e“Where?” Reeve demanded.\u003c/p\u003e\n\u003cp\u003eKat pointed. “Pull over.”\u003c/p\u003e\n\u003cp\u003eGroaning, Reeve slowed the car, eased to the side of the road and parked. I freed one of the balloons and exited. The girls joined me, and together we approached the centerpiece of our project—a dead raccoon, its arms and legs stiff and pointing in the air.\u003c/p\u003e\n\u003cp\u003e“Gloves,” Kat said, holding out her hand.\u003c/p\u003e\n\u003cp\u003eReeve dangled a pair just beyond her reach. “These are cashmere, you know.”\u003c/p\u003e\n\u003cp\u003e“I’m sure the raccoon will be thrilled,” she replied drily. “Even though I told you to buy latex.”\u003c/p\u003e\n\u003cp\u003e“I thought you’d appreciate something softer.” Sighing, Reeve relinquished the gloves, and Kat tugged them on. “I bought hand sanitizer instead.”\u003c/p\u003e\n\u003cp\u003e“Balloon,” she said next.\u003c/p\u003e\n\u003cp\u003eI handed it over.\u003c/p\u003e\n\u003cp\u003eThen Kat crouched over the poor dead animal and tied the ribbon to one of its wrists. There was no wind, so the Get Well Soon balloon stayed perfectly straight, flying proudly over the motionless animal.\u003c/p\u003e\n\u003cp\u003e“Your family will thank me for this one day,” she said with a nod.\u003c/p\u003e\n\u003cp\u003e“As if we’re really doing any good,” Reeve said.\u003c/p\u003e\n\u003cp\u003e“Hello, we so are. People need to be more aware of the creatures crossing the road, thank you, and this is our way of helping. It’s humorous—”\u003c/p\u003e\n\u003cp\u003e“And gross,” Reeve interjected. “And cruel.”\u003c/p\u003e\n\u003cp\u003e“And they’ll remember,” Kat finished.\u003c/p\u003e\n\u003cp\u003eWe each snapped a few pictures with our phones, cleaned our hands, got back in the car and hunted the next Get Well Soon victim. I mean, recipient.\u003c/p\u003e\n\u003cp\u003eI couldn’t help comparing myself to the animals. A car crash. A part of me dying.\u003c/p\u003e\n\u003cp\u003eI prayed I had a better end but had a feeling I was going to have to adjust my to-do list yet again.\u003c/p\u003e\n\u003cp\u003eChapter 12\u003c/p\u003e\n\u003cp\u003eDeadly Eyes Betray You\u003c/p\u003e\n\u003cp\u003eWe dropped Kat off at the school parking lot, where her car waited, and drove home. Another note had been stuck to the bottom of the staircase railing. Sighing, I sailed into Mr. Ankh’s office—only to find him in a heated discussion with Mr. Holland.\u003c/p\u003e\n\u003cp\u003eInteresting.\u003c/p\u003e\n\u003cp\u003eThe moment the men spotted me, they zipped their lips. Mr. Holland had been leaning over the desk, putting himself nose to nose with Mr. Ankh. Now he eased back into his seat, and the two acted as friendly as ever.\u003c/p\u003e\n\u003cp\u003eEven more interesting.\u003c/p\u003e\n\u003cp\u003eI couldn’t help thinking Mr. Holland was a portrait of Cole in twenty years. Both guys had dark hair and strong, chiseled features. Only difference was, Cole’s eyes were that amazing violet and Mr. Holland’s were an electric-blue.\u003c/p\u003e\n\u003cp\u003e“Miss Bell,” Mr. Ankh acknowledged.\u003c/p\u003e\n\u003cp\u003eDid he ever go to work? I settled in the only available chair.\u003c/p\u003e\n\u003cp\u003e“Good. You’re here.” Mr. Holland massaged the back of his neck. “The three of us are due to have a discussion.”\u003c/p\u003e\n\u003cp\u003e“Your newest blood work came in,” Mr. Ankh said, “and the results have me confused.”\u003c/p\u003e\n\u003cp\u003eI shifted uncomfortably.\u003c/p\u003e\n\u003cp\u003e“The toxin you and Justin shared, the one that is harmful to the zombies,” he continued. “It disappeared in Justin, but it’s now stronger in you. Also, your iron is lower than before, and your white blood cell count is higher.”\u003c/p\u003e\n\u003cp\u003eI wasn’t sure whether to laugh or cry. My human side was fighting, but my zombie side wasn’t backing down. “What about the zombie toxin that is harmful to humans? Did I have any traces of that?”\u003c/p\u003e\n\u003cp\u003eHe frowned. “No.”\u003c/p\u003e\n\u003cp\u003e“Why would you ask that?” Mr. Holland said.\u003c/p\u003e\n\u003cp\u003eI wanted to tell him, I really did. But he’d killed his own wife when she’d turned zombie. No telling what he’d do to me, his son’s unstable ex.\u003c/p\u003e\n\u003cp\u003eIf these men left me alive, Mr. Ankh would for sure toss me out. Where I went, Nana went. I would not allow her to be homeless.\u003c/p\u003e\n\u003cp\u003eThen, of course, Mr. Holland would tell the others. How would Cole look at me then? He wouldn’t worry about feeding me anymore, I knew that much.\u003c/p\u003e\n\u003cp\u003e“Curiosity,” I hedged. In a way, it was the truth.\u003c/p\u003e\n\u003cp\u003eMr. Holland sighed and twisted his chair to face mine. “Well, I’m curious about something, too. I know you and my son broke up. What I don’t know is why. He won’t talk to me.”\u003c/p\u003e\n\u003cp\u003eInstant downer. “And I won’t, either,” I said hollowly.\u003c/p\u003e\n\u003cp\u003eHe began massaging the back of his neck again, a gesture of irritation or distress he and Cole shared. “He’s been sneaking out, talking to people he shouldn’t, making bad decisions, and I’m worried about him. Something’s going on with him, but I don’t know how to help.”\u003c/p\u003e\n\u003cp\u003e“Who’s he talking to?” I asked.\u003c/p\u003e\n\u003cp\u003eSilent, he ran his tongue over his teeth.\u003c/p\u003e\n\u003cp\u003eHe wasn’t going to share the information. Got it.\u003c/p\u003e\n\u003cp\u003e“Will you check on him?” Mr. Holland asked.\u003c/p\u003e\n\u003cp\u003e“Trina and Mackenzie noticed his odd behavior, too, and asked the same thing. I agreed to talk to him,” I said. “I’m meeting him at five.”\u003c/p\u003e\n\u003cp\u003eMr. Holland pushed out a relieved breath. “Thank you.”\u003c/p\u003e\n\u003cp\u003eI nodded, saying, “By the way, I saw a rabbit cloud today.”\u003c/p\u003e\n\u003cp\u003eThe two men shared an uneasy look.\u003c/p\u003e\n\u003cp\u003eI could guess what they were thinking. The zombies usually rested a week between feedings. Only once before had the creatures come out night after night, and that was to hunt me with the goal of turning me.\u003c/p\u003e\n\u003cp\u003eWere they focused on someone else now?\u003c/p\u003e\n\u003cp\u003e“I’ll be called into action,” I said. And I would find out, one way or another, if the other night had been an anomaly or not. If the zombies would once again ignore me. If I would hear crazed whispers. If I would black out and end up at my old home.\u003c/p\u003e\n\u003cp\u003eMr. Holland replied, “I’ll put everyone on patrol tonight and make sure you have a partner who will whisk you to safety if you have another...episode.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I muttered. I left the office and shut myself inside my bedroom. Then I dialed Dr. Bendari. Again, a recording told me the carrier wasn’t available. Dang it. Would he ever again activate it?\u003c/p\u003e\n\u003cp\u003eI thought about the journal, my other source of info. Light chased away darkness. Fire burned away evil. The words snagged me. I just couldn’t let them go.\u003c/p\u003e\n\u003cp\u003eSighing, I sat in front of the vanity and steeled myself to look in the mirror. I needed a status report, and this was the best way.\u003c/p\u003e\n\u003cp\u003eMy gaze met hers. The smudges had actually spread, stretching from underneath her eyes to her cheeks, even delving down the plane of her neck. Shaking, I whipped my shirt over my head. She did the same...several beats after me. Annnd the smudges continued, branching from her neck to her shoulders. The largest smudge rested just over her heart. Once the size of my thumb, it was now the size of a giant’s fist. I traced my fingertips over the skin there.\u003c/p\u003e\n\u003cp\u003eMy reflection never moved.\u003c/p\u003e\n\u003cp\u003eTick, tock. Tick, tock.\u003c/p\u003e\n\u003cp\u003eLouder than before.\u003c/p\u003e\n\u003cp\u003eShe was stronger.\u003c/p\u003e\n\u003cp\u003eFighting a wave of frustration, I injected myself with antidote, just to be safe, showered and dressed in my all-black fighting clothes. I opened my door to head to Nana’s room. I needed a ride to Cole’s. Kat caught me off guard, her hand posed as if she meant to knock.\u003c/p\u003e\n\u003cp\u003e“Everything okay?” I asked.\u003c/p\u003e\n\u003cp\u003e“Peachy. I came to offer you a ride to Cole’s. Frosty texted. He asked me to meet him at the barn at five.”\u003c/p\u003e\n\u003cp\u003eA coincidence? “I accept, thanks.”\u003c/p\u003e\n\u003cp\u003eThe barn was packed with slayers, and I realized I’d misunderstood Cole’s intentions. We weren’t going to talk. He was going to lecture. Not just me, but everyone.\u003c/p\u003e\n\u003cp\u003eI’d had too many highs and lows lately to let this disappoint me...much.\u003c/p\u003e\n\u003cp\u003eMy gaze landed on Veronica, and I had to fight to keep my lunch. She had two black eyes, a slightly swollen nose and a busted lip, and she was peering up at Gavin, who was saying something to her. I quickly looked away.\u003c/p\u003e\n\u003cp\u003e“Kitty Kat,” Frosty said.\u003c/p\u003e\n\u003cp\u003e“Jerk Face,” she retorted, surprising me.\u003c/p\u003e\n\u003cp\u003eHis eyes frosted over in tribute to his name. “What’d I do this time?”\u003c/p\u003e\n\u003cp\u003e“Nothing. I thought I’d be mad just to be mad and liven things up. We were getting stale.”\u003c/p\u003e\n\u003cp\u003eIn a snap, he lost his air of coldness. He barked out a laugh. “You’re too sexy for words, you know that?”\u003c/p\u003e\n\u003cp\u003e“Actually, I do,” she said, and ran to him, throwing herself in his arms.\u003c/p\u003e\n\u003cp\u003eHe caught her, and as he spun her around, a sharp ache tore through my chest. I’d had that once. Would I die before I experienced it again?\u003c/p\u003e\n\u003cp\u003eShut up, Downer Ali!\u003c/p\u003e\n\u003cp\u003e“What’s going on?” I asked, hating the tremor in my voice.\u003c/p\u003e\n\u003cp\u003eFrosty set Kat on her feet but kept her tucked into his side, acting as her shield, her sole support. “Don’t know. Cole has something to tell everyone, but he’s not here yet.”\u003c/p\u003e\n\u003cp\u003e“Something to tell everyone...even me?” Kat asked, thumping a finger against her chest.\u003c/p\u003e\n\u003cp\u003e“Even you.” He kissed her on the temple. “You’re now an important member of our team.”\u003c/p\u003e\n\u003cp\u003e“I am? I mean, of course I am. Duh.” She beamed up at him.\u003c/p\u003e\n\u003cp\u003eHe cupped her cheeks, ensuring that she couldn’t look away. Tone serious, he said, “You can’t go out at night and fight, since you can’t see the zombies, so don’t even ask. But you can patch me up if I come home injured.”\u003c/p\u003e\n\u003cp\u003e“Dr. Kitty Kat,” she said with a nod. “I approve.”\u003c/p\u003e\n\u003cp\u003e“I hope you dole out kisses.” He leaned down and pressed a soft one into her lips. “They’re my medicine.”\u003c/p\u003e\n\u003cp\u003e“Well, that kind of medicine will cost you. Just...don’t come home injured. I’ll be mad.”\u003c/p\u003e\n\u003cp\u003e“You know I hate when my little kitty is mad. Her claws come out.”\u003c/p\u003e\n\u003cp\u003e“They come out for other reasons, too,” she purred.\u003c/p\u003e\n\u003cp\u003eIn seconds, they were going at each other like wild beasts at mating season.\u003c/p\u003e\n\u003cp\u003e“Break it up before I break you in half, Frost,” Bronx called, and he didn’t sound like he was joking.\u003c/p\u003e\n\u003cp\u003eI found him in the crowd and pulled him into a shadowed corner. “Did you find out anything about Ethan?” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-28.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
