{"id":108960,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI halted at the double doors.\u003c/p\u003e\n\u003cp\u003eHUNGRYHURTMAIMKILLSOON!\u003c/p\u003e\n\u003cp\u003eI leaned forward—until I could go no further and my spirit separated from my body, ripping from me with painful force, as if pushed. Inside the building, cold air nearly flash-froze my skin.\u003c/p\u003e\n\u003cp\u003eHURTSOON!\u003c/p\u003e\n\u003cp\u003eHUNGRY!\u003c/p\u003e\n\u003cp\u003eThe small enclosure was dark and dank, but smelled of wildflowers and sunshine. I shifted to the side, and what seemed to be a thousand red eyes opened to track the movement. A gasp of horror escaped me.\u003c/p\u003e\n\u003cp\u003eI’d just found a zombie nest.\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003eThe Zombies Are Back in Town\u003c/p\u003e\n\u003cp\u003eThe shock must have brought me to my senses. As easily as my body had been dragged forward, it now whisked backward. Spirit and body collided, once again hooking up.\u003c/p\u003e\n\u003cp\u003eKat was at my side, tugging at my arm. I tripped over her feet and fell, banging my knees into the cold, hard ground. The scent of rot clung to my nose, the wildflowers and sunshine gone.\u003c/p\u003e\n\u003cp\u003e“Frosty’s on the way,” she said. “He’ll make everything better.”\u003c/p\u003e\n\u003cp\u003e“Get back. Purse. Syringe. Throw.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with her?” Reeve asked with a tremor. “I know she’s sick, but she was just comatose!”\u003c/p\u003e\n\u003cp\u003e“Sick?” Ethan demanded.\u003c/p\u003e\n\u003cp\u003e“Gets violent,” Reeve said, distracted.\u003c/p\u003e\n\u003cp\u003e“Violent,” he parroted hollowly.\u003c/p\u003e\n\u003cp\u003e“Back!” I shouted, pushing Kat away from me. If I helped the zombies... If I hurt my friends... “Go! Please,” I croaked. I no longer wanted her to take time to search for the antidote in my purse. “Please.”\u003c/p\u003e\n\u003cp\u003eEthan jerked a protesting Reeve away from me. She worked her way free and raced back to my side, but he quickly caught up with her, hefted her over his shoulder and took off for his car.\u003c/p\u003e\n\u003cp\u003eMaim. Kill.\u003c/p\u003e\n\u003cp\u003eHungry.\u003c/p\u003e\n\u003cp\u003eSoon.\u003c/p\u003e\n\u003cp\u003eCold.\u003c/p\u003e\n\u003cp\u003eThe words played through my mind, a terrible song. I wanted to stand, but my vision was going dark. “Run, Kat,” I commanded. “Run and don’t look back. It’s happening. The worst is happening.”\u003c/p\u003e\n\u003cp\u003eThe nearness of the zombies must have provoked Z.A. to rise.\u003c/p\u003e\n\u003cp\u003e“I’m not leaving you. I’m— Hmph! What are you doing, Ethan? Let me go!”\u003c/p\u003e\n\u003cp\u003eHe was carting her to his car?\u003c/p\u003e\n\u003cp\u003eHe must have. Tires squealed. Gravel sprayed. He had no idea what was going on, but he’d sensed the danger, had understood the truth in Reeve’s claim about violence and had reacted accordingly. I’d have to remember to thank him.\u003c/p\u003e\n\u003cp\u003eI lay on the ground, exactly where I’d fallen. Breath rasped from me, burning my lungs, my throat. Should I stay here and try to calm down?\u003c/p\u003e\n\u003cp\u003eAre you kidding? Stand up! Fight! Zombies had killed my family, and I had made it my life’s mission to return the favor.\u003c/p\u003e\n\u003cp\u003eWhat was more, if the zombies emerged and innocents were around...\u003c/p\u003e\n\u003cp\u003eI pulled my knees into my chest and pushed, unfolding to my full height. I wobbled but managed to stay upright.\u003c/p\u003e\n\u003cp\u003eI curled stiff fingers around the dagger hilts sticking out of my boots; metal whistled against leather as I freed the blades. The darkness persisted, closing in on me, and I blinked rapidly. Little pricks of color suddenly appeared—all of them red.\u003c/p\u003e\n\u003cp\u003eThe zombies had emerged.\u003c/p\u003e\n\u003cp\u003eFootsteps pounded at my side, and I stiffened. A hard breeze wafted over me, followed by another, and another. Unsure how close the monsters were, I swiped out an arm, encountered only air.\u003c/p\u003e\n\u003cp\u003e“Ali.” Cole’s voice registered a split second before I was tackled to the ground.\u003c/p\u003e\n\u003cp\u003eI lost my grip on the daggers, as well as what remained of my breath. My head thumped against a rock, and a sharp pain tore through my skull.\u003c/p\u003e\n\u003cp\u003e“Sorry, sorry,” Cole rushed out.\u003c/p\u003e\n\u003cp\u003eI tried to sit up, but he pinned my arms to the ground, making any kind of movement impossible.\u003c/p\u003e\n\u003cp\u003e“You’re staying right here. The others will take care of the zombies.”\u003c/p\u003e\n\u003cp\u003eAround us, grunts and groans erupted. The fight was on, good against evil, light against dark.\u003c/p\u003e\n\u003cp\u003eI should be helping. I should—hmm, Cole smelled like heaven. The rot had faded, and his scent was crisp and clean, untainted, wonderfully pure, and the more I inhaled, the more I liked it. The more my mouth watered.\u003c/p\u003e\n\u003cp\u003eSo. Hungry.\u003c/p\u003e\n\u003cp\u003eI could feel the utter emptiness of my stomach, could feel the pangs sharpening into little razor blades. My gaze locked on Cole’s pulse. How it glowed and thumped, speaking to me. Taste. Me. Taste. Me.\u003c/p\u003e\n\u003cp\u003eYes, I thought. I lifted my head, nuzzled my nose against the line of his neck. He was warm, and I was cold. Colder than I’d ever been, surely.\u003c/p\u003e\n\u003cp\u003e“What are you doing, Ali?” he demanded.\u003c/p\u003e\n\u003cp\u003eI bared my teeth, with every intension of biting him. Gonna be so good.\u003c/p\u003e\n\u003cp\u003eHis strong fingers captured my jaw, keeping my mouth closed. “You don’t want to do this. You’re better than this.”\u003c/p\u003e\n\u003cp\u003eBetter? I wasn’t better. I was hungry, and he was preventing me from eating. I wanted to eat! With a growl, I jerked from his grip.\u003c/p\u003e\n\u003cp\u003e“Ali. You once promised me you would never do this again. Do you remember?”\u003c/p\u003e\n\u003cp\u003eI stilled. I’d promised him all right, and I hated to lie.\u003c/p\u003e\n\u003cp\u003eDeep breath in. Out. Mind clearing.\u003c/p\u003e\n\u003cp\u003e“You can control this. You could control her.”\u003c/p\u003e\n\u003cp\u003eHer. Z.A.\u003c/p\u003e\n\u003cp\u003eRemembering who—and what—she was gave me the wake-up call I’d needed.\u003c/p\u003e\n\u003cp\u003eFight her.\u003c/p\u003e\n\u003cp\u003eThis was a test of wills. Hers and mine. We were separate, and it was time to prove it. I was stronger. I had to be stronger.\u003c/p\u003e\n\u003cp\u003e“Good girl.” He brushed his fingertips over my brow, and I felt a stream of warmth, a total evaporation of the hunger.\u003c/p\u003e\n\u003cp\u003eHow did he do that?\u003c/p\u003e\n\u003cp\u003eDark. Light.\u003c/p\u003e\n\u003cp\u003eThe words struck me again.\u003c/p\u003e\n\u003cp\u003eSuddenly Cole went rigid. “Ow!” he spat, and released a tide of dark curses. I heard the rustle of clothing, the snap of metal hitting bone.\u003c/p\u003e\n\u003cp\u003eI struggled to sit up, only to realize Cole had left his body on top of me while his spirit slashed at the zombie determined to end him. One of his daggers lodged into the creature’s collarbone, and Cole spun, slicing his opponent across the throat with the other.\u003c/p\u003e\n\u003cp\u003eAs the zombie fell, its head detached from its body. Cole held out his hand, flames crackling over his fingers. He flattened his palm against the creature’s chest. One second passed, two, three, I don’t know how many more, I lost count, and the flames began to spread up and down, until they covered every inch of the zombie.\u003c/p\u003e\n\u003cp\u003eBoom.\u003c/p\u003e\n\u003cp\u003eThe body exploded and ash rained through the air.\u003c/p\u003e\n\u003cp\u003eCole did the same thing to the head, pressing the zombie face-first into the ground to hide the teeth. The creature was still alive, still trying to chomp on him.\u003c/p\u003e\n\u003cp\u003eBoom.\u003c/p\u003e\n\u003cp\u003eMore ash sprayed.\u003c/p\u003e\n\u003cp\u003eHe straightened, wavering on his feet. The fire had died from his hand. His knees buckled, and he hit the ground. I rallied my strength and bucked the weight of his body off me, then crawled to his spirit. He had no injuries—wait. His pants were ripped at the ankle. I twisted and saw the teeth marks in his flesh, as well as the black goo the zombies always left behind.\u003c/p\u003e\n\u003cp\u003eI whimpered. He’d been bitten because he’d been distracted. By me.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” I said. I’d said those words a lot lately.\u003c/p\u003e\n\u003cp\u003e“Antidote,” he rasped.\u003c/p\u003e\n\u003cp\u003eYes, of course. I crawled back to his body, found the syringe in his back pocket and returned to him. Only the needle and my hand ghosted right through him. Why—because he was in spirit form, and I was in natural.\u003c/p\u003e\n\u003cp\u003eI tried to force my spirit out of my body, but the hard hands from before held on to me, keeping me inside. Dang it!\u003c/p\u003e\n\u003cp\u003eIn the back of my mind, I thought I heard gleeful giggles.\u003c/p\u003e\n\u003cp\u003eZ.A. was laughing at me.\u003c/p\u003e\n\u003cp\u003eMaybe I could start a new to-do list. A small one, with only one task. HURT HER.\u003c/p\u003e\n\u003cp\u003eScanning the area, I took note of the other slayers. Gavin slashed at two zombies at once. Veronica came in from behind and hobbled the zombies at the ankles. Frosty swooped in and pressed his glowing palm against the zombie’s chest, just as Cole had done. Bronx fought every creature trying to reach the stationary Frosty.\u003c/p\u003e\n\u003cp\u003eI couldn’t distract them. This was up to me, and there was only one solution. Back to Cole’s body I went. I slid my hands under his shoulders and dragged him, one inch at a time, toward his now writhing spirit. He was so heavy, I stumbled with every step. Eventually I managed to drag him close enough to stretch out his arm and connect natural fingers with spiritual fingers, joining the two together.\u003c/p\u003e\n\u003cp\u003eTrembling, I rose to my knees and shoved the needle deep into his neck.\u003c/p\u003e\n\u003cp\u003eHe arched, his back bowing off the ground. Then he sagged into place. “Thank you,” he said, panting.\u003c/p\u003e\n\u003cp\u003eI crouched beside him, guarding him from further attack. But I’d taken so long to help him, the battle was over. Gavin straightened, ash from the last creature to die raining around him.\u003c/p\u003e\n\u003cp\u003eVeronica returned to her body, became one and rushed over to pull Cole up. “Are you okay, sugar?”\u003c/p\u003e\n\u003cp\u003eSugar again. I wanted to push her away from him.\u003c/p\u003e\n\u003cp\u003eI didn’t.\u003c/p\u003e\n\u003cp\u003e“I’m fine.” Very gently, he added, “Don’t...don’t call me that. Okay?”\u003c/p\u003e\n\u003cp\u003eShe blanched. Then she glared at me, spitting out, “You’re the worst thing that’s ever happened to him. Have you realized that yet?”\u003c/p\u003e\n\u003cp\u003eI couldn’t, wouldn’t, engage her. And I couldn’t exactly refute her, could I?\u003c/p\u003e\n\u003cp\u003e“If you don’t cut him loose, you’re going to kill him, and I’m going to... I’ll put you... Argh!” Clearly, she’d kept herself on a leash, and the leash had just broken. She launched at me, knocking me to my back and throwing a punch.\u003c/p\u003e\n\u003cp\u003eI took it, using what little energy I had left to work my legs between us and shove her away. She came back swinging and clipped me in the chin. I rolled with the impact, lumbered to my feet. We circled each other.\u003c/p\u003e\n\u003cp\u003e“I’m going to—”\u003c/p\u003e\n\u003cp\u003e“Nothing,” Cole said, silencing her as he stood. “You’re going to do nothing, Veronica.”\u003c/p\u003e\n\u003cp\u003ePanting, she said, “Please tell me you don’t still care about this girl. After everything she’s done?” When he failed to reply, she paled and looked to me. “I don’t know if you’re human or zombie or both, Ali Bell, and I don’t care. You’re no good for Cole or anyone here, so why don’t you do us all a favor and stay away? Or die. My vote is die.” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-37.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
