{"id":108961,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“That’s enough,” Cole shouted.\u003c/p\u003e\n\u003cp\u003eI...wanted to die. Everything Veronica had said rang true. These people would have been far better off without me. Cole would have been able to fight. He wouldn’t have gotten bitten. And what about tomorrow? What would happen then? I was nothing more than a living time bomb. I never knew what I would do next—or whom I would hurt. One day, I could detonate and take out everyone around me.\u003c/p\u003e\n\u003cp\u003e“The zombies are dead. Where’s Kat?” Frosty demanded. He stood a few feet away from me, his clothes torn and splattered with black goo. Just then, his navy eyes did justice to his name—they were coated with ice.\u003c/p\u003e\n\u003cp\u003eCole moved beside me and wrapped his arm around me in a shocking show of support. I loved his warmth and his scent and his strength and wanted nothing more than to bask in them, but I forced myself to move away from him.\u003c/p\u003e\n\u003cp\u003eHe might support me in this right now, but it wouldn’t last. He’d soon regret it and wish he’d kept me at a distance.\u003c/p\u003e\n\u003cp\u003eHe lifted his chin, every muscle in his body tense.\u003c/p\u003e\n\u003cp\u003eI pretended to ignore him, marching over to grab my purse and inject myself with antidote.\u003c/p\u003e\n\u003cp\u003e“Kat,” Frosty snapped.\u003c/p\u003e\n\u003cp\u003e“Ethan,” I replied. “She’s with Ethan Hamilton.”\u003c/p\u003e\n\u003cp\u003eFrosty went still, a predator who’d just spotted the tastiest of prey. “Who’s Ethan?”\u003c/p\u003e\n\u003cp\u003e“Reeve’s...friend. I know where he lives.” Bronx was just as disheveled, just as splattered, just as predatory. “Cole?”\u003c/p\u003e\n\u003cp\u003e“Go,” he said, and the two boys needed no more prompting.\u003c/p\u003e\n\u003cp\u003eGavin stepped to my side, saying, “You need a ride, Ali?”\u003c/p\u003e\n\u003cp\u003e“I’ll take her.” Cole approached me a second time, but I backpedaled toward Gavin.\u003c/p\u003e\n\u003cp\u003e“No. He’ll take me,” I rushed out. Avoiding Gavin had been stupid. He didn’t tempt me to do things I shouldn’t. I could remain calm with him.\u003c/p\u003e\n\u003cp\u003eI wouldn’t become a menace.\u003c/p\u003e\n\u003cp\u003eCole stopped abruptly, looking between us, his eyes narrowing. I wasn’t sure of Gavin’s reaction to this new turn of events, and I didn’t care enough to switch my attention. My gaze remained locked with Cole’s. My heart cracked.\u003c/p\u003e\n\u003cp\u003e“It’s better this way, remember?” I said softly.\u003c/p\u003e\n\u003cp\u003e“For who?”\u003c/p\u003e\n\u003cp\u003eYou. “Both of us.”\u003c/p\u003e\n\u003cp\u003eHe massaged the back of his neck and turned his now ice-cold focus to the others.\u003c/p\u003e\n\u003cp\u003e“I’ll see you back at the barn,” he said.\u003c/p\u003e\n\u003cp\u003eTrina nodded without looking up. Silent, Lucas flashed a thumbs-up. Veronica approached Cole, but he very gently shook her off and said, “We talked about this, Ronny.”\u003c/p\u003e\n\u003cp\u003eHer features fell.\u003c/p\u003e\n\u003cp\u003eHe stalked away. Twice he glanced back at me, and the crack in my heart widened.\u003c/p\u003e\n\u003cp\u003eCould nothing in my life go right?\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eTweedledee and Tweedledum Dumb\u003c/p\u003e\n\u003cp\u003e“Don’t you need to get back out there?” I asked Gavin as I unlocked my front door. “There could be a flood of zombies tonight.” Even though I hadn’t noticed a rabbit cloud during the drive home. Yeah, I’d finally broken down and looked.\u003c/p\u003e\n\u003cp\u003e“It’s doubtful. You woke a nest. That’s the only reason those zombies came out when they did.”\u003c/p\u003e\n\u003cp\u003eI paused in the open doorway and faced him, my arms spread to block his path. “Well, don’t you need to be out there putting Blood Lines around the homes of the innocent?”\u003c/p\u003e\n\u003cp\u003eHis lips curled at the corners. “Mr. Ankh and Mr. Holland have been taking care of that. Now, aren’t you going to invite me in?”\u003c/p\u003e\n\u003cp\u003eSure. In...never. “I don’t want to be rude, but—”\u003c/p\u003e\n\u003cp\u003e“Good. Then don’t be rude.” He picked me up and set me aside. “I’m spending the rest of the evening with you, then crashing on your couch.”\u003c/p\u003e\n\u003cp\u003eExasperated, I entered behind him. Did he think I’d leave and go on a killing rampage?\u003c/p\u003e\n\u003cp\u003eLike you can really blame him.\u003c/p\u003e\n\u003cp\u003e“Sorry, but we don’t have a couch.” We’d been buying one piece of furniture at a time, when we found cheap but reliable pieces, and so far had only managed to pick up two beds and a dining room table.\u003c/p\u003e\n\u003cp\u003e“Uh, are you sure about that?” He sounded amused.\u003c/p\u003e\n\u003cp\u003e“Maybe not,” I said, my tone dry. “I only live here.” I shut and locked the door before nailing him with a glare.\u003c/p\u003e\n\u003cp\u003e“Now, now. Don’t look at me like that,” he said, chucking me under the chin. “I saw the video, and I know what you’re capable of, but I also know you wanted to bite Cole that night—and this one. The look in your eyes, the way you licked your lips... I’ve seen zombies do that. But the bottom line? You didn’t do it. Before, you turned your hunger on the zombies, and today you somehow managed to snap yourself out of it. I respect the kind of strength that took.”\u003c/p\u003e\n\u003cp\u003eHe was...right, I realized. Z.A. had controlled me, darkened my mind, yet I’d had the strength to fight her. Hope bloomed brighter than it had in days, as pretty as a flower opening in the sun. Maybe I wasn’t such a terrible menace after all.\u003c/p\u003e\n\u003cp\u003e“If you aren’t afraid of what I’ll do, why do you want to stay here?” I asked, waving my hand at—\u003c/p\u003e\n\u003cp\u003eA furnished and decorated living room. I frowned and bustled forward. “Nana,” I called.\u003c/p\u003e\n\u003cp\u003e“Ali, dear. You’re home.” Dusting her hands together, she snaked around the hallway corner. “Oh, no. You’re injured. What happened?”\u003c/p\u003e\n\u003cp\u003e“The usual,” I said, then motioned to the new furnishings. “How much did all of this cost?”\u003c/p\u003e\n\u003cp\u003eShe fidgeted with the hem of her shirt. “Don’t you worry about that. I gave myself a budget and stuck to it.”\u003c/p\u003e\n\u003cp\u003e“Nana,” I said.\u003c/p\u003e\n\u003cp\u003eMy expression must have betrayed my thoughts, because she said, “I know you want to save to buy a house of our own, but I don’t want us living like paupers while we do it.”\u003c/p\u003e\n\u003cp\u003eOkay. All right. If she wanted this stuff, then I wanted her to have it.\u003c/p\u003e\n\u003cp\u003eI hugged her tight and kissed her on the temple. “Everything looks amazing, Nana. Seriously.”\u003c/p\u003e\n\u003cp\u003e“I’m so glad you think so. Wait till you see your bedroom,” she said with a smile.\u003c/p\u003e\n\u003cp\u003eGavin cleared his throat, and Nana peeked around me.\u003c/p\u003e\n\u003cp\u003e“Oh, I’m so sorry, Gavin. I didn’t realize you were here. It’s lovely to see you again.” Her gaze moved over him, widened. “I’m guessing you ran into the same bit of usual trouble my Ali did.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am, I sure did.”\u003c/p\u003e\n\u003cp\u003eShe gulped. “There were others with you? And everyone...survived?”\u003c/p\u003e\n\u003cp\u003e“More than. We thrived.” He shook off his coat and draped the fabric over his arm. “I don’t know about you, but I’m starving. I’d love a chance to cook you dinner to thank you for allowing me to sleep on your couch.”\u003c/p\u003e\n\u003cp\u003eWait. The he-slut of the great South knew how to cook?\u003c/p\u003e\n\u003cp\u003eNana’s gaze met mine for a split second, her mouth forming a small O. “You’re staying the night?”\u003c/p\u003e\n\u003cp\u003e“If it’s all right with you. I’ll behave, you have my word.”\u003c/p\u003e\n\u003cp\u003e“Are you two...”\u003c/p\u003e\n\u003cp\u003e“No,” I rushed out, at the same time Gavin said, “We’re debating it.”\u003c/p\u003e\n\u003cp\u003eI glared at him. “We’re better off as friends.”\u003c/p\u003e\n\u003cp\u003e“In that case, it’ll be nice having a man around,” Nana said, once again dusting her hands together. “I bought a bookcase I wasn’t looking forward to putting together.”\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” he said. “I’m always ready for a chance to be a hero.”\u003c/p\u003e\n\u003cp\u003eShe giggled like a schoolgirl—a dirty, dirty schoolgirl—and I did a double take. “You already are. The bookcase can wait until after dinner, though. I’ve got a few more things to arrange in my room.”\u003c/p\u003e\n\u003cp\u003eThe moment we were alone, I anchored my hands on my hips. “Will you please stop forgetting you’re into brunettes?”\u003c/p\u003e\n\u003cp\u003e“I realized I can’t see hair color in the dark.”\u003c/p\u003e\n\u003cp\u003eOh, wow. “However will I continue to resist such wondrous flattery?”\u003c/p\u003e\n\u003cp\u003eSmiling, he swept around me and entered the kitchen. “What can’t be manufactured is attitude, and I happen to like yours.”\u003c/p\u003e\n\u003cp\u003eI came in behind him and opened the fridge to grab something to drink. It was now fully stocked with all my favorites. Orange juice, milk, protein shakes, fruits, vegetables and even the chocolate cupcakes I liked to eat cold. I groaned.\u003c/p\u003e\n\u003cp\u003e“What?” Gavin said.\u003c/p\u003e\n\u003cp\u003e“She spent too much money on me.”\u003c/p\u003e\n\u003cp\u003e“Most girls wouldn’t complain about that.”\u003c/p\u003e\n\u003cp\u003eI selected one of the shakes. “Most girls don’t have my Nana. I want to pamper her, not the other way around.”\u003c/p\u003e\n\u003cp\u003eGavin reached in behind me to snag a juice. Our arms brushed, and I scowled up at him.\u003c/p\u003e\n\u003cp\u003e“Stop trying to seduce me,” I said.\u003c/p\u003e\n\u003cp\u003e“Why? Is it working?”\u003c/p\u003e\n\u003cp\u003e“If you like to be stabbed, yes.”\u003c/p\u003e\n\u003cp\u003e“I’ve let girls do a lot worse to me.”\u003c/p\u003e\n\u003cp\u003eI shook my head, exasperated.\u003c/p\u003e\n\u003cp\u003e“Look, I don’t want to go home. I’ve been dividing my time between Cole’s house, a crappy motel and the homes of the women I’m fu...screwing.”\u003c/p\u003e\n\u003cp\u003e“You can say it. My ears won’t melt off.”\u003c/p\u003e\n\u003cp\u003eHe snorted. “Cole says we’re not to cuss around you. Potty mouth is contagious, I guess. Anyway. A guy can only take so much. I’m desperate for a break.”\u003c/p\u003e\n\u003cp\u003eWell, I couldn’t exactly kick him out now. I wasn’t that cruel.\u003c/p\u003e\n\u003cp\u003eI nodded my agreement before moving around him.\u003c/p\u003e\n\u003cp\u003eHe grinned at me, his eyes alight with mischief. “You act all proper now, but in the visions, you’ve definitely got a lady boner for me.”\u003c/p\u003e\n\u003cp\u003eI choked on a laugh. “Lady boner?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I kinda like knowing there are two sides to you and I’m the one responsible.”\u003c/p\u003e\n\u003cp\u003eTwo sides to me. He had no idea one of those sides was the enemy. “Gavin.”\u003c/p\u003e\n\u003cp\u003e“Nah. You don’t need to put me in my place again. Whether you admit it or not, you’re softening toward me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-38.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
