{"id":108966,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI clambered to my feet, searched, but couldn’t find my phone. Decided to leave it behind. My legs stiffened even as I trudged deeper into the woods, and all too soon, I could barely chug forward an inch at a time. I scanned the area.\u003c/p\u003e\n\u003cp\u003eBad news: as naked as the trees were, they wouldn’t offer much coverage if I climbed.\u003c/p\u003e\n\u003cp\u003eGood news: Shooter would have to look up to see me.\u003c/p\u003e\n\u003cp\u003eBad news: he could easily look up.\u003c/p\u003e\n\u003cp\u003eI had no other option. Using pieces of bark as handrails and stepstools, I shimmied my way up the tallest I could find. Every inch was agony. Finally I reached a large enough limb to support my weight and stopped, pressing my back against the trunk. I palmed the two daggers sheathed at my ankles and drew my knees up to my chest, trembling...waiting.\u003c/p\u003e\n\u003cp\u003eA horde of birds flew overhead, and a gentle wind whistled, hopefully masking the thunderous beat of my heart and the wheeze in my lungs. In a battle to the death, what would I do? I had no problem fighting zombies, ending them. They weren’t people. He was.\u003c/p\u003e\n\u003cp\u003eHe wanted to kill me. I should have no problem ending him, too. And there he was, inching from one tree to the other, using the trunks as a shield. He scanned one way, then the other, before moving on. He scanned up, and he scanned down, and—\u003c/p\u003e\n\u003cp\u003eOur gazes locked.\u003c/p\u003e\n\u003cp\u003eInstinct kicked in, and I launched a dagger before he could aim his gun. The tip embedded in his shoulder, flinging him backward.\u003c/p\u003e\n\u003cp\u003ePop! He’d managed to squeeze off a shot. The bullet hit just above my shoulder, and bark flew in every direction. Some of it landed in my mouth, and I spat it out as I jumped.\u003c/p\u003e\n\u003cp\u003eImpact banged my teeth together. I tasted old pennies. Go, go, go. I took several steps, intending to run—then I stopped. If I ran, he would probably find me again. There wasn’t anywhere to hide. I could throw another knife and maybe stop him, maybe not. He could just shoot at me again.\u003c/p\u003e\n\u003cp\u003eIt might be better to face him here and now.\u003c/p\u003e\n\u003cp\u003eTrembling, I turned and approached him. He was lying on the ground, his chest rising and falling in quick succession as he struggled to sit up. His gun had been knocked out of his hand and rested a few feet away.\u003c/p\u003e\n\u003cp\u003eHe dived for it when he spotted me, but then, so did I. I beat him by a fraction of a second, straightening and pointing the barrel at him.\u003c/p\u003e\n\u003cp\u003eHe glared at me. “You wouldn’t.”\u003c/p\u003e\n\u003cp\u003e“You’re still wearing my dagger like it’s this year’s must-have accessory. Of course I’ll shoot you.” My trembling became more pronounced, the weight of the gun almost too much for me to handle.\u003c/p\u003e\n\u003cp\u003eHe replaced the glare with a smug smile, saying sweetly, “You want to go to prison for murder, sweetness?”\u003c/p\u003e\n\u003cp\u003e“I want to survive, and we both know this would be self-defense.” My finger twitched on the trigger. Come on, Cole. “Why do you work for Anima?” I asked to stall.\u003c/p\u003e\n\u003cp\u003e“Why not? The pay is good.”\u003c/p\u003e\n\u003cp\u003e“You don’t care that the company isn’t interested in destroying the zombies? That they hope to make money off them?”\u003c/p\u003e\n\u003cp\u003eThe look he gave me was pitying. “No need to give me a speech about right and wrong. I’d fight for your side if the price was right.” As he spoke, he slowly angled to the side.\u003c/p\u003e\n\u003cp\u003eHe was planning something.\u003c/p\u003e\n\u003cp\u003eI fired the gun, my arms jerking up with the recoil.\u003c/p\u003e\n\u003cp\u003eHe grunted and pulled his leg into his chest.\u003c/p\u003e\n\u003cp\u003e“Move again,” I said, “and I’ll put a hole in the other one.”\u003c/p\u003e\n\u003cp\u003eA mouthful of curses was hurtled at me. “I’m going to make you pay for this, little girl.”\u003c/p\u003e\n\u003cp\u003eThreats? Seriously?\u003c/p\u003e\n\u003cp\u003eI shot his other leg. Just. Because.\u003c/p\u003e\n\u003cp\u003eAs he writhed in pain, the bushes to my left rustled. Footsteps pounded. I backed away, intending to run. Or hide. Or both.\u003c/p\u003e\n\u003cp\u003e“Ali!” Cole called.\u003c/p\u003e\n\u003cp\u003e“Here!” I shouted back, overjoyed.\u003c/p\u003e\n\u003cp\u003eCole and Veronica burst into my line of sight.\u003c/p\u003e\n\u003cp\u003eHe’d brought her with him.\u003c/p\u003e\n\u003cp\u003eCole seemed to take in the entire scene with only a glance. He dived on top of the man and whaled, throwing punch after punch. The gun fell out of my hand, and my knees gave out.\u003c/p\u003e\n\u003cp\u003eNow that I was safe, the surge of strength abandoned me completely. As my eyes closed, I saw Veronica watching Cole beat the man senseless. There was no recognition on her face. No remorse over what was happening to Anima’s employee.\u003c/p\u003e\n\u003cp\u003eMaybe she wasn’t the spy, either.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eWeep Some More\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe sound reverberated in my head. Panting, I jolted upright. Sweat poured from me, every one of my pulse points pounding to the beat of a riotous drum.\u003c/p\u003e\n\u003cp\u003e“You’re all right. I’m here.”\u003c/p\u003e\n\u003cp\u003eCole’s voice. Strong hands urged me back onto the mattress.\u003c/p\u003e\n\u003cp\u003eI blinked to clear my vision, but only darkness greeted me. “Where am I?” I croaked, the words scraping against a throat gone raw.\u003c/p\u003e\n\u003cp\u003e“Ankh’s. He looked you over. Said you’d bruised a few ribs, had a few cuts, but were otherwise fine.”\u003c/p\u003e\n\u003cp\u003eAs the surge of panic eased, aches and pangs battled for my attention, and memories surfaced. I’d survived another car crash, but others had died. I’d been hunted, nearly killed. I might have killed another human being. Tears burned the backs of my eyes, and I gave a humiliating sniffle—or six.\u003c/p\u003e\n\u003cp\u003eCole linked our fingers and squeezed.\u003c/p\u003e\n\u003cp\u003eThe crack in my heart widened a little more, and warmth seeped through...until I remembered something else. He’d come to the forest with Veronica. I tugged my hand free.\u003c/p\u003e\n\u003cp\u003e“Ali,” he said. A pause. Then, “Can you give us a minute?” he snarled.\u003c/p\u003e\n\u003cp\u003eWhoa. Where had—\u003c/p\u003e\n\u003cp\u003e“Tell us what happened, Miss Bell,” Mr. Ankh said, and I realized Cole hadn’t been talking to me.\u003c/p\u003e\n\u003cp\u003eI peered beyond his shoulder. Or tried to. The darkness was too thick to penetrate.\u003c/p\u003e\n\u003cp\u003e“Am I blind?” I shrieked.\u003c/p\u003e\n\u003cp\u003e“What?” Cole said. “No. Of course not. If you’re having trouble seeing, it’s because your eyes are a little swollen from the smoke and we put some salve on them. Don’t worry. You’ll heal.”\u003c/p\u003e\n\u003cp\u003eOkay. Okay, then. “I have to call the coffee shop. Tell them I won’t be in.”\u003c/p\u003e\n\u003cp\u003e“Already taken care of,” Cole said. “I told them you’d been in an accident.”\u003c/p\u003e\n\u003cp\u003e“Nana—”\u003c/p\u003e\n\u003cp\u003e“Knows you’re alive and well. I’ve stayed in contact with her and told her I’d try to have you home by eleven.”\u003c/p\u003e\n\u003cp\u003e“What time is it?”\u003c/p\u003e\n\u003cp\u003e“Eight.”\u003c/p\u003e\n\u003cp\u003eThree more hours; then I’d go home. Could I keep it together?\u003c/p\u003e\n\u003cp\u003e“Miss Bell,” Mr. Ankh prompted.\u003c/p\u003e\n\u003cp\u003eI still wasn’t his biggest fan, but the story poured out of me. I told him about Dr. Bendari. I told him about the photos and what I’d learned about my condition and the antidote. I told him about Justin and his sister. About the shooter, and the two drivers, and the chase through the forest.\u003c/p\u003e\n\u003cp\u003eI wished I could see his face, judge his expression.\u003c/p\u003e\n\u003cp\u003e“We found the photos in your pack,” he said. “The others must have burned in the fire.”\u003c/p\u003e\n\u003cp\u003eSome were better than none. “Which ones did I grab?”\u003c/p\u003e\n\u003cp\u003e“One of Justin’s sister. Four of an Anima facility, and two of a computer screen with a formula they used for what I’m guessing is an improvement on the antidote.”\u003c/p\u003e\n\u003cp\u003eNot a bad haul.\u003c/p\u003e\n\u003cp\u003eMr. Holland cleared his throat, alerting me to his presence. “The shooter Cole brought in escaped his cage in this facility—the dungeon—and we have no idea how. He was weakened from blood loss. We don’t think he could have survived for long out on his own without medical attention, but to our knowledge no dead bodies have been found. He could still be out there.”\u003c/p\u003e\n\u003cp\u003eWhat Mr. Holland was trying to say without panicking me: the guy could still be after me. Just then, in the safety of the room, I didn’t care.\u003c/p\u003e\n\u003cp\u003e“Now I’m going to check your eyes,” Mr. Ankh said.\u003c/p\u003e\n\u003cp\u003eFootsteps. He gently wiped my eyes with a tissue, then flashed a muted light in front of my face. “I don’t understand—ah, there we go. You’re finally responding.” As he continued to shine that light, the darkness began to thin at last.\u003c/p\u003e\n\u003cp\u003e“It’s getting better already,” I said.\u003c/p\u003e\n\u003cp\u003e“Good. We ran some more tests and found your antizombie toxin is significantly lower.”\u003c/p\u003e\n\u003cp\u003e“The new antidote helped, then.”\u003c/p\u003e\n\u003cp\u003e“New?”\u003c/p\u003e\n\u003cp\u003e“There are vials of it in my pack.”\u003c/p\u003e\n\u003cp\u003e“I’ll take one and see if I can replicate it. I’ll send the others home with you.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eHe stepped back, and Cole stepped forward. Our eyes locked, violet against blue. Need against... I wasn’t sure what I was projecting at him. We—\u003c/p\u003e\n\u003cp\u003e—were standing in my bedroom. His expression was tortured, even sad, as he aimed a crossbow at my chest.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” he said.\u003c/p\u003e\n\u003cp\u003e“Cole—”\u003c/p\u003e\n\u003cp\u003e—We were back inside Mr. Ankh’s basement dungeon.\u003c/p\u003e\n\u003cp\u003eI blinked in surprise. Nothing had distracted us or gotten in our way, the usual reasons for a vision to end. This one had stopped all on its own.\u003c/p\u003e\n\u003cp\u003eBecause he’d shot me and I’d died? Whatever. At least we’d had one. That meant a part of me was back to normal. I was better.\u003c/p\u003e\n\u003cp\u003eHow long would it last, though?\u003c/p\u003e\n\u003cp\u003eApparently I was going to do something so terrible Cole would feel his only recourse was to kill me. I couldn’t even process that.\u003c/p\u003e\n\u003cp\u003e“I have no plans to aim my crossbow at you,” he said tightly. “I won’t. Ever.”\u003c/p\u003e\n\u003cp\u003eI nodded. Really, what could I say?\u003c/p\u003e\n\u003cp\u003eThat wasn’t good enough for him. “You had to be right before. The visions have to mean something else.”\u003c/p\u003e\n\u003cp\u003eI really, really hoped so.\u003c/p\u003e\n\u003cp\u003e“I’m not going to hurt you. Trust me. Please.”\u003c/p\u003e\n\u003cp\u003eThe very words I’d once—four times?—given him. “Okay,” I said, and he exhaled with relief. I just didn’t have room for another worry.\u003c/p\u003e\n\u003cp\u003e“Cole, call Justin and tell him to come by,” Mr. Holland said. “I need to tell him about his sister.”\u003c/p\u003e\n\u003cp\u003eI looked and found him standing beside the curtain separating my “room” from the others. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-43.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
