{"id":108971,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You trusted me,” I said, shocked to my soul, “despite what you saw.” That was absolutely, utterly huge.\u003c/p\u003e\n\u003cp\u003e“Yes,” he said. He fit his hands against my jaw. “I told you I did. I’m in this thing, Ali. All the way.”\u003c/p\u003e\n\u003cp\u003e“But...why did you stop texting me?”\u003c/p\u003e\n\u003cp\u003eI saw the ice frost over his eyes, and I shuddered. “My dad was monitoring my phone feed.”\u003c/p\u003e\n\u003cp\u003eOh. The ice wasn’t for me, but for his father.\u003c/p\u003e\n\u003cp\u003eI looked away from him, trying to give myself time to think, and caught a glance of my reflection in the glass. I stumbled backward.\u003c/p\u003e\n\u003cp\u003eZombie Ali was back.\u003c/p\u003e\n\u003cp\u003eFlickers of red burned in her eyes, and the black smudges on her cheeks were thicker. She smiled at me, waved—and then, through the reflection, I watched her step out of my body, away from the glass.\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003eThe Rain of Broken Glass\u003c/p\u003e\n\u003cp\u003eWith the tick of a clock loud in my ears, I watched Z.A. glide off the porch and into the driveway. She paused to look back at me and crook her finger, a silent command for me to follow. A need to know her purpose consumed me, and I stepped off after her.\u003c/p\u003e\n\u003cp\u003eUncheck from list: disabled.\u003c/p\u003e\n\u003cp\u003e“Ali,” Cole called.\u003c/p\u003e\n\u003cp\u003e“Tell Nana I’ll be back as soon as possible. And don’t come after me.” Who knew where she was leading me?\u003c/p\u003e\n\u003cp\u003eZ.A. continued moving forward, across the street, into someone else’s yard. The sun was hidden behind thick gray clouds, creating a dreary backdrop. Any moment, I expected fat raindrops to fall, soaking and freezing me. I wondered how she would react—if the water would even touch her.\u003c/p\u003e\n\u003cp\u003e“Food’s ready,” Kat called. She must have stuck her head outside the door.\u003c/p\u003e\n\u003cp\u003eI never heard Cole’s reply.\u003c/p\u003e\n\u003cp\u003eZ.A. ghosted through a fence, and I was forced to climb it. Thankfully, no one was in the backyard to accuse me of trespassing. We repeated this process three more times before coming to a creek with tall, brittle grass.\u003c/p\u003e\n\u003cp\u003eShe glanced back at me and giggled.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” I demanded.\u003c/p\u003e\n\u003cp\u003e“You’ll see,” came the singsong reply. She continued on.\u003c/p\u003e\n\u003cp\u003eI stayed in place, debating the wisdom of my actions. But then, the farther away she moved, the more I felt pulled toward her. Compelled. My feet kicked into gear without any prompting.\u003c/p\u003e\n\u003cp\u003eShe reached another front yard, another fence. Again she ghosted through. Again I climbed. We exited the backyard, came to a street, and she stopped to once again crook her finger at me. I closed the distance, putting us nose to nose.\u003c/p\u003e\n\u003cp\u003e“How are you doing this?” I snapped.\u003c/p\u003e\n\u003cp\u003eShe reached up, traced her fingers over my cheek. I couldn’t feel the pressure of her touch, but I could feel the coldness of her skin—a cold far worse than the air around us.\u003c/p\u003e\n\u003cp\u003eI shuddered.\u003c/p\u003e\n\u003cp\u003e“So pretty,” she said.\u003c/p\u003e\n\u003cp\u003eI jerked away from her reach. “I can’t return the compliment.”\u003c/p\u003e\n\u003cp\u003eHer lips curled in a slow smile. She leaned forward and whispered, “If I can’t have your body, I’ll have to get rid of it and free myself from our connection.”\u003c/p\u003e\n\u003cp\u003eIn the distance, I heard the honk of a car. A second later, something hard slammed into me, throwing me a good distance. I landed, lost my breath and then the “something” slammed on top of me, pushing out any air that had managed to remain in my lungs. As pain tore through me, the sound of squealing tires registered.\u003c/p\u003e\n\u003cp\u003e“Are you trying to kill yourself?” Cole shouted.\u003c/p\u003e\n\u003cp\u003eI glanced up. A car zoomed past the place I’d just been standing, swerving, finally managing to straighten out. I looked across the road, my gaze colliding with Z.A’s.\u003c/p\u003e\n\u003cp\u003eI saw fury.\u003c/p\u003e\n\u003cp\u003e“You disappeared for a moment,” Cole said. “I couldn’t see you. I don’t think the driver could see you. Then you reappeared and the car honked, but you just stood there.”\u003c/p\u003e\n\u003cp\u003e“I...” Wasn’t sure what to say. Z.A. had just tried to kill me.\u003c/p\u003e\n\u003cp\u003e“That’s it. I’m officially signing on as your keeper.” He stood, hefted me over his shoulder as if I were a bag of potatoes and carried me toward Kat’s house.\u003c/p\u003e\n\u003cp\u003e“Let me go, Cole. I’m going to murder her!” I beat at his back, not to hurt him but to gain his attention. He never slowed.\u003c/p\u003e\n\u003cp\u003eZ.A. watched us warily as we closed in on her.\u003c/p\u003e\n\u003cp\u003e“Murder who?” he asked casually.\u003c/p\u003e\n\u003cp\u003e“Her! My tormentor.” I would force my own spirit out of my body, and I would summon the fire and burn her to ash—whether the fire was white or red. If she could survive without me, I could survive without her. Surely.\u003c/p\u003e\n\u003cp\u003eHe turned a corner, and she stretched out her arm. He had no idea. I, however, felt her as she was sucked back inside me.\u003c/p\u003e\n\u003cp\u003eArgh! “Why can’t you see her? You can see other spirits.”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Maybe, like you, she has special abilities. Maybe she can cloak herself.”\u003c/p\u003e\n\u003cp\u003eThat...made sense. Terrible, scary sense.\u003c/p\u003e\n\u003cp\u003e“Tell me everything that just happened, Ali. Give me the long version, but make it short. I want the full story before we reach Kat’s.”\u003c/p\u003e\n\u003cp\u003e“She left my body, and she tried to kill me, and now she’s back inside me, and she’ll be more careful, because she’s smart and she knows I can’t get to her until she leaves me again.” Frustration overwhelmed me, and I banged my fists into his back with more force. “I hate this. I hate her!” I accidentally kneed him in the stomach, but he held firm.\u003c/p\u003e\n\u003cp\u003e“Ali, calm down.”\u003c/p\u003e\n\u003cp\u003eNo. I was done with calm. I twisted my upper body, sliding off his shoulder. He couldn’t stop me, but he made sure to catch me before I hit the ground. I came up fast, trying to avoid him, intending to run. The moment I was alone, I was going to freaking kill the zombie inside me!\u003c/p\u003e\n\u003cp\u003eHe grabbed my wrist and kept me in place. “Calm down,” he repeated. “I mean it.”\u003c/p\u003e\n\u003cp\u003eCalm? Calm! I. Utterly. Exploded.\u003c/p\u003e\n\u003cp\u003eI launched myself at him, throwing a left, right, left. He ducked, then arched, then swung in the other direction, but I never managed to land a blow and that angered me all the more.\u003c/p\u003e\n\u003cp\u003e“What’s wrong with you?” he demanded.\u003c/p\u003e\n\u003cp\u003e“My life is changing again, and just when I think I’m on the right road, something else happens to prove me wrong, and I’m so tired of being wrong and I think I’m mad at you because you stayed away an extra three days, and now you’re back but I know it would be best if I stayed away from you and everyone else because I could hurt you, seriously hurt you, and I just don’t know how much more I can take!”\u003c/p\u003e\n\u003cp\u003eI swung at him. Again he ducked.\u003c/p\u003e\n\u003cp\u003e“You think it was easy to stay away from you?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“My dad told me he’d keep his nose out of my relationship with you if I’d keep away from you for ten days. Just ten. No contact. I think he hoped the craving would fade. Do you know what day this is, Ali? Nine. I couldn’t make it one more damn night.”\u003c/p\u003e\n\u003cp\u003eI stilled, panting. I didn’t know what to say to that.\u003c/p\u003e\n\u003cp\u003eHe stared over at me. “I love you, Ali. Do you understand? I love you.”\u003c/p\u003e\n\u003cp\u003eWait. What? “You love me?”\u003c/p\u003e\n\u003cp\u003e“I’ve never said those words to another girl.” He lifted his chin, squared his shoulders and braced his legs apart, as if preparing for a real battle. “You’re stubborn, too curious for your own good and you’ve become a wild card, but yes, I love you.”\u003c/p\u003e\n\u003cp\u003eHe.\u003c/p\u003e\n\u003cp\u003eLoved.\u003c/p\u003e\n\u003cp\u003eMe.\u003c/p\u003e\n\u003cp\u003e“And that’s how you tell me?” Snarling, I kicked out my leg and knocked his ankles together. He fell backward, and I followed him down, throwing more punches—but these lacked any heat. My heart was too busy doing somersaults.\u003c/p\u003e\n\u003cp\u003eHe rolled me to my back and pinned my arms over my head. I bucked, but he weighed more than me, and I couldn’t dislodge him. Our gazes met, and tension smoldered between us, hot and strong and undeniable.\u003c/p\u003e\n\u003cp\u003e“Let me go,” I rasped.\u003c/p\u003e\n\u003cp\u003e“Never again,” he replied.\u003c/p\u003e\n\u003cp\u003eI was breathing so heavily my chest rubbed against his. Our legs were tangled, and I could feel every inch of him. I ran my tongue over the seam of my mouth, anger giving way to need.\u003c/p\u003e\n\u003cp\u003e“Tell me how you feel about me,” he croaked.\u003c/p\u003e\n\u003cp\u003e“No,” I said, shaking my head. I couldn’t. I wouldn’t. If I said the words—I love you, Cole, love you so much I ache—he would keep his word to never let me go, and he had to let me go. “I told you. I’m no good for you right now. That’s the only thing that hasn’t changed, and I’m not going to risk—”\u003c/p\u003e\n\u003cp\u003e“So you’re not ready. Okay. I get it. We’ll revisit this subject later.” He lowered his head, until his nose brushed mine.\u003c/p\u003e\n\u003cp\u003eI breathed him in. “No. Not later.”\u003c/p\u003e\n\u003cp\u003e“Fine. We’ll finish it now. I want you, and you want me. For now, that’ll have to be enough.” He smashed his mouth against mine, his tongue thrusting deep, and I moaned at the perfection of it. His taste, his heat, his strength, his...everything. This was what I’d missed. This was what I’d craved. Us...together. Not out of anger or hurt. Just need.\u003c/p\u003e\n\u003cp\u003eI wrapped my legs around his waist and arched up, unable to help myself. He released my hands, and I immediately tangled my fingers in his hair.\u003c/p\u003e\n\u003cp\u003e“This doesn’t mean we’re back together,” I said.\u003c/p\u003e\n\u003cp\u003e“Whatever you say, Ali-gator.”\u003c/p\u003e\n\u003cp\u003eThe pressure escalated, almost unbearable, yet not enough—not enough, must have more—as his hands roamed over me, kneading my breasts, doing things to the centers...such thrilling things. With all the different emotions still rampaging through me, my skin became more sensitive, my blood all the hotter; my nerve endings hummed. I loved it. I hated it.\u003c/p\u003e\n\u003cp\u003eI loved him. Had to tell him. Couldn’t tell him. I had to stop this, but I wanted more. So much more. Desperate for as much skin-to-skin contact as I could get, I slid my hands under his shirt and scoured my nails over the ridges of his spine. He hissed in a breath.\u003c/p\u003e\n\u003cp\u003e“I love it when you touch me,” he said.\u003c/p\u003e\n\u003cp\u003eI did it again, and the kiss spun out of control, until we were nipping at each other, and he was pulling at my clothes, and I was pulling at his, and oh, this was going to happen, wasn’t it? Here and now, outside, in the cold. I wasn’t sure how much time I had left, so nothing would stop me from stealing this moment. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-48.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
