{"id":108982,"no":59,"title":"Page 59","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Urges?”\u003c/p\u003e\n\u003cp\u003eI knew what he was asking. “I can feel them, the desires to attack and feed, waiting at the edges of my conscious. I need more light.”\u003c/p\u003e\n\u003cp\u003e“Yes. That’s what the journal says.”\u003c/p\u003e\n\u003cp\u003eSurprised, I said, “You were you able to read it?”\u003c/p\u003e\n\u003cp\u003e“I was. I sat with that thing for hours, getting nowhere, thinking about the numbers and the symbols, about what they could mean, rolling them around in my head, and finally, all of a sudden, the words began to clear. I was so startled I looked around to make sure I wasn’t dreaming and caught a glimpse of my reflection. My eyes were silver.”\u003c/p\u003e\n\u003cp\u003e“Silver?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Like mirrors.”\u003c/p\u003e\n\u003cp\u003eMirrors. Interesting. “If eyes are the windows to the soul, I guess they can be mirrors, too.” I paused. “What was the catalyst, do you think?”\u003c/p\u003e\n\u003cp\u003e“Maybe my utter absorption with it. We are what we eat, right? My brain was definitely eating that journal.”\u003c/p\u003e\n\u003cp\u003e“What were you able to read?”\u003c/p\u003e\n\u003cp\u003e“A passage about some slayers having gifts others do not, like the visions, and your ability to see the Blood Lines.”\u003c/p\u003e\n\u003cp\u003eYes, I’d read that part, too.\u003c/p\u003e\n\u003cp\u003e“Then there was a section about dying to really live, and the fact that you need fire to burn the toxin out of you.” He arms tightened around me. “I know you tried that on yourself, but I’m thinking your fire was already compromised. Either that or Zombie Ali is as immune to your fire and toxin as you’re becoming to the antidote.”\u003c/p\u003e\n\u003cp\u003eThat one, I thought. That second one. That was the answer. “I wonder what will happen if you use your fire on me.”\u003c/p\u003e\n\u003cp\u003e“I’ve thought about that, and I’m not willing to risk it. What if it kills you? Ashes you? I would never forgive myself.”\u003c/p\u003e\n\u003cp\u003eWhat if Z.A. died, and I lived? “Just...don’t take it off the table, okay?”\u003c/p\u003e\n\u003cp\u003eHe sighed. “All right, but it’ll be a last resort. It’s risky, and I’m not happy with the idea of risking you.”\u003c/p\u003e\n\u003cp\u003e“Great risk comes with great reward.”\u003c/p\u003e\n\u003cp\u003e“Yo, Muhammad Ali,” a female voice said before he could reply.\u003c/p\u003e\n\u003cp\u003eI peeked up from my position against Cole’s chest and watched as Trina, Mackenzie and Lucas approached the side of my bed.\u003c/p\u003e\n\u003cp\u003eTrina said, “You got yourself and three wimps out of Anima. I’m not sure I’ve ever been prouder of you.”\u003c/p\u003e\n\u003cp\u003e“Hey,” Kat huffed.\u003c/p\u003e\n\u003cp\u003e“Yeah! Who are you calling a wimp?” Reeve demanded.\u003c/p\u003e\n\u003cp\u003e“I believe she was talking about you,” Bronx said.\u003c/p\u003e\n\u003cp\u003eHe was here? I looked over and found him seated beside Reeve’s bed, and the two were...oh, glory...the two were holding hands. Openly. Unashamedly.\u003c/p\u003e\n\u003cp\u003eHappily.\u003c/p\u003e\n\u003cp\u003eMr. Ankh must have relented.\u003c/p\u003e\n\u003cp\u003e“Ali Bell doesn’t play hide-and-seek,” Lucas said. “She plays hide-and-pray-I-don’t-find-you.”\u003c/p\u003e\n\u003cp\u003eMackenzie smiled. “When Ali Bell gives you the finger, she’s telling you how many seconds you have to live.”\u003c/p\u003e\n\u003cp\u003eCole chuckled, saying, “Fear of spiders is arachnophobia, and fear of tight spaces is claustrophobia, but fear of Ali Bell is just called logic.”\u003c/p\u003e\n\u003cp\u003e“Oh, oh.” Kat clapped excitedly. “There used to be a street named after Ali Bell, but it was changed because nobody crosses Ali Bell and lives. True story.”\u003c/p\u003e\n\u003cp\u003eI snorted.\u003c/p\u003e\n\u003cp\u003e“I heard Ali Bell once got bitten by a rattlesnake,” Lucas said, deadpan, “but after three days of pain and agony, the rattlesnake died.”\u003c/p\u003e\n\u003cp\u003e“Well, I heard that when Ali Bell wants to laugh,” Reeve exclaimed, “she reads the Guinness Book of World Records.”\u003c/p\u003e\n\u003cp\u003eGiggles spilled out of me, but they quickly turned to coughs. I wasn’t sure how many minutes passed before the hacking stopped. I only knew I’d spewed blood all over my hands. Awkward.\u003c/p\u003e\n\u003cp\u003e“Ankh told me this might happen,” Cole said. “The zombie toxin and the antizombie toxin you produce are going head-to-head.”\u003c/p\u003e\n\u003cp\u003eTrina tossed me a rag.\u003c/p\u003e\n\u003cp\u003e“Thanks.” As Cole cleaned me up, he kicked her, Mackenzie and Lucas out of the room. “You, too,” he said to Frosty and Bronx.\u003c/p\u003e\n\u003cp\u003e“Sorry, bro,” Frosty replied, sounding anything but apologetic. “I’m not leaving Kat.”\u003c/p\u003e\n\u003cp\u003eBronx gave him the finger. “And yes, I’m telling you how long you’ve got to live if you try and make me go.”\u003c/p\u003e\n\u003cp\u003eCole opened his mouth to protest. I knew he wanted to limit the scope of my embarrassment, and I fell a little deeper under his spell.\u003c/p\u003e\n\u003cp\u003e“They can stay,” I said. How could I deprive my friends of their boyfriends? I’d hate anyone who tried to take mine away.\u003c/p\u003e\n\u003cp\u003eCole rested his chin on the top of my head, petted my hair. “Okay. For you.”\u003c/p\u003e\n\u003cp\u003eBronx leaned forward in his seat and buried his face in his hands. “I don’t think I’ll ever leave your side again. You were so close to death, Reeve, and there was nothing I would have been able to do to stop it from happening.”\u003c/p\u003e\n\u003cp\u003eReeve traced her fingers over the shell of his ear. “I survived. We all survived.”\u003c/p\u003e\n\u003cp\u003eThe way he looked up and stared at her caused the air in the room to crackle with awareness.\u003c/p\u003e\n\u003cp\u003eIt was the same stare Cole often gave me. Needy. Confused. Resolute. A little savage.\u003c/p\u003e\n\u003cp\u003e“We have to bring Anima down,” Cole said, determined and cold. “We can’t allow such a threat to remain.”\u003c/p\u003e\n\u003cp\u003e“What are we going to do?” I asked.\u003c/p\u003e\n\u003cp\u003eA pause as the three boys shared a look fraught with promise.\u003c/p\u003e\n\u003cp\u003e“Go to war,” Cole said.\u003c/p\u003e\n\u003cp\u003eChapter 27\u003c/p\u003e\n\u003cp\u003eBlood Bath and Beyond\u003c/p\u003e\n\u003cp\u003eThe boys lived up to their promise.\u003c/p\u003e\n\u003cp\u003eA few days later, after I’d gotten caught up on my schoolwork, a grinning Cole strode into the bedroom. It was Tuesday afternoon, and Kat and Reeve were in class. Nana was downstairs making cookies.\u003c/p\u003e\n\u003cp\u003eShe hadn’t wanted to leave my side, but she’d started to cry every time she’d looked at me, and her worry had pricked at the darkness writhing and frothing at the back of my mind, banging at the barely standing barriers.\u003c/p\u003e\n\u003cp\u003eI’d told her I had a craving for something sweet.\u003c/p\u003e\n\u003cp\u003eCole leaned down and kissed my forehead, his lips soft and perfect. I wished I’d had the energy to fix my hair and slap on a thousand pounds of makeup.\u003c/p\u003e\n\u003cp\u003eMaybe it was a good thing all the mirrors had been removed from the room.\u003c/p\u003e\n\u003cp\u003e“You should be at school,” I said.\u003c/p\u003e\n\u003cp\u003eHis grin only widened. “School shmool. I’ve got a surprise for you.” He swept me into his arms and carried me through the house...then down the stairs and into the basement.\u003c/p\u003e\n\u003cp\u003eI sniffed, expecting to smell rot. There was a good chance he had a zombie down here. But no. I smelled copper. Dried blood. I frowned. Then I heard the rattle of bars.\u003c/p\u003e\n\u003cp\u003eFrosty, Gavin and Bronx formed a wall of menace in front of one of the cages, and Cole shouldered his way past them to give me a front-row look at—\u003c/p\u003e\n\u003cp\u003eEthan.\u003c/p\u003e\n\u003cp\u003eIf I had been standing, I would have fallen from the shock.\u003c/p\u003e\n\u003cp\u003eOne of his eyes was swollen, and there were several cuts on his bottom lip. Someone—or four someones—had beaten the crap out of him.\u003c/p\u003e\n\u003cp\u003eGavin winked at me. “We did good, yeah?”\u003c/p\u003e\n\u003cp\u003eFrosty cracked his battered knuckles. “Hunting him down was easy. Taking him captive was easier. Still. You’re welcome, world. Now, who wants to watch me get a little information out of this douche purse?”\u003c/p\u003e\n\u003cp\u003eI would never live that down.\u003c/p\u003e\n\u003cp\u003e“You didn’t capture me,” Ethan spat. “I gave myself up.”\u003c/p\u003e\n\u003cp\u003e“Sure you did,” Bronx said. “After we pounded your face into the dirt.”\u003c/p\u003e\n\u003cp\u003eEthan shook his head. “Just listen. The same way my father got the zombies to enter people’s homes, he’s sending the zombies to Cole Holland’s barn tonight.” He drew in a breath. “My father captures and collars the creatures, and lets some of them go. The collars have GPS, and he’s able to monitor their whereabouts. Then, through electrical impulses, he’s able to lead the zombies to where he wants them to go.”\u003c/p\u003e\n\u003cp\u003eRemote control zombies. Nice.\u003c/p\u003e\n\u003cp\u003e“If that’s true, why haven’t the zombies entered any other houses?” Cole demanded.\u003c/p\u003e\n\u003cp\u003e“The night they entered the houses was a test to see if it would work. Tonight isn’t a test. My father wants Ali back. He thinks she’s the key to saving my sister. Izzy only has a few more months to live—if she’s lucky.”\u003c/p\u003e\n\u003cp\u003e“Which gives you motive to pretend to help us,” Cole said.\u003c/p\u003e\n\u003cp\u003eEthan shook his head, sad. “Believe me. I learned my lesson. I can’t save someone I love by hurting someone else I love.”\u003c/p\u003e\n\u003cp\u003eLike Cole, I remained suspicious.\u003c/p\u003e\n\u003cp\u003eCole returned me to the bedroom and tucked me back into bed.\u003c/p\u003e\n\u003cp\u003e“What are we going to do about the supposed zombie attack?” I asked.\u003c/p\u003e\n\u003cp\u003eHis knuckles ghosted along the curve of my cheek. “I’ll plan my own attack. Meanwhile, you’ll rest and regain your strength.”\u003c/p\u003e\n\u003cp\u003eTranslation: I wasn’t to be involved.\u003c/p\u003e\n\u003cp\u003e“I have to go,” he said. “But I’ll come back after... I’ll come back.”\u003c/p\u003e\n\u003cp\u003eThen he was gone. And I was alone.\u003c/p\u003e\n\u003cp\u003eI didn’t worry about the outcome of the coming battle.\u003c/p\u003e\n\u003cp\u003eI drafted a new to-do list.\u003c/p\u003e\n\u003cp\u003eOnly one item: don’t let my friends go into the danger zone without me.\u003c/p\u003e\n\u003cp\u003eWhen I was at my best, I was an asset. I could be at my best again, if only for a little while. So, when Nana came in with cookies and milk, I thanked her and kissed her and sent her on another errand. I told her Mr. Ankh was at work (finally), and his PMS—personal male secretary—wasn’t here to guard the office, then asked if she would grab the bag filled with vials of antidote.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t mind, I assured her. And I needed it.\u003c/p\u003e\n\u003cp\u003eShe didn’t understand I was developing an immunity to it, and the more antidote I used, the faster that immunity would build, so she found nothing suspicious about the request. To her, it was medicine, and I was entitled to medicine.\u003c/p\u003e\n\u003cp\u003e“Found it,” Nana said as she strolled inside the room. She lifted the black medical bag for my perusal before setting it beside me on the bed. She was smiling, always smiling. Until she looked at me. \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-59.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
