{"id":108983,"no":60,"title":"Page 60","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNowadays, no one but Cole smiled when they looked at me.\u003c/p\u003e\n\u003cp\u003e“You’re the best, Nana.”\u003c/p\u003e\n\u003cp\u003e“Of course I am. I’m partly responsible for your creation.” Tapping a fingertip against my wrist, she said, “Ali, darling, when were you going to tell me about your tattoos?”\u003c/p\u003e\n\u003cp\u003eUh-oh. “Are you mad?” I asked softly.\u003c/p\u003e\n\u003cp\u003e“No, but you’re a minor and I would have liked to be a part of the decision.”\u003c/p\u003e\n\u003cp\u003e“Well.” If I survived the coming events, and I would...confidence matters...I might as well warn her about tattoos three and four. “I would like to get two more.”\u003c/p\u003e\n\u003cp\u003e“What? And why?”\u003c/p\u003e\n\u003cp\u003eI explained about the slayers, and the memorials they had etched on their bodies, and her expression softened. I told her how badly I wanted to honor Pops, but left the details of the fourth tattoo vague. It had to do with Cole...\u003c/p\u003e\n\u003cp\u003e“All right,” she said with a sigh. “I give my permission. But next time, I’m going with you. Now, should I inject you with the medicine? I’ve never used a needle before, but I’ve watched a lot of TV, so I’m just sure I’ll do it right.”\u003c/p\u003e\n\u003cp\u003e“Sure, just—” My gaze had locked on her neck...on her pulse, glowing so prettily, beating so softly, wafting the sweetest scent to my nose.\u003c/p\u003e\n\u003cp\u003eShuddering, I closed my eyes. When it came to the protection of the people I loved, I was stronger than I’d ever realized. But right now I wasn’t going to take any chances.\u003c/p\u003e\n\u003cp\u003e“Are you all right, dear?” she asked, flattening her hand over my brow. “You do feel warm.”\u003c/p\u003e\n\u003cp\u003eI hissed at the moment of contact.\u003c/p\u003e\n\u003cp\u003eBite her, Z.A. whispered.\u003c/p\u003e\n\u003cp\u003e“I’ll be fine, don’t worry. Just... Nana, I love you so much, but I need to be alone right now. I’m going to inject myself, okay?”\u003c/p\u003e\n\u003cp\u003e“I love you, too,” she said, but I heard the hurt in her tone. “And I’ll give you your privacy, but please don’t shut me out.” She kissed my cheek before striding from the room.\u003c/p\u003e\n\u003cp\u003eMy hand shook as I dug through the bag, withdrawing one, three, six specially marked syringes. The ones with the antiallergy antidote. I stuck myself in the arm, again and again, and felt the familiar warm tide. Z.A. screeched, then quieted. The urge to bite and feed left me. And, with the massive amount of the dose, Z.A. was no longer able to feed off me, and energy returned to my body. The trembling faded from my limbs.\u003c/p\u003e\n\u003cp\u003eTesting my range of motion, I threw my legs over the side of the bed and stood. I remained steady, my knees rock-solid. I stretched my arms over my head, then twisted from the left to the right. No pain. No weakness.\u003c/p\u003e\n\u003cp\u003eIt had worked.\u003c/p\u003e\n\u003cp\u003eFor the past few days, I’d had to suffer through the humiliation of Nana’s sponge baths. Once, when I had been whining about my desire for a shower, Cole had picked me up and carried me into the stall. He’d gotten in with me, holding me up, and we’d washed with our undergarments on.\u003c/p\u003e\n\u003cp\u003eAll I could say about that: if I’d been well, I wouldn’t be a virgin.\u003c/p\u003e\n\u003cp\u003eToday, though, I showered on my own. After drying off, I dressed in my fighting clothes. Long-sleeve black top, camo pants and combat boots. My weapons had been moved into Reeve’s room with me, more for my peace of mind than anything, and I loaded up with daggers and throwing stars.\u003c/p\u003e\n\u003cp\u003eThere was a mirror in the hall, and I meant to bypass it, I did, but I found myself stopping and peering into the glass. I saw...me. Just me. My face a little too thin for my liking, and there were bruises under my eyes, cracks in my lips, but my color was good, rosy, all health and no sickness.\u003c/p\u003e\n\u003cp\u003eI found Nana in the kitchen, cleaning up the mess she’d made while baking the cookies.\u003c/p\u003e\n\u003cp\u003e“Ali!” she exclaimed, running over and throwing her arms around me. “You look... Wow! The medicine worked.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” I took a moment to absorb her love and warmth, basking in the sense of home. “Now, I need to borrow your car.”\u003c/p\u003e\n\u003cp\u003eShe pulled back, frowned. “My car?”\u003c/p\u003e\n\u003cp\u003e“I’ll be careful with it, I promise.”\u003c/p\u003e\n\u003cp\u003e“I know you will, but you’ve never shown an interest in driving before. And I know you’ve had a few lessons, but you still only have your permit, and—”\u003c/p\u003e\n\u003cp\u003eI cupped her cheeks. “Trust me, Nana. I need to do this.” It was time. A girl on her way to war had no room for fear. I wasn’t going to tolerate this one anymore.\u003c/p\u003e\n\u003cp\u003e“I can drive you anywhere—”\u003c/p\u003e\n\u003cp\u003e“Please, Nana. Please. I’m not shutting you out. I just want to prove to myself that I can do this.” I needed to start this new journey with a victory.\u003c/p\u003e\n\u003cp\u003e“All right.” She nodded. “I’ll get the keys.”\u003c/p\u003e\n\u003cp\u003ePerspiration dotted my brow, and I struggled to draw air past the lump growing in my throat. On the wheel, my knuckles were bleached of color. Cars zoomed past me, and horns blared.\u003c/p\u003e\n\u003cp\u003eSomeone gave me the finger.\u003c/p\u003e\n\u003cp\u003eWhat was the problem? I was only going ten miles an hour under the speed limit. If ten was the new word for twenty. And twenty was the new word for thirty. Whatever. I was motoring forward, and that should be good enough.\u003c/p\u003e\n\u003cp\u003eI managed to double the usual fifteen-minute drive before reaching Cole’s barn—and miracle of miracles, I didn’t crash. Several other vehicles were parked in the gravel driveway, so I knew a handful of slayers were already here, preparing for the night’s activities.\u003c/p\u003e\n\u003cp\u003eAs I stalked to the door, I glanced at the sky and found a rabbit-shaped cloud directly overhead.\u003c/p\u003e\n\u003cp\u003eEmma was still looking out for me.\u003c/p\u003e\n\u003cp\u003eI smiled as I entered the building. Cole, Frosty, Gavin and Veronica were bent over a table, talking, probably planning as they looked over a stack of papers.\u003c/p\u003e\n\u003cp\u003eI took a moment to enjoy the utter normalcy of the moment. The savage beauty of Cole. The bond between the four. The determination they radiated.\u003c/p\u003e\n\u003cp\u003eAnima should run and hide.\u003c/p\u003e\n\u003cp\u003e“Ali,” Veronica gasped out.\u003c/p\u003e\n\u003cp\u003eAll eyes lasered straight to me. I cared only about Cole, and—\u003c/p\u003e\n\u003cp\u003e—he had me draped over his shoulder. Blood dripped from both of us, and I couldn’t tell if it belonged to us or someone else. I was panting, struggling to free myself from his hold.\u003c/p\u003e\n\u003cp\u003e“Let me go,” I demanded.\u003c/p\u003e\n\u003cp\u003e“Never again.”\u003c/p\u003e\n\u003cp\u003e“You keep saying that. What do you want with me—”\u003c/p\u003e\n\u003cp\u003e—as quickly as the vision had appeared, it vanished.\u003c/p\u003e\n\u003cp\u003eI blinked, shook my head. I’d asked Cole Holland...what do you want with me? As if he were a stranger?\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003e“What’d you see?” Gavin asked, and I looked to him—\u003c/p\u003e\n\u003cp\u003e—we stood in the middle of a night-darkened road. Zombie ash was piled at our feet, twirling into the air, dancing away, and Hazmats surrounded us.\u003c/p\u003e\n\u003cp\u003eKelly raised his mask. He was scowling. “Where is he? What have you done with him—”\u003c/p\u003e\n\u003cp\u003e“—this again,” I heard Veronica say, jerking me back into the present.\u003c/p\u003e\n\u003cp\u003eGavin scowled at her. “Next time, shut your mouth and let the vision finish. We saw tonight’s battle. At least, what I think is going to be tonight’s battle, and it wasn’t pretty.”\u003c/p\u003e\n\u003cp\u003eShe sputtered for a response.\u003c/p\u003e\n\u003cp\u003eCole closed the distance between us. “How?”\u003c/p\u003e\n\u003cp\u003eI knew what he was asking and I wanted to lie. “Antidote.” No lies. I jutted my chin. “What we saw—”\u003c/p\u003e\n\u003cp\u003e“I don’t know what it means, and I’m not going to try to guess. I’ve never been right before. What matters—you were told not to use the antidote unless absolutely necessary. Today, it wasn’t necessary.” His eyes narrowed, and he took my hand, tugging me into the locker room. I expected him to turn and lecture me the moment the door closed, shutting us inside, alone.\u003c/p\u003e\n\u003cp\u003eHe did turn.\u003c/p\u003e\n\u003cp\u003eBut he didn’t lecture.\u003c/p\u003e\n\u003cp\u003eHe meshed his lips onto mine, feeding me a bone-melting kiss I’d never forget. I responded immediately, wrapping myself around him, drawing him closer, drinking him in.\u003c/p\u003e\n\u003cp\u003eBacking me up, he pinned me against the wall and caged me in. His body enveloped me, pressing, rubbing, seeking. All the while his hands roamed, stopping to knead here and there and oh...glory. I shivered with the force of the pleasure.\u003c/p\u003e\n\u003cp\u003e“You feel so good,” he rasped. “Taste so good. You’re ready for me, right? You told me you were ready.”\u003c/p\u003e\n\u003cp\u003e“So ready.”\u003c/p\u003e\n\u003cp\u003e“We have to stop, though. We can’t do this here.”\u003c/p\u003e\n\u003cp\u003eWhimper. “I know.”\u003c/p\u003e\n\u003cp\u003ePanting, we broke apart.\u003c/p\u003e\n\u003cp\u003eA hard knock sounded at the door. “Cole,” Frosty called. “Your dad just walked in.”\u003c/p\u003e\n\u003cp\u003eCole pressed his forehead into mine. “We’ll be out in a sec.”\u003c/p\u003e\n\u003cp\u003eMurmuring. Fading footsteps.\u003c/p\u003e\n\u003cp\u003e“One day,” he said to me, “we’re taking off, just the two of us.”\u003c/p\u003e\n\u003cp\u003eOne day. I wanted that—wanted a future.\u003c/p\u003e\n\u003cp\u003eCole’s eyes narrowed. “What you did was stupid, Ali.”\u003c/p\u003e\n\u003cp\u003e“Sometimes the wisest decision seems like the most foolish.”\u003c/p\u003e\n\u003cp\u003e“I should spank you.”\u003c/p\u003e\n\u003cp\u003e“Try. Please.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “You thinking you’ll end up spanking me?”\u003c/p\u003e\n\u003cp\u003e“Knowing it.”\u003c/p\u003e\n\u003cp\u003eBefore I realized what was happening, he was spinning me around and smacking me on the butt. “Come on. You can help us figure out the best course of action for tonight. In the morning, we’ll talk about our latest vision...and what you did with the antidote. And more about you being ready for me.”\u003c/p\u003e\n\u003cp\u003eI heard the husky promise in his voice. “Cole,” I began.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Later.”\u003c/p\u003e\n\u003cp\u003eYeah. That was probably for the best. I nodded.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eGame...Set...Death Match\u003c/p\u003e\n\u003cp\u003eThe rest of the slayers arrived at different times throughout the day, and all of them had the same reaction upon spotting me. Absolute, utter shock. I was hugged. I was patted on top of the head. I was met with sad little smiles because everyone knew the situation wouldn’t last.\u003c/p\u003e\n\u003cp\u003eTook us a few hours, but we all finally agreed on a plan of attack.\u003c/p\u003e\n\u003cp\u003eI kinda felt sorry for the Hazmats.\u003c/p\u003e\n\u003cp\u003eWhen the sun began to set, Cole gave me a quick kiss and took his place among the chairs lining the far wall. “You see a zombie,” he said, “you light up and start ashing. Don’t waste your energy trying to fight. That’s what we’re here to do.” \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-60.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
