{"id":108988,"no":65,"title":"Page 65","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I need another dose.”\u003c/p\u003e\n\u003cp\u003eThe frown intensified. “But you had one only half an hour ago.”\u003c/p\u003e\n\u003cp\u003e“I know.” A sickening heat swept over me, causing me to both sweat and shiver. A sensation I knew well. Only this one was far more intense. A strange buzz replaced the noise in the room. “I...I...” I backed away from him, shaking my head. “It’s worse this time.”\u003c/p\u003e\n\u003cp\u003e“Ali?” Kat reached out to grab me, only to shriek in pain and jerk back.\u003c/p\u003e\n\u003cp\u003eFrosty jumped up and threw her behind him.\u003c/p\u003e\n\u003cp\u003eCole jumped to his feet, as well. I glanced down. The red flames had returned, crackling over my hands. My human hands. The fire was so strong it had breached my spirit and seeped out of my flesh. As I fought to douse it, the blaze spread.\u003c/p\u003e\n\u003cp\u003eEveryone but Cole scrambled away from me. “Ali,” he said, approaching.\u003c/p\u003e\n\u003cp\u003e“Don’t touch me,” I croaked. “I’m going to walk out of here, and give myself a final dose. Then someone is going to use their flames on me. Please.”\u003c/p\u003e\n\u003cp\u003eHe violently shook his head. “They’d have to get through me, and that’s not happening.”\u003c/p\u003e\n\u003cp\u003eZ.A. whispered inside my head. You think you could have lasted this long if I hadn’t let you? I’ve been waiting for this moment, when the antidote would no longer help you. So go ahead. Dose yourself again. See what happens.\u003c/p\u003e\n\u003cp\u003eI watched in horror as the flames spread even farther, to my elbows. And it hurt. Oh, it hurt. Pain shot through me, undeniable, agony in its purest form. “Have to...go,” I panted. “Go. Everyone.”\u003c/p\u003e\n\u003cp\u003eNot heeding my command, Cole picked me up. I was careful to keep my hands pressed against my middle, away from him, and my ankles straight out. He stopped at the table piled with food and drinks and anchored me against his chest to sweep everything to the floor. Then he gently laid me down.\u003c/p\u003e\n\u003cp\u003eI heard the gurgle of spilling liquid as he peered at me.\u003c/p\u003e\n\u003cp\u003e“Fight it,” he commanded.\u003c/p\u003e\n\u003cp\u003eThe flames spread to my shoulders. “Trying.”\u003c/p\u003e\n\u003cp\u003e“Try harder.”\u003c/p\u003e\n\u003cp\u003eThe rest of the slayers surrounded me. I saw pity. I saw fear. I saw dread.\u003c/p\u003e\n\u003cp\u003eThey hadn’t left. They needed to leave.\u003c/p\u003e\n\u003cp\u003eYou’re going to die, and I’m going to rise.\u003c/p\u003e\n\u003cp\u003e“Don’t let her live,” I said. “Kill her. Kill her through me.”\u003c/p\u003e\n\u003cp\u003eImpossible now, she gloated. I’m going to feast on him. Empty him.\u003c/p\u003e\n\u003cp\u003e“No,” he said, his voice breaking at the end. “Anything but that.”\u003c/p\u003e\n\u003cp\u003e“Cole, have to...kill her...please.” She wouldn’t stop with him. She would destroy everyone. ”She’s here... Wants you.”\u003c/p\u003e\n\u003cp\u003e“No,” he insisted. “There has to be another way.”\u003c/p\u003e\n\u003cp\u003eTears fell down my cheeks, and even those burned. “Please,” I begged. “Hurt. I hurt. The pain. Too much.” And like the flames, it was only growing stronger.\u003c/p\u003e\n\u003cp\u003e“You’ll just have to bear it, because I can’t bear to lose you. If you die, I’ll go with you.”\u003c/p\u003e\n\u003cp\u003e“No,” I shouted, and I think the other slayers did the same.\u003c/p\u003e\n\u003cp\u003e“Fight, then,” he demanded. “With everything you’ve got, fight.”\u003c/p\u003e\n\u003cp\u003eDidn’t he understand? That was what I’d been doing.\u003c/p\u003e\n\u003cp\u003eI tried to scoot away from him, my gaze scanning the faces of those around me. “Help.”\u003c/p\u003e\n\u003cp\u003e“I survived it,” Gavin rushed out. “She accidentally touched me with her flames, and I survived. The zombies had bitten me, and she had to give me the antidote, and she burned me. Afterward, I felt stronger than ever before.”\u003c/p\u003e\n\u003cp\u003eI’d already told him.\u003c/p\u003e\n\u003cp\u003eHe shook his head, giving Gavin the same denial he’d given me. “You didn’t have a full-grown zombie living inside you.”\u003c/p\u003e\n\u003cp\u003e“True, but if you do nothing, she dies anyway and we’ll have to battle her evil twin. A twin with powers of her own.”\u003c/p\u003e\n\u003cp\u003eCole scrubbed a hand down his face, clearly torn. “Ali touched Kelly with her flames, and he burst into ash.”\u003c/p\u003e\n\u003cp\u003e“She isn’t like Kelly.”\u003c/p\u003e\n\u003cp\u003e“Did you not hear me? There’s a zombie inside her. Right now she’s more like Kelly than like you.”\u003c/p\u003e\n\u003cp\u003e“I heard. Now hear me,” Gavin said, reaching out. “I’m going to do this for her whether you like it or not. I’m not just going to watch her die.”\u003c/p\u003e\n\u003cp\u003e“Wait.” Cole grabbed his wrist, stopping him. “Let me think.”\u003c/p\u003e\n\u003cp\u003e“You’ve been thinking. The time for action has come.” That said, Gavin used his free hand to punch him in the face.\u003c/p\u003e\n\u003cp\u003eCole stumbled backward, and Gavin moved closer to me, his spirit arm rising from his physical arm. A second later, he flattened firelit hands on my chest.\u003c/p\u003e\n\u003cp\u003eI screamed as I realized this was pain, not what I’d felt before.\u003c/p\u003e\n\u003cp\u003eThankfully it didn’t last long. The red flames burned him, and he hissed and jerked away.\u003c/p\u003e\n\u003cp\u003eCole shoved him. “You better pray she doesn’t—” His gaze landed on me and he jolted. “Ali, your color is better.” He reacted instantly. His spirit stepped out of his body. Eyes narrowed, he held out his hands, and white-gold flames lit over both, glowing brightly. He was shaking as he pressed his palm over my chest—inside my chest.\u003c/p\u003e\n\u003cp\u003eI released another scream.\u003c/p\u003e\n\u003cp\u003eNo! Z.A. shouted.\u003c/p\u003e\n\u003cp\u003eThe red intensified, and though Cole hissed from the pain of it, he didn’t back off.\u003c/p\u003e\n\u003cp\u003eLucas left his body, too, and jerked him away from me, shouting, “She might not mean to, but she’ll kill you, my man.”\u003c/p\u003e\n\u003cp\u003eCole fought him, throwing the boy backward. I sagged against the table, the red flames spreading faster, as if to compensate for what Cole had tried to do. Then Cole was once again beside me, once again touching me.\u003c/p\u003e\n\u003cp\u003eThe pain magnified a thousand degrees, shooting through me, eating at me, consuming me, and another scream burst free. My back arched, coming up off the table, all of my weight settling in my shoulders and toes. I’d shatter. Any second, I would shatter.\u003c/p\u003e\n\u003cp\u003eWhat if Cole died because of this?\u003c/p\u003e\n\u003cp\u003e“S-stop,” I managed. “Stop.”\u003c/p\u003e\n\u003cp\u003eHe snarled, but never severed contact.\u003c/p\u003e\n\u003cp\u003e“Cole!” Frosty yelled. “Stop this. We won’t let you do this.”\u003c/p\u003e\n\u003cp\u003e“Help me pull him away,” Bronx gritted.\u003c/p\u003e\n\u003cp\u003eMy skin felt as if it were snapping and popping and ripping away. The agony... Nothing compared to this. Now it was too much, too much, far too much. I wanted to die.\u003c/p\u003e\n\u003cp\u003e“The red is fading now,” I heard Gavin shout. “She’s healing. Help Cole. Light up and put your hands on her.”\u003c/p\u003e\n\u003cp\u003eI wasn’t sure how many seconds—minutes?—passed before everyone obeyed. I couldn’t see past the pain, but I eventually felt pressure on my ankles, knees, thighs, belly, arms and shoulders. A terrible heat filled me up and split me apart.\u003c/p\u003e\n\u003cp\u003eNo! Zombie Ali shrieked. No, make them stop, make them stop!\u003c/p\u003e\n\u003cp\u003eNo longer on...my to-do...list, I tried to tell her.\u003c/p\u003e\n\u003cp\u003eHer voice grew quiet, quieter...until it evaporated altogether.\u003c/p\u003e\n\u003cp\u003eAnd then the pain was...leaving?\u003c/p\u003e\n\u003cp\u003eYes, I realized a few seconds later. It was. The heat was becoming bearable, almost pleasant. I sagged against the table, finally able to breathe.\u003c/p\u003e\n\u003cp\u003eMy eyesight cleared, and I could see flames dancing all over me; they were no longer red, but gold, like they were supposed to be.\u003c/p\u003e\n\u003cp\u003eThe slayers had saved me.\u003c/p\u003e\n\u003cp\u003eTheir hands fell away from me. Someone held a mirror in front of my face, and I looked, seeing no sign of Z.A. Then the mirror was gone, and I was staring at Cole, marveling that I experienced only a desire to hug and kiss him, not to bite.\u003c/p\u003e\n\u003cp\u003eExcitement, relief and undiluted joy filled me, and I found the strength to lift my arms and encircle his neck. “Cole,” I sobbed.\u003c/p\u003e\n\u003cp\u003eHis hands shook as he brushed the hair from my face. “You’re still here. You’re still here!”\u003c/p\u003e\n\u003cp\u003eI was, and he was, though there were blisters all the way up his arm—blisters I had caused. “I’m so sorry I hurt you.”\u003c/p\u003e\n\u003cp\u003e“Don’t be. I’m not.”\u003c/p\u003e\n\u003cp\u003e“Well, don’t ever do anything like that again, do you hear me?”\u003c/p\u003e\n\u003cp\u003e“Don’t ever scare me like that again.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry.”\u003c/p\u003e\n\u003cp\u003eHe pressed a swift kiss into my mouth. “The light chased away the darkness.”\u003c/p\u003e\n\u003cp\u003eYes. I’d finally died to the evil and lived to the light.\u003c/p\u003e\n\u003cp\u003e“But your father. Your grandfather. Kelly. They ashed when you touched them with the flames.”\u003c/p\u003e\n\u003cp\u003eTrue. I’d put my glowing hands on all three men, and they’d ashed. “My dad and grandfather were fully zombie, with no humanity left. And Kelly had destroyed his own humanity with his actions. I was still fighting.” A thought occurred to me. “Have you ever put your hands on another slayer like that?”\u003c/p\u003e\n\u003cp\u003e“No. Never. We were too afraid we’d burn each other.”\u003c/p\u003e\n\u003cp\u003eI sat up, surprised to find there was no ensuing dizziness, no weakness. Just pure, unadulterated strength. Actually, I’d never felt better.\u003c/p\u003e\n\u003cp\u003eCheck off list: kill Z.A., survive.\u003c/p\u003e\n\u003cp\u003eI flexed my fingers, popped the bones in my neck. “There isn’t a trace of the zombie toxin,” I said, marveling. “I don’t need the antidote. I don’t need anything. I’m one hundred percent racer ready.”\u003c/p\u003e\n\u003cp\u003eHis violet gaze studied my face. “You look it. The bruises have fled. The chapped lips are gone. The gauntness has even left you.”\u003c/p\u003e\n\u003cp\u003eWe’d had the power to do this all along; we just hadn’t known it. Now I suspected none of us would ever need the antidote again. We wouldn’t have to worry about developing an immunity to it. We wouldn’t ever have to stop fighting the zombies. We could help each other. Strengthen each other.\u003c/p\u003e\n\u003cp\u003eSomeone would have to get bitten, and we would have to try this again to be sure, but deep down I knew I was right. Even Mr. Holland would be able to fight the zombies again.\u003c/p\u003e\n\u003cp\u003eKat shoved her way through the crowd, shoved Cole aside and threw her arms around me. “You’re healed!”\u003c/p\u003e\n\u003cp\u003eI hugged her back.\u003c/p\u003e\n\u003cp\u003eAnd there was Reeve, wrapping her arms around me, and then the three of us were jumping up and laughing. I wanted this for Kat, couldn’t stand the thought of losing her to kidney disease. What would the fire do to her, though? Would we kill her if we touched her, a nonslayer, with the flames? \u003c/p\u003e","sourceLink":"https://allnovel.net/through-the-zombie-glass-white-rabbit-chronicles-2/page-65.html","bookId":2521,"creation":"Oct 5, 2019 11:31:05 PM","modification":"Oct 5, 2019 11:31:05 PM"}
