{"id":78337,"no":37,"title":"Page 37","content":"\u003cp\u003e\"What have you been trying to tell me?\"\u003c/p\u003e\n\u003cp\u003e\"Victoria received letters and gifts from a secret admirer.\"\u003c/p\u003e\n\u003cp\u003eColin was taken aback by that reminder. Alesandra had tried to explain why she was worried about her friend and he hadn\u0027t let her. He should have listened, he realized now.\u003c/p\u003e\n\u003cp\u003e\"Who is Victoria?\" asked Caine.\u003c/p\u003e\n\u003cp\u003eAlesandra answered him. She explained how she\u0027d met Victoria. \"After she returned to England, she wrote to me at least once a month. I would immediately write back, of course, and I did love hearing from her. She had such an exciting life. In the last few letters, however, she mentioned an admirer who was sending her gifts. She thought it all very romantic. I received her last letter in early September.\"\u003c/p\u003e\n\u003cp\u003e\"And what did she say in that letter?\" Caine asked.\u003c/p\u003e\n\u003cp\u003e\"She had decided to meet the man,\" Alesandra answered. \"I was appalled, of course, and wrote back to her right away. I advised caution and suggested she take her brother with her if she was determined to find out who her admirer was.\"\u003c/p\u003e\n\u003cp\u003eAlesandra started to shiver. Colin instinctively hugged her. \"I don\u0027t know if Victoria received my letter or not. She might have already been gone by then.\"\u003c/p\u003e\n\u003cp\u003e\"Gone? Gone where?\" Jade asked.\u003c/p\u003e\n\u003cp\u003e\"It was reported Victoria ran off to Gretna Green,\" Colin explained. \"Alesandra doesn\u0027t believe that.\"\u003c/p\u003e\n\u003cp\u003e\"There isn\u0027t any record of a marriage,\" Alesandra countered.\u003c/p\u003e\n\u003cp\u003e\"What do you think happened to her?\"\u003c/p\u003e\n\u003cp\u003eNathan asked her that question, and until that moment she hadn\u0027t allowed herself to voice her true fear. She took a calming breath and turned her gaze to her husband\u0027s partner.\u003c/p\u003e\n\u003cp\u003e\"I think she was murdered.\"\u003c/p\u003e\n\u003cp\u003eHe paced the library in a rage. None of it was his fault. None of it. He had stopped. He\u0027d ignored the craving, hadn\u0027t given in to the urge. It wasn\u0027t his fault. No, it was the bastard who was responsible. He never would have killed again… he never would have given in to the urge.\u003c/p\u003e\n\u003cp\u003eRevenge. He would show him. He would get even. He would destroy him. He would begin by taking away everything he valued. He would make him suffer.\u003c/p\u003e\n\u003cp\u003eHe smiled in anticipation. He would start with the women.\u003c/p\u003e\n\u003cp\u003eChapter 13\u003c/p\u003e\n\u003cp\u003eThat statement got an immediate reaction. \"Good God,\" Caine whispered.\u003c/p\u003e\n\u003cp\u003e\"Could it be possible?\" Nathan asked.\u003c/p\u003e\n\u003cp\u003e\"I hadn\u0027t realized…\" Jade whispered that remark and placed her hand over her heart.\u003c/p\u003e\n\u003cp\u003eColin was the last to react and the most logical in his response. \"Explain why you believe this,\" he commanded.\u003c/p\u003e\n\u003cp\u003e\"Flannaghan, will you please go upstairs and fetch my list for me?\"\u003c/p\u003e\n\u003cp\u003e\"You have a list of reasons why you suspect your friend was murdered?\" Caine asked.\u003c/p\u003e\n\u003cp\u003e\"She has a list for everything.\"\u003c/p\u003e\n\u003cp\u003eColin made that remark but she was pleased that he didn\u0027t sound at all condescending.\u003c/p\u003e\n\u003cp\u003e\"Yes, I do have a list,\" Alesandra said. \"I wanted to organize my thoughts about Victoria\u0027s disappearance and try to come up with some sort of plan. I knew something was wrong as soon as I heard she\u0027d eloped. Victoria never would have done such a thing. Appearances were more important to her than love. Besides, I don\u0027t think she would have allowed herself to fall in love with someone she believed inferior to her station in life. She was sometimes a little shallow-headed and a bit of a snob as well, but those were her only faults. She was also very kindhearted.\"\u003c/p\u003e\n\u003cp\u003e\"He has to be someone in society,\" Nathan decided aloud.\u003c/p\u003e\n\u003cp\u003e\"Yes, I think so, too,\" Alesandra agreed. \"I also think this man begged her to meet him somewhere and that her curiosity led her to forget caution. She was certainly flattered by his attention.\"\u003c/p\u003e\n\u003cp\u003e\"She must have been terribly naive,\" Jade remarked.\u003c/p\u003e\n\u003cp\u003e\"So is Catherine.\"\u003c/p\u003e\n\u003cp\u003e\"Catherine? What does my sister have to do with this?\"\u003c/p\u003e\n\u003cp\u003e\"She made me promise not to tell, but her safety is at issue and I must break her confidence. She also received flowers this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, I need a brandy,\" Caine muttered.\u003c/p\u003e\n\u003cp\u003eFlannaghan returned to the salon just then. He handed a pile of papers to Colin to pass along to Alesandra. He\u0027d heard Caine\u0027s request and immediately announced he would fetch the brandy.\u003c/p\u003e\n\u003cp\u003e\"Bring the bottle,\" Caine ordered.\u003c/p\u003e\n\u003cp\u003e\"I hope to God we\u0027re all jumping to the wrong conclusion,\" Nathan said.\u003c/p\u003e\n\u003cp\u003e\"Better that we are,\" Caine countered. \"Three women in our family are being courted by the bastard. Think the worst and plan accordingly,\" he added with a hard nod.\u003c/p\u003e\n\u003cp\u003eColin was sorting through the stack of papers, looking for the list pertinent to their discussion. He was given pause when he saw his name at the top of one sheet.\u003c/p\u003e\n\u003cp\u003eAlesandra wasn\u0027t paying any attention to her husband now. Her gaze was centered on his brother.\u003c/p\u003e\n\u003cp\u003e\"Caine, you don\u0027t have sufficient information to assume there are only three,\" she explained. \"This man could have sent dozens of gifts to women all over London.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s right about that,\" Nathan agreed.\u003c/p\u003e\n\u003cp\u003eCaine shook his head. \"My gut feeling is that he\u0027s coming after one of ours.\"\u003c/p\u003e\n\u003cp\u003eColin had just finished reading Alesandra\u0027s list. It took everything he possessed not to show any reaction. His hand shook when he placed the paper on the bottom of the pile.\u003c/p\u003e\n\u003cp\u003eHe was going to become a father. He was so damn pleased he wanted to take Alesandra into his arms and kiss her.\u003c/p\u003e\n\u003cp\u003eAnd what a time to find out, he thought to himself. Colin wouldn\u0027t let her know he\u0027d read the list, of course. He would wait until she told him. He\u0027d give her until tonight, when they were in bed together…\u003c/p\u003e\n\u003cp\u003e\"Why are you smiling, Colin? It\u0027s a damn bizarre reaction to this topic,\" Caine told him.\u003c/p\u003e\n\u003cp\u003e\"I was thinking about something else.\"\u003c/p\u003e\n\u003cp\u003e\"Do pay attention,\" Alesandra requested.\u003c/p\u003e\n\u003cp\u003eColin turned to look at her. She saw the warm glint in his eyes and wondered what in heaven\u0027s name he\u0027d been thinking about to cause that reaction. Before she could ask him, he leaned down and kissed her.\u003c/p\u003e\n\u003cp\u003eIt was a quick, hard kiss that was over and done with before she could react.\u003c/p\u003e\n\u003cp\u003e\"For God\u0027s sake, Colin,\" Caine muttered.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re newly married,\" Alesandra blurted out, trying to find some excuse for her husband\u0027s display of affection.\u003c/p\u003e\n\u003cp\u003eFlannaghan came in with a tray loaded with goblets and a large decanter of brandy. He placed the tray on the table near Alesandra and leaned over to whisper close to her ear.\u003c/p\u003e\n\u003cp\u003e\"Cook\u0027s back.\"\u003c/p\u003e\n\u003cp\u003e\"Does she have news?\"\u003c/p\u003e\n\u003cp\u003eFlannaghan eagerly nodded. Caine poured himself a drink and downed it in one long swallow. Both Nathan and Colin declined the brandy.\u003c/p\u003e\n\u003cp\u003e\"May I have a drink, please?\" Alesandra asked. She didn\u0027t particularly like the taste of brandy but she thought the warm liquid might take some of the chill out of her. She was feeling queasy, too, and she was certain the distressing talk about murder was the cause.\u003c/p\u003e\n\u003cp\u003e\"Flannaghan, get Alesandra some water,\" Colin ordered.\u003c/p\u003e\n\u003cp\u003e\"I would rather have brandy,\" she countered.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eShe was clearly astonished by his emphatic denial. \"Why not?\" Colin didn\u0027t have a quick answer for her question. He wanted to tell her brandy probably wasn\u0027t good for her delicate condition. He couldn\u0027t, of course, because she hadn\u0027t told him about the baby yet.\u003c/p\u003e\n\u003cp\u003e\"Why are you smiling? I do declare, Colin, you\u0027re the most confusing man.\"\u003c/p\u003e\n\u003cp\u003eHe forced himself back to the matter at hand. \"I don\u0027t like you drinking,\" he announced.\u003c/p\u003e\n\u003cp\u003e\"I never drink.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right,\" Colin agreed. \"And you aren\u0027t going to start now.\"\u003c/p\u003e\n\u003cp\u003eFlannaghan tapped Alesandra on her shoulder, reminding her of his message.\u003c/p\u003e\n\u003cp\u003e\"Will you excuse me for a moment?\" she asked. She noticed her lists were in his hands then. \"What are you doing with those?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m holding them for you,\" he replied. \"Would you like me to look through them for the list you made concerning Victoria?\"\u003c/p\u003e\n\u003cp\u003e\"No, thank you,\" she replied. She took the papers, found Victoria\u0027s list second from the top, and then started to stand up. Colin shook his head at her and hauled her back.\u003c/p\u003e\n\u003cp\u003e\"You aren\u0027t going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"I must speak to Cook.\"\u003c/p\u003e\n\u003cp\u003e\"Flannaghan can answer her questions.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t understand,\" Alesandra said in a low whisper. \"She went on a little errand for me and I wanted to find out the results.\"\u003c/p\u003e\n\u003cp\u003e\"What errand?\" Colin asked.\u003c/p\u003e\n\u003cp\u003eShe debated answering him for a minute or two. \"You\u0027ll get angry,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"No, I won\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHer expression told him she didn\u0027t believe him.\u003c/p\u003e\n\u003cp\u003e\"Alesandra?\"\u003c/p\u003e\n\u003cp\u003eHe said her name in that warning tone of voice he was certain would make her wish to answer him with all possible haste, but when she smiled at him he knew she wasn\u0027t at all impressed.\u003c/p\u003e\n\u003cp\u003e\"Please tell me,\" he asked.\u003c/p\u003e\n\u003cp\u003eHe had asked, not ordered, and that made all the difference in her mind. She immediately answered him. \"I sent her to the Viscount of Talbolt\u0027s town house. Before you get upset over this, Colin, do remember you ordered me not to talk to the viscount. I adhered to your wishes.\"\u003c/p\u003e\n\u003cp\u003eHe was thoroughly confused. \"I still don\u0027t understand,\" he admitted.\u003c/p\u003e\n\u003cp\u003e\"I sent Cook to talk to Lady Roberta\u0027s staff. I wanted to find out if she\u0027d received any gifts before she disappeared. Husband, we both know she didn\u0027t run away from her husband. Such an excuse is unthinkable.\"\u003c/p\u003e\n\u003cp\u003e\"She did receive gifts,\" Flannaghan blurted out. \"The viscount pitched a tantrum, too. Staff believes Lady Roberta ran off with the suitor. The viscount isn\u0027t talking but his employees believe he thinks his wife ran off, too. The upstairs maid told Cook the viscount has turned to drink to ease his torment and stays locked up in his library day and night.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell is going on here?\" Caine asked. \"Could there be a connection between the two women?\"\u003c/p\u003e\n\u003cp\u003e\"They both disappeared,\" Jade reminded her husband. \"Isn\u0027t that connection enough?\"\u003c/p\u003e\n\u003cp\u003e\"That isn\u0027t what I meant, sweetheart.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe he\u0027s being random in his selection,\" Nathan suggested.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s always a motive,\" Colin argued.\u003c/p\u003e\n\u003cp\u003e\"Perhaps with the first one,\" Nathan agreed.\u003c/p\u003e\n\u003cp\u003eAlesandra was confused by that comment. \"Why a motive with the first and not the second?\"\u003c/p\u003e\n\u003cp\u003eNathan looked at Colin before answering. Colin nodded. \"There was probably a motive behind the first murder,\" Nathan explained. \"But then he got a taste for killing.\"\u003c/p\u003e\n\u003cp\u003e\"Some do,\" Caine admitted.\u003c/p\u003e\n\u003cp\u003e\"Dear God,\" Jade whispered. She visibly shivered. Caine immediately got up and went over to his wife. He pulled her out of the chair, sat down, and then settled her on his lap. She leaned against him.\u003c/p\u003e\n\u003cp\u003e\"Do you mean to tell me he likes killing?\" Alesandra asked.\u003c/p\u003e\n\u003cp\u003e\"Could be,\" Nathan answered.\u003c/p\u003e\n\u003cp\u003eAlesandra\u0027s stomach turned queasy again. She leaned closer into her husband\u0027s side in an attempt to gain more of his warmth. She felt safe when she was near him—comforted, too. That was what love was all about, she thought to herself.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to have to get a lot more information,\" Caine announced.\u003c/p\u003e\n\u003cp\u003e\"I tried to talk to Victoria\u0027s brother, but he wasn\u0027t at all helpful,\" Alesandra said.\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be helpful when I talk to him,\" Colin snapped.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine why he would cooperate,\" Alesandra replied. \"You threw him out on the pavement the last time you spoke to him.\"\u003c/p\u003e\n\u003cp\u003e\"What about asking Richards for some help?\" Nathan suggested.\u003c/p\u003e\n\u003cp\u003eAlesandra closed her eyes and listened to the discussion. Colin was rubbing her arm in an absentminded fashion. His touch was wonderfully soothing. The men\u0027s voices were low and while they formulated their plans of action, she thought about how nice it was to finally have her husband\u0027s cooperation. She knew he would find out what happened to Victoria… and why. She didn\u0027t have any doubts about Colin\u0027s ability to find the culprit, because she was certain she was married to the most intelligent man in all of England. He was probably the most stubborn, too, but that flaw would come in handy now. He wouldn\u0027t quit until he had his answers.\u003c/p\u003e\n\u003cp\u003e\"What the hell else do we do?\" Caine asked.\u003c/p\u003e\n\u003cp\u003eAlesandra looked down at her list before she answered him. \"You find out who profited from Victoria\u0027s death. Colin, you could find out if any policies were taken out. Dreyson would be happy to help you.\"\u003c/p\u003e\n\u003cp\u003eAll three men smiled in unison. \"I thought you were asleep,\" Colin remarked.\u003c/p\u003e\n\u003cp\u003eShe ignored that comment. \"You should also consider all the other motives… in the general sense,\" she explained. \"Jealousy and rejection are two motives. Neil mentioned his sister had turned down several proposals. Perhaps one of those men didn\u0027t like being told no.\"\u003c/p\u003e\n\u003cp\u003eIt occurred to Jade that Alesandra was actually very astute. Colin was grinning, suggesting to Jade that he was also aware of his wife\u0027s cleverness, but Nathan and Caine hadn\u0027t realized it yet.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course, we\u0027ll look into every possible motive,\" Caine said. \"I just wish we had a clue or two.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, but you do,\" Alesandra replied. \"The fact that three women in your family have received gifts is clue enough, Caine. It occurs to me that one of you men or one of us women has offended the man.\"\u003c/p\u003e\n\u003cp\u003eColin nodded. \"That thought had already occurred to me,\" he said. \"He\u0027s getting careless.\"\u003c/p\u003e\n\u003cp\u003e\"Or more bold,\" Nathan interjected.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t everyone forgetting one important fact?\" Jade asked.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Caine asked his wife.\u003c/p\u003e\n\u003cp\u003e\"There aren\u0027t any bodies. We really could be jumping in the wrong direction.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think we are?\" Alesandra asked.\u003c/p\u003e\n\u003cp\u003eJade thought about it a long minute, then whispered, \"No.\"\u003c/p\u003e\n\u003cp\u003eColin took charge then. He gave everyone but Alesandra an assignment. He told Jade to talk to as many of the ladies of the ton as possible to find out if anyone else had received a gift. He warned her not to tell the women about the gifts she, Catherine, and Alesandra had received because some of the more foolish women might think this was all some sort of competitive game.\u003c/p\u003e\n\u003cp\u003eNathan was given the duty of taking over the offices while Colin concentrated on finding answers.\u003c/p\u003e\n\u003cp\u003e\"Caine, Alesandra\u0027s right. Neil won\u0027t talk to me. You\u0027ll have to deal with him.\"\u003c/p\u003e\n\u003cp\u003e\"I will,\" Caine agreed. \"I should also talk to Talbolt,\" he added. \"We went to Oxford together and he might be more receptive to hearing me out.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/castles-crown-s-spies-4/page-37.html","bookId":1789,"creation":"Oct 5, 2019 4:08:33 PM","modification":"Oct 5, 2019 4:08:33 PM"}
