{"id":84605,"no":39,"title":"Page 39","content":"\u003cp\u003eAs soon as I walk through the door, two girls giggle and a whole group of juniors goes totally gape-jawed. I don’t blame them. I know I must look like shit. Before leaving the house, I didn’t even bother to change out of my lounge pants—a pair of way oversized velour sweats my mom gave me back when they were still in.\u003c/p\u003e\n\u003cp\u003eI don’t waste any time on the juniors, though. I’m already worried I may have arrived too late.\u003c/p\u003e\n\u003cp\u003eTara is coming down the stairs as I’m pushing my way up, and I grab her, leaning into her ear. “Juliet Sykes!” I have to yell it.\u003c/p\u003e\n\u003cp\u003e“What?” she yells back, smiling.\u003c/p\u003e\n\u003cp\u003e“Juliet Sykes! Is she here?”\u003c/p\u003e\n\u003cp\u003eTara taps her ear to show she can’t hear me. “You’re looking for Lindsay?”\u003c/p\u003e\n\u003cp\u003eCourtney is behind Tara and leans forward, flopping her chin on Tara’s shoulder. “We found the secret stash—rum and stuff. Tara broke a vase.” She giggles. “You want some?”\u003c/p\u003e\n\u003cp\u003eI shake my head. I’ve never been this sober around people this wasted, and I say a brief prayer that I’m not half as annoying as they are when I’m drunk. I continue up the stairs as Tara yells, “Lindsay’s in the back.”\u003c/p\u003e\n\u003cp\u003eBefore I’m totally out of earshot I hear Courtney shriek, “Did you see what she’s wearing?”\u003c/p\u003e\n\u003cp\u003eI take a deep breath and tell myself it doesn’t matter. What matters is finding Juliet. I can at least do that one thing.\u003c/p\u003e\n\u003cp\u003eBut with every step I’m losing hope. The upstairs hallway is totally packed, and unless she hasn’t come to the party at all—which seems like too much to hope—it seems unlikely that she hasn’t already left.\u003c/p\u003e\n\u003cp\u003eStill, I push on, finally making it to the very back room. Lindsay catapults on me as soon as I get into the room—she actually leaps over five people—and for a second I’m so grateful to see her, happy and drunk and my best friend, and to get treated to one of her famous super-squish hugs, that I forget why I’m here.\u003c/p\u003e\n\u003cp\u003e“Bad girl.” She slaps my hand as she pulls away. “You cut school but come out to party? Naughty, naughty.”\u003c/p\u003e\n\u003cp\u003e“I’m looking for someone,” I say. I scan the room: Juliet’s not here. Not that I expected her to be, I don’t know, sitting on the couch and chatting it up with Jake Somers, but it’s instinct—and wishful thinking—to look.\u003c/p\u003e\n\u003cp\u003e“Rob’s downstairs.” Lindsay steps back and holds up her hand, framing me in the angle between her thumb and forefinger. “You look like the homeless man who stole Wal-Mart. Are you trying not to get laid or something?”\u003c/p\u003e\n\u003cp\u003eIrritation flares up again. Lindsay, who always has something to say.\u003c/p\u003e\n\u003cp\u003e“Have you seen Juliet Sykes?” I ask.\u003c/p\u003e\n\u003cp\u003eLindsay stares at me for a split second and then bursts out laughing. “Are you serious?”\u003c/p\u003e\n\u003cp\u003eA feeling of enormous relief washes over me. Maybe she never showed. Maybe she had car trouble, or lost her nerve, or—\u003c/p\u003e\n\u003cp\u003e“She called me a bitch.” In that moment Lindsay shatters me. She did come. “Can you believe it?” Lindsay’s still cracking up. She loops one arm around my shoulder and calls out, “Elody! Ally! Sammy’s here! And she’s looking for her best friend, Juliet!”\u003c/p\u003e\n\u003cp\u003eElody doesn’t even turn around; she’s too busy with Steve Dough. But Ally swings in my direction, smiles, yells, “Hi, sweetie!” and then holds up the empty bottle of vodka.\u003c/p\u003e\n\u003cp\u003e“If you see Juliet,” she calls out, “ask her what she did with the rest of my drink!” She and Lindsay think this is hilarious, and Lindsay calls back, “Psychotini!”\u003c/p\u003e\n\u003cp\u003eI am too late. The realization makes me feel sick, and my anger at Lindsay comes rushing back.\u003c/p\u003e\n\u003cp\u003e“My best friend?” I repeat. “That’s funny. I thought you were the one who was buddy-buddy with Juliet.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Lindsay’s face gets serious.\u003c/p\u003e\n\u003cp\u003e“Childhood friends. Best friends. Rug rats. Sand bunnies.” Lindsay looks like she’s about to say something again, but I cut her off. “I saw the pictures. So what happened? Did she catch you farting or something? See you blow a snot rocket? Discover that the famous Lindsay Edgecombe isn’t perfect after all? What did she do that was so bad?”\u003c/p\u003e\n\u003cp\u003eLindsay opens her mouth and then closes it. “She’s a freak,” she whispers fiercely, but I see something in her eyes I’ve never seen before, an expression I can’t quite identify.\u003c/p\u003e\n\u003cp\u003e“Whatever.” I have to find Juliet Sykes.\u003c/p\u003e\n\u003cp\u003eI fight my way back downstairs, ignoring the people calling my name, tapping my shoulder, and whispering about the fact that I’ve shown up in public looking like I’m about to go to sleep—which is, of course, exactly what happened. I figure if I’m quick enough I can catch Juliet on the way out. She must have parked somewhere. She’s probably blocked in. It will take an hour to get people to move their cars (if she can even convince anybody to help at all, which is doubtful) and even longer if she decides to hoof it home.\u003c/p\u003e\n\u003cp\u003eThankfully I make it downstairs without a run-in with Rob. The last thing I need is to explain myself to him. There’s a group of sophomores standing near the entryway, looking terrified and more or less sober, so I take my shot with them.\u003c/p\u003e\n\u003cp\u003e“Have you seen Juliet Sykes?”\u003c/p\u003e\n\u003cp\u003eThey stare at me blankly.\u003c/p\u003e\n\u003cp\u003eI sigh, swallowing my frustration. “Blond hair, blue eyes, tall.” They’re still looking at me vacantly, and I realize I’m not exactly sure how to describe her. Loser, I almost say—I would have said three days ago. But now I can’t get it out. “Pretty,” I say, testing the word. When that doesn’t work I squeeze my fists into my palms. “Probably soaking wet.”\u003c/p\u003e\n\u003cp\u003eFinally the girls’ faces light up with recognition. “Bathroom,” one of them says, pointing to a little alcove just before the kitchen. There’s a line of people gathered in front of a closed door. One of them is crossing her legs and hopping up and down. One of them keeps rapping on the door. One of them points to her watch and says something I can’t hear, but she looks pissed.\u003c/p\u003e\n\u003cp\u003e“She’s been in there for, like, twenty minutes,” a sophomore says. My stomach drops to my feet and I almost get sick right there.\u003c/p\u003e\n\u003cp\u003eBathrooms have pills. Bathrooms have razors. People lock themselves in bathrooms when they want to do bad things, like have sex or throw up. Or kill themselves.\u003c/p\u003e\n\u003cp\u003eIt’s not supposed to go this way. I’m supposed to save you. I elbow over to the bathroom, shoving through the line of people crowded there.\u003c/p\u003e\n\u003cp\u003e“Move,” I say to Joanne Polerno, and she drops her hand immediately and steps aside.\u003c/p\u003e\n\u003cp\u003eI press my ear to the door, listening for sounds of crying or retching or anything. Nothing. My stomach does another dip. Then again, it’s almost impossible to hear, with the music pounding so loudly.\u003c/p\u003e\n\u003cp\u003eI knock softly and call out, “Juliet? Are you okay?”\u003c/p\u003e\n\u003cp\u003e“Maybe she’s sleeping,” Chrissy Walker says. I shoot her a look that I hope will communicate how stupidly unhelpful that comment is.\u003c/p\u003e\n\u003cp\u003eI knock again, mashing my face against the door. It’s hard to tell whether I hear a faint moan from inside—at that second the music shrieks even louder, drowning out everything else. But I can imagine her there, fading, just beyond the door, wrists hacked up and blood everywhere….\u003c/p\u003e\n\u003cp\u003e“Get Kent,” I say, sucking in a long breath.\u003c/p\u003e\n\u003cp\u003e“Who?” Joanne says.\u003c/p\u003e\n\u003cp\u003e“I have to pee,” Rachel says, hopping up and down.\u003c/p\u003e\n\u003cp\u003e“Kent McFuller. Now. Do it,” I bark at Joanne, and she looks startled but scurries off into the hallway. Every second feels like an eternity. It’s the first time I really understand what Einstein said about relativity, how time bends around and stretches out like a gummy bear.\u003c/p\u003e\n\u003cp\u003e“What do you care, anyway?” Rachel says, grumbling just loud enough so I can hear.\u003c/p\u003e\n\u003cp\u003eI don’t answer. The truth is I have no answer, really. I have to save Juliet—I feel that. It’s my good thing. I have to save myself.\u003c/p\u003e\n\u003cp\u003eI’m suddenly not sure if that makes me better or worse than someone who does nothing, so I push the thought out of my mind.\u003c/p\u003e\n\u003cp\u003eJoanne comes back with Kent in tow. He looks worried, his forehead crinkly underneath the shaggy brown hair that’s falling down over his eyes. My stomach does a flip. Yesterday we were in a dark room no more than two inches apart, so close I could feel the amazing heat of his skin.\u003c/p\u003e\n\u003cp\u003e“Sam,” he says, and leans forward to grab my wrist, staring deep in my eyes. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI’m so surprised by the sudden touch I pull away just a fraction, and Kent takes back his hand. I don’t know how to explain the way this makes my insides go hollow.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I say, totally aware in that moment of how ridiculous I must look to him: the messed up hair, the sweatpants. He, by comparison, looks actually kind of put together. There’s something scruffy-cute about his checkered sneakers and loose, low-belted khakis, and the sleeves of his oxford are rolled up, showing off a tan he got God-knows-where. Certainly not in Ridgeview in the past six months.\u003c/p\u003e\n\u003cp\u003eHe looks confused. “Joanne said you needed me.”\u003c/p\u003e\n\u003cp\u003e“I do need you.” It comes out weird and intense-sounding, and I feel a furious fit of blushing coming on. “I mean, I don’t need you. I just need—” I take a deep breath. I think I see a momentary spark in Kent’s eyes and it distracts me. “I’m worried Juliet Sykes is locked in the bathroom.” Just after I say it, I wince. I sound ridiculous. He’ll probably tell me I’m being insane. After all, he doesn’t know what I know.\u003c/p\u003e\n\u003cp\u003eThe spark dies and his face gets serious. He steps beyond me and tries the door, then he pauses for a second, thinking. He doesn’t tell me I’m crazy or paranoid or anything. He simply says, “There’s no key. I could try to pick the lock. We can always break it open if we have to.”\u003c/p\u003e\n\u003cp\u003e“I’m going to pee upstairs,” Rachel announces, then turns on her heel and wobbles off.\u003c/p\u003e\n\u003cp\u003eKent reaches in his back pocket and pulls out a handful of safety pins. “Don’t ask,” he says when I raise my eyebrows. I hold up my hands and don’t push the issue. I’m grateful he’s taking charge without asking questions.\u003c/p\u003e\n\u003cp\u003eHe squats down, bends the safety pin backward, and uses it to jimmy the lock. He’s keeping his ear pressed to the door like he’s listening for a click. Finally my curiosity gets the better of me.\u003c/p\u003e\n\u003cp\u003e“Do you have an after-school job robbing banks or something?”\u003c/p\u003e\n\u003cp\u003eHe grimaces, tries the door, slips the safety pin back in his pocket, and selects a credit card from his wallet. “Hardly.” He wedges the credit card in the crevice between the frame and the door and wiggles. “My mom used to keep the junk food locked behind our pantry door.”\u003c/p\u003e\n\u003cp\u003eHe straightens up and twists the handle. The door opens an inch, and my heart flies up into my throat. Part of me is hoping that Juliet’s face will appear, furious, or that the door will be slammed closed again from inside. That’s what I would do if someone tried to open the bathroom door when I was inside. That is, if I was still awake—alive—to close it.\u003c/p\u003e\n\u003cp\u003eBut the door just sits there, open that little inch. Kent and I just look at each other at first. I think we’re both scared to open it any farther. \u003c/p\u003e","sourceLink":"https://allnovel.net/before-i-fall/page-39.html","bookId":2757,"creation":"Oct 5, 2019 5:01:26 PM","modification":"Oct 5, 2019 5:01:26 PM"}
