{"id":32412,"no":10,"title":"CHAPTER X. THE COUNTERFEIT BILL.","content":"\u0026nbsp;“Are you sure it is counterfeit?” asked Carl, very much disturbed. \n\u003cdiv\u003e\n “I am certain of it. I haven’t been handling bank bills for ten years without being able to tell good money from bad. I’ll trouble you for another bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s all the money I have,” faltered Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, young man,” said the clerk, sternly, “you are trying a bold game, but it won’t succeed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am trying no game at all,” said Carl, plucking up spirit. “I thought the bill was good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you get it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “From the man who came with me last evening—Mr. Hubbard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The money he gave me was good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he give you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A five-dollar bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was my five-dollar bill,” said Carl, bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your story doesn’t seem very probable,” said the clerk, suspiciously. “How did he happen to get your money, and you his?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He told me that he would get to gambling, and wished me to take money enough to pay his bill here. He handed me the ten-dollar bill which you say is bad, and I gave him five in return. I think now he only wanted to get good money for bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your story may be true, or it may not,” said the clerk, whose manner indicated incredulity. “That is nothing to me. All you have to do is to pay your hotel bill, and you can settle with Mr. Hubbard when you see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I have no other money,” said Carl, desperately.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall feel justified in ordering your arrest on a charge of passing, or trying to pass, counterfeit money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t do that, sir! I will see that you are paid out of the first money I earn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must think I am soft,” said the clerk, contemptuously. “I have seen persons of your stripe before. I dare say, if you were searched, more counterfeit money would be found in your pockets.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Search me, then!” cried Carl, indignantly. “I am perfectly willing that you should.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t you any relations who will pay your bill?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no one to call upon,” answered Carl, soberly. “Couldn’t you let me work it out? I am ready to do any kind of work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our list of workers is full,” said the clerk, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Carl! he felt that he was decidedly in a tight place. He had never before found himself unable to meet his bills, nor would he have been so placed now but for Hubbard’s rascality. A dollar and a quarter seems a small sum, but if you are absolutely penniless it might as well be a thousand. Suppose he should be arrested and the story get into the papers? How his stepmother would exult in the record of his disgrace! He could anticipate what she would say. Peter, too, would rejoice, and between them both his father would be persuaded that he was thoroughly unprincipled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you got in your valise?” asked the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only some underclothing. If there were anything of any value I would cheerfully leave it as security. Wait a minute, though,” he said, with a sudden thought. “Here is a gold pencil! It is worth five dollars; at any rate, it cost more than that. I can place that in your hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me see it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl handed the clerk a neat gold pencil, on which his name was inscribed. It was evidently of good quality, and found favor with the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll give you a dollar and a quarter for the pencil,” he said, “and call it square.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn’t like to sell it,” said Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You won’t get any more for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wasn’t thinking of that; but it was given me by my mother, who is now dead. I would not like to part with anything that she gave me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would prefer to get off scot-free, I suppose?” retorted the clerk, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I am willing to leave it in your hands, but I should like the privilege of redeeming it when I have the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” said the clerk, who reflected that in all probability Carl would never come back for it. “I’ll take it on those conditions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl passed over the pencil with a sigh. He didn’t like to part with it, even for a short time, but there seemed no help for it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right. I will mark you paid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl left the hotel, satchel in hand, and as he passed out into the street, reflected with a sinking heart that he was now quite penniless. Where was he to get his dinner, and how was he to provide himself with a lodging that night? At present he was not hungry, having eaten a hearty breakfast at the hotel, but by one o’clock he would feel the need of food. He began to ask himself if, after all, he had not been unwise in leaving home, no matter how badly he had been treated by his stepmother. There, at least, he was certain of living comfortably. Now he was in danger of starvation, and on two occasions already he had incurred suspicion, once of being concerned in a murder, and just now of passing counterfeit money. Ought he to have submitted, and so avoided all these perils?\n\u003c/div\u003e \n\u003cdiv\u003e\n “No!” he finally decided; “I won’t give up the ship yet. I am about as badly off as I can be; I am without a cent, and don’t know where my next meal is to come from. But my luck may turn—it must turn—it has turned!” he exclaimed with energy, as his wandering glance suddenly fell upon a silver quarter of a dollar, nearly covered up with the dust of the street. “That shall prove a good omen!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He stooped over and picked up the coin, which he put in his vest pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was wonderful how the possession of this small sum of money restored his courage and raised his spirits. He was sure of a dinner now, at all events. It looked as if Providence was smiling on him.\n\u003c/div\u003e \n\u003cdiv\u003e\n Two miles farther on Carl overtook a boy of about his own age trudging along the road with a rake over his shoulder. He wore overalls, and was evidently a farmer’s boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-day!” said Carl, pleasantly, noticing that the boy regarded him with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-day!” returned the country lad, rather bashfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you tell me if there is any place near where I can buy some dinner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There ain’t no tavern, if that’s what you mean. I’m goin’ home to dinner myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Over yonder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He pointed to a farmhouse about a dozen rods away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think your mother would give me some dinner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess she would. Mam’s real accommodatin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you ask her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; just come along of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned into the yard, and followed a narrow path to the back door.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll stay here while you ask,” said Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy entered the house, and came out after a brief absence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mam says you’re to come in,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl, glad at heart, and feeling quite prepared to eat fifty cents’ worth of dinner, followed the boy inside.\n\u003c/div\u003e \n\u003cdiv\u003e\n A pleasant-looking, matronly woman, plainly but neatly attired, came forward to greet him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nat says you would like to get some dinner,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Carl. “I hope you’ll excuse my applying to you, but your son tells me there is no hotel near by.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The nearest one is three miles away from here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I can hold out so long,” said Carl, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sit right down with Nat,” said the farmer’s wife, hospitably. “Mr. Sweetser won’t be home for half an hour. We’ve got enough, such as it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Evidently Mrs. Sweetser was a good cook. The dinner consisted of boiled mutton, with several kinds of vegetables. A cup of tea and two kinds of pie followed.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was hard to tell which of the two boys did fuller justice to the meal. Nat had the usual appetite of a healthy farm boy, and Carl, in spite of his recent anxieties, and narrow escape from serious peril, did not allow himself to fall behind.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your mother’s a fine cook!” said Carl, between two mouthfuls.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ain’t she, though?” answered Nat, his mouth full of pie.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Carl rose from the table he feared that he had eaten more than his little stock of money would pay for.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much will it be, Mrs. Sweetser?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you’re quite welcome to all you’ve had,” said the good woman, cheerily. “It’s plain farmer’s fare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never tasted a better dinner,” said Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Sweetser seemed pleased with the compliment to her cooking.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come again when you are passing this way,” she said. “You will always be welcome to a dinner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl thanked her heartily, and pressed on his way. Two hours later, at a lonely point of the road, an ill-looking tramp, who had been reclining by the wayside, jumped up, and addressed him in a menacing tone:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Young feller, shell over all the money you have got, or I’ll hurt you! I’m hard up, and I won’t stand no nonsense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl started and looked into the face of the tramp. It seemed to him that he had never seen a man more ill-favored, or villainous-looking.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2963/81552.html","bookId":388,"creation":"Aug 5, 2019 4:08:52 AM","modification":"Aug 5, 2019 4:08:52 AM"}
