{"id":32426,"no":24,"title":"CHAPTER XXIV. THE BURGLARY.","content":"\u0026nbsp;Carl seated himself behind a stone wall on the opposite side of the street from the factory. The building was on the outskirts of the village, though not more than half a mile from the post office, and there was very little travel in that direction during the evening. This made it more favorable for thieves, though up to the present time no burglarious attempt had been made on it. Indeed, Milford had been exceptionally fortunate in that respect. Neighboring towns had been visited, some of them several times, but Milford had escaped. \n\u003cdiv\u003e\n The night was quite dark, but not what is called pitchy dark. As the eyes became accustomed to the obscurity, they were able to see a considerable distance. So it was with Carl. From his place of concealment he occasionally raised his head and looked across the way to the factory. An hour passed, and he grew tired. It didn’t look as if the attempt were to be made that night. Eleven o’clock pealed out from the spire of the Baptist Church, a quarter of a mile away. Carl counted the strokes, and when the last died into silence, he said to himself:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will stay here about ten minutes longer. Then, if no one comes, I will give it up for tonight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The time was nearly up when his quick ear caught a low murmur of voices. Instantly he was on the alert. Waiting till the sound came nearer, he ventured to raise his head for an instant above the top of the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n His heart beat with excitement when he saw two figures approaching. Though it was so dark, he recognized them by their size and outlines. They were Julius Gibbon, the bookkeeper, and Phil Stark, the stranger staying at the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl watched closely, raising his head for a few seconds at a time above the wall, ready to lower it should either glance in his direction. But neither of the men did so. Ignorant that they were suspected, it was the farthest possible from their thoughts that anyone would be on the watch.\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently they came so near that Carl could hear their voices.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish it was over,” murmured Gibbon, nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t worry,” said his companion. “There is no occasion for haste. Everybody in Milford is in bed and asleep, and we have several hours at our disposal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must remember that my reputation is at stake. This night’s work may undo me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My friend, you can afford to take the chances. Haven’t I agreed to give you half the bonds?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall be suspected, and shall be obliged to stand my ground, while you will disappear from the scene.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two thousand dollars will pay you for some inconvenience. I don’t see why you should be suspected. You will be supposed to be fast asleep on your virtuous couch, while some bad burglar is robbing your worthy employer. Of course you will be thunderstruck when in the morning the appalling discovery is made. I’ll tell you what will be a good dodge for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Offer a reward of a hundred dollars from your own purse for the discovery of the villain who has robbed the safe and abstracted the bonds.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil Stark burst out into a loud guffaw as he uttered these words.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush!” said Gibbon, timidly. “I thought I heard some one moving.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a timid fool you are!” muttered Stark, contemptuously. “If I had no more pluck, I’d hire myself out to herd cows.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a better business,” said Gibbon, bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, well, each to his taste! If you lose your place as bookkeeper, you might offer your services to some farmer. As for me, the danger, though there isn’t much, is just enough to make it exciting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care for any such excitement,” said Gibbon, dispiritedly. “Why couldn’t you have kept away and let me earn an honest living?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I must live as well as you, my dear friend. When this little affair is over, you will thank me for helping you to a good thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course all this conversation did not take place within Carl’s hearing. While it was going on, the men had opened the office door and entered. Then, as Carl watched the window closely he saw a narrow gleam of light from a dark lantern illuminating the interior.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now they are at the safe,” thought Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n We, who are privileged, will enter the office and watch the proceedings.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gibbon had no difficulty in opening the safe, for he was acquainted with the combination. Stark thrust in his hand eagerly and drew out the box.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is what we want,” he said, in a tone of satisfaction. “Have you a key that will open it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall have to take box and all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us get through as soon as possible,” said Gibbon, uneasily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can close the safe, if you want to. There is nothing else worth taking?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we will evacuate the premises. Is there an old newspaper I can use to wrap up the box in? It might look suspicious if anyone should see it in our possession.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, here is one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He handed a copy of a weekly paper to Phil Stark, who skillfully wrapped up the box, and placing it under his arm, went out of the office, leaving Gibbon to follow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where will you carry it?” asked Gibbon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somewhere out of sight where I can safely open it. I should have preferred to take the bonds, and leave the box in the safe. Then the bonds might not have been missed for a week or more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That would have been better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n That was the last that Carl heard. The two disappeared in the darkness, and Carl, raising himself from his place of concealment, stretched his cramped limbs and made the best of his way home. He thought no one would be up, but Mr. Jennings came out from the sitting-room, where he had flung himself on a lounge, and met Carl in the hall.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The safe has been robbed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who did it?” asked the manufacturer, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The two we suspected.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you see Mr. Gibbon, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he was accompanied by Mr. Stark.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You saw them enter the factory?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I was crouching behind the stone wall on the other side of the road.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long were they inside?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not over fifteen minutes—perhaps only ten.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Gibbon knew the combination,” said Jennings, quietly. “There was no occasion to lose time in breaking open the safe. There is some advantage in having a friend inside. Did you see them go out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Carrying the tin box with them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. Mr. Stark wrapped it in a newspaper after they got outside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you saw the tin box?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, if necessary, you can testify to it. I thought it possible that Mr. Gibbon might have a key to open it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I overheard Stark regretting that he could not open it so as to abstract the bonds and leave the box in the safe. In that case, he said, it might be some time before the robbery was discovered.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will himself make an unpleasant discovery when he opens the box. I don’t think there is any call to pity him, do you, Carl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir. I should like to be within sight when he opens it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The manufacturer laughed quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said; “if I could see it I should feel repaid for the loss of the box. Let it be a lesson for you, my boy. Those who seek to enrich themselves by unlawful means are likely in the end to meet with disappointment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I need the lesson?” asked Carl, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, my lad. I am sure you don’t. But you do need a good night’s rest. Let us go to bed at once, and get what sleep we may. I won’t allow the burglary to keep me awake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed in high good humor, and Carl went up to his comfortable room, where he soon lost all remembrance of the exciting scene of which he had been a witness.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Jennings went to the factory at the usual time the next morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he entered the office the bookkeeper approached him pale and excited.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Jennings,” he said, hurriedly, “I have bad news for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Mr. Gibbon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I opened the safe this morning, I discovered that the tin box had been stolen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Jennings took the news quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any suspicion who took it?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir. I—I hope the loss is not a heavy one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not care to make the extent of the loss public. Were there any marks of violence? Was the safe broken open?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Singular; is it not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will allow me I will join in offering a reward for the discovery of the thief. I feel in a measure responsible.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will think of your offer, Mr. Gibbon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He suspects nothing,” thought Gibbon, with a sigh of relief.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2963/81566.html","bookId":388,"creation":"Aug 5, 2019 4:08:52 AM","modification":"Aug 5, 2019 4:08:52 AM"}
