{"id":32430,"no":28,"title":"CHAPTER XXVIII. AFTER A YEAR.","content":"\u0026nbsp;Twelve months passed without any special incident. With Carl it was a period of steady and intelligent labor and progress. He had excellent mechanical talent, and made remarkable advancement. He was not content with attention to his own work, but was a careful observer of the work of others, so that in one year he learned as much of the business as most boys would have done in three. \n\u003cdiv\u003e\n When the year was up, Mr. Jennings detained him after supper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you remember what anniversary this is, Carl?” he asked, pleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; it is the anniversary of my going into the factory.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Exactly. How are you satisfied with the year and its work?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been contented and happy, Mr. Jennings; and I feel that I owe my happiness and content to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Jennings looked pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad you say so,” he said, “but it is only fair to add that your own industry and intelligence have much to do with the satisfactory results of the year.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The superintendent tells me that outside of your own work you have a general knowledge of the business which would make you a valuable assistant to himself in case he needed one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl’s face glowed with pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe in being thorough,” he said, “and I am interested in every department of the business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Before you went into the factory you had not done any work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I had attended school.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was not a bad preparation for business, but in some cases it gives a boy disinclination for manual labor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I wouldn’t care to work with my hands all my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t blame you for that. You have qualified yourself for something better. How much do I pay you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I began on two dollars a week and my board. At the end of six months you kindly advanced me to four dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dare say you have found it none too much for your wants.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have saved forty dollars out of it,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Jennings looked pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have done admirably,” he said, warmly. “Forty dollars is not a large sum, but in laying it by you have formed a habit that will be of great service to you in after years. I propose to raise you to ten dollars a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, sir, shall I earn so much? You are very kind, but I am afraid you will be a loser by your liberality.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Jennings smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are partly right,” he said. “Your services at present are hardly worth the sum I have agreed to pay, that is, in the factory, but I shall probably impose upon you other duties of an important nature soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you do, sir, I will endeavor to meet your expectations.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How would you like to take a journey Carl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very much, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think of sending you—to Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl, who had thought perhaps of a fifty-mile trip, looked amazed, but his delight was equal to his surprise. He had always wished to see the West, though Chicago can hardly be called a Western city now, since between it and the Pacific there is a broad belt of land two thousand miles in extent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I am competent?” he asked, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot say positively, but I think so,” answered Mr. Jennings.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall be delighted to go. Will it be very soon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, very soon. I shall want you to start next Monday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will be ready, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I may as well explain what are to be your duties. I am, as you know, manufacturing a special line of chairs which I am desirous of introducing to the trade. I shall give you the names of men in my line in Albany, Buffalo, Cleveland and Chicago, and it will be your duty to call upon them, explain the merits of the chair, and solicit orders. In other words, you will be a traveling salesman or drummer. I shall pay your traveling expenses, ten dollars a week, and, if your orders exceed a certain limit, I shall give you a commission on the surplus.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose I don’t reach that limit?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall at all events feel that you have done your best. I will instruct you a little in your duties between now and the time of your departure. I should myself like to go in your stead, but I am needed here. There are, of course, others in my employ, older than yourself, whom I might send, but I have an idea that you will prove to be a good salesman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will try to be, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n On Monday morning Carl left Milford, reached New York in two hours and a half and, in accordance with the directions of Mr. Jennings, engaged passage and a stateroom on one of the palatial night lines of Hudson River steamers to Albany. The boat was well filled with passengers, and a few persons were unable to procure staterooms.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl, however, applied in time, and obtained an excellent room. He deposited his gripsack therein, and then took a seat on deck, meaning to enjoy as long as possible the delightful scenery for which the Hudson is celebrated. It was his first long journey, and for this reason Carl enjoyed it all the more. He could not but contrast his present position and prospects with those of a year ago, when, helpless and penniless, he left an unhappy home to make his own way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a delightful evening!” said a voice at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning, Carl saw sitting by him a young man of about thirty, dressed in somewhat pretentious style and wearing eyeglasses. He was tall and thin, and had sandy side whiskers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it is a beautiful evening,” replied Carl, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the scenery is quite charming. Have you ever been all the way up the river?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I hope some day to take a day trip.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so. I am not sure but I prefer the Rhine, with its romantic castles and vineclad hills.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you visited Europe, then?” asked Carl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, several times. I have a passion for traveling. Our family is wealthy, and I have been able to go where I pleased.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must be very pleasant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is. My name is Stuyvesant—one of the old Dutch families.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl was not so much impressed, perhaps, as he should have been by this announcement, for he knew very little of fashionable life in New York.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t look like a Dutchman,” he said, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you expected a figure like a beer keg,” rejoined Stuyvesant, laughing. “Some of my forefathers may have answered that description, but I am not built that way. Are you traveling far?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may go as far as Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is anyone with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you have friends in Chicago?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I am aware of. I am traveling on business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed; you are rather young for a business man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sixteen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, that cannot exactly be called venerable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I suppose not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way, did you succeed in getting a stateroom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have a very good one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re in luck, on my word. I was just too late. The man ahead of me took the last room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can get a berth, I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But that is so common. Really, I should not know how to travel without a stateroom. Have you anyone with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will take me in I will pay the entire expense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl hesitated. He preferred to be alone, but he was of an obliging disposition, and he knew that there were two berths in the stateroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it will be an accommodation,” he said, “I will let you occupy the room with me, Mr. Stuyvesant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you, indeed! I shall esteem it a very great favor. Where is your room?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl led the way to No. 17, followed by his new acquaintance. Mr. Stuyvesant seemed very much pleased, and insisted on paying for the room at once. Carl accepted half the regular charges, and so the bargain was made.\n\u003c/div\u003e \n\u003cdiv\u003e\n At ten o’clock the two travelers retired to bed. Carl was tired and went to sleep at once. He slept through the night. When he awoke in the morning the boat was in dock. He heard voices in the cabin, and the noise of the transfer of baggage and freight to the wharf.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have overslept myself,” he said, and jumped up, hurriedly. He looked into the upper berth, but his roommate was gone. Something else was gone, too—his valise, and a wallet which he had carried in the pocket of his trousers.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2963/81570.html","bookId":388,"creation":"Aug 5, 2019 4:08:52 AM","modification":"Aug 5, 2019 4:08:52 AM"}
