{"id":32405,"no":3,"title":"CHAPTER III. INTRODUCES PETER COOK.","content":"\u0026nbsp;Gilbert took the morning train to the town of Edgewood Center, the residence of the Crawfords. He had been there before, and knew that Carl’s home was nearly a mile distant from the station. Though there was a hack in waiting, he preferred to walk, as it would give him a chance to think over what he proposed to say to Dr. Crawford in Carl’s behalf. \n\u003cdiv\u003e\n He was within a quarter of a mile of his destination when his attention was drawn to a boy of about his own age, who was amusing himself and a smaller companion by firing stones at a cat that had taken refuge in a tree. Just as Gilbert came up, a stone took effect, and the poor cat moaned in affright, but did not dare to come down from her perch, as this would put her in the power of her assailant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That must be Carl’s stepbrother, Peter,” Gilbert decided, as he noted the boy’s mean face and turn-up nose. “Stoning cats seems to be his idea of amusement. I shall take the liberty of interfering.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter Cook laughed heartily at his successful aim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hit her, Simon,” he said. “Doesn’t she look seared?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must have hurt her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I expect I did. I’ll take a bigger stone next time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He suited the action to the word, and picked up a rock which, should it hit the poor cat, would in all probability kill her, and prepared to fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Put down that rock!” said Gilbert, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter turned quickly, and eyed Gilbert insolently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” he demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No matter who I am. Put down that rock!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What business is it of yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall make it my business to protect that cat from your cruelty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter, who was a natural coward, took courage from having a companion to back him up, and retorted: “You’d better clear out of here, or I may fire at you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do it if you dare!” said Gilbert, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter concluded that it would be wiser not to carry out his threat, but was resolved to keep to his original purpose. He raised his arm again, and took aim; but Gilbert rushed in, and striking his arm forcibly, compelled him to drop it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean by that, you loafer?” demanded Peter, his eyes blazing with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To stop your fun, if that’s what you call it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve a good mind to give you a thrashing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gilbert put himself in a position of defense.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sail in, if you want to!” he responded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Help me, Simon!” said Peter. “You grab his legs, and I’ll upset him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Simon, who, though younger, was braver than Peter, without hesitation followed directions. He threw himself on the ground and grasped Gilbert by the legs, while Peter, doubling up his fists, made a rush at his enemy. But Gilbert, swiftly eluding Simon, struck out with his right arm, and Peter, unprepared for so forcible a defense, tumbled over on his back, and Simon ran to his assistance.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gilbert put himself on guard, expecting a second attack; but Peter apparently thought it wiser to fight with his tongue.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You rascal!” he shrieked, almost foaming at the mouth; “I’ll have you arrested.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for?” asked Gilbert, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “For flying at me like a—a tiger, and trying to kill me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gilbert laughed at this curious version of things.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought it was you who flew at me,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What business had you to interfere with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it again unless you give up firing stones at the cat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it as long as I like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s gone!” said Simon.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys looked up into the tree, and could see nothing of puss. She had taken the opportunity, when her assailant was otherwise occupied, to make good her escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m glad of it!” said Gilbert. “Good-morning, boys! When we meet again, I hope you will be more creditably employed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t get off so easy, you loafer,” said Peter, who saw the village constable approaching. “Here, Mr. Rogers, I want you to arrest this boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Constable Rogers, who was a stout, broad-shouldered man, nearly six feet in height, turned from one to the other, and asked: “What has he done?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He knocked me over. I want him arrested for assault and battery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what did you do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I? I didn’t do anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is rather strange. Young man, what is your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gilbert Vance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t live in this town?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I live in Warren.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What made you attack Peter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because he flew at me, and I had to defend myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is this so, Simon? You saw all that happened.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ye—es,” admitted Simon, unwillingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That puts a different face on the matter. I don’t see how I can arrest this boy. He had a right to defend himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He came up and abused me—the loafer,” said Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was the reason you went at him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you anything to say?” asked the constable, addressing Gilbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; when I came up I saw this boy firing stones at a cat, who had taken refuge in that tree over there. He had just hit her, and had picked up a larger stone to fire when I ordered him to drop it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was no business of yours,” muttered Peter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I made it my business, and will again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did the cat have a white spot on her forehead?” asked the constable.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And was mouse colored?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, it’s my little girl’s cat. She would be heartbroken if the cat were seriously hurt. You young rascal!” he continued, turning suddenly upon Peter, and shaking him vigorously. “Let me catch you at this business again, and I’ll give you such a warming that you’ll never want to touch another cat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me go!” cried the terrified boy. “I didn’t know it was your cat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would have been just as bad if it had been somebody else’s cat. I’ve a great mind to put you in the lockup.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, don’t, please don’t, Mr. Rogers!” implored Peter, quite panic-stricken.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you promise never to stone another cat?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then go about your business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Peter lost no time, but scuttled up the street with his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am much obliged to you for protecting Flora’s cat,” then said the constable to Gilbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are quite welcome, sir. I won’t see any animal abused if I can help it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wasn’t that boy Peter Cook?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. Don’t you know him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; but I know his stepbrother, Carl.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A different sort of boy! Have you come to visit him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; he is visiting me. In fact, he has left home, because he could not stand his step-mother’s ill-treatment, and I have come to see his father in his behalf.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has had an uncomfortable home. Dr. Crawford is an invalid, and very much under the influence of his wife, who seems to have a spite against Carl, and is devoted to that young cub to whom you have given a lesson. Does Carl want to come back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; he wants to strike out for himself, but I told him it was no more than right that he should receive some help from his father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true enough. For nearly all the doctor’s money came to him through Carl’s mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid Peter and his mother won’t give me a very cordial welcome after what has happened this morning. I wish I could see the doctor alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you can, for there he is coming up the street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Gilbert looked in the direction indicated, and his glance fell on a thin, fragile-looking man, evidently an invalid, with a weak, undecided face, who was slowly approaching.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy advanced to meet him, and, taking off his hat, asked politely: “Is this Dr. Crawford?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2963/81545.html","bookId":388,"creation":"Aug 5, 2019 4:08:52 AM","modification":"Aug 5, 2019 4:08:52 AM"}
