{"id":65238,"no":34,"title":"Page 34","content":"\u003cp\u003e\u0026nbsp;“Find out who’s asking.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I tried. Can’t trace the prompt.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Ummm. That’s odd.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“That’s why I thought I’d tell you. Smells funny.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Keep up a tracing program, in case they ask again.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Yessir. And about the Dahlite Bastion—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Give it a rest.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I mean, look at how the Imperials squashed that Junin mess!”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari let Yugo go on. He had long ago mastered the academic art of appearing to pay rapt attention while his mind worked a spiral arm away.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He knew he would have to speak to the Emperor about the Dahlite matter, and not only to counter Lamurk’s move—an audacious one, within the traditionally inviolate realm of Trantor. A quick, bloody solution to a tough issue. Clean, brutal.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The Dahlites had a case: they were underrepresented. And un­ popular. And reactionary.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The fact that Dahlites—except for prodigies lifted up by the scruff of their neck, like Yugo—were hostile to the usual instincts of a scientific mind made no difference.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;In fact, Hari was beginning to doubt whether the stiff, formal scientific establishment was worthy of high regard any longer. All around him he saw corruption of the impartiality of science, from the boonsmanship networking to the currying of Imperial scraps which passed for a promotion system.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Just yesterday he had been visited by a Dean of Adjustments who had advised, with oily logic, that Hari use some of his Imperial power to confer a boon upon a professor who had done very little work, but who had family ties to the High Council.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The dean had said quite sincerely, “Don’t you think it is in the better interests of the university that you grant a small boon to one with influence?” When Hari did not, he nonetheless called the fel­ low to tell him why.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The dean was astonished with such honesty. Only later did Hari decide that the dean was right, within his own logic system. If boons were mere benefits, simple largess, then why not confer them wholly on political grounds? It was an alien way of thinking, but consistent, he had to admit.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari sighed. When Yugo paused in his vehement tirade, Hari smiled. No, wrong response. A worried frown—there, that did it. Yugo launched back into rapid talk, arms taking wing, epithets stacked to improbable heights.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari realized that the mere exposure to politics as it truly was, the brutal struggle of blind swarms in shadow, had raised doubts about his own, rather smug, positions. Was the science he had so firmly believed in back on Helicon truly as useful to people like the Dahlites as he imagined?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;So his musing came around to his equations: Could the Empire ever be driven by reason and moral decision, rather than power and wealth? Theocracies had tried, and failed. Scientocracies, rather more rarely, had been too rigid to last.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“—and I said, sure, Hari can do that,” Yugo finished.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Uh, what?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Back the Alphoso plan for Dahlite representation, of course.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I will think about it,” Hari said to cover. “Meanwhile, let’s hear a report on that longevity angle you were pursuing.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I gave it to three of those new research assistants,” Yugo said soberly, his Dahlite energies expended. “They couldn’t make sense of it.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“If you’re a lousy hunter, the woods are always empty.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo’s startled look made Hari wonder if he was getting a bit crusty. Politics was taking its toll.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“So I worked the longevity factor into the equations, just to see. Here—” he slid an ellipsoidal data-core into Hari’s desk reader “—watch what happens.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;One persistent heritage of pre-antiquity was the standard Galactic Year, used by all worlds of the Imperium in official business. Hari had always wondered: Was it a signature of Earth’s orbital period? With its twelve-based year of twelve months, each of twenty-eight days, it suggested as candidate worlds a mere 1,224,675 from the 25 million of the Empire. Yet spins, precessions, and satellite resonances perturbed all plan­ etary periods. Not a single world of those 1,224,675 fit the G.E. calendar exactly. Over 17,000 came quite close.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo started explaining his results. One curious feature of Empire history was the human lifespan. It was still about 100 years, but some early writings suggested that these were nearly twice as long as the “primordial year” (as one text had it), which was “natural” to humans. If so, people lived nearly twice as long as in pre-Imper-ial eras. Indefinite extension of the lifespan was impossible; biology always won, in the end. New maladies moved into the niche provided by the human body.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I got the basics on this from Dors—sharp lady,” Yugo said. “Watch this data-flash.” Curves, 3D projections, sliding sheets of correlations.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The collision between biological science and human culture was always intense, often damaging. It usually led to a free-market policy, in which parents could select desirable traits for their chil­ dren.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Some opted for longevity, increasing to 125, then even 150 years. When a majority were long-lived, such planetary societies faltered. Why?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“So I traced the equations, watching for outside influences,” Yugo went on. Gone was the fevered Dahlite; here was the brilliance that had made Hari pluck Yugo out of a sweltering deep-layer job, decades ago.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Through the equations’ graceful, deceptive sinuosity, he had found a curious resonance. There were underlying cycles in econom­ ics and politics, well understood, of about 120 to 150 years.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;When the human lifespan reached those ranges, a destructive feedback began. Markets became jagged landscapes, peaking and plunging. Cultures lurched from extravagant excess to puritanical constriction. Within a few centuries, chaos destroyed most of the bioscience capability, or else religious restrictions smothered it. The mean lifespan slid down again.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“How strange,” Hari said, observing the severe curves of the cycles, their arcs crashing into splintered spokes. “I’ve always wondered why we don’t live longer.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“There’s great social pressure against it. Now we know where it comes from.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Still…I’d like to have a centuries-long, productive life.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo grinned. “Look at the media—plays, legends, holos. The very old are always ugly, greedy misers, trying to keep everything for themselves.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Ummm. True, usually.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“And myths. Those who rise from the dead. Vampires. Mummies. They’re always evil.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No exceptions?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo nodded. “Dors pulled some really old ones out for me. There was that ancient martyr—Jesu, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Some sort of resurrection myth?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Dors says Jesu probably wasn’t a real person. That’s what the scattered, ancient texts say. The whole myth is prob’ly a collective psychodream. You’ll notice, once he was back from the dead, he didn’t stay around very long.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Rose into heaven, wasn’t it?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Left town in a hurry, anyway. People don’t want you around, even if you’ve beaten the Reaper.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo pointed at the curves, converging on disaster. “At least we can understand why most societies learn not to let people live too long.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari studied the event-surfaces. “Ah, but who learns?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Huh? People, one way or the other.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“But no single person ever knew—” his finger jabbed “—this.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“The knowledge gets embedded in taboos, legends, laws.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Ummm.” There was an idea here, something larger looming just beyond his intuitions…and it slipped away. He would have to wait for it to revisit him—if he ever, these days, got the time to listen to the small, quiet voice that slipped by, whispering, like a shadowy figure on a foggy street….\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari shook himself. “Good work, this. I’m considerably im­ pressed. Publish it.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Thought we were keepin’ psychohistory quiet.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“This is a small element. People will think the rumors are tarted-up versions of this.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Psychohistory can’t work if people know.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“It’s safe. The longevity element will get plenty of coverage and stop speculation.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“It’ll be a cover, then, against the Imperial snoops?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Exactly.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Yugo grinned. “Funny, how they spy even on an ‘ornament to the Imperium’—that’s what Cleon called you before the Regal Re­ ception last week.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“He did? I didn’t catch that.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Workin’ too much on those Boon Deeds. You got to hand off that stuff.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“We need more resources for psychohistory.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Why not just get some money funneled through from the Em­ peror?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Lamurk would find out, use it against me. Favoritism in the High Council proceedings and so on. You could write the story yourself.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Um, maybe so. Sure would be a whole lot easier, though.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“The idea is to keep our heads down. Avoid scandal, let Cleon do his diplomatic dance.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Cleon also said you were a ‘flower of intellect.’ I recorded it for you.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Forget it. Flowers that grow too high get picked.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;10.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Dors got as far as the palace high vestibule. There the Imperial Guard turned her back.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Damn it, she’s my wife,” Hari said angrily.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Sorry, it’s a Peremptory Order,” the bland court official said. Hari could hear the capital letters. The phalanx of Specials around Hari did not intimidate this fellow; he wondered if anyone could.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Look,” he said to Dors, “there’s a bit of time before the meeting. Let’s eat a bit at the High Reception.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;She bristled. “You’re not going in?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I thought you understood. I have to. Cleon’s called this meet­ ing—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“At Lamurk’s instigation.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Sure, it’s about this Dahlite business.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“And that man I knocked down at the reception, he might have been instigated to do it by—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Right, Lamurk.” Hari smiled. “All wormholes lead to Lamurk.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Don’t forget the Academic Potentate.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“She’s on my side!”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“She wants the ministership, Hari. All the rumor-mills say so.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“She can damn well have it,” he grumbled.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I can’t let you go in there.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“This is the palace.” He swept his arm at the ranks of blue-and-gold in the vast portal. “Imperials all around.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I do not like it.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Look, we agreed I’d try to bluster past—and it failed, just as I said. Fair enough. You would never pass the weapons checks, anyway.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Her teeth bit delicately into her lower lip, but she said nothing. No humaniform could ever get through the intense weapons screen here.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He said calmly, “So I go in, argue, meet you out here—”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You have the maps and data I organized?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Sure, chip embedded. I can read it with a triple blink.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He had a carrychip embedded in his neck for data hauling, an invaluable aid at mathist conferences. Standard gear, readily ac­ cessed. A microlaser wrote an image on the back of the retina—col-ors, 3D, a nifty graphics package. She had installed a lot of maps and background on the Imperium, the palace, recent legislation, notable events, anything that might come up in discussions and protocols.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Her severe expression dissolved and he saw the woman beneath. “I just…please…watch yourself.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He kissed her on the nose. “Always do.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;They patrolled among the legions of hangers-on who thronged the vestibule, snagging the appetizers which floated by on platters. “Empire’s going bankrupt and they can afford this,” Hari sniffed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“It is time-honored,” Dors said. “Beaumunn the Bountiful disliked delay in consuming meals, which was indeed his principal activity. He ordered that each of his estates prepare all four daily meals for him, on the chance that he might be there. The excess is given out this way.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Hari would not have believed such an unlikely story had it not come from an historian. There were knots of people who plainly lived here, using some minor functionary position for an infinite banquet. He and Dors drifted among them, wearing refractory vapors which muddled the appearance. Recognition would bring parasites. \u003c/p\u003e","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-34.html","bookId":1697,"creation":"Oct 5, 2019 9:57:11 AM","modification":"Oct 5, 2019 9:57:11 AM"}
