{"id":65246,"no":42,"title":"Page 42","content":"\u003cp\u003e\u0026nbsp;As he watched, bricks in a nearby wall muddied, lost their exact spacing. The room retreated into sterile, abstract planes: gray, black, oblongs where once had been walls and fur­ niture. “Background, mere background,” he muttered.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;How about Him? Self? His breath whooshed and wheezed in and out, airflow too abrupt. No intricate fluid codes, he gathered, calculating exact patterns. The simple appearance of inhale—exhale was enough to quiet his pseudo-nervous system, make it think he was breathing.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;In fact, it was breathing him. But what was it?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Once he got good control, he could flesh himself out. His scrawny neck thickened. Crackling, his hands broadened, filled with un­ earned muscle. Turning to survey his cottage, he established his own domain—a region in which he could process any detail at will. Here he was godlike. “Though without angels—so far.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He walked outside and was in his own verdant garden. The grass he had made stood absolutely still. Its thousands of blades per­ formed stiff, jerky motions when he stepped on them. Though richly emerald, they were like the grass of a sudden winter, crunching underfoot.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The garden parted and he walked down to a golden beach, his clothes whipping away on the wind. When he swam in the salt-tangy ocean, waves were quite distinct until they broke into surf.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Then the fluid mechanics became too much for his available computational rate. The frothy waves blurred. He could still swim, catch them, even ride down their faces, but they were like a fog of muttering water. Still salty, though.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He became used to occasional loss of detail. It was rather like having one’s vision blur with age, after all. He went soaring through air, then skiing down impossible slopes, experiencing the visceral thrill of risking his life, feeling the fear in every sinew—and never getting a scratch, of course.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;There were pleasant aspects to being just a pattern of electrons. His Environment Manager entertained him enormously…for a while.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He flew back to his country home. Had that not been his answer, when asked about how to change the world? “Cultivate your garden.” What meaning had that now?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He walked toward the water geyser outside his study. He had loved its sense of play, so precious—for it only lasted a few minutes before draining the uphill reservoir.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Now it gushed eternally. But as he looked at it, he felt himself whiten with the effort. Water was expensive to sim, involving hy­ drodynamic calculations of nonlaminar flow to get the droplets and splashes real seeming. It slid over his hands and their exquis­ itely fine fingerprints with convincing liquid grace.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;With a faint—jump—he felt something change. His hand, still in the spray, no longer sensed the water’s cool caress. Droplets passed through his hand, not flowing over it. He was now witness­ ing the fountain, not interacting with it. To save computational expense, no doubt. Reality was algorithm.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Of course,” his Self muttered, “they could ‘model out’ disturbing jerks and seams.” As he watched, the water flow somehow got smoother, more real. A tailoring program had edited this little closed drama, for his benefit.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Merci,” he murmured. Irony was lost on digital gates, however.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;But there were pieces of himself missing. He could not say what they were, but he sensed…hollows.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He took flight. Deliberately he slowed his Self so that ferrets could take him down insinuating corridors of computation, across the Mesh of Trantor. Never mind Marq and his Artifice Associates. They would be harder to pilfer from, surely.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He arrived—hovering—in the office of the Seldon person. Here was where his Self had resided, before.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;One could copy a Self without knowing what it was. Just record it, like a musical passage; the machine which did that did not need to know harmony, structure.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He willed: find. In answer came, “The Base Original?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Yes. The real me.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You/I have come a great distance since then.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Humor my nostalgia.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Volt 1.0, as a Directory termed him, was slumbering. Still\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;saved—not in the Christian sense, alas—and awaiting digital resur­ rection.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;And he? Something had saved him. What? Who?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Voltaire snatched Volt 1.0 away. Let Seldon wonder at the intru­ sion; a millisecond later, he was halfway around Trantor, all traceries of him fading. He wanted to save Volt 1.0. At any time the mathist Seldon could let it/him lapse. Now, as Voltaire watched like a digital angel from outside, Volt 1.0 danced its static gavotte.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Ummm, there is some resemblance.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I shall cut and paste into your blanks.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“May I have some interesting anesthetic?” He was thinking of\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;brandy, but a sheet of names slid enticingly by him. “Morphine? Rigotin? A mild euphoric, at least?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Disapproval: “This will not hurt.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“That’s what the critics said, too, about my plays.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The wrenching about of his innards began. No, not hurt exactly, but twist and vex, yes.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Memories (hefelt rather than learned) were laid down as synaptic grit, chemical layers, which held against the random rude abrasions of brain electro-chemistry. Cues for mood changes and memory call-ups snapped into place. The place and time could be rendered real, whenever he wanted. Chemistry of convenience.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;But he could not remember the night sky.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Scrubbed away, it was. Only names—Orion, Sagittarius, An-dromeda—but not the stars themselves. What had that vile voice said about naming them?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Someone had erased this knowledge. It could be used to trace a path to Earth. Who would want to block that?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;No answer.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Nim. He plucked up a buried memory. Nim had worked on Voltaire when Marq was not there.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;And whom did Nim work for? The enigmatic figure of Hari Sel­ don?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Somehow he knew Nim was a hireling of another agency. But there his meshed knowledge faltered. What other forces worked, just beyond his sight?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He sensed large vitalities afoot here. Careful.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He trotted from the hospital, legs devouring the ground. Bouncy. Free! He sped across a digital field of Euclidean grace, bare black sky above.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Here lurked supple creatures, truly eccentric. They did not choose to represent themselves as near-lifelike visions. Nor did they present as Platonic ideals, spheres, or cubes of cognition. These solids re­ volved, some standing on their corners. Spindly triangle-trees sang as winds rubbed them. Even slight frictions sparked bright yellow flares where streamers of hurrying blue mist rubbed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;He strolled among them and enjoyed their oblivious contortions. “The Garden of the Solipsists?” he asked them. “Is this where I am?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;They ignored him, except for a ruby-red ellipsoid of revolution. It split into a laughing set of teeth, then sprouted an enormous phosphorescent green eye. This slowly winked as the teeth gnashed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Voltaire sensed from these moving sculptures a hardness, a radi­ ation from the kernel of Self within each. Somehow each Self had become tight, controlled, sealing out all else.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;What gave him his own sense of Self? His sense of control, of determining his future actions? Yet he could see within himself, watch the workings of deep agencies and programs.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Astounding!” he blurted, as the thought came:\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Because there was no person sitting in his head to make himself do what he wanted (or even an authority to make him want to want) he constructed a Story of Self: that he was inside himself.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Joan of Arc assembled beside him, gleaming in armor. “That spark is your soul,” she said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Voltaire’s eyes widened. He kissed her fervently. “You saved me? Yes? You were the one!”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I did, using powers attached to me. I absorbed them from the dying spirits, which abound in these strange fields.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;At once he looked inside himself and saw two agencies doing battle. One wished to embrace her, to spill out the conflict he felt between his sensual license and his analytical engine of a mind.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The other, ever the philosopher, yearned to engage her Faith in another bout with blithe Reason.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;And why could he not have both? As a mortal, among the em­ bodied, he had been faced with such choices daily. Especially with women.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;After all, he thought, this will be the first time. He could feel the agencies each begin to harvest their own computational resources, like a surge of sugar in the blood from a sweet wine.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;In the same split instant he reached out and parted Joan, running her cognition on two separate tracks. In each they were fully engaged, but at fractional speed. He could live two lives!\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The plane split.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;They split.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Time split.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;9.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;She winked out of the sim-space, away from him, confused.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Somehow she had experienced two conversations at once. Hers and Voltaire’s—the two identities running simultaneously.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;About her, space itself shrank, expanded, warped its contents into bizarre shapes—before lurching at last into concrete objects.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The street corner looked familiar. Still, the white plastiform tables, matching chairs, and tiktok waiters bearing trays to lounging cus-tomers—all that had disappeared. The elegant awning still hung over the sidewalk, imprinted with the name the inn’s waiter, Garçon ADM–213, had taught her how to read: Aux Deux Magots.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Voltaire was banging on the door when Joan materialized beside him. “You’re late,” he said. “I have accomplished marvels in the time that it took you to get here.” He interrupted his assault on the inn door to cup her chin and peer into her upturned face. “Are you all right?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I, I think so.” Joan straightened her clanking suit of mail. “You nearly…lost me.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“My experiment with splitting taught me much.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I…liked it. Like heaven, in a way.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“More like being able to experience each other in a profound manner, I would venture. I discovered that, if we could deliberately seize control of our pleasure systems, we could reproduce the pleasure of success—all without the need for any actual accomplish­ ment.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Heaven, then?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“No, the opposite. That would be the end of everything.” Voltaire retied the satin ribbon at his throat with sharp, decisive jerks.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Faith would have told you as much.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Alas, true.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You have decided to ‘run background’ for only your mind?” she asked demurely—though proud to have pried an admission for virtue from him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“For the moment. I am running both of us with only rudimentary bodies. Yet you shall not notice it, for you shall be quite—” he lifted an eyebrow “—high-minded about matters.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“I am relieved. One’s reputation is like one’s chastity.” Was chaste St. Catherine right? Had Voltaire ruined hers? “Once gone, it cannot be restored.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Thank heaven for that! You have no idea how tedious it is to make love to a virgin.” He added hastily, in response to her reproach­ ful look, “I know of only one exception to that rule,” and gave her a courteous bow.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Joan said, “The café appears closed.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Nonsense. Paris café never close; they are rooms of public rest.” He resumed rapping on the door.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“By public restroom, do you mean an inn?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Voltaire stopped knocking and eyed her. “Public restrooms are facilities in which people relieve themselves.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Joan blushed, envisioning a row of holes dug in the ground. “But why call it a restroom?”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“As long as man is ashamed of his natural functions, he will call it anything but what it is. People fear their hidden selves, afraid that they will burst out.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“But I can see all of myself now.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“True. But in real folk, such as we were, subprograms others cannot see run simultaneously beneath the surface thoughts. Like your voices.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;Joan bristled. “My voices are divine! Musics of archangels and saints!”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“You appear to have occasional access to your subprograms. Many real—that is, embodied—people do not. Especially if the subprograms are unacceptable.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;“Unacceptable? To whom?” \u003c/p\u003e","sourceLink":"https://allnovel.net/foundation-s-fear-second-foundation-trilogy-1/page-42.html","bookId":1697,"creation":"Oct 5, 2019 9:57:11 AM","modification":"Oct 5, 2019 9:57:11 AM"}
