{"id":51161,"no":13,"title":"Chapter 13 - A Silent Song for the Dead","content":"\u003cp\u003e\u003cstrong\u003eChapter 13 - A Silent Song for the Dead\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eApril 18. Night.\u003c/p\u003e\n\u003cp\u003eAs Ingot sat in Big Boss Tang’s luxurious abode dining on delicious food and alcohol, Xiao Jun also was eating. He sat at a roadside stall, illuminated by a single lamp, eating a dish egg and onion stir-fried in lard.\u003c/p\u003e\n\u003cp\u003eEveryone must eat, regardless of whether they want to or not. If you don’t eat, you die.\u003c/p\u003e\n\u003cp\u003eThere are many things in the world like this, things you have to do whether you want to or not.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eXiao Jun was not a picky eater. As long as something was edible, he would eat it. Most of the time, he didn’t notice the flavor of the food, and often, he didn’t even know what it was he ate.\u003c/p\u003e\n\u003cp\u003eThis was because he was unlike most people in the world. Usually, when people’s mouths are in motion, their brains are not.\u003c/p\u003e\n\u003cp\u003eBut Xiao Jun was different.\u003c/p\u003e\n\u003cp\u003eWhen he ate, he would think of many things, many questions. Right now, he was thinking about a very strange question.\u003c/p\u003e\n\u003cp\u003eHe couldn’t stop from thinking: “Why am I not dead?”\u003c/p\u003e\n\u003cp\u003eFrom the previous night up until this moment, he had thought about this question over and over again, because in truth, he should have been dead.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eThe second time the lanterns had simultaneously been extinguished at As You Wish Gambling Hall, he had been holding a master-crafted, refined steel short sword modeled after “Fish Intestines,” one foot three inches long. [1]\u003c/p\u003e\n\u003cp\u003eIn that fleeting moment, his body had already flown forward approximately three and a half meters. Wu Tao’s throat should have been right there, in the same position as his sword. He had already calculated its precise distance and position.\u003c/p\u003e\n\u003cp\u003eHis calculations were always extremely precise.\u003c/p\u003e\n\u003cp\u003eThe speed of his movement and sword could not be matched by anyone.\u003c/p\u003e\n\u003cp\u003eOf course, the sword attack contained secondary elements. As it stabbed forth, the power of the sword suppressed the movements of everyone within a radius six meters.\u003c/p\u003e\n\u003cp\u003eHe put all the power, knowledge, experience and skill of a lifetime into this attack.\u003c/p\u003e\n\u003cp\u003eBut the sword was empty.\u003c/p\u003e\n\u003cp\u003eEverything within the range of the attack was empty, completely empty. There was nothing. No light, no ability, no reaction, no result, absolutely nothing.\u003c/p\u003e\n\u003cp\u003eIn that moment, Xiao Jun felt as if he were falling off of a building hundreds of meters tall, straight into a state of complete despair, a state of absolute powerlessness.\u003c/p\u003e\n\u003cp\u003eThe most frightening thing was…\u003c/p\u003e\n\u003cp\u003eHis own power seemed to have been emptied. It was as if some incomprehensible, impossible to resist force had sucked him dry.\u003c/p\u003e\n\u003cp\u003eAt that moment, even a child could have knocked him over.\u003c/p\u003e\n\u003cp\u003eHe had never experienced such a feeling before.\u003c/p\u003e\n\u003cp\u003eHe now knew that he had encountered an unprecedentedly fearsome opponent, someone more frightening than anything which could appear in a person’s worst nightmares.\u003c/p\u003e\n\u003cp\u003eEven more horrifying, he could sense that this person had already sent a fatal attack flying towards him.\u003c/p\u003e\n\u003cp\u003eHe could not not resist or evade.\u003c/p\u003e\n\u003cp\u003eHe had developed his power and skill for many years, had gained wisdom and experience through countless life-and-death battles. Yet suddenly, he had become empty, completely ineffective.\u003c/p\u003e\n\u003cp\u003eIn that moment, there was only one thing he could do. Wait for death.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eBut he didn’t die.\u003c/p\u003e\n\u003cp\u003eAs the fatal strike approached, its aura of death completely suppressed his movement and breathing, and he knew beyond a doubt that he would die. And then, suddenly, someone saved him. A hand saved him.\u003c/p\u003e\n\u003cp\u003eThe hand was like wind, a wind from nowhere, a hand from nowhere.\u003c/p\u003e\n\u003cp\u003eThe hand stretched out from an incomprehensible, mysterious direction to grasp his shoulder, filling him with impossible power.\u003c/p\u003e\n\u003cp\u003eHis body flew into the air, avoiding the deadly attack.\u003c/p\u003e\n\u003cp\u003eWhen he descended, he had no idea of his position. The only thing he could hear was rushing wind coming from all directions.\u003c/p\u003e\n\u003cp\u003e—The sound of sleeves rustling, concealed weapons flying, blade edges slashing, and shouts and cries both miserable, shrill and horrific. [2]\u003c/p\u003e\n\u003cp\u003eNo one could possibly describe the sounds he heard.\u003c/p\u003e\n\u003cp\u003eUnless you heard them with your own ears, you would have no way to imagine what they sounded like.\u003c/p\u003e\n\u003cp\u003eAnd if you did hear them, you would never be able to forget them for the rest of your life.\u003c/p\u003e\n\u003cp\u003eXiao Jun felt himself about ready to vomit.\u003c/p\u003e\n\u003cp\u003eBut he did not vomit. Because the sounds all suddenly ceased, and then three laughs rang out.\u003c/p\u003e\n\u003cp\u003eEverything became deathly still. The resplendent, brilliant, bustling hall had suddenly turned into a tomb.\u003c/p\u003e\n\u003cp\u003eLuckily, Xiao Jun’s heart still beat.\u003c/p\u003e\n\u003cp\u003eHe could hear it: “thump, thump, thump.” It thumped for a long time, and then suddenly a flame bloomed to life in the darkness, a flame booklet.\u003c/p\u003e\n\u003cp\u003eThe flame booklet was in Frogboy’s hand.\u003c/p\u003e\n\u003cp\u003eHe sat in the same position as before. It seemed as if he had’t moved at all, or maybe couldn’t.\u003c/p\u003e\n\u003cp\u003eThere was someone new next to him.\u003c/p\u003e\n\u003cp\u003eAt some point, Old Master Tian had come to sit in the chair next to him. He sat there strumming a sanxian, a sanxian that produced no noise.\u003c/p\u003e\n\u003cp\u003eA noiseless sanxian, whose strings had been broken.\u003c/p\u003e\n\u003cp\u003e—A noiseless sanxian, and a fading old man; the sound of a noiseless sanxian is more desolate than any other sound in the world.\u003c/p\u003e\n\u003cp\u003eHis fingers played the sound of a funeral song.\u003c/p\u003e\n\u003cp\u003eBut the melody of the funeral sound could not be heard, because he never had any intention of letting anyone hear.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eFrogboy lit a lantern, the one that Wu Tao had just moments ago grabbed down.\u003c/p\u003e\n\u003cp\u003eAs the lantern light spread, he caught sight of Xiao Jun.\u003c/p\u003e\n\u003cp\u003eBut Xiao Jun wasn’t looking at him. Xiao Ju was looking at the people on the ground.\u003c/p\u003e\n\u003cp\u003eDai Tianchou, Tu Qu’e, and President Jin all lay on the ground, not breathing, their bodies growing cold.\u003c/p\u003e\n\u003cp\u003eDai Tianchou’s Thirteen Officials Virgin kung fu, trained over the course of years and years, had been broken. Although, his Golden Iron Bell mail tunic, impervious to blades and spears, had not been broken.\u003c/p\u003e\n\u003cp\u003eBut he bled. Blood streamed from a spot behind his left ear.\u003c/p\u003e\n\u003cp\u003eThat area was his Achille’s heal, the only weak spot on his entire body, and also his greatest secret.\u003c/p\u003e\n\u003cp\u003eA person who practiced that type of kung fu would never reveal their Achille’s heal to anyone.\u003c/p\u003e\n\u003cp\u003eHow could the secret have been known to the person who killed him?\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eThe hall had previously been lit by one hundred and ninety-six lanterns, but now, it was lit by only one.\u003c/p\u003e\n\u003cp\u003eThe gloomy light shone onto Xiao Jun’s face, as well as onto the faces of the eight bodies on the ground.\u003c/p\u003e\n\u003cp\u003eOther than the three just mentioned, five more corpses could be seen, four of whom Xiao Jun recognized. All of them were top experts of the martial world, including great heroes and great villains.\u003c/p\u003e\n\u003cp\u003eEvery one of them had surely come to take someone’s life, but now their lives had been taken by that someone.\u003c/p\u003e\n\u003cp\u003eEvery one had been killed by a single deadly blow, and all of their faces were twisted with horror.\u003c/p\u003e\n\u003cp\u003eNone of them had ever imagined that they would die in such a tragic fashion.\u003c/p\u003e\n\u003cp\u003eFrogboy sighed.\u003c/p\u003e\n\u003cp\u003e“I was counting the whole time,” he said. “From the moment the lights went out until just now when I lit my flame booklet, I only was able to count from ‘one’ to ‘eighty-eight.’”\u003c/p\u003e\n\u003cp\u003eA kung fu which could take the lives of eight martial world experts in such a short time, was truly terrifying.\u003c/p\u003e\n\u003cp\u003eThe killer had already departed.\u003c/p\u003e\n\u003cp\u003eWu Tao had already departed.\u003c/p\u003e\n\u003cp\u003eA fatal blow, eight heroes dead, three laughs, then, away with the breeze. What kind of skill was this? What spirit?\u003c/p\u003e\n\u003cp\u003eFrogboy looked at Xiao Jun, then sighed.\u003c/p\u003e\n\u003cp\u003e“I’m only alive because of my father,” he said. “What about you? I had assumed you would be the first to die, how come you aren’t?”\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eThat was the question Xiao Jun just couldn’t figure out the answer to.\u003c/p\u003e\n\u003cp\u003e—Why wasn’t he dead? Who had saved him? Why had that person saved him?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNot a small amount of alcohol had been consumed. Big Boss Tang’s cheeks were flushed the color of a pale rouge, and her eyes shown even more brightly than before.\u003c/p\u003e\n\u003cp\u003eShe sighed softly, then told Ingot:\u003c/p\u003e\n\u003cp\u003e“Therefore, we’ve prepared to stop business for half a month, starting today. We will completely redecorate the main hall. Gamblers are generally very superstitious. Who would dare to gamble in a place where eight people died in a split second?”\u003c/p\u003e\n\u003cp\u003e“So, eight people died. Other than Dai Tianchou, Tu Qu’e and President Jin, who else died? Who were the other five people?”\u003c/p\u003e\n\u003cp\u003e“I’m not too sure,” said Big Boss Tang. “I heard that one was a Mr. Su Zhong from Wudang Sword school, one was a martial uncle of Qiu Budao and another was one of the highest ranking members of Shaolin’s secular disciples.” She sighed. “Whoever killed eight experts of that level in an instant, must have extremely powerful martial arts and ruthless skill. It’s really frightening.”\u003c/p\u003e\n\u003cp\u003eIngot slapped the table with his palm.\u003c/p\u003e\n\u003cp\u003e“I don’t believe it,” he cried. “Beat me to death, and I still won’t believe it.”\u003c/p\u003e\n\u003cp\u003e“What don’t you believe?”\u003c/p\u003e\n\u003cp\u003e“I don’t believe that they were all killed by Wu Tao,” he said. “He’s just not that wicked and merciless.”\u003c/p\u003e\n\u003cp\u003e“Other than him, who could it be?” said Big Boss Tang. “Who else has such fearsome kung fu?”\u003c/p\u003e\n\u003cp\u003e“If I could examine the eight corpses, perhaps I would be able to see.”\u003c/p\u003e\n\u003cp\u003e“See what?”\u003c/p\u003e\n\u003cp\u003e“See what method the killer used. Was it really Wu Tao’s technique? In any case, no one could see anything. Whoever did kill them could easily shift the blame to Wu Tao, turn him into a scapegoat.”\u003c/p\u003e\n\u003cp\u003e“That does make sense,” said Big Boss Tang. “Sadly, you can’t examine the corpses.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because Old Master Tian already took them away. They’ve already been placed in coffins and sealed up. Nobody can examine them.”\u003c/p\u003e\n\u003cp\u003eIngot’s big eyes suddenly narrowed, as if he were plotting something.\u003c/p\u003e\n\u003cp\u003e“Why would Old Master Tian be in such a hurry to take the bodies away? Could it be he feared someone would find out that not all of the fatal injuries were caused by Wu Tao? Perhaps he intentionally notified the friends and family of the various victims, with the purpose of sending them after Wu Tao for revenge?”\u003c/p\u003e\n\u003cp\u003eBig Boss Tang laughed, looking at Ingot with eyes as clear as spring water. She raised a glass to him and drank.\u003c/p\u003e\n\u003cp\u003e“You might not be very old, but you’re exceedingly clever. How could you possibly think up an idea like that? Furthermore, with his reputation, how could Old Master Tian do such a thing?”\u003c/p\u003e\n\u003cp\u003e“Why couldn’t he?” said Ingot. “Who knows whether or not some of his own enemies were among the eight killed. Maybe he took advantage of the situation to kill them.” He thought for a moment. “I was brought here by Gao Tianjue, so he was there at the time, too. Who knows whether or not he was the killer? With his martial arts, it wouldn’t be difficult to kill eight people. Maybe Old Master Tian and he are friends, and yet Old Master Tian fears him. And that’s why he did it.”\u003c/p\u003e\n\u003cp\u003eBig Boss Tang stared at Ingot for a long moment, then suddenly asked him: “Are you really only seventeen or eighteen?”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003e“Looking at you, you do seem to be seventeen or eighteen, but sometimes I feel like you’re actually a seventy- or eighty-year-old man.”\u003c/p\u003e\n\u003cp\u003e“Why’s that?”\u003c/p\u003e\n\u003cp\u003e“Because only old men have such suspicious frames of mind.”\u003c/p\u003e\n\u003cp\u003eIngot stared back at her for a long moment, lowered his voice, then quietly said, “Can I tell you a secret?”\u003c/p\u003e\n\u003cp\u003e“What secret?”\u003c/p\u003e\n\u003cp\u003e“Actually, I’m already seventy-seven.” His expression was quite serious. “I’ve just taken really good care of myself, so I look much younger.”\u003c/p\u003e\n\u003cp\u003eBig Boss Tang laughed, and with a curved smile said, “In that case, this old granny will have to toast you a few more times.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe bodies had been placed in coffins and sealed. Now the woodshed in the back of “Forest Memory” lumber yard had eight more coffins.\u003c/p\u003e\n\u003cp\u003eOld Master Tian had been keeping guard there from morning until the sky grew dark. He did not eat a grain of rice nor drink a drop of water or alcohol. Nor did he speak.\u003c/p\u003e\n\u003cp\u003eFrogboy had never seen his father in such a serious mood.\u003c/p\u003e\n\u003cp\u003eFinally, when the night was exceedingly dark, people came to light the lanterns. Old Master Tian asked Frogboy, “Could you see how they died?”\u003c/p\u003e\n\u003cp\u003e“Somewhat,” said Frogboy. “Each one was killed by a single fatal blow. The technique used was bizarre. It instantly hardened and then burst their arteries and Qi channels, the same way a person might smash a piece of charcoal between their fingers.”\u003c/p\u003e\n\u003cp\u003e“Could you tell which technique this person used?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t. I’ve seen many people dead from crushed arteries and Qi channels, but I’ve never seen a technique like this before.”\u003c/p\u003e\n\u003cp\u003e“Of course you haven’t.” Old Master Tian sighed. “Because only one person under heaven uses a deadly technique like this.”\u003c/p\u003e\n\u003cp\u003e“Is it General Li?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“If not him, then who?”\u003c/p\u003e\n\u003cp\u003e“A person more fearsome than him,” said Old Master Tian. “More fierce, more ruthless, more extreme in action.”\u003c/p\u003e\n\u003cp\u003e“Who is more extreme than General Li?”\u003c/p\u003e\n\u003cp\u003e“Gao Tianjue.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 4\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA remote lane, a ramshackle meal stall, a flickering oil lamp. An old man, his face long since darkened by the smoke of the oil lamp, looked at Xiao Jun, who had just finished his bowl of fried eggs. With a tone of partial sympathy, he asked, “Would you like a bowl of broth? On the house.”\u003c/p\u003e\n\u003cp\u003eXiao Jun shook his head and slowly stood up. His colorless, expressionless face suddenly shone with a look of fear and astonishment.\u003c/p\u003e\n\u003cp\u003eIf you didn’t see it yourself, you would probably never think that a person’s face could change in such a way.\u003c/p\u003e\n\u003cp\u003eBut the old man saw.\u003c/p\u003e\n\u003cp\u003eHe couldn’t imagine what would cause this one-armed man’s face to change, this man who spoke so strangely and ate so slowly.\u003c/p\u003e\n\u003cp\u003eBut it did not take long for him to understand why. He turned his head and saw the same thing that Xiao Jun saw, something that would frighten the wits out of anyone.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eMoments ago, the area around the lonely food stand didn’t even contain the shadow of a ghost. But now, there was a person there.\u003c/p\u003e\n\u003cp\u003eThe person wore black. A black cloak, a black scarf, black boots, and black eyes.\u003c/p\u003e\n\u003cp\u003eThis black was not a normal black.\u003c/p\u003e\n\u003cp\u003eShining like lacquer, denser than ink, this black was like the joyless black of the sky in the moments before the breaking of dawn.\u003c/p\u003e\n\u003cp\u003eHis long black cloak hung to the ground, just like the dark cloak of the oft-referred to blood-sucking demons.\u003c/p\u003e\n\u003cp\u003eBut his face was white.\u003c/p\u003e\n\u003cp\u003eNot a normal white, and not the pale, deathly white of Xiao Jun’s face.\u003c/p\u003e\n\u003cp\u003eHis face was more horrifying than the face of a corpse.\u003c/p\u003e\n\u003cp\u003eIt was a pale, silvery color, as if he wore a silver masked forged in the fires of hell. It shone.\u003c/p\u003e\n\u003cp\u003eBut not a normal shine.\u003c/p\u003e\n\u003cp\u003eThis was a dim, flickering shine, like the shine in the eyes of a person as they approached death. Though bright, it carried with it a feeling of pain, torment, fear and hopelessness.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eIt was impossible to tell when this person arrived, or whey they had come from.\u003c/p\u003e\n\u003cp\u003ePerhaps only Xiao Jun knew.\u003c/p\u003e\n\u003cp\u003eIt seemed as if he recognized this person. He looked like a child who had suddenly run into a demon who constantly plagued his nightmares. It appeared as if his throat were being clutched by the hands of a demon. It took him a long time to speak.\u003c/p\u003e\n\u003cp\u003e“It’s you?”\u003c/p\u003e\n\u003cp\u003e“It’s me.” It seemed as if the person were laughing. “I’m surprised that you remember me.”\u003c/p\u003e\n\u003cp\u003eXiao Jun definitely recognized this person. Even though he had only seen him once, he would never be able to forget him.\u003c/p\u003e\n\u003cp\u003eAnyone would remember this person after seeing him only once, but as for Xiao Jun, his memories was deeper and more painful than anyone else’s.\u003c/p\u003e\n\u003cp\u003eIt was something that had happened a dozen or more years ago.\u003c/p\u003e\n\u003cp\u003eXiao Jun remembered it more clearly than anyone. It was the night of the full moon, thirteen years and three days ago.\u003c/p\u003e\n\u003cp\u003eThat night, the moonlight shone mirror-like, and the cold night air cut like a knife.\u003c/p\u003e\n\u003cp\u003eHe saw a blade that he had never seen before, or rather, the flash of a blade.\u003c/p\u003e\n\u003cp\u003eThe instant that blade flashed, his left arm was lopped off.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eXiao Jun never found out who that person was, or why they had severed his arm.\u003c/p\u003e\n\u003cp\u003eHe had never seen that person before that night, and never saw them again. And he’d never imagined that he would see him standing in front of him now.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003e[1] Fish Intestines was the name of a sword used by the famous historical assassin Zhuan Zhu. It was called Fish Intestines because he hid it inside a fish during a banquet when he killed King Liao of the Wu State. Zhuan Zhu: \u003ca href\u003d\"http://tinyurl.com/odrgsbn\" target\u003d\"_blank\"\u003ehttp://tinyurl.com/odrgsbn\u003c/a\u003e. Click the link and scroll down to see an artists rendering of it: \u003ca href\u003d\"http://tinyurl.com/nmnfc8d\" target\u003d\"_blank\"\u003ehttp://tinyurl.com/nmnfc8d\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e[2] Gu Long does something here in Chinese which generally you don’t do in English writing, and that is he uses a TON of adjectives. Here’s the literal translation: “and the sound of hoarse, sad, shrill, miserable, fierce, brutal, and ruthless shouts and shrieks and bawls.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-12\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-14\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/dragon-king-with-seven-stars/dkss-chapter-13","bookId":1502,"creation":"Sep 10, 2019 4:16:47 AM","modification":"Sep 10, 2019 4:16:47 AM"}
