{"id":51152,"no":4,"title":"Chapter 4 - An Old Man Playing a Sanxian","content":"\u003cp\u003e\u003cstrong\u003eChapter 4 - An Old Man Playing a Sanxian\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 1 [1]\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eApril 16th. Night.\u003c/p\u003e\n\u003cp\u003eA clandestine search expanded underneath the curtain of night. The number of people carrying out the investigation exceeded that which might have been mustered by the Governor of Jinan Prefecture himself. They included Sun Jicheng’s bodyguard retainer, the employees of his many businesses, and their friends and family. Each person was intimately familiar with Jinan; every tea house, wine shop, inn and brothel lay within their realm of their influence.\u003c/p\u003e\n\u003cp\u003eAs of now, Wu Tao, as drunk as mud, had already been taken back into a small resting room by one of the waiters.\u003c/p\u003e\n\u003cp\u003eIngot hadn’t left either, because he was drunk, definitely drunk. The two of them were unconscious and covered with vomit.\u003c/p\u003e\n\u003cp\u003eThe person in charge of inspecting this area was the Assistant Manager of Sun Jicheng’s “Open Source Money Lending” business, Yang Kedong.\u003c/p\u003e\n\u003cp\u003eAble and efficient, as well as eloquent, he found himself at a loss when he encountered the drunk Wu Tao. He couldn’t even think of a single thing to say.\u003c/p\u003e\n\u003cp\u003eA drunk like Wu Tao was of little importance; a truly important person would never allow themselves to get into such a state, especially with a young beggar.\u003c/p\u003e\n\u003cp\u003eSo Yang Kedong chose to ignore them.\u003c/p\u003e\n\u003cp\u003eAnd yet, he had to continue his investigation. It seemed that he would have no opportunity to go back and sleep this night; his new bride would have to wait alone in bed all night for him.\u003c/p\u003e\n\u003cp\u003eHe grumbled a bit in his heart. He didn’t understand; Big Boss Sun’s death was obviously a crime of passion, and the perpetrator had taken his own life. Whoever had organized this investigation wanted him to come and claim responsibility again?\u003c/p\u003e\n\u003cp\u003eWhat Yang Kedong found even more confusing was, what did strangers who had arrived in Jinan this day have anything to do with Big Boss Sun’s death?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNo one could figure out the answer to the question posed by the man in bluish-green, so even though it hit the nail on the head, it had actually been asked in vain.\u003c/p\u003e\n\u003cp\u003eFrogboy stood up patted the coffins. “Are there really bodies inside?” he asked.\u003c/p\u003e\n\u003cp\u003e“There are.”\u003c/p\u003e\n\u003cp\u003e“Are they friends of yours?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then who are they?”\u003c/p\u003e\n\u003cp\u003e“I don’t recognize them,” said the man in bluish-green. “Not even one of them.”\u003c/p\u003e\n\u003cp\u003eFrogboy looked shocked.\u003c/p\u003e\n\u003cp\u003e“You don’t recognize them?” he asked. “Then what were you doing with them?”\u003c/p\u003e\n\u003cp\u003e“Bringing them to you.”\u003c/p\u003e\n\u003cp\u003eFrogboy looked at him in amazement. It seemed his eyes might fall out of his head, so shocked was he.\u003c/p\u003e\n\u003cp\u003e“You went out of your way to buy five coffins for people you didn’t even recognize, to give to me?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eFrogboy looked like he might faint at any moment. He rushed over and downed a bowl of alcohol; he drank so quickly that the last mouthful almost poured out of his nose.\u003c/p\u003e\n\u003cp\u003eAnd then, he let out a loud laugh. “If I didn’t know you, I would definitely kick you out.”\u003c/p\u003e\n\u003cp\u003eThat was his usual method of dealing with crazies.\u003c/p\u003e\n\u003cp\u003eBut the man in bluish-green was no crazy, nor was he drunk.\u003c/p\u003e\n\u003cp\u003eHe seemed much more sober than the average person of the world, and seeing him this way, Frogboy couldn’t laugh any more. “Why are you giving them to me?”\u003c/p\u003e\n\u003cp\u003eLooking very serious, the man in bluish-green said, “I want you to take a look at them and see who they are, and how they died.”\u003c/p\u003e\n\u003cp\u003eThe coffins had not been sealed.\u003c/p\u003e\n\u003cp\u003eFrogboy’s expression changed after he took a look the bodies inside, and their fatal wounds. He looked both solemn and astonished.\u003c/p\u003e\n\u003cp\u003e“What did you see?” asked the man in bluish-green.\u003c/p\u003e\n\u003cp\u003eFrogboy shook his head, continuously. After quite some time had passed, he softly murmured, “I can’t quite tell, not for sure.”\u003c/p\u003e\n\u003cp\u003eHe suddenly clapped his hands loudly, summoning a well-groomed young man, to whom he asked, “Where is my father?”\u003c/p\u003e\n\u003cp\u003e“This morning, Master was in a poor mood,” said the young man. “He went out alone, and refused to allow anyone to accompany him. No one knows where he went.”\u003c/p\u003e\n\u003cp\u003eThe current leader of the Flowered Flag Sect, Old Master Tian Yonghua, one of the few remaining of the elder generation of the martial world, would usually hide away in an unknown location when in a bad mood.\u003c/p\u003e\n\u003cp\u003eNobody knew where he hid himself, except for Frogboy. The man in bluish-green immediately asked him, “Can you take me with you?”\u003c/p\u003e\n\u003cp\u003e“No, nobody can. Although, this time…” Frogboy looked at the bodies in the coffin and then let out a long sigh. “It seems this time I must make an exception.”\u003c/p\u003e\n\u003cp\u003eThe man in bluish-green slowly stood up and turned his head to face Old Condor Wang, who had been staring at the back of his head the entire time. “You picked the wrong place,” he said coolly.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003eHe pointed at the back of his own head. “This place is bad. Really bad.”\u003c/p\u003e\n\u003cp\u003eThe Condor’s expression changed, his pupils constricted.\u003c/p\u003e\n\u003cp\u003eJust now he’d flown out of the window for no reason. He was already angry with this pale-faced one-armed man, and the “Three Kings of Huainan” had poor tempers to being with.\u003c/p\u003e\n\u003cp\u003eClenching his fist, he asked, “What’s so bad about it?”\u003c/p\u003e\n\u003cp\u003e“Judging from your posture just now as you gathered your Qi, you were preparing a stance from your Eagle Claw Sect’s ‘Divine Thirteen Eagle Claws’ to attack me, namely ‘Tiger Contending Form.’”\u003c/p\u003e\n\u003cp\u003eOld Condor Wang laughed coldly. “Using that stance to attack is already showing you a lot of respect.”\u003c/p\u003e\n\u003cp\u003e“Fortunately, you didn’t actually attack, otherwise…”\u003c/p\u003e\n\u003cp\u003e“Otherwise what?”\u003c/p\u003e\n\u003cp\u003eHis face expressionless, his eyes again settling off into the distance, his body suddenly spun agilely. A single arm shot out lightly, from an angle no one could ever have predicted. In the middle of the attack, his hand’s form suddenly changed.\u003c/p\u003e\n\u003cp\u003eHe didn’t touch Old Condor Wang, and yet the old man acted as though he had actually been struck. His swarthy, emaciated face turned as pale as death. Some time passed before he finally asked, “Who are you?”\u003c/p\u003e\n\u003cp\u003e“I’m surnamed Xiao,” said the man in bluish-green. “As in the expression, ‘Desolate Whistling Sword Qi.’” [3]\u003c/p\u003e\n\u003cp\u003eOld Wang impulsively took a step backwards. “Are you the Beggar Sect’s new Torture Chamber Lord, Xiao Jun?” [3]\u003c/p\u003e\n\u003cp\u003e“Yes, that’s me.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBy this time, Wu Tao and the young beggar called “Ingot” were fast asleep in the little room behind the wine shop. Dead asleep.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 4\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBehind the wine shop lay a short street. Short, narrow, stinky and dirty — When summer came, it seemed as if all the flies and mosquitos in all of Jinan congregated there.\u003c/p\u003e\n\u003cp\u003eOther than the flies and mosquitos, people would congregate there too.\u003c/p\u003e\n\u003cp\u003ePeople who others looked down upon in the same way they did flies and mosquitos.\u003c/p\u003e\n\u003cp\u003eLining either side of the short street were several rundown wooden shacks, providing the city’s cheapest alcohol and women, twenty-four hours a day. Come nightfall, the air would be filled with all sorts of offensive and noisy sounds.\u003c/p\u003e\n\u003cp\u003eBut this night, on that street’s most dark and gloomy corner, from within the most rundown of the shacks, floated out an ancient and desolate sanxian tune. [4]\u003c/p\u003e\n\u003cp\u003e—Upon hearing this music, everyone on the street knew that “Old Sister’s” weird old customer had returned.\u003c/p\u003e\n\u003cp\u003eOld Sister had once been called “Skylark.” Not only had she been as beautiful as a skylark, she had also sang as sweetly as one.\u003c/p\u003e\n\u003cp\u003eBut that was thirty years ago.\u003c/p\u003e\n\u003cp\u003eThirty merciless years had worn her down. She who had in former years been the beauty of the town, was now a scary old woman.\u003c/p\u003e\n\u003cp\u003eFewer and fewer customers sought after her wrinkled face. In fact, as of this year, she had no customers at all other than this weird old man.\u003c/p\u003e\n\u003cp\u003eBut she had nowhere else to go. So, like a broken chrysanthemum, she stayed here, in the darkest corner of this short street, waiting to wither and drop to the ground.\u003c/p\u003e\n\u003cp\u003ePerhaps the only reason she kept on living was because of this one devoted customer.\u003c/p\u003e\n\u003cp\u003eAn old man who loved to play the sanxian.\u003c/p\u003e\n\u003cp\u003eNo one knew who he was, and no one asked. But behind his back, they all called him “Old Sister’s little old man.”\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eThe old man played a bleak, ancient song on the sanxian, accompanied by Old Sister’s hoarse, sad singing.\u003c/p\u003e\n\u003cp\u003eThe dark, shabby room filled with an unspeakable feeling of helpless distress, and yet, it also contained a certain kind of tranquility.\u003c/p\u003e\n\u003cp\u003eThey both were aged; the beautiful woman past her prime, the hero’s hair white. All of the joys and glories and stimulations in life had nothing to do with them any more.\u003c/p\u003e\n\u003cp\u003eThey had no need whatsoever to contend with others for those types of things.\u003c/p\u003e\n\u003cp\u003eBeneath the flickering lamplight, the old man gently plucked the strings of the sanxian. He listened to the sad lyrics sung by his partner, and the night seemed endless, morning, far far away. His face, marked by endless years of agonizing experiences and countless sufferings, suddenly shone with an expression you might see on a boy sleeping in his mother’s arms.\u003c/p\u003e\n\u003cp\u003eOnly here could he experience this kind of feeling.\u003c/p\u003e\n\u003cp\u003eOnly here could he experience true relaxation.\u003c/p\u003e\n\u003cp\u003eThat was because no one here knew him. No one knew that in the past he had been the famous “Flowered Flag” Tian Yonghua, of the “Four Great Banners Sect.”\u003c/p\u003e\n\u003cp\u003eNo one knew, except Frogboy.\u003c/p\u003e\n\u003cp\u003eThe old man suddenly put down the sanxian and sighed. “I knew that little brat would show up here one of these days.”\u003c/p\u003e\n\u003cp\u003e“Which little brat?” asked Old Sister.\u003c/p\u003e\n\u003cp\u003e“Other than my kid, who could it be?”\u003c/p\u003e\n\u003cp\u003eOld Sister laughed, and underneath the dim lamp light, her smile seemed to still cary some of the charm it had all those years ago.\u003c/p\u003e\n\u003cp\u003e“How do you know the Young Master is here?” she asked.\u003c/p\u003e\n\u003cp\u003e“If I didn’t know, who could?” said the Old Master. “Is there anything in the world this old man doesn’t know?”\u003c/p\u003e\n\u003cp\u003e“There is,” came Frogboy’s voice from outside. “I’m willing to bet there is.” He chuckled. “I’m willing to bet you, old man. Bet that you don’t know who I have with me.”\u003c/p\u003e\n\u003cp\u003e“Who do you have with you?”\u003c/p\u003e\n\u003cp\u003e“One living man, and five dead men. The living one is here to see you, and the dead ones are here to request that the Old Master see them.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 5\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBehind the dilapidated shack was a high wall. And behind the wall could be found one of the city’s famous haunted mansions.\u003c/p\u003e\n\u003cp\u003eA haunted mansion frequented by ghosts.\u003c/p\u003e\n\u003cp\u003eThe cold and dismal courtyard in the back of the haunted mansion grew thick with weeds; moss covered the stone pathways. The five coffins had been placed in a small eight-sided pavilion in the back of the courtyard. Two oil lamps swayed in the wind. From a distance, you might think they were will-o-the-wisps.\u003c/p\u003e\n\u003cp\u003e—Tomorrow, people would certainly claim to have seen ghosts here.\u003c/p\u003e\n\u003cp\u003eFrogboy and Xiao Jun each held a lamp as they stood on either side of the Old Master. The lamplight shone on their faces as it did the corpses.\u003c/p\u003e\n\u003cp\u003eThe Old Master’s face suddenly twisted. He turned to look at Xiao Jun. “You brought these people here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Where did you find them?”\u003c/p\u003e\n\u003cp\u003e“In a forest…” Xiao Jun used the most concise wording to explain what had happened. He knew that Old Master Tian hated people who yammered on and on.\u003c/p\u003e\n\u003cp\u003eAs Old Master Tian listened to Xiao Jun speak, he continued to stare at Goiter-man’s face. When Xiao Jun finished, he let out a long sigh. Speaking to Goiter-man, he said, “Niu Baozhu, Boss Niu, I haven’t seen you for twenty years. Who would have thought that the little bead on your neck had turned into a big ball.”\u003c/p\u003e\n\u003cp\u003eFrogboy looked at Xiao Jun, and Xiao Jun looked back at him. With exactly the same shocked tone, they both said, “This is the famous Northeast China bandit, Three Panthers Niu?”\u003c/p\u003e\n\u003cp\u003e“Yes, it is,” said the Old Master. “A bead on his neck, a blade at his side, a head hanging from the blade. He’s definitely Niu Baozhu, also known as Three Panthers Niu. Twenty years ago, anyone who tried to capture him would find their head hanging from his blade.”\u003c/p\u003e\n\u003cp\u003e“He was a friend of yours?”\u003c/p\u003e\n\u003cp\u003e“No,” said Old Master Tian. “But he wasn’t my enemy either.” He sighed. “Because I only have one head, and I didn’t want it hanging from his sword.”\u003c/p\u003e\n\u003cp\u003e“His martial arts were really that powerful?”\u003c/p\u003e\n\u003cp\u003e“His martial arts might have been even more powerful than they were rumored to be. And he might not have been as evil as people said he was. Even if he drank three hundred bottles of alcohol, he wouldn’t try to steal some silver from a young beggar. Nor would he dress up as an eighth-rate bandit.”\u003c/p\u003e\n\u003cp\u003e“But that is what happened.”\u003c/p\u003e\n\u003cp\u003e“He must have done it for some other reason.”\u003c/p\u003e\n\u003cp\u003e“Such as what?”\u003c/p\u003e\n\u003cp\u003e“That young beggar definitely is no ordinary beggar,” said the Old Master. “Perhaps he isn’t even a beggar at all.”\u003c/p\u003e\n\u003cp\u003e“Perhaps the merchant whose coin purse he stole isn’t a real merchant either.\u003c/p\u003e\n\u003cp\u003e“Very likely.”\u003c/p\u003e\n\u003cp\u003eLooking at Frogboy, Xiao Jun asked, “Can you find them?”\u003c/p\u003e\n\u003cp\u003e“If they’re in the city, then of course I can find them.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“If I start now, I can find them before daybreak.”\u003c/p\u003e\n\u003cp\u003e“Then you had better send your men out immediately.”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003e[1] A sanxian is a traditional Chinese instrument somewhat similar to a banjo. http://tinyurl.com/pxfozs8\u003c/p\u003e\n\u003cp\u003e[2] His surname Xiao literally means desolate or dreary. And yes this is the same Xiao as Xiao Leixue from Heroes Shed No Tears (although there is not connection between them.)\u003c/p\u003e\n\u003cp\u003e[3] This Jun means hard or severe. The funny thing is that it is the same Jun as Huang Jun from the book Kung Fu by Giddens Ko. When I was reading this I kept switching the names accidentally.\u003c/p\u003e\n\u003cp\u003e[4] Here is what I imagine the song to sound like http://tinyurl.com/nw9p4ur. Just click the “play” button.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-5\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/dragon-king-with-seven-stars/dkss-chapter-4","bookId":1502,"creation":"Sep 10, 2019 4:16:46 AM","modification":"Sep 10, 2019 4:16:46 AM"}
