{"id":51155,"no":7,"title":"Chapter 7 - Wisp of Smoke","content":"\u003cp\u003e\u003cstrong\u003eChapter 7 - Wisp of Smoke\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApril 17th. High noon.\u003c/p\u003e\n\u003cp\u003eThe huge search for Ingot and Wu Tao continued in Jinan. More and more people were interested in the matter, probably because the Flowered Flag Sect as well as the local authorities had both offered huge rewards for information, rewards big enough to live for years on.\u003c/p\u003e\n\u003cp\u003eThe targets of the search were currently fast asleep in the Den of Immortals, just the two of them.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eOutside of Sun Jicheng’s 79 businesses were pasted paper posters which read, “Closed, business on hold for five days.” By now, people had heard about Big Boss Sun’s deaths, so there was no need to try to keep it a secret any more.\u003c/p\u003e\n\u003cp\u003e—The true secret which needed to be kept was that Big Boss Sun actually wasn’t dead.\u003c/p\u003e\n\u003cp\u003eGreat Three Yuan was obviously not open for business. And yet, Zheng Nanyuan hurried on his way to the restaurant. Three important customers awaited him, guests he could not afford to ignore.\u003c/p\u003e\n\u003cp\u003eThe guests included Old Master Tian from the powerful Flowered Flag Sect, and Huang Jun, the man who wished to reform the Beggar Sect, who had single-handedly founded its new Torture Chamber, famous in Jianghu and holder of life-and-death power in his organization.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan was just now walking up the stairs of the restaurant.\u003c/p\u003e\n\u003cp\u003eHe was no cripple; he used a wheelchair because of the festering rheumatism which had plagued him for years.\u003c/p\u003e\n\u003cp\u003eBy the time he arrived, a table of appetizers had already been laid out in one of the elegant private dining rooms. The guests had already been seated.\u003c/p\u003e\n\u003cp\u003eThere were three types of alcohol on the table.\u003c/p\u003e\n\u003cp\u003eA freshly opened jar of Guizhou Maotai, clear and strong, as well as Nu’er Hong from the Jiangsu/Zhejiang region, sweet and gentle, but with a strong delayed aftereffect.\u003c/p\u003e\n\u003cp\u003eAnd in a golden pitcher was what remained of the Persian Red Wine that Sun Jicheng had not finished during his lunch the other day. The golden pitcher had just been pulled out frigid cooling water; condensation dripped down its sides.\u003c/p\u003e\n\u003cp\u003eOld Master Tian drank a cup of each of the different types of alcohol, and then said, “We didn’t come here to drink.”\u003c/p\u003e\n\u003cp\u003eHe could say something like that.\u003c/p\u003e\n\u003cp\u003eOnce a person’s status reaches a certain level, they can say anything, and others can only listen.\u003c/p\u003e\n\u003cp\u003eThe things he said often weren\u0027t very nice; he usually left people unsure of whether to cry or laugh. Sometimes he shocked people, and sometimes left them in fear for their life.\u003c/p\u003e\n\u003cp\u003e“We are also not here to pay our respects,” he continued. “As well all know, Big Boss Sun isn’t dead.”\u003c/p\u003e\n\u003cp\u003eIt was quite a harsh thing to say.\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan didn’t seem to have any reaction whatsoever. He merely poured some Persian wine into his crystal goblet. He poured just enough to fill the glass completely, and yet didn’t spill a single drop.\u003c/p\u003e\n\u003cp\u003eSuch steady hands!\u003c/p\u003e\n\u003cp\u003eOld Master Tian narrowed his eyes, staring at Zheng Nanyuan. He continued, “Your big search last night was not an attempt to find your supposedly ‘dead’ boss. To search for him in such a fashion would be fruitless. That type of search will only turn up drunks and thieves and idiots. The purpose of your search was to inform Sun Jicheng that you know the corpse wasn’t him.”\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan sat listening, much the way a student will listen to his tutor lecture about the Four Books and Five Classics, even though he has no idea what the teacher is talking about. [2]\u003c/p\u003e\n\u003cp\u003eOld Master Tian drank three more cups of alcohol. His son joined him.\u003c/p\u003e\n\u003cp\u003e“The reason we are here,” said Old Master Tian, “is that we want to ask you a question.” Questions asked by Old Master Tian always hit the crux of matters. “How did you figure out the corpse did not belong to Sun Jicheng?”\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan laughed.\u003c/p\u003e\n\u003cp\u003e“Actually,” he said, “that is a question I should be asking you.”\u003c/p\u003e\n\u003cp\u003e“And yet, I asked the question first.”\u003c/p\u003e\n\u003cp\u003e“Can I refuse to answer?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then let me start from the beginning.”\u003c/p\u003e\n\u003cp\u003eHe poured himself another glass of wine, took a sip, and then began his story: “The guards who protect Big Boss Sun’s residence are split up into six shifts, divided under the leadership of Lian Gen and Qiu Budao. Recently I noticed that Qiu Budao had in succession dismissed thirteen men from his squads.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian knew he wouldn’t speak about things unrelated to the matter at hand, and would recount everything in great detail.\u003c/p\u003e\n\u003cp\u003e“Who were the people he dismissed?” he asked. “And who replaced them?”\u003c/p\u003e\n\u003cp\u003e“The ones he dismissed were capable men, and the new arrivals all had sketchy pasts, strangers who had never been seen before in Jianghu, all of them roughly thirty years of age.\u003c/p\u003e\n\u003cp\u003e“Did you ever bring this up to Sun Jicheng?”\u003c/p\u003e\n\u003cp\u003e“No. But when he died suddenly, I immediately suspected that his death had something to do with the thirteen men.”\u003c/p\u003e\n\u003cp\u003e“They hadn’t left yet?”\u003c/p\u003e\n\u003cp\u003e“No, not yet,” said Zheng Nanyuan. “So, I decided to call back the thirteen men who Qiu Budao had dismissed. Along with the men I sent to find them, I would have two men to deal with each one of thirteen with the sketchy pasts. I would capture them dead or alive.”\u003c/p\u003e\n\u003cp\u003e“That was the correct thing to do,” commended Old Man Tian. “What happened?”\u003c/p\u003e\n\u003cp\u003e“The people I sent to find the thirteen dismissed men came back quickly.” He drained the cup of wine in one drink. “They returned, twenty-six men.”\u003c/p\u003e\n\u003cp\u003e“Where are they now?”\u003c/p\u003e\n\u003cp\u003e“Downstairs, in the wine cellar.”\u003c/p\u003e\n\u003cp\u003e“All of them? And they haven’t left?”\u003c/p\u003e\n\u003cp\u003e“Twenty six men, none of them left,” said Zheng Nanyuan coolly. “I’m afraid they will never leave.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn the dark cellar, the corpses, covered with simple white cloths, had been lined up even more neatly than the jugs of wine.\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan followed Old Master Tian inside. He said, “I didn’t place them in coffins because I knew that eventually I would invite you down here to have a look at them.”\u003c/p\u003e\n\u003cp\u003eHe lifted the white cloth off of one of the corpses. The muddled light of the cellar lamps shone dimly on the corpse, revealing a face contorted in terror, one arm dislocated, the elbow snapped, larynx smashed.\u003c/p\u003e\n\u003cp\u003e“Each one died in the same way,” said Zheng Nanyuan. “Twenty-six men, all exactly the same.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian’s face suddenly grew very serious.\u003c/p\u003e\n\u003cp\u003e“The joints and larynxes were not smashed by the same person,” said Zheng Nanyuan. “The force exerted was different, although the technique was the same. This technique is strangely diabolical, and yet effective. There is no school or sect in Jianghu which uses anything remotely similar.”\u003c/p\u003e\n\u003cp\u003e“You’ve never seen anything like this before?” asked Old Master Tian.\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003eOne word at a time, Old Master Tian replied, “Well, I have.”\u003c/p\u003e\n\u003cp\u003eHis expression grew even more serious. Before Zheng Nanyuan could say anything, he continued, “Now I understand why Sun Jicheng would throw away his enormous fortune, feign his own death and flee for his life.”\u003c/p\u003e\n\u003cp\u003eOf course, Zheng Nanyuan asked, “Why would he?”\u003c/p\u003e\n\u003cp\u003e“Because he surely noticed that his bodyguard squads had been infiltrated by the thirteen men, and he surely could guess where they came from.”\u003c/p\u003e\n\u003cp\u003eFrogboy couldn’t help but butt in: “Don’t tell me the thirteen men scared him off?”\u003c/p\u003e\n\u003cp\u003e“Humph,” said Old Master Tian.\u003c/p\u003e\n\u003cp\u003e“If he really was the Laughing General,” continued Frogboy, “how could he possibly be frightened of them? When was General Li ever frightened by anyone?”\u003c/p\u003e\n\u003cp\u003eWith a furious glare, Old Man Tian said, “How do you know he was never frightened by anyone? Is he a tapeworm in your belly or something?”\u003c/p\u003e\n\u003cp\u003eFrogboy didn’t dare to respond.\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan did not ask about where the thirteen men came from, nor did he ask Old Master Tian why Sun Jicheng fled in fear.\u003c/p\u003e\n\u003cp\u003eHe calmly continued his explanation.\u003c/p\u003e\n\u003cp\u003e“After my operation failed, I lost track of the thirteen infiltrators. When Lian Gen learned of the matter, he instigated a large-scale search to try to flush them out.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian let out a cold laugh. “It’s a good thing you didn’t flush them out. Otherwise, even were your wine cellar three times as large, it wouldn’t be big enough to contain all the bodies.”\u003c/p\u003e\n\u003cp\u003e“In any case, I just want Old Master Tian to understand that the purpose of our search yesterday was not to because we had learned the body was not Big Boss Sun’s, nor was it to inform him of anything.” As calm as ever, he continued, “The purpose was to track down the thirteen infiltrators.”\u003c/p\u003e\n\u003cp\u003eHe and Xiao Jun were quite different: He spoke in great detail, and in order to make things completely clear, he would even repeat himself multiple times if necessary.\u003c/p\u003e\n\u003cp\u003eHaving explained things clearly, he now asked Old Master Tian a question. “So, how did the Old Master come to find out the corpse did not belong to Sun Jicheng, but was actually a body double?”\u003c/p\u003e\n\u003cp\u003eOld Master Tian, should he feel like being unreasonable, could refuse to answer the question.\u003c/p\u003e\n\u003cp\u003eIf he refused, who could possibly force him to answer?\u003c/p\u003e\n\u003cp\u003eFortunately, at this particular moment, he did not choose to be unreasonable. After someone answered his question in such great detail, he couldn’t possibly refuse to reciprocate.\u003c/p\u003e\n\u003cp\u003e“Shall I, too, start from the very beginning?” he asked Zheng Nanyuan.\u003c/p\u003e\n\u003cp\u003e“That would be the best.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian poured himself a up of alcohol and then began his explanation: “I suspected from the very beginning that Sun Jicheng wouldn’t suddenly die like that, but I had no way to confirm the identity of the body. At first. Then I had a chance.”\u003c/p\u003e\n\u003cp\u003e“What chance?”\u003c/p\u003e\n\u003cp\u003e“Sun Jicheng left Great Three Yuan restaurant on the afternoon of April 15th, correct?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“On that day, he ate a bowl of chicken and abalone shark’s fin soup, did he not? For appetizers, he ate shelled walnuts, pine nuts, and dried fruits. For his beverage, the Persian wind you just served to us. Correct?”\u003c/p\u003e\n\u003cp\u003e“Correct.” Zheng Nanyuan laughed bitterly. “I had no idea the Old Master was so familiar with our operations here.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian ignored the tone of ridicule in his comment, and continued with his explanation. “He died sometime after dusk, perhaps two hours after he parted with you.”\u003c/p\u003e\n\u003cp\u003e“How could the Old Master confirm that?”\u003c/p\u003e\n\u003cp\u003e“The chief coroner of Jinan, Ye Laoyan, happens to be my friend. As you know, he is one of the most skilled and experienced in his field. Who knows how many corpses he has examined in the past twenty years? His judgement is impeccable.”\u003c/p\u003e\n\u003cp\u003e“But we didn’t ask the government to examine the body,” said Zheng Nanyuan. “Old Mr. Ye never saw the corpse.”\u003c/p\u003e\n\u003cp\u003e“He did.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Last night after nightfall, when you were mustering your men to begin your big search.”\u003c/p\u003e\n\u003cp\u003e“At that time, the Boss’s body still lay in the secret room.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“How did old Mr. Ye get into the Boss’s secret room?”\u003c/p\u003e\n\u003cp\u003e“Because I took him there.”\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan said nothing further. If Old Master Tian wished to take someone somewhere, it wouldn’t be a difficult thing.\u003c/p\u003e\n\u003cp\u003eFurthermore, upon mustering and dispatching the full forces of the Sun mansion, among those left behind to guard the estate, surely some were friends of members of the “Flowered Flag” Sect.\u003c/p\u003e\n\u003cp\u003eOld Master Tian continued on: “After Ye Laoyan determined Sun Jicheng’s exact time of death, a question occurred to me.”\u003c/p\u003e\n\u003cp\u003e“What question?”\u003c/p\u003e\n\u003cp\u003e“When a person eats food, how long does it take for it to become excrement?”\u003c/p\u003e\n\u003cp\u003eThis was a superb question, a question which hit to the heart of the matter.\u003c/p\u003e\n\u003cp\u003e“In Ye Laoyan’s experience, food will remain in the digestive system for nearly two hours before becoming excrement. Walnuts, pine nuts and the like require even more time to digest.”\u003c/p\u003e\n\u003cp\u003eWithout pausing, he spoke forth the conclusion of the matter: “That corpse’s stomach contained no chicken and abalone shark’s fin soup, nor any walnuts, pine nuts or dried fruit. On the contrary, it contained food that Sun Jicheng would never eat: dried fish strips.”\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eHow exactly did they determine that?\u003c/p\u003e\n\u003cp\u003eOld Master Tian didn’t explain the details, but everyone could imagine how.\u003c/p\u003e\n\u003cp\u003eEven though everyone could imagine, no one seemed willing to actually question.\u003c/p\u003e\n\u003cp\u003eAs of now, Zheng Nanyuan’s face was no longer as calm and mild as it had been before. “So,” he asked coldly, “the Old Master suspected from the very beginning that the person who died was not Sun Jicheng.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“How did that come to be?” asked Zheng Nanyuan, his eyes flashing sharply. “Our Boss and the Old Master were not close. Why were you so interested in the details of his death?”\u003c/p\u003e\n\u003cp\u003eOld Master Tian’s facial expression changed.\u003c/p\u003e\n\u003cp\u003eFrogboy noticed that this change was similar to the change he’d observed when he brought up the matter of Liu Jin’niang earlier. Old Master Tian looked angry.\u003c/p\u003e\n\u003cp\u003eAnd yet, he answered the question.\u003c/p\u003e\n\u003cp\u003e“Of course I was interested, and of course I had my suspicions. Because,” he said loudly, “I knew that Sun Jicheng was none other than Laughing Li. 10 Qiu Budaos couldn’t stand up against a single of the Laughing General’s finger. How could he possibly be killed by Qiu Budao?”\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eThis was a very reasonable explanation. Who could refute it? Even should one know that it was merely an excuse, one still could not refute it.\u003c/p\u003e\n\u003cp\u003eBut Zheng Nanyuan had yet another question to ask.\u003c/p\u003e\n\u003cp\u003e“I’ve heard that the local government and the Old Master are currently searching for someone named ‘Wu Tao.’ According to the secret reports, he might be the formerly infamous ‘Fear-inspiring Three Laughs’ General Li.”\u003c/p\u003e\n\u003cp\u003e“I assumed you would have heard.”\u003c/p\u003e\n\u003cp\u003e“So, the Old Master’s meaning is that Wu Tao is Sun Ji Cheng, Sun Ji Cheng is General Li, and General Li is Wu Tao?”\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan once again used his overly detailed method of communication, utilizing three methods to ask a single question.\u003c/p\u003e\n\u003cp\u003eOld Master Tian’s responce was incredibly simple: “Yes.”\u003c/p\u003e\n\u003cp\u003e“That is really hard to believe.” Zheng Nanyuan sighed. “Even though Sun Jicheng didn’t live an ordinary life, he did live a very regimented life, out in the open, never hiding his actions. No one leveled any suspicions against him in all these years. I really don’t understand how the Old Master would suddenly come to the conclusion that he is the Laughing General.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian let out a cold laugh. “You think I’m the only person who knows this secret? Why do you think Chamber Lord Xiao is here?”\u003c/p\u003e\n\u003cp\u003eWith this deft statement, he shifted the responsibility of answering the question to Xiao Jun.\u003c/p\u003e\n\u003cp\u003eAnd of course, Zheng Nanyuan instantly said, “Chamber Lord Xiao, how did you come to this conclusion?”\u003c/p\u003e\n\u003cp\u003e“Our Sect’s disciples are everywhere,” he said coolly. “Every matter in Jianghu, large or small, comes to our attention sooner or later.”\u003c/p\u003e\n\u003cp\u003eThis answer didn’t really count as an answer, but didn’t count as a refusal to answer either.\u003c/p\u003e\n\u003cp\u003eEveryone in Jianghu knows that the Beggar Sect gets information quickly. As for the source of that information, who knew?\u003c/p\u003e\n\u003cp\u003eSo even though his answer did not quite satisfy Zheng Nanyuan, he couldn’t really ask for more information.\u003c/p\u003e\n\u003cp\u003eBut he could ask another question. “How can the two of you be certain that Wu Tao is Big Boss Sun?”\u003c/p\u003e\n\u003cp\u003e“Sun Jicheng killed his body double with one fatal palm strike that inflicted severe internal injuries. He perfectly imitated ‘As Stable as Mount Tai’ Qiu Budao’s technique, as if he had actually practiced it for thirty or forty years. The only difference is that the inner force contained in that palm strike contained some soft Yin elements.” With complete confidence, Master Tian continued, “Divine Shaolin Palm power is completely Yang based. There is no way that a disciple of Shaolin would produce such refined Yin force.”\u003c/p\u003e\n\u003cp\u003eOld Master Tian possessed deep knowledge and experience as well as profound understanding of martial arts. As far as martial abilities, weapons, fist and palm techniques, hidden weapons of the various schools and sects in Jianghu, he knew something about all of them.\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan could only listen.\u003c/p\u003e\n\u003cp\u003e“Condor King Wang, one of the Huainan Three Kings, was killed by Wu Tao,” continued Old Master Tian. “The attack he used to kill Wang was from none other than the Huainan Sect’s Eagle Claw kung fu, and his technique was just as good as Wang’s own. Except, his Eagle Claw technique also contained Yin force.”\u003c/p\u003e\n\u003cp\u003eEagle Claw uses Yang force, and Huainan Sect disciples did not train in Yin force.\u003c/p\u003e\n\u003cp\u003eThat point did not need to be stated out loud, everyone knew it.\u003c/p\u003e\n\u003cp\u003e“I examined both bodies personally. I may be an old man, but my eyesight has not grown dim. When I see something, no one can say I saw wrong.”\u003c/p\u003e\n\u003cp\u003eNo one could say, nor would anyone dare to say.\u003c/p\u003e\n\u003cp\u003eFinally, Old Master Tian asked Zheng Nanyuan: “How many people in the world can defeat an opponent by using the opponent’s own kung fu, something they practiced for decades. And who can also mix Yin power with Yang power martial arts?”\u003c/p\u003e\n\u003cp\u003e“Not many, I would say.”\u003c/p\u003e\n\u003cp\u003e“Other than the Laughing General, who claims to be surnamed Li, can you name another?”\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan said nothing.\u003c/p\u003e\n\u003cp\u003eHe couldn’t say a single name.\u003c/p\u003e\n\u003cp\u003e“You can’t think of a single one. So therefore, I must dare to say, Wu Tao is Sun Jicheng, Sun Jicheng is General Li, and General Li is Wu Tao.”\u003c/p\u003e\n\u003cp\u003eThis was his conclusion.\u003c/p\u003e\n\u003cp\u003eZheng Nanyuan had no more questions. However, Xiao Jun did.\u003c/p\u003e\n\u003cp\u003eThis kind of question would normally be unanswerable.\u003c/p\u003e\n\u003cp\u003e“As of now, Wu Tao knows that we have uncovered his secret, and are looking for him,” he said. “So, what is his next step?”\u003c/p\u003e\n\u003cp\u003eFrogboy suddenly laughed. “You shouldn’t be asking us. Why don’t you go ask him yourself?”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eApril 17th. Afternoon.\u003c/p\u003e\n\u003cp\u003eIt was a clear day, and the sun illuminated everything. Even though it couldn’t directly shine onto the cramped, moldy and incredibly stinky cell block, some of its rays somehow found their way inside.\u003c/p\u003e\n\u003cp\u003eIngot had awoken already and sat staring with his two large eyes.\u003c/p\u003e\n\u003cp\u003eNo one could possibly imagine what he stared at.\u003c/p\u003e\n\u003cp\u003eHe stared at something that he had never before seen in his entire life. Something he never would have wanted to see, and even now, upon seeing, could scarcely believe.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eIngot was currently looking at hundreds of spiders, rats, cockroaches, lizards, snakes, centipedes, mosquitos and bedbugs.\u003c/p\u003e\n\u003cp\u003eDead spiders, dead rats, dead cockroaches, dead lizards, dead snakes, dead centipedes, dead mosquitos, dead bedbugs.\u003c/p\u003e\n\u003cp\u003eHe had never imagined that a stone jail cell could possibly contain so many things like this.\u003c/p\u003e\n\u003cp\u003eYet, there they were. And they had originally been jumping with life.\u003c/p\u003e\n\u003cp\u003eBut as soon as they touched Wu Tao, who remained fast asleep, they would instantly die.\u003c/p\u003e\n\u003cp\u003eRegardless of spider, rat, cockroach, lizard, snake, centipede, mosquito or bedbug, as soon as they touched his body, they would stiffen and fall, never to move again.\u003c/p\u003e\n\u003cp\u003e***\u003c/p\u003e\n\u003cp\u003eIngot not only stared, he counted.\u003c/p\u003e\n\u003cp\u003eEvery one that died, he counted. He currently was up to one hundred eighty-nine.\u003c/p\u003e\n\u003cp\u003eThat number itself was nothing frightening, but having counted so high, the hairs on his whole body stood on end.\u003c/p\u003e\n\u003cp\u003eWu Tao was still fast asleep, sleeping like a corpse.\u003c/p\u003e\n\u003cp\u003eWho knew how many more vile pests would appear in the prison? From outside could be heard the sound of iron shackles clanking on the stone floor, piteous wails and weeping, and the cursing of jailers as they whipped and beat inmates.\u003c/p\u003e\n\u003cp\u003eIf you heard those sounds and saw what Ingot saw, you too would be disgusted.\u003c/p\u003e\n\u003cp\u003eHe couldn’t take it any more.\u003c/p\u003e\n\u003cp\u003eAt what point would Wu Tao wake up?\u003c/p\u003e\n\u003cp\u003eIngot decided to wake him up. He didn’t call out to him, he just went over and pushed him. But as soon as his hand touched Wu Tao’s body, he felt it pushed away. And then nearly half of his body went numb.\u003c/p\u003e\n\u003cp\u003e—This guy really was weird. He himself wasn’t too scary, but his martial arts were terrifying.\u003c/p\u003e\n\u003cp\u003eIngot didn’t fear him in the least. He grabbed a dead rat and then threw it toward Wu Tao’s nose.\u003c/p\u003e\n\u003cp\u003eA slapping sound rang out as the rat hit the nose.\u003c/p\u003e\n\u003cp\u003eNot Wu Tao’s nose. Ingot’s nose.\u003c/p\u003e\n\u003cp\u003eThe dead rat had rebounded, and struck Ingot directly in the nose.\u003c/p\u003e\n\u003cp\u003eIngot, furious, was about to start yelling. But Wu Tao had already woken and started stretching. Glaring at him, Ingot said, “What the hell?”\u003c/p\u003e\n\u003cp\u003e“What the hell what?”\u003c/p\u003e\n\u003cp\u003e“What the hell are you hitting me in the nose with a dead rat for?”\u003c/p\u003e\n\u003cp\u003e“Was it me who hit you in the nose with a dead rat? Or the other way around?”\u003c/p\u003e\n\u003cp\u003e“I can hit you, but you can’t hit me,” said Ingot, bold and assured.\u003c/p\u003e\n\u003cp\u003eWu Tao sat up. “Why can you hit me but I can’t hit you?”\u003c/p\u003e\n\u003cp\u003e“Because you’re an adult, but I’m just a kid.” The more he spoke, the more reasonable his arguments sounded. “Also, you were pretending to sleep, so of course I should try to make you get up. You weren’t sleeping, so why the hell did you hit me?”\u003c/p\u003e\n\u003cp\u003eWu Tao looked like he wanted to laugh, but he didn’t.\u003c/p\u003e\n\u003cp\u003e“Why did you need to wake me up? Why not sleep a little bit more?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t sleep.”\u003c/p\u003e\n\u003cp\u003e“Why couldn’t you sleep? Is there something wrong with this place?”\u003c/p\u003e\n\u003cp\u003e“Everything.”\u003c/p\u003e\n\u003cp\u003e“Do you want to leave?”\u003c/p\u003e\n\u003cp\u003e“Yes. Very much so.”\u003c/p\u003e\n\u003cp\u003e“You want to leave and never come back?”\u003c/p\u003e\n\u003cp\u003e“Call me a bastard if I ever come back,” said Ingot, sounding more and more angry. “This is not a place for people. Even bastards shouldn’t stay here.”\u003c/p\u003e\n\u003cp\u003eWu Tao suddenly stood up. “Okay!” he cried.\u003c/p\u003e\n\u003cp\u003e“Okay?” said Ingot. “What does that mean?”\u003c/p\u003e\n\u003cp\u003eAs soon as he said it, he knew what Wu Tao meant. He saw Wu Tao stretch out his arms, and then heard a sound like fireworks coming from his body.\u003c/p\u003e\n\u003cp\u003eAnd then a bang sounded out.\u003c/p\u003e\n\u003cp\u003eThe cramped, moldy cell block, constructed of thick slabs of stone, suddenly exploded out in every direction.\u003c/p\u003e\n\u003cp\u003eDust flew out, and Ingot felt as if he were were flying in the air. Then the only thing he could hear was Wu Tao’s voice: “If this place isn’t fit for bastards, why leave it standing?”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003e[1] Guizhou Maotai is one of China’s most famous baijius. \u003ca href\u003d\"http://tinyurl.com/nbvvkhh\" target\u003d\"_blank\"\u003ehttp://tinyurl.com/nbvvkhh\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e[2] These texts are the books about Confucianism. \u003ca href\u003d\"http://tinyurl.com/pl68w5l\" target\u003d\"_blank\"\u003ehttp://tinyurl.com/pl68w5l\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/dragon-king-with-seven-stars/dkss-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/dragon-king-with-seven-stars/dkss-chapter-7","bookId":1502,"creation":"Sep 10, 2019 4:16:46 AM","modification":"Sep 10, 2019 4:16:46 AM"}
