{"id":89962,"no":10,"title":"Page 10","content":"\u003cp\u003eJessie drew her .44 a millisecond ahead of Leigh\u0027s Glock. They leveled the barrels on my face. A gun for each nostril. How poetic.\u003c/p\u003e\n\u003cp\u003eI wanted to duck, but I knew them too well. They\u0027d shoot first, say oops later.\u003c/p\u003e\n\u003cp\u003eI don\u0027t think Damien meant to give me up. He was in shock.\u003c/p\u003e\n\u003cp\u003eAnd why wouldn\u0027t he be? Who would guess that the most feared werewolf hunter on the planet kept his very own werewolf close at hand?\u003c/p\u003e\n\u003cp\u003eNot me, if I hadn\u0027t been the werewolf in question.\u003c/p\u003e\n\u003cp\u003e\"Everybody calm down,\" Will murmured.\u003c/p\u003e\n\u003cp\u003eI\u0027d always liked him.\u003c/p\u003e\n\u003cp\u003e\"Hold on, Leigh.\" This was Damien. \"She isn\u0027t - \"\u003c/p\u003e\n\u003cp\u003e\"What?\" Leigh\u0027s blue eyes narrowed. \"Human? We got that.\"\u003c/p\u003e\n\u003cp\u003e\"No. I mean yes. Hell.\" He sent me an apologetic glance, then tried to inch between me and the guns. I elbowed him back.\u003c/p\u003e\n\u003cp\u003e\"Ah, ah, ah,\" Leigh warned. \"No sudden moves.\"\u003c/p\u003e\n\u003cp\u003eDamien stopped pushing me, and I stepped in front of him, putting myself closer to the weapons. Leigh lifted her brows, and her eyes warmed just a little.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not like the others,\" Damien continued. \"When I said she was like me, I meant it. She\u0027s different, too.\"\u003c/p\u003e\n\u003cp\u003e\"Does Mandenauer know?\" Jessie blurted.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" I said.\u003c/p\u003e\n\u003cp\u003e\"As if we\u0027ll believe anything you have to say.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the one who asked. Call Edward. Believe him.\"\u003c/p\u003e\n\u003cp\u003eEveryone went silent. They knew as well as I did that if Edward didn\u0027t know I was a werewolf before, and he found out now, he\u0027d blow my brains out faster than I could say \"Have mercy.\"\u003c/p\u003e\n\u003cp\u003e\"Call him,\" Jessie ordered.\u003c/p\u003e\n\u003cp\u003eAmazingly, Leigh did so without argument. Two minutes later, she disconnected her cell call to Edward.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Jessie demanded when Leigh just stared at me.\u003c/p\u003e\n\u003cp\u003e\"He says we should leave her alone.\"\u003c/p\u003e\n\u003cp\u003e\"He understands she turns furry under the moon?\"\u003c/p\u003e\n\u003cp\u003e\"Edward agreed with Damien. She\u0027s different, too.\"\u003c/p\u003e\n\u003cp\u003eAfter another moment\u0027s hesitation, Jessie put away her gun.\u003c/p\u003e\n\u003cp\u003eI felt no more at ease without the weapons staring me in the face, probably because four pairs of eyes were.\u003c/p\u003e\n\u003cp\u003e\"Is there somewhere we can talk?\" I asked.\u003c/p\u003e\n\u003cp\u003eI still wore only a T-shirt and sweatpants, and the November night wasn\u0027t any warmer in Wisconsin than it had been in Montana. Without my fur, I was freezing.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve rented a house next to the cop shop,\" Leigh said. \"We can go there.\"\u003c/p\u003e\n\u003cp\u003e\"Where did Edward take Nic?\"\u003c/p\u003e\n\u003cp\u003e\"Mandenauer has a room over the antiques store,\" Jessie told me. \"I\u0027m sure he feels right at home there.\"\u003c/p\u003e\n\u003cp\u003eI peered at the buildings lining the street and knew without being told which was his. Windows at the front, so he could watch the town; I\u0027d bet there were also windows at the back, so he could observe whatever came out of the woods. A second-story room is always the best choice for both offense and defense.\u003c/p\u003e\n\u003cp\u003eAs we continued toward the rental property I was struck by the silence. No dogs barked. Not a baby cried. There wasn\u0027t a single light in any of the houses or the businesses.\u003c/p\u003e\n\u003cp\u003e\"Too quiet,\" I murmured.\u003c/p\u003e\n\u003cp\u003eLeigh cast a quick glance over her shoulder. The expression on her face caused a shiver of premonition to dance down my spine. I imagined an empty town, a very full forest.\u003c/p\u003e\n\u003cp\u003e\"No one\u0027s been bitten,\" Will said.\u003c/p\u003e\n\u003cp\u003e\"Then - \"\u003c/p\u003e\n\u003cp\u003e\"What are we doing here?\" Jessie interrupted. \"We\u0027ll get to that.\"\u003c/p\u003e\n\u003cp\u003eWe reached a large log house at the end of the street. The porch was a bit rickety, but other than that the place seemed sturdy enough. After digging a key from her jeans, Jessie unlocked the front door, snapped on the lights. We blinked in the electric glare.\u003c/p\u003e\n\u003cp\u003eJessie motioned me inside. As I inched past her she plastered her shoulders to the door, insuring we didn\u0027t touch, even by accident. I tried not to let that bother me, but it did. I\u0027d always been lonely, but since no one knew of my affliction but Edward, the cringing in my presence had been kept to a minimum.\u003c/p\u003e\n\u003cp\u003eWe took seats in the small living room, and more staring ensued. Jessie, never a patient woman, was the first to speak. \"Talk, Doctor, or I\u0027ll make you.\"\u003c/p\u003e\n\u003cp\u003eShe was getting on my nerves. \"I\u0027d like to see you try.\"\u003c/p\u003e\n\u003cp\u003eJessie came to her feet and so did I. Though we were the same height, she probably had ten pounds on me. Nevertheless, I knew who would win a physical fight. If only she didn\u0027t have that gun filled with silver.\u003c/p\u003e\n\u003cp\u003eWill grabbed her hand before she could draw the weapon. Leigh put herself between us, and Damien reached out to halt my mad rush. But right before his hand touched me, he snatched it back.\u003c/p\u003e\n\u003cp\u003eThe movement made me pause, remembering why I\u0027d kept my secret all these years. If Damien couldn\u0027t handle what I was, how could I expect anyone to? Especially anyone like Nic.\u003c/p\u003e\n\u003cp\u003eIf I told him the truth, he\u0027d think me insane. If I showed him, he\u0027d find me both hideous and terrifying.\u003c/p\u003e\n\u003cp\u003eBetter he hated me for a selfish, unloving bitch than that.\u003c/p\u003e\n\u003cp\u003eDefeated, I collapsed in my chair. \"What do you want to know?\"\u003c/p\u003e\n\u003cp\u003eThe others sat. At first no one spoke, then they all spoke at once.\u003c/p\u003e\n\u003cp\u003e\"Who?\" Jessie asked.\u003c/p\u003e\n\u003cp\u003e\"When?\" That was Damien.\u003c/p\u003e\n\u003cp\u003e\"How?\" murmured Will.\u003c/p\u003e\n\u003cp\u003eLeigh merely said, \"Why?\"\u003c/p\u003e\n\u003cp\u003eI looked at her. \"Why what?\"\u003c/p\u003e\n\u003cp\u003e\"Why haven\u0027t you been able to cure yourself?\"\u003c/p\u003e\n\u003cp\u003eSince my antidote had cured Leigh, but not Damien, she\u0027d called and harassed me continuously. She\u0027d often been rude, crude, condescending. I\u0027d put up with it because I understood her smart mouth and habitual snarl were rooted in fear.\u003c/p\u003e\n\u003cp\u003eIf I couldn\u0027t cure Damien, no one could.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not for lack of trying,\" I said.\u003c/p\u003e\n\u003cp\u003eThe room went momentarily silent, until Will broke the ice. \"Who bit you?\" he clarified. \"Where? When?\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t bitten.\"\u003c/p\u003e\n\u003cp\u003eAll four of them glanced at one another, then back at me.\u003c/p\u003e\n\u003cp\u003e\"Maybe you should start at the beginning,\" Will said.\u003c/p\u003e\n\u003cp\u003eI took a deep breath and a moment to think. I\u0027d never told anyone my story before.\u003c/p\u003e\n\u003cp\u003e\"When werewolves touch in human form we feel each other\u0027s power and the demon that sleeps inside of us.\" I glanced at Damien. \"But I don\u0027t have a demon, and neither do you.\"\u003c/p\u003e\n\u003cp\u003e\"I had one,\" he murmured. \"At first.\"\u003c/p\u003e\n\u003cp\u003eDamien had been like all the rest, until he\u0027d run afoul of an Ozark Mountain magic woman. He\u0027d been blessed to lose the demon and cursed to remember all that he\u0027d done while having it.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re working for the good guys now,\" Leigh told him. \"You\u0027re making up for all that you did.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t make up for that. There isn\u0027t enough time on this earth.\"\u003c/p\u003e\n\u003cp\u003eLeigh lifted her eyes to mine over the top of his head. I could read her thoughts loud and clear.\u003c/p\u003e\n\u003cp\u003eFix him, she begged, as she had a hundred times before.\u003c/p\u003e\n\u003cp\u003e\"Get on with the story, Doc,\" Jessie urged. \"We don\u0027t have all night.\"\u003c/p\u003e\n\u003cp\u003eMy story wouldn\u0027t take that long, since it was relatively simple.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t bitten,\" I said. \"My mother was.\"\u003c/p\u003e\n\u003cp\u003eDamien\u0027s head came up. \"Lycanthropy isn\u0027t hereditary. A werewolf can\u0027t breed.\"\u003c/p\u003e\n\u003cp\u003e\"Can they?\" Leigh\u0027s voice quavered.\u003c/p\u003e\n\u003cp\u003eHer concern was understandable. I wouldn\u0027t want to have puppies, either.\u003c/p\u003e\n\u003cp\u003e\"No,\" I assured her, and she visibly relaxed.\u003c/p\u003e\n\u003cp\u003e\"As Edward tells it, my mother was bitten while she was pregnant with me. The shock sent her into early labor.\"\u003c/p\u003e\n\u003cp\u003e\"But - \" Jessie frowned. \"I thought the virus was passed through saliva.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t elaborate. Within a few seconds, the light dawned on them all.\u003c/p\u003e\n\u003cp\u003eJessie and Leigh paled. Hell, so did Will. Only Damien had the strength to articulate the truth. \"She was bitten in the stomach?\"\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e\"And you?\"\u003c/p\u003e\n\u003cp\u003e\"The best I can figure is that the virus entered the amniotic fluid, infecting me, though I wasn\u0027t affected the way most humans are.\"\u003c/p\u003e\n\u003cp\u003e\"You shifted, but you weren\u0027t possessed.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty much.\"\u003c/p\u003e\n\u003cp\u003e\"What happened to your mother?\" Leigh was staring at me with more sympathy than I\u0027d ever seen in her eyes, except when she was gazing at Damien.\u003c/p\u003e\n\u003cp\u003e\"The change killed her.\"\u003c/p\u003e\n\u003cp\u003eWhich was true. She\u0027d changed, then Edward had killed her.\u003c/p\u003e\n\u003cp\u003eThe room went silent. At least no one said they were sorry. They\u0027d have been lying. My mother, once bitten, had been doomed.\u003c/p\u003e\n\u003cp\u003e\"What about your father?\" Leigh asked.\u003c/p\u003e\n\u003cp\u003e\"My entire family was wiped out by the werewolves that bit my mother.\"\u003c/p\u003e\n\u003cp\u003eLeigh\u0027s eyes softened for an instant. \"Sorry. That\u0027s rough.\"\u003c/p\u003e\n\u003cp\u003eShe should know.\u003c/p\u003e\n\u003cp\u003e\"When did you realize you were different?\" Damien asked.\u003c/p\u003e\n\u003cp\u003e\"I was twenty-two.\"\u003c/p\u003e\n\u003cp\u003eHis eyes widened. \"You were normal until then?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know how normal I\u0027d been - an orphan, raised by the man who\u0027d killed my mother - but I nodded anyway.\u003c/p\u003e\n\u003cp\u003e\"What caused it?\"\u003c/p\u003e\n\u003cp\u003e\"At the time I had no idea.\"\u003c/p\u003e\n\u003cp\u003eAs if the change had happened yesterday instead of seven years ago, the fear came back, along with the pounding panic, the crushing pain.\u003c/p\u003e\n\u003cp\u003e\"I was in college at Stanford - \"\u003c/p\u003e\n\u003cp\u003e\"Nice,\" Jessie muttered.\u003c/p\u003e\n\u003cp\u003e\"Edward spared no expense.\"\u003c/p\u003e\n\u003cp\u003eBoth she and Leigh frowned. \"Mandenauer paid for your schooling?\"\u003c/p\u003e\n\u003cp\u003e\"Edward has paid for everything.\"\u003c/p\u003e\n\u003cp\u003eAs a child I hadn\u0027t known why Edward was caring for me, I\u0027d only been glad that he was. I had no one else.\u003c/p\u003e\n\u003cp\u003eAfter I learned the truth, I\u0027d figured he felt guilty about making me an orphan. Recently, I\u0027d come to understand his assistance had been based on suspicion.\u003c/p\u003e\n\u003cp\u003eHe\u0027d wondered what I might become and when. The only reason he hadn\u0027t killed me when I changed was because I was different, and that difference had been useful to him.\u003c/p\u003e\n\u003cp\u003e\"I always thought there was something going on between the two of you.\" Jessie\u0027s gaze wandered over me again.\u003c/p\u003e\n\u003cp\u003eFor a second I didn\u0027t understand what she meant. When I did, my cheeks flushed, and my fists clenched.\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t pay for me, if that\u0027s what you\u0027re insinuating.\"\u003c/p\u003e\n\u003cp\u003e\"If the name slut fits...\"\u003c/p\u003e\n\u003cp\u003e\"Gutter brain,\" I muttered, which only made Leigh snicker.\u003c/p\u003e\n\u003cp\u003e\"Stop it,\" Will snapped. \"Let Elise finish.\"\u003c/p\u003e\n\u003cp\u003eJessie and Leigh didn\u0027t appear contrite, but they did shut up.\u003c/p\u003e\n\u003cp\u003e\"The first change came under the wolf moon,\" I began.\u003c/p\u003e\n\u003cp\u003e\"When the hell is that?\"\u003c/p\u003e\n\u003cp\u003eI should have known Jessie wouldn\u0027t be able to shut up completely.\u003c/p\u003e\n\u003cp\u003e\"January,\" Will said, shooting her a quelling look. \"When the wolves howl with hunger in the depths of the winter snows.\"\u003c/p\u003e\n\u003cp\u003e\"Well, not at Stanford,\" I allowed, \"but it was January. As I\u0027m sure you\u0027re all aware, full moons are a busy time.\"\u003c/p\u003e\n\u003cp\u003eJust ask any ER physician, maternity floor nurse, psychiatric attendant, or waitress at the nearest twenty-four-hour greasy spoon.\u003c/p\u003e\n\u003cp\u003eMy last semester before medical school - new classes, new books, new challenges - I\u0027d been excited, anxious, and in love.\u003c/p\u003e\n\u003cp\u003e\"Why then?\" Damien asked. \"Wouldn\u0027t the changes of puberty initiate... other changes?\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t considered the notion. But now that I thought about it, Edward had.\u003c/p\u003e\n\u003cp\u003eThe years between twelve and fourteen were the only ones I\u0027d spent with him. He\u0027d been possessed by the desire to live in a castle in his native land. To hell and gone, the middle of nowhere, practically on top of a mountain. While there, I\u0027d had a tutor. A huge hulking bear of a man, who was as frightening as he was smart.\u003c/p\u003e\n\u003cp\u003eWhen I\u0027d been sent to Austria three days past my fourteenth birthday, I\u0027d thought I\u0027d done something wrong. What I had done was gotten my period and neglected to grow fangs. Good girl. Funny how things made sense from a distance of years.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d think if you were gonna go furry,\" Jessie murmured, \"you\u0027d have done it right away. Got an explanation for that, Wonder Doc?\"\u003c/p\u003e\n\u003cp\u003eI was used to a certain amount of respect, if not for the Ph.D. behind my name, then for the advances I\u0027d made in lycanthropy research. Trust Jessie not to give a shit about either one.\u003c/p\u003e\n\u003cp\u003e\"I have a theory.\"\u003c/p\u003e\n\u003cp\u003e\"Which is about as close as we\u0027re going to get to an answer, I\u0027m sure.\" Jessie sighed. \"Get on with it.\"\u003c/p\u003e\n\u003cp\u003e\"I believe the small amount of virus I received in utero lay dormant. When it was activated, there was only enough to cause the change, not enough to...\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure how to articulate what happened to a human being when the virus turned them into a monster.\u003c/p\u003e\n\u003cp\u003e\"To strangle your soul,\" Damien whispered.\u003c/p\u003e\n\u003cp\u003eSilence settled over us all until I broke it with a simple, \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re the perfect werewolf?\" Leigh prodded. \"All the superpowers without the pesky demon?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t say perfect. It\u0027s not exactly fun to change.\"\u003c/p\u003e\n\u003cp\u003eOr at least it hadn\u0027t been until yesterday.\u003c/p\u003e\n\u003cp\u003e\"I remember,\" Leigh murmured.\u003c/p\u003e\n\u003cp\u003eWhen a person is bitten, they experience a kind of collective consciousness. As the virus penetrates their blood, they imagine the coming change, remembering things that have happened to others. They feel the pain, the power, both the terror and the temptation.\u003c/p\u003e\n\u003cp\u003e\"What about the blood lust?\" Damien asked. \"The love of the kill?\"\u003c/p\u003e\n\u003cp\u003e\"The killing sickened me. Not that I didn\u0027t do it. I couldn\u0027t stop myself.\"\u003c/p\u003e\n\u003cp\u003eAt my words, both Leigh\u0027s and Jessie\u0027s fingers crept toward their guns. I doubted they even knew they were moving, so deeply ingrained was their response to a threat.\u003c/p\u003e\n\u003cp\u003e\"But I can stop myself now.\" f hey froze, then frowned at each other.\u003c/p\u003e\n\u003cp\u003e\"I invented a serum. Under a full moon I\u0027ll still change, but I\u0027m not compelled to kill.\"\u003c/p\u003e\n\u003cp\u003eTheir hands left their weapons.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t mind some of that sauce,\" Damien murmured.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d be happy to share,\" I said. \"If it hadn\u0027t blown up with the compound.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-dark-moon-nightcreature-3/page-10.html","bookId":2090,"creation":"Oct 5, 2019 5:39:23 PM","modification":"Oct 5, 2019 5:39:23 PM"}
