{"id":89966,"no":14,"title":"Page 14","content":"\u003cp\u003eWhen I was a wolf, I wasn\u0027t completely white. More golden. Blond with blue eyes in both forms.\u003c/p\u003e\n\u003cp\u003eHowever, the resemblance was there\u003c/p\u003e\n\u003cp\u003e\"The icon isn\u0027t mine,\" I repeated.\u003c/p\u003e\n\u003cp\u003e\"Odd.\" Will continued to peer at the plastic and frown. \"Talismans are representations of spirit guides.\u003c/p\u003e\n\u003cp\u003eOjibwe folklore says that those of a particular clan are descended from that clan\u0027s animal.\"\u003c/p\u003e\n\u003cp\u003eI recalled the information from Jessie\u0027s report on the wolf god. According to Native American legend there were several totemic divisions: bear, eagle, moose, wolf, and so on. In the old days, each clan had a specialized task. While one governed, another made war. Members could not marry within their own clan - the ancestral link to the animal or bird made their blood too similar.\u003c/p\u003e\n\u003cp\u003e\"In that case,\" Will continued, \"I\u0027d be descended from a wolf.\"\u003c/p\u003e\n\u003cp\u003e\"No wonder Edward doesn\u0027t like you,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t go over too well when he heard it, that\u0027s for sure.\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\" I asked, though I had a pretty good idea.\u003c/p\u003e\n\u003cp\u003eWill tilted his head, and his golden earring swung free. \"He shot me with silver.\"\u003c/p\u003e\n\u003cp\u003e\"No ill effects?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t explode.\"\u003c/p\u003e\n\u003cp\u003eWill rolled up the sleeve of his T-shirt. A bullet-shaped scar marred the smooth cinnamon skin of his upper arm.\u003c/p\u003e\n\u003cp\u003e\"Sorry about that,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t do it.\" He let the material fall back into place. \"Besides, chicks dig scars, don\u0027t they?\"\u003c/p\u003e\n\u003cp\u003e\"You better hope not, unless you want a high body count when Jessie gets hold of them.\"\u003c/p\u003e\n\u003cp\u003eWill laughed. \"She\u0027s something else.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but what?\"\u003c/p\u003e\n\u003cp\u003eHe considered me for a moment with a bemused expression. \"You two are a lot alike.\"\u003c/p\u003e\n\u003cp\u003e\"Me and Jessie? I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003eI was like no one I\u0027d ever encountered, but that was beside the point. Jessie and I were as different as day and night, new moon and full, human and werewolf.\u003c/p\u003e\n\u003cp\u003eI slanted the icon until the light caught the jeweled eyes and sparkled. \"What\u0027s your opinion?\"\u003c/p\u003e\n\u003cp\u003e\"Not sure. Usually, totems are made of stone, bone, something of the earth.\"\u003c/p\u003e\n\u003cp\u003e\"And this is plastic.\"\u003c/p\u003e\n\u003cp\u003e\"Which would make me think it\u0027s nothing more than a child\u0027s toy, sold in tourist shops to folks from away.\u003c/p\u003e\n\u003cp\u003eThere isn\u0027t an Ojibwe alive who would create a spiritual symbol from plastic.\"\u003c/p\u003e\n\u003cp\u003e\"Except?\"\u003c/p\u003e\n\u003cp\u003eHis gaze lifted from the wolf to my face. \"Except this appears to have been made to represent a specific wolf. You.\"\u003c/p\u003e\n\u003cp\u003e\"Voodoo?\"\u003c/p\u003e\n\u003cp\u003e\"Voodoo is an amalgamation of ancient African tribal symbols and the Catholicism the slaves were baptized into upon their arrival. This totem, however weird, is Ojibwe. But the only time I\u0027ve seen talismans that simulate something more specific than a generic clan animal is when they\u0027re shamanic.\"\u003c/p\u003e\n\u003cp\u003e\"English, please.\"\u003c/p\u003e\n\u003cp\u003e\"Shamans use talismans to aid them in assuming the form of their spirit animal. To do that, they often construct a totem to resemble themselves in some way: hair color, eyes, distinctive facial feature.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a shaman.\"\u003c/p\u003e\n\u003cp\u003e\"Technically, anyone with the right stuff can transform.\"\u003c/p\u003e\n\u003cp\u003e\"The right stuff being... ?\"\u003c/p\u003e\n\u003cp\u003e\"Mystical connection to an animal.\"\u003c/p\u003e\n\u003cp\u003e\"Got that,\" I said dryly.\u003c/p\u003e\n\u003cp\u003e\"A shamanic totem.\"\u003c/p\u003e\n\u003cp\u003eI jiggled the wolf like a tiny martini shaker. \"And?\"\u003c/p\u003e\n\u003cp\u003e\"A sacrifice to imbue the totem with power.\"\u003c/p\u003e\n\u003cp\u003eMy hand froze mid-shake. \"What kind of sacrifice?\"\u003c/p\u003e\n\u003cp\u003e\"Blood, death.\"\u003c/p\u003e\n\u003cp\u003eI thought of the flayed rabbit and muttered, \"Hell.\"\u003c/p\u003e\n\u003cp\u003eWill\u0027s gaze shot to mine. \"What?\"\u003c/p\u003e\n\u003cp\u003eQuickly, I told him exactly where I\u0027d found the icon, then I told him the rest. About the totem shifting, spilling silver light into my mind, and the instantaneous change.\u003c/p\u003e\n\u003cp\u003e\"Bam, you\u0027re a wolf?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Pretty much. You think that\u0027s what\u0027s been happening in Fairhaven?\"\u003c/p\u003e\n\u003cp\u003eHe blinked, frowned, considered the tiny wolf again, then shook his head. \"They\u0027d have to fashion talismans that represent a particular person. Seems like too much hassle. And really, what\u0027s the rush?\"\u003c/p\u003e\n\u003cp\u003eOnce bitten, the victim would shift within twenty-four hours - rain or shine, sunshine or shadow, full moon or new. Even the dead would rise. They\u0027d heal, then run and kill as a wolf. The first time, the moon didn\u0027t matter.\u003c/p\u003e\n\u003cp\u003e\"Besides, we\u0027d have found tiny totems strewn all over the place. Once you\u0027re a wolf, no pockets.\"\u003c/p\u003e\n\u003cp\u003eMy lips curved at the similarity in our thought processes. \"So what\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"With you or with Fairhaven?\"\u003c/p\u003e\n\u003cp\u003eI shrugged. \"Pick a mystery.\"\u003c/p\u003e\n\u003cp\u003e\"There hasn\u0027t been a disappearance since we arrived. My theory is that whatever the werewolves were up to in Fairhaven, they\u0027re done and they\u0027ve moved on.\"\u003c/p\u003e\n\u003cp\u003e\"Or they saw Edward - \"\u003c/p\u003e\n\u003cp\u003e\"And they moved on.\" Will nodded. \"I would. According to Jessie, we\u0027ll have to leave soon, as well.\u003c/p\u003e\n\u003cp\u003eThere are werewolves busting out all over the country.\"\u003c/p\u003e\n\u003cp\u003e\"What about the mystery of me?\"\u003c/p\u003e\n\u003cp\u003eWill pointed at the icon. \"If that was left for you, and I have to think it was, what did they hope to accomplish?\"\u003c/p\u003e\n\u003cp\u003e\"Why do shamans transform?\" I asked. \"What do they gain from the process?\"\u003c/p\u003e\n\u003cp\u003e\"Becoming one with their spirit animal gives them the power to complete a quest.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of quest?\"\u003c/p\u003e\n\u003cp\u003e\"A journey, knowledge. Whatever is most important to them.\"\u003c/p\u003e\n\u003cp\u003e\"The cure,\" I murmured.\u003c/p\u003e\n\u003cp\u003e\"Maybe.\" His forehead creased in thought. \"But if they meant to help you, why not just hand you the thing?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, why not?\"\u003c/p\u003e\n\u003cp\u003e\"The place blew up,\" he said slowly, \"and then you found the talisman?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"Were they trying to kill you or not? I can\u0027t decide.\"\u003c/p\u003e\n\u003cp\u003e\"Join the club.\"\u003c/p\u003e\n\u003cp\u003eHe ignored my attempt at humor. Jessie was no doubt a whole lot funnier than I was.\u003c/p\u003e\n\u003cp\u003e\"If they meant for you to die, then the icon being where it was didn\u0027t have anything to do with you.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"But - \" He broke off, and his dark eyes met mine again. \"If they wanted you dead, then why the talisman that resembles you in wolf form? Coincidence?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"Me, neither.\" Will appeared as stumped as I was.\u003c/p\u003e\n\u003cp\u003e\"How did you manage to be outside when the place went up in flames?\"\u003c/p\u003e\n\u003cp\u003e\"The test wolves went ballistic. Howling, snarling, hiding, then attacking. They were behaving as if - \" My eyes met Will\u0027s. \"They were trapped by an enemy.\"\u003c/p\u003e\n\u003cp\u003e\"But which enemy?\"\u003c/p\u003e\n\u003cp\u003eI spread my hands wide. There were so many to choose from.\u003c/p\u003e\n\u003cp\u003e\"I guess if we knew that,\" Will continued, \"we\u0027d know who blew up the compound and maybe even why.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s never that easy.\"\u003c/p\u003e\n\u003cp\u003e\"Never.\" Will indicated the totem with a flick of one finger. \"May I?\"\u003c/p\u003e\n\u003cp\u003eI hesitated. If the totem had turned me into a wolf -\u0026nbsp;\u0026nbsp;wham - who knew what it might do to Will? Then again, who better to find out?\u003c/p\u003e\n\u003cp\u003eIn the end, he snatched the thing from my hand and nothing happened. But this icon didn\u0027t look like him.\u003c/p\u003e\n\u003cp\u003eWill studied the tiny wolf with a single-mindedness I admired. \"You\u0027ve told me everything?\"\u003c/p\u003e\n\u003cp\u003eThere was one thing I hadn\u0027t, one thing that disturbed me more than the rest.\u003c/p\u003e\n\u003cp\u003eWill\u0027s gaze flicked to mine. The seriousness in his dark eyes seemed magnified by the wire-rimmed glasses. \"You can trust me.\"\u003c/p\u003e\n\u003cp\u003eEdward always preached: Trust no one. Ever.\u003c/p\u003e\n\u003cp\u003eOf course Edward led a life of paranoia. He had good reason to.\u003c/p\u003e\n\u003cp\u003eI\u0027d lived so long inside a stone compound, I wasn\u0027t sure whom to trust. But if I was going to put my faith in anyone, especially with information on the totem, Will would be the one.\u003c/p\u003e\n\u003cp\u003e\"My hand changed,\" I blurted.\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003eI made hooks of my fingers and growled.\u003c/p\u003e\n\u003cp\u003e\"You were able to transform one body part and nothing else?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never heard of a werewolf being able to do that before.\" Will offered the talisman. \"Show me.\"\u003c/p\u003e\n\u003cp\u003eI stared at the tacky white wolf for more than a minute before I took it. Closing my eyes, I thought of the moon. I waited for the icon to heat, shift, maybe whine. What I got was -\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" I opened my eyes. \"You think I\u0027m crazy?\"\u003c/p\u003e\n\u003cp\u003eWill contemplated me without any expression at all. \"I think it\u0027s daytime.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-dark-moon-nightcreature-3/page-14.html","bookId":2090,"creation":"Oct 5, 2019 5:39:23 PM","modification":"Oct 5, 2019 5:39:23 PM"}
