{"id":89956,"no":4,"title":"Page 4","content":"\u003cp\u003eThe force of the explosion sent us both to the ground. Through some acrobatic maneuver, Nic managed to cover my body with his.\u003c/p\u003e\n\u003cp\u003eDebris rained everywhere. My ears rang. I thought I\u0027d gone deaf until I realized the wolves were howling right next to my head.\u003c/p\u003e\n\u003cp\u003eNic eased off me. \"What was that?\"\u003c/p\u003e\n\u003cp\u003eI sat up, staring at the flaming compound. \"My guess is a really big bomb.\"\u003c/p\u003e\n\u003cp\u003e\"Bomb?\" He leaped to his feet. \"What makes you think a bomb?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the hotshot FBI agent. What does that look like to you?\"\u003c/p\u003e\n\u003cp\u003e\"Gas explosion?\"\u003c/p\u003e\n\u003cp\u003e\"If we had any gas out here. Electricity fired this place. And last time I checked, electricity doesn\u0027t cause fiery, explosive death.\"\u003c/p\u003e\n\u003cp\u003eHe peered at his suddenly dirty shoes for several ticks of the clock, then offered me a hand. \"You\u0027re right.\"\u003c/p\u003e\n\u003cp\u003eSince touching him was a stupid idea and kissing him had been an even worse one, I got up on my own.\u003c/p\u003e\n\u003cp\u003eWhen I touched people, bad things happened.\u003c/p\u003e\n\u003cp\u003eI contemplated the heat and the flames. Really bad things.\u003c/p\u003e\n\u003cp\u003eThe building was little more than a flaming crater. The guard was dead. I wasn\u0027t sure about the werewolves in the basement.\u003c/p\u003e\n\u003cp\u003eBurning the bodies after they\u0027d been shot with silver left ashes, but would a firebomb kill a werewolf? I didn\u0027t have a clue.\u003c/p\u003e\n\u003cp\u003eA chill came over me that had nothing to do with the wind. What if Billy were alive?\u003c/p\u003e\n\u003cp\u003eI swayed and almost fell. What if he were alive and free?\u003c/p\u003e\n\u003cp\u003eNic, who\u0027d been creeping closer to the blaze, hurried to my side and clutched my elbow. \"Are you dizzy?\"\u003c/p\u003e\n\u003cp\u003eI closed my eyes on another cheery thought. Not only did I have to worry about Billy, but my notes, my serum, the antidote were gone.\u003c/p\u003e\n\u003cp\u003e\"Elise, you\u0027d better sit down again.\"\u003c/p\u003e\n\u003cp\u003eI shook Nic off, took a deep breath, let it out slowly, then took another.\u003c/p\u003e\n\u003cp\u003e\"My work,\" I managed. \"Everything was inside.\"\u003c/p\u003e\n\u003cp\u003eHe blinked, glanced at the compound, then at me. \"You must have it backed up off-site.\"\u003c/p\u003e\n\u003cp\u003eTrue. However, I didn\u0027t know where that somewhere was. Only Edward did, and he was in Wisconsin.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t?\" Nic\u0027s voice was incredulous.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course. But there were things in there I\u0027m going to need.\"\u003c/p\u003e\n\u003cp\u003eI glanced at the sky, contemplating the lopsided, three-quarter moon.\u003c/p\u003e\n\u003cp\u003eSoon.\u003c/p\u003e\n\u003cp\u003eNic patted his pocket, and a bewildered expression crossed his face, followed almost immediately by a dawning understanding. \"Left my cell in the car.\"\u003c/p\u003e\n\u003cp\u003eDazed, I followed him around the crackling building to the front parking lot. He stopped walking, and I ran into his back.\u003c/p\u003e\n\u003cp\u003e\"Uh-oh,\" he muttered.\u003c/p\u003e\n\u003cp\u003eLeaning to the side, I saw the problem. The cars were on fire, too.\u003c/p\u003e\n\u003cp\u003e\"I guess that makes sense,\" Nic said, almost to himself. \"This kind of damage, usually a car bomb.\"\u003c/p\u003e\n\u003cp\u003eI guess he should know.\u003c/p\u003e\n\u003cp\u003e\"How many vehicles were supposed to be in this lot?\" he asked.\u003c/p\u003e\n\u003cp\u003eI glanced at the piles of fiery metal and counted. \"One less than we\u0027ve got.\"\u003c/p\u003e\n\u003cp\u003eHis lips tightened. \"Doesn\u0027t really tell us all that much, but I can get someone here who can. Got a phone?\"\u003c/p\u003e\n\u003cp\u003e\"In my office.\"\u003c/p\u003e\n\u003cp\u003e\"Great.\"\u003c/p\u003e\n\u003cp\u003eHe scrubbed his fingers through his hair, leaving a few strands standing on end. If he hadn\u0027t been six-three and about two-twenty, he would have looked like a little boy with cowlicks. As it was, I found myself charmed far beyond what was good for me.\u003c/p\u003e\n\u003cp\u003e\"This makes no sense,\" he continued. \"Why would anyone want to blow up a medical research facility?\"\u003c/p\u003e\n\u003cp\u003eSince we were a lot more than that, there were quite a few people, and nonpeople, too, who would love to blow J-S headquarters to hell and gone. Not just the building, either, but me, Edward, and any other agents they could take out in the process.\u003c/p\u003e\n\u003cp\u003eWe didn\u0027t need the FBI here. Lord knows what else they might uncover when they started sifting through the rubble. If I could get to a phone ahead of Nic, Edward would take care of the cover-up.\u003c/p\u003e\n\u003cp\u003eA cool wind sifted through the trees, bringing with it the scent of winter. We\u0027d been lucky so far; it was November and we\u0027d only had a dusting of snow. I glanced to the west where dark clouds billowed on the horizon. That was about to change.\u003c/p\u003e\n\u003cp\u003eSomething cracked and fell inside the smouldering crater, the sound echoing through the forest. A wolf yipped, beyond the fence, not one of mine, and I started to get nervous about being in the open without a gun.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the nearest town?\" Nic asked.\u003c/p\u003e\n\u003cp\u003e\"Sixty miles, give or take.\"\u003c/p\u003e\n\u003cp\u003eHis stare was blank. He couldn\u0027t get his mind around the concept. \"Where do you live?\"\u003c/p\u003e\n\u003cp\u003eI pointed to the flames.\u003c/p\u003e\n\u003cp\u003e\"You live and work here?\"\u003c/p\u003e\n\u003cp\u003e\"There isn\u0027t anywhere else.\"\u003c/p\u003e\n\u003cp\u003eBesides, I worked all the time. Why bother to rent elsewhere, even if it was safe to do so?\u003c/p\u003e\n\u003cp\u003eSure, sometimes I left the compound, even the state, on special orders from Edward. But once those orders were completed, I hurried back and disappeared once more behind the locked doors.\u003c/p\u003e\n\u003cp\u003e\"What about groceries, clothes... ?\" He spread his big hands wide. \"Stuff and junk?\"\u003c/p\u003e\n\u003cp\u003e\"Supplies arrive twice a month.\"\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, then shut it again, and his eyes narrowed. \"There\u0027s more to this place than medical research, isn\u0027t there?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer. In the end, I didn\u0027t have to.\u003c/p\u003e\n\u003cp\u003eA shadow scooted behind a tree at the edge of the parking lot. I turned that way, wishing like hell I\u0027d brought my gun. Nic had one, but without silver bullets it wouldn\u0027t do much good against most of the things that were after me. Still...\u003c/p\u003e\n\u003cp\u003eI reached for Nic\u0027s arm, planning to ask for his weapon, or at least tell him to pull it out, and the shadow shimmered, almost taking form, before blending into the half-darkness once again. Curious, I let my hand drop and took a step toward the trees.\u003c/p\u003e\n\u003cp\u003eA sound came from the woods, one I\u0027d heard only a few times before. However, when dealing with gunshots, once is more than enough. I yanked Nic with me to the ground.\u003c/p\u003e\n\u003cp\u003eThe bullet whistled through the air where our heads had been, then thunked into something solid on the other side of the parking lot.\u003c/p\u003e\n\u003cp\u003eI glanced at Nic. He had a Glock in his hand, and I hadn\u0027t even seen him move. Impressive.\u003c/p\u003e\n\u003cp\u003e\"Where did that come from?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"There.\"\u003c/p\u003e\n\u003cp\u003eI pointed to the tree where I could have sworn I saw the shape of a human being - except in my world, they might not be human anymore.\u003c/p\u003e\n\u003cp\u003eIf Billy was alive, he wouldn\u0027t bother with a gun. He had so many better weapons in his arsenal. Besides, Billy was the kind of guy who liked to get his hands, as well as his fangs, dirty.\u003c/p\u003e\n\u003cp\u003eNic made a move to get up, and I pulled him down. \"I don\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going to be a sitting duck. I\u0027ve got a gun, too.\"\u003c/p\u003e\n\u003cp\u003eWhich wouldn\u0027t do him a bit of good when shooting at a werewolf.\u003c/p\u003e\n\u003cp\u003eThe conundrum made me hesitate long enough for Nic to slip out of my reach. Instead of running into the woods, he stared at me with narrowed eyes. \"Who did you piss off, Elise?\"\u003c/p\u003e\n\u003cp\u003e\"Me? Who says they weren\u0027t trying to kill you?\"\u003c/p\u003e\n\u003cp\u003eHis eyes widened. Guess he hadn\u0027t thought of that.\u003c/p\u003e\n\u003cp\u003eNic lifted the leg of his slacks and handed me a .38 from the ankle holster. \"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eHe headed into the forest. When no shots were fired, I concluded that whoever had been there was gone.\u003c/p\u003e\n\u003cp\u003eI inched across the parking lot, avoiding the burning piles of metal that had once been cars. Gauging the trajectory from the tree where I\u0027d seen the shadowy figure, to the area where we\u0027d been standing, then beyond, I was able to find the bullet embedded in a smoldering signpost.\u003c/p\u003e\n\u003cp\u003eThe spent ammo looked like any other. However, my fingers burned the instant I brought them close to the bullet. The reaction could have been from the continuing heat of the fire, except it wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eThe bullet was silver.\u003c/p\u003e\n\u003cp\u003e\"Huh,\" I murmured as I drew back my hand. \"Guess they were after me.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-creature-dark-moon-nightcreature-3/page-4.html","bookId":2090,"creation":"Oct 5, 2019 5:39:23 PM","modification":"Oct 5, 2019 5:39:23 PM"}
