{"id":30448,"no":22,"title":"CHAPTER XXII A LITTLE LAME DUCK","content":"\u0026nbsp;“I WISH Sardis could go to that place where the lovely ducks are,” said Dolly Merrifield the next morning. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll have to tell him about it,” advised Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won’t be seeing,” sighed Dolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly’s eyes widened with a sudden thought, then narrowed as a plan began to form.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If your brother will stay over until to-morrow, we will drive up to Lairnie Lake and have our lunch there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-day?” cried Dolly ecstatically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a small pleasure resort,” she explained to the young man, “some forty-five miles to the north.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Sardis!” exclaimed the little one, her blue eyes begging for the answer which he hesitated to give.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ought not,” he began, and then smiled down to the small girl on his knee.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are the web-footed swimmers on Lairnie Lake very different from those elsewhere?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, ever so different!” she laughed. “But I’m[178] not going to tell you one word more. He’ll stay, Miss Dudley! I know by his eyes—they are full of nice twinkles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was decided that Polly and Lilith, Dolly and her brother, and Dr. Abbe should take a flying trip to the lake which a number of them had visited a week or two previous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolly, in an ecstasy of joy, kept things lively until the start. After being dressed for the little journey she was put in her wheel-chair which stood near the edge of the piazza, and, bubbling over as she was with eager delight, she twisted this way and that until Polly was startled by one of her sudden turns.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Dolly!” she cried, “do sit still! I thought you were going over!” She crossed the piazza and moved the chair back a bit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall not fall,” laughed the child happily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wis’ she would!” piped up a little voice three chairs away, “wis’ she would, and be all deaded!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, Marmaduke Bill!” Polly’s voice was shocked. “What a wicked wish!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t care!” retorted the little boy. “Wis’ she would!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly walked over to Little Duke and turned his chair so that it faced the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry that you have such naughty thoughts,” she said in a soft voice. And she left him without the smile or the loving pat with which she was used to delight his heart.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [179] “My don’t care! My don’t care!” he pouted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other children looked on with frightened, wondering eyes. It was seldom that Polly dealt out punishment even in this mild fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, after she had gone upstairs, Sardis Merrifield came across from the Study, and taking a book from his pocket began to read.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Little Duke had been humming to himself in a loud, disagreeable way, and now, he opened his mouth and uttered a series of unintelligible sounds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young man looked over to the chair with its face to the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not quite so much noise, please!” His voice was kind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clamor went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Little boy, did you hear what I said?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yep!” And the shouts continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The children sat breathless, open-mouthed and wide-eyed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you stop that screaming?” the man said quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did Mi’ Duddy say My must stop?” piped the little offender.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I say so,” was the firm answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does My have to mind you, too?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely you do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolly snickered noiselessly into her hand; but not a sound came from Little Duke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Upstairs Polly had heard and had hastened her dressing, standing poised at the head of the stairs[180] when the last of the conversation floated up to her. She waited a moment. The veranda was hushed, and with a smile she returned to her room. She was not needed to keep the peace as long as Sardis Merrifield was there. The White Nurse and Lilith had had more than one battle with strong-willed Little Duke when it had been needful to summon Polly before the lovable little rogue could be subdued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the party assembled on the veranda Polly noticed that the boy’s chair had been wheeled about, and as she glanced that way he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mi’ Duddy, My thought you could take a joke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I can, Little Duke. Good-bye and a happy day to you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He grinned gleefully, and she explained to Sardis Merrifield as they drove away, “That is his apology. He never fails to have it ready on time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not far from noon they arrived at the pleasure ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, dear!” cried the little girl, “the ducks are not any of them here!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are up at the other end of the lake.” Polly pointed across the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But that isn’t here,” mourned the child.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If they won’t come to us, we shall have to go to them,” her brother replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They will be here soon enough,” laughed Lilith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [181] Yet Dolly saw no hope; her longing eyes were fastened upon those far-away birds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As time was precious and the long ride had made them hungry, Polly proposed luncheon at once, and selecting a pleasant spot they arranged seats and began to take out sandwiches. Dolly was so interested in the preparations that for the moment ducks were forgotten.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look!” bade Sardis. “See that big V!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” exulted Dolly, “it’s a duck—and he’s coming this way!” She watched the rippling V, and then said softly, as if half afraid to utter so beautiful a thought, “Do you s’pose he saw me and—knows me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He saw you, no doubt; but recognition would hardly be possible at that distance, would it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolly sighed a little. “No, of course, he couldn’t,” she answered. Then she chuckled joyously. “He’s steering straight for me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It did seem so, and climbing up the grassy bank, the duck waddled directly to the little girl’s side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you dear ducky-darling!” she exclaimed. “And you’re the little lame one I fed the other day, aren’t you? See, Sardis! he’s lame just a wee bit when he walks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quack! quack!” said the duck.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolly gave up the greater part of her sandwich, for the bird had a holiday appetite, and as soon as one morsel was down he quacked for more.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [182] “Isn’t his neck a lovely green!” the child cried. “And isn’t he tame and beautiful!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sardis and the others admired and marveled to Dolly’s content. And then, she suddenly gave a shout of joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, the rest are coming! Look at the V’s! One, two, three, four, five, six, seven, eight! Eight ducks more! And there is the great goose!” as a big bird swam out to join his comrades.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were all counting on their noon luncheon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is well we brought a good supply,” laughed Lilith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll need it—look!” Dr. Abbe pointed his thumb backward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “O-h!” screamed Dolly, “the dear little doves!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A small flock of pigeons had alighted near.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were tamer than the ducks. They fluttered about the child. One bird perched on her shoulder, another on her knee; the most venturesome flew to her wrist and reached for a bit of the bread in her hand. Dolly sat breathless, her little face radiant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had my camera,” whispered Lilith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolly suddenly turned towards her brother whir-r-r-r! The child stared in wonderment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What made them fly away?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Which do you like best,” questioned Lilith, “pigeons or ducks?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My little lame duck!” answered Dolly promptly, bestowing upon the bird a generous bit.[183] “Oh, the naughty thing!” she cried, as another duck caught up the dainty and then pecked and chased away the afflicted one. But Dolly’s pet returned, and with the aid of Sardis the child gave it a good meal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The half-circle of quacking beggars became vociferous, and Dolly fed them until her sandwiches must needs be often replaced, and the giver herself would have been in danger of going hungry if some one had not given out food with a prodigal hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally the luncheon was over, and the little girl—with a flourish of her small hands—told the birds that they could have no more. Promptly the ducks started off. Only the little lame one seemed reluctant to leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He loves me—that’s why,” announced Dolly. “All the rest care for is something to eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The child’s eyes followed the birds as they swam out from shore. Then she gave a little scream.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he’s drowning! he’s drowning!” she cried, as a big duck appeared to be standing on his head in the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Watch!” was all Sardis said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, my! he’s eating!” gasped Dolly. “He’s catching bugs! How funny!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were all at it, excepting the lame duck that had squatted at the child’s feet for a nap, and Sardis carried his sister nearer the shore where she[184] watched the birds delightedly, stopping now and then to give her pet a tiny pat, for he had promptly followed her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sardis had a moment’s talk with Polly and then disappeared. He was away so long that Dolly made inquiries. Nobody seemed to know anything of him, unless it were Polly, and her answers to the child’s questions were unsatisfactory. Then, suddenly, she was gone, too.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sardis came over the knoll and beckoned to Miss Dudley,” explained Lilith, “and they went off together towards the street. That’s all I know about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care, if he’s with Miss Dudley,” returned Dolly. “I was afraid he was lost.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Which made Dr. Abbe laugh so heartily that the little girl wondered what he had seen that was funny.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a while the runaways returned, and then it was time to start for home. Before that, however, Polly took Lilith and Dolly for a short drive around the beautiful Loch Lairnie, which Dolly enjoyed talkatively every moment of the way. Only she did want Sardis to see it, and she could not understand why he didn’t come, when there was plenty of room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It had grown cool, so for the home drive Dolly rode in her brother’s arms on the front seat. Presently she went to sleep and awoke saying that she had been dreaming about her little lame duck, and that he quacked her wide awake.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [185] “There! I never bade him good-bye!” she lamented. “Why didn’t I think of it! I wonder you didn’t remind me, Sardis; you always think of everything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sardis laughed, and then Polly laughed, too. What was funny about that?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Next morning Dolly’s brother took her in his arms and strode up to the little brook at the edge of the woods. For an instant the child stared in silence. Then her amazement broke into words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why-ee!” she gasped; “it looks like my little lame duck! But how did he get here? Did he follow me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not quite,” laughed her brother. “He came with you, he and his comrade.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In the car?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sardis nodded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “O-h!” cried Dolly comprehendingly; “that’s why you and Miss Dudley laughed! That’s why everybody laughed! And I did hear them quack, didn’t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably, for the rest of us did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might have known there was something, for you always love to surprise me—I love it, too,” she chuckled, nestling her cheek to his.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And are they going to stay and live right here?” she questioned later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, they are yours. Miss Dudley thought the brook would answer very well for their swimming-place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [186] “It’s lovely—you don’t s’pose they’ll be homesick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not a bit.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I wish I had something to feed them with!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A little basket of crumbs pushed its way into Dolly’s hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, Miss Dudley, I didn’t know you were here!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I came just in time to hear your wish. I thought you’d be wanting to feed them about now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You guessed right. Isn’t Sardis the best Sardis in the world to give them to me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t much of a compliment, Lady Merrifield,” laughed her brother. “There are not many Sardises for me to compete with.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For an instant the child looked blank. Then she brightened. “Anyway, you’re the best brother in the world!” she exclaimed. “You can’t say anything against that!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I could say a good deal against it,” smiling across to Polly; “but I won’t, for”—his face suddenly sobered—“I am mighty glad you think so, Dorothy.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2764/76290.html","bookId":1338,"creation":"Aug 5, 2019 2:19:51 AM","modification":"Aug 5, 2019 2:19:51 AM"}
