{"id":30455,"no":29,"title":"CHAPTER XXIX TROUBLE IN THE KITCHEN","content":"\u0026nbsp;THEY had been three days without Benedicta, and she was missed more than she could have been made to believe. Nothing seemed the same. Even the mountain was apparently farther removed from the world of people and homes and all that goes to make life the joy it can be. The food question had not troubled any of them very much, for the housekeeper’s latest baking was not yet exhausted. It was so much diminished, however, that Polly and Lilith had held converse at least twice on the subject, ending with, “Well, we’ll get along some way.” The children were easy, milk being their chief diet; but Mrs. Daybill and Dr. Abbe—! Both Polly and Lilith shook their heads over these two. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Three more days passed, and still Mrs. Wheatley was too ill to admit of Benedicta’s return to Sunrise Chalet. Grocer Jack brought word that she would come back and “cook up a lot of victuals” as soon as she could be spared, but she did not know when that would be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going to make some cookies,” declared Polly. “The children must be longing for them, though they’re good not to tease. You know I did make some once with Benedicta’s help.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [252] “Yes, and they were delicious,” said Lilith. “You can use Benedicta’s recipe if you have forgotten just how.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, she hadn’t any! I didn’t think of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Those are simple. Can’t you manage them without a recipe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly wagged her head doubtfully. “I think cookies are rather hard to make and have them come out just right. I can try, though maybe I shall have to eat them all myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll help if the batch is spoiled,” laughed Lilith. “It is the bread question that is worrying me. I am so tired of baker’s bread. Perhaps I had better try some muffins first; they don’t take any time to make. Dear me, I didn’t dream that baking was such a bother. If only Benedicta had recipes for such things; but she takes a little of this and a little of that—and it’s done!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly’s cookies were hard enough—so she herself averred—to break the children’s teeth into flinders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe I could play ball with them against the garage, and they wouldn’t crack,” she declared disgustedly. “I’m going over to Mrs. Swan’s to see if she has a cooky recipe. Wonder why I didn’t think of it before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She tried again the next day, and this time the little cakes could not be accused of hardness; they were so rich and crumbly that they came from the pan in pieces.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [253] “Anyway, they taste good,” comforted Lilith. “I wish my muffins had come out as well as these.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor Lilith! the muffins that she had risen early to make for breakfast had been so heavy and unpalatable that they were fed to the chickens and ducks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In vain the girls coaxed Mrs. Daybill to try her “luck,” but she asserted that she never could do anything without a recipe and that she wasn’t going to waste time in trying.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I had dreamed that I’d need it I would have brought my recipe book along.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better send for it,” advised Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By that time Benedicta would be back,” the other returned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to Overlook this afternoon to buy one,” declared Polly. But, to her chagrin, among her numerous purchases it was forgotten.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Lilith grew desperate, and, borrowing a recipe from Sally Robinson, made some rolls for tea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dr. Abbe says they are the best he ever ate,” she told Polly, a new flush on her cheeks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For several days Polly had noticed that Lilith had been repeating this and that which “Dr. Abbe said.” It was unusual for Lilith. Now Polly smiled across into her friend’s eyes, and the blush on her cheeks grew deep. That night, at bedtime, she knocked on Polly’s door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw your light,” she apologized; “may I[254] come in?” Yet when the door was shut behind her she hesitated, her eyes downcast, the color fluttering in her cheeks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly drew her down to the couch. “Tell me,” she encouraged. “Is it some good news?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you guessed?” Lilith’s happy eyes looked up in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dr. Abbe?” smiled Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other nodded, blushing deliciously. “I haven’t told anybody but mother. I wanted you to know. He says—this isn’t going to—to hurt you, Polly?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bless you, no!” Polly caught the pink face between her palms and kissed the sweet mouth. “I’m so glad, Lilith. I can’t tell you how glad. It is what I have wanted for a good while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But listen! He says he liked me from the first, but that he didn’t suppose I’d ever care a rap for him, and he says one day you happened to say something about me—I guess praised me up a little—you know, as you do sometimes—and it made him wonder if I ever could care. It was after that he asked me to go to Skyboro with him—the day of the thunder-storm—and since then he has come in my way more or less. Still, I didn’t think he was in earnest. I thought all the time that he was in love with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m glad you are mistaken,” said Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So am I,” confessed Lilith, “if you don’t care for him. I shouldn’t be happy a bit if you did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [255] Polly lay awake long after she had put out her light, thinking, thinking. Things with Lilith had gone just as she wanted them to go. If she could only know how David felt! Would he wish to hold her to a promise she had never made? She fell asleep and dreamed that she was being married to him, under an arch of sunflowers! She awoke with a shiver, unutterably thankful that it was a dream.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning a messenger rode up from Overlook with a special-delivery letter for Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She glanced at the envelope, and a frightened look flashed into her face. Upstairs she darted. A few minutes later she sought Lilith—her ready refuge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come right into my room and try to think what we can do!” she demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it?” Lilith was plainly startled as she followed Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s awful!” exclaimed Polly in a hushed voice. “Sardis Merrifield wants to come here and spend his vacation,—two weeks!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Goodness! Sardis Merrifield!” Lilith sank back in her rocker, limp with the overpowering news.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And think of my cookies!” Polly laughed hysterically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lilith shook her head in despair. “We can’t have him! Did he telegraph?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No—special-delivery. He says that unexpectedly[256] he is to have his vacation now, and he asks if it will be convenient for him to come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell him no!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how can I refuse—there’s Dolly!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lilith scowled savagely. “I feel like swearing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly broke into a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t!” Lilith was almost in tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d cry if ’twould help us out, but it won’t. If I ever stay home long enough I’ll learn to cook. Mother knows every twist and turn of cookery—why didn’t I have her teach me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Same here!” Lilith jerked out. “There’s no sense in a girl’s not knowing how to make bread and roast meat and all that. See how I spoiled the dinner this noon! I was so mortified it choked me—I couldn’t eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It wasn’t so bad,” fibbed Polly sympathetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know! I’ve eaten Benedicta’s pot roasts. It was horribly burned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, this isn’t getting us anywhere,” said Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If only we could see Benedicta coming up the road! That’s the way it would happen in a story.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won’t happen in our story,” retorted Polly with a little laugh. “I’m sorry enough to cry for poor Dolly—we mustn’t ever let her know—but I will write to Sardis M. that he can’t come till Benedicta gets home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Polly, you mustn’t!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [257] “You told me to. And what else is there to do? We can’t ask him to come and eat such stuff as we’ve been having for the last day or two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” agreed Lilith with a doleful sigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They carried the letter to Overlook that afternoon, and received an answer on the second day thereafter. Polly opened it behind closed doors, only Lilith looking on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” she gasped; but Lilith could not tell whether it was of relief or dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She caught the sheet as Polly tossed it over to her, and read:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dear Miss Dudley: I cannot leave you in such a dilemma. I will bring up a new cook to-morrow. Then if you don’t want me to stay, I’ll go.\n\u003c/div\u003e \n\u003cdiv\u003e\n With love for Dorothy\n\u003c/div\u003e \n\u003cdiv\u003e\n Faithfully yours\n\u003c/div\u003e \n\u003cdiv\u003e\n Sardis Merrifield\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some of those country women,” said Lilith. “I’m afraid she won’t suit Dr. Abbe—he’s dreadfully finicky.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Country women generally know how to cook,” returned Polly. “Anyway, it won’t be our lookout if she doesn’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe it’s the girl he boards with,” suggested Dolly a while later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he board with a girl?” laughed Polly. The laugh did not sound true.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Dolly, “it’s the girl’s mother[258] that keeps him, but he says the girl makes beautiful things to eat.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s probably the one,” agreed Lilith.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly jumped up and ran to see if the blackberries on the stove were burning.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2764/76297.html","bookId":1338,"creation":"Aug 5, 2019 2:19:51 AM","modification":"Aug 5, 2019 2:19:51 AM"}
