{"id":30433,"no":7,"title":"CHAPTER VII GLADYS GUINEVERE","content":"\u0026nbsp;THE sun was radiant; the sky wore a most alluring blue dress; the breeze was sending up little velvety waves and ripples from the south;—Polly wanted Outdoors. As she gazed from the open window she grew eager. Her mother happened in and proposed to stay awhile and give Polly a chance. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl looked around the ward, and considered. There was Timmy—Jozy—She hesitated at Clementina and finally shook her head with a sad little frown. Her eyes passed to Grissel, and brightened—Timmy and Jozy and Grissel. That was enough.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She glanced across at her mother who was giving Little Duke a drink.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is father away?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Learning that he was in the hospital, she went in search of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would Timmy and Grissel and Jozy be any worse for a little ride?” she questioned, her anxious eyes on her father’s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a moment she was running up the stairs, stopping only for a word with an orderly. When she entered Paradise Ward her face was as bright as if she had just been made heir to a fortune.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [53] For the next ten minutes she and her mother were busy bringing out coats and hats and putting the three fortunate little patients into their wraps.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are we going to sit on the veranda now?” queried Jozy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Mrs. Dudley only smiled mysteriously. It would never do to tell too much to the part of the ward that must stay at home—there might be tears. But, as two orderlies carried the lucky ones out through the corridor and downstairs, those who were left behind knew that something unusual was afoot. If Clementina and the rest could have looked round the corner of the building they would have seen the three packed snugly into the Doctor’s big, easy car, to the music of gurgling laughter and silver-toned tongues.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Straight to the blossoming fields and piney air they were borne, and the children chattered and giggled as only children can, while Polly drew in deep draughts of the freshness of mountain and wood, and wondered how the dwellers in city prisons ever lived through the summer at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nearing a neighboring town, their road led through a street bordered with miserable dwellings and swarming with sinister men and women and ragged, pinched-faced children. Polly looked at them with pity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The car swerved suddenly, to avoid a crossing team, and Jozy uttered a wild “Oh!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [54] Polly glanced back at her charges with a reassuring smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My handkerchief!” screamed Jozy, pointing to the little square of white that had fluttered away from her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But already an eagle-eyed youngster had pounced upon the flyaway. With a joyful grin she brought it to the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, thank you!” cried the owner in a relieved voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Evan was starting up again when Polly arrested him. “Just a minute!” she said. Something in the girl’s wistful little face attracted her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you like a ride?” she asked, throwing open the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The black eyes widened. The child drew a step nearer, then stopped with a dazed expression. She must have been mistaken!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you come?” Polly held out her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nothing further was needed. In a short moment the little one was wedged between Polly and Evan, her face radiant with pleasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wonder-eyed youngsters popped out from everywhere and closed in about the car.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The driver waved them off, there was a bur-r-r-r-r, and the automobile disappeared around the next corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s ezac’ly like flyin’, ain’t it?” piped a rapturous voice at Polly’s elbow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you like it?” smiled Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [55] The child looked up with an ecstatic wag of the head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh!” she burst out, leaning forward and waving her hand excitedly, “there’s Dolly Merrifield! An’ she saw me a-ridin’! She waved to me! Did you see her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” smiled Polly, having glimpsed at the window of a small gray house a tiny waving hand and a little white face in a halo of fluttering yellow curls.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m so glad she saw me a-ridin’,” the eager voice went on. “I’ve wanted to an’ wanted to, till it seemed ’s if I couldn’t stan’ it. An’ now I’m in an’ goin’!” She sighed delightedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t you ever been in an automobile before?” was Polly’s somewhat surprised question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The small head shook vigorously. “How’d yer s’pose I’d git in?” she scorned. “Ther’ ain’t none of ’em stop, ’cept the grocery boy an’ the water-pipe man an’ such, an’ they say, ‘You let me ketch yer in that car, an’ I’ll hand yer over t’ the p’lice—now d’ yer hear!’ An’ you bet I ain’t goin’ t’ take no such chances ’s that! Johnny Hurley did, one day, whopped right in over the door, an’ the man give him a lickin’, ’cause he was his cousin—my, didn’t he! Johnny couldn’t set down straight all day.” Presently there came another outburst. “Oh, wouldn’t Dolly Merrifield like this!—Do you know Dolly?” Polly shook her head.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [56] “Oh, you oughter! Say”—the brightness faded from the little face—“wouldn’t you’ve took her to ride ’stead o’ me if you’d known her? I guess I’d oughter let Dolly go—I didn’t think. Honest, I didn’t! But I guess I’d oughter.” She sighed heavily at this prodding of conscience.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you needn’t worry about that!” comforted Polly. “We can take Dolly another time, you know. Tell me about her. Who is she?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, she’s Dolly Merrifield! An’—oh, she’s the sweetest little thing you ever saw! She’s got the littlest legs—just like our baby’s! An’ she don’t never walk! She don’t never stand up! An’ she don’t cry nor nothin’, ’cept when the lady didn’t come to take her to ride—then she did, good an’ hard. Oh, that lady’s just as mean! I wish she had to sit in a chair all day long, ’ithout anything to do, an’ be all alone, an’ never go to ride in all her life—so there!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The animated face had grown red and scowly during the utterance of this bitter wish. Now it unexpectedly broke into a delighted grin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did yer honest mean for sure you’d take Dolly to ride?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, ‘honest, for sure,’” laughed Polly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I hope the lady’ll see her,” the child resumed. “She goes to ride every day—two or three times a day! She used to be real pretty; but I don’t take no stock in her now—her a-promisin’ Dolly—an’ Dolly a-waitin’ an’ a-waitin’—an’[57] her never comin’! Dolly wored her eyes out watchin’ for her—Mis’ Edmonson said she had. Oh, I jus’ hope she will see Dolly when you take her—then I guess!” The small head was brought down decidedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven’t told me your name yet,” Polly smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, my name is Gladys Guinevere Evangeline Smith! But you needn’t go through all that rigmarole, you can call me Gay; everybody does. An’ ter think of me a-ridin’!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the car stopped in front of Gladys Guinevere’s home it found itself the center of a crowd of girls and boys, mothers and babies, with an occasional lounger who quite casually started to walk across the street in front of the machine and quite as casually stopped on the outside of the circle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Polly was many times obliged to reiterate her promise to take “Dolly” to ride; but at last all the questions had been asked and answered and all the “thank-you’s” and “good-byes” had been said. Then, amid the scattering onlookers, with much waving of hands on both sides, the car rolled away.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2764/76275.html","bookId":1338,"creation":"Aug 5, 2019 2:19:50 AM","modification":"Aug 5, 2019 2:19:50 AM"}
