{"id":22458,"no":18,"title":"CHAPTER XVII. DAYLIGHT.","content":"\u0026nbsp;A new day dawned for me on the twenty-fifth of February. I rose as usual a few minutes before six. It was the morning of my release, or in prison language my \"discharge.\" Yet I felt no excitement. I was as calm as my cell walls. \"Strange!\" the reader will say. Yet not so strange after all. Every day had been filled with expectancy, and anticipation had discounted the reality. \n\u003cdiv\u003e\n Instead of waiting till eight o\u0027clock, the usual breakfast hour, superintendent Burchell brought my last prison meal at seven. I wondered at his haste, but when he came again, a few minutes later, to see if I had done, I saw through the game. The authorities wished to \"discharge\" me rapidly, before the hour when my friends would assemble at the prison gates, and so lessen the force of the demonstration. I slackened speed at once, drank my tea in sips, and munched my dry bread with great deliberation. \"Come,\" said superintendent Burchell, \"you\u0027re very slow this morning.\" \"Oh,\" I replied, \"there\u0027s no hurry; after twelve months of it a few minutes make little difference.\" Burchell put the words and my smile together, and gave the game up.\n\u003c/div\u003e \n\u003cdiv\u003e\n Down in the bathroom at the foot of the debtors\u0027 wing my clothes were set out, and some kind hand had spread a piece of bright carpet for my feet. I dressed very leisurely. With equal tardiness I went through the ceremony of receiving my effects, carefully checking every article, and counting the money coin by coin. The Governor tendered me half a sovereign, the highest sum a prisoner can earn. \"Thank you,\" I said, \"but I can\u0027t take their money.\" We had to go through the farce.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the little gate-house I met Mr. Bradlaugh, Mrs. Besant, and my wife. Colonel Milman wished us good-bye, the gate opened, and a mighty shout broke from the huge crowd outside. From all parts of London they had wended in the early morning to greet me, and there they stood in their thousands. Yet I felt rather sad than elated. The world was so full of wrong, though the hearts of those men and women beat so true!\n\u003c/div\u003e \n\u003cdiv\u003e\n As our open carriage crawled through the dense crowd I saw men\u0027s lips twitching and women shedding tears. They crowded round us, eager for a shake of the hand, a word, a look. At length we got free, and drove towards the Hall of Science, followed by a procession of brakes and other vehicles over half a mile long.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a public breakfast, at which hundreds sat down. I took a cup of tea, but ate nothing. After a long imprisonment I could not trust my stomach, and I had to make a speech.\n\u003c/div\u003e \n\u003cdiv\u003e\n After Mr. Bradlaugh, Mrs. Besant and the Rev. W. Sharman (secretary of the Society for the Repeal of the Blasphemy Laws), had made speeches, which I should blush to transcribe, I rose to respond. It was a ticklish moment. But I found I had a voice still, and the words came readily enough. Concluding my address I said: \"I thank you for your greeting. I am not played out. I am thinner. The doctor told me I had lost two stone, and I believe it. But after all I do not think the ship\u0027s timbers are much injured. The rogues ran me aground, but they never made me haul down the flag. Now I am floated again I mean to let the old flag stream out on the wind as of yore. I mean to join the rest of our fleet in fighting the pirates and slavers on the high seas of thought.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour afterwards my feet were on my own fender. I was home again. What a delicious sensation after twelve months in a prison cell!\n\u003c/div\u003e \n\u003cdiv\u003e\n Friends prescribed a rest at the seaside for me, but I felt that the best tonic was work. In less than three days I settled everything. I resumed the editorship of the Freethinker at once, and began filling up my list of engagements. On meeting the Committee, who had managed our affairs in our absence, I found everything in perfect order, besides a considerable profit at the banker\u0027s. Messrs. A. Hilditch, R. O. Smith, J., Grout and G. Standring had given ungrudgingly of their time; Mr. C. Herbert, acting as treasurer, had kept the accounts with painstaking precision; and Mrs. Besant had proved how a woman could take the lead of men. Nor must I forget Mr. Robert Forder, the Secretary of the National Secular Society, who acted as shopman at our publishing office, and sustained the business by his assiduity. I had also to thank Dr. Aveling for his interim editorship of the Freethinker, and the admirable manner in which he had conducted Progress.\n\u003c/div\u003e \n\u003cdiv\u003e\n The first number of the Freethinker under my fresh editorship appeared on the following Thursday. In concluding my introductory address I said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"I promise the readers of the Freethinker that they shall,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;so far as my powers avail, find no diminution in the vigor and\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;vivacity of its attacks on the shams and superstitions of our age.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Not only the writer\u0027s pen, but the artist\u0027s pencil, shall be busy\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;in this good work; and the absurdities of faith shall, if possible,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;be slain with laughter. \u0026nbsp;Priests and fools are, as Goldsmith said,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the two classes who dread ridicule, and we are pledged to an\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;implacable war with both.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The artist\u0027s pencil! Yes, I had resolved to repeat what I was punished for. I left written instructions against the publication of Comic Bible Sketches in the Freethinker during my imprisonment; but although I would not impose the risk on others, I was determined to face it myself. A fortnight after my release the Sketches were resumed, and they have been continued ever since. My reasons for this decision were expressed at a public banquet in the Hall of Science on March 12. I then said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"Mr. Bradlaugh has said that the Freethought party—which no\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;one will dispute his right to speak for—looks to me, among\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;others, after my imprisonment, to maintain with dignity whatever\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;position I have won. \u0026nbsp;I hope I shall not disappoint the expectation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;But I should like it to be clearly understood that I consider\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the most dignified attitude for a man who has just left gaol\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;after suffering a cruel and unjust sentence, for no crime except\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;that of thinking and speaking freely, is to stand again for the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;same right he exercised before, to pursue the very policy for\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;which he was attacked, precisely because he was attacked,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;and to flinch no hair\u0027s breadth from the line he pursued before,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;at least until the opposition resorts to suasion instead of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;force, and tries to win by criticism what it will never win\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;by the gaol. \u0026nbsp;It is my intention to-morrow morning to drive\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;to the West of London, and to leave the first copy of this week\u0027s\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Freethinker pulled from the press at Judge North\u0027s house with\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;my compliments and my card.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Prolonged applause greeted this announcement, and I kept my word. Judge North had the first copy of the re-illustrated Freethinker and I hope he relished. At any rate, it showed him, as John Bright says, that \"force is no remedy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n At the banquet I refer to I was presented with a purse of gold, in common with Mr. Ramsey, and an Illuminated Address, which ran as follows:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"To GEORGE WILLIAM FOOTE, Vice-President of the National Secular\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Society, who suffered for twelve months in Holloway Gaol for the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;so-called offence of Blasphemy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"In offering you on your release this illuminated address, and\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the accompanying purse of gold, we do not seek to give you\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;recompense for the sufferings and insults which have been\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;heaped upon you. \u0026nbsp;We bring them only as a symbol of our thanks\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;to you—thanks, because, on your trial, you spoke nobly for\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;the right of free speech on religious questions; thanks,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;because you bore, without a sign of flinching, a sentence\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;at once cruel and unjust; thanks, because you have carried\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;on our days the traditions of a Freethought faithful in the\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;prison as on the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"Signed on behalf of the National Secular Society\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;C. BRADLAUGH, President.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;R. FORDER, Secretary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Greatly also did I value the greeting I received, with my two fellow prisoners, from the working men of East London. At a crowded meeting in the large hall of the Haggerston Road Club, attended by representatives of other associations, I was presented with the following address:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"The Political Council of the Borough of Hackney Workmen\u0027s Club\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;present this testimonial to George William Foote as a token of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;admiration of the courage displayed by him in the advocacy of\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;free speech, and in sympathy for the sufferings endured during\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;twelve months\u0027 imprisonment for the same under barbarous laws\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;unfitted for the spirit of a free people.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;\"Signed on behalf of the Council\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;ALFRED PIKE, President.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;CHAS. KNIGHT, Secretary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The largest audience that ever assembled at the Hall of Science listened to my first lecture, at which Mr. Bradlaugh presided, two days after my release. Seventeen hundred people crowded into a room that seats nine hundred, and as many were unable to gain admission. Similar welcomes awaited me in the provinces; and ever since my audiences, as well as the sale of my journal and writings, have been far larger than before my imprisonment. Hundreds of people, as they have told me, have been converted to Freethought by my sufferings, my lectures, and my pamphlets. I hope Judge North is satisfied.\n\u003c/div\u003e \n\u003cdiv\u003e\n To prevent a break-down in case of another prosecution, Mr. Ramsey and I clubbed our resources, and purchased printing plant and machinery, so that the production of the Freethinker and other \"blasphemous\" literature might be done under our own root. The bigots had proved themselves unable to intimidate us, and as we were no longer at the mercy of printers they gave up the idea of molesting us. May Freethinkers ever act in this spirit, and be true to the great traditions of our cause!\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3222/87853.html","bookId":704,"creation":"Aug 2, 2019 2:52:36 PM","modification":"Aug 2, 2019 2:52:36 PM"}
