{"id":19117,"no":1,"title":"CHAPTER I","content":"\u0026nbsp;It was Lady Windermere’s last reception before Easter, and Bentinck House was even more crowded than usual. \u0026nbsp;Six Cabinet Ministers had come on from the Speaker’s Levée in their stars and ribands, all the pretty women wore their smartest dresses, and at the end of the picture-gallery stood the Princess Sophia of Carlsrühe, a heavy Tartar-looking lady, with tiny black eyes and wonderful emeralds, talking bad French at the top of her voice, and laughing immoderately at everything that was said to her. \u0026nbsp;It was certainly a wonderful medley of people. \u0026nbsp;Gorgeous peeresses chatted affably to violent Radicals, popular preachers brushed coat-tails with eminent sceptics, a perfect bevy of bishops kept following a stout prima-donna from room to room, on the staircase stood several Royal Academicians, disguised as artists, and it was said that at one time the supper-room was absolutely crammed with geniuses. \u0026nbsp;In fact, it was one of Lady Windermere’s best nights, and the Princess stayed till nearly half-past eleven. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as she had gone, Lady Windermere returned to the picture-gallery, where a celebrated political economist was solemnly explaining the scientific theory of music to an indignant virtuoso from Hungary, and began to talk to the Duchess of Paisley. \u0026nbsp;She looked wonderfully beautiful with her grand ivory throat, her large blue forget-me-not eyes, and her heavy coils of golden hair. \u0026nbsp;Or pur they were—not that pale straw colour that nowadays usurps the gracious name of gold, but such gold as is woven into sunbeams or hidden in strange amber; and they gave to her face something of the frame of a saint, with not a little of the fascination of a sinner. \u0026nbsp;She was a curious psychological study. \u0026nbsp;Early in life she had discovered the important truth that nothing looks so like innocence as an indiscretion; and by a series of reckless escapades, half of them quite harmless, she had acquired all the privileges of a personality. \u0026nbsp;She had more than once changed her husband; indeed, Debrett credits her with three marriages; but as she had never changed her lover, the world had long ago ceased to talk scandal about her. \u0026nbsp;She was now forty years of age, childless, and with that inordinate passion for pleasure which is the secret of remaining young.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly she looked eagerly round the room, and said, in her clear contralto voice, ‘Where is my cheiromantist?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your what, Gladys?’ exclaimed the Duchess, giving an involuntary start.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My cheiromantist, Duchess; I can’t live without him at present.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Dear Gladys! you are always so original,’ murmured the Duchess, trying to remember what a cheiromantist really was, and hoping it was not the same as a cheiropodist.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘He comes to see my hand twice a week regularly,’ continued Lady Windermere, ‘and is most interesting about it.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good heavens!’ said the Duchess to herself, ‘he is a sort of cheiropodist after all. \u0026nbsp;How very dreadful. \u0026nbsp;I hope he is a foreigner at any rate. \u0026nbsp;It wouldn’t be quite so bad then.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I must certainly introduce him to you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Introduce him!’ cried the Duchess; ‘you don’t mean to say he is here?’ and she began looking about for a small tortoise-shell fan and a very tattered lace shawl, so as to be ready to go at a moment’s notice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course he is here; I would not dream of giving a party without him. \u0026nbsp;He tells me I have a pure psychic hand, and that if my thumb had been the least little bit shorter, I should have been a confirmed pessimist, and gone into a convent.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, I see!’ said the Duchess, feeling very much relieved; ‘he tells fortunes, I suppose?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And misfortunes, too,’ answered Lady Windermere, ‘any amount of them. \u0026nbsp;Next year, for instance, I am in great danger, both by land and sea, so I am going to live in a balloon, and draw up my dinner in a basket every evening. \u0026nbsp;It is all written down on my little finger, or on the palm of my hand, I forget which.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But surely that is tempting Providence, Gladys.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear Duchess, surely Providence can resist temptation by this time. \u0026nbsp;I think every one should have their hands told once a month, so as to know what not to do. \u0026nbsp;Of course, one does it all the same, but it is so pleasant to be warned. \u0026nbsp;Now if some one doesn’t go and fetch Mr. Podgers at once, I shall have to go myself.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Let me go, Lady Windermere,’ said a tall handsome young man, who was standing by, listening to the conversation with an amused smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Thanks so much, Lord Arthur; but I am afraid you wouldn’t recognise him.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If he is as wonderful as you say, Lady Windermere, I couldn’t well miss him. \u0026nbsp;Tell me what he is like, and I’ll bring him to you at once.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, he is not a bit like a cheiromantist. \u0026nbsp;I mean he is not mysterious, or esoteric, or romantic-looking. \u0026nbsp;He is a little, stout man, with a funny, bald head, and great gold-rimmed spectacles; something between a family doctor and a country attorney. \u0026nbsp;I’m really very sorry, but it is not my fault. \u0026nbsp;People are so annoying. \u0026nbsp;All my pianists look exactly like poets, and all my poets look exactly like pianists; and I remember last season asking a most dreadful conspirator to dinner, a man who had blown up ever so many people, and always wore a coat of mail, and carried a dagger up his shirt-sleeve; and do you know that when he came he looked just like a nice old clergyman, and cracked jokes all the evening? \u0026nbsp;Of course, he was very amusing, and all that, but I was awfully disappointed; and when I asked him about the coat of mail, he only laughed, and said it was far too cold to wear in England. \u0026nbsp;Ah, here is Mr. Podgers! \u0026nbsp;Now, Mr. Podgers, I want you to tell the Duchess of Paisley’s hand. \u0026nbsp;Duchess, you must take your glove off. \u0026nbsp;No, not the left hand, the other.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Dear Gladys, I really don’t think it is quite right,’ said the Duchess, feebly unbuttoning a rather soiled kid glove.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Nothing interesting ever is,’ said Lady Windermere: ‘on a fait le monde ainsi. \u0026nbsp;But I must introduce you. \u0026nbsp;Duchess, this is Mr. Podgers, my pet cheiromantist. \u0026nbsp;Mr. Podgers, this is the Duchess of Paisley, and if you say that she has a larger mountain of the moon than I have, I will never believe in you again.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am sure, Gladys, there is nothing of the kind in my hand,’ said the Duchess gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your Grace is quite right,’ said Mr. Podgers, glancing at the little fat hand with its short square fingers, ‘the mountain of the moon is not developed. \u0026nbsp;The line of life, however, is excellent. \u0026nbsp;Kindly bend the wrist. \u0026nbsp;Thank you. \u0026nbsp;Three distinct lines on the rascette! \u0026nbsp;You will live to a great age, Duchess, and be extremely happy. \u0026nbsp;Ambition—very moderate, line of intellect not exaggerated, line of heart—’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Now, do be indiscreet, Mr. Podgers,’ cried Lady Windermere.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Nothing would give me greater pleasure,’ said Mr. Podgers, bowing, ‘if the Duchess ever had been, but I am sorry to say that I see great permanence of affection, combined with a strong sense of duty.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Pray go on, Mr. Podgers,’ said the Duchess, looking quite pleased.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Economy is not the least of your Grace’s virtues,’ continued Mr. Podgers, and Lady Windermere went off into fits of laughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Economy is a very good thing,’ remarked the Duchess complacently; ‘when I married Paisley he had eleven castles, and not a single house fit to live in.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And now he has twelve houses, and not a single castle,’ cried Lady Windermere.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, my dear,’ said the Duchess, ‘I like—’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Comfort,’ said Mr. Podgers, ‘and modern improvements, and hot water laid on in every bedroom. \u0026nbsp;Your Grace is quite right. \u0026nbsp;Comfort is the only thing our civilisation can give us.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You have told the Duchess’s character admirably, Mr. Podgers, and now you must tell Lady Flora’s’; and in answer to a nod from the smiling hostess, a tall girl, with sandy Scotch hair, and high shoulder-blades, stepped awkwardly from behind the sofa, and held out a long, bony hand with spatulate fingers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, a pianist! I see,’ said Mr. Podgers, ‘an excellent pianist, but perhaps hardly a musician. \u0026nbsp;Very reserved, very honest, and with a great love of animals.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Quite true!’ exclaimed the Duchess, turning to Lady Windermere, ‘absolutely true! \u0026nbsp;Flora keeps two dozen collie dogs at Macloskie, and would turn our town house into a menagerie if her father would let her.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, that is just what I do with my house every Thursday evening,’ cried Lady Windermere, laughing, ‘only I like lions better than collie dogs.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your one mistake, Lady Windermere,’ said Mr. Podgers, with a pompous bow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If a woman can’t make her mistakes charming, she is only a female,’ was the answer. \u0026nbsp;‘But you must read some more hands for us. \u0026nbsp;Come, Sir Thomas, show Mr. Podgers yours’; and a genial-looking old gentleman, in a white waistcoat, came forward, and held out a thick rugged hand, with a very long third finger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘An adventurous nature; four long voyages in the past, and one to come. \u0026nbsp;Been ship-wrecked three times. \u0026nbsp;No, only twice, but in danger of a shipwreck your next journey. \u0026nbsp;A strong Conservative, very punctual, and with a passion for collecting curiosities. \u0026nbsp;Had a severe illness between the ages sixteen and eighteen. \u0026nbsp;Was left a fortune when about thirty. \u0026nbsp;Great aversion to cats and Radicals.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Extraordinary!’ exclaimed Sir Thomas; ‘you must really tell my wife’s hand, too.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your second wife’s,’ said Mr. Podgers quietly, still keeping Sir Thomas’s hand in his. \u0026nbsp;‘Your second wife’s. \u0026nbsp;I shall be charmed’; but Lady Marvel, a melancholy-looking woman, with brown hair and sentimental eyelashes, entirely declined to have her past or her future exposed; and nothing that Lady Windermere could do would induce Monsieur de Koloff, the Russian Ambassador, even to take his gloves off. \u0026nbsp;In fact, many people seemed afraid to face the odd little man with his stereotyped smile, his gold spectacles, and his bright, beady eyes; and when he told poor Lady Fermor, right out before every one, that she did not care a bit for music, but was extremely fond of musicians, it was generally felt that cheiromancy was a most dangerous science, and one that ought not to be encouraged, except in a tête-à-tête.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lord Arthur Savile, however, who did not know anything about Lady Fermor’s unfortunate story, and who had been watching Mr. Podgers with a great deal of interest, was filled with an immense curiosity to have his own hand read, and feeling somewhat shy about putting himself forward, crossed over the room to where Lady Windermere was sitting, and, with a charming blush, asked her if she thought Mr. Podgers would mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course, he won’t mind,’ said Lady Windermere, ‘that is what he is here for. \u0026nbsp;All my lions, Lord Arthur, are performing lions, and jump through hoops whenever I ask them. \u0026nbsp;But I must warn you beforehand that I shall tell Sybil everything. \u0026nbsp;She is coming to lunch with me to-morrow, to talk about bonnets, and if Mr. Podgers finds out that you have a bad temper, or a tendency to gout, or a wife living in Bayswater, I shall certainly let her know all about it.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lord Arthur smiled, and shook his head. \u0026nbsp;‘I am not afraid,’ he answered. \u0026nbsp;‘Sybil knows me as well as I know her.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah! \u0026nbsp;I am a little sorry to hear you say that. \u0026nbsp;The proper basis for marriage is a mutual misunderstanding. \u0026nbsp;No, I am not at all cynical, I have merely got experience, which, however, is very much the same thing. \u0026nbsp;Mr. Podgers, Lord Arthur Savile is dying to have his hand read. \u0026nbsp;Don’t tell him that he is engaged to one of the most beautiful girls in London, because that appeared in the Morning Post a month ago.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Dear Lady Windermere,’ cried the Marchioness of Jedburgh, ‘do let Mr. Podgers stay here a little longer. \u0026nbsp;He has just told me I should go on the stage, and I am so interested.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If he has told you that, Lady Jedburgh, I shall certainly take him away. \u0026nbsp;Come over at once, Mr. Podgers, and read Lord Arthur’s hand.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well,’ said Lady Jedburgh, making a little moue as she rose from the sofa, ‘if I am not to be allowed to go on the stage, I must be allowed to be part of the audience at any rate.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course; we are all going to be part of the audience,’ said Lady Windermere; ‘and now, Mr. Podgers, be sure and tell us something nice. \u0026nbsp;Lord Arthur is one of my special favourites.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But when Mr. Podgers saw Lord Arthur’s hand he grew curiously pale, and said nothing. \u0026nbsp;A shudder seemed to pass through him, and his great bushy eyebrows twitched convulsively, in an odd, irritating way they had when he was puzzled. \u0026nbsp;Then some huge beads of perspiration broke out on his yellow forehead, like a poisonous dew, and his fat fingers grew cold and clammy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lord Arthur did not fail to notice these strange signs of agitation, and, for the first time in his life, he himself felt fear. \u0026nbsp;His impulse was to rush from the room, but he restrained himself. \u0026nbsp;It was better to know the worst, whatever it was, than to be left in this hideous uncertainty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am waiting, Mr. Podgers,’ he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘We are all waiting,’ cried Lady Windermere, in her quick, impatient manner, but the cheiromantist made no reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I believe Arthur is going on the stage,’ said Lady Jedburgh, ‘and that, after your scolding, Mr. Podgers is afraid to tell him so.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly Mr. Podgers dropped Lord Arthur’s right hand, and seized hold of his left, bending down so low to examine it that the gold rims of his spectacles seemed almost to touch the palm. \u0026nbsp;For a moment his face became a white mask of horror, but he soon recovered his sang-froid, and looking up at Lady Windermere, said with a forced smile, ‘It is the hand of a charming young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course it is!’ answered Lady Windermere, ‘but will he be a charming husband? \u0026nbsp;That is what I want to know.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All charming young men are,’ said Mr. Podgers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t think a husband should be too fascinating,’ murmured Lady Jedburgh pensively, ‘it is so dangerous.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear child, they never are too fascinating,’ cried Lady Windermere. \u0026nbsp;‘But what I want are details. \u0026nbsp;Details are the only things that interest. \u0026nbsp;What is going to happen to Lord Arthur?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, within the next few months Lord Arthur will go a voyage—’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh yes, his honeymoon, of course!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And lose a relative.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Not his sister, I hope?’ said Lady Jedburgh, in a piteous tone of voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly not his sister,’ answered Mr. Podgers, with a deprecating wave of the hand, ‘a distant relative merely.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, I am dreadfully disappointed,’ said Lady Windermere. \u0026nbsp;‘I have absolutely nothing to tell Sybil to-morrow. \u0026nbsp;No one cares about distant relatives nowadays. \u0026nbsp;They went out of fashion years ago. \u0026nbsp;However, I suppose she had better have a black silk by her; it always does for church, you know. \u0026nbsp;And now let us go to supper. \u0026nbsp;They are sure to have eaten everything up, but we may find some hot soup. \u0026nbsp;Fran?ois used to make excellent soup once, but he is so agitated about politics at present, that I never feel quite certain about him. \u0026nbsp;I do wish General Boulanger would keep quiet. \u0026nbsp;Duchess, I am sure you are tired?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Not at all, dear Gladys,’ answered the Duchess, waddling towards the door. \u0026nbsp;‘I have enjoyed myself immensely, and the cheiropodist, I mean the cheiromantist, is most interesting. \u0026nbsp;Flora, where can my tortoise-shell fan be? \u0026nbsp;Oh, thank you, Sir Thomas, so much. \u0026nbsp;And my lace shawl, Flora? \u0026nbsp;Oh, thank you, Sir Thomas, very kind, I’m sure’; and the worthy creature finally managed to get downstairs without dropping her scent-bottle more than twice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All this time Lord Arthur Savile had remained standing by the fireplace, with the same feeling of dread over him, the same sickening sense of coming evil. \u0026nbsp;He smiled sadly at his sister, as she swept past him on Lord Plymdale’s arm, looking lovely in her pink brocade and pearls, and he hardly heard Lady Windermere when she called to him to follow her. \u0026nbsp;He thought of Sybil Merton, and the idea that anything could come between them made his eyes dim with tears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking at him, one would have said that Nemesis had stolen the shield of Pallas, and shown him the Gorgon’s head. \u0026nbsp;He seemed turned to stone, and his face was like marble in its melancholy. \u0026nbsp;He had lived the delicate and luxurious life of a young man of birth and fortune, a life exquisite in its freedom from sordid care, its beautiful boyish insouciance; and now for the first time he became conscious of the terrible mystery of Destiny, of the awful meaning of Doom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How mad and monstrous it all seemed! \u0026nbsp;Could it be that written on his hand, in characters that he could not read himself, but that another could decipher, was some fearful secret of sin, some blood-red sign of crime? \u0026nbsp;Was there no escape possible? \u0026nbsp;Were we no better than chessmen, moved by an unseen power, vessels the potter fashions at his fancy, for honour or for shame? \u0026nbsp;His reason revolted against it, and yet he felt that some tragedy was hanging over him, and that he had been suddenly called upon to bear an intolerable burden. \u0026nbsp;Actors are so fortunate. \u0026nbsp;They can choose whether they will appear in tragedy or in comedy, whether they will suffer or make merry, laugh or shed tears. \u0026nbsp;But in real life it is different. \u0026nbsp;Most men and women are forced to perform parts for which they have no qualifications. \u0026nbsp;Our Guildensterns play Hamlet for us, and our Hamlets have to jest like Prince Hal. \u0026nbsp;The world is a stage, but the play is badly cast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly Mr. Podgers entered the room. \u0026nbsp;When he saw Lord Arthur he started, and his coarse, fat face became a sort of greenish-yellow colour. \u0026nbsp;The two men’s eyes met, and for a moment there was silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The Duchess has left one of her gloves here, Lord Arthur, and has asked me to bring it to her,’ said Mr. Podgers finally. \u0026nbsp;‘Ah, I see it on the sofa! \u0026nbsp;Good evening.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Mr. Podgers, I must insist on your giving me a straightforward answer to a question I am going to put to you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Another time, Lord Arthur, but the Duchess is anxious. \u0026nbsp;I am afraid I must go.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You shall not go. \u0026nbsp;The Duchess is in no hurry.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ladies should not be kept waiting, Lord Arthur,’ said Mr. Podgers, with his sickly smile. \u0026nbsp;‘The fair sex is apt to be impatient.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lord Arthur’s finely-chiselled lips curled in petulant disdain. \u0026nbsp;The poor Duchess seemed to him of very little importance at that moment. \u0026nbsp;He walked across the room to where Mr. Podgers was standing, and held his hand out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Tell me what you saw there,’ he said. \u0026nbsp;‘Tell me the truth. \u0026nbsp;I must know it. \u0026nbsp;I am not a child.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Podgers’s eyes blinked behind his gold-rimmed spectacles, and he moved uneasily from one foot to the other, while his fingers played nervously with a flash watch-chain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What makes you think that I saw anything in your hand, Lord Arthur, more than I told you?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I know you did, and I insist on your telling me what it was. \u0026nbsp;I will pay you. \u0026nbsp;I will give you a cheque for a hundred pounds.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The green eyes flashed for a moment, and then became dull again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Guineas?’ said Mr. Podgers at last, in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly. \u0026nbsp;I will send you a cheque to-morrow. \u0026nbsp;What is your club?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have no club. \u0026nbsp;That is to say, not just at present. \u0026nbsp;My address is—, but allow me to give you my card’; and producing a bit of gilt-edge pasteboard from his waistcoat pocket, Mr. Podgers handed it, with a low bow, to Lord Arthur, who read on it,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Mr. SEPTIMUS R. PODGERS\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; Professional Cheiromantist\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; 103a West Moon Street\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My hours are from ten to four,’ murmured Mr. Podgers mechanically, ‘and I make a reduction for families.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Be quick,’ cried Lord Arthur, looking very pale, and holding his hand out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Podgers glanced nervously round, and drew the heavy portière across the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It will take a little time, Lord Arthur, you had better sit down.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Be quick, sir,’ cried Lord Arthur again, stamping his foot angrily on the polished floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Podgers smiled, drew from his breast-pocket a small magnifying glass, and wiped it carefully with his handkerchief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am quite ready,’ he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2839/78435.html","bookId":471,"creation":"Aug 2, 2019 10:44:11 AM","modification":"Aug 2, 2019 10:44:11 AM"}
