{"id":19128,"no":12,"title":"CHAPTER VI","content":"\u0026nbsp;About ten minutes later, the bell rang for tea, and, as Virginia did not come down, Mrs. Otis sent up one of the footmen to tell her. \u0026nbsp;After a little time he returned and said that he could not find Miss Virginia anywhere. \u0026nbsp;As she was in the habit of going out to the garden every evening to get flowers for the dinner-table, Mrs. Otis was not at all alarmed at first, but when six o’clock struck, and Virginia did not appear, she became really agitated, and sent the boys out to look for her, while she herself and Mr. Otis searched every room in the house. \u0026nbsp;At half-past six the boys came back and said that they could find no trace of their sister anywhere. \u0026nbsp;They were all now in the greatest state of excitement, and did not know what to do, when Mr. Otis suddenly remembered that, some few days before, he had given a band of gypsies permission to camp in the park. \u0026nbsp;He accordingly at once set off for Blackfell Hollow, where he knew they were, accompanied by his eldest son and two of the farm-servants. \u0026nbsp;The little Duke of Cheshire, who was perfectly frantic with anxiety, begged hard to be allowed to go too, but Mr. Otis would not allow him, as he was afraid there might be a scuffle. \u0026nbsp;On arriving at the spot, however, he found that the gypsies had gone, and it was evident that their departure had been rather sudden, as the fire was still burning, and some plates were lying on the grass. \u0026nbsp;Having sent off Washington and the two men to scour the district, he ran home, and despatched telegrams to all the police inspectors in the county, telling them to look out for a little girl who had been kidnapped by tramps or gypsies. \u0026nbsp;He then ordered his horse to be brought round, and, after insisting on his wife and the three boys sitting down to dinner, rode off down the Ascot Road with a groom. \u0026nbsp;He had hardly, however, gone a couple of miles when he heard somebody galloping after him, and, looking round, saw the little Duke coming up on his pony, with his face very flushed and no hat. \u0026nbsp;‘I’m awfully sorry, Mr. Otis,’ gasped out the boy, ‘but I can’t eat any dinner as long as Virginia is lost. \u0026nbsp;Please, don’t be angry with me; if you had let us be engaged last year, there would never have been all this trouble. \u0026nbsp;You won’t send me back, will you? \u0026nbsp;I can’t go! \u0026nbsp;I won’t go!’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Minister could not help smiling at the handsome young scapegrace, and was a good deal touched at his devotion to Virginia, so leaning down from his horse, he patted him kindly on the shoulders, and said, ‘Well, Cecil, if you won’t go back I suppose you must come with me, but I must get you a hat at Ascot.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, bother my hat! \u0026nbsp;I want Virginia!’ cried the little Duke, laughing, and they galloped on to the railway station. \u0026nbsp;There Mr. Otis inquired of the station-master if any one answering the description of Virginia had been seen on the platform, but could get no news of her. \u0026nbsp;The station-master, however, wired up and down the line, and assured him that a strict watch would be kept for her, and, after having bought a hat for the little Duke from a linen-draper, who was just putting up his shutters, Mr. Otis rode off to Bexley, a village about four miles away, which he was told was a well-known haunt of the gypsies, as there was a large common next to it. \u0026nbsp;Here they roused up the rural policeman, but could get no information from him, and, after riding all over the common, they turned their horses’ heads homewards, and reached the Chase about eleven o’clock, dead-tired and almost heart-broken. \u0026nbsp;They found Washington and the twins waiting for them at the gate-house with lanterns, as the avenue was very dark. \u0026nbsp;Not the slightest trace of Virginia had been discovered. \u0026nbsp;The gypsies had been caught on Brockley meadows, but she was not with them, and they had explained their sudden departure by saying that they had mistaken the date of Chorton Fair, and had gone off in a hurry for fear they might be late. \u0026nbsp;Indeed, they had been quite distressed at hearing of Virginia’s disappearance, as they were very grateful to Mr. Otis for having allowed them to camp in his park, and four of their number had stayed behind to help in the search. \u0026nbsp;The carp-pond had been dragged, and the whole Chase thoroughly gone over, but without any result. \u0026nbsp;It was evident that, for that night at any rate, Virginia was lost to them; and it was in a state of the deepest depression that Mr. Otis and the boys walked up to the house, the groom following behind with the two horses and the pony. \u0026nbsp;In the hall they found a group of frightened servants, and lying on a sofa in the library was poor Mrs. Otis, almost out of her mind with terror and anxiety, and having her forehead bathed with eau-de-cologne by the old housekeeper. \u0026nbsp;Mr. Otis at once insisted on her having something to eat, and ordered up supper for the whole party. \u0026nbsp;It was a melancholy meal, as hardly any one spoke, and even the twins were awestruck and subdued, as they were very fond of their sister. \u0026nbsp;When they had finished, Mr. Otis, in spite of the entreaties of the little Duke, ordered them all to bed, saying that nothing more could be done that night, and that he would telegraph in the morning to Scotland Yard for some detectives to be sent down immediately. \u0026nbsp;Just as they were passing out of the dining-room, midnight began to boom from the clock tower, and when the last stroke sounded they heard a crash and a sudden shrill cry; a dreadful peal of thunder shook the house, a strain of unearthly music floated through the air, a panel at the top of the staircase flew back with a loud noise, and out on the landing, looking very pale and white, with a little casket in her hand, stepped Virginia. \u0026nbsp;In a moment they had all rushed up to her. \u0026nbsp;Mrs. Otis clasped her passionately in her arms, the Duke smothered her with violent kisses, and the twins executed a wild war-dance round the group.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good heavens! child, where have you been?’ said Mr. Otis, rather angrily, thinking that she had been playing some foolish trick on them. \u0026nbsp;‘Cecil and I have been riding all over the country looking for you, and your mother has been frightened to death. \u0026nbsp;You must never play these practical jokes any more.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Except on the Ghost! except on the Ghost!’ shrieked the twins, as they capered about.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My own darling, thank God you are found; you must never leave my side again,’ murmured Mrs. Otis, as she kissed the trembling child, and smoothed the tangled gold of her hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Papa,’ said Virginia quietly, ‘I have been with the Ghost. \u0026nbsp;He is dead, and you must come and see him. \u0026nbsp;He had been very wicked, but he was really sorry for all that he had done, and he gave me this box of beautiful jewels before he died.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The whole family gazed at her in mute amazement, but she was quite grave and serious; and, turning round, she led them through the opening in the wainscoting down a narrow secret corridor, Washington following with a lighted candle, which he had caught up from the table. \u0026nbsp;Finally, they came to a great oak door, studded with rusty nails. \u0026nbsp;When Virginia touched it, it swung back on its heavy hinges, and they found themselves in a little low room, with a vaulted ceiling, and one tiny grated window. \u0026nbsp;Imbedded in the wall was a huge iron ring, and chained to it was a gaunt skeleton, that was stretched out at full length on the stone floor, and seemed to be trying to grasp with its long fleshless fingers an old-fashioned trencher and ewer, that were placed just out of its reach. \u0026nbsp;The jug had evidently been once filled with water, as it was covered inside with green mould. \u0026nbsp;There was nothing on the trencher but a pile of dust. \u0026nbsp;Virginia knelt down beside the skeleton, and, folding her little hands together, began to pray silently, while the rest of the party looked on in wonder at the terrible tragedy whose secret was now disclosed to them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Hallo!’ suddenly exclaimed one of the twins, who had been looking out of the window to try and discover in what wing of the house the room was situated. \u0026nbsp;‘Hallo! the old withered almond-tree has blossomed. \u0026nbsp;I can see the flowers quite plainly in the moonlight.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘God has forgiven him,’ said Virginia gravely, as she rose to her feet, and a beautiful light seemed to illumine her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What an angel you are!’ cried the young Duke, and he put his arm round her neck and kissed her.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2839/78446.html","bookId":471,"creation":"Aug 2, 2019 10:44:11 AM","modification":"Aug 2, 2019 10:44:11 AM"}
