{"id":91900,"no":72,"title":"Page 72","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNow he did turn and pointed at her with the half-empty beer bottle. “Yeah? Well you need to mind your own bloody business, Val.”\u003c/p\u003e\n\u003cp\u003eVal sat almost primly on the bench, her legs crossed, hands folded in her lap, head cocked slightly to one side, appraising him. “I’m serious here, Mark. Connie’s in therapy, and I think you need to see someone, too.”\u003c/p\u003e\n\u003cp\u003e“Bullshit. The only one around here with a goddamn problem is my goddamn wife.”\u003c/p\u003e\n\u003cp\u003eThere was such a look of naked contempt in Val’s face that even in the heat of his anger Mark couldn’t look at it. He turned back to the gathering darkness, drank down the rest of his beer, and with a snarl of rage threw the bottle far out into the yard where it shattered against a stone.\u003c/p\u003e\n\u003cp\u003e“Mark,” Val said, her voice softer as she got up and came to stand right behind him. “I understand that you’re hurting because of what happened, but denial isn’t going to—”\u003c/p\u003e\n\u003cp\u003e“Spare me the psychobabble,” he hissed. Then he spun on his heel and shouldered past her into the house, letting the screen door slam emptily behind him.\u003c/p\u003e\n\u003cp\u003e(3)\u003c/p\u003e\n\u003cp\u003eCrow stopped with a barrier-arm across Newton’s chest. Since their last tête-à-tête they had walked for another hour, following a series of hills that appeared to be descending lower and lower into the roots of the mountains. Their path, such as it was, spilled out at the bottom of one of the longer hills and they stood completely shrouded in cloying shadows. Across from them, perhaps forty feet away, the other hill lifted tiredly on its long journey upward to find the hidden sunlight far above—sunlight that looked weaker now as clouds thickened overhead. To their right the valley between the hills wormed through some ancient glacial boulders and then widened into a thicket of gray and sickly trees. The undergrowth glistened wetly, as if covered in grease.\u003c/p\u003e\n\u003cp\u003eSlowly, Crow raised a finger. “Listen,” he whispered.\u003c/p\u003e\n\u003cp\u003eNewton listened to the woods, to the air. It was like watching a movie with the sound turned down. “There’s nothing,” he murmured.\u003c/p\u003e\n\u003cp\u003e“Right,” Crow said softly. “Absolutely nothing. No birds, no wind. Nothing. It’s dead.”\u003c/p\u003e\n\u003cp\u003eCrow nodded slowly. “Yeah. Good word for it.”\u003c/p\u003e\n\u003cp\u003eThey moved toward the thicket, entering a natural archway made from the laced fingers of empty branches. They took two paces into the corridor of black trees and then stopped, as still and silent as the forest around them. Both men blinked in surprise and alarm, both opened their mouths to speak; neither said a thing. If moving from sunlight into shadow on the hillside had jarred them, then entering the thicket positively struck them over their hearts. Both of them had stopped as if they had walked into some invisible barrier.\u003c/p\u003e\n\u003cp\u003e“Jesus Christ!” Crow gasped.\u003c/p\u003e\n\u003cp\u003e“Damn!” hissed Newton. They exchanged looks of shock.\u003c/p\u003e\n\u003cp\u003e“What just happened?” asked Newton in a hushed voice.\u003c/p\u003e\n\u003cp\u003eCrow just shook his head. He took a tentative step forward. His foot moved easily, there was no actual barrier, no specific tangible thing barring their way. He took a few steps, and then stopped and looked back to Newton, who seemed wholly unwilling to go any farther.\u003c/p\u003e\n\u003cp\u003e“Come on, Newt,” said Crow in a hushed voice. “In for a penny….”\u003c/p\u003e\n\u003cp\u003eNewton looked up, and the intertwining branches of the skeletal trees made him feel as if he were inside some vast and monstrous rib cage. He followed slowly.\u003c/p\u003e\n\u003cp\u003eThe archway of trees stretched on for nearly 150 yards, at times so narrow that they had to walk in single file while branches plucked at their coat sleeves, and sometimes wider, so they could stand side by side to leech confidence from the visible presence of the other. As they reached the end of the archway, they stopped again. Crow was still sweating profusely and he was breathing as heavily as he had during the long climb down the hill. Newton noticed, as he had before, that Crow’s hands automatically and unthinkingly touched the butt of the pistol and the handle of the machete over and over again, like a pilgrim touching his talismans while in the land of the pagans.\u003c/p\u003e\n\u003cp\u003eCrow blotted his face with his sleeve and then froze, staring at the ground. He took two short steps and then squatted down. “Look at this.” When Newton came over Crow pointed at a part of the dirt pathway visible through the fallen debris.\u003c/p\u003e\n\u003cp\u003e“Is that a footprint?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Not too old, either. See, there’s more of them. Someone’s been down here, since it rained last.” He brushed away some of the debris. “Couple of people. See? That set is all over the place. Looks like work shoes. But over here, smoother soles. Dress shoes.”\u003c/p\u003e\n\u003cp\u003e“Could have been the cops. They were supposed to have come down to the Hollow, weren’t they?” Newton asked.\u003c/p\u003e\n\u003cp\u003e“Maybe. Don’t know if they came this far in, though.” Crow shook his head as he rose. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eThey moved on for another ten minutes and once again Crow stopped. “That’s it,” he said, nodding toward the place beyond the archway, his voice low and as deflated as a flat tire. “I think we’re here.” He pointed to a spot just ahead where the path widened but was littered with grubby, stunted trees. Some of the trees were middle-aged, twenty-four years old or more, but not one of them looked healthy. Thick, hairy vines were wrapped like tentacles around nearly every trunk and sloped from one tree to its neighbor, and everywhere there were smaller vines with mottled gray-green leaves. Between the trees were fierce tangles of rough-looking shrubs and bushes, which combined with the vines to form wall after unfriendly wall between them and their destination. Along the ground moss ran like a poorly laid carpet, the dark green broken frequently by the bone-white caps of toadstools. Drifting sluggishly through the air was a sickroom smell of rotting vegetation and mold.\u003c/p\u003e\n\u003cp\u003e“Oh, man,” said Newton, wiping his mouth. “What’s wrong with this place?”\u003c/p\u003e\n\u003cp\u003eCrow’s mouth was a tight line. “Everything,” he said.\u003c/p\u003e\n\u003cp\u003ePointing to the vines and bushes, Newton said, “How are we going to get through that? Can you see a path?”\u003c/p\u003e\n\u003cp\u003eCrow drew the machete with a rasp. “I’ll cut a path. Stand clear and give me room to swing. I don’t want to take your face off with this thing.”\u003c/p\u003e\n\u003cp\u003e“Sounds fair,” Newton said, fading back a few paces.\u003c/p\u003e\n\u003cp\u003eCrow moved forward, frowning at the imposing foliage, his eyes darting around, and then he slashed down with the machete. The blade sheared easily through the closest vine, severing it so that both ends fell away. Sap welled from the severed ends, like blood from a bisected snake, dottling the moss with black drops thick as syrup. Crow and Newton winced at the swinging, dripping ends of the vine. There was a smell like sulfur in the air. “Damn,” muttered Crow. He looked at his blade, half-expecting to see the edge corroded as if by acid, but the flat blade was only stained with smelly sap. “Let’s keep going. Stand back.”\u003c/p\u003e\n\u003cp\u003eThey cut their way into the forest that had grown up on Ubel Griswold’s field, and it was brutal work. Within a dozen yards Crow was feeling tired, and he looked ready to drop. He moved his arm like it weighed about a thousand pounds and someone had poured concrete over both his shoes. Both he and Newton were splattered with dripping goo of a half-dozen shades and viscosities. All of the gunk from the unnameable plants stank like sulfur mixed with spoiled milk. Several times Crow had to stop to control his gag reflex, gulping down huge mouthfuls of air filtered by breathing against the folds of a sleeve he wrapped around his face.\u003c/p\u003e\n\u003cp\u003e“This is going to take forever,” said Newton, exhausted from watching and beginning to get seriously worried for them both.\u003c/p\u003e\n\u003cp\u003eHe looked at his wristwatch. “It’s two o’clock already.”\u003c/p\u003e\n\u003cp\u003eCrow wheeled around. “What?” he demanded. “It can’t be that late!”\u003c/p\u003e\n\u003cp\u003eNewton showed him his watch, and Crow compared it to his own. 2:03 P.M. They stared at each other.\u003c/p\u003e\n\u003cp\u003e“It can’t be that late already,” Crow repeated.\u003c/p\u003e\n\u003cp\u003eNewton shook his head. “I know. I don’t get it either. At this rate, we won’t get back to town until past sunset, and let me tell you how much I don’t want to be caught down here at night.”\u003c/p\u003e\n\u003cp\u003eCrow cursed and drove the machete into the ground and drank some water from his canteen.\u003c/p\u003e\n\u003cp\u003eNewton pursed his lips judiciously and avoided eye contact with Crow. “So…you want to just bag it?”\u003c/p\u003e\n\u003cp\u003e“I can’t,” Crow snarled and then hacked the next vine, and the next.\u003c/p\u003e\n\u003cp\u003e(4)\u003c/p\u003e\n\u003cp\u003e“If you don’t stop that goddamned crying, Connie, so help me God, I’ll…”\u003c/p\u003e\n\u003cp\u003e“You’ll what?\u003c/p\u003e\n\u003cp\u003eMark stiffened and turned sharply. Val stood in the doorway to the bedroom, her dark hair tousled from the wind, her eyes narrow and cold. “You’ll what?” she asked again. Her voice was as cold as her flat and level stare.\u003c/p\u003e\n\u003cp\u003eMark stabbed a finger toward her. “You stay the hell out of this, Val. This is between Connie and me. It doesn’t concern you. So butt out!”\u003c/p\u003e\n\u003cp\u003eSprawled on the bed, Connie Guthrie lay with her face buried in her hands, her shoulders quietly trembling, her sobs faint against the louder rasp of Mark’s agitated breathing.\u003c/p\u003e\n\u003cp\u003eIgnoring Mark, Val said, “Connie? Connie, are you all right?”\u003c/p\u003e\n\u003cp\u003e“No, she’s not all right!” Mark spat. “She’s on that crying kick again.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you just leave her alone?”\u003c/p\u003e\n\u003cp\u003e“Leave her alone? That’s all I’ve had to do since that night. She won’t let me do anything but leave her alone! Christ! It’s worse than living with a nun!”\u003c/p\u003e\n\u003cp\u003eContempt showed in Val’s eyes and the twist of her lips. “My God, you are a complete asshole, Mark,” she sneered.\u003c/p\u003e\n\u003cp\u003e“Oh, kiss my ass! Besides,” he snapped, “who are you to lecture me? At least you’re getting laid. Oh, no! Don’t try to deny it! Don’t you think I know why Crow talked us into going out last night? He just wanted to get in your pants. Hey, I’m not criticizing, Val, don’t get me wrong. I just think I’d like to know what it feels like. Shit, a married man and you’d think I can at least get a frigging kiss from my wife. Hah! Not with the Crying Game over here. I even look at her and she’s all tears and hysterics and all that bullshit. Shit. The way she acts, you’d think it was me who attacked her.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-man-s-song-pine-deep-2/page-72.html","bookId":2568,"creation":"Oct 5, 2019 5:54:10 PM","modification":"Oct 5, 2019 5:54:10 PM"}
