{"id":91914,"no":86,"title":"Page 86","content":"\u003cp\u003eNewton shot him a cautious glance. “Yeah. You mad?”\u003c/p\u003e\n\u003cp\u003e“I should be, but—screw it. It’s your job.” He made a face. “After all…this is news.”\u003c/p\u003e\n\u003cp\u003eNewton cleared his throat. “Crow…I only called in the basic stuff. The shootings. Val’s brother and the guys who work for her. I—left out some stuff.”\u003c/p\u003e\n\u003cp\u003eCrow digested that. “The Hollow?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Just that?” Newton was quiet for so long Crow turned to look at him. “Newt?”\u003c/p\u003e\n\u003cp\u003e“Crow—I saw that man’s body. I was looking over your shoulder. I saw what you saw.”\u003c/p\u003e\n\u003cp\u003e“And what did I see?”\u003c/p\u003e\n\u003cp\u003eA pause. “I saw something that can’t be real.”\u003c/p\u003e\n\u003cp\u003eCrow drew a breath, let it out, said nothing.\u003c/p\u003e\n\u003cp\u003eNewton said, “I heard what Val told you, too. I heard her tell you how many times she shot him. I read the police reports on Castle, too, and I know that he fired off nine shots. Crow—you found every single one of those bullet holes. Every one. I was there, I saw you. I saw them.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“No—no, it’s not okay. We both know it’s not frigging okay.” Newton looked at Crow. “And I know what you’re thinking.”\u003c/p\u003e\n\u003cp\u003eCrow gave him a crooked smile. “What is it that I’m thinking, Newt?”\u003c/p\u003e\n\u003cp\u003e“You’re thinking that Boyd was like him. That somehow, impossibly somehow, Boyd was like him. Like Griswold.” Crow was silent. “That somehow Boyd was a—” Newton stopped and turned away, unable to say the word.\u003c/p\u003e\n\u003cp\u003eSo, Crow said it for him. “That somehow Boyd was a werewolf?”\u003c/p\u003e\n\u003cp\u003e“Yes. Jesus—this is impossible. I can’t wrap my head around it.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong, Newt.”\u003c/p\u003e\n\u003cp\u003eThe reporter swiveled around to stare at him. “What?”\u003c/p\u003e\n\u003cp\u003e“I said that you’re wrong. I don’t think that Boyd was a werewolf. That’s not at all what I think.”\u003c/p\u003e\n\u003cp\u003e“But—the gunshots. He—”\u003c/p\u003e\n\u003cp\u003e“What I think, Newt,” Crow said, his eyes reflecting the great dark nothingness beyond the window, “is that Kenneth Boyd was a vampire.”\u003c/p\u003e\n\u003cp\u003eTo that, Newton had nothing to say.\u003c/p\u003e\n\u003cp\u003e“I think Ruger was, too. I don’t know how, I don’t know why. I just know what I saw.” And Crow told him everything. The attack in the hospital, Ruger’s eyes, his unnatural strength. Newton kept shaking his head throughout, but it wasn’t that he thought Crow was wrong. He just did not want to believe it.\u003c/p\u003e\n\u003cp\u003eThey sat there in silence for a long time, oblivious to the hospital sounds close at hand or the traffic sounds outside. Newton sniffed, wiped his eyes on his sleeve. “We’re all going to die,” he asked, “aren’t we?”\u003c/p\u003e\n\u003cp\u003eCrow had no answer for him. None at all.\u003c/p\u003e\n\u003cp\u003e(2)\u003c/p\u003e\n\u003cp\u003eHe sat on the rooftop, legs folded Indian fashion, old guitar laid across his bony knees, singing blues to the night. The wind had turned cold and fierce and it blew around him and through him. On that gale he could hear the voice of the creature in the swamp. The wind was filled with his rage.\u003c/p\u003e\n\u003cp\u003eThe Bone Man smiled. He felt great sadness that Henry’s boy had died, but he also felt great pride that Henry’s daughter, Val, had stood up and stood tall. Henry would be proud of her. She’d done what no one—certainly not him, and probably not Griswold—had thought anyone could do with just an ordinary gun. She’d brought down one of them. One of his soldiers. Griswold’s fury filled the air around him, and it tasted just fine to the Bone Man.\u003c/p\u003e\n\u003cp\u003eHe strummed his guitar. So much pain downstairs. So many folks hurting and dying. So many folks changing, in good ways and bad. So much death.\u003c/p\u003e\n\u003cp\u003eYet it wasn’t all dark, not even up here in the wind, and he ran his fingers over the strings, picking out a tune. Val had taken her stand, and now for the first time in thirty years the thing down there in the wormy dark was not so sure, not so cocksure by a long mile, and that was good. Now there was a little more hope mixed in with all that hate and rage on the wind. Not much, maybe, not enough almost for sure, but some—and for tonight that was going to have to do.\u003c/p\u003e\n\u003cp\u003eHe slipped his bottleneck out of his coat pocket and fitted it over the forefinger of his left hand, sliding the smooth glass down the strings as he plucked a note and then another. Downstairs they were doing their trying and their dying, their sewing and their praying. The Bone Man was no sage, he didn’t know who was going to make it through this night, or who was going to make it through till the coming of Griswold’s Red Wave. He didn’t know if anyone would be able to take another stand, like Val did tonight. Maybe Crow would, but that was something the Bone Man would have to see. Crow…and maybe Mike. He played some notes, finding his way into a song. The old one that he used to play on Henry’s porch. The one about prisoners walking that last mile to Old Sparky down in Louisiana. The one he played on that long ago summer. “Ghost Road Blues.” He played it and then he started to sing the words in a voice no one could hear.\u003c/p\u003e\n\u003cp\u003eAs the wind shrieked its fury around him, the dead man sang his song. \u003c/p\u003e","sourceLink":"https://allnovel.net/dead-man-s-song-pine-deep-2/page-86.html","bookId":2568,"creation":"Oct 5, 2019 5:54:10 PM","modification":"Oct 5, 2019 5:54:10 PM"}
