{"id":102121,"no":15,"title":"Page 15","content":"\u003cp\u003e14 THE HOARD\u003c/p\u003e\n\u003cp\u003eWhen the moon was new and the sun young\u003c/p\u003e\n\u003cp\u003eof silver and gold the gods sung:\u003c/p\u003e\n\u003cp\u003ein the green grass they silver spilled,\u003c/p\u003e\n\u003cp\u003eand the white waters they with gold filled.\u003c/p\u003e\n\u003cp\u003eEre the pit was dug or Hell yawned,\u003c/p\u003e\n\u003cp\u003eere dwarf was bred or dragon spawned,\u003c/p\u003e\n\u003cp\u003ethere were Elves of old, and strong spells\u003c/p\u003e\n\u003cp\u003eunder green hills in hollow dells\u003c/p\u003e\n\u003cp\u003ethey sang as they wrought many fair things,\u003c/p\u003e\n\u003cp\u003eand the bright crowns of the Elf-kings.\u003c/p\u003e\n\u003cp\u003eBut their doom fell, and their song waned,\u003c/p\u003e\n\u003cp\u003eby iron hewn and by steel chained.\u003c/p\u003e\n\u003cp\u003eGreed that sang not, nor with mouth smiled,\u003c/p\u003e\n\u003cp\u003ein dark holes their wealth piled,\u003c/p\u003e\n\u003cp\u003egraven silver and carven gold:\u003c/p\u003e\n\u003cp\u003eover Elvenhome the shadow rolled.\u003c/p\u003e\n\u003cp\u003eThere was an old dwarf in a dark cave,\u003c/p\u003e\n\u003cp\u003eto silver and gold his fingers clave;\u003c/p\u003e\n\u003cp\u003ewith hammer and tongs and anvil-stone\u003c/p\u003e\n\u003cp\u003ehe worked his hands to the hard bone.\u003c/p\u003e\n\u003cp\u003eand coins he made, and strings of rings,\u003c/p\u003e\n\u003cp\u003eand thought to buy the power of kings.\u003c/p\u003e\n\u003cp\u003eBut his eyes grew dim and his ears dull\u003c/p\u003e\n\u003cp\u003eand the skin yellow on his old skull;\u003c/p\u003e\n\u003cp\u003ethrough his bony claw with a pale sheen\u003c/p\u003e\n\u003cp\u003ethe stony jewels slipped unseen.\u003c/p\u003e\n\u003cp\u003eNo feet he heard, though the earth quaked.\u003c/p\u003e\n\u003cp\u003ewhen the young dragon his thirst slaked.\u003c/p\u003e\n\u003cp\u003eand the stream smoked at his dark door.\u003c/p\u003e\n\u003cp\u003eThe flames hissed on the dank floor,\u003c/p\u003e\n\u003cp\u003eand he died alone in the red fire;\u003c/p\u003e\n\u003cp\u003ehis bones were ashes in the hot mire.\u003c/p\u003e\n\u003cp\u003eThere was an old dragon under grey stone;\u003c/p\u003e\n\u003cp\u003ehis red eyes blinked as he lay alone.\u003c/p\u003e\n\u003cp\u003eHis joy was dead and his youth spent,\u003c/p\u003e\n\u003cp\u003ehe was knobbed and wrinkled, and his limbs bent\u003c/p\u003e\n\u003cp\u003ein the long years to his gold chained;\u003c/p\u003e\n\u003cp\u003ein his heart\u0027s furnace the fire waned.\u003c/p\u003e\n\u003cp\u003eTo his belly\u0027s slime gems stuck thick,\u003c/p\u003e\n\u003cp\u003esilver and gold he would snuff and lick:\u003c/p\u003e\n\u003cp\u003ehe knew the place of the least ring\u003c/p\u003e\n\u003cp\u003ebeneath the shadow of his black wing.\u003c/p\u003e\n\u003cp\u003eOf thieves he thought on his hard bed,\u003c/p\u003e\n\u003cp\u003eand dreamed that on their flesh he fed,\u003c/p\u003e\n\u003cp\u003etheir bones crushed, and their blood drank:\u003c/p\u003e\n\u003cp\u003ehis ears drooped and his breath sank.\u003c/p\u003e\n\u003cp\u003eMail-rings rang. He heard them not.\u003c/p\u003e\n\u003cp\u003eA voice echoed in his deep grot:\u003c/p\u003e\n\u003cp\u003ea young warrior with a bright sword\u003c/p\u003e\n\u003cp\u003ecalled him forth to defend his hoard.\u003c/p\u003e\n\u003cp\u003eHis teeth were knives, and of horn his hide,\u003c/p\u003e\n\u003cp\u003ebut iron tore him, and his flame died.\u003c/p\u003e\n\u003cp\u003eThere was an old king on a high throne:\u003c/p\u003e\n\u003cp\u003ehis white beard lay on knees of bone;\u003c/p\u003e\n\u003cp\u003ehis mouth savoured neither meat nor drink,\u003c/p\u003e\n\u003cp\u003enor his ears song; he could only think\u003c/p\u003e\n\u003cp\u003eof his huge chest with carven lid\u003c/p\u003e\n\u003cp\u003ewhere pale gems and gold lay hid\u003c/p\u003e\n\u003cp\u003ein secret treasury in the dark ground;\u003c/p\u003e\n\u003cp\u003eits strong doors were iron-bound.\u003c/p\u003e\n\u003cp\u003eThe swords of his thanes were dull with rust,\u003c/p\u003e\n\u003cp\u003ehis glory fallen, his rule unjust,\u003c/p\u003e\n\u003cp\u003ehis halls hollow, and his bowers cold,\u003c/p\u003e\n\u003cp\u003ebut king he was of elvish gold.\u003c/p\u003e\n\u003cp\u003eHe heard not the horns in the mountain-pass,\u003c/p\u003e\n\u003cp\u003ehe smelt not the blood on the trodden grass,\u003c/p\u003e\n\u003cp\u003ebut his halls were burned, his kingdom lost;\u003c/p\u003e\n\u003cp\u003ein a cold pit his bones were tossed.\u003c/p\u003e\n\u003cp\u003eThere is an old hoard in a dark rock,\u003c/p\u003e\n\u003cp\u003eforgotten behind doors none can unlock;\u003c/p\u003e\n\u003cp\u003ethat grim gate no man can pass.\u003c/p\u003e\n\u003cp\u003eOn the mound grows the green grass;\u003c/p\u003e\n\u003cp\u003ethere sheep feed and the larks soar,\u003c/p\u003e\n\u003cp\u003eand the wind blows from the sea-shore.\u003c/p\u003e\n\u003cp\u003eThe old hoard the Night shall keep,\u003c/p\u003e\n\u003cp\u003ewhile earth waits and the Elves sleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-adventures-of-tom-bombadil/page-15.html","bookId":1668,"creation":"Oct 5, 2019 10:12:58 PM","modification":"Oct 5, 2019 10:12:58 PM"}
