{"id":52089,"no":12,"title":"Chapter 11 - Eighty-Eight Slain","content":"\u003cp\u003e\u003cstrong\u003ePart 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe second month, the twenty-third.\u003c/p\u003e\n\u003cp\u003eChang’an.\u003c/p\u003e\n\u003cp\u003eBefore dawn.\u003c/p\u003e\n\u003cp\u003eThe sky was a dead gray color, as was the ground. The magnificently constructed ancient city of Chang’an had not opened its gates yet.\u003c/p\u003e\n\u003cp\u003eOld Huang and Ah Jin, who were responsible for opening the gates every day, had slaughtered a pig last night, and pooled their money to buy a big bottle of baijiu and a heap of flatbreads. Having drunk and eaten to their hearts content, they could barely crawl out of bed in the morning.\u003c/p\u003e\n\u003cp\u003eDereliction of guard duty and failure to promptly open the city gates, were both punishable by “Immediate Decapitation.”\u003c/p\u003e\n\u003cp\u003eMilitary Law remained as immovable as a mountain. So when Old Huang got up and realized that he was already thirty minutes late, he began sweating in fear. Before he had even finished buttoning his padded coat, he was outside opening the city gates.\u003c/p\u003e\n\u003cp\u003e“The weather is so cold, there probably won’t be anyone waiting to get into the city.”\u003c/p\u003e\n\u003cp\u003eHe comforted himself as he fiddled with the great lock of the main gate. He opened the gates a crack and nearly died from fright.\u003c/p\u003e\n\u003cp\u003eOutside were seventy or eighty people, all dressed sharply, all the way down to their layered leg-wrappings. They wore executioners\u0027 swords strapped to their backs, and their heads were wrapped with white cloths, on top of which were sewn strips of mottled reddish fabric. Each person wore an expression that matched the day’s weather, and emanated murderous auras which would cause anyone to have goosebumps.\u003c/p\u003e\n\u003cp\u003eAs soon as the gates opened, the people separated into two groups and quietly entered the city, the blood-red tassels on their swords fluttering in the wind, the white cloths wrapping their heads shining, the edges of their blades glittering.\u003c/p\u003e\n\u003cp\u003eTheir blades were not sheathed, because they didn’t carry sheaths.\u003c/p\u003e\n\u003cp\u003e—Who were these ferocious men? Why had they come to Chang’an?\u003c/p\u003e\n\u003cp\u003eOld Huang the city guard stood in his position. Initially he planned to question them, but now his tongue had grown stiff and he couldn’t even speak.\u003c/p\u003e\n\u003cp\u003eThis was because at that moment a man walked to the front. He dressed in a bear-fur garment, and he stared at Old Huang with a pair of bloodshot eyes. Even though he seemed somewhat emaciated, his cheekbones protruded proudly, and his eyes were as sharp as a blade. He had an awe-inspiring presence, like a wild beast that had just emerged from the deep mountains.\u003c/p\u003e\n\u003cp\u003eWhite cloth, sewn with a patch of mottled reddish fabric, held back his unruly hair.\u003c/p\u003e\n\u003cp\u003eThe only person dressed differently was a thin, handsome young man who carried a long, narrow bundle, wrapped in black cloth, gripped tightly against his body.\u003c/p\u003e\n\u003cp\u003eOld Huang grew weak at the knees. Anyone who saw such a murderous group would certain feel consternation.\u003c/p\u003e\n\u003cp\u003e“Do you want to question us? Where are we from? What are we doing here?”\u003c/p\u003e\n\u003cp\u003eThe man’s voice, though hoarse, carried a majestic and spirited air.\u003c/p\u003e\n\u003cp\u003e“Listen, and listen well. I am Zhu Meng. Zhu Meng of Luoyang.” In a stern voice he continued, “We have come to Chang’an to die.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s face showed no emotion, and even now looked as if it had been frozen, every single muscle. If you have ever seen a dead person frozen in ice, perhaps you can imagine the expression on his face.\u003c/p\u003e\n\u003cp\u003eA young man, not yet twenty, stood in front of him, as straight as a javelin. The expression on the young man’s face was almost the same as Zhuo Donglai’s.\u003c/p\u003e\n\u003cp\u003eThis young man’s name was Zhuo Qing\u003c/p\u003e\n\u003cp\u003eHe wasn’t always surnamed Zhuo. He used to be surnamed Guo. He was the brother of Guo Zhuang, who died in the Red Flower Bazaar.\u003c/p\u003e\n\u003cp\u003eBut after having been adopted by Zhuo Donglai, he forgot about his old name.\u003c/p\u003e\n\u003cp\u003e“Zhu Meng has entered the city.”\u003c/p\u003e\n\u003cp\u003eHe had reported this news, and he had also been the one to discover the medicine flowing down the gutter.\u003c/p\u003e\n\u003cp\u003eRecently, the tasks he had accomplished for Zhuo Donglai far exceeded those of any of his other trusted subordinates.\u003c/p\u003e\n\u003cp\u003e“How many men came?”\u003c/p\u003e\n\u003cp\u003e“Including Gao Jianfei, there are a total of eighty-eight.\u003c/p\u003e\n\u003cp\u003e“Did he specifically tell Guard Huang that he was Zhu Meng?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“What else did he say?”\u003c/p\u003e\n\u003cp\u003e“That they had come to Chang’an to die!”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s pupils constricted, as if they had become awls.\u003c/p\u003e\n\u003cp\u003e“They didn’t come to Chang’an to kill someone? They came to Chang’an to die?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Good. Very good.” The corners of his eyes began to pulse. “Extremely good.”\u003c/p\u003e\n\u003cp\u003ePeople who knew Zhuo Donglai knew that only when circumstances were extremely critical would the corners of his eyes pulse in this way.\u003c/p\u003e\n\u003cp\u003eThey pulsed because he knew that his opponent had not brought eighty-eight men, but rather, eight hundred and eighty.\u003c/p\u003e\n\u003cp\u003e—People with murderous intent are not to be feared, but people prepared to die are. They are worth as much as ten.\u003c/p\u003e\n\u003cp\u003e“Tell me again what they wore.”\u003c/p\u003e\n\u003cp\u003e“They dressed well, and had leggings. They wore white bands, and sewn onto each band was a torn strip of reddish cloth.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai laughed coldly.\u003c/p\u003e\n\u003cp\u003e“Good. Extremely good. Do you know where those pieces of cloth came from?”\u003c/p\u003e\n\u003cp\u003e“I don’t.”\u003c/p\u003e\n\u003cp\u003e“They are definitely Cleats’ bloodstained clothes. When he died, his clothes were most certainly died red with blood.”\u003c/p\u003e\n\u003cp\u003ePeople from Luoyang had already returned and reported to Zhuo Donglai all the details of the bloody battle.\u003c/p\u003e\n\u003cp\u003e“The Lion Clan was like a sheet of shifting sand, unable to unite. But Cleats’ blood brought them together again.” Zhuo Donglai’s voice suddenly seemed to contain some emotion. “Cleats. Very good. What a good kid.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Zhuo Qing. “Cleats might not look very good, but they are cheap. They usually aren’t as good as other types of shoes, but when it’s raining or snowing, or the road is muddy and slippery, they are most useful.”\u003c/p\u003e\n\u003cp\u003eHe spoke in a very flat tone, because he was simply describing a fact.\u003c/p\u003e\n\u003cp\u003eHe was not the type of person to be easily moved by emotion.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai stared at him, stared for a very long time, and then did something that no one would ever have expected him to do.\u003c/p\u003e\n\u003cp\u003eHe suddenly stood up, walked over, and embraced Zhuo Qing. Even though it was a very light embrace, it was the first time in his life he had ever done something like this.\u003c/p\u003e\n\u003cp\u003e—Other than Sima Chaoqun, it was his first time to get close to any other man.\u003c/p\u003e\n\u003cp\u003eEven though Zhuo Qing still just stood there like a javelin, hot tears filled his eyes.\u003c/p\u003e\n\u003cp\u003eIt seemed Zhuo Donglai had not expected this reaction. He suddenly changed the topic. “Zhu Meng knows where I am, but he hasn’t come looking for me yet.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“Considering that they came here to die, I really must accommodate them. I must go looking for him.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“But these eighty-eight men have embraced death in their hearts. Eighty-eight men of one mind, one spirit. They are suppressing this spirit of death, but it may break out at any moment, it won’t be easy to hold back.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“So I won’t go after them right now.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s awl-like pupils suddenly filled with a ruthless and uncanny smiling air. “Do you know how I will deal with them?” he asked Zhuo Qing.\u003c/p\u003e\n\u003cp\u003e“I don’t.”\u003c/p\u003e\n\u003cp\u003eOne word at a time, Zhuo Donglai spoke, in his unique tone. “I’m going to treat them to a meal. I want to have a welcoming banquet for them tonight at \u0027Chang’an\u0027 Restaurant.’”\u003c/p\u003e\n\u003cp\u003e“Ok.”\u003c/p\u003e\n\u003cp\u003e“You must go invite them for me.”\u003c/p\u003e\n\u003cp\u003e“Very well.”\u003c/p\u003e\n\u003cp\u003e“Zhu Meng might not accept. He might think it’s a trap. But,” he said coldly, “I’m sure you can think of a way to convince them to go.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Zhuo Qing, “they will go. They definitely will go.”\u003c/p\u003e\n\u003cp\u003e“And I hope you can come back alive.”\u003c/p\u003e\n\u003cp\u003eZhuo Qing’s reply was simple and resolute: “I will.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUpon returning to his room, Zhuo Donglai found Die Wu combing her hair.\u003c/p\u003e\n\u003cp\u003eShe ran the comb through her long, pitch-black hair, over and over again. It seemed as if there were nothing in the world she wanted other than to comb her hair.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai watched her quietly, watched her run the comb through her hair again and again.\u003c/p\u003e\n\u003cp\u003eTwo people, one comb, one person watching. A long time passed and then suddenly a snapping sound rang out as the comb broke into three pieces.\u003c/p\u003e\n\u003cp\u003eThis comb was a high quality product of the “Jade Square” in Liuzhou. Even if you tried to twist it with two hands, it would be difficult to break it.\u003c/p\u003e\n\u003cp\u003eWomen usually treasure their hair, and would never use force when combing it.\u003c/p\u003e\n\u003cp\u003eBut the comb had indeed broken.\u003c/p\u003e\n\u003cp\u003eDie Wu’s hands began to tremble. They trembled so much so that she couldn’t even hold the remaining piece of the comb in her hand. It clattered to the dressing table.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai didn’t see.\u003c/p\u003e\n\u003cp\u003eIt seemed as if he didn’t see any of these things.\u003c/p\u003e\n\u003cp\u003e“I’m treating some people to dinner tonight,” he told her softly. “Two honoured guests.”\u003c/p\u003e\n\u003cp\u003eDie Wu looked at the broken pieces of the comb on the dressing table, looking as if she were beginning to go crazy.\u003c/p\u003e\n\u003cp\u003eShe laughed crazily, and then said, “Every day I have to treat myself, because everyone has to eat, even someone like me. Eat a bowl, then eat another bowl, I eat so happily.”\u003c/p\u003e\n\u003cp\u003e“I want my guests to eat happily today, too,” said Zhuo Donglai. “So I want you to do something for them.”\u003c/p\u003e\n\u003cp\u003e“Whatever you want me to do is fine.” She laughed unceasingly. “Even if you want me to go and eat shit, I’ll comply with your wishes.”\u003c/p\u003e\n\u003cp\u003e“Well that’s excellent, then.” Zhuo Donglai was also laughing, and his laughter seemed to be filled with joy. “Actually, you should know what I want you to do for them.” Oh so slowly, he said, “I want you to dance for them.”\u003c/p\u003e\n\u003cp\u003e“The treasured sword is ruthless, Zhuangzi dreams no dreams;\u003c/p\u003e\n\u003cp\u003eDance for the king, transform into a butterfly.” \u0026nbsp;\u003ca href\u003d\"#footnote_1\"\u003e[1]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 4\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe most famous eatery in Chang’an was called “Chang’an Restaurant.” The most famous teahouse in Chang’an was also called “Chang’an Restaurant.” But Chang’an Restaurant and Eatery and Chang’an Restaurant and Teahouse were completely different.\u003c/p\u003e\n\u003cp\u003e“Chang’an Restaurant, definitely not easy.”\u003c/p\u003e\n\u003cp\u003eTo start such an eatery or teahouse like these was definitely not very easy.\u003c/p\u003e\n\u003cp\u003eChang’an Restaurant Eatery was in the west of the city. Its gardens and parks were spacious, the cutlery elegant. Amidst the luxuriant flowers and trees were ten pavilions, each floor of each pavilion decorated resplendantly. The quality of the food was the highest, garnering ceaseless praise.\u003c/p\u003e\n\u003cp\u003eChang’an Restaurant Teahouse was in the city center, on one of the most flourishing and bustling streets. Prices were reasonable and business was good. And whether one was drank tea or alcohol, or ate food, the portion sizes were good, and would definitely not leave anyone feeling like they had been taken advantage of.\u003c/p\u003e\n\u003cp\u003eSo early every morning, customers from every walk of life would fill the establishment.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThat was because in addition to food and drink, you could enjoy many other forms of entertainment there. You could see bizarre people and run into old friends. Maybe the woman sitting at the table next to you, drinking tea with her husband and child, would be your lover from years before. Perhaps sitting in the corner, unwilling to raise his head, was the debtor you had been searching for for so long.\u003c/p\u003e\n\u003cp\u003eIf you didn’t want to be found, this was not the place to go to.\u003c/p\u003e\n\u003cp\u003eAnd so Zhu Meng went there.\u003c/p\u003e\n\u003cp\u003eHe wasn’t scared of being found; in fact he was waiting for someone from the Great Protection Agency to come looking for him.\u003c/p\u003e\n\u003cp\u003eNo one was willing to ask him, “Why did you come here. Why don’t you just kill your way into the Great Protection Agency?”\u003c/p\u003e\n\u003cp\u003eZhu Meng had his reasons.\u003c/p\u003e\n\u003cp\u003e—Chang’an was the Great Protection Agency’s base of operations, and was filled with experts. Even more fearsome were Sima Chaoqun’s and Zhuo Donglai’s martial arts. So of course they waited patiently for their enemy to arrive, having planted themselves in a favorable position.\u003c/p\u003e\n\u003cp\u003e“We’re here to defy death, not deliver ourselves to it. We may have to die, but we don’t have to die a meaningless death.”\u003c/p\u003e\n\u003cp\u003e—When fighting a formidable opponent, relying only on courage was not enough.\u003c/p\u003e\n\u003cp\u003e“We must be patient, rely on ourselves, endure any humiliation to accomplish our mission.”\u003c/p\u003e\n\u003cp\u003e—Die Wu, will you really dance for others?\u003c/p\u003e\n\u003cp\u003eZhu Meng tried as hard as possible not to think of her.\u003c/p\u003e\n\u003cp\u003eEven though Die Wu’s movements when dancing could etch themselves indelibly into one’s memory, they had already been diluted by Cleat’s red blood.\u003c/p\u003e\n\u003cp\u003eHe had sworn an oath, not to let Cleat’s blood be shed in vain.\u003c/p\u003e\n\u003cp\u003eNo one drank.\u003c/p\u003e\n\u003cp\u003eTheir emotions aroused, their fighting spirit ignited, there was no need to rely on alcohol to provide stimulation.\u003c/p\u003e\n\u003cp\u003eThe teahouse had over a hundred tables, and they had occupied thirteen of them. Earlier, the teahouse had been packed, but as soon as they appeared, more than half of the customers had fled.\u003c/p\u003e\n\u003cp\u003eAfter seeing the blood red tassels on their blades, the white cloths on their heads, the murderous expression on their faces, everyone could tell that these strangers were not here to drink tea.\u003c/p\u003e\n\u003cp\u003eThey were here to drink blood.\u003c/p\u003e\n\u003cp\u003eThe blood of their enemies.\u003c/p\u003e\n\u003cp\u003eZhuo Qing arrived alone.\u003c/p\u003e\n\u003cp\u003eWhen he entered the teahouse, they didn’t notice him, because they had no idea who he was.\u003c/p\u003e\n\u003cp\u003eOnly Little Gao knew.\u003c/p\u003e\n\u003cp\u003eThis young man had left a deep impression on Little Gao, but it seemed Zhuo Qing didn’t recognise him. He entered the teahouse and walked directly up to Zhu Meng.\u003c/p\u003e\n\u003cp\u003e“Are you the Clan Leader of the Lion Clan from Luoyang?”\u003c/p\u003e\n\u003cp\u003eZhu Meng suddenly lifted his head and stared at him with two bloodshot eyes. “Yes, I am Zhu Meng. Who are you?”\u003c/p\u003e\n\u003cp\u003e“I am your humble Zhuo.”\u003c/p\u003e\n\u003cp\u003e“You’re surnamed Zhuo?” asked Little Gao, shocked. “I seem to remember you weren’t surnamed Zhuo before.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“You used to be surnamed Guo. I remember very clearly.”\u003c/p\u003e\n\u003cp\u003e“I don’t remember,” said Zhuo Qing coolly. “I’ve forget the past very quickly. Things that should be forgotten, I won’t think about.”\u003c/p\u003e\n\u003cp\u003eHe looked at Little Gao calmly, his face completely expressionless. “It wouldn’t hurt for you to learn from me a bit. Maybe your life would be a bit happier.”\u003c/p\u003e\n\u003cp\u003e—It is often at the most inappropriate time that people will recall things they shouldn’t recall. This is one of the greatest agonies.\u003c/p\u003e\n\u003cp\u003e—Was Little Gao now thinking about that woman?\u003c/p\u003e\n\u003cp\u003eHe suddenly wanted to have a drink.\u003c/p\u003e\n\u003cp\u003eJust as these thoughts entered his head, Zhu Meng laughed. He turned his head up and laughed wildly. “Well said!” In a loud voice he ordered, “Bring wine! I want to drink three large bowls of wine with this well-spoken young man.”\u003c/p\u003e\n\u003cp\u003e“Your young servant doesn’t want to drink right now,” said Zhuo Qing. “I can’t accompany you.”\u003c/p\u003e\n\u003cp\u003eZhu Meng’s laughter suddenly ceased, and he stared at him with a predatory look. “You don’t want to drink and you don’t want to accompany me?”\u003c/p\u003e\n\u003cp\u003e“Correct, I don’t want to drink. Not even one drop.” Zhuo Qing didn’t even blink. “When your young servant wants to forget something, he doesn’t need to drink alcohol.”\u003c/p\u003e\n\u003cp\u003eZhu Meng shot to his feet. The teapot in his hand shattered. “You really won’t drink?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing’s expression hadn’t changed. “If the Clan Lord wishes to kill me now, it would be as easy as turning over his hand. But to get me to drink would be as difficult as climbing to the heavens.”\u003c/p\u003e\n\u003cp\u003eZhu Meng suddenly laughed heartily. “You’re a good kid. You have guts. You’re surnamed Zhuo, is it the same Zhuo as Zhuo Donglai?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And Zhuo Donglai sent you here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“To do what?”\u003c/p\u003e\n\u003cp\u003e“Your young servant was sent here to extend an invitation to the Clan Leader and Hero Gao. Tonight Mr. Zhuo would like to hold a welcoming banquet for you, at the First Pavilion of Chang’an Restaurant, in the west of city.”\u003c/p\u003e\n\u003cp\u003e“Does he know how many people we brought here?”\u003c/p\u003e\n\u003cp\u003e“Not counting Hero Gao, the Clan Leader has brought eighty-six people.”\u003c/p\u003e\n\u003cp\u003e“And he only wants to invite us two?” Zhu Meng laughed coldly. “Zhuo Donglai is really just too stingy.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid he’s not stingy, but considerate.”\u003c/p\u003e\n\u003cp\u003e“Considerate?”\u003c/p\u003e\n\u003cp\u003e“Because Mr. Zhuo wants to be considerate, he only dares to invite the Clan Leader and Hero Gao.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Even if it’s a hazardous situation, two unparalleled heroes can come and go as they wish.”(6) Zhuo Qing laughed coolly. “I’m afraid others just won’t do.”\u003c/p\u003e\n\u003cp\u003eZhu Meng laughed again. “Well said. Even if the Chang’an Restaurant First Pavilion is a hazardous situation, Zhu Meng and Little Gao will head over. But you shouldn’t have come here.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“When a talented person like you suddenly appears, how could I bear to let him go?” Zhu Meng’s laughter was as cold as snow. “If I let you go, wouldn’t everyone under heaven laugh at me, and say that Zhu Meng could not see a hero standing right in front of him?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing suddenly laughed.\u003c/p\u003e\n\u003cp\u003e“If Yang Jian could seek refuge with the Great Protection Agency, then I could also seek refuge with the Lion Clan. But I’m afraid now it’s not possible.”\u003c/p\u003e\n\u003cp\u003e“And when would it be possible?”\u003c/p\u003e\n\u003cp\u003e“When the Lion Clan is powerful enough to defeat the Great Protection Agency.” Zhuo Qing appeared to be completely emotionless. “Your young servant is not a very loyal person, but he does have a very clear view of things.”\u003c/p\u003e\n\u003cp\u003eLittle Gao looked at him, shocked. He really had never imagined that he would hear such words come from the mouth of someone so young.\u003c/p\u003e\n\u003cp\u003eZhuo Qing noticed his change of expression. “What I’m saying is the truth,” he said. “The truth is often not very pleasant to hear.”\u003c/p\u003e\n\u003cp\u003eZhu Meng laughed. “Then should I let you return to Zhuo Donglai so that you can help him fight us?”\u003c/p\u003e\n\u003cp\u003e“Your young servant already said, the Clan Leader can kill me by simply turning over his hand. But the Clan Leader should realize that if he does kill me, then seeing a certain person again would be as difficult as climbing to the heavens.”\u003c/p\u003e\n\u003cp\u003eZhu Meng’s face changed color.\u003c/p\u003e\n\u003cp\u003eHe knew which “certain person” Zhuo Qing was talking about. The statement slashed at him like a whip, and he suddenly didn’t know how to protect himself.\u003c/p\u003e\n\u003cp\u003eZhuo Qing had already bowed and saluted. “Your young servant takes leave.”\u003c/p\u003e\n\u003cp\u003eHe suddenly turned and walked off, clearly not worried at all that someone might cleave his head off from behind. He didn’t cast another glance at Zhu Meng.\u003c/p\u003e\n\u003cp\u003eThe veins on Zhu Meng’s forehead bulged.\u003c/p\u003e\n\u003cp\u003e—He couldn’t let Zhuo Qing leave, couldn’t let his subordinates see him let an enemy free because of a woman.\u003c/p\u003e\n\u003cp\u003e—But how could he let Die Wu die?\u003c/p\u003e\n\u003cp\u003eLittle Gao sighed. “I never thought he would see things so clearly. He knew that the Lion Clan’s Zhu Meng wouldn’t kill an unarmed person, someone acting on orders to extend an invitation.” He glanced around. “No true man would do something like that, let alone Zhu Meng.”\u003c/p\u003e\n\u003cp\u003eOne of the other men stood up and said in a loud voice, “Big Brother Gao is right. Brothers, let’s all toast Big Brother Gao.”\u003c/p\u003e\n\u003cp\u003eEighty six men all shouted in agreement, their voices ringing like thunder. Little Gao ripped open his jacket. “Okay! Bring the wine!”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 5\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“I know Zhu Meng can’t let go of Die Wu,” said Zhuo Donglai coldly. “But I didn’t think he would let you go so easily.” A deeply meaningful expression filled his eyes. “To let an enemy go so easily, and all for a woman. Isn’t Zhu Meng worried his brothers will look down on him? Isn’t he worried about weakening their spirit?” He laughed coldly. “Is Die Wu really that entrancing?”\u003c/p\u003e\n\u003cp\u003e“Their morale is no lower,” said Zhuo Qing.\u003c/p\u003e\n\u003cp\u003e“Because Gao Jianfei understands Zhu Meng’s moods, and was able to get him out of his predicament. He led Zhu Meng’s brothers to believe that he released his enemy, not because of a woman, but because of the code of brotherhood.”\u003c/p\u003e\n\u003cp\u003e“When two countries are at war, you don’t kill the ambassadors. Zhu Meng is straightforward and upright, how could he kill an unarmed man?” Zhuo Qing’s eyes shone with admiration. “That’s what Gao Jianfei said.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai continued laughing. “This guy really is a true friend to Zhu Meng. The rest of his brothers are all just pigs.”\u003c/p\u003e\n\u003cp\u003e“Actually, they understood what Gao Jianfei was doing,” said Zhuo Qing. “But they weren’t willing to scorn Zhu Meng. Because they don’t want Zhu Meng to be that cold-blooded. Because true heroes aren’t ruthless.”\u003c/p\u003e\n\u003cp\u003e“And what kind of person can be ruthless?”\u003c/p\u003e\n\u003cp\u003e“An ambitious person,” said Zhuo Qing. “Heroes shed no tears, ambitious people are ruthless.” \u003ca href\u003d\"#footnote_2\"\u003e[2]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s shone with violent coldness. He stared at Zhuo Qing for a long time, before coldly asking him, “If Gao Jianfei didn’t say what he said, would Zhu Meng have killed you?”\u003c/p\u003e\n\u003cp\u003e“He still wouldn’t have.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing’s voice was cool and calm. “Because in his heart, Die Wu’s life is more valuable than mine.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 6\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003cp\u003eDusk. After dusk.\u003c/p\u003e\n\u003cp\u003eThe room was dark, and the lamps had not been lit. Die Wu didn’t like lamps.\u003c/p\u003e\n\u003cp\u003e—Was it because she feared that she would be drawn to the flames like a moth?\u003c/p\u003e\n\u003cp\u003eFlames flickered in the oven. Die Wu stood beside it, slowly removing her clothes.\u003c/p\u003e\n\u003cp\u003eHer naked body sparkled, smooth, pure white and flawless.\u003c/p\u003e\n\u003cp\u003eThe door pushed open. She knew someone had entered the room, but she didn’t turn her head. Other than Zhuo Donglai, no one would dare enter his room.\u003c/p\u003e\n\u003cp\u003eShe bent over and began to gently massage her legs.\u003c/p\u003e\n\u003cp\u003eShe knew that the suppleness of her legs could easily arouse the lust of men.\u003c/p\u003e\n\u003cp\u003eNo one could resist this kind of enticement, no one ever had.\u003c/p\u003e\n\u003cp\u003eSo she found it strange.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai looked at her, but didn’t make any move whatsoever.\u003c/p\u003e\n\u003cp\u003eShe slipped into her dancing outfit, which was as delicate as a cicada’s wings. When she wore it, it seemed as if she were adorned with moonlight, hazy moonlight, beautiful in a way that made her irresistibly enticing.\u003c/p\u003e\n\u003cp\u003eAnd yet Zhuo Donglai continued to stand there, motionless.\u003c/p\u003e\n\u003cp\u003eDie Wu finally couldn’t help but turn around. The pearl head ornament in her hand fell to the ground.\u003c/p\u003e\n\u003cp\u003eThe person who had entered was not Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003eAs she turned her head, she saw a young man standing in front of her, looking at her, his face pale and lifeless.\u003c/p\u003e\n\u003cp\u003eDie Wu quickly recovered her composure.\u003c/p\u003e\n\u003cp\u003eShe had never imagined someone other than Zhuo Donglai would dare enter his room, but she accepted his presence.\u003c/p\u003e\n\u003cp\u003eThe only thing that she found strange now, was that the young man looked at her in a way no one had ever looked at her before.\u003c/p\u003e\n\u003cp\u003eWhen others looked at her naked body and long legs, their eyes would burn as if with fire.\u003c/p\u003e\n\u003cp\u003eBut this young man’s eyes were as as cold and sharp as an icy crag.\u003c/p\u003e\n\u003cp\u003eZhuo Qing looked at Die Wu, and it seemed as if he was looking at a chunk of ice, or a block of stone, or the edge of a knife.\u003c/p\u003e\n\u003cp\u003eDie Wu looked at him too, for a long time. She could sense no change in his expression.\u003c/p\u003e\n\u003cp\u003e“Who are you?” she finally asked. “Can you tell me who you are?”\u003c/p\u003e\n\u003cp\u003e“Zhuo Qing. My name is Zhuo Qing.”\u003c/p\u003e\n\u003cp\u003e“Are you a person? A flesh and blood person?”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“Are you blind?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Can’t you see me?”\u003c/p\u003e\n\u003cp\u003e“I can,” said Zhuo Qing. “I can see every part of your body, very clearly.”\u003c/p\u003e\n\u003cp\u003eHis voice, cold and polite, contained no trace of derision or obscenity.\u003c/p\u003e\n\u003cp\u003eHe was simply stating the facts.\u003c/p\u003e\n\u003cp\u003eDie Wu laughed and then sighed, a laughing sigh. “Don’t tell me you always tell the truth?”\u003c/p\u003e\n\u003cp\u003e“Sometimes I do, sometimes I don’t. When there’s no need to lie, I tell the truth.”\u003c/p\u003e\n\u003cp\u003e“And now, you don’t need to lie?”\u003c/p\u003e\n\u003cp\u003e“Absolutely not.”\u003c/p\u003e\n\u003cp\u003eDie Wu let out another sigh. “You say you can see every part of my body clearly. Aren’t you worried Zhuo will dig your eyes out?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing looked at her calmly for a long time, then one word at a time said, “He won’t do that.”\u003c/p\u003e\n\u003cp\u003eDie Wu seemed to have no reaction to this, but she completely understood his meaning.\u003c/p\u003e\n\u003cp\u003e“He won’t do that,” she said. “Because he’s given me to you? He’s not given me to you? He’s given me to someone else?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing said nothing.\u003c/p\u003e\n\u003cp\u003e“He’s really so magnanimous,” said Die Wu, her voice filled with scorn. “Never before has a man who slept with me been willing to let me go.” She sighed. “It’s really a pity.”\u003c/p\u003e\n\u003cp\u003e“A pity?”\u003c/p\u003e\n\u003cp\u003e“A pity for you. He really should give me to you. You’ll never meet another woman like me in your entire life.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“It’s a pity for me. You’re young, you’re good looking. I’ve always liked big boys like you. You never get tired.”\u003c/p\u003e\n\u003cp\u003eShe gazed at him, her eyes narrowing, her lips moist. She walked toward him, slowly opening her garment, and pressing her lithe, sleek, warm body up against his.\u003c/p\u003e\n\u003cp\u003eHer waist undulated, and a moan rose from deep in her throat.\u003c/p\u003e\n\u003cp\u003eZhuo Qing had no reaction.\u003c/p\u003e\n\u003cp\u003eDie Wu panted, reaching out to grasp his hand. Suddenly, her hand was grabbed firmly, and she was thrown away.\u003c/p\u003e\n\u003cp\u003eZhuo Qing tossed her like a ball onto the bed, and looked at her coolly. “There are plenty of methods you can use if you want to torture yourself, to humiliate yourself. You can use any method you want. But I won’t.”\u003c/p\u003e\n\u003cp\u003e“You won’t?” laughed Die Wu. Her laughter was filled with madness. “Aren’t you a man?”\u003c/p\u003e\n\u003cp\u003e“Trying to make me angry won’t work,” he said. “I’m not going to sleep with you.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because I am a man. I don’t want to be tormented every day by thinking about your body.”\u003c/p\u003e\n\u003cp\u003e“As long as you’re willing, you can hold me every night.”\u003c/p\u003e\n\u003cp\u003eZhuo Qing smiled, a smile that seemed as if it had been carved from granite. “I thought of that too. But I also know the fate of men who want to hold you.”\u003c/p\u003e\n\u003cp\u003eDie Wu stopped laughing, and her eyes filled with an indescribable look of torment.\u003c/p\u003e\n\u003cp\u003e“You’re right,” she said softly. “The men who want to hold me are either dead or suffering.” Her voice was hoarse and filled with pain. “Thankfully, those men are not bastards, just idiots. Any suffering they experience is their own doing.”\u003c/p\u003e\n\u003cp\u003e“And Zhu Meng,” asked Zhuo Qing. “Is Zhu Meng a bastard or an idiot?”\u003c/p\u003e\n\u003cp\u003eDie Wu stood up and stared at the flickering flames in the oven. A long time passed, and then she laughed coldly. “You think Zhu Meng misses me? You think Zhu Meng will feel sad and broken-hearted over me?”\u003c/p\u003e\n\u003cp\u003e“He won’t?”\u003c/p\u003e\n\u003cp\u003e“He isn’t a person,” she said, her voice filled with hatred. “The same as Zhuo Donglai.”\u003c/p\u003e\n\u003cp\u003e“Are you telling me he doesn’t care about you?”\u003c/p\u003e\n\u003cp\u003e“What does he care about? He only cares about his reputation, his position, his power. If I died in front of his face, he wouldn’t shed a single tear.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“In his eyes, I’m not a person, I’m just a toy, just like a child’s doll. When he’s happy, he’ll bring out the doll to play, but when he’s bored he throws it to the side. Sometimes he wouldn’t even talk to me for days.”\u003c/p\u003e\n\u003cp\u003e“So because he treats you like this, you decided to sneak away after our surprise attack on the Lion Clan?”\u003c/p\u003e\n\u003cp\u003e“I’m a person too. Would any person be willing to be treated like a toy?”\u003c/p\u003e\n\u003cp\u003e“No. But,” said Zhuo Qing, “did you ever stop to think that maybe you misjudged him?”\u003c/p\u003e\n\u003cp\u003e“What did I misjudge about him?”\u003c/p\u003e\n\u003cp\u003e“Sometimes men like him are not able to show the true feelings in their heart. I know that there are many people who cannot show their feelings, especially toward the woman they love.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Perhaps because they think that expressing love to a woman would mean that they aren’t a true man, a manly man. Or maybe it because they really don’t know how to do it in the first place.”\u003c/p\u003e\n\u003cp\u003e“Zhu Meng is not like that,” she said sharply. “He understands these things better than anyone, and can do them better than anyone.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“When he treats others well, what he does is more beautiful than anyone else could do. Sometimes it makes me sick.”\u003c/p\u003e\n\u003cp\u003e“But you aren’t other people. You’re different from others.”\u003c/p\u003e\n\u003cp\u003e“How am I different?”\u003c/p\u003e\n\u003cp\u003e“Because you are his woman. Maybe he thinks you should innately know how you are different from others.”\u003c/p\u003e\n\u003cp\u003e“Well, I don’t know,” she said. “If a man truly loves a woman, he should make her know.”\u003c/p\u003e\n\u003cp\u003e“Maybe you don’t understand him.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand him?!” Die Wu let out another cold laugh. “I slept with him for three or four years, and I don’t understand him?”\u003c/p\u003e\n\u003cp\u003eZhuo Qing’s face was filled with another granite-like smile. “Of course you understand him, much more than we do.”\u003c/p\u003e\n\u003cp\u003eThe night was dark, and the room had long since grown silent. Die Wu sighed lightly.\u003c/p\u003e\n\u003cp\u003e“I’ve said too much tonight, haven’t I.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Zhuo Qing. “We should go now. I came here to take you away.”\u003c/p\u003e\n\u003cp\u003e“Where are you taking me?”\u003c/p\u003e\n\u003cp\u003eOne word at a time, Zhuo Qing said, “Don’t tell me you forgot? You promised Mr. Zhuo that you would dance for him tonight.”\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_1\"\u003e[1] Songs/poetry always are difficult to translate, and require either a good knowledge of Chinese poetry, or a good bit of research. I’m pretty sure that Gu Long is taking a famous line from the philosophy of Zhuangzi to make this part of the song. Zhuangzi (a famous Warring States period philosopher) had a dream where he became a butterfly. Then he woke up and wasn’t sure whether he was a man who had dreamed of a butterfly, or perhaps he was actually a butterfly dreaming that he was a man. Here’s more deep info http://goo.gl/9JtnFB\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_2\"\u003e[2] This is really cool in Chinese. The word for hero is 英雄 yīng xióng, and the word being used for “ambitious person” is 枭雄 xiāo xióng, which means a fierce, ambitious, ruthless person. As you can see the last character is the same, so the words rhyme. “Shed no tears” in the original Chinese is 无泪 wú lèi, which literally means “without tears.” And “ruthless” is 无情 wú qíng, which literally means “without emotion.” This is the same word for “ruthless” that is in the title of “Sentimental Swordsman, Ruthless Sword.” So the whole phrase in Chinese is 英雄无泪，枭雄无情 yīngxióng wúlèi, xiāoxióng wúqíng. Or literally \"heroes have no tears, the ambitious person has no emotion.\"\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heros-shed-no-tears/hsnt-chapter-11","bookId":1504,"creation":"Sep 10, 2019 4:32:34 AM","modification":"Sep 10, 2019 4:32:34 AM"}
