{"id":52093,"no":16,"title":"Chapter 15: Summit","content":"\u003cp\u003e\u003cstrong\u003ePart 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe second month, the twenty-fifth.\u003c/p\u003e\n\u003cp\u003eChang’an.\u003c/p\u003e\n\u003cp\u003eA lamp.\u003c/p\u003e\n\u003cp\u003eA light-purple, crystal lamp, and a yellow flame. Beneath the lamp, a solitary box, a solitary, old-fashioned, ordinary box.\u003c/p\u003e\n\u003cp\u003eThere was also a person beneath the lamp, but it was not the silent, ordinary person who usually carried the box.\u003c/p\u003e\n\u003cp\u003eThe person under the lamp was Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003eThere was not yet light in the sky, and so the lamp burned, the lamplight shining on the left sight of his face, seemingly soft and gentle.\u003c/p\u003e\n\u003cp\u003eToday, this half of his face seemed just like the face of a kind father.\u003c/p\u003e\n\u003cp\u003eWhen someone is completely satisfied with themselves, they tend to treat others in a somewhat kinder fashion than usual.\u003c/p\u003e\n\u003cp\u003eZhu Meng was within his grasp, the Lion Clan had disintegrated, and Gao Jianfei was dead, or at least, so he believed. Everything was under his control.\u003c/p\u003e\n\u003cp\u003eHis enemies had been eliminated, and he had gained complete power. No one in Jianghu would ever again be able to contend with him. Under these circumstances, even the most insatiable person would feel satisfied.\u003c/p\u003e\n\u003cp\u003eHis life’s work had reached its summit.\u003c/p\u003e\n\u003cp\u003eSo, he hadn’t killed Xiao Leixue.\u003c/p\u003e\n\u003cp\u003eAs of now, Xiao Leixue’s situation was exactly the same as the old man’s had been. His power gone, he sat in the small courtyard, waiting for Zhuo Donglai to squeeze the knowledge out of his mind and extract his wealth of secrets.\u003c/p\u003e\n\u003cp\u003eThat of course could wait. Zhuo Donglai wasn’t in a hurry.\u003c/p\u003e\n\u003cp\u003eA professional killer with his power gone was like an old whore who no one cared about, with no road to travel, and no place to go.\u003c/p\u003e\n\u003cp\u003eThese two professions were the most ancient in the world, the sorrows they spawned were also the most ancient tragedies in the world.\u003c/p\u003e\n\u003cp\u003eXiao Leixue’s box was now in Zhuo Donglai’s hands.\u003c/p\u003e\n\u003cp\u003eHe knew that this box was the most fearsome weapon in the world. The day that the Lion Clan traitor Yang Jian had been assassinated, he learned of its fearsomeness.\u003c/p\u003e\n\u003cp\u003eMany people in Jianghu would be willing to sell their soul to get their hands on it.\u003c/p\u003e\n\u003cp\u003eLuckily, he wasn’t that type of person. He was completely different.\u003c/p\u003e\n\u003cp\u003eRight now the box sat in front of him, but he had no inclination to even touch it.\u003c/p\u003e\n\u003cp\u003eThat was because he had another weapon, even more fearsome. His intelligence.\u003c/p\u003e\n\u003cp\u003eWhen he wielded his intelligence, he was more fearsome than any person or any weapon.\u003c/p\u003e\n\u003cp\u003e—Xiao Leixue may be an unparalleled master, yet he’d never even had a chance to make a move.\u003c/p\u003e\n\u003cp\u003e—Zhu Meng might be brave and daring, and the Lion Clan strong and powerful, yet in the time it took to raise a hand, he had routed them.\u003c/p\u003e\n\u003cp\u003eHe had reached this point not only because he had taken advantage of every opportunity, but also because he could create opportunities.\u003c/p\u003e\n\u003cp\u003eWhen others thought he was defeated, when he was in danger, he would not become flustered and nervous, but would instead devise an opportunity to rout his foe, to turn defeat into victory.\u003c/p\u003e\n\u003cp\u003eThis type of person was truly strong.\u003c/p\u003e\n\u003cp\u003eSpears, axes, blades, swords were the weapons of ordinary people. So was this box.\u003c/p\u003e\n\u003cp\u003eZhuo Qing had been standing in front of him for a very long time. Savoring victory was somewhat like savoring an olive. One needed to chew slowly for a long time to truly enjoy the flavor. And so, Zhuo Qing prepared to leave quietly.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai suddenly called to him, in a soft and gentle voice: “You worked hard all night. Why not sit and have a drink?”\u003c/p\u003e\n\u003cp\u003e“I don’t drink.”\u003c/p\u003e\n\u003cp\u003e“You can learn to,” said Zhuo Donglai with a smile. “Learning to drink isn’t very difficult.”\u003c/p\u003e\n\u003cp\u003e“But now is not the time for me to learn to drink.”\u003c/p\u003e\n\u003cp\u003e“What are you waiting for?” Zhuo Donglai’s smile had disappeared into the darkness. “Are you waiting until you’re able to …” Before finishing his sentence he suddenly changed the topic. “Have you gotten Mr. Xiao settled down?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“When you left, how was he? Did he speak?”\u003c/p\u003e\n\u003cp\u003e“No,” said Zhuo Qing. “He was the same as before, as if he didn’t care about anything at all.”\u003c/p\u003e\n\u003cp\u003e“Excellent.” Zhuo Donglai smiled again. “To submit to the will of Heaven, to resign oneself to the situation, is a sign of true intelligence. This type of person should live a long life.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s smile seemed to contain the sharpness of an awl. “Sometimes I feel that he is similar to me in many ways. He will not attempt to do things he is incapable of doing. He won’t even think about them.” He continued on coldly: “If someone likes to do things they are incapable of doing, they will eventually die a violent death. Gao Jianfei is a perfect example.”\u003c/p\u003e\n\u003cp\u003e“Gao Jianfei isn’t a good example,” said Zhuo Qing.\u003c/p\u003e\n\u003cp\u003e“He’s not? Why?”\u003c/p\u003e\n\u003cp\u003e“Because he isn’t dead.”\u003c/p\u003e\n\u003cp\u003e“You’re certain that he’s not dead?”\u003c/p\u003e\n\u003cp\u003e“I am. Yesterday at dusk, Zheng Cheng saw him with his own eyes, leaving the city with his sword.”\u003c/p\u003e\n\u003cp\u003e“Zheng Cheng?” Zhuo Donglai seemed to be searching his mind for the name. “How do you know that he really saw Gao Jianfei?”\u003c/p\u003e\n\u003cp\u003e“As soon as he learned of his whereabouts, he returned to report to me.”\u003c/p\u003e\n\u003cp\u003e“And you trust him?”\u003c/p\u003e\n\u003cp\u003e“I trust him.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s smile yet again disappeared, but his voice was even more gentle: “Correct! You should trust him. If you want others to trust you, you should first let them know that you trust them.”\u003c/p\u003e\n\u003cp\u003eHe seemed as if he suddenly wished he had not said what he just said, as he changed the topic again.\u003c/p\u003e\n\u003cp\u003e“Have you thought about where Gao Jianfei would go to?”\u003c/p\u003e\n\u003cp\u003e“He will surely go to the brothel in the Red Flower Bazaar to look for Zhu Meng. Since Zhu Meng isn’t there, he’ll return, so I didn’t have Zheng Cheng follow him. As long as he is in Chang’an, he is in our grasp.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai smiled happily.\u003c/p\u003e\n\u003cp\u003e“You definitely can begin learning how to drink. You’re qualified to drink, more qualified than most people.”\u003c/p\u003e\n\u003cp\u003eHe suddenly stood and placed his wine cup in front of Zhuo Qing.\u003c/p\u003e\n\u003cp\u003eZhuo Qing picked it up and drained it.\u003c/p\u003e\n\u003cp\u003eThe wine was sweet, but his mouth was bitter and sour.\u003c/p\u003e\n\u003cp\u003eHe realized that he had spoken too much, and he wished he could recall his words. It would have been better to cut off his hand.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai did not seem to notice. He took the empty cup and refilled it, then sat down and took a sip.\u003c/p\u003e\n\u003cp\u003e“Xiao Leixue knows that Gao Jianfei is fated to be his undoing. He has never broken a contract in his life. Why didn’t he kill Gao Jianfei?” Zhuo Donglai was lost in thought. “Do they have some special relationship? What relationship?”\u003c/p\u003e\n\u003cp\u003eHe suddenly drained his cup, and his eyes shone. “It must be that the old man knew the nature of their relationship. Xiao Leixue wanted to ask him about it, so it was surely something very important. When the old man died, his heart became filled with murder, because no one in the world other than the old man could tell him whether or not Gao Jianfei is his son.”\u003c/p\u003e\n\u003cp\u003e“His son?” Zhuo Qing had resolved not to say anything further, but he couldn’t hold back from asking, “How could Gao Jianfei be Xiao Leixue’s son?”\u003c/p\u003e\n\u003cp\u003e“You think it’s impossible?” Zhuo Donglai laughed coldly. “Gao Jianfei is an insignificant youth. Why would the cold-blooded Xiao Leixue save him? If they do not have some special relationship, then even if there were a hundred thousand Gao Jianfeis dying in front of him, Xiao Leixue wouldn’t lift a finger.”\u003c/p\u003e\n\u003cp\u003eHe looked at Zhuo Qing, his voice once again very soft. “Believe me, anything can happen. For example, how could Zhu Meng, such a stalwart man, be defeated because of a woman? And yet he was defeated, a bitter defeat. Xiao Leixue is the same. Who would ever have thought that this day would come?”\u003c/p\u003e\n\u003cp\u003eHe let out a long sigh. “Actually, I’m the same. How could I ever imagine who it is that might defeat me?”\u003c/p\u003e\n\u003cp\u003ePerhaps this statement wasn’t completely true, but it did contain truths worth pondering.\u003c/p\u003e\n\u003cp\u003eZhuo Qing suddenly left.\u003c/p\u003e\n\u003cp\u003eHe knew that it was time for him to leave, because Sima Chaoqun had arrived.\u003c/p\u003e\n\u003cp\u003eHe heard Sima Chaoqun’s voice: “Correct. No one could have imagined that this would happen.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe door was open, and Sima Chaoqun stood there. Outside was thick with milk-white fog.\u003c/p\u003e\n\u003cp\u003eHe was a middle-aged man, his hair and clothing in disarray from his frantic, long-distance journey, and he appeared to be completely exhausted.\u003c/p\u003e\n\u003cp\u003eAnd yet standing there, he still seemed as grand, brilliant and robust as ever. He appeared to be much younger than his age, and standing there with the fog at his back, the lamplight flickering on him, he looked like a god in a painting.\u003c/p\u003e\n\u003cp\u003eIn this aspect, no one in Jianghu could match up to him.\u003c/p\u003e\n\u003cp\u003eEven if his martial arts were only half as good, he would still be regarded as an esteemed and respected hero.\u003c/p\u003e\n\u003cp\u003eHe was born to be this type of person.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai looked at him, and his eyes suddenly filled with admiration. He quickly stood and poured him a glass of wine.\u003c/p\u003e\n\u003cp\u003e—Why did you go to Luoyang? Why did you deceive me by pretending to be ill?\u003c/p\u003e\n\u003cp\u003eZhuo Donglai did not ask these questions.\u003c/p\u003e\n\u003cp\u003eAt times when he could sense Sima Chaoqun’s bad mood, he would carefully avoid unhappy topics like this.\u003c/p\u003e\n\u003cp\u003e“You must be very tired, and you must have pushed extremely hard. I originally calculated that you would be returning tomorrow.” He smiled. “How is the weather in Luoyang?”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun said nothing. He wore a very strange expression. A long time passed before he finally spoke. “The weather is fine, better than here. The blood on the streets dried very quickly, much more quickly than here.”\u003c/p\u003e\n\u003cp\u003eHis voice was somewhat strange, but Zhuo Donglai didn’t seem to notice.\u003c/p\u003e\n\u003cp\u003e“When blood flows,” Sima continued, “it will dry eventually. It doesn’t really matter whether it dries sooner or dries later.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Zhuo Donglai. “Many things in the world are like this.”\u003c/p\u003e\n\u003cp\u003e“And there are many things in the world that are not like this.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“People live, and eventually die. But there is a huge difference between dying sooner and dying later. If you want to kill someone, can you wait until after they are dead before making your move?”\u003c/p\u003e\n\u003cp\u003e“No,” replied Zhuo Donglai. “When killing people, you must be prompt. When the opportunity passes, things will change, and the circumstances will be different.” He smiled and raised his glass. “Drinking is the same. You must drink promptly. If you wait until later to drink, the wine will become sour.”\u003c/p\u003e\n\u003cp\u003e“Correct,” agreed Sima Chaoqun. “Extremely correct. It seems that when you speak you never say anything wrong.” He lifted his glass and drained it. “This glass I drink to you, because yet again you won a beautiful victory for our Great Protection Agency.”\u003c/p\u003e\n\u003cp\u003e“You already know everything that happened?”\u003c/p\u003e\n\u003cp\u003e“I know. I’ve been back for a while, and I’ve been thinking.”\u003c/p\u003e\n\u003cp\u003e“Thinking about what?”\u003c/p\u003e\n\u003cp\u003e“About you.”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s expression was even more strange. “I’ve thought about everything you’ve done for the past thirty years. I’ve thought about everything in great detail. I can’t help but believe more and more that you are an amazing person. I can’t compare to you at all.”\u003c/p\u003e\n\u003cp\u003eThere was still a smile on Zhuo Donglai’s face, but it had become stiff. “Why would you be thinking about things like this?”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun didn’t respond. Instead, he turned around.\u003c/p\u003e\n\u003cp\u003e“Come with me,” he said. “I want to take you to see some people. After you see them, you’ll understand.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe first rays of morning sunlight began to appear, and the color of the fog grew thicker.\u003c/p\u003e\n\u003cp\u003eInside the small courtyard were no flowers, but instead cabbage, green peas, radishes, lettuce, cucumbers and garlic.\u003c/p\u003e\n\u003cp\u003eThe vegetables had all been planted by Wu Wan, as Sima Chaoqun loved to eat freshly picked produce.\u003c/p\u003e\n\u003cp\u003eThis was why the courtyard had no flowers, only vegetables.\u003c/p\u003e\n\u003cp\u003eEverything Wu Wan did was for her husband. For her husband and her two children.\u003c/p\u003e\n\u003cp\u003eTheir children were very obedient; from the time they were young, Wu Wan had educated them very well. She had never allowed them to come into contact with the affairs of adults, and had never allowed them to wander around outside of the house.\u003c/p\u003e\n\u003cp\u003eOutside was the territory of the Great Protection Agency. Those people and the things they did were not for young children to see.\u003c/p\u003e\n\u003cp\u003eArriving here, Zhuo Donglai suddenly realized that he hadn’t seen Wu Wan or the children for several days.\u003c/p\u003e\n\u003cp\u003eThat was carelessness on his part.\u003c/p\u003e\n\u003cp\u003eFor the sake of his friendship with Sima, and for the sake of the future prospects of the Great Protection Agency, he made a resolution to never again bring up the matter of Guo Zhuang. He would treat Wu Wan and the children better in the future.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 4\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe bottom floor of the small building contained halls; a main hall, and a smaller parlour for drinking. Even though guests rarely came to visit, Wu Wan had decorated the two halls to make them feel very quiet and peaceful.\u003c/p\u003e\n\u003cp\u003eHer room and the children’s room was on the second floor. They all lived together with a wet nurse and two serving girls who had been provided as part of her dowry.\u003c/p\u003e\n\u003cp\u003eHer husband didn’t live in the house.\u003c/p\u003e\n\u003cp\u003eSima treated her well, and treated the children well, but at night he didn’t stay here.\u003c/p\u003e\n\u003cp\u003eThe sky was not yet bright, and the second floor lamps were not lit. Wu Wan and the children must still be deep asleep.\u003c/p\u003e\n\u003cp\u003e—Why would Sima Chaoqun bring him here to see them?\u003c/p\u003e\n\u003cp\u003eZhuo Donglai didn’t understand.\u003c/p\u003e\n\u003cp\u003eWhen the wind blew the milky white fog in through the open bedroom window, it became a deathly gray color. It transformed the previously elegant and peaceful house into something unspeakable gruesome. It was also cold, bone-chillingly cold.\u003c/p\u003e\n\u003cp\u003eThe braziers had long since burned out.\u003c/p\u003e\n\u003cp\u003eWhy would such an attentive mother not keep the braziers lit for her children?\u003c/p\u003e\n\u003cp\u003eNo light, no fire, just wind.\u003c/p\u003e\n\u003cp\u003eLooking into the room from the ghastly, gloomy fog, it appeared as if within, someone was floating in the wind.\u003c/p\u003e\n\u003cp\u003eFloating in mid-air.\u003c/p\u003e\n\u003cp\u003e—How could someone be floating in mid-air? Who was this person?\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s heart suddenly sank, and his pupils constricted.\u003c/p\u003e\n\u003cp\u003eHe had trained his eyes for many years to be as sharp as an eagle’s.\u003c/p\u003e\n\u003cp\u003eHe could now see that it was a person hanging in the air, hanging from a rope.\u003c/p\u003e\n\u003cp\u003eIt was Wu Wan.\u003c/p\u003e\n\u003cp\u003eShe had tied the rope into a noose and attached it to the roof beam, then wrapped it around her throat.\u003c/p\u003e\n\u003cp\u003eAs soon as her legs left solid support, the noose would embed itself into her neck.\u003c/p\u003e\n\u003cp\u003eShe was dead.\u003c/p\u003e\n\u003cp\u003eFrom time immemorial, death has been difficult to avoid. To do so is truly challenging. But sometimes death is so easy.\u003c/p\u003e\n\u003cp\u003eIn addition to Wu Wan, there were others in the room. An old wet nurse with hair as white as frost, two young servant girls as young as flowers, and two adorable children.\u003c/p\u003e\n\u003cp\u003eTwo adorable children with limitless prospects in life. Just looking at them would make one feel joy in one’s heart.\u003c/p\u003e\n\u003cp\u003eBut now, the wet nurse’s white hair would grow no longer. The slave girls would never have a chance to grow old. And the children would never again make people feel joy in their heart in a single glance. Instead, they would make people feel knife-like pain and misery.\u003c/p\u003e\n\u003cp\u003e—The children, so adorable, so miserable.\u003c/p\u003e\n\u003cp\u003e“I let you down, and so I die. I must die. I can only die. But the children shouldn’t die.\u003c/p\u003e\n\u003cp\u003e“And yet, I must let them accompany me in death.\u003c/p\u003e\n\u003cp\u003e“I don’t want them to be children without a mother, and I don’t want them to grow up and become people like your friend Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003e“Old Miss Cui is my wet nurse. When I was small, it was her breast milk that raised me. She always treated me like her own daughter.\u003c/p\u003e\n\u003cp\u003e“Little Fen and Little Fang are like my little sisters.\u003c/p\u003e\n\u003cp\u003e“If I die, they don’t wish to keep on living.\u003c/p\u003e\n\u003cp\u003e“And so we will all die.\u003c/p\u003e\n\u003cp\u003e“I don’t want your forgiveness, I just want you to keep on living. I know that without us, you will be able to have a good life.”\u003c/p\u003e\n\u003cp\u003eSo cold, so cold, so cold. Zhuo Donglai had never felt this cold before.\u003c/p\u003e\n\u003cp\u003eThis elegant little room was actually a tomb, and he was in the tomb.\u003c/p\u003e\n\u003cp\u003eIt felt as if all the muscles and veins and even the marrow in his whole body was completely frozen.\u003c/p\u003e\n\u003cp\u003e“What happened? When did this happen? Why did Wu Wan want to die?”\u003c/p\u003e\n\u003cp\u003e“You don’t know?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” said Zhuo Donglai. “I really don’t.”\u003c/p\u003e\n\u003cp\u003e“They’ve been deed at least three or four days, and yet you don’t know.” Sima Chaoqun’s voice was as cold as ice. “You really looked after them quite well. I should be very grateful to you.”\u003c/p\u003e\n\u003cp\u003eHis words were like a long, cold needle stabbing from the top of his skill to the bottom of his feet.\u003c/p\u003e\n\u003cp\u003eHe had many of reasons to offer in explanation.\u003c/p\u003e\n\u003cp\u003e—These days he had been completely engrossed in dealing with the Lion Clan. This place belonged to Wu Wan and the children, he and other Great Protection Agency men rarely came here.\u003c/p\u003e\n\u003cp\u003eHe didn’t explain.\u003c/p\u003e\n\u003cp\u003eIn this situation, no explanation that could be offered. Any explanation would be meaningless.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun hadn’t looked at him the entire time, and he couldn’t see the expression on Sima’s face.\u003c/p\u003e\n\u003cp\u003e“You asked me, why did Wu Wan want to die?” said Sima Chaoqun. “At first I didn’t understand either. She was not old, she had a good figure, she always loved the children. Even though she wasn’t completely faithful to me, she always fulfilled her duties as a wife.” His voice was strangely calm. “But I didn’t fulfil my duties as a husband. So the person in the wrong is me, not her.”\u003c/p\u003e\n\u003cp\u003e“You know about what happened?”\u003c/p\u003e\n\u003cp\u003e“I know. I knew a long time ago. The husband isn’t always the last one to find out. I also realized that soon it would all be in the past. She would still be my lovely wife, and she would still take care of our children.”\u003c/p\u003e\n\u003cp\u003eHe went on coldly, “I always knew that there would be a price to pay if I went along with your idea to become the hero of the times.”\u003c/p\u003e\n\u003cp\u003e“And so you pretended that you knew nothing.”\u003c/p\u003e\n\u003cp\u003e“Correct,” said Sima Chaoqun. “If I knew, I would have to kill her. This kind of affair cannot occur in the household of a great hero, I would have no choice but to kill her. And so, I could only feign ignorance. Because it’s my house, and I couldn’t allow anything to tear apart my family. Actually, pretending not to know wasn’t enough, I had to make her believe that I suspected absolutely nothing. Only in this way could I preserve my family.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai was completely shocked.\u003c/p\u003e\n\u003cp\u003eHe suddenly realised that he didn’t completely understand Sima Chaoqun after all. He had never imagined that Sima had this side to his personality. He was such an emotional person, and yet after encountering this situation he was still able to take others into consideration.\u003c/p\u003e\n\u003cp\u003e“Most men would not be able to tolerate something like this,” said Sima. “But I came to a realization. If I waited for it to go away, waited for the children to grow up, we would still be like the other husbands and wives, relying on each other, spending the years growing old together.”\u003c/p\u003e\n\u003cp\u003eHe turned and faced Zhuo Donglai. “If you hadn’t pushed her to her death, it would have been like that.”\u003c/p\u003e\n\u003cp\u003e“I pushed her to her death?” Zhuo Donglai’s voice was hoarse. “You really believe I pushed her to her death?”\u003c/p\u003e\n\u003cp\u003e“You not only pushed her to her death, you pushed Guo Zhuang to his death, and sooner or later you will push me to my death. Because you will always need people to do things your way.”\u003c/p\u003e\n\u003cp\u003eHe stared at Zhuo Donglai. “Because you have a sickness in your heart. On the outside you seem like you think so much of yourself, but in your heart, you hate yourself. And so, you need me to go do all the things that you yourself should do. You need me to become the heroic idol, because in your heart, I am the embodiment of you. If someone gets in the way of your plans, you will do anything to destroy that person. And that is why Wu Wan is dead. Because you think that she impeded your plans.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai stood in quiet contemplation for a very long time.\u003c/p\u003e\n\u003cp\u003e“You just told me that you had thought for a long time, and thought about many things.” Zhuo Donglai then asked, “Have you reached the point where you need to make a decision?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And have you made your decision?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“What have you decided to do after this?”\u003c/p\u003e\n\u003cp\u003e“It’s not about what happens later, it’s about now,” said Sima Chaoqun. “Right now, I need you to leave, and never let me see you again. Never again have anything to do with me.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai suddenly seemed like he might not be able to keep standing, as if he had suddenly been struck on the head with a stick.\u003c/p\u003e\n\u003cp\u003e“You can take anything with you, but you must leave,” said Sima Chaoqun resolutely. “Before sundown today, you must be far away from Chang’an.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai suddenly laughed. “I know you really don’t mean it,” he said softly. “You’ve been hurt, and you’re very tired. You just need some rest, and then you’ll forget about everything you just said.”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun looked at him coldly. “This time, you’re mistaken. You will leave. You have no choice but to leave. Do you remember what I just said? You must kill people at the appropriate time, and never let the right opportunity slip by. This situation is the same.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s pupils constricted again. “If I don’t leave?” he asked, one word at a time. “If I don’t leave, will you kill me?”\u003c/p\u003e\n\u003cp\u003e“Yes,” responded Sima Chaoqun in the same tone of voice. One word at a time he said, “If you don’t go, then I will kill you.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 5\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe sky had begun to grow light, but, in contrast, a furtive, ghastly horror filled the room.\u003c/p\u003e\n\u003cp\u003eBecause, the light made more clear the horrible death that filled it.\u003c/p\u003e\n\u003cp\u003eThose who are exceedingly lovely in life, will be exceedingly horrible in death.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai and Sima Chaoqun faced each other. Cold wind blew in through the window, cutting at them like a knife.\u003c/p\u003e\n\u003cp\u003e“I could have left,” said Zhuo Donglai. “A person like me can go anywhere. But as of now, I can’t leave.”\u003c/p\u003e\n\u003cp\u003eHis voice had suddenly become strangely calm.\u003c/p\u003e\n\u003cp\u003e“I’ve spent a lifetime of painstaking care creating the person that you are. I can’t let you be destroyed by someone else.” One word at a time, he continued, “You know what kind of person I am. There are things I would rather do myself.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know.”\u003c/p\u003e\n\u003cp\u003e“Haven’t we always understood each other?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Sima Chaoqun. “And so I’ve prepared myself.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Any time,” said Sima. “When killing people, you must be prompt. These words will forever be etched in my heart.”\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Here.” Sima looked around at the corpses in the room. They were the corpses of the people in his life he was most close to, and each one arose in him an unforgettable feeling. Their deaths had inflicted upon him a pain that made him regret his entire life.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai felt the same.\u003c/p\u003e\n\u003cp\u003eIf Zhuo Donglai also died here, then everything important in his entire life would be dead.\u003c/p\u003e\n\u003cp\u003e“Here,” said Sima Chaoqun. “What other place could be better?”\u003c/p\u003e\n\u003cp\u003e“There is none.” Zhuo Donglai let out a long sigh. “There really is none.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 6\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThere are special types of people in the world who, when you look for them, cannot be found, but when you need them, they will be close by, and will not disappoint you.\u003c/p\u003e\n\u003cp\u003eZhuo Qing was this type of person.\u003c/p\u003e\n\u003cp\u003e“Zhuo Qing, please come in.”\u003c/p\u003e\n\u003cp\u003eIt seemed Zhuo Donglai knew Zhuo Qing would be nearby, and that a soft call would summon him.\u003c/p\u003e\n\u003cp\u003eZhuo Qing didn’t disappoint him. He never disappointed anyone.\u003c/p\u003e\n\u003cp\u003eFrom the time that he was very young, he never disappointed anyone. And yet today, he seemed to be somewhat tired. He was still wore the same clothes he had worn yesterday, and his shoes were caked with mud.\u003c/p\u003e\n\u003cp\u003eHe usually was not like this.\u003c/p\u003e\n\u003cp\u003eUsually, no matter how busy he was, he would take the time to neaten up his appearance. He knew that Zhuo Donglai and Sima Chaoqun were very particular about those types of things.\u003c/p\u003e\n\u003cp\u003eThankfully, Zhuo Donglai wasn’t paying attention to his appearance today, and simply ordered, “Kneel down and kowtow to Uncle Sima.”\u003c/p\u003e\n\u003cp\u003eZhuo Qing kneeled, and Sima Chaoqun did nothing to stop him. His eyes were fixed on Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003e“There’s no need for you to have him kowtow,” said Sima. “I know he’s your adopted child. You have no son, and you want him to carry on the name of the house of Zhuo. If you die, I’ll take care of him.” He couldn’t help but look at his own sons, and his eyes filled with sorrow and fury. “At the very least, I won’t take care of him the way you took care of my sons.”\u003c/p\u003e\n\u003cp\u003e“I believe you,” said Zhuo Donglai. “I truly believe you.” He watched Zhuo Qing finish kowtowing and stand up. Then he said, “You heard what Uncle Sima said. You should know that he never goes back on his word. He will take care you better than me.”\u003c/p\u003e\n\u003cp\u003e“I know.” Zhuo Qing’s voice was hoarse with gratitude. “But, I will never again take another surname.”\u003c/p\u003e\n\u003cp\u003e“Remember, if I die, you must treat Uncle Sima as if he were me.” Zhuo Donglai seemed to be moved by emotion. “No matter what happens between Uncle Sima and I, you must not allow resentment into your heart, and you must never tell anyone what you saw today.”\u003c/p\u003e\n\u003cp\u003e“I know,” said Zhuo Qing sadly. “I will definitely abide by your wishes, even if I die.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai let out a long sigh.\u003c/p\u003e\n\u003cp\u003e“You were always a good child, you definitely have a bright future ahead of you.” He looked at Zhuo Qing. “Come here, there’s something I want you to have. Whether I live or die, you need to keep it safe.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eZhuo Qing walked over, slowly, his eyes filled with an unspeakable sadness, as if he had foreseen that some tragic and horrible thing would happen.\u003c/p\u003e\n\u003cp\u003eHe did not flee, because he knew that fleeing was pointless.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun turned his head, refusing to look at them.\u003c/p\u003e\n\u003cp\u003eHe had made a decision in his heart to never again allow anyone to stir his emotions, and to never allow anything to cause him to change his mind about something.\u003c/p\u003e\n\u003cp\u003eHe then heard a very strange sound, like the sound of leather being pierced.\u003c/p\u003e\n\u003cp\u003eWhen he looked back, he saw that Zhuo Donglai had stabbed Zhuo Qing in the heart with his blade.\u003c/p\u003e\n\u003cp\u003eZhuo Qing took half a step back and then toppled to the ground.\u003c/p\u003e\n\u003cp\u003eHe didn’t cry out.\u003c/p\u003e\n\u003cp\u003eHis pale white face contained no expression of surprise or pain, as if he had long ago known that this would happen.\u003c/p\u003e\n\u003cp\u003e—It was not that Zhuo Donglai’s blade had moved extremely quickly, but rather that he had prepared himself. It was as if when he began to walk forward, he was already completely prepared.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s face twisted in surprise.\u003c/p\u003e\n\u003cp\u003e“Why did you kill him?” His voice harsh, he said, “Are you afraid I would torment him after your death?”\u003c/p\u003e\n\u003cp\u003e“No,” said Zhuo Donglai. “Your heart has always been much more magnanimous and benevolent than mine. You wouldn’t do something like that.” His voice was very calm. “I killed him because I couldn’t leave him behind for you.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“He was very dangerous. Somber, callous and dangerous. At this young age, I could kill him, but in a few years I think I wouldn’t be his match.” He slipped off his violet marten coat and gently wrapped up Zhuo Qing’s corpse. He looked just like a loving father covering his beloved son with a quilt.\u003c/p\u003e\n\u003cp\u003eBut his voice was completely emotionless.\u003c/p\u003e\n\u003cp\u003e“He was already beginning to cultivate his power. While I’m alive I could control him, but if I died, he would achieve my position in a few years. And then he would kill you.” His voice was very calm. “If I left someone like this behind for you, I couldn’t die in peace.”\u003c/p\u003e\n\u003cp\u003eHis voice was flat, as flat as if he was talking about squishing a mosquito for the sake of Sima Chaoqun.\u003c/p\u003e\n\u003cp\u003eIt seemed as if he wanted to coneal from Sima Chaoqun that no matter how sinister, vicious and unfeeling he acted toward others, his feelings toward Sima were true.\u003c/p\u003e\n\u003cp\u003eNo one could argue with this.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s fists were clenched, the blood in his veins boiled.\u003c/p\u003e\n\u003cp\u003eHe knew that he had to control himself, and never again act like he had in the past. He was a flesh and blood person, not a puppet. His wife still hung from the roof. His two lively, cute, intelligent children would never again call him father.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s body suddenly flew into the air, and he flitted like a swallow over the crossbeams of the roof.\u003c/p\u003e\n\u003cp\u003eHis sword lay on the roof beam.\u003c/p\u003e\n\u003cp\u003eThe sword glittered, and then struck down like lightning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 7\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEveryone in Jianghu knew that Sima Chaoqun used a “Thousand Hammers Great Iron Sword.”\u003c/p\u003e\n\u003cp\u003eThe refinement of a thousand hammer blows had forged it.\u003c/p\u003e\n\u003cp\u003eThe power of its descending attack was like the power of a thousand falling hammers, swift and fierce. Ten thousand men together could not defend against it.\u003c/p\u003e\n\u003cp\u003eFour feet, three inches long, weighing ninety pounds, it had been forged using iron from Sichuan, the best iron collected from throughout the province, which was then thoroughly tempered and forged.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBut the sword was really too heavy.\u003c/p\u003e\n\u003cp\u003eSword skill uses quick and flexible movements to create unpredictability, and therefore victory. When using a sword like this, many opportunities to injure one’s opponent would be lost in the rapid changes in stances.\u003c/p\u003e\n\u003cp\u003eIn a battle between masters, those opportunities would be fleeting, and once lost, impossible to recover. But Sima Chaoqun must use a sword like this. Because he was Sima Chaoqun.\u003c/p\u003e\n\u003cp\u003eOnly he would have a sword like this created, and only he could use it.\u003c/p\u003e\n\u003cp\u003eEveryone in Jianghu knew, Sima Chaoqun had been born with superhuman strength. He could lift tens of thousands of pounds as if it were nothing.\u003c/p\u003e\n\u003cp\u003eIf he didn’t use a sword like this, surely everyone would be disappointed.\u003c/p\u003e\n\u003cp\u003eAnd how could the invincible hero Sima Chaoqun let down the heroes of Jianghu?\u003c/p\u003e\n\u003cp\u003eTen thousand men could stand as his enemies, but not Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003eThey had fought side by side for so many years, and had been friends regardless of life or death. They weren’t enemies.\u003c/p\u003e\n\u003cp\u003eWhenever Sima Chaoqun won a brilliant victory, it had been because of Zhuo Donglai’s planning and scheming behind the scenes.\u003c/p\u003e\n\u003cp\u003eThis was a different situation.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun had never fought Zhuo Donglai before, but he knew that he was more powerful than anyone he had faced before in his life. Perhaps even more powerful than he himself.\u003c/p\u003e\n\u003cp\u003eHe knew that many people believed Zhuo Donglai to be weak, but when he knew that he would find himself in a life-and-death battle with him, he had prepared himself to die beneath his blade.\u003c/p\u003e\n\u003cp\u003eAnd therefore, this time, he did not use the Thousand Hammers Great Iron Sword. He could not afford to lose even the slightest opportunity to defeat his opponent.\u003c/p\u003e\n\u003cp\u003eThis time, he used a short sword, a blade as short as Zhuo Donglai’s, and just as sharp.\u003c/p\u003e\n\u003cp\u003eThe blades they used were just like the two of them, both forged in the same furnace.\u003c/p\u003e\n\u003cp\u003eThe fire in the furnace was the same. It could forge iron into steel, and could make weak people strong.\u003c/p\u003e\n\u003cp\u003eThe same furnace, the same cauldron, the same fire.\u003c/p\u003e\n\u003cp\u003eWho was burning whom?\u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 8\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe sword glittered, slashing downward like lightning.\u003c/p\u003e\n\u003cp\u003eThis was the most powerful move of Sima Chaoqun’s renowned “Nine Thunderbolts Forms,” the fierce “Great Thunderbolt.” Who knew how many masters of Jianghu had been defeated by this sword form?\u003c/p\u003e\n\u003cp\u003eHe wasn’t using his Great Iron Sword, and as such the descending attack lacked some of its power. But the sword was extremely sharp, and the speed and flexibility of attack variations made up for the lack of power.\u003c/p\u003e\n\u003cp\u003eHowever, Sima really should not have used this attack.\u003c/p\u003e\n\u003cp\u003eThis attack utilizes strength to defeat weakness. It should be used when it has been calculated that the opponent’s heart has weakened, and their power depleted. Not when facing a formidable foe.\u003c/p\u003e\n\u003cp\u003eThis attack was a complete release of power. If the blow did not land, one’s opponent would definitely be able to counterattack effectively.\u003c/p\u003e\n\u003cp\u003eThere was no margin for error.\u003c/p\u003e\n\u003cp\u003eWhy would Sima use such an attack against Zhuo Donglai? Did he underestimate him? Was he too confident?\u003c/p\u003e\n\u003cp\u003eWhen masters face off it is unforgivable to either underestimate one’s opponent or overestimate one’s own ability.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun should understand this.\u003c/p\u003e\n\u003cp\u003eNo, he would not underestimate Zhuo Donglai, nor overestimate himself. He was someone who rarely made mistakes.\u003c/p\u003e\n\u003cp\u003eThe reason he used this attack was because he understood Zhuo Donglai very well.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai was extremely cautious. Regardless of the circumstances, if he was not completely certain of victory, he wouldn’t make a move. When he did make a move, he would use a stance that was absolutely safe.\u003c/p\u003e\n\u003cp\u003eHe would only make his move if he was certain that there was not even the slightest chance he would be harmed in doing so.\u003c/p\u003e\n\u003cp\u003eThe unbeatable hero Sima Chaoqun was his creation. He had seen with his own eyes countless masters slaughtered with this move.\u003c/p\u003e\n\u003cp\u003eSeeing Sima Chaoqun and his “Great Thunderbolt” sword form together undoubtedly filled his heart with anxiety.\u003c/p\u003e\n\u003cp\u003eThis was his weakness.\u003c/p\u003e\n\u003cp\u003eAnd his weakness was Sima Chaoqun’s opportunity.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun must take advantage of this opportunity. When Zhuo Donglai felt anxiety, he would hesitate, flinch, and the sword could penetrate his heart.\u003c/p\u003e\n\u003cp\u003eWhen masters face off, life and death, victory and defeat, are usually decided by one stance.\u003c/p\u003e\n\u003cp\u003eBecause masters calculate all factors before attacking with their stance.\u003c/p\u003e\n\u003cp\u003e—The weather, the terrain, the opponent’s mood and strength, all will be considered in the calculation.\u003c/p\u003e\n\u003cp\u003eBut everyone makes mistakes. The slightest miscalculation will lead to mistakes that will be regretted for a lifetime.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 9\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe sword glittered, descending like lightning.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai did not hesitate, did not flinch. The lightning-like sword aura did not mesmerize him.\u003c/p\u003e\n\u003cp\u003eHe had already located the tip of the sword within the flickering gleam.\u003c/p\u003e\n\u003cp\u003eThe tip of the sword: the heart of the sword.\u003c/p\u003e\n\u003cp\u003eThe power and variation of a sword’s attack follows its tip, and those variations are the sword’s life force.\u003c/p\u003e\n\u003cp\u003eHe struck at the life force of the sword with his blade.\u003c/p\u003e\n\u003cp\u003eThe glittering, heaven-encompassing sword aura suddenly vanished. Zhuo Donglai’s blade rested on Sima Chaoqun’s throat.\u003c/p\u003e\n\u003cp\u003eSima had no energy left to evade or counterattack. The blade, which could cut through iron like mud, could also slice off his head in an instant.\u003c/p\u003e\n\u003cp\u003eHe waited for the blade to strike, his eyes open.\u003c/p\u003e\n\u003cp\u003eHis eyes were completely free of any sorrow, hatred or fear.\u003c/p\u003e\n\u003cp\u003eIn an instant, he had become infinitely calmer than he had been just a moment ago. If his attack had succeeded, and Zhuo Donglai was dead, perhaps he would not be this calm.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai looked at him coldly, his eyes completely devoid of any emotion.\u003c/p\u003e\n\u003cp\u003e“You made a mistake,” he said. “And so, you are defeated.”\u003c/p\u003e\n\u003cp\u003e“Yes. I’m defeated.”\u003c/p\u003e\n\u003cp\u003e“You’ve always wanted to know which of us would win if we fought, correct?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I didn’t. I never wanted to know.”\u003c/p\u003e\n\u003cp\u003eUnexpectedly, an indescribable heartbreak filled his voice. And yet, this did not stop the blade in his hand from chopping at Sima Chaoqun’s neck.\u003c/p\u003e\n\u003cp\u003eThe blade glimmered, but no blood splattered.\u003c/p\u003e\n\u003cp\u003eThe blow had struck with the dull back of the blade. With that, he left, not looking back, not even glancing at Sima.\u003c/p\u003e\n\u003cp\u003e“Why don’t you kill me?” blurted Sima hoarsely.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai did not turn his head. He just said, “Because you’re already dead to me.”\u003c/p\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-14\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-16\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heros-shed-no-tears/hsnt-chapter-15","bookId":1504,"creation":"Sep 10, 2019 4:32:34 AM","modification":"Sep 10, 2019 4:32:34 AM"}
