{"id":52079,"no":2,"title":"Chapter 1 - A Solitary Box","content":"\u003cp\u003eA solitary person, a solitary box.\u003c/p\u003e\n\u003cp\u003eA quiet, ordinary person, carrying an old-fashioned, ordinary box. As the sun set, this person quietly entered the ancient city of Chang’an.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe fifteenth day of the first month of the lunar calendar.\u003c/p\u003e\n\u003cp\u003eChang’an. \u0026nbsp;\u003ca href\u003d\"#footnote_1\"\u003e[1]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eZhuo Donglai shut the door, closing out the wind and snow that for a thousand years had been a part of the ancient city of Chang’an. He took off his violet, sable-fur coat and hung it on the violet-red sandalwood coat hanger propped to his left. In his right hand he held a set of violet-red copper tongs, which he used to stoke the fire in the violet-red copper brazier in front of him, a brazier which was never extinguished. \u0026nbsp;\u003ca href\u003d\"#footnote_2\"\u003e[2]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNext to the brazier was a violet-red sandalwood chair, over which was draped a fur of violet-red sable. Next to the chair was a violet-red sandalwood table, upon which was a violet crystal bottle, filled with Persian red wine.\u003c/p\u003e\n\u003cp\u003eIt only took two steps to reach the table, upon which he could at leisure pour himself a cup of wine.\u003c/p\u003e\n\u003cp\u003eHe liked the color violet.\u003c/p\u003e\n\u003cp\u003eHe liked famous race horses, beautiful women, luxurious clothes, and good wine. He liked to enjoy himself.\u003c/p\u003e\n\u003cp\u003eHe was extremely particular and picky, and always planned everything meticulously. He was never willing to waste even the slightest amount of energy, and was also never careless. He didn’t even make exceptions for small everyday matters of life.\u003c/p\u003e\n\u003cp\u003eThis was Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003ePerhaps it was because he was this type of person that he had managed to stay alive to this day,\u003c/p\u003e\n\u003cp\u003eHe sat down and took a sip of wine.\u003c/p\u003e\n\u003cp\u003eThe warmth of the luxurious and beautiful room, the fragrant, sweet wine, had already driven the cold from his body. He suddenly felt very tired.\u003c/p\u003e\n\u003cp\u003eThe past two days of preparation for tonight’s grand ceremony had already thrown his normal routines into chaos.\u003c/p\u003e\n\u003cp\u003eHe definitely could not allow any mistakes. Even the smallest mistake could lead to a larger blunder, a blunder which might never be remedied. And if that happened, not only would he feel guilty for the rest of his life; his master would also be implicated. In fact, it could even affect all Jianghu.\u003c/p\u003e\n\u003cp\u003eThe most important thing was that he could not allow Sima Chaoqun’s life or reputation to be harmed in any way, especially now, at the peak of his success. \u0026nbsp;\u003ca href\u003d\"#footnote_3\"\u003e[3]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA person like him, who had worked so hard to become an idol to the heroes of Jianghu, must succeed in every undertaking, must never fail.\u003c/p\u003e\n\u003cp\u003eThere were two things in life that Zhuo Donglai could not tolerate: mistakes and failure.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eSima Chaoqun was already undefeatable.\u003c/p\u003e\n\u003cp\u003eHe rose to prominence in Jianghu at the age of eighteen. Throughout his thirty-three major battles, he had never once been defeated.\u003c/p\u003e\n\u003cp\u003eHe was tall, strong and handsome, with a mighty and bold disposition. His rugged face always carried a bright smile. Even his enemies could not deny that he was a unique man, and there would never be a shortage of beautiful women willing to accompany him. And yet, he was completely faithful not only to his wife, but also to his children and his friends. Not once had he been involved in any sort of scandal.\u003c/p\u003e\n\u003cp\u003eHe was extremely proud of this.\u003c/p\u003e\n\u003cp\u003eHowever, what was most worthy of pride in his life was what he had accomplished in the past two years. Using all of his martial arts ability, wisdom, good character and forthright work ethic, had traveled \u0026nbsp;the roads between the regions north of the Yellow River, all the way to Northeast China, persuading 39 of the greatest heroes and bandits to join him, along with their respective organizations of martial artists. Rising from the depths of the underworld to the pinnacle of righteousness, he had organized a never-before seen Great Protection Agency. For reasonable rates, they protected any trader or traveler in the region.\u003c/p\u003e\n\u003cp\u003eNo mishap had every befallen anyone who stood under the protection of their violet-bordered satin banner, emblazoned upon which was the character “Great.”\u003c/p\u003e\n\u003cp\u003eThis was an unprecedented, glorious achievement in the world of Jianghu. And it was something that could not be achieved using iron and blood alone.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eSima Chaoqun was currently thirty-six years of age, and he could already be considered an idol to the heroes of Jianghu – An invicible heroic idol.\u003c/p\u003e\n\u003cp\u003eOnly he and Zhuodonglai knew what it truly took to attain this position.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 2\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAfter finishing his first cup of wine, Zhuo Donglai once more thought through the plan for the night’s grand ceremony, from start to finish.\u003c/p\u003e\n\u003cp\u003eHe always drank slowly, but thought extremely quickly.\u003c/p\u003e\n\u003cp\u003eToday was the first time ever that Sima Chaoqun would accept a personal disciple. From whosever perspective you looked at it, this matter would cause a huge sensation in Jianghu.\u003c/p\u003e\n\u003cp\u003eThe most shocking part of it all was that Sima Chaoqun’s first disciple was Yang Jian, who had just one month ago betrayed the “Central Plains Lion Clan.”\u003c/p\u003e\n\u003cp\u003eAmong the forty groups of heroes who occupied the northern roads, the Lion Clan was the only one who refused to join Sima Chaoqun’s alliance. They were also the largest and most powerful of the clans.\u003c/p\u003e\n\u003cp\u003eYang Jian had been one of the four most trusted lieutenants of the Lion Clan Leader, Mr. Zhu.\u003c/p\u003e\n\u003cp\u003eNo one in Jianghu would ever have imagined that Yang Jian would betray the Lion Clan. But everyone knew that the day after Yang Jian left the clan, “Fierce Lion” Zhu Meng had sent messages throughout the martial world, expressing his opinion.\u003c/p\u003e\n\u003cp\u003e—No matter the sect, school or clan, anyone who gave haven to Yang Jian was an enemy of the Lion Clan, and would receive full and unequivocal retribution.\u003c/p\u003e\n\u003cp\u003eAnd now, Sima Chaoqun was not only giving him haven, he was opening the doors wide, lighting incense, and accepting him as a disciple.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eEven though the Lion Clan had not joined Sima Chaoqun’s “Great Protection Agency,” they had also not opposed him, let alone attempted to overthrow him.\u003c/p\u003e\n\u003cp\u003e“Fierce Lion” Zhu Meng was sinister, fierce, and cold-blooded. He was not the type of person to trifle with, and when he made a promise, he kept it. If he made it known that he would fight dirty in order to win, then he would use any and all methods to secure victory.\u003c/p\u003e\n\u003cp\u003eIn fact, in order to achieve his goals, he wouldn’t hesitate to sacrifice the heads of his 3,800 subordinates and disciples.\u003c/p\u003e\n\u003cp\u003eWhat he cherished most in life was a woman named Die Wu. \u0026nbsp;\u003ca href\u003d\"#footnote_4\"\u003e[4]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eDie Wu was beautiful, and her dancing even more beautiful.\u003c/p\u003e\n\u003cp\u003eThe man who comprehended the beauty of women more than anyone in the world, the Marquis Di Qinglin, once had an opportunity to watch her dance before he passed away. He was left speechless. Later, others would ask him how he felt about her dancing, and after a very long time he would sigh and say, “I can’t say. I’ve never seen a mortal person with such legs, never imagined that they could even exist.”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eEveryone in Jianghu was convinced that no matter the circumstances, Zhu Meng would never let Yang Jian off.\u003c/p\u003e\n\u003cp\u003eEven if he held off on moving against Sima Chaoqun, he would definitely kill Yang Jian.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai disagreed.\u003c/p\u003e\n\u003cp\u003eHe believed that no matter the situation, Zhu Meng wouldn’t touch a hair on Yang Jian’s head.\u003c/p\u003e\n\u003cp\u003eHe was convinced.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe grand ceremony would be public. Those who received invitation cards could enter the inner chamber as Sima Chaoqun’s personal guests. Those without invitation cards could congregate in the outer courtyard to observe.\u003c/p\u003e\n\u003cp\u003eAmong the disciples of the Lion Clan, there were many who had survived hundreds of battles and killed countless enemies.\u003c/p\u003e\n\u003cp\u003eIn Jianghu, there were many professional assassins who could kill well-protected targets in the twinkling of an eye. Any of these people could show up, blend into the crowd, and wait for an opportunity to kill Yang Jian.\u003c/p\u003e\n\u003cp\u003eThroughout the course of the grand ceremony, there would be many such opportunities.\u003c/p\u003e\n\u003cp\u003eBut Zhuo Donglai believed that the ceremony would be completed smoothly, and that not a hair on Yang Jian’s head would be harmed.\u003c/p\u003e\n\u003cp\u003eThe reason was that he had calculated every possible situation and circumstance; every person who could possibly pose a threat to Yang Jian was under his surveillance.\u003c/p\u003e\n\u003cp\u003eIn preparation, he had already dispatched 186 top-notch masters from the “Northern Roads 39 Great Protection Agencies,” each of whom could easily handle 27 or 28 opponents.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai had split them into eight groups, each of whom would take responsibility for a different area.\u003c/p\u003e\n\u003cp\u003eBut one of the groups he set aside especially to deal with three people.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003e“Which three people?”\u003c/p\u003e\n\u003cp\u003eThat morning, Sima Chaoqun had asked Zhuo Donglai, “Why do you need a whole group to deal with them?”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai only needed to speak the names of two of the people to answer the question.\u003c/p\u003e\n\u003cp\u003e“Because of the three people, one is Han Zhang and the other is the man called \u003cem\u003eWooden Chicken\u003c/em\u003e.”\u003c/p\u003e\n\u003cp\u003eAt the moment, Sima Chaoqun was eating.\u003c/p\u003e\n\u003cp\u003eHe was a strapping man, and needed lots of rich food to maintain his vigorous physique.\u003c/p\u003e\n\u003cp\u003eHis breakfast this morning was a beef loin that weighed about three pounds, along with ten eggs and a huge helping of fruits and vegetables.\u003c/p\u003e\n\u003cp\u003eThe beef was slow roasted over charcoal, covered with spices and juicy sauce, and was extremely tender.\u003c/p\u003e\n\u003cp\u003eThis was one of his favorite foods, but as soon as he heard these two names, he dropped the curved Persian knife he was using to cut the meat. He stared at Zhuo Donglai with eyes as sharp as knives.\u003c/p\u003e\n\u003cp\u003e“Han Zhang and the Wooden Chicken are both here?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Have you seen them before?”\u003c/p\u003e\n\u003cp\u003e“I haven’t.” Zhuo Donglai calmly continued, “I’m sure no one here has ever seen them.”\u003c/p\u003e\n\u003cp\u003eMost people in Jianghu had heard of them, but few had ever seen them.\u003c/p\u003e\n\u003cp\u003eHan Zhang was the same as Yang Jian. He was a lieutenant of the “Fierce Lion,” one of his most trusted followers, and also one of the most dangerous.\u003c/p\u003e\n\u003cp\u003eZhu Meng rarely let him leave his side.\u003c/p\u003e\n\u003cp\u003eThe Wooden Chicken was even more dangerous than Han Zhang.\u003c/p\u003e\n\u003cp\u003eHe had no home and no permanent residence. He had no set pattern of life, and therefore, was impossible to find.\u003c/p\u003e\n\u003cp\u003eBut if someone needed him, and he believed that he needed that person, he would suddenly appear.\u003c/p\u003e\n\u003cp\u003eWhat he normally required of others was pearls, jewels, gold or huge amounts of bank notes.\u003c/p\u003e\n\u003cp\u003eWhat others normally required of him were his flying noose and his two blades.\u003c/p\u003e\n\u003cp\u003eOne long blade, one short blade.\u003c/p\u003e\n\u003cp\u003eHe used a blade to cut peoples’ throats as gently and skillfully as a farmer cutting crops with a sickle.\u003c/p\u003e\n\u003cp\u003eWhen he killed people with his noose, it was just like a dainty playboy placing a string of pearls around the neck of a lover.\u003c/p\u003e\n\u003cp\u003eOf course, he required payment, and if the payment you offered was not sufficient, he wouldn’t kill an ant for you, even if you knelt on the ground and begged.\u003c/p\u003e\n\u003cp\u003eWhoever it was that required his services, they must first offer a sufficient payment. There was only one person who was an exception, because he owed this person his life.\u003c/p\u003e\n\u003cp\u003eAnd that person was Zhu Meng.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe curved knife, its hilt encrusted with jasper, lay on the wooden tray. The blade was covered with meat juices.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun used a delicate piece of silk to rub the blade clean until it shone. When he was finished, he asked Zhuo Donglai, “You’ve never seen them, how do you know they are here?”\u003c/p\u003e\n\u003cp\u003e“I know,” he said coolly. “I know because I know.”\u003c/p\u003e\n\u003cp\u003eDid this qualify as an answer? This type of answer wasn’t an answer at all. No one would be satisfied with this response.\u003c/p\u003e\n\u003cp\u003eAnd yet Sima Chaoqun was satisfied.\u003c/p\u003e\n\u003cp\u003eBecause it was uttered by Zhuo Donglai, and he trusted Zhuo Donglai’s judgement, as much as he trusted that the knife on the wooden tray could cut meat.\u003c/p\u003e\n\u003cp\u003eAnd yet his eyes suddenly shone with a strange expression. And then he said something very strange.\u003c/p\u003e\n\u003cp\u003e“A mistake!” he said. “This time, Zhu Meng made a mistake!”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Han Zhang and the Wooden Chicken are already here?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” said Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003e“Can they leave with their lives?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Are they useful to Zhu Meng?”\u003c/p\u003e\n\u003cp\u003e“They are.”\u003c/p\u003e\n\u003cp\u003e“Would I send two useful people to their deaths?” Sima asked Zhuo Donglai. “Well, would I?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eSima laughed. “So, Zhu Meng made a mistake.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai didn’t laugh. He waited until Sima was finished, then slowly said, “Zhu Meng didn’t make a mistake.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“He didn’t dispatch them here to send them to their deaths.”\u003c/p\u003e\n\u003cp\u003e“Then what did he send them here to do?”\u003c/p\u003e\n\u003cp\u003e“To be a front,” said Zhuo Donglai. “Han Zhang and the Wooden Chicken are just a front.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“The person sent to assassinate Yang Jian is neither of the two. It’s someone else. If we only take precautions against them, then the third person will have a much easier time making a move.”\u003c/p\u003e\n\u003cp\u003e“Who is the third person?”\u003c/p\u003e\n\u003cp\u003e“It’s a young man. He wears clothes of homespun cloth and carries a sword. He’s staying in a cheap little inn, and for every meal he eats a bowl of noodles with boiled cabbage. He’s been here for three days, but he’s never left his room other than to eat.”\u003c/p\u003e\n\u003cp\u003e“He locks himself in a bug-ridden room doing what?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Where is he from?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What sword skill has he studied? Is his sword skill high or low?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s pupils constricted.\u003c/p\u003e\n\u003cp\u003eHe and Zhuo Donglai had been friends for twenty years. From the distressed and impoverished muck, they had clawed their way up to their current position. No one understood him better than Zhuo Donglai, and no one understood Zhuo Donglai better than him.\u003c/p\u003e\n\u003cp\u003eAnd yet he never imagined that he would hear the three words “I don’t know,” come from Zhuo Donglai’s mouth.\u003c/p\u003e\n\u003cp\u003eWhen Zhuo Donglai wanted to investigate a person, he needed at the most 6 to 10 hours to uncover that person’s origin, family circumstances, habits, hobbies, martial arts affiliations, most recent whereabouts, and current destination. He could find out everything. Not only was he extremely experienced in this type of matter, he had many different methods, many special methods, each of which was very effective.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun knew all about these methods.\u003c/p\u003e\n\u003cp\u003e“He’s staying in a cheap inn,” said Sima Chaoqun, “and he wears clothing made from coarse materials. He eats noodles with boiled cabbage. From these facts you can at least see that he is not a very successful person. He must not come from a very good family.”\u003c/p\u003e\n\u003cp\u003e“It would seem that way,” said Zhuo Donglai, “but this young man is an exception.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because of his bearing. When I saw him, even though he was in a little shop eating boiled cabbage noodles with a bunch of coolies and rickshaw drivers, he seemed as if he had just placed first in the Imperial Examinations and was feasting with the Emperor. Even though he was only wearing clothing made from homespun cloth, it seemed as if he was wearing a marten coat worth a thousand pieces of gold.”\u003c/p\u003e\n\u003cp\u003e“Maybe he was purposely puffing himself up.”\u003c/p\u003e\n\u003cp\u003e“This kind of attitude cannot be feigned. Only someone who is completely confident in themselves can have this kind of bearing. I’ve never seen someone so confident.”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun’s eyes shone. It seemed he was very interested in this young person.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai continued, “The name he used at the little inn was ‘Li Huicheng,’ but it’s definitely fake.”\u003c/p\u003e\n\u003cp\u003e“How do you know it’s fake?”\u003c/p\u003e\n\u003cp\u003e“Because I saw the name he wrote at the sales counter. He wrote it himself, and correctly, but very stiffly. When a person who can write characters signs their own name, it shouldn’t be so stiff and unnatural.”\u003c/p\u003e\n\u003cp\u003e“When he speaks, what kind of accent does he have?”\u003c/p\u003e\n\u003cp\u003e“I didn’t hear him speak, but I asked the innkeeper.”\u003c/p\u003e\n\u003cp\u003e“What did the innkeeper say?”\u003c/p\u003e\n\u003cp\u003e“The innkeeper used to work for a protection agency, and has been to a lot of places. In fact, he can speak the dialects of seven or eight different provinces. But even he couldn’t tell where this Mr. Li is from.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because this Mr. Li can speak the dialects of those seven or eight provinces even better than the innkeeper.”\u003c/p\u003e\n\u003cp\u003e“What about his clothing?”\u003c/p\u003e\n\u003cp\u003eYou can tell a lot about a person from the clothes they wear.\u003c/p\u003e\n\u003cp\u003eAll clothing is made from different materials. Even homespun cloth has many different types. Different areas have different methods of dying and weaving, as well as yarn production.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai was also an expert in these types of matters.\u003c/p\u003e\n\u003cp\u003e“I’m sure you saw his clothes,” said Sima Chaoqun. “What could you tell?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t tell anything. I’ve never seen that type of cloth. I’ve never even seen the type of thread used to sew the clothing. I’m sure that he spun the thread himself, wove the cloth himself, and sewed the clothing himself. Even the cotton was probably grown by himself somewhere. Somewhere that neither you nor I have ever been to.”\u003c/p\u003e\n\u003cp\u003eThe two of them had set out together in the beginning, and had adventured throughout China.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun laughed bitterly. “We’ve been almost everywhere.”\u003c/p\u003e\n\u003cp\u003e“I also didn’t see his sword,” said Zhuo Donglai. “His sword was wrapped up in cloth, and always at his side.”\u003c/p\u003e\n\u003cp\u003e“The cloth the sword was wrapped in, was it the same cloth that his clothing was made from?”\u003c/p\u003e\n\u003cp\u003e“Exactly the same.”\u003c/p\u003e\n\u003cp\u003eSima Chaoqun suddenly laughed. “It seems this Mr. Li really is an eccentric. If it turns out that he’s here to kill me, then tonight should be really enjoyable.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 3\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDusk.\u003c/p\u003e\n\u003cp\u003eInside the little restaurant, the fragrances of lard and stir-fry, the sweat of coolies and rickshaw drivers, the odor of hard liquor, hot peppers, leeks and garlic, all mixed together to create a strange, hard-to-describe smell.\u003c/p\u003e\n\u003cp\u003eLittle Gao liked this smell.\u003c/p\u003e\n\u003cp\u003eHe liked the smell of clouds floating past a mountain peak, and the delicate fragrance a cold wind passing through trees and leaves. And yet, he also liked this smell.\u003c/p\u003e\n\u003cp\u003eHe liked the smell of noble and elegant scholars, but he also liked these sweaty men, who sat eating flatbread-wrapped leeks, garlic heads and fatty meat, and drank hard liquor.\u003c/p\u003e\n\u003cp\u003eHe liked people.\u003c/p\u003e\n\u003cp\u003eThis was because he had been alone for too long, and rarely saw people, only the green mountains, white clouds, flowing water and ancient pines. Three months ago he had finally returned to the world of men. And in three months time he had already killed four people.\u003c/p\u003e\n\u003cp\u003eFour local warlords with illustrious reputations, people who deserved to die, and yet couldn’t be killed.\u003c/p\u003e\n\u003cp\u003eHe liked people, and yet he killed people.\u003c/p\u003e\n\u003cp\u003eHe didn’t like killing people, and yet he killed them.\u003c/p\u003e\n\u003cp\u003eThe world is filled with many things like this, things that leave you with no leeway to make any decision.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eChang’an. Ancient Chang’an. A grand city, filled with ancient history and the feeling of countless legends.\u003c/p\u003e\n\u003cp\u003eLittle Gao didn’t come to Chang’an for any of these reasons, though.\u003c/p\u003e\n\u003cp\u003eHe’d come for a person—the forever invincible hero Sima Chaoqun.\u003c/p\u003e\n\u003cp\u003eHe’d brought his sword with him, and his sword sat at hand next to him. It was forever at hand.\u003c/p\u003e\n\u003cp\u003eThe sword was wrapped tightly in cloth.\u003c/p\u003e\n\u003cp\u003eFew people could see this sword. From the time it was forged until now, few people had even had the opportunity to see it.\u003c/p\u003e\n\u003cp\u003eThis sword was not a sword for people to see.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eLittle Gao knew that someone was watching him.\u003c/p\u003e\n\u003cp\u003eThe second day he’d arrived, he’d noticed. It was a very thin man, wearing very expensive clothing, with a pair of cold eyes that seemed like they would never contain an ounce of emotion. His eyes looked like they might be grey.\u003c/p\u003e\n\u003cp\u003eHe had seen eyes like this before.\u003c/p\u003e\n\u003cp\u003eWhen he was eleven years old, he had almost been killed by a leopard. That leopard’s eyes had looked exactly the same.\u003c/p\u003e\n\u003cp\u003eAs soon as this person appeared, it seemed as if everyone in the little restaurant had stopped breathing for a moment.\u003c/p\u003e\n\u003cp\u003eLater, he found out that he was the trusted assistant of the top chief of the “Steward of the 39 Northern Roads Great Protection Agency,” Sima Chaoqun. His name was Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003eLittle Gao slowly ate his bowl of boiled cabbage noodle soup, and he felt very happy.\u003c/p\u003e\n\u003cp\u003eHe knew that Zhuo Donglai and Sima Chaoqun would definitely be suspicious of him, would discuss him, would guess about who he was.\u003c/p\u003e\n\u003cp\u003eHe was sure they would never figure out who he was.\u003c/p\u003e\n\u003cp\u003eHe was like his sword. Few people had ever seen him.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 4\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe sky slowly grew dark. Even though there was no lamp in the room, the lamplight from outside shone brightly.\u003c/p\u003e\n\u003cp\u003eA cold wind blew in through the cracks in the windows, and the faint sound of speaking and laughter could be heard coming from the courtyard outside.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun knew that the guests who had come without an invitation to observe the ceremony outnumbered those he had personally invited.\u003c/p\u003e\n\u003cp\u003eHe also knew that everyone was waiting for him to appear, waiting for the chance to see him.\u003c/p\u003e\n\u003cp\u003eAnd yet he sat in his seat, not moving. Even when his wife entered, he didn’t move.\u003c/p\u003e\n\u003cp\u003eHe was extremely irritated.\u003c/p\u003e\n\u003cp\u003eBurning the incense, accepting a disciple, throwing a huge banquet, receiving guests… he thought all of these things were extremely irritating.\u003c/p\u003e\n\u003cp\u003eHe just wanted to sit there peacefully and have a drink.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eWu Wan understood what he was thinking.\u003c/p\u003e\n\u003cp\u003eNo one understood Sima Chaoqun better than Wu Wan. They had been married for eleven years, and had a nine-year old child.\u003c/p\u003e\n\u003cp\u003eShe had come to urge him to go out as soon as possible.\u003c/p\u003e\n\u003cp\u003eShe had opened the door quietly and entered. Now she left, closing the door behind her, not wanting to disturb him.\u003c/p\u003e\n\u003cp\u003eAs she left, tears streamed down her face.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eSima poured himself another cup of alcohol.\u003c/p\u003e\n\u003cp\u003eHe’d long since passed the first cup. This was the twenty-seventh cup.\u003c/p\u003e\n\u003cp\u003eWhat he was drinking wasn’t wine, like Zhuo Dongli drank, but baijiu. Even though it was colorless and flavorless, when you drank it, it burned like a fire in your stomach.\u003c/p\u003e\n\u003cp\u003eBut he didn’t drink this cup.\u003c/p\u003e\n\u003cp\u003eThe door quietly opened again. This time the person who entered wasn’t Wu Wan, it was Zhuo Donglai.\u003c/p\u003e\n\u003cp\u003eSima lifted his head and placed the cup underneath his chair. He looked at the shadow of Zhuo Donglai in the doorway.\u003c/p\u003e\n\u003cp\u003e“Is it time for me to go out?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 5\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe outer courtyard was illuminated brilliantly and resounded with the clamor of voices.\u003c/p\u003e\n\u003cp\u003eLittle Gao squeezed his way through the crowd. He wasn’t one of Sima Chaoquan’s invited guests, so he couldn’t enter the main hall, where the lamplight shone even more gloriously.\u003c/p\u003e\n\u003cp\u003ePeople also packed the inside hall, but they were all famous, with status, positions and power.\u003c/p\u003e\n\u003cp\u003eIn addition to these famous individuals, there were also several strapping men dressed in dark green gowns of satin and sheepskin. They were strong and nimble as they received the guests, and their eyes shone. They definitely would not allow anything improper to happen, no matter how small.\u003c/p\u003e\n\u003cp\u003eSuddenly the voices grew quiet.\u003c/p\u003e\n\u003cp\u003eThe chief of the “Steward of the 39 Northern Roads Great Protection Agency,” the most powerful person in the martial world, the forever invincible Sima Chaoqun, had finally appeared.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun walked out wearing a black and white garment, carefully tailored to make him look even more powerful and tall than normal, and younger than his actual age.\u003c/p\u003e\n\u003cp\u003eHe greeted the guests in a forthright and honest fashion, and even walked to the stone steps at the front of the hall to wave at the crowd in the outer courtyard.\u003c/p\u003e\n\u003cp\u003eAmidst the ear-spliting cheering that followed, Little Gao wasn’t paying attention to Sima Chaoqun, but two other people.\u003c/p\u003e\n\u003cp\u003eTheir clothing and features were quite ordinary, but their eyes were cold and fearsome, filled with murder.\u003c/p\u003e\n\u003cp\u003eThey didn’t stand together, or even look at each other, but each of them had a group of eight or nine people close by, observing them, careful to maintain a suitable distance.\u003c/p\u003e\n\u003cp\u003eLittle Gao smiled.\u003c/p\u003e\n\u003cp\u003eHe could tell that these two people were here for Yang Jian, first class assassins dispatched by Zhu Meng.\u003c/p\u003e\n\u003cp\u003eHe could also see that Sima Chaoqun and Zhuo Donglai had assigned him the same status as them, as there were people keeping an eye on him as well. Actually, there were a lot of people watching him. Zhuo Donglai must suspect him of being the most dangerous of them all.\u003c/p\u003e\n\u003cp\u003e“But Zhuo Donglai made a mistake this time!” Little Gao smiled to himself. “Assigning people to watch me is really a waste of manpower.”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eTwo huge red candles sat burning on a long table in the middle of the great hall.\u003c/p\u003e\n\u003cp\u003eSima Chaoqun sat in front of the table on a violet-red sandalwood chair, over which was draped a tiger skin.\u003c/p\u003e\n\u003cp\u003eA red felt spread out in front of the chair, upon which rested a violet satin prayer mat.\u003c/p\u003e\n\u003cp\u003eThe grand ceremony was about to start.\u003c/p\u003e\n\u003cp\u003eThe two men with the murderous eyes had already begun to move forward slowly. The men watching them followed, their hands reaching underneath their robes.\u003c/p\u003e\n\u003cp\u003eObviously they had deadly weapons hidden in their garments.\u003c/p\u003e\n\u003cp\u003eIf these two took any action, the men’s hands would spring forth with weapons and slaughter them in a split second, before they even reached the great hall.\u003c/p\u003e\n\u003cp\u003eLittle Gao was certain these two wouldn’t succeed.\u003c/p\u003e\n\u003cp\u003e—There was definitely a third person, and this was who Zhu Meng had actually sent to assassinate Yang Jian.\u003c/p\u003e\n\u003cp\u003eIt turned out Little Gao thought the same way as Zhuo Donglai. The only difference was that he knew the third person wasn’t himself.\u003c/p\u003e\n\u003cp\u003e—Who was this person?\u003c/p\u003e\n\u003cp\u003eLittle Gao’s pupils suddenly constricted.\u003c/p\u003e\n\u003cp\u003eHe’d caught sight of a person who normally wouldn’t attract any attention, dodging through the crowd.\u003c/p\u003e\n\u003cp\u003eAnd an ordinary, old-fashioned box, which definitely wouldn’t attract anyone’s attention.\u003c/p\u003e\n\u003cp\u003eHe wanted to push his way forward, but the crowd was too packed. The star of the grand ceremony had just entered the main hall.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eYang Jian’s pale, sallow face wore a smile.\u003c/p\u003e\n\u003cp\u003eSix people escorted him in.\u003c/p\u003e\n\u003cp\u003eLittle Gao didn’t recognize these six men, but almost anyone who had any experience wandering in Jianghu would know them. Most of them were famous experts in the Protection Agency industry, but even more impressive was that one of them was “Cloudy Sky,” the notorious bandit who in recent years had run amok on the Guanluo Road, which ran between Shaanxi and Luoyang.\u003c/p\u003e\n\u003cp\u003eUnder the protection of six experts like this, who could possibly harm Yang Jian?\u003c/p\u003e\n\u003cp\u003eHe had already reached the red felt, and stood in front of the violet mat prepared especially for him to bow to Sima Chaoqun and accept him as a master.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIn that very moment, the outer courtyard burst into motion. There were already twenty people amidst the crowd on the ground, bleeding and screaming miserably.\u003c/p\u003e\n\u003cp\u003eThe people who had fallen were not just Zhuo Donglai’s subordinates. Many were just random innocents.\u003c/p\u003e\n\u003cp\u003eThis was the plan set upon by Han Zhang and the Wooden Chicken.\u003c/p\u003e\n\u003cp\u003eThey obviously knew people were watching them, so before they made their move, they would try to throw the crowd into chaos by shedding innocent blood.\u003c/p\u003e\n\u003cp\u003eAmidst the chaos, they would fly forward and pounce on Yang Jian.\u003c/p\u003e\n\u003cp\u003eLittle Gao didn’t even glance at them.\u003c/p\u003e\n\u003cp\u003eHe knew that no matter what method they used, they wouldn’t succeed. He kept watching the person with the box.\u003c/p\u003e\n\u003cp\u003eExcept, this person had already disappeared.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eSima Chaoqun sat tall in the violet-red sandalwood chair. His countenance and facial expression did not change.\u003c/p\u003e\n\u003cp\u003eThe assassins had already been contained outside of the main hall.\u003c/p\u003e\n\u003cp\u003eYang Jian had already been whisked away by the six masters, out through a door in the back of the main hall.\u003c/p\u003e\n\u003cp\u003eLittle Gao had already determined which direction the door faced.\u003c/p\u003e\n\u003cp\u003eThe men following being distracted, Little Gao suddenly dashed forward into the main hall, and then used a strange and indescribable martial arts move to slide across the wall and out a window.\u003c/p\u003e\n\u003cp\u003eThe window and the door both faced the same direction.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 6\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOutside the window was a small courtyard filled with the fragrance of plums and pine trees, a scent that would cause anyone to feel extremely happy. Black-garbed guards packed the long, gloomy walkway on the side of the courtyard. Long blades hung from their waists.\u003c/p\u003e\n\u003cp\u003eAt the end of the walkway was a door.\u003c/p\u003e\n\u003cp\u003eAs soon as Little Gao shot out of the window, he caught sight of Cloudy Sky and the others carrying Yang Jian through the door.\u003c/p\u003e\n\u003cp\u003eAnd then the door shut.\u003c/p\u003e\n\u003cp\u003eThe black-garbed guards had already unsheathed their long blades. The blades gleamed, and ten of the guards charged toward Little Gao.\u003c/p\u003e\n\u003cp\u003eThey didn’t ask who Little Gao was? They didn’t ask why he was here?\u003c/p\u003e\n\u003cp\u003eNo. Because they had received orders: if any stranger entered the courtyard, they were to kill on sight, no questions asked!\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eLittle Gao didn’t explain why he was here, or what the circumstances were. It was already past the time when words could be used to make explanations.\u003c/p\u003e\n\u003cp\u003eAt the moment, the only thing he could do was attack first, using his fastest techniques.\u003c/p\u003e\n\u003cp\u003eHe had to get to the door at the end of the walkway, as quickly as possible.\u003c/p\u003e\n\u003cp\u003eLight of shimmered forth from the blade, despite the fact that Little Gao’s sword was still wrapped up in cloth.\u003c/p\u003e\n\u003cp\u003eHe didn’t draw the sword. Using only the rough cloth sheathing, he had already flicked aside four blades, and knocked down four people.\u003c/p\u003e\n\u003cp\u003eIn a flash, he entered the walkway. Seven or eight more men attacked him. He knocked them down and dashed toward the door.\u003c/p\u003e\n\u003cp\u003eBut Zhuo Donglai had already reached the door.\u003c/p\u003e\n\u003cp\u003eHe had been hiding behind the scenes the whole time. Upon any sudden change, he could appear at a moment’s notice.\u003c/p\u003e\n\u003cp\u003eLittle Gao looked at him and let out a long breath. “I thought I would make it on time, but sadly I’m late.”\u003c/p\u003e\n\u003cp\u003eA blade flickered behind him, but Little Gao didn’t look back. Zhuo Donglai waved a hand and the descending blade light suddenly disappeared.\u003c/p\u003e\n\u003cp\u003e“Why are you here?” asked Zhuo Donglai coldly. “What do you want?”\u003c/p\u003e\n\u003cp\u003e“I just want to see someone.”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“A killer.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai smiled coldly. “No one can kill anyone here.”\u003c/p\u003e\n\u003cp\u003e“They can,” said Little Gao. “There’s one who can.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s expression suddenly changed, because he had just noticed the faint reek of blood.\u003c/p\u003e\n\u003cp\u003eShockingly, the smell of the blood emanated from behind the door.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai turned around and pushed it open, and in that moment, it seemed as if he had fallen into hell.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 7\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBehind the door was what used to be a delicate, resplendent room. As of now, it had been turned into hell.\u003c/p\u003e\n\u003cp\u003eHell does not contain living people, and neither did this room.\u003c/p\u003e\n\u003cp\u003eThe seven living people who had just entered the room would never live again. Some had throats cut open, some had hearts impaled, stabbed through from front to back.\u003c/p\u003e\n\u003cp\u003eThe most miserable of all was Yang Jian.\u003c/p\u003e\n\u003cp\u003eHis head was nowhere to be seen, and scattered next to his body were a handful of paper cards. Written on each card were eight characters: “This is the end fate of a traitor!”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThere were four windows in the room, all open.\u003c/p\u003e\n\u003cp\u003eWhere was the killer?\u003c/p\u003e\n\u003cp\u003eThe stars twinkled outside the open windows, and from far off could be heard the raucous sound of drums and gongs. Tonight was the night of the fifteenth day of the first month of the lunar calendar, so the night curfew had been lifted. \u003ca href\u003d\"#footnote_5\"\u003e[5]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eZhuo Donglai stood silently for a long time, the cold wind blowing on his face. Surprisingly, he didn’t dispatch people to pursue the assassin. Instead, he turned around and stared at Little Gao.\u003c/p\u003e\n\u003cp\u003e“You knew killers had been sent here?”\u003c/p\u003e\n\u003cp\u003e“If I knew, then you should have known as well.” He sighed. “I’ve been wanting to see that person for a long time.”\u003c/p\u003e\n\u003cp\u003e“But there wasn’t just one killer.”\u003c/p\u003e\n\u003cp\u003eThe throats had been cut with a slender, sharp blade. The hearts had been pierced with an extremely sharp-tipped spear.\u003c/p\u003e\n\u003cp\u003eAnd Yang Jian’s head had been lopped off with some sort of ax.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai seemed calm again. Calm and composed.\u003c/p\u003e\n\u003cp\u003e“You should be able to tell that there were at least three people here,” he said. “There is nobody who can use three different methods, and completely different weapons, to kill people.”\u003c/p\u003e\n\u003cp\u003e“Yes, there is.” Little Gao’s response was completely heartfelt. “There’s one.”\u003c/p\u003e\n\u003cp\u003e“You really believe that there is a person like this in the world? Some expert who can use three different weapons at the same time to kill seven people?”\u003c/p\u003e\n\u003cp\u003e“Yes!” said Little Gao, with complete confidence. “Who knows, maybe there’s even two people. But definitely at least one.”\u003c/p\u003e\n\u003cp\u003e“Who is this person?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Little Gao sighed again. “If you hadn’t blocked my way just now, I might have had a chance to see him.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai continued to stare at him. His palms felt as if they were sweating.\u003c/p\u003e\n\u003cp\u003e“Alhtough,” said Little Gao, “I actually didn’t know he was here in Chang’an. And I never imagined that he would be working as an assassin for Zhu Meng.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai continued to stare at him for a long time. He stared at his facial expression, his bearing, the way he stood, the cloth-wrapped sword in his hand. He suddenly said, “I believe you. If you want to leave, you can leave.”\u003c/p\u003e\n\u003cp\u003eThis shocked the standers-by. This was not Zhuo Donglai’s style. He had never let someone off so easily.\u003c/p\u003e\n\u003cp\u003eThe only reason he would do something like this was if he considered Little Gao to be very dangerous. Under such circumstances, he wouldn’t want to give rise to any more trouble.\u003c/p\u003e\n\u003cp\u003eLittle Gao laughed.\u003c/p\u003e\n\u003cp\u003e“I know that I can leave any time I want,” he said. “The thing is, I don’t want to go.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because there’s something I need to tell you.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“My surname isn’t Li, and my given name isn’t Huicheng. Furthermore, I didn’t come here for Yang Jian.”\u003c/p\u003e\n\u003cp\u003e“I know,” said Zhuo Donglai. “Because of that, I’m letting you leave.”\u003c/p\u003e\n\u003cp\u003e“Actually, there are a lot of things you don’t know.” Little Gao laughed. “And because you don’t know, I’m not leaving.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai’s hands clenched into fists.\u003c/p\u003e\n\u003cp\u003eHe suddenly realized that this young man had a streak of unruliness that was at first difficult to detect. He was like a wild animal that had just wandered down from the deep mountains, not the least bit afraid of anyone or anything.\u003c/p\u003e\n\u003cp\u003e“I’m surnamed Gao, and I came here for a person.”\u003c/p\u003e\n\u003cp\u003e“For who?”\u003c/p\u003e\n\u003cp\u003e“For Sima Chaoqun. The invincible Sima Chaoqun.”\u003c/p\u003e\n\u003cp\u003eWithin Zhuo Donglai’s clenched fists, cold sweat sprang forth.\u003c/p\u003e\n\u003cp\u003e“You’re Gao Jianfei! The young swordsman Gao Jianfei who in three months time assassinated the four greatest masters of the sword sects Kunlun, Huashan, and Kongtong!” \u0026nbsp;\u003ca href\u003d\"#footnote_6\"\u003e[6]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e“Yes,” said LittleGao. “That’s me.”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe night grew darker, the wind blew harder.\u003c/p\u003e\n\u003cp\u003e“I don’t kill people in secret,” said Little Gao. “So set a date, and a place. I want to find out if Sima Chaoqun really is invincible.”\u003c/p\u003e\n\u003cp\u003eZhuo Donglai laughed. “I guarantee that you will find out. I just wish you didn’t have to.”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 8\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThere was no curfew on the long street. The flower markets and festive lanterns were very picturesque.\u003c/p\u003e\n\u003cp\u003eThere were all types of lanterns and all types of people. But it seemed as if Little Gao didn’t notice them at all.\u003c/p\u003e\n\u003cp\u003eZhuo Donglai had promised to offer a response within one month, and had promised to give him a chance at a fair fight with Sima Chaoqun.\u003c/p\u003e\n\u003cp\u003eThis was why he had come to this place, and yet it seemed as if he was not very focused on the matter.\u003c/p\u003e\n\u003cp\u003eAs of now, his mind was focused on a solitary person, and a solitary box.\u003c/p\u003e\n\u003cp\u003e—Exactly what kind of person was he? Exactly what kind of fearsome weapon was this box?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePart 9\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt the same moment, amidst the black of night and the cold blowing wind, a solitary person, carrying a solitary box, quietly left the ancient city of Chang’an.\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_1\"\u003e[1] Chang\u0027an is of course modern-day Xi\u0027an in Shaanxi Province.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_2\"\u003e[2] Zhuo Donglai’s name in Chinese is 卓东来zhuō dōng lái. “Donglai” literally means “comes from the east.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_3\"\u003e[3] Sima Chaoqun’s name in Chinese is 司马超群 Sīmǎ chāoqún. Sima is a relatively uncommon compound-character Chinese surname. Chaoqun literally means something outstanding or extraordinary.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_4\"\u003e[4] Die Wu’s name in Chinese is 蝶舞 Dié wǔ. The first character is the character for “butterfly” and the second is “dance.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_5\"\u003e[5] The fifteenth day of the first month of the lunar calendar is Lantern Festival, and marks the official end of Spring Festival.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_6\"\u003e[6] Gao Jianfei’s name in Chinese is 高渐飞 gāo jiàn fēi. “Jian” means to do something gradually and “fei” means to fly.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-0\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/heros-shed-no-tears/hsnt-chapter-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/heros-shed-no-tears/hsnt-chapter-1","bookId":1504,"creation":"Sep 10, 2019 4:32:34 AM","modification":"Sep 10, 2019 4:32:34 AM"}
