{"id":79005,"no":22,"title":"Page 22","content":"\u003cp\u003eLater, after I\u0027d stumbled down the stairs - my sense of balance was still off, but getting better - we walked back to the train cars and rested in the shadow of one.\u003c/p\u003e\n\u003cp\u003e\"You saved my life,\"I said softly.\u003c/p\u003e\n\u003cp\u003e\"It was nothing,\"Sam said. \"You would have done the same for me.\"\u003c/p\u003e\n\u003cp\u003e\"Probably,\"I said. \"But I wasn\u0027t called upon to help. I wasn\u0027t the one who had to use his head and act cool. You saved me, Sam. I owe you my life.\"\u003c/p\u003e\n\u003cp\u003e\"Keep it.\"He laughed. \"What would I do with it?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m serious, Sam. I owe you big-time. Anything you ever want or need, just ask, and I\u0027ll do anything to get it for you.\"\u003c/p\u003e\n\u003cp\u003e\"You mean that?\"\u003c/p\u003e\n\u003cp\u003e\"Cross my heart,\"I swore.\u003c/p\u003e\n\u003cp\u003e\"There is one thing,\"he said.\u003c/p\u003e\n\u003cp\u003e\"Name it.\"\u003c/p\u003e\n\u003cp\u003e\"I want to join the Cirque Du Freak.\"\u003c/p\u003e\n\u003cp\u003e\"Saaaammmm...\"I groaned.\u003c/p\u003e\n\u003cp\u003e\"You asked what I wanted, so I\u0027m telling you,\"he replied.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that easy,\"I protested.\u003c/p\u003e\n\u003cp\u003e\"Yes it is,\"he said. \"You can talk to the owner and put in a good word for me. Come on, Darren, did you mean what you said or not?\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"I sighed. \"I\u0027ll ask Mr. Tall.\"\u003c/p\u003e\n\u003cp\u003e\"When?\"\u003c/p\u003e\n\u003cp\u003e\"Today,\"I promised. \"As soon as I get back.\"\u003c/p\u003e\n\u003cp\u003e\"All right!\"Sam tried to high-five me.\u003c/p\u003e\n\u003cp\u003e\"But if he says no,\"I warned him, \"that\u0027s the end of it, okay? I\u0027ll do what I can, but if Mr. Tall says no, that means no.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\"Sam said. \"That\u0027s fine by me.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe there\u0027s a job for me, too,\"somebody said behind my back.\u003c/p\u003e\n\u003cp\u003eI spun around quickly, and there was R.V., smiling strangely.\u003c/p\u003e\n\u003cp\u003e\"You shouldn\u0027t creep up on people like that,\"I snapped. \"You scared me.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, man,\"R.V. said, but he didn\u0027t look very sorry.\u003c/p\u003e\n\u003cp\u003e\"What are you doing out here?\"Sam asked.\u003c/p\u003e\n\u003cp\u003e\"I wanted to find Darren,\"R.V. said. \"I never got a chance to thank him for my ticket.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay,\"I said. \"I\u0027m sorry I wasn\u0027t around to see you when it was over, but I had to go somewhere else.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\"R.V. said, sitting down on the track beside me. \"I can understand that. A show that size, there must be lots to do, huh? I bet they keep you real busy, right, man?\"\u003c/p\u003e\n\u003cp\u003e\"Right,\"I said.\u003c/p\u003e\n\u003cp\u003eR.V. grinned, and stared at the two of us. There was something about the way he was smiling that made me uneasy. It wasn\u0027t a nice smile.\u003c/p\u003e\n\u003cp\u003e\"Tell me,\"R.V. said, \"how\u0027s the wolf-man doing?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine,\"I said.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s chained up all the time, isn\u0027t he?\"R.V. asked.\u003c/p\u003e\n\u003cp\u003e\"No,\"I said, remembering Evra\u0027s warning.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not?\"R.V. acted surprised. \"A wild beast like him, savage and dangerous, and he isn\u0027t locked up?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not really dangerous,\"I said. \"That\u0027s an act. He\u0027s pretty tame, actually.\"I could see Sam staring at me. He knew how wild the wolf-man was and didn\u0027t get why I was lying.\u003c/p\u003e\n\u003cp\u003e\"Tell me, man, what does a thing like that eat?\"R.V. asked.\u003c/p\u003e\n\u003cp\u003e\"Steak. Pork chops. Sausages.\"I forced a smile. \"The usual stuff. All store-bought.\"\u003c/p\u003e\n\u003cp\u003e\"Really? What about the goat that spider bit? Who eats that?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Evra said the two of you bought the goat from a local farmer. Did it cost much?\"\u003c/p\u003e\n\u003cp\u003e\"Not really,\"I said. \"It was pretty sick, so it -\"\u003c/p\u003e\n\u003cp\u003eI stopped. Evra had told R.V. we bought the goat from a butcher , not a farmer.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been doing a little investigating, man,\"R.V. said softly. \"Everybody else in my camp has been getting ready to move on, but I\u0027ve been walking around, counting sheep and cows, asking questions, digging for bones.\u003c/p\u003e\n\u003cp\u003e\"Animals have been vanishing,\"R.V. continued. \"The farmers aren\u0027t taking much notice - they don\u0027t mind the odd one or two missing - but it intrigues me. Who do you think could be taking them, man?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"Another thing,\"he said. \"I was walking along the river you\u0027re camped by, and do you know what I found downstream? Lots of small bones and scraps of skin and meat. Where do you think they could have come from, Darren?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\"I said. Then I stood up. \"I gotta go now. They need me back at the Cirque. Jobs to do.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t let me keep you,\"R.V. said with a smile.\u003c/p\u003e\n\u003cp\u003e\"When is your group headed out?\"I asked. \"I might stop by to say good-bye before you leave.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s nice of you,\"R.V. said. \"But don\u0027t worry, man. I won\u0027t be going anywhere soon.\"\u003c/p\u003e\n\u003cp\u003eI frowned. \"I thought you said you were moving on.\"\u003c/p\u003e\n\u003cp\u003e\"NOP is moving on,\"he said. \"In fact, they\u0027ve already moved. They pulled out yesterday evening.\"He smiled icily. \"But I\u0027m staying a little longer. There are a few things I want to check out.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"Inside my head I swore loudly, but outside I pretended to be happy. \"That\u0027s good news. Well, see you around.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah,\"R.V. said. \"You\u0027ll see me around, man. You can bet on that. You\u0027ll be seeing plenty of me.\"\u003c/p\u003e\n\u003cp\u003eI grinned awkwardly.\u003c/p\u003e\n\u003cp\u003e\"So long for now,\"I said.\u003c/p\u003e\n\u003cp\u003e\"So long,\"R.V. replied.\u003c/p\u003e\n\u003cp\u003e\"Wait up,\"Sam called. \"I\u0027ll come with you.\"\u003c/p\u003e\n\u003cp\u003e\"No,\"I said. \"Come tomorrow. I\u0027ll have an answer from Mr. Tall for you by then. Bye.\"\u003c/p\u003e\n\u003cp\u003eI took off before either of them could say anything else.\u003c/p\u003e\n\u003cp\u003eR.V.\u0027s interest in the disappearance of the animals worried me at first, but as I walked back to camp I began to relax. When all was said and done, he was only a hairy harmless human, while those of us in the Cirque Du Freak were strange, powerful beings. What could he possibly do to hurt us? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-vampire-s-assistant-the-saga-of-darren-shan-2/page-22.html","bookId":2438,"creation":"Oct 5, 2019 4:13:08 PM","modification":"Oct 5, 2019 4:13:08 PM"}
