{"id":70082,"no":14,"title":"Page 14","content":"\u003cp\u003eSome Humanoid Robots\u003c/p\u003e\n\u003cp\u003eIn science fiction it is not uncommon to have a robot built with a surface, at least, of synthetic flesh; and an appearance that is, at best, indistinguishable from the human being. Sometimes such humanoid robots are called \"androids\" (from a Greek term meaning \"manlike\") and some writers are meticulous in making the distinction. I am not. To me a robot is a robot.\u003c/p\u003e\n\u003cp\u003eBut then, Karel Capek\u0027s play R.U.R., which introduced the term \"robot\" to the world in 1920, did not involve robots in the strictest sense of the word. The robots manufactured by Rossum\u0027s Universal Robots (the \"R.U.R.\" of the title) were androids.\u003c/p\u003e\n\u003cp\u003eOne of the three stories in this section, \"Let\u0027s Get Together,\" is the only story in the book in which robots don\u0027t actually appear, and \"Mirror Image\" is a sequel (of sorts) to my robot novels THE CAVES OF STEEL and THE NAKED SUN.\u003c/p\u003e\n\u003cp\u003eLet\u0027s Get Together\u003c/p\u003e\n\u003cp\u003eA kind of peace had endured for a century and people had forgotten what anything else was like. They would scarcely have known how to react had they discovered that a kind of war had finally come.\u003c/p\u003e\n\u003cp\u003eCertainly, Elias Lynn, Chief of the Bureau of Robotics, wasn\u0027t sure how he ought to react when he finally found out. The Bureau of Robotics was headquartered in Cheyenne, in line with the century-old trend toward decentralization, and Lynn stared dubiously at the young Security officer from Washington who had brought the news.\u003c/p\u003e\n\u003cp\u003eElias Lynn was a large man, almost charmingly homely, with pale blue eyes that bulged a bit. Men weren\u0027t usually comfortable under the stare of those eyes, but the Security officer remained calm.\u003c/p\u003e\n\u003cp\u003eLynn decided that his first reaction ought to be incredulity. Hell, it was incredulity! He just didn\u0027t believe it!\u003c/p\u003e\n\u003cp\u003eHe eased himself back in his chair and said, \"How certain is the information?\"\u003c/p\u003e\n\u003cp\u003eThe Security officer, who had introduced himself as Ralph G. Breckenridge and had presented credentials to match, had the softness of youth about him; full lips, plump cheeks that flushed easily, and guileless eyes. His clothing was out of line with Cheyenne but it suited a universally air-conditioned Washington, where Security, despite everything, was still centered.\u003c/p\u003e\n\u003cp\u003eBreckenridge flushed and said, \"There\u0027s no doubt about it.\"\u003c/p\u003e\n\u003cp\u003e\"You people know all about Them, I suppose,\" said Lynn and was unable to keep a trace of sarcasm out of his tone. He was not particularly aware of his use of a slightly stressed pronoun in his reference to the enemy, the equivalent of capitalization in print. It was a cultural habit of this generation and the one preceding. No one said the \"East\" or the \"Reds\" or the \"Soviets\" or the \"Russians\" any more. That would have been too confusing, since some of Them weren\u0027t of the East, weren\u0027t Reds, Soviets, and especially not Russians. It was much simpler to say We and They, and much more precise.\u003c/p\u003e\n\u003cp\u003eTravelers had frequently reported that They did the same in reverse. Over there, They were \"We\" (in the appropriate language) and We were \"They.\"\u003c/p\u003e\n\u003cp\u003eScarcely anyone gave thought to such things any more. It was all quite comfortable and casual. There was no hatred, even. At the beginning, it had been called a Cold War. Now it was only a game, almost a good-natured game, with unspoken rules and a kind of decency about it.\u003c/p\u003e\n\u003cp\u003eLynn said abruptly, \"Why should They want to disturb the situation?\"\u003c/p\u003e\n\u003cp\u003eHe rose and stood staring at a wall map of the world, split into two regions with faint edgings of color. An irregular portion on the left of the map was edged in a mild green. A smaller, but just as irregular, portion on the right of the map was bordered in a washed-out pink. We and They.\u003c/p\u003e\n\u003cp\u003eThe map hadn\u0027t changed much in a century. The loss of Formosa and the gain of East Germany some eighty years before had been the last territorial switch of importance.\u003c/p\u003e\n\u003cp\u003eThere had been another change, though, that was significant enough and that was in the colors. Two generations before, Their territory had been a brooding, bloody red, Ours a pure and undefiled white. Now there was a neutrality about the colors. Lynn had seen Their maps and it was the same on Their side.\u003c/p\u003e\n\u003cp\u003e\"They wouldn\u0027t do it,\" he said.\u003c/p\u003e\n\u003cp\u003e\"They are doing it, \" said Breckenridge, \"and you had better accustom yourself to the fact. Of course, sir, I realize that it isn\u0027t pleasant to think that They may be that far ahead of us in robotics.\"\u003c/p\u003e\n\u003cp\u003eHis eyes remained as guileless as ever, but the hidden knife-edges of the words plunged deep, and Lynn quivered at the impact.\u003c/p\u003e\n\u003cp\u003eOf course, that would account for why the Chief of Robotics learned of this so late and through a Security officer at that. He had lost caste in the eyes of the Government; if Robotics had really failed in the struggle, Lynn could expect no political mercy.\u003c/p\u003e\n\u003cp\u003eLynn said wearily, \"Even if what you say is true, They\u0027re not far ahead of us. We could build humanoid robots.\"\u003c/p\u003e\n\u003cp\u003e\"Have we, sir?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. As a matter of fact, we have built a few models for experimental purposes.\"\u003c/p\u003e\n\u003cp\u003e\"They were doing so ten years ago. They\u0027ve made ten years\u0027 progress since.\"\u003c/p\u003e\n\u003cp\u003eLynn was disturbed. He wondered if his incredulity concerning the whole business was really the result of wounded pride and fear for his job and reputation. He was embarrassed by the possibility that this might be so, and yet he was forced into defense.\u003c/p\u003e\n\u003cp\u003eHe said, \"Look, young man, the stalemate between Them and Us was never perfect in every detail, you know. They have always been ahead in one facet or another and We in some other facet or another. If They\u0027re ahead of us right now in robotics, it\u0027s because They\u0027ve placed a greater proportion of Their effort into robotics than We have. And that means that some other branch of endeavor has received a greater share of Our efforts than it has to Theirs. It would mean We\u0027re ahead in force-field research or in hyperatomics, perhaps.\"\u003c/p\u003e\n\u003cp\u003eLynn felt distressed at his own statement that the stalemate wasn\u0027t perfect. It was true enough, but that was the one great danger threatening the world. The world depended on the stalemate being as perfect as possible. If the small unevennesses that always existed overbalanced too far in one direction or the other\u003c/p\u003e\n\u003cp\u003eAlmost at the beginning of what had been the Cold War, both sides had developed thermonuclear weapons, and war became unthinkable. Competition switched from the military to the economic and psychological and had stayed there ever since.\u003c/p\u003e\n\u003cp\u003eBut always there was the driving effort on each side to break the stalemate, to develop a parry for every possible thrust, to develop a thrust that could not be parried in time-something that would make war possible again. And that was not because either side wanted war so desperately, but because both were afraid that the other side would make the crucial discovery first.\u003c/p\u003e\n\u003cp\u003eFor a hundred years each side had kept the struggle even. And in the process, peace had been maintained for a hundred years while, as byproducts of the continuously intensive research, force fields had been produced and solar energy and insect control and robots. Each side was making a beginning in the understanding of mentalics, which was the name given to the biochemistry and biophysics of thought. Each side had its outposts on the Moon and on Mars. Mankind was advancing in giant strides under forced draft.\u003c/p\u003e\n\u003cp\u003eIt was even necessary for both sides to be as decent and humane as possible among themselves, lest through cruelty and tyranny, friends be made for the other side.\u003c/p\u003e\n\u003cp\u003eIt couldn\u0027t be that the stalemate would now be broken and that there would be war.\u003c/p\u003e\n\u003cp\u003eLynn said, \"I want to consult one of my men. I want his opinion.\u003c/p\u003e\n\u003cp\u003e\"Is he trustworthy?\"\u003c/p\u003e\n\u003cp\u003eLynn looked disgusted. \"Good Lord, what man in Robotics has not been investigated and cleared to death by your people? Yes, I vouch for him. If you can\u0027t trust a man like Humphrey Carl Laszlo, then we\u0027re in no position to face the kind of attack you say They are launching, no matter what else we do.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve heard of Laszlo,\" said Breckenridge. \"Good. Does he pass?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Then, I\u0027ll have him in and we\u0027ll find out what he thinks about the possibility that robots could invade the U.S.A.\"\u003c/p\u003e\n\u003cp\u003e\"Not exactly,\" said Breckenridge, softly. \"You still don\u0027t accept the full truth. Find out what he thinks about the fact that robots have already invaded the U.S.A.\"\u003c/p\u003e\n\u003cp\u003eLaszlo was the grandson of a Hungarian who had broken through what had then been called the Iron Curtain, and he had a comfortable above-suspicion feeling about himself because of it. He was thick-set and balding with a pugnacious look graven forever on his snub face, but his accent was clear Harvard and he was almost excessively soft-spoken.\u003c/p\u003e\n\u003cp\u003eTo Lynn, who was conscious that after years of administration he was no longer expert in the various phases of modem robotics, Laszlo was a comforting receptacle for complete knowledge. Lynn felt better because of the man\u0027s mere presence.\u003c/p\u003e\n\u003cp\u003eLynn said, \"What do you think?\" A scowl twisted Laszlo\u0027s face ferociously. \"That They\u0027re that far ahead of us. Completely incredible. It would mean They\u0027ve produced humanoids that could not be told from humans at close quarters. It would mean a considerable advance in robo-mentalics.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re personally involved,\" said Breckenridge, coldly. \"Leaving professional pride out of account, exactly why is it impossible that They be ahead of Us?\"\u003c/p\u003e\n\u003cp\u003eLaszlo shrugged. \"I assure you that I\u0027m well acquainted with Their literature on robotics. I know approximately where They are.\"\u003c/p\u003e\n\u003cp\u003e\"You know approximately where They want you to think They are, is what you really mean,\" corrected Breckenridge. \"Have you ever visited the other side?\"\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t,\" said Laszlo, shortly. \"Nor you, Dr. Lynn?\"\u003c/p\u003e\n\u003cp\u003eLynn said, \"No, I haven\u0027t, either.\"\u003c/p\u003e\n\u003cp\u003eBreckenridge said, \"Has any robotics man visited the other side in twenty-five years?\" He asked the question with a kind of confidence that indicated he knew the answer.\u003c/p\u003e\n\u003cp\u003eFor a matter of seconds, the atmosphere was heavy with thought. Discomfort crossed Lazlo\u0027s broad face. He said, \"As a matter of fact, They haven\u0027t held any conferences on robotics in a long time.\"\u003c/p\u003e\n\u003cp\u003e\"In twenty-five years,\" said Breckenridge. \"Isn\u0027t that significant?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" said Laszlo, reluctantly. \"Something else bothers me, though. None of Them have ever come to Our conferences on robotics. None that I can remember.\"\u003c/p\u003e\n\u003cp\u003e\"Were They invited?\" asked Breckenridge.\u003c/p\u003e\n\u003cp\u003eLynn, staring and worried, interposed quickly, \"Of course.\" Breckenridge said, \"Do They refuse attendance to any other types of scientific conferences We hold?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" said Laszlo. He was pacing the floor now. \"I haven\u0027t heard of any cases. Have you, Chief?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" said Lynn.\u003c/p\u003e\n\u003cp\u003eBreckenridge said, \"Wouldn\u0027t you say it was as though They didn\u0027t want to be put in the position of having to return any such invitation? Or as though They were afraid one of Their men might talk too much?\"\u003c/p\u003e\n\u003cp\u003eThat was exactly how it seemed, and Lynn felt a helpless conviction that Security\u0027s story was true after all steal over him.\u003c/p\u003e\n\u003cp\u003eWhy else had there been no contact between sides on robotics? There had been a cross-fertilizing trickle of researchers moving in both directions on a strictly one-for-one basis for years, dating back to the days of Eisenhower and Krushchev. There were a great many good motives for that: an honest appreciation of the supranational character of science; impulses of friendliness that are hard to wipe out completely in the individual human being; the desire to be exposed to a fresh and interesting outlook and to have your own slightly stale notions greeted by others as fresh and interesting.\u003c/p\u003e\n\u003cp\u003eThe governments themselves were anxious that this continue. There was always the obvious thought that by learning all you could and telling as little as you could, your own side would gain by the exchange.\u003c/p\u003e\n\u003cp\u003eBut not in the case of robotics. Not there.\u003c/p\u003e\n\u003cp\u003eSuch a little thing to carry conviction. And a thing, moreover, they had known all along. Lynn thought darkly: We\u0027ve taken the complacent way out.\u003c/p\u003e\n\u003cp\u003eBecause the other side had done nothing publicly on robotics, it had been tempting to sit back smugly and be comfortable in the assurance of superiority. Why hadn\u0027t it seemed possible, even likely, that They were hiding superior cards, a trump hand, for the proper time?\u003c/p\u003e\n\u003cp\u003eLaszlo said shakenly, \"What do we do?\" It was obvious that the same line of thought had carried the same conviction to him.\u003c/p\u003e\n\u003cp\u003e\"Do?\" parroted Lynn. It was hard to think right now of anything but the complete horror that came with conviction. There were ten humanoid robots somewhere in the United States, each one carrying a fragment of a TC bomb.\u003c/p\u003e\n\u003cp\u003eTC! The race for sheer horror in bombery had ended there. TCI Total Conversion! The sun was no longer a synonym one could use. Total conversion made the sun a penny candle.\u003c/p\u003e\n\u003cp\u003eTen humanoids, each completely harmless in separation, could, by the simple act of coming together, exceed critical mass and Lynn rose to his feet heavily, the dark pouches under his eyes, which ordinarily lent his ugly face a look of savage foreboding, more prominent than ever. \"It\u0027s going to be up to us to figure out ways and means of telling a humanoid from a human and then finding the humanoids.\"\u003c/p\u003e\n\u003cp\u003e\"How quickly?\" muttered Laszlo.\u003c/p\u003e\n\u003cp\u003e\"Not later than five minutes before they get together,\" barked Lynn, \"and I don\u0027t know when that will be.\"\u003c/p\u003e\n\u003cp\u003eBreckenridge nodded. \"I\u0027m glad you\u0027re with us now, sir, I\u0027m to bring you back to Washington for conference, you know.\"\u003c/p\u003e\n\u003cp\u003eLynn raised his eyebrows. \"All right.\"\u003c/p\u003e\n\u003cp\u003eHe wondered if, had he delayed longer in being convinced, he might not have been replaced forthwith-if some other Chief of the Bureau of Robotics might not be conferring in Washington. He suddenly wished earnestly that exactly that had come to pass.\u003c/p\u003e\n\u003cp\u003eThe First Presidential Assistant was there, the Secretary of Science, the Secretary of Security, Lynn himself, and Breckenridge. Five of them sitting about a table in the dungeons of an underground fortress near Washington.\u003c/p\u003e\n\u003cp\u003ePresidential Assistant Jeffreys was an impressive man, handsome in a white-haired and just-a-trifle-jowly fashion, solid, thoughtful and as unobtrusive, politically, as a Presidential Assistant ought to be.\u003c/p\u003e\n\u003cp\u003eHe spoke incisively. \"There are three questions that face us as I see it. First, when are the humanoids going to get together? Second, where are they going to get together? Third, how do we stop them before they get together?\"\u003c/p\u003e\n\u003cp\u003eSecretary of Science Amberley nodded convulsively at that. He had been Dean of Northwestern Engineering before his appointment. He was thin, sharp-featured and noticeably edgy. His forefinger traced slow circles on the table\u003c/p\u003e\n\u003cp\u003e\"As far as when they\u0027ll get together,\" he said. \"I suppose it\u0027s definite that it won\u0027t be for some time.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you say that?\" asked Lynn sharply.\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve been in the U.S. at least a month already. So Security says.\"\u003c/p\u003e\n\u003cp\u003eLynn turned automatically to look at Breckenridge, and Secretary of Security Macalaster intercepted the glance. Macalaster said, \"The information is reliable. Don\u0027t let Breckenridge\u0027s apparent youth fool you, Dr. Lynn. That\u0027s part of his value to us. Actually, he\u0027s thirty-four and has been with the department for ten years. He has been in Moscow for nearly a year and without him, none of this terrible danger would be known to us. As it is, we have most of the details.\"\u003c/p\u003e\n\u003cp\u003e\"Not the crucial ones,\" said Lynn.\u003c/p\u003e\n\u003cp\u003eMacalaster of Security smiled frostily. His heavy chin and close-set eyes were well-known to the public but almost nothing else about him was. He said, \"We are all finitely human, Dr. Lynn. Agent Breckenridge has done a great deal.\"\u003c/p\u003e\n\u003cp\u003ePresidential Assistant Jeffreys cut in. \"Let us say we have a certain amount of time. If action at the instant were necessary, it would have happened before this. It seems likely that they are waiting for a specific time. If we knew the place, perhaps the time would become self-evident.\u003c/p\u003e\n\u003cp\u003e\"If they are going to TC a target, they will want to cripple us as much as possible, so it would seem that a major city would have to be it. In any case, a major metropolis is the only target worth a TC bomb. I think there are four possibilities: Washington, as the administrative center; New York, as the financial center; and Detroit and Pittsburgh as the two chief industrial centers.\"\u003c/p\u003e\n\u003cp\u003eMacalaster of Security said, \"I vote for New York. Administration and industry have both been decentralized to the point where the destruction of anyone particular city won\u0027t prevent instant retaliation.\"\u003c/p\u003e\n\u003cp\u003e\"Then why New York?\" asked Amberly of Science, perhaps more sharply than he intended. \"Finance has been decentralized as well.\"\u003c/p\u003e\n\u003cp\u003e\"A question of morale. It may be they intend to destroy our will to resist, to induce surrender by the sheer horror of the first blow. The greatest destruction of human life would be in the New York Metropolitan area-\"\u003c/p\u003e\n\u003cp\u003e\"Pretty cold-blooded,\" muttered Lynn. \"I know,\" said Macalaster of Security, \"but they\u0027re capable of it, if they thought it would mean final victory at a stroke. Wouldn\u0027t we-\"\u003c/p\u003e\n\u003cp\u003ePresidential Assistant Jeffreys brushed back his white hair. \"Let\u0027s assume the worst. Let\u0027s assume that New York will be destroyed some time during the winter, preferably immediately after a serious blizzard when communications are at their worst and the disruption of utilities and food supplies in fringe areas will be most serious in their effect. Now, how do we stop them?\"\u003c/p\u003e\n\u003cp\u003eAmberley of Science could only say, \"Finding ten men in two hundred and twenty million is an awfully small needle in an awfully large haystack.\"\u003c/p\u003e\n\u003cp\u003eJeffreys shook his head. \"You have it wrong. Ten humanoids among two hundred twenty million humans.\"\u003c/p\u003e\n\u003cp\u003e\"No difference,\" said Amberley of Science. \"We don\u0027t know that a humanoid can be differentiated from a human at sight. Probably not.\" He looked at Lynn. They all did.\u003c/p\u003e\n\u003cp\u003eLynn said heavily, \"We in Cheyenne couldn\u0027t make one that would pass as human in the daylight.\"\u003c/p\u003e\n\u003cp\u003e\"But They can,\" said Macalaster of Security, \"and not only physically. We\u0027re sure of that. They\u0027ve advanced mentalic procedures to the point where They can reel off the micro-electronic pattern of the brain and focus it on the positronic pathways of the robot.\"\u003c/p\u003e\n\u003cp\u003eLynn stared. \"Are you implying that They can create the replica of a human being complete with personality and memory?\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Of specific human beings?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Is this also based on Agent Breckenridge\u0027s findings?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. The evidence can\u0027t be disputed.\"\u003c/p\u003e\n\u003cp\u003eLynn bent his head in thought for a moment. Then he said, \"Then ten men in the United States are not men but humanoids. But the originals would have had to be available to them. They couldn\u0027t be Orientals, who would be too easy to spot, so they would have to be East Europeans. How would they be introduced into this country, then? With the radar network over the entire world border as tight as a drum, how could They introduce any individual, human or humanoid, without our knowing it?\"\u003c/p\u003e\n\u003cp\u003eMacalaster of Security said, \"It can be done. There are certain legitimate seepages across the border. Businessmen, pilots, even tourists. They\u0027re watched, of course, on both sides. Still ten of them might have been kidnaped and used as models for humanoids. The humanoids would then be sent back in their place. Since we wouldn\u0027t expect such a substitution, it would pass us by. If they were Americans to begin with, there would be no difficulty in their getting into this country. It\u0027s as simple as that.\"\u003c/p\u003e\n\u003cp\u003e\"And even their friends and family could not tell the difference?\"\u003c/p\u003e\n\u003cp\u003e\"We must assume so. Believe me, we\u0027ve been waiting for any report that might imply sudden attacks of amnesia or troublesome changes in personality. We\u0027ve checked on thousands.\"\u003c/p\u003e\n\u003cp\u003eAmberley of Science stared at his finger tips. \"I think ordinary measures won\u0027t work. The attack must come from the Bureau of Robotics and I depend on the chief of that bureau.\" Again eyes turned sharply, expectantly, on Lynn. Lynn felt bitterness rise. It seemed to him that this was what the conference came to and was intended for. Nothing that had been said had not been said before. He was sure of that. There was no solution to the problem, no pregnant suggestion. It was a device for the record, a device on the part of men who gravely feared defeat and who wished the responsibility for it placed clearly and unequivocally on someone else.\u003c/p\u003e\n\u003cp\u003eAnd yet there was justice in it. It was in robotics that We had fallen short. And Lynn was not Lynn merely. He was Lynn of Robotics and the responsibility had to be his.\u003c/p\u003e\n\u003cp\u003eHe said, \"I will do what I can.\"\u003c/p\u003e\n\u003cp\u003eHe spent a wakeful night and there was a haggardness about both body and soul when he sought and attained another interview with Presidential Assistant Jeffreys the next morning. Breckenridge was there, and though Lynn would have preferred a private conference, he could see the justice in the situation. It was obvious that Breckenridge had attained enormous influence with the government as a result of his successful Intelligence work. Well, why not?\u003c/p\u003e\n\u003cp\u003eLynn said, \"Sir, I am considering the possibility that we are hopping uselessly to enemy piping.\"\u003c/p\u003e\n\u003cp\u003e\"In what way?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure that however impatient the public may grow at times, and however legislators sometimes find it expedient to talk, the government at least recognizes the world stalemate to be beneficial. They must recognize it also. Ten humanoids with one TC bomb is a trivial way of breaking the stalemate.\"\u003c/p\u003e\n\u003cp\u003e\"The destruction of fifteen million human beings is scarcely trivial.\"\u003c/p\u003e\n\u003cp\u003e\"It is from the world power standpoint. It would not so demoralize us to make us surrender or so cripple us as to convince us we could not win. There would just be the same old planetary death war that both sides have avoided so long and so successfully. And all They would have accomplished is to force us to fight minus one city. It\u0027s not enough.\"\u003c/p\u003e\n\u003cp\u003e\"What do you suggest?\" said Jeffreys coldly. \"That They do not have ten humanoids in our country? That there is not a TC bomb waiting to get together?\"\u003c/p\u003e\n\u003cp\u003e\"1\u002711 agree that those things are here, but perhaps for some reason greater than just midwinter bomb madness.\"\u003c/p\u003e\n\u003cp\u003e\"Such as?\"\u003c/p\u003e\n\u003cp\u003e\"It may be that the physical destruction resulting from the humanoids getting together is not the worst thing that can happen to us. What about the moral and intellectual destruction that comes of their being here at all? With all due respect to Agent Breckenridge, what if They intended for us to find out about the humanoids; what if the humanoids are never supposed to get together, but merely to remain separate in order to give us something to worry about.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Tell me this. What measures have already been taken against the humanoids? I suppose that Security is going through the files of all citizens who have ever been across the border or close enough to it to make kidnapping possible. I know, since Macalaster mentioned it yesterday, that they are following up suspicious psychiatric cases. What else?\"\u003c/p\u003e\n\u003cp\u003eJeffreys said, \"Small X-ray devices are being installed in key places in the large cities. In the mass arenas, for instance-\"\u003c/p\u003e\n\u003cp\u003e\"Where ten humanoids might slip in among a hundred thousand spectators of a football game or an air-polo match?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\"\u003c/p\u003e\n\u003cp\u003e\"And concert halls and churches?\"\u003c/p\u003e\n\u003cp\u003e\"We must start somewhere. We can\u0027t do it all at once.\"\u003c/p\u003e\n\u003cp\u003e\"Particularly when panic must be avoided,\" said Lynn. \"Isn\u0027t that so? It wouldn\u0027t do to have the public realize that at any unpredictable moment, some unpredictable city and its human contents would suddenly cease to exist.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose that\u0027s obvious. What are you driving at?\"\u003c/p\u003e\n\u003cp\u003eLynn said strenuously, \"That a growing fraction of our national effort will be diverted entirely into the nasty problem of what Amberley called finding a very small needle in a very large haystack. We\u0027ll be chasing our tails madly, while They increase their research lead to the point where we find we can no longer catch up; when we must surrender without the chance even of snapping our fingers in retaliation.\u003c/p\u003e\n\u003cp\u003e\"Consider further that this news will leak out as more and more people become involved in our countermeasures and more and more people begin to guess what we\u0027re doing. Then what? The panic might do us more harm than anyone TC bomb.\"\u003c/p\u003e\n\u003cp\u003eThe Presidential Assistant said irritably, \"In Heaven\u0027s name, man, what do you suggest we do, then?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" said Lynn. \"Call their bluff. Live as we have lived and gamble that They won\u0027t dare break the stalemate for the sake of a one-bomb head start.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible!\" said Jeffreys. \"Completely impossible. The welfare of all of Us is very largely in my hands, and doing nothing is the one thing I cannot do. I agree with you, perhaps, that X-ray machines at sports arenas are a kind of skin-deep measure that won\u0027t be effective, but it has to be done so that people, in the aftermath, do not come to the bitter conclusion that we tossed our country away for the sake of a subtle line of reasoning that encouraged donothingism. In fact, our counter-gambit will be active indeed.\"\u003c/p\u003e\n\u003cp\u003e\"In what way?\" Presidential Assistant Jeffreys looked at Breckenridge. The young Security officer, hitherto calmly silent, said, \"It\u0027s no use talking about a possible future break in the stalemate when the stalemate is broken now. It doesn\u0027t matter whether these humanoids explode or do not. Maybe they are only a bait to divert us, as you say. But the fact remains that we are a quarter of a century behind in robotics, and that may be fatal. What other advances in robotics will there be to surprise us if war does start? The only answer is to divert our entire force immediately, now, into a crash program of robotics research, and the first problem is to find the humanoids. Call it an exercise in robotics, if you will, or call it the prevention of the death of fifteen million men, women and children.\"\u003c/p\u003e\n\u003cp\u003eLynn shook his head helplessly. \"You can\u0027t. You\u0027d be playing into their hands. They want us lured into the one blind alley while they\u0027re free to advance in all other directions.\"\u003c/p\u003e\n\u003cp\u003eJeffreys said impatiently, \"That\u0027s your guess. Breckenridge has made his suggestion through channels and the government has approved, and we will begin with an all-Science conference.\"\u003c/p\u003e\n\u003cp\u003e\"All-Science?\"\u003c/p\u003e\n\u003cp\u003eBreckenridge said, \"We have listed every important scientist of every branch of natural science. They\u0027ll all be at Cheyenne. There will be only one point on the agenda: How to advance robotics. The major specific subheading under that will be: How to develop a receiving device for the electromagnetic fields of the cerebral cortex that will be sufficiently delicate to distinguish between a protoplasmic human brain and a positronic humanoid brain.\"\u003c/p\u003e\n\u003cp\u003eJeffreys said, \"We had hoped you would be willing to be in charge of the conference.\"\u003c/p\u003e\n\u003cp\u003e\"I was not consulted in this.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously time was short, sir. Do you agree to be in charge?\" Lynn smiled briefly. It was a matter of responsibility again. The responsibility must be clearly that of Lynn of Robotics. He had the feeling it would be Breckenridge who would really be in charge. But what could he do?\u003c/p\u003e\n\u003cp\u003eHe said, \"I agree.\"\u003c/p\u003e\n\u003cp\u003eBreckenridge and Lynn returned together to Cheyenne, where that evening Laszlo listened with a sullen mistrust to Lynn\u0027s description of coming events.\u003c/p\u003e\n\u003cp\u003eLaszlo said, \"While you were gone, Chief, I\u0027ve started putting five experimental models of humanoid structure through the testing procedures. Our men are on a twelve-hour day, with three shifts overlapping. If we\u0027ve got to arrange a conference, we\u0027re going to be crowded and red-taped out of everything. Work will come to a halt.\"\u003c/p\u003e\n\u003cp\u003eBreckenridge said, \"That will be only temporary. You will gain more than you lose.\"\u003c/p\u003e\n\u003cp\u003eLaszlo scowled. \"A bunch of astrophysicists and geochemists around won\u0027t help a damn toward robotics.\"\u003c/p\u003e\n\u003cp\u003e\"Views from specialists of other fields may be helpful.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure? How do we know that there is any way of detecting brain waves or that, even if we can, there is a way of differentiating human and humanoid by wave pattern? Who set up the project, anyway?\"\u003c/p\u003e\n\u003cp\u003e\"I did,\" said Breckenridge.\u003c/p\u003e\n\u003cp\u003e\"You did? Are you a robotics man?\"\u003c/p\u003e\n\u003cp\u003eThe young Security agent said calmly, \"I have studied robotics.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not the same thing.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve had access to text material dealing with Russian robotics-in Russian. Top-secret material well in advance of anything you have here.\"\u003c/p\u003e\n\u003cp\u003eLynn said ruefully, \"He has us there, Laszlo.\"\u003c/p\u003e\n\u003cp\u003e\"It was on the basis of that material,\" Breckenridge went on, \"that I suggested this particular line of investigation. It is reasonably certain that in copying off the electromagnetic pattern of a specific human mind into a specific positronic brain, a perfectly exact duplicate cannot be made. For one thing, the most complicated positronic brain small enough to fit into a human-sized skull is hundreds of times less complex than the human brain. It can\u0027t pick up all the overtones, therefore, and there must be some way to take advantage of that fact.\"\u003c/p\u003e\n\u003cp\u003eLaszlo looked impressed despite himself and Lynn smiled grimly. It was easy to resent Breckenridge and the coming intrusion of several hundred scientists of nonrobotics specialties, but the problem itself was an intriguing one. There was that consolation, at least.\u003c/p\u003e\n\u003cp\u003eIt came to him quietly. Lynn found he had nothing to do but sit in his office alone, with an executive position that had grown merely titular. Perhaps that helped. It gave him time to think, to picture the creative scientists of half the world converging on Cheyenne.\u003c/p\u003e\n\u003cp\u003eIt was Breckenridge who, with cool efficiency, was handling the details of preparation. There had been a kind of confidence in the way he said, \"Let\u0027s get together and we\u0027ll lick Them.\"\u003c/p\u003e\n\u003cp\u003eLet\u0027s get together. It came to Lynn so quietly that anyone watching Lynn at that moment might have seen his eyes blink slowly twice-but surely nothing more.\u003c/p\u003e\n\u003cp\u003eHe did what he had to do with a whirling detachment that kept him calm when he felt that, by all rights, he ought to be going mad.\u003c/p\u003e\n\u003cp\u003eHe sought out Breckenridge in the other\u0027s improvised quarters. Breckenridge was alone and frowning. \"Is anything wrong, sir?\"\u003c/p\u003e\n\u003cp\u003eLynn said wearily, \"Everything\u0027s right, I think. I\u0027ve invoked martial-law.\"\u003c/p\u003e\n\u003cp\u003e\"What!\"\u003c/p\u003e\n\u003cp\u003e\"As chief of a division I can do so if I am of the opinion the situation warrants it. Over my division I can then be dictator. Chalk up one for the beauties of decentralization.\"\u003c/p\u003e\n\u003cp\u003e\"You will rescind that order immediately.\" Breckenridge took a step forward. \"When Washington hears this, you will be ruined.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m ruined anyway. Do you think I don\u0027t realize that I\u0027ve been set up for the role of the greatest villain in American history: the man who let Them break the stalemate? I have nothing to lose-and perhaps a great deal to gain.\"\u003c/p\u003e\n\u003cp\u003eHe laughed a little wildly. \"What a target the Division of Robotics will be, eh, Breckenridge? Only a few thousand men to be killed by a TC bomb capable of wiping out three hundred square miles in one micro-second. But five hundred of those men would be our greatest scientists. We would be in the peculiar position of having to fight a war with our brains shot out, or surrendering. I think we\u0027d surrender.\"\u003c/p\u003e\n\u003cp\u003e\"But this is impossible. Lynn, do you hear me? Do you understand? How could the humanoids pass our security provisions? How could they get together?\"\u003c/p\u003e\n\u003cp\u003e\"But they are getting together! We\u0027re helping them to do so. We\u0027re ordering them to do so. Our scientists visit the other side, Breckenridge. They visit Them regularly. You made a point of how strange it was that no one in robotics did. Well, ten of those scientists are still there and in their place, ten humanoids are converging on Cheyenne.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a ridiculous guess.\"\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s a good one, Breckenridge. But it wouldn\u0027t work unless we knew humanoids were in America so that we would call the conference in the first place. Quite a coincidence that you brought the news of the humanoids and suggested the conference and suggested the agenda and are running the show and know exactly which scientists were invited. Did you make sure the right ten were included?\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Lynn!\" cried Breckenridge in outrage. He poised to rush forward.\u003c/p\u003e\n\u003cp\u003eLynn said, \"Don\u0027t move. I\u0027ve got a blaster here. Well just wait for the scientists to get here one by one. One by one we\u0027ll X-ray them. One by one, we\u0027ll monitor them for radioactivity. No two will get together without being checked, and if all five hundred are clear, I\u0027ll give you my blaster and surrender to you. Only I think we\u0027ll find the ten humanoids. Sit down, Breckenridge.\"\u003c/p\u003e\n\u003cp\u003eThey both sat. Lynn said, \"We wait. When I\u0027m tired, Laszlo will spell me. We wait.\"\u003c/p\u003e\n\u003cp\u003eProfessor Manuelo Jiminez of the Institute of Higher Studies of Buenos Aires exploded while the stratospheric jet on which he traveled was three miles above the Amazon Valley. It was a simple chemical explosion but it was enough to destroy the plane.\u003c/p\u003e\n\u003cp\u003eDr. Herman Liebowitz of M.I.T. exploded in a monorail, killing twenty people and injuring a hundred others.\u003c/p\u003e\n\u003cp\u003eIn similar manner, Dr. Auguste Marin of L \u0027Institut Nucleonique of Montreal and seven others died at various stages of their journey to Cheyenne.\u003c/p\u003e\n\u003cp\u003eLaszlo hurtled in, pale-faced and stammering, with the first news of it. It had only been two hours that Lynn had sat there, facing Breckenridge, blaster in hand.\u003c/p\u003e\n\u003cp\u003eLaszlo said, \"I thought you were nuts, Chief, but you were right. They were humanoids. They had to be.\" He turned to stare with hate-filled eyes at Breckenridge. \"Only they were warned. He warned them, and now there won\u0027t be one left intact. Not one to study.\"\u003c/p\u003e\n\u003cp\u003e\"God!\" cried Lynn and in a frenzy of haste thrust his blaster out toward Breckenridge and fired. The Security man\u0027s neck vanished; the torso fell; the head dropped, thudded against the floor and rolled crookedly.\u003c/p\u003e\n\u003cp\u003eLynn moaned, \"I didn\u0027t understand, I thought he was a traitor. Nothing more.\"\u003c/p\u003e\n\u003cp\u003eAnd Laszlo stood immobile, mouth open, for the moment incapable of speech.\u003c/p\u003e\n\u003cp\u003eLynn said wildly, \"Sure, he warned them. But how could he do so while sitting in that chair unless he were equipped with built-in radio transmission? Don\u0027t you see it? Breckenridge had been in Moscow. The real Breckenridge is still there. Oh my God, there were eleven of them.\"\u003c/p\u003e\n\u003cp\u003eLaszlo managed a hoarse squeak. \"Why didn\u0027t he explode?\"\u003c/p\u003e\n\u003cp\u003e\"He was hanging on, I suppose, to make sure the others had received his message and were safely destroyed. Lord, Lord, when you brought the news and I realized the truth, I couldn\u0027t shoot fast enough. God knows by how few seconds I may have beaten him to it.\"\u003c/p\u003e\n\u003cp\u003eLaszlo said shakily, \"At least, we\u0027ll have one to study.\" He bent and put his fingers on the sticky fluid trickling out of the mangled remains at the neck end of the headless body.\u003c/p\u003e\n\u003cp\u003eNot blood, but high-grade machine oil. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-complete-robot-robot-0-3/page-14.html","bookId":1740,"creation":"Oct 5, 2019 10:15:34 AM","modification":"Oct 5, 2019 10:15:34 AM"}
