{"id":67670,"no":14,"title":"Page 14","content":"\u003cp\u003e\"Right on, Skipper. Bring it forward three feet and lock it while you lift the rear hinge section into place.\"\u003c/p\u003e\n\u003cp\u003eThe grapple moved as though it were a part of his body. He twisted his left grip to lock the end section, eased the next element of the grapple arm into alignment.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"Perfect. Now, can you lift the whole arm about an inch? You\u0027re a little close to that broken hinge.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t see the end of the grapple and the next element at the same time, Les. I\u0027d better watch the element.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Fine it down and bring the grapple end up a quarter of an inch at a time.\"\u003c/p\u003e\n\u003cp\u003eSparrow grunted as he made the first lift.\u003c/p\u003e\n\u003cp\u003e\"That was a half inch, Skipper. One more exactly like it.\"\u003c/p\u003e\n\u003cp\u003eAgain Sparrow grunted as he moved the grip.\u003c/p\u003e\n\u003cp\u003e\"A hair over, Skipper, but you still have clearance.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want me to fine it down?\"\u003c/p\u003e\n\u003cp\u003e\"No. Let it stand there. Now bring the grapple end past the hinge. One straight push about three feet.\"\u003c/p\u003e\n\u003cp\u003eSparrow twisted his head to get a view of the grapple in the mirrors. It looked as though it would smash directly into the broken hinge. Poor angle of view, he thought. How\u0027d a piece of bad planning like that get by? He lifted his right hand grip. The grapple surged forward, stopped.\u003c/p\u003e\n\u003cp\u003e\"Hold it right there a second, Skipper.\"\u003c/p\u003e\n\u003cp\u003eSparrow heard mumbling over the phones.\u003c/p\u003e\n\u003cp\u003eBonnett\u0027s voice returned: \"You\u0027ll have to get three elements of the grapple arm past that break before you can drop the tip. Better align the next element.\"\u003c/p\u003e\n\u003cp\u003eSparrow brought up the next hinged section, straightened it. \"How\u0027s the alignment?\"\u003c/p\u003e\n\u003cp\u003e\"Right on. Bring it forward.\"\u003c/p\u003e\n\u003cp\u003eHe complied, his hands moving the controls with increased sureness. The next element came up, was aligned, sent forward.\u003c/p\u003e\n\u003cp\u003e\"Another foot forward, Skipper.\"\u003c/p\u003e\n\u003cp\u003eHe moved the grapple arm.\u003c/p\u003e\n\u003cp\u003e\"Now comes the ticklish part. Drop the end at number-three joint. Take it down slowly and stop when I tell you.\"\u003c/p\u003e\n\u003cp\u003eSparrow bent the end elements downward. He thought that it was almost as though he could feel the moving part as he could feel his own arm. He sensed the position and stopped it while Bonnett was forming the order on his lips. The grapple end now was out of sight below the control base. It would take four adjustments of the mirrors to bring it back into view.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re about ten inches above the main drive bar. To reach it, you\u0027ll have to angle down with that section spanning the broken hinge.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t dare jar that hinge,\" said Sparrow. \"There\u0027s a lot of leverage that far up. I could break it right off.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve used the calipers on the screen,\" said Bonnett. \"You\u0027ll have about an inch to spare.\"\u003c/p\u003e\n\u003cp\u003eSparrow felt the fatigue in his wrists and forearms, whispered, \"Just a little longer, Lord, We\u0027re making it.\"\u003c/p\u003e\n\u003cp\u003e\"You ready?\" asked Bonnett.\u003c/p\u003e\n\u003cp\u003e\"Yes. Talk me down.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Take the tip toward you about four niches.\"\u003c/p\u003e\n\u003cp\u003eSparrow moved the grapple.\u003c/p\u003e\n\u003cp\u003e\"Now down six inches.\"\u003c/p\u003e\n\u003cp\u003eSparrow eased the tip downward, felt the sureness of his control, said, \"How\u0027s the lateral alignment?\"\u003c/p\u003e\n\u003cp\u003e\"Half inch to the right.\"\u003c/p\u003e\n\u003cp\u003eHe shifted the descent angle, continued down with the tip. \"How\u0027s the upper clearance?\"\u003c/p\u003e\n\u003cp\u003e\"You still have two niches.\"\u003c/p\u003e\n\u003cp\u003eHe felt the grapple jaws touch the drive bar, lowered them onto it, gripped the bar.\u003c/p\u003e\n\u003cp\u003e\"Skipper, you couldn\u0027t have done that better if you\u0027d had your own hand out there.\"\u003c/p\u003e\n\u003cp\u003eSparrow locked the grapple into position, brought up secondary grapples to brace it. He slid backward down the tunnel until he could reach the manual controls at number-two position, reached up with a short grapple and clamped it onto the broken unit. The control shivered.\u003c/p\u003e\n\u003cp\u003e\"Lordy,\" said Bonnett. \"It would\u0027ve gone right over without the bracing on that drive bar.\"\u003c/p\u003e\n\u003cp\u003eSparrow swung an extension torch into place above the broken hinge, locked it into position, lifted the broken end until the sheared sections touched. He started the torch.\u003c/p\u003e\n\u003cp\u003e\"Fuse it solid at the hinge. Only thing I can do now. There\u0027s enough play in the other elements to almost compensate for the lost mobility. We\u0027ll be able to cover more than eighty percent of this pile face. The manuals will cover the rest.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027re you going to do, Skipper?\"\u003c/p\u003e\n\u003cp\u003e\"What about the base?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to knock the sheared bolts right on through into the catch basin.\" He lowered the torch, playing its flame onto the sheared hinge. At the molten moment, he cut the torch, crushed the broken elements together. The repair formed a wedge-shaped cup. He sprayed the inside with brazing flux, brought up the brazing rod, and filled the cup.\u003c/p\u003e\n\u003cp\u003e\"That looks like it\u0027ll hold,\" said Bonnett, \"I\u0027ve been examining the base. It doesn\u0027t appear to be warped, but it\u0027s out of alignment. You\u0027ll need a spreader jack at the aft end.\"\u003c/p\u003e\n\u003cp\u003e\"Right. What\u0027s the inclination?\"\u003c/p\u003e\n\u003cp\u003e\"About one degree. Put the replacement bolts along the inside face first. They\u0027ll hold it while you drop the drive bar.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve a better idea,\" said Sparrow. \"Watch closely and tell me if anything starts to go wrong.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027re you going to do?\"\u003c/p\u003e\n\u003cp\u003e\"Drop the bolts into place along the inner face, then throw a little torque into the drive bar. The thrust against the grapple will push the base back into position.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s risky.\"\u003c/p\u003e\n\u003cp\u003e\"No worse than thrusting a jack against the base of the pile to horse that thing into position. This way we don\u0027t touch the pile.\"\u003c/p\u003e\n\u003cp\u003eSparrow continued to speak as he worked. \"Rule one of pileroom repair should be: Don\u0027t touch the reactor unless you absolutely have to.\"\u003c/p\u003e\n\u003cp\u003e\"You have nine minutes, Skipper,\" said Bonnett. \"You should be on your way out in five minutes.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s another reason for doing it my way,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003e\"Couldn\u0027t Joe finish it?\"\u003c/p\u003e\n\u003cp\u003e\"Only if he has to. Best not to have two of us on the cooling-off list.\"\u003c/p\u003e\n\u003cp\u003eHe touched the drive-bar switch. The control base rocked against its grapple braces. Metal protested. Two of the bolts dropped into position. Sparrow slipped nuts onto them, drove them tight with a motor wrench. Again he rocked the base with the drive bar. The remaining bolts slipped home.\u003c/p\u003e\n\u003cp\u003eSparrow\u0027s fingers flew over the manual controls as he completed the job. He disengaged the grapples, swung the repaired control arm out of the way, clamped it.\u003c/p\u003e\n\u003cp\u003e\"Two minutes, Skipper. On your way, right now!\" Sparrow released the last temporary brace, dropped it, slid backward down the tunnel, closed and dogged the door at the bulkhead limit. His helmet light was a pale flame after the blue glare of the tunnel end. He crawled backward, heard Garcia undog the door behind him, felt the other man\u0027s suited hands on his legs helping him the last few feet.\u003c/p\u003e\n\u003cp\u003eBonnett\u0027s voice came over the phones: \"You went about a minute over. Get down to the sick bay and take your shots.\"\u003c/p\u003e\n\u003cp\u003eSparrow grinned: It was good for Les to give orders, eased his tensions.\u003c/p\u003e\n\u003cp\u003e\"On the double, Skipper,\" said Bonnett. \"Every second\u0027s delay means that much more time cooling off for you.\"\u003c/p\u003e\n\u003cp\u003eSparrow fought down a feeling of irritation. Under Rule Ninety, Bonnett was technically in command when his superior officer had taken an overdose of radiation. But one minute!\u003c/p\u003e\n\u003cp\u003eGarcia ran a snooper over him, working silently, gesturing for Sparrow to turn. The engineering officer straightened, racked the snooper. \"Into that decon chamber.\" He unhooked Sparrow\u0027s hose from the tunnel system, closed the door and dogged it.\u003c/p\u003e\n\u003cp\u003eSparrow climbed into the decontamination chamber, felt the surge of foaming detergent around him.\u003c/p\u003e\n\u003cp\u003e\"Joe, what\u0027s the delay?\" Bonnett again.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s in decon now, Les. Thirty seconds more.\"\u003c/p\u003e\n\u003cp\u003e\"Cut it short, Joe. Ramsey is on his way down with the needles to give him his shots there. It\u0027ll save a couple of minutes.\"\u003c/p\u003e\n\u003cp\u003eRamsey came out on the catwalk above them, carrying a radiation-first-aid kit under his arm. He dropped down to their level, helped Garcia break the seal on his suit.\u003c/p\u003e\n\u003cp\u003eSparrow came out of the chamber without his suit, frowned at the kit in Ramsey\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"Bend over, Skipper,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003eSparrow obeyed, dropped his trousers, winced at the needle. \"Just don\u0027t enjoy yourself, Johnny,\" he said.\u003c/p\u003e\n\u003cp\u003eRamsey extracted the needle, wiped the bare skin with disinfectant. \"That does it and I hope you never have to do the same for me.\"\u003c/p\u003e\n\u003cp\u003eThe lifting of tension about Sparrow was an almost physical thing.\u003c/p\u003e\n\u003cp\u003eRamsey replaced the hypodermic in the kit, sealed it.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003eGarcia hung his ABG suit in its locker, followed them up the ladder.\u003c/p\u003e\n\u003cp\u003eRamsey thought: What\u0027s on the telemeter? Lord, I thought he\u0027d never come out of that tunnel.\u003c/p\u003e\n\u003cp\u003eThey stepped out onto the center catwalk, headed for the control room. Abruptly, the giant motors around them fell silent. Sparrow broke into a run, ducked through into the control room. Ramsey sprinted after him, went through the door on Sparrow\u0027s heels.\u003c/p\u003e\n\u003cp\u003eBonnett stood at the search board, one hand on the drive controls. His eyes were on the oscilloscope of\u003c/p\u003e\n\u003cp\u003ethe limit sono-finder. He spoke without turning: \"Signal. At extreme range. We\u0027ve lost it.\"\u003c/p\u003e\n\u003cp\u003e\"By now they must have a rough idea of our course,\" said Sparrow. \"They\u0027re quartering the area. What\u0027s the depth?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re over the sub-arctic shallows,\" said Bonnett. \"Bottom\u0027s about 350 fathoms.\"\u003c/p\u003e\n\u003cp\u003e\"Too shallow for us to lie doggo,\" said Sparrow. \"They would range too close for --\"\u003c/p\u003e\n\u003cp\u003e\"There it is again,\" said Bonnett. He nodded toward the scope, adjusted two flanking dials. \"Northeast. A pack by the noise. Damn! Lost them again. That\u0027s probably a school of fish between us.\"\u003c/p\u003e\n\u003cp\u003e\"Head for the Norway basin,\" said Sparrow. \"We need deep water.\" He glanced at the sonoran chart. \"Course nine degrees.\"\u003c/p\u003e\n\u003cp\u003eBonnett engaged the drive, swung the helm to the left until they were on the new course.\u003c/p\u003e\n\u003cp\u003eSparrow stepped to his nav-plot board, bent over it, figuring. Presently, he straightened. \"Estimating time of arrival two hours and six minutes.\" He turned. \"Johnny, stay with search here. We\u0027ve the range on them, but not so much that we can afford to get careless.\"\u003c/p\u003e\n\u003cp\u003eRamsey moved to the search board. Garcia stepped through the door from the engine room. \"The real danger is an EP that lies doggo until we\u0027re in range,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a big ocean,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003e\"And a small world,\" said Garcia.\u003c/p\u003e\n\u003cp\u003eSparrow looked at the radiation kit which Ramsey had placed on one of the control-board stools. He glanced at his wrist watch. \"Does someone have a timer set for my next shots?\"\u003c/p\u003e\n\u003cp\u003e\"I have,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Get what rest you can, Skipper,\" said Bonnett. \"I\u0027ll have a look at you as soon as we find a sitting spot.\"\u003c/p\u003e\n\u003cp\u003e\"I can do it,\" said Garcia.\u003c/p\u003e\n\u003cp\u003eBonnet nodded. \"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Timer\u0027s in the kit,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003eGarcia picked up the sealed box, gestured for Sparrow to precede him aft.\u003c/p\u003e\n\u003cp\u003eThey\u0027re worried about me, thought Sparrow. But one minute over isn\u0027t that important.\u003c/p\u003e\n\u003cp\u003eRamsey noted the proprietary attitude of Garcia and Bonnett toward Sparrow, realized abruptly that he shared it. He\u0027s our skipper, he thought.\u003c/p\u003e\n\u003cp\u003eSparrow and Garcia went aft.\u003c/p\u003e\n\u003cp\u003eThe Ram crept onward.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little deeper,\" said Ramsey. \"We\u0027re over the hump.\"\u003c/p\u003e\n\u003cp\u003e\"Sill depth across here runs 400 to 600 fathoms,\" said Bonnett. \"When we reach 600 we\u0027ll be close to the basin slope.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dragon-in-the-sea/page-14.html","bookId":2676,"creation":"Oct 5, 2019 10:05:59 AM","modification":"Oct 5, 2019 10:05:59 AM"}
