{"id":67678,"no":22,"title":"Page 22","content":"\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I could probably figure out a substitute system to eliminate the L-4s,\" said Garcia, \"but you\u0027re the electronics expert. How?\"\u003c/p\u003e\n\u003cp\u003e\"Schematic on shack workbench,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Les, check that,\" ordered Sparrow. \"If it\u0027s true, it\u0027s one more item to confirm his story.\"\u003c/p\u003e\n\u003cp\u003eBonnett went out the door.\u003c/p\u003e\n\u003cp\u003eRamsey shut his eyes, tried to slide off the pillows and stretch out flat on the cot.\u003c/p\u003e\n\u003cp\u003e\"Better not,\" said Sparrow. He held Ramsey upright. \"Joe, steady him here a moment while I look at that nose.\"\u003c/p\u003e\n\u003cp\u003eGarcia held Ramsey\u0027s shoulders.\u003c/p\u003e\n\u003cp\u003eSparrow touched Ramsey\u0027s nose gently.\u003c/p\u003e\n\u003cp\u003e\"Ouch!\" Ramsey jerked back.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t appear to be broken,\" said Sparrow. He reached out, put a thumb on Ramsey\u0027s left eyelid, held up the lid while he flashed a hand light into the eye. \"Maybe a slight concussion.\"\u003c/p\u003e\n\u003cp\u003e\"How long was I out?\" asked Ramsey.\u003c/p\u003e\n\u003cp\u003e\"About an hour,\" said Sparrow. \"You --\"\u003c/p\u003e\n\u003cp\u003eBonnett entered carrying a grease-stained sheet of note paper. He passed the paper to Garcia, who removed one hand from Ramsey\u0027s shoulder to take the paper.\u003c/p\u003e\n\u003cp\u003e\"What do you say, Joe?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003eGarcia studied the paper silently, nodded once, passed it to Sparrow. \"A clever adaptation. Simple. It\u0027ll work and it uses a tube with a different plate frequency.\"\u003c/p\u003e\n\u003cp\u003e\"What does this mean?\" asked Bonnett.\u003c/p\u003e\n\u003cp\u003e\"It means you batted out, old chap,\" said Garcia. \"In the vernacular, you goofed.\"\u003c/p\u003e\n\u003cp\u003eBonnett\u0027s voice was dangerously low. \"Is that so?\"\u003c/p\u003e\n\u003cp\u003e\"As a matter of honest fact, we\u0027ve all goofed,\" said Garcia. \"You were the overt instrument of our dereliction.\"\u003c/p\u003e\n\u003cp\u003eBonnett looked down at Ramsey. \"If I made a mistake, I apologize.\" He glanced at Sparrow, who was still studying Ramsey\u0027s schematic diagram. \"But I reserve the right to my own opinion.\"\u003c/p\u003e\n\u003cp\u003eSparrow straightened from beside Ramsey\u0027s bunk, looked at Garcia. \"Keep him awake for a couple of hours, Joe.\" He turned away. \"Come along, Les. We\u0027ve a slug to fill and some tube-jockeying. No time to waste.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want me to do the electronics work?\" asked Garcia.\u003c/p\u003e\n\u003cp\u003e\"You stick with him,\" said Sparrow. He pushed in the doorway, stared speculatively at Ramsey, turned and left, followed by Bonnett.\u003c/p\u003e\n\u003cp\u003e\"Do you think they could break down those L-4s without piping through the peri-box?\" asked Garcia.\u003c/p\u003e\n\u003cp\u003e\"In time,\" said Ramsey. \"But they\u0027d have to increase signal strength by several factors to get a return signal unamplified unless our box were on the surface.\"\u003c/p\u003e\n\u003cp\u003e\"Clever devils,\" muttered Garcia. \"How\u0027d you spot it?\"\u003c/p\u003e\n\u003cp\u003e\"Skipper gave me the idea with his scheme for faking the sound of our screw.\"\u003c/p\u003e\n\u003cp\u003e\"Got you thinking about resonance,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"About building signals with harmonics,\" corrected Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Same thing.\" Garcia came around in front of Ramsey. \"Boy, he really worked you over.\"\u003c/p\u003e\n\u003cp\u003e\"I guess he did.\"\u003c/p\u003e\n\u003cp\u003e\"Your own fault, though.\"\u003c/p\u003e\n\u003cp\u003eRamsey jerked his head up to stare at Garcia, winced at the sudden motion. \"Why do you say that?\"\u003c/p\u003e\n\u003cp\u003e\"For some reason, you\u0027ve deliberately set out to make the skipper suspicious of you. But you forgot one thing: suspicion is contagious.\"\u003c/p\u003e\n\u003cp\u003e\"The pressure\u0027s cooking your brains,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"I wish I knew what you were trying to prove,\" said Garcia. \"Maybe you\u0027re trying to beach the skipper.\"\u003c/p\u003e\n\u003cp\u003e\"Nuts! You have too much imagination.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re alike there, Johnny. And time drags in a sub-tug. There\u0027s time for a good imagination to run wild.\" He stared at the bulkhead a moment. \"That\u0027s the skipper\u0027s problem, too, really.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a rare piece of insight,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003eGarcia acted as though he had not heard. \"Imagination is a weakness when too much responsibility hangs on your shoulders.\"\u003c/p\u003e\n\u003cp\u003eThey felt the Ram move, stop.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re seating the pump onto that well cap,\" said Garcia. \"It\u0027ll take us a couple of days to fill the slug, then home we go.\"\u003c/p\u003e\n\u003cp\u003e\"If it were only that easy,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003eGarcia turned, strode across to the rec-room bookshelf, found a book, searched in it for a moment, and brought it back to Ramsey. \"I think you\u0027d better read this, Johnny. It\u0027s Savvy Sparrow\u0027s favorite passage.\"\u003c/p\u003e\n\u003cp\u003eHe handed Ramsey a Bible, pointing to the beginning of a chapter, said, \"Isaiah, twenty-seven, one and two.\"\u003c/p\u003e\n\u003cp\u003eRamsey read it through silently, then reread it aloud:\u003c/p\u003e\n\u003cp\u003e\"\u0027In that day the Lord with his sore and great and strong sword shall punish leviathan the piercing serpent, even leviathan that crooked serpent; and he shall slay the dragon that is in the sea.\u0027\"\u003c/p\u003e\n\u003cp\u003eGarcia continued the quotation from memory:\u003c/p\u003e\n\u003cp\u003e\"\u0027In that day sing ye unto her, A vineyard of red wine.\u0027\"\u003c/p\u003e\n\u003cp\u003eRamsey stared at the passage, shook his head. \"What\u0027s it mean to him?\"\u003c/p\u003e\n\u003cp\u003eGarcia said, \"And he shall slay the dragon that is in the sea.\" He reached down, took back the Bible. \"To Savvy Sparrow, we\u0027re the dragon in the sea.\"\u003c/p\u003e\n\u003cp\u003e\"Here, let me have that,\" said Ramsey. He took back the Bible. \"Think I\u0027ll read for a while.\"\u003c/p\u003e\n\u003cp\u003e\"Look out, or you\u0027ll get religion,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"No chance,\" said Ramsey. \"My teachers always said if you want to understand a subject, study the basic source. This is it for our captain.\"\u003c/p\u003e\n\u003cp\u003e\"For a great many people,\" said Garcia softly. \"And a psychologist who does not have an intimate knowledge of that book is a doctor without instruments. And blind, to boot.\"\u003c/p\u003e\n\u003cp\u003eRamsey looked at Garcia over the top of the book. \"When are you going to give up that line?\"\u003c/p\u003e\n\u003cp\u003e\"When you wake up,\" said Garcia.\u003c/p\u003e\n\u003cp\u003eRamsey hid a frown behind the Bible, opened it again to the passage Garcia had pointed out, soon lost himself in the fury of Isaiah and the woe of Hezekiah and the thundering messages of prophecy.\u003c/p\u003e\n\u003cp\u003eIn the cold Arctic waters outside the Ram, pumps turned, hose nozzles sought out bottom muck for ballast. The plastic slug began to swell with its cargo of oil -- like a live thing drinking at a jugular in the earth.\u003c/p\u003e\n\u003cp\u003eThe hands of the timelog swept around, around. Fifty-one hours at the well.\u003c/p\u003e\n\u003cp\u003eFull slug. It stretched out on the bottom behind the Ram, turgid with its cargo, now almost a mile long, held in delicate hydrostatic balance so that it would tow beneath the surface.\u003c/p\u003e\n\u003cp\u003eRamsey and Garcia entered the control room together. Sparrow and Bonnett already were there.\u003c/p\u003e\n\u003cp\u003eGarcia nodded at something Ramsey had said. \"You\u0027re right. We\u0027d better --\"\u003c/p\u003e\n\u003cp\u003e\"Right about what?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003e\"Johnny was just saying that the slug\u0027s compensator system would drop ballast if we try to pull that deep-dive maneuver on the way home.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right,\" said Sparrow. \"And if we don\u0027t compensate, we\u0027ll rupture the slug.\"\u003c/p\u003e\n\u003cp\u003e\"And bleed oil all over the surface,\" said Bonnett. \"Wouldn\u0027t that be lovely, now.\"\u003c/p\u003e\n\u003cp\u003e\"There might be a way to pull it off,\" said Sparrow. \"But let\u0027s hope we don\u0027t have to try it.\" He turned to the control board. \"Les, lift us off. Minimum headway. Take us right down into the gut. We\u0027re going to use it for cover as long as we\u0027re able.\"\u003c/p\u003e\n\u003cp\u003e\"Aye.\" Bonnett\u0027s hands moved over the controls.\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t they be likely to lay for us in a place like that?\" asked Ramsey.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re dead, remember?\" said Garcia.\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Joe, take over auxiliary search and keep us down the center of that canyon. Johnny, get on standard search and watch for enemy pips.\" He folded his arms in front of him. \"The Lord has been kind to us, gentlemen. We\u0027re going home.\"\u003c/p\u003e\n\u003cp\u003e\"A milk run,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"For mad dogs and Englishmen,\" said Bonnett.\u003c/p\u003e\n\u003cp\u003eThe Ram\u0027s deck tilted upward, hung there for a moment. Slowly, the slug lifted behind them, followed. They slanted down into the gut.\u003c/p\u003e\n\u003cp\u003e\"One degree right,\" said Garcia. \"Steady as she goes.\"\u003c/p\u003e\n\u003cp\u003e\"Steady as she goes,\" sang Bonnett.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s where we thank our lucky stars that the slug will track us in sections of hull length,\" said Ramsey. \"If we scrape the side wall --\"\u003c/p\u003e\n\u003cp\u003e\"Two degrees left,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"Two degrees left,\" acknowledged Bonnett.\u003c/p\u003e\n\u003cp\u003eSparrow glanced at Ramsey. \"You were saying.\"\u003c/p\u003e\n\u003cp\u003e\"I was just making talk.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s save the talk for rest camp,\" said Sparrow. He turned back to the board in front of Bonnett. \"We will take fatigue shots in three hours and at four-hour intervals until we\u0027ve cleared the Arctic Circle. Let me know immediately if any of you show a Larson reaction from them.\"\u003c/p\u003e\n\u003cp\u003eBonnett said, \"They tell me those shots lop the sleepless hours off your life expectancy. Wonder if there\u0027s anything in that?\"\u003c/p\u003e\n\u003cp\u003e\"I once heard the moon was made of green cheese,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"Shall we pay attention to business, gentlemen?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003eRamsey smiled. He could sense the increased vital drive in the crew like a strong outpouring of elation. He rubbed at the sore spot on his jaw where Bonnett had hit him, thought: It came at me from an unexpected angle, but Catharsis Number One has come and gone. AND I\u0027m still alive. And Sparrow\u0027s still functioning.\u003c/p\u003e\n\u003cp\u003eThe captain cleared his throat. \"As soon as we\u0027ve cleared the Norwegian basin we should be out of immediate danger. Their search packs should be ranging the Iceland passage now and they won\u0027t be expecting someone from behind them. Our chief worry is picket tugs, line replacements moving up: the chance passerby,\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve decided I\u0027m going to die of old age,\" said Garcia. \"That\u0027s my chief worry.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re getting old before your time,\" said Bonnett.\u003c/p\u003e\n\u003cp\u003e\"One degree left,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"One degree left,\" acknowledged Bonnett.\u003c/p\u003e\n\u003cp\u003eDeep in the underwater canyon, the Ram coursed generally westward. At the sill of the Norwegian basin, they lost the gut as it shoaled, crept along the basin rim, course 276 degrees. The bottom depth crept upward. They were in 200 fathoms when they swung south to parallel the Norwegian coast line, course 201 degrees.\u003c/p\u003e\n\u003cp\u003eEighty-one hours, fifty-eight minutes from the well, still two degrees above the Arctic Circle. Ramsey said, \"Signal!\" and slapped the switch which silenced their motors.\u003c/p\u003e\n\u003cp\u003eI\u0027m just getting them on the outer limits of the long-range system: say thirty-five miles.\"\u003c/p\u003e\n\u003cp\u003e\"Resume speed,\" said Sparrow. \"They have nothing that\u0027ll reach that far.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ll be off my board in a minute at present course,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Southeast, ranging westerly and maybe a bit south.\u003c/p\u003e\n\u003cp\u003e\"Well play it safe anyway,\" said Sparrow. \"Ten minutes run due east, then resume course.\"\u003c/p\u003e\n\u003cp\u003eGarcia at the helm, acknowledged. The Ram changed course.\u003c/p\u003e\n\u003cp\u003e\"Course, distance, and direction?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003e\"Lost them,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Resume course,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003eAgain they came around to parallel the Norwegian coast. South they went, and then west-southwest to gain greater distance from the shore stations along the southern reaches of Norway. And again bearing to the south, and again westerly to give the Faeroes a wide berth. Now they were at the edge of the deeps southeast of Iceland. Watch and stand by: Ramsey and Sparrow on the control deck. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dragon-in-the-sea/page-22.html","bookId":2676,"creation":"Oct 5, 2019 10:05:59 AM","modification":"Oct 5, 2019 10:05:59 AM"}
