{"id":67663,"no":7,"title":"Page 7","content":"\u003cp\u003e\"How do you know?\" asked Bonnett.\u003c/p\u003e\n\u003cp\u003eRamsey suddenly realized he had committed a tactical error. \"When I was with the gulf patrol,\" he said. \"This bird was our Security liaison.\"\u003c/p\u003e\n\u003cp\u003eThe lie came easily. He remembered the last time he had seen the man: Belland\u0027s outer office, Teacher Reed performing the introductions.\u003c/p\u003e\n\u003cp\u003e\"Do you know what he was doing here?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003eRamsey shook his head. \"I can guess. He was probably making a special check when somebody caught him.\"\u003c/p\u003e\n\u003cp\u003e\"Caught him at what?\" asked Garcia.\u003c/p\u003e\n\u003cp\u003eWith an abrupt intake of breath, Ramsey realized that Garcia was the suspected sleeper.\u003c/p\u003e\n\u003cp\u003e\"It was probably the other way around,\" said Bonnett. \"This Security officer caught somebody doing something and --\"\u003c/p\u003e\n\u003cp\u003e\"Doing what?\" barked Sparrow. He turned to a locker to the left of the tunnel. \"Joe, help me into an ABG suit.\" He opened the locker, pulled out a suit.\u003c/p\u003e\n\u003cp\u003eGarcia moved to help him.\u003c/p\u003e\n\u003cp\u003ePresently, Sparrow\u0027s voice came to them over the suit communicator: \"Les, get a contamination bag and lead box for this man\u0027s effects. Leave it at the hatch here. Joe, get into another suit to help me when I bring him out. Ramsey, monitor me and get a still record of the items I hold up for you. Get a repeater on my suit\u0027s radiation snooper. I may be too busy to watch it.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003eGarcia already was pulling on another suit. Bonnett was moving aft toward the door into machine stores.\u003c/p\u003e\n\u003cp\u003eSparrow ducked for the door, clambered clumsily into the tunnel. Immediately, the radiation-snooper repeater on Ramsey\u0027s board picked up the count.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hot in there,\" said Ramsey. \"I read it 5000 milli-R here.\"\u003c/p\u003e\n\u003cp\u003e\"I see it,\" said Sparrow. \"Tune to my helmet scanner.\"\u003c/p\u003e\n\u003cp\u003eRamsey tuned another screen on his board to the scanner on Sparrow\u0027s helmet. The screen showed a gloved hand: Sparrow\u0027s. The hand moved out of range and revealed a portion of the dead man\u0027s uniform.\u003c/p\u003e\n\u003cp\u003e\"Note,\" said Sparrow. \"He left a note. Get a voice record of this as I read it and then photograph it. It\u0027s dated April 16, time 0845.\"\u003c/p\u003e\n\u003cp\u003eOur embarkation day, thought Ramsey. At that time we were in the marine tunnel.\u003c/p\u003e\n\u003cp\u003eSparrow\u0027s voice continued: \"\u0027To Captain H. A. Sparrow from Lieutenant Arthur H. Foss, SYO-2204829. Subject: Extra Security inspection subtug Fenian Ram this date.\u0027\"\u003c/p\u003e\n\u003cp\u003eThe captain cleared his throat, continued: \"\u0027Pursuant to new Security policy, I was making a special investigation of your atomic components following the regular check by the pile crew. This was to be a quick tunnel crawl for a look at the end plate and manuals. I did not wear an ABG suit because of the anticipated short time of the check and to maintain secrecy.\u0027\"\u003c/p\u003e\n\u003cp\u003eGarcia had moved up to the tunnel mouth, hovering over it in his ABG suit like some other-world monster. \"You want me in there, Skipper?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Wait out there, Joe,\" said Sparrow. He went on reading: \"\u0027My snooper\u0027s switch was accidentally turned off as I crawled through the tunnel and I received no warning that it was hot.\u0027\" (Sparrow\u0027s voice quickened.) \"\u0027I found that one of your hafnium damper rods had been taken from the pile in the secondary bank and hidden in the tunnel. I was directly on top of it before I noticed it. There was no mistaking what it was. I turned on my snooper and immediately saw that I\u0027d had a lethal overdose.\u0027\"\u003c/p\u003e\n\u003cp\u003eSparrow paused. \"May the Lord be merciful to him,\" he said. He continued with the note: \"\u0027It was obvious that the damper rod had been selected for a timed overload, but the timing was not immediately apparent. It could have been set to blow at the base. Therefore, I made haste to slip the rod back onto the pile-room manuals and replaced it. I also repaired the alarm-system wiring where it had been cut to hide the sabotage.\u0027\"\u003c/p\u003e\n\u003cp\u003eSparrow stopped and Ramsey saw the note (through the scanner) change position as the Skipper shifted. \"Joe, did you notice any peculiar reaction from the alarm system?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003e\"Not a thing,\" said Garcia.\u003c/p\u003e\n\u003cp\u003eSparrow grunted, continued with the note: \"\u0027When the damper had been replaced, I looked for the communicator box at the pile end. It had been smashed. I then crawled back, thinking I\u0027d get the medics to ease my dying. The tunnel hatch had been dogged from the outside and I was trapped. I tried to attract attention by calling through the vent, but there was no response. My own portable communicator would not work inside the shielding of the reactor wall.\u0027\"\u003c/p\u003e\n\u003cp\u003eSparrow\u0027s voice stopped. \"That explains it,\" he said.\u003c/p\u003e\n\u003cp\u003eRamsey bent over his panel mike. \"Explains what?\"\u003c/p\u003e\n\u003cp\u003e\"This tunnel vent opens from the inside. It should\u0027ve been closed. But if it\u0027d been closed we wouldn\u0027t have noticed --\" He fell silent.\u003c/p\u003e\n\u003cp\u003eRamsey\u0027s thoughts went to the actions of that Security officer: alone in the tunnel with the certain knowledge he was dying and nothing could save him. Spending his last minutes to guard the safety of others.\u003c/p\u003e\n\u003cp\u003eWould I have been as brave? he wondered.\u003c/p\u003e\n\u003cp\u003eSparrow said, \"He put the knife in himself rather than go out the slow way alone in here. He says he doesn\u0027t know who sabotaged the pile and tripped him.\"\u003c/p\u003e\n\u003cp\u003e\"He could\u0027ve attracted somebody,\" said Ramsey. \"If he\u0027d shorted one of --\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027d have chanced shorting the wrong circuit and kicking every damper rod out onto the pile-room floor,\" said Garcia.\u003c/p\u003e\n\u003cp\u003e\"But the gravity catches --\"\u003c/p\u003e\n\u003cp\u003e\"How could he know what\u0027d been fouled up in there?\" demanded Garcia. His voice was choked with emotion. \"But suicide!\"\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Joe, who were the last dock crewmen aboard?\"\u003c/p\u003e\n\u003cp\u003e\"Two snoopers I let aboard. I believe you saw them leave.\"\u003c/p\u003e\n\u003cp\u003eRamsey thought: Garcia again. He leaned over the catwalk railing, called down to Garcia. \"Joe, who were --\" Then he remembered that Garcia\u0027s suit would damp out the sound and turned back to his mike: \"Joe, who were those men?\"\u003c/p\u003e\n\u003cp\u003eThe blank faceplate of Garcia\u0027s suit tipped upward toward Ramsey. \"Two new ones. Their names are on the gangway check list.\"\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Record this from the note, Ramsey.\" He read: \"\u0027Whoever sabotaged your pile was hoping it would blow while this subtug was in the marine tunnel. Such a blowup would eliminate the subtug base until a rerouted tunnel section could be built. Obviously, the enemy knows of the existence of this base. Security should be notified at once.\u0027\" The skipper\u0027s voice lowered. \"\u0027Please tell my wife that my last thoughts were of her,\u0027\"\u003c/p\u003e\n\u003cp\u003eGarcia said, \"Those dirty, evil --\" He choked.\u003c/p\u003e\n\u003cp\u003eSparrow held up the note for his suit scanner while Ramsey photographed it.\u003c/p\u003e\n\u003cp\u003e\"Is there anything else?\" asked Ramsey.\u003c/p\u003e\n\u003cp\u003e\"A notebook filled with what looks like Security code. Yes, here\u0027s a notation from Lieutenant Foss: \"See that Security Section Twenty-Two gets this notebook.\"\u003c/p\u003e\n\u003cp\u003eRamsey saw the book through Sparrow\u0027s suit scanner.\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Record the pages as I hold them up, Ramsey.\" He nipped through the pages for the scanner, said, \"I have the contents of his pockets. I\u0027m coming out.\" He backed out to the tunnel entrance.\u003c/p\u003e\n\u003cp\u003eBonnett returned from the rear storeroom dragging a bulky contamination bag and a small lead box. He looked up at Ramsey, said, \"I listened in on the storeroom portable while I was getting this stuff. Lord, how I\u0027d like to have my hands on the rats who scragged that poor guy!\"\u003c/p\u003e\n\u003cp\u003e\"You mean who almost scragged us,\" said Ramsey. He bent over his panel mike: \"Joe, you\u0027d better get that stuff from Les. He shouldn\u0027t go any closer to the tunnel without a suit.\"\u003c/p\u003e\n\u003cp\u003eGarcia\u0027s voice issued from the speaker: \"Righto.\" He went back to the engine-room floor to Bonnett, returned to the tunnel with the contamination bag and lead box.\u003c/p\u003e\n\u003cp\u003eSparrow emerged from the tunnel, turned, said, \"Ramsey, record these items as I put them in the box. One Mark XXVII hand-snooper, one wrist-type communicator, one flashlight, one wallet with the following items: a picture of woman and child inscribed \u0027All our Love, Nan and Peggy,\u0027 one ID card issued to Lieutenant Senior Grade Arthur Harmon Foss, SYO-2204829, one base gate pass, one mess-hall pass, one driver\u0027s license, currency and coins to sixteen dollars and twenty-four cents.\"\u003c/p\u003e\n\u003cp\u003eHe turned back to the tunnel, picked up another bundle tied in a handkerchief, untied the handkerchief clumsily with his heavily gloved hands. \"Here\u0027s some more: one fountain pen, one key ring with four keys, one fingernail clipper, one minicamera. The telltale\u0027s turned red: film\u0027s been ruined by radiation. One pocket recorder with wire blank.\"\u003c/p\u003e\n\u003cp\u003eSparrow dropped the bundle into the box. Garcia sealed it.\u003c/p\u003e\n\u003cp\u003eRamsey glanced at his wrist watch, noted the time. The telemeter record of Sparrow\u0027s reactions: what will it show for this period? he asked himself.\u003c/p\u003e\n\u003cp\u003eGarcia straightened from the lead box. \"What\u0027s the pile end like?\" he asked.\u003c/p\u003e\n\u003cp\u003eSparrow nodded his head toward the tunnel mouth, a grotesque gesture in the bulky suit. \"Just as he described it. Everything back as it should be. All except the communicator box. Smashed. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe whoever did it anticipated the inspection,\" said Garcia. \"Maybe.\"\u003c/p\u003e\n\u003cp\u003eRamsey\u0027s hands moved over his portable control panel, compensating for a minor course deflection caused by an upward current. When they were back on true, he looked over the railing. Garcia and Sparrow were just sealing the Security officer\u0027s body into the contamination bag.\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Les, when we get him out of here, flush this area out with the detergent hoses. Let me know what the radiation count is.\"\u003c/p\u003e\n\u003cp\u003eRamsey punched the switch on his panel mike: \"Skipper, that note could\u0027ve been faked to throw us off. Did you think of that? It strikes me the man would\u0027ve used his recorder.\"\u003c/p\u003e\n\u003cp\u003eGarcia said, \"And taken the chance of having his message accidentally erased? No sir.\" He dragged the sacked body under an engine-room hoist.\u003c/p\u003e\n\u003cp\u003eSparrow said, \"Les, when you get this place cleaned, get into a suit and make another inspection of the end plate and manuals of that tunnel. I\u0027m eight minutes from my limit.\"\u003c/p\u003e\n\u003cp\u003eBonnett acknowledged.\u003c/p\u003e\n\u003cp\u003eGarcia passed a snooper over the contamination bag. \"Hot,\" he said. \"We\u0027ll have to get him overboard within twelve hours. Otherwise, I wouldn\u0027t be responsible for the filters clearing our air.\" He racked the snooper, turned back, rigged a net under the bag.\u003c/p\u003e\n\u003cp\u003eMeanwhile, Bonnett had gone down the starboard side of the engine-room, donned an ABG suit from that side, and moved to the detergent hoses at the tunnel mouth.\u003c/p\u003e\n\u003cp\u003eGarcia took the slack out of the hoist line, turned toward Sparrow. \"Skipper, why don\u0027t you get Les to help you here and let me crawl the tunnel? That\u0027s my department.\"\u003c/p\u003e\n\u003cp\u003eThe faceplate on Sparrow\u0027s suit turned toward Bonnett, who hesitated beside the tunnel door. \"Okay, Joe. Les, give me a hand here.\"\u003c/p\u003e\n\u003cp\u003eBonnett stepped to Sparrow\u0027s side.\u003c/p\u003e\n\u003cp\u003eGarcia went to the tunnel door, turned back, and looked up at Ramsey. The quartz viewplate gave him the appearance of a one-eyed monster. He turned back to the tunnel, bending down as he snaked his way inside. Presently, his voice came over the speaker to Ramsey: \"You with me, Junior?\"\u003c/p\u003e\n\u003cp\u003e\"I read you.\"\u003c/p\u003e\n\u003cp\u003e\"My suit snooper says it\u0027s hotter than a two-dollar pistola where the shield curve ends here. I\u0027m at the halfway mark. Here\u0027s the tunnel communicator box. It\u0027s a mess.\" (Pause) \"I\u0027m now at the manuals.\" (Long pause.) \"The mirrors show no visible evidence of sabotage on this face of the pile. All secure. I\u0027m coming out.\"\u003c/p\u003e\n\u003cp\u003eIn Ramsey\u0027s mind a single thought: If Garcia\u0027s really a sleeper, what\u0027s he actually doing in there? Why was he so anxious to make that inspection?\u003c/p\u003e\n\u003cp\u003eRamsey wondered if he could think up an excuse to make a personal inspection of that tunnel.\u003c/p\u003e\n\u003cp\u003eProbably not, he thought. Sparrow wouldn\u0027t risk having three of his crewmen take a near-limit dosage. He\u0027d have no reserve if something else made it necessary to crawl one of the tunnels.\u003c/p\u003e\n\u003cp\u003eRamsey resolved to make as thorough an inspection as possible using the internal scanners.\u003c/p\u003e\n\u003cp\u003eSparrow and Bonnett were hoisting the contamination bag up to the discharge tubes below the retracted conning tower. Sparrow said, \"Ramsey, take your board back against the aft bulkhead. That bag\u0027s leaking some.\"\u003c/p\u003e\n\u003cp\u003eRamsey complied, racking his board on the catwalk rail.\u003c/p\u003e\n\u003cp\u003eSparrow left the hoist to Bonnett, stepped into the decontamination chamber against the port pressure hull, emerged without his ABG suit. He looked up to Ramsey, his long face drawn into serious lines. \"Is Joe on his way out?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s on his way,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Foss\u0027s ID card shows he was Catholic,\" said Sparrow. \"Ask Joe if he\u0027ll read the service for the dead.\"\u003c/p\u003e\n\u003cp\u003eRamsey relayed the request.\u003c/p\u003e\n\u003cp\u003eGarcia, emerging from the tunnel, paused. \"He couldn\u0027t have been Catholic,\" he said. \"Either that, or he was murdered. A good Catholic doesn\u0027t commit suicide.\"\u003c/p\u003e\n\u003cp\u003eSparrow heard Garcia\u0027s voice on the speaker, said, \"Suffering Jesus! He\u0027s right.\" He looked thoughtful for a moment, found his chest mike, asked, \"Will you read the service?\"\u003c/p\u003e\n\u003cp\u003eGarcia said, \"Under the circumstances, yes.\" He closed the tunnel door, dogged it, stepped into a decontamination chamber, and emerged without a suit.\u003c/p\u003e\n\u003cp\u003eBonnett swung up to the central catwalk, anchored the hoist\u0027s load with a side line, returned to the lower deck, and reeled out the detergent hoses. He began to spray the area.\u003c/p\u003e\n\u003cp\u003eSparrow and Garcia mounted to the catwalk beside Ramsey.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll surface at midnight local time for burial,\" said Sparrow. He went aft through the number-one door without glancing up at the bundle swinging from the hoist.\u003c/p\u003e\n\u003cp\u003eRamsey, watching Bonnett at work below him, again had the feeling of looking at a marionette show. Last act, scene one.\u003c/p\u003e\n\u003cp\u003eGarcia, beside him, said, \"My watch coming up. I\u0027ll take it on the main control deck.\" He released Ramsey\u0027s portable board from the rail, carried it up to the central catwalk, ducked through the door in the aft bulkhead.\u003c/p\u003e\n\u003cp\u003eRamsey followed, turned at the door for one last look at the long bundle swaying in the hoist net: a body in a sack. He turned, passed through the control room, went directly to his quarters and pulled out the telemeter tapes. No significant deviations!\u003c/p\u003e\n\u003cp\u003eHe coded the tapes for identification, placed them in the false bottom, lay back on his bunk. Around him he could feel the faint vibrations of the subtug: a feeling as of life. He seemed to fit into the pattern of the room, one with the crisscross of pipes overhead, the ventilator ducts, the repeaters for the electronics-shack instruments, wall mike and speaker.\u003c/p\u003e\n\u003cp\u003ePresently, he fell asleep, dreamed that he was a deep-dwelling fish trying to figure out a way to climb to the light of the surface far away above him.\u003c/p\u003e\n\u003cp\u003eThe problem was that a terrible pressure held him trapped in the deeps.\u003c/p\u003e\n\u003cp\u003eAt midnight they committed the body of Lieutenant Foss to the ocean. A cold, starless night, a high-running sea. Ramsey stood shivering on the deck while Garcia mumbled the service for the dead.\u003c/p\u003e\n\u003cp\u003e\"Into Thy hands we commend this spirit.\"\u003c/p\u003e\n\u003cp\u003eFor Lieutenant Arthur Harmon Foss; last act, last scene.\u003c/p\u003e\n\u003cp\u003eAfterward, they homed into the depths as though fleeing the scene of a crime. Ramsey was startled by the faraway look in Sparrow\u0027s eyes, heard the captain whispering the lines from the first chapter of Genesis:\u003c/p\u003e\n\u003cp\u003e\"\u0027. . . and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters. . . .\u0027\"\u003c/p\u003e\n\u003cp\u003eFrom some recess in his memory, Ramsey recalled the next lines: \"\u0027And God said, Let there be light: and there was light.\u0027\"\u003c/p\u003e\n\u003cp\u003eRamsey thought: If there is a God, let him make things right for that brave guy. It was his nearest approach to a prayer since childhood. He was surprised at the stinging sensation in his eyes.\u003c/p\u003e\n\u003cp\u003eThen another thought mingled with the memory of Garcia\u0027s voice: And what if Garcia is the sleeper?\u003c/p\u003e\n\u003cp\u003eThe thought spurred him to hurry into the electronics shack, examine the contaminated tunnel through the internal scanners. The scanners showed only the pile-room end. Nothing appeared amiss. Ramsey activated one of the control-room scanners to check on Garcia. The engineering officer was bent over the portside grab rail, knuckles white from the pressure of his grip upon the rail, his forehead pressed against the cold metal of the pressure hull.\u003c/p\u003e\n\u003cp\u003eHe looks ill, thought Ramsey. I wonder if I should go down and relieve him?\u003c/p\u003e\n\u003cp\u003eAs Ramsey watched, Garcia straightened, slammed a fist against the hull surface so hard his knuckles bled. The Ram took this moment to tip slightly from the thrust of an undersea current. Garcia whirled to the controls, corrected for the deflection. Ramsey could see tears streaming down his face.\u003c/p\u003e\n\u003cp\u003eAbruptly, Ramsey switched off his screen, feeling that he had eavesdropped upon the workings of a man\u0027s soul and that it was wrong to have done so. He stared at his hands, thought: Now that\u0027s a strange reaction for a psychologist! What\u0027s come over me? He reactivated the screen, but now Garcia was calmly going about the business of his watch.\u003c/p\u003e\n\u003cp\u003eRamsey returned to his quarters with the strong sense that he had blinded himself to something vital. For almost an hour, he lay awake on his bunk, unable to resolve the problem. When he fell asleep it was to sink again into the dream of the fish.\u003c/p\u003e\n\u003cp\u003eHe awoke to his next watch with the feeling of not having slept at all. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dragon-in-the-sea/page-7.html","bookId":2676,"creation":"Oct 5, 2019 10:05:59 AM","modification":"Oct 5, 2019 10:05:59 AM"}
