{"id":67664,"no":8,"title":"Page 8","content":"\u003cp\u003eThere had been a time when people thought it would solve most seafaring problems to take ocean shipping beneath the surface storms. But, as had happened so many times in the past, for every problem solved a new one was added.\u003c/p\u003e\n\u003cp\u003eBeneath the ocean surface flow great salt rivers, their currents not held to a horizontal plane by confining banks. The 600 feet of plastic barge trailing behind the Ram twisted, dragged, and skidded -- caught by currents flowing through 60 degrees at right angles to their course. If the current set downward the Ram tipped upward and had to fight against the climb. If a current took the tow upward, the Ram headed down. Variations often gave the subtug\u0027s deck a stately rolling and tipping as though the vessel was beset by a slow-motion storm.\u003c/p\u003e\n\u003cp\u003eAutomatics took care of most of the deflections, but many were sufficient to cause wide course error. Because of this, a portable gyro repeater always accompanied the man on duty.\u003c/p\u003e\n\u003cp\u003eBonnett carried such a repeater on his remote-control panel as he prowled the engine room during his watch. The little timelog repeater beside the gyro dial showed seven days, eight hours, and eighteen minutes from departure. The Ram had moved forward deep into the ocean no man\u0027s land south of Iceland.\u003c/p\u003e\n\u003cp\u003eMaybe it\u0027ll be a milk run, he thought. For all our detectors have shown, we could be alone in the whole damned ocean. He fell to remembering the night before departure, wondered if Helene was really faithful to him. So damned many Navy wives . . .\u003c/p\u003e\n\u003cp\u003eAn amber light glowed at the upper corner of his board, the signal that someone had entered the control room. He spoke into his chest mike: \"I\u0027m on the second-level catwalk in the engine room.\"\u003c/p\u003e\n\u003cp\u003eSparrow\u0027s voice came out of the board speaker: \"Continue as you are. I\u0027m just restless. Thought I\u0027d look around.\"\u003c/p\u003e\n\u003cp\u003e\"Right, Skipper.\" Bonnett turned to examine the master control gauges on the reactor bulkhead. Ever since they\u0027d found the dead Security officer, Bonnett had been nursing an uneasy feeling about the room in the subtug\u0027s nose.\u003c/p\u003e\n\u003cp\u003eA sudden needle deflection on his control board caught his attention. The outside water temperature had dropped ten degrees: a cold current.\u003c/p\u003e\n\u003cp\u003eRamsey\u0027s voice came over the intercom: \"This is Ramsey in the shack. My instruments show a sharp ten-degree temperature drop outside.\"\u003c/p\u003e\n\u003cp\u003eBonnett thumbed his mike switch: \"What\u0027re you doing up and about, Junior?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m always nervous when it\u0027s your duty,\" said Ramsey. \"I couldn\u0027t sleep, so I came in here to run an instrument check.\"\u003c/p\u003e\n\u003cp\u003e\"Wise guy,\" said Bonnett.\u003c/p\u003e\n\u003cp\u003eSparrow\u0027s voice joined them: \"Find out how deep it is, Ramsey. If it doesn\u0027t extend below our limit, we can hide under it and pick up speed. Ten degrees will cloud a lot of noise.\"\u003c/p\u003e\n\u003cp\u003e\"Right, Skipper.\" Pause. \"Sixty-eight hundred feet, give or take a few.\"\u003c/p\u003e\n\u003cp\u003e\"Les, take her down,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003eBonnett racked his control console onto the catwalk railing, took electronic hold of the diving planes. Abruptly, his static pressure-gauge repeater showed what his sense of balance already had told him: they were going down too fast; an upcurrent was following them, lifting the tow. Bonnett fought it until they were inclined at a safe three degrees.\u003c/p\u003e\n\u003cp\u003eThe Ram leveled at 6780 feet.\u003c/p\u003e\n\u003cp\u003eIn the shack, Ramsey looked at his own repeater for the master pressure gauge: 2922 pounds to the square inch. Instinctively, his gaze went to the pressure hull beside him -- a small length of it seen through a maze of pipes and conduits. He tried to fight away from the thought of what would happen if the hull should implode: bits of protein pulp floating amidst shattered machinery.\u003c/p\u003e\n\u003cp\u003eWhat was it Reed had said? It came back to Ramsey clearly, even to the impersonal tones of his instructor\u0027s voice: \"An implosion of external equipment at extreme depths may set up a shock wave which will split your hull wide open. Of course, it\u0027d be all over for you before you\u0027d hardly realized what happened.\"\u003c/p\u003e\n\u003cp\u003eRamsey shivered.\u003c/p\u003e\n\u003cp\u003eWhat is Sparrow\u0027s reaction to the increased danger? he wondered. Then: I don\u0027t really care as long as his ability keeps me safe.\u003c/p\u003e\n\u003cp\u003eThis thought shocked Ramsey. He suddenly looked around his electronics shack as though seeing it for the first time, as though he had just awakened.\u003c/p\u003e\n\u003cp\u003eWhat kind of a psychologist am I? What have I been doing?\u003c/p\u003e\n\u003cp\u003eAs though answering a question from outside himself his mind said: You\u0027ve been hiding from your own fears. You\u0027ve been striving to become an efficient cog in this crew because that way lies a measure of physical safety.\u003c/p\u003e\n\u003cp\u003eBack came the answer: You\u0027re afraid of your own personal extinction.\u003c/p\u003e\n\u003cp\u003e\"It\u0027d be as though I\u0027d died en utero,\" he said, speaking the thought softly to himself. \"Never born at all.\"\u003c/p\u003e\n\u003cp\u003eHe found that he was trembling, bathed in perspiration. The plug holes of the test board in front of him seemed to stare back -- a hundred demanding eyes. He suddenly wanted to scream, found he couldn\u0027t move his throat muscles.\u003c/p\u003e\n\u003cp\u003eIf there was an emergency now, I\u0027d be helpless, he thought. I couldn\u0027t move a finger.\u003c/p\u003e\n\u003cp\u003eHe tried to will the motion of the index finger of his right hand, failed.\u003c/p\u003e\n\u003cp\u003eIf I move I\u0027ll die!\u003c/p\u003e\n\u003cp\u003eSomething touched his shoulder and he almost blanked out in frozen panic. A voice spoke softly beside his ear and it was as though the voice had shouted loud enough to split his eardrums.\u003c/p\u003e\n\u003cp\u003e\"Ramsey. Steady boy.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a brave man, Ramsey. You took it longer than most.\"\u003c/p\u003e\n\u003cp\u003eRamsey felt the trembling of his body had become so violent that his vision blurred.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been waiting for this, Ramsey. Every man goes through it down here. Once you\u0027ve been through it, you\u0027re all right.\"\u003c/p\u003e\n\u003cp\u003eDeep, fatherly voice. Tender. Compassionate.\u003c/p\u003e\n\u003cp\u003eWith all his being, Ramsey wanted to turn, bury his head against that compassionate chest, sob out his fears in strangled emotion.\u003c/p\u003e\n\u003cp\u003e\"Let it go,\" said Sparrow. \"Let it come. Nobody here but me, and I\u0027ve been through it.\"\u003c/p\u003e\n\u003cp\u003eSlowly at first, then in gasping sobs, the tears came. He bent over the bench, buried his face in his arms. All the time, Sparrow\u0027s hand upon his shoulder, a feeling of warmth from it, a sense of strength.\u003c/p\u003e\n\u003cp\u003e\"I was afraid,\" whispered Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Show me the man who isn\u0027t afraid and ITI show you a blind man or a dolt,\" said Sparrow. \"We\u0027re plagued with too much thinking. It\u0027s the price of intelligence.\"\u003c/p\u003e\n\u003cp\u003eThe hand left Ramsey\u0027s shoulder. He heard the shack door open, close.\u003c/p\u003e\n\u003cp\u003eRamsey lifted his head, stared at the test board in front of him, the open intercom switch.\u003c/p\u003e\n\u003cp\u003eBonnett\u0027s voice came from the speaker: \"Ramsey, can you give us a sound-distance test now?\"\u003c/p\u003e\n\u003cp\u003eRamsey cleared his throat. \"Right.\" His hands moved over the board, slowly, then with rapid sureness. \"There\u0027s enough cold stuff above us to blanket force speed,\" he said.\u003c/p\u003e\n\u003cp\u003eThe speaker rumbled with Sparrow\u0027s voice. \"Les, give us force speed. Ramsey, we are within ninety pounds of pressure limit. Remain on watch with Les until you are relieved.\"\u003c/p\u003e\n\u003cp\u003eThe humming of the Ram\u0027s electric motors keened up a notch, another.\u003c/p\u003e\n\u003cp\u003e\"Right, Skipper,\" said Ramsey. Garcia\u0027s voice came over the intercom. \"What\u0027s up? I felt the motors.\"\u003c/p\u003e\n\u003cp\u003e\"Cold layer,\" said Sparrow. \"We\u0027re gaining a few knots while we can.\"\u003c/p\u003e\n\u003cp\u003e\"Need me?\"\u003c/p\u003e\n\u003cp\u003e\"Come up here on stand-by.\" Ramsey heard the voices over the intercom with a peculiar clarity, saw the board in front of him with a detail that amazed him: tiny scratches, a worn plug line.\u003c/p\u003e\n\u003cp\u003eBack came the memory of his blue funk and with it, a detail his mind had avoided: Sparrow calling to him over the intercom to make the sound-distance test.\u003c/p\u003e\n\u003cp\u003eAnd when I didn\u0027t answer, he came immediately to help me.\u003c/p\u003e\n\u003cp\u003eAnother thought intruded: He knows how green I am -- has known it all along.\u003c/p\u003e\n\u003cp\u003e\"Ramsey.\"\u003c/p\u003e\n\u003cp\u003eSparrow stood in the shack doorway.\u003c/p\u003e\n\u003cp\u003eRamsey stared at him.\u003c/p\u003e\n\u003cp\u003eSparrow entered, sat down on the bench stool beside the door. \"What are you, Ramsey?\"\u003c/p\u003e\n\u003cp\u003eHe cleared his throat. \"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Every man has to wrestle with his shadow down here. You held out a long time.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand you.\"\u003c/p\u003e\n\u003cp\u003e\"This life makes you face your fears sooner or later.\"\u003c/p\u003e\n\u003cp\u003e\"How did you know I was afraid?\"\u003c/p\u003e\n\u003cp\u003e\"Every man\u0027s afraid down here. It was just a matter of waiting until you found out you were afraid. Now, answer my question: What are you?\"\u003c/p\u003e\n\u003cp\u003eRamsey stared past Sparrow. \"Sir, I\u0027m an electronics officer.\"\u003c/p\u003e\n\u003cp\u003eA faint smile touched Sparrow\u0027s eyes and mouth. \"It\u0027s a sad world we live in, Ramsey. But at least Security picks its men for their courage.\" He straightened.\u003c/p\u003e\n\u003cp\u003eRamsey accepted this silently.\u003c/p\u003e\n\u003cp\u003e\"Now, let\u0027s have a look at that little box of yours,\" said Sparrow. \"I\u0027m curious.\" He stood up, went out into the companionway, turned aft.\u003c/p\u003e\n\u003cp\u003eRamsey followed.\u003c/p\u003e\n\u003cp\u003e\"Why not keep it in the shack?\" asked Sparrow.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been using my time off to check it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t wear yourself out.\" Sparrow dropped down to the lower level, Ramsey behind him. They entered Ramsey\u0027s room. The humming of the induction drive came through the bulkhead.\u003c/p\u003e\n\u003cp\u003eRamsey sat down on his bunk, brought out the box, put it on his desk, and unlocked it. Can\u0027t let him look too close, thought Ramsey. He noted that the disguise system was working.\u003c/p\u003e\n\u003cp\u003eSparrow peered into the box with a puzzled frown.\u003c/p\u003e\n\u003cp\u003eWhat\u0027s he expect to find? Ramsey wondered.\u003c/p\u003e\n\u003cp\u003e\"Give me a rundown,\" said Sparrow.\u003c/p\u003e\n\u003cp\u003eRamsey pointed to a dial. \"That monitors the sweep of the primary search impulse. The first models were plagued by feedback echo.\"\u003c/p\u003e\n\u003cp\u003eSparrow nodded.\u003c/p\u003e\n\u003cp\u003eRamsey indicated a group of signal lights. \"These separate the pulse frequencies. They flicker red when we\u0027re out of phase. The particular light tells me which circuit is bouncing.\"\u003c/p\u003e\n\u003cp\u003eSparrow straightened, shot a searching glance at Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Tapes inside make a permanent record,\" said Ramsey.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll go into it at greater length some other time,\" said Sparrow. He turned away.\u003c/p\u003e\n\u003cp\u003eHe expected some Security gadget, thought Ramsey.\u003c/p\u003e\n\u003cp\u003e\"Why\u0027d Security plant you on us?\" asked Sparrow. Ramsey remained silent.\u003c/p\u003e\n\u003cp\u003eSparrow turned, stared at him with a weighing look. \"I won\u0027t force this issue now,\" he said. \"Time enough for that when we get home.\" His face took on a bitter expression. \"Security! Half our troubles can be traced to them.\"\u003c/p\u003e\n\u003cp\u003eRamsey maintained his silence. \"It\u0027s fortunate you\u0027re a good electronics officer,\" said Sparrow. \"Doubtless you were chosen for that quality.\" A sudden look of indecision passed over his features. \"You are a Security man, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eRamsey thought: If he believes that, it\u0027ll mask my real position. But I can\u0027t just admit it. That\u0027d be out of character. He said, \"I have my orders, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" said Sparrow. \"Stupid of me.\" Again the look of indecision. \"Well, I\u0027ll be getting --\" Abruptly, he stiffened.\u003c/p\u003e\n\u003cp\u003eRamsey, too, fought to keep from showing surprise. The pellet imbedded in his neck had just emitted a sharp ping! He knew that the identical equipment in Sparrow had also reacted to a signal.\u003c/p\u003e\n\u003cp\u003eSparrow whirled to the door, ran forward to the control deck, Ramsey on his heels. They stopped before the big master board. Garcia turned from his position at the monitor controls. \"Something wrong, Skipper?\"\u003c/p\u003e\n\u003cp\u003eSparrow didn\u0027t answer. Through his mind was running a senseless rhyme born of the twenty kills the EPs had made in the previous months: Twenty out of twenty is plenty . . . twenty out of twenty is plenty . . .\u003c/p\u003e\n\u003cp\u003eRamsey, standing behind Sparrow, was extremely conscious of the charged feeling in the control room, the stink of the atmosphere, the questioning look on Garcia\u0027s face, the clicking of automatic instruments,\u003c/p\u003e\n\u003cp\u003eand the answering response of the deck beneath his feet.\u003c/p\u003e\n\u003cp\u003eThe pellet in his neck had begun sending out a rhythmic buzzing.\u003c/p\u003e\n\u003cp\u003eGarcia stepped away from the board. \"What\u0027s wrong, Skipper?\"\u003c/p\u003e\n\u003cp\u003eSparrow waved him to silence, turned right. Ramsey followed.\u003c/p\u003e\n\u003cp\u003eThe buzzing deepened. Wrong direction.\u003c/p\u003e\n\u003cp\u003e\"Get a signal snifter,\" said Sparrow, speaking over his shoulder to Ramsey.\u003c/p\u003e\n\u003cp\u003eRamsey turned to the rear bulkhead, pulled a snifter from its rack, tuned it as he rejoined Sparrow. The instrument\u0027s speaker buzzed in rhythm to his neck pellet.\u003c/p\u003e\n\u003cp\u003eSparrow turned left; Ramsey followed. The sound of the snifter went up an octave.\u003c/p\u003e\n\u003cp\u003e\"Spy beam!\" said Garcia.\u003c/p\u003e\n\u003cp\u003eSparrow moved toward the dive board, Ramsey still following. The sound from the snifter grew louder. They passed the board and the sound deepened. They turned, faced the board. Now, the signal climbed another octave.\u003c/p\u003e\n\u003cp\u003eRamsey thought: Garcia was in here alone. Did he set up a signal device?\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Les?\" asked Sparrow. \"Forward,\" said Garcia.\u003c/p\u003e\n\u003cp\u003eSparrow seemed to be trying to look through the wall in front of him.\u003c/p\u003e\n\u003cp\u003eHe thinks it may be Bonnett sending that signal, thought Ramsey. With a sudden despair, he wondered: Could it be?\u003c/p\u003e\n\u003cp\u003eSparrow spoke into his chest microphone: \"Les! To the control room! On the double!\"\u003c/p\u003e\n\u003cp\u003eBonnett acknowledged and they heard a clang of metal as he slipped on the catwalk; then he shut off his microphone. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dragon-in-the-sea/page-8.html","bookId":2676,"creation":"Oct 5, 2019 10:05:59 AM","modification":"Oct 5, 2019 10:05:59 AM"}
