{"id":80652,"no":24,"title":"Page 24","content":"\u003cp\u003eI let it all out. I told Marda everything. Well, almost everything. I left out what Javier’s job was and what my job had been. But I drudged up the details of that moment, when I discovered what he’d done, when everything had been ruined and I’d been forever changed and irreparable. Javier put me back together only to break me again.\u003c/p\u003e\n\u003cp\u003e“Child, please,” Marda said after she heard me babble on like a fool. “I know the pain you’re going through, oh baby do I know it! But damn, you can’t give up on love that easily.”\u003c/p\u003e\n\u003cp\u003e“But he was my first love, my first everything,” I sobbed quietly.\u003c/p\u003e\n\u003cp\u003e“So? Your first love? We all have our first loves. They come and they go. Just because he’s your first love doesn’t mean he’ll be your last. Take it from me, the human heart is much more capable than we give it credit for. Being able to love again is a choice.”\u003c/p\u003e\n\u003cp\u003e“But I just don’t understand. How could he have done it? Why? Why did he choose her? Why did he sleep with her and throw everything we had away? Why?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “I don’t know why. You’ll probably never know why. And if you did, would it matter? Would it change anything that happened? Would you be able to forgive him even with the best excuses?”\u003c/p\u003e\n\u003cp\u003eI swallowed down my beer. I couldn’t think what Javier’s excuse would be. Was he previously married or something and I was the woman on the side? Was he somehow forced —maybe blackmailed, maybe something to do with his job or his sisters? If any of that could possibly be true, would it matter to me? Would it make this pain go away?\u003c/p\u003e\n\u003cp\u003eNo. It wouldn’t. Because he did it. He chose something else over me.\u003c/p\u003e\n\u003cp\u003e“I just thought he loved me,” I said quietly, more to myself than to anyone.\u003c/p\u003e\n\u003cp\u003eShe sighed and gave me a quick squeeze around my shoulders. Then she eased herself off the barstool. “Just because he cheated doesn’t mean he didn’t love you.”\u003c/p\u003e\n\u003cp\u003eI looked at her sharply, not expecting that.\u003c/p\u003e\n\u003cp\u003eShe gave me a sluggish smile. “He might have loved something else more, that’s all. Look, love and respect don’t always go hand in hand. You can have one without the other. But if you want my advice, you should always have both. You, Elaine, you deserve that.”\u003c/p\u003e\n\u003cp\u003eI thought about that for a moment until a horn sounded from outside, a growling old 4x4 with headlamps on the roof that was waiting across the parking lot.\u003c/p\u003e\n\u003cp\u003e“That’s my ride,” she said, wobbling a bit unsteadily. She patted me on the shoulder and staggered to the door.\u003c/p\u003e\n\u003cp\u003e“Thanks for the beer!” I yelled after her, surprised to see her leaving so soon.\u003c/p\u003e\n\u003cp\u003eShe waved goodbye haphazardly, her sights now set on her husband.\u003c/p\u003e\n\u003cp\u003eAnd now my sights were set on her seat. She had taken out money earlier to give to the bartender, but I guess her wallet never made it back inside her bag. It was right there, right beside me.\u003c/p\u003e\n\u003cp\u003eI picked it up and turned it around in my hands. It was full of cash, credit cards, her driver’s license. Marda Lee. I looked around me to see if anyone was watching me in the bar. They weren’t. I watched her still walking crookedly across the lot, her husband flashing his lights at her, getting her to hurry up. I could still catch her. I could return her wallet to her like the good citizen that could be. I could show the world that it wasn’t such a bad place when it really, really was.\u003c/p\u003e\n\u003cp\u003eI looked around the bar to see if anyone had seen me take it. They hadn’t. There was barely anyone around. Then I looked out the window in time to see Marda get in her husband’s car and drive off. I ripped a twenty out of Marda’s wallet as an extra fat tip and slammed it on the counter. I chugged the rest of my beer then left the bar with the wallet tucked away in my purse, knowing that her money would pay the gas for my trip up to Dallas.\u003c/p\u003e\n\u003cp\u003eFor the first time in a while, I managed to sleep well that night.\u003c/p\u003e\n\u003cp\u003eTHE END \u003c/p\u003e","sourceLink":"https://allnovel.net/on-every-street-the-artists-trilogy-0/page-24.html","bookId":2731,"creation":"Oct 5, 2019 4:28:34 PM","modification":"Oct 5, 2019 4:28:34 PM"}
