{"id":77254,"no":18,"title":"Page 18","content":"\u003cp\u003eConnor didn\u0027t have any idea how long he lingered in the forest holding his wife. The sound of thunder rumbling in the distance forced him back to more practical matters, and he picked up her misplaced shoe and started back to camp.\u003c/p\u003e\n\u003cp\u003eHe was in a much better mood by the time he reached the others. His men had built a tent large enough to accommodate three grown men and had covered it with thick animal skins loyal allies had given them on their way to collect Brenna. The tent had been strategically placed at the far end of the clearing, with the entrance facing the forest so that his wife would be assured of privacy when she awakened.\u003c/p\u003e\n\u003cp\u003eIn one corner of the tent were the possessions Brenna had left by the creek. Connor added her shoes and stockings to the pile.\u003c/p\u003e\n\u003cp\u003eShe was sleeping so soundly, she didn\u0027t stir at all while he saw to the task of removing her clothes. Too late, he realized he should have left her alone. As soon as he untied the ribbon holding the top of her undergarment together, the material parted all the way down to her waist, and a fair amount of her full br**sts spilled out. It was impossible for him not to react physically. From the moment he\u0027d awakened early that morning, he\u0027d wanted her again; now the need consumed him. He fought his private battle for a long while, but in the middle of the night, while the storm raged around them, she moaned in her sleep, rolled over, and threw herself on top of him. He knew, then, the war wasn\u0027t finished. She couldn\u0027t even be cautious in her sleep.\u003c/p\u003e\n\u003cp\u003eHis hand went to her thighs, and as he was parting them with the thought of entering her then and there, he realized what he was doing and forced himself to stop.\u003c/p\u003e\n\u003cp\u003eHe jarred her awake trying to get her off of him before he hurt her. She sat up next to his side and, obviously disoriented by the pounding of the rain upon the skins, whispered his name.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right, Brenna. Go back to sleep.\" He sounded angry. He was sorry about that, but damn it all, he\u0027d only just realized he had the discipline of a pig. She wasn\u0027t helping him regain his control, of course.\u003c/p\u003e\n\u003cp\u003eOne side of her chemise had just dropped down to her elbow, and God help him, it took all his strength not to tear the thing off her. Every time lightning streaked across the sky, light poured in through the opening, outlining her beautiful body.\u003c/p\u003e\n\u003cp\u003eShe fell asleep sitting up. Had he not been observing her, he wouldn\u0027t have believed anyone could fall asleep so quickly.\u003c/p\u003e\n\u003cp\u003e\"Lie down,\" he ordered with a gentle nudge.\u003c/p\u003e\n\u003cp\u003eHe should have been more specific, he realized a scant second after she threw herself down on top of him again, hitting his chest hard enough to make him think she\u0027d knocked herself senseless.\u003c/p\u003e\n\u003cp\u003e\"Get off of me.\"\u003c/p\u003e\n\u003cp\u003eHis gruff voice awakened her. \"No,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"No?\u003c/p\u003e\n\u003cp\u003e\"No, thank you,\" she corrected. \"I\u0027m cold. Shouldn\u0027t you do something about it?\"\u003c/p\u003e\n\u003cp\u003eGod save him, she was even telling him what to do when she was half asleep.\u003c/p\u003e\n\u003cp\u003e\"What would you have me do?\"\u003c/p\u003e\n\u003cp\u003e\"Put your arms around me.\"\u003c/p\u003e\n\u003cp\u003eHe felt her shivering and immediately did as she had instructed him to do.\u003c/p\u003e\n\u003cp\u003e\"Did I wake you, Connor?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Are you cold?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eShe began to stroke his chest, hoping her gentle touch would calm him. Perhaps then he would tell her why he was acting so prickly.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Soothing you.\"\u003c/p\u003e\n\u003cp\u003eShe had to be jesting with him. Soothing? She was slowly driving him out of his mind, and he was fairly certain she was doing it on purpose.\u003c/p\u003e\n\u003cp\u003e\"Stop provoking me.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with you? You\u0027re acting like a bear.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t try to address the ludicrous comparison she\u0027d just made, concentrating instead on making her realize what she was doing to him. \"I want to be inside you again. Now do you understand why you should get the hell off me?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t move. \"Do I have a say in the matter?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Do you mean to say that if I told you no, you would honor my wishes?\"\u003c/p\u003e\n\u003cp\u003eHadn\u0027t he just said he would? \"If you tell me no, I won\u0027t touch you.\"\u003c/p\u003e\n\u003cp\u003eShe started drumming her fingertips on his chest. He immediately put his hand on top of hers to get her to stop. \"You\u0027d best learn to be cautious, Brenna.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t pay any attention to his instruction. \"In England, wives can\u0027t deny their husbands. My mother told me so.\"\u003c/p\u003e\n\u003cp\u003e\"Some men think the way I do.\"\u003c/p\u003e\n\u003cp\u003eShe was amazed. She suddenly felt as though he\u0027d given her the wondrous gift of power over her own body, and she immediately wanted more. \"Regarding other matters then, do I…\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"You cannot deny a command given to you by your laird.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d already done exactly that on several occasions now and had suffered no ill effects from denying her laird\u0027s orders, but she was intelligent enough not to remind him. She couldn\u0027t stop herself from straightening out his rather twisted reasoning though.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t marry a laird. I married a man.\"\u003c/p\u003e\n\u003cp\u003e\"It is the same.\"\u003c/p\u003e\n\u003cp\u003eNo, it wasn\u0027t the same at all, she thought to herself. Oh, she knew what was expected of her when they were with other people, but when they were alone, he was simply her husband.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t believe it would be a good idea to correct his backhanded reasoning now and would wait instead until he was in a better mood.\u003c/p\u003e\n\u003cp\u003e\"If I were to tell you yes, I would like you to touch me again, would it end the same way? Would you turn away from me without saying a word?\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" he replied.\u003c/p\u003e\n\u003cp\u003e\"Never mind then.\"\u003c/p\u003e\n\u003cp\u003eHe was stunned by her denial and couldn\u0027t understand why his praise had angered her.\u003c/p\u003e\n\u003cp\u003eShe moved away from him, closed her eyes, and said a prayer for patience.\u003c/p\u003e\n\u003cp\u003eHe rolled over on top of her, careful to brace his weight with his arms as he stared down into her eyes. \"I told you I wasn\u0027t disappointed.\"\u003c/p\u003e\n\u003cp\u003e\"You were also angry though, weren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eAye, he had been angry, though not with his wife. His fury had been self-directed, and upon reflection, he realized it was purposeful as well, for he had it as a shield to guard himself against his own vulnerability.\u003c/p\u003e\n\u003cp\u003eShe had dared to touch his heart, and honest to God, he still didn\u0027t know how he\u0027d let that happen. Damn it, he didn\u0027t even like her.\u003c/p\u003e\n\u003cp\u003eConnor was quick to recognize his lie and let out a low growl of frustration. He decided then that since what had already happened couldn\u0027t be undone, as long as he stayed in control in the future, he would be content.\u003c/p\u003e\n\u003cp\u003e\"Are you ever going to answer me?\"\u003c/p\u003e\n\u003cp\u003eHe leaned down and began to nibble on her earlobe, feeling arrogantly pleased when he noticed she shivered in reaction. \"What did you ask?\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t believe he would treat her concerns so lightly. She repeated her question and added a nudge to get him to pay attention.\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t angry with you.\"\u003c/p\u003e\n\u003cp\u003eHe could see she didn\u0027t believe him. His wife obviously needed more praise for her performance, he supposed. He wasn\u0027t sure what to say that would make her happy. He had been satisfied. And well-served, he admitted. She surely knew he never would have left her until both of them had reached fulfillment. He wasn\u0027t at all used to explaining anything to anyone, however, and perhaps that was why he wasn\u0027t any good at it, he reasoned. He needed to say something now, though, and so he decided to sum up his reactions with one word that would certainly convince her she had proven satisfactory.\u003c/p\u003e\n\u003cp\u003e\"Finished.\"\u003c/p\u003e\n\u003cp\u003e\"I beg your pardon?\"\u003c/p\u003e\n\u003cp\u003e\"I was finished.\"\u003c/p\u003e\n\u003cp\u003eBecause of their close proximity, he\u0027d naturally been considerate and spoken in a low voice. His wife wasn\u0027t as considerate. She shouted her displeasure into his ear. \"You are the most pigheaded, insensitive, barbaric…\"\u003c/p\u003e\n\u003cp\u003eHe clamped his hand down over her mouth before she could finish giving him her opinion. She could have come up with another hundred remarks too, if he\u0027d kept silent and let her think of some, but he interrupted her concentration by asking her the most appalling question, and she had to think about giving him an answer sure to destroy his pride for a full month.\u003c/p\u003e\n\u003cp\u003e\"Do you want me to make love to you again?\" He lifted his hand away from her mouth.\u003c/p\u003e\n\u003cp\u003e\"When hell freezes over.\" She didn\u0027t actually shout, but her voice was still loud enough for his men to hear.\u003c/p\u003e\n\u003cp\u003e\"You will not shout at me ever again. Is that understood?\"\u003c/p\u003e\n\u003cp\u003e\"It is,\" she answered.\u003c/p\u003e\n\u003cp\u003e\"My hearing is never going to be the same.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. What you said took me by surprise and I… Finished, Connor? Is that how you thought to reassure me?\"\u003c/p\u003e\n\u003cp\u003e\"It was a compliment. I was obviously satisfied with you or I wouldn\u0027t have been finished. I\u0027m a man of few words, Brenna.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve noticed.\"\u003c/p\u003e\n\u003cp\u003eHe turned his attention to the rewarding pleasure of kissing her.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t usually feel so unsure of myself,\" she whispered. \"But it was my first time.\"\u003c/p\u003e\n\u003cp\u003e\"I noticed.\"\u003c/p\u003e\n\u003cp\u003eHe kissed his way down the side of her neck.\u003c/p\u003e\n\u003cp\u003e\"Why are you doing that?\"\u003c/p\u003e\n\u003cp\u003e\"I like the way you taste.\"\u003c/p\u003e\n\u003cp\u003eShe shifted her position to give him better access to her shoulder. \"How do I taste?\"\u003c/p\u003e\n\u003cp\u003e\"Like honey.\"\u003c/p\u003e\n\u003cp\u003eHe heard her sigh in the darkness. It would have been easy for him to take her by surprise, but he would never do such a dishonorable thing. Brenna was going to have to give him permission, and if she didn\u0027t give it soon, he would have to leave her while he had enough discipline.\u003c/p\u003e\n\u003cp\u003e\"Do you know what I think?\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"No, but you\u0027re going to tell me, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want you to—never mind. I mean to say that I…\" She couldn\u0027t go on, for Connor had just reached the valley between her breasts, distracting her entirely.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re soft everywhere. You make me burn to have you.\"\u003c/p\u003e\n\u003cp\u003eShe thought his words were wonderfully romantic. For a man of few words, he was doing exceptionally well at giving her exactly what she longed to hear.\u003c/p\u003e\n\u003cp\u003e\"Is there anything you don\u0027t like about me?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, there is,\" he whispered. \"You talk too much.\"\u003c/p\u003e\n\u003cp\u003e\"You turn my head with your flowery words, husband. Make love to me now.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll hurt you.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t seem concerned about her discomfort though, for he\u0027d already pushed her chemise down to her hips. He paused to kiss each of her knees before finishing his task of ridding her of her undergarment.\u003c/p\u003e\n\u003cp\u003eHis hands were everywhere. He stroked her legs, her thighs, her hips, and her breasts. His gentle touch was maddening and made her restless for more. She wanted to caress him with the same care he was showing her and was about to demand he let go of her when he snatched the very thought right out of her mind by leaning down and kissing her breasts. His tongue brushed over one nipple, and she thought she would die from the exquisite torment, and then he began to suckle. She squeezed her eyes shut and made a sound very like a whimper.\u003c/p\u003e\n\u003cp\u003eHer stomach was just as sensitive to his touch, and then he moved lower. She couldn\u0027t imagine what he thought he was going to do, until he was there, at the junction of her thighs. She kept her legs locked together to keep him from going further. He forced them apart and continued to do what he wanted to do, and she was soon too caught up in the rush of ecstasy his mouth and his tongue evoked to be properly appalled.\u003c/p\u003e\n\u003cp\u003eHe made love to her in ways she\u0027d never, ever imagined possible. She couldn\u0027t make herself stop arching up against him. She raised her knees and cried out when she felt herself begin to tighten around him.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t wait any longer to be inside her. He knelt between her thighs then, lifted her hips, and entered her with one powerful thrust. He tried to remember to be gentle with her, but damn, his control had deserted him again and it was impossible to hold anything back. He wanted it to last all night. She wouldn\u0027t let him slow down though. She drove him on with her sweet cries and her passionate kisses. He didn\u0027t know if he was hurting her or pleasuring her. Her cl**ax forced his own, and once he\u0027d given her his seed, he didn\u0027t have enough strength left to keep from collapsing on top of her.\u003c/p\u003e\n\u003cp\u003eShe was in much the same condition. Her breathing was uneven, her heart was pounding a frantic beat, and she was trembling all over. It took her long minutes to make herself stop sighing and start thinking again. Then she wished she hadn\u0027t bothered. Reason meant worrying, and dear God, how could she ever look at him again after what she\u0027d begged him to keep doing to her?\u003c/p\u003e\n\u003cp\u003eShe had acted like an animal in heat, hadn\u0027t she? She was suddenly desperate for reassurance before her embarrassment turned into shame. She wouldn\u0027t beg or demand he convince her that what they\u0027d done had been all right, or let him know she was at all embarrassed now. He might say things just to appease her then, and not mean any of it. She\u0027d catch him by surprise, she decided, so that he wouldn\u0027t guard his reaction.\u003c/p\u003e\n\u003cp\u003e\"Connor?\" God help her, even her voice was trembling. \"Are you dead then?\"\u003c/p\u003e\n\u003cp\u003eHe smiled against her neck. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did you hurt me?\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t believe she\u0027d asked him such an absurd question. She\u0027d meant to tell him he hadn\u0027t hurt her, hadn\u0027t she?\u003c/p\u003e\n\u003cp\u003eIt was apparent to him that she hadn\u0027t quite recovered from their lovemaking just yet. He was arrogantly satisfied, of course, because he was fully responsible for her condition.\u003c/p\u003e\n\u003cp\u003eHis heat was making her drowsy. She didn\u0027t want to fall asleep before she\u0027d gotten rid of her embarrassment and meant only to close her eyes so she could concentrate.\u003c/p\u003e\n\u003cp\u003e\"Do you know what just happened?\"\u003c/p\u003e\n\u003cp\u003eShe smiled in anticipation, for surely he was now going to give her the reassurance she needed. She should have known better.\u003c/p\u003e\n\u003cp\u003e\"Hell just froze over.\"\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eBrenna was in a fit mood the following morning. The rain had ended, the sun was bright, and no one, not even Connor, could put a wrinkle in her happiness.\u003c/p\u003e\n\u003cp\u003eIt kept getting better too. Although the men smiled while they watched her eat her morning meal, they didn\u0027t comment on her appetite, and after she returned from the creek dressed in the MacAlister plaid, Quinlan complimented her on the perfect pleats she\u0027d made in the woolen material. He seemed to think she\u0027d only just acquired the art.\u003c/p\u003e\n\u003cp\u003eShe felt it was her duty to correct him. \"My father made Rachel learn how to fashion a plaid because she was supposed to marry Laird MacNare, but Mother thought it would be a good idea for all of her daughters to master the technique. My parents did like to get as much as they could for their coins.\"\u003c/p\u003e\n\u003cp\u003e\"Your sister was promised to MacNare?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-lairds-fiancees-2/page-18.html","bookId":1845,"creation":"Oct 5, 2019 3:36:47 PM","modification":"Oct 5, 2019 3:36:47 PM"}
