{"id":77261,"no":25,"title":"Page 25","content":"\u003cp\u003e\"I won\u0027t jest, but you still won\u0027t believe me. Your wife took over the duty.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe you.\"\u003c/p\u003e\n\u003cp\u003eQuinlan nudged Crispin. \"He did forget her,\" he whispered.\u003c/p\u003e\n\u003cp\u003eAs soon as they reached the stables, Connor pulled the doors wide before either one of his soldiers could get ahead of him to see to the duty.\u003c/p\u003e\n\u003cp\u003eThe stablemaster came running. He bowed to his laird and was about to welcome him back to the keep when Connor interrupted him.\u003c/p\u003e\n\u003cp\u003e\"Davis, is my stallion in his stall?\"\u003c/p\u003e\n\u003cp\u003e\"He is, Laird, and as content as I\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003e\"Then you didn\u0027t have your usual difficulty getting him to settle down?\"\u003c/p\u003e\n\u003cp\u003e\"I was saved from the task by your lady. She certainly has a way with animals, Laird, but I\u0027m sure you already knew that. She soothed the anger out of the beast in no time at all. Your stallion was happy to let her lead him to his quarters.\"\u003c/p\u003e\n\u003cp\u003eConnor knew Davis was telling him the truth, as difficult as it was to believe.\u003c/p\u003e\n\u003cp\u003e\"Where is Lady MacAlister now?\"\u003c/p\u003e\n\u003cp\u003e\"She spotted Ewan\u0027s wife giving their bairn the afternoon air. I\u0027m thinking that was where she was headed.\"\u003c/p\u003e\n\u003cp\u003eConnor nodded and walked away. He paused once when Davis called out, \"You\u0027ve chosen well, Laird.\"\u003c/p\u003e\n\u003cp\u003eBrenna had already left Ewan\u0027s cottage, however. While the blushing mother explained she\u0027d been thrilled to have her mistress\u0027s undivided attention, she seemed far more interested in praising Brenna than in telling Connor where she\u0027d gone.\u003c/p\u003e\n\u003cp\u003e\"She insisted on holding the baby and didn\u0027t mind at all that he hadn\u0027t had his bath yet. She has a special way with children, Laird. My little one is usually suspicious of strangers, but he took to her right away.\u003c/p\u003e\n\u003cp\u003eYour wife\u0027s a dear lass, and from England, of all scandalous places. She\u0027s thoughtful as can be. She hurried over to meet Brocca when she noticed her staring out at her through the window.\"\u003c/p\u003e\n\u003cp\u003eHis patience was nearly gone by the time he finally caught up with Brenna. She had already left Brocca\u0027s cottage and was just about to knock on another door when he stopped her.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t look especially pleased to see him. He couldn\u0027t believe she dared to trown at him after she\u0027d caused him so much trouble.\u003c/p\u003e\n\u003cp\u003e\"You forgot me, didn\u0027t you?\" She folded her arms and continued to frown at him.\u003c/p\u003e\n\u003cp\u003eConnor wasn\u0027t at all impressed with the way she tried to intimidate him. He moved closer so that she was forced to tilt her head back in order to look up at him, and then said, \"You will not take that tone with me.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t back away as he expected her to do, but she did soften her voice when she next spoke to him.\u003c/p\u003e\n\u003cp\u003e\"May I speak plainly, Connor?\"\u003c/p\u003e\n\u003cp\u003e\"No, you may not. You may follow me back to the keep now, however.\"\u003c/p\u003e\n\u003cp\u003eHe turned to leave. She stood her ground.\u003c/p\u003e\n\u003cp\u003e\"Are you defying me?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"No, Laird, I\u0027m not defying you. I am waiting.\"\u003c/p\u003e\n\u003cp\u003e\"Waiting for what?\"\u003c/p\u003e\n\u003cp\u003e\"For you to admit you forgot me.\"\u003c/p\u003e\n\u003cp\u003e\"I did no such thing.\"\u003c/p\u003e\n\u003cp\u003e\"Then you do not plan to apologize?\"\u003c/p\u003e\n\u003cp\u003eShe saw the incredulous look that came over his face and knew the thought had never entered his mind.\u003c/p\u003e\n\u003cp\u003eDear heavens, changing Connor from a barbarian into a considerate husband was going to take every ounce of her patience. But, she had pushed him far enough today, and she didn\u0027t dare add another word of criticism until he\u0027d recovered. In her estimation, it was a fair start.\u003c/p\u003e\n\u003cp\u003eConnor was considering tossing his wife over his shoulder and carrying her to the keep when she suddenly smiled at him and took hold of his hand. He didn\u0027t understand what had caused the transformation, but he didn\u0027t question her. He had pushed her far enough for one day, and now that he\u0027d made her realize she must not challenge him or contradict him, he believed he\u0027d made a fair start. He knew it was going to take him a long time to help her learn to be more disciplined.\u003c/p\u003e\n\u003cp\u003eAs soon as he moved back toward the path, she noticed again the soldier standing next to Quinlan.\u003c/p\u003e\n\u003cp\u003e\"Brenna, in future, don\u0027t make me chase after you.\"\u003c/p\u003e\n\u003cp\u003eShe nodded agreement because her husband seemed to require it, then looked at Quinlan. \"He did forget about me, didn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003eConnor squeezed her hand to let her know what he thought about her question.\u003c/p\u003e\n\u003cp\u003e\"It would seem he did, mi\u0027lady.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for reminding him.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t,\" Quinlan replied, nodding to his left. \"Crispin did.\"\u003c/p\u003e\n\u003cp\u003eShe smiled at the soldier. \"Thank you, Crispin.\" She would have officially introduced herself to the soldier, but he looked rather dazed, and she decided he was busy thinking about something more important.\u003c/p\u003e\n\u003cp\u003eQuinlan laughed at the expression on Crispin\u0027s face. His friend was looking quite stunned. \"She takes your breath away, doesn\u0027t she, Crispin?\"\u003c/p\u003e\n\u003cp\u003eThe soldier nodded. He motioned to Quinlan to wait so that they could have a moment alone and follow at a more discreet distance.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen Connor act this way. He doesn\u0027t usually allow any woman to make him lose his patience.\"\u003c/p\u003e\n\u003cp\u003e\"She isn\u0027t just any woman. She\u0027s his wife. I think he likes having her around.\"\u003c/p\u003e\n\u003cp\u003eCrispin smiled. \"I\u0027d like having her around too, if I were married to her. She\u0027s very beautiful, isn\u0027t she? I don\u0027t think I\u0027ve ever seen a woman so bonny.\"\u003c/p\u003e\n\u003cp\u003e\"Connor doesn\u0027t notice.\"\u003c/p\u003e\n\u003cp\u003eThe two men shared a laugh. Brenna glanced back over her shoulder to smile at them.\u003c/p\u003e\n\u003cp\u003e\"Our mistress isn\u0027t easily intimidated.\" There was admiration in Crispin\u0027s voice when he made the remark.\u003c/p\u003e\n\u003cp\u003e\"If she were the least bit timid, Connor would walk all over her. Do you remember what he told us about Isabelle?\"\u003c/p\u003e\n\u003cp\u003e\"He told us very little. He doesn\u0027t remember his mother.\"\u003c/p\u003e\n\u003cp\u003e\"That is so, but he remembers every word his father said to him before he died.\"\u003c/p\u003e\n\u003cp\u003eCrispin nodded. \"Donald called his wife his own sweet Isabelle. He loved her.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly so.\"\u003c/p\u003e\n\u003cp\u003e\"But Donald cautioned his son not to make the same mistake.\"\u003c/p\u003e\n\u003cp\u003e\"Connor knew he was only warning him to be careful. If you had seen the way the Lady Brenna and he looked at one another when they first met, you would conclude what I have.\"\u003c/p\u003e\n\u003cp\u003e\"And what is that?\"\u003c/p\u003e\n\u003cp\u003eQuinlan stared at Brenna as he gave his answer. \"She\u0027s going to be Connor\u0027s own sweet love.\"\u003c/p\u003e\n\u003cp\u003eCrispin clasped his hands behind his back while he considered what Quinlan had just told him. Like his friend, he also wanted his laird to find peace and contentment. But love? He didn\u0027t know if Connor would ever let himself feel such an emotion.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never heard you talk like this.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen Connor act like this.\"\u003c/p\u003e\n\u003cp\u003e\"Like what?\"\u003c/p\u003e\n\u003cp\u003eQuinlan shrugged. \"There have been sparks flying between the two of them from the very beginning. It\u0027s as though Connor were struck by a bolt. He\u0027s going to give his heart to her because he won\u0027t be able to stop it from happening. Quit frowning, Crispin. She has a good heart.\"\u003c/p\u003e\n\u003cp\u003eThe two soldiers continued to follow behind the couple at a leisurely pace while Crispin caught Quinlan up on the latest news. Brenna didn\u0027t realize she was being discussed by the men, and she certainly didn\u0027t know she was being watched so closely. Connor was forcing her to run in order to keep up with him, and she soon decided she had had enough. She suddenly stopped. Connor was either going to have to drag her behind him or let go of her. She would leave the choice up to him.\u003c/p\u003e\n\u003cp\u003e\"Why did you stop?\"\u003c/p\u003e\n\u003cp\u003e\"I got tired of running.\"\u003c/p\u003e\n\u003cp\u003eA smile softened his expression. \"Why didn\u0027t you tell me to slow down?\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to keep up. I didn\u0027t realize I was so weary this afternoon. I\u0027m sure I\u0027ll recover after we have our supper. Could we sit a spell until then?\"\u003c/p\u003e\n\u003cp\u003eHe moved back to her side. \"We already ate our evening meal, remember? You cannot still be hungry.\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. There really wasn\u0027t any use in pretending with her husband that she had a dainty appetite.\u003c/p\u003e\n\u003cp\u003e\"I could eat a little something,\" she admitted. \"I was a bit nervous meeting Alec and by the time we sat down at the table, I couldn\u0027t concentrate on food. I barely ate a thing. I can\u0027t imagine why you\u0027re laughing, Connor. I haven\u0027t told you a jest.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t apologize, of course. She doubted he ever would. He stopped laughing, though, and she was most appreciative.\u003c/p\u003e\n\u003cp\u003e\"Would it help if I carried you?\"\u003c/p\u003e\n\u003cp\u003eHis suggestion didn\u0027t sit well with her. \"And have your followers think you married a weakling? I\u0027ll crawl first.\"\u003c/p\u003e\n\u003cp\u003eShe straightened her shoulders, tugged her hand away from his, and tried to hurry past him. She didn\u0027t get very far. He caught her around her waist and forced her into his side. He didn\u0027t have to tell her to lean against him. She was too weary to even consider struggling. She sagged against him and let out a little sigh. She didn\u0027t dare close her eyes for even a second for fear she\u0027d fall asleep on her feet if she did. God only knew, she\u0027d done it before.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve had a difficult day.\"\u003c/p\u003e\n\u003cp\u003e\"No, I haven\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have to disagree with everything I say?\"\u003c/p\u003e\n\u003cp\u003e\"I was simply giving you my opinion. We\u0027ve yet to argue, Connor. Once we do, you\u0027ll know the difference. Please let go of me as soon as we reach the courtyard. I don\u0027t want your followers to think I can\u0027t stand without assistance.\"\u003c/p\u003e\n\u003cp\u003eIn frustration, she threaded her fingers through her hair, then grimaced as she touched her injury. \"I never seem to say the right thing to you. Everything\u0027s so different here. I don\u0027t like chaos, and it seems to me that my life has been extremely chaotic since I met you. I want to live in peace.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to become much easier for you now.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t look as though she believed him. \"Do you promise?\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"I promise.\"\u003c/p\u003e\n\u003cp\u003eShe managed to smile back and relax. He didn\u0027t know if it had been his calm voice or his promise that had soothed her.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like surprises,\" she remarked as she moved closer to his side again. \"Unless, of course, I know about them in advance.\"\u003c/p\u003e\n\u003cp\u003eShe sounded sincere enough for him to think she didn\u0027t realize she\u0027d just contradicted herself. \"If you know in advance, it isn\u0027t a surprise.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly so,\" she reasoned. \"Tell me how it will become easier.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t have to worry about pleasing me. I\u0027m rarely here.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t worry about pleasing you now. But I don\u0027t understand why you\u0027re rarely here. This is your home.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"I realize that. We\u0027ll see each other now and again.\"\u003c/p\u003e\n\u003cp\u003eThey had finally reached the courtyard proper. It was deserted.\u003c/p\u003e\n\u003cp\u003e\"You mentioned you would only be here every now and again?\" she asked, sorry her voice sounded so strained.\u003c/p\u003e\n\u003cp\u003eHis mind was on an entirely different matter. Crispin\u0027s report that their ally to the south wanted Connor to see something that had been left at his border had made him curious, and he was guessing what the something might be. Because of the life he\u0027d led, he was naturally suspicious and had already concluded the surprise wasn\u0027t going to be welcome. He wasn\u0027t an impatient man when important issues were at stake, and so he once again decided to wait and see before he contemplated his response.\u003c/p\u003e\n\u003cp\u003eBrenna\u0027s question pulled him away from his thoughts. \"Exactly how often is \u0027now and again\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Once or twice a month.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re serious?\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003eThe more he told her, the less she wanted to hear. \"A husband should be home with his wife more often than twice a month.\"\u003c/p\u003e\n\u003cp\u003e\"I have other more important duties.\"\u003c/p\u003e\n\u003cp\u003eShe felt as though he were abandoning her. Worse, she believed he was eager to do just that.\u003c/p\u003e\n\u003cp\u003e\"Why bother to come back at all?\"\u003c/p\u003e\n\u003cp\u003eHe decided to ignore the anger in her voice. \"Several reasons come to mind. The most compelling one is you.\"\u003c/p\u003e\n\u003cp\u003eA little of her irritation eased away. \"Me?\" she whispered, hoping he would redeem himself by giving her some praise.\u003c/p\u003e\n\u003cp\u003e\"I want children.\"\u003c/p\u003e\n\u003cp\u003eShe wanted to throttle him. \"You mentioned you did.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m pleased you remember.\"\u003c/p\u003e\n\u003cp\u003e\"I remember everything you said to me: you married me to insult MacNare, and you\u0027ll be happy to take me back to England as soon as I give you a son. I doubt I\u0027ll ever forget those two important facts. Your reasons make me feel so very worthy.\"\u003c/p\u003e\n\u003cp\u003e\"Would you rather I lied to you?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I would rather we never, ever talk about this again. You may explain your duties and your expectations the next time you happen to pass by the area. Now, if you\u0027ll excuse me, I\u0027d like to go inside.\"\u003c/p\u003e\n\u003cp\u003e\"I will call my followers together and introduce you to them as soon as Donald returns with the younger soldiers.\"\u003c/p\u003e\n\u003cp\u003e\"You needn\u0027t go to any trouble, Connor. I already have one black mark against me; I might as well have another.\"\u003c/p\u003e\n\u003cp\u003e\"What black mark?\" he called out.\u003c/p\u003e\n\u003cp\u003eHe stood in the center of the courtyard, his attention fully on his wife. Her behavior was most perplexing.\u003c/p\u003e\n\u003cp\u003eShe\u0027d hurried on ahead of him, but hadn\u0027t gone to the steps leading inside the keep. No, she\u0027d gone to the center of the wall and was now pacing back and forth along the front of the keep.\u003c/p\u003e\n\u003cp\u003eIt was obvious he\u0027d upset her, and while he knew he was fully responsible, he couldn\u0027t understand how it had happened. His goal had been to soothe her, yet one word had led to another, and before he realized what the outcome would be, she was getting teary eyed. He believed he\u0027d been thoughtful by telling her he wouldn\u0027t be home very often. Yet she acted as though he\u0027d just betrayed her. How in God\u0027s name would he ever make sense out of her?\u003c/p\u003e\n\u003cp\u003e\"Explain this black mark,\" he ordered when she didn\u0027t immediately answer him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m English, for the love of God, and everyone knows I was on my way to marry MacNare. Surely you understand what I\u0027m up against? Oh, and I\u0027m clumsy too,\" she told her husband. \"I forgot about that.\u003c/p\u003e\n\u003cp\u003eWhat have you done with your steps? I can\u0027t seem to find them.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re on the side of the keep,\" he answered.\u003c/p\u003e\n\u003cp\u003e\"I fell down Alec\u0027s steps, remember?\"\u003c/p\u003e\n\u003cp\u003eCrispin had just caught up with Connor and turned to his laird. \"Mi\u0027lady fell down steps?\"\u003c/p\u003e\n\u003cp\u003e\"It seems she did,\" he replied.\u003c/p\u003e\n\u003cp\u003eConnor would have taken the time to explain if he hadn\u0027t noticed his wife was about to go around to the wrong side of the keep. \"The steps are on the opposite side, Brenna.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-lairds-fiancees-2/page-25.html","bookId":1845,"creation":"Oct 5, 2019 3:36:47 PM","modification":"Oct 5, 2019 3:36:47 PM"}
