{"id":77280,"no":44,"title":"Page 44","content":"\u003cp\u003eCrispin left his mount with Davis and started up the hill. His mistress had told him she was afraid of Raen, and Crispin was going to stay close to her side until Connor\u0027s stepbrother left again.\u003c/p\u003e\n\u003cp\u003eThe closer he got to the keep, the quicker he moved. He couldn\u0027t explain why he suddenly felt as though his mistress was in danger, but the feeling intensified until he was running to get to her.\u003c/p\u003e\n\u003cp\u003eAnd then he heard her scream. His heart slammed inside his chest as he reached for his sword. \"Son of a bitch.\" He whispered the curse the first time, shouted it the second.\u003c/p\u003e\n\u003cp\u003eEveryone was running to the courtyard. The silence after such an anguished scream terrified all of them.\u003c/p\u003e\n\u003cp\u003eCrispin reached the top of the path when he heard a man\u0027s shout. Jarred, he looked up. There in the window was Raen clutching at his shoulder, teetering and swaying like a tree giving way to the ax, then plunging backward into the air. He twisted in a useless attempt to land on his feet, screaming in horror, and then crashed, face first, into the ground with a soft thud.\u003c/p\u003e\n\u003cp\u003eAnd on Crispin ran. Dear God, let her be alive, he prayed. He leapt over Raen, raced up to the door, and pulled it open as Brenna came charging outside.\u003c/p\u003e\n\u003cp\u003eHe stopped dead in his tracks. The look on her face was more terrifying than her cry for help. Her eyes were glazed over, her face was stark white, and there was blood everywhere. Her left arm was covered in it, for the skin was splayed open from the top of her shoulder to the bottom of her wrist. More blood covered her shoulders and neck, and her clothing looked as though an animal had shredded it with its claws.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t know how she was able to stand. He reached for her, but she evaded him and ran down the steps.\u003c/p\u003e\n\u003cp\u003e\"Hurry, Crispin, Hurry. You have to help me,\" she sobbed. \"We have to hide him.\"\u003c/p\u003e\n\u003cp\u003eA crowd of soldiers surrounded the body. They stepped back when she ran closer. Their expressions showed their shock and their outrage.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t push him out the window… No, no, I didn\u0027t… His feet got caught in his plaid when I thrust my knee into his groin… yes. I meant to hurt him so he wouldn\u0027t… He was holding me down, but the dagger was in my hand then… When he rolled over… it went… and he jumped, Crispin. He did, he jumped…\u003c/p\u003e\n\u003cp\u003eand then he fell.\"\u003c/p\u003e\n\u003cp\u003eShe grabbed hold of Crispin\u0027s hand and tried to pull him forward. \"Don\u0027t you understand? We have to hide him… She can\u0027t see her son like this. Oh, God, I have to tell Connor… I couldn\u0027t let him… He touched me, his mouth was on my skin, Crispin… I couldn\u0027t let him… She told me I should, but I couldn\u0027t… No, I wouldn\u0027t,\" she screamed.\u003c/p\u003e\n\u003cp\u003e\"Euphemia told you to submit to her son?\" Crispin demanded in outrage.\u003c/p\u003e\n\u003cp\u003e\"Yes, but I couldn\u0027t… He tried, but he fell before he could…\"\u003c/p\u003e\n\u003cp\u003eShe stopped rambling, let go of his hand, bent down to take hold of one of Raen\u0027s feet, and tried to drag him away.\u003c/p\u003e\n\u003cp\u003e\"Mi\u0027lady, let go of him. Let me help you,\" Crispin said.\u003c/p\u003e\n\u003cp\u003e\"Yes, help me. We\u0027ll hide him before she knows he came back. All right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he promised, his voice calm, his goal to reassure her. \"We\u0027ll hide him.\"\u003c/p\u003e\n\u003cp\u003e\"Mi\u0027lady, your dagger is in his back,\" Owen whispered. \"Do you want me to get it for you?\"\u003c/p\u003e\n\u003cp\u003e\"No, no,\" she cried out.\u003c/p\u003e\n\u003cp\u003eCrispin shook his head at Owen, telling him without words to keep his mouth closed.\u003c/p\u003e\n\u003cp\u003e\"Connor will never forgive me. Oh, God, what have I done? I\u0027ve killed his brother… No, she can\u0027t see him. Help me, Crispin. Please. I want Connor.\"\u003c/p\u003e\n\u003cp\u003eHe slowly put his hand out to her. She frantically shook her head at him. \"No, I\u0027m not clean. He touched me with his hands and his mouth…\"\u003c/p\u003e\n\u003cp\u003eAnd then she threw herself into his arms. \"Take me to the lake. All right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, mi\u0027lady,\" he lied. \"I\u0027ll take you to the lake.\"\u003c/p\u003e\n\u003cp\u003eShe patted his arm. \"Thank you. I\u0027ve gone and done it, haven\u0027t I?\"\u003c/p\u003e\n\u003cp\u003e\"Done what?\"\u003c/p\u003e\n\u003cp\u003e\"I killed him.\"\u003c/p\u003e\n\u003cp\u003e\"No, he destroyed himself. He deserved to die. Connor would have killed him for you.\"\u003c/p\u003e\n\u003cp\u003e\"Will he hate me?\"\u003c/p\u003e\n\u003cp\u003eShe fainted in his arms before he could answer her.\u003c/p\u003e\n\u003cp\u003eDonald moved forward, his dagger in his hand, pulled his plaid from his shoulder and sliced it into two long strips to his waist.\u003c/p\u003e\n\u003cp\u003eCrispin held Brenna in his arms and turned so that Donald could bind the injury with the material. He spoke in a low whisper when he gave his orders. \"You\u0027re taking the watch for as long as I\u0027m away. I\u0027m taking her to Lady Kincaid. She\u0027ll need stitches,\" he added. \"Giric, you take others, surround the three soldiers waiting for the bastard in the meadow. Bring them inside the keep and make them stay by the stables.\"\u003c/p\u003e\n\u003cp\u003e\"What about Connor\u0027s stepmother?\"\u003c/p\u003e\n\u003cp\u003e\"Donald, you tell her what happened. If she wants to take his body home, let her, but not one of Connor\u0027s soldiers escorts her. Understand?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Donald answered.\u003c/p\u003e\n\u003cp\u003e\"Aeden, find Connor and tell him what happened. Assure him his wife will be all right. Don\u0027t paint it any darker than it already is.\"\u003c/p\u003e\n\u003cp\u003e\"Will she die?\" Owen whispered, terrified by the possibility.\u003c/p\u003e\n\u003cp\u003e\"No, she won\u0027t die. Donald, no one but our own comes inside the fortress until Connor, Alec, Quinlan, or I come back.\"\u003c/p\u003e\n\u003cp\u003e\"Will you leave her with the Kincaids?\" Owen asked.\u003c/p\u003e\n\u003cp\u003e\"No. I\u0027m staying with her until Connor gets to her.\"\u003c/p\u003e\n\u003cp\u003e\"Do the three soldiers with Raen stay even if Euphemia leaves?\"\u003c/p\u003e\n\u003cp\u003e\"They leave with her.\"\u003c/p\u003e\n\u003cp\u003eDonald finished binding her injury, nodded to Crispin, and went to the stables to get his commander\u0027s horse. He called orders as he ran. He wanted a full contingent riding with his mistress, and everyone was ready to leave immediately.\u003c/p\u003e\n\u003cp\u003e\"Leave the dagger in his shoulder,\" Crispin ordered. He was so furious now, his voice shook with rage.\u003c/p\u003e\n\u003cp\u003e\"She told Connor\u0027s wife to submit to her son. God help her when our laird finds out.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want me to tell him?\" Aeden asked.\u003c/p\u003e\n\u003cp\u003e\"Tell him everything, but make sure he understands she won\u0027t die. He has grown extremely fond of his wife.\"\u003c/p\u003e\n\u003cp\u003eCrispin started across the courtyard, stopped, and then turned back toward Raen and spit on him.\u003c/p\u003e\n\u003cp\u003eBlessedly, Brenna didn\u0027t awaken until they were dismounting in Kincaid\u0027s courtyard. Alec and Jamie stood in the doorway. Alec blanched when he saw Brenna\u0027s condition. Jamie began to weep. She put her hand to her mouth to keep herself from crying out.\u003c/p\u003e\n\u003cp\u003eBrenna asked Crispin to let her walk. She took hold of his arm and slowly made her way toward the steps. Crispin noticed the glazed look was still in her eyes and knew it was going to take her a long while to recover from the horror she\u0027d endured.\u003c/p\u003e\n\u003cp\u003eBrenna stopped in front of Alec. \"I killed Connor\u0027s stepbrother.\"\u003c/p\u003e\n\u003cp\u003eAnd then she turned to Jamie. In a bewildered voice, she said, \"Now she\u0027s never going to like me.\"\u003c/p\u003e\n\u003cp\u003eAlec lifted her into his arms and carried her inside. \"It\u0027s all right, Brenna. Your husband likes you, and so do we.\"\u003c/p\u003e\n\u003cp\u003e\"Alec?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry.\"\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003eQuinlan returned from England empty-handed. Thoroughly frustrated and bewildered, he gave his accounting to his laird.\u003c/p\u003e\n\u003cp\u003e\"MacNare had already dispatched troops to England. We followed their tracks from the Lowlands on, knew their number, and exactly that many returned from Baron Haynesworth\u0027s fortress.\"\u003c/p\u003e\n\u003cp\u003e\"How many were they?\"\u003c/p\u003e\n\u003cp\u003e\"Twenty-six soldiers, all fully armed.\"\u003c/p\u003e\n\u003cp\u003e\"But they didn\u0027t have Faith with them.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re certain.\"\u003c/p\u003e\n\u003cp\u003e\"We watched them leave, Connor. Yes, I\u0027m certain.\"\u003c/p\u003e\n\u003cp\u003e\"And what did you do to them?\"\u003c/p\u003e\n\u003cp\u003e\"What do you think we did?\"\u003c/p\u003e\n\u003cp\u003eConnor nodded approval. \"How many of my men engaged in this battle?\"\u003c/p\u003e\n\u003cp\u003e\"There were eleven of us.\"\u003c/p\u003e\n\u003cp\u003e\"A fair fight then. Were any of my men injured?\"\u003c/p\u003e\n\u003cp\u003e\"Donovan\u0027s thigh was cut through, but his was the most serious of the injuries. The others suffered only paltry cuts. To be honest, I don\u0027t think Donovan would have made it back if it weren\u0027t for…\"\u003c/p\u003e\n\u003cp\u003e\"Weren\u0027t for what?\"\u003c/p\u003e\n\u003cp\u003e\"This is where it becomes a little bizarre,\" he said. \"The baron\u0027s soldiers watched the fight from their tower, and I had only just decided to go inside the fortress to find out where Faith was when the drawbridge was lowered and a procession came out. Your wife\u0027s mother was leading the soldiers.\"\u003c/p\u003e\n\u003cp\u003eQuinlan paused to smile before he continued. \"Her Gaelic is worse than Lady Brenna\u0027s,\" he said. \"Her soldiers were armed, of course, but it didn\u0027t take long for me to realize they meant only to protect their mistress. I understand where your wife gets her courage. Her mother dismounted, demanded to know who was in charge, but before I could tell her, she spotted Donovan and went over to him. Needless to say, your soldier didn\u0027t want her to touch him. It didn\u0027t matter to her though. She had her supplies with her and cleaned and stitched his injury for him.\"\u003c/p\u003e\n\u003cp\u003e\"And what were you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Answering her questions about your wife. I assumed she was worried about her, but she insisted she wasn\u0027t worried at all. She explained that if Brenna had been in serious trouble, she would have sent her medallion to one of her sisters or brothers. Because she didn\u0027t, her mother knew she was safe. She was worried about you, though, and sent a message to you.\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Treat her well or answer to her family. They had all heard what happened to Lady Brenna\u0027s escort, of course, and she assured me the baron hadn\u0027t realized what a monster the laird was. Oh, and you\u0027re going to love this. You have his gratitude for rescuing his daughter.\"\u003c/p\u003e\n\u003cp\u003eConnor shook his head. An Englishman\u0027s gratitude? What in thunder was he supposed to make of that?\u003c/p\u003e\n\u003cp\u003e\"What about Faith?\"\u003c/p\u003e\n\u003cp\u003e\"She has vanished. Her mother was worried until MacNare\u0027s soldiers showed up. They had no advance warning, she explained, and they searched every corner of the keep looking for her. The mother believes someone came to her assistance. She thinks she knows who the savior is too.\"\u003c/p\u003e\n\u003cp\u003e\"Who is he?\"\u003c/p\u003e\n\u003cp\u003e\"You.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t she wonder then why you were there instead of me?\"\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t seem to.\"\u003c/p\u003e\n\u003cp\u003e\"What am I going to tell my wife, Quinlan? I can\u0027t continue to keep her in the dark about her sister.\u003c/p\u003e\n\u003cp\u003eEventually she\u0027ll find out from someone else. Gossip travels like the wind in the Highlands.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be right about that. In fact, it sounds as if someone heard about this situation and got to Faith before we did. I doubt it was one of her brothers. He wouldn\u0027t let his mother worry so. He\u0027d tell her, wouldn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"I would assume so. There\u0027s only one other man I can think of who would go to such trouble on Brenna\u0027s behalf.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"My brother. This sounds like something he would do, doesn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"He hates England.\"\u003c/p\u003e\n\u003cp\u003e\"But he\u0027s fond of my wife,\" Connor said. \"I must talk to him before I tell Brenna anything. God willing, Alec has her sister tucked away somewhere. Did you have anything else to report?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"Mi\u0027lady\u0027s mother sent gifts for her daughter, and she…\"\u003c/p\u003e\n\u003cp\u003e\"And she what?\" he asked, wondering over his hesitation.\u003c/p\u003e\n\u003cp\u003e\"She kissed me on the cheek. I didn\u0027t want to shove her away. She\u0027s mi\u0027lady\u0027s mother, after all, but I…\u003c/p\u003e\n\u003cp\u003eThis isn\u0027t funny, Connor. It was awkward. She told me the kiss was for her daughter and she expects me to… give it to her.\"\u003c/p\u003e\n\u003cp\u003e\"She wants you to kiss my wife?\" Connor wasn\u0027t laughing now.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to.\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not.\"\u003c/p\u003e\n\u003cp\u003eThe conversation ended then and there. The two warriors rode to the southwestern tip of the border where the latest attack had occurred.\u003c/p\u003e\n\u003cp\u003eAeden arrived an hour later. Shouting at his laird, he dismounted and came running.\u003c/p\u003e\n\u003cp\u003e\"Your wife is fine, Laird,\" he blurted out. \"But there was trouble.\"\u003c/p\u003e\n\u003cp\u003eConnor stood perfectly still and didn\u0027t say a word until Aeden had recounted everything that had happened. The soldier also repeated every word Brenna had said, and by the time he finished, Connor was in such a rage, he was shaking with it.\u003c/p\u003e\n\u003cp\u003e\"Where is my wife now?\"\u003c/p\u003e\n\u003cp\u003e\"With the Kincaids. Crispin\u0027s with her. He put Donald in charge of the keep.\"\u003c/p\u003e\n\u003cp\u003e\"Is Brenna all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she is.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re certain?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m certain.\"\u003c/p\u003e\n\u003cp\u003eConnor tried to push his fear aside so he could concentrate. \"And Euphemia?\" he asked, his manner deadly calm now, for on the surface, he appeared to be in complete control.\u003c/p\u003e\n\u003cp\u003e\"Crispin expects her to take her son\u0027s body back north for burial.\"\u003c/p\u003e\n\u003cp\u003e\"Is Brenna…\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s fine,\" Aeden told him once again. \"I wouldn\u0027t lie to you. She\u0027s needing stitches, and she was badly beaten, but she\u0027s going to survive. The women wanted to go with her. Donald had his hands full making them stay inside the fortress.\"\u003c/p\u003e\n\u003cp\u003eIt took all of Connor\u0027s strength not to double over and let out a roar of anguish. He should have been with her. He should have known what was happening. The bastard. He dared to touch her.\u003c/p\u003e\n\u003cp\u003e\"Laird, what would you like me to do?\" Aeden asked.\u003c/p\u003e\n\u003cp\u003eConnor made himself think about the problems at hand. Aeden had to repeat his question a second time before his laird could answer him.\u003c/p\u003e\n\u003cp\u003eHe called to Douglas, the senior of the soldiers guarding the border and told him he was in charge.\u003c/p\u003e\n\u003cp\u003e\"Move the last of Hugh\u0027s clan tonight. As soon as you\u0027re finished, all of the MacAlisters are to return home. Aeden will assist you.\"\u003c/p\u003e\n\u003cp\u003e\"And you, Laird?\" the soldier asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to my wife. Quinlan, take over the watch at home until I get back.\"\u003c/p\u003e\n\u003cp\u003eQuinlan stayed by Connor\u0027s side while the other soldier ran to do his laird\u0027s bidding.\u003c/p\u003e\n\u003cp\u003eConnor suddenly called out to Aeden. \"She told my wife to submit to him?\" he roared. He didn\u0027t wait for a second confirmation but caught hold of his horse\u0027s reins, swung up on his back, and took off at a full gallop.\u003c/p\u003e\n\u003cp\u003eQuinlan followed him. His plan was to protect his laird\u0027s back until they reached the point where he would have to turn north for home, while Connor continued on to the Kincaids.\u003c/p\u003e\n\u003cp\u003eConnor took the fastest route, cutting up along the border, and when he was well away from his other soldiers, he let out a cry that sounded like a wounded animal. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-lairds-fiancees-2/page-44.html","bookId":1845,"creation":"Oct 5, 2019 3:36:47 PM","modification":"Oct 5, 2019 3:36:47 PM"}
