{"id":20585,"no":10,"title":"CHAPTER IX. A PLEASANT DISCOVERY.","content":"\u0026nbsp;The night wore away, and still Mark, the match boy, continued to sleep soundly in the corner of the cabin where he had established himself. One of the boat hands passing through noticed him, and was on the point of waking him, but, observing his weary look and thin attire, refrained from an impulse of compassion. He had a boy of about the same age, and the thought came to him that some time his boy might be placed in the same situation, and this warmed his heart towards the little vagrant. \n\u003cdiv\u003e\n \"I suppose I ought to wake him up,\" he reflected, \"but he isn\u0027t doing any harm there, and he may as well have his sleep out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n So Mark slept on,—a merciful sleep, in which he forgot his poverty and friendless condition; a sleep which brought new strength and refreshment to his limbs.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he woke up it was six o\u0027clock in the morning. But it was quite dark still, for it was in December, and, so far as appearances went, it might have been midnight. But already sleepy men and boys were on their way to the great city to their daily work. Some were employed a considerable distance up town, and must be at their posts at seven. Others were employed in the markets and must be stirring at an early hour. There were keepers of street-stands, who liked to be ready for the first wave in the tide of daily travel that was to sweep without interruption through the city streets until late at night. So, altogether, even at this early hour there was quite a number of passengers.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark rubbed his eyes, not quite sure where he was, or how he got there. He half expected to hear the harsh voice of Mother Watson, which usually aroused him to his daily toil. But there was no Mother Watson to be seen, only sleepy, gaping men and boys, clad in working dresses.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark sat up and looked around him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, young chap, you\u0027ve had a nap, haven\u0027t you?\" said a man at his side, who appeared, from a strong smell of paint about his clothes, to be a journeyman painter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Mark. \"Is it morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To be sure it is. What did you expect it was?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ve been sleeping all night,\" said the match boy, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In that corner?\" asked the painter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Mark; \"I came aboard last night, and fell asleep, and that\u0027s the last I remember.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It must be rather hard to the bones,\" said the painter. \"I think that I should prefer a regular bed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do feel rather sore,\" said the match boy; \"but I slept bully.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little chap like you can curl up anywhere. I don\u0027t think I could sleep very well on these seats. Haven\u0027t you got any home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Mark, \"a sort of a home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why didn\u0027t you sleep at home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I knew I should get a beating if I went home without twenty-five cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that\u0027s hard luck. I wonder how I should feel,\" he continued, laughing, \"if my wife gave me a beating when I came home short of funds.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But here the usual bump indicated the arrival of the boat at the slip, and all the passengers, the painter included, rose, and hurried to the edge of the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n With the rest went Mark. He had no particular object in going thus early; but his sleep was over, and there was no inducement to remain longer in the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n The rain was over also. The streets were still wet from the effects of the quantity that had fallen, but there was no prospect of any more. Mark\u0027s wet clothes had dried in the warm, dry atmosphere of the cabin, and he felt considerably better than on the evening previous.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, however, he could not help wondering what Mother Watson had thought of his absence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027ll be mad, I know,\" he thought. \"I suppose she\u0027ll whip me when I get back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This certainly was not a pleasant thought. The leather strap was an old enemy of his, which he dreaded, and with good reason. He was afraid that he would get a more severe beating, for not having returned the night before, at the hands of the angry old woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I didn\u0027t live with Mother Watson,\" he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n Straight upon this thought came another.\" Why should he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mother Watson had no claim upon him. Upon his mother\u0027s death she had assumed the charge of him, but, as it turned out, rather for her own advantage than his. She had taken all his earnings, and given him in return a share of her miserable apartment, a crust of bread or two, daily seasoned with occasional assaults with the leather strap. It had never occurred to Mark before, but now for the first time it dawned upon him that he had the worst of the bargain. He could live more comfortably by retaining his earnings, and spending them upon himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark was rather a timid, mild-mannered boy, or he would sooner have rebelled against the tyranny and abuse of Mother Watson. But he had had little confidence in himself, and wanted somebody to lean on. In selecting the old woman, who had acted thus far as his guardian, he had leaned upon a broken reed. The last night\u0027s experience gave him a little courage. He reflected that he could sleep in the Newsboys\u0027 Lodging House for five cents, or on the ferry-boat again for two, while the fare at his old home was hardly so sumptuous but that he could obtain the same without very large expense.\n\u003c/div\u003e \n\u003cdiv\u003e\n So Mark thought seriously of breaking his yoke and declaring himself free and independent. A discovery which he made confirmed him in his half-formed resolution.\n\u003c/div\u003e \n\u003cdiv\u003e\n He remembered that after paying his toll he had eight cents left, which he had placed in his vest-pocket. He thought that these would enable him to get some breakfast, and drew them out. To his astonishment there were two silver half-dollars mingled with the coppers. Mark opened his eyes wide in astonishment. Where could they have come from? Was it possible that the tollman had given him them by mistake for pennies? That could not be, for two reasons: First, he remembered looking at the change as it was handed him, and he knew that there were no half-dollars among them. Again, the eight pennies were all there, the silver coins making the number ten.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was certainly very strange and surprising, and puzzled Mark not a little. We, who know all about it, find the explanation very easy, but to the little match boy it was an unfathomable mystery.\n\u003c/div\u003e \n\u003cdiv\u003e\n The surprise, however, was of an agreeable character. With so much money in his possession, Mark felt like a man with a handsome balance at his banker\u0027s, and with the usual elasticity of youth he did not look forward to the time when this supply would be exhausted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t go back to Mother Watson,\" he determined. \"She\u0027s beaten me times enough. I\u0027ll take care of myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n While these thoughts were passing through his mind, he had walked up Fulton Street, and reached the corner of Nassau. Here he met his friend of the night before, Ben Gibson.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben looked rather sleepy. He had been at the Old Bowery Theatre the night before until twelve o\u0027clock, and, having no money left to invest in a night\u0027s lodging, he had crept into a corner of the \"Times\" printing office, and slept, but had not quite slept off his fatigue.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hallo, young \u0027un!\" said he. \"Where did you come from?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From Fulton Ferry,\" said Mark. \"I slept on the boat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you? How\u0027d you like it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Pretty good,\" said Mark. \"It was rather hard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How\u0027d you make out begging?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not very well. I got ten cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So you didn\u0027t dare to go home to the old woman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shan\u0027t go home there any more,\" said the match boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bully for you! I like your pluck. I wouldn\u0027t go back and get a licking, if I were you. What\u0027ll Mother Watson say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027ll be mad, I expect,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Keep a sharp lookout for her. I\u0027ll tell you what you can do: stay near me, and if she comes prowlin\u0027 round I\u0027ll manage her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Could you?\" said Mark, quickly, who, from certain recollections, had considerable fear of his stout tyrant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may just bet on that. What you goin\u0027 to do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I shall go and get some breakfast,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So would I, if I had any tin; but I\u0027m dead broke,—spent my last cent goin\u0027 to the Old Bowery. I\u0027ll have to wait till I\u0027ve had one or two shines before I can eat breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you hungry?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll bet I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because,\" said Mark, hesitating, \"I\u0027ll lend you money enough for breakfast, and you can pay me when you earn it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You lend me money!\" exclaimed Ben, in astonishment. \"Why, you haven\u0027t got but eight cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I have,\" said Mark, producing the two half-dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where\u0027d you get them?\" asked the boot-black, in unfeigned surprise, looking at Mark as if he had all at once developed into an Astor or a Stewart. \"You haven\u0027t been begging this morning, have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said the match boy, \"and I don\u0027t mean to beg again if I can help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then where\u0027d you get the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t know! You haven\u0027t been stealin\u0027, have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark disclaimed the imputation indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you found a pocket-book?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I didn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then where did you get the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know any more than you do. When I went to sleep on the boat I didn\u0027t have it, but this morning when I felt in my pocket it was there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s mighty queer,\" said Ben, whistling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s good money, aint it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Try it and see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ben tossed up one of the coins. It fell with a clear, ringing sound on the sidewalk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that\u0027s good,\" he said. \"I just wish somebody\u0027d treat me that way. Maybe it\u0027s the vest? If \u0027tis I\u0027d like to buy it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think it\u0027s that,\" said Mark, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Anyway you\u0027ve got the money. I\u0027ll borrow twenty cents of you, and we\u0027ll go and get some breakfast.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2990/82467.html","bookId":322,"creation":"Aug 2, 2019 11:52:29 AM","modification":"Aug 2, 2019 11:52:29 AM"}
