{"id":20581,"no":6,"title":"CHAPTER V. INTRODUCES MARK, THE MATCH BOY.","content":"\u0026nbsp;It was growing dark, though yet scarcely six o\u0027clock, for the day was one of the shortest in the year, when a small boy, thinly clad, turned down Frankfort Street on the corner opposite French\u0027s Hotel. He had come up Nassau Street, passing the \"Tribune\" Office and the old Tammany Hall, now superseded by the substantial new \"Sun\" building. \n\u003cdiv\u003e\n He had a box of matches under his arm, of which very few seemed to have been sold. He had a weary, spiritless air, and walked as if quite tired. He had been on his feet all day, and was faint with hunger, having eaten nothing but an apple to sustain his strength. The thought that he was near his journey\u0027s end did not seem to cheer him much. Why this should be so will speedily appear.\n\u003c/div\u003e \n\u003cdiv\u003e\n He crossed William Street, passed Gold Street, and turned down Vandewater Street, leading out of Frankfort\u0027s Street on the left. It is in the form of a short curve, connecting with that most crooked of all New York avenues, Pearl Street. He paused in front of a shabby house, and went upstairs. The door of a room on the third floor was standing ajar. He pushed it open, and entered, not without a kind of shrinking.\n\u003c/div\u003e \n\u003cdiv\u003e\n A coarse-looking woman was seated before a scanty fire. She had just thrust a bottle into her pocket after taking a copious draught therefrom, and her flushed face showed that this had long been a habit with her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, Mark, what luck to-night?\" she said, in a husky voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t sell much,\" said the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t sell much? Come here,\" said the woman, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark came up to her side, and she snatched the box from him, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only three boxes gone?\" she repeated. \"What have you been doing all day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She added to the question a coarse epithet which I shall not repeat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I tried to sell them, indeed I did, Mother Watson, indeed I did,\" said the boy, earnestly, \"but everybody had bought them already.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t try,\" said the woman addressed as Mother Watson. \"You\u0027re too lazy, that\u0027s what\u0027s the matter. You don\u0027t earn your salt. Now give me the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark drew from his pocket a few pennies, and handed to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n She counted them over, and then, looking up sharply, said, with a frown,\"There\u0027s a penny short. Where is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was so hungry,\" pleaded Mark, \"that I bought an apple,—only a little one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You bought an apple, did you?\" said the woman, menacingly. \"So that\u0027s the way you spend my money, you little thief?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was so faint and hungry,\" again pleaded the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What business had you to be hungry? Didn\u0027t you have some breakfast this morning?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had a piece of bread.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s more than you earned. You\u0027ll eat me out of house and home, you little thief! But I\u0027ll pay you off. I\u0027ll give you something to take away your appetite. You won\u0027t be hungry any more, I reckon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She dove her flabby hand into her pocket, and produced a strap, at which the boy gazed with frightened look.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t beat me, Mother Watson,\" he said, imploringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll beat the laziness out of you,\" said the woman, vindictively. \"See if I don\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She clutched Mark by the collar, and was about to bring the strap down forcibly upon his back, ill protected by his thin jacket, when a visitor entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Mrs. Watson?\" asked the intruder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s you, Mrs. Flanagan?\" said the woman, holding the strap suspended in the air. \"I\u0027ll tell you what\u0027s the matter. This little thief has come home, after selling only three boxes of matches the whole day, and I find he\u0027s stole a penny to buy an apple with. It\u0027s for that I\u0027m goin\u0027 to beat him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, let him alone, the poor lad,\" said Mrs. Flanagan, who was a warm-hearted Irish woman. \"Maybe he was hungry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why didn\u0027t he work? Them that work can eat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe people didn\u0027t want to buy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I can\u0027t afford to keep him in his idleness,\" said Mrs. Watson. \"He may go to bed without his supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If he can\u0027t sell his matches, maybe people would give him something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Watson evidently thought favorably of this suggestion, for, turning to Mark, she said, \"Go out again, you little thief, and mind you don\u0027t come in again till you\u0027ve got twenty-five cents to bring to me. Do you mind that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mark listened, but stood irresolute:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t like to beg,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t like to beg!\" screamed Mrs. Watson. \"Do you mind that, now, Mrs. Flanagan? He\u0027s too proud to beg.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother told me never to beg if I could help it,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you can\u0027t help it,\" said the woman, flourishing the strap in a threatening manner. \"Do you see this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you\u0027ll feel it too, if you don\u0027t do as I tell you. Go out now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m so hungry,\" said Mark; \"won\u0027t you give me a piece of bread?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not a mouthful till you bring back twenty-five cents. Start now, or you\u0027ll feel the strap.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy left the room with a slow step, and wearily descended the stairs. I hope my young readers will never know the hungry craving after food which tormented the poor little boy as he made his way towards the street. But he had hardly reached the foot of the first staircase when he heard a low voice behind him, and, turning, beheld Mrs. Flanagan, who had hastily followed after him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you very hungry?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I\u0027m faint with hunger.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Poor boy!\" she said, compassionately; \"come in here a minute.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She opened the door of her own room which was just at the foot of the staircase, and gently pushed him in.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a room of the same general appearance as the one above, but was much neater looking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Biddy Flanagan isn\u0027t the woman to let a poor motherless child go hungry when she\u0027s a bit of bread or meat by her. Here, Mark, lad, sit down, and I\u0027ll soon bring you something that\u0027ll warm up your poor stomach.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n She opened a cupboard, and brought out a plate containing a small quantity of cold beef, and two slices of bread.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s some better mate than you\u0027ll get of Mother Watson. It\u0027s cold, but it\u0027s good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She never gives me any meat at all,\" said Mark, gazing with a look of eager anticipation at the plate which to his famished eye looked so inviting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll be bound she don\u0027t,\" said Mrs. Flanagan. \"Talk of you being lazy! What does she do herself but sit all day doing nothin\u0027 except drink whiskey from the black bottle! She might get washin\u0027 to do, as I do, if she wanted to, but she won\u0027t work. She expects you to get money enough for both of you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Mrs. Flanagan had poured out a cup of tea from an old tin teapot that stood on the stove.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, drink that, Mark dear,\" she said. \"It\u0027ll warm you up, and you\u0027ll need it this cold night, I\u0027m thinkin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The tea was not of the best quality, and the cup was cracked and discolored; but to Mark it was grateful and refreshing, and he eagerly drank it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it good?\" asked the sympathizing woman, observing with satisfaction the eagerness with which it was drunk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it makes me feel warm,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s better nor the whiskey Mother Watson drinks,\" said Mrs. Flanagan. \"It won\u0027t make your nose red like hers. It would be a sight better for her if she\u0027d throw away the whiskey, and take to the tea.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very kind, Mrs. Flanagan,\" said Mark, rising from the table, feeling fifty per cent. better than when he sat down.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh bother now, don\u0027t say a word about it! Shure you\u0027re welcome to the bit you\u0027ve eaten, and the little sup of tea. Come in again when you feel hungry and Bridget Flanagan won\u0027t be the woman to send you off hungry if she\u0027s got anything in the cupboard.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish Mother Watson was as good as you are,\" said Mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I aint so good as I might be,\" said Mrs. Flanagan; \"but I wouldn\u0027t be guilty of tratin\u0027 a poor boy as that woman trates you, more shame to her! How came you with her any way? She aint your mother, is she.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Mark, shuddering at the bare idea. \"My mother was a good woman, and worked hard. She didn\u0027t drink whiskey. Mother was always kind to me. I wish she was alive now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When did she die, Mark dear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s going on a year since she died. I didn\u0027t know what to do, but Mother Watson told me to come and live with her, and she\u0027d take care of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sorra a bit of kindness there was in that,\" commented Mrs. Flanagan. \"She wanted you to take care of her. Well, and what did she make you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She sent me out to earn what I could. Sometimes I would run on errands, but lately I have sold matches.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it hard work sellin\u0027 them?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sometimes I do pretty well, but some days it seems as if nobody wanted any. To-day I went round to a great many offices, but they all had as many as they wanted, and I didn\u0027t sell but three boxes. I tried to sell more, indeed I did, but I couldn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt you did, Mark, dear. It\u0027s cold you must be in that thin jacket of yours this cold weather. I\u0027ve got a shawl you may wear if you like. You\u0027ll not lose it, I know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n But Mark had a boy\u0027s natural dislike to being dressed as a girl, knowing, moreover, that his appearance in the street with Mrs. Flanagan\u0027s shawl would subject him to the jeers of the street boys. So he declined the offer with thanks, and, buttoning up his thin jacket, descended the remaining staircase, and went out again into the chilling and uninviting street. A chilly, drizzling rain had just set in, and this made it even more dreary than it had been during the day.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2990/82463.html","bookId":322,"creation":"Aug 2, 2019 11:52:29 AM","modification":"Aug 2, 2019 11:52:29 AM"}
