{"id":71022,"no":22,"title":"Page 22","content":"\u003cp\u003e“All right,” Spencer answered. These were the first non-hostile words he’d said to her in days.\u003c/p\u003e\n\u003cp\u003eLight reflected off her dad’s platinum Rolex. His face looked almost…repentant. “I picked up some of those cinnamon buns you like. I’m heating them up a little.”\u003c/p\u003e\n\u003cp\u003eSpencer blinked. As soon as he said it, she could smell them in the oven. Her dad knew the cinnamon rolls from the Struble Bakery were Spencer’s favorite food in the world. The bakery was a hike from his law office and he rarely had time to get them. It was clearly a sticky-bun olive branch.\u003c/p\u003e\n\u003cp\u003e“Melissa tells us you’re taking someone to Foxy,” he said. “Anyone we know?”\u003c/p\u003e\n\u003cp\u003e“Andrew Campbell,” Spencer answered.\u003c/p\u003e\n\u003cp\u003eMr. Hastings raised an eyebrow. “Class president Andrew Campbell?”\u003c/p\u003e\n\u003cp\u003e“Yes.” It was a touchy subject. Andrew had beat out Spencer for the post; her parents had seemed devastated that she’d lost. Melissa had been class president, after all.\u003c/p\u003e\n\u003cp\u003eMr. Hastings looked pleased. Then he lowered his eyes. “Well, it’s good that you’re…I mean, I’m glad this mess is over.”\u003c/p\u003e\n\u003cp\u003eSpencer hoped her cheeks weren’t bright red. “Um…what does Mom think?”\u003c/p\u003e\n\u003cp\u003eHer dad gave her a little smile. “She’ll come around.” He patted the door frame, then continued down the hall. Spencer felt guilty and weird. The cinnamon buns baking downstairs almost smelled like they were burning.\u003c/p\u003e\n\u003cp\u003eHer cell phone rang, startling her. She dove for it.\u003c/p\u003e\n\u003cp\u003e“Hey there.” Wren sounded happy and boisterous when she picked up, which instantly irritated Spencer. “What’s up?”\u003c/p\u003e\n\u003cp\u003e“Where have you been?” Spencer demanded.\u003c/p\u003e\n\u003cp\u003eWren paused. “Some school friends and I are hanging out before our shift today.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you call earlier?”\u003c/p\u003e\n\u003cp\u003eWren paused. “It was loud in the bar.” His voice became distant, annoyed.\u003c/p\u003e\n\u003cp\u003eSpencer clenched up her fists. “I’m sorry,” she said. “I think I’m a little stressed.”\u003c/p\u003e\n\u003cp\u003e“Spencer Hastings, stressed?” She could tell Wren was smiling. “Why?”\u003c/p\u003e\n\u003cp\u003e“Econ paper,” she sighed. “It’s impossible.”\u003c/p\u003e\n\u003cp\u003e“Ugh,” Wren said. “Blow it off. Come meet me.”\u003c/p\u003e\n\u003cp\u003eSpencer paused. Her notes were scattered haphazardly across her desk. On the floor was this week’s quiz. The B minus glowed like a neon sign. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“All right,” Wren groaned. “So tomorrow, then? Can I have you all day?”\u003c/p\u003e\n\u003cp\u003eSpencer bit the inside of her cheek. “I can’t tomorrow, either. I…I have to go to this benefit thing. I’m going with this boy from school.”\u003c/p\u003e\n\u003cp\u003e“A date?”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you ask me?”\u003c/p\u003e\n\u003cp\u003eSpencer frowned. “It’s not like I like him. He’s just this kid from school. But, I mean, I won’t, if you don’t want me to.”\u003c/p\u003e\n\u003cp\u003eWren chuckled. “I’m just giving you a hard time. Go to your charity thing. Have a blast. We can hang out on Sunday.” Then he said he had to run—he needed to get to his shift at the hospital. “Good luck with your work,” he added. “I’m sure you’ll figure it out.”\u003c/p\u003e\n\u003cp\u003eSpencer stared wistfully at the CALL ENDED window on her phone’s screen. Their conversation had lasted a whopping one minute and forty-six seconds. “Of course I’ll figure it out,” she whispered to the phone. With about a week’s extension.\u003c/p\u003e\n\u003cp\u003eAs she passed her computer, she noticed a new e-mail at the top of her inbox. It had come in about five minutes ago, while she was talking to her father.\u003c/p\u003e\n\u003cp\u003eWant the easy A? I think you know where to find it. —A\u003c/p\u003e\n\u003cp\u003eSpencer’s stomach tightened. She glanced out the window, but there was no one on her lawn. Then she stuck her head outside, checking to see if someone had installed a surveillance camera or put in a mini microphone. But all she saw was her house’s grayish-brown stone exterior.\u003c/p\u003e\n\u003cp\u003eMelissa kept her high school papers on the family computer. She was as anal as Spencer, and saved everything. Spencer wouldn’t even have to ask Melissa for permission to look at the papers—they were on the shared drive.\u003c/p\u003e\n\u003cp\u003eBut how the hell did A know that?\u003c/p\u003e\n\u003cp\u003eIt was tempting. Except…no. Anyway, Spencer doubted A wanted to help her. Was this an elaborate trap? Could A be Melissa?\u003c/p\u003e\n\u003cp\u003e“Spencer?” her mother called from downstairs. “Dinner!”\u003c/p\u003e\n\u003cp\u003eSpencer minimized the e-mail and walked absentmindedly to the door. The thing was, if she took Melissa’s paper, she’d have time to finish her other homework and see Wren. She could switch some words…use the thesaurus…. She’d never do it again.\u003c/p\u003e\n\u003cp\u003eHer computer made another ting, and she turned back.\u003c/p\u003e\n\u003cp\u003eP.S. You hurt me, so I’m going to hurt you. Or maybe I should hurt a certain new boyfriend instead? You guys better watch out—I’ll show up when you least expect it. —A\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eSOME SECRET ADMIRER…\u003c/p\u003e\n\u003cp\u003eFriday afternoon, Hanna sat on the soccer bleachers, watching the Rosewood Day boys’ team battle Lansing Prep. Only she couldn’t really focus. Her normally manicured fingernails were ragged, the skin around her thumbs was bleeding from nervous picking, and her eyes had become so red from sleeplessness, it looked like she had pinkeye. She should have been hiding at home. Sitting on the bleachers was way too public.\u003c/p\u003e\n\u003cp\u003eI’m watching you, A had said. You’d better do what I say.\u003c/p\u003e\n\u003cp\u003eBut maybe it was like what politicians said about terrorist attacks: If you holed up in your house, afraid they were going to strike, it would mean the terrorists had won. She would sit here and watch soccer, like she had all last year and the year before that.\u003c/p\u003e\n\u003cp\u003eBut then Hanna looked around. That someone really, truly knew about The Jenna Thing—and was poised to blame her—terrified her. And what if A really did tell her dad? Not now. Not when things might be getting better.\u003c/p\u003e\n\u003cp\u003eShe craned her neck for the millionth time toward the commons, looking for Mona. Watching the boys’ games was a little Hanna-Mona tradition; they mixed SoCo with syrupy Diet Dr Peppers from the concession stand and yelled sexy insults at the away team. But Mona was AWOL. Since their weird fight at the mall yesterday, Hanna and Mona hadn’t spoken.\u003c/p\u003e\n\u003cp\u003eHanna caught a glimpse of a blond ponytail and a loose red braid and cringed. Riley and Naomi had arrived, and had climbed up to a spot not that far away from Hanna. Today, both girls carried matching patent leather Chanel bags and wore obviously brand-spanking-new swingy tweed coats, as if it were actually a chilly fall day and not still a summery seventy-five degrees. When they looked in Hanna’s direction, Hanna quickly pretended to be fascinated with the soccer game, even though she had no idea what the score was.\u003c/p\u003e\n\u003cp\u003e“Hanna looks fat in that outfit,” she overheard Riley whisper.\u003c/p\u003e\n\u003cp\u003eHanna felt her cheeks heat up. She stared at the way her cotton C\u0026amp;C California top gently stretched against her midsection. She probably was getting fatter, with all the nervous eating she’d been doing this week. It was just that she was really trying to resist the urge to throw it all up—although, that was what she wanted to do right now.\u003c/p\u003e\n\u003cp\u003eThe teams broke for halftime, and the Rosewood Day boys trotted to their bench. Sean flopped down on the grass and started massaging his calf. Hanna saw her chance and clomped down the bleacher’s metallic seats. Yesterday, after A texted her, she hadn’t called Sean to tell him she wasn’t going to Foxy. She’d been too shell-shocked.\u003c/p\u003e\n\u003cp\u003e“Hanna,” Sean said, seeing her standing over him. “Hey.” He looked beautiful today as usual, despite his shirt being sweat-stained and his face a teensy bit unshaven. “How are you?”\u003c/p\u003e\n\u003cp\u003eHanna sat down next to him, tucking her legs under her and arranging her pleated uniform skirt around her so all the soccer players couldn’t see her undies. “I’m…” She swallowed hard, trying not to burst into tears. Losing my mind. Being tortured by A. “So, um, listen.” She clasped her hands together. “I’m not going to Foxy.”\u003c/p\u003e\n\u003cp\u003e“Really?” Sean cocked his head. “Why not? Are you okay?”\u003c/p\u003e\n\u003cp\u003eHanna ran her hands through the closely cropped, sweet-smelling soccer field grass. She’d told Sean the same story she’d told Mona—that her father had died. “It’s…complicated. But, um, I thought I should tell you.”\u003c/p\u003e\n\u003cp\u003eSean unfastened the Velcro on his shin guard and then tightened it up again. For a brief second, Hanna got a glimpse of his perfect, sinewy calves. For whatever reason, she thought they were the sexiest part of his body. “I might not go, either,” he said.\u003c/p\u003e\n\u003cp\u003e“Really?” she asked, startled.\u003c/p\u003e\n\u003cp\u003eSean shrugged. “All my friends are going with dates. I’d be the odd guy out.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Hanna moved her legs out of the way so the soccer coach, who was staring at his clipboard, could pass by. She resisted smacking herself. Did that mean Sean had thought of her as his date?\u003c/p\u003e\n\u003cp\u003eSean shaded his eyes and stared at her. “Are you all right? You seem…sad.”\u003c/p\u003e\n\u003cp\u003eHanna cupped her hands over her bare knees. She needed to talk to someone about A. Except there was no way. “I’m just tired.” She sighed.\u003c/p\u003e\n\u003cp\u003eSean touched Hanna’s wrist lightly. “Listen. Maybe some night next week, let’s get dinner. I don’t know…. We probably should talk about stuff.”\u003c/p\u003e\n\u003cp\u003eHanna’s heart did a tiny leap. “Sure. That sounds nice.”\u003c/p\u003e\n\u003cp\u003e“Cool.” Sean smiled, standing up. “See you later, then.”\u003c/p\u003e\n\u003cp\u003eThe band started playing the Rosewood Day fight song, signaling that the team’s break was over. Hanna climbed back to the top of the bleachers, feeling a little better. As she returned to her seat, Riley and Naomi were looking at her curiously.\u003c/p\u003e\n\u003cp\u003e“Hanna!” Naomi cried, when Hanna met her gaze. “Hi!”\u003c/p\u003e\n\u003cp\u003e“Hey,” Hanna said, mustering up as much fake-sweetness as she could.\u003c/p\u003e\n\u003cp\u003e“Were you talking to Sean?” Naomi ran her hand through her blond ponytail. She was always obsessively petting her hair. “I thought you guys had a bad breakup.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t a bad breakup,” Hanna said. “We’re still friends…and whatever.”\u003c/p\u003e\n\u003cp\u003eRiley let out a little laugh. “And you broke up with him, right?”\u003c/p\u003e\n\u003cp\u003eHanna’s stomach lurched. Had someone said something? “That’s right.”\u003c/p\u003e\n\u003cp\u003eNaomi and Riley exchanged a look. Then Naomi said, “Are you going to Foxy?”\u003c/p\u003e\n\u003cp\u003e“Actually, no,” Hanna said haughtily. “I’m meeting my father at Le Bec-Fin.”\u003c/p\u003e\n\u003cp\u003e“Ooh.” Naomi winced. “I heard Le Bec-Fin was, like, the place people take people when they don’t want to be seen.”\u003c/p\u003e\n\u003cp\u003e“No, it’s not.” Heat rose to Hanna’s face. “It’s, like, the best restaurant in Philly.” She started to panic. Had Le Bec-Fin changed?\u003c/p\u003e\n\u003cp\u003eNaomi shrugged, her face impassive. “It’s just what I’ve heard, is all.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Riley widened her brown eyes. “Everyone knows that.”\u003c/p\u003e\n\u003cp\u003eSuddenly, Hanna noticed a piece of paper sitting next to her on the bleachers. It was folded in the shape of an airplane and weighed down with a rock. \u003c/p\u003e","sourceLink":"https://allnovel.net/flawless-pretty-little-liars-2/page-22.html","bookId":2379,"creation":"Oct 5, 2019 10:19:05 AM","modification":"Oct 5, 2019 10:19:05 AM"}
