{"id":71028,"no":28,"title":"Page 28","content":"\u003cp\u003eShe ran into the main tent and looked around; she at least owed Andrew an apology. The whole place was lit by candles, however, so it was hard to find anyone. She could just make out Noel and the Quaker school girl on the dance floor, sneaking drinks out of Noel’s flask. Naomi Zeigler and James Freed were now onstage, singing some Avril Lavigne song Spencer couldn’t stand. Mason Byers and Devon Arliss leaned in to kiss. Kirsten Cullen and Bethany Wells whispered in the corner.\u003c/p\u003e\n\u003cp\u003e“Andrew?” she called.\u003c/p\u003e\n\u003cp\u003eThen Spencer noticed Emily across the room. She wore a strapless pink dress and had a pink pashmina thrown over her shoulders. Spencer took a few steps toward her, but then noticed her date standing next to her, his hand on her arm. Just as Spencer squinted to get a better look, the guy turned his head and noticed her. He had dark, denim-blue eyes, the same exact color they’d been in her dream.\u003c/p\u003e\n\u003cp\u003eSpencer gasped and stepped back.\u003c/p\u003e\n\u003cp\u003eI’ll show up when you least expect it.\u003c/p\u003e\n\u003cp\u003eIt was Toby.\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003eARIA IS AVAILABLE BY PRESCRIPTION ONLY\u003c/p\u003e\n\u003cp\u003eAria leaned against the Foxy bar and ordered a cup of black coffee. It was so crowded in this tent that the lining of her polka-dotted dress was already drenched with sweat. And she’d only been here for twenty minutes.\u003c/p\u003e\n\u003cp\u003e“Hey.” Her brother sidled up next to her. He wore the same gray suit he’d worn to the funeral and polished black shoes that belonged to Byron.\u003c/p\u003e\n\u003cp\u003e“Hey,” Aria squeaked, surprised. “I…I didn’t know you were coming.” By the time she’d gotten out of the shower to get ready for Foxy, the house was empty. In a moment’s confusion, she’d thought her family had abandoned her.\u003c/p\u003e\n\u003cp\u003e“Yeah. I came with…” Mike whirled around and pointed to a thin, pale girl Aria recognized from Noel Kahn’s party the week before. “Hot, huh?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Aria downed her coffee in three gulps and noticed that her hands were shaking. This was her fourth cup in an hour.\u003c/p\u003e\n\u003cp\u003e“So where’s Sean?” Mike asked. “That’s who you’re here with, right? Everyone’s talking about it.”\u003c/p\u003e\n\u003cp\u003e“They are?” Aria asked faintly.\u003c/p\u003e\n\u003cp\u003e“Yeah. You’re like the new It couple.”\u003c/p\u003e\n\u003cp\u003eAria didn’t know whether to laugh or cry. She could just picture some of the Rosewood Day girls gossiping about her and Sean. “I don’t know where he is.”\u003c/p\u003e\n\u003cp\u003e“Why? Did the It couple break up already?”\u003c/p\u003e\n\u003cp\u003e“No…” The truth was, Aria was sort of hiding from Sean.\u003c/p\u003e\n\u003cp\u003eYesterday, after Meredith told Aria that she and Byron were in love, Aria had run back to Sean and burst into tears. Never in a gazillion years had she expected Meredith to say what she said. Now that Aria knew the truth, she felt helpless. Her family was doomed. For ten minutes, she’d wailed into Sean’s shoulder, What am I going to doooooo? Sean calmed her down enough to take her home and even walked her up to her room, put her into bed, and laid her favorite stuffed animal, Pigtunia, on the pillow beside her.\u003c/p\u003e\n\u003cp\u003eAs soon as Sean left, Aria threw back the covers and paced. She peeked into the bedroom. Her mom was there, sleeping peacefully…alone. But Aria couldn’t wake her. When she woke up a few hours later, she went to her bedroom again, steeling herself to just do it, but this time, Byron was in bed beside Ella. He lay on his side, with his arm slung over Ella’s shoulder.\u003c/p\u003e\n\u003cp\u003eNow why would you cuddle, if you were in love with someone else?\u003c/p\u003e\n\u003cp\u003eIn the morning, when Aria awoke from her one big hour of sleep, her eyes were puffy and her skin had broken out in little red bumps. She felt hungover, and as she ran over the night’s events, she crawled back under her duvet in shame. Sean had tucked her in. She’d blown snot on his shoulder. She’d wailed like an insane person. What better way to lose the guy you like than slobber all over him? When Sean picked her up for Foxy—amazing that he’d even shown up at all—he immediately wanted to talk about last night, but Aria shrugged him off, saying she felt much better. Sean looked at her sort of funny, but was smart enough not to ask questions. And now she was dodging him.\u003c/p\u003e\n\u003cp\u003eMike leaned up against the wooden Foxy bar, bobbing his head when the DJ put on Franz Ferdinand. There was a self-satisfied little smile on his face—Aria knew he felt like the man for scoring a Foxy ticket, since he was only a sophomore. But she was his sister, and she could see pain and sadness underneath. It was like when they were little and hanging out at the community pool, and Mike’s friends were calling him a homo because he was wearing white swim trunks that had turned pinkish in the wash. Mike tried to take it like a man, but later, during adult swim, Aria caught him secretly crying by the baby pool.\u003c/p\u003e\n\u003cp\u003eShe wanted to say something to make him feel better. About how she was sorry for what she was going to have to tell Ella—Aria was going to tell her mom that night when she got home, no excuses—and that none of this was his fault, and if their family fell apart, it would still be okay. Somehow.\u003c/p\u003e\n\u003cp\u003eBut she knew what would happen if she tried. Mike would just run away.\u003c/p\u003e\n\u003cp\u003eAria grabbed her coffee and strode away from the bar. She just needed to be moving. “Aria,” called a voice behind her. She turned. Sean was about six feet away, near one of the tables. He looked upset.\u003c/p\u003e\n\u003cp\u003ePanicked, Aria put her drink down and dashed toward the women’s bathroom. One of her chunky wedges slid right off her foot. Jamming it back on, she kept pushing forward, only to get stuck at a wall of kids. She tried to elbow her way through, but no one was moving.\u003c/p\u003e\n\u003cp\u003e“Hey.” Sean was right next to her.\u003c/p\u003e\n\u003cp\u003e“Oh,” Aria yelled over the music, trying to act nonchalant. “Hi.”\u003c/p\u003e\n\u003cp\u003eSean took Aria by the arm and led her into the parking lot, which was the one place at Foxy that was empty. Sean retrieved his keys from the valet. He helped Aria into his car and drove to an empty spot farther down the driveway.\u003c/p\u003e\n\u003cp\u003e“What’s going on with you?” Sean demanded.\u003c/p\u003e\n\u003cp\u003e“Nothing.” Aria stared out the window. “I’m fine.”\u003c/p\u003e\n\u003cp\u003e“No, you’re not. You’re like…a zombie. It’s freaking me out.”\u003c/p\u003e\n\u003cp\u003e“I just…” Aria ran the strand of pearls she’d worn as a bracelet up and down her wrist. “I don’t know. I don’t want to bother you.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Because you don’t want to hear it. You must think I’m a complete freak. Like, I’m super-obsessed with my parents. It’s all I’ve talked about.”\u003c/p\u003e\n\u003cp\u003e“Well…it sort of has been. But I mean—”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t be mad,” she interrupted, “if you wanted to dance with other girls and whatever. There are some really cute girls here.”\u003c/p\u003e\n\u003cp\u003eSean blinked, his face blank. “But I don’t want to dance with anyone else.”\u003c/p\u003e\n\u003cp\u003eThey were quiet. The bass line of Kanye West’s “Gold Digger” pumped out of the tent.\u003c/p\u003e\n\u003cp\u003e“You thinking about your parents?” Sean asked quietly.\u003c/p\u003e\n\u003cp\u003eShe nodded. “I guess. I have to tell my mom tonight.”\u003c/p\u003e\n\u003cp\u003e“Why do you have to tell her?”\u003c/p\u003e\n\u003cp\u003e“Because…” Aria couldn’t tell him about A. “It has to be me. This can’t go on any longer.”\u003c/p\u003e\n\u003cp\u003eSean sighed. “You put a lot of pressure on yourself. Can’t you take a night off?”\u003c/p\u003e\n\u003cp\u003eAt first, Aria felt defensive, but then she leaned back. “I really think you should go back in there, Sean. You shouldn’t let me ruin your night.”\u003c/p\u003e\n\u003cp\u003e“Aria…” Sean let out a frustrated sigh. “Stop it.”\u003c/p\u003e\n\u003cp\u003eAria made a face. “I just don’t think it’s going to work out for us.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because…” She paused, trying to figure out what she wanted to say. Because she wasn’t the typical Rosewood girl? Because whatever Sean liked about her, there was so much else about her not to like? She felt like she was one of those wonder drugs that were always advertised on TV. The narrator would go through paragraphs of how the drug had helped millions of people, but at the very end of the commercial, he’d say really quietly that side effects include heart palpitations and an oily discharge. With her, it’d be like, Cool, kooky girl…but family baggage may result in psycho outbursts and randomly blowing snot on your expensive shirts.\u003c/p\u003e\n\u003cp\u003eSean carefully put his hand over Aria’s. “If you’re scared that I’m freaked about last night, I’m not. I really like you. I sort of like you more because of last night.”\u003c/p\u003e\n\u003cp\u003eTears came to Aria’s eyes. “Really?”\u003c/p\u003e\n\u003cp\u003e“Really.”\u003c/p\u003e\n\u003cp\u003eHe pressed his forehead to hers. Aria held her breath. Finally, their lips touched. Then again. Harder, this time.\u003c/p\u003e\n\u003cp\u003eAria pressed her mouth to his and grabbed the back of his neck, pulling him closer. His body felt so warm and right. Sean ran his hands up Aria’s waist. All at once, they were biting each other’s bottom lips, their hands scratching up and down each other’s backs. Then they broke away, breathing heavily and staring into each other’s eyes.\u003c/p\u003e\n\u003cp\u003eThey dove back for each other. Sean pulled at the zipper on Aria’s dress. He flung off his jacket and threw it into the backseat, and she pawed at the buttons on his shirt. She kissed Sean’s gorgeous ears and ran her hands inside his shirt, to his smooth, bare skin. He circled her waist with his hands as best he could, his body at an awkward angle on the cramped Audi seat. Sean tilted the seat back, lifted Aria up, and brought her to him. The knobs of her spine grated against the steering wheel.\u003c/p\u003e\n\u003cp\u003eShe arched her neck as Sean kissed her throat. When she opened her eyes, she saw something—a yellow piece of paper under the windshield wiper. At first she thought it was some sort of flyer—maybe a kid advertising some after-Foxy party—but then she noticed the big, bulky words, written sloppily in black Sharpie marker.\u003c/p\u003e\n\u003cp\u003eDon’t forget! Stroke of midnight!\u003c/p\u003e\n\u003cp\u003eShe jerked away from Sean.\u003c/p\u003e\n\u003cp\u003e“What is it?” he asked.\u003c/p\u003e\n\u003cp\u003eShe pointed at the note, her hands shaking. “Did you write that?” It was a stupid question, though: She already knew the answer.\u003c/p\u003e\n\u003cp\u003e28\u003c/p\u003e\n\u003cp\u003eIT’S NOT A PARTY WITHOUT HANNA MARIN\u003c/p\u003e\n\u003cp\u003eAs her taxi pulled up to Kingman Hall, Hanna threw twenty bucks at the cabdriver, an older, balding guy who seemed to have a sweating problem. “Keep it,” she said. She slammed the door and ran for the entrance, her stomach roiling. She’d bought a bag of Cool Ranch Doritos at the train station in Philly and had maniacally scarfed down the whole thing in five frantic minutes. Bad move.\u003c/p\u003e\n\u003cp\u003eTo her right was the Foxy check-in table. A whippet-thin girl with close-cropped blond hair and tons of eyeliner was collecting tickets and checking off names in her book. Hanna hesitated. She had no idea where her ticket was, but if she tried to bargain her way in, they’d just tell her to go home. She narrowed her eyes at the Foxy tent, which glowed like a birthday cake. There was no way she was letting Sean get away with this. She was getting into Foxy, whether Eyeliner Girl liked it or not.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, Hanna sprinted at top speed past the check-in table. “Hey!” she heard the girl call. “Wait!”\u003c/p\u003e\n\u003cp\u003eHanna hid behind a column, her heart beating fast. A beefy bouncer in a tux ran by her, then stopped and looked around. Frustrated and confused, he shrugged and said something into his walkie-talkie. Hanna felt a little satisfied thrill. Sneaking in gave her the same rush as stealing. \u003c/p\u003e","sourceLink":"https://allnovel.net/flawless-pretty-little-liars-2/page-28.html","bookId":2379,"creation":"Oct 5, 2019 10:19:05 AM","modification":"Oct 5, 2019 10:19:05 AM"}
