{"id":92492,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCrow told them about the security team he’d brought into town. Ferro was familiar with BK and Billy Christmas. “They did security a couple of times for some big-ticket election events in Philly. BK’s a levelheaded guy.”\u003c/p\u003e\n\u003cp\u003eTo Ferro, Weinstock said, “Are you concerned that something is going to happen during the holiday activities?”\u003c/p\u003e\n\u003cp\u003eFerro pursed his lips, then shook his head. “I doubt it. With all the media coverage…it’d be too high profile. But with all that’s going on, we’ll have no way of seeing what is going on behind the scenes. There’ll be no way to keep track of who goes missing, which means we have to take a closer look at those statistics you’ve been keeping over the last month, Saul. You’ve logged an increase in mortality rates, and although each of them individually appears to be normal—house fires, car accidents, heart attacks, and such, in light of what we now know we have to ask ourselves whether any of these could have been attacks by Ruger or Boyd. And, if so, are any of these people also likely to be infected?”\u003c/p\u003e\n\u003cp\u003e“There’s also tourists. How would we know if any of them went missing?” LaMastra asked.\u003c/p\u003e\n\u003cp\u003eCrow looked at Weinstock. “Saul, how many people do you actually think may have been attacked?”\u003c/p\u003e\n\u003cp\u003eWeinstock licked his lips with a nervous tongue. “There’s no way to know for sure. I didn’t examine everyone. And I couldn’t arrange for all of them to be exhumed.”\u003c/p\u003e\n\u003cp\u003e“That’s not good,” LaMastra said. “If there are even one or two more of these things out there…”\u003c/p\u003e\n\u003cp\u003eCrow nodded. “I know.”\u003c/p\u003e\n\u003cp\u003e“Hey,” LaMastra asked, snapping his fingers, “what about holy water and crosses?”\u003c/p\u003e\n\u003cp\u003e“Jonatha said that wouldn’t work. At best it would depend on the faith of the vampire—not, as is sometimes mentioned in fiction, on the faith of the person holding the cross. At worst they won’t work at all. Besides, even if the vampire is religious, it’s a crucifix, not a cross.”\u003c/p\u003e\n\u003cp\u003e“Not if the vampire is a Protestant,” Ferro offered. “They don’t use the crucifix, they go for the empty cross, symbolic of the resurrection, not the whole death-for-sins thing.”\u003c/p\u003e\n\u003cp\u003e“Sure,” said LaMastra. “Plus, the vampire could be Amish or a Mormon, or even a Jehovah’s Witness.”\u003c/p\u003e\n\u003cp\u003e“Or Muslim or Buddhist or Hindu,” Crow said.\u003c/p\u003e\n\u003cp\u003e“Or Jewish,” Weinstock offered hopefully.\u003c/p\u003e\n\u003cp\u003e“Great,” snapped LaMastra. “Go wave a Star of David at Ruger.”\u003c/p\u003e\n\u003cp\u003eWeinstock shook his head. “Actually a mezuzah would be better. It’s symbolic of the torah and the laws of Moses. Far more religiously significant than the Star.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“But even so,” Weinstock continued thoughtfully, “would that protect men against a vampire who didn’t believe in Judaism?”\u003c/p\u003e\n\u003cp\u003eCrow said, “My, my, here we are discussing the actual power of God.” He smiled and shook his head. “I mean, think about it. We are discussing which symbols of God will stop vampires. That’s quite a topic. And doesn’t it suggest that God is actually real? That He has power that can actually affect things in our world?”\u003c/p\u003e\n\u003cp\u003e“Well no shit,” said LaMastra. “What’s your problem? Don’t you believe in God?”\u003c/p\u003e\n\u003cp\u003e“Not much, no.”\u003c/p\u003e\n\u003cp\u003eFerro asked, “What were you before you lost your faith?”\u003c/p\u003e\n\u003cp\u003eCrow’s eyes were like flint. “A child,” he said. “I had it beaten out of me at an early age.”\u003c/p\u003e\n\u003cp\u003e“I’ll stick with fire,” Weinstock said. “Fire purifies, as the saying goes.”\u003c/p\u003e\n\u003cp\u003e“It would be interesting,” said Ferro, “to see how we could burn them without burning down your whole town and all the surrounding forestland.”\u003c/p\u003e\n\u003cp\u003eThey sat and thought about that for a while. Crow said, “Okay, this is farm country. Getting plenty of garlic is not a problem. We ought to be able to rustle up a hundred tons of it if we have to.”\u003c/p\u003e\n\u003cp\u003e“I’m toying with the idea of bathing in it,” said LaMastra.\u003c/p\u003e\n\u003cp\u003eTo Crow, Ferro said, “Is your fiancée going to be okay with this? With what we have to do to her brother?”\u003c/p\u003e\n\u003cp\u003e“It was her idea in the first place.”\u003c/p\u003e\n\u003cp\u003e“She’s a pretty tough lady.”\u003c/p\u003e\n\u003cp\u003e“You have no idea, Frank.”\u003c/p\u003e\n\u003cp\u003eFerro nodded. “You agree we have to do this, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah, damn it.”\u003c/p\u003e\n\u003cp\u003e“Mark is my brother,” Val said from the doorway. They could all see that she’d been crying, but her mouth was a hard line. “He’s…dead, and that’s something I’ll have to live with, but I can’t go on without knowing if he…if he…” Even she could not say it. No one blamed her. “But we have a responsibility to this town. If Mark and Connie are infected we have to know. I have to know. I owe it to the town, and to my baby.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Ferro said softly.\u003c/p\u003e\n\u003cp\u003eShe nodded, accepting it. “It’s getting dark. If we have to do this, let’s do it now.” She paused and stifled a sob.\u003c/p\u003e\n\u003cp\u003e“Val,” said Ferro, “you should probably stay here while we—”\u003c/p\u003e\n\u003cp\u003e“No!” she snapped. “Listen to me, Frank. All of you listen. Mark is my brother. I love him. Do you think I’ll let him be alone through this?” Her voice was as harsh as a slap across Ferro’s face, and he winced. “Jonatha said that in order to test him we have to make him taste blood, that we have to put it in his mouth. Well, here’s what we’re going to do. Crow, you and Vince are going to hustle your asses out to the closest farm stand and buy all the garlic they have. As soon as you get back we’re going to go right down to the morgue, and you men are going to hold him down, and I am going to cut open my thumb and spill my blood, my family’s blood, into my brother’s mouth. That is what’s going to happen. Don’t you dare try to tell me it’s not.”\u003c/p\u003e\n\u003cp\u003eThe men stared at her in amazement, each one of them trying to measure their personal courage to see if it came close to matching hers. At that moment, there was not a man in that room who wouldn’t have died for her.\u003c/p\u003e\n\u003cp\u003e“And if my brother is one of them, if he’s become a…a…”\u003c/p\u003e\n\u003cp\u003e“Val,” Crow whispered, touching her.\u003c/p\u003e\n\u003cp\u003eShe looked down at his hand then into his eyes. “If Mark is a vampire,” she said in a deadly whisper, “then we will do what needs to be done!” She paused for a moment. “And may God have mercy on us all.”\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eBy the time Crow and LaMastra got back from the farm goods stand, the others had things ready to go. Val was on the far side of the morgue, standing by one of the room’s two large stainless-steel surgical tables, arms folded under her breasts, head bowed, staring down at a body completely covered by a clean white sheet.\u003c/p\u003e\n\u003cp\u003eFerro said, “What did you get?”\u003c/p\u003e\n\u003cp\u003e“Cloves and a couple of big jars of garlic oil in gelcaps. I had a brainstorm while I was out.”\u003c/p\u003e\n\u003cp\u003e“Hit me.”\u003c/p\u003e\n\u003cp\u003e“If we took a syringe and drew the oil out of the gelcaps and then injected them into shotgun shells, then maybe used a lighter to seal the punctures…”\u003c/p\u003e\n\u003cp\u003e“That might just be brilliant,” Ferro said.\u003c/p\u003e\n\u003cp\u003e“It’ll gum up the guns,” LaMasta said, “but who cares?”\u003c/p\u003e\n\u003cp\u003eJonatha joined them and took one of the sacks of garlic bulbs LaMasta carried. “I’ll get to work.” She and Newton used a mortar and pestle to smash the bulbs into a lumpy paste and then smeared the door frame.\u003c/p\u003e\n\u003cp\u003eWeinstock fished in the other sack for a big bulb and began peeling off the papery skin. “We should all eat a couple of cloves,” he said, handing them out.\u003c/p\u003e\n\u003cp\u003e“I hate garlic,” Newton said, “it makes me sick.”\u003c/p\u003e\n\u003cp\u003e“Consider your alternatives.” Weinstock held out the clove, and Newton took it. Nobody liked the taste, but they all had seconds and thirds.\u003c/p\u003e\n\u003cp\u003eFerro and LaMastra went to work on the shotgun shells and Crow went over to Val. He touched her face. She didn’t react, and he realized that tenderness was probably the last thing she needed right now, so he cleared his throat and withdrew his hand. “We’ll be ready soon,” he said.\u003c/p\u003e\n\u003cp\u003eWeinstock joined them, “Val, I don’t like the idea of you cutting herself and dripping blood all over, so I’m going to use a syringe and draw off a few cc’s. I think it’ll be safer that way. No telling what kind of infection we might be dealing with here.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Val said. She held out her arm and Weinstock wrapped a rubber tourniquet around it, swabbed her with alcohol, slapped her inner arm to get a vein, and drew off a full syringe. He put a Band-Aid over the puncture and gave her some cloves to chew.\u003c/p\u003e\n\u003cp\u003eVal lifted the bottom corner of the sheet to show Crow what they’d done. Mark’s ankles were tied to the table with several turns of thick surgical gauze. “Wrists, too,” she said. Though her eyes were dry there was a strange deadness to her voice that scared Crow.\u003c/p\u003e\n\u003cp\u003e“We’re just about ready,” Ferro called.\u003c/p\u003e\n\u003cp\u003eVal touched Crow’s arm. “Give me just another minute with him, honey, okay?”\u003c/p\u003e\n\u003cp\u003e“Sure, baby, whatever you need.” He kissed her cheek and led Weinstock over to where the cops were working. As the detectives finished doctoring the shells Crow loaded them into the shotgun.\u003c/p\u003e\n\u003cp\u003eVery quietly LaMastra said, “Tell you one thing, Crow, and don’t take no offense.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Your lady has more balls than any of us.”\u003c/p\u003e\n\u003cp\u003eCrow grinned.\u003c/p\u003e\n\u003cp\u003e“Seriously,” LaMastra said, “you’re a lucky guy.”\u003c/p\u003e\n\u003cp\u003eCrow glanced over to where Val stood looking down at her dead brother. “Yes I am,” Crow said. He slid in the last shell in and handed the weapon to Ferro.\u003c/p\u003e\n\u003cp\u003eFerro took a deep breath and let it out slowly, then jacked a round into the chamber. Val looked up at the sound. “Ready,” he said.\u003c/p\u003e\n\u003cp\u003eEveryone came and stood in a loose circle around the table. LaMastra crossed himself, drew his Sig Sauer 9mm, and racked the slide. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-moon-rising-pine-deep-3/page-51.html","bookId":2569,"creation":"Oct 5, 2019 5:56:26 PM","modification":"Oct 5, 2019 5:56:26 PM"}
