{"id":12981,"no":10,"title":"Chapter 10","content":"\u0026nbsp;AND meanwhile the representatives of the Court of St James were enjoying the revivifying country air and outdoor-life of the Villa Clement. It was almost exquisite how rapidly the casual mode of existence adopted during the summer villeggiatura by their Excellencies, drew themselves and their personnel together, until soon they were as united and as sans gêne as the proverbial family party. No mother, in the “acclimatization” period, could have dosed her offspring more assiduously than did her Excellency the attachés in her charge; flavouring her little inventions frequently with rum or gin until they resembled cocktails. But it was Sir Somebody himself if anyone that required a tonic. Lady Something’s pending litigation, involving as it did the crown, was fretting the Ambassador more than he cared to admit, and the Hon. Mrs Chilleywater, ever alert, told “Harold” that the injudicious 144 chatter of the Ambassadress (who even now notwithstanding her writ, would say to every other visitor that came to the villa: “Have you heard about the Ritz?? The other night we were dining at the Palace, and I heard the King,” etc.) was wearing their old Chief out. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so through the agreeable vacation life there twitched the grim vein of tension.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One day disturbed by her daughter’s persistent trilling of the latest coster song When I sees ’im I topple giddy, Lady Something gathered up her morning letters and stepped out upon the lawn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oh so formal, oh so slender towered the Cypress-trees against the rose-farded hills and diamantine waters of the lake. The first hint of Autumn was in the air; and over the gravel paths, and in the basins of the fountains, a few shed leaves lay hectically strewn already.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Besides an under-stamped missive, with a foreign postmark, from her Majesty the Queen of the Land of Dates beginning “My dear Gazel,” there was a line from the eloquent, and moderately-victorious, young 145 barrister, engaged in the approaching suit with the Ritz: He had spared himself no pains he assured his client in preparing the defence, which was he said to be the respectability of Claridge’s.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why bring in Claridge’s? ...?” the Ambassadress murmured, prodding with the tip of her shoe a decaying tortoiseshell leaf; “but anyway,” she reflected, “I’m glad the proceedings fall in winter, as I always look well in furs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And mentally she was wrapped in leopard skins and gazing round the crowded court saluting with a bunch of violets an acquaintance here and there, as her eyes fell on Mrs Chilleywater seated in the act of composition beneath a cedar-tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Chilleywater extended a painful smile of welcome which revealed her pointed teeth and pale-hued gums, repressing, simultaneously, an almost irresistible inclination to murder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What!... Another writ?” she suavely asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, dear; but these legal men will write....” 146\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I love your defender. He has an air of d’Alembert sympathetic soul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He proposes pleading Claridge’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Claridge’s?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Its respectability.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are hotels ever respectable,—I ask you. Though, possibly, the horridest are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Aren’t they all horrid!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Natürlich; but do you know those cheap hotels where the guests are treated like naughty children?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I must confess I don’t,” the Ambassadress laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, there you are....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lady Something considered a moment a distant gardener employed in tying Chrysanthemum blooms to little sticks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m bothered about a cook,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I, about a maid! I dismissed Ffoliott this morning—well I simply had to—for a figure salient.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So awkward out here to replace anyone; I’m sure I don’t know....” the Ambassadress replied, her eyes hovering tragically over the pantaloons strained to splitting point, of the stooping gardener. 147\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a pretty prospect....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Life is a compound!” Lady Something defined it at last.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Chilleywater turned surprised. “Not even Socrates,” she declared, “said anything truer than that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A compound!” Lady Something twittered again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to put that into the lips of Delitsiosa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who’s Delitsiosa?” the Ambassadress asked as a smothered laugh broke out beside her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Chilleywater looked up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d forgotten you were there. Strange thing among the cedar-boughs,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Hon. Lionel Limpness tossed a slippered foot flexibly from his hammock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may well ask ‘who’s Delitsiosa’!” he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She is my new heroine,” Mrs Chilleywater replied, after a few quick little clutches at her hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I trust you won’t treat her, dear, quite so shamefully as your last.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Authoress tittered. 148\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Delitsiosa is the wife of Marsden Didcote,” she said, “the manager of a pawn-shop in the district of Maida Vale, and in the novel he seduces an innocent seamstress, Iris Drummond, who comes in one day to redeem her petticoat (and really I don’t know how I did succeed in drawing the portrait of a little fool!) ... and when Delitsiosa, her suspicions aroused, can no longer doubt or ignore her husband’s intimacy with Iris, already engaged to a lusty young farmer in Kent—(some boy)—she decides to yield herself to the entreaties of her brother-in-law Percy, a junior partner in the firm, which brings about the great tussle between the two brothers on the edge of the Kentish cliffs. Iris and Delitsiosa—Iris is anticipating a babelet soon—are watching them from a cornfield, where they’re boiling a kettle for afternoon tea; and oh, I’ve such a darling description of a cornfield. I make you feel England!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No really, my dear,” Lady Something exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Harold pretends it would be wonderful, arranged as an Opera ... with duos and 149 things and a Liebestod for Delitzi towards the close.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no,” Mr Limpness protested: “What would become of our modern fiction at all if Victoria Gellybore Frinton gave herself up to the stage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s quite true, strange thing among the cedar-boughs,” Mrs Chilleywater returned fingering the floating strings of the bandelette at her brow: “It’s lamentable; yet who is there doing anything at present for English Letters...? Who among us to-day,” she went on peering up at him, “is carrying on the tradition of Fielding? Who really cares? I know I do what I can ... and there’s Madam Adrian Bloater, of course. But I can think of no one else;—we two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr Limpness rocked, critically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t bear Bloater’s books,” he demurred.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To be frank, neither can I. I’m very fond of Lilian Bloater, I adore her welt-bürgerliche nature, but I feel like you about her books; I cannot read them. If only she would forget Adrian; but she will thrust him headlong into all her work. 150 Have I ever drawn Harold? No. (Although many of the public seem to think so!) And please heaven, however great my provocation at times may be, I never shall!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And there I think you’re right,” the Ambassadress answered, frowning a little as the refrain that her daughter was singing caught her ear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when I sees ’im\n\u003c/div\u003e \n\u003cdiv\u003e\n My heart goes BOOM!...\n\u003c/div\u003e \n\u003cdiv\u003e\n And I topple over;\n\u003c/div\u003e \n\u003cdiv\u003e\n I topple over, over, over,\n\u003c/div\u003e \n\u003cdiv\u003e\n All for Love!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dreamt last night my child was on the Halls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s no doubt, she’d dearly like to be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Her Father would never hear of it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when she sees me\n\u003c/div\u003e \n\u003cdiv\u003e\n O, when she sees me—\n\u003c/div\u003e \n\u003cdiv\u003e\n (The voice slightly false was Harold’s)\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her heart goes BOOM!...\n\u003c/div\u003e \n\u003cdiv\u003e\n And she topples over;\n\u003c/div\u003e \n\u003cdiv\u003e\n She topples over, over, over,\n\u003c/div\u003e \n\u003cdiv\u003e\n All for Love!”\n\u003c/div\u003e \n\u003cdiv\u003e\n 151\n\u003c/div\u003e \n\u003cdiv\u003e\n “There; they’ve routed Sir Somebody....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when anything vexes him,” Lady Something murmured, appraising the Ambassador’s approaching form with a glassy eye, “he always, you know, blames me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Shorn of the sombre, betailed attire, so indispensable for the town-duties of a functionary, Sir Somebody, while rusticating, usually wore a white-twill jacket, and black multi-pleated pantaloons; while for headgear, he would favour a Mexican sugar-loaf, or green-draped pugaree: “He looks half-Irish,” Lady Something would sometimes say.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Infernal Bedlam,” he broke out: “the house is sheer pandemonium.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I found it so too, dear,” Lady Something agreed; “and so,” she added, removing a fallen tree-bug tranquilly from her hair, “I’ve been digesting my letters out here upon the lawn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And no doubt,” Sir Somebody murmured, fixing the placid person of his wife, with a keen psychological glance: “you succeed, my dear, in digesting them?” 152\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “...” the Ambassador displayed discretion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’re asked to a Lion hunt in the Land of Dates; quite an entreating invitation from the dear Queen—; really most pressing and affectionate, but Princess Elsie’s nuptial negotiations and this pending Procès with the Ritz, may tie us here for some time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah Rosa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why these constant moans? ...? A clairvoyant once told me I’d ‘the bump of Litigation’—a cause célèbre unmistakably defined; so it’s as well, on the whole, to have it over.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And quite probably; had your statement been correct——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Ambassadress gently glowed\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m told it’s simply swarming!” she impenitently said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh Rosa, Rosa....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And if you doubt it at all, here is an account direct from the Ritz itself,” her Excellency replied, singling out a letter from among the rest: “It is from dear old 153 General Sir Trotter-Stormer. He says: ‘I am the only guest here. I must say, however, the attendance is beyond all praise, more soigné and better than I’ve ever known it to be, but after what you told me, dear friend, I feel distinctly uncomfortable when the hour for bye-bye comes!’”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pish; what evidence, pray, is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I regard it as of the very first importance! Sir Trotter admits—a distinguished soldier admits, his uneasiness; and who knows, he is so brave about concealing his woes—his two wives left him!—what he may not have patiently and stoically endured?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Less I am sure, my dear, than I of late in listening sometimes to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will write I think and press him for a more detailed report....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Ambassador turned away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She should no more be trusted with ink than a child with firearms!” he declared, addressing himself with studious indirectness to a garden-snail.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lady Something blinked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Life is a compound,” she murmured again. 154\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Particularly for women!” the Authoress agreed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, well,” the Ambassadress majestically rose: “I must be off and issue household orders; although I derive hardly my usual amount of enjoyment at present, I regret to say, from my morning consultations with the cook....”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3041/84034.html","bookId":1033,"creation":"Aug 2, 2019 5:06:06 AM","modification":"Aug 2, 2019 5:06:06 AM"}
