{"id":12986,"no":15,"title":"Chapter 15","content":"\u0026nbsp;IN the cloister eaves, the birds were just awakening, and all the spider scales, in the gargoyled gables, glanced fresh with dew. Above the Pietà, on the porter’s gate, slow-speeding clouds, like knots of pink roses, came blowing across the sky, sailing away in titanic bouquets towards the clear horizon. All virginal in the early sunrise what enchantment the world possessed! The rhythmic sway-sway of the trees, the exhalations of the flowers, the ethereal candour of this early hour,—these raised the heart up to their Creator. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Kneeling at the casement of a postulant’s cell, Laura de Nazianzi recalled that serene, and just thus had she often planned must dawn her bridal day!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Beyond the cruciform flower-beds, and the cloister wall, soared the Blue Jesus, the storied windows of its lofty galleries aglow with light. 209\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Most gracious Jesus. Help me to forget. For my heart aches. Uphold me now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to forget to-day, was well-nigh she knew impossible....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once it seemed she caught the sound of splendid music from the direction of the Park, but it was too early for music yet. Away in the palace, the Princess Elsie must be already astir ... in her peignoir, perhaps? The bridal-garment unfolded upon the bed: But no; it was said the bed indeed was where usually her Royal-Highness’ dogs....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a long and very involuntary sigh, she began to sweep, and put in some order, her room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How forlorn her cornette looked upon her prie-Dieu! And, oh, how stern, and “old”!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Would an impulse to bend it slightly but only so, so slightly, to an angle to suit her face, be attended, later, by remorse?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Confiteor Deo omnipotenti, beatae Mariae semper vergini, beato Michaeli Archangelo (et tibi Pater), quia peccavi 210 nimis cogitatione, verbo et opere,” she entreated, reposing her chin in meditation, upon the handle of her broom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The bluish shadow of a cypress-tree, on the empty wall, fascinated her as few pictures had.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Grant my soul Eyes,” she prayed, cheerfully completing her task.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the corridor, being a general holiday, all was yet quite still. A sound, as of gentle snoring, came indeed from behind more than one closed door, and the new pensionnaire was preparing to beat a retreat, when she perceived, in the cloister, the dumpish form of Old Jane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Seated in the sun by the convent well, the Porteress was sharing a scrap of breakfast with the birds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re soonish for Mass, love,” she broke out, her large archaic features surcharged with smiles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s such a perfect morning, I felt I must come down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve seen many a more promising sunrise before now, my dear, turn to storm and blast! An orange sky overhead, 211 brings back to me the morning that I was received; ah, I shall never forget, as I was taking my Vows, a flash of forked lightning, and a clap of Thunder (Glory be to God!) followed by a water-spout (Mercy save us!) bursting all over my Frinch lace veil....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your book, Old Jane?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Something light, love, as it’s a holiday.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pascal....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Though it’s mostly a Fête day I’ve extra to do!” the Porteress averred, dropping her eyes to the great, glistening spits, upon the Cloister flags. It was her boast she could distinguish Monsignor Potts’ round splash from Father Geordie Picpus’ more dapper fine one, and again the Abbess’ from Mother Martinez de la Rosa’s—although these indeed shared a certain opaque sameness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course it’s a day for private visits.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Since the affair of Sister Dorothea and Brother Bernard Soult, private visits are no longer allowed,” the Porteress returned, reproving modestly, with the cord of her discipline, a pert little lizard, that seemed 212 to be proposing to penetrate between the nude toes of her sandalled foot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But on such a radiant morning it was preposterous to hint at “Rules.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Beneath the clement sun a thousand cicadas were insouciantly chirping, while birds, skimming about without thoughts of money, floated lightly from tree to tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jesus—Mary—Joseph!” the Porteress purred, as a Nun, with her face all muffled up in wool, crossed the Cloister, glancing neither to right nor left, and sharply slammed a door: for, already, the Convent was beginning to give signs of animation. Deep in a book of Our Lady’s Hours, a biretta’d priest was slowly rounding a garden path, while repairing from a Grotto-sepulchre, to which was attached a handsome indulgence, Mother Martinez de la Rosa appeared, all heavily leaning on her stick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Simultaneously the matins bell rang out, calling all to prayer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Convent Chapel founded by the tender enthusiasm of a wealthy widow, the Countess d’Acunha, to perpetuate her 213 earthly comradeship with the beautiful Andalusian, the Do?a Dolores Baatz, was still but thinly peopled some few minutes later, although the warning bell had stopped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Peering around, Laura was disappointed not to remark Sister Ursula in her habitual place, between the veiled fresco of the “Circumcision” and the stoup of holy-water by the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Beyond an offer to “exchange whippings” there had been a certain coolness in the greeting with her friend, that had both surprised and pained her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When those we rely on wound and betray us, to whom should we turn but Thee?” she breathed, addressing a crucifix, in ivory, contrived by love, that was a miracle of wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finished Mass, there was a general rush for the Refectory!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Preceded by Sister Clothilde, and followed, helter-skelter, by an exuberant bevy of nuns, even Mother Martinez, who being shortsighted would go feeling the ground with her cane, was propelled to the measure of a hop-and-skip. 214\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Passing beneath an archway, labelled “Silence” (the injunction to-day being undoubtedly ignored), the company was welcomed by the mingled odours of tea, consommé, and fruit. It was a custom of the Convent for one of the Sisters during meal-time to read aloud from some standard work of fideism, and these edifying recitations, interspersed by such whispered questions as: “Tea, or Consommé?” “A Banana, or a Pomegranate?” gave to those at all foolishly, or hysterically inclined, a painful desire to giggle. Mounting the pulpit-lectern, a nun with an aristocratic, though gourmand little face, was about to resume the arid life of the Byzantine monk, Basilius Saturninus, when Mother Martinez de la Rosa took it upon herself, in a few patriotic words, to relax all rules for that day.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We understand in the world now,” a little faded woman murmured to Laura upon her right: “that the latest craze among ladies is to gild their tongues; but I should be afraid,” she added diffidently, dipping her banana into her tea, “of poison, myself!” 215\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unhappy at her friend’s absence from the Refectory, Laura, however, was in no mood to entertain the nuns with stories of the present pagan tendencies of society.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Through the bare, blindless windows, framing a sky so bluely luminous, came the swelling clamour of the assembling crowds, tinging the languid air as with some sultry fever. From the Chausée, music of an extraordinary intention—heated music, crude music, played with passionate élan to perfect time, conjured up, with vivid, heartrending prosaicness, the seething Boulevards beyond the high old creeper-covered walls.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I forget now, Mother, which of the Queens it is that will wear a velvet train of a beautiful orchid shade: But one of them will!” Sister Irene of the Incarnation was holding forth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must confess,” Mother Martinez remarked, who was peeling herself a peach, with an air of far attention: “I must confess, I should have liked to have cast my eye upon the lingerie....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would rather have seen the ballwraps, 216 Mother, or the shoes, and evening slippers!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, or the fabulous jewels....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course Sister Laura saw the trousseau?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Laura made feint not to hear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Discipline relaxed, a number of nuns had collected provisions and were picnicking in the window, where Sister Innez (an ex-Repertoire actress) was giving some spirited renderings of her chief successful parts—Jane de Simerose, Frou-Frou, Sappho, Cigarette....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My darling child! I always sleep all day and only revive when there’s a Man,” she was saying with an impudent look, sending the scandalised Sisters into delighted convulsions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unable to endure it any longer, Laura crept away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A desire for air and solitude, led her towards the Recreation ground. After the hot refectory, sauntering in the silken shade of the old astounding cedars, was delightful quite. In the deserted alleys, the golden blossoms of the censia-trees, 217 unable to resist the sun, littered in perfumed piles the ground, overcoming her before long with a sensation akin to vertige. Anxious to find her friend, Laura turned towards her cell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She found Sister Ursula leaning on her window-ledge all crouched up—like a Duchess on “a First Night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear, my dear, the crowds!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ursula?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, what is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I’ll go, since I’m in the way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Touchy Goose,” Sister Ursula murmured wheeling round with a glance of complex sweetness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, Ursula,” Laura sighed, smiling reproachfully at her friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had long almond eyes, one longer and larger than the other, that gave to her narrow, etiolated face, an exalted, mystic air. Her hair, wholly concealed by her full coif, would be inclined to rich copper or chestnut: Indeed, below the pinched and sensitive nostrils, a moustache (so slight as to be scarcely discernible) proved this beyond all controversy to be so. But 218 perhaps the quality and beauty of her hands were her chief distinction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you believe it would cause an earthquake, if we climbed out, dear little one, upon the leads?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had forgotten you overlooked the street by leaning out,” Laura answered, sinking fatigued to a little cane armchair.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Listen, Laura...!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This cheering racks my heart....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, Astaroth! There went a very ‘swell’ carriage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I’ll come back later: It’s less noisy in my cell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now you’re here, I shall ask you, I think, to whip me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bad dear Little-One. Dear meek soul,” Sister Ursula softly laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This maddening cheering,” Laura breathed, rolling tormented eyes about her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A crucifix, a text: I would lay Pansies at Jesus’ Feet, two fresh eggs in a blue paper bag, some ends of string, a breviary, and a birch, were the chamber’s individual, if meagre, contents. 219\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You used not to have that text, Ursula,” Laura observed, her attention arrested by the preparation of a Cinematograph Company on the parapet of the Cathedral.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Church had much need indeed of Reformation! The Times were incredibly low: A new crusade ... she ruminated, revolted at the sight of an old man holding dizzily to a stone-winged angel, with a wine-flask at his lips.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, dear, won’t you assist me now to mortify my senses?” Sister Ursula cajoled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, really, no—!—!—!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite lightly: For I was scourged, by Sister Agnes, but yesterday, with a heavy bunch of keys, head downwards, hanging from a bar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “This morning she sent me those pullets’ eggs. I perfectly was touched by her delicate sweet sympathy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Laura gasped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must have hurt you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I assure you I felt nothing—my spirit had travelled so far,” Sister Ursula replied, 220 turning to throw an interested glance at the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was close now upon the critical hour, and the plaudits of the crowd were becoming more and more uproarious, as “favourites” in Public life, and “celebrities” of all sorts, began to arrive in brisk succession at the allotted door of the Cathedral.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I could almost envy the fleas in the Cardinal’s vestments,” Sister Ursula declared, overcome by the venal desire to see.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Gazing at the friend upon whom she had counted in some disillusion, Laura quietly left her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The impulse to witness something of the spectacle outside was, nevertheless, infectious, and recollecting that from the grotto-sepulchre in the garden it was not impossible to attain the convent wall, she determined, moved by some wayward instinct, to do so. Frequently, as a child, had she scaled it, to survey the doings of the city streets beyond—the streets, named by the nuns often “Sinward-ho.” Crossing the cloisters, and through old gates crowned by vast fruit-baskets in stone, she followed, 221 feverishly the ivy-masked bricks of the sheltering wall, and was relieved to reach the grotto without encountering anyone. Surrounded by heavy boskage, it marked a spot where, once, long ago, one of the Sisters, it was said, had received the mystic stigmata.... With a feline effort (her feet supported by the Grotto boulders), it needed but a bound to attain an incomparable post of vantage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Beneath a blaze of bunting, the street seemed paved with heads. “Madonna,” she breathed, as an official on a white horse, its mane stained black, began authoritatively backing his steed into the patient faces of the mob, startling an infant in arms below, to a frantic fit of squalls.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so shall we stand on the Day of Judgment,” she reflected, blinking at the glare.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Street boys vending programmes, ‘Lucky’ horseshoes, Saturnalian emblems—(these for gentlemen only), offering postcards of ‘Geo and Glory,’ etc., wedged their way however where it might have been deemed indeed impossible for anyone to pass. 222\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he, she wondered, her eyes following the wheeling pigeons, alarmed by the recurrent salutes of the signal guns, he must be there already: Under the dome! Restive a little beneath the busy scrutiny, his tongue like the point of a blade....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A burst of cheering seemed to announce the Queen. But no, it was only a lady, with a parasol sewn with diamonds, that was exciting the rah-rahs of the crowd. Followed by mingled cries of “Shame!” “Waste!” and sighs of envy, Madame Wetme was enjoying a belated triumph. And now a brief lull, as a brake containing various delegates and “representatives of English Culture,” rolled by at a stately trot—Lady Alexander, E. V. Lucas, Robert Hichens, Clutton Brock, etc.,—the ensemble the very apotheosis of worn-out cliché.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s someone there wot’s got enough heron plumes on her head!” a young girl in the crowd remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And nobody contradicted her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then troops and outriders, and at last the Queen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was looking charming in a Corinthian 223 chlamyde, in a carriage lined in deep delphinium blue, behind six restive blue roan horses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally, the bride and her father, bowing this way and that....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Cheers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Huzzas”—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A hushed suspense.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Below the wall the voice of a beggar arose, persistent, haunting: “For the Love of God.... In the Name of Pity ... of Pity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of Pity,” she echoed, addressing a frail, wind-sown harebell, blue as the sky: And leaning upon the shattered glass ends, that crowned the wall, she fell to considering the future—Obedience, Solitude—death.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The troubling valse theme from Dante in Paris interrupted her meditations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How often had they valsed it together, he and she ... sometimes as a two-step...! What souvenirs.... Yousef, Yousef.... Above the Cathedral, the crumbling clouds, had eclipsed the sun. In the intense meridian glare the thronged 224 street seemed even as though half-hypnotised; occasionally only the angle of a parasol would change, or some bored soldier’s legs would give a little. When brusquely, from the belfry, burst a triumphant clash of bells.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Laura caught her breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Already?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A shaking of countless handkerchiefs in wild ovation: From roof-tops, and balconies, the air was thick with falling flowers—the bridal pair!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But only for the bridegroom had she eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oblivious of what she did, she began to beat her hands, until they streamed with blood, against the broken glass ends upon the wall: “Yousef, Yousef, Yousef....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n July 1921, May 1922.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Versailles, Montreux, Florence. 225\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n BY THE SAME AUTHOR\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carl Van Vechten, in The Double Dealer: “It is high time that the world should know something of the works of Ronald Firbank. He is the Pierrot of the Minute. Plus chic que le futurisme. Aubrey Beardsley in a Rolls-Royce. Sacher-Masoch in Mayfair. ‘A Rebours’ à la mode. Aretino in Piccadilly. Jean Cocteau at the Savoy. The Oxford Tradition with a dash of the Paris bains de vapeurs.... Firbank plays Picasso’s violin.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3041/84039.html","bookId":1033,"creation":"Aug 2, 2019 5:06:16 AM","modification":"Aug 2, 2019 5:06:16 AM"}
