{"id":12975,"no":4,"title":"Chapter 4","content":"\u0026nbsp;ONE grey, unsettled morning (it was the first of June) the English Colony of Kairoulla4 awoke in arms. It usually did when the Embassy entertained. But the omissions of the Ambassador, were, as old Mr Ladboyson the longest-established member of the colony declared, “not to be fathomed,” and many of those overlooked declared they should go all the same. Why should Mrs Montgomery (who, when all was said and done, was nothing but a governess) be invited and not Mrs Barleymoon who was “nothing” (in the most distinguished sense of the word) at all? Mrs Barleymoon’s position, as a captain’s widow with means, unquestionably came before Mrs Montgomery’s, who drew a salary, and hadn’t often an h. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Grizel Hopkins, too—the cousin of an Earl, and Mrs Bedley the “Mother” of 83 the English Colony, both had been ignored. It was true Ann Bedley kept a circulating library and a tea-room combined and gave “Information” to tourists as well (a thing she had done these forty years), but was that a sufficient reason why she should be totally taboo? No, in old Lord Clanlubber’s time all had been made welcome, and there had been none of these heartburnings at all. Even the Irish coachman of the Archduchess was known to have been received—although it had been outside of course upon the lawn. Only gross carelessness, it was felt, on the part of those attachés could account for the extraordinary present neglect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t myself mind much,” Mrs Bedley said, who was seated over a glass of morning milk and “a plate of fingers” in the Circulating end of the shop: “going out at night upsets me. And the last time Dr Babcock was in he warned me not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the Embassy there for but to be hospitable?” Mrs Barleymoon demanded from the summit of a ladder, from where she was choosing herself a book. 84\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re shewing your petticoat, dear—excuse me telling you,” Mrs Bedley observed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When will you have something new, Mrs Bedley?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Soon, dear ... soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s always ‘soon,’” Mrs Barleymoon complained.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you looking for anything, Bessie, in particular?” a girl, with loose blue eyes that did not seem quite firm in her head, and a literary face enquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, only something,” Mrs Barleymoon replied, “I’ve not had before and before and before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way, Miss Hopkins,” Mrs Bedley said, “I’ve to fine you for pouring tea over My Stormy Past.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was coffee, Mrs Bedley—not tea.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind, dear, what it was the charge for a stain is the same as you know,” Mrs Bedley remarked, turning to attend to Mrs Montgomery who, with his Lankiness, Prince Olaf, had entered the Library.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it in?” Mrs Montgomery mysteriously asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Bedley assumed her glasses. 85\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mmnops,” she replied, peering with an air of secretiveness in her private drawer where she would sometimes reserve or ‘hold back’ a volume for a subscriber who happened to be in her special good graces.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve often said,” Mrs Barleymoon from her ladder sarcastically let fall, “that Mrs Bedley has her pets!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are all my pets, my dear,” Mrs Bedley softly cooed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you read Men—my Delight, Bessie?” Miss Hopkins asked, “by Cora Velasquez.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s not perhaps a very.... It’s about two dark, and three fair, men,” she added vaguely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Most women’s novels seem to run off the rails before they reach the end, and I’m not very fond of them,” Mrs Barleymoon said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And anyway, dear, it’s out,” Mrs Bedley asserted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Passing of Rose I read the other day,” Mrs Montgomery said, “and so enjoyed it.” 86\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t that one of Ronald Firbank’s books?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, dear, I don’t think it is. But I never remember an author’s name and I don’t think it matters!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose I’m getting squeamish! But this Ronald Firbank I can’t take to at all. Valmouth! Was there ever a novel more coarse. I assure you I hadn’t gone very far when I had to put it down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s out,” Mrs Bedley suavely said, “as well,” she added, “as the rest of them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I once met him,” Miss Hopkins said, dilating slightly the retin? of her eyes: “He told me writing books was by no means easy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Barleymoon shrugged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you nothing more enthralling, Mrs Bedley,” she persuasively asked, “tucked away?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Try The Call of the Stage, dear,” Mrs Bedley suggested.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You forget, Mrs Bedley,” Mrs Barleymoon replied, regarding solemnly her crêpe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or Mary of the Manse, dear.” 87\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve read Mary of the Manse twice, Mrs Bedley—and I don’t propose to read it again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “..........?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “..........!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Bedley became abstruse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s dreadful how many poets take to drink,” she reflected.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A sentiment to which her subscribers unanimously assented.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m taking Men are Animals, by the Hon. Mrs Victor Smythe, and What Every Soldier Ought to Know, Mrs Bedley,” Miss Hopkins breathed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I The East is Whispering,” Mrs Barleymoon in hopeless tones affirmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Robert Hitchinson! He’s a good author.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think so? I feel his books are all written in hotels with the bed unmade at the back of the chair.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I daresay you’re right, my dear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mrs Bedley, I must go—if I want to walk to my husband’s grave,” Mrs Barleymoon declared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor Bessie Barleymoon,” Mrs Bedley 88 sighed, after Mrs Barleymoon and Miss Hopkins had gone: “I fear she frets!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We all have our trials, Mrs Bedley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And some more than others.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Court life, Mrs Bedley, it’s a funny thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It looks as though we may have an English Queen, Mrs Montgomery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t believe it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Most of the daily prints I see are devoting leaders to the little dog the Princess Elsie sent out the other day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Odious, ill-mannered, horrid little beast....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems, dear, he ran from room to room looking for her until he came to the prince’s door, where he just lay down and whined.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what does that prove, Mrs Bedley?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I really don’t know, Mrs Montgomery. But the press seemed to find it significant,’” Mrs Bedley replied as a Nun of the Flaming-Hood with a jolly face all gold with freckles entered the shop:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you Valmouth by Ronald Firbank or Inclinations by the same author?” she asked. 89\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Neither I’m sorry—both are out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maladetta ????! But I’ll be passing soon again,” the Sister answered as she twinklingly withdrew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’d not think now by the look of her she had been at Girton!” Mrs Bedley remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Once a Girton girl always a Girton girl, Mrs Bedley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems a curate drove her to it....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m scarcely astonished. Looking back I remember the average curate at home as something between a eunuch and a snigger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Still, dear, I could never renounce my religion. As I said to the dear Chaplain only the other day (while he was having some tea), Oh, if only I were a man, I said! Wouldn’t I like to denounce the disgraceful goings on every Sabbath down the street at the church of the Blue Jesus.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I assure you it’s positively nothing, Mrs Bedley, at the Jesus, to what it is at the church of St Mary the Fair! I was at the wedding of one of the equerries lately, and never saw anything like it.” 90\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s about time there was an English wedding, in my opinion, Mrs Montgomery!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s not been one in the Colony indeed for some time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Bedley smiled undaunted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I trust I may be spared to dance before long at Dr and Mrs Babcock’s!” she exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Kindly leave Cunnie out of it, Mrs Bedley,” Mrs Montgomery begged.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it’s Cunnie already you call him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dr Cuncliffe and I scarcely meet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “People talk of the immense sameness of marriage, Mrs Montgomery; but all the same, my dear, a widow’s not much to be envied.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are times, it’s true, Mrs Bedley, when a woman feels she needs fostering; but it’s a feeling she should try to fight against.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah my dear, I never could resist a mon!” Mrs Bedley exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Montgomery sighed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Once,” she murmured meditatively, “men (those procurers of delights) engaged me utterly.... I was their slave.... 91 Now.... One does not burn one’s fingers twice, Mrs Bedley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs Bedley grew introspective.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My poor husband sometimes would be a little frightening, a little fierce ... at night, my dear, especially. Yet how often now I miss him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re better off as you are, Mrs Bedley, believe me,” Mrs Montgomery declared, looking round for the little prince who was amusing himself on the library-steps.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must find him a handful to educate, my dear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will be a relief indeed, Mrs Bedley, when he goes to Eton!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m told so long as a boy is grounded....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “His English accent is excellent, Mrs Bedley, and he shews quite a talent for languages,” Mrs Montgomery assured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m delighted, I’m sure, to hear it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mrs Bedley, I mustn’t stand dawdling: I’ve to ’ave my ’air shampooed and waved for the Embassy party to-night you know!” And taking the little prince by the hand, the Royal Governess withdrew.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3041/84028.html","bookId":1033,"creation":"Aug 2, 2019 5:05:53 AM","modification":"Aug 2, 2019 5:05:53 AM"}
