{"id":12978,"no":7,"title":"Chapter 7","content":"\u0026nbsp;SWANS and sunlight. A little fishing boat with coral sails. A lake all grey and green. Beatitude intense. Consummate calm. It was nice to be at the Summer-Palace after all. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The way the air will catch your cheek and make a rose of it,” the Countess of Tolga breathed. And as none of the company heeded her: “How sweetly the air takes one’s cheek,” she sighed again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The post-prandial exercise of the members of the Court through the palace grounds was almost an institution.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The first half of the mourning prescribed, had as yet not run its course, but the tongues of the Queen’s ladies had long since made an end of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hate dancing with a fat man,” Mademoiselle de Nazianzi was saying: “for if you dance at all near him, his stomach hits you, while if you pull away, you catch 120 either the scent of his breath or the hair of his beard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, you innocent baby, all big men haven’t beards,” Countess Medusa Rappa remarked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t they? Never mind. Everything’s so beautiful,” the young girl inconsequently exclaimed: “Look at that Thistle! and that Bee! O, you darling!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, how one’s face unbends in gardens!” the Countess of Tolga said, regarding the scene before her, with a faraway pensive glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Along the lake’s shore, sheltered from the winds by a ring of wooded hills, shewed many a proud retreat, mirroring its marble terraces to the waveless waters of the lake.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Beneath a twin-peaked crag (known locally as the White Mountain whose slopes frequently would burst forth into patches of garlic that from the valley resembled snow) nestled the Villa Clement, rented each season by the Ambassador of the Court of St James, while half-screened by conifers and rhododendrons, and in the lake itself, was St Helena—the home and 121 place of retirement of a “fallen” minister of the Crown.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Countess Medusa Rappa cocked her sunshade; “Whose boat is that,” she asked, “with the azure oars?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It looks nothing but a pea-pod!” the Countess of Tolga declared.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It belongs to a darling, with delicious lips and eyes like brown chestnuts,” Mademoiselle de Lambèse informed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!... Ah!... Ah!... Ah!...” her colleagues crooned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A sailor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Queen’s maid nodded: “There’s a partner, though,” she added, “A blue-eyed, gashed-cheeked angel....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mademoiselle de Nazianzi looked away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I love the lake with the white wandering ships,” she sentimentally stated, descrying in the distance the prince.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was usually towards this time, the hour of the siesta, that the lovers would meet and taste their happiness, but, to-day, it seemed ordained otherwise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the heir apparent had determined whether to advance or retreat, his 122 father and mother were upon him, attended by two dowagers newly lunched.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The song of the pilgrim women, how it haunts me,” one of the dowagers was holding forth: “I could never tire of that beautiful, beautiful music! Never tire of it. Ne-ver....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ta, ta, ta, ta,” the Queen vociferated girlishly, slipping her arm affectionately through that of her son’s.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How spent you look, my boy.... Those eyes....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His Weariness grimaced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’ve just been rubbing in Elsie!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Vasleine’ and ‘Nanny-goat’!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing will shake me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are your objections?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s so extraordinarily uninteresting!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh Yousef!” his mother faltered: “Do you wish to break my heart?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We had always thought you too lacking in initiative,” King William said 123 (tucking a few long hairs back into his nose) “to marry against our wishes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They say she walks too wonderfully,” the Queen courageously pursued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What? Well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank God for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And can handle a horse as few others can!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Prince Yousef closed his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had not forgotten how as an undergraduate in England he had come upon the princess once while out with the hounds. And it was only by a consummate effort that he was able to efface the sinister impression she had made—her lank hair falling beneath a man’s felt-hat, her habit skirt torn to tatters, her full cheeks smeared in blood; the blood, so it seemed, of her “first” fox.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A shudder seized him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, nothing can possibly shake me,” he murmured again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With a detached, cold face, the Queen paused to inhale a rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n (Oh you gardens of Palaces...! How 124 often have you witnessed agitation and disappointment? You smooth, adorned paths...! How often have you known the extremes of care...?)\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be better to do away I think next year with that bed of cinerarias altogether,” the Queen of Pisuerga remarked, “since persons won’t go round it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Traversing the flower plat now, with the air of a black-beetle with a purpose, was the Countess Yvorra.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We had supposed you higher-principled, Countess,” her sovereign admonished.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Countess slightly flushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m looking for groundsel for my birds, Sire,” she said—“for my little dickies!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We understand your boudoir is a sort of menagerie,” His Majesty affirmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Countess tittered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Animals love me,” she archly professed. “Birds perch on my breast if only I wave.... The other day a sweet red robin came and stayed for hours...!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Court looks to you to set a high example,” the Queen declared, focusing quizzically a marble shape of Leda green 125 with moss, for whose time-corroded plinth the late Archduchess’ toy-terrier was just then shewing a certain contempt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Countess’ long, slightly pulpy fingers strayed nervously towards the rosary at her thigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “With your majesty’s consent,” she said, “I propose a campaign to the Island.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What? And beard the Count?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The salvation of one so fallen, in my estimation should be worth hereafter (at the present rate of exchange, but the values vary) ... a Plenary perpetual-indulgence: I therefore,” the Countess said, with an upward fleeting glance (and doubtless guileless of intention of irony), “feel it my duty to do what I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I trust you will take a bodyguard when you go to St Helena?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And pray tell Count Cabinet from us,” the King looked implacable: “we forbid him to serenade the Court this year! or to throw himself into the Lake again or to make himself a nuisance!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was over early this morning, Willie,” the Queen retailed: “I saw him 126 from a window. Fishing, or feigning to! And with white kid gloves, and a red carnation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us catch him stepping ashore!” the King displayed displeasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And as usual the same mignon youth had the charge of the tiller.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I could tell a singular story of that young man,” the Countess said: “for he was once a choir-boy at the Blue Jesus. But, perhaps, I would do better to spare your ears....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would do better, a good deal, to spare my cinerarias,” her Dreaminess murmured, sauntering slowly on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sun so bright, trees so green, it was a perfect day. Through the glittering fronds of the palms shone the lake like a floor of silver glass strewn with white sails.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s odd,” the King observed, giving the dog Teddywegs a sly prod with his cane, “how he follows Yousef.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He seems to know!” the Queen replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A remark that so annoyed the Prince that he curtly left the garden.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3041/84031.html","bookId":1033,"creation":"Aug 2, 2019 5:06:01 AM","modification":"Aug 2, 2019 5:06:01 AM"}
