{"id":79943,"no":10,"title":"Page 10","content":"\u003cp\u003e10\u003c/p\u003e\n\u003cp\u003eOn Monday at work, Krasenko called her to his office and told her that although she was doing a good job on the flamethrowers, he had to transfer her to one of the tank-production facilities immediately, because the order had come through from Moscow that Kirov had to make 180 tanks a month regardless of capability or manpower.\u003c/p\u003e\n\u003cp\u003e“Who’s going to make the flamethrowers?”\u003c/p\u003e\n\u003cp\u003e“They’ll make themselves,” said Krasenko, lighting a cigarette. “You’re a nice girl, Tania. Go. Have some soup at the canteen.”\u003c/p\u003e\n\u003cp\u003e“Do you think the People’s Volunteers would take me?” she asked him.\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003e“I heard that 15,000 people have already joined from Kirov to entrench the Luga line. Is that true?”\u003c/p\u003e\n\u003cp\u003e“What’s true is that you can’t go. Now, get out of here.”\u003c/p\u003e\n\u003cp\u003e“Is Luga in danger?” Pasha was near Luga.\u003c/p\u003e\n\u003cp\u003e“No,” Krasenko replied. “The Germans are far away. It’s just a precaution. Now, go.”\u003c/p\u003e\n\u003cp\u003eIn tank production there were many more people and the assembly line was much more intricate, but because of that, Tatiana had less to do. She placed the pistons in the cylinders that went below the combustion chambers on the tank’s V-12 diesel engine.\u003c/p\u003e\n\u003cp\u003eThe facility was the size of an airplane hangar, gray and dark inside.\u003c/p\u003e\n\u003cp\u003eBy the end of the day the diesel engine was in place, thanks to Tatiana, and the tread was on the tires, and the frame was tightly bolted, but there was no inside, no instruments, no panels, no weapons, no missile boxes, no ammunition launchers, and no hull roof — basically nothing that would make the machine anything other than a heavily armored car. But unlike the crating of the small-arms ammunition, or the making of flamethrowers, or the greasing of high-explosive GP bombs, making half a tank gave Tatiana a sense of accomplishment that she had not had in her entire first month of full-time work. She felt as if she had made the KV-1 herself. Another note of pride: in the afternoon Krasenko had told her the Germans could not even conceive of a tank this well built, well armed, this facile, this agile, this simple, yet armored with 45 mm of steel all around, supplied with an 85-mm gun. They thought their Panzer IV was the best tank there was. “Tania,” he told her, “you did an excellent job on the diesel engine. Maybe you should be a mechanic when you grow up.”\u003c/p\u003e\n\u003cp\u003eAt eight in the evening Tatiana ran outside with her clean hands and her straightened-out collar and her brushed-out hair, not believing she could be running at the end of an eleven-hour day, yet running nonetheless, so afraid that Alexander wouldn’t be waiting for her.\u003c/p\u003e\n\u003cp\u003eBut he was.\u003c/p\u003e\n\u003cp\u003eHe was waiting for her but not smiling.\u003c/p\u003e\n\u003cp\u003eOut of breath, Tatiana tried to regain her composure. She was alone with him for the first time since last Friday, alone in a sea of strangers. She wanted to say, I’m so happy you came to see me. What had happened to don’t come and see me anymore?\u003c/p\u003e\n\u003cp\u003eSomeone yelled out her name; Tatiana reluctantly turned around. It was Ilya, a boy of sixteen, who worked alongside her on the tank tracks. “You catching the bus?” Ilya asked, glancing at Alexander, who said nothing.\u003c/p\u003e\n\u003cp\u003e“No, Ilya, but I’ll see you tomorrow.” Tatiana motioned for Alexander to cross the street.\u003c/p\u003e\n\u003cp\u003e“Who was that?” Alexander asked.\u003c/p\u003e\n\u003cp\u003ePuzzled, Tatiana glanced at him. “Who? Oh, just some boy I work with.”\u003c/p\u003e\n\u003cp\u003e“Is he bothering you?”\u003c/p\u003e\n\u003cp\u003e“What? No, no.” Ilya actually was bothering her a little bit. “I started in a new department. We’re building tanks to send to the Luga line,” she said proudly.\u003c/p\u003e\n\u003cp\u003eNodding, he said, “How fast can you make them?”\u003c/p\u003e\n\u003cp\u003e“My department is making one every two days,” she replied. “That’s good, right?”\u003c/p\u003e\n\u003cp\u003e“To help at the Luga line,” Alexander said, “you’re going to need ten a day.”\u003c/p\u003e\n\u003cp\u003eDetecting something . . . she looked up at him, tried to figure it out but couldn’t. “Are you all right?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eShe thought. “What’s the matter?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003eThe people near the tram stop were standing silently, smoking. No one was talking to anyone else. “You want to walk back home?” Tatiana asked shyly.\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. “I’ve been in military training all day.”\u003c/p\u003e\n\u003cp\u003eNudging him with her fingers, Tatiana said teasingly, “I thought you already were in the military.”\u003c/p\u003e\n\u003cp\u003e“Yes. Not for me, for them. Maneuvers, gun training, more air-raid shelters.” He sounded depleted for some reason. Was she that close to the nuances of his voice? Of his face?\u003c/p\u003e\n\u003cp\u003e“What’s the matter?” she asked again.\u003c/p\u003e\n\u003cp\u003e“Nothing,” he repeated. But then he took her arm, pulling up her sleeve a little to reveal the dark bruises on the underside. “Tania, what’s this?”\u003c/p\u003e\n\u003cp\u003eAh. “Nothing.” She tried to pull her arm away. He would not let go as he stood very close to her.\u003c/p\u003e\n\u003cp\u003e“Really nothing,” she said, unable to look up at him. “Come on. I’m fine.”\u003c/p\u003e\n\u003cp\u003e“I don’t believe you,” Alexander said. “I told you, don’t take up with Dimitri.”\u003c/p\u003e\n\u003cp\u003e“I’m not taking up with him,” Tatiana said.\u003c/p\u003e\n\u003cp\u003eThey glanced at each other, and then Tatiana stared at his uniform buttons.\u003c/p\u003e\n\u003cp\u003e“Alexander, it’s nothing,” she said. “He was just trying to get me to sit with him.”\u003c/p\u003e\n\u003cp\u003e“I want you to tell me if he grabs you this hard again, do you hear?” Alexander said, letting go of her.\u003c/p\u003e\n\u003cp\u003eShe didn’t want his tender, firm fingers to let go of her. “Dima is a nice enough man. He is just used to a different kind of girl, I think.” She coughed. “Who isn’t? Well, listen, I took care of it. I’m sure it won’t happen again.”\u003c/p\u003e\n\u003cp\u003e“Oh?” Alexander said. “Like you took care of talking about Pasha to your family?”\u003c/p\u003e\n\u003cp\u003eTatiana didn’t speak at first but then said, “Alexander, I told you it was going to be hard for me. You can’t even get my twenty-four-year-old sister to do it. Why don’t you try? Come over for dinner one night, have some vodka with Papa, and bring it up. See how they take it. Show me how it’s done. Because I can’t do it.”\u003c/p\u003e\n\u003cp\u003e“You can’t talk to your own family about your brother, but you can stand up to Dimitri?”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Tatiana replied, raising her voice a little, and thought unhappily, are we fighting? Why are we fighting?\u003c/p\u003e\n\u003cp\u003eThere was a seat for them on the tram. Tatiana held on to the bench in front of her. Alexander’s hands were folded in his lap. He was quiet and didn’t look at her. Something continued to upset him. Was it Dimitri? Still they sat close, his arm pressed into her arm and his leg pressed into her leg. His leg felt made of marble. Tatiana didn’t move her body away from him; as if she could, as if that were even an option. She was magnetized to him.\u003c/p\u003e\n\u003cp\u003eTrying to alleviate the tension between them, Tatiana brought up the war. “Where is the front now, Alexander?”\u003c/p\u003e\n\u003cp\u003e“Moving north.”\u003c/p\u003e\n\u003cp\u003e“But it’s far still. Right? Far from . . . ?”\u003c/p\u003e\n\u003cp\u003eHe didn’t look at her. “For all our military bravado, we are a civilian country.” He snorted. “Our silly maneuvers, our exercises, our grounded planes, our pathetic tanks. We didn’t know who we were dealing with.”\u003c/p\u003e\n\u003cp\u003eShe pressed lightly into his side, assimilating him through her skin. “Alexander, why does Dimitri seem so reluctant to go and fight? I mean, it is to get the Germans out of our country.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t care about the Germans. He cares about only one thing—” He broke off.\u003c/p\u003e\n\u003cp\u003eTatiana waited.\u003c/p\u003e\n\u003cp\u003e“You will learn something about Dimitri, Tania. He treats self-preservation as his inalienable right.”\u003c/p\u003e\n\u003cp\u003eShe gazed at him. “Alexander, what is . . . inalienable?”\u003c/p\u003e\n\u003cp\u003eHe smiled. “A right that no one can assail.”\u003c/p\u003e\n\u003cp\u003eTatiana thought. “Who says that? Do we even have those kinds of rights? Aren’t they usually reserved for the state?”\u003c/p\u003e\n\u003cp\u003e“We? Where?”\u003c/p\u003e\n\u003cp\u003e“Here.” She lowered her voice. “In the Soviet Union.”\u003c/p\u003e\n\u003cp\u003e“No, Tania. Here we do not. Here those rights are reserved for the state.” Alexander paused. “And Dimitri. Especially self-preservation.”\u003c/p\u003e\n\u003cp\u003e“Inalienable. I’ve never heard anyone say that word before,” Tatiana said thoughtfully.\u003c/p\u003e\n\u003cp\u003e“No, you wouldn’t,” he said, his face softening. “How was the rest of your Sunday? What did you do? How is your mother? Every time I see her, she looks ready to fall down.”\u003c/p\u003e\n\u003cp\u003e“Yes, too much worry for Mama these days.” Tatiana turned to the window. She didn’t want to speak about Pasha again. “You know what I did yesterday? I learned some English words. Want to hear?”\u003c/p\u003e\n\u003cp\u003e“Let’s get off, and then yes, very much. Any good words?”\u003c/p\u003e\n\u003cp\u003eShe didn’t know quite what he meant, but she blushed anyway.\u003c/p\u003e\n\u003cp\u003eThey got off the tram, and as they were walking past Warsaw Station, Tatiana saw a crowd of people huddled together: women with their children, old people with luggage, waiting in a focused disorder.\u003c/p\u003e\n\u003cp\u003e“What are they waiting for?” she asked.\u003c/p\u003e\n\u003cp\u003e“A train. They are the smart ones. They’re leaving this city,” said Alexander.\u003c/p\u003e\n\u003cp\u003e“Leaving?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He paused. “Tania . . . as you should be leaving.”\u003c/p\u003e\n\u003cp\u003e“Leaving and going where?”\u003c/p\u003e\n\u003cp\u003e“Anywhere. Away from here.”\u003c/p\u003e\n\u003cp\u003eWhy was it that a week ago the thoup bght of evacuation was so thrilling, yet today it felt like a death sentence? It wasn’t evacuation. It was exile.\u003c/p\u003e\n\u003cp\u003e“What I hear,” Alexander continued, “is that we’re getting routed by the Germans. Trounced. We’re unprepared, unequipped; we have no tanks and no weapons.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Tatiana said with false levity. “We’ll have a tank tomorrow.”\u003c/p\u003e\n\u003cp\u003e“We have nothing except men, Tania. No matter what the cheerful radio reports say.”\u003c/p\u003e\n\u003cp\u003e“They are quite cheerful,” Tatiana said, trying to sound cheerful herself — and failing.\u003c/p\u003e\n\u003cp\u003e“Tania?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Are you listening? The Germans are eventually headed for Leningrad. It’s not safe. You really have to leave.”\u003c/p\u003e\n\u003cp\u003e“But my family is staying put!”\u003c/p\u003e\n\u003cp\u003e“So? Leave without them.”\u003c/p\u003e\n\u003cp\u003e“Alexander, what are you talking about?” Tatiana exclaimed and laughed. “I’ve never been anywhere by myself in my whole life! I barely go to the store by myself. I can’t go by myself. Where? By myself to the Urals or to some place where they evacuate people? Is that where you want me to go? Or maybe to America, where you’re from? Will I be safe there?” Tatiana chuckled. It was just preposterous.\u003c/p\u003e\n\u003cp\u003e“Certainly if you went where I’m from, you’d be safe there,” Alexander said grimly.\u003c/p\u003e\n\u003cp\u003eAfter she came home that night, Tatiana struck up a conversation with her father about evacuation and about Pasha.\u003c/p\u003e\n\u003cp\u003ePapa listened to her long enough for him to take three puffs of his cigarette. Tatiana counted. Then he got up and, stubbing out the cigarette to punctuate his words, said, “Tanyusha, where in hell are you getting your ideas from? The Germans are not coming here. I’m not going away from here. And Pasha is safe. I know it. Listen, if it will make you feel better, Mama will call him tomorrow to make sure all is well. All right?”\u003c/p\u003e\n\u003cp\u003eDeda said, “Tania, I did ask to be evacuated east to the Molotov Oblast near the Urals. I have a cousin in Molotov.”\u003c/p\u003e\n\u003cp\u003e“He’s been dead for ten years, Vasili,” said Babushka, shaking her large head. “Since the hunger of ’31.”\u003c/p\u003e\n\u003cp\u003e“His wife still lives there.”\u003c/p\u003e\n\u003cp\u003e“She died of dysentery in ’28.”\u003c/p\u003e\n\u003cp\u003e“That was his second wife. His first wife, Naira Mikhailovna, still lives there.”\u003c/p\u003e\n\u003cp\u003e“Not in Molotov. Remember? She lives where we used to live, in that village called—”\u003c/p\u003e\n\u003cp\u003e“Woman!” Deda interrupted. “Do you want to come with me or not?”\u003c/p\u003e\n\u003cp\u003e“I’ll come with you, Deda,” Tatiana said brightly. “Is Molotov nice?”\u003c/p\u003e\n\u003cp\u003e“I’ll come with you, too, Vasili,” said Babushka, “but don’t pretend we have people in Molotov. We might as well go to Chukhotka.”\u003c/p\u003e\n\u003cp\u003eTatiana intervened. “Chukhotka . . . isn’t that near the Arctic circle?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Deda.\u003c/p\u003e\n\u003cp\u003e“Isn’t that near the Bering Strait?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said again.\u003c/p\u003e\n\u003cp\u003e“Well, maybe we should go to Chukhotka,” Tatiana said. “If we have to go somewhere.”\u003c/p\u003e\n\u003cp\u003e“Chukhotka? Who is going to let me go there?” Deda exclaimed. “Do you think I can teach math there?”\u003c/p\u003e\n\u003cp\u003e“Tania is a fool,” agreed Mama.\u003c/p\u003e\n\u003cp\u003eTatiana fell quiet. She wasn’t thinking about Deda teaching math. She was thinking about something ridiculous. So outlandish that if she weren’t in front of her judgmental family, she would have laughed.\u003c/p\u003e\n\u003cp\u003e“Why are you thinking about the Bering Strait, Tania?” asked Deda.\u003c/p\u003e\n\u003cp\u003e“She always thinks about preposterous things,” Dasha piped in. “She’s got a preposterous inner life.”\u003c/p\u003e\n\u003cp\u003e“I have no inner life, Dasha,” said Tatiana. “What’s on the other side of the Bering Strait?”\u003c/p\u003e\n\u003cp\u003e“Why, Alaska,” said Deda. “What does that have to do with anything?”\u003c/p\u003e\n\u003cp\u003e“Yes, Tania, shut up, will you?” said Mama.\u003c/p\u003e\n\u003cp\u003eThe next night Tatiana’s father came home with ration cards for the family. “Can you believe it?” he said. “Rations already. Well, we can manage. They’re not bad, actually.” Workers got 800 grams of bread a day. Also, one kilo of meat a week and half a kilo of cereals. It seemed like plenty of food.\u003c/p\u003e\n\u003cp\u003e“Mama, did you try to call Pasha?” Tatiana wanted to know.\u003c/p\u003e\n\u003cp\u003e“I did,” she replied. “I even went to the intercity telephone bureau on Ulitsa Zhelyabova. Couldn’t get through. I’ll try again tomorrow.”\u003c/p\u003e\n\u003cp\u003eInformation from the front was ominous. The war bulletins — posted all over Leningrad on wooden boards where the daily papers had once been posted — were haunting in their vagueness. The radio announcer said that the Red Army was winning but the German forces were gaining some ground.\u003c/p\u003e\n\u003cp\u003eHow could the Red Army be winning if the Germans were gaining ground? Tatiana wondered.\u003c/p\u003e\n\u003cp\u003eA few days later Deda said the chances were very good that he was going to get the evacuation post in Molotov and suggested that the family start thinking about packing.\u003c/p\u003e\n\u003cp\u003e“I’m not leaving without Pasha,” snapped Mama. “Besides,” she said, in a calmer voice, “at the uniform factory I’m now making Red Army uniforms. I’m needed for the war effort.” She nodded. “It’s all right. The war will be over soon. You heard on the radio. The Red Army is winning. They’re repelling the enemy.”\u003c/p\u003e\n\u003cp\u003eDeda shook his head. “Oh, Irina Fedorovna,” he said calmly, “the enemy is the best-armed, best-trained enemy in the world. Have you not heard? England has been fighting them for eighteen months. Alone. England, with their RAF, have not beaten the enemy.”\u003c/p\u003e\n\u003cp\u003e“Yes, but, Papochka,” interjected Papa coming to the defense of his wife, “now the Nazis are engaged in a real war, not just some air war. The Soviet front is massive. The Germans are going to have a hard time with us.”\u003c/p\u003e\n\u003cp\u003e“I say we don’t stay to find out how hard.”\u003c/p\u003e\n\u003cp\u003eMama repeated, “I’m not leaving.”\u003c/p\u003e\n\u003cp\u003eDasha said, “I’m with Mama on this.”\u003c/p\u003e\n\u003cp\u003eI bet you are, thought Tatiana.\u003c/p\u003e\n\u003cp\u003ePasha was no longer there, so he didn’t speak.\u003c/p\u003e\n\u003cp\u003eThey sat in their long, narrow room, Papa and Mama smoking, Baba and Deda shaking their quiet gray heads, Dasha sewing.\u003c/p\u003e\n\u003cp\u003eTatiana kept to herself, thinking, well, I am not leaving either.\u003c/p\u003e\n\u003cp\u003eShe was entrenched. She had dug a trench all around herself called Alexander, and she couldn’t leave. Tatiana lived for that evening hour with him that propelled her into her future and into the barely formed, painful feelings that she could neither express nor understand. Friends walking in the lucent dusk. There was nothing more she could have from him, and there was nothing more she wanted from him but that one hour at the end of her long day when her heart beat and her breath was short and she was happy.\u003c/p\u003e\n\u003cp\u003eAt home Tatiana surrounded herself with her family to protect herself, yet withdrew from them, wanting to be away from them. She watched them at night, as she did now, watched their mood, didn’t trust it.\u003c/p\u003e\n\u003cp\u003e“Mama, did you call Pasha?”\u003c/p\u003e\n\u003cp\u003e“Yes. I got through. But there was no answer,” Mama said. “No answer at the camp. I think I may have gotten the wrong number. I called the village Dohotino, where the camp was, but there was no answer from the Soviet council there either. I’ll try again tomorrow. Everybody is trying to call. The lines must be overloaded.”\u003c/p\u003e\n\u003cp\u003eMama tried again and again, but there was no word from Pasha, and there was no good news from the front, and there was no evacuation.\u003c/p\u003e\n\u003cp\u003eAlexander stayed away from the apartment at night. Dasha worked late. Dimitri was up near Finland.\u003c/p\u003e\n\u003cp\u003eBut every single day after work Tatiana brushed her hair and ran outside, thinking, please be there, and every single day after work Alexander was. Though he never asked her to go to the Summer Garden anymore or to sit on the bench under the trees with him, his hat was always in his hands.\u003c/p\u003e\n\u003cp\u003eExhausted and slow, they meandered from tram to canal to tram, reluctantly parting at Grechesky Prospekt, three blocks away from her apartment building.\u003c/p\u003e\n\u003cp\u003eDuring their walks sometimes they talked about Alexander’s America or his life in Moscow, and sometimes they talked about Tatiana’s Lake Ilmen and her summers in Luga, and sometimes they chatted about the war, though less and less because of the anxiety over Pasha, and sometimes Alexander taught Tatiana a little English. Sometimes they told jokes, and sometimes they barely spoke at all. A few times Alexander let Tatiana carry his rifle as a balancing stick while she walked a high ledge on the side of Obvodnoy Canal. “Don’t fall into the water, Tania,” he once said, “because I can’t swim.”\u003c/p\u003e\n\u003cp\u003e“Is that true?” she asked incredulously, nearly toppling over.\u003c/p\u003e\n\u003cp\u003eGrabbing the end of his rifle to steady her, Alexander said with a grin, “Let’s not find out, shall we? I don’t want to lose my weapon.”\u003c/p\u003e\n\u003cp\u003e“That’s all right,” Tatiana said, precariously teetering on the ledge and laughing. “I can swim perfectly well. I’ll save your weapon for you. Want to see?”\u003c/p\u003e\n\u003cp\u003e“No, thank you.”\u003c/p\u003e\n\u003cp\u003eAnd sometimes, when Alexander talked, Tatiana found her lower jaw drifting down and was suddenly and awkwardly aware that she had been staring at him so long that her mouth had dropped open. She didn’t know what to look at when he talked — his caramel eyes that blinked and smiled and shined and were grim or his vibrant mouth that moved and opened and breathed and spoke. Her eyes darted from his eyes to his lips and circled from his hair to his jaw as if they were afraid she would miss something if she didn’t stare at everything all at once.\u003c/p\u003e\n\u003cp\u003eThere were some pieces of his fascinating life that Alexander did not wish to talk about — and didn’t. Not about the last time he saw his father, not about how he became Alexander Belov, not about how he received his medal of valor. Tatiana didn’t care and never did more than gently press him. She would take from him what he needed to give her and wait impatiently for the rest. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-10.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
