{"id":79959,"no":26,"title":"Page 26","content":"\u003cp\u003e6\u003c/p\u003e\n\u003cp\u003eIn the morning Mama asked Tatiana if she was pleased with herself. No, Tatiana replied. Not particularly.\u003c/p\u003e\n\u003cp\u003eAfter they had all left, she started to get ready to go to the hospital. There was a knock on the door, and when she opened it, she found Alexander standing outside.\u003c/p\u003e\n\u003cp\u003e“I can’t let you in,” Tatiana said, pointing to Zhanna Sarkova, who walked out of her room and stood in the corridor looking suspiciously at them. Anxiety and excitement mixed in equal measure inside Tatiana. She couldn’t let him inside, couldn’t close the door, not with Sarkova standing watching them, yet—\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Alexander said, striding in. “I’ve got a whole platoon waiting for me downstairs. We’re going to barricade the southeastern streets.” He paused. “Terrible news. Mga fell to the Germans yesterday.”\u003c/p\u003e\n\u003cp\u003e“Oh, no, not Mga.” Tatiana remembered Alexander’s words about the trains. “What does it mean for us?”\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. “It’s the end. I just wanted to make sure you were all right after yesterday. And,” he said pointedly, “that you weren’t going to work.”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“Tatia, no.”\u003c/p\u003e\n\u003cp\u003e“Shura, I am.”\u003c/p\u003e\n\u003cp\u003e“No.” He raised his voice.\u003c/p\u003e\n\u003cp\u003eGlancing behind him, Tatiana said, “I want you to know that that woman is definitely going to say something to my family about you coming by. I guarantee it.”\u003c/p\u003e\n\u003cp\u003e“That’s why you’re going to give me my cap that I left here yesterday. During inspection this morning, I got fined. I need it.”\u003c/p\u003e\n\u003cp\u003eTatiana left the door open while Alexander went into the bedroom to retrieve his cap.\u003c/p\u003e\n\u003cp\u003e“Please don’t go to the hospital,” he said, coming out and standing in the hallway.\u003c/p\u003e\n\u003cp\u003e“Alexander, I’m going crazy. All day, every day. In the hospital at least I’ll see some real suffering. It’ll cheer me up.”\u003c/p\u003e\n\u003cp\u003e“Your leg is never going to heal if you stand all day on it. You have a couple more weeks until the cast comes off. Go to work then.”\u003c/p\u003e\n\u003cp\u003e“I am not staying here for another two weeks — the only hospital they’ll put me in in two weeks will be a mental hospital!”\u003c/p\u003e\n\u003cp\u003e“I wish Kirov weren’t on the front line,” Alexander said softly. “You could go back to work there. I would meet you every day.” He paused. “Like I used to, remember?”\u003c/p\u003e\n\u003cp\u003eDid she remember?\u003c/p\u003e\n\u003cp\u003eTatiana’s heart was pounding. But there was Sarkova standing in the corridor watching them through their open door.\u003c/p\u003e\n\u003cp\u003eAlexander muttered, “That’s it. I’m fed up,” and shut the door.\u003c/p\u003e\n\u003cp\u003eTatiana opened her mouth and then closed it again. “Oh, no,” she said. “We’re in more and more trouble.”\u003c/p\u003e\n\u003cp\u003eHe came closer to her.\u003c/p\u003e\n\u003cp\u003eShe backed away from him.\u003c/p\u003e\n\u003cp\u003eAlexander took another step toward her. “How is your nose?”\u003c/p\u003e\n\u003cp\u003e“It’s fine. It’s not broken.”\u003c/p\u003e\n\u003cp\u003e“And how would you know?” He came closer.\u003c/p\u003e\n\u003cp\u003eShe put her palms out. “Shura, please.”\u003c/p\u003e\n\u003cp\u003eThere was a loud knock on the door. “Tanechka, are you all right?”\u003c/p\u003e\n\u003cp\u003e“Fine, thank you,” Tatiana called out.\u003c/p\u003e\n\u003cp\u003eThe door knob turned, and Sarkova opened the door. “I just wanted to know if you’d like me to make you anything to eat.”\u003c/p\u003e\n\u003cp\u003e“No, thank you, Zhanna,” said Tatiana, keeping a straight face.\u003c/p\u003e\n\u003cp\u003eSarkova glared at Alexander, who turned to Tatiana and rolled his eyes. Tatiana nearly burst out laughing.\u003c/p\u003e\n\u003cp\u003e“We were just leaving,” she said.\u003c/p\u003e\n\u003cp\u003e“Oh, where are you going?”\u003c/p\u003e\n\u003cp\u003e“Well, I’m going to work—”\u003c/p\u003e\n\u003cp\u003eAlexander whispered, “No you’re not.”\u003c/p\u003e\n\u003cp\u003e“And Lieutenant Belov is going to build barricades.”\u003c/p\u003e\n\u003cp\u003eAlexander turned to Zhanna. “Barricades, Comrade Sarkova,” he said, striding toward her. “Do you know what those are? Structures nearly three meters high by four meters thick, stretching for twenty kilometers.”\u003c/p\u003e\n\u003cp\u003eSarkova backed away into the hall.\u003c/p\u003e\n\u003cp\u003e“And each barricade is supplied with eight machine-gun rests, ten antitank positions, thirteen mortar positions, and forty-six machine-gun points.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“That’s how we protect the city we love,” Alexander said, slamming the door.\u003c/p\u003e\n\u003cp\u003eTatiana stood behind him shaking her head, a smile of delight on her face. “You’ve done it now.” She grabbed her bag. “Let’s go, barricade-builder.”\u003c/p\u003e\n\u003cp\u003eThey went out, locking the door behind them and leaving Sarkova in the communal kitchen, grumbling into her tea.\u003c/p\u003e\n\u003cp\u003eAs he was helping her down the stairs, Alexander took hold of her hand. Tatiana tried to pull away. “Alexander—”\u003c/p\u003e\n\u003cp\u003e“No.” He brought her to him on the stairwell landing.\u003c/p\u003e\n\u003cp\u003eTatiana felt the rumbling inside her, the rumbling of wood crackling on the rack of fire. “Look,” she said, “I will ask Vera to put me to work in the hospital canteen. Maybe you can come for lunch?” She smiled. “I’ll serve you.”\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. “Though few things give me more pleasure than to have you feed me” — he smiled — “we’ll be too far south. I won’t be able to get back in time for lunch.”\u003c/p\u003e\n\u003cp\u003e“Shura, let go of me. We’re on a landing in my building . . .”\u003c/p\u003e\n\u003cp\u003eHe held onto her hand. Sensing something, she said, “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eAlexander hesitated, and his chocolate eyes melted sadness onto her. “Oh, Tania. I have to talk to you.” He sighed. “I have to talk to you about Dimitri.”\u003c/p\u003e\n\u003cp\u003e“What about him?”\u003c/p\u003e\n\u003cp\u003e“I can’t now. I need to talk to you at length and alone. Come and see me tonight at St. Isaac’s.”\u003c/p\u003e\n\u003cp\u003eTatiana’s turbulent heart hammered in her chest. St. Isaac’s! “Alexander, I can barely walk to the hospital three blocks away. How am I going to get to St. Isaac’s?” But Tatiana knew: if she had to crawl dragging one leg behind her, she would get herself to the cathedral.\u003c/p\u003e\n\u003cp\u003e“I know. I don’t want you to walk all that way without help. The streets are safe, but you . . .” He stroked her face. “Do you have a friend who can take you up there?” he asked. “Not Anton. A female friend. A single female friend you can trust, who can help you and drop you off nearby? Then you can just walk a block or two by yourself.”\u003c/p\u003e\n\u003cp\u003eTatiana was quiet. “How am I going to get back home?” she said.\u003c/p\u003e\n\u003cp\u003eAlexander smiled, bringing her closer to him. “As always,” he said, “I will take you home myself.”\u003c/p\u003e\n\u003cp\u003eShe stared at his tunic buttons.\u003c/p\u003e\n\u003cp\u003e“Tania, we desperately need to have a minute,” he said. “And you know it.”\u003c/p\u003e\n\u003cp\u003eShe knew it. “This isn’t right.”\u003c/p\u003e\n\u003cp\u003e“It’s the only thing that’s right.”\u003c/p\u003e\n\u003cp\u003e“All right. Go.”\u003c/p\u003e\n\u003cp\u003e“Will you come?”\u003c/p\u003e\n\u003cp\u003e“I will try. Now, go.”\u003c/p\u003e\n\u003cp\u003e“Lift your—”\u003c/p\u003e\n\u003cp\u003eBefore he stopped speaking, Tatiana raised her face to him. They kissed deeply. “Do you have any idea what I feel?” Alexander whispered, his hands in her hair.\u003c/p\u003e\n\u003cp\u003e“No,” Tatiana replied, holding on to him, her legs numb. “I only have an idea what I feel.”\u003c/p\u003e\n\u003cp\u003eThat night a miracle happened. Tatiana’s cousin Marina’s phone was working. Tatiana begged Marina to visit her, and Marina came, around eight. Tatiana couldn’t stop hugging her. “Marinka, you are living proof that there is indeed a God in the heavens. I needed you so much,” she said. “Where have you been?”\u003c/p\u003e\n\u003cp\u003e“There is no God, you know that. Where have I been?” Marina said, laughing. “Let go of me. Where have you been? I heard all about your escapades in Luga.” She blinked. “I’m sorry about our Pasha.” Brightening a bit, she said, “Why do you look like a boy?”\u003c/p\u003e\n\u003cp\u003e“I have so much to tell you.”\u003c/p\u003e\n\u003cp\u003e“Obviously.” Marina sat down at the table in the room where just yesterday Tatiana had stood behind Alexander. “Is there anything to eat? I’m so hungry.”\u003c/p\u003e\n\u003cp\u003eMarina was a big-hipped, small-breasted, dark-eyed girl with short black hair and clusters of birthmarks on her face. She was nineteen and in her second year at Leningrad University. Marina was the closest thing Tatiana had to a best friend and a confidante. Marina, Tatiana, and Pasha had spent many summer days romping around Luga and nearby Novgorod. The difference in their ages had become apparent only a year or so ago. Tatiana simply no longer belonged with Marina’s crowd.\u003c/p\u003e\n\u003cp\u003eTatiana hastily gave Marina some bread, some cheese, some tea and said, “Marina, eat quick, because I need to go for a walk, all right? You look pretty in that dress. How was your summer?”\u003c/p\u003e\n\u003cp\u003e“We can’t go for a walk. You can’t walk. Look at you. Talk to me here.” Mama and Papa were in the next room with Dasha, listening to the radio. Tatiana and Marina were alone in the room; Tatiana’s family was not speaking to her after yesterday. Chewing, Marina looked Tatiana over. “Start with the hair. What happened to your hair? And why is your skirt so long?”\u003c/p\u003e\n\u003cp\u003e“I cut my hair. And the skirt hides the cast. Get up. We need to go.” Tatiana pulled on Marina’s arm. She was in a hurry. Alexander told her to come after ten, and here it was nearly nine, and she was still at Fifth Soviet. Was she prepared to tell Marina everything to get her to help? She pulled again at Marina’s plump arm. “Let’s go. Enough eating.”\u003c/p\u003e\n\u003cp\u003e“How are you going to walk? You can barely hobble. And why do we need to go anywhere? When is the cast coming off?”\u003c/p\u003e\n\u003cp\u003e“Then let’s go for a hobble. The cast feels as if it’s never coming off. How do I look?”\u003c/p\u003e\n\u003cp\u003eMarina stopped eating and eyed Tatiana. “What did you just say?”\u003c/p\u003e\n\u003cp\u003e“I said let’s go.”\u003c/p\u003e\n\u003cp\u003e“All right,” Marina said, wiping her mouth and standing up. “What is going on?”\u003c/p\u003e\n\u003cp\u003e“Nothing. Why?”\u003c/p\u003e\n\u003cp\u003e“Tatiana Metanova! I know that something is seriously wrong.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“Tania! I’ve known you for seventeen years, and you have never asked me how you looked.”\u003c/p\u003e\n\u003cp\u003e“Maybe if your phone were working more often, I would. Are you going to answer me, or can we just go?”\u003c/p\u003e\n\u003cp\u003e“Your hair is too short, your skirt is too long, your blouse is white and tight — what the hell is going on?”\u003c/p\u003e\n\u003cp\u003eFinally Tatiana got Marina out the door. They walked slowly down Grechesky, to Insurrection Square, where they took a tram down Nevsky Prospekt to the Admiralty. Tatiana walked supported by Marina’s arm. She had a little trouble walking and talking at the same time. The walking took most of her energy.\u003c/p\u003e\n\u003cp\u003e“Tania, tell me, why did you jump off a moving train? Is that how you broke your leg?”\u003c/p\u003e\n\u003cp\u003e“It’s not how I broke my leg,” said Tatiana, “and I jumped off a moving train because that was what I had to do.”\u003c/p\u003e\n\u003cp\u003e“Did a ton of bricks fall on you because they had to, too?” Marina asked with a chortle. “Is that how you broke your leg?”\u003c/p\u003e\n\u003cp\u003e“Yes, and are you going to stop?”\u003c/p\u003e\n\u003cp\u003eMarina laughed. “I’m sorry about Pasha, Tanechka,” she said, much more quietly. “He was the best boy.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Tatiana. “I wish I had found him.”\u003c/p\u003e\n\u003cp\u003e“I know.” Marina paused. “This has not been a great summer. I haven’t seen you since before the war started.”\u003c/p\u003e\n\u003cp\u003eTatiana nodded. “You almost saw me. I was very close to coming and visiting you the day the war started.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you?”\u003c/p\u003e\n\u003cp\u003eTatiana wished she could have told Marina everything — about her emotion and her conscience, about her fear and confusion. What Tatiana did instead was tell Marina about Dasha and Alexander, and herself and Dimitri, and herself and Luga, and Alexander’s search for her. What Tatiana didn’t tell Marina was the truth.\u003c/p\u003e\n\u003cp\u003eTatiana could barely trust herself not to slip in front of Dasha amid the ice of constant lies on which she skated. How could she trust Marina, who had nothing at stake? Tatiana didn’t tell her, sensing that truth forged a chasm between her and all the people she loved. How can that be? Tatiana thought, as they came to the Admiralty Gardens and sat on a bench. How can it be that deceit and treachery and secrecy bonded her to other human beings instead of truth and trust and openness? How could it be that she could not trust a member of her own family with a personal matter? This life just seems to breed contempt for other human beings.\u003c/p\u003e\n\u003cp\u003eThe Admiralty Gardens were laid out on the banks of the Neva, between the Palace Bridge and St. Isaac’s. Tatiana was not far from Alexander. If she strained, she might be able to hear him breathe. She smiled. Tall leafy elms branched out over the footpaths and the benches much the same as they did in the Summer Garden. The difference was, in the Summer Garden Tatiana had walked and sat with him.\u003c/p\u003e\n\u003cp\u003e“Tania,” Marina said, “is there a reason we’re here?”\u003c/p\u003e\n\u003cp\u003e“No, Marina,” said Tatiana. “We’re just sitting and talking.” She wished she had a watch. How late was it already?\u003c/p\u003e\n\u003cp\u003e“I used to come to this park,” Marina said. “Once I even brought you. Remember?”\u003c/p\u003e\n\u003cp\u003eTatiana, suddenly blushing, said, “Yes . . . I do.”\u003c/p\u003e\n\u003cp\u003eMarina said, “I’ve had some good times in my life. They don’t seem so far away. You think we’ll have them again?”\u003c/p\u003e\n\u003cp\u003e“Sure, Marinka,” said Tatiana. “I’m counting on it. I haven’t had any good times yet.” She smiled at her cousin.\u003c/p\u003e\n\u003cp\u003eMarina laughed. “Not even with Dima?”\u003c/p\u003e\n\u003cp\u003e“Of course, not!” Tatiana said, and didn’t say anything else.\u003c/p\u003e\n\u003cp\u003eMarina put her arm around Tatiana. “Don’t be sad, Tania. You’ll get out of this city somehow.”\u003c/p\u003e\n\u003cp\u003eTatiana shook her head. “No. There are no more trains, Marinka. Mga fell.”\u003c/p\u003e\n\u003cp\u003eMarina was quiet. “We haven’t heard from Papa for three days,” she said. “He’s been fighting at Izhorsk. That’s near Mga, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Tatiana said faintly. “It is.”\u003c/p\u003e\n\u003cp\u003eMarina held Tatiana closer. “I don’t think anyone is getting out of this city,” she said. “My mama is so sick. My papa is . . .”\u003c/p\u003e\n\u003cp\u003e“I know,” said Tatiana, patting her cousin’s leg. “We’ll make it, Marina. We just have to be strong.”\u003c/p\u003e\n\u003cp\u003e“Yes, especially you,” Marina said, with a shake of her head, shuddering away her unhappy thoughts. “Will you tell me why you brought me here?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Tania . . .”\u003c/p\u003e\n\u003cp\u003e“No. I have nothing to tell.”\u003c/p\u003e\n\u003cp\u003eMarina tickled Tatiana’s arm. “Tania, tell me about Dimitri.”\u003c/p\u003e\n\u003cp\u003e“There is nothing to tell.”\u003c/p\u003e\n\u003cp\u003eMarina giggled. “I can’t believe you of all people are seeing a soldier!” She looked askance at Tatiana. “Oh, no — you’re not meeting him here later, are you?”\u003c/p\u003e\n\u003cp\u003e“No!” Tatiana cried. “Dima and I are just friendly.”\u003c/p\u003e\n\u003cp\u003e“Yes, sure. Soldiers have only one way of being friendly, Tania.”\u003c/p\u003e\n\u003cp\u003eNow it was Tatiana’s turn to look askance at her cousin. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“Remember I went out with a soldier last year?” Marina made a derisive clicking sound with her tongue. “I glimpsed the life he lived and said forget it, I want no part of it. But this summer I was seeing someone nice, another student. He enlisted and went down to Fornosovo.” She stopped. “Haven’t heard from him since.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” said Tatiana. “What did you want no part of with soldiers? War, you mean?”\u003c/p\u003e\n\u003cp\u003e“Tania, not war. Women.”\u003c/p\u003e\n\u003cp\u003e“Women?” she said weakly.\u003c/p\u003e\n\u003cp\u003e“Women — good-time girls, pick-me-up girls, garrison hacks, harlots — all kinds of women come to the bars and the clubs and the barracks offering themselves to garrison soldiers, and the soldiers accept. All of them. It’s just what they do. Like having a smoke. Every time they’re off duty, every time they have time off at the weekend, every time they get furlough.” Marina shook her head. “I don’t know how you’re keeping Dimitri away. Easy women, difficult women, young girls like you, it’s all the same to soldiers — just one big conquest party to them.”\u003c/p\u003e\n\u003cp\u003eIn a small, horrified voice, Tatiana said, “Marinka, what are you talking about? Not in Leningrad. That’s only in the West. In America.”\u003c/p\u003e\n\u003cp\u003eMarina burst out laughing. “Tania, I love you,” she said, putting an arm around her. “I really do. You are just—”\u003c/p\u003e\n\u003cp\u003e“That’s not Alexander,” muttered a shaken Tatiana.\u003c/p\u003e\n\u003cp\u003e“Who? Oh, Dasha’s guy. No? Ask Dasha.” Marina laughed. “How do you think he met her?”\u003c/p\u003e\n\u003cp\u003eDasha did meet Alexander in Sadko. “You’re not saying . . .”\u003c/p\u003e\n\u003cp\u003e“Ask Dasha, Tania.”\u003c/p\u003e\n\u003cp\u003e“You don’t know what you’re talking about!” Tatiana was sorry she’d ever called her.\u003c/p\u003e\n\u003cp\u003eWhen Tatiana remained silent, Marina continued. “Look, the point I’m making is that you have to be careful with a soldier like Dimitri, especially you of all people. They expect certain things. And when they don’t get the things they expect, they take them anyway. Do you understand?”\u003c/p\u003e\n\u003cp\u003eTatiana kept quiet. How in the world had they started talking about this?\u003c/p\u003e\n\u003cp\u003e“Are you still friendly with Anton Iglenko? He is a nice boy, and he really likes you.”\u003c/p\u003e\n\u003cp\u003e“Marina!” Tatiana shook her head. “Anton is my friend.” She sat breathing heavily, keeping her hands steady on her lap. “He doesn’t like me.”\u003c/p\u003e\n\u003cp\u003eMarina smiled, ruffling Tatiana’s hair. “You’re adorable, Tania. And blind as always. Remember Misha? Remember how stuck on you he was?”\u003c/p\u003e\n\u003cp\u003e“Who?” Tatiana strained to remember. “Misha from Luga?”\u003c/p\u003e\n\u003cp\u003eMarina nodded. “For three summers in a row. Pasha couldn’t keep him away from you.”\u003c/p\u003e\n\u003cp\u003e“You’re crazy.” Tatiana and Misha used to hang upside down from trees together. She taught him how to do cartwheels. And Pasha, too.\u003c/p\u003e\n\u003cp\u003eMarina asked, “Tania, have you ever talked to Dasha about these things?”\u003c/p\u003e\n\u003cp\u003e“God, no!” Tatiana exclaimed, trying to get up. She felt as if she were being stabbed repeatedly with a blunt kitchen utensil.\u003c/p\u003e\n\u003cp\u003eMarina helped her stand. “Well, I suggest you do. She’s your older sister. She should help you. But be careful with Dimitri, Tania. You don’t want to be just another notch in some soldier’s belt.”\u003c/p\u003e\n\u003cp\u003eTatiana tried to think of Alexander as she knew him. She knew nothing about that part of him. A vision of his head appeared, softly kissing the top of her breast when she lay wounded in his tent. She shook her head. What Marina was describing, that was not her Alexander.\u003c/p\u003e\n\u003cp\u003eThen Tatiana remembered Dimitri’s comment about Alexander’s extracurricular activities. She felt ill. “Let’s go home,” she said dejectedly, and slowly they walked back to the tram stop on Nevsky. Tatiana told Marina that she didn’t have to go all the way back home with her. “I’m going to be fine. I can walk home from Insurrection Square. Honestly. Look, your bus home will come any minute. Don’t worry for a second about me.”\u003c/p\u003e\n\u003cp\u003eMarina said she could not leave Tatiana alone at night in the middle of the city. It hadn’t occurred to Tatiana that she should be afraid of anything. “Alexander told us that violent crime has fallen off dramatically since war began. It’s almost nonexistent.”\u003c/p\u003e\n\u003cp\u003e“Oh, well, if Alexander told you . . .” Marina said, peering at Tatiana’s face. “Are you all right?”\u003c/p\u003e\n\u003cp\u003e“I’m great. Go,” Tatiana said, and then she saw a sad reluctance in Marina that she had not seen at first, so wrapped up was she in her own upset haze. Focusing, she studied Marina for a moment. She couldn’t see. Reaching out, she touched Marina’s face. Marina blinked. Tatiana saw. “Who is home, Marina?” Tatiana asked quietly. “Who are you going home to?”\u003c/p\u003e\n\u003cp\u003e“No one,” Marina replied, just as quietly. “Mama’s in the hospital. Papa’s gone. Down the hall, the Lublins—”\u003c/p\u003e\n\u003cp\u003e“Marinka,” Tatiana said softly, “don’t stay by yourself. Come and live with us. We have room now. Deda and Babushka have left. You don’t want to be alone. Come on. You’ll sleep with Dasha and me.”\u003c/p\u003e\n\u003cp\u003e“Really?” Marina said.\u003c/p\u003e\n\u003cp\u003eTatiana nodded. “Really.”\u003c/p\u003e\n\u003cp\u003e“Tania, have you asked your parents about this?”\u003c/p\u003e\n\u003cp\u003e“I don’t need to. Just pack your things and come. Your mother is my father’s sister. He will not say no. Come, all right?”\u003c/p\u003e\n\u003cp\u003eMarina gave Tatiana a hug. “Thank you,” she whispered. “I’ve been feeling so alone in those rooms without Mama and Papa.”\u003c/p\u003e\n\u003cp\u003eTatiana patted Marina, and said, “I know — Look! Your bus!”\u003c/p\u003e\n\u003cp\u003eWaving to Tatiana, Marina ran across Nevsky to catch her bus, and Tatiana sat on the bench and waited for her tram to go back home.\u003c/p\u003e\n\u003cp\u003eShe felt sick to her stomach.\u003c/p\u003e\n\u003cp\u003eHer tram came; the doors opened. The conductor looked at her. Tatiana shook her head. The tram left.\u003c/p\u003e\n\u003cp\u003eHow could she not go to see him? She could not stay away from him.\u003c/p\u003e\n\u003cp\u003eGetting up, Tatiana limped past the Admiralty Gardens to St. Isaac’s.\u003c/p\u003e\n\u003cp\u003eTwo soldiers were walking toward her. Stopping in front of Tatiana, they banged their rifles on the pavement and asked where she was headed. She told them.\u003c/p\u003e\n\u003cp\u003eOne soldier said St. Isaac’s was closed this time of night. She said yes, but she was looking for a Lieutenant Belov. They knew him, and their serious faces relaxed. One soldier said, “I told you, Viktor, that we should have enrolled in officers’ school, and you didn’t believe me.”\u003c/p\u003e\n\u003cp\u003e“I thought it’d be more work, not more—” He glanced at Tatiana and broke off. “And who are you?”\u003c/p\u003e\n\u003cp\u003e“His cousin from Krasnodar.”\u003c/p\u003e\n\u003cp\u003e“Oh. Cousin,” said Viktor. “Well, come with us. We’ll take you to him. I don’t know how you’re going to get up to the observation arcade with that cast. It’s about two hundred steps up a spiral staircase.”\u003c/p\u003e\n\u003cp\u003e“I’ll make it,” Tatiana said.\u003c/p\u003e\n\u003cp\u003eSt. Isaac’s had never seemed so far away from Nevsky, even though it was less than a kilometer. By the time they got to the cathedral, she was panting and her leg was throbbing. In front of the cathedral on the banks of the Neva, Tatiana saw the shape of the statue of Peter the Great on his steed — the Bronze Horseman — a faint silhouette covered with a wooden form filled with canvas and sand. The Bronze Horseman was built by Catherine the Great as a tribute to Peter the Great for building Leningrad. Tonight nothing could be seen of the black horse or the majestic rider or his outstretched hand; just sandbags to protect the statue from the Germans.\u003c/p\u003e\n\u003cp\u003eViktor said, “Tomorrow they’re going to impose a curfew on the whole city. No more evening excursions. So make this meeting with Lieutenant Belov count, cousin.”\u003c/p\u003e\n\u003cp\u003eThey brought her inside the cavernous granite hall. She heard the light beating of the pendulum the Communists had placed inside the cathedral to turn the place of worship into a science museum.\u003c/p\u003e\n\u003cp\u003eThe guard at the narrow opening to the staircase asked if Tatiana was clean.\u003c/p\u003e\n\u003cp\u003e“Well, I think so. She’s not carrying any bombs.”\u003c/p\u003e\n\u003cp\u003e“Did you search her?”\u003c/p\u003e\n\u003cp\u003e“Let me,” said Viktor. He ran his hands over her ribs, making Tatiana grimace. She felt an increasing anxiety. Being alone with three soldiers in a dark, ominous building, with Alexander high up and unable to hear her, made her fear things she could not imagine. It was an irrational fear, she told herself, as Viktor’s hands moved down to her hips. He held her a little tighter, and suddenly her fear got the better of her. “Maybe one of you can just,” she said, trying to step away, “let him know I’m here.” She took another breath. “You know what? I’ll just be getting back. You can tell him I stopped by.”\u003c/p\u003e\n\u003cp\u003eA voice coming down from the staircase said, “Let go of her.” It was Alexander, who appeared in the doorway with his rifle. Tatiana breathed immediate relief.\u003c/p\u003e\n\u003cp\u003eViktor quickly let go. “Nothing to it, Lieutenant. We were just checking her for weapons. She says she is your cousin from—”\u003c/p\u003e\n\u003cp\u003e“Private!” Alexander came up close to Viktor, towering over him. “We have standards, Private, even in the Red Army. These standards do not allow us to menace young girls. Unless you want to face disciplinary action, I suggest you don’t let me catch you doing that again.” He put his hand on Tatiana’s back and said to his men, “You two, go back on the street where you belong. Corporal, you stay here until you’re relieved by Petrenko and Kapov.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir,” the three soldiers said in unison. The corporal took his post by the doorway.\u003c/p\u003e\n\u003cp\u003eAlexander was trying not to smile. “It’s quite a hike up,” he said, his hand on her back, prodding her to the staircase. “Come on.” When they were around a column and not seen by anyone’s eyes, Alexander smiled broadly. “Tania . . .” he said, “I’m so happy you came to see me.”\u003c/p\u003e\n\u003cp\u003eSighing, melting, warming, Tatiana said softly, “Me, too.”\u003c/p\u003e\n\u003cp\u003e“Did they scare you? They’re harmless,” he said, stroking her hair.\u003c/p\u003e\n\u003cp\u003e“If they’re so harmless, why did you come down?”\u003c/p\u003e\n\u003cp\u003e“I heard your voice and theirs. They’re harmless, but you sounded scared.” He was looking at her so . . .\u003c/p\u003e\n\u003cp\u003e“What?” Tatiana said shyly.\u003c/p\u003e\n\u003cp\u003e“Nothing.” Alexander crouched in front of her. “Go on. Grab my neck. Remember how to do this?”\u003c/p\u003e\n\u003cp\u003e“You’re going to carry me up two hundred stairs?”\u003c/p\u003e\n\u003cp\u003e“It’s the least I can do after you came all this way. Can you hold my weapon?”\u003c/p\u003e\n\u003cp\u003eHolding on to the rails, he propelled himself up with her hands around his neck. Hoping he wouldn’t notice, Tatiana silently kissed the back of his military tunic.\u003c/p\u003e\n\u003cp\u003eAlexander brought her into a glassed-in circular arcade with five columns that partially obstructed the view of the horizon and the sky. Setting her down, he took his rifle from her and propped it against the wall of the gold dome. “We have to go out on the balcony for a clearer view. Will you be all right?” He smiled. “We’re very high up. You’re not afraid of heights, are you?”\u003c/p\u003e\n\u003cp\u003e“I’m not afraid of heights, no,” Tatiana said, looking up at him.\u003c/p\u003e\n\u003cp\u003eThey walked out onto a narrow outdoor balcony deck circling the arcade above the rotunda. A short iron railing ran around the deck. The view from up here would have been quite striking, Tatiana thought, if only Leningrad weren’t prepared for war. All the lights were extinguished, and in the black of night she could not make out even the white airships floating silently in the dark sky. The air was cool and smelled of fresh water.\u003c/p\u003e\n\u003cp\u003e“What do you think? Nice up here?” Alexander said, coming up to her. Tatiana couldn’t move if she wanted to. She was between him and the railing.\u003c/p\u003e\n\u003cp\u003e“Mmm,” she said, peering into the night, afraid to look at him, afraid to let him see her heart. “What do you do here all by yourself, night in and night out?”\u003c/p\u003e\n\u003cp\u003e“Nothing. Sit on the floor. Smoke. Think.”\u003c/p\u003e\n\u003cp\u003eAlexander threaded his arms around her waist and closed his hands on her stomach, pressing her into him. She felt his lips at her neck whisper, “Oh, Tatia . . .”\u003c/p\u003e\n\u003cp\u003eHow instant it was, desire. It was like a bomb exploding, fragmenting and igniting all her nerve endings.\u003c/p\u003e\n\u003cp\u003eNot desire.\u003c/p\u003e\n\u003cp\u003eBurning desire for Alexander.\u003c/p\u003e\n\u003cp\u003eTatiana tried to move aside, but he held her too tightly. All she wanted was to sink to the ground. Why was that? Why, every time he touched her, did she want to lie down? “Shura, wait,” she said, not recognizing her own voice, which, thick with longing, said, Come here, come, come. Tatiana closed her eyes, muttering, “I don’t see any planes.”\u003c/p\u003e\n\u003cp\u003e“Me neither.”\u003c/p\u003e\n\u003cp\u003e“Are they coming?” She moaned softly.\u003c/p\u003e\n\u003cp\u003e“Yes. The placards are finally right. The enemy is at the gates.” He continued to kiss her under the wisps of her hair.\u003c/p\u003e\n\u003cp\u003e“Do you think there is any chance we could get out?”\u003c/p\u003e\n\u003cp\u003e“Not a chance. You’re trapped in the city.” His hot breath and his moist lips on her neck were making her shiver.\u003c/p\u003e\n\u003cp\u003e“How will it be?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer.\u003c/p\u003e\n\u003cp\u003e“You said you wanted to talk to me . . .” Tatiana said hoarsely.\u003c/p\u003e\n\u003cp\u003e“Talk?” Alexander said, holding her stomach tight against him.\u003c/p\u003e\n\u003cp\u003e“Yes, talk . . . to me . . . about . . .” She couldn’t remember what. “Dimitri?”\u003c/p\u003e\n\u003cp\u003eHe pulled her blouse away and kissed her shoulder blade. “I like your blouse,” he whispered, his mouth on her skin.\u003c/p\u003e\n\u003cp\u003e“Stop it, Shura, please.”\u003c/p\u003e\n\u003cp\u003e“No,” he said, rubbing against her back. “I can’t stop.” He breathed into her hair. “Any more than I can stop breathing.”\u003c/p\u003e\n\u003cp\u003eAlexander’s hands moved to rest below her breasts. Her healing ribs hurt slightly and exquisitely from his touch, and Tatiana couldn’t help herself, she moaned. Squeezing her tighter, he turned her around to him, his mouth on her throat and whispered, “No, you can’t make a sound. Everything carries downstairs. You can’t let them hear you.”\u003c/p\u003e\n\u003cp\u003e“Then take your hands off me,” Tatiana whispered back. “Or cover my mouth.”\u003c/p\u003e\n\u003cp\u003e“I’ll cover your mouth, all right,” he said, kissing her fervidly.\u003c/p\u003e\n\u003cp\u003eAfter three seconds Tatiana was ready to pass out. “Shura,” she moaned, grasping on to him. “God, you need to stop. How do we stop?” The pulling in her stomach was fierce.\u003c/p\u003e\n\u003cp\u003e“We don’t.”\u003c/p\u003e\n\u003cp\u003e“We do.”\u003c/p\u003e\n\u003cp\u003e“We don’t,” he repeated, his lips on her.\u003c/p\u003e\n\u003cp\u003e“I don’t mean . . . I mean, this? How do we ever get relief from this? I can’t go through my days like this, thinking of you. How do we get relief?”\u003c/p\u003e\n\u003cp\u003eAlexander pulled back from her lips. “The only thing I want in my whole life,” he whispered hotly, “is to show you how we get relief, Tania.” His hands held her to him in a vise.\u003c/p\u003e\n\u003cp\u003eTatiana remembered Marina’s words. You are just a conquest to a soldier. And despite herself, despite the unflappable certainty in the things she believed to be true, despite the shining moment with Alexander at the top of the sacred cathedral up in the Leningrad sky, Tatiana’s worst got the better of her. Not trusting her own instincts, scared and doubting, she pushed Alexander away.\u003c/p\u003e\n\u003cp\u003e“What’s the matter?” he said. “What?”\u003c/p\u003e\n\u003cp\u003eTatiana fought for her courage, struggled for the right words, afraid of asking, afraid of hearing his answer, afraid of making him angry or upset. He didn’t deserve it, and in the end she trusted and believed in him so much that it made her like herself less to think that she would give the cynical Marina any credit for her ill-chosen words. Yet the words sat in her chest and churned in her anxious, aching stomach.\u003c/p\u003e\n\u003cp\u003eTatiana didn’t want to burden Alexander. She knew he was already carrying plenty. At the same time she could not continue to let him touch her. His hands were tenderly caressing her from her hips up to her hair and back down again. “What’s the matter?” Alexander whispered. “Tania, tell me, what?”\u003c/p\u003e\n\u003cp\u003e“Wait,” she said. “Shura, can you—” She limped sideways from him. “Wait, just stop, all right?”\u003c/p\u003e\n\u003cp\u003eHe didn’t come after her, and she was a couple of meters away in the arcade when she sank to the floor and gathered her knees to her chest.\u003c/p\u003e\n\u003cp\u003e“Talk to me about Dimitri,” she said, feeling slightly deflated.\u003c/p\u003e\n\u003cp\u003e“No,” Alexander said, continuing to stand. He folded his arms. “Not until you tell me what’s bothering you.”\u003c/p\u003e\n\u003cp\u003eTatiana shook her head. She just couldn’t have this conversation with him. “I’m fine. Really.” She smiled. Did she manage a good smile? Not according to his long face.\u003c/p\u003e\n\u003cp\u003e“Just — It’s nothing.”\u003c/p\u003e\n\u003cp\u003e“All the more reason to tell me.”\u003c/p\u003e\n\u003cp\u003eLooking down at her long brown skirt, at her toes peeking out from the cast, Tatiana took a few deep breaths. “Shura, this is very, very difficult for me.”\u003c/p\u003e\n\u003cp\u003e“I know,” he said, crouching where he stood, his arms coming to rest on his knees.\u003c/p\u003e\n\u003cp\u003e“I don’t know how to say this to you,” she said without lifting her head.\u003c/p\u003e\n\u003cp\u003e“Open your mouth and speak to me,” said Alexander. “Like always.”\u003c/p\u003e\n\u003cp\u003eTatiana couldn’t find her nerve. “Alexander, there are too many more important things for us to resolve, to discuss—” Tatiana managed a quick glance at him. He was studying her with curiosity and concern. “I can’t believe I’m wasting our minutes like this—” She stopped. “But . . .” He said nothing. “Am I . . . ?” It was so stupid. What did she know of these things? She sighed. “Listen, you know who helped me get out to see you tonight? My cousin Marina.”\u003c/p\u003e\n\u003cp\u003eAlexander nodded, unsmiling. “Good. What does she have to do with us? Am I ever going to meet this girl?”\u003c/p\u003e\n\u003cp\u003e“You might not want to after I tell you what she told me . . .” Tatiana paused. “About soldiers.” She lifted her eyes. Alexander’s suddenly comprehending and upset face was filled with annoyance, and guilt.\u003c/p\u003e\n\u003cp\u003eThat was not what she wanted to see. “She told me some interesting things.”\u003c/p\u003e\n\u003cp\u003e“I bet she did.”\u003c/p\u003e\n\u003cp\u003e“She wasn’t talking about you—”\u003c/p\u003e\n\u003cp\u003e“That’s a relief.”\u003c/p\u003e\n\u003cp\u003e“She was trying to warn me about Dimitri, but she said that to soldiers all girls were just a big conquest party and notches in their belt.” Tatiana stopped talking. She thought it was very brave of her to get out even this much.\u003c/p\u003e\n\u003cp\u003eSlowly Alexander moved over to Tatiana. He didn’t touch her; he just sat by her quietly and finally said, “Do you have a question for me?”\u003c/p\u003e\n\u003cp\u003e“Do you want a question?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I won’t ask you then.”\u003c/p\u003e\n\u003cp\u003e“I didn’t say I wouldn’t answer it. I said I didn’t want it.”\u003c/p\u003e\n\u003cp\u003eTatiana wished she could look into Alexander’s face. She just didn’t want to see the guilt there again. And she thought, what if, after our summer, after Kirov, after Luga, after all the unfathomable, breath-dissolving things that I have felt — what if after all that, I will right now find out that Marina was right about Alexander, too? Tatiana could not ask. Yet to have so much of what she felt be built on a lie . . . How could she not?\u003c/p\u003e\n\u003cp\u003e“What’s your question?” Alexander repeated, so softly, so patiently, so everything of what he had been to her, that Tatiana, strengthened by him, as always, opened her mouth and in her smallest voice said, “Shura, is that what I am . . . just another conquest to you? Just more difficult? Am I, too, just another young, difficult notch in your belt?” She lifted her uncertain, vulnerable eyes to him.\u003c/p\u003e\n\u003cp\u003eAlexander enveloped her in his arms whole, all gathered together like a tiny bandaged package. Kissing her head, he whispered, “I don’t know what I am going to do with you.” Pulling away slightly, he cupped her face. His eyes sparkled. “Tatiasha,” he said beseechingly, “what are you talking about? Have you forgotten the hospital? Conquest? Have you forgotten that if I wanted to, that night, or the following night, or any night that followed, I could have taken it from you standing?” He stared at her and said, even more quietly, “And you would have given it to me standing. Have you forgotten that it was I who put a stop to our senseless desperation?”\u003c/p\u003e\n\u003cp\u003eTatiana shut her eyes.\u003c/p\u003e\n\u003cp\u003eAlexander held her face firmly in his hands. “Come on, open your eyes and look at me. Look at me, Tania.”\u003c/p\u003e\n\u003cp\u003eShe opened her mortified and emotional eyes to find Alexander gazing at her with unremitting tenderness. “Tania, please. You’re not my conquest, you’re not a notch in my belt. I know how difficult it is, what you are feeling. I wish you wouldn’t worry yourself for a second with things you know to be plainly not true.” He kissed her passionately. “Do you feel my lips?” Alexander whispered. “When I kiss you” — he kissed her tenderly — “don’t you feel my lips? What are they telling you? What are my hands telling you?”\u003c/p\u003e\n\u003cp\u003eTatiana closed her eyes and moaned. Why did she feel so helpless near him, why? It occurred to her that not only was he right, not only would she have given it to him then, but she would give it to him now, on the cold hard floor of the gilded rotunda. When she opened her eyes, Alexander was looking at her and smiling lightly. “Perhaps,” he said softly, “what you should be asking me is not, are you another notch in my belt, but why aren’t you another notch in my belt?”\u003c/p\u003e\n\u003cp\u003eTatiana’s hands were trembling as she held his sleeves. “All right,” she whispered. “Why?”\u003c/p\u003e\n\u003cp\u003eAlexander laughed.\u003c/p\u003e\n\u003cp\u003eTatiana cleared her throat. “Do you know what else Marina told me?”\u003c/p\u003e\n\u003cp\u003e“Oh, that Marina,” said Alexander, sighing and moving away. “What else did Marina tell you?”\u003c/p\u003e\n\u003cp\u003eTatiana curled back into her knees. “Marina told me,” she said, “that all soldiers have it off with garrison hacks nonstop and never say no.”\u003c/p\u003e\n\u003cp\u003e“My, my,” said Alexander, shaking his head. “That Marina is trouble. It’s a good thing you didn’t get off the bus to go and see her that Sunday in June.”\u003c/p\u003e\n\u003cp\u003e“I agree,” said Tatiana, her face melting at the memory of them on that bus.\u003c/p\u003e\n\u003cp\u003eAnd his face melted back.\u003c/p\u003e\n\u003cp\u003eWhat was she even thinking? What was she even doing? Tatiana shook her head, upset at herself.\u003c/p\u003e\n\u003cp\u003e“Now, listen to me. I didn’t want to tell you any of this, but . . .” Alexander drew a deep breath. “When I first got into the army, I saw that genuine relationships with women were going to be very difficult because of the nature of our confinement” — he shrugged — “and the realities of Soviet life. No rooms, no apartments, no hotels for the Soviet man and the Soviet woman to go to. You want the truth from me? Here it is. I don’t want you to be afraid of it or afraid of me because of it. On our weekend furlough, it is true, we would go out for some beers and often find ourselves in the presence of all kinds of young women, who were quite willing to . . . knock around with soldiers without any strings attached.” Alexander stopped.\u003c/p\u003e\n\u003cp\u003e“And did you” — Tatiana held her breath — “knock around?”\u003c/p\u003e\n\u003cp\u003e“Once or twice,” Alexander replied. He didn’t look at her. “Don’t be upset by this, please.”\u003c/p\u003e\n\u003cp\u003e“I’m not upset,” Tatiana mouthed. Stunned, yes. Torn with self-doubt, yes. Entranced by you, yes again.\u003c/p\u003e\n\u003cp\u003e“We were all just having a bit of youthful fun. I kept myself extremely unattached and detached. I hated entanglements—”\u003c/p\u003e\n\u003cp\u003e“What about Dasha?”\u003c/p\u003e\n\u003cp\u003e“What about her?” Alexander said tiredly.\u003c/p\u003e\n\u003cp\u003e“Was Dasha . . . ?” Tatiana couldn’t get the words out.\u003c/p\u003e\n\u003cp\u003e“Tatia, please,” said Alexander, shaking his head. “Don’t think about these things. Ask Dasha what kind of a girl she was. I’m not the one to tell you.”\u003c/p\u003e\n\u003cp\u003e“Alexander, but Dasha is an entanglement!” Tatiana exclaimed. “Dasha does have strings attached to her. Dasha has her heart.”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “She has you.”\u003c/p\u003e\n\u003cp\u003eTatiana sighed heavily. This was too hard for her — talking about Alexander and her sister. Hearing about Alexander and meaningless girls was easier than hearing about one Dasha. Tatiana sat with her hands around her knees. She wanted to ask him about the present time but couldn’t get the words out. She didn’t want to ask him about anything. She wanted to go back to how it was before the night in the hospital, before the wretched confusion of her body blinded her to the truth she felt about him.\u003c/p\u003e\n\u003cp\u003eAlexander rubbed her thighs. “I can feel you’re afraid.” Quietly, he added, “Tania, I beg you — don’t let stupidity come between us.”\u003c/p\u003e\n\u003cp\u003e“All right,” she said with remorse.\u003c/p\u003e\n\u003cp\u003e“Don’t let bullshit that has nothing to do with us keep you away from me. We already have so much keeping you away from me.” He paused. “Everything.”\u003c/p\u003e\n\u003cp\u003e“All right, Alexander.”\u003c/p\u003e\n\u003cp\u003e“Let it all fall away, Tatiana. What are you afraid of?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid of being wrong about you,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Tania, how could you of all people be wrong about me?” Alexander clenched his fists in frustration. “Can’t you see,” he said, “it’s exactly because of who I had been that I came to you? What’s the matter?” he asked. “You couldn’t see my loneliness?”\u003c/p\u003e\n\u003cp\u003e“Barely,” Tatiana replied, clutching her hands to her chest, “through my own.” Falling back against the railing, Tatiana said, “Shura, I’m surrounded by half-truth and innuendo. You and I don’t have a moment to talk anymore, like we used to, a moment to be alone—”\u003c/p\u003e\n\u003cp\u003e“A moment of privacy,” said Alexander, speaking the last word in English.\u003c/p\u003e\n\u003cp\u003e“Of what?” She didn’t know that word. She would have to look it up when she got home. “What about now? Besides Dasha, are you still—”\u003c/p\u003e\n\u003cp\u003e“Tatiana,” said Alexander, “all the things you’re worried about — they’re gone from my life. Do you know why? Because when I met you, I knew that if I continued and a good girl like you ever asked me about them, I wouldn’t be able to look you in the face and tell you the truth. I would have to look you in the face and lie.” He was looking into her face. The wordless truth was in his eyes.\u003c/p\u003e\n\u003cp\u003eTatiana smiled at him and breathed out, the tight, sick feeling in her stomach dissolving with her exhaled breath. She wanted him to come and hug her. “I’m sorry, Alexander,” she whispered. “I’m sorry for my doubt. I’m just too young.”\u003c/p\u003e\n\u003cp\u003e“You’re too much of everything,” he said. “God!” he exclaimed. “How insane this is — never to have the time to explain, to talk anything out, never to have a minute—”\u003c/p\u003e\n\u003cp\u003eWe’ve had a minute, Tatiana thought. We had our minutes on the bus. And at Kirov. We had our minutes in Luga. And in the Summer Garden. Breathless minutes, we had. What we want, she thought, keeping herself from welling up, is eternity.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Shura,” Tatiana said, grasping his hands. “I didn’t mean to upset you.”\u003c/p\u003e\n\u003cp\u003e“Tania, if only we could have a moment of privacy,” Alexander said, again speaking the last word in English, “you would never doubt me again.”\u003c/p\u003e\n\u003cp\u003e“What is this privacy?” she repeated.\u003c/p\u003e\n\u003cp\u003eAlexander smiled sadly. “Being secluded from the view or from the presence of other human beings. When we need to be alone together to have intimacy, that’s impossible in two rooms with six other people,” he explained in Russian. “We say, we want some privacy.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Tatiana blushed. So that was the word she had been searching for, ever since she met him! “There is no word for anything like that in Russian.”\u003c/p\u003e\n\u003cp\u003e“I know,” he said.\u003c/p\u003e\n\u003cp\u003e“And there is a word for this in America?”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Alexander. “Privacy.”\u003c/p\u003e\n\u003cp\u003eTatiana remained silent.\u003c/p\u003e\n\u003cp\u003eAlexander slid closer, putting both his legs around her. “Tania, when will we next have a moment alone?” he asked, peering into her eyes.\u003c/p\u003e\n\u003cp\u003e“We’re alone now,” she said.\u003c/p\u003e\n\u003cp\u003e“When will I next be able to kiss you?”\u003c/p\u003e\n\u003cp\u003e“Kiss me now,” she whispered.\u003c/p\u003e\n\u003cp\u003eBut Alexander didn’t. He said grimly, “Do you know that it might be never? The Germans are here. Do you know what that means? Life, as you knew it, is over.”\u003c/p\u003e\n\u003cp\u003e“What about this summer?” she asked. “Nothing’s been quite the same since June 22.”\u003c/p\u003e\n\u003cp\u003e“No, it hasn’t,” he agreed. “But before today we were simply arming ourselves. Now it’s war. Leningrad will be the battleground for your freedom. And at the end, how many of us will be left standing? How many of us will be free?”\u003c/p\u003e\n\u003cp\u003eOh, God. “Is that why you come every chance you get, even if it means dragging Dimitri with you?” Tatiana asked.\u003c/p\u003e\n\u003cp\u003eWith a small nod and a large sigh, Alexander said, “I’m always afraid it’ll be the last time I’m going to see your face.”\u003c/p\u003e\n\u003cp\u003eTatiana swallowed, curled into her knees. “Why . . . do you always drag him with you?” she asked. “Can’t you ask him to leave me alone? He doesn’t listen to me. What am I going to do with him?”\u003c/p\u003e\n\u003cp\u003eAlexander made no reply, and Tatiana anxiously tried to catch his eye. “Tell me about Dimitri, Shura,” she said quietly. “What do you owe him?”\u003c/p\u003e\n\u003cp\u003eAlexander looked at his cigarettes.\u003c/p\u003e\n\u003cp\u003eFaintly Tatiana said, “Do you owe him . . . me?”\u003c/p\u003e\n\u003cp\u003e“Tatiana,” Alexander said, “Dimitri knows who I am.”\u003c/p\u003e\n\u003cp\u003e“Stop,” she uttered almost inaudibly.\u003c/p\u003e\n\u003cp\u003e“If I tell you, you won’t believe it,” Alexander said. “Once I tell you, there will be no going back for us.”\u003c/p\u003e\n\u003cp\u003e“There is no going back for us now,” Tatiana said, and wanted to mouth a prayer.\u003c/p\u003e\n\u003cp\u003e“I don’t know what to do about him,” Alexander said.\u003c/p\u003e\n\u003cp\u003e“I will help you,” said Tatiana, her heart scared and swelling. “Tell me.”\u003c/p\u003e\n\u003cp\u003eAlexander moved away on the narrow balcony to sit diagonally across from her against the wall, stretching his legs out to her. Tatiana continued to sit against the railing. She sensed he didn’t want her too close. Taking off her one shoe, Tatiana stretched her bare feet out to his boots. Her foot was half the size of his.\u003c/p\u003e\n\u003cp\u003eShuddering as if trying to stave off a beast, Alexander began. “When my mother was arrested,” he said, not looking at Tatiana, “the NKVD came for me, too. I wasn’t even able to say good-bye to her.” Alexander looked away. “I don’t like to talk about my mother, as you can imagine. I was accused of distributing some capitalist propaganda when I had been fourteen, still in Moscow, and going to Communist Party meetings with my father. So at seventeen, in Leningrad, I was arrested and taken right to Kresty, the inner-city prison for nonpolitical criminals. They didn’t have room for me at Shpalerka, the Big House, the political detention center. I was convicted in camera in about three hours,” Alexander said with scorn. “They didn’t even bother with an interrogation. I think all their interrogators were tied up with more important prisoners. I got ten years in Vladivostok. Can you imagine?”\u003c/p\u003e\n\u003cp\u003e“No,” said Tatiana.\u003c/p\u003e\n\u003cp\u003e“You know how many of us finally got on that train headed for Vladivostok? A thousand. One man said to me, ‘Oh, I just got out, and now this again.’ He told me the prison camp we were going to had 80,000 people in it. Eighty thousand, Tania! One camp. I told him I didn’t believe it. I had just turned seventeen.” Alexander looked at her. “Like you are now.” He continued, “What could I do? I couldn’t spend ten years of my youth in prison, could I?”\u003c/p\u003e\n\u003cp\u003e“No,” she said.\u003c/p\u003e\n\u003cp\u003e“I had always believed, you see, that I was meant to live a good life. My mother and father believed in me. I believed in myself—” He broke off. “Prison never entered into it. I never stole, I never broke windows, I didn’t terrorize old ladies. I did nothing wrong. I wasn’t going. So,” he said, “we were crossing the river Volga, near Kazan, thirty meters up over a precipice. I knew it was either now or I was going to Vladivostok for what seemed to me like the rest of my life. I had too much hope for myself. So I jumped right into the river.” Alexander laughed. “They didn’t even stop the train. They thought for sure I had died in the fall.”\u003c/p\u003e\n\u003cp\u003e“They didn’t know who they were dealing with,” said Tatiana, wanting to put her arms around him, but he was too far away. “When you jumped, was that when you found out you indeed could swim?” She smiled.\u003c/p\u003e\n\u003cp\u003eAlexander smiled back. The soles of his boots were touching the soles of her feet. “I could swim a little bit.”\u003c/p\u003e\n\u003cp\u003e“Did you have anything on you?”\u003c/p\u003e\n\u003cp\u003e“Nothing.”\u003c/p\u003e\n\u003cp\u003e“Papers? Money?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” Tatiana thought Alexander wanted to tell her something else, but he continued. “It was the summer of 1936. After I escaped, I made my way south on the Volga, on fishing boats, by foot, in the back of horse carriages. I fished, worked briefly on farms, and moved on south. From Kazan to Ulyanovsk, where Lenin was born — interesting city, like a shrine. Then to Saratov, downstream on the Volga, fishing, harvesting, moving on. Wound up in Krasnodar, near the Black Sea. I was headed down south into Georgia, and then Turkey. I hoped to cross the border somewhere in the Caucasus Mountains.”\u003c/p\u003e\n\u003cp\u003e“But you had no money.”\u003c/p\u003e\n\u003cp\u003e“None,” Alexander said. “But I made some along the way, and I did think that my English, once I got into Turkey, would help me. But in Krasnodar, fate intervened.” He glanced at her. “As always. It was a brutal winter, and the family I was staying with, the Belovs—”\u003c/p\u003e\n\u003cp\u003e“The Belovs?” exclaimed Tatiana.\u003c/p\u003e\n\u003cp\u003eAlexander nodded. “A nice farming family. Father, mother, four sons, one daughter.” He cleared his throat. “Me. We all got typhus. The entire village of Belyi Yar — 360 people — got typhus. Eight-tenths of the village population perished, including the Belovs, the daughter first. The local council from Krasnodar, with the help of the police, came and burned down the village, for fear that the epidemic would spread to the nearby city. All my clothes were burned, and I was quarantined until I either died or got better. I got better. The local Soviet councilman came to issue me new papers. Without a moment’s hesitation I said I was Alexander Belov. Since they burned the village in its entire—” Alexander raised his eyebrows. “Only in the Soviet Union. Anyway, since they burned the village, the councilman could not confirm or deny my claim to be Alexander Belov, the youngest Belov boy.”\u003c/p\u003e\n\u003cp\u003eTatiana closed her mouth.\u003c/p\u003e\n\u003cp\u003e“So I was issued a brand-new domestic passport and a brand-new identity. I was Alexander Nikolaevich Belov, born in Krasnodar, orphaned at seventeen.” He looked away.\u003c/p\u003e\n\u003cp\u003e“What was your full American name?” asked Tatiana faintly.\u003c/p\u003e\n\u003cp\u003e“Anthony Alexander Barrington.”\u003c/p\u003e\n\u003cp\u003e“Anthony!” she exclaimed.\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. “Anthony was for my mother’s father. I myself was never anything but Alexander.” He pulled out a cigarette. “You don’t mind?”\u003c/p\u003e\n\u003cp\u003eTatiana shook her head.\u003c/p\u003e\n\u003cp\u003e“Anyway,” he said, “I returned to Leningrad and went to stay with relatives of the Belovs. I needed to be back in Leningrad—” Alexander hesitated. “I’ll tell you why in a minute. I stayed with my ‘aunt,’ Mira Belov, and her family. They lived on the Vyborg side. They hadn’t seen their nephews in a decade; it was ideal. I was like a stranger to them.” He smiled. “But they let me stay. I finished school. And it was in this school that I met Dimitri.”\u003c/p\u003e\n\u003cp\u003e“Oh, Alexander,” said Tatiana. “I cannot believe what you lived through when you were so young.”\u003c/p\u003e\n\u003cp\u003e“I’m far from finished. Dimitri was one of the kids I played with at school. He was spindly, unpopular, and never much fun. When we played war at recess, he was always the one taken prisoner. Dimitri POW Chernenko we used to call him. We said that for him alone the Soviet Union should have signed the 1929 Geneva Convention, because he was getting himself wounded or taken prisoner or killed every time we played, managing to get himself caught somehow without help from anyone.”\u003c/p\u003e\n\u003cp\u003e“Please go on.”\u003c/p\u003e\n\u003cp\u003e“But then I found out that his father was a prison guard at Shpalerka.” Alexander stopped.\u003c/p\u003e\n\u003cp\u003eTatiana stopped breathing. “Your parents were still alive?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know,” Alexander said. “So I chose to become close to Dimitri. I hoped that maybe he could help me see my mother and father. I knew that if they were alive, they would be tortured by their worries about me. I wanted to let them know I was all right.” He paused. “My mother particularly,” he said, his voice controlled. “We had been very close once.”\u003c/p\u003e\n\u003cp\u003eTatiana’s eyes filled with tears. “What about your father?”\u003c/p\u003e\n\u003cp\u003eWith a shrug, Alexander said, “He was my father. We had some conflict in the last years. What can I say? He thought he knew everything. I thought I knew everything. So it went.”\u003c/p\u003e\n\u003cp\u003eTatiana did not blink as she stared at Alexander, transfixed. “Shura, they must have loved you so much.” She swallowed hard.\u003c/p\u003e\n\u003cp\u003e“Yes,” Alexander said, taking a deep, pained drag of the cigarette. “They did once love me.”\u003c/p\u003e\n\u003cp\u003eTatiana’s heart was breaking for Alexander.\u003c/p\u003e\n\u003cp\u003e“Little by little,” he continued, “I gained Dimitri’s confidence, and we became better and better friends. Dima really liked the fact that I picked him out of many to be my closest friend.”\u003c/p\u003e\n\u003cp\u003e“Oh, Shura,” said Tatiana. She understood. Crawling to him, Tatiana wrapped her arms around Alexander. “You had to trust Dimitri.”\u003c/p\u003e\n\u003cp\u003eWith one arm he hugged her back. The other held his cigarette. “Yes. I had to tell him who I was. I had no choice but to trust him. Leave my parents to die, or trust him.”\u003c/p\u003e\n\u003cp\u003e“You trusted Dimitri,” Tatiana repeated incredulously, letting go of him and sitting close by his side.\u003c/p\u003e\n\u003cp\u003e“Yes.” Alexander looked down into his large hands, as if trying to find the answer to his life in them. “I didn’t want to trust him. My father, the good Communist that he was, taught me never to trust anyone, and though it wasn’t easy, I learned that lesson well. But it’s a hard way to live, and I wanted to trust just one person in my life. Just one. I really needed Dimitri’s help. Besides, I was his friend. I said to myself that if he did this for me and I got to see my mother and father, I would be his friend for life. And that’s exactly what I told him. ‘Dima,’ I said, ‘I will be your friend for life. I will help you in any way that I can.’ ” Alexander lit another cigarette. Tatiana waited, the aching in her chest increasing.\u003c/p\u003e\n\u003cp\u003e“Dimitri’s father found out that I was too late to see my mother.” Alexander’s voice cracked. “He told me what had happened to her. But my father was still alive, though apparently not for long. He’d already been in prison for nearly a year. Chernenko got Dimitri and me inside Shpalerka, and then we had five minutes with the foreign infiltrator, Harold Barrington. Me, my father, Dimitri, his father, and another guard. No privacy for me and my father.”\u003c/p\u003e\n\u003cp\u003eTatiana took Alexander’s hand. “How was that?”\u003c/p\u003e\n\u003cp\u003eAlexander stared straight ahead. “Pretty much how you imagine it might be,” he said, keeping his voice even. “And bitterly brief.”\u003c/p\u003e\n\u003cp\u003eIn the small gray concrete cell, Alexander looked at his father, and Harold Barrington looked at Alexander. Harold did not move from his bed.\u003c/p\u003e\n\u003cp\u003eDimitri stood in the center of the small cell, Alexander to the side. The guard and Dimitri’s father were behind them. A single lightbulb hung from the ceiling.\u003c/p\u003e\n\u003cp\u003eIn Russian, Dimitri said to Harold, “We are here for only a minute, comrade. You understand? Just for a minute.”\u003c/p\u003e\n\u003cp\u003e“All right,” replied Harold in Russian, blinking back tears. “Thank you for coming to see me. I’m happy to see two Soviet boys. Your name, son?” he asked Dimitri.\u003c/p\u003e\n\u003cp\u003e“Dimitri Chernenko.”\u003c/p\u003e\n\u003cp\u003e“And your name, son?” His body shaking, Harold looked at Alexander.\u003c/p\u003e\n\u003cp\u003e“Alexander Belov,” said Alexander.\u003c/p\u003e\n\u003cp\u003eHarold nodded.\u003c/p\u003e\n\u003cp\u003eThe guard said, “All right, enough gawking at the prisoner. Let’s go.”\u003c/p\u003e\n\u003cp\u003eDimitri said, “Wait! We just wanted the comrade to know that despite his crime against our proletarian society, he will not be forgotten.”\u003c/p\u003e\n\u003cp\u003eAlexander said nothing, his eyes on his father.\u003c/p\u003e\n\u003cp\u003e“It’s because of his crime against our society that he will not be forgotten,” said the guard.\u003c/p\u003e\n\u003cp\u003eChewing his lips, Harold looked at Dimitri and Alexander, whose back was to the guard but whose face was to his father.\u003c/p\u003e\n\u003cp\u003e“Popov, can I shake their hands?” Harold asked the guard.\u003c/p\u003e\n\u003cp\u003eThe guard shrugged, stepping forward. “I’m going to watch you do it. Make it quick.”\u003c/p\u003e\n\u003cp\u003eAlexander said, “I’ve never heard English before, Comrade Barrington. Can you say something for us in English?”\u003c/p\u003e\n\u003cp\u003eHarold came up to Dimitri and shook his hand. “Thank you,” he said in English.\u003c/p\u003e\n\u003cp\u003eThen he came up to Alexander and took his hand, holding it tightly between his. Alexander shook his head slightly, trying to will his father to stay calm.\u003c/p\u003e\n\u003cp\u003eIn English, Harold whispered, “Would that I had died for thee, O Absalom, my son, my son!”\u003c/p\u003e\n\u003cp\u003eAlexander mouthed, Stop.\u003c/p\u003e\n\u003cp\u003eLetting go of Alexander’s hand, Harold stepped slightly away, struggling not to cry and failing. “I’ll tell you something in English,” he said in Russian. “A few corrupted lines from Kipling.”\u003c/p\u003e\n\u003cp\u003e“Enough,” said the guard. “I have no time—”\u003c/p\u003e\n\u003cp\u003e“If you can bear to hear the truth you’ve spoken,” Harold said loudly in English, “twisted by knaves to make a trap for fools . . .” Tears rolled down his face. “Or watch the things you gave your life to, broken . . .” He was down to a whisper. “Son! — stoop and build them up with worn-out tools.” Harold stepped back and made a small sign of the cross on Alexander.\u003c/p\u003e\n\u003cp\u003e“Let’s go!” yelled the guard.\u003c/p\u003e\n\u003cp\u003eAlexander mouthed to his father, in English, “I love you, Dad.”\u003c/p\u003e\n\u003cp\u003eThen they left.\u003c/p\u003e\n\u003cp\u003eTatiana was crying. Alexander put his arm around her, and said, “Oh, Tania . . .” He wiped her face. “From the effort to remain composed,” he told her, “I cracked one of my side teeth. See?” He showed her an upper bicuspid. “Now you can stop asking me about it. So I did get to see my father once before he died, and I never would have been able to do it without Dimitri.” With a heavy breath, he took his arm away.\u003c/p\u003e\n\u003cp\u003e“Alexander,” said Tatiana, crouching beside him, “you did an unbelievable thing for your father.” Her lips trembled. “You gave him comfort before his death.” Feeling very shy, yet overwhelmed by her emotion, her throbbing heart overfilled with him, she took hold of Alexander’s hand, bent her head to it, and kissed it. Blushing and clearing her throat, she let go of him and raised her eyes.\u003c/p\u003e\n\u003cp\u003e“Tania,” he said with feeling, “who are you?”\u003c/p\u003e\n\u003cp\u003eShe replied, “I am Tatiana.” And gave him her hand. They sat silently.\u003c/p\u003e\n\u003cp\u003e“There is more.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “The rest I know.” Tatiana took Alexander’s pack of cigarettes and pulled one out. She had needed just a little truth to see the whole. She knew the rest at the point Alexander told her that he gave Dimitri something Dimitri had never had before. It wasn’t friendship, and it wasn’t companionship, and it wasn’t brotherhood. Tatiana’s hands were shaking as she put the cigarette into Alexander’s mouth, and reached for his lighter. Flicking it on, she brought it to his face, and when he inhaled, she kissed his cheek and extinguished the light.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Alexander said, smoking down half the cigarette before he continued. He kissed her. “You’re not crazy about smoker’s breath?”\u003c/p\u003e\n\u003cp\u003e“I’ll take your breath any way you give it to me, Shura,” said Tatiana, blushing again. Then she spoke. “Let me tell you the rest. You and Dimitri enrolled in university. You and Dimitri joined the army. You and Dimitri went to officers’ school together. And then Dimitri didn’t make it.” She lowered her head. “At first he was all right with it. You remained best friends. He knew you would do anything for him.” She paused. “And then,” Tatiana said, raising her eyes, “he started asking.”\u003c/p\u003e\n\u003cp\u003e“I see,” said Alexander. “So you do know everything.”\u003c/p\u003e\n\u003cp\u003e“What does he ask you for, Shura?”\u003c/p\u003e\n\u003cp\u003e“You name it.”\u003c/p\u003e\n\u003cp\u003eThey didn’t look at each other.\u003c/p\u003e\n\u003cp\u003e“He asks you to transfer him here, to make exceptions for him there, he asks you for special privileges and for special treatment.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Anything else?”\u003c/p\u003e\n\u003cp\u003eAlexander was mute for a few minutes. It was such a long time that Tatiana thought he had forgotten her question. She waited patiently. Finally Alexander said, his voice filled with something, “Very occasionally, girls. You’d think there was plenty for everyone, but every once in a while I would be with a girl Dimitri wanted to be with. He’d ask me, and I’d back off. I just went and found myself a new girl, and things went on as before.”\u003c/p\u003e\n\u003cp\u003eTatiana stared ahead, her eyes the clearest sea green. “Alexander, tell me something. When Dimitri asked you for a girl, he only asked for one you actually liked, right?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“He didn’t want just any of your girls. He asked you for girls that he saw you liked. That’s when he asked. Right?”\u003c/p\u003e\n\u003cp\u003eAlexander was pensive. “I guess.”\u003c/p\u003e\n\u003cp\u003eSlowly Tatiana said, “So when he asked you for me, you just backed off.”\u003c/p\u003e\n\u003cp\u003e“Wrong. What I did was show him my indifferent face, hoping that if he thought you didn’t matter to me, he would leave you alone. Unfortunately, that has backfired.”\u003c/p\u003e\n\u003cp\u003eTatiana nodded, then shook her head, then started to cry. “Yes, you’re not doing such a good job with your face, Shura. He won’t leave me alone.”\u003c/p\u003e\n\u003cp\u003e“Please.” Alexander brought her into his arms. “I told you this was a dire mess. I can back off you now as far as Japan for all he cares. Because now Dimitri has fallen for you and wants you for himself.” He stopped.\u003c/p\u003e\n\u003cp\u003eTatiana studied Alexander for a few moments and then pressed herself into him. “Shura,” she said quietly, “I’m going to tell you something right now, all right? Are you listening?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Don’t hold your breath like that.” She managed a smile. “What do you think I’m about to say?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’m ill equipped to guess at the moment. Maybe you have a small child living with a distant aunt?”\u003c/p\u003e\n\u003cp\u003eTatiana laughed lightly. “No.” She paused. “But are you ready?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eTatiana said, “Dimitri has not fallen for me.”\u003c/p\u003e\n\u003cp\u003eAlexander pulled away from her.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No. Not at all. Not even remotely. Believe me when I tell you.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“So what does he want with you then? Don’t even suggest—”\u003c/p\u003e\n\u003cp\u003e“Not with me. All Dimitri wants — listen carefully — all he craves, all he desires, all he covets is power. That’s the only thing that’s important to him. That’s the love of his life. Power.”\u003c/p\u003e\n\u003cp\u003e“Power over you?”\u003c/p\u003e\n\u003cp\u003e“No, Alexander! Power over you. I’m just a means to an end. I’m just ammunition.”\u003c/p\u003e\n\u003cp\u003eWhen he looked at her skeptically, she continued. “Dimitri doesn’t have any. You have it all. All he has is what he has over you. That’s his whole life.” She shook her head. “How sad for him.”\u003c/p\u003e\n\u003cp\u003e“Sad for him!” Alexander exclaimed. “Whose side are you on?”\u003c/p\u003e\n\u003cp\u003eTatiana didn’t speak for a moment. “Shura, look at you. And look at him. Dimitri needs you, he is fed and sheltered and grown by you, and if you’re stronger, he becomes stronger, too. He knows that and depends on you blindly for so many things that you are glad to provide. And yet . . . the more you have, the more he hates you. Self-preservation may be his driving force, but all the same, every time you get a promotion, you go up in rank, you get a new medal, you get a new girl, every time you laugh with joy in the smoky corridor, it diminishes and lessens him. Which is why the more powerful you become, the more he wants from you.”\u003c/p\u003e\n\u003cp\u003e“Eventually,” said Alexander, glancing at Tatiana, “he is going to want from me something I can’t give. And then what?”\u003c/p\u003e\n\u003cp\u003e“Coveting from you the best of what you have will eventually lead him into hell.”\u003c/p\u003e\n\u003cp\u003e“Yes, but me into death.” Alexander shook his head. “Unspoken underneath all his pleas and requests is that one word from him about my American past to the NKVD general at the garrison, one vague accusation, and I instantly vanish into the maw of Soviet justice.”\u003c/p\u003e\n\u003cp\u003eNodding sadly, Tatiana said, “I know it. But maybe if he had more, he wouldn’t want so much.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong, Tania. I have a bad feeling about Dimitri. I have a feeling he is going to want more and more from me. Until,” Alexander said, “he takes it all.”\u003c/p\u003e\n\u003cp\u003e“No, you’re wrong, Shura. Dimitri will never take all away from you. He will never have that much power.” He might want to. He just doesn’t know who he is dealing with, Tatiana thought, raising her venerating eyes to Alexander. “Besides, we all know what happens to the parasite when something happens to the host,” she whispered.\u003c/p\u003e\n\u003cp\u003eAlexander gazed down at her. “Yes. He finds himself a new host. Let me ask you,” he finally said, “what do you think Dimitri wants the most from me?”\u003c/p\u003e\n\u003cp\u003e“What you want most.”\u003c/p\u003e\n\u003cp\u003e“But, Tania,” said Alexander intensely, “it’s you that I want most.”\u003c/p\u003e\n\u003cp\u003eTatiana looked into his face. “Yes, Shura,” she said. “And he knows it. As I said from the beginning — Dimitri has not fallen for me at all. All he wants is to hurt you.”\u003c/p\u003e\n\u003cp\u003eAlexander was quiet for a spate of eternity under the August sky.\u003c/p\u003e\n\u003cp\u003eSo was Tatiana until she whispered, “Where is your brave and indifferent face? Put it on and he will back away and ask you to give him what you wanted most before me.”\u003c/p\u003e\n\u003cp\u003eAlexander did not move and did not speak.\u003c/p\u003e\n\u003cp\u003e“Before me.” Why was he so silent? “Shura?” She thought she felt him shudder.\u003c/p\u003e\n\u003cp\u003e“Tania, stop. I can’t talk to you about this anymore.”\u003c/p\u003e\n\u003cp\u003eShe could not steady her hands. “All of this — all this between us, and my Dasha, too, now and forever, and still you come for me every chance you can.”\u003c/p\u003e\n\u003cp\u003e“I told you, I cannot stay away from you,” said Alexander.\u003c/p\u003e\n\u003cp\u003eFlinching with sadness, Tatiana said, “God, we need to forget each other, Shura. I can’t believe how not meant to be we are.”\u003c/p\u003e\n\u003cp\u003e“You don’t say?” Alexander smiled. “I will bet my rifle that your ending up on that bench two months ago was the most unlikely part of your day.”\u003c/p\u003e\n\u003cp\u003eHe was right. Most of all, Tatiana remembered the bus she had decided not to take so she could buy herself an ice cream. “And you would know this how?”\u003c/p\u003e\n\u003cp\u003e“Because,” said Alexander, “my walking by that bench was the most unlikely part of mine.” He nodded. “All this wedged between us — and when we do our best, and grit our teeth, and move away from one another, struggling to reconstruct ourselves, fate intervenes again, and bricks fall from the sky that I remove from your alive and broken body. Was that also not meant to be, perhaps?”\u003c/p\u003e\n\u003cp\u003eTatiana inhaled a sob. “That’s right,” she said softly. “We can’t forget that I owe you my life.” She gazed at him. “We can’t forget that I belong to you.”\u003c/p\u003e\n\u003cp\u003e“I like the sound of that,” Alexander said, hugging her tighter.\u003c/p\u003e\n\u003cp\u003e“Retreat, Shura,” Tatiana whispered. “Retreat and take your weapons with you. Spare me from him.” She paused. “He just needs to believe you don’t care for me, and then he will lose all interest. You’ll see. He’ll go away, he’ll go to the front. We all have to get through the war before we get to what’s on the other side. So will you do that?”\u003c/p\u003e\n\u003cp\u003e“I’ll do my best.”\u003c/p\u003e\n\u003cp\u003e“Are you going to stop coming around?” she asked tremulously.\u003c/p\u003e\n\u003cp\u003e“No,” said Alexander. “I can’t retreat that far. Just stay away from me.”\u003c/p\u003e\n\u003cp\u003e“All right.” Her heart skipped. She clutched him.\u003c/p\u003e\n\u003cp\u003e“And forgive me in advance for my cold face. Can I trust you to do that?”\u003c/p\u003e\n\u003cp\u003eNodding, Tatiana rubbed her cheek against his arm, pressing her head to him. “Trust me,” she whispered. “Trust in me. Alexander Barrington, I will never betray you.”\u003c/p\u003e\n\u003cp\u003e“Yes, but will you ever deny me?” he asked tenderly.\u003c/p\u003e\n\u003cp\u003e“Only in front of my Dasha,” she replied. “And your Dimitri.”\u003c/p\u003e\n\u003cp\u003eLifting her face to him, with an ironic smile Alexander said, “Aren’t you glad now that God stopped us at the hospital?”\u003c/p\u003e\n\u003cp\u003eTatiana smiled lightly back. “No.” She sat wrapped in his arms. They stared at each other. She put her palm out to him. He put his palm against hers. “Look,” she said quietly. “My fingertips barely come up to your second knuckle.”\u003c/p\u003e\n\u003cp\u003e“I’m looking,” he whispered, threading his fingers through hers and squeezing her hand so hard that Tatiana groaned and then blushed.\u003c/p\u003e\n\u003cp\u003eBringing his face to hers, Alexander kissed the skin near her nose. “Have I ever told you I adore your freckles?” he murmured. “They are very enticing.”\u003c/p\u003e\n\u003cp\u003eShe purred back. Their fingers remained entwined as they kissed.\u003c/p\u003e\n\u003cp\u003e“Tatiasha . . .” Alexander whispered, “you have amazing lips . . .” He paused and pulled away. “You are” — reluctantly she opened her eyes to meet his gaze — “you are oblivious to yourself. It’s one of your most endearing, most infuriating qualities . . .”\u003c/p\u003e\n\u003cp\u003e“Don’t know what you mean . . .” She had no brain left. “Shura, how can there be not a single place in this world we can go?” Her voice broke. “What kind of a life is this?”\u003c/p\u003e\n\u003cp\u003e“The Communist life,” Alexander replied.\u003c/p\u003e\n\u003cp\u003eThey huddled closer.\u003c/p\u003e\n\u003cp\u003e“You crazy man,” she said fondly. “What were you doing fighting with me at Kirov, knowing all this was stacked against us?”\u003c/p\u003e\n\u003cp\u003e“Raging against my fate,” said Alexander. “It’s the only f*cking thing I ever do. I just refuse to be defeated.”\u003c/p\u003e\n\u003cp\u003eI love you, Alexander, Tatiana wanted to say to him, but couldn’t. I love you. She bowed her head. “I have too young a heart . . .” she whispered.\u003c/p\u003e\n\u003cp\u003eAlexander’s arms engulfed her. “Tatia,” he whispered, “you do have a young heart.” He tipped her back a little and kissed her between her breasts. “I wish with all of mine, I wasn’t forced to pass it by.”\u003c/p\u003e\n\u003cp\u003eSuddenly he moved away and jumped to his feet. Tatiana herself heard a noise behind them in the arcade. Sergeant Petrenko stuck his head out onto the balcony, saying it was time for a shift change.\u003c/p\u003e\n\u003cp\u003eAlexander carried Tatiana down on his back, and then, with his arm around her, they hobbled through the city streets, back to Fifth Soviet. It was after two in the morning. Tomorrow their day would begin at six, and yet here they both were, clinging to each other in the last remaining hours of night. He carried her in his arms down Nevsky Prospekt. She carried his rifle. He carried her on his back.\u003c/p\u003e\n\u003cp\u003eThey were very alone as they made their way through dark Leningrad. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-26.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
