{"id":79994,"no":62,"title":"Page 62","content":"\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eThey walked slowly to Molotov. Her arm was through his. The sunlight peeked through above the pines.\u003c/p\u003e\n\u003cp\u003e“Shura, I’ve been practicing my English.”\u003c/p\u003e\n\u003cp\u003e“You have? You told me you haven’t had time. Seeing your life, I believed you.”\u003c/p\u003e\n\u003cp\u003eTatiana cleared her throat and said in English, “Alexander Barrington, I want forever love in you.”\u003c/p\u003e\n\u003cp\u003eBringing her close, Alexander laughed and replied in English, “Yes, me, too.” He paused, looking down at her.\u003c/p\u003e\n\u003cp\u003eShe looked up at him. “What?”\u003c/p\u003e\n\u003cp\u003e“You’re walking slowly. Are you all right?”\u003c/p\u003e\n\u003cp\u003e“I’m fine.” She blushed. She was not. “What?”\u003c/p\u003e\n\u003cp\u003eAlexander smiled. “Want me to carry you for a bit?” he asked huskily.\u003c/p\u003e\n\u003cp\u003eHer face melted. “Yes,” Tatiana replied. “But this time in your arms.”\u003c/p\u003e\n\u003cp\u003e“Someday,” Alexander said, lifting her, “you’ll have to explain to me why you took bus Number 136 clear across Leningrad to the bus terminal.”\u003c/p\u003e\n\u003cp\u003eTatiana pinched him. “Someday,” she said, “you’ll have to explain to me why you followed me.”\u003c/p\u003e\n\u003cp\u003e“A what?” Tatiana asked in disbelief, getting down and walking beside him.\u003c/p\u003e\n\u003cp\u003e“A church. We have to find one.”\u003c/p\u003e\n\u003cp\u003e“What for?”\u003c/p\u003e\n\u003cp\u003eAlexander looked at her askance. “Where do you intend to get married?”\u003c/p\u003e\n\u003cp\u003eTatiana thought about it. “Like everybody in the Soviet Union — at the registry office.”\u003c/p\u003e\n\u003cp\u003eLaughing, he said, “What’s the point? Why don’t we go back and continue as we were?”\u003c/p\u003e\n\u003cp\u003e“That’s an idea,” Tatiana muttered. The mention of a church unsettled her.\u003c/p\u003e\n\u003cp\u003eAlexander took her hand and said nothing.\u003c/p\u003e\n\u003cp\u003e“Why church, Shura?”\u003c/p\u003e\n\u003cp\u003e“Tania,” said Alexander, looking at the road ahead, “who do you want this covenant of marriage to be made with? The Soviet Union? Or God?”\u003c/p\u003e\n\u003cp\u003eShe had no answer.\u003c/p\u003e\n\u003cp\u003e“What do you believe in, Tatiana?” he asked.\u003c/p\u003e\n\u003cp\u003e“You,” she replied.\u003c/p\u003e\n\u003cp\u003e“Well, I believe in God and you. We’re getting married in a church.”\u003c/p\u003e\n\u003cp\u003eThey found a small Russian Orthodox church close to the center of town, St. Seraphim’s. The priest inside studied them after Alexander told him what they wanted, and said, “Another war wedding. Hmm.” He glanced at Tatiana. “Are you even old enough to be a bride?”\u003c/p\u003e\n\u003cp\u003e“I’m eighteen tomorrow,” she said, sounding about ten.\u003c/p\u003e\n\u003cp\u003e“Do you have witnesses? Do you have rings? Did you register your marriage at the registry office?”\u003c/p\u003e\n\u003cp\u003e“None of the above,” said Tatiana, pulling Alexander by the arm, but he freed himself from her hold and asked the priest where they could buy some rings.\u003c/p\u003e\n\u003cp\u003e“Buy?” the priest asked with surprise. His name was Father Mikhail. He was tall and bald, with penetrating blue eyes and a long gray beard. “Buy rings? Well — nowhere, of course. We have a jeweler in town, but he has no gold.”\u003c/p\u003e\n\u003cp\u003e“Where is the jeweler?”\u003c/p\u003e\n\u003cp\u003e“Son, let me ask you, why do you want to get married in a church? Just go to the registry office. Like everybody. They’ll give you a certificate in thirty seconds. I think you can use the court clerk as your witness.”\u003c/p\u003e\n\u003cp\u003eTatiana stood still next to Alexander, who after taking a deep breath, said, “Where I come from, marriage is a public and sacred ceremony. We’re only going to do this once, so we would like it done right.”\u003c/p\u003e\n\u003cp\u003eWe? thought Tatiana. She couldn’t understand her misgivings.\u003c/p\u003e\n\u003cp\u003eFather Mikhail smiled. “All right, son,” he said sincerely, “I’ll be glad to marry two young people starting out in life. Come back tomorrow with rings and witnesses. Come back at three. I’ll marry you then.”\u003c/p\u003e\n\u003cp\u003eAs they descended the church steps, Tatiana said dismissively, “Oh, well. We don’t have the rings.” And breathed a small sigh of—\u003c/p\u003e\n\u003cp\u003e“We will,” said Alexander, producing four gold teeth out of his rucksack. “That should be enough for two rings.”\u003c/p\u003e\n\u003cp\u003eTatiana stared dumbfounded at the teeth.\u003c/p\u003e\n\u003cp\u003e“Dasha gave them to me. Don’t look so horrified.”\u003c/p\u003e\n\u003cp\u003eBut she was, she was horrified. “We’re going to make ourselves rings out of the teeth Dasha stole from her dental patients?”\u003c/p\u003e\n\u003cp\u003e“Do you have another idea?”\u003c/p\u003e\n\u003cp\u003e“Maybe we should wait.”\u003c/p\u003e\n\u003cp\u003e“Wait for what?”\u003c/p\u003e\n\u003cp\u003eTatiana had no answer to that. Wait for what indeed? With a heavy heart she followed Alexander down the street.\u003c/p\u003e\n\u003cp\u003eThe jeweler lived in a small house in town and worked out of his home. He looked at the teeth, looked at Alexander and Tatiana, and told them he could make gold rings out of the teeth — for the price of two more gold teeth.\u003c/p\u003e\n\u003cp\u003eAlexander said he didn’t have two more gold teeth, but he had a bottle of vodka. The jeweler, creaking refusal, returned the four teeth to Alexander, who sighed loudly and produced two more teeth out of his ruck.\u003c/p\u003e\n\u003cp\u003eAlexander asked if there was anywhere in Molotov they could buy some housewares.\u003c/p\u003e\n\u003cp\u003e“They’ll probably want gold teeth for a blanket, Shura,” whispered Tatiana. The jeweler introduced them to his overlarge wife Sofia, who sold them two down quilts, pillows, and sheets all for 200 rubles.\u003c/p\u003e\n\u003cp\u003e“Two hundred rubles!” exclaimed Tatiana. “I made ten tanks and five thousand flamethrowers and I did not get as much as that.”\u003c/p\u003e\n\u003cp\u003e“Yes, but I,” said Alexander, “blew up ten tanks and used up five thousand flamethrowers and got two thousand rubles for that. Never think about the money. Just spend it on what you have to.”\u003c/p\u003e\n\u003cp\u003eThey also bought a pot, a pan, a kettle, some plates, utensils and cups, and a soccer ball. Alexander also managed to talk two metal buckets out of Sofia.\u003c/p\u003e\n\u003cp\u003e“What’s that for?” Tatiana asked, looking at the two metal buckets — one that fit inside the other.\u003c/p\u003e\n\u003cp\u003e“You’ll see.” He smiled. “A surprise for your birthday.”\u003c/p\u003e\n\u003cp\u003e“How are we going to carry all this back home?”\u003c/p\u003e\n\u003cp\u003eKissing her nose, Alexander said fondly, “When you’re with me, don’t worry — I will take care of everything.”\u003c/p\u003e\n\u003cp\u003eSofia sold them two kilos of tobacco but couldn’t help them with produce. She sent them to a stand where they picked up apples, tomatoes, and cucumbers, bread and butter, and with one of the tushonka cans they had a feast for lunch on a blanket in a secluded spot on the outskirts of town down by the Kama.\u003c/p\u003e\n\u003cp\u003e“What amazes me,” Tatiana said, breaking the bread, “is that you gave me the Pushkin book for my birthday last year.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“How did you get the rubles in there?” She poured Alexander a cupful of kvas, a beverage made from bread products.\u003c/p\u003e\n\u003cp\u003e“I gave you the book with the money already there.”\u003c/p\u003e\n\u003cp\u003eShe looked at Alexander thoughtfully. “Really?” she said.\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“But you barely knew me. Why would you give me a book full of money?” She wanted him to tell her about all the money she had found in that book. But he said nothing. Tatiana knew this about Alexander: unless he wanted to, he didn’t speak about anything. Tatiana stared at him. She wanted him.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothing, nothing,” she said, glancing away.\u003c/p\u003e\n\u003cp\u003eCrawling over to her on the blanket, Alexander took the drink and the bread out of her hands and said, smiling, “I’ll teach you this, too: whenever you want something from me and are too shy to ask, blink three times quick.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-62.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
