{"id":79998,"no":66,"title":"Page 66","content":"\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eThe following tranquil afternoon a barebacked and barefooted Alexander was crouching and fiddling with two metal bowls while Tatiana danced in little steps behind him, jumping up and down and asking him what he was doing. It occurred to her that she didn’t like surprises. She liked to know things up front. Finally he had to get up, take her by the shoulders, and lead her away, asking her to go and cook something, read, practice her English — something, anything other than bother him for the next twenty minutes.\u003c/p\u003e\n\u003cp\u003eTatiana could not. She stopped jumping but tiptoed near him, bending over his back to see.\u003c/p\u003e\n\u003cp\u003eAlexander put milk, heavy cream, sugar and eggs into the smaller metal bowl and mixed the ingredients briskly.\u003c/p\u003e\n\u003cp\u003eShe lifted her shirt and rubbed her breasts against his bare back.\u003c/p\u003e\n\u003cp\u003e“Hmm,” he said. “What I need right now, though, is a cup of blueberries.”\u003c/p\u003e\n\u003cp\u003eTatiana got those for him, glad to help. After filling the large bowl with ice and rock salt, Alexander put the small metal bowl inside the large metal bowl and with a long wooden spoon started stirring the milk and sugar mixture.\u003c/p\u003e\n\u003cp\u003e“What are you doing? When will you tell me?”\u003c/p\u003e\n\u003cp\u003e“Very soon you’ll know.”\u003c/p\u003e\n\u003cp\u003e“How soon? Just tell me now.”\u003c/p\u003e\n\u003cp\u003e“You’re impossible. You’ll know in thirty minutes. Can you wait thirty minutes?”\u003c/p\u003e\n\u003cp\u003e“Thirty minutes? What are we going to do for thirty minutes?” She was bouncing up and down.\u003c/p\u003e\n\u003cp\u003e“You’re too much.” He laughed. “Look, I have to mix this. Come back in thirty minutes.”\u003c/p\u003e\n\u003cp\u003eTatiana walked around the clearing in circles, watching him.\u003c/p\u003e\n\u003cp\u003eShe was deliriously happy. She was speechlessly, wordlessly, infinitely happy.\u003c/p\u003e\n\u003cp\u003e“Shura, are you watching? Look!” She cartwheeled and then balanced herself upside down on one hand.\u003c/p\u003e\n\u003cp\u003e“Yes, sweet girl,” he said. “I’m watching.”\u003c/p\u003e\n\u003cp\u003eThirty minutes later Alexander called her over.\u003c/p\u003e\n\u003cp\u003eTatiana skipped up and looked at the thick, blue-colored mixture in the bowl. “What is it?”\u003c/p\u003e\n\u003cp\u003eHe handed her a spoon. “Try it.”\u003c/p\u003e\n\u003cp\u003eShe tasted it. “Ice cream?” she said incredulously.\u003c/p\u003e\n\u003cp\u003eHe nodded with a grin. “Ice cream.”\u003c/p\u003e\n\u003cp\u003e“You made me ice cream?”\u003c/p\u003e\n\u003cp\u003e“Yes. Happy birthday.” Pause. “Now, why are you crying? Eat. It’ll melt.”\u003c/p\u003e\n\u003cp\u003eTatiana sat on the ground with the bowl between her legs and ate her ice cream and cried. Alexander opened his hands with perplexed incomprehension and went to wash.\u003c/p\u003e\n\u003cp\u003e“I saved you some ice cream. Have some,” Tatiana said tearfully when he returned.\u003c/p\u003e\n\u003cp\u003e“No, have it all,” he said.\u003c/p\u003e\n\u003cp\u003e“It’s too much for me. I had half of it. Have the rest. Otherwise what are we going to do with it?”\u003c/p\u003e\n\u003cp\u003e“I was thinking,” Alexander said, kneeling by her, “that I’d like to undress you, spread the ice cream all over your body, and lick it off you.”\u003c/p\u003e\n\u003cp\u003eDropping the spoon, Tatiana said hoarsely, “Sounds like a waste of perfectly good ice cream.”\u003c/p\u003e\n\u003cp\u003eThough she didn’t think so when he was done with her.\u003c/p\u003e\n\u003cp\u003eAfterward they swam, and then he sat and smoked. “Tatia, show me your naked cartwheels.”\u003c/p\u003e\n\u003cp\u003e“What, here? No, this isn’t a good place.”\u003c/p\u003e\n\u003cp\u003e“If not here, where? Go on, right into the river.”\u003c/p\u003e\n\u003cp\u003eTatiana stood up, smiling and sparkling naked, lifted her arms, and said, “Are you ready?” And then catapulted herself upside down in jubilant rainbow somersaults one two three four five six seven times into the Kama.\u003c/p\u003e\n\u003cp\u003e“How was that?” she called to him from the water.\u003c/p\u003e\n\u003cp\u003e“Spectacular,” he replied, sitting on the ground, smoking and watching her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-66.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
