{"id":80007,"no":75,"title":"Page 75","content":"\u003cp\u003e22\u003c/p\u003e\n\u003cp\u003eThe morning Alexander was leaving, they could not touch.\u003c/p\u003e\n\u003cp\u003eTatiana sat on the bench outside while he packed. Alexander put on his dress uniform that she had washed and ironed for him with an iron warmed on the hearth, brushed his hair, and put on his sidecap. He made sure he had his helmet tied to him and his tent on his back. He had his pistol, his ammunition, his passport, his grenades, and his rifle.\u003c/p\u003e\n\u003cp\u003eHe left her all of his money save for the few rubles it was going to cost him to get back.\u003c/p\u003e\n\u003cp\u003eWhen he came out of the house, Tatiana, who had been sitting, got up and disappeared into the house, appearing a few minutes later with a cup of coffee, full of milk and sugar, and a plate of food. Some black bread, three eggs, a sliced tomato.\u003c/p\u003e\n\u003cp\u003eAlexander took the plate from her. He was choking. “Thank you,” he said.\u003c/p\u003e\n\u003cp\u003eHolding her stomach, she sat down heavily. “Of course,” she said. “Eat. You have a long journey ahead of you.”\u003c/p\u003e\n\u003cp\u003eListlessly he ate as they sat almost side by side, if only she weren’t turned one way and he another.\u003c/p\u003e\n\u003cp\u003e“Do you want me to come to the train station with you?”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “I can’t.”\u003c/p\u003e\n\u003cp\u003eTatiana nodded. “I can’t either.”\u003c/p\u003e\n\u003cp\u003eFinishing his food, Alexander put the plate on the ground. “I’ve left you plenty of wood, don’t you think?” he said, turning to her and pointing to the woodshed at the side of the cabin.\u003c/p\u003e\n\u003cp\u003e“Plenty,” she said. “It should last me a good long while.”\u003c/p\u003e\n\u003cp\u003eGently Alexander pulled the white satin ribbons from her braids. Taking his comb, he brushed out her smooth blonde hair, rubbing the silken strands between his fingers. “How do I arrange for my money to come to you here?” Alexander asked. “I get two thousand rubles a month. That’s a lot of money for you. I can send you fifteen hundred. I’ll keep five hundred for cigarettes.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Don’t do it. You’ll only get yourself into further trouble. Leningrad isn’t Lazarevo, Shura. Protect yourself. Don’t tell anyone we’re married. Take the ring off your finger. You don’t want Dimitri to find out somehow. We don’t need more trouble for you. You already have plenty. I don’t need your money.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do.”\u003c/p\u003e\n\u003cp\u003e“Then send it to me when you write to me.”\u003c/p\u003e\n\u003cp\u003e“Can’t. The censors will steal it immediately.”\u003c/p\u003e\n\u003cp\u003e“Censors? So I should avoid writing to you in my English?”\u003c/p\u003e\n\u003cp\u003e“If you want me to live, yes.”\u003c/p\u003e\n\u003cp\u003eTatiana didn’t turn around when she said, “It’s the only thing I want.”\u003c/p\u003e\n\u003cp\u003e“I will send the money to the local Soviet in Molotov,” said Alexander. “Go there once a month and check, all right? I’ll say I’m sending it to Dasha’s family.” Closing his eyes, Alexander pressed his lips to her gleaming hair. “I’d better go. There is only one train a day.”\u003c/p\u003e\n\u003cp\u003eTatiana said in a stricken voice, “I’ll walk you to the road. Have you got everything?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eAll this without looking at each other.\u003c/p\u003e\n\u003cp\u003eThey left together and walked up the path through the woods. Before the clearing disappeared from view, Alexander turned around one last time to look at the blue river and the deep green pines, at their wood cabin and their bench, at their log in the water, at the place where his tent had stood just yesterday. At their fire.\u003c/p\u003e\n\u003cp\u003e“Write to me,” Alexander said to Tatiana, “and let me know how you’re doing.” He paused. “So I don’t worry.”\u003c/p\u003e\n\u003cp\u003e“All right.” Her arms were twisted around her stomach. “You, too.”\u003c/p\u003e\n\u003cp\u003eThey got to the road. The pine needles smelled strong, the woods were quiet, the sun was warm overhead. They stood in front of each other, Tatiana in her yellow dress, looking at her bare feet, Alexander in his army uniform, rifle on his shoulder, looking down the road.\u003c/p\u003e\n\u003cp\u003eHer hand came up and patted him gently on the chest, pressing into his heart. “You keep yourself alive for me, soldier, you hear?” Tears were running down her face.\u003c/p\u003e\n\u003cp\u003eAlexander took her hand and brought it to his lips. She was wearing his ring. He couldn’t speak, couldn’t say her name aloud.\u003c/p\u003e\n\u003cp\u003eTatiana placed her trembling palm on Alexander’s face. “It’ll be all right, my love,” she whispered. “It’ll be all right.”\u003c/p\u003e\n\u003cp\u003eShe let go of his face. He let go of her hand. “Turn around and go home,” he said. “Don’t watch me. I can’t walk away with you standing here.”\u003c/p\u003e\n\u003cp\u003eTatiana turned away. “Go ahead. I won’t watch you.”\u003c/p\u003e\n\u003cp\u003eAlexander couldn’t come near her. “Please,” he said. “I can’t leave you like this. Please go home.”\u003c/p\u003e\n\u003cp\u003e“Shura,” she said. “I don’t want you to go.”\u003c/p\u003e\n\u003cp\u003e“I know. I don’t want to go, but please let me. Knowing you’re safe is the only chance I have of staying alive. I will make my way back to you, but you have to be safe.” He stopped. “Now I must go. Come on, lift your head to me. Lift your head to me, and smile.”\u003c/p\u003e\n\u003cp\u003eTurning around, Tatiana lifted her crying face to him and smiled.\u003c/p\u003e\n\u003cp\u003eThey stared at each other for a long moment. Tatiana blinked. Alexander blinked.\u003c/p\u003e\n\u003cp\u003e“What’s that in your eyes?”\u003c/p\u003e\n\u003cp\u003e“I’m watching all my wooden crates descend the ramp from the Winter Palace,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Got to have a little more faith, my wife.” Alexander raised his shaking right hand to his temple, to his lips, to his heart. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-75.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
