{"id":80010,"no":78,"title":"Page 78","content":"\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eThere were no more letters from Alexander.\u003c/p\u003e\n\u003cp\u003eAugust passed quietly into September, and still no letters. Tatiana did the best she could, drowning herself with the old women, with her village, with her books, with her English, with John Stuart Mill, whom she read out loud to herself in the woods, almost understanding everything.\u003c/p\u003e\n\u003cp\u003eStill nothing from him, and her soul wasn’t quiet anymore, and it wasn’t comforted.\u003c/p\u003e\n\u003cp\u003eOne Friday at the knitting circle, Tatiana, her head buried in the sweater she was making for Alexander, heard Irina Persikova ask if she had received any letters from him.\u003c/p\u003e\n\u003cp\u003e“Not for a month now,” said Naira quietly. “Shh. We don’t talk about it. The Molotov Soviet has no news. She goes every week to check. Shh.”\u003c/p\u003e\n\u003cp\u003eDusia said, “Either way, God is with him.”\u003c/p\u003e\n\u003cp\u003eAxinya jovially said, “Don’t worry, Tanechka. The post is terrible. You know that. Letters take a long time to come.”\u003c/p\u003e\n\u003cp\u003e“I know, Axinya,” said Tatiana, looking at her knitting needles. “I’m not worried.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you a story that’ll make you feel better. A woman named Olga lived in the village here a few months before you came, and her husband was at the front, too. She waited and waited for letters from him. Nothing. Like you she fretted and waited, and then she got ten letters all at once!”\u003c/p\u003e\n\u003cp\u003eTatiana smiled. “Wouldn’t that be great?” she said. “To get ten letters from Alexander all at once.”\u003c/p\u003e\n\u003cp\u003e“Absolutely, darling.” Axinya smiled. “So don’t worry.”\u003c/p\u003e\n\u003cp\u003eDusia said, “Oh, that’s right. Olga put the letters in chronological order and started reading them. She read nine of them, and the tenth letter was from the commandant, saying her husband had been killed at the front.”\u003c/p\u003e\n\u003cp\u003eTatiana paled. “Oh” was all she could get out.\u003c/p\u003e\n\u003cp\u003e“Dusia!” Axinya exclaimed. “For God’s sake, have you no sense? Next you’re going to tell her how Olga drowned herself in the Kama.”\u003c/p\u003e\n\u003cp\u003eTatiana put down her knitting needles. “You ladies finish up here without me, all right? I’m going to go and start on our dinner. I’m making cabbage pie.”\u003c/p\u003e\n\u003cp\u003eShe stumbled home and immediately got the Pushkin book out of the trunk. Alexander had told her he put the money back. Looking at the cover, looking and looking, Tatiana took a deep breath and carefully cut off the paper with a razor blade. The money was there. Breathing out a small sigh, she took it into her hands.\u003c/p\u003e\n\u003cp\u003eThen she counted it.\u003c/p\u003e\n\u003cp\u003eFive thousand dollars.\u003c/p\u003e\n\u003cp\u003eWithout alarm she counted the crisp new bills again, taking care to separate each one. Ten one-hundred-dollar bills. Four one-thousand-dollar bills.\u003c/p\u003e\n\u003cp\u003eFive thousand dollars.\u003c/p\u003e\n\u003cp\u003eShe counted it again.\u003c/p\u003e\n\u003cp\u003eFive thousand dollars.\u003c/p\u003e\n\u003cp\u003eTatiana started doubting herself; for a moment she thought maybe it had always been five thousand dollars, that she had just mistaken the amount.\u003c/p\u003e\n\u003cp\u003eIf only Alexander’s voice in the kerosene-lamp-filled night didn’t carry from her brain to her heart: This was the last thing my mother left me, a few weeks before she was arrested. . . . We hid the money together. Ten thousand American dollars . . . four thousand rubles.\u003c/p\u003e\n\u003cp\u003eTatiana climbed on top of her bed and lay on her back, facing the beamed ceiling.\u003c/p\u003e\n\u003cp\u003eHe had told her he was leaving her all the money.\u003c/p\u003e\n\u003cp\u003eNo, he didn’t say that. He said, I’m leaving you the money. She had watched him glue the cover back together.\u003c/p\u003e\n\u003cp\u003eWhy would he take only five thousand dollars?\u003c/p\u003e\n\u003cp\u003eTo mollify her? To have her not worry, not make another scandalous scene? Not return to Leningrad with him?\u003c/p\u003e\n\u003cp\u003eShe held the money to her chest and tried to fathom Alexander’s heart.\u003c/p\u003e\n\u003cp\u003eHe was the man who, a few meters away from freedom, from America, had chosen to turn his back on his lifelong dream. Feel one way. Behave one way, too. Alexander may have hoped for America, but he believed more in himself. And he loved Tatiana most of all. Alexander knew who he was.\u003c/p\u003e\n\u003cp\u003eHe was a man who kept his word.\u003c/p\u003e\n\u003cp\u003eAnd he had given it to Dimitri. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-78.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
