{"id":79941,"no":8,"title":"Page 8","content":"\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eAlexander and Dimitri came by after eleven. It was still bright outside. Dasha was not home yet. Her boss had her working overtime, taking gold out of people’s teeth. During times of crisis people liked to have gold instead of hard currency to barter with; gold kept its value. Dasha worked later and later, hating it, wanting everyone to behave as if life could still go on in the Leningrad summer as it had been — slow, warm, dusty, and full of young people in love.\u003c/p\u003e\n\u003cp\u003eTatiana, Dimitri, and Alexander stood awkwardly in the kitchen as water dripped into the cast-iron sink. “So what’s the matter with you two glum kids?” said Dimitri, looking from Tatiana to Alexander.\u003c/p\u003e\n\u003cp\u003e“Well, I’m tired,” said Tatiana. It was only a partial lie.\u003c/p\u003e\n\u003cp\u003e“And I’m hungry,” said Alexander, glancing at her.\u003c/p\u003e\n\u003cp\u003e“Tania, let’s go for a walk.”\u003c/p\u003e\n\u003cp\u003e“No, Dima.”\u003c/p\u003e\n\u003cp\u003e“Yes. We’ll leave Alexander here to wait for Dasha.” Dimitri smiled. “They don’t need us. Those two would love to be left by themselves. Am I right, Alexander?”\u003c/p\u003e\n\u003cp\u003e“They’re not going to have much luck here,” Tatiana muttered. Thank goodness.\u003c/p\u003e\n\u003cp\u003eAlexander walked over to the window and looked down into the courtyard.\u003c/p\u003e\n\u003cp\u003e“I really can’t,” Tatiana protested. “I’m . . .”\u003c/p\u003e\n\u003cp\u003eDimitri took Tatiana by the arm. “Come on, Tanechka. You’ve eaten already, haven’t you? Let’s go. We’ll be back soon, I promise.”\u003c/p\u003e\n\u003cp\u003eTatiana saw Alexander’s squared shoulders.\u003c/p\u003e\n\u003cp\u003eShe wanted to call him Shura. “Alexander,” she said, “you want us to bring you something back?”\u003c/p\u003e\n\u003cp\u003e“No, Tania,” he replied, glancing back at her. His unhappy eyes flashed for a moment and were subdued by his own will.\u003c/p\u003e\n\u003cp\u003e“Why don’t you go inside? Babushka made meat pirozhki. Go have some. There is borscht, too.”\u003c/p\u003e\n\u003cp\u003eDimitri’s hand was already yanking Tatiana down the hall. They stepped over Slavin in the corridor, who was resting quietly on the floor, and it looked as if they would pass him without incident, but just as Tatiana neared him, he stirred, lifted his head, and grabbed her ankle.\u003c/p\u003e\n\u003cp\u003eRoughly Dimitri stepped on his wrist, and Slavin yelped, letting go, looking up at Tatiana, and wailing, “Stay home, Tanechka dear, it’s too late for you to go out at night! Stay home!” He did not look at Dimitri, who cursed at him and stepped on his wrist again.\u003c/p\u003e\n\u003cp\u003eOn the street Dimitri asked if she wanted an ice cream. She didn’t want him to buy her one but said, “All right. A vanilla cone.” She ate the ice cream unhappily as they walked. The night was warm. She was thinking about only one thing.\u003c/p\u003e\n\u003cp\u003e“What are you thinking about?”\u003c/p\u003e\n\u003cp\u003e“War,” she lied. “How about you?”\u003c/p\u003e\n\u003cp\u003e“You,” he replied. “I’ve never met anyone like you, Tania. You’re quite different from the kind of girl I usually meet.”\u003c/p\u003e\n\u003cp\u003eTatiana muttered a hapless thank-you, concentrating on her ice cream.\u003c/p\u003e\n\u003cp\u003e“I hope Alexander goes inside and eats,” she said. “Dasha might not be home for another hour.”\u003c/p\u003e\n\u003cp\u003e“Tania,” Dimitri said, “is that what you want to talk about? Alexander?” Even Tatiana with her untrained ear heard a chill in Dimitri’s voice.\u003c/p\u003e\n\u003cp\u003e“No, of course I don’t,” she said hurriedly. “I’m just making conversation.” She changed the subject. “What did you do today?”\u003c/p\u003e\n\u003cp\u003e“Dug more trenches. The front line to the north is nearly complete. We’ll be ready for those Finns next week.” He smirked. “So Tania, I know you must be thinking it — why am I not an officer like Alexander?”\u003c/p\u003e\n\u003cp\u003eTatiana said nothing.\u003c/p\u003e\n\u003cp\u003e“Why haven’t you asked me about it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Her heart beat a little faster.\u003c/p\u003e\n\u003cp\u003e“It’s almost as if you already know.”\u003c/p\u003e\n\u003cp\u003e“Know? No.” She wanted to throw out what was left of the ice cream and run home.\u003c/p\u003e\n\u003cp\u003e“Have you been speaking to Alexander about me?”\u003c/p\u003e\n\u003cp\u003e“No,” she said, high-strung.\u003c/p\u003e\n\u003cp\u003e“How come you haven’t asked why I’m just a frontovik and he’s an officer?”\u003c/p\u003e\n\u003cp\u003eTatiana had no answer for that. This was too stupid. She hated lying. Not saying anything, keeping a straight face, averting her eyes was difficult enough. But outright lying? Her tongue and throat weren’t used to it.\u003c/p\u003e\n\u003cp\u003e“Alex and I had every intention of being officers together. That was our original plan.”\u003c/p\u003e\n\u003cp\u003e“What plan?”\u003c/p\u003e\n\u003cp\u003eDimitri didn’t answer, and Tatiana’s question hung in the air and then got lodged in her head.\u003c/p\u003e\n\u003cp\u003eHer hands began to shake slightly.\u003c/p\u003e\n\u003cp\u003eShe did not want to be out at night alone with Dimitri.\u003c/p\u003e\n\u003cp\u003eShe did not feel safe.\u003c/p\u003e\n\u003cp\u003eThey got to the corner of Suvorovsky and Tauride Park. Though the sun was still thirty degrees in the sky, under the trees the park was in shade.\u003c/p\u003e\n\u003cp\u003e“You want to walk around the gardens for a bit?” Dimitri asked.\u003c/p\u003e\n\u003cp\u003e“What time is it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You know what?” Tatiana said. “I really have to get back.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to.”\u003c/p\u003e\n\u003cp\u003e“I do, Dimitri. My parents are not used to my being out late at night. They’ll get upset.”\u003c/p\u003e\n\u003cp\u003e“They won’t get upset. They like me.” He moved closer to her. “Your father likes me very much. Besides,” he added, “your parents are too busy thinking about Pasha to notice what time you come and go.”\u003c/p\u003e\n\u003cp\u003eTatiana stopped and turned around. “I’m going back.” And she started to walk up Suvorovsky away from him.\u003c/p\u003e\n\u003cp\u003eHe grabbed her arm. “Tania, don’t walk away from me.” Without letting go, he said, “Come. Come and sit with me on the bench over by the trees.”\u003c/p\u003e\n\u003cp\u003e“Dimitri,” she said, not moving, “I’m not going by the trees with you. Can you let go?”\u003c/p\u003e\n\u003cp\u003e“Come with me by the trees.”\u003c/p\u003e\n\u003cp\u003e“No, Dimitri, let me go now.”\u003c/p\u003e\n\u003cp\u003eHe stepped up to her, holding her very hard. His fingers dug into her skin. “Well, what if I don’t want to let go, Tanechka? What are you going to do then?”\u003c/p\u003e\n\u003cp\u003eTatiana did not move away from him. His free arm went around her waist, and he brought her close to him. “Dima,” said Tatiana, composed and unafraid, looking him right in the face, “what are you doing? Have you lost your mind?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he said and bent his face to kiss her. With a small cry Tatiana turned her face down and sharply away.\u003c/p\u003e\n\u003cp\u003e“No! Let go of me, Dimitri,” she said. She did not lift her head.\u003c/p\u003e\n\u003cp\u003eSuddenly he let go of her. “I’m sorry,” he said with a tremor in his voice.\u003c/p\u003e\n\u003cp\u003e“I have to go home right now,” she said, walking as fast as she could. “Dima, you’re too old for me.”\u003c/p\u003e\n\u003cp\u003e“No. No. Please. I’m only twenty-three.”\u003c/p\u003e\n\u003cp\u003e“That’s not what I mean. I’m too young for you. I need someone who” — she paused in thought — “expects less,” she finished.\u003c/p\u003e\n\u003cp\u003e“How much less?”\u003c/p\u003e\n\u003cp\u003e“Who expects nothing.”\u003c/p\u003e\n\u003cp\u003e“I’m really sorry, Tania,” he said. “I didn’t mean to scare you off like that.”\u003c/p\u003e\n\u003cp\u003e“That’s fine,” she said, not looking at him. “I’m just not the kind of girl who goes by the trees.” With you, she thought with a pang in her heart, remembering the Summer Garden.\u003c/p\u003e\n\u003cp\u003e“I know that now. I think that’s why I really like you. I just don’t know how to act around you sometimes.”\u003c/p\u003e\n\u003cp\u003e“Be respectful and patient.”\u003c/p\u003e\n\u003cp\u003e“Fine, I’ll be as patient as Job.” Dimitri leaned in to her. “Because, Tanechka,” he said, “I have no intention of leaving you alone.”\u003c/p\u003e\n\u003cp\u003eShe hurried up Suvorovsky.\u003c/p\u003e\n\u003cp\u003eSuddenly Dimitri said, “I hope Dasha likes Alexander.”\u003c/p\u003e\n\u003cp\u003e“Dasha does like Alexander.”\u003c/p\u003e\n\u003cp\u003e“Because he really likes her.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes?” Tatiana said weakly. “How do you know?”\u003c/p\u003e\n\u003cp\u003e“He has almost stopped his previously uncontrolled extracurricular activities. Don’t say that to Dasha, of course. It’ll just hurt her feelings.”\u003c/p\u003e\n\u003cp\u003eTatiana wanted to say to Dimitri that she had no idea what he was talking about, but she was too afraid that he would tell her.\u003c/p\u003e\n\u003cp\u003eWhen they got home, Dasha and Alexander were sitting together on the small sofa in the hallway, reading from a volume of Zoshchenko’s short stories and laughing. The only thing Tatiana could say was a sullen and grumpy, “That’s my book.”\u003c/p\u003e\n\u003cp\u003eFor some reason Dasha found that very funny, and even Alexander smiled. As Tatiana walked past him, his legs were sticking so far out that she tripped over them and would have fallen face forward for sure, had he not instantly grabbed her. And just as instantly let go.\u003c/p\u003e\n\u003cp\u003e“Tania,” Alexander said, “what’s that on your arm?”\u003c/p\u003e\n\u003cp\u003e“What? Oh, it’s nothing.” Making hasty excuses about exhaustion, she said good night and disappeared into her grandparents’ room, where she sat between her Deda and Babushka on the sofa and listened to the radio. They chatted quietly about Pasha, and soon she felt better.\u003c/p\u003e\n\u003cp\u003eLater that night she was facing the wall when she heard Dasha whispering to her. “Tania? Tania?”\u003c/p\u003e\n\u003cp\u003eTatiana turned to her sister. “What is it? I’m tired.”\u003c/p\u003e\n\u003cp\u003eDasha kissed her shoulder. “Tania, we never talk anymore. Our Pasha left, and we never talk. You miss him, don’t you? He’ll be back soon.”\u003c/p\u003e\n\u003cp\u003e“I miss him. You’re busy. We’ll talk tomorrow, Dashenka,” said Tatiana.\u003c/p\u003e\n\u003cp\u003e“I’m in love, Tania!” Dasha whispered.\u003c/p\u003e\n\u003cp\u003eTatiana whispered back, “I’m glad for you, Dasha.” And she turned to the wall.\u003c/p\u003e\n\u003cp\u003eDasha kissed the back of Tatiana’s head. “I think this is really it, I do. Oh, Tanechka, I just don’t know what to do with myself!”\u003c/p\u003e\n\u003cp\u003e“Have you tried sleep?”\u003c/p\u003e\n\u003cp\u003e“Tania, I can’t think about anything else. He is driving me crazy. He is so . . . hot and cold. Tonight he was fine, relaxed and funny, but other days . . . I just can’t figure him out.”\u003c/p\u003e\n\u003cp\u003eTatiana didn’t say anything.\u003c/p\u003e\n\u003cp\u003eDasha continued, “I know I can’t expect too much at once. The fact that he is finally coming around at all is a miracle. I couldn’t get him to come over until last Sunday, when he came with Dima and you.”\u003c/p\u003e\n\u003cp\u003eTatiana wanted to point out that it wasn’t Dasha who got Alexander to come over, but of course said nothing.\u003c/p\u003e\n\u003cp\u003e“I’m not looking a gift horse in the mouth. I think he likes our family. Did you know he’s from Krasnodar? He hasn’t been back there since he joined the army. Doesn’t have any brothers or sisters. Doesn’t talk about his parents. He is . . . I can’t explain. So closemouthed. Doesn’t like to say too much about his own business.” She paused. “Asks me about mine, though.”\u003c/p\u003e\n\u003cp\u003e“Oh?” was all Tatiana could manage.\u003c/p\u003e\n\u003cp\u003e“He tells me he wishes it weren’t war.”\u003c/p\u003e\n\u003cp\u003e“Yes,” said Tatiana. “We all wish it weren’t war.”\u003c/p\u003e\n\u003cp\u003e“But that sounds hopeful, doesn’t it? As if a better life with him would be possible once the war was over. Tania,” said Dasha into Tatiana’s hair, “do you like Dimitri?”\u003c/p\u003e\n\u003cp\u003eTatiana fought for her voice. “I like him fine,” she whispered.\u003c/p\u003e\n\u003cp\u003e“He really likes you.”\u003c/p\u003e\n\u003cp\u003e“No, he doesn’t.”\u003c/p\u003e\n\u003cp\u003e“Yes, he does. You have no idea about these things.”\u003c/p\u003e\n\u003cp\u003e“I have some idea, and he doesn’t.”\u003c/p\u003e\n\u003cp\u003e“Is there anything you want to talk to me about, want to ask me?”\u003c/p\u003e\n\u003cp\u003e“No!”\u003c/p\u003e\n\u003cp\u003eDismissively, Dasha said, “Tania, you mustn’t be so shy. You’re seventeen already. Why can’t you just give in a little?”\u003c/p\u003e\n\u003cp\u003e“Give in to Dimitri?” whispered Tatiana. “Never, Dasha.”\u003c/p\u003e\n\u003cp\u003eIn the minutes before she fell asleep, Tatiana realized she was less afraid of the intangible of war than she was of the tangible of heartbreak. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-8.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
