{"id":80016,"no":84,"title":"Page 84","content":"\u003cp\u003e2\u003c/p\u003e\n\u003cp\u003eIn December the International Red Cross came to Grechesky Hospital.\u003c/p\u003e\n\u003cp\u003eThere were too few doctors left in Leningrad. Out of the 3,500 that were there before the war, only 2,000 remained, and there was a quarter of a million people in various city hospitals.\u003c/p\u003e\n\u003cp\u003eTatiana met Dr. Matthew Sayers when she was washing out a throat wound on a young corporal.\u003c/p\u003e\n\u003cp\u003eThe doctor came in, and before he opened his mouth, Tatiana suspected he was an American. First of all he smelled clean. He was thin and small and dark blond, and his head was a little big for the rest of his body, but he radiated confidence that Tatiana had not seen in any man but Alexander and now this man, who entered the room, swung up the chart, looked at the patient, glanced at her, glanced back to the patient, clicked his tongue, shook his head, rolled his eyes, and said, in English, “Doesn’t look so good, does he?”\u003c/p\u003e\n\u003cp\u003eThough Tatiana understood him, she remained mute, remembering Alexander’s warnings.\u003c/p\u003e\n\u003cp\u003eIn heavily accented Russian, the doctor repeated himself.\u003c/p\u003e\n\u003cp\u003eNodding, Tatiana said, “I think he’ll be all right. I’ve seen worse.”\u003c/p\u003e\n\u003cp\u003eEmitting a good, non-Russian laugh, he said, “I bet you have, I just bet you have.” He came up to her and extended his hand. “I’m with the Red Cross. Dr. Matthew Sayers. Can you say Sayers?”\u003c/p\u003e\n\u003cp\u003e“Sayers,” Tatiana said perfectly.\u003c/p\u003e\n\u003cp\u003e“Very good! What’s Matthew in Russian?”\u003c/p\u003e\n\u003cp\u003e“Matvei.”\u003c/p\u003e\n\u003cp\u003eLetting go of her hand, he said, “Matvei. Do you like it?”\u003c/p\u003e\n\u003cp\u003e“I like Matthew better,” she told him, turning back to the gurgling patient.\u003c/p\u003e\n\u003cp\u003eTatiana was right about the doctor, he was competent, friendly, and instantly improved the conditions in their dismal hospital, having brought miracles with him — penicillin, morphine, and plasma. Tatiana was also right about the patient. He lived.\u003c/p\u003e","sourceLink":"https://allnovel.net/the-bronze-horseman-the-bronze-horseman-1/page-84.html","bookId":1855,"creation":"Oct 5, 2019 4:23:28 PM","modification":"Oct 5, 2019 4:23:28 PM"}
