{"id":96155,"no":18,"title":"Page 18","content":"\u003cp\u003e“And these are ordinary kids,” he went on. “Eighteen-year-old boys, drafted fresh out of high school. Or I guess it’s volunteers now, they don’t draft them anymore, but it amounts to the same thing. They’re just ordinary American boys. They didn’t grow up torturing animals or starting fires. Or wetting the bed.\u003c/p\u003e\n\u003cp\u003e“You know something? I still don’t see what wetting the bed has to do with it.”\u003c/p\u003e\n\u003cp\u003eComing into New York on the George Washington Bridge, he said, “Well, they’re not there.”\u003c/p\u003e\n\u003cp\u003eThe towers, he meant. And of course they weren’t there, they were gone, and he knew that. He’d been down to the site enough times to know it wasn’t trick photography, that the twin towers were in fact gone. But somehow he’d half expected to see them, half expected the whole thing to turn out to have been a dream. You couldn’t make part of the skyline disappear, for God’s sake.\u003c/p\u003e\n\u003cp\u003eHe drove to the Hertz place, returned the car. He was walking away from the office with his suitcase in hand when an attendant rushed up, brandishing the little stuffed dog. “You forgot somethin’,” the man said, smiling broadly.\u003c/p\u003e\n\u003cp\u003e“Oh, right,” Keller said. “You got any kids?”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“Give it to your kid,” Keller told him. “Or some other kid.”\u003c/p\u003e\n\u003cp\u003e“You don’t want him?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, kept walking. When he got home he showered and shaved and looked out the window. His window faced east, not south, and had never afforded a view of the towers, so it was the same as it had always been. And that’s why he’d looked, to assure himself that everything was still there, that nothing had been taken away.\u003c/p\u003e\n\u003cp\u003eIt looked okay to him. He picked up the phone and called Dot.\u003c/p\u003e\n\u003cp\u003e18\u003c/p\u003e\n\u003cp\u003eShe was waiting for him on the porch, with the usual pitcher of iced tea. “You had me going,” she said. “You didn’t call and you didn’t call and you didn’t call. It took you the better part of a month to get home. What did you do, walk?”\u003c/p\u003e\n\u003cp\u003e“I didn’t leave right away,” he said. “I’d paid for two weeks.”\u003c/p\u003e\n\u003cp\u003e“And you wanted to make sure you got your money’s worth.”\u003c/p\u003e\n\u003cp\u003e“I thought it’d be suspicious, leaving early. ‘Oh, I remember that guy, he left four days early, right after Mr. Egmont died.’”\u003c/p\u003e\n\u003cp\u003e“And you thought it’d be safer to hang around the scene of a homicide?”\u003c/p\u003e\n\u003cp\u003e“Except it wasn’t a homicide,” he said. “The man came home after an afternoon at the golf course, locked his door, set the burglar alarm, got undressed, and drew a hot bath. He got into the tub and lost consciousness and drowned.”\u003c/p\u003e\n\u003cp\u003e“Most accidents happen in the home,” Dot said. “Isn’t that what they say? What did he do, hit his head?”\u003c/p\u003e\n\u003cp\u003e“He may have smacked it on the tile on the way down, after he lost his balance. Or maybe he had a little stroke. Hard to say.”\u003c/p\u003e\n\u003cp\u003e“You undressed him and everything?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Put him in the tub. He came to in the water, but I picked up his feet and held them in the air, and his head went under, and, well, that was that.”\u003c/p\u003e\n\u003cp\u003e“Water in the lungs.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Death by drowning.”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“You okay, Keller?”\u003c/p\u003e\n\u003cp\u003e“Me? Sure, I’m fine. Anyway, I figured I’d wait the four days, leave when my time was up.”\u003c/p\u003e\n\u003cp\u003e“Just like Egmont.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“He left when his time was up,” she said. “Still, how long does it take to drive home from Phoenix? Four, five days?”\u003c/p\u003e\n\u003cp\u003e“I got sidetracked,” he said, and told her about the Dalton Boys.\u003c/p\u003e\n\u003cp\u003e“Two museums,” she said. “Most people have never been to one Dalton Boys museum, and you’ve been to two.”\u003c/p\u003e\n\u003cp\u003e“Well, they robbed two banks at once.”\u003c/p\u003e\n\u003cp\u003e“What’s that got to do with it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Nothing, I guess. You ever hear of Nashville, Indiana?”\u003c/p\u003e\n\u003cp\u003e“I’ve heard of Nashville,” she said, “and I’ve heard of Indiana, but I guess the answer to your question is no. What have they got in Nashville, Indiana? The Grand Ole Hoosier Opry?”\u003c/p\u003e\n\u003cp\u003e“There’s a John Dillinger museum there.”\u003c/p\u003e\n\u003cp\u003e“Jesus, Keller. What were you taking, an outlaw’s tour of the Midwest?”\u003c/p\u003e\n\u003cp\u003e“There was a flyer for the place in the museum in Coffeyville, and it wasn’t that far out of my way. It was interesting. They had the fake gun he used to break out of prison. Or it may have been a replica. Either way, it was pretty interesting.”\u003c/p\u003e\n\u003cp\u003e“I’ll bet.”\u003c/p\u003e\n\u003cp\u003e“They were folk heroes,” he said. “Dillinger and Pretty Boy Floyd and Baby Face Nelson.”\u003c/p\u003e\n\u003cp\u003e“And Bonnie and Clyde. Have those two got a museum?”\u003c/p\u003e\n\u003cp\u003e“Probably. They were heroes the same as the Daltons and Youngers and Jameses, but they weren’t brothers. Back in the nineteenth century it was a family thing, but then that tradition died out.”\u003c/p\u003e\n\u003cp\u003e“Kids today,” Dot said. “What about Ma Barker? Wasn’t that around the same time as Dillinger? And didn’t she have a whole houseful of bank-robbing brats? Or was that just in the movies?”\u003c/p\u003e\n\u003cp\u003e“No, you’re right,” he said. “I forgot about Ma Barker.”\u003c/p\u003e\n\u003cp\u003e“Well, let’s forget her all over again, so you can get to the point.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’m not sure there is one. I just took my time getting back, that’s all. I had some thinking to do.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003eHe reached for the pitcher, poured himself more iced tea. “Okay,” he said. “Here’s the thing. I can’t do this anymore.”\u003c/p\u003e\n\u003cp\u003e“I can’t say I’m surprised.”\u003c/p\u003e\n\u003cp\u003e“I was going to retire a while ago,” he said. “Remember?”\u003c/p\u003e\n\u003cp\u003e“Vividly.”\u003c/p\u003e\n\u003cp\u003e“At the time,” he said, “I figured I could afford it. I had money put aside. Not a ton, but enough for a little bungalow somewhere in Florida.”\u003c/p\u003e\n\u003cp\u003e“And you could get to Denny’s in time for the early bird special, which helps keep food costs down.”\u003c/p\u003e\n\u003cp\u003e“You said I needed a hobby, and that got me interested in stamp collecting again. And before I knew it I was spending serious money on stamps.”\u003c/p\u003e\n\u003cp\u003e“And that was the end of your retirement fund.”\u003c/p\u003e\n\u003cp\u003e“It cut into it,” he agreed. “And it’s kept me from saving money ever since then, because any extra money just goes into stamps.”\u003c/p\u003e\n\u003cp\u003eShe frowned. “I think I see where this is going,” she said. “You can’t keep on doing what you’ve been doing, but you can’t retire, either.”\u003c/p\u003e\n\u003cp\u003e“So I tried to think what else I could do,” he said. “Emmett Dalton wound up in Hollywood, writing movies and dealing in real estate.”\u003c/p\u003e\n\u003cp\u003e“You working on a script, Keller? Boning up for the realtor’s exam?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t think of a single thing I could do,” he said. “Oh, I suppose I could get some kind of minimum-wage job. But I’m used to living a certain way, and I’m used to not having to work many hours. Can you see me clerking in a 7-Eleven?”\u003c/p\u003e\n\u003cp\u003e“I couldn’t even see you sticking up a 7-Eleven, Keller.”\u003c/p\u003e\n\u003cp\u003e“It might be different if I were younger.”\u003c/p\u003e\n\u003cp\u003e“I guess armed robbery is a young man’s job.”\u003c/p\u003e\n\u003cp\u003e“If I were just starting out,” he said, “I could take some entry-level job and work my way up. But I’m too old for that now. Nobody would hire me in the first place, and the jobs I’m qualified for, well, I wouldn’t want them.”\u003c/p\u003e\n\u003cp\u003e“‘Do you want fries with that?’ You’re right, Keller. Somehow it just doesn’t sound like you.”\u003c/p\u003e\n\u003cp\u003e“I started at the bottom once. I started coming around, and the old man found things for me to do. ‘Richie’s gotta see a man, so why don’t you ride along with him, keep him company.’ Or go see this guy, tell him we’re not happy with the way he’s been acting. Or he used to send me to the store to pick up candy bars for him. What was that candy bar he used to like?”\u003c/p\u003e\n\u003cp\u003e“Mars bars.”\u003c/p\u003e\n\u003cp\u003e“No, he switched to those, but early on it was something else. They were hard to find, only a few stores had them. I think he was the only person I ever met who liked them. What the hell was the name of them? It’s on the tip of my tongue.”\u003c/p\u003e\n\u003cp\u003e“Hell of a place for a candy bar.”\u003c/p\u003e\n\u003cp\u003e“Powerhouse,” he said. “Powerhouse candy bars.”\u003c/p\u003e\n\u003cp\u003e“The dentist’s best friend,” she said. “I remember them now. I wonder if they still make them.”\u003c/p\u003e\n\u003cp\u003e“‘Do me a favor, kid, see if they got any of my candy bars downtown.’ Then one day it was do me a favor, here’s a gun, go see this guy and give him two in the head. Out of the blue, more or less, except by then he probably knew I’d do it. And you know something? It never occurred to me not to. ‘Here’s a gun, do me a favor.’ So I took the gun and did him a favor.”\u003c/p\u003e\n\u003cp\u003e“Just like that?”\u003c/p\u003e\n\u003cp\u003e“Pretty much. I was used to doing what he told me, and I just did. And that let him know I was somebody who could do that kind of thing. Because not everybody can.”\u003c/p\u003e\n\u003cp\u003e“But it didn’t bother you.”\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking about this,” he said. “Reflecting, I guess you’d call it. I didn’t let it bother me.”\u003c/p\u003e\n\u003cp\u003e“That thing you do, fading the color out of the image and pushing it off in the distance…”\u003c/p\u003e\n\u003cp\u003e“It was later that I taught myself to do that,” he said. “Earlier, well, I guess you’d just call it denial. I told myself it didn’t bother me and made myself believe it. And then there was this sense of accomplishment. Look what I did, see what a man I am. Bang, and he’s dead and you’re not, there’s a certain amount of exhilaration that comes with it.”\u003c/p\u003e\n\u003cp\u003e“Still?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “There’s the feeling that you’ve got the job done, that’s all. If it was difficult, well, you’ve accomplished something. If there are other things you’d rather be doing, well, now you can go home and do them.”\u003c/p\u003e\n\u003cp\u003e“Buy stamps, see a movie.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“You just pretended it didn’t bother you,” she said, “and then one day it didn’t.”\u003c/p\u003e\n\u003cp\u003e“And it was easy to pretend, because it never bothered me all that much. But yes, I just kept on doing it, and then I didn’t have to pretend. This place where I stayed in Scottsdale, there were all these masks on the walls. Tribal stuff, I guess they were. And I thought about how I started out wearing a mask, and before long it wasn’t a mask, it was my own face.”\u003c/p\u003e\n\u003cp\u003e“I guess I follow you.”\u003c/p\u003e\n\u003cp\u003e“It’s just a way of looking at it,” he said. “Anyway, how I got here’s not the point. Where do I go from here? That’s the question.”\u003c/p\u003e\n\u003cp\u003e“You had a lot of time to think up an answer.”\u003c/p\u003e\n\u003cp\u003e“Too much time.”\u003c/p\u003e\n\u003cp\u003e“I guess, with all the stops in Nashville and Coffee Pot.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-18.html","bookId":2314,"creation":"Oct 5, 2019 6:19:32 PM","modification":"Oct 5, 2019 6:19:32 PM"}
