{"id":96160,"no":23,"title":"Page 23","content":"\u003cp\u003e“It turned out okay, Dot.”\u003c/p\u003e\n\u003cp\u003e“The client was playing games with us.”\u003c/p\u003e\n\u003cp\u003e“That’s true.”\u003c/p\u003e\n\u003cp\u003e“And then he tried to stiff us out of the final payment.”\u003c/p\u003e\n\u003cp\u003e“We convinced him to change his mind.”\u003c/p\u003e\n\u003cp\u003e“And taught him a lesson once the account was paid in full,” she recalled. “Still, neither one of us was in a big rush to run the ad again.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“But you want to be proactive, don’t you? You want this Harrelson to hire us.”\u003c/p\u003e\n\u003cp\u003e“Well,” he said.\u003c/p\u003e\n\u003cp\u003eShe gave him a look. “He’s met you,” she said. “He knows who you are.”\u003c/p\u003e\n\u003cp\u003e“He knows my name’s Eric Fischvogel.”\u003c/p\u003e\n\u003cp\u003e“He saw your face.”\u003c/p\u003e\n\u003cp\u003e“He barely looked at it. All I was was somebody to talk to, and in a sense he was just talking to himself.”\u003c/p\u003e\n\u003cp\u003e“He’s in New York. He travels a lot, but his partner-Blyden?”\u003c/p\u003e\n\u003cp\u003e“Barry Blyden.”\u003c/p\u003e\n\u003cp\u003e“Blyden’s here in New York, right? And he’s Mr. Inside, he stays put.”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“Two things we try to avoid,” she said, “are working for people who know who we are, and working close to home.”\u003c/p\u003e\n\u003cp\u003e“Sometimes we don’t have any choice.”\u003c/p\u003e\n\u003cp\u003e“But in this case,” she said, “we do.” She looked long and hard at him. “You want to do this, don’t you? In spite of everything.”\u003c/p\u003e\n\u003cp\u003e“Well, I could use the work,” he said. “And I could use the money. And here’s the thing, Dot. When he asked me that question out of the blue, had I ever wanted to kill anybody, something just clicked.”\u003c/p\u003e\n\u003cp\u003e“ Opportunity knocked.”\u003c/p\u003e\n\u003cp\u003e“Something like that. I want to take the next step, see where it goes.”\u003c/p\u003e\n\u003cp\u003eKeller, wearing jeans and a Mets warm-up jacket, stood near a water fountain in Central Park. On the phone, he’d designated a particular park bench, and he’d stationed himself where he could keep an eye on it. He’d set the meeting time for 10 P.M., and Claude Harrelson, wearing a suit and carrying a briefcase, was two minutes early.\u003c/p\u003e\n\u003cp\u003eKeller watched him walk right to the bench and sit down. The man didn’t look around at all, but there was something furtive about him all the same. Keller circled around, came up behind Harrelson, and stood there for a moment.\u003c/p\u003e\n\u003cp\u003eI’m the man who sat next to you on the flight from Detroit, he’d said on the phone. No names, all right? There was something you wished you could do. Suppose somebody could do it for you. Wouldn’t that solve all your problems?\u003c/p\u003e\n\u003cp\u003eAnd here was Harrelson, ready to have his problems solved.\u003c/p\u003e\n\u003cp\u003e“Don’t turn around,” Keller said quietly, and Harrelson started visibly, but didn’t turn. “I don’t want to see your face, and I don’t want you to see mine. I’m going to touch you, though, because I need to make sure you’re not wearing a wire.” Harrelson offered no resistance, and Keller, who hadn’t really expected to find a wire, made certain Harrelson wasn’t wearing one.\u003c/p\u003e\n\u003cp\u003eThen he talked, explaining just what was on offer here. He had a friend, an associate, who would undertake to solve Harrelson’s problem in return for a substantial fee, payable half in advance and half on completion of the work. “He won’t know your name,” Keller assured him, “and you won’t know his, and you’ll never meet him, so there’ll be nothing to connect the two of you.”\u003c/p\u003e\n\u003cp\u003e“I like that part,” Harrelson said.\u003c/p\u003e\n\u003cp\u003e“So? Have you had enough time to think it over?”\u003c/p\u003e\n\u003cp\u003e“God knows I’ve been thinking about it,” Harrelson said. “I haven’t been able to think of anything else. It’s strange, you know? For all this time I’ve wanted him dead, I’ve had fantasies of killing him in dozens of different ways. Smashing his skull with a baseball bat, stabbing him, shooting him, running him over with a car. You can’t imagine.”\u003c/p\u003e\n\u003cp\u003eKeller, who had done all those things and more at one time or another, figured he could imagine well enough. But he didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“But it was never real,” Harrelson went on. “It was safe to have fantasies like that because I knew that was all they were, just fantasies. Fantasies never got anybody killed.”\u003c/p\u003e\n\u003cp\u003eKeller wasn’t too sure about that, but he let it go.\u003c/p\u003e\n\u003cp\u003e“Now it’s real,” Harrelson said. “At least I think it’s real. I mean, for all I know, you could be wearing a wire. How do I know I’m not being entrapped?”\u003c/p\u003e\n\u003cp\u003eHow did you answer something like that? Keller decided a solemn approach was indicated. “You have my word,” he said.\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“I think you’re probably a good judge of character, Claude. I think you know my word is good.”\u003c/p\u003e\n\u003cp\u003eHarrelson, who still had not turned to look at him, considered the point and nodded. “Then it’s real,” he said. “I have a chance at getting what I’ve been wishing for all this time. Just because I was indiscreet enough to get on a plane and tell my troubles to the guy sitting next to me. I don’t ordinarily do that.”\u003c/p\u003e\n\u003cp\u003e“I don’t ordinarily listen,” Keller said, “and I certainly don’t ordinarily try to drum up business for my friend. For one thing, he’s got more business than he can handle.”\u003c/p\u003e\n\u003cp\u003e“I can imagine.”\u003c/p\u003e\n\u003cp\u003e“And it’s dangerous, sticking your neck out that way. But I’m a pretty good judge of character myself. I somehow sensed I could trust you.”\u003c/p\u003e\n\u003cp\u003e“That’s good of you to say that.”\u003c/p\u003e\n\u003cp\u003e“You’ll be out of town when it happens,” Keller went on. “My friend’s very good at making things look accidental, so the police may not even bother with you.”\u003c/p\u003e\n\u003cp\u003e“The police,” Harrelson said.\u003c/p\u003e\n\u003cp\u003e“If they ask you questions, you just say you don’t know anything. Is that going to be a problem?”\u003c/p\u003e\n\u003cp\u003e“Actually,” Harrelson said, “it’s true. I won’t know anything, will I?”\u003c/p\u003e\n\u003cp\u003e“Nothing concrete, no. You couldn’t tell them anything if you wanted to. You sat next to a man on a plane? Somebody called you and you met him in the park and never even looked at his face? But you just say you don’t know anything, and if they push it you refuse to answer any more questions without a lawyer.”\u003c/p\u003e\n\u003cp\u003e“One thing I’ve learned, ever since my divorce, is I don’t do anything without a lawyer.”\u003c/p\u003e\n\u003cp\u003eJust don’t bring him along to the park, Keller thought. He said, “The money. If you want to make the initial payment now, we can put this into play.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Is there a problem?”\u003c/p\u003e\n\u003cp\u003e“Well, it’s just that I didn’t bring it,” Harrelson said. “Carrying cash to the park at night, well, it sort of goes against the grain, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003e“I know what you mean. What’s in the briefcase?”\u003c/p\u003e\n\u003cp\u003e“This?” Harrelson clutched the thing to his chest. “Nothing but papers,” he said. “I don’t know why I brought it. Force of habit, I guess.”\u003c/p\u003e\n\u003cp\u003e“All I had to do was mention the briefcase,” he said, “and he was hugging it like a long-lost brother. He had the money. He just didn’t want to turn it over.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope it was just money,” Dot said, “and not a tape recorder. Don’t look like that, Keller. You’re not a deer and I’m not a headlight. I’m sure it was money. He brought it along and then he got second thoughts.”\u003c/p\u003e\n\u003cp\u003e“That’s what it felt like.”\u003c/p\u003e\n\u003cp\u003e“You figure he’s searching his soul, Keller?”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“I have to say it’s easier when the clients come to us. Whatever soul-searching they have to do, they’ve already done it by the time they get in touch. Now he’s going out of town again?”\u003c/p\u003e\n\u003cp\u003e“For a couple of days. I’ll call him when he gets back, and arrange another meeting, and either he’ll bring the cash or he won’t.”\u003c/p\u003e\n\u003cp\u003e“Like eggplant ice cream,” she said.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Either I’ll have some for breakfast tomorrow,” she said, “or I won’t. I have to say the odds are pretty good I won’t. Keller, you know what you could have done? You could have conked him over the head and walked off with the briefcase. We’d have half the money, and you wouldn’t even have to kill anybody.”\u003c/p\u003e\n\u003cp\u003e“I thought of that,” he admitted, “but afterward, while I was walking home. And the first thought I had, and it’s kind of silly, is that’s not what I do, I’m not a mugger.”\u003c/p\u003e\n\u003cp\u003e“You’ve got your code of honor.”\u003c/p\u003e\n\u003cp\u003e“I don’t know about codes, and I’m pretty sure honor hasn’t got anything to do with it. But it’s just not what I do. I told you it was silly.”\u003c/p\u003e\n\u003cp\u003e“Maybe, but I can’t argue with it. Next thing you know we’d be selling dope to schoolchildren and sucking tokens out of subway turnstiles. Except you can’t do that anymore, what with MetroCards. What do you suppose the token-suckers are doing these days?”\u003c/p\u003e\n\u003cp\u003e“I’ll have to think about that.”\u003c/p\u003e\n\u003cp\u003e“God, why would you want to?” She heaved a sigh. “You said he wants to be able to contact you. I hope you told him that’s not on.”\u003c/p\u003e\n\u003cp\u003e“I told him I’d work on it.”\u003c/p\u003e\n\u003cp\u003e“Well, don’t work too hard.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” he said. “I think I’ve got it figured out.”\u003c/p\u003e\n\u003cp\u003eBy the time Harrelson showed up, at the same park bench they’d used the first time, Keller had been waiting almost forty-five minutes. Harrelson wasn’t late, if anything he was a couple of minutes early, but Keller had wanted to make sure there weren’t any surprises.\u003c/p\u003e\n\u003cp\u003eWhile he waited, trying to be unobtrusive without looking unobtrusive, a man and woman came along and sat down on the appointed bench. Keller couldn’t hear what they were saying, but from what he could see they weren’t picking out names for their unborn children. The woman looked on the brink of tears, and the man looked as though he wanted to give her something to cry about.\u003c/p\u003e\n\u003cp\u003eWhat if they were still there when Harrelson arrived? Would he have the sense to pick another bench? Or would he be spooked altogether, and head for home? It was moot, as it turned out, because after ten or twelve minutes of disagreement, the woman sprang to her feet, turned on her heel, and stalked off into the night. “Ignorant cunt,” the man said-to himself, but just loud enough for Keller to hear it-and eventually stood up, yawned, stretched, and set off in the opposite direction.\u003c/p\u003e\n\u003cp\u003eOther park visitors passed the bench, but nobody else sat on it, until Harrelson appeared. He looked around carefully, reminding Keller of a dog turning around three times before lying down. Then he sat, and Keller moved to approach him from the rear.\u003c/p\u003e\n\u003cp\u003e“Claude,” he said softly. “How was your trip?”\u003c/p\u003e\n\u003cp\u003e“Oh,” Harrelson said. “You startled me. I wasn’t expecting…well, that’s not true, of course I was expecting you, but…”\u003c/p\u003e\n\u003cp\u003e“Right,” Keller said. “Claude, let me ask you straight out. Do you want to go through with this?” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-23.html","bookId":2314,"creation":"Oct 5, 2019 6:19:32 PM","modification":"Oct 5, 2019 6:19:32 PM"}
