{"id":96163,"no":26,"title":"Page 26","content":"\u003cp\u003e“I guess.”\u003c/p\u003e\n\u003cp\u003e“I’d say you’re definitely in a mood.”\u003c/p\u003e\n\u003cp\u003e“I think you’re right.”\u003c/p\u003e\n\u003cp\u003eShe thought about it. “You met the guy, you got to know him, and then you had to do him. There was a personal element to it, and that’s what bothers you.”\u003c/p\u003e\n\u003cp\u003eHe thought about it, shook his head. “No,” he said. “I don’t think so. Yes, I met him, and yes, I got to know him, but the more I got to know him the less I liked him. I wouldn’t say it was a pleasure to kill him, but it was satisfying, and not just in the sense of the satisfaction of a job well done.”\u003c/p\u003e\n\u003cp\u003e“He was a pain in the neck.”\u003c/p\u003e\n\u003cp\u003e“He was.”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“I solicited him, Dot. He ran his mouth on the plane, but he wasn’t really looking to kill his partner. I put the idea into his head. That’s why he kept dragging his feet, and being a pain. He never would have been a client if I hadn’t pitched him.”\u003c/p\u003e\n\u003cp\u003e“You went proactive.”\u003c/p\u003e\n\u003cp\u003e“And then, when he became difficult to deal with-”\u003c/p\u003e\n\u003cp\u003e“Try impossible, Keller.”\u003c/p\u003e\n\u003cp\u003e“-I went to his partner, and Harrelson stopped being the client and became the target. It seems…”\u003c/p\u003e\n\u003cp\u003e“Strange?”\u003c/p\u003e\n\u003cp\u003e“Strange,” he agreed. “And, I don’t know. Inappropriate.”\u003c/p\u003e\n\u003cp\u003e“I’ll give you strange,” she said. “But I’m not signing on for inappropriate.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“No. He was the target from the beginning. It just took us a while to realize it.”\u003c/p\u003e\n\u003cp\u003e“I don’t follow you.”\u003c/p\u003e\n\u003cp\u003e“You sat next to him on the plane,” she said, “and he appointed you his designated psychotherapist and poured his heart out to you, and you saw an opportunity.”\u003c/p\u003e\n\u003cp\u003e“I was looking for one, after the turnaround I’d just gone through.”\u003c/p\u003e\n\u003cp\u003e“You were looking for one, and you recognized this one when you saw it. Here are two partners who hate each other and can’t get out from under each other. You came home, and you got the idea of turning proactive, and you approached Harrelson.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“And that was your mistake.”\u003c/p\u003e\n\u003cp\u003e“Turning proactive.”\u003c/p\u003e\n\u003cp\u003e“No,” she said. “Actually that was brilliant, because we needed the money and you were going stale for lack of work. The mistake was you approached the wrong man. You should have gone straight to Blyden.”\u003c/p\u003e\n\u003cp\u003e“It never occurred to me.”\u003c/p\u003e\n\u003cp\u003e“Of course it didn’t. But when you think about it, it becomes obvious. Harrelson met you, he sat next to you on the plane, he heard your voice and saw your face. He’s got a name to go with the face, even if it’s not yours. It’s a risk, working for somebody who knows that much about you.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Besides,” she went on, “Blyden’s tough to kill. He’s in New York all the time, which means violating the don’t-crap-where-you-eat rule. And he’s got this routine that makes him very hard to get at.”\u003c/p\u003e\n\u003cp\u003e“I’d have found a way.”\u003c/p\u003e\n\u003cp\u003e“But it wouldn’t have been easy. Whereas Harrelson-”\u003c/p\u003e\n\u003cp\u003e“Was in a different city every week.”\u003c/p\u003e\n\u003cp\u003e“Exactly. And Blyden has never seen your face, or heard your voice, and never will. He’s heard my voice, but he doesn’t know who I am or how to reach me, and he doesn’t seem to care. All he had to know was that the partner he hated was planning to have him killed, and he was happy to spend a few dollars to turn the tables.”\u003c/p\u003e\n\u003cp\u003e“And he’s not going to talk about it,” Keller said, “because he’s Mr. Inside. He won’t spill the beans to the guy sitting next to him on the plane, because he’s not going to be on the plane in the first place.”\u003c/p\u003e\n\u003cp\u003e“There you go.”\u003c/p\u003e\n\u003cp\u003e“And you’re right,” he said. “Going proactive was fine, but my mistake was I didn’t see the whole picture. I should have gone straight to Blyden.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“You should have come straight to me,” she said, “and I should have gone straight to Blyden.”\u003c/p\u003e\n\u003cp\u003e“You’re right.”\u003c/p\u003e\n\u003cp\u003e“But it came out all right,” she said, “and they tell me that’s all that matters. You feel better about it now?”\u003c/p\u003e\n\u003cp\u003e“I think so,” he said. “I guess I’ll go buy some stamps.”\u003c/p\u003e\n\u003cp\u003e“Keller,” she said, “you took the words right out of my mouth.”\u003c/p\u003e\n\u003cp\u003eKELLER THE DOGKILLER\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003eKeller, trying not to feel foolish, hoisted his flight bag and stepped to the curb. Two cabs darted his way, and he got into the winner, even as the runner-up filled the air with curses. “JFK,” he said, and settled back in his seat.\u003c/p\u003e\n\u003cp\u003e“Which airline?”\u003c/p\u003e\n\u003cp\u003eHe had to think about it. “American.”\u003c/p\u003e\n\u003cp\u003e“International or domestic?”\u003c/p\u003e\n\u003cp\u003e“Domestic.”\u003c/p\u003e\n\u003cp\u003e“What time’s your flight?”\u003c/p\u003e\n\u003cp\u003eUsually they just took you there. Today, when he didn’t have a plane to catch, he got a full-scale inquiry.\u003c/p\u003e\n\u003cp\u003e“Not to worry,” he told the driver. “We’ve got plenty of time.”\u003c/p\u003e\n\u003cp\u003eWhich was just as well, because it took longer than usual to get through the tunnel, and the traffic on the Long Island Expressway was heavier than usual for that hour. He’d picked this time-early afternoon-because the traffic tended to be light, but today for some reason it wasn’t. Fortunately, he reminded himself, it didn’t matter. Time, for a change, was not of the essence.\u003c/p\u003e\n\u003cp\u003e“Where you headed?” the driver asked while Keller’s mind was wandering.\u003c/p\u003e\n\u003cp\u003e“ Panama,” he said, without thinking.\u003c/p\u003e\n\u003cp\u003e“Then you want International, don’t you?”\u003c/p\u003e\n\u003cp\u003eWhy on earth had he said Panama? He’d been wondering if he should buy a straw hat, that was why. “ Panama City,” he corrected himself. “That’s in Florida, you change planes in Miami.”\u003c/p\u003e\n\u003cp\u003e“You got to fly all the way down to Miami and then back up again to Panama City? Ought to be a better way to do it.”\u003c/p\u003e\n\u003cp\u003eThousands of cabdrivers in New York, and for once he had to draw one who could speak English. “Air miles,” he said, in a tone that brooked no argument, and they left it at that.\u003c/p\u003e\n\u003cp\u003eAt the designated terminal, Keller paid and tipped the guy, then carried his flight bag past the curbside check-in. He followed the signs down to baggage claim and walked around until he found a woman holding a hand-lettered sign that read NIEBAUER.\u003c/p\u003e\n\u003cp\u003eShe hadn’t noticed him, so he took a moment to notice her, and to determine that no one else was paying any attention to either of them. She was around forty, a trimly built woman wearing a skirt and blouse and glasses. Her brown hair was medium length, attractive if not stylish, her sharp nose contrasted with her generous mouth, and on balance he’d have to say she had a kind face. This, he knew, was no guarantee of anything. You didn’t have to be kind to have a kind face.\u003c/p\u003e\n\u003cp\u003eHe approached her from the side, and got within a few feet of her before she sensed his presence, turned, and stepped back, looking a little startled. “I’m Mr. Niebauer,” he said.\u003c/p\u003e\n\u003cp\u003e“Oh,” she said. “Oh, of course. I…you surprised me.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“I had noticed you, but I didn’t think…” She swallowed, started over. “I guess you don’t look the way I expected you to look.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m older than I was a few hours ago.”\u003c/p\u003e\n\u003cp\u003e“No, I don’t mean…I don’t know what I mean. I’m sorry. How was your flight?”\u003c/p\u003e\n\u003cp\u003e“Routine.”\u003c/p\u003e\n\u003cp\u003e“I guess we have to collect your luggage.”\u003c/p\u003e\n\u003cp\u003e“I just have this,” he said, holding up the flight bag. “So we can go to your car.”\u003c/p\u003e\n\u003cp\u003e“We can’t,” she said. She managed a smile. “I don’t have one, and couldn’t drive it if I did. I’m a city girl, Mr. Niebauer. I never learned to drive. We’ll have to take a cab.”\u003c/p\u003e\n\u003cp\u003eThere was a moment, of course, when Keller was sure he’d get the same cab, and he could see himself trying to field the driver’s questions without alarming the woman. Instead they got into a cab driven by a jittery little man who talked on his cell phone in a language Keller couldn’t recognize while his radio was tuned to a talk program in what may or may not have been the same unrecognizable language.\u003c/p\u003e\n\u003cp\u003eKeller, once again trying not to feel foolish, settled in for the drive back to Manhattan.\u003c/p\u003e\n\u003cp\u003eTwo days earlier, on the wraparound porch of the big old house in White Plains, Keller hadn’t felt foolish. What he’d felt was confused.\u003c/p\u003e\n\u003cp\u003e“It’s in New York,” he said, starting with the job’s least objectionable aspect. “I live in New York. I don’t work there.”\u003c/p\u003e\n\u003cp\u003e“You drummed up a job on your own, remember? And it was right here in New York.”\u003c/p\u003e\n\u003cp\u003e“And it was a mistake, and we wound up spinning it, and by the time it ended it wasn’t in New York after all. It was in Detroit.”\u003c/p\u003e\n\u003cp\u003e“So it was,” she said, “but you’ve worked other jobs in New York.”\u003c/p\u003e\n\u003cp\u003e“A couple of times,” he allowed, “and it worked out all right, all things considered, but that doesn’t make it a good idea.”\u003c/p\u003e\n\u003cp\u003e“I know,” Dot said, “and I almost turned it down without consulting you. And not just because it’s local.”\u003c/p\u003e\n\u003cp\u003e“That’s the least of it.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“It’s short money,” he said. “It’s ten thousand dollars. It’s not exactly chump change, but it’s a fraction of what I usually get.”\u003c/p\u003e\n\u003cp\u003e“The danger of working for short money,” she said, “is word gets around. But one thing we’d make sure of is nobody knows you’re the one who took this job. So it’s not a question of ten thousand dollars versus your usual fee, because your usual fee doesn’t come into the picture. It’s ten thousand dollars for two or three days’ work, and I know you can use the work.”\u003c/p\u003e\n\u003cp\u003e“And the money.”\u003c/p\u003e\n\u003cp\u003e“Right. And, of course, there’s no travel. Which was a minus the first time we looked at it, but in terms of time and money and all of that-”\u003c/p\u003e\n\u003cp\u003e“Suddenly it’s a plus.” He took a sip of his iced tea. “Look, this is stupid. We’re not talking about the most important thing.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“The, uh, subject is generally a man. Sometimes it’s a woman.”\u003c/p\u003e\n\u003cp\u003e“You’re an equal-opportunity kind of guy, Keller.”\u003c/p\u003e\n\u003cp\u003e“One time,” he said, “somebody wanted me to do a kid. You remember?”\u003c/p\u003e\n\u003cp\u003e“Vividly.”\u003c/p\u003e\n\u003cp\u003e“We turned them down.”\u003c/p\u003e\n\u003cp\u003e“You’re damn right we did.”\u003c/p\u003e\n\u003cp\u003e“Grown-ups,” he said. “Adults only. That’s where we draw the line.”\u003c/p\u003e\n\u003cp\u003e“Well,” she said, “if it matters, the subject this time around is an adult.”\u003c/p\u003e\n\u003cp\u003e“How old is he?”\u003c/p\u003e\n\u003cp\u003e“Five.”\u003c/p\u003e\n\u003cp\u003e“A five-year-old adult,” he said heavily.\u003c/p\u003e\n\u003cp\u003e“Do the math, Keller. He’s thirty-five in dog years.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-26.html","bookId":2314,"creation":"Oct 5, 2019 6:19:32 PM","modification":"Oct 5, 2019 6:19:32 PM"}
