{"id":96180,"no":43,"title":"Page 43","content":"\u003cp\u003e“Not exactly.”\u003c/p\u003e\n\u003cp\u003e“Not exactly. Is that a yes or a no?”\u003c/p\u003e\n\u003cp\u003e“Things happen to people, Dot. They get hit by buses.”\u003c/p\u003e\n\u003cp\u003e“So be careful crossing streets.”\u003c/p\u003e\n\u003cp\u003e“Or, well, the work I do. I don’t usually think of it as dangerous, but I suppose it is.”\u003c/p\u003e\n\u003cp\u003e“It’s usually dangerous for other people. But I suppose the life insurance companies would consider you to be in a high-risk category.”\u003c/p\u003e\n\u003cp\u003e“Or I could get arrested. Last time out I wound up talking to the police. I initiated it, and they never came close to suspecting me of anything, but it gets your attention, when you go and talk to the police.”\u003c/p\u003e\n\u003cp\u003e“I can see where it would.”\u003c/p\u003e\n\u003cp\u003e“If I get killed,” he said, “go straight to my apartment and grab the albums. If I just disappear, if you don’t hear from me and can’t get in touch with me, do the same thing, but in that case just hold on to them for a while on the chance that I’m all right. You can always sell them somewhere down the line. Same thing goes if I get arrested.”\u003c/p\u003e\n\u003cp\u003e“If you get arrested,” she said, “your stamps can shift for themselves. I’m not going anywhere near them.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Because as soon as I get the news I’ll be throwing things in a suitcase and rushing to catch the next flight to Brazil. I want to be long gone before you rat me out.”\u003c/p\u003e\n\u003cp\u003e“You honestly think I would do that?”\u003c/p\u003e\n\u003cp\u003e“Keller,” she said, “welcome to the twenty-first century. Even Mafia guys rat each other out. They’d be charging you with murder, and your only way out would be to cut a deal and give up the client, and you probably wouldn’t know who that was. But you know who I am, and that might be enough to save you from the needle.”\u003c/p\u003e\n\u003cp\u003eHe thought it over, shook his head. “I’d rather have the needle.”\u003c/p\u003e\n\u003cp\u003e“Than give me up? I’m touched, Keller, and you can say that now, and you can even mean it, but-”\u003c/p\u003e\n\u003cp\u003e“I’d rather have the needle than do time in prison.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“And if I did give you up,” he said, “it wouldn’t be for weeks, maybe months. You’d have plenty of time to sell the stamps and close the brokerage account. You could even put this house on the market.”\u003c/p\u003e\n\u003cp\u003e“I wonder what it would bring. There’s no mortgage, and the real estate market’s sky high. It’s better than stamps, and one thing about houses, you don’t have to paste them in a book.” She looked at him and frowned. “Keller,” she said, “is there something you’re not telling me?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“You’re not planning something foolish, are you?”\u003c/p\u003e\n\u003cp\u003e“Something foolish?”\u003c/p\u003e\n\u003cp\u003e“You know.”\u003c/p\u003e\n\u003cp\u003e“What, like killing myself? No, of course not.”\u003c/p\u003e\n\u003cp\u003e“But you think something might happen to you.”\u003c/p\u003e\n\u003cp\u003e“Sooner or later,” he said, “something happens to everybody.”\u003c/p\u003e\n\u003cp\u003e“Well, I guess that’s true.”\u003c/p\u003e\n\u003cp\u003e“I have health insurance,” he said, “and it’s not because I expect to get sick. I mean, I never get sick. But most people do get sick sooner or later, and this way I don’t have to worry about it. And now I won’t have to worry about what happens to my stamps, because you’ll take care of them.”\u003c/p\u003e\n\u003cp\u003e“What gets me,” she said, “is the way you showed up here today. I left you a message, and you never got it, but you came anyway.”\u003c/p\u003e\n\u003cp\u003e“Well, I wanted to have this conversation, and-”\u003c/p\u003e\n\u003cp\u003e“What we haven’t talked about,” she said, “is why I left you a message.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“I got an express shipment.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Remember Al?”\u003c/p\u003e\n\u003cp\u003eIt took him a minute, but then he did remember. “He sent us money.”\u003c/p\u003e\n\u003cp\u003e“He did indeed.”\u003c/p\u003e\n\u003cp\u003e“A long time ago.”\u003c/p\u003e\n\u003cp\u003e“Donkey’s years, whatever that means. It sounds even longer than dog years.”\u003c/p\u003e\n\u003cp\u003e“Prepayment for a job,” he said, “but then there never was a job, and I sort of forgot about him.”\u003c/p\u003e\n\u003cp\u003e“So did I. I figured either he changed his mind or he died, and either way we could just keep the money and forget about it.”\u003c/p\u003e\n\u003cp\u003e“Don’t tell me he sent us more money.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No money. Just a name and an address and a photograph and some newspaper clippings.”\u003c/p\u003e\n\u003cp\u003e“And the photograph is of somebody he wants taken care of.”\u003c/p\u003e\n\u003cp\u003e“Well, it’s not a postcard from the Grand Canyon. You know what I’d like to do? I’d like to send him his money back.”\u003c/p\u003e\n\u003cp\u003e“You’re spooked,” he said.\u003c/p\u003e\n\u003cp\u003e“You’re not? We don’t hear from him and then we do, and it’s the same day you decide your stamps are going to outlive you? No, don’t explain. You’ve got the heebie-jeebies, and all of a sudden here’s Just-Call-Me-Al with something to have the heebie-jeebies about. Dammit, you know how I feel about sending money back.”\u003c/p\u003e\n\u003cp\u003e“You’re against it.”\u003c/p\u003e\n\u003cp\u003e“But this time I’d do it in a heartbeat, but I can’t. Because I don’t know who the son of a bitch is or where he lives. You know what we could do?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” she said. “Zip, zero, nada. If he wants the money back, let him ask for it and tell us where to send it.”\u003c/p\u003e\n\u003cp\u003e“And in the meantime we just wait to hear from him?”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“And he waits for me to do the job, and I don’t.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eHe thought about it. “That’s an awful lot of waiting,” he said. “You said he sent a photo.”\u003c/p\u003e\n\u003cp\u003e“And some clippings. Hang on.”\u003c/p\u003e\n\u003cp\u003eHe read the clippings, studied the photograph, memorized the name and address. “ Albuquerque,” he said.\u003c/p\u003e\n\u003cp\u003e“You’ve been there, haven’t you?”\u003c/p\u003e\n\u003cp\u003e“A long time ago. Is that where Al lives?”\u003c/p\u003e\n\u003cp\u003e“A my name is Alice, my husband’s name is Al, we live in Albuquerque and we raise alpacas. Don’t look at me like that, Keller. It’s a rhyme to jump rope to. If you’d ever been a little girl you’d be familiar with it. I don’t know where he lives. He sent the FedEx from Denver.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003e“Which doesn’t necessarily prove he lives there, either. Why don’t I just file all this crap under F?”\u003c/p\u003e\n\u003cp\u003e“Why F?”\u003c/p\u003e\n\u003cp\u003e“So we can Forget About It. But you don’t want to, do you?”\u003c/p\u003e\n\u003cp\u003e“There may be a direct flight,” he said, “but you know what I think I’ll do? I think I’ll fly American through Dallas.”\u003c/p\u003e\n\u003cp\u003e“I don’t think you should go at all.”\u003c/p\u003e\n\u003cp\u003e“I want to get it over with,” he told her. “I don’t want to sit around waiting for something to happen.”\u003c/p\u003e\n\u003cp\u003e49\u003c/p\u003e\n\u003cp\u003eThere was no reason to expect anyone to meet his flight. Still, he took a long look at the dozen or so men waiting with hand-lettered signs between the security gates and the baggage claim. He read the signs, thinking he might see one with a familiar name on it-NOSCAASI, or BOGART, or even KELLER. He didn’t, but he evidently stared hard at a stoop-shouldered man waiting for a Mr. Brenner, because the man stared just as hard back at him. Keller drew his eyes away and kept walking. He felt the man’s eyes tracking him as he headed for the Hertz desk.\u003c/p\u003e\n\u003cp\u003eHe’d made reservations at three different motels located at consecutive exits along I-40, and he went to them in turn and checked in at each one under a different name, paying cash in advance for a week’s stay. He showered in the first one, left the bed there and in the second motel looking as though it had been slept in, and, in the third motel, stationed himself in front of the television set for an hour or so, flipping back and forth between CNN and one of the sports channels.\u003c/p\u003e\n\u003cp\u003eHe didn’t unpack, and took his carry-on with him when he returned to the car. He ate at a Denny’s, then managed to find an address just off Indian School Road. All the houses were of adobe, but the neighborhood was otherwise a mixed one. Small lots held yellow-brown cubes that looked as though they’d been assembled in a weekend by the owner and a couple of his pals, while other lots were several acres in size, boasting oversize homes designed by architects and elegantly landscaped.\u003c/p\u003e\n\u003cp\u003eThe house he was looking for, with a shack on one side and a Mc-Mansion on the other, was more manor house than shanty, but a good deal less grand than some of its neighbors. The adobe construction allowed for curves and arches, and the overall effect was pleasing. It looked, he decided, like a house in which one could lead a pleasant and comfortable life.\u003c/p\u003e\n\u003cp\u003eKeller wondered what Warren Heggman had done to create such a pleasant and comfortable life for himself, and wondered too why someone wanted that life brought to a close. He looked down at the passenger seat, from which the man’s photo looked back at him. He had a long narrow face, a high forehead. In his forties, Keller thought, or maybe his early fifties.\u003c/p\u003e\n\u003cp\u003eKeller circled the block, pulled up at the curb across the street from the Heggman house. The garage door was closed, so there was no telling if Heggman was home, but there were lights on, which suggested that he probably was.\u003c/p\u003e\n\u003cp\u003eIt didn’t matter. He’d seen the place, he told himself, and now he should return to one of his motel rooms and get a night’s sleep. Then in the morning he could stake the place out and familiarize himself with Heggman’s routine. After a few days he’d be able to work out the best way to get at the man, and in the meantime he’d have equipped himself with a suitable weapon, and then, before too many more days had passed, he could do the job.\u003c/p\u003e\n\u003cp\u003eHe drove on. Then, barely aware of what he was doing, he circled the block one more time and pulled into Heggman’s driveway.\u003c/p\u003e\n\u003cp\u003eThree motel rooms, he thought. Three different names. Pussyfooting around, trying to cover his tracks. Why?\u003c/p\u003e\n\u003cp\u003eLook at Sheridan Bingham, for God’s sake. Holed up in a vault in the middle of a house full of bodyguards, and the only time he could relax was when he got out of there and flew to San Francisco. And what was waiting for him there?\u003c/p\u003e\n\u003cp\u003eHe got out of the car, walked to the front door, rang the bell.\u003c/p\u003e\n\u003cp\u003e50\u003c/p\u003e\n\u003cp\u003e“I thought it might be you,” Dot said. “How’s the weather in Albuquerque?”\u003c/p\u003e\n\u003cp\u003e“I’m in White Plains,” he said.\u003c/p\u003e\n\u003cp\u003e“That’s funny,” she said. “So am I. What do you mean, you’re in White Plains?”\u003c/p\u003e\n\u003cp\u003e“At the train station.”\u003c/p\u003e\n\u003cp\u003e“Well, sit tight,” she said. “I’ll pick you up.”\u003c/p\u003e\n\u003cp\u003e“I’ll take a cab. Really, it’s easier.”\u003c/p\u003e\n\u003cp\u003eThe cab dropped him in front of her house, and she was waiting for him on the porch. “You pruned the spider plant,” he said. “I think it looks better that way, with both of them the same size.”\u003c/p\u003e\n\u003cp\u003e“The baby I lopped off,” she said, “is in the sunroom in another pot. Once you start with plants it never ends. If you were going to take a cab, why did you bother calling?”\u003c/p\u003e\n\u003cp\u003e“Well, I came out without calling the other day, and it took you by surprise.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-parade-keller-3/page-43.html","bookId":2314,"creation":"Oct 5, 2019 6:19:32 PM","modification":"Oct 5, 2019 6:19:32 PM"}
