{"id":88442,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Often,” Joe agreed. “But not always.”\u003c/p\u003e\n\u003cp\u003eRobert shook his head. “I’m glad you two have solved this thing.”\u003c/p\u003e\n\u003cp\u003eThey looked at each other sheepishly. “Sorry,” Joe murmured.\u003c/p\u003e\n\u003cp\u003e“A dark sedan,” Robert said. “That suggests middle class, probably white-collar. Maybe even someone who goes home after an abduction or murder to a wife and kids. Wouldn’t be unusual.”\u003c/p\u003e\n\u003cp\u003e“No,” Joe agreed. “But let’s not talk about murder over dinner, okay?”\u003c/p\u003e\n\u003cp\u003eThe salads came and went. Leslie spoke enthusiastically about her time in Virginia, and Joe made them laugh with a few of the funnier details from his recent case in Las Vegas. But when coffee came, Robert returned to the subject of the disappearances.\u003c/p\u003e\n\u003cp\u003e“So…you both think our missing women are dead? And our one man, the Mimic, was a tranny. He liked to dress up and walk the streets with the girls. I guess he was good at what he did.”\u003c/p\u003e\n\u003cp\u003eLeslie hesitated. “I’m afraid I do think they’re dead. I assume you’ve had policewomen dressed up as prostitutes, working the same streets?”\u003c/p\u003e\n\u003cp\u003e“Nights on end. As soon as we pull them off, our guy knows. Apparently he can smell a policewoman a mile away.”\u003c/p\u003e\n\u003cp\u003e“Then there’s Genevieve. She wasn’t a hooker, but she was close to them. Thing is, my witness says she went over to the car because she knew whoever was in it,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Presumably someone respectable,” Leslie said.\u003c/p\u003e\n\u003cp\u003e“Great. In a city of millions, I’m now looking for someone respectable who drives a dark sedan,” Robert said with a weary sigh. He frowned, looking at Joe. “So…now that you’ve spoken with Eileen Brideswell and looked into Genevieve’s disapearance, you seem to think that it’s connected to my hookers, as well.”\u003c/p\u003e\n\u003cp\u003e“Yes, I do,” Joe said.\u003c/p\u003e\n\u003cp\u003eRobert gazed over at Leslie thoughtfully. “Would you be willing to go to the street with me at night and see if…see if you get any hunches or vibes or whatever?”\u003c/p\u003e\n\u003cp\u003e“All right,” Leslie said after a brief hesitation.\u003c/p\u003e\n\u003cp\u003e“No,” Joe said flatly.\u003c/p\u003e\n\u003cp\u003eThey both stared at him; Leslie was frowning.\u003c/p\u003e\n\u003cp\u003e“It would be better if she went with me. You’re a nice cop, Robert, but you’re still a cop. I’m not.”\u003c/p\u003e\n\u003cp\u003e“You’re a private investigator. Do hookers like investigators any better?” Robert asked.\u003c/p\u003e\n\u003cp\u003e“Frankly, yes, they do.”\u003c/p\u003e\n\u003cp\u003eIt was Robert’s turn to frown.\u003c/p\u003e\n\u003cp\u003eLeslie leaned forward. “Robert, I’ll help in any way I can, even though I honestly don’t think I’m going to be able to help.” If only he knew what led her to her discoveries, he wouldn’t be so eager for her help, she thought. “But…”\u003c/p\u003e\n\u003cp\u003e“But?” Robert asked, curious.\u003c/p\u003e\n\u003cp\u003e“We need help, too.”\u003c/p\u003e\n\u003cp\u003e“We?”\u003c/p\u003e\n\u003cp\u003eRobert stared across the table at them. Joe hoped he couldn’t tell that he, too, had no idea what she was talking about.\u003c/p\u003e\n\u003cp\u003e“It was no accident.”\u003c/p\u003e\n\u003cp\u003e“What are we talking about?” Robert asked.\u003c/p\u003e\n\u003cp\u003eLiar, she thought. He knew. “Hastings House,” she said.\u003c/p\u003e\n\u003cp\u003eRobert groaned. “Don’t you think I went over all the information we had with a fine-toothed comb?”\u003c/p\u003e\n\u003cp\u003e“And don’t you think that explosion was pretty damn strange?” Leslie demanded.\u003c/p\u003e\n\u003cp\u003e“Accidents are strange. That’s why they’re accidents,” Robert said testily. “Joe, you’ve been through the files. Everything points to—”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter what everything points to. We both know that what’s obvious is not necessarily the truth.”\u003c/p\u003e\n\u003cp\u003eRobert groaned again. “You think some fanatic was trying to blow up the whole house? Why? Because he hates history and wants to see a skyscraper there?”\u003c/p\u003e\n\u003cp\u003eLeslie shook her head gravely. “No. If someone wanted the whole house blown up, it would have been.”\u003c/p\u003e\n\u003cp\u003eRobert looked at Joe. “Did you instigate this?”\u003c/p\u003e\n\u003cp\u003e“Hey,” he said gruffly, “Matt was my cousin. Don’t ask me to accept something just because everyone else thinks it’s obvious.”\u003c/p\u003e\n\u003cp\u003e“Sometimes, when the sun is shining, it’s daytime,” Robert snapped.\u003c/p\u003e\n\u003cp\u003e“And sometimes, when it’s dark, it’s because there’s an eclipse,” Leslie snapped back.\u003c/p\u003e\n\u003cp\u003e“She’s right,” Joe said with a shrug.\u003c/p\u003e\n\u003cp\u003e“You two loved Matt. You don’t want to accept that he died because of a stupid accident. I get it. But he’s gone, and it was an accident. You have to learn to live with it.”\u003c/p\u003e\n\u003cp\u003e“Matt wasn’t the only one who died that night,” Leslie said.\u003c/p\u003e\n\u003cp\u003e“But the thing is,” Joe added, “I don’t think it was an accident, and I can’t help but think that Matt was targeted.”\u003c/p\u003e\n\u003cp\u003e“Targeted?” Robert said. “Oh, come on!”\u003c/p\u003e\n\u003cp\u003eJoe was surprised when Leslie plunged in more quickly than he could. “Targeted. He was in the back room, and it was the back room that blew up.”\u003c/p\u003e\n\u003cp\u003e“Because that’s where the build-up in the line was,” Robert said.\u003c/p\u003e\n\u003cp\u003e“You’ll let me have the files again?” Joe demanded.\u003c/p\u003e\n\u003cp\u003eRobert threw up his hands. “I’ll get you the files.”\u003c/p\u003e\n\u003cp\u003e“That’s not enough,” Leslie said stubbornly. “If we need you to do something, you’ll do it.”\u003c/p\u003e\n\u003cp\u003e“You are…a mule,” he told Leslie.\u003c/p\u003e\n\u003cp\u003e“Mule? Well, I’ve been called a cadaver dog before, so I guess mule is no worse.”\u003c/p\u003e\n\u003cp\u003eRobert laughed. “Was I the one who called you that?”\u003c/p\u003e\n\u003cp\u003e“Maybe. I don’t remember. But mule will do just fine.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “More hopeless causes.”\u003c/p\u003e\n\u003cp\u003e“Aren’t they the best kind?” she teased.\u003c/p\u003e\n\u003cp\u003eRobert rolled his eyes, but he was smiling.\u003c/p\u003e\n\u003cp\u003eLeslie lifted her beer. “To us—and a solution to all our mysteries.”\u003c/p\u003e\n\u003cp\u003eJoe felt a moment’s unease. He didn’t know why. Maybe because Leslie seemed so fearless.\u003c/p\u003e\n\u003cp\u003e“To us—and a solution to all our mysteries,” Robert repeated. There was no skepticism in his voice, but there was no assurance, either.\u003c/p\u003e\n\u003cp\u003e“To us,” Joe added simply.\u003c/p\u003e\n\u003cp\u003eSoon after, they left. Joe had left his car on the street near Hastings House. Robert offered them a lift, but it was only a few blocks back and the night was pleasant, so they opted to walk.\u003c/p\u003e\n\u003cp\u003eThey walked in companionable silence for several minutes. Then she turned to him with a smile, her eyes bright. “I have to know, just like you.”\u003c/p\u003e\n\u003cp\u003e“We may never discover anything. Maybe it really was an accident.”\u003c/p\u003e\n\u003cp\u003e“I just don’t believe it,” she said. “And you don’t, either.”\u003c/p\u003e\n\u003cp\u003e“Like Robert said, we both loved Matt,” he reminded her.\u003c/p\u003e\n\u003cp\u003e“I know, but…”\u003c/p\u003e\n\u003cp\u003eHer words hung in the air. He was startled when, a moment later, she slipped her arm through his. Startled, and pleased, despite himself. She was counting on him as a friend, he thought.\u003c/p\u003e\n\u003cp\u003eScrew it, Matt. I can’t help it. Damn, you were a lucky man.\u003c/p\u003e\n\u003cp\u003eHe vowed to be the friend she needed without turning into a stinking lech. She had enough of those around her. She was strong. She could handle herself. But he still felt a sudden urge to smash Hank Smith’s face.\u003c/p\u003e\n\u003cp\u003eYeah, what about your own?\u003c/p\u003e\n\u003cp\u003eNo way out of it. She was sheer seduction. Just by walking, talking…being.\u003c/p\u003e\n\u003cp\u003e“There’s the house,” he said, his voice husky as they turned a corner and Hastings House came into view.\u003c/p\u003e\n\u003cp\u003e“The house,” she repeated softly, and she seemed distant for a minute.\u003c/p\u003e\n\u003cp\u003eWhen they reached the door, he knew that he didn’t dare go in.\u003c/p\u003e\n\u003cp\u003eShe didn’t ask him.\u003c/p\u003e\n\u003cp\u003eIn fact, it seemed that she changed a little, once they were there.\u003c/p\u003e\n\u003cp\u003e“That was a great dinner. Thank you.”\u003c/p\u003e\n\u003cp\u003e“Sure. Nothing like discussing serial killers over a meal.”\u003c/p\u003e\n\u003cp\u003eShe smiled sadly at that. “They’re out there.”\u003c/p\u003e\n\u003cp\u003e“And it seems that there’s one working this area. You be careful. Really careful.”\u003c/p\u003e\n\u003cp\u003e“It’s not like I actually go anywhere,” she told him. “To work…and tonight I was out with you and Robert. I think I’m safe enough…. Well, good night, and thank you again.”\u003c/p\u003e\n\u003cp\u003e“’Night.”\u003c/p\u003e\n\u003cp\u003e“When do you want to take a walk on the wild side?” she asked abruptly, surprising him.\u003c/p\u003e\n\u003cp\u003e“Whenever you’re ready.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow night?”\u003c/p\u003e\n\u003cp\u003e“If your day isn’t too exhausting,” he told her.\u003c/p\u003e\n\u003cp\u003e“It won’t be. Digging is fun, and luckily, the guys like to do the talking.”\u003c/p\u003e\n\u003cp\u003eShe stood on her toes and kissed his cheek.\u003c/p\u003e\n\u003cp\u003e“Good night. Set that alarm.”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eShe went in. He listened, and could just hear her keying the alarm. Satisfied, he started down the walk, head bowed in thought as he turned onto the sidewalk and headed toward his car.\u003c/p\u003e\n\u003cp\u003eHe heard the sudden revving of a motor.\u003c/p\u003e\n\u003cp\u003eHe looked up just as a dark sedan shot past him on the quiet night street. He was in time to catch two numbers at the end of the license plate.\u003c/p\u003e\n\u003cp\u003eSix-three.\u003c/p\u003e\n\u003cp\u003eHe looked back.\u003c/p\u003e\n\u003cp\u003eWhere the hell had the car come from? The prostitutes’ favorite corner wasn’t far, only about four blocks down, one over.\u003c/p\u003e\n\u003cp\u003eHe swore and raced toward his own car.\u003c/p\u003e\n\u003cp\u003eBut he was too late, and he knew it. By the time he reached the corner of Broadway, there was nothing in sight but a Hummer and three taxis.\u003c/p\u003e\n\u003cp\u003eHe stopped, irrationally tempted to go back to check on Leslie. In the rearview mirror, Hastings House seemed to look back at him like a living thing. Lights in the upstairs windows could have been eyes. The fanlight above the door could have been a mouth.\u003c/p\u003e\n\u003cp\u003eUpstairs, a light went out.\u003c/p\u003e\n\u003cp\u003eThe alarm was on, he told himself. State-of-the-art. And the house wasn’t far from One Police Plaza. She was safe. And he had to face it; she hadn’t wanted to let him in.\u003c/p\u003e\n\u003cp\u003eStill, he drove back. He knew he should have been totally focused on finding Genevieve O’Brien, but he also knew he was doing all the right things, following the right leads. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-22.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
