{"id":88444,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLaymon, bless him, had already staked out his territory. Large signs propped against two niches in the wall read Do Not Touch!!!\u003c/p\u003e\n\u003cp\u003eBut there was no such sign on the niche where Brad and Laymon had found the record book. She hoped it hadn’t already been taken away to be preserved. She felt a little guilty, knowing that any touch might injure the old paper, but she had a feeling she might find a reference to the woman whose remains she had found, as well as to the child, Mary, and she was determined to find the little girl’s remains so she could reunite mother and child.\u003c/p\u003e\n\u003cp\u003eVery carefully, she moved to the niche and found the book. Leather-bound, and protected for so many years in this sealed environment, it was in far better shape than she had dared to hope. Then again, she reminded herself, some books—well, scrolls—had survived for millennia.\u003c/p\u003e\n\u003cp\u003eA breath of cold air suddenly seemed to sweep around her. She frowned and looked over her shoulder. The place was in shadow, but she could tell she was alone. Even so…\u003c/p\u003e\n\u003cp\u003e“Hello?” she said softly.\u003c/p\u003e\n\u003cp\u003eShe frowned. There could certainly be more ghosts here, of course, but she hadn’t felt the sense that some disembodied being from a different time had joined her, even though surely there were at least a few here. She was certain that some of the people interred in this earth had died violent or miserable deaths. No, she had felt a breeze. Movement. Not just the chill that some suggested accompanied ghosts, but a real breeze. As if someone or something had joined her in the crypt and disturbed the air by moving.\u003c/p\u003e\n\u003cp\u003eShe shrugged. Strange. Even when she had first started seeing ghosts, she hadn’t felt such a sudden chill. She had felt fear, but only the natural fear of the unknown. She had never felt the sense of unease that had ridden on that breeze, a feeling of something icy, like a warning trickle down her spine.\u003c/p\u003e\n\u003cp\u003e“Enough,” she said aloud, then focused on the shadows. The room wasn’t that big. She was obviously alone.\u003c/p\u003e\n\u003cp\u003eGritting her teeth, she dismissed the strange sensation and returned her attention to the book.\u003c/p\u003e\n\u003cp\u003eAs she had hoped, it was the parish register, filled with the dates of weddings, births and, of course, deaths.\u003c/p\u003e\n\u003cp\u003eShe didn’t run her fingers down the pages. She would never disrespect such a precious relic that way. But her eyes roamed. The book had been kept by a Father Browne, and his script was clear, with only a slight flourish. So many people. These were not the rich and famous, though she was sure there were a few rabble-rousers among them, since most of the entries were from the 1850s, when gang violence had been rampant. The Times had written about the desperate throngs, saying that the streets had been filled with ruffians, and there had been no promise of safety anywhere in the disorderly metropolis. May 1849 had brought the Astor Place riots, with many dying when a mob had protested the appearance of the aristocratic English actor William Macready, believing the role of Macbeth belonged to American luminary Edwin Forrest. Had a theatrical question really created such a stir, or had the true cause been the great chasm growing between the rich and poor of the city? Most people believed that the wretched living conditions of so many had lain behind the violence, fanned into action on the pretext of cultural controversy.\u003c/p\u003e\n\u003cp\u003eShe went back and quickly noted that some of the earliest recorded deaths in the book were from May 1849. She wondered if any of the deceased had met their fates during the riots.\u003c/p\u003e\n\u003cp\u003eNext she went carefully, page by page, looking for a child named Mary.\u003c/p\u003e\n\u003cp\u003eShe found ten of them. With a sigh, she knew she was going to have to find out Mary’s surname before she could go any further.\u003c/p\u003e\n\u003cp\u003eBit by bit she grew aware of a slight noise, like a muted shuffle. She had been so intent on the records, she realized, that she had forgotten her strange feeling of a few minutes earlier.\u003c/p\u003e\n\u003cp\u003eThere really did seem to be something—someone?—hidden in the shadows behind her.\u003c/p\u003e\n\u003cp\u003eShe straightened, determined that she wasn’t about to start being afraid of the dark.\u003c/p\u003e\n\u003cp\u003eNo good.\u003c/p\u003e\n\u003cp\u003eClosing the book, she turned, certain she had heard a noise. But no matter how intently she peered into the room’s dark corners, there didn’t seem to be anyone else there. Shifting earth, she thought. Or a breeze coming in through the hole in the wall where she had originally fallen through. They needed to shore up the place before they did much more work in it or allowed more people in, she decided.\u003c/p\u003e\n\u003cp\u003eShe turned back to the niche where the book had lain, hoping more treasures might be stored there.\u003c/p\u003e\n\u003cp\u003eAs she turned, she knew. Knew.\u003c/p\u003e\n\u003cp\u003eSomeone was behind her.\u003c/p\u003e\n\u003cp\u003eSomeone was there with her, unseen, hidden, but how? Where?\u003c/p\u003e\n\u003cp\u003eShe started to turn.\u003c/p\u003e\n\u003cp\u003eToo late.\u003c/p\u003e\n\u003cp\u003eShe felt a sudden, fierce pain knife through the back of her head. She staggered against the wall and fell.\u003c/p\u003e\n\u003cp\u003eBack at his car, Joe stared across the street to Hastings House and saw the door open. The woman in charge of ticketing came out, Melissa…something, he recalled. He’d talked to her in the course of investigating the explosion.\u003c/p\u003e\n\u003cp\u003eShe looked up at the house, stretched and smiled. He felt as if he were interrupting a personal moment, her pleasure in just being there was so evident.\u003c/p\u003e\n\u003cp\u003eHe walked over to her anyway. “Melissa, good morning.”\u003c/p\u003e\n\u003cp\u003eFor a moment she stared at him as if she were seeing a ghost.\u003c/p\u003e\n\u003cp\u003e“Oh, hi. Sorry. We’ve met…right? You’re Joe Connolly, the P.I.? You look so much like your cousin. I talked to you after the explosion, right?”\u003c/p\u003e\n\u003cp\u003e“Right. And I’m friends with Leslie.” He didn’t see any reason to tell her that they’d just met a few days ago.\u003c/p\u003e\n\u003cp\u003e“Would you like some coffee?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eHe followed her inside, wondering why he felt that just being in the house would somehow help him.\u003c/p\u003e\n\u003cp\u003e“Leslie is phenomenal,” Melissa said as they reached the kitchen.\u003c/p\u003e\n\u003cp\u003e“Yes, she is.”\u003c/p\u003e\n\u003cp\u003e“Doughnut?” she asked.\u003c/p\u003e\n\u003cp\u003e“I’d love one.”\u003c/p\u003e\n\u003cp\u003e“Doughnuts get such a bad rap these days,” she told him.\u003c/p\u003e\n\u003cp\u003e“Once in a while, they’re good for the soul,” he said.\u003c/p\u003e\n\u003cp\u003eMelissa looked around the kitchen. “I do love this house so much. Oh!” She blushed, realizing how she sounded. “I’m sorry. I know that your cousin…well, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“It’s not the fault of the house, Melissa,” he said.\u003c/p\u003e\n\u003cp\u003eShe leaned toward him, a slightly faraway look in her eyes. “Maybe it is.”\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003e“Maybe…I don’t know. This house makes me feel…weird. Can a house be jinxed…or…evil?” she asked.\u003c/p\u003e\n\u003cp\u003eHe arched a brow. “No,” he said firmly.\u003c/p\u003e\n\u003cp\u003e“Sorry,” she said quickly. “And it’s not bad vibes I get here. In fact, I should get bad vibes, after what happened, but…I get good ones. If the place is haunted, though…it could be Revolutionary War ghosts, or Civil War ghosts, or Irish gang ghosts….” She got a faraway look in her eyes, as if she’d traveled back in time herself.\u003c/p\u003e\n\u003cp\u003eJoe stared at her, feeling a strange creeping sensation along his nape. Hell. He was six foot three and two hundred and twenty pounds of muscle. He’d faced cold-blooded killers in his time, and he sure as hell wasn’t afraid of the dark. So how the hell had this tiny woman given him the shivers? But it wasn’t her, he realized.\u003c/p\u003e\n\u003cp\u003eIt was the house.\u003c/p\u003e\n\u003cp\u003eOh, like hell.\u003c/p\u003e\n\u003cp\u003e“You weren’t at the party that night, were you?” he asked Melissa.\u003c/p\u003e\n\u003cp\u003e“Me? No. I’m just the hired help.”\u003c/p\u003e\n\u003cp\u003e“You’re far more than hired help,” he told her, and watched her flush. She seemed to thrive on the least compliment. Earnest and sincere, and not homely but also not a raving beauty, she had probably worked hard for every achievement in her life. She deserved a few compliments, he decided.\u003c/p\u003e\n\u003cp\u003e“You weren’t here, either, were you?”\u003c/p\u003e\n\u003cp\u003e“No, I wasn’t.” A strange sense of cold suddenly washed over him as he spoke. He looked around, thinking there had to be an air-conditioning vent somewhere near, but he didn’t see one.\u003c/p\u003e\n\u003cp\u003eThen, inexplicably, while he was just standing there, he lost his balance and stumbled.\u003c/p\u003e\n\u003cp\u003eDisturbed, he frowned and strode past Melissa into the back servants’ pantry, where the explosion had happened. Everything was perfectly restored now, but even so, he walked over and stood by the hearth, wondering exactly where Matt had been standing.\u003c/p\u003e\n\u003cp\u003eAn odd sense of pressure filled his head.\u003c/p\u003e\n\u003cp\u003eLeslie…\u003c/p\u003e\n\u003cp\u003eHe must be going crazy. He could have sworn he heard her name, but there was no one else in the room.\u003c/p\u003e\n\u003cp\u003eHe felt torn between the urge to stay and discover what was going on here to spook him and the irrational urge to run back to the dig site to see Leslie, as if she were in danger.\u003c/p\u003e\n\u003cp\u003eHe felt almost as if he were pushed to join her, as if a strange whisper in his head was urgently telling him to go to her.\u003c/p\u003e\n\u003cp\u003eRidiculous. She was working and perfectly safe.\u003c/p\u003e\n\u003cp\u003e“What is it?” Melissa asked, looking at him from the doorway.\u003c/p\u003e\n\u003cp\u003e“Nothing. Nothing at all. Thanks for the doughnut. I’ll be seeing you.”\u003c/p\u003e\n\u003cp\u003eHe was out of the house in a flash and found himself running down the street toward the dig.\u003c/p\u003e\n\u003cp\u003eShe blinked. There was a blinding light shining in her eyes, and for a moment she thought she was staring at a monster, then realized it was a man.\u003c/p\u003e\n\u003cp\u003eProfessor Laymon was staring down at her, the light from his electric lantern reflected in the lenses of his glasses, his gaunt face made eerie by the play of light and shadow.\u003c/p\u003e\n\u003cp\u003e“She’s fine,” he announced to someone outside her field of vision. “She’s fine.”\u003c/p\u003e\n\u003cp\u003eA monster? Or a man? Someone had hit her.\u003c/p\u003e\n\u003cp\u003eShe kept silent, suddenly suspicious.\u003c/p\u003e\n\u003cp\u003e“We need to call 911,” she heard Brad announce worriedly.\u003c/p\u003e\n\u003cp\u003e“No, no,” she said, waving a hand in the air, sitting up. The dark room swayed for a minute, but then her vision cleared almost instantly. She looked around and frowned. She definitely wasn’t alone anymore. And she wasn’t by the wall anymore, either. She was sitting in a pile of rubble, halfway across the room.\u003c/p\u003e\n\u003cp\u003e“I don’t see—” she began.\u003c/p\u003e\n\u003cp\u003e“You got a good clunk on the head,” Brad said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-24.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
