{"id":88451,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThey’d wound up eating supper with Brad and Ken, though she’d been surprised when Ken had come by to suggest it, having figured he was having fun at the bar and would probably be going home with one of the women surrounding him. But he had assured her that he had an image to maintain. “I keep my real women a secret,” he’d told her with a wink. She wasn’t sure exactly what that meant, but she was glad she’d never fallen for the man. Not that there was anything really bad about him, but no way was she going to stand for being someone’s secret.\u003c/p\u003e\n\u003cp\u003eShe was glad when they spent the dinner arguing about the next election—something different, for a change, she thought. Then Ken had talked about a new costume exhibit at the Metropolitan Museum of Art, and she found herself fascinated and anxious to see it. Then, at last, they left, ostensibly heading home.\u003c/p\u003e\n\u003cp\u003e“Details?” Joe asked her as he showed her into his car. “There are no details.”\u003c/p\u003e\n\u003cp\u003e“Have it your way,” she said, not seeing any point in trying to force him to talk if he didn’t want to. “So we’re going to see your prostitute, right?”\u003c/p\u003e\n\u003cp\u003eHis brow furrowed. “She’s not my prostitute,” he said lightly.\u003c/p\u003e\n\u003cp\u003e“Sorry, I didn’t mean it that way.”\u003c/p\u003e\n\u003cp\u003e“I think you’ll like her. There’s something about her…”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I have no intention of judging her,” Leslie said.\u003c/p\u003e\n\u003cp\u003eThey drove slowly along the street.\u003c/p\u003e\n\u003cp\u003e“There she is,” Joe said. “I’m going to park.”\u003c/p\u003e\n\u003cp\u003e“Let me out first, will you? I want to get a feel for the street.”\u003c/p\u003e\n\u003cp\u003eHe looked at her gravely. “Don’t get into any trouble. I’ll be right there.”\u003c/p\u003e\n\u003cp\u003e“What trouble can I get into?” she asked.\u003c/p\u003e\n\u003cp\u003eHe pulled over to the curb and she hopped out. She looked up and down the street. They were very near Hastings House. In fact, she could see the subway station she would have used if she’d needed to.\u003c/p\u003e\n\u003cp\u003eShe was surprised by the number of women working the area. She never would have suspected it. By day, this was a business area. There were only a few hotels, and those median-range—business range—in price. Maybe not such a bad place to turn tricks after all, now that she thought about it.\u003c/p\u003e\n\u003cp\u003eShe didn’t look for Didi Dancer. She just stood on the street and closed her eyes, trying to get a feel for something.\u003c/p\u003e\n\u003cp\u003e“Honey, are you all right?”\u003c/p\u003e\n\u003cp\u003eShe looked up at the tall woman in the very short skirt who had stopped to talk to her. Definitely dressed for business.\u003c/p\u003e\n\u003cp\u003e“Fine, thanks.”\u003c/p\u003e\n\u003cp\u003e“I thought you were going to pass out there, for a minute. Well, if you’re all right…” She hesitated, then shook her head. “Honey, you look as innocent as a lamb. Are you lost? You really shouldn’t be out here alone at night. I mean…crime is down big time in the City, but still…”\u003c/p\u003e\n\u003cp\u003e“Are you Didi Dancer?” Leslie asked.\u003c/p\u003e\n\u003cp\u003eThe woman stepped back, looking suspicious.\u003c/p\u003e\n\u003cp\u003eJust then Joe got out of the car and started walking in their direction. Didi took another step back.\u003c/p\u003e\n\u003cp\u003e“Didi,” Joe said.\u003c/p\u003e\n\u003cp\u003eShe just waited, keeping her distance, a frown furrowing her features.\u003c/p\u003e\n\u003cp\u003eJoe reached them. “I got you that job interview,” he reminded her softly.\u003c/p\u003e\n\u003cp\u003eDidi looked at him. “And it’s not till next week. Gotta eat till then,” she murmured. “This the girlfriend? Looking for a three-way or something?” she demanded.\u003c/p\u003e\n\u003cp\u003eLeslie had the feeling the woman was just trying to be harsh. “I’m trying to help Joe find the women who’ve disappeared.”\u003c/p\u003e\n\u003cp\u003e“You mean you’re trying to find the rich girl,” Didi said.\u003c/p\u003e\n\u003cp\u003e“Hey, what’s the matter, Didi?” Joe asked. “You said you wanted to help.”\u003c/p\u003e\n\u003cp\u003eDidi let out a sigh, but her eyes were still suspicious when she looked at Leslie. “There’s something about her….” she murmured.\u003c/p\u003e\n\u003cp\u003e“Will you show me where the car was—the dark sedan—when Genevieve O’Brien got into it? Please?” Leslie said.\u003c/p\u003e\n\u003cp\u003e“Right there.” Didi pointed ten feet down the block. “I remember because of the fire hydrant. I knew when the guy pulled over that any idiot would know not to even pretend to park there.”\u003c/p\u003e\n\u003cp\u003eLeslie walked over to the spot as Didi and Joe just watched her.\u003c/p\u003e\n\u003cp\u003eAt first she felt nothing but the night air, heard nothing but the normal sounds of the city.\u003c/p\u003e\n\u003cp\u003eA cat meowed.\u003c/p\u003e\n\u003cp\u003eA dog barked.\u003c/p\u003e\n\u003cp\u003eA car backfired, and a horn blared.\u003c/p\u003e\n\u003cp\u003eRap music shook the pavement as someone drove by with the radio cranked up.\u003c/p\u003e\n\u003cp\u003eWhat am I doing? she asked herself. It’s not like I have ESP.\u003c/p\u003e\n\u003cp\u003eBut she closed her eyes anyway, saw the picture of Genevieve O’Brien in her mind’s eye.\u003c/p\u003e\n\u003cp\u003eThe sounds of night faded. She imagined the street as it must have been that night. She could see Genevieve, passionate, urgent, trying to convince Didi that she had to get out of this life and help herself. And then…\u003c/p\u003e\n\u003cp\u003eShe heard the car horn.\u003c/p\u003e\n\u003cp\u003eGenevieve turned….\u003c/p\u003e\n\u003cp\u003eAnd recognized the person in the car.\u003c/p\u003e\n\u003cp\u003eNot a friend!\u003c/p\u003e\n\u003cp\u003eThat sensation swept through Leslie fiercely. Not a friend, but still someone she knew. Someone who bugged her, who compounded the headaches of the system, who didn’t care about the work that needed to be done.\u003c/p\u003e\n\u003cp\u003eGenevieve was irritated as she walked over to the car.\u003c/p\u003e\n\u003cp\u003eLeslie could almost hear the man’s voice.\u003c/p\u003e\n\u003cp\u003eGet in and we’ll talk about it. I’ll even give you a ride home.\u003c/p\u003e\n\u003cp\u003eSo Genevieve got in. She had no inkling of danger.\u003c/p\u003e\n\u003cp\u003eNot until they had been driving for several minutes. Then, with one hand on the wheel, he had turned to her while she was talking about the issue and snapped something with his free hand. She frowned, still not alarmed, until he pressed his hand over her mouth and a sickeningly sweet smell filled her nostrils….\u003c/p\u003e\n\u003cp\u003eNo! She struggled, tried to fight, tried to push away his hand. He was still driving, and there were people around, if she could just scream, fight, bang on the window….\u003c/p\u003e\n\u003cp\u003eBut she couldn’t. She was losing consciousness. And she knew…\u003c/p\u003e\n\u003cp\u003e“Leslie!”\u003c/p\u003e\n\u003cp\u003eLeslie heard her own name and the spell was broken. The feelings, the vision, faded away.\u003c/p\u003e\n\u003cp\u003eThe next thing she knew, Joe’s arms were around her as she realized she had been about to crash to the pavement.\u003c/p\u003e\n\u003cp\u003e“I knew there was more to that bump on the head,” he announced. “I’m getting you home.”\u003c/p\u003e\n\u003cp\u003e“No, no. Please,” she protested, somehow finding the strength to stand. “My head is fine.”\u003c/p\u003e\n\u003cp\u003eWhat on earth had just happened? She’d never experienced anything like that before. And she’d thought talking to ghosts was weird?\u003c/p\u003e\n\u003cp\u003eDidi was staring at her as if she were an alien.\u003c/p\u003e\n\u003cp\u003eLeslie gave her what she hoped was a reassuring smile. “Sorry.”\u003c/p\u003e\n\u003cp\u003e“You a psychic or something?”\u003c/p\u003e\n\u003cp\u003e“No,” Leslie demurred, but the woman was still staring at her, as was Joe. “Well, kind of,” she admitted uneasily. “Sometimes I get…sensations. You know, when someone is…”\u003c/p\u003e\n\u003cp\u003e“Dead?” Didi asked flatly.\u003c/p\u003e\n\u003cp\u003eLeslie shrugged. “I…I hope not. Genevieve did know whoever picked her up,” she said with conviction, looking at Joe.\u003c/p\u003e\n\u003cp\u003eDidi sniffed. “I could have told you that. He had to be a friend.”\u003c/p\u003e\n\u003cp\u003e“No, that’s just it. He was someone she knew, but not a friend. Someone she did business with, worked with somehow. She was annoyed when she saw him.”\u003c/p\u003e\n\u003cp\u003e“She got right into the car,” Didi said.\u003c/p\u003e\n\u003cp\u003e“Right—because she knew him. Because even though she didn’t like him, he was respectable, someone people trusted, but she wanted something from him that she wasn’t getting.”\u003c/p\u003e\n\u003cp\u003e“Ain’t that life,” Didi murmured.\u003c/p\u003e\n\u003cp\u003e“Any chance you can tell where they went?” Joe asked.\u003c/p\u003e\n\u003cp\u003eLeslie hesitated, then shook her head. “All I know is that they drove for a while before he drugged her. That’s what he did, he drugged her.”\u003c/p\u003e\n\u003cp\u003e“Drugged her or killed her?” Joe asked quietly.\u003c/p\u003e\n\u003cp\u003eLeslie frowned then. “I…”\u003c/p\u003e\n\u003cp\u003e“What?” Joe asked anxiously.\u003c/p\u003e\n\u003cp\u003e“Listen, I’m not a psychic. I really—” She broke off. No way was she ready to explain that her real talent lay in talking to ghosts.\u003c/p\u003e\n\u003cp\u003e“What were you going to say?” Joe demanded.\u003c/p\u003e\n\u003cp\u003eLeslie stared at him, letting out a long sigh. “I…don’t think she’s dead. She was abducted, she was drugged…but I don’t think she’s dead.”\u003c/p\u003e\n\u003cp\u003eJoe stared back at her. He didn’t seem to doubt her, didn’t question her. He looked thoughtful.\u003c/p\u003e\n\u003cp\u003e“I mean…I don’t know anything,” she said. “I just…I don’t know. I can’t help but think I would have…felt it if she’d died. I think she might be alive.”\u003c/p\u003e\n\u003cp\u003eJoe folded his arms over his chest. “Then it’s imperative that we find her. Quickly.”\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eI am with you. All is well….\u003c/p\u003e\n\u003cp\u003eLeslie didn’t fall asleep easily that night, despite her desire to dream. She lay awake for hours, certain that the answer was there, but seeing it was like finding the proverbial needle in a haystack, the haystack being New York with its millions of denizens, and the needle being a single woman who was there somewhere.\u003c/p\u003e\n\u003cp\u003eSo she had lain awake with the television on, keeping her company. Joe had somehow been loathe to leave her, despite the alarm system, and though she had absolutely insisted that he go home, she had the feeling he was sleeping in his car again. She should have suggested that he at least sleep in one of the other bedrooms, but she hadn’t been able to bring herself to make the offer.\u003c/p\u003e\n\u003cp\u003eShe wasn’t afraid of her dreams. Quite the opposite: she welcomed them. She argued with herself that she had to be alone, that Matt was trying to reach her, and the presence of any other human being might keep him away.\u003c/p\u003e\n\u003cp\u003eThat was true.\u003c/p\u003e\n\u003cp\u003eBut equally true was the fact that she couldn’t let go. Not yet…\u003c/p\u003e\n\u003cp\u003eAnd then, when she finally slept, he was there. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-31.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
