{"id":88460,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“It’s sad,” Laymon murmured. “The aunt—Eileen Brideswell—she’s a major contributor to the Historical Society.”\u003c/p\u003e\n\u003cp\u003e“I imagine she’s a major contributor to many charities,” Leslie said.\u003c/p\u003e\n\u003cp\u003eLaymon nodded, leaning back, crossing his arms over his chest. “Strange woman, Eileen. She still loves all the musty little pubs of her youth. But, I’ll tell you one thing. Genevieve O’Brien’s grandfather was a tough old hickory stick. He wouldn’t have approved much of Genevieve. He didn’t feel that a bum in the street—or a prostitute—should ever be helped with a red cent. He gave to charities, all right, but he picked them carefully. He wasn’t about to give a dime to anyone he felt wasn’t helping themselves. The old fellow is long dead and gone, or else I’d say there was a good chance he’d walled his own niece up somewhere himself.”\u003c/p\u003e\n\u003cp\u003e“But he is dead. Long dead, as you say,” Joe said.\u003c/p\u003e\n\u003cp\u003eLaymon shrugged. “Funny thing, I’d see the girl now and then. She loved to come and look at the house.”\u003c/p\u003e\n\u003cp\u003e“She appreciated history?” Brad said.\u003c/p\u003e\n\u003cp\u003e“I guess. But it was strange. She’d walk around and around it. It was as if…it was as if she wasn’t looking at the house, exactly, but at something more.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t she come to the gala?” Joe asked. “I mean, you knew her, knew she was interested in the place. You could have given her an invitation.”\u003c/p\u003e\n\u003cp\u003e“It never occurred to me,” Laymon said with a shrug. “All she had to do was ask her aunt if she wanted to go.”\u003c/p\u003e\n\u003cp\u003eBut she wouldn’t have done that, Joe thought.\u003c/p\u003e\n\u003cp\u003e“You don’t think Genevieve O’Brien blew the place up out of some kind of bitterness, do you?” Brad asked.\u003c/p\u003e\n\u003cp\u003e“No,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Then she must have known something about the house that intrigued her,” Leslie mused.\u003c/p\u003e\n\u003cp\u003e“Suspected, anyway,” Joe said.\u003c/p\u003e\n\u003cp\u003e“Don’t you think this is all getting a bit farfetched?” Laymon said. “The blast was over a year ago.” He looked at Joe. “Genevieve has been missing…what? About two months?”\u003c/p\u003e\n\u003cp\u003e“Right around that,” Joe agreed.\u003c/p\u003e\n\u003cp\u003e“Well, then, at least you can be pretty sure that no one was trying to blow her up,” Laymon said cheerfully. “She disappeared months later.”\u003c/p\u003e\n\u003cp\u003eHe realized they were all staring at him. “Sorry, but you three are the ones putting a lot of the truth of the matter that the blast was an accident. Some sicko is picking up hookers, and Genevieve just wound up in the mix. One day the bodies will turn up. Maybe they’ll get the guy, maybe they won’t. Sad, but that’s the way it is.”\u003c/p\u003e\n\u003cp\u003eJoe shook his head, staring at Laymon. “That’s the way it can be, but not this time. Trust me. This guy is going down.”\u003c/p\u003e\n\u003cp\u003eDinner had ended. Laymon offered to pick up the tab, and Joe let him. He thanked him for the meal, pulling back Leslie’s chair for her. “I’ll see you home.” He forced himself not to look at the other two men with real warning in his eyes. “And I’ll be on guard. All through the night.”\u003c/p\u003e\n\u003cp\u003eLeslie felt guilty. Horribly guilty.\u003c/p\u003e\n\u003cp\u003eJoe would sit in his car all night again. She knew it.\u003c/p\u003e\n\u003cp\u003eBut she just couldn’t ask him into the house for the night. Not yet.\u003c/p\u003e\n\u003cp\u003eShe tried to talk him into going home, and he assured her that he would do so in the morning, when Hastings House was filled with people, when the bones in the basement were being gently removed—when she wouldn’t be alone with anyone. He made her swear to that last point.\u003c/p\u003e\n\u003cp\u003eIf he thought she should have the decency to suggest that he sleep in the house, he didn’t say so. It wasn’t that there wasn’t something about him, his touch, his scent, the sound of his voice.\u003c/p\u003e\n\u003cp\u003eThere were just…things that needed to be solved. Leslie couldn’t begin to voice what was going on in her heart and mind, and she was grateful that he didn’t seem to expect her to.\u003c/p\u003e\n\u003cp\u003eBefore he left her to return to his car, however, he asked her to look around for the list that Greta was supposed to have sent over that day. She found it on the kitchen counter and gave it to him. He told her not only to key in the alarm, but to lock her bedroom door, as well.\u003c/p\u003e\n\u003cp\u003eAt the very least, she could do that for him. Upstairs, she locked herself in her bedroom and went to bed.\u003c/p\u003e\n\u003cp\u003eAs usual, she lay awake, longing for something real. Longing to see Matt…\u003c/p\u003e\n\u003cp\u003eAs she saw so many others.\u003c/p\u003e\n\u003cp\u003eBut he didn’t appear.\u003c/p\u003e\n\u003cp\u003eNot until she dreamed.\u003c/p\u003e\n\u003cp\u003eThat night, he lay by her side, watching her. In her dream, she opened her eyes and saw him. His expression was grave. Only the slightest hint of a rueful smile curled his lips. He stroked her cheek, curled his fingers around hers.\u003c/p\u003e\n\u003cp\u003e“You were there, in the subway,” she told him. “You saved me.”\u003c/p\u003e\n\u003cp\u003e“Joe pulled you out.”\u003c/p\u003e\n\u003cp\u003e“But you gave me the strength I needed to move, to save myself. And both of you were pretty fierce in that basement tonight.”\u003c/p\u003e\n\u003cp\u003eMatt pressed a kiss against her fingers. “I keep trying…. I guess it takes time and practice, and then…maybe the heart or the soul or essence or whatever we are…maybe there are fragments of this being that have life of a sort. I can only find anything real in me when it comes to you, when I’m afraid for you. Leslie, I really want you to leave this house.”\u003c/p\u003e\n\u003cp\u003e“I will. Soon.”\u003c/p\u003e\n\u003cp\u003eHis smile broadened. “Joe was right. You are a little liar.”\u003c/p\u003e\n\u003cp\u003e“Matt…I can’t live without knowing the truth.”\u003c/p\u003e\n\u003cp\u003e“I just hope you can live with it,” he murmured, then shook his head, his expression growing pained. “Leslie…I love you. You have to move on.”\u003c/p\u003e\n\u003cp\u003e“But I have my dreams. We have my dreams.”\u003c/p\u003e\n\u003cp\u003e“Leslie, I had my time. No one knows the rhyme or reason. No one knows…well, except maybe me, now.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“I know that I’m here for you,” he said.\u003c/p\u003e\n\u003cp\u003e“Poor Brad,” she told him with amusement. “You made him trip, didn’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid of all of them,” he said.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eHe was quiet. She thought that she had lost him, except she still felt his arms around her. “Say they were after me when they set the explosion and just didn’t care that three other people died.” There was anger in his voice, anger that others might have died because of him. “Say that it did have to do with my writing about the prostitutes. That would mean that, whoever the killer is, the abductor…”\u003c/p\u003e\n\u003cp\u003e“Do you know if the girls are dead?”\u003c/p\u003e\n\u003cp\u003e“No, but…say there is something out there, very clever, obviously sick, a pervert, but a clever one…then I’d say that person was here that night.”\u003c/p\u003e\n\u003cp\u003e“Matt, so many people were here that night.”\u003c/p\u003e\n\u003cp\u003e“The killer is hardly going to be a Broadway star,” he murmured.\u003c/p\u003e\n\u003cp\u003e“Well, unlikely, but—”\u003c/p\u003e\n\u003cp\u003e“Who’s still in this vicinity on a regular basis? Who knows the area? David Laymon, Brad Vernon—”\u003c/p\u003e\n\u003cp\u003e“Brad’s been in Virginia until now,” she reminded him.\u003c/p\u003e\n\u003cp\u003e“Is that really so far away?” he queried. “Four or five hours by car, less by plane.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe—”\u003c/p\u003e\n\u003cp\u003e“But you were afraid of him this afternoon, weren’t you? And I’m not saying it’s Brad. There’s Greta, but she would die before doing anything to hurt this place, and anyway, it’s not a woman taking the prostitutes.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“Something would have been said, someone would have noticed. That kind of thing…the girls on the street, the other girls, would have taken a closer look if it had been a woman. The place was teeming with cops, including our good friend Robert Adair, and the ever-in-front-of-the-camera Ken Dryer. And then there’s Hank Smith.”\u003c/p\u003e\n\u003cp\u003eHe really didn’t like Hank Smith, she thought, burrowing deeper into his arms.\u003c/p\u003e\n\u003cp\u003e“Did you ever meet Genevieve O’Brien?” she asked sleepily.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Is she everything they say? Passionate, selfless, generous?”\u003c/p\u003e\n\u003cp\u003e“I met her at the paper once. She was being interviewed by one of our reporters for the local section—she was furious with the slumlords. She was lovely, vivacious, charming…and, yes, passionate. She really did care about other people. You think she’s alive, don’t you?”\u003c/p\u003e\n\u003cp\u003e“I do.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” he murmured. She heard such a terrible note of frustration in his voice. If I could just change something, she heard beneath his words. If I could just make life right for someone else, then…then it would make sense.\u003c/p\u003e\n\u003cp\u003eShe turned and held him fiercely. “I love you so much.”\u003c/p\u003e\n\u003cp\u003eHe was quiet.\u003c/p\u003e\n\u003cp\u003e“Don’t go,” she pleaded, then spoke no more. She didn’t want to awaken; she didn’t want to interrupt the vision that came to her by night.\u003c/p\u003e\n\u003cp\u003eIn her dream, she drifted and, half asleep, felt him again. She turned in his arms. God, the dream was so vivid. She could feel his heat, the dampness of sweat on his skin, the strength of his muscles beneath her hands, the hardness of his body and his erection. The hot-lava stroke of his tongue over her flesh. Inside and out…his being, his essence, around her, within her. Lips on her breasts, intimately between her thighs. The pulse and beat and hunger of melding together, striving and writhing…climbing, rising, exploding into the moment of climax with a strange mixture of tenderness and violence, all so vividly real…\u003c/p\u003e\n\u003cp\u003eShe felt his touch on her hair, his cheek against hers. “Leslie, I’m afraid for you. I try, and sometimes, I find the strength to actually touch this world. But then I’m drained and you’re alone, and I’m so afraid for you….”\u003c/p\u003e\n\u003cp\u003e“It’s all right,” she assured him, then cuddled close and fell asleep in his arms.\u003c/p\u003e\n\u003cp\u003eShe awoke suddenly, certain she could hear the sound of sobs coming from below, from the basement below the dead room. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-40.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
