{"id":88461,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e14\u003c/p\u003e\n\u003cp\u003eA lone and awake in his car, parked just far enough away not to be conspicuous, Joe read over the list. He wished he’d been there that night, and he tried to envision the scene in his mind’s eye.\u003c/p\u003e\n\u003cp\u003eHe kept coming back to a place where he froze, afraid.\u003c/p\u003e\n\u003cp\u003eFor Leslie.\u003c/p\u003e\n\u003cp\u003eAccident in the crypt, accident in the subway…accident in this house?\u003c/p\u003e\n\u003cp\u003eLike hell.\u003c/p\u003e\n\u003cp\u003eSo if the first two weren’t accidents and everything was connected, then he needed to look at the people around them now and compare those names to the list from the night of the gala. Professor Laymon? Absurd. He had no interest in anything but his work. Still, tomorrow he would assure himself that Laymon had been at the site all day.\u003c/p\u003e\n\u003cp\u003eBrad? But why?\u003c/p\u003e\n\u003cp\u003eJealousy?\u003c/p\u003e\n\u003cp\u003eRobert Adair had been the one to put him on the case, which seemed to rule him out. Hank Smith? He hated the guy, but that was no reason to suspect him.\u003c/p\u003e\n\u003cp\u003eAnd no reason not to.\u003c/p\u003e\n\u003cp\u003eWas Genevieve the connecting factor?\u003c/p\u003e\n\u003cp\u003eOr was it Leslie herself? What if someone had actually been trying to kill Leslie, not Matt?\u003c/p\u003e\n\u003cp\u003eIt made no sense. But the idea continued to plague him.\u003c/p\u003e\n\u003cp\u003eWhat about Ken Dryer? He was at the site far more often than a police spokesman needed to be, even with Laymon making demands and everyone trying to bow to his wishes, since the women behind him and the Historical Society were some of the wealthiest in the state.\u003c/p\u003e\n\u003cp\u003eHank Smith. Ken Dryer. Brad Verdun. Laymon. Robert Adair. They’d all been at the gala. and now they were all revolving in the same social circle again.\u003c/p\u003e\n\u003cp\u003eHe set down his list, startled, as he saw lights go on in the house. He sat for a moment, then hurriedly turned off his dome light and exited his car. As he did so, he noticed something that he hadn’t seen before.\u003c/p\u003e\n\u003cp\u003eA man.\u003c/p\u003e\n\u003cp\u003eHe had blended with a lamppost at first. But now, with the car light off…\u003c/p\u003e\n\u003cp\u003eThe guy had been standing there all along, watching the house.\u003c/p\u003e\n\u003cp\u003eHe’d thought himself completely hidden. Maybe he’d seen the lights go on, too, and shifted his position, the movement attracting Joe’s attention.\u003c/p\u003e\n\u003cp\u003eJoe raced toward the lamppost, but the man heard him coming and shot down the street like greased lightning. Joe could run, but the guy had a head start on him. Joe chased him down one street, around the block and toward the site, where he saw a uniformed cop striding along the fence.\u003c/p\u003e\n\u003cp\u003e“Hey!” he called out.\u003c/p\u003e\n\u003cp\u003e“Yes?” the officer said, watching calmly as Joe headed toward him.\u003c/p\u003e\n\u003cp\u003e“I just chased a guy around this way. Did you see him? Did you see anyone running?”\u003c/p\u003e\n\u003cp\u003eThe officer looked him up and down. “I didn’t see anyone running, but who are you? And what are you doing chasing people at this time of night?”\u003c/p\u003e\n\u003cp\u003eJoe produced his ID.\u003c/p\u003e\n\u003cp\u003e“Oh, hell, you’re him.”\u003c/p\u003e\n\u003cp\u003e“Yeah, Matt Connolly’s cousin.”\u003c/p\u003e\n\u003cp\u003e“Huh?” The guy looked confused. “I just saw your picture with a story about a sting in Vegas. Good work.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Are you sure you didn’t see anything?”\u003c/p\u003e\n\u003cp\u003e“Mr. Connolly, I swear to you, no one went by here.”\u003c/p\u003e\n\u003cp\u003e“All right, thanks. Keep an eye out for anything suspicious, will you?”\u003c/p\u003e\n\u003cp\u003e“That’s what they pay me to do.”\u003c/p\u003e\n\u003cp\u003eJoe just nodded. He’d lost the guy, plain and simple, and he was irritated with himself. He was also growing alarmed. He’d left the house. He’d left Leslie.\u003c/p\u003e\n\u003cp\u003eHe turned and headed back toward the house, running full speed as soon as he was out of the cop’s sight. As he ran, he blessed whatever random bit of luck had caused Leslie to give him the alarm code that day.\u003c/p\u003e\n\u003cp\u003eAs soon as he reached the door, he punched it in quickly, terrified of what he might find on the other side.\u003c/p\u003e\n\u003cp\u003eThere were no doubt plenty of people who would certify her as stark raving mad without question. She was in a reputedly haunted house, all alone, in the dead of night. And she wasn’t content to stay safely in her room.\u003c/p\u003e\n\u003cp\u003eNo, she just had to head down to the basement, where there were still bones interred in the wall.\u003c/p\u003e\n\u003cp\u003eWide awake, wearing slippers and a robe, she took one of the lanterns from the kitchen table and went back to the servants’ pantry. She lifted the braid rug, then the hatch door.\u003c/p\u003e\n\u003cp\u003eFor a moment, even she hesitated. The stairs looked as if they led to a giant and eternal black abyss.\u003c/p\u003e\n\u003cp\u003eBut she was certain that she had heard sobbing, a sobbing that tore at her heart.\u003c/p\u003e\n\u003cp\u003eShe held the lantern out before her and started down the steps. The room began to fill with a diffuse light as she approached the bottom of the steps.\u003c/p\u003e\n\u003cp\u003eShe could see Elizabeth’s bones in the wall, but they didn’t frighten her at all. She knew in her heart that she was doing everything she could for Elizabeth.\u003c/p\u003e\n\u003cp\u003eShe wasn’t afraid of ghosts, she realized.\u003c/p\u003e\n\u003cp\u003eShe was afraid of the living.\u003c/p\u003e\n\u003cp\u003eShe reached the bottom of the steps and walked into the center of the room. There was silence for the longest time, but then she heard it again. Sobbing. But try as she might, she couldn’t ascertain where it was coming from. The sound faded before she could figure it out.\u003c/p\u003e\n\u003cp\u003eThen, to her astonishment, she heard something else. Footsteps, then two bangs. A door being opened and closed?\u003c/p\u003e\n\u003cp\u003eAnd then…\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eShe waited, not breathing. But still, she could hear nothing at all.\u003c/p\u003e\n\u003cp\u003eElizabeth’s empty-eyed skull stared at her in the strange lamplight.\u003c/p\u003e\n\u003cp\u003eThen she heard footsteps above her and froze.\u003c/p\u003e\n\u003cp\u003e“Leslie?”\u003c/p\u003e\n\u003cp\u003eShe exhaled at last. It was Joe.\u003c/p\u003e\n\u003cp\u003e“Down here!” she called to him.\u003c/p\u003e\n\u003cp\u003e“You’re back in the basement?” He sound incredulous. In a moment, he joined her.\u003c/p\u003e\n\u003cp\u003e“Joe, what are you doing here?” she asked, trembling.\u003c/p\u003e\n\u003cp\u003e“I saw the lights go on.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “God, I’m sorry. I never meant to alarm you.”\u003c/p\u003e\n\u003cp\u003e“What are you doing in the basement—now?”\u003c/p\u003e\n\u003cp\u003e“I heard crying.”\u003c/p\u003e\n\u003cp\u003e“Crying?”\u003c/p\u003e\n\u003cp\u003eShe opened her mouth, suddenly not knowing what to say. She didn’t want him to know that she was convinced she was hearing the heartfelt sobs of a ghost. He was beginning to trust in her, but…\u003c/p\u003e\n\u003cp\u003e“I thought I heard something.”\u003c/p\u003e\n\u003cp\u003e“So you came down here alone?” His tone was harsh, but he seemed to be trembling a little himself.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“What the hell am I going to do with you?” he demanded. He walked forward, grabbed her shoulders and pulled her against his chest. “What am I going to do?”\u003c/p\u003e\n\u003cp\u003e“Joe, it’s okay. You can’t get to the basement except through the house.”\u003c/p\u003e\n\u003cp\u003eHe was silent.\u003c/p\u003e\n\u003cp\u003e“Joe?” She pulled slightly away.\u003c/p\u003e\n\u003cp\u003eHe looked down at her. “Leslie, someone was out there watching the house,” he told her.\u003c/p\u003e\n\u003cp\u003eShe looked up at him in alarm.\u003c/p\u003e\n\u003cp\u003e“I chased him, but he got away.”\u003c/p\u003e\n\u003cp\u003e“Who was it?”\u003c/p\u003e\n\u003cp\u003e“If I knew, I’d have every cop in the city on his tail.”\u003c/p\u003e\n\u003cp\u003eShe had to smile at that. “Joe, I’m not sure we can have someone arrested for watching the house.”\u003c/p\u003e\n\u003cp\u003e“Let’s get out of here, shall we?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded, heading up the stairs, with him in her wake. There was no sense in trying to get him to stay down there with her. Whatever she had been hearing, it had stopped, at least for now.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to stay in the servants’ pantry, either. She quickly walked back into the main kitchen. Joe followed her.\u003c/p\u003e\n\u003cp\u003e“What time is it, anyway?” she asked. “Honestly, I’m so sorry. You’re sleeping in your car to begin with, and then this. You must think I’m trying to torture you.”\u003c/p\u003e\n\u003cp\u003e“It’s okay.”\u003c/p\u003e\n\u003cp\u003e“Actually, it’s not,” she murmured. “It’s five…pretty early, huh?” It was, and she was exhausted.\u003c/p\u003e\n\u003cp\u003e“Joe, there’s another room upstairs that they keep for the Historical Society workers—it doesn’t open to the public. It’s all made up. Why don’t you try to grab a few hours’ sleep? I’ll do the same.”\u003c/p\u003e\n\u003cp\u003eHe arched a brow. “You’re sure?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She smiled. “I promise I won’t run out on you.”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “All right. I guess it’s going to be a long day tomorrow. Today. Whatever.”\u003c/p\u003e\n\u003cp\u003eHe followed her up to the second level, where she pointed out the door to the extra bedroom. He nodded, a smile on his lips. “Good night. And lock your door.”\u003c/p\u003e\n\u003cp\u003e“But you’re here now.”\u003c/p\u003e\n\u003cp\u003e“Precisely,” he teased. Then, “Seriously, lock your bedroom door whenever you go to sleep, okay? Please.”\u003c/p\u003e\n\u003cp\u003e“All right,” she agreed. “Good night.”\u003c/p\u003e\n\u003cp\u003e“Good night.”\u003c/p\u003e\n\u003cp\u003eThey went into their separate rooms. Leslie didn’t think she would be able to sleep. Then she prayed that she would.\u003c/p\u003e\n\u003cp\u003eShe did.\u003c/p\u003e\n\u003cp\u003eSadly, she didn’t dream. And she only woke up a few hours later because the morning light was streaming in on her face and there was activity below.\u003c/p\u003e\n\u003cp\u003eShe flew out of bed. Wrapped in her robe, barefoot, she walked out to the landing. Melissa was there, along with Professor Laymon, Brad and several grad students walking in carrying wooden crates.\u003c/p\u003e\n\u003cp\u003e“Hey there, sleepyhead,” Brad called up at her cheerfully.\u003c/p\u003e\n\u003cp\u003e“I’ll be right down.”\u003c/p\u003e\n\u003cp\u003e“Good morning,” Melissa said. She winked, then hurried halfway up the stairs as the others returned to the task of taking equipment toward the back of the house. “He’s gone,” she whispered.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eMelissa winked again. “Don’t worry—your secret is safe with me. I looked for his car, and he’s gone.”\u003c/p\u003e\n\u003cp\u003e“Oh…you mean Joe?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Melissa, he was in the extra bedroom.”\u003c/p\u003e\n\u003cp\u003e“Sure. But it’s okay. My lips are sealed, I swear.” She mimed zipping her lips.\u003c/p\u003e\n\u003cp\u003eLeslie rolled her eyes, then headed back to her room to shower and dress.\u003c/p\u003e\n\u003cp\u003eBy the time she headed downstairs, she was greeted by an astounding surprise. For a moment she couldn’t imagine who the tall white-haired man and slim blond woman talking to Professor Laymon might be. Then, while she was still halfway up the stairs, she recognized them. “Adam! Nikki!” she cried with pleasure. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-41.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
