{"id":88464,"no":44,"title":"Page 44","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“There’s a Civil War soldier in the entry, too,” Nikki said.\u003c/p\u003e\n\u003cp\u003e“You’ve seen him?” Leslie asked.\u003c/p\u003e\n\u003cp\u003e“Briefly. He seemed like quite the gentleman,” Nikki informed her.\u003c/p\u003e\n\u003cp\u003e“Really? I would love to meet him,” Leslie said.\u003c/p\u003e\n\u003cp\u003eNikki smiled. “I’ve been at this a little longer than you. The first time I realized I was actually seeing a ghost…I thought I’d die of shock.”\u003c/p\u003e\n\u003cp\u003e“I pretty much thought I should be locked up,” Leslie murmured. “Except that…well, I think I was with Matt. That I almost stayed with him.”\u003c/p\u003e\n\u003cp\u003e“That was when you really had to admit that you see what other’s can’t,” Adam said gently. “What even I can’t,” he added wistfully.\u003c/p\u003e\n\u003cp\u003eNikki set a hand on Leslie’s arm. “Should you really be staying at that house alone?” she asked.\u003c/p\u003e\n\u003cp\u003e“Wild horses wouldn’t drag me out of it,” Leslie said. “And last night Joe stayed in the extra room. It was just for the one night, but I can ask him to stay from now on. You know…you guys should stay tonight. Please? You may…see something I can’t. I guess you checked into a hotel, but…”\u003c/p\u003e\n\u003cp\u003eAdam waved a dismissive hand. “We can check out.”\u003c/p\u003e\n\u003cp\u003e“There’s also something I’d love your help with tomorrow if you have time before your flights,” she said. She went on to describe the little girl at the dig. “Her name is Mary, but I don’t know her last name, and there are so many Marys listed in the church register. I haven’t seen her again, but I feel that it’s urgent to reunite her with her mother.”\u003c/p\u003e\n\u003cp\u003e“I’ll do my best,” Nikki told her. “I wish Brent was here.”\u003c/p\u003e\n\u003cp\u003e“You and Leslie can fix things,” Adam said reassuringly.\u003c/p\u003e\n\u003cp\u003eLeslie started to speak, but then she realized that she’d been staring at a woman sitting alone in a booth across the room from them. Apparently the waitresses all knew her. Whenever they stopped by to refill her coffee cup, they all had something to say.\u003c/p\u003e\n\u003cp\u003e“Do you see someone you know? Have you been here before?” Nikki asked her.\u003c/p\u003e\n\u003cp\u003e“No. And, yes. I came here once with Matt.”\u003c/p\u003e\n\u003cp\u003eNikki and Adam subtly checked out the woman Leslie had been studying. “That’s Eileen Brideswell,” he said.\u003c/p\u003e\n\u003cp\u003e“Of course,” Leslie murmured, wondering why she hadn’t recognized the woman. Not only had she seen her before, she’d even met her. Eileen Brideswell had been at the Hastings House gala the night of the explosion.\u003c/p\u003e\n\u003cp\u003eShe looked exceedingly sad, though she tried to smile when waitresses talked to her. As soon as they left, though, the smile faded.\u003c/p\u003e\n\u003cp\u003e“You know her?” Leslie asked Adam.\u003c/p\u003e\n\u003cp\u003e“I’ve met her over the years. In fact, excuse me, if you will.”\u003c/p\u003e\n\u003cp\u003eHe left them, joining Eileen, who brightened at his appearance. He sat down opposite her, and they began to talk.\u003c/p\u003e\n\u003cp\u003eLeslie looked at Nikki. “I think I really am going crazy.”\u003c/p\u003e\n\u003cp\u003e“We’ve all felt that way,” Nikki assured her.\u003c/p\u003e\n\u003cp\u003e“It’s not that I’m seeing ghosts. It’s…” She hesitated. “I’m sorry, I love Adam like a father, but I couldn’t talk about this in front of him. Nikki, Matt doesn’t just talk to me in my dreams. It’s as if we’re together again. Nikki, I’m having this wild sex life…with a ghost.”\u003c/p\u003e\n\u003cp\u003eNikki twirled her swizzle stick in her Irish coffee. Then she looked at Leslie. “We see ghosts,” she said softly. “Do we really know anything about them? No. Josh, Adam’s son…you know he died at eighteen. He immediately appeared to his best friend, who told Adam. And even though Adam can’t see him, Josh often travels with him, and he speaks to a lot of people. I think maybe being a ghost is…well, not that different from being alive, in a way. If we’re energy, then for a ghost, that energy remains and is like a brand-new life. Perhaps most people do just go on to whatever the afterlife is. But some stay for months or years, even centuries, because they feel they have to remain on earth for some reason, that they have a function here. So take a man like Matt. From what you’ve told me, he was someone who believed in what he could see and touch. So I bet it’s difficult for him to learn the ropes, so to speak. Even more difficult than it is for most ghosts. Maybe he figured out how to enter your dreams, while it’s still difficult for him to…well, materialize, for want of a better word.”\u003c/p\u003e\n\u003cp\u003e“So…when I see him in my dreams, it may not just be what I want more than anything in the world?” Leslie asked.\u003c/p\u003e\n\u003cp\u003e“I wish I had all the answers, but I don’t.” She smiled. “I could be way off. Like I said, none of us has all the answers, and we’re all surprised on a daily basis. But think about all the examples of ESP you’ve heard about. A mother knowing when her child is in danger. A wife knowing suddenly that her husband has been killed. Maybe, living or dead, we all have the power to connect with that energy somehow. We just have to learn to use it. Maybe, sometimes, people live when they should have died, and maybe, sometimes, people have died when they should have lived, but there’s still a trail of communication. You and I both know other people who see ghosts, but think about it—this is New York, home to millions of people. And how many of those do you think see ghosts? Then again, ghosts can come in different ways. I had a friend who lost her dad when she was really young, and it nearly destroyed her. Then she had a dream about him, and he kept telling her how well he was doing, and how she needed to be happy, move on. And after that, she felt the pain, but she…adjusted, I guess. Who’s to say she didn’t see a ghost, that her dad didn’t find a way to make life livable again for her?”\u003c/p\u003e\n\u003cp\u003e“Actually, that’s a nice thought,” Leslie murmured. “I just wish I knew what to do from here.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure exactly how you mean that, but I don’t think you can do anything, not emotionally, until…well, until whatever is going on is solved. I think Adam is about to cancel his trip to stay with you. He’s worried.”\u003c/p\u003e\n\u003cp\u003e“I’m all right.”\u003c/p\u003e\n\u003cp\u003e“That incident in the crypt? That fall in the subway? Do you really think those were accidents?”\u003c/p\u003e\n\u003cp\u003e“But I’ll be careful now,” Leslie vowed. “And I’ll have Joe stay at Hastings House.” She hesitated. “Nikki, I’m certain that I’m on to something. I keep thinking about tunnels.”\u003c/p\u003e\n\u003cp\u003e“And have you found a tunnel—or a solution?”\u003c/p\u003e\n\u003cp\u003e“No, not yet.”\u003c/p\u003e\n\u003cp\u003eNikki studied her. “Leslie, Adam and I think you’re in danger.”\u003c/p\u003e\n\u003cp\u003e“I’m around people all day, and Joe is around, too, even at night. Just not exactly with me.”\u003c/p\u003e\n\u003cp\u003eNikki lowered her head, then looked up at her again, a twinkle in her eye. “Face it. You don’t want Joe to stay—even though I can tell you really like him, because you’re afraid that if he’s there, Matt won’t show up.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Leslie admitted.\u003c/p\u003e\n\u003cp\u003eNikki squeezed her hand. “Matt loved and trusted you. He trusted and loved his cousin. I’m willing to bet Matt would be a happier man if he knew you were safe.”\u003c/p\u003e\n\u003cp\u003eLeslie’s cell phone suddenly started ringing. Saved by the bell, she thought wryly, and excused herself to answer it, knowing from caller ID that it was Joe.\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“O’Malley’s.”\u003c/p\u003e\n\u003cp\u003e“Who are you with?” He sounded tense.\u003c/p\u003e\n\u003cp\u003e“Adam and Nikki. Why? What is it?”\u003c/p\u003e\n\u003cp\u003e“I’m on my way,” Joe said, and hung up. She closed her phone just as Nikki came back to their booth, leading Eileen Brideswell.\u003c/p\u003e\n\u003cp\u003e“Hello,” Eileen said shyly.\u003c/p\u003e\n\u003cp\u003e“Mrs. Brideswell, how are you?” Leslie asked. Bad question. The woman obviously wasn’t doing well. But it was the polite thing to say.\u003c/p\u003e\n\u003cp\u003e“I gather you’ve met Leslie MacIntyre, Eileen,” Adam said.\u003c/p\u003e\n\u003cp\u003e“Of course,” Eileen replied, smiling.\u003c/p\u003e\n\u003cp\u003e“And this is my colleague, Nikki Blackhawk,” Adam continued.\u003c/p\u003e\n\u003cp\u003e“How do you do,” Nikki said, smiling warmly.\u003c/p\u003e\n\u003cp\u003e“Thank you for inviting me to join you,” Eileen said. The words were sincere. Given her power and position, Eileen could have dinner with the city’s most elite residents, but Leslie thought she understood the other woman. She didn’t want to be surrounded by the wealthy and powerful, forced to smile and nod and talk about the important events of the day. She wanted to be alone with her thoughts. But joining them was different.\u003c/p\u003e\n\u003cp\u003e“I think we share a friend,” Eileen said, sliding into the booth across from Leslie.\u003c/p\u003e\n\u003cp\u003e“Joe? I know he’s working for you,” Leslie said.\u003c/p\u003e\n\u003cp\u003eEileen nodded.\u003c/p\u003e\n\u003cp\u003e“He will find out what happened to Genevieve, you know.” Leslie reached across the table and laid her hand over Eileen’s in a gesture of assurance as she spoke.\u003c/p\u003e\n\u003cp\u003eShe wasn’t prepared for what happened next.\u003c/p\u003e\n\u003cp\u003eHer vision seemed to disappear, not in darkness, but in a flash of light. She didn’t see Eileen’s inner soul or her past; she saw Genevieve.\u003c/p\u003e\n\u003cp\u003eThe other woman was standing in a black abyss, and it was damp and cold.\u003c/p\u003e\n\u003cp\u003eLike a grave.\u003c/p\u003e\n\u003cp\u003eBut she wasn’t dead.\u003c/p\u003e\n\u003cp\u003eHer hair was twisted away from her face, knotted at her nape. She was thin and haggard-looking, but she was at work, her hands busy as she tore at something unseen. She worked and worked and worked….\u003c/p\u003e\n\u003cp\u003eAnd then gave way to exhaustion, falling to her knees, sobbing.\u003c/p\u003e\n\u003cp\u003eLeslie drew her hand back as the vision faded to total blackness.\u003c/p\u003e\n\u003cp\u003e“Are you all right, dear?” Eileen Brideswell asked. “You look as if you’ve seen a ghost.”\u003c/p\u003e\n\u003cp\u003eLeslie forced a smile. Not a ghost. A living woman. Genevieve.\u003c/p\u003e\n\u003cp\u003eShe couldn’t say that. Eileen would think that she was insane. Worse. That she was offering her false hope, playing on her emotions.\u003c/p\u003e\n\u003cp\u003e“I’m fine. Sorry.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should see a doctor,” Eileen said. “I saw on the news that you were in an accident at the dig when the roof gave way, and then I heard about that dreadful incident on the subway.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dead-room-harrison-investigation-4/page-44.html","bookId":2270,"creation":"Oct 5, 2019 5:29:33 PM","modification":"Oct 5, 2019 5:29:33 PM"}
