{"id":96561,"no":102,"title":"Page 102","content":"\u003cp\u003e\"So,\" she asks. \"Are you seeing anyone?\"\u003c/p\u003e\n\u003cp\u003e\"My life is essentially uncomplicated,\" I say thoughtfully, caught off guard.\u003c/p\u003e\n\u003cp\u003e\"What does that mean?\" she asks.\u003c/p\u003e\n\u003cp\u003eI take a sip of cognac and smile secretly to myself, teasing her, dashing her hopes, her dreams of being reunited.\u003c/p\u003e\n\u003cp\u003e\"Are you seeing anyone, Patrick?\" she asks. \"Come on, tell me.\u0027\u003c/p\u003e\n\u003cp\u003eThinking of Evelyn, I murmur to myself, \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\" I hear her ask.\u003c/p\u003e\n\u003cp\u003e\"A very large bottle of Desyrel,\" I say in a faraway voice, suddenly very sad.\u003c/p\u003e\n\u003cp\u003e\"What?\" she asks, smiling, but then she realizes something and shakes her head. \"I shouldn\u0027t be drinking.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not really,\" I say, snapping out of it, then, not of my own accord, \"I mean, does anyone really see anyone? Does anyone really see anyone else? Did you ever see me? See? What does that mean? Ha! See? Ha! I just don\u0027t get it. Ha!\" I laugh.\u003c/p\u003e\n\u003cp\u003eAfter taking this in, she says, nodding; \"That has a certain kind of tangled logic to it, I suppose.\"\u003c/p\u003e\n\u003cp\u003eAnother long pause and I fearfully ask the next question. \"Well, are you seeing anyone?\"\u003c/p\u003e\n\u003cp\u003eShe smiles, pleased with herself, and still looking down, admits, with incomparable clarity, \"Well, yes, I have a boyfriend and - \"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" She looks up.\u003c/p\u003e\n\u003cp\u003e\"Who is he? What\u0027s his name?\"\u003c/p\u003e\n\u003cp\u003e\"Robert Hall. Why?\"\u003c/p\u003e\n\u003cp\u003e\"With Salomon Brothers?\"\u003c/p\u003e\n\u003cp\u003e\"No, he\u0027s a chef.\"\u003c/p\u003e\n\u003cp\u003e\"With Salomon Brothers?\"\u003c/p\u003e\n\u003cp\u003e\"Patrick, he\u0027s a chef. And co-owner of a restaurant.\"\u003c/p\u003e\n\u003cp\u003e\"Which one?\"\u003c/p\u003e\n\u003cp\u003e\"Does it matter?\"\u003c/p\u003e\n\u003cp\u003e\"No, really, which one?\" I ask, then under my breath, \"I want to cross it out of my Zagat guide.\"\u003c/p\u003e\n\u003cp\u003e\"Its called Dorsia,\" she says, then, \"Patrick, are you okay?\"\u003c/p\u003e\n\u003cp\u003eYes, my brain does explode and my stomach bursts open inwardly - a spastic, acidic, gastric reaction; stars and planets, whole galaxies made up entirely of little white chef hats, race over the film of my vision. I choke out another question.\u003c/p\u003e\n\u003cp\u003e\"Why Robert Hall?\" I ask. \"Why him?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t know,\" she says, sounding a little tipsy. \"I guess it has to do with being twenty-seven and - \"\u003c/p\u003e\n\u003cp\u003e\"Yeah? So am I. So is half of Manhattan. So what? That\u0027s no excuse to marry Robert Hall.\"\u003c/p\u003e\n\u003cp\u003e\"Marry?\" she asks, wide-eyed, defensive. \"Did I say that?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you say marry?\"\u003c/p\u003e\n\u003cp\u003e\"No, I didn\u0027t, but who knows.\" She shrugs. \"We might.\"\u003c/p\u003e\n\u003cp\u003e\"Ter-rific.\"\u003c/p\u003e\n\u003cp\u003e\"As I was saying, Patrick\" - she glares at me, but in a playful way that makes me sick - \"I think.you know that, well, time is running out. That biological clock just won\u0027t stop ticking,\" she says, and I\u0027m thinking: My god, it took only two glasses of chardonnay to get her to admit this? Christ, what a lightweight. \"I want to have children.\"\u003c/p\u003e\n\u003cp\u003e\"With Robert Hall?\" I ask, incredulous. \"You might as well do it with Captain Lou Albano, for Christ sakes. I just don\u0027t get you. Bethany.\"\u003c/p\u003e\n\u003cp\u003eShe touches her napkin, looking down and then out onto the sidewalk, where waiters are setting up tables for dinner. I watch them too. \"Why do I sense hostility on your part, Patrick?\" she asks softly, then sips her wine.\u003c/p\u003e\n\u003cp\u003e\"Maybe because I\u0027m hostile,\" I spit out. \"Maybe because you sense this.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus, Patrick,\" she says, searching my face, genuinely upset. \"I thought you and Robert were friends.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I ask. \"I\u0027m confused.\"\u003c/p\u003e\n\u003cp\u003e\"Weren\u0027t you and Robert friends?\"\u003c/p\u003e\n\u003cp\u003eI pause, doubtful. \"Were we?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Patrick, you were.\"\u003c/p\u003e\n\u003cp\u003e\"Robert Hall, Robert Hall, Robert Hall,\" I mutter to myself, trying to remember. \"Scholarship student? President of our senior class?\" I think about it a second longer, then add, \"Weak chin?\"\u003c/p\u003e\n\u003cp\u003e\"No, Patrick,\" she says. \"The other Robert Hall.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m confusing him with the other Robert Hall?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Yes, Patrick,\" she says, exasperated.\u003c/p\u003e\n\u003cp\u003eInwardly cringing, I close my eyes and sigh. \"Robert Hall. Not the one whose parents own half of, like, Washington? Not the one who was\" - I gulp - \"captain of the crew team? Six feet?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she says. \"That Robert Hall.\"\u003c/p\u003e\n\u003cp\u003e\"But...\" I stop.\u003c/p\u003e\n\u003cp\u003e\"Yes? But what? \" She seems prepared to wait for an answer. \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-102.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
