{"id":96572,"no":113,"title":"Page 113","content":"\u003cp\u003e\"Arcadia was an ancient region in Peloponnesus, Greece; which was founded in 370 Bs.C., and it was completely surrounded by mountains. Its chief city was... Megalopolis, which was also the center of political activity and the capital of the Arcadian confederacy...\" I take a sip of the port, which is thick, strong, expensive. \"It was destroyed during the Greek war of independence...\" I pause again. \"Pan was worshiped originally in Arcadia. Do you know who Pan was?\"\u003c/p\u003e\n\u003cp\u003eNever taking her eyes off me, she nods.\u003c/p\u003e\n\u003cp\u003e\"His revels were very similar to those of Bacchus,\" I tell her. \"He frolicked with nymphs at night but he also liked to... frighten travelers during the day... Hence the word pan-ic.\" Blah blah blah. I\u0027m amused that I\u0027ve retained this knowledge and I look up from the port I\u0027ve been staring thoughtfully into and smile at her. She\u0027s silent for a long time, confused, unsure of how to respond, but eventually she looks deeply into my eyes and says, haltingly, leaning across the table, \"That\u0027s... so... interesting,\" which is all that comes out of her mouth, is all she has to say.\u003c/p\u003e\n\u003cp\u003eEleven thirty-four. We stand on the sidewalk in front of Jean\u0027s apartment on the Upper East Side. Her doorman eyes us warily and fills me with a nameless dread, his gaze piercing me from the lobby. A curtain of stars, miles of them, are scattered, glowing, across the sky and their multitude humbles me, which I have a hard time tolerating. She shrugs and nods after I say something about forms of anxiety. It\u0027s as if her mind is having a hard time communicating with her mouth, as if she is searching for a rational analysis of who I am, which is, of course, an impossibility: there... is... no... key.\u003c/p\u003e\n\u003cp\u003e\"Dinner was wonderful,\" she says. \"Thank you very much.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, the food was mediocre, but you\u0027re welcome.\" I shrug.\u003c/p\u003e\n\u003cp\u003e\"Do you want to come up for a drink?\" she asks too casually, and even though I\u0027m critical of her approach it doesn\u0027t necessarily mean that I don\u0027t want to go up - but something stops me, something quells the bloodlust: the doorman? the way the lobby is lit? her lipstick? Plus I\u0027m beginning to think that\u0026nbsp; p**n ography is so much less complicated than actual sex, and because of this lack of complication, so much more pleasurable.\u003c/p\u003e\n\u003cp\u003e\"Do you have any peyote?\" I ask.\u003c/p\u003e\n\u003cp\u003eShe pauses, confused. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Just a joke,\" I say, then, \"Listen, I want to watch David Letterman so...\" I pause, unsure as to why I\u0027m lingering. \"I should go.\"\u003c/p\u003e\n\u003cp\u003e\"You can watch it...\" She stops, then suggests, \"at my place.\"\u003c/p\u003e\n\u003cp\u003eI pause before asking, \"Do you have cable?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She nods. \"I have cable.\"\u003c/p\u003e\n\u003cp\u003eStuck, I pause again, then pretend to mull it over. \"No, it\u0027s okay. I like to watch it... without cable.\"\u003c/p\u003e\n\u003cp\u003eShe offers a sad, perplexed glance. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"I have to return some videotapes,\" I explain in a rush.\u003c/p\u003e\n\u003cp\u003eShe pauses. \"Now? It\u0027s\" - she checks her witch - \"almost midnight.\u003c/p\u003e\n\u003cp\u003e\"Well, yeah,\" I say, considerably detached.\u003c/p\u003e\n\u003cp\u003e\"Well, I guess... it\u0027s good night then,\" she says.\u003c/p\u003e\n\u003cp\u003eWhat kind of books does Jean read? Titles race through my mind: How to Make a Man Fall in Love with You. How to Keep a Man in Lone with You Forever. How to Close a Deal: Get Married. How to Be Married One Year from Today. Supplicant. In my overcoat pocket I finger the ostrich condom case from Luc Benoit I bought last week but, er, no.\u003c/p\u003e\n\u003cp\u003eAfter awkwardly shaking hands she asks, still holding mine, \"Really? You don\u0027t have cable?\"\u003c/p\u003e\n\u003cp\u003eAnd though it has been in no way a romantic evening, she embraces me and this time emanates a warmth I\u0027m not familiar with. I am so used to imagining everything happening the way it occurs in movies, visualizing things falling somehow into the shape of events on a screen, that I almost hear the swelling of an orchestra, can almost hallucinate the camera panning low around us, fireworks bursting in slow motion overhead, the seventy-millimeter image of her lips parting and the subsequent murmur of \"I want you\" in Dolby sound. But my embrace is frozen and I realize, at first distantly and they with greater clarity, that the havoc raging inside me is gradually subsiding and she is kissing me on the mouth and this jars me back into some kind of reality and I lightly push her away. She glances up at me fearfully.\u003c/p\u003e\n\u003cp\u003e\"Listen, I\u0027ve got to go,\" I say, checking my Rolex. \"I don\u0027t want to miss... Stupid Pet Tricks.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she says, composing herself. \"Bye.\"\u003c/p\u003e\n\u003cp\u003e\"Night,\" I say.\u003c/p\u003e\n\u003cp\u003eWe both head off in our separate directions, but suddenly she calls out something. \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-113.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
