{"id":96574,"no":115,"title":"Page 115","content":"\u003cp\u003e\"No, I\u0027m sorry,\" he says, genuinely apologetic. \"I should\u0027ve made an appointment.\" Gesturing toward the cordless phone I\u0027m placing back in its recharging cradle, he asks, \"Was that, uh, anything important?\"\u003c/p\u003e\n\u003cp\u003e\"Oh that?\" I ask, moving toward my desk, sinking into my chair. \u0027Just mulling over business problems. Examining opportunities... Exchanging rumors... Spreading gossip.\" We both laugh. The ice breaks.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" he says, sitting up, holding out his hand. \"I\u0027m Donald Kimball.\"\u003c/p\u003e\n\u003cp\u003e\"Hi. Pat Bateman.\" I take it, squeezing it firmly. \"Nice to meet you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he says, \"to barge in on you like this, but I was supposed to talk to Luis Carruthers and he wasn\u0027t in and... well, you\u0027re here, so...\" He smiles, shrugs. \"I know how busy you guys can get.\" He averts his eyes from the three copies of Sports Illustrated that lie open atop my desk, covering it, along with the Walkman. I notice them too, then close all three issues and slip them into the desk\u0027s top drawer along with the still-running Walkman.\u003c/p\u003e\n\u003cp\u003e\"So,\" I start, trying to come off as friendly and conversational as possible. \"What\u0027s the topic of discussion?\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" he starts. \"I\u0027ve been hired by Meredith Powell to investigate the disappearance of Paul Owen.\"\u003c/p\u003e\n\u003cp\u003eI nod thoughtfully before asking, \"You\u0027re not with the FBI or anything, are you?\"\u003c/p\u003e\n\u003cp\u003e\"No, no,\" he says. \"Nothing like that. I\u0027m just a private investigator.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, I see... Yes.\" I nod again, still not relieved. \"Paul\u0027s disappearance... Yes.\"\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s nothing that official,\" he confides. \"I just have some basic questions. About Paul Owen. About yourself - \"\u003c/p\u003e\n\u003cp\u003e\"Coffee?\" I ask suddenly.\u003c/p\u003e\n\u003cp\u003eAs if unsure, he says, \"No, I\u0027m okay.\"\u003c/p\u003e\n\u003cp\u003e\"Perrier? San Pellegrino?\" I offer.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m okay,\" he says again, opening a small black notebook he\u0027s taken out of his pocket along with a gold Cross pen.\u003c/p\u003e\n\u003cp\u003eI buzz Jean.\u003c/p\u003e\n\u003cp\u003e\"Yes, Patrick?\"\u003c/p\u003e\n\u003cp\u003e\"Jean can you bring Mr...\" I stop, look up.\u003c/p\u003e\n\u003cp\u003eHe looks up too. \"Kimball.\"\u003c/p\u003e\n\u003cp\u003e\"...Mr. Kimball a bottle of San Pelle - \"\u003c/p\u003e\n\u003cp\u003e\"Oh no, I\u0027m okay,\" he protests.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s no problem,\" I tell him.\u003c/p\u003e\n\u003cp\u003eI get the feeling he\u0027s trying not to stare at me strangely. He turns back to his notebook and writes something down, then crosses something out. Jean walks in almost immediately and she places the bottle of San Pellegrino and a Steuben etched-glass tumbler on my desk in front of Kimball. She gives me a fretful, worried glance, which I scowl at. Kimball looks up, smiles and nods at Jean, who I notice is not wearing a bra today. Innocently, I watch her leave, then return my gaze to Kimball, clasping my hands together, sitting up. \"Well, what\u0027s the topic of discussion?\" I say again.\u003c/p\u003e\n\u003cp\u003e\"The disappearance of Paul Owen,\" he says, reminding me.\u003c/p\u003e\n\u003cp\u003e\"Oh right. Well, I haven\u0027t heard anything about the disappearance or anything...\" I pause, then try to laugh. \"Not on Page Six at least.\"\u003c/p\u003e\n\u003cp\u003eKimball smiles politely. \"I think his family wants this kept quiet.\"\u003c/p\u003e\n\u003cp\u003e\"Understandable.\" I nod at the untouched glass and bottle, and then look up at him. \"Lime?\"\u003c/p\u003e\n\u003cp\u003e\"No, really,\" he says. \"I\u0027m okay.\"\u003c/p\u003e\n\u003cp\u003e\"You sure?\" I ask. \"I can always get you a lime.\"\u003c/p\u003e\n\u003cp\u003eHe pauses briefly, then says, \"Just some preliminary questions that I need for my own files, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Shoot,\" I say.\u003c/p\u003e\n\u003cp\u003e\"How old are you?\" he asks.\u003c/p\u003e\n\u003cp\u003e\u0027Twenty-seven,\" I say. \"I\u0027ll be twenty-eight in October.\"\u003c/p\u003e\n\u003cp\u003e\"Where did you go to school?\" He scribbles something in his book.\u003c/p\u003e\n\u003cp\u003e\"Harvard,\" I tell him. \"Then Harvard Business School.\"\u003c/p\u003e\n\u003cp\u003e\"Your address?\" he asks, looking only at his book.\u003c/p\u003e\n\u003cp\u003e\"Fifty-five West Eighty-first Street,\" I say. \"The American Gardens Building.\"\u003c/p\u003e\n\u003cp\u003e\"Nice.\" He looks up, impressed. \"Very nice.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\" I smile, flattered.\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t Tom Cruise live there?\" he asks.\u003c/p\u003e\n\u003cp\u003e\"Yup.\" I squeeze the bridge of my nose. Suddenly I have to close my eyes tightly.\u003c/p\u003e\n\u003cp\u003eI hear him speak. \"Pardon me, but are you okay?\"\u003c/p\u003e\n\u003cp\u003eOpening my eyes, both of them tearing, I say, \"Why do you ask?\"\u003c/p\u003e\n\u003cp\u003e\"You seem... nervous.\"\u003c/p\u003e\n\u003cp\u003eI reach into a drawer in my desk and bring out a bottle of aspirin.\u003c/p\u003e\n\u003cp\u003e\"Nuprin?\" I offer. \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-115.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
