{"id":96577,"no":118,"title":"Page 118","content":"\u003cp\u003e\"Oh right,\" I say. \"Of course... We had wanted Paul Owen to come,\" I say, nodding my head as if just realizing something. \"But he said he had plans...\" Then, lamely, \"I guess I had dinner with Victoria the... following night.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, like I said, I was just hired by Meredith.\" He sighs, closing his book.\u003c/p\u003e\n\u003cp\u003eTentatively, I ask, \"Did you know that Meredith Powell is dating Brock Thompson?\"\u003c/p\u003e\n\u003cp\u003eHe shrugs, sighs. \"I don\u0027t know about that. All I know is that Paul Owen owes her supposedly a lot of money.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\" I say, nodding. \"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Personally,\" he says, confiding, \"I think the guy went a little nutso. Split town for a while. Maybe he did go to London. Sightseeing. Drinking. Whatever. Anyway, I\u0027m pretty sure he\u0027ll turn up sooner or later.\"\u003c/p\u003e\n\u003cp\u003eI nod slowly, hoping to look suitably bewildered.\u003c/p\u003e\n\u003cp\u003e\"Was he involved at all, do you think, in, say, occultism or Satan worship?\" Kimball asks seriously.\u003c/p\u003e\n\u003cp\u003e\"Er, what?\"\u003c/p\u003e\n\u003cp\u003e\"I know it sounds like a lame question but an New Jersey last month - I don\u0027t, know if you\u0027ve heard about this, but a young stockbroker was recently arrested and charged with murdering a young Chicano girl and performing voodoo rituals with, well, various body parts - \"\u003c/p\u003e\n\u003cp\u003e\"Yikes!\" I exclaim.\u003c/p\u003e\n\u003cp\u003e\"And I mean...\" He smiles sheepishly again. \"Have you heard anything about this?\"\u003c/p\u003e\n\u003cp\u003e\"Did the guy deny doing it?\" I ask, tingling.\u003c/p\u003e\n\u003cp\u003e\"Right.\" Kimball nods.\u003c/p\u003e\n\u003cp\u003e\"That was an interesting case,\" I manage to say.\u003c/p\u003e\n\u003cp\u003e\"Even though the guy says he\u0027s innocent he still thinks he\u0027s Inca, the bird god, or something,\" Kimball says, scrunching his features up.\u003c/p\u003e\n\u003cp\u003eWe both laugh out loud about this.\u003c/p\u003e\n\u003cp\u003e\"No,\" I finally say. \"Paul wasn\u0027t into that. He followed a balanced diet and - \"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I know, and was into that whole Yale thing,\" Kimball finishes tiredly.\u003c/p\u003e\n\u003cp\u003eThere is a long pause that, I think, might be the longest one so far.\u003c/p\u003e\n\u003cp\u003e\"Have you consulted a psychic?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"No.\" He shakes his head in a way that suggests he\u0027s considered it. Oh who cares?\u003c/p\u003e\n\u003cp\u003e\"Had his apartment been burglarized?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"No, it actually hadn\u0027t,\" he says. \"Toiletries were missing. A suit was gone. So was some luggage. That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"Do you suspect foul play?\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t say,\" he says. \"But like I told you, I wouldn\u0027t be surprised if he\u0027s just hiding out someplace.\"\u003c/p\u003e\n\u003cp\u003e\"I mean no one\u0027s dealing with the homicide squad yet or anything, right?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"No, not yet. As I said, we\u0027re not sure. But...\" He stops, looks dejected. \"Basically no one has seen or heard anything.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s so typical, isn\u0027t it?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just strange,\" he agrees, staring out the window, lost. \"One day someone\u0027s walking around, going to work, alive, and then...\" Kimball stops, fails to complete the sentence.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I sigh, nodding.\u003c/p\u003e\n\u003cp\u003e\"People just... disappear,\" he says.\u003c/p\u003e\n\u003cp\u003e\"The earth just opens up and swallows people,\" I say, somewhat sadly, checking my Rolex.\u003c/p\u003e\n\u003cp\u003e\"Eerie.\" Kimball yawns, stretching. \"Really eerie.\"\u003c/p\u003e\n\u003cp\u003e\"Ominous.\" I nod my agreement.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just\" - he sighs, exasperated - \"futile.\"\u003c/p\u003e\n\u003cp\u003eI pause, unsure of what to say, and come up with \"Futility is... hard to deal with.\"\u003c/p\u003e\n\u003cp\u003eI am thinking about nothing. It\u0027s silent in the office. To break it, I point out a book on top of the desk, next to the San Pellegrino bottle. The Art of the Deal, by Donald Trump.\u003c/p\u003e\n\u003cp\u003e\"Have you read it?\" I ask Kimball.\u003c/p\u003e\n\u003cp\u003e\"No,\" he sighs, but politely asks, \"Is it any good?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s very good,\" I say, nodding.\u003c/p\u003e\n\u003cp\u003e\"Listen.\" He sighs again. \"I\u0027ve taken up enough of your time.\" He pockets the Marlboros.\u003c/p\u003e\n\u003cp\u003e\"I have a lunch meeting with Cliff Huxtable at The Four Seasons in twenty minutes anyway,\" I lie, standing up. \"I have to go too.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t The Four Seasons a little far uptown?\" He looks concerned, also getting up. \"I mean aren\u0027t you going to be late?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, no,\" I stall. \"There\u0027s one... down here.\"\u003c/p\u003e\n\u003cp\u003e\"Oh really?\" he asks. \"I didn\u0027t know that.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I say, leading him to the door. \"It\u0027s very good.\"\u003c/p\u003e\n\u003cp\u003e\"Listen,\" he says, turning to face me. \"If anything occurs to you, any information at all...\" \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-118.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
