{"id":96522,"no":63,"title":"Page 63","content":"\u003cp\u003e\"We won\u0027t have to wait,\" Luis screams. \"I promise.\"\u003c/p\u003e\n\u003cp\u003e\"Promise nothing, you geek,\" I scream, then, \"Is Paul Owen still handling the Fisher account?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want you to be mad at me, Patrick,\" Luis screams desperately. \"It\u0027ll be all right.\"\u003c/p\u003e\n\u003cp\u003e\"Oh Jesus, forget it,\" I scream. \"Now listen to me: is Paul Owen still handling the Fisher account?\"\u003c/p\u003e\n\u003cp\u003eCarruthers looks over at him and then back at me. \"Yeah, I guess. I heard Ashley has chlamydia.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to talk to him,\" I shout, getting up, taking the empty seat next to Owen.\u003c/p\u003e\n\u003cp\u003eBut when I sit down something strange on the stage catches my eye. Bono has now moved across the stage, following me to my seat, and he\u0027s staring into my eyes, kneeling at the edge of the stage, wearing black jeans (maybe Gitano), sandals, a leather vest with no shirt beneath it. His body is white, covered with sweat, and it\u0027s not worked out enough, there\u0027s no muscle tone and what definition there might be is covered beneath a paltry amount of chest hair. He has a cowboy hat on and his hair is pulled back into a ponytail and he\u0027s moaning some dirge - I catch the lyric \"A hero is an insect in this world\" - and he has a faint, barely noticeable but nonetheless intense smirk on his face and it grows, spreading across it confidently, and while his eyes blaze, the backdrop of the stage turns red and suddenly I get this tremendous surge of feeling, this rush of knowledge and my own heart beats faster because of this and it\u0027s not impossible to believe that an invisible cord attached to Bono has now encircled me and now the audience disappears and the music slows down, gets softer, and it\u0027s just Bono onstage - the stadium\u0027s deserted, the band fades away...\u003c/p\u003e\n\u003cp\u003eAnd then everyone, the audience, the band, reappears and the music slowly swells up and Bono turns away and I\u0027m left tingling, my face flushed, an aching erection pulsing against my thigh, my hands clenched in fists of tension. But suddenly everything stops, as if a switch has been turned off, the backdrop flashes back to white. Bono is on the other side of the stage now and everything, the feeling in my heart, the sensation combing my brain, vanishes and now more than ever I need to know about the Fisher account that Owen is handling and this information seems vital, more pertinent than the bond I feel I have with Bono, who is now dissolving and remote. I turn to Paul Owen.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" I shout. \"How\u0027s it going?\"\u003c/p\u003e\n\u003cp\u003e\"Those guys over there...\" He motions toward a group of stagehands standing by the edge of the far side of the front row, peering into the crowd, conferring with one another. \"They were pointing over here at Evelyn and Courtney and Ashley.\"\u003c/p\u003e\n\u003cp\u003e\"Who are they?\" I shout. \"Are they from Oppenheimer?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Owen shouts back. \"I think they\u0027re roadies who look for chicks to go backstage and have sex with the band.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" I scream. \"I thought maybe they worked at Barney\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he shouts. \"They\u0027re called trim coordinators.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know that?\"\u003c/p\u003e\n\u003cp\u003e\"I have a cousin who manages All We Need of Hell,\" he shouts.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s irritating that you know this,\" I say.\u003c/p\u003e\n\u003cp\u003e\"What?\" he shouts.\u003c/p\u003e\n\u003cp\u003e\"Are you still handling the Fisher account?\" I shout back.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" he screams. \"Lucked out, huh, Marcus?\"\u003c/p\u003e\n\u003cp\u003e\"You sure did,\" I scream. \"How did you get it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I had the Ransom account and things just fell into place.\" He shrugs helplessly, the smooth bastard. \"You know?\"\u003c/p\u003e\n\u003cp\u003e\"Wow,\" I shout.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" he shouts back, then turns around in his seat and shouts at two dumb-looking fat girls from New Jersey passing an oversize joint between them, one of the cows wrapped in what I\u0027m guessing is the Irish flag. \"Will you please put your skunk-weed away - it reeks.\"\u003c/p\u003e\n\u003cp\u003e\"I want it,\" I shout, staring at his perfect, even part; even his scalp is tan.\u003c/p\u003e\n\u003cp\u003e\"You want what?\" he shouts back. \"Marijuana?\"\u003c/p\u003e\n\u003cp\u003e\"No. Nothing,\" I scream, my throat raw, and I slump back into my seat, stare emptily at the stage, biting my thumbnail, ruining yesterday\u0027s manicure.\u003c/p\u003e\n\u003cp\u003eWe leave after Evelyn and Ashley return and later, in the limousine racing back toward Manhattan to make the reservation at Brussels, another bottle of Cristal opened, Reagan still on the television set, Evelyn and Ashley tell us that two bouncers accosted them near the ladies\u0027 room and demanded they come backstage. I explain who they were and what purpose they serve.\u003c/p\u003e\n\u003cp\u003e\"My god,\" Evelyn gasps. \"Are you telling me I\u0027ve been... trim -coordinated?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-63.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
