{"id":96524,"no":65,"title":"Page 65","content":"\u003cp\u003e\"I\u0027m sorry, sir,\" the waitress says. \"No cheese. Kosher,\" and I have no idea what the f**k she\u0027s talking about and I say, \"Fine. A kosher burger but with cheese, Monterey Jack perhaps, and - oh god,\" I moan, sensing more cramps coming on. \"No cheese, sir,\" she says. \"Kosher... \" \"Oh god, is this a nightmare, you f**king Jew?\" I mutter, and then, \"Cottage cheese? Just bring it?\" \"I\u0027ll get the manager,\" she says. \"Whatever. But bring me a beverage in the meanwhile,\" I hiss. \"Yes?\" she asks. \"A... vanilla... milk shake...\" \"No milk shakes. Kosher,\" she says, then, \"I\u0027ll get the manager.\" \"No, wait.\" \"Mister I\u0027ll get the manager.\" \"What in the f**k is going on?\" I ask, seething, my platinum AmEx already slapped on the greasy table. \"No milk shake. Kosher,\" she says, thick-upped, just one of billions of people who have passed over this planet. \"Then bring me a f**king... vanilla... malted!\" I roar, spraying spit all over my open menu. She just stares. \"Extra thick!\" I add. She walks away to get the manager and when I see him approaching, a bald carbon copy of the waitress, I get up and scream, \"Fuck yourself you retarded cocksucking kike,\" and I run out of the delicatessen and onto the street where this\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eYale Club\u003c/p\u003e\n\u003cp\u003e\"What are the rules for a sweater vest?\" Van Patten asks the table.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" McDermott furrows his brow, takes a sip of Absolut.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I say, \"Cla rify.\"\u003c/p\u003e\n\u003cp\u003e\"Well, is it strictly infor mal - \"\u003c/p\u003e\n\u003cp\u003e\"Or can it be worn with a suit?\" I interrupt, finishing his sentence.\u003c/p\u003e\n\u003cp\u003e\"Exactly.\" He smiles.\u003c/p\u003e\n\u003cp\u003e\"Well, according to Bruce Boyer - \" I begin.\u003c/p\u003e\n\u003cp\u003e\"Wait.\" Van Patten stops me. \"Is he with Morgan Stanley?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" I smile. \"He\u0027s not with Morgan Stanley.\"\u003c/p\u003e\n\u003cp\u003e\"Wasn\u0027t he a serial killer?\" McDermott asks suspiciously, then moans. \"Don\u0027t tell me he was another serial killer, Bateman. Not another serial killer.\"\u003c/p\u003e\n\u003cp\u003e\"No, McDufus, he wasn\u0027t a serial killer,\" I say, turning back to Van Patten, but before continuing turn back to McDermott. \u0027That really pisses me off.\"\u003c/p\u003e\n\u003cp\u003e\"But you always bring them up,\" McDermott complains. \"And always in this casual, educational sort of way. I mean, I don\u0027t want to know anything about Son of Sam or the f**king Hillside Strangler or Ted Bundy or Featherhead, for god sake.\"\u003c/p\u003e\n\u003cp\u003e\"Featherhead?\" Van Patten asks. \"Who\u0027s Featherhead? He sounds exceptionally dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"He means Leatherface,\" I say, teeth tightly clenched.\u003c/p\u003e\n\u003cp\u003e\"Leatherface. He was part of the Texas Chainsaw Massacre.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Van Patten smiles politely. \"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"And he was exceptionally dangerous,\" I say.\u003c/p\u003e\n\u003cp\u003e\"And now okay, go on. Bruce Boyer, what did he do?\" McDermott demands, releasing a sigh, rolling his eyes up. \"Let\u0027s see - skin them alive? Starve them to death? Run them over? Feed them to dogs? What?\"\u003c/p\u003e\n\u003cp\u003e\"You guys,\" I say, shaking my head, then teasingly admit, \"He did something far worse.\"\u003c/p\u003e\n\u003cp\u003e\"Like what - take them to dinner at McManus\u0027s new restaurant?\" McDermott asks.\u003c/p\u003e\n\u003cp\u003e\"That would do it,\" Van Patter agrees. \"Did you go? It was grubby, wasn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Did you have the meat loaf?\" McDermott asks.\u003c/p\u003e\n\u003cp\u003e\"The meat loaf?\" Van Patten\u0027s in shock. \"What about the interior. What about the f**king tablecloths?\"\u003c/p\u003e\n\u003cp\u003e\"But did you have the meat loaf?\" McDermott presses.\u003c/p\u003e\n\u003cp\u003e\"Of course I had the meat loaf, and the squab, and the marlin,\" Van Patten says.\u003c/p\u003e\n\u003cp\u003e\"Oh god, I forgot about the marlin,\" McDermott groans. \"The marlin chili.\"\u003c/p\u003e\n\u003cp\u003e\"After reading Miller\u0027s review in the Times, who in their right mind wouldn\u0027t order the meat loaf, or the marlin for that matter?\"\u003c/p\u003e\n\u003cp\u003e\"But Miller got it wrong,\" McDermott says. \"It was just grubby. The quesadilla with papaya? Usually a good dish, but there, Jesus.\" He whistles, shaking his head.\u003c/p\u003e\n\u003cp\u003e\"And cheap,\" Van Patten adds.\u003c/p\u003e\n\u003cp\u003e\"So cheap.\" McDermott is in total agreement. \"And the watermelon-brittle tart - \"\u003c/p\u003e\n\u003cp\u003e\"Gentlemen.\" I cough. \"Ahem. I hate to interrupt, but...\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay, go on,\" McDermott says. \"Tell us more about Charles Moyer.\"\u003c/p\u003e\n\u003cp\u003e\"Bruce Boyer,\" I correct him. \"He was the author of Elegance. A Guide to Quality in Menswear.\" Then as an aside, \"And no, Craig, he wasn\u0027t a serial killer in his spare time.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-65.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
