{"id":96558,"no":99,"title":"Page 99","content":"\u003cp\u003e\"Yes sir.\" The maitre d\u0027, younger than myself, faggy, innocent, an actor no doubt, adds, \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Well, this is... very interesting. I can accept this.\" I reach into my back pocket for my gazelleskin wallet and press a twenty into the maitre d\u0027s uncertain fist. He looks at the bill, confused, then murmurs \"Thank you\" and walks away as if in a daze.\u003c/p\u003e\n\u003cp\u003e\"No. Thank you,\" I call out and take my seat across from Bethany, nodding courteously to the couple next to us, and though I try to ignore her for as long as etiquette allows, I can\u0027t. Bethany looks absolutely stunning, just like a model. Everything\u0027s murky. I\u0027m on edge. Feverish, romantic notions -\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t you smoke at Harvard?\" is the first thing she says.\u003c/p\u003e\n\u003cp\u003e\"Cigars,\" I say. \"Only cigars.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she says.\u003c/p\u003e\n\u003cp\u003e\"But I quit that,\" I lie, breathing in hard, squeezing my hands together.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good.\" She nods.\u003c/p\u003e\n\u003cp\u003e\"Listen, did you have any trouble getting reservations?\" I ask, and I am f**king shaking. I put my hands on the table like a fool, hoping that under her watchful gaze they will stop trembling.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t need reservations here, Patrick,\" she says soothingly, reaching out a hand, covering one of mine with hers. \"Calm down. You look like a wild man.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m clam, I mean calm,\" I say, breathing in hard, trying to smile, and then, involuntarily, unable to stop myself, ask, \"How\u0027s my hair?\"\u003c/p\u003e\n\u003cp\u003e\"Your hair is fine,\" she says. \"Shhh. It\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003e\"All right. I am all right.\" I try to smile again but I\u0027m sure it looks just like a grimace.\u003c/p\u003e\n\u003cp\u003eAfter a short pause she comments, \"That\u0027s a nice suit. Henry Stuart?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I say, insulted, touching its lapel. \"Garrick Anderson.\"\u003c/p\u003e\n\u003cp\u003e.\u0027It\u0027s very nice,\" she says and then, genuinely concerned, \"Are you okay, Patrick? You just... twitched.\"\u003c/p\u003e\n\u003cp\u003e\"Listen. I\u0027m frazzled. I just got back from Washington. I took the Trump shuttle this morning,\" I tell her, unable to make eye contact, all in a rush. \"It was delightful. The service - really fabulous. I need a drink.\"\u003c/p\u003e\n\u003cp\u003eShe smiles, amused, studying me in a shrewd way. \"Was it?\" she asks, not totally, I sense, without smugness.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I can\u0027t really look at her and it takes immense effort to unfold the napkin, lay it across my lap, reposition it correctly, busy myself with the wineglass, praying for a waiter, the ensuing silence causing the loudest possible sound. \"So did you watch The Patty Winters Show this morning?\"\u003c/p\u003e\n\u003cp\u003e\"No, I was out jogging,\" she says, leaning in. \"It was about Michael J. Fox, right?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I correct her. \"It was about Patrick Swayze.\"\u003c/p\u003e\n\u003cp\u003e\"Oh really?\" she asks, then, \"It\u0027s hard to keep.track. You\u0027re sure?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Patrick Swayze. I\u0027m positive.\"\u003c/p\u003e\n\u003cp\u003e\"How was it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it was very interesting,\" I tell her, breathing in air. \"It was almost like a debate, about whether he\u0027s gotten cynical or not.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think he has?\" she asks, still smiling.\u003c/p\u003e\n\u003cp\u003e\"Well, no, I\u0027m not sure,\" I start nervously. \"It\"s an interesting question. It wasn\u0027t explored fully enough. I mean after Dirty Dancing I wouldn\u0027t think so, but withTiger Warsaw I don\u0027t know. I might be crazy, but I thought I detected some bitterness. I\u0027m not sure.\"\u003c/p\u003e\n\u003cp\u003eShe stares at me, her expression unchanged.\u003c/p\u003e\n\u003cp\u003e\"Oh, I almost forgot,\" I say, reaching into my pocket. \"I wrote you a poem.\" I hand her the slip of paper. \"Here.\" I feel sick and broken, tortured, really on the brink.\u003c/p\u003e\n\u003cp\u003e\"Oh Patrick.\" She smiles. \"How sweet.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you know,\" I say, looking down shyly.\u003c/p\u003e\n\u003cp\u003eBethany takes the slip of paper and unfolds it.\u003c/p\u003e\n\u003cp\u003e\"Read it,\" I urge enthusiastically.\u003c/p\u003e\n\u003cp\u003eShe looks it over quizzically, puzzled, squinting, then she turns the page over to see if there\u0027s anything on the back. Something in her understands it\u0027s short and she looks back at the words written, scrawled in red, on the front of the page.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like haiku, you know?\" I say. \"Read it. Go on.\"\u003c/p\u003e\n\u003cp\u003eShe clears her throat and hesitantly begins reading, slowly, stopping often. \" \u0027The poor nigger on the wall. Look at him.\u0027\" She pauses and squints again at the paper, then hesitantly resumes. \" \u0027Look at the poor nigger. Look at the poor nigger... on... the... wall.\u0027\" She stops again, faltering, looks at me, confused, then back at the paper. \u003c/p\u003e","sourceLink":"https://allnovel.net/american-psycho/page-99.html","bookId":2593,"creation":"Oct 5, 2019 6:21:50 PM","modification":"Oct 5, 2019 6:21:50 PM"}
