{"id":71963,"no":4,"title":"Page 4","content":"\u003cp\u003eMy eyelids gradually open and I turn my head toward her.\u003c/p\u003e\n\u003cp\u003e“What about dad? Is he still a threat to me?”\u003c/p\u003e\n\u003cp\u003eShe looks like shit, dark circles under her eyes and she’s wearing a heavy amount of makeup to try and cover it up. She’s still all done up in a fancy red dress, with jewelry and a fur coat, her elaborate façade to hide the ugly in her life. “Your father did nothing wrong. He was just upset at what you did.”\u003c/p\u003e\n\u003cp\u003e“You mean beating the shit out of Caleb,” I clarify as I put my hands on the bed, push myself up, and lean against the headboard.\u003c/p\u003e\n\u003cp\u003eHer eyes turn cold. “Yes, I mean that. Getting into fights is not acceptable. You’re lucky Caleb’s okay. Although he’s still deciding if he’s going to press charges. Your dad’s working on trying to make a bargain with him.”\u003c/p\u003e\n\u003cp\u003e“What?” It feels like a thousand razor-sharp needles have slid underneath my skin. “Why?”\u003c/p\u003e\n\u003cp\u003e“Because we’re not going to let you drag this family’s reputation down the drain with your pathetic life. We’re going to keep this as quiet as we can.”\u003c/p\u003e\n\u003cp\u003e“So you’re bribing him with money,” I utter through clenched teeth. Fuck. I want to hit something hard, ram my fist into a metal wall, split open my knuckles, and watch them bleed. I don’t want my father taking care of this. I don’t want to owe him anything.\u003c/p\u003e\n\u003cp\u003eHe’ll hold it over my head for the rest of my life. Fuck. This whole situation is so messed up.\u003c/p\u003e\n\u003cp\u003e“Yes, with money,” she snaps and takes her makeup compact out of her purse. “Your father’s hard-earned money, which you should be very grateful for.”\u003c/p\u003e\n\u003cp\u003e“Let Caleb press charges.” I honestly don’t care anymore.\u003c/p\u003e\n\u003cp\u003eAlmost every part of me has died and what’s still alive is just waiting until the next incision. “I don’t give a shit. It’d be better than letting dad pay him off.”\u003c/p\u003e\n\u003cp\u003eShe checks her reflection, pursing her lips, and then clicks the compact shut. “You’re so ungrateful.” She storms toward the door, her high heels clicking against the dingy linoleum. “You’re the most frustrating child in the world. Your brothers never gave me problems like this.”\u003c/p\u003e\n\u003cp\u003eThat’s because they escaped during the storm and were gone for the tornado. “I’m not a child.” I rotate onto my side and close my eyes. “I’ve never really been a child.”\u003c/p\u003e\n\u003cp\u003eThe click of her heels stops. She waits, like she expects me to say something or wants to say something herself, but then the clicking picks up again and soon she’s out in the hall. I let the numbness of the pill slink into my body and drag me into the dark.\u003c/p\u003e\n\u003cp\u003eThe last thing I see before I pass out is the most beautiful blue-eyed, brown-haired girl I’ve ever laid eyes on. The only girl who’s ever owned my heart and I hold onto the image with every ounce of strength I have. Otherwise I’d probably lose the will to breathe.\u003c/p\u003e\n\u003cp\u003eCallie “I have a quick question,” I say to Luke. We’re standing in front of the entrance to a small ice rink, getting ready to go ice-skating, something we’ve both never done (which we admit to each other on the car ride over here). It’s not too crowded, but there are a few couples skating and holding hands and a girl getting lessons in the center. “What happened in Professor McGellon’s class?”\u003c/p\u003e\n\u003cp\u003eLuke shakes his head as he runs his hand over his shortly shaven brown hair. “Did Seth put you up to that?”\u003c/p\u003e\n\u003cp\u003eI bend over to tighten the lace on my skate. “He mentioned on the phone that I should ask you.”\u003c/p\u003e\n\u003cp\u003eHe rolls his eyes as I stand up. “You really want to know?”\u003c/p\u003e\n\u003cp\u003eI hesitate at the note of warning in his tone, but decide to be a bit of a daredevil and nod my head. “Yeah, I do. I guess.”\u003c/p\u003e\n\u003cp\u003e“I got caught doing… something in his class.” He ventures out onto the rink and dips the toe of the skate down so the blade cuts the ice. “With a girl.”\u003c/p\u003e\n\u003cp\u003eSeth and his need to push me out of my comfort zone. I’m blushing, but I act like it’s just a flush from the frigid temperature, adding a shiver from my body. “By the professor?”\u003c/p\u003e\n\u003cp\u003eHe progresses forward and his knees wobble as he inches toward the middle of the rink where a girl is spinning in circles with her hands above her head. “No, by Seth.”\u003c/p\u003e\n\u003cp\u003eI grip onto the wall and edge out onto the ice, deciding it’s probably best to change the subject before my cheeks ignite. “So this is what people do to cheer themselves up?” With my hands out to my side and my palms flat, I try to keep my balance as I slide my feet across the rink.\u003c/p\u003e\n\u003cp\u003eLuke has his hands spanned to the side of himself, and his knees are bent as he skates in a zigzag pattern. “That’s the rumor I was told,” he says and reaches for the wall when he stumbles.\u003c/p\u003e\n\u003cp\u003e“By who?” I clutch onto the wall for support as my knees begin to buckle and remain there briefly to let the poor people behind me skate by.\u003c/p\u003e\n\u003cp\u003eHe grins as his feet make a circular motion against the ice.\u003c/p\u003e\n\u003cp\u003e“By this hot chick I hooked up with the other night. She insisted that we needed to go ice skating.”\u003c/p\u003e\n\u003cp\u003eI inhale a deep breath and fight back another blush creeping across my cheeks. “Why didn’t you just bring her here then?”\u003c/p\u003e\n\u003cp\u003eHe snorts a laugh. “What fun would that be? I like hanging out with you, Callie. It’s relaxing.” He pushes his feet along the ice and attempts to skate backward but trips over his feet and slams into the wall. His hand shoots out and he clutches onto the edge of the plastic section.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I stifle a laugh as his eyes pop wide open.\u003c/p\u003e\n\u003cp\u003e“You think that’s funny?” He gets his feet underneath himself and then, with very little coordination, skates toward me with his knees knocking together and his arms flinging to the side of him.\u003c/p\u003e\n\u003cp\u003eI stifle a laugh, moving my feet inward and outward, going backward to get away from him. “I thought football players were supposed to be coordinated.”\u003c/p\u003e\n\u003cp\u003eHis lips curve into a grin and he winks at me. “On grass, Callie. Football player don’t spend much time on ice.”\u003c/p\u003e\n\u003cp\u003e“How about a ballet studio,” I tease. “I’ve heard you guys sometimes like to twirl around and point your toes for”—I make air quotes and smile—“athletic purposes.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head, rolling his tongue into his mouth to force back a grin. “You know, Kayden’s right about you. You can get kind of cocky when you want to.”\u003c/p\u003e\n\u003cp\u003eMy heart sinks to my stomach and Luke’s face falls. We both stand there, immobile, and my thoughts drift to Kayden.\u003c/p\u003e\n\u003cp\u003eI stumble to the gate to sit down on a bench. “I think I need a break. I’m not very good at this,” I say, changing the subject.\u003c/p\u003e\n\u003cp\u003e“Me neither.” Luke skates to the exit and his toe clips against the rubber threshold as he follows me off the rink. He takes a seat beside me on the bench and stretches his legs out in front of himself.\u003c/p\u003e\n\u003cp\u003eFor a while we just stare out at the other skaters, watching them laugh, smile, fall, and have fun. They look like they’re having a great time, and I envy them. I want to have fun too, but with Kayden. I want him here with me.\u003c/p\u003e\n\u003cp\u003e“So have you heard from him?” Luke asks casually, gazing across the ice rink.\u003c/p\u003e\n\u003cp\u003eI look at him, creasing my forehead. “Who? Kayden?”\u003c/p\u003e\n\u003cp\u003eHe nods his head once without making eye contact. “Yeah.”\u003c/p\u003e\n\u003cp\u003eI blow out a breath and it puffs out in front of my face in a cloud of grayish smoke. Even though it’s an indoor rink, it’s still as chilly as it is outside. I have my jacket and gloves on, along with my hood over my head, and I’m still frozen to the bone. Or maybe the cold’s from the direction the conversation’s heading.\u003c/p\u003e\n\u003cp\u003e“No,” I mutter, fastening my gaze on a young couple skating hand in hand. They look happy and if I stare for long enough I can change their faces into Kayden’s and mine’s. “I haven’t heard anything except for the latest gossip from my mother.”\u003c/p\u003e\n\u003cp\u003eLuke hunches over as he reaches for the laces on one of his skates. “And what’s the latest gossip?”\u003c/p\u003e\n\u003cp\u003eI swallow the massive lump in my throat. “That Kayden’s in a facility under surveillance.”\u003c/p\u003e\n\u003cp\u003eHe cocks his head to the side and glances up at me.\u003c/p\u003e\n\u003cp\u003e“Because they think he did it to himself?” There’s insinuation in his tone. He knows what I know: that Kayden’s dad is an evil monster who could have stabbed his son.\u003c/p\u003e\n\u003cp\u003eI tried to talk to my mother about it, but she told me it was none of our business. She’s angry with the Owens because Kayden beat up Caleb. I should have told her why… I wanted to, but sometimes wanting to isn’t enough.\u003c/p\u003e\n\u003cp\u003eWhen I’d finally worked the courage to go tell her, it was right after Kayden’s mom had told me he’d cut himself. My mom had been sitting at the kitchen table eating a bowl of cereal as she read the newspaper.\u003c/p\u003e\n\u003cp\u003e“Mom, I have to tell you something,” I said, shaking from head to toe. I’d just walked in from outside, so I pretended it was from that, but really it had been my nerves.\u003c/p\u003e\n\u003cp\u003eShe glanced up from her cereal, holding the spoon inside the bowl. “If it’s about Kayden, I already know.”\u003c/p\u003e\n\u003cp\u003eI sat down at the table across from her. “I know what you’ve probably heard, but I don’t think he did it to himself.”\u003c/p\u003e\n\u003cp\u003eShe stirred her cereal with the spoon and lines crinkled around her eyes. “What are you talking about, Callie?”\u003c/p\u003e\n\u003cp\u003e“I’m talking about… I’m talking about what happened to Kayden.” I crossed my arms on the table and balled my hands into fists. “And why he’s in the hospital.”\u003c/p\u003e\n\u003cp\u003eThe lines disappeared from around her eyes as she frowned.\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t care about that. I’m talking about what he did to Caleb.”\u003c/p\u003e\n\u003cp\u003eMy heart compressed at the sound of Caleb’s name and I wanted to scream at her for saying that. “That wasn’t his fault.”\u003c/p\u003e\n\u003cp\u003eShe shook her head and grabbed her bowl as she stood up.\u003c/p\u003e\n\u003cp\u003e“Look, I know you care about him, Callie, but he’s obviously got a temper on him.” She walked over to the sink and put the bowl in it.\u003c/p\u003e\n\u003cp\u003e“You need to stay away from him.”\u003c/p\u003e\n\u003cp\u003eI pushed back from the table and my knees shook. “No.”\u003c/p\u003e\n\u003cp\u003eShe turned around and the iciness in her eyes reminded me of why I couldn’t tell her stuff—because she only ever looked at stuff from her own point of view. “Callie Lawrence, you will not talk to me that way.”\u003c/p\u003e\n\u003cp\u003eI shook my head, backing toward the door. “I’ll talk to you like this when you’re wrong.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened, shocked. I’d never talked to her like that before. “What is wrong with you? Is it because you’ve been hanging around Kayden? I bet it is.”\u003c/p\u003e\n\u003cp\u003e“A few weeks ago you were so happy we were together,” I said, gripping the doorknob.\u003c/p\u003e\n\u003cp\u003e“That’s before I knew what he was capable of,” she said. “I don’t want you hanging out with him. And besides, you should be on Caleb’s side in all of this. He’s been part of this family for longer.”\u003c/p\u003e\n\u003cp\u003eA cold, yet hot wave of anger ripped from my toes and rushed to my mouth. “You don’t even know the whole story! And you don’t care enough to ask!” I wasn’t sure what I was referring to anymore but I didn’t stay long enough to find out. I jerked the back door open and ran outside into the snow. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2/page-4.html","bookId":1975,"creation":"Oct 5, 2019 10:22:30 AM","modification":"Oct 5, 2019 10:22:30 AM"}
