{"id":71966,"no":7,"title":"Page 7","content":"\u003cp\u003e“I think you’re going back a little too far.” Luke has his hood pulled over his head and a leather band on his wrist that has the word redemption on it. I wonder if it means something to him or if he believes in redemption. I wonder if I believe in it. He stretches his arm in front of me and flips open the glove box. “Back to the eight-track era.”\u003c/p\u003e\n\u003cp\u003eI cringe at how close he is, but then release the tension, refusing to go back to that place. I zip up my jacket, because it’s cold inside due to the fact that they keep rolling down the windows to smoke.\u003c/p\u003e\n\u003cp\u003eIt’s early in the morning, the sun is kissing the frosted land, and the highway is a hazard from last night’s storm so we have to drive slowly. There are a few cars stuck in the mounds of snow in the strip of land in the center of the opposing traffic and people have turned off onto the ramps because they’re too afraid to drive.\u003c/p\u003e\n\u003cp\u003eLuke and I are used to it though. It’s the conditions we grew up in.\u003c/p\u003e\n\u003cp\u003eSeth slaps his hand away from the glove box and Luke looks at me in disbelief, but I just laugh. “No, eight-tracks were still in play in the eighties.”\u003c/p\u003e\n\u003cp\u003e“Early eighties,” Luke corrects. “They faded out by mid-decade.”\u003c/p\u003e\n\u003cp\u003eI laugh because they are fighting over something so ridiculous and I’m tired and nervous and my head’s in a very strange place. “You guys are fighting like an old married couple.”\u003c/p\u003e\n\u003cp\u003eAs soon as I say it, I want to take it back, because I’m not sure how Luke will take it.\u003c/p\u003e\n\u003cp\u003eWhen I look at Luke, he seems perfectly fine. He shrugs and then sticks his hand into the glove box and pulls out a tape labeled Let’s Get High. “Whatever,” he says and feeds it into the tape player. “As long as I’m the guy in the relationship, it’s all good.”\u003c/p\u003e\n\u003cp\u003eSeth rolls his eyes. “Whatever, you’d totally be my bitch and you know it.”\u003c/p\u003e\n\u003cp\u003eThat’s it. I can’t hold it in any longer. My body falls forward as I cover my mouth and my shoulders shake as I laugh into my hand. “Oh my God, I can’t believe you just said that.”\u003c/p\u003e\n\u003cp\u003e“Yes, you can.” Seth pats my back. “I wouldn’t be me if I didn’t say the first thing that pops into my head.”\u003c/p\u003e\n\u003cp\u003eHe’s right. Seth is blunt and funny and he totally says whatever the hell he wants. And I love him for it. I sit up, wiping the tears from my eyes, and then give him a quick kiss on the cheek. “Thank you for making me smile,” I say.\u003c/p\u003e\n\u003cp\u003eHe grins. “Anytime, sweetheart.”\u003c/p\u003e\n\u003cp\u003eLuke shakes his head, but there’s a grin on his face so I know he’s not offended. I like Luke. He’s not judgmental and he seems accepting. I almost lean over to hug him and then realize how weird it is because it doesn’t freak me out. What does that mean?\u003c/p\u003e\n\u003cp\u003eCrap. What does that mean?\u003c/p\u003e\n\u003cp\u003e“Come on Eileen,” by Dexy’s Midnight Runners, blasts out from the speakers.\u003c/p\u003e\n\u003cp\u003e“This is so eighties,” Seth says and begins snapping his fingers and bobbing his head. He really starts to get into it, shaking his hips and shimmying frontward and backward. “Come on, Callie, you know you want to dance. It’ll make you smile even more.”\u003c/p\u003e\n\u003cp\u003eI grin from ear to ear. “No way.”\u003c/p\u003e\n\u003cp\u003eCold air fills the cab as Luke cracks the window. The lighter flicks and then the smell of cigarette smoke flows through the air.\u003c/p\u003e\n\u003cp\u003eSeth keeps dancing as he reaches into the pocket of his hoodie and takes out his pack of cigarettes. Out of the corner of my eye, I see Luke bobbing his head as he sucks on the end of his cigarette.\u003c/p\u003e\n\u003cp\u003eHe takes a long drag, and then puckers his lips and a thin trail of white smoke laces out of his mouth. Seth starts thrusting his hips wildly as he flicks the end of his lighter and puts it up to the tip of the cigarette. The paper curls in and turns black as he takes a long drag. The car starts rocking as the chorus comes on and both the guys really start getting into it. The smoke burns my lungs and the cold causes goose bumps to sprout all over my arms. I experience almost every single detail of the moment and I decide to experience it all.\u003c/p\u003e\n\u003cp\u003e“Oh fine, what the hell.” I start lifting my shoulders up and down to the rhythm and Seth grins at me.\u003c/p\u003e\n\u003cp\u003e“That’s my girl,” he says and blows out a cloud of smoke with his lips puckered out.\u003c/p\u003e\n\u003cp\u003eWe both start doing this funny jiving thing with our hands and Luke laughs as he cranks up the music. For a second I transform myself into a dancer. When the chorus hits again we all take a deep breath and belt out the lyrics at the top of our lungs. I raise my hands above my head and shut my eyes. It’ll be all right.\u003c/p\u003e\n\u003cp\u003eIt’ll be all right. Kayden will be all right.\u003c/p\u003e\n\u003cp\u003eBecause I’m here, dancing, smiling, and sitting between two guys, and if that can happen, then anything’s possible.\u003c/p\u003e\n\u003cp\u003eKayden I’ve been in the clinic for a week now and today should be a really good morning. Doug has informed me that I can have visitors outside of family and that I can make a few phone calls throughout the day. When he gives me time to make the phone call, however, I get stuck on who to call. My first instinct is to call Callie, but I haven’t talked to her since it happened and I’m not sure she wants to talk to me after finding me like that. The idea of finding out scares the shit out of me. Besides, I’m trying to keep my distance and protect her from me because the last thing she needs is my instability and fucked-up head.\u003c/p\u003e\n\u003cp\u003eI dial Luke’s number and lean back in the bed, watching the storm outside my window as the phone rings and rings.\u003c/p\u003e\n\u003cp\u003e“Kayden?” he says, sounding confounded. There’s an eighties song playing in the background and I can hear a lot of giggling.\u003c/p\u003e\n\u003cp\u003e“What’s up?” It sounds so stupid after I say it. There’s a long pause and then someone starts singing really loudly and really off key. “Is that Seth in the background?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He hesitates again. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eI flick the rubber band with my finger. It snaps back, hits my wrist, and sends a sting through my arm. “Kind of… Why are you with Seth?”\u003c/p\u003e\n\u003cp\u003e“Because… we’re in the truck.” He seems conflicted. “We’re headed to Afton to see you actually.”\u003c/p\u003e\n\u003cp\u003eI snap the rubber band against my wrist a few more times, but it’s not stilling the anxiety twisting inside me. “When you say we you mean…”\u003c/p\u003e\n\u003cp\u003e“I mean, Seth, me and…” He trails off. “And Callie.”\u003c/p\u003e\n\u003cp\u003eThe singing stops and so does the music.\u003c/p\u003e\n\u003cp\u003e“Who are you talking to?” Callie asks.\u003c/p\u003e\n\u003cp\u003eWhen I hear her voice I swear to God my heart stops. I clutch at the chord and wrap it around my wrist until it’s tight and cuts off the circulation. I stare outside at the slush on the ground and the banks of snow around the mostly vacant parking lot.\u003c/p\u003e\n\u003cp\u003e“Umm…” Luke struggles for words.\u003c/p\u003e\n\u003cp\u003e“You can tell her,” I say, because if they’re headed here then I’m going to have to face her soon.\u003c/p\u003e\n\u003cp\u003e“It’s Kayden,” he tells her and then it gets quiet.\u003c/p\u003e\n\u003cp\u003e“Oh…” She’s perplexed and I don’t blame her. “Can I… Can I talk to him?”\u003c/p\u003e\n\u003cp\u003e“Hold on,” Luke says and then asks me, “You want to talk to Callie?”\u003c/p\u003e\n\u003cp\u003e“I…” I never get to discover my answer, and it sucks because I’m dying to know how I feel. My response would have revealed the truth about my fear and how bad it’s going to be when she gets here. But like always, my mother walks in just at the right moment and steals everything away from me.\u003c/p\u003e\n\u003cp\u003e“We need to talk.” Her chin is tipped high like she’s better than everyone in the building and she’s carrying around a duffel bag on her shoulder. “Now.”\u003c/p\u003e\n\u003cp\u003e“I gotta go.” I hang up, knowing I’m being a pussy and dodging my feelings. I unravel the cord from my hand and lean back in my bed, putting my feet up on it. I’m wearing a pair of plaid pajama bottoms and an old blue T-shirt that has holes in it.\u003c/p\u003e\n\u003cp\u003eI’ve worn the outfit five times since I’ve been here and it’s getting old.\u003c/p\u003e\n\u003cp\u003eShe heaves the duffel bag onto the foot of the bed and then positions her hands on her hips. “You need to work on getting better and getting out of here. It’s making our family look bad.”\u003c/p\u003e\n\u003cp\u003eI carefully hunch forward, because moving too fast still hurts my side. “And what do you suggest I do, mother, because the doctors seem to think differently. They think I need to stay here and heal.”\u003c/p\u003e\n\u003cp\u003e“I don’t give a shit what the doctors think.” She unzips the bag with a tug. “What I care about is that you get dressed in some normal clothes, get everyone thinking you feel better, and then come home so we can start planning what we’re going to do if Caleb Miller presses charges.”\u003c/p\u003e\n\u003cp\u003e“I could always plead mental insanity.” Sarcasm drips from my voice. “Maybe they’d just keep me here instead of sending me to jail.”\u003c/p\u003e\n\u003cp\u003eHer face flushes red and she shifts the handle of her purse higher onto her shoulder. “You think this is funny? Maybe I should have your father come down here and talk some sense into you.”\u003c/p\u003e\n\u003cp\u003eNo matter how hard I try, I’m sent straight back to that place where I’m lying on the floor bleeding to death and completely ready to accept it. I rub my hand across my face and then say through clenched teeth, “I’ll see what I can do.”\u003c/p\u003e\n\u003cp\u003eShe smiles and it looks out of place, like she’s the evil villain about to execute her evil plan. She kisses my cheek and I can smell the wine on her breath. Then she moves back and rubs her thumb across my cheek. “I got lipstick on you.” She pulls her hand away and smiles again. “Let’s work on getting you out of here.” She pats my leg and then walks out of the room, leaving the door open. I hear her say something to one of the doctors and then a nurse shuts the door.\u003c/p\u003e\n\u003cp\u003eI take a long-sleeve thermal shirt out of the bag, which is filled with jeans, shirts, and socks, and slip it on over my head.\u003c/p\u003e\n\u003cp\u003eThen I reach for a pair of jeans, ready to put on my full costume and go lie to the world, just like I’ve been doing my entire life.\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003e#67 Reunite with something you thought you lost\u003c/p\u003e\n\u003cp\u003eCallie\u003c/p\u003e\n\u003cp\u003eWe arrive in Afton late at night when the moon is a ginormous orb in the charcoaled sky and the blizzard is creating a veil in front of the truck, making it hard to see. We would have made it here by dinnertime, but Seth made us stop for lunch and play in the playhouse at McDonald’s. But it was kind of all our faults for getting so carried away and staying until we got in trouble by the manager.\u003c/p\u003e\n\u003cp\u003eI think we were all avoiding something. But what that is, I’m still trying to figure out. After a very long, exhausting drive, Seth and I sneak up into the garage and crash on the bed without having to talk to my mother. The place holds one of the strongest memories in my head, and when I first walked in, I nearly fell over as I remember how it felt when Kayden touched me, kissed me, became a part of me.\u003c/p\u003e\n\u003cp\u003e“I’m bummed,” Seth states as we lie face to face on the bed in our pajamas. The space heater hums in the background and the glow of it and the lamp highlights the spackled spots on the walls.\u003c/p\u003e\n\u003cp\u003eHe fakes a pout. “I was totally looking forward to meeting your mother.”\u003c/p\u003e\n\u003cp\u003eI gently pinch his arm. “You liar. You’re so glad she’s asleep.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-redemption-of-callie-kayden-the-coincidence-2/page-7.html","bookId":1975,"creation":"Oct 5, 2019 10:22:30 AM","modification":"Oct 5, 2019 10:22:30 AM"}
