{"id":105150,"no":5,"title":"Page 5","content":"\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eTo Professor James C. Asher\u003c/p\u003e\n\u003cp\u003ec/o Hoare’s Bank\u003c/p\u003e\n\u003cp\u003eEnglish Embankment\u003c/p\u003e\n\u003cp\u003eSt Petersburg, Russia\u003c/p\u003e\n\u003cp\u003eOxford,\u003c/p\u003e\n\u003cp\u003eApril 5, 1911\u003c/p\u003e\n\u003cp\u003eDearest Jamie,\u003c/p\u003e\n\u003cp\u003eDid you arrive in St Petersburg safely? Was the journey frightful? Does this railroad (or is it a factory?) that Uncle William wanted you to look at actually seem to be a safe investment? One hears such horrid reports of Russian inefficiency, and it is a tremendous lot of money – and besides, you know how Uncle William is.\u003c/p\u003e\n\u003cp\u003eWhile you are in St Petersburg, would it be possible for you to look up a few of my colleagues there? I’ve enclosed letters of introduction, but I’m sure at least Dr Harbach should remember me from when he was last in England; what I am chiefly interested in is opening a correspondence with specialists in blood disorders, as I am rather puzzled by some of my own findings here. (I won’t trouble you with the details, but they seem anomalous to say the least.) These gentlemen would be:\u003c/p\u003e\n\u003cp\u003eDr Immanuel Grün, on the Nevsky Prospect,\u003c/p\u003e\n\u003cp\u003eDr Wilhelm Harbach, on the Admiralty Prospect,\u003c/p\u003e\n\u003cp\u003eDr Emrich Spurzheim, on Karavannaia Street near the Fontanka Canal (or is it a river?),\u003c/p\u003e\n\u003cp\u003eDr Benedict Theiss, on Samsonievsky Street,\u003c/p\u003e\n\u003cp\u003eDr Richard Bierstadt, on Italianskaia Street, and Dr Johann Leutze, also on the Nevsky Prospect.\u003c/p\u003e\n\u003cp\u003eA Dr Ludwig Spohr has offices on the Tverskaia in Moscow (such names they have!); also in Moscow are Dr Kaspar Manteuffel (on Nikitskaia), Dr Klaus Holderlin (also on Tverskaia), and Dr Reinhold Preuze (whose direction I could not find, but I believe it is in Moscow also.) Two others – Dr Richard Franck and Dr Emil Bodenschatz – are listed as having worked in Russia in the past, but I can find no mention of whether or not they are in St Petersburg now.\u003c/p\u003e\n\u003cp\u003eAll are specialists in blood chemistry. I hope you can find one of them, at least, who shares your interests in folklore!\u003c/p\u003e\n\u003cp\u003eAnd good luck with Uncle William’s factory (or is it a railroad?).\u003c/p\u003e\n\u003cp\u003eAll my love,\u003c/p\u003e\n\u003cp\u003eLydia\u003c/p\u003e\n\u003cp\u003eRain whipped with gray violence against the study windows. Lydia sealed the envelope, dug through the frothy chaos of her desk drawer for a stamp (so THAT’S where I put those notes about nervous lesions!), then settled back in her chair, looking out at the wet-dark wall of the New College, at two young men (students unwilling to get their gowns soaked?) scudding along Holywell Street like outsize black leaves.\u003c/p\u003e\n\u003cp\u003eThinking about Don Simon Ysidro.\u003c/p\u003e\n\u003cp\u003eShe knew she ought to go up to her bedroom and sort all those issues of Lancet, the British Journal of Medicine, Le Journal Francais Physiochemique and several German and American periodicals back into their respective boxes for Mick to return to the attic. Knew she should re-copy into a more readable form the notes she’d been making for the past three days, almost non-stop, on all those articles by German blood-doctors working in Russia. But she didn’t. She didn’t move.\u003c/p\u003e\n\u003cp\u003eA poulterer’s wagon passed along the street: clip-clip-clip. A woman held onto her hat against a gust of wind, her other hand firmly gripping that of a wrapped and cloaked and scarved and booted little boy. Lydia closed her eyes, took off her spectacles, wondered if the child she had lost last year would have been a girl or a boy.\u003c/p\u003e\n\u003cp\u003eDon’t think of that. It wasn’t meant to be.\u003c/p\u003e\n\u003cp\u003eThe wind rested, then flung handfuls of rain at the window again.\u003c/p\u003e\n\u003cp\u003eDon Simon . . .\u003c/p\u003e\n\u003cp\u003eNot that, either.\u003c/p\u003e\n\u003cp\u003eIt is only fascination.\u003c/p\u003e\n\u003cp\u003eHe said so himself.\u003c/p\u003e\n\u003cp\u003eShe pressed her fingers to the bridge of her nose.\u003c/p\u003e\n\u003cp\u003eVampires hunt by making you trust them. Why else would someone go down a dark alley with a complete stranger in the middle of the night?\u003c/p\u003e\n\u003cp\u003eThe sensation she had of breathlessness – of piercing grief – at the recollection of those calm yellow eyes, that soft voice and the cold touch of his hand, were no more than the reaction to a period of excitement and danger that had ended in tragedy.\u003c/p\u003e\n\u003cp\u003eLike Jamie, she would not be drawn back.\u003c/p\u003e\n\u003cp\u003eFor Jamie, it was different. He had sickened at the Department’s deceit, at its demand that he hold himself ready to harm anyone who came between himself and his duty, but she knew he was very good at what he did. She had never felt sure of her footing in the vampire’s presence, never known whether what she was doing was right or wrong.\u003c/p\u003e\n\u003cp\u003eIn the Department, Jamie said, it was always very clear. You had to keep yourself alive by whatever means you could, until whatever information you were seeking had been safely turned over to your chiefs. You didn’t look past that. It was why so many men, though they might hate what they did, could not imagine living in any other fashion.\u003c/p\u003e\n\u003cp\u003e‘You always have to be seen to be going where you’re going for a reason,’ he had explained to her once: the reason that she had surrounded her list of German blood-doctors with made-up persiflage about Uncle William’s fictitious Russian railway investments. In Russia, everyone’s letters were opened by the Secret Police, and no one thought anything about it. ‘Nine people out of ten aren’t going to ask themselves, What’s a Dutch philologist doing receiving letters from London? Or, Where does Herr Professor Leyden go when he disappears like that . . .? But that tenth person – or whoever he or she talks to – is the one who can get you killed.’\u003c/p\u003e\n\u003cp\u003eGet you killed.\u003c/p\u003e\n\u003cp\u003eJamie.\u003c/p\u003e\n\u003cp\u003eThat had been back in the days when she’d been a schoolgirl, visiting her uncle in Oxford and playing croquet with a small army of young gentlemen waiting with barely-concealed impatience for the heiress to the Willoughby Fortune to be brought ‘out’ so one or another of them could marry her and it . . .\u003c/p\u003e\n\u003cp\u003eAnd with one of her uncle’s scholastic colleagues, who turned out not to be nearly the dry middle-aged academic he appeared to be.\u003c/p\u003e\n\u003cp\u003eAfter her second meeting with him, she’d started making notes of his journeys and destinations, and comparing them with places mentioned in the newspapers. She had finally gotten up the nerve to ask him, as they’d hunted for a lost ball in the long grass by the river, ‘Professor Asher . . . are you a spy?’\u003c/p\u003e\n\u003cp\u003eHis eyes, when he’d looked swiftly sidelong at her – such surprisingly bright brown eyes – had registered no surprise.\u003c/p\u003e\n\u003cp\u003eIt was then – or maybe she’d known it already – that she’d understood that she loved him. Not as a schoolgirl, but as the woman she only just realized she would one day become.\u003c/p\u003e\n\u003cp\u003eDon Simon . . .\u003c/p\u003e\n\u003cp\u003e‘Ma’am?’ Ellen stood in the study doorway, a tray in her hands. ‘I’ve brought you a cup of tea, ma’am. You didn’t so much as touch your lunch.’\u003c/p\u003e\n\u003cp\u003e‘I’m so sorry.’ Lydia smiled, put her spectacles back on, and looked around rather vaguely for space on the desk.\u003c/p\u003e\n\u003cp\u003eEllen carried the tray to the occasional table by the fireplace, permitting herself a tiny sidelong grin of her own. She’d been the nursery maid at Willoughby Court and had spent a good portion of her life since that time wading after her mistress through a morass of books, papers, journals, discarded social invitations and milliners’ silk samples, trying to get her to remember to eat regular meals or go to bed on time.\u003c/p\u003e\n\u003cp\u003e‘Now, don’t you worry, ma’am.’ Ellen knelt to stir up the blaze – which, Lydia became aware, had sunk almost to ashes while she’d been sorting through the last of the information to prepare her report. ‘You know Mr James’s starts. He’ll find this cousin of his, never fear.’ That was the story they had given her. It had had to be a good one, for Asher to leave this close to the end of term. ‘No need to starve and worry yourself into a thread paper.’\u003c/p\u003e\n\u003cp\u003e‘No,’ agreed Lydia. ‘Of course not.’\u003c/p\u003e\n\u003cp\u003e‘I just wish that cousin – what was his name?’\u003c/p\u003e\n\u003cp\u003eLydia shook her head. She hadn’t her husband’s ability to keep track of long, consistent lies, and she knew better than to pull a name out of the air. Ellen’s memory was surprisingly good, and she was more observant than she seemed. ‘He told me, and I simply can’t remember right now.’\u003c/p\u003e\n\u003cp\u003e‘Harold, I think he said,’ provided Ellen, straightening up. ‘I just wish this Harold person hadn’t gone to some Godforsaken corner of the world . . . You remember how ill Mr James was, when he came back from Constantinople of all places . . . And as cold as it is, too. May I take that to the post for you, ma’am?’\u003c/p\u003e\n\u003cp\u003eLydia obediently handed her the letter and settled by the new-made fire, grateful for its warmth. Without her spectacles the blaze had a gently blurred light, comforting as the gray afternoon drew in.\u003c/p\u003e\n\u003cp\u003eShe remembered how ill Mr James had been when they’d come home from Constantinople, after the horrors of that city: after the death of the Master of Constantinople, and of the vampire couple who had been James’s friends.\u003c/p\u003e\n\u003cp\u003eGet you killed . . .\u003c/p\u003e\n\u003cp\u003eShe closed her eyes again. Saw Don Simon as she’d seen him first, in the dark of Horace Blaydon’s bricked-up cellar, a cool disheveled rescuer bending down to kiss her hand. I am at your service, Madame . . .\u003c/p\u003e\n\u003cp\u003eAnd later, when James had gone off into what she had belatedly realized was a trap, and she’d sought out the vampire in his crypt beneath his London house . . . The light of her lamp falling through the crypt bars, illuminating his long hand with its gold signet-ring in the shadows as he slept.\u003c/p\u003e\n\u003cp\u003eShe loved James, as strongly and fiercely as ever. James was real – the man in whose arms she lay at night. The father of the child she hadn’t borne. The man who’d wept beside her in that awful darkness of loss, when she herself had not been able to weep.\u003c/p\u003e\n\u003cp\u003eSimon . . .\u003c/p\u003e\n\u003cp\u003eWhat I feel for him isn’t love . . .\u003c/p\u003e\n\u003cp\u003eThen why does it hurt so much?\u003c/p\u003e\n\u003cp\u003eBoth James and Don Simon had told her that vampires could tamper with the minds of their victims, with their perceptions and their dreams. She had seen how Ysidro – the oldest and strongest of the London vampires – had searched the dreams of that great city, when he had found himself seeking a female companion for Lydia who would be willing to drop her livelihood and her hopes of ever finding another position, at twenty-four hours’ notice, and leave the country to meet in Paris a woman she didn’t know . . .\u003c/p\u003e\n\u003cp\u003eShe had seen how he had insinuated himself into Margaret Potton’s dreams, not asking her, but making her believe that it was a sacrifice she wished to make.\u003c/p\u003e\n\u003cp\u003eBecause Margaret Potton loved him.\u003c/p\u003e\n\u003cp\u003eBecause he made her love him. He had seen the image of romance in her dreams and had clothed himself in those garish melodramatic hues.\u003c/p\u003e\n\u003cp\u003eFor three nights now – since Jamie had gone away – Lydia had dug through her medical journals, checking names, checking facts, checking letter columns for addresses . . . only so that she would not dream of Margaret Potton lying dead and bloodless on her bed.\u003c/p\u003e\n\u003cp\u003eOr at least cut down the number of hours per night that she did.\u003c/p\u003e\n\u003cp\u003eHer heart had screamed at him, across Margaret’s body, How could you? But her mind told her, with simple matter-of-factness, How could he not?\u003c/p\u003e\n\u003cp\u003eHe was a vampire. Because she, Lydia, had insisted that she would not accept his protection unless he abstained from killing – abstained from the psychic feeding on his victims’ death from which he derived his own mental powers of illusion – he had been starving. And poor besotted Margaret had told him more than once that she was his to use as he pleased, even unto death.\u003c/p\u003e\n\u003cp\u003eThat was love.\u003c/p\u003e\n\u003cp\u003eWhy do I care?\u003c/p\u003e\n\u003cp\u003eWhy do I hurt?\u003c/p\u003e\n\u003cp\u003eWhy do I hurt so BADLY?\u003c/p\u003e\n\u003cp\u003eThe memories of all those nights of talk – over cards, over bank ledgers, over the investigation they had done together; in train carriages, in the latticed window-bay of a house in Constantinople, in the fog before the skeletal black-and-white stones of the Vienna cathedral – they should be nothing.\u003c/p\u003e\n\u003cp\u003eThat sense she had had of dealing not with a vampire, but with a man – wry and clever, brilliant and maddening, a scholar and a sometime poet and an observer of three and a half mortal centuries of folly – would not leave her, and the intensity of it filled her with shame.\u003c/p\u003e\n\u003cp\u003eNone of it is true. It’s only another illusion. He is no more than the cast chrysalis of his former shape. There was nothing inside him but darkness and the hunger for another’s death.\u003c/p\u003e\n\u003cp\u003eIt is our lure to be attractive. It is how we hunt, he had said to James. It means nothing . . .\u003c/p\u003e\n\u003cp\u003eShe wondered why the knowledge didn’t make her hurt less.\u003c/p\u003e\n\u003cp\u003eEllen’s heavy tread in the hall. Lydia sat up quickly, realizing with a start that it was dark, her untouched tea was stone cold, and that she had done nothing for three days about the article for Lancet, which was due on Thursday . . .\u003c/p\u003e\n\u003cp\u003e‘Here we are, ma’am,’ said her handmaiden proudly and held out an envelope to her, smudged and dirty and dotted with Dutch stamps. ‘I told you he’d be well.’\u003c/p\u003e\n\u003cp\u003eRotterdam\u003c/p\u003e\n\u003cp\u003e4 April, 1911\u003c/p\u003e\n\u003cp\u003eBest Beloved,\u003c/p\u003e\n\u003cp\u003eAll well so far.\u003c/p\u003e\n\u003cp\u003eJ.\u003c/p\u003e\n\u003cp\u003eLydia put on her spectacles, checked the date, then went to the globe in the corner – she never could remember where all those little countries were, between France and Germany. He must have written this in the train station (the paper certainly looked like something one would find in a public waiting-room!), before boarding the train that would take him into Germany.\u003c/p\u003e\n\u003cp\u003eShe made herself beam for Ellen, but when Ellen was gone she read the note again, then took off her spectacles and sat for some time in the amber gloom.\u003c/p\u003e\n\u003cp\u003eShe did not believe in a God of miracles.\u003c/p\u003e\n\u003cp\u003eIt was as unreasonable to pray for one as it would have been, for instance, to feel love for a man who to her certain knowledge had personally murdered – at the lowest possible computation – well over thirty thousand men, women, and children, one at a time, presuming the abstemious rate of two per week for three hundred and fifty-six years . . .\u003c/p\u003e\n\u003cp\u003eGod, please bring him home safe . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-maidens-james-asher-3/page-5.html","bookId":2491,"creation":"Oct 5, 2019 10:44:23 PM","modification":"Oct 5, 2019 10:44:23 PM"}
