{"id":88921,"no":16,"title":"Page 16","content":"\u003cp\u003eJack dropped her recorder on the table next to him, pushed the ottoman farther from the sofa to accommodate his long legs, then sat back and put his feet up. Sophie wouldn’t have been surprised if he’d picked up her TV remote control and asked for a beer.\u003c/p\u003e\n\u003cp\u003e“I’m doing one last favor for Alec before I head to the ocean.”\u003c/p\u003e\n\u003cp\u003e“How long is your vacation?”\u003c/p\u003e\n\u003cp\u003e“It’s not a vacation. It’s a leave of absence.” His answer was abrupt, impatient.\u003c/p\u003e\n\u003cp\u003e“Is that good or bad?”\u003c/p\u003e\n\u003cp\u003e“Depends.”\u003c/p\u003e\n\u003cp\u003e“What beach do you have in mind?”\u003c/p\u003e\n\u003cp\u003e“Don’t know what beach yet. Someplace warm, though.”\u003c/p\u003e\n\u003cp\u003e“What was the favor Alec wanted? He could have sent a messenger with the recorder.”\u003c/p\u003e\n\u003cp\u003e“I have to listen to the interview.”\u003c/p\u003e\n\u003cp\u003eHe put his hand up when he saw she was going to object and said, “Detective Steinbeck told Alec he’d already listened to it, but when pressed, admitted he had trouble paying attention. Said that the guy you were interviewing…what’s his name?”\u003c/p\u003e\n\u003cp\u003e“Harrington. William Harrington.”\u003c/p\u003e\n\u003cp\u003e“Okay, so Steinbeck said it was a real dry interview…”\u003c/p\u003e\n\u003cp\u003eHer back stiffened. “I beg to differ. I don’t do dry interviews.”\u003c/p\u003e\n\u003cp\u003eJack continued as though she hadn’t interrupted. “Steinbeck said Harrington droned on and on in a monotone voice.”\u003c/p\u003e\n\u003cp\u003eSophie nodded. True. Harrington had droned on and on.\u003c/p\u003e\n\u003cp\u003e“The police are investigating anyone you may have come in contact with in the days before the shooting and Alec thought one of us should listen to it just in case there was some connection.”\u003c/p\u003e\n\u003cp\u003e“He just talks about 5K races he’s won.”\u003c/p\u003e\n\u003cp\u003e“How many 5K races?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “Twenty-four. Are you sure you want to listen?”\u003c/p\u003e\n\u003cp\u003e“I’m here, aren’t I?”\u003c/p\u003e\n\u003cp\u003e“I could tell you about it.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. She tapped her foot impatiently while deciding what to do. Then she gave in. “Fine. You may listen to the interview.”\u003c/p\u003e\n\u003cp\u003e“Sophie, I wasn’t asking for permission. I’m gonna listen to it. I can do it here, or I’ll take the recorder and listen to it at my place.”\u003c/p\u003e\n\u003cp\u003e“Okay, listen to it here.”\u003c/p\u003e\n\u003cp\u003e“You want to start now?”\u003c/p\u003e\n\u003cp\u003e“Not yet. We’ll wait until Mr. Bitterman gets here. He probably won’t want to listen to the interview, but I should give him the choice. And please, don’t interfere when I’m talking to him about an article I want to write. You’ll want to interfere, but try and restrain yourself.”\u003c/p\u003e\n\u003cp\u003e“Why would I want to interfere?”\u003c/p\u003e\n\u003cp\u003eShe sighed. “The polar bear.”\u003c/p\u003e\n\u003cp\u003e“Polar bear? You want to write about a polar bear?”\u003c/p\u003e\n\u003cp\u003e“Not exactly about the bear. His name is Barry, by the way.”\u003c/p\u003e\n\u003cp\u003eHe flashed a smile. “Sounds like you’re writing a kid’s book.”\u003c/p\u003e\n\u003cp\u003e“Only if my intention was to scar them for life,” she said.\u003c/p\u003e\n\u003cp\u003e“Say my name, Sophie, or I worry I might just have to interfere.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to call you by your first name because I don’t want to get that friendly.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Yes, you do. It’s okay. I want to get friendly, too.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, you don’t. You don’t like me.”\u003c/p\u003e\n\u003cp\u003e“I don’t have to like you to get friendly with you.”\u003c/p\u003e\n\u003cp\u003eShe had no idea what to say now, and so, feeling a bit like a coward, she retreated to the kitchen.\u003c/p\u003e\n\u003cp\u003e“Grab me a root beer,” he called out.\u003c/p\u003e\n\u003cp\u003e“Absolutely not,” she called back. “The root beer’s for Mr. Bitterman.”\u003c/p\u003e\n\u003cp\u003eHe decided to join her in the galley kitchen.\u003c/p\u003e\n\u003cp\u003e“Word on the street is that you’ve got a whole closet full of Kelly’s.”\u003c/p\u003e\n\u003cp\u003eThe pipeline from Cordie to Jack needed to be plugged.\u003c/p\u003e\n\u003cp\u003e“You may have a Coke, a Pepsi, diet sodas, or water.”\u003c/p\u003e\n\u003cp\u003eHe had to check out the refrigerator himself before making a decision. He finally settled on a can of Diet Coke, then went to the cabinets to find something to snack on.\u003c/p\u003e\n\u003cp\u003eShe tried to push rice cakes on him. Regan had gotten them for her at the grocery store, but Sophie didn’t like them. What she did like was kettle chips, and so, of course, that was the snack Jack wanted.\u003c/p\u003e\n\u003cp\u003e“Just because Alec can go through my cabinets doesn’t mean you can.”\u003c/p\u003e\n\u003cp\u003eHe’d already opened the bag and was chewing on a chip. “You aren’t being a very gracious hostess. What are we having for dinner?”\u003c/p\u003e\n\u003cp\u003eHer response wasn’t clever. She sputtered.\u003c/p\u003e\n\u003cp\u003e“Use your words, Sophie. Use your words,” he drawled as he strolled back to the sofa.\u003c/p\u003e\n\u003cp\u003eShe wanted to use a meat cleaver. Good thing she didn’t own one. While she enjoyed a few other murderous thoughts, she got a cold soda out of the refrigerator, took a couple of deep breaths, and then went to join him.\u003c/p\u003e\n\u003cp\u003e“I’ve been injured. I’m not cooking dinner tonight.”\u003c/p\u003e\n\u003cp\u003e“From the looks of your kitchen, I’m guessing you don’t cook at all.”\u003c/p\u003e\n\u003cp\u003e“Of course I cook.”\u003c/p\u003e\n\u003cp\u003e“Yeah? The price tags and stickers are still on your pots and pans, or rather, your pot and pan. Didn’t see any lids.”\u003c/p\u003e\n\u003cp\u003eShe sat down next to him, reached across his lap, and grabbed a handful of chips. “I microwave.”\u003c/p\u003e\n\u003cp\u003eHe abruptly changed the subject. “When’s your boss getting here?”\u003c/p\u003e\n\u003cp\u003eShe checked the time on his watch and said, “He should be here now.”\u003c/p\u003e\n\u003cp\u003e“How long is the recording?”\u003c/p\u003e\n\u003cp\u003e“A couple of hours, maybe a little more. Why?”\u003c/p\u003e\n\u003cp\u003e“I want to be in bed by ten.”\u003c/p\u003e\n\u003cp\u003e“Ten, huh? You don’t look ninety. Must be all that sleep you’re getting?”\u003c/p\u003e\n\u003cp\u003eMr. Bitterman didn’t show up until almost an hour later. It was odd, but sitting with Jack while they waited wasn’t at all uncomfortable. He wasn’t hesitant to answer questions about his background, where he grew up, where he went to college, and how, after graduating from law school, he had decided to become an FBI agent instead of joining a law firm.\u003c/p\u003e\n\u003cp\u003e“Tell me why you’re taking a leave of absence. Burn out?” she asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Shoot someone you shouldn’t have?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Mental problems? That’s a yes, isn’t it?”\u003c/p\u003e\n\u003cp\u003eHe smiled. “No.”\u003c/p\u003e\n\u003cp\u003e“Then what?” She nudged him in his side. She was as tenacious as he was.\u003c/p\u003e\n\u003cp\u003e“It’s a forced leave of absence.”\u003c/p\u003e\n\u003cp\u003e“Now that’s interesting.”\u003c/p\u003e\n\u003cp\u003eShe waited for him to explain, and when he kept silent, she pressed again. “You know I’m going to ask. What did you do?”\u003c/p\u003e\n\u003cp\u003eHe reluctantly told her about the YouTube video. Once he’d finished explaining, he added, “You’re probably the only person in Chicago who hasn’t watched the damned thing.”\u003c/p\u003e\n\u003cp\u003e“The video. That’s right. Regan and Cordie told me to watch it, but I forgot.”\u003c/p\u003e\n\u003cp\u003e“Until something more interesting gets filmed, I’m being hounded by the press. At first the higher-ups wanted me to lay low in Chicago, but this isn’t going away. Now they want me out of town, so I’m heading to an ocean until this blows over.” He shook his head as he added, “I guess I know what it must be like for you every time your father’s in the news.”\u003c/p\u003e\n\u003cp\u003eSophie didn’t want the conversation to get anywhere near her father, and so she steered him away with a couple of other personal questions. The only topic he was reluctant to discuss was his love life. He admitted he’d never been married, but when she asked him if he’d ever come close, he changed the subject.\u003c/p\u003e\n\u003cp\u003e“Now it’s my turn,” he said. “Let’s talk about your father.”\u003c/p\u003e\n\u003cp\u003e“Let’s not.”\u003c/p\u003e\n\u003cp\u003eHe didn’t push. “I’d ask about your background, but I don’t need to. I know all about you.” He then proceeded to prove it.\u003c/p\u003e\n\u003cp\u003eWhen she thought he had finished, she said, “You read my file.”\u003c/p\u003e\n\u003cp\u003e“I know a whole lot more that isn’t in your file.”\u003c/p\u003e\n\u003cp\u003e“Like what?” she asked suspiciously.\u003c/p\u003e\n\u003cp\u003e“Like you work hard to make people think you’re superficial.”\u003c/p\u003e\n\u003cp\u003e“I am superficial.” She protested even as she realized how ridiculous she sounded.\u003c/p\u003e\n\u003cp\u003eHe laughed. “It’s your protection, isn’t it? The only people who know the real you are Regan and Cordie, and maybe Regan’s brothers.”\u003c/p\u003e\n\u003cp\u003e“I don’t hide who I am.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do.” His voice softened as he added, “I’ve done a little checking, and I’ve got you all figured out, Sophie Rose.”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003eHe nodded. “You’re always saving for a new purse, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“I like purses.” Jeez, she sounded defensive.\u003c/p\u003e\n\u003cp\u003e“You don’t actually buy the purses, though, do you? You pick out the one you want, save enough to buy it—and I’ve heard some of them are way up there in price—and then you give the money to a two-hundred-forty-pound muscle man named Muffin, who runs a soup kitchen. It’s become a game you and Muffin play. You send a photo of the purse in an envelope along with the cash.”\u003c/p\u003e\n\u003cp\u003e“You don’t know what you’re talking about. I’m going to buy a Birkin.”\u003c/p\u003e\n\u003cp\u003e“That’s several thousand, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“I am going to buy the Birkin,” she insisted. “Would I go to visit it every Wednesday at five p.m. if I weren’t? It’s a gorgeous buttery tan with gold markings.”\u003c/p\u003e\n\u003cp\u003eHe looked exasperated. “No, you’re not going to buy it. What you’re going to do is save the money and then give the money away. You do a lot of nice things you don’t want anyone to know about, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe started to protest again, but he stopped her. “Give it up, Sophie. You’re not an artificial, money-hungry, label-loving dimwit. Sorry, sweetheart. It just doesn’t fly with me.”\u003c/p\u003e\n\u003cp\u003eSophie was squirming in the hot seat, but Mr. Bitterman saved the day when he knocked on the door. She had never felt such relief. She hated that Jack knew so much about her. Why had he gone to the trouble to find out her secrets? Why was he interested? What was he up to? Her father. That was it. He wouldn’t be looking into her history and her behavior if he weren’t hunting for something about her father.\u003c/p\u003e\n\u003cp\u003eBitterman handed her his coat. Tugging off his tie on his way into the living room, he sat down hard in an easy chair. While he and Jack discussed the attempted murder investigation—her attempted murder investigation—she hung his coat in the closet and went into the kitchen to get him a cold root beer.\u003c/p\u003e\n\u003cp\u003eBitterman was rolling up his sleeves as he asked Jack, “So no progress on the case at all? No leads?”\u003c/p\u003e\n\u003cp\u003e“That’s what Detective Steinbeck is telling me,” Jack said.\u003c/p\u003e\n\u003cp\u003eBitterman pointed a finger at Sophie. He took the root beer she offered but held on to his frown. “Then you’re sitting tight, young lady. I don’t want you running in the streets while there’s some trigger-happy nutcase on the loose.”\u003c/p\u003e\n\u003cp\u003e“Sir, I don’t run in the streets, and as far as sitting tight…I asked you to come over to talk about something important.” Without thinking, Sophie crossed to the sofa and sat down next to Jack. Bitterman noticed.\u003c/p\u003e\n\u003cp\u003e“Before this conversation turns to business matters, I have to ask you how you were able to get so much root beer,” her boss asked. “I thought I’d nabbed the last case in Chicago.”\u003c/p\u003e\n\u003cp\u003eShe glanced at Jack. He was trying not to laugh. “Yeah, Sophie, how’d you do it?”\u003c/p\u003e\n\u003cp\u003eHer thoughts flashed back to the meat cleaver.\u003c/p\u003e\n\u003cp\u003e“Actually, sir, I was desperate to get you to come over so I could talk to you, and I might have exaggerated the exact amount of root beer on hand.”\u003c/p\u003e\n\u003cp\u003eBitterman leaned forward. “You might have exaggerated?” he asked warily.\u003c/p\u003e\n\u003cp\u003eShe looked him in the eyes. “I did exaggerate. I don’t have a closet full of root beer. Just a couple of bottles. That’s all.”\u003c/p\u003e\n\u003cp\u003e“In other words, she lied,” Jack was happy to interject.\u003c/p\u003e\n\u003cp\u003eSophie gave him a look that should have withered him but didn’t. She didn’t want Mr. Bitterman to dwell on his disappointment so she quickly tried to turn his attention to a more important matter.\u003c/p\u003e\n\u003cp\u003e“Sir, do you remember William Harrington and the 5K race?”\u003c/p\u003e\n\u003cp\u003e“Sure, I remember. He changed his mind at the last minute and didn’t run the race, right? You told me it was because he knew he couldn’t win.”\u003c/p\u003e\n\u003cp\u003e“That’s what I thought, but it turned out I was wrong. That wasn’t the reason he didn’t run.”\u003c/p\u003e\n\u003cp\u003eBitterman looked around the room. “Seriously, there isn’t more root beer?”\u003c/p\u003e\n\u003cp\u003e“Sir, what I’m trying to tell you is important.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “All right. So what was the guy’s reason for not running?”\u003c/p\u003e\n\u003cp\u003e“He died.”\u003c/p\u003e\n\u003cp\u003eBitterman took a few seconds to absorb the information, then said, “What a shame. He was a young man, wasn’t he? He had to be young to run all those races. I suppose dying is just about the best reason there is not to run a race. Where’d it happen?”\u003c/p\u003e\n\u003cp\u003e“In Alaska,” she answered. “He died in Alaska.”\u003c/p\u003e\n\u003cp\u003eFrom her tone, Bitterman knew something more was coming. He set his root beer on the coffee table and sat back. “He did, did he?”\u003c/p\u003e\n\u003cp\u003e“A polar bear ate him.”\u003c/p\u003e\n\u003cp\u003e“What’s this?” he asked, confused. “What did you say?”\u003c/p\u003e\n\u003cp\u003eShe repeated the terrible news, and Jack chimed in at the end. “Barry ate him.”\u003c/p\u003e\n\u003cp\u003e“My God, they named the polar bear that ate a man? That’s awful callous.”\u003c/p\u003e\n\u003cp\u003e“No, sir. He already had a name.”\u003c/p\u003e\n\u003cp\u003eNow to the tricky part. Sophie had to convince Mr. Bitterman to let her investigate the story, and if necessary, send her to Alaska without making him think she might be in danger. Her boss was overly cautious about her. She hadn’t quite rehearsed what she was going to say, but she thought she did a great job of piquing his interest and not hinting at anything other than a human interest story idea.\u003c/p\u003e\n\u003cp\u003eThen Jack started asking hard questions about living conditions, the wild animals, and the harsh climate—all questions she didn’t want to answer in front of her boss. Sophie poked him in his side with her elbow. “We can talk about this later, Jack. Remember, you weren’t going to interfere.”\u003c/p\u003e\n\u003cp\u003e“The danger of—”\u003c/p\u003e\n\u003cp\u003eShe interrupted. “I know, it’s terribly cold up there, but I’ll wear the appropriate clothing.” \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ice-buchanan-renard-7/page-16.html","bookId":1830,"creation":"Oct 5, 2019 5:32:02 PM","modification":"Oct 5, 2019 5:32:02 PM"}
