{"id":88925,"no":20,"title":"Page 20","content":"\u003cp\u003eShe shook her head. “No, you aren’t going to be taking a leave. You’re going to be working. Your new assignment is Ms. Rose, and she will be your sole responsibility. I don’t want anything to happen to that young woman. Now, I’ll bet you’re wondering why I’m so interested in keeping her alive, aren’t you? For one, she’s a U.S. of A. citizen, and we’ve taken an oath to protect our U. S. of A. citizens. For another, her father. That’s right. She can give me Bobby Rose.”\u003c/p\u003e\n\u003cp\u003eMaybe in your dreams, Jack thought. “Sophie’s extremely loyal to her father,” he said instead. “She’s not about to hand him over to anyone.”\u003c/p\u003e\n\u003cp\u003ePittman tossed the DVD to Jack. “Put that in the player for me.”\u003c/p\u003e\n\u003cp\u003eThe television sat on the credenza behind her desk. Jack did as she requested while she pushed her chair back.\u003c/p\u003e\n\u003cp\u003e“I understand she’s loyal. She’s his daughter, and she loves him, right?”\u003c/p\u003e\n\u003cp\u003eShe didn’t even give him time to start the silent counting ritual.\u003c/p\u003e\n\u003cp\u003e“Of course she does. Bobby Rose isn’t a wanted man, not at the moment anyway. I would just like to have a visit with him.”\u003c/p\u003e\n\u003cp\u003eYeah, right. A visit. Pittman was too smart to think Bobby Rose would say something incriminating. What else did she have in mind?\u003c/p\u003e\n\u003cp\u003eShe was now searching through the desk drawers looking for the remote that controlled the DVD player.\u003c/p\u003e\n\u003cp\u003e“He’s been a person of interest too many times to count, and he did spend some time in a holding cell years ago. Couldn’t keep him there, though. Lack of evidence. Every time, it came down to lack of evidence. Of course, there’s also the fact that Rose is probably the most brilliant lawyer I’ve ever run across.”\u003c/p\u003e\n\u003cp\u003eShe located the remote in the center drawer crammed behind a manual, picked it up, and waved Jack back to the chair facing her desk.\u003c/p\u003e\n\u003cp\u003e“We have had our differences with Mr. Rose.”\u003c/p\u003e\n\u003cp\u003eJack wanted to laugh. Differences? Various government agencies had been trying for years to put Bobby Rose behind bars.\u003c/p\u003e\n\u003cp\u003e“He’s a bloodhound,” she said, nodding. “That man can sniff out money these criminals think they can keep for themselves. It doesn’t matter where they hide it; he finds it.”\u003c/p\u003e\n\u003cp\u003e“Then he hides it and keeps it,” he pointed out.\u003c/p\u003e\n\u003cp\u003e“Yes, he does, but we can’t prove that, can we?” She almost sounded as though she admired him.\u003c/p\u003e\n\u003cp\u003eShe rolled back in her chair and turned the player on. “Bobby sent this DVD for us. The DVD was delivered by messenger service, and when questioned the young man said he picked it up at the front desk of the Hamilton Hotel. No one behind the desk knows how the package got there. The beginning is from the local newscast two nights ago.”\u003c/p\u003e\n\u003cp\u003eShe pushed Play and the overly cheerful voice of a perky newscaster came on.\u003c/p\u003e\n\u003cp\u003e“And now for an update on the closing of Chicago’s beloved root beer company. The bitter accusations are mounting, aren’t they, Tom?”\u003c/p\u003e\n\u003cp\u003eThe screen flashed to Meredith Devoe and her attorney standing in front of the courthouse.\u003c/p\u003e\n\u003cp\u003e“I’m thankful my father isn’t alive to see this. My soon-to-be-ex-husband has destroyed his company. My father trusted him,” she cried. She paused to dab at her eyes with a tissue before continuing. “He invested the employees’ retirement money in a risky stock fund. The values were overinflated, and now all is lost. Kevin Devoe should be behind bars because of his stupidity.”\u003c/p\u003e\n\u003cp\u003eThe reporter asked Meredith when she had last spoken to her husband.\u003c/p\u003e\n\u003cp\u003e“I have not exchanged one word with him since I filed for divorce, and I hope I never have to speak to him again.”\u003c/p\u003e\n\u003cp\u003eThe attorney stepped forward to add his two cents. “My client is penniless, thanks to Kevin Devoe’s irresponsible behavior. He gambled and lost everything they owned.”\u003c/p\u003e\n\u003cp\u003eJack frowned at the DVD player. “Then who’s paying the attorney bills?” he asked.\u003c/p\u003e\n\u003cp\u003e“I’d like an answer to that question as well,” Pittman agreed.\u003c/p\u003e\n\u003cp\u003eThe screen went black, and a second later Kevin Devoe was being interviewed.\u003c/p\u003e\n\u003cp\u003e“I have done nothing wrong. Those stock numbers were inflated, yes, but all the reports indicated they were sound investments. It was Bobby Rose who drove the price up. He got his money out and let the house of cards fall. If anyone should be taken to task, it’s him.”\u003c/p\u003e\n\u003cp\u003eWhen asked how he felt about his wife’s accusations, he responded, “She’s a fool. Her father, Kelly, had faith in me. He was a good man, but his daughter…well, let’s just say she’s a hard, angry woman. I don’t know what I ever saw in her.”\u003c/p\u003e\n\u003cp\u003ePittman hit Pause, capturing and freezing Kevin Devoe’s sneer.\u003c/p\u003e\n\u003cp\u003e“Note the date and time at the bottom of the next frame.”\u003c/p\u003e\n\u003cp\u003eShe pushed the Play button again. The next scene was a dark building that looked like a warehouse. A light hung above the single side door. A beat-up old Ford pickup entered the frame and pulled across the gravel parking lot to stop at the door. The date was yesterday; the time, 3:10 a.m. A man wearing a hoodie got out of the truck. He kept his head down until he heard a faint whistle. When he turned toward the light, his face was visible. Kevin Devoe. No doubt it was him. The door flung open as he rushed to it, and there, waiting with open arms in an open trench coat and little else, was Meredith Devoe. The greeting was hot and heavy.\u003c/p\u003e\n\u003cp\u003e“Guess this can’t be shown on the six o’clock news,” Pittman remarked.\u003c/p\u003e\n\u003cp\u003e“Maybe the porno channel,” Jack replied.\u003c/p\u003e\n\u003cp\u003eThe screen went dark and Pittman spun her chair around, emptying the rest of the envelope’s contents onto the desk. “Bobby Rose also sent us statement copies of three accounts, all with rather large sums of money. The accounts were under fake names, but our people checked. The money belonged to the Devoes…and you’ll notice I said belonged. The money was in the accounts, but it’s gone now. We tracked it as far as we could, and the only thing we’re sure of is that the Devoes didn’t withdraw it. However, I rather doubt either one of them will report it stolen.\u003c/p\u003e\n\u003cp\u003e“I think the Devoes have been squirreling away Kelly’s money for years, enough to tide them over until they can get to the big money: the retirement savings. If they play the victim and cry that they’re penniless, people are less likely to accuse them of having anything to do with the lost retirement money. Those investment funds were stripped, all right, and I don’t think Bobby Rose had anything to do with it. Maybe I’m being naïve, but my guess is that Bobby Rose emptied these accounts and knows exactly where the retirement money is.”\u003c/p\u003e\n\u003cp\u003eJack thumbed through the stack of account statements. “You’re sure all of this came from Bobby Rose?” he asked.\u003c/p\u003e\n\u003cp\u003e“Positive,” Pittman said. She picked up a folded card and handed it to him. “This came with the video and the records.”\u003c/p\u003e\n\u003cp\u003eThe card read: More to come. Bobby Rose.\u003c/p\u003e\n\u003cp\u003ePittman continued. “If history has shown us anything, it’s that Bobby Rose doesn’t let innocent people suffer. He’s got something up his sleeve, and we’re going to let this play out. And we’re also going to do right by his daughter, like we should have from the beginning. Plus, Rose will be grateful that we’re watching out for her.”\u003c/p\u003e\n\u003cp\u003eJack nodded. “I’ll protect her.”\u003c/p\u003e\n\u003cp\u003e“See that you do,” Pittman ordered. “Jennifer has your schedule. Oh, and Agent MacAlister, one last thing…”\u003c/p\u003e\n\u003cp\u003eJack stopped at the door. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Watch out for polar bears.”\u003c/p\u003e\n\u003cp\u003eJOURNAL ENTRY 516\u003c/p\u003e\n\u003cp\u003eCHICAGO\u003c/p\u003e\n\u003cp\u003eWe have become masters of deception. Eric has a few friends from his old neighborhood who are willing to do anything for the right price. One of them has secured three healthy monkeys for us.\u003c/p\u003e\n\u003cp\u003eWe had come up with an elaborate lie to tell Eric’s friend, but he was only interested in the money and didn’t care what we did with the animals.\u003c/p\u003e\n\u003cp\u003eHe might come in handy in the future.\u003c/p\u003e\n\u003cp\u003eTWENTY-TWO\u003c/p\u003e\n\u003cp\u003eSOPHIE FOUND OUT JACK WAS GOING TO ALASKA WITH HER when he showed up at her door and told her so.\u003c/p\u003e\n\u003cp\u003eWhen the doorbell rang, she had assumed it was Gil. He had said he would be checking on her before she left for Alaska. He was such a nice man, he even offered to drive her to the airport tomorrow afternoon. She appreciated the kind gesture, but she suspected that at least part of his motivation was penance for squealing on her. Who hadn’t he told that she was heading to Alaska?\u003c/p\u003e\n\u003cp\u003eGil and his posse, as he liked to call his team, were still taking turns watching out for her. As long as the shooter was on the loose, Gil and his friends would be bodyguards. Alec and Aiden insisted on it. It was pointless to argue because they were going to do what they were going to do whether Sophie approved or not. Thankfully, once she was on the plane and away from Chicago, Gil’s services wouldn’t be needed.\u003c/p\u003e\n\u003cp\u003eShe should have looked through the peephole before she opened the door.\u003c/p\u003e\n\u003cp\u003e“You’re early—You’re not Gil.”\u003c/p\u003e\n\u003cp\u003eJack looked exasperated. “No, I’m not. Move out of my way, Sophie.”\u003c/p\u003e\n\u003cp\u003eShe automatically stepped back, allowing him entrance—another dumb move. It would be easier to tell him to go away if he were in the hall.\u003c/p\u003e\n\u003cp\u003e“I’m going to Alaska with you,” he matter-of-factly informed her.\u003c/p\u003e\n\u003cp\u003eIt took a couple of seconds for the announcement to settle. Reeling from the surprise, she protested, “What? No! You’re not going.”\u003c/p\u003e\n\u003cp\u003e“Sorry, sweetheart,” he replied. “I am, and that’s final.”\u003c/p\u003e\n\u003cp\u003eDropping his duffel bag in the foyer, he walked past her. She caught the scent of his aftershave. Very appealing…musky and masculine.\u003c/p\u003e\n\u003cp\u003eNot relevant! her mind screamed. “You hate cold weather,” she said aloud.\u003c/p\u003e\n\u003cp\u003e“Sure do.”\u003c/p\u003e\n\u003cp\u003e“Then why—”\u003c/p\u003e\n\u003cp\u003e“I’m going, Sophie. Deal with it.”\u003c/p\u003e\n\u003cp\u003eDeal with it? I don’t think so. “I’m perfectly capable of traveling by myself,” she argued. “I don’t want anyone to go with me.”\u003c/p\u003e\n\u003cp\u003eHe tossed his heavy sheepskin coat on the back of her sofa. He was wearing a T-shirt that showed off his muscular arms and chest, and a pair of jeans that looked as though they’d been purchased at the fifth-hand store. Did the jerk have to be so…built?\u003c/p\u003e\n\u003cp\u003e“Want and need are two completely different things,” he answered as he settled into an easy chair, kicked off his shoes, and reached for the television remote. “I sure don’t want to go with you, but here I am.”\u003c/p\u003e\n\u003cp\u003eShe took a tentative step forward. “You’ll just get in my way.”\u003c/p\u003e\n\u003cp\u003e“I probably will, but I’m still going. What channel is the Food Network on?”\u003c/p\u003e\n\u003cp\u003e“What…the food…?”\u003c/p\u003e\n\u003cp\u003e“Never mind, I’ll find it. You look a little confused. Have you packed yet?”\u003c/p\u003e\n\u003cp\u003eSophie continued standing in the foyer, stunned. “No…I’ll pack tomorrow. I don’t leave until late afternoon. Why is your duffle here?”\u003c/p\u003e\n\u003cp\u003e“Our plans have changed, Sophie.”\u003c/p\u003e\n\u003cp\u003eShe ran her fingers through her hair. “Our plans? We don’t have any plans.”\u003c/p\u003e\n\u003cp\u003e“Sure we do,” he said cheerfully. “We’re leaving on a seven a.m. flight to Fairbanks, which is why I’m spending the night.”\u003c/p\u003e\n\u003cp\u003eThis announcement sent her rushing into the living room. “That can’t be. I’m flying out tomorrow afternoon. I’ve already paid for my ticket.”\u003c/p\u003e\n\u003cp\u003eShe stopped in front of the television, blocking his view. He motioned for her to move to the left.\u003c/p\u003e\n\u003cp\u003e“Ah, here it is,” he said. “Bobby Flay is doing paella. I’ve always wanted to know how to make it.” He added, “The transaction was voided.”\u003c/p\u003e\n\u003cp\u003eShe tried to clear her head. “It’s a nonrefundable ticket.”\u003c/p\u003e\n\u003cp\u003e“I work for the FBI, Sophie. When I tell you the charge was erased, you can believe me.”\u003c/p\u003e\n\u003cp\u003eStill incredulous, she asked, “Who changed my reservation?”\u003c/p\u003e\n\u003cp\u003eShe shifted from one foot to the other with her hands on her hips; her elbow blocking his view. Once again he motioned for her to move. She complied without thinking.\u003c/p\u003e\n\u003cp\u003e“Jennifer,” he answered. “She made the reservations. Ah, man, look at that food processor. I’ve got to get one of those.”\u003c/p\u003e\n\u003cp\u003e“Jennifer who?” Sophie’s frustration was brimming over.\u003c/p\u003e\n\u003cp\u003e“I don’t know her last name.”\u003c/p\u003e\n\u003cp\u003e“Of course you do.”\u003c/p\u003e\n\u003cp\u003e“No, I really don’t.”\u003c/p\u003e\n\u003cp\u003eSophie took a deep breath. This was maddening. None of it made any sense. She decided to approach the situation rationally. “Even if for some reason I have to take an earlier flight, there’s absolutely no reason for you to come along, and there’s certainly no reason for you to stay here tonight.”\u003c/p\u003e\n\u003cp\u003e“Oh yes there is,” he countered. “If we’re going to make it to the airport on time, we’ll need to be out of bed by four-thirty a.m.”\u003c/p\u003e\n\u003cp\u003e“I’m not sleeping with you.”\u003c/p\u003e\n\u003cp\u003e“Yeah, okay,” he said, never taking his eyes off the television as he watched Bobby Flay toss clams and lobster claws into the pan.\u003c/p\u003e\n\u003cp\u003e“Just like that? Okay? No argument?” She was appalled by the disappointment she heard in her own voice.\u003c/p\u003e\n\u003cp\u003e“No argument,” he said. “If you change your mind, let me know.”\u003c/p\u003e\n\u003cp\u003eWithout a word, Sophie went to her linen closet and pulled out a thick down comforter and pillow. After dumping them on the sofa, she said, “This discussion isn’t over,” then headed to her bedroom and shut the door.\u003c/p\u003e\n\u003cp\u003eShe needed time to think. Why would Jack want to go to Alaska? He hated the cold. Alec had something to do with this; she was sure of it. She’d deal with him later. She had to think of a way to convince Jack to be reasonable and stay in Chicago, but for now she had a much bigger problem: Jack, just beyond the door, sleeping on her sofa.\u003c/p\u003e\n\u003cp\u003eIt was one thing for Gil to camp out in her living room. He was old enough to be her grandfather. He was also sweet. Jack, on the other hand, wasn’t at all sweet or considerate. He was rude, arrogant, and stubborn, but also sexy and gorgeous. Every time she looked at him, all sorts of crazy notions popped into her head…like jumping his bones.\u003c/p\u003e\n\u003cp\u003eIt was that kiss, that stupid kiss that made her curious to know what it would be like to sleep with him. No, not curious. Hot. Hot for him. And what did that say about her morals? She did still have them, didn’t she?\u003c/p\u003e\n\u003cp\u003eSophie was determined to stay away from him until morning. No waffling on that. She’d let him drive her to the airport, and on the way she would surely come up with something to make him change his mind.\u003c/p\u003e\n\u003cp\u003eOkay, plan made. She showered, washed her hair, and took her time blowing it dry. She put on her sexiest nightgown, but only because she happened to like the pink lacy top. It was a short gown that didn’t quite come to her knees. She probably should change into something more modest, but why? Jack wasn’t about to see what she was wearing to bed. \u003c/p\u003e","sourceLink":"https://allnovel.net/fire-and-ice-buchanan-renard-7/page-20.html","bookId":1830,"creation":"Oct 5, 2019 5:32:02 PM","modification":"Oct 5, 2019 5:32:02 PM"}
