{"id":43084,"no":19,"title":"CHAPTER XIX LIVING WITH THIEVES","content":"\u0026nbsp;Meanwhile Ernest was left in the cave with Frank. He had been brought in blindfolded and was therefore ignorant as to the entrance or exit. He thought he might, without arousing the boy’s suspicion, seek information from him on these points. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are there many rooms here, Frank?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, a good many,” answered the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you been in many?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been around with papa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to go around,” said Ernest. “Suppose we take a little walk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy was quite ready to accept any suggestion from Ernest. So he took his hand and they went from the main room farther into the cavern.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest found that only the portion near the entrance had been furnished. Beyond there was a large amount of empty space. Here and there a small light revealed 85 trunks and boxes arranged without regard to regularity. These, Ernest conjectured, contained stolen articles which had accumulated during the years in which the dreaded outlaws had been a power and a menace in the neighborhood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It occurred to him that he would like to open some of these boxes, but the companionship of the boy prevented.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He ventured to ask, however: “What is in those boxes, Frank?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. Something of papa’s and Uncle John’s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As they kept on they reached parts of the cavern which were quite empty. The Fox brothers were in the position of householders who occupied a house too large for their needs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By and by the lamps ceased and the portion farther on looked dark and gloomy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid to go any farther, Ernest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, Frank? What are you afraid of?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There may be wild animals there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But how could they live there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know, but papa told me there were some.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest understood why the boy had been told this. It was to prevent his going too far. But it made Ernest all the more eager to continue his explorations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even if there were any wild animals I would protect you, Frank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But we may not find our way back. It is so dark,” said the child with a shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t go farther. But, see, it seems to be lighter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At a point fifty feet farther on, through a rift in the roof, a gleam of light entered the cavern.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest was anxious to trace this, for, as he judged, it came from some outlet, through which he might possibly obtain deliverance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stay where you are,” he said. “I will just go forward and see what I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t stay long,” entreated Frank nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I won’t.” 86\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest was just as well pleased to go forward alone, for if there were really, as he supposed, an outlet, it was as well that Frank should not have his attention drawn to it, lest he should speak of it to his father and so reveal the fact of their explorations. This might excite the suspicion of James Fox and put a stop to their further walks.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Continuing on alone, Ernest then saw, perhaps fifteen feet above him, an opening some three feet in diameter, through which he could obtain a glimpse of the clear sky above.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It made his heart beat with exultation and longing. There was freedom if he could only manage somehow to lift himself up to the outlet and make his way through it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, Ernest?” asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it is nothing,” answered Ernest with studied indifference. “It isn’t anything you would care to see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little boy accepted this assurance, for he did not feel the interest that excited Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us go back,” he said, as he resumed his clasp of Ernest’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, we will go back. Have you ever been as far as this before?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we had better not say anything about it. Your papa might not like it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Ernest. Will you read to me when you go back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Frank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest was glad to comply with the little boy’s request, as he thought he might in this way put the thoughts of their exploration out of his mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They were fortunate enough to get back without exciting the attention of Juba, who was busy in the kitchen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her work, however, was soon over and she brought her sewing into the room where the two boys were seated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Massa Frank, what am you doing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ernest is reading to me. Why don’t you ever read to me, Juba?” 87\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “O lor’, chile, you know I can’t read.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why can’t you read? You’re old enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, honey, I’m old enough, but I never had no chance to learn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you?” persisted Frank. “Didn’t you go to school when you was little?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, chile, never went to school. They didn’t have no schools where I was raised.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where was that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In ole Virginny.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you a slave, Juba?” asked Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, massa, I was a slave.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And how did you get here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was all along of the war. Ole massa he went to the war and got killed. Then young massa went, and he got killed, too. Then one day there came an officer—one of Abe Linkum’s officers—and he told us we were free and might go where we pleased.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Weren’t you glad to be free?” asked Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, honey, we didn’t know where to go nor what to do. We’d allus had some one to look after us, but now there wasn’t anybody.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you married, Juba?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I don’t know whether my ole man is livin’ or not. He was sold down in Georgie to a cousin of ole massa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he may be living yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, honey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old are you, Juba?” asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know, chile. I’s powerful old. S’pecs I’s a hundred.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Juba,” he said, “you are not nearly a hundred. You may be sixty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Juba, did you ever hear about Uncle Tom?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, chile, I knew Uncle Tom,” was the unexpected reply. “He was raised on Mr. Jackson’s place next to ours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest asked some question about this Uncle Tom, but 88 learned, as he expected, that it was quite a different person from the negro immortalized by Mrs. Stowe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In looking over Frank’s books Ernest found an old copy of “Uncle Tom’s Cabin,” and taking it down he read some portions, particularly those relating to Topsy. Both Frank and Juba were very much entertained.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you know Topsy, Juba?” asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, chile, never knowed Topsy. She must have been a no-account young nigga. If she’d lived on our plantation she’d have got flogged for her impudence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you come here, Juba?” asked Frank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One of them officers took me to Chicago. I lived out with a lady, but when she died, I went to a ’telligence office and there I met your papa. He brought me out here. I didn’t at first like livin’ down under the ground, but I don’t mind it now. Massa Fox treats me well, and I ain’t no wish to change.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the substance of what Juba had to communicate. The rest of the day passed quietly. At nightfall James Fox came home, looking very sober. But he came alone.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2946/80957.html","bookId":466,"creation":"Aug 11, 2019 6:29:39 AM","modification":"Aug 11, 2019 6:29:39 AM"}
