{"id":43069,"no":4,"title":"CHAPTER IV ALONE IN THE WORLD","content":"\u0026nbsp;Joe Marks and Luke Robbins looked at each other in amazement. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your cabin entered!” exclaimed Joe. “What do you say to that, Luke?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not know there were any thieves round here,” answered Luke. “What was taken?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “An old trunk was opened—I carelessly left it unlocked—and two five-dollar gold pieces were stolen out of it. At any rate, I couldn’t find them this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two five-dollar gold pieces?” said Joe quickly. “Then I know who took them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean, Joe?” said Luke. “Out with it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know that tramp who was here yesterday, Luke?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He came round an hour ago, and called for a glass of whisky. ‘Where is your money?’ I asked. ‘I’ve got plenty,’ he said. Then I called upon him to show it, and he pulled out a five-dollar gold piece. Of course I was surprised. ‘Where did you get it?’ I asked suspiciously. ‘Yesterday you said you had no money.’ ‘I had that,’ he answered, ‘but I didn’t want to spend it. You see it was a gift from my dyin’ mother, and I wanted to keep it for her sake.’ With that he rolled up his eyes and looked sanctimonious. Then I asked him how it happened that he was ready to spend it now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did he say?” 19\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said that he was so parched with thirst that he felt obliged to do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you take his money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I was short of change. You see I changed a gold piece for the boy yesterday. Besides, I wasn’t sure the piece was good, seeing who offered it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he didn’t get his whisky?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. He went away disappointed. I don’t doubt, Ernest, that the gold piece was one of yours. How did the fellow get in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Through the window. I found it open when I woke up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must have slept sound.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did. I slept an hour later than I generally do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was anything else taken?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not that I could discover.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean to say that your uncle had but ten dollars?” asked Joe incredulously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was all he had in the trunk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I always thought him a rich man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was not,” said Ernest quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was that all the money he had? He had the reputation of being a miser, with hoards of gold hidden in or near the cabin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know of one sum of money he had concealed, but it was not a large amount.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m glad you won’t be left penniless, lad; did he own the cabin?” said Luke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nobody owned it,” said Joe Marks. “It was built years ago by a man who suddenly left it and went away, nobody knew where. It wasn’t worth much, and no one ever took the trouble to claim it. When your uncle came here he found it empty and took possession of it, and there he has lived ever since. So you’ll have some money, Ernest?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only a hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you do? What are your plans?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. I haven’t had time to think.” 20\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might find a place for you in the store. We wouldn’t like to have you go away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Joe. You are very kind. But there’s no chance for me around here. I’ll take the money and go somewhere. But first I must see Uncle Peter buried. Will you help me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To be sure we will. Was he your only relation?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was not my relation at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, you have always called him uncle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I supposed him to be my uncle, but yesterday he told me that he was only a servant in my father’s family, and that on my father’s death he was placed in charge of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon that’s so. You didn’t favor the old man at all. You look as if you came from better stock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “All the same I shall miss him,” said Ernest sadly. “He was a good friend to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he tell you whether you had any kin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I have a cousin of my father’s living in New York State. He is a rich man. He inherited the property that ought to have gone to my father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did that happen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He prejudiced my grandfather against my father, and so the estate was willed to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The mean scoundrel!” exclaimed Luke indignantly. “I’d like to have him in my hands for a few minutes; I’d give him a lesson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should pity him if ever you got hold of him, Luke,” said Joe Marks. “But we must consider what we can do for the boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish we could get hold of that thief of a tramp!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably we shall. He’ll find his way back here sooner or later.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the burial of Peter Brant was the first consideration. No undertaker was called, for in that small settlement one would not have been supported. The ceremonies of death were few and simple. A wooden box was put together, and Peter was placed in it, dressed as he was at the time of his death. There was an itinerant 21 minister who preached in the village once in four weeks, but he was away now, and so there could be no religious ceremony beyond reading a chapter from the New Testament. Joe Marks, who had received a decent education, officiated as reader. Then the interment took place. In the forenoon of the second day Peter’s body was laid away, and Ernest was left practically alone in the world.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile some account must be given of Tom Burns, the tramp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he found it impossible to obtain whisky with the gold he had stolen he felt very despondent. His craving became intolerable. He felt that he had been decidedly ill used. What was the use of money unless it could be converted into what his soul desired? But there was no way of changing the coin except at the store of Joe Marks. To ask any of the villagers would only have excited suspicion. Besides, the tramp felt sure that Ernest would soon discover that he had been robbed. He would naturally be suspected, especially as Joe Marks had knowledge of a gold piece being in his possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a small settlement about five miles off called Daneboro. It was probably the nearest place where he could get a glass of whisky. He must walk there. It was not a pleasant prospect, for the tramp was lazy and not fond of walking. Still, it seemed to be a necessity, and when he left the store of Joe Marks he set out for Daneboro.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Thirst was not the only trouble with Tom Burns. He had not eaten anything for about twenty-four hours, and his neglected stomach rebelled. He tightened a girdle about his waist and walked on. He had perhaps gone two miles when he came to a cabin. A woman stood in the doorway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My good lady,” said Tom, putting on a pitiful expression, “I am a very unfortunate man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you?” said the woman, scanning him critically. “You look like a tramp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do, madam, yet I was once a thriving merchant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t look like it.” 22\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t; I acknowledge it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you lose your property, if you ever had any?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By signin’ notes for my brother. It swept off all my possessions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I pity you. That’s the way my man lost five hundred dollars, nearly all he had. What can I do for you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Madam, I am hungry—very hungry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Set right down on the settee, and I’ll give you what’s left of our breakfast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Burns obeyed with alacrity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A plate of cold bacon, a cold potato and some corn bread were placed before him, and he ate them voraciously. There had been times in his life when he would have turned up his nose at such fare, but not now.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My good lady,” he said, “you have saved my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you must ’a’ been hungry,” said the woman. “A man that’ll eat cold vittles, especially cold potato, ain’t shammin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had money to offer you——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, never mind that; you’re welcome. Can I do anything more for you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel sick, and sometimes, though I am a temperance man, I take whisky for my health, if you had just a sup——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, we haven’t any, and if we had I wouldn’t give you any.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You misjudge me, madam. You must not think I am a drinker.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s no matter what I think. You can’t get any whisky here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At Daneboro Tom fared better. He changed his gold piece, drank a pint of whisky, and the next day retraced his steps to old Peter’s cabin. He felt satisfied that somewhere near the cabin there was treasure concealed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2946/80942.html","bookId":466,"creation":"Aug 11, 2019 6:29:39 AM","modification":"Aug 11, 2019 6:29:39 AM"}
