{"id":82074,"no":10,"title":"Page 10","content":"\u003cp\u003eIt felt like a jellyfish sting.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette kept her eyes shut and her face turned away as Rowan bit into her neck. She was\u003c/p\u003e\n\u003cp\u003ethinking of the way the deer had screamed. But thepain wasn\u0027t so bad. It went away almost immediately.\u003c/p\u003e\n\u003cp\u003eShe could feel warmth at her neck as the bloodflowed, and, after a minute, a slight dizziness. A\u003c/p\u003e\n\u003cp\u003eweakness. But the most Interesting thing was that allat once she seemed to have a new sense. She could\u003c/p\u003e\n\u003cp\u003esense Rowan\u0027s mind.It was like seeing, but withouteyes-and using different wavelengths than visual light.\u003c/p\u003e\n\u003cp\u003eRowan\u0027s mind-her presence-was warmred, like glowing embers in a campfire. It was alsofuzzy and\u003c/p\u003e\n\u003cp\u003erounded like a ball of hot gas floatingIn space.\u003c/p\u003e\n\u003cp\u003eIs this what psychics mean when they talk aboutpeople having an aura?\u003c/p\u003e\n\u003cp\u003eThen Rowan pulled back, and it was over. The new sense disappeared.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette\u0027s fingers went automatically to herneck. She felt wetness there. A little tenderness.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t fool with it,\" Rowan said, brushing at herlips with her thumb. \"It\u0027ll go away in just a\u003c/p\u003e\n\u003cp\u003eminute.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette blinked, feeling languid. She lookedover at Mark, who was being released by Kestrel.\u003c/p\u003e\n\u003cp\u003eHe looked okay, if a little dazed. She smiled at him\u0027and he raised his eyebrows and shook his head\u003c/p\u003e\n\u003cp\u003eslightly.\u003c/p\u003e\n\u003cp\u003eI wonder what his mind looks like, Mary-Lynnettethought. Then she said, startled, \"What are you\u003c/p\u003e\n\u003cp\u003edoing?\"\u003c/p\u003e\n\u003cp\u003eRowan had picked up a twig and was testing itsend for sharpness.\u003c/p\u003e\n\u003cp\u003e\"Every species has some substance that\u0027s harmfulto it,\" she said. \"Silver for werewolves, iron for\u003c/p\u003e\n\u003cp\u003ewitches...and wood for vampires. It\u0027s the onlything out here that will cut our skin,\" she added.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t mean that. I meantwhy, \" Mary-Lynnettesaid, but she knew why already. She watched\u003c/p\u003e\n\u003cp\u003erednessbead in the wake of the twig as Rowan drew it across her wrist.\u003c/p\u003e\n\u003cp\u003eExchange blood, Rowan had said.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette gulped. She didn\u0027t look at markand Kestrel.\u003c/p\u003e\n\u003cp\u003eI\u0027ll do it first and then he\u0027ll see it\u0027s not so bad, shetold herself. I can do this, I can do this.... It\u0027s so wecan\u003c/p\u003e\n\u003cp\u003estayalive.\u003c/p\u003e\n\u003cp\u003eRowan was looking at her, offering her wrist.\u003c/p\u003e\n\u003cp\u003eCopperbloodfear, Mary-Lynnette thought, feeling queasy.\u003c/p\u003e\n\u003cp\u003eShe shut her eyes and put her mouth to Rowan\u0027swrist.\u003c/p\u003e\n\u003cp\u003eWarmth. Well-being. And a taste not like copper, but like something rich and strange. Later, she\u0027d al\u003c/p\u003e\n\u003cp\u003eways grope for ways to describe it, but she could onlythink of things like: well, a little bit like the way\u003c/p\u003e\n\u003cp\u003evanilla bean smells, and a little bit like the way silk feels, and a little bit like the way a waterfall looks. It\u003c/p\u003e\n\u003cp\u003ewas faintly sweet.\u003c/p\u003e\n\u003cp\u003eAfterward, she felt as if she could run up mountains.\u003c/p\u003e\n\u003cp\u003e\"Oh, boy,\" Mark said, sounding giddy. \"If you could bottle that stuff, you\u0027d make millions.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been thought of before,\" Kestrel said coolly. \"Humans hunting us for our blood.\"\u003c/p\u003e\n\u003cp\u003e\"Talk later,\" Rowan said firmly. \"Blood-tie now.\"\u003c/p\u003e\n\u003cp\u003eKestrel\u0027s mind was gold. With brilliant knifelikeedges sending glitters in every direction.\u003c/p\u003e\n\u003cp\u003e\"Okay, Jade,\" Rowan said. \"Mark. Enough, you guys. Let go of each other now.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette saw that she was physically pullingMark and Jade apart. Mark was wearing a silly smile,\u003c/p\u003e\n\u003cp\u003eand Mary-Lynnette felt the tiniest stab of envy. What would it be like to see the mind of somebody you\u003c/p\u003e\n\u003cp\u003ewere in love with?\u003c/p\u003e\n\u003cp\u003eJade\u0027s mind was silver and lacy, an intricate filigreed sphere like a Christmas ornament. And by the time\u003c/p\u003e\n\u003cp\u003eMary-Lynnette sat back from drinking Jade\u0027s blood, she felt light-headed and sparkling. As if she had a\u003c/p\u003e\n\u003cp\u003emountain stream in her veins.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Rowan said. \"Now we share the sameblood.\" She held out a hand, and Jade and\u003c/p\u003e\n\u003cp\u003eKestrel did the same. Mary-Lynnette glanced at Mark, then they each reached out, all their hands\u003c/p\u003e\n\u003cp\u003emeeting like spokes in a wheel.\u003c/p\u003e\n\u003cp\u003e\"We promise to be kin to you, to protect and defend you always,\" Rowan said. She nodded to\u003c/p\u003e\n\u003cp\u003eMary-Lynnette.\u003c/p\u003e\n\u003cp\u003e\"We promise to be kin to you,\" Mary-Lynnetterepeated slowly. \"To protect and defend you\u003c/p\u003e\n\u003cp\u003ealways.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it,\" Rowan said simply. \"We\u0027re family.\"\u003c/p\u003e\n\u003cp\u003eJade said, \"Let\u0027s go home.\"\u003c/p\u003e\n\u003cp\u003eThey had to finish burying Aunt Opal first. MaryLynnette watched as Rowan scattered pine needles over\u003c/p\u003e\n\u003cp\u003ethe grave.\u003c/p\u003e\n\u003cp\u003e\"You inherit our blood feuds, too,\" Kestrel told Mary-Lynnette pleasantly. \"Meaning you have to\u003c/p\u003e\n\u003cp\u003ehelp us find out who killed her.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been trying to do that all along.\"\u003c/p\u003e\n\u003cp\u003eThey left the deer where it was. Rowan said,\"There are already lots of scavengers around here. It won\u0027t\u003c/p\u003e\n\u003cp\u003ebe wasted.\"\u003c/p\u003e\n\u003cp\u003eYep, that\u0027s life, Mary-Lynnette thought as they leftthe clearing. She glanced behind her-and for justan\u003c/p\u003e\n\u003cp\u003einstant she thought she saw a shadow there anda glint of greenish-orange eyes at her own eye level. It\u003c/p\u003e\n\u003cp\u003ewas much too big for a coyote.\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to tell the others ... and the shadow was gone.\u003c/p\u003e\n\u003cp\u003eDid I imagine that? I think my eyes are goingfunny. Everything seems too bright.\u003c/p\u003e\n\u003cp\u003eAll her senses seemed changed-sharpened. Itmade it easier to get out of the woods than it had been\u003c/p\u003e\n\u003cp\u003egetting in. Mark and Jade didn\u0027t walk hand inhand-that would have been impractical-but Jade looked\u003c/p\u003e\n\u003cp\u003eback at him frequently. And when they got to rough spots, they helped each other.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re happy, aren\u0027t you?\" Mary-Lynnette said softly when she found herself beside Mark.\u003c/p\u003e\n\u003cp\u003eHe gave a startled, sheepish grin, white in the moonlight. \"Yeah. I guess I am.\" After a minute hesaid,\u003c/p\u003e\n\u003cp\u003e\"It\u0027s like-I don\u0027t know how to describe it, butit\u0027s like I belong with Jade. She reallysees me. I mean, not\u003c/p\u003e\n\u003cp\u003ethe outside stuff. She sees me inside,andshe likes me. Nobody else has ever done that .. .except you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m happy for you.\"\u003c/p\u003e\n\u003cp\u003e\"Listen,\" he said. \"I think we should start looking around for you. There are lots of guys around\u003c/p\u003e\n\u003cp\u003ehere-\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette snorted. \"Mark. If I want to meeta guy, I\u0027ll meet a guy. I don\u0027t need any help.\"\u003c/p\u003e\n\u003cp\u003eHe gave the sheepish grin again. \"Sorry.\"\u003c/p\u003e\n\u003cp\u003eBut Mary-Lynnette was thinking. Ofcourseshe\u0027d like to find somebody who would accept her\u003c/p\u003e\n\u003cp\u003ecompletely, who would share everything with her. That was everybody\u0027s dream. But for how many\u003c/p\u003e\n\u003cp\u003epeople did it come true?\u003c/p\u003e\n\u003cp\u003eAnd there weren\u0027tlots of guys around here....She found herself thinking of Jeremy Lovett again. His dear\u003c/p\u003e\n\u003cp\u003ebrown eyes ...\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t hold the picture. It kept dissolving--.to her horror-into eyes that flashed blue andgold\u003c/p\u003e\n\u003cp\u003eand gray, depending on the way they caught the light.\u003c/p\u003e\n\u003cp\u003eOh, God,no. Ash was the last person who would understand her. And she didn\u0027t want to share a bus\u003c/p\u003e\n\u003cp\u003eseat with him, much less her life.\u003c/p\u003e\n\u003cp\u003e\"What I want to know is who madeyou guys vam pires,\" Mark said. They were sitting on oversize,\u003c/p\u003e\n\u003cp\u003eoverstuffed Victorian furniture in the living room at Burdock Farm. Rowan had a fire going in the\u003c/p\u003e\n\u003cp\u003efireplace. \"Was it the old lady? Your aunt?\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t anybody,\" Jade said, looking affronted.\"We\u0027re not made vampires. We\u0027re the lamia.\"\u003c/p\u003e\n\u003cp\u003eShe pronounced it LAY-mee-uh.\u003c/p\u003e\n\u003cp\u003eMark looked at her sideways. \"Uh-huh. Andwhat\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s us. It\u0027s vampires that can have babies, and eat,and drink, and get old if we let ourselves, and\u003c/p\u003e\n\u003cp\u003elivein families.Thebest kind of vampires.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a race of vampires, basically,\" Kestrel said.\"Look, there are two different kinds of vampires,\u003c/p\u003e\n\u003cp\u003eokay? The kind who start out as humans and are changed when a vampire bites them, and the kindthat\u003c/p\u003e\n\u003cp\u003eare bornvampires. That\u0027s the kind we are. Our line goes back-well, let\u0027s say a long way.\"\u003c/p\u003e\n\u003cp\u003e\"The longest,\" Jade broke in again. \"We\u0027re Redferns; we go back to prehistoric times.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette blinked. \"But you three don\u0027t go back that far, do you?\" she said nervously.\u003c/p\u003e\n\u003cp\u003eRowan stifled a laugh. \"I\u0027m nineteen; Kestrel\u0027s seventeen; Jade is sixteen. We haven\u0027t stopped aging\u003c/p\u003e\n\u003cp\u003eyet.\"\u003c/p\u003e\n\u003cp\u003eKestrel was looking at Mary-Lynnette. \"How olddid our aunt look to you?\"\"Um, around seventy,\u003c/p\u003e\n\u003cp\u003eseventy-five, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"When we last saw her she looked maybe forty,\" Kestrel said. \"That was ten years ago, when\u003c/p\u003e\n\u003cp\u003eshe left our island.\"\u003c/p\u003e\n\u003cp\u003e\"But she\u0027d actually been alive for seventy-four years at that point,\" Rowan said. \"That\u0027s what\u003c/p\u003e\n\u003cp\u003ehappens to us-if we stop holding off the aging process, it all catches up at once.\"\u003c/p\u003e\n\u003cp\u003e\"Which if you\u0027ve been alive for five or six hundredyears can be quite interesting,\" Kestrel said\u003c/p\u003e\n\u003cp\u003edryly.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette said, \"So this island where youcome from-is that the Night World?\"\u003c/p\u003e\n\u003cp\u003eRowan looked startled. \"Oh, no, it\u0027s just a safe town. You know, a place where our people all live\u003c/p\u003e\n\u003cp\u003ewithout any humans. Hunter Redfern founded itback in the sixteenth century so we\u0027d have some where\u003c/p\u003e\n\u003cp\u003esafe to live.\"\u003c/p\u003e\n\u003cp\u003e\"The only problem,\" Kestrel said, golden eyesglinting, \"is that people there are still doing thingsthe\u003c/p\u003e\n\u003cp\u003eway they did in the sixteenth century. Andthey made a rule that nobody couldleave-exceptfor some of the\u003c/p\u003e\n\u003cp\u003emen and boys that they trusted completely.\"\u003c/p\u003e\n\u003cp\u003eLike Ash, I guess, Mary-Lynnette thought. Shewas about to say this, but Rowan was speakingagain.\u003c/p\u003e\n\u003cp\u003e\"So that\u0027s why we ran away. We didn\u0027t want tohave to get married when our father told us to.\u003c/p\u003e\n\u003cp\u003eWewanted to see the human world. We wanted-\"\u003c/p\u003e\n\u003cp\u003e\"To eat junk food,\" Jade caroled. \"And read magazines and wear pants and watch TV.\"\u003c/p\u003e\n\u003cp\u003e\"When Aunt Opal left the island, she didn\u0027t tell anybody where she was going-except me,\"\u003c/p\u003e\n\u003cp\u003eRowan said. \"She told me she was going to this little town called Briar Creek where her husband\u0027s family\u003c/p\u003e\n\u003cp\u003ehad built a house a hundred and fifty years ago.,,,\u003c/p\u003e\n\u003cp\u003eMary-Lynnette ran her fingers through the silky tassels of a forest-green pillow. \"Okay, but-whereis the\u003c/p\u003e\n\u003cp\u003eNight World, then?\"\u003c/p\u003e\n\u003cp\u003e\"Oh... it\u0027s not a place....\" Rowan looked uncertain. \"This is-it\u0027s kind of hard to tell you, actually,\"\u003c/p\u003e\n\u003cp\u003eshe said. \"You\u0027re not even supposed to know it exists. The two very first laws of the Night World are\u003c/p\u003e\n\u003cp\u003ethat you never let a human find out about it ...and that you never fall in love with a human.\"\u003c/p\u003e\n\u003cp\u003e\"And Jade\u0027s breaking both this minute,\" Kestrel murmured.\u003c/p\u003e\n\u003cp\u003eJade just looked pleased.\u003c/p\u003e\n\u003cp\u003e\"And the penalty for both is death-for everybody involved,\" Rowan said. \"But . . . you\u0027re family.\u003c/p\u003e\n\u003cp\u003eHere goes.\" She took a steadying breath. \"The Night World is a sort of secret society. Not just of\u003c/p\u003e\n\u003cp\u003evampires. Of witches and werewolves and shape shifters, too. All the different kinds of Night People.\u003c/p\u003e\n\u003cp\u003eWe\u0027re everywhere.\"\u003c/p\u003e\n\u003cp\u003eEverywhere?Mary-Lynnette thought. It was an unnerving idea-but an interesting one. So therewas a\u003c/p\u003e\n\u003cp\u003ewhole world out there she\u0027d never knownabout-a place to explore, as alien as the Androm eda galaxy.\u003c/p\u003e\n\u003cp\u003eMark didn\u0027t seem too disturbed by the thought of vampires everywhere. He was grinning at Jade, leaning\u003c/p\u003e\n\u003cp\u003ewith one elbow on the arm of the dark green couch. \"So, can you read minds? Can you read my mind\u003c/p\u003e\n\u003cp\u003eright now?\"\u003c/p\u003e\n\u003cp\u003ecats who have heard something theirhumanscan\u0027t. An instant later, though. Mary-Lynnette heard it, too.\u003c/p\u003e\n\u003cp\u003eThe sound of feet on the front porch--tap, tap,tap-asquick as that. And then a thud.\u003c/p\u003e\n\u003cp\u003e\"Hey, somebody\u0027sout there,\" Jade said, and before Mark could stop her, she was up and\u003c/p\u003e\n\u003cp\u003eheading for the door.\u003c/p\u003e\n\u003cp\u003e\"Soulmates can read each other\u0027s minds without even trying,\" Jade told Mark firmly.\u003c/p\u003e\n\u003cp\u003eSoulmates ... Mary-Lynnette wanted to get on toa different subject. She felt uncomfortable, tingly.\u003c/p\u003e\n\u003cp\u003e\"I wish you\u0027d stop saying that. What you have ismuch better than being soulmates,\" Rowan was tell\u003c/p\u003e\n\u003cp\u003eing Jade. \"With love you get to find out about aperson first. Being soulmates is involuntary-youdon\u0027t even\u003c/p\u003e\n\u003cp\u003ehave tolikethe person when you meetthem. They may be completely wrong for you inevery way-wrong\u003c/p\u003e\n\u003cp\u003especies, wrong temperament, wrong age. But you know you\u0027ll never be completely happy again without\u003c/p\u003e\n\u003cp\u003ethem.\"\u003c/p\u003e\n\u003cp\u003eMore and more tingly. Mary-Lynnette had to say something. \"And what if thathappenedto you-if you\u003c/p\u003e\n\u003cp\u003efound somebody and you were soulmates with them and you didn\u0027t want to be?\" she asked Rowan. She\u003c/p\u003e\n\u003cp\u003erealized that her voice was strange--thick. \"Isn\u0027tthere any way you could-get rid of it?\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Mary-Lynnette saw everyoneturn to look at her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never heard of one,\" Rowan said slowly. Her brown eyes were searching Mary-Lynnette\u0027s.\u003c/p\u003e\n\u003cp\u003e\"But I guess you could ask a witch ... if you had that problem.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette swallowed. Rowan\u0027s eyes weregentle and friendly-and Mary-Lynnette felt a very strong\u003c/p\u003e\n\u003cp\u003eneed to talk to someone, someone who would understand.\u003c/p\u003e\n\u003cp\u003e\"Rowan\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t get any further. Rowan, Kestrel, and Jade all looked suddenly toward the front door-like. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-daughters-of-darkness-night-world-2/page-10.html","bookId":1862,"creation":"Oct 5, 2019 4:39:54 PM","modification":"Oct 5, 2019 4:39:54 PM"}
