{"id":82076,"no":12,"title":"Page 12","content":"\u003cp\u003eWhat happened then was interesting. Mary-Lynnette got to see the sisters do all the things she\u0027dmissed\u003c/p\u003e\n\u003cp\u003eearlier in the clearing. All the hissing and the clawed fingers. Just like the movies.\u003c/p\u003e\n\u003cp\u003eExcept that when a vampire hissed, it sounded real. Like a cat, not like a person imitating a cat. All three\u003c/p\u003e\n\u003cp\u003egirls jumped up and stood ready to fight.\u003c/p\u003e\n\u003cp\u003eThere wasn\u0027t any weird grimacing. But Jade and Kestrel were showing teeth that were long and\u003c/p\u003e\n\u003cp\u003ebeautifully curved, coming to delicate feline points that indented the lower lip.\u003c/p\u003e\n\u003cp\u003eAnd something else. Their eyes changed. Jade\u0027s silvery-green eyes went even more silvery. Kestrel\u0027s\u003c/p\u003e\n\u003cp\u003egolden eyes looked jewel-yellow, like a hawk\u0027s. Even Rowan\u0027s eyes had a dark light in them.\u003c/p\u003e\n\u003cp\u003e\"Oh, boy,\" Mark whispered. He was standing beside Jade, staring from her to Ash.\u003c/p\u003e\n\u003cp\u003eAsh said, \"Hi.\"\u003c/p\u003e\n\u003cp\u003eDon\u0027t look at him, Mary-Lynnette told herself. Herheart was pounding wildly and her knees were\u003c/p\u003e\n\u003cp\u003etrembling. The attraction of particle to antiparticle,she thought, remembering a line from last year\u0027sphysics\u003c/p\u003e\n\u003cp\u003elass. But there was another, shorter namefor it, and no matter what she said to herself, she couldn\u0027t keep\u003c/p\u003e\n\u003cp\u003eit out of her mind.\u003c/p\u003e\n\u003cp\u003eSoulmates.\u003c/p\u003e\n\u003cp\u003eOh, God, I really don\u0027t want this. Please, please, Ididn\u0027t ask for this. I want to discover a supernova and\u003c/p\u003e\n\u003cp\u003estudy mini-quasars at the Gamma Ray Observatory. I want to be the one who solves the mystery of\u003c/p\u003e\n\u003cp\u003ewhere all the dark matter in the universe is.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want this.\u003c/p\u003e\n\u003cp\u003eIt should have happened to someone like BunnyMarten, someone who spent timelonging for romance.\u003c/p\u003e\n\u003cp\u003eThe only thing Mary-Lynnette longed for wassomebody to understand ...\u003c/p\u003e\n\u003cp\u003e... to understand the night with you,a distant part ofher mind whispered.\u003c/p\u003e\n\u003cp\u003eAnd instead here she was, stuck with a guy whose own sisters were terrified of him.\u003c/p\u003e\n\u003cp\u003eIt was true. That was why they were standingpoised to fight, making threatening noises. Even Kestrel\u003c/p\u003e\n\u003cp\u003ewas afraid of him.\u003c/p\u003e\n\u003cp\u003eThe moment Mary-Lynnette realized that, anger washed out the trembling dismay inside her. Whatever\u003c/p\u003e\n\u003cp\u003eshe felt about Ash, she wasn\u0027t afraid of him.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you ever knock?\" she said and walked toward him. Strode toward him.\u003c/p\u003e\n\u003cp\u003eShe had to hand it to her new family. Both Jadeand Kestrel tried to grab her and keep her from getting\u003c/p\u003e\n\u003cp\u003eclose to their brother. Protecting her. MaryLynnette shook them off.\u003c/p\u003e\n\u003cp\u003eAsh eyed her warily.\u003c/p\u003e\n\u003cp\u003e\"Oh. You,\" he said. Unenthusiastically.\u003c/p\u003e\n\u003cp\u003e\"What are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my uncle\u0027s house.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your aunt\u0027s house and you weren\u0027t invited.\"\u003c/p\u003e\n\u003cp\u003eAsh looked at his sisters. Mary-Lynnette could justsee little wheels turning in his head. Had they already\u003c/p\u003e\n\u003cp\u003etold about the Night World or not? Of course, if they hadn\u0027t, their behavior should be giving somebody a\u003c/p\u003e\n\u003cp\u003edue. Most human girls didn\u0027t hiss.\u003c/p\u003e\n\u003cp\u003eAsh held one finger up. \"Okay. Now, listen\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette kicked him in the shins. She knew it was inappropriate, she knew it was uncalled-for,\u003c/p\u003e\n\u003cp\u003ebut she couldn\u0027t stop herself. She just had to.\u003c/p\u003e\n\u003cp\u003e\"Oh, for God\u0027s sake,\" Ash said, hopping backward.\u003c/p\u003e\n\u003cp\u003e\"Are you crazy?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, she is,\" Mark said, abandoning Jade and hurrying forward to take Mary-Lynnette\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"Everybody knows she\u0027s crazy. She can\u0027t help it.\" He backedup, pulling. He was looking at\u003c/p\u003e\n\u003cp\u003eMary-Lynnette as if she\u0027d taken all her clothes off and started to dance the mambo.\u003c/p\u003e\n\u003cp\u003eSo were Kestrel and Jade. Their eyes had gone ordinary, their teeth retracted. They\u0027d never seen\u003c/p\u003e\n\u003cp\u003eanyone treat their brother quite this way. And to have a human doing it ...\u003c/p\u003e\n\u003cp\u003eIf the girls had superhuman strength, Ash was undoubtedly even stronger. He could probably flatten\u003c/p\u003e\n\u003cp\u003eMary-Lynnette with one blow.\u003c/p\u003e\n\u003cp\u003eShe still couldn\u0027t help it. She wasn\u0027t afraid of him, only of herself and the stupid floating feeling in her\u003c/p\u003e\n\u003cp\u003estomach. The way her legs wanted to fold under her.\u003c/p\u003e\n\u003cp\u003e\"Will somebody just tell her not to do that anymore?\" Ash was saying.\u003c/p\u003e\n\u003cp\u003eKestrel and Jade looked sideways at Mary-Lynnette. Mary-Lynnette shrugged at them, her breath\u003c/p\u003e\n\u003cp\u003ecoming quickly.\u003c/p\u003e\n\u003cp\u003eShe saw that Rowan was looking at her, too, butnot in the same dumbfounded way. Rowan looked\u003c/p\u003e\n\u003cp\u003eworried and surprised and sorry.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve met,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I should have told you,\" Mary-Lynnette said. \"Hecame to our house. He was asking my\u003c/p\u003e\n\u003cp\u003estepmotherabout you and your friends-saying that he needed to approve them because he was head of\u003c/p\u003e\n\u003cp\u003ethe family.\"\u003c/p\u003e\n\u003cp\u003eAll three girls looked at Ash with narrowed eyes.\u003c/p\u003e\n\u003cp\u003e\"So you have been around,\" Kestrel said. \"Forhow long?\"\u003c/p\u003e\n\u003cp\u003eRowan said quietly, \"What are -you really doinghere?\"\u003c/p\u003e\n\u003cp\u003eAsh let go of his shin. \"Can we all sit down and talk about this like reasonable people?\"\u003c/p\u003e\n\u003cp\u003eEveryone looked at Mary-Lynnette. She took a deep, calming breath. She still felt as if her entire skin\u003c/p\u003e\n\u003cp\u003ewas electrified, but her heart was slowing down. \"Yes,\" she said and worked at looking normal so they\u0027d\u003c/p\u003e\n\u003cp\u003eknow her temporary insanity was over.\u003c/p\u003e\n\u003cp\u003eAs he helped her to the couch, Mark whispered, \"I have to tell you, I\u0027ve never seen you act so immature\u003c/p\u003e\n\u003cp\u003ebefore. I\u0027m proud of you.\"\u003c/p\u003e\n\u003cp\u003eEven big sisters have to have some off time, Mary-Lynnette thought. She patted him vaguely and sat,\u003c/p\u003e\n\u003cp\u003efeeling tired.\u003c/p\u003e\n\u003cp\u003eAsh settled in a plush-covered chair. Rowan andKestrel sat beside Mary-Lynnette. Mark and Jade\u003c/p\u003e\n\u003cp\u003eshared an ottoman.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Ash said. \"Now can we fast introduce ourselves? I presume that\u0027s your brother.\"\u003c/p\u003e\n\u003cp\u003e\"Mark,\" Mary-Lynnette said. \"Mark, that\u0027s Ash.\"\u003c/p\u003e\n\u003cp\u003eMark nodded. He and Jade were holding hands. Mary-Lynnette saw Ash\u0027s eyes drop to their\u003c/p\u003e\n\u003cp\u003eintertwined fingers. She couldn\u0027t tell anything from his expression.\u003c/p\u003e\n\u003cp\u003e\"Okay. Now.\" Ash looked at Rowan. \"I\u0027m here to take you back home, where everyone misses\u003c/p\u003e\n\u003cp\u003eyou violently.\"\u003c/p\u003e\n\u003cp\u003eJade breathed, \"Give me a break.\"\u003c/p\u003e\n\u003cp\u003eKestrel said, \"What if we don\u0027t want to be taken?\" and showed her teeth briefly. Mary-Lynnette didn\u0027t\u003c/p\u003e\n\u003cp\u003efind that strange. What she found strange was that Ash didn\u0027t return the smile. He didn\u0027t look lazy or\u003c/p\u003e\n\u003cp\u003esardonic or smug right then. He looked like somebody who wants to get a job over with.\u003c/p\u003e\n\u003cp\u003eRowan said, \"We can\u0027t go home, Ash.\" Her breathing was slightly irregular, but her chin was high.\u003c/p\u003e\n\u003cp\u003e\"Well, you have to come home. Because otherwisethere are going to be some fairly drastic\u003c/p\u003e\n\u003cp\u003econsequences.\"\u003c/p\u003e\n\u003cp\u003e\"We knew that when we left,\" Jade said, with aslittle emotion as Rowan. Her chin was high, too.\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t think you\u0027ve really thought itthrough.\" Ash\u0027s voice had an edge.\u003c/p\u003e\n\u003cp\u003e\"We\u0027d rather die than go back,\" Jade said.\u003c/p\u003e\n\u003cp\u003eKestrel glanced at her quickly, one eyebrow raised.\u003c/p\u003e\n\u003cp\u003e\"Oh, well, fine, I\u0027ll just make a note of that,\" Ash said tightly. Then his expression darkened. He\u003c/p\u003e\n\u003cp\u003elookedmore determined than Mary-Lynnette would have thought he could look. Not in the least like a\u003c/p\u003e\n\u003cp\u003ebig blond cat. Like a lanky, elegant pale tiger.\u003c/p\u003e\n\u003cp\u003e\"Now, listen,\" he said. \"There are a few smallthings that you don\u0027t understand, and I don\u0027t have\u003c/p\u003e\n\u003cp\u003eany time to play games. So how about we send yourlittle friends home and then we can all have a fam ily\u003c/p\u003e\n\u003cp\u003etalk.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette\u0027s hands clenched into fists.\u003c/p\u003e\n\u003cp\u003eMark clutched at Jade, who pushed him awayslightly with her elbow. She was frowning. \"I think maybe\u003c/p\u003e\n\u003cp\u003eyou\u0027d better,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going to leave you.\"\u003c/p\u003e\n\u003cp\u003eRowan bit her lip. \"Mark ...\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not going. Don\u0027t try to protect me. He\u0027s not stupid, sooner or later he\u0027s going to find out that\u003c/p\u003e\n\u003cp\u003ewe know about the Night World.\"\u003c/p\u003e\n\u003cp\u003eRowan drew in her breath involuntarily. Kestrel\u0027s expression never changed, but her muscles. tensed as\u003c/p\u003e\n\u003cp\u003eif for a fight. Jade\u0027s eyes went silver. Mary-Lynnette sat very still.\u003c/p\u003e\n\u003cp\u003eThey all looked at Ash. Ash looked heavenward.\u003c/p\u003e\n\u003cp\u003e\"I know you know,\" he said with deadly patience.\"I\u0027m trying to get you out, you poor sap, before\u003c/p\u003e\n\u003cp\u003eI find out how much you know.\"\u003c/p\u003e\n\u003cp\u003eThe sisters stared. Mary-Lynnette opened hermouth and then shut it again.\u003c/p\u003e\n\u003cp\u003e\"I thought you didn\u0027t like humans,\" Mark said. \"I don\u0027t; I hate them,\" Ash said with brittle cheer.\u003c/p\u003e\n\u003cp\u003e\"Then why would you want to cut me a break?\"\"Because if I kill you, I have to kill your sister,\"\u003c/p\u003e\n\u003cp\u003eAsh informed him, with a smile that would have fit in perfectly at the Mad Hatter\u0027s tea party.\u003c/p\u003e\n\u003cp\u003e\"So what; she kicked you.\"\u003c/p\u003e\n\u003cp\u003eAsh stopped tossing answers back like footballs.\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, I may change my mind any minute.\" \"No, wait, \" Jade said. She was sitting with legs\u003c/p\u003e\n\u003cp\u003efolded under her, staring at her brother fiercely.\u003c/p\u003e\n\u003cp\u003e\"This is just too weird. Why would you care whathappens to a human?\"\u003c/p\u003e\n\u003cp\u003eAsh didn\u0027t say anything. He looked at the fire place bitterly.\u003c/p\u003e\n\u003cp\u003eIt was Rowan who said softly, \"Because they\u0027re soulmates.\"\u003c/p\u003e\n\u003cp\u003eAn instant of silence, then everybody started talking explosively.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re what? You mean, like what Jade and Iare?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Ash, this is rich. I just wish our father were here to see this.\"\u003c/p\u003e\n\u003cp\u003e\"It is not my fault, \"Mary-Lynnette said. She found everyone turning toward her, and realized that\u003c/p\u003e\n\u003cp\u003eher eyes were full.\u003c/p\u003e\n\u003cp\u003eRowan leaned across Kestrel to put her hand on Mary-Lynnette\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"You mean it\u0027s really true?Mark said, looking from Mary-Lynnette to Ash.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true. I guess. I don\u0027t know what it\u0027s supposed to be like,\" Mary-Lynnette said, concentrating\u003c/p\u003e\n\u003cp\u003eon making the tears go away.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true,\" Ash said moodily. \"It doesn\u0027t meanwe\u0027re going todo anything about it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you\u0027ve got that right,\" Mary-Lynnette said. She was glad to be angry again.\u003c/p\u003e\n\u003cp\u003e\"So let\u0027s all just pick up our toys and go home,\"Ash said in the general direction of his sisters.\u003c/p\u003e\n\u003cp\u003e\"We\u0027llforget all about this; we\u0027ll just agree that it neverhappened.\"\u003c/p\u003e\n\u003cp\u003eRowan was watching him, shaking her head slightly.There were tears in her eyes, but she was smiling.\u003c/p\u003e\n\u003cp\u003e\"I never thought I\u0027d hear you say something likethat,\" she said. \"You\u0027ve changed so much-I can\u0027t\u003c/p\u003e\n\u003cp\u003ebelieve it.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe it, either,\" Ash said bleakly. \"Maybe it\u0027s a dream.\"\u003c/p\u003e\n\u003cp\u003e\"But you have to admit now that humans aren\u0027tvermin. You couldn\u0027t be soulmates with vermin.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Fine. Humans are terrific. We all agree; nowlet\u0027s go home.\"\u003c/p\u003e\n\u003cp\u003e\"When we were kids, you were like this,\" Rowan said. \"Before you started acting like you were\u003c/p\u003e\n\u003cp\u003ebetter than everyone. I always knew a lot of that was just show. To hide how scared you were. And I\u003c/p\u003e\n\u003cp\u003ealways knew you didn\u0027t really believe a lot of the horriblestuff you said. Somewhere inside, you\u0027re still\u003c/p\u003e\n\u003cp\u003ethat nice little kid, Ash.\"\u003c/p\u003e\n\u003cp\u003eAsh produced his first really flashingsmile of theevening. \"Don\u0027t bet on it.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette had listened to all this feeling shakier and shakier. To conceal it, she said to Rowan, \"I\u003c/p\u003e\n\u003cp\u003edon\u0027t think your aunt thought so.\"\u003c/p\u003e\n\u003cp\u003eAsh sat up. \"Hey, where is the old hag, anyway?I need to have a talk with her before we leave.\"\u003c/p\u003e\n\u003cp\u003eThis silence seemed endless.\u003c/p\u003e\n\u003cp\u003e\"Ash ... don\u0027t you know?\" Rowan said.\u003c/p\u003e\n\u003cp\u003e\"Of course he knows. Ten to one, he did it,\" Kestrel said.\u003c/p\u003e\n\u003cp\u003e\"What is it that I\u0027m supposed to know?\" Ash said, with every sign of being about to lose his\u003c/p\u003e\n\u003cp\u003epatience.\u003c/p\u003e\n\u003cp\u003e\"Your aunt\u0027s dead,\" Mark told him.\u003c/p\u003e\n\u003cp\u003e\"Somebody staked her,\" Jade added.\u003c/p\u003e\n\u003cp\u003eAsh looked around the room. His expression said he suspected it was a practical joke. Oh, God, Mary\u003c/p\u003e\n\u003cp\u003eLynnette thought numbly, when he\u0027s startled and bewildered like that he looks so young. Vulnerable.\u003c/p\u003e\n\u003cp\u003eAlmost human.\u003c/p\u003e\n\u003cp\u003e\"Somebody ... murdered ... Aunt Opal. That\u0027s what you\u0027re telling me?\"\u003c/p\u003e\n\u003cp\u003e\"Are you telling us that you don\u0027t know?\" Kestrel asked. \"What have you beendoing all night,\u003c/p\u003e\n\u003cp\u003eAsh?\"\u003c/p\u003e\n\u003cp\u003e\"Banging my head against a rock,\" Ash said. \"Thenlooking for you. When I walked in you were\u003c/p\u003e\n\u003cp\u003etalking about me.\"\u003c/p\u003e\n\u003cp\u003e\"And you didn\u0027t run across any livestock tonight?Any-let\u0027s say-goats?\"\u003c/p\u003e\n\u003cp\u003eAsh gave her a long, incredulous look. \"I fed, if that\u0027s what you\u0027re asking. Not on a goat.Whatdoes this\u003c/p\u003e\n\u003cp\u003ehave to do with Aunt Opal?\"\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027d better show him,\" Rowan said.\u003c/p\u003e\n\u003cp\u003eShe was the one who got up and lifted the fold ofrug away from the goat. Ash walked around thecouch\u003c/p\u003e\n\u003cp\u003eto see what she was doing. Mary-Lynnette turned to watch his face.\u003c/p\u003e\n\u003cp\u003eHe winced. But he controlled it quickly.\u003c/p\u003e\n\u003cp\u003eRowan said quietly, \"Look at what was in the goat\u0027s mouth.\"\u003c/p\u003e\n\u003cp\u003eAsh picked up the black flower gingerly. \"An Iris. So?\"\u003c/p\u003e\n\u003cp\u003e\u0027Been to your club recently?\" Kestrel asked.\u003c/p\u003e\n\u003cp\u003eAsh gave her a weary look. \"If I had done this, why would I sign it with an iris?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe to tell us who did it.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have to kill goats to say things, you know. I can talk.\"\u003c/p\u003e\n\u003cp\u003eKestrel looked unimpressed. \"Maybe this way the message has a little more impact.\"\u003c/p\u003e\n\u003cp\u003e\"Do I looklike the kind of person who wastes time turning goats into pincushions?\"\u003c/p\u003e\n\u003cp\u003e\"No. No, I don\u0027t think you did this,\" Rowan said inher quiet way. \"But somebodydid-probably\u003c/p\u003e\n\u003cp\u003ewhoever killed Aunt Opal. We\u0027ve been trying to figure outwho.\"\u003c/p\u003e\n\u003cp\u003e\"Well, who have we got for suspects?\"\u003c/p\u003e\n\u003cp\u003eEveryone looked at Mary-Lynnette. She looked away.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s one who\u0027s pretty prime,\" Mark said. \"Hisname\u0027s Jeremy Lovett. He\u0027s a real-\"\u003c/p\u003e\n\u003cp\u003e\"Quiet guy,\" Mary-Lynnette interrupted. If anyonewas going to describe Jeremy, it was going to be her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve known him since elementary school, and I would never,ever have believed he could hurt any\u003c/p\u003e\n\u003cp\u003ebody-especially an old lady and ananimal.\"\u003c/p\u003e\n\u003cp\u003e\"But his uncle was crazy,\" Mark said. \"And I\u0027veheard things about hisfamily-\"\u003c/p\u003e\n\u003cp\u003e\"Nobodyknows anything about his family,\" Mary-Lynnette said. She felt as if she were struggling to keep\u003c/p\u003e\n\u003cp\u003eher head above water, with barbells tied to herwrists and ankles. What was dragging her downwasn\u0027t\u003c/p\u003e\n\u003cp\u003eMark\u0027s suspicion - It was her own. The littlevoice in her head that was saying, \"But he seemed like such\u003c/p\u003e\n\u003cp\u003ea nice guy\"--and which meant, of course, that he wasn\u0027t.\u003c/p\u003e\n\u003cp\u003eAsh was watching her with a brooding, intent expression. \"What does this Jeremy look like?\"\u003c/p\u003e\n\u003cp\u003eSomething about the way he said it irritated MaryLynnette beyond belief. \"What do you care?\"\u003c/p\u003e\n\u003cp\u003eAsh blinked and shifted his gaze. He shrugged minimallyand said with forced blandness, \"Just curious.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027svery handsome,\" Mary-Lynnette said.Gooda way to let out her anger and frustration.\u003c/p\u003e\n\u003cp\u003e\"And the thing is that he looks very intelligent andsensitive-it\u0027s not empty good looks. He\u0027s got hair that\u0027s\u003c/p\u003e\n\u003cp\u003esort of the color of Ponderosa pinecones andthe most wonderful brown eyes.... He\u0027s thin andtan and a\u003c/p\u003e\n\u003cp\u003elittle bit taller than me, because I\u0027m normally looking at his mouth....\"\u003c/p\u003e\n\u003cp\u003eAsh didn\u0027t look pleased. \"I saw somebody vaguelylike that at the gas station -in town.\" He turned to\u003c/p\u003e\n\u003cp\u003eRowan. \"You think he\u0027s some kind of outlawvampire?\"\u003c/p\u003e\n\u003cp\u003e\"Obviously not a made vampire because MaryLynnette has watched him grow up,\" Rowan said.\u003c/p\u003e\n\u003cp\u003e\"I was thinking more that he might be renegade lamia.But there\u0027s not much use in trying to figure it out\u003c/p\u003e\n\u003cp\u003efrom here. Tomorrow we can go and see him, and then we\u0027ll know more. Right?\"\u003c/p\u003e\n\u003cp\u003eMark nodded. Jade nodded. Mary-Lynnette took adeep breath and nodded.\u003c/p\u003e\n\u003cp\u003eAsh nodded and said, \"All right, I see why you can\u0027t go home until this is solved. So, we\u0027ll figureout who\u003c/p\u003e\n\u003cp\u003ekilled Aunt Opal, and then we\u0027ll take the appropriate action, and then we\u0027ll go home. Got it?\"\u003c/p\u003e\n\u003cp\u003eHis sisters exchanged glances. They didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eAs she and mark walked back to their house,Mary-Lynnette noticed that Sirius had lifted abovethe\u003c/p\u003e\n\u003cp\u003eeastern horizon. It hung like a jewel, brighterthan she had ever seen it before-much brighter. Itseemed\u003c/p\u003e\n\u003cp\u003ealmost like a miniature sun, flashing with blue and gold and violet rays.\u003c/p\u003e\n\u003cp\u003eShe thought the effect must be psychological,,until she remembered that she\u0027d exchanged blood with\u003c/p\u003e\n\u003cp\u003ethree vampires. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-daughters-of-darkness-night-world-2/page-12.html","bookId":1862,"creation":"Oct 5, 2019 4:39:54 PM","modification":"Oct 5, 2019 4:39:54 PM"}
