{"id":82068,"no":3,"title":"Page 3","content":"\u003cp\u003eShe\u0027s not looking so good,\" Kestrel said, peering over Rowan\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003eRowan said, \"Oh,dear,\" and sat down\u003c/p\u003e\n\u003cp\u003eGreat-aunt Opal was a mummy. Her skin was like leather: yellow-brown, hard, and smooth. Almost\u003c/p\u003e\n\u003cp\u003eshiny. And the skin was all there was to her, just a leathery frame stretched over bones. She didn\u0027t have\u003c/p\u003e\n\u003cp\u003eany hair. Her eye sockets were dark holes with dry tissue inside. Her nose was collapsed.\u003c/p\u003e\n\u003cp\u003e\"Poor auntie,\" Rowan said. Her own brown eyes were wet.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to look like that when we die,\" Kestrel said musingly.\u003c/p\u003e\n\u003cp\u003eJade stamped her foot. \"No, look,you guys! You\u0027re both missing it completely. Look atthat!\" She swung\u003c/p\u003e\n\u003cp\u003ea wild toe at the mummy\u0027s midsection. There, protruding from the blue-flowered housedress and the\u003c/p\u003e\n\u003cp\u003eleathery skin, was a gigantic splinter of wood. It was almost as long as an arrow, thick at the base and\u003c/p\u003e\n\u003cp\u003etapered where it disappeared into Aunt Opal\u0027s chest. Flakes of white paint still clung to one side.\u003c/p\u003e\n\u003cp\u003eSeveral other pickets were lying on the cellar floor.\u003c/p\u003e\n\u003cp\u003e\"Poor old thing,\" Rowan said. \"She must havebeen carrying them when she fell.\"\u003c/p\u003e\n\u003cp\u003eJade looked at Kestrel. Kestrel looked back withexasperated golden eyes. There were few things they\u003c/p\u003e\n\u003cp\u003eagreed on, but Rowan was one of them.\u003c/p\u003e\n\u003cp\u003e\"Rowan,\" Kestrel said distinctly, \"she wasstaked. \"\u003c/p\u003e\n\u003cp\u003e\"Oh, no.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" Jade said. \"Somebody killed her. And somebody who knew she was a vampire.\"\u003c/p\u003e\n\u003cp\u003eRowan was shaking her head. \"But who would know that?\"\u003c/p\u003e\n\u003cp\u003e\"Well ...\" Jade thought. \"Another vampire.\"\u003c/p\u003e\n\u003cp\u003e\"Or a vampirehunter,\"Kestrel said.\u003c/p\u003e\n\u003cp\u003eRowan looked up, shocked. \"Those aren\u0027t real.They\u0027re just stories to frighten kids-aren\u0027t they?\"\u003c/p\u003e\n\u003cp\u003eKestrel shrugged, but her golden eyes were dark.\u003c/p\u003e\n\u003cp\u003eJade shifted uneasily. The freedom she\u0027d felt on the road, the peace in the living room-and now this.\u003c/p\u003e\n\u003cp\u003eSuddenly she felt empty and isolated.\u003c/p\u003e\n\u003cp\u003eRowan sat down on the stairs, looking too tired and preoccupied to push back the lock of hair plastered\u003c/p\u003e\n\u003cp\u003eto her forehead. \"Maybe I shouldn\u0027t havebrought you here,\" she said softly. \"Maybe it\u0027s worsehere.\" She\u003c/p\u003e\n\u003cp\u003edidn\u0027t say it, but Jade could sense her next thought. Maybe we should go back\u003c/p\u003e\n\u003cp\u003e\"Nothingcould be worse,\" Jade said fiercely. \"And I\u0027d die before I\u0027d go back.\" She meant it. Back to\u003c/p\u003e\n\u003cp\u003ewaiting on every man in sight? Back to arranged marriages and endless restrictions? Back to all those\u003c/p\u003e\n\u003cp\u003edisapproving faces, so quick to condemn anything different, anything that wasn\u0027t done the way it had\u003c/p\u003e\n\u003cp\u003ebeen done four hundred years ago?\u003c/p\u003e\n\u003cp\u003e\"Wecan\u0027t go back,\" she said.\u003c/p\u003e\n\u003cp\u003e\"No, we can\u0027t,\" Kestrel said dryly. \"Literally. Unless we want to end up like Great-aunt Opal.\u003c/p\u003e\n\u003cp\u003eOr\"she paused significantly-\"like Great-uncle Hodge.\"\u003c/p\u003e\n\u003cp\u003eRowan looked up. \"Don\u0027t even say that!\"\u003c/p\u003e\n\u003cp\u003eJade\u0027s stomach felt like a clenched fist. \"They wouldn\u0027t, she said, shoving back at the memory that was\u003c/p\u003e\n\u003cp\u003etrying to emerge. \"Not to their own grandkids. Not to us.\"\u003c/p\u003e\n\u003cp\u003e\"The point,\" Kestrel said, \"is that we can\u0027t go back,so we have to go forward. We\u0027ve got to\u003c/p\u003e\n\u003cp\u003efigure out what we\u0027re going to do here without Aunt Opal tohelp us--especially if there\u0027s a vampire hunter\u003c/p\u003e\n\u003cp\u003earound. But first, what are we going to do withthat?\" She nodded toward the body.\u003c/p\u003e\n\u003cp\u003eRowan just shook her head helplessly. She lookedaround the cellar as if she might find an answer in a\u003c/p\u003e\n\u003cp\u003ecomer. Her gaze fell on Jade. It stopped there, and Jade could see the sisterly radar system turn on.\u003c/p\u003e\n\u003cp\u003e\"Jade. What\u0027s that in your jacket?\"\u003c/p\u003e\n\u003cp\u003eJade was too wrung-out to lie. She opened thejacket and showed Rowan the kittens. \"I didn\u0027t know my\u003c/p\u003e\n\u003cp\u003esuitcase would kill them.\"\u003c/p\u003e\n\u003cp\u003eRowan looked too wrung-out to be angry. She glanced heavenward, sighing. Then, looking back atJade\u003c/p\u003e\n\u003cp\u003esharply: \"But why were you bringing them downhere?\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t. I was just looking for a shovel. I was going to bury them in the backyard.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. Jade looked at her sisters and they looked at each other. Then all three of them\u003c/p\u003e\n\u003cp\u003elooked at the kittens.\u003c/p\u003e\n\u003cp\u003eThen they looked at Great-aunt Opal.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette was crying.\u003c/p\u003e\n\u003cp\u003eIt was a beautiful night, a perfect night. An inversion layer was keeping the air overhead still and warm,\u003c/p\u003e\n\u003cp\u003eand the seeing was excellent. There was very little light pollution and no direct light. The Victorian\u003c/p\u003e\n\u003cp\u003efarmhouse just below Mary-Lynnette\u0027s hill wasmostly dark. Mrs. Burdock was always very consider ate\u003c/p\u003e\n\u003cp\u003eabout that.\u003c/p\u003e\n\u003cp\u003eAbove, the Milky Way cut diagonally across the sky like a river. To the south, where Mary-Lynnette\u003c/p\u003e\n\u003cp\u003ehad just directed her telescope, was the constellation Sagittarius, which always looked. more like a\u003c/p\u003e\n\u003cp\u003eteapot than like an archer to her. And just above the spout of the teapot was a faintly pink patch of what\u003c/p\u003e\n\u003cp\u003elooked like steam.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t steam. It was clouds of stars. A star factory called the Lagoon Nebula. The dust and gas of\u003c/p\u003e\n\u003cp\u003edead stars was being recycled into hot young stars, just being born.\u003c/p\u003e\n\u003cp\u003eIt was four thousand and five hundred light-years away. And she was looking at it, right this minute. A\u003c/p\u003e\n\u003cp\u003eseventeen-year-old kid with a second-hand Newtonian reflector telescope was watching the light of stars\u003c/p\u003e\n\u003cp\u003ebeing born.\u003c/p\u003e\n\u003cp\u003eSometimes she was filled with so much awe andand-and-and longing-that she thought she might break to\u003c/p\u003e\n\u003cp\u003epieces.\u003c/p\u003e\n\u003cp\u003eSince there was nobody else around, she could let the tears roll down her cheeks without pretending it\u003c/p\u003e\n\u003cp\u003ewas an allergy. After a while she had to sit back and wipe her nose and eyes on the shoulder of her\u003c/p\u003e\n\u003cp\u003eT-shirt.\u003c/p\u003e\n\u003cp\u003eOh, come on, give it a rest now, she told herself.You\u0027re crazy, you know.\u003c/p\u003e\n\u003cp\u003eShe wished she hadn\u0027t thought of Jeremy earlier. Because now, for some reason, she kept picturinghim\u003c/p\u003e\n\u003cp\u003ethe way he\u0027d looked that night when he came to watch the eclipse with her. His level brown eyes had\u003c/p\u003e\n\u003cp\u003eheld a spark of excitement, as if he really cared about what he was seeing. As if, for that moment,\u003c/p\u003e\n\u003cp\u003eanyway, he understood.\u003c/p\u003e\n\u003cp\u003eI have been one acquainted with the night, amaudlin little voice inside her chanted romantically, trying to\u003c/p\u003e\n\u003cp\u003eget her to cry again.\u003c/p\u003e\n\u003cp\u003eYeah, right, Mary-Lynnette told the voice cynically. She reached for the bag of Cheetos she kept under\u003c/p\u003e\n\u003cp\u003eher lawn chair. It was impossible to feel romantic and overwhelmed by grandeur while eating Cheetos.\u003c/p\u003e\n\u003cp\u003eSaturn next, she thought, and wiped sticky orangecrumbs off her fingers. It was a good night for Saturn\u003c/p\u003e\n\u003cp\u003ebecause its rings were just passing through theiredgewise position.\u003c/p\u003e\n\u003cp\u003eShe had to hurry because the moon was rising at 11:16. But before she turned her telescope toward\u003c/p\u003e\n\u003cp\u003eSaturn, she took one last look at the Lagoon. Actuallyjust to the east of the Lagoon, trying to make out\u003c/p\u003e\n\u003cp\u003ethe open cluster of fainter stars she knew was there.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t see it. Her eyes just weren\u0027t good enough. If she had a bigger telescope-if she lived inChile\u003c/p\u003e\n\u003cp\u003ewhere the air was dry-if she could get above the earth\u0027s atmosphere . . . then she might have a chance.\u003c/p\u003e\n\u003cp\u003eBut for now . . . she was limited by the human eye. Human pupils just didn\u0027t open farther than 9\u003c/p\u003e\n\u003cp\u003emillimeters.\u003c/p\u003e\n\u003cp\u003eNothing to be done about that.\u003c/p\u003e\n\u003cp\u003eShe was just centering Saturn in the field of viewwhen a light went on behind the farmhouse below. Not\u003c/p\u003e\n\u003cp\u003ea little porch light. A barnyard vapor lamp. Itilluminated the back property of the house like a searchlight.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette sat back, annoyed. It didn\u0027t reallymatter-she could see Saturn anyway, see the rings that\u003c/p\u003e\n\u003cp\u003etonight were just a delicate silver line cutting across the center of the planet. But it was strange.Mrs.\u003c/p\u003e\n\u003cp\u003eBurdock never turned the back light on at night.\u003c/p\u003e\n\u003cp\u003eThe girls, Mary-Lynnette thought. The nieces. Theymust have gotten there and she must be giving them a\u003c/p\u003e\n\u003cp\u003etour. Absently she reached for her binoculars. Shewas curious.\u003c/p\u003e\n\u003cp\u003eThey were good binoculars, Celestron Ultimas,sleek and lightweight. She used them for looking at\u003c/p\u003e\n\u003cp\u003eeverything from deep sky objects to the craters on the moon. Right now, they magnified the back of Mrs.\u003c/p\u003e\n\u003cp\u003eBurdock\u0027s house ten times.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t see Mrs. Burdock, though. She could seethe garden. She could see the shed and the\u003c/p\u003e\n\u003cp\u003efenced-in area where Mrs. Burdock kept her goats. And shecould see three girls, all well illuminated by\u003c/p\u003e\n\u003cp\u003ethe vapor lamp. One had brown hair, one had golden hair, and one had hair the color of Jupiter\u0027s rings.\u003c/p\u003e\n\u003cp\u003eThat silvery.Like starlight. They were carrying something wrapped in plastic between them. Black plastic.\u003c/p\u003e\n\u003cp\u003eHefty garbage bags, if Mary-Lynnette wasn\u0027t mistaken.\u003c/p\u003e\n\u003cp\u003eNow, what on earth were they doing with that?\u003c/p\u003e\n\u003cp\u003eBurying it.\u003c/p\u003e\n\u003cp\u003eThe short one with the silvery hair had a shovel. She was a good little digger, too. In a few minutesshe\u003c/p\u003e\n\u003cp\u003ehad rooted up most of Mrs. Burdock\u0027s irises. Then the medium-sized one with the golden hairtook a turn,\u003c/p\u003e\n\u003cp\u003eand last of all the tall one with the brown hair.\u003c/p\u003e\n\u003cp\u003eThen they picked up the garbage-bagged objecteven though it was probably over five feet long, it\u003c/p\u003e\n\u003cp\u003eseemed very light-and put it in the hole they\u0027d just made.\u003c/p\u003e\n\u003cp\u003eThey began to shovel dirt back into the hole.\u003c/p\u003e\n\u003cp\u003eNo, Mary-Lynnette told herself. No, don\u0027t be ridiculous. Don\u0027t be insane. There\u0027s some mundane, per\u003c/p\u003e\n\u003cp\u003efectly commonplace explanation for this.\u003c/p\u003e\n\u003cp\u003eThe problem was, she couldn\u0027t think of any.\u003c/p\u003e\n\u003cp\u003eNo, no, no. This is notRear Window,we are not in the Twilight Zone. They\u0027re just burying-something.\u003c/p\u003e\n\u003cp\u003eSome sort of ... ordinary ...\u003c/p\u003e\n\u003cp\u003eWhat else besides a dead body was five-feet-andsome-odd-inches long, rigid, and needed to be\u003c/p\u003e\n\u003cp\u003ewrapped in garbage bags before burial?\u003c/p\u003e\n\u003cp\u003eAnd, Mary-Lynnette thought, feeling a rush ofadrenaline that made her heart beat hard. And.\u003c/p\u003e\n\u003cp\u003eAnd...\u003c/p\u003e\n\u003cp\u003eWhere was Mrs. Burdock?\u003c/p\u003e\n\u003cp\u003eThe adrenaline was tingling painfully in herpalms\u003c/p\u003e\n\u003cp\u003eand feet. It made her feel out of control, which she hated. Her hands were shaking so badly she had to\u003c/p\u003e\n\u003cp\u003elower the binoculars.\u003c/p\u003e\n\u003cp\u003eMrs. B.\u0027s okay. She\u0027s all right. Things like thisdon\u0027thappenin real life.\u003c/p\u003e\n\u003cp\u003eWhat would Nancy Drew do?\u003c/p\u003e\n\u003cp\u003eSuddenly, in the middle of her panic, MaryLynnette felt a tiny giggle try to escape like a burp. Nancy\u003c/p\u003e\n\u003cp\u003eDrew, of course, would hike right down there and investigate. She\u0027d eavesdrop on the girls from behind a\u003c/p\u003e\n\u003cp\u003ebush and then dig up the garden once they went back inside the house.\u003c/p\u003e\n\u003cp\u003eBut things like that didn\u0027t happen. Mary-Lynnette couldn\u0027t even imagine trying to dig up a neighbor\u0027s\u003c/p\u003e\n\u003cp\u003egarden in the dead of night. She would get caught and it would be a humiliating farce. Mrs. Burdock\u003c/p\u003e\n\u003cp\u003ewould walk out of the house alive and alarmed, and Mary-Lynnette would dieof embarrassment trying to\u003c/p\u003e\n\u003cp\u003eexplain.\u003c/p\u003e\n\u003cp\u003eIn a book that might be amusing. In real life-she didn\u0027t even want to think about it.\u003c/p\u003e\n\u003cp\u003eOne good thing, it made her realize how absurd her paranoia was. Deep down, she obviously knew\u003c/p\u003e\n\u003cp\u003eMrs. B. was just fine. Otherwise, she wouldn\u0027t besitting here; she\u0027d be calling the police, like any sensi ble\u003c/p\u003e\n\u003cp\u003eperson.\u003c/p\u003e\n\u003cp\u003eSomehow, though, she suddenly felt tired. Not up to more starwatching. She checked her watch by the\u003c/p\u003e\n\u003cp\u003eruby glow of a red-filtered flashlight. Almost eleven-well, it was all over in sixteen minutes anyway. When\u003c/p\u003e\n\u003cp\u003ethe moon rose it would bleach out the sky.\u003c/p\u003e\n\u003cp\u003eBut before she broke down her telescope for the trip back, she picked up the binoculars again. Just one\u003c/p\u003e\n\u003cp\u003elast look.\u003c/p\u003e\n\u003cp\u003eThe garden was empty. A rectangle of fresh darksoil showed where it had been violated. Even as\u003c/p\u003e\n\u003cp\u003eMary-Lynnette watched, the vapor lamp went out.\u003c/p\u003e\n\u003cp\u003eIt wouldn\u0027t do any harm to go over there tomorrow, Mary-Lynnette thought. Actually, I was goingto,\u003c/p\u003e\n\u003cp\u003eanyway. I should welcome those girls to the neighborhood. I should return those pruning shears Dad\u003c/p\u003e\n\u003cp\u003eborrowed and the knife Mrs. B. gave me to get my gas cap off. And of course I\u0027ll see Mrs. B. there, and\u003c/p\u003e\n\u003cp\u003ethen I\u0027ll know everything\u0027s okay.\u003c/p\u003e\n\u003cp\u003eAsh reached the top of the winding road andstopped to admire the blazing point of light in the south.\u003c/p\u003e\n\u003cp\u003eYou really could see more from these isolated\u003c/p\u003e\n\u003cp\u003ecountry towns. From here Jupiter, the king of the planets, looked like a UFO.\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" a voice nearby said. \"I\u0027vebeen waiting for you for hours.\"\u003c/p\u003e\n\u003cp\u003eAsh answered without turning around. \"Wherehave I been? Where have you been? We were supposed\u003c/p\u003e\n\u003cp\u003eto meet onthat hill, Quinn.\" Hands in his pockets, he pointed with an elbow.\u003c/p\u003e\n\u003cp\u003e\"Wrong. It was this hill and I\u0027ve been sitting righthere waiting for you the entire time. But forget it.\u003c/p\u003e\n\u003cp\u003eAre they here or aren\u0027t they?\"\u003c/p\u003e\n\u003cp\u003eAsh turned and walked unhurriedly to the open convertible that was parked just beside the road, itslights\u003c/p\u003e\n\u003cp\u003eoff. He leaned one elbow on the door, looking down. \"They\u0027re here. I told you they would be. It was the\u003c/p\u003e\n\u003cp\u003eonly place for them to go.\"\u003c/p\u003e\n\u003cp\u003e\"All three of them?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, all three of them. My sisters always stick together.\"\u003c/p\u003e\n\u003cp\u003eQuinn\u0027s lip curled. \"Lamia are so wonderfully family oriented.\"\u003c/p\u003e\n\u003cp\u003e\"And made vampires are so wonderfully . . . short,\" Ash said serenely, looking at the sky again.\u003c/p\u003e\n\u003cp\u003eQuinn gave him a look like black ice. His e-mail, compact body was utterly still inside the car. \"Well,\u003c/p\u003e\n\u003cp\u003enow, I never got to finish growing, did I?\" he saidvery softly. \"One of your ancestors took care of that.\"\u003c/p\u003e\n\u003cp\u003eAsh boosted himself to sit on the hood of the car,long legs dangling. \"I think I may stop aging this year\u003c/p\u003e\n\u003cp\u003emyself,\" he said blandly, still looking down the slope. \"Eighteen\u0027s not such a bad age.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe not if you have a choice,\" Quinn said, his voice still as soft as dead leaves falling. \"Try\u003c/p\u003e\n\u003cp\u003ebeingeighteen for four centuries-with no end in sight.\"\u003c/p\u003e\n\u003cp\u003eAsh turned to smile at him again. \"Sorry. On my family\u0027s behalf.\"\u003c/p\u003e\n\u003cp\u003e\"And I\u0027m sorry for your family. The Redferns have been having a little trouble lately, haven\u0027t they?\u003c/p\u003e\n\u003cp\u003eLet\u0027s see if I\u0027ve got it right. First your uncle Hodge breaks Night World law and is appropriately\u003c/p\u003e\n\u003cp\u003epunished-\"\u003c/p\u003e\n\u003cp\u003e\"My great-uncle by marriage,\" Ash interrupted in polite tones, holding one finger up. \"He was a\u003c/p\u003e\n\u003cp\u003eBurdock, not a Redfern. And that was over ten years ago.\"\u003c/p\u003e\n\u003cp\u003e\"And then your aunt Opal-\"\u003c/p\u003e\n\u003cp\u003e\"Mygreat-auntOpal-\"\u003c/p\u003e\n\u003cp\u003e\"Disappears completely. Breaks off all contact withthe Night World. Apparently because she prefers\u003c/p\u003e\n\u003cp\u003eliving in the middle of nowhere with humans.\"\u003c/p\u003e\n\u003cp\u003eAsh shrugged, eyes fixed on the southern horizon. \"It must be good hunting in the middle of nowhere\u003c/p\u003e\n\u003cp\u003ewith humans. No competition. And no Night Worldenforcement-no Elders putting a limit on how many\u003c/p\u003e\n\u003cp\u003eyou can bag.\"\u003c/p\u003e\n\u003cp\u003e\"And no supervision,\" Quinn said sourly. \"Itdoesn\u0027t matter so much thatshe\u0027s been living here, but\u003c/p\u003e\n\u003cp\u003eshe\u0027s obviously been encouraging your sisters to join her. You should have informed on them whenyou\u003c/p\u003e\n\u003cp\u003efound out they were writing to each other secretly.\"\u003c/p\u003e\n\u003cp\u003eAsh shrugged, uncomfortable. \"It wasn\u0027t againstthe law. I didn\u0027t know what they had in mind.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not just them,\" Quinn said in his disturbingly soft voice. \"You know there are rumors about\u003c/p\u003e\n\u003cp\u003ethat cousin of yours-James Rasmussen. People are saying that he fell in love with a human girl. That she\u003c/p\u003e\n\u003cp\u003ewas dying and he decided to change her withoutpermission. . . .\"\u003c/p\u003e\n\u003cp\u003eAsh slid off the hood and straightened. \"I never listen to rumors,\" he said, briskly and untruthfully.\u003c/p\u003e\n\u003cp\u003e\"Besides, that\u0027s not the problem right now, is it?\"\u003c/p\u003e\n\u003cp\u003e\"No. The problem is your sisters and the mess they\u0027re in. And whether you can really do what\u0027s\u003c/p\u003e\n\u003cp\u003enecessary to dean it up.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, Quinn. I can handle it.\"\u003c/p\u003e\n\u003cp\u003e\"ButI doworry, Ash. I don\u0027t know how I let you talk me into this.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t. You lost that game of poker.\"\u003c/p\u003e\n\u003cp\u003e\"And you cheated.\" Quinn was looking off into a middle distance, his dark eyes narrowed, his\u003c/p\u003e\n\u003cp\u003emoutha straight line. \"I still think we should tell the Elders ,\" he said abruptly. \"It\u0027s the only way to\u003c/p\u003e\n\u003cp\u003eguarantee a really thorough investigation.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why it needs to be so thorough.They\u0027ve only been here a few hours.\"\u003c/p\u003e\n\u003cp\u003e\"Your sisters have only been here a few hours.Your aunt has been here-how long? Ten years?\"\u003c/p\u003e\n\u003cp\u003e\"What have you got against my aunt, Quinn?\"\u003c/p\u003e\n\u003cp\u003e\"Her husband was a traitor. She\u0027s a traitor now for encouraging those girls to run away. And who\u003c/p\u003e\n\u003cp\u003eknowswhat she\u0027s been doing here in the last ten years? Who knows how many humans she\u0027s told about\u003c/p\u003e\n\u003cp\u003ethe Night World?\"\u003c/p\u003e\n\u003cp\u003eAsh shrugged, examining his nails. \"Maybe she hasn\u0027t told any.\"\u003c/p\u003e\n\u003cp\u003e\"And maybe she\u0027s told the whole town.\"\u003c/p\u003e\n\u003cp\u003e\"Quinn,\" Ash said patiently, speaking as if to avery young child, \"if my aunt has broken the laws\u003c/p\u003e\n\u003cp\u003eof the Night World, she has to die. For the family honor. Any blotch on that reflects onme.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one thing I can count on,\" Quinn said halfunder his breath. \u0027,\u0027Your self-interest. You\u003c/p\u003e\n\u003cp\u003ealways look after Number One, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t everybody?\"\u003c/p\u003e\n\u003cp\u003e\"Not everybody is quite so blatant about it.\" There was a pause, then Quinn said, \"And what\u003c/p\u003e\n\u003cp\u003eabout your sisters?\"\u003c/p\u003e\n\u003cp\u003e\"What about them?\"\u003c/p\u003e\n\u003cp\u003e\"Can you kill them if it\u0027s necessary?\"\u003c/p\u003e\n\u003cp\u003eAsh didn\u0027t blink. \"Of course. If it\u0027s necessary. For the family honor.\"\u003c/p\u003e\n\u003cp\u003e\"If they\u0027ve let something slip about the NightWorld-\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not stupid.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re innocent. They might get tricked. That\u0027swhat happens when you live on an island\u003c/p\u003e\n\u003cp\u003ecompletely isolated from normal humans. You never learn how cunning vermin can be.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we know how cunning they can be,\" Ash said, smiling. \"And what to do about them.\"\u003c/p\u003e\n\u003cp\u003eFor the first time Quinn himself smiled, a charming, almost dreamy smile. \"Yes, I know your views on\u003c/p\u003e\n\u003cp\u003ethat. All right. I\u0027ll leave you here to take care of it. I don\u0027t need to tell you to check out every human those\u003c/p\u003e\n\u003cp\u003egirls have had contact with. Do a good job and maybe you can save your familyhonor.\"\u003c/p\u003e\n\u003cp\u003e\"Not to mention the embarrassment of a public trial.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come back in a week. And if you haven\u0027t got things under control, I go to the Elders. I don\u0027t\u003c/p\u003e\n\u003cp\u003emean your Redfern family Elders, either. I\u0027m taking it all the way up to the joint Council.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, fine,\" Ash said. \"You know, you really ought to get a hobby, Quinn. Go hunting yourself.\u003c/p\u003e\n\u003cp\u003eYou\u0027re too repressed.\"\u003c/p\u003e\n\u003cp\u003e-252Quinn ignored that and said shortly, \"Do you know where to start?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. The girls are right ... down ... there.\" Ashturned east. With one eye shut, he zeroed in with\u003c/p\u003e\n\u003cp\u003ehis finger on a patch of light in the valley below. \"At Burdock Farm. I\u0027ll check things out in town, then I\u0027ll\u003c/p\u003e\n\u003cp\u003ego look up the nearest vermin.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-daughters-of-darkness-night-world-2/page-3.html","bookId":1862,"creation":"Oct 5, 2019 4:39:54 PM","modification":"Oct 5, 2019 4:39:54 PM"}
