{"id":82071,"no":6,"title":"Page 6","content":"\u003cp\u003eWhydidn\u0027t we just kill her?\" Kestrel asked.\u003c/p\u003e\n\u003cp\u003eRowan and Jade looked at each other. There were few things they agreed on, but one of them was\u003c/p\u003e\n\u003cp\u003edefinitely Kestrel.\u003c/p\u003e\n\u003cp\u003e. \"First of all, we agreed not to do that here. Wedon\u0027t use our powers-\"\u003c/p\u003e\n\u003cp\u003e\"And we don\u0027t feed onhumans. Or kill them,\" Kestrel finished the chant. \"But you already used your\u003c/p\u003e\n\u003cp\u003epowers tonight; you called Jade.\"\u003c/p\u003e\n\u003cp\u003e\"I had to let her know what story I\u0027d just toldabout Aunt Opal. Actually, I should have planned\u003c/p\u003e\n\u003cp\u003eforthis earlier. I should have realized that people are going to come and ask where Aunt Opal is.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s the only one who\u0027s asking. If we killed her-\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t just go killing people in our new home,\"Rowan said tightly. \"Besides, she said she had family\u003c/p\u003e\n\u003cp\u003ewaiting for her. Are we going to kill all of them?\"\u003c/p\u003e\n\u003cp\u003eKestrel shrugged.\u003c/p\u003e\n\u003cp\u003e\"We arenotgoing to start a blood feud,\" Rowan said even more tightly.\u003c/p\u003e\n\u003cp\u003e\"But what about influencing her?\" Jade said. Shewas sitting with Tiggy in her arms, kissing the\u003c/p\u003e\n\u003cp\u003evelvety black top of the kitten\u0027s head. \"Making her forget she\u0027s suspicious-or making her think she saw\u003c/p\u003e\n\u003cp\u003eAunt Opal?\"\u003c/p\u003e\n\u003cp\u003e\"That would be fine-if it were just her,\" Rowansaid patiently. \"But it\u0027s not. Are we going to influ\u003c/p\u003e\n\u003cp\u003eenceeveryone who comes to the house? What aboutpeople who call on the phone? What about\u003c/p\u003e\n\u003cp\u003eteachers?You two are supposed to start school in a couple of weeks.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe we\u0027ll just have to miss that,\" Kestrel said without regret.\u003c/p\u003e\n\u003cp\u003eRowan was shaking her head. \"We need a permanent solution. We need to find some reasonable\u003c/p\u003e\n\u003cp\u003eexplanation for why Aunt Opal is gone.\"\u003c/p\u003e\n\u003cp\u003e\"We need to move Aunt Opal,\" Kestrel said flatly.\"We need to get rid of her.\"\u003c/p\u003e\n\u003cp\u003e\"No, no. We might have to produce the body,\"Rowan said.\u003c/p\u003e\n\u003cp\u003e\"Looking likethat?\"\u003c/p\u003e\n\u003cp\u003eThey began to argue about it. Jade rested her chin on Tiggy\u0027s head and stared out the multipaned kitchen\u003c/p\u003e\n\u003cp\u003ewindow. She was thinking about Mark Carter, who had such a gallant heart. It gave her a pleasantly\u003c/p\u003e\n\u003cp\u003eforbidden thrill just to picture him. Back home there weren\u0027t any humans wandering around free. She\u003c/p\u003e\n\u003cp\u003ecould never have been tempted to break NightWorld law and fall in love with one. But here ...yes, Jade\u003c/p\u003e\n\u003cp\u003ecould almost imagine falling in love with Mark Carter. Just as if she were a human girl.\u003c/p\u003e\n\u003cp\u003eShe shivered deliriously. But just as she was tryingto picture what human girls did when they were in\u003c/p\u003e\n\u003cp\u003elove, Tiggy gave a sudden heave. He twisted out of her arms and hit the kitchen floor running. The fur on\u003c/p\u003e\n\u003cp\u003ehis back was up.\u003c/p\u003e\n\u003cp\u003eJade looked at the window again.She couldn\u0027t see anything. But ...she felt ...\u003c/p\u003e\n\u003cp\u003eShe turned to her sisters. \"Something was out there in the garden tonight,\" she said. \"And Icouldn\u0027t smell\u003c/p\u003e\n\u003cp\u003eit.\"\u003c/p\u003e\n\u003cp\u003eRowan and Kestrel were still arguing. They didn\u0027t hear her.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette opened her eyes and sneezed. She\u0027d overslept. Sun was shining around the edges of her\u003c/p\u003e\n\u003cp\u003edark blue curtains.\u003c/p\u003e\n\u003cp\u003eGet up and get to work, she told herself. But instead she lay rubbing sleep out of her eyes and tryingto\u003c/p\u003e\n\u003cp\u003ewake up. She was a night person, not a morningperson.\u003c/p\u003e\n\u003cp\u003eThe room was large and painted twilight blue. Mary-Lynnette had stuck the glow-in-the-dark starsand\u003c/p\u003e\n\u003cp\u003eplanets to the ceiling herself. Taped onto the dresser mirror was a bumper sticker saying I BRAKEFOR\u003c/p\u003e\n\u003cp\u003eASTEROIDS.On the walls were a giant relief map of the moon, a poster from the Sky-Gazer\u0027s Almanac,\u003c/p\u003e\n\u003cp\u003eand photographic prints of the Pleiades,theHorsehead Nebula, and the total eclipse of 1995.\u003c/p\u003e\n\u003cp\u003eIt was Mary-Lynnette\u0027s retreat, the place to go when people didn\u0027t understand. She always felt safeinthe\u003c/p\u003e\n\u003cp\u003enight.\u003c/p\u003e\n\u003cp\u003eShe yawned and staggered to the bathroom, grabbing a pair of jeans and a T-shirt on the way. She was\u003c/p\u003e\n\u003cp\u003ebrushing her hair as she walked down the stairs when she heard voices from the living room.\u003c/p\u003e\n\u003cp\u003e-252Claudine\u0027s voice ... and a male voice. Not Mark; weekdays he usually went to his friend Ben\u0027s\u003c/p\u003e\n\u003cp\u003ehouse.A stranger.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette peeked through the kitchen. Therewas a guy sitting on the living room couch. She could\u003c/p\u003e\n\u003cp\u003esee only the back of his head, which was ash blond. Mary-Lynnette shrugged and started to open the\u003c/p\u003e\n\u003cp\u003erefrigerator, when she heard her own name.\u003c/p\u003e\n\u003cp\u003e\"Mary-Lynnette is very good friends with her,\" Claudine was saying in her quick, lightly accented\u003c/p\u003e\n\u003cp\u003evoice. \"I remember a few years ago she helped her fix up a goat shed.\"\u003c/p\u003e\n\u003cp\u003eThey\u0027re talking about Mrs. B.!\u003c/p\u003e\n\u003cp\u003e\"Why does she keep goats? I think she told Mary-Lynnette it would help since she couldn\u0027t get out that\u003c/p\u003e\n\u003cp\u003emuch anymore.\"\u003c/p\u003e\n\u003cp\u003e\"How strange,\" the guy said. He had a lazy, careless-sounding voice. \"I wonder what she meant\u003c/p\u003e\n\u003cp\u003ebythat.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette, who was now peering intently through the kitchen while keeping absolutely still,saw\u003c/p\u003e\n\u003cp\u003eClaudine give one of her slight, charming shrugs.\u003c/p\u003e\n\u003cp\u003e\"I suppose she meant the milk-every day she has fresh milk now. She doesn\u0027t have to go to the\u003c/p\u003e\n\u003cp\u003estore. But I don\u0027t know. You\u0027ll have to ask her yourself.\" She laughed.\u003c/p\u003e\n\u003cp\u003e-252Not going to be easy, Mary-Lynnette thought. Now, why would some strange guy be here asking\u003c/p\u003e\n\u003cp\u003equestions about Mrs. B.?\u003c/p\u003e\n\u003cp\u003eOf course. He had to be police or something. FBI.But his voice made her wonder. He sounded too\u003c/p\u003e\n\u003cp\u003eyoung to be either, unless he was planning to infiltrate Dewitt High as a narc. Mary-Lynnette edgedfarther\u003c/p\u003e\n\u003cp\u003einto the kitchen, getting a better view.There-she could see him in the mirror.\u003c/p\u003e\n\u003cp\u003eDisappointment coursed through her.\u003c/p\u003e\n\u003cp\u003eDefinitely not old enough to be FBI. And much asMary-Lynnette wanted him to be a keen-eyed, quick\u003c/p\u003e\n\u003cp\u003ewitted, hard-driving detective, he wasn\u0027t. He was only the handsomest boy she\u0027d ever seen in her life.\u003c/p\u003e\n\u003cp\u003eHe was lanky and elegant, with long legs stretched out in front of him, ankles crossed under the coffee\u003c/p\u003e\n\u003cp\u003etable. He looked like a big amiable cat. He had deancut features, slightly tilted wicked eyes, and a\u003c/p\u003e\n\u003cp\u003edisarming lazy grin.\u003c/p\u003e\n\u003cp\u003eNot just lazy, Mary-Lynnette decided. Fatuous. Bland. Maybe even stupid. She wasn\u0027t impressed by\u003c/p\u003e\n\u003cp\u003egood looks unless they were the thin, brown, and interesting kind, like-well, like Jeremy Lovett for\u003c/p\u003e\n\u003cp\u003einstance. Gorgeous guys-guys who looked like bigash-blond cats-didn\u0027t have any reason to develop their\u003c/p\u003e\n\u003cp\u003eminds. They were self-absorbed and vain. With IQs barely high enough to keep a seat warm.\u003c/p\u003e\n\u003cp\u003eAnd this guy looked as if he couldn\u0027t get awake orserious to save his life.\u003c/p\u003e\n\u003cp\u003eI don\u0027t care what he\u0027s here for. Ithink I\u0027ll go upstairs.\u003c/p\u003e\n\u003cp\u003eit was then that the guy on the couch lifted onehand, wiggling the fingers in the air. He half-turned. Not\u003c/p\u003e\n\u003cp\u003efar enough actually to look at Mary-Lynnette,but far enough to make it dear he was talking to\u003c/p\u003e\n\u003cp\u003esomebody behind him. She could now see his profilein the mirror. \"Hi, there.\"\u003c/p\u003e\n\u003cp\u003e\"Mary-Lynnette, is that you?\" Claudine called.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Mary-Lynnette opened the refrigerator doorand made banging noises. \"Just getting some\u003c/p\u003e\n\u003cp\u003ejuice. Then I\u0027m going out.\"\u003c/p\u003e\n\u003cp\u003eHer heard was beating hard-with embarrassmentand annoyance. Okay, so he must have seen her in the\u003c/p\u003e\n\u003cp\u003emirror. He probably thought she was staring at him because of the way he looked. He probably had\u003c/p\u003e\n\u003cp\u003epeople staring at him everywhere he went. So what, big deal, go away.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t go yet,\" Claudine called. \"Come out here and talk for a few minutes.\"\u003c/p\u003e\n\u003cp\u003eNo. Mary-Lynnette knew it was a childish and stupid reaction, but she couldn\u0027t help it. She banged a\u003c/p\u003e\n\u003cp\u003ebottle of apricot juice against a bottle of Calistoga sparkling water.\u003c/p\u003e\n\u003cp\u003e\"Come meet Mrs. Burdock\u0027s nephew,\" Claudine called.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette went still.\u003c/p\u003e\n\u003cp\u003eShe stood in the cold air of the refrigerator, lookingsightlessly at the temperature dial in the back. Then\u003c/p\u003e\n\u003cp\u003eshe put the bottle of apricot juice down. She twisted a Coke out of a six-pack without seeing it.\u003c/p\u003e\n\u003cp\u003eWhat nephew? I don\u0027t remember hearing about any nephew.\u003c/p\u003e\n\u003cp\u003eBut then, she\u0027d never heard much about Mrs. B.\u0027s nieces either, not until they were coming out. Mrs. B.\u003c/p\u003e\n\u003cp\u003ejust didn\u0027t talk about her familymuch.\u003c/p\u003e\n\u003cp\u003eSo he\u0027s her nephew. . . that\u0027s why he\u0027s askingabout her. But does he know? Ishe in on it with those girls?\u003c/p\u003e\n\u003cp\u003eOr is he after them? Or .. .\u003c/p\u003e\n\u003cp\u003eThoroughly confused, she walked into the living room.\u003c/p\u003e\n\u003cp\u003e\"Mary-Lynnette, this is Ash. He\u0027s here to visit withhis aunt and his sisters,\" Claudine said. \"Ash,\u003c/p\u003e\n\u003cp\u003ethis isMary-Lynnette. The one who\u0027s such good friends with your aunt.\"\u003c/p\u003e\n\u003cp\u003eAsh gotup, all in one lovely, lazy motion. Just like a cat, including the stretch in the middle. \"Hi.\"\u003c/p\u003e\n\u003cp\u003eHe offered a hand. Mary-Lynnette touched it withfingers damp and cold from the Coke can, glanced up\u003c/p\u003e\n\u003cp\u003eat his face, and said \"Hi.\"\u003c/p\u003e\n\u003cp\u003eExcept that it didn\u0027t happen that way.\u003c/p\u003e\n\u003cp\u003eIf happened like this: Mary-Lynnette had her eyeson the carpet as she came in, which gave her a good\u003c/p\u003e\n\u003cp\u003eview of his Nike tennis shoes and the ripped kneesof his jeans. When he stood up she looked at his\u003c/p\u003e\n\u003cp\u003eT-shirt, which had an obscure design-a black floweron a white background. Probably the emblem of\u003c/p\u003e\n\u003cp\u003esome rock group. And then when his hand entered her field of vision, she reached for it automatically,\u003c/p\u003e\n\u003cp\u003emuttering a greeting and looking up at his face justas she touched it. And This was the part that was hard\u003c/p\u003e\n\u003cp\u003eto describe.\u003c/p\u003e\n\u003cp\u003eContact.\u003c/p\u003e\n\u003cp\u003eSomethinghappened.\u003c/p\u003e\n\u003cp\u003eHey, don\u0027t I know you?\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t. That was the thing. She didn\u0027t know him-but she felt that she should. She also felt as if\u003c/p\u003e\n\u003cp\u003esomebody had reached inside her and touched herspine with a live electric wire. It was extremely not\u003c/p\u003e\n\u003cp\u003eenjoyable. The room turned vaguely pink. Her throat swelled and she could feel her heart beating there.\u003c/p\u003e\n\u003cp\u003eAlso not-enjoyable. But somehow when you put it alltogether, it made a kind of trembly dizziness like ...\u003c/p\u003e\n\u003cp\u003eLike what she felt when she looked at the Lagoon Nebula. Or imagined galaxies gathered into dusters\u003c/p\u003e\n\u003cp\u003eand superclusters, bigger and bigger, until size lost any meaning and she felt herself falling.\u003c/p\u003e\n\u003cp\u003eShe was falling now. She couldn\u0027t see anything except his eyes. And those eyes were strange, prismlike,\u003c/p\u003e\n\u003cp\u003echanging color like a star seen throughheavy atmosphere. Now blue, now gold, now violet.\u003c/p\u003e\n\u003cp\u003eOh, take this away. Please, I don\u0027t want it.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s so good to see a new face around here, isn\u0027tit? We\u0027re very boring out here by ourselves,\"\u003c/p\u003e\n\u003cp\u003eClaudine said, in completely normal and slightly flustered tones. Mary-Lynnette was snapped out of her\u003c/p\u003e\n\u003cp\u003etrance, and she reacted as if Ash had just offered her a mongoose instead of his hand. She jumped\u003c/p\u003e\n\u003cp\u003ebackward,looking anywhere but at him. She had the feeling of being saved from falling down a mine\u003c/p\u003e\n\u003cp\u003eshaft.\u003c/p\u003e\n\u003cp\u003e\"O-kay,\" Claudine _ said in her cute accent.\"Hmm.\" She was twisting a strand of curly dark hair,\u003c/p\u003e\n\u003cp\u003esomething she only did when she was extremely ner vous. \"Maybe you guys know each other already?\"\u003c/p\u003e\n\u003cp\u003eThere was a silence.\u003c/p\u003e\n\u003cp\u003eI should say something, Mary-Lynnette thoughtdazedly, staring at the fieldstone fireplace. I\u0027m acting\u003c/p\u003e\n\u003cp\u003ecrazy and humiliating Claudine.\u003c/p\u003e\n\u003cp\u003eBut what just happened here?\u003c/p\u003e\n\u003cp\u003eDoesn\u0027t matter. Worry later. She swallowed, plastered a smile on her face, and said, \"So, how long are\u003c/p\u003e\n\u003cp\u003eyou here for?\"\u003c/p\u003e\n\u003cp\u003eHer mistake was that then she looked at him. Andit all happened again. Not quite as vividly as before,\u003c/p\u003e\n\u003cp\u003emaybe because she wasn\u0027t touching him. But the electric shock feeling was the same.\u003c/p\u003e\n\u003cp\u003eAndhelooked like a cat who\u0027s had a shock. Bristling. Unhappy. Astonished. Well, at least he wasawake,\u003c/p\u003e\n\u003cp\u003eMary-Lynnette thought. He and Mary-Lynnettestared at each other while the room spun andturned pink.\u003c/p\u003e\n\u003cp\u003e\"Whoare you?\" Mary-Lynnette said, abandoning any vestige of politeness.\u003c/p\u003e\n\u003cp\u003e\"Who areyou?\" he said, in just about exactly the same tone.\u003c/p\u003e\n\u003cp\u003eThey both glared.\u003c/p\u003e\n\u003cp\u003eClaudine was making little clicking noises with her tongue and clearing away the tomato juice. Mary\u003c/p\u003e\n\u003cp\u003eLynnette felt distantly sorry for her, but couldn\u0027tspare her any attention. Mary-Lynnette\u0027s whole\u003c/p\u003e\n\u003cp\u003econsciousness was focused on the guy in front of her; on fighting him, on blocking him out. On getting rid\u003c/p\u003e\n\u003cp\u003eof this bizarre feeling that she was one of two puzzle pieces that had just been snapped together.\u003c/p\u003e\n\u003cp\u003e\"Now, look,\" she said tensely, at the precise moment that he began brusquely, \"Look-\"\u003c/p\u003e\n\u003cp\u003eThey both stopped and glared again. Then Mary-Lynnette managed to tear her eyes away. Something\u003c/p\u003e\n\u003cp\u003ewas tugging at her mind... .\u003c/p\u003e\n\u003cp\u003e\"Ash,\" she said, getting hold of it.\"Ash. Mrs. Burdockdid say something about you ... about a\u003c/p\u003e\n\u003cp\u003elittleboy named Ash. I didn\u0027t know she was talking abouther nephew.\"\u003c/p\u003e\n\u003cp\u003e\"Great-nephew,\" Ash said, his voice not quite steady. \"What did she say?\"\u003c/p\u003e\n\u003cp\u003e\"She said that you were a bad little boy, and that you were probably going to grow up even\u003c/p\u003e\n\u003cp\u003eworse.\"\u003c/p\u003e\n\u003cp\u003e\"Well, she had thatright,\" Ash said, and his ex pression softened a bit-as if he were on more\u003c/p\u003e\n\u003cp\u003efamiliar ground.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette\u0027s heart was slowing. She found thatif she concentrated, she could make the strange feel\u003c/p\u003e\n\u003cp\u003eings recede. It helped if she looked away from Ash.\u003c/p\u003e\n\u003cp\u003eDeep breath, she told herself. And another. Okay,now let\u0027s get things straight. Let go of what just hap\u003c/p\u003e\n\u003cp\u003epened; forget all that; think about it later. What\u0027s important now?\u003c/p\u003e\n\u003cp\u003eWhat was important nowwas that: 1) This guy was the brother of those girls; 2) He might be in on\u003c/p\u003e\n\u003cp\u003ewhatever had happened to Mrs. B.; and, 3) If he wasn\u0027tin on it, he might be able to help with some\u003c/p\u003e\n\u003cp\u003einforma tion. Such as whether his aunt had left a will, and if so, who got the family jewels.\u003c/p\u003e\n\u003cp\u003eShe glanced at Ash from the side of her eye. He definitely looked calmer. Hackles going down. Chest\u003c/p\u003e\n\u003cp\u003elifting more slowly. They were both switching gear.\u003c/p\u003e\n\u003cp\u003e\"So Rowan and Kestrel and Jade are your sisters,\" she said, with all the polite nonchalance she\u003c/p\u003e\n\u003cp\u003ecould muster. \"They seem nice.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you knew them,\" Claudine said,and Mary-Lynnette realized her stepmother was\u003c/p\u003e\n\u003cp\u003ehovering in the doorway, petite shoulder against thedoorjamb, arms crossed, dishtowel in hand. \"I told\u003c/p\u003e\n\u003cp\u003ehim you hadn\u0027t met them.\"\u003c/p\u003e\n\u003cp\u003e\"Mark and I went over there yesterday,\" MaryLynnette said. And when she said it, something\u003c/p\u003e\n\u003cp\u003eflashed in Ash\u0027s face--something there and gone before she could really analyze it. But it made her feelas\u003c/p\u003e\n\u003cp\u003eifshe were standing on the edge of a cliff in a cold wind.\u003c/p\u003e\n\u003cp\u003eWhy? What could be wrong with mentioning she\u0027d met the girls?\u003c/p\u003e\n\u003cp\u003e\"You and Mark . . .and Mark would be-yourbrother?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right,\" Claudine said from the doorway.\u003c/p\u003e\n\u003cp\u003e\"Any other brothers or sisters?\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette blinked. \"What, you\u0027re taking a census?\"\u003c/p\u003e\n\u003cp\u003eAsh did a bad imitation of his former lazy smile. \"I just like to keep track of my sisters\u0027 friends.\"\u003c/p\u003e\n\u003cp\u003eWhy?\"To see if you approve or something?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, yes.\" He did the smile again, with moresuccess. \"We\u0027re an old-fashioned family. Very\u003c/p\u003e\n\u003cp\u003eold-fashioned.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette\u0027s jaw dropped. Then, all at once,she felt happy. Now she didn\u0027t need to think about\u003c/p\u003e\n\u003cp\u003emurders or pink rooms or what this guy knew. All she needed to think about was what she was goingto\u003c/p\u003e\n\u003cp\u003edo to him.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re an old-fashioned family,\" she said, moving a step forward.\u003c/p\u003e\n\u003cp\u003eAsh nodded.\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re in charge,\" Mary-Lynnette said.\u003c/p\u003e\n\u003cp\u003e\"Well, out here. Back home, my father is.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re just going to tell your sisters which friends they can have. Maybe you get to decide\u003c/p\u003e\n\u003cp\u003eyour aunt\u0027s friends, too?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I was just discussing that....\"He waved a hand toward Claudine.\u003c/p\u003e\n\u003cp\u003eYes, you were, Mary-Lynnette realized. She took another step toward Ash, who was still smiling.\u003c/p\u003e\n\u003cp\u003e\"Oh, no,\" Claudine said. She flapped her dishtowelonce. \"Don\u0027t smile.\"\u003c/p\u003e\n\u003cp\u003e\"I like a girl with spirit,\" Ash offered, as if he\u0027dworked hard on finding the most obnoxious thing\u003c/p\u003e\n\u003cp\u003epossible to say. Then, with a sort of determined bravado, he winked, reached out, and chucked\u003c/p\u003e\n\u003cp\u003eMary-Lynnette under the chin.\u003c/p\u003e\n\u003cp\u003eFzzz! Sparks. Mary-Lynnette sprang back. So didAsh, looking at his own hand as if it had betrayed\u003c/p\u003e\n\u003cp\u003ehim.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette had an inexplicable impulse to knock Ash flat and fall down on top of him. She\u0027d never\u003c/p\u003e\n\u003cp\u003efelt that for any boy before.\u003c/p\u003e\n\u003cp\u003eShe ignored the impulse and kicked him in the shin.\u003c/p\u003e\n\u003cp\u003eHe yelped and hopped backward. Once again the sleepy smugness was gone from his face. He looked\u003c/p\u003e\n\u003cp\u003ealarmed.\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027d better go away now,\" Mary-Lynnette said pleasantly. She was amazed at herself.\u003c/p\u003e\n\u003cp\u003eShe\u0027d never been the violent type. Maybe there werethings hidden deep inside her that she\u0027d never\u003c/p\u003e\n\u003cp\u003esuspected.\u003c/p\u003e\n\u003cp\u003eClaudine was gasping and shaking her head. Ashwas still hopping, but not going anywhere. MaryLynnette advanced on him again. Even though he was half a head taller, he backed up. He stared at her\u003c/p\u003e\n\u003cp\u003ein something like wonder.\u003c/p\u003e\n\u003cp\u003e\"Hey. Hey, look, you know, you really don\u0027t knowwhat you\u0027re doing,\" he said. \"If you knew...\"\u003c/p\u003e\n\u003cp\u003eAndMary-Lynnette saw it again-something in his face that made him suddenly look not fatuous or\u003c/p\u003e\n\u003cp\u003eamiable at all. Like the glitter of a knife blade in the light. Something that saiddanger... .\u003c/p\u003e\n\u003cp\u003e\"Oh, go bother someone else, \" Mary-Lynnette said. She drew back her foot for another kick.\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, then shut it. Still holding his shin, he looked at Claudine and managed a hurt and\u003c/p\u003e\n\u003cp\u003emiserable flirtatious smile.\u003c/p\u003e\n\u003cp\u003e\"Thanks so much for all your-\"\u003c/p\u003e\n\u003cp\u003e\"Go!\"\u003c/p\u003e\n\u003cp\u003eHe lost the smile. \"That\u0027s what I\u0027m doingl\" He limped to the front door. She followed him.\u003c/p\u003e\n\u003cp\u003e\"What do they call you, anyway?\" he asked from the front yard, as if he\u0027d finally found the\u003c/p\u003e\n\u003cp\u003ecomebackhe\u0027d been looking for. \"Mary? Marylin? M\u0027lin?\u003c/p\u003e\n\u003cp\u003eM.L.?\"\u003c/p\u003e\n\u003cp\u003e\"They call me Mary-Lynnette,\" Mary-Lynnette said flatly, and added under her breath, \"That do\u003c/p\u003e\n\u003cp\u003espeak of me.\" She\u0027d read The Taming of the Shrew in honors English last year.\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah? How about M\u0027lin the cursed?\" He was still backing away.\u003c/p\u003e\n\u003cp\u003eMary-Lynnette was startled. So maybe his class hadread it, too. But he didn\u0027t look smart enough to\u003c/p\u003e\n\u003cp\u003equote Shakespeare.\u003c/p\u003e\n\u003cp\u003e\"Have fun with your sisters,\" she said, and shutthe door. Then she leaned against it, trying to get\u003c/p\u003e\n\u003cp\u003eherbreath. Her fingers and face were prickly-numb, as if she were going to faint.\u003c/p\u003e\n\u003cp\u003eIf those girls had only murderedhim, I\u0027d understand, she thought. But they\u0027re all sostrange-there\u0027s\u003c/p\u003e\n\u003cp\u003esomething seriously weird about that whole family.\u003c/p\u003e\n\u003cp\u003eWeird in a way that scared her. If she\u0027d believed in premonitions, she\u0027d have been even more scared.\u003c/p\u003e\n\u003cp\u003eShe had a bad feeling-a feeling that things weregoing to happen....\u003c/p\u003e\n\u003cp\u003eClaudine was staring at her from the living room.\u003c/p\u003e\n\u003cp\u003e\"Very fabulous,\" she said. \"You\u0027ve just kicked a guest. Now, what was that all about?\"\"He\u003c/p\u003e\n\u003cp\u003ewouldn\u0027t leave.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean. Do you two know eachother?\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette just shrugged vaguely. The dizziness was passing, but her mind was swimming with\u003c/p\u003e\n\u003cp\u003equestions.\u003c/p\u003e\n\u003cp\u003eClaudine looked at her intently, then shook herhead. \"I remember my little brother-when he wasfour\u003c/p\u003e\n\u003cp\u003eyears old he used to push a girl flat on her face in the sandbox. He did it to show he liked her.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette ignored this. \"Claude-what wasAshherefor? What did you talk about?\"\u003c/p\u003e\n\u003cp\u003e\"About nothing,\" Claudine said, exasperated \"Justordinary conversation. Since you hate him so\u003c/p\u003e\n\u003cp\u003emuch,what difference does it make?\" Then, as Mary Lynnette kept looking at her, she sighed. \"He was\u003c/p\u003e\n\u003cp\u003every interested in weird facts about life in the country. All the local stories.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette snorted. \"Did you tell him about Sasquatch?\"\u003c/p\u003e\n\u003cp\u003e\"I told him about Vic and Todd.\"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette froze. \"You\u0027re jolting Why?\"\u0027Because that\u0027s the kind of thing he asked about!\u003c/p\u003e\n\u003cp\u003ePeople lost in time-\"\u003c/p\u003e\n\u003cp\u003e?Losing time.,?\u003c/p\u003e\n\u003cp\u003e\"Whatever. We were just having a nice conversation. He was a nice boy. Finis. \"\u003c/p\u003e\n\u003cp\u003eMary-Lynnette\u0027s heart was beating fast.\u003c/p\u003e\n\u003cp\u003eShe was right. She was sure of it now. Todd and\u003c/p\u003e\n\u003cp\u003eVicwereconnected to whatever had happened with the sisters and Mrs. B. But what was the\u003c/p\u003e\n\u003cp\u003econnection? I\u0027m going to go and find out, she thought. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-daughters-of-darkness-night-world-2/page-6.html","bookId":1862,"creation":"Oct 5, 2019 4:39:54 PM","modification":"Oct 5, 2019 4:39:54 PM"}
