{"id":92936,"no":10,"title":"Page 10","content":"\u003cp\u003eFelix led the way up some back stairs to a small one-bedroom apartment and office with a huge picture window of one-way glass overlooking the bar. Felix sat down at his desk with his back to that window, chain-smoking and listening with stony silence as Jack spoke the tale of Vampire$ Inc.\u003c/p\u003e\n\u003cp\u003eHis only discernible reactions came from his face, already thin, which seemed to stretch into a death mask\u0027s gauntness, and from his eyes, already piercing, which became uncomfortable to meet.\u003c/p\u003e\n\u003cp\u003eWatching him all the while - for no one could take eyes from his steaming intensity - Annabelle could not pin down her feelings. She recognized Felix easily from Jack\u0027s story. The laugh lines were there from the happy drunk who climbed Mexican trees.\u003c/p\u003e\n\u003cp\u003eAnd so was the helpless acuity of a man vised so tight he\u0027d had to gun down four friends and a stranger at a kitchen table for a principle.\u003c/p\u003e\n\u003cp\u003eEerie, she thought. I don\u0027t know whether to run screaming into the night or pull him into my lap and cuddle him until he can sleep.\u003c/p\u003e\n\u003cp\u003eSomething else bothered her. His few looks away from Jack were at Davette. Everyone else he had dismissed with his first glance. But his face, that rock face, kept coming back to the young journalist. His face did soften, Annabelle thought, when he did this. But damn well not enough for Annabelle.\u003c/p\u003e\n\u003cp\u003eNot nearly enough.\u003c/p\u003e\n\u003cp\u003eWhen Jack had finished, all were quiet for several seconds. Then Felix reached forward and stubbed out his last cigarette. He spoke in a harsh, rasping, bitter voice:\u003c/p\u003e\n\u003cp\u003e\"Get out.\"\u003c/p\u003e\n\u003cp\u003e\"Take your band of merry men and your fairy tales and your\" - he glanced briefly, painfully, at Davette - \"your... siren... and any other reasons you\u0027ve got to get me to do more killing and get the fuck out!\"\u003c/p\u003e\n\u003cp\u003eTeam Crow, save for Jack, sat in collective stunned silence. It was absolutely the very last reaction they had expected.\u003c/p\u003e\n\u003cp\u003eNo one had ever turned them down before.\u003c/p\u003e\n\u003cp\u003eCarl Joplin opened his mouth to speak, to protest, but Felix stood up quickly, cutting him off.\u003c/p\u003e\n\u003cp\u003e\"Now!\" he thundered.\u003c/p\u003e\n\u003cp\u003eThey left. Without anyone saying a word, they left, Felix by then standing in the center of the room glaring ferociously at them as they went.\u003c/p\u003e\n\u003cp\u003eSave for their limo, the street was all but deserted. Jack tapped lightly on the glass and the dozing driver scrambled out to open doors. But for a moment no one moved to get in. They just stood there looking at the night.\u003c/p\u003e\n\u003cp\u003e\"Well,\" offered Carl at last, \"he was pretty weird for us anyway.\"\u003c/p\u003e\n\u003cp\u003eJack looked at him and laughed. \"Are you kidding, Joplin?\" He laughed again. \"The man is ours!\"\u003c/p\u003e\n\u003cp\u003eAll eyed him warily.\u003c/p\u003e\n\u003cp\u003e\"Correct me if I\u0027m wrong, O Great Leader,\" said Carl. \"But wasn\u0027t that a \u0027no\u0027 he gave us?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll correct you,\" added Cat. He turned to Jack. \"It was, in fact, about the firmest goddamn \u0027no\u0027 I\u0027ve ever heard.\"\u003c/p\u003e\n\u003cp\u003eThe other three, Annabelle, Davette, Adam, nodded without speaking.\u003c/p\u003e\n\u003cp\u003eJack laughed again.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s ours, I tell you. You know what he\u0027ll do? Next time I see him - \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to see him again?\" asked Annabelle.\u003c/p\u003e\n\u003cp\u003e\"You think that\u0027s wise?\" added Davette.\u003c/p\u003e\n\u003cp\u003eJack grinned. \"Got to. He doesn\u0027t know how to reach us. Anyway, next time I put it to him he\u0027ll demand something outrageous. Money, probably. A hundred grand or the like.\" He nodded to the driver who walked around and got behind the wheel. He waved the others into the car. \"I\u0027ll agree, we\u0027ll shake hands, and then he\u0027s in. C\u0027mon.\"\u003c/p\u003e\n\u003cp\u003eThey obeyed. Reluctantly, suspiciously. When they had all gotten situated, Cat finally spoke up for the rest.\u003c/p\u003e\n\u003cp\u003e\"Bwana? Are you sure we\u0027re all talking about the same dude?\"\u003c/p\u003e\n\u003cp\u003eEveryone smiled.\u003c/p\u003e\n\u003cp\u003e\"How,\" Annabelle wanted to know, \"can you be so sure, dear? I mean about the money and the rest. Why didn\u0027t he just ask for it tonight?\"\u003c/p\u003e\n\u003cp\u003eHe smiled warmly at her. \"He was bluffing tonight. Hoping we\u0027d all go away. When it doesn\u0027t work - which he knows damn well it won\u0027t - he\u0027ll just make it tougher on me out of spite. He needs the money as an excuse to give in to himself.\"\u003c/p\u003e\n\u003cp\u003eEverybody thought about that for a second.\u003c/p\u003e\n\u003cp\u003eFinally, Cat asked, \"Are you sure we\u0027re talking about the same dude?\"\u003c/p\u003e\n\u003cp\u003e\"Let me tell you something, old buddy,\" replied Jack before anyone else could speak. \"More than you, more than me, that man was made to do this job.\"\u003c/p\u003e\n\u003cp\u003eHe paused, sighed. \"Poor bastard.\" He looked at the driver. \"Hit it.\"\u003c/p\u003e\n\u003cp\u003eIf anyone noticed Davette\u0027s furious blushing or triphammer heartbeat they didn\u0027t say anything. Thank God! she thought. Because she couldn\u0027t explain it either. But Lord, what a tug...\u003c/p\u003e\n\u003cp\u003eThirty minutes later Felix still stood as he had when they had gone, stiff and silent in the middle of the room.\u003c/p\u003e\n\u003cp\u003eWhy can\u0027t I cry? he thought. And then he thought: I should be allowed to cry.\u003c/p\u003e\n\u003cp\u003eIt isn\u0027t fair.\u003c/p\u003e\n\u003cp\u003eHe had doubted not one word Jack Crow had told him.\u003c/p\u003e\n\u003cp\u003eThat a world existed where vampires really lived was no surprise at all. A world of evil incarnate gnawing men only made sense.\u003c/p\u003e\n\u003cp\u003eWhat surprised him was how long it had taken for that world to finally find him and drag him inside.\u003c/p\u003e\n\u003cp\u003eIt\u0027s not fair, he thought. I wanted to do something real.\u003c/p\u003e\n\u003cp\u003eLord; but she was beautiful.\u003c/p\u003e\n\u003cp\u003eJack Crow, lying sleepy-drunk in the huge bed of the suite\u0027s master bedroom, felt oddly content.\u003c/p\u003e\n\u003cp\u003eHe felt for Felix. He really did. But no more than he did for himself or for Cat. And besides, he\u0027d really meant it when he\u0027d said Felix was made for the job.\u003c/p\u003e\n\u003cp\u003eFunny, he\u0027d thought of Felix a lot in the years since Mexico but almost never in terms of the killing. It was as if that part of Felix, that killing part, had been kept under the surface. Or in his dreams. Or something.\u003c/p\u003e\n\u003cp\u003eHe rolled over on his side and scrunched his pillow better. He loved these pillows. Not the usual hard-as-a-rock hotel pillows. Made to last a lifetime and probably float until help came. \"Ladies and gentlemen, should we experience turbulence and the hotel begin to sink, your flotation device is found under your bedspread...\"\u003c/p\u003e\n\u003cp\u003eHa. Yep, Felix was the right move. Silver bullets was the right move. And for the first time he was able to think back to the night of the massacre with something less than bone-grinding anguish, something more than impotent horror. Now it was something like: Gotcha, bastards. Gotcha! Right where I - And then he remembered for the first time... No, not the first time. He\u0027d always remembered that. But he\u0027d never thought of it, never really seen it, but it had happened, not once but three times. God! Three times it had done it. Three times! Three times!\u003c/p\u003e\n\u003cp\u003eThe fiend roaring out of the motel and them jammed in the sheriff\u0027s truck - Three times...\u003c/p\u003e\n\u003cp\u003eAnd hauling ass down the highway leaving David and Anthony and the priest and the slaughtered whores and it had come down the highway after them - Three times..\u003c/p\u003e\n\u003cp\u003eAnd it had caught them, actually caught them, and leapt onto the goddamned truck and then had done it again before it smashed through the back windshield and he\u0027d blown that hole in its face.\u003c/p\u003e\n\u003cp\u003eThree times.\u003c/p\u003e\n\u003cp\u003eThe vampire had called his name three times.\u003c/p\u003e\n\u003cp\u003eJack Crow sat up in bed and his face was pale in the dark and he trembled and sweated and was as scared as he\u0027d ever been in his life.\u003c/p\u003e\n\u003cp\u003eThe vampire had known his name.\u003c/p\u003e\n\u003cp\u003eIt had known him.\u003c/p\u003e\n\u003cp\u003eIt knew me. Hell! It... It.\u003c/p\u003e\n\u003cp\u003eIt knows me. It\u0027s still alive!\u003c/p\u003e\n\u003cp\u003eHis eyes darted to the curtained window.\u003c/p\u003e\n\u003cp\u003eDoes it know where I am?\u003c/p\u003e\n\u003cp\u003eAnd he sat there, for hours, trying to think how such a thing could be and what it meant and... and.\u003c/p\u003e\n\u003cp\u003eAnd I don\u0027t even have my crossbow. It\u0027s at the house.\u003c/p\u003e\n\u003cp\u003eBut even if I did, what difference would it make? It\u0027s night.\u003c/p\u003e\n\u003cp\u003eIt\u0027s night and dark and you can\u0027t kill them at night anyway.\u003c/p\u003e\n\u003cp\u003eAt least, no one ever has.\u003c/p\u003e\n\u003cp\u003eBut what if it comes for me right now? What if it comes for all of us? Cat! And Annabelle! Oh, God! Annabelle.\u003c/p\u003e\n\u003cp\u003eHe started to get up and race into the other rooms and gather everyone up and they could run, get out of the hotel and - And what? And go where? With what plan? He lay back down in the bed and did an amazing thing, something only one of his breed could have done. He thought: I\u0027m tired and drunk and I will not think about this now. Fuck it.\u003c/p\u003e\n\u003cp\u003eThen he rolled back over on his side and went to sleep.\u003c/p\u003e\n\u003cp\u003eAnd the next morning, right on cue, the phone finally rang. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire/page-10.html","bookId":2118,"creation":"Oct 5, 2019 5:59:08 PM","modification":"Oct 5, 2019 5:59:08 PM"}
