{"id":92958,"no":32,"title":"Page 32","content":"\u003cp\u003eOh! What a gala night! Oh, what an event! Everyone, simply Everyone, was there. What a pity it had to be in the summer, in this dreadful hot weather. But those workers had, just taken their time and those awful unions - everyone knew how they could be.\u003c/p\u003e\n\u003cp\u003eYet it was done now. Finished and complete and shining and wasn\u0027t it simply marvelous! All those slopes and weird shapes? What was that architect\u0027s name? Doesn\u0027t matter, doesn\u0027t matter. The important thing is it\u0027s all done now and what an event we are having tonight. Everyone was there.\u003c/p\u003e\n\u003cp\u003eEven the streets were dressed for the event. With banners and streamers and a band playing both before and after the show, as all those people would be strolling out. And, oh, the cameras and the street all blocked off and the chairperson of the Opera Committee arriving in that two-horse carriage with the mayor and his wife and...\u003c/p\u003e\n\u003cp\u003eOh, the street entertainers! Look at them! Aren\u0027t they cute? All those mimes and those jesters dressed in those cute, tight stripes with those hats with the bells on them. And even more fun were the period people, with those costumes like the opera itself, selling - what was that? Mead? Or some such thing? And meat pies. And turkey on a stick. And those two artisans, wearing that cute chain mail and selling those old weapons that were positively guaranteed to be authentic but shouldn\u0027t they have at least painted over the plastic parts, ha ha?\u003c/p\u003e\n\u003cp\u003ePity about the opera part of it all. It was pretty, of course - beautiful, some of those costumes. But it was rather dreadfully long, wasn\u0027t it? Of course, operas are supposed to be long and one knows it\u0027s Great Art and all the rest, but still one wonders - perhaps if it was just a teensy bit shorter? And if we could understand what they were singing? Perhaps they should just speak some of it? But then it wouldn\u0027t be opera, would it?\u003c/p\u003e\n\u003cp\u003eOf course, it wouldn\u0027t have to be subsidized then, either, but not to think of that now, because it was over and everyone, Everyone, had woken up from their little naps and... Oh! The afterparties! All those delicious afterparties! Because this was such an Important Occasion, such a Cultural Milestone! Like New Year\u0027s Eve, wasn\u0027t it? With all the limousines and there goes the mayor in his little buggy and wasn\u0027t it so much nicer now that it was cooler and that hot sun had gone down? People didn\u0027t look quite so... wilted, somehow. One should never look wilted in a formal gown - how tacky! And the men, how handsome in their tuxedos. Oh, they always complain and gripe, but secretly, everyone knows, they love to dress up. And they really are so handsome. Nothing like black tie to make a man look distinguished, even those men who have - how shall we say it? - aged both in years and size? Both up and out? Ha ha!\u003c/p\u003e\n\u003cp\u003eLike that handsome silver-haired fellow just now coming down the steps, the one alone going between the new brass pillars that hold up the awning, going toward that limousine with that tall chauffeur holding the door.\u003c/p\u003e\n\u003cp\u003eWhat was his name?\u003c/p\u003e\n\u003cp\u003e\"Kennedy!\" barked Gunman Felix, coming around from behind his \"authentic crossbow\" stand.\u003c/p\u003e\n\u003cp\u003eThe vampire turned and smiled and the crossbow bolt as big as a baseball bat shot right through the gleaming expanse of his starched white tuxedo shirt and splattered clear drops out the back and the umbrella barbs popped open and held it fast\u003c/p\u003e\n\u003cp\u003eAnd for just a moment, only Felix, binding the cable to the thick brass pillar, was moving. Everyone else was frozen, too startled to gasp. Unbelieving. This wasn\u0027t possible was it? Or part of the show? A trick? An assassination? Too surreal...\u003c/p\u003e\n\u003cp\u003eEven the monster stood as he had, staggered back a step, his arms flung wide by the impact, his redding eyes focused on the wooden stake piercing his blackened soul.\u003c/p\u003e\n\u003cp\u003eFor just an instant...\u003c/p\u003e\n\u003cp\u003eThen the eyes went up and the mouth spread wide the fangs and, the howl began...\u003c/p\u003e\n\u003cp\u003eAnd Cat stepped in from the left and fired and his bolt plunged deep, crisscrossing the first, and as he scrambled to tie his cable to the other brass pillar, the monster... detonated...\u003c/p\u003e\n\u003cp\u003eThe howling, the ungodly, unreal howling shot through the crowd and echoed off the street and the maniacal frenzy was impossibly violent and crazed. Oh, God! The howling, screeching, tearing sound...\u003c/p\u003e\n\u003cp\u003eAnd the people watching who had first thought: murder. Murder! Murder!!... now thought, What is this? What is that! It cannot be a man! It cannot be! Not that sound! An animal? What kind of an animal could...\u003c/p\u003e\n\u003cp\u003eThrash and rip and screech and the hissing burst forth upon them and the first desperate evil wrenching-away shook the thick brass pillar and the second made it rock and creak and the awning above it sway and then the second cable was tied fast and the monster frenzied even wilder with the terror of being trapped and... and the anger.\u003c/p\u003e\n\u003cp\u003e...the blazing fury...\u003c/p\u003e\n\u003cp\u003e...at this young man who presumed to attack a god!...\u003c/p\u003e\n\u003cp\u003eAnd instead of pulling away, the monster burst forward toward Felix.\u003c/p\u003e\n\u003cp\u003eAnd into his balloons.\u003c/p\u003e\n\u003cp\u003eThey weren\u0027t water balloons that broke and splashed on his face and chest, that awful smell in its gleaming mouth.\u003c/p\u003e\n\u003cp\u003eThey were gasoline. And they broke, one-two-three, across his front and soaked him and Cat already had the flare lit and he tossed it and it hit the rushing chest and bounced off, but not before...\u003c/p\u003e\n\u003cp\u003eThe flames rushed up and out and around him, his clothes and hair and skin bursting with it, a flame that could not be that color, could not be that bright and cracklingloud and when the black glob finally spat forth, it was burning.\u003c/p\u003e\n\u003cp\u003eAnd nothing could have that evil, hell-wretched smell.\u003c/p\u003e\n\u003cp\u003eNo thought of anger. No thought of vengeance. Not anymore. No more. The pain... the pain! And it howled and warped into madness and wrenched back and the pillars swayed and gave some and it wrenched some more, the screaming, the screaming, and the pillars started to buckle where they were bolted against the sidewalk.\u003c/p\u003e\n\u003cp\u003eNO! No! It can\u0027t get free!\u003c/p\u003e\n\u003cp\u003eThe Gunman squatted and aimed and fired at the \u0027right knee and missed and fired again and hit it. And then the left knee and the howling! The howling as it crumpled, crippled and imploding with the agony, still wrenching itself back and forth, back and forth, faster and faster, screaming and screaming and the pillars...\u003c/p\u003e\n\u003cp\u003eThe pillars broke free and it fell backward, rolling, and lay there for a second as two more silver bullets rammed into its chest. But then it was up, a ball of scrambling flame backing away, thudding into the side of the limousine and then crawling like a crab across the top into the street and -\u003c/p\u003e\n\u003cp\u003eAnd Gunman Felix fired again and again and again and, yes, there was an effect. It jerked and swayed with each impact...\u003c/p\u003e\n\u003cp\u003eBut there was no stopping it. It was into the middle of the street now, scrambling, scrabbling away, the ends of the crossbow bolts sparking on the asphalt and...\u003c/p\u003e\n\u003cp\u003eWe can\u0027t stop it! It\u0027ll get away and the flames will go out and it\u0027ll pull those stakes out.\u003c/p\u003e\n\u003cp\u003eNow! We\u0027ve got to stop it now! Just for a few seconds! It couldn\u0027t take much longer.\u003c/p\u003e\n\u003cp\u003eThe Blazer, the one Davette had sworn to stay hidden in two blocks away, was doing twenty-five when it vaulted across the sidewalk, thirty when it bounced across the curb into the street, and an even thirty-six when its front bumper slammed dead-center into the warping flames.\u003c/p\u003e\n\u003cp\u003eThe noise! The streak of fire as the vampire flew past them, the awful crash as it splintered against the front bumper of its own black limousine, the terrible keening wail as it lay, a frenzied flaming blur, against the curb.\u003c/p\u003e\n\u003cp\u003eGunman Felix was standing over it when the burning hands tried to raise up, was staring down when the blazing tortured eyes focused on him, was smiling when they collapsed backward into the fire.\u003c/p\u003e\n\u003cp\u003eThe swell of flame was twelve feet wide and hot and bright and impossibly loud.\u003c/p\u003e\n\u003cp\u003eThen the loud hissing, as though gas were escaping. Then sparks. So many sparks.\u003c/p\u003e\n\u003cp\u003eThen that loud pop thunderous and deep.\u003c/p\u003e\n\u003cp\u003eThen nothing. A tiny circle of blue-and-white flame flickering out around a small pile of ashes.\u003c/p\u003e\n\u003cp\u003eThe people watching had no idea what they had just seen. But something inside was glad. Something inside was relieved. Something inside was grateful to the pair in the chain mail. Later they would forget. Or try. But now.\u003c/p\u003e\n\u003cp\u003eSupernatural.\u003c/p\u003e\n\u003cp\u003e\"We did it!\" shouted Cat, unbelieving himself. \"We did it! Felix! We killed it! We killed a master! At night!\"\u003c/p\u003e\n\u003cp\u003eFelix nodded, said, \"Yeah.\"\u003c/p\u003e\n\u003cp\u003eThen he turned to the tall, pasty-faced chauffeur and thumped two fingers hard into his chest.\u003c/p\u003e\n\u003cp\u003e\"Spread the word.\"\u003c/p\u003e\n\u003cp\u003eLast Interlude\u003c/p\u003e\n\u003cp\u003eIt was only Will. Will and Hatred and Revenge. Over Pain.\u003c/p\u003e\n\u003cp\u003eWill and Hatred and Revenge were stronger, were they not?\u003c/p\u003e\n\u003cp\u003eI am stronger, am I not?\u003c/p\u003e\n\u003cp\u003eDid I not bear the cramped capsule across the seas, with the sputtering, plaything mortals seeking to caress me and join with me?\u003c/p\u003e\n\u003cp\u003eCould any other have done that?\u003c/p\u003e\n\u003cp\u003eWould any other dare?\u003c/p\u003e\n\u003cp\u003eWould any other know what I know about this Disease-Felix?\u003c/p\u003e\n\u003cp\u003eWill and Hatred and Revenge must be satisfied.\u003c/p\u003e\n\u003cp\u003eSo up and over the ancient walls that could never be too high or too strong for his powerful claws, nor could the drop over the side be too high or any creature or mortal fool be able to sprint across these famous gardens with such breathtaking speed and grace.\u003c/p\u003e\n\u003cp\u003eYes, the pain. The awful pain. The greater pressure of the pain, across his temples and into the bones of his face and skull as he drew nearer and nearer to this, the Lair of the Monster\u0027s Beast on Earth.\u003c/p\u003e\n\u003cp\u003eOh, the agony. Oh, the pressure as it grew. It stumbled once, with this pain, with this agony.\u003c/p\u003e\n\u003cp\u003eBut Hatred and Revenge and Will!\u003c/p\u003e\n\u003cp\u003eFor the Disease-Felix would not leave! It would not come out! It stayed and stayed, happy and breathing and warm in the center of the pain and -\u003c/p\u003e\n\u003cp\u003eAnd it thought it was safe! It cannot think it is safe! It cannot believe!\u003c/p\u003e\n\u003cp\u003eThe walls of the building were as slick as the outer barricades but its claws, even with the pain, were no less sharp or strong. It could spring up these walls, up or down or sideways, until it found the terrace and found the window into its room.\u003c/p\u003e\n\u003cp\u003eIts room. Did he not know this room? Was this not his room when once he, too, was Pawn of the Monster\u0027s Beast on Earth? Did he not..\u003c/p\u003e\n\u003cp\u003eOhhh! The pain. Stronger here is the pain. So close to the center. So certain of its wretched might.\u003c/p\u003e\n\u003cp\u003eBut there is still Will. There is still Hatred.\u003c/p\u003e\n\u003cp\u003eHe would still swallow deep his Revenge.\u003c/p\u003e\n\u003cp\u003eSomewhere on the grounds below the alarms began to sound and the lights began to glow through the trees and there were the sounds of mortals running like fools and calling to one another.\u003c/p\u003e\n\u003cp\u003eBut too late.\u003c/p\u003e\n\u003cp\u003eThe ancient terrace door and all its locks and bolts and sneaky wires were too late. The door gave easily in his claws and, Yes! The pain was greater inside, much, much, greater. But he summoned his Will. He summoned his Hatred. And he stalked across the centuries-old room. Stumbling, yes. With pain, yes. The great pressure seared through \u0027him.\u003c/p\u003e\n\u003cp\u003eBut then he was at the bedside and there! Before him! The form of the Disease-Felix so smug and safe in its sheets.\u003c/p\u003e\n\u003cp\u003eAnd he ripped at the sheets, agony though this movement was, and exposed the form underneath and cried, \"Felix! Feeeelixxxx! I have come for you!\"\u003c/p\u003e\n\u003cp\u003eBut the face that turned to his own was an elderly one...\u003c/p\u003e\n\u003cp\u003e\"No! Noooo!\" it shrieked.\u003c/p\u003e\n\u003cp\u003eAnd the Old One said, its voice gentle and sad, \"Jack... My son! My poor son.\"\u003c/p\u003e\n\u003cp\u003eAnd the wrinkled hand, so softly caressing its cheek...\u003c/p\u003e\n\u003cp\u003eThe flame exploded across his face and skull and down his spine before spreading across the rest of his body. His howl of pain was impossible to bear. The flame swirled around him and raised him up and consumed him, Consumed him, sent him rocketing about the walls and the ceilings and all those places his soul did touch could never ever be wiped completely clean...\u003c/p\u003e\n\u003cp\u003eAnd then the scream ceased. And the flame condensed and boiled in the center of the room.\u003c/p\u003e\n\u003cp\u003eThen it shot upward out of sight.\u003c/p\u003e\n\u003cp\u003eThe man stared a long time at the spot on the ceiling where the flame had gone. It was only when he moved at last that he realized he was crying.\u003c/p\u003e\n\u003cp\u003eAnd noticed the young Gunman standing in the doorway, the forbidden pistol in his hand.\u003c/p\u003e\n\u003cp\u003e\"How did you know?\" he asked.\u003c/p\u003e\n\u003cp\u003eFelix\u0027s face was grim as he reholstered the Browning.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s what I would have done.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire/page-32.html","bookId":2118,"creation":"Oct 5, 2019 5:59:08 PM","modification":"Oct 5, 2019 5:59:08 PM"}
