{"id":79234,"no":2,"title":"Page 2","content":"\u003cp\u003eARRA SAILS was waiting for Mr. Crepsley and me outside the Hall of Princes. Arra was one of the rare female vampires at Vampire Mountain. She was a fierce fighter, the equal - or better - of most males. We\u0027d fought a contest earlier during my stay, and I\u0027d won her hard-to-earn respect.\u003c/p\u003e\n\u003cp\u003e\"How are you?\" she asked, shaking my hand.\u003c/p\u003e\n\u003cp\u003e\"Pretty good,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Nervous?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I was too, when facing my Trials,\" she said with a smile. \"Only a fool goes into them without feeling anxious. The important thing is not to panic.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try not to.\"\u003c/p\u003e\n\u003cp\u003eArra cleared her throat. \"I hope you don\u0027t hold what I said in the Hall of Princes against me.\" Arra had urged the Princes to make me undertake the Trials. \"I don\u0027t believe in going easy on vampires, even if they\u0027re children. Ours is a hard life, not suited to the weak. As I said in the Hall, I think you\u0027ll pass the Trials, but if you don\u0027t, I won\u0027t step in to plead for your life.\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" I said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re still friends?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"If you need help preparing, call on me,\" she said. \"I have been through the Trials three times, to prove to myself more than anyone else that I am a worthy vampire. There is very little that I don\u0027t know about them.\"\u003c/p\u003e\n\u003cp\u003e\"We will bear that in mind,\" Mr. Crepsley said, bowing to her.\u003c/p\u003e\n\u003cp\u003e\"Courteous as ever, Larten,\" Arra noted. \"And as handsome too.\"\u003c/p\u003e\n\u003cp\u003eI nearly laughed out loud. Mr. Crepsley - handsome? I\u0027d seen more appealing creatures in the monkey cages in zoos! But Mr. Crepsley took the compliment in stride, as though he were used to such flattery, and bowed again.\u003c/p\u003e\n\u003cp\u003e\"And you are as beautiful as ever,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I know.\" She grinned and left. Mr. Crepsley watched her intently as she walked away, a faraway look on his normally solemn face. When he caught me smirking, he scowled.\u003c/p\u003e\n\u003cp\u003e\"What are you grinning about?\" he snapped.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I said innocently, then added slyly, \"an old girlfriend?\"\u003c/p\u003e\n\u003cp\u003e\"If you must know,\" he said stiffly, \"Arra was once my mate.\"\u003c/p\u003e\n\u003cp\u003eI blinked. \"You mean she was your wife?\"\u003c/p\u003e\n\u003cp\u003e\"In a manner of speaking.\"\u003c/p\u003e\n\u003cp\u003eI stared, slack-jawed, at the vampire. \"You never told me you were married!\"\u003c/p\u003e\n\u003cp\u003e\"I am not - anymore - but I used to be.\"\u003c/p\u003e\n\u003cp\u003e\"What happened - did you get a divorce?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"Vampires neither marry nor divorce as humans do. We make temporary mating commitments instead.\"\u003c/p\u003e\n\u003cp\u003eI frowned. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"If two vampires wish to mate,\" he explained, \"they agree to share their lives for a set amount of time, usually five or ten years. At the end of that time, they can agree to another five or ten years, or separate. Our relationships are not like those of humans. Since we cannot have children, and live such a long time, very few vampires stay mated for their whole lives.\"\u003c/p\u003e\n\u003cp\u003e\"That sounds bizarre.\"\u003c/p\u003e\n\u003cp\u003eMr. Crepsley shrugged. \"It is the vampire way.\"\u003c/p\u003e\n\u003cp\u003eI thought it over. \"Do you still have feelings for Arra?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I admire and respect her,\" he answered.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I mean. Do you love her?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, look,\" he said quickly, reddening around his throat, \"it is time to present ourselves to the Princes. Hurry - we must not be late.\" And he took off quickly, as though to avoid more personal questions.\u003c/p\u003e\n\u003cp\u003eVanez Blane greeted us inside the Hall of Princes. Vanez was a games master, responsible for maintaining the three gaming Halls and watching over the contestants. He only had one eye, and from the left-hand side he looked awful. But if you saw him from the front or right-hand side, you could tell at a glance that he was a kind, friendly vampire.\u003c/p\u003e\n\u003cp\u003e\"How do you feel?\" he asked. \"Ready for the Trials?\"\u003c/p\u003e\n\u003cp\u003e\"Just about,\" I replied.\u003c/p\u003e\n\u003cp\u003eHe took me aside and spoke quietly. \"You can say no if you want, but I\u0027ve discussed it with the Princes, and they won\u0027t object if you ask me to be your Trials tutor. That means I\u0027d tell you about the challenges and help you prepare for them. I\u0027d be like a second in a duel, or a trainer in a boxing match.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds good to me,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t mind, Larten?\" he asked Mr. Crepsley.\u003c/p\u003e\n\u003cp\u003e\"Not at all,\" Mr. Crepsley said. \"I had planned to be Darren\u0027s tutor, but you are much better suited to the job. Are you sure it is not an inconvenience?\"\u003c/p\u003e\n\u003cp\u003e\"Of course it isn\u0027t,\" Vanez said firmly.\u003c/p\u003e\n\u003cp\u003e\"Then it is agreed.\" We all shook hands and smiled at one another.\u003c/p\u003e\n\u003cp\u003e\"It feels strange being the center of so much attention,\" I said. \"So many people are going out of their way to help me. Are you like this with all newcomers?\"\u003c/p\u003e\n\u003cp\u003e\"Most of the time - yes,\" Vanez said. \"Vampires look out for each other. We have to - everybody else in the world hates or fears us. A vampire can always depend on help from his own.\" He winked and added, \"Even that cowardly scoundrel Kurda Smahlt.\"\u003c/p\u003e\n\u003cp\u003eVanez didn\u0027t really think Kurda was a cowardly scoundrel - he just liked to tease the soon-to-be Prince - but many vampires in the mountain did. Kurda didn\u0027t like fighting or war and believed in making peace with the vampaneze. To a lot of vampires, that was unthinkable.\u003c/p\u003e\n\u003cp\u003eA guard called my name, and I stepped forward, past the circular benches to the platform where the thrones of the Princes were. Vanez stood just behind me, while Mr. Crepsley stayed in his seat - only Trials tutors were allowed to accompany contestants to the platform.\u003c/p\u003e\n\u003cp\u003eParis Skyle, a white-haired, grey-bearded Prince - he was also the oldest living vampire - asked if I was willing to accept whatever Trial came my way. I said I was. He announced to the hall in general that the Period of Preparation would be used, and that some Trials had been withdrawn, because of my size and youth. He asked if anyone objected. Mika Ver Leth - who\u0027d suggested the Trials - looked unhappy about the allowances and picked irritably at the folds of his black shirt but said nothing. \"Very well,\" Paris declared. \"We shall draw the first Trial.\"\u003c/p\u003e\n\u003cp\u003eA bag of numbered stones was brought forward by a green-uniformed guard. I\u0027d been told that there were seventeen stones in it, each with its own number. Each number corresponded to a Trial, and the one I picked would be the Trial I\u0027d have to face.\u003c/p\u003e\n\u003cp\u003eThe guard shook the bag and asked if anyone wanted to examine the stones. One of the Generals raised a hand. This was common practice - the stones were always examined - so I didn\u0027t worry about it, just focused on the floor and tried to stop the nervous rumblings of my belly.\u003c/p\u003e\n\u003cp\u003eWhen the stones had been checked and approved, the guard shook them up once more, then held the bag out to me. Closing my eyes, I reached in, grabbed the first stone I touched, and drew it out. \"Number eleven,\" the guard shouted. \"The Aquatic Maze.\"\u003c/p\u003e\n\u003cp\u003eThe vampires in the Hall mumbled softly among themselves.\u003c/p\u003e\n\u003cp\u003e\"Is that good or bad?\" I asked Vanez while the stone was taken up for the Princes to verify.\u003c/p\u003e\n\u003cp\u003e\"It depends,\" he said. \"Can you swim?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Then it\u0027s as good a first Trial as any. Things could have been worse.\"\u003c/p\u003e\n\u003cp\u003eOnce the stone had been checked and put aside so that it couldn\u0027t be drawn again, Paris told me that I would be expected to report for the Trial at dusk tomorrow. He wished me luck - he said business would keep him away, though one of the other Princes would be present - then dismissed me. Leaving the Hall, I hurried away with Vanez and Mr. Crepsley to prepare for my first test and brush with death. \u003c/p\u003e","sourceLink":"https://allnovel.net/trials-of-death-the-saga-of-darren-shan-5/page-2.html","bookId":2441,"creation":"Oct 5, 2019 4:15:40 PM","modification":"Oct 5, 2019 4:15:40 PM"}
