{"id":68395,"no":24,"title":"Page 24","content":"\u003cp\u003eWIRELESS OPERATORS WERE not quite invisible.\u003c/p\u003e\n\u003cp\u003eThey lived in a spirit world where their ghostly shapes could be dimly seen.\u003c/p\u003e\n\u003cp\u003ePeering into the gloom, searching for them, were the men of the Gestapo\u0027s radio detection team, housed in a cavernous, darkened hall in Paris.\u003c/p\u003e\n\u003cp\u003eDieter had visited the place.\u003c/p\u003e\n\u003cp\u003eThree hundred round oscilloscope screens flickered with a greenish light.\u003c/p\u003e\n\u003cp\u003eRadio broadcasts appeared as vertical lines on the monitors, the position of the line showing the frequency of the transmission, the height indicating the strength of the signal.\u003c/p\u003e\n\u003cp\u003eThe screens were tended, day and night, by silent, watchful operators, who made him think of angels observing the sins of humankind.\u003c/p\u003e\n\u003cp\u003eThe operators knew the regular stations, either German-controlled or foreign-based, and were able to spot a rogue instantly.\u003c/p\u003e\n\u003cp\u003eAs soon as this happened, the operator would pick up a telephone at his desk and call three tracking stations: two in southern Germany, at Augsburg and Nuremberg, and one in Brittany, at Brest.\u003c/p\u003e\n\u003cp\u003eHe would give them the frequency of the rogue broadcast.\u003c/p\u003e\n\u003cp\u003eThe tracking stations were equipped with goniometers, apparatus for measuring angles, and each could say within seconds which direction the broadcast was coming from.\u003c/p\u003e\n\u003cp\u003eThey would send this information back to Paris, where the operator would draw three lines on a huge wall map.\u003c/p\u003e\n\u003cp\u003eThe lines intersected where the suspect radio was located.\u003c/p\u003e\n\u003cp\u003eThe operator then telephoned the Gestapo office nearest to the location.\u003c/p\u003e\n\u003cp\u003eThe local Gestapo had cars waiting in readiness, equipped with their own detection apparatus.\u003c/p\u003e\n\u003cp\u003eDieter was now sitting in such a car, a long black Citroensparked on the outskirts of Reims.\u003c/p\u003e\n\u003cp\u003eWith him were three Gestapo men experienced in wireless detection.\u003c/p\u003e\n\u003cp\u003eTonight the help of the Paris center was not required: Dieter already knew the frequency Helicopter would use, and he assumed Helicopter would broadcast from somewhere in the city (because it was too difficult for a wireless operator to lose himself in the countryside).\u003c/p\u003e\n\u003cp\u003eThe car\u0027s receiver was tuned to Helicopter\u0027s frequency.\u003c/p\u003e\n\u003cp\u003eIt measured the strength, as well as the direction, of the broadcast, and Dieter would know he was getting nearer to the transmitter when the needle rose on the dial.\u003c/p\u003e\n\u003cp\u003eIn addition, the Gestapo man sitting next to Dieter wore a receiver and an aerial concealed beneath his raincoat.\u003c/p\u003e\n\u003cp\u003eOn his wrist was a meter like a watch that showed the strength of the signal.\u003c/p\u003e\n\u003cp\u003eWhen the search narrowed down to a particular street, city block, or building, the walker would take over.\u003c/p\u003e\n\u003cp\u003eThe Gestapo man in the front seat held on his lap a sledgehammer, for breaking doors down.\u003c/p\u003e\n\u003cp\u003eDieter had been hunting once.\u003c/p\u003e\n\u003cp\u003eHe did not much like country pursuits, preferring the more refined pleasures of city life, but he was a good shot.\u003c/p\u003e\n\u003cp\u003eNow he was reminded of that, as he waited for Helicopter to begin sending his coded report home to England.\u003c/p\u003e\n\u003cp\u003eThis was like lying in the hide in the early dawn, tense with anticipation, impatient for the deer to start moving, savoring the thrill of anticipation.\u003c/p\u003e\n\u003cp\u003eThe Resistance were not deer but foxes, Dieter thought, skulking in their holes, coming out to cause carnage in the chicken house, then going to earth again.\u003c/p\u003e\n\u003cp\u003eHe was mortified to have lost Helicopter.\u003c/p\u003e\n\u003cp\u003eHe was so keen to recapture the man that he hardly minded having to rely on the help of Willi Weber.\u003c/p\u003e\n\u003cp\u003eHe just wanted to kill the fox.\u003c/p\u003e\n\u003cp\u003eIt was a fine summer evening.\u003c/p\u003e\n\u003cp\u003eThe car was parked at the northern end of the city.\u003c/p\u003e\n\u003cp\u003eReims was a small town, and Dieter reckoned a car could drive from one side to the other in less than ten minutes.\u003c/p\u003e\n\u003cp\u003eHe checked his watch: one minute past eight.\u003c/p\u003e\n\u003cp\u003eHelicopter was late coming on air.\u003c/p\u003e\n\u003cp\u003ePerhaps he would not broadcast tonight.\u003c/p\u003e\n\u003cp\u003ebut that was unlikely.\u003c/p\u003e\n\u003cp\u003eToday Helicopter had met up with Michel.\u003c/p\u003e\n\u003cp\u003eAs soon as possible, he would want to report his success to his superiors, and tell them just how much was left of the Bollinger circuit.\u003c/p\u003e\n\u003cp\u003eMichel had phoned the house in the rue du Bois two hours ago.\u003c/p\u003e\n\u003cp\u003eDieter had been there.\u003c/p\u003e\n\u003cp\u003eIt was a tense moment.\u003c/p\u003e\n\u003cp\u003eStephanie had answered, in her imitation of Mademoiselle Lemas\u0027s voice.\u003c/p\u003e\n\u003cp\u003eMichel had given his code name, and asked whether \"Bourgeoise\" remembered him-a question that reassured Stephanie, because it indicated that Michel did not know Mademoiselle Lemas very well and therefore would not realize this was an impersonator.\u003c/p\u003e\n\u003cp\u003eHe had asked her about her new recruit, codenamed Charenton.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s my cousin,\" Stephanie had said gruffly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve known him since we were children, I would trust him with my life.\" Michel had told her she had no right to recruit people without at least discussing it with him, but he had appeared to believe her story, and Dieter had kissed Stephanie and told her she was a good enough actor to join the Comedie Francaise.\u003c/p\u003e\n\u003cp\u003eAll the same, Helicopter would know that the Gestapo would be listening and trying to find him.\u003c/p\u003e\n\u003cp\u003eThat was a risk he had to run: if he sent no messages home he was of no use.\u003c/p\u003e\n\u003cp\u003eHe would stay on air only for the minimum length of time.\u003c/p\u003e\n\u003cp\u003eIf he had a lot of information to send, he would break it into two or more messages and send them from different locations.\u003c/p\u003e\n\u003cp\u003eDieter\u0027s only hope was that he would be tempted to stay on the air just a little too long.\u003c/p\u003e\n\u003cp\u003eThe minutes ticked by.\u003c/p\u003e\n\u003cp\u003eThere was silence in the car.\u003c/p\u003e\n\u003cp\u003eThe men smoked nervously.\u003c/p\u003e\n\u003cp\u003eThen, at five past eight, the receiver beeped.\u003c/p\u003e\n\u003cp\u003eBy prearrangement, the driver set off immediately, driving south.\u003c/p\u003e\n\u003cp\u003eThe signal grew stronger, but slowly, making Dieter worry that they were not heading directly for the source.\u003c/p\u003e\n\u003cp\u003eSure enough, as they passed the cathedral in the center of town, the needle fell back.\u003c/p\u003e\n\u003cp\u003eIn the passenger seat, a Gestapo man talked into a short-wave radio.\u003c/p\u003e\n\u003cp\u003eHe was consulting with someone in a radio-detection truck a mile away.\u003c/p\u003e\n\u003cp\u003eAfter a moment he said, \"Northwest quarter.\" The driver immediately turned west, and the signal began to strengthen.\u003c/p\u003e\n\u003cp\u003e\"Got you,\" Dieter breathed.\u003c/p\u003e\n\u003cp\u003eBut five minutes had elapsed.\u003c/p\u003e\n\u003cp\u003eThe car raced west, and the signal strengthened, as Helicopter continued to tap on the Morse key of his suitcase radio in his hiding place-a bathroom, an attic, a warehouse-somewhere in the northwest of the city.\u003c/p\u003e\n\u003cp\u003eBack at the chateau of Sainte-Cecile, a German radio operator had tuned to the same frequency and was taking down the coded message.\u003c/p\u003e\n\u003cp\u003eIt was also being registered on a wire recorder.\u003c/p\u003e\n\u003cp\u003eLater, Dieter would decrypt it, using the one-time pad copied by Stephanie.\u003c/p\u003e\n\u003cp\u003eBut the message was not as important as the messenger.\u003c/p\u003e\n\u003cp\u003eThey entered a neighborhood of large old houses, mostly decrepit and subdivided into small apartments and bed sitting rooms for students and nurses.\u003c/p\u003e\n\u003cp\u003eThe signal grew louder, then suddenly began to fade.\u003c/p\u003e\n\u003cp\u003e\"Overshoot, overshoot!\" said the Gestapo man in the front passenger seat.\u003c/p\u003e\n\u003cp\u003eThe driver reversed the car, then braked.\u003c/p\u003e\n\u003cp\u003eTen minutes had passed.\u003c/p\u003e\n\u003cp\u003eDieter and the three Gestapo men sprang out.\u003c/p\u003e\n\u003cp\u003eThe one with the portable detection unit under his raincoat walked rapidly along the pavement, consulting his wrist dial constantly, and the others followed.\u003c/p\u003e\n\u003cp\u003eHe went a hundred meters, then suddenly turned back.\u003c/p\u003e\n\u003cp\u003eHe stopped and pointed to a house.\u003c/p\u003e\n\u003cp\u003e\"That one,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But the transmission has ended.\" Dieter noticed that there were no curtains in the windows.\u003c/p\u003e\n\u003cp\u003eThe Resistance liked to use derelict houses for their transmissions.\u003c/p\u003e\n\u003cp\u003eThe Gestapo man carrying the sledgehammer broke the door down with two blows.\u003c/p\u003e\n\u003cp\u003eThey all rushed in.\u003c/p\u003e\n\u003cp\u003eThe floors were bare and the place had a musty smell.\u003c/p\u003e\n\u003cp\u003eDieter threw open a door and looked into an empty room.\u003c/p\u003e\n\u003cp\u003eDieter opened the door of the back room.\u003c/p\u003e\n\u003cp\u003eHe crossed the vacant room in three strides and looked into an abandoned kitchen.\u003c/p\u003e\n\u003cp\u003eHe ran up the stairs.\u003c/p\u003e\n\u003cp\u003eOn the next floor was a window overlooking a long back garden.\u003c/p\u003e\n\u003cp\u003eDieter glanced out- and saw Helicopter and Michel running across the grass.\u003c/p\u003e\n\u003cp\u003eMichel was limping, Helicopter was carrying his little suitcase.\u003c/p\u003e\n\u003cp\u003eDieter swore.\u003c/p\u003e\n\u003cp\u003eThey must have escaped through a back door as the Gestapo were breaking down the front.\u003c/p\u003e\n\u003cp\u003eDieter turned and yelled, \"Back garden!\" The Gestapo men ran and he followed.\u003c/p\u003e\n\u003cp\u003eAs he reached the garden, he saw Michel and Helicopter scrambling over the back fence into the grounds of another house.\u003c/p\u003e\n\u003cp\u003eHe joined in the chase, but the fugitives had a long lead.\u003c/p\u003e\n\u003cp\u003eWith the three Gestapo men, he climbed the fence and ran through the second garden.\u003c/p\u003e\n\u003cp\u003eThey reached the next street just in time to see a black Renault Monaquatre disappearing around the corner.\u003c/p\u003e\n\u003cp\u003e\"Hell,\" Dieter said.\u003c/p\u003e\n\u003cp\u003eFor the second time in a day, Helicopter had slipped through his grasp. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-24.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
