{"id":68397,"no":26,"title":"Page 26","content":"\u003cp\u003eSUNK IN GLOOM, Dieter returned to the chateau at Sainte-Cecile in the Citroenswith the radio detection team.\u003c/p\u003e\n\u003cp\u003eHe went to the wireless listening room in the bombproofed basement.\u003c/p\u003e\n\u003cp\u003eWilli Weber was there, looking angry.\u003c/p\u003e\n\u003cp\u003eThe one consolation from tonight\u0027s fiasco, Dieter thought, was that Weber was not able to crow that he had succeeded where Dieter had failed.\u003c/p\u003e\n\u003cp\u003eBut Dieter could have put up with all the triumphalism Weber could muster in return for having Helicopter in the torture chamber.\u003c/p\u003e\n\u003cp\u003e\"You have the message he sent?\" Dieter asked.\u003c/p\u003e\n\u003cp\u003eWeber handed him a carbon copy of the typed message.\u003c/p\u003e\n\u003cp\u003e\"It has already been sent to the cryptanalysis office in Berlin.\" Dieter looked at the meaningless strings of letters.\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t be able to decode it.\u003c/p\u003e\n\u003cp\u003eHe\u0027s using a one-time pad.\" He folded the sheet and slipped it into his pocket.\u003c/p\u003e\n\u003cp\u003e\"What can you do with it?\" Weber said.\u003c/p\u003e\n\u003cp\u003e\"I have a copy of his code book,\" Dieter said.\u003c/p\u003e\n\u003cp\u003eIt was a petty victory, but he felt better.\u003c/p\u003e\n\u003cp\u003eWeber swallowed.\u003c/p\u003e\n\u003cp\u003e\"The message may tell us where he is.\" \"Yes.\u003c/p\u003e\n\u003cp\u003eHe\u0027s scheduled to receive a reply at eleven p.m.\" He looked at his watch.\u003c/p\u003e\n\u003cp\u003eIt was a few minutes before eleven.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s record that, and I will decrypt the two together.\" Weber left.\u003c/p\u003e\n\u003cp\u003eDieter waited in the windowless room.\u003c/p\u003e\n\u003cp\u003eOn the dot of eleven, a receiver tuned to Helicopter\u0027s listening frequency began to chatter with the long-and- short beeps of Morse.\u003c/p\u003e\n\u003cp\u003eAn operator wrote the letters down while at the same time a wire recorder ran.\u003c/p\u003e\n\u003cp\u003eWhen the chattering stopped, the operator pulled a typewriter toward him and typed out what he had on his notepad.\u003c/p\u003e\n\u003cp\u003eHe gave Dieter a carbon copy.\u003c/p\u003e\n\u003cp\u003eThe two messages could be everything or nothing, Dieter thought as he got behind the wheel of his own car.\u003c/p\u003e\n\u003cp\u003eThe moon was bright as he followed the twisting road through the vineyards to Reims and parked in the rue du Bois.\u003c/p\u003e\n\u003cp\u003eIt was good weather for an invasion.\u003c/p\u003e\n\u003cp\u003eStephanie was waiting for him in the kitchen of Mademoiselle Lemas\u0027s house.\u003c/p\u003e\n\u003cp\u003eHe put the coded messages on the table and took out the copies Stephanie had made of the pad and the silk handkerchief.\u003c/p\u003e\n\u003cp\u003eHe rubbed his eyes and began to decode the first message, the one Helicopter had sent, writing the decrypt on the scratch pad Mademoiselle Lemas had used to make her shopping lists.\u003c/p\u003e\n\u003cp\u003eStephanie brewed a pot of coffee.\u003c/p\u003e\n\u003cp\u003eShe looked over his shoulder for a while, asked a couple of questions, then took the second message and began to decode it herself.\u003c/p\u003e\n\u003cp\u003eDieter\u0027s decrypt gave a concise account of the incident at the cathedral, naming Dieter as Charenton and saying he had been recruited by Bourgeoise (Mademoiselle Lemas) because she was worried about the security of the rendezvous.\u003c/p\u003e\n\u003cp\u003eIt said Monet (Michel) had taken the unusual step of phoning Bourgeoise to confirm that Charenton was trustworthy, and he was satisfied.\u003c/p\u003e\n\u003cp\u003eIt listed the code names of those members of the Bollinger circuit who had not fallen in the battle last Sunday and were still active.\u003c/p\u003e\n\u003cp\u003eThere were only four.\u003c/p\u003e\n\u003cp\u003eIt was useful, but it did not tell him where to find the spies.\u003c/p\u003e\n\u003cp\u003eHe drank a cup of coffee while he waited for Stephanie to finish.\u003c/p\u003e\n\u003cp\u003eShe handed him a sheet of paper covered with her flamboyant handwriting.\u003c/p\u003e\n\u003cp\u003eWhen he read it, he could hardly believe his luck.\u003c/p\u003e\n\u003cp\u003eIt said: PREPARE RECEIVE GROUP OF SIX NUMBER PARACHUTISTS CODENAMED JACKDAWS LEADER LEOPARDESS ARRIVING ELEVEN PIP EMMA FRIDAY SECOND JUNE CHAMP DE PIERRE.\u003c/p\u003e\n\u003cp\u003e\"My God,\" he whispered.\u003c/p\u003e\n\u003cp\u003eChamp de Pierre was a code name, but Dieter knew what it meant, for Gaston had told him during the very first interrogation.\u003c/p\u003e\n\u003cp\u003eIt was a drop zone in a pasture outside Chatelle, a small village five miles from Reims.\u003c/p\u003e\n\u003cp\u003eDieter now knew exactly where Helicopter and Michel would be tomorrow night, and could pick them up.\u003c/p\u003e\n\u003cp\u003eHe could also capture six more Allied agents as they parachuted to earth.\u003c/p\u003e\n\u003cp\u003eAnd one of them was \"Leopardess\": Flick Clairet, the woman who knew more than anyone else about the French Resistance, the woman who, under torture, would give him the information he needed to break the back of the Resistance-just in time to stop them aiding the invasion force.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ Almighty,\" Dieter said.\u003c/p\u003e\n\u003cp\u003e\"What a break.\"\u003c/p\u003e\n\u003cp\u003eTHE SIXTH DAY Friday, June 2,1944 \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-26.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
