{"id":68404,"no":33,"title":"Page 33","content":"\u003cp\u003ePAUL CHANCELLOR HAD been angry with Percy Thwaite, violently angry, when he found out about the message from Brian Standish.\u003c/p\u003e\n\u003cp\u003e\"You deceived me!\" Paul had shouted at Percy.\u003c/p\u003e\n\u003cp\u003e\"You deliberately made sure I was out of the way before you showed it to Flick!\" \"It\u0027s true, but it seemed best-\" \"I\u0027m in command-you have no right to withhold information from me!\" \"I thought you would have aborted the flight.\" \"Perhaps I would have-maybe I should have.\" \"But you would have done it for love of Flick, not because it was right operationally.\" There Percy had touched Paul\u0027s weak spot, for Paul had compromised his position as leader by sleeping with one of his team.\u003c/p\u003e\n\u003cp\u003eThat had made him more angry, but he had been forced to suppress his rage.\u003c/p\u003e\n\u003cp\u003eThey could not contact Flick\u0027s plane, for flights over enemy territory had to observe radio silence, so the two men had stayed at the airfield all night, smoking and pacing and worrying about the woman they both, in different ways, loved.\u003c/p\u003e\n\u003cp\u003ePaul had, in his shirt pocket, the wooden French toothbrush he and Flick had shared on Friday morning, after their night together.\u003c/p\u003e\n\u003cp\u003eHe was not normally superstitious, but he kept touching it, as if he were touching her, making sure she was okay.\u003c/p\u003e\n\u003cp\u003eWhen the plane returned, and the pilot told them how Flick had become suspicious of the reception committee at Chatelle, and had eventually dropped near Chartres, Paul had been so relieved he almost wept.\u003c/p\u003e\n\u003cp\u003eMinutes later, Percy had taken a call from SOE headquarters in London and had learned of Brian Standish\u0027s message demanding to know what had gone wrong.\u003c/p\u003e\n\u003cp\u003ePaul had decided to respond by sending the reply drafted by Flick and brought home by her pilot.\u003c/p\u003e\n\u003cp\u003eIn case Brian was still at liberty, it told him that the Jackdaws had landed and would contact him, but it gave no further information, because of the possibility that he was in the hands of the Gestapo.\u003c/p\u003e\n\u003cp\u003eStill no one was sure what had happened out there.\u003c/p\u003e\n\u003cp\u003eThe uncertainty was unbearable for Paul.\u003c/p\u003e\n\u003cp\u003eFlick had to go to Reims, one way or another.\u003c/p\u003e\n\u003cp\u003eHe had to know whether she was walking into a Gestapo trap.\u003c/p\u003e\n\u003cp\u003eSurely there must be a way to check whether Brian\u0027s transmissions were genuine? His signals bore the correct security tags: Percy double-checked.\u003c/p\u003e\n\u003cp\u003eBut the Gestapo knew about security tags, and they could easily have tortured Brian to learn his.\u003c/p\u003e\n\u003cp\u003eThere were subtler methods of checking, Percy said, but they depended on the girls at the listening station.\u003c/p\u003e\n\u003cp\u003eSo Paul had decided to go there.\u003c/p\u003e\n\u003cp\u003eAt first Percy had resisted.\u003c/p\u003e\n\u003cp\u003eIt was dangerous for operational people to descend on signals units, he said; they disrupted the smooth running of the service for hundreds of agents.\u003c/p\u003e\n\u003cp\u003ePaul ignored that.\u003c/p\u003e\n\u003cp\u003eThen the head of the station said he would be delighted for Paul to make an appointment to visit in, say, two or three weeks? No, Paul had said, two or three hours is what I had in mind.\u003c/p\u003e\n\u003cp\u003eHe had insisted, gently but firmly, using the threat of Monty\u0027s wrath as a last resort.\u003c/p\u003e\n\u003cp\u003eAnd so he had gone to Grendon Underwood.\u003c/p\u003e\n\u003cp\u003eAs a small boy in Sunday school, Paul had been vexed by a theological problem.\u003c/p\u003e\n\u003cp\u003eHe had noticed that in Arlington, Virginia, where he was living with his parents, most of the children of his age went to bed at the same time, seven-thirty.\u003c/p\u003e\n\u003cp\u003eThat meant they were saying their prayers simultaneously.\u003c/p\u003e\n\u003cp\u003eWith all those voices rising to heaven, how could God hear what he, Paul, was saying? He was not satisfied with the answer of the pastor, who just said that God could do anything.\u003c/p\u003e\n\u003cp\u003eLittle Paul knew that was an evasion.\u003c/p\u003e\n\u003cp\u003eThe question troubled him for years.\u003c/p\u003e\n\u003cp\u003eIf he could have seen Grendon Underwood, he would have understood.\u003c/p\u003e\n\u003cp\u003eLike God, the Special Operations Executive had to listen to innumerable messages, and it often happened that scores of them came in at the same time.\u003c/p\u003e\n\u003cp\u003eSecret agents in their hideaways were all tapping their Morse keys simultaneously, like the nine-year-olds of Arlington kneeling at their bedsides at half past seven.\u003c/p\u003e\n\u003cp\u003eSOE heard them all.\u003c/p\u003e\n\u003cp\u003eGrendon Underwood was another grand country house vacated by the owners and taken over by the military.\u003c/p\u003e\n\u003cp\u003eOfficially called Station 53a, it was a listening post.\u003c/p\u003e\n\u003cp\u003eIn its extensive grounds were radio aerials grouped in great arcs like the ears of God, listening to messages that came from anywhere between the arctic north of Norway to the dusty south of Spain.\u003c/p\u003e\n\u003cp\u003eFour hundred wireless operators and coders, most of them young women in the FANYs, worked in the big house and lived in Nissen huts hastily erected on the grounds.\u003c/p\u003e\n\u003cp\u003ePaul was shown around by a supervisor, Jean Bevins, a heavy woman with spectacles.\u003c/p\u003e\n\u003cp\u003eAt first she was terrified of the visiting big shot who represented Montgomery himself~ but Paul smiled and talked softly and made her feel at ease.\u003c/p\u003e\n\u003cp\u003eShe took him to the transmitting room, where a hundred or so girls sat in rows, each with headphones, notebook, and pencils.\u003c/p\u003e\n\u003cp\u003eA big board showed agents\u0027 code names and scheduled times for transmission-known as \"skeds\" and always pronounced the American way- and the frequencies they would use.\u003c/p\u003e\n\u003cp\u003eThere was an atmosphere of intense concentration, the only sound being the tap of Morse code as an operator told an agent she was receiving him loud and clear.\u003c/p\u003e\n\u003cp\u003eJean introduced Paul to Lucy Briggs, a pretty blonde girl with a Yorkshire accent so strong that he had to concentrate hard to understand her.\u003c/p\u003e\n\u003cp\u003e\"Helicopter?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Aye, I know Helicopter-he\u0027s new.\u003c/p\u003e\n\u003cp\u003eHe calls in at twenty hundred hours and receives at twenty-three hundred.\u003c/p\u003e\n\u003cp\u003eNo problems, so far.\" She never pronounced the letter aitch.\u003c/p\u003e\n\u003cp\u003eOnce Paul realized that, he began to find it easier to interpret the accent.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" he asked her.\u003c/p\u003e\n\u003cp\u003e\"What sort of problems do you get?\" \"Well, some of them don\u0027t tune the transmitter right, so you have to search for the frequency.\u003c/p\u003e\n\u003cp\u003eThen the signal may be weak, so that you can\u0027t hear the letters very well, and you worry that you might be mistaking dashes for dots-the letter B is very like D, for instance.\u003c/p\u003e\n\u003cp\u003eAnd the tone is always bad from those little suitcase radios, because they\u0027re so small.\" \"Would you recognize his \u0027fist\u0027?\" She looked dubious.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s only broadcast three times.\u003c/p\u003e\n\u003cp\u003eOn Wednesday he was a bit nervous, probably because it was his first, but his pace was steady, as if he knew he had plenty of time.\u003c/p\u003e\n\u003cp\u003eI was pleased-I thought he must feel reasonably safe.\u003c/p\u003e\n\u003cp\u003eWe worry about them, you know.\u003c/p\u003e\n\u003cp\u003eWe\u0027re sitting here nice and warm and they\u0027re somewhere be-hind enemy lines dodging the bloody Gestapo.\" \"What about his second broadcast?\" \"That was Thursday, and he was rushed.\u003c/p\u003e\n\u003cp\u003eWhen they\u0027re in a hurry, it can be difficult to be sure what they mean-you know, was that two dots run together, or a short dash? Wherever he was sending from, he wanted to get out of there fast.\" \"And then?\" \"Friday he didn\u0027t broadcast.\u003c/p\u003e\n\u003cp\u003eBut I didn\u0027t worry.\u003c/p\u003e\n\u003cp\u003eThey don\u0027t call unless they have to, it\u0027s too dangerous.\u003c/p\u003e\n\u003cp\u003eThen he came on the air on Saturday morning, just before dawn.\u003c/p\u003e\n\u003cp\u003eIt was an emergency message, but he didn\u0027t sound panicky.\u003c/p\u003e\n\u003cp\u003eIn fact I remember thinking to myself~ He\u0027s getting the hang of this.\u003c/p\u003e\n\u003cp\u003eYou know, it was a strong signal, the rhythm was steady, all the letters clear.\" \"Could it have been someone else using his transmitter that time?\" She looked thoughtful.\u003c/p\u003e\n\u003cp\u003e\"It sounded like him.\u003c/p\u003e\n\u003cp\u003ebut yes, it could have been someone else, I suppose.\u003c/p\u003e\n\u003cp\u003eAnd if it was a German, pretending to be him, they would sound nice and steady, wouldn\u0027t they, because they\u0027d have nothing to fear.\" Paul felt as if he were wading through gumbo.\u003c/p\u003e\n\u003cp\u003eEvery question he asked had two answers.\u003c/p\u003e\n\u003cp\u003eHe yearned for something definite.\u003c/p\u003e\n\u003cp\u003eHe had to fight down panic every time he recalled to mind the dreadful prospect that he might lose Flick, less than a week after she had come into his life like a gift from the gods.\u003c/p\u003e\n\u003cp\u003eJean had disappeared, and returned now with a sheaf of papers in a plump hand.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve brought the decrypts of the three signals received from Helicopter,\" she said.\u003c/p\u003e\n\u003cp\u003eHer quiet efficiency pleased him.\u003c/p\u003e\n\u003cp\u003eHe looked at the first sheet.\u003c/p\u003e\n\u003cp\u003eCALL SIGN HLCP (HELICOPTER) SECURITY TAG PRESENT MAY 30 1944 MESSAGE READS: ARRIVED OK STOP CRYT RENDEVOUS UNSAFE STOP NABBED BY GGESTAPO BUT GOT AWAY STOP IN FUTURE RENDEZVOUS AT CAFE DE LA GARE OVER\u003c/p\u003e\n\u003cp\u003e\"He can\u0027t spell for nuts,\" Paul commented.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not his spelling,\" Jean said.\u003c/p\u003e\n\u003cp\u003e\"They always make errors in the Morse.\u003c/p\u003e\n\u003cp\u003eWe order the decoders to leave them in the decrypt, rather than tidy them up, in case there\u0027s some significance.\" Brian\u0027s second transmission, giving the strength of the Bollinger circuit, was longer.\u003c/p\u003e\n\u003cp\u003eCALLSIGN HLCP (HELICOPTER) SECURITY TAG PRESENT MAY 311944 MESSAGE READS: ACTIV AGENTS NOMBER FIVE AS FOLOWS STOP MONET WHO IS WOUNED STOP COMTESSE OK STOP CHEVAL HELPS OCA SIONLY STOP BOURGEOISE STILL IM PLACE STOP PLUS MY RESCUER COD- NAME CHARENTON STOP\u003c/p\u003e\n\u003cp\u003ePaul looked up.\u003c/p\u003e\n\u003cp\u003e\"This is much worse.\" Lucy said, \"I told you he was in a rush the second time.\" There was more of the second message, mainly a detailed account of the incident at the cathedral.\u003c/p\u003e\n\u003cp\u003ePaul went on to the third:\u003c/p\u003e\n\u003cp\u003eCALLSIGN HLCP (HELICOPTER) SECURITY TAG PRESENT JUN 2 1944 MESSAGE READS: WHAT THE DEVIL HAPPENED QUERY SEND INSTRUCTIONS STOP REPLY IMEDIATELY OVER\u003c/p\u003e\n\u003cp\u003e\"He\u0027s improving,\" Paul said.\u003c/p\u003e\n\u003cp\u003e\"Only one mistake.\" \"I thought he was more relaxed on Saturday,\" Lucy said.\u003c/p\u003e\n\u003cp\u003e\"Either that, or someone else sent the signal.\" Suddenly, Paul thought he saw a way to test whether \"Brian\" was himself or a Gestapo impersonator.\u003c/p\u003e\n\u003cp\u003eIf it worked, it would at least give him certainty.\u003c/p\u003e\n\u003cp\u003e\"Lucy, do you ever make mistakes in transmission?\" \"Hardly ever.\" She threw an anxious glance at her supervisor.\u003c/p\u003e\n\u003cp\u003e\"If a new girl is a bit careless, the agent will kick up a hell of a stink.\u003c/p\u003e\n\u003cp\u003eQuite rightly, too.\u003c/p\u003e\n\u003cp\u003eThere should never be any mistakes-the agents have enough problems to cope with.\" Paul turned to Jean.\u003c/p\u003e\n\u003cp\u003e\"If I draft a message, would you encode it exactly as it is? It would be a kind of test.\" \"Of course.\" He looked at his watch.\u003c/p\u003e\n\u003cp\u003eIt was seven-thirty p.m.\u003c/p\u003e\n\u003cp\u003e\"He should broadcast at eight.\u003c/p\u003e\n\u003cp\u003eCan you send it then?\" The supervisor said, \"Yes.\u003c/p\u003e\n\u003cp\u003eWhen he calls in, we\u0027ll just tell him to stand by to receive an emergency message immediately after transmission.\" Paul sat down, thought for a moment, then wrote on a pad:\u003c/p\u003e\n\u003cp\u003eGIVE YOUR ARMS HOW MAN AUTOMATS HOW MY STENS ALSO AMMO HOW MNY ROUNDS ECH PLUS GREDANES REPLY IMMMEDIATLY\u003c/p\u003e\n\u003cp\u003eHe considered it for a moment.\u003c/p\u003e\n\u003cp\u003eIt was an unreasonable request, phrased in a high-handed tone, and it appeared to be carelessly encoded and transmitted.\u003c/p\u003e\n\u003cp\u003eHe showed it to Jean.\u003c/p\u003e\n\u003cp\u003eShe frowned.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a terrible message.\u003c/p\u003e\n\u003cp\u003eI\u0027d be ashamed of it.\" \"What do you think an agent\u0027s reaction would be?\" She gave a humorless laugh.\u003c/p\u003e\n\u003cp\u003e\"He would send an angry reply with a few swear words in it.\" \"Please encode it exactly as it is and send it to Helicopter.\" She looked troubled.\u003c/p\u003e\n\u003cp\u003e\"If that\u0027s what you wish.\" \"Yes, please.\" \"Of course.\" She took it away.\u003c/p\u003e\n\u003cp\u003ePaul went in search of food.\u003c/p\u003e\n\u003cp\u003eThe canteen operated twenty-four hours a day, as the station did, but the coffee was tasteless and there was nothing to eat but some stale sandwiches and dried-up cake.\u003c/p\u003e\n\u003cp\u003eA few minutes after eight o\u0027clock, the supervisor came into the canteen.\u003c/p\u003e\n\u003cp\u003e\"Helicopter called in to say he had had no word yet from Leopardess.\u003c/p\u003e\n\u003cp\u003eWe\u0027re sending him the emergency message now.\" \"Thank you.\" It would take Brian-or his Gestapo impersonator-at least an hour to decode the message, compose a reply, encode it, and transmit it.\u003c/p\u003e\n\u003cp\u003ePaul stared at his plate, wondering how the British had the nerve to call this a sandwich: two pieces of white bread smeared with margarine and one thin slice of ham.\u003c/p\u003e\n\u003cp\u003eNo mustard. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-33.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
