{"id":68405,"no":34,"title":"Page 34","content":"\u003cp\u003eTHE RED-LIGHT DISTRICT of Paris was a neighborhood of narrow, dirty streets on a low hill behind the rue de la Chapelle, not far from the Gare du Nord.\u003c/p\u003e\n\u003cp\u003eAt its heart was \"La Charbo,\" the rue de la Charbonnire.\u003c/p\u003e\n\u003cp\u003eOn the north side of the street, the convent of la Chapelle stood like a marble statue in a junkyard.\u003c/p\u003e\n\u003cp\u003eThe convent consisted of a tiny church and a house where eight nuns dedicated their lives to helping the most wretched of Parisians.\u003c/p\u003e\n\u003cp\u003eThey made soup for starving old men, talked depressed women out of suicide, dragged drunk sailors from the gutter, and taught the children of prostitutes to read and write.\u003c/p\u003e\n\u003cp\u003eNext door to the convent stood the Hotel de la Chapelle.\u003c/p\u003e\n\u003cp\u003eThe hotel was not exactly a brothel, for there were no whores in residence, but when the place was not full the proprietress was willing to rent rooms by the hour to heavily made-up women in cheap evening gowns who arrived with fat French businessmen, furtive German soldiers, or naive young men too drunk to see straight.\u003c/p\u003e\n\u003cp\u003eFlick walked through the door with a mighty sense of relief~ The gendarmes had dropped her off half a mile away.\u003c/p\u003e\n\u003cp\u003eShe had seen two copies of her Wanted poster on the way.\u003c/p\u003e\n\u003cp\u003eChristian had given her his handkerchief~ a clean cotton square, red with white dots, and she had tied it over her head in an attempt to hide her blonde hair, but she knew that anyone who looked hard at her would recognize her from the poster.\u003c/p\u003e\n\u003cp\u003eThere had been nothing she could do but keep her eyes down and her fingers crossed.\u003c/p\u003e\n\u003cp\u003eIt had seemed like the longest walk of her life.\u003c/p\u003e\n\u003cp\u003eThe proprietress was a friendly, overweight woman wearing a pink silk bathrobe over a whalebone corset.\u003c/p\u003e\n\u003cp\u003eShe had once been voluptuous, Flick guessed.\u003c/p\u003e\n\u003cp\u003eFlick had stayed at the place before, but the proprietress did not appear to remember her.\u003c/p\u003e\n\u003cp\u003eFlick addressed her as \"Madame,\" but she said, \"Call me Regine.\" She took Flick\u0027s money and gave her a room key without asking any questions.\u003c/p\u003e\n\u003cp\u003eFlick was about to go upstairs to her room when she glanced through the window and saw Diana and Maude arriving in a strange kind of taxi, a sofa on wheels attached to a bicycle.\u003c/p\u003e\n\u003cp\u003eTheir brush with the gendarmes did not seem to have sobered them, and they were giggling about the vehicle.\u003c/p\u003e\n\u003cp\u003e\"Good God, what a dump,\" said Diana when she walked in the door.\u003c/p\u003e\n\u003cp\u003e\"Perhaps we can eat out.\" Paris restaurants had continued to operate during the occupation, but inevitably many of their customers were German officers, and agents avoided them if they could.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t even think about it,\" Flick said crossly.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to lie low here for a few hours, then go to the Gare de l\u0027Est at first light.\" Maude looked accusingly at Diana.\u003c/p\u003e\n\u003cp\u003e\"You promised to take me to the Ritz.\" Flick controlled her temper.\u003c/p\u003e\n\u003cp\u003e\"What world are you living in?\" she hissed at Maude.\u003c/p\u003e\n\u003cp\u003e\"All right, keep your hair on.\" \"Nobody leaves! Is that understood?\" \"Yes, yes.\" \"One of us will go out and buy food later.\u003c/p\u003e\n\u003cp\u003eI have to get out of sight now.\u003c/p\u003e\n\u003cp\u003eDiana, you sit here and wait for the others while Maude checks into your room.\u003c/p\u003e\n\u003cp\u003eLet me know when everyone\u0027s arrived.\" Climbing the stairs, Flick passed a Negro girl in a tight red dress and noticed that she had a full head of straight black hair.\u003c/p\u003e\n\u003cp\u003e\"Wait,\" Flick said to her.\u003c/p\u003e\n\u003cp\u003e\"Will you sell me your wig?\" \"You can buy one yourself around the corner, honey.\" She looked Flick up and down, taking her for an amateur hooker.\u003c/p\u003e\n\u003cp\u003e\"But, frankly, I\u0027d say you need more than a wig.\" \"I\u0027m in a hurry.\" The girl pulled it off to reveal black curls cropped close to her scalp.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t work without it.\" Flick took a thousand-franc note from her jacket pocket.\u003c/p\u003e\n\u003cp\u003e\"Buy yourself another.\" She looked at Flick with new eyes, realizing she had too much money to be a prostitute.\u003c/p\u003e\n\u003cp\u003eWith a shrug, she accepted the money and handed over the wig.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" said Flick.\u003c/p\u003e\n\u003cp\u003eThe girl hesitated.\u003c/p\u003e\n\u003cp\u003eNo doubt she was wondering how many more of those notes Flick had.\u003c/p\u003e\n\u003cp\u003e\"I do girls, too,\" she said.\u003c/p\u003e\n\u003cp\u003eShe reached out and brushed Flick\u0027s breast lightly with her fingertips.\u003c/p\u003e\n\u003cp\u003e\"No, thanks.\" \"Maybe you and your boyfriend-\"\u003c/p\u003e\n\u003cp\u003eThe girl looked at the thousand-franc note.\u003c/p\u003e\n\u003cp\u003e\"Well, I guess this is my night off Good luck, honey.\" \"Thanks,\" said Flick.\u003c/p\u003e\n\u003cp\u003e\"I need it.\" She found her room, put her case on the bed, and took off her jacket.\u003c/p\u003e\n\u003cp\u003eThere was a small mirror over a washbasin.\u003c/p\u003e\n\u003cp\u003eFlick washed her hands, then stood looking at her face for a moment.\u003c/p\u003e\n\u003cp\u003eShe combed her short blonde hair back over her ears and pinned it with hair clips.\u003c/p\u003e\n\u003cp\u003eThen she put on the wig and adjusted it.\u003c/p\u003e\n\u003cp\u003eIt was a bit big, but it would stay on.\u003c/p\u003e\n\u003cp\u003eThe black hair altered her appearance radically.\u003c/p\u003e\n\u003cp\u003eHowever, her fair eyebrows now looked peculiar.\u003c/p\u003e\n\u003cp\u003eShe took the eyebrow pencil from her makeup kit and darkened them.\u003c/p\u003e\n\u003cp\u003eThat was much better.\u003c/p\u003e\n\u003cp\u003eNot only did she look like a brunette, she seemed more formidable than the sweet girl in the swimsuit.\u003c/p\u003e\n\u003cp\u003eShe had the same straight nose and severe chin, but that seemed like a family resemblance between two otherwise different-looking sisters.\u003c/p\u003e\n\u003cp\u003eNext she took her identity papers from her jacket pocket.\u003c/p\u003e\n\u003cp\u003eWith great care, she retouched the photograph, using the eyebrow pencil to draw faint lines of dark hair and narrow dark eyebrows.\u003c/p\u003e\n\u003cp\u003eWhen she was done, she looked hard at the picture.\u003c/p\u003e\n\u003cp\u003eShe did not think anyone would be able to tell it had been doctored unless they rubbed it hard enough to smear the pencil marks.\u003c/p\u003e\n\u003cp\u003eShe took off the wig, stepped out of her shoes, and lay on the bed.\u003c/p\u003e\n\u003cp\u003eShe had not slept for two nights, because she had spent Thursday night making love to Paul and Friday night on the metal floor of a Hudson bomber.\u003c/p\u003e\n\u003cp\u003eNow she closed her eyes and dropped off within seconds.\u003c/p\u003e\n\u003cp\u003eShe was awakened by a knock at the door.\u003c/p\u003e\n\u003cp\u003eTo her surprise, it was getting dark: she had slept for several hours.\u003c/p\u003e\n\u003cp\u003eShe went to the door and said, \"Who is it?\" \"Ruby.\" She let her in.\u003c/p\u003e\n\u003cp\u003e\"Is everything all right?\" \"I\u0027m not sure.\" Flick closed the curtains, then switched on the light.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened?\" \"Everyone has checked in.\u003c/p\u003e\n\u003cp\u003eBut I don\u0027t know where Diana and Maude are.\u003c/p\u003e\n\u003cp\u003eThey\u0027re not in their room.\" \"Where have you looked?\" \"The proprietress\u0027s office, the little church next door, the bar across the street.\" \"Oh, Christ,\" Flick said in dismay.\u003c/p\u003e\n\u003cp\u003e\"The bloody fools, they\u0027ve gone out.\" \"Where would they have gone?\" \"Maude wanted to go to the Ritz.\" Ruby was incredulous.\u003c/p\u003e\n\u003cp\u003e\"They can\u0027t be that stupid!\" \"Maude can.\" \"But I thought Diana had more sense.\" \"Diana\u0027s in love,\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"I suppose she\u0027ll do anything Maude asks.\u003c/p\u003e\n\u003cp\u003eAnd she wants to impress her paramour, take her to swanky places, show that she knows her way around the world of high society.\" \"They say love is blind.\" \"In this case, love is bloody suicidal.\u003c/p\u003e\n\u003cp\u003eI can\u0027t believe it-but I bet that\u0027s where they\u0027ve gone.\u003c/p\u003e\n\u003cp\u003eIt will serve them right if they end up dead.\" \"What\u0027ll we do?\" \"Go to the Ritz and get them out of there-if we\u0027re not too late.\" Flick put on her wig.\u003c/p\u003e\n\u003cp\u003eRuby said, \"I wondered why your eyebrows had gone dark.\u003c/p\u003e\n\u003cp\u003eIt\u0027s effective, you look like someone else.\" \"Good.\u003c/p\u003e\n\u003cp\u003eGet your gun.\" In the lobby, R ne handed Flick a note.\u003c/p\u003e\n\u003cp\u003eIt was addressed in Diana\u0027s handwriting.\u003c/p\u003e\n\u003cp\u003eFlick ripped it open and read:\u003c/p\u003e\n\u003cp\u003eWe\u0027re going to a better hotel.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll meet you at the Gare de l\u0027Est at 5 a.m.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry!\u003c/p\u003e\n\u003cp\u003eShe showed it to Ruby, then ripped it to shreds.\u003c/p\u003e\n\u003cp\u003eShe was most angry with herself.\u003c/p\u003e\n\u003cp\u003eShe had known Diana all her life, it was no surprise that she was foolish and irresponsible.\u003c/p\u003e\n\u003cp\u003eWhy did I bring her? she asked herself Because I had no one else, was the answer.\u003c/p\u003e\n\u003cp\u003eThey left the flophouse.\u003c/p\u003e\n\u003cp\u003eFlick did not want to use the Metro, for she knew there were Gestapo checkpoints at some stations and occasional spot checks on the trains.\u003c/p\u003e\n\u003cp\u003eThe Ritz was in the Place Vendome a brisk half-hour walk from La Charbo.\u003c/p\u003e\n\u003cp\u003eThe sun had gone down, and night was falling fast.\u003c/p\u003e\n\u003cp\u003eThey would have to keep an eye on the time: there was an eleven o\u0027clock curfew.\u003c/p\u003e\n\u003cp\u003eFlick wondered how long it would take the Ritz staff to call the Gestapo about Diana and Maude.\u003c/p\u003e\n\u003cp\u003eThey would have known immediately that there was something odd about them.\u003c/p\u003e\n\u003cp\u003eTheir papers said they were secretaries from Reims-what were two such women doing at the Ritz? They were dressed respectably enough, by the standards of occupied France, but they certainly did not look like typical Ritz clients-the wives of diplomats from neutral countries, the girlfriends of black marketers, or the mistresses of German officers.\u003c/p\u003e\n\u003cp\u003eThe hotel manager himself might not do anything, especially if he was anti-Nazi, but the Gestapo had informants in every large hotel and restaurant in the city, and strangers with implausible stories were just what they were paid to report.\u003c/p\u003e\n\u003cp\u003eThis kind of detail was drummed into people on SOE\u0027s training course-but that course lasted three months, and Diana and Maude had been given only two days.\u003c/p\u003e\n\u003cp\u003eFlick quickened her step. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-34.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
