{"id":68406,"no":35,"title":"Page 35","content":"\u003cp\u003eDIETER WAS EXHAUSTED.\u003c/p\u003e\n\u003cp\u003eTo get a thousand posters printed and distributed in half a day had taken all his powers of persuasion and intimidation.\u003c/p\u003e\n\u003cp\u003eHe had been patient and persistent when he could and had flown into a mad rage when necessary.\u003c/p\u003e\n\u003cp\u003eIn addition, he had not slept the previous night.\u003c/p\u003e\n\u003cp\u003eHis nerves were jangled, he had a headache, and his temper was short.\u003c/p\u003e\n\u003cp\u003eBut a feeling of peace descended on him as soon as he entered the grand apartment building at the Porte de la Muette, overlooking the Bois de Boulogne.\u003c/p\u003e\n\u003cp\u003eThe job he had been doing for Rommel required him to travel all over northern France, so he needed to be based in Paris, but getting this place had taken a lot of bribery and bullying.\u003c/p\u003e\n\u003cp\u003eIt had been worth it.\u003c/p\u003e\n\u003cp\u003eHe loved the dark mahogany paneling, the heavy curtains, the high ceilings, the eighteenth-century silver on the sideboard.\u003c/p\u003e\n\u003cp\u003eHe walked around the cool, dim apartment, renewing his acquaintance with his favorite possessions: a small Rodin sculpture of a hand, a Degas pastel of a dancer putting on a ballet slipper, a first edition of The Count of Monte Cristo.\u003c/p\u003e\n\u003cp\u003eHe sat at the Steinway baby grand piano and played a languid version of \"Ain\u0027t Misbehavin\u0027 \":\u003c/p\u003e\n\u003cp\u003eNo one to talk with, all by myself...\u003c/p\u003e\n\u003cp\u003eBefore the war, the apartment and much of the furniture had belonged to an engineer from Lyon, who had made a fortune manufacturing small electrical goods, vacuum cleaners and radios and doorbells.\u003c/p\u003e\n\u003cp\u003eDieter had learned this from a neighbor, a rich widow whose husband had been a leading French Fascist in the thirties.\u003c/p\u003e\n\u003cp\u003eThe engineer was a vulgarian, she said: he had hired people to choose the right wallpaper and antiques.\u003c/p\u003e\n\u003cp\u003eFor him, the only purpose of objects of beauty had been to impress his wife\u0027s friends.\u003c/p\u003e\n\u003cp\u003eHe had gone to America, where everyone was vulgar, said the widow.\u003c/p\u003e\n\u003cp\u003eShe was pleased the apartment now had a tenant who really appreciated it.\u003c/p\u003e\n\u003cp\u003eDieter took off his jacket and shirt and washed the Paris grime from his face and neck.\u003c/p\u003e\n\u003cp\u003eThen he put on a clean white shirt, inserted gold links in the French cuffs, and chose a silver-gray tie.\u003c/p\u003e\n\u003cp\u003eWhile he was tying it, he switched on the radio.\u003c/p\u003e\n\u003cp\u003eThe news from Italy was bad.\u003c/p\u003e\n\u003cp\u003eThe newscaster said the Germans were fighting a fierce rearguard action.\u003c/p\u003e\n\u003cp\u003eDieter concluded that Rome must fall in the next few days.\u003c/p\u003e\n\u003cp\u003eBut Italy was not France.\u003c/p\u003e\n\u003cp\u003eHe now had to wait for someone to spot Felicity Clairet.\u003c/p\u003e\n\u003cp\u003eHe could not be certain she would pass through Paris, of course, but it was undoubtedly the likeliest place, after Reims, for her to be seen.\u003c/p\u003e\n\u003cp\u003eAnyway, there was nothing more he could do.\u003c/p\u003e\n\u003cp\u003eHe wished he had brought Stephanie with him from Reims.\u003c/p\u003e\n\u003cp\u003eHowever, he needed her to occupy the house in the rue du Bois.\u003c/p\u003e\n\u003cp\u003eThere was a chance that more Allied agents would land and find their way to her door.\u003c/p\u003e\n\u003cp\u003eIt was important to draw them gently into the net.\u003c/p\u003e\n\u003cp\u003eHe had left instructions that neither Michel nor Dr. Bouler was to be tortured in his absence: he might yet have uses for them.\u003c/p\u003e\n\u003cp\u003eThere was a bottle of Dom Perignon champagne in the icebox.\u003c/p\u003e\n\u003cp\u003eHe opened it and poured some into a crystal flute.\u003c/p\u003e\n\u003cp\u003eThen, with a feeling that life was good, he sat down at his desk to read his mail.\u003c/p\u003e\n\u003cp\u003eThere was a letter from his wife, Waltraud.\u003c/p\u003e\n\u003cp\u003eMy beloved Dieter, lam so sorry we will not be together on your fortieth birthday.\u003c/p\u003e\n\u003cp\u003eDieter had forgotten his birthday.\u003c/p\u003e\n\u003cp\u003eHe looked at the date on his Cartier desk clock.\u003c/p\u003e\n\u003cp\u003eIt was June 3.\u003c/p\u003e\n\u003cp\u003eHe was forty years old today.\u003c/p\u003e\n\u003cp\u003eHe poured another glass of champagne to celebrate.\u003c/p\u003e\n\u003cp\u003eIn the envelope from his wife were two other missives.\u003c/p\u003e\n\u003cp\u003eHis seven-year-old daughter, Margarete, known as Mausi, had drawn a picture of him in uniform standing by the Eiffel Tower.\u003c/p\u003e\n\u003cp\u003eIn the picture, he was taller than the tower: so children magnified their fathers.\u003c/p\u003e\n\u003cp\u003eHis son, Rudi, ten years old, had written a grown-up letter, carefully rounded letters in dark blue ink:\u003c/p\u003e\n\u003cp\u003eMy dear Papa, I am doing well in school although Dr. Richter\u0027s classroom has been bombed.\u003c/p\u003e\n\u003cp\u003eFortunately it was nighttime and the school was empty.\u003c/p\u003e\n\u003cp\u003eDieter closed his eyes in pain.\u003c/p\u003e\n\u003cp\u003eHe could not bear the thought of bombs falling on the city where his children lived.\u003c/p\u003e\n\u003cp\u003eHe cursed the murderers of the RAF, even though he knew German bombs had fallen on British schoolchildren.\u003c/p\u003e\n\u003cp\u003eHe looked at the phone on his desk, contemplating trying to call home.\u003c/p\u003e\n\u003cp\u003eIt was difficult to get through: the French phone system was overloaded, and military traffic had priority, so you could wait hours for a personal call to be connected.\u003c/p\u003e\n\u003cp\u003eAll the same, he decided to try.\u003c/p\u003e\n\u003cp\u003eHe felt a sudden longing to hear the voices of his children and reassure himself that they were still alive.\u003c/p\u003e\n\u003cp\u003eHe reached for the phone.\u003c/p\u003e\n\u003cp\u003eIt rang before he touched it.\u003c/p\u003e\n\u003cp\u003eHe picked it up.\u003c/p\u003e\n\u003cp\u003e\"Major Franck here.\" \"This is Lieutenant Hesse.\" Dieter\u0027s pulse quickened.\u003c/p\u003e\n\u003cp\u003e\"You have found Felicity Clairet?\" \"No.\u003c/p\u003e\n\u003cp\u003eBut something almost as good.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-35.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
