{"id":68407,"no":36,"title":"Page 36","content":"\u003cp\u003eFLICK HAD BEEN to the Ritz once, when she was a student in Paris before the war.\u003c/p\u003e\n\u003cp\u003eShe and a girlfriend had put on hats and makeup, gloves and stockings, and walked through the door as if they did it every day.\u003c/p\u003e\n\u003cp\u003eThey had sauntered along the hotel\u0027s internal arcade of shops, giggling at the absurd prices of scarves and fountain pens and perfume.\u003c/p\u003e\n\u003cp\u003eThen they had sat in the lobby, pretending they were meeting someone who was late, and criticized the outfits of the women who came there to tea.\u003c/p\u003e\n\u003cp\u003eThey themselves had not dared to order so much as a glass of water.\u003c/p\u003e\n\u003cp\u003eIn those days, Flick had saved every spare penny for cheap seats at the Comedie Francaise.\u003c/p\u003e\n\u003cp\u003eSince the occupation began, she had heard that the owners were attempting to run the hotel as normally as possible, even though many of the rooms had been taken over permanently by top Nazis.\u003c/p\u003e\n\u003cp\u003eShe had no gloves or stockings today, but she had powdered her face and set her beret at a jaunty angle, and she just had to hope that some of the hotel\u0027s wartime patrons would be forced into similar compromises.\u003c/p\u003e\n\u003cp\u003eLines of gray military vehicles and black limousines were lined up outside the hotel in the Place Vendome On the facade of the building, six blood red Nazi banners flapped boastfully in the breeze.\u003c/p\u003e\n\u003cp\u003eA commissionaire in top hat and red trousers looked doubtfully at Flick and Ruby.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t come in,\" he said.\u003c/p\u003e\n\u003cp\u003eFlick was in a light blue suit, very creased, and Ruby in a navy frock and a man\u0027s raincoat.\u003c/p\u003e\n\u003cp\u003eThey were not dressed to dine at the Ritz.\u003c/p\u003e\n\u003cp\u003eFlick tried to imitate the hauteur of a French woman dealing with an irritating inferior.\u003c/p\u003e\n\u003cp\u003ePutting her nose in the air, she said, \"What is the matter?\" \"This entrance is reserved for the top brass, Madame.\u003c/p\u003e\n\u003cp\u003eEven German colonels can\u0027t come in this way.\u003c/p\u003e\n\u003cp\u003eYou have to go around to the rue Cambon and use the back door.\" \"As you wish,\" Flick said with an air of weary courtesy, but in truth she was pleased he had not told them they were underdressed.\u003c/p\u003e\n\u003cp\u003eShe and Ruby walked quickly around the block and found the rear entrance.\u003c/p\u003e\n\u003cp\u003eThe lobby was bright with light, and the bars on either side were full of men in evening dress or uniform.\u003c/p\u003e\n\u003cp\u003eThe buzz of conversation clicked and whirred with German consonants, not the languid vowels of French.\u003c/p\u003e\n\u003cp\u003eFlick felt as though she were walking into the enemy\u0027s stronghold.\u003c/p\u003e\n\u003cp\u003eShe went up to the desk.\u003c/p\u003e\n\u003cp\u003eA concierge in a coat with brass buttons looked down his nose at her.\u003c/p\u003e\n\u003cp\u003eJudging her to be neither a German nor a wealthy French woman, he said coldly, \"What is it?\" \"Check whether Mademoiselle Legrand is in her room,\" Flick said peremptorily.\u003c/p\u003e\n\u003cp\u003eShe assumed that Diana must be using the false name on her papers, Simone Legrand.\u003c/p\u003e\n\u003cp\u003e\"I have an appointment.\" He backed off \"May I tell her who is inquiring?\" \"Madame Martigny.\u003c/p\u003e\n\u003cp\u003eI am her employee.\" \"Very good.\u003c/p\u003e\n\u003cp\u003eIn fact, Mademoiselle is in the rear dining room with her companion.\u003c/p\u003e\n\u003cp\u003ePerhaps you would speak to the head waiter.\" Flick and Ruby crossed the lobby and entered the restaurant.\u003c/p\u003e\n\u003cp\u003eIt was a picture of elegant living: white tablecloths, silver cutlery, candles, and waiters in black gliding around the room with dishes of food.\u003c/p\u003e\n\u003cp\u003eNo one would have guessed that half Paris was starving.\u003c/p\u003e\n\u003cp\u003eFlick smelled real coffee.\u003c/p\u003e\n\u003cp\u003ePausing on the threshold, she immediately saw Diana and Maude.\u003c/p\u003e\n\u003cp\u003eThey were at a small table on the far side of the room.\u003c/p\u003e\n\u003cp\u003eAs Flick watched, Diana took a bottle of wine out of a gleaming bucket beside the table and poured for Maude and herself.\u003c/p\u003e\n\u003cp\u003eFlick could have throttled her.\u003c/p\u003e\n\u003cp\u003eShe turned to make for the table, but the head waiter stood in her way.\u003c/p\u003e\n\u003cp\u003ePointedly looking at her cheap suit, he said, \"Yes, Madame?\" \"Good evening,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I must speak with that lady over there.\" He did not move.\u003c/p\u003e\n\u003cp\u003eHe was a small man with a worried air, but he was not to be bullied.\u003c/p\u003e\n\u003cp\u003e\"Perhaps I can give her a message for you.\" \"I\u0027m afraid not, it\u0027s too personal.\" \"Then I will tell her that you are here.\u003c/p\u003e\n\u003cp\u003eThe name?\" Flick glared in Diana\u0027s direction, but Diana did not look up.\u003c/p\u003e\n\u003cp\u003e\"I am Madame Martigny,\" Flick said, giving up.\u003c/p\u003e\n\u003cp\u003e\"Tell her I must speak to her immediately.\" \"Very well.\u003c/p\u003e\n\u003cp\u003eIf Madame would care to wait here.\" Flick ground her teeth with frustration.\u003c/p\u003e\n\u003cp\u003eAs the head waiter walked away, she was tempted just to run past him.\u003c/p\u003e\n\u003cp\u003eThen she noticed a young man in the black uniform of an SS major at a nearby table staring at her.\u003c/p\u003e\n\u003cp\u003eShe met his eye and looked away, fear rising in her throat.\u003c/p\u003e\n\u003cp\u003eHad he merely taken an idle interest in her altercation with the head waiter? Was he trying to remember where he had seen her before, having seen the poster but not yet made the connection? Or did he simply find her attractive? In any event, Flick realized, it would be dangerous for her to make a fuss.\u003c/p\u003e\n\u003cp\u003eEvery second she stood here was dangerous.\u003c/p\u003e\n\u003cp\u003eShe resisted the temptation to turn and run.\u003c/p\u003e\n\u003cp\u003eThe head waiter spoke to Diana, then turned and beckoned Flick.\u003c/p\u003e\n\u003cp\u003eFlick said to Ruby, \"You\u0027d better wait here-one is less conspicuous than two.\" Then she walked quickly across the room to Diana\u0027s table.\u003c/p\u003e\n\u003cp\u003eNeither Diana nor Maude had the grace to look guilty, Flick observed angrily.\u003c/p\u003e\n\u003cp\u003eMaude appeared pleased with herself, Diana haughty.\u003c/p\u003e\n\u003cp\u003eFlick put her hands on the edge of the table and leaned forward to speak in a low voice.\u003c/p\u003e\n\u003cp\u003e\"This is terribly dangerous.\u003c/p\u003e\n\u003cp\u003eGet up, now, and leave with me.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll pay the bill on the way out.\" She had been as forceful as she knew how, but they were living in a fantasy world.\u003c/p\u003e\n\u003cp\u003e\"Be reasonable, flick,\" Diana said.\u003c/p\u003e\n\u003cp\u003eFlick was outraged.\u003c/p\u003e\n\u003cp\u003eHow could Diana be such an arrogant idiot? \"You stupid cow,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you realize you\u0027ll get killed?\" She saw immediately that it had been a mistake to use abuse.\u003c/p\u003e\n\u003cp\u003eDiana looked superior.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my life.\u003c/p\u003e\n\u003cp\u003eI\u0027m entitled to take that risk-\" \"You\u0027re endangering us too, and the whole mission.\u003c/p\u003e\n\u003cp\u003eNow get up off that chair!\" \"Look here-\" There was a commotion behind Flick.\u003c/p\u003e\n\u003cp\u003eDiana stopped and looked past her.\u003c/p\u003e\n\u003cp\u003eFlick turned around and gasped.\u003c/p\u003e\n\u003cp\u003eStanding in the entrance was the well-dressed German officer she had last seen in the square at SainteCecile.\u003c/p\u003e\n\u003cp\u003eShe took him in at a glance: a tall figure in an elegant dark suit with a white handkerchief in the breast pocket.\u003c/p\u003e\n\u003cp\u003eShe quickly turned her back, heart pounding, and prayed that he had not noticed her.\u003c/p\u003e\n\u003cp\u003eWith her dark wig, there was a good chance he would not have recognized her at first glance.\u003c/p\u003e\n\u003cp\u003eHis name came back to her: Dieter Franck.\u003c/p\u003e\n\u003cp\u003eShe had found his photograph in Percy Thwaite\u0027s files.\u003c/p\u003e\n\u003cp\u003eHe was a former police detective.\u003c/p\u003e\n\u003cp\u003eShe recalled the note on the back of his photo: \"A star of Rommel\u0027s intelligence staff, this officer is said to be a skilled interrogator and a ruthless torturer.\" For the second time in a week, she was close enough to shoot him.\u003c/p\u003e\n\u003cp\u003eFlick did not believe in coincidence.\u003c/p\u003e\n\u003cp\u003eThere was a reason he was here at the same time as she.\u003c/p\u003e\n\u003cp\u003eShe soon found out what it was.\u003c/p\u003e\n\u003cp\u003eShe looked again and saw him striding across the restaurant toward her, with four Gestapo types trailing him.\u003c/p\u003e\n\u003cp\u003eThe head waiter came after them, a look of panic on his face.\u003c/p\u003e\n\u003cp\u003eKeeping her face averted, Flick walked away.\u003c/p\u003e\n\u003cp\u003eFranck went straight to Diana\u0027s table.\u003c/p\u003e\n\u003cp\u003eThe whole place suddenly became quiet: customers fell silent in midsentence, waiters stopped serving vegetables, the sommelier froze with a decanter of claret in his hand.\u003c/p\u003e\n\u003cp\u003eFlick reached the doorway, where Ruby stood waiting.\u003c/p\u003e\n\u003cp\u003eRuby whispered, \"He\u0027s going to arrest them.\" Her hand moved toward her gun.\u003c/p\u003e\n\u003cp\u003eFlick again caught the eye of the SS major.\u003c/p\u003e\n\u003cp\u003e\"Leave it in your pocket,\" she murmured.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing we can do.\u003c/p\u003e\n\u003cp\u003eWe might take on him and four Gestapo men, but we\u0027re surrounded by German officers.\u003c/p\u003e\n\u003cp\u003eEven if we killed all those five we\u0027d be mowed down by the others.\" Franck was questioning Diana and Maude.\u003c/p\u003e\n\u003cp\u003eFlick could not make out the words.\u003c/p\u003e\n\u003cp\u003eDiana\u0027s voice took on the tone of supercilious indifference she used when she was in the wrong.\u003c/p\u003e\n\u003cp\u003eMaude became tearful.\u003c/p\u003e\n\u003cp\u003eFranck must have asked for their papers, because the two women simultaneously reached for their handbags, on the floor beside their chairs.\u003c/p\u003e\n\u003cp\u003eFranck shifted his position so that he was to one side of Diana and slightly behind her, looking over her shoulder, and suddenly Flick knew what was going to happen next.\u003c/p\u003e\n\u003cp\u003eMaude took out her identity papers, but Diana pulled a gun.\u003c/p\u003e\n\u003cp\u003eA shot rang out, and one of the uniformed Gestapo men doubled over and fell.\u003c/p\u003e\n\u003cp\u003eThe restaurant erupted.\u003c/p\u003e\n\u003cp\u003eWomen screamed, men dived for cover.\u003c/p\u003e\n\u003cp\u003eThere was a second shot, and another Gestapo man cried out.\u003c/p\u003e\n\u003cp\u003eSome diners ran for the exit.\u003c/p\u003e\n\u003cp\u003eDiana\u0027s gun hand moved toward a third Gestapo man.\u003c/p\u003e\n\u003cp\u003eFlick had a flash of memory: Diana in the woods at Somersholme, sitting on the ground smoking a cigarette with dead rabbits all around her.\u003c/p\u003e\n\u003cp\u003eShe remembered what she had said to Diana: \"You\u0027re a killer.\" She had been right.\u003c/p\u003e\n\u003cp\u003eBut Diana did not fire the third shot.\u003c/p\u003e\n\u003cp\u003eDieter Franck kept a cool head.\u003c/p\u003e\n\u003cp\u003eHe seized Diana\u0027s right forearm with both his hands and banged her wrist on the edge of the table.\u003c/p\u003e\n\u003cp\u003eShe screamed with pain and the gun fell from her grasp.\u003c/p\u003e\n\u003cp\u003eHe yanked her out of her chair, threw her facedown on the carpet, and fell on her with both knees in the small of her back.\u003c/p\u003e\n\u003cp\u003eHe pulled her hands behind her back and handcuffed her, ignoring the screams of pain she gave as he jerked her injured wrist.\u003c/p\u003e\n\u003cp\u003eHe stood up.\u003c/p\u003e\n\u003cp\u003eFlick said to Ruby, \"Let\u0027s get out of here.\" There was a crush at the doorway, panicky men and women all trying to pass through at the same time.\u003c/p\u003e\n\u003cp\u003eBefore Flick could move, the young SS major who had been staring at her earlier sprang to his feet and grabbed her arm.\u003c/p\u003e\n\u003cp\u003e\"Wait a moment,\" he said in French.\u003c/p\u003e\n\u003cp\u003eFlick fought down panic.\u003c/p\u003e\n\u003cp\u003e\"Take your hands off me!\" He tightened his grip.\u003c/p\u003e\n\u003cp\u003e\"You seem to know those women over there,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t!\" She tried to move away.\u003c/p\u003e\n\u003cp\u003eHe pulled her back with a jerk.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better stay here and answer some questions.\" There was another shot.\u003c/p\u003e\n\u003cp\u003eSeveral women screamed, but no one knew where the shot had come from.\u003c/p\u003e\n\u003cp\u003eThe SS officer\u0027s face twisted in a grimace of agony.\u003c/p\u003e\n\u003cp\u003eAs he slumped to the floor, Flick saw Ruby, behind him, slipping her pistol back into her raincoat pocket.\u003c/p\u003e\n\u003cp\u003eThey both forced their way through the crowd at the door, shoving ruthlessly, and burst out into the lobby.\u003c/p\u003e\n\u003cp\u003eThey were able to run without drawing attention to themselves, because everyone else was running.\u003c/p\u003e\n\u003cp\u003eCars were parked in a line along the curb in the rue Cambon, some of them attended by chauffeurs.\u003c/p\u003e\n\u003cp\u003eMost of the chauffeurs were hurrying toward the hotel to see what was happening.\u003c/p\u003e\n\u003cp\u003eFlick picked a black Mercedes 230 sedan with a spare wheel perched on the running board.\u003c/p\u003e\n\u003cp\u003eShe looked into the front: the key was in the dash.\u003c/p\u003e\n\u003cp\u003e\"Get in!\" she yelled at Ruby.\u003c/p\u003e\n\u003cp\u003eShe got behind the wheel and pulled the self-starter.\u003c/p\u003e\n\u003cp\u003eA big engine rumbled into life.\u003c/p\u003e\n\u003cp\u003eShe engaged first gear, heaved the steering wheel around, and accelerated away from the Ritz.\u003c/p\u003e\n\u003cp\u003eThe car was heavy and sluggish, but stable: at speed, it cornered like a train.\u003c/p\u003e\n\u003cp\u003eWhen she was several blocks away she reviewed her position.\u003c/p\u003e\n\u003cp\u003eShe had lost a third of her team, including her best marksman.\u003c/p\u003e\n\u003cp\u003eShe considered whether to abandon the mission and immediately decided to carry on.\u003c/p\u003e\n\u003cp\u003eIt would be awkward: she would have to explain why only four cleaners had come to the chateau instead of the usual six, but she could make up some excuse.\u003c/p\u003e\n\u003cp\u003eIt meant they might be questioned more closely, but she would take that risk.\u003c/p\u003e\n\u003cp\u003eShe dumped the car in the rue de la Chapelle.\u003c/p\u003e\n\u003cp\u003eShe and Ruby were out of immediate danger.\u003c/p\u003e\n\u003cp\u003eThey walked quickly to the flophouse.\u003c/p\u003e\n\u003cp\u003eRuby rounded up Greta and Jelly and brought them to Flick\u0027s room.\u003c/p\u003e\n\u003cp\u003eShe told them what had happened.\u003c/p\u003e\n\u003cp\u003e\"Diana and Maude will be questioned immediately,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Dieter Franck is a capable and ruthless interrogator, so we have to assume they will tell everything they know-including the address of this hotel.\u003c/p\u003e\n\u003cp\u003eThat means the Gestapo could be here at any moment.\u003c/p\u003e\n\u003cp\u003eWe have to leave right away.\" Jelly was crying.\u003c/p\u003e\n\u003cp\u003e\"Poor Maude,\" she said.\u003c/p\u003e\n\u003cp\u003e\"She was a silly cow, but she didn\u0027t deserve to be tortured.\" Greta was more practical.\u003c/p\u003e\n\u003cp\u003e\"Where will we go?\" \"We\u0027ll hide in the convent next door to the flophouse.\u003c/p\u003e\n\u003cp\u003eThey\u0027ll take anyone in.\u003c/p\u003e\n\u003cp\u003eI\u0027ve hidden escaped prisoners of war there before now.\u003c/p\u003e\n\u003cp\u003eThey\u0027ll let us stay until daybreak.\" \"Then what?\" \"We\u0027ll go to the station as planned.\u003c/p\u003e\n\u003cp\u003eDiana is going to tell Dieter Franck our real names, our code names, and our false identities.\u003c/p\u003e\n\u003cp\u003eHe will put out an alert for anyone traveling under our aliases.\u003c/p\u003e\n\u003cp\u003eFortunately, I have a spare set of papers for all of us, using the same photographs but different identities.\u003c/p\u003e\n\u003cp\u003eThe Gestapo don\u0027t have photographs of you three, and I\u0027ve changed my appearance, so the checkpoint guards will have no way of recognizing us.\u003c/p\u003e\n\u003cp\u003eHowever, to be safe, we won\u0027t go to the station at first light-we\u0027ll wait until about ten o\u0027clock when it should be busy.\" Ruby said, \"Diana will also tell them what our mission is.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll tell them we\u0027re going to blow up the railway tunnel at Marles.\u003c/p\u003e\n\u003cp\u003eFortunately, that\u0027s not our real mission.\u003c/p\u003e\n\u003cp\u003eIt\u0027s a cover story I gave out.\" Jelly said admiringly, \"Flick, you think of everything.\" \"Yes,\" she said grimly.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why I\u0027m still alive.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-36.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
