{"id":68411,"no":40,"title":"Page 40","content":"\u003cp\u003eDIETER\u0027S CAR SUFFERED a puncture on the RN3 road between Paris and Meaux.\u003c/p\u003e\n\u003cp\u003eA bent nail was stuck in the tire.\u003c/p\u003e\n\u003cp\u003eThe delay irritated him, and he paced the roadside restlessly, but Lieutenant Hesse jacked up the car and changed the wheel with calm efficiency, and they were on their way again within a few minutes.\u003c/p\u003e\n\u003cp\u003eDieter had slept late, under the influence of the morphine injection Hans had given him in the early hours, and now he watched with impatience as the ugly industrial landscape east of Paris changed gradually to farming country.\u003c/p\u003e\n\u003cp\u003eHe wanted be in Reims.\u003c/p\u003e\n\u003cp\u003eHe had set a trap for Flick Clairet, and he needed to be there when she fell into it.\u003c/p\u003e\n\u003cp\u003eThe big Hispano-Suiza flew along an arrow-straight road lined with poplars-a road probably built by the Romans.\u003c/p\u003e\n\u003cp\u003eAt the start of the war, Dieter had thought the Third Reich would be like the Roman Empire, a pan-European hegemony that would bring unprecedented peace and prosperity to all its subjects.\u003c/p\u003e\n\u003cp\u003eNow he was not so sure.\u003c/p\u003e\n\u003cp\u003eHe worried about his mistress.\u003c/p\u003e\n\u003cp\u003eStephanie was in danger, and he was responsible.\u003c/p\u003e\n\u003cp\u003eEveryone\u0027s life was at risk now, he told himself Modern warfare put the entire population on the front line.\u003c/p\u003e\n\u003cp\u003eThe best way to protect Stephanie-and himself, and his family in Germany- was to defeat the invasion.\u003c/p\u003e\n\u003cp\u003eBut there were moments when he cursed himself for involving his lover so closely in his mission.\u003c/p\u003e\n\u003cp\u003eHe was playing a risky game and using her in an exposed position.\u003c/p\u003e\n\u003cp\u003eResistance fighters did not take prisoners.\u003c/p\u003e\n\u003cp\u003eBeing in constant peril themselves, they had no scruples about killing French people who collaborated with the enemy.\u003c/p\u003e\n\u003cp\u003eThe thought that Stephanie might be killed made his chest tighten and his breathing difficult.\u003c/p\u003e\n\u003cp\u003eHe could hardly contemplate life without her.\u003c/p\u003e\n\u003cp\u003eThe prospect seemed dismal, and he realized he must be in love with her.\u003c/p\u003e\n\u003cp\u003eHe had always told himself that she was just a beautiful courtesan, and he was using her the way men always used such women.\u003c/p\u003e\n\u003cp\u003eNow he saw that he had been fooling himself And he wished all the more that he was already in Reims at her side.\u003c/p\u003e\n\u003cp\u003eIt was Sunday afternoon, so there was little traffic on the road, and they made good progress.\u003c/p\u003e\n\u003cp\u003eThe second puncture occurred when they were less than an hour from Reims.\u003c/p\u003e\n\u003cp\u003eDieter wanted to scream with frustration.\u003c/p\u003e\n\u003cp\u003eIt was another bent nail.\u003c/p\u003e\n\u003cp\u003eWere wartime tires poor quality? he wondered.\u003c/p\u003e\n\u003cp\u003eOr did French people deliberately drop their old nails on the road, knowing that nine vehicles out of ten were driven by the occupying forces? The car did not have a second spare wheel, so the tire had to be mended before they could drive on.\u003c/p\u003e\n\u003cp\u003eThey left the car and walked.\u003c/p\u003e\n\u003cp\u003eAfter a mile or so they came to a farmhouse.\u003c/p\u003e\n\u003cp\u003eA large family was sitting around the remains of a substantial Sunday lunch: on the table were cheese and strawberries and several empty wine bottles.\u003c/p\u003e\n\u003cp\u003eCountry folk were the only French people who were well fed.\u003c/p\u003e\n\u003cp\u003eDieter bullied the farmer into hitching up his horse and cart and driving them to the next town.\u003c/p\u003e\n\u003cp\u003eIn the town square was a single gas pump on the pavement outside a wheelwright\u0027s shop with a Closed sign in the window.\u003c/p\u003e\n\u003cp\u003eThey banged on the door and woke a surly garagisre from his Sunday-afternoon nap.\u003c/p\u003e\n\u003cp\u003eThe mechanic fired up an ancient truck and drove off with Hans beside him.\u003c/p\u003e\n\u003cp\u003eDieter sat in the living room of the mechanic\u0027s house, stared at by three small children in ragged clothes.\u003c/p\u003e\n\u003cp\u003eThe mechanic\u0027s wife, a tired woman with dirty hair, bustled about in the kitchen but did not offer him so much as a glass of cold water.\u003c/p\u003e\n\u003cp\u003eDieter thought of Stephanie again.\u003c/p\u003e\n\u003cp\u003eThere was a phone in the hallway.\u003c/p\u003e\n\u003cp\u003eHe looked into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"May I make a call?\" he asked politely.\u003c/p\u003e\n\u003cp\u003e\"I will pay you, of course.\" She gave him a hostile glare.\u003c/p\u003e\n\u003cp\u003e\"Where to?\" \"Reims.\" She nodded and made a note of the time by the clock on the mantelpiece.\u003c/p\u003e\n\u003cp\u003eDieter got the operator and gave the number of the house in the rue du Bois.\u003c/p\u003e\n\u003cp\u003eIt was answered immediately by a low, gruff voice reciting the number in a provincial accent.\u003c/p\u003e\n\u003cp\u003eSuddenly alert, Dieter said in French, \"This is Pierre Charenton.\" The voice at the other end changed into Stephanie\u0027s, and she said, \"My darling.\" He realized she had answered the phone with her imitation of Mademoiselle Lemas, as a precaution.\u003c/p\u003e\n\u003cp\u003eHis heart gladdened with relief \"Is everything all right?\" he asked her.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve captured another enemy agent for you,\" she said coolly.\u003c/p\u003e\n\u003cp\u003eHis mouth went dry.\u003c/p\u003e\n\u003cp\u003e\"My God... well done! How did it happen?\" \"I picked him up in the cafee la Gare and brought him here.\" Dieter closed his eyes.\u003c/p\u003e\n\u003cp\u003eIf something had gone wrong-if she had done anything to make the agent suspect her-she could be dead by now.\u003c/p\u003e\n\u003cp\u003e\"And then?\" \"Your men tied him up.\" She had said him.\u003c/p\u003e\n\u003cp\u003eThat meant the terrorist was not flick.\u003c/p\u003e\n\u003cp\u003eDieter was disappointed.\u003c/p\u003e\n\u003cp\u003eAll the same, his strategy was working.\u003c/p\u003e\n\u003cp\u003eThis man was the second Allied agent to walk into the trap.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s he like?\" \"A young guy with a limp and half his ear shot off\" \"What have you done with him?\" \"He\u0027s here in the kitchen, on the floor.\u003c/p\u003e\n\u003cp\u003eI was about to call Sainte-Cdcile and have him picked up.\" \"Don\u0027t do that.\u003c/p\u003e\n\u003cp\u003eLock him in the cellar.\u003c/p\u003e\n\u003cp\u003eI want to talk to him before Weber does.\" \"Where are you?\" \"Some village.\u003c/p\u003e\n\u003cp\u003eWe have a damn puncture.\" \"Hurry back.\" \"I should be with you in an hour or two.\" \"Okay.\" \"How are you?\" \"Fine.\" Dieter wanted a serious answer.\u003c/p\u003e\n\u003cp\u003e\"But really, how do you feel?\" \"How do I feel?\" She paused.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a question you don\u0027t usually ask.\" Dieter hesitated.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t usually involve you in capturing terrorists.\" Her voice softened.\u003c/p\u003e\n\u003cp\u003e\"I feel fine.\u003c/p\u003e\n\u003cp\u003eDon\u0027t worry about me.\" He found himself saying something he had not planned.\u003c/p\u003e\n\u003cp\u003e\"What will we do after the war?\" There was a surprised silence at the other end of the line.\u003c/p\u003e\n\u003cp\u003eDieter said, \"Of course, the war could go on for ten years, but on the other hand it might be over in two weeks, and then what would we do?\" She recovered her composure somewhat, but there was an uncharacteristic tremor in her voice as she said, \"What would you like to do?\" \"I don\u0027t know,\" he said, but that left him dissatisfied, and after a moment he blurted out, \"I don\u0027t want to lose you.\"\u003c/p\u003e\n\u003cp\u003eHe waited for her to say something else.\u003c/p\u003e\n\u003cp\u003e\"What are you thinking?\" he said.\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003eThere was an odd sound at the other end, and he realized she was crying.\u003c/p\u003e\n\u003cp\u003eHe felt choked up himself He caught the eye of the mechanic\u0027s wife, still timing his phone call.\u003c/p\u003e\n\u003cp\u003eHe swallowed hard and turned away, not wanting a stranger to see that he was upset.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be with you soon,\" he said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll talk some more.\"\u003c/p\u003e\n\u003cp\u003e\"I love you,\" she said.\u003c/p\u003e\n\u003cp\u003eHe glanced at the mechanic\u0027s wife.\u003c/p\u003e\n\u003cp\u003eShe was staring at him.\u003c/p\u003e\n\u003cp\u003eTo hell with her, he thought.\u003c/p\u003e\n\u003cp\u003e\"I love you, too,\" he said.\u003c/p\u003e\n\u003cp\u003eThen he hung up the phone. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-40.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
