{"id":68413,"no":42,"title":"Page 42","content":"\u003cp\u003eIT WAS SIX o\u0027clock in the evening when Dieter parked outside the house in the rue du Bois.\u003c/p\u003e\n\u003cp\u003eHis sky- blue car was covered with dust and dead insects after the long journey.\u003c/p\u003e\n\u003cp\u003eAs he got out, the evening sun slipped behind a cloud, and the suburban street was thrown into shadow.\u003c/p\u003e\n\u003cp\u003eHe shivered.\u003c/p\u003e\n\u003cp\u003eHe took off his motoring goggles-he had been driving with the top down-and ran his fingers through his hair to flatten it.\u003c/p\u003e\n\u003cp\u003e\"Wait for me here, please, Hans,\" he said.\u003c/p\u003e\n\u003cp\u003eHe wanted to be alone with Stephanie.\u003c/p\u003e\n\u003cp\u003eOpening the gate and entering the front garden, he noticed that Mademoiselle Lemas\u0027s Simca Cinq was gone.\u003c/p\u003e\n\u003cp\u003eThe garage door was open and the garage was empty.\u003c/p\u003e\n\u003cp\u003eWas Stephanie using the car? But where would she have gone? She should be waiting here for him, guarded by two Gestapo men.\u003c/p\u003e\n\u003cp\u003eHe strode up the garden path and pulled the bell rope.\u003c/p\u003e\n\u003cp\u003eThe ring of the bell died away, leaving the house strangely silent.\u003c/p\u003e\n\u003cp\u003eHe looked through the window into the front parlor, but that room was always empty.\u003c/p\u003e\n\u003cp\u003eHe rang again.\u003c/p\u003e\n\u003cp\u003eThere was no response.\u003c/p\u003e\n\u003cp\u003eHe bent down to look through the letter box, but he could not see much: part of the staircase, a painting of a Swiss mountain scene, and the door to the kitchen, half open.\u003c/p\u003e\n\u003cp\u003eThere was no movement.\u003c/p\u003e\n\u003cp\u003eHe glanced at the house next door and saw a face hastily withdraw from a window, and a curtain fall back into place.\u003c/p\u003e\n\u003cp\u003eHe walked around the side of the house and through the courtyard to the rear garden.\u003c/p\u003e\n\u003cp\u003eTwo windows were broken and the back door stood open.\u003c/p\u003e\n\u003cp\u003eFear grew in his heart.\u003c/p\u003e\n\u003cp\u003eWhat had happened here? \"Stephanie?\" he called.\u003c/p\u003e\n\u003cp\u003eThere was no answer.\u003c/p\u003e\n\u003cp\u003eHe stepped into the kitchen.\u003c/p\u003e\n\u003cp\u003eAt first he did not understand what he was looking at.\u003c/p\u003e\n\u003cp\u003eA bundle was tied to a kitchen chair with ordinary household string.\u003c/p\u003e\n\u003cp\u003eIt looked like a woman\u0027s body with a disgusting mess on top.\u003c/p\u003e\n\u003cp\u003eAfter a moment, his police experience told him that the disgusting thing was a human head that had been shot.\u003c/p\u003e\n\u003cp\u003eThen he saw that the dead woman was wearing odd shoes, one black and one brown, and he understood she was Stephanie.\u003c/p\u003e\n\u003cp\u003eHe let out a howl of anguish, covered his eyes with his hands, and sank slowly to his knees, sobbing.\u003c/p\u003e\n\u003cp\u003eAfter a minute, he dragged his hands from his eyes and forced himself to look again.\u003c/p\u003e\n\u003cp\u003eThe detective in him noted the blood on the skirt of her dress and concluded that she had been shot from behind.\u003c/p\u003e\n\u003cp\u003ePerhaps that was merciful; she might not have suffered the terror of knowing she was about to die.\u003c/p\u003e\n\u003cp\u003eThere had been two shots, he thought.\u003c/p\u003e\n\u003cp\u003eIt was the large exit wounds that had made her lovely face look so dreadful, destroying her eyes and nose, leaving her sensual lips bloodstained but intact.\u003c/p\u003e\n\u003cp\u003eHad it not been for the shoes, he would not have known her.\u003c/p\u003e\n\u003cp\u003eHis eyes filled with tears until she became a blur.\u003c/p\u003e\n\u003cp\u003eThe sense of loss was like a wound.\u003c/p\u003e\n\u003cp\u003eHe had never known a shock like this sudden knowledge that she was gone.\u003c/p\u003e\n\u003cp\u003eShe would not throw him that proud glance again; she would no longer turn heads walking through restaurants; he would never again see her pull silk stockings over her perfect calves.\u003c/p\u003e\n\u003cp\u003eHer style and her wit, her fears and her desires, were all canceled, wiped out, ended.\u003c/p\u003e\n\u003cp\u003eHe felt as if he had been shot, and had lost part of himself.\u003c/p\u003e\n\u003cp\u003eHe whispered her name: at least he had that.\u003c/p\u003e\n\u003cp\u003eThen he heard a voice behind him.\u003c/p\u003e\n\u003cp\u003eHe cried out, startled.\u003c/p\u003e\n\u003cp\u003eIt came again: a wordless grunt, but human.\u003c/p\u003e\n\u003cp\u003eHe leaped to his feet, turning around and wiping the moisture from his eyes.\u003c/p\u003e\n\u003cp\u003eFor the first time he noticed two men on the floor.\u003c/p\u003e\n\u003cp\u003eBoth wore uniforms.\u003c/p\u003e\n\u003cp\u003eThey were Stephanie\u0027s Gestapo bodyguards.\u003c/p\u003e\n\u003cp\u003eThey had failed to protect her, but at least they had given their lives trying.\u003c/p\u003e\n\u003cp\u003eOr one of them had.\u003c/p\u003e\n\u003cp\u003eOne lay still, but the other was trying to speak.\u003c/p\u003e\n\u003cp\u003eHe was a young chap, nineteen or twenty, with black hair and a small mustache.\u003c/p\u003e\n\u003cp\u003eHis uniform cap lay on the linoleum floor beside his head.\u003c/p\u003e\n\u003cp\u003eDieter stepped across the room and knelt beside him.\u003c/p\u003e\n\u003cp\u003eHe noted exit wounds in the chest: the man had been shot from behind.\u003c/p\u003e\n\u003cp\u003eHe was lying in a pool of blood.\u003c/p\u003e\n\u003cp\u003eHis head jerked and his lips were moving.\u003c/p\u003e\n\u003cp\u003eDieter put his ear to the man\u0027s mouth.\u003c/p\u003e\n\u003cp\u003e\"Water,\" the man whispered.\u003c/p\u003e\n\u003cp\u003eHe was bleeding to death.\u003c/p\u003e\n\u003cp\u003eThey always asked for water near the end, Dieter knew-he had seen it in the desert.\u003c/p\u003e\n\u003cp\u003eHe found a cup, filled it at the tap, and held it to the man\u0027s lips.\u003c/p\u003e\n\u003cp\u003eHe drank it all, the water dribbling down his chin onto his blood-soaked tunic.\u003c/p\u003e\n\u003cp\u003eDieter knew he should phone for a doctor, but he had to find out what had happened here.\u003c/p\u003e\n\u003cp\u003eIf he delayed, the man might expire without telling what he knew.\u003c/p\u003e\n\u003cp\u003eDieter hesitated only a moment over the decision.\u003c/p\u003e\n\u003cp\u003eThe man was dispensable.\u003c/p\u003e\n\u003cp\u003eDieter would question him first, then call the doctor.\u003c/p\u003e\n\u003cp\u003e\"Who was it?\" he said, and he bent his head again to hear the dying man\u0027s whispers.\u003c/p\u003e\n\u003cp\u003e\"Four women,\" the man said hoarsely.\u003c/p\u003e\n\u003cp\u003e\"The Jackdaws,\" Dieter said bitterly.\u003c/p\u003e\n\u003cp\u003e\"Two at the front... two at the back.\" Dieter nodded.\u003c/p\u003e\n\u003cp\u003eHe could visualize the course of events.\u003c/p\u003e\n\u003cp\u003eStephanie had gone to the front door to answer the knock.\u003c/p\u003e\n\u003cp\u003eThe Gestapo men had stood ready, looking toward the hail.\u003c/p\u003e\n\u003cp\u003eThe terrorists had sneaked up to the kitchen windows and shot them from behind.\u003c/p\u003e\n\u003cp\u003eAnd then...\u003c/p\u003e\n\u003cp\u003e\"Who killed Stephanie?\" \"Water.. Dieter controlled his sense of urgency with an effort of will.\u003c/p\u003e\n\u003cp\u003eHe went to the sink, refilled the cup, and put it to the man\u0027s mouth again.\u003c/p\u003e\n\u003cp\u003eOnce again he drank it all, and sighed with relief, a sigh that turned into a dreadful groan.\u003c/p\u003e\n\u003cp\u003e\"Who killed Stephanie?\" Dieter repeated.\u003c/p\u003e\n\u003cp\u003e\"The small one,\" said the Gestapo man.\u003c/p\u003e\n\u003cp\u003e\"Flick,\" said Dieter, and his heart filled with a raging desire for revenge.\u003c/p\u003e\n\u003cp\u003eThe man whispered: \"I\u0027m sorry, Major..\"How did it happen?\"\u003c/p\u003e\n\u003cp\u003e\"Quick. .. it was very quick.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me.\"\u003c/p\u003e\n\u003cp\u003e\"They tied her up ...said she was a traitor...gun to the back of the head...then they went away.\"\u003c/p\u003e\n\u003cp\u003e\"Traitor?\" Dieter said.\u003c/p\u003e\n\u003cp\u003eThe man nodded.\u003c/p\u003e\n\u003cp\u003eDieter choked back a sob.\u003c/p\u003e\n\u003cp\u003e\"She never shot anyone in the back of the head,\" he said in a grief-stricken whisper.\u003c/p\u003e\n\u003cp\u003eThe Gestapo man did not hear him.\u003c/p\u003e\n\u003cp\u003eHis lips were still and his breathing had stopped.\u003c/p\u003e\n\u003cp\u003eDieter reached out with his right hand and closed the man\u0027s eyelids gently with his fingertips.\u003c/p\u003e\n\u003cp\u003e\"Rest in peace,\" he said.\u003c/p\u003e\n\u003cp\u003eThen, keeping his back to the body of the woman he loved, he went to the phone. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-42.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
