{"id":68416,"no":45,"title":"Page 45","content":"\u003cp\u003eUNTIL THE MOMENT when Michel walked in, Flick was feeling pessimistic.\u003c/p\u003e\n\u003cp\u003eShe sat at the bar in the little makeshift casino, making desultory conversation with Yvette, indifferently watching the intent faces of the men as they concentrated on their cards, their dice, and the spinning roulette wheel.\u003c/p\u003e\n\u003cp\u003eNo one took much notice of her: they were serious gamblers, not to be distracted by a pretty face.\u003c/p\u003e\n\u003cp\u003eIf she did not find Michel, she was in trouble.\u003c/p\u003e\n\u003cp\u003eThe other Jackdaws were in the cathedral, but they could not stay there all night.\u003c/p\u003e\n\u003cp\u003eThey could sleep in the open- they would survive the weather, in June-but they could so easily be caught.\u003c/p\u003e\n\u003cp\u003eThey also needed transport.\u003c/p\u003e\n\u003cp\u003eIf they could not get a car or van from the Bollinger circuit, they would have to steal one.\u003c/p\u003e\n\u003cp\u003eBut then they would be forced to carry out the mission using a vehicle for which the police were searching.\u003c/p\u003e\n\u003cp\u003eIt added more dangers to an already perilous enterprise.\u003c/p\u003e\n\u003cp\u003eThere was another reason for her gloom: the image of Stephanie Vinson kept coming back to her.\u003c/p\u003e\n\u003cp\u003eIt was the first time Flick had killed a bound, helpless captive, and the first time she had shot a woman.\u003c/p\u003e\n\u003cp\u003eAny killing disturbed her profoundly.\u003c/p\u003e\n\u003cp\u003eThe Gestapo man she had shot a few minutes before Stephanie had been a combatant with a gun in his hand, but still it seemed dreadful to her that she had brought his life to an end.\u003c/p\u003e\n\u003cp\u003eSo it had been with the other men she had killed: two Milice cops in Paris, a Gestapo colonel in Lille, and a French traitor in Rouen.\u003c/p\u003e\n\u003cp\u003eBut Stephanie was worse.\u003c/p\u003e\n\u003cp\u003eFlick had put a gun to the back of her head and executed her.\u003c/p\u003e\n\u003cp\u003eIt was exactly how she had taught trainees to do it in the SOE course.\u003c/p\u003e\n\u003cp\u003eStephanie had deserved it, of course-Flick had no doubt about that.\u003c/p\u003e\n\u003cp\u003eBut she wondered about herself.\u003c/p\u003e\n\u003cp\u003eWhat kind of person was capable of the cold-blooded killing of a helpless prisoner? Had she become some kind of brutish executioner? She drained her whisky but declined a refill for fear of becoming maudlin.\u003c/p\u003e\n\u003cp\u003eThen Michel came through the door.\u003c/p\u003e\n\u003cp\u003eOverwhelming relief flooded her.\u003c/p\u003e\n\u003cp\u003eMichel knew everyone in town.\u003c/p\u003e\n\u003cp\u003eHe would be able to help her.\u003c/p\u003e\n\u003cp\u003eSuddenly the mission seemed possible again.\u003c/p\u003e\n\u003cp\u003eShe felt a wry affection as she took in the lanky figure in a rumpled jacket, the handsome face with the smiling eyes.\u003c/p\u003e\n\u003cp\u003eShe would always be fond of him, she imagined.\u003c/p\u003e\n\u003cp\u003eShe suffered a painful stab of regret as she thought of the passionate love she had once had for him.\u003c/p\u003e\n\u003cp\u003eThat would never come back, she was sure.\u003c/p\u003e\n\u003cp\u003eAs he came closer, she saw that he was not looking so good.\u003c/p\u003e\n\u003cp\u003eHis face seemed to have new lines.\u003c/p\u003e\n\u003cp\u003eHer heart filled with compassion for him.\u003c/p\u003e\n\u003cp\u003eExhaustion and fear showed in his expression, and he might have been fifty rather than thirty-five, she thought anxiously.\u003c/p\u003e\n\u003cp\u003eBut her greatest anxiety came from the thought of telling him that their marriage was over.\u003c/p\u003e\n\u003cp\u003eShe was afraid.\u003c/p\u003e\n\u003cp\u003eIt struck her as ironic: she had just shot and killed a Gestapo man and a French traitress, and she was undercover in occupied territory, yet her worst fear was of hurting her husband\u0027s feelings.\u003c/p\u003e\n\u003cp\u003eHe was visibly delighted to see her.\u003c/p\u003e\n\u003cp\u003e\"Flick!\" he cried.\u003c/p\u003e\n\u003cp\u003e\"I knew you would get here!\" He crossed the room to her, still limping from his bullet wound.\u003c/p\u003e\n\u003cp\u003eShe said quietly, \"I was afraid the Gestapo had captured you.\" \"They did!\" He turned so that his back was to the room and no one could see, and showed her his hands, bound at the wrists with stout rope.\u003c/p\u003e\n\u003cp\u003eShe drew the little knife from its sheath under her lapel and discreetly cut through his bonds.\u003c/p\u003e\n\u003cp\u003eThe gamblers saw nothing.\u003c/p\u003e\n\u003cp\u003eShe put the knife away.\u003c/p\u003e\n\u003cp\u003eMeme Regis spotted him just as he was stuffing the ropes into his trousers pockets.\u003c/p\u003e\n\u003cp\u003eShe embraced and kissed him on both cheeks.\u003c/p\u003e\n\u003cp\u003eFlick watched him flirt with the older woman, talking to her in his come-to-bed voice, giving her the benefit of his sexy grin.\u003c/p\u003e\n\u003cp\u003eThen Meme resumed her work, serving drinks to the gamblers, and Michel told Flick how he had escaped.\u003c/p\u003e\n\u003cp\u003eShe had been afraid he would want to kiss her passionately, and she had not known how she would deal with that but, in the event, he was too full of his own adventures to get romantic with her.\u003c/p\u003e\n\u003cp\u003e\"I was so lucky!\" he finished.\u003c/p\u003e\n\u003cp\u003eHe sat on a bar stool, rubbing his wrists, and asked for a beer.\u003c/p\u003e\n\u003cp\u003eFlick nodded.\u003c/p\u003e\n\u003cp\u003e\"Too lucky, perhaps,\" she said.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" \"It could be some kind of trick.\" He was indignant, no doubt resenting the implication that he was gullible.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\" \"Could you have been followed here?\" \"No,\" he said firmly.\u003c/p\u003e\n\u003cp\u003e\"I checked, of course.\" She was uneasy, but she let it go.\u003c/p\u003e\n\u003cp\u003e\"So Brian Standish is dead, and three others are in custody-Mademoiselle Lemas, Gilberte, and Dr. Bouler.\" \"The rest are dead.\u003c/p\u003e\n\u003cp\u003eThe Germans released the bodies of those killed in the skirmish.\u003c/p\u003e\n\u003cp\u003eAnd the survivors, Gaston, Genevieve, and Bertrand, were shot by a firing squad in the square at Sainte-Cdcile.\" \"Dear God.\" They were silent for a moment.\u003c/p\u003e\n\u003cp\u003eFlick was weighed down by the thought of the lives lost, and the suffering endured, for the sake of this mission.\u003c/p\u003e\n\u003cp\u003eMichel\u0027s beer came.\u003c/p\u003e\n\u003cp\u003eHe drank half in a single draft and wiped his lips.\u003c/p\u003e\n\u003cp\u003e\"I presume you\u0027ve come back for another attempt on the chateau.\" She nodded.\u003c/p\u003e\n\u003cp\u003e\"But the cover story is that we\u0027re going to blow up the railway tunnel at Manes.\" \"It\u0027s a good idea, we should do it anyway.\" \"Not now.\u003c/p\u003e\n\u003cp\u003eTwo of my team were taken in Paris, and they must have talked.\u003c/p\u003e\n\u003cp\u003eThey will have told the cover story-they had no idea of the real mission-and the Germans are sure to have doubled the guard on the railway tunnel.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll leave that to the RAF and concentrate on Sainte-Cecile.\" \"What can I do?\" \"We need somewhere to stay the night.\" He thought for a moment.\u003c/p\u003e\n\u003cp\u003e\"Joseph Laperriere\u0027s cellar.\" Laperriere was a champagne maker.\u003c/p\u003e\n\u003cp\u003eMichel\u0027s aunt Antoinette had once been his secretary.\u003c/p\u003e\n\u003cp\u003e\"Is he one of us?\" \"A sympathizer.\" He gave a sour grin.\u003c/p\u003e\n\u003cp\u003e\"Everyone is a sympathizer now.\u003c/p\u003e\n\u003cp\u003eThey all think the invasion is coming any day.\" He looked inquiringly at her.\u003c/p\u003e\n\u003cp\u003e\"I imagine they\u0027re right about that.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said.\u003c/p\u003e\n\u003cp\u003eShe did not elaborate.\u003c/p\u003e\n\u003cp\u003e\"How big is the cellar? There are five of us.\" \"It\u0027s big, he could hide fifty people down there.\" \"Fine.\u003c/p\u003e\n\u003cp\u003eThe other thing I need is a vehicle for tomorrow.\" \"To drive to Sainte-Cecile?\" \"And afterwards, to meet our pickup plane, if we\u0027re still alive.\" \"You realize that you can\u0027t use the usual drop zone at Chatelle, don\u0027t you? The Gestapo know about it-it\u0027s where I was picked up.\" \"Yes.\u003c/p\u003e\n\u003cp\u003eThe plane is coming to the other one at Laroque.\u003c/p\u003e\n\u003cp\u003eI gave instructions.\" \"The potato field.\u003c/p\u003e\n\u003cp\u003eGood.\" \"And the vehicle?\" \"Philippe Moulierhas a van.\u003c/p\u003e\n\u003cp\u003eHe delivers meat to all the German bases.\u003c/p\u003e\n\u003cp\u003eMonday is his day off.\" \"I remember him, he\u0027s pro-Nazi.\" \"He was.\u003c/p\u003e\n\u003cp\u003eAnd he\u0027s been making money out of them for four years.\u003c/p\u003e\n\u003cp\u003eSo now he\u0027s terrified that the invasion is going to succeed, and after the Germans have gone he\u0027ll be strung up as a collaborator.\u003c/p\u003e\n\u003cp\u003eHe\u0027s desperate to do something to help us, to prove he\u0027s not a traitor.\u003c/p\u003e\n\u003cp\u003eHe\u0027ll lend us his van.\" \"Bring it to the cellar tomorrow at ten o\u0027clock in the morning.\" He touched her cheek.\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t we spend the night together?\" He smiled his old smile and looked as roguishly handsome as ever.\u003c/p\u003e\n\u003cp\u003eShe felt a familiar stirring inside, but it was not as strong as it had been in the old days.\u003c/p\u003e\n\u003cp\u003eOnce, that smile would have made her wet.\u003c/p\u003e\n\u003cp\u003eNow, it was like the memory of a desire.\u003c/p\u003e\n\u003cp\u003eShe wanted to tell him the truth, for she hated to be anything less than honest.\u003c/p\u003e\n\u003cp\u003eBut it might jeopardize the mission.\u003c/p\u003e\n\u003cp\u003eShe needed his cooperation.\u003c/p\u003e\n\u003cp\u003eOr was that just an excuse? Perhaps she just did not have the nerve.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t spend the night together.\" He looked crestfallen.\u003c/p\u003e\n\u003cp\u003e\"Is it because of Gilberte?\" She nodded, but she could not lie, and she found herself saying, \"Well, partly.\" \"What\u0027s the other part?\" \"I don\u0027t really want to have this discussion in the middle of an important mission.\" He looked vulnerable, almost scared.\u003c/p\u003e\n\u003cp\u003e\"Have you got someone else?\" She could not bring herself to hurt him.\u003c/p\u003e\n\u003cp\u003e\"No,\" she lied.\u003c/p\u003e\n\u003cp\u003eHe looked hard at her.\u003c/p\u003e\n\u003cp\u003e\"Good,\" he said at last.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad.\" Flick hated herself.\u003c/p\u003e\n\u003cp\u003eMichel finished his beer and got off his stool.\u003c/p\u003e\n\u003cp\u003e\"Laperriere\u0027s place is in the chemin de La Carrire.\u003c/p\u003e\n\u003cp\u003eIt will take you thirty minutes to walk there.\" \"I know the street.\" \"I\u0027d better go and see Moulier about the van.\" He put his arms around Flick and kissed her lips.\u003c/p\u003e\n\u003cp\u003eShe felt dreadful.\u003c/p\u003e\n\u003cp\u003eShe could hardly refuse the kiss, having denied that she had someone else, but kissing Michel seemed so disloyal to Paul.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and waited passively until he broke the clinch.\u003c/p\u003e\n\u003cp\u003eHe could not fail to notice her lack of enthusiasm.\u003c/p\u003e\n\u003cp\u003eHe looked thoughtfully at her for a moment.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see you at ten,\" he said, and he left.\u003c/p\u003e\n\u003cp\u003eShe decided to give him five minutes to get clear be- fore she followed him out.\u003c/p\u003e\n\u003cp\u003eShe asked Yvette for another scotch.\u003c/p\u003e\n\u003cp\u003eWhile she was sipping it, a red light began to flash over the door.\u003c/p\u003e\n\u003cp\u003eNo one spoke, but everyone in the room moved at once.\u003c/p\u003e\n\u003cp\u003eThe croupier stopped the roulette wheel and turned it upside down so that it looked like a normal tabletop.\u003c/p\u003e\n\u003cp\u003eThe card players swept up their stakes and put on their jackets.\u003c/p\u003e\n\u003cp\u003eYvette picked up the glasses from the bar and dumped them in the sink.\u003c/p\u003e\n\u003cp\u003eMeme Regis turned out the lights, leaving the room illuminated only by the flashing red bulb over the door.\u003c/p\u003e\n\u003cp\u003eFlick picked up her bag from the floor and put her hand on her gun.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening?\" she asked Yvette.\u003c/p\u003e\n\u003cp\u003e\"Police raid,\" she said.\u003c/p\u003e\n\u003cp\u003eFlick cursed.\u003c/p\u003e\n\u003cp\u003eWhat hellish luck it would be to get arrested for illegal gambling.\u003c/p\u003e\n\u003cp\u003e\"Alexandre downstairs has given us the warning,\" Yvette explained.\u003c/p\u003e\n\u003cp\u003e\"Get going, quickly!\" She pointed across the room.\u003c/p\u003e\n\u003cp\u003eFlick looked in the direction Yvette indicated and saw Meme Regis stepping into what looked like a cupboard.\u003c/p\u003e\n\u003cp\u003eAs she watched, Meme shoved aside a couple of old coats hanging from a rail to reveal, at the back of the cupboard, a door, which she hurriedly opened.\u003c/p\u003e\n\u003cp\u003eThe gamblers began to leave by the hidden door.\u003c/p\u003e\n\u003cp\u003eMaybe, Flick thought, she could get away.\u003c/p\u003e\n\u003cp\u003eThe flashing red light went out, and a banging began on the main door.\u003c/p\u003e\n\u003cp\u003eFlick crossed the room in the dark and joined the men pushing through the cupboard.\u003c/p\u003e\n\u003cp\u003eShe followed the crowd into a bare room.\u003c/p\u003e\n\u003cp\u003eThe floor was about a foot lower than she expected, and she guessed this was the apartment over the shop next door.\u003c/p\u003e\n\u003cp\u003eThey all ran down the stairs and, sure enough, she found herself in the disused charcuterie, with a stained marble counter and dusty glass cases.\u003c/p\u003e\n\u003cp\u003eThe blind in the front window was drawn down so that no one could see in from the street.\u003c/p\u003e\n\u003cp\u003eThey all went out through the back door.\u003c/p\u003e\n\u003cp\u003eThere was a dirty yard surrounded by a high wall.\u003c/p\u003e\n\u003cp\u003eA door in the wall led to an alley, and the alley led to the next street.\u003c/p\u003e\n\u003cp\u003eWhen they reached the street, the men went in different directions.\u003c/p\u003e\n\u003cp\u003eFlick walked quickly away and soon found herself alone.\u003c/p\u003e\n\u003cp\u003eBreathing hard, she reoriented herself and headed for the cathedral, where the other Jackdaws were waiting.\u003c/p\u003e\n\u003cp\u003e\"My God,\" she whispered to herself, \"that was close.\" As she got her breath back, she began to see the raid on the gambling club in a different light.\u003c/p\u003e\n\u003cp\u003eIt had happened just minutes after Michel had left.\u003c/p\u003e\n\u003cp\u003eFlick did not believe in coincidence.\u003c/p\u003e\n\u003cp\u003eThe more she thought about it, the more convinced she became that whoever was banging on the door had been looking for her.\u003c/p\u003e\n\u003cp\u003eShe knew that a small group of men had been playing for high stakes in that room since before the war.\u003c/p\u003e\n\u003cp\u003eThe local police certainly knew about the place.\u003c/p\u003e\n\u003cp\u003eWhy would they suddenly decide to close it down? If not the police, it must have been the Gestapo.\u003c/p\u003e\n\u003cp\u003eAnd they were not really interested in gamblers.\u003c/p\u003e\n\u003cp\u003eThey went after communists, Jews, homosexuals-and spies.\u003c/p\u003e\n\u003cp\u003eThe story of Michel\u0027s escape had aroused her suspicions from the start, but she had been partly reassured by his insistence that he had not been followed.\u003c/p\u003e\n\u003cp\u003eNow she thought otherwise.\u003c/p\u003e\n\u003cp\u003eHis escape must have been faked, like the \"rescue\" of Brian Standish.\u003c/p\u003e\n\u003cp\u003eShe saw the sly brain of Dieter Franck behind this.\u003c/p\u003e\n\u003cp\u003eSomeone had followed Michel to the cafeguessed at the existence of the secret upstairs room, and hoped to find her there.\u003c/p\u003e\n\u003cp\u003eIn that case, Michel was still under surveillance.\u003c/p\u003e\n\u003cp\u003eIf he continued to be careless, he would be trailed to Philippe\u003c/p\u003e\n\u003cp\u003eMoulier\u0027s house tonight, and in the morning, driving the van, he would be followed to the champagne cellar where the Jackdaws were hiding.\u003c/p\u003e\n\u003cp\u003eAnd what the hell, Flick thought, am I going to do about that?\u003c/p\u003e\n\u003cp\u003eTHE NINTH DAY Monday, June 5,1944 \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-45.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
