{"id":68422,"no":51,"title":"Page 51","content":"\u003cp\u003eFLICK PAUSED AT the entrance to the great hall of the chateau.\u003c/p\u003e\n\u003cp\u003eHer pulse was racing and there was a cold sensation of fear in her chest.\u003c/p\u003e\n\u003cp\u003eShe was in the lions\u0027 den.\u003c/p\u003e\n\u003cp\u003eIf she were captured, nothing could save her.\u003c/p\u003e\n\u003cp\u003eShe surveyed the room rapidly.\u003c/p\u003e\n\u003cp\u003eTelephone switchboards had been installed in precise parade-ground rows, incongruously modern against the faded grandeur of the pink-and-green walls and the pudgy cherubs painted on the ceiling.\u003c/p\u003e\n\u003cp\u003eBundled cables twisted across the checkerboard marble floor like uncoiled ropes on the deck of a ship.\u003c/p\u003e\n\u003cp\u003eThere was a hubbub of chatter from forty operators.\u003c/p\u003e\n\u003cp\u003eThose nearest glanced at the new arrivals.\u003c/p\u003e\n\u003cp\u003eFlick saw one girl speak to her neighbor and point to them.\u003c/p\u003e\n\u003cp\u003eThe operators were all from Reims and the surrounding district, many from Sainte-Cecile itself~ so they would know the regular cleaners and would realize the Jackdaws were strangers.\u003c/p\u003e\n\u003cp\u003eBut Flick was gambling that they would say nothing to the Germans.\u003c/p\u003e\n\u003cp\u003eShe oriented herself quickly, bringing to mind the plan Antoinette had drawn.\u003c/p\u003e\n\u003cp\u003eThe bombed west wing, to her left, was disused.\u003c/p\u003e\n\u003cp\u003eShe turned right and led Greta and Jelly through a pair of tall paneled doors into the east wing.\u003c/p\u003e\n\u003cp\u003eOne room led to another, all palatial reception rooms full of switchboards and equipment racks that buzzed and clicked as numbers were dialed.\u003c/p\u003e\n\u003cp\u003eFlick did not know whether the cleaners normally greeted the operators or passed them in silence: the French were great people for saying good morning, but this place was run by the German military.\u003c/p\u003e\n\u003cp\u003eShe contented herself with smiling vaguely and avoiding eye contact.\u003c/p\u003e\n\u003cp\u003eIn the third room, a supervisor in German uniform sat at a desk.\u003c/p\u003e\n\u003cp\u003eFlick ignored her, but the woman called out, \"Where is Antoinette?\" Flick answered without pausing in her stride.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s coming.\" She heard the tremor of fear in her own voice and hoped the supervisor had not noticed.\u003c/p\u003e\n\u003cp\u003eThe woman glanced up at the clock, which said five past seven.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re late.\" \"Very sorry, Madame, we\u0027ll get started right away.\" Flick hurried into the next room.\u003c/p\u003e\n\u003cp\u003eFor a moment she listened, heart in her mouth, for an angry shout calling her back, but none came, and she breathed easier and walked on, with Greta and Jelly close behind.\u003c/p\u003e\n\u003cp\u003eAt the end of the east wing was a stairwell, leading up to the offices or down to the basement.\u003c/p\u003e\n\u003cp\u003eThe Jackdaws were headed for the basement, eventually, but first they had preparations to make.\u003c/p\u003e\n\u003cp\u003eThey turned left and moved into the service wing.\u003c/p\u003e\n\u003cp\u003eFollowing Antoinette\u0027s directions, they found a small room where cleaning materials were stored: mops, buckets, brooms, and garbage bins, plus the brown cotton overall coats the cleaners had to wear on duty Flick closed the door.\u003c/p\u003e\n\u003cp\u003e\"So far, so good,\" said Jelly.\u003c/p\u003e\n\u003cp\u003eGreta said, \"I\u0027m so scared!\" She was pale and trembling.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I can go on.\" Flick gave her a reassuring smile.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be fine,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get on with it.\u003c/p\u003e\n\u003cp\u003ePut your ordnance into these cleaning buckets.\" Jelly began to transfer her explosives into a bucket, and after a moment\u0027s hesitation Greta followed suit.\u003c/p\u003e\n\u003cp\u003eFlick assembled her submachine gun without its rifle butt, reducing the length by a foot, to make it easier to conceal.\u003c/p\u003e\n\u003cp\u003eShe fitted the noise suppressor and flicked the switch for single-shot firing.\u003c/p\u003e\n\u003cp\u003eWhen using the silencer, the chamber had to be reloaded manually before each shot.\u003c/p\u003e\n\u003cp\u003eShe pushed the weapon under her leather belt.\u003c/p\u003e\n\u003cp\u003eThen she put on an overall coat.\u003c/p\u003e\n\u003cp\u003eIt covered the gun.\u003c/p\u003e\n\u003cp\u003eShe left the buttons undone for quick access.\u003c/p\u003e\n\u003cp\u003eThe other two also put on overalls, concealing the guns and ammunition stuffed into their pockets.\u003c/p\u003e\n\u003cp\u003eThey were almost ready for the basement.\u003c/p\u003e\n\u003cp\u003eHowever, it was a high-security area, with a guard at the door, and French personnel were not allowed down there-the Germans cleaned it themselves.\u003c/p\u003e\n\u003cp\u003eBefore entering, the Jackdaws were going to create a little confusion.\u003c/p\u003e\n\u003cp\u003eThey were about to leave the room when the door opened and a German officer looked in.\u003c/p\u003e\n\u003cp\u003e\"Passes!\" he barked.\u003c/p\u003e\n\u003cp\u003eFlick tensed.\u003c/p\u003e\n\u003cp\u003eShe had been expecting some kind of security alert.\u003c/p\u003e\n\u003cp\u003eThe Gestapo must have guessed that Ruby was an Allied agent-no one else would be carrying an automatic pistol and a lethal knife-and it made sense for them to take extra precautions at the chateau.\u003c/p\u003e\n\u003cp\u003eHowever, she had hoped that the Gestapo would move too slowly to interfere with her mission.\u003c/p\u003e\n\u003cp\u003eThat wish had not been granted.\u003c/p\u003e\n\u003cp\u003eProbably they were double-checking all French personnel in the building.\u003c/p\u003e\n\u003cp\u003e\"Quickly!\" the man said impatiently.\u003c/p\u003e\n\u003cp\u003eHe was a Gestapo lieutenant, Flick saw from the badge on his uniform shirt.\u003c/p\u003e\n\u003cp\u003eShe took out her pass.\u003c/p\u003e\n\u003cp\u003eHe looked at it carefully, comparing the picture with her face, and handed it back.\u003c/p\u003e\n\u003cp\u003eHe did the same with Jelly and Greta.\u003c/p\u003e\n\u003cp\u003e\"I must search you,\" he said.\u003c/p\u003e\n\u003cp\u003eHe looked into Jelly\u0027s bucket.\u003c/p\u003e\n\u003cp\u003eBehind his back, Flick drew the Sten gun from under her overall.\u003c/p\u003e\n\u003cp\u003eThe officer frowned in puzzlement and took from Jelly\u0027s bucket the shockproof canister.\u003c/p\u003e\n\u003cp\u003eFlick disengaged the cocking lever of her gun from the safety slot.\u003c/p\u003e\n\u003cp\u003eThe officer unscrewed the lid of the canister.\u003c/p\u003e\n\u003cp\u003eAmazement dawned on his face as he saw the detonators.\u003c/p\u003e\n\u003cp\u003eFlick shot him in the back.\u003c/p\u003e\n\u003cp\u003eThe gun was not really silent-the noise suppressor was not perfectly effective-and the shot made a soft bang like a book being dropped on the floor.\u003c/p\u003e\n\u003cp\u003eThe Gestapo lieutenant jerked and fell.\u003c/p\u003e\n\u003cp\u003eFlick ejected the cartridge and pulled back the bolt, then shot him again in the head to make sure of him.\u003c/p\u003e\n\u003cp\u003eShe reloaded the chamber and put the gun back under her overall.\u003c/p\u003e\n\u003cp\u003eJelly dragged the body to the wall and shoved it behind the door, where it would not be seen by anyone glancing casually into the room.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get out of here,\" said Flick.\u003c/p\u003e\n\u003cp\u003eJelly went out.\u003c/p\u003e\n\u003cp\u003eGreta stood frozen and pale, staring at the dead officer.\u003c/p\u003e\n\u003cp\u003eFlick said, \"Greta.\u003c/p\u003e\n\u003cp\u003eWe have a job to do.\u003c/p\u003e\n\u003cp\u003eLet\u0027s go.\" At last Greta nodded, picked up her mop and bucket, and walked through the door, moving like a robot.\u003c/p\u003e\n\u003cp\u003eThey went from the cleaning store into the canteen.\u003c/p\u003e\n\u003cp\u003eIt was empty but for two girls in uniform drinking coffee and smoking.\u003c/p\u003e\n\u003cp\u003eSpeaking French in a low voice, Flick said, \"You know what you have to do.\" Jelly began to sweep the floor.\u003c/p\u003e\n\u003cp\u003eGreta hesitated.\u003c/p\u003e\n\u003cp\u003eFlick said, \"Don\u0027t let me down.\" Greta nodded.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath, straightened her back, and said, \"I\u0027m ready.\" Flick entered the kitchen, and Greta followed.\u003c/p\u003e\n\u003cp\u003eThe fuse boxes for the building were in a cupboard off the kitchen, beside the large electric oven, according to Antoinette.\u003c/p\u003e\n\u003cp\u003eThere was a young German man at the kitchen stove.\u003c/p\u003e\n\u003cp\u003eFlick gave him a sexy smile and said, \"What have you got to offer a hungry girl?\" He grinned at her.\u003c/p\u003e\n\u003cp\u003eBehind his back, Greta took out a stout pair of pliers with rubberized handles, then opened the cupboard door.\u003c/p\u003e\n\u003cp\u003eTHE SKY WAS partly cloudy, and the sun disappeared as Dieter Franck drove into the picturesque square of Sainte-Cecile.\u003c/p\u003e\n\u003cp\u003eThe clouds were the same shade of dark gray as the slate roof of the church.\u003c/p\u003e\n\u003cp\u003eHe noticed four guards at the chateau gate, instead of the usual two.\u003c/p\u003e\n\u003cp\u003eAlthough he was in a Gestapo car, the sergeant carefully examined his pass and his driver\u0027s before opening the wrought-iron gates and waving the car in.\u003c/p\u003e\n\u003cp\u003eDieter was pleased: Weber had taken seriously the need for extra security.\u003c/p\u003e\n\u003cp\u003eA cool breeze blew as he walked from the car to the steps of the grand entrance.\u003c/p\u003e\n\u003cp\u003ePassing into the hall and seeing the rows of women at their switchboards, he thought about the female secret agent Weber had arrested.\u003c/p\u003e\n\u003cp\u003eThe Jackdaws were an all-woman team.\u003c/p\u003e\n\u003cp\u003eIt occurred to him that they might try to enter the chateau disguised as telephonists.\u003c/p\u003e\n\u003cp\u003eWas it possible? As he passed through the east wing he spoke to the German woman supervisor.\u003c/p\u003e\n\u003cp\u003e\"Have any of these women joined in the last few days?\" \"No, Major,\" she said.\u003c/p\u003e\n\u003cp\u003e\"One new girl was taken on three weeks ago, and she was the last.\" That put paid to his theory.\u003c/p\u003e\n\u003cp\u003eHe nodded and walked on.\u003c/p\u003e\n\u003cp\u003eAt the end of the east wing he took the staircase down.\u003c/p\u003e\n\u003cp\u003eThe door to the basement stood open, as usual, but there were two soldiers instead of the usual one standing inside.\u003c/p\u003e\n\u003cp\u003eWeber had doubled the guard.\u003c/p\u003e\n\u003cp\u003eThe corporal saluted and the sergeant asked for his pass.\u003c/p\u003e\n\u003cp\u003eDieter noticed that the corporal stood behind the sergeant while the sergeant checked the pass.\u003c/p\u003e\n\u003cp\u003eHe said, \"The way you are now, it\u0027s too easy for someone to overpower you both.\u003c/p\u003e\n\u003cp\u003eCorporal, you should stand to the side, and two meters away, so that you have a clear shot if the sergeant is attacked.\" \"Yes, sir.\" Dieter entered the basement corridor.\u003c/p\u003e\n\u003cp\u003eHe could hear the rumble of the diesel-fueled generator that supplied electricity to the phone system.\u003c/p\u003e\n\u003cp\u003eHe passed the doors of the equipment rooms and entered the interview room.\u003c/p\u003e\n\u003cp\u003eHe hoped to find the new prisoner here, but the room was empty.\u003c/p\u003e\n\u003cp\u003ePuzzled, he stepped inside and closed the door.\u003c/p\u003e\n\u003cp\u003eThen his question was answered.\u003c/p\u003e\n\u003cp\u003eFrom the inner chamber came a long scream of utter agony.\u003c/p\u003e\n\u003cp\u003eDieter threw open the door.\u003c/p\u003e\n\u003cp\u003eBecker stood at the electric shock machine.\u003c/p\u003e\n\u003cp\u003eWeber sat on a chair nearby.\u003c/p\u003e\n\u003cp\u003eA young woman lay on the operating table with her wrists and ankles strapped and her head clamped in the head restraint.\u003c/p\u003e\n\u003cp\u003eShe wore a blue dress, and wires from the electric shock machine ran between her feet and up her dress.\u003c/p\u003e\n\u003cp\u003eWeber said, \"Hello, Franck.\u003c/p\u003e\n\u003cp\u003eJoin us, please.\u003c/p\u003e\n\u003cp\u003eBecker here has come up with an innovation.\u003c/p\u003e\n\u003cp\u003eShow him, Sergeant.\" Becker reached beneath the woman\u0027s dress and drew out an ebonite cylinder about fifteen centimeters long and two or three in diameter.\u003c/p\u003e\n\u003cp\u003eThe cylinder was ringed by two metal bands a couple of centimeters apart.\u003c/p\u003e\n\u003cp\u003eTwo wires from the electric shock machine were attached to the bands.\u003c/p\u003e\n\u003cp\u003eDieter was accustomed to torture, but this hellish caricature of the sexual act filled him with loathing, and he shuddered with disgust.\u003c/p\u003e\n\u003cp\u003e\"She hasn\u0027t said anything yet, but we\u0027ve only just started,\" Weber said.\u003c/p\u003e\n\u003cp\u003e\"Give her another shock, Sergeant.\" Becker pushed up the woman\u0027s dress and inserted the cylinder in her vagina.\u003c/p\u003e\n\u003cp\u003eHe picked up a roll of electrician\u0027s tape, tore off a strip, and secured the cylinder so that it would not fall out.\u003c/p\u003e\n\u003cp\u003eWeber said \"Turn the voltage up this time.\" Becker returned to the machine.\u003c/p\u003e\n\u003cp\u003eThen the lights went out.\u003c/p\u003e\n\u003cp\u003eTHERE WAS A blue flash and a bang from behind the oven.\u003c/p\u003e\n\u003cp\u003eThe lights went out, and the kitchen was filled with the smell of scorched insulation.\u003c/p\u003e\n\u003cp\u003eThe motor of the refrigerator ran down with a groan as the power was cut off.\u003c/p\u003e\n\u003cp\u003eThe young cook said in German, \"What\u0027s going on?\" Flick ran out of the door and through the canteen with Jelly and Greta hard on her heels.\u003c/p\u003e\n\u003cp\u003eThey followed a short corridor past the cleaning cupboard.\u003c/p\u003e\n\u003cp\u003eAt the top of the stairs Flick paused.\u003c/p\u003e\n\u003cp\u003eShe drew her submachine gun and held it concealed under the flap of her coat.\u003c/p\u003e\n\u003cp\u003e\"The basement will be in total darkness?\" she said.\u003c/p\u003e\n\u003cp\u003e\"I cut all the cables, including the wires to the emergency lighting system,\" Greta assured her.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go.\" They ran down the stairs.\u003c/p\u003e\n\u003cp\u003eThe daylight coming from the ground-floor windows faded rapidly as they descended, and the entrance to the basement was half- dark.\u003c/p\u003e\n\u003cp\u003eThere were two soldiers standing just inside the door.\u003c/p\u003e\n\u003cp\u003eOne of them, a young corporal with a rifle, smiled and said, \"Don\u0027t worry, ladies, it\u0027s only a power cut.\" Flick shot him in the chest, then swung her weapon and shot the sergeant.\u003c/p\u003e\n\u003cp\u003eThe three Jackdaws stepped through the doorway.\u003c/p\u003e\n\u003cp\u003eFlick held her gun in her right hand and the flashlight in her left.\u003c/p\u003e\n\u003cp\u003eShe could hear a low rumble of machinery and several voices shouting questions in German from distant rooms.\u003c/p\u003e\n\u003cp\u003eShe turned on an electric torch for a second.\u003c/p\u003e\n\u003cp\u003eShe was in a broad corridor with a low ceiling.\u003c/p\u003e\n\u003cp\u003eFarther along, doors were opening.\u003c/p\u003e\n\u003cp\u003eShe switched off the flashlight.\u003c/p\u003e\n\u003cp\u003eA moment later she saw the flicker of a match at the far end.\u003c/p\u003e\n\u003cp\u003eAbout thirty seconds had passed since Greta cut off the power.\u003c/p\u003e\n\u003cp\u003eIt would not be long before the Germans recovered from the shock and found flashlights.\u003c/p\u003e\n\u003cp\u003eShe had only a minute, maybe less, to get out of sight.\u003c/p\u003e\n\u003cp\u003eShe tried the nearest door.\u003c/p\u003e\n\u003cp\u003eIt was open.\u003c/p\u003e\n\u003cp\u003eShe shone her flashlight inside.\u003c/p\u003e\n\u003cp\u003eThis was a photo lab, with prints hanging to dry and a man in a white coat fumbling his way across the room.\u003c/p\u003e\n\u003cp\u003eShe slammed the door, crossed the corridor in two\u003c/p\u003e\n\u003cp\u003estrides, and tried a door on the opposite side.\u003c/p\u003e\n\u003cp\u003eIt was locked.\u003c/p\u003e\n\u003cp\u003eShe guessed, from the position of the room at the front of the chateau under a corner of the parking lot, that the room beyond contained the fuel tanks.\u003c/p\u003e\n\u003cp\u003eShe moved along the corridor and opened the next door.\u003c/p\u003e\n\u003cp\u003eThe rumble of machinery became louder.\u003c/p\u003e\n\u003cp\u003eShe shone her flashlight once more, just for a split second, long enough to see an electricity generator-the independent power supply to the phone system, she assumed- then she hissed, \"Drag the bodies in here!\" Jelly and Greta pulled the dead guards across the floor.\u003c/p\u003e\n\u003cp\u003eFlick returned to the basement entrance and slammed the steel door shut.\u003c/p\u003e\n\u003cp\u003eNow the corridor was in total darkness.\u003c/p\u003e\n\u003cp\u003eAs an afterthought, she shot the three heavy bolts on the inside.\u003c/p\u003e\n\u003cp\u003eThat might give her precious extra seconds.\u003c/p\u003e\n\u003cp\u003eShe returned to the generator room, closed the door, and turned on her flashlight.\u003c/p\u003e\n\u003cp\u003eJelly and Greta had pushed the bodies behind the door and stood panting with the effort.\u003c/p\u003e\n\u003cp\u003e\"All done,\" Greta murmured.\u003c/p\u003e\n\u003cp\u003eThere was a mass of pipes and cables in the room, but they were all color-coded with German efficiency, and Flick knew which was which: fresh-air pipes were yellow, fuel lines were brown, water pipes were green, and power lines were striped red-and-black.\u003c/p\u003e\n\u003cp\u003eShe directed her torch at the brown fuel line to the generator.\u003c/p\u003e\n\u003cp\u003e\"Later, if we have time, I want you to blow a hole in that.\" \"Easy,\" said Jelly.\u003c/p\u003e\n\u003cp\u003e\"Now, put your hand on my shoulder and follow me.\u003c/p\u003e\n\u003cp\u003eGreta, you follow Jelly the same way.\u003c/p\u003e\n\u003cp\u003eOkay?\" \"Okay.\" Flick turned off her flashlight and opened the door.\u003c/p\u003e\n\u003cp\u003eNow they had to explore the basement blind.\u003c/p\u003e\n\u003cp\u003eShe put her hand to the wall as a guide and began to walk, heading farther inside.\u003c/p\u003e\n\u003cp\u003eA confused babble of raised voices revealed that several men were blundering about the corridor.\u003c/p\u003e\n\u003cp\u003eAn authoritative voice said in German, \"Who closed the main door?\" She heard Greta reply, but in a man\u0027s voice, \"It seems to be stuck.\" The German cursed.\u003c/p\u003e\n\u003cp\u003eA moment later there was the scrape of a bolt.\u003c/p\u003e\n\u003cp\u003eFlick reached another door.\u003c/p\u003e\n\u003cp\u003eShe opened it and shone her flashlight again.\u003c/p\u003e\n\u003cp\u003eIt contained two huge wooden coffers the size and shape of mortuary slabs.\u003c/p\u003e\n\u003cp\u003eGreta whispered, \"Battery room.\u003c/p\u003e\n\u003cp\u003eGo to the next door.\" The German man\u0027s voice said, \"Was that a flashlight? Bring it over here!\" \"Just coming,\" said Greta in her Gerhard voice, but the three Jackdaws walked in the opposite direction.\u003c/p\u003e\n\u003cp\u003eFlick came to the next room, led the other two inside, and closed the door before shining her flashlight.\u003c/p\u003e\n\u003cp\u003eIt was a long, narrow chamber with racks of equipment along both walls.\u003c/p\u003e\n\u003cp\u003eAt the near end of the room was a cabinet that probably held large sheets of drawings.\u003c/p\u003e\n\u003cp\u003eAt the far end, the beam of her flashlight revealed a small table.\u003c/p\u003e\n\u003cp\u003eThree men sat at it holding playing cards.\u003c/p\u003e\n\u003cp\u003eThey appeared to have remained sitting during the minute or so since the lights went out.\u003c/p\u003e\n\u003cp\u003eNow they moved.\u003c/p\u003e\n\u003cp\u003eAs they rose to their feet, Flick leveled her gun.\u003c/p\u003e\n\u003cp\u003eJelly was just as quick.\u003c/p\u003e\n\u003cp\u003eFlick shot one.\u003c/p\u003e\n\u003cp\u003eJelly\u0027s pistol cracked and the man beside him fell.\u003c/p\u003e\n\u003cp\u003eThe third man dived for cover, but Flick\u0027s flashlight followed him.\u003c/p\u003e\n\u003cp\u003eBoth Flick and Jelly fired again, and he fell still.\u003c/p\u003e\n\u003cp\u003eFlick refused to let herself think about the dead men as people.\u003c/p\u003e\n\u003cp\u003eThere was no time for feelings.\u003c/p\u003e\n\u003cp\u003eShe shone her flashlight around.\u003c/p\u003e\n\u003cp\u003eWhat she saw gladdened her heart.\u003c/p\u003e\n\u003cp\u003eThis was almost certainly the room she was looking for.\u003c/p\u003e\n\u003cp\u003eStanding a meter from one long wall was a pair of floor-to-ceiling racks bristling with thousands of terminals in tidy rows.\u003c/p\u003e\n\u003cp\u003eFrom the outside world the telephone cables came through the wall in neat bundles to the backs of the terminals on the nearer rack.\u003c/p\u003e\n\u003cp\u003eAt the farther end, similar cables led from the backs of the terminals up through the ceiling to the switchboards above.\u003c/p\u003e\n\u003cp\u003eAt the front of the frame, a nightmare tangle of loose jumper wires connected the terminals of the near rack to those of the far one.\u003c/p\u003e\n\u003cp\u003eFlick looked at Greta.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Greta was examining the equipment by the light of her own flashlight, a fascinated expression on her face.\u003c/p\u003e\n\u003cp\u003e\"This is the MDF-the main distribution frame,\" she said.\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s a bit different from ours in Britain.\" Flick stared at Greta in surprise.\u003c/p\u003e\n\u003cp\u003eMinutes ago she had said she was too frightened to go on.\u003c/p\u003e\n\u003cp\u003eNow she was unmoved by the killing of three men.\u003c/p\u003e\n\u003cp\u003eAlong the far wall more racks of equipment glowed with the light of vacuum tubes.\u003c/p\u003e\n\u003cp\u003e\"And on the other side?\" Flick asked.\u003c/p\u003e\n\u003cp\u003eGreta swung her torch.\u003c/p\u003e\n\u003cp\u003e\"Those are the amplifiers and carrier circuit equipment for the long-distance lines.\" \"Good,\" Flick said briskly.\u003c/p\u003e\n\u003cp\u003e\"Show Jelly where to place the charges.\" The three of them went to work.\u003c/p\u003e\n\u003cp\u003eGreta unwrapped the wax-paper packets of yellow plastic explosive while Flick cut the fuse cord into lengths.\u003c/p\u003e\n\u003cp\u003eIt burned at one centimeter per second.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make all the fuses three meters long,\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"That will give us exactly five minutes to get out.\" Jelly assembled the fire train: fuse, detonator, and firing cap.\u003c/p\u003e\n\u003cp\u003eFlick held a flashlight while Greta molded the charges to the frames at the vulnerable places and Jelly stuck the firing cap into the soft explosive.\u003c/p\u003e\n\u003cp\u003eThey worked fast.\u003c/p\u003e\n\u003cp\u003eIn five minutes all the equipment was covered with charges like a rash.\u003c/p\u003e\n\u003cp\u003eThe fuse cords led to a common source, where they were loosely twisted together, so that one light would serve to ignite them all.\u003c/p\u003e\n\u003cp\u003eJelly took out a thermite bomb, a black can about the size and shape of a tin of soup, containing finely powdered aluminum oxide and iron oxide.\u003c/p\u003e\n\u003cp\u003eIt would burn with intense heat and fierce flames.\u003c/p\u003e\n\u003cp\u003eShe took off the lid to reveal two fuses, then placed it on the ground behind the MDF.\u003c/p\u003e\n\u003cp\u003eGreta said, \"Somewhere in here are thousands of cards showing how the circuits are connected.\u003c/p\u003e\n\u003cp\u003eWe should burn them.\u003c/p\u003e\n\u003cp\u003eThen it will take the repair crew two weeks, rather than two days, to reconnect the cables.\" Flick opened the cupboard and found four custom- made card holders containing large diagrams, neatly sorted by labeled file dividers.\u003c/p\u003e\n\u003cp\u003e\"Is this what we\u0027re looking for?\" Greta studied a card by the light of her flashlight.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Jelly said, \"Scatter them around the thermite bomb.\u003c/p\u003e\n\u003cp\u003eThey\u0027ll go up in seconds.\" Flick threw the cards on the floor in loose piles.\u003c/p\u003e\n\u003cp\u003eJelly placed an oxygen-generating pack on the floor at the blind end of the room.\u003c/p\u003e\n\u003cp\u003e\"This will make the fire hotter,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Ordinarily, we could only burn the wooden frames and the insulation around the cables, but with this, the copper cables should melt.\" Everything was ready.\u003c/p\u003e\n\u003cp\u003eFlick shone her flashlight around the room.\u003c/p\u003e\n\u003cp\u003eThe outer walls were ancient brick, but the inner walls between the rooms were light wooden partitions.\u003c/p\u003e\n\u003cp\u003eThe explosion would destroy the partition walls and the fire would spread rapidly to the rest of the basement.\u003c/p\u003e\n\u003cp\u003eFive minutes had passed since the lights went out.\u003c/p\u003e\n\u003cp\u003eJelly took out a cigarette lighter.\u003c/p\u003e\n\u003cp\u003eFlick said, \"You two, make your way outside the building.\u003c/p\u003e\n\u003cp\u003eJelly, on your way, go into the generating room and blow a hole in the fuel line, where I showed you.\" \"Got it.\" \"We meet up at Antoinette\u0027s.\" Greta said anxiously, \"Where are you going?\" \"To find Ruby.\" Jelly warned, \"You have five minutes.\" Flick nodded.\u003c/p\u003e\n\u003cp\u003eJelly lit the fuse.\u003c/p\u003e\n\u003cp\u003eW H E N D E T E R PA SSE D from the darkness of the basement into the half-light of the stairwell, he noticed that the guards had gone from the entrance.\u003c/p\u003e\n\u003cp\u003eNo doubt they were fetching help, but the ill discipline infuriated him.\u003c/p\u003e\n\u003cp\u003eThey should have remained at their post.\u003c/p\u003e\n\u003cp\u003ePerhaps they had been forcibly removed.\u003c/p\u003e\n\u003cp\u003eHad they been taken away at gunpoint? Was an attack on the chateau already under way? He ran up the stairs.\u003c/p\u003e\n\u003cp\u003eOn the ground floor, there were no signs of battle.\u003c/p\u003e\n\u003cp\u003eThe operators were still working: the phone system was on a separate circuit from the rest of the building\u0027s electricity, and there was still enough light coming through the windows for them to see their switchboards.\u003c/p\u003e\n\u003cp\u003eHe ran through the canteen, heading for the rear of the building, where the maintenance workshops were located, but on the way he looked into the kitchen and found three soldiers in overalls staring at a fuse box.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a power cut in the basement,\" Dieter said.\u003c/p\u003e\n\u003cp\u003e\"I know,\" said one of the men.\u003c/p\u003e\n\u003cp\u003eHe had a sergeant\u0027s stripes on his shirt.\u003c/p\u003e\n\u003cp\u003e\"All these wires have been cut.\" Dieter raised his voice.\u003c/p\u003e\n\u003cp\u003e\"Then get your tools out and reconnect them, you damn fool!\" he said.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t stand here scratching your stupid head!\" The sergeant was startled.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir,\" he said.\u003c/p\u003e\n\u003cp\u003eA worried-looking young cook said, \"I think it\u0027s the electric oven, sir.\" \"What happened?\" Dieter barked.\u003c/p\u003e\n\u003cp\u003e\"Well, Major, they were cleaning behind the oven, and there was a bang-\" \"Who? Who was cleaning?\" \"I don\u0027t know, sir.\" \"A soldier, someone you recognized?\" \"No, sir.\u003c/p\u003e\n\u003cp\u003ejust a cleaner.\" Dieter did not know what to think.\u003c/p\u003e\n\u003cp\u003eClearly the chateau was under attack.\u003c/p\u003e\n\u003cp\u003eBut where were the enemy? He left the kitchen, went to the stairwell, and ran up toward the offices on the upper floor.\u003c/p\u003e\n\u003cp\u003eAs he turned at the bend in the stairs, something caught his eye, and he looked back.\u003c/p\u003e\n\u003cp\u003eA tall woman in a cleaner\u0027s overall was coming up the stairs from the basement, carrying a mop and a bucket.\u003c/p\u003e\n\u003cp\u003eHe froze, staring at her, his mind racing.\u003c/p\u003e\n\u003cp\u003eShe should not have been there.\u003c/p\u003e\n\u003cp\u003eOnly Germans were allowed into the basement.\u003c/p\u003e\n\u003cp\u003eOf course, anything could have happened in the confusion of a power cut.\u003c/p\u003e\n\u003cp\u003eBut the cook had blamed a cleaner for the power cut.\u003c/p\u003e\n\u003cp\u003eHe recalled his brief conversation with the supervisor of the switchboard girls.\u003c/p\u003e\n\u003cp\u003eNone of them was new to the job-but he had not asked about the Frenchwomen cleaners.\u003c/p\u003e\n\u003cp\u003eHe came back down the stairs and met her at ground level.\u003c/p\u003e\n\u003cp\u003e\"Why were you in the basement?\" he asked her in French.\u003c/p\u003e\n\u003cp\u003e\"I went there to clean, but the lights are out.\" Dieter frowned.\u003c/p\u003e\n\u003cp\u003eShe spoke French with an accent that he could not quite place.\u003c/p\u003e\n\u003cp\u003eHe said, \"You\u0027re not supposed to go there.\" \"Yes, the soldier told me that, they clean it themselves, I didn\u0027t know.\" Her accent was not English, Dieter thought.\u003c/p\u003e\n\u003cp\u003eBut what was it? \"How long have you worked here?\" \"Only a week, and I\u0027ve always done upstairs until today.\" Her story was plausible, but Dieter was not satisfied.\u003c/p\u003e\n\u003cp\u003e\"Come with me.\" He took her arm in a firm grip.\u003c/p\u003e\n\u003cp\u003eShe did not resist as he led her through to the kitchen.\u003c/p\u003e\n\u003cp\u003eDieter spoke to the cook.\u003c/p\u003e\n\u003cp\u003e\"Do you recognize this woman?\" \"Yes, sir.\u003c/p\u003e\n\u003cp\u003eShe\u0027s the one who was cleaning behind the oven.\" Dieter looked at her.\u003c/p\u003e\n\u003cp\u003e\"Is that true?\" \"Yes, sir, I\u0027m very sorry if I damaged something.\" Dieter recognized her accent.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re German,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No, sir.\" \"You filthy traitor.\" He looked at the cook.\u003c/p\u003e\n\u003cp\u003e\"Grab her and follow me.\u003c/p\u003e\n\u003cp\u003eShe\u0027s going to tell me everything.\" F L I C K 0 P E N E D T H E door marked Interview Room, stepped inside, closed the door behind her, and swept the room with her flashlight.\u003c/p\u003e\n\u003cp\u003eShe saw a cheap pine table with ashtrays, several chairs, and a steel desk.\u003c/p\u003e\n\u003cp\u003eThe room was empty of people.\u003c/p\u003e\n\u003cp\u003eShe was puzzled.\u003c/p\u003e\n\u003cp\u003eShe had located the prison cells on this corridor and had shone her flashlight through the judas in each door.\u003c/p\u003e\n\u003cp\u003eThe cells were empty: the prisoners the Gestapo had taken during the last eight days, including Gilberte, must have been moved somewhere else .\u003c/p\u003e\n\u003cp\u003eor killed.\u003c/p\u003e\n\u003cp\u003eBut Ruby had to be here somewhere.\u003c/p\u003e\n\u003cp\u003eThen she saw, on her left, a door leading, presumably, to an inner chamber.\u003c/p\u003e\n\u003cp\u003eShe switched off her flashlight, opened the door, stepped through, closed the door, and switched on her flashlight.\u003c/p\u003e\n\u003cp\u003eShe saw Ruby right away.\u003c/p\u003e\n\u003cp\u003eShe was lying on a table like a hospital operating table.\u003c/p\u003e\n\u003cp\u003eSpecially designed straps secured her wrists and ankles and made it impossible for her to move her head.\u003c/p\u003e\n\u003cp\u003eA wire from an electrical machine led between her feet and up her skirt.\u003c/p\u003e\n\u003cp\u003eFlick guessed immediately what had been done to Ruby and gasped with horror.\u003c/p\u003e\n\u003cp\u003eShe stepped to the table.\u003c/p\u003e\n\u003cp\u003e\"Ruby, can you hear me?\" Ruby groaned.\u003c/p\u003e\n\u003cp\u003eFlick\u0027s heart leaped: she was still alive.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll free you,\" she said.\u003c/p\u003e\n\u003cp\u003eShe put her Sten gun down on the table.\u003c/p\u003e\n\u003cp\u003eRuby was trying to speak, but her words came out as a moan.\u003c/p\u003e\n\u003cp\u003eSwiftly, Flick undid the straps that bound Ruby to the table.\u003c/p\u003e\n\u003cp\u003e\"Flick,\" Ruby said at last.\u003c/p\u003e\n\u003cp\u003e\"What?\" \"Behind you.\" Flick jumped to one side.\u003c/p\u003e\n\u003cp\u003eSomething heavy brushed her ear and thumped her left shoulder hard.\u003c/p\u003e\n\u003cp\u003eShe cried out in pain, dropped her flashlight, and fell.\u003c/p\u003e\n\u003cp\u003eHitting the floor she rolled sideways, moving as far as possible from her original position so that her assailant could not hit her again.\u003c/p\u003e\n\u003cp\u003eShe had been so shocked by the sight of Ruby that she had not shone her flashlight all around the room.\u003c/p\u003e\n\u003cp\u003eSomeone else had been lurking in the shadows, waiting for his chance, and had slowly crept up behind her.\u003c/p\u003e\n\u003cp\u003eHer left arm was momentarily numbed.\u003c/p\u003e\n\u003cp\u003eUsing her right hand, she scrabbled on the floor for her flashlight.\u003c/p\u003e\n\u003cp\u003eBefore she found it, there was a loud click, and the lights came on.\u003c/p\u003e\n\u003cp\u003eShe blinked and saw two people.\u003c/p\u003e\n\u003cp\u003eOne was a squat, stocky man with a round head and close-cropped hair.\u003c/p\u003e\n\u003cp\u003eBehind him stood Ruby.\u003c/p\u003e\n\u003cp\u003eIn the dark Ruby had picked up what looked like a steel bar, and she held it above her head in readiness.\u003c/p\u003e\n\u003cp\u003eAs soon as the lights came on, Ruby saw the man, turned, and brought the steel bar down on his head with maximum force.\u003c/p\u003e\n\u003cp\u003eIt was a crippling blow, and the man slumped to the floor and lay still.\u003c/p\u003e\n\u003cp\u003eFlick got up.\u003c/p\u003e\n\u003cp\u003eThe feeling was rapidly returning to her arm.\u003c/p\u003e\n\u003cp\u003eShe picked up the Sten gun.\u003c/p\u003e\n\u003cp\u003eRuby was kneeling over the prone body of the man.\u003c/p\u003e\n\u003cp\u003e\"Meet Sergeant Becker,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in bloody agony, but I\u0027m going to get my own back on this fucking bastard.\" Grasping the front of Becker\u0027s uniform tunic, Ruby heaved him upright, then, with an effort, pushed him onto the operating table.\u003c/p\u003e\n\u003cp\u003eHe groaned.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s coming round!\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll finish him off.\" \"Give me ten seconds.\" Ruby straightened the man\u0027s limbs and strapped him in by his wrists and ankles; then she tightened the head restraint so that he could not move.\u003c/p\u003e\n\u003cp\u003eFinally, she took the cylindrical terminal from the electric shock machine and stuffed it into his mouth.\u003c/p\u003e\n\u003cp\u003eHe choked and gagged but could not move his head.\u003c/p\u003e\n\u003cp\u003eShe picked up a roll of electrician\u0027s tape, tore off a strip with her teeth, and secured the cylinder so that it would not come out of his mouth.\u003c/p\u003e\n\u003cp\u003eThen she went to the machine and fumbled with the switch.\u003c/p\u003e\n\u003cp\u003eThere was a low hum.\u003c/p\u003e\n\u003cp\u003eThe man on the table let out a strangled scream.\u003c/p\u003e\n\u003cp\u003eHis strapped-down body shook with convulsions.\u003c/p\u003e\n\u003cp\u003eRuby looked at him for a moment; then she said, \"Let\u0027s go.\" They went out, leaving Sergeant Becker writhing on the table, squealing like a pig in the slaughterhouse.\u003c/p\u003e\n\u003cp\u003eFlick checked her watch.\u003c/p\u003e\n\u003cp\u003eTwo minutes had passed since Jelly lit the fuses.\u003c/p\u003e\n\u003cp\u003eThey passed through the Interview Room and stepped out into the corridor.\u003c/p\u003e\n\u003cp\u003eThe confusion had died down.\u003c/p\u003e\n\u003cp\u003eThere were just three soldiers near the entrance, talking calmly.\u003c/p\u003e\n\u003cp\u003eFlick walked rapidly toward them with Ruby close behind.\u003c/p\u003e\n\u003cp\u003eFlick\u0027s instinct was to walk straight past the soldiers, relying on a confident air to get her through, but then she glimpsed, through the door, the tall figure of Dieter Franck approaching, followed by two or three other people she could not clearly see.\u003c/p\u003e\n\u003cp\u003eShe stopped abruptly.\u003c/p\u003e\n\u003cp\u003eRuby bumped into her back.\u003c/p\u003e\n\u003cp\u003eFlick turned to the nearest door.\u003c/p\u003e\n\u003cp\u003eIt was marked Wireless Room.\u003c/p\u003e\n\u003cp\u003eShe opened it.\u003c/p\u003e\n\u003cp\u003eThe room was empty.\u003c/p\u003e\n\u003cp\u003eThey stepped inside.\u003c/p\u003e\n\u003cp\u003eShe left the door an inch open.\u003c/p\u003e\n\u003cp\u003eShe heard Major Franck bark in German, \"Captain, where are the two men who should be guarding this entrance?\" \"I don\u0027t know, Major, I was just asking.\" Flick took the silencer off her Sten gun and flicked the switch for rapid fire.\u003c/p\u003e\n\u003cp\u003eShe had used only four bullets so far, leaving twenty-eight in the magazine.\u003c/p\u003e\n\u003cp\u003e\"Sergeant, you and this corporal stand guard.\u003c/p\u003e\n\u003cp\u003eCaptain, you go up to Major Weber\u0027s office and tell him Major Franck strongly recommends he conduct a search of the basement immediately.\u003c/p\u003e\n\u003cp\u003eOff you go, on the double!\" A moment later, Franck\u0027s footsteps passed the Wireless Room.\u003c/p\u003e\n\u003cp\u003eFlick waited, listening.\u003c/p\u003e\n\u003cp\u003eA door slammed.\u003c/p\u003e\n\u003cp\u003eShe peeped out.\u003c/p\u003e\n\u003cp\u003eFranck had disappeared.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" she said to Ruby.\u003c/p\u003e\n\u003cp\u003eThey left the Wireless Room and walked to the main door.\u003c/p\u003e\n\u003cp\u003eThe corporal said in French, \"What are you doing here?\" Flick had an answer ready.\u003c/p\u003e\n\u003cp\u003e\"My friend Valerie is new to the job, and she came to the wrong place in the confusion of the blackout.\" The corporal looked dubious.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s still light upstairs, how could she get lost?\" Ruby said, \"I\u0027m very sorry, sir, I thought I was supposed to clean here, and no one stopped me.\" The sergeant said in German, \"We\u0027re supposed to keep them out, not keep them in, Corporal.\" He laughed and waved them on.\u003c/p\u003e\n\u003cp\u003eo I E I E R T I E D T H E prisoner to a chair, then dismissed the cook who had escorted her from the kitchen.\u003c/p\u003e\n\u003cp\u003eHe looked at the woman for a moment, wondering how much time he had.\u003c/p\u003e\n\u003cp\u003eOne agent had been arrested in the street outside the chateau.\u003c/p\u003e\n\u003cp\u003eAnother, if she was an agent, had been caught coming up the stairs from the basement.\u003c/p\u003e\n\u003cp\u003eHad the others come and gone? Were they waiting somewhere to be let in? Or were they here in the building right now? It was maddening not to know what was happening.\u003c/p\u003e\n\u003cp\u003eBut he had ordered the basement searched.\u003c/p\u003e\n\u003cp\u003eThe only other thing he could do was interrogate the prisoner.\u003c/p\u003e\n\u003cp\u003eDieter began with the traditional slap in the face, sudden and demoralizing.\u003c/p\u003e\n\u003cp\u003eThe woman gasped with shock and pain.\u003c/p\u003e\n\u003cp\u003e\"Where are your friends?\" he asked her.\u003c/p\u003e\n\u003cp\u003eThe woman\u0027s cheek reddened.\u003c/p\u003e\n\u003cp\u003eHe studied her expression.\u003c/p\u003e\n\u003cp\u003eWhat he saw mystified him.\u003c/p\u003e\n\u003cp\u003eShe looked happy.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in the basement of the chateau,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"Through that door is the torture chamber.\u003c/p\u003e\n\u003cp\u003eOn the other side, beyond that partition wall, is the telephone switchgear.\u003c/p\u003e\n\u003cp\u003eWe are at the end of a tunnel, the bottom of the sack, as the French say.\u003c/p\u003e\n\u003cp\u003eIf your friends plan to blow up the building, you and I will surely die here in this room.\" Her expression did not change.\u003c/p\u003e\n\u003cp\u003ePerhaps the chateau was not about to blow up, Dieter thought.\u003c/p\u003e\n\u003cp\u003eBut then what was the mission? \"You\u0027re German,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Why are you helping your country\u0027s enemies?\" At last she spoke.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you,\" she said.\u003c/p\u003e\n\u003cp\u003eShe spoke German with a Hamburg accent.\u003c/p\u003e\n\u003cp\u003e\"Many years ago, I had a lover.\u003c/p\u003e\n\u003cp\u003eHis name was Manfred.\" She looked away, remembering.\u003c/p\u003e\n\u003cp\u003e\"Your Nazis arrested him and sent him to a camp.\u003c/p\u003e\n\u003cp\u003eI think he died there-I never heard.\" She paused, swallowing.\u003c/p\u003e\n\u003cp\u003eDieter waited.\u003c/p\u003e\n\u003cp\u003eAfter a moment she went on.\u003c/p\u003e\n\u003cp\u003e\"When they took him away from me, I swore I would have my revenge-and this is it.\" She smiled happily.\u003c/p\u003e\n\u003cp\u003e\"Your foul regime is almost finished.\u003c/p\u003e\n\u003cp\u003eAnd I\u0027ve helped to destroy it.\" There was something wrong here.\u003c/p\u003e\n\u003cp\u003eShe spoke as if the deed was already done.\u003c/p\u003e\n\u003cp\u003eFurthermore, the power cut had come and gone.\u003c/p\u003e\n\u003cp\u003eHad the blackout already served its purpose? This woman showed no fear.\u003c/p\u003e\n\u003cp\u003eBut could it be that she did not mind dying? \"Why was your lover arrested?\" \"They called him a pervert.\" \"What kind?\" \"He was homosexual.\" \"But he was your lover?\" \"Yes.\" Dieter frowned.\u003c/p\u003e\n\u003cp\u003eThen he looked harder at the woman.\u003c/p\u003e\n\u003cp\u003eShe was tall and broad-shouldered, and underneath the makeup she had a masculine nose and chin...\u003c/p\u003e\n\u003cp\u003e\"Are you a man?\" he said in astonishment.\u003c/p\u003e\n\u003cp\u003eShe just smiled.\u003c/p\u003e\n\u003cp\u003eA dreadful suspicion dawned on Dieter.\u003c/p\u003e\n\u003cp\u003e\"Why are you telling me this?\" he said.\u003c/p\u003e\n\u003cp\u003e\"Are you trying to keep me occupied while your friends get away? Are you sacrificing your life to ensure the success of the mission-\" His train of thought was broken by a faint noise.\u003c/p\u003e\n\u003cp\u003eIt sounded like a strangled scream.\u003c/p\u003e\n\u003cp\u003eNow that he noticed it, he realized he had heard it two or three times before and ignored it.\u003c/p\u003e\n\u003cp\u003eThe sound seemed to come from the next room.\u003c/p\u003e\n\u003cp\u003eDieter sprang up and went into the torture chamber.\u003c/p\u003e\n\u003cp\u003eHe expected to see the other woman agent on the table and was shocked to find someone else there.\u003c/p\u003e\n\u003cp\u003eIt was a man, he saw immediately, but at first he did not know who, because the face was distorted-the jaw dislocated, the teeth broken, the cheeks stained with blood and vomit.\u003c/p\u003e\n\u003cp\u003eThen he recognized the squat figure of Sergeant Becker.\u003c/p\u003e\n\u003cp\u003eThe wires from the electric shock machine led to Becker\u0027s mouth.\u003c/p\u003e\n\u003cp\u003eDieter realized that the terminal from the machine was in Becker\u0027s mouth, secured there by electrician\u0027s tape.\u003c/p\u003e\n\u003cp\u003eBecker was still alive, twitching and emitting a dreadful squealing sound.\u003c/p\u003e\n\u003cp\u003eDieter was horrified.\u003c/p\u003e\n\u003cp\u003eHe swiftly turned off the machine.\u003c/p\u003e\n\u003cp\u003eBecker stopped twitching.\u003c/p\u003e\n\u003cp\u003eDieter grasped the electric wire and jerked hard.\u003c/p\u003e\n\u003cp\u003eThe terminal came out of Becker\u0027s mouth.\u003c/p\u003e\n\u003cp\u003eHe threw it to the floor.\u003c/p\u003e\n\u003cp\u003eHe bent over the table.\u003c/p\u003e\n\u003cp\u003e\"Becker!\" he said.\u003c/p\u003e\n\u003cp\u003e\"Can you hear me? What happened here?\" There was no reply.\u003c/p\u003e\n\u003cp\u003eUPSTAIRS, ALL WAS normal.\u003c/p\u003e\n\u003cp\u003eFlick and Ruby walked quickly through the ranks of telephone operators, all busy at their switchboards, murmuring into their headsets in low voices as they plugged jacks into sockets, connecting decision-makers in Berlin, Paris, and Normandy.\u003c/p\u003e\n\u003cp\u003eFlick checked her watch.\u003c/p\u003e\n\u003cp\u003eIn exactly two minutes all those connections would be destroyed, and the military machine would fall apart, leaving a scatter of isolated components, unable to work together.\u003c/p\u003e\n\u003cp\u003eNow, Flick thought, if only we can get out...\u003c/p\u003e\n\u003cp\u003eThey passed out of the building without incident.\u003c/p\u003e\n\u003cp\u003eIn seconds they would be in the town square.\u003c/p\u003e\n\u003cp\u003eThey had al most made it.\u003c/p\u003e\n\u003cp\u003eBut, in the courtyard, they met Jelly- coming back.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Greta?\" she said.\u003c/p\u003e\n\u003cp\u003e\"She left with you!\" Flick replied.\u003c/p\u003e\n\u003cp\u003e\"I stopped to set a charge on the diesel fuel line in the generator room, like you said.\u003c/p\u003e\n\u003cp\u003eGreta went on ahead of me.\u003c/p\u003e\n\u003cp\u003eBut she never reached Antoinette\u0027s place.\u003c/p\u003e\n\u003cp\u003eI\u0027ve just met Paul, he hasn\u0027t seen her.\u003c/p\u003e\n\u003cp\u003eI came back to look for her.\" Jelly had a paper packet in her hand.\u003c/p\u003e\n\u003cp\u003e\"I told the guard at the gate that I just went out to fetch my supper.\" Flick was dismayed.\u003c/p\u003e\n\u003cp\u003e\"Greta must be inside-hell!\" \"I\u0027m going back for her,\" Jelly said determinedly.\u003c/p\u003e\n\u003cp\u003e\"She saved me from the Gestapo, back in Chartres, so I owe her.\" Flick looked at her watch.\u003c/p\u003e\n\u003cp\u003e\"We have less than two minutes.\u003c/p\u003e\n\u003cp\u003eLet\u0027s go!\" They ran back inside.\u003c/p\u003e\n\u003cp\u003eThe switchboard girls stared at them as they raced through the rooms.\u003c/p\u003e\n\u003cp\u003eFlick was already having second thoughts.\u003c/p\u003e\n\u003cp\u003eIn attempting to save one of her team, was she about to sacrifice two more-and herself? When they reached the stairwell, Flick paused.\u003c/p\u003e\n\u003cp\u003eThe two soldiers who had let them out of the basement with a joke would not let them in again so easily.\u003c/p\u003e\n\u003cp\u003e\"As before,\" she said quietly to the others.\u003c/p\u003e\n\u003cp\u003e\u0027Approach the guards innocently and shoot at the last moment.\" A voice from above said, \"What\u0027s going on here?\" Flick froze.\u003c/p\u003e\n\u003cp\u003eShe looked back over her shoulder.\u003c/p\u003e\n\u003cp\u003eOn the staircase coming down from the top floor stood four men.\u003c/p\u003e\n\u003cp\u003eOne, in major\u0027s uniform, was pointing a pistol at her.\u003c/p\u003e\n\u003cp\u003eShe recognized Major Weber.\u003c/p\u003e\n\u003cp\u003eThis was the search party Dieter Franck had asked for.\u003c/p\u003e\n\u003cp\u003eIt had appeared at precisely the wrong moment.\u003c/p\u003e\n\u003cp\u003eFlick cursed herself for a bad decision.\u003c/p\u003e\n\u003cp\u003eNow four would be lost instead of one.\u003c/p\u003e\n\u003cp\u003eWeber said, \"You women have a conspiratorial air.\" \"What do you want with us?\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re the cleaners.\" \"Perhaps you are,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But there is a team of female enemy agents in the district.\" Flick pretended to be relieved.\u003c/p\u003e\n\u003cp\u003e\"Oh, good,\" she said.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re looking for enemy agents, we\u0027re safe.\u003c/p\u003e\n\u003cp\u003eI was afraid you might be dissatisfied with the cleaning.\" She forced a laugh.\u003c/p\u003e\n\u003cp\u003eRuby joined in.\u003c/p\u003e\n\u003cp\u003eBoth sounded false.\u003c/p\u003e\n\u003cp\u003eWeber said, \"Raise your hands in the air.\" As she lifted her wrist past her face, Flick checked her watch.\u003c/p\u003e\n\u003cp\u003eThirty seconds left.\u003c/p\u003e\n\u003cp\u003e\"Down the stairs,\" said Weber.\u003c/p\u003e\n\u003cp\u003eReluctantly, Flick went down.\u003c/p\u003e\n\u003cp\u003eRuby and Jelly went with her, and the four men followed.\u003c/p\u003e\n\u003cp\u003eShe went as slowly as she could, counting seconds.\u003c/p\u003e\n\u003cp\u003eShe stopped at the foot of the stairs.\u003c/p\u003e\n\u003cp\u003eTwenty seconds.\u003c/p\u003e\n\u003cp\u003e\"You again?\" said one of the guards.\u003c/p\u003e\n\u003cp\u003eFlick said, \"Speak to your major.\" \"Keep moving,\" said Weber.\u003c/p\u003e\n\u003cp\u003e\"I thought we weren\u0027t supposed to go into the basement.\" \"Just keep going!\" Five seconds.\u003c/p\u003e\n\u003cp\u003eThey passed through the basement door.\u003c/p\u003e\n\u003cp\u003eThere was a tremendous bang.\u003c/p\u003e\n\u003cp\u003eAt the far end of the corridor, the partition walls of the equipment chamber exploded outwards.\u003c/p\u003e\n\u003cp\u003eThere was a series of crashing sounds.\u003c/p\u003e\n\u003cp\u003eFlames billowed over the debris.\u003c/p\u003e\n\u003cp\u003eFlick was knocked down.\u003c/p\u003e\n\u003cp\u003eShe got up on one knee, pulled the submachine gun out from under her overall, and spun around.\u003c/p\u003e\n\u003cp\u003eJelly and Ruby were on either side of her.\u003c/p\u003e\n\u003cp\u003eThe basement guards, Weber, and the other three men had also fallen.\u003c/p\u003e\n\u003cp\u003eFlick pulled the trigger.\u003c/p\u003e\n\u003cp\u003eOf the six Germans, only Weber had kept his presence of mind.\u003c/p\u003e\n\u003cp\u003eAs Flick sprayed bullets, Weber fired his pistol.\u003c/p\u003e\n\u003cp\u003eBeside flick Jelly, struggling to her feet, cried out and fell.\u003c/p\u003e\n\u003cp\u003eThen Flick hit Weber in the chest and he went down.\u003c/p\u003e\n\u003cp\u003eFlick emptied her gun into the six bodies on the floor.\u003c/p\u003e\n\u003cp\u003eShe ejected the magazine, took a fresh one from her pocket, and reloaded.\u003c/p\u003e\n\u003cp\u003eRuby bent over Jelly, feeling for a pulse.\u003c/p\u003e\n\u003cp\u003eAfter a moment she looked up.\u003c/p\u003e\n\u003cp\u003e\"Dead,\" she said.\u003c/p\u003e\n\u003cp\u003eFlick looked toward the far end of the corridor, where Greta was.\u003c/p\u003e\n\u003cp\u003eflames were billowing out from the equipment chamber, but the wall of the Interview Room seemed intact.\u003c/p\u003e\n\u003cp\u003eShe ran toward the inferno.\u003c/p\u003e\n\u003cp\u003eDIETER FOUND HIMSELF lying on the floor without knowing how he had got there.\u003c/p\u003e\n\u003cp\u003eHe heard the roaring of flames and smelled smoke.\u003c/p\u003e\n\u003cp\u003eHe struggled to his feet and looked into the Interview Room.\u003c/p\u003e\n\u003cp\u003eHe realized immediately that the brick walls of the torture chamber had saved his life.\u003c/p\u003e\n\u003cp\u003eThe partition between the Interview Room and the equipment chamber had disappeared.\u003c/p\u003e\n\u003cp\u003eThe few pieces of furniture in the Interview Room had been thrown up against the wall.\u003c/p\u003e\n\u003cp\u003eThe prisoner had suffered the same fate and lay on the ground, still tied to the chair, neck at the horrid angle that indicated it was broken and she-or he-was dead.\u003c/p\u003e\n\u003cp\u003eThe equipment chamber was aflame and the fire was spreading rapidly.\u003c/p\u003e\n\u003cp\u003eDieter realized he had only seconds to get away.\u003c/p\u003e\n\u003cp\u003eThe door to the Interview Room opened and Flick Clairet stood there holding a submachine gun.\u003c/p\u003e\n\u003cp\u003eShe wore a dark wig that had fallen askew to reveal her own blonde hair beneath.\u003c/p\u003e\n\u003cp\u003eFlushed, breathing hard, a wild look in her eyes, she was beautiful.\u003c/p\u003e\n\u003cp\u003eIf he had had a gun in his hand at that moment, he would have mowed her down in blind rage.\u003c/p\u003e\n\u003cp\u003eShe would be an incomparable prize if captured alive, but he was so enraged and humiliated by her success and his own failure that he could not have controlled himself.\u003c/p\u003e\n\u003cp\u003eBut she had the gun.\u003c/p\u003e\n\u003cp\u003eAt first she did not see Dieter but stared at the dead body of her comrade.\u003c/p\u003e\n\u003cp\u003eDieter\u0027s hand moved inside his jacket.\u003c/p\u003e\n\u003cp\u003eThen she lifted her gaze and met his eyes.\u003c/p\u003e\n\u003cp\u003eHe saw recognition dawn on her face.\u003c/p\u003e\n\u003cp\u003eShe knew who he was.\u003c/p\u003e\n\u003cp\u003eShe knew whom she had been fighting for the past nine days.\u003c/p\u003e\n\u003cp\u003eThere was a light of triumph in her eyes.\u003c/p\u003e\n\u003cp\u003eBut he also saw the thirst for revenge in the twist of her mouth, and she raised the Sten gun and fired.\u003c/p\u003e\n\u003cp\u003eDieter ducked back into the torture chamber as her bullets chipped fragments of brick off the wall.\u003c/p\u003e\n\u003cp\u003eHe drew his Walther P38 automatic pistol, thumbed the safety lever to the fire position, and pointed it at the doorway, waiting for Flick to come through.\u003c/p\u003e\n\u003cp\u003eShe did not appear.\u003c/p\u003e\n\u003cp\u003eHe waited a few seconds, then risked a look.\u003c/p\u003e\n\u003cp\u003eFlick had gone.\u003c/p\u003e\n\u003cp\u003eHe dashed across the burning Interview Room, threw open the door, and stepped into the corridor.\u003c/p\u003e\n\u003cp\u003eFlick and another woman were running toward the far end.\u003c/p\u003e\n\u003cp\u003eAs he raised his gun, they jumped over a group of uniformed bodies on the floor.\u003c/p\u003e\n\u003cp\u003eHe aimed at Flick; then a hot pain burned his arm.\u003c/p\u003e\n\u003cp\u003eHe cried out and dropped his gun.\u003c/p\u003e\n\u003cp\u003eHe saw that his sleeve was on fire.\u003c/p\u003e\n\u003cp\u003eHe tore off his jacket.\u003c/p\u003e\n\u003cp\u003eWhen he looked up again, the women had gone.\u003c/p\u003e\n\u003cp\u003eDieter picked up his pistol and went after them.\u003c/p\u003e\n\u003cp\u003eAs he ran, he smelled fuel.\u003c/p\u003e\n\u003cp\u003eThere was a leak-or perhaps the saboteurs had holed a pipe.\u003c/p\u003e\n\u003cp\u003eAny second now, the basement would explode like a giant bomb.\u003c/p\u003e\n\u003cp\u003eBut he might still catch Flick.\u003c/p\u003e\n\u003cp\u003eHe ran out and started up the stairs.\u003c/p\u003e\n\u003cp\u003eIN THE TORTURE chamber, Sergeant Becker\u0027s uniform started to smolder.\u003c/p\u003e\n\u003cp\u003eThe heat and the smoke brought him back to consciousness and he cried for help, but no one heard.\u003c/p\u003e\n\u003cp\u003eHe struggled against the leather straps that bound him, as so many of his victims had struggled in the past, but, like them, he was helpless.\u003c/p\u003e\n\u003cp\u003eA few moments later, his clothes burst into flame, and he began to scream.\u003c/p\u003e\n\u003cp\u003eFLICK SAW DIETER coming up the stairs after her with his gun in his hand.\u003c/p\u003e\n\u003cp\u003eShe was afraid that if she stopped and turned to take aim at him, he would be able to shoot first.\u003c/p\u003e\n\u003cp\u003eShe decided to run rather than stand and fight.\u003c/p\u003e\n\u003cp\u003eSomeone had activated the fire alarm, and a klaxon blared throughout the chateau as she and Ruby raced through the switchboard rooms.\u003c/p\u003e\n\u003cp\u003eAll the operators left their stations and crowded to the doors, so that Flick found herself in a crush.\u003c/p\u003e\n\u003cp\u003eThe crowd would be making it difficult for Dieter to get a shot at her or Ruby, but the other women were slowing them down.\u003c/p\u003e\n\u003cp\u003eFlick punched and kicked ruthlessly to get people out of her way.\u003c/p\u003e\n\u003cp\u003eThey reached the front entrance and ran down the steps.\u003c/p\u003e\n\u003cp\u003eIn the square, Flick could see Moulier\u0027s meat van, backed up to the chateau gates with its engine running and its rear doors open.\u003c/p\u003e\n\u003cp\u003ePaul stood beside it, staring anxiously through the iron railings.\u003c/p\u003e\n\u003cp\u003eFlick thought he was the best thing she had ever seen.\u003c/p\u003e\n\u003cp\u003eHowever, as the women poured out of the building, two guards were directing them into the vineyard on the west side of the courtyard, away from the parked cars.\u003c/p\u003e\n\u003cp\u003eflick and Ruby ignored their waved instructions and ran for the gates.\u003c/p\u003e\n\u003cp\u003eWhen the soldiers saw Flick\u0027s submachine gun, they reached for their weapons.\u003c/p\u003e\n\u003cp\u003eA rifle appeared in Paul\u0027s hands.\u003c/p\u003e\n\u003cp\u003eHe aimed through the railings.\u003c/p\u003e\n\u003cp\u003eTwo shots rang out, and both guards fell.\u003c/p\u003e\n\u003cp\u003ePaul threw open the gates.\u003c/p\u003e\n\u003cp\u003eAs flick dashed through the gateway, shots whistled over her head and hit the van: Dieter was firing.\u003c/p\u003e\n\u003cp\u003ePaul jumped into the front of the van.\u003c/p\u003e\n\u003cp\u003eFlick and Ruby threw themselves into the back.\u003c/p\u003e\n\u003cp\u003eAs the van pulled away, Flick saw Dieter turn toward the parking lot, where his sky-blue car stood waiting.\u003c/p\u003e\n\u003cp\u003eAt that moment, down in the basement, the fire reached the fuel tanks.\u003c/p\u003e\n\u003cp\u003eThere was a deep underground boom like an earthquake.\u003c/p\u003e\n\u003cp\u003eThe parking lot erupted, gravel and earth and slabs of concrete flying into the air.\u003c/p\u003e\n\u003cp\u003eHalf the cars parked around the old fountain were overturned.\u003c/p\u003e\n\u003cp\u003eHuge stones and chunks of brickwork rained down on the rest.\u003c/p\u003e\n\u003cp\u003eDieter was thrown back across the steps.\u003c/p\u003e\n\u003cp\u003eThe gas pump soared into the air, and a gout of flame spurted from the ground where it had stood.\u003c/p\u003e\n\u003cp\u003eSeveral cars caught fire, and their gas tanks began to explode, one by one.\u003c/p\u003e\n\u003cp\u003eThen the van left the square, and Flick could see no more.\u003c/p\u003e\n\u003cp\u003ePaul drove at top speed out of the village.\u003c/p\u003e\n\u003cp\u003eflick and Ruby bounced on the metal floor of the van.\u003c/p\u003e\n\u003cp\u003eIt dawned slowly on Flick that they had accomplished their mission.\u003c/p\u003e\n\u003cp\u003eShe could hardly believe it.\u003c/p\u003e\n\u003cp\u003eShe thought of Greta and Jelly, both dead, and of Diana and Maude, dead or dying in some concentration camp, and she could not feel happy.\u003c/p\u003e\n\u003cp\u003eBut she felt a savage satisfaction as she saw again in her mind the blazing equipment chamber and the exploding parking lot.\u003c/p\u003e\n\u003cp\u003eShe looked at Ruby.\u003c/p\u003e\n\u003cp\u003eRuby grinned at her.\u003c/p\u003e\n\u003cp\u003e\"We did it,\" she said.\u003c/p\u003e\n\u003cp\u003eFlick nodded.\u003c/p\u003e\n\u003cp\u003eRuby put her arms around Flick and hugged her hard.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Flick said.\u003c/p\u003e\n\u003cp\u003e\"We did it.\"\u003c/p\u003e\n\u003cp\u003eDIETER PICKED HIMSELF up off the ground.\u003c/p\u003e\n\u003cp\u003eHe felt bruised all over, but he could walk.\u003c/p\u003e\n\u003cp\u003eThe chateau was ablaze, and the parking lot was a shambles.\u003c/p\u003e\n\u003cp\u003eThe women were screaming and panicking.\u003c/p\u003e\n\u003cp\u003eHe stared at the carnage all around.\u003c/p\u003e\n\u003cp\u003eThe Jackdaws had succeeded in their mission.\u003c/p\u003e\n\u003cp\u003eBut it was not over yet.\u003c/p\u003e\n\u003cp\u003eThey were still in France.\u003c/p\u003e\n\u003cp\u003eAnd if he could capture and interrogate Flick Clairet, he could yet turn defeat into victory.\u003c/p\u003e\n\u003cp\u003eSometime tonight, she must be planning to meet a small plane, in a field not far from Reims.\u003c/p\u003e\n\u003cp\u003eHe had to find out where and when.\u003c/p\u003e\n\u003cp\u003eAnd he knew who would tell him.\u003c/p\u003e\n\u003cp\u003eHer husband.\u003c/p\u003e\n\u003cp\u003eTHE LAST DAY Tuesday, June 6,1944 \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-51.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
