{"id":68379,"no":8,"title":"Page 8","content":"\u003cp\u003eGENERAL SIR BERNARD MONTGOMERY.\u003c/p\u003e\n\u003cp\u003ecommander of the 21st Army Group, which was about to invade France, had set up improvised headquarters in west London, at a school whose pupils had been evacuated to safer accommodation in the countryside.\u003c/p\u003e\n\u003cp\u003eBy coincidence, it was the school Monty himself had attended as a boy.\u003c/p\u003e\n\u003cp\u003eMeetings were held in the model room, and everyone sat on the schoolboys\u0027 hard wooden benches- generals and politicians and, on one famous occasion, the King himself.\u003c/p\u003e\n\u003cp\u003eThe Brits thought this was cute.\u003c/p\u003e\n\u003cp\u003ePaul Chancellor from Boston, Massachusetts, thought it was bullshit.\u003c/p\u003e\n\u003cp\u003eWhat would it have cost them to bring in a few chairs? He liked the British, by and large, but not when they were showing off how eccentric they were.\u003c/p\u003e\n\u003cp\u003ePaul was on Monty\u0027s personal staff.\u003c/p\u003e\n\u003cp\u003eA lot of people thought this was because his father was a general, but that was an unfair assumption.\u003c/p\u003e\n\u003cp\u003ePaul was comfortable with senior officers, partly because of his father, partly because before the war the U.S.\u003c/p\u003e\n\u003cp\u003eArmy had been the biggest customer for his business, which was making educational gramophone records, language courses mainly.\u003c/p\u003e\n\u003cp\u003eHe liked the military virtues of obedience, punctuality, and precision, but he could think for himself, too, and Monty had come to rely on him more and more.\u003c/p\u003e\n\u003cp\u003eHis area of responsibility was intelligence.\u003c/p\u003e\n\u003cp\u003eHe was an organizer.\u003c/p\u003e\n\u003cp\u003eHe made sure the reports Monty needed were on his desk when he wanted them, chased those that came late, set up meetings with key people, and made supplementary inquiries on the boss\u0027s behalf.\u003c/p\u003e\n\u003cp\u003eHe did have experience of clandestine work.\u003c/p\u003e\n\u003cp\u003eHe had been with the Office of Strategic Services, the American secret agency, and had served under cover in France and French-speaking North Africa.\u003c/p\u003e\n\u003cp\u003e(As a child he had lived in Paris, where Pa was military attach\u0026amp;#8218; at the U.S.\u003c/p\u003e\n\u003cp\u003eEmbassy.) Paul had been wounded six months ago in a shoot-out with the Gestapo in Marseilles.\u003c/p\u003e\n\u003cp\u003eOne bullet had taken off most of his left ear but harmed nothing other than his looks.\u003c/p\u003e\n\u003cp\u003eThe other smashed his right kneecap, which would never be the same again, and that was the real reason he had a desk job.\u003c/p\u003e\n\u003cp\u003eThe work was easy, by comparison with living on the run in occupied territory, but never dull.\u003c/p\u003e\n\u003cp\u003eThey were planning Operation Overlord, the invasion that would end the war.\u003c/p\u003e\n\u003cp\u003ePaul was one of a few hundred people in the world who knew the date, although many more could guess.\u003c/p\u003e\n\u003cp\u003eIn fact, there were three possible dates, based on the tides, the currents, the moon, and the hours of daylight.\u003c/p\u003e\n\u003cp\u003eThe invasion needed a late-rising moon, so that the army\u0027s initial movements would be shrouded in darkness, but there would be moonlight later, when the first paratroopers jumped from their planes and gliders.\u003c/p\u003e\n\u003cp\u003eA low tide at dawn was necessary to expose the obstacles Rommel had scattered on the beaches.\u003c/p\u003e\n\u003cp\u003eAnd another low tide before nightfall was needed for the landing of follow-up forces.\u003c/p\u003e\n\u003cp\u003eThese requirements left orJy a narrow window: the fleet could sail next Monday, June 5, or on the following Tuesday or Wednesday.\u003c/p\u003e\n\u003cp\u003eThe final decision would be made at the last minute, depending on the weather, by the Allied Supreme Commander, General Eisenhower.\u003c/p\u003e\n\u003cp\u003eThree years ago, Paul would have been desperately scheming for a place in the invasion force.\u003c/p\u003e\n\u003cp\u003eHe would have been itching for action and embarrassed at being a stay-at-home.\u003c/p\u003e\n\u003cp\u003eNow he was older and wiser.\u003c/p\u003e\n\u003cp\u003eFor one thing, he had paid his dues: in high school he had captained the side that won the Massachusetts championship, but he would never again kick a ball with his right foot.\u003c/p\u003e\n\u003cp\u003eMore importantly, he knew that his organizational talents could do more to win the war than his ability to shoot straight.\u003c/p\u003e\n\u003cp\u003eHe was thrilled to be part of the team that was planning the greatest invasion of all time.\u003c/p\u003e\n\u003cp\u003eWith the thrill came anxiety, of course.\u003c/p\u003e\n\u003cp\u003eBattles never went according to plan (although it was a weakness of Monty\u0027s to pretend that his did).\u003c/p\u003e\n\u003cp\u003ePaul knew that any error he made-a slip of the pen, a detail overlooked, a piece of intelligence not double-checked-could kill Allied troops.\u003c/p\u003e\n\u003cp\u003eDespite the huge size of the invasion force, the battle could still go either way, and the smallest of mistakes could tip the balance.\u003c/p\u003e\n\u003cp\u003eToday at ten a.m.\u003c/p\u003e\n\u003cp\u003ePaul had scheduled fifteen minutes on the French Resistance.\u003c/p\u003e\n\u003cp\u003eIt was Monty\u0027s idea.\u003c/p\u003e\n\u003cp\u003eHe was nothing if not a detail man.\u003c/p\u003e\n\u003cp\u003eThe way to win battles, he believed, was to refrain from fighting until all preparations were in place.\u003c/p\u003e\n\u003cp\u003eAt five to ten, Simon Fortescue came into the model room.\u003c/p\u003e\n\u003cp\u003eHe was one of the senior men at M16, the secret intelligence department.\u003c/p\u003e\n\u003cp\u003eA tall man in a pin-striped suit, he had a smoothly authoritative manner, but Paul doubted if he knew much about clandestine work in the real world.\u003c/p\u003e\n\u003cp\u003eHe was followed by John Graves, a nervous- looking civil servant from the Ministry of Economic Warfare, the government department that oversaw SOE.\u003c/p\u003e\n\u003cp\u003eGraves wore the Whitehall uniform of black jacket and striped gray pants.\u003c/p\u003e\n\u003cp\u003ePaul frowned.\u003c/p\u003e\n\u003cp\u003eHe had not invited Graves.\u003c/p\u003e\n\u003cp\u003e\"Mr.\u003c/p\u003e\n\u003cp\u003eGraves!\" he said sharply.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you had been asked to join us.\" \"I\u0027ll explain in a second,\" Graves said, and he sat down on a schoolboy bench, looking flustered, and opened his briefcase.\u003c/p\u003e\n\u003cp\u003ePaul was irritated.\u003c/p\u003e\n\u003cp\u003eMonty hated surprises.\u003c/p\u003e\n\u003cp\u003eBut Paul could not throw Graves out of the room.\u003c/p\u003e\n\u003cp\u003eA moment later, Monty walked in.\u003c/p\u003e\n\u003cp\u003eHe was a small man with a pointed nose and receding hair.\u003c/p\u003e\n\u003cp\u003eHis face was deeply lined either side of his close-clipped mustache.\u003c/p\u003e\n\u003cp\u003eHe was fifty-six, but looked older.\u003c/p\u003e\n\u003cp\u003ePaul liked him.\u003c/p\u003e\n\u003cp\u003eMonty was so meticulous that some people became impatient with him and called him an old woman.\u003c/p\u003e\n\u003cp\u003ePaul believed that Monty\u0027s fussiness saved men\u0027s lives.\u003c/p\u003e\n\u003cp\u003eWith Monty was an American Paul did not know.\u003c/p\u003e\n\u003cp\u003eMonty introduced him as General Pickford.\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s the chap from SUE?\" Monty snapped, looking at Paul.\u003c/p\u003e\n\u003cp\u003eGraves answered, \"I\u0027m afraid he was summoned by the Prime Minister, and sends his profound apologies.\u003c/p\u003e\n\u003cp\u003eI hope I\u0027ll be able to help.\u003c/p\u003e\n\u003cp\u003e\"I doubt it,\" Monty said crisply.\u003c/p\u003e\n\u003cp\u003ePaul groaned inwardly.\u003c/p\u003e\n\u003cp\u003eIt was a snafu, and he would be blamed.\u003c/p\u003e\n\u003cp\u003eBut there was something else going on here.\u003c/p\u003e\n\u003cp\u003eThe Brits were playing some game he did not know about.\u003c/p\u003e\n\u003cp\u003eHe watched them carefully, looking for clues.\u003c/p\u003e\n\u003cp\u003eSimon Fortescue said smoothly, \"I\u0027m sure I can fill in the gaps.\" Monty looked angry.\u003c/p\u003e\n\u003cp\u003eHe had promised General Pickford a briefing, and the key person was absent.\u003c/p\u003e\n\u003cp\u003eBut he did not waste time on recriminations.\u003c/p\u003e\n\u003cp\u003e\"In the coming battle,\" he said without further ado, \"the most dangerous moments will be the first.\" It was unusual for him to speak of dangerous moments, Paul thought.\u003c/p\u003e\n\u003cp\u003eHis way was to talk as if everything would go like clockwork.\u003c/p\u003e\n\u003cp\u003e\"We will be hanging by our fingertips from a cliff edge for a day.\" Or two days, Paul said to himself, or a week, or more.\u003c/p\u003e\n\u003cp\u003e\"This will be the enemy\u0027s best opportunity.\u003c/p\u003e\n\u003cp\u003eHe has only to stamp on our fingers with the heel of his jackboot.\" So easy, Paul thought.\u003c/p\u003e\n\u003cp\u003eOverlord was the largest military operation in human history: thousands of boats, hundreds of thousands of men, millions of dollars, tens of millions of bullets.\u003c/p\u003e\n\u003cp\u003eThe future of the world depended on the outcome.\u003c/p\u003e\n\u003cp\u003eYet this vast force could be repelled so easily, if things went wrong in the first few hours.\u003c/p\u003e\n\u003cp\u003e\"Anything we can do to slow the enemy\u0027s response will be of crucial importance,\" Monty finished, and he looked at Graves.\u003c/p\u003e\n\u003cp\u003e\"Well, F Section of SUE has more than a hundred agents in France-in fact, virtually all our people are over there,\" Graves began.\u003c/p\u003e\n\u003cp\u003e\"And under them, of course, are thousands of French Resistance fighters.\u003c/p\u003e\n\u003cp\u003eOver the last few weeks we have dropped them many hundreds of tons of guns, ammunition, and explosives.\" It was a bureaucrat\u0027s answer, Paul thought; it said everything and nothing.\u003c/p\u003e\n\u003cp\u003eGraves would have gone on, but Monty interrupted with the key question: \"How effective will they be?\" The civil servant hesitated, and Fortescue jumped in.\u003c/p\u003e\n\u003cp\u003e\"My expectations are modest,\" he said.\u003c/p\u003e\n\u003cp\u003e\"The performance of SOE is nothing if not uneven.\" There was a subtext here, Paul knew.\u003c/p\u003e\n\u003cp\u003eThe old-time professional spies at MI6 hated the newcomers of SUE with their swashbuckling style.\u003c/p\u003e\n\u003cp\u003eWhen the Resistance struck at German installations they stirred up Gestapo investigations which then sometimes caught M16\u0027s people.\u003c/p\u003e\n\u003cp\u003ePaul took SUE\u0027s side: striking at the enemy was the whole point of war.\u003c/p\u003e\n\u003cp\u003eWas that the game here? A bureaucratic spat between M16 and SOE? \"Any particular reason for your pessimism?\" Monty asked Fortescue.\u003c/p\u003e\n\u003cp\u003e\"Take last night\u0027s fiasco,\" Fortescue replied promptly.\u003c/p\u003e\n\u003cp\u003e\"A Resistance group under an SUE commander attacked a telephone exchange near Reims.\" General Pickford spoke for the first time.\u003c/p\u003e\n\u003cp\u003e\"I thought it was our policy not to attack telephone exchanges- we\u0027re going to need them ourselves if the invasion is successful.\" \"You\u0027re quite right,\" Monty said.\u003c/p\u003e\n\u003cp\u003e\"But Sainte-Cecile has been made an exception.\u003c/p\u003e\n\u003cp\u003eIt\u0027s an access node for the new cable route to Germany.\u003c/p\u003e\n\u003cp\u003eMost of the telephone and telex traffic between the High Command in Berlin and German forces in France passes through that building.\u003c/p\u003e\n\u003cp\u003eKnocking it out wouldn\u0027t do us much harm-we won\u0027t be calling Germany-but would wreak havoc with the enemy\u0027s communications.\" Pickford said, \"They\u0027ll switch to wireless communication.\" \"Exactly,\" said Monty.\u003c/p\u003e\n\u003cp\u003e\"Then we\u0027ll be able to read their signals.\" Fortescue put in.\u003c/p\u003e\n\u003cp\u003e\"Thanks to our code breakers at Bletchley.\" Paul knew, though not many other people did, that British intelligence had cracked the codes used by the Germans and therefore could read much of the enemy\u0027s radio traffic.\u003c/p\u003e\n\u003cp\u003eM16 was proud of this, although in truth they deserved little credit: the work had been done not by intelligence staff but by an irregular group of mathematicians and crossword-puzzle enthusiasts, many of whom would have been arrested if they had entered an M16 office in normal times.\u003c/p\u003e\n\u003cp\u003eSir Stewart Menzies, the foxhunting head of M16, hated intellectuals, communists, and homosexuals, but Alan Turing, the mathematical genius who led the code breakers, was all three.\u003c/p\u003e\n\u003cp\u003eHowever, Pickford was right: if the Germans could not use the phone lines, they would have to use radio, and then the Allies would know what they were saying.\u003c/p\u003e\n\u003cp\u003eDestroying the telephone exchange at Sainte-Cdcile would give the Allies a crucial advantage.\u003c/p\u003e\n\u003cp\u003eBut the mission had gone wrong.\u003c/p\u003e\n\u003cp\u003e\"Who was in charge?\" Monty asked.\u003c/p\u003e\n\u003cp\u003eGraves said, \"I haven\u0027t seen a full report-\" \"I can tell you,\" Fortescue interjected.\u003c/p\u003e\n\u003cp\u003e\"Major Clairet.\" He paused.\u003c/p\u003e\n\u003cp\u003e\"A girl.\" Paul had heard of Felicity Clairet.\u003c/p\u003e\n\u003cp\u003eShe was something of a legend among the small group who knew the secret of the Allies\u0027 clandestine war.\u003c/p\u003e\n\u003cp\u003eShe had survived under cover in France longer than anyone.\u003c/p\u003e\n\u003cp\u003eHer code name was Leopardess, and people said she moved around the streets of occupied France with the silent footsteps of a dangerous cat.\u003c/p\u003e\n\u003cp\u003eThey also said she was a pretty girl with a heart of stone.\u003c/p\u003e\n\u003cp\u003eShe had killed more than once.\u003c/p\u003e\n\u003cp\u003e\"And what happened?\" Monty said.\u003c/p\u003e\n\u003cp\u003e\"Poor planning, an inexperienced commander, and a lack of discipline among the men all played their part,\" Fortescue replied.\u003c/p\u003e\n\u003cp\u003e\"The building was not heavily\u003c/p\u003e\n\u003cp\u003eguarded, but the Germans there are trained troops, and they simply wiped out the Resistance force.\" Monty looked angry.\u003c/p\u003e\n\u003cp\u003ePickford said, \"Looks like we shouldn\u0027t rely too heavily on the French Resistance to disrupt Rommel\u0027s supply lines.\" Fortescue nodded.\u003c/p\u003e\n\u003cp\u003e\"Bombing is the more reliable means to that end.\" \"I\u0027m not sure that\u0027s quite fair,\" Graves protested feebly.\u003c/p\u003e\n\u003cp\u003e\"Bomber Command has its successes and failures, too.\u003c/p\u003e\n\u003cp\u003eAnd SOE is a good deal cheaper.\" \"We\u0027re not here to be fair to people, for God\u0027s sake,\" Monty growled.\u003c/p\u003e\n\u003cp\u003e\"We just want to win the war.\" He stood up.\u003c/p\u003e\n\u003cp\u003e~\u0027I think we\u0027ve heard enough,\" he said to General Pickford.\u003c/p\u003e\n\u003cp\u003eGraves said, \"But what shall we do about the telephone exchange? SOE has come up with a new plan-\" \"Good God,\" Fortescue interrupted.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t want another balls-up, do we?\" \"Bomb it,\" said Monty.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve tried that,\" Graves said.\u003c/p\u003e\n\u003cp\u003e\"They hit the building, but the damage was not sufficient to put the telephone exchange out of action for longer than a few hours.\" \"Then bomb it again,\" said Monty, and he walked out.\u003c/p\u003e\n\u003cp\u003eGraves threw a look of petulant fury at the man from M16.\u003c/p\u003e\n\u003cp\u003e\"Really, Fortescue,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I mean to say.\u003c/p\u003e\n\u003cp\u003ereally.\" Fortescue did not respond.\u003c/p\u003e\n\u003cp\u003eThey all left the room.\u003c/p\u003e\n\u003cp\u003eIn the hallway outside, two people were waiting: a man of about fifty in a tweed jacket, and a short blonde woman wearing a worn blue cardigan over a faded cotton dress.\u003c/p\u003e\n\u003cp\u003eStanding in front of a display of sporting trophies, they looked almost like a head teacher chatting to a schoolgirl, except that the girl wore a bright yellow scarf tied with a touch of style that looked, to Paul, distinctly French.\u003c/p\u003e\n\u003cp\u003eFortescue hurried past them, but Graves stopped.\u003c/p\u003e\n\u003cp\u003e\"They turned you down,\" he said.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re going to bomb it again.\" Paul guessed that the woman was the Leopardess, and he looked at her with interest.\u003c/p\u003e\n\u003cp\u003eShe was small and slim, with curly blonde hair cut short, and-Paul noticed- rather lovely green eyes.\u003c/p\u003e\n\u003cp\u003eHe would not have called her pretty: her face was too grown-up for that.\u003c/p\u003e\n\u003cp\u003eThe initial schoolgirl impression was fleeting.\u003c/p\u003e\n\u003cp\u003eThere was an aggressive look to her straight nose and chisel-shaped chin.\u003c/p\u003e\n\u003cp\u003eAnd there was something sexy about her, something that made Paul think about the slight body under the shabby dress.\u003c/p\u003e\n\u003cp\u003eShe reacted with indignation to Grave\u0027s statement.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no point in bombing the place from the air, the basement is reinforced.\u003c/p\u003e\n\u003cp\u003eFor God\u0027s sake, why did they make that decision?\" \"Perhaps you should ask this gentleman,\" Graves said, turning to Paul.\u003c/p\u003e\n\u003cp\u003e\"Major Chancellor, meet Major Clairet and Colonel Thwaite.\" Paul was annoyed at being put in the position of defending someone else\u0027s decision.\u003c/p\u003e\n\u003cp\u003eCaught off guard, he replied with undiplomatic frankness, \"I don\u0027t see that there\u0027s much to explain,\" he said brusquely.\u003c/p\u003e\n\u003cp\u003e\"You screwed up and you\u0027re not being given a second chance.\" The woman glared up at him-she was a foot shorter than he-and spoke angrily.\u003c/p\u003e\n\u003cp\u003e\"Screwed up?\" she said.\u003c/p\u003e\n\u003cp\u003e\"What the hell do you mean by that?\" Paul felt himself flush.\u003c/p\u003e\n\u003cp\u003e\"Maybe General Montgomery was misinformed, but wasn\u0027t this the first time you had commanded an action of this kind, Major?\" \"Is that what you\u0027ve been told? That it was my lack of experience?\" She was beautiful, he saw now.\u003c/p\u003e\n\u003cp\u003eAnger made her eyes wide and her cheeks pink.\u003c/p\u003e\n\u003cp\u003eBut she was being very rude, so he decided to give it to her with both barrels.\u003c/p\u003e\n\u003cp\u003e\"That and poor planning-\" \"There was nothing wrong with the damn plan!\" \"-and the fact that trained troops were defending the place against an undisciplined force.\" \"You arrogant pig!\" Paul took an involuntary step back.\u003c/p\u003e\n\u003cp\u003eHe had never been spoken to this way by a woman.\u003c/p\u003e\n\u003cp\u003eShe may be five feet nothing, he thought, but I bet she scares the damn Nazis.\u003c/p\u003e\n\u003cp\u003eLooking at her furious face, he realized that she was most angry with herself \"You think it\u0027s your fault,\" he said.\u003c/p\u003e\n\u003cp\u003e\"No one gets this mad about other people\u0027s mistakes.\" It was her turn to be taken aback.\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open, and she was speechless.\u003c/p\u003e\n\u003cp\u003eColonel Thwaite spoke for the first time.\u003c/p\u003e\n\u003cp\u003e\"Calm down, Flick, for God\u0027s sake,\" he said.\u003c/p\u003e\n\u003cp\u003eTurning to Paul, he went on, \"Let me guess-this account was given to you by Simon Fortescue of M16, was it not?\" \"That\u0027s correct,\" Paul said stiffly.\u003c/p\u003e\n\u003cp\u003e\"Did he mention that the attack plan was based on intelligence supplied by his organization?\" \"I don\u0027t believe he did.\" \"I thought not,\" said Thwaite.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Major, I don\u0027t need to trouble you any further.\" Paul did not feel the conversation was really over, but he had been dismissed by a senior officer, and he had no choice but to walk away.\u003c/p\u003e\n\u003cp\u003eHe had obviously got caught in the crossfire of a turf war between M16 and SOE.\u003c/p\u003e\n\u003cp\u003eHe felt most angry with Fortescue, who had used the meeting to score points.\u003c/p\u003e\n\u003cp\u003eHad Monty made the right decision in choosing to bomb the telephone exchange rather than let SOE have another go at it? Paul was not sure.\u003c/p\u003e\n\u003cp\u003eAs he turned into his own office he glanced back.\u003c/p\u003e\n\u003cp\u003eMajor Clairet was still arguing with Colonel Thwaite, her voice low but her face animated, expressing outrage with large gestures.\u003c/p\u003e\n\u003cp\u003eShe stood like a man, hand on hip, leaning forward, making her point with a belligerent forefinger, but all the same there was something enchanting about her.\u003c/p\u003e\n\u003cp\u003ePaul wondered what it would be like to hold her in his arms and run his hands over her lithe body.\u003c/p\u003e\n\u003cp\u003eAlthough she\u0027s tough, he thought, she\u0027s all woman.\u003c/p\u003e\n\u003cp\u003eBut was she right? Was bombing futile? He decided to ask some more questions. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-8.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
