{"id":68380,"no":9,"title":"Page 9","content":"\u003cp\u003eTHE VAST, SOOTY bulk of the cathedral loomed over the center of Reims like a divine reproach.\u003c/p\u003e\n\u003cp\u003eDieter Franck\u0027s sky-blue Hispano-Suiza pulled up at midday outside the Hotel Frankfort, taken over by the German occupiers.\u003c/p\u003e\n\u003cp\u003eDieter got out and glanced up at the stubby twin towers of the great church.\u003c/p\u003e\n\u003cp\u003eThe original medieval design had featured elegant pointed spires, which had never been built for lack of money.\u003c/p\u003e\n\u003cp\u003eSo mundane obstacles frustrated the holiest of aspirations.\u003c/p\u003e\n\u003cp\u003eDieter told Lieutenant Hesse to drive to the chateau at Sainte-Cecile and make sure the Gestapo were ready to cooperate.\u003c/p\u003e\n\u003cp\u003eHe did not want to risk being repulsed a second time by Major Weber.\u003c/p\u003e\n\u003cp\u003eHesse drove off, and Dieter went up to the suite where he had left Stephanie last night.\u003c/p\u003e\n\u003cp\u003eShe got up from her chair as he walked in.\u003c/p\u003e\n\u003cp\u003eHe drank in the welcome sight.\u003c/p\u003e\n\u003cp\u003eHer red hair fell on bare shoulders, and she wore a chestnut silk negligee and high-heeled slippers.\u003c/p\u003e\n\u003cp\u003eHe kissed her hungrily and ran his hands over her slim body, grateful for the gift of her beauty.\u003c/p\u003e\n\u003cp\u003e\"How nice that you\u0027re so pleased to see me,\" she said with a smile.\u003c/p\u003e\n\u003cp\u003eThey spoke French together, as always.\u003c/p\u003e\n\u003cp\u003eDieter inhaled the scent of her.\u003c/p\u003e\n\u003cp\u003e\"Well, you smell better than Hans Hesse, especially when he\u0027s been up all night.\" She brushed his hair back with a soft hand.\u003c/p\u003e\n\u003cp\u003e\"You always make fun.\u003c/p\u003e\n\u003cp\u003eBut you wouldn\u0027t have protected Hans with your own body.\" \"True.\" He sighed and let her go.\u003c/p\u003e\n\u003cp\u003e\"Christ, I\u0027m tired.\" \"Come to bed.\" He shook his head.\u003c/p\u003e\n\u003cp\u003e\"I have to interrogate the prisoners.\u003c/p\u003e\n\u003cp\u003eHesse\u0027s coming back for me in an hour.\" He slumped on the couch.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get you something to eat.\" She pressed the bell, and a minute later an elderly French waiter tapped at the door.\u003c/p\u003e\n\u003cp\u003eStephanie knew Dieter well enough to order for him.\u003c/p\u003e\n\u003cp\u003eShe asked for a plate of ham with warm rolls and potato salad.\u003c/p\u003e\n\u003cp\u003e\"Some wine?\" she asked him.\u003c/p\u003e\n\u003cp\u003e\"No-it\u0027ll send me to sleep.\" \"A pot of coffee, then,\" she told the waiter.\u003c/p\u003e\n\u003cp\u003eWhen the man had gone, she sat on the couch beside Dieter and took his hand.\u003c/p\u003e\n\u003cp\u003e\"Did everything go according to plan?\" \"Yes.\u003c/p\u003e\n\u003cp\u003eRommel was quite complimentary to me.\" He frowned anxiously.\u003c/p\u003e\n\u003cp\u003e\"I just hope I can live up to the promises I made him.\" \"I\u0027m sure you will.\" She did not ask for details.\u003c/p\u003e\n\u003cp\u003eShe knew he would tell her as much as he wanted to and no more.\u003c/p\u003e\n\u003cp\u003eHe looked fondly at her, wondering whether to say what was on his mind.\u003c/p\u003e\n\u003cp\u003eIt might spoil the pleasant atmosphere-but it needed to be said.\u003c/p\u003e\n\u003cp\u003eHe sighed again.\u003c/p\u003e\n\u003cp\u003e\"If the invasion is successful, and the Allies win back France, it will be the end for you and me.\u003c/p\u003e\n\u003cp\u003eYou know that.\" She winced, as if at a sudden pain, and let go of his hand.\u003c/p\u003e\n\u003cp\u003e\"Do I?\" He knew that her husband had been killed early in the war, and they had had no children.\u003c/p\u003e\n\u003cp\u003e\"Do you have any family at all?\" he asked her.\u003c/p\u003e\n\u003cp\u003e\"My parents died years ago.\u003c/p\u003e\n\u003cp\u003eI have a sister in Montreal.\" \"Maybe we should be thinking about how to send you over there.\" She shook her head.\u003c/p\u003e\n\u003cp\u003e\"No.\" \"Why?\" She would not meet his eye.\u003c/p\u003e\n\u003cp\u003e\"I just wish the war would be over,\" she muttered.\u003c/p\u003e\n\u003cp\u003e\"No, you don\u0027t.\" She showed a rare flash of irritation.\u003c/p\u003e\n\u003cp\u003e\"Of course I do.\" \"How uncharacteristically conventional of you,\" he said with a hint of scorn.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t possibly think war is a good thing!\" \"You and I would not be together, were it not for the war.\" \"But what about all the suffering?\" \"I\u0027m an existentialist.\u003c/p\u003e\n\u003cp\u003eWar enables people to be what they really are: the sadists become torturers, the psychopaths make brave front-line troops, the bullies and the victims alike have scope to play their roles to the hilt, and the whores are always busy.\" She looked angry.\u003c/p\u003e\n\u003cp\u003e\"That tells me pretty clearly what part I play.\" He stroked her soft cheek and touched her lips with the tip of his finger.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a courtesan-and very good at it.\" She moved her head away.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t mean any of this.\u003c/p\u003e\n\u003cp\u003eYou\u0027re improvising on a tune, the way you do when you sit at the piano.\" He smiled and nodded: he could play a little jazz, much to his father\u0027s dismay.\u003c/p\u003e\n\u003cp\u003eThe analogy was apt.\u003c/p\u003e\n\u003cp\u003eHe was trying out ideas, rather than expressing a firm conviction.\u003c/p\u003e\n\u003cp\u003e\"Perhaps you\u0027re right.\" Her anger evaporated, and she looked sad.\u003c/p\u003e\n\u003cp\u003e\"Did you mean the part about us separating, if the Germans leave France?\" He put his arm around her shoulders and pulled her to him.\u003c/p\u003e\n\u003cp\u003eShe relaxed and laid her head on his chest.\u003c/p\u003e\n\u003cp\u003eHe kissed the top of her head and stroked her hair.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not going to happen,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Are you certain?\" \"I guarantee it.\" It was the second time today he had made a promise he might not be able to keep.\u003c/p\u003e\n\u003cp\u003eThe waiter returned with his lunch, and the spell was broken.\u003c/p\u003e\n\u003cp\u003eDieter was almost too tired to be hungry, but he ate a few mouthfuls and drank all the coffee.\u003c/p\u003e\n\u003cp\u003eAfterwards he washed and shaved, and then he felt better.\u003c/p\u003e\n\u003cp\u003eAs he was buttoning a clean uniform shirt, Lieutenant Hesse tapped at the door.\u003c/p\u003e\n\u003cp\u003eDieter kissed Stephanie and went out.\u003c/p\u003e\n\u003cp\u003eThe car was diverted around a blocked street: there had been another bombing raid overnight, and a whole row of houses near the railway station had been destroyed.\u003c/p\u003e\n\u003cp\u003eThey got out of town and headed for SainteCecile.\u003c/p\u003e\n\u003cp\u003eDieter had told Rommel that the interrogation of the prisoners might enable him to cripple the Resistance before the invasion-but Rommel, like any military commander, took a maybe for a promise and would now expect results.\u003c/p\u003e\n\u003cp\u003eUnfortunately, there was nothing guaranteed about an interrogation.\u003c/p\u003e\n\u003cp\u003eClever prisoners told lies that were impossible to check.\u003c/p\u003e\n\u003cp\u003eSome found ingenious ways to kill themselves before the torture became unbearable.\u003c/p\u003e\n\u003cp\u003eIf security was really tight in their particular Resistance circuit, each would know only the minimum about the others, and have little information of value.\u003c/p\u003e\n\u003cp\u003eWorst of all, they might have been fed false information by the perfidious Allies, so that when they finally broke under torture, what they said was part of a deception plan.\u003c/p\u003e\n\u003cp\u003eDieter began to put himself in the mood.\u003c/p\u003e\n\u003cp\u003eHe needed to be completely hard-hearted and calculating.\u003c/p\u003e\n\u003cp\u003eHe must not allow himself to be touched by the physical and mental suffering he was about to inflict on human beings.\u003c/p\u003e\n\u003cp\u003eAll that mattered was whether it worked.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes and felt a profound calm settle over him, a familiar bone-deep chill that he sometimes thought must be like the cold of death itself.\u003c/p\u003e\n\u003cp\u003eThe car pulled into the grounds of the chateau.\u003c/p\u003e\n\u003cp\u003eWorkmen were repairing the smashed glass in the windows and filling the holes made by grenades.\u003c/p\u003e\n\u003cp\u003eIn the ornate hall, the telephonists murmured into their microphones in a perpetual undertone.\u003c/p\u003e\n\u003cp\u003eDieter marched through the perfectly proportioned rooms of the east wing, with Hans Hesse in tow.\u003c/p\u003e\n\u003cp\u003eThey went down the stairs to the fortified basement.\u003c/p\u003e\n\u003cp\u003eThe sentry at the door saluted and made no attempt to detain Dieter, who was in uniform.\u003c/p\u003e\n\u003cp\u003eHe found the door marked Interrogation Center and went in.\u003c/p\u003e\n\u003cp\u003eIn the outer room, Willi Weber sat at the table.\u003c/p\u003e\n\u003cp\u003eDieter barked, \"Heil Hitler!\" and saluted, forcing Weber to stand.\u003c/p\u003e\n\u003cp\u003eThen Dieter pulled out a chair, sat down, and said, \"Please be seated, Major.\" Weber was furious at being invited to sit in his own headquarters, but he had no choice.\u003c/p\u003e\n\u003cp\u003eDieter said, \"How many prisoners do we have?\" \"Three.\" Dieter was disappointed.\u003c/p\u003e\n\u003cp\u003e\"So few?\" \"We killed eight of the enemy in the skirmish.\u003c/p\u003e\n\u003cp\u003eTwo more died of their wounds overnight.\" Dieter grunted with dismay.\u003c/p\u003e\n\u003cp\u003eHe had ordered that the wounded be kept alive.\u003c/p\u003e\n\u003cp\u003eBut there was no point now in questioning Weber about their treatment.\u003c/p\u003e\n\u003cp\u003eWeber went on, \"I believe two escaped-\" \"Yes,\" Dieter said.\u003c/p\u003e\n\u003cp\u003e\"The woman in the square, and the man she carried away.\" \"Exactly.\u003c/p\u003e\n\u003cp\u003eSo, from a total of fifteen attackers, we have three prisoners.\" \"Where are they?\" Weber looked shifty.\u003c/p\u003e\n\u003cp\u003e\"Two are in the cells.\" Dieter narrowed his eyes.\u003c/p\u003e\n\u003cp\u003e\"And the third?\" Weber inclined his head toward the inner room.\u003c/p\u003e\n\u003cp\u003e\"The third is under interrogation at this moment.\" Dieter got up, apprehensive, and opened the door.\u003c/p\u003e\n\u003cp\u003eThe hunched figure of Sergeant Becker stood just inside the room, holding in his hand a wooden club like a large policeman\u0027s truncheon.\u003c/p\u003e\n\u003cp\u003eHe was sweating and breathing hard, as if he had been taking vigorous exercise.\u003c/p\u003e\n\u003cp\u003eHe was staring at a prisoner who was tied to a post.\u003c/p\u003e\n\u003cp\u003eDieter looked at the prisoner, and his fears were confirmed.\u003c/p\u003e\n\u003cp\u003eDespite his self-imposed calm, he grimaced with revulsion.\u003c/p\u003e\n\u003cp\u003eThe prisoner was the young woman, Genevieve, who had carried a Sten gun under her coat.\u003c/p\u003e\n\u003cp\u003eShe was naked, tied to the pillar by a rope that passed under her arms and supported her slumped weight.\u003c/p\u003e\n\u003cp\u003eHer face was so swollen that she could not have opened her eyes.\u003c/p\u003e\n\u003cp\u003eBlood from her mouth covered her chin and most of her chest.\u003c/p\u003e\n\u003cp\u003eHer body was discolored with angry bruises.\u003c/p\u003e\n\u003cp\u003eOne arm hung at an odd angle, apparently dislocated at the shoulder.\u003c/p\u003e\n\u003cp\u003eHer pubic hair was matted with blood.\u003c/p\u003e\n\u003cp\u003eDieter said to Becker, \"What has she told you?\" Becker looked embarrassed.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" Dieter nodded, suppressing his rage.\u003c/p\u003e\n\u003cp\u003eIt was as he had expected.\u003c/p\u003e\n\u003cp\u003eHe went close to the woman.\u003c/p\u003e\n\u003cp\u003e\"Genevieve, listen to me,\" he said in French.\u003c/p\u003e\n\u003cp\u003eShe showed no sign of having heard.\u003c/p\u003e\n\u003cp\u003e\"Would you like to rest now?\" he tried.\u003c/p\u003e\n\u003cp\u003eThere was no response.\u003c/p\u003e\n\u003cp\u003eHe turned around.\u003c/p\u003e\n\u003cp\u003eWeber was standing in the doorway, looking defiant.\u003c/p\u003e\n\u003cp\u003eDieter, coldly furious, said, \"You were expressly told that I would conduct the interrogation.\" \"We were ordered to give you access,\" Weber replied with smug pedantry.\u003c/p\u003e\n\u003cp\u003e\"We were not prohibited from questioning the prisoners ourselves.\" \"And are you satisfied with the results you have achieved?\" Weber did not answer.\u003c/p\u003e\n\u003cp\u003eDieter said, \"What about the other two?\" \"We have not yet begun their interrogation.\" \"Thank God for that.\" Dieter was nonetheless dismayed.\u003c/p\u003e\n\u003cp\u003eHe had expected half a dozen subjects, not two.\u003c/p\u003e\n\u003cp\u003e\"Take me to them.\" Weber nodded at Becker, who put down his club and led the way out of the room.\u003c/p\u003e\n\u003cp\u003eIn the bright lights of the corridor, Dieter could see the bloodstains on Becker\u0027s uniform.\u003c/p\u003e\n\u003cp\u003eThe sergeant stopped at a door with a judas peephole.\u003c/p\u003e\n\u003cp\u003eDieter slid back the panel and looked inside.\u003c/p\u003e\n\u003cp\u003eIt was a bare room with a dirt floor.\u003c/p\u003e\n\u003cp\u003eThe only item of furniture was a bucket in the corner.\u003c/p\u003e\n\u003cp\u003eTwo men sat on the ground, not talking, staring into space.\u003c/p\u003e\n\u003cp\u003eDieter studied them carefully.\u003c/p\u003e\n\u003cp\u003eHe had seen both yesterday.\u003c/p\u003e\n\u003cp\u003eThe older one was Gaston, who had set the charges.\u003c/p\u003e\n\u003cp\u003eHe had a large piece of sticking-plaster covering a scalp wound that looked superficial.\u003c/p\u003e\n\u003cp\u003eThe other was very young, about seventeen, and Dieter recalled that his name was Bertrand.\u003c/p\u003e\n\u003cp\u003eHe had no visible injuries, but Dieter, recalling the skirmish, thought he might have been stunned by the explosion of a hand grenade.\u003c/p\u003e\n\u003cp\u003eDieter watched them for a while, taking time to think.\u003c/p\u003e\n\u003cp\u003eHe had to do this right.\u003c/p\u003e\n\u003cp\u003eHe could not afford to waste another captive: these two were the only assets left.\u003c/p\u003e\n\u003cp\u003eThe kid would be scared, he foresaw, but might withstand a lot of pain.\u003c/p\u003e\n\u003cp\u003eThe other was too old for serious torture-he might die before he cracked-but he would be softhearted.\u003c/p\u003e\n\u003cp\u003eDieter began to see a strategy for interrogating them.\u003c/p\u003e\n\u003cp\u003eHe closed the judas and returned to the interview room.\u003c/p\u003e\n\u003cp\u003eBecker followed, reminding him again of a stupid but dangerous dog.\u003c/p\u003e\n\u003cp\u003eDieter said, \"Sergeant Becker, untie the woman and put her in the cell with the other two.\" Weber protested, \"A woman in a man\u0027s cell?\" Dieter stared at him incredulously.\u003c/p\u003e\n\u003cp\u003e\"Do you think she will feel the indignity?\" Becker went into the torture chamber and reemerged carrying the broken body of Genevieve.\u003c/p\u003e\n\u003cp\u003eDieter said, \"Make sure the old man gets a good look at her, then bring him here.\" Becker went out.\u003c/p\u003e\n\u003cp\u003eDieter decided he would prefer to get rid of Weber.\u003c/p\u003e\n\u003cp\u003eHowever, he knew that if he gave a direct order, Weber would resist.\u003c/p\u003e\n\u003cp\u003eSo he said, \"I think you should remain here to witness the interrogation.\u003c/p\u003e\n\u003cp\u003eYou could learn a lot from my techniques.\" As Dieter had expected, Weber did the opposite.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Becker can keep me informed.\" Dieter faked an indignant expression, and Weber went out.\u003c/p\u003e\n\u003cp\u003eDieter caught the eye of Lieutenant Hesse, who had quietly taken a seat in the corner.\u003c/p\u003e\n\u003cp\u003eHesse understood how Dieter had manipulated Weber and was looking admiringly at Dieter.\u003c/p\u003e\n\u003cp\u003eDieter shrugged.\u003c/p\u003e\n\u003cp\u003e\"Sometimes it\u0027s too easy,\" he said.\u003c/p\u003e\n\u003cp\u003eBecker returned with Gaston.\u003c/p\u003e\n\u003cp\u003eThe older man was pale.\u003c/p\u003e\n\u003cp\u003eNo doubt he had been badly shocked by the sight of Genevieve.\u003c/p\u003e\n\u003cp\u003eDieter said in German, \"Please have a seat.\u003c/p\u003e\n\u003cp\u003eDo you like to smoke?\" Gaston looked blank.\u003c/p\u003e\n\u003cp\u003eThat established that he did not understand German, which was worth knowing.\u003c/p\u003e\n\u003cp\u003eDieter motioned him to a seat and offered him cigarettes and matches.\u003c/p\u003e\n\u003cp\u003eGaston took a cigarette and lit it with shaking hands.\u003c/p\u003e\n\u003cp\u003eSome prisoners broke at this stage, before torture, just from fear of what would happen.\u003c/p\u003e\n\u003cp\u003eDieter hoped that might be the case today.\u003c/p\u003e\n\u003cp\u003eHe had shown Gaston the alternatives: on one hand, the dreadful sight of Genevieve; on the other, cigarettes and kindness.\u003c/p\u003e\n\u003cp\u003eNow he spoke in French, using a friendly tone.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to ask you some questions.\" \"I don\u0027t know anything,\" Gaston said.\u003c/p\u003e\n\u003cp\u003e\"Oh, I think you do,\" Dieter said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in your sixties, and you\u0027ve probably lived in or around Reims all your life.\" Gaston did not deny this.\u003c/p\u003e\n\u003cp\u003eDieter went on: \"I realize that the members of a Resistance cell use code names and give one another the minimum of personal information, as a security precaution.\" Gaston involuntarily gave a slight nod of agreement.\u003c/p\u003e\n\u003cp\u003e\"But you\u0027ve known most of these people for decades.\u003c/p\u003e\n\u003cp\u003eA man may call himself Elephant or Priest or Aubergine when the Resistance meet, but you know his face, and you recognize him as Jean-Pierre the postman, who lives in the rue du Parc and surreptitiously visits the widow Martineau on Tuesdays when his wife thinks he is playing bowls.\" Gaston looked away, unwilling to meet Dieter\u0027s eye, confirming that Dieter was right.\u003c/p\u003e\n\u003cp\u003eDieter went on, \"I want you to understand that you are in control of everything that happens here.\u003c/p\u003e\n\u003cp\u003ePain, or the relief of pain; the sentence of death, or reprieve; all depend on your choices.\" He saw with satisfaction that Gaston looked even more terrified.\u003c/p\u003e\n\u003cp\u003e\"You will answer my questions,\" he went on.\u003c/p\u003e\n\u003cp\u003e\"Everyone does, in the end.\u003c/p\u003e\n\u003cp\u003eThe only imponderable is how soon.\" This was the moment when a man might break down, but Gaston did not.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you anything,\" he said in a near-whisper.\u003c/p\u003e\n\u003cp\u003eHe was scared, but he still had some courage left, and he was not going to give up without a fight.\u003c/p\u003e\n\u003cp\u003eDieter shrugged.\u003c/p\u003e\n\u003cp\u003eIt was to be the hard way, then.\u003c/p\u003e\n\u003cp\u003eHe spoke to Becker in German.\u003c/p\u003e\n\u003cp\u003e\"Go back to the cell.\u003c/p\u003e\n\u003cp\u003eMake the boy strip naked.\u003c/p\u003e\n\u003cp\u003eBring him here and tie him to the pillar in the next room.\" \"Very good, Major,\" Becker said eagerly.\u003c/p\u003e\n\u003cp\u003eDieter turned back to Gaston.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to tell me the names and code names of all the men and women who were with you yesterday, and any others in your Resistance circuit.\" Gaston shook his head, but Dieter ignored that.\u003c/p\u003e\n\u003cp\u003e\"I want to know the address of every member, and of every house used by members of the circuit.\" Gaston drew hard on his cigarette and stared at the glowing end.\u003c/p\u003e\n\u003cp\u003eIn fact, these were not the most important questions.\u003c/p\u003e\n\u003cp\u003eDieter\u0027s main aim was to get information that would lead him to other Resistance circuits.\u003c/p\u003e\n\u003cp\u003eBut he did not want Gaston to know that.\u003c/p\u003e\n\u003cp\u003eA moment later, Becker returned with Bertrand.\u003c/p\u003e\n\u003cp\u003eGaston stared openmouthed as the naked boy was marched through the interview room into the chamber beyond.\u003c/p\u003e\n\u003cp\u003eDieter stood up.\u003c/p\u003e\n\u003cp\u003eHe said to Hesse, \"Keep an eye on this old man.\" Then he followed Becker into the torture chamber.\u003c/p\u003e\n\u003cp\u003eHe was careful to leave the door a little ajar so that Gaston could hear everything.\u003c/p\u003e\n\u003cp\u003eBecker tied Bertrand to the pillar.\u003c/p\u003e\n\u003cp\u003eBefore Dieter could intervene, Becker punched Bertrand in the stomach.\u003c/p\u003e\n\u003cp\u003eIt was a powerful blow from a strong man, and it made a sickening thud.\u003c/p\u003e\n\u003cp\u003eThe young man groaned and writhed in agony.\u003c/p\u003e\n\u003cp\u003e\"No, no, no,\" Dieter said.\u003c/p\u003e\n\u003cp\u003eAs he had expected, Becker\u0027s approach was completely unscientific.\u003c/p\u003e\n\u003cp\u003eA strong young man could withstand being punched almost indefinitely.\u003c/p\u003e\n\u003cp\u003e\"First, you blindfold him.\" He produced a large cotton bandana from his pocket and tied it over Bertrand\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"This way, every blow comes as a dreadful shock, and every moment between blows is an agony of anticipation.\" Becker picked up his wooden club.\u003c/p\u003e\n\u003cp\u003eDieter nodded, and Becker swung the club, hitting the side of the victim\u0027s head with a loud crack of solid wood on skin and bone.\u003c/p\u003e\n\u003cp\u003eBertrand cried out in pain and fear.\u003c/p\u003e\n\u003cp\u003e\"No, no,\" Dieter said again.\u003c/p\u003e\n\u003cp\u003e\"Never hit the head.\u003c/p\u003e\n\u003cp\u003eYou may dislocate the jaw, preventing the subject from speaking.\u003c/p\u003e\n\u003cp\u003eWorse, you may damage the brain, then nothing he says will be of any value.\" He took the wooden club from Becker and replaced it in the umbrella stand.\u003c/p\u003e\n\u003cp\u003eFrom the selection of weapons there he chose a steel crowbar and handed it to Becker.\u003c/p\u003e\n\u003cp\u003e\"Now, remember, the object is to inflict unbearable agony without endangering the subject\u0027s life or his ability to tell us what we need to know.\u003c/p\u003e\n\u003cp\u003eAvoid vital organs.\u003c/p\u003e\n\u003cp\u003eConcentrate on the bony parts: ankles, shins, kneecaps, fingers, elbows, shoulders, ribs.\" A crafty look came over Becker\u0027s face.\u003c/p\u003e\n\u003cp\u003eHe walked around the pillar, then, taking careful aim, struck hard at Bertrand\u0027s elbow with the steel bar.\u003c/p\u003e\n\u003cp\u003eThe boy gave a scream of real agony, a sound Dieter recognized.\u003c/p\u003e\n\u003cp\u003eBecker looked pleased.\u003c/p\u003e\n\u003cp\u003eGod forgive me, Dieter thought, for teaching this brute how to inflict pain more efficiently.\u003c/p\u003e\n\u003cp\u003eOn Dieter\u0027s orders, Becker struck at Bertrand\u0027s bony shoulder, then his hand, then his ankle.\u003c/p\u003e\n\u003cp\u003eDieter made Becker pause between blows, allowing just enough time for the pain to ease slightly and for the subject to begin to dread the next stroke.\u003c/p\u003e\n\u003cp\u003eBertrand began to appeal for mercy.\u003c/p\u003e\n\u003cp\u003e\"No more, please,\" he implored, hysterical with pain and fear.\u003c/p\u003e\n\u003cp\u003eBecker raised the crowbar, but Dieter stopped him.\u003c/p\u003e\n\u003cp\u003eHe wanted the begging to go on.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t hit me again,\" Bertrand cried.\u003c/p\u003e\n\u003cp\u003e\"Please, please.\" Dieter said to Becker, \"It is often a good idea to break a leg early in the interview.\u003c/p\u003e\n\u003cp\u003eThe pain is quite excruciating, especially when the broken bone is struck again.\" He selected a sledgehammer from the umbrella stand.\u003c/p\u003e\n\u003cp\u003e\"Just below the knee,\" he said, handing it to Becker.\u003c/p\u003e\n\u003cp\u003e\"As hard as you can.\" Becker took careful aim and swung mightily.\u003c/p\u003e\n\u003cp\u003eThe crack as the shin broke was loud enough to hear.\u003c/p\u003e\n\u003cp\u003eBertrand screamed and fainted.\u003c/p\u003e\n\u003cp\u003eBecker picked up a bucket of water that stood in a corner and threw the water in Bertrand\u0027s face.\u003c/p\u003e\n\u003cp\u003eThe young man came to and screamed again.\u003c/p\u003e\n\u003cp\u003eEventually, the screams subsided to heartrending groans.\u003c/p\u003e\n\u003cp\u003e\"What do you want?\" Bertrand implored.\u003c/p\u003e\n\u003cp\u003e\"Please, tell me what you want from me!\" Dieter did not ask him any questions.\u003c/p\u003e\n\u003cp\u003eInstead, he handed the steel crowbar to Becker and pointed to the broken leg where a jagged white edge of bone stuck through the flesh.\u003c/p\u003e\n\u003cp\u003eBecker struck the leg at that point.\u003c/p\u003e\n\u003cp\u003eBertrand screamed and passed out again.\u003c/p\u003e\n\u003cp\u003eDieter thought that might be enough.\u003c/p\u003e\n\u003cp\u003eHe went into the next room.\u003c/p\u003e\n\u003cp\u003eGaston sat where Dieter had left him, but he was a different man.\u003c/p\u003e\n\u003cp\u003eHe was bent over in his chair, face in his hands, crying with great sobs, moaning and praying to God.\u003c/p\u003e\n\u003cp\u003eDieter knelt in front of him and prized his hands away from his wet face.\u003c/p\u003e\n\u003cp\u003eGaston looked at him through tears.\u003c/p\u003e\n\u003cp\u003eDieter said softly, \"Only you can make it stop.\" \"Please, stop it, please,\" Gaston moaned.\u003c/p\u003e\n\u003cp\u003e\"Will you answer my questions?\" There was a pause.\u003c/p\u003e\n\u003cp\u003eBertrand screamed again.\u003c/p\u003e\n\u003cp\u003e\"Yes!\" Gaston yelled.\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, I\u0027ll tell you everything, if you just stop!\" Dieter raised his voice.\u003c/p\u003e\n\u003cp\u003e\"Sergeant Becker!\" \"Yes, Major?\" \"No more for now.\" \"Yes, Major.\" Becker sounded disappointed.\u003c/p\u003e\n\u003cp\u003eDieter reverted to French.\u003c/p\u003e\n\u003cp\u003e\"Now, Gaston, let\u0027s begin with the leader of the circuit.\u003c/p\u003e\n\u003cp\u003eName and code name.\u003c/p\u003e\n\u003cp\u003eWho is he?\" Gaston hesitated.\u003c/p\u003e\n\u003cp\u003eDieter looked toward the open door of the torture chamber.\u003c/p\u003e\n\u003cp\u003eGaston quickly said, \"Michel Clairet.\u003c/p\u003e\n\u003cp\u003eCode name Monet.\" It was the breakthrough.\u003c/p\u003e\n\u003cp\u003eThe first name was the hardest.\u003c/p\u003e\n\u003cp\u003eThe rest would follow effortlessly.\u003c/p\u003e\n\u003cp\u003eConcealing his satisfaction, Dieter gave Gaston a cigarette and held a match.\u003c/p\u003e\n\u003cp\u003e\"Where does he live?\" \"In Reims.\" Gaston blew out smoke and his shaking began to subside.\u003c/p\u003e\n\u003cp\u003eHe gave an address near the cathedral.\u003c/p\u003e\n\u003cp\u003eDieter nodded to Lieutenant Hesse, who took out a notebook and began to record Gaston\u0027s responses.\u003c/p\u003e\n\u003cp\u003ePatiently, Dieter took Gaston through each member of the attack team.\u003c/p\u003e\n\u003cp\u003eIn a few cases Gaston knew only the code names, and there were two men he claimed never to have seen before Sunday.\u003c/p\u003e\n\u003cp\u003eDieter believed him.\u003c/p\u003e\n\u003cp\u003eThere had been two getaway drivers waiting a short distance away, Gaston said: a young woman called Gilberte and a man codenamed Marechal.\u003c/p\u003e\n\u003cp\u003eThere were others in the group, which was known as the Bollinger circuit.\u003c/p\u003e\n\u003cp\u003eDieter asked about relationships between Resistance members.\u003c/p\u003e\n\u003cp\u003eWere there any love affairs? Were any of them homosexual? Was anyone sleeping with someone else\u0027s wife? Although the torture had stopped, Bertrand continued to groan and sometimes scream with the agony of his wounds, and now Gaston said, \"Is he going to be looked after?\" Dieter shrugged.\u003c/p\u003e\n\u003cp\u003e\"Please, get a doctor for him.\" \"Very well.\u003c/p\u003e\n\u003cp\u003ewhen we have finished our talk.\" Gaston told Dieter that Michel and Gilberte were lovers, even though Michel was married to Flick, the blond girl in the square.\u003c/p\u003e\n\u003cp\u003eSo far, Gaston had been talking about a circuit that was mostly destroyed, so his information had been mainly of academic interest.\u003c/p\u003e\n\u003cp\u003eNow Dieter moved on to more important questions.\u003c/p\u003e\n\u003cp\u003e\"When Allied agents come to this district, how do they make contact?\" No one was supposed to know how that was handled, Gaston said.\u003c/p\u003e\n\u003cp\u003eThere was a cut-out.\u003c/p\u003e\n\u003cp\u003eHowever, he knew part of the story.\u003c/p\u003e\n\u003cp\u003eThe agents were met by a woman code-named Bourgeoise.\u003c/p\u003e\n\u003cp\u003eGaston did not know where she met them, but she took them to her home; then she passed them on to Michel.\u003c/p\u003e\n\u003cp\u003eNo one had ever met Bourgeoise, not even Michel.\u003c/p\u003e\n\u003cp\u003eDieter was disappointed that Gaston knew so little about the woman.\u003c/p\u003e\n\u003cp\u003eBut that was the idea of a cut-out.\u003c/p\u003e\n\u003cp\u003e\"Do you know where she lives?\" Gaston nodded.\u003c/p\u003e\n\u003cp\u003e\"One of the agents gave it away.\u003c/p\u003e\n\u003cp\u003eShe has a house in the rue du Bois.\u003c/p\u003e\n\u003cp\u003eNumber eleven.\" Dieter tried not to look jubilant.\u003c/p\u003e\n\u003cp\u003eThis was a key fact.\u003c/p\u003e\n\u003cp\u003eThe enemy would probably send more agents in an attempt to rebuild the Bollinger circuit.\u003c/p\u003e\n\u003cp\u003eDieter might be able to catch them at the safe house.\u003c/p\u003e\n\u003cp\u003e\"And when they leave?\" They were picked up by plane in a field codenamed Champ de Pierre, actually a pasture near the village of Chatelle, Gaston revealed.\u003c/p\u003e\n\u003cp\u003eThere was an alternative landing field, codenamed Champ d\u0027Or, but he did not know where it was.\u003c/p\u003e\n\u003cp\u003eDieter asked Gaston about liaison with London.\u003c/p\u003e\n\u003cp\u003eWho had ordered the attack on the telephone exchange? Gaston explained that Flick-Major Clairet-was the circuit\u0027s commanding officer, and she had brought orders from London.\u003c/p\u003e\n\u003cp\u003eDieter was intrigued.\u003c/p\u003e\n\u003cp\u003eA woman in command.\u003c/p\u003e\n\u003cp\u003eBut he had seen her courage under fire.\u003c/p\u003e\n\u003cp\u003eShe would make a good leader.\u003c/p\u003e\n\u003cp\u003eIn the next room, Bertrand began to pray aloud for death to come.\u003c/p\u003e\n\u003cp\u003e\"Please,\" Gaston said.\u003c/p\u003e\n\u003cp\u003e\"A doctor.\" \"Just tell me about Major Clairet.\" Dieter said.\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll get someone to give Bertrand an injection.\" \"She is a very important person,\" Gaston said, eager now to give Dieter information that would satisfy him.\u003c/p\u003e\n\u003cp\u003e\"They say she has survived longer than anyone else undercover.\u003c/p\u003e\n\u003cp\u003eShe has been all over northern France.\" Dieter was spellbound.\u003c/p\u003e\n\u003cp\u003e\"She has contact with different circuits?\" \"So I believe.\" That was unusual-and it meant she could be a fountain of information about the French Resistance.\u003c/p\u003e\n\u003cp\u003eDieter said, \"She got away yesterday after the skirmish.\u003c/p\u003e\n\u003cp\u003eWhere do you think she went?\" \"Back to London, I\u0027m sure,\" Gaston said.\u003c/p\u003e\n\u003cp\u003e\"To report on the raid.\" Dieter cursed silently.\u003c/p\u003e\n\u003cp\u003eHe wanted her in France, where he could catch her and interrogate her.\u003c/p\u003e\n\u003cp\u003eIf he got his hands on her, he could destroy half the French Resistance-as he had promised Rommel.\u003c/p\u003e\n\u003cp\u003eBut she was out of reach.\u003c/p\u003e\n\u003cp\u003eHe stood up.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all for now,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Hans, get a doctor for the prisoners.\u003c/p\u003e\n\u003cp\u003eI don\u0027t want any of them to die today-they may have more to tell us.\u003c/p\u003e\n\u003cp\u003eThen type up your notes and bring them to me in the morning.\" \"Very good, Major.\" \"Make a copy for Major Weber-but don\u0027t give it to him until I say so.\" \"Understood.\" \"I\u0027ll drive myself back to the hotel.\" Dieter went out.\u003c/p\u003e\n\u003cp\u003eThe headache began as he stepped into the open air.\u003c/p\u003e\n\u003cp\u003eRubbing his forehead with his hand, he made his way to the car and drove out of the village, heading for Reims.\u003c/p\u003e\n\u003cp\u003eThe afternoon sun seemed to reflect off the road surface straight into his eyes.\u003c/p\u003e\n\u003cp\u003eThese migraines often struck him after an interrogation.\u003c/p\u003e\n\u003cp\u003eIn an hour he would be blind and helpless.\u003c/p\u003e\n\u003cp\u003eHe had to get back to the hotel before the attack reached its peak.\u003c/p\u003e\n\u003cp\u003eReluctant to brake, he sounded his horn constantly.\u003c/p\u003e\n\u003cp\u003eVineyard workers making their slow way home scattered out of his path.\u003c/p\u003e\n\u003cp\u003eHorses reared and a cart was driven into the ditch.\u003c/p\u003e\n\u003cp\u003eHis eyes watered with the pain, and he felt nauseous.\u003c/p\u003e\n\u003cp\u003eHe reached the town without crashing the car.\u003c/p\u003e\n\u003cp\u003eHe managed to steer into the center.\u003c/p\u003e\n\u003cp\u003eOutside the Hotel Frankfort, he did not so much park the car as abandon it.\u003c/p\u003e\n\u003cp\u003eStaggering inside, he made his way to the suite.\u003c/p\u003e\n\u003cp\u003eStephanie knew immediately what had happened.\u003c/p\u003e\n\u003cp\u003eWhile he stripped off his uniform tunic and shirt, she got the field medical kit out of her suitcase and filled a syringe with the morphine mixture.\u003c/p\u003e\n\u003cp\u003eDieter fell on the bed, and she plunged the needle into his arm.\u003c/p\u003e\n\u003cp\u003eAlmost immediately, the pain eased.\u003c/p\u003e\n\u003cp\u003eStephanie lay down beside him, stroking his face with gentle fingertips.\u003c/p\u003e\n\u003cp\u003eA few moments later, Dieter was unconscious. \u003c/p\u003e","sourceLink":"https://allnovel.net/jackdaws/page-9.html","bookId":2681,"creation":"Oct 5, 2019 10:09:10 AM","modification":"Oct 5, 2019 10:09:10 AM"}
