{"id":14968,"no":11,"title":"January 11","content":"“Comfort ye, comfort ye my people, saith your God.”\n\u003cbr\u003e\n\u003cbr\u003e(Isa 40:1)\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003eStore up comfort. This was the prophet\u0027s mission. The world is full of comfortless hearts, and ere thou art sufficient for this lofty ministry, thou must be trained. And thy training is costly in the extreme; for, to render it perfect, thou too must pass through the same afflictions as are wringing countless hearts of tears and blood. Thus thy own life becomes the hospital ward where thou art taught the Divine art of comfort. Thou art wounded, that in the binding up of thy wounds by the Great Physician, thou mayest learn how to render first aid to the wounded everywhere. Dost thou wonder why thou art passing through some special sorrow? Wait till ten years are passed, and thou wilt find many other afflicted as thou art. Thou wilt tell them how thou hast suffered and hast been comforted; then as the tale is unfolded, and the anodynes applied which once thy God wrapped around thee, in the eager look and the gleam of hope that shall chase the shadow of despair across the soul, thou shalt know why thou wast afflicted, and bless God for the discipline that stored thy life with such a fund of experience and helpfulness. – Selected.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003eGod does not comfort us to make us comfortable, but to make us comforters. – Dr. Jowett.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“They tell me I must bruise\n\u003cbr\u003e\n\u003cbr\u003eThe rose\u0027s leaf,\n\u003cbr\u003e\n\u003cbr\u003eEre I can keep and use\n\u003cbr\u003e\n\u003cbr\u003eIt\u0027s fragrance brief.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e”They tell me I must break\n\u003cbr\u003e\n\u003cbr\u003eThe skylark\u0027s heart,\n\u003cbr\u003e\n\u003cbr\u003eEre her cage song will make\n\u003cbr\u003e\n\u003cbr\u003eThe silence start.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“They tell me love must bleed,\n\u003cbr\u003e\n\u003cbr\u003eAnd friendship weep,\n\u003cbr\u003e\n\u003cbr\u003eEre in my deepest need\n\u003cbr\u003e\n\u003cbr\u003eI touch that deep.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“Must it be always so\n\u003cbr\u003e\n\u003cbr\u003eWith precious things?\n\u003cbr\u003e\n\u003cbr\u003eMust they be bruised and go\n\u003cbr\u003e\n\u003cbr\u003eWith beaten wings?\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“Ah, yes! by crushing days,\n\u003cbr\u003e\n\u003cbr\u003eBy caging nights, by scar\n\u003cbr\u003e\n\u003cbr\u003eOf thorn and stony ways,\n\u003cbr\u003e\n\u003cbr\u003eThese blessings are!”\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e“你们的神说，你们要安慰，安慰我的百姓”\n\u003cbr\u003e\n\u003cbr\u003e（赛四十：1）\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　安慰，供给安慰，这是那位先知所负的使命。世上充满了需要安慰的人，可是如果你要作一个安慰使者，你自己必须受过训练，否则不足胜任。这种训练的代价极大；因为，你必须亲身尝过那种使人流泪流血的苦楚。这样，你自己的生活就会变成一间病房，在那里你可以学习安慰的艺术。你自己必须先受伤，当那位大医师替你洗涤，消毒，抹膏，包扎创伤的时侯，你就可学习初步的救护。你是不是正在希奇为甚么你目前会经过一阵特别的忧愁？等到十年以后，你纔会明白。那时候你会遇见许多人受你从前所尝过的痛苦。你可以见证怎样你从前和他们同病，怎样得着医治；把病情说明了，照着神从前包扎你的方法敷上一点止痛油。那时侯，你会明白为甚么你从前受这许多的苦楚，你也会感谢神所给你的训练和替你预先储蓄在你生命中的经历。━选\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　神安慰我们，不是要我们享受安慰，乃是要我们作安慰的使者。 ━乔怀德\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e据说捣烂了玫瑰花瓣，\n\u003cbr\u003e\n\u003cbr\u003e才能提取它的芳馨。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e据说云雀在伤心的时候，\n\u003cbr\u003e\n\u003cbr\u003e歌声更加婉转动听。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e据说在流血和洒涕之时，\n\u003cbr\u003e\n\u003cbr\u003e显出友谊与爱情的贞坚。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e难道一切珍爱的事物，\n\u003cbr\u003e\n\u003cbr\u003e都要受此残酷苦刑？\n\u003cbr\u003e\n\u003cbr\u003e一如受伤的小鸟，\n\u003cbr\u003e\n\u003cbr\u003e可怜地垂下翅翎。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e是的！苦难，困辱和坎坷，\n\u003cbr\u003e\n\u003cbr\u003e为福祉降临必有的过程。  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4832.html","bookId":475,"creation":"Aug 2, 2019 6:37:26 AM","modification":"Aug 2, 2019 6:37:26 AM"}
