{"id":15070,"no":113,"title":"April 23","content":"\u003cp\u003e\"Though I walk in the midst of trouble, thou wilt revive me.\" (Psalm 138:7)\u003c/p\u003e \n\u003cp\u003eThe Hebrew rendering of the above is \"go on in the center of trouble.\" What descriptive words! We have called on God in the day of trouble; we have pleaded His promise of deliverance but no deliverance has been given; the enemy has continued oppressing until we were in the very thick of the fight, in the center of trouble. Why then trouble the Master any further?\u003c/p\u003e \n\u003cp\u003eWhen Martha said, \"Lord, if thou hadst been here my brother had not died,\" our Lord met her lack of hope with His further promise, \"Thy brother shall rise again.\" And when we walk \"in the center of trouble\" and are tempted to think like Martha that the time of deliverance is past, He meets us too with a promise from His Word. \"Though I walk in the midst of trouble, thou wilt revive me.\"\u003c/p\u003e \n\u003cp\u003eThough His answer has so long delayed, though we may still continue to \"go on\" in the midst of trouble, \"the center of trouble\" is the place where He revives, not the place where He fails us.\u003c/p\u003e \n\u003cp\u003eWhen in the hopeless place, the continued hopeless place, is the very time when He will stretch forth His hand against the wrath of our enemies and perfect that which concerneth us, the very time when He will make the attack to cease and fail and come to an end. What occasion is there then for fainting? --Aphra White.\u003c/p\u003e \n\u003cp\u003eTHE EYE OF THE STORM\u003c/p\u003e \n\u003cp\u003e\"Fear not that the whirlwind shall carry thee hence,\u003c/p\u003e \n\u003cp\u003eNor wait for its onslaught in breathless suspense,\u003c/p\u003e \n\u003cp\u003eNor shrink from the whips of the terrible hail,\u003c/p\u003e \n\u003cp\u003eBut pass through the edge to the heart of the gale,\u003c/p\u003e \n\u003cp\u003eFor there is a shelter, sunlighted and warm,\u003c/p\u003e \n\u003cp\u003eAnd Faith sees her God through the eye of the storm.\u003c/p\u003e \n\u003cp\u003e\"The passionate tempest with rush and wild roar\u003c/p\u003e \n\u003cp\u003eAnd threatenings of evil may beat on the shore,\u003c/p\u003e \n\u003cp\u003eThe waves may be mountains, the fields battle plains,\u003c/p\u003e \n\u003cp\u003eAnd the earth be immersed in a deluge of rains,\u003c/p\u003e \n\u003cp\u003eYet, the soul, stayed on God, may sing bravely its psalm,\u003c/p\u003e \n\u003cp\u003eFor the heart of the storm is the center of calm.\u003c/p\u003e \n\u003cp\u003e\"Let hope be not quenched in the blackness of night,\u003c/p\u003e \n\u003cp\u003eThough the cyclone awhile may have blotted the light,\u003c/p\u003e \n\u003cp\u003eFor behind the great darkness the stars ever shine,\u003c/p\u003e \n\u003cp\u003eAnd the light of God\u0027s heavens, His love shall make thine,\u003c/p\u003e \n\u003cp\u003eLet no gloom dim thine eyes, but uplift them on high\u003c/p\u003e \n\u003cp\u003eTo the face of thy God and the blue of His sky.\u003c/p\u003e \n\u003cp\u003e\"The storm is thy shelter from danger and sin,\u003c/p\u003e \n\u003cp\u003eAnd God Himself takes thee for safety within;\u003c/p\u003e \n\u003cp\u003eThe tempest with Him passeth into deep calm,\u003c/p\u003e \n\u003cp\u003eAnd the roar of the winds is the sound of a psalm.\u003c/p\u003e \n\u003cp\u003eBe glad and serene when the tempest clouds form;\u003c/p\u003e \n\u003cp\u003eGod smiles on His child in the eye of the storm.\"\u003c/p\u003e \n\u003cp\u003e　 　 四月二十三日\u003c/p\u003e \n\u003cp\u003e“我虽行在患难中，你必将我救活”（诗一百三十八；7）。\u003c/p\u003e \n\u003cp\u003e　　希伯来原文的直译是“我虽行在患难的中心，你必将我救活。”许多时候，我们在患难中求告神；我们恳请他实行他拯救的应许，可是拯救仍不来到；原来他要等到我们被仇敌逼到患难的中心，然后伸手施行拯救。所以，目前何必急于烦劳他呢？\u003c/p\u003e \n\u003cp\u003e　　马大对主说：“主啊，你若早在这里，我兄弟必不死”（约十一：21）；我们的主答应她的绝望说：“你兄弟必然复活。”（约十一：23）当我们到了患难的中心，我们也会像马大一般想拯救的时候过去了，但是主坚固我们说：“我虽行在患难中，你必将我救活”。\u003c/p\u003e \n\u003cp\u003e　　虽然他的答应延搁了许久，虽然我们还须在患难中继续受逼迫，但是患难的中心是他施行拯救的地方，不是他误事的地方。到了那时，他要伸出他的手来对付仇敌的忿怒，停止一切的攻击。信徒们，为什么这样绝望呢？——华爱德\u003c/p\u003e \n\u003cp\u003e不要怕飓风把你卷离此地，\u003c/p\u003e \n\u003cp\u003e也不要屏息等它的攻击，\u003c/p\u003e \n\u003cp\u003e也不要畏缩于冰雹的暴戾，\u003c/p\u003e \n\u003cp\u003e却要从风暴的边缘进入它中间，\u003c/p\u003e \n\u003cp\u003e那飓风眼，有阳光温暖和遮蔽。\u003c/p\u003e \n\u003cp\u003e信心从飓风眼里去见神。\u003c/p\u003e \n\u003cp\u003e狂啸怒吼奔腾而来的大风浪，\u003c/p\u003e \n\u003cp\u003e这凶恶的威胁可能以你为目标，\u003c/p\u003e \n\u003cp\u003e海中波涛如山，陆上田野成战场，\u003c/p\u003e \n\u003cp\u003e地土几乎沉没于大雨洪流中，\u003c/p\u003e \n\u003cp\u003e信靠神的人，却仍把诗篇高唱，\u003c/p\u003e \n\u003cp\u003e因为暴风雨的中心是安宁的地方。\u003c/p\u003e \n\u003cp\u003e风暴可能暂时遮掩光明，\u003c/p\u003e \n\u003cp\u003e但不要在黑暗中丧失希望，\u003c/p\u003e \n\u003cp\u003e因为星星永远在黑暗的后面照耀，\u003c/p\u003e \n\u003cp\u003e神的大爱，使你获得天上的光芒，\u003c/p\u003e \n\u003cp\u003e不要让阴暗蒙蔽你的眼睛，\u003c/p\u003e \n\u003cp\u003e要仰望神的圣容和蓝色的天堂。\u003c/p\u003e \n\u003cp\u003e风雨是阻挡危险与罪恶的遮荫，\u003c/p\u003e \n\u003cp\u003e神将亲自带你进去获得安宁，\u003c/p\u003e \n\u003cp\u003e浪随着他会化为平静，\u003c/p\u003e \n\u003cp\u003e风的怒号变成赞美的歌声，\u003c/p\u003e \n\u003cp\u003e当阴云密布时，要安详而欢欣，\u003c/p\u003e \n\u003cp\u003e神的微笑在暴风雨中心降临。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5049.html","bookId":475,"creation":"Aug 2, 2019 6:41:55 AM","modification":"Aug 2, 2019 6:41:55 AM"}
