{"id":15073,"no":116,"title":"April 26","content":"\u003cp\u003e\"I even reckon all things as pure loss because of the priceless privilege of knowing Christ Jesus my Lord.\" (Phil. 3:8) (Weymouth)\u003c/p\u003e \n\u003cp\u003eShining is always costly. Light comes only at the cost of that which produces it. An unlit candle does no shining. Burning must come before shining. We cannot be of great use to others without cost to ourselves. Burning suggests suffering. We shrink from pain.\u003c/p\u003e \n\u003cp\u003eWe are apt to feel that we are doing the greatest good in the world when we are strong, and able for active duty, and when the heart and hands are full of kindly service.\u003c/p\u003e \n\u003cp\u003eWhen we are called aside and can only suffer; when we are sick; when we are consumed with pain; when all our activities have been dropped, we feel that we are no longer of use, that we are not doing anything.\u003c/p\u003e \n\u003cp\u003eBut, if we are patient and submissive, it is almost certain that we are a greater blessing to the world in our time of suffering and pain than we were in the days when we thought we were doing the most of our work. We are burning now, and shining because we are burning. --Evening Thoughts.\u003c/p\u003e \n\u003cp\u003e\"The glory of tomorrow is rooted in the drudgery of today.\"\u003c/p\u003e \n\u003cp\u003eMany want the glory without the cross, the shining without the burning, but crucifixion comes before coronation.\u003c/p\u003e \n\u003cp\u003eHave you heard the tale of the aloe plant,\u003c/p\u003e \n\u003cp\u003eAway in the sunny clime?\u003c/p\u003e \n\u003cp\u003eBy humble growth of a hundred years\u003c/p\u003e \n\u003cp\u003eIt reaches its blooming time;\u003c/p\u003e \n\u003cp\u003eAnd then a wondrous bud at its crown\u003c/p\u003e \n\u003cp\u003eBreaks into a thousand flowers;\u003c/p\u003e \n\u003cp\u003eThis floral queen, in its blooming seen,\u003c/p\u003e \n\u003cp\u003eIs the pride of the tropical bowers,\u003c/p\u003e \n\u003cp\u003eBut the plant to the flower is sacrifice,\u003c/p\u003e \n\u003cp\u003eFor it blooms but once, and it dies.\u003c/p\u003e \n\u003cp\u003eHave you further heard of the aloe plant,\u003c/p\u003e \n\u003cp\u003eThat grows in the sunny clime;\u003c/p\u003e \n\u003cp\u003eHow every one of its thousand flowers,\u003c/p\u003e \n\u003cp\u003eAs they drop in the blooming time,\u003c/p\u003e \n\u003cp\u003eIs an infant plant that fastens its roots\u003c/p\u003e \n\u003cp\u003eIn the place where it falls on the ground,\u003c/p\u003e \n\u003cp\u003eAnd as fast as they drop from the dying stem,\u003c/p\u003e \n\u003cp\u003eGrow lively and lovely around?\u003c/p\u003e \n\u003cp\u003eBy dying, it liveth a thousand-fold\u003c/p\u003e \n\u003cp\u003eIn the young that spring from the death of the old.\u003c/p\u003e \n\u003cp\u003eHave you heard the tale of the pelican,\u003c/p\u003e \n\u003cp\u003eThe Arabs\u0027 Gimel el Bahr,\u003c/p\u003e \n\u003cp\u003eThat lives in the African solitudes,\u003c/p\u003e \n\u003cp\u003eWhere the birds that live lonely are?\u003c/p\u003e \n\u003cp\u003eHave you heard how it loves its tender young,\u003c/p\u003e \n\u003cp\u003eAnd cares and toils for their good,\u003c/p\u003e \n\u003cp\u003eIt brings them water from mountain far,\u003c/p\u003e \n\u003cp\u003eAnd fishes the seas for their food.\u003c/p\u003e \n\u003cp\u003eIn famine it feeds them--what love can devise!\u003c/p\u003e \n\u003cp\u003eThe blood of its bosom--and, feeding them, dies.\u003c/p\u003e \n\u003cp\u003eHave you heard this tale--the best of them all--\u003c/p\u003e \n\u003cp\u003eThe tale of the Holy and True,\u003c/p\u003e \n\u003cp\u003eHe dies, but His life, in untold souls\u003c/p\u003e \n\u003cp\u003eLives on in the world anew;\u003c/p\u003e \n\u003cp\u003eHis seed prevails, and is filling the earth,\u003c/p\u003e \n\u003cp\u003eAs the stars fill the sky above.\u003c/p\u003e \n\u003cp\u003eHe taught us to yield up the love of life,\u003c/p\u003e \n\u003cp\u003eFor the sake of the life of love.\u003c/p\u003e \n\u003cp\u003eHis death is our life, His loss is our gain;\u003c/p\u003e \n\u003cp\u003eThe joy for the tear, the peace for the pain.\u003c/p\u003e \n\u003cp\u003e--Selected.\u003c/p\u003e \n\u003cp\u003e　 四月二十六日\u003c/p\u003e \n\u003cp\u003e“我也将万事当作有损的，因我以认识我主基督耶稣为至宝”（腓三：8）。\u003c/p\u003e \n\u003cp\u003e　　要发光必须先有损失。发光体受了相当的损失以后，才会有光照出来。烛不燃烧，根本便没有光。有了燃烧，然后才能有光。我们自己若不先有损失，就不能有益于人。燃烧好似人生中的痛苦。信徒必须经过痛苦，然后才能有益于人。可是我们见了痛苦，却常喜欢逃避。\u003c/p\u003e \n\u003cp\u003e　　当我们被唤到一旁，在苦痛中磨炼的时候，例如病倒了，或煎熬于患难之中，我们所有的活动都遭停止，这种时候，我们觉得自己已不再有何贡献了。\u003c/p\u003e \n\u003cp\u003e　　但是，假若我们有耐心，肯服从主，我们就可确信，我们在受苦难中，对世界的贡献，更大于活动工作。我们此时正如蜡烛在燃烧，光明灿烂是从燃烧中发出来的。\u003c/p\u003e \n\u003cp\u003e　　明天的荣耀，是因今天的痛苦。\u003c/p\u003e \n\u003cp\u003e　　许多人只要荣耀，不要十架；只要发光，不要燃烧；但是我告诉你：十架是冠冕的先锋；没有十架；就没有冠冕。\u003c/p\u003e \n\u003cp\u003e你可曾听说过，热带有一种名曰“芦荟”植物，无声无臭生长了一百年，才到它开花的时候。顶端长出一个奇妙的蓓蕾，这蓓蕾里开出一千朵美丽的奇葩。成为热带所夸耀花中之后。然而这植物的开花，对它却是牺牲，因为只开一次花，开过就枯萎死亡了。\u003c/p\u003e \n\u003cp\u003e你可曾更听闻过，热带的植物“芦荟”更奇妙的是，那一千朵花落到地上，立刻在土中生根，成为芦荟的幼苗。也就是在它母株枯萎的时候，花就纷纷落地，于是下一代的芦荟就蓬勃生长了起来。一个生命的死亡，换得了一千个新的生命。\u003c/p\u003e \n\u003cp\u003e你可曾听说过，在非洲的荒山里，有一种鸟名曰鹈鹉，阿拉伯人称之为“吉美，艾，巴尔”。它对于后一代的爱护，辛劳，甚之牺牲，也是无微不至的。它从遥远的地方，带着泉水给小鸟喝，还从海中捉了鱼作他子女的粮食，在找不到食物饥荒时节，他竟用自己胸口的血，去喂饱小鸟，自己由此而牺牲了生命。\u003c/p\u003e \n\u003cp\u003e你已听到了芦荟与鹈鹉之牺牲自己，以培植更多新的生命，使我们联想到一个更伟大的故事，就是我们的救主耶稣，神圣与真理的化身，他牺牲了，但他的生命，永留在人间，在无数灵魂中获得了新生，他那生命的种子，播满了大地，多得象星星布满了天空。他教我们为了爱的生命，放弃对生命的留恋。他的牺牲成了我们的光明，他的损失，即是我们的收获，也是流泪者的欢乐，痛苦者的安慰。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5052.html","bookId":475,"creation":"Aug 2, 2019 6:42:02 AM","modification":"Aug 2, 2019 6:42:02 AM"}
