{"id":15078,"no":121,"title":"May 1","content":"\u003cp\u003e\"God that cannot lie promised.\" (Titus 1:2)\u003c/p\u003e \n\u003cp\u003eFaith is not working up by will power a sort of certainty that something is coming to pass, but it is seeing as an actual fact that God has said that this thing shall come to pass, and that it is true, and then rejoicing to know that it is true, and just resting because God has said it.\u003c/p\u003e \n\u003cp\u003eFaith turns the promise into a prophecy. While it is merely a promise it is contingent upon our cooperation. But when faith claims it, it becomes a prophecy, and we go forth feeling that it is something that must be done because God cannot lie. --Days of Heaven upon Earth\u003c/p\u003e \n\u003cp\u003eI hear men praying everywhere for more faith, but when I listen to them carefully, and get at the real heart of their prayer, very often it is not more faith at all that they are wanting, but a change from faith to sight.\u003c/p\u003e \n\u003cp\u003eFaith says not, \"I see that it is good for me, so God must have sent it,\" but, \"God sent it, and so it must be good for me.\"\u003c/p\u003e \n\u003cp\u003eFaith, walking in the dark with God, only prays Him to clasp its hand more closely. --Phillips Brooks.\u003c/p\u003e \n\u003cp\u003e\"The Shepherd does not ask of thee\u003c/p\u003e \n\u003cp\u003eFaith in thy faith, but only faith in Him;\u003c/p\u003e \n\u003cp\u003eAnd this He meant in saying, \u0027Come to me.\u0027\u003c/p\u003e \n\u003cp\u003eIn light or darkness seek to do His will,\u003c/p\u003e \n\u003cp\u003eAnd leave the. work of faith to Jesus still.\"　 \u003c/p\u003e \n\u003cp\u003e五月一日\u003c/p\u003e \n\u003cp\u003e“那无谎言的神…所应许的”（多一：2）。\u003c/p\u003e \n\u003cp\u003e　　信心并不是运用意志的力量来说事情必将成功，乃是看准这个事实：神既说过这件事必将成功，这是实在的；于是就安息下去，因为神已经说过了。\u003c/p\u003e \n\u003cp\u003e　　信心能把应许变作预言，光是应许，还须我们方面没有拦阻，才能实现。现在信心既然能把应许变作预言，我们就可以公开宣布：某件事情必会成功，因为神不能说谎。——译自地上的天上生活\u003c/p\u003e \n\u003cp\u003e　　我在各处常听见人祷告时，求神给他们更多的信心；但是当我仔细听他们祷告的时候，我就发现他们所要的并不是更多的信心，乃是更多的眼见。\u003c/p\u003e \n\u003cp\u003e　　信心并不说：“我看这件事是对我有益的，所以神必定会给我成功的”；信心乃是说：“这件事是神成功的，所以必定是对我有益的”。\u003c/p\u003e \n\u003cp\u003e　　信心，在黑暗中与神同行的时候，只求一件事：求神紧紧握住他的手。——白罗克斯\u003c/p\u003e \n\u003cp\u003e基督要你只信神，\u003c/p\u003e \n\u003cp\u003e不是信你自己的信，\u003c/p\u003e \n\u003cp\u003e所以他说：“到我这里来”。\u003c/p\u003e \n\u003cp\u003e无论顺利或困难，\u003c/p\u003e \n\u003cp\u003e一心归向天上的主，\u003c/p\u003e \n\u003cp\u003e寻求他的旨意遵行。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5110.html","bookId":475,"creation":"Aug 2, 2019 6:42:13 AM","modification":"Aug 2, 2019 6:42:13 AM"}
