{"id":15087,"no":130,"title":"May 10","content":"\u003cp\u003e\"I had fainted unless…!\" (Psalm. 27:13).\u003c/p\u003e \n\u003cp\u003e\"FAINT NOT!\"\u003c/p\u003e \n\u003cp\u003eHow great is the temptation at this point! How the soul sinks, the heart grows sick, and the faith staggers under the keen trials and testings which come into our lives in times of special bereavement and suffering.\u003c/p\u003e \n\u003cp\u003e\"I cannot bear up any longer, I am fainting under this providence. What shall I do? God tells me not to faint. But what can one do when he is fainting?\"\u003c/p\u003e \n\u003cp\u003eWhat do you do when you are about to faint physically? You cannot do anything. You cease from your own doings. In your faintness, you fall upon the shoulder of some strong loved one. You lean hard. You rest. You lie still and trust.\u003c/p\u003e \n\u003cp\u003eIt is so when we are tempted to faint under affliction. God\u0027s message to us is not, \"Be strong and of good courage,\" for He knows our strength and courage have fled away. But it is that sweet word, \"Be still, and know that I am God.\"\u003c/p\u003e \n\u003cp\u003eHudson Taylor was so feeble in the closing months of his life that he wrote a dear friend: \"I am so weak I cannot write; I cannot read my Bible; I cannot even pray. I can only lie still in God\u0027s arms like a little child, and trust.\"\u003c/p\u003e \n\u003cp\u003eThis wondrous man of God with all his spiritual power came to a place of physical suffering and weakness where he could only lie still and trust.\u003c/p\u003e \n\u003cp\u003eAnd that is all God asks of you, His dear child, when you grow faint in the fierce fires of affliction. Do not try to be strong. Just be still and know that He is God, and will sustain you, and bring you through.\u003c/p\u003e \n\u003cp\u003e\"God keeps His choicest cordials for our deepest faintings.\"\u003c/p\u003e \n\u003cp\u003e\"Stay firm and let thine heart take courage.\" (Psa. 27:14 --After Osterwald)\u003c/p\u003e \n\u003cp\u003eStay firm, He has not failed thee\u003c/p\u003e \n\u003cp\u003eIn all the past,\u003c/p\u003e \n\u003cp\u003eAnd will He go and leave thee \u003c/p\u003e \n\u003cp\u003eTo sink at last?\u003c/p\u003e \n\u003cp\u003eNay, He said He will hide thee \u003c/p\u003e \n\u003cp\u003eBeneath His wing;\u003c/p\u003e \n\u003cp\u003eAnd sweetly there in safety \u003c/p\u003e \n\u003cp\u003eThou mayest sing.\u003c/p\u003e \n\u003cp\u003e--Selected.\u003c/p\u003e \n\u003cp\u003e　 五月十日\u003c/p\u003e \n\u003cp\u003e“我若不信在活人之地得见耶和华的恩惠，就早已丧胆了”（诗二十七：13）。\u003c/p\u003e \n\u003cp\u003e　　“不要…丧胆”（弗三：13）。这句话是何等重大的考验关头，当我们受到了特别的痛苦和丧失的时候，我们的灵何其之消沉，我们的心又是何等的悲痛，我们的信心如何在试炼中发生摇动。\u003c/p\u003e \n\u003cp\u003e　　“我不能再忍受了，我丧胆了；我心里发昏，快要倒下来了。我该怎样作呢？神叮嘱我不要丧胆。但是我连一分钟都不能支持了。怎么办呢”？\u003c/p\u003e \n\u003cp\u003e　　当你身体要昏倒的时候，你怎样作呢？你什么事情都不能作。你停止你自己的活动。你倒在你所爱的人身上，紧紧靠着他，安息。你不再自己设法或努力了，因为你信靠他。\u003c/p\u003e \n\u003cp\u003e　　当你灵性软弱要昏倒的时候，也该如此。神给我们的信息不是“你当刚强壮胆”，因为他知道我们已经筋疲力尽，奋兴不起来了；他知道我们的力量和胆量已经消失了。他给我们的信息乃是“你要休息，要知道我是神”。\u003c/p\u003e \n\u003cp\u003e　　戴德生（Hudson Taylor）先生在临终几个月，身灵软弱到极顶，他给他知己朋友的信中说：“我极其软弱，我不能写信，我不能读经，甚至不能祷告。我只能像一个小孩子一样躺在神的怀中安静，休息，信靠。”\u003c/p\u003e \n\u003cp\u003e　　神要你也如此，当你在痛苦的烈火中丧胆的时候，不必自己设法，只要休息，知道他是神，他必支持你，带你过去。——选\u003c/p\u003e \n\u003cp\u003e　　“神为了我们的昏晕，准备着最佳良的起死回生之药剂”。\u003c/p\u003e \n\u003cp\u003e　　“当壮胆，坚固你的心”。（诗二十七：14）\u003c/p\u003e \n\u003cp\u003e你当坚定，你当壮胆，\u003c/p\u003e \n\u003cp\u003e过去他从未使你失望，\u003c/p\u003e \n\u003cp\u003e难道他将撤离去，\u003c/p\u003e \n\u003cp\u003e让你沉沦，失去了依仗？\u003c/p\u003e \n\u003cp\u003e不，他曾经说过，\u003c/p\u003e \n\u003cp\u003e他将以翅翼将你围护，\u003c/p\u003e \n\u003cp\u003e在那最安全之地，\u003c/p\u003e \n\u003cp\u003e你可以愉快唱歌。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5119.html","bookId":475,"creation":"Aug 2, 2019 6:42:38 AM","modification":"Aug 2, 2019 6:42:38 AM"}
