{"id":15088,"no":131,"title":"May 11","content":"\u003cp\u003e\"We went through fire and through water: but thou broughtest us out into a wealthy place.\" (Psa. 66:12)\u003c/p\u003e \n\u003cp\u003eParadoxical though it be, only that man is at rest who attains it through conflict. This peace, born of conflict, is not like the deadly hush preceding the tempest, but the serene and pure-aired quiet that follows it.\u003c/p\u003e \n\u003cp\u003eIt is not generally the prosperous one, who has never sorrowed, who is strong and at rest. His quality has never been tried, and he knows not how he can stand even a gentle shock. He is not the safest sailor who never saw a tempest; he will do for fair-weather service, but when the storm is rising, place at the important post the man who has fought out a gale, who has tested the ship, who knows her hulk sound, her rigging strong, and her anchor-flukes able to grasp and hold by the ribs of the world.\u003c/p\u003e \n\u003cp\u003eWhen first affliction comes upon us, how everything gives way! Our clinging, tendril hopes are snapped, and our heart lies prostrate like a vine that the storm has torn from its trellis; but when the first shock is past, and we are able to look up, and say, \"It is the Lord,\" faith lifts the shattered hopes once more, and binds them fast to the feet of God. Thus the end is confidence, safety, and peace. --Selected.\u003c/p\u003e \n\u003cp\u003eThe adverse winds blew against my life;\u003c/p\u003e \n\u003cp\u003eMy little ship with grief was tossed;\u003c/p\u003e \n\u003cp\u003eMy plans were gone--heart full of strife,\u003c/p\u003e \n\u003cp\u003eAnd all my hope seemed to be lost--\u003c/p\u003e \n\u003cp\u003e\"Then He arose\"--one word of peace.\u003c/p\u003e \n\u003cp\u003e\"There was a calm\"--a sweet release.\u003c/p\u003e \n\u003cp\u003eA tempest great of doubt and fear\u003c/p\u003e \n\u003cp\u003ePossessed my mind; no light was there\u003c/p\u003e \n\u003cp\u003eTo guide, or make my vision clear.\u003c/p\u003e \n\u003cp\u003eDark night! \u0027twas more than I could bear--\u003c/p\u003e \n\u003cp\u003e\"Then He arose,\" I saw His face—\u003c/p\u003e \n\u003cp\u003e\"There was a calm\" filled with His grace.\u003c/p\u003e \n\u003cp\u003eMy heart was sinking \u0027neath the wave\u003c/p\u003e \n\u003cp\u003eOf deepening test and raging grief;\u003c/p\u003e \n\u003cp\u003eAll seemed as lost, and none could save,\u003c/p\u003e \n\u003cp\u003eAnd nothing could bring me relief--\u003c/p\u003e \n\u003cp\u003e\"Then He arose\"--and spoke one word,\u003c/p\u003e \n\u003cp\u003e\"There was a calm!\" IT IS THE LORD.\u003c/p\u003e \n\u003cp\u003e--L. S. P.\u003c/p\u003e \n\u003cp\u003e“我们经过水火；你却使我们到丰富之地”（诗六六；12）。\u003c/p\u003e \n\u003cp\u003e　　只有那曾经历患难和痛苦的人才能得到安息。这种安息——从患难中产生的安息——不是勉强的镇静，也不是死寂，乃是顶自然地从里面涌出来的安息。\u003c/p\u003e \n\u003cp\u003e　　平常我们以为顺利的人，从来不知道忧愁的人，是最有安息的人。可是错了。这种人从来没有受过试验，从来没有受过苦楚，所以或许轻轻的一震也受不住。凡没有看见过风浪的水手，不是最可靠的水手；所以船上新来的水手总是派在不重要的地位上工作的；风浪澎湃的时候，站在重要职位上的，总是那些曾遇见过许多患难危险而能死里逃生的水手，他们能推测波浪的力量，他们能知道桅杆的坚度，他们能预料风雨的久暂，他们能断定轮索的韧性。\u003c/p\u003e \n\u003cp\u003e　　当患难初临的时候，似乎一切都经不起它的打击，无能为力地躺了下来；可是等到风暴的最初一阵子的袭击过去之后，我们又能抬起头来说：“这是出于耶和华”，（撒上三：18）信心把残破的希望，重又收拾了起来，紧紧系住在神的脚上，其结果为信，可靠与安全。\u003c/p\u003e \n\u003cp\u003e一叶扁舟在惊涛骇浪中，\u003c/p\u003e \n\u003cp\u003e逆风打击着我的生命，\u003c/p\u003e \n\u003cp\u003e计划归于虚无，希望渺茫，\u003c/p\u003e \n\u003cp\u003e悲叹着命运的蹉跎。\u003c/p\u003e \n\u003cp\u003e圣经说：耶稣醒了，风浪静了，\u003c/p\u003e \n\u003cp\u003e这是平安的福音，安慰的叮咛。\u003c/p\u003e \n\u003cp\u003e心头意念被侵袭，\u003c/p\u003e \n\u003cp\u003e疑虑和恐惧的风暴，\u003c/p\u003e \n\u003cp\u003e模糊黑暗，它遮蔽了一切，\u003c/p\u003e \n\u003cp\u003e没有光明作我的向导。\u003c/p\u003e \n\u003cp\u003e圣经说：耶稣醒了，风浪静了，\u003c/p\u003e \n\u003cp\u003e我看见了他温柔的笑貌。\u003c/p\u003e \n\u003cp\u003e我的心似沉入巨波，\u003c/p\u003e \n\u003cp\u003e深深地卷入，无力抗拒，\u003c/p\u003e \n\u003cp\u003e似乎一切都已丧失，无人挽救，\u003c/p\u003e \n\u003cp\u003e什么也不能解除我的痛楚，\u003c/p\u003e \n\u003cp\u003e圣经说：耶稣醒了，风浪静了，\u003c/p\u003e \n\u003cp\u003e无穷的能力来自我主。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5120.html","bookId":475,"creation":"Aug 2, 2019 6:42:41 AM","modification":"Aug 2, 2019 6:42:41 AM"}
