{"id":15106,"no":149,"title":"May 29","content":"\u003cp\u003e\"I have called you friends.\" (John 15:15)\u003c/p\u003e \n\u003cp\u003eYears ago there was an old German professor whose beautiful life was a marvel to his students. Some of them resolved to know the secret of it; so one of their number hid in the study where the old professor spent his evenings.\u003c/p\u003e \n\u003cp\u003eIt was late when the teacher came in. He was very tired, but he sat down and spent an hour with his Bible. Then he bowed his head in secret prayer; and finally closing the Book of books, he said, \u003c/p\u003e \n\u003cp\u003e\"Well, Lord Jesus, we\u0027re on the same old terms.\"\u003c/p\u003e \n\u003cp\u003eTo know Him is life\u0027s highest attainment; and at all costs, every Christian should strive to be \"on the same old terms with Him.\"\u003c/p\u003e \n\u003cp\u003eThe reality of Jesus comes as a result of secret prayer, and a personal study of the Bible that is devotional and sympathetic. Christ becomes more real to the one who persists in the cultivation of His presence.\u003c/p\u003e \n\u003cp\u003eSpeak thou to Him for He heareth,\u003c/p\u003e \n\u003cp\u003eAnd spirit with spirit will meet!\u003c/p\u003e \n\u003cp\u003eNearer is He than breathing,\u003c/p\u003e \n\u003cp\u003eNearer than hands and feet.\u003c/p\u003e \n\u003cp\u003e--Maltbie D. Babcock.\u003c/p\u003e \n\u003cp\u003e　 五月二十九日\u003c/p\u003e \n\u003cp\u003e“我乃称你们为朋友”（约十五：15）。\u003c/p\u003e \n\u003cp\u003e　　数年前某大学有一位年老的德文教授，他的生活是为全校学生所钦佩的。他们中间有几个好奇的学生，很想探听他所以这样生活的秘诀；所以其中有一个学生隐匿在教授的书室中，看他每天晚上在那里干些什么。\u003c/p\u003e \n\u003cp\u003e　　教授走进书室，时间已很迟了。看他的样子似乎很累，但是他坐下来，打开圣经，顶虔诚的读了一个钟头。然后低头默祷；最后，把圣经关起来，说：\u003c/p\u003e \n\u003cp\u003e　　“主耶稣，我们又是一次欢聚”！\u003c/p\u003e \n\u003cp\u003e　　与主欢聚是属灵生活中的最高点；每一个基督人，该不惜任何代价，寻求与主“又是一次欢聚”。\u003c/p\u003e \n\u003cp\u003e　　祷告和读经能使我们觉得基督的实在。越在密室中追求主的同在的，越觉得主的实在。——贝伯考克\u003c/p\u003e \n\u003cp\u003e他正听着，\u003c/p\u003e \n\u003cp\u003e用你的心声与他接触，\u003c/p\u003e \n\u003cp\u003e灵灵相交，密如心腹，\u003c/p\u003e \n\u003cp\u003e呼吸相通，亲同手足。——贝伯考克\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5138.html","bookId":475,"creation":"Aug 2, 2019 6:43:31 AM","modification":"Aug 2, 2019 6:43:31 AM"}
