{"id":15109,"no":152,"title":"June 1","content":"\u003cp\u003e\"This is the rest wherewith ye may cause the weary to rest; and this is the refreshing.\" (Isa. 28:12)\u003c/p\u003e \n\u003cp\u003eWhy dost thou worry thyself? What use can thy fretting serve? Thou art on board a vessel which thou couldst not steer even if the great Captain put thee at the helm, of which thou couldst not so much as reef a sail, yet thou worriest as if thou wert captain and helmsman. Oh, be quiet; God is Master!\u003c/p\u003e \n\u003cp\u003eDost thou think that all this din and hurly-burly that is abroad betokens that God has left His throne?\u003c/p\u003e \n\u003cp\u003eNo, man, His coursers rush furiously on, and His chariot is the storm; but there is a bit between their jaws, and He holds the reins, and guides them as He wills! Jehovah is Master yet; believe it; peace be unto thee! be not afraid. --C. H. Spurgeon.\u003c/p\u003e \n\u003cp\u003e\"Tonight, my soul, be still and sleep;\u003c/p\u003e \n\u003cp\u003eThe storms are raging on God\u0027s deep--\u003c/p\u003e \n\u003cp\u003eGod\u0027s deep, not thine; be still and sleep.\u003c/p\u003e \n\u003cp\u003e\"Tonight, my soul, be still and sleep;\u003c/p\u003e \n\u003cp\u003eGod\u0027s hands shall still the tempter\u0027s sweep--\u003c/p\u003e \n\u003cp\u003eGod\u0027s hands, not thine; be still and sleep.\u003c/p\u003e \n\u003cp\u003e\"Tonight, my soul, be still and sleep;\u003c/p\u003e \n\u003cp\u003eGod\u0027s love is strong while night hours creep--\u003c/p\u003e \n\u003cp\u003eGod\u0027s love, not thine; be still and sleep.\u003c/p\u003e \n\u003cp\u003e\"Tonight, my soul, be still and sleep;\u003c/p\u003e \n\u003cp\u003eGod\u0027s heaven will comfort those who weep--\u003c/p\u003e \n\u003cp\u003eGod\u0027s heaven, not thine; be still and sleep.\"\u003c/p\u003e \n\u003cp\u003eI entreat you, give no place to despondency. This is a dangerous temptation--a refined, not a gross temptation of the adversary. Melancholy contracts and withers the heart, and renders it unfit to receive the impressions of grace. It magnifies and gives a false coloring to objects, and thus renders your burdens too heavy to bear. God\u0027s designs regarding you, and His methods of bringing about these designs, are infinitely wise. --Madame Guyon.　 \u003c/p\u003e \n\u003cp\u003e六月一日\u003c/p\u003e \n\u003cp\u003e“你们要使疲乏人得安息，这样的安息才得舒畅”（赛二十八：12直译）。\u003c/p\u003e \n\u003cp\u003e　　为什么你要挂虑呢？你的挂虑有什么用处呢？你现在好似一只大船上的乘客，你不会驾驶；就是船主——主耶稣——把你放在舵边，你也不会把它；你连将帆卷起来也不会；为什么你要担心好象你是船主，舵工，一般呢？哦，安息罢；主耶稣是船主！\u003c/p\u003e \n\u003cp\u003e　　你看见波浪翻腾，船身颠簸，就以为神已经离开了你！不，他始终在你的左右，波浪就是他的马车，马正在飞奔，可是它们都有羁勒，他握着缰绳，照他的意志驾驶着。耶和华是你的船长，只要信，不要怕，愿你平安。——司布真\u003c/p\u003e \n\u003cp\u003e灵魂哪，今夜要安心睡觉，\u003c/p\u003e \n\u003cp\u003e神的海上正沸腾着大风暴，\u003c/p\u003e \n\u003cp\u003e神自会安排，你只管安心睡觉。\u003c/p\u003e \n\u003cp\u003e灵魂哪，今夜要安心睡觉，\u003c/p\u003e \n\u003cp\u003e神的手会把恶魔的诱惑除掉，，\u003c/p\u003e \n\u003cp\u003e神自会安排，你只管安心睡觉。\u003c/p\u003e \n\u003cp\u003e灵魂哪，今夜要安心睡觉，\u003c/p\u003e \n\u003cp\u003e神的爱护在夜间特别周到，\u003c/p\u003e \n\u003cp\u003e神自会安排，你只管安心睡觉。\u003c/p\u003e \n\u003cp\u003e灵魂哪，今夜要安心睡觉，\u003c/p\u003e \n\u003cp\u003e神的天堂，会给哭泣者带来欢笑，\u003c/p\u003e \n\u003cp\u003e神自会安排，你只管安心睡觉。\u003c/p\u003e \n\u003cp\u003e　　我恳求你，不要为沮丧留地步。这是一个很危险的引诱——一个精巧的引诱。沮丧使你的心收缩枯萎，以至不能接受恩典。它把事情扩大，又描上凶险的颜色；使你觉得担子太重太难。请记得神在你身上的计划，和实现这些计划的方法，都是绝顶智慧的。——盖恩夫人\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5154.html","bookId":475,"creation":"Aug 2, 2019 6:43:39 AM","modification":"Aug 2, 2019 6:43:39 AM"}
