{"id":15110,"no":153,"title":"June 2","content":"\u003cp\u003e\"For Abraham, when hope was gone, hoped on in faith. His faith never quailed.\" (Rom. 4:18, 19)\u003c/p\u003e \n\u003cp\u003eWe shall never forget a remark that George Mueller once made to a gentleman who had asked him the best way to have strong faith.\u003c/p\u003e \n\u003cp\u003e\"The only way,\" replied the patriarch of faith, \"to learn strong faith is to endure great trials. I have learned my faith by standing firm amid severe testings.\" This is very true. The time to trust is when all else fails.\u003c/p\u003e \n\u003cp\u003eDear one, you scarcely realize the value of your present opportunity; if you are passing through great afflictions you are in the very soul of the strongest faith, and if you will only let go, He will teach you in these hours the mightiest hold upon His throne which you can ever know.\u003c/p\u003e \n\u003cp\u003e\"Be not afraid, only believe.\" And if you are afraid, just look up and say, \"What time I am afraid I will trust in thee,\" and you will yet thank God for the school of sorrow which was to you the school of faith. --A. B. Simpson.\u003c/p\u003e \n\u003cp\u003e\"Great faith must have great trials.\"\u003c/p\u003e \n\u003cp\u003e\"God\u0027s greatest gifts come through travail. Whether we look into the spiritual or temporal sphere, can we discover anything, any great reform, any beneficent discovery, any soul-awakening revival, which did not come through the toils and tears, the vigils and blood-shedding of men and women whose sufferings were the pangs of its birth? If the temple of God is raised, David must bear sore afflictions; if the Gospel of the grace of God is to be disentangled from Jewish tradition, Paul\u0027s life must be one long agony.\"\u003c/p\u003e \n\u003cp\u003e\"Take heart, O weary, burdened one, bowed down\u003c/p\u003e \n\u003cp\u003eBeneath thy cross;\u003c/p\u003e \n\u003cp\u003eRemember that thy greatest gain may come \u003c/p\u003e \n\u003cp\u003eThrough greatest loss.\u003c/p\u003e \n\u003cp\u003eThy life is nobler for a sacrifice, \u003c/p\u003e \n\u003cp\u003eAnd more divine.\u003c/p\u003e \n\u003cp\u003eAcres of bloom are crushed to make a drop\u003c/p\u003e \n\u003cp\u003eOf perfume fine.\u003c/p\u003e \n\u003cp\u003e\"Because of storms that lash the ocean waves,\u003c/p\u003e \n\u003cp\u003eThe waters there\u003c/p\u003e \n\u003cp\u003eKeep purer than if the heavens o\u0027erhead\u003c/p\u003e \n\u003cp\u003eWere always fair.\u003c/p\u003e \n\u003cp\u003eThe brightest banner of the skies floats not\u003c/p\u003e \n\u003cp\u003eAt noonday warm;\u003c/p\u003e \n\u003cp\u003eThe rainbow traileth after thunder-clouds,\u003c/p\u003e \n\u003cp\u003eAnd after storm.\"　\u003c/p\u003e \n\u003cp\u003e　 六月二日\u003c/p\u003e \n\u003cp\u003e“他在无可指望的时候因信仍有指望……他的信心还是不软弱”（罗四：18/19）。\u003c/p\u003e \n\u003cp\u003e　　记得有一次有人问莫勒（George Mueller）先生如何可得坚强的信心。这位信心之王答复说：“只有一个方法，就是忍受试炼。我个人学得信心，都是因为在凶险的试炼中站住的缘故”。这话是真实的。当一切都无可靠的时候，才是信靠神的时候。\u003c/p\u003e \n\u003cp\u003e　　亲爱的，你太轻看你目前的机会了；你现在所受的苦难，就是学得坚强信心的学校；神要在那里教导你怎样在绝望中抓住他的施恩宝座。\u003c/p\u003e \n\u003cp\u003e　“不要怕，只要信”（可五：36）。什么时候你怕，什么时候你就抬头向天说：“什么时候我怕，什么时候我更要信靠你”。这样，你就会感谢神了，因为苦难的学校就是信心的学校。——宣信\u003c/p\u003e \n\u003cp\u003e　　大的信心必经大的试炼。\u003c/p\u003e \n\u003cp\u003e　　神的最大赐予，都要经过了苦痛方能得到。无论从精神的领域，或人世的领域去观察，任何伟大的事业与改革，有益的发明与复兴，没有一样不是来自人类的辛苦，不眠不休，流血流泪呢？那一件事物的产生，不是先有如生产之痛苦呢？要树立神的殿，大卫必须承受酷烈的痛苦；要使神的福音和犹太传统分离圣别，保罗的一生必须经历长期的磨难。\u003c/p\u003e \n\u003cp\u003e辛劳的人，鼓起你的勇气，\u003c/p\u003e \n\u003cp\u003e十字架压得你挺不直身子，\u003c/p\u003e \n\u003cp\u003e要记住，你最大的收获，\u003c/p\u003e \n\u003cp\u003e可能得自最大的辛勤。\u003c/p\u003e \n\u003cp\u003e牺牲使生命更高贵更神圣，\u003c/p\u003e \n\u003cp\u003e几亩地的花只榨出一滴香醇。\u003c/p\u003e \n\u003cp\u003e如果没有暴风鞭打着海洋，\u003c/p\u003e \n\u003cp\u003e空中永远是平晴无云，\u003c/p\u003e \n\u003cp\u003e如何还有浪花的晶光明亮？\u003c/p\u003e \n\u003cp\u003e最美丽的云不在中午飘扬；\u003c/p\u003e \n\u003cp\u003e在雷雨和风云之后，\u003c/p\u003e \n\u003cp\u003e彩虹才放出它的光芒。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5156.html","bookId":475,"creation":"Aug 2, 2019 6:43:41 AM","modification":"Aug 2, 2019 6:43:41 AM"}
