{"id":15111,"no":154,"title":"June 3","content":"\u003cp\u003e\"Let us pass over unto the other side.\" (Mark 4:35)\u003c/p\u003e \n\u003cp\u003eEven when we go forth at Christ\u0027s command, we need not expect to escape storms; for these disciples were going forth at Christ\u0027s command, yet they encountered the fiercest storm and were in great danger of being overwhelmed, so that they cried out in their distress for Christ\u0027s assistance.\u003c/p\u003e \n\u003cp\u003eThough Christ may delay His coming in our time of distress, it is only that our faith may be tried and strengthened, and that our prayers may be more intense, and that our desires for deliverance may be increased, so that when the deliverance does come we will appreciate it more fully.\u003c/p\u003e \n\u003cp\u003eChrist gave them a gentle rebuke, saying, \"Where is your faith?\" Why did you not shout victory in the very face of the storm, and say to the raging winds and rolling waves, \"You can do no harm, for Christ, the mighty Savior is on board\"?\u003c/p\u003e \n\u003cp\u003eIt is much easier to trust when the sun is shining than when the storm is raging.\u003c/p\u003e \n\u003cp\u003eWe never know how much real faith we have until it is put to the test in some fierce storm; and that is the reason why the Savior is on board.\u003c/p\u003e \n\u003cp\u003eIf you are ever to be strong in the Lord and the power of His might, your strength will be born in some storm. --Selected.\u003c/p\u003e \n\u003cp\u003e\"With Christ in the vessel,\u003c/p\u003e \n\u003cp\u003eI smile at the storm.\"\u003c/p\u003e \n\u003cp\u003eChrist said, \"Let us go to the other side\"--not to the middle of the lake to be drowned. --Dan Crawford.\u003c/p\u003e \n\u003cp\u003e　 　 六月三日\u003c/p\u003e \n\u003cp\u003e“我们渡到那边去罢”（可四：35）。\u003c/p\u003e \n\u003cp\u003e　　我们就是遵着神的命令出去，我们还是不能盼望不遇见患难的；这些门徒听从主的命令出去，他们还是遭遇了顶危险的暴雨，甚至他们大声急呼主的拯救。\u003c/p\u003e \n\u003cp\u003e　　虽然在我们顶紧急的时候，主还耽延他的拯救，但是他的目的乃是要使我们的信心经过试炼，而更增强；使我们的祷告更加虔诚；使我们得拯救的渴望更加迫切；使我们从此更重视主的拯救。\u003c/p\u003e \n\u003cp\u003e　　主给他们一个温柔的责备，说：“你们的信心何在”？意思就是说：你们为什么不向狂风怒涛夸胜说：“你们不能伤害我们，因为主在船上呢”！\u003c/p\u003e \n\u003cp\u003e　　在日光中信靠，比在风波中信靠，容易得多。\u003c/p\u003e \n\u003cp\u003e　　若不放我们在试炼中，我们决不会知道我们自己有多少信心。所以救主要一同与我们坐船。倘若你经常因主而坚强起来，你的力量将在暴风雨中诞生。\u003c/p\u003e \n\u003cp\u003e“与主同舟，我复何忧！\u003c/p\u003e \n\u003cp\u003e笑彼风浪，岂能为仇”？\u003c/p\u003e \n\u003cp\u003e　　基督耶稣说：“我们渡到那边去吧“。他不是说任凭我们沉在水里。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5157.html","bookId":475,"creation":"Aug 2, 2019 6:43:45 AM","modification":"Aug 2, 2019 6:43:45 AM"}
