{"id":15128,"no":171,"title":"June 20","content":"\u003cp\u003e\"Thine ears shall hear a word behind thee, saying, This is the way, walk ye in it, when ye turn to the right hand, and when ye turn to the left.\" (Isa. 30:21)\u003c/p\u003e \n\u003cp\u003eWhen we are in doubt or difficulty, when many voices urge this course or the other, when prudence utters one advice and faith another, then let us be still, hushing each intruder, calming ourselves in the sacred hush of God\u0027s presence; let us study His Word in the attitude of devout attention; let us lift up our nature into the pure light of His face, eager only to know what God the Lord shall determine--and ere long a very distinct impression will be made, the unmistakable forth-telling of His secret counsel.\u003c/p\u003e \n\u003cp\u003eIt is not wise in the earlier stages of Christian life to depend on this alone, but to wait for the corroboration of circumstances. But those who have had many dealings with God know well the value of secret fellowship with Him, to ascertain His will.\u003c/p\u003e \n\u003cp\u003eAre you in difficulty about your way? Go to God with your question; get direction from the light of His smile or the cloud of His refusal.\u003c/p\u003e \n\u003cp\u003eIf you will only get alone, where the lights and shadows of earth cannot interfere, where human opinions fail to reach--and if you will dare to wait there silent and expectant, though all around you insist on immediate decision or action--the will of God will be made clear; and you will have a new conception of God, a deeper insight into His nature and heart of love, which shall be for yourself alone--a rapturous experience, to abide your precious perquisite forever, the rich guerdon of those long waiting hours. --David.\u003c/p\u003e \n\u003cp\u003e\"STAND STILL,\" my soul, for so thy Lord commands:\u003c/p\u003e \n\u003cp\u003eE\u0027en when thy way seems blocked, leave it in His wise hands;\u003c/p\u003e \n\u003cp\u003eHis arm is mighty to divide the wave.\u003c/p\u003e \n\u003cp\u003e\"Stand still,\" my soul, \"stand still\" and thou shalt see\u003c/p\u003e \n\u003cp\u003eHow God can work the \"impossible\" for thee,\u003c/p\u003e \n\u003cp\u003eFor with a great deliverance He doth save.\u003c/p\u003e \n\u003cp\u003eBe not impatient, but in stillness stand,\u003c/p\u003e \n\u003cp\u003eEven when compassed \u0027round on every hand,\u003c/p\u003e \n\u003cp\u003eIn ways thy spirit does not comprehend.\u003c/p\u003e \n\u003cp\u003eGod cannot clear thy way till thou art still,\u003c/p\u003e \n\u003cp\u003eThat He may work in thee His blessed will,\u003c/p\u003e \n\u003cp\u003eAnd all thy heart and will to Him do bend.\u003c/p\u003e \n\u003cp\u003e\"BE STILL,\" my soul, for just as thou art still,\u003c/p\u003e \n\u003cp\u003eCan God reveal Himself to thee; until\u003c/p\u003e \n\u003cp\u003eThrough thee His love and light and life can freely flow;\u003c/p\u003e \n\u003cp\u003eIn stillness God can work through thee and reach\u003c/p\u003e \n\u003cp\u003eThe souls around thee. He then through thee can teach\u003c/p\u003e \n\u003cp\u003eHis lessons, and His power in weakness show.\u003c/p\u003e \n\u003cp\u003e\"BE STILL\"--a deeper step in faith and rest.\u003c/p\u003e \n\u003cp\u003e\"Be still and know\" thy Father knoweth best\u003c/p\u003e \n\u003cp\u003eThe way to lead His child to that fair land,\u003c/p\u003e \n\u003cp\u003eA \"summer\" land, where quiet waters flow;\u003c/p\u003e \n\u003cp\u003eWhere longing souls are satisfied, and \"know\u003c/p\u003e \n\u003cp\u003eTheir God,\" and praise for all that He has planned.—Selected.\u003c/p\u003e \n\u003cp\u003e　 六月二十日\u003c/p\u003e \n\u003cp\u003e“你或向左或向右，你必听见后边有声音说，这是正路，要行在其间”（赛三十：21）。\u003c/p\u003e \n\u003cp\u003e　　当我们犹豫不决的时候，或者遭遇了什么困难的时候，有许多声音会来催促我们这样做，那样做；智慧会发表意见，信心也会发表意见；遇到这样的时候，我们就当安静下来，排除所有的意见静静地等候在神的面前。恭恭敬敬地把神的话寻思一回；专心仰望神的旨意——不久我们就会得到一个极清楚的声音，明明白白地告诉我们神机密的指导。\u003c/p\u003e \n\u003cp\u003e　　灵命幼稚的信徒，不当单独凭依这样的直觉来行事，最好还须等待环境的证实。与神多有交通的信徒，很容易知道神的旨意。\u003c/p\u003e \n\u003cp\u003e　　读者，你是不是正在困难的处境中？将你的问题带到神面前去；从他脸上的微笑或峻拒，你就可以找到你所要找的答案。\u003c/p\u003e \n\u003cp\u003e　　只要你肯独自安静在一个地方——人世间的光明和黑暗，一概接触不到的地方——人们的意见不能到达的地方——只要你敢在那里静静地等候着，不顾你四围一切的催促，那时神旨意就要向你显明；你对神就会有一种新的概念，对他的神性和爱心会有更深切的洞见，这会成了你极乐的经历——永久可宝贵的经历。你等待的时间虽长，至此也得到了丰富的酬报。——大卫\u003c/p\u003e \n\u003cp\u003e灵魂啊，要安静，这是神的命令，\u003c/p\u003e \n\u003cp\u003e即使前途封闭，还是信靠他的权柄。\u003c/p\u003e \n\u003cp\u003e他万能的臂可以把波浪分开。\u003c/p\u003e \n\u003cp\u003e要安定，灵魂啊，只要安定，\u003c/p\u003e \n\u003cp\u003e必见神为你使不可能为可能，\u003c/p\u003e \n\u003cp\u003e他大施拯救，使你得获全胜。\u003c/p\u003e \n\u003cp\u003e不要没有耐心，只管安稳站定，\u003c/p\u003e \n\u003cp\u003e即使你方向莫辨，无路可循，\u003c/p\u003e \n\u003cp\u003e神给你开路僻径，\u003c/p\u003e \n\u003cp\u003e先要你能安定，静如星辰，\u003c/p\u003e \n\u003cp\u003e然后他可以领导你，\u003c/p\u003e \n\u003cp\u003e一切心意归向万能的神。\u003c/p\u003e \n\u003cp\u003e灵魂哪，只要你安静，\u003c/p\u003e \n\u003cp\u003e神就会向你显出他的大能，\u003c/p\u003e \n\u003cp\u003e在安静中，他的爱和光，\u003c/p\u003e \n\u003cp\u003e还有他的生命，会在你里面运行，\u003c/p\u003e \n\u003cp\u003e直达你周围的人们，\u003c/p\u003e \n\u003cp\u003e传他的圣言，使弱者得胜。\u003c/p\u003e \n\u003cp\u003e要安定，踏入信与静的深处，\u003c/p\u003e \n\u003cp\u003e要安静，要知道你的天父，\u003c/p\u003e \n\u003cp\u003e最清楚带他子女上祝福的路，\u003c/p\u003e \n\u003cp\u003e那里常年如忧，清溪在悄悄奔流，\u003c/p\u003e \n\u003cp\u003e一切可以满足人们的渴慕，\u003c/p\u003e \n\u003cp\u003e知道天父，赞美他的一切爱护。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5174.html","bookId":475,"creation":"Aug 2, 2019 6:44:35 AM","modification":"Aug 2, 2019 6:44:35 AM"}
