{"id":15140,"no":183,"title":"July 2","content":"\u003cp\u003e\"When thou goest, thy way shall be opened up before thee step by step.\u003c/p\u003e \n\u003cp\u003e(Proverbs 4:12, free translation)\u003c/p\u003e \n\u003cp\u003eThe Lord never builds a bridge of faith except under the feet of the faith-filled traveler. If He builds the bridge a rod ahead, it would not be a bridge of faith. That which is of sight is not of faith.\u003c/p\u003e \n\u003cp\u003eThere is a self-opening gate which is sometimes used in country roads. It stands fast and firm across the road as a traveler approaches it. If he stops before he gets to it, it will not open. But if he will drive right at it, his wagon wheels press the springs below the roadway, and the gate swings back to let him through. He must push right on at the closed gate, or it will continue to be closed.\u003c/p\u003e \n\u003cp\u003eThis illustrates the way to pass every barrier on the road of duty. Whether it is a river, a gate, or a mountain, all the child of Jesus has to do is to go for it. If it is a river, it will dry up when you put your feet in its waters. If it is a gate, it will fly open when you are near enough to it, and are still pushing on. If it is a mountain, it will be lifted up and cast into a sea when you come squarely up, without flinching, to where you thought it was. Is there a great barrier across your path of duty just now? Just go for it, in the name of the Lord, and it won\u0027t be there. ━Henry Clay Trumbull.\u003c/p\u003e \n\u003cp\u003eWe sit and weep in vain. The voice of the Almighty said, \"Up and onward forevermore.\" Let us move on and step out boldly, though it be into the night, and we can scarcely see the way. The path will open, as we progress, like the trail through the forest, or the Alpine pass, which discloses but a few rods of its length from any single point of view. Press on! If necessary, we will find even the pillar of cloud and fire to mark our journey through the wilderness. There are guides and wayside inns along the road. We will find food, clothes and friends at every stage of the journey, and as Rutherford so quaintly says: \"However matters go, the worst will be a tired traveler and a joyful and sweet welcome home.\"\u003c/p\u003e \n\u003cp\u003eI\u0027m going by the upper road, for that\u003c/p\u003e \n\u003cp\u003estill holds the sun,\u003c/p\u003e \n\u003cp\u003eI\u0027m climbing through night\u0027s pastures where\u003c/p\u003e \n\u003cp\u003ethe starry rivers run:\u003c/p\u003e \n\u003cp\u003eIf you should think to seek me in my\u003c/p\u003e \n\u003cp\u003eold dark abode,\u003c/p\u003e \n\u003cp\u003eYou\u0027ll find this writing on the door,\u003c/p\u003e \n\u003cp\u003e\"He\u0027s on the Upper Road.\" \u003c/p\u003e \n\u003cp\u003e━Selected \u003c/p\u003e \n\u003cp\u003e七月二日\u003c/p\u003e \n\u003cp\u003e“你行走，脚步必不至狭窄” （箴四：12）\u003c/p\u003e \n\u003cp\u003e神从来不替我们预先建筑一架信心的桥梁来等待我们经过的，必须等我们走到那里，祂纔为我们开路。如果祂先替我们建筑好了，那就不能称作“信心的桥梁”了，眼见的不能算作信心。\u003c/p\u003e \n\u003cp\u003e一个花园大门旁边有一种出口的小门。当我们行近那门的时候，它一点都没有变动。我们在它旁边站立一天，仍旧不会见它打开一点。但是如果我们向前走去，门上的机轮经了人体的推动，就会向左转动；这样，便给我们一个出口。\u003c/p\u003e \n\u003cp\u003e走信心的道路，也是如此。无论我们的拦阻是江河，是铜门，是高山，我们只要大着胆向前走去就是了。如果是一道江河，当我们脚一入水的时候，江河便会变成干地。如果是一扇铜门，当我们向前推进的时候，铜门便会自动开展。如果是一座高山，当我们奋勇前进的时候，高山便会倒入海中。读者，你的道路上现在有没有东西在拦阻你前进？你只要奉主的名向前走去，一切的拦阻都会冰消瓦解了。━崔伦保\u003c/p\u003e \n\u003cp\u003e我们坐着哭泣有甚么用处呢？全能者说：“起来，一直向前走去。”虽然夜已深了，前面的途径颇难分辨，我们还该大胆举步前进。等我们到了前面，途径自会分明的。在必需的时候，我们也能得到云柱和火柱的引领。沿途都有向导和客店为我们预备着。一路上我们随处能彀找到食物，衣服和朋友。罗斯福特说得顶好：“无论在甚么环境中，我们疲倦的时候，总会得到一些甜蜜的欢迎和招待”。\u003c/p\u003e \n\u003cp\u003e我已踏上登高的道路，\u003c/p\u003e \n\u003cp\u003e高处永远有阳光照耀，\u003c/p\u003e \n\u003cp\u003e夜里越过原野的时候，\u003c/p\u003e \n\u003cp\u003e溪流里反映出繁星的笑。\u003c/p\u003e \n\u003cp\u003e假若你为了找我，\u003c/p\u003e \n\u003cp\u003e到了那黑暗的故寓，\u003c/p\u003e \n\u003cp\u003e你将发现门上的通告，\u003c/p\u003e \n\u003cp\u003e他已乘风飞去，登上高原。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5253.html","bookId":475,"creation":"Aug 2, 2019 6:45:03 AM","modification":"Aug 2, 2019 6:45:03 AM"}
