{"id":15148,"no":191,"title":"July 10","content":"\u003cp\u003e\"I called upon him, but he gave me no answer. \" (S. of Sol. 5:6)\u003c/p\u003e \n\u003cp\u003eThe Lord, when He hath given great faith, hath been known to try it by long delayings. He has suffered His servants\u0027 voices to echo in their ears as from a brazen sky. They have knocked at the golden gate, but it has remained unmovable, as though it were rusted upon its hinges. Like Jeremiah, they have cried, \"Thou hast covered thyself with a cloud,that our prayer should not pass through.\"(Lam3:44)\u003c/p\u003e \n\u003cp\u003eThus have true saints continued long in patient waiting without reply, not because their prayers were not vehement, nor because they were unaccepted, but because it so pleased Him who is a Sovereign, and who gives according to His own pleasure. If it pleases Him to bid our patience exercise itself, shall He not do as He will with His own!\u003c/p\u003e \n\u003cp\u003eNo prayer is lost. Praying breath was never spent in vain. There is no such thing as prayer unanswered or unnoticed by God, and some things that we count refusals or denials are simply delays. ━H. Bonar.\u003c/p\u003e \n\u003cp\u003eChrist sometimes delays His help that He may try our faith and quicken our prayers. The boat may be covered with the waves, and He sleeps on; but He will wake up before it sinks. He sleeps, but He never oversleeps; and there are no \"too lates\" with Him. ━Alexander Maclaren\u003c/p\u003e \n\u003cp\u003eBe still, sad soul! lift thou no passionate cry,\u003c/p\u003e \n\u003cp\u003eBut spread the desert of thy being bare\u003c/p\u003e \n\u003cp\u003eTo the full searching of the All-seeing eye;\u003c/p\u003e \n\u003cp\u003eWait! and through dark misgiving, black despair,\u003c/p\u003e \n\u003cp\u003eGod will come down in pity, and fill the dry\u003c/p\u003e \n\u003cp\u003eDead place with light, and life, and vernal air.\u003c/p\u003e \n\u003cp\u003e━J. C. Shairp \u003c/p\u003e \n\u003cp\u003e七月十日\u003c/p\u003e \n\u003cp\u003e“我呼叫祂，祂却不回答\" （歌五：6）\u003c/p\u003e \n\u003cp\u003e神常常喜欢在赐给我们信心以后，用迟延的方法来试炼我们的信心。祂常常容忍祂的仆人们大声呼喊着，却不去回答他们。他们推着门，门却依然丝毫不动，好似门键上长满了铁锈一般。他们常像杰里迈亚一样哀呼，“你以黑云遮蔽自己，以至祷告不得透入”（哀三：44）\u003c/p\u003e \n\u003cp\u003e许多忠信的圣徒都曾持久不变地耐心等候，可是他们还没有得到答复，这并不是因为他们的祷告不够迫切，也不是他们的祷告不蒙悦纳，乃是神喜欢这样━神是天地的主，祂可以按照祂自己的意旨赐恩给我们。如果祂喜欢让我们忍耐经过试炼，为甚么不可以呢？\u003c/p\u003e \n\u003cp\u003e没有一个祷告会虚耗。我们的祷告神从来不会不答应或者不注意；有许多事情我们以为被拒绝了，实在，祇是迟延罢了。━彭纳\u003c/p\u003e \n\u003cp\u003e主有时延迟祂的救助，为着要试炼我们的信心，催促我们的祈祷。船被波浪掩盖了，耶稣却仍睡着；但是在船沉以前，祂自然会醒过来的。祂睡是睡，却从来不会睡过度；在祂没有“太迟了”的事情。━马克拉伦\u003c/p\u003e \n\u003cp\u003e安静，悲恸的人，不要哀哭悲哽，\u003c/p\u003e \n\u003cp\u003e把你生命中那荒漠似的阴影，\u003c/p\u003e \n\u003cp\u003e给无所不见的神细细辨明。\u003c/p\u003e \n\u003cp\u003e等待，经过了黑暗可怕的困境，\u003c/p\u003e \n\u003cp\u003e神将怀着怜悯来临，给干枯荒漠，\u003c/p\u003e \n\u003cp\u003e充满生命的活力和炯炯光明。\u003c/p\u003e \n\u003cp\u003e━ 薛普\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5261.html","bookId":475,"creation":"Aug 2, 2019 6:45:23 AM","modification":"Aug 2, 2019 6:45:23 AM"}
