{"id":14959,"no":2,"title":"January 2","content":"“And there was an enlarging, and a winding about still upward to the side chambers: for the winding about of the house went still upward round about the house: therefore the breadth of the house was still upward and so increased from the lowest chamber to the highest by the midst.“ (Ezek. 41:7)\n\u003cbr\u003e\n\u003cbr\u003e“Still upward be thine onward course:\n\u003cbr\u003e\n\u003cbr\u003eFor this I pray today;\n\u003cbr\u003e\n\u003cbr\u003eStill upward as the years go by,\n\u003cbr\u003e\n\u003cbr\u003eAnd seasons pass away.\n\u003cbr\u003e\n\u003cbr\u003e“Still upward in this coming year,\n\u003cbr\u003e\n\u003cbr\u003eThy path is all untried;\n\u003cbr\u003e\n\u003cbr\u003eStill upward may’st thou journey on,\n\u003cbr\u003e\n\u003cbr\u003eClose by thy Savior’s side.\n\u003cbr\u003e\n\u003cbr\u003e“Still upward e’en though sorrow come,\n\u003cbr\u003e\n\u003cbr\u003eAnd trials crush thine heart;\n\u003cbr\u003e\n\u003cbr\u003eStill upward may they draw thy soul,\n\u003cbr\u003e\n\u003cbr\u003eWith Christ to walk apart.\n\u003cbr\u003e\n\u003cbr\u003eWe ought not to rest content in the mists of the valley when the summit of Tabor awaits us. How pure are the dews of the hills, how fresh is the mountain air, how rich the fare of the dwellers aloft, whose windows look into the New Jerusalem! Many saints are content to live like men in coal mines, who see not the sun. Tears mar their faces when they might anoint them with celestial oil. Satisfied I am that many a believer pines in a dungeon when he might walk on the palace roof, and view the goodly land and Lebanon. Rouse thee, O believer, from thy low condition! Cast away thy sloth, thy lethargy, thy coldness, or whatever interferes with thy chaste and pure love to Christ. Make Him the source, the center, and the circumference of all thy soul’s range of delight. Rest no longer satisfied with thy dwarfish attainments. Aspire to a higher, a nobler, a fuller life. Upward to heaven! Nearer to God! – Spurgeon.\n\u003cbr\u003e\n\u003cbr\u003e“I want to scale the utmost height,\n\u003cbr\u003e\n\u003cbr\u003eAnd catch a gleam of glory bright;\n\u003cbr\u003e\n\u003cbr\u003eBut still I’ll pray, till heaven I’ve found,\n\u003cbr\u003e\n\u003cbr\u003eLord, lead me on to higher ground!”\n\u003cbr\u003e\n\u003cbr\u003eNot many of us are living at our best. We linger in the lowlands because we are afraid to climb the mountains. The steepness and ruggedness dismay us, and so we stay in the misty valleys and do not learn the mystery of the hills. We do not know what we lose in our self-indulgence, what glory awaits us if only we had courage for the mountain climb, what blessing we should find if only we would move to the uplands of God. ━ J. R. M.\n\u003cbr\u003e\n\u003cbr\u003e“Too low they build who build beneath the stars.”\n\u003cbr\u003e\n\u003cbr\u003e一月二日\n\u003cbr\u003e\n\u003cbr\u003e　 “这围殿的旁屋，越高越宽。因旁屋围殿悬迭而上；所以越上越宽，从下一层，由中一层，到上一层。” （结四十一：7）\n\u003cbr\u003e\n\u003cbr\u003e愿你的前程永远向高向上,\n\u003cbr\u003e\n\u003cbr\u003e今天我就为此祷告而瞻望；\n\u003cbr\u003e\n\u003cbr\u003e随着岁月推移,季节更新，\n\u003cbr\u003e\n\u003cbr\u003e愿你的前程永远向高向上。\n\u003cbr\u003e\n\u003cbr\u003e愿你天天继续向高向上,\n\u003cbr\u003e\n\u003cbr\u003e你的前途等你去开创，\n\u003cbr\u003e\n\u003cbr\u003e愿你继续向高向上,\n\u003cbr\u003e\n\u003cbr\u003e一直到救主的身旁。\n\u003cbr\u003e\n\u003cbr\u003e虽然苦难磨折你,悲怆临到你；\n\u003cbr\u003e\n\u003cbr\u003e你仍要向高向上,\n\u003cbr\u003e\n\u003cbr\u003e魔鬼设计引诱你离开基督，\n\u003cbr\u003e\n\u003cbr\u003e但你仍要向高向上。\n\u003cbr\u003e\n\u003cbr\u003e　　能在平地上驰驱，不该就算知足，我们还该力求登峰造极。在山顶上，露珠何等光明、美丽，空气多么清洁、新鲜，居民何其幽逸、清高，他们一推窗就可望见新耶路撒冷！\n\u003cbr\u003e\n\u003cbr\u003e　　多少信徒甘心乐意地过着矿工一般的生活，终日不见天日。他们的脸上原该膏着天上的喜乐油，可是却抹着泪珠。他们原该在宫殿顶上散步，欣赏利巴嫩的美景，可是却满足于牢狱中的枯萎。醒来罢，信徒们，离开你的平地，努力向上罢！丢去你的倦、懒、冷，以及一切拦阻你向上追求基督的。让基督作你的源头、你的中心，要让祂在万有上居首位。不要满意你目前所有的。渴望一个更高、更贵、更丰更富的生命。向着天！追求更近神！━司布真\n\u003cbr\u003e\n\u003cbr\u003e我愿攀登绝顶，\n\u003cbr\u003e\n\u003cbr\u003e沾得一缕神的容光；\n\u003cbr\u003e\n\u003cbr\u003e到达之前，我仍要不断祈求，\n\u003cbr\u003e\n\u003cbr\u003e主啊：引我升向更上方。\n\u003cbr\u003e\n\u003cbr\u003e　　我们中间没有多少人真是尽我们所能的活着。我们留恋在地上，因为我们怕攀山越岭。山程的崎岖、峻峭，寒了我们的心，因此我们终生耽搁在雾谷中，从不会了解山顶上的佳境。啊！宽容自己的损失何其大啊！只要我们肯决心登高寻求神，前面有极大的荣耀和祝福等着我们。━密勒\n\u003cbr\u003e\n\u003cbr\u003e繁星之下的建造者,他们所建造太渺少。  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4823.html","bookId":475,"creation":"Aug 2, 2019 6:37:02 AM","modification":"Aug 2, 2019 6:37:02 AM"}
