{"id":15160,"no":203,"title":"July 22","content":"\u003cp\u003e\"And therefore will the Lord wait, that he may be gracious unto you...blessed are all they that wait for him.\" (Isa. 30:18.) \u003c/p\u003e \n\u003cp\u003eWE must not only think of our waiting upon God, but also of what is more wonderful still, of God\u0027s waiting upon us. \u003c/p\u003e \n\u003cp\u003eThe vision of Him waiting on us, will give new impulse and inspiration to our waiting upon Him. It will give us unspeakable confidence the our waiting cannot be in vain.\u003c/p\u003e \n\u003cp\u003eLet us seek even now, at this moment, in the spirit of waiting on God, to find out something of what it means. He has inconceivably glorious purposes concerning every one of His children. And you ask, \"How is it, if He waits to be gracious, that even after I come and wait upon Him, He does not give the help I seek, but waits on longer and longer?\" \u003c/p\u003e \n\u003cp\u003eGod is a wise husbandman, \"who waiteth for the precious fruit of the earth, and hath long patience for it.\" (Jas.5:7) He cannot gather the fruit till it is ripe.He knows when we are spiritually ready to receive the blessing to our profit and His glory. Waiting in the sunshine of His love in what will ripen the soul for His blessing. Waiting under the cloud of trial, that breaks in showers of blessings, is as needful. Be assured that if God waits longer than you could wish, it is only to make the blessing doubly precious. God waited four thousand years, till the fullness of time, ere He sent His Son. \u003c/p\u003e \n\u003cp\u003eOur times are in His hands; He will avenge His elect speedily; He will make haste for our help, and not delay one hour too long. --- Andrew Murray. \u003c/p\u003e \n\u003cp\u003e七月二十二日\u003c/p\u003e \n\u003cp\u003e「耶和华必然等候，要施恩给你们....凡等候祂的，都是有福的。」（赛三十:18） \u003c/p\u003e \n\u003cp\u003e　　我们不该单想到我们在等候神，也应该想到更奇异的━神在等候我们。 \u003c/p\u003e \n\u003cp\u003e　　我们若看见祂在等候我们，这会给我们新的鼓舞、新的激励，来等候祂；这也会给我们极大的平安━知道我们的等候不是徒然的。 \u003c/p\u003e \n\u003cp\u003e　　也许你要问：「既然祂在等候施恩，为什么我来等候祂的时候，祂仍不给我所寻找的帮助，而继续等候着呢？」 \u003c/p\u003e \n\u003cp\u003e　　亲爱的读者，神是一位聪明的农夫，祂「忍耐等候地里宝贵的出产」（雅各布书五章7节）。如果出产尚未成熟，祂就不能收割。 祂知道什么时候我们的灵可以接受祝福来荣耀祂。在祂爱的阳光下等候会叫我们渐渐成熟，在试炼的黑云下等候也是如此。神在差遣祂儿子到世上来以前，自己曾等候了四千年，为的是要等候最适当的时期。 \u003c/p\u003e \n\u003cp\u003e　　亲爱的读者，祂替祂选民复仇的日子快到了，祂就要起来帮助我们了，祂决不会迟延太久，叫我们多等一刻的。── 慕安得烈\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5273.html","bookId":475,"creation":"Aug 2, 2019 6:45:56 AM","modification":"Aug 2, 2019 6:45:56 AM"}
