{"id":15171,"no":214,"title":"August 2","content":"\u003cp\u003e\"I will make all my mountains a way\" (Isa.49:11).\u003c/p\u003e \n\u003cp\u003eGod will make obstacles serve His purpose. We all have mountains in our lives. There are people and things that threaten to bar our progress in the Divine life. Those heavy claims, that uncongenial occupation, that thorn in the flesh, that daily cross--we think that if only these were removed we might live purer, tenderer, holier lives; and often we pray for their removal. \u003c/p\u003e \n\u003cp\u003e\"Oh, fools, and slow of heart!\" (Lk.24:25) These are the very conditions of achievement; they have been put into our lives as the means to the very graces and virtues for which we have been praying so long. Thou hast prayed for patience through long years, but there is something that tries thee beyond endurance; thou hast fled from it, evaded it, accounted it an unsurmountable obstacle to the desired attainment, and supposed that its removal would secure thy immediate deliverance and victory. \u003c/p\u003e \n\u003cp\u003eNot so! Thou wouldest gain only the cessation of temptations to impatience. But this would not be patience. Patience can be acquired only through just such trials as now seem unbearable. \u003c/p\u003e \n\u003cp\u003eGo back; submit thyself. Claim to be a partaker in the patience of Jesus. Meet thy trials in Him. There is nothing in life which harasses and annoys that may not become subservient to the highest ends. They are His mountains. He puts them there. We know that God will not fail to keep His promise. \"God understandeth the way thereof and knoweth the place thereof. For he looketh to the ends of the earth, and seeth under the whole heaven\"; (Job.28:23-24) and when we come to the foot of the mountains, we shall find the way.--Christ in Isaiah, by Meyer \u003c/p\u003e \n\u003cp\u003e\"The meaning of trial is not only to test worthiness, but to increase it; as the oak is not only tested by the storm, but toughened by them.\" \u003c/p\u003e \n\u003cp\u003e八月二日\u003c/p\u003e \n\u003cp\u003e「我必使我的众山成为大道。」（赛四十九11）　　\u003c/p\u003e \n\u003cp\u003e神常常利用障碍来完成祂的旨意，所以我们各人在生活上都会遇到高山━恫吓我们、阻碍我们属灵生活前进的人们；苛刻的要求；性情不相投的职业；肉体上的刺；每天的十字架━我们常常想：只要这些东西除去了，我们的生活就会变得更纯粹、更温柔、更圣洁；所以我们常常求神将它们除去。 \u003c/p\u003e \n\u003cp\u003e「无知的人哪….你们的心….太迟钝了！」（路廿四25）这些正是成功的条件；这些正是神放在我们生活中，叫我们得到恩惠和德行的方法。也许你现在有一件不能忍受的试炼，你一看见就逃避、就闪躲，当作你成功的障碍，你以为它一除去，你就能立刻得到释放和胜利。 \u003c/p\u003e \n\u003cp\u003e亲爱的读者阿，事实并不是这样！当试炼一停止的时候，你所能得到的，即是急躁，不是忍耐。忍耐只能在似乎不堪忍受的试炼中求得的。 \u003c/p\u003e \n\u003cp\u003e回去容忍罢！做一个有分于主的忍耐的人！战胜在祂里面的一切试炼！要记得你生活上困恼和烦扰，没有一点是徒然的。它们都是神的山━是神将它们放在那里的。我们知道「神明白智慧的所在。因祂鉴察直到地极，遍观普天之下」（伯廿八23-24）；当我们走到山脚下的时候，我们就要看见智慧的道路了。──梅尔\u003c/p\u003e \n\u003cp\u003e试炼的意义，不单是试验一件东西的价值，并且是增加这东西的价值；正如同风雨不单是击打橡树，并且增加像树的坚韧。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5298.html","bookId":475,"creation":"Aug 2, 2019 6:46:25 AM","modification":"Aug 2, 2019 6:46:25 AM"}
