{"id":15172,"no":215,"title":"August 3","content":"\u003cp\u003e\"Quit you like men, be strong\" (1 Cor. 16:13). \u003c/p\u003e \n\u003cp\u003eDo not pray for easy lives! Pray to be stronger men. Do not pray for tasks equal to your powers. Pray for powers equal to your tasks. Then the doing of your work shall be no miracle, but you shall be a miracle. --Phillips Brooks. \u003c/p\u003e \n\u003cp\u003eWe must remember that it is not in any easy or self-indulgent life that Christ will lead us to greatness. The easy life leads not upward, but downward. Heaven always is above us, and we must ever be looking up toward it. These are some people who always avoid things that are costly, that require self-denial, or self-restraint and sacrifice, but toil and hardship show us the only way to nobleness. Greatness comes not by having a mossy path made for you through the meadow, but by being sent to hew out a roadway by your own hands. Are you going to reach the mountain splendors? --Selected. \u003c/p\u003e \n\u003cp\u003eBe strong !\u003c/p\u003e \n\u003cp\u003eWe are not here to play to dream, to drift;\u003c/p\u003e \n\u003cp\u003eWe have hard work to do, and loads to lift.\u003c/p\u003e \n\u003cp\u003eShun not the struggle; face it. Tis God\u0027s gift.\u003c/p\u003e \n\u003cp\u003eBe strong !\u003c/p\u003e \n\u003cp\u003eSay not the days are evil-Who\u0027s to blame?\u003c/p\u003e \n\u003cp\u003eAnd fold the hands and acquiesce-O shame!\u003c/p\u003e \n\u003cp\u003eStand up, speak out, and bravely, In God\u0027s name.\u003c/p\u003e \n\u003cp\u003eBe strong !\u003c/p\u003e \n\u003cp\u003eIt matters not how deep entrenched the wrong,\u003c/p\u003e \n\u003cp\u003eHow hard the battle goes, the day how long,\u003c/p\u003e \n\u003cp\u003eFaint not, fight on.! Tomorrow comes the song.\u003c/p\u003e \n\u003cp\u003e-Maltbie D. Babcock \u003c/p\u003e \n\u003cp\u003e八月三日\u003c/p\u003e \n\u003cp\u003e「要作大丈夫，要刚强。」（林前十六13） \u003c/p\u003e \n\u003cp\u003e不要求安乐的生活，要求作刚强的大丈夫。不要求与你能力相等的工作，要求与你工作相等的能力。这样，你所行的算不得神迹，你自己却是一个神迹。━白罗克斯\u003c/p\u003e \n\u003cp\u003e我们必须记得：在一个安乐的、放纵的生活中，神不能引领我们前进。安乐的生活不能引领我们向上，只会带领我们向下。天总是在我们上面的，所以我们必须时时望着上面。许多人常常喜欢逃避那些要出代价、自制、克己、牺牲的事情，但是我告诉你们：祇有劳苦和困难是走向尊贵的惟一路径。伟大不是从一条为你开好的现成的青草路上来的，乃是从一条要你亲手去凿的道路来的。──选\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5299.html","bookId":475,"creation":"Aug 2, 2019 6:46:28 AM","modification":"Aug 2, 2019 6:46:28 AM"}
