{"id":14980,"no":23,"title":"January 23","content":"\"Why standest thou afar off, O Lord?\" (Psalm 10:1)\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003eGod is \"a very present help in trouble.\" (Ps.46:1)But He permits trouble to pursue us, as though He were indifferent to its overwhelming pressure, that we may be brought to the end of ourselves, and led to discover the treasure of darkness, the unmeasurable gains of tribulation. We may be sure that He who permits the suffering is with us in it. It may be that we shall see Him only when the trial is passing; but we must dare to believe that He never leaves the crucible. Our eyes are holden; and we cannot behold Him whom our soul loveth. It is dark━the bandages blind us so that we cannot see the form of our High Priest; but He is there, deeply touched. Let us not rely on feeling, but on faith in His unswerving fidelity; and though we see Him not, let us talk to Him. Directly we begin to speak to Jesus, as being literally present, though His presence is veiled, there comes an answering voice which shows that He is in the shadow, keeping watch upon His own. Your Father is as near when you journey through the dark tunnel as when under the open heaven! ━Daily Devotional Commentary\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"What though the path be all unknown?\n\u003cbr\u003e\n\u003cbr\u003eWhat though the way be drear?\n\u003cbr\u003e\n\u003cbr\u003eIts shades I traverse not alone\n\u003cbr\u003e\n\u003cbr\u003eWhen steps of Thine are near.\"\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e一月二十三日\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“耶和华啊，祢为甚么站在远处？“ （诗十：1）\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　神确然是我们“在患难中随时的帮助”（诗四十六：1）。但是祂常常一面许可患难追逼我们，一面又自己站在远处隐藏起来好似不关心我们的样子，这样好叫我们自己的帮助告一结束，而看见从患难中能得到无限的教训和益处。让我们深信那许可患难临到我们的神，是和我们一同在患难中。也许要等到试炼过去的时候，我们纔能看见祂；可是我们敢相信祂从来没有离开过我们。我们的眼睛迷糊了；我们不能看见祂。在黑暗中我们的眼睛似乎是瞎了，不能看见我们大祭司的影踪；但是祂终究和我们同在，和我们深深地接触着。让我们不依靠感觉，不凭眼见，惟独根据于神是信实的；虽然我们看不见祂，让我们和祂说话。我们一开始和祂说话，深信祂的同在，虽然祂的同在我们看不见，我们就会得到祂答应的声音，这就证明祂在黑暗中始终眷顾我们。我们无论在黑暗的通道中，无论在光明的天路中，我们的父是一样偎近我们的。━译自日诚报\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e卽使途径陌生，这有何妨？\n\u003cbr\u003e\n\u003cbr\u003e卽使道路艰难，又有何妨？\n\u003cbr\u003e\n\u003cbr\u003e我并非在黑暗中独自彷徨\n\u003cbr\u003e\n\u003cbr\u003e因为你的脚步就在近边。  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4844.html","bookId":475,"creation":"Aug 2, 2019 6:37:59 AM","modification":"Aug 2, 2019 6:37:59 AM"}
