{"id":14981,"no":24,"title":"January 24","content":"\"But the dove found no rest for the sole of her foot, and she returned unto him...And the dove came in to him in the evening; and, lo, in her mouth was an olive leaf.\" (Gen. 8:9-11)\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003eGod knows just when to withhold from us any visible sign of encouragement, and when to grant us such a sign. How good it is that we may trust Him anyway! When all visible evidences that He is remembering us are withheld, that is best; He wants us to realize that His Word, His promise of remembrance, is more substantial and dependable than any evidence of our senses. When He sends the visible evidence, that is well also; we appreciate it all the more after we have trusted Him without it. Those who are readiest to trust God without other evidence than His Word always receive the greatest number of visible evidences of His love. ━C. G. Trumbull\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"Believing Him; if storm-clouds gather darkly \u0027round,\n\u003cbr\u003e\n\u003cbr\u003eAnd even if the heaven seem brass, without a sound?\n\u003cbr\u003e\n\u003cbr\u003eHe hears each prayer and even notes the sparrow\u0027s fall.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"And praising Him; when sorrow, grief, and pain are near,\n\u003cbr\u003e\n\u003cbr\u003eAnd even when we lose the thing that seems most dear?\n\u003cbr\u003e\n\u003cbr\u003eOur loss is gain. Praise Him; in Him we have our All.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"Our hand in His; e\u0027en though the path seems long and drear\n\u003cbr\u003e\n\u003cbr\u003eWe scarcely see a step ahead, and almost fear?\n\u003cbr\u003e\n\u003cbr\u003eHe guides aright. He has it thus to keep us near.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"And satisfied; when every path is blocked and bare,\n\u003cbr\u003e\n\u003cbr\u003eAnd worldly things are gone and dead which were so fair?\n\u003cbr\u003e\n\u003cbr\u003eBelieve and rest and trust in Him, He comes to stay.\"\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003eDelays are not refusals; many a prayer is registered, and underneath it the words: \"My time is not yet come.\" God has a set time as well as a set purpose, and He who orders the bounds of our habitation orders also the time of our deliverance. ━Selected\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e　\n\u003cbr\u003e\n\u003cbr\u003e一月二十四日\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“但…鸽子找不着落脚之地就回到…挪亚那里…到了晚上，鸽子回到他那里，嘴里叼着一个…橄榄叶子“ （创八：9-11）\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　神知道甚么时候该不给我们看得见的凭据，甚么时候给我们看得见的凭据。我们若能完全信靠祂，这是何等美好的一件事呢？当所有眼见的凭据都收回了的时候，是最美好的时候；因为神的美旨是要我们承认：祂的话语，祂的应许，祂的恩约，比我们眼见的一切凭据更实在，更可靠。神若给我们眼见的凭据，也好；也是可宝贵的。那些只信神的话而不用其它凭据的人们，常得到许多看得见的凭据。━崔伦保\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e相信祂；卽使暴风欲来，乌云盖天，\n\u003cbr\u003e\n\u003cbr\u003e即使穹苍如铜号，却默然无声，\n\u003cbr\u003e\n\u003cbr\u003e祂听清楚你的祷告中的每一句言语，\n\u003cbr\u003e\n\u003cbr\u003e甚之连麻雀轻轻落地之声祂都听闻。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e赞美祂，如果忧愁悲痛已到眼前，\n\u003cbr\u003e\n\u003cbr\u003e卽使连我们以为最亲爱的事物遭受损失！\n\u003cbr\u003e\n\u003cbr\u003e可是损失卽是获得，\n\u003cbr\u003e\n\u003cbr\u003e赞美祂，从神那里什么都全备。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e祂紧握我们的手，\n\u003cbr\u003e\n\u003cbr\u003e纵使路途遥远又可怖，\n\u003cbr\u003e\n\u003cbr\u003e战兢恐惧前途一步亦看不清，\n\u003cbr\u003e\n\u003cbr\u003e祂正在引导我，只要我紧紧依附祂！\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e当人世一切珍贵如浮云消散，\n\u003cbr\u003e\n\u003cbr\u003e荒凉寂寞，走头无路，\n\u003cbr\u003e\n\u003cbr\u003e你该满足，因为信靠了祂，\n\u003cbr\u003e\n\u003cbr\u003e绝对不会使你缺任何。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　暂缓不是拒绝。许多祷告上批着：“我的时候还没有到”。神有规定的旨意也有规定的时间。━选  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4845.html","bookId":475,"creation":"Aug 2, 2019 6:38:02 AM","modification":"Aug 2, 2019 6:38:02 AM"}
