{"id":15203,"no":246,"title":"September 3","content":"\u003cp\u003e\"And he saw them toiling in rowing\" (Mark 6:48).\u003c/p\u003e \n\u003cp\u003eStraining, driving effort does not accomplish the work God gives man to do. Only God Himself, who always works without strain, and who never overworks, can do the work that He assigns to His children. When they restfully trust Him to do it, it will be well done and completely done. The way to let Him do His work through us is to partake of Christ so fully, by faith, that He more than fills our life. \u003c/p\u003e \n\u003cp\u003eA man who had learned this secret once said: \"I came to Jesus and I drank, and I do not think that I shall ever be thirsty again. I have taken for my motto, \u0027Not overwork, but overflow\u0027; and already it has made all the difference in my life.\" \u003c/p\u003e \n\u003cp\u003eThere is no effort in overflow. It is quietly irresistible. It is the normal life of omnipotent and ceaseless accomplishment into which Christ invites us today and always.--Sunday School Times \u003c/p\u003e \n\u003cp\u003eBe all at rest, my soul, 0 blessed secret,\u003c/p\u003e \n\u003cp\u003eOf the true life that glorifies thy Lord:\u003c/p\u003e \n\u003cp\u003eNot always doth the busiest soul best serve Him,\u003c/p\u003e \n\u003cp\u003eBut he that resteth on His faithful Word.\u003c/p\u003e \n\u003cp\u003eBe all at rest, let not)our heart be rippled,\u003c/p\u003e \n\u003cp\u003eFor tiny wavelets mar the image fair,\u003c/p\u003e \n\u003cp\u003eWhich the still pool reflects of heaven\u0027s glory---\u003c/p\u003e \n\u003cp\u003eAnd thus the image He would have thee bear.\u003c/p\u003e \n\u003cp\u003eBe all al rest, my soul, for rest is service,\u003c/p\u003e \n\u003cp\u003eTo the still heart God doth His secrets tell;\u003c/p\u003e \n\u003cp\u003eThus shalt thou learn to wait, and watch, and labor,\u003c/p\u003e \n\u003cp\u003eStrengthened to bear, since Christ in thee doth dwell.\u003c/p\u003e \n\u003cp\u003eFor what is service but the life of Jesus,\u003c/p\u003e \n\u003cp\u003eLived through a vessel of earth\u0027s fragile clay\u003c/p\u003e \n\u003cp\u003eLoving and giving and poured forth for others,\u003c/p\u003e \n\u003cp\u003eA living sacrifice from day to day.\u003c/p\u003e \n\u003cp\u003eBe all al rest, so shalt thou be an answer\u003c/p\u003e \n\u003cp\u003eTo those who queslion, “Who is God and where?”\u003c/p\u003e \n\u003cp\u003eFor God is rest, and- where He dwells is stillness,\u003c/p\u003e \n\u003cp\u003eAnd they who dwell in Him, His rest shall share.\u003c/p\u003e \n\u003cp\u003eAnd what shall meet the deep unrest around thee,\u003c/p\u003e \n\u003cp\u003eBut the calm peace of God that filled His breast?\u003c/p\u003e \n\u003cp\u003eFor still a living Voice calls to the weary,\u003c/p\u003e \n\u003cp\u003eFrom Him who said, “ Come unto Me and rest.”\u003c/p\u003e \n\u003cp\u003e-Freda Hanbury Allen\u003c/p\u003e \n\u003cp\u003e\"In resurrection stillness there is resurrection power.\" \u003c/p\u003e \n\u003cp\u003e九月三日\u003c/p\u003e \n\u003cp\u003e「看见门徒……摇橹甚苦。」（可六48）\u003c/p\u003e \n\u003cp\u003e我们不能靠自己的努力，来成就神所给我们的工作。神所委派的工作，只有神自己能。我们如果安安静静地信托祂去做，我们就要看见：事情做得又好、又完全。那么，我们用甚么方法让祂藉我们来做呢？没有别的，只要完全用信心享用基督，深信祂已经充满了我们的生命。 \u003c/p\u003e \n\u003cp\u003e有一次，一位已经学到这个秘诀的弟兄说：「我已经在耶稣里喝了祂所赐的活水，所以我永远不会再渴了。我的格言是：『不要过劳，乃要过溢。』这个格言已经叫我的生活和从前完全不同了。」 \u003c/p\u003e \n\u003cp\u003e过溢是不需要费力的，是闲逸的，是无可抵抗的。这种全能的，无穷的成功，原是基督今天及永远所给我们享受的寻常生活。－－译自主日学报\u003c/p\u003e \n\u003cp\u003e复活的静止中，含蓄着复活的能力。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5394.html","bookId":475,"creation":"Aug 2, 2019 6:47:54 AM","modification":"Aug 2, 2019 6:47:54 AM"}
