{"id":15204,"no":247,"title":"September 4","content":"\u003cp\u003e\"And when you hear the sound of the trumpet, all the people shall shout with a great shout; and the wall of the city shall fall down flat, and the people shall ascend up every man straight before him\" (Joshua 6:5).\u003c/p\u003e \n\u003cp\u003eThe shout of steadfast faith is in direct contrast to the moans of wavering faith, and to the wails of discouraged hearts. Among the many \"secrets of the Lord,\" I do not know of any that is more valuable than the secret of this shout of faith. The Lord said to Joshua, \"See, I have given into thine hand Jericho, and the king thereof, and the mighty men of valour.\" (Jos.6:2) He had not said, \"I will give,\" but \"I have given.\" It belonged to them already; and now they were called to take possession of it. But the great question was, How? It looked impossible, but the Lord declared His plan. \u003c/p\u003e \n\u003cp\u003eNow, no one can suppose for a moment that this shout caused the walls to fall. And yet the secret of their victory lay in just this shout, for it was the shout of a faith which dared, on the authority of God\u0027s Word alone, to claim a promised victory, while as yet there were no signs of this victory being accomplished. And according to their faith God did unto them; so that, when they shouted, He made the walls to fall. \u003c/p\u003e \n\u003cp\u003eGod had declared that He had given them the city, and faith reckoned this to be true. And long centuries afterwards the Holy Ghost recorded this triumph of faith in Hebrews: \u003c/p\u003e \n\u003cp\u003e\"By faith the walls of Jericho fell down, after they were compassed about seven days.\" (Heb.11:30) Hannah Whitall Smith.\u003c/p\u003e \n\u003cp\u003e“Faith can never reach its consummation,\u003c/p\u003e \n\u003cp\u003eTill the victor\u0027s thankful song we raise:\u003c/p\u003e \n\u003cp\u003eIn the glorious city of salvation,\u003c/p\u003e \n\u003cp\u003eGod has told us all the gates are praise.” \u003c/p\u003e \n\u003cp\u003e九月四日 \u003c/p\u003e \n\u003cp\u003e「他们吹的角声拖长，你们听见角声，众百姓要大声呼喊，城墙就必塌陷。各人都要往前直上。」（书六5）\u003c/p\u003e \n\u003cp\u003e信心的呼喊不是踌躇的呻吟，也不是失望的哀泣。在许多「耶和华的奥秘」中，我不知道有甚么比信心的呼喊更为宝贵。耶和华晓谕乔舒亚说：「看哪，我已经把耶利哥，和耶利哥的王，并大能的勇士，都交在你手中。」（书六2）祂不是说：「我将要把….」，祂乃是说：「我已经把….」。耶利哥城已经属于以色列人了；现在只叫他们去占领好了。但是问题是：如何占领呢？在人看来，这是不可能的事；于是神又详细说明了祂的计划。\u003c/p\u003e \n\u003cp\u003e没有一个人想到呼喊会使城墙倒塌。可是他们得胜的秘诀，却正在呼喊之中，因为这是一个信心的呼喊━一个敢在毫无胜利征兆的时候，单独凭神的话，向神索取所应许的胜利的信心！于是神照他们的信心给他们成全；当他们呼喊的时候，城墙果然倒塌了。\u003c/p\u003e \n\u003cp\u003e神说祂已经把耶利哥城交在他们手中了，信心就这样相信。数世纪后，圣灵还将这次信心的胜利记载在希伯来书上面：「因着信，围绕耶利哥城七日，城墙就倒塌了。」（来十一30）－－司密斯\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5395.html","bookId":475,"creation":"Aug 2, 2019 6:47:56 AM","modification":"Aug 2, 2019 6:47:56 AM"}
