{"id":15205,"no":248,"title":"September 5","content":"\u003cp\u003e\"Blessed are all they that wait for him\" (Isa 30:18).\u003c/p\u003e \n\u003cp\u003eWe hear a great deal about waiting on God. There is, however, another side. When we wait on God, He is waiting till we are ready; when we wait for God, we are waiting till He is ready.\u003c/p\u003e \n\u003cp\u003eThere are some people who say, and many more who believe, that as soon as we meet all the conditions, God will answer our prayers. They say that God lives in an eternal now; with Him there is no past nor future; and that if we could fulfill all that He requires in the way of obedience to His will, immediately our needs would be supplied, our desires fulfilled, our prayers answered. \u003c/p\u003e \n\u003cp\u003eThere is much truth in this belief, and yet it expresses only one side of the truth. While God lives in an eternal now, yet He works out His purposes in time. A petition presented before God is like a seed dropped in the ground. Forces above and beyond our control must work upon it, till the true fruition of the answer is given.--The Still Small Voice\u003c/p\u003e \n\u003cp\u003eI longed to walk along an easy road,\u003c/p\u003e \n\u003cp\u003eAnd leave behind the dull routine of home,\u003c/p\u003e \n\u003cp\u003eThinking in other fields to serve my God;\u003c/p\u003e \n\u003cp\u003eBut Jesus said, My time has not yet come.”\u003c/p\u003e \n\u003cp\u003eI longed to sow the seed in other soil,\u003c/p\u003e \n\u003cp\u003eTo be unfettered in the work, and free,\u003c/p\u003e \n\u003cp\u003eTo join with other laborers in their toil;\u003c/p\u003e \n\u003cp\u003eBut Jesus said, “Tis not My choice for thee.”\u003c/p\u003e \n\u003cp\u003eI longed to leave the desert, and be led\u003c/p\u003e \n\u003cp\u003eTo work where souls were sunk in sin and shame,\u003c/p\u003e \n\u003cp\u003eThat I might win them; but the Master said,\u003c/p\u003e \n\u003cp\u003e\"I have not called thee, publish here My name. \"\u003c/p\u003e \n\u003cp\u003eI longed to fight the battles of my King,\u003c/p\u003e \n\u003cp\u003eLift high His standards in the thickest strife;\u003c/p\u003e \n\u003cp\u003eBut my great Captain bade me wait and sing\u003c/p\u003e \n\u003cp\u003eSongs of His conquests in my quiet life.\u003c/p\u003e \n\u003cp\u003eI longed to leave the uncongenial sphere,\u003c/p\u003e \n\u003cp\u003eWhere all alone I seemed to stand and wait,\u003c/p\u003e \n\u003cp\u003eTo feel I had some human helper near,\u003c/p\u003e \n\u003cp\u003eBut Jesus bade me guard one lonely gate.\u003c/p\u003e \n\u003cp\u003eI longed to leave the round of daily toil,\u003c/p\u003e \n\u003cp\u003eWhere no one seemed to understand or care;\u003c/p\u003e \n\u003cp\u003eBut Jesus said, “I choose for thee this soil,\u003c/p\u003e \n\u003cp\u003eThat thou might \u0027st raise for Me some blossoms rare.”\u003c/p\u003e \n\u003cp\u003eAnd now I have no longing but to do\u003c/p\u003e \n\u003cp\u003eAt home, or else afar, His blessed will,\u003c/p\u003e \n\u003cp\u003eTo work amid the many or the few;\u003c/p\u003e \n\u003cp\u003eThus, \"choosing not to choose, II my heart is still.\u003c/p\u003e \n\u003cp\u003e-Selected\u003c/p\u003e \n\u003cp\u003e\"And Patience was willing to wait. \"-Pilgrim\u0027s Progress\u003c/p\u003e \n\u003cp\u003e九月五日\u003c/p\u003e \n\u003cp\u003e「凡等候祂的，都是有福的。」（赛卅18）\u003c/p\u003e \n\u003cp\u003e关于等候神的眞理，我们已经听得很多了\u003c/p\u003e \n\u003cp\u003e有些人说━也有许多人相信━我们一履行了所有的条件，神就要立即答应我们的祷告。他们说：神永远是现在的神；在神没有过去，也没有将来；如果我们能够顺服祂的旨意，实行祂的命令，立刻我们的需要可以得到供给，我们的欲望可以得到满足，我们的祷告可以得到答应。 \u003c/p\u003e \n\u003cp\u003e这种信仰也有许多眞理，但是可惜只表达了眞理的一面。神永远是现在的神，这句话一点都不错；但是神行事是有祂的「时候」的。一个呈在神前的请求，好像一粒在地里的种子。上面的力，必须多方栽培，答应纔会得到眞实的实现。－－译自微小的声音\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5396.html","bookId":475,"creation":"Aug 2, 2019 6:48:01 AM","modification":"Aug 2, 2019 6:48:01 AM"}
