{"id":15216,"no":259,"title":"September 16","content":"\u003cp\u003e\"Hide thyself by the brook Cherith\" (1 Kings 17:3)..\u003c/p\u003e \n\u003cp\u003eGod\u0027s servants must be taught the value of the hidden life. The man who is to take a high place before his fellows must take a low place before his God. We must not be surprised if sometimes our Father says: \"There, child, thou hast had enough of this hurry, and publicity, and excitement; get thee hence, and hide thyself b the brook--hide thyself in the Cherith of the sick chamber, or in the Cherith of bereavement, or in some solitude from which the crowds have ebbed away.\" \u003c/p\u003e \n\u003cp\u003eHappy is he who can reply, \"This Thy will is also mine; I flee unto Thee to hide me. Hide me in the secret of Thy tabernacle, and beneath the covert of Thy wings!\" \u003c/p\u003e \n\u003cp\u003eEvery saintly soul that would wield great power with men must win it in some hidden Cherith. The acquisition of spiritual power is impossible, unless we can hide ourselves from men and from ourselves in some deep gorge where we may absorb the power of the eternal God; as vegetation through long ages absorbed these qualities of sunshine, which it now gives back through burning coal. \u003c/p\u003e \n\u003cp\u003eBishop Andrews had his Cherith, in which he spent five hours every day in prayer and devotion. John Welsh had it--who thought the day ill spent which did not witness eight or ten hours of closet communion. David Brainerd had it in the woods of North America. Christmas Evans had it in his long and lonely journeys amid the hills of Wales. \u003c/p\u003e \n\u003cp\u003eOr, passing back to the blessed age from which we date the centuries: Patmos, the seclusion of the Roman prisons, the Arabian desert, the hills and vales of Palestine, are forever memorable as the Cheriths of those who have made our modern world. \u003c/p\u003e \n\u003cp\u003eOur Lord found His Cherith at Nazareth, and in the wilderness of Judea; amid the olives of Bethany, and the solitude of Gadara. None of us, therefore, can dispense with some Cherith where the sounds of human voices are exchanged for the waters of quietness which are fed from the throne; and where we may taste the sweets and imbibe the power of a life hidden with Christ.--Elijah, by Meyer.\u003c/p\u003e \n\u003cp\u003e九月十六日\u003c/p\u003e \n\u003cp\u003e「你离开这里……藏在……基立溪旁」（王上十七3）\u003c/p\u003e \n\u003cp\u003e神的仆人应该知隐藏生活的宝贵。我们不必惊奇，如果我们父神对我们说：「孩子，你已经有了足够的忙碌、名誉、刺激了；你离开这里，藏在溪旁━藏在病室里，藏在丧失中，藏在群众已经退去的荒僻。」\u003c/p\u003e \n\u003cp\u003e我们肯不肯这样回答呢：「父神阿，祢的旨意就是我的，我现在逃到祢这里来，求祢把我藏在帐幕的隐密处，祢翅翼的覆庇下！」\u003c/p\u003e \n\u003cp\u003e每一个属灵人如果要得着能力，必须到隐藏的基立去。若非离开人们，离开自己，到一个深峡中去吸收，属灵的能力是得不到的。\u003c/p\u003e \n\u003cp\u003e安得烈主教有他的基立，他每天花五小时在那里专心祷告。韦尔息约翰也有━如果那一天没有八小时在密室中与神交通，他就要以为这一天太浪费了。勃兰纳戴维的基立在北美洲森林里。伊文思的基立在韦尔斯山谷中。\u003c/p\u003e \n\u003cp\u003e让我们回去看看：拔摩海岛、罗马监狱、亚拉伯旷野、巴勒斯坦山谷，都是先圣永远值得记忆的基立。\u003c/p\u003e \n\u003cp\u003e主的基立在拿撒勒、犹大地的旷野、伯大尼的橄榄树下、格拉森的荒地里。我们中间没有一个人可以没有基立，因为在基立我们可以得到宝座前的安息，尝到隐藏生活的甘甜，吸取基督耶稣的能力。－－梅尔\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5407.html","bookId":475,"creation":"Aug 2, 2019 6:48:38 AM","modification":"Aug 2, 2019 6:48:38 AM"}
