{"id":15218,"no":261,"title":"September 18","content":"\u003cp\u003e\"Where there is no vision, the people perish\" (Prov. 19 :18)\u003c/p\u003e \n\u003cp\u003eWaiting upon God is necessary in order to see Him, to have a vision of Him. The time element in vision is essential. Our hearts are like a sensitive photographer\u0027s plate; and in order to have God revealed there, we must sit at His feet a long time. The troubled surface of a lake will not reflect an object. \u003c/p\u003e \n\u003cp\u003eOur lives must be quiet and restful if we would see God. There is power in the sight of some things to affect one\u0027s life. A quiet sunset will bring peace to a troubled heart. Thus the vision of God always transforms human life. \u003c/p\u003e \n\u003cp\u003eJacob saw God at Jabbok\u0027s ford, and became Israel. The vision of God transformed Gideon from a coward into a valiant soldier. The vision of Christ changed Thomas from a doubting follower into a loyal, devout disciple.\u003c/p\u003e \n\u003cp\u003eBut men have had visions of God since Bible times. William Carey saw God, and left his shoemaker\u0027s bench and went to India. David Livingstone saw God, and left all to follow Him through the jungles of dark Africa. Scores and hundreds have had visions of God, and are today in the uttermost parts of the earth working for the speedy evangelization of the heathen. \u003c/p\u003e \n\u003cp\u003e--Dr. Pardington \u003c/p\u003e \n\u003cp\u003eThere is hardly ever a complete silence in the soul. God is whispering to us well-nigh incessantly. Whenever the sounds of the world die out in the soul, or sink low, then we hear the whisperings of God. He is always whispering to us, only we do not hear, because of the noise, hurry, and distraction which life causes as it rushes on. --F. W. Faber \u003c/p\u003e \n\u003cp\u003e“Speak, Lord, in the stillness,\u003c/p\u003e \n\u003cp\u003eWhile I wait on Thee;\u003c/p\u003e \n\u003cp\u003eHushed my heart to listen\u003c/p\u003e \n\u003cp\u003eIn expectancy.”\u003c/p\u003e \n\u003cp\u003e“Speak, 0 blessed Master,\u003c/p\u003e \n\u003cp\u003eIn this quiet hour;\u003c/p\u003e \n\u003cp\u003eLet me see Thy face, Lord,\u003c/p\u003e \n\u003cp\u003eFeel Thy touch of power.”\u003c/p\u003e \n\u003cp\u003e“For the words Thou speakest,\u003c/p\u003e \n\u003cp\u003e\u0027They are life, \u0027 indeed;\u003c/p\u003e \n\u003cp\u003eLiving bread from Heaven,\u003c/p\u003e \n\u003cp\u003eNow my spirit feed!”\u003c/p\u003e \n\u003cp\u003e“Speak, Thy servant heareth!\u003c/p\u003e \n\u003cp\u003eBe not silent, Lord;\u003c/p\u003e \n\u003cp\u003eWaits my soul upon Thee\u003c/p\u003e \n\u003cp\u003eFor the quickening word!”\u003c/p\u003e \n\u003cp\u003e九月十八日\u003c/p\u003e \n\u003cp\u003e「没有默示，民就放肆。」（箴廿九18）\u003c/p\u003e \n\u003cp\u003e要看见神，必须花功夫等候。时间在这里是一个主要的元素。我们必须在神的脚前静候多时，神纔会把祂自己显示在我们心里。一个波动的湖面是映不出甚么东西来的。所以，如果我们要看见神，我们必须先安息在神面前，把我们生活中的风波平静下来。\u003c/p\u003e \n\u003cp\u003e看见神是最有能力，最能影响我们生活的一回事。看见神常会叫人类的生活得到极大的转变。\u003c/p\u003e \n\u003cp\u003e雅各布在雅博渡口看见了神，就成了以色列。基甸看见了神，懦夫变成了勇士！多马看见了主，疑惑变成了忠实！\u003c/p\u003e \n\u003cp\u003e开雷看见了神，舍弃了鞋匠的生活到印度去。李文斯东看见了神，舍弃了一切跟随主，经历非洲的丛林。多少人都是因为看见了神；所以，今天在地极宣传福音，使人归向基督。－－巴亭登\u003c/p\u003e \n\u003cp\u003e灵里全然安静是一件非常不容易的事情。其实神一直在和我们讲话。甚么时候世界的声音在灵里消灭或低沉了，甚么时候我们就能听见神的声音。我们听不见，是因为我们生活中充满了喧闹、急躁和愁闷的缘故。\u003c/p\u003e \n\u003cp\u003e－－费勃尔\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5409.html","bookId":475,"creation":"Aug 2, 2019 6:48:48 AM","modification":"Aug 2, 2019 6:48:48 AM"}
