{"id":15223,"no":266,"title":"September 23","content":"\u003cp\u003e\"He that believeth on me, as the scripture hath said, out of his inner being shall flow rivers of living water\" (John 7:38).\u003c/p\u003e \n\u003cp\u003eSome of us are shivering and wondering why the Holy Spirit does not fill us. We have plenty coming in, but we do not give it out. Give out the blessing that you have, start larger plans for service and blessing, and you will soon find that the Holy Ghost is before you, and He will present you with blessings for service, and give you all that He can trust you to give away to others.\u003c/p\u003e \n\u003cp\u003eThere is a beautiful fact in nature which has its spiritual parallels. There is no music so heavenly as an Aeolian harp, and the Aeolian harp is nothing but a set of musical chords arranged in harmony, and then left to be touched by the unseen fingers of the wandering winds. And as the breath of heaven floats over the chords, it is said that notes almost Divine float out upon the air, as if a choir of angels were wandering around and touching the strings. \u003c/p\u003e \n\u003cp\u003eAnd so it is possible to keep our hearts so open to the touch of the Holy Spirit that He can play upon them at will, as we quietly wait in the pathway of His service.--Days of Heaven upon Earth \u003c/p\u003e \n\u003cp\u003eWhen the apostles received the baptism with the Holy Ghost they did not rent the upper room and stay there to hold holiness meetings, but went everywhere preaching the gospel. --Will Huff \u003c/p\u003e \n\u003cp\u003e“ If I have eaten my morsel alone, ”\u003c/p\u003e \n\u003cp\u003eThe patriarch spoke with scorn;\u003c/p\u003e \n\u003cp\u003eWhat would he think of the Church were he shown\u003c/p\u003e \n\u003cp\u003eHeathendom-huge, forlorn,\u003c/p\u003e \n\u003cp\u003eGodless, Christless, with soul unfed,\u003c/p\u003e \n\u003cp\u003eWhile the Church\u0027s ailment is fullness of bread,\u003c/p\u003e \n\u003cp\u003eEating her morsel alone ?\u003c/p\u003e \n\u003cp\u003e“ Freely ye have received, so give, ”\u003c/p\u003e \n\u003cp\u003eHe bade, who hath given us all.\u003c/p\u003e \n\u003cp\u003eHow shall the soul in us longer live\u003c/p\u003e \n\u003cp\u003eDeaf to their starving call,\u003c/p\u003e \n\u003cp\u003eFor whom the blood of the Lord was shed,\u003c/p\u003e \n\u003cp\u003eAnd His body broken to give them bread,\u003c/p\u003e \n\u003cp\u003eIf we eat our morsel alone!\u003c/p\u003e \n\u003cp\u003e-Archbishop Alexander\u003c/p\u003e \n\u003cp\u003e\"Where is Abel thy brother?\" (Gen. 4:9). \u003c/p\u003e \n\u003cp\u003e九月二十三日\u003c/p\u003e \n\u003cp\u003e「信我的人就如经上所说，从他腹中要流出活水的江河来。」（约七38）\u003c/p\u003e \n\u003cp\u003e我们常会奇怪，常会发急地说：「为甚么我们不能流出活水的江河来呢？」我告诉你：多少时候是因为我们祇受不给的缘故。进来的东西太多了，我们从来不想到应该让它流出去；所以，里面常会停滞，常会发沉。我们应该让我们所得到的流出去━多作见证，多传福音，多做帮助探望的工作，多找事奉主的机会━这样，你就会看见圣灵要替你开更大工作的门，要给你更多事奉的恩赐。－－译自地上的属天生活\u003c/p\u003e \n\u003cp\u003e门徒在五旬节受了圣灵的浸以后，并不租着楼房，留在那里聚会，却到各地去宣讲福音。－－赫夫\u003c/p\u003e \n\u003cp\u003e「你兄弟埃布尔在那里」（创四9）今天神也要照样问我们：「你的父母在那里？你的子女在那里？你的兄弟在那里？你的姊妹在那里？你的亲戚在那里？你的朋友在那里？」我们是不是只能像该隐那样说「我不知道」呢？\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5414.html","bookId":475,"creation":"Aug 2, 2019 6:49:01 AM","modification":"Aug 2, 2019 6:49:01 AM"}
