{"id":15240,"no":283,"title":"October 10","content":"\u003cp\u003e\"Fret not\" (Ps. 37:1)\u003c/p\u003e \n\u003cp\u003eThis to me is a Divine command; the same as \"Thou shalt not steal.\" (Ex.20:15) Now let us get to the definition of fretting. One good definition is, \"Made rough on the surface.\" \"Rubbed, or worn away\"; and a peevish, irrational, fault-finding person not only wears himself out, but is very wearing to others. To fret is to be in a state of vexation, and in this Psalm we are not only told not to fret because of evildoers, but to fret not \"in anywise.\" It is injurious, and God does not want us to hurt ourselves. \u003c/p\u003e \n\u003cp\u003eA physician will tell you that a fit of anger is more injurious to the system than a fever, and a fretful disposition is not conducive to a healthy body; and you know rules are apt to work both ways, and the next step down from fretting is crossness, and that amounts to anger. Let us settle this matter, and be obedient to the command, \"Fret not.\"━Margaret Bottome \u003c/p\u003e \n\u003cp\u003e【OVERHEARD IN AN ORCHARD】\u003c/p\u003e \n\u003cp\u003eSaid the Robin to the Sparrow:\u003c/p\u003e \n\u003cp\u003e“I should really like to know,\u003c/p\u003e \n\u003cp\u003eWhy these anxious human beings\u003c/p\u003e \n\u003cp\u003eRush about and worry so?”\u003c/p\u003e \n\u003cp\u003eSaid the Sparrow to the Robin:\u003c/p\u003e \n\u003cp\u003e“Friend, I think that it must be\u003c/p\u003e \n\u003cp\u003eThat they have no Heavenly Father,\u003c/p\u003e \n\u003cp\u003eSuch as cares for you and me.”\u003c/p\u003e \n\u003cp\u003e━Elizabeth Cheney \u003c/p\u003e \n\u003cp\u003e十月十日\u003c/p\u003e \n\u003cp\u003e「不要….心怀不平。」 （诗卅七:1）\u003c/p\u003e \n\u003cp\u003e这是神的命令，和「不可偷盗」（出廿:15）一样是神的命令。现在让我们替「心怀不平」下一个定义。到底甚么叫作「心怀不平」呢？在这里有一个很好的定义：「『心怀不平』是平面上起皱纹。」「磨擦或者消磨」。一个乖戾的、无理性的、吹毛求疵的人不但消磨自己，并且消磨别人。「心怀不平」就是心中烦恼。这是有害的，神不要我们自己伤害自己。 \u003c/p\u003e \n\u003cp\u003e医生能告诉你：发一次怒，对于身体损害，比发一次热还厉害，所以一个常常「心怀不平」的人不能得到康健的身体，因为我们知道「心怀不平」容易叫我们生气，生气容易叫我们发怒。让我们服从神的命令━「不要…心怀不平！」━襥登 \u003c/p\u003e \n\u003cp\u003e【园内偶闻】\u003c/p\u003e \n\u003cp\u003e知更鸟对麻雀说:\u003c/p\u003e \n\u003cp\u003e「我真希望知道,\u003c/p\u003e \n\u003cp\u003e这些忧心如焚的人类,\u003c/p\u003e \n\u003cp\u003e为何如此紧张烦恼?」\u003c/p\u003e \n\u003cp\u003e麻雀对知更鸟说:\u003c/p\u003e \n\u003cp\u003e「同伴啊,我想是这缘故,\u003c/p\u003e \n\u003cp\u003e他们不像你和我,\u003c/p\u003e \n\u003cp\u003e有天父在照顾。」\u003c/p\u003e \n\u003cp\u003e━伊利莎伯.珍妮\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5518.html","bookId":475,"creation":"Aug 2, 2019 6:49:46 AM","modification":"Aug 2, 2019 6:49:46 AM"}
