{"id":15242,"no":285,"title":"October 12","content":"\u003cp\u003e\"And Joseph\u0027s master took him, and put him into a prison…But Jehovah was with Joseph… and that which he did, Jehovah made it to prosper\" (Gen. 39:20-23) \u003c/p\u003e \n\u003cp\u003eWhen God lets us go to prison because we have been serving Him, and goes there with us, prison is about the most blessed place in the world that we could be in. Joseph seems to have known that. He did not sulk and grow discouraged and rebellious because \"everything was against him.\" If he had, the prison-keeper would never have trusted him so. Joseph does not even seem to have pitied himself. \u003c/p\u003e \n\u003cp\u003eLet us remember that if self-pity is allowed to set in, that is the end of us━until it is cast utterly from us. Joseph just turned over everything in joyous trust to God, and so the keeper of the prison turned over everything to Joseph. Lord Jesus, when the prison doors close in on me, keep me trusting, and keep my joy full and abounding. Prosper Thy work through me in prison: even there, make me free indeed.━Selected \u003c/p\u003e \n\u003cp\u003eI have learnt to love the darkness of sorrow; there you see the brightness of His face.━Madame Guyon \u003c/p\u003e \n\u003cp\u003eA little bird I am,\u003c/p\u003e \n\u003cp\u003eShut from the fields of air,\u003c/p\u003e \n\u003cp\u003eAnd in my cage I sit and sing\u003c/p\u003e \n\u003cp\u003eTo Him who placed me there;\u003c/p\u003e \n\u003cp\u003eWell pleased a prisoner to be,\u003c/p\u003e \n\u003cp\u003eBecause, my God, it pleaseth Thee.\u003c/p\u003e \n\u003cp\u003eMy cage confines me round,\u003c/p\u003e \n\u003cp\u003eAbroad I cannot fly,\u003c/p\u003e \n\u003cp\u003eBut though my wing is closely bound,\u003c/p\u003e \n\u003cp\u003eMy soul is at liberty;\u003c/p\u003e \n\u003cp\u003eFor prison walls cannot control,\u003c/p\u003e \n\u003cp\u003eThe flight, the freedom of the soul.\u003c/p\u003e \n\u003cp\u003eI have learnt to love the darkness of sorrow;\u003c/p\u003e \n\u003cp\u003ethere you see the brightness of His face.\u003c/p\u003e \n\u003cp\u003e━Madame Guyon \u003c/p\u003e \n\u003cp\u003e十月十二日\u003c/p\u003e \n\u003cp\u003e「把约瑟下在监里…但耶和华与约瑟同在…耶和华使他所作的尽都顺利。」 （创卅十九:20-23）\u003c/p\u003e \n\u003cp\u003e如果神应许我们因为事奉祂的缘故被下在监里的话，祂必与我们同在；这样，监狱反成了世上最幸福的地方。约瑟知道这个。所以他在监狱里并不愤懑，并不沮丧，也并不反叛。如果他有一点点不甘心的表示，司狱也绝不会这样信任他了。约瑟连自怜的心也没有一点。\u003c/p\u003e \n\u003cp\u003e让我们记住：甚么时候我们容让自怜的心进来，甚么时候我们就完了。约瑟把所有的事情欢欢喜喜地交托神，所以司狱把所有的事情交托约瑟。主耶稣阿，当我被囚在监里的时候，求祢叫我能信靠、能喜乐。求祢藉着我在监狱里完成祢的工作。━选 \u003c/p\u003e \n\u003cp\u003e我已经学会了喜爱黑暗；因为处境越黑暗，主的脸越光明。━盖恩夫人\u003c/p\u003e \n\u003cp\u003e我是一只小鸟，\u003c/p\u003e \n\u003cp\u003e隔离了空旷的天空，\u003c/p\u003e \n\u003cp\u003e可是我坐在笼中歌唱，\u003c/p\u003e \n\u003cp\u003e感赞祂把我放好,\u003c/p\u003e \n\u003cp\u003e我高兴做个囚徒，\u003c/p\u003e \n\u003cp\u003e因为这样才叫祂喜悦。\u003c/p\u003e \n\u003cp\u003e笼子围困着我，\u003c/p\u003e \n\u003cp\u003e我不能飞出笼外,\u003c/p\u003e \n\u003cp\u003e但翅膀虽受束缚，\u003c/p\u003e \n\u003cp\u003e灵魂却自逍遥,\u003c/p\u003e \n\u003cp\u003e因为监狱控制不了,\u003c/p\u003e \n\u003cp\u003e灵魂的自由崇拜。\u003c/p\u003e \n\u003cp\u003e我已经学会了喜爱黑暗;\u003c/p\u003e \n\u003cp\u003e因为,处境越黑暗,主的脸越光明。\u003c/p\u003e \n\u003cp\u003e━盖恩夫人\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5520.html","bookId":475,"creation":"Aug 2, 2019 6:49:50 AM","modification":"Aug 2, 2019 6:49:50 AM"}
