{"id":15249,"no":292,"title":"October 19","content":"\u003cp\u003e\"The ark of the covenant of the Lord went before them\"(Num. 10:33)\u003c/p\u003e \n\u003cp\u003eGod does give us impressions, but not that we should act on them as impressions. If the impression be from God, He will Himself give sufficient evidence to establish it beyond the possibility of a doubt. \u003c/p\u003e \n\u003cp\u003eHow beautiful is the story of Jeremiah, of the impression that came to him respecting the purchase of the field of Anathoth. But Jeremiah did not act upon this impression until after the following day, when his uncle\u0027s son came to him and brought him external evidence by making a proposal for the purchase. Then Jeremiah said: \"I knew this was the word of the Lord.\"(Jer.32:8) \u003c/p\u003e \n\u003cp\u003eHe waited until God seconded the impression by a providence, and then he acted in full view of the open facts, which could bring conviction unto others as well as to himself. God wants us to act according to His mind. We are not to ignore the Shepherd\u0027s personal voice but, like Paul and his companions at Troas, we are to listen to all the voices that speak and \"gather\" from all the circumstances, as they did, the full mind of the Lord. ━Dr. Simpson \u003c/p\u003e \n\u003cp\u003e\"Where God\u0027s finger points, there God\u0027s hand will make the way.\" \u003c/p\u003e \n\u003cp\u003eDo not say in thine heart what thou wilt or wilt not do, but wait upon God until He makes known His way. So long as that way is hidden it is clear that there is no need of action, and that He accounts Himself responsible for all the results of keeping thee where thou art. ━Selected \u003c/p\u003e \n\u003cp\u003e“ For God through ways we have not known, Will lead His own.”\u003c/p\u003e \n\u003cp\u003e十月十九日\u003c/p\u003e \n\u003cp\u003e「耶和华的约柜在前头行。」 （民十:33）\u003c/p\u003e \n\u003cp\u003e许多时候，我们里面起了一个声音，自己不知道这声音究竟是出乎神的呢，还是出乎自己的。在这种情形之下，我们还是不动的好。如果这是出乎神的，神必给我们充足的证据来证实这是出乎祂的，叫我们丝毫没有疑惑的可能。\u003c/p\u003e \n\u003cp\u003e杰里迈亚的故事多美丽：杰里迈亚对于购买亚拿突那块地的事，已经知道是出乎耶和华的，但是他不去做，直到他叔叔的儿子果然到他那里去求他买回━给了他证据。于是杰里迈亚说：「我….就知道这是耶和华的话。」（耶卅二:8）\u003c/p\u003e \n\u003cp\u003e他等着，直到神叫他明白━叫别人和自己都相信━以后，他纔照着事实去做。神喜欢我们照着祂的心意行事。所以我们不可轻举妄动，以致违反了祂的心意。━信宣\u003c/p\u003e \n\u003cp\u003e神的手指所点的道路，神的手必去预备。\u003c/p\u003e \n\u003cp\u003e信徒阿，你不要说你要做甚么、你不要做甚么；你只要求神叫你看见祂所为你选择的是那一条路。如果道路还未显明，这就是说：现在还没有行动的需要；你站在你现在所站的地位上，神是负全责的。━选\u003c/p\u003e \n\u003cp\u003e神会引导祂的子民,通过不认识的路径。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5527.html","bookId":475,"creation":"Aug 2, 2019 6:50:09 AM","modification":"Aug 2, 2019 6:50:09 AM"}
