{"id":15253,"no":296,"title":"October 23","content":"\u003cp\u003e\"There hath not failed one word of all his good promise\"(1 Kings 8:56)\u003c/p\u003e \n\u003cp\u003eSome day we shall understand that God has a reason in every NO which He speaks through the slow movement of life. \"Somehow God makes up to us.\" How often, when His people are worrying and perplexing themselves about their prayers not being answered, is God answering them in a far richer way! Glimpses of this we see occasionally, but the full revelation of it remains for the future.\u003c/p\u003e \n\u003cp\u003e\"If God say \u0027Yes\u0027 to our prayer, dear heart,\u003c/p\u003e \n\u003cp\u003eAnd the sunlight is golden, the sky is blue,\u003c/p\u003e \n\u003cp\u003eWhile the smooth road beckons to me and you,\u003c/p\u003e \n\u003cp\u003eAnd the song-birds warble as on we go,\u003c/p\u003e \n\u003cp\u003ePausing to gather the buds at our feet,\u003c/p\u003e \n\u003cp\u003eStopping to drink of the streamlets we meet,\u003c/p\u003e \n\u003cp\u003eHappy, more happy our journey will grow,\u003c/p\u003e \n\u003cp\u003eIf God says \u0027Yes\u0027 to our prayer, dear heart.\u003c/p\u003e \n\u003cp\u003e\"If God says \u0027No\u0027to our prayer, dear heart,\u003c/p\u003e \n\u003cp\u003eAnd the clouds hang heavy and dull and gray;\u003c/p\u003e \n\u003cp\u003eIf the rough rocks hinder and block the way,\u003c/p\u003e \n\u003cp\u003eWhile the sharp winds pierce us and sting with cold;\u003c/p\u003e \n\u003cp\u003eAh, dear, there is home at the journey\u0027s end,\u003c/p\u003e \n\u003cp\u003eAnd these are the trials the Father doth send\u003c/p\u003e \n\u003cp\u003eTo draw us as sheep to His Heavenly fold,\u003c/p\u003e \n\u003cp\u003eIf God says \u0027No\u0027to our prayer, dear heart. \"\u003c/p\u003e \n\u003cp\u003eOh for the faith that does not make haste, but waits patiently for the Lord, waits for the explanation that shall come in the end, at the revelation of Jesus Christ! When did God take anything from a man, without giving him manifold more in return? Suppose that the return had not been made immediately manifest, what then? Is today the limit of God\u0027s working time? Has He no provinces beyond this little world? Does the door of the grave open upon nothing but infinite darkness and eternal silence ? \u003c/p\u003e \n\u003cp\u003eYet, even confining the judgment within the hour of this life, it is true that God never touches the heart with a trial without intending to bring upon it some grander gift, some tenderer benediction. He has attained to an eminent degree of Christian grace who knows how to wait.━Selected\u003c/p\u003e \n\u003cp\u003eWhen the frosts are in the valley,\u003c/p\u003e \n\u003cp\u003eAnd the mountain tops are grey,\u003c/p\u003e \n\u003cp\u003eAnd the choicest buds are blighted,\u003c/p\u003e \n\u003cp\u003eAnd the blossoms die away,\u003c/p\u003e \n\u003cp\u003eA loving Father whispers,\u003c/p\u003e \n\u003cp\u003e\"This cometh from my hand\";\u003c/p\u003e \n\u003cp\u003eBlessed are ye if ye trust\u003c/p\u003e \n\u003cp\u003eWhere ye cannot understand.\u003c/p\u003e \n\u003cp\u003eIf, after years of toiling,\u003c/p\u003e \n\u003cp\u003eYour wealth should fly away,\u003c/p\u003e \n\u003cp\u003eAnd leave your hands all empty,\u003c/p\u003e \n\u003cp\u003eAnd your locks are turning grey,\u003c/p\u003e \n\u003cp\u003eRemember then your Father\u003c/p\u003e \n\u003cp\u003eOwns all the sea and land;\u003c/p\u003e \n\u003cp\u003eBlessed are ye if ye trust\u003c/p\u003e \n\u003cp\u003eWhere ye cannot understand. ━Selected \u003c/p\u003e \n\u003cp\u003e十月二十三日\u003c/p\u003e \n\u003cp\u003e「…应许赐福的话，一句都没有落空。」（王上八:56）\u003c/p\u003e \n\u003cp\u003e有一天我们会明白：神每一个「不」，都是有理由的。可是祂每一次，总用一些别的方法来补救祂的「不」。多少时候，祂的子民在担忧，在烦恼说，为甚么他们的祷告还没有得着答应，那知神正在用一个更丰富的方法答应他们。这种光景我们是常看见的，但是完全的启示尚须留待将来纔能显明。\u003c/p\u003e \n\u003cp\u003e假若神听了我们的祈祷说：「行」，\u003c/p\u003e \n\u003cp\u003e天空变为蔚蓝，阳光变为黄金，\u003c/p\u003e \n\u003cp\u003e平坦的大道在前面向我们招手，\u003c/p\u003e \n\u003cp\u003e鸟儿在我们面前鸣唱飞翔，\u003c/p\u003e \n\u003cp\u003e偶或停步采集脚边的花草，\u003c/p\u003e \n\u003cp\u003e偶或站在清澈溪旁解渴歇凉，\u003c/p\u003e \n\u003cp\u003e假若神听了我们的祈祷说：「行」，\u003c/p\u003e \n\u003cp\u003e我们的旅程必然欢乐安康。\u003c/p\u003e \n\u003cp\u003e假若神听了我们的祈祷说：「不行」，\u003c/p\u003e \n\u003cp\u003e空中阴云密集，光明变为黑暗，\u003c/p\u003e \n\u003cp\u003e粗糙的岩石，阻挡着我们前进，\u003c/p\u003e \n\u003cp\u003e尖锐的寒风，刺得我们在打颤，\u003c/p\u003e \n\u003cp\u003e假若神听了我们的祈祷说：「不行」，\u003c/p\u003e \n\u003cp\u003e这些却是神赐给我们的考验。\u003c/p\u003e \n\u003cp\u003e要把我们像羊羣似的引入羊圈，\u003c/p\u003e \n\u003cp\u003e我们的家就在这旅程的终点。\u003c/p\u003e \n\u003cp\u003e哦，信心是不会着急的，信心只知道忍耐等候主━等候末日的解释。信徒阿，甚么时候神曾拿去你的，而不加倍还给你呢？假使神不立刻归还你，怎么样呢？莫非今天是神的末了一天么？难道在这个小小的世界以外，祂就没有别的领土了么？ \u003c/p\u003e \n\u003cp\u003e我们就是只说今生，也知道神从来不单给我们一个试炼，而不带一些更大的恩赐、更大的祝福，来给我们的。所以知道怎样等候神乃是基督人最高的祝福。━选\u003c/p\u003e \n\u003cp\u003e寒霜覆山着幽谷，\u003c/p\u003e \n\u003cp\u003e山顶一片荒芜，\u003c/p\u003e \n\u003cp\u003e植物不发嫩芽，\u003c/p\u003e \n\u003cp\u003e花草也给摧残；\u003c/p\u003e \n\u003cp\u003e亲爱的天父在说：\u003c/p\u003e \n\u003cp\u003e「这出自我的手」；\u003c/p\u003e \n\u003cp\u003e只要信，就有福了，\u003c/p\u003e \n\u003cp\u003e不论你明白与否。\u003c/p\u003e \n\u003cp\u003e假若经过多年劳苦，\u003c/p\u003e \n\u003cp\u003e你的财富不翼而飞，\u003c/p\u003e \n\u003cp\u003e剩下了两手空空，\u003c/p\u003e \n\u003cp\u003e你的黑发逐渐转灰，\u003c/p\u003e \n\u003cp\u003e要记住你的天父：\u003c/p\u003e \n\u003cp\u003e乃拥有整个宇宙，\u003c/p\u003e \n\u003cp\u003e假如你不懂,也能信，\u003c/p\u003e \n\u003cp\u003e就可得到福佑。\u003c/p\u003e \n\u003cp\u003e━选\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5531.html","bookId":475,"creation":"Aug 2, 2019 6:50:20 AM","modification":"Aug 2, 2019 6:50:20 AM"}
