{"id":15259,"no":302,"title":"October 29","content":"\u003cp\u003e\"He shall sit as a refiner and purifier of silver\" (Mal. 3:3)\u003c/p\u003e \n\u003cp\u003eOur Father, who seeks to perfect His saints in holiness, knows the value of the refiner\u0027s fire. It is with the most precious metals that the assayer takes the most pains, and subjects them to the hot fire, because such fires melt the metal, and only the molten mass releases its alloy or takes perfectly its new form in the mould. The old refiner never leaves his crucible, but sits down by it, lest there should be one excessive degree of heat to mar the metal. But as soon as he skims from the surface the last of the dross, and sees his own face reflected, he puts out the fire.━Arthur T. Pierson\u003c/p\u003e \n\u003cp\u003e\"He sat by at fire of seven-fold heat,\u003c/p\u003e \n\u003cp\u003eAs He watched by the precious ore,\u003c/p\u003e \n\u003cp\u003eAnd closer He bent with a searching gaze\u003c/p\u003e \n\u003cp\u003eAs He heated it more and more.\u003c/p\u003e \n\u003cp\u003eHe knew He had ore that could stand the test,\u003c/p\u003e \n\u003cp\u003eAnd He wanted the finest gold\u003c/p\u003e \n\u003cp\u003eTo mould as a crown for the King to wear,\u003c/p\u003e \n\u003cp\u003eSet with gems with a price untold.\u003c/p\u003e \n\u003cp\u003eSo He laid our gold in the burning fire,\u003c/p\u003e \n\u003cp\u003eTho \u0027 we fain would have said Him \u0027Nay, \u0027\u003c/p\u003e \n\u003cp\u003eAnd He watched the dross that we had not seen,\u003c/p\u003e \n\u003cp\u003eAnd it melted and passed away\u003c/p\u003e \n\u003cp\u003eAnd the gold grew brighter and yet more bright,\u003c/p\u003e \n\u003cp\u003eBut our eyes were so dim with tears,\u003c/p\u003e \n\u003cp\u003eWe saw but the fire-not the Master\u0027s hand,\u003c/p\u003e \n\u003cp\u003eAnd questioned with anxious fears.\u003c/p\u003e \n\u003cp\u003eYet our gold shone out with a richer glow,\u003c/p\u003e \n\u003cp\u003eAs it mirrored a Form above,\u003c/p\u003e \n\u003cp\u003eThat bent o\u0027er the fire, tho\u0027unseen by us,\u003c/p\u003e \n\u003cp\u003eWith a look of ineffable love.\u003c/p\u003e \n\u003cp\u003eCan we think that it pleases His loving heart\u003c/p\u003e \n\u003cp\u003eTo cause us a moment\u0027s pain?\u003c/p\u003e \n\u003cp\u003eAh, no! but He saw through the present cross\u003c/p\u003e \n\u003cp\u003eThe bliss of eternal gain.\u003c/p\u003e \n\u003cp\u003eSo He waited there with a watchful eye,\u003c/p\u003e \n\u003cp\u003eWith a love that is strong and sure,\u003c/p\u003e \n\u003cp\u003eAnd His gold did not suffer a bit more heat,\u003c/p\u003e \n\u003cp\u003eThan was needed to make it pure. \"\u003c/p\u003e \n\u003cp\u003e十月二十九日\u003c/p\u003e \n\u003cp\u003e「祂必坐下如炼净银子的。」 （玛三:3）\u003c/p\u003e \n\u003cp\u003e我们的父要我们完全圣洁，像祂自己圣洁一样。祂知道炉火的价值。我们都知道金属越贵重，化炼越费力━它们必须经过烈火，因为烈火能叫它们镕化；只有在镕化的时候，纔能把搀合在里面的杂质分别出来；也只有在镕化的时候，纔能把它们造成新的模型。老练的化炼师是一直坐在坩埚旁边，从不走开的，他惟恐热度一高就会叫金属受损。他把最后的渣滓从表面上撇去；一看见他自己的脸从其上反照出来，他就立刻把炉火熄灭.\u003c/p\u003e \n\u003cp\u003e━裴尔逊\u003c/p\u003e \n\u003cp\u003e祂坐在燃烧着七倍烈火的炉旁，\u003c/p\u003e \n\u003cp\u003e注视着祂所珍爱的金属受炼熬；\u003c/p\u003e \n\u003cp\u003e祂一面俯身仔细观察着，\u003c/p\u003e \n\u003cp\u003e一面加热炼炉使热度更高。\u003c/p\u003e \n\u003cp\u003e祂知道这金属经得起试炼，\u003c/p\u003e \n\u003cp\u003e需要把它炼成最纯的精金，\u003c/p\u003e \n\u003cp\u003e铸成一顶给万王之王戴的冠冕，\u003c/p\u003e \n\u003cp\u003e镶嵌着无价的宝石。\u003c/p\u003e \n\u003cp\u003e因此，祂把我们这些黄金放入火炉中，\u003c/p\u003e \n\u003cp\u003e虽然，我们很愿意祂说:「不用烧了」，\u003c/p\u003e \n\u003cp\u003e祂注意我们所不留意的渣滓，\u003c/p\u003e \n\u003cp\u003e把这些渣滓溶化销掉。\u003c/p\u003e \n\u003cp\u003e黄金愈炼愈精纯，光辉愈明亮，\u003c/p\u003e \n\u003cp\u003e但我们的泪眼亦模糊，\u003c/p\u003e \n\u003cp\u003e我们只看见烈火,不见主的手，\u003c/p\u003e \n\u003cp\u003e还带着焦虑所发出的询问。\u003c/p\u003e \n\u003cp\u003e然而,精金终于大放光彩，\u003c/p\u003e \n\u003cp\u003e映出我们所看不见的圣容，\u003c/p\u003e \n\u003cp\u003e祂带着不可名状的慈爱，\u003c/p\u003e \n\u003cp\u003e正凝神俯视着我们。\u003c/p\u003e \n\u003cp\u003e我们受此痛苦，\u003c/p\u003e \n\u003cp\u003e当然是不!祂慈心会高兴吗?\u003c/p\u003e \n\u003cp\u003e但祂却从目前的苦难，\u003c/p\u003e \n\u003cp\u003e看到了永恒的幸福。\u003c/p\u003e \n\u003cp\u003e因此，祂坐在那里等待，\u003c/p\u003e \n\u003cp\u003e带着坚定的爱，留神察看;\u003c/p\u003e \n\u003cp\u003e祂不会让祂的金子,\u003c/p\u003e \n\u003cp\u003e在所需之热度以外,受到更多苦痛。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5537.html","bookId":475,"creation":"Aug 2, 2019 6:50:33 AM","modification":"Aug 2, 2019 6:50:33 AM"}
