{"id":15267,"no":310,"title":"November 6","content":"\u003cp\u003e“As many as I love I rebuke and chasten” (Rev. 3:19)\u003c/p\u003e \n\u003cp\u003eGod takes the most eminent and choicest of His servants for the choicest and most eminent afflictions. They who have received most grace from God are able to bear most afflictions from God. Affliction does not hit the saint by chance, but by direction. God does not draw His bow at a venture. Every one of His arrows goes upon a special errand and touches no breast but his against whom it is sent. It is not only the grace, but the glory of a believer when we can stand and take affliction quietly. ━Joseph Cary l\u003c/p\u003e \n\u003cp\u003eIf all my days were sunny, could I say,\u003c/p\u003e \n\u003cp\u003e“In His fair land He wipes all tears away”?\u003c/p\u003e \n\u003cp\u003eIf I were never weary, could I keep\u003c/p\u003e \n\u003cp\u003eClose to my heart, “He gives His loved ones sleep”?\u003c/p\u003e \n\u003cp\u003eWere no graves mine, might I not come to deem\u003c/p\u003e \n\u003cp\u003eThe Life Eternal but a baseless dream?\u003c/p\u003e \n\u003cp\u003eMy winter, and my tears, and weariness,\u003c/p\u003e \n\u003cp\u003eEven my graves, may be His way to bless.\u003c/p\u003e \n\u003cp\u003eI call them ills; yet that can surely be\u003c/p\u003e \n\u003cp\u003eNothing but love that shows my Lord to me!\u003c/p\u003e \n\u003cp\u003e━Selected\u003c/p\u003e \n\u003cp\u003e\"The most deeply taught Christians are generally those who have been brought into the searching fires of deep soul-anguish. If you have been praying to know more of Christ, do not be surprised if He takes you aside into a desert place, or leads you into a furnace of pain.\"\u003c/p\u003e \n\u003cp\u003eDo not punish me, Lord, by taking my cross from me, but comfort me by submitting me to Thy will, and by making me to love the cross. Give me that by which Thou shalt be best served……and let me hold it for the greatest of all Thy mercies, that Thou shouldst glorify Thy name in me, according to Thy will. ━A Captive\u0027s Prayer\u003c/p\u003e \n\u003cp\u003e十一月六日\u003c/p\u003e \n\u003cp\u003e「凡我所疼爱的，我就责备管教他。」（启三:19）\u003c/p\u003e \n\u003cp\u003e受到最剧烈的痛苦的，常是最属灵的信徒。恩典受得最多的人，也是受苦受得最多的人。苦难临到信徒，没有一次是偶然的，每一次都是受着父神的指挥的。父神绝不随意冒险张弓发矢。祂的每一枝箭都是带着特别的使命出去的。━卡力尔\u003c/p\u003e \n\u003cp\u003e假若我所有日子永不阴沉，\u003c/p\u003e \n\u003cp\u003e怎能说:「祂擦干一切泪眼涔涔」？\u003c/p\u003e \n\u003cp\u003e假若我从不疲困，我的心里,\u003c/p\u003e \n\u003cp\u003e怎记得祂赐安眠予所爱的？\u003c/p\u003e \n\u003cp\u003e假若此世没有我的坟场，\u003c/p\u003e \n\u003cp\u003e永生会变作无稽的梦想。\u003c/p\u003e \n\u003cp\u003e我的阴天、眼泪、疲困、坟墓，\u003c/p\u003e \n\u003cp\u003e都可能是祂导我入幸福的路。\u003c/p\u003e \n\u003cp\u003e它们被我称为祸害，\u003c/p\u003e \n\u003cp\u003e却显示了主的情爱。\u003c/p\u003e \n\u003cp\u003e━选\u003c/p\u003e \n\u003cp\u003e最属灵的基督人都是曾经过烈火的。如果你要更认识基督，你不要惊异，祂必须带你从你现在的环境中出来，引你经过荒野、炉火。\u003c/p\u003e \n\u003cp\u003e主阿，别的刑罚我都愿意受，只求祢不要拿去我的十字架；求祢叫我能顺从祢的旨意，求祢叫我能爱祢所给我的十字架。求祢给我那最能叫祢满足的恩赐，好叫祢在我身上按照祢自己的旨意荣耀祢名。━一个俘虏的祷告\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5545.html","bookId":475,"creation":"Aug 2, 2019 6:50:57 AM","modification":"Aug 2, 2019 6:50:57 AM"}
