{"id":15268,"no":311,"title":"November 7","content":"\u003cp\u003e“But what things were gain to me, those I counted loss for Christ” (Phil. 3:7)\u003c/p\u003e \n\u003cp\u003eWHEN they buried the blind preacher, George Matheson, they lined his grave with red roses in memory of his love-life of sacrifice. And it was this man, so beautifully and significantly honored, who wrote,\u003c/p\u003e \n\u003cp\u003e“O Love that wilt not let me go,\u003c/p\u003e \n\u003cp\u003eI rest my weary soul in Thee,\u003c/p\u003e \n\u003cp\u003eI give Thee back the life I owe,\u003c/p\u003e \n\u003cp\u003eThat in thine ocean depths its flow,\u003c/p\u003e \n\u003cp\u003eMay richer, fuller be.”\u003c/p\u003e \n\u003cp\u003e“O Light that followest all my way,\u003c/p\u003e \n\u003cp\u003eI yield my flickering torch to Thee,\u003c/p\u003e \n\u003cp\u003eMy heart restores its borrowed ray,\u003c/p\u003e \n\u003cp\u003eThat in Thy sunshine\u0027s blaze its day\u003c/p\u003e \n\u003cp\u003eMay brighter, fairer be. ”\u003c/p\u003e \n\u003cp\u003e“O Joy that seekest me through pain,\u003c/p\u003e \n\u003cp\u003eI cannot close my heart to Thee,\u003c/p\u003e \n\u003cp\u003eI trace the rainbow through the rain,\u003c/p\u003e \n\u003cp\u003eAnd feel the promise is not vain,\u003c/p\u003e \n\u003cp\u003eThat morn shalt tearless be. ”\u003c/p\u003e \n\u003cp\u003e“O Cross that liftest up my head,\u003c/p\u003e \n\u003cp\u003eI dare not ask to fly from Thee,\u003c/p\u003e \n\u003cp\u003eI lay in dust life\u0027s glory dead,\u003c/p\u003e \n\u003cp\u003eAnd from the ground there blossoms red,\u003c/p\u003e \n\u003cp\u003eLife that shall endless be.”\u003c/p\u003e \n\u003cp\u003eThere is a legend of an artist who had found the secret of a wonderful red which no other artist could imitate. The secret of his color died with him. But after his death an old wound was discovered over his heart. This revealed the source of the matchless hue in his pictures. The legend teaches that no great achievement can be made, no lofty attainment reached, nothing of much value to the world done, save at the cost of heart\u0027s blood.\u003c/p\u003e \n\u003cp\u003e十一月七日\u003c/p\u003e \n\u003cp\u003e「只是我先前以为与我有益的，我现在因基督都当作有损的。」 （腓三:7）\u003c/p\u003e \n\u003cp\u003e盲目传道人乔治·马得胜去世安葬的时候，人们以红玫瑰遍布他坟地四周，以记念这舍己为人的热情牧师。他深为大众的敬爱，以下这首诗是他的作品：\u003c/p\u003e \n\u003cp\u003e你的爱，不放我走开，\u003c/p\u003e \n\u003cp\u003e我疲倦的灵魂因你而得安息；\u003c/p\u003e \n\u003cp\u003e我把你所赐的生命还给你，\u003c/p\u003e \n\u003cp\u003e在你的深海中，让源流更为丰溢。\u003c/p\u003e \n\u003cp\u003e你的光一路照耀着我，\u003c/p\u003e \n\u003cp\u003e我把摇曳的火把交给你，\u003c/p\u003e \n\u003cp\u003e心中重新亮起你赐的光，\u003c/p\u003e \n\u003cp\u003e在你的天空中，风光更显旖旎。\u003c/p\u003e \n\u003cp\u003e你的欢欣透过痛苦来找我，\u003c/p\u003e \n\u003cp\u003e我无法对你关闭心门，\u003c/p\u003e \n\u003cp\u003e我透过雨丝去追寻彩虹，\u003c/p\u003e \n\u003cp\u003e感知诺言非虚，明日必是良辰。\u003c/p\u003e \n\u003cp\u003e你的十字架举起我的头，\u003c/p\u003e \n\u003cp\u003e我不敢要求逃避离弃，\u003c/p\u003e \n\u003cp\u003e我把已逝的光荣埋于尘土，\u003c/p\u003e \n\u003cp\u003e鲜红的花朵冒出无尽的生气。\u003c/p\u003e \n\u003cp\u003e传说有位艺术家，会调制一种不同凡俗的红色，是别的艺术家所不能模仿。他调制的秘密，一直保守到他逝世。后世人们发现他心口有个老旧的伤痕，泄露了他作画时所用那种颜色的来源。这个故事告诉我们，任何伟大的成就，任何崇高的造诣，任何对世界重大价值的贡献，都要花费心血。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5546.html","bookId":475,"creation":"Aug 2, 2019 6:50:59 AM","modification":"Aug 2, 2019 6:50:59 AM"}
