{"id":15271,"no":314,"title":"November 10","content":"\u003cp\u003e“Under hopeless circumstances he hopefully believed”(Rom. 4:18) (Weymouth)\u003c/p\u003e \n\u003cp\u003eAbraham\u0027s faith seemed to be in a thorough correspondence with the power and constant faithfulness of Jehovah. In the outward circumstances in which he was placed, he had not the greatest cause to expect the fulfillment of the promise. Yet he believed the Word of the Lord, and looked forward to the time when his seed should be as the stars of heaven for multitude.\u003c/p\u003e \n\u003cp\u003eO my soul, thou hast not one single promise only, like Abraham, but a thousand promises, and many patterns of faithful believers before thee: it behooves thee, therefore, to rely with confidence upon the Word of God. And though He delayeth His help, and the evil seemeth to grow worse and worse, be not weak, but rather strong, and rejoice, since the most glorious promises of God are generally fulfilled in such a wondrous manner that He steps forth to save us at a time when there is the least appearance of it.\u003c/p\u003e \n\u003cp\u003eHe commonly brings His help in our greatest extremity, that His finger may plainly appear in our deliverance. And this method He chooses that we may not trust upon anything that we see or feel, as we are always apt to do, but only upon His bare Word, which we may depend upon in every state. ━C. H. Von Bogatzky\u003c/p\u003e \n\u003cp\u003eRemember it is the very time for faith to work when sight ceases. The greater the difficulties, the easier for faith; as long as there remain certain natural prospects, faith does not get on even as easily as where natural prospects fail. ━George Mueller\u003c/p\u003e \n\u003cp\u003e十一月十日\u003c/p\u003e \n\u003cp\u003e「他在无可指望的时候，因信仍有指望。」（罗四:18）\u003c/p\u003e \n\u003cp\u003e按照外表的情形看来，亚伯拉罕再没有丝毫理由可以期望应许的实现了。但是他相信耶和华的话，仍然期望他的后裔多如众星。\u003c/p\u003e \n\u003cp\u003e我的己哪，你不像亚伯拉罕那样，只有一个应许；在你面前摆着许多应许，许多信心的模范；所以你应当大胆信赖神的话了。虽然救助也许不即来到，恶者的势力也许日甚一日，你不要丧胆；你还当刚强、喜乐，因为神最荣耀的应许都是这样成就的━在最没有盼望的时候成就的。 \u003c/p\u003e \n\u003cp\u003e神的拯救，平常总在我们极端困难、极端痛苦、极端危险的时候纔肯出现，好叫我们清清楚楚看见这是神的手指，好叫我们不再信靠眼见和感觉。单单信靠神的话语是最稳妥不过的，因为神的话语在任何情形下都是可靠的。━纀该斯该\u003c/p\u003e \n\u003cp\u003e记住！眼见停止的时候，乃是信心工作的时候。困难越大，信心越容易工作；天然的能力还留着一点的时候，信心就没有像天然能力完全失败的时候那样容易工作。━莫勒\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5549.html","bookId":475,"creation":"Aug 2, 2019 6:51:06 AM","modification":"Aug 2, 2019 6:51:06 AM"}
