{"id":15300,"no":343,"title":"December 9","content":"\u003cp\u003e\"For this our light and transitory burden of suffering is achieving for us a weight of glory\" (2 Cor.4:17)\u003c/p\u003e \n\u003cp\u003e\"Is achieving for us,\" mark. The question is repeatedly asked━Why is the life of man drenched with so much blood, and blistered with so many tears? The answer is to be found in the word \"achieving\"; these things are achieving for us something precious. They are teaching us not only the way to victory, but better still the laws of victory. There is a compensation in every sorrow, and the sorrow is working out the compensation. It is the cry of the dear old hymn:\u003c/p\u003e \n\u003cp\u003e\"Nearer my God to Thee, nearer to Thee, E\u0027en tho\u0027 it be a cross that raiseth me.\"\u003c/p\u003e \n\u003cp\u003eJoy sometimes needs pain to give it birth. Fanny Crosby could never have written her beautiful hymn, \"I shall see Him face to face,\" were it not for the fact that she had never looked upon the green fields nor the evening sunset nor the kindly twinkle in her mother\u0027s eye. It was the loss of her own vision that helped her to gain her remarkable spiritual discernment.\u003c/p\u003e \n\u003cp\u003eIt is the tree that suffers that is capable of polish. When the woodman wants some curved lines of beauty in the grain he cuts down some maple that has been gashed by the axe and twisted by the storm. In this way he secures the knots and the hardness that take the gloss.\u003c/p\u003e \n\u003cp\u003eIt is comforting to know that sorrow tarries only for the night; it takes its leave in the morning. A thunderstorm is very brief when put alongside the long summer day. \"Weeping may endure for the night but joy cometh in the morning.\"(Ps.30:5) ━Songs in the Night\u003c/p\u003e \n\u003cp\u003e\"There is a peace that cometh after sorrow,\u003c/p\u003e \n\u003cp\u003eOf hope surrendered, not of hope fulfilled;\u003c/p\u003e \n\u003cp\u003eA peace that looketh not upon tomorrow,\u003c/p\u003e \n\u003cp\u003eBut calmly on a tempest that it stilled. ”\u003c/p\u003e \n\u003cp\u003e\"A peace that lives not now in joy\u0027s excesses,\u003c/p\u003e \n\u003cp\u003eNor in the happy life of love secure;\u003c/p\u003e \n\u003cp\u003eBut in the unerring strength the heart possesses,\u003c/p\u003e \n\u003cp\u003eOf conflicts won while learning to endure.”\u003c/p\u003e \n\u003cp\u003e\"A peace there is, in sacrifice secluded,\u003c/p\u003e \n\u003cp\u003eA life subdued, from will and passion free;\u003c/p\u003e \n\u003cp\u003e‘Tis not the peace that over Eden brooded,\u003c/p\u003e \n\u003cp\u003eBut that which triumphed in Gethsemane. \u003c/p\u003e \n\u003cp\u003e十二月九日 \u003c/p\u003e \n\u003cp\u003e「我们这至暂至轻的苦楚，要为我们成就极重无比永远的荣耀。」 （林后四:17）\u003c/p\u003e \n\u003cp\u003e「要为我们成就」，请注意这句话。许多人常一再问说━为甚么人生需要流血、流泪！回答在这里：「要为我们成就」━成就极重无比永远的荣耀。苦难不单教导我们得胜的方法，更教导我们得胜的定律。 \u003c/p\u003e \n\u003cp\u003e古谚有云：「纵使为十字架所举起，你却更靠近了神。」\u003c/p\u003e \n\u003cp\u003e有时，喜乐是需要痛苦来产生的。芬妮．克劳斯贝是一个瞎子，她从未看到过绿色的田野，傍晚的日落，和她母亲眼里的慈爱，光芒，若不是这个痛苦的事实，她绝对写不出那首美丽的颂赞「我将和他见面」。因为她丧失了视觉，才使她获得了优异的灵感。 \u003c/p\u003e \n\u003cp\u003e饱受磨折的树，才有坚实而细致的木材。\u003c/p\u003e \n\u003cp\u003e最使我们得安慰的，乃是：忧愁虽然耽延，到了早晨，是必须离去的。「一宿虽然有哭泣，早晨便必欢呼。」（诗卅:5）━译自夜间的歌\u003c/p\u003e \n\u003cp\u003e那里是平安,经忧伤来临,\u003c/p\u003e \n\u003cp\u003e摒弃了愿望与它的满足；\u003c/p\u003e \n\u003cp\u003e这种平安并不注视明天,\u003c/p\u003e \n\u003cp\u003e但凝视它所平息的騒动。 \u003c/p\u003e \n\u003cp\u003e这种平安并不在过度的喜乐里,\u003c/p\u003e \n\u003cp\u003e也不在安定快乐﹑爱情的人生里； \u003c/p\u003e \n\u003cp\u003e但却在内心拥有坚定的力量,\u003c/p\u003e \n\u003cp\u003e从持久学习过程中化解了冲突。 \u003c/p\u003e \n\u003cp\u003e这种平安,在于暗中的祈祷,\u003c/p\u003e \n\u003cp\u003e顺服的生命,意志的降服与受苦；\u003c/p\u003e \n\u003cp\u003e绝非伊甸园里弥漫的平安,\u003c/p\u003e \n\u003cp\u003e乃是客西马尼园里的得胜。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5578.html","bookId":475,"creation":"Aug 2, 2019 6:52:28 AM","modification":"Aug 2, 2019 6:52:28 AM"}
