{"id":15305,"no":348,"title":"December 14","content":"\u003cp\u003e\"His disciples said unto him, Lord, teach us to pray . . . and he said unto them, When ye pray, say. . .Thy kingdom come\" (Luke 11:1-2) \u003c/p\u003e \n\u003cp\u003eWhen they said, \"Teach us to pray,\" the Master lifted His eyes and swept the far horizon of God. He gathered up the ultimate dream of the Eternal, and, rounding the sum of everything God intends to do in the life of man, He packed it all into these three terse pregnant phrases and said, \"When you pray, pray after this manner.\"(Mt.6:9)\u003c/p\u003e \n\u003cp\u003eWhat a contrast between this and much praying we have heard. When we follow the devices of our own hearts, how runs it? \"O Lord bless me, then My family, My church, My city, My country,\" and away on the far fringe as we close up, there is a prayer for the extension of His Kingdom throughout the wide parish of the world.\u003c/p\u003e \n\u003cp\u003eThe Master begins where we leave off. The world first, my personal needs second, is the order of this prayer. Only after my prayer has crossed every continent and every far-flung island of the sea, after it has taken in the last man in the last backward race, after it has covered the entire wish and purpose, of God for the world, only then am I taught to ask for a piece of bread for myself.\u003c/p\u003e \n\u003cp\u003eWhen Jesus gave His all, Himself for us and to us in the holy extravagance of the Cross, is it too much if He asks us to do the same thing? No man or woman amounts to anything in the kingdom, no soul ever touches even the edge of the zone of power, until this lesson is learned that Christ\u0027s business is the supreme concern of life and that all personal considerations, however dear or important, are tributary thereto. ━Dr. Francis\u003c/p\u003e \n\u003cp\u003eWhen Robert Moffat, the veteran African missionary and explorer, was asked once to write in a young lady\u0027s album, he penned these lines: \u003c/p\u003e \n\u003cp\u003e\"My album is a savage breast,\u003c/p\u003e \n\u003cp\u003eWhere tempests brood and shadows rest,\u003c/p\u003e \n\u003cp\u003eWithout one ray of light;\u003c/p\u003e \n\u003cp\u003eTo write the name of Jesus there,\u003c/p\u003e \n\u003cp\u003eAnd see that savage bow in prayer,\u003c/p\u003e \n\u003cp\u003eAnd point to worlds more bright and fair,\u003c/p\u003e \n\u003cp\u003eThis is my soul\u0027s delight.\"\u003c/p\u003e \n\u003cp\u003e\"And His Kingdom shall have no frontier\"\u003c/p\u003e \n\u003cp\u003e(Luke 1:33, the old Moravian version)\u003c/p\u003e \n\u003cp\u003eThe missionary enterprise is not the Church\u0027s afterthought; it is Christ\u0027s forethought;━Henry van Dyke\u003c/p\u003e \n\u003cp\u003e十二月十四日 \u003c/p\u003e \n\u003cp\u003e「有个门徒对祂说，求主教导我们祷告……耶稣说，你们祷告的时候，要说……愿祢的国降临。」\u003c/p\u003e \n\u003cp\u003e（路十一:1-2）\u003c/p\u003e \n\u003cp\u003e当门徒对祂说：「教导我们祷告」的时候，我们的主就想起了永世，所以祂说：「你们祷告，要这样说。」\u003c/p\u003e \n\u003cp\u003e(太六:9） \u003c/p\u003e \n\u003cp\u003e主所教导我们的祷告，和我们所常听见的祷告，相差多远呢！我们常照我们自己的心意祷告：「哦，主阿，祝福我、我的家、我的教会、我的本乡、我的本国…。」我们所求的，和神的国相差得太远了。\u003c/p\u003e \n\u003cp\u003e我们的主放在前面的，我们偏把它漏去。主的次序是：先世界，后个人。主教导我们先按照神对于全世界愿望和目的，为全世界祈求，然后纔教导我们为自己祈求日用的饮食。 \u003c/p\u003e \n\u003cp\u003e主耶稣既然把祂一切都给我们，连性命也在十字架上为我们舍弃，如果，祂要求我们把祂的国放在第一位祈求，岂是过分的呢？只有让基督在凡事上居首位的人，纔能得着属天的能力。━弗朗西斯\u003c/p\u003e \n\u003cp\u003e莫法特是一位资深的非洲宣教士与探险家。有一回，当他应邀在一位年轻女仕的记念册上留言时;他写了以下几句:\u003c/p\u003e \n\u003cp\u003e我的记念册如同野人的胸膛， \u003c/p\u003e \n\u003cp\u003e又如避暴风和可乘凉之处， \u003c/p\u003e \n\u003cp\u003e那里无一丝光线;\u003c/p\u003e \n\u003cp\u003e只有书写了耶稣的名字， \u003c/p\u003e \n\u003cp\u003e并见到野人在低头祈祷， \u003c/p\u003e \n\u003cp\u003e遥望着那光明美丽的世界， \u003c/p\u003e \n\u003cp\u003e表达我灵里的欣喜。 \u003c/p\u003e \n\u003cp\u003e「祂的国没有穷尽」（路一:33）。\u003c/p\u003e \n\u003cp\u003e布道事业并不是教会的后见乃是基督的先见。━范达爱克\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5583.html","bookId":475,"creation":"Aug 2, 2019 6:52:43 AM","modification":"Aug 2, 2019 6:52:43 AM"}
