{"id":15306,"no":349,"title":"December 15","content":"\u003cp\u003e\" Commit thy way unto the LORD; trust also in him; and he shall bring it to pass. \" (Ps.37:5) \u003c/p\u003e \n\u003cp\u003eThe word trust is the heart word of faith. It is the Old Testament word, the word given to the early and infant stage of faith. The word faith expresses more the act of the will, the word belief the act of the mind or intellect, but trust is the language of the heart. The other has reference more to a truth believed or a thing expected.\u003c/p\u003e \n\u003cp\u003eTrust implies more than this, it sees and feels, and leans upon a person, a great, true, living heart of love. So let us \"trust also in him,\" through all the delays, in spite of all the difficulties, in the face of all the denials, notwithstanding all the seemings, even when we cannot understand the way, and know not the issue; still \"trust also in him, and he will bring it to pass.\" The way will open, the right issue will come, the end will be peace, the cloud will be lifted, and the light of an eternal noonday shall shine at last. \u003c/p\u003e \n\u003cp\u003e\"Trust and rest when all around thee\u003c/p\u003e \n\u003cp\u003ePuts thy faith to sorest test;\u003c/p\u003e \n\u003cp\u003eLet no fear or foe confound thee,\u003c/p\u003e \n\u003cp\u003eWait for God and trust and rest.\u003c/p\u003e \n\u003cp\u003e\"Trust and rest with heart abiding,\u003c/p\u003e \n\u003cp\u003eLike a birdling in its nest,\u003c/p\u003e \n\u003cp\u003eUnderneath His feathers hiding,\u003c/p\u003e \n\u003cp\u003eFold thy wings and trust and rest. ”\u003c/p\u003e \n\u003cp\u003e十二月十五日 \u003c/p\u003e \n\u003cp\u003e「当将你的事交托耶和华，并倚靠祂，祂就必成全?」 （诗卅七:5）\u003c/p\u003e \n\u003cp\u003e「依靠」是信的基本型态，它出于旧约，用来表示初民时期的信心。「信心」一词所表示的，以意志的活动较多。「信仰」一词所表现的，以精神或理智的活动较多，但「信靠」却发自心的根本。「信心」和「信仰」比较接近于一种业已相信的真理或期望。 \u003c/p\u003e \n\u003cp\u003e「依靠」则含有更多的意义，它看到，感觉到，并且依靠着一个对象，依靠着那伟大，真实，永生的爱，但愿我们在一再延误之后，不顾一切困难，不顾一切逆境，不顾各种外表的情势，甚至当我们不明路径，不知因果的时候，也「依靠祂」。永远「依靠祂，祂就必成全」。路途会开通，正义会来到，平安会降临，乌云会散开，永恒的正午之光终会照耀。 \u003c/p\u003e \n\u003cp\u003e信心遭受着严酷的考验,\u003c/p\u003e \n\u003cp\u003e你当对神应安心倚靠； \u003c/p\u003e \n\u003cp\u003e莫让忧惧或仇敌,把你騒扰,\u003c/p\u003e \n\u003cp\u003e等候神,安心倚靠。 \u003c/p\u003e \n\u003cp\u003e以持久的信心对祂倚靠,\u003c/p\u003e \n\u003cp\u003e像巢里的一只幼鸟,\u003c/p\u003e \n\u003cp\u003e躲在祂的羽毛之下,\u003c/p\u003e \n\u003cp\u003e缩着翅膀,安心倚靠。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5584.html","bookId":475,"creation":"Aug 2, 2019 6:52:47 AM","modification":"Aug 2, 2019 6:52:47 AM"}
