{"id":15309,"no":352,"title":"December 18","content":"\u003cp\u003e\"In all these things we are more than conquerors through him that loved us\"(Rom.8:37)\u003c/p\u003e \n\u003cp\u003eThe Gospel is so arranged and the gift of God so great that you may take the very enemies that fight you and the forces that are arrayed against you and make them steps up to the very gates of heaven and into the presence of God.\u003c/p\u003e \n\u003cp\u003eLike the eagle, who sits on a crag and watches the sky as it is filling with blackness, and the forked lightnings are playing up and down, and he is sitting perfectly still, turning one eye and then the other toward the storm. But he never moves until he begins to feel the burst of the breeze and knows that the hurricane has struck him; with a scream, he swings his breast to the storm, and uses the storm to go up to the sky; away he goes, borne upward upon it.\u003c/p\u003e \n\u003cp\u003eThat is what God wants of every one of His children, to be more than conqueror, turning the storm-cloud into a chariot. You know when one army is more than conqueror it is likely to drive the other from the field, to get all the ammunition, the food and supplies, and to take possession of the whole. That is just what our text means. There are spoils to be taken!\u003c/p\u003e \n\u003cp\u003eBeloved, have you got them? When you went into that terrible valley of suffering did you come out of it with spoils? When that injury struck you and you thought everything was gone, did you so trust in God that you came out richer than you went in? To be more than conqueror is to take the spoils from the enemy and appropriate them to yourself. What he had arranged for your overthrow, take and appropriate for yourself.\u003c/p\u003e \n\u003cp\u003eWhen Dr. Moon, of Brighton, England, was stricken with blindness, he said \"Lord, I accept this talent of blindness from Thee. Help me to use it for Thy glory that at Thy coming Thou mayest receive Thine own with usury.\" Then God enabled him to invent the Moon Alphabet for the blind, by which thousands of blind people were enabled to read the Word of God, and many of them were gloriously saved. ━Selected\u003c/p\u003e \n\u003cp\u003eGod did not take away Paul\u0027s thorn; He did better━He mastered that thorn, and made it Paul\u0027s servant. The ministry of thorns has often been a greater ministry to man than the ministry of thrones. ━Selected \u003c/p\u003e \n\u003cp\u003e十二月十八日 \u003c/p\u003e \n\u003cp\u003e「靠着爱我们的主，在这一切的事上，已经得胜有余了。」 （罗八:37）\u003c/p\u003e \n\u003cp\u003e福音这样指示我们，攻击我们的仇敌，反对我们的势力，是我们进到神前的梯阶。 \u003c/p\u003e \n\u003cp\u003e　 正如鹫鹰坐在峭壁上，守望黑云密布的天空；虽然叉状的闪电穿上穿下，牠仍顶安静的坐着，期待那将来的风雨。牠从不肯早一刻飞行的；牠必须觉到风雨已经爆发了，已经打到身上了；然后尖叫一声，就冲入风雨之中，借风之势向天空飞去。 \u003c/p\u003e \n\u003cp\u003e这正是神要祂每一个孩子做的事━把黑云当作火车，藉此得胜有余。「得胜有余」不单是把对方驱逐出去，并且还掠得对方一切的军火、粮食…。 \u003c/p\u003e \n\u003cp\u003e亲爱的，你有没有得到战利品呢？当你进入苦难谷的时候，你有没有带着掠物出来呢？当毁灭临到你的时候，你有没有信靠神：祂必叫你出来的时候，比进去的时候更丰富呢？「得胜有余」就是从仇敌那里把掠物夺来，拨作己用。要比以前的力量更充实更强大。\u003c/p\u003e \n\u003cp\u003e英国孟博士（Dr.Moon）瞎眼的时候说：「主阿，我从祢手里接受这盲目的恩典。求祢叫我用它铸造祢的荣耀，好使祢来的时候，得着满足。」神果然藉着他发明盲人所用的凸版文字，千万盲人得读神的话语；有许多竟因此蒙了救赎。━选\u003c/p\u003e \n\u003cp\u003e神并不挪去保罗的刺；神做的比「挪去」更好━神利用那刺。刺的用处比宝座的用处更大。━选\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5587.html","bookId":475,"creation":"Aug 2, 2019 6:52:55 AM","modification":"Aug 2, 2019 6:52:55 AM"}
