{"id":14998,"no":41,"title":"February 10","content":"\u003cp\u003e\"Dearly beloved, avenge not yourselves.\" (Rom. 12:19)\u003c/p\u003e \n\u003cp\u003eThere are seasons when to be still demands immeasurably higher strength than to act. Composure is often the highest result of power. To the vilest and most deadly charges Jesus responded with deep, unbroken silence, such as excited the wonder of the judge and the spectators. To the grossest insults, the most violent ill-treatment and mockery that might well bring indignation into the feeblest heart, He responded with voiceless complacent calmness. Those who are unjustly accused, and causelessly ill-treated know what tremendous strength is necessary to keep silence to God.\u003c/p\u003e \n\u003cp\u003eSt. Paul said, \"None of these things move me.\"(Acts.20:24 Literal translation)\u003c/p\u003e \n\u003cp\u003e\"Men may misjudge thy aim,\u003c/p\u003e \n\u003cp\u003eThink they have cause to blame,\u003c/p\u003e \n\u003cp\u003eSay, thou art wrong;\u003c/p\u003e \n\u003cp\u003eKeep on thy quiet way,\u003c/p\u003e \n\u003cp\u003eChrist is the Judge, not they,\u003c/p\u003e \n\u003cp\u003eFear not, be strong.\"\u003c/p\u003e \n\u003cp\u003eHe did not say, none of these things hurt me. It is one thing to be hurt, and quite another to be moved. St. Paul had a very tender heart. We do not read of any apostle who cried as St. Paul did. It takes a strong man to cry. Jesus wept, and He was the manliest Man that ever lived. So it does not say, none of these things hurt me. But the apostle had determined not to move from what he believed was right. He did not count as we are apt to count; he did not care for ease; he did not care for this mortal life. He cared for only one thing, and that was to be loyal to Christ, to have His smile. To St. Paul, more than to any other man, His work was wages, His smile was Heaven. \u003c/p\u003e \n\u003cp\u003e━Margaret Bottome\u003c/p\u003e \n\u003cp\u003e二月十日\u003c/p\u003e \n\u003cp\u003e“亲爱的弟兄，不要自己伸冤” （罗十二：19）\u003c/p\u003e \n\u003cp\u003e　　许多时侯，静比动更费力。静是力的最高效能。对于那些一无根据的最恶最毒的控告，主始终“甚么都不回答…连一句话也不说”，以至审判官甚觉希奇。对于那些无理的侮辱，不堪的虐待和嘲笑，连旁人都会激起忿怒，可是主始终镇静。祂大有能力，纔能不动。凡曾受过冤枉，毁谤，虐待的，都知道维持镇静，需要何等大的力量。\u003c/p\u003e \n\u003cp\u003e　　使徒保罗说，“没有一件东西可以摇动我”（徒二十：24直译）\u003c/p\u003e \n\u003cp\u003e人们可能误解你的意图，\u003c/p\u003e \n\u003cp\u003e你给不给叫他们该受谴责，\u003c/p\u003e \n\u003cp\u003e你错了，审判之权将在基督\u003c/p\u003e \n\u003cp\u003e他的褒贬，无关你的人格，\u003c/p\u003e \n\u003cp\u003e仅可安静，不介于心，\u003c/p\u003e \n\u003cp\u003e毋恐无怵，自强不息。\u003c/p\u003e \n\u003cp\u003e他不是说，“没有一件东西可以伤害我”。伤害是一件事，摇动又是一件事。使徒保罗的心顶仁慈。我们没有读着过有甚么使徒曾像使徒保罗那样痛哭过。一个男子汉哭泣是无碍于一个人的强毅。主曾哭过，祂是有史以来最强毅的人，所以并不说没有一件东西可以伤害我，但保罗立定决心，凡是他所言为正确真实的任何事物都不能摇动他。我们往常所计较的，他并不计较，他不贪求安适，他不以性命为念。他所追求的只有一件事，就是对主忠心至死，要得主的喜悦。保罗比任何人更能认识了，主的功德就是他的酬报，主的微笑就是天堂。━汉登\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4856.html","bookId":475,"creation":"Aug 2, 2019 6:38:48 AM","modification":"Aug 2, 2019 6:38:48 AM"}
