{"id":14999,"no":42,"title":"February 11","content":"\u003cp\u003e\"As soon as the soles of the feet of the priests…shall rest in the water…the waters shall be cut off.\"(Joshua 3:13)\u003c/p\u003e \n\u003cp\u003eThe people were not to wait in their camps until the way was opened, they were to walk by faith. They were to break camp, pack up their goods, form in line to march, and move down to the very banks before the river would be opened.\u003c/p\u003e \n\u003cp\u003eIf they had come down to the edge of the river and then had stopped for the stream to divide before they stepped into it, they would have waited in vain. They must take one step into the water before the river would be cut off.\u003c/p\u003e \n\u003cp\u003eWe must learn to take God at His Word, and go straight on in duty, although we see no way in which we can go forward. The reason we are so often balked by difficulties is that we expect to see them removed before we try to pass through them.\u003c/p\u003e \n\u003cp\u003eIf we would move straight on in faith, the path would be opened for us. We stand still, waiting for the obstacle to be removed, when we ought to go forward as if there were no obstacles.━Evening Thoughts\u003c/p\u003e \n\u003cp\u003eBehind him lay the gray Azores,\u003c/p\u003e \n\u003cp\u003eBehind the gates of Hercules;\u003c/p\u003e \n\u003cp\u003eBefore him not the ghost of shores,\u003c/p\u003e \n\u003cp\u003eBefore him only shoreless seas.\u003c/p\u003e \n\u003cp\u003eThe good Mate said: \"Now we must pray,\u003c/p\u003e \n\u003cp\u003eFor lo! the very stars are gone.\u003c/p\u003e \n\u003cp\u003eBrave Admiral, speak, what shall I say?\"\u003c/p\u003e \n\u003cp\u003e\"Why, say, \u0027Sail on! sail on! and on!\u0027\"\u003c/p\u003e \n\u003cp\u003e\"My men grow mutinous day by day;\u003c/p\u003e \n\u003cp\u003eMy men grow ghastly wan and weak!\"\u003c/p\u003e \n\u003cp\u003eThe stout Mate thought of home; a spray\u003c/p\u003e \n\u003cp\u003eOf salt wave washed his swarthy cheek.\u003c/p\u003e \n\u003cp\u003e\"What shall I say, brave Admiral, say,\u003c/p\u003e \n\u003cp\u003eIf we sight naught but seas at dawn?\"\u003c/p\u003e \n\u003cp\u003e\"Why, you shall say at break of day,\u003c/p\u003e \n\u003cp\u003e\u0027Sail on! sail on! sail on! and on!\u0027\"\u003c/p\u003e \n\u003cp\u003eThey sailed. They sailed. Then spake the Mate:\u003c/p\u003e \n\u003cp\u003e\"This mad sea shows its teeth tonight.\u003c/p\u003e \n\u003cp\u003eHe curls his lip, he lies in wait,\u003c/p\u003e \n\u003cp\u003eWith lifted teeth, as if to bite!\u003c/p\u003e \n\u003cp\u003eBrave Admiral, say but one good word;\u003c/p\u003e \n\u003cp\u003eWhat shall we do when hope is gone?\"\u003c/p\u003e \n\u003cp\u003eThe words leapt like a leaping sword:\u003c/p\u003e \n\u003cp\u003e\"Sail on! sail on! sail on! and on!\"\u003c/p\u003e \n\u003cp\u003eThen, pale and worn, he kept his deck\u003c/p\u003e \n\u003cp\u003eAnd peered through darkness. Ah! that night\u003c/p\u003e \n\u003cp\u003eOf all dark nights! And then a speck—\u003c/p\u003e \n\u003cp\u003eA light! A light! A light! A light!\u003c/p\u003e \n\u003cp\u003eIt grew, a starlit flag unfurled!\u003c/p\u003e \n\u003cp\u003eIt grew to be Time\u0027s burst of dawn.\u003c/p\u003e \n\u003cp\u003eHe gained a world; he gave that world\u003c/p\u003e \n\u003cp\u003eIts grandest lesson: \"On! sail on!\"\u003c/p\u003e \n\u003cp\u003e━Joaquin Miller\u003c/p\u003e \n\u003cp\u003eFaith that goes forward triumphs.\u003c/p\u003e \n\u003cp\u003e　二月十一日\u003c/p\u003e \n\u003cp\u003e“等到…祭司把脚站在…水里，…水…必然断绝”（书三：13）\u003c/p\u003e \n\u003cp\u003e　　百姓必须凭信向前进，并不能在营中坐待外面的路开通了之后方纔起行。他们必须拔营开步，整装束荷，排齐队伍，直达河边，虽然河水还没有起变化。\u003c/p\u003e \n\u003cp\u003e　　到了河边，若是他们想停在那里，等河水分开了，然后伸足下水，他们定规空等，定规到今天还在河东。他们在水断绝之前，必须先举足涉水。\u003c/p\u003e \n\u003cp\u003e　　让我们也学习怎样用信心抓住神的话前进，不看前面的道路能否通行。我们常受拦阻和难处的挫折，都是因为我们想等神先替我们开路，挪去了一切的拦阻和难处，然后再试着前行。这是何等的错误。若是神要我们向前冲，我们就凭着信心抓住祂的话语向前冲，好像一无拦阻一般，路自然会为我们一步步地敞开。━译自晚思\u003c/p\u003e \n\u003cp\u003e他背后躺着灰色的亚速尔岛，\u003c/p\u003e \n\u003cp\u003e已经远离了直布罗陀海峡，\u003c/p\u003e \n\u003cp\u003e前面看不见海岸的影子；\u003c/p\u003e \n\u003cp\u003e茫茫大海，白浪滔天。\u003c/p\u003e \n\u003cp\u003e船上的大副说：“我们必须祷告，\u003c/p\u003e \n\u003cp\u003e看哪！星星都已隐湮。\u003c/p\u003e \n\u003cp\u003e勇敢的船长，我该怎样下令？”\u003c/p\u003e \n\u003cp\u003e你说：“驶向前去！向前！向前！”\u003c/p\u003e \n\u003cp\u003e“我的船员一天比一天更想叛变，\u003c/p\u003e \n\u003cp\u003e他们形容憔悴，衰弱可怜，”\u003c/p\u003e \n\u003cp\u003e大副这样报告，心中思念家乡。\u003c/p\u003e \n\u003cp\u003e咸涩的浪花溅上他黝黑的脸。\u003c/p\u003e \n\u003cp\u003e“我该怎样下令，英勇的船长，\u003c/p\u003e \n\u003cp\u003e假若明早仍只见海水无边？”\u003c/p\u003e \n\u003cp\u003e“哦，破晓的时候你该说：\u003c/p\u003e \n\u003cp\u003e驶向前去！向前！向前！”\u003c/p\u003e \n\u003cp\u003e他们继续航行，大副说道：\u003c/p\u003e \n\u003cp\u003e“今夜狂暴的海洋露出了獠牙，\u003c/p\u003e \n\u003cp\u003e掀开了唇，张开了大嘴，\u003c/p\u003e \n\u003cp\u003e好像要吞灭我们，咬死我们！\u003c/p\u003e \n\u003cp\u003e英勇的船长，只求你说一句话；\u003c/p\u003e \n\u003cp\u003e希望已渺，无法持守！”\u003c/p\u003e \n\u003cp\u003e但船长的话如利刃出鞘说：\u003c/p\u003e \n\u003cp\u003e“驶向前去！向前！向前！”\u003c/p\u003e \n\u003cp\u003e他精疲力竭，苦守甲板，\u003c/p\u003e \n\u003cp\u003e从黑暗中远远眺望，\u003c/p\u003e \n\u003cp\u003e有一夜，忽然遥见一点微光，\u003c/p\u003e \n\u003cp\u003e光明！光明！光明已在望！\u003c/p\u003e \n\u003cp\u003e它的发展，就是日后的旗旌，\u003c/p\u003e \n\u003cp\u003e时代的黎明，展开在黑暗之间，\u003c/p\u003e \n\u003cp\u003e他达到了那新世界，并且给那世界\u003c/p\u003e \n\u003cp\u003e一个最伟大的启示，“驶向前去！向前！”\u003c/p\u003e \n\u003cp\u003e━密勒\u003c/p\u003e \n\u003cp\u003e凭着信心前进，卽是胜利。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4857.html","bookId":475,"creation":"Aug 2, 2019 6:38:52 AM","modification":"Aug 2, 2019 6:38:52 AM"}
