{"id":15017,"no":60,"title":"March 1","content":"\u003cp\u003e\"Consider the work of God: for who can make that straight, which he hath made crooked.\" (Eccles. 7:13)\u003c/p\u003e \n\u003cp\u003eOften God seems to place His children in positions of profound difficulty, leading them into a wedge from which there is no escape; contriving a situation which no human judgment would have permitted, had it been previously consulted. The very cloud conducts them thither. You may be thus involved at this very hour.\u003c/p\u003e \n\u003cp\u003eIt does seem perplexing and very serious to the last degree, but it is perfectly right. The issue will more than justify Him who has brought you hither. It is a platform for the display of His almighty grace and power.\u003c/p\u003e \n\u003cp\u003eHe will not only deliver you; but in doing so, He will give you a lesson that you will never forget, and to which, in many a psalm and song, in after days, you will revert. You will never be able to thank God enough for having done just as He has. –Selected\u003c/p\u003e \n\u003cp\u003e\"We may wait till He explains,\u003c/p\u003e \n\u003cp\u003eBecause we know that Jesus reigns.\"\u003c/p\u003e \n\u003cp\u003eIt puzzles me; but, Lord, Thou understandest,\u003c/p\u003e \n\u003cp\u003eAnd wilt one day explain this crooked thing.\u003c/p\u003e \n\u003cp\u003eMeanwhile, I know that it has worked out Thy best—\u003c/p\u003e \n\u003cp\u003eIts very crookedness taught me to cling.\u003c/p\u003e \n\u003cp\u003eThou hast fenced up my ways, made my paths crooked,\u003c/p\u003e \n\u003cp\u003eTo keep my wand\u0027ring eyes fixed on Thee;\u003c/p\u003e \n\u003cp\u003eTo make me what I was not, humble, patient;\u003c/p\u003e \n\u003cp\u003eTo draw my heart from earthly love to Thee.\u003c/p\u003e \n\u003cp\u003eSo I will thank and praise Thee for this puzzle,\u003c/p\u003e \n\u003cp\u003eAnd trust where I cannot understand.\u003c/p\u003e \n\u003cp\u003eRejoicing Thou dost hold me worth such testing,\u003c/p\u003e \n\u003cp\u003eI cling the closer to Thy guiding hand.\u003c/p\u003e \n\u003cp\u003e--F. E. M. I.\u003c/p\u003e \n\u003cp\u003e三月一日\u003c/p\u003e \n\u003cp\u003e“你要察看神的作为，因神使为曲的，谁能变为直呢？”（传七：13）\u003c/p\u003e \n\u003cp\u003e神似乎常把他的儿女放在极困难的处境中，使他们无法逃避，也无法解决。这种处境绝非人类的判断所能解决的，但这种阴暗际遇，自有其目的，也许你正在陷入这种际遇之中。\u003c/p\u003e \n\u003cp\u003e似乎你的遭遇是顶烦恼，顶严重。你也不懂得为什么神要如此待你，但是神的处理绝没有错误，不久你就会看见他的美意。你所处的地位是一个戏台，你正在戏台上表演神的荣耀、恩典和权能。\u003c/p\u003e \n\u003cp\u003e他不只要施行拯救；他也要借此使你学习一个不能遗忘的功课，叫你在事情经过之后，还能常常唱出新的赞美，发出足够的感谢来。——选\u003c/p\u003e \n\u003cp\u003e“我们知道，一切都在主的统驭之中，\u003c/p\u003e \n\u003cp\u003e所以我们必须静待他的解释“\u003c/p\u003e \n\u003cp\u003e我虽模糊，主，你却完全知道，\u003c/p\u003e \n\u003cp\u003e总有一天，你会解释其中奥秘，\u003c/p\u003e \n\u003cp\u003e那时我才会明白是你最好的安排，\u003c/p\u003e \n\u003cp\u003e这些曲折，正是教训我对你的顺服。\u003c/p\u003e \n\u003cp\u003e给我围上了藩篱，使我的途径成为曲折，\u003c/p\u003e \n\u003cp\u003e我的目光虽游移不定，但你却成了目标；\u003c/p\u003e \n\u003cp\u003e纠正了我的不耐与高傲，\u003c/p\u003e \n\u003cp\u003e转移了我的心，只听你的呼召。\u003c/p\u003e \n\u003cp\u003e我感谢你与赞美你曲折的安排，\u003c/p\u003e \n\u003cp\u003e我虽不知道，还是一心信靠，\u003c/p\u003e \n\u003cp\u003e你把我作了试炼，何等忭幸，\u003c/p\u003e \n\u003cp\u003e我要紧紧依靠着你的指导。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4875.html","bookId":475,"creation":"Aug 2, 2019 6:39:40 AM","modification":"Aug 2, 2019 6:39:40 AM"}
