{"id":15018,"no":61,"title":"March 2","content":"\"Be ready in the morning, and come up...present thyself there to me in the top of the mount. And no man shall come up with thee.\" (Exod. 34:2, 3)\n\u003cbr\u003e\n\u003cbr\u003eThe morning watch is essential. You must not face the day until you have faced God, nor look into the face of others until you have looked into His.\n\u003cbr\u003e\n\u003cbr\u003eYou cannot expect to be victorious, if the day begins only in your own strength. Face the work of every day with the influence of a few thoughtful, quiet moments with your heart and God. Do not meet other people, even those of your own home, until you have first met the great Guest and honored Companion of your life--Jesus Christ.\n\u003cbr\u003e\n\u003cbr\u003eMeet Him alone. Meet Him regularly. Meet Him with His open Book of counsel before you; and face the regular and the irregular duties of each day with the influence of His personality definitely controlling your every act.\n\u003cbr\u003e\n\u003cbr\u003eBegin the day with God!\n\u003cbr\u003e\n\u003cbr\u003eHe is thy Sun and Day!\n\u003cbr\u003e\n\u003cbr\u003eHis is the radiance of thy dawn;\n\u003cbr\u003e\n\u003cbr\u003eTo Him address thy lay.\n\u003cbr\u003e\n\u003cbr\u003eSing a new song at morn!\n\u003cbr\u003e\n\u003cbr\u003eJoin the glad woods and hills;\n\u003cbr\u003e\n\u003cbr\u003eJoin the fresh winds and seas and plains,\n\u003cbr\u003e\n\u003cbr\u003eJoin the bright flowers and rills.\n\u003cbr\u003e\n\u003cbr\u003eSing thy first song to God!\n\u003cbr\u003e\n\u003cbr\u003eNot to thy fellow men;\n\u003cbr\u003e\n\u003cbr\u003eNot to the creatures of His hand,\n\u003cbr\u003e\n\u003cbr\u003eBut to the glorious One.\n\u003cbr\u003e\n\u003cbr\u003eTake thy first walk with God!\n\u003cbr\u003e\n\u003cbr\u003eLet Him go forth with thee;\n\u003cbr\u003e\n\u003cbr\u003eBy stream, or sea, or mountain path,\n\u003cbr\u003e\n\u003cbr\u003eSeek still His company.\n\u003cbr\u003e\n\u003cbr\u003eThy first transaction be\n\u003cbr\u003e\n\u003cbr\u003eWith God Himself above;\n\u003cbr\u003e\n\u003cbr\u003eSo shall thy business prosper well,\n\u003cbr\u003e\n\u003cbr\u003eAnd all the day be love.\n\u003cbr\u003e\n\u003cbr\u003e--Horatius Bonar.\n\u003cbr\u003e\n\u003cbr\u003eThe men who have done the most for God in this world have been early upon their knees.\n\u003cbr\u003e\n\u003cbr\u003eMatthew Henry used to be in his study at four, and remain there till eight; then, after breakfast and family prayer, he used to be there again till noon; after dinner, he resumed his book or pen till four, and spent the rest of the day in visiting his friends.\n\u003cbr\u003e\n\u003cbr\u003e　 三月二日\n\u003cbr\u003e\n\u003cbr\u003e“明日早晨，你要预备好了，上…山，在山顶上站在我面前。谁也不可和你一同上去”（出三十四：2/3）。\n\u003cbr\u003e\n\u003cbr\u003e　　在基督人的生命中，晨更是非常重要的。每天早晨我们必须先见神的面，然后再见人和世界。\n\u003cbr\u003e\n\u003cbr\u003e　　如果一天的开始是凭我们自己的力量的，我们就不能盼望得胜。在每天开始工作之前，必须在读经中，祷告中，或静默中，先和神有交通。切勿先见别人，甚至自己的家人，直等到我们先接见了我们生命中至大至尊的贵客耶稣基督。\n\u003cbr\u003e\n\u003cbr\u003e　　单独去见他。天天按时去见他。带着圣经去见他；把我们一天中要作的事都带到他面前去，我们就会得到意想不到的力量和指示。\n\u003cbr\u003e\n\u003cbr\u003e一天开始，先与神见面，\n\u003cbr\u003e\n\u003cbr\u003e他是你的光明，你的太阳！\n\u003cbr\u003e\n\u003cbr\u003e他是破除黑暗的曙光；\n\u003cbr\u003e\n\u003cbr\u003e献上你的祈祷，让他度量。\n\u003cbr\u003e\n\u003cbr\u003e清晨起来唱一首新歌；\n\u003cbr\u003e\n\u003cbr\u003e与山林一同喜悦相合唱，\n\u003cbr\u003e\n\u003cbr\u003e与清新空气，海洋和原野，\n\u003cbr\u003e\n\u003cbr\u003e与那明媚的花朵一同歌唱。\n\u003cbr\u003e\n\u003cbr\u003e将你第一首歌献给主，\n\u003cbr\u003e\n\u003cbr\u003e不是唱给凡人去听闻，\n\u003cbr\u003e\n\u003cbr\u003e不是唱给任何被造物，\n\u003cbr\u003e\n\u003cbr\u003e只是唱给独一荣耀之真神。\n\u003cbr\u003e\n\u003cbr\u003e先和神去作一次同行，\n\u003cbr\u003e\n\u003cbr\u003e好让神在你前面引导，\n\u003cbr\u003e\n\u003cbr\u003e在河边，在海滩，在山径，\n\u003cbr\u003e\n\u003cbr\u003e全由神来作你的护行。\n\u003cbr\u003e\n\u003cbr\u003e在天上的父，\n\u003cbr\u003e\n\u003cbr\u003e作你今天第一位主顾；\n\u003cbr\u003e\n\u003cbr\u003e你的事业必然兴旺，\n\u003cbr\u003e\n\u003cbr\u003e整天都在神的慈爱中。\n\u003cbr\u003e\n\u003cbr\u003e——庞纳\n\u003cbr\u003e\n\u003cbr\u003e　　许多为神作大事业的信徒，都是一早就跪在神面前的。\n\u003cbr\u003e\n\u003cbr\u003e　　亨利马太（Henry Matthew）每天早晨四点钟就在他的书房里读经，祷告了；到八点钟出来用早餐。早餐后，举行家庭晨祷；完毕后，又到密室中去和神亲近，直到午时；午餐后，他又回到书房里去读属灵的书籍，或写作，直到四点钟；其余的时间，去探望朋友。——选  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4997.html","bookId":475,"creation":"Aug 2, 2019 6:39:42 AM","modification":"Aug 2, 2019 6:39:42 AM"}
