{"id":15019,"no":62,"title":"March 3","content":"\"And the spirit cried, and rent him sore, and came out of him.\" (Mark 9:26)\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003eEvil never surrenders its hold without a sore fight. We never pass into any spiritual inheritance through the delightful exercises of a picnic, but always through the grim contentions of the battle field. It is so in the secret realm of the soul. Every faculty which wins its spiritual freedom does so at the price of blood. Apollyon is not put to flight by a courteous request; he straddles across the full breadth of the way, and our progress has to be registered in blood and tears. This we must remember or we shall add to all the other burdens of life the gall of misinterpretation. We are not \"born again\" into soft and protected nurseries, but in the open country where we suck strength from the very terror of the tempest. \"We must through much tribulation enter into the kingdom of God.\" --Dr. J. H. Jowett.\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"Faith of our Fathers! living still,\n\u003cbr\u003e\n\u003cbr\u003eIn spite of dungeon, fire and sword:\n\u003cbr\u003e\n\u003cbr\u003eO how our hearts beat high with joy\n\u003cbr\u003e\n\u003cbr\u003eWhene\u0027er we hear that glorious word.\n\u003cbr\u003e\n\u003cbr\u003eFaith of our Fathers! Holy Faith!\n\u003cbr\u003e\n\u003cbr\u003eWe will be true to Thee till death!\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\"Our fathers, chained in prisons dark,\n\u003cbr\u003e\n\u003cbr\u003eWere still in heart and conscience free;\n\u003cbr\u003e\n\u003cbr\u003eHow sweet would be their children\u0027s fate,\n\u003cbr\u003e\n\u003cbr\u003eIf they, like them, could die for Thee!\"\n\u003cbr\u003e\n\u003cbr\u003e　 　 三月三日\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e“那鬼喊叫，使孩子大大的抽了一阵疯，就出来了”（可九：26）。\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e　　恶者从来不肯放弃他的地盘，除非先有一阵激烈的战争。我们得到属灵的产业，并不是在宴乐中得到的，乃是在战场上得到的。这是属灵领域中的秘密。我们的身体各部分，亦是如此，要恢复属灵的自由，必须要有宝血的代价。亚玻伦（启九：11）不是能用情谊，礼貌，要求，请出来的；他在里面高视阔步；所以我们必须用属灵的武力，宝血和眼泪，驱逐他，他才会出去。这一点我们必须记得，否则我们生活中会有许多误解。我们重生，并不是重生在王宫中，乃是重生在旷野；那里我们吃的奶，就是四周的风波和战争。“我们进入神的国，必须经历许多艰难”（徒十四：22）。——乔怀德\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e我们祖先的信心，虽历经火与剑，\n\u003cbr\u003e\n\u003cbr\u003e甚至牢狱的迫害，仍然不变，\n\u003cbr\u003e\n\u003cbr\u003e我们听到了这许多光荣的史迹，\n\u003cbr\u003e\n\u003cbr\u003e我们的心啊！何等的跳跃欢腾。\n\u003cbr\u003e\n\u003cbr\u003e我们祖先的信心，神圣的信心，\n\u003cbr\u003e\n\u003cbr\u003e我们亦愿矢忠矢诚，至死不易！\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e\n\u003cbr\u003e我们的祖先，被关在黑牢之中，\n\u003cbr\u003e\n\u003cbr\u003e可是他们心中自由的良知，谁能索缚？\n\u003cbr\u003e\n\u003cbr\u003e倘若后代子孙也能为神殉道，\n\u003cbr\u003e\n\u003cbr\u003e那是何等美妙何等幸福！  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/4998.html","bookId":475,"creation":"Aug 2, 2019 6:39:45 AM","modification":"Aug 2, 2019 6:39:45 AM"}
