{"id":15023,"no":66,"title":"March 7","content":"\"We are troubled on every side.\" (2 Cor. 7:5)\n\u003cbr\u003e\n\u003cbr\u003eWhy should God have to lead us thus, and allow the pressure to be so hard and constant? Well, in the first place, it shows His all-sufficient strength and grace much better than if we were exempt from pressure and trial. \"The treasure is in earthen vessels, that the excellency of the power may be of God, and not of us.\"\n\u003cbr\u003e\n\u003cbr\u003eIt makes us more conscious of our dependence upon Him. God is constantly trying to teach us our dependence, and to hold us absolutely in His hand and hanging upon His care.\n\u003cbr\u003e\n\u003cbr\u003eThis was the place where Jesus Himself stood and where He wants us to stand, not with self-constituted strength, but with a hand ever leaning upon His, and a trust that dare not take one step alone. It teaches us trust.\n\u003cbr\u003e\n\u003cbr\u003eThere is no way of learning faith except by trial. It is God\u0027s school of faith, and it is far better for us to learn to trust God than to enjoy life.\n\u003cbr\u003e\n\u003cbr\u003eThe lesson of faith once learned, is an everlasting acquisition and an eternal fortune made; and without trust even riches will leave us poor. --Days of Heaven upon Earth.\n\u003cbr\u003e\n\u003cbr\u003e\"Why must I weep when others sing?\n\u003cbr\u003e\n\u003cbr\u003e\u0027To test the deeps of suffering.\u0027\n\u003cbr\u003e\n\u003cbr\u003eWhy must I work while others rest?\n\u003cbr\u003e\n\u003cbr\u003e\u0027To spend my strength at God\u0027s request.\u0027\n\u003cbr\u003e\n\u003cbr\u003eWhy must I lose while others gain?\n\u003cbr\u003e\n\u003cbr\u003e\u0027To understand defeat\u0027s sharp pain.\u0027\n\u003cbr\u003e\n\u003cbr\u003eWhy must this lot of life be mine\n\u003cbr\u003e\n\u003cbr\u003eWhen that which fairer seems is thine?\n\u003cbr\u003e\n\u003cbr\u003e\u0027Because God knows what plans for me\n\u003cbr\u003e\n\u003cbr\u003eShall blossom in eternity.\u0027\"\n\u003cbr\u003e\n\u003cbr\u003e　 三月七日\n\u003cbr\u003e\n\u003cbr\u003e“我们…周围遭患难”（林后七：5）。\n\u003cbr\u003e\n\u003cbr\u003e　　为什么神这样带领我们，应许患难一直临到我们？第一，神够用的恩典和能力可以彰显得完全，远胜在安逸中。“我们有这宝贝放在瓦器里，要显明这莫大的能力，是出于神，不是出于我们”（林后四：7）。\n\u003cbr\u003e\n\u003cbr\u003e　　第二，患难使我们更依靠神。神一直在教导我们依靠他，让他把我们紧握在手中，把所有的难处交给他，由他照顾。\n\u003cbr\u003e\n\u003cbr\u003e　　第三，主自己曾站过那“四围遭患难”之地，今天他也要我们去经历；并不用自己的力，乃是一直用手拉住他依靠他不敢独自跨前一步。用以训练我们的信心。\n\u003cbr\u003e\n\u003cbr\u003e　　第四，除了在患难中，没有别的地方可以学习信心的功课。四周遭患难之地是神所设立的信心学校，在那里我们受到信心的训练。\n\u003cbr\u003e\n\u003cbr\u003e　　信心的秘诀一次学会，就永远会了，并且是一个永远的幸福；有信，贫穷变为富足；没有信，富足也是贫穷。——译自地上的天上生活\n\u003cbr\u003e\n\u003cbr\u003e别人欢唱，我为何悲哭？\n\u003cbr\u003e\n\u003cbr\u003e“为了探测苦海的深度。”\n\u003cbr\u003e\n\u003cbr\u003e别人休息，我为何工作？\n\u003cbr\u003e\n\u003cbr\u003e“为了出力完成神的吩咐。”\n\u003cbr\u003e\n\u003cbr\u003e别人获得，我为何损失？\n\u003cbr\u003e\n\u003cbr\u003e“为了体验失败的惨痛。”\n\u003cbr\u003e\n\u003cbr\u003e美好的幸福为你所有，\n\u003cbr\u003e\n\u003cbr\u003e为何厄运偏纠缠我，自朝至暮？\n\u003cbr\u003e\n\u003cbr\u003e“因为神知道如此的安排，\n\u003cbr\u003e\n\u003cbr\u003e将使我在永恒中获得无上丰富。”  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5002.html","bookId":475,"creation":"Aug 2, 2019 6:39:59 AM","modification":"Aug 2, 2019 6:39:59 AM"}
