{"id":15030,"no":73,"title":"March 14","content":"\"Moses drew near unto the thick darkness where God was.\" (Exod. 20:21)\n\u003cbr\u003e\n\u003cbr\u003eGod has still His hidden secrets, hidden from the wise and prudent. Do not fear them; be content to accept things that you cannot understand; wait patiently. Presently He will reveal to you the treasures of darkness, the riches of the glory of the mystery. Mystery is only the veil of God\u0027s face.\n\u003cbr\u003e\n\u003cbr\u003eDo not be afraid to enter the cloud that is settling down on your life. God is in it. The other side is radiant with His glory. \"Think it not strange concerning the fiery trial which is to try you, as though some strange thing happened unto you; but rejoice, inasmuch as ye are partakers of Christ\u0027s sufferings.\" When you seem loneliest and most forsaken, God is nigh. He is in the dark cloud. Plunge into the blackness of its darkness without flinching; under the shrouding curtain of His pavilion you will find God awaiting you. --Selected.\n\u003cbr\u003e\n\u003cbr\u003e\"Hast thou a cloud?\n\u003cbr\u003e\n\u003cbr\u003eSomething that is dark and full of dread;\n\u003cbr\u003e\n\u003cbr\u003eA messenger of tempest overhead?\n\u003cbr\u003e\n\u003cbr\u003eA something that is darkening the sky;\n\u003cbr\u003e\n\u003cbr\u003eA something growing darker bye and bye;\n\u003cbr\u003e\n\u003cbr\u003eA something that thou fear\u0027st will burst at last;\n\u003cbr\u003e\n\u003cbr\u003eA cloud that doth a deep, long shadow cast,\n\u003cbr\u003e\n\u003cbr\u003eGod cometh in that cloud.\n\u003cbr\u003e\n\u003cbr\u003eHast thou a cloud?\n\u003cbr\u003e\n\u003cbr\u003eIt is Jehovah\u0027s triumph car: in this\n\u003cbr\u003e\n\u003cbr\u003eHe rideth to thee, o\u0027er the wide abyss.\n\u003cbr\u003e\n\u003cbr\u003eIt is the robe in which He wraps His form;\n\u003cbr\u003e\n\u003cbr\u003eFor He doth gird Him with the flashing storm.\n\u003cbr\u003e\n\u003cbr\u003eIt is the veil in which He hides the light\n\u003cbr\u003e\n\u003cbr\u003eOf His fair face, too dazzling for thy sight.\n\u003cbr\u003e\n\u003cbr\u003eGod cometh in that cloud.\n\u003cbr\u003e\n\u003cbr\u003eHast thou a cloud?\n\u003cbr\u003e\n\u003cbr\u003eA trial that is terrible to thee?\n\u003cbr\u003e\n\u003cbr\u003eA black temptation threatening to see?\n\u003cbr\u003e\n\u003cbr\u003eA loss of some dear one long thine own?\n\u003cbr\u003e\n\u003cbr\u003eA mist, a veiling, bringing the unknown?\n\u003cbr\u003e\n\u003cbr\u003eA mystery that unsubstantial seems:\n\u003cbr\u003e\n\u003cbr\u003eA cloud between thee and the sun\u0027s bright beams?\n\u003cbr\u003e\n\u003cbr\u003eGod cometh in that cloud.\n\u003cbr\u003e\n\u003cbr\u003eHast thou a cloud?\n\u003cbr\u003e\n\u003cbr\u003eA sickness--weak old age--distress and death?\n\u003cbr\u003e\n\u003cbr\u003eThese clouds will scatter at thy last faint breath.\n\u003cbr\u003e\n\u003cbr\u003eFear not the clouds that hover o\u0027er thy barque,\n\u003cbr\u003e\n\u003cbr\u003eMaking the harbour\u0027s entrance dire and dark;\n\u003cbr\u003e\n\u003cbr\u003eThe cloud of death, though misty, chill and cold,\n\u003cbr\u003e\n\u003cbr\u003eWill yet grow radiant with a fringe of gold.\n\u003cbr\u003e\n\u003cbr\u003eGOD cometh in that cloud.\"\n\u003cbr\u003e\n\u003cbr\u003eAs Dr. C. stood on a high peak of the Rocky Mountains watching a storm raging below him, an eagle came up through the clouds, and soared away towards the sun and the water upon him glistened in the sunlight like diamonds. Had it not been for the storm he might have remained in the valley. The sorrows of life cause us to rise towards God.\n\u003cbr\u003e\n\u003cbr\u003e　 三月十四日\n\u003cbr\u003e\n\u003cbr\u003e“摩西就挨近神所在的幽暗之中”(出二十：21)。\n\u003cbr\u003e\n\u003cbr\u003e　　神今天仍有他隐藏的秘密，向聪明通达人藏起来。可是你不必怕它们；尽管在神面前接受你所不解的东西；忍耐等候。不久他要指示你黑暗中的宝贝，隐密中的荣耀。\n\u003cbr\u003e\n\u003cbr\u003e　　不要怕进前面的黑云。神在其中。“有火炼的试验临到你们，不要以为奇怪，(似乎是遭遇非常的事)倒要欢喜；因为你们是与基督一同受苦”(彼前四：12/13) 。当你感到孤单的时侯，须知神在咫尺。他在黑云中，等候你进去亲近他。——选\n\u003cbr\u003e\n\u003cbr\u003e黑云罩上了你的生命，\n\u003cbr\u003e\n\u003cbr\u003e这种遭遇，可怕阴沉，\n\u003cbr\u003e\n\u003cbr\u003e它预示风雨来临，\n\u003cbr\u003e\n\u003cbr\u003e云渐渐迷漫开来，\n\u003cbr\u003e\n\u003cbr\u003e一阵紧一阵，地暗天昏，\n\u003cbr\u003e\n\u003cbr\u003e云中却隐藏着天上的神。\n\u003cbr\u003e\n\u003cbr\u003e黑云罩上了你的生命，\n\u003cbr\u003e\n\u003cbr\u003e这是耶和华的凯旋车，\n\u003cbr\u003e\n\u003cbr\u003e载着他前来给你温存，\n\u003cbr\u003e\n\u003cbr\u003e云是他的面纱，他的衣襟。\n\u003cbr\u003e\n\u003cbr\u003e你受不住那样的光辉，\n\u003cbr\u003e\n\u003cbr\u003e所以要遮掩他的圣容。\n\u003cbr\u003e\n\u003cbr\u003e黑云罩上了你的生命，\n\u003cbr\u003e\n\u003cbr\u003e何等可怕的考验，\n\u003cbr\u003e\n\u003cbr\u003e如失去了可爱的亲人，\n\u003cbr\u003e\n\u003cbr\u003e又如威胁更如诱惑，\n\u003cbr\u003e\n\u003cbr\u003e你将不知所措，心迷神昏，\n\u003cbr\u003e\n\u003cbr\u003e但云中却隐藏着天上的神。\n\u003cbr\u003e\n\u003cbr\u003e黑云罩上了你的生命，\n\u003cbr\u003e\n\u003cbr\u003e你是否遇上了衰老病痛和死亡的阴云？\n\u003cbr\u003e\n\u003cbr\u003e这些云将皆在你奄奄一息时来到，\n\u003cbr\u003e\n\u003cbr\u003e正像驾舟归航，别怕港口黑暗；\n\u003cbr\u003e\n\u003cbr\u003e死亡之云虽然寒冷阴沉，\n\u003cbr\u003e\n\u003cbr\u003e终将镀上金边，逐渐光明，\n\u003cbr\u003e\n\u003cbr\u003e神就在这云里来临。\n\u003cbr\u003e\n\u003cbr\u003e　　某医师一天站在一座高山顶上，观看山下的阵雨；他看见一头鹰冲出黑云，向上高飞，身上带着的水珠，在日光下闪烁，好似金钢钻一般美丽。如果山下没有阵雨，它必是仍在谷中。人生的苦难使我们向上近神。——选  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5009.html","bookId":475,"creation":"Aug 2, 2019 6:40:17 AM","modification":"Aug 2, 2019 6:40:17 AM"}
