{"id":15054,"no":97,"title":"April 7","content":"\u003cp\u003e\"Their strength is to sit still.\" (Isa. 30:7)\u003c/p\u003e \n\u003cp\u003eIn order really to know God, inward stillness is absolutely necessary. I remember when I first learned this. A time of great emergency had risen in my life, when every part of my being seemed to throb with anxiety, and when the necessity for immediate and vigorous action seemed overpowering; and yet circumstances were such that I could do nothing, and the person who could, would not stir.\u003c/p\u003e \n\u003cp\u003eFor a little while it seemed as if I must fly to pieces with the inward turmoil, when suddenly the still small voice whispered in the depths of my soul, \"Be still, and know that I am God.\" The word was with power, and I hearkened. I composed my body to perfect stillness, and I constrained my troubled spirit into quietness, and looked up and waited; and then I did \"know\" that it was God, God even in the very emergency and in my helplessness to meet it; and I rested in Him. It was an experience that I would not have missed for worlds; and I may add also, that out of this stillness seemed to arise a power to deal with the emergency, that very soon brought it to a successful issue. I learned then effectually that my \"strength was to sit still.\" --Hannah Whitall Smith.\u003c/p\u003e \n\u003cp\u003eThere is a perfect passivity which is not indolence. It is a living stillness born of trust. Quiet tension is not trust. It is simply compressed anxiety.\u003c/p\u003e \n\u003cp\u003eNot in the tumult of the rending storm,\u003c/p\u003e \n\u003cp\u003eNot in the earthquake or devouring flame;\u003c/p\u003e \n\u003cp\u003eBut in the hush that could all fear transform,\u003c/p\u003e \n\u003cp\u003eThe still, small whisper to the prophet came.\u003c/p\u003e \n\u003cp\u003eO Soul, keep silence on the mount of God,\u003c/p\u003e \n\u003cp\u003eThough cares and needs throb around thee like a sea;\u003c/p\u003e \n\u003cp\u003eFrom supplications and desires unshod,\u003c/p\u003e \n\u003cp\u003eBe still, and hear what God shall say to thee.\u003c/p\u003e \n\u003cp\u003eAll fellowship hath interludes of rest,\u003c/p\u003e \n\u003cp\u003eNew strength maturing in each poise of power;\u003c/p\u003e \n\u003cp\u003eThe sweetest Alleluias of the blest\u003c/p\u003e \n\u003cp\u003eAre silent, for the space of half an hour.\u003c/p\u003e \n\u003cp\u003eO rest, in utter quietude of soul,\u003c/p\u003e \n\u003cp\u003eAbandon words, leave prayer and praise awhile;\u003c/p\u003e \n\u003cp\u003eLet thy whole being, hushed in His control,\u003c/p\u003e \n\u003cp\u003eLearn the full meaning of His voice and smile.\u003c/p\u003e \n\u003cp\u003eNot as an athlete wrestling for a crown,\u003c/p\u003e \n\u003cp\u003eNot taking Heaven by violence of will;\u003c/p\u003e \n\u003cp\u003eBut with thy Father as a child sit down,\u003c/p\u003e \n\u003cp\u003eAnd know the bliss that follows His \"Be Still!\"\u003c/p\u003e \n\u003cp\u003e--Mary Rowles Jarvis.\u003c/p\u003e \n\u003cp\u003e　 四月七日\u003c/p\u003e \n\u003cp\u003e“你们要安静，要知道我是神”（诗四十六：10）。\u003c/p\u003e \n\u003cp\u003e　　若要真认识神，内心的镇静是绝对必需的。我记得我当初怎样学习这功课，那时正有一件大难处临头，我焦急得全身颤动，所有的血管都紧张，事情又需要立即对付；可是四周的环境又不容我移动丝毫，可以帮助我的人，又不愿动作。\u003c/p\u003e \n\u003cp\u003e　　因着内心的纷乱，我的身体好象要四分五裂了，忽然一个微小的声音在灵的深处向我说：“你要安静，要知道我是神”。我接受了这真带有能力的劝告，于是镇定我的身体，约束我那搅乱的灵，使之安静，把我的急难交给神，仰望等候他；我觉得真有一股力量从镇静中出来应付难处。结果，事情平安过去，我自己在他里面得了安息。这是我最宝贝的经历，因为从此我更认识了神。——司密斯\u003c/p\u003e \n\u003cp\u003e　　这种不动，并不是懒惰，乃是从信心产生的一种活的镇静。如果紧张而不露声色，故作镇静，仍非信心的结果，不过是抑制住了焦虑而已，并非真正的镇静。\u003c/p\u003e \n\u003cp\u003e先知听见天上启示的声音，\u003c/p\u003e \n\u003cp\u003e并非在狂风暴雨的时辰，\u003c/p\u003e \n\u003cp\u003e也非地震或火灾之时，\u003c/p\u003e \n\u003cp\u003e神在万籁无声降临。\u003c/p\u003e \n\u003cp\u003e灵魂哪，在神的座前要安详，\u003c/p\u003e \n\u003cp\u003e你的忧困难如浪潮起伏，\u003c/p\u003e \n\u003cp\u003e在祈求与愿望中保持镇静，\u003c/p\u003e \n\u003cp\u003e盼听神启示你万全之方。\u003c/p\u003e \n\u003cp\u003e集中用力，需有间歇的休憩\u003c/p\u003e \n\u003cp\u003e每次静止，生出新的能力，\u003c/p\u003e \n\u003cp\u003e最美丽的赞颂乐曲，\u003c/p\u003e \n\u003cp\u003e其间也有短时间的默息。\u003c/p\u003e \n\u003cp\u003e休息吧，休息在肃静的灵里，\u003c/p\u003e \n\u003cp\u003e暂时把语言，思虑和行动搁起，\u003c/p\u003e \n\u003cp\u003e让整个身心，寂寞在神的控制中，\u003c/p\u003e \n\u003cp\u003e领会他一言一笑的全部意义。\u003c/p\u003e \n\u003cp\u003e不要像运动员争夺锦标，\u003c/p\u003e \n\u003cp\u003e要登天堂，不可凭意志的强暴，\u003c/p\u003e \n\u003cp\u003e像孩子似的陪你天父坐下，\u003c/p\u003e \n\u003cp\u003e要知道安静之后，就有幸福来到。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5033.html","bookId":475,"creation":"Aug 2, 2019 6:41:15 AM","modification":"Aug 2, 2019 6:41:15 AM"}
