{"id":15056,"no":99,"title":"April 9","content":"\u003cp\u003e\"All these things are against me.\" (Gen. 42:36)\u003c/p\u003e \n\u003cp\u003e\"All things work together for good to them that love God.\" (Rom. 8:28)\u003c/p\u003e \n\u003cp\u003eMany people are wanting power. Now how is power produced? The other day we passed the great works where the trolley engines are supplied with electricity. We heard the hum and roar of the countless wheels, and we asked our friend,\u003c/p\u003e \n\u003cp\u003e\"How do they make the power?\"\u003c/p\u003e \n\u003cp\u003e\"Why,\" he said, \"just by the revolution of those wheels and the friction they produce. The rubbing creates the electric current.\"\u003c/p\u003e \n\u003cp\u003eAnd so, when God wants to bring more power into your life, He brings more pressure. He is generating spiritual force by hard rubbing. Some do not like it and try to run away from the pressure, instead of getting the power and using it to rise above the painful causes.\u003c/p\u003e \n\u003cp\u003eOpposition is essential to a true equilibrium of forces. The centripetal and centrifugal forces acting in opposition to each other keep our planet in her orbit. The one propelling, and the other repelling, so act and re-act, that instead of sweeping off into space in a pathway of desolation, she pursues her even orbit around her solar centre.\u003c/p\u003e \n\u003cp\u003eSo God guides our lives. It is not enough to have an impelling force--we need just as much a repelling force, and so He holds us back by the testing ordeals of life, by the pressure of temptation and trial, by the things that seem against us, but really are furthering our way and establishing our goings.\u003c/p\u003e \n\u003cp\u003eLet us thank Him for both, let us take the weights as well as the wings, and thus divinely impelled, let us press on with faith and patience in our high and heavenly calling. --A. B. Simpson.\u003c/p\u003e \n\u003cp\u003eIn a factory building there are wheels and gearings,\u003c/p\u003e \n\u003cp\u003eThere are cranks and pulleys, beltings tight or slack--\u003c/p\u003e \n\u003cp\u003eSome are whirling swiftly, some are turning slowly,\u003c/p\u003e \n\u003cp\u003eSome are thrusting forward, some are pulling back;\u003c/p\u003e \n\u003cp\u003eSome are smooth and silent, some are rough and noisy,\u003c/p\u003e \n\u003cp\u003ePounding, rattling, clanking, moving with a jerk;\u003c/p\u003e \n\u003cp\u003eIn a wild confusion in a seeming chaos,\u003c/p\u003e \n\u003cp\u003eLifting, pushing, driving--but they do their work.\u003c/p\u003e \n\u003cp\u003eFrom the mightiest lever to the tiniest pinion,\u003c/p\u003e \n\u003cp\u003eAll things move together for the purpose planned;\u003c/p\u003e \n\u003cp\u003eAnd behind the working is a mind controlling,\u003c/p\u003e \n\u003cp\u003eAnd a force directing, and a guiding hand.\u003c/p\u003e \n\u003cp\u003eSo all things are working for the Lord\u0027s beloved;\u003c/p\u003e \n\u003cp\u003eSome things might be hurtful if alone they stood;\u003c/p\u003e \n\u003cp\u003eSome might seem to hinder; some might draw us backward;\u003c/p\u003e \n\u003cp\u003eBut they work together, and they work for good,\u003c/p\u003e \n\u003cp\u003eAll the thwarted longings, all the stern denials,\u003c/p\u003e \n\u003cp\u003eAll the contradictions, hard to understand.\u003c/p\u003e \n\u003cp\u003eAnd the force that holds them, speeds them and retards them,\u003c/p\u003e \n\u003cp\u003eStops and starts and guides them--is our Father\u0027s hand.\u003c/p\u003e \n\u003cp\u003e--Annie Johnson Flint.　\u003c/p\u003e \n\u003cp\u003e　 四月九日\u003c/p\u003e \n\u003cp\u003e“这些事都归到我身上了”（创四十二：36节）。\u003c/p\u003e \n\u003cp\u003e“万事都互相效力，叫爱神的人得益处”（罗八：28）。\u003c/p\u003e \n\u003cp\u003e　　许多信徒都在求能力。能力是怎样产生的呢？有一天我们参观电机厂，听见无数的机轮发出轧轧的机声来，我们就问里边的人说，“电力究竟是如何产生的呢？”他说，“轮与轮转动，就生磨擦。磨擦就生电力”。\u003c/p\u003e \n\u003cp\u003e　　同样的道理，当神要给你更多的能力时，他就给你更多的难处给你起磨擦。可惜许多人不喜欢磨擦，反要逃避磨擦，因此失去了得能力的机会。\u003c/p\u003e \n\u003cp\u003e　　凡事都有正有反，正与反乃是平衡力量的要素。向心力和离心力互相对峙的缘故，遂能使行星在轨道上行动。一个推进，一个拉回，才会不使它越出轨道，而能绕着太阳安全运行。\u003c/p\u003e \n\u003cp\u003e　　神也这样管理我们的生命。只有前进的力是不够的，我们还需要一个拉回的力，所以神给我们一些试验，一些反对我们的重压；其实这些东西都是帮助我们前进的。\u003c/p\u003e \n\u003cp\u003e　　让我们感谢他；让我们欢迎他给我们的重压，像欢迎他给我们的翅膀一样；让我们用信心和忍耐来前进。什么地方有磨擦，什么地方就有能力。——信宣\u003c/p\u003e \n\u003cp\u003e一所工厂里有机器和齿轮，\u003c/p\u003e \n\u003cp\u003e有曲杆与滑车，还有皮带或紧或松，\u003c/p\u003e \n\u003cp\u003e有的旋转如飞，有的慢慢滚动，\u003c/p\u003e \n\u003cp\u003e有的往后拉，有的向前推，\u003c/p\u003e \n\u003cp\u003e有的光滑无声，有的粗糙喧嚷，\u003c/p\u003e \n\u003cp\u003e碰，撞，弹，跳，铿锵作声。\u003c/p\u003e \n\u003cp\u003e在一个似若纷乱的混沌中，\u003c/p\u003e \n\u003cp\u003e忽升忽降忽推忽拉都是作工，\u003c/p\u003e \n\u003cp\u003e从最大的杠杆到最小的齿轮，\u003c/p\u003e \n\u003cp\u003e都是为预定的目标配合行动；\u003c/p\u003e \n\u003cp\u003e在动作的背后，有意志在控制，\u003c/p\u003e \n\u003cp\u003e有权力在指挥，有一只手在操纵。\u003c/p\u003e \n\u003cp\u003e一切东西都在为主所爱的人作工，\u003c/p\u003e \n\u003cp\u003e若把它们单独分开，有的可能为害；\u003c/p\u003e \n\u003cp\u003e有的似若阻碍；有的可能把我拖倒；\u003c/p\u003e \n\u003cp\u003e但它们互相效力，为了使我们得益。\u003c/p\u003e \n\u003cp\u003e一切受挫的愿望，一切严厉的拒斥，\u003c/p\u003e \n\u003cp\u003e一切难以了解的矛盾龃龉。\u003c/p\u003e \n\u003cp\u003e它们的前进后退，开始和停止，\u003c/p\u003e \n\u003cp\u003e都有我们天父的力量在控制。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/92/5035.html","bookId":475,"creation":"Aug 2, 2019 6:41:20 AM","modification":"Aug 2, 2019 6:41:20 AM"}
