{"id":27362,"no":7,"title":"CHAPTER VII. AN ILL WIND FOR SCHMIDT.","content":"\u0026nbsp;The clear, commanding tones of the Dreadnought Boy had relighted in the souls of the straggling, delinquent sailors a spark of honor, of feeling for the flag and duty. But Schmidt saw to it that the revival of this instinct was only momentary. \n\u003cdiv\u003e\n While the men exchanged glances and began to get shoulder to shoulder ready for a rescuing rush, he raised his thick voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If dey gedt you pack on sheep, you know voyt you gedt idt!” he cried. “You gedts nuddings budt der brig, bread undt vater undt no shore leafes. Nobotty can hear nuddings in dis blace, undt ov you don’t help dis young pig-head of a officer, nopoddy been der viser. Ov you help him, he take you pack aboardt der sheeps undt den your troubles pegins!”\n\u003c/div\u003e \n\u003cdiv\u003e\n [68]\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a crafty appeal by a crafty man well versed in the ways of those who follow the sea. The men who, an instant before, had been rallied by Ned’s manly, outspoken address, hesitated and began to murmur among each other. Ned, with an inward groan, saw that the argument had been effective.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I promise to do my best for you, men, if you help me now,” he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, all that may be, Gunner’s-Mate,” retorted a much-tattooed old tar, who went by the name of “Harness Cask” Bill, “but what good can you do us with a skipper who’ll put us in the brig on short allowance and stop our shore leave the rest of the cruise?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s right, Bill,” cried another; “we’d only be cutting our own throats, say I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Them’s my opinions,” cried a third. “It’s hands off, mates, I say. Schmidt will give us a chance to get clear away and then to blazes with the navy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [69]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shame!” cried Ned in a loud, clear voice. “Shame on you, my man, to abuse a service that is the finest in the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, stow that gaff,” growled someone, and as if it had been a signal, the attack recommenced. Childs was torn from Ned’s side and the whole press of desperate characters surged about him, shouting and struggling to seize him. Ned fought with all his skill and bravery. But in the nature of things, it was a contest that could not long endure.\n\u003c/div\u003e \n\u003cdiv\u003e\n A dozen men, with arms developed into Samson-like strength in the fire-rooms of a hundred deep-sea tramps, threw themselves upon him. With all the wiry strength and resource that were his, Ned struggled. But by sheer superiority of numbers and brawn the others were bound to win, and Ned knew that it must be so from the first.\n\u003c/div\u003e \n\u003cdiv\u003e\n Powerful as he was, the Dreadnought Boy was little more than a puppet in their hands. He gave[70] a good account of himself and then, “with colors flying,” Ned Strong was borne to the ground with a dozen bodies piled on top of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the guttural accents of the fat and flabby Schmidt, some orders were hastily given. Ned was picked up breathless and bruised but still struggling for freedom. He was carried through a rear door. Down a long, dark, ill-smelling hallway he was borne till another portal was reached. Schmidt, who carried a candle stuck in a bottle, kicked this door open.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In midt him,” he ordered.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned was hurled bodily forward and landed on a wooden floor with a hard thud that left him badly shaken. The door was slammed to and then came the “click” of a lock as it was shot.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve been fooled, badly fooled,” groaned poor Ned, “but,” clenching his fists, “I’ll win out yet. I will! I will!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He got up on his feet and looked about him. The room was not a large one, and except for the[71] door by which he had been thrust into it, the place had no doors or windows. Over his head, however, was a skylight with dirt-crusted panes which admitted a dim sort of light.\n\u003c/div\u003e \n\u003cdiv\u003e\n Apparently the room was a sort of storeroom, for all about were boxes, bales and old barrels. The boxes attracted Ned’s attention. They were lavishly decorated and covered with characters which he recognized as being Chinese. An aromatic odor was in the air and Ned soon perceived why. The decorated chests were tea receptacles. Most of them were unopened and had apparently come direct from some Oriental ship, for there were no customs marks upon them. The truth burst upon Ned suddenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The tea-chests were off vessels from the Orient. But they had never paid duty. He was beholding an adjunct of Schmidt’s business,—a tea-smuggling plant on a large scale. He estimated that, allowing even a small price for the tea, there must have been at least ten thousand dollars’ worth of the herb stored in that room.\n\u003c/div\u003e \n\u003cdiv\u003e\n [72]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Phew!” exclaimed the boy, “here’s a find which alone will cause a lot of trouble for Schmidt, if I can ever get out of here. What a collection! But tea won’t do me any good now. What I need is something to batter that door down. I might rush them and get clear away if I only could. I’ll try it, anyhow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But a brief examination of the door showed him that such an attempt would be only foolish waste of strength. The door was made of heavy planks re?nforced with iron bolts, and appeared to have been built to withstand a siege.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A regular safe-deposit vault,” sighed Ned. “What a predicament! I’ve certainly made a fine mess of it, this time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He fell to examining the walls. But they were apparently as solidly constructed as the door. The skylight offered the only means of egress and that was fully ten feet from the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned looked up at it wistfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if there’s any way I could get up[73] there,” he said musingly. “No, it’s too high, I—By hookey! I’ve got an idea. These boxes! I can build a pile of them and climb up to it. It’s worth trying, anyhow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned lost no time in carrying out his plan. He did not know at what moment he might be interrupted and this fear lent haste to his movements. He dragged and piled heavy chests till they grew too much for him to handle. Then he looked about for lighter articles to construct the apex of the pile on which he meant to try to crawl to liberty.\n\u003c/div\u003e \n\u003cdiv\u003e\n He found several boxes which were empty and easily handled and he placed these on top of the tea-chests. Then he climbed up, but he found that his finger tips were still, even when out-stretched to their utmost, some distance from the edge of the skylight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll jump for it. I think there’s one bare chance I can make it,” thought Ned.\n\u003c/div\u003e \n\u003cdiv\u003e\n He crouched, flexing his muscles for a supreme[74] effort. Carefully measuring the distance with his eyes he shot straight upward for the edge of the skylight frame. His finger tips clutched the sides, slipped and then his grip gave way.\n\u003c/div\u003e \n\u003cdiv\u003e\n Down he came, crashing, with boxes and bales tumbling about him and creating a fearful uproar. As he struck the ground he lay quite still. Apparently he had not been injured, though how he escaped, he could hardly make out himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n He got upon his feet and listened. He could not hear a sound outside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’ve deserted the place like a lot of rats,” he exclaimed. “There’s nothing left for me to do but to try again. I guess——”\n\u003c/div\u003e \n\u003cdiv\u003e\n Outside the door sounded a trampling of feet. The crash of Ned’s down-toppling pyramid had then, after all, been heard outside. In another minute they would be in the room, and then——?\n\u003c/div\u003e \n\u003cdiv\u003e\n A key grated in the lock. Ned darted behind a large barrel which lay on its side in a corner[75] of the place. Crouching there like a hunted thing, he heard the door flung open and several men tramp into the room. Above the voices that broke into hub-bub when the wreck of Ned’s pile of boxes was seen, Schmidt’s could be heard plainly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Himmel! He’s climbed py der schylighdt oudt!” shrilled the German.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he has, we’ve got him then!” came another voice. “He can’t get off that roof.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ach no! Dot is so!” cried the German jubilantly. “We haf him like a leedle mouse midt a cat. Gedt a latter, somebodty. Donner! Ve dondt vant to loose him now. Idt vould mean der ruination of der ‘Fair Vind.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned saw a gleam of hope. If only they carried out their plan there was still a chance for him. Crouching behind the barrel, he eagerly awaited the sound of the next move, for he did not dare to protrude his head from his hiding place.\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently came the scraping sound of the ladder being run up to the skylight.\n\u003c/div\u003e \n\u003cdiv\u003e\n [76]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Up, undt after him!” cried Schmidt.\n\u003c/div\u003e \n\u003cdiv\u003e\n Three men nimbly ascended the ladder. Ned, looking up, could see them as they mounted, but luckily they did not look down. It never occurred to them that the lad for whom they were searching was within a few feet of them, and not on the roof at all.\n\u003c/div\u003e \n\u003cdiv\u003e\n The last to ascend were the hawk-eyed man and Schmidt himself. The fat German was so eager to join in the pursuit that he could not forego the, to him, painful climb up the ladder, which it involved.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned chuckled as the two pairs of ankles vanished through the skylight. The moment had arrived for him to put his plan into execution. He lost no time in doing so.\n\u003c/div\u003e \n\u003cdiv\u003e\n Darting from his hiding place, he ran toward the ladder and, seizing it, he sent it crashing to the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n The escape of the men on the roof above was cut off.\n\u003c/div\u003e \n\u003cdiv\u003e\n [77]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hip! hip! hooray!” yelled Ned at the top of his healthy lungs.\n\u003c/div\u003e \n\u003cdiv\u003e\n The crash of the falling ladder and the sound of the hearty cheer brought Herr Schmidt to the edge of the skylight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Donner vetter!” he wailed. “The ladder has fallen! How vee gedt down?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It didn’t fall, it was pushed, Schmidt!” cried Ned exultingly, unable to forego his delight in his triumph. “You can’t get down till the police come and help you down.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Blitzen!” roared the German. “It’s der poy from der nafy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s who it is,” cried Ned, “and next time, think it over before you try to beat him! So long!”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he vanished through the door leading to the passage, a howl of fury and rage went up from the roof. Imprisoned upon it by the Yankee lad’s ingenuity and grit were as choice an assortment of rascals as ever were trapped by a strategist who was in years only a lad.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3332/91207.html","bookId":359,"creation":"Aug 4, 2019 2:00:47 AM","modification":"Aug 4, 2019 2:00:47 AM"}
