{"id":24390,"no":30,"title":"XXVII. THE VIRTUOUS.","content":"With thunder and heavenly fireworks must one speak to indolent and somnolent senses.\n\u003cbr\u003e \n\u003cbr\u003e But beauty’s voice speaketh gently: it appealeth only to the most awakened souls.\n\u003cbr\u003e \n\u003cbr\u003e Gently vibrated and laughed unto me to-day my buckler; it was beauty’s holy laughing and thrilling.\n\u003cbr\u003e \n\u003cbr\u003e At you, ye virtuous ones, laughed my beauty to-day. And thus came its voice unto me: “They want—to be paid besides!”\n\u003cbr\u003e \n\u003cbr\u003e Ye want to be paid besides, ye virtuous ones! Ye want reward for virtue, and heaven for earth, and eternity for your to-day?\n\u003cbr\u003e \n\u003cbr\u003e And now ye upbraid me for teaching that there is no reward-giver, nor paymaster? And verily, I do not even teach that virtue is its own reward.\n\u003cbr\u003e \n\u003cbr\u003e Ah! this is my sorrow: into the basis of things have reward and punishment been insinuated—and now even into the basis of your souls, ye virtuous ones!\n\u003cbr\u003e \n\u003cbr\u003e But like the snout of the boar shall my word grub up the basis of your souls; a ploughshare will I be called by you.\n\u003cbr\u003e \n\u003cbr\u003e All the secrets of your heart shall be brought to light; and when ye lie in the sun, grubbed up and broken, then will also your falsehood be separated from your truth.\n\u003cbr\u003e \n\u003cbr\u003e For this is your truth: ye are TOO PURE for the filth of the words: vengeance, punishment, recompense, retribution.\n\u003cbr\u003e \n\u003cbr\u003e Ye love your virtue as a mother loveth her child; but when did one hear of a mother wanting to be paid for her love?\n\u003cbr\u003e \n\u003cbr\u003e It is your dearest Self, your virtue. The ring’s thirst is in you: to reach itself again struggleth every ring, and turneth itself.\n\u003cbr\u003e \n\u003cbr\u003e And like the star that goeth out, so is every work of your virtue: ever is its light on its way and travelling—and when will it cease to be on its way?\n\u003cbr\u003e \n\u003cbr\u003e Thus is the light of your virtue still on its way, even when its work is done. Be it forgotten and dead, still its ray of light liveth and travelleth.\n\u003cbr\u003e \n\u003cbr\u003e That your virtue is your Self, and not an outward thing, a skin, or a cloak: that is the truth from the basis of your souls, ye virtuous ones!—\n\u003cbr\u003e \n\u003cbr\u003e But sure enough there are those to whom virtue meaneth writhing under the lash: and ye have hearkened too much unto their crying!\n\u003cbr\u003e \n\u003cbr\u003e And others are there who call virtue the slothfulness of their vices; and when once their hatred and jealousy relax the limbs, their “justice” becometh lively and rubbeth its sleepy eyes.\n\u003cbr\u003e \n\u003cbr\u003e And others are there who are drawn downwards: their devils draw them. But the more they sink, the more ardently gloweth their eye, and the longing for their God.\n\u003cbr\u003e \n\u003cbr\u003e Ah! their crying also hath reached your ears, ye virtuous ones: “What I am NOT, that, that is God to me, and virtue!”\n\u003cbr\u003e \n\u003cbr\u003e And others are there who go along heavily and creakingly, like carts taking stones downhill: they talk much of dignity and virtue—their drag they call virtue!\n\u003cbr\u003e \n\u003cbr\u003e And others are there who are like eight-day clocks when wound up; they tick, and want people to call ticking—virtue.\n\u003cbr\u003e \n\u003cbr\u003e Verily, in those have I mine amusement: wherever I find such clocks I shall wind them up with my mockery, and they shall even whirr thereby!\n\u003cbr\u003e \n\u003cbr\u003e And others are proud of their modicum of righteousness, and for the sake of it do violence to all things: so that the world is drowned in their unrighteousness.\n\u003cbr\u003e \n\u003cbr\u003e Ah! how ineptly cometh the word “virtue” out of their mouth! And when they say: “I am just,” it always soundeth like: “I am just—revenged!”\n\u003cbr\u003e \n\u003cbr\u003e With their virtues they want to scratch out the eyes of their enemies; and they elevate themselves only that they may lower others.\n\u003cbr\u003e \n\u003cbr\u003e And again there are those who sit in their swamp, and speak thus from among the bulrushes: “Virtue—that is to sit quietly in the swamp.\n\u003cbr\u003e \n\u003cbr\u003e We bite no one, and go out of the way of him who would bite; and in all matters we have the opinion that is given us.”\n\u003cbr\u003e \n\u003cbr\u003e And again there are those who love attitudes, and think that virtue is a sort of attitude.\n\u003cbr\u003e \n\u003cbr\u003e Their knees continually adore, and their hands are eulogies of virtue, but their heart knoweth naught thereof.\n\u003cbr\u003e \n\u003cbr\u003e And again there are those who regard it as virtue to say: “Virtue is necessary”; but after all they believe only that policemen are necessary.\n\u003cbr\u003e \n\u003cbr\u003e And many a one who cannot see men’s loftiness, calleth it virtue to see their baseness far too well: thus calleth he his evil eye virtue.—\n\u003cbr\u003e \n\u003cbr\u003e And some want to be edified and raised up, and call it virtue: and others want to be cast down,—and likewise call it virtue.\n\u003cbr\u003e \n\u003cbr\u003e And thus do almost all think that they participate in virtue; and at least every one claimeth to be an authority on “good” and “evil.”\n\u003cbr\u003e \n\u003cbr\u003e But Zarathustra came not to say unto all those liars and fools: “What do YE know of virtue! What COULD ye know of virtue!”—\n\u003cbr\u003e \n\u003cbr\u003e But that ye, my friends, might become weary of the old words which ye have learned from the fools and liars:\n\u003cbr\u003e \n\u003cbr\u003e That ye might become weary of the words “reward,” “retribution,” “punishment,” “righteous vengeance.”—\n\u003cbr\u003e \n\u003cbr\u003e That ye might become weary of saying: “That an action is good is because it is unselfish.”\n\u003cbr\u003e \n\u003cbr\u003e Ah! my friends! That YOUR very Self be in your action, as the mother is in the child: let that be YOUR formula of virtue!\n\u003cbr\u003e \n\u003cbr\u003e Verily, I have taken from you a hundred formulae and your virtue’s favourite playthings; and now ye upbraid me, as children upbraid.\n\u003cbr\u003e \n\u003cbr\u003e They played by the sea—then came there a wave and swept their playthings into the deep: and now do they cry.\n\u003cbr\u003e \n\u003cbr\u003e But the same wave shall bring them new playthings, and spread before them new speckled shells!\n\u003cbr\u003e \n\u003cbr\u003e Thus will they be comforted; and like them shall ye also, my friends, have your comforting—and new speckled shells!—\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2158/61042.html","bookId":445,"creation":"Aug 3, 2019 2:08:22 PM","modification":"Aug 3, 2019 2:08:22 PM"}
