{"id":24417,"no":57,"title":"LIII. THE RETURN HOME.","content":"O lonesomeness! My HOME, lonesomeness! Too long have I lived wildly in wild remoteness, to return to thee without tears!\n\u003cbr\u003e \n\u003cbr\u003e Now threaten me with the finger as mothers threaten; now smile upon me as mothers smile; now say just: “Who was it that like a whirlwind once rushed away from me?—\n\u003cbr\u003e \n\u003cbr\u003e —Who when departing called out: ‘Too long have I sat with lonesomeness; there have I unlearned silence!’ THAT hast thou learned now—surely?\n\u003cbr\u003e \n\u003cbr\u003e O Zarathustra, everything do I know; and that thou wert MORE FORSAKEN amongst the many, thou unique one, than thou ever wert with me!\n\u003cbr\u003e \n\u003cbr\u003e One thing is forsakenness, another matter is lonesomeness: THAT hast thou now learned! And that amongst men thou wilt ever be wild and strange:\n\u003cbr\u003e \n\u003cbr\u003e —Wild and strange even when they love thee: for above all they want to be TREATED INDULGENTLY!\n\u003cbr\u003e \n\u003cbr\u003e Here, however, art thou at home and house with thyself; here canst thou utter everything, and unbosom all motives; nothing is here ashamed of concealed, congealed feelings.\n\u003cbr\u003e \n\u003cbr\u003e Here do all things come caressingly to thy talk and flatter thee: for they want to ride upon thy back. On every simile dost thou here ride to every truth.\n\u003cbr\u003e \n\u003cbr\u003e Uprightly and openly mayest thou here talk to all things: and verily, it soundeth as praise in their ears, for one to talk to all things—directly!\n\u003cbr\u003e \n\u003cbr\u003e Another matter, however, is forsakenness. For, dost thou remember, O Zarathustra? When thy bird screamed overhead, when thou stoodest in the forest, irresolute, ignorant where to go, beside a corpse:—\n\u003cbr\u003e \n\u003cbr\u003e —When thou spakest: ‘Let mine animals lead me! More dangerous have I found it among men than among animals:’—THAT was forsakenness!\n\u003cbr\u003e \n\u003cbr\u003e And dost thou remember, O Zarathustra? When thou sattest in thine isle, a well of wine giving and granting amongst empty buckets, bestowing and distributing amongst the thirsty:\n\u003cbr\u003e \n\u003cbr\u003e —Until at last thou alone sattest thirsty amongst the drunken ones, and wailedst nightly: ‘Is taking not more blessed than giving? And stealing yet more blessed than taking?’—THAT was forsakenness!\n\u003cbr\u003e \n\u003cbr\u003e And dost thou remember, O Zarathustra? When thy stillest hour came and drove thee forth from thyself, when with wicked whispering it said: ‘Speak and succumb!’—\n\u003cbr\u003e \n\u003cbr\u003e —When it disgusted thee with all thy waiting and silence, and discouraged thy humble courage: THAT was forsakenness!”—\n\u003cbr\u003e \n\u003cbr\u003e O lonesomeness! My home, lonesomeness! How blessedly and tenderly speaketh thy voice unto me!\n\u003cbr\u003e \n\u003cbr\u003e We do not question each other, we do not complain to each other; we go together openly through open doors.\n\u003cbr\u003e \n\u003cbr\u003e For all is open with thee and clear; and even the hours run here on lighter feet. For in the dark, time weigheth heavier upon one than in the light.\n\u003cbr\u003e \n\u003cbr\u003e Here fly open unto me all being’s words and word-cabinets: here all being wanteth to become words, here all becoming wanteth to learn of me how to talk.\n\u003cbr\u003e \n\u003cbr\u003e Down there, however—all talking is in vain! There, forgetting and passing-by are the best wisdom: THAT have I learned now!\n\u003cbr\u003e \n\u003cbr\u003e He who would understand everything in man must handle everything. But for that I have too clean hands.\n\u003cbr\u003e \n\u003cbr\u003e I do not like even to inhale their breath; alas! that I have lived so long among their noise and bad breaths!\n\u003cbr\u003e \n\u003cbr\u003e O blessed stillness around me! O pure odours around me! How from a deep breast this stillness fetcheth pure breath! How it hearkeneth, this blessed stillness!\n\u003cbr\u003e \n\u003cbr\u003e But down there—there speaketh everything, there is everything misheard. If one announce one’s wisdom with bells, the shopmen in the market-place will out-jingle it with pennies!\n\u003cbr\u003e \n\u003cbr\u003e Everything among them talketh; no one knoweth any longer how to understand. Everything falleth into the water; nothing falleth any longer into deep wells.\n\u003cbr\u003e \n\u003cbr\u003e Everything among them talketh, nothing succeedeth any longer and accomplisheth itself. Everything cackleth, but who will still sit quietly on the nest and hatch eggs?\n\u003cbr\u003e \n\u003cbr\u003e Everything among them talketh, everything is out-talked. And that which yesterday was still too hard for time itself and its tooth, hangeth to-day, outchamped and outchewed, from the mouths of the men of to-day.\n\u003cbr\u003e \n\u003cbr\u003e Everything among them talketh, everything is betrayed. And what was once called the secret and secrecy of profound souls, belongeth to-day to the street-trumpeters and other butterflies.\n\u003cbr\u003e \n\u003cbr\u003e O human hubbub, thou wonderful thing! Thou noise in dark streets! Now art thou again behind me:—my greatest danger lieth behind me!\n\u003cbr\u003e \n\u003cbr\u003e In indulging and pitying lay ever my greatest danger; and all human hubbub wisheth to be indulged and tolerated.\n\u003cbr\u003e \n\u003cbr\u003e With suppressed truths, with fool’s hand and befooled heart, and rich in petty lies of pity:—thus have I ever lived among men.\n\u003cbr\u003e \n\u003cbr\u003e Disguised did I sit amongst them, ready to misjudge MYSELF that I might endure THEM, and willingly saying to myself: “Thou fool, thou dost not know men!”\n\u003cbr\u003e \n\u003cbr\u003e One unlearneth men when one liveth amongst them: there is too much foreground in all men—what can far-seeing, far-longing eyes do THERE!\n\u003cbr\u003e \n\u003cbr\u003e And, fool that I was, when they misjudged me, I indulged them on that account more than myself, being habitually hard on myself, and often even taking revenge on myself for the indulgence.\n\u003cbr\u003e \n\u003cbr\u003e Stung all over by poisonous flies, and hollowed like the stone by many drops of wickedness: thus did I sit among them, and still said to myself: “Innocent is everything petty of its pettiness!”\n\u003cbr\u003e \n\u003cbr\u003e Especially did I find those who call themselves “the good,” the most poisonous flies; they sting in all innocence, they lie in all innocence; how COULD they—be just towards me!\n\u003cbr\u003e \n\u003cbr\u003e He who liveth amongst the good—pity teacheth him to lie. Pity maketh stifling air for all free souls. For the stupidity of the good is unfathomable.\n\u003cbr\u003e \n\u003cbr\u003e To conceal myself and my riches—THAT did I learn down there: for every one did I still find poor in spirit. It was the lie of my pity, that I knew in every one,\n\u003cbr\u003e \n\u003cbr\u003e —That I saw and scented in every one, what was ENOUGH of spirit for him, and what was TOO MUCH!\n\u003cbr\u003e \n\u003cbr\u003e Their stiff wise men: I call them wise, not stiff—thus did I learn to slur over words.\n\u003cbr\u003e \n\u003cbr\u003e The grave-diggers dig for themselves diseases. Under old rubbish rest bad vapours. One should not stir up the marsh. One should live on mountains.\n\u003cbr\u003e \n\u003cbr\u003e With blessed nostrils do I again breathe mountain-freedom. Freed at last is my nose from the smell of all human hubbub!\n\u003cbr\u003e \n\u003cbr\u003e With sharp breezes tickled, as with sparkling wine, SNEEZETH my soul— sneezeth, and shouteth self-congratulatingly: “Health to thee!”\n\u003cbr\u003e \n\u003cbr\u003e Thus spake Zarathustra.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2158/61069.html","bookId":445,"creation":"Aug 3, 2019 2:08:22 PM","modification":"Aug 3, 2019 2:08:22 PM"}
