{"id":24423,"no":63,"title":"LIX. THE SECOND DANCE-SONG.","content":"1.\n\u003cbr\u003e \n\u003cbr\u003e “Into thine eyes gazed I lately, O Life: gold saw I gleam in thy night-eyes,—my heart stood still with delight:\n\u003cbr\u003e \n\u003cbr\u003e —A golden bark saw I gleam on darkened waters, a sinking, drinking, reblinking, golden swing-bark!\n\u003cbr\u003e \n\u003cbr\u003e At my dance-frantic foot, dost thou cast a glance, a laughing, questioning, melting, thrown glance:\n\u003cbr\u003e \n\u003cbr\u003e Twice only movedst thou thy rattle with thy little hands—then did my feet swing with dance-fury.—\n\u003cbr\u003e \n\u003cbr\u003e My heels reared aloft, my toes they hearkened,—thee they would know: hath not the dancer his ear—in his toe!\n\u003cbr\u003e \n\u003cbr\u003e Unto thee did I spring: then fledst thou back from my bound; and towards me waved thy fleeing, flying tresses round!\n\u003cbr\u003e \n\u003cbr\u003e Away from thee did I spring, and from thy snaky tresses: then stoodst thou there half-turned, and in thine eye caresses.\n\u003cbr\u003e \n\u003cbr\u003e With crooked glances—dost thou teach me crooked courses; on crooked courses learn my feet—crafty fancies!\n\u003cbr\u003e \n\u003cbr\u003e I fear thee near, I love thee far; thy flight allureth me, thy seeking secureth me:—I suffer, but for thee, what would I not gladly bear!\n\u003cbr\u003e \n\u003cbr\u003e For thee, whose coldness inflameth, whose hatred misleadeth, whose flight enchaineth, whose mockery—pleadeth:\n\u003cbr\u003e \n\u003cbr\u003e —Who would not hate thee, thou great bindress, inwindress, temptress, seekress, findress! Who would not love thee, thou innocent, impatient, wind-swift, child-eyed sinner!\n\u003cbr\u003e \n\u003cbr\u003e Whither pullest thou me now, thou paragon and tomboy? And now foolest thou me fleeing; thou sweet romp dost annoy!\n\u003cbr\u003e \n\u003cbr\u003e I dance after thee, I follow even faint traces lonely. Where art thou? Give me thy hand! Or thy finger only!\n\u003cbr\u003e \n\u003cbr\u003e Here are caves and thickets: we shall go astray!—Halt! Stand still! Seest thou not owls and bats in fluttering fray?\n\u003cbr\u003e \n\u003cbr\u003e Thou bat! Thou owl! Thou wouldst play me foul? Where are we? From the dogs hast thou learned thus to bark and howl.\n\u003cbr\u003e \n\u003cbr\u003e Thou gnashest on me sweetly with little white teeth; thine evil eyes shoot out upon me, thy curly little mane from underneath!\n\u003cbr\u003e \n\u003cbr\u003e This is a dance over stock and stone: I am the hunter,—wilt thou be my hound, or my chamois anon?\n\u003cbr\u003e \n\u003cbr\u003e Now beside me! And quickly, wickedly springing! Now up! And over!—Alas! I have fallen myself overswinging!\n\u003cbr\u003e \n\u003cbr\u003e Oh, see me lying, thou arrogant one, and imploring grace! Gladly would I walk with thee—in some lovelier place!\n\u003cbr\u003e \n\u003cbr\u003e —In the paths of love, through bushes variegated, quiet, trim! Or there along the lake, where gold-fishes dance and swim!\n\u003cbr\u003e \n\u003cbr\u003e Thou art now a-weary? There above are sheep and sun-set stripes: is it not sweet to sleep—the shepherd pipes?\n\u003cbr\u003e \n\u003cbr\u003e Thou art so very weary? I carry thee thither; let just thine arm sink! And art thou thirsty—I should have something; but thy mouth would not like it to drink!—\n\u003cbr\u003e \n\u003cbr\u003e —Oh, that cursed, nimble, supple serpent and lurking-witch! Where art thou gone? But in my face do I feel through thy hand, two spots and red blotches itch!\n\u003cbr\u003e \n\u003cbr\u003e I am verily weary of it, ever thy sheepish shepherd to be. Thou witch, if I have hitherto sung unto thee, now shalt THOU—cry unto me!\n\u003cbr\u003e \n\u003cbr\u003e To the rhythm of my whip shalt thou dance and cry! I forget not my whip?—Not I!”—\n\u003cbr\u003e \n\u003cbr\u003e 2.\n\u003cbr\u003e \n\u003cbr\u003e Then did Life answer me thus, and kept thereby her fine ears closed:\n\u003cbr\u003e \n\u003cbr\u003e “O Zarathustra! Crack not so terribly with thy whip! Thou knowest surely that noise killeth thought,—and just now there came to me such delicate thoughts.\n\u003cbr\u003e \n\u003cbr\u003e We are both of us genuine ne’er-do-wells and ne’er-do-ills. Beyond good and evil found we our island and our green meadow—we two alone! Therefore must we be friendly to each other!\n\u003cbr\u003e \n\u003cbr\u003e And even should we not love each other from the bottom of our hearts,—must we then have a grudge against each other if we do not love each other perfectly?\n\u003cbr\u003e \n\u003cbr\u003e And that I am friendly to thee, and often too friendly, that knowest thou: and the reason is that I am envious of thy Wisdom. Ah, this mad old fool, Wisdom!\n\u003cbr\u003e \n\u003cbr\u003e If thy Wisdom should one day run away from thee, ah! then would also my love run away from thee quickly.”—\n\u003cbr\u003e \n\u003cbr\u003e Thereupon did Life look thoughtfully behind and around, and said softly: “O Zarathustra, thou art not faithful enough to me!\n\u003cbr\u003e \n\u003cbr\u003e Thou lovest me not nearly so much as thou sayest; I know thou thinkest of soon leaving me.\n\u003cbr\u003e \n\u003cbr\u003e There is an old heavy, heavy, booming-clock: it boometh by night up to thy cave:—\n\u003cbr\u003e \n\u003cbr\u003e —When thou hearest this clock strike the hours at midnight, then thinkest thou between one and twelve thereon—\n\u003cbr\u003e \n\u003cbr\u003e —Thou thinkest thereon, O Zarathustra, I know it—of soon leaving me!”—\n\u003cbr\u003e \n\u003cbr\u003e “Yea,” answered I, hesitatingly, “but thou knowest it also”—And I said something into her ear, in amongst her confused, yellow, foolish tresses.\n\u003cbr\u003e \n\u003cbr\u003e “Thou KNOWEST that, O Zarathustra? That knoweth no one—”\n\u003cbr\u003e \n\u003cbr\u003e And we gazed at each other, and looked at the green meadow o’er which the cool evening was just passing, and we wept together.—Then, however, was Life dearer unto me than all my Wisdom had ever been.—\n\u003cbr\u003e \n\u003cbr\u003e Thus spake Zarathustra.\n\u003cbr\u003e \n\u003cbr\u003e 3.\n\u003cbr\u003e \n\u003cbr\u003e One!\n\u003cbr\u003e \n\u003cbr\u003e O man! Take heed!\n\u003cbr\u003e \n\u003cbr\u003e Two!\n\u003cbr\u003e \n\u003cbr\u003e What saith deep midnight’s voice indeed?\n\u003cbr\u003e \n\u003cbr\u003e Three!\n\u003cbr\u003e \n\u003cbr\u003e “I slept my sleep—\n\u003cbr\u003e \n\u003cbr\u003e Four!\n\u003cbr\u003e \n\u003cbr\u003e “From deepest dream I’ve woke and plead:—\n\u003cbr\u003e \n\u003cbr\u003e Five!\n\u003cbr\u003e \n\u003cbr\u003e “The world is deep,\n\u003cbr\u003e \n\u003cbr\u003e Six!\n\u003cbr\u003e \n\u003cbr\u003e “And deeper than the day could read.\n\u003cbr\u003e \n\u003cbr\u003e Seven!\n\u003cbr\u003e \n\u003cbr\u003e “Deep is its woe—\n\u003cbr\u003e \n\u003cbr\u003e Eight!\n\u003cbr\u003e \n\u003cbr\u003e “Joy—deeper still than grief can be:\n\u003cbr\u003e \n\u003cbr\u003e Nine!\n\u003cbr\u003e \n\u003cbr\u003e “Woe saith: Hence! Go!\n\u003cbr\u003e \n\u003cbr\u003e Ten!\n\u003cbr\u003e \n\u003cbr\u003e “But joys all want eternity—\n\u003cbr\u003e \n\u003cbr\u003e Eleven!\n\u003cbr\u003e \n\u003cbr\u003e “Want deep profound eternity!”\n\u003cbr\u003e \n\u003cbr\u003e Twelve!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2158/61075.html","bookId":445,"creation":"Aug 3, 2019 2:08:22 PM","modification":"Aug 3, 2019 2:08:22 PM"}
