{"id":13009,"no":23,"title":"CHAPTER XXII “DING DONG BELL.”","content":"THE week passed so quickly, with our hay-making and our getting over our hay-making and our pleasant walks—we did not attempt to drive out again behind “th’ ould scut”,—and the attractive meals that Minerva cooked and the pleasant music that Cherry found within the piano, that when Friday came, and Cherry asked me if I had found a team to carry her down, Ethel said,\n\u003cbr\u003e \n\u003cbr\u003e “It’s all nonsense, your thinking of going back. Philip, she says that she hasn’t made any plans at all, beyond thinking of going to Bar Harbor in September to visit her aunt.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, then, Cherry, it will be downright unkind in you to ask me to hunt up a team yet awhile. Just stay on until the haying season is over, and we can go down behind a real horse.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, of course I’m having a perfectly delicious time,” said Cherry, putting her arms around Ethel’s shoulders affectionately, “and I’d much rather stay than go, but it seems like—”\n\u003cbr\u003e \n\u003cbr\u003e “It doesn’t seem like anything at all,” said Ethel, “except that we want you to stay. And, besides, we want you to meet Ellery Sibthorp.”\n\u003cbr\u003e \n\u003cbr\u003e “Ellery Sibthorp,” said Cherry with a laugh. “Is that his real name?”\n\u003cbr\u003e \n\u003cbr\u003e “That’s his real name, the one he writes under, and Philip asked me to ask him up. He’s all alone in the world and is struggling to make a name for himself.”\n\u003cbr\u003e \n\u003cbr\u003e “Mercy, I should think he had one ready made. Ellery Sibthorp. It’s as valuable as Rudyard Kipling.”\n\u003cbr\u003e \n\u003cbr\u003e “Wait till you see him,” said I. “He’s poor as a church mouse and as clean as a whistle, and as good as gold.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I’m simply dying to see him. When does he come? And how will you get him up?”\n\u003cbr\u003e \n\u003cbr\u003e “Egerton livery, this time. And he’s coming Monday. So you see, if you were to go to-morrow, you wouldn’t see him.”\n\u003cbr\u003e \n\u003cbr\u003e “Tell me something about him. Of course I’ll stay. How old is he? Is he married?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, no. I guess he’s about twenty-eight, and he’s one of the great unrecognized. Good, but different, so he’s got to wait.”\n\u003cbr\u003e \n\u003cbr\u003e “Hasn’t he had anything accepted?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, a few things, but not enough to make him hopeless of success.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, is he that type?”\n\u003cbr\u003e \n\u003cbr\u003e “A little. If he finally takes the world by storm, he won’t be among those who are surprised.”\n\u003cbr\u003e \n\u003cbr\u003e “And what do you think of him?”\n\u003cbr\u003e \n\u003cbr\u003e “I? Oh, I think he’s young and can afford to wait, but I guess he’s one of the real ones. It won’t do him any harm to wait.”\n\u003cbr\u003e \n\u003cbr\u003e “That always sounds so merciless,” said Ethel. She and Cherry were sitting on a settee under a maple. She turned to her friend. “Half the time he lives on next to nothing, and yet Philip says that it will do him no harm to wait. He may starve before the world finds him out.”\n\u003cbr\u003e \n\u003cbr\u003e “Even if he does, he’ll be the happier in the world to come,” said I. “But don’t look for a sad-eyed, posing, long-haired, hollow-cheeked poet. Sibthorp sticks to prose, and he has a sense of humour that keeps him sane and satisfied and hopeful. I really think that if he were to be tremendously successful now that life would lose something of its savour. He feels in a vague way that he belongs to the line of those who have had to toil and wait before recognition came, and the thought is not distasteful.”\n\u003cbr\u003e \n\u003cbr\u003e “Will he read to us, or will he be like you, and never read anything of his own?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, he’ll read, if you press him—”\n\u003cbr\u003e \n\u003cbr\u003e Just then we heard moans that we had supposed were never to be heard again, and Minerva came running out of the house.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Mist. Vernon, Miss Pussy has fell down the well.”\n\u003cbr\u003e \n\u003cbr\u003e “Not really?” said Ethel, jumping up from the settee. “Oh, Philip, you must get her out at once. We never can drink the water again.”\n\u003cbr\u003e \n\u003cbr\u003e “Are you sure she’s there, Minerva?”\n\u003cbr\u003e \n\u003cbr\u003e “’Deed I am. I had the top off to fix that chain that got unhooked agin, an’ she must have jumped up awn the edge and then fell in. She’ll be drowned, sure.”\n\u003cbr\u003e \n\u003cbr\u003e “Where’s James?” said I, hurrying through the house.\n\u003cbr\u003e \n\u003cbr\u003e “He’s gone home.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, you go get him. I’ll fish for the cat, but he’d be more likely to get her if he went down. Hurry!”\n\u003cbr\u003e \n\u003cbr\u003e Our drinking water was pumped out of the well, that was under the kitchen, by means of an endless chain furnished with rubber buckets, and while the well was some thirty feet deep, it would not be much of a job for a man used to it to go down and rescue the cat, supposing that its nine lives held out until he came. I did not think of going down, because I cannot swim, and a single false step would have meant drowning for me, and the husband who throws away his life for a cat has a false sense of values.\n\u003cbr\u003e \n\u003cbr\u003e Minerva rushed out to within bawling distance of James, and I lighted a candle and lowered it by means of a clothes line for about ten feet.\n\u003cbr\u003e \n\u003cbr\u003e “I see her! She’s swimming!” I exclaimed, and then the candle went out and I drew it up.\n\u003cbr\u003e \n\u003cbr\u003e I then tied an eight-quart pail on the line and lowered that, and when I felt it hitting water I called to the cat reassuringly, hoping that it would have sense enough to get inside of the pail. I pulled and felt the weight of the cat.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve got her,” said I to Ethel and Cherry, who stood, interested spectators, at the kitchen door.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, how fortunate,” said Ethel.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Minerva needn’t have called James. My, the cat must be water logged. She’s heavy.”\n\u003cbr\u003e \n\u003cbr\u003e I pulled hand over hand, and at last the pail was near enough for me to reach down and taking it’s bail, pull it over the edge.\n\u003cbr\u003e \n\u003cbr\u003e It was full to overflowing—with water.\n\u003cbr\u003e \n\u003cbr\u003e “Where’s the cat?” said Ethel in astonishment.\n\u003cbr\u003e \n\u003cbr\u003e “Cat’s gone back.”\n\u003cbr\u003e \n\u003cbr\u003e I lowered the bucket again, although I felt that it was time thrown away. While I was trying to attract Miss Pussy’s attention Cherry, looking out into the moonlight, said,\n\u003cbr\u003e \n\u003cbr\u003e “Here comes James.”\n\u003cbr\u003e \n\u003cbr\u003e And a minute later he came in. He had not quite reached home when he heard Minerva’s agonized calls, and came in obedience to them.\n\u003cbr\u003e \n\u003cbr\u003e “Think you can get her, James?” said I.\n\u003cbr\u003e \n\u003cbr\u003e “I guess so. Light the lantern, Minerva,” said he, and Minerva sprang to the cellar stairs and brought out a lantern which she lighted promptly.\n\u003cbr\u003e \n\u003cbr\u003e “Think she’s drowned, James?”\n\u003cbr\u003e \n\u003cbr\u003e “No, sir, cats hate water, but they can swim all right.”\n\u003cbr\u003e \n\u003cbr\u003e He stepped into the woodshed and came back in a minute with a coil of new clothes line. This he doubled and then tied it around his waist, asking me to hold on to the end of it.\n\u003cbr\u003e \n\u003cbr\u003e The lantern he fastened to the other rope’s end.\n\u003cbr\u003e \n\u003cbr\u003e “Keep yourself braced,” said he. “I wont fall, for I’ve often been down there to clean it, but if I do, you can pull me up.”\n\u003cbr\u003e \n\u003cbr\u003e “Try not to go, James,” said I, looking at his two hundred pounds, and at the slender rope.\n\u003cbr\u003e \n\u003cbr\u003e We wrenched off the case of the pump, and stepping down he was lost to sight almost immediately.\n\u003cbr\u003e \n\u003cbr\u003e I lowered the lantern and he made his way to the water.\n\u003cbr\u003e \n\u003cbr\u003e “Do you suppose the cat slipped?” I asked Minerva.\n\u003cbr\u003e \n\u003cbr\u003e “I reckon she was thirsty.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, she won’t be thirsty when she comes out. What do you find, James?”\n\u003cbr\u003e \n\u003cbr\u003e “A scrubbing brush.”\n\u003cbr\u003e \n\u003cbr\u003e “Ooh,” said Ethel, and “Ugh,” said Cherry, but Minerva said,\n\u003cbr\u003e \n\u003cbr\u003e “Lawdy, I wondered what I had done with that.”\n\u003cbr\u003e \n\u003cbr\u003e “Where’s the cat, James?”\n\u003cbr\u003e \n\u003cbr\u003e “I’m afraid she’s sunk. She ain’t here. That’s certain.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s too bad. Coming up?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir. No use looking any more. She’s gone down.”\n\u003cbr\u003e \n\u003cbr\u003e I began to pull in the rope, and James began to ascend. Suddenly there was a splash and simultaneously I was pulled forward, and almost went into the well myself.\n\u003cbr\u003e \n\u003cbr\u003e Minerva shrieked and so did Ethel and Cherry, but James’s voice rose assuringly.\n\u003cbr\u003e \n\u003cbr\u003e “All right. Missed my footing. My, but this water’s cold.”\n\u003cbr\u003e \n\u003cbr\u003e We could hear him spluttering.\n\u003cbr\u003e \n\u003cbr\u003e “Here, lend a hand, all of you, at this rope,” said I, and we all began to pull.\n\u003cbr\u003e \n\u003cbr\u003e Of course it meant that next day James would have to pump the well dry and get the poor little body of the poor little cat. What a lot of excitement and suspense and labour over one smallish cat. Indeed, what a risk of life, for James might easily have hit his head when he fell.\n\u003cbr\u003e \n\u003cbr\u003e We hung back on the rope like sailors, and James climbed higher and higher, and at last his black hand came up and grasped the edge of the curb, and a moment later, dripping and shivering, he stood upon the floor.\n\u003cbr\u003e \n\u003cbr\u003e And then we heard the voice of a cat. I rushed to the well and looked in, but the sounds did not come from there. They came from out of doors.\n\u003cbr\u003e \n\u003cbr\u003e “That sounds like her,” said James.\n\u003cbr\u003e \n\u003cbr\u003e “It’s her ghost,” said Minerva. “She’s comin’ to ha’nt me.”\n\u003cbr\u003e \n\u003cbr\u003e Illogically enough we all pictured the cat standing outside of the door dripping water.\n\u003cbr\u003e \n\u003cbr\u003e I opened the door and in walked Miss Pussy, as dry as a bone, and began to rub against Minerva’s skirts.\n\u003cbr\u003e \n\u003cbr\u003e “Why, she’s dry,” said Ethel.\n\u003cbr\u003e \n\u003cbr\u003e Minerva burst out laughing. “My, I clean forgot. I shut her out doors before I began moppin’.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2056/58533.html","bookId":571,"creation":"Aug 2, 2019 5:07:12 AM","modification":"Aug 2, 2019 5:07:12 AM"}
