{"id":13011,"no":25,"title":"CHAPTER XXIV PAT CASEY CALLS.","content":"THE next day we were all awakened by one of Minerva’s morning songs, but it was such a morning—the air was so bracing and fragrant, the sun so mellow, and yet not too hot, that not one of us felt that the song was out of place, and all four met on the porch a good half hour before breakfast.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Ellery, this is a great day to work. How would an epic do and we’ll delay luncheon a half hour, so that you can finish it.”\n\u003cbr\u003e \n\u003cbr\u003e Ellery looked over the waving, billowing meadows. Then he looked at Cherry, rosy and vibrant with animation.\n\u003cbr\u003e \n\u003cbr\u003e “I believe it’s going to do me more good if I lay off for a few days and get charged with some of this air.”\n\u003cbr\u003e \n\u003cbr\u003e We all shrieked gaily at him.\n\u003cbr\u003e \n\u003cbr\u003e “We could have told you so last night,” said Ethel.\n\u003cbr\u003e \n\u003cbr\u003e “I did tell him so,” said I. “Here’s where you store up mental energy, but you might as well try to write at sea as to try to write up here. Let’s go put up the tennis net.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, all right,” said Ellery. “I was going to ask Miss Paxton if she wouldn’t show me around the place a little. Have we time before breakfast?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said Ethel, “but don’t go too far. Minerva’s going to have griddle cakes and real maple syrup and they need to be eaten hot.”\n\u003cbr\u003e \n\u003cbr\u003e When the two had sauntered off I said to Ethel,\n\u003cbr\u003e \n\u003cbr\u003e “You’re a romantic soul with your griddle cakes. Don’t you see those two? In the language of the day, Ellery is stung.”\n\u003cbr\u003e \n\u003cbr\u003e “Imagine him married.”\n\u003cbr\u003e \n\u003cbr\u003e “It would be the finest thing for him that ever happened. He might amount to something with a wife to look after him.”\n\u003cbr\u003e \n\u003cbr\u003e “It doesn’t always work,” said Ethel, saucily.\n\u003cbr\u003e \n\u003cbr\u003e “Better four hundred a year where love is—” I began.\n\u003cbr\u003e \n\u003cbr\u003e “Than a stalled ox and hatred therewith,” concluded Ethel.\n\u003cbr\u003e \n\u003cbr\u003e “Something like that. Four hundred a year with love is a large order. She’d better wait until Ellery is famous. But perhaps we’d better not hurry them along. She’s interested in him because he has talent and is unrecognized, and he’s interested in her because he has talent and she recognized it, but I don’t believe but that you could buy him off with a mess of pottage—”\n\u003cbr\u003e \n\u003cbr\u003e “Or some griddle cakes. There’s the bell now. You call them.”\n\u003cbr\u003e \n\u003cbr\u003e I called “Breakfast’s ready,” although the two were out of sight, and my call was answered by an “Arl right. I’m just in time.”\n\u003cbr\u003e \n\u003cbr\u003e “Who was that?” said Ethel in some dismay.\n\u003cbr\u003e \n\u003cbr\u003e “Sounded something like ‘th’ ould scut,’” said I, for by that name our friend Casey had come to be known.\n\u003cbr\u003e \n\u003cbr\u003e It proved to be he, bare-footed and hatless, coming to us across the fields.\n\u003cbr\u003e \n\u003cbr\u003e “Good marnin’, ’tis a hell of a fine day.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, it is,” said I, “although your language is somewhat strong.”\n\u003cbr\u003e \n\u003cbr\u003e “No harrum intindid,” said he, looking at Ethel with a pleasant smile. “Ye can’t make an insult out of a hell or two a day like this. I t’harght that perhaps your woman would like some blue berries for breakfast th’ day, an’ I brarght them up. They’re picked this marnin’, an’ the dew is yit on them.” He held out an eight-quart pail filled to the top with tempting berries.\n\u003cbr\u003e \n\u003cbr\u003e “How much are they, Pat,” said I, putting my hand into my pocket.\n\u003cbr\u003e \n\u003cbr\u003e “Who’s insultin’ now?” said he, with a growling laugh. “I’ll sell no prisints this yair. ’Twas a hell of a bad ride ye had th’ other night, an’ I tould me ould woman I’d git square wid ye one way or another, an’ this is the way. They’re dam fine.”\n\u003cbr\u003e \n\u003cbr\u003e “They certainly are,” said Ethel, unconsciously seconding his oath.\n\u003cbr\u003e \n\u003cbr\u003e She went into the house to get a bowl to put them into and just then Ellery and Cherry came up.\n\u003cbr\u003e \n\u003cbr\u003e “The top of the marnin’ to ye,” said Pat, bowing to Cherry, as he had bowed to Ethel. “It’s easy to tell why it’s a fine day.”\n\u003cbr\u003e \n\u003cbr\u003e Cherry was unconscious enough to ask him why.\n\u003cbr\u003e \n\u003cbr\u003e “Sure, wid you out how could’t help ut.”\n\u003cbr\u003e \n\u003cbr\u003e “Now will you be good, Cherry?” said I.\n\u003cbr\u003e \n\u003cbr\u003e “You’ve kissed the blarney stone,” said she, with a lovely blush.\n\u003cbr\u003e \n\u003cbr\u003e “Sure I have, but I knew beauty before that.”\n\u003cbr\u003e \n\u003cbr\u003e His tone was not offensive nor did Cherry take offence. It was truth buttered with flattery and that’s as good as cake.\n\u003cbr\u003e \n\u003cbr\u003e Ethel now came out with the bowl, and the big “bloomy” berries, damp with dew, were poured into it.\n\u003cbr\u003e \n\u003cbr\u003e “It’s glad I am you’re up here,” said Pat, as he walked down the path. “Neighbours is neighbours, an’ phwin you’re passin’ an’ need restin’ it’s fine buttermilk me ould woman’ll give ye, an’ glad of the chance. Good marnin’ to yez.”\n\u003cbr\u003e \n\u003cbr\u003e “Good morning, Mr. Casey, and thank you very much for the berries. They’re the best I’ve seen,” said Ethel.\n\u003cbr\u003e \n\u003cbr\u003e “They’re dam fine, that’s a fact,” said he. “But none too good for the likes of youse.”\n\u003cbr\u003e \n\u003cbr\u003e We all went in to the griddle cakes, but before Minerva began to fry them we had heaping plates of blue berries and even as the burglar had been impressed by them so were Cherry and Ellery.\n\u003cbr\u003e \n\u003cbr\u003e “I thought,” said Ellery, “that your New Englander was always on the make.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, in the first place, Pat is not, strictly speaking, a New Englander,” said Ethel, “and in the second place, they’re not always on the make by any means, as we’ve often found out since we came here. Neighbourliness is never sold and there’s lots of neighbourliness here.”\n\u003cbr\u003e \n\u003cbr\u003e “The very fact that neighbourliness is not sold makes it the more necessary for country people to get a good price for the things they do sell,” said I, sententiously.\n\u003cbr\u003e \n\u003cbr\u003e “It’s a great place,” said Ellery, with enthusiasm. “I believe I will try tennis this morning,” he added, somewhat irrelevantly, although in justice to him it should be said that his eyes had rested on Cherry’s exuberant beauty before he said it.\n\u003cbr\u003e \n\u003cbr\u003e “I’m a good deal of a duffer at it. I imagine you play a strong game, Miss Paxton. Will you be my partner in a four-handed game?”\n\u003cbr\u003e \n\u003cbr\u003e “Dee-lighted,” said Cherry, showing her pretty teeth.\n\u003cbr\u003e \n\u003cbr\u003e “The writing of the epic is indefinitely postponed,” said Ethel. “You are all alike, you men.”\n\u003cbr\u003e \n\u003cbr\u003e “Wait till next winter, Mrs. Vernon,” said Ellery. “I’m going to make myself a storehouse of energy and I dare say Vernon’s doing the same thing.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, you’ll need some of it this morning,” said I. “At tennis Mrs. Vernon and I are the strongest up here.” He looked doubtful. “It’s a fact—we are introducing the game.”\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Sibthorp and I expect to make a pretty strong team,” said Cherry.\n\u003cbr\u003e \n\u003cbr\u003e Ethel’s eyes sought mine. And found them.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2056/58535.html","bookId":571,"creation":"Aug 2, 2019 5:07:18 AM","modification":"Aug 2, 2019 5:07:18 AM"}
