{"id":78167,"no":18,"title":"Page 18","content":"\u003cp\u003eI can’t take it anymore. I grab the condom and rip it open with my teeth. Kate rises up as I start to roll it on. Then she pushes my hands away. And she rolls it on for me.\u003c/p\u003e\n\u003cp\u003eSweet f**king Christ Almighty.\u003c/p\u003e\n\u003cp\u003eI pull at her lace panties. I want her bare, nothing in the way. With a rip and a snap, I tear them off. Her dark curls and shiny lips beckon me, and I swear to God I’ll give them all the attention they deserve later. But I can’t wait.\u003c/p\u003e\n\u003cp\u003eMy eyes are on hers…those dark chocolate eyes that pulled me in the moment I first saw them.\u003c/p\u003e\n\u003cp\u003eGorgeous.\u003c/p\u003e\n\u003cp\u003eSlowly, she sinks down on me. For a moment, neither of us moves. Or breathes. She’s tight…fuck…even through the rubber, I feel her walls stretching for me.\u003c/p\u003e\n\u003cp\u003eI whisper her name, like a prayer. “Kate.”\u003c/p\u003e\n\u003cp\u003eI take her face in my hands and bring her down to me. I can’t not kiss her. She rises up, pulling me almost completely out before smoothly sliding down, taking me back inside.\u003c/p\u003e\n\u003cp\u003eHoly God.\u003c/p\u003e\n\u003cp\u003eNothing has ever felt this good—nothing. My hands grasp her hips, helping her ride my c*ck with steady strokes. Our mouths are open against each other, kissing and panting.\u003c/p\u003e\n\u003cp\u003eI pull myself up to sit straighter, knowing the added pressure against her cl*t will make it better for her. And I’m not wrong. She comes down on me harder, faster, my hands digging into her hips. I kiss her neck and bend my head, licking my way to a hardened nipple. I take it in my mouth, sucking and rolling my tongue around, making her hand fist in my hair as she moans.\u003c/p\u003e\n\u003cp\u003eI’m not going to last. There’s no way. I’ve waited for this too long, wanted it too much. I brace my feet on the floor and start thrusting up, stabbing into her, pushing her h*ps down hard as I do. It’s bliss. Hard, deep, wet rapture, and I never want it to end.\u003c/p\u003e\n\u003cp\u003eShe throws her head back and moans louder. “Yes…yes…Drew.”\u003c/p\u003e\n\u003cp\u003eI’m cursing and calling her name, both of us almost mindless. Out of control. Because it feels that f**king good.\u003c/p\u003e\n\u003cp\u003eShe screams my name, and I know she’s coming.\u003c/p\u003e\n\u003cp\u003eGod, I love her voice.\u003c/p\u003e\n\u003cp\u003eAnd then she’s contracting all around me—her p**sy around my cock, her legs against my thighs, her hands on my shoulders—all clenching taut and stiff. And I’m right there with her.\u003c/p\u003e\n\u003cp\u003e“Kate, Kate…fuck…Kate.”\u003c/p\u003e\n\u003cp\u003eI thrust up again and again. Then I come long and hard. White-hot pleasure shoots through my body unlike anything I have ever felt before. My head falls against the back of the couch.\u003c/p\u003e\n\u003cp\u003eAfter the spasms die down, my arms come up around Kate, bringing our chests together and her head against my neck. I feel her heartbeat start to return to normal. And then she’s laughing, low and satisfied.\u003c/p\u003e\n\u003cp\u003e“God…that was so…so…”\u003c/p\u003e\n\u003cp\u003eNow I’m smiling too. “I know.”\u003c/p\u003e\n\u003cp\u003eEarth shattering. Off the Richter Scale. Powerful enough to take out a small island country.\u003c/p\u003e\n\u003cp\u003eI stroke my hand through her hair…so frigging soft. I lean down and kiss her again. So goddamn perfect.\u003c/p\u003e\n\u003cp\u003eWhat a great night. I think this could very well be the best night of my life. And it’s only just started.\u003c/p\u003e\n\u003cp\u003eKate squeals as I stand up and carry her, wrapped around me, to my bedroom.\u003c/p\u003e\n\u003cp\u003eI’ve never brought a woman to my bedroom before. It’s a rule. No random hook-ups in my apartment—never even considered it. If one of those girls actually knew where I lived? Can you say Stalker Psycho, anyone?\u003c/p\u003e\n\u003cp\u003eBut I don’t think twice about laying Kate down in the middle of my bed. She watches me, on her knees as I strip off my buttonless shirt and get rid of the used condom. Biting her lip with a smile, she peels off her own blouse that was still hanging on her arms. Oh yeah—and she’s still got her heels on.\u003c/p\u003e\n\u003cp\u003eNice. So very, very nice.\u003c/p\u003e\n\u003cp\u003eI crawl over to her and rest on my knees in the center of the bed. I cradle her face in my hands as I kiss her long and hot. I’m all set to go again. My dick pokes her in the stomach where it stands firm and ready. But this round, I want to take my time. I’ve admired her body for months—and now I plan to explore every f**king inch of it, up close and personal.\u003c/p\u003e\n\u003cp\u003eI lean forward and lay her back. Kate’s hair fans out behind her onto my pillows. She looks like some mythical imp, some fabled pagan sex deity from a Roman legend.\u003c/p\u003e\n\u003cp\u003eOr a well-acted porno.\u003c/p\u003e\n\u003cp\u003eHer knees fall open naturally, and I settle between them. Christ…she’s already damp. I can feel how wet she is against my stomach when she pushes up and rubs against me. Silently begging for it—again.\u003c/p\u003e\n\u003cp\u003eI kiss my way down her neck and collarbone, coming face to face with her pebbled br**sts. Kate’s hands knead my shoulder blades as I lick a circle around one dusky pink center. Her breathing’s fast and urgent. I flick my tongue over her nipple quickly until she groans my name.\u003c/p\u003e\n\u003cp\u003eThe minute the word leaves her lips, I close my mouth over her and suckle hard. For a few minutes, I alternate licking, sucking, and scraping her pointy little peak. Her reaction is so frigging primal, I can’t help but switch to the other tit and give that beauty the same attention.\u003c/p\u003e\n\u003cp\u003eBy the time I work my way lower, Kate is writhing under me, bucking and rubbing herself on any part of my body she can reach.\u003c/p\u003e\n\u003cp\u003eIt’s shameless.\u003c/p\u003e\n\u003cp\u003eBeautiful.\u003c/p\u003e\n\u003cp\u003eAnd as badly as I want her right now, as goddamn good as it feels to have her grinding against me—I’m in complete control of what I’m doing. I’m in charge. And there’s one thing I can’t wait to do. Something I’ve f**king dreamed of doing ever since that night at Howie’s. I lick a trail down the center of her stomach, then crawl lower. I slip her shoes off and lick another path up her inner thigh till I’m eye level with my target: her neat patch of dark curls.\u003c/p\u003e\n\u003cp\u003eKate is shaved short, trim, and the skin surrounding her snatch is as smooth as silk. I know because I’m nibbling my way around that manicured little triangle right now. Guys love a p**sy that’s almost completely bare. And no, it has nothing to do with perverted pre-pubescent fantasies. The idea that a woman is nearly bald there is just…naughty. Such a turn on.\u003c/p\u003e\n\u003cp\u003eI rub my nose into her tiny, coarse patch and inhale. Kate gasps and moans above me—eyes closed, mouth open.\u003c/p\u003e\n\u003cp\u003eJust so you know, men don’t expect a woman to smell like Winter Pine or Niagara Falls or whatever the f**k those feminine products say. It’s a p**sy—it’s supposed to smell like one. That’s the f**king turn on.\u003c/p\u003e\n\u003cp\u003eKate’s scent in particular has me salivating like a famished frigging animal. I rub again, kissing her plump outer lips. Mother of God.\u003c/p\u003e\n\u003cp\u003eHer hands clench the blanket.\u003c/p\u003e\n\u003cp\u003e“God, you smell so good, I want to eat you all night.”\u003c/p\u003e\n\u003cp\u003eAnd I just actually might.\u003c/p\u003e\n\u003cp\u003eI lick up her wet slit, and she arches off the bed with a moan. I push her h*ps down with my hands, holding her immobile as I do it again, and she cries out louder.\u003c/p\u003e\n\u003cp\u003e“That’s it, Kate—let me hear you.”\u003c/p\u003e\n\u003cp\u003eI’m well aware that this—that I—am the first man to ever do this to her. And yes, as a guy, that fact makes it even better.\u003c/p\u003e\n\u003cp\u003eYou know who Neil Armstrong is, don’t you?\u003c/p\u003e\n\u003cp\u003eNow tell me who the second guy was. Hell, tell me any other guy you know who made it to the moon after him. You can’t, can you? That’s why this is such a rush.\u003c/p\u003e\n\u003cp\u003eShe’ll never forget this.\u003c/p\u003e\n\u003cp\u003eShe’ll always remember…me.\u003c/p\u003e\n\u003cp\u003eMaybe that’s chauvinistic and egotistical, but it’s the truth.\u003c/p\u003e\n\u003cp\u003eUp and down, over and over, I lick her from end to end. Her cream is sweet and thick. Goddamn delicious. I push her thighs apart, spreading her wider, and push in and out of her—f**king her with my tongue. Her head rolls side to side as high-pitched moans echo from her throat. She’s incoherent, and her toes dig into my shoulders, but I don’t let up. No freaking way. In one motion, I suck Kate’s firm little cl*t into my mouth and slip two fingers inside her.\u003c/p\u003e\n\u003cp\u003eThen I’m the one moaning. Her hot juice coats my fingers, almost burning. I can’t stop my h*ps from rotating and rubbing against the bed. Fuck. Still pumping in and out with my hand, I flatten my tongue and rub steady, hard circles on her clit.\u003c/p\u003e\n\u003cp\u003e“Drew! Drew!”\u003c/p\u003e\n\u003cp\u003eHearing Kate scream charges me up even more. I move my fingers faster, in time with my tongue, and look up…needing to see her lose it. I’m going to come just watching her. The look on her face is full-blown ecstasy, and I don’t know which one of us is getting off more.\u003c/p\u003e\n\u003cp\u003e“Oh God, oh God, oh God…God!”\u003c/p\u003e\n\u003cp\u003eThen she’s rigid—stiff as a f**king board. Her hands pull my hair, her thighs tighten around my head, and I know she’s there.\u003c/p\u003e\n\u003cp\u003eAfter several moments she loosens her hold, and I slow my tongue to leisurely paced licks. When Kate relaxes her limbs even more, I sit up, wipe my face with my hand, and slide on a fresh condom.\u003c/p\u003e\n\u003cp\u003eOh yeah—I’m just getting started.\u003c/p\u003e\n\u003cp\u003eI lean over her, and she pulls me down and kisses me hard. She pants against my lips, “So…incredible.”\u003c/p\u003e\n\u003cp\u003eSmug, conceited satisfaction pumps through my veins, but I can’t even smile. I need to f**k her too goddamn much. I slide in easily. She’s slick but tight—like a wet fist. I feel her clench around me as I pull out slow and glide back in.\u003c/p\u003e\n\u003cp\u003eI start to thrust faster. Harsher. My arms are straight on either side of her head so I can watch the pleasure that flickers across her face. Her tits bounce every time I surge forward, and I almost lower down to suck on one.\u003c/p\u003e\n\u003cp\u003eBut then she opens her eyes and looks up at me. And I can’t look away. I feel like a king—like a f**king immortal. And any self-control I had just vanished. I push into her, fast and merciless. Pure heated pleasure swells in my stomach and down my thighs.\u003c/p\u003e\n\u003cp\u003eSweet Jesus.\u003c/p\u003e\n\u003cp\u003eOur bodies slap together over and over, hard and quick. I hook one arm under her knee and raise her leg up over my shoulder. She feels even tighter, and I can’t help but moan, “Kate…”\u003c/p\u003e\n\u003cp\u003e“Yes, like that. God, yes! Drew…” And then she goes stiff under me again, her eyes closing as a strangled moan leaks from her lips.\u003c/p\u003e\n\u003cp\u003eThat’s when I let go. I ram into her one last time before the most intense orgasm of my life rushes through me. I groan loud, flooding the condom inside her to the frigging brim. My arms collapse, and my full weight falls on her. She doesn’t seem to mind. The moment I’m down, she’s kissing me—my eyes, my cheeks, my mouth. I struggle to catch my breath, and then I’m kissing her back.\u003c/p\u003e\n\u003cp\u003eUn-f**king-believable.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eI READ AN ARTICLE ONCE that said hav**g s*x extends the human life span. At this rate, Kate and I are going to live forever. I’ve lost count of the number of times we’ve done it. It’s like a mosquito bite—the more you scratch, the more it itches.\u003c/p\u003e\n\u003cp\u003eI’m just glad I bought the extra-large box of condoms at Costco.\u003c/p\u003e\n\u003cp\u003eAnd in case you couldn’t tell from my reactions, I’ll just come out and say it: Kate Brooks is a fantastic lay. A spectacular piece of ass. If I wasn’t sure that Billy Warren was a complete dumbass fuckwit before—since I’d sampled what he threw away—now I’m completely certain of it.\u003c/p\u003e\n\u003cp\u003eShe’s adventurous, unapologetically demanding, spontaneous, and confident. A lot like me. We’re a perfect fit, in more ways than one.\u003c/p\u003e\n\u003cp\u003eWhen we finally come up for air, the night sky outside my window is just turning gray. Kate is lying quietly, her head on my chest, her fingers tracing its contours and occasionally stroking the dusting of hair there. \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-tangled-1/page-18.html","bookId":1849,"creation":"Oct 5, 2019 4:07:17 PM","modification":"Oct 5, 2019 4:07:17 PM"}
