{"id":78181,"no":32,"title":"Page 32","content":"\u003cp\u003eIf you put two pregnant hamsters in the same cage, you know what they’ll do? Eat each other. Female hormones are like undetonated warheads. There’s just no way to tell when they’re going to go the f**k off.\u003c/p\u003e\n\u003cp\u003e“Yes, I wanted Mackenzie to meet Kate. I didn’t want you meeting Kate until I was done smoothing things the hell over.”\u003c/p\u003e\n\u003cp\u003eMackenzie takes my friend the Bad Word Jar out of her backpack and holds it up. I put two dollars in.\u003c/p\u003e\n\u003cp\u003eShe sticks her face in the mouth of the jar and looks up at me with a frown. “Um…Uncle Drew? Bad words no cost one dollar no more. They cost ten.”\u003c/p\u003e\n\u003cp\u003e“Ten? Since when?”\u003c/p\u003e\n\u003cp\u003eShe’s excited. “It was Kate’s idea. She say the maconomy is bad.”\u003c/p\u003e\n\u003cp\u003eWhat the hell is the maconomy?\u003c/p\u003e\n\u003cp\u003e“She call it in…in…”\u003c/p\u003e\n\u003cp\u003e“Inflation.” Alexandra finishes with a smile.\u003c/p\u003e\n\u003cp\u003e“Yeah, that.”\u003c/p\u003e\n\u003cp\u003eInflation.\u003c/p\u003e\n\u003cp\u003eGreat.\u003c/p\u003e\n\u003cp\u003eThanks, Kate.\u003c/p\u003e\n\u003cp\u003eI raise my brows at Mackenzie. “Do you take American Express?” She giggles. I pay my fine in cash. “How about you add up the rest on your calculator, honey?”\u003c/p\u003e\n\u003cp\u003eShe’s going to need it. I have a feeling this little discussion is going to put me in the triple digits.\u003c/p\u003e\n\u003cp\u003e“What did you say to Kate?” I ask Alexandra.\u003c/p\u003e\n\u003cp\u003eShe shrugs. “We talked, one woman to another. I appealed to her business sense. It went well. You really don’t need to know all the details.”\u003c/p\u003e\n\u003cp\u003e“Why don’t you let me decide what I need to know. Considering you shouldn’t have f**king talked to her at all.”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap goes the calculator.\u003c/p\u003e\n\u003cp\u003e“Ungrateful much? I was just trying to help.”\u003c/p\u003e\n\u003cp\u003eDr. Kevorkian was just trying to help his patients too. And we all know how they turned out.\u003c/p\u003e\n\u003cp\u003e“I don’t need your help. I have a plan.”\u003c/p\u003e\n\u003cp\u003eAlexandra’s hands go to her hips. “Right. Your master plan that entails what, exactly? Annoying Kate until she agrees to go out with you? You gonna call her names on the playground too? Pull on her braids? I have to admit, Sister Beatrice was an interesting touch. I can’t believe Kate isn’t falling on her knees, begging you to take her back after that. Very romantic, Drew.”\u003c/p\u003e\n\u003cp\u003eMy jaw clenches. “It’s. Working.”\u003c/p\u003e\n\u003cp\u003eShe raises a brow. “That’s not what Kate said.”\u003c/p\u003e\n\u003cp\u003eAnd there she is. Take a good look.\u003c/p\u003e\n\u003cp\u003eThe Bitch in all her glory.\u003c/p\u003e\n\u003cp\u003eAnd you thought I was overreacting.\u003c/p\u003e\n\u003cp\u003e“Did she say something to you? About me? What did she say?”\u003c/p\u003e\n\u003cp\u003eShe waves her hand in the air. “Oh, this and that.”\u003c/p\u003e\n\u003cp\u003eYou know how some kids like to tease their dogs by showing them a bone and then yanking it away before they can bite it? My sister was one of those kids.\u003c/p\u003e\n\u003cp\u003e“Goddamnit, Lex.”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003e“I like her, by the way,” she says. “She really doesn’t take any shit does she?”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003e“How do you know she doesn’t take any shit?”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003e“Did you give her shit, Lex?”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003e“What kind of shit did you give her, Alexandra?”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003eShe laughs. “My God, would you relax. I haven’t seen you this wound up in…well, never. Now that you’re not pathetic and sad, it’s actually kind of fun.”\u003c/p\u003e\n\u003cp\u003eMy status with Kate at the moment is like a house of cards. I’ve managed to build myself up a few floors, but one small tremor and the whole damn thing falls apart.\u003c/p\u003e\n\u003cp\u003e“If you f**ked this up for me, I’ll—”\u003c/p\u003e\n\u003cp\u003eTap-tap-tap.\u003c/p\u003e\n\u003cp\u003e“You know stress causes premature gray hair. If you keep this up, you’re going to look like Daddy before you turn thirty.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you find this so amusing. I don’t. We’re talking about my frigging life here.”\u003c/p\u003e\n\u003cp\u003eThat sobers her up. Her head tilts to the side. Appraising me. And then her voice isn’t teasing anymore.\u003c/p\u003e\n\u003cp\u003eIt’s tender, sincere.\u003c/p\u003e\n\u003cp\u003e“I’m proud of you, you know. You’re sticking this out. Seeing it through. You’re…all grown up.” She smiles softly. “Never thought I’d see the day.” And then she hugs me. “It’ll be okay, Drew. Promise.”\u003c/p\u003e\n\u003cp\u003eWhen I was eight, my grandfather had a heart attack. After my parents left for the hospital, Alexandra promised me everything would be okay.\u003c/p\u003e\n\u003cp\u003eIt wasn’t.\u003c/p\u003e\n\u003cp\u003e“Did Kate tell you that?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “Not in so many words.”\u003c/p\u003e\n\u003cp\u003e“Then how do you know?”\u003c/p\u003e\n\u003cp\u003eShe shrugs again. “It’s the estrogen. It gives us ESP. If you had a vag**a, you’d know too.”\u003c/p\u003e\n\u003cp\u003eMackenzie raises her hand proudly. “I have a bagina.”\u003c/p\u003e\n\u003cp\u003eI smirk. “Yes, you do sweetheart. And someday, it’s gonna help you rule the world.”\u003c/p\u003e\n\u003cp\u003e“Johnny Fitzgerald has a penis. He say his penis is better than my bagina.”\u003c/p\u003e\n\u003cp\u003e“Johnny Fitzgerald’s an idiot. Vag**as beat penises every time. They’re like kryptonite. Penises are defenseless against them.”\u003c/p\u003e\n\u003cp\u003eMy sister puts an end to our discussion. “O-kay. That’s enough of that lovely conversation. Although I’m sure Mackenzie’s preschool teacher will enjoy hearing all about it. Right before she calls Child Protective Services on me.”\u003c/p\u003e\n\u003cp\u003eI put my hands up. “I’m just trying to tell her like it is. The sooner she realizes the power she has, the better off she’ll be.” I check my watch; I need to get upstairs. I look at Mackenzie. “What’s the damage, sweetie?”\u003c/p\u003e\n\u003cp\u003e“Eighty dollars.”\u003c/p\u003e\n\u003cp\u003eOuch.\u003c/p\u003e\n\u003cp\u003eI need to start billing my clients more. Or work out some kind of payment plan.\u003c/p\u003e\n\u003cp\u003eAs the bills fall into the jar, Alexandra takes her hand. “Come on Mackenzie, let’s go to the American Girl store and spend some of Uncle Drew’s money.”\u003c/p\u003e\n\u003cp\u003e“Okay!”\u003c/p\u003e\n\u003cp\u003eThey walk across the lobby but stop at the double doors. Mackenzie whispers something to Alexandra and hands over her balloons.\u003c/p\u003e\n\u003cp\u003eThen she runs back to me.\u003c/p\u003e\n\u003cp\u003eI scoop her up and hold her tight as her little arms come around my shoulders and squeeze.\u003c/p\u003e\n\u003cp\u003e“I love you, Uncle Drew.”\u003c/p\u003e\n\u003cp\u003eYou ever drink brandy? Usually I’m more of a whiskey man myself. But a good glass of brandy warms you all over, from the inside. And that’s me—right now.\u003c/p\u003e\n\u003cp\u003e“I love you too, Mackenzie.”\u003c/p\u003e\n\u003cp\u003eShe pulls back. “Guess what?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Kate ask me what I wanna be when I grown up.”\u003c/p\u003e\n\u003cp\u003eI nod. “And did you tell her you want to be a princess?”\u003c/p\u003e\n\u003cp\u003eHer forehead creases adorably, and she shakes her head. “I no wanna be a princess no more.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s a relief. What do you want to be?”\u003c/p\u003e\n\u003cp\u003eShe grins. “A banker.”\u003c/p\u003e\n\u003cp\u003e“Fantastic choice. What made you change your mind?”\u003c/p\u003e\n\u003cp\u003eHer fingers play with the collar of my shirt as she tells me, “Well, Kate is a immessment banker, and you say you be proud of me to be jus’ like her. So tha’s what I wanna be.”\u003c/p\u003e\n\u003cp\u003eAfter her words sink in, I ask her seriously, “Mackenzie? Did you tell Kate that I said I wanted you to grow up to be just like her?”\u003c/p\u003e\n\u003cp\u003eYou see that smile? That’s not the smile of a four-year-old child. That, ladies and gentlemen, is the smile of a genius.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eI close my eyes. And chuckle. I can’t believe I didn’t think of this myself. Mackenzie is the perfect weapon. My very own baby Borg. Resistance is futile.\u003c/p\u003e\n\u003cp\u003e“Sweetheart,” I say, “you did Uncle Drew a huge favor. Anything you want for Christmas—name it and it’s yours. And I mean anything.”\u003c/p\u003e\n\u003cp\u003eHer eyes widen at the possibilities. She glances at my sister and then whispers conspiratorially, “Can I have a pony?”\u003c/p\u003e\n\u003cp\u003eOh, boy.\u003c/p\u003e\n\u003cp\u003eI think about it for exactly one second.\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eShe squeezes me tighter and squeals.\u003c/p\u003e\n\u003cp\u003e“Only…don’t tell mommy until after it’s delivered, okay?”\u003c/p\u003e\n\u003cp\u003eI may have to enter the witness protection program after this one.\u003c/p\u003e\n\u003cp\u003eMackenzie kisses my cheek, and I set her on her feet. She skips back to Alexandra, and I wave as they walk out the door.\u003c/p\u003e\n\u003cp\u003eChapter 25\u003c/p\u003e\n\u003cp\u003eI WALK INTO KATE’S OFFICE like a soldier storming the beach at Normandy. She’s at her desk writing rapidly on a yellow legal pad.\u003c/p\u003e\n\u003cp\u003e“I’m back. Miss me?”\u003c/p\u003e\n\u003cp\u003eShe doesn’t look up. “Desperately.”\u003c/p\u003e\n\u003cp\u003eSarcasm is the oldest defense in the book. I play along. “I knew I was wearing you down. What put me over the top? Sister B?”\u003c/p\u003e\n\u003cp\u003eKate pushes back from her desk and crosses her legs. She’s wearing new shoes. I didn’t notice before. Black Mary Janes with a wicked high heel and a strap around the ankle. Good God. They’re the perfect blend of naughty and nice. Sweetness and sex. And my poor neglected c*ck convulses as I picture all the fantastic—and semi-illegal—things I could do to her in those shoes.\u003c/p\u003e\n\u003cp\u003eI’ve never had a fetish, but I’m thinking about starting one.\u003c/p\u003e\n\u003cp\u003eKate’s voice drags me away from my impure thoughts. “No. It was the visit from your sister, actually. Subtlety doesn’t run in your family does it?”\u003c/p\u003e\n\u003cp\u003eUh oh. I was afraid of this.\u003c/p\u003e\n\u003cp\u003e“Alexandra has deep-seated psychological issues. She’s unstable. You shouldn’t listen to anything she says. No one in my family does.”\u003c/p\u003e\n\u003cp\u003e“She seemed completely lucid when she was here.”\u003c/p\u003e\n\u003cp\u003eI shrug. “Mental illness is a tricky thing.”\u003c/p\u003e\n\u003cp\u003eHer eyes squint doubtfully. “You’re not serious are you?”\u003c/p\u003e\n\u003cp\u003eCrap. No lying.\u003c/p\u003e\n\u003cp\u003e“Technically, she’s never been diagnosed. But her ideas about justice and revenge are certifiable. Imagine Delores…with a decade more experience to perfect her technique.”\u003c/p\u003e\n\u003cp\u003eKate’s face goes slack with understanding. “Oh.”\u003c/p\u003e\n\u003cp\u003eYep—welcome to my world, sweetheart.\u003c/p\u003e\n\u003cp\u003e“She brought me coffee,” Kate says. “Should I drink it?”\u003c/p\u003e\n\u003cp\u003eWe both eye the Starbucks cup on her desk suspiciously.\u003c/p\u003e\n\u003cp\u003eWhen I was thirteen, I auctioned off a pair of Alexandra’s underwear in the boys’ locker room. Dirty ones. When she found out through the grapevine of older sisters, she played it cool—never let on that she knew. And then she spiked my Coco Pebbles with chocolate-flavored laxatives. I didn’t leave the bathroom for three days.\u003c/p\u003e\n\u003cp\u003eNow, I realize she’s not carrying that kind of grudge against Kate, but still…\u003c/p\u003e\n\u003cp\u003e“I wouldn’t.”\u003c/p\u003e\n\u003cp\u003eShe nods stiffly and slides the cup back away from her.\u003c/p\u003e\n\u003cp\u003e“What’d you think of Mackenzie? I really wanted to be here when you met her.”\u003c/p\u003e\n\u003cp\u003eHer smile is warm and genuine. “I think she’s amazing.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you’ll be thrilled to hear she used your calculator on me when I ran into them downstairs.”\u003c/p\u003e\n\u003cp\u003eHer smile widens. “That’s nice.”\u003c/p\u003e\n\u003cp\u003eI shake my head, and Kate says, “I see now why Alexandra started the Bad Word Jar, since you seem to spend so much time with Mackenzie.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “She talks like you. It’s not every day you hear a four-year-old say Prince Charming is a douchebag who’s only holding Cinderella back.” \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-tangled-1/page-32.html","bookId":1849,"creation":"Oct 5, 2019 4:07:17 PM","modification":"Oct 5, 2019 4:07:17 PM"}
