{"id":78184,"no":35,"title":"Page 35","content":"\u003cp\u003eMournful.\u003c/p\u003e\n\u003cp\u003e“But it doesn’t change anything.”\u003c/p\u003e\n\u003cp\u003eMy thumb sweeps back and forth across the bare skin of her neck. “Of course it does. It changes everything.”\u003c/p\u003e\n\u003cp\u003eShe raises her head. “I can’t do this with you, Drew.”\u003c/p\u003e\n\u003cp\u003e“Yes, you can.”\u003c/p\u003e\n\u003cp\u003eShe stares at my chest as she tries to explain. “I have goals. Aspirations. That I’ve worked hard for—sacrificed for.”\u003c/p\u003e\n\u003cp\u003e“And I want to watch you meet those goals, Kate. I want to help make your dreams come true. Every goddamn one.”\u003c/p\u003e\n\u003cp\u003eShe looks up. And her eyes are begging now—for understanding. For mercy.\u003c/p\u003e\n\u003cp\u003e“When Billy broke up with me, I was sad. It hurt. But I was able to keep going. I didn’t miss a beat. This thing with you…it’s different. It’s…more. And I’m not too proud to admit that if it doesn’t work out, I’m not going to be able to just pick myself up and move on. You can…You could break me, Drew.”\u003c/p\u003e\n\u003cp\u003e“But I won’t.”\u003c/p\u003e\n\u003cp\u003eMy hand moves to her cheek. And she leans into it.\u003c/p\u003e\n\u003cp\u003e“I know what it feels like to think I’ve lost you, Kate. And I don’t ever want to feel that way again. I’m a man who knows what he wants, remember? And I want you.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head slowly. “You want me tonight. But what about—”\u003c/p\u003e\n\u003cp\u003e“I want you tonight, and I’ll want you tomorrow and the next day. And ten thousand days after that. Didn’t you get the memo in the sky?”\u003c/p\u003e\n\u003cp\u003e“You might change your mind.”\u003c/p\u003e\n\u003cp\u003e“I might get struck by lightening. Or eaten by a shark. And both of those things are a hell of a lot more likely than a day ever coming when I won’t want you. Trust me.”\u003c/p\u003e\n\u003cp\u003eAnd I guess that’s the problem, isn’t it?\u003c/p\u003e\n\u003cp\u003eShe stares at me for several moments, then her gaze falls to the floor. The song ends. And she starts to pull away. “I’m sorry, Drew. I just…can’t.”\u003c/p\u003e\n\u003cp\u003eI try to hold on. Like a drowning man gripping a life preserver.\u003c/p\u003e\n\u003cp\u003e“Kate…”\u003c/p\u003e\n\u003cp\u003e“I should go.”\u003c/p\u003e\n\u003cp\u003eNo no no no no. I’m losing her.\u003c/p\u003e\n\u003cp\u003e“Don’t do this.”\u003c/p\u003e\n\u003cp\u003eHer eyes harden like molten lava when it cools to black rock. “Your time’s almost up. This was lovely. But…”\u003c/p\u003e\n\u003cp\u003eThis is not f**king happening. It’s like watching your receiver fumble the ball when you’re up by three with twenty seconds left on the clock. She turns toward the door. But I grab her arm and force her to look at me. My voice sounds desperate. Because I am.\u003c/p\u003e\n\u003cp\u003e“Just hold on. You can’t go yet. There’s one more thing I have to show you. Give me ten more minutes. Please, Kate.”\u003c/p\u003e\n\u003cp\u003eLook at her face. Right now.\u003c/p\u003e\n\u003cp\u003eShe wants to stay. No—she wants me to convince her to stay. To give her a reason to believe in me again. And if this doesn’t do it, nothing on God’s green earth ever will.\u003c/p\u003e\n\u003cp\u003e“Okay, Drew. Ten more minutes.”\u003c/p\u003e\n\u003cp\u003eThe breath rushes out of me. “Thank you.”\u003c/p\u003e\n\u003cp\u003eI let go of her arm, grab a black silk scarf off the chair and hold it up. “You can’t take this off until I tell you, okay?”\u003c/p\u003e\n\u003cp\u003eSuspicion washes over her face. “Is this some kind of weird sex thing?”\u003c/p\u003e\n\u003cp\u003eI chuckle. “No. But I like the way you think.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes to the ceiling right before I cover them with the scarf, and the world as she knows it fades to black.\u003c/p\u003e\n\u003cp\u003eChapter 27\u003c/p\u003e\n\u003cp\u003eEVERY NEW ASSOCIATE at Evans, Reinhart and Fisher gets to redecorate his or her office. We’re not the only firm with this kind of policy. It’s good business. Makes employees feel comfortable, like a piece of the company belongs to them. The choices of paint colors and furniture patterns aren’t unlimited—but at a firm like ours, the pallet is pretty vast. That’s how I got my inspiration. How I was able to figure out what Kate prefers.\u003c/p\u003e\n\u003cp\u003eShe’s not into florals, and I thank Christ for that. She likes stripes, paisleys, and earth tones. Why am I telling you this, you ask? What does it have to do with anything?\u003c/p\u003e\n\u003cp\u003eYou remember the Bat Cave, don’t you? My home office. My firstborn. My strictly dickly, men-only region? Well, it’s gotten a sex change. No, that’s not really accurate. It’s more of a hermaphrodite now.\u003c/p\u003e\n\u003cp\u003eWatch.\u003c/p\u003e\n\u003cp\u003eI turn the light on and bring Kate to the middle of the room. Then I untie the scarf.\u003c/p\u003e\n\u003cp\u003eHer eyes widen. “Oh, my…”\u003c/p\u003e\n\u003cp\u003eThe once burgundy walls are now a majestic blue. The English leather couches are history. In their place are two sofas, striped in warm tan and the same deep blue as the walls. My desk is shifted to the left—to make room for the lighter cherry one that sits next to it, side by side, like a bride and groom on their wedding day. The picture window behind them is framed with drapes in the same material as the sofas. And the poker table’s still in the corner. But now it’s got a stiff brown cover over it—to support the large, leafy plant that sits on top. I don’t usually do live plants. My thumb’s about as green as Morticia Adams’s. But the interior decorator said women were into them. Some shit about the nurturing instinct.\u003c/p\u003e\n\u003cp\u003ePretty amazing what you can accomplish in a short time when you’ve got an interior decorator with a team of workers at your disposal and money isn’t an issue, right? But curtains are a real bitch to hang. I did those myself—wanted to personally add a few touches. And I almost put the rod through the frigging window a dozen times before I got them straight.\u003c/p\u003e\n\u003cp\u003eI watch Kate’s face closely. But I can’t tell what she’s thinking. She’s blank. Stunned. Like an eyewitness to a double homicide.\u003c/p\u003e\n\u003cp\u003eI swallow hard. And start the most important pitch of my life:\u003c/p\u003e\n\u003cp\u003e“I watched The Notebook again.”\u003c/p\u003e\n\u003cp\u003eIt’s still so f**king gay.\u003c/p\u003e\n\u003cp\u003eHowever…\u003c/p\u003e\n\u003cp\u003e“I get it now. Why Noah put that art room together for Allie. It wasn’t because he was a vag**a; it was because he didn’t have a choice. She was it for him. No matter what he did, there was never gonna be anyone but her. So all he could do was set up the room and hope to God that one day she’d show up to use it. And that pretty much sums up exactly how I feel about you. So I did this—” I gesture around the room “—because I want you in my life, Kate. Permanently.”\u003c/p\u003e\n\u003cp\u003eHer eyes settle on me. And they’re shining with tears.\u003c/p\u003e\n\u003cp\u003e“I want you to move in here with me. I want to fall asleep with your hair in my face every night. And I want to wake up wrapped around you every morning. I want us to spend whole weekends without any clothes on at all. I want to have clean fights and dirty makeup sex.”\u003c/p\u003e\n\u003cp\u003eShe laughs at that one. And a single tear slips silently down her cheek.\u003c/p\u003e\n\u003cp\u003e“I want to talk to you until the sun comes up, and I want to bring you cereal in bed every Sunday. I want to work long, endless hours in this office, but only if you’re here next to me.”\u003c/p\u003e\n\u003cp\u003eHer voice is barely a whisper. “Like a partnership? Fifty-fifty split?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. Not fifty-fifty. You don’t get just half of me. You get all of me. A hundred percent.”\u003c/p\u003e\n\u003cp\u003eShe breathes deep. And bites her lip. And glances down at her desk. Then her face goes slack.\u003c/p\u003e\n\u003cp\u003e“Where did you get that?”\u003c/p\u003e\n\u003cp\u003eIt’s her parents’ wedding picture.\u003c/p\u003e\n\u003cp\u003e“I stole it from your office and had it copied while you were at lunch.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head slowly. And looks back up at me. In awe. “I can’t believe you did all this.”\u003c/p\u003e\n\u003cp\u003eI take a step forward. “I know you just got out of a relationship and I’ve never been in one. And I know I’m supposed to tell you that if you’re not ready, that it’s okay. That I’ll be patient and wait. But…if I say those things…I’ll be lying. Because…I’m just not a waiting kind of guy. I’m more of a take-the-bull-by-the-horns, keep-at-you-until-you-break-or-go-insane kind of guy.”\u003c/p\u003e\n\u003cp\u003eShe chuckles again.\u003c/p\u003e\n\u003cp\u003e“So if this isn’t enough, if you need something more—tell me. No matter what it is, I’ll do it. For you.”\u003c/p\u003e\n\u003cp\u003eWhen I’m done, she just stands there. Staring at me.\u003c/p\u003e\n\u003cp\u003eShe licks her lips and wipes her eyes. “I have some conditions.”\u003c/p\u003e\n\u003cp\u003eI nod cautiously.\u003c/p\u003e\n\u003cp\u003e“No lying. I mean it, Drew. When you tell me something, I have to know that it’s the truth. That you don’t have some ulterior motive.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“And no other women. I think I’m pretty adventurous in bed when it comes to you, but I’m monogamous. I don’t swing. I don’t do threesomes.”\u003c/p\u003e\n\u003cp\u003eNot a problem. My dick only has eyes for Kate.\u003c/p\u003e\n\u003cp\u003e“Me neither. Well, you know, not anymore. I mean…agreed.”\u003c/p\u003e\n\u003cp\u003eAnd then she smiles. And it’s blinding. Luminous.\u003c/p\u003e\n\u003cp\u003eFucking incandescent.\u003c/p\u003e\n\u003cp\u003eAnd she steps toward me. “Well, Mr. Evans…it looks like you’ve got yourself a merger.”\u003c/p\u003e\n\u003cp\u003eAnd that’s all I need to hear.\u003c/p\u003e\n\u003cp\u003eI move like a spring that’s been cocked too tight for too long. And before Kate can take a breath, I’ve got her crushed against me—holding her, lifting her right off her feet.\u003c/p\u003e\n\u003cp\u003eOur mouths snap together like two magnets. She grips my shirt. And my tongue slides into her welcoming mouth.\u003c/p\u003e\n\u003cp\u003eJesus. The taste of her—my memory was unforgivably inadequate. I feel like a recovering crack addict who just fell off the wagon and never wants to climb back on.\u003c/p\u003e\n\u003cp\u003eOur hands grope at each other. It’s explosive. Combustible.\u003c/p\u003e\n\u003cp\u003eBurn, baby, burn.\u003c/p\u003e\n\u003cp\u003eI drag my lips across her jaw. She tilts her head to give me more room, and I attack her neck. She’s panting. We both are. My hands are in her hair, holding her hostage. And her hands are on my chest skimming my ribs and waist. I have no f**king clue how she got my shirt opened. I’m just glad she did. My fingers whisper down her back to the hem of her dress. Then I slide them under it, cupping her smooth, firm ass.\u003c/p\u003e\n\u003cp\u003eShe must be wearing a thong.\u003c/p\u003e\n\u003cp\u003eI massage and squeeze, pressing our h*ps together. Kate’s mouth replaces her hands, moving across my chest and lower. And I start to really f**king lose it. I grab the back of her dress in both hands and pull—ripping it almost in two. Kind of like the Incredible Hulk.\u003c/p\u003e\n\u003cp\u003e“I’ll buy you a new one, I swear.”\u003c/p\u003e\n\u003cp\u003eIt falls to her waist. And our bare chests crash together.\u003c/p\u003e\n\u003cp\u003eFuck me. I missed this. How in Christ did I ever go an hour—let alone days—without feeling her against me like this? Too f**king long.\u003c/p\u003e\n\u003cp\u003e“God, Drew.”\u003c/p\u003e\n\u003cp\u003eHer hands are across my back now. Scratching and kneading. My mouth is at her ear, demanding, “Whatever underwear you’ve got on? I’m keeping them.” I drop to my knees, scorching a path between her br**sts and down her stomach.\u003c/p\u003e\n\u003cp\u003eKate gasps. “That could be a problem.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eI drag her dress down to the floor. And then I stare—mesmerized—at Kate’s bare snatch.\u003c/p\u003e\n\u003cp\u003e“Because I’m not wearing any.”\u003c/p\u003e\n\u003cp\u003eMy c*ck moans in agony. And then I look up at her. “You always go commando to business meetings with friends?”\u003c/p\u003e\n\u003cp\u003eShe smiles shyly. “I guess I was hoping you’d change my mind about that.”\u003c/p\u003e\n\u003cp\u003eFor a second, I’m stunned. She wanted this. Just as badly as I did. And I wasted all that time eating chicken Marsala—when I could have been eating her. \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-tangled-1/page-35.html","bookId":1849,"creation":"Oct 5, 2019 4:07:17 PM","modification":"Oct 5, 2019 4:07:17 PM"}
