{"id":78185,"no":36,"title":"Page 36","content":"\u003cp\u003eGod.\u003c/p\u003e\n\u003cp\u003eDamn.\u003c/p\u003e\n\u003cp\u003eWithout another word, I dive in. Like a toddler getting his first luscious taste of birthday cake. I sink my face—my tongue—into her p**sy. She tastes warm and silky like the liquid sugar on top of a cinnamon bun, but sweeter.\u003c/p\u003e\n\u003cp\u003eKate’s knees buckle, but I brace my hands at the small of her back and slide her legs over my shoulder. And then I lay back on the floor so she’s straddling my face.\u003c/p\u003e\n\u003cp\u003eLike I’ve dreamed of every damn night.\u003c/p\u003e\n\u003cp\u003eShe writhes and gasps above me. Unabashedly. And I devour her in a starving frenzy. Her whimpers get higher. Louder. Her hand reaches back. And she strokes my c*ck over my pants.\u003c/p\u003e\n\u003cp\u003eYou ever heard of a two-pump chump? Well, if she doesn’t stop touching me real frigging quickly, you’re going to get a bird’s-eye view of one.\u003c/p\u003e\n\u003cp\u003eI grab her hand and lock our fingers together. Kate uses them for leverage as she rotates her hips, rubbing her gorgeous cunt against my mouth. She moves once, twice…and then she’s coming. Screaming my name brokenly.\u003c/p\u003e\n\u003cp\u003eShe breathes deep as she comes back down. Then she slides sinuously over my body till our mouths line up. And we’re kissing. It’s savage and rough—all tongue and teeth. My hands push through her hair, pulling it loose. Her h*ps grind against my dick, and her wetness soaks through my pants.\u003c/p\u003e\n\u003cp\u003e“Fuck, Kate. I’m going to come so f**king hard.”\u003c/p\u003e\n\u003cp\u003eI just hope I’m actually inside her when I do.\u003c/p\u003e\n\u003cp\u003eShe swirls her tongue around my nipple before she tells me, “Pants, Drew. Off.”\u003c/p\u003e\n\u003cp\u003eMy h*ps bow off the floor as I tear at the button on my pants. I manage to push them and my boxers down to my knees, but I’m too out of my mind to get them off completely.\u003c/p\u003e\n\u003cp\u003eI grab her h*ps and bring them lower. And my c*ck slides effortlessly inside her.\u003c/p\u003e\n\u003cp\u003eChrist Almighty.\u003c/p\u003e\n\u003cp\u003eWe freeze—our faces just millimeters apart—our breaths harsh and entwined. My eyes hold hers. And then she moves. Slowly. Drawing me almost completely out—before surging back down. My head falls back, and my lids close.\u003c/p\u003e\n\u003cp\u003eIt’s perfect. Divine.\u003c/p\u003e\n\u003cp\u003eMy hands are splayed across her hips. Helping her. Gripping hard enough to bruise. And then she sits up, arching her back till her hair brushes my knees. I force my eyes open, needing to see her. Her head’s back, her br**sts are high, and her lips are open as euphoric moans and nonsensical words slip out.\u003c/p\u003e\n\u003cp\u003eYou know how sometimes you read about nak*d pictures of some moron’s wife getting leaked onto the Internet? I never got that.\u003c/p\u003e\n\u003cp\u003eBut now I do. Because if I had a camera? I’d be snapping that shutter like the freaking paparazzi. To capture this moment. To remember how Kate looks right now. Because she’s just that magnificent. More stunning than any masterpiece in the Louvre—more breathtaking than all the Seven Wonders combined.\u003c/p\u003e\n\u003cp\u003eShe moves faster, harder. And I feel the pressure building low in my gut.\u003c/p\u003e\n\u003cp\u003e“Yeah, Kate. Ride me…just like that.”\u003c/p\u003e\n\u003cp\u003eHer tits bounce with each thrust. Hypnotically. And I just can’t resist a taste. I sit up and cover one tip with my mouth, laving and flicking her pointy little peak with my tongue. She screams as her legs wrap around my back—pulling me tighter—rubbing her cl*t along my happy trail.\u003c/p\u003e\n\u003cp\u003eShe’s close. We’re f**king close. But I don’t want it end. Not yet.\u003c/p\u003e\n\u003cp\u003eSo I roll her under me, cradling the back of her head in my hands, protecting it from the wood floor, as I lay on top of her. Kate’s welcoming thighs open wide, and I push even deeper inside her.\u003c/p\u003e\n\u003cp\u003e“Oh God…oh God…”\u003c/p\u003e\n\u003cp\u003eThe sound of our bodies slapping and her breathy voice fills the room like an erotic symphony. The New York Philharmonic’s got nothing on us.\u003c/p\u003e\n\u003cp\u003e“God! Oh God!”\u003c/p\u003e\n\u003cp\u003eI smile as I pick up the pace, “God’s not the one f**king you, baby.”\u003c/p\u003e\n\u003cp\u003eSure, I’m in love, but this is still me here.\u003c/p\u003e\n\u003cp\u003e“Drew…Drew…yes…Drew!”\u003c/p\u003e\n\u003cp\u003eMuch better.\u003c/p\u003e\n\u003cp\u003eYou didn’t think I was going to start spewing sickeningly sweet, asswipe-like phrases, now did you? Sorry to disappoint.\u003c/p\u003e\n\u003cp\u003eBesides, I like the word fuck. It implies a certain level of heat. Passion. And it’s specific. If Congress had asked Bill Clinton if he f**ked Monica Lewinski, there wouldn’t have been any question about just what the hell they were talking about, now would there?\u003c/p\u003e\n\u003cp\u003eIt doesn’t much matter what you say when you’re screwing anyway. Or how you do it. Slow and gentle or fast and violent—it’s the feelings behind it that make it mean something. That make it mean everything.\u003c/p\u003e\n\u003cp\u003eChrist, am I enlightened or what? Aren’t you proud of me? You should be.\u003c/p\u003e\n\u003cp\u003eI bend my arms and cover her mouth in a devouring, harsh kiss. Then I lick my way to her shoulder and, caught up in the moment, bite down. Not hard enough to break the skin but with just enough pressure to send Kate flying over the f**king edge again.\u003c/p\u003e\n\u003cp\u003eI straighten my arms so I can watch her. She bucks up one more time before she goes stiff and tight beneath me. Her perfectly painted toes curl in the air as she comes. Her muscles squeeze me hard from base to tip, like desperate hands milking a tube of toothpaste from the bottom up, wringing out every last drop.\u003c/p\u003e\n\u003cp\u003eMy head rolls back and my eyes close as I grunt and curse. And I’m helpless—like a grain of sand in the grip of a tsunami. Pleasure pounds out of every pore in my body as I come with the force of a frigging geyser.\u003c/p\u003e\n\u003cp\u003eIncredible.\u003c/p\u003e\n\u003cp\u003eWe ride out the wave of ecstasy together until we’re both gulping for air. And then I collapse on top of her. My cheek lies in the valley between her br**sts, my stomach between her thighs. And few seconds later, Kate’s hands come up my back before sliding down my spine in the most soothing f**king way.\u003c/p\u003e\n\u003cp\u003eI cup her face with my hands and kiss her. Slowly this time. Languidly. Her doe eyes stare into mine. But neither of us speaks. We don’t need to.\u003c/p\u003e\n\u003cp\u003eAnd then I feel it.\u003c/p\u003e\n\u003cp\u003eHave you ever seen a racehorse after it’s been sidelined for a while? I have. When they get back on the track, it’s like fire’s been shot into their veins. They can just run and run—countless laps—miles at a time.\u003c/p\u003e\n\u003cp\u003eYou see where I’m going with this?\u003c/p\u003e\n\u003cp\u003eI flip us over so Kate’s once again on top, her knees straddling my hips, her head against my chest. We really should move this to the bed—the floor’s damn hard. But, then again, so am I. And that takes precedence.\u003c/p\u003e\n\u003cp\u003eKate lifts her head and her eyes widen. “Already?”\u003c/p\u003e\n\u003cp\u003eI raise my brows. “We’ve missed a lot of quality time lately. Apparently my dick would like to make up for every second of it. You game?”\u003c/p\u003e\n\u003cp\u003eI rotate my hips, and she moans just a little.\u003c/p\u003e\n\u003cp\u003eI’ll take that as a yes.\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eWE MADE IT TO THE BED. EVENTUALLY.\u003c/p\u003e\n\u003cp\u003eA few hours and three orgasms later, we’re laying side by side facing each other. Sharing a pillow. The pillow.\u003c/p\u003e\n\u003cp\u003e“Say it again.”\u003c/p\u003e\n\u003cp\u003eIt’s the tenth time she’s asked me. But I don’t mind. I’ll say it till I’m blue in the face if she wants me to.\u003c/p\u003e\n\u003cp\u003e“I love you, Kate.”\u003c/p\u003e\n\u003cp\u003eShe sighs. It sounds content. “I’m going to be really clingy and needy for the next few weeks. You should be prepared.”\u003c/p\u003e\n\u003cp\u003e“I’ll be insecure and jealous. It’ll work out great.”\u003c/p\u003e\n\u003cp\u003eThere’s a smile in her voice. “You told me you don’t get jealous.”\u003c/p\u003e\n\u003cp\u003eI shrug. “I also told you I wasn’t going to lie to you ever again.”\u003c/p\u003e\n\u003cp\u003eHer hands comb through the back of my hair gently. “When did you know?”\u003c/p\u003e\n\u003cp\u003eI smile. “The first time you let me come inside you without a rubber.”\u003c/p\u003e\n\u003cp\u003eShe yanks my hair. Hard.\u003c/p\u003e\n\u003cp\u003e“Ow! Jesus!”\u003c/p\u003e\n\u003cp\u003eHer voice is exasperated, like a mother who just caught her kid snagging an off-limits cookie for the tenth time.\u003c/p\u003e\n\u003cp\u003e“Drew. That doesn’t sound very romantic.”\u003c/p\u003e\n\u003cp\u003e“You don’t think so?”\u003c/p\u003e\n\u003cp\u003eI find the strength to lift my head, and then I lower it down over her already hardened nipple. I suck at it, tease it with my teeth, before slowly letting it go with a pop.\u003c/p\u003e\n\u003cp\u003e“Because I happen to think coming inside you is very, very romantic.”\u003c/p\u003e\n\u003cp\u003eAs I start to give the other beauty the same treatment, she gasps. “That’s a good point.”\u003c/p\u003e\n\u003cp\u003eI chuckle. “They all are, sweetheart.”\u003c/p\u003e\n\u003cp\u003eLaying my head back down, I drag my fingertip up her arm, fascinated by the goose bumps that rise up as I go.\u003c/p\u003e\n\u003cp\u003e“Aren’t you going to ask me when I knew?” she asks.\u003c/p\u003e\n\u003cp\u003e“When you knew what?”\u003c/p\u003e\n\u003cp\u003eKate rolls onto her stomach. And her hair swings over her shoulder, reaching the skin on my ribs. Tickling it like a feather. It’s arousing. Sensual. And just like that, I’m ready to go again.\u003c/p\u003e\n\u003cp\u003eEdward Cullen can take his stupid her**n and OD on it. Kate is my own personal brand of Viagra.\u003c/p\u003e\n\u003cp\u003e“When I knew I was in love with you.”\u003c/p\u003e\n\u003cp\u003eHave you noticed that Kate hasn’t returned any of my “I love you”s? I certainly have. But like I said—I try not to put much faith in words. Actions tell you more. And every move Kate makes tells me that we’re on the same page.\u003c/p\u003e\n\u003cp\u003eStill, I’m kind of curious.\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003eShe leans forward and kisses my eyes…my cheeks…and then the tip of my nose before planting a sweet one on my lips. Then she leans back. “Do you remember that day in my office? After Billy and I broke up, and I was crying?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“I should have been devastated—I was—for a little while. But then you came in, and you put your arms around me. And I never wanted you to let go. It was like everything I’d always needed, anything I’d ever wanted, was right there in front of me. And that’s when I knew. That, somehow, you’d sucked me in, and I was totally in love with you.” She laughs softly. “I was so scared…”\u003c/p\u003e\n\u003cp\u003eI bet.\u003c/p\u003e\n\u003cp\u003e“…because I never in a million years thought you’d feel the same way.”\u003c/p\u003e\n\u003cp\u003eI brush my thumb across her beautiful bottom lip. “I already did, Kate. I just didn’t know it.”\u003c/p\u003e\n\u003cp\u003eShe smiles and lays her head back down on the pillow. Her voice is soft and sincere.\u003c/p\u003e\n\u003cp\u003e“Yeah. You can be a real dumbass sometimes.”\u003c/p\u003e\n\u003cp\u003eWas that what you thought she was going to say? Me neither.\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003eShe cocks a brow smugly. “I’m just saying, if you look at our history—”\u003c/p\u003e\n\u003cp\u003eBefore she can finish, I’ve got her pinned under me, her back to my chest. “Those are fighting words Kate.” My fingers travel down her ribs slowly. Torturously. She starts to squirm, and her ass rubs against my cock.\u003c/p\u003e\n\u003cp\u003eIt’s nice.\u003c/p\u003e\n\u003cp\u003e“Take it back.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eMy fingers move light and fast over her. Tickling her without mercy.\u003c/p\u003e\n\u003cp\u003e“Say, ‘Drew Evans is a god. A brilliant, genius god.’”\u003c/p\u003e\n\u003cp\u003eShe bucks and shrieks, “Drew! Stop! Stop!”\u003c/p\u003e\n\u003cp\u003eI don’t let up. “Ask me nicely and maybe I will. Beg me for it.”\u003c/p\u003e\n\u003cp\u003eShe laughs even while she’s screaming. “Never!”\u003c/p\u003e\n\u003cp\u003eYou know what they say about never, don’t you?\u003c/p\u003e\n\u003cp\u003eOh yeah—this is going to be fun.\u003c/p\u003e\n\u003cp\u003eShe begged.\u003c/p\u003e\n\u003cp\u003eDid you have any doubt? Then she got on top of me, and I was the one begging.\u003c/p\u003e\n\u003cp\u003eNow I’m lying with my head at Kate’s feet, massaging them. Her head’s on my thigh. Want to know how we ended up in this position? Nah—I’ll let you use your imagination. \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-tangled-1/page-36.html","bookId":1849,"creation":"Oct 5, 2019 4:07:17 PM","modification":"Oct 5, 2019 4:07:17 PM"}
