{"id":78186,"no":37,"title":"Page 37","content":"\u003cp\u003e“So, what did Alexandra say to you?” I ask her.\u003c/p\u003e\n\u003cp\u003e“Mmm?”\u003c/p\u003e\n\u003cp\u003eI bend my elbow and rest my head on my hand so I can see Kate’s face. She looks completely exhausted. Worn out. Un-gently used. It’s a really good look for her.\u003c/p\u003e\n\u003cp\u003e“The other day, in your office, before you agreed to go out with me. You seemed different. More…receptive. Did she threaten you?”\u003c/p\u003e\n\u003cp\u003eShe chuckles drowsily and cracks her eyes open. “No, no threats. She told me to think like the professional woman I am. To look at you like a business venture. That every investment has risks, but I have to weigh them against the payoff. She said based on your most recent performance, you’re a risk worth taking.”\u003c/p\u003e\n\u003cp\u003eGood strategy. I should have thought of that.\u003c/p\u003e\n\u003cp\u003e“I should send her flowers.”\u003c/p\u003e\n\u003cp\u003eHer hand rubs my thigh. “But that’s not what convinced me to give you another chance.”\u003c/p\u003e\n\u003cp\u003eMy brow wrinkles. “No?”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Then what did?”\u003c/p\u003e\n\u003cp\u003eShe swings around till her head’s on my chest, and there’s not a breath of space between us.\u003c/p\u003e\n\u003cp\u003e“Mackenzie.”\u003c/p\u003e\n\u003cp\u003e“How’d she pull it off?”\u003c/p\u003e\n\u003cp\u003e“She told me a story about how you took her to Central Park last summer. And a boy threw sand at her.”\u003c/p\u003e\n\u003cp\u003eI remember that day. I was just about to offer a six-year-old fifty bucks to dropkick the little f**ker.\u003c/p\u003e\n\u003cp\u003e“And then he came up to her and said he was sorry. But she wasn’t sure if she wanted to play with him again. And she said that you told her that sometimes boys are stupid. And a lot of times they do stupid things. So, once in a while, she should take pity on them. And if they say they’re sorry, she should give them a second chance. Not a third or a fourth…but you told her that everyone deserves a second chance.” She pauses. And laughs. “And then you told her if he did it again she should kick him in the balls.”\u003c/p\u003e\n\u003cp\u003eAll girls should know how to defend themselves. A well-aimed kick will do it every time.\u003c/p\u003e\n\u003cp\u003eIt’s kind of amazing, don’t you think? If it wasn’t for my perfect niece, we might not be here right now.\u003c/p\u003e\n\u003cp\u003e“Maybe I should buy her two ponies.”\u003c/p\u003e\n\u003cp\u003eKate smiles. And her eyes gaze up at me in that way I now crave. Like I mean everything to her.\u003c/p\u003e\n\u003cp\u003e“You have no sense of self-preservation, do you?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No, not at the moment. I’m too focused on…fornication.”\u003c/p\u003e\n\u003cp\u003eShe brings her knee up around my hip. “I’m going to make you so happy, Drew Evans.”\u003c/p\u003e\n\u003cp\u003eMy arms tighten around her. “You already have. After this? Heaven’s going to be a major disappointment.”\u003c/p\u003e\n\u003cp\u003eI dip my head and kiss her. It’s wet and slow and wonderful. And she’s kissing me back. Like she never wants to stop. And you know something?\u003c/p\u003e\n\u003cp\u003eThat works really well for me.\u003c/p\u003e\n\u003cp\u003eSo there you go. Thanks for coming along for the ride. But you really should leave now. No more living vicariously through my sex life. Because, remember when I said all guys talk to their friends about sex?\u003c/p\u003e\n\u003cp\u003eWell, we do.\u003c/p\u003e\n\u003cp\u003eBut no guy talks to his friends about sex with his girlfriend. Ever.\u003c/p\u003e\n\u003cp\u003eYou really think I want somebody jerking off to what Kate lets me do to her? Or what she does to me? No f**king way.\u003c/p\u003e\n\u003cp\u003eSo this is where you get off. Not in the fantastic way I’m about to, of course, but that’s just too bad for you.\u003c/p\u003e\n\u003cp\u003eStill…after all the pointers I’ve given you, I feel like I owe you some final words of wisdom. A lesson. Something meaningful. So here we go:\u003c/p\u003e\n\u003cp\u003eAssume nothing. Even if you think you know everything. Even if you’re sure that you’re right. Get confirmation. That whole “ass” cliché about assuming? It’s right on the money. And if you’re not careful, it could end up costing you the best thing that’s ever going to happen to you.\u003c/p\u003e\n\u003cp\u003eAnd another thing—don’t get too comfortable. Take chances. Don’t be afraid to lay it on the line. Even if you’re happy. Even if you think life is freaking perfect.\u003c/p\u003e\n\u003cp\u003eBecause I had a life once. A life I loved. It was consistent. Fun.\u003c/p\u003e\n\u003cp\u003eIt was reliable. Safe.\u003c/p\u003e\n\u003cp\u003eAnd then one night, a beautiful dark-haired girl came along and blew it all to kingdom come. Now my life is a mess. In a good way. A giant unpredictable web of screw-ups and make-ups. Frustration and tenderness. Annoyance and affection. Lust and love.\u003c/p\u003e\n\u003cp\u003eBut that’s okay. Because as long as Kate Brooks is tangled up in that web with me?\u003c/p\u003e\n\u003cp\u003eWell, I can’t imagine anything f**king better than that.\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/tangled-tangled-1/page-37.html","bookId":1849,"creation":"Oct 5, 2019 4:07:17 PM","modification":"Oct 5, 2019 4:07:17 PM"}
