{"id":81118,"no":10,"title":"Page 10","content":"\u003cp\u003eCOMMENTS, DESCRIPTION OF REPORTED MISDEMANDOR\u003c/p\u003e\n\u003cp\u003e- 29-087:\u003c/p\u003e\n\u003cp\u003eTwo of the twelve faux gems that are an integral part of the \"clock-lock\" at the ornamental main gate of the municipal complex have been removed, between (approximately) 2100 hours yesterday (September 24) and 0500 hours this morn-ing. With many local businesses boarded up at this time, loot-ers have been defacing town property and attempting to take what they believe to be valuable. This officer believes that the perp thought the gems were real, and stopped after removing two (one blue, one green) when he/she realized they were only glass. This gate (aka \"City Hall\" gate) is only one of several en-trances/exits that lead to the municipal complex. The gate is now locked due to its complicated (and in this officer\u0027s opin-ion, ridiculous) design, which requires that all gems be pres-ent for the gate to be unlocked. Until the City Parks Depart-ment removes the gate, or until the two gems can be recov-ered and reinstalled, this entrance/exit will remain locked. Due to the lack of available manpower at this time, there is no choice but to suspend the investigation of this case. reporting officer Marvin Branagh\u003c/p\u003e\n\u003cp\u003eAdditional comments, case 29-087, M. Branagh Sept. 26\u003c/p\u003e\n\u003cp\u003eOne of the missing gems (blue) has turned up inside the RPD building. It\u0027s 2000 hours. Bill Hansen, de-ceased owner of the restaurant Grill 13, was apparently carry-ing the fake gem when he came here seeking shelter earlier this evening. Mr. Hansen died shortly after arriving, killed by police fire after succumbing to the effects of the cannibal dis-ease. The gem was found on his person, though I\u0027m this officer has no way of knowing if he stole it or where the other gem might be. With the city now under martial law, no effort will be made to find the second gem or to put this one back\u0026nbsp;\u0026nbsp;- but with sev-eral of the streets surrounding the municipal complex now impassable, the need for these gems may at some point be-come relevant. On a personal note: this will be my last written report until the current crisis has passed. Paperwork doesn\u0027t seem\u0026nbsp;\u0026nbsp;- at this time, the need to document misdemeanors seems sec-ondary to the enforcement of martial law, nor do I believe my-self to be alone in this assessment. Marvin Branagh, RPD Jill put the typed report and handwritten addendum back into the evidence drawer, sadly wondering if Mar-vin was still alive; it seemed unlikely, which was a thoroughly depressing thought. He was one of the best officers in the RPD, always nice as hell without sacri-ficing a professional demeanor.\u003c/p\u003e\n\u003cp\u003eRight up to the end, a real pro. Goddamm Um-brella.\u003c/p\u003e\n\u003cp\u003eShe reached into the drawer and took out the dia-mond-shaped piece of blue glass, gazing at it thought-fully. The rest of the evidence room had been a bust, the locked cabinets and drawers yielding nothing useful as far as weapons went; obviously, she wasn\u0027t the only one who\u0027d thought to check it for guns and ammo. The gem, on the other hand... Marvin was right about the streets being blocked all around the City Hall gate; she\u0027d tried to get through the area once already and had found most of it barricaded. Not that there was much over there\u0026nbsp;\u0026nbsp;- the gate opened into a small garden with paved walkways, really a showcase for a rather boring statue of ex-mayor Michael Warren. Past that was City Hall, not used for much since the new courthouse had been built uptown, and a couple of paths that led north and west, respec-tively\u0026nbsp;\u0026nbsp;- an auto shop and a few used-car lots if you veered north, and to the west...\u003c/p\u003e\n\u003cp\u003e\"Oh, shit, the trolley!\"\u003c/p\u003e\n\u003cp\u003eWhy hadn\u0027t she thought of it before? Jill felt a rush of excitement, hampered only slightly by the urge to slap her forehead. She\u0027d totally forgotten about it. The old-fashioned two-car train\u0027s scenic route was a tourist thing, the city only ran it summers anymore, but it went all the way out to the westernmost suburbs, past City Park and through a few of the more expensive neigh-borhoods. There was an allegedly abandoned Umbrella facility out that way, too, where there might still be working cars and clear roads. Assuming it was in run-ning condition, the trolley would be the easiest way out of the city, hands down.\u003c/p\u003e\n\u003cp\u003eExcept with all the blockades, the only way to get to it is through that locked gate\u0026nbsp;\u0026nbsp;- and I\u0027ve only got one of the jewels.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t have the equipment to take the heavy, over-sized gate down by herself... but Marvin\u0027s report said that Bill Hansen had had the blue gem, and his restau-rant was only three or four blocks away. There was no reason to assume he\u0027d had the green one at some point, too, or that it was at the Grill, but it\u0027d be worth checking out. If it wasn\u0027t there, she was no worse off\u0026nbsp;\u0026nbsp;- but if she could find it, she might be able to get out of the city much sooner than she\u0027d expected. With the Nemesis running around out there, it couldn\u0027t be soon enough. So, it was decided. Jill turned and walked toward the hall door, slipping the blue gem into her fanny pack. She wanted to check out the RPD\u0027s darkroom before she left, see if she could find one of the photog-rapher\u0027s vests laying around; she didn\u0027t have any speed loaders for the Colt, and she wanted a few pockets to carry the loose rounds. While she was at it, she thought she might as well leave the shotgun behind. She\u0027d rigged up an over-the-shoulder strap using a belt she\u0027d taken off a dead man, so carrying it wasn\u0027t too bad, but without shells\u0026nbsp;\u0026nbsp;- and with the.357 as addi-tional firepower\u0026nbsp;\u0026nbsp;- she didn\u0027t see the point in lugging it around anymore... She stepped into the hall and took a left, deliberately not looking at the one slumped body beneath the win-dows that faced south. It was a young woman carrier she\u0027d shot at from the stairs to the second floor, just around the corner, and she was pretty sure that she\u0027d known the girl\u0026nbsp;\u0026nbsp;- a secretary/receptionist who worked at the front desk on weekends, Mary something. The darkroom faced the opening beneath the stairs; she\u0027d have to pass within a few feet of the corpse, but she thought she could avoid looking too closely if she... CRASH! Two of the windows imploded, a driving rain of glass spraying over the receptionist\u0027s body, shards of it slicing at Jill\u0027s bare legs. In the same instant, a giant black mass was hurled inside, bigger than a man, as big as -\u003c/p\u003e\n\u003cp\u003e- S.T.A.R.S. killer -It was all she had time to think. Jill sprinted back the way she\u0027d come, slamming into the evidence room door, while behind her, she heard crunching glass as it rolled to its feet, heard the ugly opening note of its sin-gle-minded cry, \"SSstaarsss\" She ran, snatching the heavy revolver from beneath her waist pack\u0027s strap, through the evidence room to the next door, through that into the patrol squadroom. A sharp left as soon as she was inside and desks blurred past, chairs and shelves and an overturned table spat-tered with the blood and fluids of at least two cops, their sprawled bodies reduced to obstacles in her path. Jill leaped over the twisted legs, hearing the door open, no, disintegrate behind her, a roar of splinters and cracking wood that couldn\u0027t drown out the Neme-sis\u0027s fury.\u003c/p\u003e\n\u003cp\u003eGo go go faster...\u003c/p\u003e\n\u003cp\u003eShe hit the door running, ignoring the dull blossom of pain that enveloped her bruised shoulder, twisting to the right as she pounded into the lobby.\u003c/p\u003e\n\u003cp\u003eShhh-BOOM!\u003c/p\u003e\n\u003cp\u003eA flare of brilliant light and smoke jetted past her, blowing a jagged, burning hole in the floor not three feet to her left. Shards of blackened marble and ce-ramic tile flew, exploding up and outward in a fountain of noise and heat.\u003c/p\u003e\n\u003cp\u003eJesus, it\u0027s armed!\u003c/p\u003e\n\u003cp\u003eShe ran faster, down the ramp into the lower lobby, remembering that she\u0027d dead-bolted the front doors, the realization like a punch in the stomach. She\u0027d never get them open in time, no chance...... and BOOM, another blast from what had to be a grenade launcher or bigger, close enough that she could feel the air part next to her right ear, could hear the whistle of incredible speed just before the front doors blasted open in front of her. They hung drunkenly on bent hinges, swaying and smoldering as she ran through, the night cool and dark.\u003c/p\u003e\n\u003cp\u003e\"Ssstaaarrrsss! \"\u003c/p\u003e\n\u003cp\u003eClose, too close. Instinctively Jill sacrificed a sec-ond of speed to leap to the side, kicking away from the ground, dimly aware that Brad\u0027s body was gone and not caring. Even as she landed, the Nemesis blew past her, barreling through the space she\u0027d oc-cupied an instant before. Its momentum carried it several giant steps away, it was fast but too heavy to stop, its monstrous size giving her the time she needed. A squeal of rust and she was through the gates, slamming them, scrabbling the shotgun off her back. She turned and rammed the shotgun through the gates\u0027 hoop handles, both of them cracking against the barrel before she had time to let go, hard enough for her to realize that the gates wouldn\u0027t hold for very long. Behind the gates, the Nemesis screamed in ani-mal rage, a demonic sound of bloodlust so strong that Jill shuddered convulsively. It was screaming for her, it was the nightmare all over again, she was marked for death. She turned and ran, its howl fading into the dark be-hind her as she ran and ran. When Nicholai saw Mikhail Victor, he knew he\u0027d have to kill him. Technically, there was no reason, but the opportunity was too enticing to pass up. By some fluke, the leader of platoon D had managed to survive, an honor he didn\u0027t deserve.\u003c/p\u003e\n\u003cp\u003eWe\u0027ll just see about that...\u003c/p\u003e\n\u003cp\u003eNicholai was feeling good; he was ahead of the schedule he\u0027d set for himself, and the rest of his jour-ney through the sewers had been uneventful. His next goal was the hospital, which he could reach quickly enough if he took the cable car in Lonsdale Yard; he had more than enough time to relax for a few moments, take a break from his pursuit. Climbing back into the city and seeing Mikhail across the street, from the roof of one of Umbrella\u0027s buildings\u0026nbsp;\u0026nbsp;- the perfect sniper\u0027s roost\u0026nbsp;\u0026nbsp;- was like some cosmic reward for his work so far. Mikhail would never know what hit him. The platoon leader was two stories below, his back to the wall of a wrecking yard\u0027s shack as he changed rifle magazines. A security light, its bright beam flick-ering with the erratic movement of nocturnal insects, clearly illuminated his position and would make it impossible for him to see his killer.\u003c/p\u003e\n\u003cp\u003eWell, you can\u0027t have everything; his death will have to be enough.\u003c/p\u003e\n\u003cp\u003eNicholai smiled and raised the M16, savoring the mo-ment. A cool night breeze ruffled his hair as he studied his quarry, noting with no small satisfaction the fear on Mikhail\u0027s lined, unknowing face. A head shot? No; on the off chance that Mikhail had been infected, Nicholai wouldn\u0027t want to miss the resurrection. He had plenty of time to watch, too. He lowered the barrel a hair, sighting one of Mikhail\u0027s kneecaps. Very painful... but he would still have use of his arms and would probably fire blindly into the dark; Nicholai didn\u0027t want to risk get-ting hit. Mikhail had finished his rifle inspection and was looking around as if to plot his next step. Nicholai took aim and fired, a single shot, extremely happy with his decision as the platoon leader doubled over, grabbing his gut and suddenly, Mikhail was gone, around the cor-ner of the building and into the night. Nicholai could hear the crunch of gravel fading away. He cursed softly, clenching his jaw in frustration. He\u0027d wanted to see the man squirm, see him suffer from the painful and probably lethal wound. It seemed that Mikhail\u0027s reflexes weren\u0027t as poor as he\u0027d thought.\u003c/p\u003e\n\u003cp\u003eSo, he dies in the dark somewhere instead of where I can see him. What is it to me? It\u0027s not as though I have nothing else to occupy my time...\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t work. Mikhail was badly injured, and Nicholai wanted to see him die. It would only take a few minutes to find the trail of blood and track him down\u0026nbsp;\u0026nbsp;- a child could do it. Nicholai grinned. And when I find him, I can offer my assistance, play the concerned comrade\u0026nbsp;\u0026nbsp;- who did this to you, Mikhail? Here, let me help you...\u003c/p\u003e\n\u003cp\u003eHe turned and hurried to the stairs, imagining the look on Mikhail\u0027s face when he realized who was re-sponsible for his plight, when he understood his own failure as a leader and as a man. Nicholai wondered what he\u0027d done to deserve such happiness; so far, this had been the best night of his life.\u003c/p\u003e\n\u003cp\u003eWhen their conversation was over, the line went dead and Carlos walked to one of the booths and sat down, thinking hard about the things Trent had told him. If all he\u0027d said was true\u0026nbsp;\u0026nbsp;- and Carlos believed that it probably was\u0026nbsp;\u0026nbsp;- then Umbrella had a lot to answer for. \"Why are you telling me all this?\" Carlos had asked near the end, his head spinning. \"Why me?\" \"Because I\u0027ve seen your records,\" Trent answered. \"Carlos Oliveira, mercenary for hire\u0026nbsp;\u0026nbsp;- except you only ever fought the good fight, always on the side of the oppressed and abused. Twice you risked your life in as-sassinations, both successful\u0026nbsp;\u0026nbsp;- one a tyrannical drug lord and the other a child pornographer, if memory serves. And you never harmed a civilian, not once. Um-brella is involved in some extremely immoral practices, Mr. Oliveira, and you\u0027re exactly the kind of person who should be working to stop them.\"\u003c/p\u003e\n\u003cp\u003eAccording to Trent, Umbrella\u0027s T-virus or G-virus, there were apparently two strains\u0026nbsp;\u0026nbsp;- was created and used on homemade monsters to turn them into living, breathing weapons. When humans were exposed to it, they got the cannibal disease. And Trent said that the\u003c/p\u003e\n\u003cp\u003eU.B.C.S. administrators knew what they were sending their people into, and probably did it on purpose\u0026nbsp;\u0026nbsp;- all in the name of research.\u003c/p\u003e\n\u003cp\u003e\"The eyes and ears of Umbrella are everywhere,\" Trent had said. \"As I said before, be careful who you trust. Truly, no one is safe.\"\u003c/p\u003e\n\u003cp\u003eCarlos abruptly stood up from the table and walked toward the kitchen, lost in thought. Trent had refused to talk about his own reasons for undermining Umbrella, though Carlos had gotten the impression that Trent also worked for them in some capacity; it would explain why he was so secretive.\u003c/p\u003e\n\u003cp\u003eHe\u0027s being careful, covering his ass, but how could he know so much? The things he told me...\u003c/p\u003e\n\u003cp\u003eA jumble of facts, some that seemed totally arbi-trary\u0026nbsp;\u0026nbsp;- there was a fake green jewel in a cold storage locker underneath the restaurant; Trent had said that it was one of a pair, but had refused to say where the other one was or why either of them was important. \"Just make sure they end up together,\" Trent had said\u0026nbsp;\u0026nbsp;- as if Carlos was going to just happen to come across the other one. \"When you find out where the blue one is, you\u0027ll get your explanation.\"\u003c/p\u003e\n\u003cp\u003eFor as cryptically useless as that seemed to be, Trent had also told him that Umbrella kept two helicopters at the abandoned water treatment plant west and north of the city. Perhaps most useful of all, Trent had said that there was a vaccine being worked on at the city hospi-tal, and while it hadn\u0027t been synthesized yet, there was at least one sample there.\u003c/p\u003e\n\u003cp\u003e\"Although there\u0027s a good chance the hospital may not be there for much longer,\" he\u0027d said, leaving Carlos to wonder again how Trent came by his information.\u003c/p\u003e\n\u003cp\u003eWhat was supposed to happen to it? And how would Trent know that?\u003c/p\u003e\n\u003cp\u003eTrent seemed to think that Carlos\u0027s survival was im-portant; he seemed convinced that Carlos was going to be a significant part of the fight against Umbrella, but Carlos still wasn\u0027t sure why, or if he even wanted to join up. At the moment, all he wanted was to get out of the city... but for whatever reason Trent had decided to offer up information, Carlos was glad for the help.\u003c/p\u003e\n\u003cp\u003eAlthough a little more would\u0027ve been nice\u0026nbsp;\u0026nbsp;- keys to an armored getaway car, maybe, or some kind of anti-monster spray.\u003c/p\u003e\n\u003cp\u003eCarlos stood in the kitchen, gazing down at the heavy-looking cover to what was, presumably, the basement ladder. Trent had told him that there were probably more weapons at a clock tower, not far from the hospital; that and the bit about the Umbrella heli-copters, due north from the tower and hospital, defi-nitely useful...\u003c/p\u003e\n\u003cp\u003eBut why let me come here at all if I\u0027m so goddamn important? He could\u0027ve stopped me on the way to the field office.\u003c/p\u003e\n\u003cp\u003eA lot of it didn\u0027t make sense, and Carlos was willing to bet money that Trent hadn\u0027t told him everything. He had no choice but to trust him a little, but he was going to be very careful when it came to depending on Trent\u0027s information. Carlos crouched next to the basement entrance, grabbed the handle to the cover, and pulled. It was heavy, but he could just manage it, leaning back and using his leg muscles for leverage. Unless the cooks were body builders, there was probably a crowbar around somewhere. The front door to the restaurant opened and closed. Carlos gently, quietly put the cover aside and turned, still in a crouch, M16 aimed at the dining room en-trance. He didn\u0027t think the zombies were coordinated enough to open doors, but he had no idea what the monsters were capable of, or who else might be wan-dering the city streets. Slow, stealthy footsteps moved toward the kitchen. Carlos held his breath, thinking about Trent, wondering suddenly if he\u0027d been set up...... and about the last thing he expected to see was a.357 revolver come around the corner, held by an at-tractive and extremely serious-looking young woman who moved in fast and low and aimed at Carlos before\u003c/p\u003e\n\u003cp\u003ehe could blink.For a beat they stared at each other, neither moving,and Carlos could see in the woman\u0027s eyes that shewouldn\u0027t hesitate to shoot him if she thought it neces-sary. Since he felt pretty much the same way, he de-cided it might be best to introduce himself.\"My name is Carlos,\" he said evenly. \"I\u0027m no zom-bie. Take it easy, huh?\"\u003c/p\u003e\n\u003cp\u003eThe girl studied him another moment, then noddedslowly, lowering the revolver. Carlos took his finger offthe rifle\u0027s trigger and did the same as they bothstraightened up, moving carefully.\"Jill Valentine,\" she said, and seemed about to saysomething else when the back door to the restaurantcrashed open, the thundering sound matched by a gut-tural, barely human scream that raised the hairs on theback of Carlos\u0027s neck.\"Sstaarrsss!\" whatever it was howled, the cry echo-ing through the restaurant, giant footsteps pounding to-ward them, relentless and certain. \u003c/p\u003e","sourceLink":"https://allnovel.net/nemesis-resident-evil-5/page-10.html","bookId":2460,"creation":"Oct 5, 2019 4:33:40 PM","modification":"Oct 5, 2019 4:33:40 PM"}
