{"id":83970,"no":19,"title":"Page 19","content":"\u003cp\u003eSilence. We stare at each other. Unblinking.\u003c/p\u003e\n\u003cp\u003eUnmoving. A thick tension fills the air.\u003c/p\u003e\n\u003cp\u003eDad’s eyes sweep over his desk and he inhales deeply. “Do you want to waste four years of your life going to school when you could be out on that field playing baseball for money? Take a look at Scott Risk. He came from nothing and see what he’s become?\u003c/p\u003e\n\u003cp\u003eYou’re not starting with nothing. You have a jump on opportunities he never had. Think of what you can make of your life.”\u003c/p\u003e\n\u003cp\u003eMy fist tightens around the enrollment papers in my hand and they crackle. Is it fair? Is it fair of me, even if it’s just for one game, to walk away from something that my parents have sacrificed and worked so hard for?\u003c/p\u003e\n\u003cp\u003eBesides, it’s baseball. Baseball is my life—by my choice. Why are we even arguing?\u003c/p\u003e\n\u003cp\u003e“Ryan…” Dad’s voice breaks and he rubs his hand over his face. “Ryan…I’m sorry. For yelling.” He pauses. “Things at work…things with your mom…”\u003c/p\u003e\n\u003cp\u003eMy Dad and I—we’ve never fought.\u003c/p\u003e\n\u003cp\u003eStrange, I guess. I know plenty of guys who go rounds with their fathers. Not me. Dad’s never given me a curfew. He believes I’m responsible enough to decide what trouble I want to get in and says if I go too far, I’m smart enough to dig myself out. He’s encouraged me every step of the way with baseball. More than most parents ever would.\u003c/p\u003e\n\u003cp\u003eDad watches out for me and this… this is him looking out for me again.\u003c/p\u003e\n\u003cp\u003eI nod several times before speaking, agreeing to something, but I don’t know what.\u003c/p\u003e\n\u003cp\u003eAnything to make this confusion stop. “Yeah. It’s okay. This was on me.” I crumple the papers in my hand. “You’re right. This…” I lift the wadded paper. “It’s nothing. Stupid, even.”\u003c/p\u003e\n\u003cp\u003eDad forces a smile. “It’s all right. Go in and tell your mom. She’ll be thrilled.”\u003c/p\u003e\n\u003cp\u003eI stand to leave and try to ignore the emptiness in my chest.\u003c/p\u003e\n\u003cp\u003e“Ryan,” says Dad. At the door, I turn to face him.\u003c/p\u003e\n\u003cp\u003e“Do me a favor—don’t tell your mom about the last round of competition. She’s been on edge lately.”\u003c/p\u003e\n\u003cp\u003e“Sure.” What would be the point of telling her? Mom has a way of knowing when I’m untruthful, and I’m not eager to discover that the words I just uttered to Dad are a lie.\u003c/p\u003e\n\u003cp\u003eBeth\u003c/p\u003e\n\u003cp\u003eTHE CLOCK READS NINE FORTY-FIVE and Isaiah gets off work at ten. My finger, paused against the speed dial button, goes numb. The sun set a while ago, leaving the room dark. I haven’t moved from my spot on the bed. Scott hasn’t come in. Neither has Allison. Not to lecture me on school or to scold me for yelling at Allison or to call me to dinner.\u003c/p\u003e\n\u003cp\u003eI’ve dry heaved twice. Scott’s going to send Mom to jail. He probably already called the police. The ironic part of this whole nightmare? I tried. I tried and I failed. Imagine that.\u003c/p\u003e\n\u003cp\u003eAt ten, I’ll call Isaiah and tell him to come and get me. We’ll go to the beach. We’ll run away. Too bad I can’t convince Mom to go with us. Isaiah and I could get her before the cops do.\u003c/p\u003e\n\u003cp\u003eI raise my head and a wave of hope floods my body, making me dizzy. I could convince Mom to go. We could go away— together.\u003c/p\u003e\n\u003cp\u003eSomeone knocks on the door. I slip the phone under the covers. “Yeah.”\u003c/p\u003e\n\u003cp\u003eScott enters the room and turns on the light.\u003c/p\u003e\n\u003cp\u003eHe wears a black T-shirt and a pair of blue jeans. For the first time, I see a hint of the kid that took care of me when I was younger and, foolishly, my heart responds. I move off the bed. I have to tell him I’m sorry. “Scott…”\u003c/p\u003e\n\u003cp\u003eFocusing on the carpet, he cuts me off. “I’m not in the mood to hear you bitch. If you ever talk to Allison like that again, I’ll make sure you regret it. She’s my wife and I love her.”\u003c/p\u003e\n\u003cp\u003eI nod, but Scott doesn’t look at me to see it.\u003c/p\u003e\n\u003cp\u003eHe pulls his wallet out and slaps a card onto the dresser. The name and number belong to Mom’s probation officer. “I talked to him this evening. Nice guy. Did you know your mom will serve a ten-year sentence if she screws up probation? Ten years. That’s not even counting what they’ll charge her with when I tell them what I know. Your choice, Elisabeth. Either way you’re living here until you turn eighteen. Your actions decide if your mom goes to jail.”\u003c/p\u003e\n\u003cp\u003eThe relief sweeping through my body makes me weak. He hasn’t sent my mom to jail. Not yet. I still can make this work. The possibilities have my mind racing. I’ll have to find a way into Louisville, to convince Mom to leave with me, and then get Isaiah on board.…\u003c/p\u003e\n\u003cp\u003e“Last chance.” Scott breaks into my thoughts. “I want perfection this time.”\u003c/p\u003e\n\u003cp\u003eHe smacks his hand against the dresser and the last cigarette I bummed rolls out of a folder and onto the floor. Shit.\u003c/p\u003e\n\u003cp\u003eScott crouches and stares at the cigarette before picking it up. He acts like it’s a joint instead of tobacco. Crap. It might as well be a needle full of heroin. “I can explain.” Actually, I can’t. But I heard Noah use that phrase with Echo once and it bought him time.\u003c/p\u003e\n\u003cp\u003eAs he stands, his hand shakes. Dad’s hands used to shake. “This is bullshit. I bring you to my home.” He falters and I can see him trying to rein in the anger. It scares me that he won’t look at me. “I give you a home and you don’t even have the decency to try to follow my rules.”\u003c/p\u003e\n\u003cp\u003eQuiet anger frightens me. The drunks, the idiots, the ones that rage easily—them I can handle. I know when to step out of their way.\u003c/p\u003e\n\u003cp\u003eIt’s the ones that hold the anger in, the men that think about what they do and how they do it, that scare me. They’re the ones that cause damage. A small voice, a voice that sounds a lot like me when I was a child, sweetly murmurs that Scott would never hurt me. That he was our protector. Once. I don’t know this man.\u003c/p\u003e\n\u003cp\u003e“I tried,” I whisper.\u003c/p\u003e\n\u003cp\u003e“Bullshit!” Scott yells so loudly that the crystals on the lampshade tinkle. I flinch and step back. “You’ve done everything you can to make Allison and me miserable.”\u003c/p\u003e\n\u003cp\u003eI swallow. Mom’s boyfriend, Trent, started this way. He walked into the apartment all calm and cool, with anger seething underneath.\u003c/p\u003e\n\u003cp\u003eThen he yelled. Then he hit.\u003c/p\u003e\n\u003cp\u003eDad had this anger too. So did Grandpa. My heart beats wildly in my chest as Scott crushes the cigarette in his hand. For the first time, he looks at me. “Jesus, you’re shaking.”\u003c/p\u003e\n\u003cp\u003eHe moves toward me and I take a retreating step. My back hits the window and my hands fly out, searching for something—anything—to protect myself with. “Get out.”\u003c/p\u003e\n\u003cp\u003eThe anger—it’s gone, calls the little girl in my head, but I ignore her. She died along with my love of ribbons and dresses and life. She’s nothing but a ghost.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” he says slowly and places space between us. “I didn’t realize I scared you. I was mad. Allison was upset. I hate to see her cry and your teacher called…but I’m calm. I swear.”\u003c/p\u003e\n\u003cp\u003eI tried. Really, I did. I tried and this is where it got me. Trapped in a room full of windows with a man who resembles my father. Dad also used to say he was calm, but he never was.\u003c/p\u003e\n\u003cp\u003e“Get out!”\u003c/p\u003e\n\u003cp\u003e“Elisabeth…”\u003c/p\u003e\n\u003cp\u003e“Out!” My hands wave air in front of me, motioning for him to leave. “Get out!”\u003c/p\u003e\n\u003cp\u003eScott’s eyes grow abnormally wide. “I am not going to hurt you.”\u003c/p\u003e\n\u003cp\u003e“This is your fault!” I yell and I want to stop, but if I stop I’ll cry. A strange wetness burns my eyes. My lip is so heavy it trembles. I can’t cry. I won’t cry. Embracing the anger, I open my mouth again. Damn him if he makes me cry. “You’re the one that dragged me here. Is it not enough to take me away from home? You have to humiliate me at school?”\u003c/p\u003e\n\u003cp\u003e“Humiliate you? Elisabeth, what are you talking about?”\u003c/p\u003e\n\u003cp\u003e“I am not Elisabeth! Look at me!” I grab at the clothes on my body with one hand and yank my Calculus book off the bedside table with the other and fling the book straight at his head. He ducks and the book makes a loud thud when it smacks the wall. “You want me to be somebody else. You don’t want me to be me. You’re just like Dad! You want me gone!”\u003c/p\u003e\n\u003cp\u003eMy chest is heaving and I gasp for air. The silence that falls between us is heavy and I’m drowning under its weight.\u003c/p\u003e\n\u003cp\u003e“That’s not true.” Scott pauses as if he’s waiting for a reply. He picks up the textbook and sets it on the dresser. Right beside Mom’s parole officer’s card. “Get some sleep. We’ll talk in the morning.”\u003c/p\u003e\n\u003cp\u003eNo, we won’t. He leaves for work before I wake for school. Scott gently closes the door. I race across the room, lock it, turn off the lights, then toss the covers off the bed, searching for the phone. My fingers shake as I press the numbers. My pulse beats in my ears in time to the name of the person I need: Isaiah. A heartbeat. Isaiah. The phone rings. Isaiah.\u003c/p\u003e\n\u003cp\u003e“Hey.” At the sound of his easygoing voice I lean against the closet door. “You had me worried. It’s five after ten. You’re late for our one-minute talk.”\u003c/p\u003e\n\u003cp\u003eHoping my lip will quit trembling, I close my eyes and will the tears to stay away. It’s all in vain. If I speak, I’ll cry and I don’t cry.\u003c/p\u003e\n\u003cp\u003e“Beth?” Worry creeps into his tone.\u003c/p\u003e\n\u003cp\u003e“Here,” I whisper back and that one word is almost my undoing. Isaiah and I—we don’t do phone conversations. Never have. We watched TV. We partied. We sat next to each other—existed. How do you just be on a phone? And that’s what I need. I need Isaiah to just exist.\u003c/p\u003e\n\u003cp\u003e“Beth…” He hesitates. “Is that Ryan guy messing with you again?”\u003c/p\u003e\n\u003cp\u003eI swallow a possible sob. I won’t cry. I won’t. “Sort of.” And Allison and my uncle and school and everything and I feel like the walls are caving in, an avalanche preparing to bury me.\u003c/p\u003e\n\u003cp\u003eSilence from Isaiah.\u003c/p\u003e\n\u003cp\u003eI bite my lip when one tear rolls down my face. “Do you want me to let you go?”\u003c/p\u003e\n\u003cp\u003eDammit. Just dammit—I don’t cry. “Because I know you don’t talk. I mean us. We. We don’t talk.” I swear under my breath. My voice shook. He’ll know I’m upset. He’ll know.\u003c/p\u003e\n\u003cp\u003eSilence again. Air crackling on the line.\u003c/p\u003e\n\u003cp\u003eWhen he lets me go, I’ll fall apart. I’ll have nothing to hold on to. Nothing to anchor me.\u003c/p\u003e\n\u003cp\u003eI’ll be exactly what everyone wants me to be—nothing.\u003c/p\u003e\n\u003cp\u003e“I’m okay with silence, Beth.”\u003c/p\u003e\n\u003cp\u003eI’m still here in this house in the room with too many windows. I’m still exposed—raw—and living in hell. But I have Isaiah and he’s anchoring me. I slide down the wall until I can curl into a tight ball on the floor. “I need you.”\u003c/p\u003e\n\u003cp\u003e“I’m here.” And we sit in silence.\u003c/p\u003e\n\u003cp\u003eRyan\u003c/p\u003e\n\u003cp\u003eSITTING ON MY BED, I read the text message.\u003c/p\u003e\n\u003cp\u003eFirst the fight with Dad, then, at ten at night, Gwen sends me this: Beth Risk???\u003c/p\u003e\n\u003cp\u003eShe waits on the other end for my reply. At least when I play baseball, I can catch the balls beings thrown at me. Dad and Gwen? I’m getting the hell pounded out of me.\u003c/p\u003e\n\u003cp\u003eI shouldn’t answer Gwen. I should pretend I never read the message. She loves drama. I love baseball. She hated my games and I hated hers. We stopped kissing and touching and dating, yet somehow, like that night at the dugout, we’ve never stopped the games. \u003c/p\u003e","sourceLink":"https://allnovel.net/dare-you-to-pushing-the-limits-2/page-19.html","bookId":2753,"creation":"Oct 5, 2019 4:56:14 PM","modification":"Oct 5, 2019 4:56:14 PM"}
