{"id":84005,"no":54,"title":"Page 54","content":"\u003cp\u003eHe cups my face with his hands and I lean into his touch. Ryan can always do this—make me feel safe. He continues, “If you stay it’ll kill you. Maybe not physically, but you’ll die on the inside. If you don’t want me, I’ll give you your space, but you have built so much more in Groveton besides me. Give up on us if you need to, but don’t give up on you.”\u003c/p\u003e\n\u003cp\u003eThe instinct is to flee. Instead, I grab on to his arms. Fear claws at me and I don’t like how naked it makes me feel. “I’m scared.”\u003c/p\u003e\n\u003cp\u003eRyan lowers his forehead to mine. “So am I, but I’ll be less scared when we leave here.”\u003c/p\u003e\n\u003cp\u003eThe front door opens. Bright sunlight blazes through the door and a gust of cold air announces the entrance of the devil. Trent’s looming figure stalks into the living room.\u003c/p\u003e\n\u003cp\u003eLosing control of my body, I feel my hands drop to my sides as my heart jumps to my throat. Ryan edges his body in front of mine.\u003c/p\u003e\n\u003cp\u003eTrent slams the door behind him and chuckles when he sees me. His eyes dart to the bag by my feet. “You should have stayed away.”\u003c/p\u003e\n\u003cp\u003eBehind me, I hear the soft shuffles of my mother. “Elisabeth was just leaving.”\u003c/p\u003e\n\u003cp\u003eUrging me in the direction of the door, Ryan presses his hand into my back. My mind screams run. My feet cement to the floor. It doesn’t matter if I move or not. Trent won’t let me walk out that door again.\u003c/p\u003e\n\u003cp\u003e“Let Ryan go.” I say it as a plea and Trent flashes a smile. It’s the first time I’ve asked anything of him and the bastard enjoys it.\u003c/p\u003e\n\u003cp\u003eTrent opens a box of cigarettes, puts one in his mouth, and lights it. He sucks in a long drag and blows out the smoke as he stares at me. I shiver as I watch the glowing ashes. The last time, Trent enjoyed listening to me scream when he burned holes in my arms. “Go ahead, boy. Get out. My problem isn’t with you.”\u003c/p\u003e\n\u003cp\u003e“Not without Beth.” Rage shakes Ryan’s voice.\u003c/p\u003e\n\u003cp\u003eI love Ryan despite everything, and if it weren’t for me, he wouldn’t be here. Shoving my hands against his chest, I push him away.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eRyan sizes Trent up and Trent does the same to him.\u003c/p\u003e\n\u003cp\u003e“Walk out the door, Beth,” says Ryan. “He’s not going to touch you.”\u003c/p\u003e\n\u003cp\u003eTrent laughs. Ryan is sturdy, strong, and young. Trent is larger, older, and a mean bastard. Last year, Isaiah and Noah took him on and the two survived because my uncle threatened Trent with a gun. My uncle isn’t here and I’m not lucky enough to own a gun.\u003c/p\u003e\n\u003cp\u003eRyan inches toward me and the door. His eyes never leave Trent. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eMy pulse pounds in my ears. Maybe we can walk out. “Mom?”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare move, Sky,” Trent says.\u003c/p\u003e\n\u003cp\u003eI hold my hand out to her. “Come with us.”\u003c/p\u003e\n\u003cp\u003eRyan yells my name as his arms fly out in front of me. Pain slices my head. The ground rushes toward my face. A combination of darkness and light flickers from behind my closed lids. Noises blend into a high-pitched buzzing as warm liquid trickles from above my eyebrow to the bridge of my nose. I lick my lips and flinch at the salty taste of blood.\u003c/p\u003e\n\u003cp\u003eMy eyelids flutter and I fight to keep them open. The room shifts and spins. Forcing my eyes to focus, I see the shattered remains of Mom’s table lamp on the floor next to me.\u003c/p\u003e\n\u003cp\u003eThe buzzing fades and I turn my head to the sound of a struggle and grunts. Ryan shoves Trent into the front door by tackling him at the waist. Trent quickly responds by punching Ryan in the stomach.\u003c/p\u003e\n\u003cp\u003eCeramic cuts into my hand as I crawl toward them. “Stop.” My voice comes out soft and hoarse. Ryan stumbles but is able to block a hit, then buys himself seconds by socking Trent in the jaw. I force pressure onto my legs so I can stand, but I fall.\u003c/p\u003e\n\u003cp\u003eSitting in the fetal position on the other side of the room, Mom rocks back and forth on the floor. I swallow and force words out of my raw throat. “Help Ryan, Mom.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“He’s going to kill us!”\u003c/p\u003e\n\u003cp\u003eMom lowers her head to her knees and continues to rock.\u003c/p\u003e\n\u003cp\u003e“Mom!” I scream. “Please!”\u003c/p\u003e\n\u003cp\u003eMom hums loudly and my heart breaks open. She’s never going to change. No matter what I do. No matter how I try. My mom will always be this poor pathetic waste of life. I won’t be her. I can’t. I grab on to an overturned chair and force myself to my feet. Trent tackles Ryan and they both go crashing to the floor.\u003c/p\u003e\n\u003cp\u003e“Leave him alone!”\u003c/p\u003e\n\u003cp\u003eTrent rises to his knees, punches Ryan in the face and Ryan falls once more. Panic tears at me. He’s going to kill Ryan in front of me. The fucking bastard is going to take away everything I love.\u003c/p\u003e\n\u003cp\u003eI launch myself at him and smack and hit\u003c/p\u003e\n\u003cp\u003eand claw. He bends my wrist and arm in a way not physically possible. Bones in my arm snap and pop. A scream tears through my body as pain blinds me.\u003c/p\u003e\n\u003cp\u003eHe lets go and I fall to my knees in agony.\u003c/p\u003e\n\u003cp\u003eMy scream becomes silent as Trent squeezes his fingers around my neck. I gag and try to suck in air. Nothing happens. Thoughts flash through my head at a frenzied pace. I need air.\u003c/p\u003e\n\u003cp\u003eHe’s going to kill me. My hands go to the fingers crushing my throat, but I can’t pry them off.\u003c/p\u003e\n\u003cp\u003eHe’s stronger than me and powerful and he’s going to win.\u003c/p\u003e\n\u003cp\u003eTrent jerks and his fingers loosen. Ryan holds Trent in a headlock as I collapse to the ground and draw air into my burning lungs.\u003c/p\u003e\n\u003cp\u003eMy hands flutter near my neck and cover where his fingers marked my skin.\u003c/p\u003e\n\u003cp\u003e“Baby!” Mom’s hand joins mine on my throat. “Are you okay?”\u003c/p\u003e\n\u003cp\u003eDazed, I nod.\u003c/p\u003e\n\u003cp\u003eMom snatches my biceps and yanks in an effort to get me off the floor. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eRyan curses and I unsuccessfully struggle to stand. “Help him, Mom.”\u003c/p\u003e\n\u003cp\u003eRyan locks his other arm around Trent’s neck and yells, “Go, Beth!” Trent battles against Ryan’s hold and Ryan’s face strains as he fights to keep his grip.\u003c/p\u003e\n\u003cp\u003eMom shakes her head. “Let’s go. Now. He’ll hurt me.”\u003c/p\u003e\n\u003cp\u003eTrent elbows Ryan in the gut, swings around and lands a blow to Ryan’s face. Ryan falls.\u003c/p\u003e\n\u003cp\u003e“No!” Screams and pleas fly from my mouth. Blood covers Ryan’s face. Trent stands and kicks Ryan in the stomach. I scream out in pain when I place weight on my left arm.\u003c/p\u003e\n\u003cp\u003e“Help him, Mom!”\u003c/p\u003e\n\u003cp\u003e“We have to go now, Elisssabeth.” Mom calmly slurs my name. “I want to leave. I’ll go with you now.”\u003c/p\u003e\n\u003cp\u003eI turn my head and stare at the eerie image of my mother. Her tired eyes with their constricted pupils look at me as if I’m a shadow instead of her daughter. Mom squeezes my hand again. For the first time, she’s not rubbing her arm.\u003c/p\u003e\n\u003cp\u003eCradling my left arm close to my body, I grip the table and pull myself to my feet. “You shot up?”\u003c/p\u003e\n\u003cp\u003eAs I stand, Mom drops to the ground. In shame? In exhaustion? Too high? I don’t know.\u003c/p\u003e\n\u003cp\u003eRefusing to watch Ryan die, refusing to make eye contact with me, Mom covers her head with her arms and rocks over and over again.\u003c/p\u003e\n\u003cp\u003eBlood pours over my eye and my sight wavers as my body sways to the side. My fingers accidently hit Mom’s cordless phone near the edge of the table.\u003c/p\u003e\n\u003cp\u003eHeroin.\u003c/p\u003e\n\u003cp\u003eIt destroyed me nine years ago and one phone call cost me my father.\u003c/p\u003e\n\u003cp\u003eHeroin.\u003c/p\u003e\n\u003cp\u003eIf I call, my mother will go to jail.\u003c/p\u003e\n\u003cp\u003eHeroin.\u003c/p\u003e\n\u003cp\u003eMy finger slides against the numbers and like nine years ago I listen to the phone ring once, twice, a third time. The world turns black, then reappears in a fuzzy tunnel. My knees buckle and I force consciousness for a few more seconds.\u003c/p\u003e\n\u003cp\u003e“Nine-one-one, what’s your emergency?”\u003c/p\u003e\n\u003cp\u003eRyan\u003c/p\u003e\n\u003cp\u003eI SET MY CELL to the loudest ringtone and place it on my chest before I rest my head on my pillow. Beth’s supposed to come home from the hospital today and because of that I’ve refused pain medication. I want to hear her voice on the other end of the line and know that she’s only a mile down the road instead of thirty minutes away in Louisville.\u003c/p\u003e\n\u003cp\u003eThen, for the first time in more than a week, I can sleep deeply.\u003c/p\u003e\n\u003cp\u003eMy body is one slow, throbbing ache. Every pressure point pounds in time with my pulse.\u003c/p\u003e\n\u003cp\u003eBroken ribs, bruised everything, and cuts. Each and every injury worth the cost of saving Beth.\u003c/p\u003e\n\u003cp\u003e“Can you tell me why?” My dad’s voice carries into the room.\u003c/p\u003e\n\u003cp\u003eMy eyes flash open and I turn my head to see him leaning against the door frame with his gaze pinned to the floor. It’s the first words he’s said to me since I hit him. He’s been around. Present, but not speaking. I don’t feel bad about it, because I haven’t talked to him either…until now. “Why what?”\u003c/p\u003e\n\u003cp\u003e“Why you risked it all for that girl?”\u003c/p\u003e\n\u003cp\u003e“Because I love her. And her name’s Beth.”\u003c/p\u003e\n\u003cp\u003eNo response. Sometimes I wonder if Dad knows what love is.\u003c/p\u003e\n\u003cp\u003e“Scott called,” he says stiffly. “He wanted to remind you that there are rules now. He’s angry with both of you and he won’t be letting her out of the house anytime soon.”\u003c/p\u003e\n\u003cp\u003eI return my focus to the ceiling. I can deal with rules as long as I’ve got Beth. Scott’s been a mixture of grateful and pissed. In hindsight, maybe I should have called him when I found Beth’s note, but I don’t think Beth would have listened to him. She needed me.\u003c/p\u003e\n\u003cp\u003e“I don’t think you should continue to see her,” Dad says.\u003c/p\u003e\n\u003cp\u003e“Don’t remember asking.”\u003c/p\u003e\n\u003cp\u003eThere’s silence and when I glance out of the corner of my eye, Dad’s gone. Who knows if the two of us can fix what’s been broken.\u003c/p\u003e\n\u003cp\u003eMy cell buzzes and my stomach plummets when I notice Beth’s name above the text. She promised she’d call. Friends, right?\u003c/p\u003e\n\u003cp\u003eI half chuckle. It’s the first text she ever sent me. Always.\u003c/p\u003e\n\u003cp\u003eThe doorbell rings and I rub my eyes. I’m too exhausted for guests, but they keep coming: my friends, the baseball team, my coaches, teachers, my parents’ friends.\u003c/p\u003e\n\u003cp\u003eMom and Dad’s slightly raised tones indicate that they’re disagreeing over something, and I don’t care enough to figure out the issue. I expect them to continue the argument, but what I don’t expect is Mom’s voice at the door of my room. “Because I said so.”\u003c/p\u003e\n\u003cp\u003eShe throws a glare down the hallway before addressing me. “Ryan, you have a guest.”\u003c/p\u003e\n\u003cp\u003eBefore I can ask who, Beth walks into my room with her left arm in a sling. The breath slams out of my body. She’s here. Forgetting about my injuries, I rush to sit up—and wince.\u003c/p\u003e\n\u003cp\u003eThe smell of roses overwhelms me and I glance up to see Beth by my side.\u003c/p\u003e\n\u003cp\u003e“You look like hell. Have you been resting at all?”\u003c/p\u003e\n\u003cp\u003eThe right side of my mouth quirks up.\u003c/p\u003e\n\u003cp\u003e“It’s nice to see you, too.”\u003c/p\u003e\n\u003cp\u003e“I’m serious.” Beth doesn’t wear worry well and the ache on her face bothers me.\u003c/p\u003e\n\u003cp\u003eI capture the hand she uses to try to push me back down, bring it to my lips, and kiss her palm. God, I’ve missed her.\u003c/p\u003e\n\u003cp\u003eA clearing of a throat and I notice Scott standing beside my mother at the door. “A few minutes, Beth, then we’re heading home.”\u003c/p\u003e\n\u003cp\u003eBeth nods and I watch my mother’s reaction to a girl in my room. She studies us, almost like someone seeing a painting they don’t quite get. There’s no malice in her expression, just curiosity. “I’m leaving the door open.”\u003c/p\u003e\n\u003cp\u003e“Thanks,” I say and I mean it. Mom’s trying now—not only with me, but with Mark, and I have Chris to thank for it. He called Mark when EMS brought me into the emergency room. Mark and Mom talked for the first time while I was in X-ray. Both are silent about the conversation they had, but they’re speaking again. It’s a start. Scott leans his head in when Mom leaves and stares straight at Beth. “Behave.” \u003c/p\u003e","sourceLink":"https://allnovel.net/dare-you-to-pushing-the-limits-2/page-54.html","bookId":2753,"creation":"Oct 5, 2019 4:56:14 PM","modification":"Oct 5, 2019 4:56:14 PM"}
