{"id":83958,"no":7,"title":"Page 7","content":"\u003cp\u003eParties are great. They have girls, girls who drink beer, dancing, girls who like dancing, and guys who hate dancing but do it anyway in the hope of laying the girls who drink beer.\u003c/p\u003e\n\u003cp\u003eLacy’s in the mood to dance, Chris is in the mood to avoid dancing, I’m still burnt from Skater Girl last night, and Logan’s always game for the stupid and insane. Ten minutes into the party, Lacy was dancing and the three of us took on a dare. Actually, I took on a dare.\u003c/p\u003e\n\u003cp\u003eI lost last night and I don’t lose. Chris and Logan are along for the ride.\u003c/p\u003e\n\u003cp\u003e“You can’t pull this one off.” Chris walks beside me as we head toward the cars parked neatly in a line. The full moon gives the field a silver glow and the scent of bonfire smoke hangs in the air.\u003c/p\u003e\n\u003cp\u003e“That’s because you have no imagination.”\u003c/p\u003e\n\u003cp\u003eThankfully, I have plenty and I know a few guys who get a kick out of screwing with friends.\u003c/p\u003e\n\u003cp\u003e“This is going to be sweet,” Logan says when I change course and head toward a group of defensive linemen enjoying their own private party.\u003c/p\u003e\n\u003cp\u003eTim Richardson owns a mammoth-size, ozone-killing truck, which is good, because the four guys sitting on lawn chairs on the back of it easily weigh 275 pounds each. Tim liberates a can of beer from his cooler and tosses it to me. “What’s going on, Ry?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” I put the cold can on the tailgate.\u003c/p\u003e\n\u003cp\u003eNo drinking for me. I’ve got business to take care of. “Not in the mood for the party?”\u003c/p\u003e\n\u003cp\u003eHis truck is one of the few that can make it over the hill into the back field. “A girl over there is pissed at me,” Tim mutters. “Anytime I go near her, she won’t keep her mouth shut.”\u003c/p\u003e\n\u003cp\u003eLogan snorts and Chris smacks him on the back of the head. Pissed would be an understatement. Rumor at school said Tim’s ex-girl caught him making out with her twin sister. Tim throws a warning glare at Logan before focusing on me. “How’s your brother?\u003c/p\u003e\n\u003cp\u003eThe team’s ticked at him. He promised he’d help with summer practice while he was home from college.”\u003c/p\u003e\n\u003cp\u003eHating these kinds of questions, I shift my stance and shove my hands in my pockets. Dad made it clear that we tell no one what happened with Mark. “He’s been busy.” Before Tim has a chance to probe further, I switch to the problem at hand. “How would you guys like to help me with a…situation?”\u003c/p\u003e\n\u003cp\u003eTim leans forward as his fellow linemen snicker. “What dare did you sign up for this time?”\u003c/p\u003e\n\u003cp\u003eI bob my head back and forth like what I’m preparing to ask isn’t a big deal. “Nothing fancy. Rick dared me to move his car.”\u003c/p\u003e\n\u003cp\u003eTim shrugs because it doesn’t sound like a big deal.\u003c/p\u003e\n\u003cp\u003e“Without the keys,” says Chris.\u003c/p\u003e\n\u003cp\u003eTim lowers his head, and deep chuckles resonate from his chest. “You three are the definition of insane. You know that, right?”\u003c/p\u003e\n\u003cp\u003e“Says the guy that tackles other dudes for fun,” I say. “Are you in or out?”\u003c/p\u003e\n\u003cp\u003eTim’s lawn chair moves with him as he stands. As he reaches his full height, the chair plunges onto the bed of the truck with a loud clank. “In.”\u003c/p\u003e\n\u003cp\u003eCURLED FINGERS MISERABLY clutch metal and my back and thighs burn with pain. Seven guys, one 2,400-pound car, and one more inch to go.\u003c/p\u003e\n\u003cp\u003e“On three,” I say through clenched teeth.\u003c/p\u003e\n\u003cp\u003e“One…”\u003c/p\u003e\n\u003cp\u003e“Three,” yells Logan and I barely unwedge my fingers from the bumper of the two-door Chevy Aveo when the six other guys drop the car to the ground. The frame of the blue car bounces like a Slinky before coming to a rest.\u003c/p\u003e\n\u003cp\u003e“Sweet shocks,” says Logan.\u003c/p\u003e\n\u003cp\u003eSweat soaks my shirt. Gasping for air, I bend over and place my hands on my knees. The rush of the win races through my veins and I laugh out loud.\u003c/p\u003e\n\u003cp\u003eLogan admires our handiwork. “Six feet over and nicely parallel parked between two trees.” Nicely meaning the front and rear bumpers currently kiss bark.\u003c/p\u003e\n\u003cp\u003eTim’s chest heaves as if he’s experiencing a heart attack. “You’re a crazy son-of-a-bitch, Ry.” Pant. “How the hell is Rick going to move this piece of shit?”\u003c/p\u003e\n\u003cp\u003e“Chris, Logan, and I will stick around. Once he gets done freaking, we’ll lift the back end and move it so he can wedge out.”\u003c/p\u003e\n\u003cp\u003eTim laughs while shaking his head. “I’ll see you at school on Monday.”\u003c/p\u003e\n\u003cp\u003e“Thanks, man.”\u003c/p\u003e\n\u003cp\u003e“Anytime. Let’s go, guys. I need a beer.”\u003c/p\u003e\n\u003cp\u003eI sag to the ground and lean against the tree near the bumper. Chris slides against the passenger door until his butt hits the dirt. We both stare at Logan, waiting for him to join us, but he’s busy studying the two oak trees pinning in our third baseman’s car.\u003c/p\u003e\n\u003cp\u003eIn any circle that doesn’t involve me, Chris, and Lacy, Logan is known for silence and his constant state of boredom. At the moment, so-called silent, bored boy’s mind is spinning like a toddler on a sugar high. It’s ironic: at school, people think I’m the adrenaline junkie because I admire a good dare. Hell, I’m not looking for a high—I just like to win. Logan, on the other hand, thrives on the edge. Gotta love a guy like that.\u003c/p\u003e\n\u003cp\u003eI’m not the only one who’s noticed Logan’s insane infatuation with the tree. Chris eyes him warily. “What the hell are you doing, Junior?”\u003c/p\u003e\n\u003cp\u003eLogan winks at me. “Be back in a second, boss man.” He scrambles up the old oak tree.\u003c/p\u003e\n\u003cp\u003eSmall dead limbs that can’t hold his weight fall through the branches and onto the ground.\u003c/p\u003e\n\u003cp\u003eChris grows restless. He won’t admit it, but heights scare the shit out of him and Logan’s fear of nothing scares the shit out of him more.\u003c/p\u003e\n\u003cp\u003e“Get your ass back down here.”\u003c/p\u003e\n\u003cp\u003e“Okay,” calls Logan from somewhere high in the tree.\u003c/p\u003e\n\u003cp\u003eI shake my head. “You shouldn’t have said that.”\u003c/p\u003e\n\u003cp\u003eFrom above, tree limbs crackle and snap and leaves whoosh as if a strong breeze rushes through them. It’s not wind. It’s Logan, and one of these days he’s going to get himself killed. A swirl of dirt accompanies the thud on the ground. Logan’s body presses against my foot. On his back, with his black hair full of torn leaves, Logan convulses with laughter.\u003c/p\u003e\n\u003cp\u003eObviously this isn’t the night he was meant to die. He turns his head to look at Chris. “Here.”\u003c/p\u003e\n\u003cp\u003eI kick Logan hard when I remove my foot from under his ass. “You’re the crazy son-of-a-bitch, not me.”\u003c/p\u003e\n\u003cp\u003e“Crazy?” Logan rolls over to sit up. “I’m not the one following a psycho chick into a parking lot for a phone number. Those guys could have kicked your ass.”\u003c/p\u003e\n\u003cp\u003eDamn. I hoped they had forgotten. “I could have taken them.” They would have eventually handed my ass to me, but I would have given them some bruises as payback. Two versus one are bad odds.\u003c/p\u003e\n\u003cp\u003e“Not the point,” says Logan.\u003c/p\u003e\n\u003cp\u003e“Since you mentioned it.” Chris takes his baseball cap off and holds it over his heart.\u003c/p\u003e\n\u003cp\u003e“I’m going to take this moment and remind everyone of the following—I won.”\u003c/p\u003e\n\u003cp\u003e“I won tonight. So we’re even again.”\u003c/p\u003e\n\u003cp\u003eChris shoves his hat back on. “Doesn’t count.”\u003c/p\u003e\n\u003cp\u003eHe’s right. It doesn’t. The only dares we keep track of are the ones we give to one another. “Enjoy the brief taste of victory. I’ll be winning next time.”\u003c/p\u003e\n\u003cp\u003eWe lapse into silence, which is fine. Our silences are never uncomfortable. Unlike girls, guys don’t have to talk. Every now and then, we hear laughter or shouting from the party.\u003c/p\u003e\n\u003cp\u003eEvery now and then, Chris and Lacy text. He likes to give her space, but doesn’t trust drunk guys near his girl.\u003c/p\u003e\n\u003cp\u003eLogan fiddles with a long branch that fell to the ground. “Dad and I headed into Lexington this morning to check out U of K.”\u003c/p\u003e\n\u003cp\u003eI hold my breath, hoping that the conversation doesn’t turn to where I think it’s heading. Logan’s had this visit scheduled for weeks. He’s a damn genius and will have every college knocking on his door next year, including the University of Kentucky. “How’d it go?”\u003c/p\u003e\n\u003cp\u003e“I saw Mark.”\u003c/p\u003e\n\u003cp\u003eI rub the back of my head and try to ignore the nagging ache inside. “How is he?”\u003c/p\u003e\n\u003cp\u003e“Fine. He asked about you. Your mom.” He pauses. “Your dad.”\u003c/p\u003e\n\u003cp\u003e“He’s fine. That’s it?”\u003c/p\u003e\n\u003cp\u003e“No offense, but it was weird. I’m cool that he’s your brother and that he’s made his choices, but I’m not sticking around to play head shrink over your family problems, especially when he had an audience.”\u003c/p\u003e\n\u003cp\u003e“An audience?” I echo.\u003c/p\u003e\n\u003cp\u003e“Yeah,” says Logan. “His boyfriend, I guess.”\u003c/p\u003e\n\u003cp\u003eThe twisting pressure usually only reserved for games pummels my stomach. I pull my knees up and lower my head. “How do you know it was his boyfriend?”\u003c/p\u003e\n\u003cp\u003eLogan’s face scrunches. “I dunno. He was standing next to another dude.”\u003c/p\u003e\n\u003cp\u003e“It could have been a friend,” says Chris.\u003c/p\u003e\n\u003cp\u003e“Did the guy look gay?”\u003c/p\u003e\n\u003cp\u003e“Mark didn’t look gay, asswipe.” Logan snaps. “Who would have guessed the damn defensive lineman had it for the home team. And sure, the other dude could’ve been straight. But how the hell should I know?”\u003c/p\u003e\n\u003cp\u003eListening to them discuss my gay brother’s possible gay boyfriend is just as comfortable as convincing my mom over and over again that I prefer girls and their girl parts. Nothing makes you think you might need years of therapy like having to say the word breasts in front of your mother. “Can we end this conversation?”\u003c/p\u003e\n\u003cp\u003eI consider walking back to Tim’s truck and collecting that beer. I’ve only been shit-faced drunk twice in my life. Once when Mark told the family he was gay. The second time when\u003c/p\u003e\n\u003cp\u003eDad kicked him out for that announcement.\u003c/p\u003e\n\u003cp\u003eBoth incidents happened in the span of three days. Lessons learned: don’t tell Dad you’re gay, and getting drunk doesn’t make anything untrue. It just makes your head hurt in the morning.\u003c/p\u003e\n\u003cp\u003eWith a loud crack, Logan breaks the twig in his hand. He’s looking for courage, which means I’m going to hate the words coming out of his mouth. “Mark was all cryptic, but he said you’d know what he meant. He said he can’t come and he hoped you’d understand why.”\u003c/p\u003e\n\u003cp\u003eThe muscles in my neck tighten. My brother didn’t even have the balls to tell me himself. I texted him last week. I outright defied my parents and texted him. I asked him to come home for dinner tomorrow night and he never texted back. Instead, he took the coward’s way out and used Logan.\u003c/p\u003e\n\u003cp\u003eEarlier this summer, Dad gave the ultimatum: as long as Mark chooses guys, he’s no longer a part of our family. Mark walked out, knowing what leaving meant: leaving Mom…leaving me. He never considered trying to stay home and fight to keep our family together. “He made his choice.”\u003c/p\u003e\n\u003cp\u003eLogan lowers his voice. “He misses you.”\u003c/p\u003e\n\u003cp\u003e“And he left,” I snap. I kick the back tire of the car. Angry. Angry at Dad. Angry at Mark.\u003c/p\u003e\n\u003cp\u003eAngry at me. For three days straight Mark talked. He said the same thing over and over again. He’s still Mark. My brother. Mom’s son.\u003c/p\u003e\n\u003cp\u003eHe told me how he spent years confused because he wanted to be like me. He wanted to be like Dad.\u003c/p\u003e\n\u003cp\u003eAnd when I asked him to stay, when I asked him to stand his ground…he left. He packed up his shit and he left, leaving me and the destruction of my family behind. \u003c/p\u003e","sourceLink":"https://allnovel.net/dare-you-to-pushing-the-limits-2/page-7.html","bookId":2753,"creation":"Oct 5, 2019 4:56:14 PM","modification":"Oct 5, 2019 4:56:14 PM"}
