{"id":92115,"no":182,"title":"Page 182","content":"\u003cp\u003eIt was long past time for her to find Gareth Bryne.\u003c/p\u003e\n\u003cp\u003eWhen Egwene and Gawyn got back to camp, she climbed from her horse and gave it to Leilwin, telling her to use it to help carry the wounded. There were plenty of those who had been dragged across the ford to safety, bloodied soldiers slumping against the arms of friends.\u003c/p\u003e\n\u003cp\u003eUnfortunately, she hadn’t the strength for Healing, let alone a gateway to send wounded to Tar Valon or Mayene. Most of the Aes Sedai not busy at the riverbank didn’t look as if they were doing any better.\u003c/p\u003e\n\u003cp\u003e\"Egwene\", Gawyn said softly. \"Rider. Seanchan. Looks like a noblewoman\".\u003c/p\u003e\n\u003cp\u003eOne of the Blood? Egwene thought, standing and looking through camp toward where Gawyn pointed. At least he had the strength left to keep a lookout. Why any woman would voluntarily go without a Warder was beyond her.\u003c/p\u003e\n\u003cp\u003eThe woman approaching wore fine Seanchan silks, and Egwene’s stomach turned at the sight. That finery existed because of a foundation of enslaved channelers, forced into obedience to the Crystal Throne. The woman was certainly one of the Blood, as a contingent of Deathwatch Guards accompanied her. You had to be very important for . . .\u003c/p\u003e\n\u003cp\u003e\"Light!\" Gawyn exclaimed. \"Is that Min?\"\u003c/p\u003e\n\u003cp\u003eEgwene gaped. It was.\u003c/p\u003e\n\u003cp\u003eMin rode up, scowling. \"Mother\", she said to Egwene, bowing her head amid her stone-faced guards in dark armor.\u003c/p\u003e\n\u003cp\u003e\"Min . . . are you well?\" Egwene asked. Careful, don’t give out too much information. Was Min a captive? Surely she couldn’t have joined the Seanchan, could she?\u003c/p\u003e\n\u003cp\u003e\"Oh, I’m well\", Min said sourly. \"I’ve been pampered, stuffed in this outfit, and offered all sorts of somewhat delicate foods. I might add that among the Seanchan, delicate does not necessarily mean tasty. You should see the things they drink, Egwene\".\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen them\", Egwene said, unable to keep her tone from coldness. \"Oh. Yes. I suppose you have. Mother, we have a problem\".\u003c/p\u003e\n\u003cp\u003e\"What kind of problem?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it depends on how much you trust Mat\".\u003c/p\u003e\n\u003cp\u003e\"I trust him to find trouble\", Egwene said. \"I trust him to find drinking and gambling, no matter where he goes\".\u003c/p\u003e\n\u003cp\u003e\"Do you trust him to lead an army?\" Min asked.\u003c/p\u003e\n\u003cp\u003eEgwene hesitated. Did she?\u003c/p\u003e\n\u003cp\u003eMin leaned forward, sparing a glance for the Deathwatch Guards, who didn’t seem about to let her draw any closer to Egwene. \"Egwene\", she said softly, \"Mat thinks that Bryne is leading your army to destruction. He says . . . he says he thinks Bryne is a Darkfriend\".\u003c/p\u003e\n\u003cp\u003eGawyn started laughing.\u003c/p\u003e\n\u003cp\u003eEgwene jumped. She would have expected anger from him, outrage. \"Gareth Bryne?\" Gawyn asked. \"A Darkfriend? I’d believe my own mother to be a Darkfriend before him. Tell Cauthon to stay out of his wife’s royal brandy; hes obviously had too much\".\u003c/p\u003e\n\u003cp\u003e\"I’m inclined to agree with Gawyn\", Egwene said slowly. Still, she could not ignore the irregularities in how the army was being led.\u003c/p\u003e\n\u003cp\u003eShe would sort through that. \"Mat is always looking out for people who don’t need to be looked out for\", she said. \"He’s just trying to protect me. Tell him that we appreciate the . . . warning\".\u003c/p\u003e\n\u003cp\u003e\"Mother\", Min said. \"He seemed certain. This isn’t a joke. He wants you to turn your armies over to him\".\u003c/p\u003e\n\u003cp\u003e\"My armies\", Egwene said flatly.\u003c/p\u003e\n\u003cp\u003e\"Yes\".\u003c/p\u003e\n\u003cp\u003e\"In the hands of Matrim Cauthon\".\u003c/p\u003e\n\u003cp\u003e\"Um . . . yes. I should mention, the Empress has given him command of all the Seanchan forces. He’s now Marshal-General Cauthon\".\u003c/p\u003e\n\u003cp\u003eTa\u0027veren. Egwene shook her head. \"Mat is a good tactician, but handing him the White Tower’s armies . . . No, that is beyond possibility. Besides, the armies are not mine to give him—the Hall of the Tower has authority for them. Now, how can we persuade these gentlemen surrounding you that you’ll be safe accompanying me?\"\u003c/p\u003e\n\u003cp\u003eAs little as Egwene wanted to admit it, she needed the Seanchan. She wouldn’t risk their alliance to save Min, particularly since it didn’t seem that she was in immediate danger. Of course, if the Seanchan realized that Min had sworn their oaths back in Falme, then fled . . .\u003c/p\u003e\n\u003cp\u003e\"Don’t worry about me\", Min said with a grimace. \"I suppose I’m better off with Fortuona. She . . . knows about a certain talent of mine, thanks to Mat, and it might let me help her. And you\".\u003c/p\u003e\n\u003cp\u003eThe statement was laden with meaning. The Deathwatch Guards were too stoic to respond overtly to Min’s use of the Empress’s name, but they did seem to stiffen, their faces hardening. Take care, Min, Egwene thought. You’re surrounded by autumn thornweeds.\u003c/p\u003e\n\u003cp\u003eMin didn’t seem to care. \"Will you at least consider what Mat is saying?\"\u003c/p\u003e\n\u003cp\u003e\"That Gareth Bryne is a Darkfriend?\" Egwene said. It really was laughable. \"Go back and tell Mat to submit his battle suggestions to us, if he must. For now, I need to find my commanders to plan our next steps\". Gareth Bryne, where are you?\u003c/p\u003e\n\u003cp\u003eA flight of black arrows rose almost invisibly into the air, then fell like a breaking wave. They hit Ituralde’s army at the mouth of the pass to the valley of Thakan’dar, some bouncing off shields, others finding flesh. One fell inches from where Ituralde stood atop a rocky outcropping.\u003c/p\u003e\n\u003cp\u003eIturalde didn’t flinch. He stood, straight-backed, hands clasped behind him. He did, however, mutter, \"Letting things draw a little close, aren’t we?\" Binde, the Asha’man who stood beside him in the night, grimaced. \"Sorry, Lord Ituralde\". He was supposed to keep the arrows away. He’d done well, so far. Sometimes, however, he got a distant look in his face and started muttering about \"them\" trying to \"take his hands\".\u003c/p\u003e\n\u003cp\u003e\"Stay sharp\", Ituralde said.\u003c/p\u003e\n\u003cp\u003eHis head throbbed. More dreams earlier tonight, so real. He had seen Trollocs eating members of his family alive, and had been too weak to save them. He had struggled and wept as they ate Tamsin and his children, but at the same time had been lured by the scents of the boiling and burning flesh.\u003c/p\u003e\n\u003cp\u003eAt the end of the dream, he had joined the monsters in their feast.\u003c/p\u003e\n\u003cp\u003ePut that from your mind, he thought. It was not easy to do so. The dreams had been so vivid. He had been glad to be awakened by a Trolloc attack.\u003c/p\u003e\n\u003cp\u003eHe’d been ready for this. His men lit bonfires at the barricades. The Trollocs had finally pushed through his thorn fortifications, but their butchers bill had been high. Now, Ituralde’s men fought at the mouth of the pass, holding the tides back \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-182.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
