{"id":92130,"no":197,"title":"Page 197","content":"\u003cp\u003eOne of the Darkfriends stepped forward, lithe, almost invisible in the darkness. He pulled her face close to inspect her, then waved his hand to the other. A very soft light appeared beside them, giving them a better look at her—and her at them. They wore red veils, but this one had taken his down for the fight. Why? What was this? No Aiel she knew did that. Were these the Shaido? Had they joined the Shadow?\u003c/p\u003e\n\u003cp\u003eOne of the men made a few gestures to the other. It was handtalk. Not Maiden handtalk, but something similar. The other man nodded.\u003c/p\u003e\n\u003cp\u003eAviendha thrashed against her invisible bonds. She slammed her will against that shield, biting down on her gag of Air. The Aiel on the right—the taller one, the one who probably held her shield—grunted. She felt as if her fingers were clawing at the edge of a nearly shut door, with light, warmth and power beyond. That door wouldn’t budge an inch.\u003c/p\u003e\n\u003cp\u003eThe tall Aiel narrowed his eyes at her. He let the light he’d summoned vanish, plunging them into darkness. Aviendha heard him take out a spear.\u003c/p\u003e\n\u003cp\u003eA foot fell on the ground nearby. The red-veils heard it and spun; Aviendha looked as best she could, but couldn’t make out the newcomer.\u003c/p\u003e\n\u003cp\u003eThe men stood perfectly still.\u003c/p\u003e\n\u003cp\u003e\"What is this?\" a woman’s voice asked. Cadsuane. She approached, a lantern in her hand. Aviendha was jerked away as the man holding her weaves pulled her back into the shadows, and Cadsuane did not seem aware of her. Cadsuane saw only the other man, who stood closer to the pathway.\u003c/p\u003e\n\u003cp\u003eThat Aiel man stepped from the shadows. He’d lowered his veil, too. \"I thought I heard something near the tents here, Aes Sedai\", he said. He had a strange accent, one that was slightly off. Only by a shade. A wetlander would never know the difference.\u003c/p\u003e\n\u003cp\u003eThese aren’t Aiel, Aviendha thought. They’re something different. Her mind wrestled with the concept. Aiel who were not Aiel? Men who could channel?\u003c/p\u003e\n\u003cp\u003eThe men we send, she realized with horror. Men discovered among the Aiel with the ability to channel were sent to try to kill the Dark One. Alone, they came to the Blight. Nobody knew what happened to them after that.\u003c/p\u003e\n\u003cp\u003eAviendha began to struggle again, trying to make noise—any noise—to alert Cadsuane. The attempts were in vain. She hung tightly in the air, in the darkness, and Cadsuane wasn’t looking in her direction.\u003c/p\u003e\n\u003cp\u003e\"Well, did you find anything?\" Cadsuane asked the man.\u003c/p\u003e\n\u003cp\u003e\"No, Aes Sedai\".\u003c/p\u003e\n\u003cp\u003e\"I will speak to the guards\", Cadsuane said, sounding dissatisfied. \"We must be vigilant. If a Draghkar—or, worse, a Myrddraal—managed to sneak in, it could kill dozens before being discovered\".\u003c/p\u003e\n\u003cp\u003eCadsuane turned to go. Aviendha shook her head, tears of frustration in her eyes. So close!\u003c/p\u003e\n\u003cp\u003eThe red-veil who had been with Cadsuane stepped back into the shadows, going up to Aviendha. In a flash of lightning, she caught a smile on his lips, mimicked by the one who still held her in the bonds.\u003c/p\u003e\n\u003cp\u003eThe red-veil in front of her slid a dagger from his belt, then reached up for her. She watched that knife, helpless, as he raised it to her throat.\u003c/p\u003e\n\u003cp\u003eShe sensed channeling.\u003c/p\u003e\n\u003cp\u003eThe bonds holding her were gone instantly, and she dropped to the ground. Aviendha caught the man’s knife hand as she fell, his eyes opening wide. Though she embraced the Source by raw, mad instinct, her hands were already moving. She twisted the man’s wrist, snapping the bones where hand met arm. She caught the knife with her other hand, then slammed it into his eye as he started to scream in pain.\u003c/p\u003e\n\u003cp\u003eThe scream cut off. The red-veil fell at her feet, and she looked with anxiety toward the one beside her—the one who had been holding her in weaves. He lay dead on the ground.\u003c/p\u003e\n\u003cp\u003eGasping, she scrambled toward the path nearby, and found Cadsuane.\u003c/p\u003e\n\u003cp\u003e\"It is a simple thing, to stop a man’s heart\", Cadsuane said, arms folded. She seemed dissatisfied. \"So close to Healing, yet opposite in effect. Perhaps it is an evil thing, yet I’ve always failed to see how it would be worse than simply burning a man to ash with fire\".\u003c/p\u003e\n\u003cp\u003e\"How?\" Aviendha asked. \"How did you recognize what they were?\"\u003c/p\u003e\n\u003cp\u003e\"I am not a half-trained wilder\", Cadsuane replied. \"I would have liked to strike them down when I first arrived, but I had to be certain before I could act. When that one threatened you with the knife, I knew\".\u003c/p\u003e\n\u003cp\u003eAviendha breathed in and out, trying to still her heart.\u003c/p\u003e\n\u003cp\u003e\"And, of course, there was the other one\", Cadsuane said. \"The one that channeled. How many male Aiel warriors can secretly channel? Was this an anomaly, or have your people been covering them up?\"\u003c/p\u003e\n\u003cp\u003e\"What? No! We don’t. Or, we didn’t\". Aviendha wasn’t certain what they would do now that the Source had been cleansed. Men, certainly, should stop being sent alone to die fighting the Dark One.\u003c/p\u003e\n\u003cp\u003e\"You’re certain?\" Cadsuane asked, voice flat.\u003c/p\u003e\n\u003cp\u003e\"Yes!\"\u003c/p\u003e\n\u003cp\u003e\"Pity. That could have been a large boon to us, now\". Cadsuane shook her head. \"I wouldn’t have been surprised, after finding out about those Windfinders. So these were just run-of-the-mill Darkfriends, with one among them who had hidden his channeling ability? What were they about tonight?\"\u003c/p\u003e\n\u003cp\u003e\"These are anything but ordinary Darkfriends\", Aviendha said softly, inspecting the corpses. Red veils. The man who had been able to channel wore his teeth filed to points, but the other two did not. What did it mean?\u003c/p\u003e\n\u003cp\u003e\"We need to alert the camp\", Aviendha continued. \"It’s possible that these three merely walked in, unchallenged. Many of the wetlander guards avoid challenging Aiel. They assume that all of us serve the Car’a’carn\".\u003c/p\u003e\n\u003cp\u003eTo many wetlanders, an Aiel was an Aiel. Fools. Though . . . to be honest, Aviendha had to admit that her own first instinct upon seeing Aiel had been to think them allies. When had that happened? Not two years back, if she’d caught unfamiliar algai’d’siswai prowling about, she’d have attacked.\u003c/p\u003e\n\u003cp\u003eAviendha continued her inspection of the dead men—a knife on each man, spears and bows. Nothing else telling. However, her thoughts whispered to her that she was missing something.\u003c/p\u003e\n\u003cp\u003e\"The female channeler\", she said suddenly, looking up. \"It was a woman using the One Power that drew me, Aes Sedai. Was that you?\"\u003c/p\u003e\n\u003cp\u003e\"I did not channel until I killed that man\", Cadsuane said, frowning.\u003c/p\u003e\n\u003cp\u003eAviendha dropped back into a battle stance, hugging the shadows. What would she find next? Wise Ones who served the Shadow? Cadsuane frowned, as Aviendha scouted the area further. She passed Darlin’s tent, where soldiers outside huddled around lamps and cast shadows that danced on the canvas. She passed soldiers in tight groups walking along the pathways, not speaking. They carried torches, blinding \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-197.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
