{"id":92168,"no":236,"title":"Page 236","content":"\u003cp\u003e\"Glory of men . . \". Min whispered. \"It’s still to come\".\u003c/p\u003e\n\u003cp\u003e\"Someone go check on those guards\", Mat said, returning to his maps. \"Tuon, we may want to move you. This place never has been secure, and Logain has just proven it\".\u003c/p\u003e\n\u003cp\u003e\"I can protect myself\", she said haughtily.\u003c/p\u003e\n\u003cp\u003eToo haughty. He raised an eyebrow at her, and she nodded.\u003c/p\u003e\n\u003cp\u003eReally? Mat thought. This is what you want to fight about? He was not certain the spy would buy it. Too flimsy a reason.\u003c/p\u003e\n\u003cp\u003eHis plan with Tuon was to take a cue from what Rand had once done with Perrin. If Mat could fake a split between himself and the Seanchan, and in so doing make Tuon pull her forces back, perhaps the Shadow would ignore her. Mat needed an edge of some sort.\u003c/p\u003e\n\u003cp\u003eTwo guards came in. No, three. That one fellow was easy to miss. Mat shook his head at Tuon—they needed to find something more realistic to argue over—and glanced back at his maps.\u003c/p\u003e\n\u003cp\u003eSomething itched at him about the little guard. Looks more like a servant than a soldier, Mat thought. He forced himself to look up, though he really should not let himself become distracted by common servants. Yes, there the fellow was, standing beside Mats table. Not worth paying attention to, even if he was pulling a knife out.\u003c/p\u003e\n\u003cp\u003eA knife.\u003c/p\u003e\n\u003cp\u003eMat stumbled back as the Gray Man attacked. Mat yelled, reaching for one of his own knives, just as Mika screamed. \"Channeling! Nearby!\"\u003c/p\u003e\n\u003cp\u003eMin threw herself at Fortuona as the wall of the command post went up in flame. Sharans in strange armor made of bands of metal, painted gold, ripped through the blazing opening. Channelers with tattooed faces accompanied them: the women in long, stiff black dresses, the men shirtless, trousers ragged. Min took this in just before she tipped Fortuona’s throne over.\u003c/p\u003e\n\u003cp\u003eFire burned through the air above Min, singeing her ornate silks and consuming the wall behind them. Fortuona scrambled out of Min’s grip, lying low, and Min blinked in surprise. The woman had left her bulky costume behind—it was made to break away—and underneath wore sleek silken trousers and a tight shirt, both black.\u003c/p\u003e\n\u003cp\u003eTuon came up with a knife in her hand, growling softly in an almost feral way. Nearby, Mat fell backward to the ground, a knife-wielding man on top of him. Where had that man come from? She didn’t remember him entering.\u003c/p\u003e\n\u003cp\u003eTuon ran for Mat as Sharan channelers began to pound the command post with fire. Min struggled to her feet in the awful clothing. She pulled a dagger out and huddled by the throne, putting her back to it as the ground heaved.\u003c/p\u003e\n\u003cp\u003eShe couldn’t reach Fortuona, so she forced herself out the back wall, which was made of the paperlike stuff the Seanchan called tenmi.\u003c/p\u003e\n\u003cp\u003eShe coughed at the smoke, but now that she was outside, the air was clearer. None of the Sharans were here on this side of the building. They were all attacking from the other directions. She sprinted along the wall. Channelers were dangerous, but if she could put a knife in one, all of the One Power in the world wouldn’t matter.\u003c/p\u003e\n\u003cp\u003eShe peeked around the corner, and was surprised by a man crouching there, a feral look in his eyes. He had an angular face; his blood-red neck tattoos looked like claws, cupping his light-skinned head and chin.\u003c/p\u003e\n\u003cp\u003eHe growled, and Min threw herself backward to the ground, ducking a ribbon of fire and throwing her knife.\u003c/p\u003e\n\u003cp\u003eThe man caught it in the air. He prowled forward in a crouch, bestial, smiling at her.\u003c/p\u003e\n\u003cp\u003eThen he jerked, suddenly, and fell over, thrashing. A trickle of blood came from his lips.\u003c/p\u003e\n\u003cp\u003e\"That\", a woman said nearby, a sound of utter distaste in her tone, \"is something I’m not supposed to know how to do, but stopping someone’s heart with the One Power is quiet. It requires very little Power, surprisingly, which is pertinent to me\".\u003c/p\u003e\n\u003cp\u003e\"Siuan!\" Min said. \"You’re not supposed to be here\".\u003c/p\u003e\n\u003cp\u003e\"Lucky for you I am\", Siuan said with a snort, inspecting the body, staying low. \"Bah. Nasty business that, but if you’re going to eat a fish, you should be willing to gut it yourself. What’s wrong, girl? You’re safe now. No need to look so pale\".\u003c/p\u003e\n\u003cp\u003e\"You’re not supposed to be here!\" Min said. \"I told you. Stay near Gareth Bryne!\"\u003c/p\u003e\n\u003cp\u003e\"I did stay near him, almost near as his own smallclothes, I’ll have you know. We saved one another’s lives because of it, so I guess the viewing was right. Are they ever wrong?\"\u003c/p\u003e\n\u003cp\u003e\"No, I’ve told you that\", Min whispered. \"Never. Siuan . . . I saw an aura around Bryne that meant you had to stay together, or the two of you would die. It hangs above you, right now. Whatever you think you did, the viewing has not been accomplished yet. It’s still there\"\u003c/p\u003e\n\u003cp\u003eSiuan stood frozen for a moment. \"Cauthon is in danger\".\u003c/p\u003e\n\u003cp\u003e\"But—\"\u003c/p\u003e\n\u003cp\u003e\"I don’t care, girl!\" Nearby, the ground trembled with the force of the One Power. The damane were fighting back. \"If Cauthon falls, this battle is lost! I don’t care if we both die from this. We must help. Move!\"\u003c/p\u003e\n\u003cp\u003eMin nodded, then joined her as she moved around the side of the ragged building. The firefight outside was a raw mix of explosions, smoke and flames. Members of the Deathwatch Guard charged the Sharans, swords out, heedless of their companions being slaughtered around them. That, at least, was keeping the channelers busy.\u003c/p\u003e\n\u003cp\u003eThe command post burned with such heat that Min had to shy back, raising an arm.\u003c/p\u003e\n\u003cp\u003e\"Hold on\", Siuan said, then used the One Power to draw a small column of water out of a nearby barrel, spraying them both. \"I’ll try to dampen the flames\", she said, redirecting the small column of water to the command post. \"All right. Lets go\".\u003c/p\u003e\n\u003cp\u003eMin nodded, bursting through the flames, Siuan joining her. The tenmi walls inside had all started aflame, burning away quickly. Fire dripped from the ceiling.\u003c/p\u003e\n\u003cp\u003e\"There\", Min said, blinking away tears from the heat and the smoke. She pointed toward dark figures struggling near the center of the building and Mat’s blazing map table. There seemed to be a group of three or four people fighting Mat. Light, they were all Gray Men—not just one of them! Tuon was down.\u003c/p\u003e\n\u003cp\u003eMin ran past the corpse of a sul’dam alongside several guards. Siuan used the One Power to haul one of the Gray Men away from Mat. Guards’ corpses created shadows of firelight on the floor. One damane still lived, huddled in a corner, looking terrified, her leash on the floor. Her sul’dam lay a distance away, unmoving. Her grip had been knocked free, it appeared, and then she was killed as she tried t \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-236.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
