{"id":91959,"no":24,"title":"Page 24","content":"\u003cp\u003e\"I asked about the events before, Perrin. I asked after what happened, but I did not ask after the people it happened to\". He looked at Perrin, making a globe of light for them to see by as they walked in the night. \"I need to remember the people. Not doing so is a mistake I have made too often in the past\".\u003c/p\u003e\n\u003cp\u003eThe stirring wind carried the scent of campfires from Perrin’s nearby camp and the sounds of smiths working on weapons. Rand had heard the stories: Power-wrought weapons discovered again. Perrin’s men were working overtime, running his two Asha’man ragged, to make as many as possible.\u003c/p\u003e\n\u003cp\u003eRand had lent him as many more Asha’man as he could spare, if only because—as soon as they’d heard—he’d had dozens of Maidens presenting themselves and demanding Power-wrought spearheads. It only makes sense, Rand al’Thor, Beralna had explained. His smiths can make four spearheads for every sword. She’d grimaced saying the word \"sword\", as if it tasted like seawater.\u003c/p\u003e\n\u003cp\u003eRand had never tasted seawater. Lews Therin had. Knowing facts like that had greatly discomforted him once. Now he had learned to accept that part of him.\u003c/p\u003e\n\u003cp\u003e\"Can you believe what has happened to us?\" Perrin asked. \"Light, sometimes I wonder when the man who owns all these fancy clothes is going to walk in on me and start yelling, then send me out to muck the stables for being too bigheaded for my collar\".\u003c/p\u003e\n\u003cp\u003e\"The Wheel weaves as the Wheel wills, Perrin. We\u0027ve become what we needed to become\".\u003c/p\u003e\n\u003cp\u003ePerrin nodded as they walked on the path between tents, lit by the glow of the light above Rand’s hand.\u003c/p\u003e\n\u003cp\u003e\"How does it . . . feel?\" Perrin asked. \"Those memories you’ve gained?\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever had a dream that, upon waking, you remembered in stark clarity? Not one that faded quickly, but one that stayed with you through the day?\"\u003c/p\u003e\n\u003cp\u003e\"Yes\", Perrin said, sounding oddly reserved. \"Yes, I can say that I have\".\u003c/p\u003e\n\u003cp\u003e\"It’s like that\", Rand said. \"I can remember being Lews Therin, can remember doing what he did, as one remembers actions in a dream. It was me doing them, but I don’t necessarily like them—or think I’d take those actions if I were in my waking mind. That doesn’t change the fact that, in the dream, they seemed like the right actions\".\u003c/p\u003e\n\u003cp\u003ePerrin nodded.\u003c/p\u003e\n\u003cp\u003e\"He’s me\", Rand said. \"And I’m him. But at the same time, I’m not\".\u003c/p\u003e\n\u003cp\u003e\"Well, you still seem like yourself\", Perrin said, though Rand caught a slight hesitation on the word \"seem\". Had Perrin been about to say \"smell\" instead? \"You haven’t changed that much\".\u003c/p\u003e\n\u003cp\u003eRand doubted he could explain it to Perrin without sounding mad. The person he became when he wore the mantle of the Dragon Reborn . . . that wasn’t simply an act, wasn’t simply a mask.\u003c/p\u003e\n\u003cp\u003eIt was who he was. He had not changed, he had not transformed. He had merely accepted.\u003c/p\u003e\n\u003cp\u003eThat didn’t mean he had all of the answers. Despite four hundred years of memories nestled in his brain, he still worried about what he had to do. Lews Therin hadn’t known how to seal the Bore. His attempt had led to disaster. The taint, the Breaking, all for an imperfect prison with seals that were now brittle.\u003c/p\u003e\n\u003cp\u003eOne answer kept coming to Rand. A dangerous answer. One that Lews Therin hadn’t considered.\u003c/p\u003e\n\u003cp\u003eWhat if the answer wasn’t to seal the Dark One away again? What if the answer, the final answer, was something else? Something more permanent. Yes, Rand thought to himself for the hundredth time. But is it possible? They arrived at the tent where the clerks worked, the Maidens fanning out behind them, Rand and Perrin entering. The clerks were up late, of course, and they didn’t look surprised to see Rand enter.\u003c/p\u003e\n\u003cp\u003e\"My Lord Dragon\", Balwer said, bowing stiffly from where he stood beside a table of maps and stacks of paper. The dried-up little man sorted his papers nervously, one knobby elbow protruding from a hole in his oversized brown coat.\u003c/p\u003e\n\u003cp\u003e\"Report\", Rand said.\u003c/p\u003e\n\u003cp\u003e\"Roedran will come\", Balwer said, his voice thin and precise. \"The Queen of Andor has sent for him, promising him gateways made by those Kinswomen of hers. Our eyes in his court say he is angry that he needs her help to attend, but is insistent that he needs to be at this meeting—if only so he doesn’t look left out\".\u003c/p\u003e\n\u003cp\u003e\"Excellent\", Rand said. \"Elayne knows nothing of your spies?\"\u003c/p\u003e\n\u003cp\u003e\"My Lord!\" Balwer said, sounding indignant.\u003c/p\u003e\n\u003cp\u003e\"Have you determined who is spying for her among our clerks?\" Rand asked.\u003c/p\u003e\n\u003cp\u003eBalwer sputtered. \"Nobody—\"\u003c/p\u003e\n\u003cp\u003e\"She’ll have someone, Balwer\", Rand said with a smile. \"She all but taught me how to do this, after all. No matter. After tomorrow, my intentions will be manifest for all. Secrets won’t be needed\".\u003c/p\u003e\n\u003cp\u003eNone save the ones I keep closest to my own heart.\u003c/p\u003e\n\u003cp\u003e\"That means everyone will be here for the meeting, right?\" Perrin asked. \"Every major ruler? Tear and Illian?\"\u003c/p\u003e\n\u003cp\u003e\"The Amyrlin persuaded them to attend\", Balwer said. \"I have copies of their exchanges here, if you wish to see them, my Lords\".\u003c/p\u003e\n\u003cp\u003e\"I would\", Rand said. \"Send them to my tent. I will look them over tonight\".\u003c/p\u003e\n\u003cp\u003eThe shaking of the ground came suddenly. Clerks grabbed stacks of papers, holding them down and crying out as furniture crashed to the ground around them. Outside, men shouted, barely audible over the sound of trees breaking, metal clanging. The land groaned, a distant rumble.\u003c/p\u003e\n\u003cp\u003eRand felt it like a painful muscle spasm.\u003c/p\u003e\n\u003cp\u003eThunder shook the sky, distant, like a promise of things to come. The shaking subsided. The clerks remained holding their stacks of paper, as if afraid to let go and risk them toppling.\u003c/p\u003e\n\u003cp\u003eIt’s really here, Rand thought. I’m not ready—we’re not ready—but it’s here anyway.\u003c/p\u003e\n\u003cp\u003eHe had spent many months fearing this day. Ever since Trollocs had come in the night, ever since Lan and Moiraine had dragged him from the Two Rivers, he had feared what was to come.\u003c/p\u003e\n\u003cp\u003eThe Last Battle. The end. He found himself unafraid now that it had come. Worried, but not afraid.\u003c/p\u003e\n\u003cp\u003eI’m coming for you, Rand thought.\u003c/p\u003e\n\u003cp\u003e\"Tell the people\", Rand said to his clerks. \"Post warnings. Earthquakes will continue. Storms. Real ones, terrible ones. There will be a Breaking, and we cannot avoid it. The Dark One will try to grind this world to dust\".\u003c/p\u003e\n\u003cp\u003eThe clerks nodded, shooting concerned glances at one another by lamplight. Perrin looked contemplative, but nodded f \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-24.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
