{"id":92186,"no":254,"title":"Page 254","content":"\u003cp\u003e\"What are you doing?\" Androl asked. He didn’t have to fake the tremor in his voice. That pain.\u003c/p\u003e\n\u003cp\u003e\"You said you saw Androl?\" Taim said. \"I’m placing a Mask of Mirrors on you and inverting the weave, making you look like him. I want you to pretend to be the pageboy, find Logain, then kill him. Use a knife or a weave, I don’t care which\".\u003c/p\u003e\n\u003cp\u003e\"You’re . . . making me look like Androl\", Androl said.\u003c/p\u003e\n\u003cp\u003e\"Androl is one of Logain’s pets\", Taim said. \"He shouldn’t suspect you. This is an exceptionally easy thing I’m asking of you, Nensen. Do you think, for once, you could avoid making a complete mess of it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, M’Hael\".\u003c/p\u003e\n\u003cp\u003e\"Good. Because if you fail, I’ll kill you\". The weave fell into place and vanished.\u003c/p\u003e\n\u003cp\u003eMishraile grunted, releasing Androl and stepping back. \"I think Androl is uglier than that, M’Hael\".\u003c/p\u003e\n\u003cp\u003eTaim snorted, then waved at Androl. \"It’s good enough. Get out of my sight. Return with Logain’s head, or do not return at all\".\u003c/p\u003e\n\u003cp\u003eAndrol scrambled away, breathing heavily, feeling the others’ eyes on his back. Once a good distance away, he ducked around some brush that was only mostly burned, and nearly tripped over Pevara, Emarin and Jonneth hiding there.\u003c/p\u003e\n\u003cp\u003e\"Androl!\" Emarin whispered \"Your disguise! What happened? Was that Taim?\"\u003c/p\u003e\n\u003cp\u003eAndrol sat down in a heap, trying to still his heart. Then, he held up the pouch he had pulled off Taim’s belt while stumbling to his feet. \"It was him. You’re not going to believe this, but . . \".\u003c/p\u003e\n\u003cp\u003eArganda cupped the piece of paper, sitting in Mighty’s saddle and pulling his list of ciphers out of his pocket. Those Trollocs kept launching arrows. So far, he’d avoided being hit. As had Queen Alliandre, who still rode with him. At least she was willing to stay back a little way with his reserves, where she was more sheltered.\u003c/p\u003e\n\u003cp\u003eIn addition to the Legion of the Dragon and the Borderlanders, his force, along with the Wolf Guard and the Whitecloaks, had moved downriver following the battle at the ruins. Arganda had more foot soldiers than the others, and had trailed behind them.\u003c/p\u003e\n\u003cp\u003eThey’d found plenty of fighting here, with the Trollocs and Sharans in the dry riverbed trying to surround the armies of Andor. Arganda had been fighting here for a few hours now as the sun set, bringing on the shadows. He’d pulled back once he got the message, however.\u003c/p\u003e\n\u003cp\u003e\"Bloody awful handwriting\", Arganda grumbled, flipping through the little list of ciphers and turning it toward a torch. The orders were authentic. Either that, or someone had broken the cipher.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Turne asked.\u003c/p\u003e\n\u003cp\u003e\"Cauthon’s alive\", Arganda said with a grunt.\u003c/p\u003e\n\u003cp\u003e\"Where is he?\"\u003c/p\u003e\n\u003cp\u003e\"Don’t know\", Arganda said, folding the paper and tucking away the ciphers. \"The messenger said Cauthon opened a gateway in front of him, threw the letter in his face, and told him to find me\".\u003c/p\u003e\n\u003cp\u003eArganda turned to the south, peering through the darkness. In preparation for night, his men had brought oil through gateways and set piles of wood alight. By the firelight, he could see the Two Rivers men heading his way, sure as the orders had said.\u003c/p\u003e\n\u003cp\u003e\"Ho, Tam al’Thor!\" Arganda said, raising a hand. He hadn’t seen his commander since parting after the battle at the ruins, hours ago now.\u003c/p\u003e\n\u003cp\u003eThe Two Rivers men looked as worn down as Arganda felt. It had been a long, long day, and the fighting was by no means over. I wish Gallenne were here, Arganda thought, inspecting Trollocs at the river as al’Thor’s men approached. I could use someone to argue with.\u003c/p\u003e\n\u003cp\u003eJust downriver, shouts and clangs sounded from where the Andorans’ pike formations held off—barely—the Trolloc waves. By now, this battle was strung out along the Mora, almost up to Dashar Knob. His men had helped keep the Andorans from being flanked.\u003c/p\u003e\n\u003cp\u003e\"What news, Arganda?\" Tam asked as he came over.\u003c/p\u003e\n\u003cp\u003e\"Cauthon lives\", Arganda said. \"And that’s bloody amazing, considering that someone blew up his command post, set fire to his tent, killed a bunch of his damane, and chased off his wife. Cauthon crawled out of it somehow\".\u003c/p\u003e\n\u003cp\u003e\"Ha!\" Abell Cauthon said. \"That’s my boy\".\u003c/p\u003e\n\u003cp\u003e\"He told me you were coming\", Arganda said. \"He said you’d have arrows. Do you?\"\u003c/p\u003e\n\u003cp\u003eTam nodded. \"Our last orders sent us through the gateway to Mayene for Healing and resupply. I don’t know how Mat knew arrows would be coming, but a shipment from the women in the Two Rivers came right as we were getting ready to return here. We have longbows for you to use, if you need them\".\u003c/p\u003e\n\u003cp\u003e\"I will. Cauthon wants all of our troops to move back upriver to the ruins, cut across the riverbed and march up the Heights from the northeastern side\".\u003c/p\u003e\n\u003cp\u003e\"Not sure what that’s about, but I suppose he knows what he’s doing . . \". Tam said.\u003c/p\u003e\n\u003cp\u003eTogether, their forces moved upriver in the night, leaving behind the fighting Andorans, Cairhienin and Aiel. Creator shelter you, friends, Arganda thought.\u003c/p\u003e\n\u003cp\u003eThey crossed the dry riverbed and began moving up the northeastern slopes. It was quiet on top, at this end of the Heights, but the glow from lines of torches was evident.\u003c/p\u003e\n\u003cp\u003e\"That’s going to be a tough nut to crack, if those are Sharans up there\", Tam said softly, looking up the darkened slope.\u003c/p\u003e\n\u003cp\u003e\"Cauthon’s note said we’d have help\", Arganda replied.\u003c/p\u003e\n\u003cp\u003e\"What kind of help?\"\u003c/p\u003e\n\u003cp\u003e\"I don’t know. He didn’t—\"\u003c/p\u003e\n\u003cp\u003eThunder rumbled nearby, and Arganda winced. Most of the channelers were supposed to be fighting on the other side of the Heights, but that didn’t mean he wouldn’t see any here. He hated that feeling, the sensation that a channeler might be watching him, contemplating whether to kill him with fire, lightning or earth.\u003c/p\u003e\n\u003cp\u003eChannelers. The world would be just plain better without them. But that sound didn’t turn out to be thunder. A group of galloping riders bearing torches appeared from the night, crossing the riverbed to join Arganda and his men. They flew the Golden Crane at the center of an array of Borderlander banners.\u003c/p\u003e\n\u003cp\u003e\"Well I’ll be a bloody Trolloc\", Arganda called. \"You Borderlanders decided to join us?\"\u003c/p\u003e\n\u003cp\u003eLan Mandragoran saluted by torchlight, silvery sword glistening. He looked up the slope. \"So we\u0027re to fight here\".\u003c/p\u003e\n\u003cp\u003eArganda nodded.\u003c/p\u003e\n\u003cp\u003e\"Good\", Lan said softly from horseback. \"I just received reports about a large Sharan army moving northeast across the top of the Heights. Its clear to me they want to swing down around behind our people fighting the Trollocs at the river; then we’d be surrounded and at their mercy. Looks like its our job to keep t \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-254.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
