{"id":92198,"no":266,"title":"Page 266","content":"\u003cp\u003eBut . . . what was that weave? It was another that Logain did not recognize. The lightning hit Demandred, but vanished, somehow sent down into the ground and dissipated. Such a simple weave of Air and Earth, but it rendered the lightning useless.\u003c/p\u003e\n\u003cp\u003eA shield rammed between Logain and the Source. Through his wounded eyes, he watched the weave for balefire begin in Demandred\u0027s hands. Snarling, Logain grabbed a piece of shale from the ground beside him, the size of his fist, and hurled it at Demandred.\u003c/p\u003e\n\u003cp\u003eSurprisingly, the stone hit, ripping skin, causing Demandred to stumble back. The Forsaken was powerful, but he could still make the mistakes of common men. Never focus all of your attention on the One Power, despite what Taim had always said. In that moment of distraction, the shield between Logain and the Source vanished.\u003c/p\u003e\n\u003cp\u003eLogain rolled to the side, beginning two weaves. One, a shield of his own that he did not intend to use. The other, a desperate, final gateway. The coward’s choice.\u003c/p\u003e\n\u003cp\u003eDemandred growled, raising a hand to his face and lashing out with the Power. He chose to destroy the shield, immediately recognizing it as the greater risk. The gateway opened, and Logain rolled through, letting it snap closed. He collapsed on the other side, his flesh scalded, his arms flayed, his ears ringing, his sight almost gone.\u003c/p\u003e\n\u003cp\u003eHe forced himself to sit up, back in the Asha’man camp below the bogs where Gabrelle and the others awaited his return. He howled in anger. Gabrelle’s concern radiated through the bond. Real concern. He hadn\u0027t imagined it. Light.\u003c/p\u003e\n\u003cp\u003e\"Quiet\", she said, kneeling beside him. \"You fool. What have you done to yourself?\"\u003c/p\u003e\n\u003cp\u003e\"I have failed\", he said. Distantly, he felt the strikes of Demandred’s power begin again as he continued bellowing for Lews Therin. \"Heal me\".\u003c/p\u003e\n\u003cp\u003e\"You’re not going to try that again, are you?\" she said. \"I don’t want to Heal you only to let you—\"\u003c/p\u003e\n\u003cp\u003e\"I won’t try again\", Logain said, voice ragged. The pain was horrible, but it paled compared to the humiliation of defeat. \"I won’t, Gabrelle. Stop doubting my word. He’s too strong\".\u003c/p\u003e\n\u003cp\u003e\"Some of these burns are bad, Logain. These holes in your skin, I don’t know if I can Heal them completely. You will be scarred\".\u003c/p\u003e\n\u003cp\u003e\"That is fine\", he growled. That would be where the lava had splashed on his arm and the side of his face.\u003c/p\u003e\n\u003cp\u003eLight, he thought. How are we going to deal with that monster?\u003c/p\u003e\n\u003cp\u003eGabrelle put her hands on him and Healing weaves poured into his body.\u003c/p\u003e\n\u003cp\u003eThe thunder of Egwene’s battle with M’Hael rivaled that of the crashing clouds above. M’Hael. A new Forsaken, his name proclaimed by his Dreadlords across the battlefield.\u003c/p\u003e\n\u003cp\u003eEgwene wove without thought, hurling weave after weave toward the renegade Asha’man. She had not called upon the wind, but still it rushed and roared about her, whipping her hair and her dress, catching her stole and flipping it about. Narishma and Merise huddled with Leilwin on the ground beside her, Narishma’s voice—barely audible above the battle—calling out weaves as M’Hael crafted them.\u003c/p\u003e\n\u003cp\u003eFollowing her advance, Egwene stood upon the top of the Heights, on even ground with M’Hael. She knew, somewhere deep, that her body would need rest soon.\u003c/p\u003e\n\u003cp\u003eFor now, that was an unaffordable luxury. For now, only the fight mattered.\u003c/p\u003e\n\u003cp\u003eFire flared toward her, and she slapped it aside with Air. The sparks caught in the wind, swirling about her in a spray of light as she wove Earth. She sent a ripple through the already-broken ground, trying to knock M’Hael down, but he split the wave with a weave of his own.\u003c/p\u003e\n\u003cp\u003eHe’s slowing, she thought.\u003c/p\u003e\n\u003cp\u003eEgwene stepped forward, swollen with power. She began two weaves, one above each hand, and spouted fire at him.\u003c/p\u003e\n\u003cp\u003eHe responded with a bar of pure whiteness, wire-thin, which missed her by less than a handspan. The balefire left an afterimage in Egwene’s eyes, and the ground groaned beneath them as the air warped. Those spiderwebs sprang out across the ground, fractures into nothingness.\u003c/p\u003e\n\u003cp\u003e\"Fool!\" she yelled at him. \"You will destroy the Pattern itself!\" Already, their clash threatened that. This wind was not natural, this sizzling air. Those cracks in the ground spread from M’Hael, widening.\u003c/p\u003e\n\u003cp\u003e\"He’s weaving it again!\" Narishma cried, voice caught in the tempest.\u003c/p\u003e\n\u003cp\u003eM’Hael released this second weave of balefire, fracturing the ground, but Egwene was ready. She sidestepped, her anger building. Balefire. She needed to counter it!\u003c/p\u003e\n\u003cp\u003eThey don’t care what they ruin. They are here to destroy. That is their master’s call. Break. Burn down. Kill.\u003c/p\u003e\n\u003cp\u003eGawyn . . .\u003c/p\u003e\n\u003cp\u003eShe screamed in fury, weaving column after column of fire, one after another. Narishma shouted what M’Hael was doing, but Egwene couldn’t hear for the rush of sound in her ears. She saw soon, anyway, that he had constructed a barrier of Air and Fire to deflect her attacks.\u003c/p\u003e\n\u003cp\u003eEgwene strode forward, sending repeated strikes at him. That gave him no time to recover, no time to attack. She stopped the rhythm only to form a shield that she held at the ready. A spray of fire off his barrier made him stumble back, his weave cracking, and he raised his hand, perhaps to attempt balefire again.\u003c/p\u003e\n\u003cp\u003eEgwene slammed the shield between him and the Source. It didn’t quite cut him off, for he held it back by force of will. They were near enough now that she could see his incredulity, his anger. He fought back, but was weaker than she. Egwene pushed, bringing that shield closer and closer to the invisible thread that connected him to the One Power. She forced it with all her strength . . .\u003c/p\u003e\n\u003cp\u003eM’Hael, straining, released a small stream of balefire upward, through the gap where the shield had not yet fallen into place. The balefire destroyed the weave—as it did the air, and indeed, the Pattern itself.\u003c/p\u003e\n\u003cp\u003eEgwene stumbled back as M’Hael directed the weave toward her, but the white-hot bar was too small, too weak, to reach her. It faded away before hitting. M’Hael snarled, then vanished, warping the air in a form of Traveling Egwene did not know.\u003c/p\u003e\n\u003cp\u003eEgwene breathed deeply, holding her hand to her chest. Light! She had almost been obliterated from the Pattern.\u003c/p\u003e\n\u003cp\u003eHe disappeared without forming a gateway! The True Power, she thought. The only explanation. She knew next to nothing about it—it was the Dark One’s very essence, the lure that had coaxed channelers in the Age of Legends to drill the Bore in the first place.\u003c/p\u003e\n\u003cp\u003eBalefire. Light. I was almost dead. Worse than dead.\u003c/p\u003e\n\u003cp\u003eShe had no way to counter balefire.\u003c/p\u003e\n\u003cp\u003eIt’s only a weave . . . Only a wea \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-266.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
