{"id":91961,"no":27,"title":"Page 27","content":"\u003cp\u003e\"Give your reward to the men of the Band, Your Majesty. It was their work. And please, if you can do anything for Lord Talmanes . . \". He gestured to the fallen man whom several members of the Band had just carried through the gateway.\u003c/p\u003e\n\u003cp\u003eElayne knelt beside him, and Egwene joined her. At first, Egwene assumed that Talmanes was dead, with his skin blackened. Then he drew a ragged breath.\u003c/p\u003e\n\u003cp\u003e\"Light\", Elayne said, Delving his prostrate form. \"I’ve never seen anything like this\".\u003c/p\u003e\n\u003cp\u003e\"Thakan’dar blades\", Guybon said.\u003c/p\u003e\n\u003cp\u003e\"This is beyond either of us\", Egwene said to Elayne, standing. \"I . . \". She trailed off, hearing something over the groans of soldiers and carts creaking.\u003c/p\u003e\n\u003cp\u003e\"Egwene?\" Elayne asked softly.\u003c/p\u003e\n\u003cp\u003e\"Do what you can for him\", Egwene said, standing and rushing away. She pushed through the confused crowd, following the voice. Was that . . . yes, there. She found an open gateway at the edge of the Traveling grounds, Aes Sedai in a variety of clothing hurrying through to see to the wounded. Gawyn had done his work well.\u003c/p\u003e\n\u003cp\u003eNynaeve was asking, quite loudly, who was in charge of this mess. Egwene approached her from the side and grabbed her by the shoulder, surprising her.\u003c/p\u003e\n\u003cp\u003e\"Mother?\" Nynaeve asked. \"What is this about Caemlyn burning? I—\"\u003c/p\u003e\n\u003cp\u003eShe cut off as she saw the wounded. She stiffened, then tried to go to them.\u003c/p\u003e\n\u003cp\u003e\"There is one you need to see first\", Egwene said, leading her to where Talmanes lay.\u003c/p\u003e\n\u003cp\u003eNynaeve drew in a sharp breath, then went to her knees and pushed Elayne gently aside. Nynaeve Delved Talmanes, then froze, eyes wide.\u003c/p\u003e\n\u003cp\u003e\"Nynaeve?\" Egwene said. \"Can you—\"\u003c/p\u003e\n\u003cp\u003eAn explosion of weaves burst from Nynaeve like the sudden light of a sun coming out from behind clouds. Nynaeve wove the Five Powers together in a column of radiance, then sent it driving into Talmanes’ body.\u003c/p\u003e\n\u003cp\u003eEgwene left her to her work. Perhaps it would be enough, though he looked far gone. The Light willing, the man would live. She had been impressed with him in the past. He seemed precisely the type of man that the Band—and Mat—needed.\u003c/p\u003e\n\u003cp\u003eElayne was near the dragons and was questioning a woman with her hair in braids. That must be Aludra, who had created the dragons. Egwene walked up to the weapons, resting her fingers on one of the long bronze tubes. She had been given reports on them, of course. Some men said they were like Aes Sedai, cast in metal and fueled by the powders from fireworks.\u003c/p\u003e\n\u003cp\u003eMore and more refugees poured though the gateway, many of them townspeople. \"Light\", Egwene said to herself. \"There are too many of them. We cant house all of Caemlyn here at Merrilor\".\u003c/p\u003e\n\u003cp\u003eElayne finished her conversation, leaving Aludra to inspect the wagons. It appeared that the woman wasn’t willing to rest for the night and see to them in the morning. Elayne walked toward the gateways.\u003c/p\u003e\n\u003cp\u003e\"The soldiers say the area outside the city is secure\", Elayne said, passing Egwene. \"I’m going through to have a look\".\u003c/p\u003e\n\u003cp\u003e\"Elayne . . \". Birgitte said, coming up behind her.\u003c/p\u003e\n\u003cp\u003e\"We’re going! Come on\".\u003c/p\u003e\n\u003cp\u003eEgwene left the Queen to it, stepping back to supervise the work. Romanda had taken charge of the Aes Sedai and was organizing the injured, separating them into groups depending on the urgency of their wounds.\u003c/p\u003e\n\u003cp\u003eAs Egwene surveyed the chaotic mix, she noticed a pair of people standing nearby. A woman and man, Illianers by the looks of them. \"What do you two want?\"\u003c/p\u003e\n\u003cp\u003eThe woman knelt before her. The fair-skinned, dark-haired woman had a firmness to her features, despite her tall, slender build. \"I am Leilwin\", she said in an unmistakable accent. \"I was accompanying Nynaeve Sedai when the call for Healing was raised. We followed her here\".\u003c/p\u003e\n\u003cp\u003e\"You’re Seanchan\", Egwene said, startled.\u003c/p\u003e\n\u003cp\u003e\"I have come to serve you, Amyrlin Seat\".\u003c/p\u003e\n\u003cp\u003eSeanchan. Egwene still held the One Power. Light, not every Seanchan she met was dangerous to her; still, she would not take chances. As some members of the Tower Guard came through one of the gateways, Egwene pointed to the Seanchan pair. \"Take these somewhere safe and keep watch on them. I’ll deal with them later\".\u003c/p\u003e\n\u003cp\u003eThe soldiers nodded. The man went reluctantly, the woman more easily. She couldn’t channel, so she wasn’t a freed damane. That didn’t mean she wasn’t a sul’dam, though.\u003c/p\u003e\n\u003cp\u003eEgwene returned to Nynaeve, who still knelt beside Talmanes. The sickness had retreated from the man’s skin, leaving it pale. \"Take him somewhere to rest\", Nynaeve said tiredly to several watching members of the Band. \"I’ve done what I can\".\u003c/p\u003e\n\u003cp\u003eShe looked up at Egwene as the men carried him away. \"Light\", Nynaeve whispered, \"that took a lot out of me. Even with my angreal. I’m impressed that Moiraine managed it with Tam, all that time ago . . \". There seemed to be a note of pride in Nynaeve’s voice.\u003c/p\u003e\n\u003cp\u003eShe had wanted to heal Tam, but could not—though, of course, Nynaeve had not known what she had been doing at the time. She had come a long, long way since then.\u003c/p\u003e\n\u003cp\u003e\"Is it true, Mother?\" Nynaeve asked, rising. \"About Caemlyn?\"\u003c/p\u003e\n\u003cp\u003eEgwene nodded.\u003c/p\u003e\n\u003cp\u003e\"This is going to be a long night\", Nynaeve said, looking at the wounded still pouring through the gateways.\u003c/p\u003e\n\u003cp\u003e\"And a longer tomorrow\", Egwene said. \"Here, let us link. I’ll lend you my strength\".\u003c/p\u003e\n\u003cp\u003eNynaeve looked shocked. \"Mother?\"\u003c/p\u003e\n\u003cp\u003e\"You are better at Healing than I\". Egwene smiled. \"I may be Amyrlin, Nynaeve, but I am still Aes Sedai. Servant of all. My strength will be of use to you\".\u003c/p\u003e\n\u003cp\u003eNynaeve nodded and they linked. The two of them joined the group of Aes Sedai that Romanda had set Healing the refugees with the worst wounds.\u003c/p\u003e\n\u003cp\u003e\"Faile has been organizing my network of eyes-and-ears\", Perrin said to Rand as the two of them hurried toward Perrin’s camp. \"She might be there with them tonight. I’ll warn you, I’m not certain she likes you\".\u003c/p\u003e\n\u003cp\u003eShe would be a fool to like me, Rand thought. She probably knows what I’m going to require of you before this is over.\u003c/p\u003e\n\u003cp\u003e\"Well\", Perrin said, \"I guess that she does like that I know you. She’s cousin to a queen, after all. I think she still worries you’ll go mad and hurt me\".\u003c/p\u003e\n\u003cp\u003e\"The madness has already come\", Rand said, \"and I have it in my grip. As for hurting you, she’s probably right. I don’t think I can avoid hurting those around me. It was a ha \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-27.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
