{"id":92223,"no":291,"title":"Page 291","content":"\u003cp\u003eSnow-haired Rogosh watched the water flow, then nodded to Mat in respect. \"Well done, Gambler\", he said. The river’s return had divided the Shadow’s forces.\u003c/p\u003e\n\u003cp\u003eMat rejoined the battle. He noticed as he galloped across the plateau that the Sharans—what remained of them—were fleeing through gateways. He let them go.\u003c/p\u003e\n\u003cp\u003eWhen the Trollocs atop the Heights saw the Sharans fleeing, their resistance cracked, and they panicked. Boxed in and being swept across the plateau by Mat’s combined armies, they had no choice but to flee toward the long slope to the southwest.\u003c/p\u003e\n\u003cp\u003eIt had become total mayhem off the Heights. The Seanchan army had joined with Elayne’s, and both groups lit into the Trollocs with an intense fury. They formed a cordon around the beasts and advanced quickly, not allowing one to escape. The ground quickly turned to a deep, red mud as Trollocs fell by the thousands.\u003c/p\u003e\n\u003cp\u003eBut the engagement on the Shienaran side of the Mora was nothing compared to the struggle taking place on the other side of the river. The corridor between the bogs and Polov Heights was choked with Trollocs trying to escape the Seanchan attacking them from the far side of the corridor on the west.\u003c/p\u003e\n\u003cp\u003eThe vanguard sent in first against the Trollocs in the corridor was not composed of Seanchan soldiers, but squads of lopar and morat’lopar. On their hind legs, the lopar were no taller than Trollocs, but they outweighed them considerably. The lopar came at the Trollocs, raising up and slashing with their razor-sharp claws. Once a lopar softened up its prey, it grasped the Trolloc behind the neck with its paws and bit the beast’s head off at the neck. This gave the lopar great pleasure.\u003c/p\u003e\n\u003cp\u003eThe lopar were withdrawn as the corpses of Trollocs began to stack up at the far end of the corridor. Next into this pit of carnage came flocks of corlm, large, wingless, feathered creatures with long curved beaks designed to shred flesh. These carnivores easily ran over the stacks of corpses toward Trollocs still fighting, to separate the beasts’ meat from bone. The Seanchan soldiers took little part in these proceedings, only setting their pikes to ensure that no Trollocs escaped through the corridor or off the western side of the Heights. The creatures assaulting them so unnerved the Trollocs that few had any notion of running toward the Seanchan troops.\u003c/p\u003e\n\u003cp\u003eOn the slope, terror-stricken Trollocs, fleeing from Mat’s army charging down after them, threw themselves onto the Trollocs that filled the corridor. The monsters tumbled on top of one another, and they fought among themselves, trying to be the ones to reach the top of the pile and continue breathing a while longer.\u003c/p\u003e\n\u003cp\u003eTalmanes and Aludra had set up their dragons across from the corridor and commenced firing dragons’ eggs into the roiling masses of terrorized Trollocs.\u003c/p\u003e\n\u003cp\u003eIt was all over quickly. The numbers of living Trollocs diminished from the many thousands to the hundreds. Those that remained, seeing death snatching at them from three sides, fled into the bogs, where many of them were sucked down into the shallow waters. Their deaths were less violent, but equally horrifying. The remainder received a more merciful end, shot with arrows, spears and crossbow bolts as they slogged through the mire toward the sweet scent of freedom.\u003c/p\u003e\n\u003cp\u003eMat lowered his bloodied ashandarei. He checked the sky. The sun was hidden up there somewhere; he was not certain how long he had been riding with the heroes.\u003c/p\u003e\n\u003cp\u003eHe would have to thank Tuon for returning. He did not go looking for her, though. He had a feeling that she would expect him to perform his princely duties, whatever they might be.\u003c/p\u003e\n\u003cp\u003eOnly . . . he did feel that strange tugging inside. Getting stronger and stronger.\u003c/p\u003e\n\u003cp\u003eBlood and bloody ashes, Rand, Mat thought. I\u0027ve done my part. You do yours. Amaresu’s words returned to him. Each breath you take is at his forbearance, Gambler . . .\u003c/p\u003e\n\u003cp\u003eMat had been a good friend when Rand needed, had he not? Most of the time? Blood and ashes, you could not expect a fellow to not worry . . . maybe stay a little distant . . . when a madman was involved. Right?\u003c/p\u003e\n\u003cp\u003e\"Hawkwing!\" Mat called, riding up to the man. \"The battle\", Mat said, drawing a deep breath. \"It’s done, right?\"\u003c/p\u003e\n\u003cp\u003e\"You have sewn this one up tight, Gambler\", Hawkwing said, sitting his mount regally. \"Ah . . . what I would give to go at you across the battlefield. What a grand fight it would be\".\u003c/p\u003e\n\u003cp\u003e\"Great. Wonderful. I didn’t mean this battlefield. I mean the Last Battle. It’s done, right?\"\u003c/p\u003e\n\u003cp\u003e\"You ask that under a sky of shadow, atop an earth that trembles in fear? What does your soul say, Gambler?\"\u003c/p\u003e\n\u003cp\u003eThose dice still tumbled inside of Mat’s head.\u003c/p\u003e\n\u003cp\u003e\"My soul says I’m a fool\", Mat growled. \"That, and a bloody sparring dummy, set up and waiting to be attacked\". He turned northward. \"I need to go to Rand. Hawkwing, would you do me a favor?\"\u003c/p\u003e\n\u003cp\u003e\"Ask it, Hornblower\".\u003c/p\u003e\n\u003cp\u003e\"Do you know the Seanchan?\"\u003c/p\u003e\n\u003cp\u003e\"I am . . . familiar with them\".\u003c/p\u003e\n\u003cp\u003e\"I think their Empress would like very much to make your acquaintance\", Mat said, galloping away. \"If you could go to speak with her, I’d appreciate it. And if you do, kindly tell her I sent you\".\u003c/p\u003e\n\u003cp\u003eYOU THINK I WILL RETREAT? the Dark One asked.\u003c/p\u003e\n\u003cp\u003eThe thing that spoke those words was something that Rand could never truly comprehend. Even seeing the universe in its entirety did not allow him to understand Evil itself.\u003c/p\u003e\n\u003cp\u003eI NEVER EXPECT YOU TO RETREAT, Rand said. I BELIEVE YOU INCAPABLE OF IT. I WISH YOU COULD SEE, COULD KNOW, WHY IT IS YOU CONTINUE TO LOSE.\u003c/p\u003e\n\u003cp\u003eBeneath them, on the battlefield, the Trollocs had fallen, beaten by a young gambler from the Two Rivers. The Shadow shouldn’t have lost. It made no sense. The Trollocs had the greater force.\u003c/p\u003e\n\u003cp\u003eHowever, Trollocs fought only because the Myrddraal forced them—on its own, a Trolloc would no more fight something stronger than a fox would attempt to kill a lion.\u003c/p\u003e\n\u003cp\u003eIt was one of the most basic rules among predators. Eat that which was weaker than you. Flee from that stronger than you.\u003c/p\u003e\n\u003cp\u003eThe Dark One seethed with a boiling anger that Rand felt in this place as a physical force.\u003c/p\u003e\n\u003cp\u003eYOU SHOULD NOT BE SURPRISED, Rand said. WHEN HAVE YOU EVER INSPIRED THE BEST IN MEN? YOU CANNOT. IT IS OUTSIDE YOUR POWER, SHAI\u0027TAN. YOUR MINIONS WILL NEVER FIGHT ON WHEN HOPE IS LOST. THEY WILL NEVER STAND BECAUSE DOING SO IS RIGHT. IT IS NOT STRENGTH THAT BEATS YOU. IT IS NOBILITY.\u003c/p\u003e\n\u003cp\u003eI WILL DESTROY! I WILL REND AND BURN! I WILL BRING DARKNESS TO ALL, AND DEATH WILL BE THE TRUMPET I SOUND BEFORE MY ARRIVAL! AND YOU, ADVERSARY . . . OTHERS MAY ESCAPE, BUT YOU WILL \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-291.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
