{"id":91964,"no":30,"title":"Page 30","content":"\u003cp\u003e\"Do you want to know the thing that twists my brain in knots, Perrin?\" Rand said softly. \"The thing that gives me shivers, like the cold breath of the Shadow itself? The taint is what made me mad and what gave me memories from my past life. They came as Lews Therin whispering to me. But that very insanity is the thing giving me the clues I need to win. Don’t you see? If I win this, it will be the taint itself that led to the Dark One’s fall\".\u003c/p\u003e\n\u003cp\u003ePerrin whistled softly.\u003c/p\u003e\n\u003cp\u003eRedemption, Rand thought. When I tried this last time, my madness destroyed us. This time, it will save us.\u003c/p\u003e\n\u003cp\u003e\"Go to your wife, Perrin\", Rand said, glancing at the sky. \"This is the last night of anything resembling peace you shall know before the end. I’ll investigate and see how bad things are in Andor\". He looked back at his friend. \"I will not forget my promise. Unity must come before all else. I lost last time precisely because I threw unity aside\".\u003c/p\u003e\n\u003cp\u003ePerrin nodded, then rested a hand on Rand’s shoulder. \"The Light illumine you\".\u003c/p\u003e\n\u003cp\u003e\"And you, my friend\".\u003c/p\u003e\n\u003cp\u003eCHAPTER 2\u003c/p\u003e\n\u003cp\u003eThe Choice of an Ajah\u003c/p\u003e\n\u003cp\u003ePevara did her very best to pretend that she was not terrified.\u003c/p\u003e\n\u003cp\u003eIf these Asha’man had known her, they’d have realized that sitting still and quiet was not her natural state. She retreated to basic Aes Sedai training: appearing in control when she felt anything but.\u003c/p\u003e\n\u003cp\u003eShe forced herself to rise. Canler and Emarin had withdrawn to visit the Two Rivers lads and make sure they were going about in pairs. That left only her and Androl again. He quietly tinkered with his leather straps as the rain continued outside. He used two needles at once to stitch, crossing the holes on either side. The man had the concentration of a master craftsman.\u003c/p\u003e\n\u003cp\u003ePevara strolled over, causing him to look up sharply when she drew close. She smothered a smile. She might not look it, but she could move silently, when necessary.\u003c/p\u003e\n\u003cp\u003eShe stared out of the windows. The rain had grown worse, splashing curtains of water against the glass. \"After so many weeks of looking as if it would storm at any moment, it finally comes\".\u003c/p\u003e\n\u003cp\u003e\"Those clouds had to break open eventually\", Androl said.\u003c/p\u003e\n\u003cp\u003e\"The rain doesn’t feel natural\", she said, hands clasped behind her. She could feel the coldness through the glass. \"It doesn’t ebb and flow. Just the same steady torrent. A great deal of lightning, but very little thunder.\u003c/p\u003e\n\u003cp\u003e\"You think it’s one of those?\" Androl asked. He didn’t need to say what \"those\" meant. Earlier in the week, common people in the Tower—none of the Asha’man—had begun bursting into flame. Just . . . flame, inexplicably. They’d lost some forty people. Many still blamed a rogue Asha’man, though the men had sworn nobody had been channeling nearby.\u003c/p\u003e\n\u003cp\u003eShe shook her head, watching a group of people trudge past on the muddy street outside. She had been one of those, at first, who had called the deaths the work of an Asha’man gone mad. Now she accepted these events, and other oddities, as something far worse.\u003c/p\u003e\n\u003cp\u003eThe world was unraveling.\u003c/p\u003e\n\u003cp\u003eShe needed to be strong. Pevara herself had devised the plan of bringing women here to bond these men, though Tarna had suggested it. She couldn’t let them discover how disturbing she found it to be trapped in here, facing down enemies who could force a person to the Shadow. Her only allies men who, only months ago, she would have pursued with diligence and gentled without remorse.\u003c/p\u003e\n\u003cp\u003eShe sat down on the stool Emarin had used earlier. \"I would like to discuss this ‘plan’ you are developing\".\u003c/p\u003e\n\u003cp\u003e\"I’m not sure I’ve actually developed one yet, Aes Sedai\".\u003c/p\u003e\n\u003cp\u003e\"I might be able to offer some suggestions\".\u003c/p\u003e\n\u003cp\u003e\"I wouldn’t say no to hearing them\", Androl said, though he narrowed his eyes.\u003c/p\u003e\n\u003cp\u003e\"What’s wrong?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Those people outside. I don’t recognize them. And . . \".\u003c/p\u003e\n\u003cp\u003eShe looked back out the window. The only light came from buildings, shining an occasional red-orange glow into the drenched night. The passersby still moved very slowly down the street, in and out of the light of windows.\u003c/p\u003e\n\u003cp\u003e\"Their clothing isn’t wet\", Androl whispered.\u003c/p\u003e\n\u003cp\u003eWith a chill, Pevara realized he was right. The man at the front walked with a wide-brimmed, drooping hat on his head, but it didn’t break the rain or stream water. His rustic clothing was untouched by the downpour. And the dress of the woman beside him wasn’t blowing at all in the wind. Now Pevara saw that one of the younger men was holding his hand behind him, as if pulling the reins of a pack animal—but there was no animal there.\u003c/p\u003e\n\u003cp\u003ePevara and Androl watched in silence until the figures passed too far into the night to be seen. Visions of the dead were growing increasingly common.\u003c/p\u003e\n\u003cp\u003e\"You said you had a suggestion?\" Androl’s voice trembled.\u003c/p\u003e\n\u003cp\u003e\"I . . . Yes\". Pevara tore her eyes away from the window. \"So far, Taim’s focus has been on the Aes Sedai. My sisters have all been taken. I am the last\".\u003c/p\u003e\n\u003cp\u003e\"You’re offering yourself as bait\".\u003c/p\u003e\n\u003cp\u003e\"They will come for me\", she said. \"It is only a matter of time\".\u003c/p\u003e\n\u003cp\u003eAndrol fingered the leather strap and looked pleased with it. \"We should sneak you out\".\u003c/p\u003e\n\u003cp\u003e\"Is that so?\" she said, eyebrow raised. \"I have been elevated to the position of maiden in need of rescue, have I? Very valiant of you\".\u003c/p\u003e\n\u003cp\u003eHe blushed. \"Sarcasm? From an Aes Sedai? I wouldn’t have thought I’d hear that\".\u003c/p\u003e\n\u003cp\u003ePevara laughed. \"Oh my, Androl. You really don’t know anything about us, do you?\"\u003c/p\u003e\n\u003cp\u003e\"Honestly? No. I’ve avoided your kind for most of my life\".\u003c/p\u003e\n\u003cp\u003e\"Well, considering your . . . innate tendencies, perhaps that was wise\".\u003c/p\u003e\n\u003cp\u003e\"I couldn’t channel before\".\u003c/p\u003e\n\u003cp\u003e\"But you suspected. You came here to learn\".\u003c/p\u003e\n\u003cp\u003e\"I was curious\", he said. \"It’s something I hadn’t tried before\".\u003c/p\u003e\n\u003cp\u003eInteresting, Pevara thought. Is that what drives you then, leatherworker? What has set you drifting on the winds, from place to place?\u003c/p\u003e\n\u003cp\u003e\"I suspect\", she said, \"you have never tried jumping off a cliff before. The fact that you haven’t done something shouldn’t always be a reason to try it\".\u003c/p\u003e\n\u003cp\u003e\"Actually, I have jumped off a cliff. Several of them\".\u003c/p\u003e\n\u003cp\u003eShe raised an eyebrow at him.\u003c/p\u003e\n\u003cp\u003e\"The Sea Folk do it\", he explained. \"Off into the ocean. The braver you are, the higher the cliff you choose. And you have changed the topic of the conversation again, Pevara Sedai. You are qui \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-30.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
