{"id":91965,"no":31,"title":"Page 31","content":"\u003cp\u003e\"Thank you\".\u003c/p\u003e\n\u003cp\u003e\"The reason\", he said, holding up a finger, \"that I suggested we sneak you out is because this isn’t your battle. You shouldn’t have to fall here\".\u003c/p\u003e\n\u003cp\u003e\"It isn’t because you want to hurry an Aes Sedai away, out of meddling in your business?\"\u003c/p\u003e\n\u003cp\u003e\"I came to you for help\", Androl said. \"I don’t want to be rid of you; I’ll happily use you. However, if you fall here, you do so in a fight that is not your own. That isn’t fair\".\u003c/p\u003e\n\u003cp\u003e\"Let me explain something to you, Asha’man\", Pevara said, leaning in. \"This is my fight. If the Shadow takes this tower, it will mean terrible things for the Last Battle. I have accepted responsibility for you and yours; I will not turn away from it so easily\".\u003c/p\u003e\n\u003cp\u003e\"You’ve accepted responsibility’ for us? What does that mean?\"\u003c/p\u003e\n\u003cp\u003eAh, perhaps I shouldn’t have shared that. Still, if they were going to be allies, perhaps he needed to know.\u003c/p\u003e\n\u003cp\u003e\"The Black Tower needs guidance\", she explained.\u003c/p\u003e\n\u003cp\u003e\"So that’s the point of bonding us?\" Androl asked. \"So we can be . . . corralled, like stallions to be broken?\"\u003c/p\u003e\n\u003cp\u003e\"Don’t be a fool. Surely you admit the value of the White Tower’s experience\".\u003c/p\u003e\n\u003cp\u003e\"I’m not sure I’d say that\", Androl said. \"With experience comes a determination to be set in your ways, to avoid new experiences. You Aes Sedai all assume that the way things have been done is the only way to do them. Well, the Black Tower will not be subject to you. We can look after ourselves\".\u003c/p\u003e\n\u003cp\u003e\"And you’ve done a wonderful job of that so far, haven’t you?\"\u003c/p\u003e\n\u003cp\u003e\"That was unfair\", he said softly.\u003c/p\u003e\n\u003cp\u003e\"Perhaps it was\", she admitted. \"I’m sorry\".\u003c/p\u003e\n\u003cp\u003e\"Your motivations don’t surprise me\", he said. \"What you were doing here was obvious to the weakest of soldiers. The question I’ve had is this: Why, of all women, did the White Tower send Red sisters to bond us?\"\u003c/p\u003e\n\u003cp\u003e\"Who better? Our entire lives have been dedicated to dealing with men who can channel\".\u003c/p\u003e\n\u003cp\u003e\"Your Ajah is doomed\".\u003c/p\u003e\n\u003cp\u003e\"Is that so?\"\u003c/p\u003e\n\u003cp\u003e\"You exist to hunt down men who can channel\", he said. \"To gentle them. See them . . . disposed of. Well, the Source is cleansed—\"\u003c/p\u003e\n\u003cp\u003e\"So you all say\".\u003c/p\u003e\n\u003cp\u003e\"It is cleansed, Pevara. All things come and pass, and the Wheel turns. It was once pure, so it must someday be pure again. It has happened\".\u003c/p\u003e\n\u003cp\u003eAnd the way you look at shadows, Androl? Is that a sign of purity? The way that Nalaam mutters in unknown languages? Do you think we don\u0027t notice such things?\u003c/p\u003e\n\u003cp\u003e\"You have two choices, as an Ajah\", Androl continued. \"You can either continue to hunt us—ignoring the proof that we offer, that the Source is cleansed—or you can give up on being Red Ajah\".\u003c/p\u003e\n\u003cp\u003e\"Nonsense. Of all Ajahs, the Reds should be your greatest ally\".\u003c/p\u003e\n\u003cp\u003e\"You exist to destroy us!\"\u003c/p\u003e\n\u003cp\u003e\"We exist to make certain that men who can channel do not accidentally hurt themselves or those around them. Would you not agree that is a purpose of the Black Tower as well?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose that might be part of it. The only purpose I have been told was that we are to be a weapon for the Dragon Reborn, but keeping good men from hurting themselves without proper training is important as well\".\u003c/p\u003e\n\u003cp\u003e\"Then we can unite on that idea, can we not?\"\u003c/p\u003e\n\u003cp\u003e\"I would like to believe that, Pevara, but I’ve seen the way you and yours look at us. You see us as . . . as some stain that needs to be cleansed, or poison to be bottled\".\u003c/p\u003e\n\u003cp\u003ePevara shook her head. \"If what you say is true, and the Source is cleansed, then changes will come, Androl. The Red Ajah and the Asha’man will grow together in common purpose, over time. I’m willing to work with you now, here\".\u003c/p\u003e\n\u003cp\u003e\"Contain us\".\u003c/p\u003e\n\u003cp\u003e\"Guide you. Please. Trust me\".\u003c/p\u003e\n\u003cp\u003eHe studied her by the light of the room’s many lamps. He did have a sincere face. She could see why the others followed him, though he was weakest among them. He had a strange mixture of passion and humility. If only he hadn’t been one of. . . well . . . what he was.\u003c/p\u003e\n\u003cp\u003e\"I wish I could believe you\", Androl said, looking away. \"You’re different from the others, I’ll admit. Not like a Red at all\".\u003c/p\u003e\n\u003cp\u003e\"I think you’ll find we’re more varied than you suppose\", Pevara said. \"There isn’t one single motive that makes a woman choose the Red\".\u003c/p\u003e\n\u003cp\u003e\"Other than hatred of men\".\u003c/p\u003e\n\u003cp\u003e\"If we hated you, would we have come here looking to bond you?\" That was a sidestep, in truth. Though Pevara herself did not hate men, many Reds did—at the very least, many regarded men with suspicion. She hoped to change that.\u003c/p\u003e\n\u003cp\u003e\"Aes Sedai motivations are odd sometimes\", Androl said. \"Everyone knows that. Anyway, different though you are from many of your sisters, I’ve seen that look in your eyes\". He shook his head. \"I won’t believe you’re here to help us. No more than I believed that the Aes Sedai who hunted down male channelers really thought they were helping the men. No more than I believe a headsman thinks he’s doing a criminal a favor by killing him. Just because a thing needs to be done doesn’t make the one doing it a friend, Pevara Sedai. I’m sorry\".\u003c/p\u003e\n\u003cp\u003eHe turned back to his leather, working by the close light of a lantern on the table.\u003c/p\u003e\n\u003cp\u003ePevara found her annoyance rising. She’d almost had him. She liked men; she had often thought Warders would be useful. Couldn’t the fool recognize a hand extended across the chasm when he saw it?\u003c/p\u003e\n\u003cp\u003eCalm yourself, Pevara, she thought. You won’t get anywhere if anger rules you. She needed this man on her side.\u003c/p\u003e\n\u003cp\u003e\"That will be a saddle, won’t it?\" she said.\u003c/p\u003e\n\u003cp\u003e\"Yes\".\u003c/p\u003e\n\u003cp\u003e\"You’re staggering the stitches\".\u003c/p\u003e\n\u003cp\u003e\"It’s my own method\", he said. \"Helps prevent rips from spreading. I think it looks nice, too\".\u003c/p\u003e\n\u003cp\u003e\"Good linen thread, I assume? Waxed? And do you use a single lacing chisel for those holes, or a double? I didn’t get a good look\".\u003c/p\u003e\n\u003cp\u003eHe glanced at her, wary. \"You know leatherworking?\"\u003c/p\u003e\n\u003cp\u003e\"From my uncle\", she said. \"He taught me a few things. Let me work in the shop, when I was little\".\u003c/p\u003e\n\u003cp\u003e\"Maybe I’ve met him\".\u003c/p\u003e\n\u003cp\u003eShe fell still. For all Androl’s comments that she was good at steering a conversation, she had blundered this one directly into places she \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-31.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
