{"id":92013,"no":79,"title":"Page 79","content":"\u003cp\u003eAndrol remembered . . . Taim yelling the day before. He railed against the men, claiming their work went too slowly. They had expended much strength on the first men and women they’d Turned, and now they were apparently having a more difficult time.\u003c/p\u003e\n\u003cp\u003ePevara slept. The tea had knocked her out. They’d given it to Androl after her, but almost as an afterthought. They seemed to forget about him much of the time. Taim had actually been angry when he’d found his minions had given the tea to Pevara. He’d wanted to Turn her next, apparently, and the process required the victim to be able to channel.\u003c/p\u003e\n\u003cp\u003e\"Release me!\"\u003c/p\u003e\n\u003cp\u003eAndrol twisted at the new voice. Abors and Mishraile pulled someone in through the door, a short woman with coppery skin. Toveine, one of the Aes Sedai that Logain had bonded.\u003c/p\u003e\n\u003cp\u003eNearby, Logain—eyes closed, looking as if he’d been beaten by a mob of angry men—stirred.\u003c/p\u003e\n\u003cp\u003e\"What are you doing!\" Toveine demanded. \"Light! I—\" She cut off as Abors gagged her. The thick-browed man was one of those who had gone to Taim willingly, during the days before Turning had begun.\u003c/p\u003e\n\u003cp\u003eAndrol tried, thoughts still cloudy, to pull his hands free from the bonds. The ropes were bound more tightly. That was right. Evin had noticed the bonds and retied them.\u003c/p\u003e\n\u003cp\u003eHe felt so helpless. Useless. He hated that feeling. If there was one thing Androl had dedicated his life to, it was to never being useless. Always knowing something about the situation.\u003c/p\u003e\n\u003cp\u003e\"Turn her next\", Taim’s voice said.\u003c/p\u003e\n\u003cp\u003eAndrol twisted, craning his neck. Taim sat at the table. He liked to be there for the Turnings, but he wasn’t watching Toveine. He fondled something in his hands. Some kind of disc . . .\u003c/p\u003e\n\u003cp\u003eHe stood up suddenly, tucking the object into a pouch at his waist. \"The others complain about exhaustion from so much Turning. Well, if they Turn this one, she can join their ranks and lend her strength. Mishraile, you come with me. It’s time\".\u003c/p\u003e\n\u003cp\u003eMishraile and several others joined Taim; they’d been standing where Androl couldn’t see them.\u003c/p\u003e\n\u003cp\u003eTaim stalked toward the door. \"I want that woman Turned by the time I get back\", he said.\u003c/p\u003e\n\u003cp\u003eLan galloped across the rocky ground, riding toward the Gap for what seemed like the hundredth time, though he had been fighting here less than a week.\u003c/p\u003e\n\u003cp\u003ePrince Kaisel and King Easar fell in beside him, riding hard. \"What is it, Dai Shan?\" Kaisel yelled. \"Another attack? I did not see the emergency signal!\"\u003c/p\u003e\n\u003cp\u003eLan leaned down grimly in the dusk, bonfires made of carcasses and wood blazing to either side of him as he led the charge of several hundred Malkieri. Burning carcasses was difficult, but not only did they need the light; they wanted to deny the Trollocs some meals.\u003c/p\u003e\n\u003cp\u003eLan heard something ahead, something that horrified him. Something he had been dreading.\u003c/p\u003e\n\u003cp\u003eExplosions.\u003c/p\u003e\n\u003cp\u003eThe distant eruptions sounded like boulders crashing against one another. Each one made the air shake.\u003c/p\u003e\n\u003cp\u003e\"Light!\" Queen Ethenielle of Kandor joined them, galloping on her white gelding. She yelled to him. \"Is that what I think it is?\"\u003c/p\u003e\n\u003cp\u003eLan nodded. Enemy channelers.\u003c/p\u003e\n\u003cp\u003eEthenielle called back to her retinue, yelling something he did not catch. She was a plump woman, somewhat matronly for a Borderlander. Her retinue included Lord Baldhere—her Swordbearer—and the grizzled Kalyan Ramsin, her new husband.\u003c/p\u003e\n\u003cp\u003eThey approached the Gap, where warriors fought to keep the beasts contained. A group of Kandori riders near the bonfires at the front were suddenly thrown into the air.\u003c/p\u003e\n\u003cp\u003e\"Lord Mandragoran!\" A figure in a black coat waved to them. Narishma hurried up, his Aes Sedai accompanying him. Lan always had one channeler at the front lines, but had given them orders not to fight. He needed them fresh for emergencies.\u003c/p\u003e\n\u003cp\u003eLike this one.\u003c/p\u003e\n\u003cp\u003e\"Channeling?\" Lan asked, slowing Mandarb.\u003c/p\u003e\n\u003cp\u003e\"Dreadlords, Dai Shan\", Narishma said, panting. \"Maybe as many as two dozen\".\u003c/p\u003e\n\u003cp\u003e\"Twenty or more channelers\", Agelmar said. \"They’ll cut through us like a sword through a spring lamb\".\u003c/p\u003e\n\u003cp\u003eLan looked across the bitter landscape, once his homeland. A homeland he’d never known.\u003c/p\u003e\n\u003cp\u003eHe would have to abandon Malkier. Admitting it felt like a knife twisting inside him, but he would do it. \"You have your retreat, Lord Agelmar\", Lan said. \"Narishma, can you channelers do anything?\"\u003c/p\u003e\n\u003cp\u003e\"We can try to cut their weaves from the air if we ride up close enough\", Narishma said. \"But that will be hard, perhaps impossible, with them using just ribbons of Fire and Earth. Besides, with so many on their side . . . well, they’ll target us. I fear we would be cut down—\"\u003c/p\u003e\n\u003cp\u003eA nearby blast rocked the earth, and Mandarb reared, nearly throwing Lan to the ground. Lan fought the horse, nearly blind from the flash of light. \"Dai Shan!\" Narishma’s voice.\u003c/p\u003e\n\u003cp\u003eLan blinked tears from his eyes.\u003c/p\u003e\n\u003cp\u003e\"Go to Queen Elayne!\" Lan bellowed. \"Bring back channelers to cover our retreat. We’ll be cut to ribbons without them. Go, man!\"\u003c/p\u003e\n\u003cp\u003eAgelmar was yelling the retreat, bringing forward archers to target the channelers and drive them beneath cover. Lan unsheathed his sword, galloping to bring the horsemen back.\u003c/p\u003e\n\u003cp\u003eLight protect us, Lan thought, yelling himself ragged and salvaging what he could of his cavalry. The Gap was lost.\u003c/p\u003e\n\u003cp\u003eElayne waited nervously just inside Braem Wood.\u003c/p\u003e\n\u003cp\u003eIt was an old forest, the type that seemed to have a soul of its own. The ancient trees were its gnarled fingers, reaching out of the earth to feel the wind.\u003c/p\u003e\n\u003cp\u003eIt was difficult not to feel tiny in a wood like Braem. Though many of the trees were bare, Elayne could feel a thousand eyes watching her from the depths of the forest. She found herself thinking of the stories told to her as a child, stories of the Wood being full of brigands—some goodly, others with hearts as twisted as those of Darkfriends.\u003c/p\u003e\n\u003cp\u003eIn fact. . . Elayne thought, remembering one of the stories. She turned to Birgitte. \"Didn’t you once lead a band of thieves out of this forest?\" Birgitte grimaced. \"I was hoping you hadn’t heard that one\".\u003c/p\u003e\n\u003cp\u003e\"You robbed the Queen of Aldeshar!\" Elayne said.\u003c/p\u003e\n\u003cp\u003e\"I was very polite about it\", Birgitte said. \"She wasn’t a good queen. Many claimed she wasn’t the rightful one\".\u003c/p\u003e\n\u003cp\u003e\"It’s the principle!\"\u003c/p\u003e\n\u003cp\u003e\"That’s exactly why I did it\". Birgitte frowned. \"At least . . . I think it was . . \".\u003c/p\u003e\n\u003cp\u003eElayne didn’t push the topic any farther. Birgitte always grew anxious when reminded that her memories of past lives were fading. At times, she had no recollection of her past lives at all; at other times, certain incidents would come flooding back to her, only to d \u003c/p\u003e","sourceLink":"https://allnovel.net/a-memory-of-light-the-wheel-of-time-14/page-79.html","bookId":1601,"creation":"Oct 5, 2019 5:54:25 PM","modification":"Oct 5, 2019 5:54:25 PM"}
