{"id":89314,"no":10,"title":"Page 10","content":"\u003cp\u003e“I’ll be the last to retire,” he said as he walked to the door. “I’ll set the alarm then. Please remember not to open any windows.”\u003c/p\u003e\n\u003cp\u003e“What happens if the alarm goes off? Who will hear it?” she asked. “We’re out in the middle of nowhere.”\u003c/p\u003e\n\u003cp\u003e“The alarm is electronically connected to the spa. I thought I had mentioned that before. Should we need it, help will arrive in less than three minutes.”\u003c/p\u003e\n\u003cp\u003e“The spa’s that close?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “If it weren’t for the trees, you’d be able to see the domes from your window. Would you like me to close the drapes?”\u003c/p\u003e\n\u003cp\u003e“No. I prefer them open.” She turned away, gripping the bedpost now as the bile came rushing up into her throat. She was going to ask him where the servant quarters were located, but her throat burned too much to get the question out.\u003c/p\u003e\n\u003cp\u003e“Good night,” she said. “Close the door behind you, please.”\u003c/p\u003e\n\u003cp\u003eThe second she heard the door click shut, she bolted from the bed and ran into the bathroom, one hand covering her mouth. She barely got the lid up in time before she threw up the canapé she’d eaten. The damn car sickness. She’d had the problem since she was a child. She should have spoken up and explained she couldn’t sit in the backseat. Worried what the others would think of her, she hadn’t said a word.\u003c/p\u003e\n\u003cp\u003eWhat the hell was the matter with her? What did she care what strangers thought about her? She would probably never see them again after breakfast.\u003c/p\u003e\n\u003cp\u003eHer stomach heaved at the thought of food. She hadn’t felt this ill in years, not since that horrid case of food poisoning. Avery was fourteen at the time, and she’d stayed home from school to help take care of Carrie. Tony had been a real gem back then too. She remembered how he’d held her when the chills got so bad.\u003c/p\u003e\n\u003cp\u003eCarrie felt too weak to take a shower. She brushed her teeth, washed her face, and put on her nightgown. She stumbled back into the bedroom, heard the clinking of glasses, and assumed that Monk was cleaning up. Then she heard a woman’s laughter. Was the maid flirting with him? Might as well, she thought. There wasn’t anything else for them to do, since she and Anne and Sara were already going to bed. My heavens, it wasn’t even nine o’clock yet, and she was so exhausted, she could barely focus.\u003c/p\u003e\n\u003cp\u003eThe room kept spinning. God, she felt awful. She fell into bed, struggled to get the covers up, and tried resting on her side. The nausea was still coming in waves. She slowly, carefully rolled onto her back. That was better, much better. She closed her eyes and fell asleep.\u003c/p\u003e\n\u003cp\u003eShe didn’t know how long she’d slept, but it was dark in the room when she heard someone faintly calling out to her. She couldn’t respond. Then she heard a clicking sound over and over. No, the noise was snapping, like fingers coming together, or clinking, like knives being sharpened. Carrie couldn’t understand why the noise wouldn’t stop.\u003c/p\u003e\n\u003cp\u003eSomeone nudged her shoulder, calling her name again.\u003c/p\u003e\n\u003cp\u003eShe couldn’t summon the strength to open her eyes. “Yes?” she whispered.\u003c/p\u003e\n\u003cp\u003e“Carrie.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eThe noise made it difficult for her to concentrate. And, oh, she was so sleepy. She tried but couldn’t even raise her hand to cover her eyes when a light went on.\u003c/p\u003e\n\u003cp\u003e“Go away,” she said, her voice a croak.\u003c/p\u003e\n\u003cp\u003e“I heard your toast, Carrie. Do you remember what you said?”\u003c/p\u003e\n\u003cp\u003e“No . . .”\u003c/p\u003e\n\u003cp\u003e“May all your dreams come true. But what about your nightmares? Those come true too.”\u003c/p\u003e\n\u003cp\u003eThe words weren’t making any sense. “What? Nightmares? No . . . no nightmares.”\u003c/p\u003e\n\u003cp\u003e“Open your eyes, Carrie.”\u003c/p\u003e\n\u003cp\u003eThe sound was getting louder. “Come on. Look at me.”\u003c/p\u003e\n\u003cp\u003eThe voice floating above her became more demanding, more menacing. Carrie was finally able to open her eyes a little. She saw the scissors opening and closing in front of her face. They were shiny. That was the snapping noise, she realized. But why were there scissors?\u003c/p\u003e\n\u003cp\u003eAnd then the noise stopped, and the scissors vanished. A face appeared just inches above her own, and that smile, that hideous, gloating smile that was horrifically familiar.\u003c/p\u003e\n\u003cp\u003eShe tried to scream. “No . . . no . . . no . . . oh, my God, help me . . . no . . . Jilly.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eAVERY LOST TRACK OF THE TIME. SHE WAS FRANTIC TO GET as much work done as possible before she had to leave for the airport. Her desk had been clear when she’d left the night before. She’d gotten to the office at six-thirty that morning just so everything would be caught up.\u003c/p\u003e\n\u003cp\u003eShe was so bleary-eyed now she could barely focus on her computer screen. And doing a slow burn. Someone, she didn’t know who the culprit was, had dumped twenty-two files on her desk, and she was expected to transfer all the information into the database. She also had at least sixty e-mails to read and answer, and she hadn’t remembered to check her private voice mail in over twenty-four hours.\u003c/p\u003e\n\u003cp\u003eHer cubicle still looked like a cyclone had hit. The files seemed to be multiplying, and how was that possible?\u003c/p\u003e\n\u003cp\u003e“Aren’t you supposed to be on a plane?” Margo asked. She was juggling a stack of files, her empty water bottle, and a doughnut box.\u003c/p\u003e\n\u003cp\u003e“I’ve got a little time left,” Avery answered as she typed a reply to one of her e-mails.\u003c/p\u003e\n\u003cp\u003eLou stood and stretched his arms. “Margo, are there any Krispy Kremes left?”\u003c/p\u003e\n\u003cp\u003e“One,” she answered. “Avery didn’t eat hers.”\u003c/p\u003e\n\u003cp\u003e“Help yourself,” Avery said.\u003c/p\u003e\n\u003cp\u003eLou grabbed the box out of Margo’s arms and opened it. “When are you leaving?”\u003c/p\u003e\n\u003cp\u003e“Soon.”\u003c/p\u003e\n\u003cp\u003e“Flying?”\u003c/p\u003e\n\u003cp\u003e“Of course she’s flying,” Margo said.\u003c/p\u003e\n\u003cp\u003e“I’ve got it all figured out down to the minute. If I leave at four-fifteen on the dot, I’ll have time to drive home, change clothes, and pick up my luggage, then take the interstate to the airport, park in long-term, and make it to the gate in plenty of time.”\u003c/p\u003e\n\u003cp\u003eMargo took her purse from her drawer and came back around the corner. “Hey, Avery, did you have time to call Mrs. Speigel’s caretaker and tell her to do a better job of hiding those car keys?”\u003c/p\u003e\n\u003cp\u003e“No, I forgot.”\u003c/p\u003e\n\u003cp\u003e“You want me to look up her phone number and call her? She’s got to do something to protect the public from that woman.”\u003c/p\u003e\n\u003cp\u003e“I’d appreciate it if you would call,” Avery said. “But don’t be bossy, Margo. Mrs. Speigel’s a sweetheart. She knows she shouldn’t be driving, but sometimes she gets confused.”\u003c/p\u003e\n\u003cp\u003e“Avery, she almost killed you.” Margo sighed then. “Okay, I won’t be bossy.”\u003c/p\u003e\n\u003cp\u003eMel joined the conversation. “Everyone in D.C. will be on the interstate. There’s bound to be a pileup. You ought to take the Jefferson Davis, then cut over to ninety-five. It’ll save you a good twenty minutes.”\u003c/p\u003e\n\u003cp\u003eMargo disagreed. “She’s leaving in rush hour. The interstate is much faster.”\u003c/p\u003e\n\u003cp\u003eAvery was only half listening. Her fingers were flying over the keyboard as she replied to interoffice inquiries. “I feel terrible leaving you guys with my mess,” she said to no one in particular.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” Lou said.\u003c/p\u003e\n\u003cp\u003e“We’ll all split the work,” Margo said. “Lou, you’ve got some powdered sugar on your belt.”\u003c/p\u003e\n\u003cp\u003eShe reached over Avery’s head, grabbed a tissue from the box on the shelf, and handed it to Lou. Then she turned back to Avery. “I’m planning to dump all my work on all of you when I go to San Diego next month for my cousin’s wedding.”\u003c/p\u003e\n\u003cp\u003e“I think I’d better type up that route you should take to the airport,” Mel said. “I’ll hand you the printout as you’re leaving the office.”\u003c/p\u003e\n\u003cp\u003e“As long as I’m out of here by four-fifteen.”\u003c/p\u003e\n\u003cp\u003e“I’ll make sure you are,” Mel promised. “Shall we synchronize our watches?”\u003c/p\u003e\n\u003cp\u003e“That’s a nerdy thing to do,” Margo told him. “Now, Brad Pitt would never—”\u003c/p\u003e\n\u003cp\u003eHer phone rang, interrupting her thought. While she hurried to her cubicle, Lou picked up where she’d left off. “Face it, you guys. We are nerds.”\u003c/p\u003e\n\u003cp\u003e“So what’s wrong with that?” Mel asked. “I mean, think about it. Bill Gates is a nerd, and he’s doing all right.”\u003c/p\u003e\n\u003cp\u003e“Maybe, but we aren’t making his billions, now are we? And we’re thought of as nerds by everyone in the Bureau.”\u003c/p\u003e\n\u003cp\u003e“I don’t believe that,” Mel argued. “We’re all important members of the team.”\u003c/p\u003e\n\u003cp\u003eMargo interrupted. “Agent Andrews is on his way down here,” she called out. “Douglas’s secretary heard him ask where the pen was.”\u003c/p\u003e\n\u003cp\u003e“He’s probably coming down to thank you, Avery, for letting him have the glory,” Lou said.\u003c/p\u003e\n\u003cp\u003e“He’s late,” Margo said. “He should have thanked her the other day, after the press conference.”\u003c/p\u003e\n\u003cp\u003e“Andrews is going to cut into your time,” Mel said. “Maybe I better go ahead and print out that alternate route. You can decide which way to go once you’re in the car. Just be sure to turn the radio on and listen to the traffic updates.”\u003c/p\u003e\n\u003cp\u003eAvery tried not to smile. Mel did tend to obsess over the tiniest details. “Thanks, Mel.”\u003c/p\u003e\n\u003cp\u003e“We’ll let Andrews talk for what? Four? Five minutes?”\u003c/p\u003e\n\u003cp\u003e“That’d be good.”\u003c/p\u003e\n\u003cp\u003e“Then you interrupt,” Mel told Lou. “You’re good at that.”\u003c/p\u003e\n\u003cp\u003eAndrews ruined the schedule. Although Avery had never met the agent, she had him all figured out in less than a minute. He thought he was a charmer. It was an incorrect assumption on his part. He got the “thank you’s” over with quickly but then perched on the edge of her desk and invited her to have dinner with him. His stare wasn’t quite a leer, but it was damned close. Lou and Mel immediately tried to get rid of him.\u003c/p\u003e\n\u003cp\u003e“Avery’s leaving on vacation,” Mel said. “She’s got a plane to catch.”\u003c/p\u003e\n\u003cp\u003eWhen Andrews didn’t take the hint, Lou decided to be more blunt. “You better leave. She’s on a tight schedule, and you’re messing it up.”\u003c/p\u003e\n\u003cp\u003eAndrews’s response was to fold his arms and widen his goofy smile.\u003c/p\u003e\n\u003cp\u003eIt didn’t take investigative skill to know what was happening. Andrews was suffering from LAFS, “lust at first sight,” but that didn’t make him unusual. Most of the men who got close to Avery became temporarily afflicted by the debilitating condition. Mel theorized that the syndrome was brought on by her big, baby blue eyes. When she looked at a man and gave him her full attention, his brain simply shut down. Lou didn’t agree with Mel’s assessment. Blue eyes might have had a little to do with catching a guy’s interest, but it was Avery’s killer body and long, silky blond hair that turned him into a blithering idiot.\u003c/p\u003e\n\u003cp\u003eAndrews was blithering now. It was sad, really, to watch a skilled professional sink so quickly into the quagmire.\u003c/p\u003e\n\u003cp\u003eMel, the more protective of Avery, hoped Andrews would hurry up and compliment her. They all did, sooner or later, and then Avery would send him on his way. Mel checked the time as he silently willed Andrews to tell Avery how pretty she was. If he didn’t hit on her soon, Avery would miss her plane.\u003c/p\u003e\n\u003cp\u003eCome on, come on, Mel silently urged. Go for it. Tell her what a knockout she is.\u003c/p\u003e\n\u003cp\u003e“I’ve got to ask you something,” Andrews said.\u003c/p\u003e\n\u003cp\u003e“Yes?” Avery asked.\u003c/p\u003e\n\u003cp\u003e“How come such a beautiful woman like you is stuck down here in the basement?” The agent all but crooned the question like a country singer. “With your looks—” It was as far as he got. Poor guy never knew what hit him.\u003c/p\u003e\n\u003cp\u003eAvery’s voice sizzled as she curtly responded, “Agent Andrews, I had nothing to do with the way I look. Now, if you’ll excuse me, I have work to do, and I assume you do too. Get off my desk and go away.”\u003c/p\u003e\n\u003cp\u003eThat having been said, she swiveled in her chair and began typing again. Andrews had that what’d-I-say? look of bewilderment on his face as he stood and slowly walked away, blushing like a girl.\u003c/p\u003e\n\u003cp\u003eMel didn’t start laughing until he was out of earshot. “So I guess you won’t be going to dinner with Andrews when you get back from vacation?”\u003c/p\u003e\n\u003cp\u003e“I’m trying to work here.”\u003c/p\u003e\n\u003cp\u003eLou put his hand out, and Mel, frowning as he pulled his wallet from his back pocket, extracted a dollar bill and handed it to his friend. The two men had a standing bet as to the nature of the compliments given Avery. Since Andrews hadn’t said anything about her legs, Lou won the dollar. Her legs were pretty amazing, and most men noticed them right away, but Andrews apparently wasn’t a leg man.\u003c/p\u003e\n\u003cp\u003e“How come that never happens to me?” Margo asked. “I’m cute, aren’t I?”\u003c/p\u003e\n\u003cp\u003e“Yeah, sure you are,” Lou said.\u003c/p\u003e\n\u003cp\u003e“And I want to get married one day and have a family,” she continued as though Lou hadn’t answered. “Whereas Avery has made it perfectly clear on countless occasions that she’s never going to get married. It’s just not fair. I’d be perfect for Andrews. I really would. But he never even glanced my way.”\u003c/p\u003e\n\u003cp\u003e“What makes you think you’d be perfect for him?” Lou asked.\u003c/p\u003e\n\u003cp\u003e“Because he’s a hottie,” she answered. “And no one appreciates a full-fledged hottie more than I. We’d be perfect for each other,” she said over her shoulder as she went back to her workstation.\u003c/p\u003e\n\u003cp\u003eMel shoved his wallet back into his pocket and went to work. At four-fifteen, he stood up and called, “It’s time to leave, Avery.”\u003c/p\u003e\n\u003cp\u003e“Just give me another ten minutes . . .”\u003c/p\u003e\n\u003cp\u003eThe ten turned into forty-five, and she didn’t get out of the office until after five. Fortunately, her knee was much better today, and she was able to run. Nevertheless, she still missed her flight. There was an accident on the interstate, blocking two lanes, and by the time she finally arrived at the airport and sprinted to the terminal, the plane was in the air.\u003c/p\u003e\n\u003cp\u003eAvery toyed with the idea of going back home and crashing in her own bed. She hadn’t averaged more than four hours’ sleep a night in over a week, and she was exhausted. She didn’t dare give in to the urge, though. Carrie would kill her if she were a full day late.\u003c/p\u003e\n\u003cp\u003eUtopia wasn’t her idea of a great vacation. She was going only to please her aunt. When she went someplace new, she wanted to see the sights, soak in the local color. She didn’t relish the idea of being stuck in a spa for six days, but Avery had given her word, so she couldn’t back out.\u003c/p\u003e\n\u003cp\u003eThe next flight through Denver into Aspen was full, and she was forced to take a convoluted route from D.C. She ended up in Grand Junction, Colorado. She would have to wait until morning to board yet another flight. After she collected her luggage and checked into the hotel adjacent to the airport, she called Carrie on her cell phone. She got her voice mail on the first ring. She assumed her aunt was recharging her phone and had already gone to bed—it was midnight Aspen time. She left a message that she would arrive at the spa around noon tomorrow. \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-10.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
