{"id":89317,"no":13,"title":"Page 13","content":"\u003cp\u003e“Why?” he asked. “Why did you need an attorney?”\u003c/p\u003e\n\u003cp\u003e“I hired him to help Dale. I want to get him out of prison, and now it looks like that might happen. When the attorney was going through the boxes of evidence, he found a bill from a cardiologist in Savannah. He went to see him,” she continued. “And the doctor told him my mother’s condition was fatal. More important, he said that he had come forward and told the prosecutor that he had treated Mama, but the prosecutors withheld that information from the public defender who had been assigned to represent Dale.”\u003c/p\u003e\n\u003cp\u003eMonk was suddenly feeling insecure and angry, but he contained his emotions.\u003c/p\u003e\n\u003cp\u003e“Go on,” he said.\u003c/p\u003e\n\u003cp\u003e“The attorney I hired did it,” she said. “Dale’s getting a new trial, and it’s going to be soon. The judge was outraged when he heard that the prosecutor had suppressed evidence to help him win. It seems there’s bad blood between the two men, and this was the last straw. Dale’s attorney told me another case was postponed, and the judge gave Dale that opening. Carrie and Avery can’t testify. Dale will stay in prison if they do.”\u003c/p\u003e\n\u003cp\u003e“What about the parole hearing? Is that still scheduled?”\u003c/p\u003e\n\u003cp\u003e“Yes, but the trial should be over by then. If Dale doesn’t get out of prison, I’ll never get those diamonds. After all I’ve been through, I think I deserve them. Of course, whatever I get belongs to you too. Am I being too greedy?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t think so,” he said. “But you must be honest with me now. Do you have feelings for Dale?”\u003c/p\u003e\n\u003cp\u003e“Oh, God, no,” she cried. “I’ve always hated him, and I know how I can prove it to you.”\u003c/p\u003e\n\u003cp\u003e“How?” he asked, intrigued by the sly smile of hers he found so titillating.\u003c/p\u003e\n\u003cp\u003e“As soon as Dale leads us to the diamonds, I’ll let you watch me kill him.”\u003c/p\u003e\n\u003cp\u003eAll of his insecurities faded with that promise. She kissed him then and whispered, “I love you with all my heart. I would die rather than hurt you. Killing Dale will prove my love, but I want proof from you as well.”\u003c/p\u003e\n\u003cp\u003e“What can I do?” he asked. He wasn’t a man given to poetry, but he tried to be romantic as he vowed, “If you wish me to walk on water, I swear I’ll find a way to do it. I’ll do anything for you, dearest Jilly. Anything at all.”\u003c/p\u003e\n\u003cp\u003eShe snuggled up against him. “My sister and Avery both spoke at the last parole hearing,” she said. “They’re the reason he didn’t get out then.”\u003c/p\u003e\n\u003cp\u003e“And you want me to find a way to keep your sister and your daughter away from the trial and the parole hearing this time? Is that what you want?”\u003c/p\u003e\n\u003cp\u003e“Darling, I don’t want you to just keep them away. I want you to make it impossible for them to testify. I want you to kill them.”\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eCARRIE WOKE UP IN A COLD SWEAT. THE NIGHTMARE HAD consumed her, terrified her. Trembling like a child, she wrapped herself in the down comforter and tried to calm her racing heartbeat. She felt as if she were having a heart attack. She put her hand to her chest and took a couple of deep breaths. The nightmare had been so real. My God, what had brought that on? She hadn’t thought about Jilly in years. Why was her sister suddenly tormenting her sleep again?\u003c/p\u003e\n\u003cp\u003eMaybe she was just overly tired. Yes, that was it, she thought, latching onto the possibility. It made sense, didn’t it? She had been working seventy-, eighty-hour weeks for the past two months, firming up and then nailing the incredibly lucrative Bliss account. The contracts were all signed and delivered, and now that she could finally slow the pace, her overloaded brain had simply had a minor meltdown.\u003c/p\u003e\n\u003cp\u003eRolling onto her back, she closed her eyes against the piercing sunlight streaming in between the partially opened drapes and tried to remember some of the yoga exercises Avery had taught her. Take deep, cleansing breaths. She remembered that much. Clear the mind and concentrate on relaxing every muscle of the body. Okay, it was coming back to her. First the toes. Then the legs. That’s it, she thought. Now relax, damn it.\u003c/p\u003e\n\u003cp\u003eIt wasn’t working. Anxiety, like the boogeyman hiding in the closet, was still lurking, waiting to pounce.\u003c/p\u003e\n\u003cp\u003eFor heaven’s sake, it was just a nightmare. Vivid as hell, but still not real, so stop freaking out.\u003c/p\u003e\n\u003cp\u003eCarrie wished Valium were still in vogue. She would have taken a couple to soothe her nerves. Then she realized she was calming down. Her heart no longer felt as though it were trying to leap out of her chest like one of those creatures in Alien.\u003c/p\u003e\n\u003cp\u003eWhat she needed was a good long shower. Carrie threw the covers off and sat up. What time was it? Did the sun come up brighter here in the mountains than in L.A.? Of course it did, because there wasn’t any smog.\u003c/p\u003e\n\u003cp\u003eCoffee, she thought. I’ll ring for coffee. The caffeine will clear the fog in my head, and I’ll be able to start thinking like a human being again.\u003c/p\u003e\n\u003cp\u003eCarrie was swinging her legs over the side of the bed when she saw them. There, pointed toward her on the nightstand, was a pair of shiny steel-bladed scissors. She froze, the scream lodged in her throat. She couldn’t make herself look away, couldn’t make the scissors disappear.\u003c/p\u003e\n\u003cp\u003eHer heart was slamming against her rib cage again. Could a person die of fright? Was this some kind of a sick joke? No. Whoever had put the scissors there couldn’t possibly know about her nightmare. Think, damn it. Try to think.\u003c/p\u003e\n\u003cp\u003eWere they real? Carrie tentatively reached out to touch them, thinking she was having some kind of hallucination. When her fingers touched the hard, cold steel handle, she whimpered. Son of a bitch, they were real.\u003c/p\u003e\n\u003cp\u003eThere had to be a reasonable explanation. Maybe the scissors had been there on the nightstand the night before, and while she hadn’t consciously noticed, her subconscious had picked up on them. The possibility sounded desperate, but she clung to it. Then she spotted the yellow, invitation-sized envelope with her name handwritten in beautiful script propped up against the lamp. She was positive it hadn’t been there the night before. Her hand trembled as she picked it up and opened it. The stationery was expensive, but there wasn’t a Utopia seal or logo printed on it, or a return address.\u003c/p\u003e\n\u003cp\u003e“What the hell is going on?” she whispered. And then she pulled the two sheets out, unfolded them, and read the note.\u003c/p\u003e\n\u003cp\u003eCarrie:\u003c/p\u003e\n\u003cp\u003eDid you mourn me when you heard I died in that car crash so many years ago? Or did you celebrate? You always believed you were so superior. I was just a stupid girl. Do you remember how you called me that? I’ve never forgotten. Your biggest problem was that you always underestimated me. Always. Surely you recall how I so loved to get even. That glorious day has finally arrived, and now you’re right where I want you to be.\u003c/p\u003e\n\u003cp\u003eThe house is wired, Carrie, and there isn’t any way out. If you open a window or an outside door . . . boom. A simple push of a button and the house will disintegrate. Do you wonder how long I’ll wait?\u003c/p\u003e\n\u003cp\u003eTick. Tick. Are you scared?\u003c/p\u003e\n\u003cp\u003eShall I tell you how I plotted and planned? I began by finding the man of my dreams. He loves me, of course, but then they all do, don’t they? This one is very special. A perfectionist, actually. His name is Monk, and when I first seduced him, I must say he was terribly set in his ways. He’s a hit man, my hit man, though he prefers to be called a professional.\u003c/p\u003e\n\u003cp\u003eHe does whatever I ask him to do, and in return I’ve taught him how to have fun with his job. He’s a proud man, proud of what he does, and he’s careful and methodical, and so he won’t let me make any mistakes. In the past, he only took on one job at a time, but I’ve convinced him to reach for bigger and better. He’d already contracted to blow up the house. It just took a little more planning to kill a few inconsequential women at the same time.\u003c/p\u003e\n\u003cp\u003eYou know why you must die. You stole my dream from me and gave it away. You took my child from me too, and you turned her against me. Those are just two reasons, Carrie, but when all is said and done, your biggest sin is that you have made me unhappy.\u003c/p\u003e\n\u003cp\u003eJilly\u003c/p\u003e\n\u003cp\u003eP.S. Don’t worry about Avery. I’m going to take care of her too.\u003c/p\u003e\n\u003cp\u003eCarrie screamed once and began to sob. She was terrified. Shaking, she leapt from the bed and ran to the sliding glass doors. She grabbed a fistful of the drapes, ripped them out of her way, and looked outside. Then down. She saw the blinking red light protruding from the explosives, as evil and horrific as the devil’s eye, and shouted, “Oh, God, oh, God . . .”\u003c/p\u003e\n\u003cp\u003eShe ran for the bedroom door, tripped over her shoes and slammed her right foot into the bedpost. Pain shot up her calf. Cursing, she continued on. She stopped short in the hallway just outside her door and called out, “Is anyone there?”\u003c/p\u003e\n\u003cp\u003eNothing. Not a sound. Too late, she realized she should have grabbed the scissors to use as a weapon just in case someone had been waiting, but Jilly had touched those scissors. Jilly, who had written the horrific, gleeful letter. Jilly, the psycho.\u003c/p\u003e\n\u003cp\u003eGod help them all.\u003c/p\u003e\n\u003cp\u003eShe edged along the wall to the spiral staircase. She was afraid to look down, afraid not to. It took her a good minute to get up the courage, and then relief, sweet, sweet relief, made her weak because no one was looking up at her. Maybe Carrie and Sara and Anne were all alone in the house. No, not a house now. A bomb.\u003c/p\u003e\n\u003cp\u003eShe ran down the stairs, then raced to the judge’s suite. She didn’t bother to knock, but threw the door open and rushed inside.\u003c/p\u003e\n\u003cp\u003eThe room was pitch black. Carrie couldn’t even see her hand in front of her face. She felt her way across the sitting room, nearly knocking over a lamp when her elbow bumped into the shade. She grabbed it, and finally got it turned on.\u003c/p\u003e\n\u003cp\u003eSara was in bed. Carrie could see a form huddled under the blanket, but she couldn’t see her face. The drapes were tightly drawn. Carrie opened them and looked down. “Son of a bitch,” she muttered. There it was, another blinking red light.\u003c/p\u003e\n\u003cp\u003eTurning, she slowly approached the side of the bed as she strained to hear the sound of Sara’s breathing. She couldn’t hear anything but the noise of the air conditioner as it kicked on.\u003c/p\u003e\n\u003cp\u003eCarrie gently shook her. “Wake up, Sara,” she ordered.\u003c/p\u003e\n\u003cp\u003eShe didn’t move. She shook her again, much harder this time. “Come on, Sara. You have to wake up.” Sara groaned.\u003c/p\u003e\n\u003cp\u003eShe put her hand on Sara’s wrist, feeling for a pulse with her fingertips. When she finally found it, she felt like shouting with relief.\u003c/p\u003e\n\u003cp\u003eCarrie knew what had happened. The food they’d eaten last night had been drugged, but because she had thrown up, she’d gotten rid of most of the poison. How much had Sara and Anne eaten?\u003c/p\u003e\n\u003cp\u003eShe grabbed Sara by her shoulders and started shaking her. “Open your eyes, damn it. Wake up, Sara.”\u003c/p\u003e\n\u003cp\u003eAnother groan was her only response. Carrie looked at the clock on the bureau and saw that it was already one in the afternoon. Then she turned to the nightstand, and just as she expected, there was another envelope propped against the lamp with Sara’s name written on it. The handwriting was identical.\u003c/p\u003e\n\u003cp\u003eShould she open it?\u003c/p\u003e\n\u003cp\u003e“Go away.”\u003c/p\u003e\n\u003cp\u003eCarrie jumped at the sound of Sara’s gruff voice. She was struggling to open her eyes. Carrie stepped back as Sara rolled onto her back and told her once again to go away.\u003c/p\u003e\n\u003cp\u003e“No,” she said. “Keep your eyes open. You have to wake up.”\u003c/p\u003e\n\u003cp\u003eSara heard her. She struggled to sit up but only made it halfway before she collapsed against the pillows. She focused on Carrie, awareness slow to penetrate.\u003c/p\u003e\n\u003cp\u003e“What . . . what are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Listen to me,” Carrie ordered. “You’ve been drugged. Do you understand what I’m saying? Please, try to pay attention. We’re in trouble.”\u003c/p\u003e\n\u003cp\u003e“Drugged?” She shook her head. “No, I don’t take drugs.”\u003c/p\u003e\n\u003cp\u003eIn her frustration, she shouted at the woman. “They put it in the food, Sara. Can you understand what I’m saying?”\u003c/p\u003e\n\u003cp\u003e“Yes. You’re telling me the food was drugged?”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s right,” Carrie said. “Keep your eyes open. I’m going to get a cold wet cloth. Come on, Sara,” she coaxed. “Sit up.”\u003c/p\u003e\n\u003cp\u003eBy the time Carrie returned from the adjoining bath with a washcloth dripping with cold water, Sara had managed to pull herself up. Her shoulders were pressed against the headboard.\u003c/p\u003e\n\u003cp\u003eShe looked at Carrie as though she was only just now seeing her. “Why are you in my room?”\u003c/p\u003e\n\u003cp\u003eCarrie tried to put the wet cloth on Sara’s face, but the woman knocked it away.\u003c/p\u003e\n\u003cp\u003e“We’re in trouble,” she repeated. “I have to go wake Anne. So you have to listen to what I’m going to tell you. Okay? Can you concentrate yet?”\u003c/p\u003e\n\u003cp\u003e“Will you stop shouting at me? I’m awake now. What kind of trouble are you talking about?”\u003c/p\u003e\n\u003cp\u003e“The house is wired.”\u003c/p\u003e\n\u003cp\u003eSara blinked. “I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“We’re prisoners,” Carrie said. “If one of us opens a door or a window, the house will blow up. Look at the glass door,” she urged. “See the red blinking light?”\u003c/p\u003e\n\u003cp\u003eSara wouldn’t believe her. “This is just some kind of sick prank.”\u003c/p\u003e\n\u003cp\u003e“No, it isn’t,” she said. Then she grabbed the envelope from the nightstand. “Open it,” she said. “I got one too. Bring the letter with you down to the living room, and I’ll bring mine. Even if you can’t believe it, don’t open any windows or doors. Okay? Now I’ve got to get to Anne before she wakes up and decides to open a window.”\u003c/p\u003e\n\u003cp\u003eSara nodded. “All right. I’ll meet you downstairs.”\u003c/p\u003e\n\u003cp\u003eShe was opening the envelope when Carrie rushed out of the room. Anne’s suite was at the opposite end on the same level. She ran to it.\u003c/p\u003e\n\u003cp\u003eAnne wasn’t in bed. Carrie could hear her in the bathroom. She was throwing up. Carrie went to the door and knocked. “Anne, do you need help?”\u003c/p\u003e\n\u003cp\u003eShe didn’t answer her. Carrie tried again and again. She didn’t know how long she stood there pounding on the door. Finally, Anne opened it.\u003c/p\u003e\n\u003cp\u003eThe frail woman looked green. “What do you want?” she asked. She was swaying on her feet.\u003c/p\u003e\n\u003cp\u003e“Let me help,” Carrie said. She put her arm around her waist, thinking it was the size of a pencil, and helped her back to bed.\u003c/p\u003e\n\u003cp\u003e“You should stay away from me,” Anne said, her voice weak. “I’ve got some kind of a bug. Now you’ll get it.”\u003c/p\u003e\n\u003cp\u003e“No,” Carrie said. “You don’t have a bug.” She was all but carrying the woman across the room. When she reached the bed, she pulled the sheet back and helped Anne sit down.\u003c/p\u003e\n\u003cp\u003e“I was up half the night, throwing up,” she said. “Of course I have a bug. It’s probably just one of those twenty-four-hour viruses.”\u003c/p\u003e\n\u003cp\u003eThere wasn’t an envelope on Anne’s nightstand. “You were up all night?” she asked as she helped the woman into bed. “Did you hear anyone . . . see anyone?” \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-13.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
