{"id":89329,"no":25,"title":"Page 25","content":"\u003cp\u003eAvery understood. In other words, buy the damn supplies. “Yes,” she answered.\u003c/p\u003e\n\u003cp\u003e“Don’t you be givin’ them no discounts, Chrystal. And no credit cards. These folks ain’t gonna live long enough for the receipt to go through.”\u003c/p\u003e\n\u003cp\u003eChrystal nodded. “The woman’s sending you to a fiver.”\u003c/p\u003e\n\u003cp\u003eWhat in God’s name were they talking about? Then Kenny said, “Don’t know how you think you’re gonna do the river. Since all the rain we’ve been having, only fools would try to raft it. You’re gonna drown before you make it over the first rapids.” The possibility so tickled him he chuckled. “Don’t matter how experienced you are.”\u003c/p\u003e\n\u003cp\u003e“That’s right, hon,” Chrystal said. “You’re gonna get yourself drowned, all right. Now, that gal said you’d see a sign with writing on it and you’d find what you’re lookin’ for right by it.”\u003c/p\u003e\n\u003cp\u003e“Did she tell you what’s on the sign?”\u003c/p\u003e\n\u003cp\u003e“Coward’s Crossing. All the locals use that name too, for that little area where you can look down at the river if you’re too afraid to go in. Years ago, there used to be a rope bridge, which is why they called it a crossing.”\u003c/p\u003e\n\u003cp\u003e“You’ll have to hike to get there,” Kenny said. “I know the lay of the land ’cause I’ve been comin’ up here ever since I was a boy, and there ain’t no path up there.”\u003c/p\u003e\n\u003cp\u003eChrystal didn’t agree and began to argue with her husband.\u003c/p\u003e\n\u003cp\u003eAvery reached for the phone and then stopped. One quick call to Margo, she thought, to tell her where she was and what was going on. Should she chance it?\u003c/p\u003e\n\u003cp\u003eKenny finally won the shouting match, and while Chrystal sulked, he gave Avery detailed instructions on getting to Coward’s Crossing. She pulled the map from her pocket and asked Kenny to mark the area.\u003c/p\u003e\n\u003cp\u003eJohn Paul had two plastic sacks full of bottled water and food. He grabbed two more protein bars, shoved them into the smaller sack, and headed to the car. Kenny hopped off the counter to chase after him just to make sure he wasn’t going to try to drive away without paying.\u003c/p\u003e\n\u003cp\u003eAvery grabbed a piece of paper and wrote down Margo’s number. “Chrystal, I want you to drive to another phone and call this number. Tell whoever answers that I was here and where I’m headed. There’s a lot of money in it if you make the call,” she promised. “But don’t use this phone.”\u003c/p\u003e\n\u003cp\u003e“How much money?”\u003c/p\u003e\n\u003cp\u003e“Five thousand dollars.” She said the first figure that popped into her head. “And when we capture the man we’re after, there will be twice that amount, and you’ll get all of it.”\u003c/p\u003e\n\u003cp\u003e“How much exactly?”\u003c/p\u003e\n\u003cp\u003e“Ten thousand.” The lies were getting easier.\u003c/p\u003e\n\u003cp\u003eChrystal looked suspicious. “How do I know you aren’t gonna help yourself to that money?”\u003c/p\u003e\n\u003cp\u003e“Because I’m FBI,” she said. “My ID is in the car. Would you like me to go get it?”\u003c/p\u003e\n\u003cp\u003e“I should have guessed it,” she snorted. “You bein’ so bossy and all. You don’t have to show me your badge. I believe you. You got that FBI look about you, and that fancy karate move you did on me in the office got my suspicions up. I should have paid attention to the warnin’ bells goin’ off in my head.”\u003c/p\u003e\n\u003cp\u003eWhat fancy move was she prattling about? All Avery remembered doing was stepping out of the woman’s way.\u003c/p\u003e\n\u003cp\u003e“That’s very astute of you,” she said dryly.\u003c/p\u003e\n\u003cp\u003e“Now, tell me again about that money. Would it be fifteen thousand in all?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eChrystal squinted at Avery. “And you’re saying all I got to do is make that call?”\u003c/p\u003e\n\u003cp\u003e“Yes, and will you—”\u003c/p\u003e\n\u003cp\u003eChrystal cut her off. She’d glanced at the number on the paper and blurted, “Wait a minute. This here is a long-distance call. Can I reverse the charges?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll do it, but I got to tell you, I still don’t get it. You could use the phone right there,” she said, pointing to the counter. “What’s the catch?”\u003c/p\u003e\n\u003cp\u003eShe didn’t waste time telling Chrystal she couldn’t take the chance the line might be tapped. “You just can’t use this phone. Wait about twenty minutes, then get in your pickup and drive to the nearest phone.”\u003c/p\u003e\n\u003cp\u003e“Will you pay for the gas?”\u003c/p\u003e\n\u003cp\u003eAvery felt like screaming. “Yes.”\u003c/p\u003e\n\u003cp\u003eJohn Paul had just walked back inside the store when the phone rang. Avery flinched at the sound.\u003c/p\u003e\n\u003cp\u003e“That’s probably her,” Chrystal said. “We haven’t gotten a single call since we reopened the store this morning, so that’s got to be her. Want me to answer it?”\u003c/p\u003e\n\u003cp\u003eAvery grabbed the phone and answered on the second ring.\u003c/p\u003e\n\u003cp\u003e“You were late,” the caller said.\u003c/p\u003e\n\u003cp\u003e“No, we weren’t. We were right on time. The woman you left the package with was using the phone when we arrived.”\u003c/p\u003e\n\u003cp\u003e“Yes, she was.”\u003c/p\u003e\n\u003cp\u003eAvery then knew she had been monitoring the line. Thank God she hadn’t tried to call Margo.\u003c/p\u003e\n\u003cp\u003e“Did you get the directions to where you’re going?”\u003c/p\u003e\n\u003cp\u003e“Yes. I want to talk to Carrie.”\u003c/p\u003e\n\u003cp\u003e“No, that isn’t possible.”\u003c/p\u003e\n\u003cp\u003e“Then how do I know she’s still alive?”\u003c/p\u003e\n\u003cp\u003e“Carrie is alive . . . for now anyway. It’s up to you to keep her and her friends that way, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Why are you doing this?”\u003c/p\u003e\n\u003cp\u003e“No more questions,” she hissed. “Or I’ll hang up the phone right now. Do you understand me?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“You’re on a lovely treasure hunt, and you’re winning points as you move along. The prize is Carrie. You do want to see her again, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“That’s good.” She laughed. “You’re so eager to please. You’d better hurry, Avery.”\u003c/p\u003e\n\u003cp\u003e“How long—”\u003c/p\u003e\n\u003cp\u003e“Hurry now.”\u003c/p\u003e\n\u003cp\u003eThe woman disconnected the call. Avery’s heart was pounding. She put the phone down as Chrystal asked, “Was it her?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she answered. “Chrystal, describe her to me.”\u003c/p\u003e\n\u003cp\u003e“You mean you want to know what she looked like?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“She was older than you, but not as old as me, and not as heavy as me. Kenny?” she shouted, “How old would you say that woman was?”\u003c/p\u003e\n\u003cp\u003eKenny walked inside. He scratched his stubbly jaw while he considered his answer. “I don’t know. Never could judge a person’s age real good. She sure was a looker, though.”\u003c/p\u003e\n\u003cp\u003eChrystal nodded. “Had yellow-colored hair, and it’s kind of funny really, you askin’ me what she looked like.”\u003c/p\u003e\n\u003cp\u003e“Why?” Avery asked.\u003c/p\u003e\n\u003cp\u003e“Well . . . ’cause . . .” Chrystal shrugged. “She kinda looked like you.”\u003c/p\u003e\n\u003cp\u003eChapter 15\u003c/p\u003e\n\u003cp\u003eCHRYSTAL TOLD KENNY THEY WOULD RECEIVE A BIG REWARD if he drove to town and made a call for Avery. Kenny didn’t believe his wife, and he didn’t want to do it. Avery thought it might be because his nose had started bleeding again.\u003c/p\u003e\n\u003cp\u003eUnlike Avery, John Paul wasn’t interested in trying to coax them into cooperating, because he understood how their twisted pea-sized brains worked. He had had enough of the Bonnie-and-Clod pair. He shoved Kenny into the wall and calmly told him that he would hunt him down and skin him alive if he didn’t do what Avery asked. Simple as that. Kenny believed him, and so did Chrystal. The look in John Paul’s eyes indicated he wasn’t the type of man to make idle threats.\u003c/p\u003e\n\u003cp\u003eChrystal jumped back when John Paul walked past. She knocked the phone off the counter and quickly picked it up. Instinctively putting the receiver to her ear to make sure no one else was on the line, she hung up and said to Kenny, “The phone isn’t workin’.”\u003c/p\u003e\n\u003cp\u003e“Are you sayin’ the line’s dead?” Kenny gasped the question, still trying to recover his breath.\u003c/p\u003e\n\u003cp\u003e“Didn’t I just say it was broke?”\u003c/p\u003e\n\u003cp\u003e“She did it,” Kenny decided, glaring at Avery. “She must have broke it after she finished talkin’ to that woman and hung up. You saw her slam it down, didn’t you, Chrystal? You’re gonna have to pay for repairs,” he told Avery.\u003c/p\u003e\n\u003cp\u003eAvery picked up the phone to see if Chrystal was telling the truth. The line was dead. That was quick, she thought. They must have been ready.\u003c/p\u003e\n\u003cp\u003eJohn Paul stood by the door waiting to get Avery’s attention. “Avery . . .”\u003c/p\u003e\n\u003cp\u003e“Just a minute.” She walked over to the teenagers sprawled out on the floor. Two of them were curled up like cats, sound asleep, but the droopy-eyed boy named Mark was still sitting upright and watching her every move with the stupid grin still plastered on his freckled face.\u003c/p\u003e\n\u003cp\u003e“Who’s the driver?”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eShe nudged his foot. “Who’s driving the car?”\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003e“Give me the car keys.”\u003c/p\u003e\n\u003cp\u003eThe grin didn’t falter. “I don’t have to,” he slurred even as he dug into his pocket and pulled out his key ring. He dangled the keys in front of his face. Then he giggled.\u003c/p\u003e\n\u003cp\u003eShe snatched the keys out of his hand and tossed them on the counter. “Chrystal, you make sure those boys don’t get into that car. You understand?”\u003c/p\u003e\n\u003cp\u003e“I’m not gonna be a baby-sitter. You expect me to stand here and watch them?”\u003c/p\u003e\n\u003cp\u003e“Make them sleep outside, but don’t give them the keys.” She turned to leave, but John Paul raised his hand for her to stop.\u003c/p\u003e\n\u003cp\u003e“More customers,” he said. He glanced out the window and watched two older women, dressed in hiking clothes, get out of a Ford. He pushed Avery’s hand away from the doorknob. “You’re not going with me.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes, I am,” she insisted.\u003c/p\u003e\n\u003cp\u003e“Listen to me,” he ordered. “You go back to town with those women and get to a police station. Keep the gun just in case.”\u003c/p\u003e\n\u003cp\u003e“While you go ahead to Coward’s Crossing?”\u003c/p\u003e\n\u003cp\u003e“Yes. If I can get there quick, I might be able to find a good spot to ambush him.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “If you kill him, we won’t be able to find Carrie and the others.”\u003c/p\u003e\n\u003cp\u003e“The woman knows where they are.”\u003c/p\u003e\n\u003cp\u003e“She’ll disappear, and you know it. It’s too risky. Besides, if Monk or the woman finds out I’m not with you—”\u003c/p\u003e\n\u003cp\u003e“They won’t know.”\u003c/p\u003e\n\u003cp\u003e“You have to take me with you.”\u003c/p\u003e\n\u003cp\u003e“No. It’s too dangerous for you, and you’ll slow me down.”\u003c/p\u003e\n\u003cp\u003e“Then I’m going to follow you. Kenny gave both of us the directions. I can find Coward’s Crossing. I’ll take the teenagers’ car. Simple as that, John Paul.” She poked him in his chest. “You need me to get him. Now get out of my way.”\u003c/p\u003e\n\u003cp\u003eHe didn’t want to waste any more time arguing. He decided he’d have to find a place to dump her on the way. Someplace safe. Yeah, that’s what he would do.\u003c/p\u003e\n\u003cp\u003eHe opened the door. “You stay close,” he whispered as he stepped back so the gray-haired women could come inside.\u003c/p\u003e\n\u003cp\u003eThe ladies walked right past the teenagers and didn’t seem to notice them when they headed for the facilities, as Kenny so quaintly called the bathroom.\u003c/p\u003e\n\u003cp\u003eAvery turned back to Chrystal, who, at this point, was the more agreeable of the two. “How long do you think it will take to get to Coward’s Crossing?”\u003c/p\u003e\n\u003cp\u003e“You aren’t gonna make it before nightfall,” Chrystal answered. “What with all the rain, those little roads got all washed out.”\u003c/p\u003e\n\u003cp\u003eJohn Paul was opening the door but paused when Kenny shouted, “Hey, wait a minute. You ain’t gonna take my gun, are you? I’ve got to have something for protection, being out here with just the missus.”\u003c/p\u003e\n\u003cp\u003e“Let it go, Kenny,” Chrystal said. “George never got a permit for that thing.”\u003c/p\u003e\n\u003cp\u003eKenny’s face turned red. “Why’d you have to open your big mouth and bring that up?”\u003c/p\u003e\n\u003cp\u003e“She would have wanted to see it,” Chrystal argued. “They always do.”\u003c/p\u003e\n\u003cp\u003e“Who’s ‘they’?”\u003c/p\u003e\n\u003cp\u003e“FBI.” She pronounced each letter as though it were a profanity.\u003c/p\u003e\n\u003cp\u003e“What?” Kenny screeched. “You’re saying that gal’s FBI?” His eyes bulged at the news.\u003c/p\u003e\n\u003cp\u003eMark groaned. “Ah, man, we’re gonna get busted.”\u003c/p\u003e\n\u003cp\u003eIgnoring the drunk, John Paul closed the door in Avery’s face and asked softly, “You’re an FBI agent?”\u003c/p\u003e\n\u003cp\u003eUh-oh. One quick glance at his expression, and she inwardly cringed. He looked so offended that she didn’t think it would be a good idea to explain it all to him now. Maybe later, she thought, when he was asleep.\u003c/p\u003e\n\u003cp\u003e“Answer me,” he demanded. “Are you an FBI agent?”\u003c/p\u003e\n\u003cp\u003eHe wasn’t going to budge until she responded. She swallowed, then whispered, “Sort of.”\u003c/p\u003e\n\u003cp\u003eThen Chrystal, who, Avery decided, really did have a big mouth, said, “She told me she left her ID in the car, but she’d go get it if I wanted to see it.”\u003c/p\u003e\n\u003cp\u003e“I’m leaving,” Avery announced. She used every ounce of strength she possessed to push John Paul out of her way so she could get out the door.\u003c/p\u003e\n\u003cp\u003eHe didn’t move an inch. “We’ll be talking about this later.”\u003c/p\u003e\n\u003cp\u003eShe waited until he stepped back, then brushed past him. Childishly wanting to have the last word, she muttered, “No, we won’t.”\u003c/p\u003e\n\u003cp\u003eThe SUV fantailed out of the lot onto the dirt road when John Paul floored it, the tires spitting up pebbles and dirt clumps. He headed toward the river and was driving like a lunatic.\u003c/p\u003e\n\u003cp\u003e“Slow down,” she ordered.\u003c/p\u003e\n\u003cp\u003eHe eased up on the pedal while Avery went over the directions. “I should have asked Chrystal to give me a guess as to how many miles Coward’s Crossing was from the store.”\u003c/p\u003e\n\u003cp\u003e“We’re going to be hiking,” he said.\u003c/p\u003e\n\u003cp\u003e“I’ll keep up with whatever pace you set.”\u003c/p\u003e\n\u003cp\u003e“We’ll see. Tell me, what did the woman on the phone say?”\u003c/p\u003e\n\u003cp\u003eShe repeated the conversation and added, “I demanded to talk to Carrie, but she said that wasn’t possible.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “And yet you still believe your aunt’s alive?”\u003c/p\u003e\n\u003cp\u003e“Yes, I do. I think the woman wants to keep Carrie around . . . for a little longer anyway.” She didn’t have a valid reason for why she felt that way. Maybe it was just desperate hope on her part. “You know what I don’t understand?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Why are they going to so much trouble if they want to kill me? Why make it complicated? There was ample opportunity to ambush me on the way to the spa, before you were even involved. It would have been so much simpler.” She slapped her forehead. “Of course. They didn’t know I was going to drive to the spa. When I missed my flight, they had to improvise. You were another complication. You were hanging around the spa asking questions. Now it makes sense.” \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-25.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
