{"id":89333,"no":29,"title":"Page 29","content":"\u003cp\u003eThe river zigged and zagged, but they were getting closer to the bank. She started kicking with all her might. John Paul hooked one arm over the branch and steered their lifeline in the same direction. When they finally reached shallow water, he stood and pulled her to the bank.\u003c/p\u003e\n\u003cp\u003eSprawled out side by side on the grassy slope, they were both too exhausted to move. Avery was gulping in air and shivering so much her teeth were chattering.\u003c/p\u003e\n\u003cp\u003e“You okay, sugar?” he panted.\u003c/p\u003e\n\u003cp\u003eShe suddenly bolted upright and gagged. She thought she might have swallowed half the river.\u003c/p\u003e\n\u003cp\u003e“Can you swim?” she said between gasps. “Is that what you asked me after you shoved me off that ledge?”\u003c/p\u003e\n\u003cp\u003e“So you heard me, huh?” He reached over and gently pushed her dripping hair out of her eyes.\u003c/p\u003e\n\u003cp\u003eShe looked back at the raging river. God surely had a hand in their survival, she thought. There simply wasn’t any other explanation possible.\u003c/p\u003e\n\u003cp\u003e“Okay, so now we know what a fiver is,” she said.\u003c/p\u003e\n\u003cp\u003eHe sat up. “Yeah?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “They obviously rate the rapids,” she explained. “This one was the big mother. A fiver.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. They had just been through hell together, and all she wanted to do was tell him how they rate rapids?\u003c/p\u003e\n\u003cp\u003e“Did you hit your head or something?”\u003c/p\u003e\n\u003cp\u003e“No, I just figured out the rating system. That’s all.”\u003c/p\u003e\n\u003cp\u003e“Want to go again?”\u003c/p\u003e\n\u003cp\u003e“Been there, done that,” she said. Squinting up at the cliffs above them, she said, “I think we lost him.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” he said. Reluctant as he was to move, he forced himself to get up. He shook himself like a dog who’d just had a bath, then offered her his hand.\u003c/p\u003e\n\u003cp\u003eShe made the mistake of clasping hold. He yanked her to her feet, pulling on her socket again. The man didn’t know his own strength. Now what was he doing? He’d turned and was surveying the area they’d just vacated.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Grab some brush and throw it over our imprints. No, never mind. You’ll only make it worse. I’ll do it.”\u003c/p\u003e\n\u003cp\u003eShe walked into the protection of the trees and watched him pull several small branches over the soft earth. “Why is it that you automatically assume I’m incompetent? Is it just me you have a problem with, or are you that way with every woman?”\u003c/p\u003e\n\u003cp\u003e“Just you.”\u003c/p\u003e\n\u003cp\u003eShe saw him grin before he turned away. He got a kick out of irritating her, she decided, but she was too weary from near heart failure in the rapids to rise to his bait.\u003c/p\u003e\n\u003cp\u003e“Do you have any idea where we are?” she asked. Her words sounded slurred, and she was shaking almost violently now.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t the answer she was hoping for. “So I guess you weren’t a Boy Scout?”\u003c/p\u003e\n\u003cp\u003e“I can get us where we need to go.”\u003c/p\u003e\n\u003cp\u003e“Back to the car?”\u003c/p\u003e\n\u003cp\u003e“No. It would take too long trying to find a place to cross over the water.”\u003c/p\u003e\n\u003cp\u003e“We need to get to a phone.” And a hot shower and dry clothes, she silently added.\u003c/p\u003e\n\u003cp\u003eHe finished covering their footprints, stepped back to survey his handiwork, and nodded with satisfaction.\u003c/p\u003e\n\u003cp\u003e“A phone’s a given,” he said as he walked closer to her. “Damn, babe, you’re freezing, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“You’re not?” she asked as he took her into his embrace and began to vigorously rub her arms.\u003c/p\u003e\n\u003cp\u003e“I’m okay,” he answered. “I’ve got ice water in my veins, or so I’ve been told.”\u003c/p\u003e\n\u003cp\u003e“Who would say such a thing?” she asked.\u003c/p\u003e\n\u003cp\u003e“My sister.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Then, “She ought to know.”\u003c/p\u003e\n\u003cp\u003e“Do you have any strength left?” He was unzipping her windbreaker so he could get to his gun. His weapon was just a little damp. He shoved it into the back of his jeans and zipped her pocket closed again.\u003c/p\u003e\n\u003cp\u003e“I have as much strength as you do.”\u003c/p\u003e\n\u003cp\u003e“Then start jogging. You’ll get warm in no time.”\u003c/p\u003e\n\u003cp\u003e“Which way?”\u003c/p\u003e\n\u003cp\u003e“We have to go up before we can go down.”\u003c/p\u003e\n\u003cp\u003eShe looked at the mountains surrounding them. “It would be easier to follow the river, but Monk would anticipate.”\u003c/p\u003e\n\u003cp\u003eShe turned around and started jogging at a fast clip through the woods. Water sloshed between her toes as she ran. The sensation of ice cubes melting around her feet wasn’t pleasant.\u003c/p\u003e\n\u003cp\u003eJohn Paul kept pace with her for over an hour. They neither stopped nor spoke to each other.\u003c/p\u003e\n\u003cp\u003eHe was impressed with her stamina. Once she had established the rhythm, she didn’t slow down. She didn’t complain either, and she wasn’t clutching her side. He already knew she was in shape. One look at her body and he could tell she worked out. Still, the way she kept moving, so steady and sure, was proof that she did more than take a one-hour aerobics class once a week at some little spa back home.\u003c/p\u003e\n\u003cp\u003eHe spotted the clear-water creek ahead and thought they should stop to catch their breath.\u003c/p\u003e\n\u003cp\u003e“Let’s stop for a minute.”\u003c/p\u003e\n\u003cp\u003eThank God, thank God. “Are you sure you don’t want to keep going?”\u003c/p\u003e\n\u003cp\u003eIf he had said yes, she thought she would either burst into tears or keel over from exhaustion. The stitch in her side felt like someone was holding a hot coal against her ribs, and it had taken all she had not to grab hold and double over.\u003c/p\u003e\n\u003cp\u003eShe noticed he didn’t appear to be the least winded. Avery stretched her legs so they wouldn’t cramp on her before she collapsed to the ground. Scooping up water with cupped hands, she greedily drank.\u003c/p\u003e\n\u003cp\u003e“Do you think he’s tracking us?” she asked a minute later.\u003c/p\u003e\n\u003cp\u003e“Probably,” he answered. “But he’ll have to find a place to cross over those rapids, so we have some time. Tell me what happened at the car.” He had been silently cursing himself for leaving her.\u003c/p\u003e\n\u003cp\u003eShe sat down in the grass and leaned back against the tree. “I woke up and you were gone,” she said. “So I decided to follow you.”\u003c/p\u003e\n\u003cp\u003eHis shoulder rubbed against hers as he sat beside her.\u003c/p\u003e\n\u003cp\u003e“I didn’t get far,” she admitted. “I had just started up the hill when I saw the headlights through the mist. Honest to Pete, I almost ran out to flag it down, but thankfully, I came to my senses and decided to wait until the car came closer.”\u003c/p\u003e\n\u003cp\u003e“Ah, man,” he whispered. “You could have walked right up to him before you . . .” He couldn’t go on. The thought of what could have happened to her made him sick.\u003c/p\u003e\n\u003cp\u003e“He parked his car down below, then got out. He had a flashlight and a rifle tucked under his arm as he climbed the hill to where your car was hidden. He must have pinpointed the location before you moved the watch. I knew it was Monk, of course, so I stayed hidden.”\u003c/p\u003e\n\u003cp\u003e“Then what happened?”\u003c/p\u003e\n\u003cp\u003e“He checked out the car.”\u003c/p\u003e\n\u003cp\u003e“Did you see his face?”\u003c/p\u003e\n\u003cp\u003e“No. I could have if I’d moved, but I was afraid I’d make a noise, and he’d know I was there, watching. He opened the hood of your car, pulled something out, and threw it into that gully on the side of the hill. I could find it if we go back. He had the hood of his windbreaker up, so I couldn’t see his face or the color of his hair, but he was at least six feet. He wasn’t thin, though. He was quite muscular, not heavyset. He reminded me of a bodybuilder.”\u003c/p\u003e\n\u003cp\u003e“He’s good with disguises,” he said. “Noah’s description is what the FBI is using, but he didn’t get a clear look at him either. From what I’ve heard about Monk, he could be in the same room with Noah today, and I doubt he would be recognized.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if he was alone or not. He was driving a Land Rover, but when he opened the door and got out, the light didn’t go on, and he parked it a good distance away. I couldn’t see inside. Do you think the woman was with him?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“He’s very good at what he does, isn’t he?” She sounded disheartened.\u003c/p\u003e\n\u003cp\u003e“Yes, he is,” he said.\u003c/p\u003e\n\u003cp\u003e“He stood there a long time, maybe five minutes,” she said. “He didn’t move a muscle. It was creepy.”\u003c/p\u003e\n\u003cp\u003e“He was probably listening to the sound of the forest, hoping to hear something.”\u003c/p\u003e\n\u003cp\u003e“Like me.”\u003c/p\u003e\n\u003cp\u003e“Yes.” He put his arm around her and pulled her close. “Thank God you didn’t try to run.”\u003c/p\u003e\n\u003cp\u003e“I thought about trying to get my gun out of my pocket, but I was so close to him I worried he’d hear the sound of the zipper.”\u003c/p\u003e\n\u003cp\u003e“If you had been asleep, Monk . . .”\u003c/p\u003e\n\u003cp\u003eBefore he could finish his bleak thought, she interrupted. “He’d shoot me? I’ll tell you what, John Paul. If you ever leave me behind again, that’s exactly what I’m going to do to you.”\u003c/p\u003e\n\u003cp\u003eSince she was all but clinging to him so that she could borrow some of his warmth, the threat didn’t carry much weight.\u003c/p\u003e\n\u003cp\u003e“I won’t leave you again,” he promised in a gruff whisper. “I never should have left you. Hell, I guess I’ve been away from it too long. My instincts are all screwed up.”\u003c/p\u003e\n\u003cp\u003eShe homed in on what he’d just said. “You’ve been away from it too long? What exactly is it, John Paul?”\u003c/p\u003e\n\u003cp\u003e“Come on, sugar. We should get moving. Time’s a-wasting.”\u003c/p\u003e\n\u003cp\u003eIn other words, leave it alone. She decided to accommodate him now and try again later. She was stiff and sore when she stood. Groaning, she rubbed her backside, not caring that she appeared less than ladylike.\u003c/p\u003e\n\u003cp\u003e“You know what I need?”\u003c/p\u003e\n\u003cp\u003e“Food, dry clothes . . .”\u003c/p\u003e\n\u003cp\u003e“Yes, that too,” she said. “But what I also need is to get into my yoga position, relax, and do my free-association exercises.”\u003c/p\u003e\n\u003cp\u003e“Your what?” He was sure he hadn’t heard correctly.\u003c/p\u003e\n\u003cp\u003eShe repeated. “You let the fragments drift in your mind; then when you’re completely relaxed, you take hold of one at a time and you analyze it. You can’t do it, though, until you reach total relaxation.”\u003c/p\u003e\n\u003cp\u003eJohn Paul watched her stretch her long legs. “So how do you reach total relaxation?” he asked.\u003c/p\u003e\n\u003cp\u003e“Visualization,” she said. “I go to a place where I feel completely safe and free, like a real home. You know, I go to my . . . happy place.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You do know you sound insane, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe wasn’t joking when she answered. “It runs in the family.”\u003c/p\u003e\n\u003cp\u003eShe clasped her hands behind her back and twisted her torso, then shook her arms and legs to loosen them and started running again, her pace slower this time, but just as determined. Once again, he fell in right behind her and stayed there until she was panting for breath. They’d been climbing steadily since they’d left the river, and so far they hadn’t seen a single sign of civilization. Where in thunder were they? Were they even still in Colorado?\u003c/p\u003e\n\u003cp\u003eShe suddenly stopped, doubled over, and took a couple of deep, gulping breaths. Then she put her hands on her h*ps and slowly straightened.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked.\u003c/p\u003e\n\u003cp\u003eWhy wasn’t he winded? He was human, wasn’t he? She made up her mind that, no matter what, she wouldn’t utter one word of complaint. Not one frickin’ word.\u003c/p\u003e\n\u003cp\u003e“Can’t see the forest for the trees.” She tried to sound flip. Cheerful was simply too much to ask for.\u003c/p\u003e\n\u003cp\u003eJohn Paul was sympathetic. “Do you want to rest?”\u003c/p\u003e\n\u003cp\u003eIs the Pope Catholic? Does it always rain on picnics? Hell, yes, she wanted to rest.\u003c/p\u003e\n\u003cp\u003e“No,” she said weakly. Then, more forcefully, “I’m good to go . . . unless you want to . . .”\u003c/p\u003e\n\u003cp\u003e“No,” he said. “Let’s keep moving.”\u003c/p\u003e\n\u003cp\u003e“Are we still heading north?” she asked, stalling for another minute to catch her breath. The air was so thin, she felt light-headed. “I can’t seem to get my bearings. If the sun were out . . .”\u003c/p\u003e\n\u003cp\u003e“We’re going northeast.”\u003c/p\u003e\n\u003cp\u003eOne foot in front of the other, she told herself. Steady as you go. Come on, Delaney, pick up the pace. Time’s a-wasting. Suck it up.\u003c/p\u003e\n\u003cp\u003eShe kept up the steady barrage of psychological nagging as she ran through the forest. She tried not to think about her soggy underwear sticking to her skin or the fact that she was lugging around at least a pound of mud on each of her hiking boots.\u003c/p\u003e\n\u003cp\u003eShe didn’t quite clear the dead branch she tried to jump over, tripped, and would have gone headfirst into a tree trunk if John Paul hadn’t grabbed her. The terrain was getting steeper, more treacherous. As she raced along, the muscles of her calves began to burn, and she was finally forced to slow down when they broke through the trees.\u003c/p\u003e\n\u003cp\u003eShe suddenly stopped. They had reached a shelf of rock that hung out over the side of the mountain. Spread out before them was a panoramic view of the lower hills. Lush green meadows were tucked in between towering peaks with hundreds and hundreds of trees, their branches stretching toward heaven. Everything was so green, so alive. And not a soul was around. People surely flocked to this paradise, didn’t they? So where were they all hiding?\u003c/p\u003e\n\u003cp\u003e“Isn’t it picturesque?”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, it’s picturesque,” he mumbled.\u003c/p\u003e\n\u003cp\u003eDesperately trying to stay positive, she said, “Is your cup always half empty? Can’t you appreciate—”\u003c/p\u003e\n\u003cp\u003eHe cut her off. “Have you noticed where we are? It’s going to take us a couple of days to get back to civilization.” He studied the lay of the land below looking for roads, but he wasn’t having any luck. He had, at least, gotten his bearings back.\u003c/p\u003e\n\u003cp\u003e“We don’t have that much time,” she said. Her shoulders slumped, and as she looked around her, the beauty suddenly turned menacing, and the realization of their predicament sank in. Could it get any more bleak? She wanted to cry, but she didn’t give in to the urge. Suck it up, she told herself. “It’ll be okay,” she asserted.\u003c/p\u003e\n\u003cp\u003e“Yeah? What makes you think so?”\u003c/p\u003e\n\u003cp\u003eShe had to think about it for a minute before she could come up with anything. “Because we’re due for a break.”\u003c/p\u003e\n\u003cp\u003eAnd that was when it started raining again.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eANNE WAS ONE OF THE MOST UPTIGHT, RIGID WOMEN Carrie had ever met. She was certain the woman wouldn’t be at all helpful, but she was proven wrong. Anne more than held her own. After she finished tying together the sheets, she helped them with the wall. She was a hard worker, with surprising stamina. She didn’t have any sense of humor, but then, there really wasn’t anything to laugh about, was there? As long as Anne’s sacred marriage wasn’t discussed, she was almost pleasant to be around. \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-29.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
