{"id":89341,"no":37,"title":"Page 37","content":"\u003cp\u003eShe knew what that meant. When Avery was little and wanted something Carrie didn’t want her to have, she used the very same phrase. It hadn’t worked on Avery then, and it wasn’t working on Carrie now.\u003c/p\u003e\n\u003cp\u003e“I want something.”\u003c/p\u003e\n\u003cp\u003e“You’ve suffered a concussion, Mrs. Salvetti, and I would rather—”\u003c/p\u003e\n\u003cp\u003eShe cut him off. “Oh, never mind. Doctor, a friend of mine rode with me in the ambulance. Her leg was all torn up. Where is she? Do you know?”\u003c/p\u003e\n\u003cp\u003eThe doctor nodded. “Judge Collins is in surgery,” he explained.\u003c/p\u003e\n\u003cp\u003eThere was a hard rap on the door. The doctor closed the chart, smiled at her, and turned to leave. “You need to rest,” he said as he opened the door and let two men in dark suits rush inside. “Ten minutes,” he said to the agents, “then she needs to get some sleep.”\u003c/p\u003e\n\u003cp\u003eThey moved like soldiers on parade, arms stiff, heads high. They were also dressed alike, except for the choice of tie colors. One wore a gray-and-black-striped tie, and the other had on a muted plaid.\u003c/p\u003e\n\u003cp\u003eAn agent named Hillman was in charge. There was a sharpness about his eyes she found comforting. She didn’t think he would miss much.\u003c/p\u003e\n\u003cp\u003eThe other, younger agent pushed the button to elevate her back, poured her a glass of water, and hovered at her side while Hillman questioned her. He led her through the sequence of events, rarely interrupting when she paused to collect her thoughts. She wanted to tell him everything at once, impatient to ask questions of her own, but Hillman was tenacious and made her keep to his agenda.\u003c/p\u003e\n\u003cp\u003eShe turned to the more cooperative agent and asked him to find her jacket.\u003c/p\u003e\n\u003cp\u003e“The letters are in the pocket.”\u003c/p\u003e\n\u003cp\u003eHillman found the jacket hanging in the built-in closet. He pulled on a pair of gloves and dropped the envelopes into a Ziploc bag the other agent held out for him.\u003c/p\u003e\n\u003cp\u003e“Anne gave a letter to me. I want to read it.”\u003c/p\u003e\n\u003cp\u003e“We’ll let the lab dust it for prints,” the sidekick told her.\u003c/p\u003e\n\u003cp\u003eShe’d thought he was more malleable than Hillman, but now she realized he was just as tenacious.\u003c/p\u003e\n\u003cp\u003e“I want to know what that sick bastard of a husband wrote to her. He hired Monk to kill her, you know. You have to arrest him.”\u003c/p\u003e\n\u003cp\u003eIgnoring her demand, Hillman resumed his questions. Carrie had had enough. “No, it’s my turn. I want to know where my niece is.”\u003c/p\u003e\n\u003cp\u003e“We’re searching for her . . .”\u003c/p\u003e\n\u003cp\u003e“Find her.”\u003c/p\u003e\n\u003cp\u003eSeeing how distraught Carrie was, sidekick offered her a sip of water by holding the straw under her nose. She turned her head.\u003c/p\u003e\n\u003cp\u003e“Tell me what you know about . . .” Hillman once again tried to get her back on track.\u003c/p\u003e\n\u003cp\u003e“I want an update on Judge Collins, and I want it now.”\u003c/p\u003e\n\u003cp\u003eThe agents exchanged a glance, and then Hillman answered. “She’s out of surgery and in ICU.”\u003c/p\u003e\n\u003cp\u003e“So far, so good,” the other man said.\u003c/p\u003e\n\u003cp\u003eShe glared at him. “What’s your name?”\u003c/p\u003e\n\u003cp\u003e“Bean, ma’am. Agent Peter Bean.”\u003c/p\u003e\n\u003cp\u003eNo wonder he hadn’t introduced himself. Saddled with a name like that, she wouldn’t have told anyone either. Bet they called him string bean in grade school, she thought.\u003c/p\u003e\n\u003cp\u003eHillman started the questions all over again. For an hour he kept it up, grilling her, going over the same facts again and again until she began to feel as if she were the criminal they were trying to get to confess.\u003c/p\u003e\n\u003cp\u003eHer head was pounding. “That’s it,” she said. “I can’t answer any more questions now.”\u003c/p\u003e\n\u003cp\u003eHillman looked disappointed, but he agreed to let her rest for a little while. She wasn’t in the mood to be cordial. She told them not to come back until they had news about Avery. To calm her down—she was shouting now—Hillman let her call her husband. Bean dialed the number for her. The second she heard Tony’s voice over the phone, she burst into tears.\u003c/p\u003e\n\u003cp\u003e“I need you, Tony. You have to come to Aspen.”\u003c/p\u003e\n\u003cp\u003eHis voice shook with emotion as he replied, “Sweetheart, they told me I couldn’t. They said as soon as you’re discharged from the hospital they’re going to move you and the judge to a safe house somewhere. Carrie, love, are you all right? I wish I could be there with you. I wish . . . I’m sorry you’re going through this alone.”\u003c/p\u003e\n\u003cp\u003e“Have you heard from Avery?”\u003c/p\u003e\n\u003cp\u003e“No,” he answered. “I didn’t know she was planning to join you at the spa. One of the agents who came to talk to me told me she missed her flight.”\u003c/p\u003e\n\u003cp\u003e“I don’t know where she is,” she sobbed.\u003c/p\u003e\n\u003cp\u003e“We’ll find her,” he promised. “Nothing’s going to happen to her. I promise you. And I’m keeping the line open. She’ll call. I know she’ll call.”\u003c/p\u003e\n\u003cp\u003e“Tony, I didn’t realize . . . I’m so sorry about everything. You can have Star Catcher. You can run it any way you want. I don’t care about any of that anymore. I should have trusted you. I’ve been such a fool.”\u003c/p\u003e\n\u003cp\u003eShe was sobbing now and angry because the agents were listening to every word.\u003c/p\u003e\n\u003cp\u003e“I love you,” she whispered. “I do, Tony. I love you very much. Please . . . tell me it isn’t too late.”\u003c/p\u003e\n\u003cp\u003e“No, no, it isn’t. I can . . . I love you too,” he stammered. “I’ll get on the next plane. We’ll make our marriage work again. Anything is possible with your love. Anything.”\u003c/p\u003e\n\u003cp\u003eChapter 30\u003c/p\u003e\n\u003cp\u003eANY HOPE THAT THE FBI WOULD BE ABLE TO KEEP THE names of the survivors out of the papers and off the television had been squelched when a news crew filmed Carrie and the judge being carried into the ambulance near the site of the explosion.\u003c/p\u003e\n\u003cp\u003eAvery heard about it on the radio as she and John Paul were driving through the mountains. As soon as they’d left the sleepy town, she’d climbed in front, clipping him on the shoulder with her left foot when she fell into the passenger seat. Her shoe fell in his lap. Shaking his head over her awkwardness, he handed her the shoe while she apologized.\u003c/p\u003e\n\u003cp\u003eThey continued to listen to the broadcast until the signal faded. “Does everyone in the United States carry video cameras now?” he asked. He sounded disgusted. “Some people just love invading other people’s privacy.”\u003c/p\u003e\n\u003cp\u003e“Film crews from television stations usually carry cameras,” she said.\u003c/p\u003e\n\u003cp\u003e“No need to be sarcastic, sugar.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t being sarcastic. I was simply pointing out a fact. Carrie must have hated having a camera in her face. Someone from the FBI should have grabbed the film. The crime-scene investigators must not have gotten there in time.”\u003c/p\u003e\n\u003cp\u003e“Should’ve, could’ve,” he drawled. “That’s the Bureau’s motto.”\u003c/p\u003e\n\u003cp\u003e“You’re not going to rile me.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “I wasn’t trying to.”\u003c/p\u003e\n\u003cp\u003eShe rolled the window down and let the cool night air in. “Yes, you were,” she said. “I’ve finally gotten you all figured out.”\u003c/p\u003e\n\u003cp\u003e“You think so?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “When I first met you, I thought you must have some kind of grudge against the FBI, but now that I know you better, I realize that isn’t true at all. Your phobia is much bigger than that.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “You don’t like any government agency.”\u003c/p\u003e\n\u003cp\u003e“That’s not true.”\u003c/p\u003e\n\u003cp\u003e“When we talked about your brother-in-law working for the Justice Department, you sneered.”\u003c/p\u003e\n\u003cp\u003e“Justice has too much power.”\u003c/p\u003e\n\u003cp\u003e“What about the CIA? I know you worked for them.”\u003c/p\u003e\n\u003cp\u003eHe didn’t argue or deny. “Their priorities change on a whim, leaving agents and civilians out there to hang.”\u003c/p\u003e\n\u003cp\u003e“What about the IRS?”\u003c/p\u003e\n\u003cp\u003e“Everyone hates the IRS.”\u003c/p\u003e\n\u003cp\u003eShe’d give him that one. She kept on naming government agencies, and he continued to tell her what was wrong with each one of them.\u003c/p\u003e\n\u003cp\u003e“I think I’ve made my case. You know what your biggest problem is?”\u003c/p\u003e\n\u003cp\u003e“No, but you’re going to enlighten me, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” she said. “You don’t like anyone in a position of authority.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t offended by her analysis. “You know what they say. Absolute power corrupts absolutely.”\u003c/p\u003e\n\u003cp\u003e“The FBI doesn’t have absolute power.”\u003c/p\u003e\n\u003cp\u003e“They think they do.”\u003c/p\u003e\n\u003cp\u003e“You know what I say?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Therapy. You need intense therapy to help you get rid of your hostility.”\u003c/p\u003e\n\u003cp\u003eBefore he could tell her he hated therapy too, she changed the subject. “I need to get to a phone and call Carrie.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you call her from the police station?”\u003c/p\u003e\n\u003cp\u003e“Because you would have left without me. I still can’t believe you were going to abandon me. I get mad every time I think about it.”\u003c/p\u003e\n\u003cp\u003eShould he tell her the truth or not? He clenched his jaw while he thought about it. She’d sounded so disappointed in him, even hurt.\u003c/p\u003e\n\u003cp\u003e“Look . . .” he began, and then stopped.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Maybe I was going to stay.”\u003c/p\u003e\n\u003cp\u003e“Maybe?” She poked him in his arm. “What does that mean?”\u003c/p\u003e\n\u003cp\u003e“It means I was gonna stay. Now it’s your turn to squirm. How come you decided to leave your super team?”\u003c/p\u003e\n\u003cp\u003e“Stop calling them that. I’m sure Agent Knolte and the other agents are quite capable of doing a good job.”\u003c/p\u003e\n\u003cp\u003e“Yeah? Then, I repeat, why did you decide to go with me?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “I thought about what you said, and I agreed. It isn’t smart to put all of us together in the same safe house.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And what? Are you waiting for a compliment?”\u003c/p\u003e\n\u003cp\u003eBefore he could tell her the thought hadn’t crossed his mind, she said, “Okay, fine. I think I have a better chance of surviving with you.”\u003c/p\u003e\n\u003cp\u003e“What made you cross over to the dark side?” he asked, grinning. “Did Knolte say or do something that turned you into a rogue agent?”\u003c/p\u003e\n\u003cp\u003e“I’m not an agent. I’m an analyst, and he didn’t say or do anything. I still have complete faith in the Bureau. No one is more loyal than I am.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” he said. “So why’d you leave?”\u003c/p\u003e\n\u003cp\u003eShe had to think about it for awhile. “I’m taking initiative. We’re taught to do that at the Bureau.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right,” he scoffed. He nodded toward a sign on the side of the two-lane road. “There’s a restaurant five miles ahead,” he said. “I need to make a call too and get us some help.”\u003c/p\u003e\n\u003cp\u003eMr. Loner was going to ask someone for help? That was a shock.\u003c/p\u003e\n\u003cp\u003e“Then what?” she asked.\u003c/p\u003e\n\u003cp\u003e“You can call Carrie, but don’t tell her where we’re headed.”\u003c/p\u003e\n\u003cp\u003e“How can I? I don’t know where we’re going.”\u003c/p\u003e\n\u003cp\u003eHe picked up the folded paper. “Chief Tyler has a cabin a couple of hours away. It’s got a barn, and I can hide the car inside. We’ll stay there tonight.”\u003c/p\u003e\n\u003cp\u003eShe glanced out the back window once again to make sure they weren’t being followed. They hadn’t seen another car in a long time, and she realized she was probably being a little paranoid, but she continued to stay on guard. One couldn’t be too cautious, she reasoned.\u003c/p\u003e\n\u003cp\u003e“Do you have any guesses where Monk might be?”\u003c/p\u003e\n\u003cp\u003e“He’s probably still in Colorado, and by now he’s heard that your aunt and the judge are still alive.”\u003c/p\u003e\n\u003cp\u003e“The FBI will be looking for us too,” she said.\u003c/p\u003e\n\u003cp\u003e“Not us, sugar. You. They’ll be looking for you.”\u003c/p\u003e\n\u003cp\u003e“I turned the shower on in case one of the agents came upstairs, and I locked the dormitory door, but eventually Knolte will find out I’m gone, and he’ll sound the alarm.”\u003c/p\u003e\n\u003cp\u003eAnd then all hell was going to break loose. When Carter found out about the situation, he’d have her ass on a platter. She already had her argument rehearsed. She’d insist it wasn’t insubordination. Carter was tough, but he was also a reasonable man. Surely he would see the merits of her taking initiative . . . again.\u003c/p\u003e\n\u003cp\u003e“Will the chief tell Knolte he offered you the use of his cabin?” she asked.\u003c/p\u003e\n\u003cp\u003e“No, he won’t,” he said. “Did he know you were going out the window?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eJohn Paul took the exit and pulled into the tarred parking lot adjacent to the restaurant. The neon letters were blinking Open.\u003c/p\u003e\n\u003cp\u003e“Are you going to tell me about Jilly?” He had avoided bringing up that subject until now because he had seen how Avery reacted when Tyler called the woman her mother. She didn’t answer him. “You’re going to have to tell me what I’m up against.”\u003c/p\u003e\n\u003cp\u003e“What we’re up against,” she said. “Yes, I’ll tell you what I know, but not on an empty stomach. Tomorrow,” she promised, “I’ll tell you everything.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eHe took her hand as they walked into the diner. The colors inside made both of them squint. The walls were painted a neon purple and orange as a backdrop to the white Formica countertops. A jukebox sat just inside the door. Elvis Presley was singing “All Shook Up” as they made their way down the narrow aisle.\u003c/p\u003e\n\u003cp\u003eJohn Paul chose a booth against the wall so he could watch the parking lot. He waited until Avery slid into the orange vinyl seat and then sat down across from her.\u003c/p\u003e\n\u003cp\u003eThe waitress was a teenager, but she shuffled like a ninety-year-old. Her tongue was pierced, which gave her a speech impediment when she spoke.\u003c/p\u003e\n\u003cp\u003e“What can I git ya?”\u003c/p\u003e\n\u003cp\u003eThey ordered turkey sandwiches and iced tea. As soon as the waitress went behind the counter, Avery dug some change out of her billfold and headed for the telephone she had spotted at the end of the aisle, between the men’s and women’s rest rooms.\u003c/p\u003e\n\u003cp\u003eThe conversation with Carrie was mostly one-sided. Her aunt was in a state. “Where are you?” she demanded. “Why aren’t you here? Are you all right? Did you hear? Jilly’s alive. The demon faked her own death. I didn’t think she was that smart. She’s like a cat, Avery. Yeah, that’s what she is. Do you realize, if you had shown up at the spa when you were supposed to, you’d have been inside that house with us?”\u003c/p\u003e\n\u003cp\u003e“Carrie, slow down,” Avery said when her aunt finally paused.\u003c/p\u003e\n\u003cp\u003eCarrie took a deep breath and then told her some of what had happened from the moment she’d gotten into the car with Monk and the other women. Avery didn’t say a word while she listened to the grisly highlights.\u003c/p\u003e\n\u003cp\u003e“When I see you, I’ll tell you everything,” Carrie promised. “How are you doing?” \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-37.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
