{"id":89343,"no":39,"title":"Page 39","content":"\u003cp\u003e“Lots of things.”\u003c/p\u003e\n\u003cp\u003e“I know you worked for the CIA. What was your talent then?”\u003c/p\u003e\n\u003cp\u003eHe didn’t deny it. “Shooting. I was a good shooter. No, that’s not true. I wasn’t just good. I was great. Eyesight of an eagle.”\u003c/p\u003e\n\u003cp\u003e“Anything else you’re good at doing?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he drawled. He put his arm around her waist and began to slowly pull her toward him. “I’m real good at a couple of other things too.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003eHe drew her closer and put his lips to her ear. “If things go the way I plan, you’ll get to see firsthand,” he whispered.\u003c/p\u003e\n\u003cp\u003e“Oh, brother,” she answered breathlessly.\u003c/p\u003e\n\u003cp\u003eCould he feel her goose bumps? Probably, she thought as she sighed and turned to look into his eyes.\u003c/p\u003e\n\u003cp\u003eSmiling gently, he kissed her warm, soft mouth, taking his time coaxing a response. She was becoming impossible to resist. The dazed look in her eyes made him feel arrogantly pleased with himself. “We’d better get out of here before I get carried away and show you right now.”\u003c/p\u003e\n\u003cp\u003eHe opened the door for her and then got behind the wheel. They drove out of the lot and once again headed toward Denver. “We need to put some distance between us and that diner,” he told her. “The waitress will remember you.”\u003c/p\u003e\n\u003cp\u003e“You think so?”\u003c/p\u003e\n\u003cp\u003e“Yeah. You’re definitely memorable.”\u003c/p\u003e\n\u003cp\u003e“News flash, sugar,” she drawled, trying to imitate his sexy southern accent. “Bubble Gum was staring at you.”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “It’s going to take us at least another hour or more to get to Tyler’s cabin. If I see a store on the way, we’ll stop and get some supplies.”\u003c/p\u003e\n\u003cp\u003e“I doubt anything will be open this late.”\u003c/p\u003e\n\u003cp\u003e“And that’s important because?”\u003c/p\u003e\n\u003cp\u003e“Shame on you. You’re going to break in?”\u003c/p\u003e\n\u003cp\u003e“They’ll never know I was there.”\u003c/p\u003e\n\u003cp\u003eShe didn’t try to dissuade him. She was too busy thinking about his earlier remark. What would happen if things went the way he planned?\u003c/p\u003e\n\u003cp\u003eThirty miles down the road, they found a fish-and-tackle/ grocery store. It was dark inside.\u003c/p\u003e\n\u003cp\u003eJohn Paul’s skills seemed endless. He got the door unlocked without making a scratch, charmed the black Doberman guard dog, and shopped to his heart’s content. She helped him carry two gallons of milk and four grocery sacks to the car.\u003c/p\u003e\n\u003cp\u003eHe calculated the expense as he sacked the items and left four twenty-dollar bills sticking out from under the cash register.\u003c/p\u003e\n\u003cp\u003e“How long are we going to be staying at Tyler’s place?” she asked when they were once again on their way. “We’ve got enough food for a month.”\u003c/p\u003e\n\u003cp\u003e“We’ll stay at least one night, maybe two,” he answered. “Tyler told me there’s a little town about fifteen miles from the cabin. I’ve got Theo checking on a couple of things, and when I find out what is going on, we’ll decide what to do.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to miss that trial.”\u003c/p\u003e\n\u003cp\u003e“I understand. May I ask you something?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“Is Skarrett the reason you can’t have children?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she said. “A bullet hit just right, but you know what? I would never have had children anyway. I wouldn’t take the risk that what’s wrong with Jilly is genetic. So, you see, it doesn’t matter.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it does,” he argued. “Skarrett took that choice away from you. That’s what matters.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t keep the anger out of his voice, but she didn’t become upset. What he’d said was true.\u003c/p\u003e\n\u003cp\u003eShe changed the subject to a less stressful one, talking about silly things that had happened to her when she was growing up. He told her stories about his life and his family, and when he talked about his father, she laughed several times.\u003c/p\u003e\n\u003cp\u003e“People really call him Big Daddy?”\u003c/p\u003e\n\u003cp\u003e“Yeah, they do. You’ll like him,” he predicted.\u003c/p\u003e\n\u003cp\u003eHe was assuming she would meet his father someday. She’d like that. She wanted to know about his family and his home and his work. She wanted to know everything about him. Before she could continue the conversation, they saw two pairs of headlights coming up the road toward them.\u003c/p\u003e\n\u003cp\u003eHe swerved onto a side road and turned his lights off.\u003c/p\u003e\n\u003cp\u003eThey silently waited until the cars passed by.\u003c/p\u003e\n\u003cp\u003e“When you asked your brother-in-law to help, were you worried he might tell the FBI where we’re going?”\u003c/p\u003e\n\u003cp\u003e“Because he’s with Justice?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Family comes first, sugar. Always.”\u003c/p\u003e\n\u003cp\u003e“Still . . .”\u003c/p\u003e\n\u003cp\u003e“He won’t tell, and he will help. I told him what I needed done, and he agreed.”\u003c/p\u003e\n\u003cp\u003e“Good. I’m glad we can trust him.”\u003c/p\u003e\n\u003cp\u003eThey waited in the dark for a few minutes before he felt it was safe for them to go.\u003c/p\u003e\n\u003cp\u003eAvery’s mind wandered and then circled around and around what he’d whispered in her ear. Maybe if she stopped staring at him, she could think about something else. It had been such a long time since she’d been intimate with a man, and she thought she had become an expert at blocking those thoughts and urges.\u003c/p\u003e\n\u003cp\u003eShe had been an expert anyway, until he came into her life. Now the floodgates were wide open, and all she could think about was touching him. Everywhere.\u003c/p\u003e\n\u003cp\u003eFor thirty more minutes she battled to think about something other than sex. She mentally balanced her checkbook, then calculated how long she could stay in her apartment without a paycheck coming in. Three months or four? If she got fired.\u003c/p\u003e\n\u003cp\u003eShe started tapping her foot on the floor. Who was she kidding? Of course she was going to get fired. They couldn’t arrest her for being insubordinate, but would Carter charge her with hindering an investigation?\u003c/p\u003e\n\u003cp\u003eJohn Paul put his hand on her knee. “How come you’re so jittery?” Then, before she could come up with a good lie, he said, “There it is.”\u003c/p\u003e\n\u003cp\u003eHe pulled onto a dirt road. His night vision was better than hers. She hadn’t even noticed the little curve. “You’re sure?”\u003c/p\u003e\n\u003cp\u003eHis hand was still on her leg, and she wasn’t inclined to move it. She stared straight ahead, pretending to watch the road as she thought about ripping his clothes off him.\u003c/p\u003e\n\u003cp\u003eWas she turning into a slut? She shook her head. No, she was simply having normal urges, like any other woman, but because she hadn’t had those urges in so long, she wasn’t handling herself well.\u003c/p\u003e\n\u003cp\u003e“What are you thinking about?” he asked.\u003c/p\u003e\n\u003cp\u003eSex, damn it. I’m thinking about sex. “Nothing much.”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003eEven his voice was sexy. Threading her fingers through her hair, she realized how tense she was, and how horribly unsure of herself.\u003c/p\u003e\n\u003cp\u003eThey drove around a bank of trees, and then the road flattened into what she thought might be a field. It was impossible to tell in the dark. She began tapping her foot on the floorboard again. She was nervous about being alone with him in the secluded cabin.\u003c/p\u003e\n\u003cp\u003eHe pulled up to the steps in front. When he turned the motor and the lights off, it was pitch black. She couldn’t even see her hand in front of her face.\u003c/p\u003e\n\u003cp\u003e“You stay put until I get the key from under the porch step.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t have moved if her life had depended on it. Her legs felt like rubber, and she thought she just might start hyperventilating. Fortunately, she had her wild thoughts under control by the time he’d unlocked the front door and turned the lights on inside the cabin. She got out and helped him carry in the bags.\u003c/p\u003e\n\u003cp\u003eThe cabin was charming and smelled of pine and Lysol. A stone fireplace faced the front door and was flanked by two wicker chairs with red-and-yellow-checked overstuffed cushions. The hunter green sofa had seen better days, for the arms were frayed, and the fabric was faded, but it looked very comfortable. To the right of the front door was a round pine table and four single ladder-back chairs.\u003c/p\u003e\n\u003cp\u003eBeyond the table was a narrow kitchen with a back door. She placed a bag of groceries on the counter, then walked through the living room to the other side of the cabin. There were two doors along the short hallway. The one on the left opened into a bathroom. At the end of the hall she opened the other door and stepped inside. Soft light spilled into the spacious room. A double bed with an old iron headboard was covered with a multicolored quilt.\u003c/p\u003e\n\u003cp\u003eThe longer she stared at the bed, the faster her heart beat. She could hear John Paul putting the groceries away, knew she should probably help, but couldn’t seem to make herself move.\u003c/p\u003e\n\u003cp\u003e“It’s just a bed, for Pete’s sake. What’s the big deal?”\u003c/p\u003e\n\u003cp\u003eDisgusted with herself for being so nervous, she grabbed her duffel bag and went into the bathroom to take a shower.\u003c/p\u003e\n\u003cp\u003eShe hadn’t bothered to pack a pretty nightgown or a robe. After she dried her hair and brushed her teeth, she put on a pair of skimpy pink panties and her ratty old Santa Clara T-shirt. It was at least three sizes too big for her. It hung like a tent and ended just above her knees.\u003c/p\u003e\n\u003cp\u003eStaring into the mirror, she took inventory and decided she came up lacking in the feminine wiles department. For the first time in her life, she wanted to look pretty. Boy, wouldn’t Carrie have a good laugh now? She was always criticizing the way Avery dressed, and for once, Avery had to agree.\u003c/p\u003e\n\u003cp\u003eThere wasn’t anything she could do about her appearance now. With a sigh, she put her bag in the corner of the bedroom so she wouldn’t trip over it, then walked into the living room just as the front door opened and John Paul came inside. He shut the door, bolted it, then turned around and froze.\u003c/p\u003e\n\u003cp\u003e“What happened to you?” she asked. He didn’t answer her. “You look like you showered in the dirt. What happened?” she repeated.\u003c/p\u003e\n\u003cp\u003eJohn Paul couldn’t make himself stop staring at her legs. Fantasies were raging in his mind. “I put the car in the barn, and I thought . . . the oil . . . the tires . . .”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe finally forced himself to look into her eyes, knowing he probably resembled a buck caught in the headlights. When he’d noticed her standing in the doorway, his knees damned near buckled. That well-scrubbed look was intoxicating. She was simply gorgeous. Did she have any idea of the power she had over him?\u003c/p\u003e\n\u003cp\u003e“What about the oil and the tires?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003eHe was blathering like an idiot, and she was fully responsible for his radical drop in IQ. He strode past her, muttering incoherent words as he went into the bathroom and shut the door.\u003c/p\u003e\n\u003cp\u003eShe took a bottled water out of the fridge, turned the lights off in the kitchen and the living room, and then went into the bedroom. She kept telling herself to relax as she folded the quilt. She found clean sheets on the closet shelf and put them on the bed with a lightweight blanket she pulled out of the cedar chest. She climbed on top, scooted to the middle. Straightening her back, she folded her legs in the lotus position. She tried to clear her mind and concentrate on her breathing. Just as she was about to sit down in her imaginary porch swing without a care in the world, she was interrupted.\u003c/p\u003e\n\u003cp\u003e“Going to your happy place?”\u003c/p\u003e\n\u003cp\u003eHer eyes flew open. John Paul was standing in the doorway watching her. He wore a pair of shorts and nothing else. He hadn’t even bothered to button them. He had taken the time to shave, she noticed, and he’d washed his hair too. There were big drops of water glistening on his tanned neck and shoulders.\u003c/p\u003e\n\u003cp\u003eSitting on the bed definitely put her at a distinct disadvantage. If they were going to approach their situation as adults, she wanted to be on equal footing. She scrambled to get off the bed.\u003c/p\u003e\n\u003cp\u003e“Yes, I was,” she said. “I was trying to relax.”\u003c/p\u003e\n\u003cp\u003eHe yawned loudly. “Avery?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003eHe leaned casually against the doorframe, one ankle crossed over the other, his arms loosely folded across his chest. She tried not to stare at the dark swirl of hair around his navel.\u003c/p\u003e\n\u003cp\u003e“Am I sleeping on the sofa or in the bed?”\u003c/p\u003e\n\u003cp\u003eDid she have the courage to be completely honest with him, to tell him what she wanted? Put up or shut up time, she thought a little frantically. She cleared her throat, then whispered, “In bed . . . with me, if that’s what you want.”\u003c/p\u003e\n\u003cp\u003eDamn it, she sounded vulnerable, maybe even a little afraid. She couldn’t quite manage to look into his eyes. “If you want,” she repeated hoarsely.\u003c/p\u003e\n\u003cp\u003e“Yes, I want.”\u003c/p\u003e\n\u003cp\u003eJohn Paul took a step toward her but stopped when she put her hand up. “Not so fast, Renard.”\u003c/p\u003e\n\u003cp\u003e“What?” he warily asked.\u003c/p\u003e\n\u003cp\u003e“There are a couple of ground rules we need to go over first.”\u003c/p\u003e\n\u003cp\u003eShe wasn’t kidding. He would have laughed if she hadn’t looked so nervous. “Ground rules? Like no hitting below the belt? That kind of rule?” When she didn’t immediately answer, he asked, “Are we going to box, or are you going to let me—”\u003c/p\u003e\n\u003cp\u003e“I’m keeping my T-shirt on. Agreed?”\u003c/p\u003e\n\u003cp\u003e“Okay, if you want to, but if you change your mind and want to take it off, that’s fine too.”\u003c/p\u003e\n\u003cp\u003e“If I want to, I will, but I don’t want to, and I probably won’t. Agreed?”\u003c/p\u003e\n\u003cp\u003eAt this point he’d lost track of what she was negotiating. “Yeah, sure.”\u003c/p\u003e\n\u003cp\u003eHe took another step toward her. “I’m not finished.”\u003c/p\u003e\n\u003cp\u003eHe grinned. “I didn’t think so. Okay, what else?”\u003c/p\u003e\n\u003cp\u003e“You have to use protection. I can’t have children, but we haven’t had blood tests, and we . . .”\u003c/p\u003e\n\u003cp\u003e“I planned on using protection,” he said when she stammered to a halt.\u003c/p\u003e\n\u003cp\u003e“You planned?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” He pulled the condom out of his pocket and tossed it on the bed. “Anything else?”\u003c/p\u003e\n\u003cp\u003e“That was pretty presumptuous.”\u003c/p\u003e\n\u003cp\u003e“Avery, if I don’t touch you pretty soon, I’m gonna go nuts, so hurry up and finish the rules.”\u003c/p\u003e\n\u003cp\u003eHer heart was racing. “If you’re disappointed . . .”\u003c/p\u003e\n\u003cp\u003e“I won’t be.”\u003c/p\u003e\n\u003cp\u003e“But if you are, you keep it to yourself. Don’t complain to me.”\u003c/p\u003e\n\u003cp\u003e“Honey, are you always this uptight before sex?”\u003c/p\u003e\n\u003cp\u003e“Do you agree?”\u003c/p\u003e\n\u003cp\u003e“Okay. I won’t complain.”\u003c/p\u003e\n\u003cp\u003e“This isn’t funny, John Paul. I’m serious.”\u003c/p\u003e\n\u003cp\u003eHe’d waited for as long as he could. “Now it’s my turn,” he said as he grabbed a wad of her T-shirt and pulled her toward him. “You are underneath here somewhere, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe let go and put his arms around her waist. His hand slipped up under the fabric and splayed wide across her back. She didn’t try to wiggle away when his fingers touched her scars. He leaned down and kissed the side of her neck just below her ear. \u003c/p\u003e","sourceLink":"https://allnovel.net/killjoy-buchanan-renard-3/page-39.html","bookId":1833,"creation":"Oct 5, 2019 5:35:17 PM","modification":"Oct 5, 2019 5:35:17 PM"}
