{"id":94679,"no":9,"title":"Page 9","content":"\u003cp\u003ehey found the merchant vessel listing badly, a fair portion of her sails torn away by chain-shot, and her crewmen - those who were still aboard - lying dead, sprawled across the deck. Deudermont and his experienced crew knew that others had been aboard. A ship such as this would normally carry a crew of at least a dozen and only seven bodies had been found. The captain held out little hope that any of the missing were still alive. An abundance of sharks could be seen in the water around the wounded caravel, and probably more than a few had their bellies full of human flesh.\u003c/p\u003e\n\u003cp\u003e\"No more than a few hours,\" Robillard announced to the captain, catching up to Deudermont near to the damaged ship\u0027s tied-off wheel.\u003c/p\u003e\n\u003cp\u003eThe pirates had wounded her, stripped her of her crew and her valuables, then set her on a tight course, circling in the water. In the stiff wind that had been blowing all day, Deudermont had been forced to order Robillard to further damage the merchant vessel, letting loose a lightning bolt to destroy the rudder, before he could allow Sea Sprite to even catch hold of the caravel.\u003c/p\u003e\n\u003cp\u003e\"They would have taken a fair haul from her,\" Deudermont reasoned.\u003c/p\u003e\n\u003cp\u003eThe remaining stocks in the merchant vessel\u0027s hold indicated\u003c/p\u003e\n\u003cp\u003eThat the ship, bound from Memnon, had been carrying a large cargo of fabrics, though the cargo log said nothing about any exotic or exceptional pieces.\u003c/p\u003e\n\u003cp\u003e\"Minimal value goods,\" Robillard replied. \"They had to take a substantial amount simply to make the scuttling and murder worth their time. If they filled their hold, they\u0027re obviously running for land.\" He paused and wetted a finger, then held it up. \"And they\u0027ve a favorable breeze for such a journey.\"\u003c/p\u003e\n\u003cp\u003e\"No more favorable than our own,\" the captain said grimly. He called to one of his lieutenants, who was standing nearby ordering a last check for any survivors, to be followed by a hasty return to Sea Sprite.\u003c/p\u003e\n\u003cp\u003eThe hunt was on.\u003c/p\u003e\n\u003cp\u003eStanding not so far away from Captain Deudermont and Robillard, Wulfgar heard every word. He agreed with the assessment that the atrocity was barely hours old. With the strong wind, the fleet Sea Sprite, her holds empty, would quickly overtake the laden pirate, even if the pirate was making all speed for safe harbor.\u003c/p\u003e\n\u003cp\u003eThe barbarian closed his eyes and considered the forthcoming battle, his first action since Sea Sprite had put back out from Waterdeep. This would be a moment of truth for Wulfgar, a time when his determination and strength of will would have to take command from his faltering fortitude. He looked around at the murdered merchant sailors, men slaughtered by bloodthirsty pirates. Those killers deserved the harsh fate that would likely find them soon, deserved to be sent to a cold and lonely death in the dark waters, or to be captured and returned to Waterdeep, even to Luskan, for trial and execution.\u003c/p\u003e\n\u003cp\u003eWulfgar told himself that it was his duty to avenge these innocent sailors, that it was his responsibility to use his gods-given prowess as a warrior to help bring justice to a wild world, to help bring security to helpless and innocent people.\u003c/p\u003e\n\u003cp\u003eStanding there on the deck of the broken merchant caravel, Wulfgar tried to consciously appeal to every ennobling characteristic, to every ideal. Standing there in that place of murder, Wulfgar appealed to his instincts of duty and responsibility, to the altruism of his former friends - to Drizzt, who would not hesitate to throw himself in harm\u0027s way for the sake of another.\u003c/p\u003e\n\u003cp\u003eBut he kept seeing Delly and Colson, standing alone against the harshness of the world, broken in grief and poverty.\u003c/p\u003e\n\u003cp\u003eA prod in the side alerted the barbarian to the scene about him, to the fact that he and the lieutenant who had poked him were the only remaining crewmen on the wounded caravel. He followed the lieutenant to the boarding plank and noted that Robillard was watching his every step.\u003c/p\u003e\n\u003cp\u003eStepping back onto Sea Sprite, the barbarian took one last glance at the grisly scene on the merchant ship and burned the images of the dead sailors into his consciousness that he might recall it when the time came for action.\u003c/p\u003e\n\u003cp\u003eHe tried very hard to suppress the images of Delly and Colson as he did, tried to remind himself of who he was and of who he must be.\u003c/p\u003e\n\u003cp\u003eUsing common sense and a bit of Robillard\u0027s magic, Sea Sprite had the pirate in sight soon after the next dawn. It seemed a formidable craft, a large three-master with a prominent second deck and catapult. Even from a distance, Deudermont could see many crewmen scrambling about the pirate\u0027s deck, bows in hand.\u003c/p\u003e\n\u003cp\u003e\"Carling Badeen?\" Robillard asked Deudermont, moving beside him near the prow of the swift-sailing schooner.\u003c/p\u003e\n\u003cp\u003e\"It could be,\" the captain replied, turning to regard his thin friend.\u003c/p\u003e\n\u003cp\u003eSea Sprite had been chasing Carling Badeen, one of the more notorious pirates of the Sword Coast, off and on for years. It appeared they\u0027d finally caught up to the elusive cutthroat. By reputation, Badeen\u0027s ship was large but slow and formidably armored and armed, with a crack crew of archers and a pair of notorious wizards. The pirate Badeen himself was known to be one of the more bloodthirsty of the breed, and certainly the gruesome scene back at the merchant ship fit the pattern of Badeen\u0027s work.\u003c/p\u003e\n\u003cp\u003e\"If it is, then we must be at our very best, or risk losing many crewmen,\" Robillard remarked.\u003c/p\u003e\n\u003cp\u003eDeudermont, his eye back against his spyglass, did not disagree.\u003c/p\u003e\n\u003cp\u003e\"One error, like the many we have been making of late, could cost many of our crew their lives,\" the wizard pressed on.\u003c/p\u003e\n\u003cp\u003eDeudermont lowered the glass and regarded his cryptic friend, then followed Robillard\u0027s reasoning, and his sidelong glance, to Wulfgar, who stood at the starboard rail amidships.\u003c/p\u003e\n\u003cp\u003e\"He has been shown his errors,\" Deudermont reminded.\u003c/p\u003e\n\u003cp\u003e\"Errors that he logically understood he was making even as he was making them,\" Robillard countered. \"Our large friend is not controlled by reason when these affairs begin, but rather by emotion, by fear and by rage. You appeal to his rational mind when you explain the errors to him, and on that level, your words do get through. But once the battle is joined, that rational mind, that level of logical progression, is replaced by something more primal and apparently uncontrollable.\"\u003c/p\u003e\n\u003cp\u003eDeudermont listened carefully, if somewhat defensively. Still, despite his hopes to the opposite, he could not deny his wizard friend\u0027s reasoning. Neither could he ignore the implications for the rest of his crew should Wulfgar act irrationally, interrupting Robillard\u0027s progression of the battle. Badeen\u0027s ship, after all, carried two wizards and a healthy number of dangerous archers.\u003c/p\u003e\n\u003cp\u003e\"We will win this fight by sailing circles around the lumbering craft,\" Robillard went on. \"We will need to be quick and responsive, and strong on the turn.\"\u003c/p\u003e\n\u003cp\u003eDeudermont nodded, for indeed Sea Sprite had employed maneuverability as its main weapon against many larger ships, often putting a broadside along a pirate\u0027s stern for a devastating archer rake of the enemy decks. Robillard\u0027s words, then, seemed fairly obvious.\u003c/p\u003e\n\u003cp\u003e\"Strong on the turn,\" the wizard reiterated, and Deudermont caught on to what the wizard was really saying.\u003c/p\u003e\n\u003cp\u003e\"You wish me to assign Wulfgar to the rudder crew.\"\u003c/p\u003e\n\u003cp\u003e\"I wish you to do that which is best for the safety of every man aboard Sea Sprite\" Robillard answered. \"We know how to defeat a, ship such as this one, Captain. I only ask that you allow us to do so in our practiced manner, without adding a dangerous variable to the mix. I am not going to deny that our Wulfgar is a mighty warrior, but unlike his friends who once sailed with us, he is unpredictable.\"\u003c/p\u003e\n\u003cp\u003eRobillard made to continue, but Deudermont stopped him with an upraised hand and a slight nod, an admission of defeat in this debate. Wulfgar had indeed acted dangerously in previous encounters, and doing that now, against this formidable pirate, could bring disaster.\u003c/p\u003e\n\u003cp\u003eWas Deudermont willing to risk that for the sake of a friend\u0027s ego?\u003c/p\u003e\n\u003cp\u003eHe looked more closely at Wulfgar, the big man standing at the rail staring intently at their quarry, fists clenched, blue eyes blazing with inner fires.\u003c/p\u003e\n\u003cp\u003eWulfgar reluctantly climbed down into the hold - even more so when he realized he actually preferred to be down there. He had watched the captain\u0027s approach, coming to him from Robillard, but still Wulfgar had been surprised when Deudermont instructed him to go down into the aft hold where the battle rudder crew worked. Normally, Sea Sprite\u0027s rudder worked off the wheel above, but when battle was joined the navigator at the wheel simply relayed his commands to the crew below, who more forcefully and reliably turned the ship as instructed.\u003c/p\u003e\n\u003cp\u003eWulfgar had never worked the manual rudder before and hardly saw it as the optimal place to make use of his talents.\u003c/p\u003e\n\u003cp\u003e\"Sour face,\" said Grimsley, the rudder crew chief. \"Ye should be glad for bein\u0027 outta the way o\u0027 the wizards and bowmen.\"\u003c/p\u003e\n\u003cp\u003eWulfgar hardly responded, just walked over and took up the heavy steering pole.\u003c/p\u003e\n\u003cp\u003e\"He put ye down here for yer strength, I\u0027m guessin\u0027,\" Grimsley went on, and Wulfgar recognized that the grizzled old seaman was trying to spare his feelings.\u003c/p\u003e\n\u003cp\u003eThe barbarian knew better. If Deudermont truly wanted to utilize his great strength in steering the ship, he would have put Wulfgar on the main tack lines above. Once, aboard the old Sea Sprite many years before, Wulfgar had brilliantly and mightily turned the ship, bringing her prow right out of the water, executing a seemingly impossible maneuver to win the day.\u003c/p\u003e\n\u003cp\u003eBut now, it seemed, Deudermont would not even trust him at that task, would not allow him to even view the battle at all.\u003c/p\u003e\n\u003cp\u003eWulfgar didn\u0027t like it - not one bit - but this was Deudermont\u0027s ship, he reminded himself. It was not his place to question the captain, especially with a battle looming before them.\u003c/p\u003e\n\u003cp\u003eThe first shouts of alarm echoed down a few moments later. Wulfgar heard the concussion of a fireball exploding nearby.\u003c/p\u003e\n\u003cp\u003e\"Pull her left to mark three!\" Grimsley yelled.\u003c/p\u003e\n\u003cp\u003eWulfgar and the one other man on the long pole tugged hard, lining the pole\u0027s front tip with the third mark on the wall to the left of center.\u003c/p\u003e\n\u003cp\u003e\"Bring her back to left one!\" Grimsley screamed.\u003c/p\u003e\n\u003cp\u003eThe pair responded, and Sea Sprite cut back out of a steep turn.\u003c/p\u003e\n\u003cp\u003eWulfgar heard the continuing shouts above, the hum of bowstrings, the swish of the catapult, and the blasts of wizardry. The sounds cut to the core of the noble barbarian\u0027s warrior identity.\u003c/p\u003e\n\u003cp\u003eWarrior?\u003c/p\u003e\n\u003cp\u003eHow could Wulfgar rightly even call himself that when he could not be trusted to join in the battle, when he could not be allowed to perform the tasks he had trained for all his life? Who was he, then, he had to wonder, when companions - men of lesser fighting skill and strength than he - were doing battle right above him, while he acted the part of a mule and nothing more?\u003c/p\u003e\n\u003cp\u003eWith a growl, Wulfgar responded to the next command of, \"Two right!\" then yanked back fiercely as Grimsley, following the frantic shouts from above, called for a dramatic cut to the left, as steep as Sea Sprite could make it.\u003c/p\u003e\n\u003cp\u003eThe beams and rudder groaned in protest as Wulfgar forced the bar all the way to the left, and Sect Sprite leaned so violently that the man working the pole behind Wulfgar lost his balance.\u003c/p\u003e\n\u003cp\u003e\"Easy! Easy!\" Grimsley shouted at the mighty barbarian. \"Ye\u0027re not to pitch the crew off the deck, ye fool!\"\u003c/p\u003e\n\u003cp\u003eWulfgar eased up a bit and accepted the scolding as deserved. He was hardly listening to Grimsley anyway, other than the specific commands the old sea dog was shouting. His attention was more to the sound of the battle above, the shrieks and the cries, the continuing roar of wizardry and catapult.\u003c/p\u003e\n\u003cp\u003eOther men were up there in danger, in his place.\u003c/p\u003e\n\u003cp\u003e\"Bah, don\u0027t ye worry,\" Grimsley remarked, obviously noting the sour expression on Wulfgar\u0027s face, \"Deudermont and his boys\u0027ll win the day, don\u0027t ye doubt!\"\u003c/p\u003e\n\u003cp\u003eIndeed, Wulfgar didn\u0027t doubt that at all. Captain Deudermont and his crew had been successfully waging these battles since long before his arrival. But that wasn\u0027t what was tearing at Wulfgar\u0027s heart. He knew his place, and this wasn\u0027t it, but because of his own weakness of heart it was the only place Captain Deudermont could responsibly put him.\u003c/p\u003e\n\u003cp\u003eAbove him, the fireballs boomed and the lightning crackled, the bowstrings hummed and the catapults launched their fiery loads with a great swish of sound. The battle went on for nearly an hour, and when the call was relayed through Grimsley that the crew could reattach the rudder to the wheel, the man working beside Wulfgar eagerly rushed up to the deck to survey the victory, right behind Grimsley.\u003c/p\u003e\n\u003cp\u003eWulfgar stayed alone in the aft hold, sitting against the wall, too ashamed to show his face above, too fearful that someone had died in his stead.\u003c/p\u003e\n\u003cp\u003eHe heard someone on the ladder a short while later and was surprised to see Robillard coming down, his dark blue robes hiked up so that he could manage the steps.\u003c/p\u003e\n\u003cp\u003e\"Control is back with the wheel,\" the wizard said. \"Do you not think you might be useful helping to salvage what we might from the pirate ship?\"\u003c/p\u003e\n\u003cp\u003eWulfgar stared at him hard. Even sitting, the barbarian seemed to tower over the wizard. Wulfgar was thrice the man\u0027s weight, with arms thicker than Robillard\u0027s skinny legs. By all appearances, Wulfgar could snap the wizard into pieces with hardly an effort.\u003c/p\u003e\n\u003cp\u003eIf Robillard was the least bit intimidated by the barbarian, he never once showed it.\u003c/p\u003e\n\u003cp\u003e\"You did this to me,\" Wulfgar remarked.\u003c/p\u003e\n\u003cp\u003e\"Did what?\"\u003c/p\u003e\n\u003cp\u003e\"Your words put me here, not those of Captain Deudermont, Wulfgar clarified. \"You did this.\"\u003c/p\u003e\n\u003cp\u003e\"No, dear Wulfgar,\" Robillard said venomously. \"You did.\"\u003c/p\u003e\n\u003cp\u003eWulfgar lifted his chin, his stare defiant.\u003c/p\u003e\n\u003cp\u003e\"In the face of a potentially difficult battle, Captain Deudermont had no choice but to relegate you to this place,\" the wizard was happy to explain. \"Your own insolence and independence demanded nothing less of him. Do you think we would risk losing crewmen to satisfy your unbridled rage and high opinion of yourself?\"\u003c/p\u003e\n\u003cp\u003eWulfgar shifted forward and went up to his feet, into a crouch as if he meant to spring out and throttle the wizard.\u003c/p\u003e\n\u003cp\u003e\"For what else but such an opinion, unless it is sheer stupidity itself, could possibly have guided your actions in the last battles?\" Robillard went on, seeming hardly impressed or nervous. \"We are a team, well-disciplined and each with a role to play. When one does not play his prescribed part, then we are a weakened team, working in spite of each other instead of in unison. That we can not tolerate. Not from you, not from anyone. So spare me your insults, your accusations and your empty threats, or you may find yourself swimming.\"\u003c/p\u003e\n\u003cp\u003eWulfgar\u0027s eyes did widen a bit, betraying his intentionally stoic posture and stare.\u003c/p\u003e\n\u003cp\u003e\"And I assure you, we are a long way from land,\" Robillard finished, and he started up the ladder. He paused, though, and looked back to Wulfgar. \"If you did not enjoy this day\u0027s battle, then perhaps you would be wise to remain behind after our next docking in Waterdeep.\u003c/p\u003e\n\u003cp\u003e\"Yes, perhaps that would be the best course,\" Robillard went on after a pause, after assuming a pensive posture. \"Go back to the land, Wulfgar. You do not belong here.\"\u003c/p\u003e\n\u003cp\u003eThe wizard left, but Wulfgar did not start after him. Rather, the barbarian slumped back to the wall, sliding to a sitting position once again, thinking of who he once had been, of who he now was - an awful truth he did not wish to face.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t even begin to look ahead, to consider who he wished to become. \u003c/p\u003e","sourceLink":"https://allnovel.net/sea-of-swords-paths-of-darkness-4/page-9.html","bookId":2133,"creation":"Oct 5, 2019 6:10:25 PM","modification":"Oct 5, 2019 6:10:25 PM"}
