{"id":111042,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHer man. All hers.\u003c/p\u003e\n\u003cp\u003eShe came with a gasp, shuddering as his thrusts eased and he forced her to ride it out with exquisite slowness. Then she tumbled to her hands, unable to bear it any longer. “John, oh God, John.”\u003c/p\u003e\n\u003cp\u003eRip gripped her hips, thrusting long and hard. She could feel the tension in him, his fingers tight in the flesh of her bottom, as though he fought to hold on himself. And she didn’t want that. She wanted him there with her, losing himself in the moment. Proving to himself that he could. Reaching back Esme cupped his balls, hearing his soft exhale as he thrust just a little harder, a little deeper.\u003c/p\u003e\n\u003cp\u003eHer body clenched around his, a wet, silken fist, as he shuddered and rode over something hot and sensitive inside her. Esme quivered, her body tightening again as her clever fingers played over him.\u003c/p\u003e\n\u003cp\u003e“Jaysus, luv.” A gasp, torn from his lips. Her victory. Then he thrust harder, fingers digging in as she tightened further…\u003c/p\u003e\n\u003cp\u003eShe cried out again, resting her forehead against her forearm on the bed, feeling the shudder deep within as they both came. Panting, Rip collapsing over her… Somehow they disentangled and then she was in his arms as they tried to catch their breaths. Sweat slicked her skin, his seed wetting her thighs.\u003c/p\u003e\n\u003cp\u003e“Esme, you’re wondrous.” Rip kissed her shoulder, dragging her back into his arms. “So beautiful, so fuckin’ tight.” His stubble rasped her skin and she heard a soft laugh. As if he couldn’t quite believe what had happened.\u003c/p\u003e\n\u003cp\u003eRolling over, she rested her chin on his chest and smiled at him. A delicious shiver trailed down her spine as aftershock ran through her body. “You look eminently pleased with yourself.”\u003c/p\u003e\n\u003cp\u003eRip kissed her nose. “I am.” He laughed. “Startin’ to think I’d never ‘ave you.” His gaze sobered, voice going gruff. “Didn’t ‘urt you, did I? Can’t judge me strength anymore.”\u003c/p\u003e\n\u003cp\u003e“I believe I’m going to have fingerprint shaped bruises on my hips, but I survived.” She smiled and kissed him. “I am made of sterner stuff than you believe.”\u003c/p\u003e\n\u003cp\u003e“I know you are.” His fingertips trailed over her cheek. “Do you think we made a babe?” he whispered, voice rough with unsuppressed desire.\u003c/p\u003e\n\u003cp\u003e“Would you like that?” she asked, a little hint of hesitation filling her.\u003c/p\u003e\n\u003cp\u003eThey’d never spoken of it before but he had to know her feelings on the matter. She couldn’t look at a child without feeling a pang of sweet sorrow deep inside. And Rip… he knew her so well. Sometimes she didn’t have to even speak for him to know what she was thinking.\u003c/p\u003e\n\u003cp\u003eExcept when it came to her feelings for him, of course.\u003c/p\u003e\n\u003cp\u003eShe smiled and traced his mouth.\u003c/p\u003e\n\u003cp\u003e“Aye, I’d like it,” he replied gruffly. One hand stroked over her hip with a tenderness that almost brought tears to her eyes. Then his smile widened; that wicked smile that always made her breath catch. The one only she ever got to see. “I guess I’ll ‘ave to see to it that I get you with child.” He rolled over her, skating his fingertips down her sensitive stomach. “I’m fairly certain I’m up to the challenge.”\u003c/p\u003e\n\u003cp\u003eEsme slid her hands over his shoulders. “I won’t be a fallen woman, you know?”\u003c/p\u003e\n\u003cp\u003e“Aye, I know.” He nipped at her shoulder. “Tryin’ to ruin all o’ me surprises, woman?”\u003c/p\u003e\n\u003cp\u003e“Surprises?”\u003c/p\u003e\n\u003cp\u003eHe kissed her breasts, stubble rasping against her sensitive skin. “Under the bed, luv. I bought you another present to replace the one you lost. Figured this time I’d put it somewhere safer. Per’aps your finger, aye? This one?” Taking her left hand he drew it to his lips and sucked her ring finger into his mouth, watching her with those amused eyes.\u003c/p\u003e\n\u003cp\u003eEsme’s breath caught. “Are you asking me to marry you?”\u003c/p\u003e\n\u003cp\u003e“Aye.” His voice roughened in a growl. “I’m an old fashioned sort o’ man. Ain’t one of the Echelon with their consort contracts. I were born on the streets and ‘ere on the streets, when a lad fancies a girl ‘e asks ‘er to be ‘is alone.”\u003c/p\u003e\n\u003cp\u003eEsme glanced toward the side of the bed. Her curiosity was rampant to see the ring and he knew it. “All yours then?”\u003c/p\u003e\n\u003cp\u003e“Mine,” he agreed promptly. “If you’ll ‘ave me?”\u003c/p\u003e\n\u003cp\u003eShe answered him with a kiss. \u003c/p\u003e","sourceLink":"https://allnovel.net/tarnished-knight-london-steampunk-2/page-17.html","bookId":1584,"creation":"Oct 6, 2019 12:16:27 AM","modification":"Oct 6, 2019 12:16:27 AM"}
