{"id":111035,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe flush of heat along his cheekbones made her smile, despite her hurt. “I never suspected you’d be so prim.”\u003c/p\u003e\n\u003cp\u003eThose wicked green eyes met hers. “’Ow ‘bout you strip off and I’ll get dressed and we’ll see composed you are?”\u003c/p\u003e\n\u003cp\u003e“There’s enough soap in the bath to keep you decent.”\u003c/p\u003e\n\u003cp\u003eRip looked down, bubbles licking at his mid-riff. Still, he didn’t draw his hands away. “Still ain’t right.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t aware you’d read Lady Hammersley’s Rules of Etiquette.” Despite herself, she couldn’t help teasing him. “Besides, you’ve had your mouth on my throat, John. That’s rather more intimate than this, wouldn’t you agree?”\u003c/p\u003e\n\u003cp\u003eHe looked away. Not to be drawn by her teasing. A part of her deflated. “Why are you ‘ere?” he asked.\u003c/p\u003e\n\u003cp\u003eEsme paused by the stand that held the bath oils and soaps. Picking up a vial of rosewood oil, she sniffed it, then stoppered it again. Blade was always one for signs of decadence. The wash-chamber could have been found in one of the Echelon’s homes.\u003c/p\u003e\n\u003cp\u003e“I thought you might want to talk,” she said quietly. “You looked upset when you came in through the door.”\u003c/p\u003e\n\u003cp\u003eWater splashed as he reached for the faucet and turned it off. Esme watched him hungrily, smelling the next oil. Too lemony.\u003c/p\u003e\n\u003cp\u003e“Ain’t upset. Just… frustrated.” He leaned back in the tub, legs drawn up to fit his length. Bubbles clung to the thick dark hairs on his muscular thighs. “Were workin’ on this a few days. Didn’t tell Blade ‘til tonight.”\u003c/p\u003e\n\u003cp\u003e“You knew the Slashers were in the ‘Chapel?” She looked up from another vial sharply, surprised that Blade wasn’t angrier.\u003c/p\u003e\n\u003cp\u003e“Wanted to ‘andle it meself,” Rip repeated with a growl.\u003c/p\u003e\n\u003cp\u003e“Did Blade say anything?”\u003c/p\u003e\n\u003cp\u003e“Aye.” A gruff warning for her to drop the subject.\u003c/p\u003e\n\u003cp\u003eEsme idly sniffed another vial. Sandalwood. She’d always liked the smell. Grabbing a bar of soap and a wash cloth, she took the oil and crossed to the bath.\u003c/p\u003e\n\u003cp\u003eRip didn’t quite stiffen but she could sense the tension in his body. Another jolt to the heart. His disapproval of this was clear.\u003c/p\u003e\n\u003cp\u003e“Relax,” she murmured, feeling it sharply in her chest. Hurt brewed up, but she pushed it aside. Tonight wasn’t about her.\u003c/p\u003e\n\u003cp\u003eSitting on the lip of the bath, she dunked the washcloth into the water. Rip almost leapt out of the bath. “What are you doin’?”\u003c/p\u003e\n\u003cp\u003eEsme soaped up the cloth. “Washing your back,” she replied, wishing he didn’t sound as if she’d suggested he roll in a dead cat. “You can’t reach.”\u003c/p\u003e\n\u003cp\u003eSteeling herself, she put a hand to his shoulder and pushed him forward. Rip complied, wrapping his arms around his knees stiffly.\u003c/p\u003e\n\u003cp\u003eIf she’d thought his arm muscly, then she had never quite glimpsed his back. The bulk of his neck was as thick as one of his thighs. Esme rubbed the washcloth gently across his shoulder, leaving a trail of lather behind.\u003c/p\u003e\n\u003cp\u003e“Thought I could ‘andle it,” he said suddenly. “Just wanted… I dunno. To prove I were under control, that I could do this. Been so fuckin’ useless the last few months. I ‘ate it.”\u003c/p\u003e\n\u003cp\u003eTension curled through his body.\u003c/p\u003e\n\u003cp\u003eEsme slowly soaped Rip’s back, sliding the cloth up over his shoulder and down his chest. She had to rest her hand on his other shoulder to reach, her fingertips touching cool metal. The edges of his skin were ragged and puckered where the steel met it. Rip quivered as if his skin were highly sensitive there.\u003c/p\u003e\n\u003cp\u003e“Blade said you killed some of the Slashers,” she murmured, caressing the heavy slab of his pectorals.\u003c/p\u003e\n\u003cp\u003e“Not enough.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t be so hard on yourself. Every one of them that you kill means one less to harm the innocent.”\u003c/p\u003e\n\u003cp\u003e“Slasher gangs spring up like mushrooms,” he muttered. “Can’t get rid of ‘em. Always those ‘ard enough to see no other way to live. Coin’s a good lure.”\u003c/p\u003e\n\u003cp\u003e“You brought Meggie’s mother home,” she reminded him.\u003c/p\u003e\n\u003cp\u003eRip sighed. “It were Blade. I couldn’t go near ‘er. Not with all the blood.”\u003c/p\u003e\n\u003cp\u003e“Aye, well, Meggie thinks you’re a hero. You were the one who promised her you’d try and find her mother.”\u003c/p\u003e\n\u003cp\u003e“Ain’t no ‘ero.”\u003c/p\u003e\n\u003cp\u003e“You are to me,” she whispered. “You saved a frightened little girl and her mother.”\u003c/p\u003e\n\u003cp\u003eTheir eyes met and Rip said nothing. Still, she thought he looked pleased with her words. Or accepting, at least.\u003c/p\u003e\n\u003cp\u003eSlowly he relaxed back against the bath, tipping his head back against the lip. The muscles in his throat worked as he swallowed, his dark lashes fluttering closed against his cheeks.\u003c/p\u003e\n\u003cp\u003eEsme continued her slow, hypnotic movements, unable to take her eye from his face. Sinking the cloth below the water, she dragged it up, dripping water across his soapy chest. Rip shifted, his eyes fluttering open as she delved beneath the water again, but he soon settled once he realized the movement was innocuous.\u003c/p\u003e\n\u003cp\u003e“This is nice,” he admitted.\u003c/p\u003e\n\u003cp\u003e“I used to do this for Tom,” she mused. “Or sometimes I would climb in with him.”\u003c/p\u003e\n\u003cp\u003eStillness. “You miss your ‘usband.”\u003c/p\u003e\n\u003cp\u003e“Of course I do.” She clenched the cloth in her hands, wringing it out. “It was a long time ago though. Another world.” And she preferred the rough edges of the Warren, with its warmth and cheer compared to living with Tom and his mother, no matter how much she’d loved him. A guilty thought, but true.\u003c/p\u003e\n\u003cp\u003eRip seemed to think on that. “Surprised you never married again.” He looked up at her as she dropped the cloth on the stand and picked up the vial of sandalwood oil.\u003c/p\u003e\n\u003cp\u003e“Perhaps nobody has asked me,” she replied, with careful neutrality.\u003c/p\u003e\n\u003cp\u003e“That butcher on Abbott’s Lane took a liking to you.” His words seemed just as careful.\u003c/p\u003e\n\u003cp\u003e“Lots of men have ‘taken a liking’ to me in the last few years. And not one of them plucked up the courage to do anything more, with Blade’s sign of protection tattooed on my wrist.” She let the oil drip into her cupped palm and then set it aside, rubbing her hands together. “Lean forward.”\u003c/p\u003e\n\u003cp\u003eRip eyed her hands. “What are you doin’ now?”\u003c/p\u003e\n\u003cp\u003e“Have you ever seen me knead dough?” she asked as he sat up again. Sliding closer, she settled directly behind him.\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eEsme reached out and slid her hand over his shoulders and neck, the slick-shine of the oil gleaming on his skin. She was generous with it, rubbing her palms over his shoulders and down his chest, then dragging them back up his arm. Rip shifted, but the stiffness had leeched out of him again.\u003c/p\u003e\n\u003cp\u003eThe feel of his skin was like rough silk beneath her palms. His chest was hairless, his nipples tightening as she flickered her fingers over them. A tease that made his breath catch. Not quite immune to her then.\u003c/p\u003e\n\u003cp\u003eJust not interested.\u003c/p\u003e\n\u003cp\u003eShe buried the pain and concentrated on stroking the smooth muscles of his neck. To please him. And, if she were honest with herself, to please herself. She enjoyed touching him, however innocently. She’d like to touch him not so innocently too. To dip her hand beneath the water and wrap her strong fingers around his cock.\u003c/p\u003e\n\u003cp\u003eRip relaxed into her touch as Esme’s thumb slid over a hard knot above his shoulder blade. She dug her fingers in, earning a grunt, and gently worked it. Running her knuckles up his neck and down again.\u003c/p\u003e\n\u003cp\u003e“You’ve got strong hands,” he murmured. Another gentle groan as he leaned back against her. “God, that feels good.”\u003c/p\u003e\n\u003cp\u003e“Mmm.” Too good. Stolen moments. Stolen touches. Still, he seemed to enjoy having her hands on him almost as much as she did. Esme eased her pressure, rubbing her thumbs up under the indentation of his hairline.\u003c/p\u003e\n\u003cp\u003eRip groaned as her fingers dug into his scalp, feeling the soft prickle of his hair. His head fell back against her thigh, eyes closed in utter bliss as she kneaded with her fingers.\u003c/p\u003e\n\u003cp\u003eHe didn’t seem to realize that the oil was dissolving the bubbles on the top of the water. They vanished with alacrity until oil gleamed on the surface, hinting at what lurked beneath. Esme was no virgin. She looked and the sight thrilled her.\u003c/p\u003e\n\u003cp\u003eHe was not unaffected. Not at all.\u003c/p\u003e\n\u003cp\u003eLeaning down, Esme pressed her lips to his forehead, her fingers stilling and her heart thundering in her chest.\u003c/p\u003e\n\u003cp\u003eRip blinked sleepily. “Thank you,” he murmured. “You didn’t ‘ave to do that.”\u003c/p\u003e\n\u003cp\u003e“I like looking after you,” she replied, staring down into those beautiful eyes. So close. All she had to do was lean forward and press her lips to his…\u003c/p\u003e\n\u003cp\u003e“You do too much sometimes,” he muttered. “You ought to let us take care of you occasionally.”\u003c/p\u003e\n\u003cp\u003e“I’m the housekeeper,” she reminded him.\u003c/p\u003e\n\u003cp\u003e“This ain’t part of your job.”\u003c/p\u003e\n\u003cp\u003eEsme paused, idly circling his temples with her fingers. “Perhaps I like looking after you.”\u003c/p\u003e\n\u003cp\u003eHe looked up, green eyes serious. “You ought to marry again, Esme. You were made to ‘ave a husband. Some man to… to give you babies. Make you ‘appy.”\u003c/p\u003e\n\u003cp\u003eThe words took her by surprise. Hurt flared again and she sat up straight, thoughts of kissing him fleeing from her mind. How easily he spoke of her marrying someone else. As if the thought wouldn’t bother him at all. If he had mentioned another woman she’d have been sick with jealousy.\u003c/p\u003e\n\u003cp\u003eIt only served to prove precisely how he saw her. A friend. Not a lover. Not a… a potential wife. Or consort. No doubt the stirring of his body was simply a man’s reaction to having a woman touch him. Not because he desired her in particular.\u003c/p\u003e\n\u003cp\u003eColdness trailed over her skin. A dull, hollow feeling in the pit of her stomach. Reality was flooding over her. She had hoped that he might feel something more for her. But he didn’t. Friends. Always friends.\u003c/p\u003e\n\u003cp\u003e“You’re right,” she found herself murmuring. “I should marry again.”\u003c/p\u003e\n\u003cp\u003eInstead she’d waited for him. Lost the last few years hoping and waiting. Her time was running out. Rip was right. She did want children. Desperately. And now she was almost five-and-thirty and her years of child-bearing swiftly narrowing ahead of her.\u003c/p\u003e\n\u003cp\u003eBut the thought of taking another man to bed made her feel ill. Whenever she’d dreamed of babies, they’d had green eyes and black hair. His eyes.\u003c/p\u003e\n\u003cp\u003eEsme slowly stood, her shoulders sinking. The brutal realization that he didn’t want her – that he’d never want her - washed over her like ice water and she couldn’t help a shiver. “I’ll leave you to get dressed,” she murmured.\u003c/p\u003e\n\u003cp\u003eThen she turned and hurriedly left the room.\u003c/p\u003e\n\u003cp\u003eRip slipped outside, the cold air stinging his cheeks as he cupped his hands and lit a cheroot. If he cocked his head, he could hear the quiet murmur of Esme’s voice as she showed Meggie, Lark and Charlie how to string popped corn and holly berries on thread for the tree. Though her voice was soft enough to lull the children to sleep, it set him on edge tonight.\u003c/p\u003e\n\u003cp\u003eHe didn’t understand her. Barely able to speak to him all day, then coming in – whilst he was naked – and easing him with soft words and gentle hands. Touching him as if she cared, then blithely announcing that he was right – perhaps she should marry again.\u003c/p\u003e\n\u003cp\u003eHe couldn’t deal with this. The hunger itched under his skin, Esme confusing him. A man’d almost think her presence in the washroom a proposition.\u003c/p\u003e\n\u003cp\u003eDon’t be an idiot.\u003c/p\u003e\n\u003cp\u003eShe’d made it quite clear it wasn’t.\u003c/p\u003e\n\u003cp\u003eRip crushed the cheroot under his heel and tugged his coat tight, burying his hand in its warm folds as he leaned against the shadowed arch of the doorway. The cold was almost biting, but it helped to clear his head. Somehow he had to put this right. Make sure he understood what was going on in her mind. Blade had only muddied the waters, suggesting that perhaps there was more to it than Rip suspected. Making him hope there was more.\u003c/p\u003e\n\u003cp\u003eRip needed to talk to her, but with everyone underfoot, managing to get her alone was a lesson in frustration.\u003c/p\u003e\n\u003cp\u003eThe door to the kitchen opened, heat and laughter spilling out. Rip froze, sinking deeper into the shadows as the very object of his confusion stepped out into the yard, her boots crunching on the snow and her hands tucked up under her armpits. Her thick black hair was knotted at her nape, the dark wings of her brows drawn into an intense frown. Those translucent green eyes were distant however. Blind to the world around her.\u003c/p\u003e\n\u003cp\u003eWitchy eyes. The first time they’d met his she’d put a spell on him, like a punch to the chest.\u003c/p\u003e\n\u003cp\u003eNow was his chance. Rip rocked onto the balls of his feet then froze as another pair of boots crunched into the slush. Blade shut the kitchen door behind him, the rectangle of light Esme stood in vanishing. With his enhanced vision however, Rip could see them perfectly.\u003c/p\u003e\n\u003cp\u003eAnd hear them.\u003c/p\u003e\n\u003cp\u003eBlade had to know he was there. Rip barely dared breathe. \u003c/p\u003e","sourceLink":"https://allnovel.net/tarnished-knight-london-steampunk-2/page-9.html","bookId":1584,"creation":"Oct 6, 2019 12:16:27 AM","modification":"Oct 6, 2019 12:16:27 AM"}
