{"id":83936,"no":10,"title":"Page 10","content":"\u003cp\u003e“Well, young man,” my father exclaims. “I’m getting my sleigh all ready for the big night! I should be at your house tomorrow, on Christmas Eve, with lots of presents for you.”\u003c/p\u003e\n\u003cp\u003eFive-year-old Drew looks behind him—making sure the coast is clear. Then he speaks hesitantly into the phone. “Hey, Santa, can I ask you something?”\u003c/p\u003e\n\u003cp\u003e“You can ask me anything, Drew.”\u003c/p\u003e\n\u003cp\u003e“Would it be okay to add something to my list?”\u003c/p\u003e\n\u003cp\u003eI hear worry in the old man’s voice when he responds, “Add something? I’m not certain we could—”\u003c/p\u003e\n\u003cp\u003e“Or, I could trade. You can keep my other presents—I think I really only want one thing.”\u003c/p\u003e\n\u003cp\u003e“What do you want, Drew?”\u003c/p\u003e\n\u003cp\u003e“I want you to bring my daddy home for Christmas.”\u003c/p\u003e\n\u003cp\u003eThere’s silence on the other end of the phone.\u003c/p\u003e\n\u003cp\u003eMy younger self explains, “He had to go away for work, and Mom says she doesn’t think he’ll be home on Christmas Eve. And . . . she’s sad about it. We all are. It’s not as fun. I miss him.” He sighs. “So, if you can make sure he’s home tomorrow—you can keep the other stuff.”\u003c/p\u003e\n\u003cp\u003eI grin. Because I know what’s coming next.\u003c/p\u003e\n\u003cp\u003eWait for it.\u003c/p\u003e\n\u003cp\u003e“Well . . . maybe not all the other stuff,” he amends. “You could still drop off the Sega. But you can keep all Lexi’s gifts—she won’t mind.”\u003c/p\u003e\n\u003cp\u003eSanta’s voice turns rough with emotion and conviction as he promises, “Your daddy will be home for Christmas Eve, Drew. I promise.”\u003c/p\u003e\n\u003cp\u003eYoung Drew smiles with so much enthusiasm. Delight. Innocence.\u003c/p\u003e\n\u003cp\u003eIt makes me think of my son. The sound of his laughter. The warmth of his embrace. The way he bounces on the bed—even when Kate tells him not to—and he jumps into my arms, with total abandon. Complete faith and trust. Because he knows I’ll catch him. That I’d never let him fall.\u003c/p\u003e\n\u003cp\u003eThat I’d never let him down.\u003c/p\u003e\n\u003cp\u003e“Thanks, Santa,” my younger self whispers earnestly.\u003c/p\u003e\n\u003cp\u003eMackenzie looks up into my eyes. “Did Pop make it home in time?”\u003c/p\u003e\n\u003cp\u003eMy voice takes on a faraway tone, because I remember what happened the next day—and I remember exactly how it felt.\u003c/p\u003e\n\u003cp\u003e“We went to the Fishers’ for Christmas Eve dinner. We were all there—me, Matthew, Steven. At seven years old, your dad was already following your mom around, wanting to hang out with her. I kept watching the door. Waiting for my dad to walk through it. Hoping.”\u003c/p\u003e\n\u003cp\u003eA smile comes to my lips. “And then he did. Laughing and loud and bigger than life. I ran to him and—even before he hugged my mother—he scooped me up and spun me around. Carried me on his shoulder like Tiny fucking Tim. And it felt . . . magical. Like real Christmas magic. And I was so . . . proud of myself. Because I thought my wish brought him home.”\u003c/p\u003e\n\u003cp\u003eI blink, snapping out of my reverie. And I gaze down at Mackenzie. “Out of all the Christmases I enjoyed as a kid . . . that one . . . that one was the best.”\u003c/p\u003e\n\u003cp\u003e“But you forgot about it?”\u003c/p\u003e\n\u003cp\u003eThat’s how it happens, right? You grow up, and the wonder of the holidays fades. It becomes more of a burden—places to go, traffic, gifts that have to be found and bought. And you forget the little things, the simple moments that are supposed to make a regular day—more.\u003c/p\u003e\n\u003cp\u003e“Yeah. I guess I did.”\u003c/p\u003e\n\u003cp\u003eIt’s only when I glance up from Mackenzie’s face that I realize we’re not in that small apartment anymore. We’re back in my office. My head swims a little—like vertigo. I sit down on the suede couch until it passes. I glance at my watch, and it’s the same time as before Mackenzie walked through my door. Still two hours to go before my conference.\u003c/p\u003e\n\u003cp\u003e“Do you know why I showed you this particular memory tonight?” Mackenzie asks me.\u003c/p\u003e\n\u003cp\u003eI snort. “To demonstrate I’m obviously more like my father than I ever realized?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No. I showed you this because moments matter. You may not have remembered it, but it still played a part in who you grew up to be. And how you felt about Christmas, your dad, and in some ways, yourself. It’s the little things, all added together, that make us who we are. So now that you remember, what are you going to do, Uncle Drew?”\u003c/p\u003e\n\u003cp\u003eI rub the back of my neck. “I’ll . . . I’ll find a way to make it up to James after Christmas. Maybe take him to a basketball game for some quality time. Just the two of us.”\u003c/p\u003e\n\u003cp\u003eMackenzie sighs. And she seems disappointed. It’s similar to how Kate looks at me when she comes home from the salon and I’m not excited by the fact that she trimmed off a whole quarter of an inch.\u003c/p\u003e\n\u003cp\u003eLike . . . I’m missing something.\u003c/p\u003e\n\u003cp\u003e“Well,” she laments, “it’s time for me to go.”\u003c/p\u003e\n\u003cp\u003eEven though I’m still sure this is a dream—I’m not taking any chances. “Hold on, sweetheart. I can’t leave yet. Hang out here with me and I’ll get you home when I’m done.”\u003c/p\u003e\n\u003cp\u003eShe sits down on the couch. “Okay, Uncle Drew. Whatever you say.”\u003c/p\u003e\n\u003cp\u003eI head back around my desk, sit, and refocus all my attention on my presentation.\u003c/p\u003e\n\u003cp\u003echapter 4 \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-10.html","bookId":1809,"creation":"Oct 5, 2019 4:55:59 PM","modification":"Oct 5, 2019 4:55:59 PM"}
