{"id":83940,"no":15,"title":"Page 15","content":"\u003cp\u003eBecause standing before me, grinning evilly, is none other than Delores Warren, the ever-present pain in my ass.\u003c/p\u003e\n\u003cp\u003e“That’s me,” she proclaims. “The biggest, baddest Christmas spirit there ever was.”\u003c/p\u003e\n\u003cp\u003eI hold out my hand to shield my view. “Can you put the hood back up?”\u003c/p\u003e\n\u003cp\u003eShe glares. “Ha-ha, asswipe. I wouldn’t be making jokes if I were you, seeing as how you’ve screwed up. Again.”\u003c/p\u003e\n\u003cp\u003eI cross my arms. “I guess that means you’re taking me to the future. Show me my grave, and how no one gives a shit that I’m dead because of my selfish ways?”\u003c/p\u003e\n\u003cp\u003eShe scrunches her nose and shakes her head. “That’s Ebenezer’s gig—he’s always been an emo-bastard.” Delores fingers the pearl brooch at the neck of her robe as she asks, “Have you ever wondered how your life would’ve turned out if you and Kate had never met?”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003eI was never big on philosophy. Waste of time, as far as I’m concerned. Besides, Kate and I did meet, so the would’ve, could’ve, should’ve doesn’t apply.\u003c/p\u003e\n\u003cp\u003e“Well, I have,” she says. “I always suspected Katie would’ve been better off without you. So we’re not going to the future. I’m going to show you this night as it would be if Kate had never come to New York, and never fell victim to your man-whore charms.”\u003c/p\u003e\n\u003cp\u003eIs that something you want to see?\u003c/p\u003e\n\u003cp\u003eBecause I’m not interested. Because . . . if Delores is right, and Kate really is better off without me? That knowledge would break my fucking heart like nothing else ever could.\u003c/p\u003e\n\u003cp\u003eI shake my head. “No, thanks. I’ll sit this one out.”\u003c/p\u003e\n\u003cp\u003eHer green eyes gleam. Almost menacingly. “Lucky for me, you don’t have a choice in the matter.”\u003c/p\u003e\n\u003cp\u003eWith that, she spins toward me, the red cloak billowing around us. I feel her hand on my arm and the whole world shifts—falls—then comes to a jerking stop, like the end of a roller-coaster ride.\u003c/p\u003e\n\u003cp\u003eI look around. We’ve landed back in the outer hallway of my sister’s condo. The door is open and a version of me stands in the doorway, saying good-bye to his family inside. He seems a little more worn around the edges—but still one hell of a good-looking guy.\u003c/p\u003e\n\u003cp\u003e“So this me made it to Christmas Eve dinner?” I ask.\u003c/p\u003e\n\u003cp\u003e“Without a wife and kid taking up your time, you were able to get the conference with Hawaii done earlier.” Then Delores points at the other me. “Notice the crow’s-feet. Since he didn’t settle down with Kate, there’s a few more years of hard partying under his belt—and his eyes. But, sorry to say, no one’s kicking you out of her bed yet.”\u003c/p\u003e\n\u003cp\u003eI wave my hand, quieting her annoying commentary so I can hear the conversation going on at the door.\u003c/p\u003e\n\u003cp\u003e“You’re sure you don’t want to stay the night?” Alexandra asks. “You could wake up with us, open presents—nothing makes Christmas feel more like Christmas than kids getting up at the crack of dawn.”\u003c/p\u003e\n\u003cp\u003eKateless Drew hugs Mackenzie and Thomas, then kisses Alexandra on the cheek. “Sounds tempting, but I’m good.”\u003c/p\u003e\n\u003cp\u003eHis mother clicks her tongue disapprovingly. “I hate the idea of you being all alone.”\u003c/p\u003e\n\u003cp\u003eHe smirks. “Then you have nothing to worry about, Mom. I hardly ever spend the entire night alone.”\u003c/p\u003e\n\u003cp\u003eSteven chuckles and taps Drew’s fist.\u003c/p\u003e\n\u003cp\u003eHis mom rolls her eyes. “It’s Christmas Eve, don’t be vulgar.”\u003c/p\u003e\n\u003cp\u003eDrew shakes his father’s hand. “See you guys tomorrow.”\u003c/p\u003e\n\u003cp\u003eWith that, he leaves. But he doesn’t go home.\u003c/p\u003e\n\u003cp\u003eHe walks a few blocks until he comes to the most dependable pickup spot in any city. The place responsible for more sexual encounters than a highway rest stop bathroom.\u003c/p\u003e\n\u003cp\u003eA hotel bar.\u003c/p\u003e\n\u003cp\u003eWhile he stands at the entry, scanning for prospects, I do the same. It’s been awhile for me, but spotting the easy pickings is like riding a bike—a skill you never really forget.\u003c/p\u003e\n\u003cp\u003eOur eyes settle on a forty-something redhead in phenomenal shape, sitting alone at a corner table. Drew orders two drinks from the bartender—a Jack and Coke for himself, and whatever the lady is having.\u003c/p\u003e\n\u003cp\u003eThen he makes his move.\u003c/p\u003e\n\u003cp\u003e“Mind if I join you?” he asks her with a smile.\u003c/p\u003e\n\u003cp\u003eAfter her eyes shamelessly undress him, she nods. “Please.” He sets her drink in front of her and she thanks him.\u003c/p\u003e\n\u003cp\u003eHe assumes she’s at the hotel because she doesn’t actually live in New York. So he asks, “Are you visiting the city for business or pleasure?”\u003c/p\u003e\n\u003cp\u003eShe sips her drink and licks her lip provocatively. “Originally, business—I’m in real estate. But now it seems I’ll be multitasking.”\u003c/p\u003e\n\u003cp\u003eDrew winks. “I’m an excellent multitasker. I’m able to give my attention to many different areas at once. I’d love to demonstrate that talent for you sometime.”\u003c/p\u003e\n\u003cp\u003eRedhead smiles wider. Then she says, “Mistletoe.”\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003eShe points above them. “My hotel room has mistletoe printed on the sheets, in honor of the holiday season. How would you feel about kissing me under it?”\u003c/p\u003e\n\u003cp\u003eDrew chuckles. “I believe that’s a holiday tradition that should always be observed.” They finish their drinks, then stand. Ever the gentleman, Drew motions with his hand. “After you.”\u003c/p\u003e\n\u003cp\u003eAnd together they head upstairs. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-15.html","bookId":1809,"creation":"Oct 5, 2019 4:55:59 PM","modification":"Oct 5, 2019 4:55:59 PM"}
