{"id":83943,"no":18,"title":"Page 18","content":"\u003cp\u003eKate’s voice brings my eyes back to her. “I wanted to let you know that I just signed Saul Anderson. That’s right! Merry Christmas indeedy.”\u003c/p\u003e\n\u003cp\u003eChristopher responds, and a look of pure pride and joy washes over her face. “I’m thrilled to accept the vice president position. Yes. Absolutely—you can count on me, Chris. Okay, I will. Have a pleasant evening, as well.”\u003c/p\u003e\n\u003cp\u003eShe hangs up and more dancing commences. Her boobs bounce in time with her hips, and the only thing that would make this show better is popcorn.\u003c/p\u003e\n\u003cp\u003eWell . . . and if her clothes spontaneously fell off.\u003c/p\u003e\n\u003cp\u003eKate picks up the phone and tells her mother all about the big promotion. They only talk for a few minutes—Kate promises to come home soon to visit. Then she hangs up.\u003c/p\u003e\n\u003cp\u003eShe takes a bottle of champagne out of her minifridge and pours a single glass. Then she kicks off her shoes and walks to the window, gazing out over the lights of the city.\u003c/p\u003e\n\u003cp\u003eI stand up so my view is unobstructed.\u003c/p\u003e\n\u003cp\u003eAs Kate stands there, her joyous expression slowly falters. Turns . . . sad . . . awash with yearning. Lonely.\u003c/p\u003e\n\u003cp\u003eI think about all the different faces of Kate that I’ve seen. Passionate, hot and horny, sweet and tender, silly and smart-assy . . . nurturing, loving . . . motherly.\u003c/p\u003e\n\u003cp\u003eShe’s a perfect wife. And she’s the most amazing mother.\u003c/p\u003e\n\u003cp\u003eBut here, now, she didn’t get to be any of those things.\u003c/p\u003e\n\u003cp\u003eAnd that’s so fucking wrong.\u003c/p\u003e\n\u003cp\u003eKate glances at her glass of champagne and whispers, “Merry Christmas, Kate.” Then she takes a sip.\u003c/p\u003e\n\u003cp\u003e“Hey, Dee?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Remember when I said I was happy that Kate wasn’t involved with anyone?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’m not happy about it anymore.”\u003c/p\u003e\n\u003cp\u003eDelores walks to me and takes my arm. “Then it’s time to go.”\u003c/p\u003e\n\u003cp\u003eWe’re back in my office—my real office. The family portrait of me, Kate, and James sitting on my desk proves that this is my time, my reality—where Kate and I met, fell in love, spawned, and married.\u003c/p\u003e\n\u003cp\u003eAnd I sigh with blessed fucking relief.\u003c/p\u003e\n\u003cp\u003eI’m at my desk while Delores sits cross-legged in one of the chairs across from me.\u003c/p\u003e\n\u003cp\u003e“You were thinking about soul mates before. Remember? The truth is, soul mates are real: halves of the same coin. They can live without each other, go on to have successful, content existences. But they’ll never be as perfectly happy as they would’ve been, and could be, if they find their other half. That’s what you and Kate are like.”\u003c/p\u003e\n\u003cp\u003eI smile. “That sounds just about right to me.” I rub a hand down my face. “I want to go home, Dee. I want to hug my kid and kiss my wife and just . . . be with them. I want to look back and remember having this awesome night—with them.”\u003c/p\u003e\n\u003cp\u003eDelores grins and she almost looks proud of me. “First you have to wake up, Drew.”\u003c/p\u003e\n\u003cp\u003eAnd she snaps her fingers.\u003c/p\u003e\n\u003cp\u003echapter 6\u003c/p\u003e\n\u003cp\u003eI jolt violently awake at my desk, nailing my shin on the drawer in the process. “Goddamn it!”\u003c/p\u003e\n\u003cp\u003eI rub my leg and check the time. Seven thirty. Though it feels like a lot longer, only an hour and a half has passed since I arrived at the office.\u003c/p\u003e\n\u003cp\u003eI still have time.\u003c/p\u003e\n\u003cp\u003eI rattle off a quick email, canceling my conference with Media Solutions and attaching a PDF of my proposal. I tell them, in a professional sounding way, that they can take it or leave it, and if they leave it—it’s their loss.\u003c/p\u003e\n\u003cp\u003eThen I grab my stuff and sprint through the city.\u003c/p\u003e\n\u003cp\u003eI walk through my sister’s apartment door twenty minutes later, brushing snowflakes off my shoulders from the storm that just started. I head right for the family room—and see everyone there, just like I knew they would be.\u003c/p\u003e\n\u003cp\u003eA dark-haired little blur runs toward me. “Daddy!”\u003c/p\u003e\n\u003cp\u003eLaughing, I scoop him up and hug James until he squeaks. He leans back and gifts me with a faultless smile. “I knew you’d come.”\u003c/p\u003e\n\u003cp\u003eA lump clogs my throat.\u003c/p\u003e\n\u003cp\u003eI push past it to tell him, “And I’m so happy that you knew that. I love you, buddy. More than anything else in the whole world.”\u003c/p\u003e\n\u003cp\u003eHe giggles. “I know.”\u003c/p\u003e\n\u003cp\u003eI keep him in my arms as Alexandra comes to greet me. “It’s about time.”\u003c/p\u003e\n\u003cp\u003e“Sorry I’m late.” And I hug her just a little longer than usual. “I don’t think I’ve told you lately, but you’re the best sister ever, Lexi.”\u003c/p\u003e\n\u003cp\u003eShe ruffles my hair. “How sweet are you?”\u003c/p\u003e\n\u003cp\u003eFrom across the room, Mackenzie raises her shot glass of apple cider. “Glad you could make it, Uncle Drew.”\u003c/p\u003e\n\u003cp\u003e“Glad to be here, sweetheart! You and I need to talk—I owe you. I’ll explain later.”\u003c/p\u003e\n\u003cp\u003eMy sister insists, “No ponies, or farm animals of any kind!”\u003c/p\u003e\n\u003cp\u003eAnd the whole room laughs.\u003c/p\u003e\n\u003cp\u003eI pass Delores and shock the shit out of her by kissing her on the cheek. “Merry Christmas, Dee.”\u003c/p\u003e\n\u003cp\u003eShe looks at me like I’ve lost my mind. “Are you drunk?”\u003c/p\u003e\n\u003cp\u003eI chuckle. “Kind of feels like it.”\u003c/p\u003e\n\u003cp\u003eThen I spot Kate. And every fiber of my being hums with devotion and relief.\u003c/p\u003e\n\u003cp\u003eShe eyes me warily. Stiffly. Still annoyed.\u003c/p\u003e\n\u003cp\u003eI set James on his feet. “You want to kick Uncle Matthew’s and Uncle Steven’s asses in Ping-Pong?”\u003c/p\u003e\n\u003cp\u003e“Definitely!” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-18.html","bookId":1809,"creation":"Oct 5, 2019 4:55:59 PM","modification":"Oct 5, 2019 4:55:59 PM"}
