{"id":83948,"no":23,"title":"Page 23","content":"\u003cp\u003e“I’m yours, Drew,” she tells me in a low voice. “You can do anything . . . everything.”\u003c/p\u003e\n\u003cp\u003eDoes she even know what she’s offering? How badly I want to own her—fucking claim her—out here in the open? How desperately I want to hear her voice, soaked with pleasure, screaming my name until it echoes off the hills?\u003c/p\u003e\n\u003cp\u003eAnything?\u003c/p\u003e\n\u003cp\u003eOh the possibilities.\u003c/p\u003e\n\u003cp\u003eFeeling Kate’s eyes on mine—watching her watch me—I slide down till I’m face level with that sweet juncture between her thighs. A groan of gratification rumbles from my chest when my open mouth envelops her delectable *. I spear her slick folds with my tongue and revel in her taste—the feel of her against my tongue. Kate arches her back and swivels her hips, urging me on—seeking wet, firm friction. I love her roughly with my mouth, sucking, nipping, and laving—scratching the tender skin of her thighs with the stubble of my chin.\u003c/p\u003e\n\u003cp\u003eWhen her legs are trembling and her words become a jumbled chant of need, I rise, grasp her hips, and flip her over. She goes oh so willingly, bracing herself on hands and knees. Gripping her shoulder, I plunge inside, grunting and grinding, skimming my other hand down her back, over the swell of her ass, across her stomach, then back up again. My pelvis crashes against her ass, jerking her forward. Until she pushes back against me, welcoming every hard thrust.\u003c/p\u003e\n\u003cp\u003eIt’s unbridled fucking. Passion at its most raw.\u003c/p\u003e\n\u003cp\u003eI’m all senses, pure sensation—the wet, gripping muscles of her *, her smooth skin under my palm, her silky hair wrapped around my fingers, her keening whimpers, the scent of sweat and sex, the feel of her hand on my thigh, pushing for more. Faster. Deeper.\u003c/p\u003e\n\u003cp\u003eI pull her up harshly, her back against my chest, still fully buried inside. My teeth scrape her ear, her neck. Kate moans low and loud. My hand slides down between her legs, rubbing her clit until she quivers.\u003c/p\u003e\n\u003cp\u003eI’m possessed with the animalistic need to mark her. My lips latch on to the fragile skin where her shoulder and neck meet. I suck until she screams—on the razor-edge of pleasure and pain. Then I move my mouth upward and do it again. Leaving a trail of brands.\u003c/p\u003e\n\u003cp\u003eBecause she’s mine.\u003c/p\u003e\n\u003cp\u003eThe thought makes me harder and I surge forward again, needing to feel her come around me, all my focus centered on where I’m enveloped. But it’s the brush of Kate’s lips against my hand that pulls me back, that slows the shallow plunge of my cock. She kisses each fingertip tenderly, then begs, “I want to see you, Drew.”\u003c/p\u003e\n\u003cp\u003eI untangle my hand from her hair, and Kate turns on her knees, facing me. Without a word, I sit back on my ass and she straddles my waist, her small hands resting on my shoulders. She looks down, gyrates until we’re lined up, and I grind my jaw with pleasure as she slowly sinks down on my dick.\u003c/p\u003e\n\u003cp\u003eOur hard breaths mingle, face-to-face, and I’m caught in her eyes. Drowning in the depths of those dark pools—with no thought of looking anywhere else. My hands grasp her slender hips, helping her rise and fall. And it’s even more powerful, more fucking intense than our desperate vigorous movements just minutes before.\u003c/p\u003e\n\u003cp\u003eI gather Kate closer, her breasts brush my chest, her forehead rests against mine, and with a strangled cry she comes. The feel of her contracting, tight and hot, sends me straight over the edge with her. My hips surge upward one final time, and our bodies go stiff, racked with helpless, pulsating ecstasy.\u003c/p\u003e\n\u003cp\u003eBreathlessly, Kate rubs her nose against mine and I kiss her with languid ease. I lay back on the blanket and she squirms on top of me until her head rests comfortably on my chest, her legs surrounding mine. For a few minutes, neither of us speaks. We just enjoy the satiated looseness of our limbs and the slight breeze on our heated skin.\u003c/p\u003e\n\u003cp\u003eThen Kate lifts her head and rests her hand on my jaw. “Remember that night, when you asked me to move in with you? You made me dinner at your apartment and we danced?”\u003c/p\u003e\n\u003cp\u003eJesus, as if I could forget. The desperation, the resolve to convince Kate her heart was safe with me, the amazing sensation of holding her again after what felt like fucking forever, and the perfect elation when she agreed to give us a shot.\u003c/p\u003e\n\u003cp\u003e“I remember.”\u003c/p\u003e\n\u003cp\u003eKate squeezes my hand. “And you told me you wanted to make all my dreams come true?”\u003c/p\u003e\n\u003cp\u003eI run my finger across her cheek. “Yeah.”\u003c/p\u003e\n\u003cp\u003eShe stares at the glittering ring on her finger with a contented smile. “You just did.”\u003c/p\u003e\n\u003cp\u003eKeep reading for a sneak peek at Brent’s story in\u003c/p\u003e\n\u003cp\u003eAPPEALED\u003c/p\u003e\n\u003cp\u003eThe third book in New York Times bestselling author Emma Chase’s sexy Legal Briefs series\u003c/p\u003e\n\u003cp\u003eComing Fall 2015 from Gallery Books!\u003c/p\u003e\n\u003cp\u003eI look across the yard at the crowd of chattering, monochromatic people. All of them so eager to clone each other, to not be labeled as too flashy or ostentatious. It’s a sea of beige—tan slacks, taupe summer dresses, and one pair of light brown Ray-Ban sunglasses after another.\u003c/p\u003e\n\u003cp\u003eUntil a burst of red steps out from under the white party tent. \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-23.html","bookId":1809,"creation":"Oct 5, 2019 4:55:59 PM","modification":"Oct 5, 2019 4:55:59 PM"}
