{"id":83932,"no":6,"title":"Page 6","content":"\u003cp\u003eSmash.\u003c/p\u003e\n\u003cp\u003eAnother lamp bites the dust.\u003c/p\u003e\n\u003cp\u003e“You’re an asshole!”\u003c/p\u003e\n\u003cp\u003e“A fact you were well aware of before you married me.” I shrug. “No take-backs.”\u003c/p\u003e\n\u003cp\u003eKate growls.\u003c/p\u003e\n\u003cp\u003eSo hot.\u003c/p\u003e\n\u003cp\u003eThen she stomps down the hall into our bedroom and slams the door behind her, rattling the picture frames on the walls.\u003c/p\u003e\n\u003cp\u003eAnd they say men are the violent ones.\u003c/p\u003e\n\u003cp\u003eI sigh. I just don’t have time to deal with this right now. Don’t look at me like that—I’m not trying to be a prick. I love Kate; I hate that she’s mad. But give me a break—it’s one day. Why does she—why do women everywhere—have to make such a big fucking deal over one day?\u003c/p\u003e\n\u003cp\u003eI put my shoes on, then walk down the hall and brace my hands on the frame of the bedroom door. And talk through it.\u003c/p\u003e\n\u003cp\u003e“Okay . . . so, I’m gonna head out.”\u003c/p\u003e\n\u003cp\u003eI wait. I listen.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003e“So that’s how you’re gonna play this? Not speaking to me? Real nice, Kate—very mature.”\u003c/p\u003e\n\u003cp\u003eStill nothing.\u003c/p\u003e\n\u003cp\u003eI admit—her cold shoulder bothers me. Not enough to change my plans, but enough for me to try to talk her out of the silent sulk one last time.\u003c/p\u003e\n\u003cp\u003e“You’re not even gonna kiss me good-bye? What if I get pushed in front of a subway train by a deranged homeless person? It could happen. And if it does, you’re going to feel awful.”\u003c/p\u003e\n\u003cp\u003eThat does the trick. The bedroom door is yanked open.\u003c/p\u003e\n\u003cp\u003eKate stands there, with one hand on her hip and a sugary sweet smile on her face. “And we both know I’ll get over it.”\u003c/p\u003e\n\u003cp\u003eThen she slams the door in my face.\u003c/p\u003e\n\u003cp\u003echapter 2\u003c/p\u003e\n\u003cp\u003eAlthough I don’t believe I have any actual firsthand knowledge, it’s colder than a witch’s tit outside. Wind cuts through the city streets and the sky is a gloomy gray, hinting at a coming snowstorm.\u003c/p\u003e\n\u003cp\u003eOn the corner, a block from my building, a scraggily faced man in layered, shabby clothes shouts about the apocalypse—the end of days—and how we all need to turn our lives around before time runs out. It’s not an uncommon occurrence; guys like him litter the city. But today it seems weirdly . . . foreboding.\u003c/p\u003e\n\u003cp\u003eI open the door to the building and am greeted by Sam, a security guard in his early twenties who typically helms the night shift.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas, Mr. Evans.”\u003c/p\u003e\n\u003cp\u003e“Same to you, Sam.” He swipes my ID badge and I ask, “They put you on Christmas Eve?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “I volunteered. Hard to argue with time and a half. Plus it gives the fellas with families time to spend at home.”\u003c/p\u003e\n\u003cp\u003eGuilt pokes at me like the spring of worn-out couch. But I ignore it. “You don’t have any family?”\u003c/p\u003e\n\u003cp\u003e“Not yet. My girlfriend and I are going to my mother’s for dinner tomorrow. She’s out in Yonkers.”\u003c/p\u003e\n\u003cp\u003eI slide my badge into my pocket and pull a fifty out of it. “I’ll be here pretty late tonight. In case I don’t catch you on the way out, have a happy holiday.” We shake hands and I slip him the fifty. Because I subscribe to my father’s line of thought: an employee who feels appreciated—and well compensated—is a productive employee. And if I want anyone to be productive, it’s the guy responsible for keeping the building safe.\u003c/p\u003e\n\u003cp\u003eHe smiles gratefully. “Thanks a lot, Mr. Evans.”\u003c/p\u003e\n\u003cp\u003eI nod and head up the elevator to the fortieth floor.\u003c/p\u003e\n\u003cp\u003eThe offices are dark, the only light coming from the full-size Christmas tree in the corner and the illuminated electric menorah on the table beside it. The whole floor is quiet and still.\u003c/p\u003e\n\u003cp\u003eNot a creature is stirring, not even a mouse.\u003c/p\u003e\n\u003cp\u003eI flick the lights on in my office and sit down at my desk to get to work. While my laptop boots up, I look at the phone.\u003c/p\u003e\n\u003cp\u003eAnd consider calling Kate.\u003c/p\u003e\n\u003cp\u003eI don’t like it when she’s pissed at me. It feels . . . wrong. Off-kilter. And it’s distracting. Tonight I need to be focused—on top of my game.\u003c/p\u003e\n\u003cp\u003eI don’t pick up the phone.\u003c/p\u003e\n\u003cp\u003eBecause calling her to say I’m sorry, but I’m staying at the frigging office anyway, won’t go over well. Besides, she’s never been able to stay mad at me for long. By the time I get home, I bet she’ll be over it, just like I said.\u003c/p\u003e\n\u003cp\u003eAn hour later, I’m staring at my computer screen, reviewing the proposal I’m gonna pitch to Media Solutions. I yawn deeply and my vision blurs. The scorching rechristening of our living room and kitchen must’ve worn me out more than I thought. I stretch my arms and crack my neck, trying to wake myself up.\u003c/p\u003e\n\u003cp\u003eBut after five minutes, as I read paragraph seventeen, my eyelids become heavy. Until they droop and drag to a close.\u003c/p\u003e\n\u003cp\u003eI bolt awake at my desk—disoriented and slightly panicked. The way my grandfather used to snore away in his recliner, before jerking up and claiming he was just “resting my eyes.”\u003c/p\u003e\n\u003cp\u003eGlancing at my watch, I’m relieved to see it’s only been a few minutes since I dozed off. “Wake the fuck up, Evans. No time for a nap.” \u003c/p\u003e","sourceLink":"https://allnovel.net/it-s-a-wonderful-tangled-christmas-carol-tangled-4-5/page-6.html","bookId":1809,"creation":"Oct 5, 2019 4:55:59 PM","modification":"Oct 5, 2019 4:55:59 PM"}
