{"id":101911,"no":16,"title":"Page 16","content":"\u003cp\u003e\"What time do you think it is?\"\u003c/p\u003e\n\u003cp\u003eThe silence that met my question was almost as thick as the blackness wrapped around us in the minuscule basement storeroom.\u003c/p\u003e\n\u003cp\u003eA tiny little snuffling sound finally broke the silence.\u003c/p\u003e\n\u003cp\u003e\"Kristoff!\" I said loudly.\u003c/p\u003e\n\u003cp\u003eA muted snort answered, followed almost immediately by Kristoff saying, in a voice thick with sleep, \"What?\"\u003c/p\u003e\n\u003cp\u003eI stood in the middle of the room, or what I assumed was the middle, and put my hands on my hips. \"You were sleeping, weren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"No. Possibly.\" He cleared his throat. The chair creaked as if he had been leaning back and suddenly sat upright. \"What was the question?\"\u003c/p\u003e\n\u003cp\u003e\"How can you sleep at a time like this!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m male. I fall asleep after sex, and when I\u0027m trapped in a small room with my arms handcuffed behind me, and nothing else to do but think about how hungry I am.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I like that. Here I am talking to you about various escape plans, and you\u0027re using the fact that I can\u0027t see you to doze off! And you snore!\"\u003c/p\u003e\n\u003cp\u003e\"I do not snore. Dark Ones do not snore,\" he said sternly, and I imagined that he was, at that moment, frowning at me. I swam my way through the darkness toward him, my hand sweeping in front of me in case I was going in the wrong direction. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003eMy fingers struck his chin. I followed the line of his jaw up to his forehead. As I suspected, there was a wrinkle between his brows. \"Just seeing if you were frowning at me. I figured you were.\"\u003c/p\u003e\n\u003cp\u003eSilence filled the room for the count of seven. \"Do you care that I\u0027m frowning?\"\u003c/p\u003e\n\u003cp\u003e\"Oddly enough, I do,\" I said slowly, after some consideration. My fingers idly twined through his hair, playing with his curls until I realized what I was doing and stepped away a foot or so. \"I\u0027ve always maintained that a jolly vampire is better than a pissed-off one. When do you think they\u0027ll let us out? We\u0027ve been down here for hours and hours.\"\u003c/p\u003e\n\u003cp\u003e\"Are you so anxious to see me murdered?\" he countered.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be silly.\" I recommenced pacing the length of the room. I was getting good at estimating just where the walls were. \"I\u0027m not going to let them murder you.\"\u003c/p\u003e\n\u003cp\u003e\"And just how do you expect to stop them from trying?\"\u003c/p\u003e\n\u003cp\u003eI paced toward him, absently counting the steps. \"They can\u0027t do anything ritualistic without a real Zorya, can they? If you\u0027re my husband, then I\u0027m not real. At least, not by their standards. And if I am real, then all I have to do is refuse to participate in the cleansing ceremony.\"\u003c/p\u003e\n\u003cp\u003eHe gave a disbelieving grunt.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not like they can make me kill you,\" I pointed out.\u003c/p\u003e\n\u003cp\u003e\"On the contrary, assuming you were a Zorya, I can think of any number of ways they could force you to do just that, but if you wish to persist with the belief that ignorance will protect you, so be it. Now, what are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"It just occurred to me what you said.\" While he had been speaking, I felt my way along the wall over to him, kneeling beside him. \"You said you were hungry. When\u0027s the last time you ate?\"\u003c/p\u003e\n\u003cp\u003eHis voice had a slightly surly tinge to it. \"You should know; you were there.\"\u003c/p\u003e\n\u003cp\u003e\"Last night, you mean? No wonder you\u0027re hungry. Here, have an arm.\"\u003c/p\u003e\n\u003cp\u003eI thrust my arm roughly in the direction of his face.\u003c/p\u003e\n\u003cp\u003eHe head butted my offering. \"Whatever else you may think of me, I am not a cannibal.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be obstinate. You know full well I was intending for you to have a sip of Vino Pia, not eat my arm.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need your blood,\" he said in a voice that continued to bristle with surliness.\u003c/p\u003e\n\u003cp\u003eHunger hung in the air like a thick, red mist.\u003c/p\u003e\n\u003cp\u003e\"Yes, you do. Look at it this way - you\u0027ll be weaker if you don\u0027t, and frankly, I\u0027d rather have you brimming with health when we have to deal with Kristjana, especially if the ritual fizzles. That woman is just not right in the head.\"\u003c/p\u003e\n\u003cp\u003eHe grunted an assent.\u003c/p\u003e\n\u003cp\u003e\"So stop being stubborn, and eat. I had breakfast, you didn\u0027t. Eat.\" I shoved my wrist in the direction of his face.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like to drink from wrists,\" he muttered. \"It\u0027s so clich¨¦.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, for god\u0027s sake... fine.\" I hauled myself onto his lap and half turned to face him, letting him have the inside of my upper arm. \"Better?\"\u003c/p\u003e\n\u003cp\u003eHis breath was hot on my arm, sending little pinpricks of pleasure along my back and belly.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think that would be wise,\" he said, his voice sounding oddly choked.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help myself. I leaned into him, his curls brushing against my mouth. That faintly smoky scent that seemed to be uniquely his seeped into my pores, making my stomach tighten with anticipation. \"It\u0027s all right, Kristoff. I don\u0027t mind feeding you, I really don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You know what happened last time,\" he warned, his voice getting rougher and rougher. I heard him swallow. \"I told you before that to a Dark One, the act of feeding can be arousing.\"\u003c/p\u003e\n\u003cp\u003e\"You said there had to be a shared attraction.\" My heart was beating madly. I knew I should stop, knew I should back off to the farthest corner of the tiny cell and let him go hungry. I knew that what he was saying was absolutely true - not only was the proof growing beneath my right hip, but I was tingling just from the nearness of him. The scent and feel of him filled my mind, and more than anything, I wanted to taste him, wanted him to taste me.\u003c/p\u003e\n\u003cp\u003e\"Yes.\" His voice made me shiver.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" I repeated, too overwhelmed by emotions to listen to my common sense.\u003c/p\u003e\n\u003cp\u003e\"Alec - \" he said, choking to a stop.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think Alec and I are meant to be,\" I said, realizing with surprise that it was true. It was a dream, a pleasantly enticing dream, but a dream nonetheless.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re his Beloved, your blood will be poison to me,\" Kristoff murmured against my arm, his lips caressing the suddenly sensitive flesh.\u003c/p\u003e\n\u003cp\u003e\"We won\u0027t know until you try,\" I whispered into his hair, unable to keep from pressing little kisses along the top of his ear. I shifted on his lap so that I was straddling his legs, undoing the top couple of buttons on my blouse so it sagged open. \"If it is, we\u0027ll have the answer, and we\u0027ll stop. If I\u0027m Alec\u0027s Beloved... well, I\u0027ll deal with that.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll kill me for this,\" Kristoff said hoarsely as I arched my back. His head dipped down, kissing a hot line along the upper slopes of my chest. He stopped for a moment, his breath coming fast as I pulled off my shirt and reached behind to unhook my bra, his groan of pleasure echoing mine when his mouth descended again. \"To hell with it. You taste too good...\"\u003c/p\u003e\n\u003cp\u003e\"Too much talking, not enough biting,\" I said, moving restlessly against him. I wanted more, wanted him inside me, wanted him drinking from me, wanted that amazing sensation of sharing that we had the previous time he fed off me.\u003c/p\u003e\n\u003cp\u003eHe kissed a path over to my shoulder, moving a bit down my upper arm, his tongue painting a hot brand along my flesh.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure,\" he asked, his voice sounding as rough as his breathing in the confined space.\u003c/p\u003e\n\u003cp\u003eI thought of Alec, locked in an identical room just a few yards away, thought about what he meant to me, and what I apparently meant to him. I thought about how he made me feel wanted, cherished, even loved. Kristoff didn\u0027t want me, didn\u0027t want anything from me but satisfaction for the sexual itch that we seemed to share, and he certainly didn\u0027t need me. He was bound to his grief, and I suspected that I simply filled the role of physical relief, and yet, I felt closer to him than I did to the man with whom I might very likely spend the rest of my life as his Beloved.\u003c/p\u003e\n\u003cp\u003eI thought about all of that in the space between heartbeats, and wrapped my arms around his head. \"I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003eThe pain was fleeting, a momentary burning sensation that was quickly lost in sweeping pleasure. Kristoff moaned as he drank deeply, the sensation of that winding me up tighter than I had ever been. I moved against him, wanting his touch, mindless to everything but the sensations that were rippling through me like waves.\u003c/p\u003e\n\u003cp\u003e\"Pia...\" His tongue lathed a spot on my arm.\u003c/p\u003e\n\u003cp\u003eI felt the need in him, a need not just for my blood, but one that was instantly answered by my body. I was wound tighter than a clockwork, and felt like I might explode at any second.\u003c/p\u003e\n\u003cp\u003e\"Well ahead of you,\" I said, sliding back on his legs to find his buckle and zipper. He lifted his hips slightly as I made frantic little noises while struggling with the former. At last I got the zipper down, not at all surprised to find him hot and hard and clearly as aroused as I was. I held him in my hands, enjoying the unabashed groans of ecstasy my touch drew from him.\u003c/p\u003e\n\u003cp\u003eAnother need burned through me, one I couldn\u0027t help but give in to. He made a distressed noise as I rose off his lap, but that quickly changed to an unintelligible gurgle as I knelt and tentatively took him in my mouth, the sensation flooding my mind with rapturous images that drove out all other thoughts.\u003c/p\u003e\n\u003cp\u003eAll of them but one - I\u0027d used him for my own satisfaction the night before, selfishly used him even though I knew he was still mourning his lost love. I wouldn\u0027t do that again.\u003c/p\u003e\n\u003cp\u003e\"Pia, I don\u0027t think I\u0027m going to last if you keep doing that,\" he warned, the huskiness of his voice sliding along me like velvet on bare skin.\u003c/p\u003e\n\u003cp\u003e\"I want to give you pleasure, Kristoff,\" I murmured against the base of his penis, setting a rhythm that had his hips moving with quickening pace. \"To thank you for what you gave me the other night.\"\u003c/p\u003e\n\u003cp\u003eHe sucked in a huge amount of air as I let my tongue curl around the sensitive underside of his penis, the muscles of his thighs as hard as cement beneath my hands.\u003c/p\u003e\n\u003cp\u003e\"Stop,\" he cried, his legs tightening. \"Dammit, I wish my hands were free. You don\u0027t owe me any thanks. We gave each other pleasure, and we will do so again.\"\u003c/p\u003e\n\u003cp\u003eThere was a command in his voice, an order that had me smiling against the velvety tip of him. He understood what I was offering. \"I think it\u0027s my turn to ask you if you\u0027re sure,\" I asked, giving him a swipe of my tongue.\u003c/p\u003e\n\u003cp\u003eHis muscles trembled with strain. \"Quite sure.\"\u003c/p\u003e\n\u003cp\u003e\"Will you be grossed out if I kiss you?\" I asked as I rose, quickly removing my jeans and underwear before straddling his legs again. At least I wouldn\u0027t have to worry about him seeing all my pudgy parts.\u003c/p\u003e\n\u003cp\u003e\"Try me,\" he growled.\u003c/p\u003e\n\u003cp\u003eHis mouth was as hot on mine as it had been on my arm, his tongue the same bossy tongue that immediately charged into my mouth and set about pushing me over the edge of tolerance.\u003c/p\u003e\n\u003cp\u003eI positioned him and sank down slowly, the movement making us both moan.\u003c/p\u003e\n\u003cp\u003e\"Do you have any idea,\" I gasped as he slid in another inch, my body gripping him tightly as he invaded delicate, sensitive parts, \"any idea how good that feels?\"\u003c/p\u003e\n\u003cp\u003e\"Hrng,\" he answered, his head lolled back as I flexed my hips. I leaned forward and kissed his neck, smiling as I nibbled my way up to nip his earlobe. \"Christ, woman! Do that swivel again.\"\u003c/p\u003e\n\u003cp\u003eI swiveled. He made a noise from somewhere deep in his chest, a primitive sort of noise, a mating noise, one that seemed to thrum through me as I moved against him. That was all it took - that noise, and the feel of him so deep inside me, and the wave after wave of exhilaration that wound me even tighter until I teetered at the edge of a climax.\u003c/p\u003e\n\u003cp\u003eHis teeth pierced the skin behind my ear, the burn racing through my body, setting me alight and pushing me over the edge. I clutched at his shoulders, shaking with the strength of the climax even as he cried against my neck, his sensations pushing me beyond awareness into a new place, something made up of the two of us.\u003c/p\u003e\n\u003cp\u003eI collapsed against him, almost sobbing with the euphoria of the moment, confused about what I\u0027d just experienced. This was beyond normal sex, beyond even incredibly fabulous sex. What we\u0027d just done was earth-shattering, profoundly momentous in a way I couldn\u0027t begin to understand, but disturbed as I was, I knew one thing for certain - I would die before I let the Brotherhood people sacrifice the man in my arms.\u003c/p\u003e\n\u003cp\u003eI had to get him out, get Alec and him both out, and away from Kristjana. Frederic and Mattias might be reasoned with, but I knew with chilling conviction that Kristjana wouldn\u0027t be happy until both vampires were dead.\u003c/p\u003e\n\u003cp\u003eI just wouldn\u0027t let that happen.\u003c/p\u003e\n\u003cp\u003e\"Heea.\"\u003c/p\u003e\n\u003cp\u003eA voice, muffled and indistinct, reached my ears. I drifted on a cloud of post-orgasmic insensibility, finally realizing that the word spoken was my name.\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked, too boneless to move. I had collapsed onto Kristoff, and was draped across him now, his face smashed into my breasts, my knees still gripping his hips.\u003c/p\u003e\n\u003cp\u003e\"Mrrphm reef.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I asked, pulling back in order to hear him better.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t breathe,\" he said, a slight edge of amusement in his voice.\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027m sorry, I didn\u0027t think about you breathing.\" I scooted off him, groping around on the ground to find my clothing. \"That is, I didn\u0027t think about the fact that my boobs were smothering you. Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Full? Or do you need another go-round?\" I pulled on my clothing, my face flaming for no good reason. Yes, I\u0027d just had the best sex of my entire life, but it was with a man who saw me as nothing more than an annoyance who could occasionally scratch an itch - or fulfill a hunger. There was no cause for me to be blushing like a virgin.\u003c/p\u003e\n\u003cp\u003e\"That was quite sufficient, thank you,\" he said politely, but the humor was gone from his voice, replaced by a flinty note that made me, for some reason, want to throw something large at his head. Or cry. Possibly both.\u003c/p\u003e\n\u003cp\u003eSufficient, my shiny white ass! Once again I was left swearing that if that was the way he wanted to deal with the fact that we had quite possibly the best sex in the entire history of the world, then I would certainly not disillusion him.\u003c/p\u003e\n\u003cp\u003eSufficient. The bastard.\u003c/p\u003e\n\u003cp\u003eI was formulating an extremely cutting comeback when there was a noise at the door.\u003c/p\u003e\n\u003cp\u003e\"Zorya Pia? Are you there?\"\u003c/p\u003e\n\u003cp\u003eA crack of light appeared along the edges of the doorway.\u003c/p\u003e\n\u003cp\u003e\"Mattias?\" I asked, astonished.\u003c/p\u003e\n\u003cp\u003eThe door was pulled open a few inches. Mattias\u0027s eyeball was applied to the open space. \"Has the Dark One turned you?\"\u003c/p\u003e\n\u003cp\u003e\"Turned me? You mean made me a vampire?\" I rushed to the door, pausing when Kristoff hissed at me.\u003c/p\u003e\n\u003cp\u003e\"My trousers,\" he said softly.\u003c/p\u003e\n\u003cp\u003eA little shaft of light fell across the room, striking him on the leg, allowing me to see that he was still exposed to view.\u003c/p\u003e\n\u003cp\u003e\"Yes. Kristjana said that he would do so in order to keep you from becoming Zorya tonight.\" Mattias\u0027s eye examined me with calculation.\u003c/p\u003e\n\u003cp\u003eI moved to block his view of Kristoff, backing up until I reached him. \"Don\u0027t be silly. Kristoff wouldn\u0027t vamp me. Would you?\"\u003c/p\u003e\n\u003cp\u003e\"At this moment, I\u0027m considering the very attractive idea of throttling you,\" was the answer.\u003c/p\u003e\n\u003cp\u003e\"See?\" I told Mattias. \"He wants to strangle me, not make me a vampire. Are you going to let us out?\"\u003c/p\u003e\n\u003cp\u003e\"I should not,\" Mattias said, his eye considering me with unblinking interest. \"Kristjana said I was not to come down here. But you are the Zorya, and my wife.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, she\u0027s mine, but don\u0027t let that stop you from freeing us,\" Kristoff said.\u003c/p\u003e\n\u003cp\u003e\"Hush, you,\" I said, giving a little trill of horribly false-sounding laughter as I squatted awkwardly next to Kristoff, reaching behind me to tuck him away and do up his pants. \"He\u0027s such a joker. But you know, Mattias, I don\u0027t feel that we\u0027ve really had the time to get to know each other, and as I have a few hours free now, why don\u0027t we have a nice, long talk about things? Out of the basement.\"\u003c/p\u003e\n\u003cp\u003e\"Kristjana would not be happy,\" he pointed out.\u003c/p\u003e\n\u003cp\u003e\"Well,\" I finished fighting with Kristoff\u0027s zipper and moved toward the door, smiling my most winsome smile. \"She doesn\u0027t have to know, does she?\"\u003c/p\u003e\n\u003cp\u003eHe hesitated, clearly not sold on the idea of letting us out, but I was not going to let this chance slip by me.\u003c/p\u003e\n\u003cp\u003e\"Mattias,\" I said gently, batting my lashes ever so slightly at him. \"I\u0027m the Zorya. Anniki picked me to be her successor, and I\u0027m wholly committed to doing what\u0027s right. There are dozen ghosts upstairs right now just waiting for me to make good on my promise to take them to Ostri. I\u0027m not a bad person - you know that, don\u0027t you? Please let us out. I promise I\u0027ll be responsible for both Alec and Kristoff.\"\u003c/p\u003e\n\u003cp\u003e\"No, I could not let the Dark Ones out,\" Mattias said, shaking his head. \"That would be wrong. They are to be cleansed.\"\u003c/p\u003e\n\u003cp\u003e\"You are completely misjudging the situation - \" I started to say, but Mattias suddenly pushed the door open a little wider, enough for his entire face to glare in at me.\u003c/p\u003e\n\u003cp\u003eOr rather over my shoulder. Kristoff had come up behind me, as silent as a panther. I turned to see what it was that had Mattias so angry.\u003c/p\u003e\n\u003cp\u003eKristoff\u0027s shirt hung open, part of it poking out of his fly.\u003c/p\u003e\n\u003cp\u003e\"No wonder I had such a hard time with that zipper,\" I muttered, frowning at it.\u003c/p\u003e\n\u003cp\u003e\"What?\" Mattias asked suspiciously.\u003c/p\u003e\n\u003cp\u003eI turned to face him with a bright, innocent smile. \"Sorry?\"\u003c/p\u003e\n\u003cp\u003eHis face darkened. I looked down and saw to my horror that I had buttoned my blouse incorrectly - half the buttons were in the wrong buttonholes, while the other half weren\u0027t buttoned at all.\u003c/p\u003e\n\u003cp\u003e\"You have slept with the Dark One!\" Mattias accused, and I had to admit, the evidence of obviously hastily donned clothing was pretty damning. \"You had sex with the other one, and now this one, too? You have sex with everyone but me!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have sex with everyone!\" My fingers danced along the front of my blouse, fixing the button issue.\u003c/p\u003e\n\u003cp\u003eKristoff snorted.\u003c/p\u003e\n\u003cp\u003eI elbowed him in the gut.\u003c/p\u003e\n\u003cp\u003e\"Right here, in the very house I was in, practically in front of me!\" Mattias continued, his face turning red.\u003c/p\u003e\n\u003cp\u003e\"Would I do that?\" I asked, trying very hard to assemble my facial features into those depicting innocence, but I couldn\u0027t seem to remember what that looked like.\u003c/p\u003e\n\u003cp\u003eThe door slamming closed and the key scraping in the lock were the answer to that idiotic question.\u003c/p\u003e\n\u003cp\u003e\"Well, hell,\" I said, leaning my head against the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/zen-and-the-art-of-vampires-dark-ones-6/page-16.html","bookId":2207,"creation":"Oct 5, 2019 10:09:50 PM","modification":"Oct 5, 2019 10:09:50 PM"}
