{"id":86139,"no":12,"title":"Page 12","content":"\u003cp\u003eI didn’t want to argue with her, but she wasn’t staying in this apartment alone tonight. I noticed her easel in the corner of the room, so I walked over to it and stared at the canvas that sat upon it, trying to get up the nerve to say what I needed to say.\u003c/p\u003e\n\u003cp\u003e“I don’t think you should be alone tonight after the news you received, and my place has a guest room. I would feel better knowing you weren’t alone.”\u003c/p\u003e\n\u003cp\u003eHer attitude instantly changed, and she told me to wait while she packs a bag. Sitting on the easel was an unfinished painting of the bride and groom from Central Park. Even though it sat unfinished, the scene before me was breathtaking. I could look at the couple in the painting and see their happiness. The thing I’ve noticed about Ellery’s paintings is that she knows how to capture the present emotion of her subjects. I wondered what a portrait of me would look like if she painted one.\u003c/p\u003e\n\u003cp\u003eAs Ellery returned, I smiled at her, grabbed her bag, and we headed out the door.\u003c/p\u003e\n\u003cp\u003eShe sat in the limo next me and stared out the window. I made a phone call to Paul and rescheduled our meeting. She turned and looked at me.\u003c/p\u003e\n\u003cp\u003e“You shouldn’t have cancelled your meeting for me, Connor,” she softly spoke.\u003c/p\u003e\n\u003cp\u003eI put my arm around her, “My meeting can wait.” She laid her on my chest, and it felt good to have her there.\u003c/p\u003e\n\u003cp\u003eWe arrived at the penthouse, and I took her bag up to the guest room. When I came back downstairs, I noticed her staring at the black and white photographs that were hanging on the wall.\u003c/p\u003e\n\u003cp\u003eWhen I told her I took them, she seemed very surprised. She proceeded to ask me if I decorated the penthouse. I could tell the more we talked, the better she felt. I told her about my sister, Cassidy, and she was shocked again. I guess it’s because I’ve never talked about anything or anyone in my personal life. I headed over to the bar.\u003c/p\u003e\n\u003cp\u003e“Drink?” I asked her.\u003c/p\u003e\n\u003cp\u003e“Shot of Jack, please,” she said. My eyes widened as I looked at her.\u003c/p\u003e\n\u003cp\u003e“Are you sure?” I asked in disbelief.\u003c/p\u003e\n\u003cp\u003e“Does that surprise you?” she laughed.\u003c/p\u003e\n\u003cp\u003eI reached for a shot glass as she made herself comfortable on the bar stool. “It doesn’t, well, maybe it does; I just don’t know any women who do shots of Jack Daniels straight.”\u003c/p\u003e\n\u003cp\u003e“You do now,” she said as she threw back the shot. I was in awe of this girl, this woman that was sitting across from me. She put the shot glass down on the bar and cocked her head.\u003c/p\u003e\n\u003cp\u003e“I thought you didn’t do sleepovers, Mr. Black?”\u003c/p\u003e\n\u003cp\u003eI looked at her and grinned, “I don’t, Miss Lane. I never have, but tonight I made an exception for a friend because I felt she shouldn’t be alone.”\u003c/p\u003e\n\u003cp\u003eI poured another shot of whiskey and held up the glass. “Another shot?” I asked.\u003c/p\u003e\n\u003cp\u003e“Are you trying to get me drunk?” she smiled seductively.\u003c/p\u003e\n\u003cp\u003eDamn that smile. I put my hand in my pocket and cocked my head to the side. “Should I be?” I grinned. She threw back the second shot and sat down on the couch. She looked worried. I sat down next to her with my glass of scotch and asked her if she was ok. She looked up at me with her angelic blue eyes and smiled.\u003c/p\u003e\n\u003cp\u003e“I was just thinking about how I can visit my mom and dad’s grave when I’m back in Michigan.”\u003c/p\u003e\n\u003cp\u003e“When was the last time you visited them?” I asked.\u003c/p\u003e\n\u003cp\u003e“Just a little over a year ago. I stopped by for a visit the day before Kyle and I moved to New York.”\u003c/p\u003e\n\u003cp\u003eJust hearing his name made me angry. I’m not sure why. I should be thanking the bastard, because if he wouldn’t have left, then I never would have met Ellery. I looked at her as she stared straight into my eyes and spoke about how she wants to be cremated when she dies. I narrowed my eyes at her and told her to stop talking like that. It was something I didn’t ever want to think about. She continued to go on about how she doesn’t want people to mourn over her, and she wants them to remember the good times they shared. She was really beginning to irritate me with all this talk about death. I told her to stop because she was talking as if she was going to die tomorrow. Then she said something that frightened me.\u003c/p\u003e\n\u003cp\u003e“You never know what each day will bring, and that’s why I believe that nothing lasts forever.”\u003c/p\u003e\n\u003cp\u003eI got up from the couch and took her hand, helping her up.\u003c/p\u003e\n\u003cp\u003e“Ok, I think Mr. Daniel’s has gotten to you. Let’s get some sleep; I have to work in the morning.”\u003c/p\u003e\n\u003cp\u003eI led her upstairs and showed her to the guest room. I turned around and grabbed the door knob, “Good night, Elle, sleep well,” I spoke as I walked out of the room and down the hall to my bedroom.\u003c/p\u003e\n\u003cp\u003eI took off my clothes and climbed into bed. I laid there, thinking about Ellery and how serious she was about her own death. How could she think of such things? The more I thought about it, the more it made sense; death has always been a part of her life. I tossed and turned. I tried to get comfortable, but I couldn’t. I got out of bed and slowly walked down the hall toward her room. I stood outside the door and listened; there was silence. I’m sure the shots of Jack helped her sleep. I made the decision that I was taking her to Michigan as I didn’t want her going alone.\u003c/p\u003e\n\u003cp\u003eThe next morning, I showered and headed to the kitchen to make a pot of coffee. I called the bakery down the street and had a dozen bagels delivered. I wanted to make sure Ellery had something to eat when she woke up. I sat down at the table and opened my laptop. I had some emails to go over and meetings to reschedule for when I came back. Not too long after I sat down, Ellery came walking into the kitchen. I looked at her, and my heart started to beat rapidly. She was wearing black yoga pants that hugged her h*ps and ass perfectly and a pink tank top that was way too sexy on her. She had her hair up in a high ponytail. Damn, I was getting aroused again just looking at her. I needed to get my mind off her body and tell her I’m taking her to Michigan.\u003c/p\u003e\n\u003cp\u003e“Good morning, Ellery, I hope you slept well,” I smiled.\u003c/p\u003e\n\u003cp\u003eShe walked over and poured herself a cup of coffee and sat down across from me.\u003c/p\u003e\n\u003cp\u003e“There are bagels over there; please have one.”\u003c/p\u003e\n\u003cp\u003eShe politely declined. I sighed and told her she had to eat.\u003c/p\u003e\n\u003cp\u003e“I never eat when I first get up, but don’t worry, dad, I’ll have one in a little bit,” she said in a cocky way.\u003c/p\u003e\n\u003cp\u003eI tried not to smile, but it was inevitable, because even first thing in the morning, she was a smart ass. She stared at me as I was typing. I looked up and over my laptop at her.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” she asked.\u003c/p\u003e\n\u003cp\u003eThis was my opportunity to tell her about our road trip to Michigan. I was a little nervous about how she was going to react.\u003c/p\u003e\n\u003cp\u003e“Just sending some emails and rearranging some meetings.”\u003c/p\u003e\n\u003cp\u003e“Did you over-schedule or something?” she asked in cute way.\u003c/p\u003e\n\u003cp\u003eI looked up at her as she took a sip of her coffee. “You question everything, don’t you?” I asked.\u003c/p\u003e\n\u003cp\u003eShe looked up at the ceiling and smiled, “I guess I do.”\u003c/p\u003e\n\u003cp\u003eI asked her what her plans were for the day, and she told me that she was going to volunteer at the soup kitchen. She said that no matter what their problems were, they were homeless and needed help.\u003c/p\u003e\n\u003cp\u003eHer kindness and charitable nature really had an effect on me. I’ve never met anyone like her. I finished up what I was doing and closed my laptop.\u003c/p\u003e\n\u003cp\u003e“I rearranged my meetings because I’m taking you to Michigan,” I said as I sat and waited for her reaction.\u003c/p\u003e\n\u003cp\u003e“What?” she asked.\u003c/p\u003e\n\u003cp\u003eI know she likes to argue, but she wasn’t winning this one. I got up from the table and set my cup on the counter. “It’s not up for discussion, Elle; we’re leaving tomorrow morning, and we’re driving.”\u003c/p\u003e\n\u003cp\u003e“Driving? That’s a 10 hour drive, Connor!” she exclaimed.\u003c/p\u003e\n\u003cp\u003eI looked at her from across the kitchen as she stared at me with a shocked expression on her face.\u003c/p\u003e\n\u003cp\u003e“Do you have a problem being in a car with me for 10 hours?” I casually asked her and was afraid that she was going to yes.\u003c/p\u003e\n\u003cp\u003e“No, but…”\u003c/p\u003e\n\u003cp\u003eI walked over to the table and stood over her. She looked so beautiful, sitting there drinking coffee and giving me an attitude about driving. It took everything I had not to reach out and run my finger along her jaw line or kiss her as she lifted her head and looked at me. It was getting harder to resist her. I didn’t even know if she wanted me. I need to call Dr. Peters and see him before we leave tomorrow.\u003c/p\u003e\n\u003cp\u003e“No buts; we’re going by car, and I’m driving,” I said as I smiled at her and left for the office.\u003c/p\u003e\n\u003cp\u003eAs I stepped off the elevator and into the parking garage, Denny was walking towards me. “Denny, I’m glad you’re here early. I wanted to tell you that I’m giving you the next few days off.”\u003c/p\u003e\n\u003cp\u003e“Ok, Connor, but may I ask why?”\u003c/p\u003e\n\u003cp\u003e“I’m driving Miss Lane to Michigan for her aunt and uncle’s funeral, and we’re leaving tomorrow morning.”\u003c/p\u003e\n\u003cp\u003eDenny looked at me and smiled. “Was it her idea that you take her?”\u003c/p\u003e\n\u003cp\u003e“No, and I didn’t give her any other choice. I told her I was taking her and that it wasn’t up for discussion.”\u003c/p\u003e\n\u003cp\u003eDenny continued looking at me. “She was ok with that?”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes as I walked to the Range Rover. “She didn’t really argue too much. I’m driving myself to the office today. Take Miss Lane home or wherever she wants to go, but I do have a meeting at 1:00 pm across town, so I’ll need you to pick me up.”\u003c/p\u003e\n\u003cp\u003eInstead of heading straight to the office, I called Dr. Peters and asked him if he was available to see me. I needed to talk to him about this upcoming road trip. He told me to come right in since his first appointment wasn’t scheduled for another hour. I walked into his office and sat down in my usual chair.\u003c/p\u003e\n\u003cp\u003e“Good morning, Connor. Is everything alright? You said it was urgent.”\u003c/p\u003e\n\u003cp\u003eI took in a deep breath as I ran my hand through my hair. “Remember that girl I told you about at our last session?”\u003c/p\u003e\n\u003cp\u003e“Yes, I believe her name is Ellery; correct?” he asked as he looked at me intently.\u003c/p\u003e\n\u003cp\u003e“Yes, that’s her. Well, her aunt and uncle were recently killed in a car accident, and I’m taking her to Michigan for the funeral.”\u003c/p\u003e\n\u003cp\u003e“That’s good, Connor. So, why don’t you explain to me where your relationship with Ellery stands?”\u003c/p\u003e\n\u003cp\u003eI shifted in my chair. “Ellery and I are friends and nothing more. I’m doing this for her because I don’t want her going alone, and she should have someone there for her.”\u003c/p\u003e\n\u003cp\u003eDr. Peters got up from his chair and walked over to the coffee pot. “Would you care for some coffee, Connor?” he asked.\u003c/p\u003e\n\u003cp\u003e“No, I’m good.”\u003c/p\u003e\n\u003cp\u003e“It sounds to me like you’re beginning to have more feelings that extend beyond friendship for her.\u003c/p\u003e\n\u003cp\u003eSo, your flight leaves tomorrow?”\u003c/p\u003e\n\u003cp\u003e“We aren’t flying; I’m driving her there. I told her it was a road trip.”\u003c/p\u003e\n\u003cp\u003eHe looked at me and sat down while he sipped his coffee. “That’s a 10 hour drive. You and Ellery will be alone in a car for a substantial amount of time. Are you ready for what might happen along the way?”\u003c/p\u003e\n\u003cp\u003eI brought my foot to my opposite knee and leaned on the arm of the chair. “Why are you making a big deal out of this, Doc? It’s a simple road trip with a friend who just lost her aunt and uncle. That’s it, nothing more.” \u003c/p\u003e","sourceLink":"https://allnovel.net/forever-you-forever-2/page-12.html","bookId":1820,"creation":"Oct 5, 2019 5:12:14 PM","modification":"Oct 5, 2019 5:12:14 PM"}
