{"id":52120,"no":24,"title":"Chapter 23 - Mysterious Old Man","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003e\u003cstrong\u003eChapter 23 - Mysterious Old Man\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThere was a small room behind the bedroom. The sound of water could be heard coming from it.\u003c/p\u003e\n\u003cp\u003eHe couldn’t help but walk over. The door was open. He took only one look, before feeling all the warm blood in his body rush to his head.\u003c/p\u003e\n\u003cp\u003eThe small room was actually a beautifully decorated and furnished bathing room. Steam rose from the hot water, and there were carved jade banisters in all directions. There was a large white robe on top of the banister.\u003c/p\u003e\n\u003cp\u003eA person stood in the middle of the water, back to him, snow-white skin as sleek and glossy as silk. Sleek waist and limbs, plentiful and round buttocks, tall and slender legs. She looked as though she had been carved from white jade.\u003c/p\u003e\n\u003cp\u003eFu Hongxue couldn’t see her face. All he could see was that all of the hair on her head had been shaved off cleanly, leaving behind only the incense scars on her head.\u003c/p\u003e\n\u003cp\u003eThis beautiful, bathing woman was actually a nun.\u003c/p\u003e\n\u003cp\u003eIt wasn’t as though Fu Hongxue hadn’t seen a woman before. He had also seen naked women before. But a naked nun was something way different.\u003c/p\u003e\n\u003cp\u003eAlthough the beauty of this nun’s backside made his eyes dizzy and his heart tremble, he definitely did not dare to take another look.\u003c/p\u003e\n\u003cp\u003eHe immediately rushed out. After a long time, his heartrate finally returned to normal.\u003c/p\u003e\n\u003cp\u003eHe suddenly had a strange thought. “Can this nun be Mingyue Xin?”\u003c/p\u003e\n\u003cp\u003eThis wasn’t impossible. After experiencing such traumatic events, Mingyue Xin very well could have left the secular world and become a nun. But he no longer had the courage to go back in and verify it.\u003c/p\u003e\n\u003cp\u003eJust at this moment, he noticed another door. It had the same carvings, and it also seemed unlocked. He was no longer able to verify whatsoever whether or not this room was the same room he had originally stayed in.\u003c/p\u003e\n\u003cp\u003ePerhaps Mingyue Xin was inside this room. Or perhaps madame Zhuo was inside the room, her heart as venomous as a pit of vipers.\u003c/p\u003e\n\u003cp\u003eSince he had already come here, he was definitely going to take a look. He first knocked on the door. No response. He lightly pushed the door open. There really was a table full of dishes inside. This was the time to eat dinner, after all. Any type of person would be eating.\u003c/p\u003e\n\u003cp\u003eA crisp, sweet taste wafted out from the door. Of the six dishes on the table, there really was one dish with squirrel and yellow croaker, and one dish with sweet and sour spareribs.\u003c/p\u003e\n\u003cp\u003eAfter spinning around in innumerable circles, he had once more arrived in his own room. Unexpectedly, he actually felt relieved. Just as he was about to push the door open and go in, he suddenly heard a thudding sound as the door closed inwards.\u003c/p\u003e\n\u003cp\u003eA cold female voice said from within, “Who is sneaking around outside? Leave now!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s heart leapt.\u003c/p\u003e\n\u003cp\u003eHe could tell whose voice this was. It was Mingyue Xin’s voice. He couldn’t resist saying, “Mingyue Xin, is that you?”\u003c/p\u003e\n\u003cp\u003eAfter a long time, he once more reported his own name. He thought that Mingyue Xin would definitely open the door.\u003c/p\u003e\n\u003cp\u003eWho would have known that the female voice would coldly say, “I don’t know you. Leave now.”\u003c/p\u003e\n\u003cp\u003eWas she forced to act this way, due to a perilous condition? Was someone guarding her, causing her to not dare to meet with him?\u003c/p\u003e\n\u003cp\u003eFu Hongxue suddenly rammed the door hard. A carved wooden door is always weaker than a plain one. As soon as he collided with it, it opened.\u003c/p\u003e\n\u003cp\u003eHe walked in. A person was standing in front of the bed, staring at him coldly. But it wasn’t Mingyue Xin. It was madame Zhuo.\u003c/p\u003e\n\u003cp\u003eIt seemed as though she too had just come from the bathing chamber. Her naked body had already been covered with a soft silk robe, but it made her body seem all the more alluring. Fu Hongxue was stunned.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo said icily, “You shouldn’t have barged in like this. You should know that right now, I am someone else’s wife.”\u003c/p\u003e\n\u003cp\u003eHer voice really did have some vague similarities with that of Mingyue Xin’s. Fu Hongxue only stared at her, as though he were trying to discern some secret from her face.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo said, “I’ve already sent Zhuo Yuzhen to you. Why did you come here to find me?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Because you are the person I am looking for. You are Mingyue Xin.”\u003c/p\u003e\n\u003cp\u003eThere was no sound in the room, nor was there any expression on madame Zhuo’s face. It was as though she was wearing a mask.\u003c/p\u003e\n\u003cp\u003ePerhaps this was her true face. Or perhaps this, too, was not. But this was already unimportant, because Fu Hongxue now already understood that how she looked was unimportant. So long as he knew that she was Mingyue Xin, the important point had been grasped.\u003c/p\u003e\n\u003cp\u003eShe stood there without moving for an unknown period of time. She finally let out a long sigh. “You are wrong.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Oh?”\u003c/p\u003e\n\u003cp\u003eMadame Zhuo dully said, “There’s no such person as Mingyue Xin in the world. The bright moon never had a heart to begin with.” [Going back to the pun of ‘Mingyue Xin’ literally meaning ‘Bright moon’s heart’. These words were also spoken by Fu Hongxue long ago, when he first met Mingyue Xin.]\u003c/p\u003e\n\u003cp\u003eFu Hongxue acknowledged that.\u003c/p\u003e\n\u003cp\u003eA bright moon with a heart was like a rose without thorns. It only appeared in legends and fairy tales.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo said, “Perhaps you once saw Mingyue Xin in a different place, but that person is just like your old lover, Cui Nong. She no longer exists.”\u003c/p\u003e\n\u003cp\u003eA bygone love which is hard to forget, a wound which is eternal. Perhaps it was precisely because she knew that he would never dare to face that face that she chose that face to disguise herself as, so that he might never see through her disguise.\u003c/p\u003e\n\u003cp\u003eDuring times of sunlight, she would even put on a smiling, laughing mask. And then she suddenly disappeared. Mingyue Xin had disappeared forever. It was as though she had never existed.\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Unfortunately, you made one mistake. You should not have killed Zhuo Yuzhen.”\u003c/p\u003e\n\u003cp\u003eHow could there be jealousy without love? How could there be love between people who had only known each other for half a day?\u003c/p\u003e\n\u003cp\u003eA strange red color had already begun to suffuse Fu Hongxue’s face. “You killed her, only because you hate me.”\u003c/p\u003e\n\u003cp\u003eThat noble, graceful expression on her face had disappeared as well. Her eyes were suddenly filled with hatred.\u003c/p\u003e\n\u003cp\u003eHow could there be hatred without love?\u003c/p\u003e\n\u003cp\u003e“Mingyue Xin died for you, but you never even mentioned her; Zhuo Yuzhen harmed you like that, and yet you always remembered her.”\u003c/p\u003e\n\u003cp\u003eShe didn’t actually say these words. She didn’t need to say these words.\u003c/p\u003e\n\u003cp\u003eShe suddenly loudly said, “Right, I hate you, so I hope you will die.”\u003c/p\u003e\n\u003cp\u003eTurning around, she entered the small room behind her. A splashing sound could be heard, as though someone leapt into the bath. But by the time Fu Hongxue entered to find her, the bathing pool was empty, and there was no one in the room.\u003c/p\u003e\n\u003cp\u003eThe abrupt, monotonous sword-drawing sound continued. It seemed to be just outside the window, but when he pushed apart the drapes and pulled the window up, there was only a stone wall outside with only a few air holes. Through these air holes, only darkness could be seen, without any clue as to what type of place it was.\u003c/p\u003e\n\u003cp\u003eHow did she leave? That small room definitely had a secret passage, but Fu Hongxue no longer cared to search for it. He had already found the person he was looking for, and he also knew why she killed Zhuo Yuzhen.\u003c/p\u003e\n\u003cp\u003eNow, the only thing he could do was wait. Wait for the battle tomorrow. Although waiting here was the same as waiting anywhere else, he wasn’t willing to wait here. Pushing the door open, he left. The abrupt, monotonous sword-drawing sound seemed even closer.\u003c/p\u003e\n\u003cp\u003eHe knew that he definitely would not be able to rest peacefully, and that madame Zhuo definitely wouldn’t let him off. She definitely would think of all sorts of methods to harass him, to make him feel anxious and tense, to destabilize his mind. Even though he hadn’t mistreated her, even though she had gone missing of her own accord, and although they hadn’t come to any sort of secret accord or relationship in the past…she would never think of these things.\u003c/p\u003e\n\u003cp\u003eWhen a woman decides to hate a man, she could find a couple hundred excuses at any time. Although there were many inexplicable things in this situation, he was no longer willing to think about them. So long as he could defeat Gongzi Yu, every single mystery would immediately be revealed. Why should he overthink things now?\u003c/p\u003e\n\u003cp\u003eAnd if he were to die to Gongzi Yu, these matters would become even less worth thinking about. Death was the best answer to any sort of question!\u003c/p\u003e\n\u003cp\u003eAt this time, he found yet another door. The sword-drawing sound came from this room.\u003c/p\u003e\n\u003cp\u003eThis time, he was certain. The sword-drawing sound definitely was coming from this room.\u003c/p\u003e\n\u003cp\u003eHe stretched his hand out to push the door open. As soon as his finger touched the door, he suddenly discovered that this door was cast from iron.\u003c/p\u003e\n\u003cp\u003eThe room was bolted from inside. He couldn’t push it open, nor could he ram it open. Knocking had even less of a response. Just as he was about to give up, he suddenly noticed that the copper rings above the door were especially bright. Clearly, a person’s hand had often stroked them.\u003c/p\u003e\n\u003cp\u003eA copper ring wasn’t like a woman’s breast, nor was it a toy. If there was no particular reason for it, nobody would often play with a copper ring.\u003c/p\u003e\n\u003cp\u003eHe immediately found the reason. He spun the copper rings around, testing tens of times, before finding the correct solution.\u003c/p\u003e\n\u003cp\u003eThe iron door immediately opened.\u003c/p\u003e\n\u003cp\u003eThe sword-drawing sound also immediately stopped!\u003c/p\u003e\n\u003cp\u003eWhen he entered the room, he didn’t see the sword-drawer. But he saw a gigantic treasury, the likes of which he had never seen before.\u003c/p\u003e\n\u003cp\u003ePearls, green jade, crystals, catseyes, and all sorts of other gems which he did not know the name for were piled in a giant heap.\u003c/p\u003e\n\u003cp\u003eThis was a room that was far larger than anyone could imagine. These priceless pearls and gemstones evidently did not seem to be very precious in the eyes of the host. There wasn’t even a chest in this room. The heaps of gems were like heaps of shining garbage, scattered messily all about.\u003c/p\u003e\n\u003cp\u003eThere was a metal cabinet in one corner of the room. On top of it, there was a massive iron lock. What was hidden inside? Can it be that it was even more precious than all of these treasures?\u003c/p\u003e\n\u003cp\u003eIn order to open the metal cabinet, the massive iron lock must first be opened. In order to open the lock, one must have the key.\u003c/p\u003e\n\u003cp\u003eBut there was a type of person who did not need a key to open a lock. Although there weren’t too few people of this sort in the world, there weren’t too many either. In addition, this lock was exquisitely made. The artisan who made this lock once boasted that there couldn’t be more than three people in the world who could open this lock without the key, because he knew the three most godlike thieves in the world. But what he didn’t know was that there was a fourth person in the world.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was the fourth.\u003c/p\u003e\n\u003cp\u003eHe picked the lock open very quickly. Within the cabinet, there was only a sword and an old ledger.\u003c/p\u003e\n\u003cp\u003eA scarlet sword, as crimson as fresh blood.\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s pupils contracted. Naturally, he recognized that this was Yan Nanfei’s ‘Rose Sword’.\u003c/p\u003e\n\u003cp\u003e‘If the sword is here, the man is here! If the sword is broken, the man perishes!’ His sword was here. Where was he?\u003c/p\u003e\n\u003cp\u003eThe ledger was very old and very ratty. Clearly, someone often leafed through it. Why would such an old, ratty ledger be treasured so much?\u003c/p\u003e\n\u003cp\u003eHe casually flipped it open, and then immediately found the solution. On top of this page, the following words were written:\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWang Feng, leader of the Magnificent Escort Agency, made a mistake in offering a poor tribute on February 18th. The young master did not like it.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eOn February 19th, Wang Feng was trampled to death.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eNangong Ao, second son of the aristocratic Nangong family, was slow to pay his respects when met on February 19th. His words were not courteous.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eOn the night of February 19th, Nangong Ao died by violence after drinking.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003ePeng Gui, heir to the ‘Five Tigers Shattering the Gate’ sabre technique, did not do his job properly on February 21st. He revealed classified information.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eOn February 22nd, Peng Gui committed suicide.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eJust after seeing these few lines, Fu Hongxue’s hands were already cold.\u003c/p\u003e\n\u003cp\u003eTo Gongzi Yu, no matter what mistake you made, the result would be the same.\u003c/p\u003e\n\u003cp\u003eDeath! Only death can truly solve the issue at the root.\u003c/p\u003e\n\u003cp\u003eGongzi Yu definitely wouldn’t give anyone the chance to make a second mistake. Even less would he allow anyone to retaliate. This ledger symbolized his power, his power over people’s life and death, an absolute, tyrannical power. This sort of power naturally was more intoxicating than that of pearls or wealth!\u003c/p\u003e\n\u003cp\u003eSo long as you can win the battle, everything will be yours, including all the wealth, the glory, and the power!\u003c/p\u003e\n\u003cp\u003eSince time immemorial, heroes and valiant men had endured through hundreds of battles, piled up bones into mountains, caused blood to flow like a river, all for what?\u003c/p\u003e\n\u003cp\u003eWho could resist this sort of lure?\u003c/p\u003e\n\u003cp\u003eFu Hongxue let out a long sigh. Lifting his head up, he suddenly saw a pair of eyes staring out at him from within the metal cabinet.\u003c/p\u003e\n\u003cp\u003eOriginally, there was only a sword and a ledger in the cabinet. But now, a pair of eyes, sharper than knife edges, had appeared within it.\u003c/p\u003e\n\u003cp\u003eThe four square-foot iron cabinet suddenly became both dark and mysterious. So dark, the bottom couldn’t be seen. That pair of eyes remained in the darkness, staring at him.\u003c/p\u003e\n\u003cp\u003eFu Hongxue unconsciously took two steps back. His palm was already cold with sweat. He naturally knew that there was a door on the other side of the cabinet, and that there was a man outside the door.\u003c/p\u003e\n\u003cp\u003eNow, the door on that side was open as well. The man suddenly appeared.\u003c/p\u003e\n\u003cp\u003eBut for such a pair of eyes to suddenly appear in the darkness, he still couldn’t help but be startled. And then, he immediately saw this person’s face. A face filled with wrinkles and white hair. It was an old man who had experienced the hardships of life. However, his eyes were still young and filled with a boundless intelligence and power.\u003c/p\u003e\n\u003cp\u003eThe old man smiled. “I know you have night vision. You certainly have already seen that I am an old man.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue nodded.\u003c/p\u003e\n\u003cp\u003eThe old man said, “This is the first time you have seen me. It is also the first time I have seen you with my own eyes. I hope this isn’t the last time.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “You, too, hope that I will defeat Gongzi Yu?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “I at least don’t wish to see you die.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “What benefit does my being alive bring you?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “No benefit. I only hope that this battle can be truly fair.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Oh?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “Only if the truly superior person wins, can this match been considered truly fair.”\u003c/p\u003e\n\u003cp\u003eHis smile disappeared. His decrepit old face immediately became solemn and impressive. Only a person who is used to controlling power can have such a firm, tenacious expression.\u003c/p\u003e\n\u003cp\u003eHe slowly continued, “The strongest will have everything. This has always been an unalterable, right and proper principle. Only the truly strongest man can be worthy of having everything.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue stared at his transformation in astonishment. He couldn’t help but ask, “Do you think I am stronger than him?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “At least, you are the only person who has a chance to defeat him. But right now, you are too tense, too tired.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue admitted to it. This entire time, he had been trying to keep himself calm and collected, but he had failed.\u003c/p\u003e\n\u003cp\u003eThe old man said, “There is only sixteen hours from now to the time of your battle. If you cannot totally relax yourself, at this time tomorrow, your corpse will surely be ice cold.”\u003c/p\u003e\n\u003cp\u003eHe did not let Fu Hongxue speak. He continued, “Walk out of this room and take three turns to the right. In the room to the left, there will be a woman waiting for you.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Who?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “You don’t need to ask who she is. Nor do you need to ask why she is waiting for you!”\u003c/p\u003e\n\u003cp\u003eHis voice had also turned sharp and grim!\u003c/p\u003e\n\u003cp\u003e“A man like you should always consider all the women in the world to be nothing more than tools.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Tools?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “She is the only tool which can make you relax.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue was silent.\u003c/p\u003e\n\u003cp\u003eThe old man said, “If you won’t do this, after you leave, take three turns to the left. You can find another room there as well.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “What is in that room?”\u003c/p\u003e\n\u003cp\u003eThe old man said, “A coffin.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s hand tightened around his sabre. “Who exactly are you? What right do you have to command me?”\u003c/p\u003e\n\u003cp\u003eThe old man laughed. His laughter was still mysterious and cunning.\u003c/p\u003e\n\u003cp\u003eJust as his laughter emerged, his face disappeared into the darkness, as though it had never emerged from it.\u003c/p\u003e\n\u003cp\u003eFu Hongxue passed through all of the piles of gems. Without even looking back, he walked out. In his eyes, these priceless gems were nothing more than piles of garbage.\u003c/p\u003e\n\u003cp\u003eAfter he walked out of the room, he immediately turned left, three times in a row. He really did see a door.\u003c/p\u003e\n\u003cp\u003eIt was an empty room. The only thing in it was a coffin. It was an excellent coffin of nanmu wood. In length and in width, it seemed to have been made based on measurements of Fu Hongxue’s body. There was a set of black trousers placed on top of the coffin as well. Its measurements were, of course, perfectly matched to his body frame.\u003c/p\u003e\n\u003cp\u003eThese had all been prepared especially for him. Every aspect was prepared meticulously. This wasn’t the first time they had done this, after all.\u003c/p\u003e\n\u003cp\u003eHe could even imagine how, after he died, a new page would be added to that ledger.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eFu Hongxue was too tired and exhausted, arrogant and stupid, on X day of X month. The young master was overjoyed.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eOn X day of X month, Fu Hongxue died to his sword.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eHe naturally wouldn’t see this ledger entry. The people who could see the entry would surely be very happy and cheerful.\u003c/p\u003e\n\u003cp\u003eThe coffin was cold and hard. The newly applied black paint glimmered slightly.\u003c/p\u003e\n\u003cp\u003eHe suddenly turned around, first returning to that gem-filled treasury. Once again, the dull, monotonous sound of a sword being drawn could be heard from within.\u003c/p\u003e\n\u003cp\u003eBut he didn’t stop. He took three right turns in a row, then pushed open a door on the left.\u003c/p\u003e\n\u003cp\u003eInside, the room was dark. Nothing could be seen, but a light fragrance could be smelled.\u003c/p\u003e\n\u003cp\u003eHe walked in and closed the door. He knew where the bed was. He could already hear his own heart begin to jump.\u003c/p\u003e\n\u003cp\u003eWas there really someone on the bed? What type of person?\u003c/p\u003e\n\u003cp\u003eHe was incapable of treating a living person as a tool. But he also knew that what that old man said was the truth.\u003c/p\u003e\n\u003cp\u003eIf a person wanted to make himself relax, this definitely was the most efficacious method.\u003c/p\u003e\n\u003cp\u003eThe room was very quiet. He finally heard a person breathing. It was a light, yet evenly spaced sound, like a gentle spring breeze blowing over the plains.\u003c/p\u003e\n\u003cp\u003eHe couldn’t resist testing a question. “Who are you? Why are you waiting for me?”\u003c/p\u003e\n\u003cp\u003eNo response.\u003c/p\u003e\n\u003cp\u003eHe could only go over. The bed was warm and soft. Stretching his hand out, he found something which was even warmer and even softer, as smooth and as glossy as satin.\u003c/p\u003e\n\u003cp\u003eShe was already totally nude. His finger gently stroked her smooth, sleek underbelly. The breathing sound immediately became rapid.\u003c/p\u003e\n\u003cp\u003eHe asked again, “Do you know who I am?”\u003c/p\u003e\n\u003cp\u003eStill no response, but a pair of hands suddenly gripped him.\u003c/p\u003e\n\u003cp\u003eA long life of abstinence had made him extremely sensitive and easily excited. He was, after all, a man in the prime of his life. His body had already begun to change.\u003c/p\u003e\n\u003cp\u003eThe urgent breathing sounds had already become overwhelming groans, gently drawing him in. He suddenly sank into a deep, warm joy.\u003c/p\u003e\n\u003cp\u003eHer body was as sweet, as warm, and as refreshing as the grasslands on a sunny spring day. Not only did it endure, it gave back.\u003c/p\u003e\n\u003cp\u003eIn the midst of his obsession, he suddenly, dimly thought of the first time he had accepted this sort of joy. That time, it was in the dark as well. That woman was just as ripe and just as much to be longed for. But what she had offered, she had offered not for love, but to change him into a man, because it was the eve of the day when he was going to take revenge.\u003c/p\u003e\n\u003cp\u003eThe next day, when he awoke, he really did feel filled with an unprecedented sense of satisfaction and fulfillment, as well as a greater sense of vigour.\u003c/p\u003e\n\u003cp\u003eLife really is such a marvelous thing. Some times, ‘expenditures’ could actually make a person more ‘replenished’.\u003c/p\u003e\n\u003cp\u003eThe moist grassland was wriggling.\u003c/p\u003e\n\u003cp\u003eHe stretched his hand out. He suddenly realized that this totally naked woman was wearing a piece of satin on her head.\u003c/p\u003e\n\u003cp\u003eWhat was that for? Can it be that she didn’t want for him to caress her hair? Or was it because she didn’t have any hair at all?\u003c/p\u003e\n\u003cp\u003eWhen he thought of the pure white back of the girl in the bath, he once more felt as though he were committing a sin, but this sinful sensation made him feel all the more stimulated.\u003c/p\u003e\n\u003cp\u003eAnd thus, he totally let himself sink into a sort of carnal pleasure which he had never let himself indulge in before. He finally managed to totally relax himself and extricate himself.\u003c/p\u003e\n\u003cp\u003eHe finally woke up.\u003c/p\u003e\n\u003cp\u003eIt had been many years since he had slept so sweetly. By the time he woke up, the person by his side had already gone, but her fragrance remained on the pillow. The music had disappeared, as though it was like a spring dream which no one could ever catch.\u003c/p\u003e\n\u003cp\u003eThere was actually a light in the room, and the table was covered with dishes. On a banister in the pool inside, there was even a snow-white robe.\u003c/p\u003e\n\u003cp\u003eCan it be that the woman really was…\u003c/p\u003e\n\u003cp\u003eHe forbade himself from thinking further. He soaked in the warm water for an hour, then ate some food. He then once again felt feeling of satisfaction, of vitality. He felt as though he had enough strength to deal with everything.\u003c/p\u003e\n\u003cp\u003eJust at this moment, the door opened.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo was standing at the doorway, coldly staring at him. Her beautiful eyes were filled with cynicism. She coldly said, “You are already prepared?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue nodded.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo said, “Good. Come with me.”\u003c/p\u003e\n\u003cp\u003eThe sound of the sword being drawn was gone now. The hallway was as silent as a tomb.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo was right in front of her. Her waist and her limbs were slender, and her bearing was graceful and charming, making her appear noble and mesmerizing.\u003c/p\u003e\n\u003cp\u003eBut right now, in Fu Hongxue’s eyes, she was only an ordinary woman, no different from any other woman in the entire world.\u003c/p\u003e\n\u003cp\u003eBecause he was totally calm, now. As cold as a sabre blade. As steady as a rock.\u003c/p\u003e\n\u003cp\u003eHe had to be calm. Gongzi Yu was waiting for him past the door in front. This door could be the very last door he would cross.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo had already stopped. Turning to look at him, she suddenly laughed. “Right now, if you wish to flee, I can still give you a few pointers on how to escape.”\u003c/p\u003e\n\u003cp\u003eHer laughter was graceful and elegant, her voice was sweet and warm.\u003c/p\u003e\n\u003cp\u003eBut Fu Hongxue could neither see her nor hear her. He pushed the door open, walked in standing straight as a ramrod, but his walking posture was still as clumsy and laughable as ever.\u003c/p\u003e\n\u003cp\u003eBut there was already nothing in the world which could hold him back. His hand naturally was still tightly gripping his sabre.\u003c/p\u003e\n\u003cp\u003eA pale white hand! A pitch-black sabre!\u003c/p\u003e\n\u003cp\u003eGongzi Yu did not have his sword in hand. The sword was by his side, on top of the stone platform.\u003c/p\u003e\n\u003cp\u003eA scarlet red sword, as red as blood.\u003c/p\u003e\n\u003cp\u003eHe was leaning against the stone platform, quietly watching as Fu Hongxue walked over. He still wore the terrifying bronze mask on his face. But his grim, callous eyes were even more terrifying than the mask.\u003c/p\u003e\n\u003cp\u003eBut Fu Hongxue didn’t seem to notice, as though he had never before seen either this person, or this sword. He had already reached the state of forgetting the self, forgetting the world. These, at least, were the demands he made of himself: No life and death, no victory or defeat, no others, no self. This wasn’t just the highest level of understanding in being a person. This was also the highest level of attainment in martial arts. Only when the mind was totally clear and calm could one execute a sabre technique which surpassed everything. Not only would he surpass the boundaries of form, he would surpass the limits of speed.\u003c/p\u003e\n\u003cp\u003eCould he really achieve this? Out of the many master craftsmen and artisans from antiquity til now, how many were able to achieve this?\u003c/p\u003e\n\u003cp\u003eThe flames of the torches rose high in the air.\u003c/p\u003e\n\u003cp\u003eUnderneath the flickering light of the torches, Gongzi Yu’s bronze mask seemed to be alive, and the expressions on that mask seemed to be changing as well.\u003c/p\u003e\n\u003cp\u003eBut his gaze was absolutely calm. He suddenly said, “Are you already determined to give it up?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Give what up?”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “Give up the right to choose your own witnesses!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue was silent. After a long time, he slowly said, “I only want to find one person.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “Who?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “An old man in a metal cabinet.”\u003c/p\u003e\n\u003cp\u003eA strange change appeared in Gongzi Yu’s eyes, but they immediately returned to its earlier calmness. “I don’t know who you are speaking of.”\u003c/p\u003e\n\u003cp\u003eNaturally, of course he knew. But Fu Hongxue didn’t argue with him. He immediately said, “Then I give it up.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu seemed to breathe a sigh of relief. “Since that is the case, the only option is for me to take the power to choose all six witnesses.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Very well.”\u003c/p\u003e\n\u003cp\u003eMadame Zhuo said, “The first person is me. Do you object?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue shook his head.\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “The second man is Boss Chen.”\u003c/p\u003e\n\u003cp\u003eThere immediately was a loud cry from outside the door.\u003c/p\u003e\n\u003cp\u003e“Boss Chen, please enter!”\u003c/p\u003e\n\u003cp\u003ePeople who could serve as witnesses for this battle would naturally be people of great status. The number of qualified people weren’t many.\u003c/p\u003e\n\u003cp\u003eBut this Boss Chen looked like an ordinary, common person. Although there was a very friendly look on his fat, round face, he still couldn’t hide the terror he felt. Gongzi Yu said, “Naturally, you will recognize this Boss Chen.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “This Boss Chen recognizes you as well.”\u003c/p\u003e\n\u003cp\u003eBoss Chen immediately smiled obsequiously. “I recognize you. We met a year ago at the Phoenix Market.”\u003c/p\u003e\n\u003cp\u003eA bleak and desolate ghost town. An old and shabby shop sign, waving in the wind.\u003c/p\u003e\n\u003cp\u003eChen Family Winery.\u003c/p\u003e\n\u003cp\u003eChen Family Inn.\u003c/p\u003e\n\u003cp\u003eFu Hongxue naturally remembered this person. But he seemed to have become totally deaf and blind.\u003c/p\u003e\n\u003cp\u003eGongzi Yu didn’t seem to care. He dully asked Boss Chen, “You are very familiar with each other?”\u003c/p\u003e\n\u003cp\u003eBoss Chen said, “Not very familiar. We’ve only met one time.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “You can remember him after seeing him just one time!”\u003c/p\u003e\n\u003cp\u003eBoss Chen hesitated. “Because right after this guest entered my store, my store was destroyed. The Phoenix Market was wrecked as well. I…”\u003c/p\u003e\n\u003cp\u003eHe seemed to suddenly feel that his throat was dry. He started to cough nonstop, to the point where all the veins on his head stuck out. It seemed as though tears were about to roll out of his eyes.\u003c/p\u003e\n\u003cp\u003eFortunately, Gongzi Yu waved him in. “Please come in.”\u003c/p\u003e\n\u003cp\u003eMadame Zhuo immediately supported him. In a warm, gentle voice, she said, “Let’s sit over here. Where there is life, there is hope. There’s no need to let past events weigh so heavily in your heart.”\u003c/p\u003e\n\u003cp\u003eBoss Chen said, “I w-…won’t…”\u003c/p\u003e\n\u003cp\u003eBefore he finished even a single phrase, he began to bawl loudly.\u003c/p\u003e\n\u003cp\u003eThe two most peerless, undefeatable masters were able to do battle, but one of the witnesses was crying loudly. This was very rarely seen as well.\u003c/p\u003e\n\u003cp\u003eGongzi Yu was unaffected. He dully said, “Not only is Boss Chen honest and sincere, he is also experienced and knowledgeable. He really is the perfect person to be a witness!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Yes.”\u003c/p\u003e\n\u003cp\u003eHe spoke very calmly, as though all this was perfectly normal and natural.\u003c/p\u003e\n\u003cp\u003eGongzi Yu didn’t reveal any trace of disappointment either. “The third witness is the Master of the Pavilion of Hidden Treasure, elder Ni Baofeng, Elder Ni.”\u003c/p\u003e\n\u003cp\u003eOnce again, there was an immediate loud cry from outside!\u003c/p\u003e\n\u003cp\u003e“Elder Ni, please enter!”\u003c/p\u003e\n\u003cp\u003eAn old man with splendid clothing walked in with his head high. Upon seeing Fu Hongxue, his eyes became filled with hatred and enmity.\u003c/p\u003e\n\u003cp\u003eNo matter what type of person you are, if you could sit down silently when you see the man who killed your son and daughter standing before you, you will have done a very difficult task.\u003c/p\u003e\n\u003cp\u003eNi Baofeng had sat down as well. He was seated next to the still-blubbering Boss Chen, but his eyes were still fixed on Fu Hongxue.\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “Elder Ni is an elder of the martial world. Not only can he know treasures, he also knows people.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I know.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “It is truly our great honor to be able to invite Elder Ni to come here and serve as our witness.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Yes.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “Do you object to any of my three witnesses?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue shook his head.\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “Masters doing battle is just like national chess masters competing. A single wrong move will lead to total defeat across the board. Thus, not even one’s frame of mind can be disturbed in the slightest.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I know.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu said, “None of them disturb you?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “No.”\u003c/p\u003e\n\u003cp\u003eGongzi Yu looked at him. His eyes still actually did not reveal even a slight hint of disappointment.\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s face was totally expressionless as well. It didn’t matter if these three were his enemies, or his loved ones. If they were crying, or laughing. He didn’t care at all, because he had reached the point of listening but paying no attention, looking upon but not seeing.\u003c/p\u003e\n\u003cp\u003eWhether this battle was fair or unfair, he no longer cared anymore either.\u003c/p\u003e\n\u003cp\u003eMadame Zhuo looked at him from afar. Ni Baofeng and Boss Chen looked at him as well. Each of them had a strange expression on their face. It wasn’t just surprise. It was also dread, and also admiration.\u003c/p\u003e\n\u003cp\u003eBut Gongzi Yu didn’t seem moved in the slightest. “The fourth is Master Ruyi of Mt. Jiuhua.”\u003c/p\u003e\n\u003cp\u003eThere of course came a loud cry from outside!\u003c/p\u003e\n\u003cp\u003e“Master Ruyi, please enter.”\u003c/p\u003e\n\u003cp\u003eWhen he saw this person slowly walk in, Fu Hongxue’s expression changed. It was as though a dam which had never before failed suddenly collapsed.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/tymyd/tymyd-chapter-22\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/tymyd/tymyd-chapter-24\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/tymyd/tymyd-chapter-23","bookId":1505,"creation":"Sep 10, 2019 4:33:00 AM","modification":"Sep 10, 2019 4:33:00 AM"}
