{"id":52100,"no":4,"title":"Chapter 3 - Bright Moon at the High Mansion","content":"\u003cp\u003e\u003cspan style\u003d\"text-decoration: underline;\"\u003e\u003cstrong\u003eChapter 3 - Bright Moon at the High Mansion\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e[originally translated by metwin1 and edited by Chowbeng and RWX]\u003c/p\u003e\n\u003cp\u003eThick smoke slowly dispersed.\u003c/p\u003e\n\u003cp\u003eThis is a life taking smoke. There were simply too many renowned heroes who had fallen suddenly and noiselessly to this thick smoke.\u003c/p\u003e\n\u003cp\u003eAs the smoke was dispersing, Wood Man\u0027s eyes were shining with elation. He was certain that his opponents had fallen.\u003c/p\u003e\n\u003cp\u003eIn fact, he hoped to see them on the ground, still struggling to the last. He hoped that they would crawled in front of him and begged for the antidote.\u003c/p\u003e\n\u003cp\u003eEven Shi Batian and Bronze Tiger had knelt in front him before, and begged piteously for the antidote.\u003c/p\u003e\n\u003cp\u003eThey were the most terrifying strongmen in the martial world; but when facing death, even the bravest would become cowardly.\u003c/p\u003e\n\u003cp\u003eTo him, the suffering and hopelessness of other people were a source of pleasure and gratification.\u003c/p\u003e\n\u003cp\u003eBut this time, he was disappointed.\u003c/p\u003e\n\u003cp\u003eFu Hongxue and Yan Nanfei did not fall. In fact, their eyes were still shining.\u003c/p\u003e\n\u003cp\u003eThe light in Wood Man\u0027s eyes was extinguished, just like the flames on his torso. His clothes were burnt to ashes and were scattered into the winds along with the thick smoke. Only a person with soot blackened skin was left. It looked like cast iron that was inflammable, yet like burnt charcoal too.\u003c/p\u003e\n\u003cp\u003eYan Nanfei suddenly spoke, “These two people are the Double Killers of the Five Elements.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue gave a “humph” in reply.\u003c/p\u003e\n\u003cp\u003e[Wood hiding within Metal, Water and Fire coming from the same source], [Hidden movement in borrowed Earth, Ghost hands grabbing legs], normally these assassination moves were practically impossible to defend against. The Double Killers of the Five Elements were one of a few professional assassins who commanded the highest price. It was rumoured that they were already men of huge fortunes, if not millionaires.\u003c/p\u003e\n\u003cp\u003eUnfortunately, in this world no matter how many times a millionare you were, to some people you were essentially worthless.\u003c/p\u003e\n\u003cp\u003eMud Man laughed uneasily, and spoke first, “He is Metal-Wood-Water-Fire, and I am Earth. I am nothing really, a stupid donkey, a useless potato and a worthless dog.”\u003c/p\u003e\n\u003cp\u003eHe was looking very intently at the sabre in Fu Hongxue\u0027s hand.\u003c/p\u003e\n\u003cp\u003eThe sabre was already back in its sheath. A pitch black hilt and a pitch black sheath.\u003c/p\u003e\n\u003cp\u003eMud Man sighed, and laughed bitterly, “Even if we did not recognise Hero Fu, we would have recognised this sabre.”\u003c/p\u003e\n\u003cp\u003eWood Man said, “But we could not imagine that Hero Fu would save him.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue retorted coldly, “This life is already mine.”\u003c/p\u003e\n\u003cp\u003eWood Man answered, “Yes.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue:“Apart from me, no one else can touch a strand of his hair.”\u003c/p\u003e\n\u003cp\u003eWood Man, “Yes, yes.”\u003c/p\u003e\n\u003cp\u003eMud Man pleaded, “If Hero Fu promises to spare my life, I would immediately scram somewhere far far away.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Scram.”\u003c/p\u003e\n\u003cp\u003eHis words were barely out of his mouth when Wood Man and Mud Man scrammed off. In fact, they actually rolled out like two balls.\u003c/p\u003e\n\u003cp\u003eYan Nanfei suddenly laughed, and said, “I knew you definitely would not kill them,”\u003c/p\u003e\n\u003cp\u003e“Oh?” Fu Hongxue replied.\u003c/p\u003e\n\u003cp\u003eYan Nanfei explained, “because they are not worthy enough.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue looked intently at the sabre that was in this hand, but there was an unspeakable sense of loneliness in his expression. He never had many friends to begin with. Now even his remaining enemies were dwindling in number. Under the heavens, how many people were still worthy of his sabre?\u003c/p\u003e\n\u003cp\u003eFun Hongxue said slowly, “I heard that their price for killing Shi Batian was three hundred thousand taels.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei replied, “Absolutely correct.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Your life is obviously worth more than Shi Batian\u0027s.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Far more.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Not many people can afford their price for you.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei shut his mouth.\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I didn\u0027t ask as you had known that person\u0027s identify long ago.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei\u0027s mouth was still shut tight. Silence without words.\u003c/p\u003e\n\u003cp\u003eFu Hongxue continued, “Your unfulfilled wishes was to deal with this person?”\u003c/p\u003e\n\u003cp\u003eWithout warning, Yan Nanfei laughed coldly, “You had already asked too much!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “You are not willing to say?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei, “Not willing.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “Then, you go!”\u003c/p\u003e\n\u003cp\u003eYan Nanfei, “I am even more unwilling to go!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “Don\u0027t forget that I had already loaned you a year. What you still own me was the span of a year.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei, “You want me to repay it? In what way?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “By clearing up your unfinished business.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei, “But, I...”\u003c/p\u003e\n\u003cp\u003eFu Hongxue lifted his head slowly and looked hard at him, “If you are a true man, even when facing death, you would want to die with integrity.”\u003c/p\u003e\n\u003cp\u003eHe had lifted his head up high, but Yan Nanfei followed his head, as if unwilling to let him see the expressions on his face.\u003c/p\u003e\n\u003cp\u003eNobody could explain what was that expression. - Was it sadness? Pain? or Fear?\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Your sword is still alive, your body still alive. Why did you have no courage to face him?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei lifted his head up, held his sword tightly in his hand, “Fine, I would go. After a year, I would certainly return.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I know!”\u003c/p\u003e\n\u003cp\u003eThere was still wine on the table.\u003c/p\u003e\n\u003cp\u003eYan Nanfei suddenly turned around to grab the wine bottle, “You still do not drink?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I don\u0027t drink!”\u003c/p\u003e\n\u003cp\u003eYan Nanfei looked at him, “People who don\u0027t drink, are they always sober?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied, “Not necessarily.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei tilted his head backwards, guffawed loudly and drank half the bottle of wine in one gulp. Then he walked out of the tavern in large strides.\u003c/p\u003e\n\u003cp\u003eHe walked very fast. Because he knew the road ahead was not only difficult, but also very long. So long that it was mind-boggling.\u003c/p\u003e\n\u003cp\u003eDead town. Deserted street. Lonely world. Lonely bright moon too.\u003c/p\u003e\n\u003cp\u003eTonight was a night of a full moon.\u003c/p\u003e\n\u003cp\u003eThe moon was full, but the heart was already empty.\u003c/p\u003e\n\u003cp\u003eYan Nanfei walked under the moon light. He was walking in large strides, walking very fast.\u003c/p\u003e\n\u003cp\u003eBut Fu Hongxue kept following behind him. No matter how fast he walked. The moment he turned around, he would immediately see the lonely cripple, using that clumsy looking and strange posture, slowly shuffling behind.\u003c/p\u003e\n\u003cp\u003eThe stars were dispersing, the moon was dimming and the night was almost over. He was still following, still keeping the same distance behind.\u003c/p\u003e\n\u003cp\u003eFinally, Yan Nanfei could take it no more. He turned around and yelled loudly, “Are you my shadow?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “No.”\u003c/p\u003e\n\u003cp\u003e“Then why do you kept following me?” Yan Nanfei questioned.\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered, “I am not willing to allow you to die in someone else\u0027s hands.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei gave a cold laugh, “I don\u0027t need you to worry for me. I have always been able to take care of myself.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Can you really?”\u003c/p\u003e\n\u003cp\u003eHe did not let Yan Nanfei but immediately continued, “Only the a truly emotionless person can take care of themselves. You feel too much.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “What about you?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said grimly, “I may used to have feelings, but I had forgotten them. Long forgotten them.”\u003c/p\u003e\n\u003cp\u003eHis pale face was without emotion. Who could have noticed that behind this cold, grim mask hid deep, heart wrenching pain? Who could have seen those painful memories?\u003c/p\u003e\n\u003cp\u003eIf a person\u0027s heart was truly dead, feelings totally extinguished, no one in the world could hurt him.\u003c/p\u003e\n\u003cp\u003eYan Nanfei gazed hard at him and unhurriedly said, “You are wrong if you think you can take care of yourself. “\u003c/p\u003e\n\u003cp\u003e“Oh?” Fu Hongxue replied.\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “There\u0027s one more person in this world that can hurt you.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Who?”\u003c/p\u003e\n\u003cp\u003e“Yourself,” Yan Nanfei answered.\u003c/p\u003e\n\u003cp\u003eThe day broke, and the sun rose.\u003c/p\u003e\n\u003cp\u003eThe sun had already illuminated the dark, gloomy and cold Earth. And also the words on a stone plaque at the side of the road: “Phoenix Settlement”.\u003c/p\u003e\n\u003cp\u003eOnly this stone plaque, and these three words, remained the same as they had been a year ago.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was not a man who shown his sadness easily. But when he walked past this plaque, he could not help but turned and looked at it again.\u003c/p\u003e\n\u003cp\u003eThe lands were broad as the seas were wide. Changes that happened in this world were often large. But the change that occurred here was undoubtedly too fast, so fast that it was unnatural.\u003c/p\u003e\n\u003cp\u003eYan Nanfei could guessed Fu Hongxue\u0027s feelings, and asked suddenly, “You didn\u0027t expect this at all?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue nodded his head slowly, and said, “No, I didn\u0027t, but you already knew.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Oh?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered, “You already knew that this town was dead, that was why you brought your wine and your music with you.\u003c/p\u003e\n\u003cp\u003eYan Nanfei did not deny this.\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “You obviously know why this town ended up in such a sorry state too. “\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “Of course I know.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Why?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei\u0027s eyes suddenly showed a mixture of pain and anger. After a long time, he muttered, “Because of me.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Because of you? How did you turn the entire bustling town to transform into a grave?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei clamped his mouth shut.\u003c/p\u003e\n\u003cp\u003eThe lines of his mouth were thin and cold; in fact, they were almost cruel. So the moment he closed his mouth, anybody could see that he would no longer discuss the matter any further.\u003c/p\u003e\n\u003cp\u003eSo Fu Hongxue closed his mouth too.\u003c/p\u003e\n\u003cp\u003eBut their eyes were not closed. They both saw a stallion approaching towards them from the side road. Galloping, galloping at a high speed.\u003c/p\u003e\n\u003cp\u003eThe stallion was a thoroughbred, and the rider\u0027s skills was superb. By the time they saw the horse, both the rider and his horse were already in front of them.\u003c/p\u003e\n\u003cp\u003eYan Nanfei suddenly shot out like an arrow, and did a flip midair as he leaped over the stallion\u0027s head. He was already pulling on the reins of the stallion when his feet touched the ground again.\u003c/p\u003e\n\u003cp\u003eHe stood there like a nail driven into the ground; with just one hand, he managed to rein in a galloping horse.\u003c/p\u003e\n\u003cp\u003eThe stallion was startled, and reared up.\u003c/p\u003e\n\u003cp\u003eThe rider was so angry; he cracked his whip and lashed it in the direction of Yan Nanfei\u0027s head.\u003c/p\u003e\n\u003cp\u003eSuddenly he found himself sprawled on the ground; his perspiration-drenched face was already pale and tense with fear and terror. He stared at Yan Nanfei, stupefied.\u003c/p\u003e\n\u003cp\u003eYan Nanfei was smiling. “Why are you such in a terrible hurry to get to your destination?” he asked.\u003c/p\u003e\n\u003cp\u003eThe rider was trying to keep his temper. He had to, after witnessing Yan Nanfei\u0027s skill. He felt that he had to answer Yan Nanfei\u0027s question. “I am rushing to get to a funeral wake.”\u003c/p\u003e\n\u003cp\u003e“A relative of yours died?” Yan Nanfei asked.\u003c/p\u003e\n\u003cp\u003eThe rider answered, “Yes, my second uncle.”\u003c/p\u003e\n\u003cp\u003e“By hurrying there, will you be able to save your uncle?”\u003c/p\u003e\n\u003cp\u003eIt was a rhetorical question, for who could raise the dead?\u003c/p\u003e\n\u003cp\u003e“Nothing changes anyway, why travel in such haste?” Yan Nanfei asked.\u003c/p\u003e\n\u003cp\u003eThe rider was confused, and asked, “What exactly do you want from me?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “I want to buy your horse.”\u003c/p\u003e\n\u003cp\u003eThe rider answered, “The horse is not for sale.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei reached into his pocket casually, took out a bundle of gold leaves and threw it in front of the rider. “Is this enough?”\u003c/p\u003e\n\u003cp\u003eThe rider was shocked by Yan Nanfei\u0027s gesture. He stared blankly at the bundle of gold leaves. He finally gave a long sigh, and said, “A dead man cannot come back to life. Why do I need to rush to get there?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed. As he was stroking the mane of the stallion, he smiled at Fu Hongxue, and said, “I know I can\u0027t get away from you, but now I have six legs.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue was speechless.\u003c/p\u003e\n\u003cp\u003eYan Nanfei guffawed, and waved good bye, “So long! I\u0027ll see you in a year\u0027s time!”\u003c/p\u003e\n\u003cp\u003eHe was about to jump onto the intricately designed saddle that was on this beautiful thoroughbred. Suddenly, there was a flash of sabre light.\u003c/p\u003e\n\u003cp\u003eFu Hongxue had already pulled out his sabre. The sabre flashed with light, and returned to its sheath.\u003c/p\u003e\n\u003cp\u003eThe horse was not startled, and nobody present was injured in anyway. This flash of sabre light looked like shooting stars in the sky; shooting stars that gave people beauty and hope, not fear and horror.\u003c/p\u003e\n\u003cp\u003eBut Yan Nanfei was shocked. He looked at the sabre in Fu Hongxue\u0027s hand. “I know you very seldom drawn your sabre.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue grunted an agreement.\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Your sabre was not meant for viewing pleasure.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue grunted once again.\u003c/p\u003e\n\u003cp\u003e“Then why did you pull your sabre out for no reason whatsoever?” Yan Nanfei asked.\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered, “Because of your legs.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei did not understand, “My legs?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue continued, “You don\u0027t have six legs. In fact, the moment you mount this horse, you won’t have even one leg.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei tensed, and turned back to look at the horse. He saw blood!\u003c/p\u003e\n\u003cp\u003eCrimson red blood was flowing out. The blood did not flow out from anybody, nor the horse.\u003c/p\u003e\n\u003cp\u003eThe blood was flowing out from the saddle of the horse.\u003c/p\u003e\n\u003cp\u003eThe horse rider, who had been sitting on the ground all this time, suddenly jumped to his feet and sprinted away, as quickly as a flying arrow.\u003c/p\u003e\n\u003cp\u003eFu Hongxue did not stop him, neither did Yan Nanfei; they did not even glance at the rider.\u003c/p\u003e\n\u003cp\u003eBoth their eyes were glued to the horse saddle. Yan Nanfei cautiously used two fingers to lift the saddle. - Only one half of the saddle.\u003c/p\u003e\n\u003cp\u003eThis intricately designed saddle had been severed into 2 halves by the flash of sabre light.\u003c/p\u003e\n\u003cp\u003eHow could the horse saddle bleed?\u003c/p\u003e\n\u003cp\u003eIt couldn\u0027t, obviously.\u003c/p\u003e\n\u003cp\u003eThe blood was cool, and was flowing out from snakes. The snakes were in the horse saddle.\u003c/p\u003e\n\u003cp\u003eThere were four poisonous snakes, and they were too cleaved into two by the flash of sabre light.\u003c/p\u003e\n\u003cp\u003eIf a person sat on this horse saddle, that had holes for snakes to crawl out, whose seals had been removed, and if the four venomous snakes had crawled out and bit the legs of this person…\u003c/p\u003e\n\u003cp\u003eWould this person still have legs?\u003c/p\u003e\n\u003cp\u003eYan Nanfei broke out in a cold sweat at the very thought of this horrifying scenario.\u003c/p\u003e\n\u003cp\u003eHe was still perspiring, when he heard a wretched cry. This cry was so chilling, he felt as though a sword was being stabbed into his chest.\u003c/p\u003e\n\u003cp\u003eThe escaping rider had used his lightness skill, the [Swallow Pecking Water Trice], to escape, and was already about seven to eight feet away.\u003c/p\u003e\n\u003cp\u003eHe suddenly gave a cry of horror, and collapsed.\u003c/p\u003e\n\u003cp\u003eThat flash of sabre light earlier not only severed the saddle and cleaved the snakes, it injured the rider\u0027s heart, spleen and liver.\u003c/p\u003e\n\u003cp\u003eHe collapsed onto the ground, and was writhing like snakes.\u003c/p\u003e\n\u003cp\u003eNo one turned around and looked at him.\u003c/p\u003e\n\u003cp\u003eYan Nanfei slowly released the severed horse saddle, raised his head, and gazed intently at Fu Hongxue.\u003c/p\u003e\n\u003cp\u003eFu Hongxue\u0027s hand was on the hilt of his sabre, and his sabre was in its sheath.\u003c/p\u003e\n\u003cp\u003eYan Nanfei contemplated silently for a while, and suddenly sighed. “I regret very much that I was born too late, and never had the opportunity to see this.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “You have never seen Ye Kai\u0027s blade?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “I regret that I never had the fortune. I…”\u003c/p\u003e\n\u003cp\u003eFu Hongxue interrupted him, “You may not have had the fortune, but you are nevertheless also lucky. There were people who had seen his sabre in the past..”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “They had all died?”\u003c/p\u003e\n\u003cp\u003eFun Hongxue answered, “Even if their bodies are still alive, their hearts were already dead.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Their hearts had died?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “All who had seen him use his blade, dared not use a blade for the rest of their lives, without exception.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “But his blade is really just a flying knife.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied, “A flying knife is a type of blade as well.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei agreed, could only agree.\u003c/p\u003e\n\u003cp\u003eThere were all sorts of knifes and sabres. Every single type of sabre and knife can be used to kill.\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Have you ever used a sabre?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei replied, “Never.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “How many people have you seen, who do actually know how to use sabres properly”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “Not too many.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “Then you have no business to be talking about knifes and sabres.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed, and said, “Perhaps I really do not have any business to be talking about knifes and sabres; perhaps your sabre technique isn\u0027t unmatched under the heavens. These, I am not too sure. But I am sure about one thing.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “And what is that?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Now I have six legs again, but you only have two.”\u003c/p\u003e\n\u003cp\u003eHe gave a loud gaffaw again, and leaped onto the horse.\u003c/p\u003e\n\u003cp\u003eThe horse saddle may be severed, and the snakes may be slashed, but the horse was still very much alive and alert.\u003c/p\u003e\n\u003cp\u003eThe horse ran like the wind, and left behind a swirl of fine dust.\u003c/p\u003e\n\u003cp\u003eFu Hongxue looked down at his feet; his eyes had the indescribable look of self ridicule, and whispered to himself, “You are wrong. I don\u0027t have two legs; I only have one.”\u003c/p\u003e\n\u003cp\u003eThere were wine tavern in every town; and every wine tavern with long histories had something that was special or unique.\u003c/p\u003e\n\u003cp\u003eThe “Ten Thousand Longevity” tavern was unique in one way, and that was the exorbitant prices that it charged. Everything that was served, food or wine, were at least double the price of other taverns.\u003c/p\u003e\n\u003cp\u003eMan has many weakness. Spending tons of money for the sake of appearance was surely one of them.\u003c/p\u003e\n\u003cp\u003eThis was why places that charged ridiculous prices also had ridiculously good business.\u003c/p\u003e\n\u003cp\u003eWhen Yan Nanfei walked out of the “Ten Thousand Longevity” tavern and looked at the horse tied outside the tavern, he could not help laughing.\u003c/p\u003e\n\u003cp\u003eTwo legs were really of no match to six legs.\u003c/p\u003e\n\u003cp\u003eEvery Man hopes to escape their shadow. This was certainly another of Man’s many weaknesses.\u003c/p\u003e\n\u003cp\u003eBut as he was untying horse reins, he could no longer laugh.\u003c/p\u003e\n\u003cp\u003eThe moment he raised his head, he saw Fu Hongxue again.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was standing across the street, and was staring at him coldly. His face was deadly pale, his eyes silently cold, his sword pitch black.\u003c/p\u003e\n\u003cp\u003eYan Nanfei smiled.\u003c/p\u003e\n\u003cp\u003eHe gave the horse a small pat and the horse trotted away. He, however was still where he was, smiling and looking at Fu Hongxue.\u003c/p\u003e\n\u003cp\u003eThe horse that was worth thousands of gold, turned into swirl of dust with a mere pat of his hands.\u003c/p\u003e\n\u003cp\u003eA thousand taels. Ten thousand taels. Tens and Tens of thousand taels. What are they in his eyes? To him, they are nothing but dust.\u003c/p\u003e\n\u003cp\u003eThe dust settled, and he walked across the street towards Fu Hongxue. He smiled, and said, “You still managed to catch up after all.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue gave a “humph” in reply.\u003c/p\u003e\n\u003cp\u003eYan Nanfei gave a deep sigh and said, “It’s just as well I am not a female. If not, after being chased and watched like this by you, I’d have had no choice but to marry you.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s pale face suddenly blushed red. The blush was so deep red, it was alarming. All the pores on his face contorted as though he was in deep pain.\u003c/p\u003e\n\u003cp\u003eWhat excruciating memory lay in his heart? Why would a simple, ordinary joke like this one cause him so much pain?\u003c/p\u003e\n\u003cp\u003eYan Nanfei closed his mouth.\u003c/p\u003e\n\u003cp\u003eHe never liked hurting other people. Everytime he hurt a person by mistake, he would feel very bad too.\u003c/p\u003e\n\u003cp\u003eThey stood there face to face, under the roof of a bakery.\u003c/p\u003e\n\u003cp\u003eThere was a skinny and withered old lady with two children, a girl and a boy. They were buying some cakes in the bakery. They were barely out of the bakery and the children were already bickering to eat. Though the granny was telling them that it was not good to be eating on the streets, she took out two pieces for them to share.\u003c/p\u003e\n\u003cp\u003eThe children however, quarrelled even louder after they received their share of the cakes.\u003c/p\u003e\n\u003cp\u003eThe little boy jumping up and down, “Why is Xiaoping’s piece so much bigger than mine? I want her cake.”\u003c/p\u003e\n\u003cp\u003eThe little girl naturally refused so the little boy tried to scratch it from her. The little girl had no choice but to run away from him. The old granny couldn\u0027t them and could only shake her head and sighed with resignation.\u003c/p\u003e\n\u003cp\u003eThe girl was not as fast and the boy was going to catch her. She ran behind Yan Nanfei and hid, pulled at Yan Nanfei’s sleeve, and said, “Good uncle, please save me. He’s a little robber.”\u003c/p\u003e\n\u003cp\u003eThe boy quipped, “ This uncle won’t help you. We are all men, and men stick together.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed at the antics of the children.\u003c/p\u003e\n\u003cp\u003eThese two children may be mischievious, but they were very intelligent and very cute. Yan Nanfei also had his childhood once, but those golden times were gone, never to return. He too,had a girl playmate once, and he wondered if she was already married.\u003c/p\u003e\n\u003cp\u003eHe saw something in the two children that reminded him of his childhood.\u003c/p\u003e\n\u003cp\u003eHis heart was suddenly filled with warmth and nostalgia. He grabbed both the hands of the two children and said gently, “Let’s quarrel no more. Uncle will buy ten cakes for each of you.”\u003c/p\u003e\n\u003cp\u003eThe faces of the two children lighted up, their smiles were angelic. They both start running into his embrace.\u003c/p\u003e\n\u003cp\u003eYan Nanfei opened his arms, preparing to carry a child in each arm.\u003c/p\u003e\n\u003cp\u003eAt this instant, there was a flash of sabre light.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was a person who never drawn his sabre out lightly, and yet he suddenly draw his sabre!\u003c/p\u003e\n\u003cp\u003eThe sabre light flashed pass, and the cakes that were in the children’s hands fell onto the ground. They had been slashed into halfs.\u003c/p\u003e\n\u003cp\u003eBoth children were so frightened that they started crying and ran back to their grandmother.\u003c/p\u003e\n\u003cp\u003eYan Nanfei was also stunned. He stared at Fu Hongxue in bewilderment.\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s sabre was already back in its sheath. His face was expressionless.\u003c/p\u003e\n\u003cp\u003eYan Nanfei suddenly laughed coldly. “Now I know. Other than killing, your sabre has one more function.”\u003c/p\u003e\n\u003cp\u003eFun Hongxue said, “Oh?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “You also use your sabre to frighten children.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied coldly, “I only scare one type of children.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “Which type?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered, “The type that kills.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei was stunned once more, and turned his back slowly. The old lady was backing away with the two children. The children were no longer crying; their eyes were wide open, and they were glaring at Yan Nanfei.\u003c/p\u003e\n\u003cp\u003eIt was as though their glare was filled with murderous intentions and hatred.\u003c/p\u003e\n\u003cp\u003eYan Nanfei lowered his head. His heart beginning to sink. His eyes fell on the cakes on the ground. There were reflective bits inside the cakes.\u003c/p\u003e\n\u003cp\u003eHe picked up one of the halves, and found a mechanised hollow tube filled with [Five-Poison Needles].\u003c/p\u003e\n\u003cp\u003eHe suddenly leaped up like a bird, and landed in front of the old lady. “You are the Ghostly Granny?”\u003c/p\u003e\n\u003cp\u003eThe old lady laughed. The wrinkled and shrivelled face, suddenly became evil and cruel. “You’ve heard of me. Now, that is unexpected.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei gazed at her for a long time, and said calmly, “You do know that I have a habit.”\u003c/p\u003e\n\u003cp\u003eGhostly Granny said, “What habit is it?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “I never kill women.”\u003c/p\u003e\n\u003cp\u003eGhostly Granny laughed. “It\u0027s a good habit to have.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “You may be old, but you are still women.”\u003c/p\u003e\n\u003cp\u003eGhostly Granny let out a breath, and said, “It\u0027s too bad for you that you\u0027ve never seen me when I was still young, or else….\u003c/p\u003e\n\u003cp\u003eYan Nanfei interrupted coldly, “… I would have still killed you.”\u003c/p\u003e\n\u003cp\u003eGhostly Granny said, “I seem to recall you just mentioning that you never killed women.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “You are an exception.”\u003c/p\u003e\n\u003cp\u003eGhostly Granny asked, “Why am I an exception?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Children are pure and innocent. You should not have used them. You\u0027ve wrecked their lives…”\u003c/p\u003e\n\u003cp\u003eGhostly Granny smiled again. Her smile was chilling, “Granny loves the children, and the children love to help their Granny with her work. What business is it of yours?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei shut his mouth.\u003c/p\u003e\n\u003cp\u003eHe was no longer bear to discuss this matter. His hand was already griping his sword sword.\u003c/p\u003e\n\u003cp\u003eA bright red sword, red as fresh blood!\u003c/p\u003e\n\u003cp\u003eGhostly Granny cackled in laughter. “Other people are afraid of your Wild Rose Sword, but I…”\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t finish her sentence, but threw a bag of sugared pastries heavily on the ground.\u003c/p\u003e\n\u003cp\u003eThere was a suddenly clap of thunderous explosion. There was dust flying high, acrid smoke everywhere and sparks flying about.\u003c/p\u003e\n\u003cp\u003eYan Nanfei leaped into the air and somersaulted two feet back.\u003c/p\u003e\n\u003cp\u003eBy the time the smoke dispersed and the dust settled, Ghostly Granny and the two children had vanished. There was however, a large hole left in the ground.\u003c/p\u003e\n\u003cp\u003eA crowd gathered around to watch, but soon scattered.\u003c/p\u003e\n\u003cp\u003eYan Nanfei was still standing there, shell-shocked. After a good while, he turned and faced Fu Hongxue.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was as cold as snow.\u003c/p\u003e\n\u003cp\u003eYan Nanfei let out a long sigh, and said, “You are right once again.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “I\u0027m rarely wrong.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “The children are innocent. They must have been kidnapped by Ghostly Granny when they were tiny.”\u003c/p\u003e\n\u003cp\u003eIn the dark of the night, and babies in cloth bundles…\u003c/p\u003e\n\u003cp\u003eA shrivelled old lady knocking on the door in the middle of the night…\u003c/p\u003e\n\u003cp\u003eGrieving parents, pitiful children…\u003c/p\u003e\n\u003cp\u003eYan Nanfei said sorrowfully, “She must had used all kinds of methods to have taught the children nothing but evil and hatred from a young and tender age.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “That\u0027s why you should not have let escape.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “I did not suspect that fire seeds from Jiangnan\u0027s Thunderclap Hall could be hidden in that the bag of sugared pastries.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “You should have thought of that possibility. If the cakes could contain the [Five-Poison Needles], they could also contain the [Thunderclap Seed].”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “You expected something like this would occur?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue did not deny it.\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “Since you are of the opinion that that I should not have let her go, why didn’t you strike her down?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered coldly, “That is because her target was you, not me. Besides, I never expect you to be so dumb.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei looked intently at him, and laughed bitterly. “Perhaps it is not that I\u0027m too dumb, but it is that you are too sharp.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “Oh?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Right to this very moment, I still find it hard to understand how you detect the toxic mist amidst the smoke and the poisonous snakes in the saddle?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue was silent for a long time. He calmly said, “There are many ways to kill a person. Assassination is but one of them, and yet this way of killing is the most fearsome of them all.\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “I know that.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue continued, “Then do you know how many assassination methods are there?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “I don’t know.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked again, “Do you know how many people in the last three centuries have died undeserved deaths because of successful assassinations?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “I don’t know.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “At least 538 people.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “You counted?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied, “I counted. It took me seven years of time and effort to get this exact number.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei could not stop himself from asking the obvious question, “Why did you waste so much time to find the exact answer to this trivial question?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied, “If I had not taken the trouble to do so, I would have already died at least ten times , and you three times.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei let out a small breath. He was going to say something, but stopped himself.\u003c/p\u003e\n\u003cp\u003eFu Hongxue continued “These 538 people that I mentioned, they were all highly skilled members of the pugilistic fraternity. They were all killed by people who were normally not their match in martial arts.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “They only succeed because the assassination methods were so lowly and ingenious.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue nodded. “There may have been 538 deaths, but there were only 483 assassins.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Some were victims of the same assassin.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue nodded again. “Also, different assassins might shared the similar methods.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “I would have imagine so.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “In all, the assassins had used 227 different methods.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “It goes without saying that these 227 methods must be the most malicious and ingenious.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue replied, “Obviously so.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei asked, “Of these, how many of them do you know?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue answered, “227.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei let out another breath, and said, “Originally, I know none of these methods.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “At the very least, you now know three of them.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “More than three methods!”\u003c/p\u003e\n\u003cp\u003eFu Hongxue, “More than three methods?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei smiled, “Do you know the number of assassination attempts I had survived in the last six months?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue shook his head.\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “39 attempts, not counting the three that you witnessed.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Their methods were all different?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei replied, “Not only were they totally different, they all came unexpected. But I’m still alive today.”\u003c/p\u003e\n\u003cp\u003eIt was now Fu Hongxue’s turn to be speechless.\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed and walked into a small road that was intersecting the major street that they were on. There was a high mansion. There were floral scents emitting from the upper floors.\u003c/p\u003e\n\u003cp\u003eWhat floral scent was it?\u003c/p\u003e\n\u003cp\u003eCould it be that of wild roses?\u003c/p\u003e\n\u003cp\u003eThere was a high mansion.\u003c/p\u003e\n\u003cp\u003eThere were windows in the mansion.\u003c/p\u003e\n\u003cp\u003eThere was moon outside the window.\u003c/p\u003e\n\u003cp\u003eThere were flowers beneath the moon.\u003c/p\u003e\n\u003cp\u003eFlowers were wild roses.\u003c/p\u003e\n\u003cp\u003eThe moon was bright moon.\u003c/p\u003e\n\u003cp\u003eThere was no lamp. The moonlight came in from the window, and shone at the wild roses that were beside Yan Nanfei.\u003c/p\u003e\n\u003cp\u003eHe had more than wild roses by his side, he also have a person pricked by wild roses.\u003c/p\u003e\n\u003cp\u003eTonight, of all nights..\u003c/p\u003e\n\u003cp\u003eThe moon is like a liquid, two people leaning on each other.\u003c/p\u003e\n\u003cp\u003eThere were countless burdens to be shared.\u003c/p\u003e\n\u003cp\u003eThere were never-ending words of love to be said.\u003c/p\u003e\n\u003cp\u003eThe night was deep, and men were getting intoxicated.\u003c/p\u003e\n\u003cp\u003eYan Nanfei was however very much alert, his eyes were still clear as the bright moon. But the expression on his face seemed as though he had been pricked by the thorns of wild roses.\u003c/p\u003e\n\u003cp\u003eWild roses had thorns, but what about the bright moon? \u0026nbsp;The bright moon did have a heart, that was why the moon would lend its rays to illuminate manknd. The name of this lady was *Mingyue Xin.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e[*Mingyue Xin literally translates as “Heart of the Bright Moon”. She is a recurring character, and the moon is often used as a pun/metaphor for her. Keep this in mind henceforth when the “bright moon” or “the heart of the bright moon” comes up. The author may be just be literally describing about the bright moon hanging in the sky. Then again, the author may actually be referring to Mingyue Xin.]\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe deeper the night,\u003c/p\u003e\n\u003cp\u003eThe clearer the moon,\u003c/p\u003e\n\u003cp\u003eThe more beautiful she is,\u003c/p\u003e\n\u003cp\u003eHowever, the expression on his face was even more hurt.\u003c/p\u003e\n\u003cp\u003eShe gazed intently at him for a long time. Finally she had to break the silence. She whispered, “What is in your mind?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei remained quiet for a long time, before he answered softly, “I\u0027m thinking of people. Two people in particular.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin’s voice was even gentler now, “Am I one of the two?\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “No.”\u003c/p\u003e\n\u003cp\u003eHis voice became ice-cold, “You are not either of the two people I\u0027m thinking of.”\u003c/p\u003e\n\u003cp\u003eThe beauty was pricked once again, but she did not withdraw. She asked, “Who are they then?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “One of them is Fu Hongxue.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin asked, “Fu Hongxue? The person who was waiting for you at Phoenix Settlement?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei nodded.\u003c/p\u003e\n\u003cp\u003eMingyue Xin asked, “He is your enemy, isn\u0027t he?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei answered, “No.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin asked, “Is he your friend then?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “No, he\u0027s not my friend either.”\u003c/p\u003e\n\u003cp\u003eHe suddenly laughed, and said, “You\u0027d never guess in a million years why he was waiting for me at Phoenix Settlement.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin asked, “Why was he waiting for you?\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “He was waiting to kill me.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin let out a small breath, and said, “But he didn\u0027t kill you.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei was still smiling, but his expression was mocking, “Not only did he not kill me, he even saved me three times.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin sighed once more, and said, “We women will never understand these kind of men.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “Woman don\u0027t understand man in the first place.”\u003c/p\u003e\n\u003cp\u003eMingyue Xin turned her head towards the window and stared at the moon hanging outside the window. She asked, “Who else were you thinking of?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei\u0027s expression turned from gibe back to pain, and said slowly, “A man I want to kill, but I know I would never be able to kill him.”\u003c/p\u003e\n\u003cp\u003eSeeing his pain, her eyes dimmed; even the moon outside also dimmed.\u003c/p\u003e\n\u003cp\u003eA dark cloud floated quietly across the sky, and covered the moon.\u003c/p\u003e\n\u003cp\u003eShe got up silently, and whispered, “I\u0027m leaving now, you should be sleeping soon.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei did not raise his head. “You are leaving?”\u003c/p\u003e\n\u003cp\u003eMingyue Xin said, “I know that I should be with you when you are feeling down, but…”\u003c/p\u003e\n\u003cp\u003e“But you had to leave anyway, even though this room is amongst the *wind and dust, you had never allowed guests to stay overnight. You are giving me face by letting me remain here,” Yan Nanfei interrupted.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e[*“Wind and Dust” is a euphemistic term referring to prostitution. Yan Nanfei\u0027s present location can be left to the reader\u0027s imagination.]\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eMingyue Xin looked at him, and her eyes also began to show the pain. She suddenly turned around, and said, “Perhaps I never should have asked you to stay. Perhaps you never should have come.” Her voice was calm, yet not without a hint of resentment.\u003c/p\u003e\n\u003cp\u003eMan in an empty room. The empty room thicked with loneliness. Outside the window, raindrops was like the chord of a qin. It was slowly nearing, louder and denser.\u003c/p\u003e\n\u003cp\u003eThe rain was heavy and came very fast. The wild roses on the balcony were ravaged by the torrent of raindrops.\u003c/p\u003e\n\u003cp\u003eAcross the street, at the corner, there stood a man who could not be ravaged. Nothing could devastate him; not his person, not his determination.\u003c/p\u003e\n\u003cp\u003eWhen Yan Nanfei pushed open the windows, he saw this man.\u003c/p\u003e\n\u003cp\u003e“He\u0027s still here,” Yan Nanfei mumbled to himself. The storm was worsening, but this man stood there, motionless. Even if the raindrops were like hundreds and thousands of little daggers raining down on him, he would not retreat. Other than smiling bitterly to himself, Yan Nanfei had no other appropriate response to this sight. “Fu Hongxue, Fu Hongxue, what kind of a human are you?”\u003c/p\u003e\n\u003cp\u003eThere was a slight breeze, and the raindrops hit his face. They were cold, and their chill wormed their way into his heart.\u003c/p\u003e\n\u003cp\u003eHowever, there was a sudden rush of hot blood in his heart. Pounding hard with emotion, it rushed through the icy raindrops, over the high wall and falling in front of Fu Hongxue.\u003c/p\u003e\n\u003cp\u003eFu Hongxue seemed far away. It was as though he wasn\u0027t experiencing this downpour, and didn’t see Yan Nanfei.\u003c/p\u003e\n\u003cp\u003eYan Nanfei was only under the rain for a short while, but his clothes were quickly drenched through. But if Fu Hongxue remained silent, so would he as well.\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s gaze fell on him at last. He said coldly, “It\u0027s raining heavily outside.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “I know.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue continued, “You should not have come out.”\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed, and asked, “If you can be standing under the pouring rain, why cannot I do the same?”\u003c/p\u003e\n\u003cp\u003eFu Hongxue only said three words, “You certainly can.”\u003c/p\u003e\n\u003cp\u003eWith that, he turned his gaze away. It was obvious that he was terminating the conversation.\u003c/p\u003e\n\u003cp\u003eBut Yan Nanfei refused to let the dialogue end. He continued speaking, “Of course I can stand under the rain. Anybody has the right to stand under the rain if he so chooses.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue was silent. He was again as though he was physically somewhere far far away.\u003c/p\u003e\n\u003cp\u003eYan Nanfei yelled, “But I didn’t come out here specially to get drenched.”\u003c/p\u003e\n\u003cp\u003eHis voice was just too loud. It was even louder than the hundreds of thousands of raindrops that were hitting the tiled rooftop.\u003c/p\u003e\n\u003cp\u003eFu Hongxue was undoubtedly not deaf. He finally asked nonchalantly, “Then what are you doing outside?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei said, “I want to tell you something. A secret.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue’s eyes brightened. “You are now prepared to tell me?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei nodded. Fu Hongxue asked, “But you were originally intending to take that secret to your grave?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei nodded in admission, and said, “I had made up my mind not to tell anybody, ever.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue asked, “Then why are you telling me now?” Yan Nanfei stared at him, at the raindrops on his face, at his pale face, and answered, “I\u0027m going to tell you now, because I\u0027ve suddenly realized one thing.”\u003c/p\u003e\n\u003cp\u003eFu Hongxue said, “And what is that?”\u003c/p\u003e\n\u003cp\u003eYan Nanfei laughed. He said, unconcerned, “You are not human. Not human at all.\"\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/tymyd/tymyd-chapter-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/tymyd/tymyd-chapter-4\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/tymyd/tymyd-chapter-3","bookId":1505,"creation":"Sep 10, 2019 4:33:00 AM","modification":"Sep 10, 2019 4:33:00 AM"}
