{"id":531,"no":1,"title":"PREFACE","content":"In the following account of the life and work of that “hero and type of the intellectual energy of the eighteenth century”—the “honest heretic”—Joseph Priestley, I have, to a considerable extent, made the subject of it tell his own story. After Priestley’s death there was found among his papers a short autobiography, dealing with the main events of his life up to the time of his settlement in America. This was subsequently published, with additions and explanatory notes, by his eldest son. Of this biography I have made full use, considering it, of course, as the best authority on the matters to which it refers.\n\u003cbr\u003e \n\u003cbr\u003e For the account of the Warrington Academy, with which institution Priestley was connected for some years, and which connection profoundly affected his career, I am mainly indebted to Mr Henry A. Bright’s paper in the Transactions of the Historic Society of Lancashire and Cheshire, 1858-59.\n\u003cbr\u003e \n\u003cbr\u003e The Yates papers in the possession of the Royal Society have also afforded me much assistance, and have been freely drawn upon.\n\u003cbr\u003e vi\n\u003cbr\u003e \n\u003cbr\u003e I am also indebted to the late Mr Henry Carrington Bolton’s collection for certain letters and for information concerning the Lunar Society of Birmingham.\n\u003cbr\u003e \n\u003cbr\u003e For the graphic account of the Birmingham Riots of 1791, when Priestley’s house was wrecked, and his library and laboratory destroyed, as described by an eye-witness, Miss Martha Russell, I have to express my obligations to her relative, Dr W. J. Russell, who first made me acquainted with her narrative. I am also indebted to Dr Russell for a copy of the print from which has been prepared the illustration showing the destruction of Priestley’s house.\n\u003cbr\u003e \n\u003cbr\u003e I desire also to acknowledge my indebtedness to Dr Aikin for permission to publish certain of Priestley’s letters to his distinguished connection, Mrs Barbauld.\n\u003cbr\u003e \n\u003cbr\u003e I am further under obligations to Lady Priestley, Lady Roscoe and Mr Sydney Lupton for much useful assistance.\n\u003cbr\u003e \n\u003cbr\u003e The portrait of Priestley, which forms the frontispiece, has been reproduced in photogravure from the painting by Artaud, now in Dr Williams’ Theological Library in Gordon Square. I have to thank the Trustees of the Library for their kindness in allowing the copy to be made.\n\u003cbr\u003e \n\u003cdiv style\u003d\"text-align: right;\"\u003e\n T. E. T.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/2066/58801.html","bookId":16,"creation":"Aug 1, 2019 2:23:42 AM","modification":"Aug 1, 2019 2:23:42 AM"}
