{"id":40716,"no":13,"title":"CHAPTER XIII.","content":"He started. The words had almost the solemnity of a prophesy.\n\u003cbr\u003e \n\u003cbr\u003e \"Who will dare?\" he said; then he laughed. \"My little, fearsome, trembling darling!\" he murmured, \"fear nothing or rather, tell me what you fear, and whom.\"\n\u003cbr\u003e \n\u003cbr\u003e She glanced toward the windows.\n\u003cbr\u003e \n\u003cbr\u003e \"I fear them all!\" she said, quietly and simply.\n\u003cbr\u003e \n\u003cbr\u003e \"My father?\"\n\u003cbr\u003e \n\u003cbr\u003e She inclined her head and let her head fall upon his shoulder.\n\u003cbr\u003e \n\u003cbr\u003e \"The countess, all of them. Lord Leycester——\"\n\u003cbr\u003e \n\u003cbr\u003e He put his hand upon her lips softly.\n\u003cbr\u003e \n\u003cbr\u003e \"What was that I heard?\" he said, with tender reproach.\n\u003cbr\u003e \n\u003cbr\u003e She looked up.\n\u003cbr\u003e \n\u003cbr\u003e \"Leycester,\" she whispered.\n\u003cbr\u003e \n\u003cbr\u003e He nodded.\n\u003cbr\u003e \n\u003cbr\u003e \"Would to Heaven the name stood alone,\" he said, almost bitterly. \"The barrier you fancy stands between us would vanish and fade away then. Never, even in sport, call me by my title again, my darling, or I shall hate it!\"\n\u003cbr\u003e \n\u003cbr\u003e She smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"I shall never forget it,\" she said. \"They will not let me. I am not Lady Lenore.\"\n\u003cbr\u003e \n\u003cbr\u003e He started slightly, then looked down at her.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank Heaven, no!\" he said, with a smile.\n\u003cbr\u003e \n\u003cbr\u003e Stella smiled almost sadly.\n\u003cbr\u003e \n\u003cbr\u003e \"She might forget; she is noble too. How beautiful she is!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is she?\" he said, smiling down at her. \"To me there is only one beautiful face in the world, and—it is here,\" and he touched it with his finger—\"here—my very own. But what is Lenore to us to-night, my darling? Why do you speak of her?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because—shall I tell you?\"\n\u003cbr\u003e \n\u003cbr\u003e He nodded, looking down at her.\n\u003cbr\u003e \n\u003cbr\u003e \"Because they said—Lady Lilian said, that——\" she stopped.\n\u003cbr\u003e \n\u003cbr\u003e \"Well?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That they wished you to marry her,\" she whispered.\n\u003cbr\u003e \n\u003cbr\u003e He laughed, his short laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"She might say the same of several young ladies,\" he said. \"My mother is very anxious on the point. Yes, but wishes are[94] not horses, or one could probably be persuaded to mount and ride as their parents wish them—don\u0027t that sound wise and profound? I shall not ride to Lady Lenore; I have ridden to your feet, my darling!\"\n\u003cbr\u003e \n\u003cbr\u003e \"And you will never ride away again,\" she murmured.\n\u003cbr\u003e \n\u003cbr\u003e \"Never,\" he said. \"Here, by your side, I shall remain while life lasts!\"\n\u003cbr\u003e \n\u003cbr\u003e \"While life lasts!\" she repeated, as if the words were music. \"I shall have you near me always. Ah, it sounds too beautiful! too beautiful!\"\n\u003cbr\u003e \n\u003cbr\u003e \"But it will be true,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e The clock chimed the hour. Stella started.\n\u003cbr\u003e \n\u003cbr\u003e \"So late!\" she said, with a little sigh. \"I must go!\" and she glanced at the windows with a little shudder. \"If I could but steal away without seeing them—without being seen! I feel—\" she paused, and the crimson covered her face and neck—\"as if they had but to glance at me to know—to know what has happened,\" and she trembled.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you so afraid?\" he said. \"Really so afraid? Well, why should they know?\"\n\u003cbr\u003e \n\u003cbr\u003e She looked up eagerly.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, no, do not let them know! Why should we tell them; it—it is like letting them share in our happiness; it is our secret, is it not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Let us keep it,\" he said, quietly, musingly. \"Why should they know, indeed! Let us keep the world outside, for a while at least. You and I alone in our love, my darling.\"\n\u003cbr\u003e \n\u003cbr\u003e With his arm round her they went back to the fernery, and here she drew away from him, but not until he had taken another kiss.\n\u003cbr\u003e \n\u003cbr\u003e \"It is our real \u0027good night,\u0027 you know,\" he said; \"the \u0027good-night\u0027 we shall say presently will mean nothing. This is our \u0027good-night.\u0027 Happy dreams, my angel, my star!\"\n\u003cbr\u003e \n\u003cbr\u003e Stella clung to him for a moment with a little reluctant sigh, then she looked up at him with a smile.\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid I am awfully tumbled and tangled,\" she said, putting her hand to her hair.\n\u003cbr\u003e \n\u003cbr\u003e He smoothed the silken threads with his hand, and as he did so drew the rose from her hair.\n\u003cbr\u003e \n\u003cbr\u003e \"This is mine,\" he murmured, and he put it in his coat.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, no!\" she exclaimed. \"And this is how you keep our secret! Do you not think every eye would notice that great rose, and know whence it came?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes, I see,\" he said. \"After all, a woman is the one for a secret—the man is not in the field; but then it will be safe here,\" and he put the rose inside the breast of his coat.\n\u003cbr\u003e \n\u003cbr\u003e Then trying to look as if nothing had happened, trying to look as if the whole world had not become changed for her, Stella sauntered into the drawing-room by his side.\n\u003cbr\u003e \n\u003cbr\u003e And it really seemed as if no one had noticed their entrance. Stella felt inclined to congratulate herself, not taking into consideration the usages of high breeding, which enable so many[95] people to look as if they were unaware of an entrance which they had been expecting for an hour since.\n\u003cbr\u003e \n\u003cbr\u003e \"No one seems to notice,\" she whispered behind her fan, but Lord Leycester smiled—he knew better.\n\u003cbr\u003e \n\u003cbr\u003e She walked up the room, and Lord Leycester stopped before a picture and pointed to it; but he did not speak of the picture—instead, he murmured:\n\u003cbr\u003e \n\u003cbr\u003e \"Will you meet me by the stile by the river to-morrow evening, Stella?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" she murmured.\n\u003cbr\u003e \n\u003cbr\u003e \"I will bring the boat, and we will row down the stream. Will you come at six o\u0027clock?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" she said again.\n\u003cbr\u003e \n\u003cbr\u003e If he asked her to meet him on the banks of the Styx, she would have answered as obediently.\n\u003cbr\u003e \n\u003cbr\u003e Then Mr. Etheridge approached with the countess, and before he could speak Lord Leycester took the bull by the horns, as it were.\n\u003cbr\u003e \n\u003cbr\u003e \"Lilian is delighted with the sketch,\" he said. \"We left her filled with gratitude, did we not Miss Etheridge?\"\n\u003cbr\u003e \n\u003cbr\u003e Stella inclined her head. The large, serene eyes of the countess seemed to penetrate to the bottom of her heart and read her—their—secret already.\n\u003cbr\u003e \n\u003cbr\u003e \"I think we must be going, Stella; the fly has been waiting some time,\" said her uncle in his quiet fashion.\n\u003cbr\u003e \n\u003cbr\u003e \"So soon!\" murmured the countess.\n\u003cbr\u003e \n\u003cbr\u003e But Mr. Etheridge glanced at the clock with a smile, and Stella held out her hand.\n\u003cbr\u003e \n\u003cbr\u003e As she did so, she felt rather than saw the graceful form of Lady Lenore coming toward them.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you going, Miss Etheridge?\" she said, her clear voice full of regret. \"We have seen so little of you; and I meant to ask you so much about Italy. I am so sorry.\"\n\u003cbr\u003e \n\u003cbr\u003e And as she spoke, she looked full into poor Stella\u0027s eyes.\n\u003cbr\u003e \n\u003cbr\u003e For a moment Stella was silent and downcast, then she raised her eyes and held out her hand.\n\u003cbr\u003e \n\u003cbr\u003e \"It is late,\" she murmured. \"Yes, we must go.\"\n\u003cbr\u003e \n\u003cbr\u003e As she looked up, she met the gaze of the violet eyes, and almost started, for there seemed to be shining in them a significant smile of mocking scorn and contemptuous amusement; they seemed to say, quite plainly:\n\u003cbr\u003e \n\u003cbr\u003e \"You think that no one knows your secret. You think that you have triumphed, that you have won him. Poor simple child, poor fool. Wait and see!\"\n\u003cbr\u003e \n\u003cbr\u003e If ever eyes spoke, this is what Lady Lenore\u0027s seemed to say in that momentary glance, and as Stella turned aside, her face paled slightly.\n\u003cbr\u003e \n\u003cbr\u003e \"You must come and see us again, Miss Etheridge,\" said the countess, graciously.\n\u003cbr\u003e \n\u003cbr\u003e \"Lilian has extorted a solemn promise to that effect,\" said Leycester, as he shook hands with Mr. Etheridge.\n\u003cbr\u003e \n\u003cbr\u003e Then he held out his hand to Stella, but in spite of prudence he could not part from her till the last moment.\n\u003cbr\u003e \n\u003cbr\u003e [96]\n\u003cbr\u003e \n\u003cbr\u003e \"Let me take you to your carriage,\" he said, \"and see that you are well wrapped up.\"\n\u003cbr\u003e \n\u003cbr\u003e The countess\u0027s eyes grew cold, and she looked beyond them rather than at them, and Stella murmured something about trouble, but he laughed softly, and drawing her hand on his arm led her away.\n\u003cbr\u003e \n\u003cbr\u003e All the room saw it, and a sort of thrill ran through them; it was an attention he paid only to such old and honored friends as the old countess and Lenore.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, why did you come?\" whispered Stella, as they reached the hall. \"The countess looked so angry.\"\n\u003cbr\u003e \n\u003cbr\u003e He smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"I could not help it. There, not a word more. Now let me wrap this round you;\" and, of course, as he wrapped it round her, he managed to convey a caress in the touch of his hand.\n\u003cbr\u003e \n\u003cbr\u003e \"Remember, my darling,\" he murmured, almost dangerously loud, as he put her into the fly. \"To-morrow at six.\"\n\u003cbr\u003e \n\u003cbr\u003e Then he stood bareheaded, and the last Stella saw was the light of tender, passionate love burning in his dark eyes.\n\u003cbr\u003e \n\u003cbr\u003e She sank back in the furthermost corner of the fly in silent, rapt reflection. Was it all a dream? Was it only a trick of fancy, or did she feel his passionate kisses on her lips and face entangled in her hair. Had she really heard Lord Leycester Wyndward declare that he loved her?\n\u003cbr\u003e \n\u003cbr\u003e \"Are you asleep, Stella?\" said her uncle, and she started.\n\u003cbr\u003e \n\u003cbr\u003e \"No, not asleep, dear,\" she said. \"But—but tired and so happy!\" The word slipped out before she was aware of it.\n\u003cbr\u003e \n\u003cbr\u003e But the unsuspecting recluse did not notice the thrill of joy in the tone of her reply.\n\u003cbr\u003e \n\u003cbr\u003e \"Ah, yes, just so, I daresay. It was something new and strange to you. It is a beautiful place. By the way, what do you think of Lady Lenore?\"\n\u003cbr\u003e \n\u003cbr\u003e Stella started.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, she is very beautiful, and as wonderful as you said, dear,\" she murmured.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, isn\u0027t she. She will make a grand countess, will she not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"What!\" said Stella.\n\u003cbr\u003e \n\u003cbr\u003e He smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"Wonderful creatures women are, to be sure. For the life of me I could not tell in exact words how the countess managed to give me the impression, but she did give it me, and unmistakably.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What impression!\" said Stella.\n\u003cbr\u003e \n\u003cbr\u003e He laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"That matters were settled between Lord Leycester and Lady Lenore, and that they were to be married. They will make a fine match, will they not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes—no—I mean yes,\" said Stella, and a happy smile came into her eyes as she leant back.\n\u003cbr\u003e \n\u003cbr\u003e No, it was not Lady Lenore he was going to marry—not the great beauty with the golden hair and violet eyes, but a little mere nobody, called Stella Etheridge. She leant back and hugged[97] her secret to her bosom and caressed it. The fly trundled along after the manner of flys, and stopped at last at the white gate in the lane.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Etheridge got out and held his hand for Stella, and she leapt out. As she did so, she uttered a slight cry, for a tall figure was standing beside the gate in the light by the lamps.\n\u003cbr\u003e \n\u003cbr\u003e \"Bless my soul, what\u0027s the matter?\" exclaimed Mr. Etheridge, turning round. \"Oh, it\u0027s you, Mr. Adelstone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am very sorry to have startled you, Miss Stella,\" said Jasper Adelstone, and he came forward with his hat raised by his left hand; his right was in a sling. Stella\u0027s gentle eyes saw it, and her face paled.\n\u003cbr\u003e \n\u003cbr\u003e \"I was taking a stroll through the meadows and looked in. Mrs. Penfold said that you had gone to the Hall. Coming back from the river I heard the fly, and waited to say \u0027good-night.\u0027\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is very kind,\" murmured Stella, her eyes still fixed on the useless arm with a kind of fascination.\n\u003cbr\u003e \n\u003cbr\u003e \"Come in and have a cigar,\" said Mr. Etheridge. \"Ah! what is the matter with your arm, man?\"\n\u003cbr\u003e \n\u003cbr\u003e Jasper looked at him, then turned his small keen eyes on Stella\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e \"A mere trifle,\" he said. \"I—met with an accident the other day and sprained it. It is a mere nothing. No, I won\u0027t come in, thanks. By-the-way, I\u0027m nearly forgetting a most important matter,\" and he put his left hand in his pocket and drew something out. \"I met the post-office boy in the lane, and he gave me this to save his legs,\" and he held out a telegram envelope.\n\u003cbr\u003e \n\u003cbr\u003e \"A telegram for me!\" exclaimed Mr. Etheridge. \"Wonders will never cease. Come inside, Mr. Adelstone.\"\n\u003cbr\u003e \n\u003cbr\u003e But Jasper shook his head.\n\u003cbr\u003e \n\u003cbr\u003e \"I will wish you good-night, now,\" he said. \"Will you excuse my left hand, Miss Stella?\" he added, as he extended it.\n\u003cbr\u003e \n\u003cbr\u003e Stella took it; it was burning, hot, and dry.\n\u003cbr\u003e \n\u003cbr\u003e \"I am so sorry,\" she said, in a low voice. \"I cannot tell how sorry I am!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do not think of it,\" he said. \"Pray forget it, as—I do,\" he added, with hidden irony. \"It is a mere nothing.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella looked down.\n\u003cbr\u003e \n\u003cbr\u003e \"And I am sure that—Lord Leycester is sorry.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No doubt,\" he said. \"I am quite sure Lord Leycester did not want to break my arm. But, indeed, I was rightly punished for my carelessness, though, I assure you, that I should have pulled up in time.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes; I am sure of that. I am sure I was in no danger,\" said Stella, earnestly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, in a low voice. \"There was really no necessity for Lord Leycester to throw me off my horse, or even to insult me. But Lord Leycester is a privileged person, is he not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I—I don\u0027t know what you mean!\" said Stella, faintly.\n\u003cbr\u003e \n\u003cbr\u003e \"I mean that Lord Leycester may do things with impunity which others cannot even think of,\" and his sharp eyes grew to her face, which Stella felt was growing crimson.\n\u003cbr\u003e \n\u003cbr\u003e \"I—I am sure he will be very sorry,\" she said, \"when he[98] knows how much you are hurt, and he will apologize most sincerely.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have no doubt,\" he said, lightly, \"and, after all, it is something to have one\u0027s arm sprained by Lord Leycester Wyndward, is it not? It is better than a broken heart.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A broken heart! What do you mean?\" said Stella, her face flushed, her eyes challenging his with a touch of indignation.\n\u003cbr\u003e \n\u003cbr\u003e He smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"I meant that Lord Leycester is as skilled in breaking hearts as limbs. But I forgot I must not say anything against the heir to Wyndward in your hearing. Pray forgive me. Good-night.\"\n\u003cbr\u003e \n\u003cbr\u003e And, with a bow and a keen look from his small eyes, he moved away.\n\u003cbr\u003e \n\u003cbr\u003e Stella stood looking after him for a moment, and a shiver ran through her as if from a cold wind.\n\u003cbr\u003e \n\u003cbr\u003e Breaking hearts! What did he mean?\n\u003cbr\u003e \n\u003cbr\u003e An exclamation from her uncle caused her to turn suddenly.\n\u003cbr\u003e \n\u003cbr\u003e He was standing in the light of the window, with the open telegram in his hand, his face pale and anxious.\n\u003cbr\u003e \n\u003cbr\u003e \"Great Heaven!\" he muttered, \"what am I to do?\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1672/49272.html","bookId":1188,"creation":"Aug 5, 2019 1:45:49 PM","modification":"Aug 5, 2019 1:45:49 PM"}
