{"id":40732,"no":29,"title":"CHAPTER XXIX.","content":"\"Five minutes!\" said Stella, warningly; and she turned her face from him, and kept her eyes fixed on the clock.\n\u003cbr\u003e \n\u003cbr\u003e \"It will suffice,\" said Jasper. \"I have to ask you to bear with[198] me while I tell you a short history. I will mention no names—you yourself will be able to supply them. All I have to ask of you further is that you will hear me to the end. The history is of father and son.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella did not move; she thought that he referred to the earl and Leycester. She had determined to listen calmly until the five minutes were expired, and then to go—to go without a word.\n\u003cbr\u003e \n\u003cbr\u003e \"The father was an eminent painter\"—Stella started slightly, but kept her eyes fixed on the clock—\"a man who was highly gifted, of a rare and noble mind, and possessed of undeniable genius. Even as a young man his gifts were meeting with acknowledgment. He married a woman above him in station, beautiful, and fashionable, but altogether unworthy of him. As might have been expected, the marriage turned out ill. The wife, having nothing in common with her high-souled husband, plunged into the world, and was swallowed up in its vortex. I do not wish to speak of her further; she brought him shame.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella paled to the lips.\n\u003cbr\u003e \n\u003cbr\u003e \"Shame so deep that he cast aside his ambition and left the world. Casting away his old life, and separating himself entirely from it—separating himself from the child which the woman who had betrayed him had born to him—he settled in a remote country village, forgotten and effaced. The son was brought up by guardians appointed by the father, who could never bring himself to see him. This boy went to school, to college, was launched, so to speak, on the world without a father\u0027s care. The evil results which usually follow such a starting followed here. The boy, left to himself, or at best to the hired guardianship of a tutor, plunged into life. He was a handsome, high-spirited boy, and found, as is usual, ready companionship. Folly—I will not say vice—worked its usual charm; the boy, alone and uncared for, was led astray. In an unthinking moment he committed a crime——\"\n\u003cbr\u003e \n\u003cbr\u003e Stella, white and breathless, turned upon him.\n\u003cbr\u003e \n\u003cbr\u003e \"It is false!\" she breathed.\n\u003cbr\u003e \n\u003cbr\u003e He looked at her steadily.\n\u003cbr\u003e \n\u003cbr\u003e \"Committed a crime. It was done unthinkingly, on the spur of the moment; but it was done irrevocably. The punishment for the crime was a heavy one—he was doomed to spend the best part of his life as a convict——\"\n\u003cbr\u003e \n\u003cbr\u003e Stella moaned and put up her hand to her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"It is not true.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Doomed to a felon\u0027s expiation. Think of it. A handsome, high-born, high-spirited, perhaps gifted lad, doomed to a felon\u0027s, a convict\u0027s fate! Can you not picture him, working in chains, clad in yellow, branded with shame——\"\n\u003cbr\u003e \n\u003cbr\u003e Stella leaned against the door, and hid her face.\n\u003cbr\u003e \n\u003cbr\u003e \"It is false—false!\" she moaned; but she felt that it was true.\n\u003cbr\u003e \n\u003cbr\u003e \"From that doom—one—one whom you have lashed with your scorn—stepped forward to save him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You?\"\n\u003cbr\u003e \n\u003cbr\u003e [199]\n\u003cbr\u003e \n\u003cbr\u003e \"I,\" he said—\"even I!\"\n\u003cbr\u003e \n\u003cbr\u003e She turned to him slightly.\n\u003cbr\u003e \n\u003cbr\u003e \"You did this?\"\n\u003cbr\u003e \n\u003cbr\u003e He inclined his head.\n\u003cbr\u003e \n\u003cbr\u003e \"I did it,\" he repeated. \"But for me he would be, at this moment, working out his sentence, the just sentence of the outraged law.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella was silent, regarding him with eyes distended with horror.\n\u003cbr\u003e \n\u003cbr\u003e \"And he—he knew it?\" she murmured, brokenly.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" he said. \"He did not know it; he does not know it even now.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella breathed a sigh, then shuddered as she remembered how the boy Frank had insulted and scorned this silent, inflexible man, who had saved him from a felon\u0027s fate.\n\u003cbr\u003e \n\u003cbr\u003e \"He did not know it!\" she said. \"Forgive him!\"\n\u003cbr\u003e \n\u003cbr\u003e He smiled a strange smile.\n\u003cbr\u003e \n\u003cbr\u003e \"The lad is nothing to me,\" he said. \"I have nothing to forgive. One does not feel angered at the attack of a gnat; one brushes the insect off, or lets it remain as the case may be. This lad is nothing to me. So far as he is concerned I might have allowed him to take his punishment. I saved him, not for his sake, but for another\u0027s.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella leaned against the door. She was beginning to feel the meshes of the net that was drawing closer and closer around her.\n\u003cbr\u003e \n\u003cbr\u003e \"For another,\" he continued, \"I saved him for your sake.\"\n\u003cbr\u003e \n\u003cbr\u003e She moistened her parched lips and raised her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"I—I am very grateful,\" she murmured.\n\u003cbr\u003e \n\u003cbr\u003e His face flushed slightly.\n\u003cbr\u003e \n\u003cbr\u003e \"I did not seek your gratitude; I did not desire that you should even know that I had done this thing. Neither he nor you would ever have known it, but—but for this that has happened. It would have gone down with me into my grave—a secret. It would have done so, although you had refused me your love, although you should have given your heart to another. If\"—and he paused—\"if that other had been a man worthy of you.\" Stella\u0027s face flushed, and her eyes flashed, but she remembered all that he had done, and averted her gaze from him. \"If that other had been one likely to have insured your happiness, I would have gone my way and remained silent; but it is not so. This man, this Lord Leycester, is one who will effect your ruin, one from whom I must—I will—save you. It is he who rendered this disclosure necessary.\"\n\u003cbr\u003e \n\u003cbr\u003e He was silent, and Stella stood, her eyes bent on the ground. Even yet she did not realize the power he held over her—over those she loved.\n\u003cbr\u003e \n\u003cbr\u003e \"I am very grateful,\" she said at last. \"I am fully sensible of all that you have done for us, and I am sorry that—that I should have spoken as I did, though\"—and she raised her eyes with a sudden frank wistfulness—\"I was much provoked.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What was I to do?\" he asked. She shook her head. \"Could I stand idle and see you drift to destruction?\"\n\u003cbr\u003e \n\u003cbr\u003e [200]\n\u003cbr\u003e \n\u003cbr\u003e \"I shall not go to destruction,\" she said, with a troubled look. \"You do not know Lord Leycester—you do not know—but we will not speak of that,\" she broke off, suddenly. \"I will go now, please. I am very grateful, and—and—I hope you will forgive all that has passed!\"\n\u003cbr\u003e \n\u003cbr\u003e He looked at her.\n\u003cbr\u003e \n\u003cbr\u003e \"I will forgive all—all,\" he emphasized, \"if you will turn back; if you will go back to your home, and promise that this thing which he has asked you to do shall not come to pass.\"\n\u003cbr\u003e \n\u003cbr\u003e She turned upon him.\n\u003cbr\u003e \n\u003cbr\u003e \"You have no right——\" then she stopped, smitten with a sudden fear by the expression of his face. \"I cannot do that,\" she said, in a constrained voice.\n\u003cbr\u003e \n\u003cbr\u003e He closed his hands tightly together.\n\u003cbr\u003e \n\u003cbr\u003e \"Do not force me,\" he said. \"You will not force me to compel you?\"\n\u003cbr\u003e \n\u003cbr\u003e She looked at him tremblingly.\n\u003cbr\u003e \n\u003cbr\u003e \"Force!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, force! You speak of gratitude; but I do not rely on that. If you were really grateful to me you would go back; but you are not. I cannot trust to gratitude.\" Then he came closer to her, and his voice dropped.\n\u003cbr\u003e \n\u003cbr\u003e \"Stella, I have sworn that this shall not be—that he shall not have you! I cannot break my oath. Do you not understand?\"\n\u003cbr\u003e \n\u003cbr\u003e She shook her head.\n\u003cbr\u003e \n\u003cbr\u003e \"No! I know that you cannot prevent me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I can,\" he said. \"You do not understand. I saved the boy, but I can destroy him.\"\n\u003cbr\u003e \n\u003cbr\u003e She shrank back.\n\u003cbr\u003e \n\u003cbr\u003e \"With a word!\" he said, almost fiercely, his lips trembling. \"One word, and he is destroyed. You doubt? See!\" And he drew a paper from his pocket-book. \"The crime he committed was forgery—forgery! Here is the proof!\"\n\u003cbr\u003e \n\u003cbr\u003e She shrank back still further, and held up her hands as if to shut the paper from her sight.\n\u003cbr\u003e \n\u003cbr\u003e \"Do not deceive yourself,\" he said, in his intense voice; \"his safety lies in my hands—I hold the sword. It is for you to say whether I shall let it fall.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Spare him!\" she breathed, panting—\"spare me!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will spare him—I will save both him and you. Stella, say but the word; say to me here, now, \u0027Jasper, I will marry you,\u0027 and he is safe!\"\n\u003cbr\u003e \n\u003cbr\u003e With a low cry she sank against the door, and looked at him.\n\u003cbr\u003e \n\u003cbr\u003e \"I will not!\" she panted, like some wild animal driven to bay.\n\u003cbr\u003e \n\u003cbr\u003e \"I will not.\"\n\u003cbr\u003e \n\u003cbr\u003e His face darkened.\n\u003cbr\u003e \n\u003cbr\u003e \"You hate me so much?\"\n\u003cbr\u003e \n\u003cbr\u003e She was silent, regarding him with the same fearful, hunted look.\n\u003cbr\u003e \n\u003cbr\u003e \"You hate me!\" he said, between his teeth. \"But even that[201] shall not prevent me from having my way. You will learn to hate me less—in time to love me.\"\n\u003cbr\u003e \n\u003cbr\u003e She shuddered, and he saw the shudder, and it seemed to lash him into madness.\n\u003cbr\u003e \n\u003cbr\u003e \"I say you shall! Such love as mine cannot exist in vain, cannot be repelled; it must, it must win love in return. I will chance it. When you are my wife—do not shrink, mine you must and shall be!—you will grow to a knowledge of the strength of my devotion, and admit that I was justified——\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, never!\" she panted.\n\u003cbr\u003e \n\u003cbr\u003e He drew back, and let his hand fall on the back of the chair.\n\u003cbr\u003e \n\u003cbr\u003e \"Is that answer final?\" he said hoarsely.\n\u003cbr\u003e \n\u003cbr\u003e \"Never!\" she reiterated.\n\u003cbr\u003e \n\u003cbr\u003e \"Remember!\" he said. \"In that word you pronounce the doom of this lad; by that word you let fall the sword, you darken the few remaining years of an old man\u0027s life with shame!\"\n\u003cbr\u003e \n\u003cbr\u003e White and breathless she sank on to the floor and so knelt—absolutely knelt—to him, with outstretched hands and imploring eyes.\n\u003cbr\u003e \n\u003cbr\u003e He looked at her, his heart beating, his lips quivering, and his hand moved toward the bell.\n\u003cbr\u003e \n\u003cbr\u003e \"If I ring this it is to send for a constable. If I ring this, it is to give this lad into custody on a charge of forgery. It is impossible for him to escape, the evidence is complete and damning.\"\n\u003cbr\u003e \n\u003cbr\u003e His hand touched the bell, had almost pressed it, when Stella uttered a word.\n\u003cbr\u003e \n\u003cbr\u003e \"Stay!\" she said, and so hoarse, so unnatural was the sound of her voice, that it went to his heart like a stab.\n\u003cbr\u003e \n\u003cbr\u003e Slowly, with the movement of a person numbed and almost unconscious, she rose and came toward him.\n\u003cbr\u003e \n\u003cbr\u003e Her face was white, white to the lip, her eyes fixed not on him, but beyond him; she had every appearance of one moving in a dream.\n\u003cbr\u003e \n\u003cbr\u003e \"Stay?\" she said. \"Do not ring.\"\n\u003cbr\u003e \n\u003cbr\u003e His hand fell from the bell, and he stood regarding her with eager, watchful eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"You—you consent?\" he asked hoarsely.\n\u003cbr\u003e \n\u003cbr\u003e Without moving her eyes, she seemed to look at him.\n\u003cbr\u003e \n\u003cbr\u003e \"Tell me,\" she said, in slow, mechanical tones, \"tell me all—all that you wish me to do, all that I must do to save them.\"\n\u003cbr\u003e \n\u003cbr\u003e Her agony touched him, but he remained inflexible, immovable.\n\u003cbr\u003e \n\u003cbr\u003e \"It is soon told,\" he said. \"Say to me, \u0027Jasper, I will be your wife!\u0027 and I am content. In return, I promise that on the day, the hour in which you become my wife, I will give you this paper; upon it the boy\u0027s fate depends. Once this is destroyed he is safe—absolutely.\"\n\u003cbr\u003e \n\u003cbr\u003e She held out her hand mechanically.\n\u003cbr\u003e \n\u003cbr\u003e \"Let me look at it.\"\n\u003cbr\u003e \n\u003cbr\u003e He glanced at her, scarcely suspiciously but hesitatingly, for a moment, then placed the paper in her hands.\n\u003cbr\u003e \n\u003cbr\u003e [202]\n\u003cbr\u003e \n\u003cbr\u003e She took it, shuddering faintly.\n\u003cbr\u003e \n\u003cbr\u003e \"Show me!\"\n\u003cbr\u003e \n\u003cbr\u003e He put his finger on the forged name. Stella\u0027s eyes dwelt upon it with horror for a moment, then she held out the paper to him.\n\u003cbr\u003e \n\u003cbr\u003e \"He—he wrote that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He wrote it,\" he answered. \"It is sufficient to send him——\"\n\u003cbr\u003e \n\u003cbr\u003e She put up her hand to stop him.\n\u003cbr\u003e \n\u003cbr\u003e \"And—and to earn the paper I must—marry you?\"\n\u003cbr\u003e \n\u003cbr\u003e He was silent, but he made a gesture of assent.\n\u003cbr\u003e \n\u003cbr\u003e She turned her head away for a moment, then she looked him full in the eyes, a strange, awful look.\n\u003cbr\u003e \n\u003cbr\u003e \"I will do it,\" she said, every word falling like ice from her white lips.\n\u003cbr\u003e \n\u003cbr\u003e A crimson flush stained his face.\n\u003cbr\u003e \n\u003cbr\u003e \"Stella! My Stella!\" he cried.\n\u003cbr\u003e \n\u003cbr\u003e She put up her hand; she did not shrink back, but simply put up her hand, and it was he who shrank.\n\u003cbr\u003e \n\u003cbr\u003e \"Do not touch me,\" she said, calmly, \"or—or I will not answer for myself.\"\n\u003cbr\u003e \n\u003cbr\u003e He wiped the cold beads from his brow.\n\u003cbr\u003e \n\u003cbr\u003e \"I—I am content!\" he said. \"I have your promise. I know you too well to dream that you would break it. I am content. In time—well, I will say no more.\"\n\u003cbr\u003e \n\u003cbr\u003e Then he went to the table and pressed the bell.\n\u003cbr\u003e \n\u003cbr\u003e She looked up at him with a dull, numbed expression of inquiry which he understood and answered.\n\u003cbr\u003e \n\u003cbr\u003e \"You will see. I have thought of everything. I foresaw that you would yield and have planned everything.\"\n\u003cbr\u003e \n\u003cbr\u003e The door opened as he spoke, and Scrivell came in followed by Frank, who hurled Scrivell out of the way and sprang before Jasper, inarticulate with rage.\n\u003cbr\u003e \n\u003cbr\u003e But before he could find breath for words, his eyes fell upon Stella\u0027s face, and a change came over him.\n\u003cbr\u003e \n\u003cbr\u003e \"What does this mean?\" he stammered. \"What do you mean, Mr. Adelstone, by this outrage? Do you know that I have been kept a prisoner——\"\n\u003cbr\u003e \n\u003cbr\u003e Jasper interrupted him calmly, quietly, with an exasperating smile.\n\u003cbr\u003e \n\u003cbr\u003e \"You are a prisoner no longer, my dear Frank!\"\n\u003cbr\u003e \n\u003cbr\u003e \"How dare you!\" exclaimed the enraged boy, and he raised his cane.\n\u003cbr\u003e \n\u003cbr\u003e It would have fallen across Jasper\u0027s face, for he made no attempt to ward it, but Stella sprang between them, and it fell on her shoulder.\n\u003cbr\u003e \n\u003cbr\u003e \"Frank,\" she moaned rather than cried, \"you—you must not.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Stella,\" he exclaimed, \"stand away from him. I think I shall kill him.\"\n\u003cbr\u003e \n\u003cbr\u003e She laid her hand upon his arm and looked up into his face with, ah! what an anguish of sorrowful pity and love.\n\u003cbr\u003e \n\u003cbr\u003e \"Frank,\" she breathed, pressing her hand to her bosom,[203] \"listen to me. He—Mr. Adelstone was—was right. He has done all for—for the best. You—you will beg his pardon.\"\n\u003cbr\u003e \n\u003cbr\u003e He stared at her as if he thought that she had taken leave of her senses.\n\u003cbr\u003e \n\u003cbr\u003e \"What! What do you say!\" he cried, below his breath. \"Are you mad, Stella?\"\n\u003cbr\u003e \n\u003cbr\u003e She put her hand to her brow with a strange, weird smile.\n\u003cbr\u003e \n\u003cbr\u003e \"I wish—I almost think I am. No, Frank, not another word. You must not ask why. I cannot tell you. Only this, that—that Mr. Adelstone has explained, and that—that\"—her voice faltered—\"we must go back.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go back? Not go to Leycester?\" he demanded, incredulous and astonished. \"Do you know what you are saying?\"\n\u003cbr\u003e \n\u003cbr\u003e She smiled, a smile more bitter than tears.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I know. Bear with me, Frank.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bear with you? What does she mean? Do you mean to say that you have allowed yourself to be persuaded by this—this hound——?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Frank! Frank!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do not stop him,\" came the quiet, overstrained voice of \u0027the hound.\u0027\n\u003cbr\u003e \n\u003cbr\u003e \"This hound, I said,\" repeated the boy, bitterly. \"Has he persuaded you to break faith with Leycester? It is impossible. You would not, could not, be so—so bad.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella looked at him, and the tears sprang to her eyes.\n\u003cbr\u003e \n\u003cbr\u003e \"Have pity, and—and—send him away,\" she said, without turning to Jasper.\n\u003cbr\u003e \n\u003cbr\u003e He went up to Frank, who drew back as he approached, as if he were something loathsome.\n\u003cbr\u003e \n\u003cbr\u003e \"You are making your cousin unhappy by this conduct,\" he said. \"It is as she says. She has changed her mind.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is a lie,\" retorted Frank, fiercely. \"You have frightened her and tortured her into this. But you shall not succeed. It is easy for you to frighten a woman, as easily as it is to entrap her; but you will sing a different tune before a man. Stella, come with me. You must, you shall come. We will go to Lord Leycester.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is unnecessary,\" cried Jasper, quietly. \"His lordship will be here in a few minutes.\"\n\u003cbr\u003e \n\u003cbr\u003e Stella started.\n\u003cbr\u003e \n\u003cbr\u003e \"No, no,\" she said, and moved to the door. Frank, staring at Jasper, caught and held her.\n\u003cbr\u003e \n\u003cbr\u003e \"Is that a lie, too?\" he demanded. \"If not—if it be true—then we will wait. We shall see how much longer you will be able to crow, Mr. Adelstone!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Let us go, Frank,\" implored Stella. \"You will let me go now?\" And she turned to Jasper.\n\u003cbr\u003e \n\u003cbr\u003e Frank was almost driven to madness by her tone.\n\u003cbr\u003e \n\u003cbr\u003e \"What has he said and done to change you like this?\" he said. \"You speak to him as if you were his slave!\"\n\u003cbr\u003e \n\u003cbr\u003e She looked at him sadly.\n\u003cbr\u003e \n\u003cbr\u003e Jasper shook his head.\n\u003cbr\u003e \n\u003cbr\u003e \"Wait,\" he said—\"it will be better that you wait. Trust me.[204] I will spare you as much as possible; but it will be better that he should learn all that he has to learn from your lips, here and now.\"\n\u003cbr\u003e \n\u003cbr\u003e She bowed her head, and still holding Frank\u0027s arm sank into a chair.\n\u003cbr\u003e \n\u003cbr\u003e The boy was about to burst out again, but she stopped him.\n\u003cbr\u003e \n\u003cbr\u003e \"Hush!\" she said, \"do not speak, every word cuts me to the heart. Not a word, dear—not another word. Let us wait.\"\n\u003cbr\u003e \n\u003cbr\u003e They had not long to wait.\n\u003cbr\u003e \n\u003cbr\u003e There was a sound of footsteps, hurried and noisy, on the stairs—an impatient, resolute voice uttering a question—then the door was thrown open, and Lord Leycester burst in!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1672/49288.html","bookId":1188,"creation":"Aug 5, 2019 1:45:49 PM","modification":"Aug 5, 2019 1:45:49 PM"}
