{"id":40740,"no":37,"title":"CHAPTER XXXVII.","content":"Lord Charles\u0027 little plot had succeeded beyond his expectation. He had restored the prodigal and shared the fatted calf, as he deserved to do. Although it was known all over the house, in five minutes, that Lord Leycester, the heir, had returned, there was no fuss, only a pleasant little simmer of welcome and satisfaction.\n\u003cbr\u003e \n\u003cbr\u003e The countess had gone to the earl, who was dressing for dinner, to tell him the news.\n\u003cbr\u003e \n\u003cbr\u003e \"Leycester has returned,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e The earl started and sent his valet away.\n\u003cbr\u003e \n\u003cbr\u003e \"What!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, he has come back to us,\" she said, sinking into a seat.\n\u003cbr\u003e \n\u003cbr\u003e \"Where from?\" he demanded.\n\u003cbr\u003e \n\u003cbr\u003e She shook her head.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know. I don\u0027t want to know. He must be asked no questions. Lord Charles brought him. I always loved Charles Guildford.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So you ought, out of pity,\" said the earl, grimly, \"seeing that your son has almost led him to ruin.\"\n\u003cbr\u003e \n\u003cbr\u003e Then the countess fired up.\n\u003cbr\u003e \n\u003cbr\u003e \"There must be no talk of that kind,\" she said. \"You do not want to see him go again? No word must be said unless you want to drive him away. He has been ill.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am not surprised,\" said the earl, still a little grimly, \"a man can\u0027t lead the life he has been leading and keep his health, moral or physical.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But that is all past,\" said the countess confidently. \"I feel that is all past. If you do not worry him he will stay, and all will go well.\"\n\u003cbr\u003e \n\u003cbr\u003e [246]\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I won\u0027t worry his Imperial Highness,\" said the earl, with a smile, \"that is what you want me to say, I suppose. And the girl—what about her?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" said the countess with all a mother\u0027s supreme indifference for the fate of any other than her son. \"She is past, too. I am sure of that. How thankful I am that Lenore is here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ah,\" said the earl who could be sarcastic when he liked. \"So she is to be sacrificed as a thank-offering for the prodigal\u0027s return, is she? Poor Lenore, I am almost sorry for her. She is too good for him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"For shame,\" exclaimed the countess, flushing; \"no one is too good for him. And—and she will not deem it a sacrifice.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I suppose not,\" he said, fumbling at his necktie. \"It is well to be born with a handsome face, and a dare-devil temper, because all women love you then, and the best and fairest think it worth while to offer themselves up. Poor Lenore! Well, I\u0027ll be civil to his Highness, notwithstanding that he has spent a small fortune in two months, and declined to honor my house with his presence. There,\" he added, touching her cheek and smiling, \"don\u0027t be alarmed. We will kill the fatted calf and make merry—till he goes off again.\"\n\u003cbr\u003e \n\u003cbr\u003e The countess was satisfied with this, and went down to find Leycester and Lord Charles standing near the fire. Though they had only rented the place for a month, curtains were up on all the doors, and there was a fire in all the sitting-rooms, and in the earl\u0027s apartments.\n\u003cbr\u003e \n\u003cbr\u003e The countess held out her hand to Lord Charles.\n\u003cbr\u003e \n\u003cbr\u003e \"I am very glad to see you, Charlie,\" she said, with her rare smile. \"You can give me a kiss if you like,\" and Charlie, as he blushed and kissed the white forehead, knew that she was thanking him for bringing her son back to her.\n\u003cbr\u003e \n\u003cbr\u003e \"But we\u0027ve got to go back at once,\" he said, with a laugh.\n\u003cbr\u003e \n\u003cbr\u003e \"We can\u0027t sit down in this rig out,\" and he looked ruefully at his riding suit.\n\u003cbr\u003e \n\u003cbr\u003e The countess shook her head.\n\u003cbr\u003e \n\u003cbr\u003e \"You shall sit down in a smock frock if you like,\" she said. \"But there is no occasion. I have brought Leycester\u0027s things down, and—it\u0027s not the first time you have borrowed suits from each other, I expect.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Not by a many!\" laughed Lord Charles. \"I\u0027ll go and dress. Where is Ley?\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester had gone out of the room quietly, and was then sitting beside Lilian, his hand in hers, her head upon his breast.\n\u003cbr\u003e \n\u003cbr\u003e \"You have come back to us, Ley?\" she said, caressing his hand. \"It has been so long and weary waiting! You will not go again?\"\n\u003cbr\u003e \n\u003cbr\u003e He paused a moment, then he looked at her.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" he said, in a low voice. \"No, Lil, I shall not go again.\"\n\u003cbr\u003e \n\u003cbr\u003e She kissed him, and as she did so, whispered, anxiously:\n\u003cbr\u003e \n\u003cbr\u003e \"And—and—Stella, Ley?\"\n\u003cbr\u003e \n\u003cbr\u003e His face contracted with a frown of pain and trouble.\n\u003cbr\u003e \n\u003cbr\u003e [247]\n\u003cbr\u003e \n\u003cbr\u003e \"That is all past,\" he said, using his mother\u0027s words; and she kissed him again.\n\u003cbr\u003e \n\u003cbr\u003e \"How thin and worn you look. Oh, Ley!\" she murmured, with sorrowful, loving reproach.\n\u003cbr\u003e \n\u003cbr\u003e He smiled with a touch of bitterness.\n\u003cbr\u003e \n\u003cbr\u003e \"Do I? Well, I will wax fat and grow mirthful for the future,\" he said, rising. \"There is the dinner bell.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Come to me afterward, Ley,\" she pleaded, as she let him go, and he promised.\n\u003cbr\u003e \n\u003cbr\u003e There was to be no fuss, but it was noteworthy that several of Leycester\u0027s favorite dishes figured in the menu, and that there was a special Indian curry for Lord Charles.\n\u003cbr\u003e \n\u003cbr\u003e Leycester did not descend to the dining-room till ten minutes after the time, and the greeting between father and son was characteristic of the two men. The earl put out his thin, white hand, and smiled gravely.\n\u003cbr\u003e \n\u003cbr\u003e \"How do you do, Leycester,\" he said. \"Will you have the Lafitte or the Chateau Margaux? The weather is fine for the time of year.\"\n\u003cbr\u003e \n\u003cbr\u003e And Leycester said, quietly:\n\u003cbr\u003e \n\u003cbr\u003e \"I hope you are well, sir. The Margaux, I suppose, Charles? Yes, we have had some good weather.\"\n\u003cbr\u003e \n\u003cbr\u003e That was all.\n\u003cbr\u003e \n\u003cbr\u003e He went to his place and sat down quietly and composedly, as if he had dined with them for months without a break, and as if the papers had not been chronicling his awful doings.\n\u003cbr\u003e \n\u003cbr\u003e The earl could not suppress a pang of pity as he glanced across at the handsome face and saw how worn and haggard it looked, and he bent his head over his soup with a sigh.\n\u003cbr\u003e \n\u003cbr\u003e Leycester looked round the table presently, and then turned to the countess.\n\u003cbr\u003e \n\u003cbr\u003e \"Where is Lenore?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e The countess paused a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"She has rather a bad headache, and begged to be excused,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Leycester bent his head.\n\u003cbr\u003e \n\u003cbr\u003e \"I am sorry,\" he remarked.\n\u003cbr\u003e \n\u003cbr\u003e Then the countess talked, and Lord Charles helped her. He was in the best of spirits. The dinner was excellent, and the curry admirable, considering the short notice; and he was delighted with the success of his maneuver. He rattled on in his humorous style, told them all about the hut, and represented that they lived somewhat after the manner of savages.\n\u003cbr\u003e \n\u003cbr\u003e \"Eat our meals with a hunting knife, don\u0027t we, Leycester? I hope you\u0027ll excuse us if we don\u0027t hold our forks properly. I daresay we shall soon get into the way of it again.\"\n\u003cbr\u003e \n\u003cbr\u003e All this was very well, and the earl smiled and grew cheerful; but the countess, watching the haggard, handsome face beside her, saw that Leycester was absorbed and pre-occupied. He passed dish after dish, and the Margaux stood beside him almost untouched. She was still anxious and fearful, and as she rose she threw a glance at the earl, half of entreaty, half of command, that he would not \"say anything.\"\n\u003cbr\u003e \n\u003cbr\u003e [248]\n\u003cbr\u003e \n\u003cbr\u003e \"It is nice to get back to the old wine,\" said Charlie, leaning back in his chair, and eying his glass with complacent approval. \"Whisky and water is a fine drink, but one tires of it; now this——\" and he reached the claret jug expressively.\n\u003cbr\u003e \n\u003cbr\u003e The earl talked of politics and the coming hunting season, and still Leycester was silent, eying the white cloth and fingering the stem of his wine glass.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you hunt this year, Leycester?\" said the earl, addressing him at last.\n\u003cbr\u003e \n\u003cbr\u003e He looked up gravely.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know, sir; only a day a week if I do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We shall go to Leicestershire, of course,\" said the earl. \"I shall have to be up for the season, but you can take charge if you will.\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester inclined his head.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you see to the horses?\" asked the earl.\n\u003cbr\u003e \n\u003cbr\u003e Leycester thought a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"I shall only want two,\" he said; \"the rest will be sold.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you mean the stud?\" asked the earl, with a faint air of surprise.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Leycester, quietly. \"I shall sell them all. I shall not race again.\"\n\u003cbr\u003e \n\u003cbr\u003e The earl understood him; the old wild life was to come to an end. But he put in a word.\n\u003cbr\u003e \n\u003cbr\u003e \"Is that wise?\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"I think so,\" said Leycester. \"Quite enough money has been spent. Yes, I shall sell.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Very well,\" assented the earl, who could not but agree with the remark respecting money. \"After all, I imagine one tires of the turf. I always thought it a great bore.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So it is—so it is,\" said Lord Charles, cheerfully. \"Everything is a bore.\"\n\u003cbr\u003e \n\u003cbr\u003e The earl smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"Not everything,\" he said. \"Leycester, you are not touching the wine,\" he added, graciously.\n\u003cbr\u003e \n\u003cbr\u003e Leycester filled his glass and drank it, and then, to Charles\u0027 surprise, refilled it, not once only, but twice and thrice, as if he had suddenly become thirsty.\n\u003cbr\u003e \n\u003cbr\u003e Presently the earl, after vainly pushing the decanter to them, rose, and they followed him into the drawing-room.\n\u003cbr\u003e \n\u003cbr\u003e The countess sat at her tea-table, and beside her was Lenore. She was rather paler than usual, and the beautiful eyes were of a deep violet under the long sweeping lashes. She was exquisitely dressed, but there was not a single jewel about her; a spray of white orchid nestled on her bosom and shone in her golden hair, showing the exquisite delicacy of the fair face and throat. Leycester glanced at her, but took his cup of tea without a word, and Lord Charles made all the conversation, as at the dinner-table.\n\u003cbr\u003e \n\u003cbr\u003e Presently Leycester put down his cup and walked to the window, and drawing the curtain aside, stood looking out at the night. There was a flush of color in his face, owing perhaps to the Margaux, and a strange light in his eyes. What did he see in the darkness? Was it the spirit of Stella to whom he had said[249] farewell? He stood wrapt in thought, the buzz of conversation and the occasional laugh of Charlie behind him; then suddenly he turned and went up to the silent figure with the while flower in its bosom and its hair, and sat down beside her.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you better?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e She just glanced at him, and smiled slowly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I am quite well. It was only a headache.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you well enough to come on to the terrace—there is a terrace, is there not?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A balcony.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Will you come? It is quite warm.\"\n\u003cbr\u003e \n\u003cbr\u003e She rose at once, and he took up a shawl and put it round her, and offered her his arm.\n\u003cbr\u003e \n\u003cbr\u003e She just laid her finger-tips on it, and he led her to the window. She drew back, and smiled over her shoulder.\n\u003cbr\u003e \n\u003cbr\u003e \"It is a capital offence to open a window at night.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I forgot,\" he said. \"You see, I am so great a stranger, that I fail to remember the habits of my own people. Will you show me the way round?\"\n\u003cbr\u003e \n\u003cbr\u003e \"This way,\" she said; and opening a small door, she took him into a conservatory, and thence to the balcony.\n\u003cbr\u003e \n\u003cbr\u003e They were silent for a moment or two—he looking at the stars, she with eyes bent to the ground. He was fighting for resolution and determination, she was silently waiting, knowing what was passing in his heart, and wondering, with a throbbing heart, whether her hour of triumph had come.\n\u003cbr\u003e \n\u003cbr\u003e She had stooped to the very dust to win him, to snatch him from that other girl who had ensnared him; but as she stood now and glanced at him—at the tall, graceful figure, and the handsome face, all the handsomer in her eyes for its haggardness—she felt that she could have stooped still lower if it had been possible. Her heart beat with expectant passion—she longed for the moment when she could rest upon his breast and confess her love. Why did he not speak?\n\u003cbr\u003e \n\u003cbr\u003e He turned to her at last, and spoke.\n\u003cbr\u003e \n\u003cbr\u003e \"Lenore,\" he said, and his voice was deep and earnest, almost solemn, \"I want to ask you a question. Will you answer me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ask it,\" she said, and she raised her eyes to his with a sudden flash.\n\u003cbr\u003e \n\u003cbr\u003e \"When you saw me to-night, when I came in unexpectedly, you were—moved. Was it because you were glad to see me?\"\n\u003cbr\u003e \n\u003cbr\u003e She was silent a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"Is that a fair question?\" she murmured.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said. \"Yes, Lenore; we will not trifle with each other, you and I. If you were glad to see me, do not hesitate to say so; it is not idle vanity that prompts the question.\"\n\u003cbr\u003e \n\u003cbr\u003e She faltered and turned her head away.\n\u003cbr\u003e \n\u003cbr\u003e \"Why will you press me?\" she murmured in a low, tremulous voice. \"Do you wish to see me ashamed?\" Then she turned to him suddenly, and the violet eyes met his with a light of passionate[250] love in their depths. \"But I will answer it,\" she said. \"Yes, I was glad.\"\n\u003cbr\u003e \n\u003cbr\u003e He was silent for a moment, then he drew closer to her and bent over her.\n\u003cbr\u003e \n\u003cbr\u003e \"Lenore, will you be my wife?\"\n\u003cbr\u003e \n\u003cbr\u003e She did not speak, but looked at him.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you be my wife?\" he repeated, almost fiercely; her supreme loveliness was telling upon him; the light in her eyes was sinking to his heart and stirring his pulses. \"Tell me, Lenore, do you love me?\"\n\u003cbr\u003e \n\u003cbr\u003e Her head drooped, then she sighed.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I love you,\" she said, and almost imperceptibly swayed toward him.\n\u003cbr\u003e \n\u003cbr\u003e He took her in his arms, his heart beating, his brain whirling, for the memory of that other love seemed to haunt him even at that moment.\n\u003cbr\u003e \n\u003cbr\u003e \"You love me!\" he murmured, hoarsely, looking back on the night of the past. \"Can it be true, Lenore? You!\"\n\u003cbr\u003e \n\u003cbr\u003e She nestled on his breast and looked up at him, and from the pale face the dark eyes gleamed passionately.\n\u003cbr\u003e \n\u003cbr\u003e \"Leycester,\" she breathed, \"you know I love you! You know it!\"\n\u003cbr\u003e \n\u003cbr\u003e He pressed her closer to him, then a hoarse cry broke from him.\n\u003cbr\u003e \n\u003cbr\u003e \"God forgive me!\"\n\u003cbr\u003e \n\u003cbr\u003e It was a strange response at such a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"Why do you say that?\" she asked, looking up at him; his face was haggard and remorseful, anything but as a lover\u0027s face should be, but he smiled gravely and kissed her.\n\u003cbr\u003e \n\u003cbr\u003e \"It is strange!\" he said, as if in explanation—\"strange that I should have won your love, I who am so unworthy, while you are so peerless!\"\n\u003cbr\u003e \n\u003cbr\u003e She trembled a little with a sudden qualm of fear. If he could but know of what she had been guilty to win him! It was she who was unworthy! But she put the fear from her. She had got him, and she did not doubt her power to hold him.\n\u003cbr\u003e \n\u003cbr\u003e \"Do not speak of unworthiness,\" she murmured, lovingly. \"We have both passed through the world, Leycester, and have learned to value true love. You have always had mine,\" she added, in a faint whisper.\n\u003cbr\u003e \n\u003cbr\u003e What could he do but kiss her? But even as he took her in his arms and laid his hand on the shapely head with its golden wealth, a subtle pain thrilled at his heart, and he felt as if he were guilty of some treachery.\n\u003cbr\u003e \n\u003cbr\u003e They stood for some time almost in silence—she was too wise to disturb his mood—side by side; then he put her arm in his.\n\u003cbr\u003e \n\u003cbr\u003e \"Let us go in,\" he said. \"Shall I tell my mother to-night, Lenore?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why not,\" she murmured, leaning against him, and with the upturned eyes glowing into his with suppressed passion and devotion. \"Why not? Will they not be glad, do you think?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, and he remembered how differently Stella had spoken. \"After all,\" he thought with a sigh, \"I shall make a[251] great many persons happy and comfortable. Very well,\" he said, \"I will see them.\"\n\u003cbr\u003e \n\u003cbr\u003e He stooped to kiss her before they passed into the light, and she did not shrink from his kiss; but put up her lips and met it with one in return.\n\u003cbr\u003e \n\u003cbr\u003e There were men, and not a few, who would have given some years of their life for such a kiss from the beautiful Lenore, but he, Leycester, took it without a thrill, without an extra heartbeat.\n\u003cbr\u003e \n\u003cbr\u003e There was not much need to tell them what had happened; the countess knew in a moment by Lenore\u0027s face—pale, but with a light of triumph glowing in it—that the hour had come, and that she had won.\n\u003cbr\u003e \n\u003cbr\u003e In her graceful manner, she went up to the countess, and bent over to kiss her.\n\u003cbr\u003e \n\u003cbr\u003e \"I am going up now, dear,\" she said, in a whisper. \"I am rather tired.\"\n\u003cbr\u003e \n\u003cbr\u003e The countess embraced her.\n\u003cbr\u003e \n\u003cbr\u003e \"Not too tired to see me if I come?\" she said, in a whisper, and Lady Lenore shook her head.\n\u003cbr\u003e \n\u003cbr\u003e She put her hand in Leycester\u0027s for a moment, as he opened the door for her, and looked into his face; but he would not let her go so coldly, and raising her hand to his lips, said—\n\u003cbr\u003e \n\u003cbr\u003e \"Good-night, Lenore.\"\n\u003cbr\u003e \n\u003cbr\u003e The earl started and stared at this familiar salutation, and Lord Charles raised his eyebrows; but Leycester came to the fire, and stood looking into it for a minute in silence.\n\u003cbr\u003e \n\u003cbr\u003e Then he turned to them and said, in his quiet way—\n\u003cbr\u003e \n\u003cbr\u003e \"Lenore has promised to be my wife. Have you any objection, sir?\"\n\u003cbr\u003e \n\u003cbr\u003e The earl started and looked at him, and then held out his hand with an emphatic nod.\n\u003cbr\u003e \n\u003cbr\u003e \"Objection! It is about the wisest thing you ever did, Leycester.\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester smiled at him strangely, and turned to his mother. She did not speak, but her eyes filled, and she put her hand on his shoulder and kissed him.\n\u003cbr\u003e \n\u003cbr\u003e \"My dear Leycester, I congratulate you!\" exclaimed Charlie, wringing his hand and beaming joyously. \"\u0027Pon my word, this is the—the happiest thing we\u0027ve come across for many a day! By George!\"\n\u003cbr\u003e \n\u003cbr\u003e And having dropped Leycester\u0027s hand, he seized that of the earl, and wrung that, and would in turn have seized the countess\u0027s, had she not given it to him of her own free will.\n\u003cbr\u003e \n\u003cbr\u003e \"We have to thank you in some measure for this, Charles,\" she said, in a low voice, and with a grateful smile.\n\u003cbr\u003e \n\u003cbr\u003e Leycester leant against the mantel-shelf, his hands behind him, his face set and thoughtful, almost absent, indeed. He had the appearance of a man in a dream.\n\u003cbr\u003e \n\u003cbr\u003e The earl roused him with a word or two.\n\u003cbr\u003e \n\u003cbr\u003e \"This is very good news, Leycester.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am very glad you are pleased, sir,\" said Leycester, quietly.\n\u003cbr\u003e \n\u003cbr\u003e \"I am more than pleased, I am delighted,\" responded the[252] earl, in his quiet way. \"I may say that it is the fulfillment of a hope I have cherished for some time. I trust, more, I believe, you will be happy. If you are not,\" he added, with a smile, \"it will be your own fault.\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester smiled grimly.\n\u003cbr\u003e \n\u003cbr\u003e \"No doubt, sir,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e The old earl passed his white hands over each other—just as he did in the House when he was about to make a speech.\n\u003cbr\u003e \n\u003cbr\u003e \"Lenore is one of the most beautiful and charming women it has been my fate to meet; she has been regarded by your mother, and I may say by myself, as a daughter. The prospect of receiving her at your hands as one in very truth affords me the most intense pleasure.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, sir,\" said Leycester.\n\u003cbr\u003e \n\u003cbr\u003e The earl coughed behind his hand.\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose,\" he said, with a glance at the haggard face, \"there will be no delay in making your happiness complete?\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester almost started.\n\u003cbr\u003e \n\u003cbr\u003e \"You mean——?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I mean your marriage,\" said the earl, staring at him, and wondering why he should be so dense and altogether grim, \"of course, of course, your marriage. The sooner the better, my dear Leycester. There will be preparations to make, and they always take time. I think, if you can persuade Lenore to fix an early date, I would see Harbor and Harbor\"—the family solicitors—\"at once. I need hardly say that anything I can do to expedite matters I will do gladly. I think you always had a fancy for the place in Scotland—you shall have that; and as to the house in town, well if you haven\u0027t already thought of a place, there is the house in the square——\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester\u0027s face flushed for a moment.\n\u003cbr\u003e \n\u003cbr\u003e \"You are very good to me, sir,\" he said; and for the first time his voice showed some feeling.\n\u003cbr\u003e \n\u003cbr\u003e \"Nonsense!\" said the earl cordially. \"You know that I would do anything, everything to make your future a happy one. Talk it over with Lenore!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will, sir,\" said Leycester. \"I think I will go up to Lilian now, she expects me.\"\n\u003cbr\u003e \n\u003cbr\u003e The earl took his hand and shook it as he had not shaken it for many a day, and Leycester went up-stairs.\n\u003cbr\u003e \n\u003cbr\u003e The countess had left the room, but he found her waiting for him.\n\u003cbr\u003e \n\u003cbr\u003e \"Good-night, mother,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Leycester, you have made me—all of us—so happy!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ay,\" he said, and he smiled at her. \"I am very glad. Heaven knows I have often enough made you unhappy, mother.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, no,\" she said, kissing him; \"this makes up for all—for all!\"\n\u003cbr\u003e \n\u003cbr\u003e Leycester watched her as she went down-stairs, and a sigh broke from him.\n\u003cbr\u003e \n\u003cbr\u003e \"Not one of them understands, not one,\" he murmured.\n\u003cbr\u003e \n\u003cbr\u003e But there was one watching for him who understood.\n\u003cbr\u003e \n\u003cbr\u003e [253]\n\u003cbr\u003e \n\u003cbr\u003e \"Leycester,\" she said, holding out her hands to him and almost rising.\n\u003cbr\u003e \n\u003cbr\u003e He sat on the head of the couch and put his hand on her head.\n\u003cbr\u003e \n\u003cbr\u003e \"Mamma has just told me, Ley,\" she murmured. \"I am so glad, so glad. I have never been so happy.\"\n\u003cbr\u003e \n\u003cbr\u003e He was silent, his fingers caressing her cheek.\n\u003cbr\u003e \n\u003cbr\u003e \"It is what we have all been hoping and praying for, Ley! She is so good and sweet, and so true.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, little guessing at her falsity.\n\u003cbr\u003e \n\u003cbr\u003e \"And, Ley—she loves you so dearly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Aye,\" he said, with almost a groan.\n\u003cbr\u003e \n\u003cbr\u003e She looked up at him and saw his face, and her own changed color; her hand stole up to his.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Ley, Ley,\" she murmured, piteously. \"You have forgotten all that?\"\n\u003cbr\u003e \n\u003cbr\u003e He smiled, not bitterly but sadly.\n\u003cbr\u003e \n\u003cbr\u003e \"Forgotten? No,\" he said; \"such things are not easily forgotten. But it is past, and I am going to forget now, Lil.\"\n\u003cbr\u003e \n\u003cbr\u003e Even as he spoke he seemed to see the loving face, with its trusting smile, floating before him.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, Ley, dear Ley, for her sake. For Lenore\u0027s sake.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, grimly, \"for hers and for my own.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You will be so happy; I know it, I feel it. No one could help loving her, and every day you will learn to love her more dearly, and the past will fade away and be forgotten, Ley.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" he said, in a low, absent voice.\n\u003cbr\u003e \n\u003cbr\u003e She said no more, and they sat hand in hand wrapped in thought. Even when he got up to go he said nothing, and his hand as it held hers was as cold as ice.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1672/49296.html","bookId":1188,"creation":"Aug 5, 2019 1:45:49 PM","modification":"Aug 5, 2019 1:45:49 PM"}
