{"id":88326,"no":2,"title":"Page 2","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe didn’t know Billy Preston well, and she wasn’t interested in him in that way—she had a boyfriend after all—but she enjoyed how they always exchanged a few words. He’d been a lieutenant in the Oakland PD before being recruited as sheriff for Sierra Falls, and she loved his occasional mention of big-city life.\u003c/p\u003e\n\u003cp\u003eAn idea hit her. “Hold on,” she said, and darted back into the kitchen. She’d baked bread the night before, and the last thing she needed was that many carbs lying around.\u003c/p\u003e\n\u003cp\u003eShe returned, handing him a small foil-wrapped bundle. “It’s not a frittata, but my apple cinnamon bread is a close second.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” he deadpanned, patting his belly. “We law enforcement officers only eat donuts.”\u003c/p\u003e\n\u003cp\u003e“Well…” Biting back a grin, she pulled the bread out of his reach, doing her best to look offended. “See if I ever try to feed you again.”\u003c/p\u003e\n\u003cp\u003e“On second thought, it smells too good.” He laughed and snatched it from her hands. “Give me that.”\u003c/p\u003e\n\u003cp\u003eShe laughed with him, not caring that the others were looking. It was gratifying that she’d been the one to draw out the humor. For the first time that day, the muscles in her shoulders felt like they might relax.\u003c/p\u003e\n\u003cp\u003eA hideous sound caused her to seize right back up again.\u003c/p\u003e\n\u003cp\u003eOutside, there was the long whine of creaking timber, followed by a loud crash.\u003c/p\u003e\n\u003cp\u003eShe and the sheriff locked eyes. For the flicker of a moment, a feeling of comfort cut to her heart, and Sorrow was grateful she wasn’t in it alone.\u003c/p\u003e\n\u003cp\u003eWhich was crazy, of course. She didn’t even know the man.\u003c/p\u003e\n\u003cp\u003eBut those thoughts came and went in the blink of an eye, and she was dashing out the door, Billy and the rest of their patrons hot on her heels.\u003c/p\u003e\n\u003cp\u003eTwo\u003c/p\u003e\n\u003cp\u003eBilly Preston’s first thought was that somebody had crashed a car into a tree. His second was of his wife.\u003c/p\u003e\n\u003cp\u003eEvery other thought was.\u003c/p\u003e\n\u003cp\u003eOnly this time, he felt almost guilty when the memories of her slammed back into his mind. He’d been sharing a few friendly jokes with a pretty woman—as though he’d forgotten his past and were a regular guy.\u003c/p\u003e\n\u003cp\u003eBut he wasn’t a regular guy. Three years ago, his wife had been struck and killed by a bus while biking to work. And he hadn’t been there for her.\u003c/p\u003e\n\u003cp\u003eThere was never any predicting what would return him to that day. No knowing when the odd questions would creep in to haunt him. Things like, what had she eaten for breakfast that day? Had she looked at the newspaper before she’d left that morning? And a desperate curiosity would seize him, plague him.\u003c/p\u003e\n\u003cp\u003eThis time, it was the sound of crashing from outside that called her back.\u003c/p\u003e\n\u003cp\u003eNormally, he held a shield in place through the daylight hours. It let him deflect those bad thoughts, hoarding them for the wee hours. But he’d met Sorrow’s eyes, and the raw connection there startled him. It shattered his guard, sending his mind spinning for an instant.\u003c/p\u003e\n\u003cp\u003eSpinning back to those days when he drove his wife to work every day. Every day except for that day. He’d been up late the night before with paperwork—police did reams more of it than they showed on TV—and Keri had insisted he snag the extra twenty minutes of sleep.\u003c/p\u003e\n\u003cp\u003eA beat cop delivered the news hours later, just as he was racing out to grab a bite for lunch. It’d taken that long to identify Keri, to track him down as her next of kin.\u003c/p\u003e\n\u003cp\u003eWhile he’d been showering, and swilling back the rest of his tepid coffee, contemplating whether or not he could get away with skipping his morning shave, his wife had been on the side of the road, dying. While he’d been bitching to the guys about paperwork, she was already gone.\u003c/p\u003e\n\u003cp\u003eHe’d endured six months of personal leave, a few years of phoning it in, and countless hours at the gym lifting till the muscles in his arms trembled, before an old buddy hooked him up. The small town of Sierra Falls had lost the sheriff they’d known for decades, and did Billy want to step in to fill his shoes? Like that, he was tapped for the ballot, running uncontested, and before he knew it, he was packing up his belongings and heading to the mountains.\u003c/p\u003e\n\u003cp\u003eHe’d been anxious to get away from the city, from the reminders that lurked everywhere, and now, living in the shadow of the Sierra Nevadas, a part of Billy was able to find some peace.\u003c/p\u003e\n\u003cp\u003eThe other parts, he simply shut down.\u003c/p\u003e\n\u003cp\u003eSharing that moment with Sorrow had unsettled him. He’d had the eerie feeling that, locking eyes as they had, she could see into his soul, reading his guilt, his pain.\u003c/p\u003e\n\u003cp\u003eBilly shoved such silly notions to the back of his mind. He bolted up from his booth. Ran out the door.\u003c/p\u003e\n\u003cp\u003eSheriff once more.\u003c/p\u003e\n\u003cp\u003eHe and Sorrow stood shoulder-to-shoulder, and it took only a second to realize what’d happened. A tree branch had crashed through the roof of the Big Bear Lodge.\u003c/p\u003e\n\u003cp\u003eBilly shook his head slowly. A goodly chunk of the roof had caved in, and it was now one devastated mass of snow, timber, and roofing. If he craned his neck just right, he could see through the hole clear to the attic window on the other side.\u003c/p\u003e\n\u003cp\u003e“Oh, shh”—Sorrow swallowed the tail end of the curse—“sugar.”\u003c/p\u003e\n\u003cp\u003e“Go ahead and say it. Looks like you could use a good round of swearing.” It seemed the woman managed most every aspect of her family’s business. He guessed this would fall square on her shoulders, too.\u003c/p\u003e\n\u003cp\u003eHer arms were crossed tightly across her chest, like she might fly apart if she let go. “It’s the Sorrow thing.”\u003c/p\u003e\n\u003cp\u003e“The what?” If she was speaking about herself in the third person, maybe she was more upset than he’d realized.\u003c/p\u003e\n\u003cp\u003e“It’s my luck. The Sorrow luck. All the women in my family who’ve been named Sorrow have had atrocious luck. With men. With money. With pretty much everything. Why they keep using that damned name is beyond me.”\u003c/p\u003e\n\u003cp\u003eEdith Bailey burst from the lodge, a crocheted shawl clutched at her chest. “What on earth—?”\u003c/p\u003e\n\u003cp\u003e“The roof.” Sorrow spared the briefest glance for her mother then looked back at the devastation. “How much is this going to cost?”\u003c/p\u003e\n\u003cp\u003eThey all stepped closer. Billy rested a hand on the pine towering overhead. Peering up into the branches, he said, “Looks like you’ve got some dead branches.”\u003c/p\u003e\n\u003cp\u003e“I knew we needed to trim the deadwood.” Sorrow pinned her mom with a look. “I told him we needed to trim the deadwood.”\u003c/p\u003e\n\u003cp\u003eBilly didn’t need to ask to guess that by him she’d meant her father, but he knew to mind his own business. Instead, he backed up, shaking clumps of snow from a row of low branches. “This is some wet snow. And on top of last week’s storm? Too heavy, even for this gorgeous old giant.”\u003c/p\u003e\n\u003cp\u003eSorrow’s mother remained silent, chewing on her thumbnail.\u003c/p\u003e\n\u003cp\u003eHe hardly knew the Bailey family, but at that moment, her tense presence seemed like the last thing Sorrow needed. Putting his hand at Edith’s back, he gently guided her back toward the door. “You’re going catch a chill, ma’am. I can help your daughter while you go find yourself a proper coat.”\u003c/p\u003e\n\u003cp\u003eEdith stopped in her tracks. “Oh good Lord, the hope chests.” In a panic, she called to Sorrow, “Your grandmother’s trunks. The attic will get soaked. You’ve got to go take care of all the trunks.”\u003c/p\u003e\n\u003cp\u003e“We’ll take care of it.” Billy continued to herd her back inside, then returned to Sorrow’s side. “What trunks?”\u003c/p\u003e\n\u003cp\u003e“There’s ten tons of junk in the attic. As if I don’t have enough on my plate.” She turned, trudging toward the lodge entrance.\u003c/p\u003e\n\u003cp\u003eThe woman looked suddenly so drawn, so alone, Billy couldn’t help himself from falling into step with her. “Can I help?”\u003c/p\u003e\n\u003cp\u003eAs she opened her mouth to reply, the wind gusted, enveloping them in a cloud of white. He instinctively reached for her, taking her arm to stop her. It was silly—the cars in the lot were parked, there were no more snow-laden branches overhead, it was perfectly safe—but he couldn’t stop himself.\u003c/p\u003e\n\u003cp\u003eThey stood like that for a frozen moment. Sunlight caught the snow and it sparkled as it swirled around them. It kissed the fabric of his shirt, damp and clinging to his shoulders.\u003c/p\u003e\n\u003cp\u003eWhen the cloud settled, he found Sorrow’s gaze on him. Watery light cut through the branches and reflected off the snow, and he saw that her eyes were more green than blue.\u003c/p\u003e\n\u003cp\u003eGuilt speared him, and he pulled his hand back abruptly. He felt like he was cheating on his wife. Logically, he knew that was ridiculous, but something in his chest told him otherwise.\u003c/p\u003e\n\u003cp\u003eThere was a brief, awkward silence, and then they both spoke at once.\u003c/p\u003e\n\u003cp\u003e“What do—”\u003c/p\u003e\n\u003cp\u003e“How is—”\u003c/p\u003e\n\u003cp\u003eThey each huffed out a humorless laugh. He tried to smile, but suspected he didn’t quite manage it.\u003c/p\u003e\n\u003cp\u003eCrossing her arms over her chest, she gave a self-deprecating shrug. “Just my luck, huh?”\u003c/p\u003e\n\u003cp\u003eHe cleared his throat, anxious to be back to business. “It might not be so bad.”\u003c/p\u003e\n\u003cp\u003eThey studied the damage. Snow was still falling, steady and quiet, drifting into the attic in a way that seemed almost diligent.\u003c/p\u003e\n\u003cp\u003e“Or not,” he said, correcting himself.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Pain flickered across her face, before she schooled it to a careful, bland half smile. “It’s kinda bad.”\u003c/p\u003e\n\u003cp\u003eHe put aside his own pain for a moment, confronted with hers. “Seriously, Sorrow. Are you okay?”\u003c/p\u003e\n\u003cp\u003eShe sighed. “Complaining won’t stop the snow.”\u003c/p\u003e\n\u003cp\u003eShe was no nonsense. He appreciated that. Just then, he didn’t think he could deal with an overwrought female. “What can I do to help?”\u003c/p\u003e\n\u003cp\u003e“Unless you’re a roofer, there’s nothing you can do.” She bit her lip, deep in thought. Something about it made her seem so alone. “Damien—he’s my…friend—he’s got contacts.”\u003c/p\u003e\n\u003cp\u003eDamien. Billy recognized the name and guessed it was the good-looking guy he’d seen around with her. He’d spotted the two of them doing things like eating lunch, or driving in his car, headed out of town.\u003c/p\u003e\n\u003cp\u003eClearly, more than friends.\u003c/p\u003e\n\u003cp\u003eBilly wanted to help. He almost offered to help her sort through the attic. But he reminded himself it wasn’t his place. Sorrow already had a man to help her, while Billy had work to do. \u003c/p\u003e","sourceLink":"https://allnovel.net/sierra-falls-sierra-falls-1/page-2.html","bookId":1913,"creation":"Oct 5, 2019 5:28:27 PM","modification":"Oct 5, 2019 5:28:27 PM"}
