{"id":47765,"no":1131,"title":"Chapter 1131: Test","content":"\u003cp\u003eChapter 1131: Test\u003c/p\u003e\n\u003cp\u003eThe young lady was really quite young. She merely looked around eighteen or nineteen. Her delicate body was small while her pretty face appeared pale. From the looks of it, she seemed to be in a sickly state…\u003c/p\u003e\n\u003cp\u003eOf course, the thing that attracted Xiao Yan’s eyes was not this young lady’s outer appearance. Instead, it was that circular-shaped badge on her chest. He had seen this badge on the mysterious snow-white carriage when he had arrived in Holy Pill City. Hence, he understood that this badge was the clan badge of the Dan clan, one of the five great clans of the Pill Region.\u003c/p\u003e\n\u003cp\u003e“You… are you alright?”\u003c/p\u003e\n\u003cp\u003eThe young lady supported herself to her feet with her hands. She timidly glanced at Xiao Yan and softly inquired.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s mind only shifted away from the badge of the Dan clan upon hearing the young lady’s voice. His eyes looked at the young lady in front of him with surprise. The horrific scene from earlier had caused his heart to pound at this moment. Earlier, he had clearly sensed an extremely strange suction force had erupted from the interior of this young lady’s body. Under the suction force, even his soul could not resist but show the terrifying signs of being sucked out.\u003c/p\u003e\n\u003cp\u003eXiao Yan rubbed his hand. He took another step back without anyone noticing. This young lady might appear seventeen or eighteen, but she emitted a strangeness. Moreover, she was someone from the Dan clan, which kept an extremely low profile. This caused Xiao Yan to involuntarily be a little more cautious.\u003c/p\u003e\n\u003cp\u003e“I’m fine…”\u003c/p\u003e\n\u003cp\u003eThe young lady only let out a gentle sigh of relief after seeing Xiao Yan shake his head. However, her gaze was a little strange when she looked at Xiao Yan. It seemed that she was a little surprised that Xiao Yan could remain fine even after having touched her…\u003c/p\u003e\n\u003cp\u003e“That… I’m sorry…” The young lady swept her eyes over Xiao Yan’s face and apologized to him. After which, she turned around and rushed off without waiting for Xiao Yan to reply. She merged into the human flow and disappeared.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyebrows were involuntarily knit when he saw this young lady go, whose every action was emitting a strangeness. He vaguely felt that this young lady was not simple…\u003c/p\u003e\n\u003cp\u003e“Xiao Yan, follow me…”\u003c/p\u003e\n\u003cp\u003eYe Zhong’s voice suddenly sounded beside Xiao Yan’s ears while he was deep in thought. Xiao Yan hurriedly recovered. He looked at the frowning Ye Zhong, who had walked to his side, and asked, “Can we enter?”\u003c/p\u003e\n\u003cp\u003e“Uh…” Ye Zhong nodded. He hesitated for a moment and said, “I have used some connections that can allow you to use a special examination room. However, there are some other people in that examination room now. In my opinion… perhaps we should come tomorrow?”\u003c/p\u003e\n\u003cp\u003eXiao Yan looked at the somewhat dim expression of Ye Zhong. He raised his eyebrows and asked, “Are they the other clans?”\u003c/p\u003e\n\u003cp\u003eYe Zhong was startled upon hearing this. He bitterly smiled, nodded, and sighed, “Coincidentally the Bai clan and the Qiu clan are also here to take the test… in the past, these two clans had been suppressed by the Ye clan. Now that they have turned things around with much difficulty, they naturally act like little men intoxicated by their success. Every time we meet, they take the opportunity to mock me. This old face of mine is fine with it, but I’m afraid they may utter some awful words to you.”\u003c/p\u003e\n\u003cp\u003eXiao Yan smiled. He patted Ye Zhong’s shoulders and said, “We have already come. Don’t tell me that we should return empty-handed?”\u003c/p\u003e\n\u003cp\u003eYe Zhong hesitated for a moment upon hearing Xiao Yan. He could only nod his head as he said, “Alright, you should just act like you have not heard them no matter what they say.”\u003c/p\u003e\n\u003cp\u003eYe Zhong turned around after saying this. He walked along a special path. Xiao Yan followed close behind.\u003c/p\u003e\n\u003cp\u003eThe two of them successfully entered the special path in front of the many surprised eyes around them. They passed by the somewhat dim path before a bright light suddenly appeared in front of them. Xiao Yan and Ye Zhong followed the light forward. An extremely spacious room immediately appeared in the eyes of the two of them.\u003c/p\u003e\n\u003cp\u003eThis room was very spacious. Moreover, it was extremely quiet. Not the least bit of noise from the outside world was transmitted into this place. At this moment, there were nearly ten plus people standing in the room. All of their eyes paused on Xiao Yan and Ye Zhong at this moment.\u003c/p\u003e\n\u003cp\u003e“Hee hee, Elder Ye Zhong. It is unexpected that you have brought someone to take the test. Looks like the other people also know that this is a rather embarrassing errant…” Before Xiao Yan and Ye Zhong could say anything after they had just entered the room, an ear-piercing laugh was transmitted over.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s expression did not change. His gaze followed the voice only to see a gray-clothed, old woman. Her parted mouth was filled with yellow teeth as she revealed a ridicule in her eyes while looking at the two of them.\u003c/p\u003e\n\u003cp\u003eThere were three white-clothed, young men standing behind the gray-clothed, old woman. Two men and one woman. The three of them had nice appearances, especially the white-clothed lady. She had a tall, lovely body that was sexy and well-proportioned. It possessed a great amount of allure. The eyes of the two men beside her continuously pausing on parts of her body. There was a fiery heat and greed within their eyes…\u003c/p\u003e\n\u003cp\u003eThe white-clothed lady appeared extremely cold. Her pretty eyes swept over Xiao Yan and Ye Zhong, and her eyes contained a disdain and ridicule that she could not hide. Currently, the Ye clan was no longer able to hold onto the name of being one of the five great clan. It was a little embarrassing mentioning them…\u003c/p\u003e\n\u003cp\u003e“This noisy old woman is someone from the Bai clan…”\u003c/p\u003e\n\u003cp\u003eYe Zhong’s face twitched because of the old woman’s ridicule while he softly introduced her to Xiao Yan.\u003c/p\u003e\n\u003cp\u003eXiao Yan slightly nodded. His eyes landed on another spot. There were also three people standing there. The one leading them was a yellow-clothed, old man. There was a man and a woman behind him. The man was handsome while the woman was beautiful. They appeared like an extremely matching pair. Although these three people did not utter any mocking words, their eyes merely swept over Xiao Yan’s group before turning away. There disdain and contempt was even more infuriating.\u003c/p\u003e\n\u003cp\u003eAlthough Ye Zhong did not introduce these three people, Xiao Yan also understood that they should be the so-called members of the Qiu clan.\u003c/p\u003e\n\u003cp\u003e“Ke ke, have the people from the Ye clan also arrived…”\u003c/p\u003e\n\u003cp\u003eThere was another a white-haired, old man in purple alchemist robes within the room. The smile on his face was much more sincere when he saw Ye Zhong. Clearly, he had some sort of friendship with Ye Zhong.\u003c/p\u003e\n\u003cp\u003e“I have troubled Elder Wei Li…”\u003c/p\u003e\n\u003cp\u003eYe Zhong cupped his hands to the white-haired, old man as he courteously replied.\u003c/p\u003e\n\u003cp\u003e“Ugh, what is there to be so courteous about between the two of us…” The old man who was called Wei Li sighed when he saw how Ye Zhong acted.\u003c/p\u003e\n\u003cp\u003e“Alright, Ye Zhong, there is no need to be so long-winded. I do not wish to be delayed because of you. Is this brat the person that your Ye clan has sent over? Why does he not even have a tier badge? Don’t tell me that he has never obtained a badge from the Pill Tower?” The gray-clothed, old woman waved her hand impatiently. She immediately glanced at Xiao Yan and coldly laughed.\u003c/p\u003e\n\u003cp\u003e“I have really never obtained any badge from the Pill Tower… this is also my first time here.” Xiao Yan honestly replied in the face of the ridicule from this gray-clothed, old woman.\u003c/p\u003e\n\u003cp\u003e“Hee.. as expected…”\u003c/p\u003e\n\u003cp\u003eA harsh smile was lifted on the corner of the gray-clothed, old woman’s mouth when she heard this. The cold, white-clothed lady by the side also looked at Xiao Yan with some disdain. Her voice was indifferent as she said, “This is a special examination room. Only someone who is being tested for a badge that is tier 5 and above has the qualification to enter. Is Elder Ye Zhong not aware of this?”\u003c/p\u003e\n\u003cp\u003e“You should manage yourself properly. The people from the Bai clan have a really poor upbringing!” Ye Zhong’s expression sank as he coldly reprimanded.\u003c/p\u003e\n\u003cp\u003eThe face of the white-clothed lady changed slightly upon hearing Ye Zhong’s chilly cry. She immediately let out a cold snort.\u003c/p\u003e\n\u003cp\u003e“Hee hee, it has been a few years since we have met. Ye Zhong, your temper is really becoming worse. However, if your Ye clan is unable to enter the top three in this test, it is likely that you will have to give up your position as one of the five great clans.” The gray-clothed, old woman mocked.\u003c/p\u003e\n\u003cp\u003e“Alright, this is the Holy Pill City. It is not the territory of your own clan! If you have any objections, you can head to other places to take the test!” That white-haired, old man frowned at this moment and spoke in a deep voice.\u003c/p\u003e\n\u003cp\u003eThe room became much quieter after everyone heard the white-haired, old man speak.\u003c/p\u003e\n\u003cp\u003e“We will follow the order of arrival. Qiu clan, you will take the test first.” The white-haired, old man’s eyes turned to the three people from the Qiu clan who had not joined the conversation. He faintly spoke to them.\u003c/p\u003e\n\u003cp\u003eThe man and woman behind the elder from the Qiu clan swiftly stepped forward upon hearing this. They cupped their hands respectfully to the white-haired, old man.\u003c/p\u003e\n\u003cp\u003e“What tier badge are the two of you preparing to take?” The white-haired, old man swept his eyes over them as he randomly asked.\u003c/p\u003e\n\u003cp\u003e“Tier 6 middle grade.”\u003c/p\u003e\n\u003cp\u003eThe white-haired, old man raised his eyebrows upon hearing this. He looked at these two with some surprise. It was considered quite good to be able to take the test for the tier 6 middle grade at this age. It seemed that this Qiu clan had gained some talent during these years.\u003c/p\u003e\n\u003cp\u003e“The two of you should wait for a moment. You will head to the Xuan gate in a while. There will naturally be someone who will test you inside…” The white-haired, old man pointed to the second of four doors from the left as he instructed them.\u003c/p\u003e\n\u003cp\u003eThis man and woman with good looks nodded and took a step back. They exchanged looks with one another, appearing a little proud. The surprise of the white-haired, old man caused them to feel quite satisfied.\u003c/p\u003e\n\u003cp\u003e“Bai clan…”\u003c/p\u003e\n\u003cp\u003eThe two men behind the gray-clothed, old woman were the first to step forward after seeing the eyes of the white-haired, old man turn toward them. They said in a clear, loud voice, “Tier 6 middle grade!”\u003c/p\u003e\n\u003cp\u003eThe voices of these two were quite loud. It caused the man and woman from the Qiu clan earlier to change their expressions. A soft snort was immediately emitted from their nostrils.\u003c/p\u003e\n\u003cp\u003eThat cold-white, clothed lady slowly stepped forward after the two of them and uttered, “Tier 6 high grade.”\u003c/p\u003e\n\u003cp\u003eThe expression of the old man from the Qiu clan changed slightly upon hearing this while the gray-clothed, old woman displayed a proud smile on her face.\u003c/p\u003e\n\u003cp\u003e“Not bad…”\u003c/p\u003e\n\u003cp\u003eThe white-haired, old man slowly nodded. This Bai clan was filled with talent. Compared to the Ye clan…\u003c/p\u003e\n\u003cp\u003eThe white-haired, old man sighed in his heart when he thought of this. His eyes turned to Ye Zhong as he said, “Ye Zhong… it’s your turn.”\u003c/p\u003e\n\u003cp\u003eAll the gazes within the room instantly gathered on Xiao Yan after his words sounded. There was faint disdain in their eyes. The Ye clan had lost quite a lot of face during these years…\u003c/p\u003e\n\u003cp\u003eXiao Yan slowly stepped forward in front of the many gazes. He glanced at the white-haired, old man and asked, “What is the highest tier that I can be examined for in this place?”\u003c/p\u003e\n\u003cp\u003eThe white-haired, old man was startled when he heard this while the others let out mocking laughs.\u003c/p\u003e\n\u003cp\u003e“Tier 7 middle grade. This is the limit I can examine here because the old me is merely at the tier 7 low grade. Which tier test do you wish to take?”\u003c/p\u003e\n\u003cp\u003eXiao Yan slowly nodded and randomly uttered, “In that case, tier 7 middle grade…”\u003c/p\u003e\n\u003cp\u003eThe ridicule within the room immediately ceased when these words sounded.\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1130\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1132\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1131","bookId":1497,"creation":"Sep 10, 2019 3:24:54 AM","modification":"Sep 10, 2019 3:24:54 AM"}
