{"id":46750,"no":116,"title":"Chapter 116: Ice Spirit Blazing Grass","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 116: Ice Spirit Blazing Grass\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe coldness and darkness of the surroundings engulfed the two as they walked within the quiet mountain cave. Amidst the silence, only the soft footsteps of two people could be heard.\u003c/p\u003e\n\u003cp\u003eThe surrounding atmosphere caused the Fairy Doctor to instinctively hug herself. She raised her head and watched Xiao Yan walking slowly ahead of her. A brief hesitation later, she increased her pace and closely followed behind him. In this environment, only the young man in front of her gave her some sense of security.\u003c/p\u003e\n\u003cp\u003eAfter walking for over ten minutes in the quiet atmosphere, the Fairy Doctor started feeling that the insanely quiet atmosphere was unbearable. At that moment, however, the young man in front of her abruptly stopped.\u003c/p\u003e\n\u003cp\u003e“Ah…” The Fairy Doctor failed to react in time and knocked softly into Xiao Yan’s back.\u003c/p\u003e\n\u003cp\u003eThe intimate encounter caused the Fairy Doctor to take a step back with an extremely red face as she embarrassingly said, “What are you doing?”\u003c/p\u003e\n\u003cp\u003eThe earlier soft contact had also caused Xiao Yan to take in a deep and heavy breath. He coughed drily as he pointed towards a rock door where a faint yellow light was emitted and helplessly said, “It’s a dead end.”\u003c/p\u003e\n\u003cp\u003eHearing this, the Fairy Doctor pressed her eyebrows together and took two steps forward. Facing the door, she said in a deep voice, “Behind the rock door ought to be our destination. If the ancient elder had built a cave here, I don’t think that he would have created one that leads to nowhere.”\u003c/p\u003e\n\u003cp\u003eXiao Yan stepped forward and touched the rock door. After estimating its thickness, he slowly shook his head. “The rock door is very thick and requires the strength of a Dou Shi to forcefully break it.”\u003c/p\u003e\n\u003cp\u003e“All that you know is how to use force. Look at the yellow light that is emitted from the rock door; this is obviously a ground element trap technique. If you pay more attention to the details, it isn’t difficult to open it.” After giving Xiao Yan a disparaging look, the Fairy Doctor placed her thin hand on the rock door which began to slowly move.\u003c/p\u003e\n\u003cp\u003e“You know about trap techniques? If I recall correctly, that is something a wood or ground element Dou Zhe is good at.” Seeing the serious face on the Fairy Doctor, Xiao Yan could not help but curiously ask.\u003c/p\u003e\n\u003cp\u003e“It’s just that I have read some books on trap techniques. I cannot be considered competent but it should not be a problem if I use it to probe around.” The Fairy Doctor carelessly answered as her hand’s action remained as graceful as ever.\u003c/p\u003e\n\u003cp\u003eXiao Yan nodded his head but did not disturb her surveyance. His gaze moved away from the rock door and using a faint light, sized up the surrounding rock walls.\u003c/p\u003e\n\u003cp\u003eOn the rock wall were some faint carvings. They had grown blurry but Xiao Yan could make out a couple of human shapes which were likely left behind by the cave owner.\u003c/p\u003e\n\u003cp\u003e“Found it!!” Just as Xiao Yan was studying the rock wall, the Fairy Doctor’s happy voice prompted him to shift his gaze.\u003c/p\u003e\n\u003cp\u003eBeside the rock wall, the Fairy Doctor was already squated down; her thin hand was touching a small protruding spot on the rock wall. When she pressed on it, a creaking sound slowly echoed through the cave.\u003c/p\u003e\n\u003cp\u003eWatching the rising rock door, Xiao Yan heaved a sigh of relief and gave the Fairy Doctor a thumbs up.\u003c/p\u003e\n\u003cp\u003eFollowing the rising rock door, a faint light emitted from behind it, chasing away the darkness around them.\u003c/p\u003e\n\u003cp\u003eSeeing the bright interior behind the rock wall, the Fairy Doctor smiled but retreated two steps. Then she faced Xiao Yan, raising her chin and smiled, “Please, go in.”\u003c/p\u003e\n\u003cp\u003eShrugging his shoulders, Xiao Yan picked up a few stones and violently threw them into the cave. He felt slightly reassured when he did not notice any reaction.\u003c/p\u003e\n\u003cp\u003e“You’re really an overly cautious person.” Seeing that Xiao Yan did not forget to be careful even at this moment, the Fairy Doctor could only shake her head helplessly.\u003c/p\u003e\n\u003cp\u003e“Thanks for your compliment.” Smiling indifferently, Xiao Yan stepped carefully across the rock door and entered the interior.\u003c/p\u003e\n\u003cp\u003eSeeing that Xiao Yan had stepped forward, the Fairy Doctor followed closely behind.\u003c/p\u003e\n\u003cp\u003eUpon stepping into the interior of the cave, their range of vision suddenly widened.\u003c/p\u003e\n\u003cp\u003eBeyond the rock door was an enormous room which appeared somewhat simple and empty. Mounted on the walls were Moonstones that were used as a source of light. At the center of the room was a chair that seated a skeleton with its fallen skull placed on its thigh bone. This scene, when viewed from this quiet atmosphere, appeared quite ghastly.\u003c/p\u003e\n\u003cp\u003eIn front of the chair was a wide and long black stone table. Three locked stone containers were neatly placed on it.\u003c/p\u003e\n\u003cp\u003eAdditionally, there were large numbers of shiny gold coins and other precious items in the other three corners. Just by the number of the gold coins, the total wealth in this room was over the hundreds of thousands.\u003c/p\u003e\n\u003cp\u003eValuables and money were not something that Xiao Yan lacked and from the way these valuables were randomly placed, it seemed that their owner did not hold them in high regard either.\u003c/p\u003e\n\u003cp\u003eXiao Yan shifted his gaze away from the shiny gold, moving them to the last corner of the room instead. Happiness surfaced on his face when he did.\u003c/p\u003e\n\u003cp\u003eThe last corner of the room was a flower bed made by piling soil together. Within it grew numerous different flowers and plants that shrouded the flower bed with fragrances.\u003c/p\u003e\n\u003cp\u003eWhile staring at these plants, Xiao Yan and the Fairy Doctor hurried forward in unison. An ordinary person may not recognize these plants but they knew very well that these seemingly ordinary plants was worth more than the piles of gold in the room.\u003c/p\u003e\n\u003cp\u003e“Purple Blue Leaf, White Spirit Ginseng Fruit, Snow Lotus Seed….”\u003c/p\u003e\n\u003cp\u003eThe Fairy Doctor blankly stared at the small flower bed. One by one, the names of rare and expensive medical ingredients secretly leaped from her red moist mouth.\u003c/p\u003e\n\u003cp\u003e“Ice Spirit Blazing Grass!”\u003c/p\u003e\n\u003cp\u003eAs he swept his gaze across the flower bed, Xiao Yan suddenly pulled back his gaze and stared intently at the middle of the flowerbed where a red and white grass grew.\u003c/p\u003e\n\u003cp\u003eThe leaves of this grass were separated into two colors. Its stem, which was white, was also covered with droplets of what appeared to be icy crystals while its reddish tips were like a ball of burning flame. The two opposing colors and elements had miraculously grown on the plant.\u003c/p\u003e\n\u003cp\u003eA faint mist surrounded this plant, giving it an appearance of floating amongst the clouds.\u003c/p\u003e\n\u003cp\u003eThis strange grass was named ‘Ice Spirit Blazing Grass’, an exceedingly rare ingredient that was also a necessary ingredient for the ‘Blood Lotus Pill’.\u003c/p\u003e\n\u003cp\u003eXiao Yan excitedly stared at the medicinal grass as an agitated expression appeared on his face. Two of the medicinal ingredients that he had found no news despite having searched the entire Wu Tan City for six months had ended up in his hands not long after beginning his travels. This unexpected gain was something that filled Xiao Yan’s heart with happiness.\u003c/p\u003e\n\u003cp\u003e“Do you also recognise this?” Eyeing at how Xiao Yan was excitedly staring at the Ice Spirit Blazing Grass, the Fairy Doctor asked with a surprised voice.\u003c/p\u003e\n\u003cp\u003e“Um. This is something I need.” Xiao Yan nodded his head before tilting to gaze at the Fairy Doctor.\u003c/p\u003e\n\u003cp\u003e“What an unlikable person. Choosing the most valuable one straight off the bat.” Hearing Xiao Yan’s words, the Fairy Doctor immediately raised her eyebrows and muttered in an unwilling manner.\u003c/p\u003e\n\u003cp\u003eSmiling embarrassingly, Xiao Yan waved his hand, “I’m sorry but I really need it. I’ve been searching for it for quite awhile.”\u003c/p\u003e\n\u003cp\u003eSeeing that the Fairy Doctor still appeared depressed, Xiao Yan could only helplessly said, “Why don’t we do it like this. I will take the Ice Spirit Blazing Grass. As for the remaining medicinal herbs here, you will take two thirds and I will take the remaining one third.”\u003c/p\u003e\n\u003cp\u003eHearing Xiao Yan’s suggestion, the Fairy Doctor nodded her head, the color of her face appearing slightly better.\u003c/p\u003e\n\u003cp\u003eXiao Yan let out a breath when he saw the Fairy Doctor nodded her head. Without worrying about drawing suspicion, he extracted many exquisite jade bottles from his storage ring and a jade shovel. He carefully dug away the soil surrounding the Ice Spirit Blazing Grass and finally placed the plant, together with the soil into a jade bottle.\u003c/p\u003e\n\u003cp\u003e“Hu….” Xiao Yan quickly stored the jade bottle into his storage ring before opening the corner of his mouth and smiling. After which, he handed the jade shovel to the Fairy Doctor indicating for her to dig out the medicinal plants.\u003c/p\u003e\n\u003cp\u003eThe Fairy Doctor’s eyes followed the Ice Spirit Blazing Grass as Xiao Yan stored it into his storage ring before unwillingly withdrawing her gaze. For someone like her who loved medicine, obtaining one exceedingly rare medicinal plant would make her far happier than obtaining hundreds of thousands of money or pieces of jewelry.\u003c/p\u003e\n\u003cp\u003eThe Fairy Doctor sighed, feeling very vexed inside. Had this guy not accidentally discovered the secret on the cliff, all of this would have belonged to her. But now… alas, recalling this caused her to feel an urge to cry but her tears was not forthcoming.\u003c/p\u003e\n\u003cp\u003e“You should just go and die, bastard.”\u003c/p\u003e\n\u003cp\u003eAfter cursing, the Fairy Doctor received the shovel from Xiao Yan and began to carefully dig out the precious medicinal plants from the flowerbed before placing them into the jade bottles.\u003c/p\u003e\n\u003cp\u003eAfter eyeing the Fairy Doctor digging out the medicinal plants, Xiao Yan’s gaze once again roamed throughout the room but he spotted nothing of interest. Finally, he returned his gaze back to the three stone containers placed in the middle of the room.\u003c/p\u003e\n\u003cp\u003eXiao Yan slowly walked towards the front of the stone table and touched the metal lock. He felt some warmth as his skin made contact, causing him to frown. For it to be able to retain warmth over such a long time, the lock was definitely not made of an ordinary metal. It would be pointless to try to forcefully break it.\u003c/p\u003e\n\u003cp\u003e“Where’s the key?” Xiao Yan muttered to himself as he scanned around. His eyes soon fell onto the skeleton seated behind the stone table. When he lowered his gaze, his eyes brightened as he found three black keys hanging from its hand.\u003c/p\u003e\n\u003cp\u003eRubbing his hands, Xiao Yan stepped forward and stared at the skeleton. Disgust filled his heart as he slowly unclenched his fist before carefully grabbing the keys and pulled lightly.\u003c/p\u003e\n\u003cp\u003e“Crack…” Due to the years that had passed, the small force managed to break the skeleton’s arm, causing it to fall.\u003c/p\u003e\n\u003cp\u003eSeeing the broken skeleton hand, Xiao Yan smiled awkwardly before bowing to the remaining skeleton. After which. Xiao Yan bent to pick up the broken arm, intending to replace it.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s hand wrapped around the skeleton arm when his eyebrows suddenly rose. He could feel that the weight of this bone was a little unnatural…\u003c/p\u003e\n\u003cp\u003eFrom the corner of his eyes, Xiao peeked at the Fairy Doctor who was carefully digging up the medicinal plants before returning to the skeleton bone in his hand. His eyes observed the broken portion at the top only to discover that there was a small scroll hidden within the gap of the bone. Eyeing the stealthily hidden scroll, Xiao Yan swallowed his saliva as his finger involuntarily reached inwards and swiftly pulled it out before throwing it into his storage ring.\u003c/p\u003e\n\u003cp\u003eOnly after the scroll was in his storage ring did Xiao Yan sigh in relief. He swept the dust from the skeleton arm before placing it back on its original position,\u003c/p\u003e\n\u003cp\u003eXiao Yan grinned, flung the keys in his hands and slowly headed to the three stone containers on the stone table.\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-115\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-117\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-116","bookId":1497,"creation":"Sep 10, 2019 3:24:52 AM","modification":"Sep 10, 2019 3:24:52 AM"}
