{"id":47810,"no":1176,"title":"Chapter 1176: Mediating the Core Soul Marrow","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1176: Mediating the Core Soul Marrow\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis green-colored rock appeared like an ordinary rock when looking at it from a distance. However if one approached it, one would be able to discover that the stone was covered in some strange lines. Moreover, the surface of the stone was slightly transparent. If one were to place it in an area of strong sunlight, one would vaguely be able to see a viscous liquid flowing inside…\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyes paused on the green-colored rock for a moment. He finally let out a gentle breath of air. After which, he slowly suppressed the joy within his heart. He bent down and carefully picked up this palm-sized green-colored rock with his hand.\u003c/p\u003e\n\u003cp\u003eA warm-cool feeling was transmitted to his hand when it came in contact with this green-colored rock. He gently shook it and the faint feeling of shaking water was emitted.\u003c/p\u003e\n\u003cp\u003e“Heavenly Numb Jade Essence…”\u003c/p\u003e\n\u003cp\u003eXiao Yan focused his mind and observed this green-colored rock for awhile. Only then did he finally become certain that this thing was the final thing he needed!\u003c/p\u003e\n\u003cp\u003e“This is indeed worthy of being the Ten Thousand Medicinal Mountain Range…” Xiao Yan carefully stored this Heavenly Numb Jade Essence into his Storage Ring. He involuntarily exhaled a breath of air. If he were to search for this thing in the outside world, it was likely that he would need to spend a great amount of effort to obtain it. However, all he needed to do here was bend his body and search this place.\u003c/p\u003e\n\u003cp\u003eXiao Yan finally turned around after obtaining the last item. He looked at Zi Yan. She was seated on the rock stairs by the side of the square. He involuntarily smiled at her.\u003c/p\u003e\n\u003cp\u003e“Have you found it?” Zi Yan braced her attention and hurriedly asked when she saw Xiao Yan walk over.\u003c/p\u003e\n\u003cp\u003eXiao Yan smiled and nodded.\u003c/p\u003e\n\u003cp\u003e“When are you leaving?” Zi Yan asked in an excited manner. She had already stayed in this Pill Realm for some days. Although there were many nice foods to eat here, it lacked liveliness when compared to the Dou Qi continent.\u003c/p\u003e\n\u003cp\u003e“Help me find a secret chamber. I will need to prepare some things.” Xiao Yan’s expression became slightly solemn when he replied. The Core Soul Marrow was something that was extremely difficult to find. If he were to fail to prepare it properly this time around, he did not know when he would be able to obtain such a treasure again. Therefore, he did not dare take the preparations lightly.\u003c/p\u003e\n\u003cp\u003eZi Yan obediently nodded when she saw Xiao Yan’s grave face. She led Xiao Yan across the square and found a hidden rock chamber deep within the stone hall.\u003c/p\u003e\n\u003cp\u003e“Do not allow anyone to interrupt me before I come out…” Xiao Yan walked into the stone chamber before solemnly reminding Zi Yan.\u003c/p\u003e\n\u003cp\u003e“Aye, relax.” Zi Yan heavily nodded her head.\u003c/p\u003e\n\u003cp\u003eXiao Yan finally relaxed after seeing her nod her head. He slowly walked into the stone chamber. After which, the stone door emitted a banging sound before it was tightly shut…\u003c/p\u003e\n\u003cp\u003eThe stone chamber was not spacious, but it was large enough for what he was going to do. A warm light scattered down from all directions, expelling the darkness within the stone chamber.\u003c/p\u003e\n\u003cp\u003eXiao Yan swiftly arrived at the stone bed of the stone chamber. After which, he sat cross-legged. However, he did not immediately act. Instead, both of his eyes were shut as he adjusted the ripple in his heart and his own condition.\u003c/p\u003e\n\u003cp\u003eWhether the Core Soul Marrow was successfully prepared would determine if Xiao Yan would advance to the eighth tier! Therefore, he could not even be slightly distracted.\u003c/p\u003e\n\u003cp\u003eXiao Yan shut his eyes. This continued for nearly half an hour before he finally opened them. His dark-black eyes were just like an old well with no ripples. They were just like an immeasurable pit…\u003c/p\u003e\n\u003cp\u003eA breath was slowly exhaled through Xiao Yan’s throat. After which, his hand rubbed the empty space in front of him, and three jade boxes surfaced there. He flicked his finger and a box was opened. An unusual fragrance diffused into the room, causing Xiao Yan to brace his attention.\u003c/p\u003e\n\u003cp\u003eAmong the three things, the Core Soul Marrow and the Pill Spirit Serum could be prepared without refinement. One only needed to control the quantity properly. It was necessary to refine the stone essence within the Heavenly Numb Jade Essence in order to use it…\u003c/p\u003e\n\u003cp\u003eThe refinement was not a difficult task, especially to the current Xiao Yan. He immediately beckoned with his hand and the green stone drifted out. After which, it remained suspended in front of Xiao Yan.\u003c/p\u003e\n\u003cp\u003eXiao Yan glanced at the Heavenly Numb Jade Essence in front of him. After which, he widened his mouth and a jade-green-colored flame was spat out. Subsequently, it wrapped around the ingredient…\u003c/p\u003e\n\u003cp\u003eThe flame had just appeared when the temperature was raised to an extremely intense level under Xiao Yan’s control. Within less than half a minute, numerous cracks appeared on the surface of the Heavenly Numb Jade Essence. There was a vague scent scattering out of it.\u003c/p\u003e\n\u003cp\u003eXiao Yan nodded slightly upon seeing this. He suddenly flicked his finger and a slight force knocked on the Heavenly Numb Jade Essence. After which, it emitted a cracking sound and pieces of rock fragments fell from it. Finally, a hidden faint-white slurry was revealed.\u003c/p\u003e\n\u003cp\u003eFollowing the appearance of this kind of white-colored slurry, Xiao Yan gradually lowered the temperature of the flame. It eventually transformed into a wisp that burned underneath the rock. It appeared just like a flame grilling a stone bowl with some white-colored liquid in it. This liquid was churning and forming a slight bubble. A faint fishy smell rose each time a bubble burst apart…\u003c/p\u003e\n\u003cp\u003eThis fishy smell was the smell of the impurities leaving the stone essence. Only by refining it would it be possible to use it to mediate the Core Soul Marrow.\u003c/p\u003e\n\u003cp\u003eThis kind of refinement did not exhaust much of Xiao Yan’s time. Within a dozen plus minutes, the fishy scent was completely expelled from the white-colored slurry…\u003c/p\u003e\n\u003cp\u003eXiao Yan’s expression did not change after refining the stone essence. He waved his hand. An exquisite jade bottle and some utensils appeared in his hand. After which, a thought passed through his mind as a tiny thread of liquid surged out of the three jade boxes in front of him. Finally, they gathered in a transparent jade bowl under Xiao Yan’s control.\u003c/p\u003e\n\u003cp\u003e“Sizzle sizzle!”\u003c/p\u003e\n\u003cp\u003eA wave of faint smoke erupted when the three types of liquid made contact. Immediately, they appeared to be hostile with each other. After which, they eroded each other. Some tiny bubbles were continuously emitted when they made contact.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyes did not slip away as he focused on the erosion of the three types of liquids. A moment later, the Pill Soul Serum and the stone essence completely scattered. All that remained was a kind of somewhat mottled Core Soul Marrow…\u003c/p\u003e\n\u003cp\u003e“The volume of the Core Soul Marrow has increased…”\u003c/p\u003e\n\u003cp\u003eXiao Yan gently shook his head upon seeing this. Based on what was recorded on the medicinal formula, successfully refined Core Soul Marrow would be completely jade-green in color. Currently, the Core Soul Marrow that had been refined was a somewhat mottled color. Clearly, it was a failed product.\u003c/p\u003e\n\u003cp\u003eXiao Yan did not feel disheartened after this first failure. If he managed to succeed on his first try, his luck would have been a little too good. However, he felt a little heartache. The Core Soul Marrow was too precious. If he failed a couple more times, even he would feel his heart start to bleed.\u003c/p\u003e\n\u003cp\u003eThere was not much of a change in what happened next. Xiao Yan still continued to monotonously guess the concentration of the mixture of the three types of treasures. If there was something a little more or less in this kind of mixture, the equilibrium among the three types of liquid would break. Finally, it would end up a failure. Therefore, no fluctuations could occur in one’s heart because of failure during the refinement.\u003c/p\u003e\n\u003cp\u003eXiao Yan had failed in mediating the three types of natural treasures eleven times. These eleven failures had also exhausted nearly one-third of these treasures…\u003c/p\u003e\n\u003cp\u003eAlthough this price was steep, it was not possible to see any anxiety on Xiao Yan’s face. He became increasingly familiar with the preparation method. The increase and reduction of the quantity was no longer done with any hesitation like before.\u003c/p\u003e\n\u003cp\u003eWith Xiao Yan’s current refinement level, it was likely that one could count the number of people of the same generation who surpassed him on one’s fingers. Naturally, his focus would not be disturbed by this kind of failure. After all, if he failed to even endure this, how would he be able to compete with all the experts in the Pill Gathering?\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyes watched the interior of the jade bowl. Three different-colored liquids gathered at the tip of his finger. Once the quantity of the jade bowl was reduced, he would swiftly add a little more as he tried his best to maintain the equilibrium within.\u003c/p\u003e\n\u003cp\u003eAfter a couple of failures, the liquid within the jade bowl was becoming clearer. There was even a faint fragrance spreading from the mixture.\u003c/p\u003e\n\u003cp\u003eWhen he sniffed this scent, a ripple finally surfaced within Xiao Yan’s eyes, which had been completely void of any emotion earlier. A finger gently trembled and a drop of stone essence slowly fell into the jade bowl.\u003c/p\u003e\n\u003cp\u003e“Sizzle!”\u003c/p\u003e\n\u003cp\u003eWaves of faint smoke rose from the jade bowl after this drop of stone essence fell into it. After the smoke passed, a small bowl of jade-like, viscous liquid, filled with life, remained…\u003c/p\u003e\n\u003cp\u003e“Hu…”\u003c/p\u003e\n\u003cp\u003eXiao Yan involuntarily sighed in relief as he looked at the color of the liquid within the jade bowl. After which, he carefully used a good jade bottle to save the slurry within the bowl…\u003c/p\u003e\n\u003cp\u003eOf course, if Xiao Yan wished to get his soul to undergo a transformation, this little bit of Core Soul Marrow that he had prepared was insufficient. However, with the first success, the subsequent steps would obviously be much easier. Within a short two hours, over half of the remaining three types of natural treasures had been successfully mixed by Xiao Yan…\u003c/p\u003e\n\u003cp\u003eA pleased expression finally flashed across Xiao Yan’s face as he looked at the jade-colored liquid filling the bottle to its brim. Although he had failed many times, the amount he had successfully produced was already enough for him to squander…\u003c/p\u003e\n\u003cp\u003e“Next will be the most important thing…”\u003c/p\u003e\n\u003cp\u003eXiao Yan held the jade bottle. He inhaled a deep breath of air. If this transformation succeeded, he would be able to successfully advance to the eighth tier before the Pill Gathering began. At that time, he would truly possess the qualification and ability to take the champion spot!\u003c/p\u003e\n\u003cp\u003e“In order to get the Three Thousand Burning Flame, I must succeed no matter what!”\u003c/p\u003e\n\u003cp\u003eA fierceness flashed across Xiao Yan’s eyes as he raised the jade bottle and poured it into his mouth. He raised his head and nearly half of the Core Soul Marrow followed his throat as it flowed into his body with a gurgling noise.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s head let out a buzzing sound as the Core Soul Marrow was poured into his body. The Spiritual Strength between his brows seemed to have ate a catalyst at this moment as it suddenly swelled. The swiftness and fierceness of the swelling caused an intense pain to be transmitted from between Xiao Yan’s brows, as though his mind was about to explode at this moment!\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1175\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1177\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1176","bookId":1497,"creation":"Sep 10, 2019 3:24:54 AM","modification":"Sep 10, 2019 3:24:54 AM"}
