{"id":47854,"no":1220,"title":"Chapter 1220: Big Battle","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1220: Big Battle\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA slight quiet shuffling sound appeared within the quiet mountain valley. A black torrent rolled down the slope. The speed of the flow was extremely rapid. Within less than half a minute, it had already approached the surroundings of the enormous hall that sat within the mountain valley…\u003c/p\u003e\n\u003cp\u003eOne could vaguely see some seated black figures on some stone pillars around the large black hall. These figures lingered within the black fog. A dense dark aura spread as it swallowed and spat.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eAs the torrent swiftly approached, a human figure that was completely wrapped within a black fog suddenly let out a shocked exclamation. The black fog rippled and revealed a somewhat pale face. He frowned and looked at the dark black things which were spreading like black water a short distance away. He was initially startled before a horror surged into his eyes. He hurriedly stood up and cried out sternly, “Be careful. It’s the Stone Swallowing Demon Ants. How did these things get in here?”\u003c/p\u003e\n\u003cp\u003eThe stern cry that suddenly sounded directly broke the silence of the valley. Over a dozen black fog figures hurriedly got up. Their expressions were stunned as they looked at the black ant tide that swiftly surged over.\u003c/p\u003e\n\u003cp\u003e“Sound the warning!”\u003c/p\u003e\n\u003cp\u003eA black figure cried out in a deep voice. Soon after, a sharp sonic wave was emitted from his mouth. After which, it was swiftly transmitted into the large hall that appeared like a giant prehistoric beast.\u003c/p\u003e\n\u003cp\u003e“Swoosh swoosh swoosh!”\u003c/p\u003e\n\u003cp\u003eThis warning that had just been emitted when quite a number of black figures continuously rushed out from the huge hall. Their expressions changed when they saw the ant tide that came from all directions.\u003c/p\u003e\n\u003cp\u003e“Everyone, we’ll attack together and eliminate all of these things. Do not interrupt the rest of the Honorable Elders.”\u003c/p\u003e\n\u003cp\u003eA black clothed person, who appeared to have quite a high position, frowned and looked at the ant tide below. After which, he cried out in a deep voice.\u003c/p\u003e\n\u003cp\u003e“Understood, Protector Liu!”\u003c/p\u003e\n\u003cp\u003eThe hundred black figures that had gathered below responded in usion after hearing this. Immediately, numerous strange black fog surged out from their bodies. After which, the swiftly spread towards the ant tide.\u003c/p\u003e\n\u003cp\u003eChi chi!\u003c/p\u003e\n\u003cp\u003eA white fog erupted from the body of many Stone Swallowing Demon Ants when they made contact. Immediately, it was swiftly eroded by the black fog. However, the numbers in the ant tide was really too terrifying. Even though the black fog was dense, it was still difficult to block the ants attacking momentum.\u003c/p\u003e\n\u003cp\u003eThe frown of the black clothed person in the sky, who was called Protector Liu, became even tightly. This valley had the spatial barrier placed by the Honorable Elders. How could these things barge in?\u003c/p\u003e\n\u003cp\u003e“What happened? Why is there such a great activity?” While Protector Liu was frowning, a couple of black figures came rushing out from within the large hall. They had just posed the question when they saw the Stone Swallowing Demon Ants surging over from all directions. Their expressions immediately changed.\u003c/p\u003e\n\u003cp\u003e“Stone Swallowing Demon Ants? How did they barge in?”\u003c/p\u003e\n\u003cp\u003eA dark and solemn looking man knitted his brows. His eyes suddenly swept over this valley and an uneasiness suddenly rose in his heart. He cried in a deep voice, “Something’s wrong, everyone be…”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eHe had yet to finish speaking when the space around him suddenly became distorted. Immediately, a ruthlessly flame formed an invisible handprint that forcefully crushed him into a cluster of meat.\u003c/p\u003e\n\u003cp\u003e“Enemy attack! Enemy attack!”\u003c/p\u003e\n\u003cp\u003eWithin an instant, a person had turned into a cluster of blurry pile of meat. Those couple of Hall of Souls Protectors recovered only a moment later from such a sudden change. A shocked expression immediately surged onto their faces. Sharp scream resounded within the valley!\u003c/p\u003e\n\u003cp\u003e“Chi chi!”\u003c/p\u003e\n\u003cp\u003eA screech had just sounded when a sharp sword aura suddenly rushed down from the sky. After which, they shot through the two Hall of Souls protectors with lightning like speed and brought about a sharp scream. The sword aura also slashed through some stone pillars outside of the large hall.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThe sharp sword aura had just fell when the space became slightly distorted. Immediately, a couple of figures slowly surfaced in front of the many experts from the Hall of Souls. After which, a vast and mighty aura erupted without being held back at this moment.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eFour Dou Zun experts erupted at the same time. The aura directly caused sand and stone to fly within the valley. A powerful pressure spread from the sky and caused the expressions of some experts from the Hall of Souls to change drastically.\u003c/p\u003e\n\u003cp\u003e“Ha ha, you bastards from the Hall of Souls. It is time you pay your debt today!”\u003c/p\u003e\n\u003cp\u003eA loud laughter sounded in the sky. Immediately, a couple of vast and mighty wind rushed down from the sky. After which, it forcefully slammed over a dozen experts from the Hall of Souls into the soil. The terrifying force had destroyed all of them at that instant until they scattered to the winds.”\u003c/p\u003e\n\u003cp\u003e“Ha ha, charge!”\u003c/p\u003e\n\u003cp\u003eA couple of figures rushed down from the sky. They were just like tigers entering a sheep herd. Even those protectors, who usually acted high and mighty, could only hurriedly withdraw in shock in the face of this wolf and tiger like fierce group. They had never expected that there would actually be someone bold enough to take the initiative in attacking their Hall of Souls…\u003c/p\u003e\n\u003cp\u003e“You dare cause trouble in my Hall of Souls? Are you seeking death?”\u003c/p\u003e\n\u003cp\u003eThe continuously screech that resounded over the valley had finally attracted the attention of the Honorable Elders within the hall. Immediately, a furious roar sounded. Soon after, five figures, who were covered with killing aura, rushed out from within the large hall. Their eyes swept over the place before finally pausing on Xiao Yan.\u003c/p\u003e\n\u003cp\u003e“Xiao Yan? You haven’t died?”\u003c/p\u003e\n\u003cp\u003eXiao Yan involuntarily raised his head upon hearing this familiar voice. He looked at the five figures in the sky. Purple-brown flames surged out from his hand and he grabbed an expert from the Hall of Souls before burning him into nothingness. After which, he laughed faintly, “Old demon Mu Gu, it is unexpected that you are also here…”\u003c/p\u003e\n\u003cp\u003e“You have come for Yao Chen, right? It must be said that the courage of your group is really boundaryless. You actually dare to snatch someone from my Hall of Souls? This is the first time the old me has met with such a thing after becoming an Honorable Elder.” A black clothed person lifted the Doupeng above his head and spoke in a dark voice. From the looks of his appearance, he was Old Mu Gu.\u003c/p\u003e\n\u003cp\u003e“Tsl tsk, it is unexpected that there is a familiar person. Feng zun-zhe, you have really not given up…” A black clothed Dou Zun suddenly laughed in a dark and cold manner beside Old Mu Gu.\u003c/p\u003e\n\u003cp\u003eFeng zun-zhe laughed faintly upon hearing this. He glanced at the anti tide that had already surged into the large hall before turning his head to Xiao Yan and said, “Go in and find Yao Chen. We will delay them.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eXiao Yan nodded. His body moved and he rushed into the large hall.\u003c/p\u003e\n\u003cp\u003e“You actually dare randomly charge around my Hall of Souls? You are seeking death!”\u003c/p\u003e\n\u003cp\u003eThe five Dou Zuns from the Hall of Souls in the sky immediately cried out coldly upon seeing this. A Dou Zun directly tossed out a vast and mighty black fog. This fog was just like a black snake that whizzed through the sky and rushed towards Xiao Yan.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eFeng zun-zhe’s figure surfaced beside Xiao Yan. He clenched his hand and a wild wind suddenly appeared. After which, it forcefully shattered the majestic black fog. He cried out in a deep voice.\u003c/p\u003e\n\u003cp\u003e“Today, the few of us shall see whether your group has this qualification!”\u003c/p\u003e\n\u003cp\u003eThe couple of Dou Zuns laughed angrily. After which, they rushed down swiftly. One of them was separated from the others and he collided with Feng zun-zhe while carrying a sharp killing aura all over his body. Both parties immediately erupted into a fiery hot battle.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s body moved upon seeing this. After which, he rushed down the midair. His body transformed into a black line that swiftly rushed towards the large hall. Just when it was about to enter the large door, the space in front of them wiggled and an old man in pale-purple coloured robes appeared in front of them without any expression.\u003c/p\u003e\n\u003cp\u003e“You are Xiao Yan? Do you still remember this venerable self?” The purple clothed old man looked at Xiao Yan in an expressionless manner and asked.\u003c/p\u003e\n\u003cp\u003eXiao Yan narrowed his eyes. He could sense a familiar feeling from the other party.\u003c/p\u003e\n\u003cp\u003e“You are that old bastard who had destroyed my Spiritual Strength twice?” Xiao Yan smiled as he finally remembered. When his Spiritual Strength had twice arrived at the Hall of Souls after having broken through his class, he was discovered by this old fellow and was expelled from the hall by the latter.\u003c/p\u003e\n\u003cp\u003e“The old me has underestimated you. Within a short couple of years you have actually trained until the nine star Dou Zong level… unfortunately, however, you have come to the Hall of Soul to snatch someone. It is fated that you will be forever buried here.”\u003c/p\u003e\n\u003cp\u003eThe expression of the purple-clothed old man turned dark and cold. His voice had just sounded when his sleeves suddenly fluttered. Xiao Yan\u0027s footsteps quickly took two steps back and purple-brown flame surged out from his palm. The Dou Qi within his body was suddenly spluttered out without being held back at this moment.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eXiao Yan did not directly withdraw this time around. Sharp palm wind that was accompanied by the purple-brown Three Thousand Lotus Heart Flame ruthlessly collided with that palm from the purple clothed Dou Zun.\u003c/p\u003e\n\u003cp\u003eFrightening wind swept out as the two collided. It shook the surrounding few Hall of Souls guards nearby until they turned into nothingness. That enormous stone pillar also had numerous cracked lines over it.\u003c/p\u003e\n\u003cp\u003e“Clatter clatter.”\u003c/p\u003e\n\u003cp\u003eAlthough Xiao Yan had circulated the Dou Qi within his body to the maximum and he even had the Three Thousand Lotus Heart Flame, he still ended up taking over ten steps back before stabilizing his body. His brows were knitted. An elite Dou Zun was indeed strong.\u003c/p\u003e\n\u003cp\u003eCompared with the frown of Xiao Yan, the expression of the purple clothed Dou Zun was especially ugly. There was a faint shock within his eyes.\u003c/p\u003e\n\u003cp\u003eWhen Xiao Yan’s Spiritual Strength had secretly sneaked into the Hall of Souls for the first time back then, all this Dou Zun needed to do was to think about it and his Spiritual Strength had been scattered. On the second time, he needed to reveal himself and attack in order to destroy that Spiritual Strength. However, on this third time, Xiao Yan was actually able to rely on his own Dou Zong strength to fight his palm head on without being injured. This kind of soaring like transformation caused a faint chillness to involuntarily surge in his heart…\u003c/p\u003e\n\u003cp\u003e“No matter how great you are, this place will be the place you die today…”\u003c/p\u003e\n\u003cp\u003eMurderous intent surged within the eyes of the purple clothed Dou Zun as he inhaled a deep breath of air. Xiao Yan was able to receive one attack by him but he did not believe that the former would really be able to escape from his hands!\u003c/p\u003e\n\u003cp\u003eThis thought flashed across the heart of the purple clothed Dou Zun as his body moved. After which, he transformed into a lightning that once again rushed towards Xiao Yan. Just when his body had just moved, a dark golden figure descended from the sky like a metal tower. It landed in front of Xiao Yan and blocked this attack of the purple clothed Dou Zun.\u003c/p\u003e\n\u003cp\u003e“Your opponent is not me. It’s it…”\u003c/p\u003e\n\u003cp\u003eXiao Yan faced the purple clothed Dou Zun and smiled. Silver glow flashed under his feet as he directly took the opportunity to sneak into the interior of the large hall. The purple clothed Dou Zun wanted to block him but the Sky Demon Puppet in front of him caused him to be afraid of being distracted. Immediately, he cried out furiously.\u003c/p\u003e\n\u003cp\u003e“Protectors of the Hall of Souls, stop that brat! I don’t care if he’s dead or alive!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1219\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1221\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1220","bookId":1497,"creation":"Sep 10, 2019 3:24:54 AM","modification":"Sep 10, 2019 3:24:54 AM"}
