{"id":47975,"no":1341,"title":"Chapter 1341: Opening of the Heavenly Tomb","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1341: Opening of the Heavenly Tomb\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA beautiful figure shot to the top of the green mountain with lightning speed. Within a couple of flashes, she had appeared in front of Xiao Yan. Her pretty eyes were filled with worry.\u003c/p\u003e\n\u003cp\u003e“Xiao Yan ge-ge, are you alright? Earlier…”\u003c/p\u003e\n\u003cp\u003eXiao Yan grinned and shook his head. He studied Xun Er’s tense face and said, “Ugh, that person earlier was your father, clan head Gu Yuan.”\u003c/p\u003e\n\u003cp\u003e“I knew it!” Xun Er knit her brows. Her tone faintly contained some fury. It was unexpected that even her father could not resist revealing himself after those fellows had unveiled their faces one after another.\u003c/p\u003e\n\u003cp\u003e“Ha ha, clan head Gu Yuan did not say anything to stop the two of us. He only discussed some matters related to the Xiao clan.” Xiao Yan smiled and defended Gu Yuan.\u003c/p\u003e\n\u003cp\u003e“Is it true? He didn’t talk about the matter between us?” Xun Er was slightly startled. Clearly, she felt very surprised.\u003c/p\u003e\n\u003cp\u003eXiao Yan rubbed his nose. He suddenly approached Xun Er’s delicate ear and softly uttered a couple of sentences. Xun Er’s elegant face immediately turned bright-red when she heard his soft voice. Her pretty eyes cut Xiao Yan in a lovely and displeased manner. However, her expression had relaxed a little. Gu Yuan possessed an extremely high position within the Gu clan. If even he opposed their relationship, she would really end up in a dilemma. She was very unwilling to deal with that kind of situation.\u003c/p\u003e\n\u003cp\u003e“Let’s return first. Xiao Yan ge-ge, you already possess one of the spots to enter the Heavenly Tomb. All you need to do is wait for two days now and we will be able to enter it together.” Xun Er gently pulled Xiao Yan’s hand as she informed him with a smile.\u003c/p\u003e\n\u003cp\u003eJoy flashed across Xiao Yan’s eyes when he heard her words. He was worried that the Elders within the Gu clan would come up with reasons to prevent him from entering the Heavenly Tomb. After hearing what Xun Er had said, it was obvious that this problem had been resolved.\u003c/p\u003e\n\u003cp\u003e“Thank you very much Xun Er…”\u003c/p\u003e\n\u003cp\u003eXiao Yan’s hand gently rubbed her warm jade-like hand as he softly thanked her. He guessed that Xun Er had helped him again. His act of hurrying to the Gu clan today was related to this.\u003c/p\u003e\n\u003cp\u003eXun Er hinted at a smile. She twisted her delicate and gentle waist. Her face contained a bright redness as she gently leaned on Xiao Yan’s shoulder. She shut her pretty eyes as she greedily inhaled the warm air that caused her to feel relaxed.\u003c/p\u003e\n\u003cp\u003eA warmth rose within Xiao Yan’s heart as studied the person in his embrace. His hand gently rested on a delicate waist. At the same time, his head was buried in soft black hair. Upon inhaling a faint fragrance, it appeared as though his fatigue had gradually disappeared.\u003c/p\u003e\n\u003cp\u003eGu Yuan’s body slowly appeared in the empty sky above. He observed the man and woman embracing each other on the mountain top and involuntarily sighed. After which, his body moved, and he once again disappeared…\u003c/p\u003e\n\u003cp\u003e“Xiao Xuan, you are still the superior one…”\u003c/p\u003e\n\u003cp\u003eAll agony seemed to have been abandoned within this pleasant country scene. Two days swiftly passed amid this quiet life…\u003c/p\u003e\n\u003cp\u003eNo one from the Gu clan came to disturb Xiao Yan’s group during these two days. This kind of peace and quiet was wonderful. However, this silence could not last for long. When the morning light of the third day scattered down from the sky, an unusual atmosphere began to spread over the mountain range. Even Xiao Yan’s group felt it…\u003c/p\u003e\n\u003cp\u003e“Today is the day that the Heavenly Tomb will open…”\u003c/p\u003e\n\u003cp\u003eXun Er stood in front of the bamboo house and uttered these words to Xiao Yan.\u003c/p\u003e\n\u003cp\u003eXiao Yan grinned. Xun Er beckoned with her hand, and the snow-white single-horned beast flew out of the mountain forest. Xiao Yan’s group quickly got onto it with a familiarity. Finally, the single-horned beast flapped both its wings and flew to the east after Xun Er gave a soft whistle.\u003c/p\u003e\n\u003cp\u003e“The Heavenly Tomb will open deep within the Gu Sacred Mountain Range. That place are a forbidden grounds of the Gu clan. No one is allowed to enter them normally. It will only open when the Heavenly Tomb is opened.”\u003c/p\u003e\n\u003cp\u003eA gentle breeze blew over the single-horned beast’s back and lifted Xun Er’s black hair, which extended all the way to her delicate waist. At the same time, she was explaining things to Xiao Yan’s group.\u003c/p\u003e\n\u003cp\u003e“There is some danger within the Heavenly Tomb. A countless number of experts from ancient times are buried within it. Although their souls have already disappeared, the energy from when they were alive have transformed into their past appearances due to the mysteriousness of the Heavenly Tomb. This energy is filled with an extremely powerful offensive strength. Moreover, they also know their Dou Skills from when they were alive. It will be extremely difficult to deal with them…” Xun Er’s expression became a little grave when she mentioned the interior of the Heavenly Tomb. She said, “Therefore, if one ends up meeting an overly powerful energy body, it is best to try and avoid it. It is rumored that some experts with extremely great strength when they were alive have produced energy bodies with some intelligence. They could even be considered a mysterious living creature…”\u003c/p\u003e\n\u003cp\u003e“A living creature that has been transformed from the dead, huh.” Xiao Yan thought aloud. The overly great strength from when these people were alive and the mysterious effects of the Heavenly Tomb were the reasons why such a strange occurrence happens.\u003c/p\u003e\n\u003cp\u003e“The Heavenly Tomb is divided into three levels. The energy bodies on the first level are mostly three star Dou Zuns or weaker. They drift around without any consciousness and are not very difficult to deal with. The second level’s energy bodies are between a three and eight star Dou Zun. They are quite troublesome to deal with. As for the third level, those are genuinely at the peak of the Dou Zun class. There are even some ultimate experts who have reached the Dou Sheng class when they were alive… normally speaking, seldom anyone barges into the third level without absolute confidence. That place is too dangerous.” Xun Er slowly explained.\u003c/p\u003e\n\u003cp\u003e“The tomb of my ancestor, Xiao Xuan, is in the third level?” Xiao Yan asked.\u003c/p\u003e\n\u003cp\u003e“This… it is rumored that it is in the deepest part of the third level. However, seldom anyone dares to enter that place even from our Gu clan…” Xun Er helplessly replied.\u003c/p\u003e\n\u003cp\u003e“It is actually so troublesome…”\u003c/p\u003e\n\u003cp\u003e“There will definitely be a path when we get there. Let’s enter the Heavenly Tomb before discussing our plans.”\u003c/p\u003e\n\u003cp\u003eXiao Yan felt much calmer after this thought flashed across his heart. After which, he asked Xun Er about information related to the Heavenly Tomb.\u003c/p\u003e\n\u003cp\u003eThe single-horned beast gradually traveled deep into the mountain range while the two of them were chatting. Xiao Yan’s group had met some people who were hurrying to this place along the way. They were mostly experts from the other six clans and some Gu clan experts. Although they had met them, there were not many conversations. Only the clan members from the Gu clan respectfully greeted Xun Er from a distance before they swiftly left.\u003c/p\u003e\n\u003cp\u003eThe flying continued for around ten minutes before the single-horned beast finally stopped by some steep mountains. At this moment, quite a number of figures had gathered here. Xiao Yan’s eyes swept over, only to see quite a number of familiar figures.\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyes suddenly hardened as they swept across the surrounding mountains. Three black-robed figures were suspended in the empty air where his gaze froze A dark and cold aura slowly spread from the bodies of these three.\u003c/p\u003e\n\u003cp\u003e“Hun Ya…”\u003c/p\u003e\n\u003cp\u003eXiao Yan’s eyes narrowed when he saw these three people. The fist under his sleeve was slowly tightened.\u003c/p\u003e\n\u003cp\u003e“Xiao Yan ge-ge, be careful of the person leading those from the Hun clan. He is called Hun Ya. It is rumored that he is quite renowned among the members of the younger generation from the Hun clan, and he is extremely difficult to deal with. He is likely going to be entering the Heavenly Tomb. You should be more careful if you meet him in the Heavenly Tomb.” Xun Er whispered beside Xiao Yan’s ear.\u003c/p\u003e\n\u003cp\u003e“Aye, I have already met him…”\u003c/p\u003e\n\u003cp\u003eXiao Yan nodded. He was naturally aware of just how strong Hun Ya was. From his guess, this person was likely as difficult to deal with as Gu Yao. Those geniuses within the clans with long history did indeed possess true strength. They were not the same level as those useless geniuses outside.\u003c/p\u003e\n\u003cp\u003e“The members from the Ling clan from the eight clans did not arrive this time around. That group to the south-east is from the Yao clan…”\u003c/p\u003e\n\u003cp\u003e“Oh? A thought passed through Xiao Yan’s heart. He glanced where Xun Er pointed and saw a couple of figures suspended in the air. There was a medicinal cauldron image on their foreheads.\u003c/p\u003e\n\u003cp\u003eA man, who was leading those from the Yao clan, sensed something when Xiao Yan’s eyes landed on this group. He tilted his head and shifted his eyes to Xiao Yan. He was briefly startled before an unfriendly smile was lifted onto his face.\u003c/p\u003e\n\u003cp\u003eXiao Yan narrowed his eyes when he saw this gaze. It seemed that the people from the Yao clan were prejudiced against him.\u003c/p\u003e\n\u003cp\u003e“The eastern side are those from the Lei clan. Old mister Mang Tian Chi is leading them this trip. However, he will not enter the Heavenly Tomb. Most of the time, the ones who enter are members of the younger generation. After all, the Heavenly Tomb is not a bad training ground.”\u003c/p\u003e\n\u003cp\u003eXiao Yan once again shifted his eyes. He looked to a group of people with a lightning mark on their foreheads and nodded.\u003c/p\u003e\n\u003cp\u003e“You have already met those from the Yan clan…”\u003c/p\u003e\n\u003cp\u003e“On the western side are those from the Shi clan. Due to their bloodline, their physical bodies are all extremely frightening. They could be comparable to some of the top Magical Beasts within the Magical Beast World.” Xiao Yan turned to the west. A group of grayish-white individuals stood there. An enormous rock was tattooed on their foreheads.\u003c/p\u003e\n\u003cp\u003e“These are all the people who will enter the Heavenly Tomb this time around. Other than the Gu clan, which looks after the Heavenly Tomb, the other clans only possess two spots each…” Xun Er smiled as she spoke.\u003c/p\u003e\n\u003cp\u003eXiao Yan slowly nodded. He was just about to speak when he suddenly sensed this entire place trembling. A vast ancient aura slowly spread from empty space. Everyone present felt respect and fear surging from deep within their souls when faced with this ancient aura…\u003c/p\u003e\n\u003cp\u003e“The Heavenly Tomb is about to open…”\u003c/p\u003e\n\u003cp\u003eXun Er softly said as she watched the sky suddenly become dark.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eXun Er’s words had just sounded when a shockingly loud noise was emitted from empty space, and a ten-thousand-foot-large spatial crack spread across the sky. A cluster of silver light gradually surfaced in the middle of this spatial line. Finally, the line transformed into a thousand-foot-large spatial door with a vast ancient aura spreading from it.\u003c/p\u003e\n\u003cp\u003e“This is the Heavenly Tomb, huh…”\u003c/p\u003e\n\u003cp\u003eXiao Yan muttered to himself as he studied the ancient door standing between the sky and earth.\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1340\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1342\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1341","bookId":1497,"creation":"Sep 10, 2019 3:24:54 AM","modification":"Sep 10, 2019 3:24:54 AM"}
