{"id":48096,"no":1462,"title":"Chapter 1462: Violent Beating","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1462: Violent Beating\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Yao Xiaotian, you old bastard. Today, I will tear you into tens of thousands of pieces and throw you into the ten thousand snake cave!”\u003c/p\u003e\n\u003cp\u003eYao Ming’s eyes turned blood-red as he glared at the black-clothed person in the sky. An endless viciousness shot of his eyes as his roar reverberated through this deep abyss.\u003c/p\u003e\n\u003cp\u003e“Tsk tsk, my good big brother. It is unexpected that you have survived. However, the current you cannot even block one strike from me. You can rest assured that I will not give you a chance to struggle this time around!” The man in the sky laughed in a wicked manner after hearing Yao Ming’s vicious roar.\u003c/p\u003e\n\u003cp\u003eXiao Yan was expressionless after hearing the conversation between the two brothers. That Yao Xiaotian should be an intermediate level one star Dou Sheng. He was a little stronger than Xiao Yan. There was no need to doubt the strength of this Yao Xiaotian since he was able to become the tribal chief of the Nine Serene Deep Ground Python tribe.\u003c/p\u003e\n\u003cp\u003e“Brat, regardless of how you managed to sneak into my underground Serene Snake network, this underground world is the territory of my Nine Serene Deep Ground Python. You have nearly ruined my plans. Hence, this king will throw you and that cripple into the ten thousand snake cave!”\u003c/p\u003e\n\u003cp\u003eYao Xiaotian’s eyes were extremely ruthless as he stared at Xiao Yan. If he had not left a spiritual imprint within the seal, Xiao Yan would have successfully rescued Yao Ming in secret. Once Yao Ming recovered his strength, he would definitely snatch the position of the tribal chief. At that time, there would be another round of trouble.\u003c/p\u003e\n\u003cp\u003e“You should try to recover your Dou Qi as soon as possible. Leave this fellow to me…”\u003c/p\u003e\n\u003cp\u003eXiao Yan did not react much as he looked at Yao Xiaotian’s sinister eyes. He waved his sleeve and a gentle force delivered Yao Ming to the side of the lake while he spoke in a faint voice.\u003c/p\u003e\n\u003cp\u003e“Be careful. This fellow currently possesses the strength of an intermediate level one star Dou Sheng. Moreover, he has also practice many of the ultimate skills of my Nine Serene Deep Ground Python tribe. It is not easy to deal with him!” Yao Ming warned. Currently, the most important thing that he needed to do was to quickly recover his Dou Qi. Yao Xiaotian was afraid of Yao Ming, so he would not turn this into a big matter. However, he had definitely accumulated his own supporters after all these years. Even though other Elders might not dare to intervene because of Yao Ming’s identity, Yao Xiaotian’s cronies would without a doubt obey his orders.\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eXiao Yan nodded. He took out two jade bottles and tossed them to Yao Ming and Cai Lin. He stepped on the surface of the lake and a circular ripple was formed. His body appeared a short distance in front of Yao Xiaotian. After which, he looked at Yao Xintian and said, “This is the first time that I have fought against an elite Dou Sheng of the same level after having advanced to the Dou Sheng class…”\u003c/p\u003e\n\u003cp\u003e“Relax, this Nine Serene Spring can be considered a good place. Consider yourself fortunate to die here…” Yao Xiaotian laughed in a strange manner. “It is likely that you are quite talented to reach the Dou Sheng class at such a young age. However, you should never have gotten involved with this cripple. Since you have done so, no one will be able to rescue you today!”\u003c/p\u003e\n\u003cp\u003eXiao Yan smiled in a non-committal manner.\u003c/p\u003e\n\u003cp\u003e“This king does not wish to know your name. Today, you can peacefully die here!”\u003c/p\u003e\n\u003cp\u003eThe smile on Yao Xiaotian’s face slowly disappeared. His eyes were vile as they stared at Xiao Yan like poisonous snakes. His body shook abruptly as a monstrous wicked aura suddenly surged out of his body. The entire cave trembled. An energy lightning formed a ten-thousand-foot-large palm in the air above him from all directions. An extremely dark and cold force was contained within this large palm.\u003c/p\u003e\n\u003cp\u003e“Die!”\u003c/p\u003e\n\u003cp\u003eThat large hand suddenly fell after this word sounded. A frightening force shook the space around Xiao Yan until it crumbled.\u003c/p\u003e\n\u003cp\u003e“You have really overestimated yourself…” Xiao Yan lifted his head. He looked at the palm, which was rapidly being magnified in his eyes, and smiled. He swung his sleeve and a hot flame surged into all directions, turning the space around him into a sea of fire in an instant. This flame lingered around the large hand, and its frightening temperature swiftly caused the hand to emit a dense, white fog.\u003c/p\u003e\n\u003cp\u003e“Heavenly Flame?”\u003c/p\u003e\n\u003cp\u003eYao Xiaotian slightly knit his brows after seeing the sea of flames vaporize his energy palm. He let out a cold snort and both of his hands formed many complicated hand seals with lightning-like speed. The energy above the lake once again gathered after those hand seals had formed.\u003c/p\u003e\n\u003cp\u003e“Yellow Spring Finger!”\u003c/p\u003e\n\u003cp\u003eThe energy gathered in a mighty manner. It swiftly gathered into a deep-yellow finger that was a couple thousand feet long. The finger was under Yap Xiaotian’s control. The surface of this finger was extremely rough, but it was filled with a faint destructive force. It looked just like a sky-supporting pillar that stood between the sky and the land if one saw it from a distance.\u003c/p\u003e\n\u003cp\u003e“A Yellow Spring Finger deciding life and death!”\u003c/p\u003e\n\u003cp\u003eYao Xiaotian coldly laughed as he looked at Xiao Yan below. He suddenly pressed his finger down. That enormous Yellow Spring Finger in the sky rumbled and rushed down as well. The entire ceiling crumbled as the surrounding walls of the deep abyss were blasted apart, forming an enormous crack. This attack shook the land and mountains, appearing as though an earthquake had occurred.\u003c/p\u003e\n\u003cp\u003e“Tian class Dou Skill, huh…”\u003c/p\u003e\n\u003cp\u003eSurprise flashed across Xiao Yan’s eyes as he felt the pressure from this Yellow Spring Finger. The Tian class Dou Skill unleashed by an elite Dou Sheng could easily destroy an entire city.\u003c/p\u003e\n\u003cp\u003e“How arrogant. You do not have that ability.” Xiao Yan’s foot stepped forward as a vast and mighty Dou Qi swiftly gathered on his right hand. A black light erupted almost instantly. Within a couple of blinks, it had turned into a couple thousand-foot-large black light sphere. This was the first time Xiao Yan had used the Great Heaven Creation Palm after advancing to the Dou Sheng class. Its might and aura had undoubtedly soared a hundred times from before.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eThe black light sphere formed and unleashed a frightening suction force. The surrounding abyss cracked apart. Large rocks continued to fall before they were absorbed by the light sphere and disappeared.\u003c/p\u003e\n\u003cp\u003e“Great Heaven Creation Palm, destroy it!”\u003c/p\u003e\n\u003cp\u003eXiao Yan lifted his head. He flicked his finger and the enormous black light sphere rushed up. It swiftly appeared where the Yellow Spring Finger was located before it suddenly began to wildly rotate.\u003c/p\u003e\n\u003cp\u003e“Crack crack!”\u003c/p\u003e\n\u003cp\u003eThe Yellow Finger pressed against the black-colored light sphere. A frightening energy swept across the abyss like a storm.\u003c/p\u003e\n\u003cp\u003e“Rumble!”\u003c/p\u003e\n\u003cp\u003eBlack light wildly rotated as wave after wave of destructive forces spread apart. That Yellow Spring Finger was dragged into the black light ten feet at a time. Finally, Yellow Spring Finger was swallowed by the black light sphere in front of Yao Xiaotian’s shocked and furious eyes.\u003c/p\u003e\n\u003cp\u003e“Brat, I have underestimated you!”\u003c/p\u003e\n\u003cp\u003eA grave expression flashed across Yao Xiaotian’s eyes after seeing the Yellow Spring Finger break. His body swayed and a cold Dou Qi surged out of his body in all directions. His body also began to suddenly swell at this moment. In the blink of an eye, he had transformed into a ten-thousand-foot-long black snake. A monstrous ferocity radiated from the snake’s body. He appeared just like an evil god that had descended.\u003c/p\u003e\n\u003cp\u003e“Sealing Skill, Yellow Spring Great Seal!”\u003c/p\u003e\n\u003cp\u003eYao Xiaotian furiously roared at the ceiling after transforming into his actual snake form. A frightening dark and cold force suddenly erupted from the Nine Serene Spring below as he roared. Under Yao Tianxiao’s control, this dark and cold force along with his own monstrous Dou Qi formed a black mountain-like seal. That seal was covered with numerous mysterious symbols.\u003c/p\u003e\n\u003cp\u003e“Xiao Yan, be careful. That is one of the key Dou Skills of the Nine Serene Deep Ground Python tribe. It is a Tian class middle level Dou Skill. If you are supressed by it, you will be sealed within the Nine Serene Spring. Back then, I was struck by this skill and ended up suffering for hundreds of years!”\u003c/p\u003e\n\u003cp\u003eYao Ming’s warning sounded beside Xiao Yan’s ear after this giant seal appeared.\u003c/p\u003e\n\u003cp\u003e“Brat, go and die!”\u003c/p\u003e\n\u003cp\u003eYao Xiaotian loudly laughed after seeing this giant seal form. He swung his huge tail and the black giant seal suddenly turned. It shot toward Xiao Yan, and a strength that was indescribably dark and cold caused the surrounding space to become vicious.\u003c/p\u003e\n\u003cp\u003e“Suppress!”\u003c/p\u003e\n\u003cp\u003eThe black giant seal trembled as this cry sounded. The seal penetrated space and arrived above Xiao Yan’s head in a flash. Finally, it abruptly fell and ruthlessly smashed into the Nine Serene Spring!\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eThe black giant seal landed on the surface of the lake and many large water pillars shot out as a frightening circular ripple spread. Any object within this deep abyss was flattened in an instant.\u003c/p\u003e\n\u003cp\u003e“Ha ha!” The giant snake that Yao Xiaotian had transformed into suddenly laughed after seeing this destruction. With the help of the dark and cold force within the Nine Serene Spring, his seal would immediately restrict the Dou Qi within the target’s body even if the other party was also an intermediate level one star Dou Sheng. Even less needed to be said for Xiao Yan, who was a little weaker than him.\u003c/p\u003e\n\u003cp\u003e“This is bad!”\u003c/p\u003e\n\u003cp\u003eYao Ming, who was recovering his Dou Qi, felt his heart sink after seeing the seal form.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eHowever, Yao Xiaotian’s laughter had just appeared when the giant black seal pressing against the Nine Serene Spring violently trembled. A loud sound appeared a moment later. That giant seal was shaken until it flew backwards!\u003c/p\u003e\n\u003cp\u003e“What?” Yao Xiaotian was immediately shocked upon seeing the seal get knocked back.\u003c/p\u003e\n\u003cp\u003e“You are not qualified to suppress me!”\u003c/p\u003e\n\u003cp\u003e“Bam!”\u003c/p\u003e\n\u003cp\u003eThe Nine Serene Spring was suddenly blasted apart after this thunder-like laugh was emitted. A bright-golden light erupted like a sun. In a flash, it appeared above Yao Xiaotian’s head. The large golden hand contained a four-colored fire lotus rotating above it. After which, the hand furiously slammed down and mercilessly struck the head of that enormous snake.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe fire lotus exploded upon contact. That destructive force was slammed into Yao Xiaotian’s body by the frightening strength of the golden hand. Yao Xiaotian’s huge body appeared as though it had swallowed a countless number of thunderbolts as a rumbling sound continuously appeared. Blood that contained some heat exploded out of his body.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThen Yao Xiaotian’s body flew back and finally crashed into a mountain wall. He shattered it into dust.[a][b][c]\u003c/p\u003e\n\u003cp\u003e“Chi!”\u003c/p\u003e\n\u003cp\u003eA golden light flickered as giant golden figure descended and ruthlessly stepped on Yao Xiaotian’s enormous snake body. It swung its giant fist and ruthlessly smashed it down. The Heavenly Flame’s strength sirrounding the fist caused Yao Xiaotian to emit a miserable cry.\u003c/p\u003e\n\u003cp\u003e“Bastard, you dare to behave atrociously in this my Nine Serene Deep Ground Python’s territory! Serene Snake Guards, capture this person!”\u003c/p\u003e\n\u003cp\u003eA furious roar suddenly sounded in the sky while Xiao Yan was preparing to smashed this fellow to death. A countless number of sounds of rushing wind were emitted from the entire mountain range. Wave after wave of powerful auras erupted. Clearly, the battle between Xiao Yan and Yao Xiaotian had attracted the attention of the entire Nine Serene Deep Ground Python tribe.\u003c/p\u003e\n\u003cp\u003e[a]How the fuck is there a mountain in an abyss? Isn\u0027t a tunnel above the abyss as well? Can I just change mountain into wall?\u003c/p\u003e\n\u003cp\u003e[b]ok, let\u0027s change that\u003c/p\u003e\n\u003cp\u003e[c]I think the author forgot that they were in the abyss and how he had described it. Later on it appears to just be a hole in the ground that opens to outside world even though he first described it as an underground network of tunnels that led to the spring.\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1461\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1463\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1462","bookId":1497,"creation":"Sep 10, 2019 3:24:55 AM","modification":"Sep 10, 2019 3:24:55 AM"}
