{"id":48177,"no":1543,"title":"Chapter 1543: Confrontation Between Two Tribes","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1543: Confrontation Between Two Tribes\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYao Ming’s expression slowly became gloomy after hearing Huang Tian’s icy-cold cry. It seemed that the matter today would not end peacefully…\u003c/p\u003e\n\u003cp\u003eHuang Tian’s voice sounded from a spot above the underground network. Without uttering any more unnecessary word, the surrounding space fluctuated. His body rushed toward the Nine Serene Spring deep within the headquarters of the Nine Serene Deep Ground Python tribe.\u003c/p\u003e\n\u003cp\u003eMany Elders from the Nine Serene Deep Ground Python tribe were extremely furious after seeing Huang Tian forcefully barge in. This action was no different than giving the Nine Serene Deep Ground Python tribe a slap in front of countless number of people!\u003c/p\u003e\n\u003cp\u003e“Huang Tian, you should not go overboard. This is the territory of my Nine Serene Deep Ground Python tribe!”\u003c/p\u003e\n\u003cp\u003eBeing the clan head, Yao Ming needed to step forward at this moment. His body flashed and he appeared in front of Huang Tian with a gloomy expression. He furiously cried out.\u003c/p\u003e\n\u003cp\u003e“Yao Ming, you and Xiao Yan quietly joined hands and launched a sneak attack on the experts of my tribe. This king has remembered this matter. If you dare stop me today, do not blame me for ignoring the past relationship with your tribe!” Huang Tian expression was indifferent. His golden eyes coldly observed Yao Ming. After which, his body flashed passed Yao Ming\u003c/p\u003e\n\u003cp\u003e“I have long heard that chief Huang Tian is extremely strong. Today, allow me, Yao Ming, to have a taste of this strength!”\u003c/p\u003e\n\u003cp\u003eYao Ming’s eyes became chilly. At this moment, he could think about the great difference between Huang Tian and him. A cold cry sounded and a palm with a terrifying force furiously smashed toward Huang Tian while accompanied by deep sonic booms.\u003c/p\u003e\n\u003cp\u003e“A futile effort. You really don’t know your limits!”\u003c/p\u003e\n\u003cp\u003eHuang Tian’s expression became gloomy after seeing Yao Ming attack. He randomly flicked his long finger and a golden feather shot out. It collided with Yao Ming’s sharp palm with lightning-like speed.\u003c/p\u003e\n\u003cp\u003e“Chi!”\u003c/p\u003e\n\u003cp\u003eThe sharp palm wind seemed to collapse upon contact as the two clashed. That golden light feather was just like a sharp magical weapon made of metal that not only easily tore through Yao Ming’s sharp palm wind, it had even left behind a half-inch long bloody wound on his extremely hard hand.\u003c/p\u003e\n\u003cp\u003eYao Ming had actually suffered injuries upon contact. This caused his expression to change. The golden energy around his wound swiftly spread like poison, causing the flesh at that spot to become numb.\u003c/p\u003e\n\u003cp\u003e“It is extremely easy for this king to kill you.”\u003c/p\u003e\n\u003cp\u003eHuang Tian’s figure appeared in front of Yao Ming in a ghost-like fashion. His indifferent golden eyes glanced at Yao Ming. He waved his sleeve and Yao Ming sensed a huge force swing toward him. A ‘bang’ sounded and he forcefully shot down. Finally, he ruthlessly landed on a mountain, which immediately collapsed.\u003c/p\u003e\n\u003cp\u003e“Tribal chief!”\u003c/p\u003e\n\u003cp\u003eThose Elders from the Nine Serene Deep Ground Python Tribe revealed a different expression when Yao Ming fell after not even lasting one exchange against Huang Tian. A fury surged into their hearts. Huang Tian was clearly humiliating their tribe!\u003c/p\u003e\n\u003cp\u003e“Fight it out with them!”\u003c/p\u003e\n\u003cp\u003eSome of the Elders with fiery hot tempers immediately charged to the sky with furious faces. Before they could attack, Huang Tian merely swung his sleeve in a cold and indifferent fashion. A frightening golden light swept away and easily sent these Elders out of the sky.\u003c/p\u003e\n\u003cp\u003e“Who else? This king will not show any mercy the next time around.”\u003c/p\u003e\n\u003cp\u003eHuang Tian stood in the sky alone. Golden light whistled around his body like a windmill. Only he alone was able to stand in the sky. All the experts from the Nine Serene Deep Ground Python tribe were unable to even enter the area a thousand feet around him. The frightening strength of an advanced five star Dou Sheng had been unleashed…\u003c/p\u003e\n\u003cp\u003eMany Nine Serene Deep Ground Python tribe Elder’s revealed purple faces after hearing that indifferent voice in the sky. This Huang Tian was completely humiliating them!\u003c/p\u003e\n\u003cp\u003e“Creak!”\u003c/p\u003e\n\u003cp\u003eYao Ming struggled to climb out of the rock fragments within the mountain. He ignored the blood hanging on the corner of his mouth as his eyes stared at Huang Tian’s figure in the sky with a blood-red expression. Both of his fists were clenched in fury, emitting cracking sounds.\u003c/p\u003e\n\u003cp\u003e“Form the formation!”\u003c/p\u003e\n\u003cp\u003eA cold blade-like voice seeped out of the gap between Yao Ming’s teeth. A monstrous murderous intent rose.\u003c/p\u003e\n\u003cp\u003e“Understood!”\u003c/p\u003e\n\u003cp\u003eAll the Elders from the Nine Serene Deep Ground Python tribe cried out in union with dark and chilly expressions after hearing Yao Ming’s words. At least a hundred figures rose to the sky. Hints of a mysterious aura were vaguely present between them.\u003c/p\u003e\n\u003cp\u003e“Snake Plate Great Formation!”\u003c/p\u003e\n\u003cp\u003eNumerous light pillars quickly surged out of the Elders’ bodies as the many of them cried out together. Finally, the pillars entwined with each other. Within a short minute, a ten-thousand-foot-large formation appeared in the sky in front of many pairs of eyes. The frightening pressure vaguely radiated from the formation causing the expressions of many people to change.\u003c/p\u003e\n\u003cp\u003e“Snake Plate Great Formation…”\u003c/p\u003e\n\u003cp\u003eHuang Tian frowned as he stood in the sky. He had naturally heard about the reputation of the formation. Back then, the Nine Serene Deep Ground Python tribe had relied on this big formation to kill many extremely powerful experts.\u003c/p\u003e\n\u003cp\u003e“The formation is not bad. Unfortunately, there is no capable person as its eye.” Huang Tian spoke in a faint voice. His eyes glanced at Yao Ming, who had thrown himself in the middle of the formation.\u003c/p\u003e\n\u003cp\u003e“Hiss!”\u003c/p\u003e\n\u003cp\u003eYao Ming’s expression was dark and cold as he chose to ignore Huang Tian’s words. The seals formed by his hands changed. A light pillar shot out of his body and mixed with the formation, causing the entire formation to tremble. An endless number of energy light pillars gathered in a distorted fashion. Finally, they transformed into a ten-thousand-foot-long snake. The large snake radiated by an ancient aura, making it appear extremely powerful.\u003c/p\u003e\n\u003cp\u003e“Form the Heaven Phoenix Ancient Formation!”\u003c/p\u003e\n\u003cp\u003eThe many experts from the Heaven Demon Phoenix tribe quickly separated in the distant sky after the huge snake appeared. An earth-shaking cry appeared above the land after an orderly roared.\u003c/p\u003e\n\u003cp\u003eA huge phoenix, similar in size to the huge snake, flapped its ten-thousand-foot-large wings\u003c/p\u003e\n\u003cp\u003eIt appeared in a way that blotted out the sun after this cry sounded. It face off against the huge snake.\u003c/p\u003e\n\u003cp\u003eThe many people in this underground network inhaled a deep breath of cold air after seeing this shocking battle in the sky. Clearly, they had not expected both parties to actually unleash their respective tribe guarding formations.\u003c/p\u003e\n\u003cp\u003eHuang Tian’s eyes were indifferent as they swept over the huge snake standing in front from the sky. His body moved. He turned into a ray of light as he shot toward the Nine Serene Spring.\u003c/p\u003e\n\u003cp\u003e“Charge!”\u003c/p\u003e\n\u003cp\u003eYao Ming immediately roared upon seeing Huang Tuan move. The huge snake formed by the many Elders swung its large tail. The sky emitted the rushing sound of wind as it suddenly exploded…\u003c/p\u003e\n\u003cp\u003eHuang Tian merely lifted his brow when attacked by this frightening momentum. However, he did not intervene to fight. Instead, he hurried toward the Nine Serene Spring without reducing his speed. The huge tail was just about to strike his body when a loud and clearly cry suddenly appeared in the sky behind him. A huge wing, which seemed to be made out of a golden light, penetrated air and collided with the huge snake.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eA frightening air ripple spread across the sky. Huang Tian’s figure flashed and appeared above the Nine Serene Spring in front of countless pairs of eyes.\u003c/p\u003e\n\u003cp\u003e“Bastard!”\u003c/p\u003e\n\u003cp\u003eYao Ming was extremely furious after seeing Huang Tian successfully charge pass them. He was just about to direct the huge snake to turn and attack when the huge phoenix formed by the other party’s formation came pouncing over to unleash a sharp attack. He had no choice but to focus his attention and deal with it.\u003c/p\u003e\n\u003cp\u003eWhile Yao Ming and the rest were being delayed by the experts from the Demon Phoenix tribe, Huang Tian’s indifferent eyes were thrown toward the Nine Serene Spring below him. The surface of the spring had already formed an extremely thick layer of hard ice. An extremely dark and chilly air continuously surged from it.\u003c/p\u003e\n\u003cp\u003e“This Xiao Yan’s woman is indeed extraordinary. She is actually able to train in such a place…”\u003c/p\u003e\n\u003cp\u003eSome surprise flashed across Huang Tian’s eyes. Although he could enter and leave this Nine Serene Spring as he liked, he did not dare to remain in it to train.\u003c/p\u003e\n\u003cp\u003e“We’ll capture her first.”\u003c/p\u003e\n\u003cp\u003eHuang Tian’s eyes flickered. He extended his large hand and ruthlessly clenched it toward the Nine Serene Spring below. The incomparable thick ice on the surface of the lake cracked an inch at a time. Finally, it blasted into an icy fog amid a series of explosions.\u003c/p\u003e\n\u003cp\u003eThe lakewater of the Nine Serene Spring once again appeared after the ice burst apart. Huang Tian narrowed his eyes. He was able to vaguely detect an unusual pressure emanating from the bottom of the spring.\u003c/p\u003e\n\u003cp\u003e“Come out!”\u003c/p\u003e\n\u003cp\u003eHuang Tian did not hesitate. A cold glow flashed in his eyes. He grabbed with his hand and an earth-shaking storm rose. Numerous water pillars were formed by Huang Tian. In an instant, dozens of huge water pillars shot toward the sky. They appeared extremely spectacular.\u003c/p\u003e\n\u003cp\u003eYao Ming watched the Nine Serene Spring be turned upside down by Huang Tian. He felt extremely furious in his heart. However, he was being held back to the point of being unable to move. He could only pray in his heart that Cai Lin was not disturbed even though he understood that this was wishful thinking. If Huang Tian continued, he would sooner or later capture Cai Lin from the bottom of the spring…\u003c/p\u003e\n\u003cp\u003e“Brother Xiao Yan, I’m afraid that I cannot finish what I promised you…”\u003c/p\u003e\n\u003cp\u003eHuang Tian’s expression was indifferent as he stared at the Nine Serene Spring. A whirlpool that had reached the bottom of the spring had appeared. His eyes saw through the whirlpool. He seemed to be able to see a figure at the point.\u003c/p\u003e\n\u003cp\u003eHuang Tian once again extended his hand when he saw this partially visible figure. A suction force erupted from his palm. However, he was just about to drag that figure from the bottom of the spring when his arm suddenly trembled. He suddenly lifted his head and saw a figure rushing over from the horizon with lightning-like speed. A ten-thousand-foot-large illusory figure soared through the air as this figure rushed over.\u003c/p\u003e\n\u003cp\u003e“Mou!”\u003c/p\u003e\n\u003cp\u003eA furious and strange sound suddenly descended from the sky. This frightening spiritual sonic wave ruthlessly struck Huang Tain, who was unable to react in time, at an indescribably frightening speed.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eHuang Tain’s body flew back after being hit by this ferocious spiritual attack. He finally stabilized his body in a miserable fashion after destroying a couple of mountains along the way. An icy-cold cry that reverberated over the land caused his expression to turn green with fury.\u003c/p\u003e\n\u003cp\u003e“Old dog Huang Tian, you are seeking death!”\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1542\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1544\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1543","bookId":1497,"creation":"Sep 10, 2019 3:24:55 AM","modification":"Sep 10, 2019 3:24:55 AM"}
