{"id":48208,"no":1574,"title":"Chapter 1574: Yao Di’s Soul Fragment","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 1574: Yao Di’s Soul Fragment\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Bang bang bang!”\u003c/p\u003e\n\u003cp\u003eCountless medicinal pills rushed into the large formation from all directions. They were quickly turned into powerful energy. At the end, one could see that the energy within the large formation seemed to have turned into a liquid sea. Lightning like loud sound was being emitted as it flowed…\u003c/p\u003e\n\u003cp\u003e“Founding Ancestor return!”\u003c/p\u003e\n\u003cp\u003eYao Dan’s hands formed many seals. His expression was ferocious as he suddenly cried out sternly.\u003c/p\u003e\n\u003cp\u003e“Crash!”\u003c/p\u003e\n\u003cp\u003eAfter the stern cry sounded, a swirl quickly appeared at the middle of the formation. An endless amount of liquid energy continued to surge into it. At the same time, an extremely ancient aura also slowly spread from within the swirl. The swirl rotated rapidly before quietly disappearing. At this moment, a linen clothed illusory elderly figure appeared.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eAll the members of the Yao clan suddenly felt their souls trembling violently the moment the illusory old man appeared. A kind of pressure that originated from their bloodline immediately caused the countless figures present on this mountain to kneel down.\u003c/p\u003e\n\u003cp\u003e“Founding Ancestor!”\u003c/p\u003e\n\u003cp\u003eThe many Yao clan’s Elders were so greatly affected that tears flowed from their eyes. Their faces appeared a little crazy because of the excitement. Under the stimulation of their bloodline, the figure was just like a god, which they could not offend, in their hearts\u003c/p\u003e\n\u003cp\u003e“Is this the Yao clan’s Founding Ancestor soul fragment…” Xiao Yan’s expression was solemn as he looked at the figure. Even with his perfect Heavenly State soul, he felt some difficulty breathing under the figure. This was merely a soul fragment that had remained for a seemingly endless amount of time. It was difficult to imagine just what kind of level a true elite Dou Di would possess.\u003c/p\u003e\n\u003cp\u003eYao Lao’s body trembled slightly ashe stood beside Xiao Yan. He looked at the illusory figure at the middle of the large formation with eyes that were filled with fear and respect.\u003c/p\u003e\n\u003cp\u003eHun Huzi’s eyes also became grave as he stood in the sky. The pressure that the illusory figure gave him was incomparably strong. This Yao clan was indeed not as easy to deal with as the Ling and Shi clan. Regardless of how it struggled, however, it would also have difficult escaping from the same fate.\u003c/p\u003e\n\u003cp\u003e“Ugh, Yao Di…”\u003c/p\u003e\n\u003cp\u003eThose black hole like eyes of the black flame human figure beside Hun Huzi also stared at this illusory figure. A moment later, he emitted a soft sigh with some unknown feelings.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, the ultimate expert from back then is currently just a soul fragment…”\u003c/p\u003e\n\u003cp\u003e“Founding Ancestor, please bless our Yao clan!” Yao Dan knelt down in the sky and let out a low respectful cry.\u003c/p\u003e\n\u003cp\u003e“Yao clan…”\u003c/p\u003e\n\u003cp\u003eThe old man in rough linen clothes within the formation let out a low mutter. The long flow of time had left his little remaining memories to become increasingly blurry. However, it was fortunate that he still had a memory of the clan he had founded. Those extremely ancient eyes slowly swept over the area below. Finally, a mutter was emitted.\u003c/p\u003e\n\u003cp\u003e“It has actually declined until such an extent…”\u003c/p\u003e\n\u003cp\u003eAn ashamed expression immediately rose onto Yao Dan’s face after hearing the low mutter of the illusory old man. Although the current era was different from the ancient era, he did not voice any excuses.\u003c/p\u003e\n\u003cp\u003e“This is… Nihility Devouring Flame…”\u003c/p\u003e\n\u003cp\u003eThe illusory old man did not speak to any of the members of the Yao clan. He slowly lifted his head and looked at the black flame, which covered the sky. A lost expression once again flashed across both of his eyes. He waved his sleeve and a light appeared on the formation. Those black flames, which were adhered onto it while devouring energy, were being forcefully scattered by him.\u003c/p\u003e\n\u003cp\u003e“Without a complete memory and without a complete soul. Your muddy state is just like that of a puppet. The Yao Di has actually also turned into such a state. It’s just as well. By capturing this remanent soul of yours, it would at least surpass that of a million complete souls.”\u003c/p\u003e\n\u003cp\u003eThe Nihility Devouring Flame smiled faintly in the sky. His tone did not contain the least bit of fear and respect. His hand was extended and his finger, which was covered with black symbols, pointed below.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThe entire place immediately crumbled as the Nihility Devouring Flame pointed his finger forward. A huge black flame finger that seemed to cover half of the mountain range, descended from the black flame, which spread over the sky. It ruthlessly pressed towards the formation This entire space seemed to have completely cracked under the finger.\u003c/p\u003e\n\u003cp\u003eThe expressions of many turned ashen upon seeing this terrifying might.\u003c/p\u003e\n\u003cp\u003eThe black finger descended from the sky. However, it was just about to land on the large formation when the linen clothed old man finally lifted his hand. A medicinal cauldron that did not lose to the huge finger in size appeared above the formation. The medicinal cauldron was covered with various mysterious lines. At a glance, it appeared as though it was real. An ancient aura spread from it.\u003c/p\u003e\n\u003cp\u003e“Hum!”\u003c/p\u003e\n\u003cp\u003eThe huge finger heavily pressed onto the large cauldron. Immediately, a humming sound resounded across the sky.\u003c/p\u003e\n\u003cp\u003e“Grug!”\u003c/p\u003e\n\u003cp\u003eSome of the weaker individuals immediately spat out a mouthful of fresh blood under the frightening humming sound. Some of their eardrums were even blasted apart. Blood continued to flow out from their ears, given them an extremely miserable appearance.\u003c/p\u003e\n\u003cp\u003eThe large finger scattered as the two collided. That medicinal cauldron had also become a lot more illusionary. The old man’s figure had also paled slightly. Clearly, he had exhausted a great amount of energy.\u003c/p\u003e\n\u003cp\u003e“Just how many times a mere soul fragment can block me?”\u003c/p\u003e\n\u003cp\u003eThe Nihility Devouring Flame laughed faintly after his attack failed. His finger continued to press on the empty air. Immediately, the entire area shook. A couple of huge fingers descended from the sky and continuously struck violently onto the huge cauldron.\u003c/p\u003e\n\u003cp\u003e“Hum hum hum!”\u003c/p\u003e\n\u003cp\u003eA couple of crack lines were actually formed on the huge cauldron as this earthshaking sound appeared.\u003c/p\u003e\n\u003cp\u003e“Everyone from the Yao clan, pour all of your Dou Qi into the formation!”\u003c/p\u003e\n\u003cp\u003eYao Dan’s expression had changed drastically after seeing that the Nihility Devouring Flame was actually unafraid of the Founding Ancestor soul fragment. He let out a stern cry. Immediately, the Dou Qi within his body turned into a bright light pillar that shot into the formation. Countless light pillars also erupted from the other places. Immediately, the huge cauldron once again become real like. Moreover, it had actually directly flew out of the formation and whistled towards the Nihility Devouring Flame in the sky this time around.\u003c/p\u003e\n\u003cp\u003eHun Huzi’s expression changed after he saw the huge cauldron rushing over. His body hurriedly hid behind the Nihility Devouring Flame.\u003c/p\u003e\n\u003cp\u003e“You have the strength of the Yao clan, so do I!:\u003c/p\u003e\n\u003cp\u003eThe tone of the Nihility Devouring Flame was still calm. With a wave of his sleeve, the entire Yao realm immediately began to tremble. Everyone were shocked to see that there were dense black flame clusters rising from outside this formation. Finally, the entered the black flame in the sky. Immediately, countless of miserable cries resounded over this place.\u003c/p\u003e\n\u003cp\u003e“It’s the descendant citizens of the Yao clan!”\u003c/p\u003e\n\u003cp\u003eXiao Yan’s expression changed drastically. Those densely packed light clusters encompassed countless of wildly struggling human figures. These people were all the descendant citizens of the Yao clan. The moment they were being sucked into the black flame clouds, Xiao Yan could see that their bodies were turned into blood, which were completely devoured…\u003c/p\u003e\n\u003cp\u003e“What ruthless method! He didn’t even let those descendant citizens off.”\u003c/p\u003e\n\u003cp\u003eXiao Yan clenched his fist tightly. There were at least millions of descendant citizens in this Yao Realm. Yet, all of them were devoured by the Nihility Devouring Flame!\u003c/p\u003e\n\u003cp\u003e“Hun clan, yoru Hun clan will be an irreconcilable enemy of my Yao clan!”\u003c/p\u003e\n\u003cp\u003eThe shocking change outside of the formation was also detected by Yao Dan. His eyes cracked slightly as his vicious and mad roar resounded over the entire place.\u003c/p\u003e\n\u003cp\u003eThe Nihility Devouring Flame completely ignored Yao Dan’s roar. He clenched his hand and a blood ball was formed. Immediately, it swelled at a terrifying speed. The members of the Yao clan could clearly sense a familiar scent from within the blood ball.\u003c/p\u003e\n\u003cp\u003e“Explode!”\u003c/p\u003e\n\u003cp\u003eThe Nihility Devouring Flame waved his hand after the blood ball swelled to ten thousand feet. Finally, it heavily collided with the huge cauldron flying over.\u003c/p\u003e\n\u003cp\u003eA blood light covered the entire sky at that moment. Everyone seemed to have turned deaf at that moment. However, the blood red colour, which filled their eyes, allowed them to understand that this extermination like clash was not an illusion…\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAn indescribable frightening energy attack swept wildly from the sky. Many crack lines were formed from the explosion upon contact. Finally, it completely disappeared under the wild devourment of the black flame. The remaining annihilation force swept down and ruthlessly smashed onto the formation.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe formation trembled violently as this force swept down. A liquid like energy filled it as it scattered at a shocking speed.\u003c/p\u003e\n\u003cp\u003e“The formation is about to break…”\u003c/p\u003e\n\u003cp\u003eLooking at the increasingly pale large formation, the hearts of everyone from the Gu clan quickly became icy cold. They did not expect that this formation that was formed from the strength of their entire clan was actually unable to block this terrifying existence.\u003c/p\u003e\n\u003cp\u003eThe rough linen clothed illusory old man at the middle of the formation also softly sighed as he watched this scene. His mutter drifted into everyone’s ears.\u003c/p\u003e\n\u003cp\u003e“This calamity cannot be avoided…”\u003c/p\u003e\n\u003cp\u003eHis figure suddenly rushed out of the formation after his voice sounded. It turned into an illusory ray of light that cut through the black flame cloud with a speed exceeding the speed of light. Finally, it shot into the body of the Nihility Devouring Flame.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThe collision between the two merely emitted a somewhat soft muffled sound. However, the body of the Nihility Devouring Flame trembled intensely. Soon after, his tone finally revealed a little fury for the first time. “You… damn old ghost, disappear from this world!”\u003c/p\u003e\n\u003cp\u003eBlack flame surged out from within his body in all directions. Immediately, a slight sound was emitted. It was as though a soul was shattered…\u003c/p\u003e\n\u003cp\u003eThe sound was soft but the bodies of all the members of the Yao clan stiffened at this moment. They could sense that there was something which was quietly vanishing from their bloodline.\u003c/p\u003e\n\u003cp\u003e“Founding Ancestor…”\u003c/p\u003e\n\u003cp\u003eYao Dan’s scarlet eyes dully looked at the sky. It was as though his believe had crumbled at this moment.\u003c/p\u003e\n\u003cp\u003e“Crack!”\u003c/p\u003e\n\u003cp\u003eThe formation began to tremble even more intensely in front of the stunned expression of everyone from the Yao clan. Finally, it emitted a crack sound and exploded in front of many shocked eyes…\u003c/p\u003e\n\u003cp\u003e“The formation has been broken…”\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1573\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-1575\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-1574","bookId":1497,"creation":"Sep 10, 2019 3:24:55 AM","modification":"Sep 10, 2019 3:24:55 AM"}
