{"id":46668,"no":34,"title":"Chapter 34: Turning Around","content":"\u003cp\u003e\u003cu\u003e\u003cstrong\u003eChapter 34\u003cu\u003e\u003cstrong\u003e:\u003c/strong\u003e\u0026nbsp;\u003c/u\u003eTurning Around\u003c/strong\u003e\u003c/u\u003e\u003c/p\u003e\n\u003cp\u003eWatching the black clothed young man with his hands behind his back, the whole field was quiet again.\u003c/p\u003e\n\u003cp\u003eOn the high platform, Xiao Zhan’s smile slowly widened before finally, he couldn’t help but laugh out loud.\u003c/p\u003e\n\u003cp\u003eHearing the gleeful laughter from Xiao Zhan, the three elders looked at each other and sighed. However, they didn’t try to do anything else against Xiao Yan. The potential displayed by Xiao Yan gave them a sense of defeat. 4 Duan Qi in 1 year was something that would make anyone shocked, their sons and grandsons, wouldn’t hope to ever have that pace.\u003c/p\u003e\n\u003cp\u003eWith a light heart, Xiao Zhan clapped while announcing: “Xiao Ke zhi-er has lost. Hopefully you will continue to train hard!”\u003c/p\u003e\n\u003cp\u003eTL: Zhi-er is Nephew in Chinese\u003c/p\u003e\n\u003cp\u003eIn the training field, the pale faced Xiao Ke heard the announcement and drooped his head in disappointment. Taking a look at the black clothed young man not far from him, he recalled about how he had insulted the very person, calling him a “cripple” just a year ago. Now one year later, the “cripple” was quite close to the top of the clan and far above him. This extreme difference made Xiao Ke recall the words he had heard in the hall just a few months before: “ Thirty years east, thirty years west, don’t you dare bully me because I’m poor now!”\u003c/p\u003e\n\u003cp\u003eShaking his head with a bitter smile, Xiao Ke got up with some difficulty. Slightly bowing to Xiao Yan, Xiao Ke’s voice had lost all of its arrogance from before: “Xiao Yan Biao-di, you won. Congratulations on your recovery!”\u003c/p\u003e\n\u003cp\u003eNodding, Xiao Yan’s gaze slowly swept across the training field and those that met his dark pupils all turned away their gaze with nervousness and unease.\u003c/p\u003e\n\u003cp\u003eHis gaze pausing on Xiao Mei who was staring at him, Xiao Yan twisted his face to face the clansmen that didn’t pass and asked with a smile: “Is there anyone else who\u0026nbsp;would like to challenge me?”\u003c/p\u003e\n\u003cp\u003eWatching Xiao Yan, the clansmen that were eager to challenge Xiao Yan before Xiao Ke went up all closed their mouths and looked up at the sky as if Xiao Yan’s words had nothing to do with them. None of them would go up and be the second challenger.\u003c/p\u003e\n\u003cp\u003eWatching the childish acts of pretending to be a fool, Xiao Yan lightly shrugged and walked back.\u003c/p\u003e\n\u003cp\u003eSeeing Xiao Yan sit beside her, Xun Er smiled while examining the field. Picking up a strand of her hair and twirling it, she whispered: “Xiao Yan ge-ge, three years ago, they looked at you like this…”\u003c/p\u003e\n\u003cp\u003e“Three years ago, I would have been excited by their respectful and fearful gazes but today… I don’t feel anything.” Xiao Yan touched his nose and laughed.\u003c/p\u003e\n\u003cp\u003e“Then Xiao Yan ge-ge has matured!” Xun Er playfully blinked her eyes.\u003c/p\u003e\n\u003cp\u003e“Not more mature than you. Sometimes I feel as if there’s a thousand year monster hiding within you!” Being called mature by a girl, Xiao Yan couldn’t help but laugh. Intimately rubbing Xun Er’s head, he let out a smile.\u003c/p\u003e\n\u003cp\u003eHearing that, Xun Er gave Xiao Yan an evil eye and her delicate face showed an expression of rebuke. No matter how carefree a girl was, no one ever liked being called an old monster.\u003c/p\u003e\n\u003cp\u003eXun Er’s expression of rebuke was so pretty that it attracted the stares of the young men around her and even the stares of some of the girls!\u003c/p\u003e\n\u003cp\u003e“That brat, too pompous…” Xiao Ning, like the others, was also attracted to Xun Er’s expression of rebuke but looking at the intimate chatter between Xun Er and Xiao Yan, an envious flame burned within him. His jealousy covered up his reasoning as he thought that only he could match Xun Er within the entire clan but thinking back, he realized that no matter what he did, Xun Er rarely smiled. On the other hand, Xiao Yan, who was a “cripple”, could always make Xun Er laugh. The difference between them made Xiao Ning crush his teeth in anger.\u003c/p\u003e\n\u003cp\u003e“Brat, I’ll let you be arrogant for now but when the Coming of Age Ceremony comes, I will make you look for your fallen teeth in front of Xun Er!” Clenching his hands into fits, Xiao Ning gave a cold stare to the cross-legged Xiao Yan.\u003c/p\u003e\n\u003cp\u003eEven though Xiao Ning was also shocked by Xiao Yan’s training speed in the past year, he couldn’t change his haughty manner that he was used to. In addition, Xiao Ning, being the only male within the entire clan that could barely be compared to Xun Er, felt a sense of danger from Xiao Yan\u0027s sudden performance.\u003c/p\u003e\n\u003cp\u003eBefore he grows strong, I’ll give him a merciless beating. The best case scenario is that the beating would leave a scar and break him from his training!\u003c/p\u003e\n\u003cp\u003eWhile thinking his evil thoughts, the corners of Xiao Ning’s mouth curved into a smile. Even though Xiao Yan was at 7 Duan Qi, Xiao Ning was still confident in his 8 Duan Qi. After all, each Duan of Qi after 7 Duan Qi had a huge difference between them!\u003c/p\u003e\n\u003cp\u003eChatting in a low voice with Xun Er, Xiao Yan’s aimlessly sight gazed around the sides of the training field and caught the smile on Xiao Ning’s face. Thinking for a moment, Xiao Yan realized what the smile was about and smiled himself, thinking: Someone who can’t even cover up his or her emotions can’t pose to be a risk at all.\u003c/p\u003e\n\u003cp\u003e….\u003c/p\u003e\n\u003cp\u003eAfter Xiao Ke lost to Xiao Yan, no one else dared to challenge Xiao Yan who was sitting down and those clansmen that didn’t qualify set their sights on others. But after a couple rounds of challenges, only two people, relying on luck and familiar Dou Techniques, were able to beat their opponent and qualify for the Coming of Age Ceremony.\u003c/p\u003e\n\u003cp\u003eWatching the slowly calming training field, the smiling Xiao Zhan stood up and announced the results along with a couple of notices about next month’s Coming of Age Ceremony.\u003c/p\u003e\n\u003cp\u003eSlowly standing up, Xiao Yan smiled towards the happy Xiao Zhan on the stage while Xiao Zhan wasn’t stingy about giving his qualified son, a thumbs up.\u003c/p\u003e\n\u003cp\u003eRight after dusting off his clothes, Xiao Yan detected a perfumed scent.\u003c/p\u003e\n\u003cp\u003eCurling his brows slightly, Xiao Yan lifted his head to see Xiao Mei standing in front of him and asked: “Do you need anything?”\u003c/p\u003e\n\u003cp\u003eSeeing the impassiveness and coldness on Xiao Yan’s face, Xiao Mei’s courage faltered as she forced out a smiled and said: “Xiao Yan biao-di, congratulations.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” Slightly nodding, Xiao Yan glanced at Xun Er besides him.\u003c/p\u003e\n\u003cp\u003e“Xiao Yan biao-di, my father will be personally teaching a High Huang level Dou Technique at the Dou Technique Hall tomorrow. Do you want to come with me?” Xiao Mei smiled and her combination of a female’s charm and a youth’s delicacy created an irresistible question.\u003c/p\u003e\n\u003cp\u003eHearing that, Xiao Yan’s brows slightly jumped.\u003c/p\u003e\n\u003cp\u003eRight when Xiao Yan was about to find an excuse to reject Xiao Mei, a pale white arm slipped through and locked with his arm.\u003c/p\u003e\n\u003cp\u003eShocked, Xiao Yan turned around to find a smiling Xun Er.\u003c/p\u003e\n\u003cp\u003e“Really sorry Xiao Mei biao-jie, Xun Er has already invited Xiao Yan ge-ge to accompany me tomorrow to visit Wu Tan City and so he can’t be going with Xiao Mei biao-jie to the Dou Technique Hall.” Under stunned stares, Xun Er held on to Xiao Yan’s arm while a hint of apology lingered on her delicate face.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-33\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-35\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-34","bookId":1497,"creation":"Sep 10, 2019 3:24:52 AM","modification":"Sep 10, 2019 3:24:52 AM"}
