{"id":46687,"no":53,"title":"Chapter 53: 9 Duan Qi","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 53\u003cu\u003e\u003cstrong\u003e:\u003c/strong\u003e\u0026nbsp;\u003c/u\u003e9 Duan Qi\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the small lush forest, threads of white Dou Qi flowed through the air, continuously absorbed by Xiao Yan’s body as he slumbered.\u003c/p\u003e\n\u003cp\u003eLooking at Xiao Yan, who had practically become an energy sink, Xun Er felt pleasantly surprised. Quietly putting some distance between him, she stood in silent vigil and guarded the area. If Xiao Yan were to be roused from his state of training mediation, he would lose a chance to advance another level.\u003c/p\u003e\n\u003cp\u003eThe success of Xiao Yan’s advancement could be said to be almost certain.\u003c/p\u003e\n\u003cp\u003eAs the Dou Qi was absorbed, the faint traces of fatigue on Xiao Yan’s face gradually faded away. Like a piece of warm jade, his delicate and pretty face glowed with a pale light.\u003c/p\u003e\n\u003cp\u003eFor the next hour these events carried on continued within the small dense forest, until at last coming to the end.\u003c/p\u003e\n\u003cp\u003eFinally, when the lasts wisps of Dou Qi entered Xiao Yan, the small forest regained its original calm; the sun\u0027s burning rays continued to shine down on the forest.\u003c/p\u003e\n\u003cp\u003eEven though Xiao Yan’s eyes were tightly shut, his chest rose and fell in a smooth and steady manner. Xun Er, seeing this, let out a sigh of relief, relaxed and laughed gently: “He has finally reached the 9th Duan Qi. Maybe in half a year, Xiao Yan ge-ge will be able to condense a Dou Qi Cyclone and become a true Dou Zhe.”\u003c/p\u003e\n\u003cp\u003eA light hearted smile on her lips, Xun Er leaped onto a nearby limestone and sat down in a crosslegged position. Elbows on her knees, palms supporting her chin while her fingers lay on her cheeks, she waited for Xiao Yan to wake up.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe sky had gradually turned to dusk when Xiao Yan finally arose from his deep slumber. Blinking his eyes in confusion, Xiao Yan stared blankly about before regaining his wits. Lifting his head, his sight came to rest upon a figure clothed in the golden rays of the setting sun. Bright and clear like liquid water, a pair of eyes met his. He smiled.\u003c/p\u003e\n\u003cp\u003e“Is Xiao Yan ge-ge finally awake?” Xun Er let out a lovable laugh as she posed the question to the recently-awakened Xiao Yan.\u003c/p\u003e\n\u003cp\u003eSmiling with a nod of his head, Xiao Yan got up. Twisting his numb neck about, he lazily stretched. “Pi Li Pa La” the satisfying sounds of bones cracking against each other could be heard from a body that had just raised a Duan Qi.\u003c/p\u003e\n\u003cp\u003eDazed at the feeling of achieving a breakthrough, Xiao Yan curled his hand in to a fist before uncurling it again, his jaw slightly slackened and he tilted his head; his face filled with equal parts of doubt and uncertainty and he uttered: “What…… I seem to have reached the 9 Duan Qi?”\u003c/p\u003e\n\u003cp\u003eStaring at Xiao Yan’s look of bafflement with an interested look, Xun Er started to laugh.\u003c/p\u003e\n\u003cp\u003eUpon seeing Xun Er’s nod, Xiao Yan’s lips curled upwards into a smile. His heart was pleasantly surprised, though he still didn’t know whether to laugh or cry. The last time he made a breakthrough, it was when he was sleeping. This time he made another breakthrough while asleep. This way of breaking through was a bit too comical.\u003c/p\u003e\n\u003cp\u003eVigorously punching at the air a few times in rapid succession and feeling Dou Qi that was stronger than a few hours ago, Xiao Yan couldn’t help but laugh.\u003c/p\u003e\n\u003cp\u003eAfter getting all of his pleasant surprise out of his mind, Xiao Yan was finally aware of the murky sky color. Giving an apologetic smile to Xun Er, he knew that she had been waiting for him this whole time.\u003c/p\u003e\n\u003cp\u003eWhile putting his clothes back on, he began to crack jokes with Xun Er, “Not leaving? Today’s a good day so why don’t you let ge treat you to a nice meal in Wu Tang City.”\u003c/p\u003e\n\u003cp\u003eTL: Ge \u003d Brother and Ge-ge \u003d Brother\u003c/p\u003e\n\u003cp\u003e“Xixi, I want the most expensive meal then…” She responded with a light laugh of her own. Tiptoeing on the limestone for a while, she gingerly dropped down next to Xiao Yan, emitting a faint bell laugh that scatter across the gingerly green forest.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn order to thank Xun Er for waiting the whole afternoon, Xiao Yan took care to take Xun Er on a stroll around Wu Tang City before parting with her in the clan.\u003c/p\u003e\n\u003cp\u003eDragging his still somewhat excited legs back to his room, Xiao Yan dropped down heavily onto his bed and hugged his quilt. With a soft murmur to himself, he said, “At last, I am finally going to become a Dou Zhe once more…”\u003c/p\u003e\n\u003cp\u003e“Hey, this breakthrough you just managed... it was due to that little girl.” From the midst of the room, the laughter of an old man suddenly sounded.\u003c/p\u003e\n\u003cp\u003eRaising a single eyelid, Xiao Yan stared lazily at Yao Lao and furrowed his eyebrows, “What does Xun Er have to do with this?”\u003c/p\u003e\n\u003cp\u003e“Eh, she definitely had a part, otherwise you would had taken a week to breakthrough by yourself.” Yao Lao’s transparent body sat down on a chair, his casual tone ringing throughout the room.\u003c/p\u003e\n\u003cp\u003eBegrudgingly shrugging his shoulders, Xiao Yan threw his head back into his quilt. “Right now I’m already at 9 Duan, if I want to breakthrough to become a Dou Zhe, I’m afraid it’ll take me another half year or so…” After saying that, he momentarily paused and threw off his quilt. His previously focused face became gloomy, his voice now revealing a cold tone, “One year has already passed and yet I am still not a one star Dou Zhe. If things keep on going at this rate...I’m afraid I won’t be able to catch up to Nalan Yanran in three years.”\u003c/p\u003e\n\u003cp\u003eUpon hearing this, Yao Lao raised an eye to look at him but remained silent.\u003c/p\u003e\n\u003cp\u003e“Nalan Yanran is being trained to be the Faction of Misty Cloud’s next Faction leader. Her talent cannot be said to be low at all and the Faction of Misty Cloud is quite strong as well. They even have the formidable alchemist Pill King Gu He amongst their ranks...if he were to help Nalan Yanran, her speed would be terrifying. It would be no slower than my training speed.” Xiao Yan thought aloud to himself.\u003c/p\u003e\n\u003cp\u003eYao Lao tilted his head at Xiao Yan and saw Xiao Yan’s bright crystal like eyes focus closely on himself. Yao Lao immediately started to laugh but still made no comment.\u003c/p\u003e\n\u003cp\u003eLooking at Yao Lao’s face, Xiao Yan could only roll his eyes. His words were pointless...\u003c/p\u003e\n\u003cp\u003e“Heh…”After staying silent for some time, Yao Lao slowly sighed. Standing up to walk towards Xiao Yan, his lips began to curl into a smile: “That Gu He fellow isn’t anything more than a 6th tier Alchemist. Is he even worthy to be called a Pill King? Other than refining pills, what else can he do?”\u003c/p\u003e\n\u003cp\u003eHearing Yao Lao talk in this manner, Xiao Yan’s face suddenly adopted a smiling expression. At this moment, he knew that the mysterious teacher was finally about to show his hand...\u003c/p\u003e\n\u003cp\u003e“Tomorrow, you will go buy some materials. Qi Gathering Powder, you will be eating it like it’s candy… I don’t believe that this Nalan will have this sort of treatment!” With both hands behind his back, Yao Lao sneered proudly.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-52\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-54\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-53","bookId":1497,"creation":"Sep 10, 2019 3:24:52 AM","modification":"Sep 10, 2019 3:24:52 AM"}
