{"id":46695,"no":61,"title":"Chapter 61: Disguise","content":"\u003cp\u003e\u003cstrong\u003e\u003cu\u003eChapter 61\u003cu\u003e\u003cstrong\u003e:\u003c/strong\u003e\u0026nbsp;\u003c/u\u003eDisguise\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile the three clans began to leave through the entrance of the auction house, the respective clan leaders gave phony smiles and unpleasant laughs; as they left each other’s sights, a trace of hostility and mockery appeared on their faces.\u003c/p\u003e\n\u003cp\u003eThe three clans swaggered across the hall as they left and whenever they passed by, the people would quickly move aside.. In Wu Tang City, there were virtually no other powers that could rival the three great clans.\u003c/p\u003e\n\u003cp\u003eOnce again, Xiao Zhan half-heartedly said a few words to the nearby Ao Ba Pa. Suddenly, Xiao Zhan’s movements stiffened and his footsteps halted.\u003c/p\u003e\n\u003cp\u003eLooking at Xiao Zhan’s movements, everyone shifted their gazes to his line of sight, and their bodies could not help but tremble slightly. Even Jie Lie Bi and Ao Ba Pa’s faces changed a bit.\u003c/p\u003e\n\u003cp\u003eAt the hall’s other entrance, three figures slowly walked out. The person leading them was unexpectedly Primer Auction House’s chief auctioneer Ya Fei. As frequent customers of the auction, Xiao Zhan and others all knew this woman’s true face. Although this woman usually puts on an appearance filled with smiles, everyone knew that this woman was actually very arrogant. Previously, Ao Ba Pa wanted to invite her to have a meal but was directly met with an exceptionally “polite” refusal. From this incident, people understood that this woman, unlike her outward appearance, was not easy to get close to.\u003c/p\u003e\n\u003cp\u003eToday however, this haughty woman, contrary to her normal self, was respectfully guiding guests. This really did make Xiao Zhan and the others amazed.\u003c/p\u003e\n\u003cp\u003eEyes blinking a little, Xiao Zhan and the others’ gaze shifted once more to the rear and their faces continued to change.\u003c/p\u003e\n\u003cp\u003eAt the back of the group of three, the Auction’s alchemist elder Gu Ni was smiling and said a few words into the ears of a mysterious black-hooded person. His smiling expression was all over his face, so much so that a trace of flattery could be seen.\u003c/p\u003e\n\u003cp\u003eIf Ya Fei’s deferential attitude had caused Xiao Zhan and the others to feel amazed, then the attitude Gu Ni displayed made them feel stunned.\u003c/p\u003e\n\u003cp\u003eAs Wu Tan City’s highest ranked alchemist, usually only the three clan heads could meet him. When they did, they were respectful and did not dare to be impolite in the slightest.\u003c/p\u003e\n\u003cp\u003eAs a 2nd tier alchemist, Gu Ni maintained that pride of being an alchemist. When he spoke, he spoke indifferently, making others revere him even more.\u003c/p\u003e\n\u003cp\u003eBut this type of person, he unexpectedly showed such respect without even trying to hide his flattering smiles. That … … that person he’s trying to win the favor of.. Who could this person be?\u003c/p\u003e\n\u003cp\u003eThe sight brought shock. Finally, their gazes slowly shifted onto the center’s black-cloaked figure.\u003c/p\u003e\n\u003cp\u003eSweeping over the shadowy figure’s plump stature, Xiao Zhan anxiously thought in his mind, “Who is this person? Someone who can make Primer Auction House’s most important people respectfully send him off? What would a person of this level come to Wu Tan City for?”\u003c/p\u003e\n\u003cp\u003eLicking his somewhat dry lips, Xiao Zhan looked around from left to right and actually found that Jia Lie Bi and Ao Ba Pa were also curious and shocked.\u003c/p\u003e\n\u003cp\u003eRaising his eyes expectantly at the three incoming people, Xiao Zhan’s face squeezed out a small smile, walked forward two steps, and smiled: “Lady Ya Fei, Gu Ni elder. Ha ha. It really is rare to see you two appear together.”\u003c/p\u003e\n\u003cp\u003eWhen Ya Fei and Gu Ni came out earlier, the two had already caught sight of the clan leaders. Looking at Xiao Zhan coming out to speak, their movements were still the same. But only after the black-cloaked person stopped did they heave a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Ha ha. We’re sending off a precious guest, that’s all.” Ya Fei lightly laughed.\u003c/p\u003e\n\u003cp\u003e“Oh. Ha ha…” Jia Lie Bi also approached smiling. Shortly after, his gaze shifted from Ya Fei to the black-hooded person and politely asked: “Ha ha. I don’t know if this mister … … is also from Wu Tang City? Ha ha, you look somewhat unfamiliar to me.”\u003c/p\u003e\n\u003cp\u003e“Cough … Jia Lie Clan Elder, this mister is Primer Auction House’s precious guest … ….” Gu Ni elder’s eyebrows furrowed and coughed to warn Jia Lie Bi to not ask questions carelessly .\u003c/p\u003e\n\u003cp\u003eHearing Gu Ni elder’s warning tone, Jia Lie Bi’s complexion slightly changed and whispered to himself: “Even Gu Ni elder acts this fearfully? What is this person’s identity?”\u003c/p\u003e\n\u003cp\u003eSeeing how Jia Lie Bi was met with a tactful retort, Xiao Zhan swallowed what he was about to say. Looking at Gu Ni’s cautious stance, this black-cloaked person was obviously on a completely different level of existence from them. At the moment, he had no choice but to laugh a bit and then tactfully withdraw.\u003c/p\u003e\n\u003cp\u003e“You …. …. are Xiao Zhan of the Xiao Clan, right?” Just when Xiao Zhan was about to withdraw, the silent black-cloaked person suddenly asked in a dull tone.\u003c/p\u003e\n\u003cp\u003eHearing this elderly voice, Xiao Zhan stared blankly a bit. Soon after, he hesitated and then nodded.\u003c/p\u003e\n\u003cp\u003e“I heard that the young master of your clan relied on this Foundation Elixir to leap to the 9th Duan Qi. Ha ha, this really causes me to be in awe.” The black-cloaked person laughed dully.\u003c/p\u003e\n\u003cp\u003eMet with this sort of courteous treatment, Xiao Zhan felt delight in his heart and smiled: “My son has good luck.”\u003c/p\u003e\n\u003cp\u003eWaving his hands in a carefree manner, the black-cloaked person smiled: “Luck is also part of one’s power. In the future if there is ever an opportunity, I would like to meet him. Maybe he can even become an alchemist.”\u003c/p\u003e\n\u003cp\u003eIn a somewhat stunned manner, Xiao Zhan appeared as if he did not understand what the elder was saying.\u003c/p\u003e\n\u003cp\u003e“Ok…. …. in the future if there is ever an opportunity, I will look for your Xiao Clan to collaborate together.” Smiling, the black-cloaked person turned around to face Ya Fei and Gu Ni: “There’s no need to send me off, I still have some business to do. I will leave first.”\u003c/p\u003e\n\u003cp\u003eAfter speaking, Xiao Yan didn’t wait for their reactions and walked in big strides out of the auction house.\u003c/p\u003e\n\u003cp\u003eStroking his face in an ineffable way, Xiao Zhan turned his head and actually saw Ya Fei and Gu Ni staring at him, faces filled with envy.\u003c/p\u003e\n\u003cp\u003e“Xiao Clan Leader, do you recognize that old mister?” Ya Fei asked.\u003c/p\u003e\n\u003cp\u003e“It was my first time seeing him.” Xiao Zhan forced a smile and shook his head nervously towards Ya Fei and Gu Ni, who held strange expressions on their faces.\u003c/p\u003e\n\u003cp\u003e“Sigh, the Xiao family has been blessed.”\u003c/p\u003e\n\u003cp\u003eGu Ni gently shook his head. He shot a glance at the Foundation Elixirs, which Jia Lie Bi held tightly to his chest as if they were precious treasures, and said indifferently: “Those things were refined by him.”\u003c/p\u003e\n\u003cp\u003eHaving heard what was said, the complexions of the three family heads changed wildly.\u003c/p\u003e\n\u003cp\u003eAfter a short while, Xiao Zhan’s face lit up with delight; he hadn’t expected that the black-cloaked elder would be an alchemist. Looking at Gu Ni’s previous attitude, it was clear that the elder was a much higher ranked alchemist than even Gu Ni!\u003c/p\u003e\n\u003cp\u003eIf a second tier alchemist was able to make them courteous and modest, then what about a third or even a fourth tier alchemist?\u003c/p\u003e\n\u003cp\u003eHeavens, his kind of clan did not have the qualifications to even meet this type of senior.\u003c/p\u003e\n\u003cp\u003e“We’ve profited greatly this time….” Thinking back to when that black-hooded person offered to collaborate in the future, Xiao Zhan’s two eyes immediately lit up and he involuntarily mumbled to himself.\u003c/p\u003e\n\u003cp\u003eTo the side, after their shock faded, Jia Lie Bi and Ao Ba Pa’s eyes flashed with envy as if they were like rabbit’s eyes.\u003c/p\u003e\n\u003cp\u003eTL: Rabbit eyes are red \u003d red eyes \u003d envy\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-60\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/battle-through-the-heavens/btth-chapter-62\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/battle-through-the-heavens/btth-chapter-61","bookId":1497,"creation":"Sep 10, 2019 3:24:52 AM","modification":"Sep 10, 2019 3:24:52 AM"}
