{"id":64596,"no":4,"title":"Page 4","content":"\u003cp\u003eI scramble to my feet, then shove my way through the people as the soldiers gather to inspect the burst tire of their truck. At least I banged up one of their precious vehicles, I think darkly.\u003c/p\u003e\n\u003cp\u003eI make my way back to the pier where Charlie’s crew works. By the time I get there, my knee’s sore. I’m sweaty and exhausted. Charlie sees me from a distance, jumps down from the stack of crates she’s sitting on, and rushes over. “There you are,” she says. She seems to have composed herself since her earlier outburst. Her eyes run over my damp clothes. “Where’d you go?”\u003c/p\u003e\n\u003cp\u003eI just shrug. I pull the two tins of meat out of my pockets. “There was some sort of commotion down the street,” I reply, handing her the tins. “Truck overturned. I grabbed these. Sorry—they wouldn’t let us get any closer. How’s your dad?”\u003c/p\u003e\n\u003cp\u003e“He’s okay. He’s taken harder hits before.” Charlie gives me a wry smile of thanks, but hands the tins back to me. “You keep these. Two tins won’t do us much good.” She looks over her shoulder at the crew. Then she bends down, leans toward my ear, and whispers, “That was you, wasn’t it? You saw the whole thing this morning. You found some way to mess that truck up, didn’t you?”\u003c/p\u003e\n\u003cp\u003eI blink at her. “I—”\u003c/p\u003e\n\u003cp\u003eCharlie grins when she sees my guilty expression. “Yeah, we were out there too. Your little stunt let some of my dad’s crew get in there and grab a few of our crates back.”\u003c/p\u003e\n\u003cp\u003eThe weight on my chest lifts a little. I look at her in surprise, and then break into a small smile. “You guys were there? You saw the truck?”\u003c/p\u003e\n\u003cp\u003eCharlie’s eyes study mine. For a moment, it’s as if she can see right into my heart. “You got a death wish or something?” she finally says. She reaches up to ruffle my hair. “I’ll hand it to you—you’ve got some nerves of steel, running off like that and messing up a city patrol’s truck.”\u003c/p\u003e\n\u003cp\u003eI blush, then look down at my feet. “Just got lucky,” I mutter. But deep down, I can’t help feeling a spark of pride. They’d gotten some of their supplies back. Maybe my stunt hadn’t been useless after all.\u003c/p\u003e\n\u003cp\u003eCharlie’s expression softens. Her hand lifts my chin so that I meet her stare. She leans down and gives me an affectionate peck on the lips. “Thank you,” she says. “You’re a good kid. I bet the Republic hasn’t seen the last of you.”\u003c/p\u003e\n\u003cp\u003eI sleep on the boat’s deck with the crew that night. But early the next morning, when dawn has barely reached the water’s edge and Charlie’s eyes are still closed, I get up and sneak quietly away. I take nothing with me except my few trinkets and tins of food. I don’t look at her one last time, and I don’t leave her any notes or say good-bye. The air is cool, nipping at my cheeks and lips, a reminder of the empty space around me. I keep my hands in my pockets and my head held high. My hair is loose.\u003c/p\u003e\n\u003cp\u003eI can’t stay here. If anything, yesterday’s events reminded me very clearly of why I wander the streets alone, why I don’t dare let myself get tangled up in relationships with anyone else out here in Lake. Soldiers had attacked Charlie’s dad just for falling short on a shipment—what would happen to them if the soldiers found out that they were harboring a boy who’d escaped from the Republic’s labs? A boy who’s supposed to be dead? Dad had always told me to move forward, never backward.\u003c/p\u003e\n\u003cp\u003eSo I keep my toes pointed away from the pier and inland toward the slums. Best to be alone out here. I’m a floating soul, a phantom . . . I belong nowhere. Charlie’s words echo in my mind.\u003c/p\u003e\n\u003cp\u003eI bet the Republic hasn’t seen the last of you.\u003c/p\u003e\n\u003cp\u003eI smile. No, I sincerely hope that they haven’t.\u003c/p\u003e\n\u003cp\u003eMy feet feel heavy, but they don’t make a sound. \u003c/p\u003e","sourceLink":"https://allnovel.net/life-before-legend-legend-0-5/page-4.html","bookId":1693,"creation":"Oct 5, 2019 9:55:00 AM","modification":"Oct 5, 2019 9:55:00 AM"}
