{"id":34632,"no":13,"title":"Chapter 13 Mr. Marvel Discusses His Resignation","content":"\u003cp\u003eWhen the dusk was gathering and Iping was just beginning to peep timorously forth again upon the shattered wreckage of its Bank Holiday, a short, thick-set man in a shabby silk hat was marching painfully through the twilight behind the beechwoods on the road to Bramblehurst. He carried three books bound together by some sort of ornamental elastic ligature, and a bundle wrapped in a blue table-cloth. His rubicund face expressed consternation and fatigue; he appeared to be in a spasmodic sort of hurry. He was accompanied by a voice other than his own, and ever and again he winced under the touch of unseen hands.\u003c/p\u003e \n\u003cp\u003e\"If you give me the slip again,\" said the Voice, \"if you attempt to give me the slip again--\"\u003c/p\u003e \n\u003cp\u003e\"Lord!\" said Mr. Marvel. \"That shoulder\u0027s a mass of bruises as it is.\"\u003c/p\u003e \n\u003cp\u003e\"On my honour,\" said the Voice, \"I will kill you.\"\u003c/p\u003e \n\u003cp\u003e\"I didn\u0027t try to give you the slip,\" said Marvel, in a voice that was not far remote from tears. \"I swear I didn\u0027t. I didn\u0027t know the blessed turning, that was all! How the devil was I to know the blessed turning? As it is, I\u0027ve been knocked about--\"\u003c/p\u003e \n\u003cp\u003e\"You\u0027ll get knocked about a great deal more if you don\u0027t mind,\" said the Voice, and Mr. Marvel abruptly became silent. He blew out his cheeks, and his eyes were eloquent of despair.\u003c/p\u003e \n\u003cp\u003e\"It\u0027s bad enough to let these floundering yokels explode my little secret, without _your_ cutting off with my books. It\u0027s lucky for some of them they cut and ran when they did! Here am I ... No one knew I was invisible! And now what am I to do?\"\u003c/p\u003e \n\u003cp\u003e\"What am _I_ to do?\" asked Marvel, _sotto voce_.\u003c/p\u003e \n\u003cp\u003e\"It\u0027s all about. It will be in the papers! Everybody will be looking for me; everyone on their guard--\" The Voice broke off into vivid curses and ceased.\u003c/p\u003e \n\u003cp\u003eThe despair of Mr. Marvel\u0027s face deepened, and his pace slackened.\u003c/p\u003e \n\u003cp\u003e\"Go on!\" said the Voice.\u003c/p\u003e \n\u003cp\u003eMr. Marvel\u0027s face assumed a greyish tint between the ruddier patches.\u003c/p\u003e \n\u003cp\u003e\"Don\u0027t drop those books, stupid,\" said the Voice, sharply--overtaking him.\u003c/p\u003e \n\u003cp\u003e\"The fact is,\" said the Voice, \"I shall have to make use of you.... You\u0027re a poor tool, but I must.\"\u003c/p\u003e \n\u003cp\u003e\"I\u0027m a _miserable_ tool,\" said Marvel.\u003c/p\u003e \n\u003cp\u003e\"You are,\" said the Voice.\u003c/p\u003e \n\u003cp\u003e\"I\u0027m the worst possible tool you could have,\" said Marvel.\u003c/p\u003e \n\u003cp\u003e\"I\u0027m not strong,\" he said after a discouraging silence.\u003c/p\u003e \n\u003cp\u003e\"I\u0027m not over strong,\" he repeated.\u003c/p\u003e \n\u003cp\u003e\"No?\"\u003c/p\u003e \n\u003cp\u003e\"And my heart\u0027s weak. That little business--I pulled it through, of course--but bless you! I could have dropped.\"\u003c/p\u003e \n\u003cp\u003e\"Well?\"\u003c/p\u003e \n\u003cp\u003e\"I haven\u0027t the nerve and strength for the sort of thing you want.\"\u003c/p\u003e \n\u003cp\u003e\"_I\u0027ll_ stimulate you.\"\u003c/p\u003e \n\u003cp\u003e\"I wish you wouldn\u0027t. I wouldn\u0027t like to mess up your plans, you know. But I might--out of sheer funk and misery.\"\u003c/p\u003e \n\u003cp\u003e\"You\u0027d better not,\" said the Voice, with quiet emphasis.\u003c/p\u003e \n\u003cp\u003e\"I wish I was dead,\" said Marvel.\u003c/p\u003e \n\u003cp\u003e\"It ain\u0027t justice,\" he said; \"you must admit.... It seems to me I\u0027ve a perfect right--\"\u003c/p\u003e \n\u003cp\u003e\"_Get_ on!\" said the Voice.\u003c/p\u003e \n\u003cp\u003eMr. Marvel mended his pace, and for a time they went in silence again.\u003c/p\u003e \n\u003cp\u003e\"It\u0027s devilish hard,\" said Mr. Marvel.\u003c/p\u003e \n\u003cp\u003eThis was quite ineffectual. He tried another tack.\u003c/p\u003e \n\u003cp\u003e\"What do I make by it?\" he began again in a tone of unendurable wrong.\u003c/p\u003e \n\u003cp\u003e\"Oh! _shut up_!\" said the Voice, with sudden amazing vigour. \"I\u0027ll see to you all right. You do what you\u0027re told. You\u0027ll do it all right. You\u0027re a fool and all that, but you\u0027ll do--\"\u003c/p\u003e \n\u003cp\u003e\"I tell you, sir, I\u0027m not the man for it. Respectfully--but it _is_ so--\"\u003c/p\u003e \n\u003cp\u003e\"If you don\u0027t shut up I shall twist your wrist again,\" said the Invisible Man. \"I want to think.\"\u003c/p\u003e \n\u003cp\u003ePresently two oblongs of yellow light appeared through the trees, and the square tower of a church loomed through the gloaming. \"I shall keep my hand on your shoulder,\" said the Voice, \"all through the village. Go straight through and try no foolery. It will be the worse for you if you do.\"\u003c/p\u003e \n\u003cp\u003e\"I know that,\" sighed Mr. Marvel, \"I know all that.\"\u003c/p\u003e \n\u003cp\u003eThe unhappy-looking figure in the obsolete silk hat passed up the street of the little village with his burdens, and vanished into the gathering darkness beyond the lights of the windows.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/295/457.html","bookId":361,"creation":"Aug 5, 2019 5:48:13 AM","modification":"Aug 5, 2019 5:48:13 AM"}
