{"id":64957,"no":31,"title":"Page 31","content":"\u003cp\u003e“I have a small confession,” Reese said, breaking into her thoughts.\u003c/p\u003e\n\u003cp\u003eJacqueline wasn’t sure she wanted to hear it, but before she could stop him, he continued.\u003c/p\u003e\n\u003cp\u003e“You need to thank Tammie Lee for the roses. They were her idea.”\u003c/p\u003e\n\u003cp\u003eJacqueline picked up her wine. “Well, I didn’t think you’d come up with that idea on your own.”\u003c/p\u003e\n\u003cp\u003e“To Tammie Lee,” Reese said, holding up his wineglass.\u003c/p\u003e\n\u003cp\u003e“To Tammie Lee,” Jacqueline repeated.\u003c/p\u003e\n\u003cp\u003eThe phone rang and she sighed.\u003c/p\u003e\n\u003cp\u003e“I’ll get it.” Reese was out of his chair before she could protest.\u003c/p\u003e\n\u003cp\u003eFor once, just once, she wanted them to have a quiet dinner together. She wished now that she’d taken the phone off the hook.\u003c/p\u003e\n\u003cp\u003eWhoever was on the line certainly had Reese’s attention. His brow furrowed and he frowned and then nodded curtly. Replacing the receiver, he muttered, “I have to go.”\u003c/p\u003e\n\u003cp\u003e“Where?” Jacqueline asked before she would stop herself.\u003c/p\u003e\n\u003cp\u003e“Problems on the job.” He grabbed his car keys and was out the door. “I’m needed at one of the sites. Not Blossom Street—the Northgate project. It appears we blew a circuit and the entire block is without electricity.”\u003c/p\u003e\n\u003cp\u003eSitting alone at the table, listening as Reese’s car engine roared to life, Jacqueline felt numb.\u003c/p\u003e\n\u003cp\u003eA moment later, she flung her napkin furiously onto her plate and walked over to the sink. She grabbed the counter with both hands, biting down hard on her lower lip.\u003c/p\u003e\n\u003cp\u003e“He’s needed at the site,” she repeated, her voice cracking. She knew exactly who’d phoned and exactly where he’d gone and it wasn’t to any job site.\u003c/p\u003e\n\u003cp\u003eCHAPTER 30\u003c/p\u003e\n\u003cp\u003eALIX TOWNSEND\u003c/p\u003e\n\u003cp\u003eS unday morning, Alix found herself standing on the same street corner she had for the last few weeks, watching as people filed through the church doors. Ordinary people, some wealthy and some not. People like those in her knitting group. People like Carol Girard and her husband.\u003c/p\u003e\n\u003cp\u003eHaving lunch at Carol’s high-rise condo had been an eye-opening experience. Literally! The view was incredible, unlike anything she’d seen before. She might live in Seattle, but she certainly never saw it from this perspective. And Puget Sound was beyond fabulous. Alix felt as if she’d stepped right onto a page in one of those fancy home decorating magazines people left behind at the Laundromat. The condo itself was spacious. The furniture was simple and classic, and there were lots of warm, appealing touches. One thing was for sure. Alix had no intention of returning the invitation. She could just imagine what Carol would think if she saw the inside of her apartment. Especially now, since Laurel had taken to being even a bigger slob than usual.\u003c/p\u003e\n\u003cp\u003eCarol had made a lovely lunch of cold tomato soup—a Spanish recipe, she’d said—and a seafood salad. She’d set the table with beautiful matching dishes, complete with linen napkins. A few weeks ago Alix would have considered details like that pointless, but these days she was taking notice. This was exactly the type of thing she needed to know if she hoped to start her own business one day. Alix had been nervous at first, afraid she might commit some social blunder by using the wrong fork. If Jacqueline had been there, she would’ve been more worried, but Carol was a normal kind of person. Funny, with all that wealth, she still had her problems.\u003c/p\u003e\n\u003cp\u003eEveryone had problems, Alix now realized, even if they lived in gorgeous apartments with million-dollar views. Over lunch she and Carol covered a lot of subjects, and after a while, it felt just as if they were in the knitting group at Lydia’s shop. Alix had never expected to become friends with these women but that was exactly what had happened. Even with Jacqueline…\u003c/p\u003e\n\u003cp\u003eAll of them encouraged her to pursue the relationship with Jordan.\u003c/p\u003e\n\u003cp\u003eFollowing the roller-skating party, Alix had seen him only once. He’d stopped by the video store to tell her he was going out of town. Apparently he was involved in a summer camp program and was driving some kids to eastern Washington. He’d mentioned sending her a postcard, but if he’d mailed one, she hadn’t received it. That had been on her mind ever since he’d gone away.\u003c/p\u003e\n\u003cp\u003eAs she stood on the corner across from the Free Methodist church, the music drifted out the open doors. Alix recognized the song, which she’d heard several times before. For some reason she couldn’t identify, she boldly marched across the street and up the steps. As she did, she glanced around, half expecting someone to stop her.\u003c/p\u003e\n\u003cp\u003eShe missed Jordan, and if walking into this church was the only way she could feel close to him, then she was doing it. Anyone who questioned her was in for one hell of a fight.\u003c/p\u003e\n\u003cp\u003eAn usher looked in her direction, but she scowled at him with such ferocity that he backed off. She didn’t need anyone to tell her where to sit. Slipping into the last pew, she saw that people were standing and singing. She grabbed what she assumed was the hymnal and picked up a Bible instead. She wondered if anyone noticed. As casually as she could, she replaced the Bible and grabbed the red book, opening it to the number posted on a board at the front of the church.\u003c/p\u003e\n\u003cp\u003eThe sanctuary was surprisingly crowded. Alix had no idea so many people actually attended services. Perhaps if her family had prayed together, they might have stayed together. Yeah, right! As a kid she’d done her fair share of praying and a lot of good that had done her. A familiar bitterness welled up inside. These kids were lucky. They had parents who cared about them. By her own choice, Alix was no longer in contact with her mother and hadn’t seen her father in years. He hadn’t even bothered to show up when Tom died. As she thought of her brother, her hand tightened around the hymnal. All Tom had ever wanted was someone to care about him. They’d both been cheated in that department; their father was more interested in drinking with his friends than he was in his children, and their mother was no better. Little wonder they’d had serious problems of their own, but Alix was determined to have a better life.\u003c/p\u003e\n\u003cp\u003eShe studied the words printed on the page but didn’t sing. One of Alix’s fears was that she wouldn’t know when to stand or sit. That was the advantage of being in the back pew—she simply followed what everyone else was doing.\u003c/p\u003e\n\u003cp\u003eWhen the song ended, the congregation sat down and the minister, an older man, stepped up to the podium. Alix figured she’d leave after the sermon, afraid that if she stood up and walked out now, someone might be offended.\u003c/p\u003e\n\u003cp\u003eThe minister preached from the Old Testament and the book of Nehemiah, which Alix had never heard of before. The sermon, about the ruined walls of Jerusalem and how they symbolized people’s lives, interested her, although she didn’t understand everything he said.\u003c/p\u003e\n\u003cp\u003eAlix was just getting ready to slip out of the pew when she saw Jordan walk to the front of the church. He was obviously back from summer camp, although he hadn’t come by the video store.\u003c/p\u003e\n\u003cp\u003eShe tried to ignore the disappointment and the hurt. Seeing him in church wasn’t the only shock she received. Jordan wasn’t alone. A blond beauty came with him. The girl eyed Jordan like he was Jesus returning to collect His saints before Armageddon.\u003c/p\u003e\n\u003cp\u003eThe two of them had handheld microphones. The music started, and their voices blended as if they’d been singing together their entire lives. Listening to their performance was more than Alix could bear. In an effort to exit the pew as fast as possible, she nearly stumbled over the feet of the woman next to her. Without looking back, she rushed out the door.\u003c/p\u003e\n\u003cp\u003eIf she’d needed proof that she was deluding herself, this was it. Reeling, she ran into an alley. She closed her eyes and called herself every ugly name she’d ever heard. With her back against the brick wall, she slid down and hung her head.\u003c/p\u003e\n\u003cp\u003eNaturally Jordan would be singing in church with Miss America. And why not? He was a preacher’s kid; he’d been raised in the church. He’d never sat in a jail cell or stood before a judge. His parents had loved him, wanted him. She could just imagine what his daddy would say if he knew Jordan was hanging with her.\u003c/p\u003e\n\u003cp\u003eAlix squatted there, caught in a misery so deep she could barely move.\u003c/p\u003e\n\u003cp\u003e“Hey, Alix?”\u003c/p\u003e\n\u003cp\u003eA voice drifted into her awareness, and she glanced up to find Tyrone Houston, better known in the neighborhood as T-Bone, standing above her. He was a gang member and a known drug dealer. The last Alix had heard he was doing time. Apparently he was out.\u003c/p\u003e\n\u003cp\u003e“Whatcha doin’?” T-Bone demanded.\u003c/p\u003e\n\u003cp\u003e“Taking up space. You got a problem with that?” Normally no one flashed attitude to T-Bone and she could be risking her life. For a second, she wasn’t sure she cared.\u003c/p\u003e\n\u003cp\u003e“No problem. You interested in a party?” He gave her the once-over.\u003c/p\u003e\n\u003cp\u003eIn her present frame of mind, Alix was in no mood for company.\u003c/p\u003e\n\u003cp\u003e“I got the stuff,” he said enticingly.\u003c/p\u003e\n\u003cp\u003eThat meant he had a fresh supply of drugs. Probably meth or cocaine or any of a dozen different substances guaranteed to shut up the voices in her head.\u003c/p\u003e\n\u003cp\u003e“I could be,” Alix said. She’d been clean a long time—ever since her brother had overdosed—but she hated this dark ugly feeling eating at her gut. If she could swallow something to make her feel good, she wanted it because whatever T-Bone had was better than these awful voices.\u003c/p\u003e\n\u003cp\u003eThe house was a couple of blocks away. Everyone in the area knew that if you needed a hit, T-bone would supply it—for a price, naturally. Alix didn’t know his sources, didn’t want to know.\u003c/p\u003e\n\u003cp\u003eWhen they stepped into the house, the shades were drawn and the room was dark. Five or six guys were lounging around and the air was thick with sweet-smelling smoke. Alix buried her hands in her leather jacket as she slowly surveyed the scene.\u003c/p\u003e\n\u003cp\u003eIn one corner she noticed another girl sitting with a guy. His arm was wrapped around her and he appeared to be out of it, in a drug-induced haze. Alix looked again, harder this time. The girl seemed familiar, but Alix couldn’t figure out how she knew her. Working at the video store she saw a lot of people; while she might not remember names, she rarely forgot a face.\u003c/p\u003e\n\u003cp\u003eThis girl hadn’t been in the video store, Alix was fairly certain of that. She was young, fourteen, possibly fifteen, and trying to look older. Alix knew the signs because a few years back she’d done the same thing.\u003c/p\u003e\n\u003cp\u003eThen it came to her. The girl was familiar because Alix had seen her at the roller-skating rink with Jordan. She was a church kid. The girl recognized Alix, too. She averted her gaze.\u003c/p\u003e\n\u003cp\u003eAnger surged through Alix. This kid didn’t belong here with a bunch of druggie losers.\u003c/p\u003e\n\u003cp\u003eShe strolled to the sofa where the girl sat with her stoned boyfriend in a tangle of arms and legs. Alix sat down on the sofa arm and glared at them.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?” she demanded of the girl.\u003c/p\u003e\n\u003cp\u003eThe teenager glared back at Alix, her eyes full of defiance. “Same as you.”\u003c/p\u003e\n\u003cp\u003eThe guy she was with rolled his head and pointed at Alix. “Who’s this, Lori?”\u003c/p\u003e\n\u003cp\u003eYes, Alix remembered her now. Her name was Lori and she’d come with a couple of friends. Roller skating with church kids one month, doing drugs with criminals and losers the next. Quite a contrast.\u003c/p\u003e\n\u003cp\u003eLori stared up at Alix, her face hard and her eyes cold. “This,” she said, sneering, “is no one.”\u003c/p\u003e\n\u003cp\u003e“That’s where you’re wrong,” Alix said as she came to her feet. “Sorry, we have to go now.” She grabbed Lori by the arm. The girl protested but let Alix pull her up. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1/page-31.html","bookId":1933,"creation":"Oct 5, 2019 9:56:23 AM","modification":"Oct 5, 2019 9:56:23 AM"}
