{"id":64960,"no":34,"title":"Page 34","content":"\u003cp\u003e“Didn’t you hear me?” she sobbed, her shoulders shaking uncontrollably. “I lost the baby.”\u003c/p\u003e\n\u003cp\u003e“I know,” Doug whispered and wrapped her in his arms.\u003c/p\u003e\n\u003cp\u003eCarol was weeping again, unable to stop. The tears came from deep inside her, sobs that wrenched her soul. This was an agony that could be understood only by those who’d experienced such a loss. It felt as if her beating heart had been ripped from her chest, as if she would never again know joy or happiness or anything good. Her future stretched before her, bleak and without hope.\u003c/p\u003e\n\u003cp\u003e“I so badly wanted to have our child,” she sobbed into her husband’s arms.\u003c/p\u003e\n\u003cp\u003eDoug held her tightly in his embrace, his head against her shoulder. Then she realized he was weeping, too. They clung to each other, neither able to offer anything to the other. Empty, bereaved, in agony.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” she choked out. “So sorry.”\u003c/p\u003e\n\u003cp\u003e“I know…I know.”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“I tried so hard…” She couldn’t think of anything she might have done differently, any effort she hadn’t made.\u003c/p\u003e\n\u003cp\u003e“I’ll always love you,” Doug assured her.\u003c/p\u003e\n\u003cp\u003eExhausted, Carol showered and went to bed and with Doug’s arms around her, she fell into a deep sleep.\u003c/p\u003e\n\u003cp\u003eAt three, she woke with pain heavy upon her chest and remembered there was no longer a child growing in her womb. The tears came fresh, stinging her eyes.\u003c/p\u003e\n\u003cp\u003eSlipping out of bed, she walked into the nursery and stood in the middle of the darkened room. She curled her fingers around the end of the crib and bit her lower lip hard to hold back the sobs.\u003c/p\u003e\n\u003cp\u003eIt was then that she noticed the wall. She squinted, certain she was seeing things. Flicking on the light switch, she looked again. Her knees went weak and she sagged to the floor as she stared at the place where her husband’s fist had gone through the wall.\u003c/p\u003e\n\u003cp\u003eCHAPTER 33\u003c/p\u003e\n\u003cp\u003eJACQUELINE DONOVAN\u003c/p\u003e\n\u003cp\u003eF riday afternoon Jacqueline arrived at A Good Yarn, her usual five minutes after starting time. Being “fashionably late” was a habit she’d picked up long ago and seemed unable to break. To her surprise, Carol was missing. Alix was slouched down in her chair with a morose look on her face.\u003c/p\u003e\n\u003cp\u003e“Where’s Carol?” she asked Lydia, who stood at the end of the table, knitting needles in hand. Lydia carried her yarn and needles around with her, so her hands were constantly busy.\u003c/p\u003e\n\u003cp\u003e“Carol decided to stay home this afternoon,” Lydia explained. “I’m afraid she had bad news. She lost the baby.”\u003c/p\u003e\n\u003cp\u003eJacqueline had feared as much. “I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“She’s taking a few days to regroup, but I hope she’ll be back.”\u003c/p\u003e\n\u003cp\u003eJacqueline nodded; she felt terrible for Carol. The other woman’s desire for a child was so strong it verged on desperation. Jacqueline was worried about her and hoped Carol could, somehow, rebound from the loss. She recalled her own bitter disappointment over her inability to give birth to a second child, but at least she’d been able to have Paul. The likelihood that Carol and Doug would get a baby through adoption was slim. Jacqueline sighed. This was a sad turn of events, and there wasn’t a thing any of them could do.\u003c/p\u003e\n\u003cp\u003e“I’m afraid we might lose Carol,” Lydia said.\u003c/p\u003e\n\u003cp\u003e“Why? What do you mean?” Alix asked, anxiety in her voice.\u003c/p\u003e\n\u003cp\u003e“She didn’t say anything, but I think she might be returning to work. The only reason she quit was for the baby, and she told me a couple of weeks ago that the brokerage firm would like her to come back.”\u003c/p\u003e\n\u003cp\u003eAlix looked, if anything, even more dejected.\u003c/p\u003e\n\u003cp\u003eJacqueline wondered what was bothering her so much. Worry about Carol was obviously part of it, but Jacqueline sensed that something else was wrong.\u003c/p\u003e\n\u003cp\u003e“How are you, Alix?” Jacqueline murmured, reaching inside her bag for her knitting. She was working on a scarf for her son. It was a lovely worsted wool, the same brown shade as a pony Paul had loved as a child. Jacqueline wondered if her son would remember Brownie and make the connection.\u003c/p\u003e\n\u003cp\u003e“Hi,” Alix murmured, keeping her head lowered.\u003c/p\u003e\n\u003cp\u003eJacqueline looked to Lydia, who shrugged, indicating she didn’t know what was wrong, either. The shop grew quiet, the silence broken only by traffic noises from outside.\u003c/p\u003e\n\u003cp\u003eAlix glanced up, and Jacqueline saw that she was no longer working on the man’s sweater she’d taken over from Carol. In fact, she was knitting something entirely different.\u003c/p\u003e\n\u003cp\u003e“What’s your problem?” Jacqueline asked bluntly.\u003c/p\u003e\n\u003cp\u003e“That’s my business.” Alix’s eyes flared to life as if she’d welcome a verbal confrontation.\u003c/p\u003e\n\u003cp\u003e“Man trouble if I’ve ever seen it,” Jacqueline announced to Lydia, who grinned slightly and nodded in agreement.\u003c/p\u003e\n\u003cp\u003eAlix’s mouth thinned but she didn’t take the bait.\u003c/p\u003e\n\u003cp\u003e“My guess is it involves that minister you’re dating.”\u003c/p\u003e\n\u003cp\u003e“We weren’t dating…. We were just friends.”\u003c/p\u003e\n\u003cp\u003e“Past tense?” Lydia pried gently. “You aren’t seeing him anymore?”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen him in a while. He’s got more than one friend, if you know what I mean.”\u003c/p\u003e\n\u003cp\u003e“You saw him with someone else,” Jacqueline guessed.\u003c/p\u003e\n\u003cp\u003eAlix’s head was so low her chin sank into her chest when she nodded.\u003c/p\u003e\n\u003cp\u003e“Someone pretty,” she mumbled. “And blond.” The girl in church.\u003c/p\u003e\n\u003cp\u003e“Naturally,” Jacqueline added. She’d always imagined that Reese’s mistress was blond, and regarded with suspicion any blonde who came near him. Not that she cared, she told herself, but Jacqueline had to admit she occasionally wondered what the woman looked like. At the same time, she didn’t want to know. In fact, she usually tried not to think about her at all.\u003c/p\u003e\n\u003cp\u003eJacqueline’s marriage, what was left of it, had been strained since the night Reese had walked out on their dinner. She hadn’t forgiven him; more than that, she’d avoided him.\u003c/p\u003e\n\u003cp\u003eReese hadn’t made any effort to bridge the gap, either. Apparently, finding his roses stuffed in the garbage the next morning had been message enough.\u003c/p\u003e\n\u003cp\u003eThe three of them sat knitting together in silence. Lydia had to put her own knitting aside twice to help customers, and that left Jacqueline alone with Alix.\u003c/p\u003e\n\u003cp\u003eJacqueline wasn’t sure what prompted the idea, but once it took hold in her mind, it refused to leave.\u003c/p\u003e\n\u003cp\u003e“I owe you a favor,” she announced with some fanfare.\u003c/p\u003e\n\u003cp\u003e“For what?”\u003c/p\u003e\n\u003cp\u003eJacqueline was astonished that Alix had forgotten. “Dear girl, you might very well have saved my life.”\u003c/p\u003e\n\u003cp\u003eA hint of a smile came and then quickly vanished. Alix shrugged as if her stepping into the alley that day and standing up to those hoodlums was just a routine incident. An ordinary, everyday event.\u003c/p\u003e\n\u003cp\u003e“It’s time I repaid your kindness,” she said decisively.\u003c/p\u003e\n\u003cp\u003eAlix was plainly curious. “How?”\u003c/p\u003e\n\u003cp\u003e“I think,” Jacqueline said with flair, “that we’ll go for a complete makeover. My treat, naturally.”\u003c/p\u003e\n\u003cp\u003e“A what?”\u003c/p\u003e\n\u003cp\u003e“A beauty treatment.”\u003c/p\u003e\n\u003cp\u003eAlix frowned. “What good’s that going to do?”\u003c/p\u003e\n\u003cp\u003e“It might get you noticed by a certain young man.”\u003c/p\u003e\n\u003cp\u003e“What kind of beauty treatment?” Alix tried to disguise her interest, but she didn’t fool Jacqueline.\u003c/p\u003e\n\u003cp\u003e“We’d start with your hair.” Jacqueline examined the purple-tinted ends with a critical eye and resisted the urge to cringe. That dreadful color had to go. Motioning with her hand, she offered a few suggestions. “Get it cut and styled. Perhaps dye it a different color.”\u003c/p\u003e\n\u003cp\u003e“Only if I like it,” the girl said warily.\u003c/p\u003e\n\u003cp\u003e“Of course!”\u003c/p\u003e\n\u003cp\u003e“Any color I want?”\u003c/p\u003e\n\u003cp\u003e“Within reason.”\u003c/p\u003e\n\u003cp\u003eAlix made a careless movement with her shoulders. “I suppose that would be all right.” She acted as if she was doing Jacqueline a favor. Two months ago Jacqueline would have taken offense at that but now she knew it was simply posturing.\u003c/p\u003e\n\u003cp\u003e“I’d like to take you to my fashion consultant and—”\u003c/p\u003e\n\u003cp\u003eAlix was shaking her head even before Jacqueline had finished the sentence. “I don’t need any advice on how to dress.”\u003c/p\u003e\n\u003cp\u003e“Whatever you say, but I do think we should get you a couple of new outfits.”\u003c/p\u003e\n\u003cp\u003eStill Alix hesitated, but then she gave a halfhearted nod. “Your treat?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“I guess it’s okay. When do you want to do this?” She asked as if her social calendar was full.\u003c/p\u003e\n\u003cp\u003e“Soon.” Jacqueline set aside her knitting and retrieved her cell phone. “I’ll call Desiree right now. She’s the best hairdresser in town. It sometimes takes weeks to get an appointment.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Alix couldn’t hide her eagerness now. She sat up straight, nibbling on her lower lip.\u003c/p\u003e\n\u003cp\u003e“I need an appointment with Desiree ASAP,” Jacqueline said, hoping the receptionist caught the hint of urgency in her voice. Desiree was a top beautician and the prices she charged were enough to perm Jacqueline’s hair without chemicals. Still, she was worth every penny because of the miracles she performed. All the women at the country club went to her, and if they didn’t, they wanted to.\u003c/p\u003e\n\u003cp\u003eJacqueline waited impatiently while the receptionist put her on hold. It seemed forever before she returned. “Desiree says she’ll stay late this evening if you can be here by four-thirty.”\u003c/p\u003e\n\u003cp\u003e“Four-thirty?” She glanced at Alix, who nodded. “We’ll be there,” Jacqueline crowed triumphantly. She turned off the cell and placed it inside her purse. She felt certain that Alix didn’t realize her good fortune. Jacqueline had to book her haircuts a month in advance.\u003c/p\u003e\n\u003cp\u003eLydia was back, and although she hadn’t heard a lot of the conversation, she seemed to understand what was happening and nodded in approval. Jacqueline was on a mission now, confident that with a change in wardrobe and a decent haircut she could turn Alix into an attractive young woman. A thrill of excitement went through her. This was going to be fun.\u003c/p\u003e\n\u003cp\u003eAs soon as the knitting session was over, Jacqueline took Alix to Nordstrom for a new outfit. She purchased her own designer clothes at the Seattle-based department store, where one particular sales clerk had been in charge of Jacqueline’s wardrobe for years.\u003c/p\u003e\n\u003cp\u003eVictoria took one look at Alix and immediately went to work. Jacqueline accompanied the girl into the dressing room and was shocked at her lack of proper intimate apparel. She insisted on new bras and panties first, and none of those ridiculous and indecent thongs, either.\u003c/p\u003e\n\u003cp\u003eAlix made a fuss, but it didn’t last long. Still, while Jacqueline might have won that battle, Alix was the undisputed victor when it came to the war. She refused to even try on the St. John knitted suit or anything else Victoria delivered.\u003c/p\u003e\n\u003cp\u003eConsidering the limited time available today, Jacqueline had to be content with buying Alix good-quality underwear. Before she was through, she swore she’d get her into something tasteful.\u003c/p\u003e\n\u003cp\u003eUnfortunately, the trip to the hairdresser didn’t go much better. Desiree gasped at Alix’s purple-tinged hair and started swearing in French. Even after years of high school and college French classes, Jacqueline couldn’t understand what the woman said. But judging by the tone of her remarks, it was preferable not to attempt a translation. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1/page-34.html","bookId":1933,"creation":"Oct 5, 2019 9:56:23 AM","modification":"Oct 5, 2019 9:56:23 AM"}
