{"id":64961,"no":35,"title":"Page 35","content":"\u003cp\u003eJacqueline sat in the waiting area and sipped coffee while a verbal skirmish occurred in the background. Fortunately, most of the shop’s elite clientele had already departed; otherwise, their ears would’ve been assaulted by the ongoing exchange between Alix and Desiree.\u003c/p\u003e\n\u003cp\u003eNinety minutes after they arrived, Alix flew to the front of the salon as if she’d just been released from prison. Jacqueline hardly recognized her. Gone was the tar-black hair with the eggplant-purple highlights. Instead, Alix’s hair was a soft shade of brown with a reddish tinge that was similar to the yarn she’d chosen for Paul’s scarf.\u003c/p\u003e\n\u003cp\u003e“Alix,” she said, coming to her feet. Once again, Desiree had performed a miracle. Not only had she colored Alix’s hair but she’d styled it in a froth of curls.\u003c/p\u003e\n\u003cp\u003e“I hate it,” the girl cried as she ran her fingers through her hair, disarranging it. “This isn’t me.”\u003c/p\u003e\n\u003cp\u003e“No, my dear,” Jacqueline said patiently, “this is a new you.”\u003c/p\u003e\n\u003cp\u003eFor a moment it seemed Alix was about to burst into tears. “I look like…like one of the Brady Bunch,” she moaned.\u003c/p\u003e\n\u003cp\u003e“You look lovely.”\u003c/p\u003e\n\u003cp\u003e“Greg,” she cried. “I look like Greg from the Brady Bunch.”\u003c/p\u003e\n\u003cp\u003e“You’re being silly,” Jacqueline said sharply.\u003c/p\u003e\n\u003cp\u003e“I’m not! Everyone’s going to laugh at me.”\u003c/p\u003e\n\u003cp\u003eThe girl was making absolutely no sense. “I’m sure you’re wrong.”\u003c/p\u003e\n\u003cp\u003e“I know you meant well, but this just isn’t me…. It just isn’t me.”\u003c/p\u003e\n\u003cp\u003eWithout a word of gratitude, Alix stormed out of the salon, leaving Jacqueline speechless.\u003c/p\u003e\n\u003cp\u003e“Where did you ever meet such a girl?” Desiree asked, shaking her head.\u003c/p\u003e\n\u003cp\u003e“It’s a long story,” Jacqueline murmured, discouraged now. She’d wanted to do something nice for Alix, something kind to show her appreciation, and she’d failed.\u003c/p\u003e\n\u003cp\u003eWhen she got back to the house, she discovered Reese in the kitchen getting a beer from the fridge.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” he asked as she hurried past him to her own area of the house.\u003c/p\u003e\n\u003cp\u003eJacqueline was surprised at his question. They hadn’t spoken, other than to exchange basic household information, for days now. Another time she might have pretended not to hear, but tonight she was hurt and confused, and couldn’t hide it.\u003c/p\u003e\n\u003cp\u003eShe didn’t know how her good intentions toward Alix could have gone so badly awry. Sitting down at the kitchen table, she accepted the glass of wine Reese brought her and launched into an explanation of her adventure with Alix.\u003c/p\u003e\n\u003cp\u003e“I just don’t know what I did wrong!” Jacqueline said hopelessly.\u003c/p\u003e\n\u003cp\u003e“How old is Alix?” Reese asked.\u003c/p\u003e\n\u003cp\u003eJacqueline wasn’t sure. “Early twenties, I suppose.”\u003c/p\u003e\n\u003cp\u003e“You were trying to make her into another you, Jacquie.”\u003c/p\u003e\n\u003cp\u003e“I most certainly was not,” she cried, angry that Reese was so ready to find fault with her. She should’ve known better than to confide in him.\u003c/p\u003e\n\u003cp\u003eThen, at once, she realized he was right. She’d taken Alix to her salesclerk and her hairdresser. She met his gaze and slowly nodded. “Perhaps I was.”\u003c/p\u003e\n\u003cp\u003e“Next time, ask Tammie Lee to give you a few suggestions.”\u003c/p\u003e\n\u003cp\u003e“Tammie Lee,” Jacqueline repeated and automatically shook her head. “She couldn’t do any better than me.”\u003c/p\u003e\n\u003cp\u003e“Maybe not, but she’s closer to Alix’s age and might have a few ideas.”\u003c/p\u003e\n\u003cp\u003e“I suppose I could ask her,” she said. Her daughter-in-law might not do better, but she certainly wouldn’t do any worse than Jacqueline had.\u003c/p\u003e\n\u003cp\u003eCHAPTER 34\u003c/p\u003e\n\u003cp\u003e“Knitting goes with us, it calms us.”\u003c/p\u003e\n\u003cp\u003e—Morgan Hicks, Sweaters by Design\u003c/p\u003e\n\u003cp\u003eLYDIA HOFFMAN\u003c/p\u003e\n\u003cp\u003eW hen I didn’t hear from Dr. Wilson’s office by the end of the week, I didn’t think anything of it. Generally Peggy calls patients with their test results while the office is officially closed for lunch. From experience, I knew that if I needed a prescription refilled, I needed to contact Dr. Wilson’s office before eleven.\u003c/p\u003e\n\u003cp\u003eWhen I opened the shop on Tuesday morning, it occurred to me fleetingly that I hadn’t heard back from Peggy. Of course, she might have tried to reach me on Monday, but with the shop closed she would’ve gotten the answering machine. I realized I hadn’t given her my new phone number and the only way she had of getting hold of me was through the shop. I checked as soon as I’d flipped the sign from CLOSED to OPEN, but found no messages.\u003c/p\u003e\n\u003cp\u003eI thought of it later and meant to phone the office myself, but was interrupted in the most pleasant manner possible. Brad stopped in on what he termed his coffee break.\u003c/p\u003e\n\u003cp\u003eMy heart continued to do leaps of joy whenever he walked into the shop. We’d gone out to dinner twice in the last week and were together for much of Sunday afternoon. Cody spent the weekend with his mother who was often away on business, and this was a rare treat for us, even though I really enjoy Cody. He’s a lively little boy with a quirky sense of humor. He asked me to knit him a sweater with a dinosaur on the front, and I said I would.\u003c/p\u003e\n\u003cp\u003e“Hi there, handsome,” I said as Brad let himself into the shop. He dazzled me with one of his smiles.\u003c/p\u003e\n\u003cp\u003e“Have you got coffee made?” he asked when it seemed I was capable of doing nothing but staring at him in wide-eyed adoration.\u003c/p\u003e\n\u003cp\u003e“Not yet,” I said. “I barely got here.”\u003c/p\u003e\n\u003cp\u003e“I’ll put on a pot.” He headed for the back room, where we’d escaped any number of times for a private moment.\u003c/p\u003e\n\u003cp\u003eWe both knew his coffee-making ploy was just an excuse for the two of us to be alone. I followed him on the pretense of helping, but the instant I walked past the floral curtain that served as a door, Brad placed his arms around my waist and pulled me close.\u003c/p\u003e\n\u003cp\u003e“I had a wonderful weekend,” he whispered with his hands locked at the small of my back.\u003c/p\u003e\n\u003cp\u003e“I did, too.” We’d gone for a canoe ride on Lake Washington and halfway across he’d brought out a guitar and attempted to serenade me. It was truly romantic and quite possibly the sweetest thing any man had ever done for me. “Just promise you’ll never sing to me again.”\u003c/p\u003e\n\u003cp\u003e“You don’t like my baritone?” He jutted out his lower lip in an exaggerated pout.\u003c/p\u003e\n\u003cp\u003e“No,” I said. “That’s not it. I love your singing, but I’m in serious danger of falling in love with you.” That wasn’t what I’d intended to say, but it seemed my heart had its own purpose.\u003c/p\u003e\n\u003cp\u003e“That’s what I want, Lydia.” He brought me closer still and kissed me with such energy and need that I was afraid I might collapse at his feet. We’d explored the attraction between us quite a bit over the weekend. I recognized that we’d reached a decision point in the relationship. It would be easy for this attraction to slip into the physical. Before that happened, though, I needed to be absolutely sure we shared the same values and life goals.\u003c/p\u003e\n\u003cp\u003eMargaret had warned me—and my mother had spoken her piece, too—about the importance of taking the relationship slow. I knew they were both right, but I felt so good in Brad’s arms.\u003c/p\u003e\n\u003cp\u003e“I want to be with you more and more,” Brad said. “You’re the first thing I think of when I wake in the morning and the last thing on my mind at night.”\u003c/p\u003e\n\u003cp\u003eHe was in my thoughts day and night, too, and to be honest, it frightened me. Twice before, I’d been in promising relationships. The first time I’d been too young to really understand what I’d lost when Brian and I broke up after I was diagnosed with a brain tumor.\u003c/p\u003e\n\u003cp\u003eIt was a different story with Roger, who broke my heart. I wanted to die when he walked out on me and in retrospect, I see that was exactly what I assumed would happen. Time is a great healer, as the old saying has it, and I understand now, almost six years later, why Roger left when he did. He loved me. I truly believe that. Because he loved me, he couldn’t bear to watch me die. He reacted the only way he knew how—by running away.\u003c/p\u003e\n\u003cp\u003eI heard that he got married just four months after we broke up. I tried not to think about him, but every now and then I felt a twinge of sadness. I didn’t want any regrets with me and Brad, no matter where the relationship took us.\u003c/p\u003e\n\u003cp\u003e“You’re very quiet.” He tenderly brushed the hair from my forehead as he looked down at me.\u003c/p\u003e\n\u003cp\u003e“We need to go slow,” I said. I’d told him about Brian and Roger, and just about everything else in my life there was to tell. He’d already known the basic facts, the outline of my emotional history, but I’d filled in the details when we were in the canoe. I’d leaned against him and gazed out over the beautiful green water of Lake Washington as we drifted. Brad had his arms around me. I found it easier to talk about my lost loves when I wasn’t facing him.\u003c/p\u003e\n\u003cp\u003eIn turn, Brad described his marriage, and said he felt he’d failed Janice, his ex-wife. That was something I couldn’t understand, although I understood the impulse to assume blame. It’s part of the same impulse that makes us believe we’re responsible for everything that happens in a relationship or a family. But I’ve learned we can’t control other people’s feelings….\u003c/p\u003e\n\u003cp\u003e“What about dinner Friday night?” he asked now. He kissed me before I could respond.\u003c/p\u003e\n\u003cp\u003eThe phone rang and I sighed with annoyance. “Hold that thought,” I whispered, easing myself out of his arms.\u003c/p\u003e\n\u003cp\u003eI hurried to the phone and grabbed it just before the answering machine kicked in. “A Good Yarn,” I said, hoping my voice didn’t betray what I’d been doing a moment or so earlier.\u003c/p\u003e\n\u003cp\u003e“Lydia, this is Peggy from Dr. Wilson’s office.”\u003c/p\u003e\n\u003cp\u003e“Oh, hi, Peggy,” I said, glad to have finally heard from her. “I was wondering when you’d contact me.”\u003c/p\u003e\n\u003cp\u003e“I meant to call on Friday.”\u003c/p\u003e\n\u003cp\u003e“That’s fine. I was busy all day.”\u003c/p\u003e\n\u003cp\u003eShe hesitated and perhaps I should’ve caught it then, but I didn’t.\u003c/p\u003e\n\u003cp\u003e“I should have phoned,” Peggy said.\u003c/p\u003e\n\u003cp\u003eBy now I’d detected reluctance in her voice.\u003c/p\u003e\n\u003cp\u003e“Bad news?” If it was, I didn’t want her to delay it a second longer. She’d given me the weekend as a gift and instinctively I realized that without her having to put it into words.\u003c/p\u003e\n\u003cp\u003e“I tried to call yesterday,” she murmured, “but then I remembered your shop’s closed on Mondays, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“You didn’t leave a message.” The reason was obvious now. The news she had to give me couldn’t be left on an answering machine.\u003c/p\u003e\n\u003cp\u003e“No,” she said, her voice uneasy.\u003c/p\u003e\n\u003cp\u003e“What is it?” I asked, steeling myself for the worst.\u003c/p\u003e\n\u003cp\u003e“Oh, Lydia, I’m so sorry. Dr. Wilson looked over your bloodwork and he’s scheduled a series of X-rays for you. He’d also like to see you in his office at your earliest convenience.”\u003c/p\u003e\n\u003cp\u003e“All right.” It went without saying that the cancer was back. Another tumor was forming in my brain even as Peggy spoke. It was growing back and nothing would stop it this time, no surgery, no drugs, nothing. Had I been alone, I would have insisted Peggy tell me the worst of it then and there. But I couldn’t do that with Brad in hearing distance.\u003c/p\u003e\n\u003cp\u003e“Can I make you an appointment with the radiologist for tomorrow morning at eight?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-shop-on-blossom-street-blossom-street-1/page-35.html","bookId":1933,"creation":"Oct 5, 2019 9:56:23 AM","modification":"Oct 5, 2019 9:56:23 AM"}
