{"id":66391,"no":15,"title":"Page 15","content":"\u003cp\u003e\"All of us in the environmental movement,\" Morton said, \"have seen many wonderful victories over the years. We have witnessed the creation of the EPA. We have seen the air and water made cleaner, sewage treatment improved, toxic dumps cleaned up, and we have regulated common poisons like lead for the safety of all. These are real victories, my friends. We take justifiable pride in them. And we know more needs to be done.\"\u003c/p\u003e\n\u003cp\u003eThe audience was relaxing. Morton was moving onto familiar ground.\u003c/p\u003e\n\u003cp\u003e\"But will the work get done? I am not sure. I know my mood has been dark, since the death of my beloved wife, Dorothy.\"\u003c/p\u003e\n\u003cp\u003eEvans sat bolt upright in his chair. At the next table, Herb Lowenstein looked shocked, his mouth open. George Morton had no wife. Or rather, he had six ex-wivesnone named Dorothy.\u003c/p\u003e\n\u003cp\u003e\"Dorothy urged me to spend my money wisely. I always thought I did. Now I am less sure. I said before that we don\u0027t know enough. But I fear that today, the watchword of NERF has become, We don\u0027t sue enough.\"\u003c/p\u003e\n\u003cp\u003eYou could hear breath sucked in sharply all around the room.\u003c/p\u003e\n\u003cp\u003e\"NERF is a law firm. I don\u0027t know if you realize that. It was started by lawyers and it is run by lawyers. But I now believe money is better spent on research than litigation. And that is why I am withdrawing my funding for NERF, and why I am\"\u003c/p\u003e\n\u003cp\u003eFor the next few moments Morton could not be heard above the excited jabber of the crowd. Everyone was talking loudly. There were scattered boos; some guests got up to leave. Morton continued to talk, seemingly oblivious to the effect he was having. Evans caught a few phrases: \" amp;one environmental charity is under FBI investigation amp; complete lack of oversight amp;\"\u003c/p\u003e\n\u003cp\u003eAnn Garner leaned over and hissed, \"Get him off there.\"\u003c/p\u003e\n\u003cp\u003e\"What do you want me to do?\" Evans whispered.\u003c/p\u003e\n\u003cp\u003e\"Go and get him. He\u0027s obviously drunk.\"\u003c/p\u003e\n\u003cp\u003e\"That may be, but I can\u0027t\"\u003c/p\u003e\n\u003cp\u003e\"You have to stop this.\"\u003c/p\u003e\n\u003cp\u003eBut on the stage, Drake was already moving forward, saying \"All right, thank you, George\"\u003c/p\u003e\n\u003cp\u003e\"Because to tell the truth right now\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, George,\" Drake said again, moving closer. He was actually pushing against Morton\u0027s bulk, trying to shove him away from the podium.\u003c/p\u003e\n\u003cp\u003e\"Okay, okay,\" Morton said, clinging to the podium. \"I said what I did for Dorothy. My dear dead wife\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, George.\" Drake was applauding now, holding his hands up at head height, nodding to the audience to join with him. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\" amp;who I miss desperately amp;\"\u003c/p\u003e\n\u003cp\u003e\"Ladies and gentlemen, please join me in thanking\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, okay, I\u0027m leaving.\"\u003c/p\u003e\n\u003cp\u003eTo muted applause, Morton shambled off the stage. Drake immediately stepped up to the podium and signaled the band. They started into a rousing rendition of Billy Joel\u0027s \"You May Be Right,\" which someone had told them was Morton\u0027s favorite song. It was, but it seemed a poor choice under the circumstances.\u003c/p\u003e\n\u003cp\u003eHerb Lowenstein leaned over from the next table and grabbed Evans by the shoulder, pulling him close. \"Listen,\" he whispered fiercely. \"Get him out of here.\"\u003c/p\u003e\n\u003cp\u003e\"I will,\" Evans said. \"Don\u0027t worry.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know this was going to happen?\"\u003c/p\u003e\n\u003cp\u003e\"No, I swear to God.\"\u003c/p\u003e\n\u003cp\u003eLowenstein released Evans just as George Morton returned to the table. The assembled group was stunned. But Morton was singing cheerfully with the music, \"You may be right, I may be crazy amp;\"\u003c/p\u003e\n\u003cp\u003e\"Come on, George,\" Evans said, standing up. \"Let\u0027s get out of here.\"\u003c/p\u003e\n\u003cp\u003eMorton ignored him. \" amp;But it just may be a loo-natic you\u0027re looking for amp;\"\u003c/p\u003e\n\u003cp\u003e\"George? What do you say?\" Evans took him by the arm. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\" amp;Turn out the light, don\u0027t try to save me amp;\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not trying to save you,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Then how about another damn martini?\" Morton said, no longer singing. His eyes were cold, a little resentful. \"I think I fucking earned it.\"\u003c/p\u003e\n\u003cp\u003e\"Harry will have one for you in the car,\" Evans said, steering Morton away from the table. \"If you stay here, you\u0027ll have to wait for it. And you don\u0027t want to wait for a drink right now amp;\" Evans continued talking, and Morton allowed himself to be led out of the room.\u003c/p\u003e\n\u003cp\u003e\" amp;too late to fight,\" he sang, \"too late to change me amp;\"\u003c/p\u003e\n\u003cp\u003eBefore they could get out of the room, there was a TV camera with lights shining in their faces, and two reporters shoving small tape recorders in front of Morton. Everybody was yelling questions. Evans put his head down and said, \"Excuse us, sorry, coming through, excuse us amp;\"\u003c/p\u003e\n\u003cp\u003eMorton never stopped singing. They made their way through the hotel lobby. The reporters were running in front of them, trying to get some distance ahead, so they could film them walking forward. Evans gripped Morton firmly by the elbow as Morton sang:\u003c/p\u003e\n\u003cp\u003e\"I was only having fun, wasn\u0027t hurting anyone, and we all enjoyed the weekend for a change amp;\"\u003c/p\u003e\n\u003cp\u003e\"This way,\" Evans said, heading for the door.\u003c/p\u003e\n\u003cp\u003e\"I was stranded in the combat zone amp;\"\u003c/p\u003e\n\u003cp\u003eAnd then at last they were through the swinging doors, and outside in the night. Morton stopped singing abruptly when the cold air hit him. They waited for his limousine to pull around. Sarah came out, and stood beside Morton. She didn\u0027t say anything, she just put her hand on his arm.\u003c/p\u003e\n\u003cp\u003eThen the reporters came out, and the lights came on again. And then Drake burst through the doors, saying \"God damn it, George\"\u003c/p\u003e\n\u003cp\u003eHe broke off when he saw the cameras. He glared at Morton, turned, and went back inside. The cameras remained on, but the three of them just stood there. It was awkward, just waiting. After what seemed like an eternity, the limousine pulled up. Harry came around, and opened the door for George.\u003c/p\u003e\n\u003cp\u003e\"Okay, George,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"No, not tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Harry\u0027s waiting, George.\"\u003c/p\u003e\n\u003cp\u003e\"I said, not tonight.\"\u003c/p\u003e\n\u003cp\u003eThere was a deep-throated growl in the darkness, and a silver Ferrari convertible pulled up alongside the limousine.\u003c/p\u003e\n\u003cp\u003e\"My car,\" Morton said. He started down the stairs, lurching a bit.\u003c/p\u003e\n\u003cp\u003eSarah said, \"George, I don\u0027t think\"\u003c/p\u003e\n\u003cp\u003eBut he was singing again: \"And you told me not to drive, but I made it home alive, so you said that only proves that I\u0027m in-sayyy-nnne.\"\u003c/p\u003e\n\u003cp\u003eOne of the reporters muttered, \"He\u0027s insane, all right.\"\u003c/p\u003e\n\u003cp\u003eEvans followed Morton, very concerned. Morton gave the parking attendant a hundred dollar bill, saying \"A twenty for you, my good man.\" He fumbled with the Ferrari door. \"These crummy Italian imports.\" Then he got behind the wheel of the convertible, gunned the engine, and smiled. \"Ah, a manly sound.\"\u003c/p\u003e\n\u003cp\u003eEvans leaned over the car. \"George, let Harry drive you. Besides,\" he added, \"don\u0027t we need to talk about something?\"\u003c/p\u003e\n\u003cp\u003e\"We do not.\"\u003c/p\u003e\n\u003cp\u003e\"But I thought\"\u003c/p\u003e\n\u003cp\u003e\"Kid, get out of my way.\" The camera lights were still on them. But Morton moved so that he was in the shadow cast by Evans\u0027s body. \"You know, the Buddhists have a saying.\"\u003c/p\u003e\n\u003cp\u003e\"What saying?\"\u003c/p\u003e\n\u003cp\u003e\"Remember it, kid. Goes like this: All that matters is not remote from where the Buddha sits.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"George, I really think you should not be driving.\"\u003c/p\u003e\n\u003cp\u003e\"Will you remember what I just said to you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Wisdom of the ages. Good-bye, kid.\"\u003c/p\u003e\n\u003cp\u003eAnd he accelerated, roaring out of the parking lot as Evans jumped back. The Ferrari squealed around the corner, ignoring a stop sign, and was gone.\u003c/p\u003e\n\u003cp\u003e\"Peter, come on.\"\u003c/p\u003e\n\u003cp\u003eEvans turned, and saw Sarah standing by the limousine. Harry was getting in behind the wheel. Evans got in the back seat with Sarah, and they drove off after Morton.\u003c/p\u003e\n\u003cp\u003eThe Ferrari turned left at the bottom of the hill, disappearing around the corner. Harry accelerated, handling the huge limousine with skill.\u003c/p\u003e\n\u003cp\u003eEvans said, \"Do you know where he\u0027s going?\"\u003c/p\u003e\n\u003cp\u003e\"No idea,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Who wrote his speech?\"\u003c/p\u003e\n\u003cp\u003e\"He did.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"He was working in the house all day yesterday, and he wouldn\u0027t let me see what he was doing amp;\"\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" Evans said. \"Montaigne?\"\u003c/p\u003e\n\u003cp\u003e\"He had a book of quotations out.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d he come up with Dorothy?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"I have no idea.\"\u003c/p\u003e\n\u003cp\u003eThey passed Golden Gate Park. Traffic was light; the Ferrari was moving fast, weaving among the cars. Ahead was the Golden Gate Bridge, brightly lit in the night. Morton accelerated. The Ferrari was going almost ninety miles an hour.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going to Marin,\" Sarah said.\u003c/p\u003e\n\u003cp\u003eEvans\u0027s cell phone rang. It was Drake. \"Will you tell me what the hell that was all about?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Nick. I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Was he serious? About withdrawing his support?\"\u003c/p\u003e\n\u003cp\u003e\"I think he was.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s unbelievable. He\u0027s obviously suffered a nervous breakdown.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t say.\"\u003c/p\u003e\n\u003cp\u003e\"I was afraid of this,\" Drake said. \"I was afraid something like this might happen. You remember, on the plane coming back from Iceland? I said it to you, and you told me I shouldn\u0027t worry. Is that your opinion now? That I shouldn\u0027t worry?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you\u0027re asking, Nick.\"\u003c/p\u003e\n\u003cp\u003e\"Ann Garner said he signed some papers on the plane.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. He did.\"\u003c/p\u003e\n\u003cp\u003e\"Are they related to this sudden and inexplicable withdrawal of support for the organization that he loved and cherished?\"\u003c/p\u003e\n\u003cp\u003e\"He seems to have changed his mind about that,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"And why didn\u0027t you tell me?\"\u003c/p\u003e\n\u003cp\u003e\"He instructed me not to.\"\u003c/p\u003e\n\u003cp\u003e\"Fuck you, Evans.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Not as sorry as you will be.\"\u003c/p\u003e\n\u003cp\u003eThe phone went dead. Drake had hung up. Evans flipped the phone shut.\u003c/p\u003e\n\u003cp\u003eSarah said, \"Drake is mad?\"\u003c/p\u003e\n\u003cp\u003e\"Furious.\"\u003c/p\u003e\n\u003cp\u003eOff the bridge, Morton headed west, away from the lights of the freeway, onto a dark road skirting the cliffs. He was driving faster than ever.\u003c/p\u003e\n\u003cp\u003eEvans said to Harry, \"Do you know where we are?\"\u003c/p\u003e\n\u003cp\u003e\"I believe we\u0027re in a state park.\"\u003c/p\u003e\n\u003cp\u003eHarry was trying to keep up, but on this narrow, twisting road, the limousine was no match for the Ferrari. It moved farther and farther ahead. Soon they could see only the taillights, disappearing around curves a quarter mile ahead.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to lose him,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"I doubt it, sir.\"\u003c/p\u003e\n\u003cp\u003eBut the limousine fell steadily behind. After Harry took one turn too fastthe big rear end lost traction and swung wide toward a cliff\u0027s edgethey were obliged to slow down even more. They were in a desolate area now. The night was dark and the cliffs deserted. A rising moon put a streak of silver on the black water far below.\u003c/p\u003e\n\u003cp\u003eUp ahead, they no longer saw any taillights. It seemed they were alone on the dark road.\u003c/p\u003e\n\u003cp\u003eThey came around a curve, and saw the next curve a hundred yards aheadobscured by billowing gray smoke.\u003c/p\u003e\n\u003cp\u003e\"Oh no,\" Sarah said, putting her hand to her mouth.\u003c/p\u003e\n\u003cp\u003eThe Ferrari had spun out, struck a tree, and flipped over. It now lay upside down, a crumpled and smoking mass. It had very nearly gone off the cliff itself. The nose of the car was hanging over the edge.\u003c/p\u003e\n\u003cp\u003eEvans and Sarah ran forward. Evans got down on his hands and knees and crawled along the cliff\u0027s edge, trying to see into the driver\u0027s compartment. It was hard to see much of anythingthe front windshield was flattened, and the Ferrari lay almost flush to the pavement. Harry came over with a flashlight, and Evans used it to peer inside.\u003c/p\u003e\n\u003cp\u003eThe compartment was empty. Morton\u0027s black bow tie was dangling from the doorknob, but otherwise he was gone.\u003c/p\u003e\n\u003cp\u003e\"He must have been thrown.\"\u003c/p\u003e\n\u003cp\u003eEvans shone the light down the cliff. It was crumbling yellow rock, descending steeply for eighty feet to the ocean below. He saw no sign of Morton.\u003c/p\u003e\n\u003cp\u003eSarah was crying softly. Harry had gone back to get a fire extinguisher from the limousine. Evans swung his light back and forth over the rock face. He did not see George\u0027s body. In fact, he did not see any sign of George at all. No disturbance, no path, no bits of clothing. Nothing.\u003c/p\u003e\n\u003cp\u003eBehind him he heard the whoosh of the fire extinguisher. He crawled away from the cliff\u0027s edge.\u003c/p\u003e\n\u003cp\u003e\"Did you see him, sir?\" Harry said, his face full of pain.\u003c/p\u003e\n\u003cp\u003e\"No. I didn\u0027t see anything.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps amp;over there.\" Harry pointed toward the tree. And he was right; if Morton had been thrown from the car by the initial impact, he might be twenty yards back, on the road.\u003c/p\u003e\n\u003cp\u003eEvans walked back, and shone his flashlight down the cliff again. The battery was running down, the beam was weakening. But almost immediately, he saw a glint of light off a man\u0027s patent leather slipper, wedged among the rocks at the edge of the water.\u003c/p\u003e\n\u003cp\u003eHe sat down in the road and put his head in his hands. And cried.\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003ePOINT MOODY\u003c/p\u003e\n\u003cp\u003eTUESDAY, OCTOBER 5\u003c/p\u003e\n\u003cp\u003e3:10 A.M.\u003c/p\u003e\n\u003cp\u003eBy the time the police were finished talking with them, and a rescue team had rappelled down the cliff to recover the shoe, it was three o\u0027clock in the morning. They found no other sign of the body, and the cops, talking among themselves, agreed that the prevailing currents would probably carry the body up the coast to Pismo Beach. \"We\u0027ll find him,\" one said, \"in about a week or so. Or at least, what\u0027s left by the great whites.\"\u003c/p\u003e\n\u003cp\u003eNow the wreck was being cleared away, and loaded onto a flatbed truck. Evans wanted to leave, but the highway patrolman who had taken Evans\u0027s statement kept coming back to ask for more details. He was a kid, in his early twenties. It seemed he had not filled out many of these forms before.\u003c/p\u003e\n\u003cp\u003eThe first time he came back to Evans, he said, \"How soon after the accident would you say you arrived on the scene?\"\u003c/p\u003e\n\u003cp\u003eEvans said, \"I\u0027m not sure. The Ferrari was about half a mile ahead of us, maybe more. We were probably going forty miles an hour, so amp;maybe a minute later?\"\u003c/p\u003e\n\u003cp\u003eThe kid looked alarmed. \"You were going forty in that limo? On this road?\"\u003c/p\u003e\n\u003cp\u003e\"Well. Don\u0027t hold me to it.\"\u003c/p\u003e\n\u003cp\u003eThen he came back and said, \"You said you were the first on the scene. You told me you crawled around at the edge of the road?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-15.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
