{"id":66397,"no":21,"title":"Page 21","content":"\u003cp\u003e\"George did?\"\u003c/p\u003e\n\u003cp\u003e\"I did,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"So you were behind this?\"\u003c/p\u003e\n\u003cp\u003e\"No, I merely consulted with George. It was his ball game. But the point is, once you outsource the money, you no longer control how it is spent. Or, you have deniability about how it is spent.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" Evans said. \"All this time, I just thought George was worried about the Vanutu lawsuit.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Kenner said. \"The lawsuit is probably hopeless. It is very unlikely it will ever go to trial.\"\u003c/p\u003e\n\u003cp\u003e\"But Balder said when he gets good sea-level data\"\u003c/p\u003e\n\u003cp\u003e\"Balder already has the good data. He has had it for months.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"The data show no rise in South Pacific sea levels for the last thirty years.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eKenner turned to Sarah. \"Is he always like this?\"\u003c/p\u003e\n\u003cp\u003eThe flight attendant set out placemats, napkins, and silverware. \"I\u0027ve got fusilli pasta with chicken, asparagus, and sun-dried tomatoes,\" she said, \"and a mixed green salad to follow. Would anyone like wine?\"\u003c/p\u003e\n\u003cp\u003e\"White wine,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"I have Puligny-Montrachet. I\u0027m not sure of the year, I think it\u0027s \u002798. Mr. Morton usually kept \u002798 on board.\"\u003c/p\u003e\n\u003cp\u003e\"Just give me the whole bottle,\" Evans said, trying to make a joke. Kenner had unnerved him. Earlier in the evening, Kenner had been excited, almost twitchy-nervous. But now, sitting on the airplane, he was very still. Implacable. He had the manner of a man who was telling obvious truths, even though none of it was obvious to Peter. \"I had it all wrong,\" Evans said finally. \"If what you\u0027re saying is true amp;\"\u003c/p\u003e\n\u003cp\u003eKenner just nodded slowly.\u003c/p\u003e\n\u003cp\u003eEvans thought: He\u0027s letting me put it together. He turned to Sarah. \"Did you know this, too?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"But I knew something was wrong. George was very upset for the last two weeks.\"\u003c/p\u003e\n\u003cp\u003e\"You think that\u0027s why he gave that speech, and then killed himself?\"\u003c/p\u003e\n\u003cp\u003e\"He wanted to embarrass NERF,\" Kenner said. \"He wanted intense media scrutiny of that organization. Because he wanted to stop what is about to happen.\"\u003c/p\u003e\n\u003cp\u003eThe wine came in cut glass crystal. Evans gulped it, held out his glass for more. \"And what is about to happen?\" he said.\u003c/p\u003e\n\u003cp\u003e\"According to that list, there will be four events,\" Kenner said. \"In four locations in the world. Roughly one day apart.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of events?\"\u003c/p\u003e\n\u003cp\u003eKenner shook his head. \"We now have three good clues.\"\u003c/p\u003e\n\u003cp\u003eSanjong fingered his napkin. \"This is real linen,\" he said, in an awestruck tone. \"And real crystal.\"\u003c/p\u003e\n\u003cp\u003e\"Nice, huh?\" Evans said, draining his glass again.\u003c/p\u003e\n\u003cp\u003eSarah said, \"What are the clues?\"\u003c/p\u003e\n\u003cp\u003e\"The first is the fact that the timing is not exact. You might think a terrorist event would be precisely planned, down to the minute. These events are not.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe the group isn\u0027t that well organized.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt that\u0027s the explanation. The second clue we got tonight, and it\u0027s very important,\" Kenner said. \"As you saw from the list, there are several alternate locations for these events. Again, you\u0027d think a terrorist organization would pick one location and stick to it. But this group hasn\u0027t done that.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"I assume it reflects the kind of events that are planned. There must be some uncertainty inherent in the event itself, or in the conditions needed for it to take place.\"\u003c/p\u003e\n\u003cp\u003e\"Pretty vague.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s more than we knew twelve hours ago.\"\u003c/p\u003e\n\u003cp\u003e\"And the third clue?\" Evans said, gesturing to the flight attendant to refill his glass.\u003c/p\u003e\n\u003cp\u003e\"The third clue we have had for some time. Certain government agencies track the sale of restricted high technologies that might be useful to terrorists. For example, they track everything that can be used in nuclear weapons productioncentrifuges, certain metals, and so on. They track the sale of all conventional high explosives. They track certain critical biotechnologies. And they track equipment that might be used to disrupt communications networksthat generate electromagnetic impulses, for example, or high-intensity radio frequencies.\"\u003c/p\u003e\n\u003cp\u003e\"Yes amp;\"\u003c/p\u003e\n\u003cp\u003e\"They do this work with neural network pattern-recognition computers that search for regularities in great masses of datain this case, basically thousands of sales invoices. About eight months ago, the computers detected a very faint pattern that seemed to indicate a common origin for the widely scattered sale of certain field and electronic equipment.\"\u003c/p\u003e\n\u003cp\u003e\"How did the computer decide that?\"\u003c/p\u003e\n\u003cp\u003e\"The computer doesn\u0027t tell you that. It just reports the pattern, which is then investigated by agents on the ground.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"The pattern was confirmed. ELF was buying very sophisticated high technology from companies in Vancouver, London, Osaka, Helsinki, and Seoul.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of equipment?\" Evans said.\u003c/p\u003e\n\u003cp\u003eKenner ticked them off on his fingers. \"Fermentation tanks for AOB primersthat\u0027s ammonia-oxidizing bacteria. Mid-level particle-dispersal units, military grade. Tectonic impulse generators. Transportable MHD units. Hypersonic cavitation generators. Resonant impact processor assemblies.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what any of that is,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Few people do,\" Kenner said. \"Some of it\u0027s fairly standard environmental technology, like the AOB primer tanks. They\u0027re used in industrial wastewater treatment. Some of it\u0027s military but sold on the open market. And some of it\u0027s highly experimental. But it\u0027s all expensive.\"\u003c/p\u003e\n\u003cp\u003eSarah said, \"But how is it going to be used?\"\u003c/p\u003e\n\u003cp\u003eKenner shook his head. \"Nobody knows. That\u0027s what we\u0027re going to find out.\"\u003c/p\u003e\n\u003cp\u003e\"How do you think it\u0027s going to be used?\"\u003c/p\u003e\n\u003cp\u003e\"I hate to speculate,\" Kenner said. He picked up a basket of rolls. \"Bread, anyone?\"\u003c/p\u003e\n\u003cp\u003eChapter 30\u003c/p\u003e\n\u003cp\u003eTO PUNTA ARENAS\u003c/p\u003e\n\u003cp\u003eWEDNESDAY, OCTOBER 6\u003c/p\u003e\n\u003cp\u003e3:01 A.M.\u003c/p\u003e\n\u003cp\u003eThe jet flew through the night.\u003c/p\u003e\n\u003cp\u003eThe front of the cabin was darkened; Sarah and Sanjong were sleeping on makeshift beds, but Evans couldn\u0027t sleep. He sat in the back, staring out the window at the carpet of clouds glowing silver in the moonlight.\u003c/p\u003e\n\u003cp\u003eKenner sat opposite him. \"It\u0027s a beautiful world, isn\u0027t it?\" he said. \"Water vapor is one of the distinctive features of our planet. Makes such beauty. It\u0027s surprising there is so little scientific understanding of how water vapor behaves.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"The atmosphere is a bigger mystery than anyone will admit. Simple example: No one can say for sure if global warming will result in more clouds, or fewer clouds.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a minute,\" Evans said. \"Global warming is going to raise the temperature, so more moisture will evaporate from the ocean, and more moisture means more clouds.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s one idea. But higher temperature also means more water vapor in the air and therefore fewer clouds.\"\u003c/p\u003e\n\u003cp\u003e\"So which is it?\"\u003c/p\u003e\n\u003cp\u003e\"Nobody knows.\"\u003c/p\u003e\n\u003cp\u003e\"Then how do they make computer models of climate?\" Evans said.\u003c/p\u003e\n\u003cp\u003eKenner smiled. \"As far as cloud cover is concerned, they guess.\"\u003c/p\u003e\n\u003cp\u003e\"They guess?\"\u003c/p\u003e\n\u003cp\u003e\"Well, they don\u0027t call it a guess. They call it an estimate, or parameterization, or an approximation. But if you don\u0027t understand something, you can\u0027t approximate it. You\u0027re really just guessing.\"\u003c/p\u003e\n\u003cp\u003eEvans felt the beginnings of a headache. He said, \"I think it\u0027s time for me to get some sleep.\"\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" Kenner said, glancing at his watch. \"We still have another eight hours before we land.\"\u003c/p\u003e\n\u003cp\u003eThe flight attendant gave Evans some pajamas. He went into the bathroom to change. When he came out, Kenner was still sitting there, staring out the window at the moonlit clouds. Against his better judgment, Evans said, \"By the way. You said earlier that the Vanutu lawsuit won\u0027t go to trial.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Why not? Because of the sea-level data?\"\u003c/p\u003e\n\u003cp\u003e\"In part, yes. It\u0027s hard to claim global warming is flooding your country if sea levels aren\u0027t rising.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hard to believe sea levels aren\u0027t rising,\" Evans said. \"Everything you read says that they are. All the television reports amp;\"\u003c/p\u003e\n\u003cp\u003eKenner said, \"Remember African killer bees? There was talk of them for years. They\u0027re here now, and apparently there\u0027s no problem. Remember Y2K? Everything you read back then said disaster was imminent. Went on for months. But in the end, it just wasn\u0027t true.\"\u003c/p\u003e\n\u003cp\u003eEvans thought that Y2K didn\u0027t prove anything about sea levels. He felt an urge to argue that point, but found himself suppressing a yawn.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s late,\" Kenner said. \"We can talk about all this in the morning.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to sleep?\"\u003c/p\u003e\n\u003cp\u003e\"Not yet. I have work to do.\"\u003c/p\u003e\n\u003cp\u003eEvans went forward to where the others were sleeping. He lay down across the aisle from Sarah, and pulled the covers up to his chin. Now his feet were exposed. He sat up, wrapped the blanket around his toes, and then lay down again. The blanket only came to mid-shoulder. He thought about getting up and asking the flight attendant for another.\u003c/p\u003e\n\u003cp\u003eAnd then he slept.\u003c/p\u003e\n\u003cp\u003eHe awoke to harsh, glaring sunlight. He heard the clink of silverware, and smelled coffee. Evans rubbed his eyes, and sat up. In the back of the plane, the others were eating breakfast.\u003c/p\u003e\n\u003cp\u003eHe looked at his watch. He\u0027d slept for more than six hours.\u003c/p\u003e\n\u003cp\u003eHe walked to the back of the plane.\u003c/p\u003e\n\u003cp\u003e\"Better eat,\" Sarah said, \"we land in an hour.\"\u003c/p\u003e\n\u003cp\u003eThey stepped out onto the runway of Marso del Mar, shivering in the chill wind that whipped in off the ocean. The land around them was low, green, marshy, and cold. In the distance Evans saw the jagged, snow-covered spires of the El Fogara range of southern Chile.\u003c/p\u003e\n\u003cp\u003e\"I thought this was summer,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It is,\" Kenner said. \"Late spring, anyway.\"\u003c/p\u003e\n\u003cp\u003eThe airfield consisted of a small wooden terminal, and a row of corrugated steel hangars, like oversize Quonset huts. There were seven or eight other aircraft on the field, all four-engine prop planes. Some had skis that were retracted above the landing wheels.\u003c/p\u003e\n\u003cp\u003e\"Right on time,\" Kenner said, pointing to the hills beyond the airport. A Land Rover was bouncing toward them. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eInside the little terminal, which was little more than a single large room, its walls covered with faded, stained air charts, the group tried on parkas, boots, and other gear brought by the Land Rover. The parkas were all bright red or orange. \"I tried to get everybody\u0027s size right,\" Kenner said. \"Make sure you take long johns and microfleece, too.\"\u003c/p\u003e\n\u003cp\u003eEvans glanced at Sarah. She was sitting on the floor, pulling on heavy socks and boots. Then she unselfconsciously stripped down to her bra, and pulled a fleece top over her head. Her movements were quick, businesslike. She didn\u0027t look at any of the men.\u003c/p\u003e\n\u003cp\u003eSanjong was staring at the charts on the wall, and seemed particularly interested in one. Evans went over. \"What is it?\"\u003c/p\u003e\n\u003cp\u003ePunta Arenas 18882004 \"It\u0027s the record from the weather station at Punta Arenas, near here. It\u0027s the closest city to Antarctica in the world.\" He tapped the chart and laughed. \"There\u0027s your global warming.\"\u003c/p\u003e\n\u003cp\u003eEvans frowned at the chart.\u003c/p\u003e\n\u003cp\u003e\"Finish up, everybody,\" Kenner said, glancing at his watch. \"Our plane leaves in ten minutes.\"\u003c/p\u003e\n\u003cp\u003eEvans said, \"Where exactly are we going?\"\u003c/p\u003e\n\u003cp\u003e\"To the base nearest Mount Terror. It\u0027s called Weddell Station. Run by New Zealanders.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s there?\"\u003c/p\u003e\n\u003cp\u003e\"Not much, mate,\" the Land Rover driver said, and he laughed. \"But the way the weather\u0027s been lately, you\u0027ll be lucky if you can get there at all.\"\u003c/p\u003e\n\u003cp\u003eChapter 31\u003c/p\u003e\n\u003cp\u003eTO WEDDELL STATION\u003c/p\u003e\n\u003cp\u003eWEDNESDAY, OCTOBER 6\u003c/p\u003e\n\u003cp\u003e8:04 A.M.\u003c/p\u003e\n\u003cp\u003eEvans stared out the narrow window of the Hercules. The vibration of the props made him sleepy, but he was fascinated by what he saw beneath himmile after mile of gray ice, a vista broken by intermittent fog, and the occasional outcrop of black rock. It was a monochromatic, sunless world. And it was huge.\u003c/p\u003e\n\u003cp\u003e\"Enormous,\" Kenner said. \"People have no perspective on Antarctica, because it appears as a fringe at the bottom of most maps. But in fact, Antarctica is a major feature on the Earth\u0027s surface, and a major factor in our climate. It\u0027s a big continent, one and a half times the size of either Europe or the United States, and it holds ninety percent of all the ice on the planet.\"\u003c/p\u003e\n\u003cp\u003e\"Ninety percent?\" Sarah said. \"You mean there\u0027s only ten percent in the rest of the world?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, since Greenland has four percent, all the other glaciers in the worldKilimanjaro, the Alps, the Himalaya, Sweden, Norway, Canada, Siberiathey all account for six percent of the planet\u0027s ice. The overwhelming majority of the frozen water of our planet is in the continent of Antarctica. In many places the ice is five or six miles thick.\"\u003c/p\u003e\n\u003cp\u003e\"No wonder they\u0027re concerned that the ice here is melting,\" Evans said.\u003c/p\u003e\n\u003cp\u003eKenner said nothing.\u003c/p\u003e\n\u003cp\u003eSanjong was shaking his head.\u003c/p\u003e\n\u003cp\u003eEvans said, \"Come on, guys. Antarctica is melting.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, it\u0027s not,\" Sanjong said. \"I can give you the references, if you like.\"\u003c/p\u003e\n\u003cp\u003eKenner said, \"While you were asleep, Sanjong and I were talking about how to clarify things for you, since you seem to be so ill-informed.\"\u003c/p\u003e\n\u003cp\u003e\"Ill-informed?\" Evans said, stiffening.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what else one would call it,\" Kenner said. \"Your heart may be in the right place, Peter, but you simply don\u0027t know what you\u0027re talking about.\"\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said, controlling his anger. \"Antarctica is melting.\"\u003c/p\u003e\n\u003cp\u003e\"You think repetition makes something true? The data show that one relatively small area called the Antarctic Peninsula is melting and calving huge icebergs. That\u0027s what gets reported year after year. But the continent as a whole is getting colder, and the ice is getting thicker.\"\u003c/p\u003e\n\u003cp\u003e\"Antarctica is getting colder?\"\u003c/p\u003e\n\u003cp\u003eSanjong had taken out a laptop and was hooking it up to a small portable bubble jet printer. He flipped open his laptop screen.\u003c/p\u003e\n\u003cp\u003e\"What we decided,\" Kenner said, \"is that we\u0027re going to give you references from now on. Because it\u0027s too boring to try and explain everything to you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-21.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
