{"id":66404,"no":28,"title":"Page 28","content":"\u003cp\u003e\"Yes, he does. And his 1988 prediction,\" Kenner said, \"was wrong by three hundred percent.\"\u003c/p\u003e\n\u003cp\u003e\"So what?\"\u003c/p\u003e\n\u003cp\u003e\"You are ignoring the implication of an error that large,\" Kenner said. \"Compare it to other fields. For example, when NASA launched the rocket carrying the Mars Rover, they announced that in two hundred and fifty three days, the Rover would land on the surface of Mars at 8:11 p.m., California time. In fact, it landed at 8:35 p.m. That is an error of a few thousandths of a percent. The NASA people knew what they were talking about.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, fine. But there are some things you have to estimate.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re absolutely right,\" Kenner said. \"People estimate all the time. They estimate sales, they estimate profits, they estimate delivery dates, they estimateby the way, do you estimate your taxes for the government?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Quarterly.\"\u003c/p\u003e\n\u003cp\u003e\"How accurate does that estimate have to be?\"\u003c/p\u003e\n\u003cp\u003e\"Well, there\u0027s no fixed rule\"\u003c/p\u003e\n\u003cp\u003e\"Peter. How accurate, without penalty?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe fifteen percent.\"\u003c/p\u003e\n\u003cp\u003e\"So if you were off by three hundred percent, you\u0027d pay a penalty?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Hansen was off by three hundred percent.\"\u003c/p\u003e\n\u003cp\u003e\"Climate is not a tax return.\"\u003c/p\u003e\n\u003cp\u003e\"In the real world of human knowledge,\" Kenner said, \"to be wrong by three hundred percent is taken as an indication you don\u0027t have a good grasp on what you are estimating. If you got on an airplane and the pilot said it was a three-hour flight, but you arrived in one hour, would you think that pilot was knowledgeable or not?\"\u003c/p\u003e\n\u003cp\u003eEvans sighed. \"Climate is more complicated than that.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Peter. Climate is more complicated. It is so complicated that no one has been able to predict future climate with accuracy. Even though billons of dollars are being spent, and hundreds of people are trying all around the world. Why do you resist that uncomfortable truth?\"\u003c/p\u003e\n\u003cp\u003e\"Weather prediction is much better,\" Evans said. \"And that\u0027s because of computers.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, weather prediction has improved. But nobody tries to predict weather more than ten days in advance. Whereas computer modelers are predicting what the temperature will be one hundred years in advance. Sometimes a thousand years, three thousand years.\"\u003c/p\u003e\n\u003cp\u003e\"And they are doing better.\"\u003c/p\u003e\n\u003cp\u003e\"Arguably they aren\u0027t. Look,\" Kenner said. \"The biggest events in global climate are the El Niсos. They happen roughly every four years. But climate models can\u0027t predict themnot their timing, their duration, or their intensity. And if you can\u0027t predict El Niсos, the predictive value of your model in other areas is suspect.\"\u003c/p\u003e\n\u003cp\u003e\"I heard they can predict El Niсos.\"\u003c/p\u003e\n\u003cp\u003e\"That was claimed in 1998. But it is not true.\"* Kenner shook his head. \"Climate science simply isn\u0027t there yet, Peter. One day it will be. But not now.\"\u003c/p\u003e\n\u003cp\u003eChapter 41\u003c/p\u003e\n\u003cp\u003eTO LOS ANGELES\u003c/p\u003e\n\u003cp\u003eFRIDAY, OCTOBER 8\u003c/p\u003e\n\u003cp\u003e2:22 P.M.\u003c/p\u003e\n\u003cp\u003eAnother hour passed. Sanjong was working continuously on the laptop. Kenner sat motionless, staring out the window. Sanjong was accustomed to this. He knew that Kenner could stay silent and immobile for several hours. He only turned away from the window when Sanjong swore.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter?\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"I lost our satellite connection to the Internet. It\u0027s been in and out for a while.\"\u003c/p\u003e\n\u003cp\u003e\"Were you able to trace the images?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, that was no problem. I have the location fixed. Did Evans really think these were images from Antarctica?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He thought they showed black outcrops against snow. I didn\u0027t disagree with him.\"\u003c/p\u003e\n\u003cp\u003e\"The actual location,\" Sanjong said, \"is a place called Resolution Bay. It\u0027s in northeast Gareda.\"\u003c/p\u003e\n\u003cp\u003e\"How far from Los Angeles?\"\u003c/p\u003e\n\u003cp\u003e\"Roughly six thousand nautical miles.\"\u003c/p\u003e\n\u003cp\u003e\"So the propagation time is twelve or thirteen hours.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll worry about it later,\" Kenner said. \"We have other problems first.\"\u003c/p\u003e\n\u003cp\u003ePeter Evans slept fitfully. His bed consisted of a padded airplane seat laid flat, with a seam in the middle, right where his hip rested. He tossed and turned, waking briefly, hearing snatches of conversation between Kenner and Sanjong at the back of the plane. He couldn\u0027t hear the whole conversation over the drone of the engines. But he heard enough.\u003c/p\u003e\n\u003cp\u003eBecause of what I need him to do.\u003c/p\u003e\n\u003cp\u003eHe\u0027ll refuse, John. amp;he likes it or not amp;Evans is at the center of everything.\u003c/p\u003e\n\u003cp\u003ePeter Evans was suddenly awake. He strained to hear now. He raised his head off the pillow so he could hear better.\u003c/p\u003e\n\u003cp\u003eDidn\u0027t disagree with him.\u003c/p\u003e\n\u003cp\u003eActual location amp;Resolution Bay amp;Gareda.\u003c/p\u003e\n\u003cp\u003eHow far amp;? amp;thousand miles amp; amp;the propagation time amp;thirteen hours amp; He thought: Propagation time? What the hell were they talking about? On impulse he jumped up, strode back there, and confronted them.\u003c/p\u003e\n\u003cp\u003eKenner didn\u0027t blink. \"Sleep well?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Evans said, \"I did not sleep well. I think you owe me some explanations.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\"\u003c/p\u003e\n\u003cp\u003e\"The satellite pictures, for one.\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t very well tell you right there in the room, in front of the others,\" Kenner said. \"And I hated to interrupt your enthusiasm.\"\u003c/p\u003e\n\u003cp\u003eEvans went and poured himself a cup of coffee. \"Okay. What do the pictures really show?\"\u003c/p\u003e\n\u003cp\u003eSanjong flipped his laptop around to show Evans the screen. \"Don\u0027t feel bad. You would never have had any reason to suspect. The images were negatives. They\u0027re often used that way, to increase contrast.\"\u003c/p\u003e\n\u003cp\u003e\"Negatives amp;\"\u003c/p\u003e\n\u003cp\u003e\"The black rocks are actually white. They\u0027re clouds.\"\u003c/p\u003e\n\u003cp\u003eEvans sighed.\u003c/p\u003e\n\u003cp\u003e\"And what is the land mass?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an island called Gareda, in the southern part of the Solomon chain.\"\u003c/p\u003e\n\u003cp\u003e\"Which is amp;\"\u003c/p\u003e\n\u003cp\u003e\"Off the coast of New Guinea. North of Australia.\"\u003c/p\u003e\n\u003cp\u003e\"So this is an island in the South Pacific,\" Evans said. \"This guy in Antarctica had a picture of a Pacific island.\"\u003c/p\u003e\n\u003cp\u003e\"Correct.\"\u003c/p\u003e\n\u003cp\u003e\"And the scorpion reference is amp;\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t know,\" Sanjong said. \"The actual location is called Resolution Bay on the charts. But it may be known locally as Scorpion Bay.\"\u003c/p\u003e\n\u003cp\u003e\"And what are they planning down there?\"\u003c/p\u003e\n\u003cp\u003eKenner said, \"We don\u0027t know that, either.\"\u003c/p\u003e\n\u003cp\u003e\"I heard you talking about propagation times. Propagation times for what?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, you misheard me,\" Kenner said smoothly. \"I was talking about interrogation times.\"\u003c/p\u003e\n\u003cp\u003e\"Interrogation times?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Yes. We were hoping we\u0027d be able to identify at least one of the three men in Antarctica, since we have good photographs of all three. And we know the photographs are accurate because people on the base saw them. But, I\u0027m afraid we\u0027re out of luck.\"\u003c/p\u003e\n\u003cp\u003eSanjong explained that they had transmitted photos of Brewster and the two graduate students to several databases in Washington, where pattern-recognition computers checked them against individuals with known criminal records. Sometimes you got lucky, and the computer found a match. But this time, no match had come back.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been several hours, so I think we\u0027re out of luck.\"\u003c/p\u003e\n\u003cp\u003e\"As we expected,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Sanjong said. \"As we expected.\"\u003c/p\u003e\n\u003cp\u003e\"Because these guys don\u0027t have criminal records?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"No. They very well may.\"\u003c/p\u003e\n\u003cp\u003e\"Then why didn\u0027t you get a match?\"\u003c/p\u003e\n\u003cp\u003e\"Because this is a netwar,\" Kenner said. \"And at the moment, we are losing it.\"\u003c/p\u003e\n\u003cp\u003eChapter 42\u003c/p\u003e\n\u003cp\u003eTO LOS ANGELES\u003c/p\u003e\n\u003cp\u003eFRIDAY, OCTOBER 8\u003c/p\u003e\n\u003cp\u003e3:27 P.M.\u003c/p\u003e\n\u003cp\u003eIn media accounts, Kenner explained, the Environmental Liberation Front was usually characterized as a loose association of eco-terrorists, operating in small groups on their own initiative, and employing relatively unsophisticated means to create havocstarting fires, trashing SUVs in car lots, and so on.\u003c/p\u003e\n\u003cp\u003eThe truth was quite different. Only one member of ELF had ever been apprehendeda twenty-nine-year-old graduate student at the University of California at Santa Cruz. He was caught sabotaging an oil rig in El Segundo, California. He denied any association with the group, and insisted he was acting alone.\u003c/p\u003e\n\u003cp\u003eBut what troubled authorities was the fact that he was wearing an appliance on his forehead that changed the shape of his skull and made his eyebrows jut out prominently. He was also wearing false ears. It wasn\u0027t much of a disguise. But it was troubling, because it suggested that he knew quite a lot about the pattern-matching programs used by the government.\u003c/p\u003e\n\u003cp\u003eThose programs were tuned to look past changes in facial hairwigs, beards, and mustachessince that was the most common method of disguise. They were also designed to compensate for changes in age, such as increased heaviness in the face, drooping features, receding hairlines.\u003c/p\u003e\n\u003cp\u003eBut ears didn\u0027t change. The shape of the forehead didn\u0027t change. So the programs were therefore weighted to rely on the configuration of ears, and the shape of the forehead. Changing these parts of the face would result in a \"no-match\" outcome on a computer.\u003c/p\u003e\n\u003cp\u003eThe guy from Santa Cruz knew that. He knew security cameras would photograph him when he got near the rig. So he changed his appearance in a way that would prevent identification by computer.\u003c/p\u003e\n\u003cp\u003eSimilarly, the three extremists at Weddell clearly had formidable backing to carry out their high-tech terrorist act. It took months of planning. Costs were high. And they obviously had in-depth support to obtain academic credentials, university stencils on their shipping boxes, shell companies for their Antarctic shipments, false websites, and dozens of other details necessary for the undertaking. There was nothing unsophisticated about their plan or the way they had executed it.\u003c/p\u003e\n\u003cp\u003e\"And they would have succeeded,\" Kenner said, \"except for that list George Morton obtained shortly before his death.\"\u003c/p\u003e\n\u003cp\u003eAll of which suggested that if ELF was once a loose association of amateurs, it was no longer. Now it was a highly organized networkone that employed so many channels of communication among its members (e-mail, cell phones, radio, text messaging) that the network as a whole eluded detection. The governments of the world had long worried about how to deal with such networks, and the \"netwars\" that would result from trying to fight them.\u003c/p\u003e\n\u003cp\u003e\"For a long time, the concept of a netwar was theoretical,\" Kenner said. \"There were studies coming out of RAND, but nobody in the military was really focusing on it. The notion of a networked enemy, or terrorists, or even criminals was too amorphous to bother with.\"\u003c/p\u003e\n\u003cp\u003eBut it was the amorphous quality of the networkfluid, rapidly evolvingthat made it so difficult to combat. You couldn\u0027t infiltrate it. You couldn\u0027t listen in on it, except by accident. You couldn\u0027t locate it geographically because it wasn\u0027t in any one place. In truth, the network represented a radically new kind of opponent, and one that required radically new techniques to combat it.\u003c/p\u003e\n\u003cp\u003e\"The military just didn\u0027t get it,\" Kenner said. \"But like it or not, we\u0027re in a netwar right now.\"\u003c/p\u003e\n\u003cp\u003e\"And how do you fight a netwar?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"The only way to oppose a network is with another network. You expand your listening posts. You decrypt around the clock. You employ techniques of networked deception and entrapment.\"\u003c/p\u003e\n\u003cp\u003e\"Such as what?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s technical,\" Kenner said vaguely. \"We rely on the Japanese to spearhead that effort. They are the best at it in the world. And of course we extend our feelers in multiple directions at the same time. Based on what we\u0027ve just learned at Weddell, we have lots of irons in the fire.\" Kenner had databases being searched. He had state organizations mobilized. He had inquiries into where the terrorists had obtained their academic credentials, their encrypted radio transmitters, their explosive charges, their computerized detonation timers. None of this was commonplace stuff and it could be traced, given enough time.\u003c/p\u003e\n\u003cp\u003e\"Is there enough time?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure.\"\u003c/p\u003e\n\u003cp\u003eEvans could see that Kenner was worried. \"So: What is it you want me to do?\"\u003c/p\u003e\n\u003cp\u003e\"Just one very simple thing,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003eKenner smiled.\u003c/p\u003e\n\u003cp\u003eChapter 43\u003c/p\u003e\n\u003cp\u003eIII. ANGEL\u003c/p\u003e\n\u003cp\u003eLOS ANGELES\u003c/p\u003e\n\u003cp\u003eSATURDAY, OCTOBER 9\u003c/p\u003e\n\u003cp\u003e7:04 A.M.\u003c/p\u003e\n\u003cp\u003e\"Is this really necessary?\" Peter Evans said, with a worried look.\u003c/p\u003e\n\u003cp\u003e\"It is,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s illegal,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not,\" Kenner said firmly.\u003c/p\u003e\n\u003cp\u003e\"Because you are a law-enforcement officer?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Of course. Don\u0027t worry about it.\"\u003c/p\u003e\n\u003cp\u003eThey were flying in over Los Angeles, approaching the runway at Van Nuys. The California sun shone through the windows. Sanjong was hunched over the dining table in the middle of the plane. In front of him lay Evans\u0027s cell phone, the back removed. Sanjong was attaching a thin gray plate the size of his thumbnail right on top of the battery.\u003c/p\u003e\n\u003cp\u003e\"But what exactly is it?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"Flash memory,\" Sanjong said. \"It\u0027ll record four hours of conversation in a compressed format.\"\u003c/p\u003e\n\u003cp\u003e\"I see,\" Evans said. \"And what am I supposed to do?\"\u003c/p\u003e\n\u003cp\u003e\"Just carry the phone in your hand, and go about your business.\"\u003c/p\u003e\n\u003cp\u003e\"And if I get caught?\" he said.\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t get caught,\" Kenner said. \"You can take it anywhere. You\u0027ll go right through any security, no problem.\"\u003c/p\u003e\n\u003cp\u003e\"But if they have bug sweepers amp;\"\u003c/p\u003e\n\u003cp\u003e\"They won\u0027t detect you, because you\u0027re not transmitting anything. It\u0027s got a burst transmitter. For two seconds every hour, it transmits. The rest of the time, nothing.\" Kenner sighed. \"Look, Peter. It\u0027s just a cell phone. Everyone has them.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Evans said. \"I feel bad about this. I mean, I\u0027m not a stool pigeon.\"\u003c/p\u003e\n\u003cp\u003eSarah came to the back, yawning, clearing her ears. \"Who\u0027s a stool pigeon?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s how I feel,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not the issue,\" Kenner said. \"Sanjong?\"\u003c/p\u003e\n\u003cp\u003eSanjong took out a printed list, passed it to Evans. It was Morton\u0027s original sheet, now with additions to it: \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-28.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
