{"id":66408,"no":32,"title":"Page 32","content":"\u003cp\u003e\"Is it here?\"\u003c/p\u003e\n\u003cp\u003eThe fingers stopped. Or almost stopped. They still moved slightly. But there was clearly an effort being made.\u003c/p\u003e\n\u003cp\u003e\"Can you control your fingers?\" Evans said.\u003c/p\u003e\n\u003cp\u003eThey started, then stopped again.\u003c/p\u003e\n\u003cp\u003e\"So you can. Okay. Now: is the thing you wanted me to see here?\"\u003c/p\u003e\n\u003cp\u003eFingers moved.\u003c/p\u003e\n\u003cp\u003eThen stopped.\u003c/p\u003e\n\u003cp\u003e\"I take that as a yes. Okay.\" Evans stepped back. In the distance, he heard an approaching siren. The ambulance would be here in a few minutes. He said, \"I am going to move in one direction, and if it is the right direction, move your fingers.\"\u003c/p\u003e\n\u003cp\u003eThe fingers started, then stopped, as if to signal \"yes.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Evans said. He turned and took several steps to his right, heading toward the kitchen. He looked back.\u003c/p\u003e\n\u003cp\u003eThe fingers did not move.\u003c/p\u003e\n\u003cp\u003e\"So it\u0027s not that way.\" He now moved toward the television, directly in front of the man.\u003c/p\u003e\n\u003cp\u003eThe fingers did not move.\u003c/p\u003e\n\u003cp\u003e\"All right, then.\" Evans turned left, walking toward the picture windows. Still the fingers did not move. There was only one direction remaining: he moved behind the investigator, heading toward the door. Since the man could not see him, Evans said, \"Now I am walking away from you, toward the front door amp;\"\u003c/p\u003e\n\u003cp\u003eThe fingers did not move.\u003c/p\u003e\n\u003cp\u003e\"Maybe you didn\u0027t understand,\" Evans said. \"I wanted you to move your fingers if I was heading in the right direction amp;\"\u003c/p\u003e\n\u003cp\u003eFingers moved. Scratching the couch.\u003c/p\u003e\n\u003cp\u003e\"Yeah, okay, but which direction? I went in all four directions and\"\u003c/p\u003e\n\u003cp\u003eThe doorbell rang. Evans opened it, and two paramedics rushed in, bringing a stretcher. And now there was pandemonium, they were asking him rapid-fire questions, and loading the guy onto the stretcher. The police arrived a few moments later, with still more questions. They were the Beverly Hills police, so they were polite, but they were insistent. This man was paralyzed in Evans\u0027s apartment, and Evans did not seem to know anything about it.\u003c/p\u003e\n\u003cp\u003eFinally, a detective came through the door. He wore a brown suit and introduced himself as Ron Perry. He gave Evans his card. Evans gave him his own card. Perry looked at it, then looked at Evans and said, \"Haven\u0027t I seen this card before? It looks familiar. Oh yeah, I remember. It was at that apartment on Wilshire where the lady was paralyzed.\"\u003c/p\u003e\n\u003cp\u003e\"She was my client.\"\u003c/p\u003e\n\u003cp\u003e\"And now it\u0027s happened again, the same paralysis,\" Perry said. \"Is that a coincidence or what?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Evans said, \"because I wasn\u0027t here. I don\u0027t know what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Somehow people just become paralyzed wherever you go?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Evans said. \"I told you, I don\u0027t know what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Is this guy a client, too?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then who is he?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea who he is.\"\u003c/p\u003e\n\u003cp\u003e\"No? How\u0027d he get in here?\"\u003c/p\u003e\n\u003cp\u003eEvans was about to say he had left the door open for him, but he realized that was going to be a long explanation, and a difficult one.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I, uh amp;Sometimes I don\u0027t lock my door.\"\u003c/p\u003e\n\u003cp\u003e\"You should always lock your door, Mr. Evans. That\u0027s just common sense.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, you\u0027re right.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t your door lock automatically, when you leave?\"\u003c/p\u003e\n\u003cp\u003e\"I told you, I don\u0027t know how he got in my apartment,\" Evans said, looking directly into the detective\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eThe detective returned the stare. \"How\u0027d you get those stitches in your head?\"\u003c/p\u003e\n\u003cp\u003e\"I fell.\"\u003c/p\u003e\n\u003cp\u003e\"Looks like quite a fall.\"\u003c/p\u003e\n\u003cp\u003e\"It was.\"\u003c/p\u003e\n\u003cp\u003eThe detective nodded slowly. \"You could save us a lot of trouble if you\u0027d just tell me who this guy is, Mr. Evans. You\u0027ve got a man in your apartment, you don\u0027t know who he is, you don\u0027t know how he got here. Forgive me if I feel you\u0027re maybe leaving something out.\"\u003c/p\u003e\n\u003cp\u003e\"I am.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Perry took out his notebook. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003e\"The guy\u0027s a private detective.\"\u003c/p\u003e\n\u003cp\u003e\"I know that.\"\u003c/p\u003e\n\u003cp\u003e\"You do?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"The paramedics checked his pockets, found a license in his wallet. Go on.\"\u003c/p\u003e\n\u003cp\u003e\"He told me he had been hired by a client of mine.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. Which client is that?\" Perry was writing.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you that,\" Evans said.\u003c/p\u003e\n\u003cp\u003eHe looked up from his pad. \"Mr. Evans\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. That\u0027s privileged.\"\u003c/p\u003e\n\u003cp\u003eThe detective gave a long sigh. \"Okay, so this guy is a private investigator hired by a client of yours.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" Evans said. \"The investigator contacted me and said he wanted to see me, to give me something.\"\u003c/p\u003e\n\u003cp\u003e\"To give you something?\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t want to give it to the client?\"\u003c/p\u003e\n\u003cp\u003e\"He couldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Because?\"\u003c/p\u003e\n\u003cp\u003e\"The client is, uh, unavailable.\"\u003c/p\u003e\n\u003cp\u003e\"I see. So he came to you instead?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. And he was a bit paranoid, and wanted to meet me in my apartment.\"\u003c/p\u003e\n\u003cp\u003e\"So you left the door to your apartment open for him.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Some guy you\u0027d never seen before?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, well, I knew he was working for my client.\"\u003c/p\u003e\n\u003cp\u003e\"How did you know that?\"\u003c/p\u003e\n\u003cp\u003eEvans shook his head. \"Privileged.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. So this guy comes into your apartment. Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"I was at my office.\"\u003c/p\u003e\n\u003cp\u003eEvans quickly recounted his movements during the intervening two hours.\u003c/p\u003e\n\u003cp\u003e\"People saw you at the office?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Conversations?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"More than one person?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You see anybody else besides people in the law firm?\"\u003c/p\u003e\n\u003cp\u003e\"I stopped to get gas.\"\u003c/p\u003e\n\u003cp\u003e\"Attendant will recognize you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I had to go in to use my credit card.\"\u003c/p\u003e\n\u003cp\u003e\"Which station?\"\u003c/p\u003e\n\u003cp\u003e\"Shell on Pico.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. So you were gone two hours, you come back here, and the guy is amp;\"\u003c/p\u003e\n\u003cp\u003e\"As you saw him. Paralyzed.\"\u003c/p\u003e\n\u003cp\u003e\"And what was he going to give you?\"\u003c/p\u003e\n\u003cp\u003e\"I have no idea.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t find anything in the apartment?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Anything else you want to tell me?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eAnother long sigh. \"Look, Mr. Evans. If two people I knew were mysteriously paralyzed, I\u0027d be a little worried. But you don\u0027t seem worried.\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, I\u0027m worried,\" Evans said.\u003c/p\u003e\n\u003cp\u003eThe detective frowned at him. \"Okay,\" he said finally. \"You have a client privilege you\u0027re invoking. I have to tell you that I\u0027ve gotten calls from UCLA and from the CDC on this paralysis thing. Now that there\u0027s a second case, there are going to be more calls.\" He flipped his notebook shut. \"I\u0027m going to need you to come by the station and give us a signed statement. Can you do that later today?\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"Four o\u0027clock?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Fine.\"\u003c/p\u003e\n\u003cp\u003e\"The address is on the card. Just ask for me at the desk. Parking is under the building.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"See you then,\" the detective said, and turned to leave.\u003c/p\u003e\n\u003cp\u003eEvans shut the door behind him and leaned against it. He was glad to finally be alone. He walked around the apartment slowly, trying to focus his thoughts. The television was still on, but the sound was turned off. He looked at the couch where the private investigator had been sitting. The indentation of his body was still visible.\u003c/p\u003e\n\u003cp\u003eHe still had half an hour before he was supposed to meet with Drake. But he wanted to know what the PI had brought to him. Where was it? Evans had moved in every direction of the compass, and each time the man had indicated with his fingertips that it was the wrong direction.\u003c/p\u003e\n\u003cp\u003eWhich meant what? He hadn\u0027t brought the thing? It was somewhere else? Or that whoever paralyzed him had taken it, so it was no longer there?\u003c/p\u003e\n\u003cp\u003eEvans sighed. The critical questionis it here?was one he hadn\u0027t asked the detective. Evans just assumed it was there.\u003c/p\u003e\n\u003cp\u003eAnd suppose it was? Where would it be?\u003c/p\u003e\n\u003cp\u003eNorth, south, east, west. All wrong.\u003c/p\u003e\n\u003cp\u003eWhich meant amp;\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eHe shook his head. He was having trouble concentrating. The truth was, the private investigator\u0027s paralysis had unnerved him more than he wanted to admit. He looked at the couch, and the indentation. The guy couldn\u0027t move. It must have been terrifying. And the paramedics had lifted him up bodily, like a sack of potatoes, and put him on the stretcher. The cushions on the couch were in disarray, a reminder of their efforts.\u003c/p\u003e\n\u003cp\u003eIdly, Evans straightened up the couch, putting the cushions in place, fluffing them amp; He felt something. Inside a slit in one cushion. He stuck his hand deeper into the padding.\u003c/p\u003e\n\u003cp\u003e\"Damn,\" he said.\u003c/p\u003e\n\u003cp\u003eOf course it was obvious in retrospect. Moving away in every direction was wrong, because the investigator wanted Evans to move toward him. The guy was sitting on the thing, which he had slipped inside the couch cushion.\u003c/p\u003e\n\u003cp\u003eIt turned out to be a shiny DVD.\u003c/p\u003e\n\u003cp\u003eEvans dropped it in the DVD player, and watched as a menu came up, a list of dates. They were all in the last few weeks.\u003c/p\u003e\n\u003cp\u003eEvans clicked on the first date.\u003c/p\u003e\n\u003cp\u003eHe saw a view of the NERF conference room. It was a side angle, from the corner of the room, waist high. It must have been from a camera hidden in the speaker\u0027s podium or something, Evans thought. Undoubtedly the investigator had installed the camera the day Evans had seen him in the NERF conference room.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the screen was a running time code, numbers flickering. But Evans stared at the image itself, which showed Nicholas Drake talking to John Henley, the PR guy. Drake was upset, throwing up his hands.\u003c/p\u003e\n\u003cp\u003e\"I hate global warming,\" Drake said, almost shouting. \"I fucking hate it. It\u0027s a goddamn disaster.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been established,\" Henley said calmly. \"Over many years. It\u0027s what we have to work with.\"\u003c/p\u003e\n\u003cp\u003e\"To work with? But it doesn\u0027t work,\" Drake said. \"That\u0027s my point. You can\u0027t raise a dime with it, especially in winter. Every time it snows people forget all about global warming. Or else they decide some warming might be a good thing after all. They\u0027re trudging through the snow, hoping for a little global warming. It\u0027s not like pollution, John. Pollution worked. It still works. Pollution scares the shit out of people. You tell \u0027em they\u0027ll get cancer, and the money rolls in. But nobody is scared of a little warming. Especially if it won\u0027t happen for a hundred years.\"\u003c/p\u003e\n\u003cp\u003e\"You have ways to play it,\" Henley said.\u003c/p\u003e\n\u003cp\u003e\"Not anymore,\" Drake said. \"We\u0027ve tried them all. Species extinction from global warmingnobody gives a shit. They\u0027ve heard that most of the species that will become extinct are insects. You can\u0027t raise money on insect extinctions, John. Exotic diseases from global warmingnobody cares. Hasn\u0027t happened. We ran that huge campaign last year connecting global warming to the Ebola and Hanta viruses. Nobody went for it. Sea-level rise from global warmingwe all know where that\u0027ll end up. The Vanutu lawsuit is a fucking disaster. Everybody\u0027ll assume the sea level isn\u0027t rising anywhere. And that Scandinavian guy, that sea level expert. He\u0027s becoming a pest. He\u0027s even attacking the IPCC for incompetence.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Henley said patiently. \"That\u0027s all true amp;\"\u003c/p\u003e\n\u003cp\u003e\"So you tell me,\" Drake said, \"how the hell I\u0027m supposed to play global warming. Because you know what I have to raise to keep this organization going, John. I need forty-two million dollars a year. The foundations will only give me a quarter of that this year. The celebrities show up at the fund-raisers, but they don\u0027t give us shit. They\u0027re so egotistical they think showing up should be payment enough. Of course we sue the EPA every year, and they may cough up three, four million. With EPA grants, maybe five total. That still leaves a big gap, John. Global warming isn\u0027t going to cut it. I need a fucking cause. A cause that works!\"\u003c/p\u003e\n\u003cp\u003e\"I understand,\" Henley said, still very calm. \"But you are forgetting the conference.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Christ, the conference,\" Drake said. \"These assholes can\u0027t even get the posters right. Bendix is our best speaker; he\u0027s got a family problem. Wife is having chemo. Gordon was scheduled, but he\u0027s got some lawsuit about his research amp;Seems his notebooks were faked amp;\"\u003c/p\u003e\n\u003cp\u003e\"Those are details, Nicholas,\" Henley said. \"I\u0027m asking you to stay with the big picture\"\u003c/p\u003e\n\u003cp\u003eAt that moment, the phone rang. Drake answered it, listened briefly. Then he put his hand over the phone and turned to Henley.\u003c/p\u003e\n\u003cp\u003e\"We have to continue this later, John. I\u0027ve got an emergency here.\"\u003c/p\u003e\n\u003cp\u003eHenley got up, and left the room.\u003c/p\u003e\n\u003cp\u003eThe clip ended.\u003c/p\u003e\n\u003cp\u003eThe screen went black.\u003c/p\u003e\n\u003cp\u003eEvans stared at the blank screen. He felt as if he were going to be ill. A wave of dizziness passed over him. His stomach churned. He held the remote in his hand, but he did not press the buttons.\u003c/p\u003e\n\u003cp\u003eThe moment passed. He took a breath. On reflection, he realized that what he had seen wasn\u0027t really surprising. Perhaps Drake was more explicit in privateeveryone wasand obviously he felt under pressure to raise money. But the frustration he expressed was perfectly understandable. From the beginning, the movement had had to fight apathy in the broader society. Human beings didn\u0027t think in the long term. They didn\u0027t see the slow degradation of the environment. It had always been an uphill battle to rouse the public to do what was really in its own best interest.\u003c/p\u003e\n\u003cp\u003eThat fight was far from over. In fact, it was just beginning.\u003c/p\u003e\n\u003cp\u003eAnd it was probably true that it wasn\u0027t easy to raise money for global warming. So Nicholas Drake had his work cut out for him.\u003c/p\u003e\n\u003cp\u003eAnd environmental organizations were really working with very small funds. Forty-four million for NERF, the same for the NRDC, maybe fifty for the Sierra Club. The big one was the Nature Conservancy, they had three quarters of a billion. But what was that compared with the zillions of dollars that could be mobilized by corporations? It was David and Goliath. And Drake was David. As he had said himself, on every occasion.\u003c/p\u003e\n\u003cp\u003eEvans glanced at his watch. In any case, it was time to go see Drake.\u003c/p\u003e\n\u003cp\u003eHe took the DVD out of the player, slipped it into his pocket, and left the apartment. On his way, he reviewed what he was going to say. He went over it, again and again, trying to make it perfect. He had to do it carefully, because everything Kenner had told him to say was a lie. \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-32.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
