{"id":66409,"no":33,"title":"Page 33","content":"\u003cp\u003eChapter 48\u003c/p\u003e\n\u003cp\u003eBEVERLY HILLS\u003c/p\u003e\n\u003cp\u003eSATURDAY, OCTOBER 9\u003c/p\u003e\n\u003cp\u003e11:12 A.M.\u003c/p\u003e\n\u003cp\u003e\"Peter, Peter,\" Nicholas Drake said, shaking his hand warmly. \"I am very pleased to see you. You\u0027ve been away.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But you haven\u0027t forgotten my request.\"\u003c/p\u003e\n\u003cp\u003e\"No, Nick.\"\u003c/p\u003e\n\u003cp\u003e\"Have a seat.\"\u003c/p\u003e\n\u003cp\u003eEvans sat down and Drake sat behind the desk. \"Go ahead.\"\u003c/p\u003e\n\u003cp\u003e\"I traced the origin of that clause.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You were right. George did get the idea from a lawyer.\"\u003c/p\u003e\n\u003cp\u003e\"I knew it! Who?\"\u003c/p\u003e\n\u003cp\u003e\"An outside attorney, not in our firm.\" Evans spoke carefully, saying just what Kenner had instructed him to say.\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Unfortunately, Nick, there\u0027s documentation. Red-lined drafts with George\u0027s handwritten comments.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, shit. From when?\"\u003c/p\u003e\n\u003cp\u003e\"Six months ago.\"\u003c/p\u003e\n\u003cp\u003e\"Six months!\"\u003c/p\u003e\n\u003cp\u003e\"Apparently George has been concerned for some time about amp;things. The groups he supports.\"\u003c/p\u003e\n\u003cp\u003e\"He never told me.\"\u003c/p\u003e\n\u003cp\u003e\"Nor me,\" Evans said. \"He chose an outside attorney.\"\u003c/p\u003e\n\u003cp\u003e\"I want to see this correspondence,\" Drake said.\u003c/p\u003e\n\u003cp\u003eEvans shook his head. \"The attorney will never permit it.\"\u003c/p\u003e\n\u003cp\u003e\"George is dead.\"\u003c/p\u003e\n\u003cp\u003e\"Privilege continues after death. Swidler and Berlin v. United States.\"\u003c/p\u003e\n\u003cp\u003e\"This is bullshit, Peter, and you know it.\"\u003c/p\u003e\n\u003cp\u003eEvans shrugged. \"But this attorney plays by the book. And I have arguably overstepped proper bounds by saying as much as I have.\"\u003c/p\u003e\n\u003cp\u003eDrake drummed his fingers on the desk top. \"Peter, the Vanutu lawsuit is desperately in need of that money.\"\u003c/p\u003e\n\u003cp\u003e\"I keep hearing,\" Evans said, \"that that lawsuit may be dropped.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense.\"\u003c/p\u003e\n\u003cp\u003e\"Because the data sets don\u0027t show any rise in Pacific sea level.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d be careful about saying things like that,\" Drake said. \"Where did you hear that? Because that has to be disinformation from industry, Peter. There is no question sea levels are rising around the world. It\u0027s been scientifically demonstrated time and again. Why, just the other day I was looking at the satellite measurements of sea level, which are a relatively new way to make those measurements. The satellites show a rise of several millimeters, just in the last year.\"\u003c/p\u003e\n\u003cp\u003e\"Was that published data?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t remember offhand,\" Drake said, giving him an odd look. \"It was in one of the briefing summaries I get.\"\u003c/p\u003e\n\u003cp\u003eEvans hadn\u0027t planned to ask questions like these. They had just somehow come out of his mouth, unbidden. And he was uncomfortably aware that his tone was skeptical. No wonder Drake was giving him an odd look.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mean anything,\" Evans said quickly. \"It\u0027s just that I heard these rumors amp;\"\u003c/p\u003e\n\u003cp\u003e\"And you wanted to get to the bottom of it,\" Drake said, nodding. \"As is only natural. I\u0027m glad you brought this to my attention, Peter. I\u0027ll get on the horn with Henley and find out what\u0027s being disseminated. Of course it\u0027s an endless battle. You know we have those Neanderthals at the Competitive Enterprise Institute, and the Hoover Foundation, and the Marshall Institute to deal with. Groups financed by right-wing radicals and brain-dead fundamentalists. But, unfortunately, they have a tremendous amount of money at their disposal.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I understand,\" Evans said. He turned to go. \"Do you need me for anything else?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be frank,\" Drake said, \"I\u0027m not happy. Are we back to fifty thousand a week?\"\u003c/p\u003e\n\u003cp\u003e\"Under the circumstances, I think we have no option.\"\u003c/p\u003e\n\u003cp\u003e\"Then we will have to manage,\" Drake said. \"The lawsuit\u0027s going fine, by the way. But I have to focus my energies on the conference.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, right. When does that start?\"\u003c/p\u003e\n\u003cp\u003e\"Wednesday,\" Drake said. \"Four days from now. Now, if you\u0027ll excuse me amp;\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Evans said. He walked out of the office, leaving his cell phone on the side table across from the desk.\u003c/p\u003e\n\u003cp\u003eEvans had gone all the way down the stairs to the ground floor before he realized Drake hadn\u0027t asked him about his stitches. Everyone else he had seen that day had made some comment about them, but not Drake.\u003c/p\u003e\n\u003cp\u003eOf course, Drake had a lot on his mind, with the preparations for the conference. Directly ahead, Evans saw the ground-floor conference room bustling with activity. The banner on the wall read, ABRUPT CLIMATE CHANGETHE CATASTROPHE AHEAD. Twenty young people clustered around a large table, on which stood a scale model of the interior of an auditorium, and the surrounding parking lot. Evans paused to watch for a moment.\u003c/p\u003e\n\u003cp\u003eOne of the young people was putting wooden blocks in the parking lot, to simulate cars.\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t like that,\" another one said. \"He wants the slots nearest the building reserved for news vans, not buses.\"\u003c/p\u003e\n\u003cp\u003e\"I left three spaces over here for news,\" the first kid said. \"Isn\u0027t that enough?\"\u003c/p\u003e\n\u003cp\u003e\"He wants ten.\"\u003c/p\u003e\n\u003cp\u003e\"Ten spaces? How many news crews does he think are going to show up for this thing?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but he wants ten spaces and he\u0027s told us to arrange extra power and phone lines.\"\u003c/p\u003e\n\u003cp\u003e\"For an academic conference on abrupt climate change? I don\u0027t get it. How much can you say about hurricanes and droughts? He\u0027ll be lucky to have three crews.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, he\u0027s the boss. Mark off the ten slots and be done with it.\"\u003c/p\u003e\n\u003cp\u003e\"That means the buses have to go way in the back.\"\u003c/p\u003e\n\u003cp\u003e\"Ten slots, Jake.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, okay.\"\u003c/p\u003e\n\u003cp\u003e\"Next to the building, because the line feeds are very expensive. The auditorium\u0027s charging us an arm and a leg for the extra utilities.\"\u003c/p\u003e\n\u003cp\u003eAt the other end of the table, a girl was saying, \"How dark will it be in the exhibition spaces? Will it be dark enough to project video?\"\u003c/p\u003e\n\u003cp\u003e\"No, they\u0027re limited to flat panels.\"\u003c/p\u003e\n\u003cp\u003e\"Some of the exhibitors have all-in-one projectors.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that should be all right.\"\u003c/p\u003e\n\u003cp\u003eA young woman came up to Evans as he was standing looking into the room. \"Can I help you, sir?\" She looked like a receptionist. She had that bland prettiness.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said, nodding toward the conference room. \"I was wondering how I arrange to attend this conference.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s by invitation only, I\u0027m afraid,\" she said. \"It\u0027s an academic conference, not really open to the public.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve just left Nick Drake\u0027s office,\" Evans said, \"and I forgot to ask him\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Well, actually, I have some comp tickets at the reception desk. Do you know which day you\u0027ll be attending?\"\u003c/p\u003e\n\u003cp\u003e\"All of them,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s quite a commitment,\" she said, smiling. \"If you\u0027ll come this way, sir amp;\"\u003c/p\u003e\n\u003cp\u003eIt was only a short drive from NERF to the conference headquarters, in downtown Santa Monica. Workmen on a cherry picker were placing letters on the large sign: so far it said, ABRUPT CLIMATE CHA, and beneath, THE CATASTR.\u003c/p\u003e\n\u003cp\u003eHis car was hot in the midday sun. Evans called Sarah on the car phone. \"It\u0027s done. I left my phone in his office.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. I was hoping you\u0027d call earlier. I don\u0027t think that matters anymore.\"\u003c/p\u003e\n\u003cp\u003e\"No? Why?\"\u003c/p\u003e\n\u003cp\u003e\"I think Kenner already found out what he needed.\"\u003c/p\u003e\n\u003cp\u003e\"He did?\"\u003c/p\u003e\n\u003cp\u003e\"Here, talk to him.\"\u003c/p\u003e\n\u003cp\u003eEvans thought, she\u0027s with him?\u003c/p\u003e\n\u003cp\u003e\"Kenner speaking.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Peter,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"In Santa Monica.\"\u003c/p\u003e\n\u003cp\u003e\"Go back to your apartment and pack some hiking clothes. Then wait there.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"Change all the clothes you are wearing now. Take nothing with you that you are wearing right now.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Later.\"\u003c/p\u003e\n\u003cp\u003eClick. The phone was dead.\u003c/p\u003e\n\u003cp\u003eBack in his apartment, he hastily packed a bag. Then he went back to the living room. While he waited, he put the DVD back into the player and waited for the menu of dates.\u003c/p\u003e\n\u003cp\u003eHe chose the second date on the list.\u003c/p\u003e\n\u003cp\u003eOn the screen, he once again saw Drake and Henley. It must have been the same day, because they were dressed in the same clothes. But now it was later. Drake had his jacket off, hung over a chair.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve listened to you before,\" Drake was saying. He sounded resentful. \"And your advice didn\u0027t work.\"\u003c/p\u003e\n\u003cp\u003e\"Think structurally,\" Henley said, leaning back in his chair, staring up at the ceiling, fingertips tented.\u003c/p\u003e\n\u003cp\u003e\"What the hell does that mean?\" Drake said.\u003c/p\u003e\n\u003cp\u003e\"Think structurally, Nicholas. In terms of how information functions. What it holds up, what holds it up.\"\u003c/p\u003e\n\u003cp\u003e\"This is just PR bullshit.\"\u003c/p\u003e\n\u003cp\u003e\"Nicholas,\" Henley said, sharply. \"I am trying to help you.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry.\" Drake looked chastened. He hung his head a little.\u003c/p\u003e\n\u003cp\u003eWatching the video, Evans thought: Is Henley in charge here? For a moment, it certainly appeared that way.\u003c/p\u003e\n\u003cp\u003e\"Now then,\" Henley said. \"Let me explain how you are going to solve your problem. The solution is simple. You have already told me\"\u003c/p\u003e\n\u003cp\u003eThere was a loud pounding on Evans\u0027s door. Evans stopped the DVD, and just to be safe, removed it from the player and slipped it into his pocket. The pounding continued, impatient, as he went to the door.\u003c/p\u003e\n\u003cp\u003eIt was Sanjong Thapa. He looked grim.\u003c/p\u003e\n\u003cp\u003e\"We have to leave,\" he said. \"Right now.\"\u003c/p\u003e\n\u003cp\u003eChapter 49\u003c/p\u003e\n\u003cp\u003eV. SNAKE\u003c/p\u003e\n\u003cp\u003eDIABLO\u003c/p\u003e\n\u003cp\u003eSUNDAY, OCTOBER 10\u003c/p\u003e\n\u003cp\u003e2:43 P.M.\u003c/p\u003e\n\u003cp\u003eThe helicopter thumped over the Arizona desert, twenty miles east of Flagstaff, not far from Canyon Diablo. In the back seat, Sanjong handed Evans pictures and computer printouts. Speaking of the Environmental Liberation Front, he said, \"We assume their networks are up, but so are ours. All our networks are running,\" he said, \"and we picked up an unexpected clue from one of them. Of all things, the Southwestern Parks Management Association.\"\u003c/p\u003e\n\u003cp\u003e\"Which is?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s an organization of state park managers from all the western states. And they discovered that something very odd had happened.\" A large percentage of the state parks in Utah, Arizona, and New Mexico were booked in advance, and paid for, to reserve them for company picnics, school celebrations, institutional birthday parties, and so on, for this weekend. In each case they were family affairs, involving parents and kids, sometimes grandparents, too.\u003c/p\u003e\n\u003cp\u003eTrue, this was a long three-day weekend. But nearly all the advance bookings were for Monday. Only a handful had been for Saturday or Sunday. None of the park superintendents could remember such a thing happening before.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t get it,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t either,\" Sanjong said. \"They thought it might be some cult thing, and because the parks can\u0027t be used for religious purposes, they got on the phone and called some of the organizations. And they found in every case that the organization had received a special donation to fund the function on this particular weekend.\"\u003c/p\u003e\n\u003cp\u003e\"Donation from whom?\"\u003c/p\u003e\n\u003cp\u003e\"Charitable organizations. In every case the situation was the same. They\u0027d receive a letter saying Thank you for your recent request for funding. We are pleased to say we can support your get-together at such-and-such park on Monday, October eleventh. The check has already been sent in your name. Enjoy your gathering.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"But the groups never requested the booking?\"\u003c/p\u003e\n\u003cp\u003e\"No. So they\u0027d call the charity, and someone would tell them it must have been a mixup, but since the checks were already sent out, they might as well go ahead and use the park that day. And a lot of the groups decided they would.\"\u003c/p\u003e\n\u003cp\u003e\"And these charitable organizations were?\"\u003c/p\u003e\n\u003cp\u003e\"None you ever heard of. The Amy Rossiter Fund. The Fund for a New America. The Roger V. and Eleanor T. Malkin Foundation. The Joiner Memorial Foundation. All together, about a dozen charities.\"\u003c/p\u003e\n\u003cp\u003e\"Real charities?\"\u003c/p\u003e\n\u003cp\u003eSanjong shrugged. \"We assume not. But we\u0027re checking that now.\"\u003c/p\u003e\n\u003cp\u003eEvans said, \"I still don\u0027t get it.\"\u003c/p\u003e\n\u003cp\u003e\"Somebody wants those parks used this weekend.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but why?\"\u003c/p\u003e\n\u003cp\u003eSanjong handed him a photograph. It was an aerial shot in false colors, and it showed a forest, the trees bright red against a dark blue ground. Sanjong tapped the center of the picture. There, in a clearing in the forest, Evans saw what looked like a spiderweb on the grounda series of concentric lines connecting fixed points. Like a spiderweb.\u003c/p\u003e\n\u003cp\u003e\"And that is?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a rocket array. The launchers are the fixed points. The lines are the power cables to control the launch.\" His finger moved across the picture. \"And you see, there\u0027s another array here. And a third one here. The three arrays form a triangle, approximately five miles on each side.\"\u003c/p\u003e\n\u003cp\u003eEvans could see it. Three separate spiderwebs, set in clearings in the forest.\u003c/p\u003e\n\u003cp\u003e\"Three rocket arrays amp;\"\u003c/p\u003e\n\u003cp\u003e\"Yes. We know they have purchased five hundred solid-state rockets. The rockets themselves are quite small. Close analysis of the picture elements indicates that the launchers are four to six inches in diameter, which means the rockets are capable of going up about a thousand feet or so. Not more than that. Each array has about fifty rockets, wired together. Probably not set to fire at the same time. And you notice the launchers are placed quite far apart amp;\"\u003c/p\u003e\n\u003cp\u003e\"But for what purpose?\" Evans said. \"These things are out in the middle of nowhere. They shoot up a thousand feet, and then fall back down? Is that it? What\u0027s the point of that?\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t know,\" Sanjong said. \"But we have another clue. The picture you\u0027re holding in your hands was taken yesterday. But here is a picture from a flyby this morning.\" He handed Evans a second picture, showing the same terrain.\u003c/p\u003e\n\u003cp\u003eThe spiderwebs were gone.\u003c/p\u003e\n\u003cp\u003e\"What happened?\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"They packed up and left. You see in the first picture, there are vans parked at the edge of the clearings. Apparently, they just put everything in the vans and moved.\"\u003c/p\u003e\n\u003cp\u003e\"Because they were spotted?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s unlikely they know they were spotted.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-33.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
