{"id":66412,"no":36,"title":"Page 36","content":"\u003cp\u003eLooking back, she saw the tree burning, and the fire spreading laterally in fingers along the ground.\u003c/p\u003e\n\u003cp\u003eKenner on the radio: \"Sarah, what\u0027s happening?\"\u003c/p\u003e\n\u003cp\u003e\"We had to leave the road. We\u0027re being struck by lightning.\"\u003c/p\u003e\n\u003cp\u003e\"A lot!\" Evans yelled. \"All the time!\"\u003c/p\u003e\n\u003cp\u003e\"Find the attractor,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s attached to the car,\" Sarah said. As she spoke, a bolt smashed down on the road just ahead of them. The glare was so bright she saw green streaks before her eyes.\u003c/p\u003e\n\u003cp\u003e\"Then dump the car,\" Kenner said. \"Go out as low as you can.\"\u003c/p\u003e\n\u003cp\u003eHe clicked off. Evans continued to race forward, the SUV bouncing on the ruts. \"I don\u0027t want to leave,\" he said. \"I think we\u0027re safer inside. They always say don\u0027t leave your car because you\u0027re safer inside. The rubber tires insulate you.\"\u003c/p\u003e\n\u003cp\u003e\"But something\u0027s on fire,\" she said, sniffing.\u003c/p\u003e\n\u003cp\u003eThe car jolted and bounced. Sarah tried to keep her balance, just holding onto her seat, not touching the metal of the doors.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care, I think we should stay,\" Evans said.\u003c/p\u003e\n\u003cp\u003e\"The gas tank might explode amp;\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to leave,\" he said. \"I\u0027m not leaving.\" His knuckles were white, gripping the wheel. Ahead, Sarah saw a clearing in the forest. It was a large clearing, with high, yellow grass.\u003c/p\u003e\n\u003cp\u003eA lightning bolt smashed down with a fearsome crack, shattering the side mirror, which blew apart like a bomb. A moment later, they heard a soft whump. The car tilted to one side. \"Oh shit,\" Evans said. \"It blew a tire.\"\u003c/p\u003e\n\u003cp\u003e\"So much for the insulation,\" she said.\u003c/p\u003e\n\u003cp\u003eThe car was now grinding, the underside scraping over a dirt rut, metal squealing.\u003c/p\u003e\n\u003cp\u003e\"Peter,\" she said.\u003c/p\u003e\n\u003cp\u003e\"All right, all right, just let me get to the clearing.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think we can wait.\"\u003c/p\u003e\n\u003cp\u003eBut the rut ended, the road flattened, and Evans drove forward, creaking on the rim, into the clearing. Raindrops spattered the windshield. Above the grass, Sarah saw the roofs of wooden buildings bleached by the sun. It took her a moment to realize that this was a ghost town. Or a mining town.\u003c/p\u003e\n\u003cp\u003eDirectly ahead was a sign, auroraville, pop. 82. Another lightning bolt crashed down, and Evans hit the sign, knocking it over.\u003c/p\u003e\n\u003cp\u003e\"Peter, I think we\u0027re here.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, yeah, let me get a little closer\"\u003c/p\u003e\n\u003cp\u003e\"Now, Peter!\"\u003c/p\u003e\n\u003cp\u003eHe stopped the car, and they flung open their doors in unison. Sarah threw herself bodily onto the ground, and another bolt crashed so close to her that the blast of hot air knocked her sideways and sent her rolling on the ground. The roar of the lightning was deafening.\u003c/p\u003e\n\u003cp\u003eShe got up on hands and knees, and scrambled around to the back of the vehicle. Evans was on the other side of the SUV, yelling something, but she couldn\u0027t hear him. She examined the rear bumper. There was no attachment, no device.\u003c/p\u003e\n\u003cp\u003eThere was nothing there.\u003c/p\u003e\n\u003cp\u003eBut she had no time to think, because another bolt struck the back of the SUV, rocking it, and the rear window shattered, sprinkling her with shards of glass. She fought panic and scrambled forward, staying low as she moved around the SUV and through the grass toward the nearest building.\u003c/p\u003e\n\u003cp\u003eEvans was somewhere ahead, yelling to her. But she couldn\u0027t hear him over the rumbling thunder. She just didn\u0027t want another bolt, not now, if she could just go a few more seconds amp; Her hands touched wood. A board.\u003c/p\u003e\n\u003cp\u003eA step.\u003c/p\u003e\n\u003cp\u003eShe crawled forward quickly, pushing aside the grass, and now she saw a porch, a dilapidated building, and swinging from the roof a sign bleached so gray she couldn\u0027t see what it said. Evans was inside, and she scrambled forward, ignoring the splinters in her hands, and he was yelling, yelling.\u003c/p\u003e\n\u003cp\u003eAnd she finally heard what he was saying:\u003c/p\u003e\n\u003cp\u003e\"Look out for the scorpions!\"\u003c/p\u003e\n\u003cp\u003eThey were all over the wooden porchtiny, pale yellow, with their stingers in the air. There must have been two dozen. They moved surprisingly fast, scampering sideways, like crabs.\u003c/p\u003e\n\u003cp\u003e\"Stand up!\"\u003c/p\u003e\n\u003cp\u003eShe got to her feet, and ran, feeling the arachnids crunch under her feet. Another lightning bolt smashed into the building\u0027s roof, knocking down the sign, which fell in a cloud of dust onto the porch.\u003c/p\u003e\n\u003cp\u003eBut then she was inside the building. And Evans was standing there, fists raised, yelling, \"Yes! Yes! We did it!\"\u003c/p\u003e\n\u003cp\u003eShe was gasping for breath. \"At least they weren\u0027t snakes,\" she said, chest heaving.\u003c/p\u003e\n\u003cp\u003eEvans said, \"What?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027re always rattlers in these old buildings.\"\u003c/p\u003e\n\u003cp\u003e\"Oh Jesus.\"\u003c/p\u003e\n\u003cp\u003eOutside, thunder rumbled.\u003c/p\u003e\n\u003cp\u003eAnd the lightning started again.\u003c/p\u003e\n\u003cp\u003eThrough the shattered, grimy window Sarah was looking at the SUV, and thinking that now that they had left the car, there were no more lightning strikes on the SUV amp;thinking¬hing on the bumper amp;then why had the pickup nudged the SUV? What was the point? She turned to ask Evans if he had noticed And a lightning bolt blasted straight down through the roof, smashing it open to the dark sky, sending boards flying in all directions, and blasting into the ground right where she had been standing. The lightning left a blackened pattern of jagged streaks, like the shadow of a thorn bush on the floor. The ozone smell was strong. Wisps of smoke drifted up from the dry floorboards.\u003c/p\u003e\n\u003cp\u003e\"This whole building could go,\" Evans said. He was already flinging a side door open, heading outside.\u003c/p\u003e\n\u003cp\u003e\"Stay low,\" Sarah said, and followed him out.\u003c/p\u003e\n\u003cp\u003eThe rain was coming down harder, big splattering drops that struck her back and shoulders as she ran to the next building. It had a brick chimney, and looked generally better built. But the windows were the same, broken and thickly coated with dust and grime.\u003c/p\u003e\n\u003cp\u003eThey tried the nearest door, but it was jammed shut, so they ran around to the front, and found that door wide open. Sarah ran inside. A lightning bolt smashed down behind her, sagging the roof over the porch, splintering one of the side posts as it streaked down into the ground. The shockwave blasted the front windows in a shower of dirty glass. Sarah turned away, covering her face, and when she looked out again, she realized she was in a blacksmith\u0027s shop. There was a large firepit in the center of the room, and above it all sorts of iron implements hanging from the ceiling.\u003c/p\u003e\n\u003cp\u003eAnd on the walls, she saw horseshoes, tongs, metal of all sorts.\u003c/p\u003e\n\u003cp\u003eThis room was full of metal.\u003c/p\u003e\n\u003cp\u003eThe thunder rumbled ominously. \"We have to get out of here,\" Evans shouted. \"This is the wrong place to\"\u003c/p\u003e\n\u003cp\u003eHe never finished. The next bolt knocked him off his feet as it came crashing down through the ceiling, spinning the iron implements, then smashing into the firepit, blasting the bricks outward in all directions. Sarah ducked, covering her head and ears, felt bricks striking her shoulders, back, legsknocking her overand then there was a burst of pain in her forehead, and she saw brief stars before blackness settled over her and the rumble of thunder faded to endless silence.\u003c/p\u003e\n\u003cp\u003eChapter 53\u003c/p\u003e\n\u003cp\u003eFOREST\u003c/p\u003e\n\u003cp\u003eMONDAY, OCTOBER 11\u003c/p\u003e\n\u003cp\u003e11:11 A.M.\u003c/p\u003e\n\u003cp\u003eKenner was fifteen miles away, driving east on Route 47, listening to Sarah\u0027s radio. Her transmitter was still on, clipped to her belt. It was hard to be sure what was happening because each lightning strike produced a burst of static that lasted for the next fifteen seconds. Nevertheless he understood the most important pointEvans and Sarah had gotten away from the SUV, but the lightning hadn\u0027t stopped. In fact it seemed that the lightning was following them.\u003c/p\u003e\n\u003cp\u003eKenner had been yelling into his handset, trying to get Sarah\u0027s attention, but apparently she had turned her volume down, or was too busy dealing with what was happening in the ghost town. He kept saying, \"It\u0027s following you!\" over and over.\u003c/p\u003e\n\u003cp\u003eBut she never answered.\u003c/p\u003e\n\u003cp\u003eNow there was a long burst of static, followed by silence. Kenner switched channels.\u003c/p\u003e\n\u003cp\u003e\"Sanjong?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Professor.\"\u003c/p\u003e\n\u003cp\u003e\"Have you been listening?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you?\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"I am on Route 190, going north. I estimate I am three miles from the web.\"\u003c/p\u003e\n\u003cp\u003e\"Any lightning yet?\"\u003c/p\u003e\n\u003cp\u003e\"No. But the rain has just started here. First drops on the windshield.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Hang on.\"\u003c/p\u003e\n\u003cp\u003eHe went back to Sarah\u0027s channel. There was still static, but it was fading.\u003c/p\u003e\n\u003cp\u003e\"Sarah! Are you there? Sarah! Sarah!\"\u003c/p\u003e\n\u003cp\u003eKenner heard a cough, a distant cough.\u003c/p\u003e\n\u003cp\u003e\"Sarah!\"\u003c/p\u003e\n\u003cp\u003eA click. A bang. Someone fumbling with the radio. A cough. \"This is Peter. Evans.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening there?\"\u003c/p\u003e\n\u003cp\u003e\"dead.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s dead. Sarah\u0027s dead. She got hit with a brick, and she fell and then there was a lightning strike that hit her full on the body and she\u0027s dead. I\u0027m right here beside her. She\u0027s dead, oh shit, she\u0027s dead amp;\"\u003c/p\u003e\n\u003cp\u003e\"Try mouth-to-mouth.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you, she\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"Peter. Mouth-to-mouth.\"\u003c/p\u003e\n\u003cp\u003e\"Oh God amp;She\u0027s blue amp;\"\u003c/p\u003e\n\u003cp\u003e\"That means she\u0027s alive, Peter.\"\u003c/p\u003e\n\u003cp\u003e\"like a corpse, acorpse\"\u003c/p\u003e\n\u003cp\u003e\"Peter, listen to me.\"\u003c/p\u003e\n\u003cp\u003eBut Evans wasn\u0027t hearing anything. The idiot had his finger on the radio button. Kenner swore in frustration. And then suddenly a new blast of static. Kenner knew what it meant.\u003c/p\u003e\n\u003cp\u003eThere had been another lightning strike. A bad one.\u003c/p\u003e\n\u003cp\u003e\"Sanjong?\"\u003c/p\u003e\n\u003cp\u003eNow, Kenner heard nothing but static on Sanjong\u0027s channel, too. It lasted ten seconds, fifteen seconds. So Sanjong had a strike, too. Only then did Kenner realize what must be causing it.\u003c/p\u003e\n\u003cp\u003eSanjong came back, coughing.\u003c/p\u003e\n\u003cp\u003e\"Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"I had a lightning strike. Very near the car. I cannot imagine, so close.\"\u003c/p\u003e\n\u003cp\u003e\"Sanjong,\" Kenner said. \"I think it\u0027s the radios.\"\u003c/p\u003e\n\u003cp\u003e\"You think?\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027d we get them?\"\u003c/p\u003e\n\u003cp\u003e\"I had them FedExed from DC.\"\u003c/p\u003e\n\u003cp\u003e\"Package delivered to you personally?\"\u003c/p\u003e\n\u003cp\u003e\"No. To the motel. The owner gave it to me when I checked in amp;But the box was sealed amp;\"\u003c/p\u003e\n\u003cp\u003e\"Throw your radio away,\" Kenner said.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no cellular net, we won\u0027t be in communic\"\u003c/p\u003e\n\u003cp\u003eNothing more. Just a blast of static.\u003c/p\u003e\n\u003cp\u003e\"Peter.\"\u003c/p\u003e\n\u003cp\u003eThere was no answer. Only silence on the radio. Not even static now.\u003c/p\u003e\n\u003cp\u003e\"Peter. Answer me. Peter. Are you there?\"\u003c/p\u003e\n\u003cp\u003eNothing. Dead.\u003c/p\u003e\n\u003cp\u003eKenner waited a few moments. There was no answer from Evans.\u003c/p\u003e\n\u003cp\u003eThe first drops of rain splashed on Kenner\u0027s windshield. He rolled down his window, and threw his radio away. It bounced on the pavement, and went into the grass on the other side of the road.\u003c/p\u003e\n\u003cp\u003eKenner had gone another hundred yards down the road when a bolt of lightning crashed down behind him on the opposite side of the road.\u003c/p\u003e\n\u003cp\u003eIt was the radios, all right.\u003c/p\u003e\n\u003cp\u003eSomebody had gotten to the radios. In DC? Or in Arizona? It was hard to know for sure, and at this point it didn\u0027t matter. Their carefully coordinated plan was now impossible to carry out. The situation was suddenly very dangerous. They had planned to hit all three rocket arrays at the same time. That would not happen now. Of course Kenner could still hit his array. If Sanjong was still alive, he might get to the second array, but their attack would not be coordinated. If one of them were later than the other, the second rocket team would have been informed by radio, and would be waiting with guns ready. Kenner had no doubt about that.\u003c/p\u003e\n\u003cp\u003eAnd Sarah and Evans were either dead or unable to function. Their car was broken down. Certainly they would never make it to the third array.\u003c/p\u003e\n\u003cp\u003eSo. Just one rocket array taken out. Maybe two.\u003c/p\u003e\n\u003cp\u003eWould that be enough?\u003c/p\u003e\n\u003cp\u003eMaybe, he thought.\u003c/p\u003e\n\u003cp\u003eKenner looked at the road ahead, a pale strip under dark skies. He did not think about whether his friends were alive or not. Perhaps all three were dead. But if Kenner did not stop the storm, there would be hundreds dead. Children, families. Paper plates in the mud, while the searchers dug out the bodies.\u003c/p\u003e\n\u003cp\u003eSomehow he had to stop it.\u003c/p\u003e\n\u003cp\u003eHe drove forward, into the storm.\u003c/p\u003e\n\u003cp\u003eChapter 54\u003c/p\u003e\n\u003cp\u003eMCKINLEY\u003c/p\u003e\n\u003cp\u003eMONDAY, OCTOBER 11\u003c/p\u003e\n\u003cp\u003e11:29 A.M.\u003c/p\u003e\n\u003cp\u003e\"Mommy! Mommy! Brad hit me! Mommy! Make him stop!\"\u003c/p\u003e\n\u003cp\u003e\"All right, kids amp;\"\u003c/p\u003e\n\u003cp\u003e\"Bradley? How many times do I have to tell you? Leave your sister alone!\"\u003c/p\u003e\n\u003cp\u003eStanding to one side of McKinley Park, Trooper Miguel Rodriguez of the Arizona Highway Patrol stood by his car and watched the picnic in progress. It was now eleven-thirty in the morning, and the kids were getting hungry. They were starting to fight. All around the park, barbecues were going, the smoke rising into an ever-darkening sky. Some of the parents looked upward with concern, but nobody was leaving the park. And the rain hadn\u0027t started here, even though they had heard the crack of lightning and the rumble of thunder a few miles to the north.\u003c/p\u003e\n\u003cp\u003eRodriguez glanced at the bullhorn resting on the seat of his car. For the last half hour, he had waited impatiently for the radio call from Agent Kenner, telling him to clear the park.\u003c/p\u003e\n\u003cp\u003eBut the call hadn\u0027t yet come.\u003c/p\u003e\n\u003cp\u003eAnd Agent Kenner had given him explicit instructions. Do not clear McKinley Park before he was given the word.\u003c/p\u003e\n\u003cp\u003eTrooper Rodriguez didn\u0027t understand why it was necessary to wait, but Kenner had been insistent. He said it was a matter of national security. Rodriguez didn\u0027t understand that either. How was a damn picnic in a park a matter of national security?\u003c/p\u003e\n\u003cp\u003eBut he knew an order when he heard one. So Rodriguez waited, impatient and uneasy, and watched the sky. Even when he heard the weather service announce a flash flood advisory for the eastern counties from Kayenta to Two Guns and Camp Paysonan area that included McKinleyRodriguez still waited.\u003c/p\u003e\n\u003cp\u003eHe could not know that the radio call he was waiting for would never come.\u003c/p\u003e\n\u003cp\u003eChapter 55\u003c/p\u003e\n\u003cp\u003eAURORAVILLE\u003c/p\u003e\n\u003cp\u003eMONDAY, OCTOBER 11\u003c/p\u003e\n\u003cp\u003e11:40 A.M.\u003c/p\u003e\n\u003cp\u003eIn retrospect, what saved Peter Evans was the slight tingling he had felt, holding the radio in his sweating palm. In the minutes before, Evans had realized that something was causing the lightning to follow them wherever they went. He didn\u0027t know any science, but assumed it must be something metallic or electronic. Talking to Kenner, he had felt the faint electric tingle from the handsetand on an impulse he had flung it across the room. It landed against a large iron viselike contraption that looked like a bear trap. \u003c/p\u003e","sourceLink":"https://allnovel.net/state-of-fear/page-36.html","bookId":1706,"creation":"Oct 5, 2019 10:01:14 AM","modification":"Oct 5, 2019 10:01:14 AM"}
