{"id":86025,"no":31,"title":"Page 31","content":"\u003cp\u003e\"You,\" Elena says, pointing directly at me. \"Come with me. Alex, I want you and your brothers to sing.\"\u003c/p\u003e\n\u003cp\u003eAlex shakes his head. \"Elena, I don\u0027t think--\"\u003c/p\u003e\n\u003cp\u003eElena holds up a hand in front of Alex, silencing even him. \"I didn\u0027t ask you to think. I asked you to join your brothers in singin\u0027 to me and my new husband.\"\u003c/p\u003e\n\u003cp\u003eElena opens the door and yanks me through the house, stopping only when we reach the backyard. She lets me go only to grab the microphone from the lead singer.\u003c/p\u003e\n\u003cp\u003e\"Paco!\" she announces loudly. \"Yeah, I\u0027m talkin\u0027 to you,\" Elena says, pointing to Paco talking to a bunch of girls. \"Next time you want to take a dump, do it in someone else\u0027s house.\"\u003c/p\u003e\n\u003cp\u003ePaco\u0027s entourage of girls backs up and giggles, leaving him alone.\u003c/p\u003e\n\u003cp\u003eJorge rushes to the stage and attempts to pick up his wife. The poor man struggles while everyone laughs and claps.\u003c/p\u003e\n\u003cp\u003eWhen Elena is finally off the stage and Alex talks to the band leader, the guests cheer for Alex and his brothers to sing.\u003c/p\u003e\n\u003cp\u003ePaco sits next to me.\u003c/p\u003e\n\u003cp\u003e\"Uh, sorry about the bathroom thing. I tried to warn you,\" he says sheepishly.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay. I think Elena embarrassed you enough.\" I lean over to Paco and ask, \"Seriously, what do you think of Alex and me together?\"\u003c/p\u003e\n\u003cp\u003e\"Seriously, you\u0027re pro\u0027bly the best thing that\u0027s ever happened to the guy.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 40 Alex\u003c/p\u003e\n\u003cp\u003eAfter my dad died, our ma tried to cheer me, Carlos, and Luis with music. We\u0027d dance around the house, taking turns singing with her. I think it was her way to forget her sorrow, at least for a little while. At night I used to hear her sobbing in her room. I never opened the door, but I itched to break into song and make all of her hurt go away.\u003c/p\u003e\n\u003cp\u003eI talk to the band before taking the microphone. \"I wouldn\u0027t make a fool out of myself by doin\u0027 this, but the Fuentes brothers can\u0027t ignore this special request from the bride. Elena can be pretty persuasive.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I know!\" Jorge yells back.\u003c/p\u003e\n\u003cp\u003eElena punches him in his arm. He winces. Elena knows how to land a punch. Jorge kisses his bride, too happy to care.\u003c/p\u003e\n\u003cp\u003eMy brothers and I start to sing. It isn\u0027t a serious song. We ad lib songs by Enrique Iglesias, Shakira, and even my favorite, Mana. When I crouch down to sing to my little cousins, I wink at Brittany.\u003c/p\u003e\n\u003cp\u003eThat\u0027s when I notice a hush in the crowd and whispers of shock. It\u0027s Hector. He made an appearance, which is rare. He winds his way through the yard wearing an expensive suit while everyone stares at him.\u003c/p\u003e\n\u003cp\u003eI finish the song and take my place at Brittany\u0027s side. I have an urge to protect her.\u003c/p\u003e\n\u003cp\u003e\"Want a smoke?\" Paco asks me as he pulls Marlboros out of his back pocket.\u003c/p\u003e\n\u003cp\u003eI briefly glance at Brittany before answering, \"No.\"\u003c/p\u003e\n\u003cp\u003ePaco looks at me curiously, then shrugs and takes one for himself. \"Great singin\u0027, Alex. If you would\u0027ve given me a few more minutes I\u0027d have your novia in the palm of my hand.\"\u003c/p\u003e\n\u003cp\u003eHe called her my girl. Is she my girl?\u003c/p\u003e\n\u003cp\u003eI lead her to a cooler full of drinks, Paco in tow. I\u0027m careful not to steer her toward Hector.\u003c/p\u003e\n\u003cp\u003eMario, a friend of one of my cousins, is standing over the cooler sporting Python Trio gang colors and big, baggy jeans that hang off his ass. The Python Trio are our allies, but if Brittany saw him on the street, she\u0027d probably run in the opposite direction.\u003c/p\u003e\n\u003cp\u003e\"Hey Alex, Paco,\" Mario says.\u003c/p\u003e\n\u003cp\u003e\"I see you dressed up for the wedding, Mario,\" I mutter.\u003c/p\u003e\n\u003cp\u003e\"Cabron, monkey suits are for white guys,\" Mario says, ignoring the fact that my date is in fact white. \"You suburban gangstas are too soft. In the city are the real broth\u0027as.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, tough guy,\" Paco says with pure attitude. \"Tell that to Hector.\"\u003c/p\u003e\n\u003cp\u003eI glare at Mario. \"Mario, you keep talkin\u0027 shit like that and I\u0027ll give you firsthand proof of how tough we are ... never underestimate the LB.\"\u003c/p\u003e\n\u003cp\u003eMario backs up. \"Well, I\u0027ve got a date with a bottle of Corona. Catch you later, guey.\"\u003c/p\u003e\n\u003cp\u003e\"It looks like he\u0027s carryin\u0027 a load in those pants,\" Paco says, staring at Mario from behind.\u003c/p\u003e\n\u003cp\u003eI look over at Brittany, who looks paler than she usually is. \"You okay?\"\u003c/p\u003e\n\u003cp\u003e\"You threatened that guy,\" she whispers. \"I mean, seriously threatened him.\"\u003c/p\u003e\n\u003cp\u003eInstead of answering her, I take her hand and lead her to the edge of the makeshift dance floor, which is really a section of grass. Slow music is playing.\u003c/p\u003e\n\u003cp\u003eWhen I pull her close, she backs away. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Dance with me,\" I order. \"Don\u0027t argue with me. Put your arms around me and dance.\" I don\u0027t want to hear about how I\u0027m in a gang, and how it scares her, and how she wants me to be out of the gang in order for her to date me.\u003c/p\u003e\n\u003cp\u003e\"But--\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t think about what I said to Mario,\" I say close to her ear. \"He was feelin\u0027 us out, checkin\u0027 how loyal we are to Hector. If he senses any dissension, his gang might take advantage. You see, all gangs are separated into Folks or People. Every gang is affiliated with one or the other, and those affiliated with Folks are rivals with those affiliated with People. Mario is affiliated--\"\u003c/p\u003e\n\u003cp\u003e\"Alex,\" she interrupts.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Assure me nothing\u0027s going to happen to you.\"\u003c/p\u003e\n\u003cp\u003eI can\u0027t. \"Just dance,\" I say quietly as I guide her arms around me and we dance.\u003c/p\u003e\n\u003cp\u003eLooking over Brittany, I see Hector and my mother in an intense conversation. I wonder what they\u0027re talking about. She starts walking away from him, until he grabs her arm and pulls her back and says something in her ear. Just when I\u0027m about to stop dancing to find out what the hell is going on, mi\u0027ama smiles at Hector playfully and laughs at something he said. I\u0027m obviously being paranoid.\u003c/p\u003e\n\u003cp\u003eHours pass and darkness falls on the city. The party is still going strong when we walk to the car. On the drive back to Fairfield, we\u0027re both quiet.\u003c/p\u003e\n\u003cp\u003e\"Come here,\" I say softly when I park in the auto body\u0027s back lot.\u003c/p\u003e\n\u003cp\u003eShe leans over the middle console, closing the distance between us. \"I had an amazing time,\" she whispers. \"Well, besides when I hid in the bathroom . . . and you threatened that guy.\"\u003c/p\u003e\n\u003cp\u003e\"Forget about that and kiss me,\" I say.\u003c/p\u003e\n\u003cp\u003eI weave my hands in her hair. She wraps her arms around my neck as I trace the valley between her lips with my tongue. Parting her lips, I deepen the kiss. It\u0027s like a tango, first moving slow and rhythmic and then, when we\u0027re both panting and our tongues collide, the kiss turns into a hot, fast dance I never want to end. Carmen\u0027s kisses may have been hot, but Brittany\u0027s are more sensual, sexy, and extremely addictive.\u003c/p\u003e\n\u003cp\u003eWe\u0027re still in the car, but it\u0027s cramped and the front seats don\u0027t give us enough room. Before I know it, we\u0027ve moved to the backseat. Still not ideal, but I hardly notice.\u003c/p\u003e\n\u003cp\u003eI\u0027m so getting into her moans and kisses and hands in my hair. And the smell of vanilla cookies. I\u0027m not going to push her too far tonight. But without thinking, my hand slowly moves up her bare thigh.\u003c/p\u003e\n\u003cp\u003e\"It feels so good,\" she says breathlessly.\u003c/p\u003e\n\u003cp\u003eI lean her back while my hands explore on their own. My lips caress the hollow of her neck as I ease down the strap to her dress and bra. In response, she unbuttons my shirt. When it\u0027s open, her fingers roam over my chest and shoulders, searing my skin.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re . . . perfect,\" she pants.\u003c/p\u003e\n\u003cp\u003eRight now I\u0027m not gonna argue with her. Moving lower, my tongue follows a path down to her silky skin exposed to the night air. She grabs the back of my hair, urging me on. She tastes so damn good. Too good. !Caramelo!\u003c/p\u003e\n\u003cp\u003eI pull away a few inches and capture her gaze with mine, those shining sapphires glowing with desire. Talk about perfect.\u003c/p\u003e\n\u003cp\u003e\"I want you, chula,\" I say, my voice hoarse. She presses against my erection, the pleasure/pain almost unbearable. But when I start to pull her panties down, she stills my hand and pushes it away.\u003c/p\u003e\n\u003cp\u003e\"I . . . I\u0027m not ready for that. Alex, stop.\"\u003c/p\u003e\n\u003cp\u003eI move off her and sit back in the seat, waiting for my body to cool down. I can\u0027t look at her as she adjusts her straps, covering her body again. Shit, I went too fast. I told myself not to get too excited, to keep my wits when I\u0027m with this girl. Raking my hand through my hair, I let out a slow breath. \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m sorry. It\u0027s not your fault. I urged you on and you have every right to be pissed off. Listen, I just got out of a relationship with Colin and I\u0027ve got a lot of stuff going on at home.\" She puts her face in her hands. \"I\u0027m so confused.\" She grabs her purse and opens the door.\u003c/p\u003e\n\u003cp\u003eI follow her, my black shirt open and flying in the wind behind me like a vampire\u0027s cape. Either that or the grim reaper\u0027s. \"Brittany, wait.\"\u003c/p\u003e\n\u003cp\u003e\"Please . . . open the door to the garage. I need my car.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t go.\"\u003c/p\u003e\n\u003cp\u003eI press the keypad code.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she says once more.\u003c/p\u003e\n\u003cp\u003e\"Stop sayin\u0027 that. Listen, no matter what happened, I\u0027m not with you just to get into your pants. I got carried away with the way we clicked tonight, your vanilla scent that I wanted to keep inhalin\u0027 forever and . . . shit, I really messed this up, didn\u0027t I?\"\u003c/p\u003e\n\u003cp\u003eBrittany climbs inside her car. \"Can we take it slow, Alex? This is going way too fast for me.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I say, nodding. I keep my hands in my pockets, resisting the urge to pull her out of the car.\u003c/p\u003e\n\u003cp\u003eAnd dammit if Brittany doesn\u0027t drive away.\u003c/p\u003e\n\u003cp\u003eI\u0027d been caught up in her exploring eager hands and went overboard. I forget about everything except her when her body is close.\u003c/p\u003e\n\u003cp\u003eThe bet.\u003c/p\u003e\n\u003cp\u003eThis thing with Brittany is supposed to be about a bet, not falling for a north sider. I have to keep in mind that I\u0027m only interested in Brittany because of the bet, and I better ignore what I suspect are real feelings.\u003c/p\u003e\n\u003cp\u003eFeelings can\u0027t be a part of this game.\u003c/p\u003e\n\u003cp\u003eCHAPTER 41 Brittany\u003c/p\u003e\n\u003cp\u003eI pull into a McDonald\u0027s where I can be anonymous, change into jeans and a pink wrap-around sweater, and drive home.\u003c/p\u003e\n\u003cp\u003eI\u0027m scared because with Alex, it feels too raw. When I\u0027m with Alex, everything is way more intense. My feelings, my emotions, my desire. I was never addicted to Colin, never wanted to be with him twenty-four/ seven. I crave Alex. Oh, God. I think I\u0027m falling in love with him.\u003c/p\u003e\n\u003cp\u003eBut I know loving someone means losing a part of myself. And tonight, in the car when Alex reached under my dress, I was afraid of losing control. My entire life is about staying in control, so this is not good. It scares me.\u003c/p\u003e\n\u003cp\u003eI walk through the front door of my house, ready to sneak up to my room and put the dress in my closet. Unfortunately, my mom is standing in the foyer, waiting for me.\u003c/p\u003e\n\u003cp\u003e\"Where were you?\" my mother asks sternly while holding up my chemistry book and folder. \"You said you were working out, then studying with that Hernandez boy.\"\u003c/p\u003e\n\u003cp\u003eBusted. Time to either shut up or fess up. \"His last name is Fuentes, not Hernandez. And yes, I was with him.\"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eMy mother\u0027s lips are in a tight, thin line. \"It\u0027s obvious you weren\u0027t studying. What do you have in that gym bag?\" she demands. \"Drugs? Are you hiding drugs in there?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t do drugs,\" I respond sharply.\u003c/p\u003e\n\u003cp\u003eShe cocks an eyebrow and points to my bag. \"Open it,\" she orders.\u003c/p\u003e\n\u003cp\u003eI huff and kneel down to unzip it. I feel like a jail inmate. Pulling out my dress, I hold it up.\u003c/p\u003e\n\u003cp\u003e\"A dress?\" my mother asks.\u003c/p\u003e\n\u003cp\u003e\"I went to a wedding with Alex. His cousin got married.\"\u003c/p\u003e\n\u003cp\u003e\"That boy made you lie to me. He\u0027s manipulating you, Brittany.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-31.html","bookId":2767,"creation":"Oct 5, 2019 5:11:24 PM","modification":"Oct 5, 2019 5:11:24 PM"}
