{"id":86027,"no":33,"title":"Page 33","content":"\u003cp\u003e\"You regret it?\" I ask.\u003c/p\u003e\n\u003cp\u003e\"Being a mom? Never. Seducing your father and making sure he didn\u0027t use a condom, yes.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to hear this.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m gonna tell it to you whether you want to hear it or not. Be careful, Alex.\"\u003c/p\u003e\n\u003cp\u003e\"lam.\"\u003c/p\u003e\n\u003cp\u003eShe takes another drag of her cigarette while shaking her head. \"No, you don\u0027t get it. You might be careful, but girls won\u0027t be. Girls are manipulative. I should know, I\u0027m one of them.\"\u003c/p\u003e\n\u003cp\u003e\"Brittany is--\"\u003c/p\u003e\n\u003cp\u003e\"The kind of girl who can make you do things you don\u0027t want to do.\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, Mom. She doesn\u0027t want a kid.\"\u003c/p\u003e\n\u003cp\u003e\"No, but she\u0027ll want other things. Things you can never give her.\"\u003c/p\u003e\n\u003cp\u003eI look up at the stars, the moon, the universe that I know doesn\u0027t end. \"But what if I want to give them to her?\"\u003c/p\u003e\n\u003cp\u003eShe lets out a slow breath, the action causing cigarette smoke to fly out of her mouth in one long stream. \"At the age of thirty-five I\u0027m old enough to have seen people die thinking they can change the ways of the world. No matter what you think, your father died trying to fix his life.\u003c/p\u003e\n\u003cp\u003eYour facts are distorted, Alejandro. You were just a little boy, too young to understand.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m old enough now.\"\u003c/p\u003e\n\u003cp\u003eA tear escapes from her eye and she wipes it away. \"Yes, well, now it\u0027s too late.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 43 Brittany\u003c/p\u003e\n\u003cp\u003e\"Brit, please tell me again why we\u0027re picking up Alex Fuentes and taking him with us to Lake Geneva,\" Sierra says to me.\u003c/p\u003e\n\u003cp\u003e\"My mom threatened me if I saw him outside of school, so going to Lake Geneva is a perfect place to hang out with him. Nobody will know us there.\"\u003c/p\u003e\n\u003cp\u003e\"Except us.\"\u003c/p\u003e\n\u003cp\u003e\"And I know you guys won\u0027t rat on me. Right?\"\u003c/p\u003e\n\u003cp\u003eI catch Doug rolling his eyes. It seemed like a good idea at the time. Going to Lake Geneva for the day on a double date is sure to be fun. Well, once Sierra and Doug get over the initial shock of the two of us as a couple. \"Please don\u0027t give me more shit about this.\"\u003c/p\u003e\n\u003cp\u003e\"The guy\u0027s a loser, Brit,\" Doug says as he drives to the school parking lot where Alex should be waiting for us. \"She\u0027s your best friend, Sierra. Talk some sense into her.\"\u003c/p\u003e\n\u003cp\u003e\"I tried, but you know her. She\u0027s stubborn.\"\u003c/p\u003e\n\u003cp\u003eI sigh. \"Can you please stop talking about me like I\u0027m not even here? I like Alex. And he likes me. I want to give this thing a chance.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re going to do that how? By keeping him a secret forever?\" Sierra asks.\u003c/p\u003e\n\u003cp\u003eThank goodness we reach the parking lot so I don\u0027t have to respond. Alex is sitting on the curb beside his motorcycle, his long legs stretched in front of him. I chew my bottom lip anxiously as I open the door to the backseat.\u003c/p\u003e\n\u003cp\u003eWhen he sees Doug driving and Sierra next to him, a muscle in his jaw tenses.\u003c/p\u003e\n\u003cp\u003e\"Come on in, Alex,\" I say, and slide over.\u003c/p\u003e\n\u003cp\u003eHe leans into the car. \"I don\u0027t think this is a good idea.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be silly. Doug promised to be nice. Isn\u0027t that right, Doug?\" I hold my breath for the answer.\u003c/p\u003e\n\u003cp\u003eDoug gives an impersonal nod. \"Sure,\" he says, totally monotone.\u003c/p\u003e\n\u003cp\u003eAny other guy would leave, I\u0027m sure of it. But Alex slides in beside me. \"Where we goin\u0027?\" he asks.\u003c/p\u003e\n\u003cp\u003e\"Lake Geneva,\" I say. \"Ever been there before?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s about an hour away. Doug\u0027s parents have a cabin there.\"\u003c/p\u003e\n\u003cp\u003eAs we drive, you\u0027d think we were in a library instead of a car. Nobody says a word. When Doug stops for gas, Alex gets out, walks off, and lights a cigarette.\u003c/p\u003e\n\u003cp\u003eI sink lower in my seat. So far, this is not how I\u0027d envisioned the day turning out. Sierra and Doug are usually hilarious together, but this is about as much fun as a funeral.\u003c/p\u003e\n\u003cp\u003e\"Can you at least try and make conversation?\" I ask my best friend. \"I mean, you can spend hours talking about what kind of dog you\u0027d rather kiss but you can\u0027t even put two words together in front of a guy I like.\"\u003c/p\u003e\n\u003cp\u003eSierra turns around in her seat to face me. \"I\u0027m sorry. It\u0027s just that. . . Brit, you can do better. A LOT better.\"\u003c/p\u003e\n\u003cp\u003e\"Like Colin, you mean.\"\u003c/p\u003e\n\u003cp\u003e\"Like anyone.\" Sierra huffs and turns back around.\u003c/p\u003e\n\u003cp\u003eAlex gets into the car and I give him a weak smile. When he doesn\u0027t smile back, I take his hand in mine. He doesn\u0027t return the hold, but he doesn\u0027t pull away. Is that a good sign?\u003c/p\u003e\n\u003cp\u003eWhen we drive from the station, Alex says, \"You\u0027ve got a loose tire. Hear that noise comin\u0027 from the left rear?\"\u003c/p\u003e\n\u003cp\u003eDoug shrugs. \"It\u0027s been like that for a month. No biggie.\"\u003c/p\u003e\n\u003cp\u003e\"Pull over and I\u0027ll fix it,\" Alex says. \"If it falls off on the highway, we\u0027re toast.\"\u003c/p\u003e\n\u003cp\u003eI can tell Doug doesn\u0027t want to rely on Alex\u0027s assessment, but after about a mile he grudgingly stops on the side of the road.\u003c/p\u003e\n\u003cp\u003e\"Doug,\" Sierra says, pointing to the adult bookstore we\u0027re in front of. \"Do you know what kind of people go in there?\"\u003c/p\u003e\n\u003cp\u003e\"Right now, sweetheart, I really don\u0027t give a shit.\" He turns to Alex. \"Okay, big shot. Fix the car.\"\u003c/p\u003e\n\u003cp\u003eAlex and Doug step out. \"I\u0027m sorry I bitched at you,\" I say to Sierra.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, too.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think Doug and Alex will start fighting?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. We better get out there and distract them.\"\u003c/p\u003e\n\u003cp\u003eOutside, Alex takes tools out of the trunk.\u003c/p\u003e\n\u003cp\u003eAfter jacking up the car, Alex holds the tire iron in his hands. Doug has his hands on his hips and his jaw thrust forward in defiance.\u003c/p\u003e\n\u003cp\u003e\"Thompson, what\u0027s up your ass?\" Alex asks.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like you, Fuentes.\"\u003c/p\u003e\n\u003cp\u003e\"You think you\u0027re my favorite person?\" Alex snaps back as he kneels beside the tire and tightens the lug nuts.\u003c/p\u003e\n\u003cp\u003eI look over at Sierra. Should we intervene? Sierra shrugs. I shrug. It\u0027s not as if they\u0027ve come to blows . . . yet.\u003c/p\u003e\n\u003cp\u003eA car screeches beside us. Four Hispanic guys are inside, two in the front and two in back. Alex ignores them as he lowers the jack and returns it to the trunk.\u003c/p\u003e\n\u003cp\u003e\"Hey, mamacitas! How about you ditch those losers and come with us. We\u0027ll show you a real good time,\" one of them shouts through the window.\u003c/p\u003e\n\u003cp\u003e\"Fuck off,\" Doug shouts.\u003c/p\u003e\n\u003cp\u003eOne of the guys stumbles out of the car and advances on Doug. Sierra yells something but I\u0027m not paying attention. Instead, I\u0027m watching Alex tear off his jacket and block the guy\u0027s path.\u003c/p\u003e\n\u003cp\u003e\"Get out of my way,\" the guy orders. \"Don\u0027t lower yourself by protecting this white dick.\"\u003c/p\u003e\n\u003cp\u003eAlex stands toe to toe with the guy, the tire iron gripped tightly in his hand. \"You fuck with the white dick, you fuck with me. It\u0027s that simple. Comprendes, amigo?\"\u003c/p\u003e\n\u003cp\u003eAnother guy steps out of the car. We are in some serious trouble.\u003c/p\u003e\n\u003cp\u003e\"Girls, take the keys and get in the car,\" Alex orders, his tone precise.\u003c/p\u003e\n\u003cp\u003e\"But . . .\"\u003c/p\u003e\n\u003cp\u003eThere\u0027s a lethal calmness in his eyes. Oh, boy. He\u0027s dead serious.\u003c/p\u003e\n\u003cp\u003eDoug tosses Sierra his car keys. Now what? Are we supposed to sit in the car and watch them fight? \"I\u0027m not going anywhere,\" I tell him.\u003c/p\u003e\n\u003cp\u003e\"Me, either,\" Sierra says.\u003c/p\u003e\n\u003cp\u003eA guy in the other car sticks his head out of the window. \"Alejo, that you?\"\u003c/p\u003e\n\u003cp\u003eAlex\u0027s stance relaxes. \"Tiny? What the hell you doin\u0027 with these pendejos?\"\u003c/p\u003e\n\u003cp\u003eThe guy named Tiny says something in Spanish to his buddies and they jump back into the car. They almost seem relieved they won\u0027t have to fight Alex and Doug.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you as soon as you tell me what you\u0027re doin\u0027 with a bunch of gringos,\" Tiny says.\u003c/p\u003e\n\u003cp\u003eAlex chuckles. \"Get out of here.\"\u003c/p\u003e\n\u003cp\u003eWhen we\u0027re all back in the car, I hear Doug say, \"Thanks for having my back.\"\u003c/p\u003e\n\u003cp\u003eAlex mumbles, \"Don\u0027t sweat it.\"\u003c/p\u003e\n\u003cp\u003eNobody speaks again until we reach the outskirts of Lake Geneva. Doug parks in front of a sports bar for lunch. Inside, Sierra and I order chopped salads while Doug and Alex order burgers.\u003c/p\u003e\n\u003cp\u003eIn the booth while we\u0027re waiting for food, nobody is talking. I kick Sierra under the table.\u003c/p\u003e\n\u003cp\u003e\"So, urn, Alex,\" she starts. \"See any good movies lately?\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"Apply to any colleges?\"\u003c/p\u003e\n\u003cp\u003eAlex shakes his head.\u003c/p\u003e\n\u003cp\u003eSurprisingly, Doug sits up and takes over. \"Who taught you so much about cars?\"\u003c/p\u003e\n\u003cp\u003e\"My cousin,\" Alex says. \"On weekends I\u0027d hang at his house and watch him bring cars back from the dead.\"\u003c/p\u003e\n\u003cp\u003e\"My dad has a \u002772 Karmann Ghia sitting in our garage. He thinks it\u0027ll magically start running.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with it?\" Alex asks.\u003c/p\u003e\n\u003cp\u003eAs Doug explains, Alex listens intently. While they discuss the pros and cons of buying refurbished engine parts off of eBay, I sit back and relax. The tension from earlier seems to disintegrate the longer they talk.\u003c/p\u003e\n\u003cp\u003eAfter we finish eating, we walk down Main Street. Alex takes my hand in his, and I can\u0027t think of anything I\u0027d rather do than be here with him.\u003c/p\u003e\n\u003cp\u003e\"Ooh, there\u0027s that new gallery,\" Sierra says, pointing across the street. \"Look, they\u0027re having a grand opening. Let\u0027s go in!\"\u003c/p\u003e\n\u003cp\u003e\"Cool,\" I say.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll hang outside,\" Alex says as we follow Sierra and Doug across the street. \"I\u0027m not a gallery kind of guy.\"\u003c/p\u003e\n\u003cp\u003eThat\u0027s not true. When is he going to realize that he doesn\u0027t have to live up to the stereotype everyone else has placed on him? Once he goes inside, he\u0027ll realize he\u0027s as welcome in a gallery as he is in the auto body. \"Come on,\" I say, pulling him inside. I smile inwardly as we enter the gallery.\u003c/p\u003e\n\u003cp\u003eA huge spread of food is laid out. About forty people are milling about, observing the artwork.\u003c/p\u003e\n\u003cp\u003eI tour the gallery with Alex, who\u0027s walking stiffly at my side. \"Loosen up,\" I tell him.\u003c/p\u003e\n\u003cp\u003e\"Easy for you to say,\" he mumbles.\u003c/p\u003e\n\u003cp\u003eCHAPTER 44 Alex\u003c/p\u003e\n\u003cp\u003eBringing me into a gallery wasn\u0027t the best idea she\u0027s ever had. When Sierra pulled Brittany away from me to show her a painting, I\u0027ve never felt more out of place.\u003c/p\u003e\n\u003cp\u003eI wander around and scan the food table, thankful we already ate. You can\u0027t really call this stuff food, actually. Sushi, which I\u0027m tempted to nuke in order to make edible. Then there are sandwiches the size of a quarter.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re out of wasabi.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m still concentrating on identifying the assortment of food when someone taps me on the back.\u003c/p\u003e\n\u003cp\u003eI turn around to a short, blond white guy. He reminds me of Burro Face and I immediately want to push him away.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re out of wasabi,\" he says again.\u003c/p\u003e\n\u003cp\u003eIf I knew what the fuck wasabi was, I could respond. But I don\u0027t, so I don\u0027t. And it makes me feel stupid.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you speak English?\"\u003c/p\u003e\n\u003cp\u003eMy hand balls into a fist. Yes, I speak English, you dumbass. But the last time I was in English class the word \"wasabi\" wasn\u0027t on a fucking spelling test. Instead of responding, I ignore the guy and walk away to look at one of the paintings.\u003c/p\u003e\n\u003cp\u003eThe one I stop at shows a girl and a dog walking on what looks like a sloppy imitation of the Earth.\u003c/p\u003e\n\u003cp\u003e\"There you are,\" Brittany says, coming to my side. Doug and Sierra are right behind her.\u003c/p\u003e\n\u003cp\u003e\"Brit, this is Perry Landis,\" Doug says, pointing to the Colin look-alike. \"The artist.\"\u003c/p\u003e\n\u003cp\u003e\"Omigod, your work is amazing!\" Brittany says, gushing at him.\u003c/p\u003e\n\u003cp\u003eShe said \"omigod\" as if she really is an airhead. Is she kidding me?\u003c/p\u003e\n\u003cp\u003eThe guy looks over her shoulder at his painting. \"What do you think of this one?\" he asks her.\u003c/p\u003e\n\u003cp\u003eBrittany clears her throat. \"I think it shows great insight to the relationship between man, animal, and Earth.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-33.html","bookId":2767,"creation":"Oct 5, 2019 5:11:24 PM","modification":"Oct 5, 2019 5:11:24 PM"}
