{"id":86002,"no":8,"title":"Page 8","content":"\u003cp\u003e\"What\u0027cha talkin\u0027 about?\" Paco asks, joining us with a plate of food from the cafeteria.\u003c/p\u003e\n\u003cp\u003e\"I bet Alex my car for his motorcycle he can\u0027t get into Brittany Ellis\u0027s pants by Thanksgiving.\"\u003c/p\u003e\n\u003cp\u003e\"You loco, Alex?\" Paco says. \"Makin a bet like that is suicide.\"\u003c/p\u003e\n\u003cp\u003e\"Lay off, Paco,\" I warn. It isn\u0027t suicide. Stupid, maybe. But not suicide. If I could handle hot Carmen Sanchez, I can handle vanilla cookie Brittany Ellis.\u003c/p\u003e\n\u003cp\u003e\"Brittany Ellis is out of your league, amigo. You might be a pretty boy, but you\u0027re one hundred percent Mexicano and she\u0027s as white as Wonder Bread.\"\u003c/p\u003e\n\u003cp\u003eA junior named Leticia Gonzalez walks by us. \"Hi, Alex,\" she says, flashing me a smile before sitting with her friends. While the other guys drool over Leticia and talk to her friends, Paco and I are left alone by the tree.\u003c/p\u003e\n\u003cp\u003ePaco nudges me. \"Now she\u0027s a bonita Mexicana, and definitely in your league.\"\u003c/p\u003e\n\u003cp\u003eMy eye isn\u0027t on Leticia, it\u0027s on Brittany. Now that the game\u0027s on, I\u0027m focusing on the prize. It\u0027s time to start flirting, but no bullshit come-on lines will work with her. Somehow I think she\u0027s used to those from her boyfriend and other assholes trying to get into her pants.\u003c/p\u003e\n\u003cp\u003eI decide on a new tactic, one she won\u0027t expect. I\u0027m going to keep riffling her feathers until I\u0027m all she thinks about. And I\u0027ll start next period when she\u0027s forced to sit next to me. Nothing like a little foreplay in chemistry class to spark things up.\u003c/p\u003e\n\u003cp\u003e\"Carajo!\" Paco says, throwing down his lunch. \"They think they can buy a U-shaped shell, stuff it, and call it a taco, but those cafeteria workers wouldn\u0027t know taco meat from a piece of shit. That\u0027s what this tastes like, Alex.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re makin\u0027 me sick, man,\" I tell him.\u003c/p\u003e\n\u003cp\u003eI stare uncomfortably at the food I brought from home. Thanks to Paco everything looks like mierda now. Disgusted, I shove what\u0027s left of my lunch into my brown paper bag.\u003c/p\u003e\n\u003cp\u003e\"Want some of it?\" Paco says with a grin as he holds out the shitty taco to me.\u003c/p\u003e\n\u003cp\u003e\"Bring that one inch closer to me and you\u0027ll be sorry,\" I threaten.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m shakin\u0027 in my pants.\"\u003c/p\u003e\n\u003cp\u003ePaco wiggles the offending taco, goading me. He should seriously know better.\u003c/p\u003e\n\u003cp\u003e\"If any of that gets on me--\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027cha gonna do, kick my ass?\" Paco sings sarcastically, still shaking the taco. Maybe I should punch him in the face, knocking him out so I won\u0027t have to deal with him right now.\u003c/p\u003e\n\u003cp\u003eAs I have that thought, I feel something drop on my pants. I look down even though I know what I\u0027ll see. Yes, a big blob of wet, gloppy stuff passing as taco meat lands right on the crotch of my faded jeans.\u003c/p\u003e\n\u003cp\u003e\"Fuck,\" Paco says, his face quickly turning from amusement to shock. \"Want me to clean it off for you?\"\u003c/p\u003e\n\u003cp\u003e\"If your fingers get anywhere close to my dick, I\u0027m gonna personally shoot you in the huevos,\" I growl through clenched teeth.\u003c/p\u003e\n\u003cp\u003eI flick the mystery meat off my crotch. A big, greasy stain lingers. I turn back to Paco. \"You got ten minutes to get me a new pair of pants.\"\u003c/p\u003e\n\u003cp\u003e\"How the hell am I s\u0027posed to do that?\"\u003c/p\u003e\n\u003cp\u003e\"Be creative.\"\u003c/p\u003e\n\u003cp\u003e\"Take mine.\" Paco stands and brings his fingers to the waistband of his jeans, unbuttoning right in the middle of the courtyard.\u003c/p\u003e\n\u003cp\u003e\"Maybe I wasn\u0027t specific enough,\" I tell him, wondering how I\u0027m going to act like the cool guy in chem class when it looks like I\u0027ve peed in my pants. \"I meant, get me a new pair of pants that will fit me, pendejo. You\u0027re so short you could audition to be one of Santa Claus\u0027s elves.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m toleratin\u0027 your insults because we\u0027re like brothers.\"\u003c/p\u003e\n\u003cp\u003e\"Nine minutes and thirty seconds.\"\u003c/p\u003e\n\u003cp\u003eIt doesn\u0027t take Paco more than that to start running toward the school parking lot.\u003c/p\u003e\n\u003cp\u003eI seriously don\u0027t give a crap how I get the pants; just that I get \u0027em before my next class. A wet crotch is not the way to show Brittany I\u0027m a stud.\u003c/p\u003e\n\u003cp\u003eI wait at the tree while other kids throw away their lunches and head back inside. Before I know it, music starts playing through the loudspeakers and Paco is nowhere in sight. Great. Now I have five minutes to get to Peterson\u0027s class. Gritting my teeth, I walk to chemistry with my books strategically placed in front of my crotch, with two minutes to spare. I slide onto the stool and push it as close to the lab table as possible, hiding the stain.\u003c/p\u003e\n\u003cp\u003eBrittany walks into the room, her sunshine hair falling down the front of her chest, ending in perfect little curls that bounce when she walks. Instead of that perfection turning me on, it makes me want to mess it all up.\u003c/p\u003e\n\u003cp\u003eI wink at her when she glances at me. She huffs and pulls her stool as far away from me as possible.\u003c/p\u003e\n\u003cp\u003eRemembering Mrs. Peterson\u0027s zero-tolerance rule, I pull my bandanna off and place it in my lap directly over the stain. Then I turn to the pom-pom chick sitting next to me. \"You\u0027re gonna have to talk to me at some point.\"\u003c/p\u003e\n\u003cp\u003e\"So your girlfriend can have a reason to beat me up? No thanks, Alex. I\u0027d rather keep my face the way it is.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have a girlfriend. You want to interview for the position?\" I scan her from top to bottom, focusing on the parts she relies on so heavily.\u003c/p\u003e\n\u003cp\u003eShe curls her pink-frosted top lip and sneers at me. \"Not on your life.\"\u003c/p\u003e\n\u003cp\u003e\"Mujer, you wouldn\u0027t know what to do with all this testosterone if you had it in your hands.\"\u003c/p\u003e\n\u003cp\u003eThat\u0027s it, Alex. Tease her into wanting you. She\u0027ll take the bait.\u003c/p\u003e\n\u003cp\u003eShe turns away from me. \"You\u0027re disgusting.\"\u003c/p\u003e\n\u003cp\u003e\"What if I said we\u0027d make a great couple?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d say you were an idiot.\"\u003c/p\u003e\n\u003cp\u003eCHAPTER 9 Brittany\u003c/p\u003e\n\u003cp\u003eRight after I call Alex an idiot, Mrs. Peterson calls the class to attention. \"You and your partner will pick a project from this hat,\" she announces. \"They are all equally challenging and will require meeting with your partner outside of class.\"\u003c/p\u003e\n\u003cp\u003e\"What about football?\" Colin interjects. \"No way I\u0027m missing practice.\"\u003c/p\u003e\n\u003cp\u003e\"Or poms,\" Darlene chimes in before I can say the same thing.\u003c/p\u003e\n\u003cp\u003e\"Schoolwork comes first. It\u0027s up to you and your partner to find a time that works for both of you,\" Mrs. Peterson says as she stands in front of our table and holds out the hat.\u003c/p\u003e\n\u003cp\u003e\"Yo, Mrs. P. ... is one of them a cure for multiple sclerosis?\" Alex asks with his cocky attitude that\u0027s setting my nerves on edge. \" \u0027Cause I don\u0027t think there\u0027s enough time in the school year to complete that project.\"\u003c/p\u003e\n\u003cp\u003eI can see that big D on my report card right now. The Northwestern admissions counselor won\u0027t care that it was my chemistry partner who wanted to make a joke out of our project. The guy doesn\u0027t care about his own life, why should he care about chemistry class? The thought of Alex controlling the grade I receive in this class is overwhelming me. Grades to my parents are a reflection of your worth. Needless to say, a C or D means you\u0027re worthless.\u003c/p\u003e\n\u003cp\u003eI reach into the hat and pull out a little white slip of paper. I open it slowly while I bite my lower lip in anticipation. In bold letters I read HAND WARMERS.\u003c/p\u003e\n\u003cp\u003e\"Hand warmers?\" I question.\u003c/p\u003e\n\u003cp\u003eAlex leans over and reads the paper with a confused look on his face. \"What the fuck are hand warmers?\"\u003c/p\u003e\n\u003cp\u003eMrs. Peterson shoots Alex a warning glare. \"If you\u0027d like to stay after school, I have another blue detention slip on my desk with your name already on it. Now, either ask the question again without using foul language or join me after school.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027d be cool to hang with you, Mrs. P., but I\u0027d rather spend the time studyin\u0027 with my chem partner,\" Alex responds, then has the nerve to wink at Colin, \"so I\u0027ll rephrase the question. What exactly are hand warmers?\"\u003c/p\u003e\n\u003cp\u003e\"Thermal chemistry, Mr. Fuentes. We use them to warm our hands.\"\u003c/p\u003e\n\u003cp\u003eAlex has this big, cocky grin as he turns to me. \"I\u0027m sure we can find other things to warm.\"\u003c/p\u003e\n\u003cp\u003e\"I hate you,\" I say loud enough for Colin and the rest of the class to hear. If I sit here and let him get the best of me, I\u0027ll probably hear my mom tsk\u0027ing in my head about reputations meaning everything.\u003c/p\u003e\n\u003cp\u003eI know the class is watching our interaction, even Isabel, who thinks Alex isn\u0027t as bad as everyone thinks he is. Can\u0027t she see him for what he is, or is she blinded by his chiseled face and popular status among their friends?\u003c/p\u003e\n\u003cp\u003eAlex whispers, \"There\u0027s a thin line between love and hate. Maybe you\u0027re confusing your emotions.\"\u003c/p\u003e\n\u003cp\u003eI scoot away from him. \"I wouldn\u0027t bet on it.\"\u003c/p\u003e\n\u003cp\u003e\"I would.\"\u003c/p\u003e\n\u003cp\u003eAlex\u0027s gaze turns toward the door to the classroom. Through the window, his friend is waving to him. They\u0027re probably going to ditch class.\u003c/p\u003e\n\u003cp\u003eAlex grabs his books and stands.\u003c/p\u003e\n\u003cp\u003eMrs. Peterson turns around. \"Alex, sit down.\"\u003c/p\u003e\n\u003cp\u003e\"I got to piss.\"\u003c/p\u003e\n\u003cp\u003eThe teacher\u0027s eyebrows furrow and her hand goes to her hip. \"Watch your language. And the last time I checked, you don\u0027t need your books in order to go to the restroom. Put them back on the lab table.\"\u003c/p\u003e\n\u003cp\u003eAlex\u0027s lips are tight, but he places the books back on the table.\u003c/p\u003e\n\u003cp\u003e\"I told you no gang-related items in my class,\" Mrs. Peterson says, staring at the bandanna he\u0027s holding in front of him. She holds out her hand. \"Hand it over.\"\u003c/p\u003e\n\u003cp\u003eHe glances at the door, then faces Mrs. Peterson. \"What if I refuse?\"\u003c/p\u003e\n\u003cp\u003e\"Alex, don\u0027t test me. Zero tolerance. You want a suspension?\" She wiggles her fingers, signaling to hand the bandanna over immediately or else.\u003c/p\u003e\n\u003cp\u003eScowling, he slowly places the bandanna in her hand.\u003c/p\u003e\n\u003cp\u003eMrs. Peterson sucks in her breath when she snatches the bandanna from his fingers.\u003c/p\u003e\n\u003cp\u003eI screech, \"Ohmygod!\" at the sight of the big stain on his crotch.\u003c/p\u003e\n\u003cp\u003eThe students, one by one, start laughing.\u003c/p\u003e\n\u003cp\u003eColin laughs the loudest. \"Don\u0027t sweat it, Fuentes. My great-grandma has the same problem. Nothing a diaper won\u0027t fix.\"\u003c/p\u003e\n\u003cp\u003eNow that hits home because at the mention of adult diapers, I immediately think of my sister. Making fun of adults who can\u0027t help themselves isn\u0027t funny because Shelley is one of those people.\u003c/p\u003e\n\u003cp\u003eAlex sports a big, cocky grin and says to Colin, \"Your girlfriend couldn\u0027t keep her hands out of my pants. She was showin\u0027 me a whole new definition of hand warmers, compa.\"\u003c/p\u003e\n\u003cp\u003eThis time he\u0027s gone too far. I stand up, my stool scraping the floor.\u003c/p\u003e\n\u003cp\u003e\"You wish,\" I say.\u003c/p\u003e\n\u003cp\u003eAlex is about to say something to me when Mrs. Peterson yells, \"Alex!\" She clears her throat. \"Go to the nurse and ... fix yourself. Take your books, because afterward you\u0027ll be seeing Dr. Aguirre. I\u0027ll meet you in his office with your friends Colin and Brittany.\"\u003c/p\u003e\n\u003cp\u003eAlex swipes his books off the table and exits the classroom while I ease back onto my stool. While Mrs. Peterson is trying to calm the rest of the class, I think about my short-lived success in avoiding Carmen Sanchez.\u003c/p\u003e\n\u003cp\u003eIf she thinks I\u0027m a threat to her relationship with Alex, the rumors that are sure to spread today could prove deadly.\u003c/p\u003e\n\u003cp\u003eCHAPTER 10 Alex\u003c/p\u003e\n\u003cp\u003eOh, this is rich. Peterson and Aguirre on one side of Aguirre\u0027s office, Little Miss Perfecta and her dickhead boyfriend on the other ... and me standing by myself. Nobody on my side, that\u0027s for sure.\u003c/p\u003e\n\u003cp\u003eAguirre clears his throat. \"Alex, this is the second time in two weeks you\u0027re in my office.\"\u003c/p\u003e\n\u003cp\u003eYep, that about sums it up. The guy is an absolute genius.\u003c/p\u003e\n\u003cp\u003e\"Sir,\" I say, playing the game because I\u0027m sick of Little Miss Perfecta and her boyfriend controlling the entire fucking school. \"There was a little mishap during lunch involving grease and my pants. Instead of missin\u0027 class, I had a friend get me these as a replacement.\" I gesture to my current jeans Paco managed to snatch from my house. \"Mrs. Peterson,\" I say, turning to my chem teacher, \"I wouldn\u0027t let a little stain keep me from your brilliant lecture.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-chemistry-perfect-chemistry-1/page-8.html","bookId":2767,"creation":"Oct 5, 2019 5:11:24 PM","modification":"Oct 5, 2019 5:11:24 PM"}
