{"id":15545,"no":19,"title":"CHAPTER XVIII. — THE FALL RIVER BOAT.","content":"\u0026nbsp;When Sam left Henry, somehow he felt in lower spirits than before. He had become attached to his roommate in spite of the difference in character between them, and Henry\u0027s reproaches seemed to throw a new light upon his conduct. He felt it the more because he was about to leave him. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did treat him mean,\" he admitted to himself, his conscience touched, for the first time, perhaps, in years. \"I\u0027m glad they wouldn\u0027t let me have any of his money at the bank. I won\u0027t act so mean again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is not to be supposed that this repentant mood lasted long. As Sam neared the wharf from which the Fall River line of steamers left for Boston, his thoughts were on the journey he was about to take, and his spirits rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The steamer was moored alongside the wharf, perhaps halfway down. There was a confused mass of trunks, bales and baggage of various kinds on the pier waiting to be stowed away on board. It was early, but a few passengers were already on board, and others were passing over the gang plank at intervals. Sam thought he would go on board, too, and look about a little. He had never been on board one of these steamers, and was curious to see the accommodations. He went upstairs, and found himself in a long and elegantly furnished saloon, with lines of staterooms on either side. Three passengers were seated on sofas or in armchairs. Two were engaged in reading an afternoon paper, and the third, a girl of about fifteen, had her attention absorbed by a bird cage containing a canary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked up as Sam passed, and asked pleasantly: \"Is it almost time for the boat to start, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the first time Sam had been addressed as \"sir,\" and he felt flattered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess not,\" he said. \"There\u0027s only a few people on board. I don\u0027t think it\u0027ll start for an hour.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish it would go soon,\" said the girl. \"I am in a hurry to get home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you live in Boston?\" asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I\u0027ve been to visit my uncle in Brooklyn, and now I\u0027m going back. Are you going to Boston, too?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you live there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I never was there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you\u0027ve got relations there?\" said the young lady, in an inquiring tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I\u0027m going on to see if I can\u0027t get a place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl surveyed him with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you have to earn your own living?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are young to do that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I\u0027ve had to earn my living ever since I was eleven or twelve.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t mean it. Why, what did you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was clerk in a store on Pearl Street,\" said Sam, who did not care to mention his previous experience as a bootblack and newsboy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I hope you\u0027ll get a good place. I\u0027ve got a brother almost as old as you, but he\u0027d never think he could earn his own living; his name is Frank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s his last name?\" asked Sam, bluntly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stockton—I am Julia Stockton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name is Sam Barker,\" said Sam, thinking such confidence ought to be requited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve got a cousin Sam,\" Julia remarked, \"but I never knew any one of the name of Barker before.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that your bird?\" inquired Sam, by way of prolonging the conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he sings sweetly, sometimes, but I guess he\u0027s frightened now. I\u0027m glad he\u0027s with me, it isn\u0027t quite so lonely. I never traveled alone before. Are you used to traveling alone, Mr. Barker?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never traveled much,\" answered Sam, trying to look dignified, on first being addressed as Mr. Barker; \"but I don\u0027t mind being alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s because you\u0027re a boy. Boys can take care of themselves better than girls. Do you know what time we get to Boston?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t; but I\u0027ll inquire,\" said Sam. \"Shall I find you here?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, I\u0027ll be here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam went down below, and noticed that some were already procuring tickets at the captain\u0027s office. It struck him that he might as well obtain his. Accordingly he joined the line, and when his turn came inquired for a ticket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fall River or Boston?\" asked the man in charge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Boston.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s pretty steep,\" thought Sam. \"I shall have only twenty dollars left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A ticket was handed him, with 159 on it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that for?\" asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s the number of your berth.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When will we get to Boston?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Between six and seven in the morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Sam turned away he was accosted by a newsboy: \"Papers, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An idea struck Sam. He would get a picture paper for his new acquaintance. It was probably the first mark of attention he had ever paid to a girl, but the idea pleased him, and he bought a Harper\u0027s Weekly, and carried it upstairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He found Miss Julia Stockton sitting where he had left her. She smiled pleasantly when she saw Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I bought you a picture paper,\" he said, feeling a little awkward. \"I thought you might like to read it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, thank you. You are very kind. Did you find out when we would reach Boston?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Miss Julia. We shall get there between six and seven in the morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s pretty early. I hope papa will be at the depot waiting.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At the depot? Does the boat go into a depot?\" asked Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Julia laughed. \"Oh, no,\" she said. \"Did you think we went all the way by boat?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I thought so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We go the last fifty miles by cars—that is, from Fall River.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All the better,\" said Sam. \"That will give us a little variety.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, the passengers were pouring in, and the cabin was getting full.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess I\u0027ll go out on deck,\" said Sam; \"I want to see the boat start.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like to, ever so much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come with me, then. I\u0027ll take care of you,\" said Sam, manfully. \"Let me carry your cage. It\u0027s too heavy for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the two went out on deck together.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3002/82846.html","bookId":299,"creation":"Aug 2, 2019 7:03:43 AM","modification":"Aug 2, 2019 7:03:43 AM"}
