{"id":15551,"no":25,"title":"CHAPTER XXIV. — AN UNPLEASANT SURPRISE.","content":"\u0026nbsp;After dinner Sam and his roommate took a walk. As they passed the Boston theater, Abner proposed going in; but Sam knew very well that the expense of both tickets would come upon him, and declined. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am tired,\" he said; \"I\u0027ve been walking about all day, and, besides, I got up very early in the morning. I would rather go home and go to bed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Lend me a dollar, and I\u0027ll go,\" said Abner. \"I don\u0027t feel sleepy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not much,\" answered Sam. \"When you\u0027ve got your money, it will be time enough to go to the theater; but if you haven\u0027t got any more than I have, you\u0027d better not go to the theater much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The reader may be surprised at such sensible advice proceeding from Sam; but he had begun to feel the responsibilities of life more keenly than ever before. For the first time, too, he saw how foolish he had been in the past, and felt an eager desire to win a respectable position. He was sanguine and hopeful, and felt that it was not too late to turn over a new leaf.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" said Abner. \"I can wait till another evening, but I thought I\u0027d like to go to the theater, seein\u0027 as I never went there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Never went to the theater!\" exclaimed Sam, with a gratifying sense of superiority. \"I\u0027ve been ever so many times in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been to the circus,\" said Abner. \"There was one come round last summer to our place. Is the theater any like the circus?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Sam; \"but the circus is pretty good. I like to see it myself. You miss a good many things by living in the country.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you ever live in the country?\" inquired Abner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A good many years ago,\" answered Sam. \"The fact is, I was born there, but I got tired of it and went to New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently fatigue overpowered Sam, and he announced his intention of returning to the boarding-house, and going to bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t go yet,\" said Abner. \"I\u0027ll be along pretty soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam did not lie awake long after once getting into bed. The early hour at which he had risen on the boat, and the miles he had traveled during the day were too much for him, and he sank into a dreamless sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At eleven o\u0027clock Abner Blodgett opened the door and softly entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He approached the bed on tiptoe, fearing to wake Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Poor fool!\" he muttered, smiling disagreeably; \"he thinks I am a verdant rustic, while I am able to turn him round my little finger. There\u0027s nothing about city life that I don\u0027t know. I can give him points and discount him as far as that goes, even if he has been living in New York for years. Fast asleep!\" he continued, listening to Sam\u0027s regular breathing. \"No danger of his waking up till morning. I may as well see what money he\u0027s got.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He coolly felt in Sam\u0027s pocket, and drew out his pocket-book, eagerly examining the contents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only ten dollars and a half!\" he muttered, in disappointment. \"That hardly pays me for my trouble. However, it\u0027s better than nothing. Let me see if there is anything more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But this appeared to be all the money Sam possessed, and he put it in his pocket, grumbling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess it\u0027ll be safe for me to go to bed, and sleep till near morning,\" Abner said to himself. \"The boy sleeps soundly, and he won\u0027t be awake till six or seven.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He proved to be correct. Sam slept like a log, and was not conscious when, at a quarter of six, Abner hurriedly dressed, and left the house with all of poor Sam\u0027s available funds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a pity he payed for his board in advance,\" thought Abner. \"I would have got seven dollars more. It\u0027s money thrown away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner hoped to get out of the house without being seen by any one, but he was destined to be disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he was slipping out of the front door the landlady herself came downstairs.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are going out early, Mr. Blodgett,\" she remarked, in some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, ma\u0027am,\" said Abner. \"I\u0027m used to gettin\u0027 up early in the country. I\u0027m goin\u0027 to take a walk before breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your young friend thought he wouldn\u0027t go out with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He got pretty tired yesterday. He\u0027s sound asleep.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s something about that man I don\u0027t like,\" thought Mrs. Campbell. \"I don\u0027t believe he\u0027s so verdant as he pretends to be. He must pay me something on account to-day, or I won\u0027t keep him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-by old woman!\" muttered Abner, as he closed the door, and entered the street. \"I don\u0027t care about seeing you or your house again. I shall get my breakfast somewhere else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Blodgett walked rapidly till he reached a shabby-looking brick tenement house not far from Dover Street. This he entered with a pass-key, and going up to a room which he generally occupied, proceeded to change his clothes for others more comfortable to city style. This alone changed his appearance greatly; but not satisfied with this, he took from a bureau drawer a black silky mustache and carefully attached it to his upper lip. Then he looked complacency in the glass, and said, with a smile: \"I think my young friend from New York won\u0027t recognize me now. If we meet, and he suspects anything, I can easily put him off the scent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam woke up about seven o\u0027clock. He opened his eyes, and looked about him in momentary bewilderment, not immediately remembering where he was. As recollection dawned upon him, he looked for Abner Blodgett, but nothing was to be seen of him. The appearance of the bed, however, showed that he had occupied it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He has got up,\" thought Sam. \"I wonder if it is very late.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A church clock began to strike, and he counted the strokes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Seven o\u0027clock!\" he said. \"Well, that isn\u0027t very late, but I may as well get up. I\u0027ve slept like a top all night long. I suppose I was sound asleep when my roommate came to bed. I guess he\u0027s gone to take a walk before breakfast.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam jumped out of bed and began to dress. As he was drawing on his pants, he thrust his hand mechanically into his pocket to feel for his money. He did so without the faintest suspicion of his loss. When he discovered that his pocket-book was not in its usual place he grew anxious and hurriedly examined his other pockets.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But in vain!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he looked on the floor. Possibly it might have slipped out of his pocket and be lying on the carpet. Again his search was vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, for the first time, suspicion of his roommate entered his mind. Sam was no stranger to the tricks and wiles of a large city, and he saw clearly now how he had been cheated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s that skunk Abner Blodgett!\" he exclaimed, indignantly. \"He\u0027s regularly done me! I\u0027ll bet he\u0027s no more a countryman than I am. I just wish I had him here. I\u0027d pound him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam was indignant, but not discouraged. He did not give up his money for lost yet. He determined to seek Abner everywhere, and unmask him when found. If he did not recover his money it would not be for want of trying.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he finished dressing the breakfast-bell rang and he went down to the dining-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he had lost his money he had not lost his appetite.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he entered the dining-room he found himself first in the field.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-morning, Mr. Barker,\" said the landlady. \"You are early, but not so early as Mr. Blodgett. He left the house a little before six.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you see him?\" asked Sam, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and spoke with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did he say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said he was used to getting up early in the country, and was going out for a walk. Hasn\u0027t he returned?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Sam, \"and I don\u0027t believe he will.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What makes you say that?\" asked the landlady, noticing a significance in his tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean that he\u0027s gone off with all my money,\" said Sam, bluntly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say so!\" ejaculated the landlady. \"Why, I thought he was more likely to be taken in himself. Wasn\u0027t he from the country?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s what he said; but I don\u0027t believe it. I think he was in disguise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought he was an old friend of yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never saw him before yesterday. He came up to me in the Parker House yesterday morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What wickedness there is in the world, I do declare! Did he take all your money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Every cent,\" said Sam. \"I\u0027m glad I paid you a week in advance, or I should be badly off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t have turned you out, Mr. Barker,\" said the landlady, kindly. \"I have a hard time to get along myself, and it makes me sympathize with them that has had ill luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Good Mrs. Campbell was not quite grammatical, but she was kind-hearted, and that is better.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" said Sam; \"but all the same I\u0027m glad you\u0027ve got the seven dollars instead of Blodgett. I\u0027m going to try to find him, and if I do I\u0027ll have the money back, unless he has spent it all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be careful, Mr. Barker. He\u0027s stronger than you are, and he might do you some harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll risk it,\" said Sam, who, with all his defects, was not wanting in courage. \"I want nothing better than to come across him.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3002/82852.html","bookId":299,"creation":"Aug 2, 2019 7:03:56 AM","modification":"Aug 2, 2019 7:03:56 AM"}
