{"id":15532,"no":6,"title":"CHAPTER V. — SAM\u0027S FINANCES.","content":"\u0026nbsp;Sam did not find it quite so pleasant being in a place as he had anticipated. He had been accustomed to roam about the streets subject only to his own control. Now he was no longer his own master. He must go and come at the will of his employer. To be sure, his earnings were greater than in his street life, and he had a regular home. He knew beforehand where he was going to sleep, and was tolerably sure of a meal. But before the end of the first week he got out of money. This was not strange, for he had begun without any reserve fund. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the third day he applied to Henry Martin for a loan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you don\u0027t lend me some stamps, I\u0027ll have to go without breakfast,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When shall you get your first week\u0027s pay?\" asked Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Saturday night, the boss said, though I didn\u0027t go to work till Wednesday.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you need money for your meals today and to-morrow?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll lend you a dollar if you\u0027ll be sure to pay me up to-morrow night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do it, sure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There it is, then. Now, Sam, I want to give you a little advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-morrow, after paying me and putting by enough to pay the rent of the room, you\u0027ll have two dollars and seventy-five cents left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I shall,\" said Sam, with satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mustn\u0027t forget that this has got to last you for meals for the next week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much is it a day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About forty cents.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess I can make it do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall get along for two fifty, and you ought to find what you will have left enough.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve had to live on ten cents a day more\u0027n once,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s too little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should think it was. I went to bed hungry, you bet!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, there\u0027s no need of being so economical as that. You\u0027ve got to eat enough, or you won\u0027t be fit for work. You\u0027ll have to be careful, though, if you want to come out even.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I can manage it,\" said Sam, confidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Sam was mistaken. He proved himself far from a good calculator. On Sunday he gratified an unusually healthy appetite, besides buying two five-cent cigars. This made necessary an outlay of seventy-five cents. The next day also he overran his allowance. The consequence was that on Wednesday night he went to bed without a cent. He did not say anything about the state of his finances to Henry, however, till the next morning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Henry,\" he said, \"I guess I\u0027ll have to borrer a little more money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What for?\" asked his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I haven\u0027t got anything to buy my breakfast with.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How does that happen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" said Sam. \"I must have lost some out of my pocket.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think you have. You have been extravagant, that\u0027s what\u0027s the matter. How much did you spend on Sunday?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do, for I kept account. You spent seventy-five cents. That\u0027s twice as much as you could afford.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was only for one day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At any rate, you have used up in four days as much as ought to have lasted you the whole week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t get enough pay,\" grumbled Sam, who was unprepared with any other excuse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are plenty of boys that have to live on as small pay. I am one of them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you lend me some money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you what I will do. I\u0027ll lend you twenty-five cents every morning, and you\u0027ll have to make it do all day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t live on that. You spend more yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know I do; but if you spend twice as much as you ought one day, you\u0027ve got to make it up another.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give me the money for three days all at once,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d spend it all in one day, and want to borrow some more to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I wouldn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, you don\u0027t need it all the first day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re mean,\" grumbled Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I\u0027m not. I\u0027m acting like a friend. It\u0027s for your own good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What can I get for twenty-five cents?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s your lookout. You wouldn\u0027t have had to live on it, if you hadn\u0027t been too free other days.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In spite of Sam\u0027s protestations, Henry remained firm, and Sam was compelled to restrain his appetite for the remainder of the week. I am ashamed to say that, when Saturday night came, Sam tried to evade paying his just debt. But this his roommate would not permit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That won\u0027t do, Sam,\" he said. \"You must pay me what you owe me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You needn\u0027t be in such an awful hurry,\" muttered Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s better for both of us that you pay it now,\" said Henry. \"If you didn\u0027t, you\u0027d spend it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll pay you next week. I want to go to hear the minstrels to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can\u0027t go on borrowed money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I pay you up, I don\u0027t have enough to last me till next pay day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s your lookout. Do you know what I would do if I was in your place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What would you do?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d live on four dollars a week till I\u0027d got five dollars laid aside.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d like the five dollars, but I don\u0027t want to starve myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be rather inconvenient living on four dollars, I admit, but you would feel paid for it afterward. Besides, Sam, you need some shirts and stockings. I can\u0027t keep lending you mine, as I have been doing ever since you came here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t afford to buy any.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll tell you what I\u0027ll do. I\u0027ll buy some for you, if you\u0027ll agree to pay me up at the rate of fifty cents a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Sam, who was very ready to make promises. \"Give me the money, and I\u0027ll buy some to-night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027d rather go with you, and see that you get them,\" said Henry, quietly. \"You might forget what you were after, and spend the money for something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Perhaps Sam recognized the justice of his companion\u0027s caution. At any rate, he interposed no objection.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I hope my young readers, who are used to quite a different style of living, will not be shocked on being told that Sam purchased second-hand articles at a place recommended by his roommate. Considering the small sum at his command, he had no choice in the matter. Boys who have to pay their entire expenses out of five dollars a week cannot patronize fashionable tailors or shirt makers. So for three dollars Sam got a sufficient supply to get along with, though hardly enough to make a display at a fashionable watering place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam put the bundle, containing this important addition to his wardrobe under his arm, not without a feeling of complacency.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" said Henry, \"it will take you six weeks to pay me for these, at half a dollar a week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right!\" said Sam, carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not one to be disturbed about a debt and his companion was shrewd enough to see that he must follow Sam up, if he wanted to get his money paid at the periods agreed upon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Henry Martin continued to devote a part of every evening to study. He tried to prevail upon Sam to do the same, but without success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I get too tired to study,\" said Sam, and while his roommate was at home he was in the habit of strolling about the streets in search of amusement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the next Tuesday evening he met a boy of his acquaintance, who inquired where he was going.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nowhere in particular,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come into French\u0027s Hotel, and see them play billiards.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam complied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was one vacant table, and presently the other proposed a game.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t afford it,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it won\u0027t be much. If you beat me I\u0027ll have to pay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam yielded, and they commenced playing, Both being novices, the game occupied an hour, and Sam, who was beaten, found to his dismay that he had to pay sixty cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It don\u0027t seem more\u0027n fifteen minutes,\" he said to himself. \"It\u0027s awful dear.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So it is,\" said his companion; \"but if you had beaten me you would have got off for nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see how I\u0027m goin\u0027 to live on five dollars a week,\" thought Sam, uncomfortably, \"I wonder when they\u0027ll raise me.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3002/82833.html","bookId":299,"creation":"Aug 2, 2019 7:03:09 AM","modification":"Aug 2, 2019 7:03:09 AM"}
