{"id":21352,"no":101,"title":"Chapter 8","content":"\u003cbr\u003e It was not from Pete that Reuben first heard of his daughter\u0027s goings-on. Caro\u0027s benevolent trust in humanity had been misplaced, and at the Seven Bells where he called for a refresher on arriving at Rye station, various stragglers from Boarzell eagerly betrayed her, \"just to see how he wud t?ake it.\"\n\u003cbr\u003e \n\u003cbr\u003e Reuben received the news with the indifference due to outsiders. But he was not so calm when Pete told his tale at Odiam.\n\u003cbr\u003e \n\u003cbr\u003e \"The bitch,\" he growled, \"I\u0027ll learn her. Dancing wud a sailor, you say she wur, Pete?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Pete, \"and wud her hair all tumbling.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll learn her,\" repeated Reuben. But he never had the chance. By the time the two males had sat up till about three or four the next morning, they came to the conclusion that Caro must have seen Pete watching her and run away.\n\u003cbr\u003e \n\u003cbr\u003e \"She\u0027ll never come back,\" said Pete that evening—\"you t?ake my word fur it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s another of my daughters gone fur a whore.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Who wur the fust?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why Tilly—goes off wud that lousy pig-keeper up at Grandturzel. She\u0027s no better than Caro.\"\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \"And there wur Rose,\" added Pete, anxious to supply instances.\n\u003cbr\u003e \n\u003cbr\u003e Reuben swore at him.\n\u003cbr\u003e \n\u003cbr\u003e He felt Caro\u0027s disappearance more acutely than he would allow to show. First, she had left him badly in the lurch in household matters—he had to engage a woman to take her place, and pay her wages. Also she had caused a scandal in the neighbourhood, which meant more derisive fingers pointed at Odiam. Pete was now the only one left of his original family—his children and their runnings-away had become a byword in Peasmarsh.\n\u003cbr\u003e \n\u003cbr\u003e In the course of time he heard that Caro was living with Joe Dansay down at the Camber, but he made no effort to bring her back. \"I\u0027m shut of her,\" he told everyone angrily. If Caro preferred a common sailor and loose living to the dignity and usefulness of her position at Odiam, he was not going to interfere. Besides, she had disgraced his farm, and he would never forgive that.\n\u003cbr\u003e \n\u003cbr\u003e It struck him that his relations with women had been singularly unfortunate. Caro, Tilly, Rose, Alice, had all been failures—indeed he had come to look back on Naomi as his only success. Women were all the same, without ambition, without self-respect, ready to lick the boots of the first person who stroked them and was silly enough not to see through their wiles.\n\u003cbr\u003e \n\u003cbr\u003e During those days he spent most of his time digging on Boarzell. It relieved him to thrust viciously into the red dripping clay, turn in on his spade, and fling it back over his shoulder. It was strange that so few men realised that work was better than women—stranger still that they did not realise how much better than a woman\u0027s beauty was the beauty of the earth. Toiling there on the Moor, Reuben\u0027s heart gave itself more utterly to its allegiance. The curves of Boarzell against the sky, its tuft of firs, its hummocked slopes, its wet life-smelling[Pg 357] earth, even its savagery of heather, gorse, and thorn brought healing to his heart, and strength. Caro and other women could do what they chose, love, hate, follow, cheat, and betray whom they chose, as long as they left him the red earth and the labour of his hands.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2094/59473.html","bookId":524,"creation":"Aug 2, 2019 1:00:29 PM","modification":"Aug 2, 2019 1:00:29 PM"}
