{"id":21368,"no":117,"title":"Chapter 9","content":"Four years later Reuben bought the farmstead of Totease. Brazier died, and the Manor, anxious as usual for ready money, put up his farm for sale. It was a good place of about sixty acres, with some beautiful hop gardens and plenty of water. Reuben felt that it would be unwise to neglect such an opportunity for enlarging the boundaries of Odiam. He outbid one or two small farmers, put the place under repair, engaged more hands, and set to work to develop a large business in hops.\n\u003cbr\u003e \n\u003cbr\u003e His enthusiasm was immense; he saw quicker returns from hops than from anything else, and the sheltered position of Totease made it possible to cover the whole of it with goldings and fuggles. He built a couple of new oasts with concrete roofs, and announced his intention of engaging London pickers that autumn. There was great perturbation at the Rectory—the Manor had long since abandoned social crusades—because Reuben housed these pickers indiscriminately in a barn. It was also said that he underpaid them. The rector was quite insensible to his argument that if a man were fool enough to work for two shillings a day, why should wise men lose money by preventing[Pg 407] him? Also he compelled no one to come, so the indiscriminate sleepers were only, so to speak, volunteers—and when the rector persisted he became coarse on the subject.\n\u003cbr\u003e \n\u003cbr\u003e His temper had grown a little difficult of late years—it had never been a particularly pleasant one, but it had been fierce rather than quick. His sons felt uneasily that they were partly responsible for this—they irritated him by asserting their independence. Also he suspected them of a lack of enthusiasm. He had tried to arrange a marriage for David with the daughter of the new farmer at Kitchenhour. She was ten years older than he, and not strikingly beautiful, but she satisfied Reuben\u0027s requirements by being as strong as a horse and having a hundred a year of her own. His indignation was immense when David refused this prize.\n\u003cbr\u003e \n\u003cbr\u003e \"I can\u0027t abear the sight of her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll git used to her, lad.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I want something better than that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"She\u0027s got a hundred a year, and that \u0027ud m?ake our fortunes at Odiam.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Odiam\u0027s doing splendid—you don\u0027t want no more.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I justabout do. I shan\u0027t be satisfied till I\u0027ve bought up Grandturzel s?um as I\u0027ve bought Totease.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, I\u0027m not going to sacrifice myself for Odiam, and you\u0027ve no right to ask me, dad.\"\n\u003cbr\u003e \n\u003cbr\u003e \"If I haven\u0027t got a right to ask you that, wot have I, I\u0027d lik to know?\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2094/59489.html","bookId":524,"creation":"Aug 2, 2019 1:00:30 PM","modification":"Aug 2, 2019 1:00:30 PM"}
