{"id":21381,"no":130,"title":"Chapter 5","content":"\u003cbr\u003e The next year came the great unionist collapse. The Government which had bumped perilously through the South African war, went on the rocks of an indignant peace—wrecked by Tariff Reform with the complication of Chinese Labour and the Education Bill. Once more Reuben took prominent part in a general election. The circumstances were altered—no one threw dead cats at him at meetings, though the common labouring men had a way of asking questions which they had not had in \u002765.\n\u003cbr\u003e \n\u003cbr\u003e Old Backfield spoke at five meetings, each time on Tariff Reform and the effect it would have on local agriculture. The candidate and the unionist Club were very proud of him, and spoke of him as \"a grand old man.\" On Election Day, one of the candidates\u0027 own cars was sent to fetch him to the Poll. It was the first time Reuben had ever been in a motor, but he did his best to dissemble his excitement.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s lik them trains,\" he said to the chauffeur, \"unaccountable strange and furrin-looking at first, but[Pg 449] naun to spik of when you\u0027re used to \u0027em. Well I remember when the first railway train wur run from Rye to Hastings—and most people too frightened to go in it, though it never m?ade more\u0027n ten mile an hour.\"\n\u003cbr\u003e \n\u003cbr\u003e Though the country in general chose to go to the dogs, Reuben had the consolation of seeing a Conservative returned for Rye. He put this down largely to his own exertions, and came home in high good humour from the declaration of the Poll. Mr. Courthope, the successful candidate, had shaken him by the hand, and so had his agent and one or two prominent members of the Club. They had congratulated him on his wonderful energy, and wished him many more years of usefulness to the Conservative cause. He might live to see a wheat-tax yet.\n\u003cbr\u003e \n\u003cbr\u003e He compared his present feelings with the miserable humiliation he had endured in \u002765. Queer!—that election seemed almost as real and vivid to him as this one, and—he did not know why—he found himself feeling as if it were more important. His mind recaptured the details with startling clearness—the crowd in the market-place, the fight with Coalbran, the sheep\u0027s entrails that were flung about ... and suddenly, sitting there in his arm-chair, he found himself muttering: \"that hemmed g?ate!\"\n\u003cbr\u003e \n\u003cbr\u003e It must be old age. He pulled himself together, as a farm-hand came into the room. It was Boorman, one of the older lot, who had just come back from Rye.\n\u003cbr\u003e \n\u003cbr\u003e \"Good about the poll, m?aster, wurn\u0027t it?\" he said—the older men were always more cordial towards Reuben than the youngsters. They had seen how he could work.\n\u003cbr\u003e \n\u003cbr\u003e \"Unaccountable good.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I m?ade sure as how Mus\u0027 Courthope ud git in. \u0027T?un\u0027t so long since we sent up another unionist—seems strange when you and me remembers that a Tory never sat fur Rye till \u002785.\"\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e \"When did you come back?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ve only just come in, m?aster. Went r?ound to the London Trader after hearing the poll. By the way, I picked up a piece of news thur—old Jury\u0027s darter wot used to be at Cheat Land has just died. Bob Hilder t?ald me—seems as she lodges wud his sister.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Um.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thought you\u0027d be interested to hear. I remember as how you used to be unaccountable friendly wud them Jurys, considering the difference in your position.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, yes—wot did she die of?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bob dudn\u0027t seem to know. She allus wur a delicate-looking woman.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes—a liddle stick of a woman. That\u0027ll do, now.\"\n\u003cbr\u003e \n\u003cbr\u003e Boorman went out, grumbling at \"th\u0027 ?ald feller\u0027s cussedness,\" and Reuben sat on without moving.\n\u003cbr\u003e \n\u003cbr\u003e Alice was dead—she had died in his hour of triumph. Just when he had succeeded in laying his hands on one thing more of goodness and glory for Odiam, she who had nothing and wanted nothing had gone out into the great nothingness. A leaden weight seemed to have fallen on him, for all that he was \"shut of her.\"\n\u003cbr\u003e \n\u003cbr\u003e The clock ticked on into the silence, the fire spluttered, and a cat licked itself before it. He sat hunched miserably, hearing nothing, seeing nothing. In his breast, where his heart had used to be, was a heavy dead thing that knew neither joy nor sorrow. Reuben was feeling old again.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2094/59502.html","bookId":524,"creation":"Aug 2, 2019 1:00:30 PM","modification":"Aug 2, 2019 1:00:30 PM"}
