{"id":21337,"no":86,"title":"Chapter 18","content":"Rose was intensely relieved. She felt that at last and for ever the tormenting mystery would have gone from her life. Once Handshut was away, she told herself, she would slip back into the old groove—a little soberer and softer perhaps, but definitely free of that Reality which had been so terribly different from its toy-counterfeit.\n\u003cbr\u003e \n\u003cbr\u003e Once Handshut was gone, her heart would not pursue him. It was his continual presence that tormented. True, he never sought her out, or persecuted her, or even spoke to her without her speaking first—he only looked in at the window.... But a woman soon learns what it means to have a man\u0027s face between her and the simplicities of life in her garden, between her and the divinities of the stars and moon.\n\u003cbr\u003e \u0026nbsp;\n\u003cbr\u003e Rose did not find in her love a sweetness to justify the bitterness of its circumstances. The fact that it had been awakened by a man who was her inferior in the social-agricultural scale, who could give her nothing of the material prosperity she so greatly prized, instead of inspiring her with its beauty, merely convinced her of its folly. She saw herself a woman crazed, obsessed, bewitched, and she looked eagerly forward to the day when the spell should be removed and she should go back chastened to the common, comfortable things of life.\n\u003cbr\u003e \n\u003cbr\u003e But meantime a strange restlessness consumed her, tinctured by a horrible boldness. There were moments when she no longer was afraid of Handshut, when she felt herself impelled to seek him out, and make the most of the short time they had together. There could be no danger, for he was going so soon ... so few more words, so few more glances.... Thus her mind worked.\n\u003cbr\u003e \n\u003cbr\u003e She was generally able to control these impulses, but as the days slipped by they grew too strong for her untrained resistance. She felt that she must make the most of her chances because they were so limited—before he went for ever she must have one more memory of his voice, his look—his touch ... oh, no! her thoughts had carried her further than she had intended.\n\u003cbr\u003e \n\u003cbr\u003e She found herself beginning to haunt the places where she would be likely to meet him—the edge of the horse-pond or the Glotten brook, the door of the huge, desolate cow-stable, where six cheap Suffolks emphasised the empty stalls. Reuben did not seem to take any notice of her, he had relieved his feelings by dismissing Handshut, and his farm had swallowed him up again. Rose felt defiant and forlorn. Both her husband and her lover seemed to avoid her. She would lean against the great wooden posts of the door, in the listless weary attitude of a woman\u0027s despair.\n\u003cbr\u003e \n\u003cbr\u003e Then two days before the end he came. As she was[Pg 304] standing by the barn door he appeared at the horse-pond, and crossed over to her at once. He had seen that she was waiting for him—perhaps he had seen it on half a dozen other occasions when she had not seen him.\n\u003cbr\u003e \n\u003cbr\u003e Rose could calm the silly jumps of her heart only by telling herself that this was quite an accidental meeting. She made an effort to be commonplace.\n\u003cbr\u003e \n\u003cbr\u003e \"How\u0027s Topsy\u0027s foal?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Doing valiant. Will you come out wud me to-morrow evenun to see the toll-burning?\"\n\u003cbr\u003e \n\u003cbr\u003e She flushed at his audacity.\n\u003cbr\u003e \n\u003cbr\u003e \"No!—how can I?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can quite easy, surelye. M?aster\u0027s going to Cranbrook Fair, and w?an\u0027t be home till l?ate. It\u0027s the last night, remember.\"\n\u003cbr\u003e \n\u003cbr\u003e She made a gallant effort to be the old Rose.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s that to me?—you\u0027ve got some cheek!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m only not pretending as much as you are. Why shud you pretend? Pretending \u0027ull give you naun sweet to remember when I\u0027m gone.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What tolls are they going to burn?\"\n\u003cbr\u003e \n\u003cbr\u003e \"The g?ates up at Leasan and Mockbeggar, and then over the marsh to Thornsdale. It \u0027ud be a shame fur you to miss it, and m?aster can\u0027t t?ake you, since he\u0027s going to Cranbrook.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It would never do if people saw us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why? Since your husband can\u0027t go, wot\u0027s more likely than he shud send his man to t?ake you?\"\n\u003cbr\u003e \n\u003cbr\u003e Rose shuddered. \"I\u0027m not coming.\"\n\u003cbr\u003e \n\u003cbr\u003e Handshut turned on his heel.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2094/59458.html","bookId":524,"creation":"Aug 2, 2019 1:00:29 PM","modification":"Aug 2, 2019 1:00:29 PM"}
