{"id":95450,"no":3,"title":"Page 3","content":"\u003cp\u003eHe wasn\u0027t going to see her again. It was a promise he made to himself upon waking the following evening.\u003c/p\u003e\n\u003cp\u003eHe repeated the words in his mind as he sat at the computer.\u003c/p\u003e\n\u003cp\u003eHe typed them on the screen.\u003c/p\u003e\n\u003cp\u003eHe spoke them aloud.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t going to see her again.\u003c/p\u003e\n\u003cp\u003eAn hour passed. Two.\u003c/p\u003e\n\u003cp\u003eUnable to resist the lure of seeing her one more time, he took a quick shower, pulled on a pair of black trousers and a dark gray sweater, and left the house.\u003c/p\u003e\n\u003cp\u003eHe stopped at the florist and bought a huge bouquet of roses_yellow ones because she reminded him of sunlight, pink ones that matched the color of her lips, white ones to match the innocence in her eyes. And a single perfect red rose.\u003c/p\u003e\n\u003cp\u003eIt was just after seven when he entered the hospital. He clenched his jaw as he walked down the corridor toward her room, overwhelmed by the scent of sickness and death. He knew it was only his imagination, yet, as he passed by the intensive care unit, it seemed as if he could see the spirits of those near death hovering above the bodies on the beds, their wraith-like arms reaching for him, silently begging him for what only he could give.\u003c/p\u003e\n\u003cp\u003eCursing softly, he turned away, walking blindly down the corridor. He should leave now, he thought. He should never have come here in the first place.\u003c/p\u003e\n\u003cp\u003eAnd then he was outside her room, opening the door. And she was smiling at him, her blue eyes clear and bright, her cheeks flushed.\u003c/p\u003e\n\u003cp\u003e\"I was hoping you\u0027d stop by,\" she said, pleasure evident in the tone of her voice.\u003c/p\u003e\n\u003cp\u003eAlexander returned her smile as he handed her the bouquet.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re beautiful,\" Kara murmured. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"You put them to shame.\"\u003c/p\u003e\n\u003cp\u003eKara felt herself blushing. \"You flatter me, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Not at all.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a vase in that cupboard,\" Kara said. \"Would you mind putting these in water for me?\"\u003c/p\u003e\n\u003cp\u003eWith a nod, he opened the cupboard door, found the vase, and filled it. Taking the flowers, he placed them in the vase, then set it on the table beside the bed.\u003c/p\u003e\n\u003cp\u003e\"So,\" he said, sitting down in the green plastic chair. \"How are you feeling this evening?\"\u003c/p\u003e\n\u003cp\u003e\"Much better. Dr. Petersen is quite impressed with my recovery.\" She smiled. \"He says I can go home tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"That is good news, indeed.\"\u003c/p\u003e\n\u003cp\u003eKara nodded. \"My brother called today. He\u0027s in South America.\"\u003c/p\u003e\n\u003cp\u003e\"Doing what?\"\u003c/p\u003e\n\u003cp\u003e\"Building bridges.\"\u003c/p\u003e\n\u003cp\u003e\"Has he been there long?\"\u003c/p\u003e\n\u003cp\u003e\"About a year. He really likes it, although I\u0027m not sure if it\u0027s the country he loves or the beautiful Bolivian girl he\u0027s dating. Do you have brothers or sisters?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"I have a sister, too. Gail. But then, you met her,didn\u0027t you?\" Kara laughed softly. \"She told me she\u0027d paid you a visit.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he replied, smiling. \"She came looking for a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet she was disappointed when she didn\u0027t find one.\"\u003c/p\u003e\n\u003cp\u003eAlexander nodded. \"She\u0027s quite a brave girl, to go hunting vampires in the middle of the night.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s obsessed with all things paranormal,\" Kara remarked, shaking her head. \"When she grows up, she wants to be a vampire hunter.\"\u003c/p\u003e\n\u003cp\u003e\"An unusual occupation in this day and age.\"\u003c/p\u003e\n\u003cp\u003e\"In any day and age, I should think, since vampires don\u0027t exist.\"\u003c/p\u003e\n\u003cp\u003eAlexander shrugged. \"The inhabitants of some countries would strongly disagree with you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not serious.\"\u003c/p\u003e\n\u003cp\u003e\"Indeed. It\u0027s only been a century or so since England outlawed the practice of driving stakes through the hearts of suicides to insure that they didn\u0027t become vampires.\"\u003c/p\u003e\n\u003cp\u003e\"You sound as though you\u0027ve made quite a study. But then, I guess that\u0027s natural, since you write about them.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. In ancient times, people were quick to notice that when a wounded man, or beast, lost a great deal of blood, his life force grew weak. They believed that blood was the source of vitality, and so they smeared their bodies with blood, and sometimes they drank it.\"\u003c/p\u003e\n\u003cp\u003eHe paused, imagining the warm, coppery taste on his tongue. \"Vampirism has been documented in Babylon, Rome, Greece, Egypt, China, Hungary. In ancient Greece, the people believed in the lamia, who were reported to be demon-women who lured young men to their deaths in order to drink their blood.\"\u003c/p\u003e\n\u003cp\u003eKara shivered. She had never believed in such nonsense, but Alexander spoke with conviction, as though he actually believed such creatures existed. But he would have to believe at least a little, she thought, in order to write such convincing books.\u003c/p\u003e\n\u003cp\u003eShe glanced at the novel he had given her the night before.\u003c/p\u003e\n\u003cp\u003eAlexander followed her gaze. \"Dare I ask if you\u0027ve read any of it?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve read half of it,\" Kara replied. She had spent the better part of the day reading. Once she\u0027d started, she had been unable to put it down. It was a dark book, and yet she had been touched by the vampire\u0027s love for a mortal woman.\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"I can see why it made the best-seller lists. I didn\u0027t think I\u0027d like it. Not after the other one. But this . . .\" She frowned. \"The vampire seems so real, so tragic. I can\u0027t help feeling sorry for him.\"\u003c/p\u003e\n\u003cp\u003eAlexander nodded, pleased that she had seen the humanity in his hero.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s quite different from what you usually write, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Quite.\"\u003c/p\u003e\n\u003cp\u003e\"Does it have a happy ending?\"\u003c/p\u003e\n\u003cp\u003e\"Do you really want me to tell you?\"\u003c/p\u003e\n\u003cp\u003eKara shook her head. \"No, although I must confess, I was tempted to read the end to see how you resolved the conflict.\"\u003c/p\u003e\n\u003cp\u003e\"How do you think it should end?\"\u003c/p\u003e\n\u003cp\u003e\"Happily. There\u0027s enough misery in the world.\"\u003c/p\u003e\n\u003cp\u003eAlexander nodded. More than you can imagine. For a moment, his thoughts turned inward, and then he stood up as he sensed Kara\u0027s sister and grandmother approaching.\u003c/p\u003e\n\u003cp\u003eHe turned toward the door as Gail and her grandmother walked into the room. Both came to an abrupt halt when they saw him.\u003c/p\u003e\n\u003cp\u003eAlexander grinned wryly as Gail stared at him. He didn\u0027t need to be clairvoyant to read her thoughts. She was wondering what he was doing there, wondering what her grandmother would say if she found out Gail had gone to see him alone, late at night.\u003c/p\u003e\n\u003cp\u003eAlexander winked at the girl, hoping to put her at ease, and then realized Kara was making introductions. He shook her grandmother\u0027s hand and smiled at Gail, who looked relieved when neither her sister nor Alexander divulged her secret.\u003c/p\u003e\n\u003cp\u003eHe stayed a few more minutes, aware of the older woman\u0027s curiosity. Kara\u0027s grandmother, Lena, was too polite to stare or ask impertinent questions, but he felt her furtive glances, knew she was wondering where her granddaughter had met him, and why he was visiting her.\u003c/p\u003e\n\u003cp\u003eAs quickly as possible, Alexander bade Kara good night and took his leave.\u003c/p\u003e\n\u003cp\u003eHe was not often trapped in such a small space with mortals. That close, he had been all too aware of them, acutely conscious of the differences between himself and humanity, of their weaknesses and frailties.\u003c/p\u003e\n\u003cp\u003eOutside, he drew in a deep breath, his nostrils filling with the myriad scents of the night.\u003c/p\u003e\n\u003cp\u003eHe thought of Kara, and cursed the dark loneliness that inhabited his soul.\u003c/p\u003e\n\u003cp\u003eAs soon as he was gone, Nana fixed her attention on Kara. \"Who was that man?\"\u003c/p\u003e\n\u003cp\u003e\"You mean Mr. Claybourne?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I mean Mr. Claybourne,\" Nana retorted. \"What does he do? Where did you meet him? How long have you known him?\"\u003c/p\u003e\n\u003cp\u003e\"Really, Nana, you sound just like Sergeant Joe Friday,\" Kara exclaimed, grinning. \"Just the facts, ma\u0027am,\" she said in a fair imitation of Jack Webb.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be impudent, Kara Elizabeth Crawford.\"\u003c/p\u003e\n\u003cp\u003eKara sighed. When Nana used that tone, Kara felt like a child again instead of a grown woman.\u003c/p\u003e\n\u003cp\u003e\"I just met him a couple of days ago. He donated some blood, and he came by to see how I was doing.\" She waved a hand toward the book on her bedside table. \"He\u0027s an author.\"\u003c/p\u003e\n\u003cp\u003eGail picked up the book and read the title. \"A. Lucard! He\u0027s A. Lucard?\"\u003c/p\u003e\n\u003cp\u003eKaranodded.\u003c/p\u003e\n\u003cp\u003eGail shook her head. \"I don\u0027t believe it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s true.\"\u003c/p\u003e\n\u003cp\u003e\"Are his books as scary as everyone says? Can I read this when you\u0027re done?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, his books are scary, and no, you can\u0027t read it.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027re too young.\"\u003c/p\u003e\n\u003cp\u003e\"Am not.\"\u003c/p\u003e\n\u003cp\u003e\"Are too.\"\u003c/p\u003e\n\u003cp\u003e\"Girls, that will do. Gail, why don\u0027t you go get mea cup of coffee?\"\u003c/p\u003e\n\u003cp\u003eGail lifted her eyebrows. \"Do you really want a cup of coffee, or are you just trying to get rid of me?\"\u003c/p\u003e\n\u003cp\u003e\"Just do as you\u0027re told, miss.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,all right,\" Gail grumbled.\u003c/p\u003e\n\u003cp\u003eKara took a deep, fortifying breath as she watched her sister leave the room.\u003c/p\u003e\n\u003cp\u003e\"Now, missy,\" Nana said, \"tell me what\u0027s going on between you and Mr. Claybourne.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, for goodness sakes, Nana, what do you think\u0027s going on?\"\u003c/p\u003e\n\u003cp\u003e\"If I knew, I wouldn\u0027t be asking.\"\u003c/p\u003e\n\u003cp\u003e\"Nothing\u0027s going on. I just met the man!\" Kara shook her head in annoyance. She loved her grandmother, but sometimes Nana\u0027s old-fashioned ideas of right and wrong made her want to scream. \"I\u0027m in the hospital, for heaven\u0027s sake. Hardly a fit place for an affair, should I decide to have one.\"\u003c/p\u003e\n\u003cp\u003e\"Kara!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"It just seems odd, his coming here.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s odd?\" Gail asked. She handed a paper cup filled with black coffee to her grandmother.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" Nana sat back and sipped her coffee, listening while Gail told Kara about her day at school. A few minutes later, the chimes that signaled the end of visiting hours sounded throughout the hospital.\u003c/p\u003e\n\u003cp\u003e\"Are you still coming home tomorrow?\" Gail asked.\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eGail turned toward her grandmother. \"Can I come with you to get Kara?\"\u003c/p\u003e\n\u003cp\u003e\"No, you have school.\"\u003c/p\u003e\n\u003cp\u003e\"I could miss a day.\"\u003c/p\u003e\n\u003cp\u003e\"No. Tell Kara good night. We must go.\"\u003c/p\u003e\n\u003cp\u003eGail hugged Kara. \"I never get to do anything,\" she complained.\u003c/p\u003e\n\u003cp\u003e\"When I\u0027m feeling better, we\u0027ll go shopping.\"\u003c/p\u003e\n\u003cp\u003e\"Promise?\"\u003c/p\u003e\n\u003cp\u003e\"Promise.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Kara,\" Nana said. \"I\u0027ll be by tomorrow about ten.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Nana.\"\u003c/p\u003e\n\u003cp\u003eKara lay back on the pillows. Now that she thought of it, it was odd that Alexander Claybourne had come to see her. After all, she had donated blood to the Red Cross on several occasions, but she had never known where the blood had gone. And even though she had often wondered who had received it, and if it had perhaps saved a life, she had never gone looking for the recipients.\u003c/p\u003e\n\u003cp\u003eSo, maybe he was just more curious than she was. Or maybe he had some sinister motive. . . .\u003c/p\u003e\n\u003cp\u003eKara shook her head. It wasn\u0027t like her to be suspicious. Nana often said Kara was too trusting, too gullible, for her own good, and maybe she was. But she preferred to think the best of people instead of the worst. She knew there was evil in the world, but she saw no point in dwelling on it just because the six o\u0027clock news couldn\u0027t talk about anything else. After all, there was good in the world, too. And Alexander Claybourne proved it. He had donated blood to a total stranger, and then come by to see how she was doing.\u003c/p\u003e\n\u003cp\u003eShe frowned as she stared at the flowers he had brought her. How had he found out who had received his blood anyway? Wasn\u0027t that information confidential?\u003c/p\u003e\n\u003cp\u003eShe plucked the red rose from the vase and sniffed its fragrance. Whatever else he was, he was the most generous man she had ever known. The flowers must have cost him a small fortune, she thought. Roses from a florist were never cheap, and there were at least three dozen buds, all perfectly formed.\u003c/p\u003e\n\u003cp\u003eThey were beautiful, she mused. Then she smiled. He had said she put them to shame. It was one of the nicest compliments she had ever received.\u003c/p\u003e\n\u003cp\u003eSmiling, she put the rose back in the vase and reached for his book, eager to discover how the romance between the vampire and the mortal woman ended. \u003c/p\u003e","sourceLink":"https://allnovel.net/deeper-than-the-night/page-3.html","bookId":2308,"creation":"Oct 5, 2019 6:15:00 PM","modification":"Oct 5, 2019 6:15:00 PM"}
