{"id":95479,"no":32,"title":"Page 32","content":"\u003cp\u003e\"She\u0027s bleeding!\" Gail cried. \"Kara\u0027s bleeding!\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s she hit?\"\u003c/p\u003e\n\u003cp\u003e\"In the side. Do something!\"\u003c/p\u003e\n\u003cp\u003e\"Your scarf, Gail. Fold it into a square and press it over the wound. Kara?\" He glanced over at her. \"Kara!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think she can hear you,\" Gail said, a distinct quaver in her voice. \"She\u0027s not dead, is she?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eAlex glanced repeatedly in the rearview mirror, but as far as he could tell, they weren\u0027t being followed.\u003c/p\u003e\n\u003cp\u003e\"What are we going to do?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going home and grab some clothes,\" Alex replied. \"Well look after Kara\u0027s wound, and then we\u0027re going up to Eagle Flats.\"\u003c/p\u003e\n\u003cp\u003e\"I think we should take Kara to the hospital.\"\u003c/p\u003e\n\u003cp\u003e\"Not now.\"\u003c/p\u003e\n\u003cp\u003eKara was unconscious by the time they reached the house. Alex carried her inside, switched on the hall light, and told Gail to wait in the den.\u003c/p\u003e\n\u003cp\u003eCarrying Kara up the stairs to the bedroom, Alex kicked the door closed with his heel, then lowered Kara onto the bed. Lifting her sweater, he removed Gail\u0027s blood-soaked scarf and examined the wound. It wasn\u0027t deep and didn\u0027t look serious, unless it became infected, but she had lost a lot of blood and that worried him.\u003c/p\u003e\n\u003cp\u003eHe washed the wound with soap and water, then swore under his breath as he ripped a clean white sheet into strips and bandaged her side. He didn\u0027t have so much as an aspirin to give her for the pain. But that couldn\u0027t be helped now.\u003c/p\u003e\n\u003cp\u003eHe dressed quickly in a pair of black Levi\u0027s and a black sweater, pulled on a pair of black cowboy boots, then went to the small desk beside the bed. Opening the top drawer, he removed the cash he kept on hand for emergencies and shoved it into his pants pocket; then, unlocking the bottom drawer, he withdrew a two-inch .38 Special which he tucked under his shirt at the small of his back. Then, lifting Kara into his arms, he carried her downstairs and went into the den to get Gail.\u003c/p\u003e\n\u003cp\u003e\"Is she all right?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be fine. Hand me my checkbook there on the desk, will you? Thanks.\" He slipped it into his back pocket. \"Ready, Gail? Then let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eHe stopped at an all-night drugstore. Leaving Gail in the car with Kara, he went into the store, gathering all the first-aid supplies he thought he might need. He asked the clerk where the alcohol was, and when the young man went to get it for him, Alex grabbed a couple of syringes from behind the counter and stuck them inside his jacket.\u003c/p\u003e\n\u003cp\u003eIt was near dawn when Alex pulled into a motel. He went in alone to register, requesting a room toward the back.\u003c/p\u003e\n\u003cp\u003eKara was awake when he returned to the car.\u003c/p\u003e\n\u003cp\u003e\"How are you feeling?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Horrible. Where are we?\"\u003c/p\u003e\n\u003cp\u003e\"A motel about forty miles from Eagle Flats. We\u0027ll stay here today.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think it\u0027s safe?\"\u003c/p\u003e\n\u003cp\u003e\"No one\u0027s following us as near as I can tell.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hungry,\" Gail said.\u003c/p\u003e\n\u003cp\u003e\"We\u0027llsend out for something as soon as I look after your sister.\" Opening the door, he lifted Kara into his arms.\u003c/p\u003e\n\u003cp\u003e\"I can walk.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want to?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She wrapped her arms around his neck and closed her eyes. So many times, she\u0027d been afraid she\u0027d never see him again and now he was here, holding her, his dark eyes filled with love and concern.\u003c/p\u003e\n\u003cp\u003e\"Do you guys want to be alone?\"\u003c/p\u003e\n\u003cp\u003eAlex glanced at Gail, grinning when he saw the look on her face. \"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I think you should have got two rooms.\"\u003c/p\u003e\n\u003cp\u003eAlex shook his head. \"We can\u0027t take a chance on leaving you alone. Here.\" He tossed her the room key. \"How about opening the door?\"\u003c/p\u003e\n\u003cp\u003e\"And then get our bags,\" Kara added.\u003c/p\u003e\n\u003cp\u003eGail grimaced. \"Now I know why you brought me along,\" she muttered. \"Gail, open the door. Gail, get the bags.\"\u003c/p\u003e\n\u003cp\u003eAlex laughed softly as he handed her the car keys.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d do it myself, but my hands are full.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, yeah,\" Gail said irritably, but she was smiling as she walked toward the car.\u003c/p\u003e\n\u003cp\u003eInside the room, Alex placed Kara on the bed. \"Let\u0027s get you out of those bloody things,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s kiss instead.\"\u003c/p\u003e\n\u003cp\u003e\"Kara . . .\u0027\u003c/p\u003e\n\u003cp\u003e\"Please, Alex, just one kiss?\"\u003c/p\u003e\n\u003cp\u003eHow could he refuse? Cupping her face in his hands, he kissed her gently. Sensations swamped him. Warm, soft lips, the scent of her skin and hair, the touch of her hands sliding up and down his back, massaging the sensitive skin of his spine. He remembered all the nights he had ached for her touch, yearned for the sound of her voice, the comfort of her smile . . .\u003c/p\u003e\n\u003cp\u003eAbruptly, he drew back, his gaze searching hers. \"Kara . . .\" He swallowed hard as he placed one hand over her abdomen. \"Kara?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true,\" she said quietly. \"I\u0027m pregnant.\"\u003c/p\u003e\n\u003cp\u003eHis first reaction was one of joy. She saw it dance in the depths of his eyes, in the smile that lit his face. And then, as quickly as it had appeared, it was gone.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m happy, Alex, happy about the baby. I want you to be happy, too.\"\u003c/p\u003e\n\u003cp\u003e\"How can I be?\" He dropped to his knees beside the bed and buried his face in her lap. She was pregnant. The thing he had feared most had come to pass. He closed his eyes against the pain that slashed through his heart. What if she died? How could he live with the knowledge that loving him had killed her?\u003c/p\u003e\n\u003cp\u003e\"Alex, please.\"\u003c/p\u003e\n\u003cp\u003eHe lifted his head, his black eyes dull with pain. \"We\u0027ll find a doctor.\"\u003c/p\u003e\n\u003cp\u003e\"A doctor? For what?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s still time.\"\u003c/p\u003e\n\u003cp\u003eShe stared down at him. \"You\u0027re talking about an abortion, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the only way . . .\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Kara . . .\"\u003c/p\u003e\n\u003cp\u003e\"No, Alex. I won\u0027t even consider it.\"\u003c/p\u003e\n\u003cp\u003eA soft sound at the doorway drew Alexander\u0027s attention. Glancing over his shoulder, he saw Gail standing there, an overnight bag in each hand, her cheeks wet with tears.\u003c/p\u003e\n\u003cp\u003eRising to his feet, Alex crossed the room and took the bags from her hands. \"Why don\u0027t you order us some dinner?\"\u003c/p\u003e\n\u003cp\u003eGail went to sit beside her sister. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine. Call the restaurant and order something to eat.\" She forced a smile as she placed her hand over her stomach. \"I\u0027m eating for two now, you know?\"\u003c/p\u003e\n\u003cp\u003eMouth set in a grim line, Alex removed Kara\u0027s sweater and set about cleaning and disinfecting the wound. When that was done, Kara went into the bathroom to wash up and change into her nightgown.\u003c/p\u003e\n\u003cp\u003eGail sat on the edge of the other twin bed, fidgeting with a corner of the bedspread. \"Why do you want Kara to get an abortion?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027d you order for dinner?\"\u003c/p\u003e\n\u003cp\u003e\"Is it because you\u0027re from outer space?\"\u003c/p\u003e\n\u003cp\u003e\"Did Kara tell you that?\"\u003c/p\u003e\n\u003cp\u003eGail nodded. \"You don\u0027t have to worry. I won\u0027t tell anyone.\"\u003c/p\u003e\n\u003cp\u003eAlex swore softly, then shook his head. Maybe it was better that Gail knew. It would certainly make things easier.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true,\" Alex said, sitting down beside her. \"I\u0027m from another planet, and I\u0027m worried that it might be dangerous for Kara to have my baby. Do you understand?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eThe sound of the water running in the bathroom drew his gaze toward the door. Closing his eyes, he searched Kara\u0027s thoughts, needing to be certain she was all right. She was angry with him. Afraid for him, and for the child.\u003c/p\u003e\n\u003cp\u003eAnd then her mind closed against his, shutting him out as effectively as if she\u0027d slammed a door between them.\u003c/p\u003e\n\u003cp\u003eKara emerged from the bathroom a few minutes later, and Alex thought she\u0027d never looked lovelier. Her face was flushed, her hair fell down her back, a few tendrils curling around her face.\u003c/p\u003e\n\u003cp\u003eShe walked across the room slowly, carefully sat down on the bed.\u003c/p\u003e\n\u003cp\u003eAlex watched her, feeling the pain of her wound as if it were his own.\u003c/p\u003e\n\u003cp\u003eFive minutes later, there was a knock at the door.\u003c/p\u003e\n\u003cp\u003eWithdrawing his pistol and holding it out of sight behind his back, he motioned for Gail to open the door.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got an order here for Mr. Jones.\"\u003c/p\u003e\n\u003cp\u003eAlex looked the young man over. Placing the gun on top of the dresser, he withdrew some money from his pocket. \"How much?\"\u003c/p\u003e\n\u003cp\u003e\"Eighteen-fifty.\"\u003c/p\u003e\n\u003cp\u003eAlex paid him for the food, then closed and locked the door.\u003c/p\u003e\n\u003cp\u003eHe stood near the window, looking out from time to time, while Gail and Kara ate breakfast.\u003c/p\u003e\n\u003cp\u003e\"Alex, are you sure you don\u0027t want anything?\" Kara asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure.\" Needing some time alone, time to think, he went into the bathroom to shower. She was pregnant. The thought pounded at his brain as the water pummeled his flesh. Pregnant. Pregnant. How far along was she? A month? Two? Pregnant.\u003c/p\u003e\n\u003cp\u003eHe dressed quickly, then stepped into the main room. Gail and Kara were asleep in each other\u0027s arms.\u003c/p\u003e\n\u003cp\u003eA wave of tenderness swept through Alex as he drew a blanket over the two of them. He checked the lock, slipped his gun under the pillow of the other bed, and stretched out on the mattress.\u003c/p\u003e\n\u003cp\u003eShe was here.\u003c/p\u003e\n\u003cp\u003eShe was pregnant.\u003c/p\u003e\n\u003cp\u003eIt was his last thought before sleep claimed him. \u003c/p\u003e","sourceLink":"https://allnovel.net/deeper-than-the-night/page-32.html","bookId":2308,"creation":"Oct 5, 2019 6:15:00 PM","modification":"Oct 5, 2019 6:15:00 PM"}
