{"id":95456,"no":9,"title":"Page 9","content":"\u003cp\u003eI stared into Lilith\u0027s face. \"What have you done to me?\"\u003c/p\u003e\n\u003cp\u003e\"I have made you immortal.\"\u003c/p\u003e\n\u003cp\u003eI stared up at her, knowing what she was, yet refusing to acknowledge it; knowing, in the very depths of my being, that my soul was damned.\u003c/p\u003e\n\u003cp\u003e\"What are you?\"\u003c/p\u003e\n\u003cp\u003eAmusement flared in her eyes. \"What do you think I am?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"You know.\"\u003c/p\u003e\n\u003cp\u003eI shook my head. \"It\u0027s not possible.\"\u003c/p\u003e\n\u003cp\u003e\"We are known by many names. Vrykalakes, blutsauger, upiry. Vampyr, Vampyre.\" She smiled. \"Vampire, Alesandro, that is what I am. That is what you are.\"\u003c/p\u003e\n\u003cp\u003e\"No . . \" I stared at her, the embodiment of every nightmare I had ever known, every fear that had tormented me. Vampire. The undead.\u003c/p\u003e\n\u003cp\u003e\"Go outside,\" she said curtly. \"Empty yourself of bodily fluids. Then come back to me.\"\u003c/p\u003e\n\u003cp\u003eI did as I was told. Numb to everything around me, I did as I was told. I knew it was winter, that the air was cold, but I felt nothing at all.\u003c/p\u003e\n\u003cp\u003eShe was sitting on the edge of the bed when I returned. \"When you wake tomorrow, the transformation will be complete.\" Rising, she glanced at the window. \"It is almost dawn.\"\u003c/p\u003e\n\u003cp\u003eI followed her gaze. The window was covered with a heavy green damask drape that would have kept out the light of the brightest day. How, I wondered, how did she know dawn was approaching?\u003c/p\u003e\n\u003cp\u003e\"You may spend the day here, with me,\" she said. \"Tomorrow you must find your own place to rest.\" She made a sound of disgust when I said nothing, only continued to stand there, staring at her. \"Come along,\" she said, and taking me by the hand, she led me through a narrow door, up a short flight of stairs, into a small windowless room that was empty save for an ornate casket set upon a raised platform.\u003c/p\u003e\n\u003cp\u003eDropping my hand, she climbed the stairs of the platform and lifted the lid, revealing a lining of deep green satin.\u003c/p\u003e\n\u003cp\u003eAnd then she held out her hand. \"Come, Alesandro. The dawn approaches.\"\u003c/p\u003e\n\u003cp\u003eI stared at her hand in horror. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the matter?\" she asked disdainfully. \"Surely you\u0027re not afraid of this box?\"\u003c/p\u003e\n\u003cp\u003eI shook my head, too ashamed to tell her it wasn\u0027t the coffin I feared, though I must confess I was loathe to climb into it. What I feared was the darkness inside.\u003c/p\u003e\n\u003cp\u003e\"Do as you wish,\" she said, her voice tinged with disgust.\u003c/p\u003e\n\u003cp\u003eTurning her back to me, she climbed into the casket, her movements as graceful as a reed bending in the wind.\u003c/p\u003e\n\u003cp\u003eI stood there for a long while, and then, without knowing how or why, I knew the sun had come up. I felt myself growing heavy, lethargic. The feeling, so unfamiliar, frightened me, and I ran up the stairs and hurled myself into the casket. Lilith was lying on her side to make room for me. She smiled smugly, and then she lowered the lid on the casket, shutting us in darkness.\u003c/p\u003e\n\u003cp\u003eA hoarse cry of primal fear rose in my throat, and then I was dragged down into a deep black void, all conscious thought swept away.\u003c/p\u003e\n\u003cp\u003eWhen I awoke the following night, she was gone. I lay there for a moment, my body wracked with pain such as I had never felt before. And then, realizing where I was, I bolted out of the coffin and ran down the stairs to her bedroom.\u003c/p\u003e\n\u003cp\u003eShe was sitting on a velvet-covered bench, brushing her hair. I realized then that there were no mirrors anywhere in the house.\u003c/p\u003e\n\u003cp\u003e\"Awake at last?\" she asked. \"I had rather thought you\u0027d be an early riser, being a farmer and all.\"\u003c/p\u003e\n\u003cp\u003e\"Lilith, help me.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I hurt.\" I wrapped my arms around my stomach, certain I was dying, only then remembering that I could not die.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing to be concerned about,\" she remarked. \"It will pass after you\u0027ve fed.\"\u003c/p\u003e\n\u003cp\u003eMy gaze darted toward the bed as I remembered the boy she had killed the night before. She had drained his life. That was how she took sustenance. The thought filled me with revulsion, and then, to my horror, I felt my teeth grow long at the thought of the boy\u0027s blood on my tongue.\u003c/p\u003e\n\u003cp\u003e\"No.\" I backed away from her. \"I can\u0027t. I won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You can,\" she said coldly. \"You will.\"\u003c/p\u003e\n\u003cp\u003e\"No, never.\"\u003c/p\u003e\n\u003cp\u003e\"You can come with me now, tonight, and learn to hunt, or you can leave my house and learn to survive on your own.\"\u003c/p\u003e\n\u003cp\u003e\"And if I don\u0027t wish to survive?\"\u003c/p\u003e\n\u003cp\u003e\"Then you have only to wait for sunrise. A fledgling such as yourself will burst into flame at the first touch of the sun.\"\u003c/p\u003e\n\u003cp\u003eI shuddered at the thought, at the hideous images her words conjured in my mind.\u003c/p\u003e\n\u003cp\u003e\"There is much you need to learn, Alesandro. I can teach you, or I can destroy you. The choice is yours.\"\u003c/p\u003e\n\u003cp\u003eI had never thought myself a coward until I faced the very real possibility of dying again . . . . \u003c/p\u003e","sourceLink":"https://allnovel.net/deeper-than-the-night/page-9.html","bookId":2308,"creation":"Oct 5, 2019 6:15:00 PM","modification":"Oct 5, 2019 6:15:00 PM"}
