{"id":34380,"no":2,"title":"CHAPTER II NO WEDDING BELLS FOR BINGO","content":"\u0026nbsp;Bingo reported three days later that Rosie M. Banks was the goods and beyond a question the stuff to give the troops. Old Little had jibbed somewhat at first at the proposed change of literary diet, he not being much of a lad for fiction and having stuck hitherto exclusively to the heavier monthly reviews; but Bingo had got chapter one of \"All for Love\" past his guard before he knew what was happening, and after that there was nothing to it. Since then they had finished \"A Red, Red Summer Rose,\" \"Madcap Myrtle\" and \"Only a Factory Girl,\" and were half-way through \"The Courtship of Lord Strathmorlick.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bingo told me all this in a husky voice over an egg beaten up in sherry. The only blot on the thing from his point of view was that it wasn\u0027t doing a bit of good to the old vocal cords, which were beginning to show signs of cracking under the strain. He had been looking his symptoms up in a medical dictionary, and he thought he had got \"clergyman\u0027s throat.\" But against this you had to set the fact that he was making an undoubted hit in the right quarter, and also that after the evening\u0027s reading he always stayed on to dinner; and, from what he told me, the dinners turned out by old Little\u0027s cook had to be tasted to be believed. There were tears in the old blighter\u0027s eyes as he got[Pg 20] on the subject of the clear soup. I suppose to a fellow who for weeks had been tackling macaroons and limado it must have been like Heaven.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Little wasn\u0027t able to give any practical assistance at these banquets, but Bingo said that he came to the table and had his whack of arrowroot, and sniffed the dishes, and told stories of entrées he had had in the past, and sketched out scenarios of what he was going to do to the bill of fare in the future, when the doctor put him in shape; so I suppose he enjoyed himself, too, in a way. Anyhow, things seemed to be buzzing along quite satisfactorily, and Bingo said he had got an idea which, he thought, was going to clinch the thing. He wouldn\u0027t tell me what it was, but he said it was a pippin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We make progress, Jeeves,\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is very satisfactory, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Little tells me that when he came to the big scene in \u0027Only a Factory Girl,\u0027 his uncle gulped like a stricken bull-pup.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where Lord Claude takes the girl in his arms, you know, and says——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am familiar with the passage, sir. It is distinctly moving. It was a great favourite of my aunt\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we\u0027re on the right track.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would seem so, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In fact, this looks like being another of your successes. I\u0027ve always said, and I always shall say, that for sheer brain, Jeeves, you stand alone. All the other great thinkers of the age are simply in the crowd, watching you go by.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you very much, sir. I endeavour to give satisfaction.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 21]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About a week after this, Bingo blew in with the news that his uncle\u0027s gout had ceased to trouble him, and that on the morrow he would be back at the old stand working away with knife and fork as before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And, by the way,\" said Bingo, \"he wants you to lunch with him to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Me? Why me? He doesn\u0027t know I exist.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, he does. I\u0027ve told him about you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you told him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, various things. Anyhow, he wants to meet you. And take my tip, laddie—you go! I should think lunch to-morrow would be something special.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I don\u0027t know why it was, but even then it struck me that there was something dashed odd—almost sinister, if you know what I mean—about young Bingo\u0027s manner. The old egg had the air of one who has something up his sleeve.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is more in this than meets the eye,\" I said. \"Why should your uncle ask a fellow to lunch whom he\u0027s never seen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear old fathead, haven\u0027t I just said that I\u0027ve been telling him all about you—that you\u0027re my best pal—at school together, and all that sort of thing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But even then—and another thing. Why are you so dashed keen on my going?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bingo hesitated for a moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I told you I\u0027d got an idea. This is it. I want you to spring the news on him. I haven\u0027t the nerve myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! I\u0027m hanged if I do!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you call yourself a pal of mine!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know; but there are limits.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bertie,\" said Bingo reproachfully, \"I saved your life once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 22]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t I? It must have been some other fellow, then. Well, anyway, we were boys together and all that. You can\u0027t let me down.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, all right,\" I said. \"But, when you say you haven\u0027t nerve enough for any dashed thing in the world, you misjudge yourself. A fellow who——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cheerio!\" said young Bingo. \"One-thirty to-morrow. Don\u0027t be late.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I\u0027m bound to say that the more I contemplated the binge, the less I liked it. It was all very well for Bingo to say that I was slated for a magnificent lunch; but what good is the best possible lunch to a fellow if he is slung out into the street on his ear during the soup course? However, the word of a Wooster is his bond and all that sort of rot, so at one-thirty next day I tottered up the steps of No. 16, Pounceby Gardens, and punched the bell. And half a minute later I was up in the drawing-room, shaking hands with the fattest man I have ever seen in my life.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The motto of the Little family was evidently \"variety.\" Young Bingo is long and thin and hasn\u0027t had a superfluous ounce on him since we first met; but the uncle restored the average and a bit over. The hand which grasped mine wrapped it round and enfolded it till I began to wonder if I\u0027d ever get it out without excavating machinery.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Wooster, I am gratified—I am proud—I am honoured.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It seemed to me that young Bingo must have boosted me to some purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, ah!\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 23]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stepped back a bit, still hanging on to the good right hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very young to have accomplished so much!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I couldn\u0027t follow the train of thought. The family, especially my Aunt Agatha, who has savaged me incessantly from childhood up, have always rather made a point of the fact that mine is a wasted life, and that, since I won the prize at my first school for the best collection of wild flowers made during the summer holidays, I haven\u0027t done a dam\u0027 thing to land me on the nation\u0027s scroll of fame. I was wondering if he couldn\u0027t have got me mixed up with someone else, when the telephone-bell rang outside in the hall, and the maid came in to say that I was wanted. I buzzed down, and found it was young Bingo.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hallo!\" said young Bingo. \"So you\u0027ve got there? Good man! I knew I could rely on you. I say, old crumpet, did my uncle seem pleased to see you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Absolutely all over me. I can\u0027t make it out.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, that\u0027s all right. I just rang up to explain. The fact is, old man, I know you won\u0027t mind, but I told him that you were the author of those books I\u0027ve been reading to him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I said that \u0027Rosie M. Banks\u0027 was your pen-name, and you didn\u0027t want it generally known, because you were a modest, retiring sort of chap. He\u0027ll listen to you now. Absolutely hang on your words. A brightish idea, what? I doubt if Jeeves in person could have thought up a better one than that. Well, pitch it strong, old lad, and keep steadily before you the fact that I must have my allowance raised. I can\u0027t possibly marry on what I\u0027ve got now. If this film is to end with the slow[Pg 24] fade-out on the embrace, at least double is indicated. Well, that\u0027s that. Cheerio!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he rang off. At that moment the gong sounded, and the genial host came tumbling downstairs like the delivery of a ton of coals.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I always look back to that lunch with a sort of aching regret. It was the lunch of a lifetime, and I wasn\u0027t in a fit state to appreciate it. Subconsciously, if you know what I mean, I could see it was pretty special, but I had got the wind up to such a frightful extent over the ghastly situation in which young Bingo had landed me that its deeper meaning never really penetrated. Most of the time I might have been eating sawdust for all the good it did me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Little struck the literary note right from the start.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My nephew has probably told you that I have been making a close study of your books of late?\" he began.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. He did mention it. How—er—how did you like the bally things?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He gazed reverently at me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Wooster, I am not ashamed to say that the tears came into my eyes as I listened to them. It amazes me that a man as young as you can have been able to plumb human nature so surely to its depths; to play with so unerring a hand on the quivering heart-strings of your reader; to write novels so true, so human, so moving, so vital!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, it\u0027s just a knack,\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The good old persp. was bedewing my forehead by this time in a pretty lavish manner. I don\u0027t know when I\u0027ve been so rattled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you find the room a trifle warm?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 25]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no, no, rather not. Just right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it\u0027s the pepper. If my cook has a fault—which I am not prepared to admit—it is that she is inclined to stress the pepper a trifle in her made dishes. By the way, do you like her cooking?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was so relieved that we had got off the subject of my literary output that I shouted approval in a ringing baritone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am delighted to hear it, Mr. Wooster. I may be prejudiced, but to my mind that woman is a genius.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Absolutely!\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She has been with me seven years, and in all that time I have not known her guilty of a single lapse from the highest standard. Except once, in the winter of 1917, when a purist might have condemned a certain mayonnaise of hers as lacking in creaminess. But one must make allowances. There had been several air-raids about that time, and no doubt the poor woman was shaken. But nothing is perfect in this world, Mr. Wooster, and I have had my cross to bear. For seven years I have lived in constant apprehension lest some evilly-disposed person might lure her from my employment. To my certain knowledge she has received offers, lucrative offers, to accept service elsewhere. You may judge of my dismay, Mr. Wooster, when only this morning the bolt fell. She gave notice!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good Lord!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your consternation does credit, if I may say so, to the heart of the author of \u0027A Red, Red Summer Rose.\u0027 But I am thankful to say the worst has not happened. The matter has been adjusted. Jane is not leaving me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good egg!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good egg, indeed—though the expression is[Pg 26] not familiar to me. I do not remember having come across it in your books. And, speaking of your books, may I say that what has impressed me about them even more than the moving poignancy of the actual narrative, is your philosophy of life. If there were more men like you, Mr. Wooster, London would be a better place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was dead opposite to my Aunt Agatha\u0027s philosophy of life, she having always rather given me to understand that it is the presence in it of chappies like me that makes London more or less of a plague spot; but I let it go.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me tell you, Mr. Wooster, that I appreciate your splendid defiance of the outworn fetishes of a purblind social system. I appreciate it! You are big enough to see that rank is but the guinea stamp and that, in the magnificent words of Lord Bletchmore in \u0027Only a Factory Girl,\u0027 \u0027Be her origin ne\u0027er so humble, a good woman is the equal of the finest lady on earth!\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I sat up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say! Do you think that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do, Mr. Wooster. I am ashamed to say that there was a time when I was like other men, a slave to the idiotic convention which we call Class Distinction. But, since I read your books——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I might have known it. Jeeves had done it again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think it\u0027s all right for a chappie in what you might call a certain social position to marry a girl of what you might describe as the lower classes?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Most assuredly I do, Mr. Wooster.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I took a deep breath, and slipped him the good news.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Young Bingo—your nephew, you know—wants to marry a waitress,\" I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I honour him for it,\" said old Little.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 27]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t object?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the contrary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I took another deep breath and shifted to the sordid side of the business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you won\u0027t think I\u0027m butting in, don\u0027t you know,\" I said, \"but—er—well, how about it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I fear I do not quite follow you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I mean to say, his allowance and all that. The money you\u0027re good enough to give him. He was rather hoping that you might see your way to jerking up the total a bit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Little shook his head regretfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I fear that can hardly be managed. You see, a man in my position is compelled to save every penny. I will gladly continue my nephew\u0027s existing allowance, but beyond that I cannot go. It would not be fair to my wife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! But you\u0027re not married?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not yet. But I propose to enter upon that holy state almost immediately. The lady who for years has cooked so well for me honoured me by accepting my hand this very morning.\" A cold gleam of triumph came into his eye. \"Now let \u0027em try to get her away from me!\" he muttered, defiantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; * \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Young Mr. Little has been trying frequently during the afternoon to reach you on the telephone, sir,\" said Jeeves that night, when I got home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll bet he has,\" I said. I had sent poor old Bingo an outline of the situation by messenger-boy shortly after lunch.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seemed a trifle agitated.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t wonder. Jeeves,\" I said, \"so brace up and bite the bullet. I\u0027m afraid I\u0027ve bad news for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 28]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That scheme of yours—reading those books to old Mr. Little and all that—has blown out a fuse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They did not soften him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They did. That\u0027s the whole bally trouble. Jeeves, I\u0027m sorry to say that fiancée of yours—Miss Watson, you know—the cook, you know—well, the long and the short of it is that she\u0027s chosen riches instead of honest worth, if you know what I mean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She\u0027s handed you the mitten and gone and got engaged to old Mr. Little!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Indeed, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t seem much upset.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The fact is, sir, I had anticipated some such outcome.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I stared at him. \"Then what on earth did you suggest the scheme for?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To tell you the truth, sir, I was not wholly averse from a severance of my relations with Miss Watson. In fact, I greatly desired it. I respect Miss Watson exceedingly, but I have seen for a long time that we were not suited. Now, the other young person with whom I have an understanding—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Great Scott, Jeeves! There isn\u0027t another?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How long has this been going on?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For some weeks, sir. I was greatly attracted by her when I first met her at a subscription dance at Camberwell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My sainted aunt! Not——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Jeeves inclined his head gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. By an odd coincidence it is the same young person that young Mr. Little—— I have placed the cigarettes on the small table. Good night, sir.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3042/84041.html","bookId":1032,"creation":"Aug 5, 2019 5:37:04 AM","modification":"Aug 5, 2019 5:37:04 AM"}
