{"id":99572,"no":14,"title":"Page 14","content":"\u003cp\u003eWe get ready for bed. He doesn’t have to tell me there isn’t going to be any rolling around tonight. Hon killed the mood, as they say, but it’s fine. I’m tired anyway. March is quiet, his face heavy with old regret.\u003c/p\u003e\n\u003cp\u003eInto the silence, Constance says, “I have the answer to your query.”\u003c/p\u003e\n\u003cp\u003eI pause, shirt half over my head. Struggling through the black fabric, I glance at March, who’s frozen in place. He looks half-sick at what he may hear.\u003c/p\u003e\n\u003cp\u003e“What did you find?” I ask.\u003c/p\u003e\n\u003cp\u003e“Svetlana Holder March spent four days in a private Farwan medical facility on New Terra on . . .” Constance names a date consistent with Hon’s recollection. “Records indicate she bore a boy child, who tested Psi positive at four days old. Highly unusual for the gift to manifest so soon. The infant was remanded into Farwan’s custody for crèche-rearing and eventual induction into Psi-Corp.”\u003c/p\u003e\n\u003cp\u003e“I have a nephew,” he breathes. “Where is he now?”\u003c/p\u003e\n\u003cp\u003e“I am sorry,” she says, at length. “The data trail ends there. There are no records that I can access regarding his placement.”\u003c/p\u003e\n\u003cp\u003eI watch him pace our quarters, not enough space to offer an outlet for his frustration. His deltoid muscles bunch with each movement. Finally, he slams a fist into the wall. The material dents, then flows back into shape. Starships have been designed to weather the occasional outburst.\u003c/p\u003e\n\u003cp\u003e“He could be anywhere,” he bites out. “Constance, alert the crew. We’re—”\u003c/p\u003e\n\u003cp\u003e“Belay that order.”\u003c/p\u003e\n\u003cp\u003eMarch draws up short, his amber eyes sparking gold in his fury. His hands curl at his sides, and he’s imposing as hell, but I stand my ground.\u003c/p\u003e\n\u003cp\u003e“You better have a damn good reason for that, Jax. That’s my flesh and blood we’re talking about.”\u003c/p\u003e\n\u003cp\u003e“I know,” I say softly. “But be rational. Where would we go? What can we discover by running around that Vel and Constance can’t dig out in time?” I shake my head, sad that I have to be the one to point this out. It requires a deep breath and determination for me to go on: “We can’t do this now; we’re committed elsewhere. Your nephew or not, he’s one child. Right now, we’re looking after the fate of the human race. What’s going to happen to that kid if we fail?”\u003c/p\u003e\n\u003cp\u003eFor a moment, I fear he’s too maddened to hear it, then the tension slides out of him in terrible, defeated resignation. I hope to Mary I never see that look on his face again, like an animal that’s been wounded to the point that it expects nothing more.\u003c/p\u003e\n\u003cp\u003e“Good of the many versus the few,” he murmurs. “I’m familiar with the concept. He’s probably fine, whatever Psi-Corp training facility he wound up in.”\u003c/p\u003e\n\u003cp\u003e“With the war on, he’s better off on New Terra for now.” I pitch my voice low, trying not to show how much it hurts that I can’t wave a hand and fix this for him. “When we fight through, we’ll find him, I swear, and make sure he’s all right.”\u003c/p\u003e\n\u003cp\u003e“And take Baby-Z home,” he says bitterly. At my shock, he adds, “Oh, I know all about dreams deferred. But how much do we have to sacrifice before we’re done?”\u003c/p\u003e\n\u003cp\u003eThe question leaves me uneasy because I truly fear the answer.\u003c/p\u003e\n\u003cp\u003e.CLASSIFIED-TRANSMISSION.\u003c/p\u003e\n\u003cp\u003e.FIRST STATUS REPORT.\u003c/p\u003e\n\u003cp\u003e.FROM-EDUN_LEVITER.\u003c/p\u003e\n\u003cp\u003e.TO-SUNI_TARN.\u003c/p\u003e\n\u003cp\u003e. ENCRYPT-DESTR UCT-ENABLED.\u003c/p\u003e\n\u003cp\u003eRecruitment and War Effort\u003c/p\u003e\n\u003cp\u003eThe campaign is going well. As Minister of Diplomatic Relations, I have access to all documents. At this time, we have nearly ten thousand bodies willing to go to war. The shipyards have started production, and the vessels will be built by the time the volunteers have completed their basic training. Allotment of seized Farwan resources should be sufficient to cover the first year of salary for all of these men, but alternate sources of income will need to be found. A recommendation on tariffs is attached. Said policy should not be implemented until the war is won. Should the war take longer than one year, other measures will need to be employed.\u003c/p\u003e\n\u003cp\u003eSyndicate Activity\u003c/p\u003e\n\u003cp\u003eSigma Psi has the highest concentration of activity. A cadre of at least twenty ships hunts this sector; they appear to be interested in the same type of cargo though they are not above jacking whatever wanders into their web. In main, they target supply ships. By now the colonies are feeling the pinch, and a rescue mission here would go a long way toward repairing the Conglomerate public image.\u003c/p\u003e\n\u003cp\u003eSuch a coordinated effort is unusual in independent raiders; therefore, it stands to reason that this group is affiliated with or contracted to the Syndicate. To date, these twenty ships account for 67% of all lost lives and loss of property in this region. Ship names and identification numbers are attached. Routes and plans will follow once I confirm the intelligence. You should feed this information to your commander, so he can schedule patrols accordingly.\u003c/p\u003e\n\u003cp\u003eRaiders\u003c/p\u003e\n\u003cp\u003eSince Hon-Durren went underground after the destruction of DuPont Station, they lack a unifying figure. Consequently, they’ve devolved into a disorganized group of thugs and ruffians. Their threat levels are insignificant compared to other factions in play. At best, they account for 15% loss of life over several galaxies. Because of limited resources, I suggest they are a minimal threat and should be recruited whenever possible.\u003c/p\u003e\n\u003cp\u003eThe Morgut\u003c/p\u003e\n\u003cp\u003eAll signs indicate they are mustering at a level we’ve never seen before. This is not a minor conflict. By my next report, I will be able to confirm whether I currently hold a piece of Morgut technology. They rarely permit their vessels to be taken. If it looks as though they will lose a conflict, sources report that the Morgut destroy their own ships to prevent their technology from falling into our hands.\u003c/p\u003e\n\u003cp\u003eI have pinpointed the location of their homeworld with reasonable surety, and all signs indicate this migration is not random chance but a calculated maneuver, a movement in some larger pattern. Experts state that this surge in Morgut activity indicates a great exodus. They do not plan on returning home again.\u003c/p\u003e\n\u003cp\u003eAgainst human beings, the Morgut have a 97% kill rate. This statistic includes both ship-to-ship combat and hand-to-hand encounters. More alarming, heretofore it has not seemed to matter whether they were facing a trained soldier or a civilian. A file detailing their physiological vulnerabilities is attached.\u003c/p\u003e\n\u003cp\u003eAccording to ancient Ithtorian writings, dating from before the Axis Wars, the Morgut are known to have four castes: workers, drones, hunters, and queens. More information is needed in order to properly assess the threat levels of each. I posit that the hunters are the ones currently terrorizing our colonies while the others move in once the local populace has been cleared and devoured. As to how this pattern works long term, I can only speculate.\u003c/p\u003e\n\u003cp\u003eOne of my experts has synthesized a toxin he posits will reproduce the effects induced by contact with Ithtorian blood. Cost analysis of mass-producing said toxin follows, including components required. You will wish your troops equipped with it.\u003c/p\u003e\n\u003cp\u003eTo date, information on the Morgut has been scarce. They are not a social race, except among their own kind. They are not hive-mind like the Jhihezu. To the best of my research, they exist to eat, breed, and claim territory. Their instincts seem primitive, but what we understand of their technology demonstrates they have capabilities superior to ours. Agents have retrieved miscellaneous apparatus from a dealer in such rarities, and analysis will tell us more.\u003c/p\u003e\n\u003cp\u003eThis concludes my initial report. Please review the information and advise where you would like to focus our resources.\u003c/p\u003e\n\u003cp\u003e.ATTACHMENT-RAIDER_SHIPS-FOLLOWS.\u003c/p\u003e\n\u003cp\u003e.ATTACHMENT-PHYSIOLOGICAL_VULNERABILITIES-FOLLOWS.\u003c/p\u003e\n\u003cp\u003e.END-TRANSMISSION.\u003c/p\u003e\n\u003cp\u003e. COPY-ATTACHMENTS.\u003c/p\u003e\n\u003cp\u003e.FILES-DOWNLOADED.\u003c/p\u003e\n\u003cp\u003e. ACTIVATE-WORM: Y/N?\u003c/p\u003e\n\u003cp\u003e.Y.\u003c/p\u003e\n\u003cp\u003e.TRANSMISSION-DESTROYED.\u003c/p\u003e\n\u003cp\u003eCHAPTER 16\u003c/p\u003e\n\u003cp\u003eMarch doesn’t come to me this evening.\u003c/p\u003e\n\u003cp\u003eI tell myself he’s working, and it has nothing to do with my refusal to let him veer off from our mission to go looking for his nephew. In this, I’m playing the bad guy, and I don’t like it. My heart is heavy, and sleep brings unquiet dreams. I can’t remember what they were, but I know I was running from something.\u003c/p\u003e\n\u003cp\u003eThe space is cool and empty when I wake.\u003c/p\u003e\n\u003cp\u003eAfter breakfast, I check in with the kids we saved. It doesn’t seem fair for Rose to be stuck on nanny detail, though when I step into the dormitory, she doesn’t seem to mind. Seven small faces turn my way, as I’ve interrupted a story.\u003c/p\u003e\n\u003cp\u003eI wave to show she should continue, so she does. I sit down at the back of the dorm. It’s some legend I’ve never heard before, so I listen with as much interest as the children.\u003c/p\u003e\n\u003cp\u003e“Then Pyotr jabbed the pin into the giant’s foot. The beast cried out in pain and hopped around, but what the giant didn’t realize was—” She looks at the kids as if inviting them to guess.\u003c/p\u003e\n\u003cp\u003e“He was standing in front of a big hole!”\u003c/p\u003e\n\u003cp\u003e“There was a warrior behind him with a sword.”\u003c/p\u003e\n\u003cp\u003e“He was at the edge of a volcano!”\u003c/p\u003e\n\u003cp\u003eThey vie for her attention and her smiles for a good five minutes. By the time Rose finishes the tale of Pyotr and the Giant, they’re cheering wildly. From their reactions, I gather there have been more tales about this particular hero prior to today.\u003c/p\u003e\n\u003cp\u003eWhen the kids notice me at the back of the room, they go from exuberant to timid, then a girl recognizes me. “You were with the people who took us off the bad ship.”\u003c/p\u003e\n\u003cp\u003eI nod. “How are you guys doing?”\u003c/p\u003e\n\u003cp\u003eHer pointed chin dips. “I want to go home.”\u003c/p\u003e\n\u003cp\u003e“I know. As soon as we can locate your parents, we’ll take you.”\u003c/p\u003e\n\u003cp\u003eA little boy gazes up at me, eyes wide. “So you’re not going to sell us?”\u003c/p\u003e\n\u003cp\u003e“Sell you . . . No, of course not.” Mary curse it, he must’ve heard the slavers talking. “Did you hear something on the bad ship?”\u003c/p\u003e\n\u003cp\u003eHe nods. “They were talking about the people who ordered us.”\u003c/p\u003e\n\u003cp\u003eThe kids cluster around me, as if I can protect them. And I will. Nobody’s going to hurt them while I’m around.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003eThe oldest child with heartbreakingly knowing eyes—she’s ten, at most—answers, “They had buyers who wanted certain things: blond hair, green eyes, or . . . whatever. The slavers took us because we matched the descriptions.”\u003c/p\u003e\n\u003cp\u003eI don’t need to be told why. Now I’m twice as glad we killed those bastards. They stole these kids because they matched the requests made in some pervert catalogue. I don’t doubt there are serious credits in it. A rich client with no moral compass would be willing to pay outrageous amounts for a perfect little toy.\u003c/p\u003e\n\u003cp\u003eRose says softly, “You’re safe, Hanna. Don’t think about that now.”\u003c/p\u003e\n\u003cp\u003eGood advice, but simply telling the monsters to back off doesn’t always work.\u003c/p\u003e\n\u003cp\u003eThe smallest kid sniffs. “They made us talk on the vid.”\u003c/p\u003e\n\u003cp\u003eA virtual marketplace—horror roils in my stomach. “Is that all?”\u003c/p\u003e\n\u003cp\u003e“They kept us locked up, too,” he answers.\u003c/p\u003e\n\u003cp\u003eRelief trickles in. It could’ve been much worse, but I don’t tell them that. If they have any illusions left after this, I’ll do my best to preserve them.\u003c/p\u003e\n\u003cp\u003e“Has someone taken down all your personal information?” Rose should have by now, but I double-check. \u003c/p\u003e","sourceLink":"https://allnovel.net/killbox-sirantha-jax-4/page-14.html","bookId":1649,"creation":"Oct 5, 2019 6:45:55 PM","modification":"Oct 5, 2019 6:45:55 PM"}
