{"id":99579,"no":21,"title":"Page 21","content":"\u003cp\u003e“You have something in mind?” Hon asks.\u003c/p\u003e\n\u003cp\u003e“Yes.” Without further delay, he tells us.\u003c/p\u003e\n\u003cp\u003eCHAPTER 23\u003c/p\u003e\n\u003cp\u003eThe plan is brilliant in its simplicity.\u003c/p\u003e\n\u003cp\u003eWe listen as Hon comms security. “I want to report suspicious activity on station.”\u003c/p\u003e\n\u003cp\u003eThe agent goes from bored to interested. “What’s happened, sir?”\u003c/p\u003e\n\u003cp\u003e“There’s four men scoping out Rafferty’s right now. I think they might be planning on burgling the place.” He lowers his voice. “They look like Syndicate.”\u003c/p\u003e\n\u003cp\u003eAh, what a lovely marriage of truth and untruth.\u003c/p\u003e\n\u003cp\u003e“What makes you think so?”\u003c/p\u003e\n\u003cp\u003e“I recognize one of them.” Hon makes up some story about seeing one of the creeps in action on Venice Minor.\u003c/p\u003e\n\u003cp\u003e“And who are you?” The agent is logging the call, no doubt, keeping good records. Farwan no longer handles station security, so it’s a private company, and they don’t want to lose the contract. That means they’ll check this out.\u003c/p\u003e\n\u003cp\u003e“I’m the night watchman at Rafferty’s.”\u003c/p\u003e\n\u003cp\u003eWith his Peacemaker units, Mac doesn’t need a humanoid guard on premises, but this rep doesn’t know that. He advises Hon, “Stay inside. I’ll deploy a team immediately.”\u003c/p\u003e\n\u003cp\u003e“I must confess,” Mac says, “this reassures me greatly. Some people look for the hammer-and-nail solution to every problem.”\u003c/p\u003e\n\u003cp\u003eI know what to say. “We won’t risk Evelyn that way as long as there’s another choice.”\u003c/p\u003e\n\u003cp\u003e“Good to know,” she says coolly. “I’m packed and ready. I collect there’s been some difficulty?”\u003c/p\u003e\n\u003cp\u003e“Security should handle it,” Hon tells her.\u003c/p\u003e\n\u003cp\u003eWe watch the external cameras as a full squadron appears on the promenade. They round up our four goons without a shot being fired. I wish I could hear what’s being said, but Rafferty’s cams don’t offer audio. I could guess it goes something like this:\u003c/p\u003e\n\u003cp\u003eAs security arrives: Hey, we’re not doing anything!\u003c/p\u003e\n\u003cp\u003eWe’ll be the judges of that. The agent puts on the cuffs.\u003c/p\u003e\n\u003cp\u003eOne of the Syndicate goons struggles, wearing an outraged look. You can’t do this. Do you know who I work for?\u003c/p\u003e\n\u003cp\u003eThe agent scowls at him. We have questions about why you’re loitering up here after hours. Loitering is a misdemeanor.\u003c/p\u003e\n\u003cp\u003eAnother security guard says, Look, I found concealed weapons. That’s more than a misdemeanor. Let’s go, you. And shoves the thugs toward the transport.\u003c/p\u003e\n\u003cp\u003e“Clear,” Loras says with a faint smile. “Are we ready?”\u003c/p\u003e\n\u003cp\u003eEvelyn gives her uncle a hug, but he forestalls anything more with a raised hand. “Don’t tell me where you’re going or how to contact you. It’ll be safer that way. I can’t spill what I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Do you have something to cover your head?” I ask Evelyn.\u003c/p\u003e\n\u003cp\u003eIn answer, she produces a hat with a low, wide brim. It’s not ideal, but anything larger would draw just as much attention. Mainly I want to cast some doubt as to her identity if any surveillance remains.\u003c/p\u003e\n\u003cp\u003eAs we step out the side door, Hon contacts the Dauntless. “We’re on the move. Keep watch for us.”\u003c/p\u003e\n\u003cp\u003eSmart.\u003c/p\u003e\n\u003cp\u003eDina scouts ahead, making sure the way is clear, as we pass from the promenade into the deserted corridors that connect to the lift, which will carry us to the docks. Though I’d never tell her so, there’s another reason I have her roving ahead. Her limp flares up when she runs, so I want her ahead of us, no risk of her falling behind and being lost.\u003c/p\u003e\n\u003cp\u003eI don’t like the way our footsteps echo. I don’t like the dimmed lights overhead. Oh, I know it’s standard, reducing energy usage during off-hours, but it gives the place a creepy air. Each time we pass a T in the hallway, I feel skittish and exposed. Loras and I keep Evelyn between us while Hon guards our backs. Once, I couldn’t have imagined trusting him there, but he’s proven true to his promise, and I believe he wants to earn back what he lost at Farwan’s hands.\u003c/p\u003e\n\u003cp\u003eSometimes I think I hear footsteps keeping pace with us. Finally, I slide a look at Loras, and whisper, “Can you hear that?”\u003c/p\u003e\n\u003cp\u003e“For the past three minutes,” he confirms. “I can’t tell yet if it’s a threat.”\u003c/p\u003e\n\u003cp\u003e“We should act as if it is,” Evelyn says calmly. “You have a plan?”\u003c/p\u003e\n\u003cp\u003eFight or die doesn’t sound like much of a plan. So I simply nod.\u003c/p\u003e\n\u003cp\u003eHon murmurs, “If we get to the lift, we can make a run for the docks. It’s hard to hit a moving target.”\u003c/p\u003e\n\u003cp\u003eHard, but not impossible. It would be catastrophic if we got Evelyn this close to freedom, then some Syndicate sniper nailed her in the back. I have to make a quick decision. Mary grant it’s a good one.\u003c/p\u003e\n\u003cp\u003e“Let’s make for the lift. There’s only one way to the docks, and if we get down there first, we’ll lay in an ambush.”\u003c/p\u003e\n\u003cp\u003eThe others nod grimly, and we double our pace, catching up to Dina in no time. She’s already at the lift. “Company?” she asks, brow lofting.\u003c/p\u003e\n\u003cp\u003e“Could be,” I answer, as the door opens. “Any activity down this way?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “Dead quiet.”\u003c/p\u003e\n\u003cp\u003eLoras mutters, “Wish you hadn’t put it quite that way.”\u003c/p\u003e\n\u003cp\u003eHe has to be remembering the last time he fled a station with me, but I swear it’s going to end a different way this time. The hallway is still clear as the lift doors begin to close, but I can hear their footsteps. They’ve started to run, abandoning subtlety for speed.\u003c/p\u003e\n\u003cp\u003eShouts echo as we drop, but we don’t get a glimpse of our pursuers, so I’m not sure if it’s more Syndicate or independent raiders looking to sell Evelyn to the highest bidder. Her face is pale, but composed; for a scientist who’s spent most of her time in a lab, she’s amazingly courageous.\u003c/p\u003e\n\u003cp\u003eI’m considering asking her about the ill-starred voyage that left her stranded in the escape pod when the lift starts to open. A misplaced reflection catches the light, and I shout, “Get down!”\u003c/p\u003e\n\u003cp\u003eInstinct guides my reflexes. Dive. We hit the floor as a barrage of laser fire sears the wall behind us. I roll to my belly, weapon in hand, then shoot in a tight burst, singeing the wall, but they’re around the corner toward the dock, popping out to fire, then spinning away before we can hit them. Hon comes up beside me, offering the next volley.\u003c/p\u003e\n\u003cp\u003eFor an instant, I expect March to take command, make everything right, then I realize with a little spurt of horror: I’m in charge here.\u003c/p\u003e\n\u003cp\u003e“Loras, you’ve got to lock the lift down,” I tell him quickly.\u003c/p\u003e\n\u003cp\u003e“Acknowledged.” He sets to work immediately, understanding what’s at stake.\u003c/p\u003e\n\u003cp\u003e“They herded us,” Evelyn bites out.\u003c/p\u003e\n\u003cp\u003eYes, she’s a clever girl. Regardless, we couldn’t have guessed they’d have men already in place down here, unless—\u003c/p\u003e\n\u003cp\u003eNo. I won’t say it aloud. A normal person wouldn’t even consider it, but I have to wonder if Mac Rafferty put credits in his account tonight.\u003c/p\u003e\n\u003cp\u003eAnother volley comes in, white-hot and so close it burns away the hair on my forearm. They’re not interested in parley; I’d guess their instructions are simple. Kill us and take Evelyn. Beside me, Hon doesn’t need to be told to stagger his fire, so that while my weapon is cooling down, he can cover me.\u003c/p\u003e\n\u003cp\u003eThis time, when they duck out to take aim, he nails one in the chest. The stench of charred meat rises from the spasming corpse, and I know a fierce satisfaction. There’s no telling how many there are, though, so we can’t get cocky yet.\u003c/p\u003e\n\u003cp\u003e“Can you use a weapon?” I ask the scientist, firing with the weapon balanced on my forearm for better accuracy.\u003c/p\u003e\n\u003cp\u003eEvelyn manages a smile. “Give me one and find out.”\u003c/p\u003e\n\u003cp\u003eI call to Dina, “Toss her your gun. I need you with Loras. Make sure we don’t end up with enemies up our asses. I don’t want that lift moving until next week.”\u003c/p\u003e\n\u003cp\u003eThere are other lifts to docking, of course, but this one leads directly to the bay where our ship is waiting. If they have to circle around, we’ll be on board and greeting them with antipersonnel rail guns. I spare a smile at the thought.\u003c/p\u003e\n\u003cp\u003eBehind me, I hear the hiss and crackle of them severing electrical connections and expertly rerouting the controls. Evelyn wriggles up on the other side of me and mimics the way my pistol rests on my arm. She takes the next series of shots, and she nails one in the arm as he scrambles for cover, not a kill, but she got his gun arm. Unless he’s ambidextrous, his aim will suffer.\u003c/p\u003e\n\u003cp\u003eI hear them arguing down the hall. They didn’t expect organized resistance; whoever hired them didn’t give them all the information. These thugs expected an easy snatch and grab. Clearly, they don’t know us very well.\u003c/p\u003e\n\u003cp\u003e“We’ve got you pinned down,” I call. “You’ve already lost two men. If you surrender now and beg nicely, I might let you walk away.”\u003c/p\u003e\n\u003cp\u003eHon flashes me a look that says it isn’t going to happen, but they don’t need to know that. I can’t speak for everyone present, after all. I’m just promising not to kill them myself. Silence follows, unbroken by laser fire. They’re talking among themselves.\u003c/p\u003e\n\u003cp\u003e“Maybe you better give up,” someone finally calls. “We have reinforcements on the way. It’s just going to get worse for you.”\u003c/p\u003e\n\u003cp\u003e“Do you?” I ask brightly. “I wonder how that’s possible when we’ve got the lift tied up. They’ll have to come in from the other side, won’t they? Which doesn’t offer you any tactical advantage at all.”\u003c/p\u003e\n\u003cp\u003eInto the silence, Dina calls, “We’re done. It’ll take them days to figure out how to repair this lift.”\u003c/p\u003e\n\u003cp\u003eHon adds, “Whereas we have a crew full of trained raiders on the way from the ship. And they can come up behind you. Do you have a man watching the dock?”\u003c/p\u003e\n\u003cp\u003e“Maybe you want to walk away,” I agree.\u003c/p\u003e\n\u003cp\u003eA curse comes in answer—then we’re back to shooting. I take aim, and a man dies.\u003c/p\u003e\n\u003cp\u003eCHAPTER 24\u003c/p\u003e\n\u003cp\u003eHon covers me while my weapon cools down.\u003c/p\u003e\n\u003cp\u003eA goon leans out, and the pirate captain takes him in the head. His face chars black in the center, the damage raying outward as he falls forward. From around the corner, his mates pull him back out of sight, like we’re going to keep shooting his corpse.\u003c/p\u003e\n\u003cp\u003eI can hear the hushed discussion of what to do. I guess Hon got their leader. Nobody is surprised when they all pop out at once, slamming shots into the floor near us. I scramble back and take cover while Evelyn shoots. She nails one in the shoulder, and his scream echoes down the hallway. If they don’t get him help soon, he’ll die of shock.\u003c/p\u003e\n\u003cp\u003eThey fall back and regroup. More whispering. The dying man groans his agony, wordless now. Laser pistols aren’t as cruel as disruptors, but they’re no less lethal. My weapon hums, telling me it’s ready to discharge again. I use the sight and ease onto my stomach, waiting. Movement draws my fire. I miss, but this won’t end until we kill them.\u003c/p\u003e\n\u003cp\u003eI didn’t start this, but we’ll finish it.\u003c/p\u003e\n\u003cp\u003eThe fight turns into a slaughter. By the time we’re done, Hon has killed four, I dropped two, and Evelyn accounted for the one she took in the shoulder. Though I’d have expected her to be troubled by it, she seems to want off this station too much to let shock take hold of her. Since she’s been trapped here for a while, I don’t blame her. \u003c/p\u003e","sourceLink":"https://allnovel.net/killbox-sirantha-jax-4/page-21.html","bookId":1649,"creation":"Oct 5, 2019 6:45:55 PM","modification":"Oct 5, 2019 6:45:55 PM"}
