{"id":101080,"no":40,"title":"Page 40","content":"\u003cp\u003e“Are you getting this?” I ask Drake.\u003c/p\u003e\n\u003cp\u003e“Sure am,” he breathes. “What does it mean?”\u003c/p\u003e\n\u003cp\u003eI shush him because there’s more, and when I understand the rest of the message, courtesy of the chip, my blood runs cold.\u003c/p\u003e\n\u003cp\u003eCHAPTER 43\u003c/p\u003e\n\u003cp\u003eWe’re back on our ship, assembled in the officers’ lounge.\u003c/p\u003e\n\u003cp\u003eThough he’s not of appropriate rank, Drake has been allowed to stay, courtesy of being present when I made the discovery. He takes the chip from the vid and pops it into the terminal while the others get comfortable. Our team is small: March, Doc, Dina, a clansman named Birrick, and me. Doc studies my grim-faced expression as I stand, fingers laced behind my back.\u003c/p\u003e\n\u003cp\u003e“Start it,” I tell Drake.\u003c/p\u003e\n\u003cp\u003eThe image is no better at one remove, but the sound is clear enough. I let it play through all the way. I’ve watched the thing so many times—wanting to be sure my chip always offers the same meaning—that I can recite the translation from memory.\u003c/p\u003e\n\u003cp\u003e“Is it a message of some kind?” Doc asks. “How does this help us?”\u003c/p\u003e\n\u003cp\u003e“Because I understand it.” I hold up a hand, forestalling questions. “Among other things, this message provides coordinates, listing the sites scheduled for attack.”\u003c/p\u003e\n\u003cp\u003eDina breathes, “So it’s not random.”\u003c/p\u003e\n\u003cp\u003e“LC, I want those locations pinned down at once. We need to get the information out to the rest of the fleet.”\u003c/p\u003e\n\u003cp\u003eFleet. That word is laughable to describe the number of ships we can bring to bear, now that I know what we’re up against. I feel sick. I don’t want to be the bearer of these tidings, not when we seemed to be doing so well. But it’s deceptive; the bad news just hadn’t caught up with us yet.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” Drake asks.\u003c/p\u003e\n\u003cp\u003ePerceptive kid. I didn’t even tell him the worst of it.\u003c/p\u003e\n\u003cp\u003e“There’s more,” I say, reluctantly. “It speaks of mustering the red cloud. I don’t think that’s the right word, but it’s the equivalent my chip offered. It doesn’t always find a synonym, so it does the best it can.”\u003c/p\u003e\n\u003cp\u003eMarch stills, studying my face. He’s no longer distracted by the apparent good news of those coordinates. “Do you have any idea what the ‘red cloud’ is?”\u003c/p\u003e\n\u003cp\u003eI close my eyes. “Based on context, I’d have to say it’s their battle fleet. They’re mobilizing at last, no more scout ships.”\u003c/p\u003e\n\u003cp\u003e“How many are we talking about?” Dina asks.\u003c/p\u003e\n\u003cp\u003eIt hurts me to give this answer. “Three thousand.”\u003c/p\u003e\n\u003cp\u003eShaken, Doc breathes, “Mary’s grace.”\u003c/p\u003e\n\u003cp\u003e“In what context did they refer to this red cloud?” March asks, his face closed and cold.\u003c/p\u003e\n\u003cp\u003e“Protecting the colonists, who were to secure the power source.”\u003c/p\u003e\n\u003cp\u003eDina nods. “The uranium, of course.”\u003c/p\u003e\n\u003cp\u003e“Yes, that’s what I thought. It spoke of the final phase of a mass migration, too. This red cloud will carry all the Morgut from their homeworld. It didn’t say why.”\u003c/p\u003e\n\u003cp\u003e“A cataclysmic event,” Doc offers.\u003c/p\u003e\n\u003cp\u003eMarch shakes his head. “I don’t care why. We have to deal with the what.”\u003c/p\u003e\n\u003cp\u003eThere’s nothing for it, except that I must relay the rest. “One more thing. It reassured the colonists they would be safe, reporting the destruction of six Armada ships.”\u003c/p\u003e\n\u003cp\u003eI don’t have to point out the calamity of that. On the brink of the worst war in human history, we now have nine ships left to us. Nine. And that’s assuming the Dark Tide is factored into that six; otherwise, we’re down to eight. Eight, against three thousand. It’s laughable and hopeless.\u003c/p\u003e\n\u003cp\u003eThough Tarn has the shipyards going and he’s training volunteers, they can’t make up the difference. Not in time.\u003c/p\u003e\n\u003cp\u003e“We need to muster,” March says. “I’ll bounce an order for a meet. We have to pool our resources and our strategy. I’ll also ask Tarn to push to finalize the contract with the gray men. We need them.”\u003c/p\u003e\n\u003cp\u003eI shiver. It’s true; we do. But I don’t like what it portends.\u003c/p\u003e\n\u003cp\u003e“And I need to work on the other ships,” Dina adds. “I took something from the Morgut engine room. I’ve never seen the like before, but I have a feeling the design lets the nav com interface with the phase drive, permitting a direct jump.”\u003c/p\u003e\n\u003cp\u003e“You’ll test it on ours first?” I ask.\u003c/p\u003e\n\u003cp\u003eThey don’t seem to be feeling the same weight I am. They want to pretend we have a chance. But what choice do we have? The alternative is to cede our lands and our lives to the Morgut without a fight.\u003c/p\u003e\n\u003cp\u003eShe nods. “As soon as we’re finished here, I’m going to work on it.”\u003c/p\u003e\n\u003cp\u003eI glance at March. “Are we done?”\u003c/p\u003e\n\u003cp\u003e“Dismissed. LC, if I could have a moment?”\u003c/p\u003e\n\u003cp\u003eGreat, he wants a private chat. That’s the last thing I want or need. But I nod as the rest file out of the lounge. Once the door has closed, he closes the distance between us.\u003c/p\u003e\n\u003cp\u003e“How can you talk to the Morgut? What’s going on with you?”\u003c/p\u003e\n\u003cp\u003eIn cool tones, I explain, just as I did with Dina, and conclude, “At least, that’s my theory. When you’re chock-full of experimental tech, there are no absolutes. Who knows what Dasad’s nanites are doing to my brain? I might not even be myself this time tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Jax.” His dark eyes reflect pure torment because he doesn’t have the right to comfort me.\u003c/p\u003e\n\u003cp\u003e“Is there anything else, Commander? I need to bounce a message before we jump.”\u003c/p\u003e\n\u003cp\u003eWe’re abandoning the people of Sigma Psi. Guilt stings me, but if we don’t regroup, we’ll be the only Armada ship left, with three thousand Morgut vessels gunning for us. March knows what he’s doing in this regard. If anyone knows about fighting impossible wars, it’s him. Maybe he can win this one, too.\u003c/p\u003e\n\u003cp\u003eBut I don’t have any hope. Even in that cell on Perlas, despair didn’t own me so fully. Now I see humanity caught amid endless night with no promise of sunrise.\u003c/p\u003e\n\u003cp\u003e“I’ll expect you in the cockpit in a quarter turn. Dismissed, LC.” He faces away, but not before I glimpse the pain thrumming through him. The need to touch forces me to curl my fingers into fists, so I won’t reach out.\u003c/p\u003e\n\u003cp\u003eI wonder whether I’m going to die—this time forever—without ever hearing him say my name again. Is this how it ends? Marshaling my strength, I go from the officers’ lounge, my tears frozen into a hard knot inside me. To my surprise, Argus is waiting, and he falls in step beside me.\u003c/p\u003e\n\u003cp\u003e“Are you all right?”\u003c/p\u003e\n\u003cp\u003eI’d forgotten how well he knows me, courtesy of sharing mind-space in the simulator and the nav com. There comes a point when familiarity crosses into empathy. I used to know when Kai was sad, even if he was somewhere else. At the moment, March is actively blocking me—a kindness—or I’d feel too much of his pain.\u003c/p\u003e\n\u003cp\u003eI shake my head. “Nobody is.”\u003c/p\u003e\n\u003cp\u003e“They won’t tell me what’s going on.”\u003c/p\u003e\n\u003cp\u003e“It would start a panic,” I say quietly. “You’ll get the bad news soon enough. I recommend you spend some time with that cute blond cadet.”\u003c/p\u003e\n\u003cp\u003e“Now I’m really worried.”\u003c/p\u003e\n\u003cp\u003eI stop outside my quarters and eye him. And I decide to be straight with him. “You should be. Go.”\u003c/p\u003e\n\u003cp\u003eThe apprentice jumper does as I ask, but not without a last, speaking glance. He wanted me to tell him, but I’ve carried enough bad news for one day. Now I’m about to do something I swore I never would, but it looks like hell has frozen.\u003c/p\u003e\n\u003cp\u003eRecognizing me, my door swishes open. My quarters are beige and impersonal, but it’s a place to rest. More important, it offers some privacy. If Rose checks the outgoing messages, I’ll have some explaining to do, but by then it will be too late.\u003c/p\u003e\n\u003cp\u003eI sit down at the terminal. “Computer, record on.”\u003c/p\u003e\n\u003cp\u003e“Acknowledged.”\u003c/p\u003e\n\u003cp\u003eI still have her private comm code, though I knew her by another name when I received it. So I speak the numbers aloud, encrypting it for her eyes only. “It’s time to set aside our differences,” I say, gazing directly into the vid as if it were my mother’s eyes. “I do not believe even you will wish to persist in profiteering in the face of a threat this vast.”\u003c/p\u003e\n\u003cp\u003eIn even tones, I summarize what we face in the red cloud and the mass Morgut migration. “You can attempt to validate this information, but in the end, you know what this means. No world is safe. To have any hope of preserving your empire, you must commit your resources to the defense of humanity. All Syndicate attacks must cease. You must turn your eyes to the true enemy, our shared enemy. If you agree, contact me on this code, and I will provide you information as to where we can meet.”\u003c/p\u003e\n\u003cp\u003eShe might think it’s a trap, at first, but in truth it’s nothing so cunning. Only desperation would have driven me to speak those words and ask her help. Only that.\u003c/p\u003e\n\u003cp\u003eIt takes me a few moments to get myself together enough to face March again, but within the allotted time, I report to the cockpit. That’s when I learn the location of what may be the last human summit.\u003c/p\u003e\n\u003cp\u003eIt’s New Terra, of course. That planet represents every proud and shining moment in human history: how we came from a dying world, one choked with pollution, global warming, and acid rain. After one hundred years of voyaging, the generation ship delivered our forefathers safely to New Terra, where we built things anew with no help from anyone. It’s an inspiring story—and so, of course, it is there we must go, carrying precious little hope.\u003c/p\u003e\n\u003cp\u003eWithout speaking, I settle into the nav chair.\u003c/p\u003e\n\u003cp\u003eCHAPTER 44\u003c/p\u003e\n\u003cp\u003eDina’s done it, finally.\u003c/p\u003e\n\u003cp\u003eI can tell as soon as we jack in. There’s a clear connection between the nav com and phase drive, a silver thread of pure grimspace. After examining the Morgut model, she used a biomechanical matrix linked through the nanoprotein strings. To me, it feels like we’re carrying a pocket worm-hole on board, though that’s an imprecise analogy at best.\u003c/p\u003e\n\u003cp\u003eFeels that way to me, too, Argus says.\u003c/p\u003e\n\u003cp\u003eNow the ship isn’t inanimate anymore. In a very basic sense, the Triumph is alive. Doc and Evelyn asked my permission before they did it because they based the biological components on my DNA. It’s weird knowing I’m woven through this ship in minute particles, allowing the direct-jump process. They can—and will—do this to every Armada ship, and any navigator could make it work.\u003c/p\u003e\n\u003cp\u003eI glance at my apprentice. It’s an easy jump from Sigma Psi to New Terra. Why not let him make it? We need another trained jumper who’s familiar with the direct-jump process. It has to be Argus; there’s just nobody else. With the ship technology in place, maybe he doesn’t need nanites. Like me, he has the regulator. Doc and Evelyn have done their best to get him ready.\u003c/p\u003e\n\u003cp\u003eMaybe it’s time.\u003c/p\u003e\n\u003cp\u003eYou handle this one. I’ll be here if you get in trouble.\u003c/p\u003e\n\u003cp\u003eJoy cascades through him, through me. Are you sure?\u003c/p\u003e\n\u003cp\u003ePositive. You’re ready.\u003c/p\u003e\n\u003cp\u003eWe don’t need to switch seats. As long as I ease back into observational mode, he can take control of the jump from his training chair. I’m going to let him.\u003c/p\u003e\n\u003cp\u003eMarch seems startled to find Argus in charge when he jacks in, but he doesn’t protest. Most likely he could track my train of thought in coming to this conclusion. So he’ll know why I’m letting Argus do this here, now. \u003c/p\u003e","sourceLink":"https://allnovel.net/killbox-sirantha-jax-4/page-40.html","bookId":1649,"creation":"Oct 5, 2019 9:57:10 PM","modification":"Oct 5, 2019 9:57:10 PM"}
