{"id":69117,"no":24,"title":"Page 24","content":"\u003cp\u003eCarol stood in the center of his living room, staring out the window at the panorama of the city. Steve had the impression, though, that she wasn’t really looking at the view.\u003c/p\u003e\n\u003cp\u003e\"Would you like something to drink?\" he asked when she didn’t speak immediately.\u003c/p\u003e\n\u003cp\u003e\"No thanks… this will only take a moment.\"\u003c/p\u003e\n\u003cp\u003eNow that he’d found his bearings, Steve forced himself to relax.\u003c/p\u003e\n\u003cp\u003e\"I was in to see Dr. Stewart this afternoon,\" she said, and her voice pitched a little as if she were struggling to get everything out. \"He…he told me how you were with me after the surgery.\"\u003c/p\u003e\n\u003cp\u003e\"Listen, Carol, if you’ve come to thank me, it isn’t necessary. If you’d told me who the baby’s father is, I would have gone for him. He could have stayed with you, but – \"\u003c/p\u003e\n\u003cp\u003e\"I lied,\" Carol interrupted, squaring her shoulders.\u003c/p\u003e\n\u003cp\u003eHe let her words soak into his mind before he responded. \"About what?\"\u003c/p\u003e\n\u003cp\u003e\"Marrying the baby’s father. I told you that because I was so hurt by what you’d said.\"\u003c/p\u003e\n\u003cp\u003e\"What I’d said?\" He couldn’t recall doing or saying anything to anger her. The fact was, he’d done everything possible to show her how much he loved and cared about her.\u003c/p\u003e\n\u003cp\u003e\"You suggested it would be better if I did lose this child,\" she murmured, and her voice trembled even more, \"because next time you could be certain you were the father.\"\u003c/p\u003e\n\u003cp\u003eShe seemed to want him to respond to that.\u003c/p\u003e\n\u003cp\u003e\"I remember saying something along those lines.\"\u003c/p\u003e\n\u003cp\u003eCarol closed her eyes as if her patience was depleted and she was seeking another share. \"I couldn’t take any more of your insults, Steve.\"\u003c/p\u003e\n\u003cp\u003eEverything he said and did was wrong when it came to Carol. He wanted to explain, but doubted that it would do any good. \"My concern was for you. Any husband would have felt the same way, pregnancy or no pregnancy.\"\u003c/p\u003e\n\u003cp\u003e\"You aren’t my husband.\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to be.\"\u003c/p\u003e\n\u003cp\u003e\"That was another insult!\" she cried, and a sheen of tears brightened her eyes.\u003c/p\u003e\n\u003cp\u003e\"My marriage proposal was an insult?\" he shouted, hurt and stunned.\u003c/p\u003e\n\u003cp\u003e\"Yes… no. The offer to leave the Navy was what bothered me most.\"\u003c/p\u003e\n\u003cp\u003e\"Then far be it from me to offend you again.\" There was no understanding this woman. He was willing to give up everything that had ever been important to him for her sake, and she threw the offer back in his face with some ridiculous claim. To hear her tell it, he’d scorned her by asking her to share his life.\u003c/p\u003e\n\u003cp\u003eThe silence stretched interminably. They stood only a few feet apart, but the expanse of the Grand Canyon could have stretched between them for all the communicating they were doing.\u003c/p\u003e\n\u003cp\u003eThe problem, Steve recognized, was that they were both so battle scarred that it was almost impossible for them to talk to each other. Every word they muttered became suspect. No subject was safe. They weren’t capable of discussing the weather without finding something to fight about.\u003c/p\u003e\n\u003cp\u003e\"I didn’t come here to argue with you,\" Carol said in weary, reluctant tones. \"I wanted to thank you for everything you did. I apologize for lying to you – it was a rotten thing to do.\"\u003c/p\u003e\n\u003cp\u003eIt was on the tip of his tongue to suggest that he’d gotten accustomed to her lies, but he swallowed the cruel barb. He’d said and done enough to cause her pain in the last couple of years – there was no reason to hurt her more. He would only regret it later. She would look at him with those big blue eyes of hers and he would see all the way to her soul and know the agony he viewed there was of his making. Her look would haunt him for days afterward.\u003c/p\u003e\n\u003cp\u003eShe turned and started to walk away, and Steve knew that if he let her go there would be no turning back. His heart and mind were racing. His heart with dread, his mind with an excuse to keep her. Any excuse.\u003c/p\u003e\n\u003cp\u003e\"Carol – \"\u003c/p\u003e\n\u003cp\u003eAlready she was at the front door. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I… have you eaten?\"\u003c/p\u003e\n\u003cp\u003eHer brow creased, as if food was the last thing on her mind. Her gaze was weary as though she couldn’t trust him. \"Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Would you like to go out with me? For dinner?\"\u003c/p\u003e\n\u003cp\u003eShe hesitated.\u003c/p\u003e\n\u003cp\u003e\"The last time you were at the apartment, you said something about a restaurant you wanted to try close to here,\" he said, reminding her. She’d come to his place with a silly button in her hand and lovemaking on her mind. Things had been bad between them then, and had gone steadily downhill ever since.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"The Mexican Lindo.\"\u003c/p\u003e\n\u003cp\u003e\"Shall we?\"\u003c/p\u003e\n\u003cp\u003eStill she didn’t look convinced. \"Are you sure this is what you want?\"\u003c/p\u003e\n\u003cp\u003eNow it was his turn to nod. He wanted it so much he could have wept. \"Yes, I want this,\" he admitted.\u003c/p\u003e\n\u003cp\u003eSome of the tiredness left her eyes and a gentle smile touched her lovely face. \"I want it, too.\"\u003c/p\u003e\n\u003cp\u003eSteve felt like leaping in the air and clicking his heels. \"I’ll be just a minute,\" he said hurriedly. He walked into his kitchen and with a quick twist of his wrist, he turned off the oven. He would toss the aluminum meal later.\u003c/p\u003e\n\u003cp\u003eFor now, he had a dinner date with the most beautiful woman in the world.\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eElaborately decorated Mexican hats adorned the white stucco walls of the restaurant. A spicy, tangy scent wafted through the dining area as Carol and Steve read the plastic-coated menu.\u003c/p\u003e\n\u003cp\u003eSteve made his decision first.\u003c/p\u003e\n\u003cp\u003e\"Cheese enchiladas,\" Carol guessed, her eyes linking with his.\u003c/p\u003e\n\u003cp\u003e\"Right. What are you going to have?\"\u003c/p\u003e\n\u003cp\u003eShe set aside the menu. \"The same thing – enchiladas sound good.\"\u003c/p\u003e\n\u003cp\u003eThe air between them remained strained and awkward, but Carol could sense how desperately they were each trying to ignore it.\u003c/p\u003e\n\u003cp\u003e\"How are you feeling?\" Steve asked after a cumbersome moment of silence. His eyes were warm and tender and seemed to caress her every time he looked in her direction.\u003c/p\u003e\n\u003cp\u003e\"A thousand times better.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I’m glad.\" He lifted the fork and absently ran his fingers down the tines.\u003c/p\u003e\n\u003cp\u003e\"Dr. Stewart asked me to give you his regards,\" Carol said in an effort to make conversation. There were so few safe topics for them.\u003c/p\u003e\n\u003cp\u003e\"I like him. He’s got a lot of common sense.\"\u003c/p\u003e\n\u003cp\u003e\"The feeling’s mutual – Dr. Stewart couldn’t say enough good things about you.\"\u003c/p\u003e\n\u003cp\u003eSteve chuckled. \"You sound surprised.\"\u003c/p\u003e\n\u003cp\u003e\"No. I know the kind of man you are.\" Loving, loyal, determined, proud. Stubborn. She hadn’t spent five years of her life married to a stranger.\u003c/p\u003e\n\u003cp\u003eThe waitress came to take their order, and returned a couple of minutes later with a glass of milk for Carol and iced tea for Steve.\u003c/p\u003e\n\u003cp\u003e\"I’m pleased we have this opportunity to talk before I’m deployed,\" he said, and his hand closed around the tall glass.\u003c/p\u003e\n\u003cp\u003e\"When will you be leaving?\"\u003c/p\u003e\n\u003cp\u003e\"In a couple of weeks.\"\u003c/p\u003e\n\u003cp\u003eCarol nodded. She was nearly six months pregnant now and if Steve was at sea for the usual three, he might not be home when the baby was born. It all depended on when he sailed.\u003c/p\u003e\n\u003cp\u003e\"I used to hate it when you went to sea.\" The words slipped from her lips without thought. She hadn’t meant to make a comment one way or the other about his tour. It was a part of his life and one she had accepted when she agreed to marry him.\u003c/p\u003e\n\u003cp\u003e\"You hated my leaving?\" He repeated her words as though he was certain he’d heard her incorrectly. His gaze narrowed. \"You used to see me off with the biggest smile this side of the Mississippi. I always thought you were happy to get me out of your hair.\"\u003c/p\u003e\n\u003cp\u003e\"That was what I wanted you to think,\" she confessed with some reluctance. \"I might have been smiling on the outside, but on the inside I was dreading every minute of the separation.\"\u003c/p\u003e\n\u003cp\u003e\"You were?\"\u003c/p\u003e\n\u003cp\u003e\"Three months may not seem like a long time to you, but my life felt so empty when you were on the Atlantis.\" The first few years of their marriage, Carol had likened Steve’s duty to his sub to a deep affection for another woman who whimsically demanded his attention whenever she wanted him. It wasn’t until later that she realized how silly it was to be jealous of a nuclear submarine. She’d done everything possible to keep occupied when he was at sea.\u003c/p\u003e\n\u003cp\u003e\"But you took all those community classes,\" he argued, breaking into her thoughts. \"I swear you had something scheduled every night of the week.\"\u003c/p\u003e\n\u003cp\u003e\"I had to do something to fill the time so I wouldn’t go stir crazy.\"\u003c/p\u003e\n\u003cp\u003e\"You honestly missed me?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Steve, how could you have doubted it?\"\u003c/p\u003e\n\u003cp\u003eHe flattened his hands on the table and slowly shook his head. \"But I thought…I honestly believed you enjoyed it when I was away. You used to tell me it was the only time you could get anything accomplished.\" His voice remained low and incredulous. \"My being underfoot seemed to be a detriment to all your plans.\"\u003c/p\u003e\n\u003cp\u003e\"You had to know how I felt, or you wouldn’t have suggested leaving the Navy.\"\u003c/p\u003e\n\u003cp\u003eSteve lowered his gaze and shrugged. \"That offer was for me as much as you.\"\u003c/p\u003e\n\u003cp\u003e\"So you could keep an eye on me – I figured that out on my own. If you held a regular nine-to-five job, then you could keep track of my every move and make sure there wasn’t any opportunity for me to meet someone else.\"\u003c/p\u003e\n\u003cp\u003e\"I imagine you found that insulting.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I don’t know any woman who wouldn’t.\"\u003c/p\u003e\n\u003cp\u003eA heavy silence followed, broken only by the waitress delivering their meals and reminding them that the plates were hot.\u003c/p\u003e\n\u003cp\u003eSteve studied the steaming food. \"I suppose that was what you meant when you said my marriage proposal was an insult?\"\u003c/p\u003e\n\u003cp\u003eCarol nodded, regretting those fiery words now. It wasn’t the proposal, but what had followed that she’d taken offense to. \"I could have put it a little more tactfully, but generally, yes.\"\u003c/p\u003e\n\u003cp\u003eSteve expelled his breath forcefully and reached for his fork. \"I can’t say I blame you. I guess I wasn’t thinking straight. All I knew was that I loved… love you,\" he corrected. \"And I wanted us to get married. Leaving the Navy seemed an obvious solution.\"\u003c/p\u003e\n\u003cp\u003eCarol let that knowledge soak into her thoughts as she ate. They were both quiet, contemplative, but the silence, for once, wasn’t oppressive.\u003c/p\u003e\n\u003cp\u003e\"I dreaded your coming home, too,\" Carol confessed partway through her meal.\u003c/p\u003e\n\u003cp\u003eSteve’s narrowed gaze locked with hers, and his jaw clenched until she was sure he would damage his teeth, but he made no comment. It took her a moment to identify his anger. He’d misconstrued her comments and assumed the worst – the way he always did with her. He thought she was referring to the guilt she must have experienced upon his return. Hot frustration pooled in the pit of her stomach, but she forced herself to remain calm and explain.\u003c/p\u003e\n\u003cp\u003e\"I could never tell what you were thinking when you returned from a deployment,\" she whispered, her voice choked and weak. \"You never seemed overly pleased to be back.\"\u003c/p\u003e\n\u003cp\u003e\"You’re crazy. I couldn’t wait to see you.\"\u003c/p\u003e\n\u003cp\u003e\"It’s true you couldn’t get me in bed fast enough, but I meant in other ways.\"\u003c/p\u003e\n\u003cp\u003e\"What ways?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"For the first few days and sometimes even longer, it was like you were a different man. You would always be so quiet… so detached. There was so little emotion in your voice – or your actions.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/navy-blues-navy-2/page-24.html","bookId":1957,"creation":"Oct 5, 2019 10:12:24 AM","modification":"Oct 5, 2019 10:12:24 AM"}
