{"id":69100,"no":7,"title":"Page 7","content":"\u003cp\u003eSteve shifted his position and completely withdrew his body from hers.\u003c/p\u003e\n\u003cp\u003eCarol felt as if she’d suddenly gone blind; the whole world seemed black and lifeless. She started to protest, started to cry out, but before the sound escaped her throat, Steve sank his manhood back inside her. A shaft of pure light filled her senses once more and she sighed audibly, relieved. She was whole again, free.\u003c/p\u003e\n\u003cp\u003e\"Now,\" Steve told her. \"Now.\" He moved eagerly then, in deep, calculated strokes, plunging into her again and again, gifting her with the sun, revealing the heavens, exploring the universe. Soon all Carol knew was this insistent warm friction and the sweet, indescribable pangs of pleasure. Her body trembled as ripple after ripple of deep, pure sensation pulsed over her, driving her crazy as she remembered what had nightly been hers.\u003c/p\u003e\n\u003cp\u003eBreathless, Steve moved to lie beside her, bringing her into the circle of his arms. An hour passed, it seemed, before he spoke. \"Was it always this good?\"\u003c/p\u003e\n\u003cp\u003eThe whispered question was so low Carol had to strain to hear him. \"Yes,\" she answered after a long, timeless moment. \"Always.\"\u003c/p\u003e\n\u003cp\u003eHe pressed his forehead against the top of her head and moaned. \"I was afraid of that.\"\u003c/p\u003e\n\u003cp\u003eThe next thing Carol was aware of was a muffled curse and the unsettling sound of something heavy crashing to the floor.\u003c/p\u003e\n\u003cp\u003e\"Steve?\" she sat up in bed and reached for a sheet to cover her nakedness. The room was dark and still. Dread filled her – it couldn’t be morning. Not yet, not so soon.\u003c/p\u003e\n\u003cp\u003e\"I’m sorry. I didn’t mean to wake you.\"\u003c/p\u003e\n\u003cp\u003e\"You’re leaving?\" She sent her hand searching for the lamp on the nightstand. It clicked and a muted light filled the room.\u003c/p\u003e\n\u003cp\u003e\"I’ve got the watch today,\" he reminded her.\u003c/p\u003e\n\u003cp\u003e\"What time is it?\"\u003c/p\u003e\n\u003cp\u003e\"Carol, listen,\" he said gruffly, \"I didn’t mean for any of this to happen.\" All the while he was speaking, Steve’s fingers were working the buttons of his shirt and having little success in getting it to fasten properly. \"Call what happened last night what you will – the holiday spirit, a momentary slip in my better judgment… whatever. I’m sure you feel the same way.\" He paused and turned to study her.\u003c/p\u003e\n\u003cp\u003eShe leaned forward, resting her chin on her raised knees. Her heart was in her throat, and she felt shaken and miserable. \"Yes, of course.\"\u003c/p\u003e\n\u003cp\u003eHis mouth thinned and he turned his back to her once more. \"I thought as much. The best thing we can do is put the entire episode out of our minds.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" she answered, forcing some enthusiasm into her voice. It was working out exactly as she’d planned it: they would both wake up in the morning, feel chagrined, make their apologies and go their separate ways once more.\u003c/p\u003e\n\u003cp\u003eOnly it didn’t feel the way she’d anticipated. It felt wrong. Very wrong.\u003c/p\u003e\n\u003cp\u003eSteve was in the living room before she moved from the bed. Grabbing a thin robe from her closet, she slipped into it as she rushed after him.\u003c/p\u003e\n\u003cp\u003eHe seemed to be waiting for her, pacing the entry-way. He combed his fingers through his hair a couple of times before turning to look at her.\u003c/p\u003e\n\u003cp\u003e\"So you want to forget last night?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I… if you do,\" she answered.\u003c/p\u003e\n\u003cp\u003e\"I do.\"\u003c/p\u003e\n\u003cp\u003eCarol’s world toppled for a moment, then quickly righted itself. She understood – it was better this way. \"Thank you for the poinsettia and candy.\" It seemed inappropriate to mention the terrific lovemaking.\u003c/p\u003e\n\u003cp\u003e\"Right.\" His answer was clipped, as though he was eager to be on his way. \"Thanks for the dinner… and everything else.\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\" Stepping around him, Carol opened the door. \"It was good to see you again, Steve.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you, too.\"\u003c/p\u003e\n\u003cp\u003eHe walked out of the house and down the steps, and watching him go did crazy things to Carol’s equilibrium. Suddenly she had to lean against the doorjamb just to remain upright. Something inside her, something strong and more powerful than her own will demanded that she stop him.\u003c/p\u003e\n\u003cp\u003e\"Steve,\" she cried frantically. She stood on tiptoe. \"Steve.\"\u003c/p\u003e\n\u003cp\u003eHe turned around abruptly.\u003c/p\u003e\n\u003cp\u003eThey stared at each other, each battle scarred and weary, each hurting. Each proud.\u003c/p\u003e\n\u003cp\u003e\"Merry Christmas,\" she said softly.\u003c/p\u003e\n\u003cp\u003e\"Merry Christmas.\"\u003c/p\u003e\n\u003cp\u003eThree days after Christmas, Carol was convinced her plan had worked perfectly. Thursday morning she woke feeling sluggish and sick to her stomach. A book she’d been reading on pregnancy and childbirth stated that the best way to relieve those early bouts of morning sickness was to nibble on soda crackers first thing – even before getting out of bed.\u003c/p\u003e\n\u003cp\u003eA burning sense of triumph led her into the bathroom, where she stared at herself in the mirror as though her reflection would proudly announce she was about to become a mother.\u003c/p\u003e\n\u003cp\u003eIt had been so easy. Simple really. One tempestuous night of passion and the feat was accomplished. Her hand rested over her abdomen, and she patted it gently, feeling both proud and awed. A new life was being nurtured there.\u003c/p\u003e\n\u003cp\u003eA baby. Steve’s child.\u003c/p\u003e\n\u003cp\u003eThe wonder of it produced a ready flow of emotion and tears dampened her eyes.\u003c/p\u003e\n\u003cp\u003eAnother symptom!\u003c/p\u003e\n\u003cp\u003eThe book had explained that her emotions could be affected by the pregnancy – that she might be more susceptible to tears.\u003c/p\u003e\n\u003cp\u003eWiping the moisture from the corners of her eyes, Carol strolled into the kitchen and searched the cupboard for saltines. She found a stale package and forced herself to eat two, but she didn’t feel any better than she had earlier.\u003c/p\u003e\n\u003cp\u003eNot bothering to dress, she turned on the television and made herself a bed on the sofa. Boeing workers were given the week between Christmas and New Year’s off as part of their employment package. Carol had planned to spend the free time painting the third bedroom – the one she planned to use for the baby. Unfortunately she didn’t have any energy. In fact, she felt downright sick, as though she were coming down with a case of the flu.\u003c/p\u003e\n\u003cp\u003eA lazy smile turned up the edges of her mouth. She wasn’t about to complain. Nine months from now, she would be holding a precious bundle in her arms.\u003c/p\u003e\n\u003cp\u003eSteve’s and her child.\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eWith his hands cupped behind his head, Steve lay in bed and stared blindly at the dark ceiling. He couldn’t sleep. For the past hour he hadn’t even bothered to close his eyes. It wouldn’t do any good; every time he did, the memory of Christmas Eve with Carol filled his mind.\u003c/p\u003e\n\u003cp\u003eReleasing a slow breath, he rubbed his hand down his face, hoping the action would dispel her image from his thoughts. It didn’t work. Nothing did.\u003c/p\u003e\n\u003cp\u003eHe had never intended to make love to her, and even now, ten days later, he wasn’t sure how the hell it had happened. He continued to suffer from a low-grade form of shock. His thoughts had been in utter chaos since that night, and he wasn’t sure how to respond to her or where their relationship was headed now.\u003c/p\u003e\n\u003cp\u003eWhat really distressed him, Steve realized, was that after everything that had happened between them, he could still want her so much. More than a week later and the memory of her leaning against the doorjamb in the kitchen, wearing his shirt – and nothing else – had the power to tighten his loins. Tighten his loins! He nearly laughed out loud; that had to be the understatement of the year.\u003c/p\u003e\n\u003cp\u003eWhen Carol had stood and held out her arms to him, he’d acted like a starving child offered candy, so eager he hadn’t stopped to think about anything except the love she would give him. Any protest he’d made had been token. She’d volunteered, he’d accepted, and that should be the end of it.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t.\u003c/p\u003e\n\u003cp\u003eOkay, so he wasn’t a man of steel. Carol had always been his Achilles’ heel, and he knew it. She knew it. In thinking over the events of that night, it was almost as though his ex-wife had planned everything. Her red dress with no bra, and that bit about placing decorations on the tree. She’d insisted on standing on the chair, stretching and exposing her thigh to him… his thoughts came to a skidding halt.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eHe wasn’t going to fall into that familiar trap of thinking Carol was using him, deceiving him. It did no good to wade into the muddy mire of anger, bitterness, regret and doubt.\u003c/p\u003e\n\u003cp\u003eHe longed to repress the memory of Carol’s warm and willing body in his arms. If only he could get on with his life. If only he could sleep.\u003c/p\u003e\n\u003cp\u003eHe couldn’t.\u003c/p\u003e\n\u003cp\u003eHis sister, Lindy, had coffee brewed by the time Steve came out of his bedroom. She sat at the table, cradling a cup in one hand while holding a folded section of the Post-Intelligencer in the other.\u003c/p\u003e\n\u003cp\u003e\"Morning.\" She glanced up and greeted him with a bright smile. Lately it seemed his sister was always smiling.\u003c/p\u003e\n\u003cp\u003eSteve mumbled something unintelligible as a means of reply. Her cheerfulness grated against him. He wasn’t in the mood for good humor this morning. He wasn’t in the mood for anything… with the possible exception of making love to Carol again, and that bit of insight didn’t suit him in the least.\u003c/p\u003e\n\u003cp\u003e\"It doesn’t look like you had a good night’s sleep, brother dearest.\"\u003c/p\u003e\n\u003cp\u003eSteve’s frown deepened, and he gave his sister another noncommittal answer.\u003c/p\u003e\n\u003cp\u003e\"I don’t suppose this has anything to do with Carol?\" She waited, and when he didn’t answer, added, \"Or the fact that you didn’t come home Christmas Eve?\"\u003c/p\u003e\n\u003cp\u003e\"I came home.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, sometime the following morning.\"\u003c/p\u003e\n\u003cp\u003eSteve took down a mug from the cupboard and slapped it against the counter with unnecessary force. \"Drop it, Lindy. I don’t want to discuss Carol.\"\u003c/p\u003e\n\u003cp\u003eA weighted silence followed his comment.\u003c/p\u003e\n\u003cp\u003e\"Rush and I’ve got almost everything ready to move into the new apartment,\" she offered finally, and the light tone of her voice suggested she was looking for a way to put their conversation back on an even keel. \"We’ll be out of here by Friday.\"\u003c/p\u003e\n\u003cp\u003eHell, here he was snapping at Lindy. His sister didn’t deserve to be the brunt of his foul mood. She hadn’t done anything but mention the obvious. \"Speaking of Rush, where is he?\" Steve asked, forcing a lighter tone into his own voice.\u003c/p\u003e\n\u003cp\u003e\"He had to catch an early ferry this morning,\" she said, and hesitated momentarily. \"I’m happy, Steve, really happy. I was so afraid for a time that I’d made a dreadful mistake, but I know now that marrying Rush was the right thing to do.\"\u003c/p\u003e\n\u003cp\u003eSteve took a sip of coffee to avoid looking at his sister. What Lindy was actually saying was that she wanted him to find the same contentment she had. That wasn’t possible for him now, and wouldn’t be until he got Carol out of his blood.\u003c/p\u003e\n\u003cp\u003eAnd making love to her Christmas Eve hadn’t helped.\u003c/p\u003e\n\u003cp\u003e\"Well, I suppose I should think about getting dressed,\" Lindy said with a heavy dose of feigned enthusiasm. \"I’m going to get some boxes so Rush and I can finish up the last of the packing.\"\u003c/p\u003e\n\u003cp\u003e\"Where’s your new apartment?\" Steve had been so preoccupied with his own troubles that he hadn’t thought to inquire until now.\u003c/p\u003e\n\u003cp\u003eAs Lindy rattled off the address Steve’s forehead furrowed into a brooding frown. His sister and Rush were moving less than a mile away from Carol’s place. Great! That was the last thing he needed to hear.\u003c/p\u003e\n\u003cp\u003eSteve’s day wasn’t much better than his sleepless night had been. By noon he’d decided he could no longer avoid the inevitable. He didn’t like it, but it was necessary. \u003c/p\u003e","sourceLink":"https://allnovel.net/navy-blues-navy-2/page-7.html","bookId":1957,"creation":"Oct 5, 2019 10:12:24 AM","modification":"Oct 5, 2019 10:12:24 AM"}
