{"id":9929,"no":26,"title":"CHAPTER XXVI. PROFESSOR PUFFER ONCE MORE.","content":"\u0026nbsp;What brings you here, Bernard Brooks?” demanded Professor Puffer sternly. “You have no business in Mr. Cunningham’s room.” \n\u003cdiv\u003e\n “I am in the employ of Mr. Cunningham,” said Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can that be? You are too young to be his valet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been engaged by him as his traveling companion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To say that Professor Puffer was surprised would be too mild. He was absolutely overwhelmed with astonishment. He could not believe it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This must be a falsehood,” he returned after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can stay here and inquire of Mr. Cunningham if you like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will,” said Puffer sternly. “I will let him know in that case that you are under my guardianship, and that I will not permit you to accept the preposterous engagement. You, a traveling companion!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard was not quite withered by the professor’s disdainful tone. Secure in the attachment of Walter Cunningham, all fear of his quondam guardian had disappeared.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You forget, Professor Puffer, that I was your companion,” he said with a smile. “If I was fit to be your companion, I am certainly fit to be his.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were not my companion. You were my ward. You are my ward still, and when I leave this place you must go too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you take away Mr. Cunningham’s traveling companion?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will have no trouble in obtaining a better one. But I don’t believe you have been engaged. He would have no use for a child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say ‘kid’ at once, professor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not use slang,” returned Professor Puffer severely. “I shall wait and see Mr. Cunningham.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will excuse my going on with my work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sorting Mr. Cunningham’s papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he trust you to do that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He requests me to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you actually mean to say that you have been engaged as his traveling companion?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is quite true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you fall in with him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw his advertisement and applied for the place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where were you staying at the time?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the Arundel Hotel, near the Strand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha! And I was only in the next street How did it happen that I did not meet you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If your story is true, which I can hardly believe, what pay has Mr. Cunningham promised to give you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, Professor Puffer, but I would rather not tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As your guardian, I demand an answer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not my guardian. Nothing would induce me to place myself again under your charge. You know very well what reasons I have for fearing and distrusting you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you allude to that little affair on board the Vesta.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That little affair, as you call it, was an attempt to murder me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nonsense!” said the professor, but he did not appear quite at his ease. “You had better not make such a ridiculous charge. No one will believe it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may be mistaken in that, Professor Puffer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When does Mr. Cunningham propose to travel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had better apply to him. I do not feel at liberty to spread his plans.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Professor Puffer felt exceedingly mortified and annoyed. Here was a situation which he had applied for and been refused actually given to a mere boy against whom he felt a grudge—his own ward, as he chose to consider him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t let him keep the place,” said Puffer, shutting his lips firmly. “I will tear him away from this fool of a Cunningham—and when I get him once more into my grasp, I will revenge myself upon him. He won’t find it so easy to get away from me again.” Half an hour passed. The professor maintained his place, looking grim and angry. Bernard handed him the morning issue of the London Times, but he seemed busy with his own reflections, and scarcely glanced at it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally a light step was heard at the door, and Mr. Cunningham entered the room. He looked from the professor to Bernard, and a smile formed upon his face. He guessed what had occurred.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Professor Puffer, I believe?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered the professor. “May I ask you if you have considered my application?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I should have communicated with you. I have engaged Mr. Brooks to be my traveling companion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Brooks!” said the professor scornfully. “Are you aware that this boy is under my guardianship?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I am not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is true, and he has no right to make any engagement without my permission.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, but is this the boy of sixteen to whom you referred in your conversation with me the other day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said that you had been engaged as his traveling companion. You said nothing about being his guardian.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t go into particulars,” replied the professor, who began to see that there would be something to explain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said, however, that he had left you, and had left England with some friends of the family.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ahem! I was mistaken. I have been requested to resume the charge of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you a letter to that effect?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not with me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your story appears inconsistent. I am convinced that you have no claim upon Bernard. I have engaged him as my companion, and intend to take him with me on my proposed journey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of what possible use can a boy be to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my affair!” said Walter Cunningham shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will not permit him to go with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you propose to do about it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will appeal to the law.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think, Professor Puffer, the less you have to do with the law the better. Bernard has informed me of a scene on board the Vesta which might expose you to arrest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t understand what he refers to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I refer to your attempt to throw him overboard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he say that?” asked the professor in pretended amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he has told an outrageous falsehood. No such thing ever took place. He is the worst boy I ever met.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When you were here before you spoke very differently of him. You said he was a very attractive boy, and you referred to his attachment to you. You said he shed tears at parting from you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard burst into a fit of laughter, which only aggravated his old guardian the more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He didn’t deserve it. I spoke of him as well as I could, because I did not want to hurt his reputation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Professor Puffer,” said Walter Cunningham, in a tone of disgust, “I am busy this morning, and I will not detain you any longer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go,” responded the professor, “but not alone. Bernard Brooks, come with me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I decline,” said Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will have recourse to the law.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So will I,” retorted Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No one will believe your preposterous charge, if that is what you refer to. You have no proof.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There you are mistaken. I have the affidavit of Jack Staples, seaman on the Vesta, who saved me from your murderous attack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Puffer turned pale. What Bernard said surprised him very much, and he saw at once that such a document would mean danger to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you want to invoke the law, Professor Puffer, you can do so,” said Mr. Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n Puffer was discreetly silent. He seized his hat and left the room without bidding farewell to Bernard or Walter Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your friend has gone, Bernard,” said Cunningham. “I venture to say that he won’t come back. It is certainly a droll circumstance that you and he should have applied for the same situation and that he was refused.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may repent of your choice, Walter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I do I will tell you. And now, Bernard, I have brought you something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he drew from his pocket a handsome gold watch and chain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I observed that you had no watch,” he said, “and I resolved to supply the deficiency.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can I thank you, Walter?” exclaimed Bernard in joyful excitement. “Of all things it is the one I most desired.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will find it a good one. In such an article as a watch, a cheap one is not desirable. Here is one which you can keep all your life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Before leaving London Bernard wrote the following letter to his friend Barclay:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dear Nat: You may be desirous of hearing from me. I have not time to go into details. I will say, however, that my New York guardian is no friend of mine, but as well as I can make out, a dangerous enemy. He sent me to England in charge of a man named Puffer—he calls himself Professor Puffer—who tried to throw me overboard one dark night. I escaped from him after reaching London and secured a very advantageous situation as traveling companion to a wealthy young man named Walter Cunningham. We start next week for Italy, and I am very busy making preparations. I will write you from Italy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you ever see my dear friend Septimus, and is he as sweet and amiable as ever? I didn’t like his father, but I prefer him to Professor Puffer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your sincere friend,\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bernard Brooks.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2955/81276.html","bookId":434,"creation":"Aug 2, 2019 2:42:15 AM","modification":"Aug 2, 2019 2:42:15 AM"}
