{"id":9930,"no":27,"title":"CHAPTER XXVII. A CITIZEN OF NEBRASKA.","content":"\u0026nbsp;Three months later Bernard and Mr. Cunningham were domiciled in the Hotel Constance in Rome. They had taken a leisurely course from London, staying three weeks in Paris, visiting the interior of France, and spending some weeks in Switzerland and northern Italy. They had now been two weeks in Rome, and used the time to good advantage in visiting the art galleries and the ruins of the ancient city. \n\u003cdiv\u003e\n Bernard had enjoyed everything, and had managed to pick up some conversational Italian. To some extent he had acted as courier for Mr. Cunningham, who had always been accustomed to have things done for him. He found Bernard especially useful, as he had dismissed his servant at Milan. The latter was a stiff-necked Englishman, and was continually getting into trouble from his inability to adapt himself to foreigners and foreign ways.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you ready to leave Rome, Bernard?” asked Walter Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whenever you are,” answered Bernard promptly. “Of course we have not seen all or even a small part of the things worth seeing, but I am tired of sightseeing. I have thought that an independent excursion in our own carriage, not following any prescribed course, but halting where the fancy seizes us, would be enjoyable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like nothing better,” said Bernard enthusiastically. “In what direction do you propose to go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In the general direction of Naples.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am told by an American, who is a guest at this hotel, that there are several routes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true. I have decided to go by way of Frosinone, San Germano, and Capua. The route is said to be very interesting. I wish you would look up a vetturino and arrange to hire him by the day. Then we shall be able to pursue an independent course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do so, Walter. Have you any instructions as to the price?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No: you know from the short excursions we have made what is fair and moderate. You may as well select a vettura that is roomy and large enough to accommodate four persons. We don’t want to be cramped, for that will interfere with our enjoyment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And when do you wish to start?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow morning, say at eleven o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. I will attend to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a great comfort to have you with me, Bernard. You take a great deal of trouble off my hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear you say that. Think how I would be situated if you had not taken me up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been well repaid for doing so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard engaged a vettura, a traveling carriage, designed for four persons, and in an hour it made its appearance. The vetturino, as the driver is called, was a lithe, slender, dark-complexioned man who answered to the name of Pasquale. What his last name was Bernard did not inquire, as it was sufficient to have a single name to call him by.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long will the signor want the vettura?” asked the driver.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know. We will hire it by the day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where will the signor wish to go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To Naples, by way of Valmontone and Frosinone. Do you know the route?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signor, most assuredly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard and Mr. Cunningham seated themselves in the carriage, and they started. They left Rome by the Porta Maggiore, their course being through the Campagna, the dreary and unwholesome tract in the immediate neighborhood of Rome. There was very little to see in the first day’s journey except a ruined aqueduct, which detained them but a short time, and they pushed on to Valmontone, where they arranged to stop over night. The inn was far from satisfactory, and they were not tempted to prolong their stay.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the evening, as they sat on a bench outside the inn, a man of about fifty, wearing a tall white hat, with an unmistakable American look, walked up to them and removing his hat said: “Gentlemen, I’m glad to see you. Allow me to introduce myself. My name is Amos Sanderson, and I live about ten miles from Omaha when I’m at home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to make your acquaintance, Mr. Sanderson,” said Cunningham politely. “I am Walter Cunningham, from London.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t mean to say you’re an Englishman,” said Sanderson, in surprise. “You look like an American.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doubtless that is meant as a compliment,” said Cunningham, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I never heard any one take offense at being taken for an American.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “True. I have been in America, and I understand why it is that you Americans are proud of your country. However, if I am not an American, my young friend here, Bernard Brooks, is an American boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to meet a fellow countryman, Mr. Sanderson,” remarked Bernard, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, well, it does seem real good to meet an American boy,” said Mr. Sanderson, his face lighting up. “Shake, Bernard, my boy!” and he extended a muscular hand, which Bernard shook cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you staying at this hotel, Mr. Sanderson?” asked Walter Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t call it a hotel! It doesn’t deserve the name. Call it a tavern. It’s a regular one horse place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am glad we are only going to stop one night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been here a day and a half, and it’s the longest day and a half I ever passed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did you stay if you didn’t like it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you why. I came here in a small vettura, and I had a quarrel with the vetturino, who tried to cheat. So I sent him off, and was glad to get rid of him, for a man with a more villainous countenance I never saw. I haven’t been able to get another carriage, so here I am. How did you come?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By a vettura. We are making the journey in a leisurely way, going as far or as short a distance daily as we choose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you going?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To Naples.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So am I. Is your vettura a large one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Large enough to hold four persons. We like plenty of room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll make you a proposition. Here I am alone—shipwrecked, as it were, on land. If you will let me join your party I’ll pay my share of the expense. In fact, I don’t mind paying more, for I ain’t mean, though I do hate to be imposed upon. Come now, what do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter Cunningham was rather startled by this unexpected proposal from an utter stranger. It jarred somewhat against his British exclusiveness. Still, there was something attractive in the American, rough and unpolished as he was in his manners, and Cunningham felt that he would amuse and interest them. As far as honesty went it would be impossible to suspect Mr. Sanderson. Besides, he looked like a man of substance and not like an adventurer. Walter Cunningham glanced towards Bernard, and thought he read in the boy’s face a desire that the American’s proposal should be accepted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hardly know what to say,” he replied after a pause. “We do not in general care for the companionship of others, and I can hardly be said to have much knowledge of you—our acquaintance being of the briefest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About ten minutes,” said Mr. Sanderson. “That’s true, and I’m afraid it’s cheeky in me to ask you to take me, but I feel sort of drawn to you both, particularly to my young countryman, Bernard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say no more, Mr. Sanderson. We’ll take you with us as far as Capua, at any rate. There, as it is a large and well known place, you will have no difficulty in making other arrangements.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, squire. You’re a gentleman. You’ll find Amos Sanderson a true friend, that’ll stand by you through thick and thin. If we are attacked by bandits, he won’t run away and leave you in the lurch.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bandits? Surely there is no danger of meeting any of them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, squire, I wish there wasn’t, but I don’t feel certain. Only last week a couple of gentlemen were overhauled, and had to pay a good stiff sum to get away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I supposed the bandits had all been driven out of the country.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s where you are mistaken. There’s people everywhere that find it easier and more agreeable to make money by taking it than by earning it, and I guess Italy has her fair share of such gentry. I’ll tell you a little secret. I quarreled with my vetturino on purpose. His face was a villainous one, and I shouldn’t be at all surprised if he were in league with some of the bandits.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard of such things.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some of these vetturinos” (Mr. Sanderson was not aware that he should have said vetturini) “have brothers or cousins among the bandits and play into their hands. I guess mine was one of that kind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our vetturino Pasquale seems to be an honest sort of fellow. I should not suspect him of leading us into a trap.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2955/81277.html","bookId":434,"creation":"Aug 2, 2019 2:42:18 AM","modification":"Aug 2, 2019 2:42:18 AM"}
