{"id":9933,"no":30,"title":"CHAPTER XXX. IN A TRAP.","content":"\u0026nbsp;They proceeded thus for a short distance, when there was a sudden stop. The vetturino was ordered to descend from the driver’s seat, and he and the bandits had a conference. \n\u003cdiv\u003e\n Bernard was the only one of the party who understood Italian at all, and he failed to get any idea from the rapid words spoken by the four Italians. What they could be talking about not one of the party could conjecture.\n\u003c/div\u003e \n\u003cdiv\u003e\n At length the conference seemed to be over. One of the bandits took out a few scudi and handed them to the vetturino. The latter looked very much dissatisfied and had the appearance of one who was making a bad bargain.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the bandit who had taken the lead came to the door of the carriage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gentlemen, you will descend,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that?” asked the American.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says we are to get out of the carriage,” interpreted Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that for, I wonder?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably we shall find out after a while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When the three travelers had left the carriage their traveling bags were taken from the vettura and placed in their hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Pasquale mounted the box and drove away. “Where are you going, Pasquale?” asked Walter Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am obliged to go. The gentlemen will not allow me to go any further.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you inform the authorities of the outrage that has been perpetrated?” said the American. Pasquale shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be as much as my life is worth,” he replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose,” replied Cunningham, “that the bandits are unwilling to let the vetturino know their headquarters. So they have sent him away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe he is in the plot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think so. He seems an honest sort of fellow. But what can he do single handed? Should he betray these men, it would, as he says, be as much as his life is worth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The captives did not particularly enjoy carrying their baggage, and the American in particular grumbled not a little, but there seemed no help for it.\n\u003c/div\u003e \n\u003cdiv\u003e\n They ascended a rising ground, and then made a descent to a plain. After an hour’s walking, quite spent with fatigue, they reached a large, irregularly built stone house, which was in a state of partial ruin. It was very old, dating back probably to the middle ages.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder whether that is the bandits’ retreat?” said Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “At any rate, it is an improvement upon the hotel where we spent last night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The question was soon settled. Through a doorway the bandits led the way into a courtyard, and; crossing it, one of them took out a huge key and opened an oaken door.\n\u003c/div\u003e \n\u003cdiv\u003e\n He signed to the captives to follow him.\n\u003c/div\u003e \n\u003cdiv\u003e\n They did so, and found themselves in a spacious room nearly twenty-five feet square. The floor was of stone, and it was nearly bare of furniture. In one corner there was a heap of bedclothes. Along one side was a bench, on which Amos Sanderson seated himself without asking permission.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel about ready to drop,” he said. “My valise is as heavy as yours and Bernard’s together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you a dress suit?” asked Bernard, laughing. “If our captors should give a ball in our honor you might need it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It doesn’t seem like a very gay place. I have never been in jail, but this room carries out my idea of a dungeon cell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The room was indeed a gloomy one. There were windows, it is true, but so high up that they only admitted a limited amount of sunshine.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, how long are they going to keep us? That is what I would like to know; and what object have they in detaining us?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose,” said Cunningham, “they will keep us till they get the five thousand scudi.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then they’ll wait a long time, I reckon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The bandits left the room, taking care to fasten the door on the outside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boys,” said Amos Sanderson, “I don’t mind admitting that I have never been more hungry in the whole course of my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard and Walter Cunningham agreed that their feelings harmonized with his.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose we order dinner,” said Bernard humorously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They will be sure to feed us,” observed Cunningham. “They won’t kill the goose from which they expect golden eggs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He proved to be right. In a short time the door was opened, and one of the bandits appeared, bringing a large loaf of black bread, with a small dish of olives, and a supply of macaroni. A quart bottle of sour wine completed the generous collation.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not very tempting. It was worse than, they had fared at any of the poor inns where they had lodged, yet Amos Sanderson’s face brightened when he saw the food, and he did full justice to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am so hungry that I really believe I could eat shoe leather,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard and Walter Cunningham also ate with zest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I suppose they will bring in the bill,” said Amos Sanderson grimly.\n\u003c/div\u003e \n\u003cdiv\u003e\n But when the meal was over they were left to themselves for a time.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now that I have eaten I feel sleepy,” said the American. “I suppose that heap of rags in the corner is meant for a bed. I will make one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He picked up a narrow mattress, which had been rolled up before it was laid away, and spread it out on the floor. Then he selected a quilt, and, stretching himself out, spread it over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That walk with my valise quite tuckered me out,” he said. “Just call me when the carriage is ready.” Bernard and Walter Cunningham could not so readily throw off the burden of anxiety. They sat together upon the bench and discussed the situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are in a bad scrape, Bernard,” said his friend, “and I have led you into it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think we will get out of it after a while,” said Bernard, trying to be cheerful.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; if absolutely necessary, I will persuade Mr. Sanderson to join me in paying the ransom, though I should hate to let these rascals reap the reward of their knavery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They were served with supper at six o’clock. Scarcely was this over when the three bandits entered the room, accompanied by a man of thirty-five or thereabouts, who looked like a clerk or bookkeeper. It was soon evident that he was present as an interpreter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gentlemen,” he said, in tolerable English, “my friends here, who are not acquainted with your language, have asked me to act as interpreter. They wish to confer with you about your release.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the talk,” said Amos Sanderson, with alacrity. “A release is what we are anxious about.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may say that you won’t have to stay here any longer than you desire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we’ll go now, and thank you for your consideration.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Upon conditions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Walter Cunningham smiled. He quite understood that there would be conditions.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you want us to keep your secret,” said the American. “We’ll do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is not quite all,” replied the interpreter. “My friends want to be paid for their trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They needn’t have taken any trouble. We didn’t ask them to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The interpreter frowned slightly. He began to-think Mr. Sanderson “too fresh.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You talk too much,” he said curtly. “They have fixed your ransom at five thousand scudi. That is certainly small for such wealthy and illustrious signors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, my friend, five thousand scudi is a great deal of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not for millionaires.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who said we were millionaires?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All English and American signors are rich.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are we to get the money to pay you? You, or your friends, rather, have taken all we have.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can get some from your bankers in Naples.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seem to have got our affairs down fine. Well, let us go to Naples—you can go with us if you like—-and we’ll, see whether our bankers will let us have the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The signor takes us for fools.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here Mr. Cunningham thought it time to interfere, as the American was likely to anger their captors and upset all negotiations.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even if we have money,” he said, “it would probably be necessary for us to see our bankers. They do not know us, and might not give the money to a messenger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just what I said,” put in Mr. Sanderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bandits conferred together, and then the interpreter spoke again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To whom does the boy belong?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To me,” answered Walter Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he known to your bankers?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. He has never been in Naples.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you fond of him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very much so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he should go to Naples with a letter from you, could he get the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am not sure about your release.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Sanderson, will you join me in paying the ransom this gentleman has mentioned?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I’ll be jiggered if I will!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am afraid you will have to remain here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will pay three thousand scudi we will release you and the boy,” said the interpreter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What, and leave me here?” exclaimed the American.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is your own fault, signor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After considerable conversation a plan was agreed upon, in which Amos Sanderson unwillingly acquiesced.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2955/81280.html","bookId":434,"creation":"Aug 2, 2019 2:42:27 AM","modification":"Aug 2, 2019 2:42:27 AM"}
