{"id":9934,"no":31,"title":"CHAPTER XXXI. WALTER CUNNINGHAM’S MISSION.","content":"\u0026nbsp;It was decided that Cunningham himself should go to Naples, carrying with him not only his own letter of credit, but Amos Sanderson’s as well. He was to draw three thousand scudi on his own account, and two thousand on account of the American, and come back with this sum, on the receipt of which the three would be released. \n\u003cdiv\u003e\n “If you don’t come back,” said the interpreter, “this gentleman and the boy will have to take a long journey.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?” asked Amos Sanderson, with some curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the next world,” answered the interpreter grimly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Cunningham, you will not fail us?” said Sanderson nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may rely on me. What do you take me for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought perhaps when you found yourself at liberty you would choose to remain so. You have no particular interest in me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Even if that were so, do you think I would leave Bernard exposed to danger?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Enough said. I am sure now that you will return. But,” continued the American, who was inclined to be suspicious, “perhaps these gentlemen, when they get the money, will keep us and demand another ransom.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was interpreted to the bandits, who looked angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell the signor,” said the chief proudly, “that we are men of honor. When we give our word we keep it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard that there is honor among thieves,” muttered Sanderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does he say?” asked the chief suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you say, signor?” inquired the interpreter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I said that you looked like men of honor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is well. You will not be disappointed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In half an hour Walter Cunningham was on his way to Naples. The door was again bolted on the outside, and Bernard and Amos Sanderson were left to their reflections.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This ain’t exactly cheerful, Bernard,” said Amos. “Here we are, free born American citizens, locked up as if we were criminals. It ain’t very creditable to any country to have such things going on. I’d like to have a short interview with the king of Italy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would you say to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would I say? I’d give him a piece of my mind. I’d tell him that he didn’t know how to govern.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably he can’t stop this brigandage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he ought to resign, and let somebody fill his place that could stop it. Do you think if old General Jackson were king that he would let these rascals stop and plunder travelers? However, the time will come when there will be a different government.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think so, Mr. Sanderson?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I do.”.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When will that be?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When Italy is under the Stars and Stripes.” Bernard looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely you don’t think that will ever happen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure of it,” said Amos Sanderson, in a positive tone. “It’s the manifest destiny of the United States to annex the rest of the world. Within fifty years England will form a part of the great American republic.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what Mr. Cunningham would say to that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He would deny it, it’s likely. These Britishers are mighty conceited.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he would think it more likely that we should belong to Great Britain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never! England tried to conquer us twice, and she got whipped each time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad of one thing,” said Bernard, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That we shan’t have to stay here till the Stars and Stripes float over Italy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know as I should care to wait, myself. I don’t say it will be soon. You may be an old man before it happens. But it’s bound to come some day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder how soon we may expect Mr. Cunningham back. Do you know how long it will take to go to Naples?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but it isn’t very far. Perhaps we shall see him back in three days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t expect him so soon. He will have to see the bankers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, Bernard,” said the American, after a pause, “I have been thinking that we might find some way of escape.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What good would it do?” he rejoined. “Mr. Cunningham wouldn’t know of it, and he would bring the money. When he does that we shall be released at any rate.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Amos Sanderson was impressed by this consideration, and no longer allowed his mind to dwell on plans of escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meals were served to the captives twice a day. This was probably as often as the bandits ate themselves, for of all nations Italians are perhaps the least fond of the pleasures of the table, and probably eat scarcely more than half as much as an average Englishman or American. They treated their captives as well as themselves, but this did not satisfy Amos Sanderson, who from his boyhood had been a hearty eater.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They might as well feed us on bread and water and be done with it,” he said. “When I get through eating I am just as hungry as before. It’s as bad as prison fare.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Mr. Sanderson, we are prisoners, are we not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But not convicts. They might remember that we are gentlemen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard was not as much disturbed by the scanty fare as his companion. True, he would have liked more abundant meals, but he had patience and reflected that the present inconvenience would probably last only a short time. Nevertheless, he and Amos Sanderson counted the days, and every morning said to each other: “One more day is past. It won’t be long before Mr. Cunningham returns, and we are released.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he does come back,” suggested Sanderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you doubt that he is honorable?” asked Bernard angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, no; but the temptation is great. If he stays away he will be five thousand scudi in, and be his own master besides.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you yield to any such temptation?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you doubt whether he is as honorable as yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t get riled, Bernard. I can’t help thinking how much depends on your friend’s return.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will return. You needn’t be afraid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But when the sixth morning came, and Mr. Cunningham was still absent, even Bernard became somewhat anxious.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, he isn’t here yet,” said the American significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you still have confidence in him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All I can say, then, is that he isn’t hurrying much. Why, it isn’t far to Naples. If I had gone I’ll guarantee I would have been back within three days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bernard did not answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I notice you don’t look so chipper as you did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I have just as much confidence in Mr. Cunningham, but he may have met with some accident.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely,” said Amos Sanderson sarcastically. “Or, he may have fallen into the hands of another gang of bandits on his way here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won’t be very lucky for us if he has. That’s all I’ve got to say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another cause for anxiety. The bandits, who, during the first three or four days, had treated their captives politely and even courteously, now wore a different expression. They looked gloomy and frowned ominously when they entered the apartment where their captives were confined. They made no conversation with them, but their looks were hostile. Finally—it was on the morning of the seventh day—they entered the room in a body, accompanied by the interpreter.\n\u003c/div\u003e \n\u003cdiv\u003e\n They took seats, and the interpreter addressed himself to Mr. Sanderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Signor,” he said, “your friend has not returned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it, and I am blamed sorry for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is the seventh day since he started.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Correct, squire. It seemed as much as seven weeks to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Naples is not far off,” continued the interpreter significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you think he has had time to go there and return?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I do,” blurted out Sanderson. “I think he’s been infernally slow. If you’d only let me go instead of him I’d have been back long ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see the signor agrees with me. He has been gone much longer than is necessary.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think so, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps there has been some accident,” suggested Bernard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My friends are not willing to wait much longer,” said the interpreter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t see that we can do anything to hurry him back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but if he should delay another day it might be very uncomfortable for you and the boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean by that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that if he is not here by to-morrow we will think that he does not mean to come at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The interpreter shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably the signor can conjecture?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will keep us in captivity then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, we will give you a passport to another world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will murder us?” inquired Amos Sanderson, horror-struck, for he had a natural love for the world in which his money secured him a liberal share of enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The signor has said it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, that would be outrageous!” exclaimed the American, big drops of perspiration forming on his forehead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then your friend should come back with the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it won’t be our fault if he does not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “True, but it will be very disagreeable for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, what good is it going to do you to kill me?” asked Amos Sanderson, in an argumentative tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t care to argue. Our friends here wish to prepare you for the worst. If your friend does not appear to-morrow at noon you and the boy must die.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you hear that, Bernard?” asked Sanderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Bernard, in a low voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy’s face was pale, and a feeling of awe was in his heart as he felt that the end of his life might be near. He did not feel inclined to argue the matter like Sanderson, but he inwardly prayed for Walter Cunningham’s return.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2955/81281.html","bookId":434,"creation":"Aug 2, 2019 2:42:31 AM","modification":"Aug 2, 2019 2:42:31 AM"}
