{"id":69750,"no":19,"title":"Page 19","content":"\u003cp\u003e“You left her alone?” Shana’s eyes widened with alarm. “In the kitchen with the stove on? Adam, she’s only nine! Sometimes that’s hard to remember, but she’s still just a kid.”\u003c/p\u003e\n\u003cp\u003e“She seemed perfectly fine,” he said, suddenly deciding Shana was right. “She’s the one who sent me to the store.” He slid out of the booth. “I’ll get back now.”\u003c/p\u003e\n\u003cp\u003eShana sighed, then stretched out one hand and stopped him. “It was good to see you,” she said in a low voice.\u003c/p\u003e\n\u003cp\u003eHe gave her hand a small squeeze. “You, too. Don’t be late for dinner.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” she promised.\u003c/p\u003e\n\u003cp\u003eOnce again Adam started toward the door, then paused and turned around. “What’s her specialty?”\u003c/p\u003e\n\u003cp\u003eShana grinned. “It’s probably canned chili with grated cheese on top.”\u003c/p\u003e\n\u003cp\u003eHe dismissed that. “I think it might be more involved. Whatever it is requires a cookbook.”\u003c/p\u003e\n\u003cp\u003eShana’s grin faded. “In that case, you’d better hurry.”\u003c/p\u003e\n\u003cp\u003e“I’m on my way.”\u003c/p\u003e\n\u003cp\u003eShana smiled again, and it reminded him—as if he needed reminding—how attracted he was to her. And just when their relationship was beginning to show real promise, he’d be leaving the Seattle area.\u003c/p\u003e\n\u003cp\u003eShe followed him to the front door. “Any word on that transfer?” she asked.\u003c/p\u003e\n\u003cp\u003eIf he didn’t know better, he’d think she’d been reading his mind. “Not yet.” It wouldn’t be long, though. Hawaii was a dream assignment. Who wouldn’t want to be stationed there? With its endless miles of white sandy beaches and sunshine, Hawaii had always appealed to him. Yet Seattle, known for its frequent drizzle and gray skies, was of more interest now than the tropical paradise.\u003c/p\u003e\n\u003cp\u003e“Did you mention anything about the transfer to Jazmine?” she asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head. He couldn’t make himself do it.\u003c/p\u003e\n\u003cp\u003e“Coward,” she muttered.\u003c/p\u003e\n\u003cp\u003eAdam shrugged lightly. “Guilty as charged.”\u003c/p\u003e\n\u003cp\u003eShana glanced at her watch. “I’ll be leaving in about an hour and a half.”\u003c/p\u003e\n\u003cp\u003e“Okay, I’ll let Martha Stewart know.” Feeling the need to touch her, he reached for her hand. Even with the restaurant full of customers, they entwined their fingers, and it was a long moment before either of them moved. He felt the urge to take her in his arms and she must have felt the same impulse because she swayed toward him before shaking her head and dropping her hand.\u003c/p\u003e\n\u003cp\u003e“I should get back to work and you need to get back to Jazmine,” she said, her voice little more than a whisper.\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Bye.” Shana gave him a small wave. Adam heard the reluctance in her voice, a reluctance he shared.\u003c/p\u003e\n\u003cp\u003eJazmine met him at the front door, took his bags and banned him from the kitchen. “I can’t be disturbed,” she said grandly.\u003c/p\u003e\n\u003cp\u003eAdam turned the television on again and sat with one ankle balanced on his knee, aiming the remote. He couldn’t find anything he wanted to watch. “Need any help in there?” he called out.\u003c/p\u003e\n\u003cp\u003e“No, thanks.”\u003c/p\u003e\n\u003cp\u003eFive minutes later he repeated the offer.\u003c/p\u003e\n\u003cp\u003eThis time Jazmine ignored him, but soon afterward, she asked, “Aunt Shana isn’t going to be late, is she?”\u003c/p\u003e\n\u003cp\u003e“She’d phone,” Adam said, and hoped she would.\u003c/p\u003e\n\u003cp\u003eAt three minutes after eight, Shana walked into the house. “I’m home,” she said unnecessarily.\u003c/p\u003e\n\u003cp\u003eAdam stood and Jazmine hurried eagerly out of the kitchen. “I hope you’re hungry.”\u003c/p\u003e\n\u003cp\u003e“Famished,” she said.\u003c/p\u003e\n\u003cp\u003eAs if on cue, Adam’s stomach growled.\u003c/p\u003e\n\u003cp\u003eWith a sweeping gesture of her arm, Jazmine invited them into the kitchen. The table was covered with a tablecloth twice the right size. The cloth brushed the floor, and Adam wondered if she’d used a floral printed sheet. The candles were stuck in empty Coke bottles—apparently she hadn’t found real candle-holders—and were positioned on either side of the roses, which she’d arranged in a glass bowl. The effect was surprisingly artful. There were place settings, including wine goblets, in front of the three chairs.\u003c/p\u003e\n\u003cp\u003e“Jazmine!” Shana exclaimed, hugging her niece. “This is absolutely lovely.”\u003c/p\u003e\n\u003cp\u003eThe nine-year-old blushed at the praise and wiped her hands on her apron. “Uncle Adam helped.”\u003c/p\u003e\n\u003cp\u003e“Not much,” Adam protested.\u003c/p\u003e\n\u003cp\u003e“We can start now,” she said with authority. “Please light the candles and pour the champagne. I’m having soda in my glass.”\u003c/p\u003e\n\u003cp\u003eHe bowed slightly. “At your service.”\u003c/p\u003e\n\u003cp\u003e“Everyone, sit down,” Jazmine ordered when he’d finished. She gestured toward the table. “I have an appetizer.” Following that announcement, she brought out a bowl of dry Cheerios mixed with peanuts, raisins and pretzels.\u003c/p\u003e\n\u003cp\u003e“Excellent,” Shana said, exchanging a look with Adam. They both struggled to maintain their composure.\u003c/p\u003e\n\u003cp\u003e“This is only the start,” Jazmine promised, flitting about the kitchen like a parrot on the loose. “I made all our favorites—macaroni and cheese, Tater Tots and salad. Uncle Adam, there’s no tomatoes in your salad and, Aunt Shana, no croutons on yours.”\u003c/p\u003e\n\u003cp\u003eShana’s eyes met Adam’s. “She’s paying attention.”\u003c/p\u003e\n\u003cp\u003e“I’ll say.”\u003c/p\u003e\n\u003cp\u003e“Plus macaroons for dessert,” Jazmine added proudly.\u003c/p\u003e\n\u003cp\u003e“Macaroons?” Adam repeated.\u003c/p\u003e\n\u003cp\u003eJazmine removed the bowl of Cheerios. “Yes, chocolate macaroons. Those are my favorites, so no complaining.”\u003c/p\u003e\n\u003cp\u003eIt was an odd meal, but Adam had no complaints and neither, apparently, did Shana.\u003c/p\u003e\n\u003cp\u003e“We’ll do the dishes,” he said when they’d eaten. The champagne had relaxed him and Shana, too, because they lingered over the last glass while Jazmine moved into the living room.\u003c/p\u003e\n\u003cp\u003e“This really was sweet of her,” Shana whispered.\u003c/p\u003e\n\u003cp\u003e“Very sweet,” Adam agreed. What happened next, he blamed on the champagne. Before he could question the wisdom of it, he leaned close to Shana, intending to kiss her.\u003c/p\u003e\n\u003cp\u003eShe could’ve stopped him, but didn’t. Instead she shut her eyes and leaned toward him, too. The kiss was every bit as good as their first one. No, it was better, Adam decided. In fact, her kisses could fast become addictive—a risk he’d just have to take. He brought his chair closer to Shana’s and she gripped his shirt collar as they kissed again.\u003c/p\u003e\n\u003cp\u003eShe pulled away sometime later and pressed her forehead against his. It took him a moment to find his focus. He savored having her close, enjoyed her scent and the way she felt. Jazmine might see them, but he didn’t care as long as Shana didn’t—and obviously she didn’t.\u003c/p\u003e\n\u003cp\u003e“You two need help in there?” Jazmine called from the living room.\u003c/p\u003e\n\u003cp\u003eLike guilty teenagers, Shana and Adam broke apart. “We’re fine,” Shana answered.\u003c/p\u003e\n\u003cp\u003eAdam wasn’t so sure that was true.\u003c/p\u003e\n\u003cp\u003eSent: July 6\u003c/p\u003e\n\u003cp\u003eFrom:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eTo:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eSubject: My plan is working\u003c/p\u003e\n\u003cp\u003eDear Mom,\u003c/p\u003e\n\u003cp\u003eI cooked dinner all by myself! You know what I like best about Uncle Adam? He doesn’t treat me like a kid. He spent Saturday afternoon with me because Aunt Shana was at the ice-cream parlor and when I told him I was going to cook dinner, he let me. He even went to the store and left me by myself. I don’t need a babysitter anymore.\u003c/p\u003e\n\u003cp\u003eWhen he got back, he said Aunt Shana was upset with him for leaving me all alone, but nothing happened. I made macaroni and cheese in the microwave and baked Tater Tots and made a salad. It turned out really good, and guess what?\u003c/p\u003e\n\u003cp\u003eUncle Adam and Aunt Shana kissed again, and they didn’t even care that I could see them. I pretended I didn’t, but I really did. They said they wanted to wash the dishes and it took them more than an hour. Miss you bunches and bunches.\u003c/p\u003e\n\u003cp\u003eLove,\u003c/p\u003e\n\u003cp\u003eJazmine\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eIf Ali had been at home instead of aboard the USS Woodrow Wilson, she would’ve turned to her favorite comfort food: cookie dough. It was that kind of day. Yes, she knew she shouldn’t eat raw eggs. But when she reached this point—of being prepared to scarf down a bowl of unbaked cookies—salmonella seemed the least of her worries. Those ice-cream manufacturers knew what they were doing when they introduced cookie dough as a flavor. That, in her opinion, was the ultimate comfort food.\u003c/p\u003e\n\u003cp\u003eWhat had upset Ali, or rather who, was none other than Commander Frank Dillon. After managing fairly successfully to keep him out of her thoughts, he was back—not only in her thoughts, but unfortunately, in sick bay.\u003c/p\u003e\n\u003cp\u003eEarlier in the day he’d returned with a raging fever and an infection. Infection was the biggest risk with a ruptured appendix, and he hadn’t been spared this complication. Ali was worried when she saw that his temperature was nearly 103 degrees. Furious, she’d asked why he hadn’t come in earlier.\u003c/p\u003e\n\u003cp\u003eHe’d refused to answer, but insisted that all he needed was a shot, and that once she’d given it to him, he could go back to his duties as navigator. When she told him Captain Coleman had ordered antibiotics via IV, he seemed to blame her personally. In his anger and frustration, he’d lashed out at her once again and questioned her competence.\u003c/p\u003e\n\u003cp\u003eAs soon as he was hooked up to the antibiotics, and relatively free of pain, he slept for the remainder of her shift. Before leaving, she’d checked on him, taking his temperature, which had fallen to just over 100 degrees.\u003c/p\u003e\n\u003cp\u003eShe felt both irritated and sad. Irritated that he’d delayed seeking medical attention. And sad because she suspected she might be the reason he’d stayed away. According to his own comments, he wanted nothing to do with her. She couldn’t help wondering if that was because of her wedding ring—and yet how could it be? She’d removed it from her left hand.\u003c/p\u003e\n\u003cp\u003eAnytime he’d so much as glanced in her direction this afternoon, he’d scowled as if he couldn’t bear to be in the same room. That was ridiculous. Ali hadn’t done anything to deserve this wrath. After all, he was the one who’d sent her an e-mail thanking her for the excellent care. But from the way he regarded her now, anyone might think she’d attempted to amputate his leg while he wasn’t looking. She tried not to dwell on the things he’d said to her, either today or during his first hospitalization, but she couldn’t help that her feelings were hurt. She’d misread the situation and now he was back and not happy about it, either.\u003c/p\u003e\n\u003cp\u003eFrank didn’t understand or recognize how serious this infection was. With a fever that high, he must’ve been terribly sick. Damn, he should never have waited this long!\u003c/p\u003e\n\u003cp\u003eSent: July 7\u003c/p\u003e\n\u003cp\u003eFrom:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eTo:\u003c/p\u003e\n\u003cp\u003e[email\u0026nbsp;protected]\u003c/p\u003e\n\u003cp\u003eSubject: It’s cookie time!!\u003c/p\u003e\n\u003cp\u003eDear Shana,\u003c/p\u003e\n\u003cp\u003eI’m tired and I want to come home. I sound like a crybaby but I don’t care. The day has been long and awful, and if I was home right now I’d have the mixer going, blending sugar and flour and eggs with oatmeal and raisins. Yup, it’s one of those days.\u003c/p\u003e\n\u003cp\u003eHow are things with Jazmine? I need some news to cheer me up. Got anything wonderful to tell me? How’s Adam? Any news about the transfer? \u003c/p\u003e","sourceLink":"https://allnovel.net/navy-husband-navy-6/page-19.html","bookId":1961,"creation":"Oct 5, 2019 10:14:21 AM","modification":"Oct 5, 2019 10:14:21 AM"}
