{"id":83335,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe half-smiled and then quickly changed the subject. “What about dessert? I want you to show me your culinary skills.”\u003c/p\u003e\n\u003cp\u003eThere was little skill involved in what I had done. “You mean lack of?”\u003c/p\u003e\n\u003cp\u003e“I’m sure that isn’t true.”\u003c/p\u003e\n\u003cp\u003eHe was placing way too much confidence in my abilities because he’d never seen me in action in the kitchen. “Unfortunately, it’s very true, but I don’t think you’re in any danger with the strawberry shortcake.”\u003c/p\u003e\n\u003cp\u003eI cut two slices of pound cake and then topped them with whipped cream and strawberries before I placed his in front of him. “Bon appétit.”\u003c/p\u003e\n\u003cp\u003e“Looks great.”\u003c/p\u003e\n\u003cp\u003eI tried to make it pretty and I guess I didn’t do a terrible job but it didn’t look like anything I’d ever gotten in a restaurant. Hopefully, I didn’t screw it up royally in the taste department.\u003c/p\u003e\n\u003cp\u003eI waited for him to take the first bite because I was too nervous to try it myself. “It’s really good.”\u003c/p\u003e\n\u003cp\u003eI felt relief wash over me. “Really? You’re not just saying that to keep from hurting my feelings, are you?”\u003c/p\u003e\n\u003cp\u003e“It really is good. I promise. Here. Have a bite.” He reached over and offered to feed me a bite of his although I had my own right in front of me. Shiz, that was sexy. The thought of putting my mouth where his had been caused my stomach to do another one of those fluttery things.\u003c/p\u003e\n\u003cp\u003eMy eyes never left his as I leaned closer and took the bite he offered. He watched my mouth as I licked my lips and I hoped he offered me another bite because it was so damn sexy.\u003c/p\u003e\n\u003cp\u003e“You’ve got a little...” he said as he pointed to the corner of his mouth.\u003c/p\u003e\n\u003cp\u003eI reached with my finger to one corner of my mouth and slid it downward.\u003c/p\u003e\n\u003cp\u003e“Let me,” he said huskily as he leaned over and kissed my mouth. “Tastes even sweeter this way,” he whispered as he smiled against my mouth and that was it; I was a lost. I was his puppet and he was my master; he could do with me what he wanted.\u003c/p\u003e\n\u003cp\u003eNick’s mouth was still against mine and I could feel the warm rush of his breath against my lips and I suddenly wanted a dessert that didn’t include strawberry shortcake. “What do you think of a night swim?”\u003c/p\u003e\n\u003cp\u003eHe smiled against my lips. “I think I like that idea very much.”\u003c/p\u003e\n\u003cp\u003eI nibbled my bottom lip for a second as I convinced myself to back away. “Give me a minute to change.”\u003c/p\u003e\n\u003cp\u003eI dashed up the stairs and heard the kitchen faucet running and dishes clanking so I knew Nick was clearing the table and rinsing the dishes. He was hot as hell and considerate. Could this get any better?\u003c/p\u003e\n\u003cp\u003eI looked at my still wet white bikini and wondered if it was worth putting the cold thing back on or if I should get a dry one. Nick loved it on me, so I decided it was definitely worth the freeze I’d get when it hit my body. Besides, it wouldn’t last but a minute.\u003c/p\u003e\n\u003cp\u003eI looked in the mirror and my eyes were immediately drawn to my very noticeably erect nipples. I hadn’t planned to put my cover up back on but I guessed I would until those things decided to calm down.\u003c/p\u003e\n\u003cp\u003eI walked into the kitchen and Nick had it completely cleared with our dishes in the dishwasher. “Thank you, but you’re my guest and you didn’t have to do that. I would have gotten it later.”\u003c/p\u003e\n\u003cp\u003e“It was no problem. I’m used to it since it’s me, my Dad, Jake and Dallas.”\u003c/p\u003e\n\u003cp\u003eHis mom. He didn’t talk about her and I wondered why. Maybe she passed away and it was too painful for him to talk about. I’d ask him about that later, but not now. I didn’t want to spend this time alone talking about parents.\u003c/p\u003e\n\u003cp\u003eWe walked out and I flipped the pool light on. Going into the pool this time was different; it wasn’t quite so playful as we eased down the steps into the shallow end.\u003c/p\u003e\n\u003cp\u003eI dropped down until the water covered my shoulders and then dipped my head backwards. I rose up and pushed the water away from my face. “I love to swim at night.”\u003c/p\u003e\n\u003cp\u003eHe wasted no time getting in my space as he bobbed up and down in front of me. “I’ve never swam at night, but I think I’m gonna like it a lot.”\u003c/p\u003e\n\u003cp\u003e“And just what makes you think that?”\u003c/p\u003e\n\u003cp\u003e“This.” He reached out and grabbed my waist, pulling me close to him, and I couldn’t resist putting my arms around his shoulders as we both stood on our knees in the shallow end.\u003c/p\u003e\n\u003cp\u003eIt was a gentle kiss, very much like the others we had shared. His lips moved slowly and deliberately as his tongue entered my mouth and rhythmically danced with mine. His lips moved from my mouth to my chin toward my neck under my ear and I tilted my head to the side to encourage more of what he was doing.\u003c/p\u003e\n\u003cp\u003eSomewhere along the way, the distinct line of what Nick was to me had changed. I couldn’t pinpoint the moment he had gone from being nothing I wanted to everything I didn’t want to live without and it scared the hell out of me. I was terrified of his past and afraid of being used up and tossed aside like he had done so many times before.\u003c/p\u003e\n\u003cp\u003e“I feel like you’ve backed me into a corner.” It came as a whisper from his mouth against the skin on my neck.\u003c/p\u003e\n\u003cp\u003e“Umm, I think I’m the one that has my back against the corner of the pool.”\u003c/p\u003e\n\u003cp\u003eHe stopped kissing my neck and put both of his hands on my face. His eyes watched mine as he searched for an answer to a question I didn’t hear him speak.\u003c/p\u003e\n\u003cp\u003e“I’m talking about the way you make me feel.” He rubbed his thumbs over my cheek bones. “We have a connection and I’ve never felt that with anyone before you.”\u003c/p\u003e\n\u003cp\u003eMy jealous chord was struck. We might both like to feel a rush, but that wasn’t the only way he had connected with someone before. “I highly doubt that. I think you’ve been very connected to a countless number of girls according to your own confession.”\u003c/p\u003e\n\u003cp\u003e“Dammit, Payton, this isn’t me bullshitting you so I can screw you. I want to tell you how I feel about you and you don’t make it very easy when you say stuff like that.”\u003c/p\u003e\n\u003cp\u003eOh, hell. He wasn’t playing with me. “I’m sorry. I didn’t realize you were being serious.”\u003c/p\u003e\n\u003cp\u003e“When we’re not together, I want to be. When we’re not touching, I hold out hope for just the slightest, accidental graze. You’re all I think about and it’s because my whole world is falling for you. Hard.”\u003c/p\u003e\n\u003cp\u003e14 I’ll Teach You\u003c/p\u003e\n\u003cp\u003eNick\u003c/p\u003e\n\u003cp\u003eOh, shit. I just told Payton I was falling in love with her. Well, not in those words exactly, but close enough for her to get the gist.\u003c/p\u003e\n\u003cp\u003eI was still holding her face in my hands and I cringed as I waited for her to tell me how she felt. I looked in her eyes and she didn’t say a word. That’s when I realized the truth. She wasn’t saying anything because she didn’t feel the same and I had screwed up big time.\u003c/p\u003e\n\u003cp\u003eWhat was I thinking? I had hoped for something that was never gonna happen. A girl like Payton would never go for a guy like me. Jessie told me she and I would never happen and I should have listened, but I couldn\u0027t consider the possibility because I was too busy being a pompous ass in thinking no girl would turn me down.\u003c/p\u003e\n\u003cp\u003eI waited a few more painful seconds and Payton still said nothing, so I became resigned to the truth. She didn’t feel the same about me and I suddenly felt stupid because I had gone against all of my own rules and opened myself up only to be hurt.\u003c/p\u003e\n\u003cp\u003eI swallowed the pain of her rejection and took my hands from her face as I pulled away. I was desperate to get out of there and away from her, but she quickly reached her arms up around my shoulders and stopped me.\u003c/p\u003e\n\u003cp\u003e“I want to be the only one you think about.” She gently pressed her lips to mine. “But let’s be clear about one thing. I won’t be just another one.”\u003c/p\u003e\n\u003cp\u003eI pulled her closely and pressed my forehead to hers as I made a vow. “Never, Doll Face. I swear.”\u003c/p\u003e\n\u003cp\u003eIt felt like only minutes had passed as we made out in the pool, but it was almost midnight when Payton checked the time. “Oh, shit. It’s midnight and I told Aunt Tillie I would come to her house tonight. I need to check my phone because I bet she has called a thousand times. Be right back.”\u003c/p\u003e\n\u003cp\u003eShe gave me a quick kiss before she got out of the pool and I couldn’t stop myself from watching her as she walked up the steps out of the pool and grabbed a towel. God, what I wouldn’t give to be that towel right now.\u003c/p\u003e\n\u003cp\u003eI knew our night swim was over since it was so late and because she had somewhere to be. I got out and dried off while she was talking on the phone and was finishing up as she came out of the house.\u003c/p\u003e\n\u003cp\u003e“I told Aunt Tillie I would be there in a little while and she’s cool with that.”\u003c/p\u003e\n\u003cp\u003e“She won’t get you in trouble with your parents?”\u003c/p\u003e\n\u003cp\u003e“Nah. She’s the total opposite. She has helped me out of hot water with them more than one time. Man, I wished my mom was more like her.” She threw her head over and shook her hair out before she twisted it up in her towel. “You wanna come up with me while I pack a bag?”\u003c/p\u003e\n\u003cp\u003e“Sure.” I’d do anything if it meant I got to spend more time with Payton.\u003c/p\u003e\n\u003cp\u003eI followed her up the stairs into her bedroom and saw Fair Bear sitting in the middle of a dozen pillows on a luxurious bed. Lucky Bear. “He looks really out of place on your fancy bed.”\u003c/p\u003e\n\u003cp\u003e“My bed’s not fancy. You can sit on it while I pack.”\u003c/p\u003e\n\u003cp\u003eI looked at the sleek comforter and thought about the mark my wet trunks would leave on it. “Payton, your bed is fancy and my trunks are wet so I’m not sitting on it.”\u003c/p\u003e\n\u003cp\u003eShe dropped the bag in her hand on the floor and walked over to where I stood by her bed and shoved me backwards so that I fell right in the middle. “Tell me you won’t sit on it and I’ll make you lie on it.”\u003c/p\u003e\n\u003cp\u003eGod, this girl was impossible.\u003c/p\u003e\n\u003cp\u003eI sat up on the edge of her bed and watched her while she finished packing her bag. “When will your parents be back?”\u003c/p\u003e\n\u003cp\u003e“The day after tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Could I talk you into spending tomorrow with me since they won’t be here?”\u003c/p\u003e\n\u003cp\u003eShe grinned as she looked at me. “Possibly.”\u003c/p\u003e\n\u003cp\u003e“Then you’ll possibly need to pack something casual like a T-shirt, jeans and sneakers.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shallow-going-under-2/page-19.html","bookId":1878,"creation":"Oct 5, 2019 4:51:38 PM","modification":"Oct 5, 2019 4:51:38 PM"}
