{"id":83338,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBam! Knocked all nine out perfectly. I dropped the magazine out and started reloading it. “Don’t be nervous. The worst thing you can do is miss.” I slid the magazine back in when I finished loading it and held it out for Payton.\u003c/p\u003e\n\u003cp\u003eShe stared at it, but didn’t make a move to take it from me. “I’m nervous.”\u003c/p\u003e\n\u003cp\u003e“Don’t be. Come here and I’ll help you.” From behind, I wrapped my arms around her before I took her hands and placed them on the grip of my Glock. “Thumbs here and here. Squeeze more with this hand because you’ll use it to aim. Hold your arms straight out.” I noticed her feet were next to each other without any distance between them so I leaned around and put my mouth against her ear. “Spread your legs.”\u003c/p\u003e\n\u003cp\u003eShe giggled as she moved her feet apart. “You are so bad.”\u003c/p\u003e\n\u003cp\u003e“I’m just trying to be a good instructor,” I said innocently.\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m sure you’ve had enough practice to be an expert instructor.”\u003c/p\u003e\n\u003cp\u003eOkay. The line became hazy somewhere along the way and I wasn’t sure if we were talking about target shooting or sex. “What can I say? I’m good at what I do.”\u003c/p\u003e\n\u003cp\u003e“So far, you’ve been quite excellent at everything you’ve done.”\u003c/p\u003e\n\u003cp\u003eHmm. I was very fond of hearing her praise.\u003c/p\u003e\n\u003cp\u003e“New shooters tend to want to go low and to the left, so lift a little and bring it a tad to the right. We’re aiming for the first bottle on the top left. Are you ready?”\u003c/p\u003e\n\u003cp\u003e“Boy, am I ever.”\u003c/p\u003e\n\u003cp\u003eI helped her aim in just the right spot. “Okay. Pull the trigger back.”\u003c/p\u003e\n\u003cp\u003eShe hesitated and I could feel her trembling. “Are you scared?”\u003c/p\u003e\n\u003cp\u003e“Hell, yeah, I’m scared.”\u003c/p\u003e\n\u003cp\u003e“Don’t be. I’m with you all the way. Let me count and you can pull the trigger on three. Okay?”\u003c/p\u003e\n\u003cp\u003eShe inhaled deeply and then blew it out slowly. “Okay, I’m ready. I can do this.”\u003c/p\u003e\n\u003cp\u003e“Here goes. One...Two...Three.” On three she pulled the trigger and took the top off of the first longneck.\u003c/p\u003e\n\u003cp\u003eWhen she realized she had hit it, she let out a loud squeal but didn’t move a muscle. “Woo! That was awesome and you were so right. What a rush.”\u003c/p\u003e\n\u003cp\u003e“So, you liked it?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I wanna do it again.”\u003c/p\u003e\n\u003cp\u003eThis girl was full of surprises. Could she be anymore perfect for me? “You wanna do it by yourself this time?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I think I do.”\u003c/p\u003e\n\u003cp\u003eI took my arms away. “Remember your stance and where to hold the pressure. Bring it up and to the right just a hair. Do you want me to count again?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I think that helped.”\u003c/p\u003e\n\u003cp\u003e“Okay. One...Two...Three.” She pulled the trigger and missed.\u003c/p\u003e\n\u003cp\u003e“Hmm, I missed.”\u003c/p\u003e\n\u003cp\u003e“It’s okay. Try again.” I reached for her arms and brought them up for her. “Lift them just a little higher this time and breathe. Don’t hold your breath.”\u003c/p\u003e\n\u003cp\u003e“Ready?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eOne...Two...Three.” She missed again. And then again.\u003c/p\u003e\n\u003cp\u003eI could see she was getting frustrated. “Ugh! This isn’t easy. I need you to help me.”\u003c/p\u003e\n\u003cp\u003eI put my arms around her again to help her aim. “I didn’t get good at this in one day. I’ve been doing it since I was eleven. Relax. You’re stiff as a board.”\u003c/p\u003e\n\u003cp\u003eShe let her shoulders go loose and I pushed her hair away from her neck to hang over her left shoulder. I leaned into her and put my mouth against her right ear. “Breathe. Loosen your shoulders and tighten your arms. One...Two...Three.”\u003c/p\u003e\n\u003cp\u003eTogether we took out the other eight longnecks and then an additional dozen without a single wasted bullet. I dropped the magazine out to check it and then slid it back in when I saw it was empty. “I think we make a great team.”\u003c/p\u003e\n\u003cp\u003e“I could agree with that, but I think the teacher was greater than the student.”\u003c/p\u003e\n\u003cp\u003eI put my empty gun back in its case and we started walking toward my car. “Shooting small targets takes a lot of practice.”\u003c/p\u003e\n\u003cp\u003e“Well, seeing how good you are at shooting makes me worry a little less about you becoming a police officer.”\u003c/p\u003e\n\u003cp\u003e“It worries you?”\u003c/p\u003e\n\u003cp\u003e“Yeah, it does.”\u003c/p\u003e\n\u003cp\u003eWow. I’d never felt like anyone had worried about me except Dallas and Ginny. I put my gun case on the ground and turned the bill of my cap around to the back before I put my hands on Payton’s waist to pull her closer. “You couldn’t possibly imagine how hard I’m falling for you.”\u003c/p\u003e\n\u003cp\u003e“I bet I have a pretty good idea.” She put her arms up around my shoulders and I lifted her to sit on the hood of my car. She leaned back, bringing me with her as I fell between her bent knees. She wrapped her legs around my waist and pressed my body into hers as my mouth moved over her neck. “How have you managed to put me under your spell, Payton Archer?”\u003c/p\u003e\n\u003cp\u003eShe grabbed my ball cap by the bib on the back of my head and gave it a toss onto the windshield of my car. She laced her fingers through my hair, grabbing two fistfuls and pulled it hard, forcing me to look up at her. “Let’s go back to my house.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eLet’s go back to my house. Was that an excuse to get me to cool my jets or an invitation for something much different? I had no idea with Payton because she wasn’t like the girls I was used to, but she certainly seemed inclined to get physical and the ride home didn’t make me think otherwise.\u003c/p\u003e\n\u003cp\u003eShe reached for my hand as I pulled away from the cabin and didn’t let go as I drove toward my house to pick up her car. She held it firmly and slowly stroked my arm from my hand up to my bicep and back down the whole way home.\u003c/p\u003e\n\u003cp\u003eBy the time we got to my house, Payton’s touch had me so wound so tightly I thought I might spring at any moment. That was until we pulled up at my house and I saw Ginny’s car parked on the street.\u003c/p\u003e\n\u003cp\u003eNo. Not today. Not right now. Not when Payton had just asked me to go to her house while her parents were still gone. Man, nothing could kill a boner faster than your grandmother. I leaned my head forward and put it on the steering wheel.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“My grandmother is here.”\u003c/p\u003e\n\u003cp\u003eShe didn’t let go of my hand. “Then you have to go in to see her and we can get together another time.”\u003c/p\u003e\n\u003cp\u003eThere was no way I was letting her get away from me. “Come in with me and meet her.”\u003c/p\u003e\n\u003cp\u003e“Really? You think I’m grandmother worthy?”\u003c/p\u003e\n\u003cp\u003eWas she kiddin’ me? She was way beyond grandmother worthy. “Of course. Ginny will love you.”\u003c/p\u003e\n\u003cp\u003e“Ginny. That’s a cool name for a grandmother.”\u003c/p\u003e\n\u003cp\u003e“It’s short for Ginger.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’ll come in and meet your Ginny if you’re sure I won’t be intruding.”\u003c/p\u003e\n\u003cp\u003eI couldn’t stop the huge smile that spread across my face as I leaned over and gave her a kiss. “I’m positive.”\u003c/p\u003e\n\u003cp\u003eWe walked through the front door and found Ginny and Dallas in the kitchen. I had forgotten. Today was her day to give Dallas cooking lessons.\u003c/p\u003e\n\u003cp\u003eI let go of Payton’s hand and went over to kiss my grandmother. “Ginny, I have someone for you to meet. This is Payton Archer.”\u003c/p\u003e\n\u003cp\u003eMy grandmother looked at Payton and then back to me and smiled. Me bringing a girl home had obviously taken her by surprise. “I’m so happy to meet you, Payton.”\u003c/p\u003e\n\u003cp\u003eGinny didn’t do handshakes. She was a hugger and she took Payton by surprise when she put the sack of flour down to come over and embrace her. “Are you the girl that’s going to tame my Nickolas?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid the jury is still out on whether he’s tamable or not.”\u003c/p\u003e\n\u003cp\u003eI knew my Ginny was in love with Payton when she started laughing. “Oh, she’s saucy, Nickolas.” She wrapped her arm around Payton and pulled her close as she whispered something in her ear she didn’t want me to hear.\u003c/p\u003e\n\u003cp\u003eWhatever it was made Payton very happy as evidenced by her smile. “I promise. I will definitely do that.”\u003c/p\u003e\n\u003cp\u003e“Now, Miss Payton. Do you cook?”\u003c/p\u003e\n\u003cp\u003e“No, ma\u0027am. No one has ever showed me how.”\u003c/p\u003e\n\u003cp\u003eGinny went to the closet and pulled out one of Dallas’ extra aprons. “Here, put this on. I’m teaching Dallas how to do fried chicken, smashed potatoes, green beans and biscuits with gravy.“\u003c/p\u003e\n\u003cp\u003e“No, Ginny. We can’t stay.” I looked at Payton and grinned. “We have somewhere to be.”\u003c/p\u003e\n\u003cp\u003ePayton slid the apron over her head and tied it around her waist as she smiled at me. “I think we can stay for a little while.”\u003c/p\u003e\n\u003cp\u003eI conceded and went to the living room to watch television while Ginny had her way with Payton and Dallas. I often heard whispering, followed by a rush of laughter and I was positive they were laughing at me about some sort of nonsense. The weird thing about it was that I’d catch myself smiling when they did it because I liked it. I liked having Payton in my house with my sister and grandmother and I liked the way they were in the kitchen together bonding over fried chicken.\u003c/p\u003e\n\u003cp\u003eAn hour later, Payton came out of the kitchen and sat next to me on the couch. “You’re not mad because I wanted to stay, are you?”\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Would you mind if we stayed to eat?”\u003c/p\u003e\n\u003cp\u003e“I don’t think we have a choice. Ginny isn’t gonna let you do all that work and then watch you leave without eating.”\u003c/p\u003e\n\u003cp\u003eShe leaned over and put her head on my shoulder. “Thank you. I had so much fun and Ginny taught me a lot. I actually made homemade biscuits. I can’t believe it. If they’re terrible, you can’t tell me. It would break my heart.”\u003c/p\u003e\n\u003cp\u003e“Doll Face, I promise you I’ll never do anything to break your heart.”\u003c/p\u003e\n\u003cp\u003e“You mean that?”\u003c/p\u003e\n\u003cp\u003eI kissed the top of her head. “Every word.” And I did mean it. I would rather die than do anything to break this beautiful girl’s heart.\u003c/p\u003e\n\u003cp\u003e“Ginny said we’d be eating without your dad because he wouldn’t be home from work until later tonight.”\u003c/p\u003e\n\u003cp\u003e“Yeah, his shift isn’t over until seven and he usually doesn’t get home until almost eight.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shallow-going-under-2/page-22.html","bookId":1878,"creation":"Oct 5, 2019 4:51:38 PM","modification":"Oct 5, 2019 4:51:38 PM"}
