{"id":83351,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI shrugged. “Ah, around.”\u003c/p\u003e\n\u003cp\u003eLuke Mason leaned back in his chair. “I’ll tell you where Hawke’s been since he won’t. He’s been between the legs of the sweetest piece of ass I’ve ever seen. I get hard just thinking about that East Franklin girl.”\u003c/p\u003e\n\u003cp\u003eOne warning. That was all I was willing to give and that was only because I considered these guys friends. “Shut up, I’m not gonna let you talk trash about her like that. She’s not like the others.”\u003c/p\u003e\n\u003cp\u003e“Look at how whipped he is. Her stuff must be damn good.”\u003c/p\u003e\n\u003cp\u003eI stood up and the chair behind me fell backwards making a crashing sound on the concrete floor. “I warned you, Luke.”\u003c/p\u003e\n\u003cp\u003eHe held his hands up signaling his white flag. “Easy, Hawke. I was just screwing with you. I had no idea you were that serious about the chick.”\u003c/p\u003e\n\u003cp\u003eLuke hadn’t said anything I wouldn’t have...before Payton, that is. “Sorry, Dude. It hasn’t been a great night.”\u003c/p\u003e\n\u003cp\u003e“Then, you need a beer.” Luke got up from the table and came back with a fresh pitcher. “Have a drink on me.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” I filled the frosty beer mug in front of me, but didn’t wait for the head to go down before taking the first big swig.\u003c/p\u003e\n\u003cp\u003e“What’s up with you? Got lady problems?”\u003c/p\u003e\n\u003cp\u003eLady problems didn’t even begin to describe what I had going on. “Me and Payton are having a little trouble, but it’ll be cool. No worries” These weren’t the kind of guys you confided in with your innermost thoughts or your relationship problems so I left it at that.\u003c/p\u003e\n\u003cp\u003eIt was two hours and eight draft beers later and I had heard the complete rundown of every girl Luke and Justin had done over the entire summer. I welcomed the beer buzz I had gotten. It helped tune out their chatter while temporarily helping me forget my breakup with Payton...until Samantha Hodges walked through the door and I remembered Payton’s angry words. ‘Go find that slut, Samantha, and maybe you can screw her tonight. I bet she’d love to have your next baby.’\u003c/p\u003e\n\u003cp\u003eI turned my head from her hoping she wouldn’t notice me, but Luke hollered out to invite her over to join us at our table. “Sam, bring your fine ass over here.”\u003c/p\u003e\n\u003cp\u003eShe walked over and I stared into my beer without looking up at her, but I could feel her eyes all over me. “What’s up, guys?”\u003c/p\u003e\n\u003cp\u003e“Just catching up with Hawke since he’s been hyberdating that East Franklin chick.”\u003c/p\u003e\n\u003cp\u003e“Yeah, how’s that working out for you?”\u003c/p\u003e\n\u003cp\u003eLuke laughed and told Samantha, “He says there’s trouble in paradise. Maybe you could help him out a little.”\u003c/p\u003e\n\u003cp\u003eWithout warning, Samantha sat across my lap and put her arm around me. “Nick knows I’m always willing to help him out.”\u003c/p\u003e\n\u003cp\u003eI strained to distance myself from her. “Thanks, but I’m good.”\u003c/p\u003e\n\u003cp\u003eShe scooted across my lap so that she was sitting on my crotch instead of my legs. “You don’t look like you’re doing good. You look drunk and hard up and I can do something about that.”\u003c/p\u003e\n\u003cp\u003eI pushed against her, at least what I thought felt like pushing, but she didn’t budge as she leaned in and kissed me hard. Luke and Justin yelped and hooted, but I managed to push her back enough to unlock my mouth from hers.\u003c/p\u003e\n\u003cp\u003e“You need to get off of me, now.”\u003c/p\u003e\n\u003cp\u003eShe twisted toward the entrance to the pool hall and then back to me. “Kiss me again.”\u003c/p\u003e\n\u003cp\u003e“I didn’t want to kiss you the first time and it’s definitely not happening again. You seriously need to get up before I toss you on your ass.”\u003c/p\u003e\n\u003cp\u003eShe reached around my shoulders and locked her lips onto mine again for a desperate kiss. I grabbed her face and pushed her away. “What the hell, Samantha!”\u003c/p\u003e\n\u003cp\u003eI angrily shoved back from the table and grabbed her by the waist to force her off my lap. “Off, now.”\u003c/p\u003e\n\u003cp\u003eI stood to ensure she didn’t sit back down in my lap and caught a glimpse of Payton going out the front door. “Dammit.”\u003c/p\u003e\n\u003cp\u003eI ran for the door as fast as I could after having eight beers. I saw Payton walking toward her car and I called out to her. “Payton, please stop.”\u003c/p\u003e\n\u003cp\u003e27 Everything\u003c/p\u003e\n\u003cp\u003ePayton\u003c/p\u003e\n\u003cp\u003eMy heart suddenly felt cold and the center began to crack and shatter like a sheet of ice when it can no longer withstand the pressure being pushed against it.\u003c/p\u003e\n\u003cp\u003eI shouldn’t have come here, but I stupidly wanted to see him so we could talk.\u003c/p\u003e\n\u003cp\u003e“Payton, please stop.”\u003c/p\u003e\n\u003cp\u003eI stopped, but not because I planned on listening to anything he had to say. I was the one that was going to do the talking. I turned around and began to clap my hands. “Bravo, Nick. You deserve a round of applause for your performance this summer. You really had me believing you loved me, so take a bow.”\u003c/p\u003e\n\u003cp\u003e“It’s not like that,” he slurred in his drunkenness. “I love you with all of my heart.”\u003c/p\u003e\n\u003cp\u003eThe bastard was trashed so I couldn’t even enjoy letting him have a piece of my mind because he would never remember it anyway. He reached for my arm but I jerked from his touch. “We haven’t been broken up five hours and you were already making out with that slut.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t. She sat on my lap and started kissing me. I told her to stop.”\u003c/p\u003e\n\u003cp\u003e“So, you’re the victim, again?”\u003c/p\u003e\n\u003cp\u003eHe put his hands in his hair and pressed the sides of his head. “I don’t know how to make you understand. I don’t want Samantha. I never wanted her, even before you came along.”\u003c/p\u003e\n\u003cp\u003e“So, you’ve never slept with her?”\u003c/p\u003e\n\u003cp\u003eHe didn’t deny it and it hurt like hell. “I can’t change you.”\u003c/p\u003e\n\u003cp\u003e“But can’t you see you already have? I’ve done some terrible things in the past but how can you hold that stuff against me when it all happened before you came into my life? You are my ray of light in this dark world. I wasn’t looking for anything like you, but you have been such a beautiful surprise.”\u003c/p\u003e\n\u003cp\u003eThey were beautiful words but that’s all they were and would fade away with the morning sun. “No. We are so over that someone should come up with a new word for over.”\u003c/p\u003e\n\u003cp\u003eHearing myself tell him that we were over was the breaking dam holding my tears inside. I turned to leave and he staggered forward and caught me by my waist from behind. He pulled me close and I could feel his hot, drunken breath against the back of my neck, sending chills all over my body. I couldn’t help myself from leaning back against him because even under the present circumstances, he still had the power to make me want him.\u003c/p\u003e\n\u003cp\u003eHe held me tight and I let him. I needed to have him close, even if it was only for a minute before I let him go forever.\u003c/p\u003e\n\u003cp\u003eHe pushed my hair away from my neck and brought his mouth to my ear. Even with him standing behind me, the smell of beer on his breath was stout. “Can’t you see I would do anything to be your everything?”\u003c/p\u003e\n\u003cp\u003e“My everything wouldn’t be having babies with other girls.” I felt a sob building in my throat. “So since I’m not your everything, how about I’ll be nothing at all to you?”\u003c/p\u003e\n\u003cp\u003eHe kissed the back of my neck and rubbed his hands over my stomach. “You are my everything and I don’t want babies with anyone but you. I want to put them inside you and then watch them grow right here.”\u003c/p\u003e\n\u003cp\u003eI laced my fingers through his and savored the moment briefly before I pushed his hands away. “You’re drunk.”\u003c/p\u003e\n\u003cp\u003eHe turned me around to face him and his eyes were glazed over. “I may be drunk, but I know exactly what I’m saying. I want to marry you and have lots of babies...little blond headed ones with honey eyes just like their mother.”\u003c/p\u003e\n\u003cp\u003eHe started kissing my neck and I felt myself melting under his touch. He lifted me onto the hood of my car and then pressed his body against my parted legs. “I love you, Payton, and I don’t want to live without you.”\u003c/p\u003e\n\u003cp\u003eThis was his game and he was damn good at it so I had to get away before I gave in and got naked with him in the backseat of my car. I pushed him away and slid off the hood. “No, we’re not doing that. You’re not gonna kiss me and turn me on to make me forget what you’ve done. You have a baby out there with another girl. That’s a problem for me because I’m going to be the one to give my husband his first child. Me, not some random whore.”\u003c/p\u003e\n\u003cp\u003eI opened my car door and got inside. “I should have known when you swept me off my feet that I was in the perfect position for you to drop me on my ass.”\u003c/p\u003e\n\u003cp\u003e28 Chokehold\u003c/p\u003e\n\u003cp\u003eNick\u003c/p\u003e\n\u003cp\u003eI just watched my whole world drive away.\u003c/p\u003e\n\u003cp\u003eI walked back inside the pool hall and went back to the table where my buddies were sitting. They looked at me waiting for an explanation, but I didn’t have one to give them.“Everything okay?”\u003c/p\u003e\n\u003cp\u003eNo, nothing was okay without Payton in my life. I stared blankly at the beer I had not finished when she came in. Why had she come here? Had she come to talk things over and then changed her mind when she saw Samantha in my lap kissing me?\u003c/p\u003e\n\u003cp\u003eLuke snapped his fingers in front of my face. “What happened, Dude?”\u003c/p\u003e\n\u003cp\u003eSamantha walked up to our table looking like the cat that swallowed the canary. “Please, allow me to explain, boys.”\u003c/p\u003e\n\u003cp\u003eI stared dumbfounded at her. I had no idea what she was about to announce, but it was clearly making her happy. “The Playah got played. That’s what happened. I set you up, Nick.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003eShe motioned across the room. “I believe you met my cousin, Brandi, earlier today.”\u003c/p\u003e\n\u003cp\u003eI turned around and saw the girl that was at my house claiming to be the mother of a baby belonging to me. “You’re cousins?”\u003c/p\u003e\n\u003cp\u003e“Tell me Nick, what does it say about one’s character when a complete stranger shows up at your door and tells you they had your baby and you don’t know the difference because you’ve screwed so many girls?”\u003c/p\u003e\n\u003cp\u003e“I’ve never met her?\u003c/p\u003e\n\u003cp\u003e“Luckily for Brandi, no.”\u003c/p\u003e\n\u003cp\u003e“Why would you do this?”\u003c/p\u003e\n\u003cp\u003e“You screwed me and I returned the favor. Do you need me to elaborate further on that?”\u003c/p\u003e\n\u003cp\u003eI slammed my palm against the table and made the beer mugs clank against the surface. “You just caused me to lose the only girl I have ever loved.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shallow-going-under-2/page-35.html","bookId":1878,"creation":"Oct 5, 2019 4:51:38 PM","modification":"Oct 5, 2019 4:51:38 PM"}
