{"id":83353,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I know you’re wondering why I’m here.”\u003c/p\u003e\n\u003cp\u003eI wasn’t just wondering. I was dying to know. “More than just a little bit.”\u003c/p\u003e\n\u003cp\u003e“I’m here about that girl with the baby.”\u003c/p\u003e\n\u003cp\u003eHere we went. I was finally going to know for sure that Nick had a baby with another girl and I felt my nausea return.\u003c/p\u003e\n\u003cp\u003e“There’s so much you don’t know.”\u003c/p\u003e\n\u003cp\u003eI’m sure there was and I preferred to keep it that way because Nick had broken my heart enough for this century.\u003c/p\u003e\n\u003cp\u003e“Can we sit? This is gonna take a while.”\u003c/p\u003e\n\u003cp\u003e“Of course. You’ll have to excuse me because I’m so shaken that I can’t think straight.”\u003c/p\u003e\n\u003cp\u003e“You’re shaken because you love Nick.” I couldn’t argue with that so I didn’t.\u003c/p\u003e\n\u003cp\u003eWe sat on the couch and I used the remote to turn off the television.\u003c/p\u003e\n\u003cp\u003e“I have things to tell you and your initial reaction is going to be to not believe me, but everything I’m about to say is the truth.”\u003c/p\u003e\n\u003cp\u003e“I’m listening.”\u003c/p\u003e\n\u003cp\u003e“That baby was not Nick’s. In fact, I’m not even sure there ever was a baby.”\u003c/p\u003e\n\u003cp\u003eI didn’t understand. How did they do a DNA test on a baby that she wasn’t sure even existed?\u003c/p\u003e\n\u003cp\u003e“Samantha Hodges has been in love with Nick for years. She has chased him for as long as I can remember and she occasionally caught him, but all of that ended when he found you and she couldn’t stand it. She orchestrated this whole baby thing. Nick never met that girl until she showed up at our house. Samantha knew you and Nick would break up and he would end up down at the pool hall getting drunk. That’s why she was there that night, to make her move on him but then you walked in and that was the topping on her cake.”\u003c/p\u003e\n\u003cp\u003eIt was a good story, but that’s all it was. It was a shame that Nick had lied to his sister so well because I could see that she believed everything she was telling me. “If all of this was true, why wouldn’t he have told me when it happened?”\u003c/p\u003e\n\u003cp\u003e“He tried to explain about Samantha that night, but you were so hurt you wouldn’t listen. He knew the story about the baby would be no different.”\u003c/p\u003e\n\u003cp\u003eShe was right. I didn’t believe either explanation.\u003c/p\u003e\n\u003cp\u003e“I can see you don’t believe me and that’s why I brought this.” She reached into her purse and pulled out a worn black leather book. “I know how wrong it was for me to take this. These are Nick’s most private thoughts and he will either love me or hate me for giving this to you.”\u003c/p\u003e\n\u003cp\u003e“Nick keeps a journal?”\u003c/p\u003e\n\u003cp\u003e“I know. He doesn’t seem the type.”\u003c/p\u003e\n\u003cp\u003eNo, I would never have pegged Nick as one to journal. Not in a million years.\u003c/p\u003e\n\u003cp\u003eShe handed the book to me and I stared at it like it was some ancient piece of art I didn’t have the right to touch. “I don’t suggest reading anything before the day he met you.”\u003c/p\u003e\n\u003cp\u003eAgainst my conscience screaming at me, I took the worn leather book containing all of Nick’s most private thoughts because I wanted to crawl inside his head knowing all along how completely and morally wrong it would be. “I don’t know if I can read this, Dallas. I want to, but it feels so wrong.”\u003c/p\u003e\n\u003cp\u003e“If you read it and find out he’s a lying bastard, then you’re no worse off then you were. If you read it and find out he loves you more than life itself, then it will be worth it.”\u003c/p\u003e\n\u003cp\u003e“You haven’t read it?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThat was a huge gamble for her to bring me something she hadn’t read. “Then how do you know he doesn’t journal about the way he screwed girls behind my back the whole time we were together?”\u003c/p\u003e\n\u003cp\u003e“Because I know how much he loves you and I saw the changes in him. That’s why I’m so confident in giving this to you. I’m positive it’ll bring you back together.”\u003c/p\u003e\n\u003cp\u003e“Isn’t he going to know it’s gone?”\u003c/p\u003e\n\u003cp\u003e“Yeah, but I’m gonna blame Jake.”\u003c/p\u003e\n\u003cp\u003eOh, hell. I wouldn’t want to be there when that went down.\u003c/p\u003e\n\u003cp\u003eI walked Dallas to the door and we said our goodbyes, not knowing if we would ever see each other again. The thought made me sad. She turned back to me before she made it to Dane’s porsche and said, “Don’t be surprised when you find out he’s breakable.”\u003c/p\u003e\n\u003cp\u003eOnce Dallas was gone, I sat in my spot on the couch and stared at Nick’s tangible thoughts in my hands. I brought it to my nose and inhaled deeply, taking in the heady mixture of leather and Nick’s signature smell.\u003c/p\u003e\n\u003cp\u003eWas I ready to know Nick’s innermost thoughts? Sometimes the things that came out of his mouth were more than I could stand. I had to do some serious thinking about this.\u003c/p\u003e\n\u003cp\u003eI picked up my partially melted box of rocky road and put it back in the freezer because I didn’t seem to have an appetite for it any longer. I leaned against the kitchen counter and looked at the journal from where I stood in the kitchen as I put one of my nails to my mouth to chew.\u003c/p\u003e\n\u003cp\u003eI realized I was ruining my fresh manicure and jerked my hand away from my mouth. I left the kitchen and picked up the journal again. I cracked it open to look at his handwriting and couldn’t recall ever seeing it before. It was pretty and legible, not like most guys’ chicken scratch.\u003c/p\u003e\n\u003cp\u003eI had sat in utter silence weighing my two options with their consequences for an hour and a half when I heard the sound of keys in the front door. Claire came through the door smiling from ear to ear and I could tell she was about to burst. Yep. She definitely got an engagement ring tonight.\u003c/p\u003e\n\u003cp\u003e“We have an announcement to make. Jessie has asked me to marry him.” She held up her left hand. “And I said, ‘yes.’”\u003c/p\u003e\n\u003cp\u003eClaire told me every little detail about the way Kimosabe had proposed while he kept quiet and laughed at her animated way of retelling the story. He had driven her back to Franklin to the old football field where they had their first kiss and first dance, except this time he played a different song. He told Claire to ask him what the name of the song was and he popped open a ring box as he told her the song was ‘Marry Me.’\u003c/p\u003e\n\u003cp\u003eIt was sickeningly sweet, but I was ecstatic for her. She had really found her prince charming, tattoos and all.\u003c/p\u003e\n\u003cp\u003eJessie was definitely staying over tonight because there was no way Claire was sending him to the guys’ dormitory on campus. Not after a marriage proposal like that. It might not be the deed itself, but the boy had some rewards coming his way.\u003c/p\u003e\n\u003cp\u003eI sat on the couch clutching Nick’s book for another hour after Claire and Jessie went to bed and I had no better idea of what I was going to do than when Dallas handed it to me. I heard Claire’s door open and then shut quietly before she came into the living room where I was.\u003c/p\u003e\n\u003cp\u003e“Hey, what’s wrong?”\u003c/p\u003e\n\u003cp\u003eI wasn’t sure if I should tell Claire about the journal. She always strived to be perfect and snooping in someone else’s private thoughts would surely make her list of no-no’s.\u003c/p\u003e\n\u003cp\u003e“Dallas was here tonight.”\u003c/p\u003e\n\u003cp\u003e“Is everything all right?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Everything’s fine, but she had some interesting things to tell me. She said that whole thing with the baby was a hoax made up by that Samantha chick that cornered me at Nick’s race. She had her cousin pretend to have Nick’s baby to break us up. She brought this to me so I could read it for myself.”\u003c/p\u003e\n\u003cp\u003eI showed her what I had been clutching to my heart for the last hour. “It’s Nick’s journal. She took it from him and she thinks I should read it.”\u003c/p\u003e\n\u003cp\u003e“Shut the front door.”\u003c/p\u003e\n\u003cp\u003e“She has no idea what it says, but she’s confident it will change my mind about Nick. Do you think I should read it?”\u003c/p\u003e\n\u003cp\u003e“The question is do you think you should read it?”\u003c/p\u003e\n\u003cp\u003eI hated when she answered a question with a question. “Wouldn’t it be wrong to read his private thoughts?”\u003c/p\u003e\n\u003cp\u003eShe looked at me as though I was a stranger. “Have we met? Since when do you care if it’s wrong? Hell, yes, it would be wrong to read it. Should that stop you? Hell, no! Read it.”\u003c/p\u003e\n\u003cp\u003eOnce I crossed that line, I couldn’t go back. “I don’t know if I can.”\u003c/p\u003e\n\u003cp\u003e“Payton, now is not the time for you to go Team Pollyanna. It doesn’t suit you.”\u003c/p\u003e\n\u003cp\u003eOkay. Maybe I would read one entry. I opened it up and scanned until I found the day we met.\u003c/p\u003e\n\u003cp\u003e30 Nick’s Journal\u003c/p\u003e\n\u003cp\u003ePayton\u003c/p\u003e\n\u003cp\u003eJune 7th\u003c/p\u003e\n\u003cp\u003eI won another race last night but that wasn’t the best part of my night. I met a girl, a real hot piece of ass w/ a smart mouth on her. I called her Doll Face because she’s the most beautiful girl I’ve ever seen. She acted like she wasn’t falling for my shit, but I played it cool and ended up with her in the backseat of her car. Too bad she was asleep w/ her head in my lap because she got wasted. We could have had a real good time.\u003c/p\u003e\n\u003cp\u003eShe says she’s not looking to hook up with someone like me. She says she’s looking for truly, madly, deeply but I bet I can change her mind. I always do. And I’ll start tonight at Dane’s party.\u003c/p\u003e\n\u003cp\u003eWell, that entry certainly wasn’t going to make me fall in love with him all over again. Why couldn’t he have said his world stopped turning the first time he saw me or he thought he was in heaven because I must certainly be an angel? Not that I was a hot piece of ass with a smart ass mouth.\u003c/p\u003e\n\u003cp\u003eClaire saw my disappointment. “What does it say?”\u003c/p\u003e\n\u003cp\u003eI didn’t want to tell her because it was such a letdown, but I did anyway. “Something about me being a hot piece with a smart mouth.\"\u003c/p\u003e\n\u003cp\u003eClaire thought it was hilarious. “Jessie told me his first thought about me was that I had great tits.”\u003c/p\u003e\n\u003cp\u003eOkay. That made me feel a little better. Now I wanted to read more. “Get out of here and go back to your fiancée. You weren’t in there long enough to reward him well enough for what he gave you tonight.”\u003c/p\u003e\n\u003cp\u003e“Fiancée. Wow, I have a fiancée. Who’d have thunk it?”\u003c/p\u003e\n\u003cp\u003eClaire went back to bed and I poured myself a glass of wine before I settled into my bed with my new companion. I had already crossed the line so why stop now?\u003c/p\u003e\n\u003cp\u003eJune 8th \u003c/p\u003e","sourceLink":"https://allnovel.net/shallow-going-under-2/page-37.html","bookId":1878,"creation":"Oct 5, 2019 4:51:38 PM","modification":"Oct 5, 2019 4:51:38 PM"}
