{"id":83357,"no":41,"title":"Page 41","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I don’t know anything about having babies, but that would be awfully fast for a first, wouldn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Like record time, but Claire does everything perfectly so I would expect no less from her when it comes to giving birth.”\u003c/p\u003e\n\u003cp\u003eI lightly knocked on the door and heard Claire’s soft voice. “Come in.”\u003c/p\u003e\n\u003cp\u003eI peeked around the door first to make sure we wouldn’t be walking in on her doing that spread eagle thing or whatever position it was they put you in when you pushed out a baby. “All clear?”\u003c/p\u003e\n\u003cp\u003e“Yes, get yourself in here so you can see our little addition.”\u003c/p\u003e\n\u003cp\u003eI couldn’t believe what my eyes were seeing and I felt the tears coming. Claire was holding a tiny little baby in her arms while Jessie stood over her admiring his work.\u003c/p\u003e\n\u003cp\u003e“Omigod, Claire. I can’t believe it’s already here.”\u003c/p\u003e\n\u003cp\u003eI streaked over to her bedside and looked down at her new bundle of joy. I still couldn’t believe they chose to not find out what the baby was when she had her ultrasound. “Tell me. Boy or girl?”\u003c/p\u003e\n\u003cp\u003e“Guess.”\u003c/p\u003e\n\u003cp\u003eI had declared it a boy from the second Claire freaked out about being pregnant, but now I wasn’t so sure. I looked down and tried to decide if I thought the baby looked like a he or she, but I could only distinguish one thing from that sweet face. It was Jessie Boone’s mini-me.\u003c/p\u003e\n\u003cp\u003eAlthough the baby looked just like Jessie, there was something too pretty about her to be a boy and that’s when I decided. “That’s a girl face. She’s too pretty to be a stinkin’ boy.”\u003c/p\u003e\n\u003cp\u003eClaire couldn’t take her eyes off of her. “She sure is.”\u003c/p\u003e\n\u003cp\u003eNick shook Jessie’s hand and did that half masculine hug thing. “Congratulations. You’re a dad, Boone. That’s freaky.”\u003c/p\u003e\n\u003cp\u003e“It happened so fast, I haven’t had time to absorb it all. Her water broke and she was all calm and everything. We didn’t get in any kind of hurry about getting here because we thought it would take hours but then some really bad pains started. By the time we got here, she was almost ready.”\u003c/p\u003e\n\u003cp\u003e“Omigod, did you get your epidural?”\u003c/p\u003e\n\u003cp\u003e“No, I was eight centimeters when we got here and it all happened too fast. Girl, let me tell you...that pain ain’t no joke. Ooh, it burned like a mutha. I thought my vajayjay was on fire. It’s probably better you weren’t here. I would have scared you into never having any.”\u003c/p\u003e\n\u003cp\u003eI did not need to be hearing that right now.\u003c/p\u003e\n\u003cp\u003e“Where are your parents?”\u003c/p\u003e\n\u003cp\u003e“You just missed them. I can’t believe you didn’t meet them in the hall carrying Ozzy and Harley. Those two immediately sacked out after the excitement of seeing her was over, so they took them home.”\u003c/p\u003e\n\u003cp\u003eNow that we knew it was a girl, it was time to choose a name. “So, what are you naming this beautiful little princess?”\u003c/p\u003e\n\u003cp\u003e“We talked about Finley Elizabeth, but I’m still not sure. I need to look at her a little longer to make sure it fits.”\u003c/p\u003e\n\u003cp\u003eThat was a great name. “I like it. She can pull off Finley.”\u003c/p\u003e\n\u003cp\u003e“You wanna hold her?”\u003c/p\u003e\n\u003cp\u003eI guess I should get used to it. “Absolutely. She needs to get familiar with her Aunt Pate.”\u003c/p\u003e\n\u003cp\u003eI took Baby Finley from Claire and looked down at her beautiful little round face. I unconsciously began to sway as I spoke softly to her and touched her soft cheek to mine. I guess it was the innate thing to do but I was still surprised when I caught myself doing it because I had never been around babies and I certainly didn’t get a nurturing instinct from my mother.\u003c/p\u003e\n\u003cp\u003eThere was no question about it. This was what I wanted.\u003c/p\u003e\n\u003cp\u003eWe didn’t stay near as long as I would have liked, but Claire and Jessie needed bonding time with Finley before she had to go to the nursery.\u003c/p\u003e\n\u003cp\u003eNick and I didn’t talk much on the ride home and I wasn’t sure if it was because he was avoiding the baby talk or because he was still tired. I hoped it was the latter.\u003c/p\u003e\n\u003cp\u003eIt was still night and I knew he was exhausted from working so many hours so I let him go to bed instead of starting the conversation that scared the hell out of me.\u003c/p\u003e\n\u003cp\u003eThere was nothing on television so I cut it off and softly slid into bed beside my husband. I turned on my side away from him so I wouldn’t disturb his sleep and I felt his arm snake around my waist and pull me against him.\u003c/p\u003e\n\u003cp\u003e“I can’t sleep. I guess being up so long has given me my second wind.” He kissed the back of my neck and rubbed his hand over my belly. “You want me to practice putting a baby in there?”\u003c/p\u003e\n\u003cp\u003eThat had been our little joke we had shared for three years and I wondered what he was gonna say when I told him it couldn’t be called practicing anymore because he had succeeded in putting one there.\u003c/p\u003e\n\u003cp\u003eThe timing wasn’t perfect. I had another year before I got my BS in interior design and I knew he wanted it to be the two of us for a while longer. At least that’s what he said when I told him Claire was pregnant. That had been several months ago. I hoped time had changed his mind or maybe seeing Finley stirred something different in him.\u003c/p\u003e\n\u003cp\u003eI was nervous. I was afraid he would think I had done it on purpose so Claire and I could have babies together. I didn’t, but I was happy about it and I wanted him to be, too.\u003c/p\u003e\n\u003cp\u003eI rolled over to face him and he hitched my leg over his hip. He rubbed his hand up the back of my thigh to my panties and slid his hand underneath. “I love to get into these.”\u003c/p\u003e\n\u003cp\u003eHe kissed my neck as he pulled my nightgown up and over my head. That familiar stirring presented itself and I decided to ride it out one last time before I told Nick about the baby.\u003c/p\u003e\n\u003cp\u003eThree years together and he could still make me scream his name. He was the best husband ever.\u003c/p\u003e\n\u003cp\u003eWe lay silent in the dark and he was rubbing his hand back and forth over my belly so I decided that was my sign to tell him. “I admire the way you have been such a diligent student in your baby making studies, Mr. Hawke, but there comes a time in every student’s life when he must fail or graduate.”\u003c/p\u003e\n\u003cp\u003e“Are you telling me I’m getting an ‘F’ in your class?”\u003c/p\u003e\n\u003cp\u003e“No, you’re definitely not getting an ‘F.’ You’re graduating with a 4.0. And honors.”\u003c/p\u003e\n\u003cp\u003e“What are we talking about?”\u003c/p\u003e\n\u003cp\u003e“Mr. Hawke, you’ve mastered your craft. You can no longer practice putting a baby in me because you’ve successfully done it already.”\u003c/p\u003e\n\u003cp\u003eI cringed as I waited for his response. I felt the bed shift as he reached over to turn on the lamp. Our bedroom was dimly lit and he spun around to look at me and then to my naked belly.\u003c/p\u003e\n\u003cp\u003eHe scooted over next to me and curiously reached his hand out to place it over the spot where our baby currently resided. “Everything I’ve ever done to get a rush doesn’t even come close to comparing to the one I’m feeling right now.”\u003c/p\u003e\n\u003cp\u003eHe put his mouth on my stomach and kissed it. “Our baby is inside you right there.” He gazed up at me. “God, I love you. You’re the best wife ever.”\u003c/p\u003e\n\u003cp\u003eHe crawled up my body to kiss me. “And you’re the best husband ever. Now, make me scream your name again.”\u003c/p\u003e\n\u003cp\u003eNo regrets in love. Ever. \u003c/p\u003e","sourceLink":"https://allnovel.net/shallow-going-under-2/page-41.html","bookId":1878,"creation":"Oct 5, 2019 4:51:38 PM","modification":"Oct 5, 2019 4:51:38 PM"}
