{"id":11518,"no":16,"title":"CHAPTER XV THE PAWNBROKER\u0027S SHOP","content":"\u0026nbsp;Stuffed behind the counter, and on the shelves of the pawnbroker\u0027s shop, were articles in almost endless variety. All was fish that came to his net. He was willing to advance on anything that had a marketable value, and which promised to yield him, I was about to say, a fair profit. But a fair profit was far from satisfying the old man. He demanded an extortionate profit from those whom ill-fortune drove to his door for relief. \n\u003cdiv\u003e\n Eliakim Henderson, for that was his name, was a small man, with a bald head, scattering yellow whiskers, and foxlike eyes. Spiderlike he waited for the flies who flew of their own accord into his clutches, and took care not to let them go until he had levied a large tribute. When Paul entered the shop, there were three customers ahead of him. One was a young woman, whose pale face and sunken cheeks showed that she was waging an unequal conflict with disease. She was a seamstress by occupation, and had to work fifteen hours a day to earn the little that was barely sufficient to keep body and soul together. Confined in her close little room on the fourth floor, she scarcely dared to snatch time to look out of the window into the street beneath, lest she should not be able to complete her allotted task. A two days\u0027 sickness had compelled her to have recourse to Eliakim Henderson. She had under her arm a small bundle covered with an old copy of the Sun.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you got there?” asked the old man, roughly. “Show it quick, for there\u0027s others waiting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meekly she unfolded a small shawl, somewhat faded from long use.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you give me on that?” she asked, timidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn\u0027t worth much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It cost five dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you got cheated. It never was worth half the money. What do you want on it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The seamstress intended to ask a dollar and a half, but after this depreciation she did not venture to name so high a figure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A dollar and a quarter,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A dollar and a quarter!” repeated the old man, shrilly. “Take it home with you. I don\u0027t want it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you give?” asked the poor girl, faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifty cents. Not a penny more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifty cents!” she repeated, in dismay, and was about to refold it. But the thought of her rent in arrears changed her half-formed intention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll take it, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The money and ticket were handed her, and she went back to her miserable attic-room, coughing as she went.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, ma\u0027am,” said Eliakim.\n\u003c/div\u003e \n\u003cdiv\u003e\n His new customer was an Irish woman, by no means consumptive in appearance, red of face and portly of figure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what\u0027ll ye be givin\u0027 me for this?” she asked, displaying a pair of pantaloons.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they yours, ma\u0027am?” asked Eliakim, with a chuckle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s not Bridget McCarty that wears the breeches,” said that lady. “It\u0027s me husband\u0027s, and a dacent, respectable man he is, barrin\u0027 the drink, which turns his head. What\u0027ll ye give for \u0027em?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Name your price,” said Eliakim, whose principle it was to insist upon his customers making the first offer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twelve shillin\u0027s,” said Bridget.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twelve shillings!” exclaimed Eliakim, holding up both hands. “That\u0027s all they cost when they were new.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They cost every cint of five dollars,” said Bridget. “They was made at one of the most fashionable shops in the city. Oh, they was an illigant pair when they was new.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How many years ago was that?” asked the pawnbroker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only six months, and they ain\u0027t been worn more\u0027n a month.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you fifty cents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifty cints!” repeated Mrs. McCarty, turning to the other customers, as if to call their attention to an offer so out of proportion to the valuable article she held in her hand. “Only fifty cints for these illigant breeches! Oh, it\u0027s you that\u0027s a hard man, that lives on the poor and the nady.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You needn\u0027t take it. I should lose money on it, if you didn\u0027t redeem it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says he\u0027d lose money on it,” said Mrs. McCarty. “And suppose he did, isn\u0027t he a-rollin\u0027 in gold?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m poor,” said Eliakim; “almost as poor as you, because I\u0027m too liberal to my customers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hear till him!” said Mrs. McCarty. “He says he\u0027s liberal and only offers fifty cints for these illigant breeches.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you take them or leave them?” demanded the pawnbroker, impatiently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may give me the money,” said Bridget; “and it\u0027s I that wonder how you can slape in your bed, when you are so hard on poor folks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. McCarty departed with her money, and Eliakim fixed his sharp eyes on the next customer. It was a tall man, shabbily dressed, with a thin, melancholy-looking face, and the expression of one who had struggled with the world, and failed in the struggle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much for this?” he asked, pointing to the violin, and speaking in a slow, deliberate tone, as if he did not feel at home in the language.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want for it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ten dollar,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ten dollars! You\u0027re crazy!” was the contemptuous comment of the pawnbroker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a very good violin,” said the man. “If you would like to hear him,” and he made a movement as if to play upon it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind!” said Eliakim. “I haven\u0027t any time to hear it. If it were new it would be worth something; but it\u0027s old, and——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you do not understand,” interrupted the customer, eagerly. “It is worth much more than new. Do you see, it is by a famous maker? I would not sell him, but I am poor, and my Bettina needs bread. It hurts me very much to let him go. I will buy him back as soon as I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will give you two dollars, but I shall lose on it, unless you redeem it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two dollar!” repeated the Italian. “Ocielo! it is nothing. But Bettina is at home without bread, poor little one! Will you not give three dollar?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not a cent more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s your money and ticket.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And with these the poor Italian departed, giving one last lingering glance at his precious violin, as Eliakim took it roughly and deposited it upon a shelf behind him. But he thought of his little daughter at home, and the means of relief which he held in his hand, and a smile of joy lightened his melancholy features. The future might be dark and unpromising, but for three days, at any rate, she should not want bread.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul\u0027s turn came next.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you got?” asked the pawnbroker.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul showed the ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n Eliakim took it, and his small, beadlike eyes sparkled avariciously as he recognized the diamond, for his experience was such that he could form a tolerably correct estimate of its value. But he quickly suppressed all outward manifestations of interest, and said, indifferently, “What do you want for it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want twenty dollars,” said Paul, boldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty dollars!” returned the pawnbroker. “That\u0027s a joke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it isn\u0027t,” said Paul. “I want twenty dollars, and you can\u0027t have the ring for less.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you said twenty shillings, I might give it to you,” said Eliakim; “but you must think I am a fool to give twenty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s cheap for a diamond ring,” said Paul. “It\u0027s worth a good deal more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The pawnbroker eyed Paul sharply. Did the boy know that it was a diamond ring? What chance was there of deceiving him as to its value? The old man, whose business made him a good judge, decided that the ring was not worth less than two hundred and fifty dollars, and if he could get it into his possession for a trifle, it would be a paying operation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re mistaken, boy,” he said. “It\u0027s not a diamond.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A very good imitation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much is it worth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you three dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won\u0027t do. I want to raise twenty dollars, and if I can\u0027t get that, I\u0027ll keep the ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The pawnbroker saw that he had made a mistake. Paul was not as much in need of money as the majority of his customers. He would rather pay twenty dollars than lose the bargain, though it went against the grain to pay so much money. But after pronouncing the stone an imitation, how could he rise much above the offer he had already made? He resolved to approach it gradually. Surveying it more closely, he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is an excellent imitation. I will give you five dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was not without natural shrewdness, and this sudden advance convinced him that it was, after all, a real stone. He determined to get twenty dollars or carry the ring home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars won\u0027t do me any good,” he said. “Give me back the ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five dollars is a good deal of money,” said Eliakim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027d rather have the ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your lowest price?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you eight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just now you said it was worth only three,” said Paul, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is very fine gold. It is better than I thought. Here is the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re a little too fast,” said Paul, coolly. “I haven\u0027t agreed to part with the ring for eight dollars, and I don\u0027t mean to. Twenty dollars is my lowest price.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you ten,” said the old man, whose eagerness increased with Paul\u0027s indifference.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, you won\u0027t. Give me back the ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might give eleven, but I should lose money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t want you to lose money, and I\u0027ve concluded to keep the ring,” said Paul, rightly inferring from the old man\u0027s eagerness that the ring was much more valuable than he had at first supposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the old pawnbroker was fascinated by the sparkling bauble. He could not make up his mind to give it up. By fair means or foul he must possess it. He advanced his bid to twelve, fourteen, fifteen dollars, but Paul shook his head resolutely. He had made up his mind to carry it to Ball \u0026amp; Black\u0027s, or some other first-class jewelers, and ascertain whether it was a real diamond or not, and if so to obtain an estimate of its value.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve changed my mind,” he said. “I\u0027ll keep the ring. Just give it back to me.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2994/82607.html","bookId":318,"creation":"Aug 2, 2019 3:59:15 AM","modification":"Aug 2, 2019 3:59:15 AM"}
