{"id":11519,"no":17,"title":"CHAPTER XVI THE JEWELER\u0027S PRICE","content":"\u0026nbsp;But to give it back was not Eliakim\u0027s intention. Should he buy it at twenty dollars, he would make at least two hundred, and such bargains were not to be had every day. He decided to give Paul his price. \n\u003cdiv\u003e\n “I will give you twenty dollars,” he said; “but it is more than the ring is worth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have concluded not to take twenty dollars,” said Paul. “You may give it back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You agreed to take twenty dollars,” said Eliakim, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was when I first came in. You said you wouldn\u0027t give it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have changed my mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So have I,” said Paul. “You had a chance to get it, but now it\u0027s too late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eliakim was deeply disappointed. Generally he had his own way with his customers, who, being in urgent need of money, were obliged to accept such terms as he chose to offer. But now the tables were turned, and Paul proved more than a match for him. He resolved to attempt intimidation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boy, where did you get this ring?” he asked, in a significant tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Honestly,” said Paul. “That\u0027s all you need to know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t believe it,” said the old man, harshly. “I believe you stole it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may believe what you like, but you must give it back to me,” said Paul, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve a great mind to call a policeman,” said Eliakim.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you did,” said Paul, “I\u0027d tell him that you were anxious to get the ring, though you believed it to be stolen. Perhaps he might have something to say to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Eliakim perceived the force of Paul\u0027s argument, for in law the receiver of stolen goods is as bad as the thief, and there had been occasions when the pawnbroker had narrowly escaped punishment for thus indirectly conniving at theft.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you say you got it honestly, I\u0027ll buy it of you,” he said, changing his tune. “What will you take?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t care about selling to-day,” answered Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you twenty-five dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can\u0027t sell without consulting my mother. It belongs to her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Reluctantly Eliakim gave back the ring, finding his wiles of no effect.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bring your mother round to-morrow,” he said. “I\u0027ll give you a better price than you will get anywhere else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Paul. “I\u0027ll tell her what you say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old pawnbroker followed Paul with wistful glances, vainly wishing that he had not at first depreciated the ring to such an extent, that his subsequent advances had evidently excited his customer\u0027s suspicion that it was more valuable than he supposed. He felt that he had lost it through not understanding the character of the boy with whom he had to deal.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Paul, what news of the ring?” asked Mrs. Hoffman, as he re-entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was offered twenty-five dollars for it,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you sell it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” asked Jimmy. “Twenty-five dollars is a lot of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it,” said Paul; “but the ring is worth a great deal more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What makes you think so, Paul?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because the offer was made by a pawnbroker, who never pays quarter what an article is worth. I am sure the ring is worth a hundred dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I am sure it is worth all that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A hundred dollars!” repeated Jimmy, awestruck at the magnitude of the sum.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What shall we do about it, Paul?” asked his mother. “A hundred dollars will do us more good than the ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know that, mother. What I propose is, to carry it to Ball \u0026amp; Black\u0027s, or Tiffany\u0027s, and sell it for whatever they say it is worth. They are first-class houses, and we can depend upon fair treatment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your advice is good, Paul. I think we will follow it. When will you go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go at once. I have nothing else to do, and I would like to find out as soon as I can how much it will bring. Old Henderson wanted me to think, at first, that it was only imitation, and offered me twenty shillings on it. He\u0027s an old cheat. When he found that I wasn\u0027t to be humbugged, he raised his offer by degrees to twenty-five dollars. That was what made me suspect its value.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you get a hundred dollars, Paul,” said Jimmy, “you can buy out the stand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on whether mother will lend me the money,” said Paul. “You know it\u0027s hers. She may not be willing to lend without security.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am so unaccustomed to being a capitalist,” said Mrs. Hoffman, smiling, “that I shan\u0027t know how to sustain the character. I don\u0027t think I shall be afraid to trust you, Paul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Once more, with the ring carefully wrapped in a paper and deposited in his pocketbook, Paul started uptown. Tiffany, whose fame as a jeweler is world-wide, was located on Broadway. He had not yet removed to his present magnificent store on union Square.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul knew the store, but had never entered it. Now, as he entered, he was struck with astonishment at the sight of the immense and costly stock, unrivaled by any similar establishment, not only in the United States, but in Europe. Our hero walked up to the counter, and stood beside a richly-dressed lady who was bargaining for a costly bracelet. He had to wait ten minutes while the lady was making her choice from a number submitted to her for inspection. Finally she selected one, and paid for it. The clerk, now being at leisure, turned to our hero and asked:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, young man, what can I do for you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a ring which I should like to show you. I want to know how much it is worth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. Let me see it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When Paul produced the diamond ring, the clerk, who had long been in the business, and perceived its value at once, started in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is a very valuable ring,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I thought,” said Paul. “How much is it worth?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean how much should we ask for it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; how much would you give for it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably two hundred and fifty dollars.” Paul was quite startled on finding the ring so much more valuable than he had supposed. He had thought it might possibly be worth a hundred dollars; but he had not imagined any rings were worth as much as the sum named.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you buy it of me?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk regarded Paul attentively, and, as he thought, a little suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does the ring belong to you?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, to my mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did she buy it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She didn\u0027t buy it at all. She found it one day at Central Park. It belongs to her now. She advertised for an owner, and examined the papers to see if it was advertised as lost, but could hear nothing of the one to whom it belonged.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long ago was this?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two years ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show this ring to Mr. Tiffany,” said the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul took a seat and waited.\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon Mr. Tiffany came up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you the boy who brought in the ring?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You say your mother found it two years ago in Central Park?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a valuable ring. I should be willing to buy it for two hundred and fifty dollars, if I were quite certain that you had a right to dispose of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have told you the truth, Mr. Tiffany,” said Paul, a little nettled at having his word doubted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be, but there is still a possibility that the original owner may turn up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won\u0027t you buy it, then?” asked Paul, disappointed, for, if he were unable to dispose of the ring, he would have to look elsewhere for the means of buying out Barry\u0027s street stand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t say that; but I should want a guaranty of indemnity against loss, in case the person who lost it should present a claim.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case,” said Paul, “I would give you back the money you paid me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tiffany smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But suppose the money were all spent,” he suggested. “I suppose you are intending to use the money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to start in business with it,” said Paul, “and I hope to add to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Every one thinks so who goes into business; but some get disappointed. You see, my young friend, that I should incur a risk. Remember, I don\u0027t know you. I judge from your appearance that you are honest; but appearances are sometimes deceitful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I suppose you won\u0027t buy it?” said Paul, who saw the force of this remark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you can bring here any responsible gentleman who knows you, and is willing to guarantee me against loss in the event of the owner\u0027s being found I will buy the ring for two hundred and fifty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul brightened up. He thought at once of Mr. Preston, and, from the friendly interest which that gentleman appeared to take in him, he judged that he would not refuse him this service.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can do that,” he said. “Do you know Mr. Andrew Preston? He is a wealthy gentleman, who lives on Madison avenue, between Thirty-fourth and Thirty-fifth streets.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not personally. I know him by reputation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will he be satisfactory?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Entirely so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He knows me well,” said Paul. “I think he will be willing to stand security for me. I will come back in a day or two.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul took the ring, and left the store. He determined to call that evening on Mr. Preston, and ask the favor indicated.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2994/82608.html","bookId":318,"creation":"Aug 2, 2019 3:59:16 AM","modification":"Aug 2, 2019 3:59:16 AM"}
