{"id":11528,"no":26,"title":"CHAPTER XXV PAUL\u0027S FINAL SUCCESS","content":"\u0026nbsp;Mrs. Montgomery impatiently awaited the return of her husband. Meanwhile she commenced packing the single trunk which answered both for her husband and herself. She was getting tired of New York, and anxious to leave for Philadelphia, being fearful lest certain little transactions in which she and her husband had taken part should become known to the police. \n\u003cdiv\u003e\n She had nearly completed her packing when Paul rang the doorbell.\n\u003c/div\u003e \n\u003cdiv\u003e\n The summons was answered by the landlady in person.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is Mrs. Montgomery at home?” asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No such lady lives here,” was the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n It occurred to Paul as very possible that Mr. Montgomery might pass under a variety of names. He accordingly said, “Perhaps I have got the name wrong. The lady I mean is tall. I come with a message from her husband, who is a stout man with black hair and whiskers. He gave me this number.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you mean Mr. Grimsby. He and his wife live here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably that is the name,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will give Mrs. Grimsby your message,” returned the landlady, whose curiosity was excited to learn something further about her boarders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Paul; “but it is necessary for me to see the lady myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, you can follow me, then,” said the landlady, rather ungraciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n She led the way upstairs, and knocked at the door of Mrs. Grimsby, or as we will still call her, Mrs. Montgomery, since that name is more familiar to the reader, and she was as much entitled to the one as the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Montgomery opened the door, and regarded our hero suspiciously, for her mode of life had taught her suspicion of strangers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here\u0027s a boy that wants to see you,” said the landlady.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I come with a message from your husband,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Montgomery remembered Paul as the boy who was the real owner of the diamond ring, and she eyed him with increased suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did my husband send you? When did you see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just now, at Tiffany\u0027s,” answered Paul, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is his message?” asked Mrs. Montgomery, beginning to feel uneasy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul glanced at the landlady, who, in the hope of gratifying her curiosity, maintained her stand by his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The message is private,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose that means that I am in the way,” remarked the landlady, sharply. “I don\u0027t want to pry into anybody\u0027s secrets. Thank Heaven, I haven\u0027t got any secrets of my own.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Walk in, young man,” said Mrs. Montgomery.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul entered the room, and she closed the door behind him. Meanwhile the landlady, who had gone part way downstairs, retraced her steps, softly, and put her ear to the keyhole. Her curiosity, naturally strong, had been stimulated by Paul\u0027s intimation that there was a secret.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Mrs. Montgomery, impatiently, “out with it! Why does my husband send a message by you, instead of coming himself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He can\u0027t come himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why can\u0027t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to say that I am the bearer of bad news,” said Paul, gravely. “Your husband has been arrested for robbing me of a diamond ring.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is he?” demanded Mrs. Montgomery, not so much excited or overcome as she would have been had this been the first time her husband had fallen into the clutches of the law.\n\u003c/div\u003e \n\u003cdiv\u003e\n “At the street station-house. He wants you to come and see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got the ring back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Montgomery was sorry to hear it. She hoped her husband might be able to secrete it, in which case he would pass it over to her to dispose of. Now she was rather awkwardly situated, being without money, or the means of making any.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go,” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul, who was sitting next to the door, opened it suddenly, with unexpected effort, for the landlady, whose ear was fast to the keyhole, staggered into the room involuntarily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you were listening, ma\u0027am, were you?” demanded Mrs. Montgomery, scornfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I was,” said the landlady, rather red in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were in good business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a better business than stealing diamond rings,” retorted the landlady, recovering herself. “I\u0027ve long suspected there was something wrong about you and your husband, ma\u0027am, and now I know it. I don\u0027t want no thieves nor jail birds in my house, and the sooner you pay your bill and leave, the better I\u0027ll like it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll leave as soon as you like, but I can\u0027t pay your bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I dare say,” retorted the landlady. “You\u0027re a nice character to cheat an honest woman out of four weeks\u0027 board.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Paul, what news?” asked Barry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am ready to buy your stand,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you pay me all the money down?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the spot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it is all settled,” said Barry, with satisfaction. “I am glad of it, for now I shall be able to go on to Philadelphia to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul drew a roll of bills from his pocket, and proceeded to count out thirty-five dollars. Barry noticed with surprise that he had a considerable amount left.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are getting rich, Paul,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not rich yet,” answered Paul, “but I mean to be some time if I can accomplish it by industry and attention to business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ll be sure to succeed,” said George Barry. “You\u0027re just the right sort. Good-by, old fellow. When you come on to Philadelphia come and see me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may establish a branch stand in Philadelphia before long,” said Paul, jocosely.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2994/82617.html","bookId":318,"creation":"Aug 2, 2019 3:59:37 AM","modification":"Aug 2, 2019 3:59:37 AM"}
