{"id":105729,"no":103,"title":"Page 103","content":"\u003cp\u003eThe WiseMothers stand hunched in a rough circle, huge bodies ossifying, too heavy now to move. Each one stands with her toes just grazing on the expanse of silver sand. The sand lies smooth; no trace of the ever-present wind touches it; no debris lies scattered from recent storms; no scallops ripple its surface, for the nest of the WiseMothers is impervious to wind and guarded by the ice-wyrms.\u003c/p\u003e\n\u003cp\u003eOnly the WiseMothers know what they are incubating here.\u003c/p\u003e\n\u003cp\u003eFor a long while he watches the glimmering hollow. Nothing stirs. Nothing.\u003c/p\u003e\n\u003cp\u003eBut that is illusion.\u003c/p\u003e\n\u003cp\u003eEven the small creatures that haunt the fjall know to avoid the nesting grounds.\u003c/p\u003e\n\u003cp\u003eHe takes a rock from the pouch and tosses it. Where it hits the sand with a thunk, a shudder ripples out from it actually visible in the surface just as a tossed stone ripples still water. As the vibrations stir the sand away on the other side, where the rock fell, he slides one foot onto the hard surface and follows with the second.\u003c/p\u003e\n\u003cp\u003eThe stone tilts, rocks. A gleaming claw, translucent like ice, surfaces to hook the stone. That fast, stone and claw vanish. He stops dead still. The sand where the stone hit eddies, smooths over, and lies still again.\u003c/p\u003e\n\u003cp\u003eHe waits.\u003c/p\u003e\n\u003cp\u003eHe dares not move.\u003c/p\u003e\n\u003cp\u003eHe does not fear the claws of the ice-wyrms. They are fragile creatures, sightless, as thin as rope, at home only when they burrow deep in their nests of crystallized venom. Even starlight burns them.\u003c/p\u003e\n\u003cp\u003eBut there is no creature the RockChildren fear as much as the ice-wyrms. No death compares to the wretched fate that awaits one who is stung. The venom of the ice-wyrms nourishes the WiseMothers, who nurse the roots of the earth. They alone are strong enough to take succor from it.\u003c/p\u003e\n\u003cp\u003eTo all other creatures, it brings that which is worse than death. In this way Bloodheart protected himself, with a dead nestbrother animated by magic and fueled with venom. That is the mark of an enchanter: Even after death his hand can strike down the one who killed him.\u003c/p\u003e\n\u003cp\u003eHe reaches into the pouch, draws out another stone, and tosses it. One stone at a time, he slides out across the nesting ground toward a small hummock that emerges from the silver sands in the center. As hard as iron, the surface of the hummock is polished to a pearlescent gleam.\u003c/p\u003e\n\u003cp\u003eIt takes him half the short summer’s night to get there, but when he reaches the hummock and takes that last step onto its slick surface, he can shake out his tense limbs. The rounded dome warms his feet, and it smells faintly of sulfur. He is safe.\u003c/p\u003e\n\u003cp\u003eSafe, that is, until he has to cross back.\u003c/p\u003e\n\u003cp\u003eHe has made this journey before. Only here, in the center of the nesting ground, can mortal ears hear the whispering of the WiseMothers. No creature enslaved to the earth lives long enough to hear even one of their thoughts in its entirety. But the youngest of the WiseMothers can still speak, if only one has the patience to listen. He has listened to them before. He has brashly asked their advice.\u003c/p\u003e\n\u003cp\u003eYet it is not their advice he seeks this day.\u003c/p\u003e\n\u003cp\u003eNight fades to morning. He waits. First Son does not come.\u003c/p\u003e\n\u003cp\u003eHe waits, and listens.\u003c/p\u003e\n\u003cp\u003e“They. Will. Pass. The. Bridge. And. The. Cataract.”\u003c/p\u003e\n\u003cp\u003e“They. Will. Part. The. Waters. The. Fire. Rivers. Will. Change. In. Their. Course.”\u003c/p\u003e\n\u003cp\u003e“Make. Room. Make. Room.”\u003c/p\u003e\n\u003cp\u003eA sigh passes through them, wind groaning down from the northern fjalls, murmuring out of the eastern fjalls, and whispering in the faint voices of those few scattered to the south where the land has been worn away one stone at a time by tide and current, where sea and ocean meld and mingle to breathe the vapor of their disparate perfumes into the salt-strewn air.\u003c/p\u003e\n\u003cp\u003eWhat the WiseMothers speak of is mystery to him. The sun passes its noonday height and begins to sink before he hears a stealthy footfall, followed by the frustrated roar of First Son of the First Litter as he springs out from the rocks and stands on the brink of the nesting ground.\u003c/p\u003e\n\u003cp\u003e“Coward!” he cries. “Do you think to hide from me there? Weakling! You must have water and food in time, or you will wither away and return to dust. Come and fight.”\u003c/p\u003e\n\u003cp\u003e“Come and get my braids,” says Fifth Son. He displays the three braids he has tied around his arm. “If I die out here, you will still have to come and get these to prove your worthiness before OldMother.”\u003c/p\u003e\n\u003cp\u003eFor a moment only First Son gapes, taken by surprise. He, strongest and canniest among them all, wears only a single braid wound round one arm. But he will not ask how his rival gained so much while he was gaining so little; he controls his surprise quickly. He is not foolish.\u003c/p\u003e\n\u003cp\u003eHe gathers stones from the verge of the nesting ground, and when he has gathered enough, he tosses the first one to the opposite side of the sandy surface. The surface ripples as he slides a foot out onto the sand, then freezes. A claw spikes into the air and curls around the distant stone. Stone and claw vanish. First Son tosses another. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-103.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
