{"id":105753,"no":127,"title":"Page 127","content":"\u003cp\u003eIf they knew he watched, they gave no sign of knowing. They only danced.\u003c/p\u003e\n\u003cp\u003eHe neither saw nor heard nor smelled any trace of the wolves.\u003c/p\u003e\n\u003cp\u003eHe watched the servants for a long time, until the predawn light made gray of tree trunks and the servants faded into the light of the coming day and vanished from his sight except where light played along the branches of the shelter, corresponding in no way to the sun, which had not yet risen above the treetops. He heard a giggle at his ear, felt fingers tweak his earlobe and a breath of wind tickle his cheek. Laughing, he went to saddle he horses.\u003c/p\u003e\n\u003cp\u003eDespite the encounter with the wolves, Anne led them deeper into woodland and lightly settled territory. The next day at about midday they came to a crossroads. It was a lonely place at the base of a rugged hill made forbidding by an outcropping of stone halfway up the steep slope. Someone had cut back the trees to make a clearing, but one huge old trunk had been left.\u003c/p\u003e\n\u003cp\u003e“We’ll turn east here,” said Anne.\u003c/p\u003e\n\u003cp\u003e“Not south?” Liath glanced at her mother, surprised.\u003c/p\u003e\n\u003cp\u003e“East,” repeated Anne.\u003c/p\u003e\n\u003cp\u003eThey reached the actual crossing of paths, and as he came up beside the huge old stump, Sanglant saw that carvings decorated the wood: stag-headed men, women with the heads of vultures, a wolf. Oak leaves, all dried up and crinkly now, littered the base, and someone had piled a cairn of stones on top Those stones had red stains on them, blood long since dried.\u003c/p\u003e\n\u003cp\u003e“Sacrifice,” said Anne harshly. “And worse things.” She dismounted and walked over to the stump. Without expression, she took apart the cairn stone by stone. At its base, half sunk into the rotting center of the trunk, lay an amulet, somewhat decayed. She swept it off the stump with a branch. “This is the work of the Enemy.”\u003c/p\u003e\n\u003cp\u003eSanglant watched her with interest, waiting to see what would happen. Perhaps it was true that the Enemy prodded weak-willed souls to work harm in the world in this fashion. But he had see men resort to stranger rites before battle, and of them, as many who prayed to the gods of their grandmothers were as likely to live as those who prayed to God. Nevertheless, it was true that such displays displeased the Lord and Lady, and they had to be eradicated.\u003c/p\u003e\n\u003cp\u003eAnne turned to where Liath sat on her horse. “Burn it.”\u003c/p\u003e\n\u003cp\u003eLiath paled. She did not move or reply\u003c/p\u003e\n\u003cp\u003e“The gift of fire is in your nature. Burn this place, where the minions of the Enemy have set their hands.”\u003c/p\u003e\n\u003cp\u003e“No. The people hereabouts only do it to protect themselves and their animals from harm on their journeys, or to guarantee good weather while they’re on the road. Why should we harm them when what they’ve done gives no harm to us?”\u003c/p\u003e\n\u003cp\u003e“This is Bernard talking through your lips. He traveled too much and was too lenient in his judgments.”\u003c/p\u003e\n\u003cp\u003e“Da always said we should leave well enough alone.”\u003c/p\u003e\n\u003cp\u003e“I left you with him for too long.”\u003c/p\u003e\n\u003cp\u003e“Which way do we go?” answered Liath stiffly. She looked furious.\u003c/p\u003e\n\u003cp\u003e“You will not do as I ask?”\u003c/p\u003e\n\u003cp\u003e“I will not. You don’t understand what you’re asking me to do.”\u003c/p\u003e\n\u003cp\u003e“I am one of the few who do understand.” Anne glanced toward Sanglant. He saw the air shimmer around Anne, and suddenly he heard the servants, whispers cutting at the high end of his hearing: words about fire, and burning, but what they used of language was too distorted for him to understand more.\u003c/p\u003e\n\u003cp\u003e“I say we should ride on,” he said. “Surely there is a deacon hereabouts who will deal with these old superstitions in a fitting manner. Isn’t that why God have ordained some to dedicate their lives to the church, to be weapons devoted to God’s working in the world?”\u003c/p\u003e\n\u003cp\u003e“Many were conceived and born to be weapons, Prince Sanglant, and yet have no knowledge of their destiny.”\u003c/p\u003e\n\u003cp\u003e“Spoken like my father, Sister Anne. But I am not such a one. And neither is my wife.”\u003c/p\u003e\n\u003cp\u003eShe measured Liath a final time. “The iron does not know what it will become until it has been hammered in the fire.”\u003c/p\u003e\n\u003cp\u003e“Let us ride on,” he said again. Liath urged her horse forward, taking the right fork.\u003c/p\u003e\n\u003cp\u003eAnne remained behind. “It would be going against God’s will to leave such a shrine behind as a temptation to the unfortunate and foolish people who may be lured to pray and give offerings here only because it exists.”\u003c/p\u003e\n\u003cp\u003e“We’ll wait for you ahead.” Sanglant rode on, following Liath. The Eika dog padded listlessly beside him. Up the road, Liath had halted in the shadow of the rock outcropping.\u003c/p\u003e\n\u003cp\u003e“I don’t understand your mother’s position in the world. Is she sworn to the church, or is she a great lady with many estates under her rule? Who are her kin?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-127.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
