{"id":105840,"no":215,"title":"Page 215","content":"\u003cp\u003e“So you will,” agreed Obligatia, and Rosvita could not interpret the emotion in her voice. “Very well. Let him be unmasked for a moment.”\u003c/p\u003e\n\u003cp\u003eAt Adelheid’s order, a lamp was lit. As Captain Fulk untied the cloth, Rosvita scuttled backward to hide herself in the shadows behind Theophanu’s chair, and as Theophanu’s remaining ladies shifted forward to see better, she was further hidden by their skirts. She could not see, only hear, as Hugh spoke in a gracious and amiable tone.\u003c/p\u003e\n\u003cp\u003e“Your Majesty,” he said. “Your Highness. Mother.”\u003c/p\u003e\n\u003cp\u003eRosvita imagined him punctuating the greetings with an elegant bow, suitable to the humble yet melodious tone.\u003c/p\u003e\n\u003cp\u003e“Handsome enough,” said Adelheid while her companions whispered and giggled among themselves, “but one young pretty husband was enough for me! He was always at the poor servant girls, and I’ve always wondered if it was one of them who pushed him down the stairs the night he died, Lady forgive him for his faults.”\u003c/p\u003e\n\u003cp\u003e“The Lady and Lord know our faults well,” said Mother Obligatia, “and They are merciful. Captain, blindfold him and return him to the guest hall, then come back here.”\u003c/p\u003e\n\u003cp\u003eIt was done. Hugh was led away.\u003c/p\u003e\n\u003cp\u003eRosvita slipped back to Theophanu’s side. No one had time to comment on her odd behavior since Adelheid stood immediately to address abbess and princess.\u003c/p\u003e\n\u003cp\u003e“I say we chance it.”\u003c/p\u003e\n\u003cp\u003e“We can’t trust him!” cried Theophanu. “He’ll drive us into the crown and let this terrible creature murder us all. Then Ironhead will be rid of us.”\u003c/p\u003e\n\u003cp\u003e“Ironhead needs me! I am the last surviving member of the royal house of Aosta. Our kin has ruled here for fifty years. He can legitimately claim the throne only through me.”\u003c/p\u003e\n\u003cp\u003e“Not if you’re dead,” retorted Theophanu. “Then the field is open.”\u003c/p\u003e\n\u003cp\u003e“Not to him! His mother’s father was a mercenary who made his fortune fighting with the Jinna and who later sold his daughter as a concubine to the lord of Sabina. But she was known to have had many lowborn lovers, and one of them is commonly supposed to have sired Ironhead.”\u003c/p\u003e\n\u003cp\u003e“How came he to the lordship, then?” asked Theophanu.\u003c/p\u003e\n\u003cp\u003e“Ironhead murdered his half brother and married the widow, who possessed noble birth, lands, and treasure. But he sired no children on her, and the Arethousans now occupy her lands. No one knows if he murdered her or banished her to a convent. Do you think the nobles of Aosta will kneel before him?” Her anger cooled abruptly, and she turned to the abbess. “I beg your pardon, Mother. This is not our choice, is it? If you forbid it, then we cannot act.”\u003c/p\u003e\n\u003cp\u003eObligatia smoothed her hands down the length of her walking stick. “I will not interfere if you choose to accept Lord Hugh’s aid.”\u003c/p\u003e\n\u003cp\u003e“Do you think it possible the crown can serve as he says it can?” asked Rosvita, startled.\u003c/p\u003e\n\u003cp\u003e“When my predecessor was on her deathbed, she spoke to me privately and passed on to me knowledge that has been in the keeping of the abbesses here since the days of St. Ekatarina. I have no proof, I have seen no evidence myself, but there are stories of crowns being woven into gateways that can lead a traveler to distant lands.”\u003c/p\u003e\n\u003cp\u003e“An old magic now lost to us,” mused Rosvita. “Yet, Your Highness,” she added, addressing Theophanu, “did we not see the painting on the wall of the guest chapel? It could signify a way of traveling that humankind has long since forgotten—or never known.”\u003c/p\u003e\n\u003cp\u003e“I am against it,” replied Theophanu stubbornly. “I cannot do anything but speak against it, because I believe now and always that he tried to murder me by means of magic. But you have not yet said what you think, Sister Rosvita. Do you agree with me, or do you agree with Adelheid?”\u003c/p\u003e\n\u003cp\u003e“Is it right to accept aid from one who has already been censured for the act we would demand from him? And yet, a man like Ironhead who would cut down mature olive trees and castrate his enemies’ loyal soldiers is not wise enough to make a good regnant. And if he is not of noble blood, then he is not worthy—” But strangely, she thought of Hathui, and she did not finish the comment. “In any case, Your Highness, we must act to benefit your father, whom we know to be a just and wise regnant.” Yet she could only shake her head, burdened by the sudden weight of it all. “Nay, I cannot make a decision quickly when the matters before us are so grave. I must have time to think it over.”\u003c/p\u003e\n\u003cp\u003e“Very well,” said Theophanu, all cool strength again. “I will abide by your decision, Sister Rosvita. I will agree to whatever you choose.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-215.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
