{"id":105919,"no":296,"title":"Page 296","content":"\u003cp\u003eStill, it broke his heart to see them: peddlers hawking their wares; beggars holding out gourd cups in hope of a scrap of bread or thin soup; youths hoping to join the famous Lions or just gain a bit of experience fixing wheels or grooming the cart horses; women and boys come to trade favors for food or a trinket. Sometimes a Lion would even shelter a sweetheart on the long march, although that was against the rules. The captains were strict: as long as no one shirked chores or fell behind, they would look the other way.\u003c/p\u003e\n\u003cp\u003eThe cavalry were another story, of course. They moved both faster and more slowly, helped and hindered by their fine horses and their little entourages, a groom, a servant, a concubine, and a camp-boy for the least of them and rather more servants for the greater.\u003c/p\u003e\n\u003cp\u003eHe was digging out the night pits with Folquin when he saw her for the second time, a pale figure in dirty novice’s robes kneeling before a pair of beggars who had swung into the procession three nights before: a brawny man with the face of a frightened child and his companion, a wizened man who had no feet. “Look there.” He nudged Folquin with the butt of his shovel. “Do you see her?” She had poured water into a cup and was offering it to the crippled man.\u003c/p\u003e\n\u003cp\u003eFolquin had lost his only other tunic at dice last night, and he was in an irritable mood today, jabbing at the dirt with angry grunts. “Huh?” he said, looking up abruptly.\u003c/p\u003e\n\u003cp\u003e“That woman—” But she was already gone, slipped away into the whores’ makeshift encampment. At this time of the evening, various of the cavalrymen, unencumbered by any work except riding to war, were out strolling in twos or threes, looking for trouble, or a bit of pleasure, or some combination of the two.\u003c/p\u003e\n\u003cp\u003e“Do you fancy one of them, then?” asked Folquin. “I thought—” Sorrow growled softly, and Folquin struck himself on the head. He was a good soul, if a little reckless, and easy to get along with. “I beg your pardon. It’s nothing to jest about.”\u003c/p\u003e\n\u003cp\u003e“Nay, don’t mind it.” Alain patted Sorrow on the head reprovingly, and he settled down again beside Rage. “It wasn’t your fault. But I could swear I know her. And if it’s who I think it is, she’s got no business traveling with the army.”\u003c/p\u003e\n\u003cp\u003e“Who do you think it is?”\u003c/p\u003e\n\u003cp\u003e“My wi—” He bit off the word, stabbed by the old shame. “Nay, I must be mistaken.”\u003c/p\u003e\n\u003cp\u003e“Here, I tell you what,” said Folquin hastily. “I’ll take your first hour of watch and you can go looking for her. Then you’ll know whether you’re mistaken.” He got a good spadeful of dirt and tossed it above the ditch. “I always hate it when I can’t stop thinking over something that might be, or might not have been. If only I hadn’t rolled a deuce!”\u003c/p\u003e\n\u003cp\u003eAlain had to laugh. “If only you hadn’t rolled at all.”\u003c/p\u003e\n\u003cp\u003e“Nay, leave off, I beg you,” cried Folquin, leaning on his shovel and grinning, “you won’t be lecturing me as Ingo did, will you?”\u003c/p\u003e\n\u003cp\u003e“Nay, not as Ingo did. In my very own way, I’m sure. Didn’t your own aunt weave that tunic for you?”\u003c/p\u003e\n\u003cp\u003eFolquin groaned, pounding his head against the shovel’s haft. “Ai, God! Have mercy! Ingo calling me a shameless gambler was bad enough. Now this! My poor aunt. How can I ever face her now? She’ll know how careless I was with the things she gifted me with.”\u003c/p\u003e\n\u003cp\u003e“And sweated over.”\u003c/p\u003e\n\u003cp\u003eAlain had discovered that Folquin’s adventurous heart concealed a very real devotion to his distant family, the same ones he’d abandoned for the life of a King’s Lion. He was always collecting pretty ribands and little luxurious household items, like a wooden sieve-spoon that was a copy of the silver and gold ones used by noble ladies in the great halls, for his younger sisters; he had friends enough among the Eagles that on occasion one of them would deliver a package made up of such items to his village, if they happened to pass that way.\u003c/p\u003e\n\u003cp\u003eNow as a bit of rain spattered over them, warm and refreshing, he saw that Folquin truly looked remorseful. “It’s true, isn’t it? I risked something that I’d no right to wager on, for it was like she gave me a piece of her heart when she gifted me with that tunic.”\u003c/p\u003e\n\u003cp\u003e“Here, now,” said Alain quickly, “you lost it to Dedi in third cohort, didn’t you? Maybe we can offer to take some of his duties in exchange. I don’t know what Ingo would say, for he’s enough responsibilities, but I wouldn’t mind taking a turn at Dedi’s privy digging for a night. If you and Stephen and Leo did as well, and explained the matter to Dedi, too, then why shouldn’t he be willing to return the tunic?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-296.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
