{"id":105963,"no":343,"title":"Page 343","content":"\u003cp\u003e“The Quman will post a guard,” said Baldwin. “They’ll kill anyone they find. We’ll never make it.”\u003c/p\u003e\n\u003cp\u003e“Now here’s a lad who believes in God’s grace,” said the old Lion with a rattling laugh.\u003c/p\u003e\n\u003cp\u003e“It’s true,” added Baldwin philosophically, “that death will free me from my wife.”\u003c/p\u003e\n\u003cp\u003e“At least Sigfrid and Hathumod are safe,” said Ermanrich. “And we might be as well, if we don’t despair. That’s a sin, you know.”\u003c/p\u003e\n\u003cp\u003eIvar knew it was a sin, but his hand was really hurting now and he just wanted to lie down and rest. But he pressed on with the others toward a ditch lush with reeds and bushes, sheltered from the river by the steep, almost clifflike slope of the hill and by two stark ramparts, their faces slick with mud and, curiously, shale. Hauling the unconscious Lion gave him something to concentrate on as first Ermanrich and then the old Lion slid into the shelter of the ditch. Ivar and Baldwin shoved the unconscious man over the lip, and he tumbled down into a hand’s height of water. Ermanrich quickly got his face free of water, although even the rough jostling hadn’t woken him. Maybe he was already dead.\u003c/p\u003e\n\u003cp\u003eBehind them, up at the height of the hill, a thin light began to glow.\u003c/p\u003e\n\u003cp\u003e“Ai, God!” whispered Baldwin. “Look! It’s the Quman, coming with torches to search us out!” He flung himself down into the ditch, and Ivar slipped and slid in his wake, so utterly filthy by now that another layer of mud seemed to make no difference. The rain had slackened and the clouds on this side of the hill had pressed southward, leaving them with the waxy light of a full moon and that eerie, lambent glow from the crown of the hill.\u003c/p\u003e\n\u003cp\u003eBounded on one side by the earthen dike, the ditch had become a pool because of the steep precipice on its other side where a stream of water coursed down the cliff face. The falling water had exposed two boulders capped by a lintel stone embedded in the hillside, which were mostly hidden by a thick layer of moss, now shredded and hanging in wet tendrils over the great stones as water trickled through.\u003c/p\u003e\n\u003cp\u003eIvar cupped his hands and drank, and the cold water cleared his head for the first time since he had lost his fingers.\u003c/p\u003e\n\u003cp\u003e“This must have been the spring or cistern for the old fort,” he said as he traced an ornate carving still visible beneath the moss on one of the stones: a human figure wearing the antlers of a stag. He pushed away the hanging moss. “Look!” Baldwin slithered up beside him. A tunnel lanced away into darkness, into the hill. Without waiting, Ivar slipped behind the green curtain. It was narrowly cut, but he could squeeze through. Inside lay black as black, and water lapped at his knees, but it seemed safe enough. “Baldwin!”\u003c/p\u003e\n\u003cp\u003eRipples stirred at his knees, and then Baldwin brushed up beside him. “Ivar? Is that you, Ivar?”\u003c/p\u003e\n\u003cp\u003e“Of course it’s me! I heard a rumor that the Quman fear water. Maybe we can hide here, unless it gets too deep.” He probed ahead with one foot but the unseen bed of the pool seemed solid enough, a few pebbles that rolled under his boots, nothing more. No chasms. He plunged his arm into the black water and found a stone to toss ahead. The plop rang hollowly, then faded. He heard a drip drip drip—and a sudden scuffling, like rats.\u003c/p\u003e\n\u003cp\u003e“What was that?” hissed Baldwin, grabbing Ivar’s arm at the elbow.\u003c/p\u003e\n\u003cp\u003e“Ow, you’re pinching me!”\u003c/p\u003e\n\u003cp\u003eThen they heard it, a wordless groan like the voice of the dead, an incomprehensible babble.\u003c/p\u003e\n\u003cp\u003e“Oh, God.” Ivar clutched Baldwin in turn. “It’s a barrow. We’ve walked into a burial pit and now we’ll be cursed!”\u003c/p\u003e\n\u003cp\u003e“Iss i-it you?” The voice was unfamiliar, high and light and oddly distorted by the stone and the dripping water. “Iss i-it Er-manrich-ch’ss friendss?”\u003c/p\u003e\n\u003cp\u003e“L-Lady Hathumod?” stammered Baldwin.\u003c/p\u003e\n\u003cp\u003e“Ai, t-thank the Lady!” They couldn’t see her, but her voice was clear, if faint, blurred by stone and echoes. “Poor Ssigfrid wass wounded in the arm and we got losst, and—and I prayed to God to show me a ssign. And then we fell in here. But it’ss dry here, and I think the tunnel goess farther into the hill, but I was too afraid to go o-on.”\u003c/p\u003e\n\u003cp\u003e“Now what do we do?” muttered Baldwin.\u003c/p\u003e\n\u003cp\u003eBecause of the cold shock of the water, he could think again. His hand throbbed like fire, but he knew what they had to do, even if it meant the risk of awakening the ghost of some ancient, shrouded queen.\u003c/p\u003e\n\u003cp\u003e“Let’s get the others, and then we’ll go as deep as we can into the hill. The Quman will never dare follow us through this water. After a day or two they’ll go away, and we can come out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-343.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
