{"id":105970,"no":350,"title":"Page 350","content":"\u003cp\u003e“I don’t believe you.” Liath took one step toward Anne but seemed to fetch up against an unseen resistance, like a wall of air. Slowly, as against a heavy weight, she lifted her right hand, probing with the shaft; she narrowed her eyes. The gold feather gleamed.\u003c/p\u003e\n\u003cp\u003eThe hem of Anne’s robes caught on fire. Startled, Anne took a step back. Air swirled around her until it became a whirlwind, and the fire snuffed out.\u003c/p\u003e\n\u003cp\u003e“You remain under his spell,” said Anne harshly. “So I am left with no choice. ‘Nor will any wound inflicted by any creature male or female cause his death.’ Let God forgive us for trafficking with such evil creatures, but our cause is just.” She raised both arms. “Let the galla come and consume him and the child.”\u003c/p\u003e\n\u003cp\u003eBells tolled at his back, a throb that shuddered up through his feet. The stench of the forge boiled up the hill. The bitter scent made his skin tingle, as after the strike of lightning.\u003c/p\u003e\n\u003cp\u003eThe goat tied to Resuelto’s saddle, or its kid, made a sound so horrible that he actually shuddered, whipping around to brace for an attack. Blessing wailed as though something had bitten her.\u003c/p\u003e\n\u003cp\u003eThey were surrounded.\u003c/p\u003e\n\u003cp\u003eThese weren’t Anne’s captive daimones, feathery creatures formed out of air and water. Blessing’s wails turned to infant howls of pain and he felt a stinging, nasty burn pouring over his shoulders and a stab like razor-edged tusks goring his neck. He lunged toward Anne, thrusting with his sword.\u003c/p\u003e\n\u003cp\u003eShadows closed before and behind him, great columns of darkness shuddering and swaying in an unseen wind. They pressed against him, bodiless demons smothering him in their handless grasp. Their voice was the muttering of bells, and they whispered his name.\u003c/p\u003e\n\u003cp\u003e“Sanglant. Come to us, and you will find peace.”\u003c/p\u003e\n\u003cp\u003eWith all his might he pushed his shoulder hard into a shadow, thrusting the sword farther in, but the creature did not yield. Where his arm lay against it, a thousand needles of ice penetrated armor and flesh. Blood rose in pinpricks on his exposed hand, and he felt the warmth of drawn blood sting all along the length of his arm. He recoiled, only to press backward into a burning cold that impaled his back. Blessing screamed, the terror of a tiny child who can only know pain but nothing of its cause. He struck wildly to either side, to free himself, but his sword cut harmlessly through streaming shadow. He twisted, trying to keep his daughter out of their grip.\u003c/p\u003e\n\u003cp\u003eBut he was surrounded. Their huge forms towered over him, bending until he could no longer see the sky. The air swelled with stinging heat until he could barely breathe. Their touch scoured his head until he licked blood from his lips. Blood dribbling from gashes in his scalp and face trickled into his eyes, obscuring his vision. Mail did not protect him. Their bodiless touch reached right through his armor and rent his flesh. Blessing screamed and screamed.\u003c/p\u003e\n\u003cp\u003e“Call them off,” cried Liath from somewhere a long way away. He could see her because even through the black substance of their bodies, she shone. The shaft, cast aside, shone as well: the gold feather burned against the blackness and gave him light to see by. She had drawn her bow. She nocked an arrow, brushed a finger over the point—and the haft began to burn, flames licking up and down the length of it. She drew, sighted, and held there one instant as the galla swirled around her but did not close on her. He could no longer see Anne for blackness, but Liath could. Liath could hear Blessing’s screams. She loosed the arrow.\u003c/p\u003e\n\u003cp\u003eBlazing, it flew. And stopped, dead in the air, held aloft by the galla or by Anne’s daimones, he could not know. Distantly, although truly it could be no more than a few paces from him, he heard Resuelto bolt and clatter away into the trees.\u003c/p\u003e\n\u003cp\u003e“I’ll never aid you!” cried Liath. “Let them go free.”\u003c/p\u003e\n\u003cp\u003e“I will let them go free when you pledge your service to the Seven Sleepers,” said Anne coolly.\u003c/p\u003e\n\u003cp\u003eHe heard it as a lie and knew Anne would never allow him to live. But he had no breath in his lungs to tell Liath so. Ai, God, were the creatures even now tearing Blessing to pieces on his back?\u003c/p\u003e\n\u003cp\u003eHow had he come to be on his knees? He tried to lift his sword, to beat them off, but he no longer had any strength in his arms, and his vision was blurring.\u003c/p\u003e\n\u003cp\u003eBlessing’s screams continued unabated, a horrible counterpoint to the knell that throbbed in his ears and obliterated every other sensation until his head boomed with their voices, or maybe that was only his own dying pulse plangent in his ears.\u003c/p\u003e\n\u003cp\u003e“With us you will find peace, Sanglant.”\u003c/p\u003e\n\u003cp\u003eThe air hissed and spun around him. An arrow buried itself in the ground between his hands, and suddenly, winking free of darkness, he saw unshrouded sky above and twinkling stars. A second arrow struck the ground just beyond his left hand, spitting dirt, and another galla vanished, winked out with a sizzle. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-350.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
