{"id":105697,"no":68,"title":"Page 68","content":"\u003cp\u003e“Why does King Henry hate you?” she asked. He betrayed himself by glancing at Sanglant, and that caused her to look at him as well. “Do you know?” she asked, amazed.\u003c/p\u003e\n\u003cp\u003e“Of course I know.” The old story had long since ceased to stir in him anything more than a faint amusement. “He tried to drown me when I was an infant.”\u003c/p\u003e\n\u003cp\u003e“Is that true?” she demanded of Wolfhere.\u003c/p\u003e\n\u003cp\u003eHe merely nodded. He could no longer disguise his anger—the annoyance of a man whose quiet plans are rarely thwarted.\u003c/p\u003e\n\u003cp\u003e“Alas that he didn’t succeed,” added Sanglant, now beginning to be truly amused at Wolfhere’s sullen silence. “Then I wouldn’t have had to suffer through so many of his later attempts to convince me that I was part of a terrible plot contrived by my mother and her kin. ‘Who knows what will happen when the crown of stars crowns the heavens?’ If only I had known, perhaps I might not have been abandoned by my mother, her unwanted child. At least my father cared for me.”\u003c/p\u003e\n\u003cp\u003e“And will he care for you still, my lord prince,” asked Wolfhere in a harsh voice, “when you return with a bride not of his choosing?”\u003c/p\u003e\n\u003cp\u003eSanglant’s smile now was grim and sure, his voice steady. “I have other resources because I have made my reputation as a warrior. There are many princes in this world who would be happy to have me fight at their side, even at the risk of King Henry’s displeasure. I am no longer dragon—or pawn—to be used in your chess games, Wolfhere, nor in my father’s. I have left the board, and I will make my way with his blessing … or without it. So do I swear.”\u003c/p\u003e\n\u003cp\u003eWolfhere did not reply. Nor did Liath—or at least, not in words. Instead, she unpinned her Eagle’s cloak and rolled it up, then unclasped her Eagle’s badge and fastened it to the cloak.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she said, holding them out. “But I made this choice days ago, and in far stranger circumstances than these. My mother now knows where to find me.”\u003c/p\u003e\n\u003cp\u003e“This was not to be! It is not possible that you should cleave unto him!”\u003c/p\u003e\n\u003cp\u003e“Because you will it otherwise?” she demanded. “I refuse to be bound by the fate others have determined for me!”\u003c/p\u003e\n\u003cp\u003e“Liath!” Still he did not lean forward to take cloak and badge. “If you go with him, you will be without any support—”\u003c/p\u003e\n\u003cp\u003e“What other life do you think I have known? Da and I managed.”\u003c/p\u003e\n\u003cp\u003e“For a time.” Was his reply meant to be ominous, or was that only his frustration surfacing? He genuinely seemed to care about Liath’s fate. “Reflect on this, then. It is not only the cloak and badge I must take, but the horse. Provision was made for an Eagle, not for Sanglant’s concubine.”\u003c/p\u003e\n\u003cp\u003eShe smiled triumphantly. “Then it’s as well I have my own horse, isn’t it?” She dismounted, tied the cloak neatly onto the abandoned saddle, and removed the blanket roll. “This, too, is mine. It came to me as a gift from Mistress Birta.” She took the reins from Sanglant and offered them to Wolfhere, who did not yet move.\u003c/p\u003e\n\u003cp\u003e“What of the sword and bow?” he demanded instead.\u003c/p\u003e\n\u003cp\u003eHer expression did not change. The speed with which she had made her decision and the ruthlessness with which she now executed it impressed Sanglant—and made him a bit apprehensive. She began to unbuckle her belt to loose the sheath and thereby the sword.\u003c/p\u003e\n\u003cp\u003e“Nay,” said Wolfhere quickly. “I cannot leave you defenseless. If I have not persuaded you to come with me, then let that fault lie with me. You may change your mind.” Now he did take the reins, but he fixed his gaze on Liath’s face as if to peer into her heart. “You can still change your mind—” Here he winced slightly, as at a thorn in his foot. “—until and unless you get pregnant by him. Ai, God, why won’t you trust me? There are greater things than you know—”\u003c/p\u003e\n\u003cp\u003e“Then tell me what they are!”\u003c/p\u003e\n\u003cp\u003eBut he only glanced toward the tree where the owl had alighted.\u003c/p\u003e\n\u003cp\u003e“Here,” said Sanglant, trying very hard to speak steadily, although he wanted to shout with triumph, “I have two horses. The bay is more tractable.”\u003c/p\u003e\n\u003cp\u003e“Nay, let me only tighten the girth on Resuelto. I’ll ride him now.”\u003c/p\u003e\n\u003cp\u003eThey left Wolfhere on the road, still caught as if by an invisible hand in that pose with one hand on his own reins and one holding that of the horse Liath had ridden. Liath looked back once as they rounded a bend, heading north, to catch a last sight of him. Sanglant did not bother.\u003c/p\u003e\n\u003cp\u003eAt first they had nothing to say, simply rode with eyes intent on the darkening road as they followed the track back toward Ferse. Her breathing, the thud of horses’ hooves, and the scrabbling of the dogs as they padded alongside with occasional forays toward the roadside or nipping at each other all melded together with the shush of wind in the branches and the night sounds of animals coming awake. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-burning-stone-crown-of-stars-3/page-68.html","bookId":2014,"creation":"Oct 5, 2019 10:51:22 PM","modification":"Oct 5, 2019 10:51:22 PM"}
