{"id":97031,"no":46,"title":"Page 46","content":"\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. “I’d like to help the guy out. I don’t know very much, but there are things I can talk about to you that I’d just as soon not tell the police. Nothing illegal. Just…Well, you can figure it out.”\u003c/p\u003e\n\u003cp\u003eI could figure it out. That was the main reason why I had agreed to stay on the case for Donahue. People do not like to talk to the police if they can avoid it.\u003c/p\u003e\n\u003cp\u003eIf Phil Abeles was going to talk at all about Karen Price, he would prefer me as a listening post to Lieutenant Jerry Gunther.\u003c/p\u003e\n\u003cp\u003e“Here’s the place,” he said. I pulled up next to the chosen bar, a log-cabin arrangement.\u003c/p\u003e\n\u003cp\u003eAbeles had J\u0026amp;B with water and I ordered a pony of Courvoisier.\u003c/p\u003e\n\u003cp\u003e“I told that homicide lieutenant I didn’t know anything about the Price girl,” he said. “That wasn’t true.”\u003c/p\u003e\n\u003cp\u003e“Go on.”\u003c/p\u003e\n\u003cp\u003eHe hesitated, but just a moment. “I didn’t know she had anything going with Donahue,” he said. “Nobody ever thought of Karen in one-man terms. She slept around.”\u003c/p\u003e\n\u003cp\u003e“I gathered that.”\u003c/p\u003e\n\u003cp\u003e“It’s a funny thing,” he said. “A girl, not exactly a whore but not convent-bred either, can tend to pass around in a certain group of men. Karen was like that. She went for ad men. I think at one time or another she was intimate with half of Madison Avenue.”\u003c/p\u003e\n\u003cp\u003eSpeaks well of the dead, I thought. “For anyone in particular?” I asked.\u003c/p\u003e\n\u003cp\u003e“It’s hard to say. Probably for most of the fellows who were at the dinner last night. For Ray Powell—but that’s nothing new; he’s one of those bachelors who gets to everything in a skirt sooner or later. But for the married ones, too.”\u003c/p\u003e\n\u003cp\u003e“For you?”\u003c/p\u003e\n\u003cp\u003e“That’s a hell of a question.”\u003c/p\u003e\n\u003cp\u003e“Forget it. You already answered it.”\u003c/p\u003e\n\u003cp\u003eHe grinned sourly. “Yes”—he lapsed into flippant Madison Avenue talk—“the Price was right.” He sipped his drink, then continued. “Not recently, and not often. Two or three times over two months ago. You won’t blackmail me now, will you?”\u003c/p\u003e\n\u003cp\u003e“I don’t play that way.” I thought a minute. “Would Karen Price have tried a little subtle blackmail?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. She played pretty fair.”\u003c/p\u003e\n\u003cp\u003e“Was she the type to fall in love with somebody like Donahue?”\u003c/p\u003e\n\u003cp\u003eAbeles scratched his head. “The story I heard,” he said. “Something to the effect that she was calling him, threatening him, trying to head off his marriage.”\u003c/p\u003e\n\u003cp\u003eI nodded. “That’s why he hired me.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t make much sense.”\u003c/p\u003e\n\u003cp\u003e“No?”\u003c/p\u003e\n\u003cp\u003e“No. It doesn’t fit in with what I know about Karen. She wasn’t the torch-bearer type. And she was hardly making a steady thing with Mark, either. I may not have known he was sleeping with her, but I knew damn well that a lot of other guys had been making with her lately.”\u003c/p\u003e\n\u003cp\u003e“Could she have been shaking him down?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I told you,” he said. “It doesn’t sound like her. But who knows? She might have gotten into financial trouble. It happens. Perhaps she’d try to milk somebody for a little money.” He pursed his lips. “But why should she blackmail Mark, for heaven’s sake? If she blackmailed a bachelor he could always tell her to go to hell. You’d think she would work that on a married man, not a bachelor.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eHe started to laugh then. “But not me,” he said. “Believe me, London. She didn’t blackmail me and I didn’t kill her.”\u003c/p\u003e\n\u003cp\u003eI got a list from him of all the men at the dinner. In addition to Donahue and myself, there had been eight men present, all of them from Darcy \u0026amp; Bates. Four—Abeles, Jack Harris, Harold Merriman, and Joe Conn—were married. One—Ray Powell—was the bachelor and stud-about-town of the group, almost a compulsive Don Juan, according to Abeles. Another, Fred Klein, had a wife waiting out a residency requirement in Reno.\u003c/p\u003e\n\u003cp\u003eThe remaining two wouldn’t have much to do with girls like Karen Price. Lloyd Travers and Kenneth Bream were as queer as rectangular eggs.\u003c/p\u003e\n\u003cp\u003eI drove Abeles back to his house. Before I let him off he told me again not to waste time suspecting him.\u003c/p\u003e\n\u003cp\u003e“One thing you might remember,” I said. “Somebody in that room shot Karen Price. Either Mark or one of the eight of you…I don’t think it was Mark.” I paused. “That means there’s a murderer in your office, Abeles!”\u003c/p\u003e\n\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eIt was late enough in the day to call Lieutenant Gunther. I tried him at home first. His wife answered, told me he was at the station. I tried him there and caught him.\u003c/p\u003e\n\u003cp\u003e“Nice hours you work, Jerry.”\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t have anything else on today. So I came on down. You know how it is…Say, I got news for you, Ed.”\u003c/p\u003e\n\u003cp\u003e“About Donahue?”\u003c/p\u003e\n\u003cp\u003e“Yes. We let him go.”\u003c/p\u003e\n\u003cp\u003e“He’s clear?”\u003c/p\u003e\n\u003cp\u003e“No, not clear.” Jerry grunted. “We could have held him but there was no point, Ed. He’s not clear, not by a mile. But we ran a check on the Price kid and learned she’s been sleeping with two parties—Democrats and Republicans. Practically everyone at the stag. So there’s nothing that makes your boy look too much more suspicious than the others.”\u003c/p\u003e\n\u003cp\u003e“I found out the same thing this afternoon.”\u003c/p\u003e\n\u003cp\u003e“Ed, I wasn’t too crazy about letting him get away. Donahue still looks like the killer from where I sit. He hired you because the girl was giving him trouble. She wasn’t giving anybody else trouble. He looks like the closest thing to a suspect around.”\u003c/p\u003e\n\u003cp\u003e“Then why release him?”\u003c/p\u003e\n\u003cp\u003eI could picture Jerry’s shrug. “Well, there was pressure,” he said. “The guy got himself an expensive lawyer and the lawyer was getting ready to pull a couple of strings. That’s not all, of course. Donahue isn’t a criminal type, Ed. He’s not going to run far. We let him go, figuring we won’t have much trouble picking him up again.”\u003c/p\u003e\n\u003cp\u003e“Maybe you won’t have to.”\u003c/p\u003e\n\u003cp\u003e“You get anything yet, Ed?”\u003c/p\u003e\n\u003cp\u003e“Not much,” I said. “Just enough to figure out that everything’s mixed up.”\u003c/p\u003e\n\u003cp\u003e“I already knew that.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. But the more I hunt around, the more loose ends I find. I’m glad you boys let my client loose. I’m going to see if I can get hold of him.”\u003c/p\u003e\n\u003cp\u003e“Bye,” Jerry said, clicking off.\u003c/p\u003e\n\u003cp\u003eI took time to get a pipe going, then dialed Mark Donahue’s number. The phone rang eight times before I gave up. I decided he must be out on Long Island with Lynn Farwell. I was halfway through the complicated process of prying a number out of the information operator when I decided not to bother. Donahue had my number. He could reach me when he got the chance.\u003c/p\u003e\n\u003cp\u003eThen I closed my eyes, gritted my teeth, and tried to think straight.\u003c/p\u003e\n\u003cp\u003eIt wasn’t easy. So far I had managed one little trick—I had succeeded in convincing myself that Donahue had not killed the girl. But this wasn’t much cause for celebration. When you’re working for someone, it’s easy to get yourself to thinking that your client is on the side of the angels.\u003c/p\u003e\n\u003cp\u003eFirst of all, the girl. Karen Price. According to all and sundry, she was something of a tramp. According to her roommate she didn’t put a price tag on it—but she didn’t keep it under lock and key, either. She had wound up in bed with most of the heterosexual ad men on Madison Avenue. Donahue, a member of this clan, had been sleeping with her.\u003c/p\u003e\n\u003cp\u003eThis didn’t mean she was in love with him, or carrying a flaming torch, or singing the blues, or issuing dire threats concerning his upcoming marriage. According to everyone who knew Karen, there was no reason for her to give a whoop in hell whether he got married, turned queer, became an astronaut, or joined the Foreign Legion.\u003c/p\u003e\n\u003cp\u003eBut Donahue said he had received threatening calls from her. That left two possibilities. One: Donahue was lying. Two: Donahue was telling the truth.\u003c/p\u003e\n\u003cp\u003eIf he was lying, why in hell had he hired me as a bodyguard? And if he had some other reason to want the girl dead, he wouldn’t need me along for fun and games. Hell, if he hadn’t gone through the business of hiring me, no one could have tagged him as the prime suspect in the shooting. He would just be another person at the bachelor dinner, another former playmate of Karen’s with no more motive to kill her than anyone else at the party.\u003c/p\u003e\n\u003cp\u003eI gave up the brainwork and concentrated on harmless if time-consuming games. I sat at my desk and drew up a list of the eight men who had been at the dinner. I listed the four married men, the Don Juan, the incipient divorcé and, just for the sake of completion, Lloyd and Kenneth. I worked on my silly little list for over an hour, creating mythical motives for each man.\u003c/p\u003e\n\u003cp\u003eIt made an interesting mental exercise, although it didn’t seem to be of much value.\u003c/p\u003e\n\u003cp\u003eSIX\u003c/p\u003e\n\u003cp\u003eThe Alhambra is a Syrian restaurant on West 27th Street, an Arabian oasis in a desert of Greek nightclubs. Off the beaten track, it doesn’t advertise, and the sign announcing its presence is almost invisible. You have to know the Alhambra is there in order to find it.\u003c/p\u003e\n\u003cp\u003eThe owner and maitre d’ is a little man whom the customers call Kamil. His name is Louis, his parents brought him to America before his eyes were open, and one of his brothers is a full professor at Columbia, but he likes to put on an act. When I brought Ceil Gorski into the place around 8:30, he smiled hugely at me and bowed halfway to the floor.\u003c/p\u003e\n\u003cp\u003e“Salaam alekhim,” he said solemnly. “My pleasure, Mist’ London.”\u003c/p\u003e\n\u003cp\u003e“Alekhim salaam,” I intoned, glancing over at Ceil while Louis showed us to a table.\u003c/p\u003e\n\u003cp\u003eOur waiter brought a bottle of very sweet white wine to go with the entrée.\u003c/p\u003e\n\u003cp\u003e“I was bitchy before. I’m sorry about it.”\u003c/p\u003e\n\u003cp\u003e“Forget it.”\u003c/p\u003e\n\u003cp\u003e“Ed—”\u003c/p\u003e\n\u003cp\u003eI looked at her. She was worth looking at in a pale green dress which she filled to perfection.\u003c/p\u003e\n\u003cp\u003e“You want to ask me some questions,” she said, “don’t you?”\u003c/p\u003e\n\u003cp\u003e“Well—”\u003c/p\u003e\n\u003cp\u003e“I don’t mind, Ed.”\u003c/p\u003e\n\u003cp\u003eI gave her a brief run-down on the way things seemed to shape up at that point.\u003c/p\u003e\n\u003cp\u003e“Let me try some names on you,” I suggested. “Maybe you can tell me whether Karen mentioned them.”\u003c/p\u003e\n\u003cp\u003e“You can try.”\u003c/p\u003e\n\u003cp\u003eI ran through the eight jokers who had been at the stag. A few sounded vaguely familiar to her, but one of them, Ray Powell, turned out to be someone Ceil knew personally.\u003c/p\u003e\n\u003cp\u003e“A chaser,” she said. “A very plush East Side apartment and an appetite for women that never lets up. He used to see Karen now and then, but there couldn’t have been anything serious.”\u003c/p\u003e\n\u003cp\u003e“You know him—very well?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She colored suddenly. She was not the sort you expected to blush. “If you mean intimately, no. He asked often enough. I wasn’t interested.” She lowered her eyes. “I don’t sleep around that much,” she said. “Karen—well, she came to New York with stars in her eyes, and when the stars dimmed and died, she went a little crazy, I suppose. I wasn’t that ambitious and didn’t fall as hard. I have some fairly far-out ways of earning a living, Ed, but most nights I sleep alone.” \u003c/p\u003e","sourceLink":"https://allnovel.net/one-night-stands-and-lost-weekends/page-46.html","bookId":2318,"creation":"Oct 5, 2019 6:24:25 PM","modification":"Oct 5, 2019 6:24:25 PM"}
